{"wiki_id": "http://www.wikidata.org/entity/Q6770107", "itemLabel": "Mark Tyler", "itemDescription": "British footballer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Tyler_(footballer)", "wikipedia_page": {"main": "Mark Richard Tyler (born 2 April 1977) is an English former professional footballer who played as a goalkeeper. He is currently goalkeeping coach at EFL Championship club Peterborough United. He played for the England national under-17 team and the England national under-20 team.", "link_mentions": [{"page": "Peterborough United F.C.", "response": ["* Goalkeeping Coach: Mark Tyler"]}, {"page": "Kevin Pilkington", "response": ["He started the 2008–09 season as second choice keeper behind Russell Hoult. Following an injury to Hoult, Pilkington made 26 appearances as his club struggled yet again. The ten points that Notts County finished above 23rd-place Chester City concealed the fact that, without point deductions for other teams, the \"Magpies\" would once again have finished six points above the relegation zone. After a takeover at County in the summer of 2009, Pilkington found himself out in the cold as third choice goalkeeper behind new signing Kasper Schmeichel and, once again, Russell Hoult. On 12 November 2009, he signed on a one-month loan for Conference Premier side Luton Town, later extended for a further month on 17 December, acting as cover for the injured Mark Tyler. He returned to Notts County after suffering an injury of his own in a 3–2 loss to Ebbsfleet United on 30 January 2010. On 10 May 2010, it was announced that he had been released by Notts County along with seven other players.", "Ten days later, Pilkington signed for his previous loan club Luton Town on a permanent one-year contract. He made two starts at the beginning of the 2010–11 season, before losing his place in the team to Mark Tyler. Pilkington joined former club Mansfield Town on a three-month loan on 28 October 2010. He returned to Luton on 28 January 2011 having made 11 appearances in all competitions for Mansfield. At the end of the season, Pilkington signed a one-year contract extension to stay at Luton until June 2012."]}, {"page": "Chris Carruthers", "response": ["He picked up an ankle injury seven minutes into a 2–1 home defeat to Salisbury City on 9 March 2010, and made his return in a 1–1 home draw with Tamworth on 27 March. He played in both legs of York's play-off semi-final victory over Luton, which finished 2–0 on aggregate, and scored the goal in the 1–0 away win in the second leg with a clipped shot from three yards after goalkeeper Mark Tyler parried Rankine's free kick. Following the match, he was hit by a coin with the York squad being forced to leave the ground through the back of a stand after having missiles thrown at them by a section of Luton fans. He started in the 2010 Conference Premier play-off Final at Wembley Stadium on 16 May, being substituted on 74 minutes, as York lost 3–1 to Oxford. He finished the season with 39 appearances and 3 goals for York."]}, {"page": "Paul Rachubka", "response": ["Rachubka was sent on loan to Peterborough United as cover for Mark Tyler and played four League Two matches over the Christmas and New Year period of 2006–07."]}, {"page": "John Still (footballer)", "response": ["In August 1994, Still accepted the manager's role at recently relegated Second Division club Peterborough United. In his first season in charge, Still led the club to a 15th-placed finish. He was sacked by the club on 24 October 1995 after winning only three of Peterborough's first 13 league matches of 1995–96. While at Peterborough, he gave debuts to players such as Adam Drury, Giuliano Grazioli and Mark Tyler."]}, {"page": "Luke McShane (footballer)", "response": ["McShane started his career at Peterborough United and also had loan spells at Deeping Rangers, Stamford, Hornchurch, twice at Kettering Town, twice at Gravesend & Northfleet, Basingstoke Town and Worksop Town. He plays as a goalkeeper. On 12 March 2007 McShane was released by Peterborough United, after making one FA Cup appearance, a 2–0 win against MK Dons, earning praise from Posh manager Barry Fry after keeping a clean sheet, McShane was called into action just 10 minutes before kickoff due to a back injury that first choice 'keeper Mark Tyler had suffered in pre-match training. He was linked a group of non-league clubs after his release from Peterborough."]}, {"page": "Mark Tyler", "response": ["Mark Tyler may refer to:", "* Mark Tyler (footballer) (born 1977), English football player", "* Mark Tyler, New Zealand musician and part of Salmonella Dub", "* Mark Tyler, mayor of Kirtland, Ohio"]}, {"page": "Mark Tyler (sportsman)", "response": ["#REDIRECT Mark Tyler (footballer)"]}, {"page": "2006–07 Huddersfield Town A.F.C. season", "response": ["Paul Rachubka was taken on loan to Peterborough United as cover for Mark Tyler and played four League 2 matches over Christmas/New Year 2006–07."]}, {"page": "János Kovács", "response": ["After being transfer listed at the start of the 2011–12 season, Kovács joined former club Luton Town on an emergency one-month loan on 19 September 2011 during a period when the majority of the Luton defence had picked up injuries or suspensions. This loan was then extended until 1 January 2012. He was released by Hereford on 2 January 2012, signing permanently for Luton on a one-and-a-half-year contract. On Kovács signing a permanent contract Luton manager Gary Brabin said \"János has been a rock at the back for us since joining us again. His performances have been fantastic and he has had an unbelievably positive effect on the team on and off the pitch.\" He made 44 appearances and scored 4 goals over the season for Luton, and won the Player of the Year Award for his performances. Kovács was also named in the 2011–12 Conference Premier Team of the Year alongside Luton teammate Mark Tyler. Manager John Still confirmed Kovács would be released at the end of the 2012–13 season, in which the player made 30 appearances and scored three goals."]}, {"page": "Chris Dagnall", "response": ["Dagnall was born in Liverpool and played for Tranmere Rovers from the age of 13 as a trainee. On 13 September 2003, at the age of 17, he was included in a matchday squad for the first time by manager Ray Mathias, coming on as a late substitute for Ryan Taylor in a goalless Second Division match against Peterborough United at Prenton Park, and had a 20-yard shot saved by their goalkeeper Mark Tyler. He went on to make 10 league appearances and one League Cup appearance, and scored his first career goal by equalising in a 3–1 away defeat to Luton Town on 6 October. Tranmere narrowly missed out on the play-offs, finishing in eighth place."]}, {"page": "Kieron St Aimie", "response": ["St Aimie scored his first goal three games into the season on 18 August 2012 against Braintree Town, scoring the 2nd goal of the game on 18 minutes, slotting home Steven Leslie's flick-on from Luke Hubbins' right wing cross, Telford went on to a 3–0 victory. On 25 August 2012 he scored a decisive goal four minutes before half time at Luton Town, Steven Leslie's perfectly placed free-kick for St Aimie to head home past Mark Tyler. Two days later he scored a 56th-minute equaliser against Stockport County, good work from Luke Hubbins playing a couple of one-two's with Steven Leslie to slide the ball across for St Aimie to sidefoot home from close range, the game finishing a 2–2 stalemate. On 1 September 2012, he scored the 3rd and final goal of the game, a powerful header in the 57th minute from Steven Leslie's right-wing corner, to make it 0–3 away at Southport."]}, {"page": "2007–08 Peterborough United F.C. season", "response": ["|Mark Tyler"]}, {"page": "2006–07 Peterborough United F.C. season", "response": ["|Mark Tyler"]}, {"page": "Tyler (name)", "response": ["*Mark Tyler (born 1977), former English professional footballer"]}, {"page": "2008–09 Luton Town F.C. season", "response": ["On 15 June, the request to defend the Football League Trophy title was turned down. Experienced goalkeeper Mark Tyler signed a two-year deal two years later.", "| 17 June 2009 ||  Mark Tyler || style=\"text-align:center;\" colspan=\"2\"| Unattached || style=\"text-align:center;\"|"]}]}}