{"wiki_id": "http://www.wikidata.org/entity/Q6778952", "itemLabel": "Mary Anne Schimmelpenninck", "itemDescription": "British writer and activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Anne_Schimmelpenninck", "wikipedia_page": {"main": "Mary Anne Schimmelpenninck (née Galton, 25 November 1778 – 29 August 1856) was a British writer in the anti-slavery movement.\n\n", "link_mentions": [{"page": "August 29", "response": ["*1856 – Mary Anne Schimmelpenninck, English author and activist (b. 1778)"]}, {"page": "Lunar Society of Birmingham", "response": ["Several other major new figures became associated with the society during this period. Samuel Galton, Jr., unusual as a Quaker who was also a gun-manufacturer, appears in the letters of other Lunar members as attending meetings from July 1781, and his daughter Mary Anne Schimmelpenninck was to provide one of the few first-hand accounts of the Lunar Society's activities. The botanist and physician Jonathan Stokes, who had known William Withering as a child, moved to Stourbridge and started attending Lunar Society meetings from 1783. His contribution to the society was significant but short-lived: after collaborating with Withering on his Botanical Arrangement of British Plants the two quarrelled bitterly and Stokes severed his relations with the main Lunar members by 1788."]}, {"page": "November 25", "response": ["*1778 – Mary Anne Schimmelpenninck, English author and activist (d. 1856)"]}, {"page": "1856", "response": ["* August 29 – Mary Anne Schimmelpenninck, British Christian writer (b. 1778)"]}, {"page": "1778", "response": ["** Mary Anne Schimmelpenninck, British abolitionist (d. 1856)"]}, {"page": "List of people from Birmingham", "response": ["*Mary Anne Schimmelpenninck – Author on Women in society and religion, slavery abolitionist"]}, {"page": "Five Ways, Birmingham", "response": ["The name of Five Ways dates back to 1565, when roads leading to Harborne and Halesowen were recorded as being located there.British History Online: Communications Mary Anne Schimmelpenninck, who lived at Five Ways until 1785, describes the origins of its name as a result of the location being the junction of five roadways."]}, {"page": "Mary Anne Galton", "response": ["#REDIRECT Mary Anne Schimmelpenninck"]}, {"page": "Schimmelpenninck", "response": ["* Mary Anne Schimmelpenninck (1778–1856), British writer in the anti-slavery movement"]}, {"page": "James Sherman (minister)", "response": ["Sherman entered, on 6 November 1815, the Countess of Huntingdon's Cheshunt College. He preached his first sermon in London in Hare Court chapel, Aldersgate Street, in 1817, and on 26 Nov. 1818 he was ordained to the ministry in Sion Chapel, Whitechapel. After preaching for some time in the Countess of Huntingdon's chapel at Bath, Somerset, he was appointed permanent minister of her chapel at Bristol, where he made the acquaintance of Hannah More and of Mary Anne Schimmelpenninck. In April 1821 he moved to Castle Street chapel, Reading, Berkshire."]}, {"page": "1778 in Great Britain", "response": ["** Mary Anne Schimmelpenninck, Christian writer (died 1856)"]}, {"page": "1856 in the United Kingdom", "response": ["* 29 August – Mary Anne Schimmelpenninck, Christian writer (born 1778)"]}, {"page": "John Horwood", "response": ["The trial took place at The Star Inn in Bedminster on 11 April 1821, with Smith testifying against him. The prosecution included a phrenological report undertaken by Mary Anne SchimmelpenninckSmith MD, G. Munro, A History of the Bristol Royal Infirmary, 1917 to attempt to prove Horwood's guilt by the shape of his skull. This claimed that his chief mental characteristics were 'combativeness', 'self-esteem', and 'hope', however the 'bump of murder' which was supposedly a cranial characteristic of all murderers was not present.Smith, Richard, The Horwood Book, Bristol Archives reference number: 35893/36/V_i, The strongest point in Horwood's defence was that the abscess on the brain might have been caused by the unclean dressings on the wound, and not directly by the stone attack though it would appear that this evidence was never put forward."]}, {"page": "Mary Ann Galton", "response": ["#REDIRECT Mary Anne Schimmelpenninck"]}, {"page": "Lucy Lyttelton Cameron", "response": ["Through her family's connection to Gerrard Andrewes, who by 1802 was vicar of St James's Church, Piccadilly, Lucy was introduced to London cultural figures such as the Bluestocking Elizabeth Carter and Humphry Davy, the inventor. In Bristol she met writers Hannah More and Mary Anne Schimmelpenninck.(1886). \"Cameron, Lucy Lyttelton (DNB00)\". In Stephen, Leslie. Dictionary of National Biography 08. London: Smith, Elder & Co "]}, {"page": "Galton (name)", "response": ["* Mary Anne Schimmelpenninck (née Galton, 1778–1856), British writer in the anti-slavery movement"]}]}}