{"wiki_id": "http://www.wikidata.org/entity/Q6776676", "itemLabel": "Martin Stevens", "itemDescription": "British politician (1929-1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Stevens_(politician)", "wikipedia_page": {"main": "Martin Stevens (31 July 1929 – 10 January 1986) was a British Conservative Party politician.\n\nStevens was educated at Orley Farm School, Bradfield College and Trinity College, Oxford, and was a company director.  He served as a member of the London County Council from 1955 to 1958 and a councillor on Camberwell Borough Council from 1959 to 1965.\nStevens contested Dulwich in 1964 and 1966.  He became a Member of Parliament for Fulham in 1979 when he gained the seat from Labour. Stevens held Fulham until his death in 1986 aged 56. Labour's Nick Raynsford gained his seat in the following by-election, although it was regained by the Conservatives in 1987.\nHe was openly gay and was a member of the Campaign for Homosexual Equality.", "link_mentions": [{"page": "Fulham", "response": ["Fulham has in the past been solid Labour territory. Michael Stewart, one time Foreign Secretary in the Wilson government, was its long-standing MP. It became a politically significant part of the country, having been the scene of two major parliamentary by-elections in the 20th century. In 1933, the Fulham East by-election became known as the \"peace by-election\". The 1986 by-election following the death of Conservative MP, Martin Stevens, resulted in a Labour win for Nick Raynsford on a 10% swing."]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Martin Stevens"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Martin Stevens"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Martin Stevens"]}, {"page": "Orley Farm School", "response": ["*Martin Stevens, former MP and Conservative politician"]}, {"page": "Leo Abse", "response": ["Abse added to his reputation for taking maverick stances by strongly urging that British forces be withdrawn from Northern Ireland. He opposed nuclear power and nuclear weapons, and criticised Margaret Thatcher for insisting that Argentina unconditionally surrender over the Falkland Islands. He supported British membership of the European Communities. His support for liberal divorce laws led him to propose a new 'child-centred' divorce reform in the early 1980s; the bill was piloted by Martin Stevens, Conservative MP for Fulham."]}, {"page": "Albany (London)", "response": ["* Martin Stevens, politician, MP for Fulham."]}, {"page": "Fulham (UK Parliament constituency)", "response": ["| Martin Stevens"]}, {"page": "1986 Fulham by-election", "response": ["The Fulham by-election, in Fulham, on 10 April 1986 was held following the death of the Conservative Member of Parliament (MP) Martin Stevens on 10 January that year. In a seat that had changed hands on a few occasions, it was won by Nick Raynsford of Labour, only to be regained by the Tories in the general election 14 months later."]}, {"page": "List of University of Oxford people in British public life", "response": ["| Martin Stevens"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Martin Stevens"]}, {"page": "Fulham Power Station", "response": ["Conservative MP Martin Stevens, whose Fulham constituency included the power station, told the House that the CEGB had not told the London Borough of Hammersmith and Fulham it had sold the power station and had no statutory obligation to do so. The borough had immediately started monitoring asbestos in the atmosphere. On one occasion asbestos removal had been ordered to stop when it exceeded safe limits, but the Health and Safety Executive had to give the order as borough environmental health officers had no statutory powers concerning asbestos. Stevens also noted that the borough, not the contractor, was paying the £20,000 per month cost of this monitoring, and to do so for a year would equate to 1% of the Borough's income from local rates.", "Gummer stated that the Control of Pollution Act 1974 (COPA) required asbestos to be double-bagged to minimise the risk of contamination or spillage, and that this was monitored. However, Martin Stevens intervened stating that the contractor had not double-bagged asbestos waste at Fulham, to which Gummer replied that it for the HSE to decide if one bag would suffice."]}, {"page": "List of Trinity College, Oxford people", "response": ["* Martin Stevens"]}, {"page": "List of Old Bradfieldians", "response": ["*Martin Stevens (1929-1986), British Conservative Party politician"]}, {"page": "List of LGBT politicians in the United Kingdom", "response": ["|Martin Stevens"]}, {"page": "Martin Stevens", "response": ["Martin Stevens may refer to:", "* Martin Stevens (politician) (1929–1986), British politician", "* Martin Stevens (musician) (born 1953), Canadian pop singer", "* Martin Stevens (biologist) (fl. 2000s–2010s), British sensory and evolutionary ecologist"]}]}}