{"wiki_id": "http://www.wikidata.org/entity/Q6777659", "itemLabel": "Martyn Margetson", "itemDescription": "Welsh footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martyn_Margetson", "wikipedia_page": {"main": "Martyn Walter Margetson (born 8 September 1971) is a Welsh football coach and former professional footballer who is a goalkeeping coach for the England national team.\nA youth player at Manchester City, where he went on to appear over 50 times, he spent time on loan at Bristol Rovers, Bolton Wanderers and Luton Town before moving to Southend United on a permanent basis in 1998 where he remained for one season, joining Huddersfield Town in 1999. After signing for Cardiff City in 2002, he went on to win his first and only cap for Wales in a friendly with Canada in May 2004. \nHe retired from playing at the end of the 2006–07 season, becoming a full-time goalkeeper coach at Cardiff City. He has since had similar roles at West Ham United, Wales, Crystal Palace and Swansea City.", "link_mentions": [{"page": "England national football team", "response": ["|  Martyn Margetson"]}, {"page": "Neil Alexander", "response": ["After suffering a play-off defeat during his first season at Ninian Park, in Alexander's second, Cardiff again reached the play-offs, meeting Severnside rivals Bristol City. Alexander kept clean sheets in both legs of the play-off semi-final, making his 100th appearance in all competitions for the Bluebirds during the second leg, earning plaudits for his performances which were described as \"faultless\". The club went on to achieve promotion by winning the 2003 Football League Second Division play-off Final against Queens Park Rangers following Andy Campbell's extra-time winner. During his time at Cardiff, Alexander became a fan favourite, despite nearly leaving the club midway through his six-year spell after falling behind Martyn Margetson and Tony Warner following their promotion to the First Division under manager Lennie Lawrence. However, he later regained his position in the first-team and was ever present for the club during the 2005–06 season, playing in all 46 league matches, which lead to him being awarded the club's most improved player award."]}, {"page": "John Robinson (footballer, born 1971)", "response": ["After leaving football, Robinson set up a property business with former Cardiff teammate Martyn Margetson and also runs his own football training school."]}, {"page": "Andy Dibble", "response": ["He moved on to Manchester City in July 1988 for a £240,000 fee (2009: £). His time at City was interrupted by injuries, and despite being virtually ever-present during his first two seasons, subsequently found himself second choice behind Tony Coton and arguably even third choice when youngster Martyn Margetson broke through onto the senior scene. Dibble was loaned out to several teams (namely Aberdeen, Middlesbrough, Bolton Wanderers, West Bromwich Albion and Sheffield United), and only very rarely played first team football for the Manchester team after his first two seasons."]}, {"page": "1971 in Wales", "response": ["*8 September - Martyn Margetson, footballer"]}, {"page": "2007–08 Cardiff City F.C. season", "response": ["| Martyn Margetson"]}, {"page": "David Watson (footballer, born 1973)", "response": ["While in this position, Watson built a reputation as an excellent coach, praised for enhancing the careers of England goalkeepers Joe Hart, Ben Foster and Jack Butland, experience that encouraged new manager Roy Hodgson to invite him to work alongside Ray Clemence with the England team at Euro 2012. Watson remained as England's goalkeeping coach for four years, and was prepared to stay on after Hodgson and the rest of his staff left following the poor performance at Euro 2016, but Hodgson's successor Sam Allardyce replaced him with Martyn Margetson."]}, {"page": "2001–02 Huddersfield Town A.F.C. season", "response": ["|13||Martyn Margetson||||GK||46||0||2||0||1||0||6||0||2||0||57||0"]}, {"page": "2008–09 Cardiff City F.C. season", "response": ["* Goalkeeping coach: Martyn Margetson"]}, {"page": "2000–01 Huddersfield Town A.F.C. season", "response": ["|13||Martyn Margetson||||GK||1 (1)||0||0||0||0||0||1 (1)||0"]}, {"page": "2006–07 Cardiff City F.C. season", "response": ["|23||Martyn Margetson||GK||||Neath||||41||0||Huddersfield Town||3 August 2002||Free||2007"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Martyn Margetson||||1999–2002||47 (1)||0||2||0||1||0||6||0||2||0||58 (1)||0"]}, {"page": "2009–10 Cardiff City F.C. season", "response": ["|Martyn Margetson"]}, {"page": "2003 Football League Second Division play-off Final", "response": ["|GK ||13 ||Martyn Margetson "]}, {"page": "2010–11 Cardiff City F.C. season", "response": ["| Martyn Margetson"]}, {"page": "Adrián (footballer)", "response": ["Having been watched playing for Betis by West Ham United manager Sam Allardyce and goalkeeping coach Martyn Margetson, Adrián was persuaded to join the club. On 5 June 2013, it was announced he would sign a three-year contract on 1 July, with the Premier League club having the option to extend this deal for a further two seasons."]}, {"page": "2011–12 Cardiff City F.C. season", "response": ["At the end of the 2010–11 season, following a second consecutive defeat in the play-offs, manager Dave Jones was sacked from his position after an end of season review into the club's performance. At the time of his departure, Jones was the longest serving manager in the Championship having held his post since May 2005. The club held talks with former England and Newcastle United captain Alan Shearer to replace Jones but he rejected the job despite stating that he was impressed with the \"vision, ambition and determination of the owner Dato Chan Tien Ghee and the board\". The Bluebirds instead approached Championship rivals Watford for permission to speak to their manager Malky Mackay, which was initially rejected. However, after the two clubs agreed a compensation fee, Mackay was officially appointed as Dave Jones' replacement on 17 June on a three-year contract. Mackay set about reshaping his coaching staff, allowing assistant manager Terry Burton, first-team coach Paul Wilkinson and fitness coach Alex Armstrong to leave the club, before appointing David Kerslake, Joe McBride and Richard Collinge as their replacements. Goalkeeping coach Martyn Margetson later also left the club to take up the same position at Premier League side West Ham United. Cardiff also appointed Mackay's former Watford colleague Iain Moody as their new head of recruitment."]}, {"page": "Margetson", "response": ["*Martyn Margetson (born 1971), Welsh former professional footballer and Wales international"]}, {"page": "Martyn (given name)", "response": ["*Martyn Margetson (born 1971), Welsh professional footballer"]}, {"page": "2014–15 Cardiff City F.C. season", "response": ["|Goalkeeper Coach ||  Martyn Margetson"]}, {"page": "2015–16 Cardiff City F.C. season", "response": ["|Goalkeeper Coach ||  Martyn Margetson"]}, {"page": "2019–20 Swansea City A.F.C. season", "response": ["|  Martyn Margetson"]}, {"page": "1998–99 Southend United F.C. season", "response": ["|align=\"left\"|GK||align=\"left\"| Martyn Margetson"]}]}}