{"wiki_id": "http://www.wikidata.org/entity/Q6776918", "itemLabel": "Martin Wright", "itemDescription": "British bioengineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Wright_(bioengineer)", "wikipedia_page": {"main": "Basil Martin Wright (20 December 1912 – 4 March 2001) was a British bioengineer who invented several notable medical instruments, including the peak flow meter and syringe driver. The \"alcolmeter\" he developed won a Queen's Award for Industry and is the breathalyser most often used at the road-side in the United Kingdom.", "link_mentions": [{"page": "Peak expiratory flow", "response": ["The measurement of peak expiratory flow was pioneered by Martin Wright, who produced the first meter specifically designed to measure this index of lung function. Since the original design of instrument was introduced in the late 1950s, and the subsequent development of a more portable, lower cost version (the \"Mini-Wright\" peak flow meter), other designs and copies have become available across the world."]}, {"page": "List of English inventions and discoveries", "response": ["* Late 1950s: Peak Flow Meter invented by Martin Wright (1912–2001), also the creator of the Syringe Driver."]}, {"page": "List of Old Wykehamists", "response": ["*  Basil Martin Wright, inventor of the Peak flow meter"]}, {"page": "Martin Wright", "response": ["Martin Wright may refer to:", "* Martin Wright (bobsledder) (born 1974), British competitor at the 2006 Winter Olympics", "* Martin Wright (cricketer, born 1934), former Norfolk cricketer", "* Martin Wright (cricketer, born 1963), former Hertfordshire cricketer", "* Martin Wright (bioengineer) (1912–2001), British bioengineer ", "* Martin Wright (conductor) (born 1955), American conductor"]}, {"page": "Basil Martin Wright", "response": ["#REDIRECT Martin Wright (bioengineer)"]}, {"page": "Adjustable-focus eyeglasses", "response": ["Early work on opto-mechanical methods was done by Martin Wright.US Patent 3,598,479 and Trans Ophthal Soc UK (1978) 98, 84  Opto-mechanical spectacles allow focus control by the wearer via movement of a small slider located on top of the bridge.  The user adjusts the lens for optical clarity at the desired distance.*Focusspecs – appears to be an example of this  They are a combination of rigid and flexible lenses that can change prescription to enable sharp focus at different distances (from infinity up to 13\"). The appropriate addition range depends on the user’s level of refractive error.  A tiny mechanism, actuated by the slider, simultaneously controls both flexible lenses to assure appropriate near vision tracking in both eyes."]}, {"page": "BM Wright", "response": ["#REDIRECT Martin Wright (bioengineer)"]}, {"page": "B.M. Wright", "response": ["#REDIRECT Martin Wright (bioengineer)"]}]}}