{"wiki_id": "http://www.wikidata.org/entity/Q6779488", "itemLabel": "Mary Epworth", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Epworth", "wikipedia_page": {"main": "Mary Epworth is an English singer, songwriter, and composer.\nIn 2012, Epworth released her debut album, Dream Life. The album received much acclaim, with Q calling it \"Psych pop splendour [...] Experimentalism, melody and narrative co-existing in appealing balance\", and Record Collector awarding the album five stars, and saying \"A work of bracing originality [...] Immaculately sung and graced throughout with intelligent, song-serving arrangements and inspired production touches.\" Strong radio support included singles \"Black Doe\" and \"Long Gone\", playlisted on BBC Radio 6 Music, and \"Black Doe\" picked as Zane Lowe's Hottest Record in the World on BBC Radio 1.", "link_mentions": [{"page": "List of female electronic musicians", "response": ["* Mary Epworth"]}, {"page": "Nemone", "response": ["In April 2013 Nemone fulfilled a lifelong ambition to curate a specialist dance and electronic music show on BBC Radio 6 Music – Nemone's Electric Ladyland, later The 6 Mix with Nemone. Designing her own show, she has been able to draw on her passion for electronic music, especially championing female DJs, producers and artists like Roisin Murphy, Anna Meredith, Black Madonna, Jayda G, Deena Abdelwahed, Maya Jane Coles, Ellen Allien, Sister Bliss, Francesca Lombardo, B Traits, Peggy Gou, Park Hye Jin, Mary Epworth, Laura. "]}, {"page": "Richard Norris (musician)", "response": ["Norris remixed former The Verve singer Richard Ashcroft's \"Out of my Body\" Flamingods \"Mixed Blessings\" and Mary Epworth's \"Me Swimming\" in 2017."]}, {"page": "Sunday Best (company)", "response": ["* Mary Epworth"]}, {"page": "Ian Button", "response": ["He has largely switched to drums as his main instrument and has been involved in playing live and on recordings for a number of projects including the antifolk bands Paul Hawkins & The Awkward Silences, Lucy's Diary, Sergeant Buzfuz and David Cronenberg's Wife, D.I.V bassist Mat Flint's band Deep Cut, Wreckless Eric, Robert Rotifer, Picturebox, Mark & The Clouds, Darren Hayman, Mary Epworth, Judy Dyble & Andy Lewis, Twink, André Heller, Louis Philippe (musician), Pete Astor, Robert Forster (musician), Helen McCookerybook and Go Kart Mozart (whose album Mozart's Mini-Mart he produced with Lawrence)."]}, {"page": "Thom Monahan", "response": ["*Mary Epworth – Dream Life", "*Mary Epworth – Elytral"]}, {"page": "List of autoharp players", "response": ["*Mary Epworth"]}, {"page": "Hop Farm Festival", "response": ["2012 saw the return of the comedy stage where comedians such as Russell Kane, Stephen K Amos, Patrick Monahan, Ant Dewson and Jollyboat performed. As well as the welcomed return of the comedy stage was the Camp Acoustic where Jamie Abbott, Ilona and Marcus Bonfanti (amongst others) performed. Younger soloists like Mary Epworth also made their first appearance in 2012.   In addition to this was the introduction of two new locations for musicians to perform. Located adjacent the bars was the new Power's Bar Stage which played host to many independent artists over the three days, and there was also the new Busker's Boulevard, in which artists performed all along the main path between the campsite and the arena, to accompany the attendees and make the long walk shorter."]}, {"page": "Within the Wires", "response": ["In an interview with CBC Radio's Podcast Playlist, Jeffrey Cranor explained that the initial idea behind the podcast was to use pre-existing audio guides as a template for storytelling, with the first season taking the form of a relaxation cassette program. Cranor had read and enjoyed Janina Matthewson's book \"Of Things Gone Astray\", and they first met when he messaged her on Twitter in Autumn 2015 inviting her to the live show for Welcome to Night Vale when it was touring through London. Cranor later pitched the initial idea to Matthewson and they began brainstorming story ideas together. Episodes are outlined by both Cranor and Matthewson, before being written by one of them and then edited by the other. All ten episodes of the first season were written by Cranor and Matthewson, with music by Mary Epworth. The first season was partially funded through sponsored advertising—a practice shared with other series under the Night Vale Presents banner such as Alice Isn't Dead and The Orbiting Human Circus (of the Air)."]}, {"page": "Night Vale Presents", "response": ["The second NVP network podcast is Within the Wires is an anthology series of found audio tapes, written by Night Vale cowriter Jeffrey Cranor, as well as and Janina Matthewson. Season one is narrated by Matthewson and told as a series of relaxation tapes prepared for a patient in a mysterious medical center known as \"The Institute.\" As the story unfolds, it became clear that the narrator of the tapes had a connection to the patient, and may have had a secret agenda. The first season of 10 episodes was released between June and November 2016.Night Vale Presents: Within the Wires, NightValePresents.com. Retrieved 9/25/16. The second season, narrated by Rima Te Wiata, is presented as a series of museum audio guides and aired from September 2017, to January 2018. The third season, narrated by Lee LeBreton, is a political thriller set in 1950s Chicago told through letters from a bureaucrat to his secretary. It aired from September 2018, to January 2019. The fourth season ran from September to December 2019 and is about a mother, voiced by Mona Greene, who records audio notes to her daughter while leading an anti-government commune called The Cradle with music by Mary Epworth."]}]}}