{"wiki_id": "http://www.wikidata.org/entity/Q6776213", "itemLabel": "Martin Morgan", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Morgan", "wikipedia_page": {"main": "Martin Morgan is an Irish former politician for the Social Democratic and Labour Party (SDLP). \nMarried to Dympna, a double graduate from the Queen's University of Belfast and a qualified Master's Level Social Worker, Morgan has been a  political activist since his teenage years.\nA former Vice-Chairperson of the SDLP and Executive member. In 1996 he was an unsuccessful candidate in the Northern Ireland Forum election in North Belfast. He was a councillor on Belfast City Council until 2005. Morgan was the youngest Nationalist and Catholic to be elected Lord Mayor of Belfast until the election of Niall Ó Donnghaile (SF). He stood for the party in the 2004 European Parliament elections. He was the youngest ever Belfast councillor when first elected.\nHe questioned, but abided by, SDLP support for the Police Service of Northern Ireland (PSNI). The PSNI was accused by Morgan and representatives of the local community of using heavy-handed policing to force an Orange Order parade through the mainly Catholic Ardoyne area of North Belfast. Morgan left the SDLP after seeing out his third term of office. He writes a weekly \"Straight Talking\" column in the Belfast newspaper North Belfast News. This column deals with current affairs, political and social responsibility matters, particularly but not exclusively in North Belfast.Morgan's grandfather William Mullan was a member of the Irish Army colour party which accompanied 1916 rebel Padraig Pearse's body to the graveyard.", "link_mentions": [{"page": "2004 European Parliament election in the United Kingdom", "response": ["|Martin Morgan||0|| 1||87,559||15.9"]}, {"page": "List of mayors of Belfast", "response": ["|Martin Morgan"]}, {"page": "Belfast North (Assembly constituency)", "response": ["| align=\"right\" |Alban MaginnessMartin MorganGeraldine LeonardShelagh McGladePeter Coll"]}, {"page": "Eric Smyth", "response": ["He then stood for the Lord Mayoralty again, but was beaten by the Alliance Party's Tom Ekin on the casting vote of Martin Morgan, the previous year's Lord Mayor. Smyth stood for election as the Deputy Lord Mayor but was defeated by Joe O'Donnell of Sinn Féin, this time on the casting vote of Ekin. Following this defeat, reports claim that he told Ekin \"your hands are covered in blood, you shameless traitor\".Barry McCaffrey, \"Unionists in uproar as Alliance 'partners' SF\", nuzhound.com, 2 June 2004.  Despite his strong opposition to Sinn Féin, Smyth disregarded the DUP's policy stating that its members should have no contact with the group."]}, {"page": "List of University of the Witwatersrand people", "response": ["* Martin Morgan, Chief Executive Officer and Director of DMGT"]}, {"page": "2001 Northern Ireland local elections", "response": ["| align=\"right\" |Martin Morgan"]}, {"page": "1997 Northern Ireland local elections", "response": ["| align=\"right\" |Martin Morgan"]}, {"page": "1993 Northern Ireland local elections", "response": ["| align=\"right\" |Martin Morgan"]}, {"page": "Politics of Northern Ireland", "response": ["Fianna Fáil, the second-largest party in the Republic, opened a cumann (branch) in Derry, and began recruiting at Queens University Belfast. The leadership  had decided not to take part in electoral politics in Northern Ireland, however in the latter part of 2007 the Taoiseach said his party was consulting its grassroots on the possibility of contesting elections in the North, and that in advance of this Fianna Fáil had registered as a political party in Northern Ireland. Some, within both Fianna Fáil and the SDLP (including former SDLP European elections candidate Martin Morgan) have advocated an alliance, or even a merger, between both parties. However, many in both parties are hostile to the idea, with some in the SDLP pointing out the left-wing links between the party and the Irish Labour Party."]}, {"page": "Oldpark (District Electoral Area)", "response": ["! rowspan = \"3\" | Martin Morgan  (SDLP)"]}, {"page": "John Boreland", "response": ["For the Twelfth, in July 2004, Boreland led a group of UDA members past the Ardoyne shops as followers of a contentious Orange Order parade at the interface area, despite the Parades Commission stating that the march could only pass the shops without followers. His involvement in the parade led to the Social Democratic and Labour Party's Martin Morgan threatening to resign from the Northern Ireland Policing Board after accusing the PSNI of ignoring the rulings of the Parades Commission due to Boreland and the other paramilitaries being allowed to march.Ardoyne, 12 July — a tale of two reports"]}, {"page": "Myrddin ap Dafydd", "response": ["* Syniad Da Iawn! (Sioned Wyn Huws, Myrddin ap Dafydd, Haf Llywelyn, Martin Morgan, Eleri Llewelyn Morris), Tachwedd 2000, (Gwasg Carreg Gwalch)"]}, {"page": "Morgan, Martin", "response": ["#redirectMartin Morgan"]}]}}