{"wiki_id": "http://www.wikidata.org/entity/Q6777593", "itemLabel": "Martyn Arbib", "itemDescription": "businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Martyn_Arbib", "wikipedia_page": {"main": "Sir Martyn Arbib (born 27 June 1939) is a British businessman who founded and led the Perpetual fund management company during the late 20th century.", "link_mentions": [{"page": "Henley-on-Thames", "response": ["* Sir Martyn Arbib led the Perpetual fund management company during the late 20th century, unusually based in Henley-on-Thames, rather than London. Arbib was a major benefactor in the establishment of the River and Rowing Museum at Henley, which opened in 1998."]}, {"page": "St Leger Stakes", "response": ["| Martyn Arbib"]}, {"page": "Irish St. Leger", "response": ["| Martyn Arbib"]}, {"page": "Invesco Perpetual", "response": ["The company was founded in 1973 by Martyn Arbib as Perpetual Limited. In 2001, Arbib sold the business to the American AMVESCAP Group, which was renamed Invesco in 2008."]}, {"page": "Sir Martyn Arbib", "response": ["#REDIRECT Martyn Arbib"]}, {"page": "Urs Schwarzenbach", "response": ["In 2007, Schwarzenbach outbid other foreign buyers to acquire Culham Court, a  riverside estate downstream of Henley-on-Thames on the Berkshire bank. Schwarzenbach bought the estate from Paddy and Annabel Nicoll for £35 million. Mrs Nicoll's father is Sir Martyn Arbib, former head of the Perpetual fund management company, who bought the estate as a wedding present for her in 1997 for £12 million. Coincidentally, Culham's connections with the world of finance run deeper still; Arbib acquired the property from Felicity Behrens, wife of the banker Michael Behrens, who lived there for nearly half a century from 1949 to 1996."]}, {"page": "Canadian International Stakes", "response": ["|Martyn Arbib"]}, {"page": "Gran Premio di Milano", "response": ["| Martyn Arbib", "| Martyn Arbib"]}, {"page": "Grand Prix de Deauville", "response": ["| Martyn Arbib", "| Martyn Arbib", "| Martyn Arbib"]}, {"page": "Paul Cole", "response": ["He was British flat racing Champion Trainer in 1991, the year in which he trained Generous to win the Epsom Derby. Notable owners he has trained for include Prince Fahd bin Salman and Martyn Arbib, and regular jockeys have been Richard Quinn and Alan Munro. In March 2020 Cole took out a joint training licence with his son, Oliver, who had previously been his assistant trainer."]}, {"page": "Arbib Foundation", "response": ["#REDIRECT Martyn Arbib"]}, {"page": "List of Old Felstedians", "response": ["* Sir Martyn Arbib, (b. 1938), financier, philanthropist, racehorse owner, founder Perpetual PLC now Invesco Perpetual Investment company (Who's Who)"]}, {"page": "2003 Birthday Honours", "response": ["*Martyn Arbib, D.L. For services to Charities, especially Education."]}, {"page": "Arbib", "response": ["* Sir Martyn Arbib (born 1939), British businessman"]}, {"page": "David Lunn-Rockliffe", "response": ["Lunn-Rockliffe was Executive Secretary of the Amateur Rowing Association (now known as British Rowing) in the United Kingdom from 1976 until 1987, overseeing the move towards a more professional organization. He was then central to the foundation of the River and Rowing Museum in Henley, opened by Queen Elizabeth II in November 1998. He took charge of negotiating a site close to the River Thames with Henley Town Council, engaging the architect David Chipperfield to design the award-winning museum building, and obtaining planning permission together with major sponsorship from the locally based businessmen Martyn Arbib and Urs Schwarzenbach."]}, {"page": "Snurge", "response": ["Snurge was a chestnut horse with a narrow white blaze bred at the Kilcarn Stud near Navan in County Meath, Ireland. Before his racing career began he entered the ownership of the British businessman Martyn Arbib, who named the colt after a nickname he received while in school. Snurge was sired by the King George VI and Queen Elizabeth Stakes winner Ela-Mana-Mou out of the French-bred mare Finlandia. The horse was trained by Paul Cole at Whatcombe, near Wantage in Oxfordshire and ridden in all but two of his races by Richard Quinn."]}, {"page": "Culham Court, Berkshire", "response": ["In 1997, the house was bought by Sir Martyn Arbib for his daughter, Annabel (married to businessman Paddy Nicoll). Arbib bought it for £12 million, and in 2006, they sold it to Swiss-born British billionaire Urs Schwarzenbach for £35 million, £10 million above the asking price."]}, {"page": "Strategic Choice", "response": ["Strategic Choice was a bay stallion with a broad white blaze and two white socks bred in Kentucky by his owner Martyn Arbib, a British businessman who brought the colt back to the United Kingdom. The horse was trained by Paul Cole at Whatcombe, near Wantage in Oxfordshire and ridden in most of his races by Richard Quinn."]}, {"page": "Jeena Chatrani", "response": ["In 2015, Chatrani created a 60\"x60\" painting of Garfield Sobers using palette knives. The artwork was donated by Chatrani to the Charitable Trust of Sandy Lane, and raised US$130,000 for charity during an auction hosted by the Sandy Lane Charitable Trust. The winning bid was made by Sir Martyn Arbib, who then gifted the artwork to Sobers. Sir Garfield Sobers subsequently donated the piece to the Cricket Legends of Barbados Museum."]}, {"page": "List of Knights Bachelor appointed in 2003", "response": ["|Martyn Arbib, DL"]}]}}