{"wiki_id": "http://www.wikidata.org/entity/Q6776199", "itemLabel": "Martin Miller", "itemDescription": "English cricketer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Miller_(cricketer)", "wikipedia_page": {"main": "Martin Graham Miller (born 1972) is a former English cricketer. Miller was a right-handed batsman who played primarily as a wicketkeeper.\nMiller made his debut for Dorset in the 1995 Minor Counties Championship against Herefordshire. From 1995 to 2003, Miller represented Dorset in 41 Minor Counties Championship matches, with his final Minor Counties appearance for the county coming against Oxfordshire.\nIn 1999, Miller made his List-A debut for Dorset in the 1999 NatWest Trophy against Scotland. From 1999 to 2003, Miller played 7 List-A matches for the county, with his final List-A match coming against Buckinghamshire in the 1st round of the 2004 Cheltenham & Gloucester Trophy which was played in 2003.\nIn his 7 List-A matches for Dorset, he scored 150 runs at a batting average of 25.00. Miller made a single half century in List-A matches, which came against Glamorgan in 2000. A wicketkeeper, Miller took 6 catches and made 2 stumpings.", "link_mentions": [{"page": "Martin (name)", "response": ["*Martin Miller (actor) (1899–1969), Czech actor", "*Martin Miller (cricketer) (born 1972), English cricketer", "*Martin Miller (footballer) (born 1997), Estonian footballer", "*Johann Martin Miller (1750–1814), German theologian and writer"]}, {"page": "Martin Miller", "response": ["Martin Miller may refer to:", "*Martin Miller (actor) (1899–1969), Czech actor", "*Martin Miller (cricketer, born 1940), English cricketer", "*Martin Miller (cricketer) (born 1972), English cricketer", "*Martin Miller (footballer) (born 1997), Estonian footballer", "*Johann Martin Miller (1750–1814), German theologian and writer"]}, {"page": "List of Dorset County Cricket Club List A players", "response": ["In their twenty List A matches, 88 players have represented Dorset. Stuart Rintoul has appeared the most times for the county, playing in ten matches.  Graeme Calway recorded the highest score in List A cricket for Dorset, scoring 105 runs against Hampshire in 1992. Jon Hardy, who also during his career played 142 first-class matches is Dorset's leading run-scorer, having scored 217 runs in his four appearances for the county.  Vyvian Pike's nine wickets for the county is the most by any player, as well as having the best bowling figures, having taken five wickets against Norfolk in 2000. Martin Miller, who appeared for Dorset on seven occasions, has claimed the most dismissals as wicket-keeper, taking six catches and making two stumpings. Five non-English players have appeared for Dorset; Guernsey's Lee Savident, Scotland's Ian Sanders and South Africa's Andrew Hodgson, Ian Stuart and Lloyd Ferreira."]}, {"page": "Template talk:Birth date and age/Archive 4", "response": ["| Martin Miller (cricketer)                                    ||  || "]}]}}