{"wiki_id": "http://www.wikidata.org/entity/Q6779568", "itemLabel": "Mary Fortune", "itemDescription": "Irish-Australian detective writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Fortune", "wikipedia_page": {"main": "Mary Helena Fortune (c. 1833 – 1911) was an Australian writer, under the pseudonyms \"Waif Wander\" and \"W.W.\" She was one of the earliest female detective writers in the world, and probably the first to write from the viewpoint of the detective. Never financially secure, she wrote prolifically over several genres including poetry, detective, gothic horror, journalism and travel writing.", "link_mentions": [{"page": "1866 in literature", "response": ["**The first detective fiction by women authors is published: the dime novel The Dead Letter, an American Romance by \"Seeley Regester\" (Metta Victoria Fuller Victor) in New York City as the first full-length American work of crime fiction, having begun to appear serially in the January Beadle's Monthly; Mary Fortune's story \"The Dead Witness, or the Bush waterhole\" is published in the Australian Journal on January 20. "]}, {"page": "Lucy Sussex", "response": ["Sussex is strongly feminist. Victoriana styles and motifs recur in her work, as do dolls. The Scarlet Rider is a fictionalization of her search for Mary Fortune.", "She has also described herself as a 'literary archaeologist' having rediscovered and republished the work of nineteenth-century Australian crime writers Mary Fortune and Ellen Davitt. Fortune's full identity was uncovered through Sussex's scholarship, having been previously only known by pseudonyms for many decades. Her Ph.D thesis also focused on early women crime writers, the mothers of the genre.", "*The Fortunes of Mary Fortune (Penguin, 1989)", "*The Detectives’ Album by Mary Fortune (Broken Silicon Press, USA and Canada, 2003)", "*Three Detective Stories by Mary Fortune (Mulini, 2009)", "*Mary Fortune with Elizabeth Gibson, (Victorian Fiction Research Guide 27), Victorian Fiction Research Unit, Department of English, University of Queensland, 1998."]}, {"page": "List of years in Australian literature", "response": ["* 1910 in Australian literature: Death of Mary Fortune; The Getting of Wisdom – Henry Handel Richardson", "* 1871 in Australian literature: The Bushranger's Autobiography – Mary Fortune", "* 1865 in Australian literature: Force and Fraud: A Tale of the Bush – Ellen Davitt; \"Cooee\" – Mary Fortune; \"Daniel Henry Deniehy\" – Henry Kendall"]}, {"page": "Mary Fortune (Waif Wander)", "response": ["#REDIRECT Mary Fortune"]}, {"page": "Waif Wander", "response": ["#REDIRECT Mary Fortune"]}, {"page": "1895 in Australian literature", "response": ["* Mary Fortune – \"The Major's Case\""]}, {"page": "1910 in Australian literature", "response": ["*Mary Fortune — poet, crime fiction and short story writer (born 1833)"]}, {"page": "1886 in Australian literature", "response": ["* Mary Fortune — Dora Carleton : A Tale of Australia", "* Mary Fortune — \"Bridget's Locket\""]}, {"page": "1884 in Australian literature", "response": ["* Mary Fortune — Dan Lyons' Doom"]}, {"page": "1871 in Australian literature", "response": ["* Mary Fortune — The Bushranger's Autobiography", "* Mary Fortune — The Detective's Album : Tales of the Australian Police", "* Mary Fortune — \"Conjuro Te\""]}, {"page": "1870 in Australian literature", "response": ["* Mary Fortune"]}, {"page": "1868 in Australian literature", "response": ["* Mary Fortune – \"The Tressless Bride\"", "* Mary Fortune"]}, {"page": "1867 in Australian literature", "response": ["* Mary Fortune"]}, {"page": "1866 in Australian literature", "response": ["* Mary Fortune", "* Mary Fortune – \"Kirsty Oglevie\""]}, {"page": "1865 in Australian literature", "response": ["* Mary Fortune – \"My Lady Jane\"", "* Mary Fortune – \"Cooee\""]}, {"page": "June Wright", "response": ["Her books also feature in Highlights and Lowlifes (29 June to 31 August 2015), an exhibition on the Holdings in the Australian Detective Fiction Collection at Fisher Library, The University of Sydney which showcased 19th century crime writers such as Fergus Hume (“Mystery of a Hansom Cab”); the early Boney novels of Arthur Upfield; and Australia's under recognised female crime writers such as Ellen Davitt and Mary Fortune through to the 20th century's Pat Flower, Pat Carlon, Margot Neville and June Wright."]}, {"page": "List of Australian women writers", "response": ["*Mary Fortune, pseudonym Waif Wanter (c. 1833–1911), detective story writer"]}, {"page": "List of women writers (A–L)", "response": ["*Mary Fortune (c. 1833–1911, Australia), crime wr."]}]}}