{"wiki_id": "http://www.wikidata.org/entity/Q6773677", "itemLabel": "Marshall Lang", "itemDescription": "Moderator of the General Assembly of the Church of Scotland", "wikipedia_url": "https://en.wikipedia.org/wiki/Marshall_Lang_(son)", "wikipedia_page": {"main": "Marshall Buchanan Lang  TD (1868 – 3 October 1954) was a Church of Scotland minister and author.He was born into an ecclesiastical family in  1868. John Marshall Lang, his father, was Moderator of the General Assembly of the Church of Scotland in 1893 and two of his brothers were bishops: Cosmo was Archbishop of Canterbury from 1928 to 1942 and Norman was Bishop suffragan of Leicester\nHe was educated at Glasgow Academy and Glasgow University. He was Minister at Oldmeldrum, then at St John's (Cross) in Dundee from 1909  before moving to his father's former Kirk at Whittingehame in 1918.  He was Moderator of the General Assembly of the Church of Scotland in 1935. He died on  3 October 1954.", "link_mentions": [{"page": "Cosmo Gordon Lang", "response": ["Cosmo Gordon Lang was born in 1864 at the manse in Fyvie, Aberdeenshire, the third son of the local Church of Scotland minister, the Reverend John Marshall Lang, and his wife Hannah Agnes Lang. (\"Early Life\" section) Cosmo was baptised at Fyvie church by a neighbouring minister, the name \"William\" being added inadvertently to his given names, perhaps because the local laird was called William Cosmo Gordon. The additional name was rarely used subsequently.Lockhart, pp. 6–8 In January 1865 the family moved to Glasgow on John Lang's appointment as a minister in the Anderston district. Subsequent moves followed: in 1868 to Morningside, Edinburgh and, in 1873, back to Glasgow when John Lang was appointed minister to the historic Barony Church."]}, {"page": "List of Moderators of the General Assembly of the Church of Scotland", "response": ["*1893 J. Marshall Lang (Glasgow: The Barony)"]}, {"page": "Norman Lang (bishop)", "response": ["Lang's father, John Marshall Lang, was a Church of Scotland minister and some-time Moderator; among Norman's brothers were Cosmo, Archbishop of YorkThe Times, Friday, Jan 07, 1921; pg. 12; Issue 42612; col E The Late Mrs Lang. Mother of The Archbishop of York and then of Canterbury;Leicester villages and Marshall, minister and some-time Moderator. He was educated at Christ Church, Oxford, and after a period of study at Ripon College Cuddesdon,Anglican History he was made deacon on Trinity Sunday 1900 (10 June) and ordained priest on St Thomas' Day 1902 (21 December) — both times by Randall Davidson, Bishop of Winchester, at Winchester Cathedral. His first post was as a Minor Canon  at Bloemfontein Cathedral. Returning to England he was Vicar of St Martin's, LeicesterThe Times, Friday, Jun 11, 1909; pg. 9; Issue 38983; col C Ecclesiastical Intelligence before his appointment to the Episcopate. He was consecrated a bishop on Ascension Day (1 May) by Randall Davidson, by then Archbishop of Canterbury, at Southwark Cathedral."]}, {"page": "John Marshall Lang", "response": ["John Marshall Lang CVOThe Times, Friday, 9 Nov 1906; pg. 8; Issue 38173; col C Birthday Honours (18342 May 1909) was a Church of Scotland minister and author.Amongst others he wrote \"Heaven and Home\", 1880; \"The Last Supper of our Lord\", 1881; \" Life: is it worth living?\", 1883; \" Homiletics on St Luke’s Gospel\", 1889; \"The Expansion of the Christian Life \", 1897; and \"The Church and its Social Mission\"1902 > British Library  website accessed 16:37 GMT 15 March 2011 He served as Moderator of the General Assembly in 1893.", "thumb|330px|The grave of John Marshall Lang, St Machar's Cathedral", "He was born in the manse at Glassford into an eminent ecclesiastical family on 14 May 1834. His father was the minister Gavin Lang. His mother was Agnes Roberton Marshall. He was the second of eleven children, including Robert Hamilton Lang.ODNB: John Marshall Lang"]}]}}