{"wiki_id": "http://www.wikidata.org/entity/Q6779122", "itemLabel": "Mary Brough", "itemDescription": "actress (1863-1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Brough", "wikipedia_page": {"main": "Mary Bessie Brough (16 April 1863 – 30 September 1934) was an English actress in theatre, silent films and early talkies, including eleven of the twelve Aldwych farces of the 1920s and early 1930s.\nThe daughter of a well-known actor, Lionel Brough, with a long theatrical family tradition, she became a professional actress in December 1881. Although she was in regular demand in character parts she did not become well known to theatre-goers until she was nearly sixty. In 1922 she was cast in a small part in a farce, Tons of Money, which was followed by a ten-year series of new farces at the Aldwych Theatre for which the actor-manager Tom Walls assembled a regular company of players, including Brough. The playwright Ben Travers wrote parts expressly to suit her persona; she recorded several of them in films of the farces.", "link_mentions": [{"page": "West Norwood Cemetery", "response": ["* many artists and entertainers, including: David Roberts, artist, George Stansbury, composer and operatic singer, William Collingwood Smith, painter, Joseph Barnby, composer and resident conductor at the Royal Albert Hall, Katti Lanner, ballet dancer, Paul Cinquevalli, juggler and actors E. J. Lonnen, Patsy Smart, Maria Zambaco and Mary Brough"]}, {"page": "Ben Travers", "response": ["With Travers's agreement, Grossmith sold the rights to A Cuckoo in the Nest to Walls, and the play opened at the Aldwych in July 1925.\"Aldwych Theatre\", The Times, 23 July 1925, p. 12 The leading lady was Yvonne Arnaud, and the two leading men were Walls and Ralph Lynn. They were supported by a team of players who became part of a regular company at the Aldwych for the rest of the 1920s and into the 1930s: Robertson Hare, Mary Brough and Gordon James, joined in subsequent productions by Winifred Shotter (in place of Arnaud) and Ethel Coleridge.\"Mr. Ralph Lynn\", The Times, 10 August 1962, p. 11 The play was an immediate success and ran for 376 performances."]}, {"page": "Aldwych Theatre", "response": ["From 1923 to 1933, the theatre was the home of the series of twelve farces, known as the Aldwych farces, most of which were written by Ben Travers. Members of the regular company for these farces included Ralph Lynn, Tom Walls, Ethel Coleridge, Gordon James, Mary Brough, Winifred Shotter and Robertson Hare.\"Mr Ralph Lynn\", The Times, 10 August 1962, p. 11 In 1933, Richard Tauber presented and starred in a new version of Das Dreimäderlhaus at the Aldwych under the title Lilac Time.  From the mid-1930s until about 1960, the theatre was owned by the Abrahams family.Theatre Postcard site. Retrieved 19 March 2007"]}, {"page": "The Mysterious Mr Quin", "response": ["* Mary Brough ... Cook"]}, {"page": "List of female movie actors by name: B", "response": ["*Mary Brough (1863–1934)"]}, {"page": "Tom Walls", "response": ["There were twelve Aldwych farces under Walls's management. The first eight averaged runs of 369 performances. The last four did less well, averaging under 150 performances.  Walls gathered a regular troupe of supporting actors, including Robertson Hare, Mary Brough and Winifred Shotter. Travers wrote for these players, drawing on their strengths, his plays populated by:"]}, {"page": "List of British films before 1920", "response": ["| Beauty and the Barge || Harold M. Shaw || Cyril Maude, Lillian Logan, Gregory Scott, Mary Brough || Comedy ||", "| The Bosun's Mate || Harold M. Shaw || Mary Brough, Charles Rock  Wyndham Guise || Comedy ||", "| The Brass Bottle || Sidney Morgan || Doris Lytton, E. Holman Clark, Mary Brough || Fantasy ||", "| Lawyer Quince|| Harold M. Shaw || Charles Rock, Lillian Logan, Mary Brough || Comedy || "]}, {"page": "Toole's Theatre", "response": ["Toole retained a stock company, and many newcomers had their first opportunities at Toole's under his management, including Mary Brough,Mander and Mitchenson, p. 230 Kate Cutler,\"Miss Kate Cutler\", The Times, 18 May 1955, p. 13 Florence Farr,Hyde, Virginia Crosswhite. \"Farr (married name Emery), Florence Beatrice (performing name Mary Lester) (1860–1917), author and mystic\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 9 July 2020  Seymour Hicks, Eva Moore, Irene Vanbrugh, Violet VanbrughLittlewood, S. R. \"Vanbrugh, Violet (real name Violet Augusta Mary Barnes) (1867–1942), actress\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 9 July 2020  and Lewis Waller.Emeljanow, Victor. \"Waller, Lewis (real name William Waller Lewis) (1860–1915), actor and theatre manager\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 9 July 2020 "]}, {"page": "Dawn (1928 film)", "response": ["* Mary Brough – Mme. Pitou "]}, {"page": "The Passing of Mr. Quin", "response": ["The Passing of Mr. Quin is a 1928 British mystery film which was co-directed by Leslie S. Hiscott and Julius Hagen, starring Clifford Heatherley, Mary Brough and Ursula Jeans. The film was based on the short story The Coming of Mr. Quin, part of the collection The Mysterious Mr. Quin, which was written by Agatha Christie. It was the first British film to be made of one of Christie's works. The short story was adapted by Hiscott, who would in 1931 direct Alibi, the first film to feature Christie's more well known Belgian detective Hercule Poirot. The film was made at Twickenham Studios in London.", "*Mary Brough as Cook "]}, {"page": "Lionel Brough", "response": ["Brough encouraged all his children to become actors. His elder daughter Mary Brough (\"Polly\") had a long and successful career.  His elder son \"'Bobbie\" (Sydney Brough, 1868–1911) was a popular leading man when he died of complications following a throat infection; he was married to Lizzie Webster, a granddaughter of Benjamin Nottingham Webster.  Lionel Brough's younger daughter \"Daisy\" (Margaret Brough, 1870–1901) died of peritonitis, and his younger son Percy Brough (1872–1904) toured with the Brough-Boucicault Comedy Company in Australia and New Zealand but died en route from England to China.Jean Webster Brough, Prompt Copy, Hutchinson, 1952"]}, {"page": "Tons of Money (1930 film)", "response": ["Tons of Money is a 1930 British comedy film directed by Tom Walls and starring Ralph Lynn, Yvonne Arnaud, Mary Brough, Robertson Hare and Gordon James, the same artistes responsible for the Aldwych farces.BFI.org It was a remake of the 1924 film Tons of Money which had been based on the 1922 play Tons of Money by Will Evans and Arthur Valentine. It was made at Elstree StudiosWood p.70 with sets designed by the art director Lawrence P. Williams.", "* Mary Brough as Benita Mullet  "]}, {"page": "Plunder (1931 film)", "response": ["* Mary Brough as Mrs Hewlett"]}, {"page": "On Approval (1930 film)", "response": ["* Mary Brough as Emerald"]}, {"page": "The Amazing Quest of Mr. Ernest Bliss", "response": ["* Mary Brough as Gloria Mott"]}, {"page": "The Adventures of Mr. Pickwick", "response": ["* Mary Brough as Mrs. Bardell"]}, {"page": "Master and Man (1929 film)", "response": ["* Mary Brough as Mrs. Wilkes"]}, {"page": "The Passionate Adventure", "response": ["* Mary Brough as Lady Rolis"]}, {"page": "Rookery Nook (play)", "response": ["The actor-manager Tom Walls, initially together with Leslie Henson, produced the series of Aldwych farces, nearly all written by Ben Travers, starring Walls and his co-star Ralph Lynn, who specialised in playing \"silly ass\" characters. Walls assembled a regular company of actors to fill the supporting roles. For the first few productions, the company included Robertson Hare, as a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority, Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Mrs Leverett – Mary Brough"]}, {"page": "Lily of the Alley", "response": ["* Mary Brough as Widow"]}, {"page": "The Physician (1928 film)", "response": ["*Mary Brough as Landlady "]}, {"page": "The Only Way (1927 film)", "response": ["* Mary Brough – Miss Pross"]}, {"page": "The Old Wives' Tale (film)", "response": ["* Mary Brough - Mrs Barnes"]}, {"page": "Squibs (1921 film)", "response": ["* Mary Brough – Mrs. Lee"]}, {"page": "Lawyer Quince (1914 film)", "response": ["* Mary Brough - Mrs Quince"]}, {"page": "Tons of Money (1924 film)", "response": ["Tons of Money is a 1924 British silent comedy film directed by Frank Hall Crane and starring Leslie Henson, Flora le Breton and Mary Brough.Tons of Money, Walls and Henson films, The British Film Institute, accessed 13 November 2011 It is an adaptation of the 1922 play Tons of Money by Will Evans and Arthur Valentine.McCallum, David. \"Edinburgh Theatre Arts: Comedy Connections –Tons Of Money\" , accessed 13 November 2011  Both were co-produced with Tom Walls.  It was remade as a sound film Tons of Money in 1930.", "* Mary Brough as Mrs. Mullet"]}, {"page": "John Forrest Finds Himself", "response": ["* Mary Brough - Biddy "]}, {"page": "Safety First", "response": ["Safety First is a 1926 British silent comedy film directed by Fred Paul and starring Brian Aherne, Queenie Thomas and Mary Brough. It was based on a novel of the same name by Margot Neville.Goble p.344", "* Mary Brough - Caroline Lowecraft"]}, {"page": "Sailors Don't Care (1928 film)", "response": ["* Mary Brough – Cook"]}, {"page": "London Pride (film)", "response": ["* Mary Brough - Mrs. Tunks"]}, {"page": "Squibs Wins the Calcutta Sweep", "response": ["* Mary Brough - Mrs Lee"]}, {"page": "Beauty and the Barge (1914 film)", "response": ["* Mary Brough - Mrs. Baldwin"]}, {"page": "The Bosun's Mate", "response": ["The Bosun's Mate is a 1914 British silent comedy film directed by Harold M. Shaw and starring Mary Brough, Charles Rock and Wyndham Guise. It is an adaptation of a play by W. W. Jacobs.", "* Mary Brough – Mrs. Walters"]}, {"page": "The Law Divine", "response": ["* Mary Brough as Cook"]}, {"page": "Demos (film)", "response": ["* Mary Brough as Mrs.Mortimer"]}, {"page": "His Grace Gives Notice (1924 film)", "response": ["* Mary Brough – Mrs. Smith "]}, {"page": "A Sister to Assist 'Er (1922 film)", "response": ["A Sister to Assist 'Er is a 1922 British silent comedy film directed by George Dewhurst and starring Mary Brough, Polly Emery and Muriel Aked.A Sister to Assist 'Er film details , ftvdb.bfi.org.uk; accessed 23 January 2016. It was based on the play  A Sister to Assist 'Er by John le Breton.", "* Mary Brough ...  Mrs. Millie May "]}, {"page": "A Sister to Assist 'Er (1927 film)", "response": ["A Sister to Assist 'Er is a 1927 British silent comedy film directed by George Dewhurst and starring Mary Brough, Polly Emery and Humberston Wright. It was based on the play A Sister to Assist 'Er by John le Breton.", "* Mary Brough as Mrs. May "]}, {"page": "A Sister to Assist 'Er (1930 film)", "response": ["* Mary Brough ...  Mrs. May "]}, {"page": "Tons of Money (play)", "response": ["*Benita Mullett – Mary Brough"]}, {"page": "Wait and See (1928 film)", "response": ["* Mary Brough as Landlady "]}, {"page": "Turkey Time (1933 film)", "response": ["* Mary Brough as Mrs. Gather"]}, {"page": "Turkey Time (play)", "response": ["Like its predecessors, the play was directed by Tom Walls, who co-starred with Ralph Lynn, a specialist in playing \"silly ass\" characters.  The regular company of supporting actors included Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278Travers, p. vi This was the last of the Aldwych farces in which Walls appeared on stage. He produced, but did not play in, the last three.\"Aldwych Theatre\", The Times, 8 March 1932, p. 12; \"Aldwych Theatre\", The Times, 6 September 1932, p. 10; and \"Aldwych Theatre\", The Times, 31 January 1933, p. 8", "*Mrs Gather – Mary Brough"]}, {"page": "The Fordington Twins", "response": ["The Fordington Twins is a 1920 British silent drama film directed by W.P. Kellino and starring Dallas Anderson, Mary Brough and Nita Russell.BFI.org It is based on a novel by Edgar Newton Bungay. Two young brothers who live over a fishmongers in Bethnal Green inherit a large sum of money and a country estate, but are almost cheated out of it by a swindler.Bamford p.80-81", "* Mary Brough as Mrs. Margaretson "]}, {"page": "The Will (1921 film)", "response": ["* Mary Brough - Bessie"]}]}}