{"wiki_id": "http://www.wikidata.org/entity/Q6776200", "itemLabel": "Martin Millett", "itemDescription": "British archaeologist; Laurence Professor of Classical Archaeology (Faculty of Classics), University of Cambridge", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Millett", "wikipedia_page": {"main": "Martin John Millett,  (born 30 September 1955) is a British archaeologist and academic. He is the Laurence Professor of Classical Archaeology at the University of Cambridge and a professorial fellow of Fitzwilliam College, Cambridge. Since 2021, he has been president of the Society of Antiquaries of London.", "link_mentions": [{"page": "Honorius (emperor)", "response": ["The year 410 also saw Honorius reply to a British plea for assistance against local barbarian incursions, called the Rescript of Honorius. Preoccupied with the Visigoths, Honorius lacked any military capability to assist the distant province. According to the sixth century Byzantine scholar Zosimus, \"Honorius wrote letters to the cities in Britain, bidding them to guard themselves.\"Zosimus, vi.10.2 This sentence is located randomly in the middle of a discussion of southern Italy; no further mention of Britain is made, which has led some modern academics to suggest that the rescript does not apply to Britain, but to Bruttium in Italy.Halsall, Guy Barbarian migrations and the Roman West, 376–568 Cambridge University Press; illustrated edition (20 December 2007)  pp. 217–218Discussion in Martin Millett, The Romanization of Britain, (Cambridge: Cambridge University Press, 1990) and in Philip Bartholomew 'Fifth-Century Facts' Britannia vol. 13, 1982 p. 260"]}, {"page": "Fitzwilliam College, Cambridge", "response": ["|Martin Millett"]}, {"page": "End of Roman rule in Britain", "response": ["An appeal for help by the British communities was, according to Zosimus, rejected by the Emperor Honorius in 410 AD. In the text called the Rescript of Honorius of 411, the Western Emperor Honorius tells the British civitates to look to their own defence as his regime was still fighting usurpers in the south of Gaul and trying to deal with the Visigoths who were in the very south of Italy. The first reference to this rescript is written by the sixth-century Byzantine scholar Zosimus and is located randomly in the middle of a discussion of southern Italy; no further mention of Britain is made, which has led some, though not all, modern academics to suggest that the rescript does not apply to Britain, but to Bruttium in Italy.Birley, Anthony Richard The Roman Government of Britain OUP Oxford (29 Sep 2005)  pp.461-463 Halsall, Guy Barbarian Migrations and the Roman West, 376-568 Cambridge University Press; illustrated edition (20 Dec 2007) , pp. 217-18Discussion in Martin Millett, The Romanization of Britain, (Cambridge: Cambridge University Press, 1990) and in Philip Bartholomew 'Fifth-Century Facts' Britannia vol. 13, 1982, p. 260", "One theory that occurs in some modern histories concerns the Rescript of Honorius, holding that it refers to the cities of the Bruttii (who lived at the \"toe\" of Italy in modern Calabria), rather than to the cities of the Britons.Birley, Anthony (2005) The Roman Government of Britain. Oxford: Oxford University Press , pp. 461–463Halsall, Guy Barbarian migrations and the Roman West, 376-568 Cambridge University Press; illustrated edition (20 Dec 2007)  pp.217-218Discussion in Martin Millett, The Romanization of Britain, (Cambridge: Cambridge University Press, 1990) and in Philip Bartholomew 'Fifth-Century Facts' Britannia vol. 13, 1982 p. 260 The suggestion is based on the assumption that the source (Zosimus) or a copyist made an error and actually meant Brettia when Brettania was written, and noting that the passage that contains the Rescript is otherwise concerned with events in northern Italy."]}, {"page": "List of University of Cambridge people", "response": ["*Martin Millett (Fitzwilliam)"]}, {"page": "Sub-Roman Britain", "response": ["There are more continental contemporary sources that mention Britain, though these are highly problematic. The most famous is the so-called Rescript of Honorius, in which the Western Emperor Honorius tells the British civitates to look to their own defence. The first reference to this rescript is written by the 6th century Byzantine scholar Zosimus and is found in the middle of a discussion of southern Italy; no further mention of Britain is made, which has led some, though not all, modern academics to suggest that the rescript does not apply to Britain, but to Bruttium in Italy.Birley, Anthony Richard The Roman Government of Britain OUP Oxford (29 Sep 2005)  pp.461-463 Halsall, Guy Barbarian migrations and the Roman West, 376–568 Cambridge University Press; illustrated edition (20 Dec 2007)  pp.217-218Discussion in Martin Millett, The Romanization of Britain, (Cambridge: Cambridge University Press, 1990) and in Philip Bartholomew 'Fifth-Century Facts' Britannia vol. 13, 1982 p. 260 The Gallic Chronicles, Chronica Gallica of 452 and Chronica Gallica of 511, say prematurely that \"Britain, abandoned by the Romans, passed into the power of the Saxons\" and provide information about St Germanus and his visit(s) to Britain, though again this text has received considerable academic deconstruction.Michael Jones and John Casey, 'The Gallic Chronicle Restored: A Chronology for the Anglo-Saxon Invasions and the End of Roman Britain', Britannia 19, (1988), pp.367-98; R.W. Burgess, 'The Dark Ages Return to Fifth-Century Britain: The 'Restored' Gallic Chronicle Exploded', Britannia 21, (1990), pp.185-195 The work of Procopius, another 6th-century Byzantine writer, makes some references to Britain, though the accuracy of these is uncertain.", "Discussion in Martin Millett, The Romanization of Britain, (Cambridge: Cambridge University Press, 1990) and in Philip Bartholomew 'Fifth-Century Facts' Britannia vol. 13, 1982, pg. 260 The withdrawal of most Roman troops did not end the Roman culture of the \"lost province\", which still remained part of the Roman cultural world, with inhabitants who identified themselves as Roman."]}, {"page": "Farnham College", "response": ["*Martin Millett, archaeologist"]}, {"page": "Antiquity (journal)", "response": ["Antiquity was founded by the British archaeologist O. G. S. Crawford in 1927. The journal is owned by the Antiquity Trust, a registered charity. The current trustees are Graeme Barker, Amy Bogaard, Robin Coningham, Barry Cunliffe, Roberta Gilchrist, Chris Gosden, Anthony Harding, Paul Mellars, Martin Millett, Nicky Milner, Stephanie Moser, and Cameron Petrie."]}, {"page": "Millett", "response": ["* Martin Millett (born 1955), British archaeologist"]}, {"page": "Weydon School", "response": ["*Martin Millett, classical archaeologist and academic"]}, {"page": "Forum Novum", "response": ["The current British School at Rome's project at Forum Novum began in 1997. The aim is to apply a series of approaches to the center in order to provide a detailed and systematic study. As such it provides a complement to the other urban studies being carried out as part of the Tiber Valley Project, in particular to the study of the larger scales of urban form currently being carried out by Simon Keay and Martin Millett."]}, {"page": "1955 in archaeology", "response": ["* September 30 - Martin Millett, English Classical archaeologist."]}, {"page": "Martin millett", "response": ["#REDIRECT Martin Millett "]}, {"page": "Category talk:Academics of the University of Cambridge", "response": ["Martin Millettnot yet classified"]}, {"page": "Isurium Brigantum", "response": ["The Aldrborough Roman Town Project, led by Rose Ferraby and Martin Millett has been investigating the site since 2016. In 2019 Ferraby and sound artist Rob St John created a site specific audio trail exploring the Roman town."]}, {"page": "Laurence Professor of Classical Archaeology", "response": ["* Martin Millett (2001–2022)"]}, {"page": "Faculty of Classics, University of Cambridge", "response": ["* Laurence Professor of Classical Archaeology (currently Martin Millett)"]}, {"page": "List of fellows of the British Academy elected in the 2000s", "response": ["* Professor Martin Millett (University of Cambridge) Archaeology"]}, {"page": "Simon Keay", "response": ["* Martin Millett \"Simon Keay obituary: Archaeologist who specialised in the Roman empire, focusing on ports and commerce in Italy and Spain\" The Guardian 9 May 2021 "]}, {"page": "Glasgow Archaeological Society", "response": ["* Professor Martin Millett on \"Towards an archaeology of the Roman Empire\""]}, {"page": "Historiography of Romanisation", "response": ["=== Martin Millett ===", "The British archaeologist and historian Martin Millett (1955 – ) argues that the Romanisation process was led by the provincial elite in a \"native-led emulation\" which then spread down to all levels of society. His view is that the natives were willing participants in the process as an act of assimilation."]}, {"page": "Louise Revell", "response": ["Revell's research focuses on the  inter linkages between identity, ideology and imperialism, and their expression through material culture.  Recent research has looked at Roman imperialism in the Spanish provinces and Britain. Her 2009 monograph Roman Imperialism and Local Identities was described as \"refreshing and theoretically informed perspective\" and an \"important step forward for studies of Romanisation\", and was widely reviewed.  Revell's 2013 monograph Ways of Being Roman explored the relationship between Roman identities and daily practice as they were experienced through public architecture in the provinces, described as \"a valuable overview of current identity studies as applied to the western Roman provinces\".  Revell's research has also explored gender, family and the life-course within the western provinces. She co-edited the 2016 Oxford Handbook of Roman Britain with Martin Millett and Alison Moore."]}, {"page": "Rose Ferraby", "response": ["Rose Ferraby is a Research Associate in the Faculty of Classics at the University of Cambridge. She is co-director of the Aldborough Roman Town Project. Prior to her PhD research, she worked as an archaeologist for the British School at Rome, where she worked on numerous sites, including Falacrinae, the birthplace of Vespasian. Her expertise includes Roman Britain and using digital techniques to understand landscapes, publishing on photogrammetry on the Jurassic Coast. Ferraby has also published on archaeological landscapes of rainforest in Sarawak, part of a collaborative project at the Museum of Archaeology and Anthropology, University of Cambridge, as well as on the surveys of Roman Aldborough. In 2020 she and Martin Millett published Isurium Brigantium: an archaeological survey of Roman Aldborough which was described by Michael Fulford as \"the essential foundation upon which to build future research at Aldborough\"."]}, {"page": "Astrid van Oyen", "response": ["Van Oyen gained her BA and MA in Archaeology at University of Leuven, Belgium. She received a PhD in Classics in 2014 from the University of Cambridge, with a thesis titled 'Rethinking terra sigillata: an archaeological application of Actor-Network Theory', which was supervised by Martin Millett."]}, {"page": "Millett, Martin", "response": ["#redirectMartin Millett"]}]}}