{"wiki_id": "http://www.wikidata.org/entity/Q6779105", "itemLabel": "Mary Boyle", "itemDescription": "British clinical psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Boyle_(psychologist)", "wikipedia_page": {"main": "Mary Boyle is a clinical psychologist. She is a Professor Emeritus at University of East London.", "link_mentions": [{"page": "Mary Boyle", "response": ["Mary Boyle may refer to:", "* Mary Boyle (psychologist), British clinical psychologist", "* Mary Boyle, Countess of Cork and Orrery (1746–1840), British literary hostess", "* Mary Boyle (born 1970), six-year-old girl who went missing in County Donegal, Ireland in 1977"]}, {"page": "Bobby Baker (artist)", "response": ["As an internationally acclaimed female artist with personal experience of mental illness and physical disability, Baker offers an authentic figure of recovery and leadership through creativity. She is uniquely positioned with the experience, insight, talent and extensive cross-disciplinary network to investigate and celebrate creative ways people manage difficulties and disenfranchisement. On 6 March 2020, as part of the Women of the World festival, Baker will lead a panel entitled Sticky Labels: Women and the Mental Health System, investigating why women have been branded everything from ‘witches’ to ‘morally insane’. It is described as a discussion to explore the politics of women and mental health, and the misogyny within the contemporary psychiatric diagnostic framework. Other panelists will include Dr. Leyla Hussein, Dr. Akima Thomas, and Professor Mary Boyle."]}, {"page": "Controversies about psychiatry", "response": ["Mary Boyle argues  that psychiatry is actually the study of behaviour, but acts as if it is the study of the brain based on a presumed connection between patterns of behaviour and the biological function of the brain. She argues that in the case of schizophrenia it is the bizarre behaviour of individuals that justifies the presumption of a biological cause for this behaviour rather than the existence of any evidence."]}]}}