{"wiki_id": "http://www.wikidata.org/entity/Q6779785", "itemLabel": "Mary Holt", "itemDescription": "British politician (born 1924)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Holt", "wikipedia_page": {"main": "Mary Holt (31 July 1924 – 17 February 2021) was a British Conservative politician and judge.", "link_mentions": [{"page": "February 1974 United Kingdom general election", "response": ["*Mary Holt (Preston North)"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Mary Holt"]}, {"page": "Preston North (UK Parliament constituency)", "response": ["| Mary Holt"]}, {"page": "Ronald Atkins", "response": ["As a Member of Parliament, he lobbied Wilson for a new polytechnic institute of education in Preston, which lead to Preston Polytechnic being established in 1973; this, according to the Lancashire Post, was \"one of his proudest moments\". Atkins also successfully campaigned to save the Preston to Ormskirk railway line, which was under threat of closure. During this period, he chaired the all-party retirement group, who fought for early retirement, in 1967 presenting a petition to Parliament for voluntary male retirement at 60, which was signed by more than a million people. He also supported Liberal MP David Steel's abortion bill, which did not go down well with Preston's large Catholic population. He thought this may have cost him his seat at the subsequent 1970 general election: Atkins lost to the Conservative candidate Mary Holt, and Labour were out of power.", "Following this, he lectured at Accrington College of Further Education until 1974, a year which saw two general elections take place. At the February 1974 election, Atkins won back Preston North, defeating Mary Holt by a majority of just 255 votes (0.63%). Labour formed a minority government, and Atkins was back in Parliament. Harold Wilson called another election for October 1974, in the hope of securing a majority. Atkins was re-elected with an increased vote share, and Labour won the election with a small overall majority, on the back of a pledge to hold a referendum on Britain's recent entry to the European Economic Community (EEC). In common with the left of his party at the time, Atkins was opposed to membership of the EEC. The 1975 referendum, however, resulted in a wide margin of victory for the 'Yes' campaign."]}, {"page": "1924 in the United Kingdom", "response": ["** Mary Holt, politician and judge (died 2021)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Mary Holt"]}, {"page": "List of United Kingdom MPs who died in the 2020s", "response": ["|Mary Holt"]}, {"page": "Deaths in February 2021", "response": ["*Mary Holt, 96, British politician, MP (1970–1974).Mary Holt"]}]}}