{"wiki_id": "http://www.wikidata.org/entity/Q6775112", "itemLabel": "Martin Cameron", "itemDescription": "Scottish footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Cameron_(footballer)", "wikipedia_page": {"main": "Martin George William Cameron (born 16 June 1978) is a Scottish football striker.\n\n", "link_mentions": [{"page": "Penicuik Athletic F.C.", "response": ["* Martin Cameron, who played for Alloa Athletic, Bristol Rovers, Partick Thistle, St Mirren, Gretna, Shamrock Rovers and Forfar Athletic."]}, {"page": "2003–04 Scottish Third Division", "response": ["|  Martin Cameron || style=\"text-align:center\"|17 || Gretna"]}, {"page": "Martin cameron (footballer)", "response": ["#REDIRECT Martin Cameron (footballer) "]}, {"page": "1999–2000 Scottish Second Division", "response": ["| Martin Cameron || Alloa Athletic || style=\"text-align:center;\"|16"]}, {"page": "1999 Scottish Challenge Cup Final", "response": ["Alloa led the match 2–1 at half-time but only two minutes after the interval both teams scored to make it 3–2 by the 47th minute. Paul Sheerin scored a second penalty for Inverness in the 56th minute to make the score 3–3 which is how the scoreline remained after 90 minutes, which forced an additional 30 minutes of extra time to be played. Martin Cameron scored his second goal for Alloa in the 104th minute to take a 4–3 lead but was cancelled out when Sheerin completed a hat-trick of goals for Inverness to make it 4–4 and take the game to penalties. Alloa Athletic emerged victorious after winning the shoot-out 5–4.Bell's Cup, scottishfootballleague.com. Scottish Football League. 2 November 2005. Retrieved 27 May 2013.", "Alloa Athletic also entered the first round and were drawn against Third Division club Cowdenbeath away from home. Goals from Martin Cameron, David Beaton, Gregor McKechnie and an own goal from Scott Sneddon was enough for Alloa to comfortably win 4–0 at Central Park and advance to the next round.\"BELL'S CHALLENGE CUP\", The Herald (Glasgow), 11 August 1999. Retrieved 28 May 2013. The second round also saw Alloa drawn away from home; facing First Division club Airdrieonians at Excelsior Stadium. With Airdrie the favourites to win the match, Alloa took a shock 2–0 lead with goals from Mark Nelson and Gregor McKechnie. Airdrie scored a consolation goal in the last minute from Forbes Johnston to make it 2–1, but Alloa held on to win and progressed to the quarter-finals.Burns, Scott. \"Wasps in night of cup glory\", Aberdeen Press and Journal, 25 August 1999. Retrieved 28 May 2013.", "Inverness played in a 4–4–2 formation whilst Alloa played a 3–4–3 arrangement. After ten minutes, Alloa missed a goal scoring opportunity when Martin Cameron's shot went above the cross-bar after a pass from Gary Clark and three minutes later Mark Wilson's shot forced a save from Inverness goalkeeper Les Fridge. Alloa scored the first goal of the game in the 19th minute with a 12-yard shot from Gary Clark when Inverness failed to clear the ball from a corner kick. Shortly after, Alloa went close to doubling their lead when Fridge was forced to make another save. Alloa dominated the match for most of the first half-hour but Inverness equalised the score at 1–1 on 28 minutes when Alloa goalkeeper Mark Cairns deflected the ball into the path of striker Barry Wilson after making his first save of the game from a shot by Davide Xausa. Three minutes later, Alloa midfielder Mark Wilson ran clear down the right wing and shot the ball past goalkeeper Fridge to restore Alloa's lead to 2–1 before half-time.", "|FW || || Martin Cameron "]}, {"page": "2002 Scottish Challenge Cup Final", "response": ["In the quarter-finals, Queen of the South played Second Division club Dumbarton, also at Palmerston Park. John O'Neill scored his second goal of the tournament to give Queen of the South the lead after 25 minutes.Queen of the South v Dumbarton – Scottish League Challenge Cup 20/8/2002, espnfc.com. ESPN FC. Retrieved 12 June 2013. Dumbarton had opportunities to score an equaliser for the remainder of the game but were denied by the home team's goalkeeper, Colin Scott. Despite Dumbarton's efforts, Queen of the South sealed the victory with a goal from Derek Lyle in the final minute of the match to win 2–0 and progress to the semi-finals.QoS 2–0 Dumbarton, news.bbc.co.uk. BBC Sport. 20 August 2002. Retrieved 12 June 2013. With four teams left in the tournament, Queen of the South travelled to Love Street to face fellow First Division club St Mirren.St Mirren v Queen of the South – Scottish League Challenge Cup 27/8/2002, espnfc.com. ESPN FC. Retrieved 12 June 2013. Paul Shields scored first for Queen of the South in the seventh minute but was cancelled out five minutes later with a goal from Brian McGinty to make it 1–1 before Derek Lyle put Queen of the South back in front shortly before half time. Early in the second half, both teams scored again; Martin Cameron for St Mirren and Steve Bowey for Queen of the South to make the scoreline 3–2 to the away team. With ten minutes left to play, Gerhard Fellner equalised for St Mirren to make it 3–3 but late goals in the final two minutes from a Peter Weatherson free kick and Shields' second goal of the game won the match 5–3 and sent Queen of the South into the final for the second time in its history.St Mirren 3–5 Queen of the South, news.bbc.co.uk. BBC Sport. 27 August 2002. Retrieved 12 June 2013."]}, {"page": "List of Alloa Athletic F.C. seasons", "response": ["|Martin Cameron"]}, {"page": "List of St Mirren F.C. seasons", "response": ["|Martin Cameron"]}]}}