{"wiki_id": "http://www.wikidata.org/entity/Q6773834", "itemLabel": "Marshall Warmington", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Marshall_Warmington", "wikipedia_page": {"main": "Sir Cornelius Marshall Warmington, 1st Baronet QC (5 June 1842 – 12 December 1908) was an English barrister and Liberal politician.\nWarmington was born at Colchester, Essex. He became a member of the Middle Temple and was invested as Queen's Counsel in 1882. In 1885 he was elected as Member of Parliament for West Monmouthshire. He held the seat for 10 years, and gave it up in 1895 to make way for William Vernon Harcourt. Warmington was at various times Treasurer and Master of Middle Temple. He was created a baronet, of Pembridge Square, on 28 July 1908, six months before his death.\nWarmington married Anne Winch daughter of Edward Winch of Chatham  and they had a family. His son Denham succeeded to the baronetcy.\n\n", "link_mentions": [{"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Marshall Warmington"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Marshall Warmington"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Marshall Warmington"]}, {"page": "West Monmouthshire (UK Parliament constituency)", "response": ["| Marshall Warmington"]}, {"page": "Warmington baronets", "response": ["The Warmington baronetcy, of Pembridge Square in the Royal Borough of Kensington, is a title in the Baronetage of the United Kingdom. It was created on 28 July 1908 for Marshall Warmington, Liberal Member of Parliament for West Monmouthshire from 1885 to 1895.", "*Sir Cornelius Marshall Warmington, 1st Baronet (1842–1908)", "*Sir David Marshall Warmington, 5th Baronet (1944–2005)", "*Sir Rupert Marshall Warmington, 6th Baronet (born 1969)"]}, {"page": "Cornelius Warmington", "response": ["#REDIRECT Marshall Warmington"]}, {"page": "Sir Marshall Warmington, 1st Baronet", "response": ["#REDIRECT Marshall Warmington"]}, {"page": "Harry Trusted", "response": ["He had married Mary Warmington, daughter of Sir Marshall Warmington, 1st Baronet. They had 2 sons and 3 daughters. His son John Marshall Trusted died at 21."]}]}}