{"wiki_id": "http://www.wikidata.org/entity/Q6775119", "itemLabel": "Martin Carr", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Carr", "wikipedia_page": {"main": "Martin Carr (born 29 November 1968) is an English musician and writer who was the chief songwriter and lead guitarist with the band The Boo Radleys.  Born in Thurso, Scotland, he was raised in Wallasey, England.\n\n", "link_mentions": [{"page": "The Diggers (band)", "response": ["Members Miezitis and Moffatt had attended school together and began playing as an acoustic duo in the early 1990s. In 1991 they moved to Glasgow, and added members Eslick and Ross. After a 1993 car crash, the group was noticed by Martin Carr of The Boo Radleys, who got them signed to Creation Records. They opened for Super Furry Animals on tour in 1997, and released their debut album for Creation, Mount Everest."]}, {"page": "Richard Brautigan", "response": ["Trout Fishing in America is a musical duo which performs folk rock and children's music. Neko Case based her song \"Margaret vs. Pauline\" on the female characters of In Watermelon Sugar. The band b-flower is named after Richard Brautigan, being a shortened version of \"Brautigan Flower\". They also reference his work in songs such as \"The Eternal 59th Second\" (titled after a line in \"Trout Fishing in America\"). The Lovely Eggs praise Brautigan in their song \"Have You Ever Heard A Digital Accordion?\".  The song \"Brought Again\"  by Atlanta band \"Insane Jane\" on their 1993 album \"Each Finger\" is a reference to Brautigan. The Boo Radleys' song \"Boo Forever\", released in 1992, was written about Brautigan and songwriter Martin Carr released a solo album, All Watched Over By Machines Of Loving Grace, in 2004. The documentarian Adam Curtis produced a series of films for the BBC about the effect of computers on society called All Watched Over by Machines of Loving Grace."]}, {"page": "1968 in music", "response": ["**Martin Carr (Boo Radleys)"]}, {"page": "The Boo Radleys", "response": ["The Boo Radleys are an English alternative rock band who were associated with the shoegazing and Britpop movements in the 1990s. They originally formed in Wallasey, England in 1988, with Rob Harrison on drums, singer/guitarist Simon \"Sice\" Rowbottom, guitarist/songwriter Martin Carr, and bassist Timothy Brown. Their name is taken from the character Boo Radley in Harper Lee's 1960 novel, To Kill a Mockingbird. Shortly after the release of their first album Ichabod and I, Steve Hewitt replaced Robert Harrison on drums and was in turn replaced by Rob Cieka. The band split up in 1999. In their 11-year-long career, the band had one top ten single, the 1995 single \"Wake Up Boo!\", which charted at no. 9; and a number one album, Wake Up!. The band reunited in 2021, without original guitarist Martin Carr, and released a single, \"A Full Syringe and Memories of You,\" their first new music since 1998. Paul Banks of Interpol has cited the band as an influence.", "In July 2021, the band released their first new single in 23 years, \"A Full Syringe and Memories of You\", part of an EP of the same name. Upon the single's release, it was confirmed that original guitarist Martin Carr had not taken part in the reunion.", "* Martin Carr  - guitar, vocals, keyboards (1988-1999)"]}, {"page": "Thurso", "response": ["*Martin Carr (born 1968) — writer and musician."]}, {"page": "Alfred I. duPont–Columbia University Award", "response": ["*NBC News, Martin Carr, “White Paper: This Child is Rated X”"]}, {"page": "Carr (name)", "response": ["*Martin Carr (born 1968), British musician"]}, {"page": "Bravecaptain", "response": ["#REDIRECTMartin Carr"]}, {"page": "Wake Up! (The Boo Radleys album)", "response": ["All songs written by Martin Carr. ", "*Martin Carr - guitar, keyboards, vocals"]}, {"page": "Brave Captain", "response": ["#REDIRECT Martin Carr"]}, {"page": "Akira the Don", "response": ["| Featuring Martin Carr"]}, {"page": "Tapete Records", "response": ["* Martin Carr"]}, {"page": "Giant Steps (The Boo Radleys album)", "response": ["All songs and lyrics written by Martin Carr.", "*Martin Carr – guitar, keyboards, vocals", "* BOO! Productions (Martin Carr, Tim Brown & Andy Wilkinson) – production, remixing on \"Lazarus\""]}, {"page": "St Mary's College, Wallasey", "response": ["* Martin Carr (b 1968), chief songwriter and lead guitarist with The Boo Radleys."]}, {"page": "Everything's Alright Forever", "response": ["*Martin Carr - guitar, keyboards, vocals"]}, {"page": "C'mon Kids", "response": ["All songs written by Martin Carr.", "* Martin Carr – guitar"]}, {"page": "Kingsize (The Boo Radleys album)", "response": ["*Martin Carr - guitar, keyboards, vocals"]}, {"page": "Ichabod and I", "response": ["*Martin Carr - guitar, keyboards, vocals"]}, {"page": "Learning to Walk (The Boo Radleys album)", "response": ["All tracks written by Martin Carr, except track 9 by Carr and Bryan MacLean and track 14 by The Boo Radleys and New Order."]}, {"page": "Fingertip Saint Sessions Vol 1", "response": ["#REDIRECT Martin Carr"]}, {"page": "Go With Yourself: Fingertip Saint Sessions Vol 2", "response": ["#REDIRECT Martin Carr"]}, {"page": "Allonewordsmallbee", "response": ["#REDIRECT Martin Carr"]}, {"page": "Grindie", "response": ["Akira the Don, who signed to Interscope Records in 2004, released multiple mixtapes sampling rock and indie artists, including the \"Third Hand Wire Riffs mixtape featuring Elastica Big Narstie, Lethal Bizzle, Martin Carr of The Boo Radleys  amongst others. "]}, {"page": "All Watched Over by Machines of Loving Grace (poetry collection)", "response": ["The title was later used by Tucson, Arizona industrial rock band Machines of Loving Grace, formed in 1989, and in its full form by British musician Martin Carr as the title of a 2004 album, by the musician Martha Tilston for the title of her album \"Machines Of Love And Grace\", as well as a 2011 television series by documentary maker Adam Curtis. Machines of Loving Grace is also the title of a 2015 nonfiction book by John Markoff, documenting robotics transforming society."]}, {"page": "Oh Yeah (Ash song)", "response": ["# \"Everywhere Is All Around\" (Wheeler, Martin Carr)"]}, {"page": "David Baker (singer)", "response": ["Baker produced the album World under the name Shady. The album featured contributions from artists such as Adam Franklin from Swervedriver, Martin Carr from The Boo Radleys, Jimi Shields from Rollerskate Skinny, Bill Whitten from St. Johnny and Grand Mal, and Sooyoung Park from Seam. A music video for the song \"Narcotic Candy\" was directed by Jim Spring and Jens Jurgensen. He then moved to Chicago, where he is a studio engineer, and has produced a number of bands, such as Comet, from Mesquite, TX, and Marvelkind from Chicago."]}, {"page": "Wake Up Boo!", "response": ["According to Martin Carr, he spent a year working on the song's music. He described the lyrics of the song as being \"about staying up all night\". In a 2021 interview, Sice said that \"Wake Up Boo!\" was \"about grabbing the last of summer while you can\", and described it as a reflection of Carr's personality: \"He can be very up and ebullient – 'Wake up, it’s a beautiful morning' – and then he can have that drop: 'You have to put the death in everything'\". The band first recorded the song at Real World Studios in a heavier, more downbeat arrangement, which Tim Brown described as \"a bit underwhelming\". After pressure from Creation Records, they re-recorded it at Rockfield Studios, where they were inspired to use a Motown beat after listening to a Style Council b-side. They also recruited Tom Jones' brass section to play on the track.", "* Martin Carr – backing vocals, guitar, keyboards, writer"]}, {"page": "The Hillman Prize", "response": ["| 1971 ||Broadcast ||Martin Carr ||\"This Child Is Rated X\" ||NBC-TV ||||"]}, {"page": "1968 in British music", "response": ["*29 November – Martin Carr (Boo Radleys)"]}, {"page": "Marc Carroll", "response": ["Returning to Dublin in 1990, Carroll was the sole songwriter and founding member of Dublin three piece power/punk band, Puppy Love Bomb. The group gained notoriety for ferocious live shows but are perhaps best remembered for the provocative T-shirt with the slogan \"Dublin Is Dead\" which were sold at early performances.  The band recorded several radio sessions for the Dave FanningPuppy Love Bomb 1993 Session 29 August 2013 \"Fanning Sessions Archive\" show and were courted by record labels, notably Warner Brothers, before eventually signing with the UK independent label Rough Trade and releasing 3 singles. Two EPs were produced by Martin Carr of The Boo Radleys. The band toured across Europe with Bob Mould's post Hüsker Dü outfit, Sugar. Mould joined the band on the last night of the tour to play a version of The Beatles classic song, Ticket To Ride.Hot Press Magazine 16 November 1994 \"Interview Quote\" No album ever materialised as the label fell into financial difficulties and the band split acrimoniously after a final show at the South by Southwest Festival in Austin, Texas. Carroll returned to London where Rough Trade took over his management. The group's official recorded output has been out of print since 1994. Although the band only released 10 songs commercially, outtakes, radio sessions, demos and unreleased material have surfaced on several bootleg CDs originating from Japan with the most popular title being \"Destroy All Melody\" which features live performances from 1992 and a recording of \"Ticket To Ride\" performed with Bob Mould.  Puppy Love Bomb's recorded output and copyright is now under the ownership of One Little Indian Records. "]}, {"page": "New Shapes of Life", "response": ["New Shapes of Life is the third studio album by musician Martin Carr. It was released on 27 October 2017 through Tapete Records."]}, {"page": "Greg Haver", "response": ["Haver worked on Martin Carr's album, New Shapes of Life. He worked on the Snow Bound for The Chills, which was released on 14 September 2018. His recent releases also include the Red album for Devilskin, Horizon for Ekko Park and has become a member of the band Gramsci.", "* Martin Carr - New Shapes of Life (2017)"]}, {"page": "Mother's Little Helpers (Helstrom)", "response": ["Martin Carr of Flickering Myth compared the show to The CW's Constantine series, which also followed an exorcist and was cancelled after one season, though also saying \"yet [Helstrom] feels expansive, less formulaic and more invested. A theological emissary provides essential scepticism, while medical opinions ground the whole endeavour with reasoned logic.\" Carr still praised some aspects of the series, saying \"At just under an hour it also feels full bodied, draws you in quickly and delivers the basis for a series which has every right to get a second season. This might not be Daredevil but given time it could be.\" A review on Metawitches also spoke of the traumatized past through which the Helstrom children lived, saying it was not unlike that in Marvel's Netflix television series, such as Iron Fist and The Defenders."]}]}}