{"wiki_id": "http://www.wikidata.org/entity/Q6779498", "itemLabel": "Mary Eva Kelly", "itemDescription": "Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Eva_Kelly", "wikipedia_page": {"main": "Mary Eva Kelly (later O'Doherty) (1826–1910) was an Irish-Australian poet and writer who was widely known as \"Eva\" of \"the Nation\".", "link_mentions": [{"page": "Mary Kelly", "response": ["*Mary Eva Kelly (1826–1910), Irish poet and writer"]}, {"page": "The Nation (Irish newspaper)", "response": ["Women wrote for the paper, and published under pseudonyms such as Mary (Ellen Mary Patrick Dowling); Speranza (Jane Elgee, Lady Wilde, Oscar Wilde's mother), known universally as \"Speranza\" of The Nation; and Eva (Mary Eva Kelly, who would marry Kevin Izod O'Doherty).  These three were known as the \"Three Graces\" of The Nation.  Eithne (Marie Thompson), Finola (Elizabeth Willoughby Treacy), Ruby (Rose Kavanagh) and Thomasine (Olivia Knight) were others.  In July 1848 Jane Wilde and Margaret Callan assumed editorial control of The Nation during Gavan Duffy's imprisonment in Newgate."]}, {"page": "1826 in literature", "response": ["*Mary Eva Kelly, Irish-born Australian poet (died 1910)"]}, {"page": "Kevin Izod O'Doherty", "response": ["O'Doherty arrived in Tasmania in November 1849, was at once released on parole to reside at Oatlands, and his professional services were utilised at St. Mary's Hospital, Hobart. The other Irish prisoners nicknamed him 'St Kevin'.(see, Christine Kinealy, 'Repeal and Revolution. 1848 in Ireland', Manchester, 2009). In 1854 received a pardon with the condition that he must not reside in Great Britain or Ireland. He went to Paris and carried on his medical studies, making one secret visit to Ireland to marry Mary Eva Kelly, to whom he was affianced before leaving Ireland. He received an unconditional pardon in 1856, and completed his studies in Dublin, graduating FRCS in 1857. He practised in Dublin successfully, and in 1862 went to Brisbane, Australia and became well known as one of its leading physicians."]}, {"page": "Donnchad Grana Ó Cellaigh", "response": ["*Mary Eva Kelly"]}, {"page": "Feardorcha Ó Cellaigh", "response": ["* Mary Eva Kelly"]}, {"page": "Olivia Knight", "response": ["Knight began to correspond with editors of The Nation in 1844, using the nom de plume \"Thomasine\". The name was likely in honour of Thomas Davis. Having corresponded with the Nation's editors for a number of years, she became a regular contributor in after the publication's revival in 1849. As \"Thomasine of the Nation\" she contributed prose, poems, and verse translations, in keeping with the Nation's nationalist tone. The themes of her poetry were emigration, separation, exile, alongside hope and religious faith. Knight's translations were primarily works of fiction, such as short stories in historical settings and contemporary fables on relevant topics including freedom of speech. These were mostly from French, and were published in the 1850s. Her translations were also published in James Duffy's magazines. During the period that Knight wrote for the Nation, she interacted with Mary Eva Kelly, who was known as \"Eva of the Nation\"."]}, {"page": "List of Irish women writers", "response": ["*Mary Eva Kelly (1826–1910), poet, emigrated to Australia"]}, {"page": "Mary Eva O'Doherty", "response": ["#REDIRECT Mary Eva Kelly"]}, {"page": "Eva Kelly", "response": ["#Redirect Mary Eva Kelly"]}, {"page": "List of women writers (A–L)", "response": ["*Mary Eva Kelly (1826–1910, Ireland/Australia), poet & es."]}]}}