{"wiki_id": "http://www.wikidata.org/entity/Q6776561", "itemLabel": "Martin Scott", "itemDescription": "English footballer and manager (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Scott_(English_footballer)", "wikipedia_page": {"main": "Martin Scott (born 7 January 1968) is an English former football player and coach. Scott made over 350 Football League appearances as a left back during the 1980s and 1990s.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["|1991–92|| Martin Scott||Defender"]}, {"page": "Hartlepool United F.C.", "response": ["The club finished sixth in the league again in the 2004–05 season, despite the departure of Cooper just before the end of the season due to personal issues. In the play-off semi-final, they defeated Tranmere Rovers 6–5 on penalties after the sides had each won their home leg 2–0. The club failed to win promotion, losing 4–2 to Sheffield Wednesday after extra time in front of an attendance of 59,808 in the play-off final. Hartlepool had been leading 2–1 with eight minutes of regular time to go, but a controversial penalty decision in the 82nd minute, which also saw Chris Westwood sent off, allowed Sheffield Wednesday to level the scores making it 2–2 at the end of 90 minutes. Hartlepool missing a key defender, struggled in extra time and conceded two goals. Following this achievement Cooper's assistant Martin Scott was appointed as manager.", "The 2005–06 season saw the side slip down the division to the relegation places helped in part by poor management, an indecisive board room and key player injuries. Manager Martin Scott was suspended after an alleged fight with a player in the changing rooms, which resulted in his dismissal. Youth team coach Paul Stephenson was put in charge until the end of the season, aided by former manager Chris Turner who returned to the club as Director of Sport, and despite remaining undefeated in his first five games in charge, he could not prevent the club being relegated into the fourth tier in May 2006. Some felt that Hartlepool's relegation was unfair given that Rotherham United had escaped administration, and therefore a 10-point deduction and relegation, by delaying a CVA meeting until after the season had ended."]}, {"page": "Martin Scott", "response": ["Martin Scott may refer to:", "* Martin Scott (politician), representative of District 2 to the Georgia House of Representatives", "* Martin Scott (cricketer) (born 1943), cricketer", "* Martin Scott (English footballer) (born 1968), played for Rotherham United, Bristol City and Sunderland, former manager of Hartlepool United F.C.", "* Martin Scott (Scottish footballer) (born 1986), played for Hibernian, Ross County and Livingston", "* Martin Scott (military officer), signatory of the Treaty of St. Peters", "* Martin Scott (writer), pseudonym of Martin Millar, author of the Thraxas fantasy series", "* Martin Scott (FDNY Commissioner) (1898–1979), Fire Commissioner of the City of New York"]}, {"page": "Neill Collins", "response": ["He never appeared in the top-flight for the Black Cats after Alan Stubbs was signed, and was instead loaned out to League One side Hartlepool United in August 2005. He made 25 appearances for Martin Scott's Pools during his stay at Victoria Park. He was loaned out to Neil Warnock's Championship promotion hopefuls Sheffield United in February 2006. The Blades succeeded in winning promotion in 2005–06, though Collins featured in just two games at Bramall Lane."]}, {"page": "Neale Cooper", "response": ["Cooper's assistant Martin Scott took temporary command and Cooper's players made the play-off final, losing 4-2 to Sheffield Wednesday after extra time."]}, {"page": "Ken Hodcroft", "response": ["1997, Hodcroft then moved back into football when IOR bought Hartlepool United from Harold Hornsey. Hodcroft then took over as chairman. During Hodcroft's early reign as chairman he appointed four managers: Chris Turner in 1999, Mike Newell in 2002, Neale Cooper in 2003 and Martin Scott in 2005. In 2005 after the departure of Neale Cooper, Hodcroft was heavily criticised by the fans of Hartlepool for having a “lack of ambition”. However, Hodcroft responded issuing a statement stating that IOR were fully committed to the club. His fifth manager, Danny Wilson, was appointed in 2006 and left in December 2008. Chris Turner, then Hartlepool's Director of Sport, was appointed temporary manager before accepting the job again on a permanent basis."]}, {"page": "Darrell Clarke", "response": ["In the 2004–05 season, Clarke suffered a knee injury that prevented him from taking part in any of Hartlepool's league games. He was loaned out to Stockport County – managed by former Hartlepool boss Chris Turner – in order to gain fitness in January, but this was cut short as Clarke picked up another knee problem after just one game. His knee injury caused him to miss the second half of the campaign. In September 2005 Clarke was loaned to Port Vale, but played just two minutes after being utilised as a late substitute by manager Martin Foyle. Despite his return to full fitness being described by manager Martin Scott as a 'massive boost', his appearances were again limited once he returned to Victoria Park. In July 2006 he was loaned to Rochdale, where he made 12 appearances, scoring one goal. He was released by 'Pool manager Danny Wilson in May 2007."]}, {"page": "Paul Stephenson (footballer)", "response": ["After Stephenson's retirement, he immediately joined the coaching staff at Hartlepool and became an assistant youth-team coach. Following Martin Scott's promotion to the assistant manager's position, Stephenson was made the main youth team coach. Stephenson guided the youth team to victory in the Under 19s section of the Dallas Cup. Towards the end of the 2005–06 season, Stephenson was appointed as Hartlepool's caretaker manager after the dismissal of Scott. His first game in charge was a goalless draw against Rotherham. In his second game he managed to guide the team to a single-goal victory over Chesterfield. He was undefeated in his first five games in charge. However, Hartlepool slipped back into the relegation zone and were eventually relegated on the last day of the season. Stephenson stated that he did not want to take over as manager and wanted to remain a coach, and he returned to his job as youth team coach. Upon the arrival of new manager Glenn Roeder at Norwich, and his decision to build his own backroom staff, Stephenson was offered the job of first-team coach in early November 2007. Despite some trouble with the Hartlepool chairman regarding compensation, Roeder was ultimately successful with the appointment, and Stephenson commenced work with the Canaries two months later."]}]}}