{"wiki_id": "http://www.wikidata.org/entity/Q6788357", "itemLabel": "Matt Black", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Black_(DJ)", "wikipedia_page": {"main": "Matt Black (real name Matthew Cohn) is a British DJ and one half of music duo Coldcut (along with Jonathan More), which founded the Ninja Tune record label.As a student at New College, Oxford, he was a member of a band called The Jazz Insects, whose first single was played by John Peel in his radio show.Black is one of the inventors of the VJamm software used in the Coldcut live shows and also co-developed a \"granular video synthesizer\" titled Granul8. He is also a founding member of the (now defunct) VJ group Hex, and of the VJ group The VJamm Allstars with whom he continues to perform shows and has also worked alongside Crass Agenda as part of the Savage Utopia project.", "link_mentions": [{"page": "Coldcut", "response": ["Coldcut are an English electronic music duo composed of Matt Black and Jonathan More. Credited as pioneers for pop sampling in the 1980s, Coldcut are also considered the first stars of UK electronic dance music due to their innovative style, which featured cut-up samples of hip-hop, soul, funk, spoken word and various other types of music, as well as video and multimedia. According to Spin, \"in '87 Coldcut pioneered the British fad for 'DJ records'\".", "In 1986, computer programmer Matt Black and ex-art teacher Jonathan More were part-time DJs on the rare groove scene. More also DJed on pirate radio, hosting the Meltdown Show on Kiss FM and worked at the Reckless Records store on Berwick Street, London where Black visited as a customer. The first collaboration between the two artists was \"Say Kids What Time Is It?\" on a white label in January 1987, which mixed The Jungle Book's \"King of the Swingers\" with the break from James Brown's \"Funky Drummer\". The innovation of \"Say Kids...\" caused More and Black to be heralded by SPIN as \"the first Brit artists to really get hip-hop's class-cutup aesthetic\". It is regarded as the UK's first breaks record, the first UK record to be built entirely of samples and \"the final link in the chain connecting European collage-experiment with the dance-remix-scratch edit\". This was later sampled in \"Pump Up the Volume\" by MARRS, a single that reached #1 in the UK in October 1987.", "As part of the JAM exhibition of \"Style, Music and Media\" at the Barbican Art Gallery in 1996, Coldcut and Hex were commissioned to produce an interactive audiovisual piece called Synopticon. Conceived and designed by Robert Pepperell and Matt Black, the digital culture synthesiser allows users to \"remix\" sounds, images, text and music in a partially random, partially controlled way.", "In 1997, Matt Black - alongside Cambridge based developers Camart - created real-time video manipulation software VJAMM. It allowed users to be a \"digital video jockey\", remixing and collaging  sound and images  and trigger audio and visual samples simultaneously, subsequently bringing futuristic technology to the audio-visual field. VJAMM rivalled some of the features of high-end and high cost tech at the time. The VJAMM technology, praised as being proof of how far computers changed the face of live music, became seminal in both Coldcut's live sets (which were called a \"revelaton\" by Melody Maker  and DJ sets. Their CCTV live show was featured at major festivals including Glastonbury, Roskilde, Sónar, the Montreux Jazz Festival, and John Peel's Meltdown. The \"beautifully simple and devastatingly effective\"  software was deemed revolutionary, and became recognized as a major factor in the evolution of clubs. It eventually earned a place in the American Museum of the Moving Image's permanent collection. As quoted by The Independent, Coldcut's rallying cry was \"Don't hate the media, be the media'\". NME was quoted as saying: \"Veteran duo Coldcut are so cool they invented the remix - now they are doing the same for television.\"", "Also working with Camart, Black designed DJamm software in 1998, which Coldcut used on laptops for their live shows, providing the audio bed alongside VJAMM's audiovisual samples. Matt Black explained they designed DJamm so they \"could perform electronic music in a different way – i.e., not just taking a session band out to reproduce what you put together in the studio using samples. It had a relationship to DJing, but was more interactive and more effective.\" Excitingly at that time, DJamm was pioneering in its ability to shuffle sliced loops into intricate sequences, enabling users to split loops into any number of parts.", "Coldcut returned with the single \"Everything Is Under Control\" at the end of 2005, featuring Jon Spencer (of Jon Spencer Blues Explosion) and Mike Ladd. It was followed in 2006 by their fifth studio album Sound Mirrors, which was quoted as being \"one of the most vital and imaginative records Jon Moore and Matt Black have ever made\", and saw the duo \"continue, impressively, to find new ways to present political statements through a gamut of pristine electronics and breakbeats\" (CITATION: Future Music, 2007). The fascinating array of guest vocalists  included Soweto Kinch, Annette Peacock, Ameri Baraka, and Saul Williams. The latter followed on from Coldcut's remix of Williams' \"The Pledge\" for a project with DJ Spooky.", "Starting in 2009, Matt Black, with musician/artist/coder Paul Miller (creator of the TX Modular Open Source synth), developed Granul8, a new type of visual fx/source Black termed a \"granular video synthesiser\". Granul8 allows the use of realtime VJ techniques including video feedback combined with VDMX VJ software.", "* Interview with Matt Black on R4NT Magazine"]}, {"page": "Ninja Tune", "response": ["Ninja Tune is an English independent record label based in London. It has a satellite office in Los Angeles. It was founded by Matt Black and Jonathan More (better known as Coldcut) and managed by Peter Quicke and others.", "In 1994, Matt Black's close friend Mixmaster Morris introduced Matt to Openmind – a DJ & design collective in Camberwell – at the Telepathic Fish chill-out club they were running. Openmind included Kevin Foakes a.k.a. Strictly Kev of DJ Food. After submitting a re-styled company logo he was employed by Ninja Tune in the capacity of overall design consultant. Matt Black also invited Foakes to Ninja's recording studio, where he eventually joined the many hands at work on DJ Food's 1995 album, Recipe for Disaster (which also included Patrick Carpenter a.k.a. PC, Isaac Elliston, Paul Rabiger and Paul Brooks). The album was called a \"whirlwind of beats put through the blender\" and proved a good cross-selection of the group's various styles.", "Throughout the 1990s, Matt Black began exploring his own interests in burgeoning computer and audio/visual technologies, to experiment with the VJ software and hardware that was already changing the Coldcut DJ performances. His Hex collective – also featuring artist Robert Pepperell and programmer Miles Visman – produced video games and multimedia CD-Roms in the early 1990s, along with subsequent projects that further affirmed Ninja Tune's alliance with A/V disciples. Teaming up with Hexstatic member Stuart Warren-Hill (who also signed to the Ntone label for several audio visual albums), Coldcut's \"Timber\" video – an AV collage piece using analogous techniques to audio sample collage – was put on heavy rotation on MTV, and won awards for its innovative use of repetitive video clips synced to the music, including being shortlisted at the Edinburgh Television and Film Festival in their top five music videos of the year in 1998.", "In 1995, Matt Black created Pipe, Ninja's first website. The label's current website ninjatune.net was developed by the following year.", "Coldcut returned with the single \"Everything Is Under Control\" at the end of 2005, featuring Jon Spencer (of Jon Spencer Blues Explosion) and Mike Ladd. It was followed in 2006 by their fifth studio album Sound Mirrors, which was quoted as being \"one of the most vital and imaginative records Jon More and Matt Black have ever made\", and saw the duo \"continue, impressively, to find new ways to present political statements through a gamut of pristine electronics and breakbeats\". The fascinating array of guest vocalists included Soweto Kinch, Annette Peacock, Amiri Baraka, and Saul Williams.", "As the imprint grew, Ninja grew into an 'anti-corporate' brand, supporting the work of visual artists, filmmakers, and mavericks of all media, running its own club nights and helping disseminate the work of its artists across the globe. From its very beginnings, Ninja Tune sought a strong visual identity, thanks to Michael Bartalos (whose original logo was a monochrome woodcut of a hooded ninja brandishing his long sword) and Mark Porter, Matt Black's friend from Oxford, Ninja's first art director who defined the logo and overall aesthetic (in addition to creating Ninja's striking yellow and black in-house record bags), and subsequently became Art Director at The Guardian. It was the arrival of Kevin Foakes as in-house designer in 1994 that developed the logo to its current international recognition, and became largely responsible for some of the label's most iconic artwork. Working as Openmind, Foakes has designed many of Ninja's album sleeves, including memorable covers for Amon Tobin, Coldcut and Funki Porcini's 2002 album Fast Asleep. He's also commissioned acclaimed outside talent for a number of key projects."]}, {"page": "Penny Rimbaud", "response": ["Since 2003, Rimbaud has worked as part of Last Amendment on live performances and CD releases. Titles include Savage Utopia, a collaboration with Coldcut's Matt Black and other jazz musicians, and How?, a reworking of Allen Ginsberg's beat poem Howl, which was recorded live at the Vortex Jazz Club. In 2007, Rimbaud worked on a \"Jazz Requiem\" with saxophonist Ed Jones."]}, {"page": "Last Amendment", "response": ["* Savage Utopia – featuring Eve Libertine, Christine Tobin, A-Soma, Louise Elliot, Kevin Davy, Phil Robson, Liam Noble, Davide Mantovani, Matt Black (of Coldcut) performing work by Penny Rimbaud (Babel Label/Exitstencil, 2004)"]}, {"page": "The Big Chill (music festival)", "response": ["Founded in 1994 by Pete Lawrence and Katrina Larkin,Katrina Larkin, \"After the festival party\" The Guardian, Saturday 2 May 2009. The Big Chill began as a series of ambient parties at the Union Chapel in Islington, but developed into an outdoor festival in 1995, with an unlicensed event in the Black Mountains of Wales.BBC Hereford and Worcester, A short history of the Big Chill. In the early days the most prominent DJs were Matt Black of Coldcut, Tom Middleton of Global Communication and Mixmaster Morris, also known as the Irresistible Force.", "1995 Big Chill Gala, Llanthony, Black Mountains, Wales: Nightmares On Wax (DJ set), Global Communication, The Gentle Experience (Gentle People vs Karminsky Experience), Spring Heel Jack, Mixmaster Morris, Matt Black, Another Fine Day."]}, {"page": "Wells Coates", "response": ["Wells Coates died of a heart attack in Vancouver on June 17, 1958 at the age of 63. Coates was married to Marion Grove in 1927. They had one child, Laura, and separated in 1937.Wells Coates: Marion, Wellscoates.org. Accessed February 7, 2017. Coates' grandson is Matt Black of the electronic music duo Coldcut.Daniel Wittenberg, (July 9, 2014) Plaque unveiled to mark 80 years of Hampstead modernist icon the Isokon Building, Ham&High, Archant Community Media Ltd. Accessed February 7, 2017."]}, {"page": "Top Banana (video game)", "response": ["Top Banana is an environmentally-themed platform game produced by Hex and Psycore for the Acorn Archimedes in 1991 and ported to the Amiga and Atari ST in 1992. The chief artist and coder was Miles Visman, with supporting graphics and sound by Karel Dander, and supporting graphics by Sophie Smith, Robert Pepperell and Matt Black. Top Banana was released using recycled cardboard packaging, furthermore being advertised as being the 'first video game with recycled packaging'. Top Banana's plot is about trying to save the environment from pollution using love.", "Many of Top Banana's sprites are taken from videos and television for use in the game, much in the same way audio may be sampled in music. Musician and Coldcut member Matt Black worked on Top Banana, and later members of the Hex multimedia group formed Hexstatic. Top Banana was playtested in the Netherlands. Top Banana cost 329 Swedish Kronor in 1992.", "Top Banana's developer & publisher Hex is also known as Hardwire, a company specializing in computer graphics work for music videos. Hex spokesman Robert Pepperell stated in an article in a May 1991 issue of The One that Top Banana was developed because Hex believed \"a computer game would be an interesting challenge\", and because \"Most games look rather sterile. We wanted to do something really different and positive. The technique of video sampling has never been used in a game before. Top Banana really looks and sounds completely different to any other computer game yet written.\" Matt Black was initially going to make a cameo appearance in Top Banana as a manic bongo player, but this is absent in the final game. The screenshot of Top Banana featured in The One's article is drastically visually different to that of the final game, with a differing artstyle, a top-down perspective as opposed to a 2D one, and depicts a performance hall with a piano, a location absent in the final game."]}, {"page": "Kiss (UK radio station)", "response": ["From 1985, DJs and presenters have included: Norman Jay, Coldcut (Matt Black & Jonathan More), Paul Trouble Anderson, Colin Dale, Colin Faver, Judge Jules, Tim Westwood, Lindsay Wesker, Max LX & Dave VJ, Jazzie B, Steve Jackson, Trevor Nelson, Lisa l'Anson, Danny Rampling and Richie Rich. At its legal launch and early 1990s, this would also include Graham Gold, Dave Pearce, David Rodigan, Patrick Forge, Somethin' Else (Chris Phillips & Jez Nelson), and Gilles Peterson."]}, {"page": "Si Begg", "response": ["He moved to London in the 1990s, where he met Jonathan More and Matt Black of Coldcut through the local music scene. Begg's works as Cabbage Boy were subsequently released on their Ninja Tune sub-label, Ntone."]}, {"page": "Eve Libertine", "response": ["She was one of the vocalists who worked with the British anarcho-punk band Crass. Her works with the band include the single \"Reality Asylum\", as well as performing most of the vocals on the group's third album, Penis Envy (1981), the lyrics of which have a heavy anarcha-feminist content. After the dissolution of Crass in 1984, Libertine worked with her son Nemo Jones, a guitarist. She trained as a classical singer and has performed as part of Crass Agenda (renamed Last Amendment as of 2005) and with Penny Rimbaud, Matt Black, Christine Tobin, Julian Siegel, Ingrid Laubrock, Nabil Shaban, and Kate Shortt."]}, {"page": "Solid Steel", "response": ["In 1988, Solid Steel began as a radio show on Kiss FM hosted by Coldcut's Matt Black and Jonathan More, where they were not only able to play and mix records, but also display their cut-up technique live. The show was known for airing \"The Broadest Beats in London\""]}, {"page": "Crass", "response": ["In November 2002 several former members arranged Your Country Needs You, a concert of \"voices in opposition to war\", as the Crass Collective. At Queen Elizabeth Hall on London's South Bank, Your Country Needs You included Benjamin Britten's War Requiem and performances by Goldblade, Fun-Da-Mental, Ian MacKaye and Pete Wright's post-Crass project, Judas 2. In October 2003 the Crass Collective changed their name to Crass Agenda, with Rimbaud, Libertine and Vaucher working with Matt Black of Coldcut and jazz musicians such as Julian Siegel and Kate Shortt. In 2004 Crass Agenda spearheaded a campaign to save the Vortex Jazz Club in Stoke Newington, north London (where they regularly played). In June 2005 Crass Agenda was declared to be \"no more\", changing its name to the \"more pertinent\" Last Amendment. After a five-year hiatus, Last Amendment performed at the Vortex in June 2012. Rimbaud has also performed and recorded with Japanther and the Charlatans. A \"new\" Crass track (a remix of 1982's \"Major General Despair\" with new lyrics), \"The Unelected President\", is available."]}, {"page": "The Only Way Is Up", "response": ["The Yazz version was produced by Jonathan More and Matt Black (better known as dance duo Coldcut, who had worked with Yazz on their hit single \"Doctorin' the House\"). \"The Only Way Is Up\" was Yazz's first solo single, credited to her under the name Yazz and the Plastic Population. Released as a single in July 1988, the song became an instant smash hit, spending five weeks at number one in the United Kingdom, and ultimately becoming the second biggest selling single of the year. In the United States it reached number two on the Billboard dance chart, although only making number 96 on the Billboard Hot 100."]}, {"page": "List of British Jewish entertainers", "response": ["*Matt Black, of Coldcut D.J."]}, {"page": "Korg PS-3300", "response": ["* Matt Black of Coldcut"]}, {"page": "Journeys by DJ", "response": [": 15. Matt Black & The Coldcut Crew - \"The Music Maker\""]}, {"page": "People Hold On", "response": ["\"People Hold On\" is a 1989 song recorded by British band Coldcut and singer Lisa Stansfield, released as the first single from the band's debut album, What's That Noise? (1989). It was written by Matt Black, Jonathan More and Stansfield, and produced by Coldcut."]}, {"page": "What's That Noise?", "response": ["* Matt Black – synthesizer, drum machine, keyboard, engineering, turntable, sampler"]}, {"page": "My Telephone", "response": ["\"My Telephone\" is a song recorded by British band Coldcut featuring Lisa Stansfield, released as a single from Coldcut's debut album, What's That Noise? (1989). It was written by Matt Black, Jonathan More, Stansfield, Ian Devaney, Andy Morris and Tim Parry, and produced by Coldcut."]}, {"page": "Copyright Criminals", "response": ["*Matt Black"]}, {"page": "Toyen (band)", "response": ["The US tour included a concert at legendary CBGB. Czech label Bonton-Sony music subsequently signed an agreement with the band. Their next album, Last free swans!, was done under collaboration with producer Colin Stuart, with lyrics by London's Matt Black. This album featured a stronger, more psychedelic and groovy style. The album cover led to the band's first Czech Grammy nomination."]}, {"page": "DJ Food", "response": ["DJ Food started as a Coldcut side project from Jonathan More and Matt Black. Along the way they met Patrick Carpenter, who was listed on the liner notes, but only his initials. A loose collaborative team began to form including Paul Brook, Paul Rabiger, Kevin Foakes a.k.a. Strictly Kev and Issac Elliston."]}, {"page": "Matt Black", "response": ["Matt Black may refer to:", "* Matt Black (DJ) (born 1961), British DJ and one half of music duo Coldcut", "* Matt Black (Canadian football) (born 1985), Canadian football defensive back", "* Matt Black (photographer) (born 1970), American documentary photographer"]}]}}