{"wiki_id": "http://www.wikidata.org/entity/Q6788391", "itemLabel": "Matt Brittin", "itemDescription": "British rower and businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Brittin", "wikipedia_page": {"main": "Matthew John Brittin (born 1 September 1968) is a British businessman, President of EMEA Business & Operations for Google. Since 2007, he is lead spokesperson for Google on its announcements in Europe about digital skills, as well as on issues such as controversial content and corporation tax.", "link_mentions": [{"page": "Robinson College, Cambridge", "response": ["*Matt Brittin, Vice-president at Google"]}, {"page": "Google", "response": ["Google Vice-President Matt Brittin testified to the Public Accounts Committee of the UK House of Commons that his UK sales team made no sales and hence owed no sales taxes to the UK. In January 2016, Google reached a settlement with the UK to pay £130m in back taxes plus higher taxes in future. In 2017, Google channeled $22.7 billion from the Netherlands to Bermuda to reduce its tax bill."]}, {"page": "Don't be evil", "response": ["On 16 May 2013, Margaret Hodge MP, the chair of the United Kingdom Public Accounts Committee, accused Google of being \"calculated and unethical\" over its use of highly contrived and artificial distinctions to avoid paying billions of pounds in corporation tax owed by its UK operations. The company was accused by the committee, which represents the interests of all UK taxpayers, of being \"evil\" for not paying its \"fair amount of tax\". She told Matt Brittin, head of Google UK, \"I think that you do evil\". In 2015, the UK Government introduced a new law intended to penalise Google and other large multinational corporations' artificial tax avoidance."]}, {"page": "Hampton School", "response": ["* Matt Brittin (1979–86), CEO of Google UK"]}, {"page": "Brittin", "response": ["*Matt Brittin (born 1968), British businessman"]}, {"page": "List of former employees of McKinsey & Company", "response": ["*Matt Brittin – Head of EMEA at Google"]}]}}