{"wiki_id": "http://www.wikidata.org/entity/Q6788836", "itemLabel": "Matt Irving", "itemDescription": "Scottish rock musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Irving", "wikipedia_page": {"main": "Matt Irving (born Glasgow, Scotland; 16 March 1950 – 3 April 2015) was a Scottish musician.\nIrving was the bass guitar player for Manfred Mann's Earth Band between 1981 and 1986. He featured on the albums Somewhere in Afrika and Budapest Live. Since leaving the band he has guested (on keyboards) with The Lords of the New Church, Squeeze, Chris Rea, Paul Young and ex Pink Floyd mainman Roger Waters. He also wrote the song \"Some Conversation\"' on the Wishbone Ash album Strange Affair. He shared lead vocals with John Waite in \"Time On My Hands\", an early song by The Babys.He was also an integral part of the Tex-Mex band Los Pacaminos on vocals, keyboards and accordion.Irving died in 2015 due to prostate cancer.", "link_mentions": [{"page": "Squeeze (band)", "response": ["Adding a new second keyboard player in the person of Matt Irving, the band issued the live album A Round and a Bout on I.R.S. Records in March 1990. Jools Holland left Squeeze again in early 1990, and was not immediately replaced. In his stead, the band used session musicians such as Irving (who was no longer an official band member), Steve Nieve, and Bruce Hornsby for the 1991 release Play, which came out on the Reprise label. This release again spawned no UK hits, although in the US the singles \"Satisfied\" and \"Crying in My Sleep\" received significant airplay on modern rock stations, and in Canada \"Satisfied\" was a top 50 hit. However, Reprise dropped the band after this album. Following this, drummer Gilson Lavis was let go in 1992, and replaced by Nieve's Attractions bandmate Pete Thomas. Paul Carrack also returned to the band in 1993, although by this point Squeeze was not so much a band as it was a trade name for Difford and Tilbrook plus sidemen."]}, {"page": "The Lords of the New Church", "response": ["Having signed with Copeland's I.R.S. Records, Copeland also took on managerial duties, the Lords of the New Church released their selfproduced eponymous debut album in July 1982. Musically, the album is a mix of punk, glam, garage rock and goth, described by New Noise Magazine as a \"seedy concoction of spidery guitars, sleazy bass lines, jungle drums and gothic keyboards.\" For the subsequent tour, the band enhanced their live sound with keyboardist Matt Irving, who had also played on the album. The Lords of the New Church was well-received and peaked at #3 on the UK Indie Chart. The single \"Open Your Eyes\" reached #7 on the UK Indie Chart, #34 on the Canadian charts and #27 on the US Rock chart. Two other singles, \"New Church\" and \"Russian Roulette\", reached #34 and #12 on the UK Indie Chart, respectively.", "* Matt Irving – keyboards (1982–1984)"]}, {"page": "Paul Young", "response": ["* Matt Irving on keyboards, accordion and vocals", "Other media released by the band include an EP and a live album. In 2015, member Matt Irving died. The band, however, continues to tour and record.\"Sparks for Wickham Festival\" ; retrieved 20 January 2012."]}, {"page": "Frank (Squeeze album)", "response": ["*Matt Irving – accordion on 3, 9"]}, {"page": "Manfred Mann's Earth Band", "response": ["1980's Chance, featuring several guest vocalists alongside Thompson, Mann and Waller, showed a move towards a more electronic approach and produced several cuts that were hits in the UK and/or saw significant airplay in both the US and UK, with the songs \"Lies (All Through the 80's)\" sung by Thompson, \"Stranded\" and \"For You\" (another Springsteen song sung by Thompson). Trevor Rabin, a fellow South African and London session musician, and lead guitarist of the 1980s version of Yes, guested on the album, as did original Earth Band guitarist Mick Rogers. Bassist Pat King left the group in 1982 to be replaced by bassist/guitarist Matt Irving.", "*Matt Irving – bass (1982–1983; died 2015)", " bar:MatIrv   text:Matt Irving"]}, {"page": "Radio K.A.O.S.", "response": ["* Matt Irving – Hammond organ on \"Powers That Be\""]}, {"page": "Flickering Flame: The Solo Years Volume 1", "response": ["*Matt Irving – keyboards"]}, {"page": "Play (Squeeze album)", "response": ["*Matt Irving – keyboards"]}]}}