{"wiki_id": "http://www.wikidata.org/entity/Q678371", "itemLabel": "Sue Ryder", "itemDescription": "British philanthtopist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sue_Ryder", "wikipedia_page": {"main": "Margaret Susan Cheshire, Baroness Ryder of Warsaw, Lady Cheshire,  (née Ryder; 3 July 1924 – 2 November 2000), best known as Sue Ryder, was a British volunteer with Special Operations Executive in the Second World War, who afterwards led many charitable organisations, notably the charity named in her honour.", "link_mentions": [{"page": "Suffolk", "response": ["Other significant persons from Suffolk include the suffragette Dame Millicent Garrett Fawcett; the captain of HMS Beagle, Robert FitzRoy; Witch-finder General Matthew Hopkins; educationist Hugh Catchpole; and Britain's first female physician and mayor, Elizabeth Garrett Anderson. Charity leader Sue Ryder settled in Suffolk and based her charity in Cavendish. Between 1932 and 1939, writer George Orwell lived at his parents' home in the coastal town of Southwold, where a mural of the author now dominates the entrance to Southwold Pier. He is said to have chosen his pen name from Suffolk's River Orwell."]}, {"page": "Special Operations Executive", "response": ["SOE assisted the Polish government in exile with training facilities and logistical support for its 605 special forces operatives known as the Cichociemni, or \"The Dark and Silent\". Members of the unit, which was based in Audley End House, Essex, were rigorously trained before being parachuted into occupied Poland. Because of the distance involved in air travel to Poland, customised aircraft with extra fuel capacity were used in Polish operations such as Operation Wildhorn III. Sue Ryder chose the title Baroness Ryder of Warsaw in honour of these operations."]}, {"page": "Cavendish, Suffolk", "response": ["The village has a United Reformed Church, where Catholic services are also held, and three pubs - the Five Bells, the George, and the Bull. Leonard Lord Cheshire and his wife Sue Ryder are buried in Cavendish Cemetery and there is a memorial to them within St Mary's Church. The museum at Cavendish is now closed but history of the Sue Ryder Foundation and life at the Cavendish home may be obtained from the Sue Ryder legacy and history team. As Cavendish was begun as a home for concentration camp survivors the charity holds some records of the people who were rescued by Sue Ryder.http://www.sueryder.org"]}, {"page": "Leonard Cheshire", "response": ["*The Ryder-Cheshire Foundation,Charity Commission for England and Wales: Charity Number 285746 set up by Leonard Cheshire and his wife Sue Ryder at the time of their marriage in 1959. It now mainly operates in two fields: the rehabilitation of disabled people, through ENRYCH\"Registered Charity No. 1088623.\" ENRYCH. and the prevention and treatment of tuberculosis, through Target Tuberculosis.\"Registered Charity No. 1098752.\" Target Tuberculosis. Retrieved: 3 April 2010.", "On 5 April 1959, in Bombay's Roman Catholic Cathedral, he married Sue Ryder, also a Roman Catholic convert and humanitarian. He and Baroness Ryder were one of the few couples who both held titles in their own right. They had two children, Jeromy and Elizabeth Cheshire, and lived in Cavendish, Suffolk.", "thumb|Memorial to Leonard Cheshire and Sue Ryder in St Mary's Church, Cavendish", "*Sue Ryder of Cavendish – Richard D. North"]}, {"page": "Order of the Smile", "response": ["* Sue Ryder"]}, {"page": "Richard Ryder, Baron Ryder of Wensum", "response": ["He is a nephew of the late Sue Ryder, the Baroness Ryder of Warsaw."]}, {"page": "First Aid Nursing Yeomanry", "response": ["* Sue Ryder"]}, {"page": "Benenden", "response": ["A well known private school, Benenden School is located to the north of the main village. The school's alumnae include Princess Anne, Lettice Curtis, Sue Ryder and Rachel Weisz."]}, {"page": "Benenden School", "response": ["*Sue Ryder, founder of the Sue Ryder Foundation"]}, {"page": "Territorial designation", "response": ["Occasionally, a place outside the United Kingdom can be named. For instance, the life peerage conferred on Howard Florey was created (in 1965) as Baron Florey, of Adelaide in the Commonwealth of Australia and of Marston in the County of Oxford, or the life peerage conferred on Sue Ryder was created (in 1979) as Baroness Ryder of Warsaw, of Warsaw in Poland and of Cavendish in the County of Suffolk."]}, {"page": "Rugby High School for Girls", "response": ["The school introduced a house system during the academic year 2000–2001. The current houses are named after Onjali Raúf, founder of Making Herstory and an author, Dame Kelly Holmes, an athlete, Mary Seacole, a British-Jamaican Nurse and Evelyn Glennie, a deaf percussionist – the initials of which stand for RHSG (Rugby High School for Girls). These names were changed in September 2021 with the previous house names coming from Sue Ryder, Barbara Hepworth, Helen Sharman and Evelyn Glennie.  Initially there were omly three houses with the initials RHS after the shortened for of Rugby High School but from September 2013 a fourth house was introduced named after Evelyn Glennie, an inspirational woman who was voted for by students.  The initial of 'G' stands for the 'Girls' in 'Rugby High School for Girls'. The houses are assigned to whole form groups, and they can gain house points by taking part in various school events, such as the annual Sports Day, interform sports, or Pink Day (in support of Cancer Research UK). Each form is given the initial of their house, to come before the initial of their form tutor, e.g. 8R, is a Year 8 form, in Raúf House. The system is not very different from the interform system previously in place, with students in the same form all being placed within the same house. However, the house system has created a link between different year groups and has encouraged wider participation in school events other than the interform."]}, {"page": "Sue Ryder (charity)", "response": ["Sue Ryder is a British palliative, neurological and bereavement support charity based in the United Kingdom. Formed as The Sue Ryder Foundation in 1953 by World War II Special Operations Executive volunteer Sue Ryder, the organisation provides care and support for people living with terminal illnesses and neurological conditions, as well as individuals who are coping with a bereavement. The charity was renamed Sue Ryder Care in 1996, before adopting its current name in 2011.", "Sue Ryder supports people living with life-limiting and long-term conditions including brain injury, cancer, dementia, strokes, multiple sclerosis, Huntington's disease, Parkinson's disease and motor neuron disease. It operates specialist palliative care centres, care centres for people with complex conditions, homecare services and a growing number of community-based services. The charity also offers support to people who have suffered a bereavement, through face-to-face services in its centres and also as an online service, as part of a bespoke Online Bereavement Community and Online Bereavement Counselling Service. Sue Ryder hospices and neurological care centres are currently operated in the following areas:", "*Lancashire: Sue Ryder Neurological Care Centre, Lancashire (neurological care centre)", "thumb|right|Sue Ryder has over 400 charity shops in the UK, which provide significant income annually.", "Sue Ryder's income was £53.9 million during the year ending 31 March 2020, which included £29.7 million from NHS and local authority funding, and £22 million from fundraising campaigns and retail sales (both online and in the charity's 400 shops). The income was used for providing 2.2 million hours of care to people in the UK. In addition to full-time staff, the charity currently has more than 10,000 volunteers supporting its work across the UK. Volunteering roles cover many areas of the charity's work, including administration, catering, transport, gardening, fundraising, finance, retail, photography, events coordination, cleaning, research, befriending and bereavement support.", "Sue Ryder launched its Prisoner Volunteer Programme in 2006. It works with around 40 prisons nationwide offering work experience in 100 locations, including offices, shops and warehouses. The programme has won a number of awards, including the Education and Training award at Civil Society's Charity Awards in 2013. In 2014, the charity opened a shop in Slough which offered staff roles to homeless people in partnership with the organisation Slough Homeless Our Concern.", "In February 2013, Sue Ryder was criticised alongside other charitable organisations for taking part in the UK Government's workfare scheme, in which people living on benefits were instructed to attend unpaid work at various companies and charities, at the risk of otherwise losing their benefits. After enlisting \"around 1,000\" volunteers as part of the scheme, Sue Ryder later promised a \"phased withdrawal\" due to online protests. The charity later released a statement explaining that they had chosen to withdraw in order to \"protect staff from an online campaign of harassment\".", "*Sue Ryder, registered charity no. 1052076 at the Charity Commission for England and Wales", "*Sue Ryder, registered charity no. SC039578 at the Office of the Scottish Charity Regulator"]}, {"page": "Cherry Hinton", "response": ["In the High Street there are a number of shops including a Tesco Express supermarket, a newsagent, Children's society charity shop,Children's society : Cherry Hinton  a Sue Ryder charity shop, a hairdresser, a barber, a bakery, two pharmacies, a cycle shop, a craft shop, two turf accountants and a post office. There is also a Tesco superstore towards Fulbourn. Meals are available at the Sitar Indian restaurant, the Golden Pizza Chinese/Pizza Takeaway and the Cherry House Chinese Takeaway & Chip Shop, as well as from the bakery which provides a variety of filled rolls and hot snack products during the day."]}, {"page": "Sir John Lawes School", "response": ["The school is split into seven houses, Austen (Red), Britten (Yellow), Hepworth, (Green), King (Silver), Lawes (Orange), Newton (Blue) and Ryder (Purple), named for Jane Austen, Benjamin Britten, Barbara Hepworth, Martin Luther King Jr., John Bennet Lawes, Isaac Newton and Sue Ryder respectively."]}, {"page": "List of people from Leeds", "response": ["* Sue Ryder CMG, OBE - British peeress who worked with Special Operations Executive in the Second World War and afterwards led many charitable organizations, notably the Sue Ryder charity"]}, {"page": "Baroness Ryder of Warsaw", "response": ["#REDIRECT Sue Ryder"]}, {"page": "Philip Morant School and College", "response": ["| Sue Ryder"]}, {"page": "Poles in the United Kingdom", "response": ["In the 1951 UK Census, some 162,339 residents had listed Poland as their birthplace, up from 44,642 in 1931. Polish arrivals to the UK included survivors of German concentration and POW camps and war wounded needing additional help adapting to civilian life. This help was provided by a range of charitable endeavours, some coordinated by Sue Ryder (1924–2000), a British humanitarian who, as Baroness Ryder of Warsaw, was later raised to the House of Lords and spoke there in the cause of Poland."]}, {"page": "Arnold Hill Academy", "response": ["* Ryder-Cheshire (Leonard Cheshire and Sue Ryder)"]}, {"page": "Irish Council for Social Housing", "response": ["Among the organisation's members are: Society of Saint Vincent de Paul, Irish Wheelchair Association and Sue Ryder Foundation."]}, {"page": "Fort Pitt Grammar School", "response": ["*Ryder (house colour blue; named after Sue Ryder, a British volunteer and charitable entrepreneur)"]}, {"page": "Index of World War II articles (S)", "response": ["# Sue Ryder"]}, {"page": "Susan Ryder", "response": ["#REDIRECT Sue Ryder"]}, {"page": "Leonard Cheshire Disability", "response": ["The Ryder-Cheshire Mission was set up by Leonard Cheshire and his wife Sue Ryder at the time of their marriage in 1959, and later became the Ryder-Cheshire Foundation which operated until 2010. Other related former charities include Target Tuberculosis, operating in India and certain countries of Africa (2003–2016).", "Sue Ryder Care, a charity founded in 1953 by Sue Ryder, before she met Leonard Cheshire, was one of the 50 largest charities in the UK in 2008.Ranked by expenditure. Source: Charities Direct: Top 500 Charities - Expenditure "]}, {"page": "Boris Dragojević", "response": ["Something in between – Sue Ryder Gallery, Herceg Novi 1997."]}, {"page": "Sue Ryder, Baroness Ryder of Warsaw", "response": ["#REDIRECT Sue Ryder"]}, {"page": "Lady Ryder of Warsaw Memorial Trust", "response": ["#REDIRECT Sue Ryder"]}, {"page": "Thrill Collins", "response": ["Thrill Collins do not take any profit from the proceeds of CD/MP3 sales. They have undertaken charity work throughout their career for numerous national organisations such as Oxfam, Cancer Research UK, Sue Ryder, Macmillan, Teenage Cancer Trust, Alzheimer's Society, Winston's Wish and the London 2012 Olympics."]}, {"page": "List of museums in Suffolk", "response": ["* Sue Ryder Foundation Museum, Cavendish, life and works of philanthropist Sue Ryder"]}, {"page": "Great Britain commemorative stamps 2010–2019", "response": ["|3 stamps – 1st Class: Nicholas Winton, Sue Ryder and John Boyd Orr, 3 stamps £1.33: Eglantyne Jebb, Joseph Rowntree, Josephine Butler."]}, {"page": "Margaret Susan Ryder, Baroness Ryder of Warsaw", "response": ["#REDIRECT Sue Ryder"]}]}}