{"wiki_id": "http://www.wikidata.org/entity/Q6788868", "itemLabel": "Matt Jones", "itemDescription": "British television writer and television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Jones_(writer)", "wikipedia_page": {"main": "Matthew David Jones (born 5 August 1968) is a British television screenwriter and television producer, who has worked on a variety of popular drama programmes for several television networks in the UK.", "link_mentions": [{"page": "1997 in literature", "response": ["*Matt Jones – Beyond the Sun"]}, {"page": "1996 in literature", "response": ["*Matt Jones – Bad Therapy"]}, {"page": "Doctor Who Magazine", "response": ["A single-page 'opinion' column has often been part of the magazine's mix – past columns have included \"Fluid Links\" by Matt Jones, \"The Life and Times of Jackie Jenkins\" by 'Jackie Jenkins', \"It's the End... But\" by 'The Watcher', \"You Are Not Alone\" by Jonathan Morris (as 'Neil Harris') and \"Relative Dimensions\" by author (and former \"Time Team\" member) Jacqueline Rayner. The format has changed over the years, but the news, letters, reviews, and comic strip have all been present consistently since the early 1980s."]}, {"page": "Virgin New Adventures", "response": ["As well as introducing new characters, the range also provided a showcase for new writing talent. Notable was Paul Cornell who wrote five of the novels, including the single most popular one (according to a Doctor Who Magazine poll), Human Nature. Cornell went on to write for the 2005 revival of the television series: \"Father's Day\" and \"Human Nature\"/\"The Family of Blood\", the latter a two-part adaptation of the 38th New Adventure. Others who later worked on the revived television series include Mark Gatiss, Gareth Roberts, Matt Jones, Simon Winstone and Gary Russell. Even Russell T Davies contributed to the range with his novel Damaged Goods. Gatiss and Roberts both did their first ever professional fiction writing for the line, as did others who later found success elsewhere, including Daniel Blythe, Justin Richards, Andy Lane and Lance Parkin."]}, {"page": "Doctor Who spin-offs", "response": ["The New Adventures were joined in 1994 by a companion series (the Missing Adventures) telling \"untold\" stories with earlier Doctors, set between episodes of the television series. At its height, new novels in both lines were being published monthly. Many authors of these books went on to write for the revival of Doctor Who in 2005: Russell T Davies, Paul Cornell, Gareth Roberts, Matt Jones, and Mark Gatiss. Indeed, if one counts Steven Moffat's contribution to the second Decalog collection, then about 75% of episodes of the new series were written by people who contributed to the Virgin line. (The same cannot be said of the BBC Books line. In fact, no writer who made their Doctor Who debut on the BBC Books line has written for the new series. The only writers to have contributed to the BBC line and the new series are those who also wrote for the Virgin line - Gatiss, who wrote two BBC books, and Cornell, who wrote one. Several writers from the BBC line have written tie-in novels for the new series, however, including editors Justin Richards and Stephen Cole.)"]}, {"page": "Bernice Summerfield", "response": ["*Beyond the Sun by Matt Jones"]}, {"page": "Ian Chesterton", "response": ["*\"The Nine-Day Queen\" by Matt Jones (Decalog 2: Lost Property)"]}, {"page": "Matthew Jones", "response": ["Matthew or Matt Jones may refer to:", "*Matt Jones, past member of the band Ultrasound", "*Matt Jones (footballer, born 1970), English footballer formerly of Southend United", "*Matt Jones (footballer, born 1980), Welsh international football player", "*Matt Jones (footballer, born 1986),  English football goalkeeper for Belenenses", "*Matt Jones (basketball) (born 1994), American basketball player", "*Matt Jones (Australian footballer) (born 1987), Australian rules footballer", "*Matt Jones (golfer) (born 1980), Australian professional golfer", "*Matt Jones (ice hockey) (born 1983), American ice hockey defenseman", "*Matt Jones (mixed martial artist) (born 1982), American mixed martial artist", "*Matt Jones (rugby union) (born 1984), Welsh international rugby union player", "*Matt Jones (wide receiver) (born 1983), American football wide receiver", "*Matt Jones (running back) (born 1993), American football running back", "*Matt Jones (interaction designer) (born 1968), active researcher and organizer of scientific conferences", "*Matt Jones (writer) (born 1968), British television writer and television producer", "*Matt Jones (radio host) (born 1978), host and founder of Kentucky Sports Radio", "*Matt Jones (actor) (born 1981), American actor and comedian", "*Matt Jones (American politician), American politician from Colorado", "*Matt Jones (Canadian politician), member of the Alberta Legislature"]}, {"page": "Torchwood", "response": [" The other episodes were written by James Moran, Matt Jones, J. C. Wilsher, Joseph Lidster, P.J. Hammond and Phil Ford. Russell T Davies was initially announced as writing two episodes, but due to commitments to Doctor Who, he no longer anticipated writing any Torchwood episodes. For series three, Davies returned and wrote the first and last episodes, co-wrote episode three with James Moran and plotted the overall story arc himself. John Fay wrote episodes two and four."]}, {"page": "Doctor Who fandom", "response": ["Many professional Doctor Who writers, for both the current TV series and the books, began their careers writing for fanzines, including Paul Cornell, Rob Shearman, Matt Jones, Marc Platt, Gareth Roberts, Clayton Hickman, David Howe and Stephen James Walker."]}, {"page": "Matthew Graham", "response": ["*6 episodes (co-written with Matt Jones, 2003)"]}, {"page": "Beyond the Sun (novel)", "response": ["Beyond the Sun is a novel by Matt Jones featuring the fictional archaeologist Bernice Summerfield, his second for the Virgin New Adventures. The New Adventures were a spin-off from the long-running British science fiction television series Doctor Who. The book is, in part, a coming-of-age story for the character of Emile as he comes to terms with his sexuality. Emile would later re-appear in subsequent New Adventures.", "Category:Novels by Matt Jones"]}, {"page": "The Impossible Planet", "response": ["Writer Matt Jones also wrote, as Matthew Jones, the Virgin New Adventures novel Bad Therapy, featuring the Seventh Doctor and Chris Cwej. He was script editor on Russell T Davies' Channel 4 series Queer as Folk."]}, {"page": "Bad Therapy", "response": ["Category:Novels by Matt Jones"]}, {"page": "The Dead Men Diaries", "response": ["| Step Back in Time || Matt Jones"]}, {"page": "List of Doctor Who novelists", "response": ["* Matt Jones"]}, {"page": "Matt (name)", "response": ["*Matt Jones (basketball) (born 1994), American basketball player", "*Matt Jones (Australian footballer) (born 1987), Australian rules footballer", "*Matt Jones (footballer, born 1980), Welsh international football player", "*Matt Jones (footballer, born 1986),  English football goalkeeper for Belenenses", "*Matt Jones (golfer) (born 1980), Australian professional golfer", "*Matt Jones (ice hockey) (born 1983), American ice hockey defenseman", "*Matt Jones (mixed martial artist) (born 1982), American mixed martial artist", "*Matt Jones (rugby union) (born 1984), Welsh international rugby union player", "*Matt Jones (running back) (born 1993), American football running back", "*Matt Jones (wide receiver) (born 1983), American football wide receiver", "* Matt Jones (American politician), American politician", "* Matt Jones (writer) (born 1968), British television writer and television producer", "* Matt Jones (interaction designer) (born 1968), active researcher and organizer of scientific conferences"]}, {"page": "Doctor Who (series 2)", "response": ["New writers for the show included Toby Whithouse, creator of the Channel 4 drama No Angels, Tom MacRae, creator of Sky One's Mile High, Matt Jones, also a prolific script editor and producer, and Matthew Graham, co-creator of the BBC science fiction series Life on Mars. Previous writers Mark Gatiss, Steven Moffat and Russell T Davies all contributed to the series, with Davies continuing to act as head writer and executive producer. Stephen Fry was due to write episode 11 but was forced to withdraw as he could not complete the script in time so Russell T. Davies hired Matthew Graham to write Fear Her. Phil Collinson produced all episodes, with Julie Gardner as executive producer. The series was directed by James Hawes, Euros Lyn, James Strong, Dan Zeff and Graeme Harper, who had directed episodes of the programme's original run. The series is primarily set on Earth (though not as much as the first series was) due to the cost involved in creating another planet, according to Davies. Only two stories are set on another planet.", "| rowspan=\"2\" | Matt Jones", "| James Strong and Matt Jones for \"The Impossible Planet\" / \"The Satan Pit\""]}]}}