{"wiki_id": "http://www.wikidata.org/entity/Q6781696", "itemLabel": "Marysia Kay", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Marysia_Kay", "wikipedia_page": {"main": "Marysia Kay (born 14 December 1975 in Kilmarnock, Scotland) is a retired Scottish actress, singer, and fight performer. She is best known for her role in Forest of the Damned.", "link_mentions": [{"page": "The Colour Out of Space", "response": ["The 2008 film Colour from the Dark, directed by Ivan Zuccon, is an adaptation set in Italy. The film stars Michael Segal, Debbie Rochon, Marysia Kay, Gerry Shanahan, and Eleanor James.  Bloody Disgusting praised the film, stating Zuccon \"managed to do the famous writer's twisted tale of unseen terror a really fair share of justice by capturing the bleak, grotesque and utterly frightening atmosphere of the source material very, very well\". The 2010 film Die Farbe (The Color), directed by Huan Vu, is an adaptation set in Germany. It is shot mainly in black and white, the exception being the \"Colour\" itself. S. T. Joshi described it as \"the best Lovecraft film adaptation ever made\". The 2018 film Annihilation—itself based on the 2014 novel of the same name by Jeff VanderMeer—contains numerous plot similarities with Lovecraft's story, most prominently a colorful alien entity that crash lands on earth and begins mutating nearby plant and animal life. "]}, {"page": "The Job", "response": ["* The Job, a 2005 short film featuring Marysia Kay"]}, {"page": "Rhodri Marsden", "response": ["In 2007 he worked on a DIY music project called \"The Schema\" – an attempt to get a single written, recorded, released and promoted on the internet in the space of a month. The accompanying video, directed by Alex de Campi and featuring Marysia Kay, became a hit on YouTube, but the single sold poorly."]}, {"page": "Marr College", "response": ["*Marysia Kay, actress"]}, {"page": "Forest of the Damned", "response": ["* Marysia Kay as Angel 1", "Forest of the Damned 2, directed by Ernest Riera, was released in 2008. Eleanor James and Marysia Kay reprise their roles as bloodthirsty fallen angels."]}, {"page": "List of Scottish actors", "response": ["*Marysia Kay (born 1975)"]}, {"page": "Marysia K", "response": ["#REDIRECT Marysia Kay"]}, {"page": "Marysia Kolodziej", "response": ["#REDIRECT Marysia Kay"]}, {"page": "List of British films of 2011", "response": ["|| Director: Don Fearney   Cast: Brian Murphy, Damien Thomas, Edward de Souza, Marysia Kay, Frank Scantori, Mark Sloan, Aubrey Wakeling, Celia Carron, Heather Darcy"]}, {"page": "Slice and Dice: The Slasher Film Forever", "response": ["A celebration of slasher cinema - from Psycho to the present day, with a focus on highlighting many of the genre's forgotten cult classics, deconstructing how to survive a slice and dice movie and meditating upon why it is almost always a final girl and rarely a final guy. Among the films many interviewees are Corey Feldman, Mick Garris, Tobe Hooper, Tom Holland, Eduardo Sánchez, Patrick Lussier, Norman J. Warren, Felissa Rose, Scott Spiegel, Fred Olen Ray, Jeffrey Reddick, John Carl Buechler, Emily Booth, Adam Green, Marysia Kay, J.S. Cardone."]}]}}