{"wiki_id": "http://www.wikidata.org/entity/Q6780784", "itemLabel": "Mary Stott", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Stott", "wikipedia_page": {"main": "Mary Stott  (born Charlotte Mary Waddington) (18 July 1907 – 16 September 2002) was a British feminist and journalist. She was editor of The Guardian newspaper's women's page between 1957 and 1972.\nCharlotte Mary Waddington was born in Leicester, the only daughter and third child of Robert Guy Waddington and his wife, born Amalie Bates. Robert and Amalie Waddington were both journalists.  In 1937, she married Ken Stott, who was a journalist for the News Chronicle.In November 2005 she was posthumously included (one of just five women) in the Press Gazette's 40-strong 'gallery' of most influential British journalists.\n\n", "link_mentions": [{"page": "Xaviera Hollander", "response": ["In 1989 she made an extended appearance on British television discussion programme After Dark, alongside Mary Stott, Malcolm Bennett and Hans Eysenck among others."]}, {"page": "List of feminists", "response": ["|1875–1939||data-sort-value=\"Stott, Mary\"|Mary Stott||United Kingdom||1907||2002||||"]}, {"page": "People's Century", "response": ["| Women struggle to win political and economic rights in societies gamed to entrench male privilege. Even with limited suffrage, after the First World War many Western women remain destined to a life of domestic servitude or limited careers. The Second World War gives women in Britain and the United States a brief opportunity to work in traditionally male industries, but they are promptly replaced at war's end. In the 1960s, new household appliances, higher education, and the book The Feminine Mystique inspires campaigns for equal pay and employment opportunities, such as the Dagenham strike. However, women would still need to struggle against discrimination and harassment in male-dominated careers. The pill helps women gain control of their fertility. In less developed places of the world, there are other issues of concern to women, including genital mutilation, dowry killings and infanticide; while in Iran, a legacy of gender equality is rolled back after the Islamic Revolution. The Fourth World Conference on Women shows how the aspirations and achievements for women vary between rich and poor countries. The introductory scene shows the 1970 Women's Strike for Equality. Interviewees include Jacqui Ceballos and Mary Stott."]}, {"page": "Heaton Moor", "response": ["The Guardian journalist and feminist Mary Stott and her husband lived here after moving from Leicester."]}, {"page": "Fiona MacCarthy", "response": ["After graduation MacCarthy's first job was as a merchandise editor and then journalist on House & Garden magazine. MacCarthy joined The Guardian in 1963 initially as an assistant to the women's editor Mary Stott. She was then appointed the newspaper's design correspondent, working as a features writer and columnist, sometimes using a pseudonymous byline to avoid two articles appearing in the same issue. In this role she interviewed David Hockney, Betty Friedan and John Lennon among others. She left The Guardian in 1969, briefly becoming women's editor of the London Evening Standard before settling in Sheffield."]}, {"page": "Jill Tweedie", "response": ["Jill Sheila Tweedie (22 May 1936 – 12 November 1993) was a British feminist, writer and broadcaster. She was educated at the independent Croydon High School in Croydon, South London. She wrote a column in The Guardian on feminist issues (1969–1988), 'Letters from a faint-hearted feminist', and an autobiography Eating Children (1993). She succeeded Mary Stott as a principal columnist on The Guardian's women's page.", "She is commemorated in a group portrait at the National Portrait Gallery with fellow Guardian Women's Page contributors Mary Stott, Polly Toynbee, Posy Simmonds and Liz Forgan."]}, {"page": "Waddington (surname)", "response": ["* Charlotte Mary Waddington (1907–2002), British journalist wrote as Mary Stott"]}, {"page": "Charlotte Mary Waddington", "response": ["#REDIRECT Mary Stott"]}, {"page": "Women's Library", "response": ["Personal archives held at the Women's Library include those of Lesley Abdela, Adelaide Anderson, Elizabeth Garrett Anderson, Louisa Garrett Anderson, Margery Corbett Ashby, Lydia Becker, Helen Bentwich, Rosa May Billinghurst, Chili Bouchier, Elsie Bowerman, Josephine Butler, Barbara Cartland, Jill Craigie, Emily Wilding Davison, Charlotte Despard, Emily Faithfull, Millicent Garrett Fawcett, Vida Goldstein, Teresa Billington-Greig, Elspeth Howe, Mary Lowndes (see also Artists' Suffrage League Papers), Constance Lytton, Harriet Martineau, Edith How-Martyn, Angela Mason, Hannah More, Helena Normanton, Eleanor Rathbone, Claire Rayner, Sheila Rowbotham, Maude Royden, Myra Sadd Brown, Nancy Seear, Baroness Seear, Elaine Showalter, William Thomas Stead, Mary Stott, Louisa Twining and Henry Wilson."]}, {"page": "After Dark (TV programme)", "response": ["On 28 October 1989, during a discussion on differences between men and women with among others Mary Stott and Hans Eysenck, one guest, Malcolm Bennett, \"successfully propositioned the Happy Hooker author Xaviera Hollander, and the pair walked off the live set to continue their discourse privately.\"Vincent Raison, Obituary of Malcolm Bennett, The Guardian 8 April 2015, accessed 15 October 2015"]}, {"page": "Great Lives", "response": ["|Mary Stott, campaigning journalist"]}, {"page": "Liz Forgan", "response": ["* Jill Tweedie for details of the National Portrait Gallery Group portrait of Forgan, Tweedie, Polly Toynbee and Mary Stott (editors of Guardian's Women's Page) and Posy Simmonds."]}, {"page": "Natalie d'Arbeloff", "response": ["When living in Paraguay (1958-1962) d'Arbeloff was the winner of a government competition to design and execute a mural for a new modern building, the Hotel Guarani. Her abstract mural was inaugurated in 1962. She was joint recipient of The Guardian's 2007 inaugural Mary Stott competition prize which included editing the newspaper's women's pages for one week in June 2008."]}, {"page": "Judith Cook", "response": ["Through the columns of The Guardians women's page, edited by Mary Stott, she founded the anti-nuclear organisation Voice of Women after the Cuban Missile Crisis of 1962, at a time when the world seemed on the verge of nuclear war."]}, {"page": "The Guardian", "response": ["* Mary Stott"]}, {"page": "National Women's Register", "response": ["NWR was founded in 1960.Cook et al. (1994) p.129 Mary Stott was editor of The Guardian Women’s Page and Betty Jerman wrote an article entitled \"Squeezed in like sardines in Suburbia\", saying that Suburbia was “an incredibly dull place to live and I blame the women.  Their work kept them alert.  Home and child-minding can have a blunting effect on a woman’s mind, but only she can sharpen it.\"Betty Jerman, Article, The Guardian, 19 February 1960  "]}, {"page": "Stott (disambiguation)", "response": ["*Mary Stott (1907–2002), British feminist and journalist"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Mary Stott||The Act of Creation by Arthur Koestler||Watercolours for painting||  more"]}, {"page": "List of People's Century interviewees", "response": ["*Mary Stott: Leicester voter (1929), then journalist (1950) (Half the People)"]}, {"page": "Alison Adburgham", "response": ["After the Second World War, Adburgham began contributing to Punch and later through The Guardian women's editor Mary Stott. She began to cover fashion collections at a time when newspaper fashion journalism was in its infancy in the UK, becoming an expert in the fashion industry of post-war Europe and in fashion history."]}, {"page": "Deaths in September 2002", "response": ["*Mary Stott, 95, British journalist and feminist."]}, {"page": "Alice Franklin", "response": ["Alice never married, and according to Mary Stott was known in the organization for her masculine dress and appearance and for making cheeky comments to married women about the nuisance posed by their husbands. Some biographers have said that Alice was a lesbian and was, for the era, relatively open about her orientation and dislike of men, although the evidence for this claim has been criticized."]}, {"page": "Women's page", "response": ["*Mary Stott"]}]}}