{"wiki_id": "http://www.wikidata.org/entity/Q6788759", "itemLabel": "Matt Harding", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Harding_(musician)", "wikipedia_page": {"main": "Matt Harding (born 1975) is a British musician, whose music has been described as \"scuzzy electronic folk\" with \"lo-fi beats\". Hailing from Northampton but based in London, Harding has released three albums on Moshi Moshi Records.", "link_mentions": [{"page": "Matt Harding", "response": ["Matthew Harding (born September 27, 1976) is an American traveler, video game designer, and Internet celebrity who is known as Dancing Matt, for his viral videos that show him dancing in front of landmarks and street scenes in various international locations. Harding has since received widespread coverage of his travel exploits in major print and broadcast media outlets, and was hired by Visa to star in their Travel Happy campaign in 2008.Travel the world with the currency of the world , 20 November 2008. Press release by Visa. \"Visa's new travel-focused commercial recreates the dance made famous by internet celebrity Matt Harding in his self-made quirky video travel diaries.\""]}, {"page": "Moshi Moshi Records", "response": ["*Matt Harding"]}, {"page": "List of Monkey Dust characters", "response": ["Designed by Paul Donnellon the character draws inspiration from the characters of Tex Avery, such as Bugs Bunny. Noodles is a laboratory rabbit who can survive all manner of horrific medical experiments because he is only a toon. The sketch begins with Matt Harding's haunting \"Our Conversation\" playing in the background, as a doctor and another researcher discuss the problems related to a disease or over-exposure to a specific drug. In the final episode he turns the tables on the researchers by dropping an anvil on their heads in true cartoon fashion. Only of course for the human doctor, this is fatal and extremely bloody."]}, {"page": "Expectation", "response": ["* Expectation, a 2006 album by Matt Harding"]}, {"page": "Harding (surname)", "response": ["*Matt Harding (born 1976), computer game designer", "*Matt Harding (musician) (born 1975), British musician"]}]}}