{"wiki_id": "http://www.wikidata.org/entity/Q6793159", "itemLabel": "Maurice Greiffenhagen", "itemDescription": "British artist (1862-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Greiffenhagen", "wikipedia_page": {"main": "Maurice Greiffenhagen  (15 December 1862 – 26 December 1931) was a British painter and Royal Academician. He illustrated books and designed posters as well as painting idyllic landscapes.\n\nHe was born in London. Exhibiting at the Royal Academy of Arts from 1884, he was made an Associate Member in 1916 and a Royal Academician in 1922. From 1906 until 1926, he taught at the Glasgow School of Art. Greiffenhagen exhibited at the first exhibition of the Society of Graphic Art in 1921.\nHis friendship with H Rider Haggard led to him illustrating the author's popular adventure books, starting with an edition of She: A History of Adventure in 1889 – though Greiffenhagen apparently \"disliked doing black-and-white work\". He illustrated the serialisation of Ayesha The Return of She (1904–05) and that of The Holy Flower (1913–14) in the Windsor Magazine.\nHe also illustrated a number of Edgar Wallace's Sanders of the River books for the Windsor Magazine: The Keepers of the King's Peace (1916–17), Lieutenant Bones (1917–18) and Sandi, The Kingmaker (1921). \nGreiffenhagen's 1891 painting, An Idyll, inspired D H Lawrence's novel The White Peacock. The painting had \"a profound effect\" on the author, who wrote:\n\nAs for Greiffenhagen's 'Idyll', it moves me almost as if I were in love myself. Under its intoxication, I have flirted madly this Christmas.\nIn 1910, Greiffenhagen illustrated a book of poems by Charles F. Parsons entitled Some Thoughts at Eventide.\n\nGreiffenhagen also created distinctive commercial posters, including a colourful 1894 advertisement for Pall Mall Budget magazine which \"created a distinct sensation among the younger men\" according to one contemporary periodical. In 1924, he created \"The Gateway of the North\", one of the most popular travel posters in a series commissioned by London, Midland and Scottish Railway.\n\n", "link_mentions": {}}}