{"wiki_id": "http://www.wikidata.org/entity/Q6793529", "itemLabel": "Maurice Webb", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Webb_(architect)", "wikipedia_page": {"main": "Maurice Everett Webb (1880–1939) was an English architect of the early 20th century, who started his architectural career working for his famous architect father, Sir Aston Webb, the practice trading as Sir Aston Webb and Son for some years. He was the first chairman of the Building Centre in London.", "link_mentions": [{"page": "Pembroke College, Cambridge", "response": ["In 1926, as the Fellows had become increasingly disenchanted with Waterhouse's Hall, Maurice Webb was brought in to remove the open roof, put in a flat ceiling and add two storeys of sets above. The wall between the Hall and the Fellows' Parlour was taken down, and the latter made into a High Table dais. A new Senior Parlour was then created on the ground floor of Hitcham Building. The remodelling work was completed in 1949 when Murray Easton replaced the Gothic tracery of the windows with a simpler design in the style of the medieval Hall.", "In 1933 Maurice Webb built a new Master's Lodge in the south-east corner of the College gardens, on land acquired from Peterhouse in 1861. Following the war, further accommodation was created with the construction in 1957 of Orchard Building, so called because it stands on part of the Foundress's orchard. Finally, in a move to accommodate the majority of junior members on the College site rather than in hostels in the town, in the 1990s Eric Parry designed a new range of buildings on the site of the Master's Lodge, with a new Lodge at the west end.  \"Foundress Court\" was opened in 1997 in celebration of the college's 650th Anniversary. In 2001 the Library was extended to the east and modified internally."]}, {"page": "Bentalls", "response": ["Bentalls was established in 1867 by Frank Bentall who purchased a drapery shop in Kingston upon Thames. The principal buildings of the Kingston store were completed in 1935 to a design by architect Maurice Webb (son of Sir Aston Webb) and inspired by Wren's design for Hampton Court. The fine stonework on the façade was the work of Eric Gill. Between 1935 and 1976 it was the UK's largest department store outside central London. It became a Grade II listed building in 2011."]}, {"page": "Royal Air Force Club", "response": ["The Royal Air Force Club was founded in 1918 when the first Lord Cowdray donated funds to obtain a permanent building which would house the Club.  The buildings, still in use today, were acquired by the middle of 1919 (the Piccadilly frontage was originally the Ladies Lyceum Club, while the rear half, facing Old Park Lane, was stables). Between 1919 and 1921 extensive reconstruction took place supervised by architect Maurice Webb and largely financed by Lord Cowdray. On 2 January 1922 the Club was fully opened to Members although it was not officially opened by the Duke of York until 24 February 1922. On 12 March 1922 the Club was visited by King George V and Queen Mary. This association with the Royal Family continues to this day, Queen Elizabeth II being the Club's Patron."]}, {"page": "Presidential Palace, Nicosia", "response": ["The new building was designed by Maurice Webb of the firm of Sir Aston Webb & Sons, Westminster, London. Construction was undertaken by J V Hamilton & L F Weldon of the Public Works Department, Nicosia. The main structure was built of Yerolakkos sandstone, with harder sandstone from Limassol used for the staircases. Construction was completed in 1937, at a total cost of £70,000.  Among the Palace's most prominent features are the British coat-of-arms, and four gargoyles with human heads depicting the British general foreman in charge of construction, the head mason, the head carpenter, and an unknown labourer.Cyprus, H D Purcell, Ernest benn, 1968, ASIN: B004WLSBMWDr Rita C Severis & Dr Michael Given, Hellenic Bank (2004) Monuments and Memories Government House.  The building was originally named Government House; in 1960, it was renamed the Presidential Palace."]}, {"page": "Wesley House", "response": ["thumb|The chapelThe principal's house was completed in 1929, and the chapel, originally with paintings by Harold Speed, in 1930. The buildings were designed by Maurice Webb and the garden designed in 1925 by Sir Aston Webb in a Tudor revival style.Parks & Gardens UK site: Retrieved 1 February 2012."]}, {"page": "Maurice Webb", "response": ["Maurice Webb may refer to:", "*Maurice Webb (architect) (1880–1939), English architect", "*Maurice Webb (politician) (1904–1956), British Labour politician"]}, {"page": "Manor House, West Coker", "response": ["In 1907 Matthew Nathan, a soldier and colonial administrator, who variously served as the Governor of Sierra Leone, Gold Coast, Hong Kong, Natal and Queensland, bought the Manor House. Many politicians and other members of The Establishment visited him at the house. He lived there until his death in 1939. Sir Aston Webb or his son Maurice Webb, rebuilt the South East wing for Nathan in 1910, and the house was profiled by Christopher Hussey in an early edition of Country Life magazine following the renovation and rebuilding. In 1935 Nathan allowed the grounds to be used by local scout groups during the celebrations of the silver jubilee of George V."]}, {"page": "List of city and town halls in England", "response": ["|Grade II listed ().Architect: Maurice Webb."]}, {"page": "Camberwell Cemeteries", "response": ["The lodge, waiting room and mortuary chapels were designed by Sir Aston Webb and his son, Maurice.Lodge, Camberwell New Cemetery, British Listed Buildings Maurice Webb was the architect for the crematorium, built in 1939 to meet a growing demand for cremations. It is situated in the cemetery grounds, ten acres of which were landscaped as memorial gardens. The crematorium is also a listed buildingCremetorium, Camberwell New Cemetery, British Listed Buildings and is notable for its beautiful stained glass window.Honor Oak Park, Get Walking By 1984 over 91,000 cremations had been conducted."]}, {"page": "Kingston upon Thames Guildhall", "response": ["The current building, which was designed by Maurice Webb in the Neo-Georgian style, was built at a cost of £130,000. It was officially opened by Princess Alice, Countess of Athlone on 3 July 1935."]}, {"page": "Bentall Centre, Kingston upon Thames", "response": ["The shopping centre's atrium ceiling is higher than the nave of Westminster Abbey or the dome of St Paul's Cathedral. The original department store's 1935 façade designed by Maurice Webb was retained."]}, {"page": "The Building Centre", "response": ["The centre was founded in 1931 starting as the building materials bureau of the Architectural Association. Its first managing director was Frank Yerbury, architectural photographer and secretary of the Architectural Association School, and its first chairman was Maurice Webb. It opened its doors on 7 September 1932 at 158 New Bond Street"]}, {"page": "The Grampians, Shepherd's Bush", "response": ["The Grampians is grade II listed apartment building in Shepherds Bush Road, Shepherd's Bush, London. It was designed by Maurice Webb in the Art Deco style and built between 1935 and 1937. The designs for the block were exhibited at the Royal Academy in 1935."]}, {"page": "Princess Beatrice Hospital", "response": ["In 1930, the hospital was rebuilt by Aston Webb and Son to a design by Maurice Webb, and renamed in honour of Princess Beatrice, who laid the foundation stone. Her son, the Marquess of Carisbrooke, was President of the Hospital. The new hospital had up to 100 beds.  "]}, {"page": "List of places of worship in Elmbridge", "response": ["|A chapel for Nonconformists was built in the planned community of Whiteley Village in 1925–26 to the Classical design of Maurice Webb.  It was registered in August 1963.  The building is no longer used for worship, and the church community (now known as Whiteley Village Community Church) is now based in a room in a different building in the village."]}]}}