{"wiki_id": "http://www.wikidata.org/entity/Q6793137", "itemLabel": "Maurice George Moore", "itemDescription": "Irish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_George_Moore", "wikipedia_page": {"main": "Maurice George Moore,  (10 August 1854 – 8 September 1939) was an Irish author, soldier and politician.", "link_mentions": [{"page": "George Moore (novelist)", "response": ["Moore was born in Moore Hall in 1852. As a child, he enjoyed the novels of Walter Scott, which his father read to him.Jernigan, Jay. \"The Forgotten Serial Version of George Moore's Esther Waters\". Nineteenth-Century Fiction, Vol. 23, No. 1, June 1968. pp. 99–103. He spent a good deal of time outdoors with his brother, Maurice George Moore, and also became friendly with the young Willie and Oscar Wilde, who spent their summer holidays at nearby Moytura. Oscar was to later quip of Moore: \"He conducts his education in public\".Schwab, Arnold T. Review of \"George Moore: A Reconsideration\", by Brown, Malcolm. Nineteenth-Century Fiction, Vol. 10, No. 4, March 1956. pp. 310–314."]}, {"page": "Seanad Éireann (Irish Free State)", "response": ["*Maurice George Moore"]}, {"page": "George Henry Moore (politician)", "response": ["* An Irish Gentleman-George Henry Moore: Maurice George Moore no existing copyright"]}, {"page": "1939 in Ireland", "response": ["* 8 September – Maurice George Moore, soldier and independent member of the 1922 Seanad (born 1854)."]}, {"page": "Carra, County Mayo", "response": ["Moore Hall, the home place of George Henry Moore and his family from 1795 until 1923 is situated in this Barony. There were many prominent Moores born in Moore Hall including Maurice George Moore and George Moore (novelist).  The house, situated above the shores of Lough Carra was burnt in the troubles of 1923 by the IRA."]}, {"page": "Clann Éireann", "response": ["The party chairman was Professor William Magennis, Teachta Dála (TD) for National University of Ireland. The secretaries included Pádraic Ó Máille TD for Galway. Other prominent members of the party included Maurice George Moore, who at the time was a member of the senate, and Christopher Byrne, who was a sitting TD for Wicklow who was one of those who had resigned from Cumann na nGaedheal over the Boundary issue."]}]}}