{"wiki_id": "http://www.wikidata.org/entity/Q6795316", "itemLabel": "Max Townley", "itemDescription": "British politician (1864-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Max_Townley", "wikipedia_page": {"main": "Maximilian Gowran Townley (22 June 1864 – 12 December 1942) was a British land agent, agriculturist and politician. He served one term in Parliament as a Conservative, and later campaigned for policies to support agriculture. At the end of his life he chaired the River Great Ouse Catchment Board, where he attempted to prevent damage to Fenland farms caused by regular flooding.", "link_mentions": [{"page": "Fulbourn", "response": ["* Max Townley – land agent, agriculturist and politician (22 June 1864 – 12 December 1942)"]}, {"page": "Mid Bedfordshire (UK Parliament constituency)", "response": ["| Max Townley"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| Max Townley"]}, {"page": "Henry Mond, 2nd Baron Melchett", "response": ["He served as Member of Parliament for the Isle of Ely 1923-24 as a Liberal. He gained the seat from the sitting Unionist Max Townley in the 1923 general election with a small majority of 467. In the same election his father, Sir Alfred Mond, Bt, lost his seat of Swansea West. He was unable to retain the Isle of Ely at the 1924 general election."]}, {"page": "St Andrew St John, 16th Baron St John of Bletso", "response": ["St John married Ellen Georgina Senior, daughter of Edward Senior, a Poor Law Commissioner. They had two daughters, one of whom married Max Townley who was a land agent for later holders of the title and served as MP for Mid Bedfordshire from 1918 to 1922. After the death of her husband, Ellen married Francis Savile Harry Judd of Rickling Essex. She died at Saffron Walden at the age of 49."]}, {"page": "Maximilian Gouvan Townley", "response": ["#REDIRECT Max Townley"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Max Townley"]}, {"page": "Frederick Linfield", "response": ["Linfield does not seem to have stood for election at the 1918 United Kingdom general election but in 1922 he was the Liberal candidate in Mid Bedfordshire. He won the seat with a majority of 2,737 over the sitting Unionist MP Max Townley.The Times, 18.10.24 In the 1923 general election, Linfield faced a three-cornered contest with a Labour candidate also standing.The Times, 27.11.23 Linfield had his majority cut to 2,023 but he described the Labour candidate, Robert Widgell, as a Free Trader like himself and claimed that Widgell had just taken votes which would otherwise have gone to him.The Times, 28.12.23"]}, {"page": "Norman Coates", "response": ["The next general election came soon after when Stanley Baldwin sought a mandate to impose protectionist tariffs. Coates had to decide whether to pursue his putative Independent candidacy and arrived in Ely on 12 November, to find that rumours about \"other reasons for the break\" were current.\"The Isle of Ely Election\", Isle of Ely and Wisbech Advertiser, 21 November 1923, p. 11. He said that he would meet supporters over the weekend of 17–18 November 1923 in Whittlesey. However he instead telephoned the Falcon Hotel to say that he was not coming as he had learned that the Conservative Association had a new candidate (Max Townley was selected) and would withdraw.\"Col. Coates' supposed withdrawal\", Isle of Ely and Wisbech Advertiser, 21 November 1923, p. 5."]}, {"page": "Maximilian Gowran Townley", "response": ["#REDIRECT Max Townley"]}, {"page": "Arthur Black (Liberal politician)", "response": ["At the 1906 general election he was elected as MP for the Biggleswade division of Bedfordshire, unseating the Liberal Unionist MP Lord Alwyne Compton by a majority of 23% of the votes.Craig, British parliamentary election results 1885–1918, page 219 He was re-elected at both the January 1910 and December 1910 elections, though with more modest majorities of 4.8% of 5.8% respectively.  The Bigglewsade division was abolished for the 1918 general election, when Black stood in the new Mid Bedfordshire division. However, his Conservative Party opponent Max Townley had received the coalition coupon, and took the seat with a majority of over 10%. After that defeat, Black did not stand for Parliament again."]}, {"page": "Towneley family", "response": ["Charles Watson Townley (1824–1893), second son of Richard and Cecil. Married Georgiana Dallison in 1874. Was Lord Lieutenant of Cambridgeshire 1874 from 1893. One of his sons was Sir Walter Townley  (1863–1945) who married Lady Susan Keppel in 1896, the daughter of William Keppel, 7th Earl of Albemarle. He entered a career in the diplomatic service. He held Ambassadorial positions to Romania 1911–12, Iran 1912–1916 and the Netherlands 1917–1919.The county families of the United Kingdom at archive.org Accessed 2010 Another son was the agriculturist and politician Max Townley."]}, {"page": "Townley", "response": ["*Max Townley (1864–1942), British land agent, agriculturist and politician"]}]}}