{"wiki_id": "http://www.wikidata.org/entity/Q6792923", "itemLabel": "Maurice Burton", "itemDescription": "British zoologist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Burton", "wikipedia_page": {"main": "Maurice Burton (28 March 1898 – 9 September 1992) was a British zoologist and popular science author, who produced many natural history encyclopedias and books including a skeptical treatment of the Loch Ness Monster.", "link_mentions": [{"page": "Loch Ness Monster", "response": ["Hugh Gray's photograph taken near Foyers on 12 November 1933 was the first photograph alleged to depict the monster. It was slightly blurred, and it has been noted that if one looks closely the head of a dog can be seen. Gray had taken his Labrador for a walk that day and it is suspected that the photograph depicts his dog fetching a stick from the loch.Loxton, Daniel; Prothero, Donald. (2015). Abominable Science! Origins of the Yeti, Nessie, and Other Famous Cryptids. Columbia University Press. pp. 142–144.  Others have suggested that the photograph depicts an otter or a swan. The original negative was lost. However, in 1963, Maurice Burton came into \"possession of two lantern slides, contact positives from th[e] original negative\" and when projected onto a screen they revealed an \"otter rolling at the surface in characteristic fashion.\"Burton, Maurice. A Ring of bright water? New Scientist. 24 June 1982. p. 872", "Grant produced a sketch of the creature that was examined by zoologist Maurice Burton, who stated it was consistent with the appearance and behavior of an otter.Burton, Maurice. A Fast Moving, Agile Beastie. New Scientist. 1 July 1982. p. 41. Regarding the long size of the creature reported by Grant; it has been suggested that this was a faulty observation due to the poor light conditions.Burton, Maurice. (1961). Loch Ness Monster: A Burst Bubble? The Illustrated London News. May, 27. p. 896 Paleontologist Darren Naish has suggested that Grant may have seen either an otter or a seal and exaggerated his sighting over time.Naish, Darren. (2016). \"Hunting Monsters: Cryptozoology and the Reality Behind the Myths\". Arcturus.", "Little is known of the second photo; it is often ignored by researchers, who believe its quality too poor and its differences from the first photo too great to warrant analysis. It shows a head similar to the first photo, with a more turbulent wave pattern and possibly taken at a different time and location in the loch. Some believe it to be an earlier, cruder attempt at a hoax, and others (including Roy Mackal and Maurice Burton) consider it a picture of a diving bird or otter that Wilson mistook for the monster.Mackal, Roy. The Monsters of Loch Ness. According to Morrison, when the plates were developed Wilson was uninterested in the second photo; he allowed Morrison to keep the negative, and the photo was rediscovered years later.The Loch Ness Story, revised edition, Penguin Books, 1975, pp. 44–45 When asked about the second photo by the Ness Information Service Newsletter, Spurling \" ... was vague, thought it might have been a piece of wood they were trying out as a monster, but [was] not sure.\"Ness Information Service Newsletter, 1991 issue", "On 29 May 1938, South African tourist G. E. Taylor filmed something in the loch for three minutes on 16 mm colour film. The film was obtained by popular science writer Maurice Burton, who did not show it to other researchers. A single frame was published in his 1961 book, The Elusive Monster. His analysis concluded it was a floating object, not an animal.Burton, Maurice. (1961). The Elusive Monster: An Analysis of the Evidence From Loch Ness. Hart-Davis. pp. 83–84", "In a 1982 series of articles for New Scientist, Maurice Burton proposed that sightings of Nessie and similar creatures may be fermenting Scots pine logs rising to the surface of the loch. A decomposing log could not initially release gases caused by decay because of its high resin level. Gas pressure would eventually rupture a resin seal at one end of the log, propelling it through the water (sometimes to the surface). According to Burton, the shape of tree logs (with their branch stumps) closely resembles descriptions of the monster."]}, {"page": "Sponge", "response": ["* Maurice Burton"]}, {"page": "List of professional sports families", "response": ["| Maurice Burton"]}, {"page": "Burton (name)", "response": ["* Maurice Burton (1898–1992), English zoologist and author", "* Maurice Burton (cyclist) (born 1955), English cyclist"]}, {"page": "List of cryptozoologists", "response": ["* Maurice Burton (1898-1992), author of The Elusive Monster: An Analysis of the Evidence from Loch Ness and Loch Ness Monster skeptic"]}, {"page": "Hymeniacidon kitchingi", "response": ["Hymeniacidon kitchingi is a species of sponge in the class Demospongiae. It is found in shallow waters in the northeastern Atlantic Ocean. This species was first described in 1935 by the British zoologist Maurice Burton. He placed it in a new genus because of its unusual spicules, and named it Rhaphidostyla kitchingi, in honour of Dr J. A. Kitching, who had collected the original specimen. It was later transferred to the genus Hymeniacidon."]}]}}