{"wiki_id": "http://www.wikidata.org/entity/Q6790125", "itemLabel": "Matthew Barnes-Homer", "itemDescription": "British footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Barnes-Homer", "wikipedia_page": {"main": "Matthew Brian Barnes-Homer (born 25 January 1986) is an English professional footballer who plays as a striker.\nBarnes-Homer started his career as a youth player at Wolverhampton Wanderers, where he spent three years. He went on to have short spells at three clubs in the lower leagues of the United States of America football pyramid during 2004, before returning to England with Aldershot Town. He then played for various non-league clubs in his local West Midlands region between 2005 and 2007 until League Two side Wycombe Wanderers signed him on a short-term contract in March 2007. He was released shortly afterwards, where he joined Conference National side Kidderminster Harriers. After a lean first season at the club, Barnes-Homer established himself as top scorer in the next campaign with 25 goals, averaging almost one goal for every two games.\nA similar goal return during 2009–10 prompted interest from former Football League club Luton Town, who signed him in January 2010. He finished the 2010–11 season as Luton's top scorer with 29 goals. He left Luton in early 2012, going on to spend four months at Swedish side Östersunds FK, before returning to the Conference with Macclesfield Town for the start of the 2012–13 season. In August 2013, he signed a two-year contract with Forest Green Rovers. On 10 January 2014, Barnes-Homer signed for Cambridge United on a free transfer until the end of the season.\n\n", "link_mentions": [{"page": "Dudley", "response": ["* Matthew Barnes-Homer (born 1986 in Dudley) English professional footballer  SoccerBase Database retrieved December 2017 who mainly played for Kidderminster Harriers F.C., Luton Town F.C. and Macclesfield Town F.C."]}, {"page": "Kidderminster Harriers F.C.", "response": ["| Matthew Barnes-Homer"]}, {"page": "Syracuse Salty Dogs", "response": ["|Matthew Barnes-Homer"]}, {"page": "Östersunds FK", "response": ["* Matthew Barnes-Homer"]}, {"page": "England national football C team", "response": ["|Matthew Barnes-Homer", "|Chris Holroyd, Matthew Barnes-Homer"]}, {"page": "Daniel Parslow", "response": ["Parslow had been playing mostly at right-back in 2010–11 before losing his place to Liam Darville in January 2011, but retained his place in the team by playing at centre-back in York's 4–0 victory over league leaders AFC Wimbledon on 1 February 2011 with McGurk suspended. Parslow scored his only goal of 2010–11 in this match after scoring the opening goal with a header from a free kick taken by Ashley Chambers. Having played at right-back the following match, he returned to playing at centre-back after McGurk's injury in York's 0–0 draw away to Altrincham on 22 February 2011. Parslow formed a central defensive partnership with Chris Smith, and manager Gary Mills praised him by calling him \"outstanding\". He had played in all of York's matches in 2010–11 before suffering a head injury following a clash of heads with Matthew Barnes-Homer in a 1–0 home win against Luton on 19 April 2011, which led to him missing the remainder of the campaign. Following the end of 2010–11, during which he made 47 appearances and scored one goal, he was named York's Clubman of the Year for a second time."]}, {"page": "Justin Richards (footballer)", "response": ["Richards returned to Kidderminster and decided to stay on at the club for the 2008–09 season. He enjoyed his second most prolific season in the Conference, hitting seventeen goals in all competitions. His shooting partner, and good friend, Matthew Barnes-Homer managed to top this tally with nineteen goals."]}, {"page": "Kyle Perry", "response": ["He joined Northern Premier League newcomers Hednesford Town in the summer of 2006, but only played one game for the \"Pitmen\" – the opening day defeat against Marine before being released by manager Phil Starbuck. He then moved to Southern League Division One Midlands side Willenhall Town on £70-a-week, where he formed a potent partnership with Matthew Barnes-Homer. Perry went on to score 26 goals for the \"Reds\" and was selected in the Southern Football Division One Midlands Team of the year, but was not selected to play in the play-off final defeat to Bromsgrove Rovers. After a prolific season at Noose Lane, he joined Chasetown in the summer of 2007. Another excellent return in front of goal saw him play in Chasetown's 1–0 FA Cup victory over Port Vale in December 2007. In doing this he helped Chasetown become the lowest ever ranked club to reach as far as the third round proper of the FA Cup."]}, {"page": "Ryan Charles", "response": ["On 26 November 2009, Charles joined Kidderminster Harriers, the team he had scored a late winner against as a Luton player in October, on a one-month loan as part of the deal taking Harriers striker Matthew Barnes-Homer to Luton. He played three games at Kidderminster, before returning to Luton. Charles did not play another game that season, and was released from the club on 31 May 2010."]}, {"page": "2008–09 Football Conference", "response": ["|Matthew Barnes-Homer"]}, {"page": "List of Luton Town F.C. seasons", "response": ["|align=\"left\"|Matthew Barnes-Homer"]}, {"page": "2009–10 Luton Town F.C. season", "response": ["On 26 November, the day of the loan transfer deadline, Coventry City winger Ashley Cain was signed for one month. Midfielder Andy Burgess, who was signed only in May 2009 and had made 10 appearances for the club, joined promotion rivals Mansfield Town on an initial one-month loan with a permanent transfer arranged for January 2010. In a busy day of transfer dealing, striker Steve Basham, sparsely used since his arrival in the summer, completed a two-month loan to Hayes & Yeading United. Luton signed Kidderminster Harriers' top scorer Matthew Barnes-Homer on a two-and-a-half-year contract for a five-figure fee, with the permanent transfer taking place in January 2010. Barnes-Homer would play until then on loan, with young Luton striker Ryan Charles heading to Kidderminster on loan for one month as part of the deal.", "A series of postponements to games due to snow and ice left a sparse fixture list for the rest of the month, with Luton's only other game resulting in a 4–1 victory over Eastbourne Borough on 28 December, Matthew Barnes-Homer scoring his first goal for the club.", "Experienced trio Kevin Nicholls, Alan White and Kevin Gallen were placed on the transfer list by Richard Money on 12 January. White joined his previous club Darlington on loan for the rest of the season three days later. Midfielder Keith Keane, who had started his career with Luton, was placed on the transfer list on 15 January. Keane's refusal to sign a new contract, which would expire at the end of the season and effectively mean he would leave the club on a free transfer, was cited as the reason. Striker Mark Nwokeji, meanwhile, extended his loan agreement with Luton until the end of the season, while the permanent transfers of Matthew Barnes-Homer and Fred Murray, who had both previously been playing for the club on loan, were confirmed.", "Luton, who were at this point second in the table, faced a key clash with league leaders Stevenage Borough on 3 April. Luton secured a 1–0 win at Broadhall Way in a tightly contested game, Matthew Barnes-Homer scoring the winning goal just moments after his introduction as a substitute, and inflicted Stevenage's first home defeat since November 2008. Luton were now only two points behind Stevenage, though the leaders had a game in hand. A ninth consecutive victory was assured two days later as Luton beat already relegated side Grays Athletic 6–0 at Kenilworth Road, with Kevin Gallen scoring the first hat-trick of his career.", "|align=\"left\"|29||align=\"left\"|FW||align=\"left\"| Matthew Barnes-Homer", "| 13 January 2010 ||  Matthew Barnes-Homer || Kidderminster Harriers ||align=\"center\"| Undisclosed ||align=\"center\"|", "| 26 November 2009 ||  Matthew Barnes-Homer || Kidderminster Harriers || 13 January 2010 ||align=\"center\"|", ":D.  The fee for the transfer of Matthew Barnes-Homer is believed to be a five-figure amount in the region of £75,000, though no official confirmation has yet been released.", ":E.  Matthew Barnes-Homer's and Andy Burgess' transfers became permanent during the January transfer window. Until then, they played for the club they were joining on loan."]}, {"page": "Jason Walker (footballer)", "response": ["Walker signed for fellow Conference Premier side Luton Town on 17 November 2010, initially on loan, with a view to a permanent transfer in January 2011. He scored on his Luton debut with a header from Matthew Barnes-Homer's cross and earlier in the match assisted a Jake Howells goal in a 5–1 win at home to Histon on 20 November 2010."]}, {"page": "2010–11 Luton Town F.C. season", "response": ["Luton began the season on 14 August with a 2–1 win against Altrincham. Kroča scored on his competitive debut to give Luton the lead, and Matthew Barnes-Homer grabbed the winner in the 88th minute after Altrincham pulled a goal back midway through the second half.", "On 17 September, Luton beat league leaders AFC Wimbledon 3–0 with goals from George Pilkington, Zdeněk Kroča and Matthew Barnes-Homer. Young striker Dan Walker also made his debut for the club. Four days later, Luton came from behind to secure a 2–2 draw with recently relegated Darlington; Claude Gnakpa and Jake Howells scoring the Hatters' goals. Luton faced another trip to North East England four days later to face Gateshead, in a game they lost 1–0 and had striker Taiwo Atieno sent off in the first half. Atieno's red card was later rescinded by the Football Association.", "17 November also saw Luton play their FA Cup replay against Corby Town – the game ended in a 4–2 victory to the Hatters, with Matthew Barnes-Homer, Taiwo Atieno and Claude Gnakpa scoring the goals. This win set up a Second Round tie away to League One side Charlton Athletic.", "Luton started 2011 with a 3–0 home win over Rushden & Diamonds on New Year's Day. Matthew Barnes-Homer scored his twelfth and thirteenth goals of the season, with Claude Gnakpa adding the final goal in what was the club's first league game in 42 days. Three days later, Gnakpa scored the only goal of the game in a 1–0 away win against Hayes & Yeading United.", "Luton beat Guiseley 1–0 on 26 February to earn a place in the FA Trophy semi-final, Matthew Barnes-Homer scoring the winner.", "The goals continued to flow, as a 4–0 victory over Histon on 25 April guaranteed Luton would play fourth-placed Wrexham in the play-off semi-finals. The game saw goals from Matthew Barnes-Homer, his 18th and 19th of the season, Amari Morgan-Smith and Claude Gnakpa. Coincidentally, the final league game of the season on 30 April was also against Wrexham, which ended in a 1–1 draw.", "|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Matthew Barnes-Homer", "|align=\"left\"|LTSC Junior Members' Player of the Year||align=\"left\"| Matthew Barnes-Homer||align=\"left\"|9||align=\"left\"|FW"]}, {"page": "2011 Conference Premier play-off Final", "response": ["|FW ||9||Matthew Barnes-Homer || || "]}, {"page": "2011–12 Luton Town F.C. season", "response": [" Luton followed up their loss to TNS with a 2–1 victory over Airbus UK Broughton on 19 July. They ended the tour on a high, with Matthew Barnes-Homer scoring the only goal in a 1–0 win against Colwyn Bay on 21 July. During the tour a number of players were taken on trial, including Broughton, defender Will Antwi, and midfielder Jon Routledge.", "On 25 August, striker Matthew Barnes-Homer joined League One side Rochdale on loan until January 2012. The next day, Southport attacking midfielder John Paul Kissock joined Luton on a two-year contract for an undisclosed fee. As part of the deal, Luton midfielder Godfrey Poku and striker Dan Walker joined Southport on loan until December 2011.", "Luton mirrored their 5–0 home win against Kettering Town with another 5–0 victory in the away game on New Year's Day. The same day saw striker Matthew Barnes-Homer leave the club, while defender Will Antwi was released the next day. The club also made permanent the loan signings of defenders János Kovács and Greg Taylor, who both signed 18-month contracts. Fourth and fifth successive league victories in early January followed with a 2–0 home win against Newport County and a 1–0 win against Stockport County. These cemented Luton's third position in the table. After the initial game was postponed due to a frozen pitch, the club's FA Trophy second round tie with Hinckley United was played out on 18 January. The two clubs struggled to a 0–0 draw, meaning a replay would be played on 23 January.", "|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Matthew Barnes-Homer", "| 1 January 2012 ||  Matthew Barnes-Homer ||align=\"center\" colspan=2| Released ||align=\"center\"| ", "| 25 August 2011 ||  Matthew Barnes-Homer || Rochdale || 1 January 2012  || style=\"text-align:center;\"| "]}, {"page": "2011–12 Rochdale A.F.C. season", "response": ["| Matthew Barnes-Homer"]}, {"page": "2012–13 FA Cup", "response": ["#Matthew Barnes-Homer, Macclesfield Town"]}, {"page": "Matt Barnes (disambiguation)", "response": ["* Matthew Barnes-Homer (born 1986), English footballer"]}, {"page": "2012–13 Football Conference", "response": ["|align=\"left\"|Matthew Barnes-Homer"]}, {"page": "List of Kidderminster Harriers F.C. seasons", "response": ["|Matthew Barnes-Homer"]}, {"page": "List of Macclesfield Town F.C. seasons", "response": ["| Matthew Barnes-Homer"]}, {"page": "2014–15 Cambridge United F.C. season", "response": ["|27 May 2014||FW|| Matthew Barnes-Homer|| Whitehawk||Free||"]}, {"page": "Matt Barnes-Homer", "response": ["#REDIRECT Matthew Barnes-Homer"]}, {"page": "Matthew Brian Barnes-Homer", "response": ["#REDIRECT Matthew Barnes-Homer"]}, {"page": "List of foreign USL Championship players", "response": ["*Matthew Barnes-Homer – Wilmington Hammerheads – 2016"]}]}}