{"wiki_id": "http://www.wikidata.org/entity/Q6793419", "itemLabel": "Maurice Priestley", "itemDescription": "statistician", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Priestley", "wikipedia_page": {"main": "Maurice Bertram Priestley (15 March 1933 – 15 June 2013) was a professor of statistics in the School of Mathematics, University of Manchester. He gained his first degree at the University of Cambridge and went on to gain a Ph.D. from the University of Manchester.\nHe was known especially for his work on time series analysis, especially spectral analysis and wavelet analysis. He was a longstanding editor of the Journal of Time Series Analysis, a special edition of which was published in his honour in 1993.\nLess well-known but equally important was his work with M.T.Chao on nonparametric function fitting.", "link_mentions": [{"page": "Department of Mathematics, University of Manchester", "response": ["With the rapid expansion of higher education and the starting of an undergraduate mathematics degree this changed, and by 1968 the 15-storey Maths and Social Sciences Building (MSS) was completed on UMIST campus to house the growing department. In 1960 Robin Bullough joined the UMIST department initiating four decades of mathematical physics focusing especially on solitons. The statistics group also grew in strength with an emphasis on time series, led by Maurice Priestley and also Tata Subba Rao. In 1986 pure mathematics at UMIST was strengthened by the appointment of Martin J. Taylor FRS, famous for his work on properties and structures of algebraic numbers."]}, {"page": "Priestley", "response": ["* Maurice Priestley (1933–2013), emeritus professor of statistics at the University of Manchester"]}, {"page": "Howell Tong", "response": ["Tong, a scholarship boy, left Wah Yan College  香港華仁書院 (founded by the Irish Jesuits in 1919) in Hong Kong in 1961, and was sent by his father to complete his matriculation at the Barnsbury School for Boys in North London (-one of the earliest comprehensive schools in England, now no longer in existence). He got his Bachelor of Science in 1966 (with first class honours in Mathematics), Master of Science in 1969 and Doctor of Philosophy in 1972,  all from the University of Manchester Institute of Science and Technology (UMIST, now merged into the University of Manchester), where he studied under Maurice Priestley. Tong remained at UMIST first as a lecturer and then as a senior lecturer. While in Manchester, he started his married life with Ann Mary Leong. In 1982, he moved to the Chinese University of Hong Kong as the founding Chair of Statistics.  Four years later, he returned to England to be Chair Professor of Statistics (and sometime Director of the Institute of Mathematics and Statistics) at the University of Kent at Canterbury, a post he held until 1999. He was the first ethnic Chinese to hold such a chair professorship in the UK, thus opening the door for other ethnic Chinese statisticians.  From 1999 to September 2009, Tong was Chair Professor of Statistics at the London School of Economics and founded the Centre for the Analysis of Time Series. Between 1997 and 2004, Tong was also Chair Professor of Statistics,  Founding Dean of the Graduate School and later Pro-Vice Chancellor, University of Hong Kong."]}, {"page": "2013 in the United Kingdom", "response": ["* 15 June – Maurice Priestley, 80, mathematician."]}, {"page": "Deaths in June 2013", "response": ["*Maurice Priestley, 80, British mathematician.Obituary: Maurice Priestley 1933–2013"]}]}}