{"wiki_id": "http://www.wikidata.org/entity/Q6790117", "itemLabel": "Matthew Bannister", "itemDescription": "British media executive and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Bannister", "wikipedia_page": {"main": "Richard Matthew Bannister (born 16 March 1957) is a British media executive and broadcaster.", "link_mentions": [{"page": "BBC Radio 1", "response": ["In his last few months as controller, Johnny Beerling commissioned a handful of new shows that in some ways set the tone for what was to come under Matthew Bannister. One of these \"Loud'n'proud\" was the UK's first national radio series aimed at a gay audience (made in Manchester and was aired from August 1993). Far from being a parting quirk, the show was a surprise hit and led to the network's first coverage of the large outdoor Gay Pride event in 1994.", "| 19931998 || Matthew Bannister"]}, {"page": "BBC World Service", "response": ["The World Service in English mainly broadcasts news and analysis. The mainstays of the current schedule are Newsday, World Update, Newshour and The Newsroom. There are daily science programmes: Health Check, the technology programme Click and Science in Action. At weekends, some of the schedule is taken up by Sportsworld, which often includes live commentary of Premier League football matches. Other weekend sport shows include The Sports Hour and Stumped, a cricket programme co-produced with All India Radio and the Australian Broadcasting Corporation. On Sundays the international, interdisciplinary discussion programme The Forum is broadcast. Outlook is a human interest programme presented by Matthew Bannister and Jo Fidgen, which was first broadcast in July 1966 and presented for more than thirty years by John Tidmarsh. Trending describes itself as \"explaining the stories the world is sharing...\" Regular music programmes were reintroduced with the autumn schedule in 2015. Many programmes, particularly speech-based ones, are also available as podcasts. Business Daily is a weekday live international business news programme, which broadcasts from 8:32:30am to 8:59:00am UK time from Broadcasting House in London."]}, {"page": "Tim Westwood", "response": ["During his career Westwood has DJed for many radio stations, including the newly formed radio stations Kiss FM (which he co-owned) and LWR in the 1980s, followed by mainstream station Capital FM (from 1987). In December 1994, following a shake up of Radio 1 by the then chief executive Matthew Bannister, he was given the new national Radio 1 Rap Show."]}, {"page": "NME", "response": ["Later in 1992, Steve Sutherland, previously an assistant editor of Melody Maker, was brought in as the NMEs editor to replace Danny Kelly. Andrew Collins, Stuart Maconie, Steve Lamacq, and Mary Anne Hobbs all left the NME in protest, and moved to Select; Collins, Maconie and Lamacq would all also write for Q, while Lamacq would join Melody Maker in 1997. Kelly, Collins, Maconie, Lamacq and Hobbs would all subsequently become prominent broadcasters with BBC Radio 1 as it reinvented itself under Matthew Bannister."]}, {"page": "BBC Radio", "response": ["|1996|| Matthew Bannister"]}, {"page": "Gil Scott-Heron", "response": ["After Scott-Heron's death, Malik Al Nasir told The Guardians Simon Hattenstone of the kindness that Scott-Heron had showed him throughout his adult life since meeting the poet backstage at a gig in Liverpool in 1984. The BBC World Service covered the story on their Outlook program with Matthew Bannister, which took the story global. It was subsequently covered in other media such as BBC Radio 4's Saturday Live, where jazz musician Al Jarreau paid tribute to Gil, and was mentioned the U.S. edition of Rolling Stone and The Huffington Post. Malik & the O.G's performed a tribute to Scott-Heron at the Liverpool International Music Festival in 2013 with jazz composer Orphy Robinson of The Jazz Warriors and Rod Youngs from Gil's band The Amnesia Express. Another tribute was performed at St. George's Hall in Liverpool on August 27, 2015, called \"The Revolution will be Live!\", curated by Malik Al Nasir and Richard McGinnis for Yesternight Productions. The event featured Talib Kweli, Aswad, The Christians, Malik & the O.G's, Sophia Ben-Yousef and Cleveland Watkiss as well as DJ 2Kind and poet, actor, and radio DJ Craig Charles. The tribute was the opening event for 2015 Liverpool International Music Festival."]}, {"page": "Chris Evans (presenter)", "response": ["Owing to his success working on both shows, Evans was offered a producer role at BBC Radio 1, but was persuaded to stay at GLR after station controller Matthew Bannister gave him the chance to present his own show, taking over Saturday afternoons in early 1990. Three months later, he started presenting The Greenhouse, a Monday-to-Thursday evening show; he remained in this slot until the end of 1990.", "Allowed to create the \"zoo\" format he had previously been disallowed from performing on Radio 1, Evans was given a free rein by his friend, the station's controller Matthew Bannister. Critics hated innuendo-laden features like Honk Your Horn and in Bed with Your Girlfriend, but Evans put on 600,000 new listeners over Steve Wright – one for every £5 spent on salary and advertising. The effect also flowed through into the listening figures for later programmes. The audience grew as the breakfast format became more outrageous: humiliating assistant Holly Samos by repeatedly asking her about her sex life (Evans and Samos were reportedly in a relationship at periods through their time working together), and encouraging two female guests to perform a strip show on live radio. The show's highest listening figure reached 7.5 million."]}, {"page": "Peggy Mitchell", "response": ["Because \"radical, body-altering\" surgery on a long-running character would cause the production team ongoing problems with continuity, it was decided that Peggy would have a \"less visible\" lumpectomy, rather than a mastectomy. A member of the EastEnders production team explained: \"We have to think about costume and what it's going to look like afterwards and what we're lumbering ourselves with [...] you have to think of that for a long-term character.\" Additionally, giving Peggy a lumpectomy at that stage of her disease was viewed favourably by source organisations, as it helped to spread a message that a mastectomy is not necessary in all breast cancer cases. However, the storyline was revisited several times over the next few years. In August 1997, Peggy was given the \"all-clear\" at her follow-up mammogram, and in March 1999 the cancer returned and she underwent a mastectomy, while in 2000 she had a breast reconstruction. It has been reported that Peggy was the first soap opera character to undergo a mastectomy. BBC Production chief executive Matthew Bannister praised Windsor's portrayal of Peggy coming to terms with a mastectomy, commenting: \"It's brought a good deal of comfort and help to us and a lot of other people.\""]}, {"page": "Capital London", "response": ["*Matthew Bannister"]}, {"page": "Broadcasting House (radio programme)", "response": ["Broadcasting Houses original presenter was Eddie Mair, who left the programme on becoming the regular sole presenter of PM in 2003.  After a period with no regular presenter, Fi Glover replaced Mair at the beginning of 2004. Matthew Bannister was the first stand-in presenter when Glover went on maternity leave, but on gaining his own new obituary strand on Radio 4, Last Word, most editions of BH in the spring/summer of 2006 were presented by Working Lunch and BBC Three presenter Paddy O'Connell. Glover did not return, instead taking on the Saturday 9am slot with Saturday Live, and on 30 August 2006, O'Connell was named as the new regular host of BH."]}, {"page": "Danny Baker", "response": ["Baker joined BBC Radio 1 in October 1993, taking over the weekend mid-morning show from 10am to 1pm from Dave Lee Travis who had resigned on air following the sackings instigated by Matthew Bannister and Trevor Dann during the early 1990s. However, due to poor ratings, from November 1994 he was heard on Saturdays only from 10am to 12 noon. Simon Mayo took over Sunday mornings."]}, {"page": "Paul Gambaccini", "response": ["Gambaccini then started broadcasting in the UK, on BBC Radio 1, September 1974, which he did for 13 years, first as a music reporter on the John Peel Saturday show Rockspeak. He presented the series All American Heroes from 1974, a series showcasing US talent. In September 1975 he began the show he was to front for the next 11 years, highlighting the weeks' music in the US chart. The show was broadcast every Saturday afternoon until his last show on February 8, 1986. Thereafter, he moved to independent radio to host American Countdown. In 1990, he returned to Radio 1, but left during the tenure of controller Matthew Bannister in 1993."]}, {"page": "BBC Radio Nottingham", "response": ["*Matthew Bannister, former late night host on Radio 5 Live,  worked as a reporter in 1978"]}, {"page": "BBC Radio London", "response": ["Heading the new station were Managing Editor Matthew Bannister and Programme Organiser Trevor Dann. Bannister, from Capital London, favoured a young, racy, news and speech format, miles away from the typically stuffy BBC Local Radio sound. Dann came from Radio 1, via BBC TV's Whistle Test, and developed an album-oriented music policy. GLR was aimed at people who hate pop but love music, hate prattle (excessive on-air talk) but want to know what's what where in the world. The station was aimed at 25- to 45-year-olds, who perhaps grew up with Radio 1, but now wanted to be intelligently informed about the city in which they live, and the world in general. Early promotions used the phrase \"rock 'n' rolling news\". Much of the daytime speech output covered London events and nightlife, with comedians and other artists being interviewed. The music mix was best described as Adult album alternative, though indie bands such as The Wonder Stuff were also played. It has been said this Triple-A format inspired the launch of BBC Radio 6 Music years later.", "In 1991, Matthew Bannister left to spearhead the BBC's charter-renewal strategy called Extending Choice. He was replaced as Managing Editor by Trevor Dann. Kate Marsh was appointed News Editor. In 1993 GLR was forced to relinquish its 1458 kHz medium wave frequency, for a new commercial radio station which was eventually won by Sunrise Radio. Previously it had been simulcasting with 94.9 MHz FM with a few programmes which occasionally opted from FM. In 1993, Nigel Chapman, Head of BBC South & East, drove through a policy of \"speech shoulders\", forcing GLR to drop its music/speech mix at breakfast and drive times. Dann resigned in protest and left the BBC."]}, {"page": "Absolute Radio", "response": ["In January 1997, Chris Evans had left his role as presenter of the Radio 1 breakfast show as a result of a disagreement between him and the programme controller Matthew Bannister (Evans had asked for Fridays off to allow more time for him to work on his Channel 4 television show, TFI Friday). Evans was keen to return to radio and it had been reported that his agent, Michael Foster, had approached Matthew Bannister to ask if Evans would be allowed to be return to Radio 1, and he had gone as far as commencing negotiations to buy Talk Radio."]}, {"page": "Emma Freud", "response": ["In 1993, Freud first appeared on BBC Radio 1, deputising for Nicky Campbell on his late night show Into The Night. Later that year, she was invited by the network's new controller Matthew Bannister to reinvent the lunchtime programme previously presented by Jackie Brambles. From January 1994, she appeared on permanent basis on the station every weekday between noon and 2.00 pm, presenting a mix of music, interviews and interactive news features. Her programme was praised by some but it proved unpopular with many who preferred the old mainstream pop fare. In Simon Garfield's 1998 book on Radio 1, The Nation's Favourite, Bannister claims that Freud was \"treated very badly by people at the station, especially other women\"."]}, {"page": "Steve Wright (DJ)", "response": ["Wright and his Posse moved to The Radio 1 Breakfast Show in 1994. He resigned from the Breakfast Show in 1995 due to differences with the BBC Radio 1 management; he was unhappy with the plummeting listening figures of the station due to its restructuring under new controller Matthew Bannister, which led to many of the more established DJs leaving, or being sacked, around this time."]}, {"page": "Alan Freeman", "response": ["Freeman left the BBC to work for Capital Radio from 1979 to 1989, presenting the Top 40 of the 1970s on 31 December 1979 under the revived Pick of the Pops name. He again revived Pick of the Pops from 13 March 1982 (now called Pick of the Pops Take Two, combining the current NME Top 15 with an earlier chart) and The Rock Show previous to that on 7 January 1980. He returned to the BBC and Radio 1 in January 1989 to revive The Rock Show and Pick of the Pops. This run of Pick of the Pops ended on 27 December 1992 but he continued to host The Rock Show until 23 October 1993, when he, with other long-serving DJs, left the station as it was revamped by controller Matthew Bannister."]}, {"page": "Smashie and Nicey", "response": ["Enfield's parody of Radio 1's increasing irrelevance to the youth audience it supposedly catered for was a factor in Matthew Bannister's decision to terminate the employment of many older presenters when he became controller of Radio 1 in 1993.", "The sketches proved very popular, largely because they reflected the image that Radio 1 had at the time. Much of the station's output was widely considered dull and unchallenging, and the average age of both listeners and presenters had risen above thirty, when it was intended to cater to a young audience. When Matthew Bannister arrived at Radio 1 in 1993 with a mission to rejuvenate the station, he referred directly to the characters in stating that his goal was to rid it of its \"Smashie and Nicey\" image. Whitehouse later expressed his unease after being congratulated by BBC Director-General John Birt for assisting this process, stating that Birt was a \"greater menace\" than any of the DJs who were \"harmless\". In 1993, Dave Lee Travis commented on the characters in Q magazine, saying \"This Smashie and Nicey crap that they keep bringing up. Is that funny? It doesn't raise a smile with me.\""]}, {"page": "Simon Bates", "response": ["When Matthew Bannister arrived to modernise Radio 1, Bates was thought to be under threat. Bannister says in The Nation's Favourite that he feared Bates's supposed subversive influence rather than his broadcasting style. Bates resigned in summer 1993 before the station could dismiss him, playing \"Life Is a Rock (But the Radio Rolled Me)\" by Reunion as his last record.Garfield, Simon. The Nation's Favourite (1998)"]}, {"page": "Mark Goodier", "response": ["When Simon Mayo left Radio 1 Breakfast in 1993, former BBC Radio 1 controller Matthew Bannister approached Steve Wright to take over the slot. Wright said that he would not do so immediately after Mayo, and Bannister asked Goodier to host for four months in late 1993. He then shifted to afternoons, then back to his old drivetime slot in 1995. In the same year, he returned to the chart show after Bruno Brookes left the station."]}, {"page": "Mathew Bannister", "response": ["#REDIRECT Matthew Bannister"]}, {"page": "List of University of Nottingham people", "response": ["* Matthew Bannister – BBC broadcaster and administrator"]}, {"page": "Real Love (Beatles song)", "response": ["The station's controller, Matthew Bannister, denied that the failure to include \"Real Love\" was a ban, saying that it merely meant that the song had not been included on the playlist of each week's 60 most regularly featured songs. As an act of goodwill, the station produced a \"Golden Hour\" dedicated to the group's music as well as music by bands influenced by the Beatles. This \"Golden Hour\" concluded with a playing of \"Real Love\".Culf, Andrew (12 March 1996). Radio 1 changes tune on Beatles. The Guardian."]}, {"page": "Johnny Beerling", "response": ["Beerling took enforced early retirement, aged 55, from the station in October 1993, and many of the station's veteran DJs either resigned or were sacked when Matthew Bannister succeeded him as controller. The network's ethos, music policy and target audience changed dramatically. Beerling publicly criticised the new regime at the BBC, specifically Director-General John Birt."]}, {"page": "Janice Long", "response": ["In 1989, she joined London station BBC Radio London (then known as Greater London Radio), taking over from Nick Abbot on the breakfast show. At the time GLR was being run by future BBC Radio 1 controller Matthew Bannister and future Radio 1 executive Trevor Dann. Long left the breakfast show  but continued to work for the station, where she took over a weekend show. In addition to this, she was heard presenting and producing occasional shows on the old BBC Radio 5. Long became involved with XFM in London when it had a Restricted Service Licence (RSL), and played a crucial part in its bid for a permanent licence."]}, {"page": "Bob Harris (radio presenter)", "response": ["Harris left Radio 1 in October 1993 as he, along with many other Radio 1 DJs, was felt not to fit in with the changes being made by new controller Matthew Bannister. Lynn Parsons took over his 124 am slot, but Harris continued to do the occasional documentary for the network for some time afterwards."]}, {"page": "Harry Enfield & Chums", "response": ["Out-of-date Fab FM DJs Dave Nice and Mike Smash, a thinly veiled parody of some older Radio 1 DJs of the time. It is believed that the characters were based primarily on Mike Read, Simon Bates and Tony Blackburn, though other then-current DJs such as Alan Freeman were also believed to have influenced the writers. Each skit would feature the pair's love of \"You Ain't Seen Nothing Yet\" by Bachman–Turner Overdrive, seemingly the only record they ever played – although they were shown playing other records at the introduction of several sketches. The pair would also try to outdo each other with deliberate mentions of charidee (charity) work for which the pair would ostensibly claim to be keeping hush-hush. The sketch was dropped when the show became Harry Enfield & Chums, although the characters returned in other programmes, including the hour-long special \"End of an Era\", a \"career\" retrospective inspired by the upheavals at Radio 1 in 1993 under new controller Matthew Bannister.  The two, particularly Smashie, briefly appeared in a series of TV commercials for Fab ice-cream lollies."]}, {"page": "Johnnie Walker (DJ)", "response": ["In October 1988, Walker was one of the original presenters on the new BBC local station in London BBC GLR, in a lineup which included Nick Abbot, Emma Freud, Tommy Vance and Dave Pearce and was run by future Radio 1 controller Matthew Bannister. Walker presented the weekday slot from noon to 3pm. Then after a few months, he took over from Emma Freud from 10am to 1pm.", "In 1990, Walker joined the new BBC Radio 5, presenting This Family Business three days a week, Mondays, Wednesdays and Fridays from 11am to 12.30pm. As a result, he took over the weekday show on BBC GLR from 7 to 9pm, where he remained until later that year, when he was dismissed from the station by Matthew Bannister after making the comment that people would be \"dancing in the streets\" about the resignation of Margaret Thatcher as prime minister."]}, {"page": "Claire Sturgess", "response": ["Her Rock Show moved to Sunday afternoon in October 1993, following the restructuring of the station by new controller Matthew Bannister, but it then moved to Sunday Evening just 7 months later in May 1994. She was added to the presenting roster of BBC television music programme Top of the Pops in September 1994 but presented only two episodes before being replaced by Lisa I'Anson."]}, {"page": "Friday Rock Show", "response": ["The show was taken over by Claire Sturgess, who had been Radio 1 DJ Simon Bates' secretary prior to her appointment, but it went on a temporary break for a while.  It was moved to Sunday afternoons when Matthew Bannister became controller in October 1993, and then to Sunday evenings in May 1994.  For its last year, 1995–6, it was broadcast from Glasgow and presented by John Cavanagh.  The format of the programme fundamentally changed when Sturgess took over, firmly setting out its stall in the 'contemporary thrash' genre."]}, {"page": "List of people from Sheffield", "response": ["*Matthew Bannister, BBC Radio 5 Live presenter"]}, {"page": "Neil Fox (broadcaster)", "response": ["Fox was establishing himself as one of Capital FM's most popular DJs and in 1993 he began presenting the Sunday afternoon Network Chart Show, which owing to sponsorship went on to be called the Pepsi Network Chart before becoming simply the Pepsi Chart in 1996 and then hit40uk, sponsored by Woolworths in 2003. During Fox's tenure this show, which had previously been hosted by David Jensen, overtook the official Top 40 show on BBC Radio 1 (broadcast at exactly the same time). In addition to this, he still continued with his evening show, although from 1995 he went out on Sundays to Thursdays. On Sundays his show was from 7.00 pm to 8.30 pm as he presented the Chart show beforehand. In 1997 it was rumoured that Matthew Bannister offered Fox the breakfast show on BBC Radio 1, following the departure of Chris Evans from the station. In late 1998 he took over Capital's 4.00 pm – 7.00 pm drivetime show from David Jensen which was later extended to 8.00 pm."]}, {"page": "Bannister", "response": ["*Matthew Bannister (born 1957), British media executive and broadcaster.", "*Matthew Bannister (musician) (born 1962), New Zealand musician, journalist, and academic"]}, {"page": "Tolkien family", "response": ["Ruth Tolkien is registered blind and is believed to be the only blind fencer competing against sighted opponents in British Fencing events. As of September 2015, she is ranked 186 in the UK by British Fencing. In October 2015 she was interviewed by Matthew Bannister on the BBC World Service about her fencing success."]}, {"page": "John Huchra", "response": ["*Last Word, 05/11/2010. BBC Radio 4. Matthew Bannister on Ted Sorensen, Maurice Murphy, John Huchra and Ronnie Clayton."]}, {"page": "Andy Parfitt", "response": ["Andrew John Parfitt (born 24 September 1958, Bristol) is the Executive Director of Talent for ad agency Saatchi & Saatchi. He was the Controller of BBC Radio 1 in the United Kingdom, and held that role from 1998–2011, taking over from Matthew Bannister. He was also the controller of BBC Radio 1Xtra, BBC Asian Network, BBC Popular Music and BBC Switch. He was recently appointed Chair of the UK charity Youth Music.", "Parfitt joined the BBC in 1980 working as a Studio Manager. He spent some time with BFBS in the Falkland Islands, before returning to the UK in 1984. He became a producer in BBC Education in 1985, then joined Radio 4 in 1987 and produced Pick of the Week and Bookshelf. He helped set up Radio 5, and became the network's Assistant Editor in 1989. He joined Radio 1 as Chief Assistant to the Controller in 1993. A year later he was promoted first to Editor, Commissioning and Planning and soon after to Managing Editor. In 1997, he became the network's Deputy Controller when Matthew Bannister was appointed Director of BBC Radio."]}, {"page": "List of Old Edwardians (Sheffield)", "response": ["* Matthew Bannister (born 1957) – British radio administrator and broadcaster"]}, {"page": "Adrian Juste", "response": ["Juste was amongst the older DJs who were dismissed during the early 1990s by the then controller of Radio 1 Matthew Bannister, leaving in 1994. He bitterly railed against the changes in a subsequent BBC television documentary on Bannister's time at the radio station. Juste subsequently made appearances on LBC, Radio Carousel and Jewel FM, and currently works as an advertising writer. He also did a few editions of \"The UK Top 20 Rewind\" with Shaun Tilley during 2003. He appeared on a Christmas special on BBC local radio in 2005 and two more shows for KCFM, during 2008 and 2009 featuring the usual mix of music and comedy."]}, {"page": "Radio 1 Roadshow", "response": ["In the early 1990s several attempts were made to modernise the Roadshow. Under Matthew Bannister, for example, in 1993 and 1994, the station commissioned an independent production company to make an audio postcard for each venue in advance of the Roadshow's arrival in that place. 36 whistle-stop \"2 Minute Tours\" were made each year, and broadcast several times in the 24 hours leading up to the Roadshow proper, in order to give a wider reflection of life in each place.  "]}, {"page": "Steve Sutherland (DJ)", "response": ["Sutherland got his first break in radio via an introduction from the then-BBC Radio 1 producer Ivor Etienne, (who dubbed him 'Steve 'Smooth' Sutherland'), to the then-controller of Radio 1, Matthew Bannister, to host a four-hour radio show encompassing Hip Hop, R&B, Soul, UK Garage, Dancehall and House. He enlisted Seamus Haji, and after that brief foray, did various radio mixes for Kiss 100, before London's Choice FM approached him in 2000. He then brought co-host Asha on board; the duo had one of the most successful shows on Choices' new sister station Choice 107.1, with two shows during the week. Sutherland quickly picked up on the craft of running a successful radio program and went on to guest-host other shows on Choice FM 96.9."]}, {"page": "List of on-air resignations", "response": ["*August 8, 1993 – Dave Lee Travis, BBC Radio 1 DJ resigned on-air, citing \"There are changes being made at the station that go against my principles\" in reference to Matthew Bannister's plans for the station.The cull of Radio 1 | BBC Radio"]}, {"page": "Arts in Marrakech (AiM) International Biennale", "response": ["Matthew Bannister,"]}, {"page": "Last Word", "response": ["Matthew Bannister, although on odd occasions it has been presented by other people such as Kate Silverton or Julian Worricker.  The programme was first broadcast on 10 February 2006."]}, {"page": "Eddie Gordon", "response": ["Gordon took the Essential Mix to Ibiza in 1995, the first BBC produced show to air live from the noted club-scene holiday island, by recording an Essential Mix show set of DJ Nicky Holloway at the Ku club (now Privilege). The following year, Gordon and Tong persuaded station controller Matthew Bannister to allow Tong to play a set live from Ibiza; in 1998 he blew the windows out of Café del Mar when playing a set there for the Essential Mix. DJ Carl Cox's first ever live recording on the infamous Terrace for BBC Radio 1, produced by Gordon, won two awards in 1998, BBC Radio 1 Essential Mix Show of the Year and Muzik Mag's BBC Radio 1 Essential Mix Show of the Year. Gordon was at the forefront of the Balearic beat worldwide explosion, and in celebration in 2005 BBC Radio 1 celebrated 10 years of broadcasting from Ibiza, followed by even more high profile 20 year celebrations in 2015."]}]}}