{"wiki_id": "http://www.wikidata.org/entity/Q6794659", "itemLabel": "Max Clifford", "itemDescription": "disgraced publicist and convicted sex offender", "wikipedia_url": "https://en.wikipedia.org/wiki/Max_Clifford", "wikipedia_page": {"main": "Maxwell Frank Clifford (6 April 1943 – 10 December 2017) was an English publicist. He was particularly associated with promoting 'kiss and tell' stories in tabloid newspapers. \nClifford was arrested in December 2012 on suspicion of sexual offences, as part of Operation Yewtree. He was sentenced to eight years in prison in May 2014 after being found guilty of eight counts of indecent assault on four girls and women aged between 15 and 19. Clifford died in December 2017, after suffering a heart attack in prison.", "link_mentions": [{"page": "April 6", "response": ["*1943 – Max Clifford, English journalist and publicist (d. 2017)"]}, {"page": "December 10", "response": ["*  2017   – Max Clifford, British publicist (b. 1943)"]}, {"page": "Neil Hamilton (politician)", "response": ["In June 2003, the woman who had fabricated the accusation of rape, Nadine Milroy-Sloan, was sentenced to three years in jail for perverting the course of justice.-  In February 2005, the publicist Max Clifford, who had acted for Milroy-Sloan, settled, paying Hamilton an undisclosed sum."]}, {"page": "Louis Theroux", "response": ["In When Louis Met Max Clifford, Max Clifford tried to set up Theroux, but he was caught lying as the crew recorded his live microphone during the conversations."]}, {"page": "1943 in literature", "response": ["*April 6 – Max Clifford, English publicist"]}, {"page": "Jade Goody", "response": ["Goody was evicted from the Big Brother house on 19 January 2007, receiving 82 per cent of the vote when she was up against Shetty. Channel 4 prevented crowds from gathering outside the house, and cancelled her scheduled press conference. In an interview with Davina McCall shortly afterwards, Goody said she was \"disgusted with [her]self\" after seeing a video of the alleged bullying.Celebrity Big Brother Live, 19 January 2007 on Channel 4 Her much-publicised return to the Big Brother house was called \"a terrible decision\" by publicist Max Clifford: \"It looks like she has ruined a very lucrative career\". At this time Goody was a supporter of the anti-bullying charity Act Against Bullying, which dropped her. In an interview with the Daily Star, Goody said that her abuse of Shetty ruined her girl-next-door image.", "On 4 February 2009, Goody's publicist, Max Clifford, confirmed that her cancer had spread to her liver, bowel and groin. A previous 40 per cent chance of survival was withdrawn, and she began treatment to prolong her life. On 7 February, Clifford reported that Goody had emergency surgery in London to remove a tumour on her bowel."]}, {"page": "Simon Cowell", "response": ["In 2001, Cowell was given the role of judge on the first series of Pop Idol, a show that he and the show creator Simon Fuller successfully pitched to ITV Controller of Entertainment Claudia Rosencrantz. Maggie Brown in The Guardian states, \"the show became a seminal reality/entertainment format once on air that autumn\". Cowell's S Records signed the top two finishers of the first season of Pop Idol, Will Young and Gareth Gates, both of whom went on to have No 1 UK hits, and they were the top 2 best-selling singles of 2002 and the decade of 2000s. He also became a judge on the first season of American Idol in 2002. With his notoriously critical reputation, Cowell has been likened to TV personalities such as Judge Judy and The Weakest Link host Anne Robinson. His closest predecessor was British TV critic Nina Myskow who, in the 1980s, became known for her harsh put-downs in New Faces, a talent show that Cowell cited as an influence. Cowell's prominence grew, fed by his signature phrase, \"I don't mean to be rude, but ...\", inevitably followed by an unsparingly blunt appraisal of the contestant's talents, personality, or even physical appearance. A lot of these one-liners were the product of coaching that Cowell received from publicist Max Clifford. Cowell also appeared on the one-off World Idol programme in 2003, in which it became clear that each country's version of the Idol had attempted to come up with its own \"Simon Cowell\" type personality."]}, {"page": "David Mellor", "response": ["Retaliation from the media for his \"last chance saloon\" comment came in July 1992, when Mellor's former mistress, actress Antonia de Sancha, sold her “kiss and tell” story of Mellor's extra-marital affair with her for £35,000. Their telephone conversations had been secretly recorded by de Sancha's landlord, an activity which at the time was legal in England. The Sun, relying on material supplied by the publicist Max Clifford, made a number of untrue claims about the relationship, that de Sancha later admitted. This was subsequently confirmed by David Mellor in 2011 at the Leveson Inquiry into Press Behaviour."]}, {"page": "HM Prison Wandsworth", "response": ["* Max Clifford, former publicist, convicted of 8 counts of indecent assault, later moved to HM Prison Littlehey in June 2014."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Eddie Izzard and Max Clifford", "|Max Clifford"]}, {"page": "Kelvin MacKenzie", "response": ["MacKenzie was responsible for the \"Freddie Starr Ate My Hamster\" front-page headline. The claims made in the accompanying article, that the comedian Freddie Starr had placed his girlfriend's hamster on a sandwich and proceeded to eat it, turned out to be entirely untrue and an invention of the publicist Max Clifford. The headline is often held up as the prime example of The Sun's supposedly celebrity-obsessed, sensationalist and often inaccurate journalism."]}, {"page": "Kerry Katona", "response": ["Formerly represented by publicist Max Clifford, with whom she parted by mutual agreement in October 2008, Katona has had endorsement deals with Iceland and Asda supermarkets. On 17 August 2009, Iceland released Katona from her £290,000 contract. The company stated that it was \"impossible\" to continue featuring Katona in its advertising campaigns after photographs appeared in the News of the World tabloid, allegedly showing her taking cocaine in the bathroom of her home.", "On 15 July 2007, Katona, Croft, and their young daughter Heidi were held hostage at their £1.5 million home in Wilmslow, Cheshire. They reported that three men forcibly entered their home, one of them holding Katona at knife-point while the others forced Croft to show them where valuables were kept.Katona held captive by armed gang. BBC News. Retrieved 16 July 2007. Nobody was physically harmed, but the men left with a blue BMW and other valuables with an estimated total value between £100,000 and £150,000. On 19 July 2007, police found the undamaged car  away on Reeves Road in Chorlton-cum-Hardy, Manchester. That same day, Katona was admitted to the Priory Hospital suffering from bipolar disorder. Her publicist, Max Clifford, claimed she had suffered from the disorder for some time, but the trauma had aggravated her symptoms."]}, {"page": "Stuart Hall (presenter)", "response": ["In a later ruling on the case of Max Clifford, the appeal court compared Clifford's case with Hall's; Clifford had claimed innocence, but did not directly impugn his victims. In contrast Hall had publicly denounced his victims and accused one of seeking “instant notoriety”. A lawyer commented on the Clifford ruling: \"Nothing Clifford did resembled the disastrous approach taken by Stuart Hall who, prior to pleading guilty to abusing them as girls, denounced his accusers as gold-diggers and liars.\" Clifford's actions were deemed merely to show no remorse, and not to justify an increased penalty on appeal, although ruling out a reduction in sentence due to mitigating factors; in contrast Hall's sentence was actually increased on appeal."]}, {"page": "Piers Morgan", "response": ["In January 1994, he became editor of the News of the World after being appointed to the job by Rupert Murdoch. Initially an acting editor, he was confirmed in the summer, becoming at 29 the youngest national newspaper editor in more than half a century. In this period, the newspaper led with a series of scoops for which Morgan credited a highly efficient newsdesk and publicist Max Clifford."]}, {"page": "Andrew Neil", "response": ["His regular interview series for Channel 4, Is This Your Life? (made by Open Media), was nominated for a BAFTA award for \"Best Talk Show\".Open Media , accessed 24 April 2009 In the course of the series Neil interviewed a wide variety of personalities, from Albert Reynolds and Morris Cerullo to Jimmy Savile and Max Clifford.A.A.Gill, The Sunday Times, 6 August 1995 He acted as a television newsreader in two films: Dirty Weekend (1993) and Parting Shots (1999), both directed by Michael Winner."]}, {"page": "Jonathan King", "response": ["The National Criminal Intelligence Service had begun investigating King for child sexual abuse in 2000, when a man told them he had been assaulted by King and others 30 years earlier.Hall, Sarah (22 November 2001). \"Victim's angry email led to downfall\". The Guardian. London. The man had originally approached publicist Max Clifford, himself later jailed in 2014 for sexual assault; Clifford told him that he should go to the police.Norman, Matthew (4 May 2014). \"Max Clifford played a crucial role in the conviction of Jonathan King. Now the roles have been reversed\", The Independent. London. King was arrested in November that year and bailed on £150,000, £50,000 of which was put up by Simon Cowell.Walker, Tim (27 November 2011). \"Jonathan King: 'My book's an online hit, millions click on my videos. How about lifting the media ban on me?'\", The Independent. He was arrested again in January 2001 on further allegations.\"Second arrest for Jonathan King\", The Guardian, 24 January 2001.\"King faces fresh charges\". BBC News. 25 January 2001. 27 men told police that King had sexually assaulted them during the period 1969–1989. Police found pictures of teenagers in a search of King's home. King admitted having approached thousands of people with questionnaires about youth interests, doing market research. The questionnaires asked recipients to list topics according to importance including music, sport, friends and family; the prosecution claimed that boys who listed sex high in their list of priorities were then targeted by King.\"King's path to shame\". BBC News. 21 November 2001."]}, {"page": "Antonia de Sancha", "response": ["Believing her acting career was ruined and aware that newspapers were making money out of the story and she was not, de Sancha hired publicist Max Clifford to sell her story to various newspapers. She made about £30,000 from those sales."]}, {"page": "Gerry Ryan", "response": ["Ryan's style was considered by some to be that of a motor-mouth shock jock. The Gerry Ryan Show was subject to several upheld complaints to the Broadcasting Commission of Ireland (BCI), although once escaped punishment when he said \"Would it be considered blasphemous if someone said on air that 'God is a bollocks?'\". Ryan was noted for the enjoyment he took in discussing topics such as sex, bodily functions, and food – as well as current social and political issues. Disgraced former PR guru Max Clifford claimed, after Ryan's death, he could have, like Graham Norton and Terry Wogan, had a successful broadcasting career in the UK and said he was similar to \"Michael Parkinson at his best\"."]}, {"page": "Raynes Park", "response": ["* Max Clifford, former publicist"]}, {"page": "Grand Theft Auto", "response": ["The game was controversial from the first incarnation of the series. Grand Theft Auto was condemned in Britain, Germany, and France due to its \"extreme violence\", and Brazil banned it outright. Publicist Max Clifford planted sensational stories in tabloids in order to help sell the first game."]}, {"page": "Faria Alam", "response": ["On leaving her job with the FA, Alam hired publicity agent Max Clifford.  After negotiations, Clifford and Alam posed for photographs outside Clifford's New Bond Street offices surrounded by a scrum of photographers. Clifford brokered a number of deals for Alam, who was reportedly paid £400,000 for publication of kiss-and-tell stories about Palios, and Eriksson in The Mail on Sunday and The News of the World.  Alam was paid a further £150,000 for a television interview."]}, {"page": "Tubridy Tonight", "response": ["International guests in season four included: Christian Slater, Jennie Bond, David Gest, Sophie Dahl, Myleene Klass, Janice Dickinson, Barbara Windsor, Frank Vincent, Dominic Purcell, Kathleen Turner, Martin Freeman, Carol Vorderman, Patsy Palmer, Max Clifford, Geri Halliwell, Joe Elliott and Morgan Spurlock.", "| 3 May 2008 || Boyzone, Max Clifford, Mairead Farrell || || || || Details "]}, {"page": "Rachel Hurd-Wood", "response": ["Hurd-Wood along with other celebrity supporters of the charity Shooting Star CHASE, Keeley Hawes, Matthew MacFadyen and Max Clifford joined more than 50 children with life-limiting illnesses and their families for the event on Sunday, 20 December 2009. The charity worked with Coca-Cola and the Merlin Group, which runs Alton Towers, Chessington World of Adventures and the London Eye, to transform Christopher’s (CHASE) Hospice in Guildford, Surrey into a winter wonderland and gave the children at hospice a wonderful Christmas surprise."]}, {"page": "Pamella Bordes", "response": ["In the late 1980s Singh worked in a brothel which had provided one of British publicist Max Clifford's clients with various services. Clifford asked the madam to reveal details of her girls and clients, and found that one prostitute, Pamella Bordes, was simultaneously dating Andrew Neil (then editor of The Sunday Times), Donald Trelford (then editor of The Observer), Conservative minister for sport Colin Moynihan, and billionaire arms dealer Adnan Khashoggi.Summerskill, Bill (28 July 2002). \"Paper tiger\" The Observer (London) retrieved 14 November 2006.Roy, Amit (9 October 2005). \"A trip down memory lane\"  The Telegraph (Calcutta) retrieved 14 November 2006. Clifford rang News of the World editor Patsy Chapman and drip-fed her the story of Bordes through the investigative reporter she was using on the madam. The story was published in March 1989 under the headline \"Call Girl Works in Commons\", since it was discovered she had a House of Commons security pass arranged by MPs David Shaw and Henry Bellingham.", "Clifford claimed Bordes was never his client, and that he earned his fee for \"writing\" the story, which ultimately served the purpose of saving the madam from any adverse publicity or court case.Max Clifford and Angela Levin Max Clifford: Read All About it! Virgin Books, 2005,()"]}, {"page": "TK Maxx", "response": ["The decision was met with condemnation from publicist Max Clifford, who launched a campaign in conjunction with Look to persuade the Crown Estate to allow the store to open in the unit. A court appeal by TK Maxx against the decision failed; Dutch retailer The Sting took the building as their first store in the United Kingdom."]}, {"page": "Freddie Starr", "response": ["The man behind the hamster story was the British publicist, Max Clifford, at that time Starr's agent, who concocted the story as a practical joke. When asked in a television interview with Esther Rantzen some years later whether Starr really had eaten a hamster, his reply was \"Of course not\". Clifford was unapologetic, insisting that the story had given a huge boost to Starr's career. "]}, {"page": "Back to Basics (campaign)", "response": ["* On 24 September 1992, David Mellor resigned as National Heritage Secretary. Mellor had been the subject of intense press attention regarding his extra-marital affair with actress Antonia de Sancha. The Sun, relying on material supplied by publicist Max Clifford, made a number of lurid claims about their lovemaking - eg. that Mellor had sucked her toes and had worn a Chelsea football shirt - that de Sancha later admitted in a newspaper interview were entirely untrue. Mellor remained in office for two months after the story broke, but was forced to resign when it was revealed that he had accepted a free holiday from the daughter of the PLO's finance director.Stephen Ward \"Mellor family guests of PLO man's daughter\" , The Independent, 15 September 1992 Although Mellor's resignation antedated John Major's \"Back to Basics\" speech by more than a year, the media were quick to link the new campaign to the scandal. There was some speculation that the press were taking revenge over Mellor's support for the creation of a Press Complaints Commission, to rein in what he saw as excessive press snooping in people's private lives."]}, {"page": "Howard Donald", "response": ["In April 2010, Donald was granted a super-injunction against former girlfriend, musician Adakini Ntuli, with whom he had been in an on/off relationship from 2000 to 2008. (See Ntuli v Donald) After Ntuli engaged publicist Max Clifford and began negotiations with the News of the World, Donald obtained the super-injunction. The non-publicity side of the injunction was lifted in November 2010."]}, {"page": "Simon Jordan", "response": ["As of the 2005–06 season, Jordan wrote a fortnightly column for The Observer newspaper. A column in which he said football agents should be neutered led to him being charged by the Football Association with bringing the game into disrepute. The case was heard on 7 December 2005 with a charge of improper conduct proven. Jordan was given a suspended fine of £10,000.  But, backed by other journalists and by media advisor Max Clifford, Jordan indicated his intention to appeal, stating \"I didn't start this fight, but it's not something I'm going to walk away from.\". His appeal was heard on 10 April, and was rejected by the three-member panel, two votes to one.  Jordan commented in his 16 March column in The Observer that he and his advisors were \"now considering taking this through the courts. Any legal action I take won't be about wasting time or resources on a petty point of principle – it'd be an attempt to see the whole thing unravel.\""]}, {"page": "Peter Harding (RAF officer, born 1933)", "response": ["Promoted to Marshal of the Royal Air Force on 6 November 1992, Harding became Chief of Defence Staff on 31 December 1992 but he resigned in March 1994 after it was revealed by Max Clifford and the News of the World that, aged 58, he had had an affair with the 32-year-old Bienvenida Pérez, the Spanish wife of Conservative MP Antony Buck. In addition to security concerns, and although Harding was a serving officer rather than a politician, the story was embarrassing to the government as it coincided with a string of \"Back to Basics\" scandals. Unlike other Marshals of the Royal Air Force who only relinquished their appointments, Harding resigned his commission on 14 June 1994 and consequently ceased to be listed in the Air Force List;The Air Force List, 2006. HMSO;  however, he was subsequently returned to the list."]}, {"page": "Cheryl Barrymore", "response": ["A trained dancer, Barrymore took work in the publicity department of EMI records between shows, where she met young PR man and lifelong friend Max Clifford. After her first marriage to Greg Smith failed, Barrymore took part in several West End theatre shows, during one of which she met entertainer Michael Barrymore in 1974.My kind of autobiography, Scotsman.com; accessed 6 September 2015. They married two years later."]}, {"page": "Steve McClaren", "response": ["After Eriksson announced in January 2006 that he would leave as England manager after the 2006 World Cup finals, McClaren was placed on The FA's shortlist to succeed him, alongside Sam Allardyce, Alan Curbishley, Martin O'Neill and Luiz Felipe Scolari. The FA first offered the position to Scolari, but he rejected the offer, claiming that the role would mean excessive media intrusion in his life. McClaren, however, was subsequently announced as Eriksson's successor on 4 May 2006 after signing a four-year contract. The nature of his appointment earned him the nickname \"Second Choice Steve\". The appointment was praised by the likes of Alex Ferguson and Trevor Brooking. McClaren assumed control of the national team on 1 August 2006. McClaren chose popular former England coach Terry Venables as his assistant, a move seen by some as an attempt to counter the lack of enthusiasm for McClaren. He also hired public relations guru Max Clifford to manage his relationship with the media."]}, {"page": "Ryan Confidential", "response": ["|Max Clifford"]}, {"page": "List of people with epilepsy", "response": ["| Max Clifford"]}, {"page": "Clare Tomlinson", "response": ["Tomlinson started her career in public relations, including a period as the receptionist for Max Clifford & Associates. In the early 1990s, Tomlinson worked at the Football Association as a media officer. Later in the decade, she was appointed as the head of the communications department at Arsenal Football Club, where she helped the then new manager Arsène Wenger deal with the media.Football365.com - F365 Features - Football365 News "]}, {"page": "Starsuckers", "response": ["==Legal threats from Max Clifford==", "On 23 October 2009, six days before the Starsuckers premiere, the makers reported that they had received an e-mail from the law firm Carter-Ruck, acting on behalf of controversial publicist Max Clifford and threatening them with an injunction."]}, {"page": "South London Press", "response": ["The novelist and critic Martyn Bedford used to work in the Lewisham office of the paper, while Brian Alexander, the former sports editor of The Sun and Mail on Sunday, was sports editor until 1986. Paul McCarthy, sports editor of the News of the World, John Pienaar, political correspondent and reporter on BBC Radio 5 Live, and David Bond, who was appointed as the BBC's Sports Editor in 2010, worked at the SLP in the 1980s and 1990s. Others who went on to Fleet Street include Ken Reynolds, Steve Grimes, George Binyon, Willie Robertson, John Twomey, Ian Malin, Debbie Andalo, Brian Stater, Ev Bramble, Carolyn Jones, Anna Pukas, JJ Young, Jonathan Buckmaster, Chris Ward, Stewart Morris, Claire Aaron, Anton La Guardia, Brian McConnell, Peter Burden, Ron Ricketts, Geoff Manners,  John Rodda and Colin Wood. Publicist Max Clifford was also an employee."]}, {"page": "1943 in the United Kingdom", "response": ["* 6 April – Max Clifford, publicist (died 2017)"]}]}}