{"wiki_id": "http://www.wikidata.org/entity/Q6791275", "itemLabel": "Matthew Stirling", "itemDescription": "(1856–1931) British locomotive engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Stirling_(railway_engineer)", "wikipedia_page": {"main": "Matthew Stirling (1856–1931) was Locomotive Superintendent of the Hull & Barnsley Railway (H&BR).  Matthew Stirling was born in Kilmarnock on 27 November 1856. He was the son of Patrick Stirling, the nephew of James Stirling, and grandson of Robert Stirling - all of whom were also famous mechanical engineers.\n\n", "link_mentions": [{"page": "List of Scots", "response": ["* Matthew Stirling (1856–1931), Locomotive Superintendent of the Hull and Barnsley Railway "]}, {"page": "Hull and Barnsley Railway", "response": ["The H&BR never manufactured any of its own locomotives, all being built elsewhere. The first types in use were of the design W. Kirtley (Locomotive Superintendent of the London, Chatham and Dover Railway) who was acting as a consultant. Matthew Stirling (son of Patrick Stirling of 'Stirling Single' fame) was the first and only Locomotive superintendent of the H&BR during its independence, and who undertook the rebuilding of some of Mr. Kirtley's designs, as well as contracting the construction of his own designs to various builders. His locomotives were typically domeless, and many of the original Kirtley engines were also rebuilt without domes.", "Kirtley's locomotives were painted black with grey lining. Matthew Stirling subtly modified the livery – using invisible green (black except in bright sunlight) produced from a 50:50 mixture of 'drop black' and 'brunswick green'. Lining was of broad stripes of blue (ultramarine) with red (vermilion) edges. The 2-4-0 and 0-6-0 tender locomotives procured by Kitley carried a small cursive monogram of the letters \"HB&WRJR\", other locomotives carried the initials \"H&BR\".", "The Railways Act 1921 ended the company's independence; from 1 April 1922 the Hull and Barnsley Railway became part of the NER. The locomotive works at Springhead was downgraded – the extent of locomotive maintenance was reduced and the carriage works closed, skilled workers and machinery were relocated to Darlington. At this time 43 old engines were decommissioned. Edward Watkin (General Manager) and Matthew Stirling also departed. Due to duplication a number of stations were renamed."]}, {"page": "Locomotives of the London and North Eastern Railway", "response": ["From its formal establishment in 1885 to the time that it was taken over by the North Eastern Railway (NER) in 1922, the CME of the H&BR was Matthew Stirling, who, like his father and uncle, built locomotives with domeless boilers."]}, {"page": "Matthew Stirling", "response": ["thumb|right|Marion and Matthew Stirling in Veracruz, Mexico, April 15, 1939", "In 1931, he met Marion Illig (1911–2001), who took a job as his secretary. They married on December 11, 1933 and worked together for the next forty-two years, until his death.  She accompanied him on all but one of his subsequent archaeological expeditions. They had a son and a daughter. Matthew Stirling wrote that Marion was his \"co-explorer, co-author and general co-ordinator.\""]}, {"page": "Matthew Stirling (Railway Engineer)", "response": ["#REDIRECT Matthew Stirling (railway engineer) "]}, {"page": "H&BR Class A", "response": ["The H&BR Class A (later LNER Class Q10) was an 0-8-0 heavy freight engine designed by Matthew Stirling and built by the Yorkshire Engine Company of Sheffield.  They were the largest of the engines on the Hull and Barnsley Railway.  The Class A was developed to deal with the steeply graded eastern section of the H&BR between Springhead and Sandholme.  Because of this the special link workings they dealt with were nicknamed the \"Sandholme Bankers\"."]}, {"page": "H&BR Class F3", "response": ["The H&BR Class F3 (LNER Class N13) was a class of 0-6-2T steam locomotives of the Hull and Barnsley Railway.  They were designed by Matthew Stirling to work goods trains to and from the King George Dock at Hull which opened in 1914.  They were not fitted with vacuum brakes so they were not suitable for passenger work."]}, {"page": "H&BR Class F2", "response": ["The H&BR Class F2 (LNER Class N12) was a class of 0-6-2T steam locomotives of the Hull and Barnsley Railway. It was designed by Matthew Stirling and nine locomotives were built by Kitson & Co. in 1901."]}, {"page": "Stirling (surname)", "response": ["*Matthew Stirling (railway engineer) (1856–1931), Locomotive Superintendent of the Hull and Barnsley Railway", "*Matthew Stirling (1896–1975), American ethnologist and archaeologist"]}, {"page": "1856 in Scotland", "response": ["* 27 November – Matthew Stirling, locomotive engineer (died 1931 in Hull)"]}, {"page": "Locomotives of the Hull and Barnsley Railway", "response": ["Locomotives of the Hull and Barnsley Railway.  The Hull and Barnsley Railway never manufactured any of its own locomotives, all being built elsewhere. The first types in use were of the design W. Kirtley (Locomotive Superintendent of the London, Chatham and Dover Railway) who was acting as a consultant. Matthew Stirling (son of Patrick Stirling of 'Stirling Single' fame) was the first and only Locomotive Superintendent of the H&BR during its independence, and he undertook the rebuilding of some of Mr. Kirtley's designs, as well as contracting the construction of his own designs to various builders. His locomotives were typically domeless, and many of the original Kirtley engines were also rebuilt without domes.", "Kirtley's locomotives were painted black with grey lining. Matthew Stirling subtly modified the livery – using invisible green (black except in bright sunlight) produced from a 50:50 mixture of 'drop black' and 'brunswick green'. Lining was of broad stripes of blue (ultramarine) with red (vermilion) edges. The 2-4-0 and 0-6-0 tender locomotives procured by Kitley carried a small cursive monogram of the letters \"HB&WRJR\", other locomotives carried the initials \"H&BR\"."]}]}}