{"wiki_id": "http://www.wikidata.org/entity/Q6793253", "itemLabel": "Maurice Kay", "itemDescription": "British lawyer (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Kay", "wikipedia_page": {"main": "Sir Maurice Ralph Kay  PC (born 6 December 1942) is a retired member of the Court of Appeal of England and Wales.\nKay was educated at William Hulme's Grammar School in Manchester and the University of Sheffield\nKay was called to the Bar in 1975 (Gray's Inn) and was elected a bencher in 1995. He became a Queen's Counsel and was appointed a Recorder in 1988. He was appointed to the High Court on 17 January 1995, receiving the customary knighthood. He was assigned to the Queen's Bench Division, serving on the Employment Appeal Tribunal from June 1995. He was Presiding Judge of the Chester Circuit from 1996 to 1999, and was appointed Judge in Charge of the Administrative Court in 2002. On 14 January 2004, Kay became a Lord Justice of Appeal, and was appointed to the Privy Council on 11 February of that year. He served as President of the Judicial Studies Board from July 2007 to July 2010, and began a three-year term as Vice-President of the Court of Appeal (Civil Division) on 6 May 2010.Kay is an honorary fellow of Robinson College, Cambridge.", "link_mentions": [{"page": "University of Sheffield", "response": ["Sheffield has educated a number of judges and lawyers. The university has the highest number of alumni appointed to the bench of the Court of Appeal after Oxford and Cambridge. In November 2013, the court had a bench consisting of judges all graduated at Sheffield; the sitting judges were Lord and Lady Justices of Appeal Maurice Kay, Anne Rafferty and Julia Macur. The Sheffield School of Law has also produced lawyers around the world. This includes Deputy Minister of Justice of Afghanistan Mohammad Qasim Hashimzai, Chief Justice of Bangladesh Md. Muzammel Hossain, Supreme Court Justice of Sierra Leone Henry M. Joko-Smart, and Chief Justice of Malaysia Arifin Zakaria."]}, {"page": "List of current members of the British Privy Council", "response": ["| Sir Maurice Kay"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Sir Maurice Kay (b. 1942)"]}, {"page": "Lord Justice Kay", "response": ["*Maurice Kay (born 1942)"]}, {"page": "Threshold issues in Singapore administrative law", "response": ["The legal implications of GCHQ were that many areas once considered unreviewable were now potentially open to judicial scrutiny by the United Kingdom courts, except for a list of prerogatives that Lord Roskill provided as being non-reviewable \"because their nature and subject matter are such as not to be amenable to the judicial process\". These included prerogative powers of treaty-making, the defence of the realm, the prerogative of mercy, the granting of honours, the dissolution of parliament, and the appointment of ministers.GCHQ, p. 418. Subsequent case law shows that this list has largely been accepted, and there is indication that the judges have continued to move with a degree of circumspection, and sometimes even in reaction against such developments.Leyland & Anthony, \"Express and Implied Limits on Judicial Review\", pp. 419–420. However, in Campaign for Nuclear Disarmament v. Prime Minister (2002),. Justice Maurice Kay accepted that the ambit of the \"forbidden areas\" identified by Lord Roskill is not immutable, and had been reduced in some cases.Campaign for Nuclear Disarmament, para. 50."]}, {"page": "Martin Moore-Bick", "response": ["Moore-Bick served as Deputy Head of Civil Justice from 1 January 2007 to 31 December 2012. Lord Justice Richards took over this role from 1 January 2013 for an initial three-year period. From 1 October 2014 until his retirement, Moore-Bick was Vice President of the Civil Division of the Court of Appeal. He took over the role on the retirement of Lord Justice Maurice Kay."]}, {"page": "Vice-President of the Civil Division", "response": ["*6 May 2010: Sir Maurice Kay"]}, {"page": "List of University of Sheffield people", "response": ["* Sir Maurice Kay Lord Justice of Appeal", "In November 2013, for the first time in history, the Court of Appeal had an all-Sheffield alumni bench. The judges sitting were Lord Justice Maurice Kay (LLB Law, 1964; PhD Law, 1971 and Hon LLD, 2003), Lady Justice Anne Rafferty (LLB Law, 1971 and Hon LLD, 2005) and Lady Justice Julia Macur (LLB Law, 1978)."]}, {"page": "DPP v Santana-Bermudez", "response": ["The DPP's appeal was heard by Mr Justice Maurice Kay and Mr Justice Mackay, sitting as the Divisional Court of the Queen's Bench Division.  The DPP was represented by Rachel Lawrence (daughter of former MP Sir Ivan Lawrence), instructed by the Crown Prosecution Service (CPS); she was the same prosecution barrister as had appeared in the Crown Court.  The CPS indicated that they would not seek for the case to be remitted to the Crown Court for a retrial; having already been acquitted, the defendant did not appear and was not represented in the High Court.", "Mr Justice Maurice Kay, giving the only reasoned judgment, commented that \"A great deal of undesirable complexity has bedevilled our criminal law as a result of quasi theological distinctions between acts and omissions\".  He held that, as the defendant had recklessly given a false statement to PC Hill that put her in a dangerous situation with a foreseeable risk of harm through the omission, the Crown Court was incorrect to allow the motion to dismiss and allowed the appeal.  Mr Justice Mackay agreed with the ratio decidendi."]}]}}