{"wiki_id": "http://www.wikidata.org/entity/Q6792261", "itemLabel": "Maud Sulter", "itemDescription": "British artist, poet, short-story writer (1960-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maud_Sulter", "wikipedia_page": {"main": "Maud Sulter (19 September 1960 – 27 February 2008) was a Scottish contemporary fine artist, photographer, writer, educator, feminist, cultural historian, and curator of Ghanaian heritage. She first worked as a writer and poet, later turning to the visual arts. Sulter was known for her collaborations with other Black feminist scholars and activists, capturing the lives of Black people in Europe. She was a champion of the forgotten African-American sculptor Edmonia Lewis.\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*Maud Sulter (1960–2008, S)"]}, {"page": "Jeanne Duval", "response": ["Scottish artist Maud Sulter created several artworks inspired by Duval, using images such as her photograph by Nadar, and self-portraits of the artist. Many of these were displayed in a solo show at the Scottish National Portrait Gallery titled Jeanne Duval: A Melodrama."]}, {"page": "Ingrid Pollard", "response": ["* Passion, edited by Maud Sulter. Urban Fox, 1990. With a chapter of images by Pollard."]}, {"page": "Scottish art", "response": ["In the late twentieth century, photography in Scotland enjoyed a renaissance, encouraged by figures including Richard Hough (1945–85) who founded the Stills Gallery for photography in Edinburgh in 1977 and Murray Johnston (1949–90), who was its director (1982–86).C. Henry, \"Scots photography loses a champion\", Glasgow Herald, 6 January 1990. Retrieved 9 February 2013. Important practitioners in Scotland included the American Thomas Joshua Cooper (born 1946) who founded the Fine Art Photography department in 1982 at The Glasgow School of Art. More recent exponents who have received acclaim include Pradip Malde (born 1957), Maud Sulter (1960–2008) and Owen Logan (born 1963)."]}, {"page": "BLK Art Group", "response": ["*  Maud Sulter (1960 – 2008) - contemporary"]}, {"page": "List of 20th-century women artists", "response": ["*Maud Sulter (1960–2008), portraiture, montage"]}, {"page": "Art in modern Scotland", "response": ["In the late twentieth century, photography in Scotland enjoyed a renaissance, encouraged by figures including Richard Hough (1945–85) who founded the Stills Gallery for photography in Edinburgh in 1977 and Murray Johnston (1949–90), who was its director (1982–86).C. Henry, \"Scots photography loses a champion\", Glasgow Herald, 6 January 1990, retrieved 9 February 2013. Notable practitioners in Scotland included the American Thomas Joshua Cooper (b. 1946). More recent exponents who have received acclaim include Pradip Malde (b. 1957), Maud Sulter (1960–2008) and Owen Logan (b. 1963)."]}, {"page": "List of Scottish poets", "response": ["*Maud Sulter"]}, {"page": "Chila Kumari Burman", "response": ["*1990: \"Talking in Tongues\", in Maud Sulter (ed.), Passion: Discourses on Black Women's Creativity (Hebden Bridge: Urban Fox Press)"]}, {"page": "Lauretta Ngcobo", "response": ["In addition Ngcobo was the editor of Let It be Told: Essays by Black Women Writers in Britain (Pluto Press, 1987), which included contributions from Amryl Johnson, Maud Sulter, Agnes Sam, Valerie Bloom, Grace Nichols, Marsha Prescod, Beverley Bryan, Stella Dadzie and Suzanne Scafe.\"Let It Be Told: Essays by Black Women in Britain\", Goodreads. Ngcobo also wrote a children's book, Fikile Learns to Like Other People (1994), and in 2012 edited an anthology of stories of South African women in exile, entitled Prodigal Daughters, which was chosen as a Book of the Year by Neelika Jayawardane of Africa is a Country.Tom Devriendt, \"Our Favorite Books of 2012\", Africa is a Country, 31 December 2012."]}, {"page": "Scottish photography", "response": ["In the early twentieth century, notable photographic work in Scotland included that of visiting artists, such as Alvin Langdon Coburn and Paul Strand. There was also the record of the Gorbals in Glasgow made by Bert Hardy, Joseph McKenzie and Oscar Marzaroli. Having pioneered photography in the late nineteenth century, the artistic attainment of native photographers was not high in the early twentieth century. In the late twentieth century, photography in Scotland enjoyed a renaissance, encouraged by figures including Richard Hough and Murray Johnston. More recent exponents who have received acclaim include Pradip Malde, Maud Sulter and Owen Logan.", "In the late twentieth century, photography in Scotland enjoyed a renaissance, encouraged by figures including Richard Hough (1945–85), who founded the Stills Gallery for photography in Edinburgh in 1977, and Murray Johnston (1949–90), who was its director (1982–86).C. Henry, \"Scots photography loses a champion\", Glasgow Herald, 6 January 1990, retrieved 9 February 2013. The 1986 Constructed Narratives exhibition at the Stills Gallery signalled the renaissance, showcasing the work of Calum Colvin (b. 1961) and Ron O'Donnell (b. 1952), both of whom produced intensely coloured and constructed photographic works.T. Normand, Scottish Photography: a History (Edinburgh: Luath Press, 2007), , p. 141. Important practitioners in Scotland included the American Thomas Joshua Cooper (b. 1946).D. Burn, \"Photography\", in M. Lynch, ed., Oxford Companion to Scottish History (Oxford: Oxford University Press, 2011), , pp. 476–7. More recent exponents who have received acclaim include Pradip Malde (b. 1957), Maud Sulter (1960–2008) and Owen Logan (b. 1963). The range of contemporary talent was showcased by the 1995 Light in the Dark Room exhibition."]}, {"page": "Daughters of Africa", "response": ["* Maud Sulter"]}, {"page": "List of Scottish women artists", "response": ["*Maud Sulter (1960–2008), photographer, writer"]}, {"page": "List of British women photographers", "response": ["* Maud Sulter (1960–2008), fine artist, photographer, writer and curator"]}, {"page": "Vera Bell", "response": ["The Vera Bell Prize for Poetry, part of the Young Black Writers Awards, was won in 1985 by Maud Sulter for her work As a Blackwoman."]}, {"page": "List of Black British artists", "response": ["* Maud Sulter (1960–2008)"]}, {"page": "List of black British writers", "response": ["* Maud Sulter (1960–2008)"]}, {"page": "Brenda Agard", "response": ["* Testimony: Three Blackwomen Photographers: Brenda Agard, Ingrid Pollard, Maud Sulter at Camerawork London and The Pavilion Leeds; curated by Maud Sulter, and nominated for the Sun Life/Fox Talbot Photography Award.", "In contrast to several of her close contemporaries, such as Maud Sulter and Donald Rodney, who have been recognized by museums and gallery retrospectives, Agard \"remains tragically consigned to obscurity despite having created a cutting-edge body of work\", according to art historian Celeste-Marie Bernier."]}, {"page": "Andrea Fatona", "response": ["Curator in collaboration with Deanna Bowen, Reading the Image: Poetics of the Black Diaspora, group, national touring exhibition \"Deanna Bowen, Maud Sulter, Christopher Cozier and Michael Fernandes - that explores issues pertaining to diasporic movement and the relationship of African peoples to the project of modernity. Thames Art Gallery, Chatham, Ont. (originating gallery); Robert McLaughlin Gallery, Oshawa, Ontario; Mount Saint Vincent University Art Gallery, Halifax, Nova Scotia; Yukon Art Centre, Whitehorse, Yukon Territory, 2006."]}, {"page": "Black Scottish identity", "response": ["In scholarly publications with a focus on literary works, the writings of Maud Sulter, and Jackie Kay in particular, have produced study into the subject in Scotland. Kay's work and commentary is preeminent in the portrayal of black Scottishness and identity. Academics, such as professor Alan Rice, have analyzed how the writer's 1998 novel Trumpet harnessed African-American music and traditions in order to explore black Scottish identity."]}, {"page": "List of black photographers", "response": ["*Maud Sulter"]}, {"page": "Nina Edge", "response": ["* 'Along the Lines of Resistance', Cooper Gallery, Barnsley, 1988. With Simone Alexander, Sonia Boyce, Chila Kumari Burman, Leslie Hakim-Dowek, Lubaina Himid & Maud Sulter, Lesley Sanderson, Marlene Smith, and Mona Hatoum.", "* 'Your Name is Mud', in Maud Sulter, ed., Passion: Discourses on Blackwomen's Creativity. Hebden Bridge: Urban Fox Press, 1990, pp. 154–167."]}, {"page": "Chan-Hyo Bae", "response": ["* Looking in: Photographic Portraits by Maud Sulter and Chan-Hyo Bae, Jewish Museum of Art; UK, 2013", "#Art Daily; Looking in: Photography Portraits by Maud Sulter and Chan-Hyo Bae, July 12, 2013"]}, {"page": "List of women writers (M–Z)", "response": ["*Maud Sulter (1960–2008, Scotland), poet, artist & photographer"]}]}}