{"wiki_id": "http://www.wikidata.org/entity/Q6795588", "itemLabel": "Maxim Jakubowski", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Maxim_Jakubowski", "wikipedia_page": {"main": "Maxim Jakubowski (born 1944) is a crime, erotic, science fiction and rock music writer and critic.\nJakubowski was born in 1944 in England to Russian-British and Polish parents, but raised in France. Jakubowski has also lived in Italy and has travelled extensively. Jakubowski edited the science fiction anthologies Twenty Houses of the Zodiac (1979), for the 37th World Science Fiction Convention (Seacon '79) in Brighton, and Travelling Towards Epsilon, an anthology of French science fiction. He also contributed a short story to that anthology.", "link_mentions": [{"page": "List of authors of erotic works", "response": ["*Maxim Jakubowski, editor of the Mammoth Erotica series and a major erotica writer in his own right"]}, {"page": "SPQR series", "response": ["*\"An Academic Question\" (51 BC): Decius investigates a murder during his visit to Athens mentioned as part of his leisurely trip to Cyprus at the beginning of \"The Princess and the Pirates\"Published in Past Poisons (1998), edited by Maxim Jakubowski, ."]}, {"page": "PS Publishing", "response": ["PS Publishing was founded in 1999 by Peter Crowther.\"The Kings of Horror\". Maxim Jakubowski, The Guardian, 27 October 2006. Retrieved 13 April 2017.  They specialise in novella length fiction (20,000 to 40,000 words) from the fantasy, science fiction and horror genres. It has won what The Guardian calls the \"prestigious\" World Fantasy Award nine times in the categories of Single-Author Collection (for The Very Best of Gene Wolfe, published 2010; Bibliomancy, 2003; and Where Furnaces Burn, 2012), Anthology (Exotic Gothic 4, 2012), Long Fiction (The Unlicensed Magician, 2015), Novel (Illyria, 2007;  Osama, 2011), and in the category \"Special Award, Professional.\""]}, {"page": "Lee Child", "response": ["| The 1999 version is longer. Collected in Fresh Blood 3 (edited by Mike Ripley and Maxim Jakubowski) and in Thriller (US)"]}, {"page": "Diana Gabaldon", "response": ["* Lord John and the Hellfire Club (1998), novella first published in the anthology Past Poisons, edited by Maxim Jakubowski"]}, {"page": "List of BDSM authors", "response": ["* Maxim Jakubowski"]}, {"page": "Edward James (historian)", "response": ["* The Profession of Science Fiction: SF Writers on their Craft and Ideas. Edited by Maxim Jakubowski and James; foreword by Arthur C. Clarke. Insights series. Macmillan UK, 1992. .\"Bibliography: The Profession of Science Fiction\" (1992 book). ISFDB. Retrieved 2015-03-26. New York: St. Martin's Press, 1992. (."]}, {"page": "John Maddox Roberts", "response": ["* \"An Academic Question\" (1998, SPQR series), in the historical mystery anthology Past Poisons: An Ellis Peters Memorial Anthology of Historical Crime, edited by Maxim Jakubowski"]}, {"page": "Anthony Awards", "response": ["*Best Critical work — Maxim Jakubowski, 100 Great Detectives"]}, {"page": "Joy Chant", "response": ["* \"The Coming of the Starborn\", Lands of Never, ed. Maxim Jakubowski (Allen & Unwin, 1983), "]}, {"page": "The Treatment (novel)", "response": ["Peter Guttridge of The Observer described it as \"a bleak, powerful story of child abuse\".Peter Guttridge, \"You've got mail - from your dead wife\", The Observer, 28 July 2001, Retrieved 8 October 2013 Maxim Jakubowski of The Guardian said it was one of the best offerings of the month, and \"Books don't get any harsher about the rotten core of humanity\".Maxim Jakubowski, \"Big in crime\", The Guardian, 6 July 2001, Retrieved 8 October 2013 In 2002 it won the WH Smith Thumping Great Read Award.", "*Maxim Jakubowski, \"Big in crime\", The Guardian, 6 July 2001"]}, {"page": "Solveig Dommartin", "response": ["*Commemorative article by Maxim Jakubowski in The Guardian"]}, {"page": "James Crumley", "response": ["None of the books that Crumley wrote ever became bestsellers, but he had a cult following devoted to his writing and received frequent critical acclaim. David Dempsey in the New York Times called Crumley's debut novel, One to Count Cadence, set during the Vietnam War, \"...a compelling study of the gratuitous violence in men. ... It is a story of bars, brawls, and brothels—and I don't know of any writer who has done it better.\" In 1993, Marilyn Stasio, reviewing The Mexican Tree Duck in the same publication, wrote: \"Characters as memorable as [Crumley's] don't come blazing down the interstate that often. Neither do writers like Mr. Crumley. Treasure them before they burn themselves out—and take the flame with them.\"Stasio, Marilyn \"On the Road to Nowhere\" New York Times (October 31, 1993) Christopher Lehmann-Haupt described Crumley's work as being about \"a violently chaotic world that can be seen as a legacy of Vietnam, of which his characters are nightmare-haunted veterans,\"Lehmann-Haupt, Christopher \"Mystery and Suspense from Three Old Hands\" New York Times (December 20, 1993) while Ron Powers called it: the Big Sky Country [reimagined] as a kind of hard-boiled Lake Wobegon with bloodstains, a hellscape where all the women are tall ... the men sport pugnacious foreheads, brutal jaws and Indian braids, and all the children are away at camp.Powers, Ron \"'The Right Madness': Montana's Evil Side\" New York Times (May 8, 2005) According to Patrick Anderson of The Washington Post, \"You don't read Crumley for plot. You read him for his outlaw attitude, his rough poetry and his scenes, paragraphs, sentences, moments. You read him for the lawyer with 'a smile as innocent as the first martini'\". Critic Maxim Jakubowski, who was a friend of Crumley, writing after Crumley's death, referred to Crumley's last two books, The Final Country and A Right Madness, as:...bittersweet adventures in which [Crumley] could evoke the skies over Texas and Montana and the landscapes of America like a veritable angel slumming amid the ferocious gunfire, the betrayals his characters always suffered and the trademark bruised romanticism that only he could conjure up without it sounding maudlin.Jakubowski, Maxim \"Goodbye to Jim Crumley\" The Guardian Book Blog (September 23, 2008)", "* Maxim Jakubowski remembrance The Guardian"]}, {"page": "Derek Raymond", "response": ["To Cook's delight, the ensuing novel caused Dan Franklin, who had become  publisher at the company which had issued the earlier three Factory novels, to proclaim the book had made him feel sick. As a result of this reader response, Secker & Warburg the publisher declined to make an offer, and his new agent, writer Maxim Jakubowski offered the book elsewhere and it was quickly acquired by Scribner who took over the publishing of his books until his death. Writing for The New York Times, Marilyn Stasio proclaimed: “Everything about I Was Dora Suarez […] shrieks of the joy and pain of going too far.\" Filmmaker Chris Petit described it in The Times as \"a book full of coagulating disgust and compassion for the world's contamination, disease and mutilation, all dwelt on with a feverish, metaphysical intensity that recalls Donne and the Jacobeans more than any of Raymond's contemporaries.\" Showing up its surfeit of intestinal fortitude, the French government named its author a Chevalier of Arts and Letters in 1991.", "Cook died peacefully at the age of 63. His cause of death was given as cancer. His literary executor is John Williams and Maxim Jakubowski became the executor of his estate. Derek Raymond's final novel, Not Till the Red Fog Rises, appeared posthumously in 1994. It served up a perverse and funny apotheosis of its protagonist Gust, on parole after serving 10 years for armed robbery. In a review published in The Observer, Jane McLoughlin compared the quality of its writing to that of Graham Greene, Eric Ambler, and Joseph Conrad. A BBC drama series based on the Factory novels and to be produced by Kenith Trodd, plus a third French film adaptation of How the Dead Live, directed by Claude Chabrol and starring Philippe Noiret, were rumoured to be in the works, but never materialised. The first four Factory novels were reissued by Serpent’s Tail starting in early 2006, and by Melville House in the United States in 2011.", "# Cauchemar dans la rue, Rivages, 1988, translation by Jean-Paul Gratias, of Nightmare in the Street, first chapter adapted under the same title in Mike Ripley and Maxim Jakubowski (editors), Fresh Blood, Do-Not Press, 1996", "# Every Day Is a Day in August, in Maxim Jakubowski (editor), New Crimes, Constable Robinson, 1989", "# Changeless Susan, in Maxim Jakubowski (editor), More Murders for the Fireside, Pan, 1994", "# Not Till the Red Fog Rises, Time Warner Books UK, 1994, excerpt adapted as Brand New Dead in Maxim Jakubowski (editor), London Noir, Serpent's Tail, 1995"]}, {"page": "The Dancing Did", "response": ["Dave Thompson, reviewing the album for AllMusic, described \"Wolves of Worcestershire\" as \"almost Shakespearean in its lyrical vision\", and called \"Squashed Things\" \"the sound of The Cure meets The Wurzels\". Bill Prince (aka Bill Black), in Noise! magazine, writes, \"the tunes... mix a healthy Tenpole Tudor thrash with the slick licks of the B52's\", and the words are \"a novel variation from the usual run of rock'n'roll lyrics.\"Prince, Bill. Noise!, 14-27 October 1982, p.37. In The Rock Album Maxim Jakubowski characterised And Did Those Feet as \"a quirky assemblage of experimental dance material\" with \"minimal instrumentation and heavily passionate vocals\".Jakubowski, Maxim. The Rock Album Volume One, Frederick Muller Limited, 1983, p. 121", "The band's music has been described as \"rustic rock 'n' roll\", resembling \"a cross between the Clash and Steeleye Span\". Writer Dave Thompson described the band: \"punkabilly madmen who looked at the directions drawn by Dexys on the one hand, Tenpole Tudor on the other, and then drove a gap-toothed grinning juggernaut through the heart of all of them\". Record Collector magazine, reviewing the reissued album described the band as \"a theatrical, intellectual outfit with a driven sound somewhere between early Bunnymen and Southern Death Cult\", calling them \"a true English oddity\".Mackay, Emily \"The Dancing Did - And Did Those Feet\", Record Collector, October 2007, retrieved 2011-08-08 Paul Du Noyer, reviewing the 1982 single release \"Badger Boys\", describes the Did's musical approach as being like \"A Clockwork Orange transposed... to the rural past.\"Du Noyer, Paul. New Musical Express, 27 November 1982, p.16. Many of the band's lyrics have countryside themes, covering topics such as fruit-picking but given a distinctive, humorous, sometimes surreal, twist. Maxim Jakubowski describes the band's subject matter as \"most unusual\", embracing bizarre and unlikely topics including ghosts, Vikings, dandified street gangs, burning witches, lost army platoons, wandering funerary spirits, feral wolves, nuclear war, haunted tea rooms, and even roadkill."]}, {"page": "Robert Donston Stephenson", "response": ["Mary Ann Nichols, the first victim generally acknowledged to have been killed by 'Jack the Ripper', was found about 150 yards from the London Hospital, on 31 August 1888. Stephenson had been staying at the hospital since 26 July and left on 7 December. His profession, and his private studies of the 'occult sciences', made him take a more than average interest in the evolving murder series. At the London Hospital the murders were, as elsewhere, the major subject of conversation. After witnessing one Doctor Morgan Davies performing a demonstration of how the murderer may have been subduing and killing the victims,Stewart P. Evans & Keith Skinner, The Ultimate Jack The Ripper Sourcebook, p. 669.  Stephenson found Davies' behaviour suspicious, and brought the story to George Marsh, an ironmongery salesman professing to be an amateur detective.Evans & Skinner, p. 671. George Marsh, on his side, found Stephenson to be the more suspicious character, and went to the Scotland Yard. One of the officers, Inspector Roots, immediately recognized the suspect by description as being a man he had known for 20 years – Robert Donston Stephenson: \"a travelled man of education and ability, a doctor of medicine upon diplomas of Paris and New York: a major from the Italian Army – he fought under Garibaldi: and a newspaper writer\".Evans & Skinner, p. 673. From Roots's report it may seem that Stephenson was cleared of suspicion without further ado. According to Maxim Jakubowski and Jonathan Braund \"it appears that his (Stephenson's) cultured manner and eagerness to assist the police with arcane knowledge evoked their admiration rather than their suspicion\".The Mammoth Book of Jack the Ripper, p. 448, Ed. Maxim Jakubowski and Nathan Braund.", "Stephenson later fell under the suspicion of newspaper editor William Thomas Stead, the writer Mabel Collins and her friend Baroness Vittoria Cremers. Cremers told Aleister Crowley that Stephenson was a doctor and had committed the Whitechapel murders as part of a magic ritual and that the sites of the murders, when joined together on a map, formed a calvary cross (which is untrue). The suspicion was not merely caused by Stephenson's preoccupation with \"black magic\". He had been, by his own account, in love with a prostitute, and had contracted venereal disease from others. The fact that Stephenson's wife seemingly disappeared in 1886 has led to the otherwise unsupported speculation that he may have killed her.The Mammoth Book of Jack the Ripper, p. 446, Ed. Maxim Jakubowski and Nathan Braund. According to Jakubowski and Braund, Stephenson claimed to have killed others, and that he was keeping ties stained with human blood, as well as being the owner of candles made from human fat.The Mammoth Book of Jack the Ripper, p. 449, Ed. Maxim Jakubowski and Nathan Braun. Collins and Cremers' theory was later resurrected by Richard Whittington-Egan in A Casebook on Jack the Ripper and subsequently developed by the author Melvin Harris in Jack the Ripper: The Bloody Truth and its two sequels. Crime writer Colin Wilson praised the research done by Harris but concluded it didn't prove any connection between Stephenson and Jack the Ripper.Colin Wilson, \"A Lifetime in Ripperology\", in The Mammoth Book of Jack the Ripper, p. 421, Ed. Maxim Jakubowski and Nathan Braund. Jakubowski and Braund state that the major problem with Stephenson as a suspect is that the idea is heavily reliant on his own testimony, both as to \"the depth of his heartlessness and iniquity and as to his activities\". Whilst Cremers, the principal witness, was closely linked to Aleister Crowley and Stephenson's \"air of mystery and his somewhat theatrical, throwaway boast of wickedness\" seem to anticipate Crowley's own romancing, the statements about blood and candles may have been theatrical props specifically designed to have the effect which they had – to frighten two impressionable women.The Mammoth Book of Jack the Ripper, p. 449, Ed. Maxim Jakubowski and Nathan Braund. Author Ivor Edwards also named Stephenson as the Ripper in his book Jack the Ripper's Black Magic Rituals published by Penny Publishing (2001) and Blake Publishing (2002).  "]}, {"page": "Alison Tyler", "response": ["Her short story fiction appears in a range of anthologies, including titles edited by Violet Blue, Stephen Elliott, Maxim Jakubowski, Rachel Kramer Bussel, Tristan Taormino, Zane and Tyler herself. She has edited numerous erotic anthologies for Cleis Press and  Pretty Things Press, the small publishing company Tyler runs."]}, {"page": "Michael Hemmingson", "response": ["* The Mammoth Book of Short Erotic Novels New York: Co-edited with Maxim Jakubowski (Carroll & Graf, 2000) "]}, {"page": "Chad Taylor (writer)", "response": ["Guardian Critic Maxim Jakubowski described Taylor's novel Electric (2003) as \"entropy noir\" and praised Shirker (2000) for its \"existential anomie.\"", "In 2008 UK Guardian critic Maxim Jakubowski described Chad Taylor as a cult author:"]}, {"page": "Garbhan Downey", "response": ["*Requiems for the Departed with Ken Bruen, Maxim Jakubowski, Stuart Neville et al. (2010)"]}, {"page": "Jakubowski", "response": ["* Maxim Jakubowski (born 1944), British writer"]}, {"page": "Lord John Grey (character)", "response": ["# Lord John and the Hellfire Club (1998), a novella. Originally published in the 1998 British anthology Past Poisons: An Ellis Peters Memorial Anthology of Historical Crime (edited by Maxim Jakubowski), as well as by Bantam Dell as Lord John and the Hell-Fire Club in a \"Complimentary Collector's Special Edition\" the same year. It was later included in the Lord John and the Hand of Devils collection (2007)."]}, {"page": "Robert Sheckley short stories bibliography", "response": ["* \"I Can Teleport Myself to Anywhere\" (1979?, Twenty Houses of the Zodiac, ed. Maxim Jakubowski, 1979)"]}, {"page": "Matt Whyman", "response": ["* crusoe.com (2000) Hodder Headline (published in the New English Library of Internet Short Stories edited by Maxim Jakubowski"]}, {"page": "Murder One (bookshop)", "response": ["Murder One was a bookshop in the Charing Cross Road from 1988 to 2009, \"catering to readers interested in hard-to-find and collectable crime, mystery, romance and science fiction literature\".New Media Age, 28 Sept. 2000. It was the first UK bookshop to specialize in the crime and mystery genres, and at its opening in 1988 the largest specialist \"genre\" bookshop in Europe.Ken Gelder, Popular Fiction: The Logics and Practices of a Literary Field (Routledge, Abingdon & New York, 2004), p. 78  It was owned by the novelist Maxim Jakubowski."]}, {"page": "The Mammoth Book of Erotica", "response": ["The Mammoth Book of Erotica () is an Erotic literature anthology edited by Maxim Jakubowski that was originally published in 1994, with a revised edition published in 2000. It was published by Robinson Publishing in the United Kingdom (2000 reprint by Robinson imprint of Constable & Robinson), and by Carroll & Graf (Avalon Publishing Group imprint) in the United States.", "* Maxim Jakubowski: Introduction", "* Maxim Jakubowski: The K.C. Suite"]}, {"page": "Bouchercon XXIII", "response": ["*Maxim Jakubowski, 100 Great Detectives"]}, {"page": "Bouchercon XXVI", "response": ["*Maxim Jakubowski, London Noir"]}, {"page": "Lord John series", "response": ["The novella Lord John and the Hellfire Club was originally published in the 1998 British anthology Past Poisons: An Ellis Peters Memorial Anthology of Historical Crime (edited by Maxim Jakubowski), as well as by Bantam Dell as Lord John and the Hell-Fire Club in a \"Complimentary Collector's Special Edition\" the same year. It was later included in the Lord John and the Hand of Devils collection (2007)."]}, {"page": "Twenty Houses of the Zodiac", "response": ["Twenty Houses of the Zodiac (1979) was an English-language anthology of twenty selected international science fiction short stories for the 37th World Science Fiction Convention (or Worldcon). It was edited by Maxim Jakubowski and published by New English Library. It contained stories from an international selection of  authors, some who had never had their work translated into English before. Most of the works are unique to the collection and were never previously printed or later reprinted.", "*Twenty Houses of the Zodiac (1979) - Introductory essay by Maxim Jakubowski", "#Un Avocat pour Dolorès (\"An Avocado Pear for Dolorès\") (1979) - A short story by \"Adam Barnett-Foster\" (a nom de plume of Maxim Jakubowski) and translated from French by \"Sonia Florens\" (Dolorès Jakubowski).", "#Idiosyncrasies (1979) - A short story by Maxim Jakubowski."]}, {"page": "Adam Barnett-Foster", "response": ["#REDIRECT Maxim Jakubowski"]}, {"page": "Past Poisons", "response": ["Past Poisons: An Ellis Peters Memorial Anthology of Historical Crime is a 1998 British anthology of historical mystery short stories and novellas, edited by Maxim Jakubowski. The collection is named for novelist Ellis Peters, whose Cadfael Chronicles (1977–1994) are generally credited for popularizing the combined genre of historical fiction and mystery fiction that would become known as historical mystery."]}, {"page": "Graeme Shimmin", "response": ["Shimmin has said that his influences include Robert Harris, Alistair MacLean, and Len Deighton. Maxim Jakubowski has described Shimmin's influences as Ian Fleming, and Geoffrey Household."]}, {"page": "Nina Allan", "response": ["# Her story Wilkolak appeared in issue 11 of Crimewave  edited by Andy Cox in 2011. It was selected by Maxim Jakubowski for The Mammoth Book of Best British Crime 10.  Constable & Robinson 2013."]}, {"page": "Alembic (magazine)", "response": ["The first issue appeared in 1973: it was a collection of poems by Barry, Edwards, Hampson and Jim Stewart with graphic work by John Simpson, Robert Snell and Sibani Raychaudhuri. The work was printed on different colours and sizes of paper - and contained in a plastic bag.jacket2org/interviews/transatlantic-axis-alembic It was sold at the Edinburgh Festival of 1973, where Hampson was working with the Liverpool-based multimedia group Zoom Cortex. (See Adrian Henri, Events and Happenings, Thames and Hudson, for Zoom Cortex.)The second issue maintained the same format (a collection of loose pages in a plastic bag) but with an increased number of poets. Richard Kostelanetz's assemblages have been described by the editors as their model for this mode of publication.Robert Hampson, 'Exploring Different Forms and Formats' in Wolfgang Gortschacher's Contemporary Views on Little Magazines, Poetry Salzburg, 2000. With the third issue, the magazine adopted the standard little-magazine format of the time: A4 pages, card cover, stapled. Alembic 3, 4 and 5 also marked a more self-conscious engagement with contemporary London-based experimental poetry.jacket2.org/interviews/transatlantic-axis-alembic Alembic 3 (Spring 1975) announced the intention to engage with 'one area of contemporary creative practice' in each issue in order to represent the range of poetry being written in the UK.Alembic 3 This issue focused on contemporary work that had its roots in surrealism. It included Lee Harwood's essay 'Surrealist Poetry Today', which had been a talk given at the Poetry Society, and it included work by Harwood, Paul Matthews, Jeff Nuttall, Heathcote Williams and others. Alembic 4 was edited solely by Hampson and was dedicated to open field poetry and the idea of place. Allen Fisher was the featured poet: in addition to work by him, there was also an interview with him conducted by Barry and Edwards. This issue also included work by Roy Fisher, Eric Mottram, and a small number of American poets, including Alan Davies, who was to be associated with LANGUAGE poetry.jacket2.org/interviews/transatlantic-axis-alembic Alembic 5 (Autumn 1976)was edited solely by Edwards and focused on experimental prose, including work by Paul Buck, Opal Nations, Jeff Nuttall, Maxim Jakubowski, David Miller, the Canadian writer Greg Hollingshead and James Sherry, who was also associated with LANGUAGE poetry. This issue was also the first to be offset. (Like Alembic 4. it had a wrap around cover rather than card.) Alembic 6 (Summer 1977)was again solely edited by Hampson. It included further work by contributors to earlier issues. The featured poet was the Australian poet David Miller: as well as poems and essays by Miller, there was also poetry by Robert Lax and a reprint of work by Charles Madge, on both of whom Miller had written. In addition, there was also work by Rosmarie Waldrop, Tom Leonard, Elaine Randell and Barry MacSweeney.Alembic 6 Alembic 7 (Spring 1978), edited by Edwards and Hampson out of Lower Green Farm, was the 'Assemblage Issue', assembled by inviting a range of poets and visual artists to provide the contents. It included work by Jeremy Adler, Paul Buck, Herbert Burke, Paula Claire, cris cheek, Bob Cobbing, Glenda George, Robert Sheppard, E. E. Vonna-Michel, Lawrence Upton and others. A particular feature of this issue was that every cover was different: they were hand-printed by Vonna-Michel with a rubber-stamp used for the title.Alembic\" 8  Alembic 9 (to be edited by Hampson) was promised, but never appeared: Edwards had begun to publish Reality Studios as a slimmer, faster and more frequent publication. This eventually metamorphosed (through an amalgamation with Wendy Mulford's Street Editions) into Reality Street, which has been a major publisher of experimental poetry and prose since the 1980s."]}]}}