{"wiki_id": "http://www.wikidata.org/entity/Q6791903", "itemLabel": "Matty Blair", "itemDescription": "English association football player (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matty_Blair", "wikipedia_page": {"main": "Matthew James Blair (born 21 June 1989) is an English professional footballer who plays as a right back for  club Cheltenham Town.\nBlair started his career with Racing Club Warwick and after one season with the club signed for Stratford Town in 2008. He left for Bedworth United a year later, before going on to have spells with Redditch United and A.F.C. Telford United in the Conference North. He joined Kidderminster Harriers of the Conference Premier in 2010 and after one season signed for York City. He scored in the 2012 FA Trophy Final and 2012 Conference Premier play-off Final at Wembley Stadium, and his winning goal in the latter saw York promoted into League Two. After one season with York in League Two, Blair signed for divisional rivals Fleetwood Town in 2013 and was released in January 2015.", "link_mentions": [{"page": "Adam Murray", "response": ["Murray became caretaker-manager of Mansfield Town after Paul Cox left the club 19th in the League Two table on 21 November 2014. He rejected advice to take an older mentor as his assistant and instead retained existing coaches Richard Cooper and Micky Moore, who he said were \"as hungry as I am for coaching\". Murray's first game as manager, a day later at Field Mill, was a 1–0 victory over Plymouth Argyle. After a successful month as caretaker-manager, Murray was given the job on a permanent basis on 5 December, becoming the youngest manager in the top four divisions of English football. He made four free transfer signings in the January transfer window: defenders Junior Brown, Michael Raynes and Matty Blair, and midfielder Ricky Ravenhill. He sold Rob Taylor to Tranmere Rovers after the versatile player sought a move closer to his home. He also made use of the loan market, bringing in Billy Kee, Callum Elder, Lenny Pidgeley, Jeffrey Monakana, Adam Smith and Terry Hawkridge. Murray signed a new two-year contract in May. Mansfield ended the 2014–15 season in 21st-place, seven points above relegated Cheltenham Town, and Murray released seven players in the summer, saying that \"I feel the whole club needs a fresh start\". Ollie Palmer was also sold to Leyton Orient."]}, {"page": "Gary Mills (footballer, born 1961)", "response": ["Mills made a statement of intent to win the Conference Premier title in 2011–12. His summer recruitment was focused on signing players who would improve the team's goalscoring record, and he succeeding in doing this when signing Matty Blair, Paddy McLaughlin and Jason Walker. York consistently occupied a play-off position throughout 2011–12, eventually securing one after finishing fourth in the table. The team played a passing style in the first half of the season, before often grinding out results with The Press saying they \"compensated for a loss of craft with bundles of graft\"."]}, {"page": "Michael Coulson (footballer)", "response": ["Coulson was called into the England national C team in September 2010 for a match against Wales, but injury prevented him from making his debut. In February 2012, he received a second call up, being selected in the squad to face Italy in the 2011–13 International Challenge Trophy on 28 February. Coulson started to make his England C debut, playing the entire match as he and fellow winger Matty Blair played well on the flanks, the match finishing a 1–1 home draw. He finished his England C career with two caps, earned in 2012."]}, {"page": "James Meredith (soccer)", "response": ["Meredith won the 2012 FA Trophy Final with York at Wembley Stadium on 12 May 2012, in which they beat Newport County 2–0. Eight days later he played in the 2–1 victory over Luton in the 2012 Conference Premier play-off Final at Wembley, seeing the club return to the Football League after an eight-year absence with promotion to League Two. His 2011–12 season finished with 55 appearances and two goals for York, and was named in the 2011–12 Conference Premier Team of the Year alongside York teammate Matty Blair."]}, {"page": "Matty (name)", "response": ["* Matty Blair (born 1989), English footballer"]}, {"page": "Holly Matthews", "response": ["On 29 July 2017, Matthews' husband Ross Blair, son of Andy Blair and brother of Matty Blair, died from a brain tumour. Matthews has raised more than £11,000 for the Warwickshire hospice where her husband spent his final days."]}, {"page": "2010–11 York City F.C. season", "response": ["Before the start of the new season York released Barrett, Carruthers, Constantine, Darville, Gash, Mackin and McWilliams, with Purcell, Rankine, Jonathan Smith, Till and Young leaving for Dover Athletic, Aldershot Town, Swindon Town, Fleetwood and Alfreton Town respectively. Fyfield, Ingham and Meredith signed new contracts with York, and McDermott was retained on non-contract terms. The club's new arrivals were goalkeeper Paul Musselwhite from Lincoln, defender Lanre Oyebanjo from Histon, midfielders Paddy McLaughlin from Newcastle United, Adriano Moke from Jerez Industrial and Michael Potts from Blackburn Rovers, winger Matty Blair from Kidderminster, and strikers Chambers from Leicester, Liam Henderson from Watford and Jason Walker from Luton."]}, {"page": "Ritchie Sutton", "response": ["In June 2011, he was unveiled at Conference club Mansfield Town, having signed on one-year contract a free transfer. Manager Paul Cox said that \"I've had my eye on Ritchie since his days at Crewe. He is a big strong 'unit' who will hopefully be a good acquisition for the club.\" He was one of three Mansfield players injured in a pre-season 'friendly' with Ilkeston, and so missed the start of the season. He made his debut from the bench on 27 August, in a 3–0 home win over Kettering Town, before he was given his first start in a 1–0 win against Stockport County two days later. He played the next twenty consecutive league and FA Cup games, until a second yellow card picked up in a 3–1 defeat at Southport saw him suspended for one game. The \"Stags\" reached the play-off semi-finals, however Sutton was sent off at Field Mill for a late challenge on York City's Matty Blair, and watched from the sidelines as his team were knocked out of the play-offs in extra time. Mansfield won promotion into the Football League as Conference champions in 2012–13, though Sutton was largely confined to the bench following the arrival of James Jennings in January. His contract was extended by a further year in the summer."]}, {"page": "2011–12 Newport County A.F.C. season", "response": ["|FW ||17|| Matty Blair"]}, {"page": "2011–12 Stockport County F.C. season", "response": ["Stockport started October with a home game against York City, which ended 2–1 to York, goals coming from Matty Blair and Jason Walker. Stockport grabbed a consolation goal in second half stoppage time when Michael Paton headed his first goal for the club. On 6 October Stockport drew their ninth match of the season drawing 2–2 against Cambridge United in a match which was aired live on Premier Sports. Stockport twice took the lead with goals from Nick Chadwick and Danny Whitehead with Cambridge's equalisers coming from Luke Berry and Jordan Patrick. Carl Piergianni was also sent off for Stockport for a second bookable offence. On 11 October, they lost their third consecutive home match, beaten 4–3 by Darlington. Stockport went behind in the first minute, but a minute later they equalised with a goal from Nick Chadwick. Stockport then took the lead ten minutes later through Michael Paton, but Darlington levelled the match again with a goal just before half time. In the second half Stockport took the lead, with a second goal from  Michael Paton but Darlington once again equalised when Jamie Chandler scored his second of the game. Darlington scored the winner in the 85th minute. On 15 October, Stockport lost their first away match of the season when they were beaten 4–0 by table toppers Wrexham, their goals coming from Andy Morrell, Jake Speight and two from Nathaniel Knight-Percival. On 18 October Stockport won their first away game of the season by beating Bath City 2–0. Nick Chadwick and Michael Paton scoring for Stockport in the second half. On 22 October, Stockport were beaten 1–0 at home by Forest Green Rovers.The scorer for Forest Green Rovers was Yan Klukowski. October finished with a defeat when they failed to qualify for this season's FA Cup first round, losing 1–0 away to Southport in the fourth qualifying round."]}, {"page": "2011–12 York City F.C. season", "response": ["30 players made at least one appearance in nationally organised first-team competition, and there were 19 different goalscorers. Goalkeeper Michael Ingham, defender James Meredith and midfielder Paddy McLaughlin missed only three of the 58 competitive matches played over the season. Matty Blair finished as leading scorer with 20 goals, of which 10 came in league competition, eight came in the FA Trophy and two came in the play-offs. The winner of the Clubman of the Year, voted for by the club's supporters, was Scott Kerr for his first full season with the club.", "New additions in defence ahead of the season's start included goalkeeper Paul Musselwhite from Lincoln City and defender Lanre Oyebanjo from Histon. Midfielders to sign were Paddy McLaughlin from Newcastle United, Adriano Moke from Jerez Industrial (via the Glenn Hoddle Academy), and Michael Potts from Blackburn Rovers, with winger Matty Blair joining from Kidderminster Harriers. Strikers Ashley Chambers, who had been on loan the previous season, and Liam Henderson signed from Championship clubs Leicester City and Watford respectively. Striker Jason Walker was the only player signed for a fee, having cost £60,000 from Luton Town.", "|Matty Blair", "!scope=row|Matty Blair"]}, {"page": "2012 FA Trophy Final", "response": ["York City won the match 2-0 thanks to goals from Matty Blair and Lanre Oyebanjo.", "|FW ||17|| Matty Blair"]}, {"page": "2012 Conference Premier play-off Final", "response": ["|RW ||17||Matty Blair || "]}, {"page": "2009–2011 International Challenge Trophy", "response": [" England C: Preston Edwards; Lee Vaughan, Connor Franklin (Matty Blair 65), Rob Atkinson, Max Porter, Michael Wilde (Josh Coulson 73), Andy Mangan, Danny Rose (Jack Byrne 81), George Donnelly, Josh Simpson (Reece Styche 71), Sean Clancy"]}, {"page": "2012–13 York City F.C. season", "response": ["The 2011–12 season was Gary Mills' first full season as York City manager, having taken over the role in October 2010. York finished the season with two major trophies after victories in the 2012 FA Trophy Final and the 2012 Conference Premier play-off Final, both of which were staged at Wembley Stadium. The FA Trophy victory represented York's first piece of silverware in 19 years and was achieved with a 2–0 victory over York's Conference Premier rivals Newport County. With goals from Ashley Chambers and Matty Blair, York beat Luton Town 2–1 in the play-off final to return to the Football League after an eight-year absence with promotion to League Two.", "|Matty Blair", "!scope=row|Matty Blair"]}]}}