{"wiki_id": "http://www.wikidata.org/entity/Q6790182", "itemLabel": "Matthew Booth", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Booth_(actor)", "wikipedia_page": {"main": "Matthew James Booth is an English actor from Normanton, West Yorkshire. He is well known for playing the role of postman Paul Marsden on ITV's Emmerdale from 2003 until the character's death in 2004. He has also appeared in Coronation Street, At Home with the Braithwaites, The Royal, The Ward and Hollyoaks. He is a lifelong fan of Manchester United F.C. and once appeared in a Vodafone commercial with David Beckham.", "link_mentions": [{"page": "Matthew King (Emmerdale)", "response": ["Matthew first arrived in the village to join his brothers and father. The Kings had won a contract and were celebrating at the time. Matthew's heartless nature was shown when Carl (Tom Lister) was involved in the accidental death of postman Paul Marsden (Matthew Booth). Having moved the body and covered up Carl's involvement, Matthew conned Paul's widow, Siobhan (Abigail Fisher), into selling him the cottage at a knockdown price. She left the area with her unborn baby."]}, {"page": "Chas Dingle", "response": ["Soon enough, Chas makes friends with Carl King (Tom Lister) shortly after he and his family move into Holdgate Farm. They share a bond due to the fact that they are both parental failures and begin dating. The attraction strengthens into love but Carl's family disapprove and send him away after Paul Marsden (Matthew Booth) dies but he later returns and they get together. Chas' relationship with Carl was never stable, and the couple go through numerous break-ups and reconciliations. Despite Chloe Atkinson's (Amy Nuttall) poison pen letter scheme, Tom and Rosemary's blackmail, Carl's guilt over murdering his father and marriage to Chas's former friend, Lexi Nicholls (Sally Oliver), the relationship survives but finally deteriorates upon Chas discovering Carl was sleeping with Eve Jenson (Suzanne Shaw). Heartbroken, she follows her second cousin Charity's (Emma Atkins) advice to persuade him to marry her and falsely claims to be pregnant. However, she steals the money meant for the wedding and jilts him at the altar, telling him that he should be grateful that she lied about expecting his child."]}, {"page": "Carl King", "response": ["Carl Thomas King is a fictional character from the British ITV soap opera, Emmerdale, played by Tom Lister. The character and casting were announced in January 2004 when it was announced that producers were bringing \"four new single 'hunks'\" into the show, one of them being Carl. Lister made his first appearance on the show on 6 February 2004. Throughout the course of his story arc, Carl establishes a relationship with Chas Dingle (Lucy Pargeter) – which contributes to his storylines that include the pair having an ill-fated wedding after Chas exposes Carl's affair with her best friend Eve Jenson (Suzanne Shaw). During his time on the show, Carl has accidentally caused the death of local postman Paul Marsden (Matthew Booth); killed his own father Tom (Ken Farrington) in the events surrounding the Who Killed Tom King? storyline, which he ultimately confessed to his brothers Jimmy (Nick Miles) and Matthew (Matt Healy) on the show's 500th village anniversary episode – after the trio were acquitted for their father's murder; formed a romance with DCI Grace Barraclough (Glynis Barber), the policewoman investigating his father's murder, that culminated with her being killed in a hit and run – just as she prepared to take Carl into custody after he admitted to killing his father; sparked a business conflict with Matthew that concluded with the latter's death, after Carl ruined Matthew's ill-fated wedding to his business partner Anna De Souza (Emma Davies) by exposing his involvement behind the death of her father Donald (Michael Jayston); developed a feud with Chas' niece Debbie (Charley Webb) upon clashing with her parents, Cain (Jeff Hordley) and Charity (Emma Atkins), respectively; embarked on a failed marriage with Lexi Nicholls (Sally Oliver); and became archenemies with Debbie's ex-boyfriend Cameron Murray (Dominic Power) after discovering his affair with Chas and subsequently blackmailing the pair in repaying him the £30,000 that Chas previously swindled from his bank account.", "Despite being married, Carl flirts with Louise Appleton (Emily Symons) and she agrees to a date until Carl's wife, Colleen (Melanie Ash), arrives and tells Louise that she is Carl's wife and mother of his children; Thomas (Mark Flanagan) and Anya (Lauren Sheriston) before telling Carl not to come home. Louise slaps Carl and goes home so he moves into Holdgate Farm with his family but is \"persuaded\" to do some repairs to the roof, despite his fear of heights. Local postman, Paul Marsden (Matthew Booth) helps him and seeing his nerves about heights, starts teasing him and mucking about but stretches too far and falls, dying instantly. Not wanting people to know they were involved, Carl and his brothers, Jimmy (Nick Miles) and Matthew (Matt Healy), move his body to the back garden of the cottage Paul shared with his wife, Siobhan (Abigail Fisher). She finds him and assumes he fell from their roof after fixing the television aerial."]}, {"page": "Paul Marsden (Emmerdale)", "response": ["Paul Marsden is a fictional character from the British television soap opera Emmerdale, played by Matthew Booth. The character made his first appearance during the episode broadcast on 10 March 2003. The character was killed off in July 2004, following an altercation with Carl King (Tom Lister)."]}, {"page": "Siobhan Marsden", "response": ["Siobhan was introduced in March 2003 alongside the Marsden family. In September 2003, the serial's producer Steve Frost announced that he would be writing out the majority of the family. Frost told an Evening Standard journalist that \"the Marsdens have got a great story to play through the autumn, but unfortunately this culminates in them leaving the village.\" However, he sconfirmed that Siobhan and her on-screen husband Paul Marsden (Matthew Booth) would remain in the series. Frost told a reporter from Inside Soap that \"Paul and Siobhan Marsden will be staying and facing some trying times\"."]}, {"page": "Matthew Booth", "response": ["Matthew Booth may refer to:", "*Matthew Booth (actor), English actor", "*Matthew Booth (soccer) (born 1977), South African football defender", "*Matthew Booth (film editor)  on Man on the Train"]}, {"page": "List of former Emmerdale characters", "response": ["|Paul Marsden || Matthew Booth || 2003–2004"]}, {"page": "List of Emmerdale characters (2004)", "response": ["Dean first appears in 2004 and works primarily as their chauffeur. He was one of the most loyal and trusted King employees. He takes Carl King (Tom Lister) around Romania following his involvement in the accidental death of Paul Marsden (Matthew Booth), and is forced to lie to Tom (Kenneth Farrington), which upsets him, as Tom has helped him on numerous occasions. At one point, false rumours suggest he is having an affair with Charity Tate (Emma Atkins); a few weeks later, Tom dumps Charity as he believes she has slept with Cain Dingle (Jeff Hordley), and as Dean drives him away from the wedding, Tom apologises for doubting him. Following Tom's death on Christmas Day 2006, Dean carries his coffin at the funeral along with Jimmy (Nick Miles), Matthew (Matt Healy) and Carl. In January 2009, he is a pallbearer at Matthew's funeral, and at the wake talks to Lexi Nicholls (Sally Oliver) about his loyalty to the Kings. The following day Dean brings some of Matthew's effects from the site office to Jimmy and Carl. When they see Rosemary Sinclair's (Linda Thorson) name plate from her coffin, Dean reveals to them that Matthew had dug up her body and crushed it in a rubbish truck. In February 2009, he drives a van to Belgium, not knowing Jimmy and Nicola De Souza (Nicola Wheeler) are in the back, having just slept together. The following month he attends Carl and Lexi's wedding. This was Dean's last appearance so far and he has not been seen since. "]}, {"page": "List of people from Wakefield", "response": ["* Matthew Booth, actor, Emmerdale"]}, {"page": "The Man Who Had Power Over Women", "response": ["* Matthew Booth - Mark Pringle"]}, {"page": "Booth (actor)", "response": ["*Matthew Booth (actor), an English actor from Normanton, West Yorkshire"]}]}}