{"wiki_id": "http://www.wikidata.org/entity/Q6790946", "itemLabel": "Matthew McDiarmid", "itemDescription": "British writer and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_McDiarmid", "wikipedia_page": {"main": "Matthew McDiarmid, full name Matthew Purdie McDiarmid (25 June 1914–12 February 1996) was a Scottish literary scholar, essayist, campaigning academic and poet. He was a founding member of the Association for Scottish Literary Studies (1970) and the first president of the Robert Henryson Society which he also helped to found in 1993.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Matthew McDiarmid (1914–1996, S)"]}, {"page": "Robert Fergusson", "response": ["Fergusson involved himself in Edinburgh's social and artistic circles mixing with musicians, actors, artists and booksellers who were also publishers. His friend, the theatre-manager William Woods, regularly procured him free admission to theatre productionsMatthew McDiarmid, The Poems of Robert Fergusson (2 vols), Volume 1. Blackwood, 1954, pp. 22-28. and in mid-1769 Fergusson struck up a friendship with the Italian castrato singer Giusto Fernando Tenducci, who was touring with a production of Artaxerxes. Fergusson's literary debut came when Tenducci asked him to contribute Scots airs for the Edinburgh run of the opera. Fergusson supplied three, which were performed and published with the libretto.", "Modern editions of Fergusson include the definitive two-volume collection of his works in both Scots and Scottish English, edited by the scholar Matthew McDiarmid, The Poems of Robert Fergusson, published in the 1950s, and Robert Fergusson, Selected Poems, a popular edition of the poetry in Scots, edited by the author James Robertson and first published around the turn of the present century."]}, {"page": "List of Queen's University Belfast people", "response": ["* Matthew McDiarmid (1914–1996) – literature professor and campaigning academic; editor of the canonical Scottish Text Society editions of the poets Robert Fergusson and Blind Hary"]}, {"page": "McDiarmid", "response": ["* Matthew McDiarmid (1914–1996), Scottish literary scholar, essayist and poet"]}, {"page": "Association for Scottish Literary Studies", "response": ["The Association for Scottish Literary Studies (ASLS) is a Scottish educational charity, founded in 1970 to promote and support the teaching, study and writing of Scottish literature. Its founding members included the Scottish literary scholar Matthew McDiarmid (1914–1996). Originally based at the University of Aberdeen, it moved to its current home within the University of Glasgow in 1996. In November 2015, ASLS was allocated £40,000 by the Scottish Government to support its work providing teacher training and classroom resources for schools."]}, {"page": "The Morall Fabillis of Esope the Phrygian", "response": ["Various literary scholars have noted the apparent symmetry in the architecture, citing it as evidence of an organising principle Henryson employed to \"lock\" the structure of the poem, aesthetically beautiful in its own right and holding important clues for interpreting his larger meaning or purpose.For instance, George D. Gopen, Ed. The Moral Fables of Aesop. University of Notre Dame Press. 1987. He identifies and discusses three different \"conscious arrangements\" all of which \"point to tales #6-#8 as forming the core of the work\". Introduction, pp.17–24. Others have preferred to defend individual readings of various fabillis viewed as self-sufficient entities which they argue question the coherence or completeness of that scheme. Finally John MacQueen cites fragmentation in surviving textual witnesses for the poem before 1570 as grounds for caution in asserting with certainty that the overall structure represents Henryson's intention.John MacQueen. Complete and Full with Numbers. Rodopi, Amsterdam. 2006. He discusses textual evidence for the ordering in Appendix B. His book mainly focusses on numerological structures in the individual fabillis. Nevertheless, the above outline describes the structure as received from the 16th century prints and manuscripts which give what the literary scholar Matthew McDiarmid calls the \"accepted text\".Matthew P McDiarmid: Robert Henryson. Scottish Academic Press, Edinburgh; 1981. p.64."]}, {"page": "Matthew P McDiarmid", "response": ["#REDIRECT Matthew McDiarmid"]}, {"page": "William Stewart (makar)", "response": ["Stewart wrote a number of advice poems for the young James V of Scotland, and a verse translation of Hector Boece's Latin History of Scotland. He was the poet mentioned twice in David Lindsay of the Mount's Complaynt of the Papingo. Stewart was also mentioned by John Rolland in his prologue to the Seven Sages.Turnbull, vol. 1, (1858), pp. ix-xiii. There were two students with this name at St Andrews University at the same time, giving rise to possible confusions of identity; in the Buik of Chronicles, Stewart said he was a student there for 14 years. Although it has usually been assumed the poet and minor courtier Stewart wrote both the translation and the court poems, the critic Matthew McDiarmid attributed the translation to the other William Stewart, the bishop.MacDonald (1996), p. 182 fn. 11, citing Jack, RDS, ed., History of Scottish Literature, vol. 1 (1988), p. 36."]}, {"page": "1914 in Scotland", "response": ["* 25 June – Matthew McDiarmid, literary scholar, essayist, campaigning academic and poet (died 1996)"]}, {"page": "List of Scottish poets", "response": ["*Matthew McDiarmid"]}, {"page": "McDiarmid, Matthew", "response": ["#redirectMatthew McDiarmid"]}]}}