{"wiki_id": "http://www.wikidata.org/entity/Q6790675", "itemLabel": "Matthew Hilton", "itemDescription": "British furniture designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Hilton_(designer)", "wikipedia_page": {"main": "Matthew Hilton (born 1957) is a British furniture designer of modern furniture and lighting.", "link_mentions": [{"page": "List of furniture designers", "response": ["* Matthew Hilton (born 1957)"]}, {"page": "Matthew Hilton", "response": ["Matthew Hilton may refer to:", "* Matthew Hilton (historian), British social historian", "* Matthew Hilton (designer) (born 1957), British furniture designer", "* Matthew Hilton (boxer) (born 1965), Canadian light-middleweight boxer"]}, {"page": "Commune by the Great Wall", "response": ["The Commune by the Great Wall is near the Badaling section of the Great Wall. The Commune consists of private villas designed by twelve Asian architects. Its clubhouse and villas are  in a valley totaling eight square kilometers. It also houses corporate functions, weddings, film shoots, and fashion shows. Its furniture and interior decoration were designed by Serge Mouille, Philippe Starck, Karim Rashid, Matthew Hilton, Marc Newson, and Michael Young."]}, {"page": "SOHO China", "response": ["The Commune consists of private villas designed by 12 prominent Asian architects. This project's  vision was to encourage creativity to influence a new generation of Asian architects, developers and consumers. At the Shuiguan section of the Great Wall- the Commune shares the tranquility of the mountains with a Unesco World Heritage Site. The Commune's clubhouse and 11 villas, which each have a living room, dining room, kitchen, bedrooms and bathrooms are nestled in a valley totaling eight square kilometers. Some of its luxurious villas have sauna rooms, accessible rooftops, terraces or BBQ facilities. Commune by the Great Wall is destination for corporate functions, events, weddings, film shoots and fashion shows. The Commune has furniture and other interior decorations from such distinguished designers as Serge Mouille, Thierry Hoppe, Von Robinson, Philippe Starck, Alex Strub, Claudio Colucci, Ross Menuez, Kaname Okajima, Jonas Damon, Karim Rashid, Matthew Hilton, Marc Newson, and Michael Young."]}]}}