{"wiki_id": "http://www.wikidata.org/entity/Q6790383", "itemLabel": "Matthew Darby-Griffith", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Darby-Griffith", "wikipedia_page": {"main": "Matthew Chitty Darby, later Darby-Griffith, (1772 Newtown, Hampshire –1823) was a British soldier and Major-General.\nHe was a son of Vice-Admiral George Darby and Mary daughter of Sir William St Quintin, 4th Baronet. He took the additional name of Griffith upon inheriting the estate of Padworth in the English county of Berkshire.\nDarby's thirty years' service in the Grenadier Guards included much action during the Napoleonic Wars. He lost his leg at the Battle of Corunna in Spain in 1809, and was awarded the War Medal with one clasp for the part he played there.\nHe died on 7 August 1823 at Padworth House. He had married Lousia, daughter of Thomas Hankey Esq. of Fetcham Park, Surrey, and they became the parents of three sons and one daughter, including Christopher Darby-Griffith, MP and General Henry Darby-Griffith, CB.", "link_mentions": [{"page": "West Berkshire", "response": ["*Matthew Darby-Griffith (1772–1823), Napoleonic army general"]}, {"page": "Maj-Gen Matthew Darby (later Darby-Griffith)", "response": ["#REDIRECT Matthew Darby-Griffith"]}, {"page": "Matthew Darby, later Darby-Griffith", "response": ["#REDIRECT Matthew Darby-Griffith"]}, {"page": "Alexander McBean", "response": ["Archibald gained his middle name from General Henry Darby-Griffith (son of Major-General Matthew Darby-Griffith), who was his grandfather Thomas Hamilton McBean's Colonel, had commanded the Scots Greys in the Crimea and led them (including Thomas) at the successful Charge of the Heavy Brigade during the Battle of Balaclava. Both he and his brother died unmarried and without children, Archibald on 23 September 1945, and Alexander Hamilton on 30 December 1950."]}, {"page": "Darby-Griffith, Matthew", "response": ["#redirectMatthew Darby-Griffith"]}, {"page": "Matthew Chitty Darby-Griffith", "response": ["#REDIRECT Matthew Darby-Griffith"]}]}}