{"wiki_id": "http://www.wikidata.org/entity/Q6813796", "itemLabel": "Melton Prior", "itemDescription": "British illustrator and war correspondent", "wikipedia_url": "https://en.wikipedia.org/wiki/Melton_Prior", "wikipedia_page": {"main": "Melton Prior (12 September 1845 – 2 November 1910), was an English artist and war correspondent for The Illustrated London News from the early 1870s until 1904. Prior was one of the leading illustrators of late Victorian Britain, noted for his ability to quickly sketch scenes.  His pencil sketches were sent back to London where they were re-drawn by studio artists and engraved on wood-blocks for printing in the Saturday issues of the Illustrated London News. In addition to covering conflicts around the world, he also traveled on a number of Royal tours including accompanying the Prince of Wales to Canada in 1901.\nPrior was one of two major artists employed by the Illustrated London News, with the other being William Simpson (1823–1899).", "link_mentions": [{"page": "Military art", "response": ["By the time of the American Civil War and the Crimean War photographers began to compete strongly with artists in coverage of scenes in camp, and the aftermath of battle, but exposure times were generally too long to enable them to take pictures of battles very effectively. War photography is not covered in this article.  Illustrations for newspapers and magazines continued a heroic style with perhaps more confidence than painters, and Melton Prior followed British forces around Imperial troublespots for decades, working for the Illustrated London News; his scenes \"helped to establish a style of action draughtsmanship which has left an indelible stamp on the art of the comic strip.\"Pepper, 3, (ii)  Prior and other \"special correspondents\" such as Frederic Villiers were known as \"specials\". Richard Caton Woodville Jr. and Charles Edwin Fripp were \"specials\" and also painters who exhibited at the Royal Academy and elsewhere."]}, {"page": "War artist", "response": ["* Melton Prior, 1845–1910Brighton and Hove Museums, Melton Prior; Lee, Sidney. (2006). "]}, {"page": "The Idler (1892–1911)", "response": ["* Melton Prior"]}, {"page": "Hither Green Cemetery", "response": ["===Melton Prior===", "Melton Prior (12 September 1845 – 2 November 1910), was an English artist and war correspondent[1] for The Illustrated London News from the early 1870s until 1904. Prior was one of the leading illustrators of late Victorian Britain, noted for his ability to quickly sketch scenes. His pencil sketches were sent back to London where they were re-drawn by studio artists and engraved on wood-blocks for printing in the Saturday issues of the Illustrated London News. In addition to covering conflicts around the world, he also traveled on a number of Royal tours including accompanying the Prince of Wales[2] to Canada in 1901."]}, {"page": "The Sketch", "response": ["The Sketch printed photographs by Howard Coster,\"Howard Coster\", The National Portrait Gallery, retrieved 11 February 2013 and illustrations by H. M. Bateman, Max Beerbohm, Edmund Blampied, Percy Venner Bradshaw (1877–1965), Thomas Arthur Browne, Hilda Cowham, Annie Fish, John Hargrave, John Hassall, Phil May, Bernard Partridge, Melton Prior, W. Heath Robinson, Josep Segrelles, Sidney Sime, Olive Snell, Bert Thomas, and Thomas Downey."]}, {"page": "Military attachés and observers in the Russo-Japanese War", "response": ["* Melton Prior, Illustrated London News."]}, {"page": "Carlyle Mansions", "response": ["*No. 12a: Melton Prior, English illustrator and war correspondent"]}, {"page": "Louis William Desanges", "response": ["While painting a portrait of Lieut. Col. Robert James Lindsay who had won the Victoria Cross at the Battle of the Alma at his home in Wantage, the two men came up with idea of creating a series of paintings containing portraits of the various soldiers winning their V.C. medals. Many of these were exhibited at the Egyptian Gallery in Piccadilly, and 47 of the paintings were exhibited at the Crystal Palace at Sydenham in 1862. In 1900, the majority of them were acquired by Lord Wantage and hung in the Victoria Cross Gallery. In all, fifty oil paintings were painted by the artist between 1859 and 1862. The gallery was broken up in the 20th century and the paintings dispersed to various collections, particularly to the regiments represented. Desanges also painted several other military scenes, including a depiction of General Sir Garnet Wolseley during the Ashanti War entitled Fighting in the Ashantee Forest. This had been commissioned by the proprietors of the Illustrated London News and exhibited at Willis's Rooms in London in 1874, and was reproduced as a special supplement wood-engraving in the Illustrated London News on 1 August 1874. The artist composed his picture using sketches provided by Melton Prior, and various officers sat for him. Another military painting by Desanges depicted the March of General Roberts from Cabul to Candahar which was exhibited at the Jennings Gallery, Cheapside, in the spring of 1883. The picture was literally crammed with portraits of many of the participants."]}, {"page": "Frederic Villiers", "response": ["Frederic Villiers (23 April 1851 – 5 April 1922), British war artist and war correspondent. Along with William Simpson and Melton Prior, Villiers was one of the most notable 'special' artists of the later 19th century. He may have been the model for the Kipling war-artist character, Dick Heldar in The Light that Failed."]}]}}