{"wiki_id": "http://www.wikidata.org/entity/Q6819407", "itemLabel": "Meriel Forbes", "itemDescription": "British actress (1913-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Meriel_Forbes", "wikipedia_page": {"main": "Meriel Forbes, Lady Richardson (13 September 1913 – 7 April 2000) was an English actress. She was a granddaughter of Norman Forbes-Robertson and great-niece of Sir Johnston Forbes-Robertson. After making her stage debut with her father's touring company in 1929 she progressed via provincial repertory to the West End, where she appeared continually from the 1930s to the 1970s.\nShe married the actor Ralph Richardson in 1944, and the couple regularly appeared together in London, and on tour in the UK, continental Europe, Australia and North and South America. She appeared in fifteen films between 1934 and 1969.", "link_mentions": [{"page": "Ralph Richardson", "response": ["In 1942, on his way to visit his wife at the cottage where she was cared for by a devoted couple, Richardson crashed his motor-bike and was in hospital for several weeks. Kit was at that point mobile enough to visit him, but later in the year her condition worsened and in October she died. He was intensely lonely, though the comradeship of naval life was some comfort. In 1944 he married again. His second wife was the actress Meriel Forbes, a member of the Forbes-Robertson theatrical family.Miller, pp. 83–84 The marriage brought him lifelong happiness and a son, Charles (1945–98), who became a television stage manager."]}, {"page": "Oh! What a Lovely War", "response": ["*Meriel Forbes as Lady Grey"]}, {"page": "Blandings Castle", "response": ["* The Castle and its inhabitants were the subject of six half-hour adaptations under the title Blandings Castle, made by the BBC (also known as The World of Wodehouse series). Adapted from some of the shorts in Blandings Castle and Elsewhere and \"The Crime Wave at Blandings\", they were broadcast in 1967 and starred Ralph Richardson as Lord Emsworth, Meriel Forbes as Lady Constance, Stanley Holloway as Beach and Derek Nimmo as Freddie. Only extracts from one episode survive (\"Lord Emsworth and the Girl Friend\"),The World of Wodehouse: Series 1: \"Blandings Castle\" lostshows.com the series having suffered the fate of being wiped."]}, {"page": "Johnston Forbes-Robertson", "response": ["Born in London, he was the eldest of the eleven children of John Forbes-Robertson, a theatre critic and journalist from Aberdeen, and his wife Frances. One of his sisters, Frances (1866–1956), and three of his brothers, Ian Forbes-Robertson (1859–1936), Norman Forbes-Robertson (1858–1932) and John Kelt (Eric Forbes-Robertson) (1865–1935), also became actors. Through his wife Gertrude Elliot, he was the brother-in-law of famed actress Maxine Elliott, the uncle of Roy HarrodP. M. Oppenheimer, ‘Harrod, Sir (Henry) Roy Forbes (1900–1978)’, rev. Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2010, accessed 8 Oct 2011 the economist, and he was also the great-uncle of actress Meriel Forbes (granddaughter of his brother Norman), who married actor Ralph Richardson."]}, {"page": "Blandings Castle and Elsewhere", "response": ["Several of the Blandings shorts from this collection were adapted for the first series of The World of Wodehouse, broadcast in February and March 1967 in six half-hour episodes. They starred Ralph Richardson as Lord Emsworth, Derek Nimmo as Freddie Threepwood, Meriel Forbes as Lady Constance, and Stanley Holloway as Beach. Unfortunately the master tapes of all but the first part (\"Lord Emsworth and the Girl Friend\"), were wiped, and no known copies exist."]}, {"page": "Lady Constance Keeble", "response": ["* In the 1967 television series Blandings Castle, the first series of The World of Wodehouse, Lady Constance was played by Meriel Forbes."]}, {"page": "Chester Terrace", "response": ["There are two blue plaques on the street: one at No. 13 for the architect Charles Robert Cockerell,Rennison, N. (1999) The London Blue Plaque Guide Sutton Publishing  and one at No. 27 for Air Marshal John Salmond. The politician John Profumo lived at the aforementioned Nash House, No. 3 Chester Terrace, from 1948 until 1965. His former mistress Christine Keeler later lived in the nearby Chester Close North. The composer Arnold Bax lived at No. 19 from 1911 to 1918. The actor Sir Ralph Richardson and his wife Meriel Forbes lived at No. 1 Chester Terrace until 1983. Other residents of Chester Terrace have included the artist Aubrey Beardsley, the architect Charles Cockerell, the surgeon William Coulson, the swindler Leopold Redpath,  and the journalist Emma Tennant, who was born there.\"Chester Terrace\", Oxford Dictionary of National Biography. Retrieved 22 September 2021"]}, {"page": "Meriel", "response": ["*Meriel Forbes (1913–2000), English actress"]}, {"page": "The Bells Go Down", "response": ["* Meriel Forbes as Susie"]}, {"page": "The Day Will Dawn", "response": ["* Meriel Forbes as Milly, the barmaid"]}, {"page": "The Gentle Sex", "response": ["* Meriel Forbes as Davis, junior commander"]}, {"page": "List of British films of 1934", "response": ["|The Case for the Crown || George A. Cooper || Miles Mander, Meriel Forbes || Crime ||"]}, {"page": "List of British films of 1936", "response": ["| The Belles of St. Clements || Ivar Campbell || Meriel Forbes, Basil Langton || Drama ||"]}, {"page": "Look After Lulu!", "response": ["| Meriel Forbes"]}, {"page": "Home at Seven (film)", "response": ["*Peggy Dobson - Meriel Forbes"]}, {"page": "Phillip Street Theatre", "response": ["Orr established a board of directors for the Phillip Street Theatre that included author Morris West, journalist Betty Best, charity fundraiser Nola Dekyvere and (later) lawyer John Kerr. Despite the success of Top of the Bill and its follow-up Hat Trick (1955) the board decided that the next show would be a straight production of Hamlet, which flopped. This was followed by a production of Sheridan's comedy The Duenna, set to music by Julian Slade and directed by British director Lionel Harris, who had been brought to Australia to direct a local production that featured visiting British actors Lewis Casson, Sybil Thorndike, Ralph Richardson and (his wife) Meriel Forbes. Harris asked Chater to play the role of Mendoza and also cast the young Ruth Cracknell. The production was well-received but it was terminated in the middle of its run by the hall's owners, the Workers' Educational Association (WEA), who took legal action against the theatre company to regain use of the hall.Johnson & Smiedt, 1999, p.141-142"]}, {"page": "Home at Seven (play)", "response": ["*Peggy Dobson - Meriel Forbes"]}, {"page": "I Killed the Count", "response": ["*Meriel Forbes as Renee La Lune"]}, {"page": "Girls, Please!", "response": ["Girls, Please! is a 1934 British comedy film directed by Jack Raymond and starring Sydney Howard, Jane Baxter, Meriel Forbes and Peter Gawthorne. It was made at Elstree Studios.Wood p.82 In the film, a physical education teacher at a girls school is left in charge when the headmistress is absent, and has to confront the elopement of one of the pupils.", "* Meriel Forbes as Ann Arundel"]}, {"page": "The Belles of St. Clements", "response": ["The Belles of St. Clements is a 1936 British drama film directed by Ivar Campbell and starring Evelyn Foster, Meriel Forbes and Basil Langton.BFI.org It is a melodrama set inside a teacher training college.", "* Meriel Forbes ...  Natalie de Mailliere"]}, {"page": "The Long Dark Hall", "response": ["* Meriel Forbes - Marjorie Danns "]}, {"page": "The World of Wodehouse", "response": ["* Meriel Forbes as Lady Constance Keeble (6 episodes)"]}, {"page": "Come On George!", "response": ["* Meriel Forbes as Monica Bailey"]}, {"page": "Mr. Cohen Takes a Walk", "response": ["* Meriel Forbes as Sally O'Connor"]}, {"page": "Meriel Forbes-Robertson", "response": ["#Redirect Meriel Forbes"]}, {"page": "Muriel Elsa Florence Forbes-Robertson", "response": ["#Redirect Meriel Forbes"]}, {"page": "Meriel Forbes, Lady Richardson", "response": ["#Redirect Meriel Forbes"]}, {"page": "Borrow a Million", "response": ["* Meriel Forbes as Eileen Dacres  "]}, {"page": "The Case for the Crown", "response": ["The Case for the Crown is a 1934 British crime film directed by George A. Cooper and starring Miles Mander, Meriel Forbes and Whitmore Humphries. It was made at Elstree Studios as a quota quickie for release by Paramount Pictures.Wood p.81", "* Meriel Forbes as Shirley Rainsford  "]}, {"page": "List of people from the London Borough of Hammersmith and Fulham", "response": ["* Meriel Forbes, actress, born in Fulham."]}, {"page": "Bees on the Boat Deck", "response": ["In 1939 the play was made into a television film by the BBC, starring Richardson, James Mason, John Laurie and Meriel Forbes."]}, {"page": "Frances Forbes-Robertson", "response": ["Frances Mary Desirée Forbes-Robertson was born in 1866. She was the youngest child of John Forbes-Robertson, a theatre critic and journalist from Aberdeen, and his wife Frances. The eldest of the eleven children in the family was Johnston Forbes-Robertson, the actor. Two other brothers, Ian Forbes-Robertson (1859–1936), and Norman Forbes-Robertson (1858–1932) also became actors, and a third, Eric Forbes-Robertson(1865–1935) became a painter. She was the sister-in-law of the actress Maxine Elliott, and the great-aunt of actress Meriel Forbes (granddaughter of her brother Norman), who married actor Ralph Richardson. Forbes-Robertson was educated in convents in France and Italy. "]}]}}