{"wiki_id": "http://www.wikidata.org/entity/Q68105", "itemLabel": "Joseph Schacht", "itemDescription": "Islamic scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Schacht", "wikipedia_page": {"main": "Joseph Franz Schacht German pronunciation: [ˈjoːzɛf ʃaxt] (listen)(15 March 1902 – 1 August 1969) was a British-German professor of Arabic and Islam at Columbia University in New York.  He was the leading Western scholar on Islamic law, whose Origins of Muhammadan Jurisprudence (1950) is still considered a centrally important work on the subject.  The author of many articles in the first and second editions of the Encyclopaedia of Islam, Schacht also co-edited, with C. E. Bosworth, the second edition of The Legacy of Islam for the Legacy series of Oxford University Press and authored a textbook under the title An Introduction to Islamic Law (1964).", "link_mentions": [{"page": "Hadith", "response": ["Joseph Schacht describes hadith as providing \"the documentation\" of the sunnah.", "Joseph Schacht quotes a hadith by Muhammad that is used \"to justify reference\" in Islamic law to the companions of Muhammad as religious authorities — \"My companions are like lodestars.\"see also   ", "In Islamic law, the use of hadith as now understood (hadith of Muhammad with documentation, isnads, etc.) came gradually. According to scholars such as Joseph Schacht, Ignaz Goldziher, and Daniel W. Brown, early schools of Islamic jurisprudenceBrown, Rethinking tradition in modern Islamic thought, 1996: p.11  used rulings of the Prophet's Companions, the rulings of the Caliphs, and practices that “had gained general acceptance among the jurists of that school”. On his deathbed,  Caliph Umar instructed Muslims to seek guidance from the Quran, the early Muslims (muhajirun) who emigrated to Medina with Muhammad, the Medina residents who welcomed and supported the muhajirun (the ansar) and the people of the desert.Ibn Sa’d, Tabaqat, III/1, 243. Cf G.H.A. Juynboll, Muslim Traditions: Studies in Chronology, Provenance and Authorship of Early Hadith (Cambridge, 1983; Juynboll, G.H.A., “Some New Ideas on the Development of Sunna as a Technical Term in Early Islam”, ‘’Jerusalem Studies in Arabic and Islam’’ 10 (1987): p.108, cited in ", "It was Abū ʿAbdullāh Muhammad ibn Idrīs al-Shāfiʿī (150-204 AH), known as al-Shafi'i,Joseph Schacht, The Origins of Muhammadan Jurisprudence (Oxford, 1950, repre. 1964) esp. 6-20 and 133-137): Ignaz Goldziher, The Zahiris: Their Doctrine and their History, trans and ed. Wolfgang Behn (Leiden, 1971), 20 ff...)] who emphasized the final authority of a hadith of Muhammad, so that even the Quran was \"to be interpreted in the light of traditions (i.e. hadith), and not vice versa.\"J. SCHACHT, An Introduction to Islamic Law (1964),  supra note 5, at 47  While traditionally the Quran is considered above the sunna in authority, Al-Shafi'i \"forcefully argued\"  that the sunna stands \"on equal footing with the Quran\", (according to scholar Daniel Brown) for (as Al-Shafi'i put it) “the command of the Prophet is the command of God.”al-Shafii ‘’Kitab al-Risala’’, ed. Muhammad Shakir (Cairo, 1940), 84Brown, Rethinking tradition in modern Islamic thought, 1996: p.8", "However, Joseph Schacht states that the \"whole technical criticism of traditions ... is mainly based on criticism of isnads\", which he (and others) believe to be ineffective in eliminating fraudulent hadith."]}, {"page": "Sharia", "response": ["Modern historians have presented alternative theories of the formation of fiqh. At first Western scholars accepted the general outlines of the traditional account. In the late 19th century, an influential revisionist hypothesis was advanced by Ignac Goldziher and elaborated by Joseph Schacht in the mid-20th century. Schacht and other scholars argued that having conquered much more populous agricultural and urban societies with already existing laws and legal needs, the initial Muslim efforts to formulate legal norms"]}, {"page": "Sunnah", "response": ["*\"precedent\" or \"way of life\" (pre-Islamic definition, Joseph Schacht and Ignác Goldziher).", "*the first letter of Abdallah ibn Ibad to Abd al-Malik ibn Marwan,discussed by Joseph Schacht, \"sur l-expression 'Sunna du Prophet'\" in Melanges d'orientalisme offerts a Henri Masse, (Tehran, 1963), 361-365", "Abū ʿAbdullāh Muhammad ibn Idrīs al-Shāfiʿī (150-204 AH), known as al-Shafi'i, argued against flexible sunnah and the use of precedents from multiple sources,Joseph Schacht, The Origins of Muhammadan Jurisprudence (Oxford, 1950, repre. 1964) esp. 6-20 and 133-137): Ignaz Goldziher, The Zahiris: Their Doctrine and their History, trans and ed. Wolfgang Behn (Leiden, 1971), 20 ff... emphasizing the final authority of a hadith of Muhammad, so that even the Qur'an was \"to be interpreted in the light of traditions (i.e. hadith), and not vice versa.\"J. SCHACHT, An Introduction to Islamic Law (1964), supra note 5, at 47 While the sunnah has often been called \"second to the Quran\", hadith has also been said to \"rule over and interpret the Quran\". "]}, {"page": "Sunni Islam", "response": ["* The two creeds of Abu l-Hasan al-Ashʿarī in his works Maqālāt al-islāmīyīnal-Ašʿarī: Kitāb Maqālāt al-islāmīyīn wa-iḫtilāf al-muṣallīn. 1963, p. 290–297. Digitalisat – Compare to the translations of Joseph Schacht: Der Islām mit Ausschluss des Qur'āns. Mohr/Siebeck, Tübingen 1931, p. 54–61. Digitalisat and Kitāb al-Ibāna ʿan uṣūl ad-diyāna.  The former is called the teaching of ahl al-ḥadīṯ wa-s-sunna, the latter as the teachings of the ahl al-ḥaqq wa-s-sunna."]}, {"page": "Ijtihad", "response": ["The increasing prominence of taqlid had at one point led most Western scholars to believe that the \"gate of ijtihad\" was in fact effectively closed around 10th century. In a 1964 monograph, which exercised considerable influence on later scholars, Joseph Schacht wrote that \"a consensus gradually established itself to the effect that from that time onwards no one could be deemed to have the necessary qualifications for independent reasoning in religious law, and that all future activity would have to be confined to the explanation, application, and, at the most, interpretation of the doctrine as it had been laid down once and for all.\"", "* An Introduction to Islamic Law by Joseph Schacht"]}]}}