{"wiki_id": "http://www.wikidata.org/entity/Q6828890", "itemLabel": "Michael Brunson", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Brunson", "wikipedia_page": {"main": "Michael John Brunson OBE (born 12 August 1940, in Norwich) is a British broadcasting political journalist of over thirty years' standing. He is a former Political Editor, Diplomatic Editor and Washington Correspondent of Independent Television News, and an occasional ITN newscaster.", "link_mentions": [{"page": "John Sergeant (journalist)", "response": ["In 2000, Sergeant joined ITN as Political Editor, replacing the retiring Michael Brunson. Sergeant retired himself in 2002 and was replaced at ITN by Nick Robinson."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Michael Brunson"]}, {"page": "ITV News", "response": ["1999 saw the biggest and largest change to news bulletins on ITV. On 8 March 1999, all ITN programmes were rebranded under the name ITV News. Under the leadership of Granada chairman Charles Allen, the channel also controversially decided to axe the flagship News at Ten bulletin. Replacing the 22:00 bulletin (and in turn the old 17:40 News at 540) as the flagship ITN programme was the ITV Evening News at 18:30 (fronted by Trevor McDonald). The ITV Nightly News was also introduced, presented by Dermot Murnaghan and airing at 23:00 every weeknight. However, the loss of News at Ten was a massive blow to both ITV and ITN. By the start of the year 2000, viewing figures for news programmes on ITV had dropped by about a million viewers due to the loss of the 22:00 bulletin. The regulating ITC ordered ITV to perform a review of the new news time slots and whether or not they were working. There was much opposition towards ITV from the viewing public, politicians such as Gerald Kaufman, former ITN faces including editor Nigel Ryan and newscaster Alastair Burnet, and some of ITN's then-current staff including political editor Michael Brunson. After a lengthy battle with the ITC, a half-hearted ITV News at Ten was introduced (hosted by McDonald) in January 2001, although as part of the agreement, the bulletin was only shown at 22:00 for three days a week to accommodate other programming. The programme returned with a massive 8 million viewers, but figures soon fell drastically. "]}, {"page": "Alastair Stewart", "response": ["He has also been a regular presence in ITV's national election coverage, co-anchoring network coverage of the general elections of 2005 (with Jonathan Dimbleby), 1997 (with Dimbleby and Michael Brunson), 1992 (with Jon Snow) and 1987 (with Alastair Burnet). He was the main anchor of Election Night Live: America Decides, ITV's through-the-night programme covering the 2008 US Presidential election."]}, {"page": "ITV Evening News", "response": ["*Michael Brunson (1980-1981)"]}, {"page": "George Gardiner (politician)", "response": ["After William Hague became Conservative party leader in June 1997, Gardiner rejoined the Conservatives. Two years later, in 1999, he published his autobiography covering mainly his years in politics, named A Bastard's Tale, a reference to Major's remark six years earlier to Michael Brunson, but it touched upon his life before becoming an MP."]}, {"page": "Political editor", "response": ["| Michael Brunson || 1986–2000 || Retired"]}, {"page": "Tom Bradby", "response": ["Bradby has worked for ITN, producer of ITV News, since 1990 when he joined the organisation as an editorial trainee. He subsequently became producer for ITV's political editor Michael Brunson in 1992."]}, {"page": "Brunson", "response": ["*Michael Brunson, political journalist"]}, {"page": "Hot mic", "response": ["*In 1993 British Prime Minister John Major, after an interview with ITN political editor Michael Brunson, forgot about the recording equipment.  He said it was pointless expelling Eurosceptic Cabinet members as \"we don't want another three more of the bastards out there.\"BBC News.  29 January 2001. \"Curse of the open mic\" "]}, {"page": "Category talk:British journalists", "response": ["Michael Brunsonnot yet classified"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Tom Bradby – ITV News political editor, July 2005 – October 2015; joined ITN as an editorial trainee in 1990 and subsequently became producer for Michael Brunson, ITN's political editor, in 1992; Ireland correspondent 1993–1996; Asia correspondent 1999–2001; then Royal correspondent for ITV News; subsequently became UK editor before taking up the post of political editor; gave up his position as political editor in October 2015 to become sole anchor of ITV News at Ten", "* Michael Brunson – Washington correspondent and diplomatic editor of ITN; best known for serving as the political editor between 1986 and 2000 and as an occasional ITN newscaster.."]}, {"page": "Premiership of John Major", "response": ["The following day Major gave an interview to ITN's Michael Brunson. During an unguarded moment when Major thought that the microphones had been switched off, Brunson asked why he did not sack the ministers who were conspiring against him. He replied: \"Just think it through from my perspective. You are the Prime Minister, with a majority of 18 ... where do you think most of the poison is coming from? From the dispossessed and the never-possessed. Do we want three more of the bastards out there? What's Lyndon B. Johnson's maxim?\" Major later said that he had picked the number three from the air and that he was referring to \"former ministers who had left the government and begun to create havoc with their anti-European activities\", but many journalists suggested that the three were Peter Lilley, Michael Portillo and Michael Howard, three of the more prominent Eurosceptics within his Cabinet. Throughout the rest of Major's time as Prime Minister the exact identity of the three was blurred, with John Redwood's name frequently appearing in a list along with two of the others. The tape of this conversation was leaked to the Daily Mirror and widely reported, embarrassing Major and further inflaming tensions within the Conservative Party."]}, {"page": "1993 in British television", "response": ["*23 July – Prime Minister John Major gives an interview to ITN journalist Michael Brunson after his government wins a vote of confidence in the House of Commons earlier in the day. During an unguarded moment following the interview, and while still being recorded, Major refers to some of his cabinet colleagues as \"Bastards\". The incident, which becomes known in the media as \"Bastardgate\", prompts the tabloid newspapers Daily Mirror and The Sun to set up telephone lines with recordings of the conversation that readers are invited to call. Both newspapers are warned to discontinue the lines by the regulatory body, the Independent Committee for the Supervision of Standards of Telephone Information Services because it feels that broadcasting the off-air conversation is a breach of privacy."]}, {"page": "List of people educated at Bedford School", "response": ["*Michael Brunson OBE (born 1940), ITN Political Editor, Diplomatic Editor and Washington CorrespondentDe-la-Noy, p.155"]}, {"page": "Brunson, Michael", "response": ["#redirectMichael Brunson"]}]}}