{"wiki_id": "http://www.wikidata.org/entity/Q6829581", "itemLabel": "Michael Cummings", "itemDescription": "cartoonist (1919-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Cummings", "wikipedia_page": {"main": "Arthur Stuart Michael Cummings OBE (born Leeds, Yorkshire, 1 June 1919, died London, 9 October 1997) was a British newspaper cartoonist. He was known as Michael Cummings and signed his work simply Cummings.", "link_mentions": [{"page": "Holt, Norfolk", "response": ["The school's former pupils include Benjamin Britten, W. H. Auden, Lord Reith, Sir Alan Lloyd Hodgkin, President Erskine Childers, Sir Christopher Cockerell, Donald Maclean, Sir Lennox Berkeley, Sir Stephen Spender, Richard Hand, Tom Wintringham, Sir James Dyson, Ralph Firman, Sir Peter Brook, Paddy O'Connell, Sebastian Shaw, Olivia Colman, Sienna Guillory, John Tusa, Tom Youngs and Michael Cummings."]}, {"page": "Chelsea College of Arts", "response": ["* Michael Cummings (cartoonist)"]}, {"page": "List of editorial cartoonists", "response": ["* Michael Cummings, Daily Express"]}, {"page": "Cummings arthur stuart michael", "response": ["#REDIRECT Michael Cummings"]}, {"page": "List of Old Greshamians", "response": ["*Michael Cummings – cartoonist"]}, {"page": "Arthur Stuart Michael Cummings", "response": ["#REDIRECT Michael Cummings"]}, {"page": "James Kinlay", "response": ["As features editor he worked with celebrated cartoonists Carl Giles and Michael Cummings and interviewed many of the leading political figures of the day, including Reginald Maudling, Alec Douglas-Home and Harold Wilson."]}, {"page": "Aircraft Recognition (magazine)", "response": ["In each issue there was a variety of tests; regular types included \"Flying photographs\" - series of pictures of aircraft in flight, and \"Sillographs\" - solid silhouettes of (normally) threequarter views. Other tests included series of photos taken from a particular aspect e.g. from behind, or \"On the spot\" - small head on photos of one Allies and one Axis aircraft challenging the reader to differentiate friend from foe. A regular contributor to most issues was the cartoonist Michael Cummings who continued the style of Wren's \"Oddentifications\" by submitting recognition tests in the form of cartoons and caricatures. Other contributors included Charles Gibbs-Smith and Russell Brockbank. High quality photos were used wherever possible using photographers from the RAF Film Production Unit based at RAF Benson."]}, {"page": "1983 Birthday Honours", "response": ["*Arthur Stuart Michael Cummings, Cartoonist, Daily Express and Sunday Express Newspapers. "]}, {"page": "Cummings (surname)", "response": ["*Michael Cummings (1919–1997), English cartoonist"]}, {"page": "List of fictional British politicians", "response": ["* Zilliboy Shinbags MP – Labour Party caricature in Michael Cummings political cartoons"]}, {"page": "Deaths in October 1997", "response": ["*Michael Cummings, 78, British newspaper cartoonist.Gifford, Dennis, \"Obituary: Michael Cummings\", The Independent. 11 October 1997. Retrieved 15 June 2020. "]}, {"page": "Cummings, Michael", "response": ["#redirectMichael Cummings"]}]}}