{"wiki_id": "http://www.wikidata.org/entity/Q6829677", "itemLabel": "Michael D. Willis", "itemDescription": "British indologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_D._Willis", "wikipedia_page": {"main": "Michael Willis is an Indologist and historian based in London, England. \nBorn in Vancouver, British Columbia and raised in Kuwait and Saudi Arabia, Willis took his B.A. degree at the University of Victoria where he studied with Siri Gunasinghe and Alan Gowans. Travelling to the University of Chicago, he studied with J. A. B. van Buitenen and Pramod Chandra, receiving his doctoral degree in 1988 after periods in India and Cyprus. He joined the British Museum in 1994 after teaching at SUNY New Paltz. He was the curator of the early south Asian and Himalayan collections in the Department of Asia at the museum from 1994 until 2014 at which time he became Corresponding Principal Investigator of Beyond Boundaries, a research project funded by the European Research Council.  That project generated a number of outputs, including The South Asia Inscriptions Database. The project ended in 2020.\nWillis's main research interest has been the cultural, political and religious history of  India from the fifth to the sixteenth centuries. He has published on the inscriptions of central India and its early temple architecture. After that, Willis turned his attention to the Gupta dynasty, publishing a monograph on Hindu ritual and the development of temples as land-holding institutions, The Archaeology of Hindu Ritual (2009).Willis has also researched the Buddhist history of India and produced a catalogue of reliquaries and related materials in the British Museum and Victoria and Albert Museum. Concurrently Willis developed an interest in Tibet and published a popular book on the subject.  More recently he has been involved in a study of the Testament of Ba, producing a text and translation of the earliest surviving manuscript.\n\n", "link_mentions": [{"page": "Royal Asiatic Society of Great Britain and Ireland", "response": ["By the 1870s, the post-nominal letters FRAS, indicating fellowship of the society, were being used by some members, including the physician and writer on India John Forbes Watson, and the writer on India and co-founder of the India Reform Society John Dickinson. This usage continued through the twentieth century,Journal and Proceedings of the Asiatic Society of Bengal, vol. 16, Asiatic Society, 1921, pp. x, 40, 164The Journal of the Ceylon Branch of the Royal Asiatic Society of Great Britain and Ireland, New Series, Vol. 5, Part 1, 1957, p. 141 advertisements in the Society's Journal also reflecting the use of the letters FRAS by some members, although all members of the society were referred to as \"members\" in the 1908 constitution, and it was not until 1967 that reports of the Anniversary Meeting referred to \"fellows\" rather than \"members\". , members are designated \"fellows\" or \"student fellows\"; no post-nominals are assigned by the society to these grades in its regulations, but the use of the post-nominal letters FRAS is recognized in numerous reference works. The post-nominal letters are used by some academics working in Asia-related fields, and have been used in the society's journal in reference to the Indologist Dr Michael D. Willis,https://www.cambridge.org/core/services/aop-cambridge-core/content/view/D8226AE8CFB624D6AAD3066D64625010/S1356186312000090a.pdf/editors_foreword.pdf  and to the poet and translator of Bengali Dr William Radice and the Islamic scholar Leonard Lewisohn."]}, {"page": "Indology", "response": ["* Michael D. Willis (The British Museum)"]}, {"page": "Charles Stuart (East India Company officer)", "response": ["His remarkable collection of antiquities forms the basis of the British Museum's ancient Hindu and Buddhist sculpture collection from the Indian subcontinent, now known as the Bridge Collection.See Michael D. Willis, 'Sculpture of India' in A. W. Franks: Nineteenth-century collecting and the British Museum, ed. M. Caygill and J. Cherry (London: British Museum Press, 1997), pp. 250–61. British Museum Collection"]}, {"page": "Early Indian epigraphy", "response": ["The inscription is of considerable importance for the history of the Gupta Empire, because it is the last known record of the later Gupta king Budhagupta.Michael D. Willis, \"Later Gupta History: Inscriptions, Coins and Historical Ideology,\" Journal of the Royal Asiatic Society of Great Britain & Ireland 15.2 (2005), p. 142. Available online: https://www.academia.edu/2057745/Later_Gupta_History_Inscriptions_Coins_and_Historical_Ideology. Moreover, it provides a secure date for Harivarman, the first recorded king of the Maukhari dynasty according to the Asīrgarh seal.Michael D. Willis, \"Later Gupta History: Inscriptions, Coins and Historical Ideology,\" Journal of the Royal Asiatic Society of Great Britain & Ireland 15.2 (2005), p. 148. Available online: https://www.academia.edu/2057745/Later_Gupta_History_Inscriptions_Coins_and_Historical_Ideology."]}, {"page": "Asia-Europe Museum Network", "response": ["*Michael D. Willis, Curator, Department of Asia, British Museum, London (Deputy Chair)"]}, {"page": "List of architectural historians", "response": ["* Michael D. Willis (born 1951), early temple architecture of central India.Willis,Inscriptions of Gopakṣetra (London, 1996) and Willis, Temples of Gopakṣetra (London, 1997)."]}, {"page": "The Archaeology of Hindu Ritual", "response": ["The Archaeology of Hindu Ritual: Temples and the Establishment of the Gods is an archaeological study focusing on the early development of Hinduism within the Gupta Empire between the 4th and 6th centuries CE. Written by the British archaeologist Michael D. Willis, curator of the South Asian and Himalayan collection at the British Museum, it was published by Cambridge University Press in 2009."]}, {"page": "Gwalior inscription of Mihirakula", "response": ["The inscription was found by Cunningham, who published it in 1861. Rajendralala Mitra published its first interpretation and translation in 1862. At this time, nine lines of text were extant on the broken slab. The inscription was damaged, with first 2-3 characters of every line lost. After its discovery, more lines were lost before the slab was removed and shifted to the Imperial Museum at Calcutta (Indian Museum, Kolkata). Now only seven lines can be studied. John Faithfull Fleet published an interpolated version of this inscription, and a translation of the reconstructed inscription in 1888.J. F. Fleet, Inscriptions of the Gupta Kings and their Successors, Corpus Inscriptionum Indicarum, vol. 3 (Calcutta, 1888), pp. 161-164,  It was subsequently noted by Bhandarkar, Garde, Dvivedī and Willis in their respective epigraphic lists.Bhandarkar, Epigraphica Indica 19-23 (1927-36): appendix, number 1869, 2109; Gwalior State, Archaeological Report for VS 1986/AD 1929-30: number 43; Dvivedī, Gvāliyar rājye ke abhilekh (VS 2004): number 616; Michael D. Willis, Inscriptions of Gopakṣetra (London, 1996). An edition was published by D. C. Sircar in his Select Inscriptions.Sircar, Select Inscriptions Bearing on Indian History, pp. 424-26."]}, {"page": "Pawāyā Gupta image inscription", "response": ["The inscription was first published by M. B. Garde in 1914-15. It was subsequently listed by H. N. DvivedI and M. Willis.Gwalior State, Archaeological Report for VS 1971/AD 1914-15, number 31; ; Dvivedī, Gvāliyar rājye ke abhilekh (VS 2004): number 711; Michael D. Willis, Inscriptions of Gopakṣetra (London, 1996)."]}, {"page": "Tumain inscription of Kumāragupta", "response": ["The inscription was first published by M. B. Garde in 1918-19. It was subsequently listed by Bhandarkar and M. Willis.GAR (VS 1975/AD 1918-19): number 65; Bhandarkar, EI 19-23 (1927-36): appendix, number 1269; Michael D. Willis, Inscriptions of Gopakṣetra (London, 1996). An edition with translation was published in Epigraphia Indica in 1941-42.EI 26 (1941-42): 115. A second edition appeared in the revised edition of Corpus Inscriptionum Indicarum, volume 3, published in 1981.CII 3 (1981): 276."]}, {"page": "Naderī satī stone inscription", "response": ["The inscription has been noted by M. B. Garde, H. N. Dvivedī and M. Willis in their respective epigraphic lists.Gwalior State, Archaeological Report for VS 1981/AD 1924-25: number 25; Dvivedī, Gvāliyar rājye ke abhilekh (VS 2004): number 737; Michael D. Willis, Inscriptions of Gopakṣetra (London, 1996)."]}, {"page": "Katni copper-plate of Jayanātha", "response": ["The donees are individually named as is their caste affiliation: brāhmaṇa, kṣatriya, vaiśya or śūdra. This is one of the first inscriptions in India to specifically list the four varṇa-s. The implications of this are explored by Michael Willis in his book The Archaeology of Hindu Ritual.Michael D. Willis, The Archaeology of Hindu Ritual (Cambridge, 2009), p. 378. Partly available online: http://www.cambridge.org/gb/knowledge/isbn/item2427416/?site_locale=en_GB"]}, {"page": "Gangadhar Stone Inscription of Viśvavarman", "response": ["The Gangadhar inscription is important for the history of Indian religion because, in the description of the Mother goddess shrine, it provides the first documented use of the term ḍakinī, a type of female celestial being that comes to plays a prominent protective role Tantric Buddhism.David N. Lorenzen, Who Invented Hinduism: Essays on Religion in History (Delhi, 2006), p. 72. The description of the goddesses has also prompted debate because it appears, at first glance, to give the oldest description of a Tantric temple. The discussion of the word tantra in the record has been summarised by David Lorenzen.David N. Lorenzen, Who Invented Hinduism: Essays on Religion in History (Delhi, 2006), p. 71-72. These interpretations were revisited by Bruce M. Sullivan who noted: \"To me, it makes a lot more sense to take it in the usual meaning for tāntra, namely, stringed instrument. Thus, we get the climatic effects mentioned in the inscription being caused by music (accompanied by booming clouds), not by “magic rites” (Fleet) nor by tantric texts (Lorenzen).\"Bruce M. Sullivan, \"Tantroid Phenomena in Early Indic Literature: An Essay in Honor of Jim Sanford.\" Pacific World 8 (2006): p. 12. The article may be downloaded here: https://nau.academia.edu/BruceSullivan. Responding indirectly to Sullivan's call for the inscription to be studied closely, Michael Willis noted that the word given is tāntra rather than tantra.Michael D. Willis, The Archaeology of Hindu Ritual (Cambridge, 2009), chapter 3, note 61. Following André Padoux,André Padoux, ‘What do we mean by Tantrism?’, in Roots of Tantra, edited by K. A. Harper and Robert L. Brown (Albany, 2002), p. 17. Willis remarked that \"... the word tāntra in the inscription has little to do with occidental Tantrism but rather with a stringed musical instrument, i.e. an object on which the strings are ‘stretched’ (√tan) across a curved frame.\" He thus re-edited and re-translated the relevant verse as follows:"]}, {"page": "Bedesten, Nicosia", "response": ["The earliest history of the Bedesten is documented archaeologically by a Byzantine basilica, fragments of which are preserved inside the current building. These remains, which share some structural features with Afendrika and Ayios Philon, possibly date to the sixth century.See Michael D. Willis, \"Byzantine Beginnings,\" Κυπριακαί Σπουδαί 50 (1986): 185-92, available online: WILLIS, Michael. (1986). Byzantine Beginnings of the Bedesten. Κυπριακαί Σπουδαί, 50, 185–192. http://doi.org/10.5281/zenodo.265185. T. C. Papacostas has identified these remains as marking the site of the first cathedral of Saint Sophia in Nicosia.T. C. Papacostas, \"In search of a lost Byzantine monument: Saint Sophia of Nicosia,\" επετηρίδα του κέντρου επιστημονικών ερευνών 31 (2005): 11-37. Available online here: https://kcl.academia.edu/TassosPapacostas", "Under the Lusignan kings the subsequent history of the building is not well documented, but some historians, including Camille Enlart, proposed that after the fall of Acre in the late twelfth century, English monks who were followers of Thomas Becket established a new Latin church on this site and dedicated it to Saint Nicholas. This reading of the sources is not, however, universally accepted in view of the minor role played by the Knights of Saint Thomas in the history of the Latin east.The case rejected in Michael D. Willis, \"Byzantine Beginnings,\" Κυπριακαί Σπουδαί 50 (1987): 192; the general assessment of the order's signficiance P. W. Edbury, The Kingdom of Cyprus and the Crusades, 1191-1374 (Cambridge: Cambridge University Press, 1991): 79. With the adjacent cathedral dedicated to the Latin rite, the Bedesten probably continued to serve an Orthodox role. The church was expanded several times and rebuilt during the fourteenth and the fifteenth centuries, but the old Byzantine apse was retained."]}, {"page": "Larnaca Tympanum", "response": ["The sculpture was found in the 1870s when foundations were being excavated for a house at Larnaca.The first detailed account of the discovery and the provenance is found in Michael D. Willis, \"The Larnaca Tympanum,\" Κυπριακαι σπουδαι 45 (May 1981): 15-28. Subsequently it was acquired by Alessandro Palma di Cesnola, and given to his father-in-law, Edwin Henry Lawrence, in lieu of his financial support of Cesnola's collections.For Cesnola's biography, see British Museum website: https://www.britishmuseum.org/research/search_the_collection_database/term_details.aspx?bioId=170720 Retrieved June 2016 On 27 April 1892, Augustus Pitt Rivers purchased the sculpture at auction and transferred it to his private museum in Dorset.For the records, now at Oxford, see http://web.prm.ox.ac.uk/rpr/index.php/object-biography-index/7-farnhamcollection/776-tympanum-from-cyprus/ Retrieved June, 2016. Most of the collection was moved to Oxford to found the Pitt Rivers Museum. The tympanum, however, remained in Dorset and was sold in the 1980s to the V&A. After the sculpture was acquired by the V&A, it was published in a catalogue by Paul Williamson, one time Keeper of Sculpture, Director of Collections and Acting Deputy Director of that museum.Paul Williamson (ed.), European Sculpture at the Victoria and Albert Museum (London, 1996): 49 The sculpture is currently on public exhibition in the medieval galleries at the V&A.", "George Hill published the sculpture in his History of Cyprus and saw in it \"a work of the Frankish period combining, in true Cypriote fashion, a Byzantine scheme with late details. The fifteenth century seem the most probably date.\"George Hill, A History of Cyprus, 4 vols. (Cambridge: University Press, 1940-52) 4: 1137, plate XVIII This view was reassessed by Michael D. Willis who compared the sculpture to work in Tuscany and assigned the piece to early part of the thirteenth century.Michael D. Willis, \"The Larnaca Tympanum,\" Κυπριακαι σπουδαι 45 (May 1981): 15-28. This date is cited and endorsed by Paul Williamson.Paul Williamson (ed.), European Sculpture at the Victoria and Albert Museum (London, 1996): 49. The V&A continues to date the sculpture between 1210 and 1230.https://collections.vam.ac.uk/item/O94070/the-larnaca-tympanum-tympanum-unknown/ Retrieved June 2106."]}, {"page": "Iron pillar of Delhi", "response": ["Due to the tablets installed on the building in 1903 by Pandit Banke Rai, the reading provided by him enjoys wide currency. However, Bankelal's reading and interpretation have been challenged by more recent scholarship. The inscription has been revisited by Michael Willis in his book Archaeology of Hindu Ritual, his special concern being the nature of the king's spiritual identity after death. His reading and translation of verse 2 is as follows:Michael D. Willis, The Archaeology of Hindu Ritual (Cambridge, 2009): chapter 3.", "Based on paleographic similarity to the dated inscriptions from Udayagiri, the Gupta-era iconography, analysis of metallurgy and other evidence, Meera Dass and R. Balasubramaniam (2004) theorized that the iron pillar was originally erected at Udayagiri.Identity of Chandra and Vishnupadagiri of the Delhi Iron Pillar Inscription: Numismatic, Archaeological and Literary Evidence, R Balasubramaniam, Bulletin of Metals Museum, 32 (2000) 42–64. According to them, the pillar, with a wheel or discus at the top, was originally located at the Udayagiri Caves.On the Astronomical Significance of the Delhi Iron Pillar, R Balasubramaniam and Meera I Dass, Current Science, volume 86 (2004) pp. 1134–1142. This conclusion was partly based on the fact that the inscription mentions Vishnupada-giri (IAST: Viṣṇupadagiri, meaning \"hill with footprint of Viṣṇu\"). This conclusion was endorsed and elaborated by Michael Willis in his Archaeology of Hindu Ritual, published in 2009.Michael D. Willis, The Archaeology of Hindu Ritual (Cambridge, 2009). Partly available online, see http://www.cambridge.org/gb/knowledge/isbn/item2427416/?site_locale=en_GB"]}]}}