{"wiki_id": "http://www.wikidata.org/entity/Q6828065", "itemLabel": "Michael A. Hoey", "itemDescription": "British author, writer, and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_A._Hoey", "wikipedia_page": {"main": "Michael A. Hoey  (1934 – 17 August 2014) was a British author and film and television writer, director, and producer. He was the son of Dennis Hoey, who played Inspector Lestrade in Universal's Sherlock Holmes series.\n\n", "link_mentions": [{"page": "Primetime Emmy Award for Outstanding Main Title Design", "response": ["| Michael Levine and Michael A. Hoey, graphic designers"]}, {"page": "Stay Away, Joe", "response": ["Presley was paid $850,000 plus 40% of the profits.Michael A. Hoey, Elvis' Favorite Director: The Amazing 52-Film Career of Norman Taurog, Bear Manor Media 2013"]}, {"page": "Live a Little, Love a Little", "response": ["Presley was paid $850,000 plus 50% of the profits.Michael A. Hoey, Elvis' Favorite Director: The Amazing 52-Film Career of Norman Taurog, Bear Manor Media 2013"]}, {"page": "Class of '44", "response": ["*Michael A. Hoey……….2nd Proctor"]}, {"page": "The Chapman Report", "response": ["After a screening at San Francisco where Cukor claimed the audience liked the film, the studio recut the film.p.63 Long, Robert Emmet George Cukor: Interviews 2001 Univ of Mississippi Press At the Legion of Decency's insistence, Jack Warner had Michael A. Hoey reedit the film and wrote a different ending with Zimbalist and Duggan saying that American women were rather normal sexually, a message at odds with the rest of Cukor's film. A different director was brought in to reshoot it. Cukor said of Bloom: \"Claire is not a nice Nellie. She has no inhibitions, and she is not as cold as some people say\"."]}, {"page": "List of American films of 1966", "response": ["| The Navy vs. the Night Monsters || Michael A. Hoey || Mamie van Doren, Anthony Eisley, Edward Faulkner || Sci-fi || Realart"]}, {"page": "List of science fiction films of the 1960s", "response": ["|The Navy vs. the Night Monsters||Michael A. Hoey||Mamie Van Doren, Anthony Eisley, Billy Gray||United States||"]}, {"page": "Palm Springs Weekend", "response": ["In June 1962, Warner gave the job of producing to Michael A. Hoey, who had never produced before, but had impressed Warner through his work as an editor at the studio over four years, most recently The Chapman Report. The studio signed Hoey to a contract as producer and Palm Springs Weekend was going to be his first movie."]}, {"page": "List of awards and nominations received by Fame (1982 TV series)", "response": ["*1982: Best Edited Episode - TV Series (Michael A. Hoey for \"Passing Grade\", nominated)"]}, {"page": "Dennis Hoey", "response": ["Issue No. 45 of \"Films of the Golden Age\" magazine features an interview with Hoey's son Michael A. Hoey (1934–2014), who extensively discusses Dennis Hoey's early life, career, marriages and death. In his book, \"Elvis, Sherlock and Me: How I Survived Growing Up in Hollywood\" (Bear Manor Media-2007) he discusses his father's career and their sometimes turbulent relationship."]}, {"page": "The Navy vs. the Night Monsters", "response": ["The Navy vs. the Night Monsters (a.k.a. Monsters of the Night and The Night Crawlers) is a 1966 independently made American science fiction-monster film drama produced by Jack Broder (and Roger Corman, uncredited), written and directed by Michael A. Hoey, that stars Mamie Van Doren, Anthony Eisley, Billy Gray, Bobby Van and Pamela Mason. The film was distributed by Realart Pictures Inc."]}, {"page": "Michael Hoey", "response": ["* Michael A. Hoey (1934–2014), British author and film and television writer, director, and producer"]}, {"page": "List of horror films of 1966", "response": ["| Michael A. Hoey || Mamie Van Doren, Anthony Eisley, Biff Elliot || United States || "]}, {"page": "List of Dallas (1978 TV series) crew members", "response": ["* Michael A. Hoey (Season 9)"]}, {"page": "Jack Murray (film editor)", "response": ["The period of Murray's collaboration with Ford after 1947 has been summarized by Tag Gallagher as one \"distinguished by the vitality of its invention, at every level of cinema, but with particular intensity in montage, motion, and music.\" The term \"montage\" refers to the editing of these films. While the individual contributions of Ford and of Murray to the editing of the theatrical release versions of these films aren't well known, Murray was responsible for the first, editor's cuts. Ford rarely set foot in the cutting room. Michael A. Hoey worked as Murray's assistant on Sergeant Rutledge (1960). His memoir suggests that Ford did largely entrust the editing of his films to Murray; Hoey writes of the screening of Murray's cut for Ford that it \"... went well with surprisingly few notes, but after all Jack Murray had been editing John Ford's films since 1936's The Prisoner of Shark Island and knew the Old Man's taste better than he did himself.\""]}, {"page": "2014 in the United Kingdom", "response": ["**Michael A. Hoey, 79, producer, director and screenwriter."]}, {"page": "Scott Allen Nollen", "response": ["Nollen's literary collaborators include science-fiction legend Ray Bradbury, author-filmmakers Nicholas Meyer and Michael A. Hoey (son of actor Dennis Hoey), British musicians Ian Anderson and Dave Pegg, R&B singer Ruth Pointer, celebrity offspring Dame Jean Conan Doyle (Sir Arthur Conan Doyle), Sara Jane Karloff (Boris Karloff) and Chris Costello (Lou Costello), and film historians Paul M. Jensen and Gregory William Mank.content"]}, {"page": "Deaths in August 2014", "response": ["*Michael A. Hoey, 79, British producer, director and screenwriter (Fame, Falcon Crest).Michael A. Hoey, Producer, Director and Elvis Screenwriter, Dies at 79"]}, {"page": "David De Silva", "response": ["In 1976, De Silva began working on a project based on the lives of students at the New York High School of Performing Arts. Screenwriter Christopher Gore said that he was inspired to write Fame after \"seeing a performance of A Chorus Line and hearing one of the characters speak about attending the High School of Performing Arts.\"Michael A. Hoey|title=Inside Fame on Television: A Behind-the-Scenes History p.9|date=January 4, 2010|publisher=McFarland & Company and according to director Alan Parker, De Silva had the idea for the project after attending a stage production of the same play and hearing a reference to the school in the song \"Nothing\", though De Silva himself disputes this account.Hoey, Michael, A. (January 4, 2010). \"1. How It All Began\". Inside Fame on Television: A Behind-the-Scenes History.p.10 United States: McFarland & Company In 1977, De Silva met playwright Christopher Gore in Fort Lauderdale, Florida. He paid Gore $5,000 to work with him on a draft script titled Hot Lunch, and provided ideas for characters and the structure of the story, following the characters from the audition stage through to graduation from the school. De Silva and Gore later signed with the Creative Artists Agency to sell it. The script became the subject of a bidding war among a host of established film studios before De Silva took the project to Metro-Goldwyn-Mayer (MGM), which acquired the script for $400,000, and gave De Silva a list of ten directors they would approve for the project, from which he chose Alan Parker.Inside Fame on Television: A Behind-the-Scenes History.p.11 United States: McFarland & Company"]}, {"page": "American Cinema Editors Award for Best Edited Drama Series for Non-Commercial Television", "response": ["| Michael A. Hoey"]}, {"page": "American Cinema Editors Award for Best Edited Drama Series for Commercial Television", "response": ["| Michael A. Hoey"]}, {"page": "American Cinema Editors Award for Best Edited Comedy Series for Non-Commercial Television", "response": ["| Michael A. Hoey"]}, {"page": "American Cinema Editors Award for Best Edited Comedy Series for Commercial Television", "response": ["| Michael A. Hoey"]}]}}