{"wiki_id": "http://www.wikidata.org/entity/Q6828302", "itemLabel": "Michael Audreson", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Audreson", "wikipedia_page": {"main": "Michael Audreson (born 1 August 1956) is a British actor who appeared in films and television shows in the 1960s. He was in the 12-episode Children's Film Foundation series The Magnificent Six and a Half before playing the bespectacled \"Brains\" in Here Come the Double Deckers (1970–71). In the film Young Winston (1971) he played Winston Churchill as a schoolboy.As the 1970s progressed, Audreson had a role in two episodes of The Tomorrow People (1978) television series.Audreson wrote and directed two short films: The Man Who Could Read Minds (1999) and Eve Buckingham (2001) starring Susan Hampshire. His feature film The 10 Arenas of Marwood (2010), which he wrote and directed, starred Judi Bowker, John Hasler, Kate G. Laycy, Michael Mayne, Bryan Murray, Lucy Russell, Issy Van Randwyck, Emma Williams and Peter Wickham as Marwood.\nHe founded a media production and distribution company, 10am Media. Its first project is called A Series of Elephants.", "link_mentions": [{"page": "Bryan Murray (actor)", "response": ["|Michael Audreson"]}, {"page": "Here Come the Double Deckers", "response": ["Some of the cast were unknown, though Melvyn Hayes was an established adult actor, Gillian Bailey was fairly experienced for a child actor and both Brinsley Forde and Michael Audreson had appeared in The Magnificent Six and a Half, a series of Children's Film Foundation films on which the Double Deckers were based. Hayes also wrote the episode \"Man's Best Friend\", co-wrote the episode \"Get a Movie On!\", co-wrote the series' theme song, and acted as a dialogue coach for the series. Bailey is now head of the drama department at Royal Holloway, University of London. Peter Firth has gone on to a prominent acting career, appearing in Equus, The Hunt for Red October, Tess, Pearl Harbor and Spooks (known in some territories as MI-5). Co-star Brinsley Forde later became the lead singer in Aswad.", "* Michael Audreson - Brains, the gang's resident science geek.", "In the United Kingdom, Here Come the Double Deckers was released in November 2010 by Second Sight as a two-disc Region 2 DVD set containing all 17 episodes. All the episodes are presented as originally broadcast. The set also includes a special feature, Double Decker Memories, featuring interviews with Brinsley Forde and Michael Audreson.", "Prior to Here Come the Double Deckers, Century Films produced a film serial for the Children's Film Foundation called The Magnificent Six and 1/2. The series was very similar to the Double Deckers, and essentially acted as a blueprint for the latter. Like the Double Deckers, Six and a Half centred on the adventures of seven children, who had similar personalities to the characters in Double Deckers. Many of the crew members from the Six and a Half series also worked on the Double Deckers, including producer Roy Simpson, director and writer Harry Booth, writer Glyn Jones, and choreographer Arnold Taraborrelli (who designed the title cards for Six and a Half). In addition, future Double Deckers cast members Brinsley Forde and Michael Audreson were among the stars of Six and a Half, and Melvyn Hayes appeared in a few episodes. Six and a Half also featured several gags and plotlines that would later be reused in Double Deckers."]}, {"page": "List of British former child actors", "response": ["*Michael Audreson (born 1956)"]}, {"page": "List of The Tomorrow People serials", "response": ["| colspan=\"5\" | Guest Cast: Olu Jacobs (General Papa Minn), Michael Audreson (Flynn), Jackie Cowper (Sula), Eric Roberts (Major Marcos), David Graham (The Puppet Voices)"]}, {"page": "The Magnificent Six and 1/2", "response": ["The first series of The Magnificent Six and 1/2 starred Len Jones as the group's leader, Steve, Brinsley Forde as prankster Toby, Suzanne Togni as tomboy Liz, Ian Ellis as rather large Dumbo, Michael Audreson as the clever Whizz, Lionel Hawkes as the always hungry Stodger, and Kim Tallmadge as tag-a-long Peewee (the \"1/2\" in the serial's title). In the first episode, \"Ghosts and Ghoulies\", the rest of the gang meet Whizz and his little sister Peewee for the first time. Whizz and Peewee are allowed to join the gang if they spend the night in a haunted house. Produced by Century Films with Roy Simpson and directed by Harry Booth, the series debuted in February 1968.", "* Michael Audreson as Whizz", "* Michael Audreson as Whizz", "20th Century Fox wanted a completely different cast for the television series, rather than the same cast from the \"Six and 1/2\" series, but nevertheless, both Brinsley Forde and Michael Audreson starred in the series. The Double Deckers made its American premiere on 12 September 1970, and its United Kingdom premiere on 8 January 1971. The series lasted a total of seventeen episodes."]}, {"page": "List of films and television shows shot at Elstree Studios", "response": ["| Here Come the Double Deckers || Comedy || 20th Century Fox, David Gerber Productions || 1 || 17 || 1970—1971 || Harry Booth || Michael Audreson, Gillian Bailey, Peter Firth, Brinsley Forde, Douglas Simmonds, Bruce Clark, Debbie Russ"]}, {"page": "Audreson, Michael", "response": ["#redirectMichael Audreson"]}]}}