{"wiki_id": "http://www.wikidata.org/entity/Q6829364", "itemLabel": "Michael Colivet", "itemDescription": "Irish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Colivet", "wikipedia_page": {"main": "Michael Colivet (29 March 1882 – 4 May 1955) was an Irish Sinn Féin politician. He was Commander of the Irish Volunteers in Limerick during the 1916 Easter Rising, and was elected to the First Dáil.", "link_mentions": [{"page": "1955 in Ireland", "response": ["* 4 May – Michael Colivet, manager Shannon Foundry, member of 1st Dáil (Anti Treaty), representing Limerick (born in 1882)."]}, {"page": "List of Limerick people", "response": ["*Michael Colivet, Irish rebel, Commandant of 1916 Rising in Limerick and first TD for Limerick in Dáil Éireann"]}, {"page": "Limerick City (UK Parliament constituency)", "response": ["| Michael Colivet"]}, {"page": "List of Sinn Féin MPs", "response": ["| Michael Colivet"]}, {"page": "Irish republican legitimism", "response": ["*Michael Colivet - did not join Fianna Fáil as he refused to take the Oath of Allegiance"]}, {"page": "St Joseph's Patrician College", "response": ["*Michael Colivet (29 March 1882 – 4 May 1955) was a Sinn Féin politician. He was elected TD for Limerick City, a founding member of the Irish Republic, and elected to the First Dail."]}, {"page": "Mount Jerome Cemetery and Crematorium", "response": ["*Michael Colivet (1882–1955), Irish politician, Commandant of the Irish Volunteers for Limerick City, a founding member of the Irish Republic and, in later years, Chairman of the National Housing Board."]}, {"page": "Anglo-Irish Treaty Dáil vote", "response": ["|Michael Colivet"]}, {"page": "Michael Collivet", "response": ["#REDIRECT Michael Colivet"]}, {"page": "Cornelius McNamara", "response": ["In October 1915, he enlisted in \"C\" Company Limerick City Battalion under Michael Colivet, and was present at Killonan with the rest of his battalion during the Easter Rising, but after hearing word that the Rising was called off, the battalion marched back to Limerick. Soon after, the Battalion split and he then joined \"A\" Company of the newly formed Second Battalion.Witness Statement 1710 of Liam Forde His home then became the battalion dispatch centre and he was admitted to the ranks of the Irish Republican Brotherhood. In November 1918 he was promoted to first Lieutenant."]}, {"page": "Michael Joyce (Irish politician)", "response": ["In 1899, Joyce was elected to Limerick Corporation and stood for election to Parliament at the 1900 general election as a candidate for the Irish Parliamentary Party, defeating the Unionist candidate Francis Kearney by 2521 votes to 474. Joyce served as an MP until 1918. Although intending to run in the 1918 general election, he eventually decided not to seek re-election and was succeeded by the Sinn Féin candidate Michael Colivet, who was elected unopposed."]}, {"page": "List of members of the Oireachtas imprisoned during the Irish revolutionary period", "response": ["| Michael Colivet"]}, {"page": "Colivet, Michael", "response": ["#redirectMichael Colivet"]}]}}