{"wiki_id": "http://www.wikidata.org/entity/Q6829062", "itemLabel": "Michael Caines", "itemDescription": "British chef", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Caines", "wikipedia_page": {"main": "Michael Andrew Caines  (born 3 January 1969) is an English chef born in Exeter, Devon.\nHe was head chef of Gidleigh Park in Devon until January 2016. He is currently the executive chef of the Lympstone Manor hotel between Exeter and Exmouth.", "link_mentions": [{"page": "Rick Stein", "response": ["On 22 June 2020, it was confirmed that Stein's restaurant in Porthleven, Cornwall would close permanently due to the COVID-19 pandemic. The restaurant had been closed since March 2020. In July it was announced that chef Michael Caines would take over the restaurant."]}, {"page": "Raymond Blanc", "response": ["Raymond Blanc OBE (born 19 November 1949) is a French chef. Blanc is the chef patron at Le Manoir aux Quat' Saisons, a hotel-restaurant in Great Milton, Oxfordshire, England. The restaurant has two Michelin stars and scored 9/10 in the Good Food Guide. He is entirely self-taught, but has himself taught or employed other chefs including Heston Blumenthal, John Burton-Race, Michael Caines, Paul Liebrandt, and Marco Pierre White.", "*Michael Caines"]}, {"page": "Joël Robuchon", "response": ["In 1989, prestigious restaurant guide Gault Millau named Robuchon the \"Chef of the Century\". He mentored many famous chefs, including Gordon Ramsay, Eric Ripert, and Michael Caines."]}, {"page": "John Burton-Race", "response": ["In 2006, Burton Race lost to Michael Caines when the pair were challenged to represent the South West of England in the BBC television series Great British Menu.Great British Menu, BBC Following the collapse of his second marriage, in 2007 Burton-Race became a mentor on BBC cooking show Kitchen Criminals, and a judge of ITV cooking show Britain's Best Dish. He was one of three judges on the daytime food show Britain's Best Dish (2007–2011), alongside Jilly Goolden and Ed Baines."]}, {"page": "Belmond Le Manoir aux Quat'Saisons", "response": ["*Michael Caines"]}, {"page": "Great British Menu", "response": ["*John Burton Race and Michael Caines (won heat) represent the South West of England", "*Week 6 – 7 May to 11 May – Michael Caines and Mark Hix (won heat) represent the South West of England", "| South West || Nathan Outlaw || John Hooker || Henry Herbert || Michael Caines", "| South West || Paul Ainsworth || Andre Garrett || John Hooker || Michael Caines"]}, {"page": "Saturday Kitchen", "response": ["* Michael Caines", "For each show, Kerridge was joined by different chefs, including: Jason Atherton, Michael Caines, Daniel Clifford, Gennaro Contaldo, Lisa Goodwin-Allen, Angela Hartnett, Ching-He Huang, Tom Kitchin, Glynn Purnell, Theo Randall, and Bryn Williams."]}, {"page": "The Catey Awards", "response": ["* 2001 Michael Caines"]}, {"page": "List of people from Devon", "response": ["*Michael Caines (b. 1969), chef and restaurateur"]}, {"page": "Mark Hix", "response": ["Hix competed in the BBC television series Great British Menu in 2007, winning the South West England heat and beating the reigning champion, Michael Caines. In doing so, two of his courses were put forward for the public vote. The main course was a crayfish and rabbit stargazy pie and, for dessert, a perry jelly with summer fruits with an elderflower ice-cream. He has also appeared on Saturday Kitchen, Food and Drink, This Morning, Global Pulse, and the minidocumentary Mark Hix on Salt."]}, {"page": "List of people from Exeter", "response": ["*Michael Caines (born 1969), chef and restaurateur"]}, {"page": "Pride of Manchester Awards", "response": ["Restaurants Of Manchester Award for Best Restaurant in Manchester - Michael Caines at Abode", "Restaurants Of Manchester Award for Best Restaurant in Manchester - Michael Caines at Abode"]}, {"page": "Local Food Hero", "response": ["Michael Caines chose the eight finalists from the South West."]}, {"page": "Jesse Dunford Wood", "response": ["Dunford Wood then relocated to the West Country where he studied French cooking at Gidleigh Park Hotel in Devon under Chef Michael Caines, holder of two Michelin stars."]}, {"page": "Gidleigh Park", "response": ["Michael Caines took over as head chef of the restaurant in 1994 and held the reins for 21 years before leaving in early 2016 to pursue his own business ventures elsewhere. As of 2009, Caines was the Executive Head Chef, as he oversaw several other interests while Ian Webber remained on site as head chef.", "* Gidleigh Park's chef Michael Caines interview"]}, {"page": "My Kitchen Rules", "response": ["A second British series aired on Channel 4 in September 2016, to be made of 30-hour-long episodes, hosted by Prue Leith and Michael Caines and produced by 7 Wonder Productions, offering a £10,000 prize."]}, {"page": "Michael Kane", "response": ["* Michael Caines (born 1969), chef"]}, {"page": "Michael Caine (disambiguation)", "response": ["* Michael Caines, English chef"]}, {"page": "Royal Clarence Hotel", "response": ["Between 2000 and 2015, the hotel was co-owned and run by celebrity chef Michael Caines, who set up ABode with business partner Andrew Brownsword.\"Michael Caines MBE: 'Did cuts hinder Royal Clarence fire crews?'\", Express & Echo, 28 October 2016 . Retrieved 30 October 2016  Brownsword bought the hotel in 2003 for £4.5 million."]}, {"page": "Caines, Michael", "response": ["#redirectMichael Caines"]}, {"page": "List of honorary graduates of the University of Exeter", "response": ["* Michael Caines (LLD)"]}]}}