{"wiki_id": "http://www.wikidata.org/entity/Q6835585", "itemLabel": "Michaela Clavell", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Michaela_Clavell", "wikipedia_page": {"main": "James Clavell (born Charles Edmund Dumaresq Clavell; 10 October 1921 – 7 September 1994) was an Australian-born American novelist, screenwriter, director, and World War II veteran and prisoner of war. Clavell is best known as the author of his Asian Saga novels, a number of which have had television adaptations. Clavell also wrote such screenplays as those for The Fly  (1958) (based on the short story by George Langelaan) and The Great Escape (1963) (based on the personal account of Paul Brickhill). He directed the popular 1967 film To Sir, with Love for which he also wrote the script.", "link_mentions": [{"page": "Miss Moneypenny", "response": ["Miss Moneypenny's role in Fleming's novels is even smaller than her role in the films. In the novels, Bond also has his own secretary, Loelia Ponsonby and later Mary Goodnight, both of whose lines and relationships were often transferred to Miss Moneypenny for the films. As a rule, Moneypenny generally never directly participates in Bond's missions. However, in Skyfall, Moneypenny is an MI6 officer who directly assists Bond in the field before becoming the new M's secretary. In the film Octopussy, Moneypenny has an assistant named Penelope Smallbone (Michaela Clavell), who appears to be equally smitten with Bond, despite a \"thorough briefing\" on the subject by Moneypenny. Intended as either a foil or a replacement for Moneypenny, Smallbone appeared only that once."]}, {"page": "Clavell", "response": ["*Michaela Clavell, actress"]}, {"page": "Shōgun (upcoming TV series)", "response": ["During the Television Critics Association's annual summer press tour in August 2018, FX announced to make a new adaptation of Shogun and had given the production a straight-to-series order. Executive producers were expected to include Andrew Macdonald, Allon Reich, Michael De Luca, Michaela Clavell, Tim Van Patten, Eugene Kelly, and Ronan Bennett. Rachel Bennette is set as a supervising producer, Tom Winchester as a producer, Georgina Pope as a co-producer, and Eriko Miyagawa as an associate producer. Patten will also direct for the series as Bennett will also write. FX Productions and DNA Television are slated to serve as production companies for the series. Sanada serves as a Producer. The 10-episode limited series is produced by FX Productions."]}]}}