{"wiki_id": "http://www.wikidata.org/entity/Q6838693", "itemLabel": "Mickey Linden", "itemDescription": "Gaelic football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mickey_Linden", "wikipedia_page": {"main": "Michael Rory \"Mickey\" Linden is an Irish Gaelic footballer who played for Down in the 1980s, 1990s and early 2000s. He was part of the Down team that won the All-Ireland Senior Football Championship in 1991 and 1994. Linden also won two Ulster Senior Football Championships and a National League title with Down. In 1994 he also won an All Star award and named Texaco Footballer of the Year.\nHe usually played as a corner forward. He was renowned for his speed, \"electrifying skills\", turn of foot and accuracy in front of the posts with both feet. He \"tore defences apart with his pace and scoring power\" and \"took the best back lines to the cleaners\". Linden is among the top twenty all-time top Ulster scorers in Championship football. His understanding with Down play-maker Greg Blaney has been described as \"near telepathic\".Linden is known as one of the Down's best ever footballers. In 2009 The Irish News named him as one of the all-time best 125 footballers from Ulster, to mark the 125th anniversary of the Gaelic Athletic Association.", "link_mentions": [{"page": "Mayobridge", "response": ["*Mickey Linden, Gaelic footballer, winner of All-Ireland Senior Football Championship in 1991 and 1994"]}, {"page": "Down GAA", "response": ["In 1991, Down surprised favourites Meath, Barry Breen scoring the goal that sent his team into a lead of eleven points with twenty minutes to go, a lead that Meath could not match. In 1994, Mickey Linden sent James McCartan, Junior in for a goal directly under Hill 16, a goal which silenced Dublin and helped Down claim its fifth All-Ireland SFC title."]}, {"page": "List of All Stars Awards winners (football)", "response": ["| RCF || 20px|border Mickey Linden || Down || 1"]}, {"page": "Texaco Footballer of the Year", "response": ["| 1994 || Mickey Linden || Down ||Mayobridge || Corner Forward"]}]}}