{"wiki_id": "http://www.wikidata.org/entity/Q6830363", "itemLabel": "Michael Foreman", "itemDescription": "British illustrator and children's writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Foreman_(author/illustrator)", "wikipedia_page": {"main": "Michael Foreman (born 21 March 1938) is a British author and illustrator, one of the best-known and most prolific creators of children's books. He won the 1982 and 1989 Kate Greenaway Medals for British children's book illustration and he was a commended runner-up five times.For his contribution as a children's illustrator he was U.K. nominee in 1988 and again in 2010 for the biennial, international Hans Christian Andersen Award, the highest recognition available to creators of children's books.", "link_mentions": [{"page": "March 21", "response": ["*1938 – Michael Foreman, English author and illustrator"]}, {"page": "Terry Jones", "response": [";Illustrated by Michael Foreman"]}, {"page": "Charlie and the Chocolate Factory", "response": ["* 1985,  (paperback, illustrated by Michael Foreman)"]}, {"page": "Daphne du Maurier", "response": ["* Classics of the Macabre (1987) (anthology of earlier stories, illustrated by Michael Foreman, AKA Echoes from the Macabre: Selected Stories)"]}, {"page": "Carnegie Medal (literary award)", "response": [" | 1980 || illus. Michael Foreman ||City of Gold and other stories from the Old Testament ||Gollancz"]}, {"page": "Lowestoft", "response": ["The children's author and illustrator Michael Foreman, born in 1938, spent his childhood in Pakefield, where his mother kept a grocer's shop. He went to Pakefield Primary School, and played on Hilly Green – stories of which are recorded in his book War Boy. The author and illustrator James Mayhew lived in the town and studied at Lowestoft School of Art. Photographer George Davison was also born in Lowestoft. Jayne-Marie Barker, author of the Inspector Allen mysteries, grew up at Oulton Broad and has used Lowestoft as an inspiration for her books.Oulton Broad author to make Lowestoft appearance, Lowestoft Journal, 28 September 2012. Retrieved 25 February 2014. Author Mark Dawson was born in the town."]}, {"page": "Charlie and the Great Glass Elevator", "response": ["*  (paperback, 1986, illustrated by Michael Foreman)"]}, {"page": "Kate Greenaway Medal", "response": [" | 1989 || Michael Foreman || War Boy: A Country Childhood || —", " | 1982 || Michael Foreman || Long Neck and Thunder Foot (and) Sleeping Beauty and other favourite fairy tales || Helen Piers (and) traditional ", "Michael Foreman, who won the 1982 and 1989 medals, was highly commended once and four times a \"Commended\" runner-up, a distinction used 68 times in 44 years to 2002.", ":– \tMichael Foreman, Popular Folk Tales (Gollancz), newly translated from Brothers Grimm by Brian Alderson", ":+ \tMichael Foreman, City of Gold and other stories from the Old Testament (Gollancz), retold by Peter Dickinson  ", "1982 Michael Foreman, Long Neck and Thunder Foot (Kestrel), by Helen Piers ", ":–\tMichael Foreman, The Saga of Erik the Viking (Pavilion), by Terry Jones  ", ":–\tMichael Foreman, Seasons of Splendour: Tales, myths, and legends of India (Pavilion), by Madhur Jaffrey  ", "1989 Michael Foreman, War Boy: a Country Childhood (Pavilion) @ —autobiographical", ":– \tMichael Foreman, War Game (Pavilion) @ ", "Kay and Ness won both the Greenaway and Carnegie Medals for A Monster Calls, the first such double. Two illustrators of Carnegie Medal-winning books had been runners-up for the Greenaway, Charles Keeping (The God Beneath the Sea, 1970) and Michael Foreman (City of Gold, 1980)."]}, {"page": "Charles Causley", "response": ["*Early in the Morning: A Collection of New Poems (1986), with music by Anthony Castro and illustrations by Michael Foreman"]}, {"page": "The Utterly Utterly Merry Comic Relief Christmas Book", "response": ["Douglas Adams, Rowan Atkinson, Glen Baxter, Michael Bywater, Graham Chapman, Nobby Clarke, Ron Cobb, Richard Curtis, Angus Deayton, Adrian Edmonson, Michael Fishwick, Michael Foreman, Stephen Fry, Kim Fuller, George Harrison, Michael Heath, Lenny Henry, Ian Hislop, Caroline Holden, Richard Ingrams, Antony Jay, Guy Jenkin, Gray Jolliffe, Terry Jones, Trevor Leighton, John Lloyd, Jonathan Lynn, Thomas Mann, Rik Mayall, Lise Mayer, Michael Palin, Geoffrey Perkins, Stephen Pile, Nigel Planer, Christopher Ryan, Griff Rhys Jones, Posy Simmonds, Mel Smith, The Spitting Image Workshop, Sue Townsend, Bill Tidy, John Wells."]}, {"page": "Ann Turnbull", "response": ["Pigeon Summer was nominated for the Nestle Smarties Book Prize and No Shame, No Fear was nominated for the Whitbread Book Award. She has written a number of picture books but the best known is The Sand Horse which is illustrated by Michael Foreman."]}, {"page": "Tobias Hill", "response": ["Hill has written one book for children, The Lion Who Ate Everything, illustrated by Michael Foreman, twice winner of the Kate Greenaway Medal. He has also written for The Times, The Observer, The Independent, The Guardian and Time Out. From 1998 to 2001, he was the Sunday Telegraph's rock "]}, {"page": "War Game (film)", "response": ["War Game is a 2002 animated short film made by the British animation company Illuminated Films, and based on the Michael Foreman novel of the same name. The film included many of the same scenes listed in the book, although four new characters were created. It features the voices of Adam Godley, Colin McFarlane, and Kate Winslet."]}, {"page": "List of adaptations of Beowulf", "response": ["* 2013: Beowulf, an adaptation for children by Michael Morpurgo, with illustrations by Michael Foreman."]}, {"page": "Hampshire Book Awards", "response": ["**Child's Garden by Michael Foreman"]}, {"page": "Red House Children's Book Award", "response": ["The 2017 Overall Winner was from the Books for Younger Readers category and was won by Michael Morpurgo and illustrator Michael Foreman for An Eagle in the Snow, published by Harper Collins. The 2017 winners were announced at an Award Ceremony held in London on Saturday 10 June 2017.", "*Overall: An Eagle in the Snow written by Michael Morpurgo, illustrated by Michael Foreman (HarperCollins)", "*Younger Readers: An Eagle in the Snow written by Michael Morpurgo, illustrated by Michael Foreman (HarperCollins)", "* Overall: Kensuke's Kingdom by Michael Morpurgo, illus. Michael Foreman (Heinemann)", "** Short Novel: Kensuke's Kingdom by Michael Morpurgo, illus. Michael Foreman (Heinemann)", "*The Saga of Erik the Viking by Terry Jones, illus. Michael Foreman (Pavilion)"]}, {"page": "Teeny-Tiny and the Witch-Woman", "response": ["Teeny-Tiny and the Witch-Woman is a story written by Barbara K. Walker and illustrated by Michael Foreman based on an old Turkish folk tale. The story"]}, {"page": "The Last Wolf", "response": ["The Last Wolf is a children's book written by Michael Morpurgo and illustrated by Michael Foreman, published in 2002. It won the Nestlé Smarties Book Prize Bronze Award.Nestlé Children's Book Prize "]}, {"page": "Marian Lines", "response": ["The Three Enchanters (1971) based on a Russian folk story. Lines designed and assisted in making the costumes based on Russian folk dress. Characters included the three enchanters, Baba Yaga and the hut on hens legs familiar from Mussorsky’s pictures at an exhibition. The Illustrator Michael Foreman expressed interest in developing the work but did not pursue the project."]}, {"page": "List of TV Guide covers (1980s)", "response": ["|9/14/1985||Fall Preview||Illustration||Michael Foreman"]}, {"page": "Michael Foreman (author / illustrator)", "response": ["#Redirect Michael Foreman (author/illustrator)"]}, {"page": "The Beatles Illustrated Lyrics", "response": ["*Michael Foreman (\"And I Love Her\")"]}, {"page": "Michael Foreman", "response": ["Michael Foreman may refer to:", "* Michael Foreman (astronaut) (born 1957), American astronaut", "* Michael Foreman (author/illustrator) (born 1938), British author and illustrator"]}, {"page": "Mermaid of Zennor", "response": ["The Mermaid of Zennor is a poem by Charles Causley, published (with further content about the legend) in a book of the same or a similar title -- some early editions are called 'The Merrymaid of Zennor'. It is illustrated by Michael Foreman; "]}, {"page": "Michael Foreman (illustrator)", "response": ["#REDIRECT: Michael Foreman (author/illustrator)"]}, {"page": "Eric Quayle", "response": ["Eric Stanley Quayle (1921–2001) was a noted British bibliophile, collector, historian and author. Over his lifetime he built up a substantial collection of books (16,000 volumes at the time of his death) and literary ephemera amongst which were materials by and about R. M. Ballantyne, the Victorian adventure story writer. Quayle's own work was mainly related to the themes of collecting books but he also produced a noted biography of Ballantyne (1967) and two books of folk tales: one of Cornish tales (The Magic Ointment) and one of Japanese tales (The Shining Princess). These were both illustrated by the prolific Michael Foreman.Zipes, Jack. (2006). The Oxford encyclopedia of children's literature. Oxford: Oxford University Press.", "* The magic ointment: and other Cornish legends. London: Andersen Press, 1986. Illustrated by Michael Foreman. ", "* The little people's pageant of Cornish legends. New York: Simon & Schuster, 1987. Illustrated by Michael Foreman. ", "* The shining princess and other Japanese legends. New York: Arcade Publishing, 1989. Illustrated by Michael Foreman."]}, {"page": "Illustrators of Alice's Adventures in Wonderland", "response": ["* Michael Foreman, published by Sterling in 2004"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Michael Foreman (author/illustrator)"]}]}}