{"wiki_id": "http://www.wikidata.org/entity/Q6830106", "itemLabel": "Michael Elliott", "itemDescription": "British director", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Elliott_(director)", "wikipedia_page": {"main": "Michael Elliott, OBE (26 June 1931 – 30 May 1984) was an English theatre and television director.", "link_mentions": [{"page": "Eleanor Bron", "response": ["* Elena Andreyevna in Uncle Vanya by Anton Chekhov. Directed by Michael Elliott at the Royal Exchange, Manchester. (1977)"]}, {"page": "Dorothy Tutin", "response": ["* Sarah in After the Lions by Ronald Harwood. World premiere directed by Michael Elliott at the Royal Exchange, Manchester 1982"]}, {"page": "Tom Courtenay", "response": ["Despite being catapulted to fame by the aforementioned films, Courtenay has said that he has not particularly enjoyed film acting; from the mid-1960s he concentrated more on stage work, although in a later Telegraph interview on 4/20/2005, he admitted \"I slightly overdid the anti-film thing\". In 1968, Courtenay began a long association with Manchester when he played in The Playboy of the Western World for the Century Theatre at Manchester University directed by Michael Elliott. In 1969, Courtenay played Hamlet (John Nettles playing Laertes) for 69 Theatre Company at University Theatre in Manchester, this being the precursor of the Royal Exchange Theatre, which was founded in 1976 where he was to give many performances, firstly under the direction of Casper Wrede. His first roles for the Royal Exchange were as Faulkland in Richard Brinsley Sheridan's The Rivals and the hero of Heinrich von Kleist's The Prince of Homburg. Since then he has played a variety of roles, including in 1999 the leading role in the theatre's production of King Lear, and in 2001 Uncle Vanya."]}, {"page": "Royal National Theatre", "response": ["* Miss Julie by August Strindberg, directed by Michael Elliott with Albert Finney and Maggie Smith in a double bill with Black Comedy by Peter Shaffer, directed by John Dexter with Derek Jacobi and Maggie Smith. (1965/66)"]}, {"page": "James Maxwell (actor)", "response": ["After seasons at the Bristol Old Vic and the Piccolo Theatre in Manchester he started to collaborate with the directors Michael Elliott and Casper Wrede, initially with the 59 Theatre Company. He translated Georg Büchner's Danton's Death (original title: Dantons Tod) for the opening production at the Lyric Theatre, Hammersmith. Elliott and Wrede went on to run the Old Vic company and Maxwell joined them to act in several of the productions including The Merchant of Venice and Measure for Measure."]}, {"page": "Edward Fox (actor)", "response": ["* Harry, Lord Monchensey in The Family Reunion by T S Eliot. Directed by Michael Elliott at the Royal Exchange, Manchester. 1979)"]}, {"page": "Joanna David", "response": ["* Sonia in Uncle Vanya by Anton Chekhov, directed by Michael Elliott at the Royal Exchange, Manchester, (1977).", "* Mary in The Family Reunion by T S Eliot, directed by Michael Elliott at the Royal Exchange, Manchester, (1979)."]}, {"page": "Jeremy Isaacs", "response": ["Isaacs was the founding chief executive of Channel 4 between 1981 and 1987, overseeing its launch period and setting the channel's original cultural approach with opera and foreign language film, although such programmes as the pop music series The Tube and soap opera Brookside had a place in the schedule from the beginning. The channel commissioned Michael Elliott's production of King Lear (1983) with Laurence Olivier in the title role and Isaacs recommissioned a number of programmes from his time at Granada including What the Papers Say. His appointment of David Rose, previously long with the BBC, as the Commissioning Editor for Fiction led to the Channel's involvement with the eighties revival of the British film industry via the Film on Four strand. Despite a general liberal atmosphere though, a few commissioned programmes, such as Ken Loach's A Question of Leadership, were withdrawn from transmission."]}, {"page": "The Cherry Orchard", "response": ["A Royal Shakespeare Company/BBC Television version from 1962 was directed by Michael Elliott from Michel Saint-Denis stage production. This features  Peggy Ashcroft as Ranevskaya, Ian Holm as Trofimov, John Gielgud as Gayev, Judi Dench as Anya, Dorothy Tutin as  and Patsy Byrne as Dunyasha.\"'The Cherry Orchard', 1962\" imdb, accessed 19 November 2011 This version has been released on DVD by BBC Worldwide."]}, {"page": "The Wednesday Play", "response": ["* The Year of the Sex Olympics (written by Nigel Kneale, directed by Michael Elliott), DVD released by the BFI"]}, {"page": "Royal Exchange, Manchester", "response": ["The building remained empty until 1973 when it was used to house a theatre company (69 Theatre Company); the company performed in a temporary theatre but there were plans for a permanent theatre whose cost was then estimated at £400,000.\"Time and the Conways\" at the Royal Exchange; December 1973 (programme) The Royal Exchange Theatre was founded in 1976 by five artistic directors: Michael Elliott, Caspar Wrede, Richard Negri, James Maxwell and Braham Murray. It was opened by Laurence Olivier on 15 September 1976.Programme for Happy Birthday, Sir Larry, 31 May 1987 In 1979, the artistic directorship was augmented by the appointment of Gregory Hersov.", "* The Lady from the Sea by Ibsen. Directed by Michael Elliott with Vanessa Redgrave (1978)", "* The Dresser by Ronald Harwood. World premiere directed by Michael Elliott with Tom Courtenay and Freddie Jones (1980)", "* Moby Dick. World premiere adapted and directed by Michael Elliott with Brian Cox (1984)", "* Michael Elliott (1976–1984)"]}, {"page": "Ian Richardson", "response": ["In 1963, he played Le Beau in Michael Elliott's television production of As You Like It, playing alongside Vanessa Redgrave. In 1964, he played Antipholus of Ephesus in The Comedy of Errors as part of the Festival television series. In 1966, he played Jean-Paul Marat in the Royal Shakespeare Company production of Peter Weiss' Marat/Sade, directed by Peter Brook. In 1967, he played The Constable in A Man Takes a Drink as part of a television series entitled The Revenue Men. He played Bertram in John Barton's television version of All's Well That Ends Well in 1968, as well as playing Oberon in the Peter Hall film of A Midsummer Night's Dream. He took part in the television production of John Mortimer's A Voyage Round My Father in Plays of Today in 1969 as well as appeared in the television adaptation of The Canterbury Tales (1969)."]}, {"page": "The Year of the Sex Olympics", "response": ["The Year of the Sex Olympics is a 1968 television play made by the BBC and first broadcast on BBC2 as part of Theatre 625. It stars Leonard Rossiter, Tony Vogel, Suzanne Neve and Brian Cox, and was directed by Michael Elliott. The writer was Nigel Kneale, best known as the creator of Quatermass."]}, {"page": "Philip Madoc", "response": ["* Father Mapple in Moby Dick. World premiere adapted and directed by Michael Elliott at the Royal Exchange, Manchester (1984)"]}, {"page": "Ronald Pickup", "response": ["Pickup was also an accomplished stage actor. His first professional role was in 1964 as Friendly in Virtue in Danger at the Phoenix Theatre, Leicester. His London debut was in November 1964 as Octavius in Julius Caesar, for director Lindsay Anderson at the Royal Court Theatre.  He worked with Laurence Olivier at the Royal National Theatre, most notably as Baron Tusenbach in Three Sisters (1967) and Long Day's Journey into Night. His first appearance with the company was a minor part in Michael Elliott's production of Miss Julie (1965 Chichester Festival; 1966 Old Vic). This was followed by a role which brought him to popular attention: again at the Old Vic he  was Rosalind in Clifford William's all-male production of As You Like It, portraying \"serious emotion\" in an otherwise \"comic\" production  in 1967. He was nominated for a 1998 Laurence Olivier Theatre Award for Best Performance in a Supporting Role for his performance in Amy's View."]}, {"page": "Tom Adams (actor)", "response": ["He appeared in television series such as The Avengers, Maigret and Ghost Squad as well as films from 1961 and made his West End debut, supporting Anton Walbrook and Peter Sallis, in Masterpiece at the Royalty in 1961. He joined the Royal Shakespeare Company in 1962 as one of an infusion of new actors into Michael Elliott’s production of As You Like It at the Aldwych Theatre.  His first big screen break was a role as Nimmo in The Great Escape (1963),\"The Great Escape: 50th anniversary\", The Telegraph, 19 February 2013, Accessed 14 December 2014 in which the salary from the film allowed him to buy his first car."]}, {"page": "Trevor Peacock", "response": ["* Estragon, Waiting for Godot by Samuel Beckett for the Century Theatre, Manchester directed by Michael Elliott (1967)"]}, {"page": "Rosalind Knight", "response": ["Knight married theatre and television director Michael Elliott in July 1959; the couple remained married until his death in 1984. They had two daughters: Marianne Elliott, a theatre director, who is married to actor Nick Sidi, and Susannah Elliott-Knight."]}, {"page": "Alfred Burke", "response": ["* Serebryakov in Uncle Vanya by Anton Chekhov. Directed by Michael Elliott at the Royal Exchange, Manchester. 1977)"]}, {"page": "The Lady from the Sea", "response": ["*1979: Vanessa Redgrave starred in Michael Elliott's production with the Royal Exchange Theatre Company at The New Roundhouse in London, England"]}, {"page": "The Ordeal of Gilbert Pinfold", "response": ["In 1960 Waugh accepted a fee of £250 from the BBC for an adaptation of Pinfold, as a radio play, by Michael Bakewell. The broadcast, on 7 June 1960, was well received by the critics, although Waugh did not listen to it.Stannard 1992, p. 430 In September 1977 a staged version of the book, written by Ronald Harwood and directed by Michael Elliott, opened at the Royal Exchange theatre, Manchester. The play was brought to London, and performed at the Roundhouse Theatre in February 1979, where Michael Hordern's depiction of Pinfold was highly praised—\"a man suffering from chronic indigestion of the soul\"."]}, {"page": "King Lear (1983 TV programme)", "response": ["King Lear (1983) is a video production of William Shakespeare's 1606 play of the same name, directed by Michael Elliott. It was broadcast in 1983 in the UK and in 1984 in the US.Laurence Olivier Presents King Lear. British Universities Film and Video Council"]}, {"page": "Espen Skjønberg", "response": ["* Odysseus in Philoctetes by Sophocles. Directed by Michael Elliott at the Royal Exchange, Manchester. (1982)"]}, {"page": "The Family Reunion", "response": ["*Vaudeville Theatre, London (April 1979) with Edward Fox, Pauline Jameson and Avril Elgar.The Observer, 22 April 1979 p. 16. Originally staged by the Royal Exchange Theatre, Manchester Directed by Michael Elliott and originally staged at the Royal Exchange, Manchester"]}, {"page": "Caspar Wrede", "response": ["In 1951 he left Finland and enrolled at the Old Vic Theatre School in London run by the French director Michel Saint-Denis. He was much influenced by Saint-Denis and his ideas had a great effect on the theatre companies that Wrede helped establish. In 1956 he was involved with the setting up of the Piccolo Theatre company in Chorlton-cum-Hardy, Manchester (which only survived for a year) and in 1959 he founded the 59 Theatre Company, based at the Lyric Theatre (Hammersmith). Michael Elliott was appointed assistant artistic director and, although short-lived, the company achieved considerable success with productions of Brand, Little Eyolf and Danton's Death. During this time Wrede also directed both the stage debut of Alun Owen's play The Rough and Ready Lot and its 1959 television adaptation. Wrede and Elliott went on to run a season of plays at the Old Vic in 1961.", "In 1967 Wrede and Michael Elliott agreed to direct productions for Braham Murray’s Century Theatre at Manchester University and  in 1968 the three of them set up the 69 Theatre Company also at the University where they produced plays until 1972. The group started to look for a permanent theatre in Manchester. They were joined by Richard Negri, a colleague and friend of Wrede's since the Old Vic School who was to design the new theatre, and the actor James Maxwell and in 1973 a temporary theatre, The Tent, was installed in the disused Royal Exchange in Manchester. The success of The Tent led to the decision being taken to build the new theatre inside the Royal Exchange. Wrede directed one of the two opening productions in September 1976, The Prince of Homburg. He went on to direct over 20 productions during the next 15 years. He resigned from the company in 1990 and eventually moved back to Finland with his second wife, Karen Bang, a friend since childhood.Murray, Braham (2007). The Worst It Can Be Is a Disaster. London: Methuen Drama. ."]}, {"page": "Colin George", "response": ["In August 1966 it was announced that the Sheffield Playhouse would get a new theatre, and George was a leading force in the creation of what was to become the Crucible Theatre. He worked closely with the theatre director Sir Tyrone Guthrie and designer Tanya Moiseiwitsch to create a radical thrust stage auditorium. The controversial design aroused fierce opposition from Sheffield’s conservative quarters and the so-called ‘Three Knights’: Sir Bernard Miles, Sir Laurence Olivier & Sir John Clements. But it also galvanised a new generation of actors, directors, designers and playwrights who launched a passionate defence of the thrust stage, among them Michael Elliott, Peter Cheeseman, Keith Waterhouse, David Campton, David Rudkin and Alan Ayckbourn. George served as the Crucible’s Artistic Director from its opening in November 1971 to July 1974."]}, {"page": "Laurence Olivier Award for Best Director", "response": ["| Michael Elliott"]}, {"page": "Peter Guinness (actor)", "response": ["* Alberto Sholez in Moby Dick. World premiere adapted and directed by Michael Elliott at the Royal Exchange, Manchester. (1984)"]}, {"page": "Avril Elgar", "response": ["* Aase, Peer Gynt by Henrik Ibsen. Directed by Michael Elliott for 69 Theatre at the University Theatre, Manchester (1970)", "* Agatha, The Family Reunion by T S Eliot. Directed by Michael Elliott for 69 Theatre at the Royal Exchange (1973)", "* Agatha, The Family Reunion by T S Eliot. Directed by Michael Elliott at the Royal Exchange, Manchester (1979)"]}, {"page": "Braham Murray", "response": ["After leaving Oxford he directed The Winter's Tale at Birmingham Rep with Prunella Scales. Later, in September 1965, he was appointed artistic director of Century Theatre which became the resident company at the University Theatre in Manchester as well as touring the north-west of England using a mobile theatre. In 1967, Michael Elliott and Caspar Wrede agreed to direct productions at the Century Theatre. The following year the three men set up the 69 Theatre Company at the University, where they produced plays until 1972 when the group started to look for a permanent theatre in Manchester."]}, {"page": "Richard Negri", "response": ["In 1959 he started to design for the  59 Theatre Company, based at the Lyric Theatre. The company was run by Michael Elliott and Casper Wrede, a friend from the Old Vic and, although short-lived, the company achieved considerable success with productions of Brand (designed by Negri), Little Eyolf and Danton's Death. When Wrede and Elliott went on to run a season of plays at the Old Vic in 1961 Negri joined them as designer."]}, {"page": "Marianne Elliott (director)", "response": ["Elliott was born in 1966 in London, the daughter of Michael Elliott, theatre director and co-founder of the Royal Exchange theatre in Manchester, and actress Rosalind Knight. Her maternal grandfather was the actor Esmond Knight. The family moved to Manchester when she was eight years old and attended St Hilary's School, Alderley Edge, Didsbury Road Junior School in Heaton Moor and later Stockport Grammar School."]}, {"page": "Dilys Hamlett", "response": ["After leaving the theatre school she went immediately into the West End, appearing in The Innocents before performing in several productions for the Shakespeare Memorial Theatre Company. Although she continued to work in the West End and for theatres throughout Britain she was particularly associated with the group of directors, including her husband, Caspar Wrede, who eventually formed the Royal Exchange Company in Manchester. She worked for Michael Elliott in the 59 Theatre Company and then for Braham Murray in the Century Theatre in Manchester. These two companies led directly to the formation of the 69 Theatre Company and then to the Royal Exchange.", "* Agnes, Brand by Henrik Ibsen. Directed by Michael Elliott for the 59 Theatre Company at The Lyric Theatre (Hammersmith) (1959)", "* Solveig, Peer Gynt by Henrik Ibsen. Directed by Michael Elliott   at the Old Vic  (1962)", "* Isabella, Measure for Measure. Directed by Michael Elliott at the Old Vic (1963)", "* Widow Quinn, The Playboy of the Western World by J. M. Synge. Directed by Michael Elliott   for the Century Theatre, Manchester (1968)", "* The Norwegian Lady, The Ordeal of Gilbert Pinfold by Ronald Harwood. World premiere directed by Michael Elliott at the Royal Exchange, Manchester (1977)"]}, {"page": "Sylvia McNeill", "response": ["In 1971 she acted in Emil Dean Zoghby and Ray Pohlman's musical, Catch My Soul, at the Prince of Wales Theatre in London, England with Lance LeGault, Lon Satton, Sharon Gurney, and Malcolm Rennie in the cast. This rock musical was produced by Jack Good and directed by Braham Murray and Michael Elliott."]}, {"page": "Harold Lang (actor)", "response": ["(1959) He acted in Michael Meyer's translation of Henrik Ibsen's play, \"Brand\", at the Lyric Theatre in Hammersmith, London, England with the 59 Theatre Company featuring Patrick McGoohan, Dilys Hamlett, Patrick Wymark, Fulton Mackay, Peter Sallis OBE, Frank Windsor and June Bailey in the cast. Michael Elliott was the director."]}, {"page": "Nicholas Amer", "response": ["Following the tour, Amer travelled to the Channel Islands to perform in a comedy, Blue for a Boy. John Fernald directed him once again in London, playing Razumikhin, with Kenneth Griffith as Raskolnikov, in Crime and Punishment. The new young director Peter Hall asked him to play the bridegroom in Garcia Lorca's Blood Wedding. Michael Benthall offered him a season at The Old Vic, but only small parts and understudying were on offer,  except for a stint at the 1954 Edinburgh Festival as Donalbain in Macbeth, with Paul Rogers and Ann Todd in the leading roles.  In 1955, when Regent's Park Open Air Theatre offered him the chance to play Ferdinand in The Tempest,  Amer persuaded Benthall to release him. He played Ferdinand for a second time, this time with Robert Eddison as Prospero and James Maxwell as Ariel, and with June Bailey as Miranda,  and then on alternate nights playing Percinet opposite Hilda Schroder in Rostand's The Romanticks (Les Romanesques),  with character actors Russell Thorndike and Robert Atkins as the two fathers. He also performed Shakespeare live on TV, including playing Sebastian in BBC Sunday Night Theatre's Twelfth Night (1957) with Dilys Hamlett as Viola in a production by Michael Elliott and Caspar Wrede.  He showed his versatility by also appearing in the 1958 musical Keep Your Hair On at the Apollo Theatre in London, directed by John Cranko and with settings and costumes designed by Tony Armstrong-Jones (later 1st Earl of Snowdon) and Desmond Heeley.", "Experienced theatre actors were considered essential for television in the 1950s as programmes went out live in the early days of TV drama. Amer's first television part was in Emergency – Ward 10 (1957), the first hospital 'soap', as the naval officer brother of Dr Simon Forrester, played by Frederick Bartman.  Following this he appeared as the Italian opera singer Carlo Ponchi in Sing for Your Supper, the first ever TV musical for British television, written and composed by George Hall. Michael Elliott cast him as Sebastian in his and Caspar Wrede's production of Shakespeare's Twelfth Night (1957). He also appeared in the TV play Arrow in the Air by Henry Brinton and Kenneth Robinson, directed by Robert Tronson for Associated-Rediffusion (AR-TV, later Rediffusion, London) (1957), and in the 1959 children's science fiction series The Red Grass, also for AR-TV.  In 1960 he did The Roving Reasons and also a comedy for children's TV called The Old Pull 'n Push,   which proved so popular he did The Return of the Old Pull 'n Push the following year.  Appearances in The Pursuers (1961),  The Avengers (1963), and a BBC TV production of Hamlet (playing Rosencrantz), small character parts in Parbottle Speaking, Hemingway's For Whom The Bell Tolls (1965),  The Root of All Evil? (1969) and Disciple of Death (1972) followed."]}, {"page": "Michael Feast", "response": ["* Telegin in Uncle Vanya by Anton Chekhov. Directed by Michael Elliott at the Royal Exchange, Manchester. (1977)"]}, {"page": "1979 Laurence Olivier Awards", "response": ["** Michael Elliott for The Family Reunion – Vaudeville"]}, {"page": "Michael Elliott", "response": ["Michael Elliott may refer to:", "* Michael Elliott (chemist) (1924–2007), British chemist", "* Michael Elliott (director) (1931–1984), English director", "* Michael Elliott (politician) (born 1932), British politician, MEP in European Parliament election, 1999 (United Kingdom)"]}, {"page": "Ioanna Papantoniou", "response": ["Since 1971 Papantioniou made a notable professional career as a scenic and costume designer working along with Michael Elliott, Karolos Koun, Alexis Minotis, Katina Paxinou etc. She was the first female scenic designer of the National Theatre of Greece and Epidaurus' theatre."]}, {"page": "The Glass Menagerie (1966 film)", "response": ["The Glass Menagerie is a 1966 American made-for-television drama film based on the 1944 play of the same name by Tennessee Williams. It is directed by Michael Elliott and stars Shirley Booth, Hal Holbrook, Barbara Loden and Pat Hingle. Sponsored by Xerox, it originally aired on December 8, 1966 as an installment of CBS Playhouse.Schulman, Michael. \"A Lost 'Glass Menagerie,' Rediscovered,\" The New Yorker, December 7, 2016. The adaptation received two Primetime Emmy Award nominations for Outstanding Dramatic Program and Outstanding Actress (Booth).19th Emmy Awards Nominees and Winners (1967) – Academy of Television Arts & Sciences."]}]}}