{"wiki_id": "http://www.wikidata.org/entity/Q6834715", "itemLabel": "Michael Swan", "itemDescription": "writer and poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Swan_(writer)", "wikipedia_page": {"main": "Michael Swan is a writer of English language teaching and reference materials. He graduated from University of Oxford with a bachelor's degree in modern foreign languages and has later gone for a postgraduate research degree. He is the founder of Swan School of English.", "link_mentions": [{"page": "A Dictionary of Modern English Usage", "response": ["* Practical English Usage, by Michael Swan, a grammar for non-native English speakers."]}, {"page": "Communicative language teaching", "response": ["In his critique of CLT, Michael Swan addresses both the theoretical and practical problems with CLT. He mentions that CLT is not an altogether cohesive subject but one in which theoretical understandings (by linguists) and practical understandings (by language teachers) differ greatly. Criticism of the theory of CLT includes that it makes broad claims regarding the usefulness of CLT while citing little data, it uses a large amount of confusing vocabulary, and it assumes knowledge that is predominately not language-specific (such as the ability to make educated guesses) to be language-specific. Swan suggests that those theoretical issues lead to confusion in the application of CLT techniques."]}, {"page": "Rod Ellis", "response": ["Ellis further explains that TBLT can be as effective as other methods of teaching a second language whereby the learner may reflect upon their first language as a guide when completing tasks to strengthen comprehension levels in their second language. Michael Swan, protests Ellis in this regard by claiming that TBL is not any more effective than other language teaching methods, since TBL is lacking the structure needed to explicitly teach grammar to learners. Swan claims, that due to this lack of a systemic or clear breakdown for structure, that Ellis' TBL is more theoretical in nature due to lack of evidence in effect toward language acquisition in students. Another scholar, David Block, praises Ellis' task-based method as being inventive, however, similarly to Swan, Block defines Ellis' approach to language teaching heavily theoretical, with Ellis not mentioning how long a TBLT course should be or the maximum number of students it can support in a single class."]}, {"page": "Michael Swan", "response": ["Michael Swan (born June 11, 1948) is an American film and TV actor.", "Swan was born in San Jose, California, the son of actress Alys Lucille (née Wilkinson) and Donald Arthur Swan.Michael Swan profile, filmreference.com; accessed March 23, 2015."]}, {"page": "Practical English Usage", "response": ["Practical English Usage is a standard reference book aimed at foreign learners of English and their teachers written by Michael Swan."]}, {"page": "List of University of Oxford people in education", "response": ["*Michael Swan Founder of Swan School of English, freelance writer, famed grammarian"]}, {"page": "The Frogmore Papers", "response": ["The Frogmore Papers have published hundreds of new, neglected and established writers. Notable contributors have included Tobias Hill, Sophie Hannah, Susan Wicks, Elizabeth Bartlett, Brian Aldiss, Carole Satyamurti, Paul Groves, Mario Petrucci, Matthew Mead, Tamar Yoseloff, Frances Leviston, Katherine Pierpoint, Andrew Waterhouse, John Harvey, Pauline Stainer, Ian Caws, Jill Dawson, Jane Holland, Robert Seatter, Catherine Smith, Stewart Conn, Clare Pollard, Susan Wicks, Michael Swan, Christopher James and Andrew Waterman."]}]}}