{"wiki_id": "http://www.wikidata.org/entity/Q6835381", "itemLabel": "Michael Wilshaw", "itemDescription": "British Inspector of Schools", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Wilshaw", "wikipedia_page": {"main": "Sir Michael Wilshaw (born 3 August 1946) was the Chief Inspector of Schools In England and head of Ofsted from  2012 until 2016. He is the former Headmaster and now executive principal of Jewish Free School.", "link_mentions": [{"page": "Ofsted", "response": ["The current Chief Inspector is Amanda Spielman, who was appointed in January 2017 replacing Sir Michael Wilshaw.", "*January 2012 – December 2016: Sir Michael Wilshaw"]}, {"page": "JFS (school)", "response": ["| Sir Michael Wilshaw"]}, {"page": "Pimlico Academy", "response": ["Sir Michael Wilshaw, the former chief inspector of schools in England (2012-2016), was drafted in by Future Academies to support Smith."]}, {"page": "Trinity Catholic High School, Woodford Green", "response": ["* Michael Wilshaw, former deputy head"]}, {"page": "St Bonaventure's", "response": ["*Sir Michael Wilshaw (1985–2003) "]}, {"page": "Rabia School", "response": ["In April 2016 Ofsted chief Sir Michael Wilshaw revealed that he has written to the Secretary of State for Education twice about Rabia School. The letters warn of serious concerns about staff segregation at the school, with male and female staff being segregated during meetings and training. While Sir Michael conceded that the school had improved in many areas, has warned that staff segregation will prevent the school from moving up from an 'inadequate' rating. In May 2016 the Charity Commission announced it was formally investigating the school."]}, {"page": "2000 New Year Honours", "response": ["* Michael Wilshaw, Headteacher St Bonaventure's School, Newham, London. For services to Education."]}, {"page": "Nicky Morgan", "response": ["Following Theresa May's policy statement advocating new grammar schools, Morgan joined Michael Wilshaw in saying the changes were a retrograde step and a distraction from six years of effort under David Cameron to improve the existing state system via academies and free school reforms."]}, {"page": "Sir Michael Wilshaw", "response": ["#REDIRECT Michael Wilshaw"]}, {"page": "Ormiston Victory Academy", "response": ["Sir Michael Wilshaw, Her Majesty's Chief Inspector of Education, Children's Services and Skills, said: \"If any evidence comes to light that proves anyone within Ofsted or our contractors have shared information inappropriately, I will have no hesitation in taking the strongest possible action.\""]}, {"page": "Mossbourne Community Academy", "response": ["The first principal of the school was Michael Wilshaw, who left the school to become Chief Inspector of Schools In England and head of Ofsted in January 2012. The school opened a sixth form building in September 2009 which cost £7.7 million; they named it in memory after the late Sir Clive Bourne as the \"Sir Clive Sixth Form Centre\". The school has a specialism in music."]}, {"page": "Rockwood Academy, Birmingham", "response": ["Rockwood Academy (formerly Park View School) is a mixed secondary school located in Alum Rock, Birmingham. A medium-sized academy that serves the inner city area of Birmingham, it is a popular choice with parents, with many coming from the immediate area with almost all students in walking distance to the academy. The academy is rated as 'Good' by Ofsted in 2016 and the academy was highly commended for its rapid success with high praise coming from the National Schools Commissioner Sir David Carter and Chief Inspector of Schools Sir Michael Wilshaw."]}, {"page": "Trojan Horse scandal", "response": ["Ofsted chief Sir Michael Wilshaw accused Birmingham City Council of a \"serious failure\" in supporting schools in protecting children from extremism. Its leader, Sir Albert Bore, said that the Council accepted the Ofsted findings that schools in the city were failing pupils. Birmingham City Council commissioned Ian Kershaw of Northern Education Trust in Newcastle to review the evidence. However, because some of the schools were academies under the responsibility of the Department for Education, the then Secretary of State, Michael Gove, commissioned a separate report by Peter Clarke, the former head of the Metropolitan police's counterterrorism command. The two inquiries shared evidence, with the Kershaw inquiry deferring matters of extremism to the Clarke inquiry. The latter found that there is \"no evidence to suggest that there is a problem with governance generally\" nor any \"evidence of terrorism, radicalisation or violent extremism in the schools of concern in Birmingham,\" but said that there was \"evidence that there are a number of people, associated with each other and in positions of influence in schools and governing bodies, who espouse, sympathise with or fail to challenge extremist views,\" and that there had been \"co-ordinated, deliberate and sustained\" attempts \"by a number of associated individuals, to introduce an intolerant and aggressive Islamic ethos\" into \"a few schools in Birmingham.\" The report found that senior council officials and elected members were apparently aware of these issues, but dealt with them on a case-by-case basis rather than making \"any serious attempt to see if there was a pattern,\" though it is not clear whether this was due to \"community cohesion,\" ", "In May, Mark Rogers, Birmingham City Council's Chief Executive, had a meeting with head teachers of affected schools. Despite calling for secrecy, a hidden recording was sent to The Daily Telegraph, in which Rogers criticised the approach to the conspiracy by Education Secretary Michael Gove and Chief Schools Inspector Sir Michael Wilshaw. He said that the overview report on the matter could trigger \"some kind of bloody firestorm\" and \"may well lead to significant structural proposals\" for the city council. Birmingham City Council was already under investigation by Sir Bob Kerslake over problems of governance associated with financial management, looked after children, waste services and issues of equal pay for work of equal value. Kerslake deferred issues of education to the Clarke and Kershaw Reports, but an appendix to his Report provided contextual data on poverty, adult education attainment, unemployment and school performance across comparator cities and for England as a whole. This showed Birmingham to be performing badly on most indicators, but outperforming other cities and the national average for its school results and the proportion of schools graded outstanding. The Kershaw and Clarke Reports provided no data on school performance in Birmingham or of the schools improvement programme which had shaken up schools following Sir Tim Brighouse's appointment.", "Park View academy had been identified as outstanding in a 2012 Ofsted report, the first school to be inspected under a tougher new inspection regime introduced by then Secretary of State. Michael Gove. Sir Michael Wilshaw, Chief Inspector at Ofsted, had commented at a national conference that,  \"All schools should be like this and there's no reason why they shouldn't be.\""]}, {"page": "Amanda Spielman", "response": ["In June 2016, Spielman was selected by Education Secretary, Nicky Morgan, to take over as Chief Inspector of Office for Standards in Education, Children's Services and Skills (Ofsted) to replace Sir Michael Wilshaw. Following a pre-appointment hearing, Spielman's nomination was rejected by the Education Select Committee which expressed concerns about her suitability, citing her lack of teaching experience and her failure to show \"passion\" and lack of understanding for the \"complex role\". Mrs Morgan, however, dismissed such objections and in her capacity as Cabinet minister wrote to Neil Carmichael, the Committee's chairman, confirming her appointment of Mrs Spielman."]}, {"page": "Wilshaw, Michael", "response": ["#redirectMichael Wilshaw"]}, {"page": "Bobby Seagull", "response": ["When he was growing up, his father would take his boys regularly to East Ham Library, where Seagull was encouraged to find books that interested him. His headteacher was Michael Wilshaw. He saw an advertisement for sixth form scholarships at Eton College, and was successful in his application. Seagull started studying mathematics at the University of Oxford, but left his degree and graduated from Royal Holloway, University of London."]}, {"page": "Wilshaw", "response": ["* Michael Wilshaw (born 1946), Chief Inspector of Schools "]}, {"page": "Michael Gove's tenure as Education Secretary", "response": ["Gove's claim was refuted the same day by the Information Commissioner, Sir Christopher Graham, who pointed out there was \"nothing\" in data protection legislation that prevents vulnerable young people from being properly protected in care homes. Graham noted that \"[t]his law covers information about people so it has no bearing on the disclosure of non-personal information like the location of care homes\", and said he would be writing to both Gove and Sir Michael Wilshaw about the matter."]}]}}