{"wiki_id": "http://www.wikidata.org/entity/Q6830946", "itemLabel": "Michael Harbottle", "itemDescription": "English soldier and cricketer (1917-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Harbottle", "wikipedia_page": {"main": "Brigadier Michael Neale Harbottle, OBE (7 February 1917 – 30 April 1997) was a senior British Army officer who was chief of staff of the United Nations Peacekeeping Force in Cyprus from 1966 to 1968, a peace campaigner and amateur cricketer.", "link_mentions": [{"page": "1st Green Jackets (43rd and 52nd)", "response": ["The regiment was based at Knook Camp, near Warminster, in 1959. The regiment, led by Lieutenant Colonel Michael Harbottle, was an infantry demonstration battalion from 1959 to 1962. Brigadier, later General Sir Antony Read had a key role in the planning stages for the new regiment and in its move to the Green Jackets Brigade. Major, later Colonel John Tillett was second-in-command of the regiment at Warminster. In accordance with the tradition of rifle regiments not carrying colours; in 1962 in High Wycombe, Buckinghamshire, the 1st Green Jackets (43rd and 52nd) marched the 43rd and 52nd colours for the last time. On that occasion the regiment provided a Guard of Honour for Queen Elizabeth II which was commanded by Captain Edward Jones.Draper, p. 16 Major Dennis Fox was involved in the production of the 1962 film The Longest Day and members of the regiment took part as extras in the film.", "*Lieutenant Colonel Michael Harbottle 1959-1962"]}, {"page": "Adam Curle", "response": ["In 1973 Curle became the United Kingdom's first Professor of Peace Studies at the University of Bradford. Robert A. McKinlay, who was involved in the selection of the new Department of Peace Studies's inaugural professor, recalled contacting Curle after a fellow Quaker suggested Curle would disabuse him of the viability of position, after which Curle expressed an interest in the post. As Professor of Peace Studies he was responsible for both the department's administration and its academic development. His first year at Bradford was spent recruiting staff, seeking especially those with experience in peacemaking, and developing a postgraduate programme. Among those he appointed were Tom Stonier, who would later head Bradford's School of Science and Society; Aleksandras Štromas, a Russian lawyer and Soviet dissident; David Bleakley, a former Minister of Community Relations in the Government of Northern Ireland; Michael Harbottle, a former chief of staff of the United Nations Peacekeeping Force in Cyprus; Uri Davis, who had been involved in peacemaking among Jews and Arabs in the Middle East; Vithal Rajan, a Gandhian who had worked in India; Nigel Young, a political scientist formerly based at the University of Birmingham; and Tom Woodhouse, who became Curle's research assistant."]}, {"page": "Brigadier Michael Harbottle", "response": ["#REDIRECT Michael Harbottle"]}, {"page": "Harbottle (disambiguation)", "response": ["* Michael Harbottle (1917–1997), British army officer and peace campaigner"]}, {"page": "Georgios Koumanakos", "response": ["In the 1980s, he was a well-known activist for nuclear disarmament and the withdrawal of US bases from Greece; along with 7 other high-ranking generals from NATO countries (including Marshal Francisco da Costa Gomes and Brigadier Michael Harbottle) he co-signed the Generals for Peace and Disarmament initiative in 1981, and became a member of the Soviet-sponsored World Peace Council."]}, {"page": "List of people from Littlehampton", "response": ["*Michael Harbottle (1917–1997) Army officer, cricketer and peace campaigner was born in Littlehampton"]}, {"page": "Deaths in April 1997", "response": ["*Michael Harbottle, 80, British Army officer."]}, {"page": "Harbottle, Michael", "response": ["#redirectMichael Harbottle"]}]}}