{"wiki_id": "http://www.wikidata.org/entity/Q6832822", "itemLabel": "Michael Michael", "itemDescription": "British supergrass", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Michael", "wikipedia_page": {"main": "Michael Michael (born 12 November 1957) is the ex-boss of a criminal empire called the Organisation which was involved in drug smuggling, prostitution and money laundering. Following his arrest, Michael turned supergrass/police informer, with his evidence leading to 34 people being jailed for a combined 170 years, and the dismantling of 26 different drug syndicates.Among people he informed on were his wife Lynn, given a 24-month prison sentence suspended for two years for her role as a cash courier; his lover, Sue Richards; and Janice Marlborough, his business lieutenant who ran his string of brothels. Michael's evidence led to drugs worth £49m being recovered from a distribution network that is thought to have smuggled more than 110 kg (250lb) of cocaine and 19 tonnes of cannabis into Britain.Information about Michael's work as an informer remained secret until December 2001, when a judge at Woolwich crown court sentenced him to six years in jail. Reporting restrictions that had been in place for three years were lifted. Michael had admitted one count of conspiracy to import cocaine, a similar charge involving cannabis, and three conspiracies to launder the proceeds. He has also pleaded guilty to possessing a firearm. Michael, who lived in Radlett, Hertfordshire, is thought to have been given a new identity under the terms of the witness protection programme.Born into a Greek-Cypriot family in Birmingham in the English Midlands, Michael's birth name was Constantine Michael Michael, but he decided to drop the use of the forename Constantine in adulthood.", "link_mentions": [{"page": "Radlett", "response": ["* Michael Michael, Britain's biggest criminal supergrass"]}, {"page": "Supergrass (informant)", "response": ["One of the most prolific supergrasses in recent British history was Michael Michael whose evidence in 2001 led to 32 criminals being convicted, including his own mother, and the disruption of a £132 million drug ring."]}, {"page": "Mickey Green", "response": ["In 1998, following the arrest of British drug trafficker Michael Michael during Operation Draft, Green was one of sixty others implicated in a £150 million cocaine trafficking ring and would later be arrested by police at the Ritz hotel in Barcelona, Spain. Although held in custody for several months, he was again released and returned to his villa on the southern coast of Spain. As of 2002, he was wanted by authorities in Ireland as they suspected he tampered with a jury at a prior inquest and his assets in the Republic of Ireland were seized by the Irish Criminal Assets Bureau. As of November, 2007 he was understood to be living in and around the Marbella area, but had not yet been captured."]}, {"page": "List of people with reduplicated names", "response": ["* Michael Michael (born 1957), police informant"]}, {"page": "Michael (surname)", "response": ["* Michael Michael (born 1957), English criminal"]}, {"page": "Michael, Michael", "response": ["#redirectMichael Michael"]}]}}