{"wiki_id": "http://www.wikidata.org/entity/Q6838376", "itemLabel": "Mick O'Brien", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mick_O%27Brien_(footballer,_born_1979)", "wikipedia_page": {"main": "Michael George O'Brien (born 25 September 1979) is an English former professional footballer. He represented England as a schoolboy.\nO'Brien, a left-sided midfielder, began his career as a trainee with Everton, turning professional in October 1997. At Everton he had captained the FA Youth Cup winning side in 1998, but his progress was hampered by injury and he was released at the end of the 1998–99 season.\nHe joined Torquay United in August 1999 and later that month, on the opening day of the season, scored on his league debut against Shrewsbury Town at Gay Meadow. After a first season in and out of the starting line-up, but with some notable moments, including as a goal from a 30-yard free kick at Loftus Road in the FA Cup third round tie against Queens Park Rangers in December 1999, O'Brien fell out of favour with manager Wes Saunders. He was loaned to Conference side Southport in January 2001, returning in March with Torquay struggling at the foot of the Football League. With Saunders sacked, O'Brien returned to the first team squad under new manager Colin Lee, playing four times as a substitute before the end of the season. The last of these games, on the final day of the season, saw O'Brien come on early in the first half for Jason Rees as Torquay won 3–2 away to Barnet to avoid relegation and send Barnet down instead.\nLee left at the end of the season and was replaced by Roy McFarland. O'Brien was one of a number of players on short-term contracts, giving McFarland a chance to assess the squad. He appeared as a late substitute for Tony Bedeau on 11 August 2001, as Torquay lost 1–0 away to Bristol Rovers, but was released at the end of that month.\nHe joined Droylsden in September 2001, moving to Chester City the following month and appearing in their Conference side. He was released by Chester at the end of the 2002–03 season, having not played in their first team that season.\nHe returned to Droylsden in August 2003, playing seven times up to early October.He returned to the Droylden side in October 2005, playing his final game for them that season on 12 December as Droylsden lost at home to Workington.He also became kit man to the Everton youth team, also taking some of the coaching and by April 2008 was one of Everton's Academy coaches.", "link_mentions": [{"page": "Mick O'Brien", "response": ["Mick O'Brien may refer to:", "*Mick O'Brien (boxer) (born 1954), Australian Olympic boxer", "*Mick O'Brien (footballer, born 1893), Irish international football player", "*Mick O'Brien (footballer, born 1979), English football player", "*Mick O'Brien (musician) (born 1961), Irish musician "]}, {"page": "Mick O'Brien (left-sided midfielder)", "response": ["#REDIRECT Mick O'Brien (footballer, born 1979)"]}, {"page": "1999–2000 Everton F.C. season", "response": ["|Mick O'Brien"]}, {"page": "Mick O'Brien (footballer born 1979)", "response": ["#REDIRECT Mick O'Brien (footballer, born 1979)"]}]}}