{"wiki_id": "http://www.wikidata.org/entity/Q6832927", "itemLabel": "Michael Morton", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Morton_(dramatist)", "wikipedia_page": {"main": "Michael Morton (1864 – 11 January 1931) was an English dramatist in the early 20th century.", "link_mentions": [{"page": "Agatha Christie", "response": ["In 1928, Michael Morton adapted The Murder of Roger Ackroyd for the stage under the title Alibi. The play enjoyed a respectable run, but Christie disliked the changes made to her work and, in future, preferred to write for the theatre herself. The first of her own stage works was Black Coffee, which received good reviews when it opened in the West End in late 1930. She followed this up with adaptations of her detective novels: And Then There Were None in 1943, Appointment with Death in 1945, and The Hollow in 1951."]}, {"page": "Hercule Poirot", "response": ["The first actor to portray Hercule Poirot was Charles Laughton. He appeared on the West End in 1928 in the play Alibi which had been adapted by Michael Morton from the novel The Murder of Roger Ackroyd. "]}, {"page": "Miss Marple", "response": ["The character of Miss Marple is based on friends of Christie's step grandmother/aunt (Margaret Miller, née West).Margaret West was the sister of Mary Ann Boehmer, Agatha Christie's maternal grandmother. Margaret married Christie's paternal grandfather, Nathaniel Frary Miller, in 1863 in Westbourne, West Sussex. He died in 1869 and she dedicated a stained glass window to his memory in St. John's Church, Main Road, Southbourne, West Sussex. Margaret's stepson, Frederick Alvah Miller, went on to marry her niece Clarissa Boehmer. Apart from Agatha, they had two other children, Margaret Watts and Louis Montant Miller.  Christie attributed the inspiration for the character to a number of sources, stating that Miss Marple was \"the sort of old lady who would have been rather like some of my step grandmother's Ealing cronies – old ladies whom I have met in so many villages where I have gone to stay as a girl\". Christie also used material from her fictional creation, spinster Caroline Sheppard, who appeared in The Murder of Roger Ackroyd. When Michael Morton adapted the novel for the stage, he replaced the character of Caroline with a young girl. This change saddened Christie and she determined to give old maids a voice: Miss Marple was born."]}, {"page": "The Murder of Roger Ackroyd", "response": ["The book formed the basis of the earliest adaptation of any work of Christie's when the play, Alibi, adapted by Michael Morton, opened at the Prince of Wales Theatre in London on 15 May 1928. It ran for 250 performances with Charles Laughton as Poirot. Laughton also starred in the Broadway run of the play, retitled The Fatal Alibi, which opened at the Booth Theatre on 8 February 1932. The American production was not as successful and closed after just 24 performances."]}, {"page": "A. H. Woods", "response": ["|Michael Morton and Paul Gavault (book);Adrian Ross (lyrics)", "|Michael Morton", "|Michael Morton", "|Michael Morton and Peter Traill"]}, {"page": "Elissa Landi", "response": ["In 1931, She starred in the Fox feature, The Yellow Ticket along with a young Laurence Olivier, Lionel Barrymore and Boris Karloff. Raoul Walsh directed. The film was based on Michael Morton's 1914 play and was about a young Jewish girl, who obtains a prostitute's passport during a period Jews were not allowed such freedom so that she can travel around Czarist Russia to visit her sick father."]}, {"page": "Una O'Connor (actress)", "response": ["|1925-05-10 ||By Right of Conquest ||Michael Morton ||London ||Scala Theatre|| Annie"]}, {"page": "Alibi (play)", "response": ["Alibi is a 1928 play by Michael Morton based on The Murder of Roger Ackroyd, a 1926 novel by British crime writer Agatha Christie.", "The Scotsman of 16 May 1928 said, \"It is a tribute to Mr Michael Morton…that during the play…one completely ignored the many weaknesses in the chain of evidence that bought the guilt home to the murderer of Sir Roger Ackroyd. The audience watched the tangled skein unravelled by the eminent French detective, M. Hercule Poirot, much in the way that an audience watches an illusionist, except that instead of the quickness of the hand deceiving the eye, the speciousness of the detective's reasoning deceived the senses. When the guilt was brought home to the least suspected person, the audience could only gasp. But the incredulity came after the theatre was left. These crime mystery plays are all much one pattern but it must be conceded that Alibi...is one of the best of its kind. It is superbly acted, the performance of Mr Charles Laughton being particularly good. Mr Laughton has a genius for getting into the 'skin' of a part.\"The Scotsman 16 May 1928 (Page 11)", "Agatha Christie's novel was adapted for the stage by Michael Morton. The production was directed by Gerald du Maurier.Alibi Samuel French Ltd. 1929 (Page 3)"]}, {"page": "The Yellow Ticket", "response": ["The Yellow Ticket is a 1931 pre-Code American drama film based on the 1914 play of the same name by Michael Morton, produced by the Fox Film Corporation, and directed by Raoul Walsh. The film stars Elissa Landi and Lionel Barrymore and features Boris Karloff. It is also a noteworthy example of productions from the pre-Code era in that it includes brief nudity.", "The original play, presented on Broadway, ran from January to June 1914 and starred Lionel's younger brother John Barrymore opposite Florence Reed.\"The Yellow Ticket\", by Michael Morton, as produced by AH Woods on Broadway at the Eltinge 42nd Street Theatre; IBDb.com This film is the third American adaptation of the play. The first two are The Yellow Passport from 1916 and The Yellow Ticket from 1918. A German version, Der Gelbe Schein, was also filmed and released in 1918.\"The Yellow Ticket (1918)\" at the Internet Movie Database"]}, {"page": "Alibi (1931 film)", "response": ["The film was adapted from the 1928 play Alibi by Michael Morton which was in turn based on the 1926 Agatha Christie novel The Murder of Roger Ackroyd featuring her famous Belgian detective Hercule Poirot."]}, {"page": "Michael Morton", "response": ["* Michael Morton (American football) (born 1960), American football player", "* Michael Morton (criminal justice) (born 1954), American man wrongfully convicted of murder", "* Michael Morton (dramatist) (1864–1931), English playwright", "* Michael Morton (restaurateur) (born 1964), co-founder of the N9NE Group", "* Michael Morton (runner) (born 1971), American ultramarathoner", "* Michael Morton (soccer) (born 1989), South African soccer player", "* Michael Morton, Canadian musician who records under the name Displacer"]}, {"page": "The Woman from Monte Carlo", "response": ["The play on which the film is based, Claude Farrère's and Lucien Népoty's Veille d'Armes (also listed as Veilles d'Armes) was adapted by Michael Morton and titled In the Night Watch upon its London opening on December 21, 1918 and its New York debut on January 29, 1921. The 1921 Broadway production by the Shubert brothers starred Jeanne Eagels, with Robert Warwick (playing a sixth-billed supporting character in the film) in Walter Huston's role of the husband and Edmund Lowe in the Warren William part of the lovestruck lieutenant.In the Night Watch at the Internet Broadway Database It provided the plot line for a 1925 French silent directed by Jacques de Baroncelli and distributed as Before the Battle in the English-speaking world. An American silent version was released in 1928 under the title Night Watch, directed by Alexander Korda, with stars Billie Dove and Paul Lukas. Three years after the release of The Woman from Monte Carlo,The Woman from Monte Carlo review (Pittsburgh Post-Gazette, February 15, 1932, page 6) another French version, directed by Marcel L'Herbier, with stars Annabella and Victor Francen, was released and subsequently marketed in English-speaking countries as Sacrifice of Honor."]}, {"page": "On with the Dance (1920 film)", "response": ["On with the Dance is 1920 American silent costume drama directed by George Fitzmaurice, starring Mae Murray and David Powell, and released by Paramount Pictures.  The film is a screen adaptation of the 1917 Michael Morton play by the same name.On With the Dance at SilentEra"]}, {"page": "Woman to Woman (1923 film)", "response": ["Woman to Woman is a 1923 British silent drama film directed by Graham Cutts, with Alfred Hitchcock as the uncredited assistant director and co-screenwriter. The film was the first of three adaptions of the 1921 play Woman to Woman by Michael Morton. To capitalise on the success of the film, Cutts and Hitchcock made another film, The White Shadow, with Compson before she returned to the United States."]}, {"page": "The Passionate Adventure", "response": ["The Passionate Adventure (1924) is a British silent film drama, directed by Graham Cutts and starring Clive Brook and Alice Joyce.  The film was adapted from a novel by Frank Stayton by Alfred Hitchcock and Michael Morton, with Hitchcock also credited as assistant director to Cutts.Graham Cutts (1885-1958) BFI Screen Online. Retrieved 27 August 2010"]}, {"page": "Robert Levy (producer)", "response": ["|Michael Morton"]}, {"page": "The White Shadow (film)", "response": ["The film is based on the unpublished novel Children of Chance by Michael Morton. Alfred Hitchcock collaborated with Cutts on the film. Cutts and Hitchcock made the film quickly, as they wanted to make use of Betty Compson, who had appeared in their hit Woman to Woman (also 1923), before she returned to the United States.Low p.135"]}, {"page": "Martin Miller (actor)", "response": ["Miller played a morgue keeper in Vernon Sewell's 1945 thriller Latin Quarter. The following year he had a role as Professor Hansen alongside Robert Newton in Lawrence Huntington's Night Boat to Dublin, and portrayed a postman in Maclean Rogers's romantic drama Woman to Woman, based on the play by Michael Morton."]}, {"page": "Woman to Woman (1929 film)", "response": ["Woman to Woman is a 1929 British drama film directed by Victor Saville and starring Betty Compson, George Barraud and Juliette Compton.BFI Database entry It is an adaptation of the 1921 play Woman to Woman by Michael Morton which had already been made in 1923 into a now-lost film. The 1929 version survives and unrestored copies are available on unofficial DVDs and streaming services."]}, {"page": "Woman to Woman (play)", "response": ["Woman to Woman is a 1921 play by the British writer Michael Morton.Low p.411 During the First World War, a British officer and a French dancer meet in a doomed romance.", "Category:Plays by Michael Morton"]}, {"page": "Woman to Woman (1947 film)", "response": ["Woman to Woman is a 1947 British drama film directed by Maclean Rogers and starring Douglass Montgomery, Joyce Howard and Adele Dixon.Goble p.1021 It is based on the 1921 play Woman to Woman by Michael Morton which had previously been made into films twice during the 1920s. A Canadian officer and a French dancer engage in a doomed romance."]}, {"page": "Colonel Newcome (play)", "response": ["Colonel Newcome is a 1906 play by the British writer Michael Morton. It is based on the character from the 1855 William Makepeace Thackeray novel The Newcomes. The part was written for the actor Herbert Beerbohm Tree.Matthews p.152", "Category:Plays by Michael Morton"]}, {"page": "Night Watch (1928 film)", "response": ["Night Watch is a 1928 American drama film directed by Alexander Korda and starring Billie Dove, Paul Lukas and Donald Reed. It was an adaptation of the dramatic 1921 play In the Night Watch, written by Michael Morton. The film is set almost entirely on a French warship at the beginning of the First World War. Although largely a silent film, Night Watch was the first of Korda's films to feature sound effects and music but no dialogue from Vitaphone.The Night Watch at silentera.com"]}, {"page": "The Yellow Passport", "response": ["The Yellow Passport is a lost 1916 silent film drama produced and distributed by the World Film Company. Based on Michael Morton's 1914 Broadway play of the same title, it was directed by Edwin August and starred Clara Kimball Young. On the stage the lead characters were played by Florence Reed and John Barrymore. Morton's story was filmed several times in the silent era and made as The Yellow Ticket in 1931 with Lionel Barrymore and Elissa Landi.The American Film Institute Catalog Feature Films: 1911-20 by The American Film Institute, c.1988"]}, {"page": "Caleb West (novel)", "response": ["The novel was adapted into a play by Michael Morton."]}, {"page": "Yellow ticket", "response": ["\"Yellow ticket\" was of additional significance for Jewish women, beyond prostitution. The yellow ticket as a residence permit allowed the holders to live beyond the Pale of Settlement, and according to contemporary witnesses thousands of young Jewish women took upon themselves the stigma of prostitute and the burden of biweekly medical check-ups without actually being prostitutes, for the purpose of escaping the Pale and seeking higher education in Moscow and Saint-Petersburg.\"White Slavery\", by Nelly Las in: Jewish Women: A Comprehensive  Historical Encyclopedia This situation was used in plots of a number of Jewish dramas in the early 20th century\"Торговля девушками: oсобая еврейская тема\", Jüdisches Berlin, November 1, 2012 (retrieved December 2, 2012) and notably in the 1914 Broadway play The Yellow Ticket by Michael Morton (which was the base of The Yellow Passport and The Yellow Ticket, US feature movies). Pola Negri, a Polish actress who later became a Hollywood star, acted in two silent film versions of the story (Poland 1915 and Germany 1918). A restored version of the latter toured the United States in 2013 accompanied by a newly commissioned score for the latter by the klezmer violinist Alicia Svigals."]}, {"page": "The Yellow Ticket (play)", "response": ["The Yellow Ticket is a 1914 Broadway play by dramatist Michael Morton, which premiered at the Eltinge 42nd Street Theatre in Manhattan on January 20, 1914.The Yellow Ticket, by Michael Morton, as produced by AH Woods on Broadway at the Eltinge 42nd Street Theatre; IBDb.com", "Category:Plays by Michael Morton"]}, {"page": "Deep Waters (1920 film)", "response": ["Deep Waters is a lostThe Library of Congress American Silent Feature Film Survival Catalog: Deep Waters 1920 American silent drama film directed by Maurice Tourneur and written by F. Hopkinson Smith, Michael Morton and John Gilbert. The film stars Rudolph Christians, Barbara Bedford, John Gilbert, Florence Deshon, Jack McDonald, Henry Woodward, and George Nichols. The film was released on October 10, 1920, by Paramount Pictures."]}, {"page": "A Daughter of Luxury", "response": ["A Daughter of Luxury is a 1922 American silent comedy film directed by Paul Powell and written by Beulah Marie Dix based upon the play The Imposter by Leonard Merrick and Michael Morton. The film stars Agnes Ayres, Tom Gallery, Edith Yorke, Howard Ralston, Edward Martindel, and Sylvia Ashton. The film was released on December 4, 1922, by Paramount Pictures."]}, {"page": "The Yellow Ticket (1918 film)", "response": ["The Yellow Ticket is a 1918 American silent drama film directed by William Parke and starring Fannie Ward. It is based on Michael Morton's 1914 play The Yellow Ticket. This screen adaptation of the play is currently classified as a lost film."]}]}}