{"wiki_id": "http://www.wikidata.org/entity/Q6831126", "itemLabel": "Michael Hicks Beach, Viscount Quenington", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Hicks_Beach,_Viscount_Quenington", "wikipedia_page": {"main": "Michael Hugh Hicks Beach, Viscount Quenington (19 January 1877 – 23 April 1916) was a British politician.", "link_mentions": [{"page": "Earl St Aldwyn", "response": ["Earl St Aldwyn, of Coln St Aldwyn in the County of Gloucester, is a title in the Peerage of the United Kingdom. It was created in 1915 for the prominent Conservative politician Michael Hicks Beach, 1st Viscount St Aldwyn, known from 1854 to 1907 as Sir Michael Hicks Beach, 9th Baronet, of Beverston. He was Chancellor of the Exchequer from 1885 to 1886 and again from 1895 to 1902. Hicks Beach had already been created Viscount St Aldwyn, of Coln St Aldwyn in the County of Gloucester, in 1906, and was made Viscount Quenington, of Quenington in the County of Gloucester, at the same time he was given the earldom. Both titles are in the Peerage of the United Kingdom. He was succeeded by his grandson, the second Earl, the son of Michael Hicks Beach, Viscount Quenington, Member of Parliament for Tewkesbury, who was killed in action in 1916. Lord St Aldwyn was also a Conservative politician and was Captain of the Honourable Corps of Gentlemen-at-Arms (government chief whip in the House of Lords) between 1958 and 1964 and 1970 and 1974.  the titles are held by his eldest son, the third Earl, who succeeded in 1992."]}, {"page": "United Kingdom by-election records", "response": ["*1916 Tewkesbury by-election: Michael Hicks Beach, Viscount Quenington had died of wounds in Egypt."]}, {"page": "Michael Hugh Hicks Beach", "response": ["#REDIRECT Michael Hicks Beach, Viscount Quenington"]}, {"page": "Michael Hugh Hicks-Beach", "response": ["#REDIRECT Michael Hicks Beach, Viscount Quenington"]}, {"page": "Michael Hicks Beach, 2nd Earl St Aldwyn", "response": ["St Aldwyn was the only son of Michael Hicks Beach, Viscount Quenington, who was killed in action in 1916, and the grandson of Michael Hicks Beach, 1st Earl St Aldwyn. His mother was Marjorie Brocklehurst, who also died in 1916, daughter of Henry Dent Brocklehurst. He succeeded his grandfather in the earldom in April 1916, aged only three. St Aldwyn was educated at Eton and later fought in the Second World War as a Major in the 1st Royal Gloucestershire Hussars."]}, {"page": "Michael Hicks Beach", "response": ["*Michael Hicks Beach, Viscount Quenington (1877–1916), British politician"]}, {"page": "1916 Tewkesbury by-election", "response": ["The Tewkesbury by-election of 1916 was held on 16 May 1916.  The by-election was held due to the death of the incumbent Conservative MP, Michael Hicks Beach, Viscount Quenington, in the First World War.  It was won by the Conservative candidate William Frederick Hicks-Beach, Quenington's uncle, then aged 74."]}, {"page": "Mollie Dent-Brocklehurst", "response": ["Through her paternal grandfather, Major John Henry Dent-Brocklehurst, she is a descendant of Henry Lascelles, 3rd Earl of Harewood, which makes her a fourth cousin of David Lascelles, 8th Earl of Harewood. Through her paternal grandfather, whose sister Marjorie Brocklehurst married Michael Hicks Beach, Viscount Quenington, she is also a second cousin of Michael Hicks Beach, 3rd Earl St Aldwyn."]}]}}