{"wiki_id": "http://www.wikidata.org/entity/Q6832551", "itemLabel": "Michael Marshall", "itemDescription": "Bishop of Woolwich", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Marshall_(bishop)", "wikipedia_page": {"main": "Michael Eric Marshall (born 14 April 1936) is a British Anglican bishop, who was the eighth Bishop of Woolwich in the Church of England from 1975 to 1984.Marshall was educated at Lincoln Grammar School and Christ's College, Cambridge and was ordained in 1961.  His first ministry position was as a curate at St Peter's Church, Spring Hill, Birmingham after which he was temporarily a tutor at Ely Theological College and then a chaplain at the University of London.  Appointed vicar of All Saints, Margaret Street in 1969, six years later he became the Bishop of Woolwich.  Resigning in 1984 he became the Director of the Anglican Institute in St Louis, Missouri in the United States before returning to England to be Director of Evangelism at Chichester Theological College.  He then became, first, priest in charge and, later, rector of Holy Trinity Sloane Street (1997–2007).  In 2003, he founded the Awareness Foundation with the Revd Nadim Nassar. He is President Emeritus of the Awareness Foundation and co-author of the Awareness Course. A prominent author, his many books include A Pattern of Faith (1966), Glory under Your Feet (1978), Pilgrimage and Promise (1981), Renewal in Worship (1982), The Gospel Connection and Flame in the Mind (2002). In retirement he serves as an assistant bishop in London.  His \"SPA\" (Scripture Prayer Action) ministry was developed with the Rev'd Soon Han Choi; SPA was initially based at the Church of the Annunciation, Marble Arch. Since leaving Holy Trinity Sloane Street Marshall has continued to work as President of the Awareness Foundation. Marshall's most recent book, The Transforming Power of Prayer: From Illusion to Reality, was the 2011 Mowbray Lent book.\nHe was made a deacon at Michaelmas 1960 (26 September) by Leonard Wilson, Bishop of Birmingham, at St Peter's Spring Hill (his title church), ordained a priest the Michaelmas following (25 September 1961) by Michael Parker, Bishop of Aston, at St Agatha's Church, Sparkbrook, and consecrated a bishop on 23 September 1975 by Donald Coggan, Archbishop of Canterbury, at Westminster Abbey.In 2011, it was announced that Marshall would be spending a year in New York City as the interim rector of the Episcopal Church of the Heavenly Rest on 5th Avenue. A new rector was installed there in October 2013. He is now back in London as one of the honorary assistant clergy at Holy Trinity Sloane Street.\n\n", "link_mentions": [{"page": "St Mary's Church, Putney", "response": ["In 1973 an arson attack resulted in the gutting of much of the church. Rebuilding was not completed until nearly ten years later, when the church was rehallowed by Rt. Revd. Michael Marshall the Bishop of Woolwich, on 6 February 1982. Since the restoration, the altar has not been positioned, as is usual, in the chancel or even at the eastern end of the nave, but instead halfway down the northern side of the nave, with the seating arranged to reflect this. The architect of the restoration was Ronald Sims. The pipe organ is by the Danish firm of Marcussen & Søn."]}, {"page": "Diocese of London", "response": ["*1984–present: Michael Marshall, former suffragan Bishop of Woolwich, lives in Chelsea and is also licensed as an honorary assistant bishop in Chichester diocese."]}, {"page": "Diocese of Chichester", "response": ["*1992–present: Michael Marshall, former suffragan Bishop of Woolwich, lives outside the diocese, in Chelsea, London."]}, {"page": "Michael Marshall", "response": ["Michael Marshall may refer to:", "* Michael Marshall (bishop) (born 1936), Bishop of Woolwich", "* Sir Michael Marshall (politician) (1930–2006), British politician", "* Michael Marshall (singer) (born 1965), American R&B singer", "* Michael Marshall (skeptic) (born 1983), British skeptical activist", "* Michael Marshall (drift driver)", "* Michael Marshall, pen name of Michael Marshall Smith (born 1965), British writer", "* Michael Marshall, Melbourne gangland war victim, see Carl Williams"]}, {"page": "Bishop of Woolwich", "response": ["|align=\"center\"| 1975 ||align=\"center\"| 1984 || Michael Marshall || "]}, {"page": "Mervyn Stockwood", "response": ["Stockwood was adept at making unusual and radical, but usually highly successful, appointments. John Robinson was appointed as his suffragan at Woolwich in 1959. Later Stockwood chose David Sheppard as Bishop of Woolwich in 1969 (after John Robinson's return to Cambridge), Hugh Montefiore as Bishop of Kingston in 1970, Michael Marshall to Woolwich in 1975 and Keith Sutton to Kingston in 1978."]}, {"page": "Lincoln Christ's Hospital School", "response": ["*Michael Marshall (born 1936), Bishop of Woolwich 1975–84: 1947–54"]}, {"page": "Gay bishops", "response": ["In 1994 the gay rights campaign group OutRage!, led by Peter Tatchell, began to concentrate on religious homophobia. It was revealed in the press that the new Bishop of Durham, Michael Turnbull, had a conviction for a gay sex offence and OutRage! disrupted his ordination ceremony. There were other bishops known or suspected to be gay in private and OutRage! held a demonstration outside Church House in London naming ten bishops and urging them to \"Tell the truth!\" Although the ten bishops were not named in the British press, their names were published in an Australian gay newspaper, the Melbourne Star Observer, and has since been published on the internet. They included Timothy Bavin (Bishop of Portsmouth), Brother Michael (Fisher) (assistant bishop, Ely), John Klyberg (Bishop suffragan of Fulham), Michael Marshall (assistant bishop, London), Brian Masters (area Bishop of Edmonton), John Neill (assistant bishop, Bath & Wells), Jack Nicholls (Bishop suffragan of Lancaster), Mervyn Stockwood (assistant bishop, Bath & Wells) and Michael Turnbull (Bishop of Durham).Melbourne Star Observer, 6 January 1995 However, OutRage produced no evidence for any of its claims."]}, {"page": "Holy Trinity, Sloane Street", "response": ["Holy Trinity has enjoyed a reputation for Anglican church music since its early days. A full choir was maintained from the completion of the present building until the 1970s directed by leading church musicians of their time, mentioned below. Since 1987, when Keith Yates attempted a revival, choral music has thrived thanks to the efforts of a succession of choirmasters. This continued under the vision of Bishop Michael Marshall, Andrew O’Brien (Director of Music 2002–2015) and organist Michael Brough when Holy Trinity Choir was reborn and the music tradition rebuilt. As well as a professional octet, the associate choir, conQordia continues to serve the church under the direction of Mike Abrams. The church also welcomes visiting choirs.", "As a local parish church, Holy Trinity offers a selection of liturgical worship and community events and is a concert venue. Uncluttered by static pews, the vast nave provides flexible space for concerts and events, the focus of some of which mirrors and re-expresses the artistic climate surrounding its first two decades. An arts and crafts guild was established by Michael Marshall early in his incumbency; more recently, an annual summer festival, the Chelsea Schubert Festival, appeared, supplemented by concerts and recitals during the rest of the year."]}, {"page": "Michael Eric Marshall", "response": ["#REDIRECT Michael Marshall (bishop)"]}, {"page": "Awareness Foundation", "response": ["The Trinity Foundation for Christianity and Culture (TFCC) was launched in September 2003 by Rowan Williams, Archbishop of Canterbury at a service at Holy Trinity, Sloane Street church. Co-founders Bishop Michael Marshall was rector of Holy Trinity from 1997 to 2007, and Nadim Nassar was an assistant curate in the parish. The charity was later renamed the Awareness Foundation.", "Nadim Nassar is Executive Director. He is co-founder of the Awareness Foundation along with Michael Marshall (President Emeritus of the Awareness Foundation). Nassar's first book, The Culture of God, was published by Hodder in 2018. He has been a guest blogger on the UK website of The Daily Telegraph, and both Marshall and Nassar have spoken around the world. Charles Longbottom was the Founding Chair of Trustees."]}, {"page": "Awareness Course", "response": ["The Awareness Course is the education programme of the Awareness Foundation. The course has been described  as helping \"Christians develop an informed response to the religious and cultural diversity around them by being centered in their faith and secure in their identity.\"St. Paul's K Street, Washington: http://www.stpauls-kst.com/node/61 It is co-written by retired bishop Michael Marshall and Nadim Nassar, who is the only Syrian priest in the Church of England.", "Michael Marshall is President of the Awareness Foundation and Nadim Nassar is director. They are co-founders of the Awareness Foundation and co-authors of the Awareness Course. The director of the Awareness Course is the foundation's operations director, St John Wright, who has been with the Awareness Foundation since 2004; he is the son of British jazz guitarist Denny Wright."]}, {"page": "Nadim Nassar", "response": ["The Revd Nadim Nassar (born 1964) is a Syrian-British Anglican priest, who is the Executive Director and Founder of the Awareness Foundation. He established the Awareness Foundation in 2003 with Bishop Michael Marshall in response to the growing need to study the Christian faith in the context of the 21st century."]}]}}