{"wiki_id": "http://www.wikidata.org/entity/Q6834739", "itemLabel": "Michael Symmons Roberts", "itemDescription": "writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Symmons_Roberts", "wikipedia_page": {"main": "Michael Symmons Roberts FRSL (born 1963 in Preston, Lancashire) is a British poet.\nHe has published eight collections of poetry, all with Cape (Random House), and has won the Forward Prize, the Costa Book Award and the Whitbread Prize for Poetry, as well as major prizes from the Arts Council and Society of Authors. He has been shortlisted for the T. S. Eliot Prize, the Griffin Poetry Prize and the Ondaatje Prize. He has also written novels, libretti and texts for oratorios and song cycles. He regularly writes and presents documentaries and dramas for broadcasting and is Professor of Poetry at Manchester Metropolitan University.", "link_mentions": [{"page": "Regent's Park College, Oxford", "response": ["* Michael Symmons Roberts, poet"]}, {"page": "1988 in literature", "response": ["*Eric Gregory Award: Michael Symmons Roberts, Gwyneth Lewis, Adrian Blackledge, Simon Armitage, Robert Crawford"]}, {"page": "1963 in literature", "response": ["*May 19 – Michael Symmons Roberts, English poet"]}, {"page": "Griffin Poetry Prize", "response": ["*Michael Symmons Roberts, Corpus"]}, {"page": "Royal Society of Literature", "response": ["| Michael Symmons Roberts"]}, {"page": "Chronicles of Barsetshire", "response": ["BBC Radio 4 released another radio adaptation titled The Barchester Chronicles in 2014. This programme was created by Michael Symmons Roberts, and also covered all six Barsetshire novels."]}, {"page": "2004 Whitbread Awards", "response": ["*Michael Symmons Roberts, Corpus", "*Michael Symmons Roberts, Corpus"]}, {"page": "James MacMillan", "response": ["MacMillan's music is infused with the spiritual and the political.  His Roman Catholic faith has inspired many of his sacred works; for example, Magnificat (1999), and several Masses. This central strand of his life and compositions was marked by the BBC Symphony Orchestra in early 2005, with a survey of his music entitled From Darkness into Light. MacMillan and his wife are lay Dominicans, and he has collaborated with Michael Symmons Roberts, a Catholic poet, and also Rowan Williams, the Archbishop of Canterbury. Perhaps his most political work is Cantos Sagrados (1990), a setting of Latin American poetry by Ariel Dorfman and Ana Maria Mendoza, combining elements of liberation theology with more conventional religious texts. MacMillan has explicitly stated that his aim in writing this work was to emphasise 'a deeper solidarity with the poor of that subcontinent' in the context of political repression.Sam Laughton, notes to Signum Records CD SIGCD507 (2004).", "MacMillan was composer and conductor with the BBC Philharmonic from 2000 to 2009, following which he took up a position as principal guest conductor with the Netherlands Radio Chamber Philharmonic.  His collaboration with Michael Symmons Roberts continued with his second opera, The Sacrifice (based on the ancient Welsh tales of the Mabinogion), being premiered by Welsh National Opera in Autumn 2007. Sundogs, a large-scale work for a cappella choir, also using text by Symmons Roberts, was premiered by the Indiana University Contemporary Vocal Ensemble in August 2006.", "*The Birds of Rhiannon (orchestra + optional chorus, text: Michael Symmons Roberts – 2001)"]}, {"page": "T. S. Eliot Prize", "response": ["*2010 – Bernardine Evaristo, Anne Stevenson and Michael Symmons Roberts", "* Ransom by Michael Symmons Roberts (Jonathan Cape)", "* Mancunia by Michael Symmons Roberts", "*Drysalter by Michael Symmons Roberts", "*Michael Symmons Roberts, Corpus", "*Michael Symmons Roberts, Burning Babylon"]}, {"page": "Michael Roberts", "response": ["*Michael Symmons Roberts (born 1963), British writer"]}, {"page": "Forward Prizes for Poetry", "response": ["* 2013: Michael Symmons Roberts, Drysalter (Cape Poetry)"]}, {"page": "List of cultural references to the September 11 attacks", "response": ["*Last Words (sequence) (2002) by Michael Symmons Roberts"]}, {"page": "Eric Gregory Award", "response": ["*1988: Michael Symmons Roberts, Gwyneth Lewis, Adrian Blackledge, Simon Armitage, Robert Crawford"]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|Michael Symmons RobertsCorpus", "|align=\"left\"|Michael Symmons RobertsDrysalter"]}, {"page": "2004 in poetry", "response": ["* Whitbread Award for poetry: Michael Symmons Roberts, \"Corpus\""]}, {"page": "1988 in poetry", "response": ["* Eric Gregory Award : Michael Symmons Roberts, Gwyneth Lewis, Adrian Blackledge, Simon Armitage, Robert Crawford"]}, {"page": "James Whitbourn", "response": ["* 2000 – winner of Sandford St Martin Premier Award (with poet Michael Symmons Roberts) for Pika.", "* The Wounds, Passiontide Sequence for mixed chorus, speaker, violin, cello and organ (2000, 2007); words from the Bible and by Michael Symmons Roberts", "* Whirlwind, Cantata for tenor, speaker, gospel choir, orchestra (2002); words by Michael Symmons Roberts"]}, {"page": "1963 in poetry", "response": ["* May 19 - Michael Symmons Roberts, English"]}, {"page": "Paul Farley", "response": ["As a broadcaster he has made many arts, features and documentary programmes for radio and television, as well as original radio dramas, and his poems for radio are collected in Field Recordings:BBC Poems 1998-2008. He makes regular appearances on BBC Radio 4’s Saturday Review, Front Row and BBC Radio 3's The Verb, and he presented the contemporary poetry programme The Echo Chamber on Radio 4 from 2012 to 2018. His book, Edgelands, a non-fiction journey into England’s overlooked wilderness (co-authored with Michael Symmons Roberts) was published by Jonathan Cape in 2011; it received the Royal Society of Literature’s Jerwood Award,Jerwood Awards the Foyles Best Book of Ideas Award 2012Foyles Best Book of Ideas Award and was serialised as a BBC Radio 4 Book of the Week.Book of the Week His fourth collection The Dark Film, was a Poetry Book Society Choice in 2012. In 2009 he received the E. M. Forster Award from the American Academy of Arts & Letters.American Academy of Arts and Letters He was elected a Fellow of the Royal Society of LiteratureRoyal Society of Literature in 2012.", "*Edgelands: Journeys into England's True Wilderness (with Michael Symmons Roberts) (London: Jonathan Cape, 2011) ", "*Deaths of the Poets (with Michael Symmons Roberts) (London: Jonathan Cape, 2017) "]}, {"page": "Drysalter", "response": ["*Michael Symmons Roberts; (2013); Drysalter; Jonathan Cape; (winner of the 2013 Costa Poetry Award). "]}, {"page": "Paradise Lost in popular culture", "response": ["A two-part adaptation by Michael Symmons Roberts was broadcast on BBC Radio 4 on 24 and 25 March 2018, with Ian McKellen as Milton, Frances Barber as Elizabeth, Simon Russell Beale as Satan, Jonathan Keeble as Beelzebub and Russell Dixon as God."]}, {"page": "Culture of Manchester", "response": ["Since 2000, Manchester Cathedral has sponsored the International Religious Poetry Competition. Judges have included Michael Schmidt, Michael Symmons Roberts and Linda Chase. In 2010 the cathedral re-established its Young Poets' Competition, a national competition open to all schools and all children from Key Stage 1-5. On 23 January 2010, the cathedral announced the appointment of its first Poet-in-Residence, Rachel Mann. On 21 October 2010, the cathedral hosted the inaugural Manchester Sermon. Developed in collaboration with the Manchester Literature Festival, the event was aimed at revitalizing the sermon as a literary form. The inaugural sermon was delivered by the internationally known novelist Jeanette Winterson."]}, {"page": "List of opera librettists", "response": ["Michael Symmons Roberts (born 1963)"]}, {"page": "The Sacrifice (opera)", "response": ["The Sacrifice is an opera in three acts composed by James MacMillan with a libretto by the poet Michael Symmons Roberts based on the Branwen story of the Welsh mythology collection, the Mabinogion. The world premiere took place on 22 September 2007 at the Donald Gordon Theatre of the Wales Millennium Centre, Cardiff. The production was staged by Welsh National Opera, directed by Katie Mitchell and conducted by the composer."]}, {"page": "Katie Mitchell", "response": ["*2009: Parthenogenesis an opera by James MacMillan and Michael Symmons Roberts at the Royal Opera House", "*2011: Clemency, an opera by James MacMillan and Michael Symmons Roberts at the Royal Opera House"]}, {"page": "Melly Still", "response": ["* Zaide – Mozart, in an English Version by Michael Symmons Roberts and Ben Power (Sadlers Wells, 2010)"]}, {"page": "Bollington Festival", "response": ["The aZZiZ company of drummers and dancers brought traditional music from South Africa, Ghana, Zimbabwe and Senegal, and Kim Schwartz and David Benitez demonstrated the sultry art of tango. There were also two big comedy nights: plays from (Dr Faustus, Wind In the Willows and Weekend Breaks by John Godber, and poetry with Carol Ann Duffy, Michael Symmons Roberts and Jackie Kay. There were also evenings with Barrie Rutter, founder of pioneering theatre company Northern Broadsides, and Sir Mark Elder, music director of the Hallé. Exhibitions included the work of artists working in and around Bollington – a map guided visitors round their studios. Up to 50 pictures by Guardian photographer Don McPhee were on show in the Arts Centre."]}, {"page": "Jerwood Award", "response": ["* Paul Farley and Michael Symmons Roberts for Edgelands – Journeys into England’s Last Wilderness, Cape (£2.5k each)"]}, {"page": "List of compositions by James MacMillan", "response": ["**scena, libretto by Michael Symmons Roberts; premiered on 12 September 2000 at Cambridge Corn Exchange by Britten Sinfonia, conducted by the composer.", "**opera in three acts; libretto by Michael Symmons Roberts, based on a story from the Mabinogion; premiered on 22 September 2007 at the Wales Millennium Centre by Welsh National Opera, directed by Katie Mitchell and conducted by the composer.", "**opera for 5 singers and string orchestra; text by anonymous and Michael Symmons Roberts; a co-production between ROH2 and Scottish Opera; premiered on 6 May 2011 at the Royal Opera House by the Britten Sinfonia, directed by Katie Mitchell and conducted by the composer."]}, {"page": "List of Desert Island Discs episodes (2011–present)", "response": ["|||||The Selected Poems of Michael Symmons Roberts ||His piano"]}, {"page": "Medicine Unboxed", "response": ["In 2015, Medicine Unboxed explored Mortality. The event took place on 21–22 November 2015 at the Parabola Arts Centre in Cheltenham. Those appearing included Nick Lane, Peter Stanford, Jay Carver, Henry Marsh, Allan Kellehear, Marion Coutts, Jane Draycott, Rebecca Goss, Jo Shapcott, Dave Goulson, Sue Black, Raymond Tallis, Salley Vickers, Tom de Freston, Rhidian Brook, Michael Symmons Roberts, Julian Baggini, Bob Heath, Katie Sidle, Peter Thomas, Rob George, Iona Heath, Paul McMaster, Sean Elyan, Ann Wroe and Sam Guglani."]}, {"page": "2013 in poetry", "response": ["* Michael Symmons Roberts, Drysalter, Jonathan Cape.", "**Best Collection: Michael Symmons Roberts, Drysalter (Cape Poetry)Book News: Forward Prize For Poetry Goes To Michael Symmons Roberts : The Two-Way : NPR"]}, {"page": "BBC Audio Drama Awards", "response": ["| Best Supporting ActressPresented by Stephen Mangan || Vicky McClureKicking the Air by Christine Murphy (BBC Northern Ireland, Radio 4) || Niamh CusackThe Man with Wings by Rachel Joyce (Radio 4)Gillian KearneySongs and Lamentations by Michael Symmons Roberts (BBC North, Radio 4)"]}, {"page": "2013 Costa Book Awards", "response": ["Winner: Michael Symmons Roberts, Drysalter"]}, {"page": "Michael Simmons Roberts", "response": ["#REDIRECT Michael Symmons Roberts "]}, {"page": "The Moth (magazine)", "response": ["The Moth International Poetry Prize (formerly the Ballymaloe International Poetry Prize) was established in 2011. €10,000 is awarded for a single unpublished poem, with three runner-up prizes of €1,000. The contest is open to anyone (over 16), as long as the poem is previously unpublished, and each year it attracts thousands of entries from new and established poets from over 50 countries.  The prize is judged anonymously by a single poet. Previous judges include Nick Laird, Claudia Rankine, Jacob Polley, Matthew Sweeney, Leontia Flynn, Marie Howe, Michael Symmons Roberts, Billy Collins, Deborah Landau and Daljit Nagra."]}, {"page": "Charley Genever", "response": ["Charley Genever is a poet, writer, and creative producer born and raised in Peterborough. She holds a BA in English Literature and Creative Writing from Aberystwyth University, and since graduating she returned to Peterborough where she was successfully selected onto the Emerge training programme for emerging artists in Peterborough. Since then she has worked with and performed for Cambridge Junction, Apples and Snakes, the Fitzwilliam Museum, the Curve, the Green Festival, and the Roundhouse. Most notably she collaborated with The Poetry Society and Southbank Centre where she programmed National Poetry Day Live and also performed as part of the day. She has shared the stage and worked with the likes of John Hegley, Attila the Stockbroker, Ross Sutherland, Patience Agbabi, Joelle Taylor, Simon Mole, Benjamin Zephaniah, Mark Grist, Vanessa Kisuule, and Michael Symmons Roberts. She also regularly hosts open mic night ‘Pint of Poetry’, and produces her own quarterly spoken word night ‘Freak Speak’."]}, {"page": "Marion Shoard", "response": ["* Open Country: Edgelands: BBC Radio 4 programme featuring Shoard alongside the poets Paul Farley and Michael Symmons Roberts."]}]}}