{"wiki_id": "http://www.wikidata.org/entity/Q6835588", "itemLabel": "Michaela Breeze", "itemDescription": "British weightlifter", "wikipedia_url": "https://en.wikipedia.org/wiki/Michaela_Breeze", "wikipedia_page": {"main": "Michaela Alica Breeze  (born 17 May 1979) is a British former weightlifter.  Breeze was born in Watford and raised in Cornwall and educated at Wadebridge School. She started weightlifting under the guidance of PE teacher Dave Allen. Breeze then went on to Bodmin Community College before attending the University of Wales Institute, Cardiff. \nBreeze is well known for commentating at various events including Rio Olympics and Tokyo Olympics.\nAfter nearly eighteen months of starting weightlifting she was put in touch with a new coach, Ken Price. She sustained a back injury in 2000, which saw her miss international competition and training for over a year.\nAfter taking a silver at the 2010 Commonwealth Games, Breeze retired from the sport and opened a gym in Aberdare. However, she made a comeback for the 2014 Commonwealth Games, motivated by a desire to push athletes she was coaching towards qualifying for the Games themselves. Breeze won a bronze medal in the 58 kg competition, setting a new Commonwealth Games snatch record and subsequently announced her second retirement.Breeze also taught PE at Ivybridge Community College in Devon. She was appointed Member of the Order of the British Empire (MBE) in the 2011 Birthday Honours for services to weightlifting.", "link_mentions": [{"page": "Ivybridge", "response": ["The town has six schools: Four state primary schools, the Dame Hannah Roger's special school, and Ivybridge Community College, the town's secondary state school, which has a sixth form. It has specialist status as a sports college and has recently been given awards in science and mathematics as well as languages. The school has a very large catchment area which stretches from Shaugh Prior on Dartmoor, to Bigbury on the coast and covers many of the villages in the South Hams such as Ugborough, Modbury and Yealmpton. There are no independent schools in Ivybridge, but Dame Hannah Rogers School provides a boarding education for children with disabilities and communication needs. The nearest university is the University of Plymouth. In 2008 a new library and resource centre called the Watermark was opened, replacing the small library on Keaton Road.  Notable people from the community college include sports teacher Michaela Breeze who won a gold medal weightlifting in the 2002 Commonwealth Games for Wales and won another gold medal in the 2006 Commonwealth Games., Nigel Martin (footballer) was a pupil, Chris Bell, a retired rugby union player with Leeds, Harlequins, Sale Sharks and Wasps, and the school's former principal – Geoffrey Rees now retired, who was given a CBE for his services to education."]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Michaela Breeze"]}, {"page": "Wadebridge", "response": ["In sport, Olly Barkley, the England rugby union international player, was raised in the town, as was Michaela Breeze, the Commonwealth weightlifting champion. Both were educated at Wadebridge School, as was Annabel Vernon, the 2007 World Rowing Champion Women's Quad Sculls."]}, {"page": "Breeze", "response": ["*Michaela Breeze (born 1979), British weightlifter"]}, {"page": "2002 Commonwealth Games results", "response": ["|Michaela Breeze Wales ||87.5 kg", "|Michaela Breeze Wales ||112.5 kg", "|Michaela Breeze Wales ||200.0 kg"]}, {"page": "Wales at the 2006 Commonwealth Games", "response": ["*Michaela Breeze, Women's 63 kg", "*Women: Michaela Breeze, Kate Howard, Natasha Perdue."]}, {"page": "1979 in Wales", "response": ["*17 May – Michaela Breeze, weightlifting champion"]}, {"page": "Seven Sport", "response": ["*Michaela Breeze (Powerlifting)"]}, {"page": "Wadebridge School", "response": ["*Michaela Breeze, weightlifting Commonwealth champion"]}, {"page": "Welsh Sports Hall of Fame", "response": ["* Michaela Breeze (Weightlifting)"]}, {"page": "Wales at the 2002 Commonwealth Games", "response": ["* Michaela Breeze, Weightlifting - 58 kg Snatch", "* Michaela Breeze, Weightlifting - 58 kg Clean and Jerk", "* Michaela Breeze, Weightlifting - 58 kg Combined"]}, {"page": "Ivybridge Community College", "response": ["* Michaela Breeze, former sports teacher (until 2012), won a gold medal weightlifting in the 2002 Commonwealth Games for Wales, was given an MBE at Buckingham Palace for her services to weightlifting in 2011 and won another gold medal in the 2006 Commonwealth Games."]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["The only British weightlifter to qualify for the games was Michaela Breeze who competed in her second Olympic Games. She battled through a back injury to finish 15th out of 20 competitors in her event.", "|align=left|Michaela Breeze"]}, {"page": "Weightlifting at the 2008 Summer Olympics – Qualification", "response": ["|Michaela Breeze"]}, {"page": "Cardiff School of Sport", "response": ["* Michaela Breeze"]}, {"page": "Weightlifting at the Commonwealth Games", "response": ["|Michaela Breeze", "|Michaela Breeze", "|Michaela Breeze"]}, {"page": "List of Cornish sportsmen and sportswomen", "response": ["*Michaela Breeze (born 1979), weightlifter"]}, {"page": "Wales at the 2010 Commonwealth Games", "response": ["The chef de mission for the Welsh team was Chris Jenkins whilst the overall team captain was weightlifter Michaela Breeze.", "|  || Michaela Breeze || Weightlifting || Women's 63 kg || 7 October", "|| Michaela Breeze"]}, {"page": "2010 in Wales", "response": ["|  || Michaela Breeze || Weightlifting || Women's 63 kg || 7 October"]}, {"page": "2003 European Weightlifting Championships", "response": ["| Michaela Breeze"]}, {"page": "List of European Weightlifting Championships medalists", "response": ["| Michaela Breeze"]}, {"page": "October 2010 in sports", "response": ["***Women's 63 kg:  Obioma Okoli  211 kg  Michaela Breeze  202 kg  Marie Josephe Fegue  198 kg"]}, {"page": "Weightlifting at the 2010 Commonwealth Games – Women's 63 kg", "response": ["|  ||align=left|Michaela Breeze ||align=left| || 61.68 || 92 || 110 || 202"]}, {"page": "Michaela Alicia Breeze", "response": ["#REDIRECT Michaela Breeze"]}, {"page": "Wales at the 2014 Commonwealth Games", "response": ["| Michaela Breeze", "|align=left|Michaela Breeze"]}, {"page": "British records in Olympic weightlifting", "response": ["|Michaela Breeze", "|Michaela Breeze", "|Michaela Breeze"]}]}}