{"wiki_id": "http://www.wikidata.org/entity/Q6831556", "itemLabel": "Michael Jackson", "itemDescription": "retired English professional football defender, born 1973", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Jackson_(footballer,_born_1973)", "wikipedia_page": {"main": "Michael James Jackson (born 4 December 1973) is an English former professional football defender, and former manager of Shrewsbury Town and Tranmere Rovers.", "link_mentions": [{"page": "Michael Jackson (disambiguation)", "response": ["Michael Jackson (1958–2009) was an American singer, songwriter and dancer known as the \"King of Pop\".", "Michael Jackson, Mike Jackson, or Mick Jackson may also refer to: ", "* Michael Jackson (radio commentator) (1934–2022), American radio talk show host, KABC and KGIL, Los Angeles", "* Michael Jackson (writer) (1942–2007), Beer Hunter show host, beer and whisky expert", "* Michael Jackson (television executive) (born 1958), British television executive", "* Michael Jackson (actor) (born 1970), Canadian actor", "* Michael Jackson (English singer) (born 1964), British singer with the heavy metal band Satan/Pariah", "* Oh No (musician) or Michael Jackson (born 1978), American rapper", "* Michael Jackson (American soldier) (1734–1801), soldier from Massachusetts, wounded at Bunker Hill", "* Salman Raduyev or Michael Jackson (1967–2002), Chechen warlord", "* Michael Jackson (linebacker) (born 1957), American NFL linebacker (1979–1986)", "* Michael Jackson (footballer, born 1963), Brazilian association footballer", "* Michael Jackson (basketball) (born 1964), American NBA pro basketball player, Sacramento Kings (1987–1990)", "* Michael Jackson (wide receiver) (1969–2017), American politician and NFL wide receiver", "* Michael Jackson (rugby league) (born 1969), rugby league footballer for Great Britain, Wakefield Trinity, Halifax", "* Michael Jackson (footballer, born 1980), English footballer", "* Michael Jackson (anthropologist) (born 1940), New Zealand, professor of social anthropology and writer", "* Michael Jackson (murderer) (born 1954), American convicted murderer", "* Michael Jackson (bishop) (born 1956), Church of Ireland Archbishop of Dublin, Ireland, since 2011", "* Michael Jackson (journalist), Niuean journalist and former politician", "* Michael Jackson, American criminal with Tiffany Cole", "* \"Michael Jackson\", a song by Cash Cash from The Beat Goes On", "* \"Michael Jackson\", a song by Das Racist from Relax", "* \"Michael Jackson\", a song by Fatboy Slim, B-side of \"Going Out of My Head\"", "* \"Michael Jackson\", a song by The Mitchell Brothers", "* \"Michael Jackson\", a song by Negativland from Escape from Noise"]}, {"page": "Danny Coyne", "response": ["On 23 July 2013, Coyne was appointed as a player–coach of Shrewsbury Town, following Gavin Ward's decision to accept a similar role with Nottingham Forest. He went on to become the new joint-assistant manager alongside Michael Jackson, following the club's relegation to League Two at the end of the 2013–14 season. On 6 October 2016, after Mellon left the club, Coyne was appointed as caretaker manager until further notice, overseeing four consecutive defeats during his brief tenure, before the appointment of Paul Hurst, whereupon he reverted to his previous coaching role."]}, {"page": "Micky Mellon", "response": ["Mellon was appointed as the new manager of Shrewsbury Town on 12 May 2014, with former caretaker manager Michael Jackson and Danny Coyne remaining as his assistants following the club's relegation back to League Two. Inheriting only a handful of players from the previous regime, Mellon made 16 signings over the close season, reuniting with former Fleetwood Town striker Andy Mangan, and ex-Barnsley players Liam Lawrence and Jordan Clark."]}, {"page": "2006–07 Blackpool F.C. season", "response": ["Blackpool's second away game, at Bristol City on 19 August, provided them with their first win. Goals from Scott Vernon (27'), Michael Jackson (50'), Keigan Parker (77') and Danny Graham (89') gave the Tangerines a 4–2 victory.Blackpool 0–1 Rotherham – BBC Sport", "For their FA Cup fourth-round replay ten days later, 'Pool travelled to Norwich. Michael Jackson put the visitors ahead with just under ten minutes of the first half remaining. That goal separated the teams for  the next forty minutes, until Darren Huckerby evened things up. The score remained 1–1 at full-time, and the match went into extra time. Five minutes into extra time, Huckerby scored his second goal of the game and the third of the tie. Shaun Barker levelled matters again just over ten minutes later, but Chris Martin hit what proved to be the winner with eight minutes remaining, putting Norwich through to face Chelsea in the next round.Norwich 3–2 Blackpool – BBC Sport", "|Michael Jackson"]}]}}