{"wiki_id": "http://www.wikidata.org/entity/Q6833840", "itemLabel": "Michael Richard Plowman", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Richard_Plowman", "wikipedia_page": {"main": "Michael Richard Plowman (born July 20, 1965) is a British composer and conductor, based in London, UK, Los Angeles County, California, and Vancouver, British Columbia, Canada.", "link_mentions": [{"page": "Tom Clancy's Splinter Cell (video game)", "response": ["Because the development team was aiming for a Teen ESRB rating, the team tried to minimize the level of violence. The soundtrack for the game was composed by English composer Michael Richard Plowman."]}, {"page": "List of film score composers", "response": ["* Michael Richard Plowman (born 1965)"]}, {"page": "Advent Rising", "response": ["The Advent Rising Soundtrack of the game was released on June 28, 2005, under record label Sumthing Else Music Works. The music was composed by Emmanuel Fratianni and Michael Richard Plowman,  whilst the additional music and orchestrations were performed by Laurie Robinson and Tommy Tallarico."]}, {"page": "24th Gemini Awards", "response": ["* Michael Richard Plowman, Impact", "* Michael Richard Plowman, Jibber Jabber: \"Race to the Red Planet\" and \"Pride of Frankenstein\""]}, {"page": "Leo Award for Best Sound in a Youth or Children's Program or Series", "response": ["* William Butler, Geoff Turner, Randy Kiss, and Michael Richard Plowman - Mustard Pancakes (\"The Totally Terrific Talent Show\") (PBS)"]}, {"page": "6th Canadian Screen Awards", "response": ["*Michael Richard Plowman, Avenues of Escape"]}, {"page": "List of major music film awards apart from Academy Award", "response": ["* Michael Richard Plowman"]}, {"page": "International Film Music Critics Association Award for Breakthrough Composer of the Year", "response": ["| Michael Richard Plowman"]}, {"page": "Leo Award for Best Musical Score in a Feature Length Documentary", "response": ["* Michael Richard Plowman - Letter from Masanjia", "* Michael Richard Plowman - Avenues Of Escape", "* Michael Richard Plowman - Sledhead", "* Michael Richard Plowman - Running on a Dream: The Legacy of Terry Fox", "* Michael Richard Plowman - Slammin' Iron: Rebuilding the World"]}]}}