{"wiki_id": "http://www.wikidata.org/entity/Q6838692", "itemLabel": "Mickey Lewis", "itemDescription": "English footballer and manager (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mickey_Lewis", "wikipedia_page": {"main": "Michael Lewis (15 February 1965 – 5 March 2021) was an English professional footballer and manager who played for West Bromwich Albion,  Derby County and Oxford United. From October 1999 to February 2000 and then again from January to March 2014 he was the caretaker manager at League Two side Oxford United following the departure of manager Chris Wilder to Northampton Town, before Gary Waddock was appointed head coach.He left Oxford in the middle of 2015 after a 27-year association with the club, and 8 years as a member of the coaching staff, and was appointed head coach/manager at Hayes & Yeading United in May 2016 after the departure of Garry Haylock. He stepped down as first-team manager in October 2016.", "link_mentions": [{"page": "1965", "response": ["** Mickey Lewis, English former footballer and manager (d. 2021)"]}, {"page": "Oxford United F.C.", "response": ["Oxford's poor form continued into the 1999–2000 season and, with the team in the relegation zone, Shotton resigned in late October. After a few months with Mickey Lewis as player-manager, former manager Denis Smith returned to the club, managing a twentieth-place finish, one place clear of relegation. Smith's second spell didn't last long, and he was replaced by David Kemp a few weeks into the following campaign. At the end of the 2000–01 season, Oxford were relegated back to the Third Division after a 35-year absence, with 100 goals conceded. They suffered 33 league defeats, the second-highest number of league defeats ever endured by a league club in a single season.", "After another bright start, Oxford led the table several times in the first half of the 2013–14 season. On 25 January 2014, with the club faltering though still in the play-off places, Wilder resigned as manager to take up the reins at relegation-threatened Northampton. Mickey Lewis subsequently became the caretaker manager for a second time for the club. On 22 March 2014, Gary Waddock was appointed the head coach of the club after a lengthy interview process, leaving his job as Head of Coaching at MK Dons. Under Lewis and Waddock, Oxford slipped out of the play-off places in the final few weeks of the season, finishing a disappointing eighth in the table, nine points off the last playoff place."]}, {"page": "Michael Lewis (disambiguation)", "response": ["* Mickey Lewis (born 1965), English footballer"]}, {"page": "Brian Horton", "response": ["Horton's next move was to become assistant to former Brighton teammate Mark Lawrenson, now rookie manager at Second Division Oxford United in May 1988. Lawrenson left the Manor Ground in October 1988 after star player Dean Saunders was sold to Derby County without his consent, and the board elected Horton as his replacement; at the time both Derby and Oxford were owned by members of Robert Maxwell's family. The million pound fee for Saunders allowed Horton to build a squad of his own: former Brighton teammate Steve Foster (Luton Town), Wales international Andy Melville (£270,000 from Swansea City), New Zealand international Ceri Evans (free agent), defensive midfielder Mickey Lewis (part-exchange to Derby for Trevor Hebberd), Jim Magilton (£100,000 from Liverpool), John Durnin (£250,000 from Liverpool), and England under-21 international winger Paul Simpson (£200,000 from Manchester City). He also gave débuts to Joey Beauchamp and Paul Kee. Under his leadership Oxford finished the 1988–89 Second Division campaign in 17th-place. In preparation for the 1989–90 campaign, he exploited the relationship between Derby and Oxford to sign Dave Penney for £175,000. On the pitch it was a case of deja-vu, as Oxford finished the season in 17th-place, again with 54 points. Hoping to build a promotion winning squad for the 1990–91 campaign, he bought Doncaster Rovers defender Les Robinson for £150,000. The \"Yellows\" finished in tenth-place, eight points off the play-off places."]}, {"page": "Moseley School", "response": ["*Mickey Lewis (MS), footballer and manager"]}, {"page": "Gary Waddock", "response": ["On 22 March 2014, Waddock was appointed as Head Coach of Oxford United, replacing caretaker manager Mickey Lewis. The club failed to reach the League Two play-offs under his managership, losing 7 of the 8 games played during his tenure, and his contract was terminated in July the same year after changes in the club's ownership."]}, {"page": "Gary MacDonald (footballer)", "response": ["In July 2016 he was announced by Hayes & Yeading United to be Mickey Lewis' playing assistant manager, having had two previous spells with the club, most recently in 2015 under Phil Babb and Tristan Lewis."]}, {"page": "Hayes & Yeading United F.C.", "response": ["Former Oxford United coach Mickey Lewis took the manager's reins for the 2016–17 season in the Southern League,New Manager – hyufc.com but dropped down to youth team duties in October after a poor run of form.Oxford United legend stands down as Hayes & Yeading boss – Get West London, 11 Oct 2016 Paul Hughes and Ritchie Hanlon were appointed as joint managers in November, joining from Kings Langley.Hayes & Yeading United F.C. Press Release – 2 Nov 2016 In the cups, Hayes & Yeading were knocked out of the FA Cup by Worthing in the 2nd Qualifying round, while their FA Trophy hopes were dashed at the first hurdle by Hitchin Town. They were then relegated from the 2016–17 Southern League Premier Division - to complete their 3rd relegation in 5 seasons - despite winning the Southern League Challenge Cup at St Ives Town on penalties."]}]}}