{"wiki_id": "http://www.wikidata.org/entity/Q6836947", "itemLabel": "Michelle Butterly", "itemDescription": "From Glasgow, Scotlandbut moved to Wallasey. Has three sisters Maxine and twin sisters Sheila and Valerie", "wikipedia_url": "https://en.wikipedia.org/wiki/Michelle_Butterly", "wikipedia_page": {"main": "Michelle Butterly (born 5 February 1970) is an English actress.", "link_mentions": [{"page": "British sitcom", "response": ["Michelle Butterly,"]}, {"page": "Soldier Soldier", "response": ["*Michelle Butterly as Julie Oldroyd (Series 7)"]}, {"page": "Derren Litten", "response": ["Litten's first sitcom was Benidorm, which began airing on ITV in 2007. The series follows various groups of holiday makers and staff in the all-inclusive Solana resort located in Benidorm. The series starred actors and actresses such as Jake Canuso, Janine Duvitski, Sheila Reid, Siobhan Finneran, Steve Pemberton, Elsie Kelly, Johnny Vegas, Chrissy Rock, Geoffrey Hutchings, Shelley Longworth, Tim Healy, Sherrie Hewson, Michelle Butterly, Bel Powley and Tony Maudsley .The series received strong ratings and later extended its runtime (including advertisement breaks) from 30 minutes to an hour. The show ran for 10 series ending in 2018."]}, {"page": "I Started a Joke", "response": ["Faith No More originally covered \"I Started a Joke\" as a B-side for their 1995 single \"Digging the Grave\". It also appeared on some versions of their fifth studio album King for a Day... Fool for a Lifetime but following the band's dissolution in 1998 it was released as their final single with their greatest hits album Who Cares a Lot?. The music video was filmed on 8 September 1998, after Faith No More had disbanded five months earlier and featured none of the band members. (Some fans claim that Mike Patton is the singer just leaving the stage as the video is beginning.) It was directed by Vito Rocco, filmed by Nick Sawyer with make-up by Julie Nightingale and Dani Richardson with Gabi Norland as the clapper loader. British actors Martin Freeman and Shaun Dingwall both feature in the promo, along with performance artist David Hoyle as the karaoke singer, and also stars Michelle Butterly of the ITV series, Benidorm. Derren Litten, the writer of Benidorm and a contributor to The Catherine Tate Show, is also seen in the video."]}, {"page": "St Mary's College, Wallasey", "response": ["* Michelle Butterly (b 1969), actress. "]}, {"page": "Eyes Down", "response": ["*Michelle Butterly - Pamela Henderson (Series 1)"]}, {"page": "Butterly", "response": ["*Michelle Butterly (born 1970), English actress"]}, {"page": "Beautiful People (British TV series)", "response": ["*Miss Perrin (Michelle Butterly), the headmistress at Simon's school, whom he counts as one of the few \"beautiful people\" in Reading."]}, {"page": "List of Beautiful People characters", "response": ["Miss Perrin (Michelle Butterly) is the headteacher at Simon's school in Reading. She was once a television star and appeared as a Hill's Angel on The Benny Hill Show, however she changed her career and became headteacher. Miss Perrin has ginger hair and claims she's often mistaken for Ginger Spice. She originates from Liverpool and speaks with a thick Liverpudlian accent, causing Aunty Hayley to mistake her for Cilla Black. A picture of her with Benny Hill shows her first name to be Cheryl. She excludes Simon for two days after both falsely believing he stole her clutch bag and caused a fight with school bully, Jayeson Jackson. She often wears powder pink colours and pearls, resulting in Simon describing her as \"the most glamorous person\" he knows. She is known to have attended university, as she mentions that she has letters after her name."]}, {"page": "Casualty (series 14)", "response": ["Sandra Huggett joins the cast in episode 1 as Holly Miles, a senior house officer. Kerrigan departs in episode 5, Pellegrino makes his final appearance in episode 7 and Marten exits in episode 8. Michelle Butterly and Kwame Kwei-Armah debut in episode 9 as paramedics Mel Dyson and Fin Newton respectively. Ronnie McCann made his first appearance as staff nurse Barney Woolfe in episode 12, while Ian Kelsey joins the cast in episode 15 as Patrick Spiller, a specialist registrar in emergency medicine. Ben Keaton guest appeared in episodes 16 and 18 as Spencer, a role he would reprise in the following series. Holby City character Julie Fitzjohn, portrayed by Nicola Stephenson, guest starred in episode 17. In December 1999, Goose announced her plans to leave the series. Kyd also chose to leave after becoming disheartened with his character. Goose and Kyd's characters depart in episode 30 in scenes filmed in Australia.", "*Michelle Butterly as Mel Dyson (from episode 9)"]}, {"page": "Casualty (series 15)", "response": ["*Michelle Butterly as Mel Dyson (until episode 36)"]}, {"page": "Benidorm (British TV series)", "response": ["Prior to the fifth series airing, Crissy Rock decided to leave in order to appear in the eleventh series of I'm a Celebrity...Get Me Out of Here!, though did make a one-off return. As a result, Sherrie Hewson joined the cast, playing the role of Joyce Temple-Savage, the new manageress of the Solana. Bazely, Drysdale and Griffiths were the only cast members of the fourth series to not return; Michelle Butterly was then cast in the role of Trudy, a character who accompanies Sam on holiday, thus acting as a replacement for Drysdale. All the remaining cast members returned. Alba Ortega had a brief role in the series, portraying the role of Carmen, the new colleague of Kenneth, who now owns a hair salon within the Solana. Asa Eliott, Elliott Jordan and Michael Fenton Stevens reprised their roles as himself, Jack and Sir Henry, respectively. This was the only series to feature Butterly, the last time Noreen featured until series 7 and Sam featured until series 9, and the last series to feature Sachs."]}, {"page": "List of Benidorm characters", "response": ["| Trudy || Michelle Butterly || colspan=\"4\"  || colspan=\"1\"  || colspan=\"5\"  || 5x01–5x07"]}, {"page": "List of Benidorm episodes", "response": ["The filming of the sixth series took place between March and June 2013. The series started broadcasting on ITV from 2 January 2014 and finished on 13 February 2014. All main characters from series 5 returned except for Hugh Sachs, Elsie Kelly, Shelley Longworth and Michelle Butterly. Series 6 also saw the introduction of a new family, the Dykes. They consisted of Clive (Perry Benson) Tonya (Hannah Waddingham) Tiger (Danny Walters) and Bianca (Bel Powley). Martin also returned for 2 episodes for his friend's stag do."]}, {"page": "Benidorm (series 5)", "response": ["The fifth series of the ITV1 television series Benidorm, which is a sitcom set in an all-inclusive holiday resort (The Solana) in Benidorm, Spain, began broadcasting on 24 February 2012, consisting of seven episodes. The series was directed by both John Henderson and Sandy Johnson, though was written by Derren Litten, Steve Pemberton and Neil Fitzmaurice. The series saw the returns of Garvey family, consisting of Mick (Steve Pemberton), Janice (Siobhan Finneran), Michael Garvey (Oliver Stokes) and Janice's mother Madge Barron (Sheila Reid); swingers Donald (Kenny Ireland) and Jacqueline Stewart (Janine Duvitski); Noreen Maltby (Elsie Kelly); hairdressers Gavin Ramsbottom (Hugh Sachs) and Kenneth Du Beke (Tony Maudsley); Sam Wood (Shelley Longworth) and Solana staff Mateo Castellanos (Jake Canuso), Les/Lesley Conroy (Tim Healy) and Liam Conroy (Adam Gillen). Sherrie Hewson and Michelle Butterly joined the cast of Joyce Temple-Savage, the new Solana manageress, and Trudy, the new holiday companion of Sam, respectively. Paul Bazely, Kathryn Drysdale and Selina Griffiths did not return; Crissy Rock did not return either, though did make a brief return during the sixth episode.", "* Michelle Butterly as Trudy"]}, {"page": "Butterly, Michelle", "response": ["#redirectMichelle Butterly"]}, {"page": "List of alumni of the Royal Central School of Speech and Drama", "response": ["* Michelle Butterly"]}]}}