{"wiki_id": "http://www.wikidata.org/entity/Q6838052", "itemLabel": "Mick Barnard", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mick_Barnard", "wikipedia_page": {"main": "Mick Barnard was a guitarist in the UK rock band The Farm (sometimes called Farm, and not to be confused with the 1980s/1990s British band of the same name). He was also the guitarist of the band Genesis for a brief time, following the departure of founding member Anthony Phillips, just before Steve Hackett came in and replaced him. Barnard does not appear on any released Genesis recordings.\nAfter leaving Genesis, Barnard embarked on a successful career in audio engineering, founding the Bel Digital Audio company in 1975.", "link_mentions": [{"page": "Genesis (band)", "response": ["After a short holiday, Genesis began to write and rehearse as a four-piece band in Farnham, Surrey. The now empty guitar sections in their songs allowed Banks and Rutherford to expand their sound and play what Gabriel described as \"interesting chords\". As they had not found a new guitarist, Genesis resumed as a live act with Rutherford adding bass pedals and Banks playing lead guitar lines on a Pianet through a distorted fuzz box amplifier in addition to his keyboard parts, something that he credits in helping him develop his technique. In November 1970, after a second audition with Caryl fell through, Dave Stopps, owner of Friars club in Aylesbury, suggested they use Mick Barnard of The Farm, who joined the band for their gigs; which included Genesis's television debut on BBC's Disco 2. After two months of performances, the band found Barnard lacked in expertise and wished to try someone else. In December, Gabriel spotted a Melody Maker advert from Steve Hackett, formerly of Quiet World, who wanted to join a band of \"receptive musicians, determined to drive beyond existing stagnant music forms\". Gabriel advised Hackett to become familiar with Trespass and attend their upcoming gig at the Lyceum Theatre in London. Hackett auditioned with the group in a flat in Earl's Court and formed an instant rapport with Rutherford through a common interest in inverted chords. After Hackett joined in January 1971, Stratton-Smith organised a UK tour with Genesis opening for fellow Charisma acts Lindisfarne and Van der Graaf Generator. Their first overseas dates took place in March with gigs in Belgium followed by their first of three consecutive appearances at the annual Reading Festival on 26 June.", "*Mick Barnard – electric and acoustic guitars (1970–1971)"]}, {"page": "Steve Hackett", "response": ["In December 1970, Hackett placed an advertisement in Melody Maker in his search for a new band. It read: \"Imaginative guitarist-writer seeks involvement with receptive musicians, determined to strive beyond existing stagnant music forms\". In a 2021 interview, Hackett explained that, by 'stagnant', he meant a lack of inclusion among the different music genres in the 1970s. The ad was responded to by Genesis lead vocalist Peter Gabriel. Genesis, which also comprised keyboardist Tony Banks, bassist Mike Rutherford, and drummer Phil Collins, had lost founding guitarist Anthony Phillips and sought a new, permanent replacement to his temporary replacement Mick Barnard. Gabriel advised Hackett to listen to their last album Trespass (1970) before Hackett auditioned for the group. Hackett's first live gig with Genesis took place at City University, London on 24 January 1971."]}, {"page": "Trespass (album)", "response": ["At the same time, the group decided to replace Mayhew with a more suitable drummer. He was older than the rest of the band and considered an outsider, not contributing much to writing and lacking confidence. An urgent replacement was required to fulfil live dates to promote Trespass. Phil Collins auditioned and joined in August, and the album was released in October. The group could not find a suitable replacement for Phillips, so they resumed gigging as a four-piece. In late 1970, they appeared on the television show Disco 2 to promote the album with Phillips' replacement, Mick Barnard. The group mimed with Gabriel singing live, who recalled the performance was \"disastrous\". The group auditioned Steve Hackett as a replacement in December and he officially joined the band the following month."]}, {"page": "Nursery Cryme", "response": ["Phil Collins joined as the new drummer in August, also becoming an important backing vocalist, but they were unable to find a suitable replacement for Phillips. This led to the group completing the first half of their 1970–1971 tour as a four-piece with Rutherford playing rhythm guitar and bass pedals and Banks playing lead guitar lines on a Pianet through a distorted fuzz box amplifier in addition to his own keyboard parts. Banks credited this to improving his technique as it required him to play two keyboards simultaneously. The group felt that Collins was the best drummer they had worked with at that point, and his playing style and musical tastes gave a new dimension to their sound. Some songs were not practical to play live as a four-piece, so they decided to look again for a lead guitarist. In November 1970, Mick Barnard joined the group on recommendation from Friars Aylesbury's David Stopps, and \"The Musical Box\" was added to the live set. However, the rest of the group quickly realised that Barnard was not up to the same standard as the others, and they kept a look out for a better player."]}]}}