{"wiki_id": "http://www.wikidata.org/entity/Q6833987", "itemLabel": "Michael Rothenstein", "itemDescription": "British artist (1908-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Rothenstein", "wikipedia_page": {"main": "William Michael Rothenstein  (19 March 1908 – 6 July 1993) was an English printmaker, painter and art teacher.", "link_mentions": [{"page": "William Rothenstein", "response": ["He married Alice Knewstub in 1899 with whom he had four children: John, Betty, Rachel and Michael. John Rothenstein later gained fame as an art historian and art administrator (he was Director of the Tate Gallery from 1938 to 1964 and was knighted in 1952).Edward Chaney, \"The Vasari of British Art: Sir John Rothenstein... and the Importance of Wyndham Lewis\", Apollo, vol. CXXXII, no. 345 (November 1990), pp. 322–26 Michael Rothenstein was a talented printmaker.Nicholas Usherwood, 'Rothenstein, (William) Michael Francis (1908–1993)', Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 30 January 2014"]}, {"page": "Eric Ravilious", "response": ["A 1933 painting of Ravilious and Edward Bawden, by Michael Rothenstein, was acquired by the National Portrait Gallery in 2012."]}, {"page": "Great Bardfield", "response": ["Bardfield was the home of many important twentieth-century English artists who hosted a series of important 'open house' exhibitions in the village during the 1950s. These exhibitions garnered national press attention and attracted thousands of visitors. The Great Bardfield Artists of the 1940s and 1950s were: John Aldridge,  Edward Bawden, George Chapman, Stanley Clifford-Smith,  Audrey Cruddas,  Walter Hoyle, Michael Rothenstein, Eric Ravilious (who lodged with Bawden at Brick House), Sheila Robinson and  Marianne Straub. Other artists linked to the art community include Joan Glass, Duffy Ayers, Laurence Scarfe and the political cartoonist David Low."]}, {"page": "List of dream diaries", "response": ["*Nancy Price (1880–1970), Acquainted with the Night: A Book of Dreams (n.d.; 1949 according to the British Library catalogue). Illustrated by Michael Rothenstein. Written by an actress, who also made a name for herself as a naturalist and campaigner for animal rights."]}, {"page": "Stanley Clifford-Smith", "response": ["During the Second World War, Clifford-Smith was a member of the Royal Naval Volunteer Reserve. After leaving the armed forces, he married the English artist Joan Glass (1915-2000). The couple left London for Suffolk in 1947. While in East Anglia he painted mainly religious works much influenced by the French expressionist, Georges Rouault. In 1952 he moved with his family to Great Bardfield in north west Essex, firstly living in Buck's House, Great Bardfield. In his new home Clifford-Smith was an active member of the Great Bardfield art community during the mid to late 1950s and later became the Honorary Secretary of the group. During the 1950s the Bardfield artists included: John Aldridge, Edward Bawden, George Chapman, Stanley Clifford-Smith, Audrey Cruddas, Joan Glass, Walter Hoyle, Sheila Robinson, Michael Rothenstein, Marianne Straub, among others. The Great Bardfield Artists were diverse in style and rivalled the better known art community at St. Ives. Clifford-Smith and the other Bardfield artists exhibited in the large 'open house' shows in the isolated village in 1954, 1955 and 1958. These shows attracted thousands of visitors and made the art community famous thanks to national press coverage and several one-off and touring shows in the late 1950s."]}, {"page": "Audrey Cruddas", "response": ["In the early 1950s, Cruddas moved to the Essex village of Great Bardfield. At Bardfield she became involved with the dynamic art community which included: John Aldridge, Edward Bawden, George Chapman, Stanley Clifford-Smith, Joan Glass, Walter Hoyle, Sheila Robinson, Michael Rothenstein, Marianne Straub, among others. During this  period she focused on watercolour paintings."]}, {"page": "Fry Art Gallery", "response": ["The Fry Art Gallery is home to the North West Essex Collection, a set of more than 3,000 works by diverse, nationally important artists who have lived or worked in the area. The collection includes paintings, prints, books, artists' scrapbooks, ceramics, wallpapers and decorative designs. There is an emphasis on artists who worked in and around Great Bardfield in the middle of the twentieth century, including Edward Bawden, Eric Ravilious, Tirzah Garwood, John Aldridge, Sheila Robinson, Bernard Cheese, Walter Hoyle, Michael Rothenstein, Kenneth Rowntree, George Chapman and Marianne Straub. Artists in the collection with a connection to the wider area include Michael Ayrton, John Bellany, Robert Colquhoun, Robert MacBryde, Grayson Perry and Keith Vaughan.", "The gallery displays a revolving selection of works from the collection in themed exhibitions. In 2016/17 the exhibitions held were: Exploring – Inspirational Places for North West Essex Artists, and three sequential temporary exhibitions: George Chapman – From Bardfield to the Rhondda; Michael Rothenstein – Sustained Invention; and Connections."]}, {"page": "Duffy Ayers", "response": ["Born in Great Missenden, Buckinghamshire, one of a pair of identical twin girls of an American mother and an Irish father, the brother of the politician and poet Desmond FitzGerald,  Mel Gooding, \"Duffy Ayers obituary\", The Guardian, 11 December 2017 Betty M D Fitzgerald in England & Wales, Civil Registration Birth Index, 1837-1915, ancestry.com, accessed 15 November 2021  she trained at the Central School of Art in London, and later married the painter and printmaker Michael Rothenstein RA, son of William Rothenstein. In 1941 the couple moved to Chapel Cottage in the Essex village of Great Bardfield, and relocated the next year to Ethel House in the centre of the village. Duffy and Michael were important members of the famous art community which lived in the north Essex village during the post-war period. At Great Bardfield she was mainly known as Duffy Rothenstein, although she still painted under the name of Betty Fitzgerald. The Rothensteins, along with other village artists, organised a series of large open-house exhibitions that garnered much press attention during the 1950s. During this time Duffy painted mostly portraits, and exhibited some of her work at the 1955 Great Bardfield Artists’ summer exhibition.", "By the end of 1955 her marriage to Michael Rothenstein had dissolved, and she left Great Bardfield. She settled in Bloomsbury, London, and married the graphic artist, Eric Ayers (1921 - 2001). After her second marriage she painted under the name of Duffy Ayers, and regularly exhibited at the Royal Academy. One of her oil portraits, \"The Arrival\" (1993) is in the North West Essex collection of the Fry Art Gallery, Saffron Walden."]}, {"page": "Great Bardfield Artists", "response": ["The principal artists who lived there between 1930 and 1970 were John Aldridge RA, Edward Bawden, George Chapman, Stanley Clifford-Smith, Audrey Cruddas, Walter Hoyle,  Eric Ravilious,  Sheila Robinson, Michael Rothenstein, Kenneth Rowntree and Marianne Straub. Other artists associated with the group include Duffy Ayers, John Bolam, Bernard Cheese, Tirzah Garwood, Joan Glass, David Low and Laurence Scarfe. Great Bardfield Artists were diverse in style but shared a love for figurative art, making the group distinct from the better known St Ives School of artists in St Ives, Cornwall, who, after the war, were chiefly dominated by abstractionists. "]}, {"page": "Nancy Price", "response": ["* Acquainted with the Night. A book of dreams (Illustrated by Michael Rothenstein, Oxford : George Ronald, 1949)"]}, {"page": "Brenda Rawnsley", "response": ["The selected artists were asked to produce a lithograph using no more than six colours, to help with mass production. Artists in the first two series of prints produced in 1946 and 1947 included John Nash (Harvesting, 1947), Feliks Topolski, John Skeaping, David Gentleman, Edwin La Dell (Tower of London, 1945), Hans Feibusch, L.S. Lowry (Punch and Judy, 1946), Michael Rothenstein, Julian Trevelyan (Harbour, 1946) and John Tunnard. The lithographs were printed from stone or zinc plates by Thomas Griffiths and the Baynard Press."]}, {"page": "British Library Sounds", "response": ["Intimate encounters with the life and work of British painters, sculptors, photographers and architects. Interviewees include sculptors Elisabeth Frink and Eduardo Paolozzi; painters Terry Frost, Paula Rego and Michael Rothenstein; photographers Grace Robertson, Mari Mahr and Helen Chadwick; and architects Denys Lasdun, Ralph Erskine, Edward Hollamby and Patrick Gwynne. "]}, {"page": "Jack Coutu", "response": ["Jack Coutu has exhibited at the Royal Academy in London, netsuke conventions, jointly with Michael Rothenstein at the Alecto Gallery in 1965, and at the Graphic Arts Gallery in 1968. His work is in the permanent collections of the Arts Council of Great Britain, Cartwright Hall art gallery in Bradford, King Gustave of Sweden, the Museum of Fine Arts in Boston, Massachusetts, and the Victoria and Albert Museum in London."]}, {"page": "Roy Turner Durrant", "response": ["He left school at 14 years of age but continued to spend his spare time drawing and painting.  He worked in a local electrical shop and during the war Durrant joined the Suffolk Regiment (1944 to 1947).  After the war he secured a place at Camberwell College of Arts where he was taught by amongst others by  Edward Ardizzone Michael Rothenstein Keith Vaughan and  John Buckland Wright. and was a contemporary of Theodore Mendez. Whilst at Camberwell he was already exhibiting his paintings in London galleries.   His work moved from early landscape and architectural interest to abstraction but with a great variety of style and technique."]}, {"page": "Rothenstein", "response": ["*Michael Rothenstein (1908–1993), English printmaker, painter and art teacher"]}, {"page": "List of Royal Academicians", "response": ["| Michael Rothenstein   ||align=\"center\" |  1983  ||"]}, {"page": "List of alumni of the Central School of Art and Design", "response": ["* Michael Rothenstein"]}, {"page": "War Artists' Advisory Committee", "response": ["* Michael Rothenstein"]}, {"page": "Redstone Press", "response": ["Redstone Press is a London-based art book publisher that was founded in 1986 by Julian Rothenstein,Cynthia Rose, \"The Redstone Press: Books in Boxes\", International Herald Tribune. Reprinted at Mucha Creative. the son of English portrait painter Duffy Ayers and her first husband, the painter and printmaker Michael Rothenstein. Redstone Press has been characterised as \"a shining example of how books should be published. Their books are beautifully designed and flawlessly produced with fantastically original and entertaining content.\"Sophie Rochester, \"Sophie’s Eleven\", The Writer's Hub. Publisher Julian Rothenstein, who has been called \"a one-man art movement\",Christopher Howse, \"What the eye don’t see\" - review of The Redstone Book of the Eye by Julian Rothenstein (Square Peg, 2011), The Spectator, 20 August 2011. is also the press's editor and designer."]}, {"page": "Birgit Skiöld", "response": ["Artists sought out the Print Workshop to use the facilities, share knowledge and learn from Skiöld. These included Michael Ayrton, Fionnuala Boyd, Kathan Brown, Jim Dine, David Hockney, Allen Jones, Eduardo Paolozzi, Tom Phillips, Dieter Roth, Michael Rothenstein, William Tillyer, Joe Tilson and William G. Tucker."]}, {"page": "Rothenstein, Michael", "response": ["#redirectMichael Rothenstein"]}, {"page": "Agathe Sorel", "response": ["Agathe Sorel was born in 1935 in Budapest.  She studied at the Academy of Applied Arts and Academy of Fine Arts in Budapest. In 1956, she left Hungary with her mother because of the anti-Soviet revolution and settled in England. The same year she enrolled at the Camberwell School of Art in London. At Camberwell she spent about a year and a half and met many interesting artists there, including Michael Rothenstein, Robert Medley, R.B. Kitaj, Heinz Inlander, Julian Trevelyan, and Anthony Gross. In 1958 Sorel won Gulbenkian Scholarship and moved to Paris for two years to study at the Ecoles des Beaux Arts, the Sorbonne and etching under Stanley William Hayter at Atelier 17."]}, {"page": "Jeanette Rutherston", "response": ["Jeanette Bertha Rothenstein was born on 10 March 1902 in Bradford, Yorkshire, the daughter of textile manufacturer, art collector and philanthropist Charles Lambert Rothenstein, who changed his German surname in 1916 to make clear his allegiance to the British during World War I. The Rothensteins were Jewish.  Her uncles were artist William Rothenstein and stage designer Albert Rutherston.  Artist Michael Rothenstein and art historian John Rothenstein were her first cousins."]}, {"page": "Grabowski Gallery", "response": ["Several of the gallery's exhibition catalogues from 1959 onwards are in the Special Collections of Leeds University Library, including catalogues for exhibitions by Ivor Abrahams, Michael Sandle and Michael Rothenstein."]}]}}