{"wiki_id": "http://www.wikidata.org/entity/Q6831294", "itemLabel": "Michael Hunter", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Hunter_(historian)", "wikipedia_page": {"main": "Michael Cyril William Hunter  (born 1949) is Emeritus Professor of History in the department of history, classics and archaeology and a Fellow of Birkbeck, University of London.  Hunter is interested in the culture of early modern England.  He specialises in the history of science in seventeenth- and early eighteenth-century England, particularly the work of Robert Boyle. In Noel Malcolm's judgement, Hunter \"has done more for Boyle studies than anyone before him (or, one might almost say, than all previous Boyle scholars put together)\".", "link_mentions": [{"page": "John Aubrey", "response": ["A large part of the \"Lives\" was published in 1813 as Letters Written by Eminent Persons in the Seventeenth and Eighteenth Centuries. A near-complete transcript, Brief Lives, Chiefly of Contemporaries, Set Down by John Aubrey, Between the Years 1669 and 1696, was edited for the Clarendon Press in 1898 by the Rev. Andrew Clark. This remained the standard edition for scholarly use for many years, but (from a modern perspective) was flawed by the number of excisions Clark had made in the interests of \"decency\". In the 20th century, a number of more popular editions appeared, which often included the expurgated passages, but were in other respects far more selective: these included versions edited by John Collier (under the title The Scandal and Credulities of John Aubrey; 1931), Anthony Powell (1949), Oliver Lawson Dick (1949), Richard Barber (1975), and John Buchanan-Brown (2000; with an introduction by Michael Hunter). The most scholarly and complete edition, and now the standard edition for reference purposes, is Kate Bennett (ed.), Brief Lives with An Apparatus for the Lives of our English Mathematical Writers (2 volumes, Oxford, 2015), which was described on publication by Michael Hunter as \"the edition we have been waiting for\".Hunter 2015"]}, {"page": "Elias Ashmole", "response": ["After the surrender of Worcester to the Parliamentary Forces in July 1646, he retired to Cheshire. Passing through Lichfield on his way there, he learnt that his mother had died just three weeks before from the plague.Josten, vol. I, p. 33 During this period, he was admitted as a freemason. His diary entry for 16 October 1646 reads in part: \"I was made a Free Mason at Warrington in Lancashire, with Coll: Henry Mainwaring of Karincham [Kermincham] in Cheshire.\"Josten, vol. II, pp. 395–396Henry Mainwaring was a cousin of Ashmole's first wife who had fought with the Parliamentary forces (Josten, vol. I, p. 33). Although there is only one other mention of masonic activity in his diary he seems to have remained in good standing and well-connected with the fraternity as he was still attending meetings in 1682. On 10 March that year he wrote: \"About 5 H: P.M. I received a Sumons  to appeare at a Lodge to held the next day, at Masons Hall London.\" The following day, 11 March 1682, he wrote: \"Accordingly, I went ... I was the Senior Fellow among them (it being 35 yeares since I was admitted) ... We all dyned at the halfe Moone Taverne in Cheapeside, at a Noble Dinner prepaired at the charge of the New-accepted Masons.\"Josten, vol. IV, pp. 1699–1701 Ashmole's notes are one of the earliest references to Freemasonry known in England,Michael Hunter calls it the first (see Hunter, 2004), but other sources propose Robert Moray in 1641 as the first Speculative Mason whose name is known (see ). but apart from these entries in his autobiographical notes, there are no further details about Ashmole's involvement.", "In 1669, Ashmole received a Doctorate in Medicine from the University of Oxford. He maintained his links with the University and, in 1677, Ashmole made a gift of the Tradescant Collection, together with material he had collected independently, to the University on the condition that a suitable home be built to house the materials and make them available to the public. Ashmole had already moved into the house adjacent to the Tradescants' property in 1674 and had already removed some items from their house into his. In 1678, in the midst of further legal wrangling over the Tradescant Collection, Hester was found drowned in a garden pond. By early 1679, Ashmole had taken over the lease of the Tradescant property and began merging his and their collections into one.Swann, pp. 40–54 The Ashmolean Museum was completed in 1683, and is considered by some to be the first truly public museum in Europe.Unlike previous collections assembled by aristocrats, the museum was open to anyone, regardless of rank, who could afford the entrance fee (Swann, pp. 40–54). According to Anthony Wood, the collection filled twelve wagons when it was transferred to Oxford. It would have been more, but a large part of Ashmole's own collection, destined for the museum, including antiquities, books, manuscripts, prints, and 9,000 coins and medals, was destroyed in a disastrous fire in the Middle Temple on 26 January 1679.Ashmole's collection had escaped the Great Fire of London in 1666; it was evacuated by barge before the fire reached the Temple precincts, which were, in any case, largely spared from the fire (Josten, vol. I, p. 158). As a result of the fire, the proportion of the collection derived from the Tradescants was larger than originally anticipated and in the opinion of Professor Michael Hunter this misfortune has contributed to criticisms that Ashmole took an unfair share of the credit in assembling the collection at the expense of the Tradescants.", "Vittoria Feola, in her recent monograph, Elias Ashmole and the Uses of Antiquity (Paris, 2013) has described Ashmole as an antiquary first and foremost, who understood the value of the New Science, which he promoted through his Museum. Feola, however, has warned that antiquity was Ashmole's greatest passion, as well as his main tool for self-fashioning. Michael Hunter, in his entry on Ashmole for the Oxford Dictionary of National Biography, concluded that the most salient points of Ashmole's character were his ambition and his hierarchical vision of the world—a vision that unified his royalism and his interests in heraldry, genealogy, ceremony, and even astrology and magic. He was as successful in his legal, business and political affairs as he was in his collecting and scholarly pursuits. His antiquarian work is still considered valuable, and his alchemical publications, especially the Theatrum Chemicum Britannicum (1652), preserved many works that might otherwise have been lost. He formed several close and long-lasting friendships, with the astrologer William Lilly for example,Samuel Pepys describes in his diary an evening at Lilly's house on 24 October 1660, where Pepys met Ashmole and thought him \"a very ingenious gentleman\". but, as Richard Garnett observed, \"acquisitiveness was his master passion\".Garnett, Richard (1891, repr. 1973). \"Ashmole, Elias (1617–1692).\" Dictionary of National Biography (London: Oxford University Press)."]}, {"page": "Miri Rubin", "response": ["*Love, Friendship and Faith in Europe, 1300-1800 (Houndmills: Palgrave Macmillan, 2005), , ed. with Laura Gowing and Michael Hunter"]}, {"page": "Alan Bray", "response": ["The Roman Catholic Caucus of the Gay and Lesbian Christian Movement, of which Bray was a member, instituted a series of Alan Bray Memorial Lectures on Catholic theology and homosexuality. British historians Michael Hunter, Miri Rubin, and Laura Gowing co-edited the book Love, Friendship and Faith in Europe, 1300–1800 (Palgrave Macmillan, 2005),  a collection of essays inspired by Bray's idea of finding some universal component of homosexuality within the experiences of intimacy and friendship without \"locating a discourse that identifies persons as homosexual.\" Nick Rumens's Queer Company: The Role and Meaning of Friendship in Gay Men's Work Lives (Ashgate, 2011), is also inspired by Alan Bray's scholarship.Nick Rumens, Queer Company: The Role and Meaning of Friendship in Gay Men's Work Lives, Ashgate, 2011, p. 29 Valerie Traub  (Thinking Sex with the Early Moderns) is amongst many subsequent lgbtq scholars who have engaged with and been inspired by Bray's scholarship."]}, {"page": "Treatise of the Three Impostors", "response": ["According to Silvia Berti, the book was originally published as La Vie et L'Esprit de Spinosa (The Life and Spirit of Spinoza), containing both a biography of Benedict Spinoza and the anti-religious essay, and was later republished under the title Traité sur les trois imposteurs.Berti's essay in Atheism from the Reformation to the Enlightenment edited by Michael Hunter and David Wootton. Clarendon, 1992.  The creators of the book have been identified by documentary evidence as  Jean Rousset de Missy and the bookseller Charles Levier. The author of the book may have been a young Dutch diplomat called Jan Vroesen or Vroese. Another candidate, to whom Levier attributed the work, is Jean-Maximilien Lucas. Israel places its composition in the 1680s."]}, {"page": "Michael Hunter", "response": ["* Michael Hunter (historian) (born 1949), professor of history at Birkbeck, University of London", "* Michael Hunter (composer), Scottish composer of sounds for Grand Theft Auto", "* Michael Hunter (boxer) (born 1978), English bantamweight", "* Michael Hunter (politician) (1891–1951), Member of Parliament for Brigg, 1931–1935", "* Michael Hunter (American boxer) (born 1988), his son, American superheavyweight champ 2007", "* Michael Hunter (American football) (born 1993), American football player", "* Michael Hunter (forensic pathologist), forensic pathologist and host of TV series Autopsy: The Last Hours of...", "* Michael Hunter (rugby union), Scottis rugby union player"]}, {"page": "John Worthington (academic)", "response": ["After Hartlib's death, Worthington took on the task of organising his archive of correspondence, which had been bought by William Brereton, 2nd Baron Brereton.Michael Hunter, Archives of the Scientific Revolution: The Formation and Exchange of Ideas in Seventeenth-century Europe (1998), p. 40. After a period of nearly 300 years, the bundles into which he sorted it were rediscovered, and his system for the archive persists."]}, {"page": "The Christian Virtuoso", "response": ["*Robert Boyle, 1627–91 Michael Hunter, Boydell & Brewer, 2000, , 293 pages", "*Robert Boyle Reconsidered, Michael Hunter, Cambridge University Press, 1997, , 249 pages"]}, {"page": "Robert Kirk (folklorist)", "response": ["Scottish author Walter Scott first published Kirk's work on fairies more than a century later in 1815.Hunter 2001a, p. 48. Andrew Lang later gave it the popular title, The Secret Commonwealth of Elves, Fauns and Fairies (1893).  Multiple editions of The Secret Commonwealth have since been published, with notable scholarly analysis by Sanderson, Mario M. Rossi, and Michael Hunter.", "According to George MacDonald Ross, professor of philosophy at the University of Leeds, Kirk documented fairy folklore from traditional accounts in the Scottish Highlands to promote Christianity and its biblical account of \"non-human spirits\".Ross 1998 Historian Michael Hunter believed that \"Kirk also saw the value of second sight in vindicating the supernatural against 'atheists'\".  Kirk probably encountered opposition to his supernatural beliefs in the secular and sceptical climate of 17th century coffeehouses in Restoration London, during his visit in 1689.Hunter 2001a, pp. 48–53.", "Andrew Lang published a second edition of the book in 1893, under the title The Secret Commonwealth of Elves, Fauns and Fairies,Hunter 2001a, p. 41. followed by a 1933 version with an introduction by Robert Bontine Cunninghame Graham. Both of these editions were copies of Scott's 1815 edition.  Multiple editions of The Secret Commonwealth have since been published, with notable scholarly analysis by Sanderson, Mario M. Rossi, and Michael Hunter. Stewart Sanderson edited a new edition for the Folklore Society in 1976 followed by a contemporary version published by Robert John Stewart in 1990, with an extensive commentary exploring many of the esoteric themes contained in the text.  Michael Hunter edited a new edition in 2001, and the New York Review Books published a new version in 2006 with an introduction by Marina Warner."]}, {"page": "William Rand (physician)", "response": ["Rand's correspondence with Evelyn shows Rand's mortalist views, to which Evelyn found some attraction.Therese O'Malley, Joachim Wolschke-Bulmahn, John Evelyn's \"Elysium Britannicum\" and European Gardening (1998), p. 100; Google Books. Rand's views are also known from his comment on the courage required by Henry Lawrence to publish on adult baptism (Of Baptisme, Rotterdam 1646, initially anonymous).Dictionary of National Biography, Lawrence, Henry (1600–1664), puritan statesman, by Gordon Goodwin. Published 1892.Hill, p. 106. A letter of Rand to Benjamin Worsley is positive about Socinianism.Michael Hunter, Robert Boyle, 1627-91: scrupulosity and science (2000), p. 47 note; Google Books."]}, {"page": "Michael Cyril William Hunter", "response": ["#REDIRECT Michael Hunter (historian)"]}, {"page": "Samuel Pepys Club", "response": ["|Michael Hunter"]}, {"page": "Roy G. Neville Prize", "response": ["*2011 Michael Hunter, for Boyle: Between God and Science"]}, {"page": "List of fellows of the British Academy elected in the 2000s", "response": ["* Michael Hunter, professor of history, Birkbeck, University of London"]}, {"page": "Dirk Imhof", "response": ["* Christopher Plantin and Engraved Book Illustrations in Sixteenth-Century Europe (with Karen L. Bowen, Cambridge University Press, 2008)Review by Jeanine De Landtsheer, Renaissance QuarterlyReview by Mark Rankin in The Sixteenth Century JournalReview by Michael Hunter in The Papers of the Bibliographical Society of AmericaReview by Rachel N. Schnepper in Journal of British StudiesReview by Nancy V. Fresella-Lee in Print QuarterlyReview by Geoffrey Scott in Journal of Ecclesiastical HistoryReview by Antony Griffiths in The Library"]}]}}