{"wiki_id": "http://www.wikidata.org/entity/Q6833756", "itemLabel": "Michael Raven", "itemDescription": "Musician/Writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Raven_(author)", "wikipedia_page": {"main": "Michael Raven was an English author, musician, composer and poet.", "link_mentions": [{"page": "Pensnett", "response": ["The name Pensnett is from the Celtic 'pen', for hill and the Anglo-Saxon  for 'a piece of woodland'.Guide to Staffordshire and the Black Country, The Potteries and the Peak, p. 249, Michael Raven  For many years, it was used as commonland, for animal grazing although also a hunting reserve of the lords of Dudley.  Pensnett Chase was inclosed, under the Pensnett Chase Inclosure Act of 1784.  This reserved mining rights to the lord of the manor, but included a clause to compensate people for mining subsidence,   indicating the industry was well established in the area.  The mining of coal and ironstone was long established, and probably goes back to medieval times."]}, {"page": "Paul Raven (musician)", "response": ["Raven was born on 16 January 1961 in Wolverhampton, Staffordshire. He was the son of folk musician Jon Raven, and nephew of author Michael Raven. His early musical career included stints in Neon Hearts, who released three singles from 1977–1979 and the album Popular Music in 1979, and the short-lived 1982 glam rock band, Kitsch, which also included Rook Randle and Tyla, before he would go on to larger success with his band, Dogs D'Amour. In the summer of 1980 he played bass with the also short-lived Tony McPhee's Turbo. The band played a few gigs and recorded a three-track session for Capitol Radio. Turbo included Clive Brooks, the drummer with Tony McPhee's band the Groundhogs (1972–1975)."]}, {"page": "Michael Raven", "response": ["Michael Raven (born 1964) is an American pornographic film director. He is a member of the AVN Hall of Fame."]}, {"page": "The Wodehouse", "response": ["In 1984, the Victoria County History volume for south-west Staffordshire called the Wodehouse one of the \"three great houses\" of the area, along with Enville Hall and Patshull Hall.Vol. XX Staffordshire, VCH At the turn of the 21st century, Michael Raven describes the Wodehouse as \"unspoilt\", with the house having \"a certain serene and mysterious charm\" and the property overall \"the classic configuration of an early medieval settlement\".Guide to Staffordshire and the Black Country, The Potteries and the Peak By Michael Raven, p372. 2004"]}, {"page": "Jon Raven", "response": ["Jon Raven was the brother of author and musician Michael Raven, and father of the late Ministry and Killing Joke bassist Paul Raven, and Gundogs bassist Daniel Raven. Raven was born in Wales and educated at Wolverhampton Municipal Grammar School. His wife was Kate, of Tettenhall, Wolverhampton. Alongside brother, Michael, Jon formed a Wolverhampton folk music group before producing many records and books and having numerous television and radio appearances. He was diagnosed with Parkinson's disease in 1996 and died in August 2015 at Compton Hospice in Wolverhampton.", "Raven was a member of folk trio The Black Country Three along with brother Michael Raven and Derek Craft. They recorded their self-titled debut album in 1966 for Transatlantic. Following this, Raven produced several solo and group CDs.", "* Kate of Coalbrookdale by Jon Raven, Michael Raven and Jean Ward (1971)"]}, {"page": "Ysgol Uwchradd Tywyn", "response": ["*Michael Raven (1938–2008), author, musician, composer and poet"]}]}}