{"wiki_id": "http://www.wikidata.org/entity/Q6830762", "itemLabel": "Michael Green", "itemDescription": "English cricketer, and association and rugby union footballer (1891-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Green_(cricketer,_born_1891)", "wikipedia_page": {"main": "Michael Arthur Green (3 October 1891 at Bristol – 28 December 1971 at Kensington, London), was an all-round sportsman primarily known as a first-class cricketer for Gloucestershire and Essex, and as a cricket administrator who managed England tours to South Africa and Australia and who was secretary of Worcestershire. He also played soccer and rugby union to county standard.Green was a career army officer who reached the rank of Brigadier and served in both the First World War and the Second World War. He represented the British Army at cricket, soccer, rugby and squash.", "link_mentions": [{"page": "Michael Green", "response": ["Michael Green may refer to:", "* Michael Green (biologist), professor at the University of Massachusetts Amherst", "* Michael Green (physicist) (born 1946), professor at Queen Mary University", "* Michael Green (political expert) (born 1961), professor at Georgetown", "* Michael Green (humorist) (1927–2018), British author and journalist", "* Michael Green (painter and sculptor) (born 1929), British painter and sculptor", "* Michael Green (agent), American talent manager and film producer", "* Michael Green (radio), British former controller of BBC Radio 4", "* Michael Green (writer), American screenwriter, comics writer, and television producer", "* Michael Green (youtuber), American vlogger, son of The Angry Grandpa", "* Michael Green (diplomat) (died 2012), New Zealand diplomat", "* Michael Green (soccer) (born 1989), American", "* Michael Green (Australian rules footballer) (born 1948)", "* Michael Green (cricketer, born 1891)", "* Michael Green (cricketer, born 1951)", "* Michael Green (field hockey) (born 1972), German field hockey player", "* Michael Green (sailor) (born 1954), Olympic sailor", "* Michael Green (sprinter) (born 1970), Jamaican", "* Michael Green (swimmer) (born 1963), British", "* Michael Green (tennis) (born 1937), American player in the 1950s and 60s", "* Michael Green (theologian) (1930-2019), British Anglican priest", "* Michael Green (New York lawyer) (born 1961), District Attorney for Monroe County, New York", "* Michael Green (architect) (born 1966), Canadian architect", "* Michael Green (murder victim), lynched near Upper Marlboro, Maryland. September 1, 1878", "* Grant Shapps, who used Michael Green as a pseudonym for business purposes", "* Heydon Prowse, who used the name Michael Green when running for election against Shapps", "* Michael Greene (born 1933), film & TV actor", "* C. Michael Greene, American arts executive"]}, {"page": "Reginald Moss (cricketer)", "response": ["Moss was to make only one further appearance, for Worcestershire, but extraordinarily this came in the 1925 County Championship, nearly 32 years after his previous first-class game when Moss was 57. Batting at number 9 in the first innings and number 11 in the second, he made 2 and 0 and, coming in with just 19 needed for Worcestershire to win the match, he was \"an easy victim for Hammond\" according to The Times. But he fared better in the field, picking up the wicket of Gloucestershire opener Michael Green and holding two catches. He is identified on the scorecard of this match as \"The Rev R. H. Moss\": he was Rector of Icomb, Gloucestershire."]}, {"page": "English cricket team in Australia in 1950–51", "response": ["There were two managers of equal rank; Brigadier Michael Green, a career Army officer who had played for Gloucester and Essex and was the Secretary of Worcestershire County Cricket Club, was in charge of the social calendar and public relations,p149, Kay and John Nash, Secretary of Yorkshire County Cricket Club since 1931, controlled the finances. This was the last tour of the 70-year-old scorer Bill Ferguson, who had toured with the MCC since 1907-08 and devised the famous Ferguson Charts which gave greater details than other scorecards, noting who bowled each ball, who batted and where it was fielded. He also invented the radial scoring chart which show the directions in which a batsman scored his runs.pp70-71, Swantonpp27-36, pp214-228 Fingletonpp81-83, Kaypp9-12 & pp153-155, O'Reilly"]}, {"page": "Ghana national cricket team", "response": ["After a long gap, inter-colonial matches resumed in April 1926, when the Gold Coast played the Nigerian national team in Lagos. Gold Coast–Nigeria fixtures, both multiracial and European-only, were played almost annually from 1926 to 1939, and resumed again after World War II. In several years the European-only fixtures were played in provincial cities like Kumasi and Ibadan, although multiracial games were played only in the capitals. Gold Coast sides were occasionally bolstered by players of first-class standard – for instance, Cecil Pullan (Oxford University and Worcestershire) and Michael Green (Gloucestershire and Essex) appeared together in a 1937 match,Gold Coast Europeans v Nigeria Europeans, Nigeria Europeans in Gold Coast 1936/37 – CricketArchive. Retrieved 1 April 2015. with Pullan appearing again after the war.Cecil Pullan – CricketArchive. Retrieved 1 April 2015.Michael Green – CricketArchive. Retrieved 1 April 2015 The national side played its first match as \"Ghana\" less than a month after Kwame Nkrumah's independence declaration in March 1957, with annual Ghana–Nigeria matches occurring until 1964.Other matches played by Ghana  – CricketArchive. Retrieved 1 April 2015."]}, {"page": "English cricket team in South Africa in 1948–49", "response": ["The MCC team was captained by George Mann, with Billy Griffith as vice-captain. The Worcestershire secretary Brigadier Michael Green was the tour manager. "]}, {"page": "1950–51 Ashes series", "response": ["Selection of the Australian team would seem to be a simple process as eight of its members were highly talented cricketers who almost picked themselves; Lindsay Hassett, Arthur Morris, Neil Harvey, Don Tallon, Keith Miller, Ray Lindwall, Ian Johnson, and Bill Johnston. Don Tallon replaced Ron Saggers who had kept wicket on the tour of South Africa in 1949–50, which Tallon had missed. Ray Lindwall had been dropped for the last Test in South Africa, his form suffering from a series of ailments, but was recalled to the team to replace Geff Noblet. Batsmen Jack Moroney and Sam Loxton kept their places, but leg-spinner Colin McCool was replaced by the 35-year-old debutant mystery spinner Jack Iverson. The task for the England tour selectors was not quite so easy. The managers Brigadier Michael Green and John Nash, captain Freddie Brown, vice-captain Denis Compton and senior professional Len Hutton kept most of the team from the Fourth and final Test against the West Indies in 1950. This was not the best recommendation as they had lost the series 3–1 and the last Test by an innings even though Hutton carried his bat for 202 out of 344. Freddie Brown, Denis Compton, Len Hutton, Reg Simpson, John Dewes, Trevor Bailey, Arthur McIntyre, Alec Bedser, Doug Wright all stayed, but the young opener David Sheppard was replaced by veteran Cyril Washbrook and Godfrey Evans returned as wicket-keeper. Apart from Hutton, Washbrook, Compton and Simpson the batsmen were not in fine form. Dewes was chosen after he had made a gritty 117 against Queensland in the last tour match before the Test. The reserve wicket-keeper Arthur McIntyre was in the team for his batting and as Brown's Cows were desperately short of good fielders and McIntyre had a good throwing arm.p19, O'Reilly While the crowd was waiting for the captains to come out and toss a dapper little man came out and inspected the pitch and he passed by the spectators completely unnoticed. It was the Test selector Sir Donald Bradman, such is fame.p65, Fingleton Keith Miller had recently made a slow 201 not out against Queensland on the flat Woolloongabba pitch and predicted that the Test would be \"the dullest in history\".p69, Fingleton Lindsay Hassett won the toss (as he would 9 times out of 10 in Ashes Tests) and although the Woolloongabba Ground had a reputation as \"result\" wicket it looked plumb and he batted without hesitation.pp61-66, Fingletonpp128-130, Kayp18, O'Reilly", "The main story leading up to the Second Test at the Melbourne Cricket Ground was the health of the England vice-captain Denis Compton. His famously damaged knee had swollen up after making another century – 115 vs an Australian XI – and hourly bulletins were posted by the MCC manager Brigadier Michael Green expressing optimistically that he would play in order to help draw a large crowd for the Test, though doubts where express by those who had seen him. In the end he was unfit to play and was replaced by the Welsh amateur batsmen Gilbert Parkhouse who had made 58 in the Australian XI game, adding 130 with the luckless Compton. The reserve wicket-keeper Arthur McIntyre was also dropped from his batting role and the teenaged Brian Close was brought in as the best of a bad bunch, having hit 105 not out against long hops and full tosses served up in a minor game. Brown thought that if nothing else as an all-rounder he could help take some of the strain off the other bowlers and so Close became the youngest Englishman to play Australia in a Test. Australia made only one change, dropping Jack Moroney for having made a pair in the First Test. His successor was chosen in the Australian XI game and opener Ken Archer (12th man at Brisbane) was given his Baggy Green ahead of the middle order batsman Jim Burke (who was made 12th man), although he had only made 81 to Burke's 128. Lindsay Hassett won the toss and batted first on a yellow, matted wicket made for batting.p96 & p104, Fingletonpp149-151, Kaypp48-51, O'Reillypp74-75, Swanton"]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Michael Green (1912–1928) : M. A. Green"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Michael Green (1927–1930) : M. A. Green (Gloucestershire, Essex)"]}]}}