{"wiki_id": "http://www.wikidata.org/entity/Q6835021", "itemLabel": "Michael Underwood", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Underwood", "wikipedia_page": {"main": "Michael Paul Underwood (born 26 October 1975) is an English television presenter, best known as a children's TV presenter on CBBC and CITV. He can be seen as a fifteen-year-old in an episode of The Crystal Maze, then presented by Richard O'Brien. He presented the primetime ITV series Let Me Entertain You in 2014 and was a reporter for Real Stories with Ranvir Singh.", "link_mentions": [{"page": "Junior Eurovision Song Contest 2005", "response": ["| Michael Underwood"]}, {"page": "University of Plymouth", "response": ["Alumni include the world's youngest single-handed cross-Atlantic sailor Seb Clover, historian Philip Payton, BBC wildlife presenter Monty Halls, television presenter Michael Underwood, life peer Judith Wilcox, Baroness Wilcox, (Plymouth Polytechnic), travel writer and physician Jane Wilson-Howarth, children's author Steve Augarde, artists Sue Austin, Julian Bovis, Pen Dalton, Andrea Polli, Hatice Güleryüz, multimedia artist and scholar Ellen Levy, computer scientist at IBM Mandy Chessell, MP for Bristol North West Darren Jones, journalist Matt Cooke, politicians Laura Anne Jones, Mark Williams and Darius J. Pearce, marine biologists Heather Koldewey and David Sims, meteorologist Clare Nasir, members of the band Meeky Rosie, Indonesian businessman and politician Jaka Singgih, and Tom Rivett-Carnac, Officer of the United Nations Framework Convention on Climate Change."]}, {"page": "List of game show hosts", "response": ["| Michael Underwood || United Kingdom || Eliminator (2003–04), Starfinder (2003–04), Jungle Run (2003–06), Bingo Night Live (2008), Let Me Entertain You (2014)"]}, {"page": "United Kingdom in the Junior Eurovision Song Contest 2004", "response": ["The final, broadcast on digital channel ITV2, was held on 4 September 2004 and was presented by Holly Willoughby, Stephen Mulhern and Michael Underwood. Regional televoting was held to select the winner from the 8 competing acts."]}, {"page": "The Crystal Maze", "response": ["The show has had a lasting impact and influence on British television, becoming what has been described as a cult classic due to repeats; the makers of the children's TV show Jungle Run openly acknowledge The Crystal Maze as an influence, particularly the final host, Michael Underwood, who was the team captain in the first Christmas special; The perceived stupidity of the contestants was the target of various British comedy shows and spoofs, a trend which continued well into the mid 2000s."]}, {"page": "United Kingdom in the Junior Eurovision Song Contest", "response": ["|Michael Underwood || Vicky Gordon ||"]}, {"page": "Holly & Stephen's Saturday Showdown", "response": ["Ministry of Mayhem was first broadcast on 10 January 2004 and aired weekly on a Saturday morning on ITV. The programme featured a mix of cartoons, celebrity guests, live music and phone-in competitions -  with surreal characters, crazy games and a load of gunge thrown in for good measure. It was initially presented by CITV presenters Stephen Mulhern, Holly Willoughby and Michael Underwood.", "On 18 December 2004, Underwood presented his final edition, though this was not announced on screen until towards the end of the show - he got a Ministry style send off. A reason for his departure may have been that his contract was up for renewal and he chose not to renew it, in favour of joining GMTV to co-present Entertainment Today. Michael Underwood returned", "On 1 July 2006, the final edition was broadcast, which saw the return of former host Michael Underwood and  the characters 'The Doctor', 'Mr. Lee' and one half of The Hyenas, 'Sniff'. There was also a new take on M.O.M favourite Cakey Sk8, plus some jabs by presenters and characters towards the decision taken by ITV to air a new cookery programme by the name of Saturday Cooks! in its place on the main channel."]}, {"page": "Danny Mills", "response": ["Mills was a runner up, along with Michael Underwood, on the 2012 series of Celebrity MasterChef. He was beaten by Emma Kennedy in a closely contested final."]}, {"page": "Angellica Bell", "response": ["In Autumn 2008, she hosted the CBBC show Election, and the ITV2 reality show CelebAir. In 2009, she appeared on All Star Mr & Mrs with her then-fiancė Michael Underwood.", "In 2010, Bell presented the ITV programme The Zone with Michael Underwood. That same year, she also presented CBBC's Project Parent.", "Bell began a relationship with her former BBC co-star Michael Underwood and they married in New York in December 2010. They have two children.", "| 2009 ||All Star Mr & Mrs || Contestant || With Michael Underwood"]}, {"page": "Underwood (surname)", "response": ["Deriving from the Old English \"under\" a preposition meaning \"under\" or \"below\", plus \"wuda\", a wood. The name was originally given to one dwelling at the foot of a wood or literally \"below the trees of a forest\". The name may also be locational from three places named with these elements i.e., Underwood in Derbyshire, England, Underwood, Nottinghamshire, England. The surname is first recorded in the latter half of the 12th Century (see below). One William Underwude appears in the 1219 Assize Court Rolls of Yorkshire, and a William under the Wode in the 1332 Subsidy Rolls of Staffordshire. From the beginning of the surviving parish registers in 1559 there were Underwoods recorded in Pickering parish, North Yorkshire, England. On 2 January 1634, one Joseph Underwood, aged 23 yrs., embarked from London on the ship \"Bonaventure\" bound for Virginia. He was one of the earliest recorded name bearers to enter America. No less than seven Coats of Arms were granted to families of this name; a particular namebearer mentioned in the Dictionary of National Biography was one Michael Underwood (1737–1820), who practised in London as a surgeon and as a \"male-midwife\". The first recorded spelling of the family name is shown to be that of William de Underwode which was dated 1188, in the \"Records of Bury St. Edmunds, Suffolk\", during the reign of King Henry II, known as \"The Builder of Churches\", 1154 – 1189.", "* Michael Underwood (born 1975), British television presenter"]}, {"page": "Ben Shephard", "response": ["Shephard joined the long-running programme GMTV in 2000 where he presented Entertainment Today alongside Jenni Falconer. He also became the main relief presenter for GMTV Today. Due to the departure of Eamonn Holmes in April 2005, Shephard became Fiona Phillips' co-host on GMTV Today, presenting on Mondays, Tuesdays and alternate Wednesdays. He continued to present Entertainment Today, but began to share duties with Michael Underwood. When GMTV relaunched in January 2009, his main co-host became Kate Garraway, presenting on Monday, Tuesday and alternate Wednesdays."]}, {"page": "Jungle Run", "response": ["Jungle Run is a British children's television adventure series that aired on CITV as part of the ITV network from 10 September 1999 to 29 November 2006. It was a game show similar to shows such as Fort Boyard and The Crystal Maze. The show has had three presenters, referred to as the \"Jungle Guide\": Dominic Wood from 1999 to 2000, Chris Jarvis from 2001 to 2002 and Michael Underwood from 2003 to 2006. It was recorded at the disused air base, RAF Newton, near Nottingham.", "| 5 || 9 September 2003 || 9 December 2003 || 14 || rowspan=\"4\" | Michael Underwood"]}, {"page": "Emma Kennedy", "response": ["Kennedy took part in Celebrity MasterChef in 2012, winning the final after a week of cookery-based tasks, in which ex-footballer Danny Mills and TV presenter Michael Underwood also participated."]}, {"page": "Stephen Mulhern", "response": ["| with Holly Willoughby and Michael Underwood"]}, {"page": "CITV", "response": ["* Michael Underwood (August 2002 – December 2003)"]}, {"page": "Andy Abraham", "response": ["Abraham's second album, Soul Man, was not as popular yet it still managed to make the Top 20 in the UK Charts. The album included the Christmas song \"December Brings Me Back To You\", a duet with television presenter Michael Underwood."]}, {"page": "Dancing on Ice", "response": ["|style=\"background: violet;\"   | Michael Underwood", "|Michael Underwood", "The third series began on 13 January 2008, moving to Sunday nights in the process and ended on 16 March 2008, when Suzanne Shaw was crowned as the winner. Schofield and Holly Willoughby returned to co-present, while Nicky Slater, Jason Gardiner and Robin Cousins returned to The Ice Panel. The third series saw the replacement of judge Natalia Bestemianova by West End star Ruthie Henshall. And for the first time in the history of the series, a contestant withdrew due to injury, and it was TV presenter Michael Underwood who did so.", "| Michael Underwood", "| Michael Underwood"]}, {"page": "MasterChef (British TV series)", "response": ["* 2012: Emma Kennedy, Danny Mills, Michael Underwood, Zöe Salmon, Gareth Gates, Cheryl Baker, Laila Rouass, George Layton, Diarmuid Gavin, Richard McCourt, Rebecca Romero, Jamie Theakston, Jenny Eclair, Javine Hylton, Steve Parry and Anne Charleston."]}, {"page": "ITV Breakfast", "response": ["* Michael Underwood (2005–08, 2016–17)"]}, {"page": "Zaraah Abrahams", "response": ["In 2008, Abrahams participated in ITV's celebrity skating series Dancing on Ice, as a replacement for the injured Michael Underwood. Her partner was skater Fred Palascak. The pair finished in third place. In 2015, she joined the cast of the Cinemax series The Knick, a medical drama directed by Steven Soderbergh, set around a New York hospital in the early 20th century. She portrayed the role of Opal. In October 2020, it was announced that Abrahams would be taking over the role of Chelsea Fox in the BBC soap EastEnders. Her first episode as Chelsea was broadcast on 25 December 2020."]}, {"page": "Eliminator (game show)", "response": ["Eliminator is a children's quiz show in which a group of three children have to answer questions in order to get to the next level of the game, while being chased by a demon named the \"Eliminator\" who would try to reach them.  The show produced two series between 6 January 2003 and 29 April 2004, and was presented by Michael Underwood."]}, {"page": "Soul Man (album)", "response": ["#\"December Brings Me Back to You\" (featuring Michael Underwood) (bonus track)"]}, {"page": "Category talk:British journalists", "response": ["Michael Underwoodnot yet classified"]}, {"page": "The Big Bang (TV series)", "response": ["For the seventh series the show had another rebrand, notably a new theme tune, the first since the beginning of the show, however the old theme tune was brought back for the final two series. There was also a new logo, and new presenters Kate McIntyre and Michael Underwood were introduced. The set stayed remained mainly unchanged, however the neon The Big Bang sign in the kitchen was not replaced with the new logo until series 8. Michael and Kate presented the show together for two series, until Michael left to present Ministry of Mayhem, and for the ninth and last series he was replaced with Sam Pinkham.", "| scope=\"row\" rowspan=2 | Michael Underwood and Kate McIntyre"]}, {"page": "United Kingdom in the Junior Eurovision Song Contest 2005", "response": ["The final was held on 4 September 2005 at the Granada Studios in Manchester, broadcast on digital channel ITV2, and was hosted by Michael Underwood and Nikki Sanderson. Televoting selected the winner from the eight competing entries, which votes separated into six voting groups based on geographical area."]}, {"page": "Jeanne Downs", "response": ["On 2 January 1990 (following Foulkes' departure on 22 December 1989) Downs took over co-presenting the Children's ITV afternoons service, along with Scally. Warren returned to Children's ITV in summer 1990, to present the mornings service on his own, but he and Downs did occasionally swap roles, with him doing the afternoons and she doing the mornings instead sometimes. In September 1990, Children's ITV's afternoon service became slightly longer, now running from 3:55 to 5:10pm each weekday. Downs and Scally continued to present Children's ITV's afternoons service until 29 March 1991, when Central Television regained the contract to produce Children's ITV back from Stonewall. They were replaced by a solo Tommy Boyd, who had already presented Children's ITV once before in the 1980s, now returning for a second time on 1 April 1991. However, on 3 January 2003 CITV celebrated its 20th birthday, with a special one-off programme called CITV's 20th Birthday Bash. Downs and Scally both appeared on the programme, alongside other past and present Children's ITV presenters, such as Roland Rat, Matthew Kelly and Michael Underwood."]}, {"page": "December Brings Me Back to You", "response": ["\"December Brings Me Back to You\" is the second single from Andy Abraham. It also featured Michael Underwood. It was released in the UK on 11 December 2006. It is a new original track from his second album, Soul Man. It charted at #18 in the UK Singles Chart."]}, {"page": "Bingo Night Live", "response": ["*a game caller (Anthony Crank, Michael Underwood or Mike Toolan)"]}, {"page": "Dancing on Ice (series 4)", "response": ["The line-up was revealed on 5 January 2009 with thirteen couples competing, including Michael Underwood, who returned to compete after pulling out the previous year due to injury. The celebrities and their partners were:", "|Michael Underwood", "! scope=\"row\" | Michael Underwood", "| rowspan=2 style=\"background:salmon;\" | Michael Underwood2 of 5 votesMajority"]}, {"page": "Starfinder (game show)", "response": ["Starfinder was a British game show that aired on CITV from 2003 to 2004, presented by Michael Underwood with Tom Zikas giving advice to the children."]}, {"page": "List of GMTV presenters and reporters", "response": ["| Michael Underwood"]}, {"page": "Celebrity Mastermind", "response": ["| Michael Underwood ||James Bond - the Roger Moore years ||3rd"]}, {"page": "List of GMTV programmes", "response": ["Entertainment Today was GMTV's entertainment round-up show on Fridays, designed to replace LK Today at the end of the week. It aired at 8:40am. The programme was broadcast for 45 minutes, and included interviews with actors/actresses from upcoming movies and music performances. Presented by Ben Shephard and Jenni Falconer originally, as Ben started to present more during the week for GMTV, Michael Underwood was also introduced as a presenter. In 2008 the show was replaced by The Richard Arnold Show in July, which aired for six weeks. After the show's run, Entertainment Today didn't return, and instead the main GMTV Today show was extended to 9:25am every Friday."]}, {"page": "List of CBBC presenters", "response": ["| Michael Underwood || 1999–2002 ||"]}]}}