{"wiki_id": "http://www.wikidata.org/entity/Q6833384", "itemLabel": "Michael Parsons", "itemDescription": "English cricketer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Parsons_(cricketer)", "wikipedia_page": {"main": "Michael Parsons (born 26 November 1984) was an English cricketer. He was a right-handed batsman and a right-arm medium-fast bowler who played first-class cricket for Somerset. Parsons was born in Taunton.\nParsons began his career playing Second XI cricket in 2002, and made his most recent appearance in the competition in August 2006. In between he played occasional limited overs cricket, though he didn't get his debut first-class start until May 2005.\nWhile Parsons made little contribution with the bat, his, and the rest of the team's, bowling against opponents Lancashire was expensive, as the match was played out to a draw.\nParsons would play County Cricket on one further occasion, against Derbyshire, where once again his performance was marked by his wild bowling and his inability, in the second innings, to attain a partnership long enough to secure the first of three consecutive scores of fifty or above for batting partner and namesake Keith Parsons.\nParsons attained one cap for the England Under-19 cricket team, representing the team in a defeat against South Africa Under-19s in August 2003. Since his exit from first-class cricket, Parsons has played one game for Minor Counties side Devon.\nCareer highlights:\nPlaying against a strong New Zealand side in 2004 where Parsons produced an impressive bowling display to finish with figures of 6 for 30 off 10 overs.\nIn 2005 he was in the Somerset side that beat a very strong Australian team led by Ricky Ponting.", "link_mentions": [{"page": "Somerset County Cricket Club in 2005", "response": ["*  Michael Parsons"]}, {"page": "Richard Huish College, Taunton", "response": ["*Michael Parsons, former player of Somerset County Cricket Club"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Michael Parsons (2005) 2 matches CA"]}, {"page": "Michael Parsons", "response": ["Michael Parsons may refer to:", "*Michael Parsons (composer) (born 1938), British composer", "*Michael Parsons (cricketer) (born 1984), English cricketer", "*Michael Parsons (engineer) (1928–2021), designer of major suspension bridges ", "*Michael Parsons (Australian footballer) (1960–2009), Australian rules player", "*Michael Parsons, 6th Earl of Rosse (1906–1979), Irish peer", "*Michael Parsons (Bermudian footballer) (born 1979), Bermudian soccer player", "*Michael Parsons (figure skater) (born 1995), American ice dancer", "*Michael Parsons (singer) (born 1994), British singer from District3"]}]}}