{"wiki_id": "http://www.wikidata.org/entity/Q6831338", "itemLabel": "Michael Ikin", "itemDescription": "English cricketer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Ikin", "wikipedia_page": {"main": "Michael John Ikin (born 31 December 1946) is a former English cricketer. Ikin was a left-handed batsman who bowled right-arm off break. He was born in Bignall End, Staffordshire. His father, Jack Ikin, played Test cricket for England.\nIkin made his debut for Staffordshire in the 1967 Minor Counties Championship against Norfolk. Ikin played Minor counties cricket for Staffordshire from 1967 to 1985, which included 105 Minor Counties Championship matches. In 1971, he made his List A debut for Staffordshire against Glamorgan in the Gillette Cup. He made 6 further appearances in List A cricket for the county, the last coming against Sussex in the 1978 Gillette Cup. In his 7 List A matches for the county, he scored 89 runs at an average of 12.71, with a high score of 47. With the ball, he took 6 wickets at an average of 29.50, with best figures of 3/13.Ikin also played 2 first-class matches for the Minor Counties cricket team, the first came in 1972 against the touring Australians. He was dismissed in the Minor Counties first-innings for 4 runs by Jeff Hammond. Following-on in their second-innings, Ikin was dismissed for 5 by Graeme Watson. He made his second first-class appearance in 1979 against the touring Indians. Not required to bat in the Minor Counties first-innings, Ikin proceeded to bowl 23 wicket-less overs in the Indians first-innings. In the Minor Counties second-innings, he made his highest first-class score of 31, before being dismissed by Chetan Chauhan. He then bowled 12 wicket-less overs in the Indians second-innings. He also made 2 List A appearances for Minor Counties East in the 1977 Benson & Hedges Cup against Essex and Yorkshire. In these matches, he scored 60 runs at an average of 30.00, while making his only List A half century. This came in the match against Yorkshire. He took just a single wicket for the team at a cost of 91 runs.\n\n", "link_mentions": [{"page": "Michael John Ikin", "response": ["#REDIRECT Michael Ikin"]}, {"page": "Ikin", "response": ["* Jack Ikin (1918–1984), English cricket player for Lancashire, father of Michael Ikin", "* Michael Ikin (born 1946), English cricket player for Staffordshire, son of Jack Ikin"]}, {"page": "Ikin, Michael", "response": ["#redirectMichael Ikin"]}, {"page": "List of Minor Counties East List A players", "response": ["*Michael Ikin (1977): MJ Ikin"]}]}}