{"wiki_id": "http://www.wikidata.org/entity/Q6831428", "itemLabel": "Michael J. Jackson", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_J._Jackson", "wikipedia_page": {"main": "Michael J. Jackson is an English actor.", "link_mentions": [{"page": "1948", "response": ["** Michael J. Jackson, English actor"]}, {"page": "1987 in film", "response": ["| The Fourth Protocol || Lorimar Motion Pictures || John Mackenzie (director); George Axelrod, Richard Burridge (screenplay); Michael Caine, Pierce Brosnan, Ned Beatty, Ian Richardson, Joanna Cassidy, Julian Glover, Michael Gough, Ray McAnally, Anton Rodgers, Matt Frewer, Caroline Blakiston, Joseph Brady, Betsy Brantley, Sean Chapman, Alan North, Ronald Pickup, John Horsley, Michael Bilton, Peter Cartwright, Aaron Swartz, Mark Rolston, Michael J. Jackson, Matthew Marsh, Jerry Harte || Spy || Live action"]}, {"page": "Michael Jackson (disambiguation)", "response": ["* Michael J. Jackson (born 1948), English actor from Liverpool, best known for his role in Brookside"]}, {"page": "Brookside (TV series)", "response": ["Following the huge ratings success of the 'body under the patio' and lesbian kiss plots, writers persisted with controversial, headline-grabbing subjects that other British soaps did not. Storylines progressively became more sensational in a fierce chase for high ratings. A religious cult headed by Simon Howe (Lee Hartney) brainwashed Terry Sullivan and Katie Rogers, taking over and then blowing up number 5 in a suicide pact during 1994,20 Years of Brookside by Graham Kibble-White. Page 98-99 and a mysterious 'killer virus' saw the Close quarantined and the deaths of guest characters George (Brian Murphy) and Audrey Manners (Judith Barker), and garage owner Gary Salter, in the middle of 1995. The arrival of the Simpson family in May 1996 and the quickly-established incestuous relationship between brother and sister Nat (John Sandford) and Georgia (Helen Grace) that drew the most substantial criticism – especially after their younger brother Danny (Andrew Butler) caught them in bed together. Channel 4 was forced to broadcast an apology to viewers who complained to the ITC about the highly contentious plot, and Phil Redmond was finally forced to admit \"We got it wrong\".20 Years of Brookside by Graham Kibble-White. Page 111 to 113 After the shocking revelation, Nat and Georgia departed to start a new life in London and their father Ollie (Michael J. Jackson), who had been introduced ahead of the rest of the family as a friend of Mick Johnson's during 1995, threw their mother Bel (Lesley Nightingale) out after she had an extramarital fling with Mike Dixon, resulting in her catching a sexually-transmitted disease that she passed on to Ollie. Bel sought revenge by selling a story to the press falsely accusing Ollie of abusing Nat and Georgia as children, precipitating their incestuous relationship. The writers persevered with the remainder of the Simpson family, with Ollie meeting the Parade's new solicitor Eleanor Kitson (Georgia Reece), and she moved into number 9 with Ollie and Danny. Eleanor was found by her long-lost daughter Louise (Lisa Faulkner) and together they tracked down Louise's father, Marcus Sneddon. This storyline culminated in another hostage situation where Ollie, Eleanor, Louise and Danny are held at gunpoint by a deranged Marcus in a secluded hideaway, after which all four characters were abruptly written out and number 9 was sold to a returning Lindsey Corkhill."]}, {"page": "Wish Me Luck", "response": ["* Michael J. Jackson — Kit Vanston/Gregoire"]}, {"page": "Robert Sugden", "response": ["When Jack and Sarah start having marriage problems after Sarah gets a new job and Jack wrongly believes she is having an affair with her boss Professor Andrew McKinnon (Michael J. Jackson), causing major rows between the couple, Robert feels neglected and runs away from home. He befriends Derek Simpson (Garry Cooper) a former soldier who lives alone and Derek allows Robert to stay with him. Eventually, Robert returns home and Jack and Sarah both promise him things will be better from then on."]}, {"page": "Evening Standard British Film Awards", "response": ["*Best Newcomer – Actor : Michael J. Jackson"]}, {"page": "The Fourth Protocol (film)", "response": ["* Michael J. Jackson as Major Pavlov"]}, {"page": "Highlander: The Series (season 4)", "response": ["* Michael J. Jackson ... Sean Burns / 2 episodes "]}, {"page": "Highlander: The Series (season 5)", "response": ["* Michael J. Jackson ... Sean Burns"]}, {"page": "Sarah Sugden", "response": ["Following murderer Jim Latimer's (Dennis Blanch) released from jail for the murder of Jack's cousin Sharon Crossthwaite (Louise Jameson) in 1973, he swears revenge on Jack who was a witness at his trial. He kidnaps Sarah, holding hostage in an abandoned warehouse but Jack and his brother, Joe Sugden rescue Sarah, who ias unharmed and Latimer is subsequently arrested.  In January 1994, Jack proposes to Sarah. By then, they discover Sarah is pregnant and in March 1994, Sarah gives birth to their daughter Victoria Sugden (Jessica Heywood). In May 1994, Jack and Sarah marry but weeks after the wedding, Victoria stops breathing and a hole in her heart was found. Victoria nearly dies but a part of Sarah's heart was taken to save Victoria's life. The Sugdens' marriage is tested when Sarah befriends American professor Andrew MacKinnon (Michael J. Jackson), much to Jack's jealousy and further strain comes when Robert runs away from home but is safely found by Derek Simpson (Garry Cooper) who is wrongly of kidnapping him."]}, {"page": "Mike Dixon (Brookside)", "response": ["Writers then created another affair story for Mike and his older married neighbour Bel Simpson (Lesley Nightingale). When Mike finds Bel drunk in Bar Brookie, he walks her home. Bel invites Mike into her home for a drink. She begins to complain about her sex life with husband Ollie Simpson (Michael J. Jackson). This prompts Mike to attempt to leave but Bel kisses him and they have sex. Writers intended it to be a one time encounter with ensuing drama. Byatt told Steven Murphy from Inside Soap that Mike sees Bel as \"another notch on his bedpost\" and Bel is \"totally paranoid about the whole thing.\" Mike discusses their affair with Ben O'Leary (Simon Paul), which upsets Bel who wants to keep it a secret from Ollie."]}, {"page": "Mobile (TV series)", "response": ["* Michael J. Jackson as Supt Hewitt"]}, {"page": "List of former Emmerdale characters", "response": ["|Jerry Walsh || Michael J. Jackson || 2010–2011", "|Michael J. Jackson"]}, {"page": "List of former Coronation Street characters", "response": ["|Sid Altree || Michael J. Jackson || 2012–2014"]}, {"page": "Cultural depictions of Richard I of England", "response": ["*Michael J. Jackson in the BBC series The Legend of Robin Hood (1975)"]}, {"page": "1948 in British television", "response": ["* 19 January — Michael J. Jackson, actor"]}, {"page": "List of Emmerdale characters (2010)", "response": ["In October 2010, Jackson is critically injured in a road accident when he crashes on a railway line after arguing with Aaron. The van is hit by a train and Jackson is left with life-threatening injuries. Hazel and Bob arrive at the hospital together and she questions Aaron about the accident. Hazel calls Jackson's dad, Jerry, to tell him about what happened. The doctor treating Jackson tells them that Jackson is on life support. Aaron breaks down in tears, blaming himself and Hazel comforts him and tells him that no one is to blame and that Jackson will pull through. When she is allowed to see him, Hazel talks to Jackson while he lies in a coma. Aaron refuses to go in and talk to him because he thinks Jackson wouldn't want him there but Hazel tries to reassure him. Jackson's father, Jerry (Michael J. Jackson), arrives in the hospital and blames Aaron for the accident, and when Jerry goes in to see Jackson with Hazel, he says that he thinks that it was Hazel's meddling that caused the accident too. Hazel tells Jerry he has no right to blame anyone. She reveals to Aaron that Jerry hit Jackson when he revealed that he was gay. A few days later Jackson wakes from his coma and Jackson’s consultant tells Hazel, Jerry and Aaron that Jackson has two broken bones in his neck and may never walk again. Hazel remains positive and hopes Jackson will walk again. Later that day the consultant breaks the news to Jackson with Hazel and Aaron at his bedside.", "Jerry Walsh is the father of Jackson Walsh (Marc Silcock), played by actor Michael J. Jackson. Jerry first appeared on 8 October 2010 at the hospital after Jackson is badly injured in a car crash on a railway line. Jerry takes an instant dislike to Jackson's boyfriend Aaron Livesy (Danny Miller) and orders him to leave after discovering that Aaron had accidentally caused the crash by ringing Jackson and the crash was caused by Jackson trying to pick the up and answer his mobile phone. It is revealed that Jerry was strongly homophobic and had punched Jackson when he had revealed that he was gay. When Jackson is discovered to have suffered severe neck and spinal injuries which could potentially paralyse him, Jerry decides to leave the hospital after telling his ex-wife and Jackson's mother, Hazel Rhodes (Pauline Quirke), to not tell Jackson about the paralysis but she later does so. Jerry later visits Aaron in the village and Aaron convinces him to go and visit Jackson again. Jerry does so after Jackson regains consciousness and Jackson resolves things with his father and thanks him for coming to see him. Jerry returns on the day that Jackson has an operation on his back. Jerry offers Jackson encouragement. He is later devastated to learn from Hazel that Jackson will never walk again after she demands answers from the surgeon. Jerry asks Aaron not to tell Jackson so Aaron tells Jerry to tell him but he can't bring himself to do it so Aaron does it for him. Jerry later suggests that Jackson come and live with him but Jackson rejects his offer as he was still angry at his father's previous homophobia towards him. Jerry tells Jackson that his offer is still there if he changed his mind but he agrees to give money to Hazel each month to help pay for Jackson's care. Jerry later asks Jackson to be godfather to his son Josh, Jackson's half-brother, at his christening but Jackson refuses. Jerry also attends a football match with Jackson, Aaron, Hazel, Chas Dingle (Lucy Pargeter), Rhona Goskirk (Zoe Henry) and Paddy Kirk (Dominic Brunt). In June 2011, Jackson invites Jerry to the village pub, The Woolpack, for a drink along with his other family and friends. Jackson tells Jerry that he loves him, wanting to say farewell to his father. The following day Aaron and Hazel help Jackson commit suicide by feeding him a cocktail of drugs. Jerry arrives in the village when he hears the news of Jackson's death and breaks down in tears. Jerry becomes outraged with both Aaron and Hazel after he discovers that they helped Jackson die. After laying flowers at the scene, he angrily attacks Aaron and calls him a \"pervert\", accusing him of murdering Jackson. Aaron's uncle Cain Dingle (Jeff Hordley) threatens Jerry and tells him to leave and he does so, telling Aaron that he will get his comeuppance. Jerry attends Jackson's funeral in the village church and is pleased when he hears that Aaron has been charged with Jackson's murder and cannot attend the funeral as he was in court. Two weeks later, Jerry arrives in the village drunk and confronts Aaron in the cafe and tells him that he has made a damning statement to the police in which he has implicated Aaron as a murderer in order to make sure he is imprisoned. He then attacks Aaron and Carl King (Tom Lister) and Bob Hope (Tony Audenshaw) eject him from the cafe and tell him to go home. During Aaron's trial, Jerry takes the stand to give evidence as a prosecution witness and tells the court what he believes but is threatened with contempt of court when he loses his temper and begins shouting at Aaron. After Aaron is found not guilty, Jerry confronts him and tells him that he still believes that he is guilty of murdering Jackson, even if the jury did not believe it. He then tells Aaron that he hoped that Jackson's death would haunt him for the rest of his life and walks away."]}, {"page": "Jackson Walsh", "response": ["In May 2010 it was announced that established actress Pauline Quirke had been cast as Jackson's mother, Hazel Rhodes. Hazel's arrival was to coincide with a \"major storyline\" for Jackson. Michael J. Jackson was later cast to play his father, Jerry. Silcock said it was \"a big key to understanding why Jackson is like he is.\" Jerry's interaction with Hazel also gave viewers an insight to Jackson's backstory. It also helped show why he was so understanding towards Aaron."]}, {"page": "Casualty (series 14)", "response": ["*Michael J. Jackson as Mike Branscombe (episodes 6 and 7)"]}, {"page": "List of Emmerdale characters (2011)", "response": ["|3–24 March||Josh Walsh|| Benjamin Murphy || Josh is Jerry Walsh's son from his second marriage. Jerry brings Josh to the village to introduce him to his half brother Jackson. Jerry Walsh (Michael J. Jackson) asks Jackson Walsh (Marc Silcock) to be Josh's godfather and he initially turns down the offer. Aaron Livesy (Danny Miller) and Hazel Rhodes (Pauline Quirke) later convince him to do the job, but he fails to go to the christening after an argument with them. Jerry brings Josh round and Aaron gives him a toy shark as a gift."]}, {"page": "List of Doctors characters (2000)", "response": ["Kate is the wife of Mac McGuire (Christopher Timothy) and set up \"Riverside\" with Mac. The two had a son, Ciaran (Tomas Hughes), but they divorced when Kate fell in love with David Quinn (Richard Standing). However, David dies in a car crash, and Kate leaves the church. Ciaran was later kidnapped, however when he was returned, she regained her belief in the church. After a two-month gap, Kate returns to \"Best Practice\" as the new receptionist. Mac remarries his ex-wife, Julia Parsons (Diane Keen), as she becomes the Practice Manager at the surgery. Kate and Julia become enemies as Kate still had feelings for Mac, which Julia knew about, but soon became friends. Kate meets Dr Mike Miles (Michael J. Jackson) and leaves to Ireland with him. Whilst in Ireland, Mac visits Ciaran and has an affair with her whilst there. Julia finds out, ordering them to leave the surgery, and both depart to Ireland."]}, {"page": "That Summer!", "response": ["* Michael J. Jackson – Hotel clerk"]}, {"page": "January 1948", "response": ["*Born: Frank McKenna, businessman, politician and diplomat, in Apohaqui, New Brunswick; Michael J. Jackson, actor, in Liverpool, England; Mal Reilly, English rugby league footballer"]}, {"page": "Michael J. Jackson (actor)", "response": ["#REDIRECT Michael J. Jackson"]}, {"page": "Never Never (TV series)", "response": ["* Michael J. Jackson as Bruce Gayle"]}]}}