{"wiki_id": "http://www.wikidata.org/entity/Q6835322", "itemLabel": "Michael White", "itemDescription": "British theatrical impresario and film producer (1936-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_White_(producer)", "wikipedia_page": {"main": "Michael Simon White (16 January 1936 – 7 March 2016) was a British theatrical impresario and film producer. White was responsible for 101 stage productions and 27 films over 50 years.", "link_mentions": [{"page": "John Cleese", "response": ["Cleese was interviewed and appears as himself in filmmaker Gracie Otto's 2013 documentary film The Last Impresario, about Cleese's longtime friend and colleague Michael White. White produced Monty Python and the Holy Grail and Cleese's pre-Python comedy production Cambridge Circus. At a comic press conference in November 2013, Cleese and other surviving members of the Monty Python comedy group announced a reuniting performance to be held in July 2014."]}, {"page": "January 16", "response": ["*1936 – Michael White, Scottish actor and producer (d. 2016)"]}, {"page": "Monty Python and the Holy Grail", "response": ["A 2021 tweet by Eric Idle revealed that the film was financed by eight investors: Led Zeppelin, Pink Floyd, Jethro Tull's Ian Anderson, Holy Grail co-producer Michael White, Heartaches (a cricket team founded by lyricist Tim Rice), and three record companies including Charisma Records, the record label that released Python's early comedy albums. The investors contributed the entire original budget of £175,350 (about $410,000 in 1974). He added that this group also received a cut of the proceeds from the 2005 musical Spamalot."]}, {"page": "The Rocky Horror Picture Show", "response": ["The Rocky Horror Picture Show is a 1975 musical horror comedy film by 20th Century Fox, produced by Lou Adler and Michael White and directed by Jim Sharman. The screenplay was written by Sharman and actor Richard O'Brien, who is also a member of the cast. The film is based on the 1973 musical stage production The Rocky Horror Show, with music, book, and lyrics by O'Brien. The production is a parody tribute to the science fiction and horror B movies of the 1930s through to the early 1960s. Along with O'Brien, the film stars Tim Curry, Susan Sarandon, and Barry Bostwick and is narrated by Charles Gray with cast members from the original Royal Court Theatre, Roxy Theatre, and Belasco Theatre productions including Nell Campbell and Patricia Quinn.", "O'Brien showed a portion of the unfinished script to Australian director Jim Sharman, who decided to direct it at the small experimental space Upstairs at the Royal Court Theatre, Sloane Square, Chelsea, London, which was used as a project space for new work. O'Brien had appeared briefly in a stage production of Andrew Lloyd Webber's Jesus Christ Superstar, directed by Sharman, and the two also worked together in Sam Shepard's The Unseen Hand. Sharman would bring in production designer Brian Thomson. The original creative team was then rounded out by costume designer Sue Blane, musical director Richard Hartley, and stage producer Michael White, who was brought in to produce. As the musical went into rehearsal, the working title, They Came from Denton High, was changed just before previews at the suggestion of Sharman to The Rocky Horror Show.", "Ten years later, O'Brien wrote another script intended as a direct sequel to the cult classic, entitled Revenge of the Old Queen. Producer Michael White had hoped to begin work on the production and described the script as being \"in the same style as the other one. It has reflections of the past in it.\" Revenge of the Old Queen had apparently commenced pre-production; however, after studio head Joe Roth was ousted from Fox in 1993, the project was shelved indefinitely. Although the script has not been published, bootleg copies can be read on the internet, and one song from the project's original demo tape circulates among fans. The script is currently owned by Fox, which produced the two original films. Most individuals associated with the project, including O'Brien, agree that the film will probably never be made, owing to the failure of Shock Treatment and the aging of the original cast."]}, {"page": "The Rocky Horror Show", "response": ["The original creative team was then rounded out by costume designer Sue Blane and musical director Richard Hartley, although Pete Moss would later take over as musical director. Michael White was also brought in to produce Rocky Horror. As the musical went into rehearsal, the working title for it became They Came from Denton High, but it was changed just before previews at the suggestion of Sharman to The Rocky Horror Show.", "On Wednesday 8 August 1979 The Haymarket Production of The Rocky Horror Show, presented in association with Cameron Mackintosh and Michael White, began a month-long run at the Leicester Haymarket Theatre. After its Haymarket run followed a major national tour to Wolverhampton, Norwich, Leeds, Bristol, Newcastle, Birmingham, Brighton, York, Lincoln, Southsea, Oxford, and ending at Cork, Ireland in December 1979.", "A French-language version of the musical was staged at the Théâtre de la Porte Saint-Martin, Paris in 1975. Production by Jean-Pierre Reyes in association with Michael White. Original text and music booklet by Richard O'Brien; adapted into French by Javier Arroyuelo and Rafael Lopez Sanchez, the song's lyrics were translated by Alain Boublil; directed by Pierre Spivakoff; sets and costumes by Elisabeth Saurel and choreography by Victor Upshaw."]}, {"page": "1981 in film", "response": ["| Polyester || New Line Cinema / Dreamland / Michael White Productions || John Waters (director/screenplay); Divine, Tab Hunter, Edith Massey, Mink Stole, Stiv Bators, Susan Lowe, Cookie Mueller, Mary Vivian Pearce, Jean Hill, George Figgs, David Samson, Ken King, Mary Garlington, Joni Ruth White, Hans Kramm, Rick Breitenfeld, George Hulse, Marina Melin || Comedy || Live action"]}, {"page": "Tim Rice", "response": ["On 19 August 1974, Rice married Jane Artereta, daughter of Colonel Alexander Henry McIntosh, OBE, and former wife of producer and talent agent Michael Whitehall, the couple having met while working at Capital Radio. The marriage unravelled in the late 1980s after the British tabloid newspapers revealed that he had been conducting an affair with the singer Elaine Paige.Hastings, Christopher.  \"Elaine Paige: Sex, drugs and musicals\", The Daily Telegraph, 20 September 2008. Jane retains the title Lady Rice as, despite obtaining a divorce decree nisi, the couple never made it absolute and therefore they remain technically married."]}, {"page": "Pierce Brothers Westwood Village Memorial Park and Mortuary", "response": ["* Michael White (1936–2016), producer"]}, {"page": "The Comic Strip", "response": ["Two double acts, Adrian Edmondson and Rik Mayall under the name \"20th Century Coyote\" and Nigel Planer and Peter Richardson as \"The Outer Limits\", started performing at the newly-opened Comedy Store in London in mid-1980, alongside compere Alexei Sayle who had been resident there since the Comedy Store opened in 1979. Concurrently Richardson searched for a venue to mount a play he had produced with Michael White. He planned to run The Comic Strip late at night after the play's performances. He sourced the Raymond Revuebar in Soho, but realising it was unsuitable for a theatrical production and running out of enthusiasm for the play, he decided to continue with the idea of a cabaret night. He persuaded the double acts and Sayle to move from the Comedy Store along with Arnold Brown, an older stand-up comic who did not fit so obviously into the alternative comedy scene. Sayle again resumed his compere duties and decided the running order, with Richardson having behind-the-scenes control. Richardson put out an advert for female performers which was answered by French and Saunders.", "A second series of seven episodes followed in 1983–84, including Five Go Mad on Mescalin, a sequel to the first episode, and the newly-written Eddie Monsoon – A Life?, a spoof documentary on the life and times of the title character, an obscene, drunken television host (played by Adrian Edmondson). Michael White, the theatre impresario and Rocky Horror Show producer who had been brought in by Richardson as executive producer on the series, appeared in this episode as Monsoon's producer, who had been responsible for axing Eddie's television comeback show—called Back to Normal with Eddie Monsoon. The reasons given for the cancellation (e.g. \"the things you said about Burt Reynolds\") are presumably the same problems that led to the real Back to Normal... being dropped by Channel 4. (The name Eddie Monsoon—a corruption of \"Edmondson\"—was later used by Jennifer Saunders, core member and Adrian Edmondson's wife, for her character in Absolutely Fabulous.) A Fistful of Travellers' Cheques was the first episode to be filmed outside the United Kingdom, being made on location in and around San José, Andalusia, Spain, using some of the same locations as A Fistful of Dollars which it spoofs."]}, {"page": "Barry Humphries", "response": ["Humphries appears in the 2013 documentary Chalky about his longtime friend and colleague Michael White, who produced many of Humphries' first Dame Edna shows in the UK."]}, {"page": "Peter Richardson (British director)", "response": ["After Rank, Richardson toured with a band in Italy and also helped run drama courses for children at his parents' house in Devon. One of the dramas produced from these courses became a show called The Wild Boys, based on the book by William Burroughs. Richardson performed this show at the ICA in London as well as touring the show with the group Furious Pig. Through this, Richardson first met Michael White, with whom he planned to take the show into the West End, although this came to nothing. He worked as an extra on Michael Palin's Ripping Yarns' second series in 1979, appearing as a German spy pretending to be a Cornish fisherman, in Whinfrey's Last Case.", "As a result of searching for a West End venue to stage The Wild Boys, Richardson and Michael White sourced a new possible venue for his own comedy club, the Boulevard Theatre in the Raymond Revue Bar, run by Paul Raymond. Richardson called it The Comic Strip, taking with him a core group from the Comedy Store. It opened in October 1980 and ran until 1981, when the troupe went on a national tour. Richardson approached producer Mike Bolland, the newly appointed Channel Four youth and entertainment commissioning editor to propose a series of Comic Strip films for the channel. Bolland agreed to his proposal, his first commission for the station and Jeremy Isaacs quickly approved the budget. The series opener, Five Go Mad in Dorset was the first comedy shown on the new channel on its opening night in November 1982."]}, {"page": "Richard O'Brien", "response": ["After seeing the second night's performance of The Rocky Horror Show in the Theatre Upstairs, Jonathan King produced the original cast soundtrack in just over 48 hours during an off-stage weekend, and rushed it out on his UK Records label. He also became a 20% backer with producer Michael White, who put up the remaining 80%."]}, {"page": "Jonathan King", "response": ["In June 1973, after seeing The Rocky Horror Show on its second night, King invested a 20% stake in it, making him one of its two original backers, along with Michael White, and produced and released The Rocky Horror Show Original London Cast.Thompson, Dave (2016). The Rocky Horror Picture Show FAQ, Hal Leonard Corporation."]}, {"page": "Film4 Productions", "response": ["* Eat the Rich (co-production with Michael White)", "* The Ploughman's Lunch (co-production with Goldcrest Films and Michael White)", "* The Pope Must Die (co production with Miramax Films, Palace Pictures and Michael White)", "* The Supergrass (co-production with The Comic Strip and Michael White)"]}, {"page": "Michael White", "response": ["* Michael White (psychotherapist) (1948–2008), inventor of narrative therapy", "* L. Michael White, American theologian", "* Michael White (criminologist) (born 1951), professor of criminology at Arizona State University", "* Michael White (journalist) (born 1945), associate editor and former political editor of The Guardian newspaper", "* Michael White (author) (1959–2018), British science writer and novelist", "* Michael White (clarinetist) (born 1954), New Orleans jazz musician", "* Michael White (singer), country music artist", "* Michael White (violinist) (1933–2016), jazz musician", "* Michael White & the White, American hard rock combo and occasional Led Zeppelin tribute band", "* Trippie Redd (Michael White IV, born 1999), rap artist from Canton, Ohio", "* Michael White (bobsleigh) (born 1964), Jamaican Olympic bobsledder", "* Michael White (footballer) (born 1987), Waitakere United player", "* Michael White (snooker player) (born 1991), Welsh snooker player", "* Michael White (cricketer) (1913–2003), English cricketer", "* Michael White (baseball) (born 1968), first-round pick by the L.A. Dodgers in the 1986 draft", "* Michael White (producer) (1936–2016), British theatre and film producer", "* Michael White (judge) (born 1953), Irish High Court judge", "* Michael White (chef), American chef", "* Michael White (businessman), owner of the Rite-Hite company", "* Michael White (British Army officer) (1791-1868), British Army general"]}, {"page": "Shock Treatment", "response": ["Following the unexpected and overwhelming success of The Rocky Horror Picture Show on the midnight circuit, Richard O'Brien approached producer Michael White with the idea of making a sequel. In 1978, he began work on a script titled Rocky Horror Shows His Heels, which found Frank and Rocky resurrected, Brad and Dr. Scott turned gay, and Janet on the verge of giving birth to Frank's baby. Director Jim Sharman was resistant to revisit the material and Tim Curry had no desire to reprise the role of Frank, but O'Brien had put some work into the songs, so he decided to retain them and simply revise the story."]}, {"page": "The Members", "response": ["In 1978/79, the Members continued to play the London pub and club circuit, became a feature in the music press and were championed by John Peel. They signed to Virgin Records in 1978, for which label they recorded \"The Sound of the Suburbs\", again produced by Steve Lillywhite. This became The Members' biggest chart success and their best-known song in the UK. The follow-up single, \"Offshore Banking Business\", a reggae tune written by Carroll, based on his experiences working in offshore banking at the private bank Coutts, did not achieve the same popularity. A version of \"Offshore Banking Business\" was recorded for the early 1980s film Urgh! A Music War, produced by Michael White, distributed by Filmways and Lorimar Productions."]}, {"page": "The Bullshitters: Roll Out the Gunbarrel", "response": ["*Michael White as Himself "]}, {"page": "White Mischief (film)", "response": ["Film rights were optioned by Michael White, a friend of Fox's, while the book was being written.\"A WEST END WINNER: MICHAEL MURPHY met the successful impresario MICHAEL WHITE, an American with a string of theatrical hits behind him, in London\". Murphy, Michael. The Irish Times, 20 Dec 1984: 10."]}, {"page": "Eat the Rich (film)", "response": ["Eat the Rich is a 1987 British black comedy film directed by Peter Richardson, who shared writing credits with Pete Richens. A co-production between Channel Four Films, Iron Fist Motion Pictures and Michael White Productions, it features cast members from the popular television series The Comic Strip Presents...."]}, {"page": "Pauline Boty", "response": ["In June 1963 she married the literary agent Clive Goodwin (1932–1978) after a ten-day romance.Watling (1998), p.16 Her marriage disappointed others such as Peter Blake and her married lover, the television director Philip Saville, whom she had met towards the end of her student days and had worked for. (Their affair is said to have provided the material for a screenplay by Frederic Raphael for the movie Darling (1965).)Boty auditioned for the role that went to Julie Christie. See Bill Smith, \"The Only Blonde in the World\", Latest Art, February 2006, p. 1 Boty and Goodwin's Cromwell Road flat became a central hang-out for many artists, musicians, and writers, including Bob Dylan (whom Boty brought to EnglandBoty and Philip Saville brought Dylan to England, collecting him from London Airport. Dylan stayed in Boty's flat. See Smith, p. 10.), David Hockney, Peter Blake, Michael White, Kenneth Tynan, Troy Kennedy Martin, John McGrath, Dennis Potter and Roger McGough.Smith, p. 14 Goodwin, to be later a member of the founding editorial team of the radical journal Black Dwarf, is said to have encouraged Boty to include political content in her paintings."]}]}}