{"wiki_id": "http://www.wikidata.org/entity/Q6830494", "itemLabel": "Michael Gallagher", "itemDescription": "British miner, politician and software development company executive (1934-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Gallagher_(British_politician)", "wikipedia_page": {"main": "Michael Gallagher (1 July 1934 – 10 June 2015) was a British miner, politician and software development company executive. He was the only Member of the European Parliament to have been a member of the original Social Democratic Party, when he left the Labour Party in 1984.", "link_mentions": [{"page": "List of members of the European Parliament for the United Kingdom (1979–1984)", "response": ["|Michael Gallagher", "* Michael Gallagher announced on 5 January 1984 that he had joined the Social Democratic Party."]}, {"page": "East Midlands (European Parliament constituency)", "response": ["| Michael GallagherLabour (1979–1984)SDP (1984)"]}, {"page": "Michael Gallagher", "response": ["* Michael Gallagher (academic) (born 1951), British political scientist at Trinity College, Dublin, inventor of the Gallagher Index", "* Michael Gallagher (British politician) (1934–2015), British MEP 1979–1984", "* Michael Gallagher (political advisor) (born 1964), American presidential adviser and president and CEO of the Entertainment Software Association", "* Michael Gallagher (Australian footballer) (born 1966), Australian rules footballer", "* Michael Gallagher (cyclist) (born 1978), Australian Paralympic cyclist", "* Michael Gallagher (soccer) (born 1994), United Soccer League Player (Portland Timbers 2)", "* Michael Gallagher (guitarist) (fl. 1994–2010), ex-guitarist of the American band Isis", "* Michael Gallagher (journalist) (born 1958), American journalist", "* Michael Gallagher (postman and prognosticator) (fl. 2007–2015), Irish amateur weather forecaster", "* Michael Gallagher (translator) (born 1930), American translator of Japanese literature ", "* Michael Gallagher (writer) (born 1951), American comic book and satire writer", "* Michael Gallagher (bishop) (1866–1937), American bishop", "* Michael Gallagher, played by Paul Newman in the 1981 American drama Absence of Malice"]}, {"page": "Technical Group of Independents (1979–1984)", "response": ["The group was a rather diverse alliance, and this was reflected in its chairs which included the Italian Radical Marco Pannella, the hardline Irish Republican Neil Blaney and Danish left-wing Eurosceptic Jens-Peter Bonde. On 13 December 1983, the group was joined by British MEP Michael Gallagher of the Social Democratic Party, who was previously member of the Labour Party and Socialist Group.", "|Michael Gallagher"]}, {"page": "List of political parties in the United Kingdom by representation", "response": ["|Michael Gallagher"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Michael Gallagher"]}, {"page": "Patrick O'Flynn", "response": ["O'Flynn was the running-mate for Lisa Duffy in the September 2016 UK Independence Party leadership election. He left the UKIP frontbench in July 2017, believing that the party no longer supported his centrist economic policies. He joined the SDP in November 2018. He cited UKIP leader Gerard Batten's appointment of Tommy Robinson (Stephen Yaxley-Lennon) as an adviser as a key reason for his departure from the party. He said of his decision to join the SDP: \"like many on the communitarian wing of [UKIP], I have decided to join the resurgent SDP, which campaigned for Brexit during the referendum and espouses broad and moderate pro-nation state political values that I – and I believe many of our voters from 2014 – will be delighted to endorse.\" In defecting, O'Flynn became the first MEP to sit in the European Parliament for the SDP (though in 1984 Michael Gallagher MEP had joined the original SDP)."]}, {"page": "Category talk:Social Democratic Party (UK) MEPs", "response": ["In 1984 Michael Gallagher (British politician) MEP joined the Social Democratic Party (UK); Patrick O'Flynn joined the Social Democratic Party (UK, 1990–present) in  2018. These are separate parties so I question whether they should be placed in the same category. "]}]}}