{"wiki_id": "http://www.wikidata.org/entity/Q6845832", "itemLabel": "Mike Adams", "itemDescription": "professional footballer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Adams_(footballer)", "wikipedia_page": {"main": "Michael Alan Adams (born 20 February 1965 in Banwell, Somerset) is an English former professional footballer.\nAdams began his career as an apprentice with Bristol Rovers. He played just once for their first team before leaving to join Bath City, initially on loan, in March 1984. His only appearance for The Pirates came in the final game of the 1982–83 season; a match that was a memorable one for several reasons. Rovers' previous manager, Bobby Gould, had resigned the day before, their opponents, Cardiff City, won promotion thanks to the point they earned in this 1–1 draw, it was the final professional game for former England international and FIFA World Cup winner Alan Ball, and Rovers player Aidan McCaffery required life-saving treatment from the physio after swallowing his tongue. All of these events combined left Adams's 27-minute cameo at the end of the game somewhat unnoticed.He signed a permanent contract with Bath late in May 1984 and was a regular with them for four years, scoring 22 times in 175 first team games, until being released in May 1988 by new City manager Harold Jarman. He then spent five years with Weston-super-Mare, before joining Keynsham Town in 1993.", "link_mentions": [{"page": "Mike Adams", "response": ["Mike Adams may refer to:", "*Mike Adams (offensive tackle) (born 1990), American football offensive tackle for the Pittsburgh Steelers", "*Mike Adams (safety) (born 1981), American football safety for the Carolina Panthers", "*Mike Adams (wide receiver) (born 1974), former American football wide receiver of the Pittsburgh Steelers", "*Mike Adams (outfielder) (born 1948), Major League Baseball outfielder", "*Mike Adams (pitcher) (born 1978), Major League Baseball pitcher", "*Mike Adams (footballer) (born 1965), English former professional footballer", "*Mike Adams (football manager) (born 1959), English manager of the Grenada national football team", "*Mike Adams (columnist) (1964–2020), American conservative columnist", "*Mike Adams, founder of website Natural News"]}, {"page": "Mike Adams (football manager)", "response": ["Mike Adams (born 1959) is the manager of the Grenada national football team."]}]}}