{"wiki_id": "http://www.wikidata.org/entity/Q6845491", "itemLabel": "Mik Basi", "itemDescription": "British boxing referee", "wikipedia_url": "https://en.wikipedia.org/wiki/Mik_Basi", "wikipedia_page": {"main": "Amrik \"Mik\" Basi MBE (born 21 May 1966 in Forest Gate in east London) is a British boxing referee based at Fairbairn Boxing Club  in Manor Park in the London Borough of Newham.  He took the Olympic Oath during the 2012 Summer Olympics opening ceremony on behalf of officials. During the Games he acted as referee or judge in both men's and women's boxing, and officiated a total of 38 matches including refereeing the men's light heavyweight final, becoming the first British official to Referee a final.  He received the AIBA award as the top boxing official at the tournament. In 2013, Mik won the best AIBA Referee & Judge award, in 2014 he won the best World Series Boxing Referee & Judge award and in 2015 he won the best AIBA Pro Boxing Referee & Judge award, an achievement unlikely ever to be repeated. In 2016, Mik acted as referee or judge in both men's and women's boxing at the 2016 Rio Olympics, becoming the first ever British referee/judge to officiate at two Olympic Games.Mik was appointed a Member of the Order of the British Empire (MBE) in the 2019 Birthday Honours List.", "link_mentions": [{"page": "Olympic Oath", "response": ["|2012 Summer Olympics||Sarah Stevenson||Mik Basi||Eric Farrell||"]}, {"page": "2012 Summer Olympics opening ceremony", "response": ["The Olympic Flag was carried by eight people chosen from around the world to embody the Olympic values: Doreen Lawrence (chosen for her \"tireless thirst for justice\"), Haile Gebrselassie (for his \"fight against poverty\"), Sally Becker (for her \"courage\"), Ban Ki-moon (as UN general secretary), Leymah Gbowee (as \"a great peacemaker\"), Shami Chakrabarti (for \"her integrity\"), Daniel Barenboim (for bringing \"harmony in place of discord\"), and Marina Silva (as UN Champion of the Earth). The flag paused in front of Muhammad Ali (invited to represent 'respect, confidence, conviction, dedication, generosity and spiritual strength'), who held it for a few moments. The flag was received by a colour guard of Her Majesty's Armed Forces and hoisted to the Olympic Hymn, performed by the LSO and the Grimethorpe Colliery Band. A brief reprise of \"And I will Kiss\" commenced the Olympic Oaths, taken by taekwondo athlete Sarah Stevenson on behalf of the athletes, by British AIBA Referee Mik Basi on behalf of the officials, and by Eric Farrell on behalf of the coaches."]}]}}