{"wiki_id": "http://www.wikidata.org/entity/Q6847878", "itemLabel": "Mike McClean", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_McClean", "wikipedia_page": {"main": "Mike \"Squeaky\" McClean (17th August 1969) is a British Comedian, television presenter and actor. He was a roving reporter on Richard & Judy and The Big Breakfast and appeared in The Office: \"Christmas Special\" and House of Games. He also has two sons one of which Carter mcClean(30th November 2007) is an English footballer who plays for Billericay town", "link_mentions": [{"page": "The Big Breakfast", "response": ["The programme relaunched with a new logo and updated theme on Monday 22 January 2001. The house had also been redecorated in more muted colours, echoing the ill-fated 1996 revamp. The programme moved to a line up of three main presenters, Paul Tonkinson, Amanda Byram and Donna Air. However, Tonkinson was dropped from the programme at the end of March 2001 and Air left not long after. Richard Bacon and Amanda Byram remained as main presenters, the programme having reverted to two main presenters once more. The living room, which had been repainted a dark red as part of the revamp, was changed to a bright yellow and pink design, while the main presenter chairs were also reinstalled in front of the living room's French windows. They replaced the bright green sofa which had also been brought in as part of the revamp. The new logo was replaced with one more closely resembling the traditional Big Breakfast logo, albeit utilising a slightly different font. Mike McClean was given a role on the programme, as Down Your Doorstep presenter and cover for Bacon, most regularly on Fridays when Bacon would reprise his former Down Your Doorstep role alongside Johnny Vegas.", "Mark Lamarr, Keith Chegwin, Paul Ross, Richard Orford, Richard Bacon and Mike McClean were \"down your doorstep\" outside broadcasters, often turning up live and unannounced at an unsuspecting viewer's house, while rooms within the Lock Keeper's Houses featured the puppets Zig and Zag and video games guru Ben the Boffin.", "* Mike McClean (2000–02)"]}, {"page": "Howard Brown (Halifax Bank)", "response": ["In 2003, he had a role in The Office Christmas special, playing himself alongside Ricky Gervais as David Brent and Paul \"Bubble\" Ferguson from Big Brother 2. The three men took part in a nightclub promotion Blind Date game which was hosted by Mike McClean. Brown and Bubble were getting on much better with the female contestant than Brent, much to his dissatisfaction. When Brown sat down, McClean shouted at the audience \"Who gives you extra?\" to which they replied \"Who Who Who?\". This is a reference to the Halifax advert which sings \"Who gives you extra?\" to the tune of \"Who Let the Dogs Out?\" by the Baha Men. Brown does not actually sing in that particular advert as it was performed by Matt Thornfield and Brown only appeared in cartoon form."]}, {"page": "XFM Manchester", "response": ["*Mike McClean"]}, {"page": "Michael McLean", "response": ["* Mike McClean, British broadcaster"]}, {"page": "McClean", "response": ["* Mike McClean, British television presenter and actor"]}, {"page": "Matt Brown (broadcaster)", "response": ["He started out in 1999 hosting Nickelodeon UK along with Mike McClean, Simon Amstell, Casey-Jane Rand, Mounya Khamlichi and Yiolanda Koppel, but is best known for presenting the ITV2 spin-off programmes Love Island Aftersun, which he hosted in 2005 with Celebrity Love Island winner Jayne Middlemiss in 2006, and I'm a Celebrity...Get Me Out of Here! NOW!, with Tara Palmer-Tomkinson. He also hosts the UK Top Ten on Eat Cinema, with Mohini Sule."]}, {"page": "Mad for It", "response": ["Mad for It was a British game show for children which was produced by Carlton Television broadcast on ITV from 2 September 1998 to 31 March 2000. Series 1 was hosted by former Nickelodeon presenters Mike McClean and Yiolanda Tokkallos. Series 2 was hosted by Mike McClean, Danielle Nicholls, and Nigel Mitchell. There was also a regular character called Pie Boy, played by Alex Verrey, who would go around hitting random people in the studio with flans in a manner like The Phantom Flan Flinger from Tiswas. "]}, {"page": "It's Not Fair", "response": ["The show was hosted by Mike McClean,"]}, {"page": "2001 in British television", "response": ["*6 April – The Big Breakfast co-presenter Paul Tomkinson has been sacked from the show, it is reported, bosses having told him of their decision to let him go the previous day. His role on the morning's edition of the programme is filled by Mike McClean."]}, {"page": "List of programmes broadcast by Challenge", "response": ["| House of Games || 2004 || 2004–2015 || Presented by Mike McClean."]}]}}