{"wiki_id": "http://www.wikidata.org/entity/Q6847066", "itemLabel": "Mike Green", "itemDescription": "English footballer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Green_(footballer,_born_July_1989)", "wikipedia_page": {"main": "Michael John Green (born 23 July 1989 in Bristol) is an English footballer. Green has spent the majority of his career with Bristol Rovers including loan spells at various non-league sides including Gloucester City and Cirencester Town.\nHe plays as a goalkeeper and signed his first professional contract in the summer of 2006, having graduated from their Centre of Excellence at South Gloucestershire and Stroud College, earning himself a place in the Bristol Rovers squad for the 2006–07 season. He has had loan spells at Mangotsfield United in the Southern League Premier Division and Clevedon Town. He was signed on a season-long loan by Gloucester City manager David Mehew in July 2009, and was voted joint Player of the Season in April 2010 after helping the club to avoid relegation from the Conference North.After regularly appearing as an unused substitute for Bristol Rovers since 2006, Green finally made his Bristol Rovers debut in a 6–1 defeat to Oxford United in a League Cup 1st round match on 10 August 2010. On 4 September 2010, Green made his league debut in the 1–1 draw at Oldham Athletic in League One, a game which he also picked up a yellow card for time-wasting.He was one of seventeen players released by Bristol Rovers in May 2011.In August 2011, Green signed for Eastleigh on a non-contract basis, following a previous trial period. Green made just one appearance for Eastleigh before being released. He then returned to Gloucester City on a short-term deal as cover for injured Kevin Sawyer and featured in a game against Workington on 20 August 2011.\nGreen then featured in a Southern Premier Division game for Cirencester Town on 29 August 2011 as cover for Danny Greaves against Chesham United. He then joined Cirencester permanently after when Danny Greaves quit the club to return to Mangotsfield United.\nHowever, after a short spell with Cirencester, Green returned to Gloucester City to replace the departing Kevin Sawyer who went the other way and joined Cirencester.", "link_mentions": [{"page": "Michael Green", "response": ["* Mike Green (Michigan politician) (born 1948), American Republican politician from Michigan", "* Mike Green (West Virginia politician) (born 1973), American state senator in West Virginia", "* Mike Green (linebacker) (born 1961), American football player", "* Mike Green (defensive back) (born 1976), American football player", "* Mike Green (running back) (born 1976), American football player", "* Mike Green (footballer, born 1946), English footballer", "* Mike Green (footballer, born May 1989), English", "* Mike Green (footballer, born July 1989), English goalkeeper", "* Mike Green (basketball, born 1951), American", "* Mike Green (basketball, born 1985), American", "* Mike Green (ice hockey, born 1979), Canadian ice hockey centre", "* Mike Green (ice hockey, born 1985), Canadian ice hockey defenceman", "* Mike Green (racquetball) (born 1973), Canadian", "* Mike Greene (British entrepreneur)"]}, {"page": "2007 Football League Two play-off Final", "response": ["|GK ||31 ||Mike Green"]}, {"page": "Mike Green (goalkeeper)", "response": ["#REDIRECT Mike Green (footballer, born July 1989)"]}, {"page": "Mike Green (footballer, born 1988)", "response": ["#REDIRECT Mike Green (footballer, born July 1989)"]}, {"page": "2009–10 Bristol Rovers F.C. season", "response": ["|Mike Green"]}]}}