{"wiki_id": "http://www.wikidata.org/entity/Q6840264", "itemLabel": "Paul Gibb", "itemDescription": "English Test and County cricketer, umpire (1913-1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Gibb", "wikipedia_page": {"main": "Paul Antony Gibb (11 July 1913 – 7 December 1977) was an English cricketer, who played in eight Tests for England from 1938 to 1946. He played first-class cricket for Cambridge University, Yorkshire and Essex, as a right-handed opening or middle order batsman and also kept wicket in many matches.", "link_mentions": [{"page": "December 7", "response": ["*1977 – Paul Gibb, English cricketer and umpire (b. 1913)"]}, {"page": "July 11", "response": ["*1913 – Paul Gibb, English cricketer (died 1977)"]}, {"page": "Yorkshire County Cricket Club", "response": ["* Paul Gibb"]}, {"page": "Essex County Cricket Club", "response": ["* Paul Gibb"]}, {"page": "St Edward's School, Oxford", "response": ["* Paul Gibb, England Test cricketer"]}, {"page": "Godfrey Evans", "response": ["Evans made his Test debut in 1946 against India, when he was chosen for the third Test at The Oval, replacing Paul Gibb. In a largely rain affected contest he didn't bat or take any dismissals."]}, {"page": "List of Test cricketers", "response": ["Paul Gibb ·"]}, {"page": "Matt Prior", "response": ["Matt Prior was chosen ahead of Paul Nixon for the keeper's spot for the first Test of the summer at Lord's in 2007 against the West Indies. He scored a hundred on his debut, taking just 105 deliveries and hitting 16 boundaries after coming in at number 7, and finishing on 126 not out. He became the first England wicket keeper to score a Test hundred on debut and the 17th English batsman to record the feat overall. Although both Paul Gibb and Billy Griffith scored debut centuries, and although both were wicket-keepers, neither was actually keeping wicket in their debut Test. The last wicketkeeper to make a half century on debut was Jack Russell, who scored 94 against Sri Lanka at Lords in 1988. Prior was one of four centurions in the innings along with Alastair Cook, Paul Collingwood and Ian Bell. It was the first time since 1938 that four England players scored hundreds in the same innings of a Test match. Prior continued his impressive form into the next game, making 75 as England secured a victory on an innings and 283 runs. Prior again starred in the next game, making 40, although he was dismissed for a duck in the second innings as England won the game by 60 runs. In the final game of the Test series, Prior contributed 62, helping England to win by seven wickets. Throughout the series Prior made eight catches from behind the stumps."]}, {"page": "Harold Rhodes (cricketer)", "response": ["Although facing strong competition from bowlers such as Brian Statham and Fred Trueman, Rhodes might have expected to play many more Tests. But doubts about the legality of his bowling action emerged, and in the 1960 season, playing for Derbyshire against the South Africans, he was \"called\" for throwing – bowling the ball with a bent arm that straightens in the delivery – by the umpire and former Test batsman, Paul Gibb. Later in the 1960 season, he was no-balled again by Gibb, and by Syd Buller. He took 78 first-class wickets in the season and took two five wicket innings."]}, {"page": "Old Wanderers", "response": ["| 28 || 106 || Paul Gibb ||  ||  NA ||  ||  || Drawn"]}, {"page": "Billy Griffith", "response": ["Griffith was born in Wandsworth, London, and educated at Dulwich College and Pembroke College, Cambridge.GRIFFITH, Stewart Cathie, Who Was Who, A & C Black, 1920–2016 (online edition, Oxford University Press, 2014) He scored over 1,200 runs during four years in the 1st XI at Dulwich, despite being in the shadow of Hugh Bartlett, and he became a capable wicket-keeper. He won his blue in his second year at Cambridge. He toured Australia and New Zealand with the MCC under Errol Holmes's captaincy in 1935-36. He lost his Cambridge place to Paul Gibb in 1937."]}, {"page": "Geoff Griffin", "response": ["Griffin's first match of the 1960 tour was against Derbyshire, on 7–10 May. During this game the umpire Paul Gibb called the Derbyshire fast bowler Harold Rhodes six times for throwing, but Griffin remained unmolested. He took three wickets in his side's easy victory. In his next county game, against Essex, on 14–17 May, Griffin again escaped attention from the umpires, but members of the media, including the writer and former Test bowler Ian Peebles, wrote that \"there was something amiss\". The following week, in the match against the MCC at Lord's on 21–24 May, Griffin was called for throwing by both umpires, John Langridge and Frank Lee, the first member of any touring side to be thus called.  When, a few days later, he was called again in the match against Nottinghamshire, it was clear that some action needed to be taken."]}, {"page": "Don Brennan (cricketer)", "response": ["Born in Eccleshill, Bradford, Yorkshire, Brennan played Bradford League cricket for his home town before his break into first-class cricket in 1947.Double debut joy for Tykes, Telegraph & Argus, Retrieved on 19 December 2008 Brennan played two second XI matches in 1946, but first team opportunities were blocked by Paul Gibb, Arthur Wood and Kenneth Fiddling. However, all three had left the club by the start of the 1947 season, leaving Brennan and Harry Crick in competition for the keeper spot."]}, {"page": "Butch White", "response": ["He was a muscular bowler, running in energetically from 25 yards, with a convulsive delivery stride. He troubled batsmen for pace, and combined a natural in-swinger with a ball that held its line outside off stump. He was no-balled for throwing by Paul Gibb twice in 1960, but Gibb later recognised that he had been mistaken. His batting was limited, and tended to the agricultural. In 1960, he scored 28 off an over bowled by Oxford University off-spinner Dan Piachaud: after a dot ball, he hit four sixes and then a four."]}, {"page": "Throwing (cricket)", "response": ["West Indian fast bowler Charlie Griffith, perhaps the most feared fast bowler of his generation, was often suspected of throwing his faster ball although he was not called in Test matches and the promising career of Derbyshire's Harold Rhodes was stunted by constant speculation about the legality of his action.  He was 'called' while playing against the South African tourists in 1960 by Paul Gibb but though he was eventually cleared and played on with great success for Derbyshire through the decade, he played just twice for England."]}, {"page": "List of first-class cricket records", "response": ["| 654–5 || England (v South Africa)In the fifth Test of the series, South Africa won the toss and batted first, scoring 530 with centuries from Pieter van der Bijl (125) and Dudley Nourse (103); Reg Perks took five for 100.  England replied with 316.  Not enforcing the follow-on, South Africa scored 481 in their second innings, Alan Melville scoring 103.  Set 696 to win, England's score was 654 for five at the end of the ninth day of the match, Paul Gibb having scored 120, Bill Edrich 219 and Wally Hammond 140.  No play was possible on the eighth day of the match because of rain.  Even though England only needed another 42 runs, they had to leave to catch their boat home, and so the game was drawn.  Scorecard || Drawn || Durban || 1938–39"]}, {"page": "English cricket team in Australia in 1946–47", "response": ["Unlike the Australians, the selectors preferred to use cricketers who had made their name in the 1930s and selection appeared to be on the basis of pleasing the English public, who only knew the older players.pp6-8, Cary Only Alec Bedser, Godfrey Evans and Norman Yardley had played little or no first-class cricket before the war. Evans, Yardley and Edrich were late choices; Evans as Paul Gibb's understudy, Yardley as vice-captain despite a poor season as an amateur had to be vice-captain and Bill Edrich after he made 222 not out against Northants. Eric Hollies was thought unlucky not to be picked after he took 184 wickets (15.60) including 10/49 in an innings against Notts – 7 bowled and 3 lbw – but he failed in 1950–51.pp8-9, Cary To be fair, few new names suggested themselves; the 26-year-old Reg Simpson had batted well for the RAF in India, but made only 592 runs (24.66) in 1946, the 23-year-old Trevor Bailey was seen only as a good fielder, making 412 runs (31.69) and taking 37 wickets (24.40), and the 24-year-old Jim Laker only took 8 wickets (21.12).", "The MCC chose a number of all-rounders for their team, but none of real quality. The balding and bespectacled Paul Gibb had a sensational tour of South Africa before in 1938–39, when he hit 473 runs (59.12) and two centuries, but in Australia was found to have a weakness against leg-spin and failed. He was chosen for the First Test ahead of Godfrey Evans because of his batting ability, but Evans proved to be a decent batsman, a perky, attacking player who tried to take a run off every ball, but in the Fourth Test he went for a record 95 minutes before scoring while Compton made a century at the other end.p174, R.L Arrowsmith, EVANS, Thomas Godfrey, E.W. Swanton (ed), Barclays World of Cricket, Collins Willow, 1986 At 28 Jack Ikin was one of the younger English players on the tour and apart from five first class matches in 1938 and 1939 he was a post-war player. Not noted for his footwork or strokeplay he was a gritty left-hander who was picked even though he only made one century for Lancashire in 1946. He was popular in Australia as he was a Tobruk Rat who had fought alongside the Australian 9th Division in North Africa.p105, Cary Norman Yardley was a sensible player who liked to play his strokes on the leg-side and though he never made a Test century was a good man in a crisis.p252, R.L Arrowsmith, YARDLEY, Norman Walter Dransfield, E.W. Swanton (ed), Barclays World of Cricket, Collins Willow, 1986 James Langridge, Peter Smith and Bill Voce were bowlers who regularly made runs and even centuries for their counties, but Doug Wright's only hundred had become before the war and afterwards was relegated to the bottom of the batting order. Alec Bedser was a tailender who was capable of hitting a few runs on occasion and Dick Pollard's lack of batting ability was cited as one of the reasons why he was not picked for a Test in the series.", "Paul Gibb was the first choice wicketkeeper at the start of the tour and hailed as the new Les Ames. An amateur batsman for Yorkshire he was a part-time wicketkeeper who was chosen to support Ames in South Africa in 1938–39, though in the end he played in all the Tests as a batsman. The 41-year-old Ames retired as Kent's wicketkeeper after the war in favour of Godfrey Evans, though he continued to play as a batsman until 1950. Evans was taken as the reserve keeper and as Doug Wright's county keeper was thought to have the edge over Gibbs, but was still learning his trade and had dropped Bradman in the game against South Australia. Both keepers fumbled chances on the tour, but Evans, playing in only his second full season of cricket was seen as the most improved player in the team and took lessons from Bert Oldfield who \"did everything he could to assist him to attain the superb heights he ultimately reached\". In the end Hammond chose Gibbs for the first Test, but Evans came in for the Second and thereafter remained England first choice for 13 years. His presence made an immediate difference and improved the England fielding all round. The Australians made over a thousand runs before Evans conceded a bye.pp67-68, Cary"]}, {"page": "1947 English cricket season", "response": ["England, playing under the auspices of MCC, took 17 players to Australia and New Zealand. Wally Hammond captained the side in his final Test series. The other batsmen were Len Hutton, Cyril Washbrook, Denis Compton, Bill Edrich, James Langridge, Laurie Fishlock and Joe Hardstaff junior. Jack Ikin and Norman Yardley were essentially all-rounders. Godfrey Evans and Paul Gibb were the wicketkeepers and the bowlers were Alec Bedser, Doug Wright, Dick Pollard, Peter Smith and Bill Voce. Gibb, Hardstaff, Hutton and Langridge did not play in New Zealand."]}, {"page": "Indian cricket team in England in 1946", "response": ["Mainstays of the England team who each played in all three Tests were captain Wally Hammond, opening batsmen Len Hutton and Cyril Washbrook, middle order batsman Denis Compton and opening pace bowler Alec Bedser. For the first Test at Lord's, England had only three debutants compared with India's six. Bedser and batting all-rounder Jack Ikin were the only \"new\" players in that they had made two and five first-class appearances respectively before the war and each of them was now in his first full season. The third debutant was veteran seam bowler Frank Smailes who had been playing regularly for Yorkshire since 1932. England's other four players in this match were experienced pre-war players: batsman Joe Hardstaff junior, wicket-keeper Paul Gibb, leg spinner Doug Wright and pace bowler Bill Bowes."]}, {"page": "History of the England cricket team to 1939", "response": ["Paul Gibb scored 93 and 106 on debut at Johannesburg on England's 1938/39 tour.  England scored 11 centuries in the series and South Africa 6.  Paynter scored 117 and 100 in the first Test and 243 in the third at Durban.  England, 1–0, in the series, returned to Durban to play a deciding 'timeless' Test to the finish.  It was abandoned as a draw after 10 days as England had to catch the train to catch the boat home.  Needing 696 to win they were, incredibly, 654 for 5, Gibb having scored 120, Hammond 140 and Edrich 219.  A record 1981 runs were scored, and the concept of timeless Tests was abandoned."]}, {"page": "Brandsby", "response": ["Notable residents include England and Yorkshire cricketeer, Paul Gibb, and author, Justin Hill."]}, {"page": "List of people from York", "response": ["*Paul Gibb (1913–1977)"]}, {"page": "Gibb", "response": ["* Paul Gibb (1913–1977), English cricketer"]}, {"page": "Keith Miller in the 1946–47 Australian cricket season", "response": ["The following day, the pitch dried out under the hot sun and turned into a sticky wicket. Miller bowled at a mixture of pace and off breaks and added a large amount of bouncers, leading former Australian Test batsmen and journalist Jack Fingleton to compare the amount of high-paced short-pitched bowling by the Australian pair to that during Bodyline.Perry, p. 189. On the uneven surface, Edrich was struck around 40 times on the body. Miller cut down the English top-order, removing Washbrook, Compton, Edrich and Jack Ikin on the fourth morning to leave England at 5/56. After removing Washbrook, caught by Sid Barnes with only four more runs added to the overnight total, Miller trapped Compton lbw for 17, leaving England at 3/49. After having Edrich caught in the slips by Colin McCool, Miller removed Ikin first-ball, caught behind by wicket-keeper Don Tallon to be on a hat-trick, but Norman Yardley prevented him from taking a third wicket in as many balls. After Hammond and Yardley stabilised the innings with a 61-run partnership, Miller later returned to remove wicket-keeper Paul Gibb and his replacement Bedser in consecutive balls, but last man Wright successfully thwarted Miller's second hat-trick attempt. The Victorian paceman finished with 7/60, his first five-wicket haul at first-class level."]}, {"page": "Sidney Martin", "response": ["Although he never acted as an umpire in a first-class match, he did stand (with Paul Gibb) in Worcestershire's centenary single-innings game against MCC in 1965."]}, {"page": "Dick Horsfall", "response": ["In 1949, Horsfall's cricket was affected for the first time by the back injury that would plague the rest of his career. He appeared in only six first-class matches, and though he returned to just over half of Essex's matches in 1950, his batting was less successful. His only century in these two seasons came in a match against the Combined Services. In 1951, however, he was fully fit and, playing in every Essex match, he made 1655 runs at an average of 35.21. His best score was 206, made in 270 minutes against Kent at Blackheath, and he shared a third wicket partnership of 343 with Paul Gibb which was the Essex county record until beaten by Mark Waugh and Nasser Hussain, who made an unbroken 347 against Lancashire in 1992. The 206 remained Horsfall's highest first-class score and was his only double-century."]}, {"page": "Richard Stanbury (diplomat)", "response": ["Educated at Shrewsbury School, Stanbury was an undergraduate at Magdalene College, Cambridge when selected for his first match for Somerset against Cambridge University. A right-handed lower order batsman and wicketkeeper, he took two catches (Paul Gibb in both Cambridge innings) and scored 6 and 21. The following year he played in a single match against Essex without success."]}, {"page": "1946–47 Ashes series", "response": ["Due to the war this was the first Test to be played in Australia since 3 March 1937 and there were eight Australian debutants; Ian Johnson, Ray Lindwall, Colin McCool, Keith Miller, Arthur Morris, Don Tallon, Ernie Toshack and George Tribe. However, Johnson, Lindwall, McCool, Miller, Tallon and Toshack had played in an Australia vs New Zealand match the previous season which was belatedly recognised as a Test, the only game between the two countries treated as such before 1973. As a result, only Morris and Tribe are now seen as debutants with vice-captain Lindsay Hassett having played only four Tests before the war and Sid Barnes one. Don Bradman made himself available for selection at the last moment against the advice of his doctor due to the severe attack of fibrositis during the war, an ailment from which the England captain Wally Hammond also suffered. There were no English debutants; Hammond, Len Hutton, Cyril Washbrook, Bill Edrich, Denis Compton, Paul Gibb, Bill Voce and Doug Wright were all pre-war players, vice-captain Norman Yardley had played one Test before the war and Alec Bedser and Jack Ikin had debuted against India in 1946. The vaunted England batting line up had done well so far on the tour, with Hutton making 522 runs (87.00), Washbrook 461 runs (51.22), Edrich 221 runs (44.20), Compton 423 runs (60.43) and Hammond 277 runs (55.40), but their bowling had been weakened by injuries. Gibbs was preferred as wicketkeeper over Godfrey Evans because of his batting form in South Africa in 1938–39. There had been a drought in Queensland since 1941 and the curator had tried boring for water without success. The Woolloongabba wicket, traditionally green and helpful to fast bowlers, was a dry, lifeless brown and good for runs. Bradman won the toss and had no difficulty in choosing to bat first.pp. 58–60, Swanton", "The innings began well for England as Wally Hammond caught Arthur Morris in the slips and Alec Bedser had Don Bradman struggling in his third over, the Australian captain twice edging the ball to the close fielders. He was protected by Sid Barnes who controlled the strike and hooked the England bowlers until \"Big Al\" jumped up like a goalkeeper, knocked up the ball and took the catch on the rebound. Barnes (31) was officially reprimanded for using the hook and eliminated this stroke from his repertoire for the rest of the series. At 72/2 Bradman was still struggling on 28 after an hour at the crease when he gave his famous catch to Jack Ikin off Bill Voce. The England players were so sure it was out (along with half the Australian team in the dressing room) that they did not immediately appeal and did so only after Bradman refused to walk. In a controversial umpiring decision Umpire Borwick gave him not out and Bradman later said he thought he had jammed the ball into the ground before it went to Ikin and that he was willing to let the umpire be the judge. Hammond was furious at what he saw as gamesmanship that only spoke to the Australian captain when calling the toss for the rest of the series. After this incident Bradman recovered his confidence and with Bedser off the field due to a stomach ailment (a legacy of his service in Italy) made 159 runs in 160 minutes. His vice-captain Lindsay Hassett dug himself in for 128 and they added 274 for the third wicket. Hassett's brother was getting married that day and agreed to wait until he was out before they began the service. They gave up when he was 97 and he was still on 98 when they finished. Bradman was bowled by Bill Edrich (3/107) early on the second day and Hassett added another 106 runs with his fellow-Victorian Keith Miller who hit 6 fours and a six in his 79. Hassett also hit a six, but was dropped three times before he was caught by Norman Yardley off Bedser (2/159). The English leg-spinner Doug Wright (5/167) had Miller lbw, but the wicketkeeper Paul Gibb dropped Colin McCool off Bedser for 1 and McCool (95) and Ian Johnson (47) took the score to 595/5 by the end of the second day. Most of the third day was lost to heavy rain and bad light. When play resumed it was thought that Australia would declare, but Bradman gave 'a crooked little smile...\"I remember when England made 900 against us and kept us in the field for three days\"'p. 25, Miller and 10 minutes before play he told Hammond that he was going to bat on. \"Bradman adopted his grim Napoleonic pose, as if the fate of his country rested on the retention of 'the Ashes'\"p. 18, Cary and as the batting captain told the ground staff not to cut the grass on the pitch and had a three-ton roller pulled over the wicket to draw up the moisture.p. 48, Cary Australia would not be batting for long and this increased the pace of the wicket for his fast bowlers, but a former Australian player called it \"kicking a beaten opponent when he is down\".p. 19, Cary The last 5 Australian wickets fell for 50 runs, mostly from Ray Lindwall who hit 3 fours and 2 sixes in his 31. Australia's 645 was their highest total at home, overtaking the 604 made in their previous home Test at Melbourne in 1936–37.pp. 61–62, Swanton", "Bradman made England follow on 504 runs behind, Hutton was caught by Sid Barnes off Miller's first ball, Washbrook was out the same way and Ernie Toshack had Edrich lbw to leave them 32/3. Only Denis Compton (15) stayed in for over an hour and eight batsmen got into double figures. Wally Hammond hit Toshack for two sixes and played so well on the sticky pitch that the Australians thought he was \"bound to make many runs in the series, but from that moment nothing went right for him\".p. 40, Lindwallpp. 169–170, Cary Under Bradman's guidance Toshack took 6/82, Miller missed out on a 10 wicket haul with 2/17 and George Tribe took his best Test figures of 2/48. Ray Lindwall was taken to hospital  with suspected malaria from his service in the Soloman Islands, but was found to be chickenpox which caused more concern as he may have infected the rest of the team.p. 39, Lindwall Lindwall was replaced by twelfth man Ken Meuleman, Colin McCool bowled only one over in the match and Ian Johnson was not used at all. The only real stand was that of 47 between Jack Ikin (32) and Paul Gibb (11) as England were out for 172 having lost 15 wickets in  hours.", "Arriving in Sydney England tried to put the disastrous Brisbane Test behind them. The wicketkeeper-batsman Paul Gibb was dropped in favour of Godfrey Evans, who was to hold the position for 13 years and who did not concede a bye in the Test. Bill Voce had pulled a muscle and the off-spinner Peter Smith was brought into the team for the traditional spinning wicket at the SCG, but already had a numb spinning finger from an injury on the ship that brought the team to Australia. Ray Lindwall was still ill with chickenpox and was replaced by the tidy fast-medium bowler Fred Freer of Victoria. The pitch looked perfect, Wally Hammond called correctly and chose to bat.pp. 61–64, Swanton", "Australia won the Fifth Test by 5 wickets to win the series 3–0 and retain the Ashes. It was the first time that they had played an Ashes series without a Test defeat since Warwick Armstrong's 5–0 win in Australia in 1920–21 and 3–0 win in England in 1921, just after the last war. The full attendance was 93,011 and receipts of £12,619. The total attendance for the Test series was 853,122 with receipts of £115,858. Bradman said that \"The quick resumption of Anglo-Australian Tests had justified itself in every way, psychologically, technically, financially\". Len Hutton was flown home for a throat operation, the injured Paul Gibb, James Langridge, Joe Hardstaff went home by sea with Bill Ferguson and the heavy baggage while the rest of the England team sailed east to play in New Zealand."]}, {"page": "MCC tour of Australia in 1946–47", "response": ["After the game at Northam the MCC preceded to Perth where Yardley led them in a one-day game against the Western Australian Colts, mostly 20-year-olds trying to get into the Western Australian team. The Colts won the toss and put the MCC into bat. Cyril Washbrook made 25 before he was lbw to William Alderman, the father of Terry Alderman. The wicketkeeper Paul Gibb opened with Washbrook as Hammond wanted him to bat at number three in the Tests and made 51, adding 63 for the first wicket. Laurie Fishlock (50) and Norman Yardley (31 not out) added 73 for the fourth wicket and the MCC declared at 197/4. Dick Pollard and Bill Voce had the Colts 7/2, but they recovered, with Wally Langdon making 48 and though wickets fell steadily they survived the day on 138/6.", "The team travelled 160 miles north after the disastrous First Test to play at Gympie. The Queensland Country XI Thomas Allen won the toss and batted. Allen himself top-scored with 53, with Len Johnson making 40 and Herbert Zischke 32. Peter Smith proved useful in another minor game and took 5/80 as the home side were dismissed for 208. The reserve openers Paul Gibb (31) and Laurie Fishlock (62) made an opening stand of 82, Joe Hardstaff stroked his way to 64 and the all rounder James Langridge 42. The local fast bowler Tim Ball took 5/69 and Len Johnson 3/51 as the MCC were out for 282, but the leg-breaks of Don Tallon's brother Bill were hit for 0/73. Back in to bat the Queensland XI made a solid 311/9 with James Cockburn (41), Tim Allen (40), Colin Stribe (75) and Keith Gartell (52 not out) seeing out the draw.", "After the drawn Fourth Test Hammond took the MCC to the famous Victorian gold rush town Ballarat, which was at the start of a post-war boom. The Victorian Country XI batted first and made an impressive 268 even though only Douglas Brown (64) exceeded 40. Bill Voce took 3/28 and Peter Smith 3/70. The local fast bowler Robert McArthur (2/70) soon had Fishlock and Edrich out for ducks and the opener-wicketkeeper Paul Gibb had to fight back with 69. Plummer took 4/68 and the MCC only overtook the Country team by 20 runs thanks to Denis Compton (61) and Godfrey Evans (82). Hammond could not bat due to his fibrosis, which made him unfit for the Fifth Test. Dick Pollard (2/7) took two quick wickets and Smith (2/10) another couple, but the match was drawn with the local team 70/5 at the end of the second day."]}, {"page": "Umpiring in the 1946–47 Ashes series", "response": ["After the Ashes had been retained Fingleton wrote that it would be sporting if the Fast bowlers stopped bouncing Hutton, whose left arm had been badly broken in the war - it had required 46 stitches to repair his arm, which was left two inches (5 cm) shorter and another injury could end his career.p47, Cary It was also thought unsportsmanlike to bowl them at Paul Gibb who wore glasses. It was noted that though Bradman did not tell Lindwall and Miller to stop bowling bouncers in general as a good captain he did not allow them to bowl short at Cyril Washbrook. As well as being a resolute batsman Washbrook had a weakness for cutting the ball outside the off-stump, so that is where Bradman directed his bowlers and he received fewer short balls as a result. Denis Compton and Norman Yardley had weaknesses against the spinners, so Bradman would bring on Ian Johnson and Colin McCool to bowl to them. \"So it was that bumpers were not wanted. They were generally kept for those who had a real hatred for them, while a few additional slammers were indiscriminately thrown in for good measure against all and sundry\".p50, Cary"]}]}}