{"wiki_id": "http://www.wikidata.org/entity/Q6840230", "itemLabel": "Ray East", "itemDescription": "cricketer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_East", "wikipedia_page": {"main": "Raymond Eric East (born 20 June 1947, in Manningtree) is an English former cricketer who played for Essex County Cricket Club.\nOne of the most popular characters to play county cricket in recent times, East is remembered as much for his on field wit as his fine slow left arm spin bowling.  For many years he formed an effective 'spin twin' partnership with David Acfield and helped his Essex teammates break their historic trophy drought to challenge at the top of county and one day cricket.\nHe played 405 matches for Essex from 1965 to 1984 and in 410 matches in all.   He took 1019 wickets at 25.72, with five wickets in an innings 49 times, ten in a match ten times and a career best of 8 for 30. He scored 7178 runs at 17.72 in the lower order, with one hundred (113) and held 256 catches. He took 269 list A one-day wickets at 24.59 with a best of 6–18, although he once went for 79 in 8 overs in a Sunday league match.He often contributed important runs from batting at 9 or 10 and once shared a century partnership with John Lever at Westcliff \nFrom 1984–88 he was captain/manager of Essex 2nd XI and he played for Suffolk in 1991 and 1992 and now coaches cricket at Ipswich School.\nHe was a member of the Derrick Robins XI that toured South Africa in 1973.", "link_mentions": [{"page": "Keith Fletcher", "response": ["Keith William Robert Fletcher  (born 20 May 1944) is an English former first-class cricketer who played for Essex and England. He later became England's team manager. His nickname was \"The Gnome of Essex\", so christened by his Essex teammate, Ray East, because Fletcher's winklepickers had begun to curl up at the toes due to wear.Keith Fletcher. Cricinfo.com"]}, {"page": "International cricket in South Africa from 1971 to 1981", "response": ["*Brian Close (captain); Ray East; John Edrich; Bruce Francis (Australian); John Gleeson (Australian); Graham Johnson; Peter Lee; Graham Roope; John Snow; Roger Tolchard; Bob Woolmer (a South African, who was born in India and played for England)"]}, {"page": "Essex County Cricket Club", "response": ["Along with Gooch, county captain and England batsman Keith Fletcher built a powerful eleven in the late 1970s that dominated domestic cricket from 1979 to 1992, when Essex won six of thirteen County Championship titles. The bowling in the first half of this period was borne by tireless left arm seamer John Lever and spinner and prankster Ray East. The South African Ken McEwan and Fletcher were the best batsmen after Gooch. As Lever declined, England all rounder Derek Pringle and fast bowler Neil Foster took over, whilst John Childs crossed from Gloucestershire to take over as the chief spinner.", "|Ray East || 1,010"]}, {"page": "List of Essex List A cricket records", "response": ["| 8th || 109 ||  Ray East Neil Smith || v Northamptonshire || Chelmsford || 1977", "| 9th || 67 ||  Stuart Turner Ray East|| v Gloucestershire || Chelmsford || 1973", "| 10th || 81 ||  Stuart Turner Ray East || v Yorkshire || Leeds || 1982"]}, {"page": "David Acfield", "response": ["He was part of the successful Essex County Cricket Club team of the late 1970s and early 1980s and formed a noted county spin partnership with Ray East. He was a right-arm off break bowler and right-handed tail-end batsman. He played for Cambridge University from 1966 to 1968 and Essex from 1966 to 1986. He also appeared for MCC in 1973–74 and 1974. He was awarded his Essex cap in 1970 and had his Essex benefit season in 1981."]}, {"page": "Russell Catley", "response": ["Catley was born at Cambridge in May 1973. He was educated at Ely College, before undertaking sixth form studies at Ipswich School. From Ipswich he went up to Loughborough University, before completing his masters studies at the University of Reading. Catley made his debut for Suffolk, then captained by Ray East, in the 1992 Minor Counties Championship against Cumberland. He played Minor counties cricket for Suffolk from 1992 to 2003, which included 63 Minor Counties Championship appearances and 26 MCCA Knockout Trophy appearances. He made his List A debut against Somerset in the 1996 NatWest Trophy. He made eight further List A appearances, the last of which came against Devon in the 1st Round of the 2004 Cheltenham & Gloucester Trophy, which was held in 2003. In his nine List A matches, he scored 152 runs at an average of 16.88, with a high score of 65. This score, which was his only List A half century, came against Buckinghamshire in the 2003 Cheltenham & Gloucester Trophy. Catley is notable for being James Anderson's first competitive wicket, when playing for the Lancashire Cricket Board against Suffolk in the 2000 NatWest Trophy."]}, {"page": "Philip Oliver (cricketer)", "response": ["Oliver made his debut in county cricket for Shropshire in the 1972 Minor Counties Championship against Durham, with Oliver representing the county from 1972 to 1974. It was for Shropshire that he made his List A debut for against Essex in the 1974 Gillette Cup, a match in which he scored 2 runs before being dismissed by Ray East. He later made his first-class debut for Warwickshire against Glamorgan in the 1975 County Championship. A regular over the coming seasons, Oliver played 89 first-class matches for Warwickshire from 1975 to 1982, with his final first-class appearance coming against Yorkshire in the 1982 County Championship. A batting all-rounder, Oliver scored 2,679 runs in 89 first-class appearances, at an average of 24.80. In the process he made 9 fifties and 2 centuries. His highest score, an unbeaten 171, came against Northamptonshire in the 1981 County Championship. It was the 1981 season which was his most successful, with him scoring 554 runs at an average of 50.36. In no other season did he average above 30, although the 1980 season was the season in which he scored his most runs in a season, 772 at an average of 22.57. Used as an occasional bowler, Oliver took 27 wickets at a bowling average of 78.33, with best figures of 2/38."]}, {"page": "East (surname)", "response": ["*Ray East (born 1947), English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Ray East (1973) : R. E. East (Essex)"]}, {"page": "Ralph Dellor", "response": ["* Funny Turn: Confessions of a Cricketing Clown, autobiography of Ray East edited by Dellor, Allen & Unwin, 1984, "]}]}}