{"wiki_id": "http://www.wikidata.org/entity/Q6845991", "itemLabel": "Michael Batty", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Batty", "wikipedia_page": {"main": "Michael Batty CBE, FBA, FRS, FAcSS (born 11 January 1945) is a British urban planner, geographer and spatial data scientist, and Bartlett Professor of Planning in The Bartlett at University College London . He has been Director—now Chairman—of the Centre for Advanced Spatial Analysis, set up when he was appointed to UCL in 1995. His research and the work of CASA is focused on computer models of city systems. He was awarded the William Alonso Prize of the Regional Science Association in 2011 for his book Cities and Complexity, the same prize a second time for his book The New Science of Cities in 2017–2018, the University Consortium GIS Research Award in 2012, and the Lauréat Prix International de Géographie Vautrin Lud, the so-called 'Nobel for geography', in 2013. In 2015, he was awarded the Founder's Medal of the Royal Geographical Society and in 2016, the Gold Medal of the Royal Town Planning Institute (RTPI). He also received the Senior Scholar Award of the Complex Systems Society in September 2016.", "link_mentions": [{"page": "Space syntax", "response": ["Space syntax's mathematical reliability has come under scrutiny because of a seeming paradox that arises under certain geometric configurations with 'axial maps', one of the method's primary representations of spatial configuration. This paradox was proposed by Carlo Ratti at the Massachusetts Institute of Technology, but comprehensively refuted in a passionate academic exchange with Bill Hillier and Alan Penn [2004]. There have been moves to combine space syntax with more traditional transport engineering models, using intersections as nodes and constructing visibility graphs to link them, by researchers including Bin Jiang, Valerio Cutini and Michael Batty. Recently there has also been research development that combines space syntax with geographic accessibility analysis in GIS, such as the place syntax-models developed by the research group Spatial Analysis and Design at the Royal Institute of Technology in Stockholm, Sweden. A series of interdisciplinary works published from 2006 by Vito Latora, Sergio Porta and colleagues, proposing a network approach to street centrality analysis and design, have highlighted Space Syntax' contribution to decades of previous studies in the physics of spatial complex networks."]}, {"page": "The Bartlett", "response": ["In 2011, Fulong Wu was appointed as Bartlett Professor of Planning. There have been a succession of eminent Bartlett Professors of Planning at UCL including Stanley Adshead, Sir Patrick Abercrombie, Lord William Holford, Lord Richard Llewelyn-Davies, Gerald Smart, Sir Peter Hall, Michael Batty and Matthew Carmona, all of whom have been associated with planning and cities in Britain and elsewhere. Sir Patrick Geddes, the father of town planning, studied physiology at the college in the late 1870s.", "The Centre for Advanced Spatial Analysis (CASA) is The Bartlett's research centre for interdisciplinary urban analytics. It was established in 1995 by Professor Michael Batty, who sits as the centre's chairperson. It is currently headed by Dr. Adam Dennett. The Centre specialises in urban informatics, geospatial intelligence, geographic information systems, urban modelling, the application of smart city technology, and complexity science. The centre is originator for OpenStreetMap, Prospective Labs, GeoFutures, and Intelligent Space (acquired by Atkins). Today, the centre works with numerous public administrations, inter-governmental organisations, and private institutions globally to research and address urban issues.", "* Michael Batty CBE FRS FBA"]}, {"page": "Calderstones School", "response": ["*Michael Batty CBE FRS FBA, Bartlett Professor of Planning at University College London"]}, {"page": "Gold Medal (RGS)", "response": ["|Michael Batty"]}]}}