{"wiki_id": "http://www.wikidata.org/entity/Q6847820", "itemLabel": "Mike Martin", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Martin_(character)", "wikipedia_page": {"main": "Mike Martin is the protagonist in two novels, The Fist of God (1994) and The Afghan (2006) by Frederick Forsyth.\nMartin is an Englishman who looks remarkably Arab because his maternal  grandmother (mentioned in the novel as \"Indira Bohse\" - likely to be Indira Bose) was Indian.\nHis father (Nigel Martin) was an accountant in an unnamed English Oil Company and his mother (half-Indian Susan Granger) was an air-stewardess with BOAC.\nHis father was posted in the Middle East and so he (and his brother) grew up in Baghdad, becoming fluent in Arabic and English. After moving to England during a time of great political uncertainty in Iraq, he joined the Paras at the age of 19, and soon became an officer. Later, he was accepted into the Special Air Service.\nIn his late 30s, he was employed by the Secret Intelligence Service during Operation Desert Shield to lead the Kuwaiti resistance disguised as a Bedouin. Shortly after he was sent to run the agent \"Jericho\", along with the CIA, in Baghdad. Upon learning of the location of the Fist of God, he leads the SAS patrol that paints it for an airstrike.\nHe retired from the army after 25 years of service. However, he was called by Secret Intelligence Service and Central Intelligence to infiltrate the Al-Qaeda using his knowledge from the 1980s Mujahideen resistance-assistance to his advantage.\nAfter several months successfully undercover inside Al-Qaeda, he sacrificed his life in order to stop an attack against the ocean liner Queen Mary 2, where the G8 summit was being held.", "link_mentions": [{"page": "The Fist of God", "response": ["Iraq subsequently invades Kuwait, leading the British and Americans to require top-level intelligence on the ground. Major Mike Martin of the Special Air Service is seconded to SIS to collaborate with the Kuwaiti resistance. Not only does Major Martin speak fluent Arabic, but with his black hair and dark complexion, he can practically pass for an Arab. His brother, Terry, an expert in Arab military studies, works with the Medusa Committee, a joint British-American panel investigating Iraq's weapons of mass destruction.", "The CIA does not have any assets deep inside the Iraqi government and the Mossad also initially deny they have any active assets in Iraq. However, they are forced later to admit they have an unidentified top agent, codenamed \"Jericho\", whom they have been paying for information on the Iraqi military and government through an account in Vienna, but from whom they have not heard since the invasion began. Since Israel is forced to stay out of the war to prevent alienating Arab countries in the Coalition, they agree to let the Americans run Jericho, if they can find him. Mike Martin is recalled from Kuwait and sent into Iraq to run Jericho through a series of dead drops while working a cover job as a house gardener for the Soviet Union's First Secretary to the Soviet Embassy in Bagdad."]}, {"page": "Mike Martin", "response": ["Mike Martin may refer to:", "*Mike Martin (baseball coach) (born 1944), former minor league baseball player and former head coach for the Florida State Seminoles", "*Mike Martin Jr. (born 1973), son of the above and current head coach for the Florida State Seminoles", "*Mike Martin (catcher) (born 1958), former baseball catcher for the Chicago Cubs", "*Mike Martin (wide receiver) (born 1960), former wide receiver in NFL", "*Mike Martin (basketball, born 1974), member of the BBL's Guildford Heat", "*Mike Martin (basketball, born 1982), head coach of Brown University men's basketball team", "*Mike Martin (defensive lineman) (born 1990), University of Michigan/Tennessee Titans American football player", "*Mike Martin (Canadian football) (born 1940), Canadian football player", "*Mike Martin (American guitarist) (born 1974), American guitarist, composer & producer", "*Mike Martin (musician), member of All That Remains band", "*Mike Martin (politician) (born 1952), former member of the Texas House of Representatives", "*Mike Martin (character), a fictional SAS officer in Frederick Forsyth's books The Fist of God and The Afghan"]}, {"page": "Mike Martin (SAS-officer)", "response": ["#REDIRECT Mike Martin (character)"]}, {"page": "Mike Martin (fictional character)", "response": ["#REDIRECT Mike Martin (character)"]}]}}