{"wiki_id": "http://www.wikidata.org/entity/Q6848442", "itemLabel": "Mike Poulton", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Poulton", "wikipedia_page": {"main": "Mike Poulton is an English writer, translator and adapter of classic plays for contemporary audiences. He has been Tony nominated for his play 'Fortune's Fool' along with his adaptations of 'Wolf Hall' and 'Bring Up the Bodies'.\nPoulton began his career in 1995 with Anton Chekhov's Uncle Vanya and Ivan Turgenev's Fortune's Fool, which were staged at the Chichester Festival Theatre, the former with Derek Jacobi, the latter with Alan Bates. Bates reprised his role for a 2002 Broadway production that earned Poulton a Tony Award nomination for Best Play.Poulton's subsequent works include Chekov's Three Sisters, The Cherry Orchard,  and The Seagull, Euripides' Ion, Henrik Ibsen's Hedda Gabler and Ghosts, August Strindberg's The Father and Dance of Death.\nHis adaptation of Friedrich von Schiller's Don Carlos was performed at the Chichester and in the West End with Derek Jacobi. Charlotte Loveridge has written, \"Mike Poulton's new translation has superb lucidity and pace. Purging Schiller of any hint of verbosity or bombast, the text is full of deft shifts of register from the boldly poetic to the colloquial. As Posa asks the king, \"You wish to plant a garden that will flower forever./Why do you water it with blood?\" Unafraid to employ vocabulary with contemporary significance, the translation nevertheless does not dogmatically confine the meaning of the play to an exclusively modern interpretation.\"Mary Stuart was performed at Clwyd Theatr Cymru and Wallenstein at  Chichester. Other adaptations include Chaucer's Canterbury Tales for the Royal Shakespeare Company which was presented at the Gielgud Theatre from July to September 2006,  and two plays based on Thomas Malory's Le Morte d'Arthur.\nPoulton's adaptations have been presented by the Royal Shakespeare Company, the Theatre Royal, Plymouth, the Mercury Theatre, Colchester, the Crucible Theatre in Sheffield, the Birmingham Repertory Theatre, on Broadway, in the West End, and even in York Minster.\nPoulton translated Fredrick von Schiller's Kabale und Liebe for a new production called Luise Miller, at the Donmar Warehouse in London, from 8 June to 30 July 2011, starring Felicity Jones.Poulton premiered a new adaptation of Ibsen's When We Dead Awaken at London's The Print Room in 2011. Re-titled Judgement Day, the production was directed by James Dacre and starred Michael Pennington and Penny Downie.\nHis adaptation of Turgenev's Fortune's Fool was revived in the West End at The Old Vic in December 2013. The production was directed by Lucy Bailey and starred Iain Glen (later replaced by Patrick Cremin and Will Houston) and Richard McCabe.His adaptation of Charles Dickens' A Tale of Two Cities premieres at the Royal & Derngate in Northampton in February 2014. It features original music by Rachel Portman and is directed by James Dacre in his first in-house production since becoming those theatres' artistic director in July 2013.\nPoulton's adaptations of Hilary Mantel's historical novels Wolf Hall and Bring Up The Bodies for the Royal Shakespeare Company premièred at the Swan Theatre in Stratford-upon-Avon in January 2014, at the Aldwych Theatre in London in May 2014 and at Broadway's Winter Garden Theatre in March 2015. His Kenny Morgan, a biographical play about Terence Rattigan, premiered at the Arcola Theatre from 18 May to 18 June 2016, whilst his adaptation of the York Mystery Plays premiered at York Minster in May and June the same year.Poulton's most recent adaptation is Imperium, drawn from Robert Harris' Cicero trilogy  - it was played by the Royal Shakespeare Company from November 2017 to February 2018.", "link_mentions": [{"page": "Jane Seymour", "response": ["* Jane Seymour is portrayed in the stage adaptation of Hilary Mantel's Wolf Hall parts I and II, adapted by Mike Poulton. It was presented by the Royal Shakespeare Company in London's West End (2014) and on Broadway (2015)."]}, {"page": "Thomas Cromwell", "response": ["*In 2014 the Royal Shakespeare Company staged an adaptation by Mike Poulton of Dame Hilary Mantel's first two Cromwell novels. The role of Cromwell was played by Ben Miles, who repeated his portrayal of Cromwell when the production of Wolf Hall parts I and II moved to Broadway in March 2015  where he earned a Tony Award nomination for his work."]}, {"page": "Friedrich Schiller", "response": ["* Don Karlos, Infant von Spanien (Don Carlos),Mike Poulton translated this play in 2004. 1787"]}, {"page": "Royal Shakespeare Company", "response": ["* Wolf Hall based on the two novels by Hilary Mantel, adapted for the stage by Mike Poulton, directed by Jeremy Herrin, produced in London's West End and on Broadway (2015).", "* Imperium (play cycle): Conspirator and Imperium: Dictator adapted from Robert Harris' trilogy by Mike Poulton, with Richard McCabe as Marcus Tullius Cicero and Peter De Jersey as Gaius Julius Caesar (2017, Stratford Season) (2018, London Transfer)."]}, {"page": "Tony Award for Best Play", "response": ["| Mike Poulton", "| Hilary Mantel & Mike Poulton", "| Mike Poulton"]}, {"page": "The Old Vic", "response": ["* Fortune's Fool by Ivan Turgenev in a version by Mike Poulton, directed by Lucy Bailey, starring Richard McCabe"]}, {"page": "Gielgud Theatre", "response": ["*2018: Imperium, based on the Cicero novels by Robert Harris and adapted by Mike Poulton starring Richard McCabe and Joseph Kloska"]}, {"page": "Almeida Theatre", "response": ["* Rosmersholm by Henrik Ibsen, adapted by Mike Poulton, directed by Anthony Page, starring Helen McCrory (2008)"]}, {"page": "Michael Pennington", "response": ["* The Syndicate (Dr Fabio) by Eduardo di Filippo, adapted by Mike Poulton, directed by Sean Mathias, Chichester Festival Theatre 2011", "* Judgement Day by Henrik Ibsen, adapted by Mike Poulton, directed by James Dacre, The Print Room 2011"]}, {"page": "Poulton", "response": ["* Mike Poulton, English translator"]}, {"page": "Ion (play)", "response": ["* Mike Poulton, 2004"]}, {"page": "A Tale of Two Cities", "response": ["* Royal & Derngate Theatre produced an adaptation by Mike Poulton with original music by Rachel Portman, directed by James Dacre."]}, {"page": "Forbes Masson", "response": ["Masson is an Artistic Associate with the RSC and was in the Royal Shakespeare Company acting ensemble from 2003 to 2011. His roles included Horatio to Toby Stephens' Hamlet in 2004, and Feste in Twelfth Night in 2005. Both productions were directed by then RSC Artistic Director Michael Boyd. He also played Porter in Dominic Cooke's Macbeth and Dromio of Ephesus in Nancy Meckler's Comedy of Errors. He played Judas in Pilate Project. He performed in Boyd's critically acclaimed Histories cycle in Stratford-Upon-Avon and at The Roundhouse, Camden, in 2006–2008. His roles in the cycle included Bagot in Richard II, Rumour in Henry IV, Part Two, Chorus in Henry V and King Edward IV in Henry VI and Richard III. In 2009 he played Samson in Boyd's production of The Grain Store. He played Romeo opposite Kathryn Hunter's Juliet in Ben Power's adaptation of Romeo and Juliet called Tender Thing. He played Merlin in Greg Doran's production of Mike Poulton's Morte d'Arthur. He played Gena in Ahasverus as directed by Michael Fentiman, at the Hampstead Theatre. He later appeared as Jacques in Boyd's As You Like It, and Friar Lawrence in Rupert Goold's production of Romeo and Juliet. Both plays came to the Roundhouse in Camden in late 2010. They played Park Avenue Armory in New York in summer 2011."]}, {"page": "Felicity Jones", "response": ["She appeared alongside Gossip Girl actor Ed Westwick in Chalet Girl, a romantic comedy released in March 2011, for which she had to undergo two months of snowboarding training and work undercover in a chalet at St Anton, scrubbing toilets and partying at the Krazy Kanguruh bar in preparation for the role. Jones said that the role was \"something of a relief\" after a string of costume roles and she was also keen to take on a comic role. Jones performed in Luise Miller, a new translation of Schiller's Kabale und Liebe by Mike Poulton at the Donmar Warehouse theatre in London, in June and July 2011. Jones lived with a Catholic family and attended Mass to prepare for the role. In 2011, Jones was announced as the new face of Burberry. In November, she was also announced as the new face of Dolce & Gabbana."]}, {"page": "Don Carlos (play)", "response": ["* Review of a 2004 production in Sheffield, England of Mike Poulton's adaptation from the German, along with an extended discussion of play's history."]}, {"page": "Intrigue and Love", "response": ["The first English translation was released in 1795, and a French version followed in 1799. Modern English translations include Love and Politics by Christopher Webber (London, Riverside Studios, 1989), Intrigue/Love by Daniel Millar and Mark Leipacher (London, Southwark Playhouse, 2010) and Luise Miller by Mike Poulton (London, Donmar Warehouse, 8 June to 30 July 2011)"]}, {"page": "Imperium (Harris novel)", "response": ["A theatrical adaptation of the trilogy by Mike Poulton was performed by the Royal Shakespeare Company in the Swan Theatre, Stratford-upon-Avon in 2017, and transferred to the Gielgud Theatre in London in 2018. The two plays were directed by RSC Artistic Director Gregory Doran, with Richard McCabe as Cicero."]}, {"page": "York Mystery Plays", "response": ["In 2000 a large-scale performance was staged in York Minster, as The York Millennium Mystery Plays, directed by Gregory Doran, with a script adapted by Mike Poulton. With Ray Stevenson in the role of Christ and Rory Mulvihill (Jesus in 1996) as Satan, the production was the most expensive and wide-reaching project in the history of the plays' modern revival. The first half began in heaven with the story of the fall of Lucifer, followed by the creation of the world, the fall of Adam and Eve, Noah's Ark (with impressive and memorable representations of the animals and the flood) and the story of Abraham and Isaac. From the New Testament there came the annunciation and nativity of Jesus, the massacre of the innocents, Christ's childhood, baptism, temptation and ministry, and his entrance into Jerusalem on Palm Sunday. The second half concentrated on the capture and trial of Christ, and his crucifixion, resurrection and ascension. The production ended, as is traditional, with the Last Judgement.York Millennium Mystery Plays: Programme", "In 2016 the plays were performed in York Minster from 26 May, the feast of Corpus Christi, until 30 June. The director, Phillip Breen, had previously directed for the Royal Shakespeare Company. The production featured a large step set by designers Max Jones and Ruth Hall, that was dissected by a thin gauze that reached to the vaulted ceiling, which was utilised as a projection screen by projection designer Douglas O'Connell.  Writer Mike Poulton and composer Richard Shephard repeated their millennium production roles. The cast had about 150 amateur actors and the sole professional, Philip McGinley, played Jesus except for the last four performances, when,  owing to his sudden illness, the role was taken by his understudy Toby Gordon who had, up to then, played Satan. This caused a cascade of understudying which was superbly handled by a committed cast. It also elevated Toby Gordon into the ‘Crew of Two’ with Rory Mulvihill as the only actors in the history of the plays to have played both Jesus and Satan."]}, {"page": "Fortune's Fool", "response": ["A century and a half after it was written in 1848, Fortune's Fool was staged on Broadway for the first time in an adaptation by Mike Poulton. After 28 previews, the production opened on April 2, 2002 at the Music Box Theatre, where it ran for 127 performances. The cast, under the direction of Arthur Penn, included Alan Bates (who had starred in a production staged at the Chichester Festival Theatre with Ashley Artus, Desmond Barrit, Rachel Pickup, and John Bardon) and the Theatre Royal in Bath in 1996), Frank Langella, Benedick Bates (Alan's son), and Enid Graham.", "From 6 December 2013 Mike Poulton's adaptation of Fortune's Fool starring Iain Glen (later replaced by Patrick Cremin and Will Houston) and Richard McCabe and directed by Lucy Bailey received its West End premiere at The Old Vic. The cast includes Lucy Briggs-Owen, Dyfan Dwyfor, Janet Fullerlove, Paul Ham, Richard Henders, Simon Markey and Alexander Vlahos."]}, {"page": "Stratford Shakespeare Festival production history", "response": ["*Wolf Hall – by Hilary Mantel, adapted for the stage by Mike Poulton"]}, {"page": "Thelma Holt", "response": ["* The Canterbury Tales by Geoffrey Chaucer, a new adaptation in two parts by Mike Poulton. An RSC production of an RSC Commission directed by Gregory Doran, Rebecca Gatward & Jonathan Munby. Presented at the Gielgud Theatre in association with Bill Kenwright.", "* The English Samurai by Mike Poulton & Shoichiro Kawai directed by Gregory Doran. In association with HoriPro Inc. at the Galaxy Theatre, Tokyo.", "* Anjin – The Shogun & The English Samurai by Mike Poulton and Sho Kawai, directed by Gregory Doran. Produced in association with HoriPro Inc. in Japan and at Sadlers Wells Theatre.", "* Imperium by Robert Harris, adapted by Mike Poulton, directed by Gregory Doran, Royal Shakespeare Company production with Playful Productions Ltd. at the Gielgud Theatre "]}, {"page": "56th Tony Awards", "response": ["** Fortune's Fool – Mike Poulton"]}, {"page": "Chichester Festival production history", "response": ["*The Syndicate by Eduardo De Filippo, in a new version by Mike Poulton"]}, {"page": "Cultural depictions of Henry VIII", "response": ["*Mike Poulton: Wolf Hall and Bring Up the Bodies (aka Wolf Hall Parts One & Two), originally played by Nathaniel Parker "]}, {"page": "Laurence Olivier Award for Best New Play", "response": ["| Hilary Mantel and Mike Poulton"]}, {"page": "Laurence Olivier Award for Best Revival", "response": ["| Friedrich Schiller and Mike Poulton"]}, {"page": "John Ramm", "response": ["On stage, he has appeared with the Royal Shakespeare Company in their 2004 Lope de Vega season, at the Chichester Festival Theatre, in a 2008 production of Ring Round the Moon at the Playhouse Theatre London, as Dogberry in Much Ado About Nothing in 2011, in the 2013 play The Low Road,John Ramm Bio Chichester Festival Theatre and as Thomas More and Henry Norris in Mike Poulton's 2014-2015 stage adaptions of Wolf Hall and Bring Up The Bodies respectively.Full casting announced for RSC's Wolf Hall and Bring Up the Bodies What's On Stage In 2016 he performed at the Orange Tree Theatre in Sheppey for which he received The Offie (Off West End Theatre Award) for Best Male Performance."]}, {"page": "Paul Keating (actor)", "response": ["2004/5 saw Keating playing Prince of Palma in Don Carlos by Frederick Schiller in a new version by Mike Poulton directed by Michael Grandage at The Crucible Theatre Sheffield and Gielgud Theatre, London.", "In 2016 Keating enjoyed critical acclaim for his portrayal of the title role in Mike Poulton's new play Kenny Morgan directed by Lucy Bailey. Inspired by Terence Rattigan's The Deep Blue Sea, the play is based on the real life events that inspired Rattigan to pen The Deep Blue Sea, focusing on Rattigan's relationship with younger actor, Kenny Morgan. The play enjoyed two runs at The Arcola Theatre in East London, when Keating was shortlisted as one of four actors for Best Male performance at The Offies 2017 . Lucy Bailey was also nominated - as Best Director. He was awarded 'Stage Performance Of The Year' at The Attitude awards by Attitude (magazine)."]}, {"page": "Rachel Pickup", "response": ["Before graduating from RADA, Pickup won a leading role in the BBC series No Bananas, her first professional engagement. This was followed by a role opposite Alan Bates in Mike Poulton's Fortune's Fool. Other major theatre roles followed, including Irina in Mike Poulton's translation of Three Sisters for Bill Bryden, Olivia in Twelfth Night for Terry Hands, Helena in All's Well That Ends Well for Irina Brook, Portia in Julius Caesar for David Farr at the RSC, Sylvia in The Two Gentlemen of Verona and Helena in A Midsummer Night's Dream also for the RSC."]}, {"page": "Wallenstein (trilogy of plays)", "response": ["*A single-play condensed translation by Mike Poulton, directed by Angus Jackson and with Iain Glen in the title role, was staged at the Minerva Theatre in Chichester from 22 May to 13 June 2009."]}, {"page": "Wolf Hall", "response": ["In January 2013, the Royal Shakespeare Company (RSC) announced it would stage adaptations by Mike Poulton of Wolf Hall and Bring Up the Bodies  in its Winter season. The production transferred to London's Aldwych Theatre in May 2014, for a limited run until October."]}, {"page": "Lustrum (novel)", "response": ["The novel was shortlisted for the 2010 Walter Scott Prize.\"Mantel's Wolf Hall wins inaugural Walter Scott Prize for historical novels\", Scotsman.com, 20 June 2010\"Booker rivals clash again on Walter Scott prize shortlist\", The Guardian, 2 Apr 2010 It and the other novels in the trilogy were also adapted for the stage in 2017 by Mike Poulton."]}, {"page": "Mercury Theatre, Colchester", "response": ["Productions at the Mercury have included the work of John Cleese, Martin Clunes, Gwen Taylor, Simon Gray, Toby Longworth, Ingrid Lacey, Michael Grandage, Mike Poulton, Michael Deacon, Colin McCormack, David Oakes, Donald Freed"]}, {"page": "Royal & Derngate", "response": ["Other recent highlights have included the premiere of Nicholas Wright's adaptation of Pat Barker's novel Regeneration, in a co-production with Touring Consortium Theatre Company in 2014. It also premiered Mike Poulton’s adaptation of A Tale of Two Cities.", "|A Tale of Two Cities adapted by Mike Poulton with music by Rachel Portman", "|A Tale of Two Cities, adapted by Mike Poulton"]}, {"page": "James Dacre", "response": ["* Premiere of A Tale of Two Cities adapted by Mike Poulton, composed by Rachel Portman, (Royal & Derngate and UK Tour) 2014 TMA nomination for Best Design Team. ", "* Premiere of Judgement Day by Mike Poulton, after When We Dead Awaken by Henrik Ibsen (The Print Room), Ian Charleson Best Actress Commendation"]}, {"page": "Bring Up the Bodies", "response": ["In January 2014, the Royal Shakespeare Company (RSC) staged a two-part adaptation of both Wolf Hall and Bring Up the Bodies in its winter season, with a script by Mantel and Mike Poulton. Premiering at the Swan Theatre, Stratford-upon-Avon, it transferred to the Aldwych Theatre, London, later that year."]}, {"page": "Alexander Vlahos", "response": ["From 6 December 2013, Vlahos appeared in Fortune's Fool at The Old Vic. Mike Poulton's adaptation of Turgenev's play was directed by Lucy Bailey, in a new production which stars Iain Glen and Richard McCabe."]}, {"page": "Coronet Theatre, London", "response": ["* Judgement Day by Mike Poulton, a new version of Henrik Ibsen's When We Dead Awaken (16 November – 17 December 2011)", "* Uncle Vanya by Anton Chekhov in a new version by Mike Poulton (21 March – 28 April, and extended 18 June – 7 July 2012)"]}, {"page": "69th Tony Awards", "response": ["** Wolf Hall Parts One & Two – Mike Poulton"]}, {"page": "2015 Laurence Olivier Awards", "response": ["** Wolf Hall / Bring up the Bodies by Hilary Mantel, adapted by Mike Poulton – Aldwych"]}, {"page": "Dictator (Harris novel)", "response": ["In Harris's summary: \"Thus Imperium describes the rise to power, Lustrum the years in power and Dictator the repercussions of power.\" All three novels were adapted for the stage in 2017 by Mike Poulton."]}, {"page": "Wolf Hall Parts One & Two", "response": ["Wolf Hall Parts One & Two (originally titled Wolf Hall & Bring Up The Bodies) is a two-part play based on Hilary Mantel's novels Wolf Hall and Bring Up the Bodies, adapted for the stage by Mike Poulton. Set in the period from 1500 to 1535, Wolf Hall is a sympathetic fictionalised biography documenting the rapid rise to power of Thomas Cromwell in the court of Henry VIII through to the death of Sir Thomas More. ", "In January 2013, the Royal Shakespeare Company (RSC) announced that it would stage adaptations by Mike Poulton of Wolf Hall and Bring Up the Bodies in its Winter season in the Swan Theatre, Stratford-upon-Avon beginning previews from 11 December 2013, with press performances on 8 January 2014, running until to 29 March. The production transferred to London's Aldwych Theatre from 1 May 2014, for a limited run until 4 October (extended from 6 September due to popular demand)."]}]}}