{"wiki_id": "http://www.wikidata.org/entity/Q6847134", "itemLabel": "Mike Harding", "itemDescription": "British musician and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Harding", "wikipedia_page": {"main": "Mike Harding (born 23 October 1944) is an English singer, songwriter, comedian, author, poet, broadcaster and multi-instrumentalist. Harding has also been a photographer, traveller, filmmaker and playwright.", "link_mentions": [{"page": "List of comedians", "response": ["* Mike Harding (born 1944)"]}, {"page": "John Martyn", "response": ["Mike Harding introduced an hour-long tribute to Martyn in his BBC Radio 2 programme on 25 February 2009. A tribute album, Johnny Boy Would Love This, was released on 15 August 2011, comprising cover versions of his songs by various artists."]}, {"page": "October 23", "response": ["*1944 – Mike Harding, English singer-songwriter and comedian"]}, {"page": "Lancashire", "response": ["A local pioneer of folk song collection in the first half of the 19th century was Shakespearean scholar James Orchard Halliwell,E. D. Gregory, Victorian Songhunters: the Recovery and Editing of English Vernacular Ballads and Folk Lyrics, 1820–1883 (Lanham, MD: Scarecrow, 2006), , p. 248. but it was not until the second folk revival in the 20th century that the full range of song from the county, including industrial folk song, began to gain attention. The county produced one of the major figures of the revival in Ewan MacColl, but also a local champion in Harry Boardman, who from 1965 onwards probably did more than anyone to popularise and record the folk song of the county.Folk North West, , retrieved 16 February 2009. Perhaps the most influential folk artists to emerge from the region in the late 20th century were Liverpool folk group The Spinners, and from Manchester folk troubadour Roy Harper and musician, comedian and broadcaster Mike Harding.J, C. Falstaff, 'Roy Harper Longest Running Underground Act', Dirty Linen, 50 (Feb/Mar '94), http://www.dirtylinen.com/feature/50harper.html , 16 February 2009.S. Broughton, M. Ellingham and R. Trillo, World Music: Africa, Europe and the Middle East (Rough Guides, 1999), , p. 67. The region is home to numerous folk clubs, many of them catering to Irish and Scottish folk music. Regular folk festivals include the Fylde Folk Festival at Fleetwood.'Festivals', Folk and Roots, , retrieved 8 January 2009."]}, {"page": "I'm Sorry I Haven't a Clue", "response": ["* Mike Harding (1984, 1986)"]}, {"page": "List of British comedians", "response": ["*Mike Harding (born 1944)", "*Mike Harding (born 1944)"]}, {"page": "Eva Cassidy", "response": ["Two years after her death, Cassidy's music was brought to the attention of British audiences, when her versions of \"Fields of Gold\" and \"Over the Rainbow\" were played by Mike Harding and Terry Wogan on BBC Radio 2. Following the overwhelming response, a camcorder recording of \"Over the Rainbow\", taken at Blues Alley in Washington by her friend Bryan McCulley, was shown on BBC Two's Top of the Pops 2. Shortly afterwards, the compilation album Songbird climbed to the top of the UK Albums Chart, almost three years after its initial release. The chart success in the United Kingdom and Ireland led to increased recognition worldwide. Her posthumously released recordings, including three number-one albums and one number-one single in the UK, have sold more than ten million copies. Her music has also charted within the top 10 in Australia, Germany, Norway, Sweden and Switzerland."]}, {"page": "Fairport Convention", "response": ["The band's first official YouTube video appeared in April 2008. Edited from footage shot for the DVD, the nine-minute mini-documentary includes interviews with Lulu, Jools Holland, Seth Lakeman, Mike Harding, Geoff Hughes and Frank Skinner."]}, {"page": "Ralph McTell", "response": ["During 1983, McTell presented his own music series on BBC Radio 2. His guests included Billy Connolly, Georgie Fame, Simon Nicol with Dave Swarbrick, and Mike Harding."]}, {"page": "Blackpool", "response": ["Folk songs written about the town include The Houghton Weavers anthem \"The Blackpool Belle\" (\"Oh the Blackpool Belle was a getaway train that went from Northern stations. What a beautiful sight on a Saturday night bound for the illuminations\"), Jasper Carrot's \"Day Trip To Blackpool\" (\"Didn't we have a miserable time the day we went to Blackpool? An 'orrible day, we got drunk on the way And spent our money on chips and bingo...\") and Mike Harding's single \"Talking Blackpool Blues\" (\"Well my Mam and Dad and Gran and me / We went to Blackpool by sea / It rained and rained for most of the day / But we all got tanned in a funny sort of way\")."]}, {"page": "Castlefield", "response": ["Most of the buildings have now either been renovated or restored and many have been converted into modern apartments (warehouse flats). Numerous archaeological digs have taken place and revealed a great deal about the early history of the city. Manchester City Council have recently encouraged high quality new developments to accompany the converted warehouses and enhance the conservation area. However, key sites remain to be completed, and Ian Simpson's proposals for a massive eight-storey block of apartments at Jackson's Wharf, has twice been rejected by the City Council reflecting vociferous local objections. For instance, the entertainer Mike Harding said:"]}, {"page": "Roy Harper (singer)", "response": ["The concert was recorded on video and released on DVD as Classic Rock Legends: Roy Harper – Live in Concert at Metropolis Studios.Classic Rock Legends: Roy Harper (DVD 2011) Amazon.co.uk Retrieved on 8 August 2011 The package also contains an audio CD of the concert. Through the summer of 2011, Harper made a number of appearances on broadcast media. On 24 July 2011, Harper appeared as the lunchtime guest on the British cricketing radio programme, Test Match Special. During the show Harper was interviewed and also performed \"When an Old Cricketer Leaves the Crease\". A televised interview followed on BBC Breakfast on 19 September 2011, and Harper was also interviewed by Robert Elms on his BBC London 94.9 show on 20 September 2011. During the show, Harper performed \"Another Day\" (a song from his 1970 album Flat Baroque and Berserk) live in the studio. A further interview took place on Mike Harding's BBC Radio 2 show on 21 September 2011."]}, {"page": "Pennine Way", "response": ["Barry Pilton's book One Man and His Bog gives a more lighthearted and personal account of completing the Pennine Way, with a foreword by Mike Harding. Mark Wallington's book Pennine Walkies (in which the author is accompanied by his dog) is another humorous personal story of the walk, as is Walking Home by Yorkshire poet Simon Armitage, who walked north-to-south along the Pennine Way without money, relying on his 'earnings' from nightly poetry readings along the way. Movement artists Tamara Ashley and Simone Kenyon performed the entire length of the trail in August 2006; their book documents the performance and invites readers to create their own interpretations of the landscapes along the way."]}, {"page": "Green Man", "response": ["In his A Little Book of The Green Man, as well as his website, Mike Harding gives examples of green man figures from Lebanon and Iraq dated to the 2nd century. Similar figures exist in Borneo, Nepal, and India.", "Parallels have been drawn between the Green Man and various deities, including the British Celtic Lud, also known as Nodens; Osiris, Odin, Dionysus, and even Jesus.Harding, Mike, A Little Book of the Green Man, photography by Mike Harding, Aurum Press, London, 1989 p. 12 Father Christmas, who was often shown wreathed in ivy in early depictions, has been suggested as a similar woodland spirit."]}, {"page": "Danger Mouse (1981 TV series)", "response": ["The show was created by Mark Hall and Brian Cosgrove for their production company, Cosgrove Hall Films. Danger Mouse was based on Patrick McGoohan's lead role in Danger Man. The show was intended to have a more serious tone as seen in the pilot episode but Mike Harding (who wrote the music for the show) gave Brian Cosgrove and Mark Hall the idea to make the series silly. \"The characters had got stuck in reality and were doing James Bond type things rooted in the solid real world,\" said Harding, \"I argued that once you invented a Mouse Secret Agent then all of creation and a good chunk of not creation was his oyster. In other words we could be as barmy (crazy) as we wanted.\" In an interview with The Guardian, Cosgrove said \"We reckoned a secret service mouse foiling the plans of an evil toad – Baron Silas Greenback – was suitably ridiculous.\""]}, {"page": "Count Duckula", "response": ["*Theme song vocalists were Doreen Edwards and Mike Harding"]}, {"page": "Crumpsall", "response": ["The folk singer, comedian and broadcaster Mike Harding, was born in the area in 1944.Mike Harding Biography Retrieved 13-02.2010"]}, {"page": "Tony Capstick", "response": ["A regular performer on the folk circuit, he recorded many albums. The first was for the Newcastle based record label Rubber Records (His Round with Hedgehog Pie, Punch and Judy Man, Tony Capstick Does a Turn, Songs of Ewan MacColl with Dick Gaughan and Dave Burland and There Was This Bloke with Mike Harding, Derek Brimstone and Bill Barclay). In 1981, he unexpectedly reached No. 3 in the UK Singles Chart with \"The Sheffield Grinder\" / \"Capstick Comes Home\". It was recorded with the Carlton Main Frickley Colliery Band. His recitation, \"Capstick Comes Home\", was based on the well-known Hovis wholemeal bread television commercials directed by Ridley Scott. \"Capstick Comes Home\" also peaked at number 92 in Australia in July 1981."]}, {"page": "Settle, North Yorkshire", "response": ["*Mike Harding (born 1944), singer and comedian"]}, {"page": "English folk music", "response": ["The difficulty of gaining regular appearances on television in England has long meant that radio has remained the major popular medium for increasing awareness of the genre. The EFDSS sponsored the BBC Home Service radio program, As I Roved Out, based on field recordings made by Peter Kennedy and Séamus Ennis from 1952 to 1958, which probably did more than any other single factor to introduce the general population to British folk music in the period.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford: Oxford University Press, 2005), p. 119. Also important were occasional radio shows, such as Lomax's Ballads and Blues (1951),Lifton, Sarah (1983) The Listener's Guide to Folk Music. Poole: Blandford Press; p. 9 MacColl's Radio-ballads (1958–64) and The Song Carriers (1968). John Peel frequently included folk music of his Top Gear show on Radio One from 1968, but dropped it when punk arrived in the 1970s. The most consistent source of folk music on radio, has been BBC Radio 2. In 1967 \"My Kind of folk\" was broadcast on Wednesdays. In 1970 \"Folk on Friday\" began, presented by Jim Lloyd. In 1972 it became \"Folk on Sunday\".S. Street, A Concise History of British Radio, 1922–2002 (Tiverton: Kelly Publications, 2002), p. 129. \"Folkweave\" was presented by Tony Capstick 1975–8. \"Folk on Two\" (Wednesdays) began in 1980. In 1998 Jim Lloyd retired from the programme and was replaced by Mike Harding. In 2007 it was renamed \"The Mike Harding Folk Show\". In October 2012 it was announced that Mike Harding would be leaving the programme to be replaced by Mark Radcliffe.BBC Press release http://www.bbc.co.uk/mediacentre/latestnews/2012/mark-radcliffe-adds-folk-to-radio-2-roster.html, retrieved 18/10/2012. Ian A. Anderson, editor of \"fRoots\", also presented the occasional series for Radio Two. He hosted a World music programme on \"Jazz FM\" and then spent 10 years broadcasting on the BBC World Service. He currently hosts \"fRoots Radio\" on the web.fRoots radio, http://www.frootsmag.com/radio/ fRoots radio, retrieved 17/02/09. For over twenty years, until 2006, Charlie Gillett presented World music on BBC London.", "Although relatively neglected in the first folk revival North West England had a rich tradition of balladry stretching back at least to the 17th century and sharing in the tradition of Border ballads, including perhaps the finest ‘The Ballad of Chevy Chase', thought to have been composed by the Lancashire-born sixteenth century minstrel Richard Sheale. Lancashire in particular was a common location for folk songs, including ‘The Lancashire Miller’, ‘Warrington Ale’ and ‘The soldier’s farewell to Manchester’, beside several local Wassailing songs.D. Gregory, ‘“The Songs of the People for Me’’: The Victorian Rediscovery of Lancashire Vernacular Song’, Canadian Folk Music/Musique folklorique canadienne, 40 (2006), pp. 12–21. With a variety of dialects and acting as something of a crossroads for the cultures and immigrants of England, Scotland and Ireland, there is a distinctive local character to folk music, which expressed itself in local enthusiasm that emerged as a major factor within the wider folk movement in the second revival. The key event in the history of folk music in the counties of the north west of England was the Industrial Revolution, which divided the region economically and culturally into a northern, often highland and pastoral region, in Westmorland and Cumberland and a more urbanised and industrialised southern zone with large and growing conurbations like Manchester and Liverpool, where changing social and economic patterns emerged in new traditions and styles of folk song, often linked to migration and patterns of work, these included processional dances, often associated with rushbearing and the Wakes Week festivities and types of step dance, most famously clog dancing.Lancashire Folk, http://www.lancashirefolk.co.uk/Morris_Information.htm , retrieved 16/02/09. These were very different from the styles of dance that collectors like Cecil Sharp had encountered in the Cotswolds and were largely dismissed by him as contaminated by urbanisation, yet they were, and remain, a thriving tradition of music and dance. A local pioneer of folk song collection in the first half of the 19th century in Lancashire was Shakespearian scholar James Orchard Halliwell, and he was followed a little later by John Harland, William E. Axon, Thomas T. Wilkinson and Sidney Gilpin, who performed a similar service for Cumberland.J. O. Halliwell, ed., Palatine Anthology: A Collection of Ancient Poems and Ballads Relating to Lancashire and Cheshire (London: Halliwell,1850) and his Palatine Garland, being a Selection of Ballads and Fragments Supplementary to the Palatine Anthology (London: Halliwell. 1850); J. Harland, ed., Ballads and Songs of Lancashire, Chiefly Older than the Nineteenth Century (London: Whittaker & Co., 1865. 2nd edn: London: 1875); William E. A. Axon, Folk Song and Folk-Speech of Lancashire: On the Ballads and Songs of the County Palatine, With Notes on the Dialect in which Many of them are Written, and an Appendix on Lancashire Folk-Lore (Manchester: Tubbs & Brook, 1887); John Harland & Thomas Turner Wilkinson, Lancashire Folk-lore (London: F. Warne, 1867); S. Gilpin, The Songs and Ballads of Cumberland and the Lake Country, with Biographical Sketches, Notes, and Glossary (2nd ed. 3 vols. London, 1874). Most of these works, although important in unearthing, and in some cases preserving, locally relevant ballads, largely depended on manuscript sources, rather than oral collection and often did not give tunes, but only lyrics. It was not until the second folk revival that the full range of song from the region began to gain attention. The region not only produced one of the major figures of the revival in Ewan MacColl but also a local champion in Harry Boardman, who from 1965 onwards probably did more than anyone to popularise and record the industrial folk song of the region, in several albums and books.Folk North West, , retrieved 16/02/09. The region produced no significant bands in the folk rock movement of the 1970s but can claim one of the most significant figures, as Maddy Prior was brought up in Blackpool. However, perhaps the most influential folk artists to emerge from the region in this period were folk troubadour Roy Harper and comedian and broadcaster Mike Harding.J, C. Falstaff, ‘Roy Harper Longest Running Underground Act’, Dirty Linen, 50 (Feb/Mar '94), http://www.dirtylinen.com/feature/50harper.html , 16/02/09 and Mike Harding, official website, http://www.mikeharding.co.uk/, retrieved 16/02/09. More recently it has produced some significant performers including guitarist Ken Nicol and mother and daughter singer songwriters Chris and Kellie While.WhileandMatthews official website , retrieved 08/01/09. The region is home to numerous folk clubs, many of them catering to Irish and Scots folk. Folk festivals include the Fylde Folk Festival at Fleetwood in Lancashire.'Festivals', Folk and Roots, , retrieved 08/01/09."]}, {"page": "Eric Bogle", "response": ["Many of Bogle's songs have been covered by other artists; including John Schumann, The Skids, June Tabor, The Men They Couldn't Hang, The Clancy Brothers, The Dubliners, John McDermott, Liam Clancy, Mike Harding, The Pogues, De Dannan, Dropkick Murphys, The Corries, Billy Bragg, The Bushwackers, Slim Dusty, Mary Black, The Fureys and John Williamson. In May 2001 the Australasian Performing Right Association (APRA), as part of its 75th Anniversary celebrations, named his song, \"And the Band Played Waltzing Matilda\", as one of the Top 30 Australian songs of all time."]}, {"page": "Les Barker", "response": ["Five \"Guide Cats\" albums have been produced, Guide Cats for the Blind, Missing Persians File, Top Cat, White Tie and Tails, Cat Nav and Herding Cats. The CDs contain performances of Barker's poems by members of the folk world such as June Tabor, Martin Carthy, Steve Tilston, Mike Harding and Tom Paxton and well known figures including Jimmy Young, Nicholas Parsons, Brian Perkins, Terry Wogan, Nicky Campbell, Robert Lindsay, Prunella Scales and Andrew Sachs."]}, {"page": "Mark Radcliffe (radio broadcaster)", "response": ["In spring 2011, his show with Maconie moved to BBC Radio 6 Music, in the weekday afternoon slot. Radcliffe also presented his own weekly solo show on BBC Radio 2, called Mark Radcliffe's Music Club, and in 2013 he took over the presentation of BBC Radio 2's weekly folk programme from Mike Harding. His weekday afternoon show with Maconie was moved on 21 December 2018 to the weekends while he was undergoing treatment for cancer. Maconie had broadcast solo while Radcliffe was away for treatment, but Radcliffe joined Maconie for the last hour of the weekday show. He rang in at home on the first weekend breakfast show on 12 January 2019, and then he rejoined Maconie on a permanent basis from 2 February 2019 and Radcliffe also rejoined to BBC Radio 2 on 13 February 2019."]}, {"page": "Comic novel", "response": ["More contemporary British humorists are George MacDonald Fraser, Tom Sharpe, Kingsley Amis, Terry Pratchett, Richard Gordon, Rob Grant, Douglas Adams, Evelyn Waugh, Anthony Powell, Nick Hornby, Helen Fielding, Eric Sykes, Leslie Thomas, Stephen Fry, Richard Asplin, Mike Harding, Joseph Connolly, and Ben Elton."]}, {"page": "James Stannage", "response": ["He first worked for Piccadilly Radio in the mid-1970s, presenting his own late-night phone-in show. Occasional guests on the show were Mike Harding and Jasper Carrott. He was renowned for his abrasive and aggressive style even then, so much so that the Bishop of Salford publicly condemned him as a bad influence."]}, {"page": "Milnrow", "response": ["Milnrow has a \"distinct and separate character\". It is one of the towns of northern England that observed the custom of Rushbearing, an annual Anglican religious festival where rushes are brought by rushcart to by strewn in the parish church to refresh the flooring. Milnrow's Rushbearing occurred on the Sunday prior to St James's Day, and in 1717, Francis Gastrell, the Bishop of Chester, wrote that Milnrow's festival was a particularly \"disorderly custom\". Parishioners would travel as far as Marsden to gather rushes. Established in 1968, Milnrow and Newhey Carnival is an annual summer community parade with floats, morris dancers and brass bands. The Milnrow Band is a British brass band ranked as a \"top class group of amateur musicians\". It formed from a succession of mergers and amalgamations of Milnrow- and Rochdale-based brass bands, the earliest of which was St Stephen's Band founded in Milnrow in 1869. In 2006 it was promoted to the top-rank Championship section of Great Britain, and in 2017 were the All England Masters International Champions. In his 2015 memoir, the Manchester-born comedy-singer Mike Harding recalled \"a place called Milnrow, on the extreme edge of the then known world, [...where...] everything stopped for pie and peas\"."]}, {"page": "Cambridge Folk Festival", "response": ["In 2011, specialist music book publisher Rufus Stone released a limited edition book by rock art photographer Nick Elliott entitled TEN - A Decade in Images. The book features images taken at the festival by Elliott between 2000–2010 and was endorsed by the organisers. It includes quotes from some of the musicians featured in its pages such as Richard Hawley, Julie Fowlis, Sharon Shannon, and Cara Dillon as well as BBC radio presenters Mark Radcliffe and Mike Harding. Elliott released a follow-up book, 50Folk, in 2014 as a personal celebration of 50 years of the festival."]}, {"page": "Bernard Wrigley", "response": ["He began acting around the same time and has made many appearances on stage, most famously in Samuel Beckett's Waiting for Godot alongside Mike Harding at Bolton's Octagon Theatre, and Jim Cartwright's Road at the Royal Exchange Theatre, Manchester."]}, {"page": "BBC Radio 2 Folk Awards", "response": ["Between 2000 and 2012 the Folk Awards were hosted by Mike Harding, and broadcast on BBC Radio 2. Mark Radcliffe and Scottish Gaelic singer Julie Fowlis took over presenting the ceremony in 2013. In 2004 the awards were shown on television for the first time, on BBC Four. The event has been streamed live in audio and video on the BBC Radio 2 website, the BBC iPlayer and/or the BBC Red Button TV service."]}, {"page": "Accrington Pals", "response": ["A song telling their story was written and recorded by English folk singer and comedian Mike Harding.  A play based on the unit, The Accrington Pals, was also later written by Peter Whelan.The Accrington Pals (play, 1984), Peter Whelan "]}, {"page": "Songbird (Eva Cassidy album)", "response": ["The album was originally released in 1998, eighteen months on from Cassidy's death. At this point, she was virtually unknown in the United Kingdom and Songbird only charted in the nether-regions of the UK Albums Chart. Two years after the album's release, however, Cassidy's music was brought to the attention of British audiences when her versions of \"Fields of Gold\" and \"Over the Rainbow\" were played by Mike Harding and Terry Wogan on BBC Radio 2. Following the overwhelming response, a camcorder recording of \"Over the Rainbow\", taken at Blues Alley in Georgetown, Washington, D.C. by her friend Bryan McCulley, was shown on BBC Two's Top of the Pops 2. Shortly afterwards, Songbird climbed to the top of the UK Albums Chart. It ended up being the eighth biggest-selling album of 2001, has been certified 6× Platinum by the British Phonographic Industry (BPI) and has to-date sales of 1.91 million."]}, {"page": "Jake Thackray", "response": ["Thackray sang in a lugubrious baritone voice, accompanying himself on a nylon-strung guitar in a style that was part classical, part jazz. His witty lyrics and clipped delivery, combined with his strong Yorkshire accent and the northern setting of many of his songs, led to him being described as the \"North Country Noël Coward\", a comparison Thackray resisted, although he acknowledged his lyrics were in the English tradition of Coward and Flanders and Swann, \"who are wordy, funny writers\". However, his tunes derived from the French chansonnier tradition: he claimed Georges Brassens as his greatest inspiration and he was also influenced by Jacques Brel and Charles Trenet. He also admired Randy Newman. He was admired by, and influenced, many performers including Jarvis Cocker, Mike Harding, Momus, Ralph McTell, Morrissey, Alex Turner, and Jasper Carrott.Jasper Carrott, , accessed 7 September 2011."]}, {"page": "Nic Jones", "response": ["In 2001, Penguin Eggs was voted to second place in the \"Best Folk Album of all Time\" by listeners of the Mike Harding show on BBC Radio 2. The opening track on this album, \"Canadee-I-O\" was also recorded by Bob Dylan and included on his 1992 album Good as I Been to You. Some critics, such as FRoots editor Ian A. Anderson, have accused Dylan of stealing Jones' arrangements for this song, without credit or offer of royalties."]}, {"page": "Annie Nightingale", "response": ["She started at BBC Radio 1 on 8 February 1970 with a Sunday evening show. The show was short-lived and in April she became one of the hosts of the singles review show What's New before graduating to a late-night progressive rock show, Sounds of the 70s, with Alan Black, John Peel, Bob Harris, Pete Drummond, and Mike Harding which was simulcast on the BBC Radio 2's FM frequency."]}, {"page": "Uncle Joe's Mint Balls", "response": ["British singer/songwriter and humorist Mike Harding has a song called \"Uncle Joe's Mint Balls\" on his 1975 album Mrs. 'Ardin's Kid. It also appeared as the B-side to his 1975 single \"My Brother Sylveste\". Wigan Warriors have a version of the song celebrating some of its legendary rugby players of the 1950s and 60s such as Billy Boston, Brian McTigue and Eric Ashton that plays before some of its home games at the DW Stadium. Viz Comic made a strip called 'Uncle Joe's Mint Balls' which was about Joseph Stalin, who was sometimes called 'Uncle Joe' by Western media, and his quest to show off his untarnished testicles to the world's press (such testicles would be known as 'mint balls' in the vernacular of Northern England, where the comic is printed.)"]}, {"page": "HM Prison Manchester", "response": ["*\"Strangeways Hotel\", a song by Mike Harding."]}, {"page": "Wally Whyton", "response": ["Subsequently, he was the host of Granada TV's Time for a Laugh. From the 1960s to the 1990s he was a presenter on BBC Radio 2, mainly fronting folk and country music programmes.  One of these was \"Hello Folk\" and another \"Country Club\". In the 1970s \"Hello Folk\" was rebroadcast(ann. It was not a REbroadcast but came live from London,resp.taped!) on BFBS. In 1976, he toured Germany, visiting the Forces Folk clubs presenting The McCalmans and Mike Harding."]}, {"page": "James Yorkston", "response": ["In October 2007, Yorkston was invited to work as Musical Director with Oliver Knight and the Waterson–Carthy clan for the BBC Electric Proms tribute to Lal Waterson. This was broadcast on BBC Radio 2 by the Mike Harding Show as well as being filmed. Alongside Waterson–Carthy, the acts involved included Alasdair Roberts, Kathryn Williams and Lisa Knapp. Yorkston's involvement with the Fence Collective continued: he has toured extensively with King Creosote and regularly contributed to the Fence Collective's Homegame mini-festivals featuring guest performances by artists such as The Concretes and Hot Chip. Yorkston also plays in the Fence Collective bands The 3 Craws, Pictish Trail and U.N.P.O.C.."]}, {"page": "List of music artists and bands from Manchester", "response": ["*Mike Harding"]}, {"page": "And the Band Played Waltzing Matilda", "response": ["Cover versions of the song have been performed and recorded by Katie Noonan (Flametree Festival Byron Bay 08), The Irish Rovers, Joan Baez, Priscilla Herdman, Liam Clancy, Martin Curtis, The Dubliners, Ronnie Drew, Danny Doyle, Slim Dusty, The Fenians, Mike Harding, Jolie Holland, Seamus Kennedy, Johnny Logan and Friends, John Allan Cameron, John McDermott, Midnight Oil, Christy Moore, William Crighton, The Sands Family, the Skids, June Tabor, John Williamson, The Bushwackers and the bluegrass band Kruger Brothers, Redgum, John Schumann, Tickawinda (on the album Rosemary Lane), Orthodox Celts, The Houghton Weavers, The Pogues, and Bread and Roses. Audrey Auld-Mezera (on the album Billabong Song), Garrison Keillor has also performed it on his radio show A Prairie Home Companion when ANZAC Day (25 April) has fallen on a Saturday and has also performed his own adaptation titled And the Band Played The Star-Spangled Banner. Phil Coulter released a cover on his 2007 album Timeless Tranquility - 20 Year Celebration."]}, {"page": "Bill Leader", "response": ["*A Lancashire Lad (1972) – Mike Harding"]}, {"page": "Karine Polwart", "response": ["In April 2006, Polwart released her second solo album Scribbled in Chalk. This album was heralded with much critical acclaim receiving impressive reviews from amongst others, The Scotsman, The Sunday Times, and The Independent on Sunday. A UK wide tour followed as well as appearances on BBC 2's Culture Show, Simon Mayo's Album show on Radio 2, Mike Harding's folk show on Radio 2, BBC Radio Scotland on the Janice Forsyth show and the Janice Long Late show on Radio 2."]}, {"page": "Bogeyman (disambiguation)", "response": ["*\"Bogey Man\" / \"The Bogeyman\", a 1976 song by Mike Harding"]}, {"page": "Robin Rimbaud", "response": ["Around 1992, Rimbaud came into possession of a scanner — having bought it from a friend who needed money — and began to experiment with integrating intercepted conversations into his music. His debut Scanner CD was released in 1992 on Ash International, a subsidiary label of London's Touch Music label. He continued to produce the first dozen releases with Mike Harding of Touch, including Scanner², Mass Observation, Blind, and Runaway Train, a real-time recording of the captivating radio contact between Alfie, controller of the line and Wesley, the driver of a runaway train. Location: New Brunswick, Canada, recorded 9 March 1948."]}, {"page": "St Bede's College, Manchester", "response": ["* Mike Harding – folk singer and DJ"]}, {"page": "Salsa Celtica", "response": ["Salsa Celtica have appeared on BBC Radio 2's folk programme The Mike Harding Show and BBC Radio 3's Andy Kershaw Show. The release of El Agua De La Vida in 2004 was also met with critical acclaim, including in the Evening Standard."]}, {"page": "Graham Oliver", "response": ["* (2013) Jump Ararnd (with The Bar-Steward Sons of Val Doonican, Eliza Carthy, Mike Harding, Maartin Allcock and Hugh Whitaker) ", "* (2014) The Devil Went Darn To Barnsley (with The Bar-Steward Sons of Val Doonican, Eliza Carthy, Mike Harding, and Maartin Allcock) "]}]}}