{"wiki_id": "http://www.wikidata.org/entity/Q6846424", "itemLabel": "Mike Cotton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Cotton_(musician)", "wikipedia_page": {"main": "Michael Edward Cotton (born 12 August 1939) is an English jazz and R&B trumpeter, flugelhornist, harmonicist, vocalist and bandleader born in Tottenham, North London. He is best known for leading his band under the names The Mike Cotton Jazzmen and The Mike Cotton Sound. Cotton currently plays with the Stars of British Jazz.", "link_mentions": [{"page": "Muswell Hillbillies", "response": ["at Morgan Studios, London, using a new brass section, the Mike Cotton Sound, which included Mike Cotton on trumpet, John Beecham on trombone and tuba, and Alan Holmes on clarinet.", "* Mike Cotton – trumpet"]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Mike Cotton Jazzmen", "*The Mike Cotton Sound"]}, {"page": "Bob Henrit", "response": ["As a session drummer, he worked with the Who vocalist, Roger Daltrey, and was present on Dave Davies' Glamour (1981) and Chosen People (1983) solo albums. He also worked regularly with the GB Blues Band which, in addition to Rodford, included former members of the Mike Cotton Sound. In a 1972 interview, Keith Moon identified Henrit as one of his favourite drummers."]}, {"page": "Everybody's in Show-Biz", "response": ["*Mike Cotton – trumpet"]}, {"page": "Misfits (The Kinks album)", "response": ["*Mike Cotton - trumpet on \"Black Messiah\""]}, {"page": "Dave Rowberry", "response": ["Born in Mapperley, Nottinghamshire, Rowberry entered the Newcastle-upon-Tyne blues and jazz music scene in the early 1960s, when he was at Newcastle University. He joined The Mike Cotton Jazzmen (later The Mike Cotton Sound) in 1962, who made a living backing American blues and pop acts touring England, including Solomon Burke, Stevie Wonder, the Four Tops and Gene Pitney.Bruce Eder, Biography of the Mike Cotton Sound; Allmusic.  Retrieved 2017-03-10.Pierre Perrone, Dave Rowberry Obituary; The Independent, June 8, 2003.  Retrieved 2017-03-114.  Rowberry played on the group's singles from 1962–1965, including their hit, \"Swing That Hammer\", as well as their self-titled album.", "The original incarnation of The Animals collapsed in September 1966, after which Rowberry became a session musician.  Until 2001, he was not invited to participate in any subsequent group reunions involving Eric Burdon. He did reunite a few times on projects with his former bandmates from the Mike Cotton Sound. The most notable reunion was The Kinks' album, Everybody's in Show-Biz. Rowberry played on the single \"Celluloid Heroes\" and some keyboard instruments on the album. He also appeared with the Kinks on television during this time on the song, \"Supersonic Rocket Ship\". Rowberry also played on many albums by blues singer Dana Gillespie in the 1980s and 1990s."]}, {"page": "Working Man's Café", "response": ["*Mike Cotton - trumpet on \"Morphine Song\""]}, {"page": "Colour Me Pop", "response": ["Mike Cotton Sound"]}, {"page": "Supersonic Rocket Ship", "response": ["*Mike Cotton - trumpet"]}, {"page": "20th Century Man", "response": ["* Mike Cotton - Trumpet*"]}, {"page": "British rhythm and blues", "response": ["Early British rhythm and blues bands like Blues Incorporated found that folk clubs would not accept amplified blues performances.R. F. Schwartz, How Britain Got the Blues: the Transmission and Reception of American Blues Style in the United Kingdom (Aldershot: Ashgate, 2007), , p. 126. However, many London trad jazz clubs moved over to the style. In addition to the Roundhouse and the Marquee in central London, these included The Flamingo, the Crawdaddy Club, Richmond, where the Rolling Stones first began to gain attention,B. J. Faulk, British Rock Modernism, 1967–1977: the Story of Music Hall in Rock (Aldershot: Ashgate, 2010), , p. 81. Klooks Kleek, The Ealing Club and the Eel Pie Island Hotel.P. Myers, It Ain't easy: Long John Baldry and the Birth of the British Blues (Vancouver DC: Greystone Books, 2007), , p. 56. Blues clubs were appearing in the capital at such a rate that in 1963 Melody Maker declared London \"The New Chicago!\". The scene soon began to spread out beyond London, particularly into East Anglia and the Midlands, with clubs in Norwich and Birmingham adopting the genre. Jazz bands also followed suit, with the Mike Cotton Jazz Band becoming the Mike Cotton Sound, Warwick's Tony and the Talons becoming the Original Roadrunners and Burton on Trent's Atlantix becoming Rhythm and Blues Incorporated.R. F. Schwartz, How Britain Got the Blues: the Transmission and Reception of American Blues Style in the United Kingdom (Aldershot: Ashgate, 2007), , p. 133."]}, {"page": "List of the Kinks band members", "response": ["*Mike Cotton – trumpet (Muswell Hillbillies , Everybody's in Showbiz , Misfits , "]}, {"page": "1939 in jazz", "response": ["* 12 – Mike Cotton, English trumpeter."]}, {"page": "Mike Cotton", "response": ["Mike Cotton may refer to:", "* Mike Cotton (musician) (born 1939), English jazz and R&B musician, vocalist and bandleader", "* Mike Cotton (pole vaulter) (born 1951), former American college and international track and field athlete"]}, {"page": "Klooks Kleek", "response": ["The Mike Cotton Sound's 45 appearances were made mostly on Thursday where they were effectively the house band."]}, {"page": "Post Card (album)", "response": ["* Mike Cotton - trumpet"]}, {"page": "Michael Edward Cotton", "response": ["#redirect Mike Cotton (musician)"]}, {"page": "Michael E Cotton", "response": ["#redirect Mike Cotton (musician)"]}, {"page": "Michael E. Cotton", "response": ["#redirect Mike Cotton (musician)"]}, {"page": "Mike E. Cotton", "response": ["#redirect Mike Cotton (musician)"]}, {"page": "Mike E Cotton", "response": ["#redirect Mike Cotton (musician)"]}, {"page": "List of years in jazz", "response": ["* 1939 in jazz, deaths of Charlie Irvis, Chick Webb, Herschel Evans, John Robichaux, Louis Douglas, Ma Rainey, and Tommy Ladnier; births of Abu Talib, Aladár Pege, Alan Silva, Albert Dailey, Andrew Cyrille, Andrzej Jastrzebski, Andy Bey, Art Themen, Bill Watrous, Bob James, Brian Auger, Brian Smith, Bruce Cale, Butch Warren, Campbell Burnap, Carlos Emilio Morales, Carlos Lyra, Charles Gayle, Charles McPherson, Chris Karan, Chris Pyne, Christer Boustedt, Claudio Fasoli, Cleveland Eaton, Csaba Deseo, Derek Wadsworth, Dianne Brooks, Dick Berk, Dick Griffin, Don Alias, Elaine Delmar, Enrico Rava, George Braith, Ginger Baker, Greetje Kauffeld, György Szabados, Harald Heide-Steen Jr., Hartmut Geerken, Henrik Otto Donner, Hubert Laws, Hugh Masekela, Idris Muhammad, Jair Rodrigues, James Booker, Jamey Aebersold, Jan Erik Vold, Jeanne Lee, Jorge Anders, Joe McPhee, Joe Roccisano, Joe Sample, Kate Westbrook, Kent Carter, Larry Harlow, Lou Gare, Mario Rivera, Marvin Stamm, Mary Stallings, Masabumi Kikuchi, Meco, Michel Colombier, Mike Cotton, Mike Longo, Nick Ceroli, Niels Jørgen Steen, Okay Temiz, Ove Stokstad, Patrick Williams, Paul Winter, Pekka Pöyry, Phil Ranelin, Richard Teitelbaum, Roger Kellaway, Rosa King, Sam Brown, Sonny Fortune, Steve Marcus, Tommy Stewart, Tony Hatch, Trevor Watts, Virgil Jones, Wayne Henderson, Wojciech Karolak, and Zbigniew Namyslowski."]}]}}