{"wiki_id": "http://www.wikidata.org/entity/Q6846612", "itemLabel": "Mike Dowler", "itemDescription": "Welsh footballer (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Dowler", "wikipedia_page": {"main": "Mike Dowler (born 12 October 1957) is a Welsh retired professional football goalkeeper. He spent most of his career in the U.S. indoor leagues where he was named the 1995 Continental Indoor Soccer League Goalkeeper of the Year.", "link_mentions": [{"page": "October 12", "response": ["*  1957   – Mike Dowler, Welsh football goalkeeper"]}, {"page": "Continental Indoor Soccer League", "response": ["*1995: Mike Dowler, Sacramento Knights"]}, {"page": "Kansas City Comets (1979–91)", "response": ["* Mike Dowler (1989–91) GK 57 Apps  29 Wins  26 Losses"]}, {"page": "Wichita Wings", "response": ["On the field, the Wings looked to athletes from Denmark to help improve the team. Bundesliga veteran Jorgen Kristensen and a young talent named Kim Røntved made a huge impact on the team. Kristensen would become the MISL Passmaster while Røntved was twice named MISL Defender of the Year and would become the Wings' all-time leader in goals scored. Mike Dowler from Wales secured the goalkeeper position after a battle with Keith Van Eron. Dowler would earn an MISL record four shutouts in his career with the Wings. The team's popularity increased in the 1980-81 season in part due to a controversy involving the San Francisco Fog's forward Mike Mancini. On December 28, 1980, in a Wings blowout win, Mancini punched Jorgen Kristensen hard enough to drop him to the ground. The incident was televised, thus leading to a great deal of media coverage. Bill Kentling credited this incident with helping to improve attendance. That season was the beginning of the Wings' epic rivalry with the St. Louis Steamers. The Wings would meet St. Louis in the semifinals of the 1981 playoffs. In the third and decisive game, the Steamers would come from behind to beat the Wings in a shootout. The game was marred by an ugly foul against Mike Dowler, sending him to the bench for the remainder of the game. Many considered it the greatest game in MISL history.", "The 1985-86 season brought a change in goal. The departure of Mike Dowler to the Tacoma Stars resulted in a pair of new goalkeepers joining the Wings. Jan Olesen from Denmark and Seamus McDonagh from Ireland would split goalkeeping duties. Olesen would be remembered for scoring a goal in a game against the St. Louis Steamers. He dribbled the ball from his own goal to the other end of the field, kicking the ball between Slobo Ilijevski's legs. Englishman Barry Wallace, Scotsman Dave Hoggan, and Californian Mike Fox joined the team that season. Each would have an important impact. But no one had an impact like \"The American Dream,\" Chico Borja. The former Las Vegas American became a Wings player thanks to the dissolution of the Vegas franchise. Borja would become a star from the midfield position, becoming the all-time Wings assist leader by the end of his career. Despite a 27-21 season, the Wings would lose in the first round of the playoffs to the Tacoma Stars.", "| Mike Dowler", "| Mike Dowler", "|Mike Dowler", "|Mike Dowler", "|Mike Dowler"]}, {"page": "Sacramento Knights", "response": ["CISL award winners include Mike Dowler, 1996 goalkeeper of the year.  Sean Bowers was the 1993 Defender of the Year, and Danny Pena won the same award with the club in 1995."]}, {"page": "Dowler", "response": ["*Mike Dowler, retired Welsh professional football goalkeeper"]}]}}