{"wiki_id": "http://www.wikidata.org/entity/Q6849215", "itemLabel": "Mike Ware", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Ware_(photographer)", "wikipedia_page": {"main": "Michael J. Ware (born 1939, Bromley)  is a chemist and photographer, known for his work in alternative photographic processes, earlier methods of printing photographic images that were succeeded by the more common silver-gelatin used today. In the Present, Ware acts as a consultant, most recently on the history and development of the platinotype and palladium processes. His has also written about chemistry's influence on the history of photography.", "link_mentions": [{"page": "Chrysotype", "response": ["The modern chemist and photographic historian Mike Ware published the first books covering the subject of chrysotype in 2006, 'The Chrysotype Manual: the science and practice of photographic printing in gold' and 'Gold in Photography: the history and art of chrysotype'.", "*Chrysotype Books by Mike Ware"]}, {"page": "Michael Ware (disambiguation)", "response": ["* Mike Ware (photographer) (born 1939), English photographer known for work on alternative processes", "* Mike Ware (ice hockey) (born 1967), Canadian ice hockey player"]}, {"page": "Royal Photographic Society", "response": ["*1990   –    Mike Ware"]}, {"page": "Argyrotype", "response": ["Argyrotype is an iron-based silver printing process that produces brown images on plain paper. It is an alternative process derived from the argentotype, kallitype, and Van Dyke processes of the 19th century, but has greater simplicity, improved image stability, and longer sensitizer shelf-life.Mike Ware It was developed by Mike Ware.", "*The Argyrotype Process by Mike Ware"]}, {"page": "Helen Rappaport", "response": ["Rappaport was born Helen Ware in Bromley, grew up near the River Medway in North Kent and attended Chatham Grammar School for Girls.  Her older brother Mike Ware, born 1939, is a photographer, chemist, and writer.Helen mentioned her relationship in a session during the Edinburgh Book Festival on 14 August 2013.  Mike Ware has investigated early photographic processes in great depth. She has twin younger brothers, Peter (also a photographer) and Christopher, born in 1953."]}, {"page": "Ware (surname)", "response": ["* Mike Ware (ice hockey), Canadian ice hockey player", "* Mike Ware (photographer), chemist and alternative-process photographer"]}, {"page": "Cyanography", "response": ["The ingredients have remained mostly unchanged since its inception over 170 years ago. In 1994, Mike Ware (MA DPHIL CCHEM FRSC), invented a new cyanotype ink which replaced the ferric ammonium citrate with ferric ammonium oxalate. This has been the main change in cyanotype since its inception and give cyanography further opportunities. ", "Cyanography continued to grow slowly in popularity amongst contemporary artists from this time until the present. Notably, in 1995, Mike Ware developed a new way of developing cyanotypes by substituting ferric ammonium citrate with ferric ammonium oxalate – creating a fast-developing mixture that made the process more efficient, although some artists preferred the traditional method. Cyanography remains a fairly unknown technique outside of photography specialists, although there are several contemporary artists dedicated to the medium such as Kate Corsden, Christian Marclay and Azul Loeve.", "* Mike Ware"]}]}}