{"wiki_id": "http://www.wikidata.org/entity/Q6848257", "itemLabel": "Mike Oddy", "itemDescription": "British squash player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Oddy", "wikipedia_page": {"main": "Michael Oddy (1937-2016) is a former squash player from Scotland. He was one of the game's leading players in the 1960s. He played in an era where the sport was dominated by great players from Pakistan (such as Azam Khan, Roshan Khan, Mo Khan and Aftab Jawaid) and Egypt (such as A.A. AbouTaleb and Ibrahim Amin).Oddy was one of the few British players to provide as consistent challenge to the dominant Asian and African players of his era. He was runner-up to A.A. AbouTaleb at the 1964 British Open (which was considered to be effective world championship of the sport at the time), and won the British Amateur Championship in 1960 and 1961.\nHe was born in Hawick, Scotland and after Rugby School joined Ballantyne Knitwear, which became part of Baird Plc. He moved to Leicester to take up the role of managing director of Pantherella Fine English Socks, taking the business public onto the USM and then through its sale to Great Universal Stores (GUS Plc) before retiring.\nHe had a lifelong passion for flat racing, never missing a King George race day at Ascot for 59 years. He was delighted when through his membership of the Royal Ascot Racing Club he had a share in the Derby Winner Motivator in 2005.\nMike died in November 2016.\n\n", "link_mentions": [{"page": "British Open Squash Championships", "response": ["| 1964 ||  A.A. AbouTaleb ||  Mike Oddy || 9–3, 9–7, 9–0", "|  Mike Oddy || 0 || 1 || 1"]}, {"page": "A. A. AbouTaleb", "response": ["AbouTaleb then went on to win the British Open title for the next three consecutive years. In 1964, he beat Mike Oddy of Scotland in the final 9–3, 9–7, 9–0. AbouTaleb's win that year marked the end of 13 years of Pakistani domination of the British Open men's title. The following year, AbouTaleb beat his fellow Egyptian player Ibrahim Amin in the final 9–0, 0–9, 9–1, 9–6. His third and final British Open title came in 1966, when he defeated Pakistan's Aftab Jawaid in the final 9–6, 5–9, 9–3, 9–1.", "| 1964 || Mike Oddy || 9–3, 9–7, 9-0"]}, {"page": "1964 Men's British Open Squash Championship", "response": ["Roshan Khan seeded four pulled out of the main draw with an elbow injury to be replaced by lucky loser Sami Nadim. Abdelfattah Abou Taleb defeated Mike Oddy in the final. Aftab Jawaid won the third place play off by beating defending champion Mo Khan 9-6 5-9 5-9 10-8 9-1."]}]}}