{"wiki_id": "http://www.wikidata.org/entity/Q6850667", "itemLabel": "Milan Rai", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Milan_Rai", "wikipedia_page": {"main": "Milan Rai (born 1965) is a British  writer and anti-war activist from Hastings. He is co-editor with anti-war artist Emily Johns of the magazine Peace News. Along with fellow activist Maya Evans, he was arrested on 25 October 2005 next to the Cenotaph war memorial in London, for refusing to cease reading aloud the names of civilians by then killed in Iraq in the course of the Iraq war.  Rai was convicted under the Serious Organised Crime and Police Act 2005 (SOCPA) for organising an illegal demonstration in the vicinity of Parliament.", "link_mentions": [{"page": "Faurisson affair", "response": ["Two other biographers, Milan Rai and Chris Knight, both refer to the Faurisson affair in the context of Chomsky's uncompromising support for academic freedom for everyone including 'war criminals'. In Chomsky's Politics, Milan Rai quotes Chomsky saying that he even 'supported the rights of American war criminals not only to speak and teach but also to conduct their research, on grounds of academic freedom, at a time when their work was being used to murder and destroy.'Rai, M. 1995. Chomsky’s Politics. London and New York: Verso., p. 130-1."]}, {"page": "Peace News", "response": ["Peace News continues to be published in tabloid size print media and as a website by Peace News Ltd. It describes its editorial objectives as: to support and connect nonviolent and anti-militarist movements; provide a forum for such movements to develop common perspectives; take up issues suitable for campaigning; promote nonviolent, antimilitarist and pacifist analyses and strategies; stimulate thinking about the revolutionary implications of nonviolence.peace News Editorial policy , Peace News website. Accessed February 2010. It is currently edited by Milan Rai and Emily Johns.Our current staff , Peace News website. Accessed April 2010.", "|Milan Rai and Emily Johns"]}, {"page": "15 February 2003 anti-war protests", "response": ["Ten years on writer Ian Sinclair assembled an oral history of the demonstration. Journalist Ellie Mae O'Hagan, a UK Uncut activist, told Sinclair that despite its size \"it did absolutely nothing\". Other witnesses, such as Milan Rai, are of the opposite opinion: \"We achieved a lot, and a hell of a lot more than we realise\". Tariq Ali, one of the speakers in February 2003, said at the tenth anniversary: \"I didn’t quite tell them 'Blair is going to go to war regardless of today' but I knew that\". \"It was a huge show of anger but that's about it. It left no lasting legacy in my opinion.\""]}, {"page": "Taking Liberties (film)", "response": ["Maya Evans and Milan Rai of the Justice Not Vengeance discuss their arrest for an illegal memorial service outside Downing Street. Photos, title cards and archive footage tell the story of protester Brian Haw. Peace Campaigners Sylvia & Helen talk about their arrest at the Menwith Hill US Military Base in Yorkshire. Baptist Minister Malcolm Carroll and the Rickford family discuss the Climate Camp protest at East Midlands Airport. Finally the collusion between police and EDO MBM to break anti-war protests by the Brighton & Hove Citizens Weapons' Inspectors is revealed.", "* Milan Rai – Justice Not Vengeance Co-ordinator"]}, {"page": "Category talk:Anti-abortion violence", "response": ["********************Mark Juergensmeyer makes the point you are looking for. Ziauddin Sardar makes the point, classifying abortion clinic violence as Christian terrorism. Andrew Sullivan makes the point, singling out anti-abortion violence as Christian terrorism. Aref M. Al-Khattar makes the point, writing about the USA: \"Many Christian organizations rely on their special interpretation of the Bible in committing violent (terrorist) acts. These include anti-Semitic attacks, anti-abortion acts, and violent anti-black movements.\" Jennifer Jefferis makes the point, connecting all American anto-abortion terrorism to Christian extremism stemming from 1981's A Christian Manifesto. Professor Muhammad Arif Zakaullah makes the point that Christian fundamenalists make up the Christian terrorists who use violence against abortion providers. Patricia Baird-Windle and Eleanor J. Bader make the point in their scholarly book Targets of hatred: anti-abortion terrorism: they write that American anti-abortion sentiment is specifically based on interpretations of Biblical law and historical Christian theology. The authors write that Americans are hard-pressed to accept that Christianity is the root of this violence, they write about media coverage, \"Then, still unable to accept the fact that an allegedly Christian political movement had turned deadly, they began to focus on the pathology of individual fanatics. Repeatedly we were told that the killings were 'isolated incidents'...\" The authors continue proving that American anti-abortion terrorism is Christian extremism. Milan Rai, Loretta Hall, Anan Ameri, and Bridget K. Hall all make the same point, that Westerners are unable to admit that Christian extremism is the root of all anti-abortion terrorism, though it is. Binksternet (talk) 16:46, 11 November 2011 (UTC)"]}, {"page": "List of people from Hastings", "response": ["*Milan Rai (living), political activist. Lives in Hastings."]}, {"page": "John Rety", "response": ["As a chess player, reaching a FIDE rating of 2034,Milan Rai, John Rety: \"The point is this\", 26 February 2010. he played for Middlesex and London University as well as representing England in the European Senior Chess Championship. For most of his life he travelled on a stateless person's document, but finally obliged to obtain a British passport in his late seventies, after Hungary joined the EU.Richard Bagley, \"Obituary: John Rety 1930 to 2010\", Morning Star, 26 March 2010."]}, {"page": "List of peace activists", "response": ["* Milan Rai (born 1965) – British writer and anti-war activist"]}]}}