{"wiki_id": "http://www.wikidata.org/entity/Q6851436", "itemLabel": "Miles Jupp", "itemDescription": "British comedian and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Miles_Jupp", "wikipedia_page": {"main": "Miles Hugh Barrett Jupp (born 8 September 1979) is an English actor and comedian. He began his career as a stand-up comedian, before playing the role of the inventor Archie in the children's television series Balamory. He has also appeared on comedy panel shows, and played John Duggan in The Thick of It and Nigel in the sitcom Rev.In September 2015, Jupp replaced Sandi Toksvig as the host of The News Quiz on BBC Radio 4.\n\n", "link_mentions": [{"page": "Fu Manchu", "response": ["In 2010, Fu Manchu's connections with the University of Edinburgh where he supposedly obtained a doctorate were investigated in a mockumentary by Miles Jupp for BBC Radio 4."]}, {"page": "William Makepeace Thackeray", "response": ["* Miles Jupp plays Thackeray in the 2017 film The Man Who Invented Christmas."]}, {"page": "I'm Sorry I Haven't a Clue", "response": ["* Miles Jupp (2013, 2015–17, 2019–21)", "The seventh tour took place in 2016, again with Dee in the chair. Graeme Garden was absent from this tour so Jeremy Hardy took his place, with Miles Jupp as the guest panellist.", "A ninth tour was announced in October 2019 to take place in early 2020. Jack Dee, Colin Sell and Tim Brooke-Taylor were joined by Tony Hawks and Miles Jupp on the panel, with the fourth spot rotating between Rory Bremner, Richard Osman and John Finnemore. Marcus Brigstocke also appeared in place of Jupp on some dates, and Barry Cryer made a special appearance at the Watford Colosseum show.", "A tenth tour was announced in November 2021 to take place in early 2022. All dates features Tony Hawks, Miles Jupp, Pippa Evans and Rory Bremner on the panel, with the exception of the Stockton date which features Marcus Brigstocke in place of Bremner."]}, {"page": "James Boswell", "response": ["In February and March 2015, BBC Radio 4 broadcast three episodes of \"Boswell's Lives\", writer Jon Canter's comedic take on Boswell meeting later historical figures (Sigmund Freud, Maria Callas and Harold Pinter, respectively) for the purposes of biographing them. Boswell was played by Miles Jupp."]}, {"page": "List of British comedians", "response": ["*Miles Jupp, Mock the Week, Have I Got News for You"]}, {"page": "University Challenge", "response": ["|University of Edinburgh (Catherine Slessor, Thomasina Miers, Miles Jupp, Phil Swanson)"]}, {"page": "The News Quiz", "response": ["The News Quiz was first broadcast in 1977 with Barry Norman as chairman. Subsequently, it was chaired by Barry Took from 1979 to 1981, Simon Hoggart from 1981 to 1986, Barry Took again from 1986 to 1995, and then again by Simon Hoggart from 1996 until March 2006. Hoggart was replaced by Sandi Toksvig in September 2006, who in turn was replaced by Miles Jupp in September 2015 until his departure at the end of 2019. Three different hosts took the chair in 2020, Nish Kumar (series 101), Angela Barnes (series 102), and Andy Zaltzman (series 103). At the end of series 103 it was announced that Zaltzman would continue as permanent host. The series was created by John Lloyd based on an idea from Nicholas Parsons.", "* Miles Jupp (2015–2019, series 88–99)", "* Miles Jupp (also a former host)", "As of 28 September 2007, The News Quiz became downloadable as part of the \"Friday Night Comedy\" podcast feed for Radio 4. The podcast switches between The News Quiz and The Now Show, depending on which show is being transmitted.  During Miles Jupp's tenure, an extended version of the show entitled The News Quiz Extra featuring an additional 10–15 minutes of material was broadcast on BBC Radio 4 Extra in the week following the standard Radio 4 broadcast.  This version was also made available as a podcast."]}, {"page": "Jeremy Hardy", "response": ["Hardy died of cancer on 1 February 2019, at the age of 57. Julia McKenzie, the head of Radio team at BBC Studios, said of Hardy \"I will remember him as someone who could convulse an audience with laughter at a comic image whilst at the same time making a point of substance that reverberated on a much deeper level and spoke to his principles and unflinching concern for the less fortunate.\" Miles Jupp, then-host of The News Quiz and a longtime friend, wrote his obituary in The Guardian."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp", "|Miles Jupp"]}, {"page": "Neil Morrissey", "response": ["Morrissey starred alongside Adrian Edmonson, Robert Webb and Miles Jupp in the play Neville's Island at Duke of York's Theatre, London during Autumn 2014."]}, {"page": "Duke of York's Theatre", "response": ["* Neville's Island (10 October 2014 – 3 January 2015) by Tim Firth, starring Adrian Edmondson, Miles Jupp, Neil Morrissey and Robert Webb"]}, {"page": "David Tomlinson", "response": ["*The Life I Lead, a 2019 one-man comedy play by James Kettle which explores Tomlinson's life, starring Miles Jupp."]}, {"page": "Balamory", "response": ["* Archie (played by Miles Jupp), an inventor who builds zany creations from household objects which are intended to be useful, but sometimes backfire. His main colour is pink and he lives in a pink castle.", "By the time the programme was cancelled, many of the cast were also keen to move on. Miles Jupp, who played Archie, stated that his role caused problems with his comedy career, with parents assuming his routines were age-appropriate and permitting their children to see them. Julie Wilson Nimmo, who played Miss Hoolie, complained that she could not take her children to the local play area without being \"mobbed.\" Mary Riggans, who played Suzie Sweet, died in 2013, having suffered a stroke the year before."]}, {"page": "A Day in the Death of Joe Egg", "response": ["In October 2011 the Citizens Theatre  again staged the play that premiered there in 1967, with a cast that included Miles Jupp, Sarah Tansey,  and Miriam Margolyes."]}, {"page": "Why Didn't They Ask Evans?", "response": ["Miles Jupp as Henry Bassington-ffrench"]}, {"page": "Lord's Taverners", "response": ["The Lord's Taverners have their headquarters in London, with the support of over 50 regions. The Lord's Taverners also benefits from the fundraising activities of The Lady Taverners, Regional Committees and its 5,000 members, many of them work in sport and entertainment. The list includes Sir Michael Parkinson, Sir Alastair Cook, Sir Andrew Strauss, Greg James, Miles Jupp, Dame Tanni Grey-Thompson, Jonathan Agnew and Mike Gatting."]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|Alex Horne – Making Fish Laugh with Tim KeyMichael McIntyreMiles Jupp – Gentlemen Prefer Brogues"]}, {"page": "Improverts", "response": ["*Miles Jupp (Rev, Miles Jupp's Real World)"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Miles Jupp"]}, {"page": "Bedlam Theatre", "response": ["* Miles Jupp (Balamory, Miles Jupp's Real World, The News Quiz)"]}, {"page": "Saturday Kitchen", "response": ["* Miles Jupp", "There were celebrity appearances from Ronni Ancona, Helen George, David Haig, Aled Jones, Miles Jupp, Adil Ray, Louise Redknapp, and Nina Wadia."]}, {"page": "Latitude Festival", "response": ["Saturday - Stephen Grant, Dan Atkinson, Carey Marx, Tim Minchin, Scott Capurro, Jon Richardson, Bill Bailey, Jason Wood, Michael Fabbri, Jeremy Hardy, Miles Jupp, Rich Hall & Guilty Pleasures"]}, {"page": "Live at the Apollo (TV series)", "response": ["|Miles Jupp and Lee Nelson"]}, {"page": "St George's School, Windsor Castle", "response": ["* Miles Jupp (born 1979), comedian"]}, {"page": "List of Room 101 episodes", "response": ["|Kelly HoppenMiles JuppVernon Kay"]}, {"page": "The Unbelievable Truth (radio show)", "response": ["| Marcus Brigstocke, Miles Jupp, Susan Calman, Alan Davies", "| Miles Jupp, Susan Calman, Marcus Brigstocke, Alan Davies", "| Tony Hawks, Susan Calman, Phill Jupitus, Miles Jupp", "| Tony Hawks, Susan Calman, Phill Jupitus, Miles Jupp", "| Lloyd Langford, Henning Wehn, Sara Pascoe, Miles Jupp", "| Lloyd Langford, Henning Wehn, Sara Pascoe, Miles Jupp", "| John Finnemore, Henning Wehn, Lou Sanders, Miles Jupp", "| John Finnemore, Henning Wehn, Lou Sanders, Miles Jupp", "| Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle", "| Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle", "| Frankie Boyle, Miles Jupp, Sara Pascoe, Holly Walsh", "|Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Miles Jupp and Goldie"]}, {"page": "Justin Edwards (actor)", "response": ["Edwards is a regular voice on BBC Radio 4, having appeared on The News Quiz, Armando Iannucci's Charm Offensive, Cabin Pressure, The Odd Half Hour,  Kevin Eldon Will See You Now, Double Science, Mr Blue Sky and Listen Against amongst many others. He hosted five series of Newsjack, the topical sketch show on Radio 4 Extra and wrote and performed in Miles Jupp's radio sitcom In and Out of the Kitchen. In 2016 he played Anthony Trollope in Trollope And The Labours of Hercules. In 2017, he headed up the cast of Rum Bunch, with Mel Giedroyc and Dave Mounfield, and starred alongside Meera Syal in Mrs Sidhu Investigates."]}, {"page": "The Life I Lead", "response": ["*The Life I Lead is a 2019 one-man comedy play written by James Kettle about David Tomlinson's life in which the title of the play refers to the song. The song is also sung in the play by Miles Jupp who plays Tomlinson."]}, {"page": "So You Think You're Funny", "response": ["*Miles Jupp (Winner)"]}, {"page": "Leicester Mercury Comedian of the Year", "response": ["* 2001 Miles Jupp, Jimmy Carr, John Ryan, Adam Buss, Patrick Monahan"]}, {"page": "Zeb Soanes", "response": ["Soanes has been a newsreader for Radio 4's Today, PM and the Six O’Clock News. He is a regular newsreader on The News Quiz, joining the programme under the chairmanship of Sandi Toksvig, then Miles Jupp and in 2013 accompanied the programme on its first visit to the Edinburgh Festival."]}, {"page": "Chortle Awards", "response": ["* Best open mic: Des Clarke (nominees: Rohan Agalawatta, Steve Williams, Miles Jupp)"]}, {"page": "Tom Wrigglesworth", "response": ["In 2013, he started recording his latest series for Radio 4, called Tom Wrigglesworth's Hang Ups. The series is based on telephone calls he makes to his family in Sheffield, interspersed with sections of stand up as the stories unfold. The series was written by Wrigglesworth and James Kettle with additional material from Miles Jupp. It was recorded live at the BBC Radio Theatre with Judy Parfitt, Kate Anthony and Paul Copley playing the parts of his Granny, Mum, and Dad respectively. Elizabeth Bennett took over from Parfitt in subsequent series of the show. Series 5 was first broadcast in 2019."]}, {"page": "Chris Corcoran", "response": ["In August 2013, he started hosting the BBC Radio Wales comedy series Come the Revolution, where in each episode he welcomed a different comedian to chat about life, politics and comedy in front of a live audience. Among the guests on the show were Miles Jupp, Josie Long and Jarred Christmas.", "* The Really Welsh Christmas Quiz, alongside fellow comedians Miles Jupp, Elis James and Omar Hamdi"]}, {"page": "Heresy (radio series)", "response": ["| Miles Jupp, Sue Perkins, Richard Osman"]}, {"page": "Would I Lie to You? (game show)", "response": ["*Miles Jupp"]}, {"page": "Clive Anderson's Chat Room", "response": ["| David Quantick, Miles Jupp, Arthur Smith, Kirsty Wark"]}]}}