{"wiki_id": "http://www.wikidata.org/entity/Q686719", "itemLabel": "Joseph Maas", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Maas", "wikipedia_page": {"main": "Joseph Maas (30 January 1847 in Dartford, England – 16 January 1886 in London) was an English tenor singer.\nHe became a chorister in Rochester Cathedral. At first studying under J. C. Hopkins and Madame Bodda-Pyne, he went to study in Milan in 1869. In February 1871 he made his first success by taking Sims Reeves's place at a concert in London. In 1878 he became principal tenor in the Carl Rosa Opera Company, his beautiful voice and finished style more than compensating for his poor acting.\nMaas died from rheumatic gout on 16 January 1886.", "link_mentions": [{"page": "Maas (surname)", "response": ["*Joseph Maas (1847–1886), English tenor"]}, {"page": "1886 in music", "response": ["**Joseph Maas, operatic tenor (b. 1847)"]}, {"page": "Carl Rosa", "response": ["Rosa introduced many works of important opera repertoire to England for the first time, performing some 150 different operas over the years.  Besides Santley and Hersee, Minnie Hauk, Joseph Maas, Barton McGuckin and Giulia Warwick were some of the famous singers associated with the company during its early years.\"The Performers\", carlrosaopera.co.uk, 2009  Rosa also encouraged and supported new works by English composers. Frederic Hymen Cowen's Pauline (1876), Arthur Goring Thomas's Esmeralda (1883), Alexander Mackenzie's  Colomba (1883) and The Troubabour, and Charles Villiers Stanford's The Canterbury Pilgrims (1884) were commissioned by the company.  Earlier English operas by Wallace, Balfe and Julius Benedict were also included in the company's repertoire.  An obituarist noted, \"He had long looked forward to the time when Sir Arthur Sullivan would have undertaken a grand opera, and to the last had hoped to have been able to produce such a work.\"  Shortly before his death, Rosa launched a light opera company that debuted with Robert Planquette's Paul Jones."]}, {"page": "Carl Rosa Opera Company", "response": ["The company introduced many works of important opera repertoire to England for the first time, performing some 150 different operas over the years.  Besides Santley and Hersee, Blanche Cole, Minnie Hauk, Alice Esty, Alice Barth, Georgina Burns, Joseph Maas, Barton McGuckin, Giulia Warwick and William Ludwig were some of the famous singers associated with the company during its early years.\"The Performers\", carlrosaopera.co.uk, 2009 Its successes included productions of Cherubini's Les deux journées (1875); The Flying Dutchman (1876), with Santley in the title role; the first English-language production of Carmen (1879), starring Selina Dolaro in the title role and Durward Lely as Don José; Rienzi (1879); Lohengrin (1880); Tannhäuser (1882); and the first British staging of Puccini's La bohème (1897).\"Alice Esty\", Opera Scotland, accessed 12 January 2017 Alberto Randegger served as musical director of the company from 1879 to 1885,Grove, George, et al. \"Alberto Randegger\", Grove Music Online, Oxford Music Online (subscription required). and Gustave Slapoffski was principal conductor from 1897 to 1900.Wearing, J. P., The London Stage 1890–1899: A Calendar of Productions, Performers, and Personnel,  Rowman & Littlefield (2014), p. 359, Google Books\"Scottish performances of Gustave Slapoffski\", Opera Scotland. Retrieved 14 July 2020"]}, {"page": "Maas, Joseph", "response": ["#redirectJoseph Maas"]}]}}