{"wiki_id": "http://www.wikidata.org/entity/Q687611", "itemLabel": "David Masser", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Masser", "wikipedia_page": {"main": "David William Masser (born 8 November 1948)  is Professor Emeritus in the Department of Mathematics and Computer Science at the University of Basel. He is known for his work in transcendental number theory, Diophantine approximation, and Diophantine geometry. With Joseph Oesterlé, Masser formulated the abc conjecture which has been called \"the most important unsolved problem in Diophantine analysis\".", "link_mentions": [{"page": "List of conjectures", "response": ["|abc conjecture||number theory||⇔Granville–Langevin conjecture,  Vojta's conjecture in dimension 1⇒Erdős–Woods conjecture, Fermat–Catalan conjectureFormulated by David Masser and Joseph Oesterlé.Proof claimed in 2012 by Shinichi Mochizuki||n/a"]}, {"page": "Joseph Oesterlé", "response": ["Joseph Oesterlé (born 1954) is a French mathematician who, along with David Masser, formulated the abc conjecture which has been called \"the most important unsolved problem in diophantine analysis\".Oesterlé „Travaux de Wiles II“, Seminar Bourbaki 1994/5 Oesterlé „Nouvelles approches de Theoreme de Fermat“, Seminar Bourbaki 1987/8, abc Conjecture "]}, {"page": "Sparsely totient number", "response": ["The concept was introduced by David Masser and Peter Man-Kit Shiu in 1986. As they showed, every primorial is sparsely totient."]}, {"page": "Chislehurst and Sidcup Grammar School", "response": ["* David Masser FRS, Professor of Mathematics at the University of Basel."]}, {"page": "Gisbert Wüstholz", "response": ["His research interests are Algebraic Geometry and Number Theory (in particular Diophantine Approximation and Transcendence Theory) and Hodge Theory (Periods). Highlights of his scientific work are his famous Analytic Subgroup Theorem (1989) which bases on the Multiplicity Estimates on Group Varieties which he published in 1989, his proof of the abelian analogue of the famous Lindemann’s theorem (wrongly called Lindermann-Weierstrass Theorem), the result which disproved the squaring of the circle, the joint work with Gerd Faltings on the Schmidt's Subspace Theorem, the Isogeny Estimates for Abelian varieties proved jointly with David Masser which furnishes an alternative approach to the Mordell conjecture and the joint work with Alan Baker on linear forms in logarithms. His Analytic Subgroup Theorem is now a central result in transcendence theory. It says that the only algebraic points of an analytic subgroup A of a commutative algebraic group defined over \\overline{\\mathbb{Q}} are in an algebraic subgroup of A."]}, {"page": "Humboldt Prize", "response": ["David Masser (1990),"]}, {"page": "Masser", "response": ["* David Masser (born 1948), British Swiss mathematician"]}, {"page": "List of people by Erdős number", "response": ["* David Masser"]}, {"page": "Szpiro's conjecture", "response": ["The abc conjecture originated as the outcome of attempts by Joseph Oesterlé and David Masser to understand Szpiro's conjecture,. and was then shown to be equivalent to the modified Szpiro's conjecture."]}]}}