{"wiki_id": "http://www.wikidata.org/entity/Q6877025", "itemLabel": "Miss Martindale", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Miss_Martindale", "wikipedia_page": {"main": "Marianne Martindale (Catherine Tyrell, Mari de Colwyn, Mary Scarlett) is an English writer and columnist. As Miss Martindale, she was a prominent public face of Aristasia, an all-female subculture inspired by the Traditionalist School and early twentieth-century culture.", "link_mentions": [{"page": "The Chap", "response": ["Notable contributors to The Chap include Michael \"Atters\" Attree who conducts interviews with those known for their gentlemanly or dandyish ways, and Miss Martindale, a prominent spokesperson of Aristasia, who from 2003 to 2005 wrote the Ladies' Column. Its current literary editor is the author and historian Alexander Larman."]}, {"page": "Martindale", "response": ["* Miss Martindale, disciplinarian, columnist, and author, representative of Aristasia"]}, {"page": "Aristasia", "response": ["#REDIRECT Miss Martindale"]}, {"page": "Marianne Martindale", "response": ["#REDIRECT Miss Martindale"]}, {"page": "Aristasian", "response": ["#REDIRECT Miss Martindale"]}, {"page": "Aristasians", "response": ["#REDIRECT Miss Martindale"]}, {"page": "Silver Sisterhood", "response": ["The Silver Sisterhood was a new religious movement that was active in Burtonport, County Donegal, Ireland from 1982 to 1992. The group has also been referred to as the Rhennish Community and St. Bride's. English writer Miss Martindale was a prominent member. The community is known for creating early text adventure video games such as The Snow Queen and Jack the Ripper.", "Later in the 1980s members began to wear full Victorian era outfits on a regular basis and to style themselves as Romantics. In 1984 the house was re-christened as St. Bride's, after the 5th century Irish abbess and miracle worker (see: Brigid of Kildare). Visitors to St. Bride's were offered various courses including peat cutting and the experience of attending a Victorian boarding school. The school was advertised in various publications including the Observer, the Sunday Times, Girl About Town and the theatre programme of the play Daisy Pulls It Off. Daily Telegraph writer Candida Crewe likened the house to a Gothic novel where \"a single candle flickered behind a lace curtain, guests were invited into a parlour heated only by a feeble coal fire, and the mistress of the house greeted her guests wearing a long black dress and white lace collar\". The prospectus offered courses in mathematics, elementary Latin, grammar and literature. Traditional school artefacts such as desks, slates, uniforms, and canes were included in the setting. Despite claims in the press, physical discipline was not part of the school experience for guests. Two women, including Miss Martindale, ran the group in this phase. ", "In line with their espoused Victorian values, anti-modern and elitist views were expressed by St. Bride's in the Victorian phase. Miss Martindale stated that \"some people are meant to rule and others to serve\". The group was involved in the anti-metric system campaign \"Don't Give an Inch\". In a 1988 appearance on The Late Late Show the two leaders of St. Bride's said that they adopted Victorian dress because they liked it and it was their way of being creative."]}]}}