{"wiki_id": "http://www.wikidata.org/entity/Q6880802", "itemLabel": "Mitch Benn", "itemDescription": "British musician and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Mitch_Benn", "wikipedia_page": {"main": "Mitchell John Benn (born 20 January 1970) is an English comedian, author and musician known for his comedy rock songs performed on BBC radio. He was, until 2016, a regular contributor to BBC Radio 4's satirical programme The Now Show, and has hosted other radio shows.\nBenn has performed at several music festivals, and at the Edinburgh Festival Fringe. He has also released seven studio albums. His first science fiction novel, entitled Terra, was published in July 2013 by Gollancz.", "link_mentions": [{"page": "Doctor Who", "response": ["Versions of the \"Doctor Who Theme\" have also been released as pop music over the years. In the early 1970s, Jon Pertwee, who had played the Third Doctor, recorded a version of the Doctor Who theme with spoken lyrics, titled, \"Who Is the Doctor\".Often mistitled \"I am the Doctor\" on YouTube uploads. Originally released as a 7\" vinyl single, plain sleeve, December 1972 on label Purple PUR III In 1978, a disco version of the theme was released in the UK, Denmark and Australia by the group Mankind, which reached number 24 in the UK charts. In 1988, the band The Justified Ancients of Mu Mu (later known as The KLF) released the single \"Doctorin' the Tardis\" under the name The Timelords, which reached No. 1 in the UK and No. 2 in Australia; this version incorporated several other songs, including \"Rock and Roll Part 2\" by Gary Glitter (who recorded vocals for some of the CD-single remix versions of \"Doctorin' the Tardis\"). Others who have covered or reinterpreted the theme include Orbital, Pink Floyd, the Australian string ensemble Fourplay, New Zealand punk band Blam Blam Blam, The Pogues, Thin Lizzy, Dub Syndicate, and the comedians Bill Bailey and Mitch Benn. Both the theme and obsessive fans were satirised on The Chaser's War on Everything. The theme tune has also appeared on many compilation CDs, and has made its way into mobile-phone ringtones. Fans have also produced and distributed their own remixes of the theme. In January 2011, the Mankind version was released as a digital download on the album Gallifrey And Beyond."]}, {"page": "List of British comedians", "response": ["*Mitch Benn (born 1970)"]}, {"page": "Terra", "response": ["* The Terra Trilogy, a series of Young Adult SF novels by Mitch Benn, consisting of Terra (2013), Terra's World (2014) and Terra's War (2021)"]}, {"page": "Zaphod Beeblebrox", "response": ["When Mark Wing-Davey's academic commitments prevented him resuming the role of Zaphod for the 2013 tour of \"The Hitchhiker's Guide to the Galaxy Live Radio Show\", comedian, songwriter and author Mitch Benn was cast in the part."]}, {"page": "List of songs that retell a work of literature", "response": ["* \"My Name Is Macbeth\" by Mitch Benn is Shakespeare's Macbeth reworked in the style of Eminem."]}, {"page": "BBC Radio 4 Extra", "response": ["The Mitch Benn Music Show featured comedy songs introduced by Mitch Benn. The Colin and Fergus' Digi Radio comedy sketch show ran for two series in 20052006. Serious About Comedy was a weekly show presented by Robin Ince in which comedians and comedy critics discussed comedy television, radio, DVDs, and films. Tilt was a satirical look at the week's news of views other than the norm. Knocker was a sitcom about a market researcher, written by and starring Neil Edmond.", "*The Mitch Benn Music Show (Musical comedy)"]}, {"page": "Hugh Dennis", "response": ["Punt and Dennis' radio career includes over a decade of performing Punt and Dennis, It's Been a Bad Week, The Party Line and the satirical radio comedy show, The Now Show. On The Now Show , Dennis is in a line-up including Punt, Mitch Benn, Laura Shavin, Jon Holmes and Marcus Brigstocke. He is friends with Chris Morris and has had cameos on Brass Eye as well as doing the narration for the CBBC show Sam and Mark's Guide To Dodging Disasters."]}, {"page": "Home Taping Is Killing Music", "response": ["The slogan was often parodied, one example being the addendum and it's about time too!, used by Dutch anarcho-punk band The Ex. Some fanzines changed the words to Home taping is killing the music industry and added the words ...so be sure to do your part! below the logo. Another example was the early 1980s counter-slogan Home Taping is Skill in Music, referring to early mixtapes, a precursor to sampling and remixes. The cassette & crossbones image was displayed briefly as a backdrop in the \"Time Out for Fun\" video by the band Devo from their 1982 album, Oh, No! It's Devo. Venom's 1982 album Black Metal used the logo with the words Home Taping Is Killing Music; So Are Venom. The phrase Home-Taping Is Making Music appears on the back cover of Peter Principle's self-produced 1988 album Tone Poems. The American punk band Rocket from the Crypt sold T-shirts with the tape and bones and the words \"Home Taping Is Killing the Music Industry: Killing Ain't Wrong.\" Sonic Youth has T-shirts with the cassette and \"Sonic Youth\" written under it. The cover of Billy Bragg's album Workers Playtime featured a notice reading \"Capitalism is killing music – pay no more than £4.99 for this record\". Mitch Benn also comments \"Home taping isn't killing music, music's dying of natural causes\" in the song \"Steal This Song\" on the album Radioface."]}, {"page": "Answer song", "response": ["*Mitch Benn's \"Not Everybody Has to Imagine\" (2008) is a reply to John Lennon's \"Imagine\" (1971)."]}, {"page": "The Now Show", "response": ["The Now Show is a British radio comedy broadcast on BBC Radio 4, which satirises the week's news. The show is a mixture of stand-up, sketches and songs hosted by Steve Punt and Hugh Dennis. The show used to feature regular appearances by Jon Holmes, Laura Shavin (earlier series had Emma Kennedy, or occasionally Sue Perkins, for the female voices), a monologue by Marcus Brigstocke, and music by Mitch Benn, Pippa Evans or Adam Kay, but now features a much wider range of contributors.", "The programme is recorded in front of a studio audience on the Thursday evening before the Friday broadcast. On Friday 22 July 2005, The Now Show was broadcast without a studio audience due to the attempted 21 July 2005 London Bombings. The show's then regular venue, The Drill Hall was close to the site of one of the failed bomb attacks and had been cordoned off by police; as such the show had to be recorded in the Radio 4 studios at Broadcasting House. Hugh Dennis opened the show with the words \"with us are Laura Shavin, Jon Holmes, Marcus Brigstocke and Mitch Benn... and no audience\"."]}, {"page": "Steve Punt", "response": ["Punt has worked more as a writer, script editor and voice-over artist in recent years, though he has also performed with Dennis in It's Been a Bad Week for BBC Radio 2. The pair are also the main presenters and writers of BBC Radio 4's The Now Show and the writers of Radio 4 sitcom The Party Line. Punt, with Mark Tavener, is co-writer of the 2007 Radio 4 series His Master's Voice. He also, with the help of Hugh Dennis, Jon Holmes, Marcus Brigstocke and Mitch Benn wrote The Now Show Book of World Records, a follow-up book for The Now Show."]}, {"page": "List of people from Merseyside", "response": ["* Mitch Benn: Comedian and songwriter, known for his work on BBC Radio 2 and 4."]}, {"page": "Ken Bruce", "response": ["Soon after, while duetting with Steve Wright's 'Ask Elvis' (a.k.a. Mitch Benn), Bruce recorded a version of the Andy Stewart song “Donald, Where’s yer Troosers?” for the Bandaged CD to raise money for the charity BBC Children in Need. This was released as a download."]}, {"page": "Jon Holmes", "response": ["Holmes's first book, Status Quo and the Kangaroo, was published in hardback by Penguin May 2007 and has since been published in Australia, Canada, the US and India and has been translated into Russian. The paperback Rock Star Babylon was published in the UK in September 2008. 2009 saw the publication of another book, The Now Show Book of World Records, which Holmes co-wrote with Steve Punt and Hugh Dennis. He also co-wrote (with Mitch Benn) The History of the World Through Twitter, described as \"hundreds of characters from history tweeting each other in 140 characters or less – as if Twitter had existed since the dawn of time.\". Both books were published in October 2009."]}, {"page": "Comedy rock", "response": ["In Britain during the 1950s and early 1960s comedians such as Charlie Drake and the Goons frequently appeared in the top ten with humorous rock 'n' roll records—the latter, along with Lewis Carroll and Edward Lear, were to influence the word-play of John Lennon's lyrics. Later British groups specialised in comedy: these included the Scaffold, the Bonzo Dog Doo-Dah Band and Alberto y Lost Trios Paranoias. Later in Britain, in the 2000s, Mitch Benn released several studio albums that satirised current affairs using various musical genres, but mainly rock. His 2012 Breaking Strings album was critically acclaimed for its rock sensibility."]}, {"page": "The Hitchhiker's Guide to the Galaxy Tertiary to Hexagonal Phases", "response": [":*Information Creature: Mitch Benn", ":*Left Brain/Thor: Mitch Benn"]}, {"page": "Ham, London", "response": ["*Mitch Benn, musician, comedian and author, lives in Ham."]}, {"page": "The Hitchhiker's Guide to the Future", "response": ["On Saturday 14 March 2015, Mitch Benn presented a programme called Did Douglas Get It Right? which reviewed how accurate the predications from the year 2000 were."]}, {"page": "Jammin' (radio programme)", "response": ["*Mitch Benn - bass and guitar"]}, {"page": "Emma Kennedy", "response": ["Between 2001 and 2003, she narrated the Channel 4 house relocation property series Home from Home. In Autumn 2020 Emma was a member of the Walruses in Series 16 of the BBC Two quiz show Only Connect alongside musical satirist Mitch Benn and Mastermind finalist Dan Adler. Her team reached the quarter-final round, but were eliminated in the 17th episode of the series broadcast on 11 January 2021."]}, {"page": "Robin Ince", "response": ["He co-starred with Mitch Benn and Alfie Joey in the BBC Radio 4 series Mitch Benn's Crimes Against Music.", "* 2003-6: Writer/performer/Morrissey/John Peel/Satan, Mitch Benn's Crimes Against Music (BBC Radio 4)"]}, {"page": "Improverts", "response": ["*Mitch Benn (The Now Show, Mitch Benn's Crimes Against Music)"]}, {"page": "Doctor Who fandom", "response": ["Comedian and singer Mitch Benn's 2002 album Radio Face features a song entitled \"Doctor Who Girl\". The song talks about how the singer would like to find a girlfriend who is like the female companions of Doctor Who."]}, {"page": "Mitch", "response": ["*Mitch Benn (born 1970), English comedian and satirist, known for his musical parodies"]}, {"page": "Too Late to Cancel", "response": ["Too Late To Cancel is the third album by Mitch Benn, released in 2004 under the name of 'Mitch Benn and The Distractions' and featuring his backing band composed of Kirsty Newton (of Siskin) and Tasha Baylis (of Hepburn). All songs were written by Mitch Benn. Several had previous versions feature in the radio shows The Now Show, It's Been a Bad Week and Mitch Benn's Crimes Against Music.", "Category:Mitch Benn albums"]}, {"page": "Bedlam Theatre", "response": ["* Mitch Benn (The Now Show, Mitch Benn's Crimes Against Music)"]}, {"page": "List song", "response": ["*\"I'm Proud of the BBC\" (Mitch Benn)"]}, {"page": "Benn", "response": ["* Mitch Benn (born 1970), British musician and stand-up comedian "]}, {"page": "The Adventures of Greggery Peccary", "response": ["The piece was also performed at the 25th night of the BBC Proms in 2013 together with \"G-spot tornado\" from The Yellow Shark in the Royal Albert Hall, the same venue from which Zappa was banned from performing 41 years earlier.Prom 25: Zappa – The Adventures of Greggery Peccary from BBC, accessed 14 Aug 2013. The performance featured Mitch Benn as the narrator and Christopher Purves as Greggery, dressed in a pink pig costume."]}, {"page": "Nicholas Pegg", "response": ["Nicholas Pegg is the co-creator of the 2017 concept album Decades, a collaboration with songwriter David Palfreyman which features a cast of notable actors, singers and musicians, including David Warner, Richard Coyle, Jacqueline Pearce, Jan Ravens, Simon Greenall, Edward Holtom, Sarah Jane Morris, Cassidy Janson, Mitch Benn, Jessica Lee Morgan, Ian Shaw, Gary Barnacle, Greg Hart, Terry Edwards and Martyn Barker. In April 2018 he appeared with David Palfreyman on the Vintage TV show The Vintage TV Sessions, introducing a live session by the Decades band, having previously presented a 2017 edition of the same channel's video jukebox show My Vintage, during which he introduced a selection of his favourite music videos and premiered the videos for the Decades singles 'We All Fall Down' and 'Hurting, Sinking'."]}, {"page": "It's Been a Bad Week", "response": ["It’s Been a Bad Week is a British radio comedy on BBC Radio 2, that first broadcast on 11 February 1999. It is presented by Steve Punt and Hugh Dennis, and is also referred to as Punt and Dennis: It's Been a Bad Week. More than 100 episodes have been broadcast , the latest series ending on 22 June 2006. Mitch Benn has since confirmed the show has \"bitten the dust\". It was normally broadcast on Thursdays at 10pm, with each episode being repeated on Saturdays at 1:30pm. The show was recorded the week of broadcast at Ronnie Scott's Jazz Club.", "The show was co-presented by regular guests Mitch Benn, Toby Longworth (Series 6 onwards), Sue Perkins (Series 6 onwards) and Simon Greenall (Series 8 onwards). Past co-presenters have been Mervyn Stutter (Series 1-2), Jon Culshaw (Series 1-5), Emma Clarke (Series 1-5) and Jo Caulfield (Series 6), although these varied in some weeks. One famous guest appearance was Canadian comedy legend Leslie Nielsen (series 3, episode 8). The other contributor to the show was their fictional sound effects man, \"Van Man\", so called because he supplied the sound effects from his white van, \"illegally parked outside Ronnie Scott's.\""]}, {"page": "Godiva Festival", "response": ["* Mitch Benn"]}, {"page": "Comedic genres", "response": ["|Comedy music || A form of alternative comedy where humor is mostly derived from music with (or sometimes without) lyrics || Bill Bailey, Denis Leary, Tim Minchin, Ninja Sex Party, The Lonely Island, Flight Of The Conchords, Les Luthiers, Mitch Benn, Tenacious D, Spinal Tap, Stephen Lynch, \"Weird Al\" Yankovic, Bob Rivers, Bo Burnham, Wayne Brady, the Bonzo Dog Doo-Dah Band, Tiny Meat Gang, Tom Lehrer, Victor Borge, John Valby, Jasper Carrott, Boothby Graffoe, David O'Doherty, Rachel Bloom, Adam Sandler, Allan Sherman, Peter Schickele, Victoria Wood, Jon Lajoie, Dan Bull, Da Vinci's Notebook, Danny Gonzalez"]}, {"page": "Mitch Benn's Crimes Against Music", "response": ["Mitch Benn's Crimes Against Music is a BBC Radio 4 comedy series, taking a satirical look at popular music. It is written by and stars Mitch Benn and Robin Ince. It also features Mitch's group The Distractions (Kirsty Newton and Tash Baylis) and in the first two series Alfie Joey. It began in 2004, and has run for three series so far.", "Crimes Against Music is a 2005 album by Mitch Benn and The Distractions named after and featuring songs from the show, as well as The Now Show and It's Been a Bad Week."]}, {"page": "Crimes Against Music", "response": ["Crimes Against is the fourth album by Mitch Benn, released in 2005 under the name of 'Mitch Benn and The Distractions' and featuring his backing band composed of Kirsty Newton (of Siskin) and Tasha Baylis (of Hepburn). All songs were written by Mitch Benn, and many songs had previous versions feature in the radio shows The Now Show, It's Been a Bad Week and Mitch Benn's Crimes Against Music, which shares a name with the album.", "Category:Mitch Benn albums"]}, {"page": "The One Show", "response": ["* Composer:Mitch Benn"]}, {"page": "The Shuttleworths", "response": ["|6||Matthew Kelly, Mitch Benn, Kevin Gildea||30 March 2000"]}, {"page": "Adam Bromley", "response": ["Specialising in comedy, Bromley has won two Sony Awards for radio. He won Silver Sony Award in 2002 for Think the Unthinkable, a management consultant sitcom written by James Cary. In 2004, he won a Bronze Sony Award for The Now Show, topical comedy show for BBC Radio 4. Bromley's other radio credits include Crème de la Crime, Concrete Cow, The Party Line, The Problem with Adam Bloom, Mitch Benn's Crimes Against Music, Recorded for Training Purposes, Hut 33, Double Science, Clive Anderson's Chat Room and Newfangle.", "He has also directed music videos for Mitch Benn, including \"Everything Sounds Like Coldplay Now\" and \"Happy Birthday War\".", "Bromley has written and directed a feature film called Buried Alive. The cast includes Hugh Dennis, Olivia Colman, Sally Hawkins and Mitch Benn. The film won the Best Feature award 2005 in the Digital Narrative Arts Festival, Canada."]}, {"page": "Leicester Mercury Comedian of the Year", "response": ["* 1998 Mitch Benn, Reginald D Hunter (2nd), TJ Murphy, Mark James, Mary Bourke, Pete Bennett, Johnny Kinch, Jack Mann, Darrel Martin, "]}]}}