{"wiki_id": "http://www.wikidata.org/entity/Q6880885", "itemLabel": "Mitch Hancox", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mitch_Hancox", "wikipedia_page": {"main": "Mitchell John Hancox (born 9 November 1993) is an English professional footballer who plays as a left-back for York City, on loan from National League North club Hereford. He has played in the English Football League for Birmingham City, Crawley Town and Milton Keynes Dons.\nHancox began his career with hometown club Birmingham City, for whom he made his Football League debut in October 2012. In the 2015–16 season, he spent three months on loan to League Two club Crawley Town. Released by Birmingham at the end of that season, Hancox signed for National League club Macclesfield Town in August 2016. After two years, during which he helped Macclesfield win the 2017–18 National League title, he moved on to Milton Keynes Dons. Hancox joined his hometown club Solihull Moors in May 2019, spent time on loan to another National League club, Harrogate Town at the end of that year, and was released in 2021. He then signed for Hereford, and joined York City on loan later that year.", "link_mentions": [{"page": "York City F.C.", "response": ["Note: Flags indicate national team as defined under FIFA eligibility rules. Players may hold more than one non-FIFA nationality. Squad correct as of 27 January 2022.For squad numbers: For Remy Longdon squad number: For Maxim Kouogun squad number and Kingsley James: For Mitch Hancox squad number: For Josh Knowles: For Josh Knowles position: For Josh Knowles nationality: For Kyle Lancaster and Elliot Owen: For Kyle Lancaster position: For Kyle Lancaster nationality: For Elliot Owen position: For Ben Dale: For Ben Dale position: For Ben Dale nationality: For Jack McKay squad number: For Kingsley James squad number: For Kingsley James position and nationality: "]}, {"page": "Lee Clark (footballer)", "response": ["Clark endured a difficult start to his managerial reign, with a draw and two losses in a row for his first three games in the Championship. His first win came against Peterborough but Birmingham suffered a 5–0 home defeat against Barnsley in September. During the January 2013 transfer window, Clark sold Jake Jervis, David Lucas and Jack Butland, who returned on loan for the remainder of the season. Clark struggled to get Birmingham out of the bottom half of the league until back to back wins against Derby County and Middlesbrough took them up to 12th place in March. Despite receiving criticism from fans for alleged poor management skills regarding public fallouts with Nikola Zigic, Clark has been praised for introducing academy players into the first team squad, players including Jack Butland, Will Packwood, Mitch Hancox, Callum Reilly, Koby Arthur and Reece Hales. Clark continued the start of 2013 with his team producing good form, including a 4–0 away win at Crystal Palace and back to back 1–0 wins against Bristol City and Leeds. After finishing the season in 12th place, 7 points off the play-offs, Clark made his first signings for the 2013–14 Championship season with Darren Randolph, Andrew Shinnie and Lee Novak all signing on free transfers, whilst Olly Lee's loan was made permanent. The 2013–14 season started poorly again for Clark, with Birmingham winning a single game in the league against Yeovil Town as the Blues made their worst start to a league season for 25 years. Despite poor results in the league (including an 18 home match run without a league win) and the removal from the coaching staff of Clark's right hand men Derek Fazackerley and Terry McDermott, Clark managed to keep Birmingham City in the Championship with an injury time equaliser from Paul Caddis in the final game of the 2013–14 season against Bolton, the 2–2 result being enough to keep the team up on goal difference."]}, {"page": "Pablo Ibáñez", "response": ["Davies and Caldwell began the 2012–13 season as first choice until an ankle injury sustained by Davies during a League Cup match at Coventry City gave Pablo an early opportunity to impress. He kept his place after Davies returned to fitness, but chipped a bone in his foot in the defeat to Barnsley and was expected to be out for a month. Further injuries, the return to fitness of Caldwell, and the emergence of young left-back Mitch Hancox, which allowed Paul Robinson to partner Davies in the centre, meant that Pablo played only twice more, and he was released at the end of his contract."]}, {"page": "Daniel Jones (footballer)", "response": ["On 19 July 2019, Jones signed a one-year contract with League Two club Cambridge United after a successful trial spell. The \"U's\" had been in search of a new left-back following the departure of Jake Carroll to Motherwell and manager Colin Calderwood felt that Jones had settled in at the Abbey Stadium better than the other trialist left-backs. However he missed three months of the start of the 2019–20 season with a broken foot. On 9 March, Mark Bonner replaced Calderwood as manager, and just two days later a loan deal was arranged for Jones with National League club Solihull Moors. Moors manager James Shan said that \"We have had to tap into the loan market to provide cover for Alex Gudger and Mitch Hancox who both picked up knocks.\" However he was unable to feature for the Moors due to the COVID-19 pandemic in England, and on 29 April Cambridge announced that Jones would be one of nine players to be released by the club at the end of the season."]}, {"page": "Matt Green (footballer)", "response": ["After a trial with Championship club Birmingham City in May 2013, Green signed a two-year contract with the club on 3 July 2013. He scored his first goal for the club against Shamrock Rovers during a pre-season tour of Ireland, but was then knocked unconscious in a challenge and received eight minutes of treatment before being stretchered off. He made his competitive debut in a 1–0 defeat at home to Watford on 3 August, and his first competitive goal for the club opened the scoring in a 3–2 defeat at Leicester City three weeks later. Green scored the second goal, \"a superb right-foot finish at the back post\" from Mitch Hancox's cross, as Birmingham beat holders Swansea City 3–1 in the third round of the League Cup. He started the next three games, without scoring, but was omitted from the matchday squad thereafter. In early November, Green damaged cruciate ligaments in training and was expected to miss the rest of the season. His recovery was beset by complications, and he finally regained fitness towards the end of the 2014–15 season, making appearances for the development squad and scoring in the Birmingham Senior Cup final. The club confirmed he would be released when his contract expired."]}, {"page": "Lyndon School, Solihull", "response": ["*Mitch Hancox"]}, {"page": "John Askey", "response": ["His Macclesfield team beat League One club Walsall in the first round of the FA Cup in 2016–17, becoming the only non-League club to beat an English Football League team in the opening round that season; Askey said \"it is massive as it means we can pay the VAT bill this week\". Macclesfield finished the season in ninth place and also reached the 2017 FA Trophy Final at Wembley Stadium, where they were beaten 3–2 by York City. However many of the squad left at the end of the season as Macclesfield were unable to compete financially with many of their divisional rivals; George Pilkington, Mitch Hancox and Danny Whitaker being some of the few players who remained. Macclesfield endued a difficult season off the pitch during the 2017–18 campaign, as financial problems meant that players went unpaid in January despite the wage bill being one of the lowest in the division. Despite these restrictions, Askey managed to guide Macclesfield to promotion back to the Football League as champions of the National League on a budget of £350,000."]}, {"page": "2012–13 Birmingham City F.C. season", "response": ["October began with a 2–1 defeat at Cardiff City. Lita neatly touched Elliott's free kick home, but Cardiff's goals came from defensive errors: Packwood played them onside for the first, and failure to deal with a corner allowed Mark Hudson to score the winner. New loanee James Hurst made his debut as a second-half substitute. Courtesy of half-price ticket offers, more than 18,000 saw Birmingham lose 1–0 to Huddersfield Town; Žigić was sent off for a high tackle and Mitch Hancox made his competitive debut as substitute for the injured Davies. Clark accused the players of failing to take responsibility, making it clear that he was \"not sitting in the dressing room telling them not to tackle, to pussyfoot around, telling them to mis-place passes. They can't just hide behind me all the time, they've got to come out fighting.\" Butland produced what he described as the best performance of his career and Ravel Morrison, selected for the first time since August after problems with his attitude to training led Clark to consider terminating his loan, was influential as Birmingham narrowly failed to beat league leaders Leicester City. Away to Millwall, Birmingham went 3–0 down in a seven-minute spell in the first half, two of the three scored by former loanee Chris Wood, before Marlon King scored the first hat-trick of his senior career to secure the draw. On his 40th birthday, Lee Clark selected the same starting eleven away at Leeds United, where Lita scored the only goal of the game from .", "!scope=\"row\"|Mitch Hancox"]}, {"page": "Will Packwood", "response": ["Packwood returned to competitive action after less than eight months out, playing the first half of Birmingham's Professional Development League match on August 26. He played a few more times for the development squad, and on October 17 joined League Two (fourth-tier) Bristol Rovers on loan for a month, to improve his match fitness. He made his debut two days later, winning the man-of-the-match award, in a 1–0 loss at home to Wycombe Wanderers. After four matches – he missed Rovers' FA Cup win because Birmingham did not want him cup-tied – the loan was extended until January 11, 2014, on condition that he could be recalled at 24 hours' notice. He played four more matches before Birmingham lost left-back Mitch Hancox to injury, and with fellow defenders Paul Robinson and Dan Burn nearing possible suspensions, Packwood was recalled on December 11."]}, {"page": "Mitchell Hancox", "response": ["#REDIRECT Mitch Hancox"]}, {"page": "Hancox", "response": ["*Mitch Hancox (born 1993), English footballer"]}, {"page": "Koby Arthur", "response": ["Arthur was given squad number 16 ahead of the visit of Sheffield Wednesday on 19 February 2013, but did not make the 18-man matchday squad, and was included in the travelling party for the next match, away at Peterborough United. Amid tabloid reports of interest from Premier League clubs, Arthur signed a two-year professional contract with Birmingham. He made his first-team debut on 1 April in a 3–2 defeat at home to Wolverhampton Wanderers in the Championship, coming on as a 78th-minute substitute for Mitch Hancox. According to the Birmingham Mail's match report, \"he was nimble, showed the odd glimpse\". He made his second and last appearance of the season, also as a late substitute, in Birmingham's next match. At the end-of-season awards ceremony, Arthur was honoured as Academy Player of the Season."]}, {"page": "2013–14 Birmingham City F.C. season", "response": ["Novak converted Hancox's cross to take the lead at home to Doncaster Rovers, but the lowest league attendance of the season, officially announced as 12,663, saw David Cotterill's \"unstoppable 30-yard effort\" give the visitors a draw and take Birmingham's run without a home win to nine weeks. Substitute Chris Burke, a half-time replacement for loan striker Aaron Mclean, played a major role in earning Birmingham a draw at home to Middlesbrough. After Jonathan Woodgate narrowly failed to head past his own goalkeeper, Burke was fouled for a penalty, converted by Caddis to tie the scores. Middlesbrough regained the lead when Birmingham failed to clear a corner, then in the 94th minute Kyle Bartley met Burke's corner with a powerful header to equalise. With Mitch Hancox injured against Middlesbrough and Robinson and Burn nearing suspensions, young defenders Will Packwood and Amari'i Bell were recalled from loan, and Bell was included on the bench, for the visit to AFC Bournemouth. Andy Shinnie's first league goal, from Lee's precise cross, and Žigić's neat finish from Lingard's through ball gave Birmingham a 2–0 win, despite the home side's massive superiority of possession and shots.", "The 2–1 defeat at home to Huddersfield Town – Birmingham's goal came in the 95th minute from Lee's half-volley from a knockdown by Žigić, included in the matchday squad for the first time since the Yeovil defeat – equalled the 50-year-old club record of 11 home league matches without a win. According to the Birmingham Mail reporter, they were \"insipid, weak, lacking drive, cohesion and generated no sort of danger.\"Tattum, Colin (17 February 2014). \"Birmingham City 1 Huddersfield 2\". Birmingham Mail. Retrieved 24 February 2014. Jonathan Spector and Mitch Hancox returned from injury and Robinson replaced Martin at centre half for the visit to Blackpool. After failure to deal with a corner had allowed the home side to open the scoring, Clark brought on Žigić in place of Adeyemi at half-time. After Žigić made a weak attempt to chip the goalkeeper, his knockdown allowed Novak to equalise with a fierce deflected drive. Shortly afterwards, loanee Jordon Ibe replaced Burke, who suffered a head injury when apparently fouled in the penalty area. Jack Robinson, Ibe's Liverpool clubmate, was sent off for bringing him down when his pacy direct run had taken him through on goal, Birmingham took advantage of their extra man and Novak headed the winner from Huws's precise cross.", "!scope=\"row\"|Mitch Hancox"]}, {"page": "Amari'i Bell", "response": ["Bell was given a squad number, and was considered for a defensive role ahead of Birmingham's third round League Cup match against Swansea City on 25 September, with Kyle Bartley ineligible and David Murphy rested after returning only recently from long-term injury. He played no part in the match, not even as an unused substitute, and returned to Nuneaton a couple of days later. Bell re-established himself at left back, playing a further eleven times in the Conference Premier and once in the FA Cup, before Birmingham recalled him again on 9 December after starting left-back Mitch Hancox damaged a knee and with Murphy again unfit."]}, {"page": "2014–15 Birmingham City F.C. season", "response": ["Birmingham, along with all first- and second-tier teams, entered the competition at the third-round (last-64) stage. They were drawn to visit the lowest-ranked team remaining in the competition, former giant-killer Blyth Spartans of the seventh-tier Northern Premier League. Rowett made ten changes from the side that beat Nottingham Forest, only acting captain Michael Morrison keeping his place. Mitch Hancox, included in the matchday squad for the first time this season, started at left back. Žigić, making his first start since rejoining the club, had an early goal disallowed because of Morrison's foul, and then missed a clear chance from six yards. After Doyle's clearance rebounded just wide of his goal off the nearest Blyth player, home captain Robbie Dale scored twice when Birmingham's defence failed to cope with determined dribbling, and a fine save from Doyle kept the half-time lead down to two. After the break, Birmingham took the lead when a more positive approach led to three goals in a seven-minute spell, one from Novak and two by Thomas. Blyth had more chances, but Birmingham held on.", "!scope=row|Mitch Hancox"]}, {"page": "2015–16 Birmingham City F.C. season", "response": ["| 30 June 2016 || Mitch Hancox || (Macclesfield Town) || Released", "| 2 October 2015 || Mitch Hancox || Crawley Town || 2 January 2016", "!scope=row|Mitch Hancox"]}, {"page": "2015–16 Crawley Town F.C. season", "response": ["|2 October 2015||DF||Mitch Hancox||Birmingham City||2 January 2016||"]}]}}