{"wiki_id": "http://www.wikidata.org/entity/Q6880915", "itemLabel": "Mitch Johnson", "itemDescription": "British announcer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mitch_Johnson_(announcer)", "wikipedia_page": {"main": "Mitchel Johnson (born 21 August 1966) is a British television and radio presenter. He is also the voice for many advertising campaigns in the UK and around the world. Johnson is best known for his work on Virgin Radio, Capital Radio and BBC TV.\nJohnson joined Live & Kicking at the start of series 3 as the voice-over man who lived in the cupboard and was never seen on air. His voice was already well known with listeners to Virgin Radio where he presented a show of his own. His voice has since featured on several other BBC shows including Friends Like These, Children in Need, The National Lottery, Record Breakers and Comic Relief and on the video game International Superstar Soccer Pro 98 as the match commentator.\nJohnson's voice was heard announcing the Hyde Park acts at Live 8 in 2005.\nHe has been heard on the BBC One programme Tonight's the Night with former Live & Kicking colleague John Barrowman. Johnson can still be heard on many radio stations in the UK as the main station voice, as well as presenting on The Coast.\n\n", "link_mentions": [{"page": "Capital London", "response": ["*Mitch Johnson"]}, {"page": "Absolute Radio", "response": ["The station launched as Virgin 1215 at 12.15 pm on 30 April 1993. The original line-up of DJs included Richard Skinner, Russ Williams, Jono Coleman, Mitch Johnson, Graham Dene, Nick Abbot, Wendy Lloyd, Tommy Vance, Emperor Rosko and Dave Fanning. Chris Evans was also hired to present a Saturday morning show, following his success at BBC GLR in the weekend mid-morning slot. The Show, The Big Red Mug Show was sponsored by Nescafe. The first song was a cover version of the Steppenwolf song \"Born to be Wild\", recorded by Australian group INXS. Richard Branson was the first voice to be heard, live from the Virgin Megastore in Manchester, with Richard Skinner the first voice back in the London studios. Skinner was also programme director, a role he shared with John Revell. John Pearson was launch sales director, a role he had previously held at LBC . Andy Mollett was launch finance director. David Campbell, previously managing director of one of Virgin's post-production television companies, was the chief executive at launch.", "Virgin Radio's original line-up included Russ Williams, Richard Skinner, Mitch Johnson, Tommy Vance, Jonathan Coleman and Nick Abbot."]}, {"page": "Live & Kicking", "response": ["The first series featured the computerised head of a cat named \"Ratz\" announcing links, but this was dropped after one series. It was replaced by human announcer Mitch Johnson, who, as well as providing commentary and links for each item, would interact with both the audience and the presenters too. From the second series, two puppet leprechauns, later named as Sage and Onion, became regulars. They were played by Don Austen and John Eccleston, and were designed and built by Darryl Worbey Studios. They performed comedy sketches throughout the morning, and often interacted with the people in the studio. Another comedy character who first appeared in the third series was Mr Blobby, who had previously appeared in Noel's House Party. Most regular features were dropped for the final series, when the show was revamped. A feature that stuck throughout was the jingle for the phone number, first 081 811 8181, then 0181 811 8181, then 0845 610 1515."]}, {"page": "102.2 Smooth FM", "response": ["The station's jingle package was produced by Bespoke and voiced by Mitch Johnson."]}, {"page": "Mitchell Johnson (disambiguation)", "response": ["*Mitch Johnson (born 1942), American football player", "*Mitch Johnson (announcer) (born 1966), British television and radio presenter"]}, {"page": "Big Game TV", "response": ["*Mitch Johnson (announcer)"]}, {"page": "List of Live 8 artists", "response": ["*Andi Peters, Andy Townsend, Anouschka Menzies, Barry Killerby, David Beckham, Denis Irwin, Don Austen, Emma Ledden, Emma Forbes, Frank Stapleton, Gareth Southgate, Gary Lineker, Gary McFadden, Harriet Thorpe, Harrison Oldroyd, Heather Suttie, Geoff Hurst, George Cohen, Jack Charlton, Jamie Theakston, Jason McAteer, Jill Greenacre, John Aldridge, John Barrowman, John Eccleston, Julia St. John, Katy Hill, Kenny Cunningham, Kevin Keegan, Kevin Moran, Martin Peters, Matt Le Tissier, Mike Burns, Mitch Johnson, Norman Hunter, Ortis Deley, Packie Bonner, Peter Shilton, Peter Simon, Pippa Haywood, Ray Houghton, Ron Atkinson, Ron Harris, Ronnie Whelan, Russell Porter, Sarah Cawood, Stephen Churchett, Steve Staunton, Steve Wilson, Thomas Sangster, Tim Marriott, Trevor and Simon, Trey Farley & Zoe Ball."]}]}}