{"wiki_id": "http://www.wikidata.org/entity/Q689348", "itemLabel": "Adam Holloway", "itemDescription": "British soldier, journalist and Conservative Party politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Holloway", "wikipedia_page": {"main": "Adam James Harold Holloway (born 29 July 1965) is a British Conservative Party politician. He has been the Member of Parliament (MP) for Gravesham since 2005. He currently serves on Foreign Affairs Select Committee, and has previously served as a member of the Defence Select Committee, and Science and Technology Select Committee. He also served for a time as Deputy Chairman of the Conservative Middle East Council. He has been a vocal supporter of pro-Brexit lobby group Leave Means Leave.Before he was a Member of Parliament, he served in the British Army's Grenadier Guards for five years, serving in Iraq and Germany. After serving in the army he was a reporter for ITN and ITV where he produced the award-winning program called \"No Fixed Abode\" (1991), in which he spent three months homeless on the streets of London.", "link_mentions": [{"page": "July 29", "response": ["*  1965   – Adam Holloway, English captain and politician"]}, {"page": "September Dossier", "response": ["It is also claimed by Adam Holloway MP that \"When the information was acquired by MI6, a footnote was written on the page of an intelligence report sent to No 10 stating that the claim was 'verifiably inaccurate'.\""]}, {"page": "Gravesend", "response": ["* Adam Holloway (born 1965), local Member of Parliament (MP) since 2005, lives on Darnley Road in the town."]}, {"page": "Julian Lewis", "response": ["As part of the events marking the centenary of World War I, he delivered a lecture on Politics and the First World War in May 2015, and in November that year, together with fellow MP Adam Holloway, he wrote to all members of the House of Commons welcoming the proposal to bomb ISIL/DAESH – rather than the Syrian Government forces – as a \"step in the right direction\", but opposing any air campaign in the absence of a realistic strategy on the ground."]}, {"page": "Chris Pond", "response": ["Pond introduced a Private Members Bill, the Employment of Children Bill in 1998, which subsequently led to greater protection for children at work.  He successfully campaigned with the Marchioness Action Group for a Public Inquiry into the sinking of the Marchioness, for greater safety measures and for the introduction of lifeboats on the Thames.  At the May 2005 general election, he lost his seat in Parliament to the Conservative Party candidate, Adam Holloway, who secured a majority of 654."]}, {"page": "World in Action", "response": ["World in Action helped to pioneer the technique of using covert cameras, not just in investigative work but also in social documentary, including, from the earliest days, the treatment of gypsies, the old in care (\"Ward F13\") and poverty in England. The arrival of high-quality miniature cameras allowed ambitious projects such as Donal MacIntyre's award-winning programmes in October 1996 on the illegal drug trade, and the future Conservative MP Adam Holloway's disturbing reports on the reality of life among the homeless in 1991. In 1998 World in Action took advantage of the new technology to equip an entire house with secret cameras hidden in anything from coke tins to fish tanks to catch out shoddy builders. The success of the two-part series called House of Horrors, produced by Kate Middleton, led not only to the ITV series House of Horrors and to the BBC's Rogue Traders but to a whole new genre of programming, around the world, based around hidden camera footage of dodgy tradesmen.", "Unusually for a current affairs programme, WIA's standard format was as a voice-over documentary without a regular reporter although a handful of WIA journalists did appear in front of camera, including Chris Kelly, Gordon Burns, John Pilger, Gus Macdonald, Nick Davies, Adam Holloway, Stuart Prebble (who later became the programme's editor), Mike Walsh, David Taylor, Donal MacIntyre and Granada Reports journalist and Factory Records supremo Tony Wilson who became the show's first in-vision anchor in the early 80s. Guest presenters were used on rare occasions, among them Jonathan Dimbleby, Sandy Gall, Martyn Gregory, Sue Lawley and Lynn Faulds Wood. Perhaps its most celebrated guest presenter was the distinguished American anchorman Walter Cronkite, who came out of retirement to cover the 1983 UK general election for the series.", "Although in its early days World in Action was reputed never to employ anyone who was on first-name terms with any politician, a number of subsequent British parliamentarians have World in Action on their curricula vitae. The most recent is the Conservative MP Adam Holloway, elected to the House of Commons in 2005. The former British cabinet minister Jack Straw worked on World in Action as a researcher, as did Margaret Beckett who served as Tony Blair's last Foreign Secretary. Chris Mullin, Labour MP for Sunderland South from 1987 to 2010, played a major role in the programme's campaign on behalf of the Birmingham Six. Gus Macdonald, now Baron Macdonald of Tradeston, and from 1998 to 2003 a government minister, was formerly an executive on the programme. John Birt (by then ennobled as Baron Birt), was personal adviser to the British Prime Minister Tony Blair between 2001 and 2005."]}, {"page": "Jacques Arnold", "response": ["Unlike many of his fellow former Tory MPs, he refought the seat at the 2001 election - only to come second place to Labour's Chris Pond. The Tories regained the seat in 2005 with Adam Holloway becoming the MP, the first time since the 1951 general election that the seat had not been held by the winning party."]}, {"page": "Anna Span", "response": ["Arrowsmith was the Liberal Democrat candidate for Gravesham in Kent for the 2010 United Kingdom general election. Conservative Adam Holloway held on to the seat by a considerable margin; Arrowsmith increased the Liberal Democrat vote share by nearly one third compared to the previous Lib Dem election results and by more than the regional average, but remained in third place behind Labour."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Gravesham || Adam Holloway || Conservative || Chris Pond || Labour"]}, {"page": "Gravesham (UK Parliament constituency)", "response": ["Gravesham  is a constituency in Kent represented in the House of Commons of the UK Parliament since 2005 by Adam Holloway, a Conservative.", "The constituency and its predecessor together was considered a bellwether seat: from World War I until 2005 with the exceptions of the General Elections in 1929 Election and 1951, its winner came from the winning party. In 2005 Adam Holloway was one of 36 Conservative candidates to gain a seat from other parties, and has held the seat since then. Since the 2005 result conflicted with the UK outcome, the seat is regarded as having lost its bellwether status.", "| Adam Holloway"]}, {"page": "2005 United Kingdom general election", "response": ["|Adam Holloway"]}, {"page": "List of Parliamentary constituencies in Kent", "response": ["|Adam Holloway †"]}, {"page": "Cranleigh School", "response": ["* Adam Holloway (MP, politician, journalist, soldier)"]}, {"page": "List of United Kingdom MPs: H", "response": ["*Adam Holloway"]}, {"page": "Cornerstone Group", "response": ["|Adam Holloway || Gravesham || 2005"]}, {"page": "Gravesend Grammar School", "response": ["The Sixth Form currently contains approximately 300 students, studying A Levels in a variety of subjects. Each week there is a \"General Education\" session for the Lower Sixth, attracting various speakers, such as local MP Adam Holloway or, for example, representatives from Israeli and Palestinian Support Charities. The school also provides free \"Driveability\" sessions for the Year 12 students that outline the various risks and responsibilities of learning to drive. There are several extracurricular clubs specifically for the Sixth Form, including an A+ computing course, and a Film Club."]}, {"page": "Public Administration and Constitutional Affairs Select Committee", "response": ["| Adam Holloway MP (Conservative)"]}, {"page": "Defence Select Committee", "response": ["| Adam Holloway"]}, {"page": "Home Affairs Select Committee", "response": ["|Adam Holloway"]}]}}