{"wiki_id": "http://www.wikidata.org/entity/Q6904063", "itemLabel": "Montagu Corry, 1st Baron Rowton", "itemDescription": "British baron", "wikipedia_url": "https://en.wikipedia.org/wiki/Montagu_Corry,_1st_Baron_Rowton", "wikipedia_page": {"main": "Montagu William Lowry-Corry, 1st Baron Rowton,  (8 October 1838 – 9 November 1903), also known as \"Monty\", was a British philanthropist and public servant, best known for serving as Benjamin Disraeli's private secretary from 1866 until the latter's death in 1881.", "link_mentions": [{"page": "Queen Victoria", "response": ["Between April 1877 and February 1878, she threatened five times to abdicate while pressuring Disraeli to act against Russia during the Russo-Turkish War, but her threats had no impact on the events or their conclusion with the Congress of Berlin.Longford, pp. 412–413 Disraeli's expansionist foreign policy, which Victoria endorsed, led to conflicts such as the Anglo-Zulu War and the Second Anglo-Afghan War. \"If we are to maintain our position as a first-rate Power\", she wrote, \"we must ... be Prepared for attacks and wars, somewhere or other, CONTINUALLY.\"Longford, p. 426 Victoria saw the expansion of the British Empire as civilising and benign, protecting native peoples from more aggressive powers or cruel rulers: \"It is not in our custom to annexe countries\", she said, \"unless we are obliged & forced to do so.\"Longford, p. 411 To Victoria's dismay, Disraeli lost the 1880 general election, and Gladstone returned as prime minister.Hibbert, pp. 367–368; Longford, p. 429; Marshall, p. 186; St Aubyn, pp. 442–444; Waller, pp. 428–429 When Disraeli died the following year, she was blinded by \"fast falling tears\",Letter from Victoria to Montagu Corry, 1st Baron Rowton, quoted in Hibbert, p. 369 and erected a memorial tablet \"placed by his grateful Sovereign and Friend, Victoria R.I.\"Longford, p. 437"]}, {"page": "Earl Belmore", "response": ["Several other members of the Lowry-Corry family have also gained distinction. The Conservative politician the Honourable Henry Lowry-Corry, First Lord of the Admiralty from 1866 to 1867, was the second son of the second Earl. His younger son was Montagu Corry, 1st Baron Rowton, private secretary to Benjamin Disraeli. The Honourable Armar Lowry-Corry (1836–1919), second son of the third Earl, was an admiral in the Royal Navy. The Honourable Henry Lowry-Corry, younger son of the third Earl, was also a politician."]}, {"page": "Henry Lowry-Corry (1803–1873)", "response": ["*Montagu Corry, 1st Baron Rowton (8 October 1838 – 9 November 1903), who was Private Secretary to Prime Minister Benjamin Disraeli and was created Lord Rowton in 1880."]}, {"page": "Monty", "response": ["*Montagu Corry, 1st Baron Rowton (1838–1903), British philanthropist and public servant, longtime private secretary to Benjamin Disraeli"]}, {"page": "Baron Rowton", "response": ["#Redirect Montagu Corry, 1st Baron Rowton"]}, {"page": "Henry Manners, 8th Duke of Rutland", "response": ["*Lady Violet Catherine Manners (1888–1971), rumored to be fathered by Montagu Corry, 1st Baron Rowton. She married firstly, Hugo Charteris, Lord Elcho, son of Hugo Charteris, 11th Earl of Wemyss and had issue, David Charteris, 12th Earl of Wemyss. She married secondly, Guy Benson."]}, {"page": "Montague William Lowry-Corry, Baron Rowton", "response": ["#redirect Montagu Corry, 1st Baron Rowton"]}, {"page": "List of Old Harrovians", "response": ["*Montagu Corry, 1st Baron Rowton (1838–1903), Private Secretary to the Prime Minister of the United Kingdom (1868–1868; 1874–1880)"]}, {"page": "Montagu Corry", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Disraeli (TV serial)", "response": ["*Patrick Drury   - as Montagu Corry, 1st Baron Rowton"]}, {"page": "Montagu William Lowry Corry", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Montagu William Lowry-Corry, 1st Baron Rowton", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Montague William Corry", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "MW Corry", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton "]}, {"page": "Violet Manners, Duchess of Rutland", "response": ["At the age of 26, she married Henry Manners on 25 November 1882. He was the only son and heir of John Manners, 7th Duke of Rutland. Husband and wife had little in common; the handsome Henry was a political Conservative whilst Violet was described as \"bohemian\". She provided him with two male heirs, but her second and third daughters were possibly fathered by others: Lady Violet by Montagu Corry, 1st Baron Rowton and Lady Diana by Harry Cust. The couple also moved in different social circles, as he enjoyed hunting and she pursued more intellectual interests."]}, {"page": "Montague Corry, 1st Baron Rowton", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Montague Corry", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Cropley Ashley-Cooper, 6th Earl of Shaftesbury", "response": ["Lord Shaftesbury married Lady Anne, daughter of George Spencer, 4th Duke of Marlborough, on 10 December 1796. They had ten children. Their second daughter Lady Harriet Anne married Henry Lowry-Corry and was the mother of Montagu Corry, 1st Baron Rowton. Their fifth and penultimate son, Anthony Francis Ashley Cooper (1810–25), while at Eton was killed in a pugilistic contest. Two of Shaftesbury's other sons were Anthony Henry Ashley-Cooper and Anthony William Ashley."]}, {"page": "Rowton", "response": ["*Montagu Corry, 1st Baron Rowton, Victorian philanthropist"]}, {"page": "Rowton Castle", "response": ["The present castle was built in the 17th century, although a previous castle had stood on the site for several hundred years. The house was in the possession of the Lyster family until the death of Lady Charlotte Lyster, in 1889. She passed the house to her nephew, Montagu Corry, 1st Baron Rowton, who in turn passed it on to his nephew, Colonel N. A. Lowry Curry following his death in 1903. The house's next owner, Major Lees, sold it to the Royal Normal College for the Blind in 1941. The college, which had previously been located in London, was forced to find new premises after its site, based in Upper Norwood, was bombed during the Blitz, then acquired by the authorities. The college used the castle itself as the accommodation block for staff and senior pupils. The building also housed the dining areas for both junior and senior pupils. Classrooms, which have since been converted into private apartments, were built to the eastern side of the building."]}, {"page": "Lord Rowton", "response": ["#REDIRECT Montagu Corry, 1st Baron Rowton"]}, {"page": "Corry (surname)", "response": ["*Montagu Corry, 1st Baron Rowton (1838–1903), British philanthropist and public servant, longtime private secretary to Benjamin Disraeli"]}, {"page": "1900 New Year Honours", "response": ["* Montagu Corry, 1st Baron Rowton, KCVO, CB"]}, {"page": "Lady Violet Benson", "response": ["Violet Catherine 'Letty' Manners was born on 24 April 1888 to Henry Manners, then Marquess of Granby, later 8th Duke of Rutland, and his wife, Violet, an aristocrat and artist.  She was the fourth of the five children they raised together. Due to her mother's alleged affair with Montagu Corry, 1st Baron Rowton, Violet was rumored to be fathered by Rowton."]}]}}