{"wiki_id": "http://www.wikidata.org/entity/Q6912040", "itemLabel": "Morggán, Earl of Mar", "itemDescription": "12th century Scottish noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Morgg%C3%A1n,_Earl_of_Mar", "wikipedia_page": {"main": "Morggán of Mar is the first Mormaer or Earl of Mar to appear in history as \"more than a characterless name in a witness-list.\". His father was Gille Chlerig. He is often known as Morgrund or Morgan.\nIt is possible that Morggán participated in the so-called Revolt of the Earls, a protest by some of the native Scottish nobility at King Máel Coluim IV's trip to France as a vassal of King Henry II of England. \nIt is also possible that he became estranged from the French-speaking king William I, as Morggán's name appears in no royal acts of the latter king's reign. \nHe married Agnes, a patroness of churches. Agnes was probably related to the de Warenne family - the family who married Ada de Warenne to Henry of Scotland and mother of Kings Malcolm IV and William the Lion. Morggán and Agnes had at least one son, Donnchad, who eventually succeeded to become a Mormaer of Mar. Morggán had another two sons, Máel Coluim and James, but they may have been illegitimate - i.e. the product of an uncanonical marriage acceptable in the Celtic system, but not in the Franco-Roman system then gaining favour in Scotland. \nHe went on to marry Orabilis FitzNess de Leuchars divorced wife of Sir Robert de Quincy Justiciar of Lothian, who with her first husband was the mother of Saher de Quincy. Orabilis survived Morggán, and married thirdly Adam of Fife, brother of Duncan II, Earl of Fife.\nHis daughter Alesta of Mar was married to Alan Fitzwalter, 2nd High Steward of Scotland who was possibly mother to Walter Stewart, 3rd High Steward of Scotland.\nHe appears in royal charters dated as early as 1147. He is attested in the documents for the last time in 1178, and was dead by 1183.", "link_mentions": [{"page": "Earl of Mar", "response": ["*Morggán, Earl of Mar (died before 1183)"]}, {"page": "List of peers 1140–1149", "response": ["|Morggán, Earl of Mar||Abt. 1140||Abt. 1178||"]}, {"page": "List of peers 1150–1159", "response": ["|Earl of Mar (1114)||Morggán, Earl of Mar||Abt. 1140||Abt. 1178||"]}, {"page": "List of peers 1160–1169", "response": ["|Earl of Mar (1114)||Morggán, Earl of Mar||Abt. 1140||Abt. 1178||"]}, {"page": "List of peers 1170–1179", "response": ["|rowspan=2|Earl of Mar (1114)||Morggán, Earl of Mar||Abt. 1140||Abt. 1178||Died"]}, {"page": "Donnchad I, Earl of Fife", "response": ["* Adam of Fife. In 1163 or 1164, 'Adam, son of the Earl' witnessed the confirmation by Richard, Bishop of St. Andrews. His name occurs third in a list of sixteen witnesses (Reg Prior St. Andrews, No 137). He may have been 'Adam, son of Duncan', who, with Orabilis his wife, witnessed about 1172, the grant of the church of Lochres (Lewchars) by Nes, the son of William, to the church of St. Andrews. His wife Orabilis had previously been the wife of Sir Robert de Quincy, from whom she was probably divorced, and she married, secondly, Morggán, Earl of Mar.http://fmg.ac/Projects/MedLands/SCOTTISH%20NOBILITY.htm#AdamFifediedafter1203 Medieval Lands Project on Adam of Fife"]}, {"page": "Morgund, 2nd Earl of Mar", "response": ["#redirect Morggán, Earl of Mar"]}, {"page": "Morgrund of Mar", "response": ["#redirect Morggán, Earl of Mar"]}, {"page": "Morggán of Mar", "response": ["#REDIRECT Morggán, Earl of Mar"]}, {"page": "Alan fitz Walter, 2nd High Steward of Scotland", "response": ["By his second marriage to Alesta, daughter of Morggán, Earl of Mar"]}, {"page": "Morgan (given name)", "response": ["The male and female names may not be the same name in origin. The male name is a descendant of Old Welsh Morcant, possibly derived from môr (meaning \"sea\") and \"cant\" (the circle) or \"gen\" (come / origin) with the meaning: \"sea chief\", \"sea protector\", \"sea defender\" or \"sailor/captain\" or \"born of / on the sea\" or \"belonging to the circle of the sea\". In his original spelling of Morggan we find Morggán, Earl of Mar the first Mormaer or count de Mar.", "*Morggán, Earl of Mar, first Mormaer or Earl of Mar he appears in royal charters dated as early as 1147. He is attested in the documents for the last time in 1178, and was dead by 1183. ", "*Morggán, Earl of Mar, 12th century Scottish nobleman"]}, {"page": "Morggan of Mar", "response": ["#REDIRECT Morggán, Earl of Mar "]}, {"page": "Morggan, Earl of Mar", "response": ["#REDIRECT Morggán, Earl of Mar "]}]}}