{"wiki_id": "http://www.wikidata.org/entity/Q6915720", "itemLabel": "Moses Bowness", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Moses_Bowness", "wikipedia_page": {"main": "Moses Bowness (1833–1894) was a Victorian photographer, farmer, entrepreneur and poet.\n\nBorn into a copper-miner's family, he built in Ambleside in the Lake District, England, the largest photographic business in Westmorland at that time.  He photographed many notable people and visitors, as well as local views and residents. In May 1857 he photographed the visiting party of the young Prince of Wales, later King Edward VII. The Prince recorded this event in his diary.\nFrom then on the reverse of his carte-de-visite say \"Photographer to HRH the Prince of Wales\".\nHe trained a number of local photographers, including Charles Walmsley and Herbert Bell, whose family he photographed and who later bought his archive.\nHe took an active part in the development of the tourist trade; built shops and lodging-houses; farmed 500 acres at Low Wray, Wray Castle, and exhibited a few views at the Royal Photographic Society in 1877. He worked with the local people to save Stock Ghyll; and gave evidence to the Parliamentary Enquiry into the Railway extension, and used some of his views to support his argument. He still found time to write poetry for the Ambleside Herald.\nHis first wife was the widow of a local builder; his second the daughter and heiress of Josiah Hudleston, member of the East India Company and noted musician.\n\nMoses became acquainted with the eccentric 'Poet Close' in 1860 and they helped each other's businesses in that Moses photographed him and sold his books, while John Close wrote about and advertised his studio in his various pamphlets and books.The picture shows the many buildings connected with his business. He built his lodging house, Vale View - now The Churchill Hotel - on the land in the foreground .\nSome of his sitters include Wordsworth's younger relatives and are now in the Wordsworth Trust;\nWilliam Edward Forster and Harriet Martineau are both in the National Portrait Gallery; \nand Charlotte Mason is in the Armitt\nThe National Portrait Gallery, \nThe Wordsworth Trust at Grasmere; the Armitt Museum in Ambleside, and Kendal Local Studies Centre all own a number of his photographs. Others are in private hands.\nMoses Bowness, Victorian Photographer 1834-1894\nMoses Bowness Photographer, Farmer, Entrepreneur, Poet.\nBorn.    1833 in Coniston to John Bowness & Jane née Mossop.\nMarried.  1st  Isabella Slater.   2nd. Helena Hudleston.\nDied.     23 April 1894. Buried in his family grave in Coniston\nSome Examples of his work", "link_mentions": {}}}