{"wiki_id": "http://www.wikidata.org/entity/Q6915202", "itemLabel": "Morwenna Banks", "itemDescription": "English comedy actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Morwenna_Banks", "wikipedia_page": {"main": "Tamsin Morwenna Banks (born 20 September 1961) is a British comedy actress, writer and producer. She appeared in the Channel 4 comedy sketch show Absolutely, and  wrote, produced, and appeared in the British ensemble film The Announcement. She voices Mummy Pig, Madame Gazelle and Dr Hamster in the children's series Peppa Pig.", "link_mentions": [{"page": "List of comedians", "response": ["* Morwenna Banks (born 1961)"]}, {"page": "List of British comedians", "response": ["*Morwenna Banks (born 1961), The Thick of It, Ruddy Hell! It's Harry and Paul, Saxondale"]}, {"page": "Radio Active (radio series)", "response": ["|4||The D Day ShowMorwenna Banks stood in for Helen Atkinson-Wood.||1 November 1986"]}, {"page": "Guinevere", "response": ["* Guinevere appears in the 2005 animated series King Arthur's Disasters, where she is voiced by Morwenna Banks."]}, {"page": "Mark Thomas", "response": ["In February 2009 British entertainers David Baddiel, Bill Bailey, Morwenna Banks, Sanjeev Bhaskar, Jo Brand, Russell Brand, Rob Brydon, Jimmy Carr, Jack Dee, Omid Djalili, Sean Lock, Lee Mack, Alexei Sayle, Meera Syal, Mark Thomas said in an open letter printed in The Times newspaper of the Baháʼí leaders to be on trial in Iran: \"In reality, their only \"crime\", which the current regime finds intolerable, is that they hold a religious belief that is different from the majority.... we register our solidarity with all those in Iran who are being persecuted for promoting the best development of society ...(and) with the governments, human rights organisations and people of goodwill throughout the world who have so far raised their voices calling for a fair trial, if not the complete release of the Baháʼí leaders in Iran.\" Echoing the comments earlier in the month made by two hundred and sixty seven non-Baháʼí Iranian academics, writers, artists, journalists and activists from 21 countries including Iran who signed an open letter of apology posted to Iranian.com and stating they were \"ashamed\" and pledging their support in Baháʼís achieving the rights detailed in the Universal Declaration of Human Rights for the Baháʼís in Iran. See Persecution of Baháʼís."]}, {"page": "Ebenezer Scrooge", "response": ["* Morwenna Banks as Eden Starling (Barbie) in Barbie in A Christmas Carol, 2008"]}, {"page": "Hattie Jacques", "response": ["Alan Simpson, the co-writer of Hancock, enjoyed writing for Jacques, and thought that she was \"almost like a fella in terms of playing comedy; you didn't write for her thinking she's a woman so we've got to write the feminine point of view. That made it easier for us\". Neville Phillips thought she was a \"complete revelation\", adding \"although she was a large lady (very large, in fact), her movements were dainty, light and graceful, and she had a way of playing comedy that put me in mind of the great Beatrice Lillie ... a subtle, sophisticated actress\". Her friend Bob Monkhouse thought that her career was overshadowed by her size: \"She was such a great comedienne ... everyone wanted her but the movers and shakers of entertainment didn't perceive her as anything other than a fat lady\". Garth Pearce, writing in the Daily Express, noted that \"she always chose to play women in funny situations, rather than refer directly to her weight. She concentrated on the script and its interpretation instead of winning easy laughs by playing 'the fattie'.\" The approach of writers differed in how they dealt with the characters they asked Jacques to portray. Morwenna Banks and Amanda Swift consider Jacques to have been \"unimaginatively cast as the 'fat person'\" in ITMA, while in Sykes, her weight was rarely referred to—and Jacques said that Sykes \"hardly ever made jokes about my size which was a refreshing change\". Gray considers that \"although often cast in broad comedy, she never played it broadly, but with an elegance of voice and body that belied all the clichés about women and weight\"."]}, {"page": "Rex the Runt", "response": ["Thirteen ten-minute episodes of the series aired over two weeks on BBC2 from December 1998. A second thirteen episode series aired from September 2001 on the same channel. As well as the core cast guest voices included Paul Merton, Morwenna Banks, Judith Chalmers, Antoine de Caunes, Bob Holness, Simon Day, Bob Monkhouse, Jonathan Ross, Graham Norton, Arthur Smith, June Whitfield, Kathy Burke, Pam Ayres and Eddie Izzard.", "* Mrs. Bloomers, head of Kumfy Kennels. Treats dogs with care, until she put Vince in the kennel and he ate a chihuahua.  Voiced by Morwenna Banks.", "*Morwenna Banks as Mrs. Bloomers & Voice (\"A Holiday in Vince\") (\"Adventures on Telly Part 1\")"]}, {"page": "Robinson College, Cambridge", "response": ["*Morwenna Banks, actress"]}, {"page": "Stressed Eric", "response": ["*Claire Feeble (Morwenna Banks) – Daughter of Eric; allergic to just about everything, but an intelligent, curious, playful little girl. Her allergies require her to eat special regulation food, but she is always sneaking ordinary food which immediately swells her up.", "*Heather Perfect (Morwenna Banks) – Snobbish daughter of Mr. and Mrs. Perfect."]}, {"page": "Tony Hawks", "response": ["Playing the Moldovans at Tennis, was released in 2012 and starred Hawks with Anatol Durbala, Steven Frost, Angus Deayton, Morwenna Banks and Laura Solon with Pat Cash as the commentator."]}, {"page": "David Baddiel", "response": ["In 2001, Baddiel wrote and starred in Baddiel's Syndrome, a sitcom for Sky 1 which also starred Morwenna Banks, Stephen Fry and Jonathan Bailey, which ran for fourteen episodes. He also wrote the comedy film, The Infidel, starring Omid Djalili, Richard Schiff, Matt Lucas and Miranda Hart. Baddiel has since adapted the film into a musical with music by Erran Baron Cohen. Baddiel directed the production which ran at London's Theatre Royal Stratford East in late 2014. Baddiel's other writing credits include The Norris McWhirter Chronicles for Sky 1, which starred Alistair McGowan and John Thomson and which Baddiel also directed, and two episodes of the ITV reboot of Thunderbirds, Thunderbirds Are Go!", "Baddiel and fellow comedian Morwenna Banks live in North London with their two children: a daughter named Dolly (born 2001) and a son named Ezra (born 2004). Despite his upbringing, he has described himself as a \"10 out of 10 atheist\" and as a \"fundamentalist\" Jewish atheist. He suffers from insomnia, about which he has written guest articles."]}, {"page": "Absolutely (TV series)", "response": ["Absolutely is a British comedy sketch show. The cast and crew are mainly Scottish; the principal writers and performers are Moray Hunter, Jack Docherty, Peter Baikie, Gordon Kennedy (all of whom had performed together as The Bodgers for many years), Morwenna Banks (English) and John Sparkes (Welsh). The original television series, produced by Absolutely Productions, aired on Channel 4 for four series between May 1989 and February 1993. Following an award-winning one-off radio reunion special for BBC Radio 4 in 2013, the show returned for a new four-part radio series with most of the original cast in September 2015.Brand new Absolutely series confirmed for BBC Radio 4, Absolutely Productions, 17 July 2015 A second Radio 4 series of four programmes was broadcast from 25 June 2017, and a third in July 2019."]}, {"page": "Richard Vranch", "response": ["Vranch graduated from Cambridge University with a PhD in physics.Interview, livingonfascination.com, 15 June 2014; retrieved 15 December 2015. While a first-year doctoral student, he joined the Footlights in 1981 and was a contemporary of Stephen Fry, Hugh Laurie, Morwenna Banks, Tony Slattery and Neil Mullarkey.Footlights Alumni - 1980-1989  He was a researcher at the Cavendish Laboratory and a research fellow at St John's College, Oxford for nine months before going into comedy full-time."]}, {"page": "Vic and Bob", "response": ["A new sketch show followed in 1999, Bang Bang, It's Reeves and Mortimer. Characters Donald and Davey Stott (who had appeared throughout the Big Night Out era) returned to the screen. The series also featured various celebrity cameos, including Caprice, Michael Winner, Sinéad O'Connor and Damon Hill, and appearances from comedy actors Charlie Higson and Morwenna Banks.", "Their 2004 comedy drama Catterick, screened on BBC Three, evoked the same unreal atmosphere with a far higher budget. The series was based around the lives of Carl and Chris Palmer, with appearances from D.I. 'Kinky' John Fowler and updated versions of characters from The Club sketches from Bang Bang It's Reeves and Mortimer. Vic and Bob played the main roles, with Charlie Higson, Morwenna Banks, Tim Healy, Mark Benton, Matt Lucas and The League of Gentlemen's Reece Shearsmith."]}, {"page": "Bob Mortimer", "response": ["In 2004, Mortimer and Reeves wrote and starred in Catterick, a 6 episode surreal comedy about an ex-soldier, Carl, who returns home from Cyprus to join his brother Chris who has agreed to help find Carl's son. Cast included Reece Shearsmith, Matt Lucas, Morwenna Banks, Tim Healy, Mark Benton and Charlie Higson."]}, {"page": "Jack Docherty", "response": ["He first performed at the 1980 Edinburgh Festival Fringe with the comedy sketch group The Bodgers which he formed with George Watson's College schoolfriends Moray Hunter, Gordon Kennedy and Pete Baikie. They performed each year from 1980 to 1985. Arfington, Arfington their 1984 show and Mr Hargreaves Did It their 1985 show were both shortlisted for the Perrier Comedy Award. In 1982 he dropped out of Aberdeen University where he was studying law, after he and Moray Hunter became staff writers in the BBC radio comedy department contributing to various shows including Radio Active, In One Ear, Week Ending and The News Huddlines. He also recorded one series with The Bodgers for Radio 4 called In Other Words...The Bodgers. For the second series, producer Alan Nixon teamed them with John Sparkes and Morwenna Banks for Bodgers, Banks and Sparkes, forming the cast that would go on to make the sketch show Absolutely for Channel 4.", "In addition to his radio work, he wrote for Spitting Image for four series between 1984 and 1987. During the same period he also contributed to various other comedy shows including Alas Smith and Jones, and The Lenny Henry Show. He was also script editor for the first series of Vic Reeves Big Night Out. He wrote four series of Absolutely (1989–1992) and with Hunter the spin-off Channel 4 sitcom Mr Don & Mr George (1993). With Morwenna Banks he co-wrote the C4 Comedy Lab \"Model, Actress, Whatever...\" directed by Rankin and, again with Moray Hunter, two series of the BBC2 sitcom The Creatives. In 2008 he and Hunter wrote the BBC2 series The Cup starring Steve Edge. This was an adaptation of the Canadian sitcom The Tournament. In 2012 he wrote and acted in \"Stop / Start\", a pilot for BBC Radio 4. This was then commissioned for a 6-part series which was broadcast on Radio 4 from 6 September 2013 with the title Start/Stop and ran for three series.  It was made available as an audio download in October 2019 with the title changed to It's Not Us, It's Them, although the reason for the change is unknown. A TV pilot of the show was broadcast under the name Stop/Start in March 2016 as part of the BBC's Comedy Playhouse series."]}, {"page": "List of Saturday Night Live cast members", "response": ["!scope=\"row\" style=\"text-align:left\" data-sort-value=\"Banks, Morwenna\" | Morwenna Banks", "  bar:banks        text:\"Morwenna Banks\"", "!scope=\"row\"| Morwenna Banks"]}, {"page": "List of people from Cornwall", "response": ["* Morwenna Banks, comedian and actress"]}, {"page": "The 99p Challenge", "response": ["| Peter Baynham, Morwenna Banks, Tom Binns, Dave Green", "| Peter Baynham, Morwenna Banks, Dave Green, Tom Binns"]}, {"page": "This Morning with Richard Not Judy", "response": ["The first series featured guests who were interviewed in a talk show fashion including Mel & Sue, Jenny Eclair, Peter Baynham and Jack Docherty (who claimed to have had sex with Morwenna Banks while she was dressed as her 'little girl' character from Absolutely)."]}, {"page": "John Sparkes", "response": ["Sparkes provides the voice of the narrator and some other characters in the children's animated series Peppa Pig, in which the voice of fellow Absolutely star Morwenna Banks is also featured.  In Shaun the Sheep he voices Bitzer the Dog and the Farmer. He also voices Mr. Elf and King Marigold in Ben and Holly's Little Kingdom, Professor von Proton in The Big Knights, Steven in A Town Called Panic, and the lead character Fireman Sam in the 2005 series."]}, {"page": "Jeremy Hardy Speaks to the Nation", "response": ["|4||How to Communicate Without Showing Off||21 Jul 2010||Paul B Davies, Morwenna Banks"]}, {"page": "List of Red Dwarf characters", "response": ["| Morwenna Banks"]}, {"page": "Flushing, Cornwall", "response": ["* Morwenna Banks, actress, was born thereBFI"]}, {"page": "Andy Riley", "response": ["|The Morwenna Banks Show"]}, {"page": "History of Saturday Night Live (1990–1995)", "response": ["Later acquisitions were sketch veteran Mark McKinney of the recently wrapped, Michaels-produced Canadian sketch comedy show The Kids in the Hall, and stand-up comic Janeane Garofalo, the latter of whom joined at the beginning of the 1994–1995 season, and the former joining in January, shortly before the departure of Mike Myers. Garofalo left in mid-season, replaced by Molly Shannon. Myers also left in mid-season, as would Nealon after season's end. Farley and Sandler left at the end of the season. Longtime featured player Jay Mohr left as well, and Al Franken, who had worked on the show as a writer and featured player on and off since 1975, also departed later that season. British actress Morwenna Banks joined the cast for the last four episodes of the season as a full cast member, but did not return the next season.", "Much like season 6 [1980-1981] (or, to a lesser extent, season 11 [1985-1986]), season 20 [1994-1995] is considered one of SNL's worst-received seasons. The season was home to many cast turnovers and much dissension. Janeane Garofalo left the show halfway through the season. Mike Myers departed to pursue a movie career. Longtime feature player Al Franken quit, Ellen Cleghorne, Kevin Nealon, Chris Elliott, and Michael McKean also quit the show as well. Laura Kightlinger left to join Roseanne Barr's ill-fated FOX comedy series Saturday Night Special. Morwenna Banks, Chris Farley, Jay Mohr, and Adam Sandler were fired. Banks was hired as a contract player for the last four episodes of the season, leaving behind no memorable characters or celebrity impersonations.", "* Morwenna Banks (debut: April 8, 1995)"]}, {"page": "Little Robots", "response": ["* Rusty (voiced by Morwenna Banks): A feminine and sensitive steam-powered Little Robot who gets nervous at times. She has a red dress which is made of painted rusty metal and wears a funnel-like hat on top of her head. She lives in an old, rusty bucket, and she constantly has new ideas on how to improve and decorate it. She is very impulsive and accidentally prone, though, and tense situations or anything that causes her to get overexcited can make her overheat and release puffs of steam from her funnel. She also has a childish crush on Sporty."]}, {"page": "The Big Knights", "response": ["* Morwenna Banks as The Old Witch"]}, {"page": "Russell Brand", "response": ["In 1994, while still a teenager, Brand appeared in episodes of The Bill and the children's adventure series Mud. In 2002, Brand appeared on the TV shows Cruise of the Gods and White Teeth. In 2005, he played Tommy in the BBC sitcom Blessed, which was written and directed by Young Ones co-writer Ben Elton. Brand auditioned for the part of Super Hans in the Channel 4 sitcom Peep Show; the role eventually went to Matt King. In 2007, Brand appeared in Cold Blood for ITV, playing an ex-con called Ally. Brand played a recovering crack addict named Terry in the pilot for the ITV comedy The Abbey, written by Morwenna Banks. He voiced an Earth Guardian in Robbie the Reindeer in Close Encounters of the Herd Kind. Brand appeared in a small role in the 2006 movie Penelope; although his first major film role was as Flash Harry in the 2007 film St Trinian's."]}, {"page": "Popetown", "response": ["*Morwenna Banks – Sister Marie"]}, {"page": "Catterick (TV series)", "response": ["Catterick, aka Vic and Bob in Catterick, is a surreal 2004 BBC situation comedy in 6 episodes, written by and starring Vic Reeves and Bob Mortimer, with Reece Shearsmith, Matt Lucas, Morwenna Banks, Tim Healy, Mark Benton and Charlie Higson. The series was originally broadcast on BBC Three and later rerun on BBC Two. Reeves has said that the BBC do not want another series of Catterick, though he may produce a spin-off centring on the DI Fowler character.", "Tess: Played by Morwenna Banks, is the long-suffering receptionist at the Mermade Hotel. She is also Roy Oates' reluctant girlfriend. She claims that before he had his \"accident\" he was great fun (\"he even introduced me to a barrister,\"). She is drawn to Carl, but is not willing to commit. She is addicted to the \"gas\" from an asthma inhaler, which induces an extremely brief spell of euphoria. She never believes anything anyone says, usually offering a reply along the lines of \"You're tickling my turnips\" or \"You're feeling my fanny.\""]}, {"page": "Why Didn't They Ask Evans?", "response": ["Morwenna Banks as Mrs Cayman"]}, {"page": "The Dangerous Brothers", "response": ["* Babysitting - featuring Morwenna Banks as the wife and John Bird as the husband."]}, {"page": "Alexei Sayle's Stuff", "response": ["Alexei Sayle's Stuff stars stand-up comedian Alexei Sayle, with a recurring cast including Angus Deayton, Mark Williams, Arabella Weir, Tony Millan, Jan Ravens, Owen Brenman, Harriet Thorpe, Felicity Montagu and Morwenna Banks."]}, {"page": "Peppa Pig", "response": ["Peppa herself has been voiced by several different performers through the years. Lily Snowden-Fine provided her voice in season one and Cecily Bloom in season two,  then Harley Bird, five years old when she started, acquired the role for thirteen years until stepping down after season six. She was replaced by Amelie Bea Smith. John Sparkes, Morwenna Banks, Richard Ridings, Oliver May and Alice May also provide voices."]}, {"page": "All Change", "response": ["All Change is an English children's television show on ITV in two series. Originally broadcast in 1989 and 1991, it starred Frankie Howerd, Peggy Mount, Maggie Steed, Tony Haygarth and Pam Ferris. The series was devised by Morwenna Banks and Chris England."]}, {"page": "The White Horses", "response": ["*Morwenna Banks released a cover version in 1995 as her Absolutely character, The Little Girl."]}, {"page": "The Strangerers", "response": ["*Morwenna Banks as The Super-Supervisor"]}, {"page": "Saturday Live (British TV programme)", "response": ["The series made stars of Ben Elton, Harry Enfield, Stephen Fry and Hugh Laurie, and featured appearances (in some cases first television appearances) by Patrick Marber, Morwenna Banks, Chris Barrie, Julian Clary, Emo Philips, Tracey Ullman, Craig Ferguson, Craig Charles and many others. The show featured comic duo Adrian Edmondson and Rik Mayall in their act The Dangerous Brothers. The introductory theme was an original composition by Paul Hardcastle."]}, {"page": "The Smell of Reeves and Mortimer", "response": ["Spoofs of then-current TV shows continued, including MasterChef spoof, with Vic as Loyd Grossman with a huge bulbous head floating around the studio to the sound of bells, and the contestants including Morwenna Banks as Joan Baptiste, who presented a faceplate in the form of Jesus Christ, with her own severed ears the speciality, Matt Lucas as the victorious Quentin Mint, who presented a human backside with a side salad, and Bob as the hapless Lucas Bon'chomme whose replica cake of a shoe (\"Cake like a shoe, it's a shoe-cake\") turned out to be a real shoe, as did his \"cakey-phone\""]}, {"page": "House of Rock", "response": ["*Morwenna Banks (voices)"]}, {"page": "Bang, Bang, It's Reeves and Mortimer", "response": ["There were also a number of pre-recorded sketches. These would often feature Charlie Higson, Morwenna Banks, Matt Lucas and David Walliams in supporting or cameo roles. It was a firm favourite with Vic and Bob's cult following, but confused and unsettled many new fans who had joined them after viewing their more accessible game show spoof, Shooting Stars. With this in mind, it is perhaps ironic that the duo confessed that Bang Bang... was their \"first real attempt at making something commercial\". Vic and Bob have said they are very proud of the show, with Bob stating: \"We have this hope that, if there's anyone left bothered about us in fifty years' time, [Bang Bang] will be the one they'll remember\"."]}, {"page": "Alien Autopsy (film)", "response": ["* Morwenna Banks as Jasmine"]}, {"page": "Debbie Gates", "response": ["*Revolting Animals, written and told by Morwenna Banks, Chris England, Andy Taylor and Chris Lang. The program was  shot on location at the London Zoo and shown in 1988.", "*Jellyneck, written and told by Morwenna Banks, Chris England, Andy Taylor and Chris Lang. The program was  shot on location and shown in 1989."]}, {"page": "Saxondale", "response": ["Produced by Baby Cow Productions, the programme's first series was broadcast on BBC Two from 19 June 2006. It features Coogan as Tommy Saxondale, a former roadie with anger issues who now owns a pest control business. Other principal characters include Saxondale's Welsh girlfriend Magz (Ruth Jones), and his naïve assistant, Raymond (Rasmus Hardiker). Morwenna Banks, Mark Williams, Greg Davies, Ben Miller (who script-edited the series and directed the first episode) and Liza Tarbuck also appear. Comedian Matt Berry composed the incidental music for the series and appeared in Tommy's therapy class as a yuppie-like character in two episodes of the second series. BBC America began airing Saxondale in November 2006.", "Vicky (Morwenna Banks) is an office manager for the agency that issues jobs to Tommy's Stealth Pest Control. Vicky needles Tommy with her bawdy, passive-aggressive sense of humour."]}]}}