{"wiki_id": "http://www.wikidata.org/entity/Q6915933", "itemLabel": "Moses Samuel", "itemDescription": "Clockmaker, translator of Hebrew works and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Moses_Samuel", "wikipedia_page": {"main": "Moses Samuel was a clockmaker, translator of Hebrew works and writer.", "link_mentions": [{"page": "Sefer haYashar (midrash)", "response": ["Although it is presented as the original \"Book of Jasher\" in translations such as that of Moses Samuel (1840), it is not accepted as such in rabbinical Judaism.  It should not be confused with the very different Book of Jasher (Pseudo-Jasher) printed by Jacob Ilive in 1751, which was purported to have been translated by the English monk Alcuin. It should also not be confused with an ethical text by the same name, which, according to the Encyclopaedia Judaica, Volume 14, p. 1099, was \"probably written in the 13th century.\"", "===Moses Samuel's English translation===", "Subsequently, the translator identified himself as Moses Samuel of Liverpool (1795–1860), who had obtained a copy of the 1625 Hebrew edition and become convinced that the core of this work truly was the self-same Book of the Upright referenced in Hebrew scriptures. He translated the document into English and, after the Royal Asiatic Society at Calcutta declined to publish it, sold the translation to New York City publisher Noah for £150 in 1839. Samuel later said of the absence of his name on the translation that \"I did not put my name to it as my Patron and myself differed about its authenticity\" – Noah having had less confidence in the 1625 document than did Samuel.", "*Book of Jasher Referred to in Joshua and Second Samuel (1840), by Moses Samuel"]}, {"page": "Non-canonical books referenced in the Bible", "response": ["* The Book of the Wars of the LordSometimes called The Book of the Wars of Yahweh. One source says \"The quotation is in lyrical form, so it is possibly a book of poetry or a hymnal...Moses quoted it, so the date of its composition must have been prior to the completion of the Pentateuch, perhaps during the wanderings in the wilderness. Nothing else is known about it, and it survives only in Moses’ quotation.\" is mentioned in . It is speculatively associated with one of the Dead Sea Scrolls, the War of the Sons of Light Against the Sons of Darkness. The Book of the Wars of the Lord is also cited in the Book of Jasher (trans. Moses Samuel c. 1840, ed. J. H. Parry 1887) Chapter 90:48 as being a collaborative record written by Moses, Joshua and the children of Israel."]}, {"page": "H. Samuel", "response": ["In 1862, Harriet Samuel (née Wolf) took over her father-in-law Moses Samuel's clock-making and silversmith business in Liverpool. Harriet moved the business to Manchester's Market Street and ran the mail-order side. Her son developed the retail business, and opened the first H. Samuel retail store in Preston in 1890, closely followed by branches in Rochdale and throughout Lancashire. To accommodate the growing business, the company moved to larger headquarters in Birmingham in 1912."]}, {"page": "Samuel (name)", "response": ["*Moses Samuel (1795–1860), British clockmaker, translator of Hebrew works and writer"]}]}}