{"wiki_id": "http://www.wikidata.org/entity/Q6914438", "itemLabel": "Olga Tufnell", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Olga_Tufnell", "wikipedia_page": {"main": "Olga Tufnell  (26 January 1905 – 11 April 1985) was a British archaeologist who assisted on the excavation of the ancient city of Lachish in the 1930s. She had no formal training in archaeology, but had worked as a secretary for Flinders Petrie for a number of years before being given a field assignment. Olga then went on to join James Leslie Starkey in the expedition to find Lachish in 1929 and remained part of the team for the following seasons.\nWhen Starkey was killed in 1938, the team finished the season then closed the site. Olga volunteered to write up the report of the dig and spent the following twenty years researching and writing up the majority of the excavation report. Olga's work has been regarded as the \"pre-eminent source book for Palestinian archeology\". Once the report was published, she turned her attention to cataloguing scarabs and other seals.", "link_mentions": [{"page": "Merneferre Ay", "response": ["Merneferre Ay is well attested; no fewer than 62 scarab seals and one cylinder-sealCylinder Seal of King Merneferre Aya, Metropolitan Museum of Art, see the online catalog  bearing his name are known, 51 of which are of unknown provenanceFive scarab-seals of Merneferre Ay are now in the Petrie Museum, see three of them on Digital EgyptOlga Tufnell: Studies on Scarab Seals, vol. II, Aris & Philips, Warminster, 1984, pp. 159–161, 181, 184–187, 200, 368–369, seals No. 3168–3183, pl. LV–LVI. Among the scarabs of known provenance, three are from Lower Egypt, more precisely one from Bubastis and two from Heliopolis. The rest of the scarabs of known provenance are from Abydos, Coptos and Lisht, all localities being in Middle or Upper Egypt. Other attestations of Ay include an obsidian globular jar now in the Metropolitan Museum of Art,Globular Jar of King Merneferre Aya, Metropolitan Museum of Art, see the online catalog  a ball dedicated to Sobek,Gerard Godron: Deux objets du Moyen-Empire mentionnant Sobek, BIFAO 63 (1965), p. 197–200, available online  an inscribed limestone block, part of a lintel, discovered in 1908 by Georges Legrain in Karnak and a pyramidion."]}, {"page": "Tel Lachish", "response": ["The first expedition at Lachish, then Tell ed-Duweir, from 1932 to 1939, was the Starkey-Tufnell British expedition which included James Leslie Starkey as expedition leader, Olga Tufnell, G.L. Harding and C. Inge. It was funded by Charles Marston and Henry Wellcome with the aim of finding the Biblical city of Lachish. They succeeded in finding Lachish, with a \"wealth of well-stratified pottery\", a \"key part of the ceramic corpus of Palestine\", and the Lachish Letters, c. \"written to the commander of the garrison at Lachish shortly before it fell to the Babylonians in either 589 or 586 B.C.\" Starkey was murdered in 1938 while travelling to Jerusalem to open the Rockefeller Archaeological Museum. Tufnell, Harding and Inge remained for the 1938-9 season. Tufnell returned to London and over the next two decades, worked at the Institute of Archaeology in London, \"sorting, collating, studying and presenting the material found at Lachish\". She completed her final publication Lachish IV in 1957. She had already become a Fellow of the Society of Antiquaries of London in 1951."]}, {"page": "1905 in archaeology", "response": ["* January 26 – Olga Tufnell, English archaeologist of the Near East (died 1985)."]}, {"page": "Archaeology of Israel", "response": ["A UNESCO World Heritage site since 2005, Tel Hazor has been excavated repeatedly since 1955. Other findings include an ancient Canaanite city, which experienced a catastrophic fire in the sometime in the 13th century BCE. The date and causes of the violent destruction of Canaanite Hazor have been an important issue ever since the first excavations of the site. One school of thought, represented by Yigael Yadin, Yohanan Aharoni and Amnon Ben-Tor, dates the destruction to the later half of the 13th century, tying it to biblical descriptions in Joshua which hold the Israelites responsible for the event. The second school of thought, represented by Olga Tufnell, Kathleen Kenyon, P. Beck, Moshe Kochavi and Israel Finkelstein, tends to support an earlier date in the first half of the 13th century, in which case there is no necessary connection between the destruction of Hazor and the process of settlement by Israelite Tribes in Cannan. Other findings at the site include a distinctive six chambered gate dating to the Early Iron Age, as well as pottery and administrative buildings dating to either the 10th century and King Solomon or, on a lowered chronology, to the Omrides of the 9th century."]}, {"page": "1985 in archaeology", "response": ["*April 11: Olga Tufnell, English archaeologist of the Near East (born 1905)"]}, {"page": "Neferhotep I", "response": ["Neferhotep I is known from a relatively high number of objects found over a large area, from Byblos to the north to the Egyptian fortresses of BuhenJewellery from at Buhen, now in the University of Pennsylvania Museum of Archaeology and Anthropology E 10755, initially attributed to Amenemhat III, then reattributed to Neferhotep I. Reference: David Randall-MacIver, Sir Leonard Woolley: Buhen, Philadelphia: University Museum 1911, available online p. 192, 201, 234, pl. 74 and MirgissaSeal impression of Neferhotep I at Mirgissa. Reference: Dows Dunham, George Andrew Reisner, Noel F Wheeler: Uronarti, Shalfak, Mirgissa, Boston Museum of Fine Arts 1967, p. 163 and 172 in Lower Nubia to the south through all parts of Egypt, especially in the southern portion of Upper Egypt. A single attestation is known from Lower Egypt, a scarab from Tell el-Yahudiya.Percy E. Newberry: Scarabs an introduction to the study of Egyptian seals and signet rings, with forty-four plates and one hundred and sixteen illustrations in the text, 1906, available online copyright-free see plate X no 5, and page 122. Other attestations include over 60 scarab seals,William C. Hayes: The Scepter of Egypt: A Background for the Study of the Egyptian Antiquities in The Metropolitan Museum of Art. Vol. 1, From the Earliest Times to the End of the Middle Kingdom, MET Publications 1978, available online, see p. 342–344 and p. 349–350Olga Tufnell: Studies on Scarab Seals, vol. II, Aris & Philips, Warminster, 1984, pp. 142, 180 [2nd, 4th–9th, 11th–13th], see also seals No. 1788, 1803, 2898–2899, 3110–3116, 3118–3130.Two seals of Neferhotep I in the Petrie Museum on Digital Egypt. See also on the online catalog of the museum here and here.Two scarabs of Neferhotep I in the Metropolitan Museum of Art:  and  2 cylinder-seals,Jean Yoyotte: Le Soukhos de la Maréotide et d'autres cultes régionaux du Dieu-Crocodile d'après les cylindres du Moyen Empire, Bulletin de l'Institut Français d'Archeologie Orientale (BIFAO) 56, 1957, p. 81–95 available online  see p. 86 1.oFlinders Petrie: Buttons and Design Scarabs, 1925, pl. XXIV and XXVI a statue from Elephantine,Labib Habachi, Gerhard Haeny et Friedrich Junge: Elephantine IV : The Sanctuary of Heqaib, Philippe von Zabern, Mainz, 1985, p. 115, pl. 201–202 [a-b]. and 11 rock inscriptions from Wadi el Shatt el-Rigal,Flinders Petrie: A season in Egypt, 1888, XV [479] Sehel Island,Robert Delia: New Rock Inscriptions of Senwosret III, Neferhotep I, Penpata, and Others at the First Cataract, Bulletin of the Egyptological Seminar (BES) 1992, vol.11 1991, p. 5–22 KonossoKarl Richard Lepsius: Denkmäler aus Ägypten und Äthiopien , 1849, Tafel II, Band IV, available online see p. 151 plates g and hJacques de Morgan,  U. Bouriant, Georges Legrain, Gustave Jéquier, Alessandro Barsanti: Catalogue des monuments et inscriptions de l'Égypte antique, Tome I 1894 and Philae. The inscriptions record the members of Neferhotep's family as well as two high officials serving him \"The royal acquaintance Nebankh\" and the \"Treasurer Senebi\". "]}, {"page": "Tufnell", "response": ["* Olga Tufnell (1905–1985), British archaeologist"]}, {"page": "Semqen", "response": ["Semqen's only contemporary attestation is a brown steatite scarab-seal from Tell el-Yahudiyeh in the Nile Delta.Olga Tufnell: Studies on Scarab Seals Vol. 2, Aris & Phillips 1984, , see seal num. 3463 and pl. LXII, p. 382. Significantly, the seal gives him the title of Heka-chasut, \"Ruler of the foreign lands\", a title exclusively associated with the early Hyksos rulers.Sir William Matthew Flinders Petrie: Egypt and Israel, London: Society for Promoting Christian Knowledge, 1911, available online copyright-free Furthermore, the design of the seal indicates that it was likely produced either during the 14th or the 15th Dynasty, the latter being much more probable."]}, {"page": "Gerald Lankester Harding", "response": ["In 1926, Petrie was excavating at Tell Jemmeh, near Gaza in southern Palestine, where Harding joined him. Harding's archaeological talents quickly became apparent and with James Leslie Starkey and Olga Tufnell, he became one of a band of young archaeologists known as 'Petrie's pups'.Drower, 1985 While on the excavations, he quickly learned spoken Arabic from the local Bedouin and spoke their dialect throughout his life despite living in Amman and Lebanon in later years. He also taught himself written Arabic. Harding and the other 'pups' worked with Petrie at Tell Jemmeh, Tell Fara and Tall al-Ajjul between 1926 and 1931, but in 1932 they began a major excavation of their own, under Starkey's direction, at Tell ed-Duweir (Biblical Lachish), where the famous \"Lachish Letters\", written in the Palaeo-Hebrew script on pot sherds were found. With Olga Tufnell and Charles Inge, Harding was responsible for the second volume of the Final Report."]}, {"page": "Archaeology of Lebanon", "response": ["Descriptions of some of the tells in the Beqaa Valley were published by A. Jirku in 1933, L. Burkhalter in 1948 and A. Kuschke in 1954, along with a map of the Beqaa valley by Bernard Geze in 1956 that marked 50 tells.Jirku, A., Neue Forschungen in Syrien und Palästina. Zeitschrift der Deutschen Morgenlandischer Gesellschaft, vol. 86, pp. 170, 1933.Burkhalter, L., Bibliographie Préhistorique - Inventaire, Bulletin du Musée de Beyrouth, vol. 8, 1948.Burkhalter, L., Bibliographie Préhistorique - Cartes et bibliographie, Bulletin du Musée de Beyrouth, vol. 9, 1949.Kuschke, A., Beiträge zur Siedlungsgeschichte der Bika'. Zeitschrift der Deutschen Palastina-Vereins, vol. 70, pp. 104-129, 1954 (continued in vol. 71, pp. 97-110, 1955-56). Another major survey of Lebanese tells was carried out between 1965 and 1966 with 88 tells recorded along with numerous surface sites by Lorraine Copeland and Peter Wescombe. Materials collected were presented for comment and identification to a 'panel of experts' that included Diana Kirkbride, Jacques Cauvin, Henri de Contenson, Maurice Dunand, Francis Hours, Henri Fleisch, Robert John Braidwood, Ralph Solecki, W.J. van Liere, G.L. Harding, H. Balfet, Olga Tufnell, Brian Gregor and Ziyad Beydoun."]}, {"page": "List of fellows of the Society of Antiquaries of London", "response": ["*Olga Tufnell (1905–1985)"]}, {"page": "Sheneh (pharaoh)", "response": ["Sheneh is one of the few attested kings of the 14th Dynasty with three scarabs attributable to him.  None of those scarabs are of known provenance however, which hampers research on Sheneh's kingdom.  One scarab is currently in the British Museum, another in Aberdeen, catalogue number 21048, and the third one is in Moscow cat. nu. 2258.Olga Tufnell: Studies on Scarab Seals, vol. II, Aris & Philips, Warminster, 1984"]}, {"page": "Yakareb", "response": ["One of the two scarabs is currently housed in the Egyptian Museum of Berlin, catalog number 293/73, while the other is in the Petrie Museum, under the catalog number 11810.Olga Tufnell: Studies on Scarab Seals Vol. 2, Aris & Phillips 1984, , see seal num. 3493The scarab on Digital Egypt, Petrie Museum.The scarab on the catalog of the Petrie Museum"]}]}}