{"wiki_id": "http://www.wikidata.org/entity/Q6937897", "itemLabel": "Jean McConville", "itemDescription": "murdered in 1972 in Northern Ireland", "wikipedia_url": "https://en.wikipedia.org/wiki/Murder_of_Jean_McConville", "wikipedia_page": {"main": "Jean McConville (née Murray; 7 May 1934 – December 1972) was a woman from Belfast, Northern Ireland, who was kidnapped and murdered by the Provisional Irish Republican Army (IRA) and secretly buried in County Louth in the Republic of Ireland in 1972 after being accused by the IRA of passing information to British forces.In 1999, the IRA acknowledged that it had killed McConville and eight others of the \"Disappeared\". It claimed she had been passing information about republicans to the British Army in exchange for money and that a transmitter had been found in her apartment. A report by the Police Ombudsman found no evidence for this or other rumours.Before the Troubles, the IRA had a policy of killing informers within its own ranks. From the start of the conflict the term informer was also used for civilians who were suspected of providing information on paramilitary organisations to the security forces. Other Irish republican and loyalist paramilitaries also carried out such killings. As she was a widowed mother of ten, the McConville killing was particularly controversial. Her body was not found until 2003, and the crime has not been solved. The Police Ombudsman found that the Royal Ulster Constabulary (RUC) did not begin to investigate the disappearance properly until 1995.", "link_mentions": [{"page": "Provisional Irish Republican Army", "response": ["The IRA regarded informers as traitors, and a threat to the organisation and lives of its members. Suspected informers were dealt with by the IRA's Internal Security Unit, which carried out an investigation and interrogated the suspects. Following this a court martial would take place, consisting of three members of equal or higher rank than the accused, plus a member of GHQ or the Army Council acting as an observer. Any death sentence would be ratified by the Army Council, who would be informed of the verdict by the observer. The original IRA, as well as all the major paramilitary organisations active during the Troubles, also killed alleged informers. The IRA usually killed informers with a single shot to the head, and left many of their bodies in public to deter other informers. There was also a group of sixteen people known as the Disappeared who were secretly buried between 1972 and 1985, which included alleged informers, agents for the security forces, and people that stole IRA weapons and used them in armed robberies. In March 1999 the IRA apologised for the \"prolonged anguish\" caused to the families of the Disappeared, and stated it had identified the burial places of nine people, including the most high-profile victim, Jean McConville, a Catholic civilian and widowed mother-of-ten. This led to the recovery of three bodies later in 1999, although Jean McConville's body was not recovered until August 2003. As of 2019, the bodies of Columba McVeigh, Joe Lynskey, and undercover British Army intelligence officer Robert Nairac have yet to be recovered."]}, {"page": "Sinn Féin", "response": ["The Northern Bank robbery of £26.5 million in Belfast in December 2004 further delayed a political deal in Northern Ireland. The IRA were widely blamed for the robbery although Sinn Féin denied this and stated that party officials had not known of the robbery nor sanctioned it. Because of the timing of the robbery, it is considered that the plans for the robbery must have been laid whilst Sinn Féin was engaged in talks about a possible peace settlement. This undermined confidence among unionists about the sincerity of republicans towards reaching agreement. In the aftermath of the row over the robbery, a further controversy erupted when, on RTÉ's Questions and Answers programme, the chairman of Sinn Féin, Mitchel McLaughlin, insisted that the IRA's controversial killing of a mother of ten young children, Jean McConville, in the early 1970s though \"wrong\", was not a crime, as it had taken place in the context of the political conflict. Politicians from the Republic, along with the Irish media, strongly attacked McLaughlin's comments."]}, {"page": "Gerry Adams", "response": ["In 2014, Adams was held for four days by the Police Service of Northern Ireland for questioning in connection with the abduction and murder of Jean McConville in 1972.Sinn Féin leader Gerry Adams held over Jean McConville murder , BBC News. Retrieved 30 April 2014.Gerry Adams remains in custody over McConville murder , BBC News, 1 May 2014. He was freed without charge and a file was sent to the Public Prosecution Service, which later stated there was insufficient evidence to charge him,\"Jean McConville murder: Sinn Féin leader Gerry Adams will not face Disappeared charges\" . BBC News, 29 September 2015. as had been expected since shortly after his release. Adams announced in November 2017 that he would step down as leader of Sinn Féin in 2018, and that he would not stand for re-election to his seat in the Dáil in the 2020 election. He was succeeded by Mary Lou McDonald at a special ardfheis (party conference) on 10 February 2018.", "On 30 April 2014, Adams was arrested by detectives from the Police Service of Northern Ireland (PSNI) Serious Crime Branch, under the Terrorism Act 2000, in connection with the murder of Jean McConville in 1972. He had previously voluntarily arranged to be interviewed by police regarding the matter, and maintained he had no involvement. Fellow Sinn Féin politician Alex Maskey claimed that the timing of the arrest, \"three weeks into an election\", was evidence of a \"political agenda [...] a negative agenda\" by the PSNI. Jean McConville's family had campaigned for the arrest of Adams over the murder.Sinn Fein leader Gerry Adams arrested over murder of widowed mother abducted in 1972  Jean McConville's son Michael said that his family did not think the arrest of Adams would ever happen, but were \"quite glad\" that the arrest took place. Adams was released without charge after four days in custody and it was decided to send a file to the Public Prosecution Service, which would decide if criminal charges should be brought.Sinn Féin leader Gerry Adams held over Jean McConville murder . BBC News. 30 April 2014.Shadow of Jean McConville murder still hangs over Gerry Adams and Sinn Fein  Irish Independent, 5 May 2014."]}]}}