{"wiki_id": "http://www.wikidata.org/entity/Q6932817", "itemLabel": "Phil Harding", "itemDescription": "English archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Harding_(archaeologist)", "wikipedia_page": {"main": "Philip Harding DL FSA (born 25 January 1950) is a British field archaeologist. He became a familiar face on the Channel 4 television series Time Team. Harding trained on various excavations with the Bristol University Extra Mural Department and other bodies from 1966; he has been a professional archaeologist since 1971.", "link_mentions": [{"page": "Time Team", "response": ["Time Team is a British television programme that originally aired on Channel 4 from 16 January 1994 to 7 September 2014. Created by television producer Tim Taylor and presented by actor Tony Robinson, each episode featured a team of specialists carrying out an archaeological dig over a period of three days, with Robinson explaining the process in lay terms. The specialists changed throughout the programme's run, although it consistently included professional archaeologists such as Mick Aston, Carenza Lewis, Francis Pryor and Phil Harding. The sites excavated ranged in date from the Palaeolithic to the Second World War.", "A team of archaeologists, usually led by Mick Aston or Francis Pryor (the latter usually heading Bronze Age and Iron Age digs), including field archaeologist Phil Harding, congregate at a site, usually in Britain. The original Time Team line-up from 1994 has changed over the years. Historian and archivist Robin Bush was a regular in the first nine series, having been involved with the programme through his long friendship with Aston. Architectural historian Beric Morley featured in ten episodes between 1995 and 2002. In 2005, Carenza Lewis left to pursue other interests. She was replaced by Helen Geake, Anglo-Saxon specialist. The regular team also included:"]}, {"page": "Knapping", "response": ["English archaeologist Phil Harding is another contemporary expert, whose exposure on the television series Time Team has led to him being a familiar figure in the UK and beyond. Many groups, with members from all walks of life, can now be found across the United States and Europe. These organizations continue to demonstrate and teach various ways of shaping stone tools."]}, {"page": "List of archaeologists", "response": ["*Phil Harding (born 1950) British; Britain, flint-knapping"]}, {"page": "Mick Aston", "response": ["In June 1988 the producer Tim Taylor invited Aston to work on a new four-episode television series for Channel 4 called Time Signs, broadcast in June and July 1991. The series focused on the historical development of the area about to be flooded by the Roadford Reservoir in Devon, making heavy use of archaeological data. Aston brought archaeologist Phil Harding into the project in order to explain techniques of experimental archaeology to the audience. Meanwhile, in August 1989, Aston was promoted to the position of Reader in Landscape Archaeology at Bristol University. He also continued to write on the subject, authoring the book Monasteries (1993); he had initially planned to title the volume Monasteries in the Landscape but his publisher, Batsford, had insisted on the shorter title.", "Alongside his academic publications, Aston wrote two books on archaeology for a more general audience, both of which were published by Channel 4 Books as a spin-off from the Time Team television series. The first of these was Time Team's Timechester: A Companion to Archaeology, co-written with Carenza Lewis and Phil Harding and first published in 2000. Based around the fictional British town of Timechester, the book looks at how the settlement would have progressed from the Palaeolithic through to the modern day, and examines the remains that each period would have left behind in the archaeological record. This was followed in 2002 by Archaeology is Rubbish: A Beginner's Guide, which Aston co-wrote with Tony Robinson and dedicated to Harding. Archaeology is Rubbish describes a fictional excavation site in an ordinary suburban back garden, and discusses the evidence from different archaeological periods, the field methods and techniques used by the excavators, and the legal proceedings and problems that archaeologists in Britain face.", "| , Phil Harding, and Tim Taylor", "Following Aston's death, former colleague Francis Pryor noted that Aston was a \"remarkable archaeologist who could really dig\", being a \"warm, loving, nice man.\" Another colleague, Phil Harding, commented on Aston's \"incredible knowledge\" and \"effortless way of making archaeology accessible to people.\" Tony Robinson wrote of him: \"Mick was a real child of the '60s and a bit of a rebel, but he was also a series of contradictions. He was one of the best academic archaeologists in the country, yet his real love was teaching ordinary people. He was the grumpiest old Black Country curmudgeon you could imagine, but he had a heart of absolute gold.\"Tony Robinson, \"Mick Aston: 1946-2013\", Radio Times, 6–12 July 2013, p.143 He also noted that \"archaeology is now a subject that tens of thousands of people enjoy and value, and this is almost solely down to him.\" Ralph Lee, head of Channel 4's factual programming, described Aston as a \"brilliant communicator\" who helped make archaeology \"so popular\" in the UK."]}, {"page": "Marlborough, Wiltshire", "response": ["*Phil Harding, Time Team archaeologist, educated in the town"]}, {"page": "Mildenhall, Wiltshire", "response": ["*Phil Harding (b. 1950), archaeologist, educated in Marlborough, worked at the Roman town in Mildenhall in 2009"]}, {"page": "Wessex Archaeology", "response": ["Phil Harding, who appeared on the archaeological television programme Time Team, works for Wessex Archaeology."]}, {"page": "Farndon, Nottinghamshire", "response": ["Describing the finds at Farndon, as \"the dream scenario\" archaeologist Phil Harding, who is also an expert in shaping stone tools, said \"As a flint knapper, you were there with them\". It has been imagined that the hunters who produced the scatter, needed to use the new flint tools to flense animal carcasses at this seasonal camp, situated on a river terrace overlooking the River Devon near to its confluence with the River Trent.Pitts, Mike (2010), \"news (A moment in the life of an ice age hunter unique find)\", British Archaeology (115). Retrieved 7 March 2012."]}, {"page": "Phil Harding", "response": ["Phil Harding may refer to:", "* Phil Harding (archaeologist) (born 1950), British field archaeologist and television personality on Time Team", "* Phil Harding (producer) (born 1957), British music engineer, producer, and remixer best known for partnership with keyboardist Ian Curnow", "* Phil Harding (BBC executive), journalist and media consultant, former editor at the BBC"]}, {"page": "1950 in archaeology", "response": ["* January 25 - Phil Harding, English field archaeologist"]}, {"page": "Upton Lovell", "response": ["* Short video on Upton Great Barrow burial – Wiltshire Museum, 2015, with Phil Harding"]}, {"page": "Time Signs", "response": ["Time Signs is a British television series that aired on Channel 4 in 1991. Presented by Mick Aston, the series tells the story of a Devon valley throughout history. Phil Harding does some reconstruction archaeology. The series was narrated by Ray Brooks.", "Time Signs was later developed into Time Team, the long-running archaeology television programme that aired from 1994 to 2014. Time Team has the same producer and also features Mick Aston and Phil Harding.", "Time Signs was created in 1988 when producer Tim Taylor asked Mick Aston to present Time Signs, a history and archaeology series that tells the story of Wolf Valley in Devon. Aston asked archaeologist Phil Harding to do some reconstruction archaeology. Time Signs was filmed at what is now the Roadford Reservoir in Devon."]}, {"page": "Time Team Digs", "response": ["The series producer of Time Team Digs was Tim Taylor, the creator and producer of Time Team and its predecessor Time Signs. The executive producer was Philip Clarke and the producers were Jeremy Cross and Laurence Vulliamy. Tony Robinson, the presenter, was also the associate producer. Regular contributors on Time Team included: archaeologists Mick Aston, Phil Harding, Carenza Lewis, Neil Holbrook; Robin Bush (historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater, Chris Gaffney (geophysicists); Henry Chapman (surveyor)."]}, {"page": "List of English people", "response": ["* Phil Harding (born 1950)"]}, {"page": "Chris Moyles' Quiz Night", "response": ["| Jimmy Carr (quizmaster), Duncan Bannatyne, Tony Robinson and Phil Harding"]}, {"page": "Time Team (specials)", "response": ["Most shows fit within a 1-hour time-slot (approx. 46–49 minutes of content), although some (e.g. episodes 3, 9, 26, 33, 35, 36) are longer at 1.25 hours of content, and some (i.e. episode 24) at 1.75 hours. Regular contributors include: presenter Tony Robinson; archaeologists Mick Aston, Phil Harding, Carenza Lewis, Helen Geake; historians Francis Pryor; Robin Bush, Guy de la Bedoyere, Sam Newton, Alex Langlands; illustrator Victor Ambrus; landscape investigator Stewart Ainsworth; geophysics John Gater, Chris Gaffney; surveyor Henry Chapman; and, Roman specialist Mark Corney."]}, {"page": "A History of the World in 100 Objects", "response": ["| 100px ||3 || Hand axe || Olduvai Gorge, Tanzania || 1.2–1.4 million years old || BBC || BM || Sir James Dyson, Phil Harding, Nick Ashton"]}, {"page": "Time Team (series 16)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Helen Geake, Francis Pryor, Brigid Gallagher, Jackie McKinley, Raksha Dave, Matt Williams, Faye Simpson; Guy de la Bedoyere (Roman historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor); Paul Blinkhorn (pottery expert), Mark Corney (coin expert); Raysan Al-Kubaisi (computer graphics). "]}, {"page": "Time Team (series 15)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Helen Geake, Neil Holbrook, Brigid Gallagher, Raksha Dave, Matt Williams, Faye Simpson, Ian Powlesland, Kerry Ely; historians Guy de la Bedoyere, Francis Pryor; Jackie McKinley (osteoarchaeologist); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor); Mark Corney, Paul Blinkhorn (pottery experts); Raysan Al-Kubaisi (graphic designer)."]}, {"page": "Festival of British Archaeology", "response": ["The profile of the Festival of Archaeology has grown in recent years. The festival has received national media coverage in newspapers such as The Guardian  and The Telegraph  and featured on BBC1's The One Show in 2007. High-profile figures such as Barbara Follett, Phil Harding, and Julian Richards have been involved with the festival. In 2008 the children's magazine The Beano featured the Festival of Archaeology on their front cover."]}, {"page": "Time Team (series 17)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Helen Geake; Guy de la Bedoyere (historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor)."]}, {"page": "Time Team (series 1)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on the Time Team include Tony Robinson (presenter), Mick Aston, Phil Harding, Carenza Lewis, Victor Ambrus (illustrator), Robin Bush (historian) and John Gater (geophysicist)."]}, {"page": "Time Team (series 2)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); Mick Aston, Phil Harding, Carenza Lewis, Mark Horton (archaeologists); Robin Bush (historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater, Chris Gaffney (geophysics)."]}, {"page": "Time Team (series 3)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Carenza Lewis; Robin Bush (historian); Beric Morley (historic buildings); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor)."]}, {"page": "Time Team (series 4)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Carenza Lewis; Beric Morley (historic buildings); Robin Bush (historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater, Chris Gaffney (geophysicists); Henry Chapman (surveyor); Sue Francis (graphics); Mark Corney (Roman expert)."]}, {"page": "Time Team (series 5)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Carenza Lewis, Neil Holbrook; historians Beric Morley and Robin Bush; Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor); Mark Corney (Roman buildings); Sue Francis, Steve Breeze (computer graphics)."]}, {"page": "Time Team (series 6)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Carenza Lewis, Beric Morley; Guy de la Bédoyère (historian); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater, Chris Gaffney (Geophysics); Henry Chapman (surveyor); Mark Corney (Roman expert)."]}, {"page": "Time Team (series 14)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Helen Geake, Brigid Gallagher, Raksha Dave, Matt Williams; Francis Pryor (historian); Jackie McKinley (osteoarchaeologist); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor); Paul Blinkhorn (pottery); Mark Corney (Roman expert); Raysan Al-Kubaisi (computer graphics)."]}, {"page": "Time Team (series 13)", "response": ["Episode # refers to the air date order. The Time Team Specials are aired in between regular episodes, but are omitted from this list. Regular contributors on Time Team include: Tony Robinson (presenter); archaeologists Mick Aston, Phil Harding, Helen Geake, Francis Pryor, Neil Holbrook, Brigid Gallagher, Raksha Dave, Matt Williams; Guy de la Bedoyere (Roman historian); Jackie McKinley (bones expert); Victor Ambrus (illustrator); Stewart Ainsworth (landscape investigator); John Gater (geophysicist); Henry Chapman (surveyor); Paul Blinkhorn (pottery expert); Mark Corney (Roman specialist); Faye Simpson (finds expert); Raysan Al-Kubaisi (computer graphics)."]}]}}