{"wiki_id": "http://www.wikidata.org/entity/Q693555", "itemLabel": "Edward Digby, 11th Baron Digby", "itemDescription": "British politician and peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Digby,_11th_Baron_Digby", "wikipedia_page": {"main": "Edward Kenelm Digby, 11th Baron Digby,  (1 August 1894 – 29 January 1964), also 5th Baron Digby in the Peerage of Great Britain, was a British peer, soldier and politician.", "link_mentions": [{"page": "Pamela Harriman", "response": ["Pamela Digby was born in Farnborough, Hampshire, England, the daughter of Edward Digby, 11th Baron Digby, and his wife, Constance Pamela Alice, the daughter of Henry Campbell Bruce, 2nd Baron Aberdare.  She was educated by governesses in the ancestral home at Minterne Magna in Dorset, along with her three younger siblings. Her great-great aunt was the nineteenth-century adventurer and courtesan Jane Digby (1807–1881), notorious for her exotic travels and scandalous personal life.  Pamela was to follow in her relative's footsteps, and has been called \"the 20th-century's most influential courtesan\"."]}, {"page": "List of knights and ladies of the Garter", "response": ["| Edward Digby, 11th Baron Digby"]}, {"page": "Minterne Magna", "response": ["Pamela Digby Churchill Harriman, (1920–1997), daughter of Edward Digby, 11th Baron Digby, was raised at the manor house from 1920 to 1938, and lived there before her marriage to Randolph Churchill in 1939."]}, {"page": "Henry Bruce, 2nd Baron Aberdare", "response": ["* Constance Pamela Alice Bruce, m. 1919 Edward Digby, 11th Baron Digby"]}, {"page": "Lord Lieutenant of Dorset", "response": ["* Edward Digby, 11th Baron Digby 1 September 1952 – 29 January 1964"]}, {"page": "Edward Kenelm Digby, 11th Baron Digby", "response": ["#REDIRECT Edward Digby, 11th Baron Digby"]}, {"page": "Edward Digby", "response": ["*Edward Digby, 11th Baron Digby (1894–1964), British peer, soldier and politician"]}, {"page": "Edward Digby, 12th Baron Digby", "response": ["He was the son of the Edward Digby, 11th Baron Digby, whom he succeeded as Baron Digby in 1964.  He studied at Eton and Trinity College, Oxford, and trained at the Royal Military Academy Sandhurst. He served as an army officer in World War II, Malaya, and the British Army of the Rhine. As a cadet, he received an emergency commission as a second lieutenant on 15 February 1945, relinquished this commission on 22 May 1946 and received a regular commission in the Coldstream Guards from the same date."]}]}}