{"wiki_id": "http://www.wikidata.org/entity/Q6939205", "itemLabel": "Murray Dickie", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Murray_Dickie", "wikipedia_page": {"main": "Murray Dickie OBE (Bishopton 3 April 1924 – Cape Town, South Africa, 19 June 1995)  was a Scottish tenor opera singer and director, who established his career in England, Austria and Italy during the 1950s. In addition to his extensive stage work he was a prolific recording artist.", "link_mentions": [{"page": "Luchino Visconti", "response": ["|Dietrich Fischer-Dieskau, Rolando Panerai, Murray Dickie, Erich Kunz, Ilva Ligabue, Regina Resnik.Conducted by Leonard BernsteinViscontiana 2001, pp. 66–67"]}, {"page": "Das Lied von der Erde", "response": ["* Paul Kletzki, with Murray Dickie and Dietrich Fischer-Dieskau, Philharmonia Orchestra (HMV LP SXLP 30165)"]}, {"page": "Eine Nacht in Venedig", "response": ["The work played at Daly's Theatre in 1884, staged by J.C. Duff’s Comic Opera Company,\"Johann Strauss the younger’s operetta, A Night in Venice, Daly’s Theatre, New York, 1884\", The Brooklyn Daily Eagle, 4 May 1884, p. 3c and in 1900 at the American Theatre on Broadway in New York. English language versions have included one with a translation by Lesley Storm and lyrics by Dudley Glass that played at the Cambridge Theatre in London in 1944,\"A Night in Venice\". The Guide to Light Opera and Operetta, accessed 10 May 2011 one for English National Opera in 1976 at the London Coliseum by Murray DickieForbes, Elizabeth. \"Obituaries: Murray Dickie\". The Independent, 29 June 1995, accessed 10 May 2011 and a 1980s production for the Light Opera of Manhattan by Alice Hammerstein Matthias.\"Alice Hammerstein Mathias\". Rodgers & Hammerstein Organization, accessed 10 May 2011Davis, Peter G. \"Some Enchanted Evenings\". New York Magazine, May 31, 1982, p. 84, accessed 20 March 2012 Ohio Light Opera performed the work in 1981, 1991, 1999 and 2009,\"A Night in Venice\". Ohio Light Opera archive, accessed 10 May 2011 recording it in 2000.\"Strauss: A Night In Venice / Thompson, Ohio Light Opera\". Arkivmusic, accessed 10 May 2011"]}, {"page": "Ariadne auf Naxos", "response": ["From 1979 to 1982, the Salzburg Festival showed a new staging by Dieter Dorn, settings and costumes by Jürgen Rose, again conducted by Karl Böhm, with a cast headed by Hildegard Behrens and James King, with Trudeliese Schmidt, Edita Gruberová, Walter Berry, Kurt Equiluz, Murray Dickie and Olivera Miljaković."]}, {"page": "The Tales of Hoffmann (1951 film)", "response": ["| Murray Dickie"]}, {"page": "List of Scottish musicians", "response": ["*Murray Dickie (1924–1995), tenor opera singer"]}, {"page": "The Bohemian Girl", "response": ["The opera \"remained in the repertories of British touring companies until the 1930s and was revived in 1932 at Sadler's Wells\".Burton, p. 522 Since World War II, it has been staged in a production by Dennis Arundell at Covent Garden in 1951 with Beecham conducting and a cast consisting of Roberta Peters, Anthony Marlowe, Jess Walters, Edith Coates, Howell Glynne and Murray Dickie,Harold Rosenthal. Covent Garden - The Bohemian Girl (August 15). Opera, October 1951, Vol.2 No.10, p598-600. by the Belfast Operatic Society at the 1978 Waterford International Festival of Light Opera, in Ireland,Actor Emer Gillespie on ulsteractors.com by Castleward Opera, Strangford, in Northern Ireland in 2006 and by Opera South, Haslemere, in England in 2008.Opera South shows on operasouth.co.uk "]}, {"page": "Giuditta", "response": ["* Decca GOS 583-4: Hilde Güden; Waldemar Kmentt; Murray Dickie; Emmy Loose; Walter Berry; Oscar Czerwenka; Vienna State Opera Chorus and Orchestra; Rudolf Moralt, conductorLamb, Andrew, \"Record Reviews: Giuditta\" (July 1970). The Musical Times, 111 (1529): pp. 717–718."]}, {"page": "Die Entführung aus dem Serail discography", "response": ["|Erika KöthHanny SteffekAnton DermotaMurray DickieJosef Greindl"]}, {"page": "The Olympians", "response": ["|Murray Dickie"]}, {"page": "Jean Fenn", "response": ["Fenn was featured in a number of Met broadcasts, including Faust on April 9, 1966 (with Nicolai Gedda in the title role, William Walker as Valentine, Cesare Siepi as Mefistofeles, and Georges Prêtre conducting), Die Meistersinger on January 14, 1967 (with Giorgio Tozzi, Sándor Kónya, Ezio Flagello, Murray Dickie, Karl Doench, Mildred Miller, and Joseph Rosenstock conducting), and Martha on February 3, 1968 (with Rosalind Elias, John Alexander, Donald Gramm, Lorenzo Alvary, and Franz Allers conducting to name just a few."]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|1951 || The Rose of Castille ||  Balfe || English || 1857 ||  Dermot O'Hara ||  Powell Lloyd || ||  Murray Dickie"]}, {"page": "The Rose of Castille", "response": ["*The Rose of Castile:  Maureen Springer (Elvira), Murray Dickie (Manuel), Angela O'Connor (Carmen), James Cuthbert (Don Pedro), Wexford Festival Chorus, Radio Éireann Light Orchestra, conductor Dermot O’Hara, Rare Recorded Editions RRE 191/2, 1951.  Issued on 2 LPs in the 1970s, later (c2002) issued on CD by the Balfe Archive, London. Klein, Axel: Irish classical recordings: a discography of Irish art music (2001) (Discographies ISSN  0192-334X), Greenwood Press, Westport CT, USA. "]}, {"page": "Der Sturm (opera)", "response": ["|Adrian||tenor||Murray Dickie"]}, {"page": "Dickie (name)", "response": ["* Murray Dickie (1924–1995), Scottish tenor opera singer and director"]}, {"page": "The Epic of Gilgamesh (Martinů)", "response": ["The premiere of the oratorio took place on 24 January 1958 with the Basel Chamber Orchestra and the Basel Chamber Choir conducted by Paul Sacher,F. James Rybka Bohuslav Martinů: The Compulsion to Compose Page 259 2011 - \"Although he completed the work in 1954, the premiere of The Epic of Gilgamesh took place on January 24, 1958, by the Basel Chamber Orchestra and Choir conducted by Sacher. This event had a profound personal connection to all ...\" and it received further performances in Martinů's lifetime, including one in Vienna where the soloists were Marilyn Horne Murray Dickie, Otto Wiener and Walter Berry, conducted by Sacher.Paul Sacher dirige Martinů : une épopée historique (Paul Sacher conducts Martinů : a historical epic) accessed 6 January 2020."]}, {"page": "Glyndebourne Festival Opera: history and repertoire, 1934–51", "response": ["|1950 || Die Entführung aus dem Serail ||  Mozart ||  Ilse Hollweg (Konstanze), Richard Holm (Belmonte), Endre Koréh (Osmin), Alda Noni (Blonde), Murray Dickie (Pedrillo) ||  Fritz Busch  ||  Carl Ebert ||  Rolf Gérard "]}, {"page": "Glyndebourne Festival Opera: history and repertoire, 1952–63", "response": ["|1953 || Die Entführung aus dem Serail ||  Mozart ||    Sári Barabás (Constanze), Helmut Krebs (Belmonte), Fritz Ollendorf (Osmin), Emmy Loose/April Cantelo (Blonde), Murray Dickie (Pedrillo)  ||  Alfred Wallenstein  || colspan=\"2\"|  Revival of 1950 production", "|1954 || ArlecchinoCurtain raiser preceding Ariadne auf Naxos. ||   Busoni  ||  Kurt Gester (Arlecchino), Ian Wallace (Ser Matteo), Geraint Evans (Abbate), Fritz Ollendorf (Dottore), Murray Dickie (Leandro), Elaine Malbin (Colombina) ||  John Pritchard ||  Peter Ebert ||  Peter Rice"]}, {"page": "Opera in Scotland", "response": ["* Murray Dickie"]}, {"page": "1924 in Scotland", "response": ["* 3 April – Murray Dickie, tenor opera singer and director (died 1995 in South Africa)"]}, {"page": "1976 New Year Honours", "response": ["* Murray Dickie. For services to Anglo-Austrian cultural relations."]}, {"page": "Deaths in June 1995", "response": ["*Murray Dickie, 71, Scottish tenor."]}]}}