{"wiki_id": "http://www.wikidata.org/entity/Q693027", "itemLabel": "Bryn Hargreaves", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryn_Hargreaves", "wikipedia_page": {"main": "Bryn Hargreaves (born 14 November 1985) is an English former professional rugby league footballer.", "link_mentions": [{"page": "Paul Prescott", "response": ["Chairman Maurice Lindsay commented: \"Bryn Hargreaves, and Paul Prescott have signed for a further two years, and as they are two of the best front row prospects in the country it gives us added satisfaction that they have all come through our Junior Development Scheme.\""]}, {"page": "Hargreaves", "response": ["* Bryn Hargreaves (born 1985), English rugby league player"]}, {"page": "2006 Wigan Warriors season", "response": ["|Bryn Hargreaves", "|Bryn Hargreaves", "|Bryn Hargreaves"]}, {"page": "2007 Wigan Warriors season", "response": ["|Bryn Hargreaves"]}, {"page": "Category talk:Unassessed rugby league articles", "response": ["Bryn HargreavesStart"]}, {"page": "2008 Super League Grand Final", "response": ["|| Bryn Hargreaves"]}, {"page": "2007 World Club Challenge", "response": ["||18. Bryn Hargreaves||  style=\"text-align:center; background:#eee;\"|Int.|| style=\"text-align:center;\"|16. Ben Hannant"]}, {"page": "List of St Helens R.F.C. players", "response": ["|align=\"left\"  |Bryn Hargreaves"]}, {"page": "2008 Challenge Cup Final", "response": ["St Helens: Paul Wellens, Ade Gardner, Matthew Gidley, Willie Talau, Francis Meli, Leon Pryce, Sean Long, Bryn Hargreaves, Keiron Cunningham, James Graham, Chris Flannery, Jon Wilkin, Paul Sculthorpe"]}, {"page": "Balshaw's Church of England High School", "response": ["* Bryn Hargreaves, rugby league player"]}, {"page": "2009 St Helens RLFC season", "response": ["|Bryn Hargreaves"]}, {"page": "2009 Super League Grand Final", "response": ["|align=\"center\"| Bryn Hargreaves"]}, {"page": "2010 St Helens RLFC season", "response": ["St Helens got back-to-back wins after a comfortable win over the Dragons in Perpignan. However, it was the Dragons who got the better of the opening exchanges, with Setaimata Sa and Chris Walker going over inside the first ten minutes. Neither scores were converted, but Catalans had an 8-0 lead. However, on the 15 minute mark, Saints found their cutting edge and began to tick, with young winger Jonny Lomax latching on to an inch-perfect Paul Wellens chip. Despite James Graham being off the field with  suspected concussion and Jonny Lomax being caught by a dangerous tackle by Olivier Elima which resulted in the French captain's sending off, St Helens pressed on and it was Lomax, who shrugged off the shot from Elima to cut inside his opposing winger to score a brilliant try. Kyle Eastmond scored a goal from the touchline for a 10-8 St Helens lead, and with the extra man advantage, it was looking ominous for the Dragons. Francis Meli got his first of the season after a fine kick form the in-form Leon Pryce, and shortly after, Matt Gidley cut back inside his winger to finish a fine move for the first of his two tries of the evening. Half-time - 8-18 to Saints. The second-half continued in a similar guise, with Maurie Fa'asavalu scoring a trade-mark, barnstorming try under the posts. Eastmond was next to score, Gidley cutting through the defence and flicking the ball back on the inside to Eastmond who sped 30 meters for a fine try. Meli then crossed for his second, finishing well a break from Matty Ashurst. Gidley then got his brace, with a trademark, show and go on the outside to score. That was the end of the St Helens scoring, but by no means the end of the action, with Bryn Hargreaves and Scott Moore involved in a brawl with the Catalans forwards. Walker got his second with five minutes remaining, but the win was in the bag by the hour mark.", "|Bryn Hargreaves || Bradford Bulls || September 2010"]}, {"page": "2010 Super League Grand Final", "response": ["||  Bryn Hargreaves"]}, {"page": "2010 Widnes Vikings season", "response": ["Saint's arrived at the Stobart Stadium with plenty of players who are expecting to see first team action in this year's Super League campaign, with Saints imposing an early 22 point lead after four unanswered tries from Gary Wheeler, Jamie Foster, Sia Soliola and Bryn Hargreaves and 3 conversions from Jamie Foster."]}, {"page": "2011 Bradford Bulls season", "response": ["The Bulls finally announced a replacement for Nero in the form of Chev Walker from Hull Kingston Rovers. To boost the wings he also brought in Wigan Warriors youngster Shaun Ainscough and New Zealand Warriors young winger Patrick Ah Van. With the Bulls lacking that extra push in the forwards last season, the signings of Bryn Hargreaves from St Helens R.F.C. and Olivier Elima from Catalans Dragons will provide that. Another problem with the Bulls last season is that the squad did not really have any experience and the depth so they have signed experienced second rower Ian Sibbit from Salford City Reds, Sibbit will be in his 13th season, with six of them spent at Salford.", "The Bulls release second rower Glenn Hall from his contract, which he had 2 years left on, so he could return to Australia for the birth of his child. The 20-man squad for the match against Halifax was revealed with new signings Patrick Ah Van, Gareth Raynor, Shad Royston, Marc Herbert, Bryn Hargreaves, Shaun Ainscough, Ian Sibbit and Chev Walker all making their debuts. The Bulls beat the Championship Grand Final winners 50–8 with tries from Raynor, Heath L'Estrange scored a double, Herbert, Royston, Jason Crookes, John Bateman, Michael Platt and Elliott Whitehead, Herbert kicked a goal and Ah Van kicked 6. The Bulls 2010 superstar signing Matt Orford Finally got a 1-year deal with Canberra Raiders after many months of legal disputes which means the Bulls can announce 23-year-old Stand Off Kyle Briggs (on a 2-year deal) from Featherstone Rovers as their 11th new recruit. On 13 January the Bulls announced the squad numbers for the 2011 season. They travelled to Lanzarote for 1 week for an intense training camp, during the camp Glenn Hall signed a 2-year contract with NRL team North Queensland Cowboys. It is revealed that Formula One ace Mark Webber spent a day training with the Bulls in their warm weather camp. The 20-man squad for the game against Dewsbury Rams was announced with new signings Matt Diskin, Olivier Elima and Kyle Briggs all making their debuts, Nick Scruton returns from injury to play. The Bulls are made to fight for their 46–12 win with tries coming from Diskin, a double from Vinny Finigan, Ah Van, Steve Crossley, Platt and youngsters Reed and McKay, Ah Van kicked 7 out of 8. The squads for the game against Keighley Cougars and Wakefield Trinity Wildcats was announced with youngsters Cain Southernwood, Finigan, Bateman and Crookes featuring against the Cougars, Brett Kearney is set to play his first game in 2011 against the Wildcats. The youthful Bulls side lost 46–12 against the Cougars with tries coming from Bateman, Southernwood and Finigan. Bradford then beat Wakefield in the final pre-season match 40–16 with tries coming from L'Estrange, Kearney, a double from the ever impressive Ah Van, Platt, Paul Sykes and Elima, Ah Van kicked 4 goals whilst Herbert and Briggs kicked 1 each.", "The Bulls travelled to the Capital to face fellow strugglers Harlequins RL; this was a must win for the Bulls if they wanted to keep within touching distance of the playoffs. Marc Herbert replaced Kyle Briggs and prop Bryn Hargreaves suffered an ankle injury. Also youngster Danny Addy made his return to the first team. Bradford won the game 30–16 with Centre Patrick Ah Van scoring 2 tries and kicking 2 goals, other Centre Elliott Whitehead scored a try and in his best game in a Bradford shirt Full Back Shad Royston went 90m to score. The points were rounded up with a late try from front rower Andy Lynch. Aussie Hooker Heath L'Estrange signed a new three-year deal, keeping him at the Bulls until 2014. The Bulls were aiming to win three in a row for the first time since April 2010 against visitors St Helens R.F.C.. It was a very rainy evening and Saints scored an early try; however the Bulls came away with a draw, a last-minute penalty given away by Lynch allowed Jamie Foster to make the final score 14–14, Fullback Brett Kearney scored on his return and so did captain Lynch. Ah Van kicked 3 goals from 4. Aussie Kearney also signed a new three-year deal at the Bulls. Half Back Kyle Briggs went out on loan for a month at strugglers Harlequins RL. Bradford announced their first signing for the 2012 season in the form of Newcastle Knights centre Keith Lulia. Bradford hosted fellow playoff contenders Hull F.C. at Odsal, Hull managed to dominate the Bradford pack and won the game 28–14, the Bulls tryscorers were Royston with 2 and captain Lynch, Ah Van kicked a goal. The Bulls won their first game at Headingley Stadium since 2007 with a hard-fought 18–12 victory against arch-rivals Leeds Rhinos, second-rower Olivier Elima scored 2 tries for Bradford and Ah Van kicked 5 goals. Bradford Bulls terminated the contact of academy product Dave Halley, he immediately joined local Championship 1 side Keighley Cougars on a short term deal.", "*Round 1: Chev Walker, Patrick Ah Van, Olivier Elima, Matt Diskin, Bryn Hargreaves, Ian Sibbit, Gareth Raynor, Shad Royston and Kyle Briggs made their debuts for the Bulls.", "|15||Bryn Hargreaves||B||x||x||P", "|15||Bryn Hargreaves||P||L||P||P||P||P||P||P||P||B||B||B||B||P||P||12px||12px||12px||B||P||L||P||P||P||P||P||P ", "|15||Bryn Hargreaves||B||P   ", "|Bryn Hargreaves", "|align=center|Bryn Hargreaves"]}, {"page": "2011 St Helens RLFC season", "response": ["right|200px|thumb|Bryn Hargreaves left Saints for Bradford", "|Bryn Hargreaves || Bradford Bulls || October 2010"]}, {"page": "2012 Bradford Bulls season", "response": ["Local Championship side Keighley Cougars announce another pre-season friendly against the Bulls on 27 January at Cougar Park. The Bulls travelled to Castleford Tigers on Boxing Day to play their annual friendly, however things didn't start well for the Bulls as new signing Manase Manuokafoa was injured in the warm up. Jason Crookes, Chev Walker, Bryn Hargreaves and Shaun Ainscough all scored for the Bulls with Kyle Briggs kicking 1 goal from 4 attempts, however it was not enough and Castleford won the game 28–18.", "The Bulls started off March with a very impressive performance against league leaders Warrington Wolves, the Bulls were the better side for the majority of the game with John Bateman and Manase Manuokafoa both impressing however they could not prevent a controversial 23–10 loss with Matt Diskin and Jason Crookes scoring and Jarrod Sammut kicking a goal. The Bulls staged an impressive fightback from 24–8 down to beat Hull Kingston Rovers 36–24 with Crookes grabbing his hat-trick, Karl Pryce, Diskin, Brett Kearney and Keith Lulia also scored with Sammut kicking 4 goals. Bradford got their first home win against a St. Helens side struggling for form, however it was no easy task as the Bulls and Saints players ran their blood to water but the Bulls defence stood firm and they ground out a 12–8 win (their first win over Saints since 2009) with Elliott Whitehead crossing for an 8-point try after Jamie Foster kicked him and early in the second half Karl Pryce crossed for a try, returning Paul Sykes kicked 2 from 3. Youngster Elliott Whitehead signed a new 5 Year Deal to stay with the club until at least 2016. After a good few games the Bulls reverted to their old ways and lost to Salford City Reds 38–18 with Kearney, Whitehead and Bryn Hargreaves scoring and the returning Sammut kicking 3 goals. The Bulls were hit with a massive financial blow when the RBS limited their overdraft leaving the Bulls with no cash, with no other option Peter Hood turned an asked the fans to help out by donating money to the club. Also Paul Sykes joined Wakefield Trinity Wildcats on a season long loan. The Bulls put up a spirited display against 2nd place Hull F.C. however despite being the better side for most of the match Hull came away with a lucky 24–18 win, Lulia, Pryce and youngster John Bateman all scored tries with Sammut kicking all 3 goals.", "*Round 8: Bryn Hargreaves scored his 1st try for the Bulls.", "*Round 23: Bryn Hargreaves made his 50th appearance for the Bulls.", "|15||Bryn Hargreaves||P||P||x||P", "|15||Bryn Hargreaves||P||P||P||P||P||P||P||P||P||P||P||P||P||P||P||P||P||P||12px||P||P||P||P||P||P||P||P       ", "|15||Bryn Hargreaves||P||P       ", "|Bryn Hargreaves"]}]}}