{"wiki_id": "http://www.wikidata.org/entity/Q6948127", "itemLabel": "Myra Shackley", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Myra_Shackley", "wikipedia_page": {"main": "Myra Lesley Shackley (born 5 March 1949) was formerly Professor of Culture Resource Management and Head of the Centre for Tourism and Visitor Management at Nottingham Trent University Business School. She retired in summer 2011 after an academic career spanning more than 40 years, during which she became recognised as a leading international authority on the management of historic sites. She has written 15 books (of which the latest is 'Atlas of Travel and Tourism Development' (Butterworth-Heinemann 2006), a core text for historical geography and tourism studies. Much of her recent research has been concerned with the management of sacred sites as visitor attractions and she wrote the textbook 'Managing Sacred Sites; service provision and visitor experience'.", "link_mentions": [{"page": "Kirk Deighton", "response": ["*Doctor Reverend Myra Shackley, was incumbent vicar at Kirk Deighton between 2009 and 2015"]}, {"page": "Myra (given name)", "response": ["* Myra Shackley (born 1949), British professor"]}, {"page": "Catholic Church in Romania", "response": ["During that age, Roman Catholics were recognized an autonomous structure, which allowed clerics and laity to organize teaching and administrate community schools. A particular compromise was the Saxon citadel of Biertan (Birthälm), where the fortified church was taken over by the majority Lutheran community, and Catholic worship was still allowed to take place in the \"Catholic Tower\", located just south of the religious building.Alexandra Mureșan, \"The Fortified Church of Biertan (Transylvania)\", in Myra Shackley (ed.), Visitor Management: Case Studies from World Heritage Sites, Elsevier, Amsterdam, 2000, p.37. "]}, {"page": "Still Living?", "response": ["#REDIRECT Myra Shackley"]}, {"page": "Still Living? Wildmen: Yeti, Sasquatch and the Neanderthal Enigma", "response": ["#REDIRECT Myra Shackley"]}, {"page": "Shackley", "response": ["*Myra Shackley (born 1949), Professor at Nottingham Business School and ordained priest in the Church of England"]}, {"page": "List of cryptozoologists", "response": ["* Myra Shackley (b. 1949), British archaeologist and Bigfoot skeptic; author of Wildmen: Yeti, Sasquatch, and the Neanderthal Enigma"]}, {"page": "Biertan fortified church", "response": ["The church was occupied and robbed in 1704, during Rákóczi's War of Independence.Cetatea Biertan at the Sibiu County Cultural Affairs Office site  It suffered damage during the 1977 Vrancea earthquake and subsequently underwent restoration workAlexandra Mureșan, \"The Fortified Church of Biertan (Transylvania)\", in Myra Shackley (ed.), Visitor Management: Case Studies from World Heritage Sites, p.27. Elsevier, Amsterdam, 2000.  between 1983 and 1989. Since 1990, Saxons come annually to Biertan to celebrate their heritage. In 1993, Biertan and its fortified church were declared a UNESCO World Heritage Site; it was joined by six other places in 1999 to form the villages with fortified churches in Transylvania site.Villages with Fortified Churches in Transylvania at the UNESCO site\"World Heritage Committee Inscribes 48 New Sites on Heritage List\" at the UNESCO site Additionally, the church is listed as a historic monument by Romania's Ministry of Culture and Religious Affairs, with each of the three fortifications considered a separate monument.Lista Monumentelor Istorice 2010: Judeţul Sibiu   Biertan was the subject of two 2011 postage stamps, a joint issue between Germany and Romania.\"Timbru poștal despre biserica din localitatea sibiană Biertan, lansat la Brașov\", Adevărul, September 11, 2011 "]}, {"page": "List of women anthropologists", "response": ["| Myra Shackley"]}]}}