{"wiki_id": "http://www.wikidata.org/entity/Q6948955", "itemLabel": "Mystic Meg", "itemDescription": "English astrologer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mystic_Meg", "wikipedia_page": {"main": "Margaret Anne Lake (born 27 July 1942), best known by her stage name Mystic Meg, is an English astrologer who has a regular astrology column in The Sun, and until its demise, the News of the World. She also hosts Mystic Meg's Wheel of Destiny for Sun Bingo. She came to greater public attention when she hosted what became a regular item on the first broadcast of the National Lottery draw in 1994. Her image also appears on various astrology-related books and merchandise.", "link_mentions": [{"page": "Accrington", "response": ["*Mystic Meg, astrologer, was born in the town as Margaret Anne Lake in 1942"]}, {"page": "William Rees-Mogg", "response": ["Writing in The Times in 2001, Lord Rees-Mogg, who had a house in Somerset, described himself as \"a country person who spends most of his time in London\", and attempted to define the characteristics of a \"country person\". He also wrote that Tony Blair was as unpopular in rural England as Mrs Thatcher had been in Scotland. By now his liberal attitude to drugs policy had led to his being mocked as \"Mogadon Man\" by Private Eye. The magazine later referred to him as \"Mystic Mogg\" (a pun on \"Mystic Meg\", a tabloid astrologer) because of the perception that his economic and political predictions were ultimately found to be inaccurate."]}, {"page": "Scrying", "response": ["* The British astrologer and psychic known as Mystic Meg, who came to national attention as part of the UK's National Lottery draw in 1994, was often portrayed with a crystal ball."]}, {"page": "List of astrologers", "response": ["*Mystic Meg"]}, {"page": "Category talk:Astrology", "response": ["Mystic MegStub"]}, {"page": "Margaret Lake", "response": ["* Margaret Lake, real name of astrologer Mystic Meg"]}, {"page": "List of Room 101 episodes", "response": ["|Sooty • Mystic Meg • Opera • Clowns"]}, {"page": "Bug Alert", "response": ["*Mystic Mug Bug aka Mystic Mug: Originally loosely modelled on celebrity fortune teller \"Mystic Meg\", her metier was crystal ball reading, where (in the first two series) she would retail \"Mystic Mug Bug's Amazing Facts\". Increasingly eccentric as the series progressed, she often teetered uncertainly on the edge of sanity."]}, {"page": "The Brian Conley Show", "response": ["Introduced in series four, Septic Peg was an astrologist who featured in sketches entitled Septic Peg Predicts. She was a direct parody of Mystic Meg who appeared on the then newly devised National Lottery draws that aired on BBC 1 around the same time as The Brian Conley Show. Like Mystic Meg, Septic Peg would make predictions with the help of her crystal ball, but were often blatantly obvious predictions, such as guessing the Lottery winner would be celebrating a birthday this year, their name would begin with a letter of the alphabet, and they will be either a man or a woman, (or, in one episode, Russell Grant). Her predictions were often accompanied with funny looks to camera, including crossed-eyes and pursed lips. In one episode, Mystic Meg appears as herself and refers to Septic Peg as her \"beautiful sister\"."]}, {"page": "1996 in British television", "response": ["*30 November – During a live broadcast of The National Lottery Live on BBC 1, the draw machine does not start, causing the draw to be delayed by 50 minutes. Resident psychic Mystic Meg later said that she had been predicting it all day."]}, {"page": "The National Lottery Draws", "response": ["The first show was presented by Noel Edmonds. Afterwards, it was co-presented by Anthea Turner and Gordon Kennedy, later replaced by Bob Monkhouse, all of them assisted by the psychic Mystic Meg and numbers expert Sam Weren. Carol Vorderman had a segment during the early years of the show whereby, she would use mathematical techniques to predict the winning numbers. When Gordon left, Anthea remained as solo host and was followed by a number of presenters over the years.", "* On 30 November 1996, live on air, the draw machine failed to start, causing the draw to be delayed by 50 minutes; Bob Monkhouse, the host that night, said that Mystic Meg had been predicting it all day."]}, {"page": "When the Going Gets Tough, the Tough Get Going (song)", "response": ["The Irish boyband Boyzone recorded a cover version for the 1999 Comic Relief telethon, shortening the title to \"When the Going Gets Tough\". Like the original, their version also reached number one on the UK Singles Chart, becoming their fifth chart-topper. It spent two weeks at number one. The song received a platinum certification in the UK. The video included Graham Norton, Jo Brand, Phill Jupitus, Mel Smith, Davina McCall, Harry Hill, Steve Collins, John McCririck, Jimmy White, Mystic Meg, Will Mellor, James Dreyfus, the cast of Emmerdale, Adam Buxton and Joe Cornish, and Ulrika Jonsson and Saracen from Gladiators."]}, {"page": "Harry Hill (TV series)", "response": ["* Episode 4 (20 November 1998) – Guests: Mystic Meg"]}]}}