{"wiki_id": "http://www.wikidata.org/entity/Q6947704", "itemLabel": "Myles Rudge", "itemDescription": "English songwriter and scriptwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Myles_Rudge", "wikipedia_page": {"main": "Myles Peter Carpenter Rudge  (8 July 1926 – 10 October 2007) was an English songwriter, known for writing the lyrics for novelty songs. His songs \"The Hole in the Ground\" and \"Right Said Fred\" were both British Top 10 chart hits in 1962, both recorded by Bernard Cribbins to music by Ted Dicks and produced by George Martin for Parlophone.  Another of his songs, \"A Windmill in Old Amsterdam\", was a hit in 1965 for Ronnie Hilton, and won an Ivor Novello Award in 1966 for the Year's Outstanding Novelty Composition.", "link_mentions": [{"page": "Kenneth Williams", "response": ["* Kenneth Williams on Pleasure Bent 1967, Decca LK 4856. Music by Ted Dicks, lyrics by Myles Rudge. Arrangements and musical direction by Barry Booth, sound supervision by Roger Cameron."]}, {"page": "Bernard Cribbins", "response": ["In 1962, three comic songs Cribbins had recorded were released and entered the UK Singles Chart. \"The Hole in the Ground\" was about an annoyed workman who eventually buries a harasser. \"Right Said Fred\" was about three workmen who struggle to move an unspecified heavy and awkward object into or out of a building. Both these songs were produced by George Martin for Parlophone, with music by Ted Dicks and lyrics by Myles Rudge. \"Hole in the Ground\" and \"Right Said Fred\" both reached the top 10 in the UK Singles Chart. The third and final Cribbins single of the year was \"Gossip Calypso\", which was another top 30 hit.", "These programmes concluded with Cribbins narrating a detective story as recurring character \"Ivor Notion\", with a script usually by Johnny Ball but sometimes by Myles Rudge, the co-writer of his Top 10 singles. He starred in the BBC's 1975 Christmas production Great Big Groovy Horse, a rock opera based on the story of the Trojan Horse shown on BBC2 alongside Julie Covington and Paul Jones. It was later repeated on BBC1 in 1977. He regularly appeared on BBC TV's The Good Old Days recreating songs made famous by the great stars of Music Hall."]}, {"page": "Novelty song", "response": ["In 1965, \"A Windmill in Old Amsterdam\", a song written by Ted Dicks and Myles Rudge, became a UK hit for Ronnie Hilton. The song spent a total of 13 weeks on the UK Singles Chart peaking at No. 23 in the chart of 17 February 1965. The song's composers were granted an Ivor Novello Award in 1966 for the Year’s Outstanding Novelty Composition."]}, {"page": "Ciarán Hinds", "response": ["| Myles Rudge", "|Myles Rudge"]}, {"page": "Ronnie Hilton", "response": ["He came to fame by supplying smoothly delivered cover versions of popular American songs during the 1950s. His most enduring recordings were \"No Other Love\"; and his last chart entry in 1965 with \"A Windmill in Old Amsterdam\" written by Ted Dicks and Myles Rudge. The latter spent a total of 13 weeks on the UK Singles Chart, peaking at No. 23 in the chart of 17 February 1965. The song's composers were granted an Ivor Novello Award in 1966 for the Year's Outstanding Novelty Composition."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Myles Rudge (Acting Diploma 1949)"]}, {"page": "Stop Messing About", "response": ["The sudden death of Round the Horne star Kenneth Horne at the end of series four prompted a rewrite of the material intended for series five which then found its way into Stop Messing About alongside new sketches; Round the Horne writers Johnnie Mortimer and Brian Cooke are therefore credited with series one of Stop Messing About, while series two, which was entirely original, was written by Myles Rudge.", "*Myles Rudge"]}, {"page": "Comedy Playhouse (series 9)", "response": ["|Myles Rudge"]}, {"page": "Myles (given name)", "response": ["*Myles Rudge (1926–2007), English songwriter"]}, {"page": "Romany Jones", "response": ["|  7 ||  6 ||  An Addition To The Family ||  Myles Rudge ||  ", "|  10 ||  2 ||  The Shower ||  Myles Rudge ||  ", "|  17 ||  3 ||  Loot ||  Myles Rudge ||  "]}, {"page": "Right Said Fred (song)", "response": ["\"Right Said Fred\" (also written \"Right, Said Fred\") is a novelty song of 1962 written by Ted Dicks and Myles Rudge.", "Category:Songs written by Myles Rudge"]}, {"page": "Rudge", "response": ["*Myles Rudge (1926–2007), English songwriter"]}, {"page": "1969 in British radio", "response": ["*14 February – Radio comedian Kenneth Horne collapses and dies of a heart attack while hosting the annual Guild of Television Producers' and Directors' Awards at The Dorchester hotel in London, having just presented an award to Barry Took, co-scriptwriter of Round the Horne, and invited viewers to tune in to its fifth series, due to start on 16 March. By 24 February the BBC has decided that Round the Horne cannot continue without its star and the scripts for series five are hastily reworked by writers Johnnie Mortimer and Brian Cooke with Myles Rudge into a new vehicle for former co-star Kenneth Williams called Stop Messing About which opens on BBC Radio 2 on 6 April and runs for two seasons."]}, {"page": "List of songs about Amsterdam", "response": ["* \"A Windmill in Old Amsterdam\" by Ted Dicks and Myles Rudge"]}, {"page": "The Hole in the Ground", "response": ["\"The Hole in the Ground\" is a comic song written by Myles Rudge and composed by Ted Dicks.  When recorded by Bernard Cribbins and released by EMI on the Parlophone label in 1962, it was a number nine hit in the UK Singles Chart and remains his highest charting and the most successful of his three hit singles, staying on the chart for 13 weeks.David Roberts. British Hit Singles & Albums. Guinness World Records Limited The musical accompaniment was directed by Gordon Franks, and the producer was George Martin.", "Category:Songs written by Myles Rudge"]}, {"page": "Ted Dicks", "response": ["Ted Dicks (5 May 1928 – 27 January 2012) was an English composer. He is best known for composing the music for the novelty songs \"Right Said Fred\" and \"The Hole in the Ground\".  They were both Top 10 hits in the UK Singles Chart in 1962, recorded by Bernard Cribbins with lyrics by Myles Rudge, and produced by George Martin for Parlophone. Another song by Dicks and Rudge, \"A Windmill in Old Amsterdam\", was a million-seller hit in 1965 for Ronnie Hilton.", "While working as a teacher in the 1950s, Dicks composed a stage show Let's Go Mad, which had a short run at the Fortune Theatre in London's West End in 1960 under the title Look Who's Here!, featuring Nyree Dawn Porter, Donald Hewlett and Anna Quayle. Dicks collaborated with Barry Cryer, and then with Myles Rudge. Dicks and Rudge wrote the revue And Another Thing which had a long run at the Fortune Theatre in 1960, featuring Bernard Cribbins, Anna Quayle, Lionel Blair, and Joyce Blair.", "Music producer George Martin liked the show, and released a single of Cribbins singing one of the show's songs, \"Folk Song\". Martin commissioned Dicks and Rudge to write other comic songs for Cribbins, and the next two tunes, \"Hole in the Ground\" and \"Right Said Fred\", were both top 10 hits in 1962. Martin praised the \"clever lyrics\" written by Myles Rudge and the \"quirky melodies\" written by Dicks. Noël Coward chose \"Hole in the Ground\" as one of his records on Desert Island Discs, saying he would pass the time on his desert island by translating it into French. Richard and Fred Fairbrass adopted \"Right Said Fred\" as the name of their pop group."]}, {"page": "You Pay Your Money", "response": ["* Myles Rudge as Estate Agent"]}, {"page": "A Windmill in Old Amsterdam", "response": ["\"A Windmill In Old Amsterdam\" is a 1965 novelty song written by Ted Dicks and Myles Rudge. The song, about a mouse that wears clogs, and arranged in waltz time, was notably recorded by Ronnie Hilton in 1965 and issued on the His Master's Voice label.", "Category:Songs written by Myles Rudge"]}]}}