{"wiki_id": "http://www.wikidata.org/entity/Q6969699", "itemLabel": "Nathaniel Jarvis", "itemDescription": "footballer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathaniel_Jarvis", "wikipedia_page": {"main": "Nathaniel Stephen Jarvis (born 20 October 1991) is a Welsh-born Antigua and Barbuda international footballer who plays as a striker for Barry Town United. He was previously with Cardiff City as a youngster.", "link_mentions": [{"page": "Barry Town United F.C.", "response": ["|FW|| Nathaniel Jarvis"]}, {"page": "Nathaniel", "response": ["* Nathaniel Jarvis (born 1991), Welsh footballer"]}, {"page": "Gloucester City A.F.C.", "response": ["* Nathaniel Jarvis – Eight caps, two goals, for Antigua and Barbuda."]}, {"page": "1991 in Wales", "response": ["*20 October - Nathaniel Jarvis, footballer"]}, {"page": "Cardiff City F.C. Under-23s and Academy", "response": [" Nathaniel Jarvis"]}, {"page": "Jarvis (name)", "response": ["* Nathaniel Jarvis, Welsh footballer"]}, {"page": "2010–11 Cardiff City F.C. season", "response": ["|49||Nathaniel Jarvis||CF||||Cardiff||||0||0||Academy||1 June 2010||Trainee||2011"]}, {"page": "2011–12 Newport County A.F.C. season", "response": ["|15||FW||align=\"left\"| Nathaniel Jarvis||20 (11)||6||5 (3)||3||25 (14)||9", "|9 Sep 2011||FW|| Nathaniel Jarvis||Cardiff City||9 Oct 2011", "|1 Jan 2012||FW|| Nathaniel Jarvis||Cardiff City||End of season", "|FW ||15|| Nathaniel Jarvis || || "]}, {"page": "2011–12 Cardiff City F.C. season", "response": ["|Nathaniel Jarvis", "|33||FW ||Nathaniel Jarvis || 0 || 0 || 1 || 0 || 1", "|33 ||FW ||Nathaniel Jarvis || 0 || 0 || 0 || 0 || 1 || 0 || 0 || 0 || 1 || 0"]}, {"page": "Ibrahim Farah", "response": ["Farah is of Somali heritage. Born in the Butetown area of Cardiff, his family moved to the Splott area of the City shortly after he was born where he attended Moorland Primary School. Farah began his career with his home town side Cardiff City, joining their academy at the age of 14, whilst playing for his then local team against Cardiff City Academy who quickly signed him up after impressing. Alongside Nathaniel Jarvis and Alex Evans  he  signed  schoolboy forms at the start of the 2008–09 season. On 23 May 2011, Farah was offered his first professional contract by Cardiff City alongside Alex Evans and Nathaniel Jarvis. Farah has been given the number 32 shirt for the upcoming season. He made his professional debut against Oxford United on 10 August, in the League Cup."]}, {"page": "Alex Evans (footballer)", "response": ["Evans  began his career with his local side Treharris Western, joining Cardiff academy at an early age of 9. Alongside Nathaniel Jarvis he  signed  schoolboy forms at the start of the 2008–09 season. On 23 May 2011, Evans was offered his first professional contract by Cardiff City alongside Ibrahim Farah and Nathaniel Jarvis. He made his debut in a 3-1 win over Oxford United, where he started next to Gabor Gyepes. At the end of the season, Evans was released by the club."]}, {"page": "2012 Football League Cup Final", "response": ["Cardiff entered the 2011–12 Football League Cup in the first round where they faced Oxford United. The match played at the Kassam Stadium saw Cardiff take the lead in the 10th minute when Craig Conway scored. Oxford equalised 20 minutes later courtesy of a Simon Clist goal. Neither side was able to score a winning goal during the remainder of the match, which went into extra-time at 1–1. Two goals from Peter Whittingham and Nathaniel Jarvis secured a 3–1 victory for Cardiff. Their opponents in the second round were Huddersfield Town. Two goals in the first 16 minutes courtesy of Gabor Gyepes and Jon Parkin gave Cardiff an early 2–0 lead, which they held until the 55th minute when Huddersfield reduced the deficit to 2–1 courtesy of a Jordan Rhodes goal. Daniel Ward equalised for Huddersfield in the 69th minute before Rhodes scored his second goal of the match to give Huddersfield a 3–2 lead in the 87th minute. Cardiff equalised two minutes into stoppage time when Don Cowie headed the ball in from close range. With the score at 3–3 after 90 minutes the match went to extra-time.  A goal each from Conway and Cowie gave Cardiff a 5–3 victory and progression to the third round."]}, {"page": "2012 FA Trophy Final", "response": ["|FW ||15|| Nathaniel Jarvis || || "]}, {"page": "2012–13 Cardiff City F.C. season", "response": ["|33||Nathaniel Jarvis||CF||||Cardiff||||1||1||–||–||Academy||1 July 2011||Trainee||30 June 2013", "|33||FW||Nathaniel Jarvis||0||1||0||1", "|6||30 October||Millwall||H||4–0||Etien Velikonja (45, 63, 77), Nathaniel Jarvis (73)|| ||Report"]}, {"page": "2014 Caribbean Cup qualification", "response": ["* Nathaniel Jarvis"]}, {"page": "List of Cirencester Town F.C. seasons", "response": ["| Nathaniel Jarvis"]}, {"page": "2015–16 Southern Football League", "response": ["| Nathaniel Jarvis"]}, {"page": "2018–19 National League", "response": ["|align=left|Nathaniel Jarvis"]}]}}