{"wiki_id": "http://www.wikidata.org/entity/Q6967865", "itemLabel": "Nat Minford", "itemDescription": "Northern Irish politician (1912-1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nat_Minford", "wikipedia_page": {"main": "Nathaniel Owens Minford (2 December 1912 – 5 September 1975), known as Nat Minford, was a Unionist politician in Northern Ireland.\nMinford was born in Templepatrick and was the son of Hugh Minford, who became an Ulster Unionist Party (UUP) Member of the Parliament of Northern Ireland.  Nat studied at the Royal Belfast Academical Institution before following his father into farming, and also going into business.Minford's father died in 1950, and Nat was selected to contest the resulting by-election in Antrim for the UUP.  He was successful and held the seat at each election until the Parliament was prorogued in 1972.\nAt the end of an Orange Institution meeting during the 1951 general election, the chair gave the customary declaration \"God Save the King!\".  Minford replied \"and to hell with the Pope!\"  An Irish News reporter was in the meeting and included this remark in his report.  The following year, the Ulster Unionist Council rebuked him for this, stating they regretted this insult to their \"Roman Catholic fellow citizens\" and noted their \"detestation of such statements, which are entirely opposed to the principles of the Unionist Party\".Minford had much to say on Catholicism.  In 1959, he called for security screening of civil servants and asked for the percentage of Catholics employed to be made known.  During the 1960s, Minford attended a Catholic church service on the occasion of the opening of a secondary school in Andersonstown.  For this, he was questioned by his Orange Lodge, but was let off with a warning.  He later stated that he considered it acceptable for Catholics to be members of the UUP, but that they could never be Unionist Members of Parliament.\nMinford received a threat from the Ulster Volunteer Force in 1966, and as a result, the Stormont Committee on Privilege was set up.In 1967, Minford became the Parliamentary Secretary to the Ministry of Development.  The following year he became the Ministry's Senior Parliamentary Secretary, and in 1969 he became its Minister of State, also joining the Privy Council of Northern Ireland.  In 1971, Minford became the Minister and Leader of the House of Commons.  He was the last holder of the post.Minford was elected to the Northern Ireland Assembly in South Antrim, and became the Speaker of the Assembly. In 1982, Ian Paisley described Minford as \"...reckoned to be an extreme Right-wing Unionist... However, Nat Minford gained the respect of the Assembly.\"\n\n", "link_mentions": {}}}