{"wiki_id": "http://www.wikidata.org/entity/Q6968864", "itemLabel": "Nathan Arnold", "itemDescription": "Footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Arnold", "wikipedia_page": {"main": "Nathan Anthony Arnold (born 26 July 1987) is an English football manager and former professional footballer who is manager of Newark Town.\nAs a player he was active between 2005 and 2020 and was primarily a winger but could also play as a striker. He played for Lincolnshire sides Grimsby Town and Lincoln City; with The Mariners he scored the third goal in stoppage time to earn Grimsby promotion back to the Football League in a 3-1 victory over Forest Green Rovers at Wembley Stadium in the National League play-off final. The following season he also scored the only goal of the game for a Non-League Lincoln side in a 1-0 win over Ipswich Town in the FA Cup third round and would go on to be part of the Imps side that were eventually knocked out in the Quarter finals by Arsenal. He also played professionally for Mansfield Town and Cambridge United with spells at Non-League sides Hyde United, Alfreton Town, Salford City, Boston United and Altrincham.", "link_mentions": [{"page": "Jonathan D'Laryea", "response": ["On 27 August, D'Laryea received an England C call up by manager Paul Fairclough along with his Mansfield Town teammate Nathan Arnold."]}, {"page": "Arnold (surname)", "response": ["*Nathan Arnold (born 1987), English footballer"]}, {"page": "Craig Disley", "response": ["On 1 November 2017 Disley and his All Star team were defeated 7–2 by the current Grimsby Town team in his testimonial game. Disley's team included former Town players such as Shaun Pearson, Lenell John-Lewis, Liam Hearn, Aristote Nsiala, Nathan Arnold and Michael Boulding. With goals coming from Disley himself and Ross Hannah."]}, {"page": "Pádraig Amond", "response": ["On 1 July 2015, Amond signed for National League club Grimsby Town on a one-year contract. Grimsby fended off interest from League of Ireland Premier Division champions Dundalk, NIFL Premiership club Linfield as well as a number of English clubs in League Two to sign Amond. On 8 August 2015, he scored a debut opening goal for Grimsby in the 43rd minute during a 2–2 draw against Kidderminster Harriers. Amond scored a brace in a 4–1 home win against Bromley, scoring the opener after three minutes when Nathan Arnold chested a cross into Amond's path who finished past the keeper into the bottom corner; he scored the math's third goal on 25 minutes, Arnold's cross was headed back goalwards by Josh Gowling at the far post and Amond volleyed into the roof of the net. On 13 October 2015, Amond netted his first hat-trick in English football and finished with 4 goals in a 7–0 victory against FC Halifax Town."]}, {"page": "Lenell John-Lewis", "response": ["In May 2014 he activated a clause in his contract giving him another year with The Mariners. On 25 October 2014 he scored a brace against Guiseley in the 3–0 victory of the FA Cup First Round, heading in the second goal from a blocked Nathan Arnold shot, the third goal of the game came when Arnold fired the ball across goal after cutting in from the left for John-Lewis to tap in at the far post."]}, {"page": "Warren Burrell", "response": ["Burrell is a graduate of the Mansfield Town youth academy, and made his first-team debut in the last game of the 2007–08 season against Dagenham & Redbridge, coming on as a substitute for Nathan Arnold. He was also captain of Mansfield's youth team, and signed a professional contract with the club in June 2008. On 12 January 2016 Warren re-signed with Harrogate Town."]}, {"page": "2009–10 Stevenage Borough F.C. season", "response": ["Stevenage then hosted three Football League sides at Broadhall Way within the space of six days. Firstly, Borough entertained Millwall on 25 July as part of the £130,000 deal that took ex-Stevenage striker Steve Morison to The Den in May 2009. Stevenage lost the game 2–1, with a goal from Mitchell Cole sandwiched in between two from Morison for Millwall. Borough then hosted Peterborough United, who annually visit Broadhall Way as part of the deal that took winger George Boyd to the Cambridgeshire based club in January 2007. Stevenage lost the game 2–0, with Shaun Batt, who came through the youth system at Stevenage, scoring one of the goals. Borough midfielder Mitchell Cole was also stretchered off with an ankle injury in the first half of the same game. Later that week, it was announced that utility player Peter Vincenti had gone on a three-month loan deal to recently relegated Conference South side Woking. On 31 July, Stevenage played League One club Southend United. Stevenage won the game 2–1, with two first half goals from Joel Byrom and Darren Murphy. The following day, Stevenage played out a 0–0 draw with Conference South side Woking in their final pre-season fixture. Despite joining Woking on-loan, Peter Vincenti featured for his parent club, whilst former Mansfield Town winger Nathan Arnold also played a part in the match. However, it was announced that Vincenti's loan deal to Woking had fallen through after Borough boss Graham Westley decided he wants to keep the player as cover. On 3 August, Championship side Peterborough United announced that left-back Danny Blanchett would start a two-day trial at Broadhall Way. On 5 August, just three days before the start of the new Conference Premier campaign, striker Jerome Anderson joined Southern League Premier Division outfit Brackley Town on loan. On 7 August, Westley announced that Stevenage had signed Danny Blanchett on loan from Peterborough United."]}, {"page": "2009–10 Grimsby Town F.C. season", "response": ["Mike Newell took Grimsby Town to the 2009 South West Challenge Cup in Devon, in which the rules allowed him to make ten changes in each match, which he did on each occasion. They started off strong in pre-season with a one-nil win against Belgian side R.R.F.C. Montegnée, with a late free kick from Jamie Clarke. They then played in a five-goal thriller against Yeovil Town in which Grimsby Town won 3–2, with Barry Conlon, Danny North, Nathan Arnold all scoring, going on to reach the semi-final and finishing top of their group. Then continuing their strong form they beat Rushden & Diamonds 4–1 with Adrian Forbes, Jean-Louis Akpa Akpro, Nathan Arnold, Danny North all scoring, putting them into the final. After reaching the Final they had to withdraw on the grounds that they could not agree a kick-off time with their opponents Luton Town, in which there would be police at the ground, providing protection for the fans, as fans' safety concerns had been expressed earlier in the tournament. During the 2009 South West Challenge Cup Mike Newell named two trialists in his 23-man squad, who were Nathan Arnold from Mansfield Town in which he impressed by scoring two goals and he also named Swansea City striker  Chris Jones in his squad, although he didn't score, he impressed enough to be offered a contract. Also joining for their last match, defender Sol Davis from Luton Town joined up for a trial.", "Manager Mike Newell took two of the trialists Nathan Arnold, Chris Jones in his 23-man squad to the 2009 South West Challenge Cup and defender Sol Davis joined up with the squad mini way through the 2009 South West Challenge Cup and was given 45 minutes to impress. Before the 2009 South West Challenge Cup Mike Newell had a number of strikers on trial, but none of them were offered a contract. Although not scoring Chris Jones impressed enough to be offered a contract by the club and which was later accepted.", "| # ||  || MF || Nathan Arnold || Mansfield Town || 22 || 4 || 2 ||Contract Offered but Declined "]}, {"page": "2011–12 Sheffield Wednesday F.C. season", "response": ["Having arrived back home from the tour in Austria, Sheffield Wednesday faced their first opponents back in England on 16 July, a day before this game, manager Gary Megson announced the club's new captain Rob Jones, who had only joined permanently weeks earlier. The Owls then played Worksop Town away in the first set of pre-season games back in England, in which they won 0–3, thanks to goals from Lewis Buxton on the eleventh minute, Gary Madine ten minutes later and defender Mark Beevers on the sixty-seventh minute. Wednesday's next friendly took place across Sheffield at Don Valley Stadium, where they won Rotherham United 1–2. The Owls took a two-goal lead after goals from Lewis Buxton and Gary Madine, before Adam Le Fondre pulled one back for Rotherham United, which was one of his last goals for Rotherham United as he later went on to sign for Reading. As well as the Wednesday first team taking part in friendlies, a Sheffield Wednesday XI – mainly made up of the Sheffield Wednesday Academy – also took part in several friendlies. The first of these games took place against Stocksbridge Park Steels, in which the end result was a 2–0 loss, after an own goal from Ayo Obileye and a goal from Mark Ward. Sheffield Wednesday then went on to play their first home game of the pre-season. The game against Leeds United and finished in a 1–1 draw, with goals from ex-Leeds United player David Prutton finishing after a dribble into the box on the eighth minute, and an eighty-fourth-minute goal from the penalty spot by Max Gradel. Max Gradel's goal was also the last he scored for his club, as he then went on to move to France by joining Marseille. One day later Sheffield Wednesday's XI were in action again, they played the oldest club in the world – local side Sheffield FC. The game ended in a 3–0 loss for the Owls XI, after goals from James Gregory, Danny Kirkland and Connor Higginson. On 26 July the Owls signed central defender Danny Batth on loan for six months from Wolverhampton Wanderers, with the deal due to end in January. Later that same evening, the Owls were in action away to Barnsley. With goals from David Perkins on the seventh minute, and James O'Brien on the eightieth, it ended in a 2–0 loss. Again, a day later on 27 July, the Owls XI played a match, this against local side Hallam FC, whom are six leagues below the first team of Sheffield Wednesday. At half time the game was level at 1–1, with the Wednesday XI scoring their first goal of the pre-season campaign, after they conceded in the third minute from a goal by Matthew Thompson, then Brad Tomlinson equalising in the thirty-second. Thompson scored his second goal of the game to put Hallam FC back in front, and then thirteen minutes later Hallam FC finished off the game with a goal from David Heaver. Although the Owls XI did score a second with six minutes to go thanks to a goal from Mitcham Husbands, the game did finish in a 3–2 loss. The final friendly for the Sheffield Wednesday first team was at home to Premier League side Stoke City on 30 July. Playing their toughest opposition of the pre-season, The Owls managed to end the game in a goalless draw. The final game for the Sheffield Wednesday XI was against Alfreton Town. With Alfreton Town only two leagues below the first team, it was by far their toughest opponents of the pre-season. However, although the game was going to be tough, the outcome turned out to be an embarrassing loss for the Wednesday youngsters – losing by an abysmal 14–0. The game started with an own goal by goalkeeper Sean Cuff, and then thirteen more goals followed, including hat-tricks from Nathan Arnold, Nathan Jarman, and Paul Clayton."]}, {"page": "2007–08 Mansfield Town F.C. season", "response": ["|align=\"left\"|16||align=\"left\"|FW||align=\"left\"| Nathan Arnold"]}, {"page": "2014 FA Trophy Final", "response": ["|MF ||24|| Nathan Arnold || || "]}, {"page": "2014–15 Cambridge United F.C. season", "response": ["|20 July 2014||MF|| Nathan Arnold|| Grimsby Town||30 June 2015||"]}, {"page": "2015–16 Cambridge United F.C. season", "response": ["| 1 July 2015 || AM ||  || Nathan Arnold || Grimsby Town  || Free transfer || "]}, {"page": "2015 Conference Premier play-off Final", "response": ["Grimsby Town got off to the perfect start when a purposeful run from Nathan Arnold set up Lenell John-Lewis to shoot from inside the penalty area. His shot was saved by Bristol Rovers goalkeeper Will Puddy but it deflected off John-Lewis' face into the goal, giving the Mariners the lead after just 1:38. Grimsby kept up the pressure and were unfortunate not to be playing against ten men as Puddy handled Ollie Palmer's shot outside the area. However, referee Ross Joyce deemed the offence only worthy of a yellow card. Just over 10 minutes later and Rovers were level after Grimsby failed to deal with a Jake Gosling corner, leaving Ellis Harrison to drive the ball past James McKeown.", "|LM ||20 || Nathan Arnold"]}, {"page": "2016 FA Trophy Final", "response": ["|MF ||20||  Nathan Arnold || || "]}, {"page": "2016 National League play-off Final", "response": ["|RM||20||Nathan Arnold||"]}, {"page": "2016–17 Grimsby Town F.C. season", "response": ["| 1 July 2016 || RW ||  || Nathan Arnold || Lincoln City || Free transfer || "]}]}}