{"wiki_id": "http://www.wikidata.org/entity/Q6969758", "itemLabel": "Nathaniel Mehr", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathaniel_Mehr", "wikipedia_page": {"main": "Nathaniel Mehr is a leftwing British journalist whose has written for several publications including The Morning Star newspaper and Tribune magazine and Red Pepper.\nFrom 2008 to 2010 Mehr was co-editor of the London Progressive Journal, an online current affairs magazine. His first book, Constructive Bloodbath in Indonesia: The US, Britain and the Mass Killings of 1965-66, was published by Spokesman Books in May 2009.  In January 2011, Spokesman Books published a new edition of J.A. Hobson's seminal work, 'Imperialism: A Study', which featured a new introduction by Nathaniel Mehr.  Nathaniel Mehr is currently an associate editor of Review 31, an online literary magazine that was launched in October 2011.\n\n", "link_mentions": [{"page": "Andrew Murray (trade unionist)", "response": ["The Imperial Controversy (2009) was described Nathaniel Mehr in Tribune magazine as \"an important and timely book\". In 2019, Murray attracted controversy for arguing in the book that Nazi Party leader Adolf Hitler is the most hated historical figure because he killed white rather than non-white people. Murray wrote, \"Hitler is uniquely excoriated because his victims were almost all white Europeans, while those of Britain (and other classic colonialisms – French, Belgian, Dutch, Italian and Wilhelmine German) were Asian, African and Arabs.\" He also wrote elsewhere in the book: \"There is nothing in the imperial record as chilling as the systematic extermination of the great majority of Europe's Jews.\""]}, {"page": "Mehr (name)", "response": ["* Nathaniel Mehr, British journalist"]}, {"page": "London Progressive Journal", "response": ["From 2008 to 2011 Nathaniel Mehr was the editor of LPJ. Since June 2011 Tomasz Pierscionek and Emmeline Ravilious have been editing the magazine."]}]}}