{"wiki_id": "http://www.wikidata.org/entity/Q6962590", "itemLabel": "Nancy Carroll", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Nancy_Carroll_(British_actress)", "wikipedia_page": {"main": "Nancy Carroll (born 1974) is a British actress. She has worked extensively in theatre productions, particularly with the Royal Shakespeare Company. She also has numerous film and television credits, including a long-running feature role as Lady Felicia in the BBC series Father Brown.", "link_mentions": [{"page": "Arcadia (play)", "response": ["On 27 May 2009, a London production, directed by David Leveaux, opened at the Duke of York's Theatre starring Dan Stevens (Septimus Hodge), Samantha Bond (Hannah Jarvis), Jessie Cave (Thomasina Coverly), Nancy Carroll (Lady Croom), Trevor Cooper (Richard Noakes), Sam Cox (Jellaby), Lucy Griffiths (Chloë Coverly), Tom Hodgkins (Captain Brice), Hugh Mitchell (Augustus/Gus Coverly), Neil Pearson (Bernard Nightingale), George Potts (Ezra Chater) and Ed Stoppard (Valentine Coverly). The production recouped its costs and closed on 12 September 2009.It was produced by Sonia Friedman. Arcadia Recoups Production Costs, Finishes Run Sept 12"]}, {"page": "Nancy Carroll", "response": ["Nancy Carroll (born Ann Veronica Lahiff; November 19, 1903 – August 6, 1965) was an American actress.Obituary Variety, August 11, 1965. She started her career in Broadway musicals and then became an actress in sound films and was in many films from 1927 to 1938. She was then in television roles from 1950 to 1963. She received a star on the Hollywood Walk of Fame on February 8, 1960.", "*Photographs of Nancy Carroll"]}, {"page": "Duke of York's Theatre", "response": ["* Arcadia (27 May 2009 – 12 September 2009) by Tom Stoppard starring Samantha Bond, Nancy Carroll, Jessie Cave, Trevor Cooper, Sam Cox, Lucy Griffiths, Tom Hodgkins, Hugh Mitchell, Neil Pearson, George Potts, Dan Stevens and Ed Stoppard", "* The Moderate Soprano (12 April 2018 – 30 June 2018) by David Hare, starring Roger Allam and Nancy Carroll"]}, {"page": "Rachael Stirling", "response": ["Stirling starred onstage in The Priory directed by Jeremy Herrin at the Royal Court Theatre in 2009. Her role as Rebecca earned her a nomination for Laurence Olivier Award for Best Performance in a Supporting Role. In 2010 she appeared as Helena in Peter Hall's production of A Midsummer Night's Dream at the Rose Theatre, Kingston. Stirling starred as Lady Chiltern in a 2010 production of An Ideal Husband at the Vaudeville Theatre, for which she received her second nomination for a Laurence Olivier Award. From February to April 2012, she appeared as Sylvia alongside Mark Gatiss, Tobias Menzies, and Nancy Carroll in The Recruiting Officer, the acclaimed production at the Donmar Warehouse directed by newly appointed artistic director Josie Rourke."]}, {"page": "Ben Miller", "response": ["Starring opposite Nancy Carroll and Diana Vickers, Miller played Robert Houston in the play The Duck House by Dan Patterson and Colin Swash. The show is a political satire based on the UK parliamentary expenses scandal."]}, {"page": "Evening Standard Theatre Awards", "response": ["* 2010 – Nancy Carroll for After the Dance"]}, {"page": "Alleyn's School", "response": ["* Nancy Carroll (born 1974), actress"]}, {"page": "The Gathering Storm (2002 film)", "response": ["* Nancy Carroll as Diana Churchill"]}, {"page": "Cambridge Spies", "response": ["* Nancy Carroll as Frances Doble"]}]}}