{"wiki_id": "http://www.wikidata.org/entity/Q6969314", "itemLabel": "Nathan Rogers", "itemDescription": "Welsh landowner", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Rogers_(writer)", "wikipedia_page": {"main": "Nathan Rogers (30 May 1638 – after 1708) was a landowner, lawyer, politician and writer in Monmouthshire, Wales. He is notable for his radical polemic Memoirs of Monmouth-Shire..., published in 1708 and later known as The Secret Memoirs of Monmouthshire.", "link_mentions": [{"page": "Wentwood", "response": ["The edges of the wood were gradually cleared and felled away in the 16th century and 17th century by farmers.  In 1678 Wentwood was the scene of riots led by Nathan Rogers and Edward Kemys against the actions of the Marquis of Worcester, Henry Somerset, who, as Lord Lieutenant of Monmouthshire and Governor of Chepstow Castle, enclosed some  of the forest for his own use, and began to fell trees for use in his ironworks at Tintern. The tenants of the area, including Rogers, claimed that the ancient rights to the forest belonged to them, and rioted when 50 armed men of Worcester's arrived to carry away the felled wood. Molly McLean, The Wentwood Forest riot: property rights and political culture in Restoration England, in Political Culture and Cultural Politics in Early Modern Europe: Essays presented to David Underdown, Manchester University Press, 1995, , pp.112–132"]}, {"page": "Nathan Rogers", "response": ["Nathan Rogers (born July 16, 1979 in Hamilton, Ontario) is a Canadian folk musician/songwriter. He is the son of Stan and Ariel Rogers. His father, a folk musician and songwriter, died in a fire aboard Air Canada Flight 797 on June 2, 1983.", "In 2017, American blues and Americana artist Watermelon Slim recorded a CD titled Golden Boy in Winnipeg, produced by Scott Nolan, that included an a cappella version of Stan Rogers' \"Barrett's Privateers.\" Nathan Rogers honored Slim by being part of the men's singing group backing him in this recording.", "* Nathan Rogers", "*Borealis Records: Nathan Rogers"]}, {"page": "List of people from Newport", "response": ["* Nathan Rogers (writer)"]}, {"page": "Nathaniel Rogers", "response": ["*Nathan Rogers (writer) (1638– after 1708), Welsh political radical and writer", "*Nathan Rogers (born 1979), Canadian folk musician and songwriter"]}]}}