{"wiki_id": "http://www.wikidata.org/entity/Q6969181", "itemLabel": "Nathan Kirsh", "itemDescription": "South African businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Kirsh", "wikipedia_page": {"main": "Nathan \"Natie\" Kirsh (born 6 January 1932) is a Swazi billionaire businessman. He heads the Kirsh Group, which holds a majority stake in New York state cash and carry operation Jetro Holdings, owner of Restaurant Depot and Jetro Cash & Carry. The Group also holds equity and investments in Australia, Eswatini, the UK, the US, and Israel. \nForbes estimated his wealth at $4.7 billion in April 2021, making him the 608th richest person in the world. He was also listed on the UK’s Sunday Times Rich List 2018, and the wealthiest person in Swaziland by Forbes.", "link_mentions": [{"page": "Tower 42", "response": ["The building today is multi-tenanted and comprises Grade A office space and restaurant facilities, with restaurants on the 24th and 42nd floors. In 2011, it was bought by the South African businessman Nathan Kirsh for £282.5 million.\"South African tycoon Nathan Kirsh buys Tower 42\" Daily Telegraph 21 December 2011 Retrieved 21 December 2011", "The building was subsequently acquired by Hermes Real Estate and BlackRock's UK property fund in 1998 for 226 million. In 2010 they put the property on the market at an expected price of 300 million. This would potentially have been the largest single commercial property sale in the City of London in 2010. In July 2010 it was reported that Chinese Estates Group had entered exclusive discussions to buy Tower 42. but this deal did not conclude and it was sold in 2011 to South African businessman Nathan Kirsh for £282.5 million."]}, {"page": "Potchefstroom High School for Boys", "response": ["* Nathan Kirsh, Philanthropist and Forbes Billionaire"]}, {"page": "List of white Africans of European ancestry", "response": ["*Nathan Kirsh, businessman"]}, {"page": "List of University of the Witwatersrand people", "response": ["* Nathan Kirsh, South African-born Swazi business magnate, with a property empire spanning the UK, Swaziland and Australia; has Swazi citizenship; has residency status in the UK and the USA"]}, {"page": "Agang South Africa", "response": ["On 28 January 2014, the Democratic Alliance (DA) announced that Ramphele had accepted an invitation to stand as its presidential candidate in the 2014 general election, and the DA and Agang were set to merge. On 31 January 2014, Ramphele stated that she would not take up DA party membership and would remain the leader of Agang, resulting in confusion. On 2 February 2014, Helen Zille stated that Ramphele had reneged on her agreement to stand as the DA's presidential candidate. Ramphele subsequently apologised for the reversal of her decision, saying that the timing was not right as the reaction to it had shown people were unable to overcome race-based party politics. On 9 February 2014, following statements by Helen Zille that donor funding issues were behind the failed merger, Ramphele named business magnate Nathan Kirsh as a funder of Agang and said he would continue to fund the new party."]}, {"page": "Restaurant Depot", "response": ["#REDIRECT Nathan Kirsh"]}, {"page": "Jetro Cash & Carry", "response": ["#REDIRECT Nathan Kirsh"]}, {"page": "Jetro Holdings", "response": ["#REDIRECT Nathan Kirsh"]}, {"page": "Philip Kirsh", "response": ["Philip William Kirsh (born 1964/65) is a South African businessman, the son of the South African-born UK-based billionaire property developer Nathan Kirsh."]}, {"page": "Kirsh", "response": ["*Nathan Kirsh (born 1932), South African-born business magnate"]}, {"page": "History of the Jews in Eswatini", "response": ["===Nathan Kirsh===", "Nathan Kirsh (born 6 January 1932) is a South African/Swazi/Eswatini billionaire businessman. He heads the Kirsh Group, which holds a majority stake in New York cash and carry operation Jetro Holdings, owner of Restaurant Depot and Jetro Cash & Carry. The Group also holds equity and investments in Australia, Swaziland (now Eswatini), the UK, the US, and Israel. Bloomberg estimated his wealth at $6.09 billion in March 2019, ranking him at #267 on its \"Billionaires Index\". He was also listed on the UK's Sunday Times Rich List 2018, and was named as the wealthiest person in Swaziland/Eswatini by Forbes."]}]}}