{"wiki_id": "http://www.wikidata.org/entity/Q6964677", "itemLabel": "Naomi Phoenix", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Naomi_Phoenix", "wikipedia_page": {"main": "Naomi Phoenix is an English singer-songwriter from Warwick, who had several releases between 1997 and 1999 on Gut under the alias Naomi. Naomi's name at the time of the releases was Naomi Freeth, but since leaving Gut has since changed her name to Naomi Phoenix.\nWhilst with Gut, Phoenix's label mates were Sound 5, Jimmy Somerville, James Taylor Quartet, Space, Arabesque and Tom Jones. Naomi's band was formed of Phoenix (vocals and guitar), Spike Barker (drums), Simon 'Sickboy' Bayliss (bass), Dan Whitehouse (guitar) and Dean Deavall (keyboards) and produced by Gavin Monaghan, who is also known for his work with Ocean Colour Scene, Editors, Scott Matthews, Nizlopi and The Twang. Phoenix was educated at The Trinity Catholic School in Warwick, and was in the same year at this school as the folk duo Nizlopi. Phoenix released her first single \"Personal Touch\" as a limited release of 3,000 copies in 1997. This debut single was supported several times by the Melody Maker music magazine featuring in their 'Hit List' prior to its release on 18 October 1997, given 'Single of the Week' following its release in December 1997, and given a large spread interview as their 'Pick of the Week' on 6 December 1997. Phoenix also caught the attention of the NME. She has also appeared on national television including 'Music File' on BBC Two and also The Melinda Messenger Show on Channel 5.Phoenix has supported Beth Orton, Saint Etienne, Hurricane #1, and Heather Nova.", "link_mentions": [{"page": "Trinity Catholic School", "response": ["* Naomi Phoenix, musician"]}, {"page": "Naomi Pheonix", "response": ["#REDIRECT Naomi Phoenix"]}, {"page": "Naomi Freeth", "response": ["#REDIRECT Naomi Phoenix "]}, {"page": "Phoenix (surname)", "response": ["* Naomi Phoenix, English singer-songwriter"]}, {"page": "Naomi (given name)", "response": ["*Naomi Phoenix, English singer-songwriter"]}]}}