{"wiki_id": "http://www.wikidata.org/entity/Q6963006", "itemLabel": "Nancy Spender", "itemDescription": "British artist (1909-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nancy_Spender", "wikipedia_page": {"main": "Nancy Culliford Spender (née Sharp; 29 October 1909 – 20 June 2001) was a British painter, described on her death as \"much underrated\".", "link_mentions": [{"page": "Philip Spender", "response": ["Philip Spender (1943- ) is a prominent public-sector fundraiser who has worked with Index on Censorship, the Writers and Scholars Educational Trust, and OneWorld Online. He is the son of the painter Nancy Spender and the explorer Michael Spender, a nephew of the poet Stephen Spender, and a trustee of the Stephen Spender Memorial Trust."]}, {"page": "The Earth Compels", "response": ["The Earth Compels is dedicated \"To NANCY\" (Nancy Coldstream, later Nancy Spender, with whom Louis MacNeice had an affair during 1937–38), and has an epigraph from a Greek tragedy MacNeice was then translating, Euripides' Hippolytus. According to Jon Stallworthy, in his biography of Louis MacNeice, the epigraph may be roughly translated: 'We are manifestly all obsessively in love with this thing that glitters on the earth.' Jon Stallworthy: Louis MacNeice. London: Faber and Faber, 1995. Paperback edition 1996, pp. 222-223.", "The first poem in the collection, 'Carrickfergus', is autobiographical, and describes MacNeice's childhood in Carrickfergus, Northern Ireland. Other poems reflect MacNeice's life in the years 1935 to 1937. In November 1935 MacNeice's first marriage had collapsed when his wife Mary left him for Charles Katzman; after their divorce had been finalised in 1936, MacNeice wrote The Sunlight on the Garden for Mary. In early 1937 MacNeice began an affair with Nancy Coldstream (later Nancy Spender), and Nancy provided the inspiration for 'Leaving Barra' (as well as for two sections of MacNeice's next volume of poetry, Autumn Journal). The poem 'Iceland' reflects the journey MacNeice took with W. H. Auden in the summer of 1936, while 'Bagpipe Music' was inspired by a journey to the Hebrides in 1937 and was later described by MacNeice as 'a satirical elegy for the Gaelic districts of Scotland and indeed for all traditional culture'.Jon Stallworthy: Louis MacNeice, p. 212. Rugby Football Excursion describes a journey from London - leaving from Euston railway station - to Dublin, in order to watch a rugby game at Lansdowne Road. The final poem in the collection, Epilogue, is subtitled 'For W. H. Auden', and reviews the Iceland trip MacNeice and Auden had taken together; the poem mentions events that had occurred while MacNeice and Auden were in Iceland, such as the fall of Seville (marking the start of the Spanish Civil War) and the Olympic Games in Berlin."]}, {"page": "Zoo (book)", "response": ["Zoo is illustrated with drawings, mainly in carbon pencil, by the English artist Nancy Coldstream (later Nancy Spender), under her maiden name of Nancy Sharp. Nancy Coldstream had earlier provided illustrations for I Crossed the Minch, a book on the Hebrides by Louis MacNeice."]}, {"page": "Spender (surname)", "response": ["*Nancy Spender (1909–2001), English painter"]}, {"page": "Nancy Sharp", "response": ["#REDIRECT Nancy Spender"]}]}}