{"wiki_id": "http://www.wikidata.org/entity/Q697096", "itemLabel": "Cecil Beaton", "itemDescription": "English photographer and scenographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cecil_Beaton", "wikipedia_page": {"main": "Sir Cecil Walter Hardy Beaton,  (14 January 1904 – 18 January 1980) was a British fashion, portrait and war photographer, diarist, painter, and interior designer, as well as an Oscar–winning stage and costume designer for films and the theatre.\n\n", "link_mentions": [{"page": "Academy Award for Best Production Design", "response": ["| Gene Allen and Cecil Beaton"]}, {"page": "George Cukor", "response": ["Two years later, Cukor achieved one of his greatest successes with My Fair Lady (1964). Throughout filming, there were mounting tensions between the director and designer Cecil Beaton; Cukor was thrilled with leading lady Audrey Hepburn, but the crew was less enchanted with her diva-like demands.Levy, p. 289. Although several reviews were critical of the film – Pauline Kael said it \"staggers along\" and Stanley Kauffmann thought Cukor's direction was like \"a rich gravy poured over everything, not remotely as delicately rich as in the Asquith-Howard 1937 [sic] Pygmalion\" —Levy, p. 293. the film was a box-office hit which won him the Academy Award for Best Director, the Golden Globe Award for Best Director, and the Directors Guild of America Award after having been nominated for each several times."]}, {"page": "January 14", "response": ["*1904 – Cecil Beaton, English photographer, painter, and costume designer (d. 1980)"]}, {"page": "January 18", "response": ["*1980 – Cecil Beaton, English fashion designer and photographer (b. 1904)"]}, {"page": "My Fair Lady", "response": ["| Cecil Beaton"]}, {"page": "Robert Fripp", "response": ["Fripp married singer and actress Toyah Willcox on 16 May 1986 in Poole, Dorset, England. From December 1987 until July 1999 they lived at and renovated Reddish House, the former home of Cecil Beaton, in the village of Broad Chalke in Wiltshire.Broad Chalke, A History of a South Wiltshire Village, its Land & People Over 2,000 years. By 'The People of the Village', 1999"]}, {"page": "Thomas Gainsborough", "response": ["* Cecil Beaton's play Gainsborough's Girls is set in London in 1774 when the painter moved his family to the capital. Previously unpublished, it received its first performance in Sudbury, Suffolk in 2019, followed by a short run at the Tower Theatre, London.http://www.towertheatre.org.uk/ggirls.htm"]}, {"page": "1980", "response": ["* January 18 – Sir Cecil Beaton, English photographer (b. 1904)"]}, {"page": "1904", "response": ["** Cecil Beaton, English photographer (died 1980)"]}, {"page": "Salvador Dalí", "response": ["Photographers with whom he collaborated include Man Ray, Brassaï, Cecil Beaton, and Philippe Halsman. Halsman produced the Dalí Atomica series (1948) –  inspired by Dalí's painting Leda Atomica  –  which in one photograph depicts \"a painter's easel, three cats, a bucket of water, and Dalí himself floating in the air\"."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["During the Second World War, the King and Queen became symbols of the fight against fascism.Shawcross, p. 515 Shortly after the declaration of war, The Queen's Book of the Red Cross was conceived. Fifty authors and artists contributed to the book, which was fronted by Cecil Beaton's portrait of the Queen and was sold in aid of the Red Cross.Vickers, p. 205 Elizabeth publicly refused to leave London or send the children to Canada, even during the Blitz, when she was advised by the Cabinet to do so. She declared, \"The children won't go without me. I won't leave the King. And the King will never leave.\""]}, {"page": "Ivor Novello", "response": ["Other films in which Novello starred included Alfred Hitchcock's The Lodger, where he played the title character, and Downhill (both in 1927). The British film company Gainsborough Pictures offered Novello a lucrative contract, which enabled him to buy a country house in Littlewick Green, near Maidenhead. He renamed the property Redroofs, and he entertained there famously and with little regard for convention. Cecil Beaton, noting the frequent homosexual excesses, coined the phrase, \"the Ivor – Noel naughty set\".Hoare (1995), p.123 Coward had by now caught Novello up professionally, despite a joint disaster when Novello starred in Coward's play Sirocco in 1927, which was a débâcle, and closed within a month of opening.Hoare (1995), pp.187–88\"The Theatres. Sirocco to be Withdrawn\", The Times, 12 December 1927, p. 12 In 1928 Novello starred in the silent adaptation of Coward's much more successful The Vortex, and made his last silent film, A South Sea Bubble. During the late 1920s, Novello was the most popular male British film star and was often dubbed as Britain's \"handsomest screen actor\".Macnab, Geoffrey. \"The rise and fall of Ivor Novello\", The Guardian, 10 January 2004, accessed 4 June 2020."]}, {"page": "Audrey Hepburn", "response": ["Hepburn was known for her fashion choices and distinctive look, to the extent that journalist Mark Tungate has described her as a recognisable brand. When she first rose to stardom in Roman Holiday (1953), she was seen as an alternative feminine ideal that appealed more to women than men, in comparison to the curvy and more sexual Grace Kelly and Elizabeth Taylor. With her short hairstyle, thick eyebrows, slim body, and \"gamine\" looks, she presented a look which young women found easier to emulate than those of more sexual film stars. In 1954, fashion photographer Cecil Beaton declared Hepburn the \"public embodiment of our new feminine ideal\" in Vogue, and wrote that \"Nobody ever looked like her before World War II ... Yet we recognise the rightness of this appearance in relation to our historical needs. The proof is that thousands of imitations have appeared.\" The magazine and its British version frequently reported on her style throughout the following decade. Alongside model Twiggy, Hepburn has been cited as one of the key public figures who made being very slim fashionable."]}, {"page": "Mick Jagger", "response": ["In 1967, Cecil Beaton photographed Jagger's naked buttocks, a photo that sold at Sotheby's auction house in 1986 for $4,000."]}, {"page": "Gertrude Stein", "response": ["* Picasso, photo. Cecil Beaton (1938)"]}, {"page": "Academy Award for Best Costume Design", "response": ["| Cecil Beaton", "| Cecil Beaton", "*2: Cecil Beaton (2)"]}, {"page": "Evelyn Waugh", "response": ["In 1907, the Waugh family left Hillfield Road for Underhill, a house which Arthur had built in North End Road, Hampstead, close to Golders Green,Hastings, pp. 19–20 then a semi-rural area of dairy farms, market gardens and bluebell woods.Waugh, A Little Learning, pp. 34–35 Evelyn received his first school lessons at home, from his mother, with whom he formed a particularly close relationship; his father, Arthur Waugh, was a more distant figure, whose close bond with his elder son, Alec, was such that Evelyn often felt excluded.Stannard, Vol I pp. 34–35Hastings, pp. 27–28 In September 1910, Evelyn began as a day pupil at Heath Mount preparatory school. By then, he was a lively boy of many interests, who already had written and completed \"The Curse of the Horse Race\", his first story.Stannard, Vol. I p. 40 A positive influence on his writing was a schoolmaster, Aubrey Ensor. Waugh spent six relatively contented years at Heath Mount; on his own assertion he was \"quite a clever little boy\" who was seldom distressed or overawed by his lessons.Waugh, A Little Learning, p. 86 Physically pugnacious, Evelyn was inclined to bully weaker boys; among his victims was the future society photographer Cecil Beaton, who never forgot the experience.Hastings, p. 44"]}, {"page": "Greta Garbo", "response": ["In 1937, Garbo met orchestra conductor Leopold Stokowski, with whom she had a highly publicized relationship while the pair traveled throughout Europe the following year; whether the relationship was platonic or romantic is uncertain. In his diary, Erich Maria Remarque discusses a liaison with Garbo in 1941, and in his memoir, Cecil Beaton described an affair with her in 1947 and 1948. In 1941, she met the Russian-born millionaire, George Schlee, who was introduced to her by his wife, fashion designer Valentina. Nicholas Turner, Garbo's close friend for 33 years, said that, after she bought an apartment in the same building, \"Garbo moved in and took Schlee from Valentina right away.” Schlee would divide his time between the two, becoming Garbo's close companion and advisor until his death in 1964."]}, {"page": "Karen Blixen", "response": ["In 1959, Blixen made her only trip to the United States. It was an extended trip spanning from January to April, and while the purpose was to complete a series of educational films and discussions for the Ford Foundation and Encyclopædia Britannica, Blixen intended to enjoy herself. She was the feature of a Life Magazine article in the edition of 19 January 1959 and attended two Broadway openings. Feted by the well-to-do of New York society, Blixen was invited to dine with socialites Babe Paley and Gloria Vanderbilt. She was photographed by Richard Avedon and Cecil Beaton; the guest of John Steinbeck, who hosted a cocktail party in her honor; and serenaded by Maria Callas. Nobel laureate Pearl Buck and poets e. e. cummings and Marianne Moore came to see her, as well. When Blixen expressed a desire to meet Marilyn Monroe, the author Carson McCullers arranged a meeting with Monroe and her husband, the playwright Arthur Miller. Throughout the trip, Blixen played upon her crafted persona as a reclusive aristocrat and an outsider, but also that of an eccentric, who would eat only oysters and grapes, and drink only champagne. It was clear that she was ill, as it was reported that she was \"frail\" and \"weighed 63 pounds [28 kg]\" and she spent part of her time receiving \"intravenous infusions\"."]}, {"page": "The Faerie Queene", "response": ["The Netflix series The Crown references The Faerie Queene and Gloriana in season 1 episode 10, entitled \"Gloriana\". In the final scene, Queen Elizabeth II, portrayed by Claire Foy, is being photographed. Prompting Her Majesty's poses, Cecil Beaton says:\"All hail sage Lady, whom a grateful Isle hath blessed.\"William Wordsworth, Ecclesiastical Sonnets, XXXVIII. Not moving, not breathing. Our very own goddess. Glorious Gloriana. Forgetting Elizabeth Windsor now. Now only Elizabeth Regina. Yes."]}, {"page": "List of photographers", "response": ["* Cecil Beaton (1904–1980)"]}, {"page": "Victoria and Albert Museum", "response": ["In 1971, Cecil Beaton curated an exhibition of 1,200 20th-century high-fashion garments and accessories, including gowns worn by leading socialites such as Patricia Lopez-Willshaw,Evening dress worn by Mme. Arturo Lopez-Willshaw in the V&A collection. Accessed 19 January 2011 Gloria GuinnessEvening dress worn by Mrs Loel Guinness in the V&A collection. Accessed 28 January 2010 and Lee Radziwill,Dress worn by Lee Radziwill in the V&A collection. Accessed 19 January 2011 and actresses such as Audrey HepburnEvening dress worn by Audrey Hepburn in the collection of the V&A accessed 28 January 2010. and Ruth Ford.Schiaparelli dress worn by Ruth Ford in the collection of the V&A accessed 28 January 2010 After the exhibition, Beaton donated most of the exhibits to the Museum in the names of their former owners.", "The collection includes the work of many photographers from Fox Talbot, Julia Margaret Cameron, Viscountess Clementina Hawarden, Gustave Le Gray, Benjamin Brecknell Turner, Frederick Hollyer, Samuel Bourne, Roger Fenton, Man Ray, Henri Cartier-Bresson, Ilse Bing, Bill Brandt, Cecil Beaton (there are more than 8000 of his negatives), Don McCullin, David Bailey, Jim Lee and Helen Chadwick to the present day."]}, {"page": "Lady Ottoline Morrell", "response": ["Non-literary portraits are also part of this interesting legacy, as seen in the artistic photographs of her by Cecil Beaton. There are portraits by Henry Lamb, Duncan Grant, Augustus John, and others."]}, {"page": "Alfred Lunt", "response": ["After retiring from acting, Lunt continued to direct. At the Morosco Theatre in 1961, he directed Samuel A. Taylor's First Love, and for the Metropolitan Opera he directed La Traviata in 1966, starring Anna Moffo as Violetta, with designs by Cecil Beaton.Peters, p. 297"]}, {"page": "Lee Miller", "response": ["After leaving Ray and Paris in 1932, she returned to New York City and established a portrait and commercial photography studio (with $10,000 worth of backing from Christian Holmes II and Cliff Smith) with her brother Erik (who had been working for the fashion photographer Toni von Horn) as her darkroom assistant. Miller rented two apartments in a building one block from Radio City Music Hall. One of the apartments became her home while the other became the Lee Miller Studio. Clients of the Lee Miller Studio included BBDO, Henry Sell, Elizabeth Arden, Helena Rubinstein, Saks Fifth Avenue, I. Magnin and Co., and Jay Thorpe. During 1932 Miller was included in the Modern European Photography exhibition at the Julien Levy Gallery in New York and in the Brooklyn Museum's exhibition International Photographers with László Moholy-Nagy, Cecil Beaton, Margaret Bourke-White, Tina Modotti, Charles Sheeler, Ray, and Edward Weston. In response to the exhibition, Katherine Grant Sterne wrote a review in Parnassus in March 1932, noting that Miller \"has retained more of her American character in the Paris milieu. The very beautiful Bird Cages at Brooklyn; the study of a pink-nailed hand embedded in curly blond hair which is included in both the Brooklyn and the Julien Levy show; and the brilliant print of a white statue against a black drop, illumine the fact rather than distort it.\""]}, {"page": "Bessie Love", "response": ["Love married then-stockbroker William Hawks at St. James' Episcopal Church in South Pasadena, California on December 27, 1929. Blanche Sweet was her matron of honor; Bebe Daniels, Carmel Myers, Norma Shearer, and Hawks's sister-in-law Mary Astor were among her bridesmaids; and Irving Thalberg and Hawks's brother Howard served as ushers. Adrian had designed a wedding dress for Love, but she instead wore a silk charmeuse gown by Howard Greer. The ceremony was attended by such celebrities as Cecil Beaton, Ronald Colman, Cecil B. DeMille, Hedda Hopper, Laura La Plante, Harold Lloyd, Anita Loos, Ramon Novarro, and William Powell, and it was mobbed by a crowd of 25,000. The wedding and reception were documented by the press and by Beaton in his Diaries, where he wrote that Love \"looked like a terrified bird\" but \"radiated love\"."]}, {"page": "Merle Oberon", "response": ["* Merle Oberon in pose for The Dark Angel in Vanity Fair portrait by Cecil Beaton"]}, {"page": "David Bailey", "response": ["The film Blowup (1966), directed by Michelangelo Antonioni, depicts the life of a London fashion photographer who is played by David Hemmings, whose character was inspired by Bailey.PDN Legends Online: David Bailey. Retrieved 15 November 2013. The \"Swinging London\" scene was aptly reflected in his Box of Pin-Ups (1964): a box of poster-prints of 1960s celebrities including Terence Stamp, The Beatles, Mick Jagger, Jean Shrimpton, P. J. Proby, Cecil Beaton, Rudolf Nureyev and East End gangsters, the Kray twins. The Box was an unusual and unique commercial release.  It reflected the changing status of the photographer that one could sell a collection of prints in this way. Strong objection to the presence of the Krays by fellow photographer, Lord Snowdon, was the major reason no American edition of the \"Box\" was released, and that a second British edition was not issued. The record sale for a copy of 'Box of Pin-Ups' is reported as \"north of £20,000\"."]}, {"page": "Imperial War Museum", "response": ["The museum's Photograph Archive preserves photographs by official, amateur and professional photographers. The collection includes the official British photographic record of the two world wars; the First World War collection includes the work of photographers such as Ernest Brooks and John Warwick Brooke. The archive also holds 150,000 British aerial photographs from the First World War, the largest collection of its kind. The Second World War collection includes the work of photographers such as Bill Brandt, Cecil Beaton'Beaton's record of war revived', The Times, 7 October 1981, Issue 61049, page 7 column C and Bert Hardy. Like the Film Archive, the Photograph Archive is an official repository under the 1958 Public Records Act, and as such continues to receive material from the Ministry of Defence. In 2012 the museum reported the size of its photographic holdings as approximately 11 million images in 17,263 collections."]}, {"page": "Mourning", "response": ["The degree and duration of public mourning is generally decreed by a protocol officer. It was not unusual for the British court to declare that all citizens should wear full mourning for a specified period after the death of the monarch or that the members of the court should wear full- or half-mourning for an extended time. On the death of Queen Victoria (22 January 1901), the Canada Gazette published an \"extra\" edition announcing that court mourning would continue until 24 January 1902. It directed the public to wear deep mourning until 6 March 1901 and half-mourning until 17 April 1901. As they had done in earlier years for Queen Victoria, her son King Edward VII, his wife Queen Alexandra and the Queen Elizabeth The Queen Mother, the royal family went into mourning on the death of Prince Philip in April 2021. The black-and-white costumes designed by Cecil Beaton for the Royal Ascot sequence in My Fair Lady were inspired by the \"Black Ascot\" of 1910, when the court was in mourning for Edward VII.", "* Charles Spencer, Cecil Beaton: Stage and Film Designs, London: Academy Editions, 1975. (no ISBN)"]}, {"page": "Peter Quennell", "response": ["*Time Exposure (1946) with Cecil Beaton"]}, {"page": "Twiggy", "response": ["Twiggy has been photographed by such noted photographers as Cecil Beaton, Richard Avedon, Melvin Sokolsky, Ronald Traeger, Bert Stern, Norman Parkinson, Annie Leibovitz and Steven Meisel."]}, {"page": "Linda Evangelista", "response": ["Evangelista has drawn praise and accolades from many of the fashion industry's elite. Philip Treacy said, \"Linda is the ultimate model of the past 50 years\". Karl Lagerfeld once described Evangelista as \"the most famous of all\", and \"the best model in the world\", explaining, \"Because she's a true model, pure and simple. She doesn't pretend or aspire to do anything else. She's just brilliant at what she does.\" Designer Stefano Gabbana said of Evangelista, \"Linda is the model. If you talk about models of the sixties and seventies, the first name is Veruschka. In the eighties and nineties, it's Linda.\" David Bonnouvrier, one of the founders of DNA Model Management said, \"Linda is the model of all time, to its strictest definition. She could be out of a Cecil Beaton picture, she could be out of a Guy Bourdin picture.\" Sozzani, the editor-in-chief of Vogue Italia, recounted that she would receive letters from readers concerned about \"what would happen to the magazine if Linda got sick. Because it was all about Linda Evangelista. Her face had the most possibilities.\" Sozzani additionally stated, \"For me, she is the model, not only for her beauty, but her attitude, her intelligence.\""]}, {"page": "Fawzia Fuad of Egypt", "response": ["Following the marriage, the Princess was granted Iranian nationality. Two years later the crown prince succeeded his exiled father and was to become the Shah of Iran. Soon after her husband's ascent to the throne, Queen Fawzia appeared on the cover of the 21 September 1942, issue of Life magazine, photographed by Cecil Beaton, who described her as an \"Asian Venus\" with \"a perfect heart-shaped face and strangely pale but piercing blue eyes.\" She led the newly founded Association for the Protection of Pregnant Women and Children (APPWC) in Iran.", "Image:Cecil Beaton Photographs- Political and Military Personalities; Chahnaz, Princess of Iran, Fawzieh, Queen of Iran, Mohammed Reza Pahlevi CBM2404.jpg|Queen Fawzia with Shah Mohammad Reza Pahlevi and their daughter, Princess Shahnaz in Tehran during the Second World War."]}, {"page": "Mercedes de Acosta", "response": ["De Acosta's best-known relationship was with Greta Garbo. When Garbo's close friend, author Salka Viertel, introduced them in 1931, they quickly became involved. As their relationship developed, it became erratic and volatile with Garbo always in control. The two were very close sporadically and then apart for lengthy periods when Garbo, annoyed by Mercedes' obsessive behavior, coupled with her own neuroses, ignored her. In any case, they remained friends for thirty years during which time Garbo wrote de Acosta 181 letters, cards, and telegrams. About their friendship, Cecil Beaton, who was close to both women, recorded in his 1958 memoir, \"Mercedes is [Garbo's] very best friend and for 30 years has stood by her, willing to devote her life to her\"."]}, {"page": "Timeline of art", "response": ["* 1980 in art – Death of Cecil Beaton, Albert Kotin, Oskar Kokoschka, Philip Guston, Clyfford Still, Tony Smith, Graham Sutherland, Tamara de Lempicka; Pablo Picasso major retrospective exhibition at Museum of Modern Art (New York)"]}, {"page": "1940 in art", "response": ["* Cecil Beaton is among the photographers commissioned by the U.K. Ministry of Information to undertake war photography."]}, {"page": "1904 in art", "response": ["* 14 January – Cecil Beaton, English photographer and stage and costume designer (d. 1980)."]}, {"page": "Radclyffe Hall", "response": ["British composer and bon vivant Gerald Tyrwhitt-Wilson, 14th Baron Berners, wrote a roman à clef titled The Girls of Radcliff Hall, in which he depicts himself and his circle of friends, including Cecil Beaton and Oliver Messel, as lesbian schoolgirls at a school named Radcliff Hall. The novel was written under the pseudonym Adela Quebec and published and distributed privately; the indiscretions to which it alluded created an uproar among Berners' intimates and acquaintances, making the whole affair widely discussed in the 1930s. Cecil Beaton attempted to have all the copies destroyed.Florence Tamagne, \"History of Homosexuality in Europe, 1919–1939\", Algora Publishing, 2004; , p 124Bryony Jones, The music of Lord Berners (1883–1950): the versatile peer, Ashgate Publishing, 2003; , pp 9, 101, 143Beverly Lyon Clark, Regendering the school story: sassy sissies and tattling tomboys, Routledge, 2001; , p 143 The book subsequently disappeared from circulation, making it extremely rare. The story is, however, included in Berners' Collected Tales and Fantasies."]}, {"page": "Jamie Reid", "response": ["Jamie Reid (born 16 January 1947 in London, United Kingdom) is an English artist and anarchist with connections to the Situationists. His work, featuring letters cut from newspaper headlines in the style of a ransom note, came close to defining the image of punk rock, particularly in the UK. His best known works include the Sex Pistols album Never Mind the Bollocks, Here's the Sex Pistols and the singles \"Anarchy in the UK\", \"God Save The Queen\" (based on a Cecil Beaton photograph of Queen Elizabeth II, with an added safety pin through her nose and swastikas in her eyes, described by Sean O'Hagan of The Observer as \"the single most iconic image of the punk era\"),Heard, Chris (2004) \"Art and style of punk's shocking past\", BBC, 7 October 2004. Retrieved 2 February 2010O'Hagan, Sean (2007) \"Art anarchy in the UK\", The Observer, 3 June 2007. Retrieved 2 February 2010Donald, Ann (1998) \"The angry revolt into style; Punk's explosion still reverberates in the world of graphic design. Ann Donald catches the echoes\", Glasgow Herald, 9 G=February 1998. Retrieved 2 February 2010 \"Pretty Vacant\" and \"Holidays in the Sun\".Ross, Peter (2001) \"Toxteth Shock\", Sunday Herald, 4 March 2001. Retrieved 2 February 2010"]}]}}