{"wiki_id": "http://www.wikidata.org/entity/Q6988556", "itemLabel": "Neil Fitzwiliam", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Fitzwiliam", "wikipedia_page": {"main": "Neil Fitzwiliam is an English actor who has made several appearances in theatre, film and television productions.\nIn 1971, he was cast in the original London production of the musical Godspell at The Roundhouse, Chalk Farm, alongside David Essex, Julie Covington, Jeremy Irons and Marti Webb.\nHis other credits include the original London production of the Andrew Lloyd Webber musical Cats, based on the poems of T S Eliot, and a part as a dancer in the film, The Slipper and the Rose.\nOn television, his most notable role was Frank Weisel in first series of the BBC sitcom Yes Minister.\nFollowing a car accident that resulted in a brain injury, he had to finish his acting career.", "link_mentions": [{"page": "Yes Minister", "response": ["* Frank Weisel (often deprecatingly pronounced weasel), played by Neil Fitzwiliam, is Hacker's crusading, idealistic political adviser in the first series. The less scrupulous Hacker finds him rather tiresome after a time, while Sir Humphrey finds him positively loathsome from the outset. In the final scene of the last episode of the first series, Weisel is sent on a deliberately lengthy worldwide fact-finding assignment to learn about quangos to ensure a set of politically face-saving quango appointments and to prevent his publication of a quango reform white paper. He is not mentioned in any later series.", "The first series featured Frank Weisel, Hacker's political adviser (played by Neil Fitzwiliam in the television series, and later by Bill Nighy in the radio series). The first syllable of his surname is pronounced \"Wise\", but Sir Humphrey and Bernard persistently call him \"Weasel\". Weisel does not appear after the first series, following his acceptance of a position on a quango (Quasi-Autonomous Non-Governmental Organisation) tasked with investigating the appointment of other quangos, the government's honours system, and \"jobs for the boys\". The character was dropped because Jay and Lynn thought that the interjection of a character concerned with party political matters distracted from the focus on the tension between the government and the civil service."]}, {"page": "Cats (musical)", "response": ["* Skimbleshanks: Neil Fitzwiliam (1984–1985)"]}, {"page": "Godspell", "response": ["Godspell opened at the Roundhouse Theatre in Chalk Farm, London on November 17, 1971. This London production featured Jacquie-Ann Carr, Julie Covington, David Essex, Neil Fitzwiliam, Jeremy Irons, Verity-Anne Meldrum, Deryk Parkin, Tom Saffery, Gay Soper, and Marti Webb. After a successful run at the Roundhouse Theatre, the production transferred to the Wyndham's Theatre, also in London, on January 26, 1972.with Barry Stokes \"'Godspell'\", Thebeautifulchanges.co.uk. with Barry Stokes."]}, {"page": "Neil Fitzwilliam", "response": ["#REDIRECT Neil Fitzwiliam"]}]}}