{"wiki_id": "http://www.wikidata.org/entity/Q6989098", "itemLabel": "Neil North", "itemDescription": "British actor (1932-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_North", "wikipedia_page": {"main": "Neil North (18 October 1932 – 7 March 2007) was a British actor, best known for his role in the 1948 film adaptation of Terence Rattigan's play The Winslow Boy. North appeared in four other films released between 1948 and 1951, but did not make acting a full-time career. After a hiatus of over 40 years however, he did return to the screen with three further credits towards the end of his life, including a role in the 1999 remake of The Winslow Boy.", "link_mentions": [{"page": "2000 in film", "response": ["| Billy Elliot || Universal Pictures / BBC Films / Working Title Films || Stephen Daldry (director); Lee Hall (screenplay); Jamie Bell, Julie Walters, Gary Lewis, Jamie Draven, Jean Heywood, Stuart Wells, Nicola Blackwell, Colin Maclachlan, Mike Elliott, Billy Fane, Janine Birkett, Charlie Hardwick, Matthew James Thomas, Stephen Mangan, Patrick Malahide, Barbara Leigh-Hunt, Neil North, Lee Williams || Drama || Live action"]}, {"page": "1999 in film", "response": ["| The Winslow Boy || Sony Pictures Classics || David Mamet (director/screenplay); Nigel Hawthorne, Jeremy Northam, Rebecca Pidgeon, Gemma Jones, Guy Edwards, Matthew Pidgeon, Aden Gillett, Colin Stinton, Sarah Flind, Neil North || Period, Drama || Live action"]}, {"page": "Charles Lightoller", "response": ["*Neil North (1956) — Kraft Television Theatre : \"A Night to Remember\" (American TV)"]}, {"page": "List of films about the Titanic", "response": ["| Bradford DillmanNeil North"]}, {"page": "The Winslow Boy (1999 film)", "response": ["* Neil North - First Lord", "Neil North who played the title role in the 1948 version also appears in this version (as the First Lord of the Admiralty). In the audio commentary for the DVD release, Mamet says he had already cast North in the film before he was told that North also appeared in the 1948 version."]}, {"page": "The Winslow Boy (1948 film)", "response": ["The film stars Robert Donat, Sir Cedric Hardwicke and Margaret Leighton with Basil Radford, Kathleen Harrison, Francis L. Sullivan, Marie Lohr and Jack Watling (who was also in the original West End theatre production). Also in the cast are Stanley Holloway, Mona Washbourne, Ernest Thesiger, Wilfrid Hyde-White, Lewis Casson, Cyril Ritchard and Dandy Nichols. Neil North, who plays the title role, also appeared in the 1999 film adaptation directed by David Mamet.", "Ronnie Winslow (Neil North), a cadet at the Royal Naval College, appears unexpectedly back home, soaking wet. He has a letter for his father from the college which he is too scared to give him. He is accused of the theft of a postal order for five shillings (£0.25). An internal inquiry, which grants him no chance of defence, finds him guilty and his father, Arthur Winslow (Sir Cedric Hardwicke), is requested to remove his son from the college. Unwilling to accept the verdict, Winslow and his daughter Catherine institute their own enquiries and engage a friend and family solicitor, Desmond Curry (Basil Radford) to assist them, including the briefing of the best barrister in England at the time, Sir Robert Morton (Robert Donat), should the case come to court. The father takes the matter to his MP, who raises it at the House of Commons under the issue within the Magna Carta that no subject of the country may be condemned without trial.", "* Neil North as Ronnie Winslow"]}, {"page": "Deaths in March 2007", "response": ["*Neil North, 74, British actor."]}, {"page": "North (surname)", "response": ["* Neil North (1932–2007), British actor"]}, {"page": "List of people from Quetta", "response": ["* Neil North"]}, {"page": "A Night to Remember (Kraft Television Theatre)", "response": ["* Neil North [as Second Officer Charles Lightoller]"]}]}}