{"wiki_id": "http://www.wikidata.org/entity/Q6989456", "itemLabel": "Neil Walker", "itemDescription": "Scottish legal scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Walker_(lawyer)", "wikipedia_page": {"main": "Neil Craig Walker  (born 5 July 1960) is a Scottish lawyer and Regius Professor of Public Law and the Law of Nature and Nations at the School of Law of the University of Edinburgh. in 2009 he completed a review for the Scottish Government into the final appellate jurisdiction of the Scottish legal system.", "link_mentions": [{"page": "Coatbridge", "response": ["* Neil Walker (Jurist), Professor of Public Law and the Law of Nure and Nations, University of Edinburgh attended Coatbridge High School"]}, {"page": "Edinburgh Law School", "response": ["Current members of Edinburgh Law School include current Regius Professor Neil Walker; Lord President Reid Professor of Law Alexandra Braun; Professor of European Union Law Professor Niamh Nic Shuibhne; the academic and novelist Professor Alexander McCall Smith; former Judge at the European Court of First Instance Sir David Edward QC; former Scottish Law Commissioners Emeritus Professor George Gretton, Professor Hector MacQueen, Professor Gerry Maher QC, Professor Andrew Steven, Professor Kenneth Reid and Emeritus Professor Robert Black QC (architect of the Pan Am Flight 103 bombing trial)."]}, {"page": "European University Institute", "response": ["*Neil Walker, Law"]}, {"page": "Neil Walker (disambiguation)", "response": ["Neil Walker (born 1985) is an American baseball player.", "Neil Walker may also refer to:", "* Neil Walker (lawyer) (born 1960), Scottish lawyer", "* Neil Walker (swimmer) (born 1976), American  swimmer"]}, {"page": "Regius Professor of Public Law and the Law of Nature and Nations", "response": ["In 1972, Neil MacCormick was appointed to the chair. He had previously taught Jurisprudence at the University of St Andrews and Balliol College, Oxford. MacCormick came to be recognised as amongst the world's leading contemporary jurists, and was knighted in 2001 for his services to law. From 1999 to 2004, he was an SNP Member of the European Parliament for Scotland. MacCormick retired in 2008 and was succeeded by Neil Walker.", "*2008–present: Neil Walker"]}, {"page": "List of fellows of the British Academy elected in the 2010s", "response": ["* Neil Walker, Regius Professor of Public Law and the Law of Nature and Nations, University of Edinburgh "]}]}}