{"wiki_id": "http://www.wikidata.org/entity/Q6988899", "itemLabel": "Neil MacKenzie", "itemDescription": "British footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_MacKenzie", "wikipedia_page": {"main": "Neil David MacKenzie (born 15 April 1976) is an English former footballer who played as a midfielder. He scored 38 goals in 479 league and cup appearances across a 19-year career.\nStarting his career at Stoke City in 1996, after three years he moved on to Cambridge United, following a short loan period. After this he spent a season with Kidderminster Harriers, then another season with Blackpool, before signing with Mansfield Town in 2002. After two years he transferred to Scunthorpe United, where he was loaned out to Hereford United, before signing with Notts County in 2007. County loaned him back to both former club Kidderminster and Port Vale in 2008, before he joined Tamworth in 2009 via another old club, Mansfield Town. In 2011, he switched to Evesham United via St Neots Town. He joined Halesowen Town in 2013, and helped the club to the Northern Premier League Division One South title in 2013–14, then moved on to Hinckley AFC in July 2015.", "link_mentions": [{"page": "Countdown (game show)", "response": ["Contestants who have or had become notable for other reasons include Nuts magazine editor-at-large Pete Cashmore, rugby player Ayoola Erinle, footballers Neil MacKenzie, Clarke Carlisle and Matt Le Tissier, musicians Jon Marsh and Nick Saloman, comedian Alex Horne, noted Irish playwright Peter Sheridan and Professional Darts Referee Kirk Bevins, who won Series 60 and was a quarter-finalist in the 30th Birthday Championship."]}, {"page": "Richard Rose (footballer)", "response": ["Rose soon found a new home at newly promoted Hereford United where he played initially in centre midfield. He started 15 out of the first 16 matches of the season in League Two and scored his first senior goal in a 2–0 home win over Chester. He was then dropped in favour of loan signings John Eustace and Neil MacKenzie. When he returned to the side he reverted to the defence where he finished the season as third choice centre back."]}, {"page": "Dean Glover", "response": ["A win at Shrewsbury Town instigated a run of four away wins out of five. However Vale soon returned to their poor form, and slid back down the table. At the end of October, former Vale star Dave Brammer joined on loan from Millwall, and would join permanently in the January transfer window. The next month Scott Brown also arrived on loan from Cheltenham Town, and would also join on a permanent transfer two months later. This is also what happened with defender Gareth Owen, who arrived after leaving Stockport County following a bust-up with Jim Gannon. Notts County player Neil MacKenzie also joined on loan, but would not enjoy his short stay in Stoke-on-Trent. Attempts to bring back Chris Birchall on loan failed. Leaving Burslem was Chris Slater, who returned to former club Chasetown. In December, Andy Porter left the club's backroom staff after seventeen years at the club, highlighting the unrest in the camp. Both Porter and Mark Grew had turned down offers to become Glover's assistant."]}, {"page": "2006–07 Hereford United F.C. season", "response": ["|align=\"left\"|3||align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "Potteries derby", "response": ["| Neil MacKenzie"]}, {"page": "2004 Football League Third Division play-off Final", "response": ["In the 94th minute, Tony Carss sent a curling shot from around  just wide of the Mansfield goal before both D'Jaffo and Corden missed opportunities to score at the other end of the pitch.  With the game still without a goal at the conclusion of the additional period of play, a penalty shootout was required to determine the result.  Huddersfield's Edwards took the first penalty and scored before Corden's shot was saved.  Schofield then made it 2–0 and Lawrence missed Mansfield's second penalty.  Carss converted Huddersfield's third spot kick before Neil MacKenzie scored for Mansfield to make it 3–1.  Lee Fowler scored Huddersfield's fourth penalty to secure a 4–1 victory for his side and promotion to the Second Division.", "|MF ||14||Neil MacKenzie || "]}, {"page": "1997–98 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "1998–99 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "1999–2000 Stoke City F.C. season", "response": ["|align=\"left\"|15||align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "1996–97 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "Mackenzie (surname)", "response": ["*Neil MacKenzie (born 1976), English football player"]}, {"page": "2008–09 Port Vale F.C. season", "response": ["The season started well in August, but all four league games in September ended in defeat. However Sinnott refused to compromise his managerial philosophy in order to pick up results. A 4–1 home defeat to Macclesfield Town on 20 September would prove to be Sinnott's last game in charge. Sinnott was sacked on 22 September, with the Valiants in 16th place, Dean Glover taking over as caretaker manager for the second time in twelve months. The players were against the decision to axe Sinnott. Sinnott would later take court action against the club for a breach of contract, and settle out of court. Glover was appointed as manager on a permanent basis on 6 October. A win at Shrewsbury Town instigated a run of four away wins out of five. However Vale soon returned to their poor form, and slid back down the table. At the end of October, former Vale star Dave Brammer joined on loan from Millwall, and would join permanently in the January transfer window. The next month Scott Brown also arrived on loan from Cheltenham Town, and would also join on a permanent transfer two months later. This is also what happened with defender Gareth Owen, who arrived after leaving Stockport County following a bust-up with Jim Gannon. Notts County player Neil MacKenzie also joined on loan, but would not enjoy his short stay in Stoke-on-Trent. Attempts to bring back Chris Birchall on loan failed. Leaving Burslem was Chris Slater, who returned to former club Chasetown. In December, Andy Porter left the club's backroom staff after seventeen years at the club, highlighting the unrest in the camp. Both Porter and Mark Grew had turned down offers to become Glover's assistant.", "|align=\"left\"|MF||28||align=\"left\"| Neil MacKenzie", "| 27 November 2008 || MF ||  || Neil MacKenzie || Notts County || 27 December 2009 || "]}, {"page": "Stoke City F.C. Under-23s and Academy", "response": ["*  Neil MacKenzie"]}, {"page": "1999–2000 Cambridge United F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "2002–03 Mansfield Town F.C. season", "response": ["|align=\"left\"|4||align=\"left\"|DF||align=\"left\"| Neil MacKenzie"]}, {"page": "2003–04 Mansfield Town F.C. season", "response": ["|align=\"left\"|14||align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}, {"page": "2004–05 Mansfield Town F.C. season", "response": ["|align=\"left\"|14||align=\"left\"|MF||align=\"left\"| Neil MacKenzie"]}]}}