{"wiki_id": "http://www.wikidata.org/entity/Q6988272", "itemLabel": "Neil Barrett", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Barrett_(footballer)", "wikipedia_page": {"main": "Neil William Barrett (born 24 December 1981) is an English former professional footballer who played as a central midfielder. He played in the Football League for Portsmouth and in the Scottish Premier League for Dundee and Livingston.\nBarrett started his career in the youth system of Chelsea, before joining Portsmouth in 2001. He made over 20 appearances in his first season with Portsmouth, but having not played over a season-and-a-half he moved to Dundee on loan. He joined them permanently in 2004, but left a year later following their relegation from the Scottish Premier League. Following a period with Livingston, he signed for Conference National club Woking in 2007. After half a season with them he joined Ebbsfleet United, and played for them in their victory in the 2008 FA Trophy Final at Wembley Stadium.\nBarrett left Ebbsfleet after two seasons to sign for York City in 2009 and played for them in the 2010 Conference Premier play-off Final at Wembley Stadium. He was released by York in 2011 and after a short spell with Havant & Waterlooville in the Conference South he returned to Ebbsfleet United. After their relegation to the Conference South in 2013 he signed for their divisional rivals Basingstoke Town, but was released by them after one season. He finished his career with spells in the Isthmian League Premier Division with Leatherhead and Metropolitan Police.", "link_mentions": [{"page": "Richard Pacquette", "response": ["His cousin is fellow Dominica international footballer Jefferson Louis, with whom he was paired as Dominica's strikers in the second leg against Barbados. During his time as a semi-professional Pacquette worked as a school caretaker and a truancy officer. Pacquette and his Havant & Waterlooville teammates would have received £10,000 each if they had beaten Liverpool in the FA Cup. After joining York City in 2009, he moved into a house with teammates Neil Barrett, Alex Lawless, James Meredith and Daniel Parslow."]}, {"page": "Alex Lawless", "response": ["Lawless is able to play as a right or left midfielder, a central midfielder and a right back. While being equally comfortable playing at any of these positions, he prefers to play in a midfield role. He has also played in the hole and has given a composed performance as a second striker. His play as a right midfielder is \"skilful\" and he has been described as being \"comfortable on the ball, a good passer, mobile and with an eye for goal\". Stevenage Borough manager Graham Westley described him as a player \"who impresses me with his consistency\". After signing for York, manager Martin Foyle said \"He is a great all-rounder, a technically good footballer and has a very professional attitude towards the game.\" His partnership with Neil Barrett in the central midfield for York drew praise from teammate Richard Brodie, who said \"The midfield two worked really well together and picked up the second balls. Alex Lawless was flawless and he should be playing in the Football League\".", "After joining York City in 2009, Lawless moved into a house with teammates Neil Barrett, James Meredith, Richard Pacquette and Daniel Parslow. He has an interest in art, which he studied as a GCSE, saying \"I wouldn't mind trying to make a living from it one day but my main priority is football\". He is a Manchester United supporter and attention to his interest in art was first drawn after producing a painting of manager Alex Ferguson."]}, {"page": "Richard Brodie (footballer)", "response": ["Gateshead made an undisclosed five-figure bid for Brodie in May 2009, which was rejected by York. He signed a new two-year contract with York in June 2009. He scored York's goal on the opening day of 2009–10 in a match away to Oxford, which finished as a 2–1 defeat. After a run of entering three matches as a substitute, he started against Gateshead away and scored York's first goal with a 12-yard shot in a 2–1 victory. Brodie won a penalty against Crawley after being fouled by Dominic Collins, which he scored six minutes into the match, before passing the ball to Michael Gash, who scored the second goal in a 2–0 victory. Following the match, Foyle commented on their partnership, saying \"They are doing well together because Michael leads the line very well and Richard looks to hit the flanks.\" After receiving a yellow card in a home match with Oxford on 17 October 2009 for kicking the ball away, which was his fifth booking of the season, he was handed a one-match suspension for York's match against Luton Town. York claimed the booking was the result of mistaken identity, as Adam Smith was the player who committed the offence, and an appeal with the Football Association was lodged. The ban was overturned and he played for York in a 1–1 draw on 20 October 2009, assisting Neil Barrett's goal for York with a pass."]}, {"page": "2008–09 York City F.C. season", "response": ["After the season ended, York released Greaves, Hogg, McBreen, Pejic, Radcliffe, Robinson, Rusk, Shepherd, Christian Smith and Wilkinson. Boyes, Farrell, Darren Kelly and Sodje left for Scunthorpe, Rushden, Portadown and Barnsley respectively. Brodie, McWilliams, Mimms and Purkiss signed new contracts with the club. Over the summer York signed defenders James Meredith from Shrewsbury Town, Alan O'Hare from Mansfield and Djoumin Sangaré from Salisbury, midfielders Neil Barrett from Ebbsfleet, Andy Ferrell from Kidderminster, Alex Lawless from Forest Green, Mackin from Wrexham, winger Craig Nelthorpe from Oxford, and strikers Michael Gash from Ebbsfleet, Richard Pacquette from Maidenhead United and Michael Rankine from Rushden. Striker Michael Emmerson was promoted from the youth team after he signed a professional contract with the club."]}, {"page": "2009–10 York City F.C. season", "response": ["Richard Brodie, Andy McWilliams, Josh Mimms and Ben Purkiss signed new contracts with York. 11 players joined before the season kicked off; defenders James Meredith from Shrewsbury Town, Alan O'Hare from Mansfield Town and Djoumin Sangaré from Salisbury City, midfielders Neil Barrett from Ebbsfleet United, Andy Ferrell from Kidderminster Harriers, Alex Lawless from Forest Green Rovers, Levi Mackin from Wrexham, winger Craig Nelthorpe from Oxford United, and strikers Michael Gash from Ebbsfleet, Richard Pacquette from Maidenhead United and Michael Rankine from Rushden. Striker Michael Emmerson was promoted from the youth team after he signed a professional contract with the club. Daniel Parslow was named as captain for the season, having taken over the role during 2008–09.", "|Neil Barrett", "!scope=row|Neil Barrett"]}, {"page": "2009–10 Stoke City F.C. season", "response": ["Stoke were drawn at home to Conference Premier side York City at home in the third round of the FA Cup. The non-league side started the better side despite arriving late for kick-off and took a shock lead through Neil Barrett. However Stoke quickly turned the game around with two Rory Delap throws which led to Daniel Parslow putting through his own net and Ricardo Fuller scoring a minute later. Stoke sealed their place in the fourth round when Matthew Etherington curled in a free-kick just before the hour mark."]}, {"page": "2010 Conference Premier play-off Final", "response": ["|CM ||14||Neil Barrett || || "]}, {"page": "2010–11 York City F.C. season", "response": ["Beesley returned to Fleetwood after Mills decided to terminate his loan. York drew 0–0 away to League Two team Rotherham United in the first round of the FA Cup, which resulted in a replay at home. Lawless joined York's divisional rivals Luton on loan until January 2011, when a permanent transfer for an undisclosed fee would take place. Two loan signings were subsequently made; Leicester City striker Ashley Chambers joined until January 2011 and Sunderland midfielder Robbie Weir joined for one month. Rankine scored York's equaliser in a 1–1 home draw against Wrexham with a second-half penalty. York beat Rotherham 3–0 at home in their FA Cup first round replay, with Chris Smith opening the scoring before Rankine scored twice. David McGurk handed in a transfer request having expressed his desire to join Luton, after they had a number of bids for him rejected and he had turned down a contract extension with York. York recorded their first league win under Mills with a 4–0 victory away to Rushden with Racchi, Rankine, Chambers and Neil Barrett scoring. Purcell was loaned out to Conference South team Dartford until January 2011 to regain match fitness following his return from injury. The Rushden win was followed by the season's first successive league victory, after York beat Southport 2–0 at home with late goals from Constantine and McDermott. Midfielder Andre Boucaud was signed from Kettering on loan until January 2011, with a view to a permanent transfer. York progressed to the third round of the FA Cup for the second season running after beating Darlington 2–0 away in the second round. The team's run of three straight wins came to an end after a 0–0 away draw against Kidderminster.", "|Neil Barrett", "!scope=row|Neil Barrett"]}, {"page": "2008 FA Trophy Final", "response": ["|CM ||14 || Neil Barrett"]}, {"page": "2003–04 Portsmouth F.C. season", "response": ["*  Neil Barrett –  Dundee, loan, 23 January 2004"]}, {"page": "2011–12 York City F.C. season", "response": ["Just over a month into the 2010–11 season, manager Martin Foyle resigned with York City 15th in the league table. Tamworth manager Gary Mills took over, and after pushing for a play-off place the team finished the 2010–11 Conference Premier in eighth place. Released following the end of the season were Neil Barrett, Chris Carruthers, Leon Constantine, Liam Darville, Michael Gash, Levi Mackin and Andy McWilliams. George Purcell, Michael Rankine, Jonathan Smith, Peter Till and Greg Young also left the club after departing for Dover Athletic, Aldershot Town, Swindon Town, Fleetwood Town and Alfreton Town respectively. Jamal Fyfield, Michael Ingham and James Meredith signed new contracts with York, with David McDermott being retained on non-contract terms."]}, {"page": "Neil Barrett", "response": ["Neil Barrett may refer to:", "*Neil Barrett (footballer) (born 1981), English footballer", "*Neil Barrett (fashion designer) (born 1965), English fashion designer", "*Deckscar (Neil Barrett, born 1986), DJ and music producer"]}, {"page": "Neil William Barrett", "response": ["#REDIRECT Neil Barrett (footballer)"]}]}}