{"wiki_id": "http://www.wikidata.org/entity/Q6988749", "itemLabel": "Neil Howlett", "itemDescription": "British opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Howlett", "wikipedia_page": {"main": "Neil Howlett (24 July 1934 – 21 May 2020) was an English operatic baritone who sang leading roles in major opera houses and festivals in the UK and abroad, including the Royal Opera House, Teatro Colón, and the English National Opera, where he was the Principal Baritone for seventeen years. Described by John Steane as \"a vibrant voice somewhat in the Amato/Franci line\", Howlett's repertoire included over 80 roles.\n\n", "link_mentions": [{"page": "Mitcham", "response": ["*Neil Howlett – opera singer"]}, {"page": "Toussaint Louverture", "response": ["* In 1977 the opera Toussaint by David Blake was produced by English National Opera at the Coliseum Theatre in London, starring Neil Howlett in the title role."]}, {"page": "Gloriana", "response": ["* 1984 Sarah Walker (Queen Elizabeth I), Anthony Rolfe Johnson (Earl of Essex), Jean Rigby (Countess of Essex), Neil Howlett (Lord Mountjoy), Alan Opie (Sir Robert Cecil), Elizabeth Vaughan (Lady Rich), Richard Van Allan (Sir Walter Raleigh), Malcolm Donnelly (Henry Cuffe); English National Opera Chorus and Orchestra; Mark Elder (conductor). Live recording, London 1984 (also broadcast on the BBC). Label: ArtHaus Musik DVDBlyth, p. 119"]}, {"page": "Reginald Goodall", "response": ["His last public performance was in 1987 at the Royal Albert Hall, London where he led the English National Opera Company in a performance of Act 3 of Wagner's Parsifal. The cast included Gwynne Howell (Gurnemanz), Warren Ellsworth (Parsifal), Neil Howlett (Amfortas) and Shelagh Squires (Kundry)."]}, {"page": "Le roi malgré lui", "response": ["*BBC broadcast, 1973. Henri Gui (Henri de Valois), André Mallabrera (Comte de Nangis), Odile Pieti (Minka), Christiane Stutzman (Alexina), Michel Trempont (Fritelli), Neil Howlett (Laski); BBC Northern Singers, BBC Northern Symphony Orchestra, conducted by Manuel Rosenthal.Loppert, Max. On Radio: Le Serpent à Plumes (Delibes), Radio 3 , 3 August, Le Roi malgré lui (Chabrier), Radio 3, 12 August. Opera, November 1973, Vol.24 No.11, 1039-1042."]}, {"page": "The Nightingale (opera)", "response": ["|Phyllis Bryn Julson,Neil Howlett,Felicity Palmer,Elizabeth Laurence,Michael George,Ian Caley,John Tomlinson"]}, {"page": "St Paul's Cathedral School", "response": ["* Neil Howlett, opera singer"]}, {"page": "Charles Craig (tenor)", "response": ["*Verdi: Otello – Charles Craig (Otello), Rosalind Plowright (Desdemona), Neil Howlett (Iago), Shelagh Squires (Emilia), Bonaventura Bottone (Cassio); English National Opera Orchestra  and Chorus; Mark Elder (conductor). Live recording, London 1983; remastered release 2001. Label: Chandos Records CD"]}, {"page": "Wer sich selbst erhöhet, der soll erniedriget werden, BWV 47", "response": ["* J. S. Bach: Cantata BWV 10, BWV 47; Sanctus BWV 241, Paul Steinitz, London Bach Society, English Chamber Orchestra, Sally Le Sage, Neil Howlett, Oryx 1965"]}, {"page": "List of musicians at English cathedrals", "response": ["* Neil Howlett (chorister), opera singer and teacher."]}, {"page": "List of people from the London Borough of Merton", "response": ["*Neil Howlett – opera singer, born in Mitcham"]}, {"page": "2020 in the United Kingdom", "response": ["**Neil Howlett, 85, operatic baritone."]}, {"page": "2020 in music", "response": ["** Neil Howlett, 85, British opera singer"]}, {"page": "Deaths in May 2020", "response": ["*Neil Howlett, 85, English operatic baritone.ENO are very saddened to learn that Baritone Neil Howlett has passed away"]}]}}