{"wiki_id": "http://www.wikidata.org/entity/Q6989055", "itemLabel": "Neil Moore", "itemDescription": "English footballer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Moore", "wikipedia_page": {"main": "Neil Moore (born 21 September 1972) is an English former professional football defender who used to play for Everton Football Club.\nMoore joined Nuneaton Borough in July 2003 following his release from Mansfield Town. He started his career at Everton and had loan spells with Blackpool, Oldham Athletic, Carlisle United, Rotherham United and Norwich City before moving to Burnley and Macclesfield Town.\nIn 2000, he moved into non-league with Telford United. Moore spent two seasons at Bucks Head, where he was the subject of a £40,000 bid from Chester City. Upon the completion of his contract with Telford, he signed for Division Two side Mansfield Town, where he was captain until the appointment of Keith Curle as manager. He scored his only goal for Mansfield in the League Cup against Derby County. He spent time on loan at Southport before being released and joining Nuneaton Borough, for whom he was skipper for three seasons. Despite being replaced as team captain by Tom Curtis at the start of the 2007–08 campaign, Moore remained a prominent first-team member, and when Curtis left at the end of the season, Moore was given the captaincy again for the 2008–09 season, following Nuneaton's two-league demotion. However, Moore was released by manager Kevin Wilkin in October 2008, so that Wilkin could free up money to buy attackers.\nHe was a member of the first group of legends ever inducted into the inaugural hall of fame when it began in 2009.", "link_mentions": [{"page": "1999–2000 Burnley F.C. season", "response": ["|||DF|| Neil Moore || Macclesfield Town || Free || 14 May 1999"]}, {"page": "1999–2000 Macclesfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Neil Moore"]}, {"page": "2002–03 Mansfield Town F.C. season", "response": ["|align=\"left\"|5||align=\"left\"|DF||align=\"left\"| Neil Moore"]}]}}