{"wiki_id": "http://www.wikidata.org/entity/Q6981017", "itemLabel": "Walter Garstang", "itemDescription": "British zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Garstang", "wikipedia_page": {"main": "Walter Garstang FLS FZS (9 February 1868 – 23 February 1949), a Fellow of Lincoln College, Oxford and Professor of Zoology at the University of Leeds, was one of the first to study the functional biology of marine invertebrate larvae. His best known works on marine larvae were his poems published as Larval Forms and Other Zoological Verses, especially The Ballad of the Veliger. They describe the form and function of several marine larvae as well as illustrating some controversies in evolutionary biology of the time.Garstang was known for his vehement opposition to  Ernst Haeckel's Biogenetic Law, now discredited. He is also noted for his hypothesis on chordate evolution, known as Garstang's theory, which suggests an alternative route for chordate evolution from echinoderms.", "link_mentions": [{"page": "Ctenophora", "response": ["Walter Garstang in his book Larval Forms and Other Zoological Verses (Mülleria and the Ctenophore) even expressed a theory that ctenophores were descended from a neotenic Mülleria larva of a polyclad."]}, {"page": "Robin Hood's Bay", "response": ["In 1912, Professor Walter Garstang of Leeds University, in cooperation with Professor Alfred Denny of the University of Sheffield, established the Robin Hood's Bay Marine Laboratory, which continued on the site for the next 70 years."]}, {"page": "Heterochrony", "response": ["In 1928, the English embryologist Walter Garstang showed that tunicate larvae shared structures such as the notochord with adult vertebrates, and suggested that the vertebrates arose by paedomorphosis (neoteny) from such a larva. The proposal implied (if it were correct) a shared phylogeny of tunicates and vertebrates, and that heterochrony was a principal mechanism of evolutionary change.", "Walter Garstang suggested the neotenous origin of the vertebrates from a tunicate larva, in opposition to Darwins opinion that tunicates and vertebrates both evolved from animals whose adult form was similar to (frog) tadpoles and the 'tadpole larvae' of tunicates. According to Richard Dawkins, Garstang's opinion was also held by Alister Hardy, and is still held by some modern biologists. However, according to others, closer genetic investigation rather seems to support Darwin's old opinion:"]}, {"page": "List of authors of names published under the ICZN", "response": ["* Garstang – Walter Garstang (1868–1949)"]}, {"page": "John Garstang", "response": ["John Garstang (5 May 1876 – 12 September 1956) was a British archaeologist of the Ancient Near East, especially Anatolia and the southern Levant. He was the younger brother of Professor Walter Garstang, FRS, a marine biologist and zoologist. Garstang is considered a pioneer in the development of scientific practices in archaeology as he kept detailed records of his excavations with extensive photographic records, which was a comparatively rare practice in early 20th-century archaeology."]}, {"page": "Centre for Environment, Fisheries and Aquaculture Science", "response": ["*Walter Garstang, poet and naturalist, who established the laboratory in 1902 on behalf of the Marine Biological Association of the United Kingdom."]}, {"page": "Henry Nottidge Moseley", "response": ["Moseley exerted  significant influences on his noted students Halford MackinderSir Halford Mackinder, 1861 - 1947: Some New Perspectives, by Brian Blouet, Research Paper 13, School of Geography, University of Oxford 1975 and Walter Garstang, who changed his career choice from medicine to zoology under Moseley's supervision. Moseley was awarded the Royal Society's Royal Medal in 1887."]}, {"page": "Torsion (gastropod)", "response": ["One likely candidate for the original purpose of torsion is defence against predators in adult gastropods. By moving the mantle cavity over the head, the gastropod can retract its vulnerable head into its shell. Some gastropods can also close the entrance to their shell with a tough operculum, a door-like structure which is attached to the dorsal surface of their foot. In evolutionary terms, the appearance of an operculum occurred shortly after that of torsion, which suggests a possible link with the role of torsion, though there is not sufficient evidence for or against this hypothesis. The English zoologist Walter Garstang wrote a famous poem in 1928, The Ballad of the Veliger, in which he argued with gentle humour in favour of the defence theory, including the linesHardy A.C. 1951. Introduction to Garstang W. Larval Forms. Blackwell, Oxford. pp. 8-9"]}, {"page": "Robert Gurney", "response": ["Robert Gurney was born in 1879 as the fourth son of John Gurney (1845–1887) and Isabel Charlotte Gurney (later Baroness Talbot de Malahide) of Sprowston Hall, Norfolk. He went to school at Eton College, and went on to study at New College, Oxford, graduating with first class honours in 1902.  He was awarded a D.Sc. by the University of Oxford in 1927. He was never associated with any institution, but worked from his home, initially near Stalham, Norfolk, but from 1928 at Boars Hill, outside Oxford. He became a lifelong friend of Walter Garstang after the two men met while Garstang was running Easter Classes at Plymouth, which Gurney was attending as an undergraduate. Gurney went on to marry Garstang's sister, Gamzu (1878–1972). Later, Garstang's daughter married Alister Hardy, strengthening Gurney's connections with zoology.", "Gurney took part in several expeditions, including one to North Africa in 1906, and the Cambridge University Suez Expedition in 1924. He also worked on material collected by other expeditions, including the Terra Nova Expedition (1910–1913), the Discovery Investigations (1920s and 1930s) and the Great Barrier Reef Expedition of 1928–1929. Gurney returned to the Red Sea, visiting the marine laboratory at Hurghada in 1936, and visited Bermuda twice: once with Walter Garstang in 1935, and once with both Garstang and Marie V. Lebour in 1938."]}, {"page": "Marine Biological Association of the United Kingdom", "response": ["The National Marine Biological Library (NMBL) began in 1887 as the research support library for the MBA. Today, it provides research support for the MBA,  the Sir Alister Hardy Foundation for Ocean Science and Plymouth Marine Laboratory. The  NMBL's holdings include periodicals, serials, journals, reports and grey literature, a large collection of historical and modern books, an extensive reprint collection, and expedition reports. These cover the vast majority of the world. The NMBL’s Special Collections include the research libraries of several eminent MBA scientists; these are George Parker Bidder, Edward Thomas Browne, Sidney Frederic Harmer, E. Ray Lankester, Marie Victoire Lebour and John Zachary Young. Additionally, the NMBL curates the MBA Archive Collection which details the MBA's institutional history as well the history of marine biology in Britain since the late-nineteenth century, especially through the collection’s personal papers. These include scientific papers and material from Walter Garstang, Sidney Harmer, Hildebrand Wolfe Harvey, Thomas Hincks, Thomas V. Hodgson, Stanley W. Kemp, Charles A. Kofoid, Mary Parke, John Richardson, Frederick S. Russell, Thomas A. Stephenson, Walter Frank Raphael Weldon, Edward A. Wilson and William Yarrell."]}, {"page": "Leeds Philosophical and Literary Society", "response": ["*1924–26: Walter Garstang, M.A., D.Sc., F.Z.S.   "]}, {"page": "Walter Lucian Garstang", "response": ["Garstang was the son of the marine biologist Professor Walter Garstang and his wife Lucy (née Ackroyd).  He was educated at Oundle School and Trinity College, Oxford (1927–1931).  He worked as research chemist for Gas Light and Coke Company from 1931 until 1937, when he turned to teaching at Oundle, becoming an assistant master there from 1937-1944.  He then was 1944-1946 an assistant master at Merchant Taylors' School, Northwood, and senior science master at Maidstone Grammar School from 1946 to 1948."]}, {"page": "Gurney family (Norwich)", "response": ["********Robert Gurney (1879–1950), zoologist, married in Sarah Gamzu Garstang (1878–1972), sister of Walter Garstang, and had 1 child:"]}, {"page": "Robin Hood's Bay Marine Laboratory", "response": ["In 1907 Walter Garstang was appointed professor of zoology at the University of Leeds. Recognised as one of the country's leading marine scientists, Garstang had been assistant director of the Plymouth Laboratory of the Marine Biological Association of the United Kingdom, and in charge of the association's Lowestoft Laboratory while directing Great Britain's part in the International Fishery Investigations of the North Sea.", "Walter Garstang first visited Robin Hood's Bay at Easter in 1909, with T.H. Taylor, his assistant lecturer and demonstrator in zoology, and Ll. Lloyd, his first advanced student (and later to be his reader in entomology and protozoology).  Ll. Lloyd, who had known the area since boyhood, later recalled  that they stayed at the Bay Hotel \"and its verandha, the sea washing its wall at high tide, was our Laboratory\" where they sorted and examined the great variety of animals collected from the shore and rock pools.  In 1912, in cooperation with Alfred Denny, professor of zoology at Sheffield University,  Walter Garstang established a marine research facility in Baytown, in an old building at the Wayfoot previously used as the coastguard cottage, and owned by Mrs. Martha Storm, a member of the long-established local fishing family. Jointly funded by Leeds and Sheffield Universities, the facility was known as Yorkshire Universities Marine Laboratory, and was used as a summer base for fieldwork, teaching and research by the Departments of Zoology and Botany. Initially for a two-year trial period, the two universities agreed to the annual outlay of £4 each for rent and up to £10 each for upkeep.", "In 1914 they agreed to continue the arrangement and to rent for a further £3 annually the adjoining large room, previously occupied by an auctioneer, and formerly being the coastguards' rocket apparatus room. In agreeing to the expansion, the Leeds University Finance Committee suggested that any funds required for additional equipment should be raised by private subscription.  Walter Garstang was confident that he could acquire the necessary funds.  Martha Storm had been willing to sell the premises in 1914, but it was not until 1922 that the buildings were jointly purchased by Leeds and Sheffield for the sum of £220. There were very few permanent facilities at the laboratory, so when the classes travelled over from Leeds and Sheffield they had to bring all the equipment they needed with them and carry it down from the top of Bay Bank.", "However, generations of Leeds students and researchers, and visiting marine scientists, benefited from working in Robin Hood's Bay. Walter Garstang retired in 1933, but the laboratory continued to operate along the lines established.  In Garstang's obituary notice in 1949 in Nature,  Professor L. Eastham, a former pupil, wrote:", "* University of Leeds. Archives:  Eight letters between Walter Garstang and the University Secretary 1913–1916; Regulations for management [of the marine laboratory] 1912; The Wellcome Marine Laboratory. Undated typescript (197-?)"]}, {"page": "Garstang (surname)", "response": ["*Walter Garstang 1868–1949, Professor of Zoology at the University of Leeds, one of the first to study the functional biology of marine invertebrate larvae"]}, {"page": "RV Huxley", "response": ["Fishery investigations began in September 1902 under the directorship of Walter Garstang. The work consisted of systematic exploration of the North Sea trawling grounds at different seasons of the year, together with studies of growth and migration of plaice Pleuronectes platessa based on tagging experiments, examination of the food of fish and the nature of the seabed. Detailed catch records from North Sea survey stations between 1902 and 1903 were summarised in a report published by Garstang in 1905.Garstang, W. (1905). Report on the trawling investigations, 1902-3, with special reference to the distribution of the plaice. First Report on Fishery and hydrographic investigations in the North Sea and adjacent waters (southern area), International Fisheries Investigations, Marine Biological Association, UK, 67–198.  Research continued until 1909."]}, {"page": "Louis Compton Miall", "response": ["From 1871 to 1892 Miall was curator of the museum of the Leeds Philosophical and Literary Society. From 1876 to 1904 he was Professor of Biology at the Yorkshire College.  After the Yorkshire College became the University of Leeds in 1904, Miall continued in the same role until he retired in 1907.  He was succeeded by both V H Blackman, FRS (as professor of botany) and Walter Garstang (as professor of zoology).The Royal Society, Vernon Herbert Blackman 1872-1967, H K Porter"]}, {"page": "The Ballad of the Veliger", "response": ["#REDIRECT Walter Garstang#The Ballad of the Veliger"]}, {"page": "Harry Macdonald Kyle", "response": ["Kyle graduated from St Andrews University where he was a protégé of William Carmichael McIntosh. In 1903 he was appointed as Biological Secretary to the International Council for the Exploration of the Sea (ICES), based in Copenhagen. He was an expert on flatfish, especially plaice, and worked with Walter Garstang at Plymouth. Later he collaborated extensively with Ernst Ehrenbaum of the Museum of Natural History in Hamburg. He made important contributions to fisheries science and produced definitive works which were among the first scientific studies to address the issue of overfishing."]}, {"page": "Pycnoclavella", "response": ["Pycnoclavella  is a genus of sea squirts first circumscribed by Walter Garstang in 1891. The generic name comes from the Ancient Greek  (puknós) meaning \"closely united\". In 1990, Patricia Kott placed Pycnoclavella in its own family, Pycnoclavellidae, but in 2008 it was moved back to Clavelinidae."]}, {"page": "Buckland Foundation", "response": ["| Walter Garstang"]}]}}