{"wiki_id": "http://www.wikidata.org/entity/Q6989101", "itemLabel": "Neil O'Brien", "itemDescription": "British politician (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_O%27Brien", "wikipedia_page": {"main": "Neil John O'Brien  (born 6 November 1978) is a British politician who has served as Member of Parliament (MP) for Harborough since 2017. A member of the Conservative Party, he was previously a special adviser to George Osborne from 2012 to 2016 and Theresa May during her tenure as Prime Minister.\n\n", "link_mentions": [{"page": "Conservative Party (UK)", "response": ["Since 1997, debate has occurred within the party between 'modernisers' such as Alan Duncan, who believe that the Conservatives should modify their public stances on social issues, and 'traditionalists' such as Liam Fox and Owen Paterson, who believe that the party should remain faithful to its traditional conservative platform. William Hague and Michael Howard campaigned on traditionalist grounds in the 2001 and 2005 general elections respectively, and 2001 also saw the election of traditionalist Iain Duncan Smith as party leader. In the current parliament, modernising forces are represented by MPs such as Neil O'Brien, who has argued that the party needs to renew its policies and image, and is said to be inspired by Macron's centrist politics. Ruth Davidson is also seen as a reforming figure, as is the Minister for Women and Equalities and Minister for Levelling up Communities, Kemi Badenoch. Many of the original 'traditionalists' remain influential, though Duncan Smith’s influence in terms of Commons contributions has waned. Many 'traditionalist' backbenchers such as Christopher Chope, Peter Bone and Jacob Rees-Mogg command significant media attention for their use of fillibustering and frequent interjections, and so remain influential forces in the Commons, though they cannot be taken to represent all 'traditionalist' Conservatives."]}, {"page": "Greenhead College", "response": ["*Neil O'Brien OBE, Conservative MP."]}, {"page": "Harborough (UK Parliament constituency)", "response": ["Harborough () is a constituency covering the south east of Leicestershire represented in the House of Commons of the UK Parliament since 2017 by Neil O'Brien of the Conservative Party.", "| Neil O'Brien"]}, {"page": "List of Parliamentary constituencies in Leicestershire and Rutland", "response": ["|Neil O'Brien†"]}, {"page": "Policy Exchange", "response": ["In May 2007, Boles was succeeded as director by Anthony Browne, a journalist and political correspondent for The Times. In September 2008, Browne stepped down to work for Boris Johnson, and was succeeded by Neil O'Brien, formerly director of Open Europe.Neil O'Brien is new director of Policy Exchange ConservativeHome 12 September 2008 In November 2012, O'Brien was appointed as a special adviser to George Osborne, and in 2013 he was succeeded by Dean Godson, formerly head of Policy Exchange's security unit."]}, {"page": "Department for Levelling Up, Housing and Communities", "response": ["| Neil O'Brien MP"]}, {"page": "St. Xavier's Collegiate School", "response": ["* Neil O'Brien, quizmaster"]}, {"page": "Open Europe", "response": ["Directors of Open Europe have included Neil O'Brien (2005–2008), Lorraine Mullally (2008–2010), Mats Persson (2010–2015), Stephen Booth and Raoul Ruparel as Co-Directors (2015–2017), and Henry Newman (2017–2019). Several former Open Europe Directors have gone on to work in government, including Persson (former Europe advisor to David Cameron) and Ruparel (former Europe advisor to Theresa May)."]}]}}