{"wiki_id": "http://www.wikidata.org/entity/Q6988403", "itemLabel": "Neil Cole", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Cole", "wikipedia_page": {"main": "Neil Cole (born 1 March 1972) is an English television presenter, comedian, radio broadcaster and actor.", "link_mentions": [{"page": "Dakar Rally", "response": ["The rally is broadcast on television in more than 190 different countries. A live feed of the event and a roundup of each day's race progress is made into a 26-minute programme. This has been commentated on by Toby Moody for ten years, and more recently by Neil Cole."]}, {"page": "King Edward VI Grammar School, Chelmsford", "response": ["* Neil Cole, comedian, television presenter and radio broadcaster"]}, {"page": "MTV Select", "response": ["*European & Nordic Edition: Eden Harel, Thomas Madvig, Lars Oostveen, Ulrika Eriksson, Kicki Berg, Lars Beckung, Neil Cole, Fleur van der Kieft, Joanne Colan, Mimi Kalinda, "]}, {"page": "List of MTV VJs", "response": ["* Neil Cole"]}, {"page": "MTV (European TV channel)", "response": ["* Neil Cole (2000–2004) The Fridge, MTV News, Select MTV, European Top 20, World Chart Express, MTV:New"]}, {"page": "Griffin Theatre Company", "response": ["* 1999 – Neil Cole for Alive at Williamstown Pier"]}, {"page": "Euro Top 20", "response": ["*Neil Cole (2000–2002)"]}, {"page": "NME Radio", "response": ["Broadcast from studios in the Blue Fin Building in South Bank, London, also home to IPC Media, NME Radio was launched on 24 June 2008 with its first track being \"Knights of Cydonia\" by British rock band Muse. The presenting line-up at launch included Neil Cole and Claire Sturgess"]}, {"page": "Tom Cave", "response": ["He was then invited to take part in the Richard Burns Memorial Rally by Neil Cole, presenter of the WRC on digital TV channel Dave. The pair finished 14th overall and sixth in class, another outstanding result considering they faced kit cars and ex-works Vauxhall Astras in their Group N Fiesta."]}, {"page": "MTV (Nordic TV channel)", "response": ["* Neil Cole European Top 20, Select MTV, The Fridge"]}, {"page": "Ginx TV", "response": ["* The First Hour - Shows the latest big release or revisited a modern classic by playing through the first 60 minutes. Reintroduced in 2017. Presented by Adam Savage (2013–present), Neil Cole (2014), Simon Longden (2013-2014), Lucy James (2013-2014) and Anthony Richardson (2014–present).", "* Faster - Games that focused on racing with a particular focus on motorsport. Presented by Neil Cole (2011-2014).", "* Console Yourself - A show in which stand-up comedians confessed their videogame loves, hates, and guilty secrets. Presented by Neil Cole (2014–present)."]}, {"page": "Neil Cole (disambiguation)", "response": ["Neil Cole is an actor and presenter.", "Neil Cole may also refer to:", "*Neil Cole (politician)", "*Neil Cole (racing driver)", "*Neil Cole (firefighter) in 2013 New Year Honours", "*Neil Coles, golfer"]}, {"page": "Neill Cole", "response": ["#REDIRECT Neil Cole"]}, {"page": "Neal Cole", "response": ["#REDIRECT Neil Cole"]}, {"page": "List of Sapphire & Steel serials", "response": ["|colspan=\"4\"|Cast: David Collings as Silver, Michael Chance as Webber, Kate Dyson as Fleming, Suzanne Proctor as Mary, Linda Bartram as The Girl, Neil Cole as Police Officer", "|colspan=\"4\"|Cast: David Collings as Silver, Arthur Bostrom as Richard Hanmore, Jo Castleton as Marian Anderson, Neil Cole as Ian Jackson, Michael Chance as Hammond, Nigel Fairs as Kilsby, Suzanne Proctor as Marcus, Linda Bartram as Mo"]}, {"page": "NATYS: New Acts of the Year Show", "response": ["* Hitchcock's Half Hour (Neil Cole and Tom Hillenbrand) - winner"]}, {"page": "The First Hour", "response": ["The First Hour is a Ginx TV  production which plays the first hour of a brand new game or a recent classic for the very first time. The main presenter has always been Adam Savage and has been joined by guests such as Lucy James and Neil Cole.https://ginx.tv/on-demand/the-first-hour/https://uk.linkedin.com/pub/adam-savage/33/b5a/309"]}, {"page": "Dirt Rally 2.0", "response": ["Dirt Rally 2.0 is the first game in the series to be developed by Codemasters after game director Paul Coleman's departure from the company in early 2018. Rally drivers Ryan Champion and Jon Armstrong served as consultants throughout the game's development with occasional help from Oliver Solberg, while veteran co-driver Phil Mills lent his voice as the game's English-speaking co-driver. Neil Cole is the English-speaking voice of the rallycross spotter. "]}]}}