{"wiki_id": "http://www.wikidata.org/entity/Q6989376", "itemLabel": "Neil Sutton", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Sutton", "wikipedia_page": {"main": "Neil Sutton is an English musician, known for being a long term touring member for the synthpop group The Human League. He is best known as the on stage and studio keyboard player, but also has written various lyrics and composed instrumental tracks for the band and has numerous Human League album credits.\nHis association with the Human League started in 1986, where he was employed as a session musician for the Crash Tour of late 1986. Studying as a Geology Undergraduate at Sheffield University, Neil took on a job at a Sheffield music instrument store. Philip Oakey came in one day and asked him to demonstrate some keyboards, then offered Neil the chance to go on tour with the band. Neil accepted and left his degree course. He was subsequently invited to work with the band further and joined the studio and stage team.\nIn conjunction with band principal Philip Oakey, Sutton has composed a number of the Human League's lyrics and instrumental scores on the Romantic? (1990), Octopus (1995) and Secrets (2001)  albums.", "link_mentions": [{"page": "The Human League", "response": ["In 1990, the band released their last album for Virgin Records, Romantic?. By now, longstanding members Adrian Wright and Ian Burden, together with newer recruit Jim Russell, had all left the band, although Jo Callis did return to play on some of the sessions and co-wrote two songs, including the minor hit single \"Heart Like a Wheel\". New to the line-up were keyboardist Neil Sutton, who had worked with the band on the Crash tour of 1986, and guitarist/keyboardist Russell Dennett. At odds with the prevailing trend of US grunge and the Manchester scene, the Romantic? album did not re-capture the group's huge commercial success of the 1980s, with its second single \"Soundtrack to a Generation\" barely charting.", "On the album cover artwork and in videos, the group was now presented simply as a trio of Oakey/Catherall/Sulley. In reality, however, other musicians had input to the record, including producer Ian Stanley, with continued playing and songwriting contributions from Neil Sutton and Russell Dennett; and Oakey co-writing one track with Jo Callis.", "In May 2000, the band signed to Papillon Records, a subsidiary of the Chrysalis Group, and began recording tracks for their new album due out the following year. The next album, titled Secrets, was released August 2001, and, like the previous album Octopus, the band was presented as the Oakey, Sulley and Catherall trio, although Neil Sutton was credited with keyboards and co-wrote most of the material with Oakey. The album received generally favourable reviews from critics. Commercially, the album flopped, entering the UK album chart at No. 44, falling off the chart the following week. This was not helped by the band's record label, Papillon, which developed financial problems. It was closed by the parent company shortly after the album's release, leading to poor promotion and sales. BBC Radio 1 also refused to playlist the single \"All I Ever Wanted\" because, now in their 40s, the band did not match the radio station's demographic target audience.", "To accompany the then-stalled album, the band conducted the 2001 'Secrets Tour'. Along with Sulley and Catherall, the band had Neil Sutton on keyboards. Long-time studio engineer David Beevers had become part of the on-stage line-up, controlling the sequencers from behind his deck of twin Apple Macintoshes. Oakey further recruited multi-instrumentalist Nic Burke, then aged 21, who he had seen playing in Sheffield, to play electric guitar and keytar. To round off the line-up in 2002, percussionist Errol Rollins was added to play the electronic drum kit. Rollins was replaced by Rob Barton in 2004.", "* Neil Sutton – keyboards (1986–2017)"]}, {"page": "Secrets (The Human League album)", "response": ["As on the previous album Octopus, the band was presented as a trio of singers – Philip Oakey, Joanne Catherall and Susan Ann Sulley (credited by her married name Susan Ann Gayle, which she would drop professionally in October 2007) – although band member Neil Sutton contributed songwriting and keyboards.", "# \"All I Ever Wanted\" (Philip Oakey, Neil Sutton)"]}, {"page": "Octopus (The Human League album)", "response": ["Octopus is the seventh full-length studio album recorded by the British synthpop band The Human League. It was produced by the former Tears for Fears keyboard player Ian Stanley and released by EastWest Records in 1995. It was the first new album from The Human League in five years after the termination of their long-term contract with Virgin Records. Octopus was the first Human League album that presented the band as a trio consisting of the singers Philip Oakey, Joanne Catherall and Susan Ann Sulley. The former Human League member Jo Callis and keyboard player Neil Sutton also contributed to the writing of the album.", "# \"One Man in My Heart\" (Oakey, Neil Sutton)"]}, {"page": "One Man in My Heart", "response": ["The song was written by Neil Sutton and Philip Oakey. Criticism of Susan Ann Sulley's vocals was that she was too technically proficient making her sound \"bland\": one critic declared that he missed \"The rough edges of the girl plucked from the Sheffield dance floor\".Music Week Magazine March 1995", "Category:Songs written by Neil Sutton"]}, {"page": "All I Ever Wanted (The Human League song)", "response": ["Category:Songs written by Neil Sutton"]}, {"page": "Filling Up with Heaven", "response": ["For the instrumental sections a continual sweeping loop of Neil Sutton playing keyboards is featured. Post production the video was intentionally stylized by deeply enriching the colours and reducing the pixel resolution, giving a digital smudge effect (as illustrated)."]}, {"page": "Soundtrack to a Generation (song)", "response": ["\"Soundtrack to a Generation\" is the second and final single to be taken from Romantic?. It would be the band's final original release under their contract with Virgin Records. It was written by lead singer Philip Oakey and keyboard player Neil Sutton and features vocals by Oakey, Joanne Catherall and Susan Ann Sulley.", "The music video for \"Soundtrack to a Generation\" was a simply shot studio performance of the song with video smudge effects and a video overlay of falling leaves to give an \"autumn\" effect. The band's dress style had been a deliberate attempt to distance themselves from the over-stylized, late-1980s videos. There was little change in Catherall, but Oakey had re-adopted long hair and wore leather chaps. Susan Ann Sulley had adopted a \"Supermodel\" style of a very short dress and bouffant blonde hair. The video would be keyboard player and co-songwriter Neil Sutton's first onscreen appearance with the band.", "Category:Songs written by Neil Sutton"]}, {"page": "Heart Like a Wheel (The Human League song)", "response": ["\"Heart Like a Wheel\" is a song by the British synthpop group The Human League. It was the first single to be taken from the Human League's Romantic? album of 1990, and was written by former band member Jo Callis with Eugene Reynolds (of The Rezillos) and features vocals by Philip Oakey, Joanne Catherall and Susan Ann Sulley; with synthesizer by Neil Sutton. Recorded at Genetic Sound Studios during 1990, it was produced by Martin Rushent who was reconciled with the band after a seven-year gap."]}]}}