{"wiki_id": "http://www.wikidata.org/entity/Q6997045", "itemLabel": "Nerys Evans", "itemDescription": "British politician (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nerys_Evans", "wikipedia_page": {"main": "(Elizabeth Gwendoline) Nerys Evans (born 1980) is a Welsh politician. She was a member of the National Assembly for Wales representing Plaid Cymru in the Mid and West Wales region. She contested the Carmarthen West and South Pembrokeshire seat for the 2011 National Assembly for Wales elections, finishing in third place, and thus lost her seat in the Assembly.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Nerys Evans AM (born 1980), Plaid Cymru"]}, {"page": "Ofcom", "response": ["In 2017, Ofcom’s advisory committee for Wales awarded Deryn Consulting a contract to monitor the National Assembly for Wales and Welsh Government. It was subsequently reported that the contract had not been put out to tender and that Huw Roberts and Nerys Evans held positions for both Deryn and Ofcom.Private Eye, March 9th, 2018. p13. The contract was terminated and Ofcom concluded that it had broken its own procurement rules."]}, {"page": "Simon Thomas (politician)", "response": ["In September 2010, Simon Thomas was placed at the top of Plaid Cymru's regional list for Mid and West Wales in the 2011 Welsh Assembly election with the incumbent Nerys Evans instead running for the constituency seat of Carmarthen West and South Pembrokeshire. He was elected to the National Assembly for Wales."]}, {"page": "Nerys", "response": ["*Nerys Evans (born 1980), Welsh politician"]}, {"page": "Mid and West Wales (Senedd electoral region)", "response": ["|Nerys Evans(PC)", "| Nerys Evans"]}, {"page": "List of people with surname Evans", "response": ["*Nerys Evans (born 1980), Welsh politician"]}, {"page": "2011 National Assembly for Wales election", "response": ["| Nerys Evans", "*Nerys Evans, Plaid Cymru, Mid and West Wales electoral region"]}, {"page": "Members of the 3rd National Assembly for Wales", "response": ["| Nerys Evans"]}]}}