{"wiki_id": "http://www.wikidata.org/entity/Q7002019", "itemLabel": "Tom Watson", "itemDescription": "English mixed martial arts fighter (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Watson_(fighter)", "wikipedia_page": {"main": "Tom \"Kong\" Watson (born 13 July 1982) is an English mixed martial artist currently competing in the welterweight division of Cage Warriors. A professional competitor since 2006, he is the former BAMMA Middleweight Champion, the former UCMMA Middleweight Champion, and has also competed for the UFC, Cage Rage and the MFC.", "link_mentions": [{"page": "Savate", "response": ["* Tom Watson (fighter)"]}, {"page": "Thomas Watson", "response": ["*Tom Watson (journalist) (born 1962), journalist and author", "*Tom Watson (golfer) (born 1949), American golfer", "*Tom Watson (footballer, born 1870) (1870–1902), English football goalkeeper for Small Heath", "*Tom Watson (footballer, born 1904), footballer for Rochdale", "*Tom Watson (footballer, born 1900) (1900–1978), Ireland international football player", "*Tom Watson (football manager) (1859–1915), English football manager", "*Tom Watson (Australian footballer) (1874–1920), Australian rules footballer", "*Tom Watson (fighter) (born 1982), mixed martial artist", "*Tom Watson (Labour politician) (born 1967), British politician; former Deputy Leader of the Labour Party; and former MP for West Bromwich East", "*Tom Watson (actor) (1932–2001), Scottish-born stage, television and film actor", "* Tom Watson (musician) (born 1962), American guitarist"]}, {"page": "List of male mixed martial artists", "response": ["*  Tom Watson - (UFC, BAMMA, MFC)"]}, {"page": "Lee Barnard", "response": ["On 3 October 2010, Barnard was arrested in connection with a brawl in the White House nightclub in Southampton; he was immediately given police bail to go to Southampton General Hospital to have treatment for an injury to his hand. Amongst the witnesses to the incident was cage fighter, Tom Watson, who was celebrating his recent victory over Celebrity Big Brother winner Alex Reid."]}, {"page": "Daijiro Matsui", "response": ["| Tom Watson"]}, {"page": "Frank Trigg", "response": ["Trigg was scheduled to be the main event at BAMMA 7 against Tom Watson for the Middleweight title. However, on August 9, it was announced that Watson had to pull out due to a back injury and would be replaced by Jim Wallhead in a non-title fight. Trigg lost the fight via split decision."]}, {"page": "Maximum Fighting Championship", "response": ["Maximum Fighting Championship is a Canadian mixed martial arts (MMA) promotion based in Edmonton, Alberta. MFC’s former home, in Canada, is the River Cree Resort and Casino in Enoch, Alberta, located just outside Edmonton, Alberta, but has also held events at the Edmonton Expo Centre. MFC events are broadcast on The Fight Network, AXS TV (formerly HDnet) in North America and most recently TSN2. MFC is known to be the biggest MMA promotion in Canada and one of the top MMA shows in the World. MFC has featured notable fighters, such as Ryan Jimmo, Graham Spencer, Tom Watson and Douglas Lima, plus MMA veterans, such as Jason MacDonald, Thales Leites, Jay Silva, Trevor Prangley, and Paul Daley."]}, {"page": "Thales Leites", "response": ["After winning three in a row, Leites was signed by the UFC and made his return against Tom Watson on 3 August 2013 at UFC 163. He won the fight via dominant unanimous decision.", "|Tom Watson"]}, {"page": "Murilo Rua", "response": ["\"Ninja\" fought Tom Watson for the BAMMA Middleweight Title on May 21, 2011. The fight proved to be a one sided affair, with Rua being rocked several times throughout the fight, as well as being visibly hurt with leg kicks. The end came at 2:06 of the third round after Watson stunned Rua with a head kick and followed up with strikes until the referee stepped in to save the unconscious Rua.http://www.bamma.com/videos.php?MDID=124", "After Rua lost against Tom Watson, he said he would not continue fighting and would retire.", "| Tom Watson"]}, {"page": "Alessio Sakara", "response": ["Sakara was slated to face Tom Watson at UFC Fight Night 30. However, Watson was forced out of the bout with an injury and was replaced by Magnus Cedenblad.  Subsequently in early October, Cedenblad was forced out of the Sakara bout with an injury and replaced by newcomer Nico Musoke. Sakara lost the fight by submission due to an armbar in the first round and was released from the promotion shortly after."]}, {"page": "Matt Horwich", "response": ["| Tom Watson"]}, {"page": "Jesse Taylor", "response": ["His second fight for MFC took place on the main card of the MFC 26 card against Tom Watson. Taylor won via unanimous decision (30-26, 30-26, 30-26).", "| Tom Watson"]}, {"page": "Donald Cerrone", "response": ["Cerrone began his career in Commerce City, Colorado at a gym called Freedom Fighters. In 2006, Cerrone began training with Jon Jones, Rashad Evans, Nathan Marquardt, Keith Jardine, Georges St-Pierre, Leonard Garcia, Tom Watson and other skilled MMA fighters at Greg Jackson's Submission Fighting Gaidojutsu school in Albuquerque, New Mexico."]}, {"page": "List of UFC bonus award recipients", "response": ["|Tom Watson || vs. || Stanislav Nedkov", "|Tom Watson"]}, {"page": "Nick Catone", "response": ["Catone faced Tom Watson in a middleweight bout on February 1, 2014 at UFC 169. He won the fight via split decision.", "| Tom Watson"]}, {"page": "Stanislav Nedkov", "response": ["Nedkov made his Middleweight debut against Tom Watson on February 16, 2013 at UFC on Fuel TV: Barão vs. McDonald. He lost the back-and-forth fight via TKO in the second round. Both participants earned Fight of the Night honors for their performance.", "**Fight of the Night (One time) vs. Tom Watson ", "| Tom Watson"]}, {"page": "Alex Reid (fighter)", "response": ["| Tom Watson"]}, {"page": "Chris Camozzi", "response": ["Camozzi faced Tom Watson on August 8, 2015, at UFC Fight Night 73. He won the fight by unanimous decision.", "|Tom Watson"]}, {"page": "Brad Tavares", "response": ["Tavares next defeated former BAMMA middleweight champion and UFC newcomer Tom Watson via split decision on  at UFC on Fuel TV: Struve vs. Miocic.", "|Tom Watson"]}, {"page": "BAMMA", "response": ["BAMMA 6 took place at Wembley Arena on May 21, 2011, and featured a title defence by Tom Watson. It was announced on March 16, 2011, that Tom Watson would face Murilo Rua. Rumours began to circulate that wrestler Dave Batista would make his MMA debut at BAMMA 6. However this was not the case, instead UFC veterans Frank Trigg and Ivan Salaverry took part at the event, posting a win and a loss respectively.", "|align=left | Tom Watsondef. Matt Horwich"]}, {"page": "Rafael Natal", "response": ["Natal next faced Tom Watson on January 31, 2015 at UFC 183. He won the fight by unanimous decision.", "|Tom Watson"]}, {"page": "Tristar Gym", "response": ["*Tom Watson"]}, {"page": "John Maguire (fighter)", "response": ["| Tom Watson"]}, {"page": "Ultimate Challenge MMA", "response": ["*Tom Watson\t"]}, {"page": "2012 in mixed martial arts events", "response": ["The British Association of Mixed Martial Arts (BAMMA) held its first 2012 event, BAMMA 9, on March 24, 2012. It was held at the National Indoor Arena in Birmingham, England.  In the main event BAMMA World Middleweight Champion Tom Watson faced Jack Marshman.  Watson won his title from Matt Horwich at BAMMA 3 in May, 2010, and has since defended it three twice against Alex Reid and Murilo Rua.  Marshman is the reigning, and first, BAMMA British Middleweight Champion winning it at BAMMA 7 in September, 2011, after defeating Carl Noon.  In this bout, Watson defended his title by defeating Jack Marshman at 4:50 of the second round by technical knockout."]}, {"page": "List of BAMMA events", "response": ["| Tom Watson", "BAMMA 3: Horwich vs. Watson was a mixed martial arts event held by the British Association of Mixed Martial Arts on 15 May 2010 at the LG Arena in Birmingham. It featured three title fights, and was headlined by Matt Horwich and Tom Watson. The event was televised on Bravo in the United Kingdom.", "Tabloid celebrity and former MMA fighter Alex Reid was scheduled to return to the cage and face Tom Watson at the event. However, Reid injured his knee while filming his documentary TV series Alex Reid: The Fight of His Life and was forced to pull out of the fight. This angered Watson, who claimed Reid was disrespecting him. Watson also called him a \"clown\" and said that it was likely Reid pulled out to avoid an embarrassing defeat. Reid was then replaced by UFC and IFL veteran Matt Horwich.", "| Tom Watson", "| Tom Watson", "Tom Watson was originally set to defend his Middleweight Championship against Frank Trigg. However, on 9 August, it was announced that Watson had to pull out due to a back injury and was replaced with Jim Wallhead.", "| Tom Watson"]}, {"page": "2012 in UFC", "response": ["*Tom Watson"]}, {"page": "List of people from Hampshire", "response": ["*Tom Watson, kickboxer, was born in Southampton"]}, {"page": "UFC Fight Night: Machida vs. Muñoz", "response": ["Tom Watson was expected to face Alessio Sakara at this event. However, Watson had to pull out due to an injury and was replaced by Magnus Cedenblad.  Subsequently, in early October, Cedenblad was forced out of the Sakara bout with an injury and replaced by newcomer Nico Musoke."]}, {"page": "UFC on Fuel TV: Barão vs. McDonald", "response": ["* Fight of the Night:  Tom Watson vs.  Stanislav Nedkov", "* Knockout of the Night: Tom Watson"]}]}}