{"wiki_id": "http://www.wikidata.org/entity/Q7004675", "itemLabel": "Neville Dilkes", "itemDescription": "English conductor and organist", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Dilkes", "wikipedia_page": {"main": "Neville Dilkes (born 28 August 1930) is an English conductor and organist.\nHe was born in Derby, England to a musical family.  He became a Fellow of Trinity College of Music, London, and later did his National Service in the Royal Army Medical Corps.  He taught at Repton, and then in 1955 was named Director of Music at Corby Grammar School, where he mounted a school production of Gluck's opera Orfeo ed Euridice.  This brought together a number of musicians from the Midlands, who formed the Kettering Symphony Orchestra under Dilkes' leadership.In 1961 he formed the Midland Sinfonia and also a chamber music performance group, Opera Da Camera.  The Midland Sinfonia was administered from Dilkes' home for its first five years; it acquired a permanent office in Nottingham in 1966, and gave its first London concert in 1968.  It was later renamed the English Sinfonia.\nIn 1963 he joined the Netherlands Radio Union International Conductors' Course, where his principal tutor was Dean Dixon.  He was the inaugural winner of the Watney-Sargent Award, chosen by Sir Malcolm Sargent himself.He is an associate conductor of the Philomusica of London.  He is a Fellow of the Royal College of Organists.", "link_mentions": [{"page": "Concertino for Harpsichord and String Orchestra (Leigh)", "response": ["It has been recorded by Trevor Pinnock on Lyrita; George Malcolm on BBC radio classics; Colin Tilney on CBC; Neville Dilkes on EMI; Anna Paradiso on Barn Cottage Records (2012). A 1940s English Decca Records recording of Kathleen Long in the piano version has achieved compact disc rerelease on the Dutton label.Culot, Hubert, Review of Walter Leigh: Complete Chamber Works (Dutton Epoch CDLX 7143) on MusicWeb International, accessed August 31, 2009"]}, {"page": "The Banks of Green Willow", "response": ["* Neville Dilkes/English Sinfonia (1971)"]}, {"page": "Symphony in G minor (Moeran)", "response": ["Other conductors to record Moeran's Symphony in G minor include Neville Dilkes (English Sinfonia, 1972), Sir Adrian Boult (New Philharmonia Orchestra, released 1975), Vernon Handley (Ulster Orchestra, 1987) and David Lloyd-Jones (Bournemouth Symphony Orchestra, 2001)."]}]}}