{"wiki_id": "http://www.wikidata.org/entity/Q7004622", "itemLabel": "Neville Atkinson", "itemDescription": "British aviator (1933-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Atkinson", "wikipedia_page": {"main": "Neville Clive Atkinson (7 July 1933 – 13 January 2007) was a British aviator who served as personal pilot to Libyan President Muammar Gaddafi during the 1970s.Atkinson was born in Beverley in the East Riding of Yorkshire, and served in the Fleet Air Arm of the Royal Navy. He served aboard HMS Centaur and piloted Sea Vixen FAW2 fighters. In 1972 Atkinson left the Navy to take up the position as personal pilot to Muammar Gaddafi. For the next 10 years his role was to fly Gaddafi, government ministers and various world dignitaries around the Middle East and Africa.\nA notable moment in Atkinson's career was in December 1975, when he was given the task of flying Carlos the Jackal and a number of other terrorists. He extracted Carlos and his fellow terrorists from Algeria, saving the lives of sixty people who had been taken hostage in the raid on OPEC headquarters in Vienna. It is reputed that Neville asked Carlos to sign a copy of Frederick Forsyth's novel Day of the Jackal during the flight.In 2006 Atkinson published a book Death on Small Wings: Memoirs of a Presidential Pilot which detailed his experiences.\nHe died on 13 January 2007, aged 73.", "link_mentions": [{"page": "Atkinson (surname)", "response": ["* Neville Atkinson, Royal Navy pilot"]}, {"page": "Neville atkinson", "response": ["#REDIRECT Neville Atkinson "]}, {"page": "Carlos the Jackal", "response": ["On 22 December, the government provided the PFLP and 42 hostages an airplane and flew them to Algiers, as demanded for the hostages' release. Ex-Royal Navy pilot Neville Atkinson, at that time the personal pilot for Libya's leader Muammar al-Gaddafi, flew Carlos and a number of others, including Hans-Joachim Klein, a supporter of the imprisoned Red Army Faction and a member of the Revolutionary Cells, and Gabriele Kröcher-Tiedemann, from Algiers.Death on Small Wings, . Atkinson flew the DC-9 to Tripoli, where more hostages were freed, before he returned to Algiers. The last hostages were freed there and some of the terrorists were granted asylum."]}]}}