{"wiki_id": "http://www.wikidata.org/entity/Q7004709", "itemLabel": "Neville Heath", "itemDescription": "British murderer", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Heath", "wikipedia_page": {"main": "Neville George Clevely Heath (6 June 1917 – 16 October 1946) was an English murderer who killed two young women in the summer of 1946. He was executed in Pentonville Prison, London in October 1946.", "link_mentions": [{"page": "Black comedy", "response": ["* Neville Heath was hanged for murder in 1946.  A few minutes prior to his execution, as was the custom, Heath was offered a glass of whisky to steady his nerves by the prison governor.  He replied, \"While you're about it, sir, you might make that a double\".O'Connor, Sean (2013) Handsome Brute Simon & Schuster. p.382"]}, {"page": "Donald Serrell Thomas", "response": ["His 1978 (rev. ed. 2001) biography of Admiral Thomas Cochrane, 10th Earl of Dundonald highlights the characteristics of that individual which served in large part as inspiration both for C. S. Forester's Horatio Hornblower, and for Patrick O'Brian's Jack Aubrey. In 1994, his Hanged in Error? provided an overview/investigation as to the likely guilt of seven individuals all hanged in the UK before its abolition as a means of capital punishment in 1965. The book dealt with the cases of Timothy Evans, John Williams (alias George MacKay, hanged in 1913 for the fatal shooting of Inspector Arthur Walls in Eastbourne during a burglary attempt), Edith Thompson, Robert Hoolhouse, Neville Heath, Charles Jenkins (hanged in 1947 together with Christopher Geraghty for fatally shooting Alec de Antiquis following a botched London jewel robbery), and James Hanratty. (N.B. This is not the same as the similarly titled 1961 book Hanged in Error by Leslie Hale, which contains a different set of case histories.)", "*Rotten to the Core?: The Life and Death of Neville Heath (Routledge and Kegan Paul 1988) "]}, {"page": "Capital punishment in the United Kingdom", "response": ["*16 October 1946: Neville Heath was hanged at Pentonville Prison for the rape and murder of two women."]}, {"page": "HM Prison Pentonville", "response": ["* 1946: Neville Heath was hanged in the prison in 1946 after having been convicted of murdering two women."]}, {"page": "John Haigh", "response": ["*The mid-1960s unproduced Hitchcock project Kaleidoscope had been inspired by Haigh and serial killer Neville Heath."]}, {"page": "Frenzy", "response": ["The plot centres on a serial killer in contemporary London and the ex-RAF serviceman he implicates. In a very early scene there is dialogue that mentions two actual London serial murder cases: the Christie murders in the early 1950s, and the Jack the Ripper murders in 1888. Barry Foster has said that, in order to prepare for his role, he was asked by Hitchcock to study two books about Neville Heath, an English serial killer who would often pass himself off as an officer in the RAF."]}, {"page": "The Black Museum", "response": ["* Neville Heath – \"The Powder Puff\" "]}, {"page": "Ian Charleson", "response": ["In the 1980s his notable starring TV roles included: Alexander the Great's close companion Hephaistion in the PBS miniseries The Search for Alexander the Great; serial killer Neville Heath in an episode of the murder-trial reenactment series Ladykillers (1981); naive Scot turned powerful South African magnate Jamie MacGregor in the miniseries Master of the Game (1984); romantic lead Clarence Dandridge in the period miniseries Louisiana (1984) opposite Margot Kidder; and protagonist Victor Geary in the stylish and clever Oxbridge Blues (1984), written by Frederic Raphael, directed by James Cellan Jones, and co-starring Amanda Redman, Rosalyn Landor, and Malcolm Stoddard.", "| Neville Heath"]}, {"page": "Crime Museum", "response": ["*Neville Heath, an English killer who was responsible for the murders of at least two young women, and who was executed in London in 1946"]}, {"page": "Rutlish School", "response": ["* Neville Heath, murderer, executed in 1946 (1928–33)"]}, {"page": "Moira Lister", "response": ["thumb|Coat of arms of the Gachassin-Lafite d'Orthez family|146x146pxIn 1946, Lister went on a date in London with Neville Heath, a former South African Air Force captain who murdered two women in London only months later. Heath was convicted after a sensational trial, and he was hanged in October 1946."]}, {"page": "Alfred Hitchcock's unrealized projects", "response": ["The story (inspired by English serial killers Neville Heath and John George Haigh) would have revolved around a young, handsome bodybuilder who lures young women to their deaths, a version of the character known as 'Merry Widow Murderer' in Shadow of a Doubt. The New York police set a trap for him, with a policewoman posing as a potential victim. The script was based around three crescendos dictated by Hitchcock: the first was a murder by a waterfall; the second murder would take place on a mothballed warship; and the finale, which would take place at an oil refinery with brightly colored drums."]}, {"page": "Strand Palace Hotel", "response": ["In February 1946, Neville Heath was found by staff members in a room standing over the body of Pauline Rees, an incident occurring during Heath's murder career."]}, {"page": "Locations of executions conducted by Albert Pierrepoint", "response": ["* Neville Heath, the \"Lady killer\" executed at Pentonville on 16 October 1946."]}, {"page": "Great Crimes and Trials", "response": ["|Neville Heath"]}, {"page": "Keith Simpson (pathologist)", "response": ["* 1946 Margery Gardner, murdered by Neville Heath.", "File:NevilleHeath.jpg|Neville Heath who was convicted of murdering Margery Gardner"]}, {"page": "Neville George Clevely Heath", "response": ["#REDIRECT Neville Heath"]}, {"page": "Infamous Murders", "response": ["Random killers Neville Heath, the Hillside Strangler, and the Coed Killer."]}, {"page": "Heath (name)", "response": ["*Neville Heath (1917–1946), British murderer"]}, {"page": "Eyewitness (1956 film)", "response": ["The lead role of a murderer was a change of pace for actor Donald Sinden, who did extensive research for the part, modelling his performance on Neville Heath. The film was shot in mid 1956.Round the British Studios"]}, {"page": "Sean O'Connor (producer)", "response": ["Handsome Brute , a study of the murders of Neville Heath in the 1940s, was published in 2013 by Simon & Schuster."]}, {"page": "Doreen Margaret Marshall", "response": ["#REDIRECT Neville Heath"]}, {"page": "Margery Gardner", "response": ["#REDIRECT Neville Heath#Margery Gardner"]}, {"page": "J. D. Casswell", "response": ["==Neville Heath==", "In 1946, Casswell’s attentions returned to Bournemouth, which had been the scene of the gruesome murder of Doreen Marshall by Neville Heath. Heath had also killed Margery Gardener, and there was discussion as to which murder should be the basis of his trial. Doreen Marshall’s murder had been so brutal that the prosecution felt it opened the door to a defence plea of insanity, so he was tried for Margery Gardner’s killing. In court the debate focussed on the question of whether or not Heath was in his right mind.’Handsome Brute’ by Sean O’connor"]}, {"page": "Chamber of Horrors (Madame Tussauds)", "response": ["Other exhibits have included George Chapman, John Reginald Halliday Christie, William Corder, Dr Hawley Harvey Crippen, Colonel Despard, John Haigh, Neville Heath, Bruno Hauptmann, Henri Landru, Charles Manson, Florence Maybrick, Donald Neilson, Dennis Nilsen, Mary Pearcey, Buck Ruxton, George Joseph Smith and Arthur Thistlewood.'Creepy Historic Photos From Madame Tussauds 'Chamber of Horrors' - The Huffington Post 17 July 2013"]}, {"page": "Heath Murders", "response": ["#REDIRECTNeville Heath"]}, {"page": "Anthony Hawke (judge, born 1895)", "response": ["He married the widow Evelyn Audrey Lee Davies (1905/6–1977) in 1931 and they had a daughter. His practice was mainly centred at the  Central Criminal Court where he was junior prosecuting counsel in 1932, third senior prosecuting counsel in 1937, second senior prosecuting counsel in 1942, and senior prosecuting counsel from 1945 to 1950. Here among others he prosecuted the murderers Neville Heath and Daniel Raven. Hawke was the Recorder of BathAppointment as Recorder of Bath - The London Gazette 10 January 1939 pg 208 from 1939 to 1950 and the Deputy Chairman of the Hertfordshire Quarter Sessions from 1940 to 1950. He became a Bencher of his Inn in 1942 and in 1950 was appointed Chairman of the County of London Quarter Sessions. In 1954 he was knightedHonour of knighthood - The London Gazette 1 January 1954 pg 2 and in the same year he succeeded Hugh Loveday Beazley as Common Serjeant, the second most senior permanent judge of the Central Criminal Court; in 1959 he was appointed Recorder of London, the senior Circuit Judge at the Central Criminal Court, hearing trials of criminal offences. One of the last cases he tried as Recorder at the Old Bailey was that of Christine Keeler who was accused of perjury."]}, {"page": "List of wax figures displayed at Madame Tussauds museums", "response": ["* Neville Heath"]}, {"page": "Nevil Heath", "response": ["#redirect Neville Heath"]}, {"page": "List of last words (20th century)", "response": [":— Neville Heath, English murderer (16 October 1946), when offered a drink prior to execution by hanging"]}]}}