{"wiki_id": "http://www.wikidata.org/entity/Q7004817", "itemLabel": "Neville Powell", "itemDescription": "Welsh footballer and manager (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Powell", "wikipedia_page": {"main": "Neville Powell (born 2 September 1963) is a Welsh football manager and former professional player who was most recently director of football at Aberystwyth Town.\nPowell began his playing career at Tranmere Rovers, making a goalscoring debut for the club at the age of 17 on 1 March 1981 in a match against Torquay United. He left the club in 1984 having made 86 appearances for the Prenton Park club, scoring four goals. He went on to spend eight years with Bangor City, playing for the club in the first season of the Welsh Premier League.\nIn 1993, he took over as player-manager of Connah's Quay Nomads, where his playing career came to an end following a broken leg sustained during a game against Llansantffraid on the opening day of the 1996–97 season. After 14 years in charge at Connah's Quay, Powell took over as manager of Bangor City in 2007, replacing Steve Bleasdale.Bangor under Neville Powell have been very successful, beating FC Honka in the Europa League 3–2 on aggregate in July 2010, also winning the Welsh Cup for three consecutive years (2008–2010) and winning the Welsh Premier League in the 2010–2011 season after starting the season with 15 consecutive wins, a run which was acknowledged across Europe.\nOn 25 July 2016 news broke that Neville Powell had been \"relieved of his duties\", according to a statement released by the club.\nOn 11 July 2017, Powell was named as manager of Aberystwyth Town. On 28 March 2018 the club announced Powell would become director of football and Irish coach Seamus Heath would become manager.On 6 May 2020, Powell left Aberystwyth Town.", "link_mentions": [{"page": "Bangor City F.C.", "response": ["|  Neville Powell"]}, {"page": "Connah's Quay Nomads F.C.", "response": ["Finishing 8th in the new national competition in 1992–93 was a fine achievement after a poor start as was Nomads' appearance in the semi-final of the Welsh Cup despite the disappointment of a 2–1 aggregate defeat against Clwyd rivals Rhyl. Neville Powell joined the club as player/manager in the summer of 1993 though he suffered a bad injury very early in his career at Connah's Quay that would end his playing career. Nevertheless, he steadily built his team into one capable of challenging for a European place. Within twelve months of Powell's arrival, Nomads won the North Wales Coast F.A. Cup and, in 1995–96, won the League of Wales League Cup, beating Ebbw Vale in the final at Caersws.", "During the following close season manager Neville Powell left to become Bangor City manager, followed by other members of the coaching staff and several senior players. Powell had previously captained Bangor for a number of years before moving to Connah's Quay. Londoner Jim Hackett, formerly a youth coach at Chester City, was appointed manager and he was soon joined by Congleton Town manager Andy Lee as his assistant. Between them they assembled a fresh squad from scratch, including a number of players with previous associations with the two new men and only three players from the previous season, two of whom (Adam Dickinson and Christopher Williams) were under contract. The third, Gary Pinch, was made club captain. The changes were to continue the next close season though, when following the bereavement and retirement of several directors in a twelve-month period, Nomads were taken over in June 2008 and former Caernarfon Town boss Steve O'Shaughnessy was appointed manager.", "* Neville Powell / Phil Evans (May 1993 – May 1995)", "* Neville Powell (May 1995 – May 2007)"]}, {"page": "2007–08 Welsh Premier League", "response": ["| Neville Powell"]}, {"page": "2009–10 Welsh Premier League", "response": ["| Neville Powell", "Neville Powell (Bangor City)"]}, {"page": "Aberystwyth Town F.C.", "response": ["* Neville Powell (12 July 2017 – 28 March 2018)", "* Neville Powell (3 October 2018 – 27 January 2019)"]}, {"page": "2010 Welsh Cup Final", "response": ["|colspan=\"4\"| Neville Powell"]}, {"page": "2011 Welsh Cup Final", "response": ["|colspan=\"4\"| Neville Powell"]}, {"page": "Seamus Heath", "response": ["On 28 March 2018, Heath was announced as manager of Welsh club Aberystwyth Town due to former manager Neville Powell's pro licence expiring."]}, {"page": "2014–15 Welsh Premier League", "response": ["| Bangor ||  Neville Powell ||  || Macron || Pentraeth Kia"]}, {"page": "2015–16 Welsh Premier League", "response": ["| Bangor ||  Neville Powell ||  Leon Clowes || Macron || Dafydd Hardy (home) Anglesey Sea Zoo (away)"]}]}}