{"wiki_id": "http://www.wikidata.org/entity/Q7004834", "itemLabel": "Neville Rogers", "itemDescription": "English cricketer (1918-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Rogers", "wikipedia_page": {"main": "Neville Hamilton Rogers (9 March 1918 – 7 October 2003) was an English first-class cricketer who played for Hampshire.\nRogers was a right-handed top order batsman and scored a century before lunch against the touring West Indians in 1950. He never played for England but came close in 1951, acting at the 12th man in a Test against South Africa at The Oval. He passed 1000 runs in a season every year from 1947 until 1955. His highest season total was 2244 runs in 1952 and made his highest score of 186 against Gloucestershire the previous year.", "link_mentions": [{"page": "1947 English cricket season", "response": ["Hampshire, a very ordinary side who bowled badly, were captained by Desmond Eagar. The batting was occasionally good and top of the county's averages was wicketkeeper Neil McCorkell who scored 1,539 championship runs and claimed 49 victims. Neville Rogers and Johnny Arnold played some good innings to both comfortably exceed 1,000 runs. Eagar and Gerry Hill both reached 1,000 with low averages and the all-rounder Jim Bailey, who took 53 wickets, fell just short of 1,000 runs. Playfair considered \"the steady and loyal George Heath\" to be the best of the bowlers who included Bailey, Hill, Victor Ransom, Lofty Herman and the injury-plagued Charles Knott. Other players included Gilbert Dawson, Thomas Dean, Arthur Holt, Alan Shirreff and future stalwart Leo Harrison.Playfair, pp. 110–111."]}, {"page": "Ronald Harvey (cricketer)", "response": ["Harvey made his only first-class appearance for Essex against T. N. Pearce's XI in 1952.  In this match he took three wickets in T. N. Pearce's XI's first-innings, taking the wickets of Neville Rogers, Maurice Tompkin and Peter Smith for the cost of 88 runs from 16 overs.  Essex made just 205 in response to T. N. Pearce's XI's first-innings score of 389, with Harvey batting at number eleven ended unbeaten on 12.  Essex were forced to follow-on in their second-innings and were dismissed for 159, with Harvey ending not out on zero.  Essex lost the match by an innings and 25 runs."]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Neville Rogers (1949–1954) : N. H. Rogers (Hampshire)"]}]}}