{"wiki_id": "http://www.wikidata.org/entity/Q7025220", "itemLabel": "Nicholas Cleobury", "itemDescription": "English conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Cleobury", "wikipedia_page": {"main": "Nicholas Cleobury (born 23 June 1950) is an English conductor.\nCleobury was organ scholar at Worcester College, Oxford, conductor of Schola Cantorum of Oxford and held assistant organist posts at Chichester Cathedral and Christ Church, Oxford before turning to orchestral and operatic work. He is Founder-Laureate of the Britten Sinfonia and has been particularly active in the promotion of contemporary music.   He was from 1997 - 2015 principal conductor of the Oxford Bach Choir.Cleobury's elder brother Stephen was Director of Music at King's College, Cambridge.\nCleobury joined the Queensland Conservatorium as Head of Opera in 2016.", "link_mentions": [{"page": "Bromley", "response": ["Other famous people who lived in Bromley include David Bowie, Charles Darwin, Talbot Rothwell, screenwriter of twenty Carry On films, Justine Lord, actress, Peter Howitt, Richmal Crompton, Pixie Lott, Matt Terry, Christopher Tennant,  Hanif Kureishi, Peter Frampton, Aleister Crowley, bassist Steven Severin of Siouxsie and the Banshees, Fatboy Slim, Jack Dee, Gary Rhodes, Pete Sears, singer Poly Styrene, Billy Idol, Josh Beech, Ruthie Henshall, Trevor Goddard, actor Billy Jenkins, Alex Clare, cricketer Jill Cruwys, the anarchist Peter Kropotkin, the former Clash drummer Topper Headon, illustrator Charles Keeping, Formula 1 test driver Gary Paffett, IndyCar driver Mike Conway, children's writer Andrew Murray, tenor Roland Cunningham, actor Michael York who attended Bromley Grammar School for Boys, clarinetist Chris Craker, Don Perrin, Canadian author who attended Burnt Ash School in Bromley, and Sir Thomas James Harper, an officer decorated in the Crimean War. The musical conducting brothers Stephen and Nicholas Cleobury were born in Bromley. Actor Jerome Flynn, who starred in Game of Thrones as Bronn, was born in Bromley. Gus Lobban and Jamie Bulled of the band Kero Kero Bonito grew up in Bromley: their music video for the song 'You Know How It Is' features several local landmarks."]}, {"page": "Bruce Beresford", "response": ["In addition to films, Bruce Beresford has also directed several operas and theatre productions. In 2016, he directed Benjamin Britten's opera Albert Herring for the Queensland Conservatorium of Music, in a production conducted by Nicholas Cleobury."]}, {"page": "Richard Rodney Bennett", "response": ["*1995 Partita / Four Jazz Songs / Enchanted April Suite – Britten Sinfonia, Nicholas Cleobury, the composer, Neil Richardson (BBC)"]}, {"page": "Huddersfield Philharmonic Orchestra", "response": ["The years 2000 and 2001 saw the Phil produce a CD of significant performances whilst planning major concerts, including performances of Sally Beamish’s concerto for saxophone, The Imagined Sound of Sun on Stone, with John Harle as soloist and another huge Mahler symphony, his third. When John Harle was taken ill, a potential problem became the beginning of a new musical friendship when his place was taken by Jack Liebeck, in a performance of the Mendelssohn Violin concerto. “Victory snatched from the jaws of defeat “read the headline in the Huddersfield Examiner, and the reviewer commented “Clearly, members knew this piece but, to dust it down in one hour and give such a performance demonstrates the talent which the Huddersfield Philharmonic has in its ranks.” If this concert tested the abilities of the players, the plans for Mahler’s Third Symphony were to With the sudden unavailability of Rupert D’Cruze, Nicholas Cleobury stepped in to take on the task of performing Mahler’s Third Symphony and, following this success, he was appointed as Principal Guest Conductor within two years. He has attracted comments including:", "‘Guest conductor Nicholas Cleobury paid the orchestra the supreme compliment of making no concession to its “amateur” status’", "‘Nicholas Cleobury turned what could have been a hairy experience into a convincing one, full of raw energy and glittering colour’"]}, {"page": "King's School, Worcester", "response": ["| Nicholas Cleobury || (1950–) || Organist, conductor of the Britten Sinfonia and the Oxford Bach Choir"]}, {"page": "Brisbane Philharmonic Orchestra", "response": ["* Nicholas Cleobury"]}, {"page": "Oxford Bach Choir", "response": ["* Nicholas Cleobury (1997–2015)"]}, {"page": "Bob Chilcott", "response": ["Chilcott’s Requiem was premiered on 13 March 2010 at the Sheldonian in Oxford by the Oxford Bach Choir and the Royal Philharmonic Orchestra, conducted by Nicholas Cleobury.A new Requiem by Bob Chilcott  Nicola Lisle, The Oxford Times 4 March 2010 Chilcott conducted the premiere of his On Christmas Night on 12 December 2010 at the University Christian Church of Austin, Texas.Bob Chilcott / On Christmas Night Oxford University pressWorld Premiere ~ On Christmas Night ~ Composed and Conducted by Bob Chilcott  University Christian Church, Austin 2010 The UK premiere of On Christmas Night was given on 28 November 2011 in Rugby School by the Arnold Singers conducted by Richard Dunster-Sigtermans. Christmas Night received its Scottish premiere on 14 December 2011 at the Usher Hall in Edinburgh performed by the Dollar Academy Combined School Choirs.Dollar Academy Christmas Concert  Dollar Academy 14 December 2011"]}, {"page": "Christ Church Cathedral, Oxford", "response": ["First among the notable organists of Christ Church Cathedral is the Renaissance composer John Taverner, who was appointed as the first organist by Wolsey in 1526. Other organists (and directors of the choir) have included Basil Harwood, Thomas Armstrong, W. H. Harris, Simon Preston, Francis Grier, Nicholas Cleobury and Stephen Darlington. The post of organist is currently held by Steven Grahl. (As in many English cathedrals, the organist is also director of the choir and much of the organ playing is delegated to the sub-organist or organ scholar.)"]}, {"page": "Kids' Classics", "response": ["Kids' Classics is an album by classical musician Vanessa-Mae, released in 1991 (see 1991 in music) on the Tritico record label. It was recorded in association with the New Belgian Chamber Orchestra, conducted by Nicholas Cleobury. The music was recorded in Ghent, Belgium. The album, as the title suggests, was geared towards younger listeners, but comprises primarily well-known and recognized compositions."]}, {"page": "Romeo.Juliet", "response": ["British-born conductor Nicholas Cleobury led the National Orchestra of Belgium in three performances.  Upon an invitation by Armando Acosta,  John Hurt and Oleg Prokofiev, son of the composer, Serge Prokofiev attended the premiere.  "]}, {"page": "Jonathan Pitkin", "response": ["He was born in Dublin but brought up in Edinburgh. He studied at Christ Church, Oxford and at the Royal Academy of Music under Christopher Brown, where he was the recipient of several prizes and awards. His music has been performed and commissioned internationally as well as at major venues across the UK, including the Royal Festival Hall and the Huddersfield and Spitalfields Festivals. Performers have included the BBC Scottish Symphony Orchestra, the BBC Singers, members of the Philharmonia Orchestra, and conductors Garry Walker, Nicholas Cleobury, Stephen Layton and Martyn Brabbins."]}, {"page": "Miss Julie (Alwyn opera)", "response": ["|Conductor || || Vilém Tauský || Frans Rasmussen || Nicholas Cleobury"]}, {"page": "Elegy (Julian Lloyd Webber album)", "response": ["*Nicholas Cleobury"]}, {"page": "Andrew Zolinsky", "response": ["Zolinsky won the first prize in the San Francisco International Piano Concerto Competition. Performances have included a concert with the Royal Philharmonic Orchestra, London Concert Orchestra, Sinfonia 21 and the New London Orchestra. He has worked with conductors including Diego Masson, Martyn Brabbins, Nicholas Cleobury, Ronald Corp and Simon Joly. Zolinsky's music has been broadcast on BBC Radio 3, and he has also given solo recitals on Classic FM, German Radio, Czech Radio and two recitals of contemporary Irish music for BBC Radio Ulster."]}, {"page": "Paul Mealor", "response": ["* Elegy for a Play of Shadows (2001). Version 1 (cor anglais and harp) first performed by Eamonn O'Dwyer at Sir Jack Lyons Hall, York. Version 2 (cor anglais and five instruments) first performed by the Britten Sinfonia conducted by Nicholas Cleobury in Canterbury, November 2001."]}, {"page": "Cantabile (group)", "response": ["On May 9, 2010 they celebrated - together with Simon Callow - the life and music of their friend Stephen Oliver, who would have been 60 that year. This specially devised programme included excerpts from the RSC's production of Nicholas Nickleby (for which Oliver composed the original music) performed by Simon Callow, the London Mozart Players conducted by Nicholas Cleobury, and Cantabile.", "The evening also featured songs from the Rice-Oliver musical Blondel, settings of Shakespearian lyrics, and Stephen's mini-opera 'A Man of Feeling' and culminated in the entire audience and the Festival Choir, led by Simon Callow and Nicholas Cleobury, singing the rousing Patriotic Song from Nicholas Nickleby."]}, {"page": "Britten Sinfonia", "response": ["Britten Sinfonia is a chamber orchestra ensemble based in Cambridge, UK. It was created in 1992, following an initiative from Eastern Arts and a number of key figures including Nicholas Cleobury, who recognised the need for an  orchestra in the East of England. It is a flexible ensemble composed of chamber musicians in Europe. The players are freelance musicians who are employed on a project-by-project basis and the ensemble performs around 70 concerts per year and works with hundreds of people in the communities where the orchestra is resident."]}, {"page": "City Chamber Orchestra of Hong Kong", "response": ["CCOHK was founded in 1999 by oboist Leanne Nicholls, who is also the artistic director. It is known for having a very large repertoire spanning many different styles.Magazine article in the BC Magazine  French conductor Jean Thorel served as chief conductor from 2008 to 2016. Previous and current guest conductors include Anthony Inglis, Philip Walsh, Nicholas Routley, Peter Leech, Richard Honner, Richard Harvey, Lorenzo Colitto (guest concertmaster), Vahan Mardirossian, Colin Touchin, Nicholas Cleobury and Jonathan Berman. City Chamber Orchestra of Hong Kong is in high demand with performing engagements for Hong Kong Ballet, Le French May Arts Festival, RTHK Radio 4, the World Harp Congress, the Hong Kong Contemporary Music Festival and the Hong Kong International Piano Competition. Since 1999 the orchestra has performed with many world-class artists including Sir James Galway, Dame Evelyn Glennie, Dame Emma Kirkby, Sir Thomas Allen, Christian Lindberg, Sarah Chang, Mario Brunello, Julian Lloyd Webber, Edgar Meyer, Branford Marsalis, Richard Galliano, Sir Neville Marriner, The King’s Singers, The Swingles and Kirill Troussov. In addition to hosting masterclasses, workshops and soirées for kids, CCOHK has conceived, scripted and produced its own highly successful orchestral-theatre programmes aimed at engaging and educating children in Hong Kong. These include Magnificent Mozart, The Star Bach and Bug Symphony which won the Public Choice Award at the YAMawards in Portugal 2017."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Nicholas Cleobury (1985)"]}, {"page": "Encore! (Travels with My Cello – Volume 2)", "response": ["Royal Philharmonic Orchestra/Nicholas Cleobury"]}, {"page": "List of operas performed at the Wexford Festival", "response": ["|1981 || Zaide ||  Mozart || German || 1780Abandoned by Mozart; date is that of composition.  ||  Nicholas Cleobury ||  Timothy Tyrrel ||  Dermot Hayes ||  Neil Mackie,Lesley Garrett, Ulrik Cold"]}, {"page": "Opera North: history and repertoire, seasons 1981–82 to 1989–90", "response": ["Nicholas Payne, formerly of Welsh National Opera, replaced Graham Marchant as General Administrator in 1982, and David Lloyd-Jones's title changed from Music Director to Artistic Director.  Guest conductors included Stephen Barlow, Nicholas Cleobury, Wyn Davies, Alan Hacker, Richard Hickox, Graeme Jenkins, Diego Masson, Ali Rahbari, Carlo Rizzi, Yan Pascal Tortelier.", "|1983–84 || A Village Romeoand Juliet ||  Delius ||  Peter Jeffes (Sali), Anne Williams-King (Vrenchen), David Wilson-Johnson (The Dark Fiddler) ||  Nicholas Cleobury ||  Robert Carsen ||  Russell Craig/John Fraser"]}, {"page": "Cape Town Philharmonia Choir", "response": ["The Philharmonia Choir has been conducted by many well-known international conductors, including Dr Donald Hunt, Nicholas Cleobury, and Sarah Tenant-Flowers, whose Harlow Chorus sang with the Philharmonia in the Easter performances of Messiah  in 2005. The Norwegian conductor Kåre Hanken has also conducted the choir on several occasions. In 2009, the choir performed with the KwaZulu Natal Philharmonic Orchestra, under the baton of the American conductor William Eddins at the Cape Town City Hall accompanied by the American soprano Renée Fleming.  In October 2010 the Philharmonia Choir, singing together with the Symphony Choir of Cape Town, performed Verdi’s Messa da Requiem, conducted by Victor Yampolsky, and in November 2011 the choir collaborated with the New Apostolic Church Choir in a performance of Brahms’ Ein deutsches Requiem, under the baton of Martin Panteleev. In 2012 the Choir performed Haydn’s The Creation in the original German."]}, {"page": "List of people from the London Borough of Bromley", "response": ["* Nicholas Cleobury (born 1950), conductor"]}, {"page": "Kenneth Leighton", "response": ["Unlike most of his Oxford contemporaries, Leighton came from a working-class area of an industrial northern town; so his early rise to prominence is all the more remarkable.For Finzi's visit to the Wakefield home, see McVeagh 2005, 215. And: https://www.geograph.org.uk/photo/2438315 Although he spent much of his adult life in Scotland, he always regarded himself as a down-to-earth Yorkshireman. He eschewed the possibility of a career as a pianist, hoping that a University position would allow him greater creative freedom and time to compose, although he periodically gave recitals and broadcasts, and occasionally conducted the University orchestra. After the spell in Italy, his life was dominated by composing, which continued uninterrupted, notwithstanding an unsettled period in the late 1970s and early 1980s associated with divorce and remarriage. Leighton was a rather private man, averse to self-promotion and slightly shy of social occasions, who treasured peace and quiet, although he enjoyed family life and teaching (notably harmony and counterpoint). For most of his career he managed to reconcile university commitments with composing, but found this increasingly difficult in later years and was intending to retire early to have more time for composition. Indeed, Leighton never felt entirely at home or at ease with the title of 'university professor' and became disenchanted with the burden of administrative duties at Edinburgh. At Leeds he formed friendships with the poet Geoffrey Hill and the painters Terry Frost and Maurice de Sausmarez. A lasting friendship with the Wallfisch family (musicians Peter, Raphael and Anita Lasker-Wallfisch) also dates from this period. Amongst his distinguished students at Oxford and Edinburgh were Donald Runnicles, Nicholas Cleobury, and the composer Nigel Osborne, who succeeded him as Reid professor at Edinburgh. James MacMillan also studied at Edinburgh during Leighton's tenureR.Dunnett \"Learning with Leighton\", The Full Score (Novello) Winter 1998, 103; P. Spicer, 2011, Invocation. Choral Music by Kenneth Leighton and James MacMillan, REG CD348, p.3. and described him as \"a marvellous teacher\". While Leighton wrote a good deal of church music, and has occasionally been categorised too reductively as a church-music composer, he was not a church-goer or member of any congregation, nor even conventionally religious. His interests in literature and love of nature and countryside are reflected in the settings of English poetry in many works, such as Symphonies 2 and 3 (Opp.69 & 90) and Earth, Sweet Earth (Op.94).Earth, Sweet Earth, \"monumental in concept and execution\" (ABACUS CD 109-2; Linn CKD329), using poems of Gerard Manley Hopkins; Symphony 3 (CHAN8741) has a setting of 'A Musical Instrument' by Elizabeth Barrett Browning; \"Animal Heaven\" (Op.83) has settings by the Americans, Walt Whitman and James Dickey (MetierCD MSV92036). Fond of walking his dog on the hills, Leighton loved the Scottish highlands and frequently visited the western islands (in the 1960s often in an old camper van). Trips to Mull and Iona in the early 1970s foreshadow the opera Columba (Op.77, 1978). He also had friends on the island of Arran, which he visited regularly. He died at home in Edinburgh in 1988, six months after being diagnosed with oesophageal cancer. His grave is in the Glen Sannox cemetery on Arran."]}, {"page": "Schola Cantorum of Oxford", "response": ["The choir was founded in 1960 by the British-Hungarian conductor László Heltay as the Collegium Musicum Oxoniense before adopting the name Schola Cantorum of Oxford in 1964. The choir has been conducted by a long line of eminent conductors including Andrew Parrott, Nicholas Cleobury, Ivor Bolton, Jeremy Summerly and James Burton."]}, {"page": "Harry Bramma", "response": ["Bramma initially started a career in teaching, and held the post of Director of Music at the King Edward VI School, Retford 1961-63. In 1963 he took the job as assistant organist at Worcester Cathedral, under Christopher Robinson, also becoming Director of Music at the King's School, Worcester in 1965. Bramma's students at the King's School included a number of noted musicians, among them Nicholas Cleobury, Stephen Cleobury, Andrew Millington, Jonathan Nott, Adrian Partington and Geoffrey Webber."]}, {"page": "List of musicians at English cathedrals", "response": ["Notable organists at Chichester Cathedral have included composer Thomas Weelkes and conductors John Birch and Nicholas Cleobury.", "First among the notable organists of Christ Church, Oxford is the Renaissance composer John Taverner. Other significant composers and conductors are Basil Harwood, Sir William Henry Harris, Sir Thomas Armstrong, Sydney Watson, Francis Grier, Simon Preston and Nicholas Cleobury.", "*1972 Nicholas Cleobury"]}, {"page": "1950 in British music", "response": ["*23 June – Nicholas Cleobury, conductor"]}, {"page": "Rory Boyle", "response": ["He then went on to win a Caird Scholarship to study privately with Lennox Berkeley in London. As the conductor Nicholas Cleobury wrote in the 1998 Proms programme, “Boyle chose his teachers well: Spedding encouraged his individual voice; Berkeley reduced wastage and honed his orchestration”."]}, {"page": "List of music students by teacher: A to B", "response": ["*Nicholas Cleobury"]}]}}