{"wiki_id": "http://www.wikidata.org/entity/Q7027302", "itemLabel": "Nick Higgs", "itemDescription": "British football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Higgs", "wikipedia_page": {"main": "Nicholas Higgs is a former businessman and previous chairman of Bristol Rovers Football Club, and a former Chief Executive of Cowlin Construction, a company now owned by Balfour Beatty.\nHiggs stepped down as Chief Executive of Cowlin following its sale for £52 million in cash to Balfour Beatty in August 2007, at which point he was vice-chairman of Bristol Rovers. He became chairman of the football club twelve months later, in August 2008, when he replaced Ron Craig.On 19 February 2016, during a press conference to announce the takeover of Bristol Rovers by the Jordanian Al-Qadi family, Higgs announced that he would be stepping down as Chairman of the club with immediate effect with his majority shareholding included in the sale. Former Swansea Chairman Steve Hamer was appointed in his place.\n\n", "link_mentions": [{"page": "2008–09 Bristol Rovers F.C. season", "response": ["*5 August: Club chairman Ron Craig stepped down from his position, and was succeeded by Nick Higgs. Craig retained a position on the board of the football club."]}, {"page": "Ron Craig", "response": ["Craig first joined the board of the football club in 1986, when Denis Dunford became chairman, and later became vice-chairman when Dunford's son Geoff Dunford succeeded him. When Dunford Jr. stepped down in April 2007 Craig took over as chairman until Nick Higgs took the position in 2008, and after this he remained on the board of directors until his death late in 2009."]}, {"page": "2010–11 Football League One", "response": ["|  Nick Higgs"]}, {"page": "2011–12 Football League Two", "response": ["| Nick Higgs"]}, {"page": "UWE Stadium", "response": ["The following month, Bristol Rovers were sold to the Jordanian Al-Qadi family with outgoing chairman Nick Higgs confirming the outcome of the court case is \"no longer relevant\". The club's new president Wael al-Qadi confirmed a new stadium is a \"key requirement\" for the new owners.", "On 9 June 2011, Bristol Rovers chairman Nick Higgs announced plans to build a 21,700 all-seater stadium in Cheswick in partnership with UWE. The application to build the stadium was submitted to South Gloucestershire Council on 9 March 2012.", "Doubts were raised about the stadium again in August 2014 after it emerged that Rovers had issued a writ against Sainsbury's, alleging that the supermarket chain was attempting to terminate its contract to buy the Memorial Stadium site. At a six-day High Court hearing in May 2015, Sainsbury's argued it had \"lawfully terminated\" the contract when planning conditions were not met before the \"cut-off date\" in the agreement. On 13 July 2015, Mrs Justice Proudman ruled in favour of Sainsbury's saying the way the deal was structured was an \"insuperable barrier to the club\". Rovers chairman Nick Higgs described it as a \"huge disappointment\" and stated \"We will be asking them [UWE] to hang in there with us as it’s not over yet. We have looked at a number of other options to still bring this new stadium to fruition, even without the help of Sainsbury’s, and we will continue to do that. We have an obligation to explore options and it would be remiss of us not to do so for the sake of the fans, and for this club\". The club were granted leave to appeal later the same month and confirmed Sainsbury's had made an out of court cash offer to end the litigation, which was rejected being described as 'derisory'. The appeal, held in January 2016, saw the club's lawyers claim Mrs Justice Proudman made a \"fundamental error\" in agreeing with the supermarket chain. The verdict from the two-day appeal came on 17 March 2016 and upheld the high court decision.", "A further twist to the tale came in February 2016 when Bristol Rovers were purchased by the wealthy Al-Qadi family of Jordan, rending the outcome of the court case \"no longer relevant\" as described by former chairman Nick Higgs."]}, {"page": "2012–13 Football League Two", "response": ["|Nick Higgs"]}, {"page": "2013–14 Football League Two", "response": ["|  Nick Higgs"]}, {"page": "2015–16 Bristol Rovers F.C. season", "response": ["*  – Rovers were acquired by the Jordanian Al-Qadi family, founders of the Arab Jordan Investment Bank, taking a 92% shareholding in the club. As part of the deal, Wael al-Qadi became President of the club while former Swansea City chairman Steve Hamer took up the same role with Rovers. Existing chairman Nick Higgs along with board members Barry Bradshaw, Chris Jelf, Colin Sexstone and Ed Ware all stood down from the board of directors with all expect Sexstone becoming Life Vice Presidents."]}]}}