{"wiki_id": "http://www.wikidata.org/entity/Q7026788", "itemLabel": "Nick Blood", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Blood", "wikipedia_page": {"main": "Nick Blood (born 20 March 1982) is an English actor. He is known for his roles as Kieran in Trollied and Lance Hunter in Marvel's  Agents of S.H.I.E.L.D.", "link_mentions": [{"page": "The Singularity (Agents of S.H.I.E.L.D.)", "response": ["In April 2016, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, Adrianne Palicki, Henry Simmons, and Luke Mitchell would star as Phil Coulson, Melinda May, Grant Ward, Daisy Johnson, Leo Fitz, Jemma Simmons, Lance Hunter, Bobbi Morse, Alphonso \"Mack\" MacKenzie, and Lincoln Campbell, respectively. It was also revealed that the guest cast for the episode would include Axle Whitehead as James, John Hannah as Holden Radcliffe, Alicia Vela-Bailey as Alisha, Adrian Pasdar as Brigadier General Glenn Talbot, Alexander Wraith as Agent Anderson, Camille De Pazzis as Anon and Rudy Dobrev as bartender. Vela-Bailey, Wraith, and Dobrev did not receive guest star credit in the episode. Whitehead, Vela-Bailey, Pasdar, and Wraith reprise their roles from earlier in the series. Blood and Palicki do not ultimately appear."]}, {"page": "1982 in American television", "response": ["|Nick Blood"]}, {"page": "1982 in film", "response": ["** Nick Blood, English actor"]}, {"page": "Aylesbury", "response": ["*Nick Blood Actor"]}, {"page": "Nick", "response": ["*Nick Blood (born 1982), English actor"]}, {"page": "Laws of Nature (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, Adrianne Palicki, Henry Simmons, and Luke Mitchell. A third season was ordered in May 2015, with new recurring characters portrayed by Constance Zimmer, Matthew Willig, Andrew Howard, and Juan Pablo Raba introduced, the last of these as the first openly gay character in the MCU. William Sadler also guest stars, reprising his role of President Ellis from Iron Man 3, as the episode references previous MCU films, and provides set-up for future MCU films.", "In May 2015, all principal cast members from the first and second seasons (Clark Gregg as Phil Coulson, Ming-Na Wen as Melinda May, Brett Dalton as Grant Ward, Chloe Bennet as Daisy Johnson [no longer going by her previous name of \"Skye\"], Iain De Caestecker as Leo Fitz, Elizabeth Henstridge as Jemma Simmons, Nick Blood as Lance Hunter, and Adrianne Palicki as Bobbi Morse) were confirmed to return for the third. They are joined by Luke Mitchell and Henry Simmons, who recurred as Lincoln Campbell and Alphonso \"Mack\" MacKenzie, respectively, throughout the second season, before being promoted to the principal cast for the third. In July 2015, Andrew Howard and Constance Zimmer were cast as Banks and Rosalind Price, and in August 2015, Matt Willig and Juan Pablo Raba were announced as new Inhumans Lash and Joey Gutierrez."]}, {"page": "Mockingbird (Marvel Comics)", "response": ["* A Mockingbird series was in development at ABC Family in 2011. After the successful introduction of the character in Agents of S.H.I.E.L.D., a spin-off titled Marvel's Most Wanted, starring Palicki as Morse and Nick Blood as Hunter, received a pilot order from ABC in August 2015.  On May 12, 2016 however, ABC announced it did not pick up Most Wanted for a series."]}, {"page": "London Film and Comic Con", "response": ["| 19-21 November 2021. Returns after a 2-year hiatus due to the Covid-19 Pandemic || Olympia || Christopher Eccleston, George Takei,  Robert Englund, Karen Allen, Mark Pellegrino, Ming-Na Wen, Brian Blessed, Julian Kostov, Julius LeFlore, Valene Kane, Beau Gadsdon, Dolly Gadsdon, Daniel Naprous, Mark Rolston, Jemma Redgrave, Jo Martin, Amanda Abbington, Sean Biggerstaff, Andrew Robinson, Rose Reynolds, Hannah Murray, Nick Frost, Ben Browder, Natalia Tena, Tom Skerrit, Riz Ahmed, Sacha Dhawan, Georgia Hirst, Kim Coates, Ray Hassett, Bernard Cribbins, Elizabeth Mitchell, Simon Palsey-Day, Jason O'Mara, Guy Henry, Simon McBurney, Ahsley Walters, Veronica Cartwright, John Wesley Shipp, Jessie T. Usher, Janet Fielding, Suzanne Bertish, Angus Wright, Milton Johns, Andrew Gower, Liam Garrigan, Anji Mohindra, Mark Boone Jr., Quentin Piere, Harry Manfredi, Lee Cornes, Clare Kramer, David Learner, Danielle Nicolet, Joe Gibson, Mat Fraser, Julian Holloway, Sam Humphrey, Mandeep Dhillon, Matthew Devitt, Emmy Raver-Lampman, Steven R. McQueen, Barry Bostwick, Ronn Millkie, Anna-Louise Plowman, Staz Nair, Marc Blucas, PJ Black, Cinta de Oro, Jack McKenzie, Syd Wragg, Richard Brake, Jim Dowdall, Robert Patrick, Emily Kinney, Nick Blood, Maryam d'Abo, Bonnie Langford, Lance Henriksen, Tommy Knight, Lee Stringer, Jonathan Watson, Bernard Hill, Jimmy Vee, Tommy Flanagan, Jenna Coleman, Marina Sirtis, Kristanna Loken, Tim Dry, Sean Crawford, Joey Cramer, Andy Secombe, Sam Spruell, Rochenda Sandall"]}, {"page": "Blood (surname)", "response": ["* Nick Blood (b. 1982), English actor, director and producer"]}, {"page": "Lance Hunter", "response": ["The character made his live-action debut in the Marvel Cinematic Universe television series Agents of S.H.I.E.L.D., portrayed by Nick Blood.", "Lance Hunter appears as a regular character in the second season of the Marvel Cinematic Universe TV series Agents of S.H.I.E.L.D., portrayed by Nick Blood. He debuted in the season two premiere \"Shadows\" as a decorated member of the SAS turned freelance mercenary working for Phil Coulson's reconstituted S.H.I.E.L.D. in a team under the leadership of his old acquaintance, Isabelle Hartley. In the following episode, \"Heavy is the Head\", Coulson formally recruits him as a S.H.I.E.L.D. agent. In the episode \"A Hen in the Wolf House\", Hunter's ex-wife Bobbi Morse joins the team, causing tension between the two before they eventually reconcile. In season three, Hunter and Morse are forced to leave S.H.I.E.L.D. after they are caught by Russian forces in Siberia and almost cause an international incident. He returns in the fifth season episode \"Rewind\" to get Leo Fitz out of military custody and help him reunite him with his team after they are sent to the future."]}, {"page": "Material Girl (TV series)", "response": ["*Nick Blood – Alex, Davina's fashion assistant, Ali's friend and gay flatmate"]}, {"page": "Stanley Park (TV series)", "response": ["| Harry Stevens || Nick Blood"]}, {"page": "Him & Her", "response": ["* Lee (Nick Blood; 5 episodes), Becky's ex-boyfriend"]}, {"page": "Marvel Television", "response": ["In early April 2015, two unspecified shows were said to be in development to air on ABC: one was a spin-off series of Agents of S.H.I.E.L.D. centered on Bobbi Morse (Adrianne Palicki) and Lance Hunter (Nick Blood), which was being developed by Bell and writer Paul Zbyszewski based on storylines occurring at the end of the second season, and would receive its own pilot rather than a backdoor pilot; and another with writer-producer John Ridley. On May 7, 2015, ABC renewed Agents of S.H.I.E.L.D. and Agent Carter for a third and second season, respectively. Additionally, ABC also passed on the Agents of S.H.I.E.L.D. spinoff, though ABC Entertainment president Paul Lee did not rule out returning to the spin-off in the future, and Lee also confirmed that Ridley was working on a Marvel property for ABC. Also in May, Iger indicated that Disney saw potential in creating a streaming service dedicated to Marvel content as a way to further \"take product... directly to consumer\"."]}, {"page": "Trollied", "response": ["* Kieran (portrayed by Nick Blood) — Kieran was deputy butcher as Valco, and has worked with Andy and the meat counter, which whom he finds annoying to work with but at the same time they have become the best of mates. He is attracted to Katie, and later they get together and both decide to leave Valco. (Series 1–3)"]}, {"page": "Public Enemies (TV series)", "response": ["* Nick Blood — Glen Smithfield "]}, {"page": "IdeasTap", "response": ["IdeasTap awards its funding, mentoring and support through creative briefs. Notable brief winners include HighTide Festival Theatre (Ideas Fund Edinburgh); RashDash (Ideas Fund Edinburgh); Sabrina Mahfouz (OVNV TS Eliot US/ UK Exchange) Folly for a Flyover (Innovators Fund); Pierfrancesco Celada (IdeasTap Photographic Award); Ella Hickson (OVNV 24 Hour Plays); Sarah Solemani (OVNV 24 Hour Plays); Nick Blood (Old Vic New Voices Theatre 503 Award). IdeasTap distributes its core funds through the Ideas Fund scheme, which is divided into five sections: Ideas Fund Innovators, Ideas Fund Shorts, Ideas Fund Green and the Top Up Fund."]}, {"page": "Agents of S.H.I.E.L.D.", "response": ["The series stars Clark Gregg as Phil Coulson, reprising his role from the film series, alongside Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, and Elizabeth Henstridge. Nick Blood, Adrianne Palicki, Henry Simmons, Luke Mitchell, John Hannah, Natalia Cordova-Buckley, and Jeff Ward joined in later seasons. The S.H.I.E.L.D. agents deal with various unusual cases and enemies, including Hydra, Inhumans, Life Model Decoys, alien species such as the Kree and Chronicoms, and time travel. Several episodes directly crossover with MCU films or other television series, notably Captain America: The Winter Soldier (2014) which significantly affected the series in its first season. In addition to Gregg, other actors from throughout the MCU also appear in guest roles.", "* Nick Blood as Lance Hunter:A mercenary before agreeing to join S.H.I.E.L.D. Blood described Hunter as someone who \"doesn't bow down to the etiquette of the S.H.I.E.L.D. hierarchy.\" He later elaborated that the character feels very independent, so would probably not want to admit no longer feeling like an outsider. Also, \"he doesn't have too much respect for authority and titles...If Coulson does something he respects, that's all good. If he doesn't, he's going to say something.\" On Hunter's on-again, off-again relationship with Bobbi Morse, Blood said, \"there is a lot of truth in it of those relationships you have where it's kind of, 'can't live with each other, can't kill each other'\".", "At San Diego Comic-Con 2014, Nick Blood was announced as cast in the role of Lance Hunter for the second season, while the character of Bobbi Morse was revealed to be appearing. That August, Henry Simmons joined the cast as Alphonso \"Mack\" Mackenzie, a recurring role, and Adrianne Palicki was cast as Morse in a guest role, to first appear in the episode \"A Hen in the Wolf House\". The next month, the entire first season principal cast were confirmed to be regulars for the second season, along with Blood. Palicki joined them with the episode \"Aftershocks\". In February 2015, Luke Mitchell was cast as Lincoln Campbell, a recurring role for the second half of the season."]}, {"page": "The Bletchley Circle", "response": ["* Nick Blood as Ben Gladstone (series 2), Lucy's colleague and love interest"]}, {"page": "List of Agents of S.H.I.E.L.D. characters", "response": ["The series stars Clark Gregg, reprising his role of Phil Coulson from the films, as well as Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, and Elizabeth Henstridge. Nick Blood and Adrianne Palicki joined the cast for the second and third seasons, while Henry Simmons and Luke Mitchell had recurring roles in the second season before being promoted to the main cast for the third. John Hannah, who recurred in the third season, joined the main cast in the fourth, while Natalia Cordova-Buckley, who recurred in both the third and fourth seasons, was promoted to the main cast for the series' fifth season. Jeff Ward was promoted to the main cast for the sixth season after recurring in the fifth. Additionally, several other characters from Marvel Cinematic Universe films and Marvel One-Shots also appear throughout the series, along with other characters based on various Marvel Comics properties. Several characters from the series also appear in the supplemental digital series Marvel's Agents of S.H.I.E.L.D.: Slingshot.", "| Nick Blood", "Lance Hunter (portrayed by Nick Blood), an SAS lieutenant turned mercenary, joins post-Hydra S.H.I.E.L.D. at the request of Coulson following a recommendation from his ex-wife Bobbi Morse. Despite a tumultuous relationship with Morse, Hunter becomes a full-time S.H.I.E.L.D. agent, and risks his life to save her when she is kidnapped. Following an incident in Russia involving the near-assassination of Prime Minister Olshenko, Hunter and Morse decide to disavow themselves from S.H.I.E.L.D. to protect Coulson and the team. Hunter continues doing mercenary work, with Fitz eventually reaching out for Hunter to free him from General Hale's base while posing as a lawyer. Hunter helps Fitz rescue Coulson and the team when they are transported to 2091 where their trail led them to Enoch.", "thumb|right|upright|Nick Blood"]}, {"page": "Babylon (TV series)", "response": ["* Nick Blood as PC Warwick Collister, SCO19 officer"]}, {"page": "Spike Island (film)", "response": ["* Nick Blood as Dave Famous"]}, {"page": "Agents of S.H.I.E.L.D. (season 2)", "response": ["Clark Gregg reprises his role as Coulson from the film series, starring alongside the returning series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, and Elizabeth Henstridge. They are joined by Nick Blood and Adrianne Palicki. A second season of Agents of S.H.I.E.L.D. was ordered in May 2014, and production began in Culver City, California that July. Some episodes directly crossover with the television series Agent Carter and the film Avengers: Age of Ultron (2015), while the Inhumans were introduced to set up the planned film of the same name and connect to the film Guardians of the Galaxy (2014). Glenn Hetrick designed prosthetics for the Inhuman characters. Several actors reprise their MCU roles in the season for guest appearances.", "* Nick Blood as Lance Hunter", "All principal cast members from the first season (Gregg as Phil Coulson, Ming-Na Wen as Melinda May, Brett Dalton as Grant Ward, Chloe Bennet as Skye, Iain De Caestecker as Leo Fitz, and Elizabeth Henstridge as Jemma Simmons) returned for the second season, and were joined by Nick Blood as Lance Hunter. In December 2014, main character Skye was revealed to be a version of Daisy Johnson. With the episode \"Aftershocks\", Adrianne Palicki, who portrays Bobbi Morse, was upgraded to a principal cast member. Also returning from earlier in the series are Christine Adams as Anne Weaver, Jaimie Alexander as Sif, B. J. Britt as Antoine Triplett, Imelda Corcoran as Goodman, Dylan Minnette as Donnie Gill, Ruth Negga as Raina, Patton Oswalt as Sam and Billy Koenig, Adrian Pasdar as Glenn Talbot, J. August Richards as Mike Peterson / Deathlok, and Cobie Smulders as Maria Hill."]}, {"page": "Heavy Is the Head (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood.", "In September 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include Kyle MacLachlan, B. J. Britt, Ruth Negga, Henry Simmons, Adrian Pasdar, Simon Kassianides, Brian Patrick Wade, Wilmer Calderon, Carolina Espiro, Cutter Garcia, and Danny Pierce. MacLachlan, Espiro, Garcia, and Pierce were introduced in the episode as \"The Doctor\", waitress, bartender, and soldier, respectively. They all received co-starring credit in the episode, except MacLachlan. Britt, Simmons, Pasdar, Negga, Kassianides, reprise their roles from previous episodes as S.H.I.E.L.D. Agents Antoine Triplett and Alphonso \"Mack\" MacKenzie, General Glenn Talbot, Raina, and Hydra member Sunil Bakshi, respectively. Main cast member Brett Dalton, who portrays Grant Ward in the series, does not appear and is not credited in this episode."]}, {"page": "Shadows (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. The series was renewed for a second season in May 2014, and production began that July. That month, guest star Lucy Lawless's role was revealed, building hype for her appearance, although her character was always intended to be killed off at the end of the episode. Other guest stars include Hayley Atwell, Neal McDonough, and Kenneth Choi, reprising their roles from previous MCU projects in a sequence that ties-in with another MCU television series, Agent Carter. Series composer Bear McCreary used Christopher Lennertz's Agent Carter theme when writing the music for this sequence.", "At the 2014 San Diego Comic-Con International, Nick Blood and Reed Diamond were announced as cast in the roles of Lance Hunter, a mercenary, and Daniel Whitehall, a member of Hydra, respectively. In September 2014, Marvel confirmed that all principal cast members from the first season (Clark Gregg as Phil Coulson, Ming-Na Wen as Melinda May, Brett Dalton as Grant Ward, Chloe Bennet as Skye, Iain De Caestecker as Leo Fitz, and Elizabeth Henstridge as Jemma Simmons) would return, that Blood would join them for the second season. They also confirmed that Diamond and Lawless would guest star in \"Shadows\", along with B. J. Britt as Antoine Triplett, Adrian Pasdar as Glenn Talbot, Henry Simmons as Alphonso \"Mack\" Mackenzie, Patton Oswalt as Billy Koenig, Wilmer Calderon as Idaho, Brian Patrick Wade as Carl Creel, Matthew Glave as Roger Browning, and Simon Kassianides as Sunil Bakshi. Britt, Oswalt, and Pasdar reprise their roles from the first season. George Stephanopolous makes a cameo appearance as himself."]}, {"page": "Making Friends and Influencing People", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. The idea of brainwashing plays a significant part in the episode, and is brought over from the films.", "In September 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" MacKenzie, Reed Diamond as Daniel Whitehall, Dylan Minnette as Donnie Gill, Simon Kassianides as Sunil Bakshi, Adam Kulbersh as Kenneth Turgeon, Maya Stojan as Agent 33, David Diaan as Elias, Jarrod Crawford as Lead Hydra Agent, Nicholas Roth as Second Hydra Agent, Mo Darwiche as Ship's Captain, and Jesse D. Goins as Theo. However, Diaan, Crawford, Roth, Darwiche, and Goins did not receive guest star credit in the episode. Though he was not officially announced by Marvel, B. J. Britt also guest stars as Antoine Triplett. Simmons, Diamond, Minette, Kassianides, and Britt all reprise their roles from earlier in the series."]}, {"page": "Face My Enemy", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Guest star Maya Stojan reprises her role as Agent 33, before being replaced by Wen when the character takes on the appearance of the latter's character Melinda May. This leads to the climactic fight between both of Wen's characters, realized through choreographed stunt work and CGI; the crew worked harder to meet the standards of Tancharoen following his acclaimed action work on Mortal Kombat: Legacy, including the stunt team, who had worked on that series, and the costume and set designers, who looked to accommodate the fight.", "In September 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as \"Mack\", Adrian Pasdar as Talbot, Simon Kassianides as Bakshi, Maya Stojan as Agent 33, Diego Serrano as Gabriel Soto, Lance Irwin as Guard, Isaac Montgomery as Guard #2, Alyce Tawil as Woman, Roberto Medina as Bishop, and Christian Barillas as Priest. However, Irwin, Montgomery, and Tawil did not receive guest star credit in the episode. Though they were not officially announced by Marvel, B. J. Britt, Ruth Negga, and Reed Diamond also guest star as Antoine Triplett, Raina, and Daniel Whitehall, respectively. Simmons, Pasdar, Kassianides, Stojan, Britt, Negga, and Diamond all reprise their roles from earlier in the series. Dalton does not ultimately appear in the episode. Ming-Na Wen replaces Stojan in portraying Agent 33 when the character takes on the appearance of Melinda May."]}, {"page": "A Hen in the Wolf House", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Recurring guest star Adrianne Palicki is introduced as Bobbi Morse.", "In October 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt as Antoine Triplett, Adrianne Palicki as Bobbi Morse, Henry Simmons as Alphonso \"Mack\" Mackenzie, Ruth Negga as Raina, Reed Diamond as Daniel Whitehall, Kyle MacLachlan as \"The Doctor\", Simon Kassianides as Sunil Bakshi, Adam Kulbersh as Kenneth Turgeon, Dale Waddington as Dr. Lingenfelter, Chase Kim as waiter, Caleb Smith as bartender, Amir Talai as Schneider, Valorie Hubbard as Aunt Cindy, Jessen Noviello as lead tac agent, Adam Dunnells as Brick, Ronnie Blevins as Deacon, Charles Fathy as head chef, and James Hutchison as tac agent guard. However, Waddington, Kim, Smith, Noviello, Dunnells, Blevins, Fathy, and Hutchison did not receive guest star credit in the episode. Britt, Simmons, Negga, Diamond, MacLachlan, Kassianides, and Kulbersh all reprise their roles from earlier in the series."]}, {"page": "A Fractured House", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Tim DeKay guest stars as Senator Christian Ward, who previously appeared in the first season in flashbacks only. Brian Van Holt is also introduced in this episode, setting up a much more prominent role in the next episode.", "In October 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt, Adrianne Palicki, Henry Simmons, Adrian Pasdar, Tim DeKay, Falk Hentschel, Joe Marinelli, Liberte Chan, Parisa Fakhri, Michael Enright, Melanie Cruz, Brian Tee, Darrel Cherney, Brian Van Holt, and Chris Wolfe. Marinelli, Chan, Fakhri, Enright, Cruz, Cherney, and Wolfe are introduced in the episode as Adamo Dioli, international reporter, Senator’s aide, Julien Beckers, Agent Noelle Walters, tattoo artist, and news reporter, respectively. They all received co-starring credit in the episode."]}, {"page": "The Writing on the Wall (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Brian Van Holt guest stars as a former S.H.I.E.L.D. agent resurrected by the same program that Coulson was.", "In October 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt as Antoine Triplett, Adrianne Palicki as Bobbi Morse, Henry Simmons as Alphonso \"Mack\" MacKenzie, Imelda Corcoran as Dr. Goodman, Simon Kassianides as Sunil Bakshi, Joel Gretsch as Hank Thompson, Monica Lacy as Katie Thompson, Monique Gabriela Curnen as Janice Robbins / Agent Stevens, Bruno Amato as Bartender, Carlos Campos as Patient #2 and, Michael Hanson Seaver as Patient #4, Natalie Smyka as Patient #5, Richie Cottrell as Eliza's son, Madison Lee as Lab Assistant, and Brian Van Holt as Sebastian Derik. However, Corcoran, Lacy, Amato, Campos, Seaver, Smyka, Cottrell, and Lee did not receive guest star credit in the episode. Britt, Palicki, Simmons, Corcoran, Kassianides, and Van Holt all reprise their roles from earlier in the series."]}, {"page": "The Things We Bury", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Hayley Atwell reprises her role from other MCU projects in flashbacks with connections to the television series Agent Carter and the films Captain America: The First Avenger and Captain America: The Winter Soldier.", "In October 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt as Antoine Triplett, Adrianne Palicki as Bobbi Morse, Henry Simmons as Alphonso \"Mack\" Mackenzie, Reed Diamond as Daniel Whitehall / Werner Reinhardt, Tim DeKay as Senator Christian Ward, Kyle MacLachlan as \"The Doctor\", Hayley Atwell as Peggy Carter, Simon Kassianides as Sunil Bakshi, Lou Ferrigno Jr. as Agent Hauer, Al Coronel as Agent Rivera, Dichen Lachman as young woman, Eijiro Ozaki as prisoner, Alexander Leeb as scientist, and Willem Van Der Vegt as officer. However, Ferrigno, Coronel, Ozaki, Leeb, and Van Der Vegt did not receive guest star credit in the episode. Britt, Palicki, Simmons, Diamond, DeKay, MacLachlan, Atwell, and Kassianides all reprise their roles from earlier in the series."]}, {"page": "What They Become", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. The episode introduces the Inhumans to the MCU, and reveals that principal character Skye (Bennet) is actually comics character Daisy Johnson, while guest character \"The Doctor\" (Kyle MacLachlan) is Calvin Zabo.", "In November 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt as Antoine Triplett, Adrianne Palicki as Bobbi Morse, Henry Simmons as Alphonso \"Mack\" Mackenzie, Ruth Negga as Raina, Patton Oswalt as Billy and Sam Koenig, Reed Diamond as Daniel Whitehall, Kyle MacLachlan as The Doctor, Jamie Harris as man, and Hunter Seagroves as Hydra agent. Seagroves did not receive guest star credit in the episode. Britt, Palicki, Simmons, Negga, Oswalt, Diamond, and MacLachlan all reprise their roles from earlier in the series. Ming-Na Wen also portrays Agent 33. The episode reveals that MacLachlan's character, previously referred to only as \"The Doctor\", is actually Calvin Zabo, while principal character Skye is his daughter, Daisy Johnson."]}, {"page": "...Ye Who Enter Here", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by principal cast members Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood. Recurring guest star Ruth Negga reprises the role of Raina.", "In November 2014, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively. It was also revealed that the guest cast for the episode would include B. J. Britt as Antoine Triplett, Adrianne Palicki as Bobbi Morse, Henry Simmons as Alphonso \"Mack\" Mackenzie, Ruth Negga as Raina, Patton Oswalt as Billy and Sam Koenig, Reed Diamond as Daniel Whitehall, Jeffrey Corbett as Chad, and Brittnee Garza as Cashier. However, Corbett and Garza did not receive guest star credit in the episode. Britt, Palicki, Simmons, Negga, Oswalt, and Diamond all reprise their roles from earlier in the series. Ming-Na Wen also portrays Agent 33."]}, {"page": "Brand New-U", "response": ["*Nick Blood as Johan"]}, {"page": "Aftershocks (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki. Palicki was promoted to series regular with this episode, after having a recurring guest role in the first half of the season. The episode also saw the return of Marvel's \"The Art of...\" marketing initiative.", "In February 2015, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Nick Blood would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, and Lance Hunter, respectively, while Adrianne Palicki, previously a recurring guest star in the role of Bobbi Morse, was promoted to a series regular with the episode. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" MacKenzie, Ruth Negga as Raina, Adrian Pasdar as Brigadier General Glenn Talbot, Henry Goodman as Dr. List, Kyle MacLachlan as Calvin Zabo, Jamie Harris as Gordon, Simon Kassianides as Sunil Bakshi, Donzaleigh Abernathy as Trip's mom, Philip Labes as young Gordon, Dichen Lachman as Jiaying, Alvin Ing as Yat-Sen, Fred Dryer as Octavian Bloom, Kathryn Leigh Scott as The Baroness, Joel Polis as The Banker, Kyle David Pierce as accountant, Maz Siam as The Sheikh, McKay Stewart as scientist #1 and David A. Jansen as agent. Abernathy, Labes, Ing, Scott, Polis, Pierce, Siam, Stewart, and Jansen did not receive guest star credit in the episode. Simmons, Negga, Pasdar, MacLachlan, Harris, Kassianides, and Lachman all reprise their roles from earlier in the series. Goodman reprises his role from an uncredited cameo appearance in the mid-credits scene of Captain America: The Winter Soldier. Main cast member Brett Dalton, who portrays Grant Ward in the series, does not appear in the episode."]}, {"page": "One of Us (Agents of S.H.I.E.L.D.)", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki. Recurring guest star Kyle MacLachlan portrays Cal.", "In February 2015, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, Lance Hunter, and Bobbi Morse, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" MacKenzie, Kyle MacLachlan as Calvin Zabo, Jamie Harris as Gordon, Blair Underwood as Dr. Andrew Garner, Drea De Matteo as Karla Faye Gideon, Ric Sarabia as Wendell Levi, Geo Corvera as Francis Noche, Jeff Daniel Phillips as David A. Angar, Gregg Martin as student, Jack Kennedy as security guard and Jamal Duff as John Bruno. Sarabia, Corvera, Phillips, Martin, Kennedy, and Duff did not receive guest star credit in the episode. Simmons, MacLachlan, and Harris reprise their roles from earlier in the series. Main cast member Brett Dalton, who portrays Grant Ward in the series, does not appear in the episode."]}, {"page": "Love in the Time of Hydra", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki. Maya Stojan guest stars Agent 33, while recurring guest star Edward James Olmos is introduced.", "In March 2015, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki would star as Phil Coulson, Melinda May, Grant Ward, Skye, Leo Fitz, Jemma Simmons, Lance Hunter, and Bobbi Morse, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" MacKenzie, Adrian Pasdar as Brigadier General Glenn Talbot, Edward James Olmos as Robert Gonzales, Christine Adams as Agent Weaver, Kirk Acevedo as Agent Calderon, Mark Allan Stewart as Agent Oliver, Simon Kassianides as Sunil Bakshi, Raquel Gardner as Carla Talbot, Maya Stojan as Agent 33, Landall Goolsby as Selwyn, Gigi Bermingham as Rhonda, Scott Speiser as station guard, Parisa Fakhri as Lieutenant Decker, Anna Campbell as female major, Shannon McClung as short officer, Meredith Bishop as Officer Anderson and Kieren van den Blink as female Lieutenant. Stewart, Gardner, Goolsby, Bermingham, Speiser, Fakhri, Campbell, McClung, Bishop, and Van Den Blink did not receive guest star credit in the episode. Simmons, Pasdar, Adams, Kassianides, and Stojan reprise their roles from earlier in the series."]}, {"page": "One Door Closes", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki. Lucy Lawless, whose character was killed in the season premiere, returns in flashbacks during the episode.", "In March 2015, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, Lance Hunter, and Bobbi Morse, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" MacKenzie, Lucy Lawless as Isabelle Hartley, Edward James Olmos as Robert Gonzales, Jamie Harris as Gordon, Christine Adams as Agent Weaver, Kirk Acevedo as Agent Calderon, Cornelius Smith Jr. as Case, Sai Rao as Susanna, Mackenzie Astin as Tim Maguire and Rick Otto as lead Hydra agent. Smith and Rao did not receive guest star credit in the episode. Simmons, Lawless, Olmos, Harris, Adams, and Acevedo reprise their roles from earlier in the series. Main cast member Brett Dalton, who portrays Grant Ward in the series, does not appear in the episode."]}, {"page": "Who You Really Are", "response": ["Clark Gregg reprises his role as Coulson from the film series, and is joined by series regulars Ming-Na Wen, Brett Dalton, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki. Special guest star Jaimie Alexander portrays Sif, also reprising her role from the film series.", "In February 2015, Marvel revealed that main cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, Nick Blood, and Adrianne Palicki would star as Phil Coulson, Melinda May, Skye, Leo Fitz, Jemma Simmons, Lance Hunter, and Bobbi Morse, respectively. It was also revealed that the guest cast for the episode would include Henry Simmons as Alphonso \"Mack\" Mackenzie, Jaimie Alexander as Sif, Eddie McClintock as Vin-Tak, Alexandra Manea as nurse, Lidia Porto as head nurse, Danny Lopes as Bruno, Ben Griesse as Tiago, Ruben Rabasa as Mr. Cardozo and Markell Andrew as officer Carvalho. Manea, Porto, Lopes, Griesse, Rabasa, and Andrew did not receive guest star credit in the episode. Simmons and Alexander reprise their roles from earlier in the series. Main cast member Brett Dalton, who portrays Grant Ward in the series, does not appear in the episode."]}]}}