{"wiki_id": "http://www.wikidata.org/entity/Q7028656", "itemLabel": "Nicky Moore", "itemDescription": "English heavy metal singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Moore", "wikipedia_page": {"main": "Nicky Moore (born 1947, England) is an English blues, rock and heavy metal singer, who is best known as a former member of the British band Samson. He replaced Bruce Dickinson who left the band to join Iron Maiden in 1982. Moore left Samson in the late 1980s and rejoined in the late 1990s.\nAfter his initial departure from Samson, Moore sang in the band Mammoth, which also featured former Gillan bassist John McCoy. Mammoth released two albums before splitting up in 1989.In 2006, Moore teamed up with former Nazareth guitarist Manny Charlton and three musicians from the Swedish band Locomotive Breath to record an album under the band name \"From Behind\". The band performed at the Sweden Rock Festival on 9 June 2006.\nSince 1994, Moore has been working with his own band, Nicky Moore and the Blues Corporation, who were voted 'Top Live Blues Band' by BBC Radio 2 listeners in the year 2000.", "link_mentions": [{"page": "Black Sabbath", "response": ["The remaining original members, Iommi and Butler, began auditioning singers for the band's next release. Deep Purple and Whitesnake's David Coverdale, Samson's Nicky Moore and Lone Star's John Sloman were all considered and Iommi states in his autobiography that Michael Bolton auditioned. The band settled on former Deep Purple vocalist Ian Gillan to replace Dio in December 1982. The project was initially not to be called Black Sabbath, but pressure from the record label forced the group to retain the name. The band entered The Manor Studios in Shipton-on-Cherwell, Oxfordshire, in June 1983 with a returned and newly sober Bill Ward on drums. \"That was the very first album that I ever did clean and sober,\" Ward recalled. \"I only got drunk after I finished all my work on the album – which wasn't a very good idea... Sixty to seventy per cent of my energy was taken up on learning how to get through the day without taking a drink and learning how to do things without drinking, and thirty per cent of me was involved in the album.\" (Sabbath fanzine)"]}, {"page": "Maidstone", "response": ["*Nicky Moore (born 1947), rock and blues musician"]}, {"page": "Whiskey in the Jar", "response": ["Thin Lizzy's 1972 single (bonus track on Vagabonds of the Western World [1991 edition]) stayed at the top of the Irish charts for 17 weeks, and the British release stayed in the top 30 for 12 weeks, peaking at No. 6, in 1973. This version has since been covered by U2, Pulp (first released on a 1996 various artist compilation album Childline and later on deluxe edition of Different Class in 2006), Smokie, Metallica (Garage Inc. 1998, which won a Grammy), Belle and Sebastian (The Blues Are Still Blue EP 2006), Gary Moore (2006), Nicky Moore (Top Musicians Play Thin Lizzy 2008), Simple Minds (Searching for the Lost Boys 2009), and Israeli musician Izhar Ashdot. The song is also on the Grateful Dead live compilation So Many Roads disc five."]}, {"page": "Sweden Rock Festival", "response": ["* Nicky Moore plays Samson", "* Locomotive Breath with Nicky Moore", "* Slow Train with Nicky Moore"]}, {"page": "Samson (band)", "response": ["Samson were a British heavy metal band formed in 1977 by guitarist and vocalist Paul Samson. They are best known for their first three albums with future Iron Maiden singer Bruce Dickinson, then known as \"Bruce Bruce\", and drummer Thunderstick (real name Barry Graham Purkis), who wore a leather mask and performed on stage in a metal cage. Drummer Clive Burr was also a member of the band, both before and after his tenure with Iron Maiden. Drummer Mel Gaynor had a successful music career being a member of Simple Minds for over 20 years. Dickinson's replacement on vocals, Nicky Moore, performed with Samson throughout the mid-1980s and again from the late 1990s onwards; he has also been a member of the bands Mammoth and Nicky Moore and the Blues Corporation. Samson were a part of the New Wave of British Heavy Metal.", "Following Dickinson's departure, former Hackensack and Tiger vocalist Nicky Moore was recruited to front the band who had also signed a new recording contract with Polydor. Samson's first release with Moore was the \"Losing My Grip\" EP in 1982. The title track as well as \"Pyramid to the Stars\" had originally been cut with Dickinson. Those versions would remain unreleased until they surfaced on the Shock Tactics CD re-release in 2001. Samson issued two albums with Moore, 1982's Before the Storm and 1984 Don't Get Mad, Get Even before the group disbanded with Paul Samson carrying on solo. Samson reformed in 1987 and performed until 1991, through various line-up changes. The album Refugee was launched in 1990.", "In 1999, Paul Samson released a CD containing five of the compositions from the Picnic Demos, entitled Past Present & Future. The Samson-Aylmer-Thunderstick line-up reformed for a live show in Tokyo, and in 2000, with Nicky Moore back on board, a series of live dates, including a \"25th Anniversary of the NWOBHM\" concert at the London Astoria on 26 May 2000, which also featured Angel Witch on the bill. Samson's performance was recorded and released as a live album. The same line-up later appeared at the Wacken Open Air rock festival on 4 August 2000.", "The group effectively disbanded with Paul Samson's death from cancer on 9 August 2002. Moore paid tribute to his late bandmate at the Sweden Rock Festival on 12 June 2004, with a set entitled \"Nicky Moore plays Samson\". ", "*Nicky Moore – vocals (1981–1984, 1986, 2000–2002)", "  bar:moore  text:\"Nicky Moore\""]}, {"page": "Paul Samson", "response": ["Nicky Moore was recruited as a replacement, and Mel Gaynor then Pete Jupp took over drums, and this line-up released Before the Storm and Don't Get Mad - Get Even. These two albums sold in higher quantities than the first three, and the band toured more countries and played to bigger audiences than the Bruce/Thunderstick line-up, although the New Wave of British Heavy Metal was by now said to be a spent force.  The band formally split up in 1984.", "Samson died of cancer on 9 August 2002 in Norwich, whilst recording a new Samson album with Nicky Moore."]}, {"page": "Friday Rock Show", "response": ["For most of its run, its intro and closing theme tune was the Dixie Dregs instrumental \"Take it Off the Top\", and the quiz used the Van der Graaf Generator track \"Theme One\" (a cover of the theme tune originally written for Radio 1 by George Martin in 1967); other jingles were written and performed by Samson (with Nicky Moore on vocals), Rose Tattoo and Vow Wow. The show replaced John Peel on Friday nights, but Peel's show had previously featured more mainstream styles of rock music than he personally favoured as \"part of a review function\"; after the Friday Rock Show began, Peel was able to concentrate on the post-punk styles he was most enthused by at this point."]}, {"page": "Janne Stark", "response": ["Besides playing guitar in his ordinary bands, Stark has also made guest appearances on recordings by many bands, including Narnia, Blinded Colony, Faith, VII Gates, Chris Catena, Rod Chappell Band, Audiovision, From Behind (featuring former Samson-singer Nicky Moore), Zello etc."]}, {"page": "Big Jim Sullivan", "response": ["In 1974, Sullivan teamed up with the record producer, Derek Lawrence, to form the record label, Retreat Records. One album release was Big Jim's Back (1975). He fronted a band called Tiger, alongside vocalist Nicky Moore, releasing three albums under this name before the group split up in 1976."]}, {"page": "Electric Sun", "response": ["Fire Wind came next in 1981, featuring new drummer Sidhatta Gautama. The band toured for a few years afterwards. While the first two albums were a trio format, the third album was more of an ensemble project. Veteran drummer Clive Bunker, formerly of Jethro Tull, appeared, as did Ritgen, vocalist Michael Flexig and guest vocalist Nicky Moore, as well as an array of additional various singers and orchestral musicians. Another feature of the album was the invention of Roth's Sky Guitar. In 1983, drummer and percussionist Simon Fox worked alongside Clive Bunker."]}, {"page": "Beyond the Astral Skies", "response": ["*Nicky Moore - Harmony vocals on 1 "]}, {"page": "Astounding Sounds, Amazing Music", "response": ["The group performed at Cardiff Castle on 24 July as \"special guests\" to Status Quo, featuring also Strawbs, Curved Air, Budgie and MC John Peel. They promoted the album with a 17-date British tour from 15 September through to 5 October, with support from Tiger featuring Nicky Moore and Big Jim Sullivan, and the Atomhenge stage set designed by Larry Smart of Exploding Galaxy. Soundboard recording from these concerts have been issued on Weird Tape Volume 5 (1982) and Atomhenge 76/Thrilling Hawkwind Adventures (2000). After the tour, the group dismissed Turner and Powell, recorded the single \"Back on the Streets\" and then undertook another 8 date tour in December."]}, {"page": "Tonight's the Night (Gonna Be Alright)", "response": ["The song has been remade by such artists as: Linda Clifford, Nicky Moore, and sung by Anthony Kavanagh, Terry Steele, who reached number forty-four on the R&B singles chart, and Alison Crawford on Grease is the Word."]}, {"page": "More (British band)", "response": ["Kenny Cox revived More briefly in 1985, with vocalist Ron Jackson, guitarist Mel Jones, bassist Baz Nicholls, and Paul George on drums. Following that, Kenny Cox moved on to the band Mammoth with ex-Gillan and Sun Red Sun bassist John McCoy and ex-Samson vocalist Nicky Moore."]}, {"page": "John McCoy (musician)", "response": ["Post-Gillan, McCoy recruited session drummer Vinnie \"Tubby\" Reed, guitarist \"Big\" Mac Baker and vocalist Nicky Moore to form a band initially called Dinosaur. The name was already in use by a Californian band, so McCoy renamed his new band Mammoth. The name was also a tongue-in-cheek reference to the large size of the band members: McCoy weighed  or 265 pounds, Reed  or 309 pounds, Baker  or 355 pounds, and Moore  or 280 pounds."]}, {"page": "Ain't No Love in the Heart of the City", "response": ["*Nicky Moore (blues rock, 2009)"]}, {"page": "Live at Reading '81", "response": ["Live at Reading '81 has been issued on CD numerous times, including editions by Raw Fruit (UK, 1990), Grand Slamm (US, 1990), Repertoire (Germany, 1990), Jimco (Japan, 1990), Bruce Dickinson's short lived Air Raid label (UK, 2000), Castle Music (UK, 2001), and Dissonance Productions (UK, 2017).  The Castle and Dissonance versions include 3 bonus tracks, \"Red Skies\", \"Turn Out the Lights\" and \"Firing Line\", 2-track recordings from a June 1981 rehearsal for the Shock Tactics tour. \"Red Skies\" and \"Turn Out the Lights\" were subsequently recorded with new vocalist Nicky Moore for the band's 1982 studio album, Before the Storm."]}, {"page": "Before the Storm (Samson album)", "response": ["Before the Storm is the fourth studio album by British hard rock/heavy metal band Samson. It was released in 1982, with the new vocalist Nicky Moore. He was recruited to replace Bruce Dickinson after Dickinson joined Iron Maiden. The drummer Mel Gaynor was also replaced by Pete Jupp, when Gaynor left to join Simple Minds. AllMusic's Eduardo Rivadavia described the album as a \"promising start\" to the new line-up, with the music moving more toward hard rock and away from heavy metal.", "# \"Dangerzone\" (Paul Samson, Chris Aylmer, Nicky Moore) - 5:24", "* Nicky Moore – vocals", "The song \"I'll Be 'Round\" was originally written with Dickinson and appears as \"Gravy Train\" on the Live at Reading '81 album. Nicky Moore would re-write the lyrics for the re-worked Before the Storm studio version."]}, {"page": "List of new wave of British heavy metal bands", "response": ["*Nicky Moore BandMacmillan: p.411"]}, {"page": "List of Samson band members", "response": ["Samson were an English heavy metal band from London. Formed in summer 1977, the group originally featured vocalist and guitarist Paul Samson, bassist Chris Aylmer and drummer Clive Burr. The group were active until the eponymous frontman's death in 2002, at which point their lineup included lead vocalist Nicky Moore, bassist Ian Ellis and drummer Billy Fleming.", "Shortly after the release of Survivors, Samson brought in Bruce Dickinson as their new frontman, who took on the stage name \"Bruce Bruce\". Head On and Shock Tactics followed over the next two years, before Purkis left to form his own band Thunderstick in July 1981. He was replaced by Mel Gaynor in time for Reading Festival the following month, which proved to be Dickinson's final show with Samson when he accepted an offer to join Iron Maiden in September. He was soon replaced by Nicky Moore. Gaynor stepped back from the band in January 1982 and Pete Jupp took his place.", "In the summer of 1999, Samson reunited with Aylmer and Thunderstick for a series of anniversary shows; the reunion was originally slated to include vocalist Bruce Dickinson, however he ultimately rejoined Iron Maiden and Samson remained a trio. In 2000, Nicky Moore returned as the band's frontman for a series of shows. The following year, Samson and Moore began work on a new studio album tentatively titled Brand New Day, adding new members Ian Ellis on bass and Billy Fleming on drums. However, before the album could be finished, Paul Samson died of cancer on 9 August 2002.", "|Nicky Moore", "*Nicky Moore – lead vocals", "*Nicky Moore – lead vocals", "*Nicky Moore – lead vocals", "*Nicky Moore – lead vocals", "*Nicky Moore – lead vocals"]}]}}