{"wiki_id": "http://www.wikidata.org/entity/Q7026367", "itemLabel": "Nicholas Wade", "itemDescription": "British science writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Wade", "wikipedia_page": {"main": "Nicholas Michael Landon Wade (born 17 May 1942) is a British author and journalist. He is the author of numerous books, and has served as staff writer and editor for Nature, Science, and the science section of The New York Times.His 2014 book A Troublesome Inheritance: Genes, Race and Human History was widely denounced by the scientific community for misrepresenting research into human population genetics.In May 2021, Wade published an article in support of the COVID-19 lab leak hypothesis, fuelling the controversy around the origins of the virus. Wade's claims about the origin of COVID-19 are at odds with the prevailing view among scientists.", "link_mentions": [{"page": "Impresario", "response": ["Jacques-Yves Cousteau said of himself that he was an impresario of scientists  as an explorer and filmmaker who worked with scientists in underwater exploration. Nicholas Wade described James D. Watson and E. O. Wilson in The New York Times as impresarios of Charles Darwin's works."]}, {"page": "Scientific racism", "response": ["Other prominent modern proponents of scientific racism include Charles Murray and Richard Herrnstein (The Bell Curve); and Nicholas Wade (A Troublesome Inheritance). Wade's book faced strong backlash from the scientific community, with 142 geneticists and biologists signing a letter describing Wade's work as \"misappropriation of research from our field to support arguments about differences among human societies.\""]}, {"page": "List of popular science books on evolution", "response": ["* Nicholas Wade (2006). Before the Dawn: Recovering the Lost History of Our Ancestors."]}, {"page": "Andrew Schally", "response": ["*Nicholas Wade, The Nobel Duel, Garden City, Anchor Press/Doubleday, 1981."]}, {"page": "The Double Helix", "response": ["An annotated and illustrated version of the book, edited by Alex Gann and Jan Witkowski, was published in November 2012 by Simon & Schuster in association with Cold Spring Harbor Laboratory Press. The new edition coincided with the fiftieth anniversary of the award of the 1962 Nobel Prize for physiology or medicine to Francis Crick, James D. Watson and Maurice Wilkins. It contains over three hundred annotations on the events and characters portrayed, with facsimile letters and contemporary photographs, many previously unpublished. Their sources include newly discovered correspondence from Crick, the papers of Franklin, Pauling, and Wilkins, and they include a chapter dropped from the original edition that described Watson's holiday in the Italian Alps in 1952. The edition was favorably reviewed in The New York Times by Nicholas Wade who commented, \"anyone seeking to understand modern biology and genomics could do much worse than start with the discovery of the structure of DNA, on which almost everything else is based. This edition includes several appendices, including letters by Crick and Watson giving the first account of the discovery, a previously unpublished chapter, an account of the controversy surrounding the publication, and the unsympathetic review by the late Erwin Chargaff from the March 29, 1968, issue of Science, which he previously declined permission to reprint in the 1980 Norton Critical Edition of The Double Helix edited by Gunther Stent."]}, {"page": "Tarim mummies", "response": ["* 'A Host of Mummies, A Forest of Secrets', Nicholas Wade, The New York Times, 15 March 2010."]}, {"page": "Elias Alsabti", "response": ["* Nicholas Wade and William Broad. Betrayers of the Truth: Fraud and Deceit in the Halls of Science.  New York: Simon & Schuster, 1983, pp. 38–59."]}, {"page": "Science journalism", "response": ["* Nicholas Wade, a science journalist for The New York Times"]}, {"page": "Stephen McNallen", "response": ["In an online video, McNallen insisted that \"race is real. It is not a social construct\", and has pointed to writers like Nicholas Wade in defense of this point. McNallen also believes in an integral link connecting one's genetic or racial heritage to one's religion. He thus considers the ancient religion of the Aztecs to be inscribed on the subconscious of contemporary Mexicans, and the ancient religion of the Norse to be inscribed on the subconscious of those descended from ancient North Europeans. He regards Heathenry as belonging to all people descended from ancient northern Europeans and wants to make it as accessible as possible to this demographic, arguing that it is the religion best suited to fill the spiritual yearning of many white Americans. While typically linking Heathenry to peoples descended from ancient Northern Europeans, in some contexts, McNallen has referred to a broader, pan-European identity, stating that \"European cultures are all unique — unique that is, as variants on the basic European pattern.\""]}, {"page": "Marc Hauser", "response": ["The details of this investigation were not publicly released, and the lack of transparency evoked substantial speculation. Writing in the New York Times in August 2010, Nicholas Wade summarized:"]}, {"page": "William Broad", "response": ["Broad is the author or co-author of eight books, including Germs: Biological Weapons and America's Secret War (Simon & Schuster, 2001) which was a number-one New York Times Best Seller. His other titles include Betrayers of the Truth: Fraud and Deceit in the Halls of Science (co-written with Nicholas Wade, Simon & Schuster, 1982), Teller's War: The Top-Secret Story Behind the Star Wars Deception (Simon & Schuster, 1992), The Universe Below: Discovering the Secrets of the Deep Sea (Simon & Schuster, 1997), and The Science of Yoga: The Risks and the Rewards (Simon & Schuster, 2012). His books have been translated into more than a dozen languages. His work focuses on the social repercussions of science.", "* With Nicholas Wade, Betrayers of the Truth: Fraud and Deceit in the Halls of Science.  New York: Simon & Schuster, 1983. ."]}, {"page": "Lawrence Beesley", "response": ["Beesley was portrayed by actor David Warner (who later played fictional character Spicer Lovejoy in James Cameron's 1997 Titanic film) in the 1979 dramatisation of the voyage and sinking, S.O.S. Titanic. Beesley was also portrayed by Lawrence Bennett in 1999 musical stage adaptation Titanic. His son Alec married the author Dodie Smith, and he is the grandfather of New York Times science editor Nicholas Wade."]}, {"page": "Science in Society Journalism Awards", "response": ["* Book: Nicholas Wade for Before the Dawn: Recovering the Lost History of Our Ancestors (Penguin Books)"]}]}}