{"wiki_id": "http://www.wikidata.org/entity/Q7028653", "itemLabel": "Nicky Mohan", "itemDescription": "English footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Mohan", "wikipedia_page": {"main": "Nicholas Mohan (born 6 October 1970) is an English former professional footballer who played as a defender making 390 league appearances for seven clubs during his 15-year Football League career.\nHe most notably spent time in the Premier League with both Middlesbrough and Leicester City, as well as spells in the Football League with Hull City, Bradford City, Wycombe Wanderers and Stoke City. He also played non-league football for Gateshead, Harrogate Town, Spennymoor United, Thornaby, Bishop Auckland, Stokesley and Guisborough Town.", "link_mentions": [{"page": "List of Bradford City A.F.C. players", "response": ["|Nicky Mohan||||1995–1997||84||4||"]}, {"page": "2001 Football League Trophy Final", "response": ["Port Vale found their challenge in the area semi-finals, facing their rivals and Football League trophy holders Stoke City; despite it being a home tie the fixture was actually played at the Britannia Stadium due to the poor state of the Vale Park pitch. It took extra-time to separate the teams, Micky Cummins put the Vale ahead on 64 minutes before Nicky Mohan scored a late equaliser. However Mohan gave away a penalty in the 105th-minute and Marc Bridge-Wilkinson converted, ending the game with a golden goal, to give the Burslem club a night of celebration."]}, {"page": "1998–99 Stoke City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Nicky Mohan"]}, {"page": "1999–2000 Stoke City F.C. season", "response": ["|align=\"left\"|5||align=\"left\"|DF||align=\"left\"| Nicky Mohan"]}, {"page": "2000–01 Stoke City F.C. season", "response": ["|align=\"left\"|5||align=\"left\"|DF||align=\"left\"| Nicky Mohan"]}, {"page": "2000 Football League Trophy Final", "response": ["The 1999–2000 season saw both Bristol City and Stoke City involved in the race for promotion to the First Division. Stoke had been in the top six for most of the campaign whilst Bristol battled with city rivals Bristol Rovers to gain a play-off spot. The two sides had played each other twice before the final. Firstly on 14 November 1999 at Stoke's Britannia Stadium the score ending 1–1 with goals from Nicky Mohan and Brian Tinnion. The second match at Ashton Gate also ended in a draw this time 2–2 with goals from Kyle Lightbourne, Graham Kavanagh and a brace from Tony Thorpe.", "|DF || 5 || Nicky Mohan"]}, {"page": "1999–2000 Football League Trophy", "response": ["|DF || 5 || Nicky Mohan "]}, {"page": "1996 Football League Second Division play-off Final", "response": ["|CB ||5||  Nicky Mohan"]}, {"page": "1994–95 Leicester City F.C. season", "response": ["|Nicky Mohan"]}, {"page": "List of people from Middlesbrough", "response": ["* Nicky Mohan, footballer"]}, {"page": "2000–01 Port Vale F.C. season", "response": ["In the League Trophy, the Vale eased past Notts County with a 3–0 win. They then faced Chester City of the Conference, who they defeated 2–0. The area quarter-final also proved to be no challenge for Vale, as they triumphed 4–0 over Darlington. The semi-final stage held a real challenge however, with the match against rivals Stoke City held at the Britannia Stadium despite the draw giving Vale a home tie. Cummins put Vale ahead before Nicky Mohan equalized to take the match into extra-time. A 105th minute Bridge-Wilkinson penalty put Vale into the regional final. It was a two-legged affair with Lincoln City, and Vale were the victors with a 2–0 win at Sincil Bank, thanks to goals from Bridge-Wilkinson and Naylor. Brentford awaited in the final at the Millennium Stadium. Vale lifted the trophy for the second time with a 2–1 victory, Bridge-Wilkinson and Steve Brooker scoring the goals on a rainy day in front of 25,654 spectators at the Millennium Stadium; Brooker scored the game's opening goal from the penalty spot after Naylor was fouled by Darren Powell on 77 minutes, and it was also Naylor who provided the assist for Brooker's winner six minutes later."]}, {"page": "1990 Full Members' Cup Final", "response": ["|MF ||13 || Nicky Mohan"]}, {"page": "2002–03 Hull City A.F.C. season", "response": ["|align=\"left\"|25||align=\"left\"|DF||align=\"left\"| Nicky Mohan"]}, {"page": "Mohan (given name)", "response": ["* Nicky Mohan (born 1970), English former professional footballer who played in defence"]}]}}