{"wiki_id": "http://www.wikidata.org/entity/Q7025143", "itemLabel": "Nicholas Bye", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Bye", "wikipedia_page": {"main": "Nicholas David Bye is a Conservative local politician in England.  Bye was born in Paignton, Devon and graduated from Oxford University. He was Liberal candidate for Torbay in the 1987 election.\nBye served on Torbay Council for five years and served a term as civic mayor in 2003–04.\nIn October 2005, he became the first directly elected mayor of Torbay. He beat Liberal Democrat Nicholas Pannell in the second round of counting with a total of 7,096 votes to Pannell's 5,197.  After the election, Bye noted that \"it is quite clear from canvassing that a lot of people did not want an elected mayor.\"Bye was the Conservative Party's third directly elected mayor, after Chris Morgan and Linda Arkley in North Tyneside and the first directly elected mayor in the South West. In 2008 fellow Conservative Boris Johnson was elected as the first Conservative mayor of London.\nBye was one of three contenders for the Totnes Conservative candidacy, after the announcement by Anthony Steen that he will not stand in the next election. He placed third in the Totnes primary, and defeated by Sarah Wollaston.\nBye was the subject of a complaint to Torbay Council's standards committee in August 2010, over the proposed development of a large housing estate on land currently being occupied by Churston Golf Club. This complaint relates to his interests in Eric Lloyd & Co Estate Agents, the only estate agency business with an office in Churston. In 2006 Bye registered the fact that he had a financial interest in the company, and council documents have also shown he is entitled to a profit related bonus from the company.\nOn 12 November 2010 Bye confirmed that he will be seeking to stand as Mayor of Torbay for a further 4 years however he was deselected by the Conservative Party in favour of former independent candidate, Gordon Oliver, and stood for re-election as an independent. He failed to secure re-election in May 2011, losing to his Conservative opponent Gordon Oliver.In December 2014 it was announced that Nicholas Bye has rejoined the Conservative Party and is standing for election to Torbay Council for the Wellswood ward in the upcoming 2015 local elections.", "link_mentions": [{"page": "Torquay", "response": ["In 2005, a referendum was held to appoint Torbay's first elected Mayor. In the ensuing election in October 2005, the winning candidate was a former Liberal Parliamentary Candidate, Nicholas Bye, who won the election as a Conservative.", "In 2011 Gordon Oliver was elected as Torbay's new mayor beating the existing Mayor Nicholas Bye. Mr Oliver finished with 12,716 votes and Mr Bye 9,631 after the two made it to the second and final round of counting."]}, {"page": "Torbay", "response": ["Until May 2011, Torbay Council had been headed by the first directly elected mayor in the South West region. Conservative candidate Nicholas Bye who won in October 2005, under an electoral system which was later described as \"a total failure\" with Bye receiving votes from fewer than 7% of the electorate. However, running as an independent he was defeated in the May 2011 election by Gordon Oliver who stood as a Conservative. Oliver was re-elected in 2015."]}, {"page": "History of Torquay", "response": ["In October 2005, Torquay as part of Torbay chose its first directly elected mayor, Nicholas Bye, under an electoral system which was later described as \"a total failure\", Bye receiving votes from fewer than 7% of the electorate.BBC News, 25 October 2005 (http://news.bbc.co.uk/1/hi/england/devon/4374914.stm) He beat Liberal Democrat Nicholas Pannell in the second round of counting with a total of 7,096 votes to Pannell's 5,197. After the election, Bye noted that \"it is quite clear from canvassing that a lot of people did not want an elected mayor.\""]}, {"page": "List of University of Oxford people in British public life", "response": ["| Nicholas Bye"]}, {"page": "2011 United Kingdom local elections", "response": ["|Nicholas Bye (Conservative)"]}, {"page": "Nick Bye", "response": ["#REDIRECT Nicholas Bye"]}, {"page": "2009 Totnes Conservative primary", "response": ["* Nicholas Bye, Mayor of Torbay (2005–11)", "|                             Nicholas Bye"]}, {"page": "Bye, Nicholas", "response": ["#redirectNicholas Bye"]}, {"page": "Bye (surname)", "response": ["*Nicholas Bye (born 1960), English politician"]}]}}