{"wiki_id": "http://www.wikidata.org/entity/Q7028096", "itemLabel": "Nick Walker", "itemDescription": "artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Walker_(artist)", "wikipedia_page": {"main": "Nick Walker (born 1969) is a British graffiti artist originating from Bristol, England. His paintings often feature a bowler-hatted gentleman 'vandal'.He is credited with being part of the stencil graffiti movement that Robert Del Naja started in the 1980s, which was also an influence on Banksy.\nWalker recreated the graffiti'd streets of New York City for Stanley Kubrick's 1999 film, Eyes Wide Shut. His work was included in a video by The Black Eyed Peas.In 2006 a spray painted work of Walker's titled \"Moona Lisa\" sold for an unexpected £54,000 at Bonhams in London. At a solo exhibition at London's Black Rat Gallery in 2008, £750,000 worth of art was sold, with dozens of people camping outside the gallery overnight.Walker was a main participant in the 2011 See No Evil event in Bristol, where he painted \"perhaps the most striking piece at the event\",  one of his bowler-hatted gentleman on the side of a tower block in Nelson Street.\nWalker was the first artist-in-residence of the Quin Arts program at the Quin Hotel in New York City. Walker created 15 original pieces on-site for the Quin’s permanent collection during his residency in 2013, shortly following the hotel's opening. In February 2016, Walker revisited the Quin to show both historic images, as well as a new vocabulary of abstraction. This solo exhibit, curated by DK Johnston, presented 25 original works and opened the hotel’s Quin Arts program for the 2016 season. In November 2016, Walker joined a cohort of fellow former Quin Arts artists-in-residence in using a D’Angelico Guitar as their “canvas,” for an artist salon. His design featured curvilinear numbers resembling musical notes.Walker still lives in Bristol.", "link_mentions": [{"page": "Banksy", "response": ["Banksy started as a freehand graffiti artist in 1990–1994 as one of Bristol's DryBreadZ Crew (DBZ), with two other artists known as Kato and Tes. He was inspired by local artists and his work was part of the larger Bristol underground scene with Nick Walker, Inkie and 3D. During this time he met Bristol photographer Steve Lazarides, who began selling Banksy's work, later becoming his agent. By 2000 he had turned to the art of stencilling after realising how much less time it took to complete a work. He claims he changed to stencilling while hiding from the police under a rubbish lorry, when he noticed the stencilled serial number and by employing this technique, he soon became more widely noticed for his art around Bristol and London. He was the goalkeeper for the Easton Cowboys and Cowgirls football team in the 1990s, and toured with the club to Mexico in 2001. Banksy's first known large wall mural was The Mild Mild West painted in 1997 to cover advertising of a former solicitors' office on Stokes Croft in Bristol. It depicts a teddy bear lobbing a Molotov cocktail at three riot police."]}, {"page": "Culture in Bristol", "response": ["There are several graffiti artists active in Bristol; probably the most known is Banksy, who produced the album cover for Think Tank by britpop band Blur. Other Bristol graffiti artists include Nick Walker, Sickboy, Inkie, Stars, Lokey, cheo."]}, {"page": "Nick Walker", "response": ["Nick Walker or Nicholas Walker may refer to:", "* Nick Walker (cricketer) (born 1984), British cricketer", "* Nick Walker (artist) (born 1969), British graffiti artist", "* Nick Walker (snooker player) (born 1973), English former snooker player", "* Nick Walker (footballer) (born 1990), Trinidadian footballer"]}, {"page": "Inkie", "response": ["Inkie is a London-based painter and street artist, originally from Clifton, Bristol. He is cited as being part of Bristol's graffiti heritage, along with Banksy, 3D and Nick Walker."]}, {"page": "See No Evil (artwork)", "response": ["Bio: Inkie, started out painting alongside 3D, Banksy, Goldie, The Chrome Angels and Nick Walker in 1983. For See No Evil he painted a four-floor high female art nouveau, using about 70-80 cans.", "!Nick Walker", "See No Evil: Who's Lenny explains how once outlawed graffiti artists have now come to critical acclaim, and how one group in particular were invited to paint the courts of law in which they were once convicted for their art. The video aims to present street art as a vibrant and contemporary art form. The documentary includes interviews with some of the 72 artists involved including Inkie, Tats Cru, El Mac, Nick Walker, Shoe, Xenz, China Mike and Paris. Focusing on the See No Evil event, the film also explores how street art has a natural home in Bristol, capturing the spirit of Bristol graffiti scene.", "The event took place on Nelson Street again, a one-way bus and taxi lane known for its depressingly grey concrete walls (including a 12-story office block and a police station) over the course of 7 days– with the permission of the owners. Three works from the 2011 event's 72 pieces were saved by the public vote, via an internet poll allowing people to voice their opinions on preferred works, those being the suited man pouring a tin of red paint, the wolf boy, and the woman and child; painted by Nick Walker, Aryz and El Mac respectively.", "|See 2011 Entry. In 2012 his abstract whisps were painted at the bottom of Nick Walker's huge character, helping make it the largest street art mural in the UK."]}, {"page": "The Quin", "response": ["In November 2016, the Quin commissioned 14 acclaimed artists to create custom pieces for a group salon in partnership with D'Angelico Guitars. Artists included Above (Tavar Zawacki), Alex Yanes, ASVP, Blek le Rat, Eric Zener, Joanne CORNO, Amanda Marie, Mindy Linkous, Nick Walker, Pure Evil, Robert Malmberg, SP38, The London Police, and Wulf Treu.", "On May 10, 2018, the Quin debuted a vibrant collection of floral-themed pieces to celebrate spring in the city. Co-curated by DK Johnston and New York-based curator Lori Zimmer, In BLOOM highlighted the signature styles of 29 participating artists. Artists included Alexis Hilliard, Annika Connor, ASVP, Beau Stanton, C215, CRASH (John Matos), Elizabeth Winnel, Ellannah Sadkin, Erik Foss, Galo, Icy & Sot, Jamie Martinez, Jeremy John Kaplan, Joanne Leah, Jon Burgerman, Kathryn Rose, Keya Tama, Logan Hicks, Mando Marie, Michael DeFeo, Mindy Linkous, Nick Walker, Pure Evil (Charley Uzzell Edwards), Robert Malmberg, Ron English, Sean Augustine March, Vahge, and Wulf Von Treu. The lobby’s 15 foot video wall showcased Brooklyn-based artist Ashley G. Garner’s Synaesthesia series, which featured six films on loop and six separate hues influenced by color psychology. The six-part video series was paired with audio compositions by musician ALURIA.", "The Quin’s latest exhibition, And Suddenly the Picture was Distorted launched July 12, 2018. Inspired by a lyric from “The Hall of Mirrors” by legendary German electronic group Kraftwerk, this exciting exhibit explored the themes of image, obsession, and perception through a variety of mediums and techniques. Co-curated by DK Johnston and Angelo Madgridale in partnership with Doyle, selections included private collections and new work from Swoon, ROA, WK Interact, Nick Walker, John Fekner, Michael de Feo, and Blek le Rat. A special installation on the 15-foot video wall featured the photography of Soren Solkaer. The exhibition also included site-specific work created at the Quin itself, such as a steel door tagged as “Andy Warhol” by renowned graffiti artist and former Artist in Residence Blek le Rat. As the Quin Arts Program approached its 5th Anniversary, And Suddenly the Picture was Distorted celebrated its run of thought-provoking and visually compelling exhibitions, ranging from international graffiti art, to photography, photo-realism, and collage."]}, {"page": "Drago (publisher)", "response": ["*2009: Nick Walker: A Sequence of Events ()", "2007: 36 Chambers. Inspired by the film The 36th Chamber of Shaolin, the series features 17 books from a diverse range of contemporary artists including Nick Walker, Mike Giant and Ivory Serra. For many of these artists, including Nick Walker, their contribution to the series was their first ever book."]}]}}