{"wiki_id": "http://www.wikidata.org/entity/Q7028641", "itemLabel": "Nicky Law", "itemDescription": "footballer and manager (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Law_(footballer,_born_1961)", "wikipedia_page": {"main": "Nicholas Law (born 8 September 1961) is an English former professional footballer and football manager who is currently the Head of Youth Recruitment at Premier League side Burnley.\nHe previously played as a defender notably for Barnsley, Rotherham United and Chesterfield. He became manager of the latter between 2000 and 2001 and later went on to take charge at \nBradford City, Grimsby Town and Buxton.", "link_mentions": [{"page": "Bradford City A.F.C.", "response": ["*  Nicky Law (2002–2003)"]}, {"page": "Chesterfield F.C.", "response": ["|Nicky Law|| English||2000–2001"]}, {"page": "Grimsby Town F.C.", "response": ["Groves was dismissed in February 2004 following a poor stretch of games that had seen the club drop down the table, his replacement Nicky Law was sacked himself only a few months later as Grimsby were relegated for a second consecutive season. Russell Slade was appointed as the new manager in May 2004.", "|  Nicky Law"]}, {"page": "Russell Slade", "response": ["At the end of the 2003–04 season, Grimsby Town decided not to renew the contract of manager Nicky Law following relegation into League Two. Slade was appointed as their new manager. A mid-table finish ensued in the 2004–05 season but despite some disgruntled fans calling for his head, Grimsby spent most of the 2005–06 season in an automatic promotion spot in League Two, also managing to topple both Derby County and Tottenham Hotspur in the League Cup. Town eventually finished the season in 4th place and had to settle for the playoffs, following a late Northampton Town equaliser meant that Leyton Orient would finish the season in the final automatic promotion places. Despite guiding his team to a semi-final victory over local rivals Lincoln City, Slade was unable to secure promotion, Grimsby losing 1–0 in the final against Cheltenham Town in the Millennium Stadium."]}, {"page": "David Wetherall", "response": ["Wetherall was one of four senior players to act as Bradford City manager for two weeks during November 2003, following the sacking of Nicky Law. He, as well as Peter Atherton, Wayne Jacobs and Dean Windass oversaw training but just one game when Bradford City lost 1–0 to Stoke City with Jacobs taking charge from the touchline. Wetherall took his first full steps into management on a caretaker basis when he was appointed player-manager at Bradford City following the sacking of Colin Todd on 12 February 2007. The side were on a poor run of form but Wetherall, whose role was extended in March, could not reverse the fortunes and the side were relegated to League Two. During Wetherall's short stint in charge the club won just two games and drew another four. During his spell in charge of Bradford, Wetherall appointed his former Leeds teammate Nigel Martyn as goalkeeping coach, a position he kept under McCall. Wetherall returned to concentrate on his playing career after Stuart McCall was named full-time manager during the summer of 2007."]}, {"page": "Stuart McCall", "response": ["McCall stayed on for one more season before he was released by manager Nicky Law in May 2002, shortly before the club went into administration for the first time after finishing 15th in Division One. His playing career at Bradford City had looked uncertain in December 2001 before Law arrived, when previous manager Jim Jefferies had left McCall out of the side in a 3–1 defeat at Manchester City following a training ground dispute. However, it was Jefferies who lost out in the dispute when he resigned his post a week later after summit talks with chairman Geoffrey Richmond. In April 2002, McCall's testimonial match against Rangers attracted a crowd of more than 21,000 to Valley Parade. McCall gave part of the proceeds from his testimonial to the Bradford burns research unit, which was set up following the 1985 fire. Two years after his benefit match, McCall played one more time in City colours in a Save Our City appeal match organised by Bradford's evening newspaper, the Telegraph & Argus, to raise funds for the club, who were now in administration for a second time.", "At the start of the 2013–14 season, key players Darren Randolph, Nicky Law, Chris Humphrey, Michael Higdon and Henrik Ojamaa all left the club. McCall replaced them by signing Paul Lawson, Iain Vigurs, John Sutton, Fraser Kerr, Gunnar Nielsen and Stephen McManus. He also managed to persuade James McFadden to stay at the club. Motherwell enjoyed another successful season, finishing second in the 2013–14 Scottish Premiership. The position was achieved by winning on the final day against nearest rivals Aberdeen. After a bad start to the 2014–15 season left Motherwell second from bottom, McCall resigned as manager on 2 November."]}, {"page": "Paul Groves (footballer)", "response": ["Groves joined Scunthorpe United on a one-month loan on 27 February 2004 following the appointment of Nicky Law at Grimsby. Whilst there he scored the 100th league goal of his career, scoring twice in a 3–1 win at York City. He was described as \"inspirational\" by Scunthorpe manager Brian Laws. He signed for Scunthorpe on a permanent contract until the end of the 2003–04 season on 30 March after reaching a settlement on the remainder of his Grimsby contract.", "Groves who at the time was the club captain at Grimsby Town was installed as the player/caretaker manager at the club following the sacking of Lennie Lawrence and long serving assistant manager John Cockerill. A week later in December 2001 he was installed as full-time player-manager of Grimsby. At the time of his appointment the club were and had been in the second tier of English football since 1998 and were heading into a third successive relegation battle despite the fact the club had briefly topped the table in September. He brought back former player Graham Rodger as his assistant and bolstered his side with several good loan signings, including Charlton Athletic duo Andy Todd and Martin Pringle. Groves managed to steer the club to safety and secured Town's place within what is now the Football League Championship for another year. The 2002–03 season was not as successful: the club was eventually relegated. A poor start to the 2003–04 season saw Groves sacked from his managerial duties in February 2004 but remarkably he was kept on as a player until the end of the season but found himself farmed out to local rivals Scunthorpe United on loan by his replacement Nicky Law. He left Grimsby during the summer of 2004 and signed for York City as a player."]}]}}