{"wiki_id": "http://www.wikidata.org/entity/Q7025465", "itemLabel": "Nicholas Grattan-Doyle", "itemDescription": "British politician (1862-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Grattan-Doyle", "wikipedia_page": {"main": "Sir Nicholas Grattan Grattan-Doyle (18 August 1862 – 14 July 1941) was a Unionist Party politician in the United Kingdom.\nHe contested the January 1910 General Election as Liberal Unionist candidate for Gateshead, finishing second. On 27 July 1915, Grattan-Doyle was appointed a deputy lieutenant of County Durham. He was elected as Member of Parliament (MP) for Newcastle upon Tyne North at the 1918 general election, and held the seat until his resignation in 1940, aged 78, the age he was when he died the following year.", "link_mentions": [{"page": "Doyle", "response": ["*Nicholas Grattan-Doyle (1862–1941), British Conservative Party politician"]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Sir Nicholas Grattan-Doyle"]}, {"page": "Newcastle upon Tyne North (UK Parliament constituency)", "response": ["| Nicholas Grattan-Doyle"]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Sir Nicholas Grattan-Doyle"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|Sir Nicholas Grattan-Doyle"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Nicholas Grattan-Doyle"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Sir Nicholas Grattan-Doyle"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Nicholas Grattan-Doyle"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Nicholas Grattan-Doyle "]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["|Nicholas Grattan-Doyle"]}, {"page": "Nicholas Grattan Grattan-Doyle", "response": ["#REDIRECT Nicholas Grattan-Doyle"]}, {"page": "Nicholas Grattan Doyle", "response": ["#REDIRECT Nicholas Grattan-Doyle"]}, {"page": "1940 Newcastle upon Tyne North by-election", "response": ["The seat had become vacant on when the constituency's Conservative Party Member of Parliament (MP), Sir Nicholas Grattan-Doyle, had resigned from Parliament on 10 April, aged 77.  He had been the constituency's MP since its creation for the 1918 general election."]}, {"page": "Newcastle-upon-Tyne (UK Parliament constituency)", "response": ["*Unionist: Walter Richard Plummer,Newcastle Journal 3 Jun 1914 Nicholas Grattan-DoyleYorkshire Post and Leeds Intelligencer 14 Sep 1914"]}, {"page": "Nicholas Doyle", "response": ["#Redirect Nicholas Grattan-Doyle"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Nicholas Grattan-Doyle"]}, {"page": "William McKeag", "response": ["McKeag still retained ambitions to return to Parliament as a Liberal but during the Second World War there was a truce between the main political parties which ensured that they did not oppose each other when by-elections occurred. In 1940 however the seat of Newcastle upon Tyne North became vacant on the retirement of Sir Nicholas Grattan-Doyle, the sitting Conservative MP.  While the Liberals would not officially oppose the Conservative candidate, Sir Nicholas' son Second Lieutenant Howard Grattan-Doyle, McKeag was talked of as a possible Independent candidate for the by-election. However, the seat was successfully contested by an Independent Unionist, Cuthbert Headlam.The Times, 27.5.40 In the event, McKeag did not stand, perhaps because like a large number of electors he found it distasteful to fight an election when the British Expeditionary Force was struggling to get home from the beaches of Dunkirk,Chris Cook and John Ramsden, By-elections in British Politics, UCL Press, 1997 p134 perhaps because he did not wish his political career to interfere with his own war service."]}, {"page": "Grattan-Doyle, Nicholas", "response": ["#redirectNicholas Grattan-Doyle"]}, {"page": "1924 Prime Minister's Resignation Honours", "response": ["*Nicholas Grattan-Doyle  Member of Parliament for Newcastle-on-Tyne North since 1918. One of the founders of the Northern Tariff Reform Federation and Honorary Secretary since its formation 1905. Deputy Director Education and Propaganda, Ministry of Food 1918. "]}]}}