{"wiki_id": "http://www.wikidata.org/entity/Q7026991", "itemLabel": "Nick Davies", "itemDescription": "British investigative journalist, writer and documentary maker", "wikipedia_url": "https://en.wikipedia.org/wiki/Nick_Davies", "wikipedia_page": {"main": "Nicholas Davies (born 28 March 1953) is a British investigative journalist, writer and documentary maker.\nDavies has written extensively as a freelancer, as well as for The Guardian and The Observer, and been named Reporter of the Year, Journalist of the Year and Feature Writer of the Year at the British Press Awards.Davies has made documentaries for ITV's World in Action and written numerous books on the subject of politics and journalism, including Flat Earth News, which attracted considerable controversy as an exposé of journalistic malpractice in the UK and around the globe. As a reporter for The Guardian, Davies was responsible for uncovering the News of the World phone hacking scandal, including the July 2011 revelations of hacking into the mobile phone voicemail of the murdered schoolgirl Milly Dowler.", "link_mentions": [{"page": "Moral panic", "response": ["Many critics of contemporary anti-prostitution activism argue that much of the current concern about human trafficking and its more general conflation with prostitution and other forms of sex work have hallmarks of moral panic. They further argue that this moral panic shares much in common with the 'white slavery' panic of a century earlier, which prompted passage of the 1910 Mann Act. Nick Davies argues that the following major factors contributed towards this effect. Since the collapse of Communism Europe was flooded with sex workers from  Eastern Europe, and the term \"sex trafficking\" came to mean any organized movement of sex workers, losing the connotation of force and coercion. This change of the definition entered, e.g., into the UK's Sexual Offences Act 2003. Second, academic researchers on sex trade provided a range of estimates of the trafficked persons, including estimates based on various assumptions, up to the very pessimistic ones. The media picked the most alarmist numbers, which were uncritically used by politicians, who in their turn were quoted for further misleading information."]}, {"page": "News of the World", "response": ["From the nineties until the newspaper’s demise in 2011, reporters at the paper used private investigators to illegally gain access to hundreds of mobile phone voicemail accounts held by a variety of people of interest to the newspaper. In 2007 the paper's royal correspondent, Clive Goodman, pleaded guilty to illegal interception of personal communication and was jailed for four months; the paper's editor, Andy Coulson, had resigned two weeks earlier. In 2009/2010, further revelations emerged on the extent of the phone hacking, and how it was common knowledge within the News of the World and its News International parent. According to a former reporter at the paper, \"Everyone knew. The office cat knew\", about the illegal activities used to scoop stories. On 17 January 2011, The Guardian reported that Glenn Mulcaire, a private investigator paid by the paper, testified that he had been asked by the newspaper's leadership to hack voicemail accounts on its behalf. In April 2011, attorneys for the victims alleged that as many as 7,000 people had their phones hacked by the News of the World;News Corp. Phone-Hacking Scandal Gets New Legs, AdWeek.com, 6 April 2011. it was further revealed that the paper's owner, Rupert Murdoch, had attempted to pressure Prime Minister Gordon Brown and Labour Party MPs to \"back away\" from investigating the scandal.Phone hacking: Rupert Murdoch 'urged Gordon Brown' to halt Labour attacks. The Guardian, 9 April 2011. Three journalists on the newspaper were initially arrested: Ian Edmondson and Neville Thurlbeck on 5 AprilAmelia Hill, et al \"Phone hacking: two News of the World journalists arrested\", The Guardian, 6 April 2011. and James Weatherup on 14 April.Amelia Hill \"Phone hacking: senior News of the World journalist arrested.\", The Guardian, 14 April 2011. The newspaper \"unreservedly\" apologised for its phone hacking activities during April 2011.Liam Creedon and Lauren Turner, (Press Association) \"News of the World apologises to hacking victims\", The Independent, 10 April 2011. On 4 July 2011, it was disclosed that potential evidence had been deleted in spring 2002 from the hacked voicemail account of Milly Dowler, then missing, but later found to have been murdered.Nick Davies and Amelia Hill \"Missing Milly Dowler's voicemail was hacked by News of the World\", The Guardian, 4 July 2011."]}, {"page": "Tom Watson (Labour politician)", "response": ["In July 2011 it was announced that Watson and his co-author Martin Hickman, a journalist from The Independent, were writing a book dealing with the relationship between newspapers belonging to Rupert Murdoch's News International and senior British politicians and police officers. Watson wrote his book at the same time as The Guardian journalist Nick Davies was writing his, which was subsequently released as Hack Attack: How the Truth Caught Up with Rupert Murdoch. Watson and Davies subsequently met and discussed their respective projects. The publication date and title of Watson's book, Dial M for Murdoch: News Corporation and the Corruption of Britain, were released just three days before it was due to go on sale amid fears News International would try to prevent the launch. On the day details of the book were revealed, Watson indicated on his blog his belief that the book would be controversial: \"Very excited to say we've finally finished the book. It's out this Thursday. I have a hunch it will be one of the most attacked books this year.\""]}, {"page": "World in Action", "response": ["World in Action employed many leading journalists, among them John Pilger; Michael Parkinson; Gordon Burns; Rob Rohrer; Nick Davies, Ed Vulliamy and David Leigh of the Guardian; Alasdair Palmer of the Sunday Telegraph; John Ware, BBC Panorama's leading investigative reporter; Tony Wilson, whose second career as a music impresario was immortalised in the feature film 24 Hour Party People; Michael Gillard, creator of the Slicker business pages in the satirical magazine Private Eye; Donal MacIntyre; the writer Mark Hollingsworth; Quentin McDermott, since 1999 a leading investigative reporter for the Australian Broadcasting Corporation; Tony Watson, editor of the Yorkshire Post for 13 years and editor-in-chief of the Press Association from December 2006; and Andrew Jennings, author of Lords of the Rings and The Dirty Game, who has campaigned vigorously for more than a decade against corruption in international sport.", "Unusually for a current affairs programme, WIA's standard format was as a voice-over documentary without a regular reporter although a handful of WIA journalists did appear in front of camera, including Chris Kelly, Gordon Burns, John Pilger, Gus Macdonald, Nick Davies, Adam Holloway, Stuart Prebble (who later became the programme's editor), Mike Walsh, David Taylor, Donal MacIntyre and Granada Reports journalist and Factory Records supremo Tony Wilson who became the show's first in-vision anchor in the early 80s. Guest presenters were used on rare occasions, among them Jonathan Dimbleby, Sandy Gall, Martyn Gregory, Sue Lawley and Lynn Faulds Wood. Perhaps its most celebrated guest presenter was the distinguished American anchorman Walter Cronkite, who came out of retirement to cover the 1983 UK general election for the series."]}, {"page": "Press Complaints Commission", "response": ["Journalist Nick Davies criticised the PCC for failing to investigate the vast majority of complaints on technical grounds in his book Flat Earth News (2008), an exposé of modern British newspaper journalism. The MediaWise Trust, a charitable organisation set up to help people in their dealings with the press says that the self-regulation system has proved to help the rich but not the poor."]}, {"page": "David Thewlis", "response": ["| Nick Davies"]}, {"page": "Battle of the Beanfield", "response": ["At 7pm officers in riot gear entered the field and launched a final attack. Pregnant women and those holding babies were hit by police with truncheons according to The Observer, who also noted journalist Nick Davies stating that police were hitting \"anybody (that) they could reach\". When some travellers tried to escape by driving away through the field police allegedly threw truncheons, shields, fire-extinguishers and stones at them to stop them. The Observer and The Independent report that travellers' vehicles were smashed and set on fire.", "Nick Davies reported for the Observer that \"There was glass breaking, people screaming, black smoke towering out of burning caravans and everywhere there seemed to be people being bashed and flattened and pulled by the hair. Men, women and children were led away, shivering, swearing, crying, bleeding, leaving their homes in pieces.\""]}, {"page": "Davies", "response": ["* Nick Davies, British journalist"]}, {"page": "Salman Pak facility", "response": ["The facility was discussed in the leadup to the 2003 invasion of Iraq as a result of a campaign by Iraqi defectors associated with the Iraqi National Congress (INC) to assert that the complex incorporated a purpose-built terrorist training camp; a narrative first promoted by western journalists David Rose and Judith Miller.Nick Davies. Flat Earth News, Chatto & Windus 2008. p.332 Internally, both the Central Intelligence Agency (CIA) and the Defense Intelligence Agency (DIA) concluded that there was no evidence to support these claims. A DIA analyst told the Senate Select Committee on Intelligence that the INC \"has been pushing information for a long time about Salman Pak and training of al-Qa'ida.\"  Reporters Jonathan Landay and Warren Strobel noted in November 2005 that \"After the war, U.S. officials determined that a facility in Salman Pak was used to train Iraqi anti-terrorist commandos.\"Seattle Times, 1 November 2005, p. A5]."]}, {"page": "Nick", "response": ["*Nick Davies (born 1953), British investigative journalist, writer, and documentary maker"]}, {"page": "Shooting of James Ashley", "response": ["According to Nick Davies, in an investigation for The Guardian newspaper in 2001, Ashley's death was one of 41 incidents in the preceding decade in which police in England and Wales shot a person who turned out not to have a firearm. Of those shootings, at least 15 proved fatal. In 28 of the 41 cases, the person shot had a replica firearm or some other kind of weapon, and another six were accidental discharges, leaving seven (including Ashley) which Davies described as \"disturbing\". Davies concluded that \"this might look like a ... a licence for police officers to kill. In reality, it indicates something very different but equally disturbing...: police use of firearms is inherently dangerous. The more police are armed, the more they will shoot the wrong people. And the law which surrounds this is inadequate and incapable of fixing the blame when things go wrong\". A 2005 article in The Independent, following the dropping of charges against the officers who shot Stanley, also drew comparisons with Ashley's case and listed it among 30 fatal police shootings in the preceding 12 years, none of which resulted in a successful prosecution of a police officer."]}, {"page": "Nick Davis", "response": ["* Nick Davies (born 1953), British investigative journalist"]}, {"page": "NatWest Three", "response": ["Guardian journalist Nick Davies, in his book Flat Earth News, described the strategy adopted by Bell Yard: "]}, {"page": "Orwell Prize", "response": ["**Nick Davies – Hack Attack: How the Truth Caught Up with Rupert Murdoch"]}, {"page": "Beverley Allitt", "response": ["Allitt was the subject of a book called Murder on Ward Four by Nick Davies. A BBC dramatisation of the case, Angel of Death (2005), featured Charlie Brooks as Allitt. Allitt's story was depicted in episodes of the true crime documentaries Crimes That Shook Great Britain, Deadly Women, Born To Kill?, Evil Up Close, Britain's Most Evil Killers and Nurses Who Kill."]}, {"page": "Peter Morrison", "response": ["Investigative journalist Nick Davies reported in The Guardian that Morrison received a caution for cottaging with underage boys in public lavatories."]}, {"page": "Murder of Milly Dowler", "response": ["The Guardian reported on 4 July 2011 that Scotland Yard had discovered Dowler's voicemail had been accessed by journalists working for the News of the World and the newspaper's private investigator Glenn Mulcaire.James Robinson \"Milly Dowler phone hacking: Family shocked by NoW revelations\", The Guardian, 4 July 2011 The Guardian also reported that, during the police investigation into that newspaper's phone hacking activities, detectives discovered that journalists had deleted some messages—potential evidence—in Dowler's voicemail box because it was full, in order to free up space for new messages, to which they could listen. The deletions after Dowler was missing led family and friends to think that she was still alive.Nick Davies and Amelia Hill \"Missing Milly Dowler's voicemail was hacked by News of the World\", The Guardian, 4 July 2011 It was later reported that Dowler's phone automatically deleted messages 72 hours after they were listened to."]}, {"page": "Roy Greenslade", "response": ["During the late 1980s, when he was managing news editor of The Sunday Times, Greenslade  secretly wrote for An Phoblacht, a newspaper published by Sinn Féin. His pseudonym was George King. Greenslade wrote in a 2021 British Journalism Review article that it was revealed by Nick Davies, a Guardian colleague, with his consent.  When Greenslade reviewed Davies's book on his blog in 2008, he did not deny his contributions to An Phoblacht. On the 30th anniversary of the H Block prison hunger strikes, Greenslade gave a speech at a Sinn Féin conference in London and An Phoblacht published his article on the subject."]}]}}