{"wiki_id": "http://www.wikidata.org/entity/Q7028573", "itemLabel": "Nicky Campbell", "itemDescription": "TV and Radio personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Campbell", "wikipedia_page": {"main": "Nicholas Andrew Argyll Campbell, OBE (born Nicholas Lackey, 10 April 1961) is a Scottish radio and television presenter and journalist.\nHe has presented the BBC Radio 5 Live breakfast programme since 2003, BBC One's Sunday morning show The Big Questions since 2007, and Long Lost Family on ITV since 2011. He presented the game show Wheel of Fortune from 1988 until 1996, and the consumer affairs programme Watchdog from 2001 to 2009.", "link_mentions": [{"page": "April 10", "response": ["*1961 – Nicky Campbell, Scottish broadcaster and journalist"]}, {"page": "BBC Radio 1", "response": ["In response to the growth in dance and rap music, Jeff Young joined in October 1987 with the Big Beat show. At the end of the year, Nicky Campbell, Mark Goodier, and Liz Kershaw all joined and Janice Long left.", "In 1992, Radio 1, for the first and only time, covered a general election. Their coverage was presented by Nicky Campbell."]}, {"page": "List of Scots", "response": ["* Nicky Campbell (born 1962)"]}, {"page": "Talk radio", "response": ["Some notable British talk radio presenters include Jenni Murray, John Humphrys, Martha Kearney, Jonathan Dimbleby, Libby Purves, Laurie Taylor, Pam Ayres, Melvyn Bragg, Tommy Boyd, James Whale, Steve Allen, Nick Abbot, Iain Lee, James Stannage, George Galloway, Julia Hartley-Brewer, Ian Collins, John Nicoll, Brian Hayes, Scottie McClue, James O'Brien, Nicky Campbell, and Simon Mayo. Pete Price on CityTalk is also known as the DJ who rushed to the aid of a regular caller who died live on air during a call. Previously, he had kept a teenager talking for 45 minutes before meeting him to convince him not to commit suicide."]}, {"page": "Frankie Howerd", "response": ["After six years without a regular television show in the United Kingdom (though he had hosted a one-off UK version of The Gong Show for Channel 4, which was critically panned and was not commissioned for a full series), Howerd returned to TV screens in 1987 in the Channel 4 show Superfrank!, scripted by Miles Tredinnick and Vince Powell. In the last years of his career, Howerd developed a following with student audiences and performed a one-man show at universities and in small theatrical venues. He was also a regular and popular guest on the late night BBC Radio 1 programme Into the Night, hosted by Nicky Campbell."]}, {"page": "1961 in television", "response": ["| Nicky Campbell"]}, {"page": "Steve Jones (biologist)", "response": ["In an interview on the BBC Radio 5 show '5 Live Breakfast' hosted by Nicky Campbell and Shelagh Fogarty on 13 January 2009, Jones described private schools as a \"cancer on the education system\".BBC Radio 5 Live: Breakfast, broadcast 13 January 2009"]}, {"page": "BBC Radio 5 Live", "response": ["* Nicky Campbell (Monday – Friday)"]}, {"page": "Top of the Pops", "response": ["By 1994, much of the 'Year Zero' revamp was quickly undone and the arrival of Ric Blaxill as producer in February 1994 signalled a return to presentation from established Radio1 DJs Simon Mayo, Mark Goodier, Nicky Campbell and Bruno Brookes. Blaxill expanded the use of \"via satellite\" performances, taking the acts out of studios and concert halls and setting them against landmark backdrops. As a consequence, Bon Jovi performed Always from Niagara Falls and Celine Dion beamed in Think Twice from Miami Beach."]}, {"page": "Davina McCall", "response": ["In 2011, McCall began hosting  The Biggest Loser and Long Lost Family. After just two series, it was announced that The Biggest Loser had been axed by ITV in September 2012. Long Lost Family, however, is still being broadcast on the channel, with McCall and Nicky Campbell as hosts.", "| 10 series (+ 4 revisited series, + 1 without trace series); with Nicky Campbell  "]}, {"page": "Alistair McGowan", "response": ["His celebrity impressions include David Beckham, Sven-Göran Eriksson, Gary Lineker, Nicky Campbell, Richard Madeley, Tony Blair, Prince Charles, Robert Kilroy-Silk, Laurence Llewelyn-Bowen, Angus Deayton, Terry Wogan and the fictional characters Ross Geller (from Friends) and Dot Cotton (from EastEnders)."]}, {"page": "Kate Robbins", "response": ["In December 2010, Robbins released her third album, a jazz based affair, entitled Soho Nights, which was written as a collaboration with the Italian saxophonist Alessandro Tomei, and recorded at Abbey Road Studios in London. Robbins also co-wrote the well-received easy listening album We're Just Passing Through with broadcaster and journalist Nicky Campbell, which was released in 2014."]}, {"page": "The Big Impression", "response": ["*Nicky Campbell"]}, {"page": "Carol Smillie", "response": ["Carol Patricia Smillie (born 23 December 1961) is a Scottish television presenter, actress and former model. Smillie became famous as a presenter on British TV during the 1990s and early 2000s. She was best known for assisting Nicky Campbell on the UK version of the game show Wheel of Fortune between 1989 and 1994.  Between 1996 and 2003, she was the main presenter on the BBC One home makeover show Changing Rooms.", "Smillie's presenting career launched in 1989, at age 27, when she beat 5,000 other applicants to become the hostess and puzzle board operator of Scottish Television's Wheel of Fortune game show. She co-presented the show until 1994 with Nicky Campbell."]}, {"page": "Capital London", "response": ["*Nicky Campbell (1986–1987) (now with BBC Radio 5 Live)"]}, {"page": "Robert Gordon University", "response": ["* Nicky Campbell, Journalist and Broadcaster (Doctor of Letters 2008)"]}, {"page": "List of game show hosts", "response": ["| Nicky Campbell || United Kingdom || Wheel of Fortune (1988–96)"]}, {"page": "United Kingdom in the Eurovision Song Contest 1996", "response": ["The qualifying round for the contest (the first since ), a special edition of Top of the Pops, was broadcast on BBC1 on 1 March 1996 and was hosted by Nicky Campbell. It was announced that the four songs with the highest number of telephone votes would qualify for the final. The top four songs were announced on 2 March and went forward to the final on 8 March."]}, {"page": "Mark and Lard", "response": ["On 25 October 1993, the pair transferred to Radio 1 full-time and began presenting a late night show from 10pm-midnight on Mondays-Thursdays, replacing Nicky Campbell's Into the Night. The Graveyard Shift featured a mix of comedy sketches, poetry readings, live sessions and guests, including regular contributors such as Mark Kermode, Mark Lamarr, Stuart Maconie, Simon Armitage, Ian McMillan and Katie Puckrik."]}, {"page": "Islamic Human Rights Commission", "response": ["** Nicky Campbell, BBC Radio 5 Live presenter"]}, {"page": "Sian Williams", "response": ["Williams has presented programmes outside of news and current affairs including The One Show, Big Welsh Challenge, Now You're Talking and City Hospital. In 2010, Williams was a reporter for Watchdog.Which Breakfast star's in our Meriva car?  Watchdog, BBC, 29 September 2010 In 2013, she hosted Your Money, Their Tricks with Nicky Campbell and Rebecca Wilcox. Williams also presented a three-part interview series for BBC One Wales titled The Sian Williams Interview featuring Tanni Grey-Thompson, Suzanne Packer and Siân Phillips."]}, {"page": "Les Barker", "response": ["Five \"Guide Cats\" albums have been produced, Guide Cats for the Blind, Missing Persians File, Top Cat, White Tie and Tails, Cat Nav and Herding Cats. The CDs contain performances of Barker's poems by members of the folk world such as June Tabor, Martin Carthy, Steve Tilston, Mike Harding and Tom Paxton and well known figures including Jimmy Young, Nicholas Parsons, Brian Perkins, Terry Wogan, Nicky Campbell, Robert Lindsay, Prunella Scales and Andrew Sachs."]}, {"page": "Emma Freud", "response": ["In 1993, Freud first appeared on BBC Radio 1, deputising for Nicky Campbell on his late night show Into The Night. Later that year, she was invited by the network's new controller Matthew Bannister to reinvent the lunchtime programme previously presented by Jackie Brambles. From January 1994, she appeared on permanent basis on the station every weekday between noon and 2.00 pm, presenting a mix of music, interviews and interactive news features. Her programme was praised by some but it proved unpopular with many who preferred the old mainstream pop fare. In Simon Garfield's 1998 book on Radio 1, The Nation's Favourite, Bannister claims that Freud was \"treated very badly by people at the station, especially other women\"."]}]}}