{"wiki_id": "http://www.wikidata.org/entity/Q7032411", "itemLabel": "Nigel Griggs", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Griggs", "wikipedia_page": {"main": "Nigel Griggs (born 18 August 1949) is a musician who played bass guitar in Split Enz. He is the brother of Paul Griggs from the 1970s vocal group Guys 'n' Dolls. A professional musician since 1963, Nigel Griggs played in a number of bands, notably The Cortinas and Octopus, 1963–1971, with his brother Paul, Carmen and Steve Hillage's Khan. \nHe has been playing bass since he was 14 years old, because his brother's band needed a bassist. His other hobbies include photography, sound recording and Football.Griggs joined Split Enz in 1977 at the same time Neil Finn did, at the recommendation of the current drummer and close friend of Griggs, Malcolm Green. Griggs stayed with the Enz until their 1984 split. After the split, he joined Enz drummer Noel Crombie, Enz keyboardist Eddie Rayner, Split Enz founder Phil Judd and the guitarist Michael den Elzen in the band Schnell Fenster.\nIn 1996, when Crowded House split up and released their greatest hits album Recurring Dream, frontman Neil Finn approached Griggs to put together a collection of the band's greatest live performances, to append selected copies of Recurring Dream.In 2002, Griggs released a solo album, Sleeper, through the Split Enz fanclub, Frenz of the Enz.Due to being a core member, he has always participated in major Split Enz's reunions. On rare occasions, or for unplanned gigs, previous Enz bassist Mike Chunn has been known to step in.", "link_mentions": [{"page": "August 18", "response": ["*1949 – Nigel Griggs, English bass player, songwriter, and producer "]}, {"page": "Split Enz", "response": ["The band's next single was another non-album track \"Another Great Divide\", released to promote their return to Australia/New Zealand in January 1977 for the \"Courting the Act\" tour. Chrysalis issued Mental Notes (the American title of Second Thoughts) in the USA, and at the end of February they set off for the US to support the album. The 23 day/40 show tour was a first attempt to establish themselves in America but it marked the end of an era in the band and proved to be the last tour with founding members Phil Judd and Mike Chunn. Chunn decided to leave at the end of the US tour, partly because he wanted to spend more time with his family but also because he suffered from agoraphobia. But tensions were also increasing between Phil and Tim. Although the band received a standing ovation in San Francisco, audience reactions in more remote areas ranged from puzzlement to outright hostility, and Phil was extremely sensitive to such negative reactions. Also like Mike Chunn he had a young family back in New Zealand and was tired of the endless grind of touring. The tensions climaxed after a concert when Phil, who was having trouble with an out-of-tune guitar, stormed off before the end of the set and when Tim challenged him backstage about what had happened, Phil punched him. The tour ended in April, and Phil left the band. They were due to begin their third English tour later that month, so Tim now took charge and hastily reorganised the group. On 4 April English bassist Nigel Griggs (ex-Octopus) was hired to replace Mike Chunn, who gave Tim a crucial piece of parting advice—he suggested Tim's younger brother Neil as the replacement for Phil Judd. At the time Neil was playing in local Auckland band Afterhours, led by Geoff Chunn, plus Neil and Mark Hough, (aka Buster Stiggs who later joined The Swingers with Phil Judd). Neil flew to England as soon as he received the call from Tim and he officially joined Split Enz on 7 April 1977.", "Phil Judd released a solo album and formed the Swingers with Buster Stiggs and Bones Hillman. He also formed Schnell Fenster with Noel Crombie and Nigel Griggs. They were joined by Eddie Rayner, but Rayner left to form The Makers. His group Enzso performed Split Enz songs in an orchestral setting with the New Zealand Symphony Orchestra. Rayner also pursued a solo career. Geoff Chunn and Mike Chunn returned to New Zealand and formed Citizen Band.", "In 1986, two years after Split Enz broke up, it reunited for a Greenpeace benefit concert. Three years later, Crowded House toured with Schnell Fenster, assembling an assortment of Split Enz alumni. The band reunited in 1993 for its twentieth anniversary tour, when they played Christchurch, Wellington and Auckland supported by The Holy Toledos. This appeared on TV in 2002 to celebrate its thirtieth anniversary. In 2006, Split Enz toured with a membership consisting of the classic 1979–1981 line-up of Tim Finn, Neil Finn, Nigel Griggs, Eddie Rayner, Noel Crombie, and Malcolm Green.", "*Nigel Griggs – bass, backing vocals "]}, {"page": "Steve Hillage", "response": ["By then, musical disagreements between Hillage and Greenwood culminated with the latter's departure. Hillage decided to form a new line-up with a slightly different direction, retaining the services of Peachey and asking Stewart back, and adding Nigel Griggs (later of Split Enz) on bass. New compositions by Hillage and Stewart were added to the repertoire, including \"I Love Its Holy Mystery\", which would form the basis of Hillage's later Solar Musick Suite. Hillage broke up the band in October 1972."]}, {"page": "Wendy Matthews", "response": ["Matthews was a member of Noel's Cowards, a short term project, including ex-Split Enz members Noel Crombie on drums, Nigel Griggs on bass guitar and Phil Judd on guitar. Noel's Cowards, with Matthews on lead vocals, provided six tracks for the Australian movie Rikky and Pete (1988). She was featured vocalist on the single \"Jump\" released in October from Rockmelons' debut album Tales of the City. Tales of the City peaked at No. 14 on the ARIA Albums Chart. At the ARIA Music Awards of 1989, Rockmelons won 'Breakthrough Artist – Album' and Stringer won 'Best Original Soundtrack / Cast / Show Recording'."]}, {"page": "Noel Crombie", "response": ["After Split Enz disbanded, Noel formed the band Schnell Fenster with Phil Judd, Eddie Rayner and Nigel Griggs, also Split Enz alumni, and Michael den Elzen. Rayner left before the first album was released."]}, {"page": "Michael den Elzen", "response": ["In the mid 80s, den Elzen formed Melbourne band Schnell Fenster with ex-Split Enz members Phil Judd, Nigel Griggs and Noel Crombie. They released two albums, \"The Sound of Trees\" and \"OK Alright A Huh Oh Yeah\" and toured in Australia and New Zealand."]}, {"page": "Schnell Fenster", "response": ["Schnell Fenster were a New Zealand rock band formed in Melbourne, Australia in 1986 by Noel Crombie on drums and percussion, Nigel Griggs on bass guitar and backing vocals, Phil Judd on lead vocals and guitar, and Eddie Rayner on keyboards and piano – who were all former members of New Zealand-formed rock group, Split Enz. Fellow founder, Michael den Elzen on lead guitar had worked with Tim Finn Band, another band formed by a Split Enz alumnus.  Judd's band were briefly named The Wanx: but Rayner soon left and they changed their name to faux-German for \"quick window\", because it \"appealed to [their] perversity\". The group formed the core members of Noel's Cowards, a short-term ensemble, whose sole output was six tracks for the soundtrack of a feature film, Rikky and Pete, in 1988. Schnell Fenster released two studio albums, The Sound of Trees (1988) and Ok Alright a Huh Oh Yeah (1990), before disbanding in 1992. At the ARIA Music Awards of 1989 they were nominated for Breakthrough Artist – Album for The Sound of Trees, Breakthrough Artist – Single for \"Whisper\" and Best Cover Art for Judd's graphic art.", "Schnell Fenster (schnelles Fenster is German for \"fast window\") were formed in Melbourne as a pop, rock group in 1986 by Noel Crombie on drums and percussion (ex-Split Enz, the Slaughtermen), Michael den Elzen on lead guitar (ex-Broderick Smith Band, Tim Finn Band, Stephen Cummings Band), Nigel Griggs on bass guitar and backing vocals (ex-Octopus, Steve Hillage's Khan [both in England], Split Enz), Phil Judd on lead vocals and guitar (ex-Split Enz, Suburban Reptiles, the Swingers) and Eddie Rayner on keyboards and piano (ex-Orb, Split Enz, Space Waltz). Rayner left soon after its formation to join the Rock Party and later was a touring member of Crowded House – another Split Enz-related group. The band's name is from \"the nickname given to an experimental steam locomotive built in the 1930s. It reached incredible speeds but was declared unsafe.\"", "* Nigel Griggs – bass guitar, backing vocals (1986–92)", "* Nigel Griggs – bass guitar (1988)"]}, {"page": "Dizrythmia", "response": ["Dizrythmia (1977) is the third studio album released by New Zealand new wave band, Split Enz. It was the first Split Enz album without co-founding members Phil Judd and Mike Chunn. Neil Finn and Nigel Griggs, the first being the younger brother of band leader Tim Finn, replaced them respectively. Meanwhile, Nigel's old friend and former bandmate Malcolm Green took the place of Emlyn Crowther who also left around this time. The album was released domestically by Mushroom Records, and overseas by Chrysalis Records.", "* Nigel Griggs – bass"]}, {"page": "True Colours (Split Enz album)", "response": ["*Nigel Griggs - bass guitar"]}, {"page": "Waiata (album)", "response": ["* Nigel Griggs – bass"]}, {"page": "List of bass guitarists", "response": ["* Nigel Griggs (Split Enz)"]}, {"page": "Moonwalk (dance)", "response": ["In 1980, in the music video for their single \"One Step Ahead\" by New Zealand rock band Split Enz, keyboardist Eddie Rayner is seen performing a predecessor of the moonwalk, and Nigel Griggs (former bassist for Split Enz) allegedly taught him how to perform it."]}, {"page": "The Makers (Australian band)", "response": ["The Makers were formed in 1988 in Melbourne by Brian Baker (ex-the Ones) on lead vocals, lead guitar and programming; and Eddie Rayner (ex-the Wanx, Split Enz) on keyboards, keyboard bass, synthesisers and programming. Baker and Rayner had met in 1985 when the latter produced the Ones' debut single, \"Heart\" (1986). Rayner then worked in England on Paul McCartney's album, Press to Play (August 1986), before connecting with fellow Split Enz alumni, Noel Crombie, Nigel Griggs and Phil Judd in the Wanx (which were renamed Schnell Fenster) in 1987. Rayner left before they recorded their first album."]}, {"page": "Paul Griggs", "response": ["Octopus, which included Griggs' brother Nigel, supported many well-known groups including Cream and Yes and they released one LP (Restless Night, Penny Farthing, April 1971) and several singles.  During its existence, Octopus had several members who later joined famous groups: Drummer Brian Glascock, John Cook and Tim Reeves of Mungo Jerry, and brother Nigel Griggs and Malcolm Green, both later of New Zealand group, Split Enz. According to the Nottingham Post, \"There was a point – when Octopus cut a single and album – when it looked like fame would be theirs ... but it didn't happen.\""]}, {"page": "Frenzy (Split Enz album)", "response": ["* Nigel Griggs – bass, backing vocals"]}, {"page": "Time and Tide (Split Enz album)", "response": ["# \"Dirty Creature\" (Neil Finn, Tim Finn & Nigel Griggs) – 4:02", "* Nigel Griggs – bass guitar"]}, {"page": "Conflicting Emotions", "response": ["* Nigel Griggs – vocals, bass"]}, {"page": "See Ya 'Round", "response": ["* Nigel Griggs – bass, backing vocals (all instruments and vocals on \"Adz\")"]}, {"page": "Phil Judd", "response": ["In the late 1980s, Judd went on to be part of Schnell Fenster and was involved in recording movie soundtracks, most notably The Big Steal, winning the AFI award for his first score Death in Brunswick. Schnell Fenster was composed of former Split Enz members Nigel Griggs, Noel Crombie and Eddie Rayner, along with guitarist Michael den Elzen. Rayner left the project soon after its birth."]}, {"page": "Recurring Dream", "response": ["Recurring Dream was also released as a two-disc version, the second disc being titled Special Edition Live Album. The songs were selected by Split Enz bassist Nigel Griggs, who was asked to do the job by Neil Finn, according to the album's sleeve notes. Just days after he accepted the job, hundreds of cassettes of Crowded House performances arrived for him to evaluate. The recordings he chose were not remixed or adjusted in any way before they were put on the album. Only four of the tracks from the main album had their live versions included on the second disc."]}, {"page": "Malcolm Green (musician)", "response": ["Green replaced Emlyn Crowther as Split Enz's drummer in London in 1976, winning an audition over ex-Sparks drummer Dinky Diamond. Green had formerly played with Love Affair, The Honeycombs (both of them long after their run of 1960s hits), and Octopus. He was joined in Split Enz by Octopus bassist Nigel Griggs, who replaced Mike Chunn."]}, {"page": "Rootin Tootin Luton Tapes", "response": ["# \"Creature Comforts\" (Tim Finn, Nigel Griggs) - 2:52", "# \"Livin' It Up\" # (Nigel Griggs) - 1:17", "*Nigel Griggs - bass"]}, {"page": "I Don't Wanna Dance (Split Enz song)", "response": ["* Nigel Griggs – bass"]}, {"page": "Lisa Edwards", "response": ["Turbo Luv Nuns was a group, in 1987, with Edwards on backing vocals, Ronnie Charles (ex-The Groop) on lead vocals, Peter Coughlan on bass guitar, Mark Greig (ex-Australian Crawl) on lead guitar and Des McKenna on drums. They issued an album, They Don't Know. She also provided vocals for Short Circuit's album, Waiting for the Big One (1988). In that year she joined with members of Schnell Fenster – Phil Judd on guitar, trumpet, keyboards and vocals; Nigel Griggs on bass guitar; Noel Crombie on drums and percussion; and Michael den Elzen on guitars, guitar synth, fretless guitar and keyboards – to form Noel's Cowards with Vika Bull on vocals; Michael Harris on fiddle; Wendy Matthews on lead vocals; and Louis McManus on mandolin. They provided six songs for the soundtrack of the feature film, Rikky and Pete (1988)."]}, {"page": "The Beginning of the Enz", "response": ["*Nigel Griggs – Bass (1980 version only)"]}]}}