{"wiki_id": "http://www.wikidata.org/entity/Q7032718", "itemLabel": "Nigel Wilson", "itemDescription": "businessperson", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Wilson_(businessman)", "wikipedia_page": {"main": "Sir Nigel David Wilson (born 17 November 1956) is a British businessman. He is the chief executive (CEO) of Legal & General, a British multinational financial services company.", "link_mentions": [{"page": "University of Warwick", "response": ["Warwick graduates are active in business. In the automotive industry, this includes Linda Jackson, CEO of Citroën; Andy Palmer, CEO of Aston Martin; Ralf Speth, CEO of Jaguar Land Rover; Sudarshan Venu, MD of TVS Motor Company;  Rajiv Bajaj, MD of Bajaj Auto.   Others include Bernardo Hees, CEO of the Heinz Company & former CEO of Burger King; Nigel Wilson, CEO of Legal & General; and Ian Gorham, CEO of Hargreaves Lansdown; Ness Wadia; Founding Managing Director of CSR Plc, Phil O’Donovan FREng; and Sajiv Bajaj – chairman, Bajaj Finance."]}, {"page": "Legal & General", "response": ["Dr Nigel Wilson (the previous CFO) became Group Chief Executive on 30 June 2012. He succeeded Tim Breedon, who had been CEO since 1 January 2006 and who was paid an annual salary of £770,000.", "Other senior management include Jeff Davies (Group Chief Financial Officer), Michelle Scrimgeour (CEO of Legal & General Investment Management, the investment management arm of the firm) and Kerrigan Procter, (CEO of the group's capital investment business). Together with Nigel Wilson they form Legal & General's executive board."]}, {"page": "Warwick Business School", "response": ["* Nigel Wilson, CEO of Legal & General Group plc"]}, {"page": "List of Massachusetts Institute of Technology alumni", "response": ["*Nigel Wilson – CEO of Legal & General"]}, {"page": "List of people with surname Wilson", "response": ["*Nigel Wilson (businessman) (born 1956), British businessman", "*Nigel Wilson (born 1970), Canadian baseball player"]}, {"page": "List of University of Warwick people", "response": ["*Nigel Wilson - CEO of Legal & General Group plc"]}]}}