{"wiki_id": "http://www.wikidata.org/entity/Q7032689", "itemLabel": "Nigel Vaughan", "itemDescription": "Welsh footballer (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Vaughan", "wikipedia_page": {"main": "Nigel Mark Vaughan (born 20 May 1959 in Caerleon) is a Welsh former professional footballer and Wales international. He gained ten international caps during his football career.", "link_mentions": [{"page": "Caerleon", "response": ["* Nigel Vaughan, Wales international footballer"]}, {"page": "Slade", "response": ["TV presenter Gareth Jones, also known as Gaz Top, is a known Slade fan who hosted the 1986 Slade documentary \"Slade Perseverance\". Jones also appeared at the 1986 and 1987 official Slade fan club conventions. Other famous Slade fans include English ex-football player Gary LinekerSlade International Fan Club newsletter June – July – August 1986 and Welsh football player Nigel Vaughan, whom Lea and Hill visited on Boxing Day 1989 at the football ground of Wolverhampton Wanderers.Slade International Fan Club newsletter January – February – March 1990"]}, {"page": "Newport County A.F.C.", "response": ["Also in the promotion-winning team was Tommy Tynan, one of the leading lower-league strikers of his era, who scored the all-important goal that sealed County's promotion. Dave Gwyther completed the trio of prolific goalscorers whilst captain Keith Oakes provided strength in central defence. Youth team products Steve Lowndes and Nigel Vaughan went on to attain international caps for Wales. This was also the year that County won the Welsh Cup, entitling them to play in the 1980–81 season European Cup Winners' Cup.", "The Newport County squad for the first leg was: 1 Gary Plumley, 2 Richard Walden, 3 John Relish, 4 Grant Davies, 5 Keith Oakes (Captain), 6 Tommy Tynan, 7 Nigel Vaughan, 8 Steve Lowndes, 9 Dave Gwyther, 10 Karl Elsey, 11 Kevin Moore, 12 Neil Bailey, 13 Steve Warriner, 14 Dave Bruton, 15 Bobby Ward, 16 Mark Kendall."]}, {"page": "Hereford United F.C.", "response": ["*  Nigel Vaughan"]}, {"page": "Vaughan (surname)", "response": ["*Nigel Vaughan (born 1959), Welsh professional footballer"]}, {"page": "Caerleon Comprehensive School", "response": ["Historic sportspeople who have attended the school include Wales, Chelsea F.C. and Swansea City goalkeeper Roger Freestone, Cardiff City F.C. and Wales midfielder Nigel Vaughan, Wales rugby winger Nick Walne, and prop Lyndon Mustoe. Others include Gary Hocking, a Grand Prix racing champion, as well as footballer and cricketer Len Hill.", "*Nigel Vaughan, Wales international footballer"]}, {"page": "John Lewis (footballer, born 1955)", "response": ["Lewis was born in Tredegar and was spotted by Cardiff City while playing for Pontllanfraith in a Welsh Football League match and was quickly offered a contract by then manager Jimmy Andrews. He made his Cardiff debut against Blackburn Rovers in September 1978. He went on to become a regular fixture in the Bluebirds line-up over the next few years before eventually leaving the club along with Linden Jones and Tarki Micallef to join Newport County in a swap deal that saw Nigel Vaughan and Karl Elsey go the other way and join Cardiff.Newport County A-Z of transfers"]}, {"page": "Karl Elsey", "response": ["He moved to Cardiff City in September 1983 in a move that saw Elsey and Nigel Vaughan join Cardiff from Newport in exchange for Tarki Micallef, John Lewis and Linden Jones. He played over 60 games for Cardiff before joining Gillingham on a free transfer in May 1985. He moved to Reading in August 1988 and, although virtually ever-present in the Reading side the following season, left to join Maidstone United in July 1989. He rejoined Gillingham in August 1991, but dropped out of league football in March 1992 when he joined Sittingbourne."]}, {"page": "Tarki Micallef", "response": ["The son of a Greek restaurateur, Micallef was born in the Grangetown area of Cardiff and was a Welsh schoolboy international before joining Cardiff City as a trainee, working his way up to the first team. Micallef made his debut in December 1978 at the age of seventeen against Sheffield United, which was to be his only appearance for the Bluebirds that year. Eventually, he established himself in the team during the 1981–82 season, but moved to Newport County as part of a five-man swap deal (including John Lewis and Linden Jones) in exchange for Nigel Vaughan and Karl Elsey in September 1983."]}, {"page": "Linden Jones", "response": ["In September 1983, Jones left the club as part of a remarkable exchange deal between Cardiff and Newport County. Nigel Vaughan and Karl Elsey joined the Bluebirds and Jones, along with John Lewis and Tarki Micallef, moved to Somerton Park in return. He was a regular for Newport until the club began suffering financial difficulties and he was allowed to join Reading. He eventually left the club in 1992 and moved into non-league football before fully retiring in 1996, at the age of 36, due to a severe knee injury."]}, {"page": "List of people from Newport", "response": ["* Nigel Vaughan"]}, {"page": "1988 Associate Members' Cup Final", "response": ["|MF ||12|| Nigel Vaughan || || "]}, {"page": "1979–80 Newport County A.F.C. season", "response": ["|MF ||7 || Nigel Vaughan", "|MF ||7 || Nigel Vaughan"]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Nigel Vaughan (3 caps)", "*  Nigel Vaughan* 224"]}, {"page": "Erin Vaughan", "response": ["Erin Louise Vaughan (born 15 February 1986) is a Welsh footballer. She plays as a midfielder for Aston Villa Ladies and the Wales women's national football team. She is the daughter of former Wales international footballer Nigel Vaughan. She now is a coach at ISC Gunners FC. "]}, {"page": "1980 Welsh Cup Final", "response": ["|MF ||7 || Nigel Vaughan", "|MF ||7 || Nigel Vaughan"]}, {"page": "List of Reading F.C. internationals", "response": ["|align=\"left\"|Nigel Vaughan||||10||0||1986–1987||1982–1984"]}, {"page": "1990–91 Wolverhampton Wanderers F.C. season", "response": ["|July 1990|| Nigel Vaughan||align=\"center\"|Hereford United||align=\"center\"|Free"]}]}}