{"wiki_id": "http://www.wikidata.org/entity/Q7032573", "itemLabel": "Nigel Paterson", "itemDescription": "British television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Paterson", "wikipedia_page": {"main": "Nigel Paterson is a Primetime Emmy Award-winning British television writer, director and producer.\n\n", "link_mentions": [{"page": "List of documentary films", "response": ["|Walking with...: Dinosaurs, Beasts, Caveman, Monsters †||1999–2005||Nigel Paterson and Andrew Wilks||Chloe Leland, Tim Haines, and Jasper James"]}, {"page": "Primetime Emmy Award for Outstanding Animated Program", "response": ["| Tim Haines & Mick Kaczorowski, executive producers; Jasper James, producer/writer; Nigel Paterson, producer/director/writer; Sharon Reed & William Sargent, computer animation executive producers; Mike Milne, computer animation director; Kate Bartlett & Michael Olmert, writers"]}, {"page": "Ilan Eshkeri", "response": ["| Nigel Paterson"]}, {"page": "Nuremberg: Nazis on Trial", "response": ["Written by directors Nigel Paterson, Paul Bradshaw and Michael Wadding, the three films were produced and shown by the BBC to commemorate the 60th anniversary of the Nuremberg War Trials. Each film centred on a different one of the senior Nazis that were on trial and tells the story of their crime and punishment."]}, {"page": "Planet Dinosaur", "response": ["Planet Dinosaur, is a six-part documentary television series created by Nigel Paterson and Phil Dobree, produced by the BBC, and narrated by John Hurt. It first aired in the United Kingdom in 2011, with VFX studio Jellyfish Pictures as its producer. It is the first major dinosaur-related series for BBC One since Walking with Dinosaurs. There are more than 50 different prehistoric species featured, and they and their environments were created entirely as computer-generated images, for around a third of the production cost that was needed a decade earlier for Walking with Dinosaurs. Much of the series' plot is based on scientific discoveries made since Walking with Dinosaurs. The companion book to Planet Dinosaur was released on 8 September 2011, and the DVD and Blu-ray were released on 24 October 2011.Planet Dinosaur (DVD) and Planet Dinosaur (Hardback). BBC Shop. Retrieved 1 November 2011."]}, {"page": "Killers of the Cosmos", "response": ["Wall to Wall Media produced Killers of the Cosmos. The executive producers for Wall to Wall Media were Tim Lambert and Jeremy Dear and for Discovery, Inc., were Caroline Perez, Abram Sitzer and Wyatt Channell. The series producer was Nigel Paterson. Ben Scott directed the episodes.IMDB Killers of the Cosmos: The Case of the Killer RocksIMDB Killers of the Cosmos: Death RayIMDB Killers of the Cosmos: Cosmic ScrapIMDB Killers of the Cosmos: Little Green MenIMDB Killers of the Cosmos: Dark StarIMDB Killers of the Cosmos: Big Sleep"]}]}}