{"wiki_id": "http://www.wikidata.org/entity/Q7032698", "itemLabel": "Nigel Walker", "itemDescription": "English footballer (1959-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Walker_(footballer)", "wikipedia_page": {"main": "Nigel Walker (7 April 1959 – 2 February 2014) was an English professional football midfielder. He played in The Football League for six clubs as well as the North American Soccer League and Major Indoor Soccer League. Walker's death, from  cancer, at the age of 54 was reported on 2 February 2014. After football, Nigel was a teacher at Greencroft Business and Enterprise Community School.", "link_mentions": [{"page": "February 2", "response": ["*  2014   – Nigel Walker, English footballer (b. 1959)"]}, {"page": "Nigel Walker (athlete)", "response": ["Nigel Walker (born 15 June 1963) is a former Welsh track and field athlete and Wales international rugby union player.  He is currently National Director at the English Institute of Sport (EIS). He was born in Cardiff."]}, {"page": "Tyne–Wear derby", "response": ["*Nigel Walker"]}, {"page": "John McGrath (footballer, born 1938)", "response": ["He became manager of Chester City in January 1984, who were struggling at the foot of the Fourth Division, but some improved results (including a derby win over Wrexham) gave cause for optimism for the following season. McGrath added experience in players such as John Butcher, Steve Fox, Mick Speight and Nigel Walker but Chester continued to struggle at the wrong end of the table. He lost his job in December 1984, after a 5–1 loss to Stockport County. Although results were not always impressive, McGrath began to mould the side that would to go on to win promotion in 1985–86 after further strengthening by Mick Speight and Harry McNally. McGrath gave future England international Lee Dixon his first taste of regular first-team football when at Chester."]}, {"page": "1959 in the United Kingdom", "response": ["*7 April – Nigel Walker, footballer (died 2014)"]}, {"page": "Tony Smith (footballer, born 1957)", "response": ["He was born in Sunderland but joined Newcastle United as a youth, and made his senior debut as a substitute for Nigel Walker against Wolverhampton Wanderers on 12 November 1977. He started the next match at home to Arsenal, but was not able to make any more senior appearances in a struggling team. Smith was transferred to Peterborough United in March 1979."]}, {"page": "2013–14 in English football", "response": ["* 2 February 2014: Nigel Walker, 54, former Newcastle United, Crewe Alexandra, Sunderland, Chester City and Hartlepool United midfielder."]}, {"page": "2014 in the United Kingdom", "response": ["**Nigel Walker, 54, footballer.", "**Nigel Walker, 97, criminologist, Wolfson Professor of Criminology."]}, {"page": "Deaths in February 2014", "response": ["*Nigel Walker, 54, English footballer (Newcastle United), cancer.Former Hartlepool United and Newcastle United star dies aged 54"]}, {"page": "1984–85 Chester City F.C. season", "response": ["||| style=\"text-align:left;\" | Nigel Walker"]}, {"page": "Nigel Walker", "response": ["Nigel Walker may refer to:", "*Nigel Walker (athlete) (born 1963), Welsh runner", "*Nigel Walker (criminologist) (1917–2014), English criminologist", "*Nigel Walker (footballer) (1959–2014), English footballer"]}]}}