{"wiki_id": "http://www.wikidata.org/entity/Q7038816", "itemLabel": "Ninia Benjamin", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ninia_Benjamin", "wikipedia_page": {"main": "Ninia Benjamin is a British comedian who makes frequent appearances at the Edinburgh Festival. Benjamin has also appeared on the TV shows 3 Non-Blondes and Twisted Tales.\nShe appeared on the Sky One show Cirque de Celebrité and was voted out in the sixth week. However, she remained as a personal trainer for Kenzie. She won the 2007 series of Celebrity Scissorhands, beating Aled Haydn Jones to the trophy. She was one of the contestants in Celebrity MasterChef 2008. She appeared on the British version of Hole in the Wall on 22 November 2008, on Anton du Beke's team, and again on 31 October 2009 on Joe Swash's team and also on Total Wipeout, where she was the slowest person ever to cross the course with a time of 11:11.\nShe provides the voices for the characters Eagle and Mosquito in BBC children's programme Tinga Tinga Tales.", "link_mentions": [{"page": "List of British comedians", "response": ["*Ninia Benjamin"]}, {"page": "3 Non-Blondes", "response": ["Ninia Benjamin, Tameka Empson and Jocelyn Jee Esien play a range of comical characters to the unsuspecting public,\"three non blondes\" , Michael Cumming website. varying from a fictional celebrity named Marcia Brown to a charity worker who only wants a kiss or a hug instead of a cash donation.", "*Ninia Benjamin – Herself"]}, {"page": "Joe McGann", "response": ["McGann appeared on tour with Fiddler on the Roof playing the paterfamilias, Tevye, in 2008 but left the show 2 months before the tour ended due to an arm injury sustained on stage. In 2009, he appeared on BBC's Celebrity MasterChef alongside Linda Barker and Ninia Benjamin and dropped out in the semi-finals. In May-June 2009, he appeared as Richard in \"Lost Monsters\" by Laurence Wilson at Liverpool's Everyman Theatre. As of 2011, he can be seen occasionally guest presenting STV's daily magazine show, The Hour, alongside regular host Michelle McManus."]}, {"page": "The Underdog Show", "response": ["|Ninia Benjamin"]}, {"page": "MasterChef (British TV series)", "response": ["* 2008: Liz McClarnon, Linda Robson, Louis Emerick, Debra Stephenson, Christopher Parker, Joe McGann, Steven Pinder, Mark Moraghan, Vicki Michelle, Sean Wilson, Clare Grogan, Hywel Simons, DJ Spoony, Claire Richards, Denise Lewis, Noel Whelan, Andi Peters, Andrew Castle, Michael Buerk, Kaye Adams, Julia Bradbury, Josie D'Arby and Ninia Benjamin.", ":There was also a week of Comeback contestants featuring Joe McGann, Marie Helvin, Linda Barker, Claire Richards, Rowland Rivron, Ninia Benjamin, Steven Pinder, Wendi Peters, Helen Lederer, Tony Hadley, Martin Hancock and Jeff Green."]}, {"page": "Aled Haydn Jones", "response": ["In November 2007, Jones appeared as a contestant in the BBC Three series Celebrity Scissorhands, in aid of charity Children in Need. The contestants had to learn how to cut hair and give various beauty salon treatments on volunteers, with the minimal amount of training. Jones eventually finished second in the contest, losing in the final to comedian Ninia Benjamin."]}, {"page": "Cirque de Celebrité", "response": ["| Ninia Benjamin", ": In Week 7, Ninia Benjamin was re introduced into the show as \"Kenzie's personal trainer.\" She also took part in the group performance and accompanied contestants off stage after each of their performances."]}, {"page": "Celebrity Scissorhands", "response": ["|bgcolor=\"lightgreen\"|Ninia Benjamin (Winner)"]}, {"page": "BBC New Comedy Award", "response": ["| 2002 || Nina Conti || DylanBob KobePaul KerensaGary DelaneyStefano PaoliniNinia BenjaminKarl Spain"]}, {"page": "Children in Need 2007", "response": ["A second series of Celebrity Scissorhands was shown in the run up to the 2007 event, this year featuring celebrity hairdresser Lee Stafford. The winner was Ninia Benjamin with Aled Haydn Jones as the runner up."]}, {"page": "Hole in the Wall (British game show)", "response": ["| Ninia BenjaminDominic Littlewood", "| Rufus HoundNinia Benjamin"]}, {"page": "Tinga Tinga Tales", "response": ["* Eagle (voiced by Ninia Benjamin)", "* Mosquito (voiced by Ninia Benjamin)"]}, {"page": "Total Wipeout", "response": ["The first, which aired on 18 September 2010, featured Michaela Strachan, Siân Lloyd, Joe Absolom, Antony Costa, Kate Lawler, Ninia Benjamin, Jeff Brazier, Iwan Thomas and Tony Tobin. Nancy Lam was supposed to take part, but had to pull out and spectate. Joe Absolom won, with Jeff Brazier and Kate Lawler coming second and third respectively."]}, {"page": "The Wam Bam Club", "response": ["* Ninia Benjamin"]}, {"page": "Wickham Festival", "response": ["| 2019 || || 1 August – 4 August || Judy CollinsLevel 42Frank TurnerGilbert O'Sullivan||Kiefer SutherlandGraham NashAlabama 3Ralph McTellThe Bar-Steward Sons of Val Doonican|| Fin TaylorAlistair BarrieNinia BenjaminDave JohnsBen NorrisClinton Baptiste"]}, {"page": "Michael Cumming", "response": ["In 2003, for the newly launched BBC 3, Cumming directed the first series of Three Non Blondes starring Jocelyn Jee Eisen, Tameka Empson and Ninia Benjamin. From 2004-5 he directed the first 2 series of the BAFTA nominated Mark Steel Lectures as well as two series of The Lenny Henry Show for BBC 1."]}]}}