{"wiki_id": "http://www.wikidata.org/entity/Q7037878", "itemLabel": "Nina Boyle", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nina_Boyle", "wikipedia_page": {"main": "Constance Antonina Boyle (21 December 1865 – 4 March 1943) was a British journalist, campaigner for women's suffrage and women's rights, charity and welfare worker, and novelist. She was one of the pioneers of women police officers in Britain. In April 1918, she was the first woman to submit a nomination to stand for election to the House of Commons, which paved the way for other female candidates in the December 1918 general election.\n\n", "link_mentions": [{"page": "1918 United Kingdom general election", "response": ["It was the first parliamentary election in which women were able to stand as candidates following the Parliament (Qualification of Women) Act 1918, believed to be one of the shortest Acts of Parliament ever given Royal Assent. The Act was passed shortly before Parliament was dissolved. It followed a report by Law Officers that the Great Reform Act 1832 had specified parliamentary candidates had to be male and that the Representation of the People Act passed earlier in the year did not change that. One woman, Nina Boyle, had already presented herself for a by-election earlier in the year in Keighley but had been turned down by the returning officer on technical grounds.Hallam, David J.A., Taking on the Men, the first women parliamentary candidates 1918, Studley, 2018, p 11-12"]}, {"page": "Women's Freedom League", "response": ["In 1912, Nina Boyle became head of the WFL's political and militant department.R M Douglas, Feminist freikorps: the British voluntary women police, 1914–1940 ; Praeger, 1999 p. 10 She published many articles in the WFL's newspaper, The Vote. Boyle started a campaign for women to become Special Constables. This campaign coincided with the outbreak of the First World War in 1914 and the call for volunteers for the war effort which Boyle wished to see taken up by women as well as men.The Times, 15 August 1914 p. 9 When the request was officially refused, Boyle, together with Margaret Damer Dawson, a wealthy philanthropist and herself a campaigner for women's rights, established the first voluntary women's police force-the Women Police Volunteers (WPV)."]}, {"page": "Charlotte Despard", "response": ["She was an active Catholic and on Ash Wednesday in 1907, she went with others to the House of Commons and got arrested. In establishing WFL, Despard was joined by Teresa Billington-Greig and Edith How-Martyn, Alice Abadam, Marion Coates-Hansen, Irene Miller, Bessie Drysdale, Maude Fitzherbert as signatories to a letter to Emmeline Pankhurst explaining their disquiet on 14 September 1907. In 1911, when first imprisoned with Nina Boyle, Despard was furious when someone paid the fines, allowing them to be released right away; Boyle remarked upon her 'complete and absolute fearlessness'."]}, {"page": "Parliament (Qualification of Women) Act 1918", "response": ["In March 1918 Swire Smith, the Liberal MP for Keighley died, causing a by-election on 26 April. There was doubt as to whether women were eligible to stand for parliament. Nina Boyle made known her intention to stand as a candidate for the Women's Freedom League at Keighley and, if refused, to take the matter to the courts for a definitive ruling.The Times, 4 April 1918 p. 3 After some consideration, the returning officer stated that he was prepared to accept her nomination, thus establishing a precedent for women candidates. However, he ruled her nomination papers invalid on other grounds: one of the signatories to her nomination was not on the electoral roll and another lived outside the constituency.The Times, 10 April 1918 p. 3  The Law Lords were asked to consider the matter and concluded that the Great Reform Act 1832 had specifically banned women from standing as parliamentary candidates and the Representation of the People Act had not changed that."]}, {"page": "Lilian Lenton", "response": ["Just before the First World War Lenton met author D. H. Lawrence when she fled from the police and escaped to the Lake District. He was introduced to her as \"a man who's only got one subject, and that's sex\".Lenton interview of 1960 from the BBC Archive During World War I Lenton served in Serbia with the Scottish Women's Hospitals Unit and was awarded a French Red Cross medal. After the Russian Revolution she travelled in Russia with fellow suffragette Nina Boyle. June Purvis and Sandra Stanley Holton Votes for Women (Routledge, 2000), p. 196  Lenton later worked in the British Embassy in Stockholm. She was a speaker for the Save the Children Fund, and from 1924 to 1933 was a speaker and travel organiser for the Women's Freedom League, as well as the editor of the League's Bulletin for over 11 years. After working in Scotland in animal welfare Lenton became the financial secretary of the National Union of Women Teachers until 1953."]}, {"page": "Mary Fitzgerald (trade unionist)", "response": ["The Sinnotts and Fitzgeralds later moved to Johannesburg. There Mary became a typist for the Mine Workers Union. She witnessed the appalling conditions of the miners and soon became actively involved speaking herself at union gatherings. Though a short, quietly spoken woman she captivated her audience with her brilliant oration. She developed a firm friendship with suffragette Nina Boyle and became a pioneer in organising unions for women and in the fight for women’s votes and for equality of pay and opportunity."]}, {"page": "Mary Sophia Allen", "response": ["thumb|290x290px|At the outbreak of the First World War, militant suffragist activities ceased. Allen turned down an offer of work with a needlework guild (see for example Queen Mother's Clothing Guild) and looked around for a more active occupation. She heard that a number of women were trying to set up a women's police force and, in 1914, she joined Nina Boyle's Women Police Volunteers. This was taken over by Margaret Damer Dawson in 1915 and renamed the Women Police Service (WPS), with Allen as second-in-command. They designed their own uniform and opened training schools in London and Bristol. They saw their role as mainly dealing with women and children and rescuing women from \"vice\" (prostitution) and 'white slavery'. Allen served at Grantham and Kingston upon Hull, overseeing the morals of women in the vicinity of army barracks. She went on to police munitions factories which employed large numbers of women. She also worked in London, where 'khaki fever' was perceived as a problem. Child welfare work led the WPS to set up a benevolent department and a home for mothers and babies. Allen was awarded the OBE for services during the War."]}, {"page": "Nina (name)", "response": ["*Nina Boyle, nickname of Constance Antonina Boyle (1865–1943), British journalist"]}, {"page": "Constance Antonina (Nina) Boyle", "response": ["#REDIRECT Nina Boyle"]}, {"page": "Constance Antonina Boyle", "response": ["#REDIRECT Nina Boyle"]}, {"page": "Edith Smith (police officer)", "response": ["Founded in 1914, the Women Police Volunteers (WPV) was staffed by volunteers such as Smith. It was founded by Nina Boyle and Margaret Damer Dawson, who fell out over its anti-prostitution role in London and elsewhere in February 1915, with Boyle leaving the organisation and Dawson reforming it as the Women's Police Service (WPS) with herself as head. Smith remained with the WPS and in August 1915 she was appointed the first woman police constable in England with full power of arrest. Her duties were to deal with cases where women were involved. She was concerned with trying to reduce the number of prostitutes in Grantham who were attracted there by the nearby army base. She received 28 shillings (£1.40) a week. In April 1917 this was raised to £2 10 shillings (£2.50 a week). This was more than the oldest male police constable in the force due to the fact that her \"duties were most onerous\", and took into account that she was also a qualified nurse."]}, {"page": "1918 Keighley by-election", "response": ["At one point it looked as if there would be a woman candidate in the field. Nina Boyle, a journalist and well-known campaigner for women's suffrage and women's rights made known her intention to put up at the by-election as a candidate of the Women's Freedom League.  Although women over thirty gained the vote in 1918, there was some doubt as to whether women were eligible to stand as parliamentary candidates. Boyle announced that she would test the law and if her nomination was refused would take the matter to the courts to obtain a definitive ruling.The Times, 4 April 1918 p. 3 After some legal consideration, the returning officer stated that he was prepared to accept her nomination, thus establishing an important precedent for women candidates. However he ruled her nomination papers invalid on other grounds: one of the signatories to her nomination was not on the electoral roll and another lived outside the constituency. While Boyle did not therefore get to appear on the ballot paper, she claimed a moral victory for women's suffrage.The Times, 10 April 1918 p. 3 The Law Lords were asked to consider the matter and concluded that the Great Reform Act 1832 had specifically banned women from standing as parliamentary candidates. The Representation of the People Act passed earlier in the year, did not change that."]}, {"page": "Margaret Damer Dawson", "response": ["In 1914 she and Nina Boyle founded the Women Police Volunteers (WPV), but a year later the pair split due to disagreements over the organisation's role. Dawson founded and led a new organisation, the Women's Police Service (renamed the Women's Auxiliary Service after the First World War), though Boyle's WPV continued some patrols. Dawson and her second-in-command Allen were both awarded an Order of the British Empire in 1918."]}, {"page": "National Council of Women of Great Britain", "response": ["*Nina Boyle"]}, {"page": "Sixth Conference of the International Woman Suffrage Alliance", "response": ["Although the official languages of the Alliance were French, German and English, a crowded meeting was held one evening in the People's House with the speeches in Scandinavian languages. It was opened by Mayor Lindhagen, an ardent advocate of woman suffrage. At another session the Woman Question in the Russian Parliament was considered by Dr. Shiskin-Yavein; the Suffrage Outlook in Bohemia by Miss Maria Tumova, recent candidate for Parliament; the Future of South African Women by Nina Boyle. A special meeting was held one afternoon in the hall of the Young Women's Christian Association. Marie Stritt, Germany; Maria Verone, France, and Miss Macmillan were appointed to compile a pamphlet of information about woman suffrage in all lands to be used for propaganda work."]}, {"page": "Women in policing in the United Kingdom", "response": ["*Women's Police Volunteers, later known as the Women's Police Service - established by Margaret Damer Dawson and Nina Boyle in 1914. They had joined forces after seeing the trouble faced by refugees during the war. These volunteer women were allowed to officially patrol the streets of London and policemen were asked to assist them. They were trained and they were intended to assist women during the turmoil of the war. It later provided women officers to police the government munitions factories.\\Allen, Mary S. (1925) The Pioneer Policewoman (London: Chatto and Windus) "]}, {"page": "Ada Wright", "response": ["In her will Wright left a picture to her friend, the actress Adeline Bourne (1873-1965), £100 (£ in  sterling) to Evie Hamill (sister of Cicely Hamilton), £150 (£ in  sterling) to Nina Boyle, £200 (£ in  sterling) to Flora Drummond to carry on with the welfare of animals campaign, £500 (£ in  sterling) to Rosamund Massy, £1,600 to Christabel Pankhurst (£ in  sterling)."]}, {"page": "Edith Watson (police officer)", "response": ["Watson had joined the Women's Freedom League in 1911. She continued the league's non-violent methods by writing for the left-wing Daily Herald under the title of Sketches in Green, Gold and White. She and Nina Boyle wrote for \"The Vote\", where they argued against the injustices of a male-dominated legal system. Women victims needed to be cared for by women police and courts should realise that they could not expect women to give evidence in a court that was a room full of men. Watson decided to document what she saw as unfair practise. She was employed as the Court correspondent for \"The Vote\" and she recorded the crimes or rape, sexual assault and incest ironically under the title of \"The Protected Sex\". She catalogued the sentences given to the perpetrators noting that prostitutes could get nine months for approaching clients whereas a man guilty of grievously harming a woman might get a third of the sentence. She started this in 1912 and continued for three years to compare the sentences with those handed down for loss or damage to property. Boyle and Watson went to Marlborough Street Police Court in 1914 and made a more militant protest. Watson was amongst other who were arrested for chaining themselves to the gates."]}, {"page": "Inter-Allied Women's Conference", "response": ["On 11 February, a delegation led by chair Millicent Fawcett, a leader in the British suffrage movement and president of the National Union of Women's Suffrage Societies, called on Wilson.  The delegation included Zabel Yesayan of Armenia, who brought a report about women in Armenia and Macedonia being captured during the war and detained in harems; Margherita Ancona, president of the National Pro Suffrage Federation for Italy; and Nina Boyle (Union of South Africa), a member of the Women's Freedom League and a journalist. Belgian delegates included Jane Brigode, president of the Belgian Federation for Suffrage and Marie Parent, president of the Belgian National Council of Women and League for Rights of Women. Also present were British delegates Ray Strachey, a member of the National Union of Women's Suffrage Societies and Rosamond Smith. The French women who participated in the delegation were de Witt-Schlumberger; Cécile Brunschvicg, a founder of the French Union for Women's Suffrage and its first general secretary; and Marguerite Pichon-Landry, chair of the legislation section of the National Council of French Women. The delegates from the US were Katharine Bement Davis, head of the US government's Women's Department of Social Hygiene; Florence Jaffray Harriman, chair of the Women's Committee of the Democratic Party; and Juliet Barrett Rublee, a member of the National Birth Control League and the Cornish [New Hampshire] Equal Suffrage League. The delegation asked if a Women's Commission could be included in the conference to address the concerns of women and children. At the meeting Wilson suggested, instead, that the male diplomats from the peace conference form a Women's Commission to which the Inter-Allied Women's Conference could serve as advisers."]}, {"page": "Women's Police Service", "response": ["It was originally established as the Women Police Volunteers (WPV) in 1914 by Nina Boyle and Margaret Damer Dawson, who had met when Damer Dawson was working for the Criminal Law Amendment Committee in 1914. Before the First World War, campaigners for women's rights proposed that there should be female as well as male police officers, but the outbreak of war prevented any progress. Both Boyle and Damer Dawson observed the trouble faced in London by Belgian and French refugees in London after the initial German advance, particularly the danger of their being recruited for prostitution on arrival at railway stationsMargarget Damar Dawson, Spartacus-Education, retrieved 19 July 2014 They were also concerned about existing prostitutes loitering near railway stations used by the increasing number of servicemen passing through the capital.", "Margaret Jackson, The real facts of life: feminism and the politics of sexuality, c 1840-1940; Taylor & Francis, 1994 p. 51 Nina Boyle led the organisation with Dawson as assistant. The volunteer women were allowed to officially patrol the streets of London and to assist women in need, with men of the Metropolitan Police and other forces asked to assist them. Boyle herself was one of the first women to appear in a police uniform.Elizabeth Crawford, Nina Boyle in The Women's Suffrage Movement: a reference guide, 1866-1928; UCL Press, 1999 p. 75"]}, {"page": "Sofia Stanley", "response": ["The Metropolitan Women Police Patrols were officially launched on 17 February 1919.  Its officers were not given the power to arrest and operated based on the style of Stanley's patrols rather than the WPS, which the Commissioner believed had links to the Suffragette Nina Boyle. Stanley was put in control of the patrols with the specially-created rank of Supervisor. By February 1919 fifty women had been recruited, rising to 112 by 1922. The Geddes Axe recommended their complete abolition but Stanley worked with the first woman MP to take her seat, Nancy Astor, to force the Home Secretary Edward Shortt to leave a cadre of 20 women. However, one of the Patrols' early officers Lilian Wyles complained against Stanley's tactics, leading to a disciplinary enquiry which found Stanley guilty of intriguing against Shortt and then attempting to cover this up. As a result she was dismissed and her role as the head of women in the Met given instead to Bertha Clayden."]}, {"page": "Clara Lambert", "response": ["During the war, the Women's Social and Political Union stopped their demonstrations and Lambert joined the organisation started by Nina Boyle and Margaret Damer Dawson and called the Women's Police Service. She was directed by the WPS to work with the women munition workers in Pembury in Wales, and there she met her life partner Violet Louise Croxford who had been a mental health nurse before the war."]}]}}