{"wiki_id": "http://www.wikidata.org/entity/Q7032310", "itemLabel": "Nigel Colman", "itemDescription": "British Member of Parliament (1886-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Colman", "wikipedia_page": {"main": "Sir Nigel Claudian Dalziel Colman, 1st Baronet (4 May 1886 – 7 March 1966) was a British businessman and Conservative Party politician.", "link_mentions": [{"page": "Bentley Wood", "response": ["In 1950 Bentley Wood was acquired by the Forestry Commission, which undertook a large replanting programme to fill in the spaces that had been cleared to accommodate military facilities in the WWII period. In 1983 the UK Government decided to sell much of the woodland owned by the Forestry Commission, including Bentley Wood. A local resident, Lady Ann Colman, widow of  Sir Nigel Colman, formed a trust with the purpose of purchasing Bentley Wood for the public, which was achieved shortly before her death in 1984."]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Nigel Colman "]}, {"page": "Marcus Lipton", "response": ["He was elected as the Member of Parliament (MP) for Brixton in the 1945 general election, defeating the sitting Conservative Party MP Nigel Colman. He retained the seat at each subsequent election until it was abolished at the February 1974 general election. He was subsequently elected as MP for the successor seat of Lambeth Central, remaining in the Commons until his death."]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|Nigel Colman "]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|Nigel Colman"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Nigel Colman "]}, {"page": "Brixton (UK Parliament constituency)", "response": ["| Nigel Colman", "*Conservative: Nigel Colman"]}, {"page": "Colman baronets", "response": ["The Colman Baronetcy, of Reigate in the County of Surrey, was created in the Baronetage of the United Kingdom on 29 January 1952 for Nigel Colman, Conservative Member of Parliament for Brixton from 1927 to 1945. The title became extinct on his death in 1966."]}, {"page": "Sir Nigel Colman, 1st Baronet", "response": ["#REDIRECT Nigel Colman"]}, {"page": "Sir Nigel Claudian Dalziel Colman, 1st Baronet", "response": ["#REDIRECT Nigel Colman "]}, {"page": "Nigel Claudian Dalziel Colman", "response": ["#REDIRECT Nigel Colman "]}, {"page": "1927 Brixton by-election", "response": ["* Nigel Colman, the Unionist Party candidate was a business man, a breeder and exhibitor of light horses and represented Brixton on the London County Council."]}, {"page": "Deaths in March 1966", "response": ["* Sir Nigel Colman, 1st Baronet, British politician, MP (b. 1886)"]}, {"page": "Brixton (London County Council constituency)", "response": ["| Nigel Colman"]}]}}