{"wiki_id": "http://www.wikidata.org/entity/Q703932", "itemLabel": "Alan Smith", "itemDescription": "English former professional footballer and current sports television pundit, born 1962", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Smith_(footballer,_born_1962)", "wikipedia_page": {"main": "Alan Martin Smith (born 21 November 1962) is an English former professional footballer who played as a striker. He is currently a co-commentator, and sometimes studio pundit for Sky Sports.", "link_mentions": [{"page": "Gary Lineker", "response": ["However, he became a regular player in 1981–82, scoring 19 goals in all competitions that season. Although Leicester missed out on promotion, they reached the semi-finals of the FA Cup, and clinched promotion a year later as Lineker scored 26 times in the Second Division. In 1983–84, he enjoyed regular First Division action for the first time and was the division's second-highest scorer with 22 goals, although Leicester failed to finish anywhere near the top of the league. He was the First Division's joint top scorer in 1984–85 with 24 goals, and was enjoying a prolific partnership with Alan Smith. However, by this stage he was attracting the attention of bigger clubs, and a move from Filbert Street was looking certain.", "He retired from international football with eighty caps and forty-eight goals, one fewer goal than Sir Bobby Charlton's England record (which Charlton accrued over 106 caps). In what proved to be his last England match, against Sweden at Euro 92, he was substituted by England coach Graham Taylor in favour of Arsenal striker Alan Smith, ultimately denying him the chance to equal—or even better—Charlton's record. He had earlier missed a penalty that would have brought him level, in a pre-tournament friendly against Brazil. He was visibly upset at the decision, not looking at Taylor as he took the bench."]}, {"page": "November 21", "response": ["*  1962   – Alan Smith, English football player"]}, {"page": "Marco van Basten", "response": ["Former Arsenal player Tony Adams described Van Basten as the toughest and most difficult opponent he had ever faced in 2006, stating: \"He’s the quickest 6 ft 3 in centre-forward I’ve ever seen! Just awesome. He was as quick as Ian Wright, as good in the air as Joe Jordan and he held the ball up better than Alan Smith. I put him in front of Maradona. Technically, Maradona was brilliant and he had amazing feet, but Van Basten could head, volley – he had power and strength.\" Fellow former defender Giuseppe Bergomi also described Van Basten as the strongest player he ever faced in 2018, commenting: \"The best player of all time for me [...] is Maradona, but the strongest player I ever faced was Van Basten because at least I could beat Maradona to the ball with my head.\""]}, {"page": "Thierry Henry", "response": [" At his physical peak from the late 1990s to the mid 2000s, Henry's ability to dribble past opponents with exceptional pace, skill and composure, meant that he could get in behind defenders regularly enough to score.Hansen, Alan (13 March 2006) Alan Hansen's column\". BBC Sport. Retrieved 1 January 2012. In 2004, former Arsenal striker Alan Smith commented on Henry: \"I have to say I haven't seen a player like him. He's an athlete with great technical ability and a tremendous desire to be the best.\""]}, {"page": "Ian Wright", "response": ["Taylor, who became England manager after the 1990 World Cup in Italy and remained in charge for 38 matches, only handed Wright nine starts and seven substitute appearances. He opted instead to use a whole host of less prolific strikers, including Nigel Clough of Nottingham Forest, Paul Stewart of Tottenham Hotspur, David Hirst of Sheffield Wednesday and Brian Deane of Sheffield United. Wright did not make it into the squad for Euro 1992, with Clough, Gary Lineker of Tottenham Hotspur, Alan Shearer of Southampton and Arsenal teammates Alan Smith and Paul Merson preferred. This was particularly surprising as Wright had been the highest top division goalscorer in England that season."]}, {"page": "Leicester City F.C.", "response": ["Frank McLintock, a noted player for seven years for Leicester in a successful period from the late Fifties to the mid Sixties, succeeded Jimmy Bloomfield in 1977. City were relegated at the end of the 1977–78 season and McLintock resigned. Jock Wallace resumed the tradition of successful Scottish managers (after Peter Hodge and Matt Gillies) by steering Leicester to the Division Two championship in 1980. Wallace was unable to keep Leicester in Division One, but they reached the FA Cup semi-final in 1982. Under Wallace, one of City's most famous home-grown players, Gary Lineker, emerged into the first team squad. Leicester's next manager was Gordon Milne, who achieved promotion in 1983. Lineker helped Leicester maintain their place in the First Division but was sold to Everton in 1985 and two years later Leicester were relegated, having failed to find a suitable replacement to partner Alan Smith, who was sold to Arsenal after Leicester went down.", "*  Alan Smith 84"]}, {"page": "George Graham (footballer, born 1944)", "response": ["Arsenal finished fourth in Graham's first season in charge, and they went on to win the 1987 League Cup, beating Liverpool 2–1. While Arsenal lost the League Cup final the following year (a shock 3–2 defeat to Luton Town), they remained consistent in the league. Graham's side featured tight defensive discipline, embodied by his young captain Tony Adams, who along with Lee Dixon, Steve Bould and Nigel Winterburn, would form the basis of the club's defence for over a decade. However, contrary to popular belief, during this time Arsenal were not a purely defensive side; Graham also built up an impressive midfield containing David Rocastle, Michael Thomas and Paul Merson, and striker Alan Smith, whose prolific goal-scoring regularly brought him more than 20 goals per season.", "At the end of Graham's third season (1988–89), the club won their first League title since 1971 (when Graham had been an Arsenal player), in highly dramatic fashion, in the final game of the season against holders and league leaders Liverpool at Anfield. Arsenal needed to win by two goals to take the title; Alan Smith scored early in the second half to make it 1–0, but as time ticked by Arsenal struggled to get a second, and with the 90 minutes elapsed on the clock, they still needed another goal. With only seconds to go, a Smith flick-on found Michael Thomas surging through the Liverpool defence; the young midfielder calmly lifted the ball over Bruce Grobbelaar and into the net, and Arsenal were League Champions. However, there was no chance to enter the European Cup just yet for Graham's team, as the ban on English clubs in European competitions (which was imposed by UEFA in 1985 following the Heysel disaster) continued for another season.", "Graham's Arsenal became cup specialists, and in 1992–93 they became the first side to win the FA Cup and League Cup double, both times beating Sheffield Wednesday, 2–1 in the League Cup Final and 2–1 in the FA Cup Final replay. The next season they continued in the same vein, winning the UEFA Cup Winners' Cup, their second European trophy; in the final Arsenal beat favourites and holders Parma 1–0 with a tight defensive performance and Alan Smith's 21st-minute goal from a left foot volley."]}, {"page": "FIFA (video game series)", "response": ["John Motson was the first commentator for the FIFA series, and has worked alongside Ally McCoist, Andy Gray, Des Lynam, Mark Lawrenson and Chris Waddle. Motson first joined the franchise for FIFA 96; he and McCoist were replaced by Gray and Clive Tyldesley for FIFA 06 but later returned for FIFA Manager 08. Martin Tyler was the default commentator for the FIFA series from 2006 to 2020, alongside Andy Gray between 2006 and 2010 and Alan Smith from 2011 to 2020. Derek Rae and Lee Dixon took over in FIFA 21.", "FIFA 19 introduces the UEFA Champions League, Europa League, and UEFA Super Cup competitions to the game. Martin Tyler and Alan Smith return as regular commentators, while the new commmetary team of Derek Rae and Lee Dixon feature in the UEFA Champions League. Composer Hans Zimmer and rapper Vince Staples recorded a new remix of the UEFA Champions League anthem specifically for FIFA 19, and it featured in the reveal trailer. The character Alex Hunter (who first appeared in FIFA 17) returns for the third and final instalment of \"The Journey.\" The game includes the Chinese Super League, the first FIFA title to do so. The game is programmed with new kick off modes - house rule, survival mode, no rules, long range, header and volley, and first to mode.", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith and Clive Tyldesley, Andy Townsend", "|Martin Tyler, Alan Smith", "|Martin Tyler, Alan Smith and Derek Rae, Lee Dixon", "|Martin Tyler, Alan Smith and Derek Rae, Lee Dixon"]}, {"page": "Hollywood, Worcestershire", "response": ["*Alan Smith, former Arsenal and Leicester City striker."]}, {"page": "Andy Gray (footballer, born 1955)", "response": ["After leaving coaching, Gray became a football commentator, pundit, and analyst on Sky Sports, serving as a Scottish facet of its Premier League coverage since its inception in 1992, most notably alongside studio anchor Richard Keys and lead match commentators Martin Tyler and Ian Darke. In addition, he reported for Sky from Euro 2004 in Portugal, although Sky did not have broadcast rights for the games. He commentated for BBC Radio 5 Live in the 2002 World Cup and for ESPN in Euro 2008. Gray also provides betting tips for Betfair, and also provided commentary for the EA Sports FIFA series of video games along with Clive Tyldesley and Martin Tyler from FIFA 06 to FIFA 11, until being replaced in FIFA 12 by Sky Sports pundit Alan Smith."]}, {"page": "John Hartson", "response": ["Along with Chris Kiwomya, Hartson was one of George Graham's last signings before the manager's sacking in February 1995. He made his Arsenal debut on 14 January 1995, a 1–1 home draw with Everton, and scored his first goal for the club the following week, the only goal in a 1–0 away win at Coventry City. He was a regular for the remainder of his first season, a highlight of which was scoring Arsenal's 75th-minute equaliser in the 1995 UEFA Cup Winners' Cup Final against Real Zaragoza; however a last-minute goal from 40 yards by Nayim over David Seaman meant Arsenal lost the game 2–1. He was strike-partner to Ian Wright, being favoured ahead of Kevin Campbell to fill the gap left by the injured Alan Smith, who retired at the end of the season."]}]}}