{"wiki_id": "http://www.wikidata.org/entity/Q7032564", "itemLabel": "Nigel Noble", "itemDescription": "English Sound mixer, Film director, Film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Noble", "wikipedia_page": {"main": "Nigel Noble (born 1943) is an English sound mixer, film director and producer. He won an Academy Award in 1982 for Close Harmony in the category of Best Documentary Short Subject. Seven years later his film Voices of Sarafina! was screened in the Un Certain Regard section at the 1989 Cannes Film Festival.", "link_mentions": [{"page": "Academy Award for Best Documentary (Short Subject)", "response": ["| Nigel Noble"]}, {"page": "List of Sundance Film Festival selections", "response": ["|Nigel Noble", "|Nigel Noble"]}, {"page": "54th Academy Awards", "response": ["*Close Harmony – Nigel Noble"]}, {"page": "51st Directors Guild of America Awards", "response": ["* Nigel Noble – Great Performances for \"Porgy and Bess: An American Voice\""]}, {"page": "Michael Bacon (musician)", "response": ["**The Man who Loved Sharks (Nigel Noble) 1992 ACE Award Nominee-Best Original Score"]}, {"page": "Close Harmony (1981 film)", "response": ["Close Harmony is a 1981 American short documentary film directed by Nigel Noble, which won the Academy Award for Best Documentary (Short Subject) at the 54th Academy Awards. The film chronicles how a children's choir of 4th- and 5th-graders at the Brooklyn Friends School and elderly retirees at a Brooklyn Jewish seniors' center combine to give an annual joint concert.", "Category:Films directed by Nigel Noble"]}, {"page": "T. J. Parsell", "response": ["*CRISIS, Sickle Cell Anemia, 2008 (edited by Parsell, directed by Nigel Noble)", "*Teenage & Homeless in America (edited by Parsell, directed by Nigel Noble)"]}, {"page": "A Stitch for Time", "response": ["A Stitch for Time is a 1987 documentary film directed by Nigel Noble. The film documents the making of the National Peace Quilt.A stitch for time : the Boise Peace Quilt Project (DVD video, 2002) - WorldCat.orgThe Clarion (Spring/summer 1986) by American Folk Art Museum - issuu", "Category:Films directed by Nigel Noble"]}, {"page": "1989 Cannes Film Festival", "response": ["* Voices of Sarafina! by Nigel Noble"]}, {"page": "Voices of Sarafina!", "response": ["Voices of Sarafina! is a 1988 American documentary film about the anti-apartheid musical stage play Sarafina! directed by Nigel Noble. It was screened in the Un Certain Regard section at the 1989 Cannes Film Festival.", "Category:Films directed by Nigel Noble"]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Nigel Noble"]}, {"page": "Fillmore: The Last Days", "response": ["*Recording: Nigel Noble"]}, {"page": "Directors Guild of America Award for Outstanding Directing – Documentaries", "response": ["|Nigel Noble || Great Performances for \"Porgy and Bess: An American Voice\""]}, {"page": "The Ribbon International", "response": ["The Ribbon International is a United Nations non-governmental organization that created a large decorated cloth promoting nuclear disarmament and care and protection of the earth. In an event held on August 4, 1985, panels were connected in an  long strip stretching from the Pentagon into Washington D.C. The event was covered in the film The Ribbon Starts Here by Nigel Noble (1988). Individual sections of the Ribbon are exhibited internationally. In 1991, The Ribbon International became a United Nations Non Governmental Organization. Ribbon events can be held for special designated days such as the International Day of Peace (September 21), Earth Day (April 21), special prayer days or other events. Panels from the Ribbon were displayed at the United Nations Decade for Women international conference in Nairobi in 1985, and others were used by members of Women for a Meaningful Summit at their demonstration at the Geneva Summit (1985). Ribbons were used at peace demonstrations at the Nevada Nuclear Test Site, and the Horse Creek Missile Silo near Cheyenne, Wyoming, and the Great Peace March for Global Nuclear Disarmament in 1986.", "Video filming was done by numerous individuals, and professional television video personnel from New York and Washington, D.C., who donated their time and equipment to create a documentary about the event. The documentary film The Ribbon Starts Here, was produced by Academy Award-winning film maker Nigel Noble, and directed by Nigel Noble and Hilary Raff Lindsay; Nobel Enterprises. The video was released in 1988."]}, {"page": "2nd Grande Prêmio Cinema Brasil", "response": ["** Os Carvoeiros – Nigel Noble/ Les Zazen Produções"]}, {"page": "Steven Poster", "response": ["| Carol SauvionDaniel SeegerNigel NobleHilary Birmingham"]}]}}