{"wiki_id": "http://www.wikidata.org/entity/Q7032306", "itemLabel": "Nigel Colborn", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Colborn", "wikipedia_page": {"main": "Nigel Colborn VMH is a British TV presenter and gardening expert/writer. He is a former presenter of the long running BBC Gardeners World. He is often a panelist on BBC Radio 4’s Gardeners Question Time and is a regular presenter of Granada TV’s Gorgeous Gardens.\nHis mother was the nursery woman Pamela Underwood.He wrote and presented BBC Radio 4’s 'In a Monastery Garden'. He has written many gardening books, including 'Short Cuts to Great Gardens'; 'Great Plants for Small Gardens'; 'A Flower for Every Day'. As a journalist he has written about gardening, travel and the countryside for The Daily Mail, The Times, Sunday Times and also on his own blog, Silver Tree Daze.\nHe is a trustee & Vice Chair of The Royal Horticultural Society and has judged at the Chelsea Flower Show.", "link_mentions": [{"page": "Gardeners' Question Time", "response": ["Past participants have included John Cushnie, Dr Stefan Buczacki, David Burges, Fred Downham,  Professor Alan Gemmell, Walter Gilmore, Jill Hicking, Clay Jones, Nigel Colborn, Daphne Ledward, Fred Loads, Bridget Moody, Martin Fish, David Jones, Sue Phillipps, Geoffrey Smith, Sid Robertson, and Bill Sowerbutts."]}, {"page": "Gardeners' World", "response": ["Alys Fowler, Chris Baines, Chris Beardshaw, Mary Spiller, Liz Rigby, Diarmuid Gavin, Clay Jones, Stefan Buczacki, Christine Walkden, Sarah Raven, Gay Search, Anne Swithinbank, Nigel Colborn, Geoffrey Smith, Roy Lancaster, Peter Seabrook, Joe Swift, Ali Ward, Pippa Greenwood, Rachel de Thame, Advolly Richmond, Frances Tophill, Carol Klein, Bob Flowerdew, Mark Lane, Adam Frost, Arit Anderson, John Kelly, Nick Bailey, Flo Headlam and Arthur Parkinson."]}, {"page": "King's Ely", "response": ["*Nigel Colborn, broadcaster and gardening expert, former presenter of BBC Gardeners' Question Time"]}, {"page": "Victoria Medal of Honour", "response": ["**Nigel Colborn"]}, {"page": "In a Monastery Garden (disambiguation)", "response": ["*In a Monastery Garden, a BBC Radio 4 gardening programme presented by Nigel Colborn"]}, {"page": "Colborn", "response": ["*Nigel Colborn, British Television presenter and gardening expert/writer"]}]}}