{"wiki_id": "http://www.wikidata.org/entity/Q7032416", "itemLabel": "Nigel H. Jones", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_H._Jones", "wikipedia_page": {"main": "Nigel Jones (born 1951) is a British historian, journalist and biographer.", "link_mentions": [{"page": "January Club", "response": ["The Club was under the effective control of Robert Forgan, working on behalf of the BUF. The founders as identified by MI5Stephen Dorril, Blackshirt (2006), p.258. were Forgan, Donald Makrill, Francis Yeats-Brown and H. W. Luttman-Johnson. Members of the January Club included Wing-Commander Sir Louis Greig; Lord Erskine, a Conservative and Unionist MP and assistant Government whip; Lord William Montagu-Douglas-Scott, brother of the 8th Duke of Buccleuch and Conservative and Unionist MP; and (according to Nigel H. Jones' biography of Mosley) Lord and Lady Russell of Liverpool."]}, {"page": "Through a Glass Darkly", "response": ["* Through a Glass Darkly: The Life of Patrick Hamilton, a 1990 biography by Nigel H. Jones"]}, {"page": "Nigel Jones", "response": ["* Nigel H. Jones (born 1961), British historian, journalist and biographer"]}, {"page": "Nigel H Jones", "response": ["#REDIRECT Nigel H. Jones "]}, {"page": "Nigel Jones (historian)", "response": ["#REDIRECT Nigel H. Jones"]}, {"page": "Britain's Great War", "response": ["David Chater of The Times called the series \"superb\" and said it \"does justice to the unimaginable scale of a cataclysm\". Clarissa Tan from The Spectator said Paxman presented \"with assuredness and gravitas\". Hugo Rifkind, another journalist for The Times, said: \"Documentaries must cater for those who know lots and those who know nothing. Jeremy Paxman gets the balance right\". John Crace writing in The Guardian described the series as disconnected. He went on to describe it as if there was a contextual void at the centre. It wasn't that the series demanded a great historical debate on the causes of the war – though it did seem perverse that the assassination of Archduke Ferdinand, the Balkans or European imperialism didn't get a mention. However Nigel H. Jones, writing for The Daily Telegraph, commented on how moving the series was, defying his low expectations."]}]}}