{"wiki_id": "http://www.wikidata.org/entity/Q703734", "itemLabel": "Kerry Dixon", "itemDescription": "English footballer (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kerry_Dixon", "wikipedia_page": {"main": "Kerry Michael Dixon (born 24 July 1961) is an English retired professional footballer who played as a forward.\nHis club career was spent most notably at Chelsea, where he won the Second Division twice. His 193 goals across all competitions made him their third-highest goalscorer of all time. \nFor three seasons in a row, 1982–83, 1983–84 and 1984–85, he was the top goalscorer in his teams' divisions, 3 (with Reading), 2 and 1 (with Chelsea) respectively. \nDixon scored four goals in eight international appearances for the England national football team, and represented the nation at the 1986 FIFA World Cup.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["Lampard is Chelsea's all-time top goalscorer, having scored 211 goals in 648 games (2001–2014); he passed Bobby Tambling's longstanding record of 202 in May 2013. Eight other players have also scored over 100 goals for Chelsea: George Hilsdon (1906–1912), George Mills (1929–1939), Roy Bentley (1948–1956), Jimmy Greaves (1957–1961), Peter Osgood (1964–1974 and 1978–1979), Kerry Dixon (1983–1992), Didier Drogba (2004–2012 and 2014–2015), and Eden Hazard (2012–2019). Greaves holds the club record for the most goals scored in one season (43 in 1960–61). While a Chelsea player, Greaves also became the youngest ever player to score 100 goals in the English top-flight, at 20 years and 290 days."]}, {"page": "July 24", "response": ["*1961 – Kerry Dixon, English footballer and manager"]}, {"page": "Luton", "response": ["* Kerry Dixon, footballer"]}, {"page": "Football records and statistics in England", "response": ["|  Kerry Dixon"]}, {"page": "Essex Senior Football League", "response": ["*Kerry Dixon – Played in the Essex Senior League for Basildon after playing for other teams including Chelsea and England."]}, {"page": "Frank Lampard", "response": ["In the third round of the FA Cup, Lampard entered in the second half and scored a penalty in Chelsea's victory over Southampton. On 6 January 2013, Lampard's agent Steve Kutner announced that Lampard would not be offered a new contract with Chelsea and would leave when his contract expired in June 2013.  On 12 January 2013, Lampard scored a penalty in the 4–0 win over Stoke City at the Britannia Stadium. This goal made Lampard Chelsea's second-highest goalscorer of all-time with 194 goals and moved him clear of Kerry Dixon and putting him eight goals behind Bobby Tambling in first. He scored his 199th goal for Chelsea in a 4–0 FA Cup victory over Brentford on 17 February, becoming Chelsea's all-time leading FA Cup goalscorer with 26 goals. Lampard's 200th Chelsea goal came against his former club West Ham on 17 March 2013, heading home an Eden Hazard cross."]}, {"page": "Didier Drogba", "response": ["After the departure of Damien Duff to Newcastle United, Drogba switched from the number 15 shirt he had worn for Chelsea since 2004 to the number 11 shirt vacated by Duff. Drogba scored 33 goals in all competitions during the season (more than his tally in the previous two seasons combined), including 20 in the Premier League to win the Golden Boot. In doing so, he became the first Chelsea player since Kerry Dixon in 1984–85 to reach 30 goals in a season, scoring 20 in the Premier League, six in the Champions League, three in the FA Cup and four in the League Cup."]}]}}