{"wiki_id": "http://www.wikidata.org/entity/Q7032401", "itemLabel": "Nigel Gleghorn", "itemDescription": "English footballer (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Gleghorn", "wikipedia_page": {"main": "Nigel William Gleghorn (born 12 August 1962) is an English former professional footballer who played as a forward or central midfielder.", "link_mentions": [{"page": "Micky Adams", "response": ["Before 1997 was out, Adams took his third job of the 1997–98 season when he was named manager of Brentford. The club had suffered a slump in league form after losing the previous season's Division Two play-off final, and were struggling near the foot of the table. He signed striker Andy Scott from Sheffield United for a fee of £75,000, as well as signing Glenn Cockerill as player/assistant manager, Warren Aspinall and loanee Nigel Gleghorn. However injuries began to mount, with Ijah Anderson, Derek Bryan and Ricky Reina all sidelined. Adams was named as Second Division Manager of the Month for March after overseeing three wins and two draws. Despite Adams' efforts, Brentford were relegated to Division Three on the last day of the season, and the club was bought out by Ron Noades, who installed himself as the new Brentford manager."]}, {"page": "Nantwich Town F.C.", "response": ["In 1982 Nantwich were founder members of the North West Counties League. The club finished bottom and were relegated to Division 2 where the club remained (except for one season in Division 3 in 1986) until 1989 when the Dabbers were promoted to Division One. In the 1993–94 season, they finished in their then highest NWCFL placing of fourth. In April 1995, Nantwich defeated Trafford 1–0 in the League Cup Final at Gigg Lane, Bury (two years earlier at the same venue Nantwich had lost 2–1 to Burscough in the same competition). In 1995, in an F.A. Cup preliminary round tie against Droylsden, Andy Locke scored the fastest ever FA Cup hat-trick, in 2 minutes 20 seconds. This record still stands for a hat-trick in any round of the FA Cup, including the qualifying rounds before the First Round. Ex-Stoke City player Nigel Gleghorn was appointed manager in November 2001 and helped steer Nantwich to a top six finish in 2003, when the club also attained the FA Charter Standard Community Club award."]}, {"page": "Seaham Red Star F.C.", "response": ["Previous managers in the Club's history include Northern League legend Paul Walker, in conjunction with the long serving Chris Copeland; former Hartlepool Manager, Billy Horner; and ex Burnley player, Harry Wilson. Former players going on to join Football League clubs include Nigel Gleghorn (Ipswich and Manchester City), Bobby Davison (Halifax, Derby and Leeds) and Stephen Harper (currently with Sunderland AFC). Tommy Henderson remains the Club's leading goalscorer, netting 211 goals in 276 appearances including a record-breaking 62 in 1978–79.  Leading the way with appearances in Tommy's brother Trevor Henderson who amassed 300 games", "*Nigel Gleghorn"]}, {"page": "Ray Wallace (footballer)", "response": ["In August 1994 Wallace joined Stoke City on a free transfer. He made a slow start to his Stoke career and by December 1994 he was loaned out to Second Division Hull City where he made seven appearances. He returned to the Victoria Ground in January 1995 and ended the 1994–95 season with 28 appearances. Manager Lou Macari used Wallace in a different role in 1995–96 playing him alongside Nigel Gleghorn in centre midfield. It worked well as Stoke reached the play-offs where they lost 1–0 to Leicester City and Wallace won the player of the year award jointly with goalkeeper Mark Prudhoe. He missed just one match in 1996–97 as Stoke finished in a mid-table position of 12th. The 1997–98 season saw Stoke play at the new Britannia Stadium but results were poor and relegation to the third tier was suffered. Under Brian Little in 1998–99 Wallace was used mainly as a substitute and was released by the club at the end of the season."]}, {"page": "Eddie Bishop", "response": ["He returned to football as assistant manager to Nigel Gleghorn at Nantwich Town, where he continued his playing days, leaving in the summer of 2002. He then had a spell assisting his former Chester teammate Chris Lightfoot at Runcorn F.C. Halton, with the pair being sacked together in October 2004"]}, {"page": "1992–93 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Nigel Gleghorn"]}, {"page": "1993–94 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Nigel Gleghorn"]}, {"page": "1994–95 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Nigel Gleghorn"]}, {"page": "1995–96 Stoke City F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Nigel Gleghorn"]}, {"page": "1996–97 Stoke City F.C. season", "response": ["The final season at the Victoria Ground was a big milestone in the club's history and was met with mixed reaction from the club's supporters, some of whom were happy to move and some who wanted the Victoria Ground to remain. The first ramifications of the move became clear in the summer of 1996 as a number of players wanted a move away as the club began trying to find the £6 million they need. Nigel Gleghorn and Vince Overson were the first to depart both joining Burnley. Funds were generated by the sale of Graham Potter to Southampton for £300,000 and Lee Sandford to Sheffield United for £450,000. The board did permit Macari to spend £200,000 on Richard Forsyth who became the club's first player signed for a fee since 1994."]}, {"page": "1998–99 Burnley F.C. season", "response": ["|||FW|| Nigel Gleghorn || Altrincham || Free || 31 May 1998"]}, {"page": "1997–98 Burnley F.C. season", "response": ["||FW|| Nigel Gleghorn || Brentford || Loan || 17 November 1997", "||FW|| Nigel Gleghorn || Northampton Town || Loan || 12 February 1998"]}, {"page": "1996–97 Burnley F.C. season", "response": ["||MF|| Nigel Gleghorn || Stoke City || Free || 15 August 1996"]}, {"page": "1988–89 Port Vale F.C. season", "response": ["The pre-season saw Vale Park given a £40,000 upgrade to repair the floodlights, whilst a £20,000 electronic scoreboard was installed at the Hamil End. Three executive boxes were also purchased from Newcastle United, whilst facilities were opened to the local community. Manager John Rudge made a £40,000 offer for Bristol City's left-sided midfielder Alan Walsh, which was rejected. He also made inquiries for Nigel Gleghorn and Marc North. Ray Walker put in a transfer request, which was rejected. Rudge's first purchase of the season was Sunderland's left-sided midfielder Paul Atkinson, with a tribunal setting the fee at £20,000; Rudge stated that he \"has the ability to produce the sort of crosses that win games\". His next target was a striker, though he had a £70,000 bid for Hull City's Andy Saville rejected. Attempts to capture Imre Varadi, Wayne Biggins, Keith Bertschin, Andy Jones, and John Pearson all failed. Ian Moores began training with the club, but was not offered a contract. Despite interest from at least three other clubs (particularly Mansfield Town), Rudge signed Ron Futcher, Bradford City's top-scorer, for a £35,000 fee. The veteran striker said \"I could have done better for myself elsewhere, but Vale have a lot more potential.\" Another new arrival was young Brighton & Hove Albion goalkeeper Trevor Wood on a free transfer. The Vale were unbeaten in their seven pre-season friendlies, beating second tier rivals Stoke City 1–0 in the process. They also recorded wins over Newcastle Town (6–1), Brandon (2–1), Spennymoor (3–0), and Kidderminster Harriers (4–0), and drew 2–2 with Walsall and 1–1 with Crewe Alexandra. Having failed to sign Phil Turner, Rudge felt the squad's one weakness was a lack of depth in defence."]}, {"page": "1991 Associate Members' Cup Final", "response": ["| MF || 10 || Nigel Gleghorn"]}, {"page": "1992–93 Birmingham City F.C. season", "response": ["!scope=\"row\"| Nigel Gleghorn "]}, {"page": "1991–92 Birmingham City F.C. season", "response": ["Nigel Gleghorn was the club's top goalscorer, with 17 goals in the league, and 22 in all competitions.", "!scope=\"row\"| Nigel Gleghorn"]}, {"page": "1990–91 Birmingham City F.C. season", "response": ["!scope=\"row\"| Nigel Gleghorn"]}, {"page": "1989–90 Birmingham City F.C. season", "response": ["!scope=\"row\"| Nigel Gleghorn"]}, {"page": "PFA Team of the Year (1990s)", "response": ["!scope=row|Nigel Gleghorn"]}]}}