{"wiki_id": "http://www.wikidata.org/entity/Q7032549", "itemLabel": "Nigel Mitchell", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Mitchell", "wikipedia_page": {"main": "Nigel Mitchell is a British television and radio presenter and voice-over artist.\n\n", "link_mentions": [{"page": "September 19", "response": ["*  1978   – Nigel Mitchell, English radio and television host"]}, {"page": "Twister", "response": ["* Twister, a CITV gameshow hosted by Nigel Mitchell"]}, {"page": "Nigel", "response": ["*Nigel Mitchell, British television presenter and radio presenter"]}, {"page": "Capital Disney", "response": ["The final line up of presenters at closure was Adam Morris, known on air as The General, James Beckingham, Matt James, Val Mellon, Leigh Purves, Nigel Mitchell, Andrew Rendle, known as Radio Rendle, Adam O'Neill, Saffron Oddy and Sophie Bruce. Previous presenters on the station have included Allan Lake, Tim Lichfield, known as Tiger Tim, Korry Denison, Andy Kench, Dan Marsh, Kelli Nelson, Will Chambers, Carl Carter and Gema Ensenat."]}, {"page": "Reed's School", "response": ["*Nigel Mitchell, television and radio presenter"]}, {"page": "Play DJ", "response": ["For three months prior to Play DJ's launch in November 2006, a spin-off began airing called Playalong Live. The show was the same, but it featured a live voiceover presented by Nigel Mitchell. Ideas from this period (such as the presenter and a live chat box which was introduced) were later rolled into Play DJ.", "* Nigel Mitchell - former DJ on Capital Disney, and former presenter of Disney Channel UK."]}, {"page": "Mad for It", "response": ["Mad for It was a British game show for children which was produced by Carlton Television broadcast on ITV from 2 September 1998 to 31 March 2000. Series 1 was hosted by former Nickelodeon presenters Mike McClean and Yiolanda Tokkallos. Series 2 was hosted by Mike McClean, Danielle Nicholls, and Nigel Mitchell. There was also a regular character called Pie Boy, played by Alex Verrey, who would go around hitting random people in the studio with flans in a manner like The Phantom Flan Flinger from Tiswas. "]}, {"page": "Friday Afternoon Thing", "response": ["#REDIRECTNigel Mitchell"]}, {"page": "Shrewsbury House School", "response": ["* Nigel Mitchell (born 1978) TV and radio presenter"]}]}}