{"wiki_id": "http://www.wikidata.org/entity/Q7032370", "itemLabel": "Nigel Farndale", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Farndale", "wikipedia_page": {"main": "Nigel Farndale (born 30 September 1964) is a British author and journalist, known for his broadsheet interviews and his bestselling novel The Blasphemer.\nHe has written seven books: four novels, two biographies and a collection of interviews. His latest novel is The Dictator's Muse.\nThe Blasphemer was shortlisted for the 2010 Costa Book Awards and selected for the WH Smith Richard and Judy Bookclub. His biography Haw-Haw: The Tragedy of William and Margaret Joyce was published in 2005 and shortlisted for that year's Whitbread Prize and James Tait Black Memorial Prize. \nAs a journalist he has written for various magazines and newspapers including The Observer, Sunday Times, Financial Times, Daily Telegraph and Spectator. He is currently Obituaries Editor of The Times, a paper for which he also writes columns and interviews. \nHe has won a British Press Award for his interviews and was the joint subject of a programme about interviewing on Radio 4 when he and Lynn Barber compared notes on Between Ourselves. His interview subjects have included Henry Kissinger, Mick Jagger, Woody Allen, the Dalai Lama, Prince Charles, Elton John, Hillary Clinton, Donald Trump, Paul McCartney, George Best, Jimmy Savile and Stephen Hawking.\nFarndale grew up on a farm in the Yorkshire Dales and was educated at Barnard Castle School, Richmond Sixth Form College, Oxford Polytechnic and Durham University. He became a journalist after writing an acerbic letter to Auberon Waugh, who then asked him to write for Literary Review. After spells on Punch magazine and Country Life magazine he moved to the Sunday Telegraph, where he remained for twenty years as a feature writer and columnist. \nHe is married with three sons and lives on the border between Hampshire and Sussex.", "link_mentions": [{"page": "Obituary", "response": ["An obituary (obit for short) is a news article that reports the recent death of a prominent person.  Although it tends to focus on positive aspects of the subject's life, this is not always the case. According to Nigel Farndale, the Obituaries Editor of The Times: “Obits should be life affirming rather than gloomy, but they should also be opinionated, leaving the reader with a strong sense of whether the subject lived a good life or bad; whether they were right or wrong in the handling of their public affairs.”"]}, {"page": "George Melly", "response": ["Melly was an atheist. Interviewed by Nigel Farndale in 2005, Melly said: \"I don't understand people panicking about death. It's inevitable. I'm an atheist; you'd think it would make it worse, but it doesn't. I've done quite a lot in the world, not necessarily of great significance, but I have done it.\"The Daily Telegraph, 24 October 2005, Features section, p. 023."]}, {"page": "List of Durham University people", "response": ["* Nigel Farndale (Grad Soc) – writer in the Sunday Telegraph"]}, {"page": "Barnard Castle School", "response": ["* Nigel Farndale, journalist and novelist."]}, {"page": "2005 Whitbread Awards", "response": ["*Nigel Farndale, Haw-Haw"]}, {"page": "List of books from the Richard & Judy Book Club", "response": ["* Nigel Farndale – The Blasphemer"]}, {"page": "2010 Costa Book Awards", "response": ["*Nigel Farndale, The Blasphemer"]}, {"page": "Durham University", "response": ["Prominent journalists and media specialists include: George Entwistle, former Director-General of the BBC, Sir Harold Evans (Politics and Economics), editor of The Sunday Times from 1967 to 1981 and The Times from 1981 to 1982, Nigel Farndale (Philosophy), Sunday Telegraph journalist, George Alagiah (Politics), presenter of the BBC News at Six, Matthew Amroliwala (Law and Politics, 1984), BBC News channel presenter, Biddy Baxter (1955), former producer of Blue Peter, Arthur Bostrom (BA Hons), Officer Crabtree in  'Allo 'Allo!, Nish Kumar (English with History), stand-up comedian, Jamie Campbell (English Literature), filmmaker, Alastair Fothergill (Zoology, 1983), series producer of The Blue Planet, Planet Earth and the director of Earth, Shelagh Fogarty (Modern Languages, 1988), host of the BBC Radio 5 Live breakfast show, Lorraine Heggessey (English Language & Literature), the first female Controller of BBC One and Chris Terrill (Anthropology and Geography), documentary maker, writer and adventurer. Other BBC hosts who have graduated from Durham include Chris Hollins, sports presenter on BBC Breakfast, Gabby Logan (Law, 1995), Kate Silverton (Psychology), Jeremy Vine (English), Tim Willcox (Spanish) and Nina Hossain (English Language and Linguistics)."]}, {"page": "The 70s (TV series)", "response": ["Nigel Farndale of the Sunday Telegraph gave it four stars out of five, saying Sandbrook \"knows his subject\", with the series being entertaining as well as having \"a big idea at the core\" — that the decade inspired Thatcherism."]}, {"page": "William Joyce", "response": ["Joyce's biographer, Nigel Farndale, suggests on the basis of documents made public for the first time between 2000 and 2005 that Joyce made a deal with his prosecutors not to reveal links he had had to MI5. In return, his wife Margaret, known to radio listeners as \"Lady Haw-Haw\", was spared prosecution for high treason. Of the 32 British renegades and broadcasters caught in Germany at the end of the war, only Margaret Joyce, who died in London in 1972, was not charged with treason.", "*Haw-Haw: The Tragedy of William and Margaret Joyce by Nigel Farndale (Macmillan, London, 2005)"]}, {"page": "A Mother's Son", "response": ["Reviewing the series in The Guardian Sam Wollaston called it \"tense, absorbing, thrilling\". Nigel Farndale, writing in The Telegraph praised it as \"a taut, psychological thriller that will have left every parent who watched it feeling uneasy, maybe even culpable,\" while Alex Hardy in The Times was impressed by \"A striking portrait of the asymmetrical compartmentalised nature of one family of our times.\""]}, {"page": "Cultural impact of Madonna", "response": ["Outside the music industry, Madonna has been the subject of numerous books, essays and other literary works while more than a writer cited her as an influence. Writer Maura Johnston gave contex of this point saying that \"the appetite for books on Madonna is large, and the variety of approaches writers, editors, and photographers have taken to craft their portraits is a testament to how her career has both inspired and provoked\". Examples include Italian writer Francesco Falconi whose reported that she inspired his writing career. Photographer Mario Testino is another example. In an interview with Nigel Farndale he commented Madonna is the first non-model in collaborating with him and credited: \"With her I knew I had discovered my style because I like to believe what I am photographing\". Fashion designer Anna Sui cited Madonna as an influence in her career. She commented that an encounter with the singer gave her \"confidence\" and \"boosted\" the idea to start her first own runway show.References for fashion designer Anna Sui (examples):"]}]}}