{"wiki_id": "http://www.wikidata.org/entity/Q7039043", "itemLabel": "Nino Firetto", "itemDescription": "British broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Nino_Firetto", "wikipedia_page": {"main": "Anthony Edward Paolo Firetto (born 30 June 1957 in Cheshunt, Hertfordshire) is a British radio presenter, TV host and actor, currently based in San Francisco, United States.", "link_mentions": [{"page": "Ware, Hertfordshire", "response": ["* Nino Firetto — radio presenter, TV host and actor; born in Ware"]}, {"page": "Heart Kent", "response": ["* Nino Firetto later Super Channel, later Exeter FM"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Nino Firetto"]}, {"page": "CITV", "response": ["* Nino Firetto (February 1986)"]}, {"page": "Music Box (TV channel)", "response": ["* Music Box Live (live from the Music Box studios in London, new videos, competitions and regular features originally with Simon Potter and later with Nino Firetto, 1987 – also produced as Pepsi Live)", "* Videopix (video request show, 1984–1987 with The Big Boys – Martin Buchanan and Simon Potter: 1987–1988 – Nino Firetto)", "* Totally Live (formerly known as Music Box Live and Pepsi Live with Nino Firetto, late 1987, and 1988, occasionally with Nicky Campbell, Simon Potter, Anthea Turner or Timmy Mallett)", "* Nino Firetto (guests, features such as \"Papa Luigi\", music videos and news, live from the Music Box \"living room\" – 1988)", "* Nino Firetto", "Some presenters also recorded a track and video for a song called \"Back to the Rhythm\" under the name of The Rap Pack in December 1986, they were: Nino Firetto, Amanda Redington, Gloria Thomas, Timmy Mallett, Steve Blacknell, Simon Potter and Martin Buchanan."]}, {"page": "Mr and Mrs (TV series)", "response": ["It was then aired on UK Living and regionally on HTV hosted by Nino Firetto entitled The All-New Mr. and Mrs. Show and then back on the ITV network in 1999 hosted by Julian Clary."]}, {"page": "Get Fresh", "response": ["The weekly music strand of the show featured musical guest interviews and pop gossip. The segment was hosted each week by Nino Firetto and David 'Kid' Jensen."]}, {"page": "Liberty Radio", "response": ["* Nino Firetto"]}, {"page": "The Rap Pack", "response": ["*Nino Firetto"]}, {"page": "Radio Victory", "response": ["One of Victory's longest running shows was the Victory Roll, its own top-40 chart show aired on Saturday evenings until all ILR stations started simulcasting the Network Chart from Capital Radio. The Victory Roll (presented by Tony Power) was initially based on the station's playlist but later was compiled from record sales at the Co-op record department in Fratton Road. The stations's first catchphrase was \"everything that touches you\". Presenters included Nino Firetto. The initial Victory FM catchphrases were \"enjoy the moment\", \"from the heart of the city\", and sometimes \"to greater Portsmouth.\" Broadcasters on the relaunched Radio Victory 107.4 in 1999 included Boy George, who also presented on the cable service."]}, {"page": "Boys (Summertime Love)", "response": ["During an interview with Nino Firetto on the Music Box program on Super Channel in late 1988, Sabrina explained that the video for \"Boys\" was originally created to be a segment in a magazine show. This was Sabrina's explanation of why its style more closely matched that of Italian magazine shows of the time (more overtly sexualised) than that of the traditional music video."]}, {"page": "Wire TV", "response": ["Presenters included Kathryn Apanowicz, Nino Firetto, Rhodri Evans, Fenella George and also Femi Oke who co-hosted the weekend show Soap on the Wire with television and soap opera expert Chris Stacey. The show proved popular with students and housewives alike and towards the end of 1993 was taking over 200 calls in the four hours it was on air. Producers tried to revamp it into a daily show but Stacey had other commitments and was reduced to one appearance a week so the other experts and co-presenters such as Darren Gray, Jamie Carrington-Colby, Darren Edwards and Richard Arnold were featured more frequently throughout late 1993 and 1994 all proved less popular than Stacey."]}, {"page": "Nino (name)", "response": ["*Nino Firetto, nickname of Anthony Edward Paolo Firetto (born 1957), British entertainer"]}, {"page": "Love Me, Love Me Not (British game show)", "response": ["Love Me, Love Me Not is a British game show based on the Canadian version of the same name. It aired on ITV from 5 May to 13 September 1988 and hosted by Nino Firetto and Debbie Greenwood."]}, {"page": "Template talk:Anthony", "response": ["*Nino (name) (of the many Nino articles on WP only Nino Firetto seems connected to this subject, even though it is a nickname for Antonino.--TonyTheTiger (T / C / WP:FOUR / WP:CHICAGO / WP:WAWARD) 11:26, 15 September 2019 (UTC)"]}]}}