{"wiki_id": "http://www.wikidata.org/entity/Q7046872", "itemLabel": "Noel Burke", "itemDescription": "Irish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_Burke", "wikipedia_page": {"main": "Noel Andrew Burke (born 29 November 1962 in Belfast) is an Irish singer, who is best known for replacing Ian McCulloch as the lead singer with Echo & the Bunnymen.Burke's first band was St. Vitus Dance, which released the album Love Me, Love My Dogma in 1987 before splitting up a few years later. Shortly after the split, Burke was contacted by Will Sergeant and eventually joined the Bunnymen as lead vocalist. The band released Reverberation (1990) to mostly negative reviews, though the album has subsequently garnered some acclaim. The Bunnymen formally announced their disbandment in 1993.\nIn 2005, Burke reformed St. Vitus Dance for some live shows, and an album of new material, Glyphotheque, was released in 2008.", "link_mentions": [{"page": "The 13th Floor Elevators", "response": ["The song \"Reverberation\" was covered by Echo & the Bunnymen in 1990, with singer Noel Burke."]}, {"page": "Echo & the Bunnymen", "response": ["After releasing a self-titled album in 1987, McCulloch left the band and was replaced by singer Noel Burke. In 1989, de Freitas was killed in a motorcycle accident. After working together as Electrafixion, McCulloch and Sergeant regrouped with Pattinson in 1997 and returned as Echo & the Bunnymen, before Pattinson's departure in 1998. The band has done some touring and released several albums since the late 1990s to varying degrees of success.", "Following an abortive attempt to record with singers Kate Pierson and Cindy Wilson of The B-52s, the group advertised for a new lead singer. Former Colenso Parade singer Oscar turned down an offer to take over from McCulloch,Larkin, Colin: \"The Guinness Who's Who Of Indie and New Wave Music\", page 67. Guinness Publishing, 1992,  Keyboardist Jake Brockman (a touring member of the band for several years previously, and a contributor to the 1987 album) was promoted to full member, and after hearing an album by the defunct UK group St Vitus Dance, the Bunnymen offered the lead singer spot to vocalist Noel Burke, who accepted after the band assured him that they did not want \"a McCulloch clone\". ", "I think it's pretty obvious what I think. Noel Burke... the name says it all really doesn't it? No, that's not fair. It wasn't his fault, it was Will and Pete who were the berks really. But no, I thought it was disgraceful and after that I suppose it was quite surprising that I continued working with Will after that. I'm glad I did though. Johnny Marr called them Echo and the Bogusmen when that happened.", "* Noel Burke – vocals, guitar (1988–1993)", " bar:Noel    text:Noel Burke"]}, {"page": "Ian McCulloch (singer)", "response": ["In 1988, McCulloch left the group to pursue a solo career under the impression the Bunnymen would be laid to rest, if only temporarily. When the remaining Bunnymen continued using the name with new singer Noel Burke, the split became permanent with McCulloch referring to the band as \"Echo & the Bogusmen\"."]}, {"page": "Will Sergeant", "response": ["Sergeant continued with the Bunnymen even after Ian McCulloch left in 1988, bringing in Noel Burke to sing on Reverberation in 1990, before breaking up the band in 1993. In 1994, Sergeant and McCulloch reunited to form Electrafixion. The band toured extensively and released one album, Burned, in 1995. After a few singles and more touring, the band began to play a large number of old Echo & the Bunnymen songs at their shows. In 1996, the Bunnymen reformed."]}, {"page": "Reverberation (album)", "response": ["Reverberation is the sixth studio album by the English rock band Echo & the Bunnymen. The album was released amidst a line-up change for the group, due to the departure of vocalist Ian McCulloch and the death of drummer Pete de Freitas. The remaining members, guitarist Will Sergeant and bassist Les Pattinson, were joined by ex-St. Vitus Dance singer Noel Burke, keyboard player Jake Brockman and drummer Damon Reece. The album was produced by former engineer for The Beatles Geoff Emerick at Ridge Farm Studio in Surrey, England, and had a more pronounced psychedelic sound than the group's previous releases.", "While McCulloch was recording his debut solo album, Candleland (1989), Echo & the Bunnymen promoted long-time touring keyboard player Jake Brockman to a full-time band member position.Adams, p. 226 In April 1989, after listening to an album by the defunct band St. Vitus Dance which had been recommended by Geoff Davies of Probe Records in Liverpool,Staunton, Terry (October 2005). \"Ocean Refrain: Echo and the Bunnymen\". Record Collector. Sergeant felt that the band's singer Noel Burke would work well within the context of the band's sound. After a meeting with the band and being reassured that they did not want a McCulloch clone, Burke agreed to join. However, tragedy struck when on 14 June 1989 de Freitas died in a motorcycle accident on his way to the band's first rehearsal.Robbins, Ira (5 February 1990). \"Ian McCulloch\". Rolling Stone.Adams, p. 207 The band recruited Damon Reece, a friend of Brockman, as drummer in de Freitas's place and began rehearsals. The new line-up played their first string of performances in mid-March 1990 with a mixture of old and new material. McCulloch allegedly described this incarnation of the band as \"Echo & the Bogusmen\" but later attributed the comment to the former The Smiths guitarist Johnny Marr.Doherty, Mike (3 November 2008). \"Successful applicants must provide own legend\". National Post. Retrieved on 13 January 2009.Tone E. \"Mac the Nice\". Atomicduster. Retrieved on 13 January 2009. Sergeant later said that keeping the name was \"down to wanting to take a bitter swipe at [McCulloch]\".", "All tracks written by Noel Burke, Will Sergeant, Les Pattinson, Jake Brockman & Damon Reece.", "*Noel Burke – vocals, guitar, piano"]}, {"page": "Evergreen (Echo & the Bunnymen album)", "response": ["After leaving Echo & the Bunnymen in 1988 to pursue a solo career, vocalist Ian McCulloch released two albums that were not commercial successes.Adams, p. 216Adams, p. 249 Despite McCulloch's departure and drummer Pete de Freitas's death, guitarist Will Sergeant and bassist Les Pattinson decided to recruit three new members – Noel Burke (vocals), Jake Brockman (keyboards) and Damon Reece (drums) – and continue with the same band name, which angered McCulloch.Adams, pp. 226–228 The Bunnymen released one further album, Reverberation (1990), which critics and fans alike received poorly.Mack, Bob (11 January 1991). \"Reverberation (1991)\". Entertainment Weekly. Retrieved on 7 March 2009.Adams, p. 229 WEA Records subsequently dropped the group, who went on to break-up in early 1993.Adams, p. 230"]}, {"page": "Les Pattinson", "response": ["After five studio albums, McCulloch left The Bunnymen in 1988 to pursue a solo career. The three remaining members decided to continue working under the name 'Echo & the Bunnymen' and brought in ex–St. Vitus Dance vocalist Noel Burke to replace McCulloch. After de Freitas' death in a motorcycle accident in 1989, Pattinson and Sergeant added percussionist Damon Reece (who later joined former Spacemen 3 principal Jason Pierce's new band, Spiritualized, as drummer); and Jake Brockman, keyboardist and long-time friend of the band, to continue with the recording of their album Reverberation, which was released in December 1990. The band later formed their own label called Euphoric Records and released another two singles, and also did several international tours, before disbanding in 1993."]}, {"page": "Echo & the Bunnymen discography", "response": ["Echo & the Bunnymen's original line-up consisted of vocalist Ian McCulloch, guitarist Will Sergeant and bass player Les Pattinson, supplemented by a drum machine. By 1980, Pete de Freitas had joined as the band's drummer, and their debut album, Crocodiles, met with critical acclaim and made the UK Top 20. Their second album, Heaven Up Here (1981), again found favour with critics and reached number 10 in the UK. The band's cult status was followed by mainstream success in the mid-1980s, as they scored a UK Top 10 hit with the single \"The Cutter\", and the attendant album, Porcupine (1983), which reached number two in the UK. The next release, Ocean Rain (1984), regarded as their landmark release, spawned the hit singles \"The Killing Moon\", \"Silver\" and \"Seven Seas\". One more studio album, Echo & the Bunnymen (1987), was released before McCulloch left the band to pursue a solo career in 1988. The following year, de Freitas was killed in a motorcycle accident, and the band re-emerged with a new line-up. Sergeant and Pattinson were joined by Noel Burke as lead singer, Damon Reece on drums and Jake Brockman on keyboards. They released Reverberation in 1990, but the disappointing critical and commercial reaction it received culminated with a complete disbanding in early 1993.", "| A previously unreleased track, with singer Noel Burke."]}, {"page": "Crystal Days: 1979–1999", "response": ["This retrospective boxset omits the material released when the band was fronted by Noel Burke (1990–92)."]}]}}