{"wiki_id": "http://www.wikidata.org/entity/Q7046856", "itemLabel": "Noel Brett", "itemDescription": "English cricketer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_Brett", "wikipedia_page": {"main": "Noel Adrian Brett (born 8 September 1975) is a former English cricketer.  Brett was a right-handed batsman who bowled right-arm off break.  He was born at Aldershot, Hampshire.\nBrett represented the Surrey Cricket Board in List A matches against the Gloucestershire Cricket Board and the Essex Cricket Board in the 1st and 2nd rounds of the 2003 Cheltenham & Gloucester Trophy which was played in 2002. In his 2 List A matches, he scored 2 runs at a batting average of 2.00, with a high score of 2. With the ball he took a single wickets at a bowling average of 129.00, with best figures of 1/48.He appeared on the game show You Bet! with the challenge to run out 20 unguarded wickets within two minutes. He succeeded with 14 seconds to spare.", "link_mentions": [{"page": "List of people from Aldershot", "response": ["* Noel Brett - cricketer "]}, {"page": "Road Safety Authority", "response": ["In 2013, the CEO of the RSA, Noel Brett stepped down from his position as chief executive of the State-funded Road Safety Authority (RSA) to take up a position as chief lobbyist for the Irish Banking Federation:", "The RSA's \"He drives, she dies\" campaign, which aimed to raise awareness among female drivers of the risks of getting into cars with men they feel may not drive safely, came in for some criticism in the Irish media. The country's Broadcasting Complaints Commission also received a number of complaints from members of the public relating to the campaign. RSA Chief Executive Noel Brett defended the campaign as justified by accident statistics, saying that \"women need to know that they are being killed through male-dominated driver errors such as speeding and drink driving,\" adding \"male drivers are four times more likely to be involved in a fatal collision than a female driver\"."]}, {"page": "List of people from Hampshire", "response": ["*Noel Brett, cricketer, was born in Aldershot"]}, {"page": "List of Surrey Cricket Board List A players", "response": ["*Noel Brett (2002): NA Brett"]}]}}