{"wiki_id": "http://www.wikidata.org/entity/Q704692", "itemLabel": "Merlin Holland", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Merlin_Holland", "wikipedia_page": {"main": "Christopher Merlin Vyvyan Holland (born December 1945) is a biographer and editor. He is the only grandchild of Oscar Wilde, whose life he has researched and written about extensively.", "link_mentions": [{"page": "Oscar Wilde", "response": ["Although it is widely believed that the charges were related to Wilde's consensual activities, The Trials of Oscar Wilde, which includes an original transcript of the libel trial (which came to light in 2000), suggests that he took advantage of teenagers. However, one of the authors, Merlin Holland, argues, “One is taking it out of context, he was not an odious predator. The boys seemed to be willing partners and there appeared to be a relationship going on between him and them.” Antony Edmonds feels that Wilde would have faced prosecution today: \"For example, he certainly paid for sex with youths under the age of 18 which is a criminal offence. But even if his activities had led only to exposure and not to arrest, he would have been savagely pilloried in the media. Wilde was 39 when he seduced Alphonse Conway, and Conway was an inexperienced boy of 16.\"", "Wilde died of meningitis on 30 November 1900. Different opinions are given as to the cause of the disease: Richard Ellmann claimed it was syphilitic; Merlin Holland, Wilde's grandson, thought this to be a misconception, noting that Wilde's meningitis followed a surgical intervention, perhaps a mastoidectomy; Wilde's physicians, Dr Paul Cleiss and A'Court Tucker, reported that the condition stemmed from an old suppuration of the right ear (from the prison injury, see above) treated for several years (une ancienne suppuration de l'oreille droite d'ailleurs en traitement depuis plusieurs années) and made no allusion to syphilis.", "On 14 February 1995, Wilde was commemorated with a stained-glass window at Poets' Corner in Westminster Abbey. The memorial, above the monument to Geoffrey Chaucer, was unveiled by his grandson Merlin Holland, while Sir John Gielgud read from the final part of De Profundis and Dame Judi Dench read an extract from The Importance of Being Earnest.", "Wilde's life has been the subject of numerous biographies since his death. The earliest were memoirs by those who knew him: often they are personal or impressionistic accounts which can be good character sketches, but are sometimes factually unreliable. Frank Harris, his friend and editor, wrote a biography, Oscar Wilde: His Life and Confessions (1916); though prone to exaggeration and sometimes factually inaccurate, it offers a good literary portrait of Wilde. Lord Alfred Douglas wrote two books about his relationship with Wilde. Oscar Wilde and Myself (1914), largely ghost-written by T. W. H. Crosland, vindictively reacted to Douglas's discovery that De Profundis was addressed to him and defensively tried to distance him from Wilde's scandalous reputation. Both authors later regretted their work. Later, in Oscar Wilde: A Summing Up (1939) and his Autobiography he was more sympathetic to Wilde. Of Wilde's other close friends, Robert Sherard; Robert Ross, his literary executor; and Charles Ricketts variously published biographies, reminiscences or correspondence. The first more or less objective biography of Wilde came about when Hesketh Pearson wrote Oscar Wilde: His Life and Wit (1946). In 1954 Wilde's son Vyvyan Holland published his memoir Son of Oscar Wilde, which recounts the difficulties Wilde's wife and children faced after his imprisonment. It was revised and updated by Merlin Holland in 1989."]}, {"page": "The Picture of Dorian Gray", "response": ["The preface was first published in the April 1891 edition of the novel; nonetheless, by June 1891, Wilde was defending The Picture of Dorian Gray against accusations that it was a bad book.The Letters of Oscar Wilde, Merlin Holland and Rupert Hart-Davis, eds., Henry Holt (2000), ; and The Artist as Critic, Richard Ellmann, ed., University of Chicago (1968),  – containing Wilde's book review of Giles's translation, and Chuang Tsǔ (Zhuang Zhou) is incorrectly identified as Confucius. Wilde's book review of Giles's translation was published in The Speaker magazine of 8 February 1890."]}, {"page": "Lord Alfred Douglas", "response": ["Queensberry then publicly insulted Wilde by leaving at the latter's club a visiting card on which he had written, \"For Oscar Wilde posing as a somdomite \". The wording is in dispute – the handwriting is unclear – although Hyde reports it as this. According to Merlin Holland, Wilde's grandson, it is more likely \"Posing somdomite\", while Queensberry himself claimed it to be \"Posing as somdomite\". Holland suggests that this wording (\"posing [as] ...\") would have been easier to defend in court."]}, {"page": "Rupert Hart-Davis", "response": ["His Complete Letters of Oscar Wilde, compiled over the same period as Hart-Davis's correspondence with George Lyttelton, was described in a review of the latter as \"a mammoth undertaking whose difficulties and challenges are documented in great detail in the letters, giving a satisfying portrayal of what dedication in literary scholarship looks like from the inside\".A. C. Grayling in The Independent on Sunday, 30 September 2001, p. 17. Wilde's grandson, Merlin Holland, wrote, \"It was his decision fifty years ago to publish the first edition of Oscar Wilde's letters which helped to put my grandfather back into the position which he lost in 1895 as one of the most charismatic and fascinating figures in English literary history.\"Holland, p. x", "Public honours included honorary doctorates from the universities of Durham and Reading and a knighthood in 1967 for services to literature.  Twenty-two books were dedicated to him between 1936 and 1998, including works by H. E. Bates, Edmund Blunden, C. Day-Lewis, Ray Bradbury, Lady Diana Cooper, Eric Linklater, Compton Mackenzie, Anthony Powell and Leon Edel.Hart-Davis (1998), p. 157 Merlin Holland's Oscar Wilde: A Life in Letters (2003) was dedicated \"To the memory of Rupert Hart-Davis, with love and gratitude.\""]}, {"page": "An Ideal Husband", "response": ["To mark the centenary of the first production, Sir John Gielgud unveiled a plaque at the Haymarket Theatre in January 1995, in the presence of, among many others, Wilde's grandson Merlin Holland and the  Marquess of Queensberry.Russell, Bindon \"Commemorative Plaque at the Theatre Royal, Haymarket\", The Wildean, No. 7 (July 1995), pp. 9–13 "]}, {"page": "Alice Guszalewicz", "response": ["For many years, however, a picture of her performance was thought to in fact show the play's author, Wilde in women's drag. The picture was even reproduced in Richard Ellmann's biography of him. It was not until Wilde's grandson Merlin Holland corrected scholars in 1994 that the picture in fact showed Guszalewicz. This correction undermined readings of Wilde as a cross-dresser.Joseph Bristow, 'A complex multiform creature': Wilde's sexual identities, in THE CAMBRIDGE COMPANION TO OSCAR WILDE, 1997, p.203"]}, {"page": "Vyvyan Holland", "response": ["Holland became an author and translator. At the beginning of the Second World War, he was offered a position as a translator and editor for the BBC, a post he held for six years. In September 1943, he married his second wife, Dorothy Thelma Helen Besant, a great-grandniece of Annie Besant. Born in Australia, she had moved to London. Their only child, Merlin Holland, was born in London in 1945.  Merlin became a publisher, a dealer in glass and ceramics, and a writer. He conducted extensive research about his paternal grandfather Wilde, and has edited, written and published several works about him."]}, {"page": "Peter Craze", "response": ["Craze directed The Trials of Oscar Wilde, which toured the UK in 2014 and was co-authored by Merlin Holland, Oscar Wilde's grandson. Craze also narrated the first season of the hit children's animated fantasy television series The Dreamstone."]}, {"page": "Constance Lloyd", "response": ["Constance died on 7 April 1898, five days after a surgery conducted by Luigi Maria Bossi. According to The Guardian, \"theories [about her death] have ranged from spinal damage following a fall down stairs to syphilis caught from her husband.\" Also according to The Guardian, Merlin Holland, grandson of Oscar Wilde, \"unearthed medical evidence within private family letters, which has enabled a doctor to determine the likely cause of Constance's demise. The letters reveal symptoms nowadays associated with multiple sclerosis but apparently wrongly diagnosed by her two doctors\". Multiple sclerosis was then a little-known condition."]}, {"page": "The Letters of Oscar Wilde", "response": ["Merlin Holland revised the book and included new discoveries in a new edition: The Complete Letters of Oscar Wilde by Merlin Holland & Rupert Hart-Davis. It was published in 2000 by Henry Holt and Company LLC, New York () and Fourth Estate, London ().", "Merlin Holland, Oscar Wilde's grandson, provides an introduction to the work which describes the purpose of publishing Oscar Wilde's letters. The book contains a timeline of Oscar Wilde's life, includes some of his drawings and his famous letter to his lover, Lord Alfred Douglas, known as De Profundis. Expurgated editions of De Profundis had been published by Wilde's literary executor Robbie Ross from 1905, but the 1962 edition published by Rupert Hart-Davis was the first full and correct version, made from the original manuscript in the British Museum."]}, {"page": "Lucian Holland", "response": ["#REDIRECT Merlin Holland"]}]}}