{"wiki_id": "http://www.wikidata.org/entity/Q7045610", "itemLabel": "Nobby Lawton", "itemDescription": "English footballer (1940-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nobby_Lawton", "wikipedia_page": {"main": "Norbert \"Nobby\" Lawton (25 March 1940 – 22 April 2006) was an English footballer who played as an inside forward or wing half for various English clubs in the 1960s and early 1970s.\nBorn in Newton Heath, Manchester, Lawton began his football career with Manchester United, joining the club as an amateur in 1956. He was also involved in the club's 1957 FA Youth Cup title. Following the Munich air disaster in 1958, Lawton gave up his job with a local coal merchant to sign professional forms with Manchester United. However, while playing for the club's reserve team, Lawton succumbed to a heavy bout of the flu, leading to double pneumonia and the temporary loss of the use of his legs.\nHe was out of action for several months but eventually made his debut for the first team on 9 April 1960, playing at inside left in a 3–2 win over Luton Town at Kenilworth Road. Over the next couple of seasons, Lawton forged a partnership with Bobby Charlton on the left side of the United forward line, scoring a hat-trick against Nottingham Forest on Boxing Day 1961, but by the 1962–63 season he was increasingly deployed as a wing half. The emergence of Pat Crerand, however, meant that Lawton's first team opportunities became increasingly limited and he was sold to Preston North End in March 1963.\nIn his first season at Preston, Lawton captained the Lancashire side to the FA Cup final, where they lost to West Ham United. He continued to captain the side for the next three seasons, before a succession of knee injuries forced his sale to Brighton & Hove Albion in September 1967. He spent a further three seasons with Brighton before dropping down to the Fourth Division to play for Lincoln City in 1970. He retired from professional football in 1972 and took several jobs before returning to Newton Heath in 1977 to work for an export packaging firm.\nHe died from cancer in April 2006 (shortly after his 66th birthday) and is survived by his wife, their two children and their 6 grandchildren.", "link_mentions": [{"page": "Newton Heath", "response": ["The area has produced a number of notable footballers who has distinguished careers in both the national and international game. Jimmy Collinson played for Newton Heath F.C.; George Lydon, Nobby Lawton, Cyril Barlow, Harold Hardman, played for Manchester United; Charlie Harrison played for the Bolton Wanderers; Ron Staniforth, who played in the 1954 World Cup in Switzerland, was born in the town and went on to play 107 games for Sheffield Wednesday. More recently, former Manchester United footballer Ronnie Wallwork and Blackpool F.C. Nathan Eccleston all came from Newton Heath."]}, {"page": "Nobby", "response": ["* Nobby Lawton (1940–2006), English footballer"]}, {"page": "Deaths in April 2006", "response": ["*Nobby Lawton, 65, English footballer, midfielder & former captain of Preston North End, cancer."]}, {"page": "1964 FA Cup Final", "response": ["|RH ||4 || Nobby Lawton (c)"]}, {"page": "FA Youth Cup Finals of the 1950s", "response": ["1–2 52 min. Nobby Lawton"]}, {"page": "1962–63 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Nobby Lawton"]}, {"page": "1959–60 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Nobby Lawton"]}, {"page": "1960–61 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Nobby Lawton"]}, {"page": "1961–62 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Nobby Lawton"]}]}}