{"wiki_id": "http://www.wikidata.org/entity/Q7046946", "itemLabel": "Noel Forster", "itemDescription": "British artist (1932-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_Forster", "wikipedia_page": {"main": "Noel Armstrong Forster (15 June 1932 – 7 December 2007) was a British artist who trained at King's College Newcastle a part of Durham University, graduating in 1957.\nForster was born in Seaton Delaval, Northumberland and attended to Gosforth Grammar School.\nHe married  Eileen Conlon in 1962, later having three sons with her. In due course he became Principal lecturer in Painting at the Chelsea College of Art & Design in Chelsea as well as Artist-in-Residence and Supernumerary Fellow at Balliol College Oxford University. In 1978 he won the John Moores Painting Prize His art can best be described as abstract, colourful and usually involving a cross-weaved fabric of straight or curved parallel lines drawn by hand, often executed in oil on linen. He died in London.\n\n\"Noel was in my view the most important post-War abstract painter in England, and his work combined performance, intellectual rigour and the artist's craft. It was simultaneously clever and sensuous. He was an influential teacher too and a very gifted musician. But he was also larger than life.\" Stephen Bury, Curator, British Library, 8 December 2007\n\n\"Noel was a splendid friend, and a wonderful painter.He thought endlessly about the relations of paint and light, and talked with extraordinary clarity - and complexity - about making works of art. He taught me a lot about looking.The ideas behind his own work were intricate and uncompromising.\"\n\nhttp://www.noelforster.co.uk AS Byatt, Author, Dec 2007\n\n\"Noel Forster was an adventurous and productive artist whose glowing, audacious personality looked out from his canvasses.\"\nObituary in The Times, 17 January 2008 Bernard Cohen, Artist, Dec 2007", "link_mentions": [{"page": "Camberwell College of Arts", "response": ["In the 1980s, Wendy Smith became the head of Fine Art and employed Noel Forster, John Hilliard, Cornelia Parker, Phyllida Barlow, Gavin Jantjes and Ian McKeever. Tony Messenger and Eileen Hogan took charge of the graphics department, Eileen Hogan established and ran The Camberwell Press, and Eric Ayers presided over the typography school."]}, {"page": "1978 in art", "response": ["* John Moores Painting Prize - Noel Forster for \"A painting in six stages with a silk triangle\""]}, {"page": "Seaton Delaval", "response": ["* Noel Forster – Artist and teacher"]}, {"page": "List of Durham University people", "response": ["* Noel Forster (King's) – British artist"]}, {"page": "Gosforth Academy", "response": ["| Noel Forster"]}, {"page": "2007 in art", "response": ["*7 December - Noel Forster, British painter (b.1932)"]}, {"page": "John Moores Painting Prize", "response": ["* 1978 Noel Forster - \"A painting in six stages with a silk triangle\""]}, {"page": "Deaths in December 2007", "response": ["*Noel Forster, 75, British artist."]}, {"page": "List of people from Northumberland", "response": ["* Noel Forster (1932–2007), abstract painter"]}, {"page": "Ian Stephenson", "response": ["Ian Stephenson  (11 January 1934 – 25 August 2000) was an English abstract artist. Stephenson trained at King's College, DurhamIan Stephenson Biography New Art Centre along with Noel Forster and had his first show in London at the New Vision Centre in 1958,Ian Stephenson 1934 – 2000 Tate website with a solo show at The New Art Centre in 1962. An exhibition of his work was exhibited at the Hayward Gallery in 1977 and his work can be found in the collections of the Tate, the British Council and Whitworth Art Gallery. His work was also featured in the 1966 film, Blow-Up by Michelangelo Antonioni."]}]}}