{"wiki_id": "http://www.wikidata.org/entity/Q7047254", "itemLabel": "Noel White", "itemDescription": "English football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_White", "wikipedia_page": {"main": "Noel White  (16 December 1929 – 30 June 2019) was a businessman, football club chairman, director and administrator from the North West of England. He was one of the founding architects of The Premier League and Life Vice President of The Football Association.", "link_mentions": [{"page": "Liverpool F.C.", "response": ["As the owner of Anfield and founder of Liverpool, John Houlding was the club's first chairman, a position he held from its founding in 1892 until 1904. John McKenna took over as chairman after Houlding's departure. McKenna subsequently became President of the Football League. The chairmanship changed hands many times before John Smith, whose father was a shareholder of the club, took up the role in 1973. He oversaw the most successful period in Liverpool's history before stepping down in 1990. His successor was Noel White who became chairman in 1990. In August 1991 David Moores, whose family had owned the club for more than 50 years, became chairman. His uncle John Moores was also a shareholder at Liverpool and was chairman of Everton from 1961 to 1973. Moores owned 51 percent of the club, and in 2004 expressed his willingness to consider a bid for his shares in Liverpool."]}, {"page": "Terry Venables", "response": ["As England automatically qualified for UEFA Euro 1996 as hosts, he organised friendlies to allow him to experiment and find his best squad for the tournament, and particularly to find the best tactical system to suit the players. Venables decided to stand down at the end of Euro 1996 after the FA's International Committee chairman Noel White refused to grant Venables a contract extension in December 1995; the FA insisted on evaluating England's performances in competitive fixtures before deciding on his future. In May 1996, Glenn Hoddle was announced as his successor, meaning that Venables would have no choice but to stand down as manager no matter how well England performed at the tournament."]}, {"page": "David Dein", "response": ["Dein was a key mover in the FA's manoeuvreing to hire Sven-Göran Eriksson as England manager in 2001. Five years later, in 2006 he was one of four members of an FA panel (the others being Brian Barwick, Noel White and Dave Richards) tasked with identifying Eriksson's replacement. Dein's preferred choice, Luiz Felipe Scolari, was offered the job and looked set to take it but later changed his mind; the FA eventually chose Middlesbrough manager Steve McClaren."]}, {"page": "Foundation of the Premier League", "response": ["The foundation of the Premier League in English football occurred in the early 1990s. The first major step to its formation occurred in October 1990, when the managing director of London Weekend Television (LWT), Greg Dyke, met with the representatives of the \"big five\" clubs - David Dein of Arsenal, Philip Carter of Everton, Noel White of Liverpool, Martin Edwards of Manchester United and Irving Scholar of Tottenham Hotspur. The meeting was to pave the way for a breakaway from the Football League. Dyke believed that it would be more lucrative for ITV if only the larger clubs in the country were featured on national television and wanted to establish whether the clubs would be interested in a larger share of television rights money."]}, {"page": "2013 Birthday Honours", "response": ["*Noel White. For services to Football."]}, {"page": "Deaths in June 2019", "response": ["*Noel White, 95, Australian rugby league player (national team).Obituary: Full-time for Australia's oldest Kangaroos representative - Kurri Kurri Bulldogs winger Noel White", "*Noel White, 89, British businessman and football club chairman (Liverpool).RIP Noel White"]}]}}