{"wiki_id": "http://www.wikidata.org/entity/Q7052138", "itemLabel": "Norman Davidson", "itemDescription": "Scottish biochemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Davidson_(biochemist)", "wikipedia_page": {"main": "James Norman Davidson CBE PRSE FRS (5 March 1911 – 11 September 1972) was a Scottish biochemist, pioneer molecular biologist and textbook author. The Davidson Building at Glasgow University is named for him.", "link_mentions": [{"page": "John Steven Watson", "response": ["In 1968 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Anthony Elliot Ritchie, Norman Davidson, Robert Schlapp and Neil Campbell, Lord Balerno. DePauw University awarded him an honorary doctorate (DLitt) in 1967. In 1972 he received a further honorary doctorate in Humane Letters (DHum) from St Andrews."]}, {"page": "James Davidson", "response": ["*Norman Davidson (biochemist) (James Norman Davidson, 1911–1972), Scottish biochemist, molecular biologist and textbook author"]}, {"page": "William Weipers", "response": ["In 1953 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Norman Davidson, Robert Campbell Garry, William McGregor Mitchell and George Montgomery."]}, {"page": "James Norman Davidson", "response": ["#REDIRECT Norman Davidson (biochemist)"]}, {"page": "J Norman Davidson", "response": ["#REDIRECT Norman Davidson (biochemist)"]}, {"page": "Norman Davidson", "response": ["Norman Davidson may refer to:", "* Norman Davidson (biochemist) (1911–1972), Scottish biochemist, pioneer molecular biologist", "* Norman Davidson (biologist) (1916–2002), American biologist"]}, {"page": "J. Norman Davidson", "response": ["#REDIRECT Norman Davidson (biochemist)"]}, {"page": "Alastair Currie", "response": ["In 1964 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were George L Montgomery, James Norman Davidson, Thomas Symington and Richard H A Swain. He served as their Vice-President 1988–90 and President 1991–93"]}, {"page": "List of people educated at George Watson's College", "response": ["* Norman Davidson (biochemist), CBE"]}, {"page": "Kenneth Boyd Fraser", "response": ["In 1961 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Guido Pontecorvo, Daniel Fowler Cappell, Norman Davidson, and William Ogilvy Kermack."]}, {"page": "Peter Joseph Heald", "response": ["In 1968 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Anthony Elliot Ritchie, Peter Pauson, Sir David Cuthbertson, Norman Davidson, and Reginald Brettauer Fisher."]}, {"page": "Arthur St George Huggett", "response": ["From 1919 he acted as a Demonstrator in the Physiology lectures at St Thomas's Hospital in London. In 1925 he received his first doctorate (PhD) and a second (DSc) in 1930 at which point he was promoted to Lecturer. He was given a full professorship at St Marys Hospital Medical School in 1935 where he then worked until retiral in 1964. He was elected a Fellow of the Royal Society of London in 1958 and a fellow of the Royal Society of Edinburgh in 1965. His proposers for the latter were Robert Campbell Garry, Norman Davidson, Hamish Munro and Paul Bacsich ."]}, {"page": "Iwo Lominski", "response": ["In 1958 he was elected a fellow of the Royal Society of Edinburgh. His proposers were Carl Hamilton Browning, John Walton, Norman Davidson, and John Monteath Robertson."]}, {"page": "George Montgomery (pathologist)", "response": ["In 1950 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Norman Davidson, Robert Garry, Alexander Murray Drennan and Charles Wynford Parsons."]}, {"page": "Rona MacKie", "response": ["Rona McLeod Davidson was born in Dundee in 1940, the daughter of Professor James Norman Davidson, CBE, PRSE, FRS, and his wife Dr Morag, née McLeod.\"MacKie, Prof. Rona McLeod, (Lady Black)\", Who's Who 2017 (A & C Black; online edition, Oxford University Press, November 2016). Retrieved 18 November 2017. Her father was Gardiner Professor of Biochemistry at the University of Glasgow from 1947 to 1972.\"Rona MacKie\", University of Glasgow. Retrieved 18 November 2017. Davidson attended Channing School and Laurel Bank School, before studying at the University of Glasgow; she graduated with her medical  degrees (MB ChB) in 1963, and was awarded a doctor of medicine (MD) degree by the university in 1970. She has been married twice; firstly to Euan Wallace MacKie, and secondly, between 1994 and his death in 2010, to the pharmacologist Sir James Whyte Black, OM, FRS, FRSE."]}, {"page": "Anthony Elliot Ritchie", "response": ["In 1951 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Norman Davidson, Robert Garry, Ernest Cruickshank, and Sir James Learmonth. He served as Secretary to the Society 1960 to 1965 and was twice Vice President: 1965-66 and 1976–79, being General Secretary in between. He won the Society's Bicentenary Medal in 1983."]}, {"page": "Harold Scarborough", "response": ["*Textbook of Physiology and Biochemistry (1950 and multiple later editions) with George Bell and Norman Davidson (jointly known as BDS - Bell Davidson Scarborough)"]}, {"page": "William John Tulloch", "response": ["He was elected a Fellow of the Royal Society of Edinburgh in 1960. His proposers were George Bell, Norman Davidson, Ian George Wilson Hill and Ernest Geoffrey Cullwick."]}]}}