{"wiki_id": "http://www.wikidata.org/entity/Q7052472", "itemLabel": "Norman Lash", "itemDescription": "British general", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Lash", "wikipedia_page": {"main": "Norman Oliver Lash (1908–1960)  was a British police officer seconded to the Jordanian Arab Legion. On 15 May 1948, Brigadier Norman Lash was handed the field command of the operations of the Arab Legion in Palestine.He appointed Abdullah el Tell to lead the offensive on Jerusalem during the 1948 Palestine war, the war for which he was criticised by many British officials for being the field commander of an Arab army. A representative of the British chief of staff, described Glubb Pasha, and his two senior aides, Norman Lash and Ronald Broadhurst as \"Soldiers of fortune of British nationality\" during the 1948 war.Ironically, he was also criticised by Arab officers, as being more of a politician than a military leader. \nHe negotiated the Jordanian-Israeli armistice agreement, that resulted in what came to be known as the green line. \nNorman Lash reached the rank of Major General, and was retired from Jordan's Arab Legion on 1 April 1951. He was replaced by Brigadier Sam Sidney Arthur Cooke of the Lincolnshire Regiment. According to Ma'an Abu Nawwar, an Arab officer in the Arab Legion Norman Lash had less experience as a soldier, compared to his successor Cooke.", "link_mentions": [{"page": "Arab Legion", "response": ["The Arab Legion actively participated in the 1948 Arab–Israeli war. With a total strength of just over 6,000, the Arab Legion's military contingent consisted of 4,500 men in four single battalion-sized regiments, each with their own armored car squadrons, and seven independent companies plus support troops. The regiments were organized into two brigades. 1st Brigade contained 1st and 3rd Regiments while 3rd brigade contained 2nd and 4th Regiments. There were also two artillery batteries with four 25-pounders each. On 9 February 1948 the Transjordan Frontier Force was disbanded with members being absorbed back into the Arab Legion. Although headed by Glubb, now a Lieutenant General, command in the field was by Brigadier Norman Lash."]}]}}