{"wiki_id": "http://www.wikidata.org/entity/Q7052515", "itemLabel": "Norman Low", "itemDescription": "Footballer, football manager (1914-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Low", "wikipedia_page": {"main": "Norman Harvey Low (23 March 1914 – 21 May 1994) was a Scottish football player and manager. He was the son of Scottish international footballer, Wilf Low.\nA central defender, he played for Newcastle United between 1931 and 1933, before a three years spell with Liverpool. From 1936 up until the end of World War II he turned out for Newport County, helping the club to the Third Division South title in 1938–39. After the war he spent 1946 to 1950 with Norwich City.\nIn 1950 he was appointed as Norwich City's manager, and led to the club to a second-place finish in the Third Division South in 1950–51. Despite this, promotion alluded him before he departed in April 1955. He spent January 1956 to February 1957 as Workington's manager, before he was installed in the hotseat at Port Vale. He led the club to the Fourth Division title in 1958–59, before resigning in October 1962. Spending time as a scout at Stoke City and Liverpool, he was made Witton Albion manager in 1967, before he took to the United States for a brief spell in charge of the Cleveland Stokers in 1968.", "link_mentions": [{"page": "Port Vale F.C.", "response": ["After becoming one of the more prominent football clubs in Staffordshire, Burslem Port Vale were invited to become founder members of the Football League Second Division in 1892. They spent 13 non-consecutive seasons in the division, punctuated by two seasons in the Midland League, before they resigned due to financial difficulties and entered liquidation in 1907. The name of Port Vale continued in the North Staffordshire Federation League, and this new club were successful enough to be reinstated into the Football League in October 1919. They spent 16 non-consecutive seasons in the Second Division, punctuated by them winning the Third Division North title in 1929–30, before dropping back into the third tier for a much longer stay at the end of the 1935–36 campaign. The 1953–54 season saw manager Freddie Steele's \"Iron Curtain\" defence win both a Third Division North title and a semi-final place in the FA Cup. They failed to build on this success however, although went on to finish as champions of the first Fourth Division season under Norman Low's stewardship in 1958–59.", "Port Vale moved into their new home of Vale Park in 1950, and a year later Freddie Steele was appointed club manager. Steele quickly established himself at the club, masterminding the celebrated 'Iron Curtain' defence. The 1953–54 season saw Vale winning the Third Division North title as well as reaching the semi-finals of the FA Cup, losing out to eventual winners West Bromwich Albion in controversial fashion, in which an Albert Leake goal was disallowed for offside. Three years later, the club were again relegated, and once again became founder members of a division – this time the Football League Fourth Division. Manager Norman Low instilled an attacking philosophy and in the 1958–59 season guided the team to the Fourth Division title with a club record 110 goals scored.", "Tom Morgan was the first Port Vale manager to win a league title with the club, taking them to the top of the Third Division North at the end of the 1929–30 season. Freddie Steele repeated the feat during the 1953–54 campaign, also taking the club to the semi-finals of the FA Cup. He was followed by Norman Low, who led Vale to the Fourth Division title in 1958–59. Gordon Lee (1969–70), John McGrath (1982–83) and Micky Adams (2012–13) also secured promotions. Retrieved 11 June 2020. John Rudge led the club to three promotions – 1985–86, 1988–89 and 1993–94 – as well as a Football League Trophy title in 1993.Kent, Jeff. What If There Had Been No Port in the Vale?: Startling Port Vale Stories! (Witan Books, 2011, ) His successor, Brian Horton also secured a Football League Trophy final victory in 2001."]}, {"page": "Norwich City F.C.", "response": ["With crowds continuing to rise, and with the Football Association raising concerns over the suitability of The Nest, the club considered renovation of the ground, but ultimately decided on a move to Carrow Road. The inaugural match, on 31 August 1935 against West Ham United, ended in a 4–3 victory for the home team and set a new record attendance of 29,779. The biggest highlight of the following four seasons was the visit of King George VI to Carrow Road on 29 October 1938. However the club was relegated to the Third Division at the end of the season. The league was suspended the following season due to the Second World War, and did not resume until the 1946–47 season. City finished this and the following season in 21st place, the poor results forcing the club to apply for re-election to the league. The club narrowly missed out on promotion under the guidance of manager Norman Low in the early 1950s, but following the return of Tom Parker as manager, Norwich finished bottom of the football league in the 1956–57 season.", "| style=\"text-align:left;\"|Norman Low"]}, {"page": "Cleveland Stokers", "response": ["Stokers' head coach Norman Low returned to England and did scouting. He later briefly scouted for the ASL Cleveland Cobras. Metzenbaum embarked on a high-profile political career, while Bonda became a prominent Cleveland figure in education, business, and sports."]}, {"page": "Workington A.F.C.", "response": ["*Norman Low – Jan 1956 to Feb 1957"]}]}}