{"wiki_id": "http://www.wikidata.org/entity/Q7051934", "itemLabel": "Norman Ayrton", "itemDescription": "British theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Ayrton", "wikipedia_page": {"main": "Norman Ayrton (25 September 1924 – 22 June 2017) was an actor, director, and theatre instructor.  \nAs a young man, Ayrton's home was bombed during the London Blitz, forcing him to relocate to the countryside. He later described this experience as having given him the courage to pursue a career in theatre. He trained for the stage at the Old Vic School under the tutelage of Michel Saint-Denis before joining the company in 1948. After spending several years acting in repertory theatre in Farnham and Oxford, Ayrton returned to the Old Vic Theatre in 1951 to teach movement. The following year he opened his own teaching studio in London, though he also taught at the Royal Shakespeare Theatre in Stratford.In 1954, Ayrton was appointed the Assistant Principal of the London Academy of Music and Dramatic Art, a position he held until 1966, whenceforth he served as the Academy's Principal until 1972. Ayrton served as the CHQ Drama Adviser to the Girl Guide Movement from 1960 through 1975. In 1973, Ayrton served as a guest theatre consultant to the Australian Council for the Arts. In 1963, he directed his first London opera production with Artaxerxes at the Handel Society. He went on to direct his first production in the United States in 1967 with Twelfth Night in Dallas, Texas. Ayrton joined the faculty at the Juilliard School in 1974. Two years later, he directed his first production at the Sydney Opera House with Lakmé. Ayrton has also directed operas at the Covent Garden.In his later years, Ayrton taught classes in the British American Drama Academy's Midsummer Conservatory Program, a summer Shakespearean acting workshop for students from the UK, US, and Mexico.\nHe died at Denville Hall on 22 June 2017 at the age of 92.\n\n", "link_mentions": [{"page": "September 25", "response": ["*1924 – Norman Ayrton, English actor and director (d. 2017)"]}, {"page": "Joan Sutherland", "response": ["A State Memorial Service on 9 November 2010, arranged by Opera Australia, was held at the Sydney Opera House.Joyce Morgan, 'A Fitting Finale for La Stupenda' http://www.smh.com.au/entertainment/opera/a-fitting-finale-for-la-stupenda-20101109-17m2d.html Speakers at the service were Julia Gillard, Prime Minister of Australia; Professor Marie Bashir, the Governor of New South Wales; Moffatt Oxenbould, the former Artistic Director of Opera Australia; and Sutherland's son, Adam Bonynge. The service was broadcast live by both ABC1 television and ABC Classic FM (radio) and streamed globally by ABC News 24. Further memorial services were held in Westminster Abbey on 15 February 2011, and in New York City on 24 May 2011, which was hosted by Marilyn Horne with an appearance by Richard Bonynge. In attendance were Sherrill Milnes, Norman Ayrton, Regina Resnik, and Spiro Malas."]}, {"page": "London Academy of Music and Dramatic Art", "response": ["*Norman Ayrton"]}, {"page": "Ayrton", "response": ["* Norman Ayrton (1924–2017), English actor, director, and theatre instructor"]}, {"page": "Paul Courtenay Hyu", "response": ["He gained a place at the London Theatre School, where he studied under Barbara Buckmaster, Belinda Quirey MBE, Norman Ayrton and Charles Duff, winning Mike Loades' prize fight competition with Christopher Chaplin, son of Charlie Chaplin."]}, {"page": "Deaths in June 2017", "response": ["*Norman Ayrton, 92, British actor, director and theatre instructor.Ayrton"]}, {"page": "University of Bristol Theatre Collection", "response": ["Including: Norman Ayrton (1924–2017), John Percy Burrell (1910–1972), Hugh Hunt (1911–1993), John Moody (1906–1993), David Phethean (1918–2001), Alex Reeve, and Jules Wright (1948–2015)."]}]}}