{"wiki_id": "http://www.wikidata.org/entity/Q7052799", "itemLabel": "Norman Smith", "itemDescription": "journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Smith_(journalist)", "wikipedia_page": {"main": "Norman Stuart Smith (born 30 April 1959) is a British journalist. He became the chief political correspondent of BBC News in 2011, and was its assistant political editor from 2014 to 2020.", "link_mentions": [{"page": "Daily Politics", "response": ["The regular reporters were Ellie Price, Elizabeth Glinka and Greg Dawson. Adam Fleming contributed regularly as a correspondent for the EU political situation in Brussels, having previously been a regular reporter for the programme at home. Other regular contributors to the show included either the BBC's Political Editor Laura Kuenssberg, her deputy John Pienaar or the BBC's Assistant Political Editor Norman Smith – who either helped to review Prime Minister's Questions on Wednesday's extended shows or contributed as correspondents for the programme."]}, {"page": "Laura Kuenssberg", "response": ["In September 2011, Kuenssberg took up the newly created role of business editor for ITV News, and was replaced at BBC News by Norman Smith from BBC Radio 4. She also contributed towards business reporting on ITV's current affairs strand, Tonight. On 27 August 2013, she made her debut co-newscasting News at Ten with Alastair Stewart."]}, {"page": "Norman Smith", "response": ["*Norman Smith (journalist) (born 1959), British BBC journalist", "*Norman Smith (record producer) (1923–2008), English musician, record producer and engineer", "*Norman Smith (politician) (1890–1962), British Labour Party politician", "*Norman Smith (footballer, born September 1897) (1897–1978), footballer for Charlton Athletic and Queens Park Rangers", "*Norman Smith (footballer, born December 1897) (1897–1978), footballer for Huddersfield Town, Sheffield Wednesday and Queens Park Rangers, and later manager of Newcastle United", "*Norman Smith (South African footballer) (born 1982), South African footballer for Jomo Cosmos"]}, {"page": "Gary O'Donoghue", "response": ["O'Donoghue undertook work experience at the BBC. He then joined the BBC on graduation from university, becoming a junior reporter on BBC Radio 4's Today programme; at one time, he was asked to bungee jump off Chelsea Bridge. During his career, he has covered stories for BBC News in Africa, Asia, Europe, and the U.S. In 2004, O'Donoghue became a political correspondent based at Westminster, reporting across the media of radio, television, and internet. From October 2011, O'Donoghue was the Chief Political Correspondent for BBC Radio 4 replacing Norman Smith, primarily reporting for the Today and PM programmes."]}, {"page": "List of Old Oundelians", "response": ["*Norman Smith, Assistant Political Editor of BBC News"]}, {"page": "A Journey", "response": ["Before the launch, Blair announced that he would give the £4.6-million advance and all royalties from his memoirs to a sports centre for injured soldiers. In an interview with Jonathon Gatehouse, he conceded, \"You wouldn't be human if you didn't feel both a sense of responsibility and a deep sadness for those who have lost their lives. That responsibility stays with me now, and will stay with me for the rest of my life. You know, I came to office as prime minister in 1997, focusing on domestic policy and ended up in four conflicts – Sierra Leone, Kosovo, Afghanistan and Iraq. And it does change you, and so it should.\" BBC political correspondent Norman Smith said Blair's severest critics would see the donation as \"guilt money\" for taking the UK to war against Iraq in 2003. The father of a soldier killed there decried the donation as \"blood money\", while the father of another serviceman who died said Blair had a \"guilty conscience.\" A spokesperson for the Stop the War Coalition supported the donation, but added, \"No proportion of Tony Blair's massive and ill-gotten fortune can buy him innocence or forgiveness. He took this country to war on a series of lies against the best legal advice and in defiance of majority opinion.\" A spokesman for Blair said that it had long been his intention to give the money to a charity; he added aiding soldiers undergoing rehabilitation at the Battle Back Challenge Centre was \"his way of honouring their courage and sacrifice.\" The announcement was welcomed by Chris Simpkins, director general of the Royal British Legion, who said, \"Mr Blair's generosity is much appreciated and will help us to make a real and lasting difference to the lives of hundreds of injured personnel.\""]}, {"page": "Craig Oliver (British journalist)", "response": ["On 28 May 2012, video footage was posted on the internet of Oliver reprimanding BBC News correspondent Norman Smith over the content of a story concerning a memo Secretary of State for Culture, Media and Sport Jeremy Hunt sent to David Cameron about his thoughts on News Corporation's bid to take full control of BSkyB. Oliver did not appear to realise the cameras were rolling during their exchange."]}, {"page": "2016 United Kingdom European Union membership referendum", "response": ["| Sophie Raworth, Victoria Derbyshire & Norman Smith"]}, {"page": "2015 in British television", "response": ["|BBC Assistant Political Editor Norman Smith accidentally uses the word \"cunt\" during a live broadcast while reporting on an article in The Times in which UKIP campaign chief Patrick O'Flynn expressed his concern that Nigel Farage is turning the party into a \"personality cult\"."]}, {"page": "Victoria Derbyshire (TV programme)", "response": ["| 2015–2020 ||Norman Smith"]}, {"page": "Vicki Young", "response": ["Young's career at the BBC began as a reporter at BBC Wales before joining the One O'Clock News as a political correspondent. She was a correspondent for BBC Breakfast from 2008 to 2011. In 2015, Young was promoted to the role of BBC News' chief political correspondent. She was given the position in response to Norman Smith's promotion to assistant political editor. In 2014, she served as a sit-in reporter for Daily Politics and has also reported for BBC Radio 4 and BBC Radio 5 Live. In 2020 she was appointed as deputy political editor."]}]}}