{"wiki_id": "http://www.wikidata.org/entity/Q7052559", "itemLabel": "Norman Macrae", "itemDescription": "British economist and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Macrae", "wikipedia_page": {"main": "Norman Alastair Duncan Macrae  (1923 – 11 June 2010) was a British economist, journalist and author, considered by some to have been one of the world's best forecasters when it came to economics and society.", "link_mentions": [{"page": "Mill Hill School", "response": ["* Norman Macrae, British journalist, former Deputy Editor of The Economist"]}, {"page": "James Goldsmith", "response": ["Goldsmith became an active campaigner on environmental issues during his later years. He published a book entitled The Trap in 1994 outlining what he believed were some key challenges facing humanity, with a focus particularly on the fields of modern intensive farming and the use of nuclear power. This area had been a lifelong passion of his brother, Edward, but Goldsmith himself had shown little interest publicly in the topic during his business career. The book received criticism of its content from a variety of sources, including the European Commission, the British Tory politician Chris Patten, Brian Hindley of the Neo-Liberal Centre for Policy Studies, John Kay and Norman Macrae. Goldsmith published detailed rejoinders in another publication entitled The Response, published in 1995."]}, {"page": "Order of the Rising Sun", "response": ["* Norman Macrae (1923–2010), 1988"]}, {"page": "Post-war consensus", "response": ["\"Butskellism\" was a somewhat satirical term sometimes used in British politics to refer to this consensus, established in the 1950s and associated with the exercise of office as Chancellor of the Exchequer by Rab Butler of the Conservatives and Hugh Gaitskell of Labour. The term was inspired by a leading article in The Economist by Norman Macrae which dramatised the claimed convergence by referring to a fictitious \"Mr. Butskell\".The Economist, February 1954The Economist. \"The unacknowledged giant\", 27 June 2010"]}, {"page": "Intrapreneurship", "response": ["The first written use of the terms ‘intrapreneur’, ‘intrapreneuring,’ and ‘intrapreneurship’ date from a 1978 white paper, Intra-Corporate Entrepreneurship, by Gifford Pinchot III and Elizabeth S. Pinchot.Pinchot, Gifford & Pinchot, Elizabeth (Fall 1978) Intra-Corporate Entrepreneurship  Tarrytown School for Entrepreneurs Later Norman Macrae, who read the white paper, credited the term to Gifford Pinchot III in the April 17, 1982 issue of The Economist.Macrae, Norman (April 17, 1982) Intrapreneurial Now  The Economist The first formal academic case study of corporate entrepreneurship or intrapreneurship was published in June 1982, as a Master's in Management thesis, by Howard Edward Haller, on the intrapreneurial creation of PR1ME Leasing within PR1ME Computer Inc. (from 1977 to 1981). This academic research was later published as a case study by VDM Verlag as Intrapreneurship Success: A Prime Example."]}, {"page": "Clach an Tiompain", "response": ["The stone was originally located further down the hill, towards Dingwall, but was moved to its current site in 1411.Scott, Douglas, The Stones of the Pictish Peninsulas, (Hilton Trust, 2004). One old tradition is that the stone marks the site of a Scottish clan battle that took place in 1411 between the Clan Munro and a branch of the Clan MacDonald, and that the stone commemorates a Munro victory as it is marked with their symbol, an eagle. According to Norman Macrae the stone was placed there by the Munros while marching against Donald of Islay, Lord of the Isles.  "]}, {"page": "Battle of Dingwall", "response": ["According to Alister Farquar Matheson, Angus Mackay led a force of Mackays, Munros, Mackenzies and Dingwalls at the Battle of Dingwall against Donald of Islay, Lord of the Isles. According to Norman Macrae, The Eagle Stone near Dingwall was placed there by the Munros while marching against Donald of Islay, Lord of the Isles in 1411. However, according to Fraser of Reelig, there is no positive proof for the assumption that the Munros were with Angus Mackay at this battle and that some Munros did in fact fight in the Lord of the Isles' host at the subsequent Battle of Harlaw."]}, {"page": "Geoffrey Crowther, Baron Crowther", "response": ["He nurtured the careers of a number of distinguished journalists and writers, including Roland Bird, Donald Tyerman, Barbara Ward, Isaac Deutscher, John Midgley, Norman Macrae, Margaret Cruikshank, Helen Hill Miller, Marjorie Deane, Nancy Balfour, Donald McLachlan, Keith Kyle, Andrew Boyd and George Steiner. He was particularly supportive of the careers of women at a time when this was remarkable in the newspaper world."]}, {"page": "MacRae", "response": ["*Norman Macrae (1923–2010), British economist and writer "]}, {"page": "Deaths in June 2010", "response": ["*Norman Macrae, 86, British journalist, deputy editor of The Economist (1965–1988)."]}]}}