{"wiki_id": "http://www.wikidata.org/entity/Q7052335", "itemLabel": "Norman Heath", "itemDescription": "English football goalkeeper (1924-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Heath", "wikipedia_page": {"main": "Norman Harold Heath (31 January 1924 – November 1983) was an English footballer who played as a goalkeeper for West Bromwich Albion.", "link_mentions": [{"page": "Ted Purdon", "response": ["Purdon made a spectacular start to his Sunderland career, scoring twice on debut against Cardiff City and following that up with a hat-trick (association football) against Arsenal at Highbury in his second game. The first goal of the three, scored after only ten seconds, was believed to be the fastest goal in Sunderland's history. Playing alongside the likes of Len Shackleton and Billy Bingham, he scored 42 goals in 96 games for the club over a three-year career. Purdon was a big man whose \"physique allied to a total lack of fear made him a handful for any centre-half\"; West Bromwich Albion goalkeeper Norman Heath was in collision with him during a game and received spinal injuries so severe that he never played again."]}, {"page": "List of people from Wolverhampton", "response": ["* Norman Heath (1924–1983) – footballer, goalkeeper"]}, {"page": "Jimmy Sanders (footballer)", "response": ["Sanders joined Charlton Athletic from Cray Wanderers towards the end of the Second World War but found his progress hampered by both the outbreak of the war and the presence of Addicks legend Sam Bartram. His war service was spent with the Royal Air Force, for whom he was a gunner pilot before being invalided out. Deprived of playing time due to the presence of Bartram, he appeared as a guest player for Chelsea, Liverpool, Southampton and West Ham United before guesting for Albion, earning himself a £2,250 move to the Hawthorns. Sanders established himself as number one at the club until 1952 when he lost out to Norman Heath, although he continued to feature intermittently until his departure in 1958. He followed this with brief spells at Kettering Town, Coventry City and Hinckley Athletic before retiring in 1960. Following his retirement he left football to pursue a career in the pub trade, although he was distinguished by usually wearing his 1954 FA Cup Final winners medal around his neck."]}]}}