{"wiki_id": "http://www.wikidata.org/entity/Q7052410", "itemLabel": "Norman Jewson", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Jewson", "wikipedia_page": {"main": "Norman Jewson (12 February 1884 – 28 August 1975) was an English architect-craftsman of the Arts and Crafts movement, who practised in the Cotswolds. He was a distinguished, younger member of the group which had settled in Sapperton, Gloucestershire, a village in rural southwest England, under the influence of Ernest Gimson. Surviving into old age, he brought their ideas and working methods into the second half of the twentieth century. His book of reminiscences has become established as a minor classic of the English Arts and Crafts movement. His repair of the Tudor Owlpen Manor in 1925–26 is often regarded as his most representative and successful work.", "link_mentions": [{"page": "Cirencester", "response": ["Under the patronage of the Bathurst family, the Cirencester area, notably Sapperton, became a major centre for the Arts and Crafts movement in the Cotswolds, when the furniture designer and architect-craftsman Ernest Gimson opened workshops in the early 20th century, and Norman Jewson, his foremost student, practised in the town."]}, {"page": "Max Beerbohm", "response": ["Beerbohm and his wife Florence spent the period of the first world war (1914 to 1918) in a cottage belonging to William Rothenstein, next to Rothenstein's own residence Iles Farm, in Far Oakridge, Gloucestershire.Norman Jewson, By Chance I Did Rove, 1952, p. 106 The Arts and Crafts architect Norman Jewson remarked on his dapper appearance there: \"At first it amazed me to see him, in the depths of the country, in war time, always perfectly groomed and immaculately dressed as if for a garden party at Buckingham Palace, but as I got to know him better I realised that he just could not do anything else.\""]}, {"page": "Chipping Campden", "response": ["A number of artists and writers settled in the area, including F. L. Griggs, the etcher, who built Dover's Court (now known as New Dover's House), one of the last significant Arts and Crafts houses. He set up the Campden Trust in 1929 with Norman Jewson and others, initially to protect Dover's Hill from development. According to a 2018 report, Griggs \"sympathetically restored houses on the High Street, battled against a tide of ugliness that engulfed other towns and villages and used money he could ill afford to safeguard its surroundings\". In 1934, he raised funds to buy the Coneygree field (where rabbits had been raised generations earlier) for the National Trust to ensure its protection.https://www.countrylife.co.uk/architecture/arts-crafts-architect-fought-preserve-beauty-chipping-campden-184939#PYO9fQKlFel6olEZ.99, How an Arts-and-Crafts architect fought to preserve the beauty of Chipping Campdenhttp://www.thecampdenwonder.com/news/facts-around-the-town , Facts around the town Many of Griggs' etchings are preserved at the Ashmolean Museum in Oxford.http://www.ox.ac.uk/event/f-l-griggs-visions-england, F L Griggs: Visions of England"]}, {"page": "1929 in architecture", "response": ["* Rodmarton Manor in Gloucestershire, England, designed by the Barnsley brothers and Norman Jewson (begun 1909)."]}, {"page": "1926 in architecture", "response": ["** Restoration of the Tudor Owlpen Manor in the Cotswolds of England by Norman Jewson is completed."]}, {"page": "1884 in architecture", "response": ["* February 12 – Norman Jewson, English Arts and Crafts architect (died 1975)"]}, {"page": "1951 in architecture", "response": ["* Norman Jewson publishes his autobiographical By Chance I did Rove."]}, {"page": "1975 in architecture", "response": ["* August 28 – Norman Jewson, English Arts & Crafts architect (born 1884)"]}, {"page": "Chalford", "response": ["Chalford is noted for two fine Arts and Crafts movement churches. Christ Church (Church of England) contains work by Norman Jewson, William Simmonds, Peter Waals, Edward Barnsley, Norman Bucknell, amongst other distinguished artists and craftsmen working in the Cotswold tradition. The Church of Our Lady of the Angels (Roman Catholic), Brownshill, by W. D. Caroe (1930), contains outstanding stained glass by Douglas Strachan. France Lynch, part of the civil parish but a separate ecclesiastical parish has a splendid listed church, St John the Baptist, built by George Frederick Bodley who went on to build Washington National Cathedral in Washington DC."]}, {"page": "Bisley, Gloucestershire", "response": ["The area is noted for the wealth of its Cotswold stone houses of architectural and historic interest.Stroud Council Conservation Area No. 6 Bisley  They include Lypiatt Park, formerly the home of Judge H. B. D. Woodcock and then of the late Modernist sculptor Lynn Chadwick; Nether Lypiatt Manor, formerly the home of Violet Gordon-Woodhouse and Prince and Princess Michael of Kent; Daneway (near Sapperton, but within the parish of Bisley); Over Court; Througham Court (repaired in 1929 for the novelist Sir Michael Sadleir by Norman Jewson); and Jaynes Court, formerly the private residence of Simon Isaacs, 4th Marquess of Reading (born 1942).", "Througham Slad Manor is believed to date from the mid-16th century with 18th century additions, the manor was altered in the 1930s by Norman Jewson for W. A. Cadbury. In the 1970s, the house was owned by Mike Oldfield, who installed a recording studio in the barn."]}, {"page": "Uley", "response": ["* To the east is Owlpen Manor, a Tudor manor house connected with the arts and crafts movement, mainly built from the mid-fifteenth to early seventeenth centuries, but dating back to Saxon times. It was repaired by Norman Jewson in 1925–6, after one hundred years of neglect. Today it is a home of the Mander family."]}, {"page": "Plasterwork", "response": ["The craft of modelled plasterwork, inspired by the style of the early modern period, was revived by the designers of the Arts and Crafts movement in late-19th- and early-20th-century England. Notable practitioners were Ernest Gimson, his pupil Norman Jewson, and George P. Bankart, who published extensively on the subject. Examples are preserved today at Owlpen Manor and Rodmarton Manor, both in the Cotswolds."]}, {"page": "Rodmarton Manor", "response": ["Rodmarton Manor is a large country house, in Rodmarton, near Cirencester, Gloucestershire, built for the Biddulph family. It is a Grade I listed building. It was constructed in the early 20th century in an Arts and Crafts style, to a design by Ernest Barnsley. After Ernest's death in 1925, it was completed by Sidney Barnsley, his brother, and then by Norman Jewson, Ernest's son-in-law. All the construction materials were obtained locally, and hand worked by local craftsmen.", "As the Biddulphs were interested in the Arts and Crafts movement, using the manor house to give classes for villagers in crafts such as woodwork and embroidery. There were also plays and musical events for the villagers, including puppet shows for the children. Construction was paused during World War I and Barnsley died in 1926. The final part of the build was completed between 1926 and 1929 under the supervision of his brother, Sidney and his son-in-law, Norman Jewson. The built took a total of 23 years, largely due to the traditional methods being used, but also as no contractor was hired to manage the build."]}, {"page": "Kilve", "response": ["A further settlement lies along the ridge to the east of the village, with a steep and narrow lane running down to join Sea Lane at Meadow House, which was once the Rectory. From halfway down this lane there is a panoramic view of the coastline as far as North Hill in Minehead and across the channel to South Wales and the Brecon Beacons. In the foreground lie the Church of St Mary, the ruins of a medieval chantry and one old barn still standing, though dilapidated, with traditional round stone pillars. Alongside the chantry are two houses and a tea-garden. Lane End was built in traditional cob construction by the distinguished Arts and Crafts architect Norman Jewson as a summer house for himself."]}, {"page": "Michael Sadleir", "response": ["Sadleir lived at Througham Court, Bisley, in Gloucestershire, a fine Jacobean farmhouse altered for him by the architect Norman Jewson, c. 1929. He sold Througham Court in 1949 and moved to Willow Farm, Oakley Green, in Berkshire."]}, {"page": "Owlpen", "response": ["*Norman Jewson, By Chance I did Rove (Cirencester, 1951, 1973; Barnsley 1986)"]}, {"page": "Owlpen Manor", "response": ["Finally, in 1924–25, the Owlpen estate was sold for the first time in nearly one thousand years. The future of the manor house was assured when it was acquired and repaired by Norman Jewson, a Cotswold Arts and Crafts movement architect who had worked with Ernest Gimson and the brothers Sidney and Ernest Barnsley (who was his father-in-law) in Sapperton. In 1930, his friend, the artist F. L. Griggs dedicated his etching of Owlpen Manor to Jewson, who had 'saved this ancient house from ruin'. Jewson has documented his repair work in his classic memoir, By Chance I did Rove (1951, twice reprinted).", "*Norman Jewson, By Chance I did Rove (Cirencester, 1951, 1973; Barnsley 1986)"]}, {"page": "Ernest Gimson", "response": [";Kelmscott: cottages and the village hall (completed under Norman Jewson in 1933), Oxfordshire; ", "His architectural style is  \"solid and lasting as the pyramids… yet gracious and homelike\" (H. Wilson, 1899). Lethaby described him as an idealist individualist: \"Work not words, things not designs, life not rewards were his aims.\" Norman Jewson was his foremost student, who carried his design principles into the next generation and described his studio practices in his classic memoir By Chance I did Rove (1951).", "*Norman Jewson, By Chance I did Rove (Cirencester, 1951 (reprinted))"]}, {"page": "Jewson", "response": ["George Jewson bought a business in Earith in 1836 to trade goods in the Huntingdonshire Fens of East Anglia. Norman Jewson His son John Wilson Jewson (b. 1817) had 13 children: the eldest, George, at the time working with a timber merchant in Norwich, suggested expansion there.", "* Norman Jewson"]}, {"page": "1884 in the United Kingdom", "response": ["* 12 February – Norman Jewson, Arts and Crafts architect (died 1975)"]}, {"page": "F. L. Griggs", "response": ["His best-known etchings include 'Owlpen Manor' (1930), dedicated to his friend, the architect Norman Jewson, 'Anglia Perdita', 'Maur's Farm', 'St Botolph's, Boston', 'The Almonry', and 'Memory of Clavering'. Collections of his etched work are held in the Ashmolean Museum, the Fitzwilliam Museum, the Boston Public Library, and in major public collections worldwide."]}, {"page": "Sapperton, Gloucestershire", "response": ["Norman Jewson (1884-1975), friend and associate of Gimson, and son-in-law to Ernest Barnsley, lived at Bachelors' Court. His memoir, By Chance I did Rove (1952; twice reprinted) of village life and his association with the Gimson circle at the turn of the twentieth century is recognised as a minor classic of Cotswold literature.", "*Norman Jewson"]}, {"page": "Alfred Hoare Powell", "response": ["Alfred Powell with the younger architect Norman Jewson was the most significant associate of Ernest Gimson and the brothers Ernest and Sidney Barnsley at Sapperton, in Gloucestershire, in the Cotswold Arts and Crafts revival. He settled nearby at Gurners Farm, Oakridge Lynch in 1902, but sold the house in 1916, and moved to  The Thatched House, Tunley near Oakridge, in the 1920s, and later lived at Tarlton near Rodmarton. He worked with Detmar Blow and F.W. Troup for both the National Trust and the Society for the Protection of Ancient Buildings."]}, {"page": "Cirencester Park (country house)", "response": ["Subsequent earls were patrons of the Arts and Crafts movement, when Ernest Gimson and the Barnsley brothers, Sidney and Ernest, settled at Pinbury Park on the Cirencester estate in 1894. Norman Jewson joined them in 1907, and describes his life as a student of Gimson in Sapperton in his classic memoir, By Chance I did Rove (1952)."]}, {"page": "The Priest's House, Muchelney", "response": ["In the late 19th century it was rented by a farmer for storage. Because of its poor condition it was recommended for demolition in both 1896 and 1901. The Society for the Protection of Ancient Buildings organised a public appeal to raise money for repairs to which Jane Morris, Thomas Hardy and George Bernard Shaw contributed. As the funding for the restoration was no longer an issue the building was acquired, in 1911, by the National Trust who employed Ernest Barnsley of the Barnsley brothers, the Arts and Crafts movement master builders, to design and the work. It was carried out by Norman Jewson and William Weir. The work left in place and strengthened earlier structures where possible but added new aspects including a stone buttress and a kitchen range."]}, {"page": "Barnsley brothers", "response": ["They were also associated with the designers and makers Gordon Russell, the Dutch furniture designer-craftsman Peter Waals, or van der Waals, and the architect-designer Norman Jewson (who was Ernest Barnsley's son-in-law).", "Starting in 1909, the brothers collaborated in the design, construction and furnishing of Rodmarton Manor, a work completed by Ernest's son-in-law, Norman Jewson."]}, {"page": "Peter Waals", "response": [" thumb|right|140px| Norman Jewson  ", "After Gimson's death in 1919 Peter Waals continued to run the Daneway Workshops. By  the end of the year he was canvassing potential clients in his own name on Daneway headed paper  Leicester Arts and Museums Service The following year he was able to set up his own workshop at  Halliday's Mill with the help of Alfred James, Bearnes Hampton & Littlewood at  the foot of Cowcombe Hill in the nearby village of Chalford, employing many of Gimson's skilled craftsmen  including designer Norman Jewson. "]}, {"page": "Percy Jewson", "response": ["Jewson was the son of John William Jewson, and his wife Henrietta. He was the older brother of the architect Norman Jewson. He was involved for most of his career with the family's timber importing firm of Jewson and Sons Ltd. During World War I he served in France and Belgium as an officer of the Worcestershire Regiment, and was wounded."]}, {"page": "William Weir (architect)", "response": ["William Weir is best known for overseeing repairs to historic buildings including Dartington Hall, Tattershall CastleBritish Listed Buildings: Tattershall Castle, Tattershall and Bodiam Castle.Burman, Peter, Conservation Philosophy in Practice – a Scottish Perspective His work spanned more than forty British counties and more than 300 buildings, including scores of small town and country churches. He collaborated with many of the leading figures of the Arts and Crafts Movement such as William Morris, Ernest Gimson, Norman Jewson and Detmar Blow."]}, {"page": "Romford Garden Suburb", "response": ["A request was made by the committee in the building press for architects to take part in the exhibition which would give them the chance to showcase their talents.\"Romford Garden Suburb\", Westminster Gazette, 25 July 1910, p. 8. The response was good with 100 architects signing up, with some completing several houses on the development.  Of the notable architects, William Curtis Green, who had established his office just ten years previously, designed two properties, as did Baillie Scott, who was long established. Others included Robert van 't Hoff, Philip Tilden, Norman Jewson, and Raymond Unwin and Richard Barry Parker,The Book of the Exhibition of Houses and Cottages, Romford Garden Suburb, Gidea Park, pp. 10. who were both instrumental in the design of the garden suburb at Hampstead.\"Town planning and holding\", Hendon and Finchley Times, 30 October 1914, p. 3."]}, {"page": "Stoneywell", "response": ["Rockyfield Cottage, the last of Gimson's Ulverscroft houses, was built for his sister Margaret nearly ten years later, close by on Priory Lane ().Charnwood.gov.uk Listed buildings: Rockyfield Cottage, listed grade II in 1966. Accessed 13 September 2012 The building work for Rockyfield was supervised by Norman Jewson, who was younger than many of the Arts and Crafts circle, and this was one of his first projects away from their Cotswolds base. It was completed in 1908."]}, {"page": "Ready Token", "response": ["It is the site of a house which has a butterfly shaped plan which mirrors the local butterfly shaped road pattern designed by the Arts and Crafts movement architect, Norman Jewson, built in 1928–1929.Owlpen Manor Estate Norman Jewson, architect  by Nicholas Mander, 2012 , List of architectural works"]}, {"page": "Wormington Grange", "response": ["The house was later lived in by General Hastings Ismay, 1st Baron Ismay, , who remodelled the north side servants' quarters to Butler's design in 1947.  Hakewill's stables nearby were neo-classical after Sir Hans Sloane's inspirational style. The Cleggs completely re-designed the gardens to which wrought iron front gates, designed by Norman Jewson appeared in about 1930. The limestone and Sussex bond brickwork stable block, which has a slate roof, was added 1827. The central store room is of two storeys with single story wings containing the horse boxes. A workshop in the stable block is used by John Evetts, the Landmark Trust furnishing manager. He is the grandson of Hastings Ismay, and moved into the house in the 1970s."]}, {"page": "Weston-sub-Edge", "response": ["The church of St Lawrence was built in the 13th century. It underwent Victorian restoration by Frederick Preedy in the 1850s. The lych gate was added in 1922 by Norman Jewson."]}, {"page": "Jewson (disambiguation)", "response": ["* Norman Jewson (1884–1975), architect-craftsman of the Arts and Crafts movement"]}, {"page": "Entries in the Romford Garden Suburb exhibition", "response": ["|Norman Jewson"]}]}}