{"wiki_id": "http://www.wikidata.org/entity/Q7052600", "itemLabel": "Norman McKinnel", "itemDescription": "Scottish actor and playwright (1870-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_McKinnel", "wikipedia_page": {"main": "Norman McKinnel (10 February 1870 – 29 March 1932) was a Scottish stage and film actor and playwright, active from the 1890s until his death. He appeared in many stage roles in the UK and overseas as well as featuring in a number of films, the best known of which is Alfred Hitchcock's 1927 production Downhill. His surname was sometimes mistranscribed as McKinnell.", "link_mentions": [{"page": "Professor Moriarty", "response": ["* Norman McKinnel portrayed Moriarty in The Sleeping Cardinal (1931).", "| Norman McKinnel"]}, {"page": "Hobson's Choice (play)", "response": ["The first production was at the Princess Theatre in New York on November 2, 1915.  It then transferred to London on 24 June 1916 at the Apollo Theatre, before moving to the Prince of Wales Theatre on 20 November 1916 (starring Norman McKinnel, as Henry Hobson, Edyth Goodall as Maggie Hobson and Joe Nightingale as Willie Mossop). It was performed by the National Theatre at the Old Vic, London in 1964 (starring Michael Redgrave, Joan Plowright and Frank Finlay.)  The play was adapted for film several times and as a Broadway musical. The Crucible Theatre Sheffield staged a revival in June 2011 directed by Christopher Luscombe and starring Barrie Rutter, Zoe Waites and Philip McGinley."]}, {"page": "Dombey and Son", "response": ["*1917 – Dombey and Son a British Silent film starring Norman McKinnel as Paul Dombey and Hayford Hobbs as Walter Gay"]}, {"page": "Charles Ricketts", "response": ["Ricketts became a celebrated designer for the stage. \"Mr Ricketts is infallible in his ideas on costume\" observed The Times.\"The Shakespeare Memorial National Theatre\", The Times, 25 November 1910, p. 13 His career as a theatre designer lasted from 1906 to 1931. He began by working on a double bill of Wilde plays – Salome and A Florentine Tragedy – at the King's Hall, Covent Garden, given as a private production because Wilde's biblical drama was refused a licence for public performance. For the same company Ricketts designed Aeschylus's The Persians in 1907, for which his costumes and scenery received considerably better notices than the play.\"At the Play\", The Observer, 24 March 1907, p. 4; \"The Literary Theatre Society\", The Times, 25 March 1907, p. 8; and \"The Persians of Aeschylus\", The Manchester Guardian, 26 March 1907, p. 14 For the commercial theatre during the 1900s Ricketts designed Laurence Binyon's Attila (with Oscar Asche at His Majesty's Theatre), Electra by Hofmannsthal (with Mrs Patrick Campbell at the New Theatre, 1908), and King Lear (with Norman McKinnel, at the Haymarket, 1909).“Stage Designs by Charles Ricketts, R.A.” , Journal of the Royal Society of Arts, vol. 81, no. 4184, January 1933, p. 256 During the 1910s he designed Bernard Shaw's The Dark Lady of the Sonnets (1910), Arnold Bennett's Judith (1916), and Shaw's Annajanska, the Bolshevik Empress (1918)."]}, {"page": "Downhill (1927 film)", "response": ["Returning to his parents’ home, he finds that his father Sir Thomas Berwick (Norman McKinnel) believes him guilty of the false accusation.", "* Norman McKinnel as Sir Thomas Berwick"]}, {"page": "Edward Knoblock", "response": ["Between the turn of the century and his breakthrough success in 1911 Knoblock wrote The Partikler Pet (an adaptation of a play by Max Maurey), 1905; The Shulamite, adapted from Alice and Claude Askew's novel, 1906; The Cottage in the Air, adapted from Princess Priscilla's Fortnight, 1909; Sister Beatrice, (a translation of Maurice Maeterlinck's play), 1910; and The Faun 1911. During part of this period he held the post of reader of plays at the Kingsway Theatre, London, where Lena Ashwell and Norman McKinnel were in management together. Knoblock claimed that in eighteen months he read five thousand plays, \"and neither lost nor held up a single one of them\". In 1909 he returned to Paris, from where he made long visits to Tunis and Kairouan, absorbing the local colour and atmosphere that inspired him to write the play Kismet. It was taken up by Oscar Asche and presented at the Garrick Theatre in 1911, running for 328 performances in its first production,Gaye, p. 1533 and a further 222 in its first revival, in 1914.Parker, p. 1144"]}, {"page": "List of British films before 1920", "response": ["| The Shulamite || George Loane Tucker || Norman McKinnel, Manora Thew, Gerald Ames || Drama ||", "|Dombey and Son||Maurice Elvey||Norman McKinnel, Lilian Braithwaite, Hayford Hobbs||Drama||", "| Everybody's Business || Ralph Dewsbury|| Norman McKinnel, Gerald du Maurier||Drama||", "|Mary Girl || Maurice Elvey || Norman McKinnel, Margaret Bannerman, Edward O'Neill|| Drama ||"]}, {"page": "Hindle Wakes (play)", "response": ["The 1931 film starred Belle Chrystal as the mill girl and John Stuart as the employer's son, with Sybil Thorndike, Edmund Gwenn and Norman McKinnel. Parts of it were filmed in Blackpool."]}, {"page": "List of Scottish actors", "response": ["*Norman McKinnel (1870–1932)"]}, {"page": "List of British films of 1931", "response": ["|The Outsider||Harry Lachman||Joan Barry, Norman McKinnel||Drama||"]}, {"page": "The Sleeping Cardinal", "response": ["Adair is called to a meeting  with \"The Sleeping Cardinal\", a picture disguising the identity of Professor Moriarty (Norman McKinnel), and blackmailed into taking counterfeit money to Paris in his diplomatic pouch. Adair's concerned sister calls for the assistance of Sherlock Holmes (Arthur Wontner) and Dr. Watson (Ian Fleming) to investigate the reasons for her brother's gambling excesses and depressed moods. After Adair succumbs to an apparent suicide; Holmes deduces Moriarty's involvement from a trail of clues.", "*Norman McKinnel as Prof. Moriarty, alias Col. Henslowe"]}, {"page": "The Frightened Lady (1932 film)", "response": ["The Frightened Lady is a 1932 British thriller film directed by T. Hayes Hunter and starring Emlyn Williams, Cathleen Nesbitt, Norman McKinnel and Belle Chrystall. It was adapted by Bryan Edgar Wallace from his father Edgar Wallace's 1931 play The Case of the Frightened Lady, which was adapted again later for a 1940 film.", "* Norman McKinnel – Chief Inspector Tanner", "The New York Times found it \"considerably more diverting on the stage than it is on the screen...It is a rugged shocker, and when it was not stripped of some of its good scenes it kept the spectator guessing...It is, however, a talented performance that Mr. Williams gives. Cathleen Nesbit does very well as the somewhat sinister dowager Lady Lebanon and Norman McKinnel, although handicapped by the direction, lends a certain distinction to the rôle of Tanner.\""]}, {"page": "Hindle Wakes (1927 film)", "response": ["* Norman McKinnel as Nathaniel Jeffcote"]}, {"page": "The Outsider (1931 film)", "response": ["The Outsider is a 1931 British drama film directed by Harry Lachman and starring Joan Barry, Harold Huth and Norman McKinnel. The screenplay concerns an unorthodox osteopath who cures one of his patients, the daughter of a fellow Doctor. It was made at Elstree StudiosWood p.72 and based on the 1923 play of the same title by Dorothy Brandon, previously made into an American silent film in 1926. The film's sets were designed by Wilfred Arnold.", "* Norman McKinnel as Jasper Sturdee"]}, {"page": "Le Mariage de mademoiselle Beulemans", "response": ["In 1912, Sydney Blow and Douglas Hoare wrote a new English translation and stage adaptation of the Belgian comedy set in the Welsh town of Carmarthen as Little Miss Llewelyn. The play, which starred Hilda Trevelyan in the title role, was produced at the Vaudeville Theatre in London's West End by Norman McKinnel and ran from August 31, 1912 to February 20, 1913 for a total of one hundred and eighty-six performances and achieved popular success."]}, {"page": "Hindle Wakes (1931 film)", "response": ["Hindle Wakes is a 1931 British film drama, directed by Victor Saville for Gainsborough Pictures and starring Belle Chrystall and John Stuart.  The film is adapted from Stanley Houghton's 1912 stage play of the same name, which had previously been filmed twice as a silent in 1918 and 1927.  Saville had been the producer on the highly regarded 1927 version directed by Maurice Elvey.  Both Stuart and Norman McKinnel returned in 1931 to reprise their roles from the 1927 film.Hindle Wakes (1931) Moat, Janet. BFI Screen Online. Retrieved 6 October 2010", "* Norman McKinnel as Nathaniel Jeffcote"]}, {"page": "Hindle Wakes (1918 film)", "response": ["* Norman McKinnel as Nat Jeffcote"]}, {"page": "Rutherford and Son", "response": ["Rutherford and Son is a play by Githa Sowerby (1876–1970), written in 1912. It premiered in London in the same year with four matinee performances at the Royal Court followed by a run of 133 performances at the Vaudeville Theatre. The production was directed by Norman McKinnel who also took the role of Rutherford. The same production opened at the Little Theater, New York on Christmas Eve, 1912 and ran for 63 performances. The Times theatre critic, Arthur Bingham Walkley, called it \"a play not easily forgotten, and full of promise for the future as well as of merit in itself\", while the Saturday Review thought it showed \"what can be done in the modern theatre by keeping strictly to the point.\" Journalist Keble Howard, after an interview with Sowerby in 1912, wrote that, \"Rutherford and Son is a marvellous achievement...\"."]}, {"page": "Sherlock Holmes (1931 film series)", "response": ["The Sleeping Cardinal was well received so producer Julies Hagen rushed a second film into production. The Missing Rembrandt reunited director Leslie S. Hiscott with Wontner, Fleming, and Hewland and was released in 1932. Norman McKinnel joined the cast as Professor Moriarty. Loosely based on \"The Adventure of Charles Augustus Milverton\", the film altered the story converting a blackmailer to an art dealer. The Missing Rembrandt is now considered a lost film.", "In 1935, Wontner returned to the role for The Triumph of Sherlock Holmes. For this film, Wontner jettisoned the toupée and Ian Fleming returned to the role of Dr. Watson. Lyn Harding took over the role of Professor Moriarty from Norman McKinnel, and Charles Mortimer took over the role of Inspector Lestrade from Philip Hewland. Wonter's age, fifty-nine by this time, was too difficult to hide so Holmes is on the verge of retiring. The film is a very accurate adaptation of The Valley of Fear. The film received rave reviews which would lead to one final film."]}, {"page": "The Fake (1927 film)", "response": ["*Norman McKinnel as Ernest Stanton "]}, {"page": "White Face", "response": ["* Norman McKinnel - Inspector Mason"]}, {"page": "Potiphar's Wife (film)", "response": ["* Norman McKinnel as Lord Bromford "]}, {"page": "Pillars of Society (1920 film)", "response": ["Pillars of Society is a 1920 British silent drama film directed by Rex Wilson and starring Ellen Terry, Norman McKinnel and Mary Rorke. It was based on the 1877 play The Pillars of Society by Henrik Ibsen. Location shooting was done in Norway.", "* Norman McKinnel - John Halligan"]}, {"page": "Mary Girl", "response": ["Mary Girl is a 1917 British silent drama film directed by Maurice Elvey and starring Norman McKinnel, Jessie Winter and Margaret Bannerman.", "* Norman McKinnel as Ezra"]}, {"page": "List of Elstree Studios productions", "response": ["| The Outsider || Drama || Harry Lachman || Joan Barry, Harold Huth, Norman McKinnel"]}, {"page": "Dombey and Son (film)", "response": ["Dombey and Son is a 1917 British silent drama film directed by Maurice Elvey and starring Norman McKinnel, Lilian Braithwaite and Hayford Hobbs. It is an adaptation of the 1848 novel Dombey and Son by Charles Dickens.", "* Norman McKinnel - Paul Dombey"]}, {"page": "Adaptations of Les Misérables", "response": ["* 1913, The Bishop's Candlesticks, directed Herbert Brenon, adaptation of a popular one-act play by Norman McKinnel based on the first volume of the novel", "* 1929, The Bishop's Candlesticks, directed by George Abbott, adaptation of a popular one-act play by Norman McKinnel of the first volume of the novel, the first sound film adaptation, with Walter Huston as Jean Valjean", "* 1949, The Bishop's Candlesticks, based on the play by Norman McKinnel. Broadcast on BBC Television.  David Phethean played the role of the convict Jean Valjean.", "* 1901,The Bishop's Candlesticks, a one-act play by Norman McKinnel based on volume one of the novel."]}, {"page": "Great Catherine: Whom Glory Still Adores", "response": ["Written for the popular actress-manager and artist Gertrude Kingston,Shaw, Bernard. Bernard Shaw's Letters to Siegfried Trebitsch (letter of 27 August 1913) Great Catherine premiered on 18 November 1913 at London's West End performance space, Vaudeville Theatre,Great Catherine at Playography Ireland, a comprehensive database of new Irish plays produced professionally since 1904 paired with the one-act Hermon Ould play Before Sunset, and enjoyed a 30-performance engagement. Among other cast members were Edmund Breon as Edstaston and Norman McKinnel as Patiomkin."]}, {"page": "List of British films of 1920", "response": ["|Pillars of Society||Rex Wilson||Ellen Terry, Norman McKinnel||Drama||"]}, {"page": "List of British films of 1924", "response": ["|A Gamble in Lives||George Ridgwell||Malvina Longfellow, Norman McKinnel|| Drama ||"]}, {"page": "The Shulamite", "response": ["The play had only six characters, so could be staged at low cost, which made it attractive to Lena Ashwell's syndicate. It opened at the Savoy Theatre in London on 12 May 1906, with Ashwell in the lead role and Norman McKinnel as Krillet. The play ran for 45 performances at the Savoy between 12 May and 26 June 1906. The cast was:", "*Norman McKinnel as Simeon Krillet", "*Norman McKinnel as Simeon Knollett"]}, {"page": "Everybody's Business", "response": ["Everybody's Business is a 1917 British silent drama film directed by Ralph Dewsbury and starring Norman McKinnel, Gerald du Maurier and Matheson Lang.Low p.197", "* Norman McKinnel as John Briton  "]}, {"page": "A Gamble in Lives", "response": ["A Gamble in Lives is a 1920 British silent drama film directed by George Ridgwell and starring Malvina Longfellow, Norman McKinnel and Alec Fraser.Low p.370 It is based on the play The Joan Danvers by Frank Stayton.", "* Norman McKinnel as James Danvers "]}]}}