{"wiki_id": "http://www.wikidata.org/entity/Q7052201", "itemLabel": "Norman Evans", "itemDescription": "British actor (1901-1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Evans", "wikipedia_page": {"main": "Norman Evans (11 June 1901 – 25 November 1962) was a variety and radio performer, born in Rochdale, Lancashire, England.\nEvans was discovered by fellow Rochdale entertainer Gracie Fields. The act for which he is best remembered was \"Over the Garden Wall\", in which he played Fanny Fairbottom, a toothless hatchet-faced Lancastrian housewife gossiping over a garden wall, The routine was the inspiration for Les Dawson and Roy Barraclough's later Cissie and Ada characters. The one-sided conversations would embrace local gossip, including scandal about the neighbours and personal medical complaints, including silently mouthing words deemed too rude to be spoken out loud, and accompanied with a range of facial contortions and glances round for supposed eavesdroppers. Another famous stage sketch was \"The Dentist\" in which Evans played both patient and dentist, and in which he employed a large screen.\nHis first appearance on the London stage was alongside a young Betty Driver. Evans was the only pantomime dame to receive top billing at the London Palladium.\nIn May 1955, he lost his right eye in a serious car accident while driving near Preston. The accident was caused after he swerved trying to avoid a black cat.His final summer season was at Butlin's Holiday Camp, Pwllheli in 1962. He wrote to Clarkson Rose (another top pantomime dame) \"Working in a Butlin theatre is a terrific experience, and although I've not been too well, I've never been happier in my life\".\nNorman Evans is buried in Carleton Cemetery, Blackpool. The headstone of his grave is a low wall built from natural gritstone blocks. His epitaph (preceding birth and death dates) reads \"Norman's last garden wall!\"", "link_mentions": [{"page": "Les Dawson", "response": ["His characteristic routines featured Roy Barraclough and Dawson as elderly women, Cissie Braithwaite and Ada Shufflebotham. Barraclough's character Cissie had pretensions of refinement and corrected Ada's malapropisms or vulgar expressions. As authentic characters of their day, they spoke some words aloud but mouthed others, particularly those pertaining to bodily functions and sex. The characters were based on those Les Dawson knew in real life. He explained that this mouthing of words (or \"mee-mawing\") was a habit of Lancashire millworkers communicating over the loud noise of looms, then resorted to in daily life for indelicate subjects. To further portray the reality of northern, working-class women, Cissie and Ada would sit with folded arms, occasionally adjusting their bosoms by a hoist of the forearms. Many Cissie and Ada sketches were written by Terry Ravenscroft. This was also typical of pantomime dame style, an act copied from his hero, Norman Evans and his act Over the Garden Wall. Les Dawson was portly and often dressed in John Bull costume. He introduced to his BBC television shows a dancing group of fat ladies called the Roly Polys. Dawson's style as a comic was world-weary, lugubrious and earthy."]}, {"page": "Betty Driver", "response": ["At the age of eight, Driver began performing professionally, forced by her mother to appear with Terence Byron Repertory Theatre Company. She was singing for the BBC by the age of 10, and began touring across the UK in her first revue at the age of 12. While performing in London at the age of 14, Driver was spotted by the agent Bert Aza, who was in partnership with his brother Archie Pitt, Gracie Fields' husband. Despite her young age, he booked her for the lead in a revival of Mr Tower of London (alongside comedian Norman Evans) which ran for about two years. The same show had brought Gracie Fields to prominence 19 years earlier. She was also approached by George Formby after he and his wife Beryl Formby saw her perform in Manchester. The Formbys wanted Driver to appear in their new film Boots! Boots! (1934); however, according to Driver, Beryl Formby saw her rehearsing and decided that she did not want to be outperformed by Driver, and sent her away. The producers felt so bad about the way Driver had been treated that they refused to take her name off the film credits, even though it was long thought she did not appear in the theatrical release. It is now known that she did perform in the film, and her scene was included in the original release. In 1938, an edited version of the film was released which did not include her scene. A restored version of the film (including Driver's scene) has been released on DVD, which finally confirms her involvement in the film."]}, {"page": "Pantomime dame", "response": ["*Norman Evans – (1901–1962) \"Evans' distinctive dame evolved out of nosy neighbour Fanny Fairbottom, a character he played on the sketch show Mr Tower of London. Fanny was hugely popular, and allegedly inspired Les Dawson to create the character of Ada\" The Telegraph, 14 December  2005"]}, {"page": "Band Waggon", "response": ["Band Waggon was co-produced by Gordon Crier and Harry S. PepperPeter Hay , Canned Laughter: The Best Stories from Radio and Television (1992), p. 42Bandwaggon at britishcomedy.org.uk, accessed 30 July 2016 and was the first comedy show to be designed specifically for radio. Together with Monday Night at Seven, it established the practice of broadcasting a regular comedy and music programme at the same time each week. The show ended in 1940, allowing Askey to pursue a career in film and Murdoch to join the Royal Air Force. A show of the same name and starring Askey and Murdoch with Tommy Trinder was playing at the London Palladium when the Second World War broke out. The following year, another version - with Norman Evans in place of Trinder - played at the Blackpool Opera House."]}, {"page": "Cissie and Ada", "response": ["The pair created the characters in rehearsals, in homage to the music hall star Norman Evans, before being persuaded by the producer to use them in sketches in the show Sez Les. Although Dawson needed persuading to don drag, and Barraclough was nervous that he would not be able to match Dawson's talent for ad-libbing, the characters became permanent features of the show."]}, {"page": "List of people with surname Evans", "response": ["*I. H. N. Evans (Ivor Hugh Norman Evans, 1886–1957), British anthropologist, ethnographer and archaeologist", "*Norman Evans (1901–1962), English variety and radio performer", "*Norman Evans (architect), British architect"]}, {"page": "Billy Dainty", "response": ["In 1942 at the age of 15, he made his stage debut in the pantomime Mother Goose, starring Norman Evans and Patricia Burke, where he played the back end of a dancing pantomime donkey called \"Asbestos\". His next part was as a chorus boy in Strike a New Note at the Prince of Wales Theatre, with Sid Field and Jerry Desmonde, along with the newly formed pairing of Morecambe and Wise."]}, {"page": "Tommy Trafford", "response": ["He lived his early life in Blacko, near Nelson, where he performed in church productions alongside Jimmy Clitheroe, \"The Clitheroe Kid\", with whom he went to school. Tommy owned a traditional Blackpool guest house, as did many performers, which gave him the experience to run a country hotel and restaurant for Jimmy during a temporary 'retirement' from Showbiz. Of the many routines and characters that Tommy portrayed, his best known routine was a homage to Norman Evans’ ‘Over the Garden Wall’ sketch as the larger-than-life Fanny Fairbottom. Norman's widow, on seeing Tommy perform this on television said it was the best she had seen.", "He appeared on playbills as ‘Tommy Trafford - Laughs from Lancs’. In later life he specialised in playing pantomime dames (harking back to Norman Evans), putting on annual Christmas pantomimes at Southport between the 1960s and 1980s, for which he earned the sobriquet ‘Mr Southport’. With his business partner and fellow actor, singer and dancer Ronnie Parnell he also ran a theatrical costume hire business as well as jointly producing summer shows and old time music hall."]}, {"page": "List of British films of 1946", "response": ["|Demobbed||John E. Blakeley|| Norman Evans, Nat Jackley|| Comedy||", "|Under New Management||John E. Blakeley||Nat Jackley, Norman Evans||Comedy||"]}, {"page": "List of British films of 1950", "response": ["|Over the Garden Wall||John E. Blakeley||Norman Evans, Jimmy James||Comedy||"]}, {"page": "Carleton Crematorium and Cemetery", "response": ["* Norman Evans, variety and radio artiste", "Image:NormanEvans.jpg|Norman Evans' grave"]}, {"page": "Jimmy James (comedian)", "response": ["In James's first film for Mancunian Films in 1950, he starred with Norman Evans in Over the Garden Wall with Evans playing the role of his wife. His second film was Those People Next Door where he and Eli reprise James's drunk routine.", "* Over the Garden Wall (1950) with Norman Evans and Eli Woods."]}, {"page": "Betty Jumel", "response": ["She appeared in a number of films in the 1940s, appearing alongside Will Hay, Sandy Powell and Norman Evans. She also appeared in pantomime with Evans in Humpty Dumpty which was so successful that it ran from Christmas Eve to Easter. She and Evans also paired up for a radio series Good Evans."]}, {"page": "List of Royal Variety Performances", "response": ["| From London Rhapsody, Len Lewis, George Lane, Raymond Newell, Henry Carlisle, Serge Ganjou, Henry Carlisle, Mary Young, Rosarito, George Ganjou, The Gypsy Boys Band, Norman Evans, Florence Desmond, Señor Wences, George Formby, Cicely Courtneidge with the Harry Dennis Dance Sexette and the Sherman Fisher Girls, Max Miller, Jack La Vier, Ethel Revnell and Gracie West, Ralph Reader's Gang Show, The London Palladium Gang Show, Gracie Fields, Will Fyffe", "| Hy Hazell, The Alec Thomas Quartet, Marilyn Hightower, Three Shades, Valerie Tandy, Bobbie Tranter, Tony Hulley, The Three Astaires, Hortobagyi Troupe, Billy Russell, Wilson, Keppel and Betty, Norman Evans, Borrah Minnevitch's Harmonica Rascals, Mervyn Saunders, Mona and Oliver & The Girls, Wally Boag, Bud Flanagan, Jimmy Nervo, Teddy Knox, Charlie Naughton, Jimmy Gold, Frank Holloway, Willie Carlisle, Freddie Malcom, Jack Durrant, Robert Wilson, The Dagenham Piper Girls, Vic & Joe Crastonian, James Currie's Water Spectacle, Alan Bailey, Terri Carol, Cynthia & Gladys, The Three Garcias, Levanda, Marie Louise, Mariora, Olga Varona, Eva May Wong, Bobbie Kimber, Dolores Gray & Bill Johnson, Laurel and Hardy, The Zoris, Tommy Trinder, Gracie Fields.", "| The Gang and 'Monsewer' Eddie Gray, The Cavendish Singers, The John Tiller Girls, Erica Yorke, The Victoria Palace Girls, The Marie De Vere Dancers, Vera Lynn, Harry Secombe, The Wiere Brothers, Stanley Black and the Dance Orchestra, Tony Fayne, David Evans, Richard Murdoch, Kenneth Horne, Arthur English, Sally Ann Howes, Jimmy Edwards, Florence Desmond, Norman Evans, Alan and Blanche Lund, Pearl Primus and her Company, Hoops - The Boys, Joaquin Pérez Fernandes and his Latin American Company, The Mary De Vere Dancers, Johnny Hutch and the Seven Volants, Sam Browne and his Singers, The Keyboard Quintette, Carroll Gibbons, Billy Thorburn, Ivor Moreton and Davy Kaye, Charlie Kunz, Patricia Morison, Barbara Bruce, Nervo and Knox, Naughton and Gold, Bud Flanagan, Miklos Gafni, Vera Lynn and Michael Dalton, Frances Day, Florence Desmond, Sally Ann Howes, Adelaide Hall, Sylvia Peters, Carole Lynne, Valerie Tandy, Anona Winn, Chesney Allen, Jimmy Gold, Gracie Fields, George Mitchell Choir, Jack Radcliffe, Cicely Courtneidge."]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Norman Evans: 1937, 1947, 1951"]}, {"page": "Demobbed (1944 film)", "response": ["Demobbed is a 1944 British comedy film directed by John E. Blakeley and starring Norman Evans, Nat Jackley, Gus McNaughton and Dan Young.BFI.org Billed as \"a musical comedy burlesque,\" its plot concerns a group of ex-soldiers who attempt to gain employment after being demobbed from the army.", "* Norman Evans - Norman"]}, {"page": "Under New Management", "response": ["Under New Management, also known as Honeymoon Hotel,http://www.allmovie.com/movie/honeymoon-hotel-v95525 is a 1946 British comedy film directed by John E. Blakeley and starring Nat Jackley, Norman Evans and Dan Young.http://ftvdb.bfi.org.uk/sift/title/55916 The screenplay concerns a chimney sweep inherits a hotel and calls on a number of ex-army friends to staff it. The film was one of a number of films at the time dealing with the contemporary issue of demobilisation following the end of the Second World War.Mundy p.115", "Chimney sweep Joe (Norman Evans) inherits a dilapidated hotel which, with the help of former army chums as staff, he starts to turn around. A pair of devious property developers however, attempt to buy the hotel from him, knowing that the land is due to be redeveloped, and to increase in value when an airport is built nearby.", "* Norman Evans - Joe Evans"]}, {"page": "James Casey (variety artist)", "response": ["It was during the late 'Forties that James Casey first joined the act, in three-handed sketches: with his father in the centre bouncing gags off him on one side and his cousin, Jack Casey (who originally used the stage name Bretton Woods, but was later better known as Eli Woods), on the other. James junior quickly discovered a greater talent for writing the sketches. So when his father moved into radio, James Casey ended up writing everything, including editions showcasing other comedians: for the radio series Northern Variety Parade, he wrote scripts not only for his father but also for popular comedians such as Norman Evans, for whom Casey wrote Over the Garden Wall style sketches. Jimmy James's radio broadcasts, written by his son, were in radio series such as The Mayor's Parlour and Home James; and, since each series pulled in huge audiences, Casey was offered a staff job as a BBC producer."]}, {"page": "Pavilion Theatre, Torquay", "response": ["| 1956 || Norman Evans ||"]}, {"page": "Ronnie Taylor (scriptwriter)", "response": ["After the war he auditioned at BBC Manchester for Bowker Andrews and was initially mistaken as the tuner for the studio Bechstein piano. He was offered a 13-week job writing continuity for Gracie Fields. Fields introduced Taylor to her protégé variety performer Norman Evans and Taylor was contracted to write the radio series Over the Garden Wall, for which Evans is best remembered. He wrote radio series for 'Old Mother Riley' (Arthur Lucan and Kitty McShane) and worked with comedians Jimmy James, Robb Wilton, Dave Morris and Albert Modley. In 1950, he began his long association with Al Read and the BBC Radio series Variety Fanfare recorded at Hulme Hippodrome which showcased new comedy talent including Ken Platt, Morecambe and Wise and Ken Dodd.  In 1951, Taylor was appointed as BBC Producer with North Region Variety."]}, {"page": "Over the Garden Wall (1950 film)", "response": ["Over the Garden Wall is a 1950 British comedy film directed by John E. Blakeley and starring Norman Evans, Jimmy James and Dan Young.http://www.bfi.org.uk/films-tv-people/4ce2b6958c087 The film was made at Mancunian Films at their Manchester film studios. Although made on a low-budget, the film often topped double bills at cinemas in the North of England because of the popularity of the performers.Chibnall & McFarlane p.41", "Working class couple Fanny and Joe (Norman Evans and Jimmy James), are determined to give their daughter Mary (Sonya O'Shea) and her husband a posh home coming party. Trouble arises when the son of Joe's boss (Frederick Bradshaw) turns up and shamelessly flirts with their daughter.", "* Norman Evans as Fanny Lawton  "]}, {"page": "June 1901", "response": ["* Born: Norman Evans, English pantomime artist and radio performer, in Rochdale, Lancashire, England (d. 1962)"]}, {"page": "Prince's Theatre, Bristol", "response": ["*1938-39 –  Jack and the Beanstalk – Norman Evans, Jack Barty and Jean Colin "]}]}}