{"wiki_id": "http://www.wikidata.org/entity/Q706756", "itemLabel": "Eddie Jobson", "itemDescription": "British keyboardist and violinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Jobson", "wikipedia_page": {"main": "Edwin Jobson (born 28 April 1955) is an English keyboardist and violinist noted for his use of synthesizers.  He has been a member of several progressive rock bands, including Curved Air, Roxy Music, U.K. and Jethro Tull. He was also part of Frank Zappa's band in 1976–77. Aside from his keyboard work Jobson has also gained acclaim for his violin playing. He won the \"Lifetime Achievement\" award at the 2017 Progressive Music Awards. In March 2019 Eddie Jobson was inducted into the Rock and Roll Hall of Fame as a member of Roxy Music.", "link_mentions": [{"page": "April 28", "response": ["*  1955   – Eddie Jobson, English keyboard player and violinist "]}, {"page": "Frank Zappa", "response": ["Although Zappa eventually gained the rights to all his material created under the MGM and Warner contracts, the various lawsuits meant that for a period Zappa's only income came from touring, which he therefore did extensively in 1975–1977 with relatively small, mainly rock-oriented, bands. Drummer Terry Bozzio became a regular band member, Napoleon Murphy Brock stayed on for a while, and original Mothers of Invention bassist Roy Estrada joined. Among other musicians were bassist Patrick O'Hearn, singer-guitarist Ray White and keyboardist/violinist Eddie Jobson. In December 1976, Zappa appeared as a featured musical guest on the NBC television show Saturday Night Live. Zappa's song \"I'm the Slime\" was performed with a voice-over by SNL booth announcer Don Pardo, who also introduced \"Peaches En Regalia\" on the same airing. In 1978, Zappa served both as host and musical act on the show, and as an actor in various sketches. The performances included an impromptu musical collaboration with cast member John Belushi during the instrumental piece \"The Purple Lagoon\". Belushi appeared as his Samurai Futaba character playing the tenor sax with Zappa conducting.Zappa, Frank, 1978, Zappa in New York, Liner Notes."]}, {"page": "King Crimson", "response": ["Two months before the release of Red, King Crimson's future looked bright (with talks regarding founder member Ian McDonald rejoining the group). However, Fripp wished not to tour as he felt increasingly disenchanted by the group and the music industry. He also felt the world was going to drastically change by 1981 and that he had to prepare for it. Despite a band meeting while touring the US in which Fripp expressed a desire to end the band, the group did not formally disband until 25 September 1974 and later Fripp announced that King Crimson had \"ceased to exist\" and was \"completely over for ever and ever\". It was later revealed that Fripp had attempted to interest his managers in a King Crimson with McDonald (but without him), but this idea was rejected. Following the band's disbanding, the live album USA was released in May 1975, formed of recordings from their 1974 North American tour. It received some positive reviews, including \"a must\" for fans of the band and \"insanity you're better off having\". Issues with the tapes rendered some of Cross' playing inaudible, so Eddie Jobson was hired to perform violin and keyboard overdubs in a studio; further edits were also made to allow the music to fit on a single LP. Between 1975 and 1981, King Crimson were completely inactive."]}, {"page": "Roxy Music", "response": ["Roxy Music were  an English rock band formed in 1970 by Bryan Ferry—who became the band's lead singer and main songwriter—and bass guitarist Graham Simpson. The other longtime members were Phil Manzanera (guitar), Andy Mackay (saxophone and oboe), and Paul Thompson (drums and percussion). Other members included Brian Eno (synthesizer and 'treatments'), Eddie Jobson (synthesizer and violin), and John Gustafson (bass). Although the band took a break from group activities in 1976 and again in 1983, they reunited for a concert tour in 2001, and toured together intermittently over the next few years. Ferry frequently enlisted band members as session musicians for his solo releases.", "Eno, meanwhile, was replaced by 18-year-old multi-instrumentalist Eddie Jobson, formerly of progressive rockers Curved Air, who played keyboards and electric violin. Although some fans lamented the loss of the experimental attitude and camp aesthetic that Eno had brought to the band, the classically trained Jobson was an accomplished musician.  Rolling Stone referred to the albums Stranded (1973) and Country Life (1974) as marking \"the zenith of contemporary British art rock\". The songs on these albums also cemented Ferry's persona as the epitome of the suave, jaded Euro-sophisticate. Although this persona undoubtedly began as a deliberately ironic device, during the mid-1970s it seemed to merge with Ferry's real life, as the working-class miner's son from the north of England became an international rock star and an icon of male style.", "*Eddie Jobson – keyboards, synthesizers, electric violin (1973–1976, 2019)", "  bar:Jobson text:\"Eddie Jobson\""]}, {"page": "1955", "response": ["** Eddie Jobson, English musician"]}, {"page": "New England Digital", "response": ["* Eddie Jobson"]}, {"page": "Synclavier", "response": ["* Eddie Jobson: the 1985 album Theme of Secrets was completely made with a Synclavier."]}, {"page": "Yes (band)", "response": ["Several musicians were approached to replace Wakeman, including Vangelis Papathanassiou, Eddie Jobson of Roxy Music and former Atlantis/Cat Stevens keyboardist Jean Roussel. Yes ultimately chose Swiss keyboardist Patrick Moraz of Refugee, who arrived in August 1974 during the recording sessions for Relayer, which took place at Squire's home in Virginia Water, Surrey. Released in November that year, Relayer showcased a jazz fusion-influenced direction the band were pursuing. The album features the 22-minute track titled \"The Gates of Delirium\", which highlights a battle initially inspired by War and Peace by Leo Tolstoy. Its closing section, \"Soon\", was subsequently released as a single. The album reached number 4 in the UK and number 5 in the US.Welch 2008, p. 154. Yes embarked on their 1974–1975 tour to support Relayer. The compilation album Yesterdays, released in 1975, contained tracks from Yes' first two albums, the B-side track from their \"Sweet Dreams\" single from 1970 titled \"Dear Father\", and the original ten-minute version of their cover of \"America\".", "Yes released their comeback album 90125 (named after its catalogue serial number on Atco Records) in November 1983. It became their biggest-selling album, certified by the RIAA at triple-platinum (3 million copies) in sales in the US, and introduced the band to younger fans. \"Owner of a Lonely Heart\" topped the Hot Mainstream Rock Tracks chart for four weeks, and went on to reach the number one spot on the Billboard Hot 100 singles chart, the only single from Yes to do so, for two weeks in January 1984. Kaye's short-term replacement on keyboards, Eddie Jobson, appeared briefly in the original video but was edited out as much as possible once Kaye had been persuaded to return to the band.", "* Eddie Jobson – keyboards (1983)"]}, {"page": "Pat Mastelotto", "response": ["Since moving to Austin, Texas, he has worked with Austinites Storyville, Abra Moore, ...And You Will Know Us by the Trail of Dead and theremin player Pamelia Kurstin. Personal projects include, Mastica, BPMM and M.P.TU with guitarist Phil Brown (Little Feat), singer Malford Milligan and bassist Mark Andes (Spirit, Firefall, Heart). He works as an executive producer, also producing, engineering, and mixing. He has appeared in major network television themes, and has worked in the studio on such projects. In 2007 Mastelotto went on tour with The Flower Kings in Europe supporting their album The Sum Of No Evil. In 2008 a new King Crimson lineup formed, including a drumming team of Pat and Gavin Harrison, which played eleven shows in August. Then the enormous Creation of Peace festival in Kazan, Russia, with Adrian Belew, Tony Levin and Eddie Jobson. This was followed by another new project, HoBoLeMa, with Levin, Bozzio and Allan Holdsworth.hit-channel.com Pat also works with Reuter and Levin in the trio Stick Men who released their fourth album Deep in 2013. He is known for his production skills and technical ability while in the studio. Pat is often working the Digital Audio Workstation in the studio. He has produced a number of King Crimson releases, as well as Crimson-related side projects."]}, {"page": "Asia (band)", "response": ["Asia began in early 1981 after the apparent ending of Yes and Emerson, Lake & Palmer, two of the founding bands of British progressive rock. After the break-up of King Crimson in 1974, various plans for a supergroup involving bassist John Wetton had not been successful, including the abortive British Bulldog project with Bill Bruford and Rick Wakeman in 1976. In 1977 Bruford and Wetton were reunited in U.K., augmented by guitarist Allan Holdsworth and keyboardist/violinist Eddie Jobson. Their self-titled debut was released in 1978. But by January 1980, U.K. had folded after one lineup change and three recordings. A new project was then suggested involving Wetton, Wakeman, drummer Carl Palmer and (then little known) guitarist/singer Trevor Rabin, but Wakeman left this project shortly before they were due to sign to Geffen and before they had played together.Wakeman, R. \"Say Yes\""]}, {"page": "Keith Emerson", "response": ["A tribute concert featuring Brian Auger, Jordan Rudess, Eddie Jobson, Aaron Emerson, Steve Lukather, Steve Porcaro, Marc Bonilla and Rachel Flowers took place at the El Rey Theatre. Proceeds from sales of the DVD go to the Dystonia Medical Research Foundation."]}, {"page": "Jethro Tull (band)", "response": ["Tull's first album of the 1980s was intended to be Ian Anderson's first solo album. Anderson retained Barre on electric guitar and Pegg on bass, while adding Mark Craney on drums, and special guest keyboardist/violinist Eddie Jobson (ex–Roxy Music, Frank Zappa, Curved Air and U.K., the last of which had opened for several shows on Tull's Stormwatch tour). Highlighted by the prominent use of synthesisers, it contrasted sharply with the established \"Tull sound\".  After pressure from Chrysalis Records, Anderson agreed to release it as a Jethro Tull album. Entitled A (taken from the labels on the master tapes for his scrapped solo album, marked simply \"A\" for \"Anderson\"), it was released in mid-1980.", "* Eddie Jobson – keyboards, violin (1980–1981, 1985)"]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["| Brian Eno, Bryan Ferry, Eddie Jobson, Andy Mackay, Phil Manzanera, Graham Simpson, and Paul Thompson"]}, {"page": "Bryan Ferry", "response": ["After their second album, Brian Eno left Roxy Music, leaving Ferry its undisputed leader. Ferry started a parallel solo career in 1973, initially performing cover versions of old standards on albums such as These Foolish Things (1973) and Another Time, Another Place (1974), both of which reached the UK top 5. After the concert tour in support of their fifth studio album Siren, Roxy Music temporarily disbanded in 1976, though band members Paul Thompson, Phil Manzanera and Eddie Jobson took part in recording Ferry's subsequent solo material. That year Ferry covered the Beatles' \"She's Leaving Home\" for the transitory musical documentary All This and World War II. He released three solo albums during this period, Let's Stick Together (1976), In Your Mind (1977) and The Bride Stripped Bare (1978), all of which charted in the UK top 20."]}, {"page": "Greg Howe", "response": ["Eight years later, Howe teamed up again with Timberlake, as well as rapper T.I., for a performance at the 2009 Grammy Awards.\"About Greg : Biography . greghowe.com. Retrieved 2012-10-14. In the same year, Howe played as part of keyboardist/violinist Eddie Jobson's Ultimate Zero Project, in a line-up which included bassists Tony Levin and John Wetton, and drummers Marco Minnemann and Simon Phillips.\"Greg live in Poland\" . greghowe.com. 2009-09-29. Retrieved 2012-10-14. In 2011, Howe toured Vladivostok, Italy and Israel with drummer Dennis Chambers and bassist Stu Hamm.\"Greg Howe, Dennis Chambers, and Stu Hamm live in Italy and Israel\" . greghowe.com. 2012-01-21. Retrieved 2012-10-14. In November of that year, Michael Jackson's second posthumous album, Immortal, featured Howe's playing on \"Dancing Machine\" and \"Beat It\".\"Greg Howe featured on Michael Jackson new album\" . greghowe.com. 2011-11-20. Retrieved 2012-10-14."]}, {"page": "A (Jethro Tull album)", "response": ["Musically, the album was a departure from prior Tull works, adopting more of an electronic rock sound with heavy use of synthesizers, although still retaining the band's trademark folk influence and Anderson's flute playing. Lyrically, the album saw a similar departure from the fantasy and folklore themes of previous Tull work, instead emphasizing contemporary matters such as the Cold War. The album was the first Tull album released following a large lineup change which saw drummer Barrie \"Barriemore\" Barlow and keyboardists John Evan and Dee Palmer departing the band in 1980 while bassist John Glascock had died from heart complications the previous year. The album instead features Glascock's touring replacement Dave Pegg on bass in his first recorded appearance with the band, Mark Craney on drums and Eddie Jobson on keyboards (with Jobson credited as a \"special guest\"). ", "* Eddie Jobson – keyboards, synthesizer, electric violin on Uniform "]}, {"page": "Rainbow (rock band)", "response": ["In August 1976, following a gig at Newcastle City Hall, Blackmore decided to fire Carey, believing his playing style to be too complicated for the band. Unable to find a suitable replacement on such short notice, Carey was quickly reinstated, but as the world tour progressed on to Japan, he found himself regularly being the recipient of Blackmore's pranks and humour. Blackmore subsequently decided that Bain was substandard and fired him in January 1977. Carey quit the band shortly after, after getting tired of Blackmore's pranks. Blackmore, however, had difficulty finding replacements he liked. On keyboards, after auditioning several high-profile artists, including Vanilla Fudge's Mark Stein, Procol Harum's Matthew Fisher and ex-Curved Air and Roxy Music man Eddie Jobson, Blackmore finally selected Canadian David Stone, from the little-known band Symphonic Slam. For a bass player, Blackmore originally chose Mark Clarke, formerly of Jon Hiseman's Colosseum, Uriah Heep and Tempest, but once in the studio for the next album, Long Live Rock 'n' Roll, Blackmore disliked Clarke's fingerstyle method of playing so much that he fired him on the spot and played bass himself on all but four songs: the album's title track, \"Gates of Babylon\", \"Kill the King\", and \"Sensitive to Light\". Former Widowmaker bassist Bob Daisley was hired to record these tracks, completing the band's next line-up."]}, {"page": "List of film score composers", "response": ["* Eddie Jobson"]}, {"page": "Terry Bozzio", "response": ["After Bill Bruford and Allan Holdsworth departed from the band U.K. in late 1978, Bozzio joined Eddie Jobson and John Wetton to continue U.K. as a trio. The trio recorded Danger Money (1979) and a live album Night After Night (1979) and toured the U.S. and Canada twice (supporting the popular progressive rock band Jethro Tull), and in Europe and Japan."]}, {"page": "Allan Holdsworth", "response": ["In 1977, Holdsworth was recruited by drummer and Yes founder Bill Bruford to play on his debut album, Feels Good to Me (released January 1978). Shortly afterwards, Bruford formed the progressive rock supergroup U.K. with keyboardist/violinist Eddie Jobson and bassist John Wetton; Holdsworth was brought in on the recommendation of Bruford. Despite getting along well with them personally and enjoying the recording of their 1978 self-titled album, Holdsworth claims that he \"detested\" his time spent with the group,Newton, Steve (13 November 2013). \"30 years ago today: Van Halen-praised guitar phenom Allan Holdsworth plays Vancouver's Soft Rock Cafe\". The Georgia Straight. Retrieved 30 March 2015. and that it was \"miserable\" due to numerous musical differences whilst on tour, namely Jobson and Wetton's desire for Holdsworth to play his solos to an organised structure for each show, something to which he vehemently objected."]}, {"page": "Brother Bear", "response": ["Following the success of the Tarzan soundtrack, Phil Collins was offered the opportunity to compose songs for Brother Bear, as well as let him \"co-write the score\". However, Collins explained, \"Slowly, the bad news started to trickle down that I wouldn't be singing it all. It was a bit of a disappointment, because I [usually] write songs that I sing myself.\" While Collins composed six songs for the film, he shared vocal performance duties with Tina Turner, who sang the opening song; the Blind Boys Of Alabama and the Bulgarian Women's Choir, who performed the song, \"Transformation\". Collins's lyrics for the song were first translated into the Inuit Eskimo language. The performance was then arranged by score co-composers Collins and Mark Mancina, and vocal arranger Eddie Jobson."]}, {"page": "Tony Kaye (musician)", "response": ["In 1982, Kaye was invited to form a new band with Squire, Alan White, and singer and guitarist Trevor Rabin. Much of their new material derived from a set of demos produced by Rabin that displayed a more pop-oriented and commercial style of rock music, and Squire thought of Kaye as their ideal keyboardist due to his simpler, more textural approach. Kaye accepted Squire's offer and entered rehearsals in London under the name Cinema with producer Trevor Horn for 90125. However, conflicts between Kaye and Horn led to the former's exit after several months, leaving Rabin to handle the remaining keyboard parts. By mid-1983, Jon Anderson had also joined the band as lead singer and it was decided, after some hesitation, to rename this new this lineup 'Yes'. Kaye, in the meantime, had rejoined Badfinger and gone off on a North American tour and was replaced by Eddie Jobson. When this tour ended in October, Kaye accepted an offer by management to return to Yes where he and Jobson would share keyboard duties.  This, however, did not sit well with Jobson, who left shortly thereafter. 90125 had included greater use of MIDI technology, which reignited Kaye's interest in contemporary keyboards unlike the time of his first departure from Yes."]}]}}