{"wiki_id": "http://www.wikidata.org/entity/Q706657", "itemLabel": "Elijah Williams", "itemDescription": "British chess player", "wikipedia_url": "https://en.wikipedia.org/wiki/Elijah_Williams_(chess_player)", "wikipedia_page": {"main": "Elijah Williams (7 October 1809 – 8 September 1854) was an eminent British chess player of the mid-19th century. He was the first president of the Clifton Chess Club, and publisher of a book of games from the Divan Club. His most notable result was at the 1851 London tournament, in which he defeated the celebrated British player Howard Staunton in the play-off for third place.\nHe was accused by Staunton of taking an average of 2½ hours per move during some matches, a strategy thought to cause opponents to lose their focus on the match. According to Staunton, following a particularly dilatory performance by Williams in the London 1851 tournament, a 20-minute per turn time limit was adopted for standard play the next year. However other sources contradict this viewpoint and indeed it was not uncommon for Staunton to attribute his losses to the intolerable dilatory play of his opponents.  Staunton is quoted as remarking while playing against Williams,  \"... Elijah, you're not just supposed to sit there – you're supposed to sit there and think!\"\nIn The Complete Chess Addict by Mike Fox and Richard James he was dubbed \"the Bristol Sloth\" due to his alleged extreme slowness. This sobriquet inspired a musical tune \"The Bristol Sloth\" by guitarist Leo Kottke (who also applied the term 'sitzkrieg' in describing Williams' playing style).\nWilliams died in London, a victim of the 1854 Broad Street cholera outbreak.", "link_mentions": [{"page": "List of chess players", "response": ["* Elijah Williams (England, 1810–1854)"]}, {"page": "Rules of chess", "response": ["Until the middle of the 19th century, chess games were played without any time limit. In an 1834 match between Alexander McDonnell and Louis-Charles Mahé de La Bourdonnais, McDonnell took an inordinate amount of time to move, sometimes up to 1½ hours. In 1836 Pierre Charles Fournier de Saint-Amant suggested a time limit, but no action was taken. At the 1851 London tournament, Staunton blamed his loss in his match against Elijah Williams  on Williams' slow play; one game was adjourned for the day after only 29 moves.Howard Staunton, The Chess Tournament – A Collection of Games Played at this Celebrated Assemblage, London 1852, p. 161 The next year a match between Daniel Harrwitz and Johann Löwenthal used a limit of 20 minutes per move. The first use of a modern-style time limit was in an 1861 match between Adolph Anderssen and Ignác Kolisch ."]}, {"page": "Howard Staunton", "response": ["The tournament was a success, but disappointing for Staunton personally; in the second round he was knocked out by Anderssen, who won the tournament convincingly; and in the play-off for third place Staunton was narrowly beaten by Elijah Williams.", "Carl Jaenisch had arrived too late for the tournament; Staunton convincingly won a match with him soon after (seven wins, one draw, and two losses). Later in 1851 Staunton played a match against Elijah Williams, who had won their play-off for third place in the London International tournament. Staunton won more games (six wins, three draws, and four losses) but lost the match because he had given Williams a three-game start.", "From the early 1840s–1851 Staunton could successfully give odds to almost any UK-based player, including eventually John Cochrane; the exceptions were Henry Thomas Buckle, to whom Staunton gave pawn and move in 1843 and lost their match (6 losses, no draws, 1 win), and Elijah Williams in 1851, against whom Staunton won more games, but lost the match because he had given Williams a 3 game start. According to match records collected by Jeremy P. Spinrad, the only players who were successful against Staunton without receiving odds from 1840–1852 were:", "* Elijah Williams, who beat Staunton in the play-off for third place in the same tournament.", "| 1851 || align=left| London International Tournament || 4 || --- || align=left | A knockout tournament in which the contestants played mini-matches in each round, increasing from best-of-three in the first round to best-of-eight in the final. Staunton was eliminated in the semifinal (−4=0+1) by Adolf Anderssen, who won the tournament. Staunton was then beaten by Elijah Williams in the play-off for third place.", "| 1851 || Elijah Williams || Lost || none || London || 7½/13 || +6 =3 –4 || align=center | "]}, {"page": "Adolf Anderssen", "response": ["| 1851 || align=left| London International Tournament || 1 || 15/21 || align=left | Ahead of Marmaduke Wyvill, Elijah Williams, Howard Staunton, József Szén, Hugh Alexander Kennedy, Bernhard Horwitz, Henry Edward Bird, Lionel Kieseritzky, Carl Mayet, Johann Löwenthal, Edward Löwe, Alfred Brodie, James Mucklow, Samuel Newham, and E.S. Kennedy.A knock-out tournament in which the contestants played mini-matches in each round, increasing from best-of-3 in the 1st round to best-of 8 in the final. Anderssen himself beat Kieseritzky, Szen, Staunton and Wyvill – his closest mini-match was +4−2=1 in the final against Wyvill."]}, {"page": "List of world records in chess", "response": ["Before the introduction of chess clocks, it was common for players to take more than an hour to decide on a move. Among the players who had a reputation for playing particularly slowly (taking over 2 hours for a move) are Alexander McDonnell and Elijah Williams, however, it was not normal practice to time a player's moves so claims about the slowness of a player in an untimed game must be considered unverified."]}, {"page": "Stalemate", "response": ["In the game Elijah Williams–Daniel Harrwitz (see first diagram), Black was up a knight and a pawn in an endgame. This would normally be a decisive  advantage, but Black could find no way to make progress because of various stalemate resources available to White. The game continued:"]}, {"page": "Marmaduke Wyvill (chess player)", "response": ["Regarded by Howard Staunton as 'one of the finest players in England', he was primarily an enthusiastic amateur of chess, yet in his sole tournament appearance at London 1851 he took second prize behind Adolf Anderssen. Finishing ahead of Staunton, Elijah Williams, Bernhard Horwitz, and Jozsef Szen, he succumbed only to Anderssen in the final, by a score of 2½-4½. Long after he had retired from competitive play, he retained a great interest in the game and was known to have contributed to the organisation and funding of the 1883 London tournament."]}, {"page": "Bird's Opening", "response": ["The opening was mentioned by Luis Ramírez de Lucena in his book Repetición de Amores y Arte de Ajedrez con Cien Juegos de Partido, published c. 1497. In the mid-nineteenth century the opening was sometimes played by La Bourdonnais and Elijah Williams, among others. The British master Henry Edward Bird first played it in 1855 and continued to do so for the next 40 years.\"Having forgotten familiar openings, I commenced adopting KBP for first move, and finding it led to highly interesting games out of the usual groove, I became partial to it.\" — Henry Bird (1873, entering match play after a six year absence from chess); Hooper and Whyld (1987), p. 32. In 1885, the Hereford Times named it after him.Hooper and Whyld (1992), p. 40. In the first half of the 20th century Aron Nimzowitsch and Savielly Tartakower sometimes played 1.f4.de Firmian (2008), p. 732. In more recent decades, grandmasters who have used the Bird's with any regularity include Bent Larsen, Andrew Soltis, Lars Karlsson, Mikhail Gurevich, and Henrik Danielsen."]}, {"page": "Bristol sloth", "response": ["#REDIRECT Elijah Williams (chess player)"]}, {"page": "Bristol Sloth", "response": ["#REDIRECT Elijah Williams (chess player) "]}, {"page": "London 1851 chess tournament", "response": ["The tournament was planned as a knock-out contest involving sixteen of Europe's best players. Invitations had been extended to foreign masters Vincent Grimm, József Szén, and Johann Löwenthal from Hungary; Adolf Anderssen, Bernhard Horwitz, Carl Mayet, and von der Lasa from Germany; Pierre Charles Fournier de Saint-Amant and Lionel Kieseritzky from France, and Carl Jaenisch, Alexander Petrov and Ilya Shumov from Russia. The British players were to be Howard Staunton, Henry Thomas Buckle, Marmaduke Wyvill, Elijah Williams, Captain Hugh Alexander Kennedy, William Newham, and Henry Bird."]}, {"page": "Hugh Alexander Kennedy", "response": ["Hugh Alexander Kennedy was born in Madras, British India in 1809.\"India, Births and Baptisms, 1786-1947,\" index, FamilySearch (https://familysearch.org/pal:/MM9.1.1/FG48-1WL : accessed 22 February 2015), Hugh Alexander Kennedy, 02 Oct 1809; citing , reference v 11 p 225; FHL microfilm 521,839. He was a British army captain and leading London chess player.  He established the first chess club in Brighton in 1842..  Other references give 1840 as the year of formation, including . In 1844, he lost a match to Howard Staunton (3–8).Edo Ratings, Kennedy, H.A In 1845, he teamed up with Staunton in Portsmouth in two telegraph games (lost and drew) against a team of Henry Thomas Buckle, George Walker, William Davies Evans, Perigal, and Tuckett in London.http://www.chesscafe.com/text/spinrad15.pdfThe Kibitzer He lost a match to Elijah Williams (+2 –4  =0) in 1846 and lost a match to Edward Löwe (+6 –7 =1) in 1849, both in London.matches fino 1849"]}, {"page": "List of people with surname Williams", "response": ["*Elijah Williams (chess player) (1809–1854), British chess player", "*Elijah Williams (American football) (born 1975), American footballer"]}, {"page": "Staunton–Morphy controversy", "response": ["Howard Staunton (April 1810 – June 22, 1874) was an English chess master who won a match  in Paris in 1843 against the Frenchman Pierre Charles Fournier de Saint-Amant, and was regarded as the world's strongest player from 1843 to 1851 by many contemporary commentators, by later 19th-century commentators and by former world champion Garry Kasparov. According to match records collected by Jeremy P. Spinrad, the only players who were successful against Staunton without receiving odds from 1840 to 1851 were: Saint-Amant, who won the first and lost the second and longer of their matches in 1843; Adolf Anderssen, who eliminated Staunton from the 1851 London International tournament and won the event; and Elijah Williams, who beat Staunton in the play-off for third place in the same tournament.Williams beat Staunton by one game in the match.  This was before time controls were used and Staunton resigned a crucial game because Williams was taking too long to move. Ref: Anne Sunnucks, The Encyclopedia of Chess, 1970, p. 459 The statistical website Chessmetrics ranks Staunton as world number one from May 1843 to August 1849, in the top ten from July 1851 to May 1853, and in the top five from June 1853 to January 1856."]}, {"page": "School of chess", "response": ["included Bernhard Horwitz, Elijah Williams, Marmaduke Wyvill, and to some degree Adolf Anderssen and Daniel Harrwitz. In this style, there was no quick attack on the opposing king.  Instead, the attacks were prepared, as strategic advantages – such as control over the center and key points – were first obtained.  Pieces were developed behind pawns to support their advance.  Staunton pioneered the use of flank openings and the fianchettoing of the bishop.  After Staunton practically retired in 1853, these ideas were mostly neglected."]}, {"page": "Elijah Williams", "response": ["Elijah Williams may refer to:", "* Elijah Williams (chess player) (1809–1854), British chess player", "* Elijah Williams (American football) (born 1975), former American football player"]}]}}