{"wiki_id": "http://www.wikidata.org/entity/Q706867", "itemLabel": "Thomas Romney Robinson", "itemDescription": "British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Romney_Robinson", "wikipedia_page": {"main": "John Thomas Romney Robinson  FRS FRSE (23 April 1792 – 28 February 1882), usually referred to as Thomas Romney Robinson, was a 19th-century Irish astronomer and physicist. He was the longtime director of the Armagh Astronomical Observatory, one of the chief astronomical observatories in the UK of its time.\nHe is remembered as inventor of the 4-cup anemometer.\n\n", "link_mentions": [{"page": "April 23", "response": ["*1792 – Thomas Romney Robinson, Irish astronomer and physicist (d. 1882)"]}, {"page": "Anemometer", "response": ["(1635–1703), developed their own versions, with some being mistakenly credited as the inventor. In 1846, John Thomas Romney Robinson (1792–1882) improved upon the design by using four hemispherical cups and mechanical wheels. In 1926, Canadian meteorologist John Patterson (January 3, 1872 – February 22, 1956) developed a three-cup anemometer, which was improved by Brevoort and Joiner in 1935. In 1991, Derek Weston added the ability to measure wind direction. In 1994, Andreas Pflitsch developed the sonic anemometer.", "A simple type of anemometer was invented in 1845 by Rev Dr John Thomas Romney Robinson, of Armagh Observatory. It consisted of four hemispherical cups mounted on horizontal arms, which were mounted on a vertical shaft. The air flow past the cups in any horizontal direction turned the shaft at a rate that was roughly proportional to the wind speed. Therefore, counting the turns of the shaft over a set time interval produced a value proportional to the average wind speed for a wide range of speeds. It is also called a rotational anemometer."]}, {"page": "1792", "response": ["* April 23 – Thomas Romney Robinson, Irish astronomer, physicist (d. 1882)"]}, {"page": "Anglo-Irish people", "response": ["In the 19th century, some of the most prominent mathematical and physical scientists of the British Isles, including Sir William Rowan Hamilton, Sir George Stokes, John Tyndall, George Johnstone Stoney, Thomas Romney Robinson, Edward Sabine, Thomas Andrews, Lord Rosse, George Salmon, and George FitzGerald, were Anglo-Irish. In the 20th century, scientists John Joly and Ernest Walton were also Anglo-Irish, as was the polar explorer Sir Ernest Shackleton.  Medical experts included Sir William Wilde, Robert Graves, Thomas Wrigley Grimshaw, William Stokes, Robert Collis, Sir John Lumsden and William Babington. The geographer William Cooley was one of the first to describe the process of globalization."]}, {"page": "Sir George Stokes, 1st Baronet", "response": ["He married, on 4 July 1857 at St Patrick's Cathedral, Armagh, Mary Susanna Robinson, daughter of the astronomer Rev Thomas Romney Robinson. They had five children: Arthur Romney, who inherited the baronetcy; Susanna Elizabeth, who died in infancy; Isabella Lucy (Mrs Laurence Humphry) who contributed the personal memoir of her father in \"Memoir and Scientific Correspondence of the Late George Gabriel Stokes, Bart\"; Dr William George Gabriel, physician, a troubled man who committed suicide aged 30 whilst temporarily insane; and Dora Susanna, who died in infancy. His male line and hence his baronetcy is extinct but through the female line he is survived by one great great grandson, one great great granddaughter, and three great great great grandchildren."]}, {"page": "British Science Association", "response": ["* 1849: Rev. Thomas Romney Robinson, astronomer "]}, {"page": "Armagh", "response": ["* Thomas Romney Robinson (1792–1882), astronomer, lived in Armagh"]}, {"page": "Edward Hincks", "response": ["Edward Hincks was educated at home by his father and at Midleton College before entering Trinity College Dublin.Kevin J. Cathcart, ed., The Correspondence of Edward Hincks: 1818–1849 (2007), p. 3: \"He received his boyhood education from his father in Cork and at school in Midleton, Co. Cork, where Midleton College exists to this day. In 1807, being fifteen years old, he entered Trinity College, Dublin.\" He was elected a Scholar of the College in 1810, and in 1812 won the Gold Medal and Bishop Law's Prize for Mathematics. Standing against Thomas Romney Robinson, he won through and was elected a Fellow of the College in 1813 and four years later took his M.A. In 1819, following the death of Thomas Meredith, he was presented to the Rectory of Ardtrea in County Tyrone. Though Ardtrea was a valuable and highly prized Rectory, it was also isolated for a young bachelor and he resigned the position in 1826, taking up the Rectory in Killyleagh, County Down –  an office he was to hold for the remainder of his life."]}, {"page": "Noctilucent cloud", "response": ["No confirmed record of their observation exists before 1885, although they may have been observed a few decades earlier by Thomas Romney Robinson in Armagh.Robinson made a series of interesting observations between 1849 and 1852, and two of his entries in May 1850 may describe noctilucent clouds. On 1 May 1850, he notes ‘strange luminous clouds in NW, not auroral'. This does sound very much like NLCs even though early May falls outside the typical NLC 'window'; however it is still possible as NLCs can form at Armagh's latitude within this period. Doubts now surround Robinson's out-of-season records, following observations, from several points around high northern latitudes, of NLC-like phenomena following the Chelyabinsk superbolide entry in February 2013 (outside the NLC season) that were in fact stratospheric dust reflections visible after sunset."]}, {"page": "Armagh Observatory", "response": ["|Thomas Romney Robinson"]}, {"page": "Richard Lovell Edgeworth", "response": ["#: Lucy Jane (1805–1897), married the Irish astronomer Thomas Romney Robinson 1843."]}, {"page": "Romney Robinson", "response": ["#REDIRECT Thomas Romney Robinson"]}, {"page": "Thomas Robinson", "response": ["* Thomas Romney Robinson (1792–1882), Irish astronomer and physicist"]}, {"page": "1792 in Ireland", "response": ["*23 April – Thomas Romney Robinson, astronomer and physicist (died 1882)."]}, {"page": "List of fellows of the Royal Society P, Q, R", "response": ["|Thomas Romney Robinson||5 June 1856||23 April 1792 – 28 February 1882\t"]}, {"page": "William Hamilton Drummond", "response": ["Straitened means interrupted Drummond's course, and left him without a degree, but he acquired considerable classical culture, and as a very young student began to publish poetry, in which the influence of the revolutionary ideas of the period culminating in 1798 is apparent. Leaving Glasgow in 1798 he became tutor in a family at Ravensdale, co. Louth, pursuing his studies under the direction of the Armagh presbytery, with which he connected himself on the ground of its exacting a high standard of proficiency from candidates for the ministry. In 1799, returning to Belfast, he was transferred to the Presbytery of Antrim, and licensed on 9 April 1800. He at once received calls from First Holywood and Second Belfast, and accepting the latter was ordained on 26 August 1800, the presiding minister being William Bryson [q. v.] He became popular, especially as a preacher of charity sermons, and dealt little in topics of controversy. On his marriage he opened a boarding-school at Mount Collyer, and lectured on natural philosophy, having among his pupils Thomas Romney Robinson, the astronomer. He was one of the first members of the Belfast Literary Society (founded 23 Oct. 1801), and contributed to its transactions several of his poems. Bishop Percy of Dromore sought his acquaintance, and obtained for him the degree of D.D. from Marischal College, Aberdeen (29 January 1810). In 1815 he was an unsuccessful candidate for the chair of logic and belles-lettres in the Belfast Academical Institution, and on 15 October that year he was called to Strand Street, Dublin, as colleague to James Armstrong, D.D. Installed on 25 December, he entered on the chief charge of his long life. He was soon elected a member of the Royal Irish Academy, contributed frequently to its Transactions, held for many years the office of its librarian, and took a scholarly interest in Celtic literature. His poetical pieces, versified from ancient Irish sources, are graceful paraphrases rather than close translations. Most of his writings show traces of very wide reading. His house was crammed with the heterogeneous results of an insatiable habit of book-collecting."]}, {"page": "John Robinson", "response": ["*John Thomas Romney Robinson (1792–1882), Irish astronomer and physicist"]}, {"page": "List of recipients of the Pour le Mérite for Sciences and Arts", "response": ["| 1872 || Thomas Romney Robinson || Astronomer || Armagh, Irland"]}, {"page": "Edward Joshua Cooper", "response": ["The telescope initially mounted on a wooden stand, but the arrival of the great lens had caught the attention of Dr Thomas Romney Robinson, who had become director of the Armagh Observatory in 1823, and become a friend of Cooper's"]}, {"page": "John Thomas Romney Robinson", "response": ["#REDIRECT Thomas Romney Robinson"]}, {"page": "List of Scholars of Trinity College Dublin", "response": ["* Thomas Romney Robinson (Classics, 1808), astronomer and physicist. Awarded his scholarship aged fourteen."]}, {"page": "Elizabeth Beckley", "response": ["She was the daughter of Robert Beckley, a mechanical engineer based at Kew Observatory, who developed the Robinson-Beckley anemometer with Thomas Romney Robinson."]}, {"page": "Robinson anemometer", "response": ["#REDIRECT Thomas Romney Robinson"]}, {"page": "List of plant genera named for people (Q–Z)", "response": ["|data-sort-value=\"Robinson\"|Thomas Romney Robinson (1792–1882), astronomer"]}]}}