{"wiki_id": "http://www.wikidata.org/entity/Q706076", "itemLabel": "Peter le Page Renouf", "itemDescription": "Guernsey egyptologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_le_Page_Renouf", "wikipedia_page": {"main": "Sir Peter le Page Renouf (23 August 1822 – 14 October 1897) was a British professor, Egyptologist, and museum director, best known for his translation of The Book of the Dead.", "link_mentions": [{"page": "Tarshish", "response": ["Sir Peter le Page Renouf (1822–1897)Proceedings of the Society of Biblical Archaeology, xvi. 104 et seq., Le Page Renouf thought that \"Tarshish\" meant a coast, and, as the word occurs frequently in connection with Tyre, the Phoenician coast is to be understood."]}, {"page": "Egyptian Museum", "response": ["In the garden adjacent to the building of the museum, a memorial to famous egyptologists of the world is located. It features a monument to Auguste Mariette, surrounded by 24 busts of the following egyptologists: François Chabas, Johannes Dümichen, Conradus Leemans, Charles Wycliffe Goodwin, Emmanuel de Rougé, Samuel Birch, Edward Hincks, Luigi Vassalli, Émile Brugsch, Karl Richard Lepsius, Théodule Devéria, Vladimir Golenishchev, Ippolito Rosellini, Labib Habachi, Sami Gabra, Selim Hassan, Ahmed Kamal, Zakaria Goneim, Jean-François Champollion, Amedeo Peyron, Willem Pleyte, Gaston Maspero, Peter le Page Renouf and Kazimierz Michałowski."]}, {"page": "List of Egyptologists", "response": ["*Peter le Page Renouf (English, 1822–1897)"]}, {"page": "E. A. Wallis Budge", "response": ["Budge entered the British Museum in 1883 in the recently renamed Department of Egyptian and Assyrian Antiquities. Initially appointed to the Assyrian section, he soon transferred to the Egyptian section. He studied the Egyptian language with Samuel Birch until the latter's death in 1885. Budge continued to study ancient Egyptian with the new Keeper, Peter le Page Renouf, until the latter's retirement in 1891."]}, {"page": "Hibbert Lectures", "response": ["*1879 Peter le Page Renouf The Religion of the Egyptians"]}, {"page": "Elizabeth College, Guernsey", "response": ["Alumni in the arts include actor Barry Jones; authors William Adolf Baillie Grohman and P.G. Wodehouse;Wodehouse, quoted in Jasen, p. 8 and Jean Hugo, artist and great-grandson of Victor Hugo; as well as journalist and novelist Robert Sherard; and engineer and author Hugh Pembroke Vowles. Alumni in the sciences includes physician and academic author Dr Norman Hay Forbes; anthropologist Arthur Maurice Hocart; John Richard Magrath, Vice-Chancellor of the University of Oxford; egyptologist Sir Peter le Page Renouf;The Letters of Peter le Page Renouf (1822-1897), edited by Kevin J. Cathcart, 4 vols. (University College Dublin Press, 2002-2004), reviewed by Patricia Usick (British Museum), retrieved 25 May 2009   geologist Nick McCave;‘McCAVE, Prof. (Ian) Nicholas’, Who's Who 2017, A & C Black, an imprint of Bloomsbury Publishing plc, 2017 and nuclear physicist Ian Chapman."]}, {"page": "Instruction of Amenemope", "response": ["The most complete text of the Instruction of Amenemope is British Museum Papyrus 10474, which was acquired in Thebes by E. A. Wallis Budge in early 1888.Budge 1920, 1:337. The scroll is approximately  long by  wide; the obverse side contains the hieratic text of the Instruction, while the reverse side is filled with a miscellany of lesser texts, including a \"Calendar of Lucky and Unlucky Days\", hymns to the sun and moon, and part of an onomasticon by another author of the same name.Budge 1923, 18-19; Posener 1945, 112. In November 1888, Peter le Page Renouf, Keeper of the Department of Oriental Antiquities at the British Museum (and Budge's supervisor), made mention of a \"remarkable passage\" from the papyrus and quoted a few words from it in an otherwise unrelated article about the story of Joseph in the Book of Genesis;Renouf 1888, 5-10. but Renouf was forced into retirement in 1891,Usick 2006, 15. and publication of the papyrus was delayed for more than three decades while Budge concentrated on other projects such as the Book of the Dead.", "*Usick, Patricia.  \"Review of The Letters of Peter le Page Renouf (1822-1897)\", British Museum Studies in Ancient Egypt and Sudan 5 (2006), 13-16."]}, {"page": "List of people from Guernsey", "response": ["* Peter le Page Renouf (1822–1897), Egyptologist"]}, {"page": "Renouf", "response": ["*Peter le Page Renouf (1822–1897), British Egyptologist"]}, {"page": "Peter Le Page Renouf", "response": ["#REDIRECT Peter le Page Renouf "]}, {"page": "Mary Brodrick", "response": ["Back in England, Brodrick entered College Hall, London in 1888 where she studied at University College London under Stuart Poole (co-founder with Amelia Edwards of the Egypt Exploration Society) and Peter le Page Renouf. She did not enter for a University of London degree due to her prior studies.\"Dr. Mary Brodrick.\" by \"A correspondent\", The Times, 22 July 1933, p. 14. She was a member of the Committee of Philology and Literary Archaeology of the World's Columbian Exposition in Chicago 1893 and did work in America for the Egyptian Exploration Fund. She was awarded the degree of Doctor of Philosophy in 1893 by the College of the Sisters of Bethany, University of Kansas, the same institution that had also awarded a PhD to Amelia Edwards.\"University Jottings\", The Academy, No. 1110, 12 August 1893, p. 131. She lectured at the British Museum and studied Egyptology under Flinders Petrie in 1893–94 and 1894–95. She held the Pfeiffer Fellowship of College Hall from 1894–96. In 1896, she was elected a life member of the Bibliothèque nationale, Paris, and a life member of College Hall, London."]}, {"page": "1896 Birthday Honours", "response": ["*Peter le Page Renouf"]}]}}