{"wiki_id": "http://www.wikidata.org/entity/Q706365", "itemLabel": "Samuel C. Bradford", "itemDescription": "British mathematician, librarian and documentalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_C._Bradford", "wikipedia_page": {"main": "Samuel Clement Bradford (10 January 1878 in London – 13 November 1948) was a British mathematician, librarian and documentalist at the Science Museum in London. He developed \"Bradford's law\" (or the \"law of scattering\") regarding differences in demand for scientific journals. This work influences bibliometrics and citation analysis of scientific publications. Bradford founded the British Society for International Bibliography  (BSIB) (est. 1927) and he was elected president of International Federation for Information and Documentation (FID) in 1945. Bradford was a strong proponent of the UDC and of establishing abstracts of the scientific literature.", "link_mentions": [{"page": "Bradford's law", "response": ["Bradford's law is a pattern first described by Samuel C. Bradford in 1934 that estimates the exponentially diminishing returns of searching for references in  science journals. One formulation is that if journals in a field are sorted by number of articles into three groups, each with about one-third of all articles, then the number of journals in each group will be proportional to 1:n:n². There are a number of related  formulations of the principle."]}, {"page": "List of scientific laws named after people", "response": ["| Bradford's law || Computer science || Samuel C. Bradford"]}, {"page": "Scientific phenomena named after people", "response": ["* Bradford's law (of scattering) – Samuel C. Bradford"]}, {"page": "List of eponymous laws", "response": ["* Bradford's law is a pattern described by Samuel C. Bradford in 1934 that estimates the exponentially diminishing returns of extending a library search."]}, {"page": "Information scientist", "response": ["* Samuel C. Bradford"]}, {"page": "Bradford Glacier", "response": ["Bradford Glacier () is a glacier flowing north from Mount Dewey into Comrie Glacier, on the west coast of Graham Land. It was mapped by the Falkland Islands Dependencies Survey from photos taken by Hunting Aerosurveys Ltd in 1956–57, and named by the UK Antarctic Place-Names Committee for Samuel C. Bradford (1878–1948), English documentalist who was a pioneer advocate of scientific information services."]}, {"page": "Bradford (name)", "response": ["* Samuel C. Bradford (1878–1948) British librarian and documentalist"]}]}}