{"wiki_id": "http://www.wikidata.org/entity/Q706648", "itemLabel": "Daniel Jones", "itemDescription": "British phonetician (1881–1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Jones_(phonetician)", "wikipedia_page": {"main": "Daniel Jones (12 September 1881 – 4 December 1967) was a London-born British phonetician who studied under Paul Passy, professor of phonetics at the École des Hautes Études at the Sorbonne (University of Paris). He was head of the Department of Phonetics at University College, London.", "link_mentions": [{"page": "Cardinal vowels", "response": ["thumb|200px|X-rays of Daniel Jones' .", "A cardinal vowel is a vowel sound produced when the tongue is in an extreme position, either front or back, high or low. The current system was systematised by Daniel Jones in the early 20th century, though the idea goes back to earlier phoneticians, notably Ellis and Bell.", "Ladefoged, in a series of pioneering experiments published in the 1950s and 60s, studied how trained phoneticians coped with the vowels of a dialect of Scottish Gaelic. He asked eighteen phoneticians to listen to a recording of ten words spoken by a native speaker of Gaelic and to place the vowels on a cardinal vowel quadrilateral. He then studied the degree of agreement or disagreement among the phoneticians. Ladefoged himself drew attention to the fact that the phoneticians who were trained in the British tradition established by Daniel Jones were closer to each other in their judgments than those who had not had this training. However, the most striking result is the great divergence of judgments among all the listeners regarding vowels that were distant from Cardinal values. See especially Figure 47 on p. 135", "*Audio demonstrations of cardinal vowels by Daniel Jones at age 75"]}, {"page": "International Phonetic Alphabet", "response": ["In 1886, a group of French and British language teachers, led by the French linguist Paul Passy, formed what would be known from 1897 onwards as the International Phonetic Association (in French, ).International Phonetic Association, Handbook, pp. 194–196 Their original alphabet was based on a spelling reform for English known as the Romic alphabet, but to make it usable for other languages the values of the symbols were allowed to vary from language to language.\"Originally, the aim was to make available a set of phonetic symbols which would be given different articulatory values, if necessary, in different languages.\"  (International Phonetic Association, Handbook, pp. 195–196) For example, the sound  (the sh in shoe) was originally represented with the letter  in English, but with the digraph  in French. In 1888, the alphabet was revised so as to be uniform across languages, thus providing the base for all future revisions. The idea of making the IPA was first suggested by Otto Jespersen in a letter to Paul Passy. It was developed by Alexander John Ellis, Henry Sweet, Daniel Jones, and Passy.IPA in the Encyclopædia Britannica"]}, {"page": "Phoneme", "response": ["The term phonème (from , \"sound made, utterance, thing spoken, speech, language\"Liddell, H.G. & Scott, R. (1940). A Greek-English Lexicon. revised and augmented throughout by Sir Henry Stuart Jones. with the assistance of. Roderick McKenzie. Oxford: Clarendon Press.) was reportedly first used by A. Dufriche-Desgenettes in 1873, but it referred only to a speech sound. The term phoneme as an abstraction was developed by the Polish linguist Jan Niecisław Baudouin de Courtenay and his student Mikołaj Kruszewski during 1875–1895. The term used by these two was fonema, the basic unit of what they called psychophonetics. Daniel Jones became the first linguist in the western world to use the term phoneme in its current sense, employing the word in his article \"The phonetic structure of the Sechuana Language\".Jones, D. (1917), The phonetic structure of the Sechuana language, Transactions of the Philological Society 1917-20, pp. 99–106 The concept of the phoneme was then elaborated in the works of Nikolai Trubetzkoy and others of the Prague School (during the years 1926–1935), and in those of structuralists like Ferdinand de Saussure, Edward Sapir, and Leonard Bloomfield. Some structuralists (though not Sapir) rejected the idea of a cognitive or psycholinguistic function for the phoneme."]}]}}