{"wiki_id": "http://www.wikidata.org/entity/Q706218", "itemLabel": "Allan McGregor", "itemDescription": "Scottish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Allan_McGregor", "wikipedia_page": {"main": "Allan James McGregor (born 31 January 1982) is a Scottish professional footballer who plays as a goalkeeper for Scottish Premiership club Rangers. McGregor has also previously played for St Johnstone, Dunfermline Athletic, Turkish team Beşiktaş, English club Hull City, Welsh side Cardiff City and the Scotland national team.\nA product of the Hutchison Vale youth football club in Edinburgh, McGregor made his first team debut for Rangers in February 2002 in a Scottish Cup match against Forfar Athletic. He was later loaned out to St Johnstone and Dunfermline Athletic, before becoming a regular Rangers first team player at the start of the 2006–07 season. McGregor made over 200 appearances for Rangers, winning 11 major honours in the process, including a hat-trick of league titles in 2009, 2010 and 2011, three Scottish Cups and five Scottish League Cups.\nFollowing the liquidation of Rangers parent company  in 2012, McGregor exercised his legal rights to become a free agent. He then signed a two-year contract with Beşiktaş. After one season in Turkey, McGregor moved to Hull City. In May 2018, McGregor signed a two-year contract with Rangers.\nMcGregor made his full international debut for Scotland in May 2007. He was suspended for two weeks by his club, and the Scottish Football Association said that McGregor would never play for Scotland again, after multiple breaches of squad discipline following Scotland's 3–0 defeat to the Netherlands on 28 March 2009. The following year, this ban from international football was overturned by Scotland manager Craig Levein. He made 42 appearances for Scotland in total, and announced his retirement from international play in March 2019.", "link_mentions": [{"page": "January 31", "response": ["*  1982   – Allan McGregor, Scottish international footballer"]}, {"page": "SuperCupNI", "response": ["* Allan McGregor (Scotland) 2001 (U19)"]}, {"page": "V sign", "response": ["On 3 April 2009, Scottish association football players Barry Ferguson and Allan McGregor were permanently banned from the Scottish national squad for showing the V sign while sitting on the bench during the game against Iceland. Both players were in their hotel bar drinking alcohol after the Scottish defeat to The Netherlands until around 11 am the next morning, meaning that both of the players breached the SFA discipline code before the incident as well, but the attitude shown by the V sign was considered to be so rude that the SFA decided never to include these players in the national line-up again.Barry Ferguson and Allan McGregor banned for life by Scotland, The Guardian, Friday 3 April 2009 Ferguson also lost the captaincy of Rangers as a result of the controversy. McGregor's ban was lifted by then SFA manager Craig Levein and he returned to Scotland national squad in 2010."]}, {"page": "Hull City A.F.C.", "response": ["On 31 July 2014, Hull made their debut in European competition, in the UEFA Europa League third qualifying round, with a 0–0 draw against Slovakian side FK AS Trenčín before winning the second leg 2–1 a week later. An error from keeper Allan McGregor gave them a 1–0 loss away to Belgian outfit Lokeren in the first leg of their play-off tie on 21 August 2014 with the second leg at home ending in a 2–1 victory, but away goals marked the end of Hull's first foray into European football."]}, {"page": "Scotland national football team", "response": ["After the narrow failure to qualify for Euro 2008, McLeish left to join Premier League club Birmingham City. Southampton manager George Burley was hired as the new manager, but he came in for criticism from the media after the team lost their first qualifier against Macedonia. After Scotland lost their fourth match 3–0 to the Netherlands, captain Barry Ferguson and goalkeeper Allan McGregor were excluded from the starting lineup for the following match against Iceland due to a \"breach of discipline\". Despite winning 2–1 against Iceland, Scotland suffered a 4–0 defeat by Norway in the following qualifier, which left Scotland effectively needing to win their last two games to have a realistic chance of making the qualifying play-offs. Scotland defeated Macedonia 2–0 in the first of those two games, but were eliminated by a 1–0 loss to the Netherlands in the second game. Burley was allowed to continue in his post after a review by the SFA board, but a subsequent 3–0 friendly defeat by Wales led to his dismissal."]}, {"page": "Stefan Klos", "response": ["Klos looked set to challenge new signing Lionel Letizi after Paul Le Guen's arrival at the start of 2006–07, but he suffered a biking injury which gave long-term third choice Allan McGregor the chance to play. On 22 February 2007, he made his first appearance of the season for the first team against Hapoel Tel Aviv FC in the round of 32 of the UEFA Cup, after McGregor was sent off in a 4–0 home win."]}, {"page": "Barry Ferguson", "response": ["In April 2009, after an extended hotel drinking session with Rangers teammate Allan McGregor after Scotland's defeat to the Netherlands, followed by both players making inappropriate gestures while on the bench during the next match against Iceland, Ferguson was stripped of the captain's armband for both club and country. He recovered from this setback to help Rangers win the 2009 Scottish Cup Final against Falkirk (his last match for the club, having not started since the Scotland incident). Rangers also won the SPL title but missed out on another treble with a defeat in the 2009 Scottish League Cup Final."]}, {"page": "Gareth Barry", "response": ["On 2 September 2013, transfer deadline day, Barry was loaned to Everton in a season-long deal. He made his debut on 15 September in a 1–0 home league win against Chelsea during which he made a block on Samuel Eto'o which prevented a certain goal, later being named man of the match. Later in the month Barry became the 10th player in Premier League history to make 500 career appearances in a 3–2 win over Newcastle United. He scored his first goal for the club in a 2–1 victory over Hull City on 19 October; the goal was originally awarded to Kevin Mirallas; however, the goals panel ruled that en route to the goal, Barry was deemed to have got the last touch on the ball before it beat Hull keeper Allan McGregor. He scored a long range effort in a 2–0 victory against Norwich City on 11 January 2014. He became a mainstay in Everton's midfield during the season and forged a partnership with James McCarthy. Barry completed the most passes of any Everton player during his spell as he helped the club amass a club record of 72 Premier League points to finish fifth. Barry was booked 10 times during the season to have the worst disciplinary record at the club."]}, {"page": "Roy Carroll", "response": ["Carroll signed for Rangers on a one-year contract on 7 July 2007, initially as cover for Allan McGregor but also to challenge for a starting place. He made his only appearance for Rangers against East Fife in a League Cup match on 26 September 2007."]}, {"page": "David Marshall (Scottish footballer)", "response": ["Marshall made his full international debut for Scotland in 2004. He has since won over 40 caps, despite having had to compete with Craig Gordon and Allan McGregor for the goalkeeping position in the national team for much of his career. Marshall played a key role in Scotland's qualification for UEFA Euro 2020, as he made decisive saves in penalty shootouts against Israel and Serbia.", "After his standout performance for Celtic against Barcelona in the 2003–04 UEFA Cup, Marshall was selected by Scotland national football team. He made his full international debut on 18 August 2004 in a friendly against Hungary. Some observers expected Marshall to establish himself as the first choice goalkeeper for Scotland, but Craig Gordon and then Allan McGregor were picked more regularly instead."]}, {"page": "Steve Harper", "response": ["On 11 July 2013, it was revealed that newly promoted Premier League side Hull City are to offer Harper a one-year contract, as back up for their new goalkeeper Allan McGregor. Hull had previously approached Newcastle to take Harper on loan in January 2012 under then-manager Nick Barmby. Harper underwent his medical on 15 July."]}, {"page": "Tom Huddlestone", "response": ["On 14 August 2013, Huddlestone moved to Hull City for an undisclosed fee believed to be about £5.25 million. He made his debut on the first day of the 2013–14 season when he came off the bench in a 2–0 loss away at Chelsea. On 28 December, he scored his first goal for Hull in a 6–0 home win against Fulham, his first goal since April 2011. On 28 January 2014, Huddlestone acted as emergency goalkeeper after Hull City's goalkeeper Allan McGregor was sent off for squaring up with Crystal Palace's player Stuart O'Keefe. With Hull already making three substitutions, Hull's manager Steve Bruce ordered Huddlestone to take over the goalkeeping role."]}, {"page": "Eldin Jakupović", "response": ["On 9 July 2014, Jakupović signed a new two-year contract with Hull City, and began their Premier League campaign as third-choice goalkeeper behind Allan McGregor and Steven Harper. He made his first appearance of the season on 18 October away to Arsenal as a substitute when Harper injured his arm before half-time, and did not concede until Danny Welbeck equalised for 2–2 in added time. A week later he started for the first time in the division, keeping a clean sheet in a goalless draw against Liverpool."]}, {"page": "Neil Alexander", "response": ["After six months at Portman Road, he returned to Scotland with Rangers. Alexander was primarily understudy to Allan McGregor, but won the Scottish Cup twice, the Scottish League Cup three times and played in the 2008 UEFA Cup Final. He became the first choice goalkeeper for Rangers after McGregor left the club following Rangers entering administration and subsequent liquidation in 2012. Alexander left Rangers in 2013 after a dispute over wages, having won the Scottish Third Division title at the first attempt, to join Premier League side Crystal Palace. He made one appearance for Palace during the 2013–14 season, in the Football League Cup, before being released.", "On 30 January 2008, Rangers agreed a deal with Alexander and he signed a three-and-a-half-year contract later that day. The transfer was believed to be a free transfer with potential add-ons related to success, although it was officially undisclosed. Alexander made his debut for Rangers on 3 February 2008, coming on as a substitute after Allan McGregor had been sent off in a Scottish Cup tie at Hibernian. On 16 April, Alexander made his Old Firm debut as a 77th-minute substitute for the injured McGregor. Toward the end of the season, he played a vital role in Rangers' UEFA Cup and Scottish Cup semi-final wins, keeping clean sheets in both legs of their UEFA Cup victory over Italian side Fiorentina, where he made important saves when both games were decided by penalty shoot-outs. With McGregor injured, Alexander remained in place for the 2008 UEFA Cup Final against Zenit Saint Petersburg but was unable to prevent a 2–0 defeat. Despite the defeat, Alexander did collect some silverware in his first year at Ibrox, playing in the 2008 Scottish Cup Final as Rangers defeated Queen of the South 3–2 at Hampden Park.", "Rangers entered administration and were subsequently liquidated in 2012. Charles Green purchased the business and assets of Rangers, including player contracts, from the administrator. Alexander was one of three senior players who agreed to have his contract switched to Green's company, and was one of 13 players who turned up for the club's first training session following the sale. Allan McGregor refused to transfer his contract, which meant that Alexander became first choice 'keeper at Rangers as they embarked on a campaign in the fourth tier of the Scottish football league system. Alexander later commented that he did not see himself as a \"Third Division player\" but had decided to remain with the club for the \"chance to be number one at such a massive club.\" He remained ever present through the 2012–13 league campaign for Rangers as the club dominated the Third Division, winning the league title by 24 points from second place Peterhead."]}, {"page": "Lionel Letizi", "response": ["On 13 August 2006, his blunder led directly to a 1–1 draw with Dunfermline. Letizi soon redeemed himself in the next game, which saw Rangers achieve a 2–0 win against the Hearts. Unfortunately for the team, this match resulted in an injury for Letizi. After two months on the sidelines, Letizi controversially made an automatic return to the side despite impressive performances from his replacement Allan McGregor."]}, {"page": "History of Rangers F.C.", "response": ["Smith's deputy and Rangers record goalscorer Ally McCoist was appointed manager of the club for season 2011–12. Hampered by a bizarre transfer policy under Whyte, Rangers found themselves knocked out of first the UEFA Champions League and then the UEFA Europa League by the end of August, depriving the club of income that may have been anticipated. With the new ownership there initially appeared to be some financial stability of the club. A number of first-team regulars were secured on long-term contract extensions including Steven Davis, Allan McGregor, Steven Whittaker and Gregg Wylde. When McCoist entered the transfer market, his first signing being Almería midfielder Juan Manuel Ortiz, he soon encountered difficulties. A number of highly publicised failed transfers, including deals for Wesley Verhoek and Roland Juhász, lead to many doubting Whyte's financial prowess."]}, {"page": "Georgios Samaras", "response": ["He then produced a match-winning performance against Rangers at Ibrox on 2 January 2011. He was selected as a lone striker and scored both Celtic goals in a 2–0 victory. His first goal came from latching onto a Joe Ledley pass before rounding Rangers goalkeeper Allan McGregor and slotting home from a wide angle. His second came after he won a penalty which he converted to secure the victory. His efforts in this game won him Goal.com's World Player of the Week Award. In the following game, a Scottish Cup tie against Berwick Rangers, Samaras again started but failed to last the 90 minutes after sustaining a hamstring injury. Samaras had an influential performance in a 3–0 home victory against Rangers in the SPL on 20 February, helping to set up the second goal for Gary Hooper and causing problems for the opposition throughout the game."]}]}}