{"wiki_id": "http://www.wikidata.org/entity/Q706335", "itemLabel": "Lynn Chadwick", "itemDescription": "English artist and sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynn_Chadwick", "wikipedia_page": {"main": "Lynn Russell Chadwick,  (24 November 1914 – 25 April 2003) was an English sculptor and artist. Much of his work is semi-abstract sculpture in bronze or steel. His work is in the collections of MoMA in New York, the Tate in London and the Centre Georges Pompidou in Paris.", "link_mentions": [{"page": "November 24", "response": ["*1914 – Lynn Chadwick, English sculptor (d. 2003)"]}, {"page": "Festival of Britain", "response": ["The South Bank Exhibition showed the work of contemporary artists such as William Scott, including murals by Victor Pasmore, John Tunnard, Feliks Topolski, Barbara Jones, and John Piper and sculptures by Barbara Hepworth, Henry Moore, Lynn Chadwick, Jacob Epstein and Reg Butler."]}, {"page": "Churchill College, Cambridge", "response": ["Hepworth's Four-Square (Walk Through) stands at the West Door, the west exit of the main college complex. In 1968, it replaced an earlier Hepworth sculpture, Squares with Two Circles (BH 347) which had been sold to a private collector. Two sculptures by Nigel Hall stand in front of the main gate of the college: The Now (1999) and Southern Shade I (2010). Mistry's Diagram of an Object (Second state) used to be found at the front of college, but is now located next to the chapel at the far end of the college. Sir Anthony Caro's Forum used to stand near the front gate of the college but it was removed in 2004 and replaced in 2007 by Lynn Chadwick's Beast Alerted 1. "]}, {"page": "Merchant Taylors' School, Northwood", "response": ["* Lynn Chadwick – sculptor, his work 'The Beast' adorns the school grounds"]}, {"page": "Ekeberg", "response": ["A sculpture park, Ekebergparken Sculpture Park opened in 2013 on the initiative of the Norwegian businessman and multimillionaire Christian Ringnes. The park contains numerous works of art from Norwegian and international artists, among others, Salvador Dalí, Lynn Chadwick, Richard Hudson and Per Ung. The sculpture park is located in an area that has been open space and public park since the 1800s."]}, {"page": "Timeline of art", "response": ["* 2003 in art – Death of Al Hirschfeld, Kirk Varnedoe, Wally Hedrick, Emerson Woelffer, Dorothy Miller, Lynn Chadwick"]}, {"page": "Stroud", "response": ["*Lynn Chadwick, sculptor"]}, {"page": "Documenta 1", "response": ["| Felice Casorati ||Bruno Cassinari ||Lynn Chadwick || Antonio Corpora ||"]}, {"page": "Yorkshire Sculpture Park", "response": ["Since the 1990s, Yorkshire Sculpture Park has made use of indoor exhibition spaces, initially a Bothy Gallery (in the curved Bothy Wall) and a temporary tent-like structure called the Pavilion Gallery. After an extensive refurbishment and expansion, YSP has added an underground gallery space in the Bothy garden, and exhibition spaces at Longside (the hillside facing the original park). Its programme consists of contemporary and modern sculpture (from Rodin and Bourdelle through to living artists). British sculpture is well represented in the past exhibition programme and semi-permanent installations. Many British sculptors prominent in the 1950s and 1960s have been the subject of solo exhibitions at YSP, including Lynn Chadwick, Austin Wright, Phillip King, Eduardo Paolozzi, Hans Josephsohn, and Kenneth Armitage. Exhibitions tend to be monographic – rather than group or thematic."]}, {"page": "Art of the United Kingdom", "response": ["According to William Grimes of The New York Times \"Lucien Freud and his contemporaries transformed figure painting in the 20th century. In paintings like Girl With a White Dog (1951-52), Freud put the pictorial language of traditional European painting in the service of an anti-romantic, confrontational style of portraiture that stripped bare the sitter’s social facade. Ordinary people — many of them his friends — stared wide-eyed from the canvas, vulnerable to the artist’s ruthless inspection.\"\"Lucian Freud, Figurative Painter Who Redefined Portraiture, Is Dead at 88\". The New York Times. 21 July 2011. In 1952 at the 26th Venice Biennale a group of young British sculptors including Kenneth Armitage, Reg Butler, Lynn Chadwick, William Turnbull and Eduardo Paolozzi, exhibited works that demonstrated anti-monumental, expressionism.\"The Bronze Age \". Tate Magazine, Issue 6, 2008. Retrieved on 9 December 2010. Scottish painter Alan Davie created a large body of abstract paintings during the 1950s that synthesize and reflect his interest in mythology and zen.Alan Davie, Tate Retrieved 15 December 2010 Abstract art became prominent during the 1950s with Ben Nicholson, Terry Frost, Peter Lanyon and Patrick Heron, who were part of the St Ives school in Cornwall.Walker, 211-217 In 1958, along with Kenneth Armitage and William Hayter, William Scott was chosen by the British Council for the British Pavilion at the XXIX Venice Biennale."]}, {"page": "List of British artists", "response": ["* Lynn Chadwick (1914–2003)"]}, {"page": "2003 in art", "response": ["*25 April – Lynn Chadwick, 88, English sculptor  "]}, {"page": "Bisley, Gloucestershire", "response": ["The area is noted for the wealth of its Cotswold stone houses of architectural and historic interest.Stroud Council Conservation Area No. 6 Bisley  They include Lypiatt Park, formerly the home of Judge H. B. D. Woodcock and then of the late Modernist sculptor Lynn Chadwick; Nether Lypiatt Manor, formerly the home of Violet Gordon-Woodhouse and Prince and Princess Michael of Kent; Daneway (near Sapperton, but within the parish of Bisley); Over Court; Througham Court (repaired in 1929 for the novelist Sir Michael Sadleir by Norman Jewson); and Jaynes Court, formerly the private residence of Simon Isaacs, 4th Marquess of Reading (born 1942)."]}, {"page": "1952 in art", "response": ["* Eight younger British artists (Robert Adams, Kenneth Armitage, Reg Butler, Lynn Chadwick, Geoffrey Clarke, Bernard Meadows, Eduardo Paolozzi and William Turnbull) are represented in the \"New Aspects of British Sculpture\" exhibition at the Venice Biennale which Herbert Read describes as the \"Geometry of Fear\".In the catalogue (London: British Council), cited in:  See also:  Britain also displays paintings by Graham Sutherland and Edward Wadsworth."]}, {"page": "1951 in art", "response": ["** The Arts Council of Great Britain has also commissioned work from Robert Adams, Reg Butler, Lynn Chadwick, Frank Dobson, Karin Jonzen, F. E. McWilliam, Bernard Meadows, Uli Nimptsch and Eduardo Paolozzi. Some is sited in the concurrent open-air exhibition of sculpture in Battersea Park and there is an associated exhibition Sixty Paintings for '51 at the RBA Galleries and a show of popular and traditional art, Black Eyes & Lemonade, organised by Barbara Jones at the Whitechapel Gallery."]}, {"page": "Kenneth Martin (English painter)", "response": ["Though there was a tendency towards abstraction in British post-war art, it often had a representational base, as in the sculptures of Lynn Chadwick or, at first, Martin's own painting \"Chalk Farm\" of 1949.National Gallery of Scotland But Martin swiftly followed this with the purer abstraction of lines and geometrical shapes. Identifying this transition in his Broadsheet essay, Martin explained that \"what is generally termed 'abstract' is not to be confused with the abstraction from nature and its reduction and distortion to a pictorial form...Abstract painting is the result of a creative process exactly the opposite of abstraction.\"British Sculpture in the 20th Century, p.155 Because such art was constructed according to scientific or mathematical models, the Martins turned to making reliefs and moving sculptures which they called \"constructionist\", although acknowledging their link with earlier European Constructivism.“Constructionism”, Tate art terms "]}, {"page": "2003 in the United Kingdom", "response": ["** Lynn Chadwick, sculptor (born 1914)"]}, {"page": "Henry Moore", "response": ["Yet Moore had a direct influence on several generations of sculptors of both British and international reputation. Among the artists who have acknowledged Moore's importance to their work are Sir Anthony Caro,Caro biography . anthonycaro.org. Retrieved on 4 September 2008. Phillip King\"Phillip King \". sculpture.org.uk. Retrieved on 6 September 2008. and Isaac Witkin,\"Isaac Witkin\". The Times, 10 May 2006. Retrieved on 29 August 2008. all three having been assistants to Moore. Other artists whose work was influenced by him include Helaine Blumenfeld, Drago Marin Cherina, Lynn Chadwick, Eduardo Paolozzi, Bernard Meadows, Reg Butler, William Turnbull, Robert Adams, Kenneth Armitage, and Geoffrey Clarke.\"The Bronze Age\". Tate Magazine, Issue 6, 2008. Retrieved 23 August 2008."]}, {"page": "Beverly Pepper", "response": ["Pepper introduced her sculptural vocabulary with integrations of wood carvings and metal castings. Art critic, Rosalind Krauss has described her work as violating modernist traditions: \"the traditional craft of carving was closed to her...she attacked these logs with electric drills and saws.\"  After several exhibitions in New York and Rome, she was one of 10 artists invited by Giovanni Carandente, with David Smith, Alexander Calder, Arnaldo Pomodoro, Lynn Chadwick, and Pietro Consagra, to fabricate works in Italsider factories in Italy for an outdoor exhibition, Sculture nella città, held in Spoleto during the summer of 1962. Working directly in the factory, as she would with subsequent major sculptures, Pepper created The Gift of Icarus, Leda, Spring Landscape, two other large works, and 17 smaller ones."]}, {"page": "Gerard Cafesjian", "response": ["Cafesjian completely renovated the Cascade site in downtown Yerevan, Armenia. As of the early 2000s, it was an unfinished and crumbling Soviet structure of epic proportions on a hillside. Following a major reconstruction, the Cascade became the site of the Cafesjian Center for the Arts that opened in 2009. The museum enjoys a world-class sculpture garden with works by Fernando Botero, Lynn Chadwick, Barry Flanagan, François-Xavier Lalanne and Jaume Plensa, among others. Admission is free, and it is now the most prominent meeting place in Armenia. Over one million people have visited the Center since its opening."]}, {"page": "1914 in the United Kingdom", "response": ["* 24 November – Lynn Chadwick, sculptor (died 2003)"]}, {"page": "Abbot Hall Art Gallery", "response": ["* Lynn Chadwick: Evolution in Sculpture"]}, {"page": "Oliver W. F. Lodge", "response": ["After the outbreak of the Second World War Lodge returned to England and then took his young family first to Canada, during which period Oliver and Diana got to know well Lynn Chadwick (later a prominent sculptor) and his first wife the Canadian poet Ann Secord.The Times obituary of Diana Lodge, 14 April 1998 But very soon they moved to Maryland and settled in Virginia in the United States.  Here Lodge taught English literature at various institutions including Ursinus College, Pennsylvania, Goucher College in Baltimore, and the College of William & Mary in Williamsburg.  In Virginia, they first lived at \"Bay Cottage\", Naxera, until they moved to \"The Little House\", Elmington, Gloucester, Virginia."]}, {"page": "Bernard Meadows", "response": ["He exhibited in the British Pavilion at the Venice Biennale a year later, alongside a new generation of British sculptors, including Anthony Caro, Lynn Chadwick and Eduardo Paolozzi.  Their angular artworks contrasted with the more rounded styles of their seniors, Henry Moore and Barbara Hepworth, and they were dubbed by art critic Herbert Read as the \"Geometry of Fear\"."]}, {"page": "Boca Raton Museum of Art", "response": ["* Lynn Chadwick"]}, {"page": "Jerwood Foundation's sculpture collection", "response": ["Alongside works by artists of international reputation such as Dame Elisabeth Frink R.A., Lynn Chadwick R.A., Kenneth Armitage R.A., Michael Ayrton and Antony Gormley R.A., Peter Randall-Page, the Jerwood Sculpture collection included works by emerging artists who had won the Jerwood Sculpture Prize."]}, {"page": "Jane Drew", "response": ["Alvar Aalto and Ove Arup, architects;Jones, Peter: \"Ove Arup: Master Builder of the Twentieth Century\", Yale University Press, 2006 artists Delia Tyrwhitt,Delia Tyrwhitt, sister-in-law of town planner Jacqueline Tyrwhitt (FILA, AMPTI, Sp. Dip.) first met Max and Jane in Chandigarh in 1953 Eduardo Paolozzi, Marcel Duchamp, Barbara Hepworth, Roland Penrose, Peggy Angus, Ben Nicholson and Lynn Chadwick;Major English sculptor Lynn Chadwick (1914–2003) did a huge mobile for Jane and Max at the 1951 Festival of Britain art and design promoters Daniel-Henry Kahnweiler and Peter Gregory; playwright and theatre producer Benn Levy; poet, literary critic, and philosopher of modern art Herbert Read; writers Richard Hughes and Kathleen Raine; politician-reformers Jennie Lee, Lord Goodman and Pandit Nehru; actress Constance Cummings; and composer Elizabeth Lutyens."]}, {"page": "Lypiatt Park", "response": ["In 1959, by then in some disrepair, it was purchased by the Modernist British sculptor, Lynn Chadwick (1914–2003), whose expressionistic, figurative works in welded iron and bronze earned him international acclaim. Chadwick restored the house and died there on April 25, 2003, since when his heirs have put forward proposals to open to the public an area of the park in order create a permanent display for his sculpture collection.", "*Photos of the house and garden - Lynn Chadwick website"]}, {"page": "Lypiatt", "response": ["thumb|Dog by Lynn Chadwick at Lypiatt Park in Stroud, Gloucestershire/UK", "*Lypiatt Park, of medieval origins, home of the late Modernist sculptor Lynn Chadwick and his family"]}, {"page": "Alan Thornhill", "response": ["In 1949 he was accepted for the pottery course at Camberwell School of Art under Dick Kendall and Nora Braden, followed by a year at Farnham under Henry Hammond and Paul Barron, before moving in 1951 to Eastcombe, Gloucestershire, where Hawkley Pottery was set up. In 1958, frustrated by the repetition involved in making and selling pots, he started to gravitate towards claywork and sculpture through friendship with established sculptors Lynn Chadwick and Jack Greaves. In 1959 he moved to London, having found a property in Putney which included a semi-derelict outbuilding that became his studio, which still exists. Latterly he was largely based near Stroud, Gloucestershire."]}, {"page": "Lynn Russell Chadwick", "response": ["#REDIRECT Lynn Chadwick"]}, {"page": "Kenneth Armitage", "response": ["* 1960: Kenneth Armitage - Lynn Chadwick, Kestner-Gesellschaft, Hannover, Germany"]}, {"page": "Gimpel Fils", "response": ["During the 1950s and 60s Gimpel Fils was highly influential in its association with the avant-garde.  It supported modern British artists, including those of the St Ives School, as well as rising American artists and French abstract painters of the School of Paris. Gimpel Fils represented many of the major artists of the time, including Barbara Hepworth and Ben Nicholson. Nicholson moved to Gimpel Fils from the Lefevre Gallery and stayed until the early 1960s.  In supporting the next generation of artists emerging in this period it gave first exhibitions to Lynn Chadwick, Anthony Caro, Peter Lanyon and Alan Davie, while also being associated with a number of other British artists, including Louis le Brocquy, Ivon Hitchens, Gillian Ayres, Bernard Meadows, Kenneth Armitage and Robert Adams.  From France Gimpel Fils represented the likes of Marie Laurencin, Pierre Soulages, Nicolas de Staël, Serge Poliakoff, Fahrelnissa Zeid, and Yves Klein, as well as working with American artists such as Marcel Duchamp, Alexander Calder, Willem de Kooning, Sam Francis and Larry Rivers, who had his first London exhibition at the gallery in 1962.Obituary: Peter Gimpel, The Times, 2 July 2005. Link to InfoTrac National Newspapers Database (requires login). Retrieved 2012-10-17. An obituary of Peter Gimpel in The Independent newspaper suggested that: \"Despite the rise of Marlborough Fine Art and stiff competition from the likes of the Redfern, Waddington and Hanover galleries, Gimpel Fils was for a time unrivaled in the range and quality of its artists.\""]}, {"page": "List of members of the Ordre des Arts et des Lettres", "response": ["|Lynn Chadwick||style=\"background:silver\"|Officier||1985"]}, {"page": "Cafesjian Museum of Art", "response": ["The collection also has substantial holdings in drawing, painting and sculpture by many influential artists including Fernando Botero, Arshile Gorky, Jennifer Bartlett, Lynn Chadwick, Barry Flanagan, Jaume Plensa, and François-Xavier Lalanne.", "|Lynn Chadwick  "]}, {"page": "Anne-Katrin Purkiss", "response": ["Her Sculptors project Sculptors 1986-2007 Orleans House Gallery  documented sculptors in their working environment and includes portraits of Elisabeth Frink, Kenneth Armitage, Andy Goldsworthy, Sir Anthony Caro and Lynn Chadwick."]}]}}