{"wiki_id": "http://www.wikidata.org/entity/Q707739", "itemLabel": "Chris Larkin", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Larkin", "wikipedia_page": {"main": "Chris Larkin (born Christopher Stephens, 19 June 1967) is an English actor.", "link_mentions": [{"page": "Maggie Smith", "response": ["Smith married actor Robert Stephens on 29 June 1967. They had two sons, actors Chris Larkin (born 1967) and Toby Stephens (born 1969), and were divorced on 6 April 1975. Smith married playwright Beverley Cross on 23 June 1975, at the Guildford Register Office, and they remained married until his death on 20 March 1998. When asked in 2013 if she was lonely, she replied, \"it seems a bit pointless, going on one's own, and not having someone to share it with\". Smith has five grandchildren."]}, {"page": "Yes Minister", "response": ["In January 2013, a new series of Yes, Prime Minister was launched on the Gold television channel. Jim Hacker is now portrayed as heading a coalition government, while dealing with an economic downturn, his coalition partner having a leadership crisis, and Scottish independence. Like the stage play, on which it was broadly based, it is set at Chequers. Filming took place in September 2012. Both David Haig and Henry Goodman reprised their stage roles as Jim Hacker and Sir Humphrey. Haig's Hacker was rather manic,Notably, \"A Tsar is Born\", episode broadcast 19 February 2013 while Goodman's Sir Humphrey was more aloof and supercilious than Hawthorne's had been. The other main characters were Bernard Woolley (Chris Larkin, reprising his role from The Gielgud Theatre run at London's West End) and Claire Sutton (Zoe Telford), the latter with a more prominent role than Hacker's special advisor in the original series. Critical reaction was largely negative. Jay and Lynn revealed that they had offered the show first to the BBC, but that the corporation had asked for a pilot episode which the writers thought was unnecessary in the light of the earlier series. The revived series ended up being produced by the BBC for Gold.", "The play began a tour of the United Kingdom in February 2011, with Simon Williams as Sir Humphrey, Richard McCabe as Jim Hacker, Chris Larkin as Bernard and Charlotte Lucas as Claire Sutton. It returned to the West End in July 2011 for a 10-week run at the Apollo Theatre in Shaftesbury Avenue, with Williams and McCabe reprising their roles. The play then went back on a tour of the United Kingdom before returning to the West End with a revised script. Further rewrites took place before the 2012 UK tour and subsequent Trafalgar Studios run, the crucial change having replaced references from underage to multiple partner sex."]}, {"page": "2003 in film", "response": ["| Master and Commander: The Far Side of the World || 20th Century Fox / Miramax Films / Universal Pictures || Peter Weir (director/screenplay); John Collee (screenplay); Russell Crowe, Paul Bettany, Billy Boyd, James D'Arcy, Edward Woodall, Bryan Dick, Chris Larkin, Robert Pugh, Max Benitz, Max Pirkis, Jack Randall, Lee Ingleby, Richard Pates, Richard McCabe, Ian Mercer, Tony Dolan, David Threlfall, Joseph Morgan, George Innes, William Mannering, Patrick Gallagher, Alex Palmer, John DeSantis, Ousmane Thiam, Mark Lewis Jones, Thierry Segall || Adventure, Drama, Period || || Live Action"]}, {"page": "1996 in film", "response": ["| Angels & Insects || The Samuel Goldwyn Company || Philip Haas (director/screenplay); Belinda Haas (screenplay); Mark Rylance, Patsy Kensit, Kristin Scott Thomas, Jeremy Kemp, Douglas Henshall, Annette Badland, Chris Larkin, Anna Massey, Saskia Wickham, Lindsay Thomas, Michelle Sylvester, Clare Lovell, Jenny Lovell, Oona Haas, Angus Hodder, John Veasey || Romance, Drama || Live action"]}, {"page": "Master and Commander: The Far Side of the World", "response": ["* Chris Larkin as Captain Howard, Royal Marines"]}, {"page": "Nigel Jones, Baron Jones of Cheltenham", "response": ["In Official Secrets, a 2019 British-American docudrama film, Jones is portrayed by Chris Larkin."]}, {"page": "List of show business families", "response": ["* Actor Sir Robert Stephens is the father of actors Chris Larkin and Toby Stephens through his third wife Dame Maggie Smith. He later married actress Patricia Quinn, whose nephew is rock musician Jonny Quinn. Smith later remarried playwright and screenwriter Beverley Cross."]}, {"page": "Robert Stephens", "response": ["* 1967: to Maggie Smith; they had two sons, the actors Chris Larkin and Toby Stephens, and divorced in 1975."]}, {"page": "Patricia Quinn (Northern Irish actress)", "response": ["In January 1995, Quinn married the actor Sir Robert Stephens, who died in November that year. Quinn thus became the stepmother of Toby Stephens and Chris Larkin, Stephens' two actor sons from his previous marriage to Maggie Smith. Quinn had previously appeared alongside Sir Robert in the BBC TV adaptation of The Box of Delights (1984) in the role of Sylvia Daisy Pouncer, and had played his on-screen wife in the serial Fortunes of War (1987). The elder Stephens had been knighted prior to his death, giving Quinn the title of Lady Stephens."]}, {"page": "Lynda Baron", "response": ["From October 2010 to February 2011, Baron starred with Maureen Lipman and Roy Hudd in a West End production of When We Are Married by J.B. Priestley. In March 2013, she appeared in a production of D.H. Lawrence's play The Daughter-in-Law at the Sheffield Crucible.  She appeared at the Minerva Theatre, Chichester from April to May 2014 in Stevie by Hugh Whitemore, alongside Zoe Wanamaker and Chris Larkin. Baron again appeared in the play from March to April 2015 at the Hampstead Theatre."]}, {"page": "Bernard Woolley", "response": ["Sir Bernard Woolley, GCB, MA (Oxon) is one of the three main fictional characters of the 1980s British sitcom Yes Minister and its sequel, Yes, Prime Minister. He was portrayed originally by Derek Fowlds, with Chris Larkin taking on the part for the 2013 revival."]}, {"page": "Angels & Insects", "response": ["* Chris Larkin as Robin"]}, {"page": "Roger Roger", "response": ["* Chris Larkin as Cambridge: A mini-cab driver who went to university. He does not appear in series 3."]}, {"page": "The Lady from Dubuque", "response": ["The London premiere took place on March 6, 2007 (previews) at the Theatre Royal, Haymarket, directed by Anthony Page and starring Maggie Smith, Catherine McCormack (Jo), Chris Larkin (Edgar), Robert Sella (Sam), Peter Francis James (Oscar), Vivienne Benesch (Lucinda), Jennifer Regan (Carol), and Glenn Fleshler (Fred). Nathan, John. \"Dame Maggie Smith Is a Lady in London Albee Revival, Opening March 20\" Playbill, March 20, 2007"]}, {"page": "Highlander: The Series (season 5)", "response": ["* Chris Larkin ... Steven Keane"]}, {"page": "Mysterious Island (2005 film)", "response": ["* Chris Larkin .... Atherton (as Christopher Stephens)"]}, {"page": "Evolution (TV series)", "response": ["|Chris Larkin || Charles Darwin"]}, {"page": "List of Highlander cast members", "response": ["|valign=\"top\"|Chris Larkin|| valign=\"top\"|Steven Keane|| valign=\"top\"|\"Forgive Us Our Trespasses\"|| valign=\"top\"|1997"]}, {"page": "Valkyrie (film)", "response": ["* Chris Larkin as Sergeant Helm"]}, {"page": "Beverley Cross", "response": ["He was the stepfather of Maggie Smith's children from her earlier marriage, actors Chris Larkin and Toby Stephens. He died in London in 1998 aged 66."]}, {"page": "List of American films of 2008", "response": ["| Valkyrie || Metro-Goldwyn-Mayer / United Artists || Bryan Singer (director); Christopher McQuarrie, Nathan Alexander (screenplay); Tom Cruise, Kenneth Branagh, Bill Nighy, Tom Wilkinson, Carice van Houten, Thomas Kretschmann, Terence Stamp, Eddie Izzard, Kevin McNally, Christian Berkel, Jamie Parker, David Bamber, Tom Hollander, David Schofield, Kenneth Cranham, Halina Reijn, Werner Daehn, Harvey Friedman, Matthias Freihof, Waldemar Kobus, Ian McNeice, Danny Webb, Chris Larkin, Christian Oliver, Bernard Hill, Julian Morris, Matthew Burton, Philipp von Schulthess, Helmut Stauss, Gerhard Haase-Hindenberg, Anton Algrang || Thriller"]}, {"page": "The Six Wives of Henry VIII (2001 TV series)", "response": ["*Chris Larkin as Henry VIII of England, episodes one and two"]}, {"page": "Cultural depictions of Henry VIII", "response": ["*The Six Wives of Henry VIII (2001) (Chris Larkin and Andy Rashleigh)"]}, {"page": "His Dark Materials (play)", "response": ["*Jopari/Iofur Raknison – Chris Larkin"]}, {"page": "Doctor Who (series 3)", "response": ["Other guest stars included Thelma Barlow, Ryan Carnes, Matthew Chambers, Chipo Chung, Christina Cole, Michelle Collins, Lenora Crichlow, Anthony Flanagan, Andrew Garfield, Lucy Gaskell, Mark Gatiss, Don Gilet, Jennifer Hennessy, Anna Hope, Gerard Horan, Jessica Hynes, Derek Jacobi, Dean Lennox Kelly, Matt King, Chris Larkin, Harry Lloyd, Eric Loren, Stephen Marcus, Roy Marsden, McFly, Alexandra Moen, Carey Mulligan, Michael Obiora, Ardal O'Hanlon, Travis Oliver, Sharon Osbourne, Sarah Parish, Angela Pleasence, Hugh Quarshie, Miranda Raison, Anne Reid, Finlay Robertson, Thomas Sangster, John Simm, Rebekah Staton and Ann Widdecombe."]}, {"page": "List of British actors", "response": ["* Chris Larkin (born 1967)"]}, {"page": "Aneurin Barnard", "response": ["Barnard then appeared in the lead role in Vertigo Films's Guinea Pigs, a micro-budget horror film about volunteers fighting for their lives after a drug trial goes wrong. The film also stars Alex Reid, Chris Larkin, Steve Evets, Nia Roberts, Oliver Coleman, Skye Lourie, Jack Doolan and Amit Shah. Later in 2012 he starred in the horror-thriller film Citadel."]}, {"page": "You Me and Captain Longbridge", "response": ["You Me and Captain Longbridge (2008) is a 15 minutes short film directed by Kenny Doughty and written & produced by Caroline Carver. The film stars Callum Williams as the 11-year-old Luke, Chris Larkin as Captain Longbridge and Joseph Fiennes as the voice of Luke as an adult. The short film played in 12 International Film Festivals and won 3 awards."]}, {"page": "Hitler: The Rise of Evil", "response": ["* Chris Larkin as Hermann Göring"]}, {"page": "Larkin (surname)", "response": ["* Chris Larkin, British actor"]}, {"page": "Black Sails (TV series)", "response": ["In real life, recurring actor Nick Boraine is Louise Barnes's husband; Anna-Louise Plowman and Chris Larkin are, respectively, Toby Stephens's wife and brother; and Guy Paul is Harriet Walter's husband."]}, {"page": "Outlander (TV series)", "response": ["* Chris Larkin as Richard Brown (season 5)"]}]}}