{"wiki_id": "http://www.wikidata.org/entity/Q707150", "itemLabel": "Tony Anholt", "itemDescription": "British television actor (1941-2002)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Anholt", "wikipedia_page": {"main": "Anthony Anholt (19 January 1941 – 26 July 2002) was a British television actor, known for his role as Charles Frere in the BBC drama series Howards' Way (1985–90). In 1974 he was cast as Mark Colebrook, a crooked architect in Contact Breaker the 12th episode of the first series of the police drama, The Sweeney. Anholt appeared in an episode of Juliet Bravo in 1984 as Martin Lee.\nHis other appearances include Gerry Anderson's Space: 1999 (1976–77) playing the role of Security Chief Tony Verdeschi in the second series, and The Protectors (1972–74) as Paul Buchet. His only credited film role was as an FBI agent in Fear Is the Key in 1972; he also made appearances in the 1984 miniseries The Last Days of Pompeii and as small time crook Abdul, in the Only Fools and Horses episode To Hull and Back. He died after a long illness caused by a brain tumour on 26th July, 2002.", "link_mentions": [{"page": "1987 in film", "response": ["| The Hidden || New Line Cinema || Jack Sholder (director); Jim Kouf (screenplay); Kyle MacLachlan, Michael Nouri, Clu Gulager, Chris Mulkey, Ed O'Ross, Clarence Felder, Claudia Christian, Larry Cedar, Richard Brooks, William Boyett, Tony Anholt, Steve Eastin, Katherine Cannon, James Luisi, Danny Trejo, Lin Shaye || Horror, Supernatural || Live action"]}, {"page": "Only Fools and Horses", "response": ["In some episodes, a guest character was essential to the plot. Del's ex-fiancée Pauline (Jill Baker) dominated Del's libido in \"The Second Time Around\", prompting Rodney and Grandad to leave. In \"Who Wants to Be a Millionaire\", Del's old business partner Jumbo Mills (Nick Stringer) wanted Del to return to Australia with him and restore their partnership, forcing Del to make a decision. An attempt by Lennox (Vas Blackwood) to rob a local supermarket set-up the \"hostage\" situation in \"The Longest Night\". Del and Rodney spent the whole of \"Tea for Three\" battling each other for the affections of Trigger's niece Lisa (Gerry Cowper), who briefly reappeared in \"The Frog's Legacy\". Abdul (Tony Anholt) in \"To Hull and Back\" and Arnie (Philip McGough) in \"Chain Gang\" were responsible for setting up dubious enterprises involving the Trotters in their respective episodes. Tony Angelino (Philip Pope), the singing dustman with a speech impediment, was the key to the humour and the storyline of \"Stage Fright\" and EastEnders actor Derek Martin guest starred in \"Fatal Extraction\"."]}, {"page": "Space: 1999", "response": ["| Tony Anholt", "Security Chief Tony Verdeschi also joined as a new character, played by Tony Anholt. Verdeschi, who assumed the base's second-in-command role, neither appeared, nor was ever mentioned, in Year One. However, Moonbase Alpha personnel treated Verdeschi as if he had been in their midst since \"Breakaway\". His character was designed to serve primarily as a secondary male action hero, and became a romantic interest for Maya."]}, {"page": "The Protectors", "response": ["The Protectors was first broadcast in 1972 and 1973, and ran to 52 episodes over two series, each 25 minutes long—making it one of the last series of this type to be produced in a half-hour format. It starred Robert Vaughn (of The Man from U.N.C.L.E. fame) as Harry Rule, Nyree Dawn Porter (co-star of The Forsyte Saga) as the Contessa Caroline di Contini, and Tony Anholt (later to star in Space: 1999 and Howards' Way) as Paul Buchet. Episodes often featured prominent guest actors.", "Anderson's relationship with series regular Tony Anholt was a more positive one, and a few years later he cast the actor as Tony Verdeschi in the second series of Space: 1999."]}, {"page": "The Sweeney", "response": ["*Tony Anholt"]}, {"page": "Triangle (1981 TV series)", "response": ["* Tony Anholt – Nick Stevens"]}, {"page": "The Wednesday Play", "response": ["| George BakerRosalie CrutchleyDavid LangtonDeborah WatlingJohn BaileyTony Anholt"]}, {"page": "Howards' Way", "response": ["Other major characters introduced during the first series are Kate Harvey (Dulcie Gray), Jan's sensible and supportive mother, the millionaire businessman Charles Frere (Tony Anholt) and the wealthy but unhappy Urquhart family. Gerald (Ivor Danvers) is the right-hand man of Charles Frere. Polly (Patricia Shakesby), a friend of Jan, is a bored corporate wife preoccupied with preserving her social status, and their daughter Abby (Cindy Shelley) is a socially awkward young woman who has returned to Tarrant after completing her education at a Swiss finishing school and who establishes a friendship with Leo Howard. Unlike the comparatively close and secure Howard family, the Urquharts have secrets to hide. Gerald and Polly's marriage is a sham—an arrangement to cover the fact that Gerald is bisexual, to give him respectability in the business world and give a name to Abby, Polly's illegitimate daughter after an affair at university. Abby herself is pregnant, after a brief relationship in Switzerland.", "| scope=\"col\" colspan=\"1\" style=\"background:#F0F8FF\"| Tony Anholt"]}, {"page": "Anholt", "response": ["*Tony Anholt (1941–2002), British actor (father of Christien Anholt)"]}, {"page": "Cranleigh School", "response": ["* Tony Anholt (actor)"]}, {"page": "The Metamorph", "response": ["* Tony Anholt — Tony Verdeschi", "* Under Mentor's make-up, viewers will recognise Brian Blessed, famous for his sonorous voice and 'hearty, king-sized portrayals';Brian Blessed Wikipedia article Blessed had appeared in the first-series episode \"Death's Other Dominion\" as Doctor Cabot Rowland.  Before joining the programme as Maya, Catherine Schell had also guest-starred in the previous series, portraying an android temptress, the Servant of the Guardian, in \"Guardian of Piri\".  Tony Anholt had starred as Paul Buchet in The Protectors, another Anderson production, before assuming the role of Tony Verdeschi."]}, {"page": "The Beta Cloud", "response": ["*Tony Anholt — Tony Verdeschi"]}, {"page": "The Dorcons", "response": ["* Tony Anholt — Tony Verdeschi"]}, {"page": "The Mark of Archanon", "response": ["*Tony Anholt — Tony Verdeschi", "* In the case of this 'Helena Double-Up' script, Barbara Bain was the featured star with supporting actors Nick Tate and Tony Anholt joining her for a story set primarily in the standing Moonbase sets on Stage 'L'.  Short scenes involving Martin Landau and Catherine Schell were filmed in the Eagle command module, with Landau and Bain appearing together on-screen only in the epilogue.  ('The Rules of Luton' was filmed simultaneously on location, with Landau and Schell receiving the majority of the screen time.)"]}, {"page": "The Taybor", "response": ["* Tony Anholt – Tony Verdeschi"]}, {"page": "The Seance Spectre", "response": ["* Tony Anholt — Tony Verdeschi"]}, {"page": "Devil's Planet", "response": ["* Tony Anholt — Tony Verdeschi", "* With a plot derived from The Most Dangerous Game, set in an alien prison reminiscent of Devil's Island, and showcasing a bevy of catsuited, whip-wielding dominatrices, \"Devil's Planet\" is the last of the 'Koenig Double-Up' scripts.  The episode is unique in that it was intentionally crafted to feature Martin Landau alone.  Barbara Bain, Catherine Schell and Tony Anholt, though receiving on-screen credit, would appear only in library footage seen during Koenig's mind-probe; Bain would also be heard narrating Helena's customary status report at the start of the episode.  At the time of filming, Bain, Schell, Anholt and Nick Tate were off filming the opposing double-up episode \"Dorzak\"."]}, {"page": "Brian the Brain", "response": ["*Tony Anholt — Tony Verdeschi"]}, {"page": "Catacombs of the Moon", "response": ["* Tony Anholt — Tony Verdeschi", "* \"Catacombs of the Moon\" is a 'Helena Double-Up' script and was produced simultaneously along with \"The AB Chrysalis\".  Series regulars Barbara Bain, Tony Anholt and Zienia Merton carried the majority of the action.  Martin Landau's brief scenes were confined to the Eagle command module; his only interaction with Bain occurred via TV monitor in the epilogue.  Catherine Schell's two small contributions amounted to a cameo appearance.  The episode is set primarily in the standing Alpha sets with moderate filming in the Stage 'M' cavern sets originally built for \"The Metamorph\"."]}, {"page": "Journey to Where", "response": ["* Tony Anholt – Tony Verdeschi"]}, {"page": "One Moment of Humanity", "response": ["* Tony Anholt — Tony Verdeschi"]}, {"page": "The Lambda Factor", "response": ["*Tony Anholt — Tony Verdeschi", "* After working with lions, panthers and falcons, the crew undeniably asserted the most troublesome animal performer was the chimpanzee featured in this instalment.  Zienia Merton recalled how the animal refused to take direction, first fascinated by the actors standing motionless, then distracted by the TV monitor and flashing lights on her desk.  When dropping to the floor, it latched onto her leg in an inappropriately affectionate manner.Anecdotes & Armadillos, Lulu Enterprises, 2005  Crossing to Tony Anholt (who was lying on the floor), it proceeded to slobber on his face\"The Lambda Factor\" episode guide; Space: 1999 website \"The Catacombs\", Martin Willey"]}, {"page": "Gemma Craven", "response": ["In London's West End, she starred opposite Tom Conti in the musical They're Playing Our Song for which she won a Laurence Olivier Award for her performance,Theatre of Comedy productions 1980 the lead role in South Pacific, and in Noël Coward's Private Lives opposite Marc Sinden, Tony Anholt and Anholt's wife Tracey Childs which toured throughout 1991 and into 1992.British Theatre Guide 2001 She also played Josie in Boy George's Taboo and features on the OCR singing \"Independent Woman\".British Theatre Guide 2006"]}, {"page": "Tracey Childs", "response": ["Childs was married to her Howards' Way co-star Tony Anholt, from 1990 to 1998 and toured with him, Marc Sinden and Gemma Craven in Noël Coward's Private Lives throughout 1991 and into 1992."]}, {"page": "Christien Anholt", "response": ["Christien Alexis Anholt (born 25 February 1971) is an English stage, television and film actor best known for portraying Nigel Bailey in the television series Relic Hunter. His earlier notable film roles include Marcellus alongside Mel Gibson in Franco Zeffirelli’s Hamlet (1990) or Peter Emery in Stuart Urban's Preaching to the Perverted (1997). In 2021, Anholt plays T. S. Eliot in William Nunez's The Laureate depicting the life of British poet and writer Robert Graves. He is the son of actor Tony Anholt and resides in London."]}, {"page": "2002 in the United Kingdom", "response": ["**Tony Anholt, actor (born 1941)"]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Cristina Raines, Marius Goring, Simon Williams, Tony Anholt, Zienia Merton, Tom Chadbon, Michael Elwyn, Derek Benfield, Lewis Fiander"]}, {"page": "List of Only Fools and Horses characters", "response": ["Abdul Khan (Tony Anholt) only appeared in one episode; To Hull and Back, where he and Boycie arranged a deal with Del, in order to smuggle diamonds from Amsterdam. Although, this was the only episode in which he appeared, Abdul was also mentioned in Diamonds Are for Heather, when Del tells Heather where he got the engagement ring; Video Nasty, when Del had struck a deal with Abdul's cousin's girlfriend's brother's friend, and in the second Rock & Chips episode Five Gold Rings when Del tells his friends that he got four glass diamond rings from Abdul's father, who owns the Bermondsey Wholesale Jewellery Emporium."]}, {"page": "1941 in the United Kingdom", "response": ["** Tony Anholt, actor (died 2002)"]}, {"page": "The Last Days of Pompeii (miniseries)", "response": ["| Tony Anholt"]}, {"page": "1941 in British television", "response": ["* 19 January – Tony Anholt, Singaporean-English actor (died 2002)"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Patrick Troughton as Joe Mancini, Jenifer Landor as Laura, Stephen Rea as Roddy, Tony Anholt as Johnny Petselli, Janet Fielding as Janice, Billy Hartman as Billy, Judith Byfield as Ms. Knight, Jack Le White as Old Irishman"]}, {"page": "All That Glisters (Space: 1999)", "response": ["* Tony Anholt — Tony Verdeschi", "* Landau had enjoyed considerable creative input throughout the first series; that ended when Freiberger became show runner.  Years later, Tony Anholt would comment: 'Martin was desperately unhappy about the whole script; he thought it was absolute rubbish.  We all did.  Freddie, once he saw the opposition, just became utterly entrenched and would give nothing at all—that was \"the greatest episode of the series, it was the most sci-fi type of story.\"  It was going to stay, and he was going to prove his point.'  Though tempted to walk off the set, Landau and his fellow castmates ultimately refused to sabotage the production and played the episode as written.  (Viewers will note that Landau's mood bled through into his performance:  Koenig appears especially irritable and short-tempered in this installment.)"]}, {"page": "New Adam, New Eve", "response": ["*Tony Anholt — Tony Verdeschi"]}, {"page": "The Bringers of Wonder, Part One", "response": ["* Tony Anholt — Tony Verdeschi"]}, {"page": "The Bringers of Wonder, Part Two", "response": ["* Tony Anholt — Tony Verdeschi"]}, {"page": "The Strauss Family", "response": ["*Tony Anholt as Eduard Strauss"]}]}}