{"wiki_id": "http://www.wikidata.org/entity/Q7071151", "itemLabel": "Nyle Wolfe", "itemDescription": "Irish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nyle_Wolfe", "wikipedia_page": {"main": "Nyle Wolfe (born October 1971) is an Irish operatic baritone, who has sung with the Musiktheater im Revier in Germany and Opera Ireland. His first solo album Moodswings was released in Ireland in 2007.\nWolfe trained as a singer at the Cork School of Music, Leinster School of Music & Drama, Dublin, and the Royal Academy of Music, London, followed by further studies at the Opera Studio at Zurich Opera House.  He sang Don Pedro in Béatrice et Bénédict in Baden-Baden and Paris with European Opera. In Dublin he sang in Salome and Lady Macbeth of the Mtsensk District with Opera Ireland. At the Zurich Opera House he sang Baculus in Der Wildschütz.\nIn 2000, Wolfe was engaged as principal lyric baritone at the Musiktheater im Revier where he sang in many performances, including Dandini in La Cenerentola, Belcore in L'elisir d'amore, Guglielmo in Così fan tutte, Figaro in The Barber of Seville and in the German premiere of Roland Moser's Avatar. At the Ruhrtriennale Festival he sang the world premiere of Alexander Mullenbach's Die Todesbrücke which was revived at the Théâtre National de Luxemburg. Wolfe was also guest with other opera companies, including Opera Ireland for the Irish premiere of Mark-Anthony Turnage's The Silver Tassie and in Cologne in La finta giardiniera.\nIn November 2006, Nyle returned to Cork Opera House as Figaro in Rossini's Barber of Seville with Opera 2005. The production was nominated for a theatre award by The Irish Times.\nHe released his album Moodwings in 2007 and went on a national concert tour of Ireland. In  2010 gave a recital at the National Concert Hall Dublin, appeared in a puppet driven production of The Magic Flute in Cork, Romeo and Juliet in Dublin, and sang the role of Sciarrone  in Tosca—Opera Ireland's last production before its closure.", "link_mentions": [{"page": "On Raglan Road", "response": ["Besides Kelly's version with The Dubliners, the song, often known simply as Raglan Road, has since been sung by Van Morrison w/The Chieftains, Mark Knopfler, Ed Sheeran, The Young Dubliners, Sinéad O'Connor,  Billy Bragg, Roger Daltrey, Dick Gaughan, Loreena McKennitt, Billy Joel, Joan Osborne, Órla Fallon, Ian Tamblyn, Tommy Fleming, Mary Black, Bonnie 'Prince' Billy and Nyle Wolfe among others."]}, {"page": "Nyle P. Wolfe", "response": ["#REDIRECT Nyle Wolfe"]}, {"page": "Wolfe (surname)", "response": ["* Nyle Wolfe, vocalist / opera singer"]}, {"page": "Black Is the Color of My True Love's Hair", "response": ["| Nyle Wolfe"]}, {"page": "Southampton Operatic Society", "response": ["In 1987 a junior section was formed in an effort to introduce younger members to its ranks and this has been a successful development.http://www.debyoutheatre.org Now called Debut Youth Theatre it too has been the launch pad for several professional careers, notably Rae Baker, Nyle Wolfe, Laura Carmichael and, Simon Pontin."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Nyle Wolfe (baritone)"]}, {"page": "Feis Maitiú Corcaigh", "response": ["* Nyle Wolfe"]}, {"page": "Nyle (given name)", "response": ["*Nyle Wolfe (born 1971), American singer"]}]}}