{"wiki_id": "http://www.wikidata.org/entity/Q7087956", "itemLabel": "Oliver Zangwill", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Zangwill", "wikipedia_page": {"main": "Oliver Louis Zangwill FRS (29 October 1913 – 12 October 1987) was an influential British neuropsychologist. He was Professor of Experimental Psychology, University of Cambridge, 1952–1981, and then Professor Emeritus.  His father was author Israel Zangwill; his mother was author Edith Ayrton, whose parents were physicist William Edward Ayrton and physician Matilda Chaplin.  He was elected a Fellow of the Royal Society in 1977.", "link_mentions": [{"page": "List of psychologists", "response": ["* Oliver Zangwill"]}, {"page": "Israel Zangwill", "response": ["Zangwill married Edith Ayrton, a feminist and author who was the daughter of cousins William Edward Ayrton and Matilda Chaplin Ayrton.  They lived for many years in East Preston, West Sussex in a House called Far End. The younger of their two sons was the British psychologist, Oliver Zangwill."]}, {"page": "Brenda Milner", "response": ["One of her supervisors in the Department of Experimental Psychology, Cambridge was Oliver Zangwill and to him she owed her first interest in human brain function, and the value of studying brain lesions.  "]}, {"page": "List of British Jews", "response": ["* Oliver Zangwill, professor of psychologyJYB 1980 p182"]}, {"page": "Thomas Moult", "response": ["Moult's daughter Joy was the first wife of psychologist Oliver Zangwill."]}, {"page": "Zangwill", "response": ["*Oliver Zangwill (1913–1987), British neuropsychologist"]}, {"page": "William Edward Ayrton", "response": ["Chaplin and Ayrton's daughter was the feminist and author Edith Ayrton, wife of Israel Zangwill and mother of Oliver Zangwill."]}, {"page": "List of Old Gowers", "response": ["* Oliver Zangwill Professor of Psychology, University of Cambridge."]}, {"page": "Thomas Richard Miles", "response": ["One of the first students in the institute of experimental psychology at Oxford University, he was much influenced by the eminent experimental psychologist Oliver Zangwill.  His first lectureship was at University College of North Wales, Bangor in the departments of education and philosophy in 1949. He was appointed as the first professor of the new Department of Psychology at Bangor in 1963. He was a founder member of the British Dyslexia Association in 1972, and served as one of its vice-presidents. In 1974 he founded the Bangor Dyslexia Unit (now the Miles Dyslexia Centre) to recruit teachers, to train them in multi-sensory methods of training, and to organise their work in the community, in collaboration with Gwynedd and Anglesey Local Education Authorities."]}, {"page": "Cognitive neuroscience of dreams", "response": ["Preliminary observations into the neurology of dreaming were reported in 1951 by George Humphrey and Oliver Zangwill. Their report noted two cases of brain injury that resulted in the complete or almost complete cessation of dreaming. Both patients had undergone damage to posterior parietal regions, one of which involved predominately the left side of the parieto-occipital areas. Additional effects involved hemianopia, reduced visualization (in waking state), and disturbances in visual memory. Patients reported that their visual images were dim and hard to evoke. Although they reported only two cases, Humphrey and Zangwill offered preliminary ideas about neurological components of dreaming, specifically the association of forebrain areas and the link between visual imaging and the ability to dream.Humphrey, M. E., & Zangwill, O.L. (1951) Cessation of dreaming after brain injury. Journal of Neurology, Neurosurgery, and Psychiatry, 14, 322."]}, {"page": "John Raymond Smythies", "response": ["Inspired by the fact that mescaline produces such remarkable effects on all human mental faculties and by the interdisciplinary work of Albert Schweitzer, in the same year Smythies decided to tackle the mind-brain problem in a systematic way i.e. by undertaking a rigorous training in neuroscience, experimental psychology and philosophy. He first worked for one year as a resident in the EEG Department at the National Hospital, Queen Square, London (21). He then took an M.Sc. degree in neuroanatomy, philosophy and cultural anthropology with the neuroanatomist William C. Gibson at the University of British Columbia (22). The neuroanatomical research involved was a study of the synaptic structure in human cortex as revealed by silver staining and was awarded a post-graduate M.D degree by Cambridge (23). His teacher in philosophy was the distinguished American philosopher Avrum Stroll, who became a lifelong mentor and friend. This was followed during the tenure of a Nuffield Fellowship by six months with the Nobel Laureate Sir John Eccles in neurophysiology and 18 months at the Psychological Laboratory in Cambridge with Oliver Zangwill studying the stroboscopic patterns (the complex geometrical hallucinations induced by looking at a flickering light). This work has been extensively reviewed by John Geiger. Then Smythies worked a further two years in neuropharmacology with Harold E. Himwich in Galesburg, Illinois and with Hudson Hoagland at the Worcester Foundation, before returning to London where he completed his formal clinical psychiatric training with Sir Aubrey Lewis at the Maudsley Hospital (25). He then joined the Faculty of the University of Edinburgh for twelve years, first as senior lecturer then reader (26), before being invited to a personal chair at the University of Alabama at Birmingham, funded by the Ireland family, where he stayed for eighteen years (27)."]}, {"page": "Matilda Chaplin Ayrton", "response": ["Chaplin and Ayrton's daughter was the feminist and author Edith Ayrton, wife of Israel Zangwill and mother of Oliver Zangwill."]}, {"page": "Hypnotic induction", "response": ["Oliver Zangwill pointed out in opposition that, while cultural expectations are important in hypnotic induction, seeing hypnosis only as a conscious process of influence fails to account for such phenomena as posthypnotic amnesia or post-hypnotic suggestion.O. L. Zangwill, 'Experimental Hypnosis' in R. Gregory ed., The Oxford Companion to the Mind (1987) p. 330"]}, {"page": "Oliver Louis Zangwill", "response": ["#redirectOliver Zangwill"]}, {"page": "Oliver L. Zangwill", "response": ["#redirectOliver Zangwill"]}, {"page": "Zangwill, Oliver", "response": ["#redirectOliver Zangwill"]}, {"page": "George Westby", "response": ["Westby read Philosophy, politics and economics at University of Oxford and then worked in a variety of roles before returning to that university and obtaining a Diploma in Psychology under the guidance of Oliver Zangwill. "]}]}}