{"wiki_id": "http://www.wikidata.org/entity/Q708782", "itemLabel": "Arthur Brown", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Brown_(musician)", "wikipedia_page": {"main": "Arthur Wilton Brown (born 24 June 1942) is an English singer-songwriter best known for his flamboyant and theatrical performances, eclectic (and sometimes experimental) work and his powerful, wide-ranging operatic voice, in particular his high pitched banshee screams. He was also notable for his unique stage persona such as extreme facepaint and burning helmet.\nBrown has been lead singer of various groups, most notably the Crazy World of Arthur Brown and Kingdom Come, followed by a varied solo career as well as associations with Hawkwind, the Who and Klaus Schulze. In the late 1960s, the Crazy World of Arthur Brown's popularity was such that the group shared bills with the Who, Jimi Hendrix, the Mothers of Invention, the Doors, the Small Faces, and Joe Cocker, among others.He is best known for The Crazy World of Arthur Brown's 1968 single \"Fire\", reaching number one in the UK Singles Chart and Canada, and number two on the US Billboard Hot 100 as well as its parent album The Crazy World of Arthur Brown which reached number 2 in the UK and number 7 in the US. Following the success of the single \"Fire\", the press would often refer to Brown as \"The God of Hellfire\", in reference to the opening shouted line of the song, a moniker that exists to this day.Although Brown has had limited commercial success and has never released another recording as commercially successful as \"Fire\", he has remained a significant influence on a wide range of musicians in numerous genres due to his operatic vocal style, wild stage persona, and often experimental concepts; he is considered to be a pioneer of shock rock and progressive rock and has had an influence on both electronic and heavy metal music. In 2005, Brown won the 'Showman of the Year' award from Classic Rock magazine, with Brown receiving the award at the Classic Rock Roll of Honour Awards ceremony held in London's Café de Paris.", "link_mentions": [{"page": "The Alan Parsons Project", "response": ["Vocal duties were shared by guests to complement each song. In later years, Woolfson sang lead on many of the group's hits, including \"Time\", \"Eye in the Sky\", and \"Don't Answer Me\". The record company pressured Parsons to use him more, however Parsons preferred to use polished proficient singers; Woolfson admitted he was not in that category. In addition to Woolfson, vocalists Chris Rainbow, Lenny Zakatek, John Miles, David Paton, and Colin Blunstone are regulars. Other singers, such as Arthur Brown, Steve Harley, Gary Brooker, Dave Terry a.k.a. Elmer Gantry, Vitamin Z's Geoff Barradale, and Marmalade's Dean Ford, recorded only once or twice with the Project. Parsons sang lead on one song (\"The Raven\") through a vocoder and backing on a few others, including \"To One in Paradise\". Both of those songs appeared on Tales of Mystery and Imagination (1976). Parsons also sings a prominent counter melody on “Time”.", "* Arthur Brown – vocals (1975)"]}, {"page": "Hawkwind", "response": ["An appearance at the Canterbury Sound Festival in August 2001, resulting in another live album Canterbury Fayre 2001, saw guest appearances from Lloyd-Langton, House, Kniveton with Arthur Brown on \"Silver Machine\". The band organised the first of their own weekend festivals, named Hawkfest, in Devon in the summer of 2002. Brown joined the band in 2002 for a Winter tour which featured some Kingdom Come songs and saw appearances from Blake and Lloyd-Langton, the Newcastle show being released on DVD as Out of the Shadows and the London show on CD as Spaced Out in London.", "In 2005 a new album Take Me to Your Leader was released. Recorded by the core band of Brock/Davey/Chadwick, contributors included new keyboardist Jason Stuart, Arthur Brown, tabloid writer and TV personality Matthew Wright, 1970s New Wave singer Lene Lovich, Simon House and Jez Huggett. This was followed in 2006 by the CD/DVD Take Me to Your Future.", "For the Into The Woods tour the group had performed an opening acoustic set before the main set, and they decided to capture some acoustic performances of their 1970s repertoire in the studio. A chance meeting with Mike Batt by Brock at the US Embassy brought him into the project contributing production, arrangement and additional orchestrations. The album Road to Utopia was released on 14 September 2018. There was a guest appearance from Eric Clapton, who Brock had performed with as a duo in the 1960s prior to his rise to fame in The Yardbirds.  Batt conducted a series of concerts titled In Search of Utopia - Infinity and Beyond featuring the band and Docklands Sinfonia Orchestra in October and November, with Arthur Brown guesting. After the recording of the album but before the shows, both Wheaton and Dibs left, while Hone rejoined on bass. Wheaton went on to join Electric Wizard, and Dibs stated \"irreconcilable differences\" on the Hawkwind fans Facebook page, Brock claiming \"we propped the fella up and kept him in the band longer than he should have been, because we were genuinely concerned... about his state of mind.\""]}, {"page": "Heavy metal music", "response": ["During the late 1960s, many psychedelic singers, such as Arthur Brown, began to create outlandish, theatrical and often macabre performances that influenced many metal acts.Polly Marshall, The God of Hellfire, the Crazy Life and Times of Arthur Brown, , SAF Publishing, 2005, p. 175Polly Marshall, The God of Hellfire, the Crazy Life and Times of Arthur Brown, , SAF Publishing, 200, p. 103 The American psychedelic rock band Coven, who opened for early heavy metal influencers such as Vanilla Fudge and the Yardbirds, portrayed themselves as practitioners of witchcraft or black magic, using dark—Satanic or occult—imagery in their lyrics, album art, and live performances. Live shows consisted of elaborate, theatrical \"Satanic rites\". Coven's 1969 debut album, Witchcraft Destroys Minds & Reaps Souls, featured imagery of skulls, black masses, inverted crosses, and Satan worship, and both the album artwork and the band's live performances marked the first appearances in rock music of the sign of the horns, which would later become an important gesture in heavy metal culture. At the same time in England, the band Black Widow were also among the first psychedelic rock bands to use occult and Satanic imagery and lyrics, though both Black Widow and Coven's lyrical and thematic influences on heavy metal were quickly overshadowed by the darker and heavier sounds of Black Sabbath."]}, {"page": "June 24", "response": ["*1942 – Arthur Brown, English rock singer-songwriter"]}, {"page": "Marilyn Manson (band)", "response": ["As its only permanent member, Manson heads the direction of the band's sound; he has been influenced by the shock rock of artists such as Arthur Brown,\"The God of Hellfire Speaks: 73 Years Inside the Crazy World of Arthur Brown\" . Vice. Retrieved December 29, 2017 Alice Cooper, The Doors, Black Sabbath/Ozzy Osbourne and Iggy Pop. His biggest influence, however, was David Bowie, whom he credited with \"changing [his] life forever\". The two have often been compared by mainstream media, particularly in relation to their ability to shift genre and style – replete with a new look and musical philosophy – with each studio release. Manson's two favorite songs are Bowie's \"Quicksand\" and \"Ashes to Ashes\". For several years, Manson sang Bowie's \"Cat People (Putting Out Fire)\" as a vocal warm up exercise before live performances; he later covered the song with outlaw country musician Shooter Jennings."]}, {"page": "Robert Calvert", "response": ["As well as Michael Moorcock and Brian Eno, Calvert's collaborators included Arthur Brown, Steve Peregrin Took, Jim Capaldi, Steve Pond, Inner City Unit, Vivian Stanshall, Nektar, John Greaves, Adrian Wagner, Amon Düül II and, posthumously, Spirits Burning, Dave Brock, and Krankschaft."]}, {"page": "Screaming Lord Sutch", "response": ["During the 1960s Screaming Lord Sutch was known for his horror-themed stage show, dressing as Jack the Ripper, pre-dating the shock rock antics of Arthur Brown and Alice Cooper. Accompanied by his band, the Savages, he started by coming out of a black coffin (once being trapped inside of it, an incident parodied in the film Slade in Flame). Other props included knives and daggers, skulls and \"bodies\". Sutch booked themed tours, such as 'Sutch and the Roman Empire', where Sutch and the band members would be dressed up as Roman soldiers. Fellow musician Chas McDevitt has claimed that he gave the idea for a Screamin' Jay Hawkins-inspired act to Sutch's manager Paul Lincoln after seeing Hawkins perform in New York in 1957, having already considered emulating Hawkins himself by starting his act by emerging from a silk-lined coffin but deciding that he \"(didn't have) the personality to carry this off\", stating that \"no one in this country had heard of Hawkins until the mid-60s\"."]}, {"page": "Yes (band)", "response": ["In June and July 2019, Yes headlined the Royal Affair Tour across the U.S. with a line-up featuring Asia, John Lodge, and Carl Palmer's ELP Legacy with Arthur Brown. This was followed by previously unreleased music, recorded during the Fly from Here sessions, put out as From a Page, a release spearheaded by Oliver Wakeman who wrote most of its material. The CD version includes an expanded edition of In the Present – Live from Lyon. A live album from the Royal Affair Tour, entitled The Royal Affair Tour: Live from Las Vegas, was released in October 2020. Videos of Dean creating the album cover were streamed live on Facebook. Yes had planned to resume touring in 2020, beginning with a short US leg in March and their appearance on Cruise to the Edge, followed by a European tour that continued their Album Series Tour and featured Relayer performed in its entirety. In March 2020, both tours were postponed due to the COVID-19 pandemic. On 23 March 2021, Yes announced that the Relayer tour would be postponed yet again and rescheduled for 2022."]}, {"page": "Lewes", "response": ["Lewes is the birthplace of 16th-century madrigalist Nicholas Yonge. In the 1960s it was home to Charlie Watts of the Rolling Stones, as it is now to other musicians, notably Herbie Flowers, Arthur Brown and Tim Rice-Oxley from Keane."]}, {"page": "The Beatles (album)", "response": ["\"Helter Skelter\" was written by McCartney and was initially recorded in July as a blues number. The band performed the initial takes live and included long passages during which they jammed on their instruments. Because these takes were too long to practically fit on an LP, the song was shelved until September, when a new, shorter version was made. By all accounts, the session was chaotic, but nobody dared suggest to any of the Beatles that they were out of control. Harrison reportedly ran around the studio holding a flaming ashtray above his head, \"doing an Arthur Brown\". The stereo version of the LP includes almost a minute more music than the mono, which culminates in Starr famously shouting \"I've got blisters on my fingers!\" Cult leader and mass murderer Charles Manson was unaware that the term helter skelter is British English for a spiral slide found on a playground or funfair, and assumed the track had something to do with hell. This was one of the tracks that led Manson to believe the album had coded messages referring to apocalyptic war, and led to his movement of the same name."]}, {"page": "Captain Lockheed and the Starfighters", "response": ["Musicians who appeared on the album include members of Hawkwind, The Pink Fairies, Brian Eno (although not credited as Eno), Arthur Brown and Adrian Wagner. The spoken sketches are primarily performed by Calvert, Viv Stanshall and Jim Capaldi.", "# \"The Song of the Gremlin (Part One)\" (Arthur Brown, Calvert, Adrian Wagner) – 3:21", "# \"The Song of the Gremlin (Part Two)\" (Arthur Brown, Calvert, Adrian Wagner) – 3:10", "* Arthur Brown - vocals on \"The Song of the Gremlin (Parts 1 and 2)\""]}, {"page": "Alice Cooper", "response": ["On seeing shock rock pioneer Arthur Brown performing his US number two hit \"Fire\" in 1968, Cooper states, \"Can you imagine the young Alice Cooper watching that with all his make-up and hellish performance? It was like all my Halloweens came at once!\" A 2014 article on Alice Cooper in The Guardian mentioned Arthur Brown and his flaming helmet, \"British rock always was more theatrical than its US counterpart. Often this involved destruction or macabre gimmickry\", with Cooper responding, \"That's why most people thought we were British at first.\""]}, {"page": "America (band)", "response": ["The debut album America was released in late December 1971 to only moderate success, although it sold well in the Netherlands, where Dexter had taken them as a training ground to practice their craft. Samwell and Dexter subsequently brought the trio to Morgan Studios to record several additional songs. One of them was a Bunnell composition called \"Desert Song\", which Dexter previously demonstrated during studio rehearsals in Puddletown, Dorset, at the home of Arthur Brown. The song had its public debut at the Harrogate Festival, four days later, to great audience response. After several performances and a TV show, it was retitled \"A Horse with No Name\". The song became a major worldwide hit in early 1972. It sold over one million copies, and was awarded a gold disc by the RIAA in March 1972. America's debut album was released in the U.S. that same month with the hit song added and quickly went platinum. The album resulted in a second major chart success with Beckley's \"I Need You\", which peaked at number 9 on the US charts."]}, {"page": "List of one-hit wonders on the UK Singles Chart", "response": ["| The Crazy World of Arthur Brown", "| The group's debut self-titled album reached number two on the album chart, but neither the band nor Arthur Brown in his own right managed to secure another placing on either the singles or album chart."]}, {"page": "Tommy (The Who album)", "response": ["In 1975 Tommy was adapted as a film, produced by expatriate Australian entrepreneur Robert Stigwood and directed by British auteur Ken Russell. The movie version starred Roger Daltrey as Tommy, and featured the other members of the Who, plus a supporting cast that included Ann-Margret as Tommy's mother, Oliver Reed as \"the Lover\", with appearances by Elton John, Tina Turner, Eric Clapton, Arthur Brown, and Jack Nicholson. Russell insisted on having a known cast, though Townshend wanted people who could sing the material, and was particularly disappointed at not being allowed to cast Stevie Wonder as the Pinball Wizard. In several cinemas, the film supported a multi-track soundtrack billed as quintaphonic sound, which placed speaker banks in the four quadrants of the house and directly behind the centre of the screen."]}, {"page": "Iron Maiden", "response": ["Singer Bruce Dickinson, who typically works in collaboration with guitarist Adrian Smith, has an operatic vocal style, inspired by Arthur Brown, Peter Hammill, Ian Anderson and Ian Gillan, and is often considered to be one of the best heavy metal vocalists of all time. Although Nicko McBrain has only received one writing credit, on the Dance of Death album, Harris often relies on him while developing songs. Adrian Smith commented, \"Steve loves playing with him. [They] used to work for hours going over these bass and drum patterns.\""]}, {"page": "1968 in music", "response": ["*The Crazy World of Arthur Brown – The Crazy World of Arthur Brown", "*\"Fire!\" – The Crazy World of Arthur Brown"]}, {"page": "1944 in music", "response": ["**Arthur Brown, singer (The Crazy World of Arthur Brown)"]}, {"page": "King Diamond", "response": ["Diamond cites Arthur Brown, David Byron, Alice Cooper, Ronnie James Dio, Ian Gillan, Ozzy Osbourne and Robert Plant as his primary influences."]}, {"page": "Screamin' Jay Hawkins", "response": ["\"I Put a Spell On You\" became a classic, covered by a variety of artists such as Creedence Clearwater Revival, Nina Simone, Alan Price, The Animals, Them with Van Morrison, Arthur Brown, Bryan Ferry, Buddy Guy, Carlos Santana, Tim Curry, Leon Russell, Joe Cocker, Nick Cave, Marilyn Manson, Mica Paris, David Gilmour, Jeff Beck, Joss Stone, Diamanda Galas, and Annie Lennox. Hawkins' original version was featured during the show and over the credits of the 2003 The Simpsons episode \"I'm Spelling as Fast as I Can\".", "In 2001, the Greek director and writer Nicholas Triandafyllidis made the documentary Screamin' Jay Hawkins: I Put a Spell on Me about various stages of his life and career, including a filming of his last-ever live performance, in Athens on December 11, 1999, two months before his death, following a performance the day before in Salonica. In the documentary notable artists such as Jim Jarmusch, Bo Diddley, Eric Burdon, Frank Ash, Arthur Brown and Michael Ochs talked about Screamin' Jay Hawkins' early life, personality and career, and about his incredible talent.", "Although Hawkins was not a major success as a recording artist, his highly theatrical performances from \"I Put a Spell on You\" onward earned him a steady career as a live performer for decades afterward, and influenced subsequent acts. He opened for Fats Domino, Tiny Grimes and the Rolling Stones. This exposure in turn influenced rock acts such as Alice Cooper, Tom Waits, the Cramps, Screaming Lord Sutch, Black Sabbath, Creedence Clearwater Revival, Arthur Brown, Led Zeppelin, Marilyn Manson, Rob Zombie, and Glenn Danzig. Vox.com described Hawkins as a \"goth icon\"."]}, {"page": "Tales of Mystery and Imagination (Alan Parsons Project album)", "response": ["Musicians featured on the album include vocalists Arthur Brown of The Crazy World of Arthur Brown on \"The Tell Tale Heart\", John Miles on \"The Cask of Amontillado\" and \"(The System of) Dr. Tarr and Professor Fether\", and Terry Sylvester of The Hollies on \"To One in Paradise\". The complete line-up of bands Ambrosia and Pilot play on the record, along with keyboardist Francis Monkman of Curved Air and Sky.", "*Arthur Brown – lead vocals "]}, {"page": "The Crazy World of Arthur Brown (album)", "response": ["The Crazy World of Arthur Brown is the eponymous debut studio album by the English psychedelic rock band the Crazy World of Arthur Brown. The album was produced by the Who's manager Kit Lambert with associate production by Pete Townshend. The album was released in June 1968 on Lambert's Track Records label in the UK, with North American distribution handled by Atlantic Records. The album was released in the US in September. (Early North American copies of the album, while distributed by Atlantic, bore the Track Records imprint; later pressings were released on the Atlantic label proper.) It was the only album released by the band in its original incarnation; a follow-up was recorded in 1969 but went unreleased for two decades.", "The Crazy World of Arthur Brown was the only album released by the band during its active tenure, and features the band's core members Arthur Brown (vocals), Vincent Crane (organ, piano and vibes), and Drachen Theaker (drums). Bass guitar, where used, was provided by Nick Greenwood; session drummer John Marshall replaced Theaker on two selections. Horn and string overdubs were also employed on side one of the album. While the latter were done for tactical reasons, Brown's opinion is that the overdubs add to the album's overall presentation, replacing visuals and costume changes he would have employed in live performance to achieve dramatic effect.", "Considered a classic of the late-1960s psychedelic scene and a significant influence on progressive rock, The Crazy World of Arthur Brown included a full album side of original songs focused on the horrors of Hell, including Brown's signature song \"Fire\" which showcased Crane's organ and brass arrangement as well as Brown's powerful, wide-ranging operatic voice. The album's second side contained a mix of original songs and covers, the latter being Screamin' Jay Hawkins' \"I Put a Spell on You\" and James Brown's \"I've Got Money.\" The album's format reflected a compromise between Brown and the band's producer/manager Kit Lambert; Brown's original intent was to produce an album-long rock opera incorporating the material included on side one, while Lambert wanted to produce a more overtly commercial record, including cover material from the band's stage act.", "In Ronnie Wood's radioshow of 14 November 2011, both Wood and Alice Cooper claim that the bass on the single \"Fire\" is performed by Ron Wood, but Polly Marshall's biography of Arthur Brown states that \"According to the-faces.com, Ronnie claims he played on the Track Records studio sessions recording Fire, but he must have confused it with the BBC session [of 8 April 1968].\"Polly Marshall, The God of Hellfire, the Crazy Life and Times of Arthur Brown, , SAF Publishing, 2005, page 64 There is no bass guitar on the recording, only bass pedals.", "# \"Prelude/Nightmare\" (Arthur Brown) – 3:28", "* Arthur Brown – vocals", "Category:Arthur Brown (musician) albums"]}, {"page": "Ronnie Wood", "response": ["In Wood's radioshow of 14 November 2011, both Wood and Alice Cooper claimed that Wood performed the bass on The Crazy World Of Arthur Brown's number one hit \"Fire\"; however, Polly Marshall's biography of Arthur Brown states that \"According to the-faces.com, Ronnie claims he played on the Track Records studio sessions recording Fire, but he must have confused it with the BBC session [of 8 April 1968].\"Polly Marshall, The God of Hellfire: the Crazy Life and Times of Arthur Brown, , SAF Publishing, 2005, page 64 There is no bass guitar on the recording, only bass pedals."]}, {"page": "Bruce Dickinson", "response": ["At Oundle, Dickinson was picked on and routinely bullied by the older boys of Sidney House, the boarding house that he belonged to, which he described as \"like systematic torture\" and meant that he became an outsider. His interests at Oundle were often military; he co-founded the school wargames society with Mike Jordan, and he joined the school's cadet force. This gave him access to live ammunition, which he used to create explosions as booby-traps. Oundle was where Dickinson became attracted to hard rock and early heavy metal after hearing Deep Purple's \"Child in Time\" being played in another student's room. As a result, the first album he ever bought was Deep Purple's In Rock, which created his interest in rock and metal music. After In Rock, he went on to buy Black Sabbath's debut, Jethro Tull's Aqualung and Tarkus by Emerson, Lake & Palmer. Every term, a band would play at the school, the first of these which Dickinson saw was called Wild Turkey, featuring former Jethro Tull bassist Glenn Cornick. After that, he saw Van der Graaf Generator and Arthur Brown.", "Although Dickinson never received formal training, he still possesses a wide vocal range which was trademarked by his quasi-operatic tenor. Along with Ronnie James Dio and Rob Halford, Dickinson is one of the pioneers of the operatic vocal style later to be adopted by power metal vocalists and regularly appears near the top in lists of the greatest rock vocalists/front-men of all time. Dickinson says that his style was influenced primarily by Arthur Brown, Peter Hammill (Van der Graaf Generator), Ian Anderson (Jethro Tull) and Ian Gillan (Deep Purple)."]}, {"page": "This Was", "response": ["This Was received generally favourable reviews and sold well upon its release. Record Mirror thoroughly recommended the album in 1968 for being \"full of excitement and emotion\" and described the band as a blues ensemble \"influenced by jazz music\" capable of setting \"the audience on fire\". Allen Evans of New Musical Express wrote in his review that the album \"sounds good and has a lot of humour about it\" and that the band \"play jazz really, in a soft, appealing way, and have a bit of fun on the side with tone patterns and singing\". American critic Robert Christgau, on the contrary, was appalled by the success of a band that combined \"the worst of Roland Kirk, Arthur Brown, and your nearest G.O. blues band.\""]}, {"page": "Pretty Things", "response": ["Their label, Snapper Music, issued remastered CDs with many bonus tracks, plus a DVD of the September 1998 live netcast re-recording of S.F. Sorrow at Abbey Road Studios, with David Gilmour and Arthur Brown as guest players. They played a tour of the U.S. for the first time in decades."]}, {"page": "Peter Green (musician)", "response": ["In 1981, Green contributed to \"Rattlesnake Shake\" and \"Super Brains\" on Mick Fleetwood's solo album The Visitor. He recorded various sessions with a number of other musicians notably the Katmandu album A Case for the Blues with Ray Dorset of Mungo Jerry, Vincent Crane from The Crazy World of Arthur Brown and Len Surtees of The Nashville Teens. Despite attempts by Gibson Guitar Corporation to start talks about producing a \"Peter Green signature Les Paul\" guitar, Green's instrument of choice at this time was a Gibson Howard Roberts Fusion guitar. In 1986, Peter and his brother Micky contributed to the album A Touch of Sunburn by Lawrie 'The Raven' Gaines (under the group name 'The Enemy Within'). This album has been reissued many times under such titles as Post Modern Blues and Peter Green and Mick Green – Two Greens Make a Blues, often crediting Pirates guitarist Mick Green."]}, {"page": "The Mindbenders", "response": ["On 20 November 1968, The Mindbenders broke up at the final concert of a UK tour with The Who, Arthur Brown and Joe Cocker."]}, {"page": "Vincent Crane", "response": ["Vincent Crane (born Vincent Rodney Cheesman; 21 May 1943 – 14 February 1989) was an English keyboardist who was best known as the organist for The Crazy World of Arthur Brown and Atomic Rooster. Crane co-wrote \"Fire\", the 1968 hit single by The Crazy World of Arthur Brown.", "Born Vincent Rodney Cheesman in Reading, Berkshire, he taught himself boogie woogie piano as a teenager before attending Trinity College of Music between 1961 and 1964. Influenced by Graham Bond,  he took up Hammond organ. In late 1966 he formed the Vincent Crane Combo, which comprised bass player Binky McKenzie, sax player John Claydon and drummer Gordon Hadler. In 1967 he teamed up with Arthur Brown in The Crazy World of Arthur Brown. Their eponymous debut album, The Crazy World of Arthur Brown (1968) contained the song \"Fire\", co-written by Crane and a chart-topping hit single in the United Kingdom, the United States and Canada, with Crane's organ and brass arrangement to the fore.", "During their first tour of the United States in 1968, Crane suffered a nervous breakdown and returned to the United Kingdom where he spent 3 or 4 months in the mental hospital at Banstead. Crane rejoined the band but on a subsequent tour of the United States, the band disintegrated in June 1969 when Arthur Brown temporarily disappeared to a commune and Crane and drummer Carl Palmer left to form Atomic Rooster, playing their first concert at the Lyceum in London on 29 August headlining over Deep Purple. Atomic Rooster enjoyed success in 1971 with two hit singles, \"Tomorrow Night\" (written by Crane) and \"Devil's Answer\". Crane was the one constant member of the band through their almost constantly changing lineups, and wrote a slim majority of their material.", "He collaborated with other musicians on a number of albums, including Rory Gallagher (Rory Gallagher, 1971), Arthur Brown (Faster Than the Speed of Light, 1979), Peter Green, Richard Wahnfried, and Dexys Midnight Runners (Don't Stand Me Down, 1985). In 1983, he was part of the one-off blues outfit, Katmandu, with Ray Dorset, Len Surtees, and Peter Green, who recorded the album A Case for the Blues.", "* 1997: Taro Rota (with Arthur Brown)", "=== The Crazy World of Arthur Brown ===", "* 1968: The Crazy World of Arthur Brown", "=== with Arthur Brown ===", "Category:The Crazy World of Arthur Brown members"]}, {"page": "Isle of Wight Festival", "response": ["The first festival was held at Hells Field, Ford farm, near Godshill, on 31 August and 1 September 1968, and was attended by about 10,000 people. Jefferson Airplane headlined, with Arthur Brown, The Move, Smile, Tyrannosaurus Rex, Aynsley Dunbar Retaliation, Plastic Penny, Fairport Convention, and The Pretty Things also performing.", "The event was revived in 2002 at Seaclose Park, a recreation ground on the outskirts of Newport. It has been held annually since that year, progressively extending itself northwards beyond Seaclose Park along the fields of the eastern Medina valley. Many artists have performed since its revival including The Rolling Stones, Amy Winehouse, Paolo Nutini, The Crazy World of Arthur Brown, Paul McCartney, Muse, Boy George, Stereophonics, Faithless, Donovan, Ray Davies, Robert Plant, Queen + Adam Lambert, David Bowie,  Manic Street Preachers, The Who,  The High Kings, R.E.M., Travis, Coldplay, The Zombies, The Proclaimers, Bryan Adams, The Police, Foo Fighters, The Killers, Nile Rodgers and Chic, Fleetwood Mac, Madness, Paloma Faith and Kings of Leon. Bowie's 13 June 2004 concert would prove to be his last live performance in the UK following emergency angioplasty in Hamburg after a concert in Germany twelve days later which eventually saw him retire from touring. It was sponsored by Nokia from 2004 to 2006. The promoters of the event now are Solo Promoters Ltd."]}, {"page": "Shock rock", "response": ["A 2014 article in The Guardian stated, \"British rock always was more theatrical than its US counterpart. Often this involved destruction or macabre gimmickry: The Move smashing TV sets, Arthur Brown and his flaming helmet, Screamin' Lord Sutch making a entrance from inside a coffin\".", "The 1960s brought several proto-shock rock artists. In the UK, The Who often destroyed their instruments, The Move did the same to television sets, and Arthur Brown wore vivid makeup and a flaming headpiece. In the US, Jimi Hendrix set his guitar alight at the Monterey Pop Festival in 1967. Detroit musician Iggy Pop of The Stooges adopted a violent, erratic onstage persona which drew widespread recognition, as Pop would often throw his body about the stage, frequently injuring his band members. Pop was known to wear a dog collar during some performances, along with arm length silver lamé gloves, exemplifying both shock and glam rock sensibilities. At at least one show in 1970, Pop smeared peanut butter on his body and threw it into the crowd as well.", "On seeing Arthur Brown, Alice Cooper stated, \"Can you imagine the young Alice Cooper watching that with all his make-up and hellish performance? It was like all my Halloweens came at once!\""]}, {"page": "Helter Skelter (song)", "response": ["\"Helter Skelter\" was recorded several times during the sessions for the White Album. During the 18 July 1968 session, the Beatles recorded take 3 of the song, lasting 27 minutes and 11 seconds, although this version is slower, differing greatly from the album version. Chris Thomas produced the 9 September session in George Martin's absence. He recalled the session was especially spirited: \"While Paul was doing his vocal, George Harrison had set fire to an ashtray and was running around the studio with it above his head, doing an Arthur Brown.\" Ringo Starr recalled: \"'Helter Skelter' was a track we did in total madness and hysterics in the studio. Sometimes you just had to shake out the jams.\""]}, {"page": "Carl Palmer", "response": ["===Early groups, Arthur Brown, and Atomic Rooster===", "Drachen Theaker was the original drummer for The Crazy World of Arthur Brown, founded by Arthur Brown, and played on the band's eponymous album, including the song \"Fire\". Theaker abruptly left the band during a U.S. tour in 1969. Carl Palmer was quickly recruited as a replacement and became a permanent band member.", "Vincent Crane was the keyboard player with the Crazy World of Arthur Brown, and both he and Palmer left that group in the summer of 1969 to strike out musically on their own as Atomic Rooster, a trio formed with vocalist/bassist Nick Graham. Palmer reports that Brown himself had \"gone missing on a commune on Long Island\" and that this was a deciding factor in forming the new band. There were several personnel changes in the band, and their first album was released in early 1970. Meanwhile, Palmer received a call from Keith Emerson to audition for a new group and left Atomic Rooster in the summer of 1970.", "Category:The Crazy World of Arthur Brown members"]}, {"page": "Reading and Leeds Festivals", "response": ["* 1971: Arthur Brown, East of Eden, Colosseum"]}]}}