{"wiki_id": "http://www.wikidata.org/entity/Q7087922", "itemLabel": "Oliver Weindling", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Weindling", "wikipedia_page": {"main": "Oliver Weindling (born 1955) is a British jazz promoter and founder of the Babel jazz record label.", "link_mentions": [{"page": "List of people associated with the London School of Economics", "response": ["* Oliver Weindling, jazz promoter and founder of the Babel jazz record label"]}, {"page": "Babel Label", "response": ["Babel Label is a jazz record label founded in 1994 by Oliver Weindling. It released more than 130 recordings in its first 20 years, two of which were nominated for the Mercury Prize."]}, {"page": "Oliver weindling", "response": ["#REDIRECT Oliver Weindling "]}, {"page": "Olly Weindling", "response": ["#REDIRECT Oliver Weindling"]}, {"page": "Billy Jenkins (musician)", "response": ["In the 1990s, Jenkins recorded several albums on Oliver Weindling's Babel Records, and led some seasons at the Vortex Jazz Club. He is now best known as a blues guitarist. Until 2009, Jenkins was captain of Francis Drake bowls club on Hilly Fields, Lewisham. He masterminded a successful season of live music to accompany the 2006 FIFA World Cup at the Vortex Jazz Club."]}, {"page": "List of clarinetists", "response": ["* Oliver Weindling (born 1955)"]}, {"page": "1955 in jazz", "response": ["* 14 – Oliver Weindling, British jazz promoter and founder of the Babel Label."]}, {"page": "List of years in jazz", "response": ["* 1955 in jazz, deaths of Bessie Brown, Bob Gordon, Charlie Parker, Cow Cow Davenport, Dave Peyton, Dick Twardzik, Eddie Pollack, Ernst van 't Hoff, Henry Busse, James P. Johnson, John Spikes, Junior Raglin, Porter Grainger, Reuben Reeves, Shotaro Moriyasu, and Wardell Gray; births of Adam Nussbaum, Adam Rudolph, Akiko Yano, Alain Caron, Andrzej Łukasik, Annemarie Roelofs, Annie Whitehead, Avery Sharpe, Ben Clatworthy, Bheki Mseleku, Bill Laswell, Billie Davies, Boon Gould, Brian Hughes, Cassandra Wilson, Chalmers Alford, Chris Burnett, Chris Cain, Chris Tyle, Chuck Loeb, Curtis Lundy, Dan Barrett, David Murray, Dean Brown, Dean Friedman, Ed Schuller, Eduardo Niebla, Enver Izmaylov, Enzo Avitabile, Enzo Pietropaoli, Eric Watson, Erica Lindsay, Fred Hersch, Gary Crosby, Geoff Stradling, Georgina Born, Gerald Veasley, Gerry Hemingway, Glenn Horiuchi, Grace Knight, Grażyna Auguścik, Hamid Drake, Helge Schneider, Hiram Bullock, Hugh Marsh, Ivan Smirnov, Jan Kåre Hystad, Jane Ira Bloom, Jane Siberry, Janet Seidel, Jaribu Shahid, Jay Anderson, Jean Derome, Jeff Golub, Jeff Hirshfield, Jerry Tachoir, Joe Morris, Joey Baron, John Campbell, Johnny Alegre, Jon Balke, Joshua Breakstone, Jukka Linkola, Kenny Kirkland, Kenny Klein, Kitty Margolis, Kyle Jones, Laura Fygi, Laurent Cugny, Lesley Garrett, Marilyn Mazur, Marina Sirtis, Mark Feldman, Mark Hewins, Mars Williams, Marty Ehrlich, Mick Jones, Mihály Dresch, Mike Porcaro, Morten Gunnar Larsen, Mulgrew Miller, Nat Reeves, Nathan East, Ole Henrik Giørtz, Oliver Weindling, Pål Thowsen, Patricia Barber, Paul Sullivan, Pheeroan akLaff, Phillip Johnston, Pino Daniele, Preston Reed, Rick Braun, Robin Eubanks, Rune Klakegg, Santi Debriano, Scott Fields, Shelly Berg, Simon Spang-Hanssen, Steve Byrd, Tommy Emmanuel, Topper Headon, Vitold Rek, Vladislav Sendecki, Wayne Horvitz, and Wolfgang Reisinger."]}, {"page": "Weindling", "response": ["* Oliver Weindling (born 1955), British jazz promoter"]}, {"page": "Weindling, Oliver", "response": ["#redirectOliver Weindling"]}]}}