{"wiki_id": "http://www.wikidata.org/entity/Q7088281", "itemLabel": "Olle Romo", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Olle_Romo", "wikipedia_page": {"main": "Olle Romö is a Swedish music producer, songwriter, and drummer.\nRomo rehearsed with Swedish progressive rock group Kaipa in early 1982, however he left the group after a few weeks to join Eurythmics, and he was a drummer for them from the mid-to-late 1980s. He also worked on onetime Eurythmic Dave Stewart's solo albums in the 1990s and was a part of Stewart's Vegas project with Terry Hall. During his career he has been a programmer for producers such as Robert John \"Mutt\" Lange; on albums including Shania Twain's Come on Over and Bryan Adams' 18 til I Die. His writing credits include co-writing 'Runaway Train', performed by Elton John and Eric Clapton.\nHis production credits include Tara Blaise's Dancing on Tables Barefoot and Great Escape, The Corrs' Borrowed Heaven and David Charvet's Leap of Faith amongst others.", "link_mentions": [{"page": "Poe (singer)", "response": ["Poe's second album, Haunted, was released in October 2000.Fricke, David. \"Poe\" Rolling Stone. November 2000.Baltin, Steve. \"The Haunting Return of Poe\" Rolling Stone. November 2, 2000.Lord, M.G. \"Rise and Shine\" W Magazine. December 2000.S.B. \"Poe Haunted\" (review) Maxim Magazine. September 2000. The album, produced by Poe and Olle RomoPoe - Haunted (CD, Album) at Discogs. Discogs.com. Retrieved on 2012-12-14. was inspired by Poe's discovery of a box of audio tapes that contained recordings of her late father's voice.Appleford, Steve. \"Record Rack\"  Los Angeles Times. October 29, 2000. Listening to those tapes for the first time proved so difficult for Poe that she was hesitant to use them in her music. She was quoted in the Los Angeles Times, \"I took these tapes home, and I couldn't listen to them. It was too hard, so I kept finding ways to avoid it. They were sitting on my coffee table next to a boombox for quite some time.\" Poe was quoted in the New York Daily News about when she finally listened to the tapes, \"It was clear how the next few years of my life would be spent.\"Farber, Jim. \"A Remarkable Family Album\" The New York Daily News. October 29, 2000,Newman, Melinda. \"The Beat: Poe Haunted by Father's Voice on Atlantic\" Billboard. October 14, 2000."]}, {"page": "The Corrs", "response": ["In 2003, Andrea Corr recorded \"Time Enough for Tears\", written by Bono and Gavin Friday for the film In America. This track was featured on The Corrs' 2004 album, Borrowed Heaven. Recorded over an 18-month period in Dublin and Los Angeles, Borrowed Heaven was produced by Olle Romo, who previously worked with Melanie C and Kelly Clarkson. The album marked The Corrs' return to the folk rock genre with a slightly heavier emphasis on guitars. Nevertheless, the album was not as successful as their predecessors, but at least successful enough to enter at No.2 in both the UK and Germany and reach silver status in the UK as well as gold in Germany.Borrowed Heaven UK Certification . The BPI. 4 June 2004. Retrieved 14 July 2007. Jason Duffy temporarily joined the band as drummer, filling in for Caroline while she was pregnant with her second child and unable to tour. Borrowed Heaven was dedicated to the band's parents."]}, {"page": "Come On Over", "response": ["* Olle Romo – programming, Pro Tools, sequencing and editing, \"that extra Swedish swing\"", "Mixed by Mike Shipley (all tracks on original version; tracks 1–3, 5–7, 9, 11–12, 14 and 16 on international version), Olle Romo (tracks 4, 8, 10, 13 and 15 on international version) and Mutt Lange (track 13 on revised international version (uncredited); edited by Mike Shipley (uncredited))"]}, {"page": "18 til I Die", "response": ["* Olle Romo – programming, percussion (1-6, 8, 10, 11, 12), acoustic piano (2), keyboards (3, 5, 6, 10, 12), pads (8, 13), castanets (13)", "* Olle Romo – engineer "]}, {"page": "Jim Corr", "response": ["Corr first took guitar lessons in his hometown of Dundalk, a large industrial town in County Louth. Corr plays acoustic and electric guitar as well as piano, keyboard, accordion and singing background vocals. He has also had an active role in the production aspects of all of The Corrs' albums to date, working with David Foster and Olle Romo on two separate albums."]}, {"page": "Borrowed Heaven", "response": ["Borrowed Heaven is the fourth studio album by Irish rock band The Corrs, released through Atlantic Records on 31 May 2004. The album was produced by Olle Romo.", "Category:Albums produced by Olle Romo"]}, {"page": "All the Way... A Decade of Song", "response": ["*Olle Romo  – programming"]}, {"page": "Be Yourself Tonight", "response": ["* Olle Romo – drums ; wood stomping "]}, {"page": "Savage (Eurythmics album)", "response": ["Following the much more mainstream commercial content of their previous two albums, Savage saw Eurythmics \"turn sharp left\" (as band member Dave Stewart put it), returning to the much more experimental sound that their early albums incorporated. Produced in France (recorded at Chateau de Dangu in Normandy and mixed at Grand Armée Studios in Paris), the album made heavy use of the NED Synclavier digital sampling keyboard. The only other musician working on the recordings with Stewart and Annie Lennox was drummer Olle Romo, who handled much of the Synclavier programming. Lennox brought more of a feminist focus to her lyrics which was made more evident by the accompanying video album, which featured a video for each song.", "* Olle Romo – programming"]}, {"page": "We Too Are One", "response": ["* Olle Romo – drums"]}, {"page": "The One (Elton John album)", "response": ["* Olle Romo – drums (1-10), percussion (1-10), drum programming (1–10)"]}, {"page": "Common People", "response": ["* Olle Romo – programming"]}, {"page": "Haunted (Poe album)", "response": ["* Producers: Poe, Olle Romo, Matt Wilder, Matt Wallace, Mike Urban", "* Mixing: Paul Leary, Olle Romo, David Thoener, Danger Jay", "* Programming: Poe, John O'Brien, Olle Romo, Danger Jay ", "Category:Albums produced by Olle Romo"]}, {"page": "On a Day Like Today (album)", "response": ["* Olle Romo – programming "]}, {"page": "Live 1983–1989", "response": ["* Olle Romo – drums"]}, {"page": "These Are Special Times", "response": ["*Olle Romo – programming"]}, {"page": "Tara Blaise", "response": ["John Hughes offered her an album deal on his own Spokes label, and sent her to Los Angeles to work with Corrs producer Olle Romo, resulting in her debut album Dancing on Tables Barefoot. The first Tara Blaise solo single was 'Fool for Love', featuring only Tara's voice and a string quartet.", "Great Escape currently features two singles 'Breathe', and 'Make You'. 'Make You' is produced by Robert John 'Mutt' Lange, a colleague of Olle Romo, and 'Breathe' was released in March with a UK CD release on 8 December 2008. In October 2008 Blaise's website was redesigned."]}, {"page": "Unplugged (Bryan Adams album)", "response": ["* Olle Romo – mix assistant "]}, {"page": "Would I Lie to You? (Eurythmics song)", "response": ["* Olle Romo – drums"]}, {"page": "There Must Be an Angel (Playing with My Heart)", "response": ["* Olle Romo – drums"]}, {"page": "It's Alright (Baby's Coming Back)", "response": ["* Olle Romo – drums"]}, {"page": "Summer Sunshine", "response": ["* Olle Romo – production, programming, mixing"]}, {"page": "Feargal Sharkey (album)", "response": ["*Olle Romo – drums"]}, {"page": "Angel (The Corrs song)", "response": ["* Olle Romo – production, recording"]}, {"page": "Loudmouth – The Best of Bob Geldof and the Boomtown Rats", "response": ["# \"Crazy\" (1994) (Doom, Geldof, Olle Romo) – 4:29 Previously unreleased"]}, {"page": "Three Hearts in the Happy Ending Machine", "response": ["* Olle Romo – additional percussion"]}, {"page": "Dave Stewart and the Spiritual Cowboys", "response": ["Dave Stewart and the Spiritual Cowboys was an English rock and pop band, formed in 1990 after frontman David A. Stewart's departure from Eurythmics. Chris Bostock from JoBoxers,Ogg, Alex. (2006). No More Heroes - A Complete History of British Punk, Great Britain: Cherry Red Books, p.711; Jonathan Perkins, Olle Romo and Nan Vernon were later joined by Martin Chambers from The Pretenders and John Turnbull from Ian Dury and The Blockheads.Stewart, Dave. (2016). Sweet Dreams Are Made of This: A Life In Music, Great Britain: NAL, p.188; They made two albums: the self-titled Dave Stewart and the Spiritual Cowboys and Honest.  Their live stage act is characterized by spiritual icons and a unique double drum kit played by two drummers."]}, {"page": "Candleland", "response": ["* Olle Romo – programming on \"Horse's Head\" and \"Start Again\""]}, {"page": "11 (Bryan Adams album)", "response": ["*Olle Romo – editing"]}, {"page": "Dancing on Tables Barefoot", "response": ["*Olle Romo – Drums, Programming, Producer, Engineer", "Category:Albums produced by Olle Romo"]}, {"page": "Olle Romö", "response": ["#REDIRECT Olle Romo"]}, {"page": "List of train songs", "response": ["*\"Runaway Train\", separate songs with this title, artists followed by composers: Jeff Berlin (Jeff Berlin); Blue Rodeo (Greg Keelor, Jim Cuddy); Rosanne Cash, Crooked Still, (John Stewart); Kasey Chambers (Kasey Chambers, Werchon); Joe Cocker (Ollie Marland); Vernon Dalhart (Robert E. Massey; Harry Warren, Carson Robison); Eliza Gilkyson (Eliza Gilkyson);, Guitar Shorty (Tommy McCoy); Ray Wylie Hubbard (Ray Wylie Hubbard); Elton John (Bernie Taupin, Elton John, Olle Romo); Henry Mancini (Henry Mancini); Steve Morse Band (Steve Morse); John Stewart (John Stewart); Stray Cats (Brian Setzer); Soul Asylum (Dave Pirner); Randy Travis (Jerry Steve Smith, Larry Gatlin); Dale Watson (Dale Watson); Geddy Lee (Geddy Lee)"]}, {"page": "Great Escape (Tara Blaise album)", "response": ["Category:Albums produced by Olle Romo"]}, {"page": "Anne Murray Duets: Friends & Legends", "response": ["* Olle Romo – vocal recording (Shania Twain on Track 10)"]}, {"page": "Ever Changing Times", "response": ["* Olle Romo – synthesizers (8)"]}, {"page": "Revolution Ballroom", "response": ["*Olle Romo – keyboards, drum programming"]}, {"page": "Dark Horse (Nickelback album)", "response": ["*Olle Romo – editing, additional engineering"]}, {"page": "Vegas (Vegas album)", "response": ["Vegas is the self-titled album by the one-off collaborative group featuring British artist Terry Hall - best known as vocalist for 2 Tone and ska revival band The Specials and subsequent offshoot band Fun Boy Three - and Eurythmics member Dave Stewart. The duo worked with the assistance of drummer and programmer Olle Romo and engineer Emmanuel 'Manu' Guiot (with Dave Stewart also using this surname professionally with the pseudonym Jean Guiot), both former collaborators with Stewart on Eurythmics projects. Vegas includes the singles \"Possessed\", \"She\" and \"Walk into the Wind\". Of the three only \"Possessed\" charted in the UK Top 40, whilst \"Walk into the Wind\" featured Shakespears Sister's Siobhan Fahey (then Stewart's wife). Receiving positive reviews the album was released on CD, Cassette and vinyl LP by the major record label RCA/BMG in October 1992, but failed to chart. The album has since been deleted.", "*Olle Romo", "*Olle Romo – programming, production"]}, {"page": "Olov", "response": ["*Olle Romo, musician"]}]}}