{"wiki_id": "http://www.wikidata.org/entity/Q7087604", "itemLabel": "Oliver Holmes", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Holmes_(rugby_league)", "wikipedia_page": {"main": "Oliver Holmes (born 7 August 1992) is an English professional rugby league footballer who has plays as a second-row forward for the Castleford Tigers (Heritage № 907) in the Super League. \nHe has played at representative level for England and the England Knights. He has played his entire professional club career with Castleford, his hometown club.\n\n", "link_mentions": [{"page": "Oliver Holmes (rugby)", "response": ["#redirect Oliver Holmes (rugby league)"]}, {"page": "Warrington Wolves", "response": ["| Oliver Holmes || Castleford Tigers || 3 Years || June 2020"]}, {"page": "Holmes (surname)", "response": ["* Oliver Holmes (rugby league) (born 1992), Canadian rugby player"]}, {"page": "Castleford Tigers", "response": ["Under Daryl Powell and Danny Orr, the club has again started to see success on and off the field. The 2014 side were again lauded as Classy Cas for their fast-paced and exciting style, with home grown players such as club captain Michael Shenton, Daryl Clark, Adam Milner, Oliver Holmes, Craig Huby and Andy Lynch, who was returning to the club. The side reached the Challenge Cup final in August 2014, losing to local rivals Leeds 23–10, watched by a crowd of 77,914 at Wembley Stadium. The side would eventually finish 4th in Super League and qualify for the play-offs. They were beaten 41 – 0 by St. Helens in their first game and therefore granted a second chance at progressing with a home tie against Warrington. They were beaten 14 – 30 and therefore knocked out of the play-offs. On 29 September 2015, the club announced the death of chairman Jack Fulton. In 2017, the Tigers enjoyed a phenomenal 23 game regular season as they finished 10 points clear at the top of the table prior to the split having won 20 and losing just 3 of their games. They went into the Super 8's having already secured a top four playoff spot by the end of the Super 8's and winning the League Leaders' Shield in the process. In the semifinal against St Helens, Luke Gale—just days after undergoing an emergency appendectomy—kicked a drop-goal in extra time to send Cas to their first Grand Final with a 23–22 win. Sadly they didn't carry on the form they had shown all season and were deservedly beaten by Leeds Rhinos 24–6 with a late consolation score coming in the last minute to spare Castleford being the first team to fail to score in a Grand Final. Gale was voted Steve Prescott Man of Steel, while Powell picked up the Coach of the Year award for the second time having previously won in 2014.", "| Oliver Holmes"]}, {"page": "2012 Leeds Rhinos season", "response": ["| Castleford Squad || 1 Richard Owen, 2 Nick Youngquest, 23 Ryan McGoldrick, 4 Kirk Dixon, 5 Josh Griffin, 6 Rangi Chase, 7 Danny Orr, 8 Jacob Emmitt, 15 Adam Milner, 20 Grant Millington, 11 Brett Ferres, 14 Stuart Jones, 21 Oliver Holmes Subs 9 Daryl Clark, 13 Steve Snitch, 17 Lee Mitchell, 22 Nathan Massey"]}, {"page": "2012 Castleford Tigers season", "response": ["Castleford confirmed the release of former Great Britain International Prop Nick Fozzard & former England International Winger Martin Aspinwall who later went on to join Super League side Hull F.C. on a 1-year deal. A few weeks after, Dewsbury Rams announced the signing of Fozzard. Tigers Academy Second Row Billy Harris also joined Dewsbury on a season long loan to gain some first team experience, in addition to his Academy teammate Academy James Clare who joined the Rams on a dual-contract loan for the 2012 season. Ryan Brierley would also go out on a dual-contract loan with Leigh Centurions. Millward confirmed his Assistant Coach as ex-Castleford fullback Stuart Donlan on a 3-year deal with the club. The Tigers confirmed the signing of Canterbury Bulldogs Second Row / Prop Grant Millington, and also the season long loan signing of Warrington Wolves Second Row Lee Mitchell for the 2012 season with the option of making the deal permanent for 2013 season. Tigers Second Row Oliver Holmes signed a new 3-year deal, following in the footsteps of fellow Tigers Academy graduates Owen, Milner, Clark, Huby and Thompson in signing new long term deals with the club.", "Castleford beat local rivals Huddersfield Giants in their 2nd pre-season friendly, with tries from Ryan Hudson, Danny Orr, Oliver Holmes, Lee Mitchell, Rangi Chase and Daryl Clark plus 3 goals from Kirk Dixon and 1 from Ryan Shaw securing Ian Millward's team a well deserved 32–22 win. The Tigers lost to arch-rivals Wakefield Trinity Wildcats 40–20 at Belle Vue Stadium; Brett Ferres, Stuart Jones, Lee Mitchell and Stephen Nash all scored for the Tigers whilst Kirk Dixon kicked 2 goals. Castleford announced that Danny Orr will be captain for 2012.", "Castleford beat local rivals Wakefield Trinity Wildcats 34–16 with Richard Owen scoring 2 tries and Grant Millington, Steve Snitch, Brett Ferres and Oliver Holmes scoring. Kirk Dixon also kicked 5 goals. However, on the Monday Castleford narrowly lost out to St. Helens 18–12. Ferres grabbed 2 tries and Dixon kicked both conversions. The Tigers suffered an early cup exit to local rivals Featherstone Rovers, the Championship side showed grit and determination to beat the Tigers 23–16 with Daryl Clark, Josh Griffin and Nick Youngquest scoring for Castleford and Dixon added a conversion, returning Danny Orr also kicked a goal. Castleford suffered another heavy defeat, this time at the hands of Warrington Wolves who won 54–6, Lee Mitchell scored for the Tigers and Orr converted.", "Centre James Grehan was sent out on a months loan to championship side Batley Bulldogs. Castleford gained another 2 points in a hard-fought contest with Widnes Vikings with the Tigers coming out 36–12 winners, Brett Ferres and Jordan Thompson grabbed a try whilst Daryl Clark scored 2 and Nick Youngquest scored a hat-trick. Danny Orr kicked 2 goals, Craig Huby kicked a goal and Josh Griffin also kicked a conversion. Castleford were humiliated at Craven Park by losing 70–12 against Hull Kingston Rovers with Grffin and Thompson scoring and Dixon kicking both goals. Castleford announce a 1-month loan deal for winger Rhys Williams from Warrington Wolves. The Tigers lose at the Magic Weekend to local rivals Wakefield Trinity Wildcats 32–26. Thompson, Stuart Jones, Oliver Holmes, Youngquest and Orr all scored tries for Castleford and Dixon kicked 2 goals whilst Orr converted his own try. Centre Joe Arundel signs a 4-year deal with Hull FC.", "Castleford announce that Huddersfield Giants forward Lee Gilmour has signed for the Tigers for 2 years starting in 2013. The Tigers were heavily beaten 40–10 against Widnes Vikings with Nick Youngquest and Stuart Jones crossing for tries and Craig Huby kicked a goal. Castleford announce that Ryan McGoldrick will be leaving the club immediately after handing in a transfer request, he will move to Hull F.C. on a 1 and a half-year deal whilst young scrum half Jamie Ellis has been signed for the Tigers after being released from Hull FC. Castleford destroyed local rivals Huddersfield Giants 52–6 in what is their biggest winning margin in the Super League. Richard Owen scored 2 tries whilst James Clare, Jordan Thompson, Nick Youngquest, Josh Griffin, Adam Milner and Jamie Ellis (on debut) each scored a try each with Ellis kicking 10 goals. Castleford lost 40–26 to Warrington Wolves in Round 21 with Youngquest scoring 2 tries, Rhys Williams, Owen and Lee Mitchell all scored as well. Ellis kicked a goal and the retiring Danny Orr kicked 2 goals. Brett Ferres left the club with immediate effect and joined Huddersfield Giants. The Tigers were beaten 40–16 by leaders Wigan Warriors with Williams, Stuart Jones and Oliver Holmes all scoring, Youngquest kicked 2 goals.", "September started off awful with the Tigers losing their last home game 46–26 to Catalans Dragons. Ryan Hudson, Stuart Jones, Nick Youngquest, Grant Millington and Richard Owen all scored for Castleford whilst Danny Orr kicked 3 goals. Castleford would once again miss out on the playoffs after a poor 2012 season. Castleford wrapped up the season with a 36–10 loss to Hull FC, Jordan Thompson and Oliver Holmes scored whilst Danny Orr kicked his last ever Super League goal.", "|21|| Oliver Holmes ||SR ||x ||SR", "|21|| Oliver Holmes ||B ||SR ||SR ||SR ||SR ||SR ||x ||SR ||SR ||SR ||SR ||SR ||x ||B ||SR ||SR ||B ||SR ||SR ||x ||x ||SO ||x ||B ||B ||B ||SR", "|21|| Oliver Holmes ||SR", "|Oliver Holmes"]}, {"page": "2014 Challenge Cup", "response": ["Castleford Tigers: Luke Dorn; Kirk Dixon, Jake Webster, Michael Shenton, Justin Carney; Marc Sneyd, Liam Finn; Andy Lynch, Daryl Clark, Craig Huby, Oliver Holmes, Weller Hauraki, Nathan Massey."]}, {"page": "2015 Challenge Cup", "response": ["The draw for the second round was made on Monday 2 February at the Oulton Raiders club.  The draw was made by two players who played in the 2014 final. Home teams were drawn by players Ryan Hall of Leeds Rhinos and away teams by Oliver Holmes of Castleford Tigers."]}, {"page": "2015 Castleford Tigers season", "response": ["|11|| Oliver Holmes ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||12px ||SR ||SR ||SR ||SR ||12px ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||SR ||12px ||SR ||SR ||12px", "|11|| Oliver Holmes ||SR ", "|Oliver Holmes"]}, {"page": "2016 Castleford Tigers season", "response": ["|11|| Oliver Holmes ||SR ||SR ||SR ||12px ||12px ||12px ||12px ||12px ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x ||x", "|11|| Oliver Holmes ||x ||x ||x ||x ", "|Oliver Holmes"]}, {"page": "Oliver Holmes", "response": ["Oliver Holmes may refer to:", "* Oliver Holmes (rugby league)"]}, {"page": "2017 Super League Grand Final", "response": ["||  Oliver Holmes"]}, {"page": "Super League XXIII", "response": ["|  Oliver Holmes"]}, {"page": "International rugby league in 2018", "response": ["|SR ||11||Oliver Holmes", "* Oliver Holmes, Tom Johnstone, Reece Lyne, Adam Milner, Jamie Shaul, Liam Sutcliffe, Luke Thompson (all England), Lambert Belmas, Paul Marcon, and Anthony Marion (all France) made their Test debuts, while Robbie Mulhern made his debut for England having previously represented Ireland."]}, {"page": "Super League XXV", "response": ["|align=\"left\"|  Oliver Holmes"]}, {"page": "2014 Challenge Cup Final", "response": ["|align=\"center\"| Oliver Holmes"]}, {"page": "2020 Castleford Tigers season", "response": ["|align=\"left\"|  Oliver Holmes"]}, {"page": "2021 Castleford Tigers season", "response": ["|align=\"left\"| Oliver Holmes", "|align=\"left\"| Oliver Holmes"]}, {"page": "2022 Castleford Tigers season", "response": ["| Oliver Holmes"]}]}}