{"wiki_id": "http://www.wikidata.org/entity/Q7087838", "itemLabel": "Oliver Smith", "itemDescription": "English cricketer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Smith_(cricketer)", "wikipedia_page": {"main": "Oliver Charles Kennedy Smith (born 29 October 1967) is a former English cricketer. Smith was a left-handed batsman who bowled right-arm off break. He was born in Meriden, Warwickshire.\nSmith made 3 Youth Test appearances for England Young Cricketers against Sri Lanka Young Cricketers in 1987, with some success, scoring a single century and half century. Later in 1987, he made his only first-class appearance for Gloucestershire against a Rest of the World XI. In this match, he was dismissed by Maninder Singh for a single in Gloucestershire's first-innings, while in their second-innings he was dismissed by John Bracewell for 14 runs. He made no further appearances for Gloucestershire, following spells in the Second XI, he formally left the county at the end of the 1990 season.\nOliver is the son of novelist and playwright A. C. H. Smith.", "link_mentions": [{"page": "Oliver Smith", "response": ["Oliver Smith may refer to:", "*Oliver Smith (actor) (born 1952), English actor, known for the Hellraiser film series", "*Oliver Smith (designer) (1918–1994), American scenic designer, one of the founders of American Ballet Theatre", "*Oliver Smith (politician) (born 1993), British Liberal Democrat politician", "*Oliver Smith (cricketer) (born 1967), English cricketer", "*Oliver Smith (born 1766), bequest established Smith Vocational and Agricultural High School", "*Oliver Smith (football coach) (born 1960), Turks and Caicos Islands football manager"]}, {"page": "A. C. H. Smith", "response": ["In 1971, Peter Brook invited him to Iran for three months to write a book about the Orghast project that Brook and Ted Hughes were undertaking. He was a director of the Cheltenham Literature Festival in 1978, 1979, and 1999. He has two daughters, Imogen and Sophie, and a son, Oliver Smith."]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Oliver Smith (1987) : O. C. K. Smith"]}]}}