{"wiki_id": "http://www.wikidata.org/entity/Q7088404", "itemLabel": "Olly Moss", "itemDescription": "English graphic artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Olly_Moss", "wikipedia_page": {"main": "Oliver Jonathan Moss (born 24 January 1987) is an English graphic artist, best known for his reimagining of movie posters. His work has been released by Mondo and is regularly featured in Empire magazine.\n\n", "link_mentions": [{"page": "Becky Cloonan", "response": ["*Batman: Black and White vol. 2 #6: \"Bruce\" (a, with Olly Moss, anthology, 2014) collected in Batman: Black and White Volume 4 (hc, 288 pages, 2014, ; tpb, 2015, )"]}, {"page": "Batman Black and White", "response": ["* \"Bruce\" - written by Olly Moss and Becky Cloonan"]}, {"page": "Olly", "response": ["* Olly Moss (born 1987), English graphic artist"]}, {"page": "Resistance 3", "response": ["In 2009, a promotional billboard for Resistance 3 was spotted on a location set for Battle: Los Angeles, a film by Columbia Pictures (a subsidiary of Sony) released in early 2011.(as the film is set in nearly one month prior to the game's release),  Though neither Sony nor Insomniac Games commented on the appearance, Insomniac announced on May 25, 2010, that, in addition to creating a new multiplatform franchise, they would be developing multiple games exclusively for the PlayStation 3. The game was officially announced at Sony's Gamescom 2010 press conference in Cologne, Germany on August 17, 2010, alongside a live-action trailer for the game. On September 28, 2010, leaked concept art and screenshots were released onto a Flickr account which depict a number of different Chimera and two unidentified human characters (later confirmed in Game Informer's November 2010 cover story as Joseph Capelli and Susan Farley). When asked about the authenticity of the images, Insomniac replied with \"no comment\". The first gameplay was revealed at the Spike Video Game Awards, showing new weapons and enemies. Insomniac worked with Olly Moss to create the logo and box art."]}, {"page": "Page One (Steven Page album)", "response": ["*Concept/Illustrations: Olly Moss"]}, {"page": "Jake Rodkin", "response": ["Rodkin co-founded the video game developer Campo Santo with Sean Vanaman, Nels Anderson and Olly Moss, and joined Valve when Campo Santo was acquired by the company in 2018. Outside the video game industry, Rodkin also co-founded the Idle Thumbs podcast network and its flagship podcast, which he co-hosted alongside Chris Remo, Nick Breckon and Sean Vanaman.", "Jake Rodkin began his career writing for the gaming websites The International House of Mojo and Adventure Gamers, and co-founded Idle Thumbs. He joined Telltale Games as a graphic designer. He eventually became a game designer, director, writer, and project leader at Telltale.  In September 2013, he and Sean Vanaman left Telltale and joined with Olly Moss and Mark of the Ninja lead designer Nels Anderson to found their own studio, Campo Santo. In April 2018, Rodkin joined Valve when the company acquired Campo Santo. Rodkin is also part of Skunkape Games, a studio currently developing remasters of Telltale's Sam & Max games."]}, {"page": "Sean Vanaman", "response": ["On September 18, 2013, he and Jake Rodkin left Telltale and joined with Olly Moss and Mark of the Ninja lead designer Nels Anderson to found Campo Santo."]}, {"page": "List of people from Hampshire", "response": ["*Olly Moss, graphic designer, was born in Winchester"]}, {"page": "Firewatch", "response": ["The story follows a fire lookout named Henry in the Shoshone National Forest, a year after the Yellowstone fires of 1988. A month after his first day at work, strange things begin happening to him and his supervisor Delilah, which connects to a conspired mystery that happened years ago. Henry interacts with Delilah using a walkie-talkie, with the player choosing from dialog options to communicate. His exchanges with Delilah inform the process by which their relationship is developed. The game was directed by Olly Moss and Sean Vanaman, written by Chris Remo, Jake Rodkin, Moss and Vanaman, and produced by Gabe McGill and artist Jane Ng. The game's environment was modelled by Ng, based on a single painting by Moss. The design draws inspiration from New Deal advertisements by the National Park Service and field research conducted in Yosemite National Park.", "Firewatch is the first video game from Campo Santo and was created by Jake Rodkin and Sean Vanaman, who were the creative leads on The Walking Dead; Nels Anderson, the lead designer of Mark of the Ninja; and artist Olly Moss. Chris Remo was involved in many aspects of the design and also composed the score. Development for Firewatch began with a single painting by Moss. Jane Ng, lead environmental artist at Campo Santo, was tasked with translating Moss' work into 3D environments while maintaining his stylized artistic vision. Moss, who had previously been known primarily for his graphic design work, had joined Vanaman and Rodkin to found Campo Santo after spending many years working on the periphery of game development. In creating the painting, Moss emulated National Park Service posters from the New Deal era in both color palette and iconography. The development team went on a camping trip to Yosemite National Park for inspiration for the game, where they visited a lookout tower built with the same design as its video game counterpart. Further inspiration for the game came from Vanaman and Anderson's experiences growing up in rural Wyoming."]}, {"page": "Campo Santo (company)", "response": ["Campo Santo Productions LLC is an American video game developer based in Bellevue, Washington. Founded in September 2013 by Sean Vanaman, Jake Rodkin, Nels Anderson, and Olly Moss, the studio is best known for its debut game released in 2016, Firewatch. In April 2018, the company was acquired by Valve.", "Sean Vanaman and Jake Rodkin were both at Telltale Games as co-writers on the 2012 game The Walking Dead, which was considered Telltale's first turn into a more narrative type of episodic adventure game. The game was a critical success, and while other projects came along, Vanaman started to become too comfortable with his role at Telltale, and felt that he would be more motivated if there was more discomfort or risk in his duties. After talking about the idea with Rodkin, the two left the company and co-founded Campo Santo on September 18, 2013, joined by Mark of the Ninja designer Nels Anderson and graphic artist Olly Moss. Environment artist Jane Ng and designer and composer Chris Remo, who had also worked with Vanaman and Rodkin on the Idle Thumbs podcast, soon joined the team as well."]}, {"page": "MondoCon", "response": ["MondoCon 2016 was held October 22–23 at the AFS Cinema and Holiday Inn Midtown Conference Center. It featured Florian Bertmer, Scott C., Aaron Draplin, Aaron Horkey, Jock, Olly Moss, Alex Pardee, Arik Roper, Jay Ryan, Todd Slater and William Stout. Fans started lining up 48 hours early. It included a 10th anniversary screening of The Fountain with introduction and Q&A by composer Clint Mansell and a sale of the soundtrack on vinyl for the first time. During a panel with Mondo's creative team it was revealed the company was working on a Nickelodeon-themed gallery show that would include Ren and Stimpy and The Legend of Korra."]}, {"page": "Design Museum of Chicago", "response": ["Contributors to the Design Pack include Laura Park, Shawna X, Chad Kouri, Susan Kare, Yann Legendre, Paula Scher, Jay Ryan, Mike McQuade, Paul Octavious, Erik Spiekermann, Max Temkin, Debbie Millman, Art Paul, Simon Whybray, Mike Mitchell, Scott Thomas, Matthew Terdich, Jez Burrows, Jason Polan, Jessica Hische, Cody Hudson, Nick Adam, Matthew Hoffman, Magdalena Wistuba + Anna Mort, Eric Hu, Olly Moss, Tanner Woodford, Milton Glaser, and Sonnenzimmer."]}, {"page": "Mondo (American company)", "response": ["Artists who have created posters with Mondo include Becky Cloonan, Laurent Durieux, Olly Moss, Gary Pullin, Matthew Woodson, Jay Shaw, Matt Taylor, Kevin Tong, Tom Whalen, Sam Wolfe Connelly, and Jock."]}]}}