{"wiki_id": "http://www.wikidata.org/entity/Q7087221", "itemLabel": "Olive Willis", "itemDescription": "Founder of Downe House School", "wikipedia_url": "https://en.wikipedia.org/wiki/Olive_Willis", "wikipedia_page": {"main": "Olive Margaret Willis (26 October 1877 – 11 March 1964) was an English educationist and headmistress. She founded Downe House School and was its head for nearly forty years, from 1907 to 1946.", "link_mentions": [{"page": "Down House", "response": ["A girls' boarding school was established at the house in February 1907, co-founded by the headmistress Olive Willis (1877–1964) with her friend Alice Carver. The school began with five mistresses and one girl, but was soon successful and grew to around 60 pupils.Atkins 1976, pp. 106–10. Various corrugated iron outbuildings were erected around the house at this time, to serve as the school's chapel, gymnasium, music-rooms and lavatories: these were later removed.Bowen 1950, pp. 185, 194. The school occupied the house until 1 April 1922, when it moved to larger premises at Hermitage Rd, Cold Ash, Newbury, where it remains. The present school is still named Downe House School, and one of its houses is still named Darwin. The novelist Elizabeth Bowen, who was a pupil at the school during the First World War, wrote after revisiting Down House in the 1930s: \"I have never liked scientific people very much, and it mortifies me to think of them trampling reverently around there on visiting days, thinking of Charles Darwin and ignorant of my own youth.\"Bowen 1950, p. 194."]}, {"page": "Anne Ridler", "response": ["Anne Bradby was educated at Downe House School and later published a biography of her headmistress, Olive Willis. After six months in Florence and Rome, she took a diploma in journalism at King's College London."]}, {"page": "Elizabeth Bowen", "response": ["thumb|right|220px|Elizabeth Bowen was born and spent her first seven winters in this houseElizabeth Dorothea Cole Bowen was born on 7 June 1899 at 15 Herbert Place in Dublin and baptised in the nearby St Stephen's Church on Upper Mount Street. Her parents, Henry Charles Cole Bowen and Florence (née Colley) Bowen, later brought her to Bowen's Court at Farahy, near Kildorrery, County Cork, where she spent her summers. When her father became mentally ill in 1907, she and her mother moved to England, eventually settling in Hythe. After her mother died in September 1912 Bowen was brought up by her aunts. She was educated at Downe House School under the headship of Olive Willis. After some time at art school in London she decided that her talent lay in writing. She mixed with the Bloomsbury Group, becoming good friends with Rose Macaulay who helped her seek out a publisher for her first book, a collection of short stories entitled Encounters (1923)."]}, {"page": "Downe", "response": ["*Olive Willis (1877–1964), founder of Downe House School"]}, {"page": "Cold Ash", "response": ["Downe House School, a girls' boarding school, was founded by Olive Willis and Alice Carver in 1907 at Charles Darwin's former home, Down House, in Kent. The school outgrew its premises and moved to Cold Ash in 1922, taking over The Cloisters which was built by a religious order called the Order of Silence in 1913. St Peter's, a red brick house built in about 1700, is now part of the school. Former pupils of Downe House include the broadcaster Clare Balding and the actress and comedian, Miranda Hart. Catherine, Duchess of Cambridge and her sister, Pippa Middleton, also attended the school for a time."]}, {"page": "Downe House School", "response": ["Downe House was founded in 1907 by Olive Willis, its first headmistress, as an all-girls' boarding school. Its first home was Down House in the village of Downe, Kent (now part of the London Borough of Bromley), which had been the home of Charles Darwin.Atkins 1976, pp. 106–110."]}, {"page": "Roedean School", "response": ["*Olive Willis, founder of Downe House School"]}, {"page": "List of founders of English schools and colleges", "response": ["|Olive Willis"]}, {"page": "Aileen Fox", "response": ["The daughter of a solicitor, Aileen Henderson was educated at Chinthurst School in Surrey and then at Downe House School in Kent, where she remained after it moved to Berkshire, under the headship of Olive Willis. She went on to read English at Newnham College, Cambridge. After graduating in 1929, she worked as a volunteer excavating at Richborough, Kent, under J. P. Bushe-Fox. She spent the following winter at the British School at Rome, before returning to Richborough. In 1932 she excavated at Hembury hillfort, Devon and Meon Hill, Hampshire."]}, {"page": "List of University of Oxford people in education", "response": ["*Olive Willis (Somerville) founder of Downe House School "]}, {"page": "List of University of Oxford people in British public life", "response": ["| Olive Willis"]}, {"page": "Evelyn Barbirolli", "response": ["Evelyn Rothwell was born 24 January 1911 in Wallingford-on-Thames,\"Rothwell, Evelyn (b. 1911).\" Dictionary of Women Worldwide: 25,000 Women Through the Ages, edited by Anne Commire and Deborah Klezmer, vol. 2, Yorkin Publications, 2007, p. 1630. Gale eBooks. Accessed 19 Aug. 2021. Berkshire, the daughter of a tea dealer in the City of London. Her mother was related to Charles Reade, a novelist of the Victorian era. She did not take up the oboe until she was 17, when she started to learn at her school, Downe House, near Newbury, under the headship of Olive Willis. Her father was not supportive of her studying music, but her mother encouraged her to enter the Royal College of Music. She studied the oboe there with Léon Goossens. She also learned the piano as a second instrument, and played the cello and the timpani. Benjamin Britten, nearly three years younger, was also a student there and he got her to play through some of his compositions for oboe."]}, {"page": "Alethea Hayter", "response": ["Hayter spent her early years in Cairo, Egypt, in the years before the First World War, where the three Hayter children were well taught by a governess. The children’s lives changed dramatically when their father died, still in his fifties, and they returned to England in reduced circumstances. Alethea Hayter was only twelve years old. Her sister Priscilla later described their happy childhood in Cairo in her memoir A Late Beginner (1966). The three all won scholarships for their higher education. Hayter was educated at Downe House School, in Berkshire, then under the headship of its founder Olive Willis, and at Lady Margaret Hall, Oxford, where she arrived in 1929 and went on to graduate BA in modern history. Of her time at Oxford, Hayter later wrote \"We were conventional and innocent, though we considered ourselves pioneering and revolutionary – not in politics, we were not much interested in them, but in our preferences in literature, the arts, social values... In our Oxford days, none of us could have boiled a potato, let alone made a soufflé, or would have known an azalea from a stinging nettle.\""]}, {"page": "Priscilla Napier", "response": ["Napier was educated at Downe House School, in Berkshire, which was then under the headship of its founder Olive Willis, and at Lady Margaret Hall, Oxford, where she graduated (like her sister Alethea three years later) BA in modern history."]}, {"page": "Church of All Saints, Aisholt", "response": ["* A plaque in the church commemorates the educationalist Olive Willis.", "* Poet and librettist Anne Ridler who was a pupil of Olive Willis at Downe House."]}, {"page": "Swallow Street", "response": ["The lease was bought in 1884 by Charles Voysey, a Church of England cleric who had been deprived of his living for the unorthodoxy of his popular printed sermons. In 1885 he created a Theistic Church, which he maintained until his death in 1912, after which it split into two sects, one retaining the original name, the other the \"Free Religious Movement\". The building's lease was ended in 1915 and the church building demolished in the same year. Olive Willis attended and George May, 1st Baron May was married there."]}, {"page": "Anne Cobbe", "response": ["She attended Downe House School near Newbury, Berkshire. She started reading mathematics in the Sixth form but sat the history scholarship examinations at the University of Oxford in 1938. The result being that she was told that history was not the right subject for her to study. The following year, 1939, she sat the mathematics entrance exam and was awarded an exhibition for a place at Somerville College, Oxford. (Her head teacher Olive Willis had also studied at Somerville College.)"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Olive Willis (1877–1964), educationist and headmistress; founded Downe House School and was its head"]}, {"page": "Order of Silence", "response": ["In 1921, due to Curtis’s deteriorating health and the Order’s precarious financial situation, the site at Cold Ash was sold to Olive Willis to become the new premises for Downe House School. The pupils moved to the new site at Easter in 1922, and the school remains there to this day."]}]}}