{"wiki_id": "http://www.wikidata.org/entity/Q7087948", "itemLabel": "Oliver Wrong", "itemDescription": "British medical academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Wrong", "wikipedia_page": {"main": "Professor Oliver Murray Wrong (7 February 1925 – 24 February 2012) was an eminent academic nephrologist (kidney specialist) and one of the founders of the speciality in the United Kingdom. From a background as a \"salt and water\" physician, he made detailed clinical observations and scientifically imaginative connections which were the basis of numerous advances in the molecular biology of the human kidney. Wrong himself contributed to much of the molecular work after his own \"retirement\". He dictated amendments to his final paper during his final illness in his own teaching hospital, University College Hospital (UCH), London. Though academic in his leanings, he was a compassionate physician who established a warm rapport with patients, a link he regarded as the keystone of his research. He belonged to a generation of idealistic young doctors responsible for the establishment of the UK's National Health Service in the post-War years.", "link_mentions": [{"page": "February 24", "response": ["*  2012   – Oliver Wrong, English nephrologist and academic (b. 1925)"]}, {"page": "George MacKinnon Wrong", "response": ["The historian Rosalind Mitchison and the physician Oliver Wrong were both grandchildren by Edward Murray Wrong. The sociologist Dennis Wrong was his grandson by Humphrey Hume Wrong."]}, {"page": "Wrong (disambiguation)", "response": ["* Oliver Wrong (1925—2012), British doctor and kidney researcher"]}, {"page": "Dent's disease", "response": ["Dent's disease was first described by Charles Enrique Dent and M. Friedman in 1964, when they reported two unrelated British boys with rickets associated with renal tubular damage characterized by hypercalciuria, hyperphosphaturia, proteinuria, and aminoaciduria. This set of symptoms was not given a name until 30 years later, when the nephrologist Oliver Wrong more fully described the disease."]}, {"page": "Rosalind Mitchison", "response": ["Rosalind Mary Wrong was born in Manchester. Her father, Edward Murray Wrong, and his father, George MacKinnon Wrong, were both historians. Her brother was Oliver Wrong.  "]}, {"page": "Michela Wrong", "response": ["Wrong is the granddaughter of Oxford historian Edward Murray Wrong and daughter of the nephrologist Oliver Wrong."]}, {"page": "Charles Enrique Dent", "response": ["He began research into a hereditary disease of the kidneys which was greatly expanded by his pupil Oliver Wrong and named Dent's disease.Obituary of Oliver Wrong, The Daily Telegraph, 12 April 2012"]}, {"page": "2012 in the United Kingdom", "response": ["* 24 February – Oliver Wrong, 87, medical academic."]}, {"page": "2012 in science", "response": ["* 24 February – Oliver Wrong, British nephrologist (b. 1925)."]}, {"page": "Deaths in February 2012", "response": ["*Oliver Wrong, 87, British medical academic."]}, {"page": "Edward Murray Wrong", "response": ["In 1915 Wrong married Rosalind Grace Smith, sixth daughter of A. L. Smith, his old tutor and Master of Balliol College, Oxford. They had two sons and four daughters. Among his children were the historian Rosalind Mitchison and medical scientist Oliver Wrong. His daughter Elizabeth Catherine Wrong married the Labour politician Peter Shore. "]}, {"page": "Oliver Murray Wrong", "response": ["#REDIRECT Oliver Wrong"]}, {"page": "Robert Frederick Mahler", "response": ["From 1951 to 1956 he was supported by a fellowship; he worked first at the MRC's Pneumoconiosis Research Unit in Wales, then at the Radiation Sickness Research Unit in London, and finally at the University of Manchester's Department of Medicine under the nephrologists Sydney William \"Bill\" Stanbury and Oliver Wrong. Mahler was appointed in 1956 lecturer in therapeutics at the University of St Andrews Medical School. He spent the two years 1957 and 1958 on an fellowship at Harvard Medical School. There he taught and did research on the effects of insulin on hepatic glucose metabolism and on elucidating the enzymatic defect in McArdle's disease."]}, {"page": "Wrong, Oliver", "response": ["#redirectOliver Wrong"]}]}}