{"wiki_id": "http://www.wikidata.org/entity/Q7087834", "itemLabel": "Oliver Smedley", "itemDescription": "British businessman and politician (1911-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Smedley", "wikipedia_page": {"main": "Major William Oliver Smedley  (19 February 1911 – 16 November 1989) was an English businessman involved in classical liberal politics and pirate radio.\n\n", "link_mentions": [{"page": "Screaming Lord Sutch", "response": ["In 1963 Sutch and his manager, Reginald Calvert, took over Shivering Sands Army Fort, a Maunsell Fort off Southend, and in 1964 started Radio Sutch, intending to compete with other pirate radio stations such as Radio Caroline. Broadcasts consisted of music and Mandy Rice-Davies reading Lady Chatterley's Lover. Sutch tired of the station, and sold it to Calvert, after which it was renamed Radio City, and lasted until 1967. In 1966 Calvert was shot dead by Oliver Smedley over a financial dispute. Smedley was acquitted on grounds of self-defence. About this time Ritchie Blackmore left the band. Roger Warwick left to set up an R&B big band for Freddie Mack."]}, {"page": "Institute of Economic Affairs", "response": ["In June 1955, The Free Convertibility of Sterling by George Winder was published, with Fisher signing the foreword as Director of the IEA. In November 1955, the IEA's Original Trust Deed was signed by Fisher, John Harding and Oliver Smedley. Ralph Harris (later Lord Harris) began work as part-time General Director in January 1957. He was joined in 1958 by Arthur Seldon who was initially appointed Editorial Advisor and became the Editorial Director in 1959. Smedley wrote to Fisher that it was \"imperative that we should give no indication in our literature that we are working to educate the public along certain lines which might be interpreted as having a political bias. … That is why the first draft [of the IEA's aims] is written in rather cagey terms\"."]}, {"page": "Marine, &c., Broadcasting (Offences) Act 1967", "response": ["In 1966, a dispute among offshore radio operators brought the issue of unlicensed radio stations to the fore.  Reginald Calvert, operator of Radio City, had refused to pay Radio Caroline's operator Oliver Smedley for a substandard transmitter. Smedley hired some riggers to occupy the Radio City facility (on Shivering Sands, a disused offshore defence fort), and in an altercation at Smedley's house, Smedley killed Calvert.  This incident strengthened the position of the Labour government of Harold Wilson, who wanted to bring the pirate stations under control, enough to see the passage of the Marine Broadcasting Offences Act on 15 August 1967."]}, {"page": "Pirate radio in Europe", "response": ["::The Radio City Death: Reginald Calvert, the manager of Screaming Lord Sutch and the owner of Radio City, was shot dead at the home of Major Oliver Smedley in 1966 following falling out over a joint venture financing arrangement between Radio City and Radio Caroline. Calvert's former business associates had boarded his station, removed the transmitter crystals and put the station off the air."]}, {"page": "Radio Atlanta", "response": ["*Oliver Smedley - British Army Major, Liberal Party member and promoter of Radio Atlanta", "*Richard Cockett, Thinking the Unthinkable: Think-Tanks and the Economic Counter-Revolution, 1931-1983. Fontana, 1995. - Background of Major Oliver Smedley"]}, {"page": "Reginald Calvert", "response": ["Calvert was shot and killed by Oliver Smedley, the former owner of a rival offshore station, Radio Atlanta, who was later acquitted of murder on the grounds of self-defence.", "Calvert established the pirate station Radio City, which broadcast from a Second World War marine fort off the Kent coast, seven miles from Margate. Radio Atlanta, the second pirate radio station, ran out of money and merged with Radio Caroline, which had also run out of money. It was decided that Calvert would be asked to amalgamate with them and they would pay the bills, giving Calvert 50% of the profit. After a couple of months, Radio Atlanta was again in financial difficulty and not paying bills or wages, so Calvert resumed control. Later in 1965, Major Oliver Smedley and Allan Crawford approached him again to go into partnership, on the proviso that they would provide a new transmitter. In December 1965, the transmitter arrived from Texas. It was old and very large, and the wrong sort of transmitter. The power pack fell in the sea as they tried to hoist it onto the station, and although it was dried out, the transmitter used too much power and was unsuitable. Neither Radio City nor Atlanta engineers could get it to work properly. Shortly afterwards, Atlanta sent Radio City a bill of £600 for the transport from Texas. Calvert returned it to Atlanta, on the grounds that the transmitter was its responsibility and could be collected at any time."]}, {"page": "Radio City (pirate radio station)", "response": ["In the early morning of 20 June 1966, a business associate of Calvert, retired Major Oliver Smedley (who claimed ownership of the transmitter), sent men to take possession of Shivering Sands with the intent of holding it for ransom. The next evening, Calvert visited Smedley's home and, in an alleged scuffle between him and a 3rd party, was shot by Smedley. Smedley was charged with murder but cleared on grounds of self-defence. Following Smedley's death a number of consistences about the trial were revealed, plus the fact that Dorothy Calvert (Reg's widow) had been the subject of a D notice, preventing any of the many interviews she had given from being printed or broadcast.'Life and death of a pirate' by S.K. Moore, Fillongley Pubs."]}, {"page": "Radio 390", "response": ["The period involved several incidents of aggression between the rival pirate radio stations; trawlermen hired by Radio Caroline \"were firebombed\" after failing to heed warnings from Paddy Roy Bates' Radio Essex, and Reginald Calvert, the owner of Radio City, was shot dead by Oliver Smedley, the founder of another competing station, Radio Atlanta. As a result, some suspected foul play in the Radio Invicta deaths, but this was never proved; questions were also raised about the seaworthiness of the David, and the coroner's inquiry returned an open verdict."]}, {"page": "Smedley", "response": ["*Oliver Smedley (1911–1989), English businessman and activist"]}, {"page": "Ralph Harris, Baron Harris of High Cross", "response": ["Harris became general director of the Institute of Economic Affairs (IEA) in 1957. He remained in this post until 1988, when he stepped down to become its chairman and was replaced by Graham Mather. Harris was then a founding president of the IEA from 1990 to his death. The IEA was set up by Antony Fisher and Oliver Smedley in 1955. Friedrich Hayek had suggested that an intellectual counterweight was necessary to combat the prevailing Keynesian consensus \"Butskellism\" of R. A. Butler and Hugh Gaitskell. Harris, together with editorial director Arthur Seldon, built the IEA into a bastion of free market liberal economics. The IEA developed links with economists such as Friedrich Hayek, Gottfried Haberler, Harry Johnson, Milton Friedman, George Stigler and James Buchanan, and published many pamphlets and papers on public finance issues, such as taxation, pensions, education, health, transport, and exchange rates."]}, {"page": "Radio Caroline", "response": ["In October 1965, negotiations began for Radio Caroline to take over Radio City, which broadcast from Shivering Sands Army Fort, a Second World War marine fort off the Kent coast. One of Radio Caroline's directors, Major Oliver Smedley, formerly of Radio Atlanta, entered a partnership with Radio City's owner, pop group manager Reginald Calvert and installed a more powerful transmitter on the fort. However, according to Gerry Bishop's book Offshore Radio this transmitter was antiquated and failed to work. Smedley later withdrew from the deal."]}, {"page": "Cobden Club", "response": ["In 1958 the Cobden Club, by now moribund, was taken over by the classical liberal activist Oliver Smedley.Richard Cockett, Thinking the Unthinkable. Think-Tanks and the Economic Counter-Revolution, 1931–1983 (London: Fontana, 1995), p. 126. Like many other clubs, it went through substantial financial difficulties in the late 1970s, and closed at the end of that decade."]}, {"page": "Mike Raven", "response": ["In the early 1960s, still using his real name, he began working for BBC radio, presenting talks and, occasionally, Woman's Hour. However, when his cousin, Liberal Party politician Oliver Smedley, founded the pirate radio station Radio Atlanta, he joined the station as a disc jockey, broadcasting from the ship Mi Amigo moored off the Essex coast near Frinton-on-Sea. At that point, he began using the name Mike Raven, and presented shows which focused on his love of American blues, rhythm and blues and soul music, of which he owned a large record collection. In 1964 he married Mandy Kilbey, sometimes presenting radio programmes jointly with her; they later had two sons."]}, {"page": "S. W. Alexander", "response": ["He was a journalist for the Beaverbrook press, being City Editor of the Sunday Express, Daily Express and Evening Standard. From 1948 he was editor of the City Press newspaper. He was instrumental in founding the Society for Individual Freedom and Oliver Smedley described himself and Alexander as \"the only active free-traders left in England in the 1950s\". He debated at the Cambridge Union with Lord Longford over the Beveridge Report in January 1943. He stood in the 1945 general election as an Independent Free Trade candidate (coming fourth) for City of London. He stood in the 1950 general election for the Liberal Party (coming third) for Ilford North. He was also chairman of the London Liberal Party.Richard Cockett, Thinking the Unthinkable.  Think-Tanks and the Economic Counter-Revolution, 1931–1983 (Fontana, 1995), pp. 125–127. He was also against British membership of the Common Market."]}, {"page": "Shivering Sands Army Fort", "response": ["In 1964 Screaming Lord Sutch set up Radio Sutch (a pirate radio station) on one of the old towers.  However, he soon became bored and handed the project to his friend and unpaid manager Reginald Calvert, who then expanded into all five towers that were still connected and called it Radio City.  After Calvert was killed by Oliver Smedley, his wife took over for a short time before the project was closed by legislation and the towers again abandoned."]}, {"page": "Radical Reform Group", "response": ["The founding members were concerned that, in the years after the Second World War, under the leadership of Clement Davies, the party was falling unduly under the sway of classical, free-market liberals and was drifting to the right.The Times, 5 June 1953. Under the influence of economic Liberals such as Oliver Smedley and Arthur Seldon who helped establish the Institute of Economic Affairs, the think tank which was to later become an engine of Thatcherism, the Liberal ship was coming loose from the New Liberal anchors it had adopted from the 1890s and reinforced in the 1920s with the Lloyd George, Keynes and Beveridge inspired coloured books. In 1948 the Liberal Party Assembly called for a drastic reduction in government expenditure and for a committee to be set up to recommend severe cuts.Mervyn Jones, A Radical Life (Hutchinson, 1991) p.205 The drift to the right so alarmed many left wing Liberals that many chose to abandon the party and join Labour, chief among them being the MPs or former MPs Lady Megan Lloyd George, Dingle Foot, Tom Horabin and Edgar Granville."]}, {"page": "Elliott Dodds", "response": ["However Dodds was not one of those Liberals like Arthur Seldon, Oliver Smedley, Alfred Suenson-Taylor, 1st Baron Grantchester or S. W. Alexander who openly campaigned to build high the edifice of Gladstonian liberalism in the party to ward off the rising floodwater of William Beveridge and John Maynard Keynes and who drifted away from mainstream party thinking to the right, into influential think-tanks like the Institute of Economic Affairs or organisations such as the Society for Individual Freedom between the 1930s and 1960s. Dodds welcomed the Beveridge Report and maintained links with the radical wing of the party. In 1953 he became chairman of the Unservile State Group, which aimed to explore the attitudes and policies of British Liberalism for the first time since the publication of the Liberal Yellow Book in 1928. It did not seek to promote any particular Liberal brand or establish any new path for the Liberalism but disseminate ideas which were distinctly liberal, reflecting the rich variety of the liberal tradition.Peter Barberis, The Unservile State Group in Brack & Randall (eds.) The Dictionary of Liberal Thought Politico's, 2007 In 1957 Dodds wrote in the opening chapter of the book The Unservile State: Essays in Liberty and Welfare that he looked forward to the Liberals \"re-establish[ing] themselves in their natural position as the acknowledged leaders of the Left...\".Watson, G. G., ed., The Unservile State: Essays in Liberty and Welfare (Crows Nest: Allen & Unwin, 1957), p. 26. He understood that political parties could not stand still writing in his 1947 book The Defence of Man that \"on the Continent, Liberal thought remained hobbled by the dogmas of laissez-faire, and the Liberal parties failed to go forward\".The Political Insight of Elliott Dodds by Donald Wade and Desmond Banks, Elliott Dodds Trust, 1977, p.15"]}, {"page": "Archie Macdonald", "response": ["Macdonald was also involved in the struggle for the ideological soul of the Liberal Party which was taking place at this time.  Many Liberals were concerned that, in the years after the Second World War, under the leadership of Clement Davies, the party was falling unduly under the sway of classical, free-market liberals and was drifting to the right. Under the influence of economic Liberals such as Oliver Smedley and Arthur Seldon who helped establish the Institute of Economic Affairs, the think tank which was to later become an engine of Thatcherism, the Liberal ship was coming loose from the New Liberal anchors it had adopted from the 1890s and reinforced in the 1920s with the Lloyd George, Keynes and Beveridge inspired coloured books. The drift to the right so alarmed many left wing Liberals that many chose to abandon the party and join Labour, chief among them being the MPs or former MPs Lady Megan Lloyd George, Dingle Foot, Tom Horabin and Edgar Granville. However others chose to fight from within and in 1952 the Radical Reform Group was set up. Macdonald was a signatory of a letter to the Guardian of 27 March 1953 which announced the formation of the GroupAlan Watkins, The Liberal Dilemma, Macgibbon & Kee, 1966 p.70 and he remained associated with it through the 1950s."]}, {"page": "Free Trade Union", "response": ["The Union's president between 1948 and 1959 was Andrew McFadyean, and it had close links with the right-wing of the Liberal Party.John Meadowcroft and Jaime Edwards, \"Liberals and the New Right\", Journal of Liberal History (2005)  By 1959 the organisation had a membership of between one and two thousand, but struggled financially. It was taken over by Oliver Smedley and Stanley Walter Alexander\"Free Trade Union 'Saved'\", The Times, 15 September 1959 prompting the resignation of several prominent Liberal Party members. Bertrand Russell was a speaker on behalf of the group.The Autobiography of Bertrand Russell, page 153"]}, {"page": "Deryck Abel", "response": ["Meanwhile, the election in 1956 of Jo Grimond as party leader reanimated the Liberal Party, ushering in a partial revival and foreshadowing a still-continuing struggle to establish a viable three-party system.Chris Cook, A Short History of the Liberal Party, 1900-2001 (London, 2001), pp.250-69 In 1959, Abel resigned from the Free Trade Union and the Free Trader, following their takeover by supporters of Oliver Smedley who, contending that the Conservative Party was pseudo-socialist, sought to promote right-wing ideas through the Liberal Party. Between 1962 and 1965 he worked with the prominent publishing house of Messrs. Longman, Green and Co. Ltd."]}, {"page": "Anti Common Market and Free Trade Party", "response": ["The Anti Common Market and Free Trade Party was a British political party that opposed Britain's membership of the European Union and fought a number of by-elections in the 1970s and 1980s.  It was also known as the Free Trade Liberal Party and All Party Anti-Common Market.  Among its members were Arthur Seldon and Oliver Smedley.  It saw itself in the Liberal Party tradition and its members were often involved with the free market Institute of Economic Affairs."]}, {"page": "1956 Walthamstow West by-election", "response": ["*The Liberal Party chose Oliver Smedley, who in 1955 had helped found the Institute of Economic Affairs"]}, {"page": "William Oliver Smedley", "response": ["#REDIRECT Oliver Smedley"]}, {"page": "Smedley, Oliver", "response": ["#redirectOliver Smedley"]}, {"page": "Saffron Walden Town Hall", "response": ["The initial stages of the trial of Major Oliver Smedley for the alleged manslaughter of the band manager, Reginald Calvert, took place in the town hall in July 1966; Smedley was founded to have acted in self-defence and was acquitted. The town hall continued to serve as the headquarters of the borough council for much of the 20th century but ceased to be the local seat of government after the enlarged Uttlesford District Council was formed at the council offices in Debden Road in 1974. The BBC Radio programme Any Questions? was broadcast from the town hall in May 2011. As a cost saving measure, Saffron Walden Town Council relocated its staff, who had previously been based in offices in Emson Close, into the town hall in October 2020."]}]}}