{"wiki_id": "http://www.wikidata.org/entity/Q7088061", "itemLabel": "Olivia Judson", "itemDescription": "evolutionary biologist and science writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Olivia_Judson", "wikipedia_page": {"main": "Olivia P. Judson (born 1970) is an evolutionary biologist and science writer. She is a former journalist for The Economist, a former online columnist for The New York Times and has published in a number of other publications, including National Geographic, The Atlantic and the Financial Times. Judson was a fellow of the Berlin Institute for Advanced Study in 2010-2011, and a Guggenheim fellow in 2020.", "link_mentions": [{"page": "Darwinism", "response": ["While the term Darwinism has remained in use amongst the public when referring to modern evolutionary theory, it has increasingly been argued by science writers such as Olivia Judson, Eugenie Scott, and Carl Safina that it is an inappropriate term for modern evolutionary theory. For example, Darwin was unfamiliar with the work of the Moravian scientist and Augustinian friar Gregor Mendel, and as a result had only a vague and inaccurate understanding of heredity. He naturally had no inkling of later theoretical developments and, like Mendel himself, knew nothing of genetic drift, for example."]}, {"page": "Fossil", "response": ["* \"It's extremely hard to become a fossil\", by Olivia Judson, 30 Dec 2008, The New York Times", "* \"Bones Are Not the Only Fossils\", by Olivia Judson, 4 Mar 2008, The New York Times"]}, {"page": "Extinction", "response": ["Biologist Olivia Judson has advocated the deliberate extinction of certain disease-carrying mosquito species. In a September 25, 2003 article in The New York Times, she advocated \"specicide\" of thirty mosquito species by introducing a genetic element that can insert itself into another crucial gene, to create recessive \"knockout genes\". She says that the Anopheles mosquitoes (which spread malaria) and Aedes mosquitoes (which spread dengue fever, yellow fever, elephantiasis, and other diseases) represent only 30 of around 3,500 mosquito species; eradicating these would save at least one million human lives per annum, at a cost of reducing the genetic diversity of the family Culicidae by only 1%. She further argues that since species become extinct \"all the time\" the disappearance of a few more will not destroy the ecosystem: \"We're not left with a wasteland every time a species vanishes. Removing one species sometimes causes shifts in the populations of other species—but different need not mean worse.\" In addition, anti-malarial and mosquito control programs offer little realistic hope to the 300 million people in developing nations who will be infected with acute illnesses this year. Although trials are ongoing, she writes that if they fail \"we should consider the ultimate swatting.\""]}, {"page": "Paleoproterozoic", "response": ["* The information on eukaryotic lineage diversification was gathered from a New York Times opinion blog by Olivia Judson. See the text here: ."]}, {"page": "Baillie Gifford Prize", "response": ["* Olivia Judson, Dr Tatiana's Sex Advice to All Creation: The Definitive Guide to the Evolutionary Biology of Sex"]}, {"page": "Giles Coren", "response": ["In 2005, Coren appeared as a regular correspondent on Gordon Ramsay's The F Word. In June 2006, he presented a programme on More4, entitled Tax the Fat, about clinical obesity and the cost it presents to the NHS. He co-presented the Channel 4 series Animal Farm with Dr Olivia Judson in March 2007. Around the same time, he appeared in a series of television commercials advertising Birds Eye frozen foods. Also in 2006, Coren presented the film and DVD review programme Movie Lounge."]}, {"page": "Dr Tatiana's Sex Advice to All Creation", "response": ["Dr Tatiana's Sex Advice to All Creation: The Definitive Guide to the Evolutionary Biology of Sex is a 2002 popular science book by the British evolutionary biologist Olivia Judson written in the role of her alter ego, agony aunt Dr Tatiana. Dr Tatiana receives letters from various creatures about their sex lives, and responds by explaining the biology of sex to creatures concerned."]}, {"page": "Dorion Sagan", "response": ["*Letters (discussing \"Turing Gaia,\" the natural basis of teleology) to Olivia Judson “Wild Side” column, topic “Heavy Weather,” The New York Times"]}, {"page": "Mosquito control", "response": ["Some biologists have proposed the deliberate extinction of certain mosquito species. Biologist Olivia Judson has advocated \"specicide\" of thirty mosquito species by introducing a genetic element which can insert itself into another crucial gene, to create recessive \"knockout genes\". She says that the Anopheles mosquitoes (which spread malaria) and Aedes mosquitoes (which spread dengue fever, yellow fever, elephantiasis, zika, and other diseases) represent only 30 out of some 3,500 mosquito species; eradicating these would save at least one million human lives per year, at a cost of reducing the genetic diversity of the family Culicidae by 1%. She further argues that since species become extinct \"all the time\" the disappearance of a few more will not destroy the ecosystem: \"We're not left with a wasteland every time a species vanishes. Removing one species sometimes causes shifts in the populations of other species — but different need not mean worse.\" In addition, anti-malarial and mosquito control programs offer little realistic hope to the 300 million people in developing nations who will be infected with acute illnesses this year. Although trials are ongoing, she writes that if they fail: \"We should consider the ultimate swatting.\""]}, {"page": "Saltation (biology)", "response": ["In 2008 evolutionary biologist Olivia Judson in her article The Monster Is Back, and It’s Hopeful listed some examples which may support the hopeful monster hypothesisJudson, Olivia. (2008). The Monster Is Back, and It's Hopeful. The New York Times. and an article published in the journal Nature in 2010 titled Evolution: Revenge of the Hopeful Monster reported that studies in stickleback populations in a British Columbia lake and bacteria populations in a Michigan lab have shown that large individual genetic changes can have vast effects on organisms \"without dooming it to the evolutionary rubbish heap\". According to the article \"Single-gene changes that confer a large adaptive value do happen: they are not rare, they are not doomed and, when competing with small-effect mutations, they tend to win. But small-effect mutations still matter — a lot. They provide essential fine-tuning and sometimes pave the way for explosive evolution to follow.\"Chouard, Tanguy. (2010). Evolution: Revenge of the hopeful monster. Nature 463, 864-867."]}, {"page": "Horace Freeland Judson", "response": ["Judson's first marriage ended in divorce. His second wife, Penelope Jones, died in 1993. Horace Freeland Judson's oldest daughter, Grace Judson,Grace Judson is a small-business coach and writer in San Diego. After her successful 25-year corporate career, she won the title of Fastest Knitter in America in 2002, appearing on Good Morning America in October of that year.  His younger daughter, Olivia Judson, is a science journalist and currently a research fellow as an evolutionary biologist at Imperial College London and is the author of the best-selling Dr. Tatiana's Sex Advice to All Creation.  His younger son, Nicholas Judson,Nicholas Judson was a scientist at the J. Craig Venter Institute (Rockville, MD), but left science to pursue a new career as a self-employed artist. Judson was an atheist.https://www.theguardian.com/science/2011/may/25/horace-freeland-judson-obituary"]}, {"page": "Baba Brinkman", "response": ["Brinkman followed up his Darwin tribute with a sequel show specifically about evolutionary psychology, The Rap Guide to Human Nature, which premiered at the Edinburgh Fringe in 2010. The album features peer review phone messages from David Buss, Olivia Judson, and David Sloan Wilson commenting on the science content in Brinkman's lyrics. In 2012 Human Nature was adapted into a theatre production, Ingenious Nature, which ran off-Broadway from November 2012 through January 2013."]}, {"page": "Olivia (name)", "response": ["*Olivia Judson (born 1970), British biologist"]}, {"page": "Genius of Britain", "response": ["*Olivia Judson - Evolutionary biologist"]}, {"page": "Judson (name)", "response": ["*Olivia Judson (born 1970), evolutionary biologist and science writer"]}, {"page": "Other Minds: The Octopus, the Sea, and the Deep Origins of Consciousness", "response": ["Olivia Judson, in The Atlantic, having read Jacques-Yves Cousteau's 1973 Octopus and Squid: The Soft Intelligence, notes that Godfrey-Smith follows the neuroscientist Stanislas Dehaene in suggesting that \"there's a particular style of processing—one that we use to deal especially with time, sequences, and novelty—that brings with it conscious awareness, while a lot of other quite complex activities do not.\" She argues that the ability of octopuses to learn new skills, of the kind that may demand consciousness, indicates the possibility of \"an awareness that in some ways resembles our own.\""]}, {"page": "List of Guggenheim Fellowships awarded in 2020", "response": ["|Olivia Judson"]}]}}