{"wiki_id": "http://www.wikidata.org/entity/Q709602", "itemLabel": "Roy Babbington", "itemDescription": "British bassist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Babbington", "wikipedia_page": {"main": "Roy Babbington (born 8 July 1940 in Kempston, Bedfordshire, England) is a rock and jazz bassist. He became well known for being a member of the Canterbury scene progressive rock band Soft Machine.", "link_mentions": [{"page": "Robert Fripp", "response": ["* 1973 : Ovary Lodge : Ovary Lodge - With Keith Tippett, Roy Babbington, etc."]}, {"page": "List of jazz bassists", "response": ["*Roy Babbington (born 1940)"]}, {"page": "Soft Machine", "response": ["Soft Machine are  an English rock band from Canterbury formed in mid-1966 by Robert Wyatt (drums, vocals, 1966–1971), Kevin Ayers (bass, guitar, vocals, 1966–1968), Daevid Allen (guitar, 1966–1967), and Mike Ratledge (organ, 1966–1976). As a central band of the Canterbury scene, the group became one of the first British psychedelic acts and later moved into progressive rock and jazz fusion. Their varying line-ups have included former members such as Hugh Hopper (bass, 1969–1973), Elton Dean (saxophone, 1969–1972), and Andy Summers (guitar, 1968), and currently consists of John Marshall (drums), Roy Babbington (bass), John Etheridge (guitar), and Theo Travis (saxophone, flutes, keyboards)", "In December 1968, to fulfill contractual obligations, Soft Machine re-formed with former road manager and composer Hugh Hopper on bass added to Wyatt and Ratledge and recorded their second album, Volume Two (1969), which started a transition toward jazz fusion. In May 1969 this line-up acted as the uncredited backing band on two tracks of The Madcap Laughs, the debut album by Syd Barrett. In 1969 the trio was expanded to a septet with the addition of four horn players, though only saxophonist Elton Dean remained beyond a few months, the resulting Soft Machine quartet (Wyatt, Hopper, Ratledge and Dean) running through Third (1970) and Fourth (1971), with various guests, mostly jazz players (Lyn Dobson, Nick Evans, Mark Charig, Jimmy Hastings, Roy Babbington, Rab Spall). Fourth was the first of their fully instrumental albums and the last one featuring Wyatt.", "After the release of Six in 1973, Hopper left in 1974. He was replaced by Roy Babbington, another former Nucleus member, who had already contributed double bass on Fourth (1971) and Fifth (1972) and took up (6-string) bass guitar successfully, while Karl Jenkins took over as bandleader and composer. After they released Seven (1973) without additional musicians, the band switched record labels from Columbia to Harvest. On their 1975 album, Bundles, a significant musical change occurred with Allan Holdsworth adding guitar as a prominent melody instrument to the band's sound, sometimes reminiscent of John McLaughlin's Mahavishnu Orchestra, setting the album apart from previous Soft Machine albums which had rarely featured guitars. Holdsworth was replaced by John Etheridge for the next album Softs (1976). Ratledge, the last remaining original member of the band, had left during the early stages of recording. Other musicians in the band during the later period were bassists Percy Jones (of Brand X) and Steve Cook, saxophonists Alan Wakeman and Ray Warleigh, and violinist Ric Sanders. Their 1977 performances and record (titled Alive and Well, ironically) were among the last for Soft Machine as a working band, their last performance (until the 1984 reformation) being the only Soft Machine concert of 1978.", "Hopper left in 2008 because he was suffering from leukaemia, so the band continued live performances with Fred Baker. Following Hopper's death in 2009, the band announced that they would continue with Roy Babbington again replacing Hugh Hopper on bass.", "In September and October 2015, it was announced that the band Soft Machine Legacy (made of guitarist John Etheridge, drummer John Marshall, bass player Roy Babbington and sax, flute and keyboard player Theo Travis) would be performing under the name \"Soft Machine\" in late 2015 and early 2016: two shows in the Netherlands and Belgium in early December 2015 and a series of seven UK shows in March–April 2016.", "In December 2015, it was confirmed that the band had dropped the \"Legacy\" tag from their name, as the band featured three of the group's 1970s era members – John Etheridge, John Marshall and Roy Babbington – joined by Theo Travis on sax, flute and keyboard.", "*Roy Babbington – bass ", "| Evans, Hastings, Mark Charig, Roy Babbington, Alan Skidmore"]}, {"page": "Karl Jenkins", "response": ["* Relook : Graham Collier 1937-2011: A Memorial 75th Birthday Celebration (2012) With John Marshall, Nick Evans, Gary Burton, Frank Ricotti, Roy Babbington, Kenny Wheeler, Alan Wakeman etc. ", "* Greek Variations & Other Aegean Exercises (1970) - With Jack Bruce, Jeff Clyne, Roy Babbington, John Marshall, Barbara Thompson, etc.", "* Seven (1973) - Same except Roy Babbington replaced Hopper on bass. "]}, {"page": "Hatfield and the North", "response": ["In mid-1972 the band grew out of a line-up of ex-members of blues/jazz/rock band Delivery, Pip Pyle (drums, who had since played with Gong), Phil Miller (guitar, who had joined Matching Mole), and Phil's brother Steve Miller (Wurlitzer electric piano, who had joined Caravan).  Replacing Roy Babbington on bass was Richard Sinclair (who played with Steve Miller in Caravan).  This line-up moved away from the blues idiom of the early Delivery towards pieces based on riffs in odd time signatures and protracted melodies associated with the Canterbury style.", "Delivery reunited for a BBC session in November 1972 with Steve Miller, Phil Miller, Lol Coxhill, Roy Babbington (bass), Pip Pyle, and Richard Sinclair on vocals. (Steve Miller went on to release a couple of duo albums with Coxhill in 1973/74.)"]}, {"page": "Fender Bass VI", "response": ["* Roy Babbington (Soft Machine)"]}, {"page": "Stan Tracey", "response": ["* We Still Love You Madly (Mole, 1988; TAA, 2001) – with Roy Babbington"]}, {"page": "Julie Driscoll", "response": ["* 1972 – Blueprint (with Keith Tippett, Roy Babbington, Frank Perry and Keith Bailey) (produced by Robert Fripp)"]}, {"page": "Nucleus (band)", "response": ["* Roy Babbington – bass guitar"]}, {"page": "Keith Tippett", "response": ["For his next album as a leader, Blueprint (1972), he used a smaller group comprising himself and Julie Tippetts with bassist Roy Babbington and drummer Frank Perry. The band then expanded slightly to become Ovary Lodge, who recorded two albums, one for RCA and a second for the Ogun label. Tippett and his band also recorded in the 1970s for Giorgio Gomelsky's label, Utopia, releasing the Julie Tippetts album, Sunset Glow. Tippett continued to play with various combinations of musicians through the 1970s, playing improvisational jazz and jazz-rock with such musicians as Stan Tracey, Robert Wyatt, Dudu Pukwana, Harry Miller, Elton Dean, Hugh Hopper, and Louis Moholo. From 1979, he also started to release many live albums of solo piano performances, beginning with The Unlonely Raindancer."]}, {"page": "Bundles (album)", "response": ["* Roy Babbington – bass guitar"]}, {"page": "Septober Energy", "response": ["*Roy Babbington (doubling bass guitar)"]}, {"page": "Centipede (band)", "response": ["Centipede was formed by Keith Tippett in 1970 to perform an extended composition, Septober Energy, that he had been working on. The members were drawn from his own band at the time, The Keith Tippett Group; several British progressive rock, jazz-rock and avant-garde jazz groups, including Soft Machine (Robert Wyatt, Elton Dean, Nick Evans, Mark Charig), Nucleus (Karl Jenkins, Ian Carr, Brian Smith, Jeff Clyne, Roy Babbington, Bryan Spring, John Stanley Marshall) and King Crimson (Robert Fripp, Peter Sinfield, Ian McDonald, Boz Burrell); and students of the London School of Music. Septober Energy consisted of four movements, or \"concepts\", that the band improvised around. It was first performed by the band live at the Lyceum Theatre in London on 15 November 1970. ", "*Roy Babbington (doubling bass guitar)"]}, {"page": "Fourth (album)", "response": ["Like the previous Soft Machine album, some tracks have the band augmented by additional musicians. These include Mark Charig and Nick Evans, who had been in the septet lineup of late 1969, and Roy Babbington, who would join the band in 1973.", "* Roy Babbington – double bass (1, 3, 4, 6)"]}, {"page": "Seven (Soft Machine album)", "response": ["Seven is the seventh studio album by the jazz rock band Soft Machine, released in 1973. Roy Babbington, who had previously contributed to Fourth (1971) and Fifth (1972) on double bass as a session musician, replaced Hugh Hopper on bass guitar, who left to begin a solo career.", "*Roy Babbington – bass guitar, acoustic bass"]}, {"page": "Fifth (Soft Machine album)", "response": ["Fifth was the first Soft Machine album recorded after the departure of founding member Robert Wyatt and continued the band's progression away from their original blend of psychedelic and progressive rock towards jazz fusion.  Wyatt's replacement was Phil Howard who contributed to the 1971 sessions that comprise side one, after which he left and was replaced by John Marshall for the 1972 recordings that make up side two.  Future member Roy Babbington played double bass on side two, as a session musician.  Unlike the previous two albums, Elton Dean's saxophone is not augmented by a brass and reeds section composed of session musicians.", "* Roy Babbington – double bass (4-6)"]}, {"page": "All This Useless Beauty", "response": ["* Roy Babbington – double bass "]}, {"page": "Ogun Records", "response": ["| OG 522 || Charles Austin/Roy Babbington/Joe Gallivan ||  Home from Home || 1978"]}, {"page": "Euphoria (Canadian band)", "response": ["Euphoria was formed in 1993 by Emmy nominated guitarist and composer Ken Ramm.Their 1999 self-titled effort featured guest appearances by Geddy Lee (Rush), Roy Babbington (Soft Machine), Anne Dudley (Art of Noise), and Juliet Roberts.\"The music world is evidently feeling euphoric these days\". By Scott Iwasaki Deseret News June 25, 1999\" Euphoria Euphoria\". AllMusic Review by Rick Anderson In 1999 the track \"Delirium\" from the self-titled debut release broke onto North American radio charts.\" Euphoria Precious Time\". AllMusic Review by Jo-Ann Greene \"Delirium\" was also used in The Ongoing History of New Music episode \"Alt-Rock's Greatest Instrumentals\" (Episode 422, 2003)."]}, {"page": "Welcome to the Cruise", "response": ["*Roy Babbington – bass on track 1, acoustic bass on track 5"]}, {"page": "Barbara Thompson (musician)", "response": ["*Barbara Thompson's Jubiaba (9 piece Latin/rock band) including Peter Lemer, Roy Babbington, Henry Lowther, Ian Hamer, Derek Wadsworth, Trevor Tomkins, Bill Le Sage, Glyn Thomas."]}, {"page": "Delivery (band)", "response": ["Founded in 1966 as Bruno's Blues Band by guitarist Phil Miller, his elder brother, pianist Steve Miller, drummer Pip Pyle and bassist Jack Monck, the band gigged around London for a few years. In 1968, saxophonist Lol Coxhill joined them, and the band's name was changed to Steve Miller's Delivery. In 1969, the band teamed up with blues singer Carol Grimes and bassist Roy Babbington replaced Monck. The resulting line-up recorded and released one album: Fools Meeting. Although Grimes wanted to appear as a band member, the record company released the album under \"Carol Grimes and Delivery\". In 1971, Pyle left the band to join Gong and was replaced by Laurie Allan (who would himself also later join Gong). They disbanded shortly thereafter.", "Roy Babbington, who had played with the Keith Tippett Group and Nucleus in 1971-73, went on to join Soft Machine from 1973-76. Laurie Allan rejoined Gong a couple of times, most notably appearing on 1973's Flying Teapot, and later Barbara Thompson's Paraphernalia."]}, {"page": "Gary Husband", "response": ["In March 2015, Husband stepped in for drummer John Stanley Marshall, performing with Soft Machine Legacy for a short tour of Japan with John Etheridge, Theo Travis, Roy Babbington, and guest artist Keith Tippett."]}, {"page": "Fools Meeting", "response": ["* Roy Babbington - bass"]}, {"page": "Softs (album)", "response": ["John Etheridge replaced Allan Holdsworth on guitar shortly after the release of the previous album, Bundles, and Alan Wakeman, cousin of keyboardist Rick Wakeman, took over saxophone duties from Karl Jenkins. Karl would play keyboards exclusively from this point onward. This change was necessitated by the departure of the group's last founding member, Mike Ratledge, who left in March 1976 before the sessions were completed, and can be heard on two tracks, but is not credited as a member of the group. Wakeman and bassist Roy Babbington left the group not long after the album was released, Wakeman having been a member for less than six months.Calyx band profile", "#\"One Over the Eight\" (Karl Jenkins, John Marshall, John Etheridge, Alan Wakeman, Roy Babbington) – 5:26", "*Roy Babbington – bass guitar"]}, {"page": "Alive & Well: Recorded in Paris", "response": ["#\"Organic Matter (Alan Wakeman, John Etheridge, John Marshall, Karl Jenkins, Roy Babbington) / One Over the Eight\" (Steve Cook) – 5:55"]}]}}