{"wiki_id": "http://www.wikidata.org/entity/Q709139", "itemLabel": "Arthur Drakeford", "itemDescription": "Australian politician, born 1878", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Drakeford", "wikipedia_page": {"main": "Arthur Samuel Drakeford (26 April 1878 – 9 June 1957) was an Australian politician who served as a member of the House of Representatives from 1934 to 1955, representing the Labor Party. He served as Minister for Air and Minister for Civil Aviation from 1941 to 1949, and during World War II was the minister responsible for the Royal Australian Air Force. He was also responsible for the establishment of the domestic carrier Trans Australia Airlines and for the nationalisation of Qantas.\n\n", "link_mentions": [{"page": "Trans Australia Airlines", "response": ["The Chifley Government's view was summed up by Minister for Air, Arthur Drakeford: Where are the great pioneers of aviation?  .....  We discover that one by one the small pioneer enterprises are disappearing from the register. It is the inevitable process of absorption by a monopoly.  Air transport, the government believed, was primarily a public service, like hospitals, the railways or the post office. If there was to be a monopoly at all, then it should be one owned by the public and working in the public interest."]}, {"page": "HMAS Benalla (J323)", "response": ["Benalla was laid down at HMA Naval Dockyard in Williamstown, Victoria on 24 March 1942. She was launched on 19 December 1942 by the wife of Arthur Drakeford, serving Minister for the Air, and commissioned on 28 April 1943."]}, {"page": "Minister for Defence (Australia)", "response": ["| Arthur Drakeford ", "| rowspan=3 | Arthur Drakeford "]}, {"page": "War cabinet", "response": ["thumb|right|300px|War Cabinet meeting in Melbourne in 1943. Left to right: John Curtin, Sir Frederick Sheddon, Ben Chifley, 'Doc' Evatt, Norm Makin, Arthur Drakeford", "* Arthur Drakeford (Minister for Air)"]}, {"page": "Fitzroy, Victoria", "response": ["* Arthur Drakeford (1878–1957) – politician"]}, {"page": "First Curtin Ministry", "response": ["| Hon Arthur Drakeford "]}, {"page": "Second Curtin Ministry", "response": ["| Hon Arthur Drakeford "]}, {"page": "Forde Ministry", "response": ["| Hon Arthur Drakeford "]}, {"page": "First Chifley Ministry", "response": ["| Hon Arthur Drakeford "]}, {"page": "Second Chifley Ministry", "response": ["| Hon Arthur Drakeford "]}, {"page": "Division of Maribyrnong", "response": ["Prominent former members include James Fenton, a minister under James Scullin and Joseph Lyons; Arthur Drakeford, a minister under John Curtin, Frank Forde and Ben Chifley; and Moss Cass, a minister under Gough Whitlam. The current member for Maribyrnong since the 2007 election is the former National Secretary of the Australian Workers' Union and former Opposition Leader Bill Shorten.", "| Arthur Drakeford"]}, {"page": "James Fenton (politician)", "response": ["Fenton was appointed as Postmaster-General in the new UAP government and introduced the legislation that established the Australian Broadcasting Commission.  But he soon fell out with his fellow ministers over the government's acceptance of the Ottawa Agreement, establishing Imperial Preference, which he considered threatened the high tariff policy. In October 1932 he resigned, after voting against the bill that ratified the agreement. He remained on the government backbench and ran again as the UAP candidate for Maribyrnong at the general election in 1934, but the seat was naturally a Labor one. He had been able to win it for the UAP in the anti-Labor landslide of 1931, but in 1934 Fenton lost to the Labor candidate, Arthur Drakeford, suffering a seven-point swing."]}, {"page": "Electoral district of Essendon", "response": ["| Arthur Drakeford", "| Arthur Drakeford Jr"]}, {"page": "Charles Burnett (RAF officer)", "response": ["From October 1941, Burnett had a strained working relationship with Arthur Drakeford, the Australian Labor Party's minister for air who had just then been appointed. Burnett and Drakeford frequently clashed and when in early 1942 Burnett proposed sweeping organizational changes, including the abolition of the Australian Air Board, a breaking point was reached.  It had also been widely argued that Burnett's focus on the European theatre resulted in the RAAF lacking sufficient defensive strength and by 1942 the threat of invasion by Japan was growing. Burnett was replaced in May 1942 by an Australian, Air Vice Marshal George Jones, who succeeded to the position despite Burnett's lobbying for his deputy, Air Vice Marshal William Bostock, to take over.Stephens, The Royal Australian Air Force, pp.116–119"]}, {"page": "Frederick Scherger", "response": ["As well as the loss of civil and military infrastructure, twenty-three aircraft and ten ships, and the death of some 250 people, 278 RAAF personnel had deserted Darwin in an exodus that became known as the \"Adelaide River Stakes\".Grose, An Awkward Truth, pp. 225–231 \"There was\", in Scherger's words, \"an awful panic and a lot of men simply went bush\".Lockwood, Australia Under Attack, p. 133 Praised for his \"great courage and energy\", he was one of the few senior Air Force officers in the region to emerge from Commissioner Charles Lowe's inquiry into the debacle with his long-term career prospects undamaged. In the immediate aftermath, though, his outspoken criticism of the RAAF's state of preparedness alienated members of the Air Board, the service's controlling body that consisted of its most senior officers and which was chaired by the Chief of the Air Staff (CAS).Stephens, The Royal Australian Air Force, p. 112 He was relieved of his position at NWA by the CAS, Air Chief Marshal Sir Charles Burnett, and shunted through a series of postings for the remainder of the year, including commanding officer at RAAF Station Richmond,Roylance, Air Base Richmond, p. 113 supernumerary at RAAF Headquarters, Director of Defence at Allied Air Forces Headquarters, South West Pacific Area,Gillison, Royal Australian Air Force, p. 473  and Director of Training at RAAF Headquarters. Seeking restitution, he boldly went over the heads of the Air Board and successfully appealed to the Minister for Air, Arthur Drakeford, supported by Commissioner Lowe.Grose, An Awkward Truth, pp. 213–214"]}, {"page": "1955 Australian federal election", "response": ["| Arthur Drakeford"]}, {"page": "1934 Australian federal election", "response": ["| Arthur Drakeford"]}, {"page": "William Bostock", "response": ["After his retirement from the military, Bostock went into journalism and become an aviation correspondent for The Herald. He wrote a series of articles criticising the Air Force's organisation and presenting his side of the story of RAAF Command, motivated partly by his belief that the official history of Australia in World War II would fail to adequately cover it. The articles caused considerable controversy and prompted the Minister for Air, Arthur Drakeford, to make a formal response in Federal Parliament, labelling Bostock's allegations \"malicious and unjustified\".Helson, Ten Years at the Top, pp. 243–249"]}, {"page": "Minister for Infrastructure, Transport and Regional Development", "response": ["| rowspan=3 | Arthur Drakeford"]}, {"page": "Thomas White (Australian politician)", "response": ["A boundary redistribution prior to the December 1949 federal elections reduced Balaclava from 84,000 voters to just under 43,000; White retained the seat against the Labor contender by a margin of 14,361. Following the Liberal Party victory, White was appointed Minister for Air and Minister for Civil Aviation, despite his personal animosity towards Menzies, which partly stemmed from the latter's failure to serve in the First World War.Martin, Robert Menzies: A LifeVolumeII, pp. 129–130 He took over his portfolios from Arthur Drakeford, who had held them for eight years.Stephens, Going Solo, pp. 15, 326 In January 1950, White and the Minister for Supply and Development, Richard Casey, announced that the English Electric Canberra had been selected to replace the RAAF's Avro Lincoln bombers and that the new jet would be manufactured by the Government Aircraft Factory in Victoria. White's term as Minister for Air saw the deployment of RAAF squadrons to the Korean War and the Malayan Emergency in mid-1950, and the establishment of the Women's Royal Australian Air Force, the successor organisation to the wartime Women's Auxiliary Australian Air Force, that November.Stephens, The Royal Australian Air Force, pp. 205, 209, 244 The following year he gave his approval for the manufacture of a Rolls Royce-engined licensed version of the North American F-86 Sabre jet fighter for the RAAF, and played a major part in the controversial decision to replace the long-serving Chief of the Air Staff, Air Marshal George Jones, with an RAF officer, Air Vice Marshal (later Air Chief Marshal Sir) Donald Hardman.Stephens, Going Solo, pp. 73, 347Helson, The Private Air Marshal, pp. 348–352 White also sought to strengthen the Citizen Air Force, and personally ordered the establishment of No.24 (City of Adelaide) Squadron at Mallala, South Australia.Stephens, Going Solo, p. 326"]}, {"page": "Members of the Australian House of Representatives, 1954–1955", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1951–1954", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1949–1951", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1946–1949", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1943–1946", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1940–1943", "response": ["| Hon Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1937–1940", "response": ["| Arthur Drakeford"]}, {"page": "Members of the Australian House of Representatives, 1934–1937", "response": ["| Arthur Drakeford"]}, {"page": "Candidates of the 1934 Australian federal election", "response": ["|Maribyrnong || United Australia || |Arthur Drakeford || James Fenton (UAP) || Alexander Amess (SC)Jack Blake (CPA)"]}, {"page": "Candidates of the 1937 Australian federal election", "response": ["|Maribyrnong || Labor || |Arthur Drakeford || Malcolm Fenton (UAP) || Edward Turner (Ind)"]}, {"page": "Candidates of the 1940 Australian federal election", "response": ["|Maribyrnong || Labor || |Arthur Drakeford || Robert Vroland (UAP) ||"]}, {"page": "Candidates of the 1943 Australian federal election", "response": ["|Maribyrnong || Labor || |Arthur Drakeford || Albert Pennell (UAP) || Kenneth Kenafick (Ind Lab)Charles Woollacott (CCM)"]}, {"page": "Candidates of the 1946 Australian federal election", "response": ["|Maribyrnong || Labor || |Arthur Drakeford || Adrian Cole (Lib) ||"]}, {"page": "Candidates of the 1949 Australian federal election", "response": ["|Maribyrnong || Labor || |Arthur Drakeford || George Hannan (Lib) || Colin Neyland (Ind)"]}]}}