{"wiki_id": "http://www.wikidata.org/entity/Q7105969", "itemLabel": "Oscar Faber", "itemDescription": "British engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Oscar_Faber", "wikipedia_page": {"main": "Oscar Faber  (5 July 1886 – 7 May 1956) was a British structural engineer. He was influential in the development of the use of reinforced concrete in the United Kingdom. Because many engineers were not certain of the material, Faber pioneered simple deflection tests, which enabled him to develop his theory of ‘Plastic yield in concrete’, and to calculate shear in reinforced concrete beams.\nFaber was born in London, the son of the Danish Commissioner of Agriculture in London. His work for Trollope & Colls on  non-magnetic mine casings during the First World War earned him the OBE in the 1918 Birthday Honours.He set up as an independent consultant at the age of 35 in 1921, with £2000 capital, in Finsbury Circus, City of London. The firm comprised 2 engineers, an office junior and a typist. This was to grow to become Oscar Faber and Partners. Notable projects include the Bank of England, the House of Commons, Africa House and India House in London. He co-authored the book, Reinforced Concrete Design, with P.G. Bowie, which became a standard work. Faber's work on rebuilding the House of Commons won him a CBE in 1951. He also worked on the Snow Hill, Bath, re-development scheme - 11-storey block of 56 maisonettes opened by Alderman Sam Day in March 1958 - in association with architects Snailum, Huggins and Lefevre.\nFaber was president of the Institution of Structural Engineers between 1935 and 1936. The Institution named an award after him, the Oscar Faber Medal, one of which was presented to Fazlur Khan in 1973.Faber's company Oscar Faber & Partners eventually merged with G Maunsell & Partners to become Faber Maunsell. In 2009, Faber Maunsell was rebranded AECOM.", "link_mentions": [{"page": "Dolphin Square", "response": ["Costains appointed the architect Gordon Jeeves to design Dolphin Square and he was assisted by Cecil Eve. Oscar Faber was the consultant engineer. Up to that point, Dolphin Square was Jeeves's largest project and he had played a part in designing other London buildings such as the National Radiator Building and later at Berkeley Square House. Dolphin Square is a neo-Georgian building and has a reinforced concrete structure with external facings of brick and stone. Original sound proofing was provided by compressed cork insulation in the floors. The original cost for the construction of  Dolphin Square and its 1,310 flats was around £2,000,000. In total, it was estimated that 200,000 tonnes of earth was moved, 125,000 tons of concrete used, 12 million bricks used on the external walls and 6,700 Crittal windows installed during construction."]}, {"page": "Guy Maunsell", "response": ["In 1955 he founded the firm of G Maunsell & Partners in the United Kingdom which pioneered the use of prestressed concrete in major bridges. The Hammersmith Flyover, completed in 1961, made revolutionary use of this new construction method and many more structures followed. The firm expanded to Australia, Hong Kong and the Middle East and in time merged with Oscar Faber & Partners to form Faber Maunsell, and ultimately became part of the US-based AECOM Group."]}, {"page": "Rob Kell", "response": ["Kell joined the firm of Oscar Faber & Partners in 1926, after a period as a contractor, and rose to become a Partner in 1948. In 1936 he co-wrote the standard textbook Heating and air conditioning of Buildings with Oscar Faber.  He also wrote the entry on heating, ventilation and air conditioning for the Encyclopædia Britannica."]}, {"page": "List of structural engineers", "response": ["* Oscar Faber"]}, {"page": "Structural Awards", "response": ["**Oscar Faber for Liverpool Lime Street railway station, England", "*Structural Heritage Commendation: Oscar Faber for The Triangle, Manchester, England", "*Structural Heritage Commendation: Oscar Faber for Oxford Road railway station, Manchester, England"]}, {"page": "SGX Centre", "response": ["Other firms involved in the development of SGX Centre includes United Overseas Bank (UOB), Kajima Overseas Asia Private Limited, Oscar Faber Consultants Pte Ltd, Parsons Brinckerhoff Consultants Private Limited, Peridian Asia Private Limited, Bachy Soletanche Singapore Private Limited, Faber Maunsell, KPK Quantity Surveyors (1995), Singapore Private Limited, Manntech Building Maintenance Systems, Permasteelisa S.p.A., and Permasteelisa Pacific Holdings Ltd."]}, {"page": "Telford Medal", "response": ["|Oscar Faber"]}, {"page": "Faber (surname)", "response": ["*Oscar Faber (1886–1956), British structural engineer"]}, {"page": "Faber Maunsell", "response": ["#REDIRECT Oscar Faber"]}, {"page": "Wales Empire Pool", "response": ["The building was acclaimed as the first example of modernist architecture in Cardiff, and was similar in design to the Royal Festival Hall in London. It was designed by D. M. Davies, believed to be influenced by Peter Behrens' 1910 AEG turbine factory. The Royal Institute of British Architects differs in opinion, attributing the design to John Dryburgh, the City Architect 1957–74. The structural engineer was Oscar Faber, who was known for his work with reinforced concrete."]}, {"page": "1966 New Year Honours", "response": ["* John Robert Kell, Partner, Oscar Faber & Partners."]}, {"page": "1980 Birthday Honours", "response": ["* Peter Lewis Martin, Partner, the Oscar Faber Partnership."]}, {"page": "1951 New Year Honours", "response": ["* Oscar Faber, , Senior Partner, Oscar Faber & Partners. For services in the rebuilding of the House of Commons."]}, {"page": "Ronald Jenkins", "response": ["He worked with the structural engineer Oscar Faber, and worked at Arup Group, of which he was one of four founders in 1949, becoming a Senior Partner. At Arup he worked as a concrete shell design engineer. He was known for his mathematical skill."]}, {"page": "1918 Birthday Honours (OBE)", "response": ["*Oscar Faber  Messrs. Trollope & Colls,"]}, {"page": "List of fellows of Imperial College London", "response": ["* Oscar Faber"]}]}}