{"wiki_id": "http://www.wikidata.org/entity/Q7105032", "itemLabel": "Ortis Deley", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Ortis_Deley", "wikipedia_page": {"main": "Ortis Deley ( OH-tis) (born 2 June 1973) is a British television presenter,comedian, singer,radio DJ and actor of Ghanaian and Nigerian descent, best known for presenting the Children's BBC Saturday morning flagship series Live & Kicking. As of November 2021, he is a presenter on The Gadget Show. He has also co-presented Police Interceptors in the UK, with Rick Edwards. He also appeared on Police Interceptors special edition where he drove around with the Cleveland and Durham specialist operations unit as well as observing the operations of the control centre.", "link_mentions": [{"page": "Craig Charles", "response": ["| Co-host alongside Jon Bentley, Ortis Deley and Georgie Barrat"]}, {"page": "List of sports announcers", "response": ["* Ortis Deley – 3 days for Channel 4 2011 (Sacked after viewer complaints)"]}, {"page": "University of Sunderland", "response": ["* Ortis Deley – English television presenter, radio DJ and actor."]}, {"page": "Iris Wildthyme", "response": ["Although in some of her early appearances (including Verdigris and Wildthyme on Top) Iris is accompanied by her companion Tom (played on audio by Ortis Deley), her usual foil in her Big Finish, Obverse Books and Snowbooks appearances is Panda, a 10-inch-tall sentient, stuffed toy (played on audio by David Benson).\"Soho Stories\", Clayton Littlewood, Polarimagazine, Feb 2010"]}, {"page": "Live & Kicking", "response": ["The show returned in Autumn 1999 with new presenters Emma Ledden and Steve Wilson,. They only lasted for one series, because ratings dropped to 1.6 million during their tenure. At the same time rival SMTV Live on competitor channel ITV was relaunched to feature more comedic elements and its innuendo and features began to gain popularity. Fully Booked, the BBC's summer replacement, was also revamped and retitled as FBi, but ratings continued to drop. The following October, the programme was completely revamped, with a line-up of four: Ortis Deley, Katy Hill, Trey Farley and Sarah Cawood.", "In May 2000, two months before Wilson and Ledden officially resigned from Live & Kicking, the show was brought back for a one-off special during the summer break. It was to mix in with the BBC's Music Live and the show was titled as Music Live & Kicking with Wilson and Ledden returning to present along with future presenter Ortis Deley and special guest presenter Stephen Gately of Boyzone. This special was dedicated to a series of music performances (hence the title) and was the first edition to be broadcast in widescreen.", "October 2000 saw a number of major changes to the show. The set was entirely revamped with a new layout, new titles were added along with a new arrangement of the theme tune. Mr Blobby, The Leprechauns, Supergirly, Renoir and Mitch had also been removed from the show and unlike previous series, there were now four presenters instead of two: Katy Hill, Ortis Deley, Trey Farley and Sarah Cawood. The programme also saw the introduction of gunge based games. A new game was also introduced on the roof of BBC Television Centre called Sacrifice Your Family which Cawood hosted that put two families against each other in various games."]}, {"page": "Watchdog (TV programme)", "response": ["*Short Change – about consumer affairs aimed at children between 7-16-year-olds, originally presented by Zoë Ball, then Andi Peters, Tim Vincent, and up until 2003, Angellica Bell. It was then presented by Thalia Pellegrini, Rhodri Owen and Ortis Deley. Many complaints included problems with service, bad deals, and being generally ripped-off. Finished in 2005."]}, {"page": "Suzi Perry", "response": ["Since 2004, Perry had been a co-presenter for Channel 5's The Gadget Show, a hi-tech weekly programme, alongside Jason Bradbury, Jon Bentley, Ortis Deley and Pollyanna Woodward. She was temporarily replaced by Gail Porter while recovering from an ectopic pregnancy, and returned in August 2009. Perry created the current theme music for the Gadget Show in 2011, as part of one of the show's challenges. In February 2012, it was announced that the show's format was going to change and be renamed The Gadget Show: World Tour, featuring only two of the previous team of presenters: Jason Bradbury and Pollyanna Woodward.", "On 10 March 2012, Perry danced to \"Livin' the Vida Loca\" with ex-Gadget Show fellow presenter Ortis Deley for the BBC's Let's Dance for Comic Relief. Perry was a guest panellist on the Channel 5 magazine show The Wright Stuff, alongside comedian Lee Hurst, for the week of 19–23 March 2012. Her appearance as a guest in the third series of BBC Two's The Sarah Millican Television Programme was shown on 2 November 2013. On 14 June 2014, she co-presented the BBC's coverage of Trooping the Colour with Huw Edwards."]}, {"page": "Short Change", "response": ["| 6 ||rowspan=3| 12 || 7 January 1999 – 25 March 1999 || Tim Vincent & Ortis Deley", "| 7 || 6 January 2000 – 23 March 2000 || Ortis Deley & Rhodri Owen", "| 8 || 4 January 2001 – 22 March 2001 ||rowspan=5| Ortis Deley, Rhodri Owen & Angellica Bell", "| 13 || 5 April 2005 – 12 July 2005 || Ortis Deley, Rhodri Owen and Thalia Pellegrini"]}, {"page": "The Gadget Show", "response": ["The Gadget Show is a British television series which focuses on consumer technology. The show, which is broadcast on Channel 5, is currently presented by Craig Charles, Ortis Deley, Jon Bentley and Georgie Barrat.", "For the 17th series, Jason Bradbury and Pollyanna Woodward were joined by Countdown co-presenter Rachel Riley and former Gadget Show presenter Jon Bentley who re-joined the show as chief gadget tester. It was announced that The Gadget Show would return to its more traditional format, with a new studio. On 30 January 2014, it was announced that Ortis Deley would be returning to the show, replacing Pollyanna Woodward. On 25 April 2014, it was announced that Riley would be leaving the show and would be replaced by Olympic skeleton gold medallist, Amy Williams.", "On 17 February 2017, it was announced that Craig Charles and Georgie Barrat would replace Amy Williams and Jason Bradbury for the 25th series and would host alongside Ortis Deley and Jon Bentley. It was also announced that the show would return to a studio base in Birmingham and would air from 10 March 2017 for 12 episodes. The new Gadget Show logo teaser was released on the official Facebook page on 14 February 2017.", "* Ortis Deley (2009–12, 2014–present)"]}, {"page": "SMart", "response": ["|| Ortis Deley"]}, {"page": "Derailed (2005 film)", "response": ["* Ortis Deley as Cop"]}, {"page": "Xchange (TV series)", "response": ["The last edition of Xchange was broadcast on 31 March 2006 ending with Vinnie J Ferret's (the \"J\" initial was also revealed to be \"Jebadiah\") own version of classic song \"My Way\" as \"Our Way\" with a little vocal help from the presenters of the show and Westlea Primary School, particularly Alix Clifford. Michael \"Abs\" Absalom, Ade Adepitan, Ortis Deley, Jez Edwards, Gemma Hunt and puppet \"Vinnie\" the ferret (Dave Chapman) were the show's last presenters. The programme was replaced by Sam and Mark's Level Up."]}, {"page": "Blind Date (British game show)", "response": ["*Ortis Deley (1995)"]}, {"page": "Kidulthood", "response": ["* Ortis Deley as Derek"]}, {"page": "Jon Bentley (TV presenter)", "response": ["As a producer of Top Gear, Bentley helped launch the television careers of Jeremy ClarksonI was there – Jezza's TV debut. Topgear. 1 June 2005 and hired Quentin WillsonA history of motoring on TV. theguardian.com (24 November 2004). Retrieved on 30 November 2013. and Vicki Butler-Henderson. He also has a corner named after him on the Top Gear test track. Bentley presented The Gadget Show on Channel 5 in the United Kingdom, alongside Ortis Deley, Suzi Perry, Pollyanna Woodward and Jason Bradbury."]}, {"page": "Yo Gabba Gabba!", "response": ["*DJ Lance Rock – Lance Robertson (voice dubbed by Ortis Deley in the UK version): A human DJ who is the friend of the Gabba gang and the series' host. He likes to fly."]}, {"page": "List of Live 8 artists", "response": ["*Andi Peters, Andy Townsend, Anouschka Menzies, Barry Killerby, David Beckham, Denis Irwin, Don Austen, Emma Ledden, Emma Forbes, Frank Stapleton, Gareth Southgate, Gary Lineker, Gary McFadden, Harriet Thorpe, Harrison Oldroyd, Heather Suttie, Geoff Hurst, George Cohen, Jack Charlton, Jamie Theakston, Jason McAteer, Jill Greenacre, John Aldridge, John Barrowman, John Eccleston, Julia St. John, Katy Hill, Kenny Cunningham, Kevin Keegan, Kevin Moran, Martin Peters, Matt Le Tissier, Mike Burns, Mitch Johnson, Norman Hunter, Ortis Deley, Packie Bonner, Peter Shilton, Peter Simon, Pippa Haywood, Ray Houghton, Ron Atkinson, Ron Harris, Ronnie Whelan, Russell Porter, Sarah Cawood, Stephen Churchett, Steve Staunton, Steve Wilson, Thomas Sangster, Tim Marriott, Trevor and Simon, Trey Farley & Zoe Ball."]}, {"page": "Ortis", "response": ["* Ortis Deley (born 1973), British television presenter and actor"]}, {"page": "Ernest Bevin College", "response": ["*Ortis Deley, television presenter, radio DJ and actor"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Ortis Deley and Ricky Wilson (Kaiser Chiefs)"]}, {"page": "Gemma Hunt", "response": ["Hunt joined the CBBC continuity team in 2002, since then she has presented on the CBBC Channel and also on BBC One and BBC Two. In 2004, she was noticed by CBBC series Xchange and later became a presenter until its close in 2006. She continued to present CBBC until its revamp in 2007. As well as her presenting duties she has made guest appearances on Blue Peter and Smile. More recently she guest presented the food special of Best of Friends alongside Ortis Deley. She has filmed a series with Barney Harwood for CBBC called Barney's Barrier Reef, which began airing on Monday 12 January 2009 at 7:30 on BBC Two. The show returned for a second series, now entitled Barney's Latin America. She also made a guest appearance live on the CBBC Channel in Office on 5 August 2010.", "| 2008 || Best of Friends || Herself || Guest Presenter alongside Ortis Deley"]}, {"page": "Celebrity Scissorhands", "response": ["On 17 November, five of the celebrities, chosen by a public telephone and text message vote, appeared live in the salon during the Children in Need show. These were Steve Strange, Scott Mills, Darren Day, Michelle Dewberry and Ortis Deley.", "|Ortis Deley"]}, {"page": "Iris Wildthyme (audio drama series)", "response": ["Featuring Ortis Deley as Tom and David Benson as Panda. Artwork for both releases in Series 1 was by Stuart Manning.Stuart Manning Big Finish Covers"]}, {"page": "Wonderful World of Weird", "response": ["Wonderful World Of Weird was a British children's television programme shown on BBC Two. Hosted by Ed Petrie and featuring Ortis Deley, Lizzie Greenwood and Jake Humphrey. It ran for three weeks, from February 2007 to March 2007. It was a game show where contestants tried to find the weirdest thing on their topic .Wonderful World of Weird, BBC website."]}, {"page": "Rick Edwards", "response": ["|Co-presenter with Ortis Deley"]}, {"page": "List of American films of 2005", "response": ["| Derailed || The Weinstein Company || Mikael Håfström (director); Stuart Beattie (screenplay); Clive Owen, Jennifer Aniston, Vincent Cassel, Melissa George, Giancarlo Esposito, Xzibit, RZA, Addison Timlin, Tom Conti, Rachael Blake, Denis O'Hare, Georgina Chapman, David Morrissey, David Oyelowo, Danny McCarthy, Ortis Deley, Richard Leaf, Catherine McCord || Thriller ||"]}, {"page": "The Sorcerer's Apprentice (TV series)", "response": ["The Sorcerer's Apprentice is a children's reality show that originally aired on BBC One with Barney Harwood as host for the first series from 9 to 20 July 2007, it was moved to BBC Two with Ortis Deley as host for series two and three from 25 January to 20 December 2009."]}, {"page": "Ed Petrie", "response": ["|Main host  – with presenters Jake Humphrey, Lizzie Greenwood and Ortis Deley"]}, {"page": "X-periMENTAL", "response": ["X-periMENTAL is a children's game show that aired on BBC One from 8 January 2003 to 1 March 2004. It is first hosted by Ortis Deley in 2003 and then hosted by Simon Grant in 2004."]}, {"page": "Eureka TV", "response": ["The series was the second which aired midway through 2003, it was put off an extra few months than intended because of the new science show X-perimental which was presented by Ortis Deley and Holly Willoughby. In the series there was the addition of Paper and Micro Eureka."]}, {"page": "Celebrity Mastermind", "response": ["| Ortis Deley || Spider-Man Comics || 2nd "]}, {"page": "List of CBBC presenters", "response": ["| Ortis Deley || 2002 ||"]}, {"page": "Let's Sing and Dance", "response": ["| Suzi Perry and Ortis Deley"]}, {"page": "2001 in British television", "response": ["*15 September – The BBC One Saturday morning magazine show Live & Kicking comes to an end after eight series. The final edition is presented by Sarah Cawood, Heather Suttie, Ortis Deley and Trey Farley."]}, {"page": "2000 in British television", "response": ["*7 October – The BBC Saturday morning children's entertainment series Live & Kicking is relaunched, featuring former Blue Peter presenter Katy Hill, Sarah Cawood, Ortis Deley and Trey Farley."]}, {"page": "Nuzzle and Scratch", "response": ["| Played by Ortis Deley"]}]}}