{"wiki_id": "http://www.wikidata.org/entity/Q7108108", "itemLabel": "Oswald Cornwallis", "itemDescription": "English cricketer (1894-1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oswald_Cornwallis", "wikipedia_page": {"main": "Oswald Wykeham Cornwallis  (16 March 1894 – 28 January 1974) was an English Royal Navy officer and amateur cricketer. He was born in 1894 at Linton Park in Kent, the third son of Mabel and Fiennes Cornwallis. His father was the Member of Parliament for Maidstone and would later become a peer. He served in both the First and Second World Wars.\nCornwallis served in the Navy in both world wars, rising to the rank of Captain. He played first-class cricket for the Navy between 1920 and 1926.", "link_mentions": [{"page": "1974", "response": ["* January 28 – Oswald Cornwallis, English cricketer (b. 1894)"]}, {"page": "January 1974", "response": ["**Oswald Cornwallis, 79, English Royal Navy officer and cricketer"]}, {"page": "HMS Scarborough (L25)", "response": ["In the summer of 1931 she was in Newfoundland, then a British dominion, sometimes acting as a yacht to take the Governor around to visit smaller ports. She was on this duty again in 1933 and in 1934 took British Prime Minister Ramsay MacDonald and his daughter up the west coast of Newfoundland to visit the Grenfell Mission at St. Anthony. While a part of the North America and West Indies Squadron in 1933 she visited Prince Edward Island in Canada. There, her then captain, Commander Oswald Cornwallis, his officers and petty officers were entertained by Canadian Senator Creelman MacArthur at his summer home on Foxley River. In her peacetime cruises she was painted in the foreign station colours of white with a buff funnel."]}, {"page": "Wykeham Cornwallis, 2nd Baron Cornwallis", "response": ["His younger brother, Oswald Cornwallis, served in the Royal Navy during the First and Second World Wars and played first-class cricket a few times for the Royal Navy.Cornwallis, Captain Oswald Wyckham, Obituaries in 1974, Wisden Cricketers' Almanack, 1975. Retrieved 2017-05-16. He also played one match for Hampshire in 1921 against Kent with the two brothers on opposing sides. The news of their older brother's death came during the match and both brothers were given leave to miss the majority of the match.Capt Fiennes Wykeham Mann Cornwallis MC, Unidentified contemporary newspaper report published on The Cairo Gang website. Retrieved 2017-05-16.Isaacs V (2000) Three new Hampshire books, CricInfo, 2000-04-30. Retrieved 2017-05-16."]}]}}