{"wiki_id": "http://www.wikidata.org/entity/Q7105738", "itemLabel": "Osbert Mordaunt", "itemDescription": "English cricketer (1876-1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Osbert_Mordaunt_(cricketer,_born_1876)", "wikipedia_page": {"main": "Osbert Cautley Mordaunt   (26 May 1876 – 20 October 1949) played first-class cricket for Somerset between 1905 and 1910 and for various amateur teams in the years up to 1914. He was born at Flax Bourton, Somerset and died at Bells Yew Green, East Sussex.", "link_mentions": [{"page": "Mordaunt", "response": ["*Osbert Mordaunt (cricketer, born 1842) (1842–1923), English cricketer and clergyman", "*Osbert Mordaunt (cricketer, born 1876) (1876–1949), English cricketer", "*Thomas Osbert Mordaunt (1730–1809), British officer and poet"]}, {"page": "Osbert", "response": ["*Osbert Mordaunt (1876-1949), English cricketer"]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Osbert Mordaunt (1905–1910) 14 matches CA"]}, {"page": "William Foord-Kelcey", "response": ["Foord-Kelcey's brother John also played first-class cricket for Oxford University and his nephew Osbert Mordaunt played for Somerset. His son, also named John, was killed in action in July 1916 at the start of the Battle of the Somme during the First World War."]}, {"page": "Gatcombe, Somerset", "response": ["It was the family home of the Somerset Cricketer Osbert Mordaunt and then the family of Charles Clarke, of the Bristol law firm Osborne Clarke. It is now home to Stella Clarke."]}, {"page": "John Foord-Kelcey", "response": ["Foord-Kelcey was born at Smeeth near Ashford, Kent as John Foord, with the family changing its name to Foord-Kelcey in May 1872. He was educated at Chatham House Grammar School, before going up to Pembroke College, Oxford. While studying at Oxford, he made two appearances in first-class cricket for Oxford University in 1883, against the Gentlemen of England at Oxford and the Marylebone Cricket Club at Lord's. Against the Gentlemen of England, he took a five wicket haul with figures of 6 for 58 and took nine wickets in the match overall. He later died at Gloucester in January 1931. His brother, William, and nephew Osbert Mordaunt both played first-class cricket."]}, {"page": "Osbert Mordaunt", "response": ["Osbert Mordaunt is the name of two first-class cricketers:", "* Osbert Mordaunt (cricketer, born 1842) (1842–1923)", "* Osbert Mordaunt (cricketer, born 1876) (1876–1949)"]}]}}