{"wiki_id": "http://www.wikidata.org/entity/Q710883", "itemLabel": "J. B. Gunn", "itemDescription": "Physicist, discoverer of the Gunn effect (1928-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/J._B._Gunn", "wikipedia_page": {"main": "John Battiscombe \"J. B.\" Gunn (13 May 1928 – 2 December 2008), known as Ian or Iain, was a British physicist, who spent most of his career in the United States. He discovered the Gunn effect, which led to the invention of the Gunn diode, the first inexpensive source of microwave power that did not require vacuum tubes. He was born John Battiscombe Gunn, but only used that name in legal documents.", "link_mentions": [{"page": "Microwave", "response": ["The tunnel diode invented in 1957 by Japanese physicist Leo Esaki could produce a few milliwatts of microwave power.  Its invention set off a search for better negative resistance semiconductor devices for use as microwave oscillators, resulting in the invention of the IMPATT diode in 1956 by W.T. Read and Ralph L. Johnston and the Gunn diode in 1962 by J. B. Gunn.  Diodes are the most widely used microwave sources today.  "]}, {"page": "Bayswater", "response": ["*J. B. Gunn, physicist, lived with his mother, the Freudian psychoanalyst L. F. Gunn/Grey-Clarke, at 14 Durham Terrace, in the 1940s"]}, {"page": "Royal Radar Establishment", "response": ["*J. B. Gunn, solid state physicist. At Malvern he worked on the physics of electronic devices. Later, at the IBM Research Laboratories in the U.S., he discovered the Gunn effect used in the Gunn diode."]}, {"page": "Bedford (town), New York", "response": ["*J. B. Gunn, physicist, lived on Guard Hill Rd. in Bedford, but with a Mt. Kisco mailing address"]}, {"page": "IBM Fellow", "response": ["*J. B. Gunn (1971)"]}, {"page": "Gunn diode", "response": ["A Gunn diode, also known as a  transferred electron device (TED), is a form of diode, a two-terminal semiconductor electronic component, with negative resistance, used in high-frequency electronics.  It is based on the \"Gunn effect\" discovered in 1962 by physicist J. B. Gunn.  Its largest use is in electronic oscillators to generate microwaves, in applications such as radar speed guns, microwave relay data link transmitters, and automatic door openers.", "The Gunn diode is based on the Gunn effect, and both are named for physicist J. B. Gunn. At IBM in 1962, he discovered the effect because he refused to accept inconsistent experimental results in gallium arsenide as \"noise\", and determined the cause.  Alan Chynoweth, of Bell Telephone Laboratories, showed in June 1965 that only a transferred-electron mechanism could explain the experimental results."]}, {"page": "Thomas J. Watson Research Center", "response": ["Notable staff have included the mathematicians Benoît Mandelbrot, Ralph E. Gomory, Shmuel Winograd, Alan Hoffman, Don Coppersmith,  Gregory Chaitin, the inventor Robert Dennard, roboticist Matthew T. Mason, author Clifford A. Pickover, computer scientists Frances E. Allen, John Cocke, Stuart Feldman, Ken Iverson, Irene Greif, and Mark N. Wegman, Barry Appelman, Wietse Venema, the 1990 Economics Nobel Prize winner, Harry Markowitz, and physicists Llewellyn Thomas, Rolf Landauer, Charles H. Bennett, Elliott H. Lieb, J. B. Gunn, Leroy Chang, 1973 Physics Nobel Prize winner, Leo Esaki, Jay Gambetta, Uri Sivan, President of the Technion – Israel Institute of Technology, and Zvi Galil,  President of Tel Aviv University."]}, {"page": "Solebury School", "response": ["* J. B. Gunn - Physicist"]}, {"page": "Wendy Wood (artist)", "response": ["Wood was the aunt of both the physicist J. B. Gunn and the musician Spike Hughes, and granddaughter of Samuel Peploe Wood. She was also the sister-in-law of the Egyptologist Battiscombe Gunn and the musician Herbert Hughes."]}, {"page": "List of alumni of Trinity College, Cambridge", "response": ["* J. B. Gunn (1928–2008), physicist; inventor of the Gunn diode"]}, {"page": "John Gunn", "response": ["*J. B. Gunn (1928–2008), discovered the Gunn effect and invented the Gunn diode"]}, {"page": "King Alfred School, London", "response": ["* J. B. Gunn, physicist"]}, {"page": "Battiscombe Gunn", "response": ["He became assistant conservator of the Egyptian Museum in Cairo in 1928, the year in which his son, J. B. Gunn was born.  During the time he lived in Maadi, outside Cairo, he experimented with the manufacture of papyrus, growing the plant in his garden. He beat the sliced papyrus stalks between two layers of linen, and produced successful examples of papyrus, one of which was exhibited in the Egyptian Museum in Cairo.", "After she completed her psychoanalytic training, Meena accompanied Jack while he was working in Egypt, and in 1928, their son J. B. Gunn, known as Iain, (later a physicist) was born in Cairo."]}, {"page": "IEEE Morris N. Liebmann Memorial Award", "response": ["* 1969 – J. B. Gunn"]}, {"page": "John B. Gunn", "response": ["#redirect J. B. Gunn"]}, {"page": "Ridley–Watkins–Hilsum theory", "response": ["Negative resistance oscillations in bulk semiconductors had been observed in the laboratory by J. B. Gunn in 1962,"]}, {"page": "Computer virus", "response": ["An article that describes \"useful virus functionalities\" was published by J. B. Gunn under the title \"Use of virus functions to provide a virtual APL interpreter under user control\" in 1984. The first IBM PC virus in the \"wild\" was a boot sector virus dubbed (c)Brain, created in 1986 by Amjad Farooq Alvi and Basit Farooq Alvi in Lahore, Pakistan, reportedly to deter unauthorized copying of the software they had written. The first virus to specifically target Microsoft Windows, WinVir was discovered in April 1992, two years after the release of Windows 3.0. The virus did not contain any Windows API calls, instead relying on DOS interrupts. A few years later, in February 1996, Australian hackers from the virus-writing crew VLAD created the Bizatch virus (also known as \"Boza\" virus), which was the first known virus to target Windows 95. In late 1997 the encrypted, memory-resident stealth virus Win32.Cabanas was released—the first known virus that targeted Windows NT (it was also able to infect Windows 3.0 and Windows 9x hosts)."]}, {"page": "John Battiscombe Gunn", "response": ["#REDIRECT J. B. Gunn"]}, {"page": "Ian Gunn", "response": [" #REDIRECT J. B. Gunn"]}, {"page": "Daniel Gunn (minister)", "response": ["In 1807, as a consequence of the unrest in Ireland he moved to Ilfracombe in Devon, where he married Catherine Vye in 1808. In 1810 he became pastor of a small congregation there. He removed in 1813 to Bishop's Hull, near Taunton, and in 1814 to Chard. Catherine died there in 1815 and was buried in the graveyard beside the chapel. In 1816, he married his third wife, Elizabeth Tice, and moved to Christchurch (then Hampshire, now Dorset). His younger brother, John Gunn, replaced him as minister at Chard. John's descendants include Battiscombe Gunn and his son J. B. Gunn."]}, {"page": "Index of physics articles (J)", "response": ["*J. B. Gunn"]}, {"page": "Gunn (surname)", "response": ["* J. B. Gunn (1928–2008), British-American physicist, inventor of the Gunn diode"]}, {"page": "Ferrari 375 MM", "response": ["Raced by Bill Spear, owned for over 30 years by physicist J. B. Gunn. "]}, {"page": "Samuel Peploe Wood", "response": ["He is the grandfather of the Scottish nationalist Wendy Wood (1892–1981) and great grandfather of the musician Spike Hughes (1908–1987)Hughes, Spike, Opening Bars – Beginning an Autobiography. London: Pilot Press Ltd (1946). and physicist J. B. Gunn (1928–2008)."]}, {"page": "Valdemar Poulsen Gold Medal", "response": ["* 1973 J. B. Gunn"]}]}}