{"wiki_id": "http://www.wikidata.org/entity/Q711129", "itemLabel": "Terry-Thomas", "itemDescription": "British comedian and character actor (1911-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry-Thomas", "wikipedia_page": {"main": "Terry-Thomas (born Thomas Terry Hoar Stevens; 10 July 1911 – 8 January 1990) was an English comedian and character actor who became internationally known through his films during the 1950s and 1960s. He often portrayed disreputable members of the upper classes, especially cads, toffs and bounders, using his distinctive voice; his costume and props tended to include a monocle, waistcoat and cigarette holder. His striking dress sense was set off by a 1⁄3-inch (8.5 mm) gap between his two upper front teeth.\nBorn in London, he made his film debut, uncredited, in The Private Life of Henry VIII (1933). He spent several years appearing in smaller roles, before wartime service with Entertainments National Service Association (ENSA) and Stars in Battledress. The experience helped sharpen his cabaret and revue act, increased his public profile and proved instrumental in the development of his successful comic stage routine. On his demobilisation, he starred in Piccadilly Hayride on the London stage and was the star of the first comedy series on British television, How Do You View? (1949). He appeared on various BBC Radio shows, and made a successful transition into British films. He appeared in Private's Progress (1956), The Green Man (1956), Blue Murder at St Trinian's (1957), I'm All Right Jack (1959) and Carlton-Browne of the F.O. (1959).\nHe then began appearing in American films, coarsening his already unsubtle screen character in films such as Bachelor Flat (1962), It's a Mad, Mad, Mad, Mad World (1963) and How to Murder Your Wife (1965). From the mid-1960s on he also frequently starred in European films, in roles such as Sir Reginald in the successful French film La Grande Vadrouille. \nIn 1971 he was diagnosed with Parkinson's disease, which slowly brought his career to a conclusion; his last film role was in 1980. He spent much of his fortune on medical treatment and, shortly before his death, was living in poverty, existing on charity from the Actors' Benevolent Fund. A charity gala was held in his honour, which raised sufficient funds for him to live his remaining time in a nursing home.", "link_mentions": [{"page": "List of comedians", "response": ["* Terry-Thomas (1911–1990)"]}, {"page": "Dr. Strangelove", "response": ["According to film critic Alexander Walker, the author of biographies of both Sellers and Kubrick, the role of Group Captain Lionel Mandrake was the easiest of the three for Sellers to play, since he was aided by his experience of mimicking his superiors while serving in the RAF during World War II. There is also a heavy resemblance to Sellers' friend and occasional co-star Terry-Thomas and the prosthetic-limbed RAF flying ace Sir Douglas Bader."]}, {"page": "Cinema of France", "response": ["During this period, French commercial film also made a name for itself. Immensely popular French comedies with Louis de Funès topped the French box office. The war comedy La Grande Vadrouille (1966), from Gérard Oury with Bourvil and Terry-Thomas, was the most successful film in French theaters for more than 30 years. Another example was La Folie des grandeurs with Yves Montand. French cinema also was the birthplace for many subgenres of the crime film, most notably the modern caper film, starting with 1955's Rififi by American-born director Jules Dassin and followed by a large number of serious, noirish heist dramas as well as playful caper comedies throughout the sixties, and the \"polar,\" a typical French blend of film noir and detective fiction."]}, {"page": "Cinema of the United Kingdom", "response": ["The Rank Organisation produced some comedy successes, such as Genevieve (1953). The writer/director/producer team of twin brothers John and Roy Boulting also produced a series of successful satires on British life and institutions, beginning with Private's Progress (1956), and continuing with (among others) Brothers in Law (1957), Carlton-Browne of the F.O. (1958), and I'm All Right Jack (1959). Starring in School for Scoundrels (1960), the British Film Institute thought Terry-Thomas was \"outstanding as a classic British bounder\"."]}, {"page": "July 10", "response": ["*1911 – Terry-Thomas, English comedian and character actor (d. 1990)"]}, {"page": "January 8", "response": ["*  1990   – Terry-Thomas, English actor and comedian (b. 1911)"]}, {"page": "Boulting brothers", "response": ["In the mid-50s the Boultings quickly became identified with \"affectionate\" satires on various British institutions. it started with John's Private's Progress (1956), a look at army life, starring Attenborough, Terry-Thomas and Ian Carmichael and co written by Frank Harvey. It was the second most popular film in Britain in 1956.BRITISH. FILMS MADE MOST MONEY: BOX-OFFICE SURVEY The Manchester Guardian (1901-1959) [Manchester (UK)] 28 December 1956: 3", "They followed it with Lucky Jim (1957), a look at academia from the novel by Kingsley Amis. It starred Carmichael and Terry-Thomas. Brothers in Law (1957) with Carmichael, Attenborough and Thomas, took on the legal profession."]}, {"page": "Peter Sellers", "response": ["Sellers pursued a film career and took a number of small roles such as a police officer in John and Julie (1955). He accepted a larger part in the 1955 Alexander Mackendrick-directed Ealing comedy The Ladykillers in which he starred opposite his idol Alec Guinness, in addition to Herbert Lom and Cecil Parker. Sellers portrayed Harry Robinson, the Teddy Boy; biographer Peter Evans considers this Sellers's first good role. The Ladykillers was a success in both the UK and the US, and the film was nominated for an Academy Award for Best Original Screenplay. The following year Sellers appeared in a further three television series based on The Goons: The Idiot Weekly, Price 2d; A Show Called Fred; and Son of Fred. The shows aired on Britain's new ITV channel. In 1957 film producer Michael Relph, impressed with Sellers's portrayal of an elderly character in Idiot Weekly, cast the 32-year-old actor as a 68-year-old projectionist in Basil Dearden's The Smallest Show on Earth, supporting Bill Travers, Virginia McKenna and Margaret Rutherford. The film was a commercial success and is now thought of as a minor classic of post-war British screen comedy. Following this, Sellers provided the growling voice of Winston Churchill to the BAFTA award-winning film The Man Who Never Was. Later in 1957 Sellers portrayed a television star with a talent for disguises in Mario Zampi's offbeat black comedy The Naked Truth, opposite Terry-Thomas, Peggy Mount, Shirley Eaton and Dennis Price.", "Sellers's difficulties in getting his film career to take off, and increasing problems in his personal life, prompted him to seek periodic consultations with astrologer Maurice Woodruff, who held considerable sway over his later career. After a chance meeting with a North American Indian spirit guide in the 1950s, Sellers became convinced that the music hall comedian Dan Leno, who died in 1904, haunted him and guided his career and life-decisions.  Sellers was a member of the Grand Order of Water Rats, the same exclusive theatrical fraternity founded by Leno in 1890. In 1958 Sellers starred with David Tomlinson, Wilfrid Hyde-White, David Lodge and Lionel Jeffries as a chief petty officer in Val Guest's Up the Creek. Guest later claimed that he had written and directed the film as a vehicle for Sellers, and thus had started Sellers's film career. To practise his voice, Sellers purchased a reel-to-reel tape recorder. The film received critical acclaim in the United States and Roger Lewis viewed it as an important practice ground for Sellers. Next, Sellers featured with Terry-Thomas as one of a pair of comic villains in George Pal's Tom Thumb (1958), a musical fantasy film, opposite Russ Tamblyn, Jessie Matthews and Peter Butterworth. Terry-Thomas later said that \"my part was perfect, but Peter's was bloody awful. He wasn't difficult about it, but he knew it\". The performance was a landmark in Sellers's career and became his first contact with the Hollywood film industry.", "Sellers released his first studio album in 1958 called The Best of Sellers; a collection of comic songs and sketches, including Balham, Gateway to the South, where he plays a variety of comic characters. Produced by George Martin and released on Parlophone, the album reached number three in the UK Albums Chart; The same year, Sellers made his first film with John and Roy Boulting in Carlton-Browne of the F.O., a comedy in which he played a supporting role for the film's lead, Terry-Thomas. Before the release of that film, the Boultings, along with Sellers and Thomas in the cast, started filming I'm All Right Jack, which became the highest-grossing film at the British box office in 1960. In preparation for his role as Fred Kite, Sellers watched footage of union officials. The role earned him a BAFTA, and the critic for The Manchester Guardian believed it was Sellers's best screen performance to date. In between Carlton-Browne of the F.O. and I'm All Right Jack, Sellers starred in The Mouse That Roared, a film in which Jean Seberg also appeared, and was directed by Jack Arnold. He played three distinct leading roles: the elderly Grand Duchess, the ambitious Prime Minister and the innocent and clumsy farm boy selected to lead an invasion of the United States. The film received high praise from critics."]}, {"page": "Patrick Macnee", "response": ["|  Macnee replaced Terry-Thomas."]}, {"page": "The Man from U.N.C.L.E.", "response": ["Woodrow Parfrey appeared five times as a guest performer, although he never received an opening-title credit. Usually cast as a scientist, he played the primary villain in one episode, \"The Cherry Blossom Affair\". Another five-time guest star was Jill Ireland, who at the time was married to David McCallum. Ricardo Montalbán appeared in two episodes as the primary villain. \"The Five Daughters Affair\" featured a cameo appearance by Joan Crawford. Janet Leigh and Jack Palance appeared in \"The Concrete Overcoat Affair\" and Sonny and Cher made an appearance in the third season episode \"The Hot Number Affair\". Other notable guest stars included: Richard Anderson, Eve Arden, Whitney Blake, Joan Blondell, Lloyd Bochner, Judy Carne, Roger C. Carmel, Ted Cassidy, Joan Collins, Walter Coy, Yvonne Craig, Broderick Crawford, Joan Crawford, Kim Darby, Albert Dekker, Ivan Dixon, Chad Everett, Anne Francis, Harold Gould, Grayson Hall, Pat Harrington Jr., James Hong, Allen Jenkins, Patsy Kelly, Richard Kiel, Marta Kristen, Elsa Lanchester, Martin Landau, Angela Lansbury, Herbert Lom, Julie London, Jack Lord, Lynn Loring, Jan Murray, Leslie Nielsen, William Marshall, Eve McVeagh, Carroll O'Connor, David Opatoshu, Leslie Parrish, Eleanor Parker, Slim Pickens, Vincent Price, Dorothy Provine, Cesar Romero, Charles Ruggles, Kurt Russell, Telly Savalas, Nancy Sinatra, Guthrie Thomas, Terry-Thomas, Rip Torn, Fritz Weaver, and Elen Willard (in her last acting appearance)."]}, {"page": "1990", "response": ["** Terry-Thomas, English actor and comedian (b. 1911)"]}, {"page": "Zanni", "response": ["In \"Lazzi of Counting Money\", the Zanni divides Pantalone's money between Pantolone and himself in the following way: \"One for Pantalone, two for me (gives one coin to Pantalone and two to himself); two for Pantalone, three for me (gives one coin to Pantalone and three to himself), etc. \"Gordon, Mel. Lazzi: The Comic Routines of the Commedia dell'arte. First. New York: Performing Arts Journal Publication, 1983.43. Print.In the 1958 film, tom thumb, two characters played by Terry-Thomas and Peter Sellers perform this lazzo."]}, {"page": "Dudley Moore", "response": ["The last significant appearance for the partnership was in 1978's The Hound of the Baskervilles, where Moore played Dr. Watson to Cook's Sherlock Holmes, as well as three other roles: in drag; as a one-legged man; and at the start and end of the film as a flamboyant and mischievous pianist. He also wrote the film's score. Co-star Terry-Thomas described it as \"the most outrageous film I ever appeared in ... there was no magic ... it was bad!\". The film was not a success critically or financially."]}, {"page": "Ibiza", "response": ["The Spanish composer and music theorist Miguel Roig-Francolí was born in Ibiza,Enciclopèdia d'Eivissa i Formentera. \"Roig-Francoli Costa, Miguel Angel\" as was the politician and Spain's former Minister of Foreign Affairs, Abel Matutes.Who's Who at NATO. \"Abel Matutes\" Notable former residents of Ibiza include: Spandau Ballet's Steve Norman, English punk musician John Simon Ritchie (Sid Vicious), comic actor Terry-Thomas,Bounder! The Biography of Terry-Thomas by Graham McCann, serialised in The Times Hungarian master forger Elmyr de Hory, American authors Cormac McCarthy and Clifford Irving."]}, {"page": "Eric Sykes", "response": ["In 1962, Sykes played his first starring film role, being a travelling salesman in the comedy Village of Daughters, set in an Italian village, but featuring a mostly British cast including John Le Mesurier (who was at that time married to Hattie Jacques), and Roger Delgado. This was followed by a supporting role in the MGM British comedy, Kill or Cure, starring Terry-Thomas with a cast of British comedy stalwarts including one of the first film appearances by Ronnie Barker. Both films were made by the same writer-director team behind the popular Margaret Rutherford Miss Marple film, Murder She Said."]}, {"page": "Jeeves", "response": ["* Jeeves was a 1958 LP record issued by Caedmon with Terry-Thomas as Bertie Wooster and Roger Livesey as Jeeves. Side one was the story \"Indian Summer of an Uncle\"; side two was \"Jeeves Takes Charge\". The album was re-released on Harper Audio in 1989."]}, {"page": "Bertie Wooster", "response": ["* Terry-Thomas played Bertie Wooster opposite Roger Livesey as Jeeves in a dramatisation of \"Indian Summer of an Uncle\" and  \"Jeeves Takes Charge\" released as a record album in 1958."]}, {"page": "Finchley", "response": ["* Terry-Thomas (1911–1990), comedian and actor, was born in Finchley."]}, {"page": "Leslie Phillips", "response": ["Demobbed as a lieutenant in December 1944, Phillips' acting career initially took in \"the murkiest rat-infested old playhouses and music halls in the North of England\". It was during the 1950s that he became known for playing amusing English stereotypes. His first lead role in a television serial was in the sitcom My Wife Jacqueline (1952). His seductive voice is his trademark as well as his catchphrases, \"I say, Ding Dong\" (originally the catchphrase of Phillips' character Jack Bell in Carry On Nurse), and \"He-llo\" with a suggestive intonation, which were partly, if not wholly, based on those of fellow actor Terry-Thomas who was also known for playing cads."]}, {"page": "Things to Come", "response": ["* Terry-Thomas, who would become known for his comic acting, has an uncredited appearance as an extra in the film, playing a \"man of the future.\"  It was his seventh film appearance."]}, {"page": "Phil Collins", "response": ["On 9 April 1989, Collins topped the bill at a benefit concert for the veteran English comic actor Terry-Thomas. Held at the Theatre Royal, Drury Lane, the event raised over £75,000 for Terry-Thomas and Parkinson's UK."]}, {"page": "Richard Briers", "response": ["Briers was born on 14 January 1934 in Raynes Park, Surrey, the son of Joseph Benjamin Briers and his second wife Morna Phyllis, daughter of Frederick Richardson, of the Indian Civil Service. He was the first cousin once removed of actor Terry-Thomas (Terry-Thomas was his father's cousin). He spent his childhood at Raynes Park in a flat, Number 2 Pepys Court, behind the now demolished Rialto cinema, and later at Guildford. His father, Joseph Briers, was the son of a stockbroker, of a family of Middlesex tenant farmers; a gregarious and popular man, he contended with a nervous disposition, and drifted between jobs, spending most of his life as a bookmaker but also working as, amongst other things, an estate agent's clerk and a factory worker for an air filter manufacturer, as well as a gifted amateur singer who attended classes at the Guildhall School of Music and Drama. His mother, Morna Briers was a concert pianist and a drama and music teacher, and a member of Equity, who wished for a showbusiness career, having acted in her youth. The couple had met when Joseph Briers asked Morna to stand in for his regular pianist for a performance; by this time his first marriage had collapsed and six months later they had entered a relationship. The family occasionally received money from a wealthy relation, and Briers' maternal grandparents paid for his education, despite not being particularly well-off, and having lived in slightly reduced circumstances in India before returning to England and coming to live at Wimbledon.", "In 2014, BBC Radio 4 broadcast Memories of a Cad, an affectionate comedy drama by Roy Smiles about the relationship between Terry-Thomas and Briers, played by Martin Jarvis and Alistair McGowan respectively. Set in 1984 when he had suffered from Parkinson's disease for many years, Terry-Thomas is delighted by the visit to his home in Ibiza of the much younger Briers, whom he recognises from television, and who proves to be his first cousin once removed. Briers cheers him up by recalling the career the film-star has long forgotten.Afternoon Drama: Memories of a Cad. BBC Radio 4, 30 December 2014. It was re-broadcast in 2016.", "As a result of Terry-Thomas's Parkinson's, Briers became President of Parkinson's UK.Parkinson's annual report 2003 He also helped to launch a Sense-National Deafblind and Rubella Association campaign. Briers was also a non-medical patron of the TOFS (Tracheo-Oesophageal Fistula Support) charity, which supports children and the families of children born unable to swallow."]}, {"page": "Hattie Jacques", "response": ["A second pregnancy led to the birth of a son, Kim, \"who came rollicking and laughing into the world in October 1956, a trifle before his allotted time\", according to Le Mesurier. In June 1956 Jacques appeared in an episode of The Tony Hancock Show on ITV; this led to the role of Hancock's secretary, Griselda Pugh, in the BBC radio series Hancock's Half Hour. She appeared in 16 episodes from November 1956 to February 1957, alongside Hancock and regulars Sidney James, Bill Kerr and Kenneth Williams. Jacques's arrival on Hancock \"provided an additional boost to the series\", according to television historian Richard Webber. She appeared again in five further episodes of Hancock's Half Hour between April and June 1957, and again for a further 20 episodes between January and June 1958, before a special edition on Christmas Day 1958. She spent much of 1958 at the London Palladium, undertaking 380 performances of the revue Large as Life, alongside Terry-Thomas, Eric Sykes and Harry Secombe. She appeared in the sketches \"Concerto for Three Buffoons\" with Secombe and Sykes, \"The Good Old Days\", and the two full company numbers that closed each of the two halves of the show.", "On 29 January 1960 Jacques appeared in the first episode of the BBC comedy series Sykes and a..., co-starring with Eric Sykes as a pair of twins; Richard Wattis and Deryck Guyler were also regulars in the cast. Jacques's character—Hattie (Hat) Sykes—was \"a middle-class, slightly pretentious lady struggling to keep her dignity as the men made fools of themselves\". Sykes and a... went on to run for sixty episodes over nine series during the next five years. According to the media historian Graham McCann, the show was \"one of the best-natured, least pretentious and most successful British sitcoms of the 1960s\". Because of the success, Jacques and Sykes \"became embedded in the public mind as a priceless comic partnership\"; to capitalise, they released a comedy album entitled Eric and Hattie and Things!!!, but it failed to chart. In September 1960 she starred in her second television series, Our House, alongside Charles Hawtrey, Bernard Bresslaw and Joan Sims; Jacques played the librarian Georgina Ruddy, who was forced to keep quiet at work and so made up for it by being extremely noisy at home. Later that year she played minor roles in two films: Watch Your Stern, with many of the Carry On regulars, and School for Scoundrels, opposite Ian Carmichael.  After these her screen time increased with the part of Nanette Parry in Make Mine Mink in which she co-starred with Terry-Thomas and Athene Seyler. She later described this as her favourite film."]}, {"page": "Stuart Whitman", "response": ["June 16, 1965, saw the release of Annakin's Those Magnificent Men in Their Flying Machines. In this British period comedy film, Whitman is featured amongst an international ensemble cast, including Sarah Miles, Robert Morley, Terry-Thomas, James Fox, Red Skelton, Benny Hill, Jean-Pierre Cassel, Gert Fröbe and Alberto Sordi. The film, revolving around the craze of early aviation circa 1910, is about a pompous newspaper magnate (Morley) who is convinced by his daughter (Miles) and fiancée (Fox), a young army officer, to organize an air race from London to Paris. A large sum of money is offered to the winner and it hence attracts a variety of characters who participate. Whitman appears as the American entrant, one of its top participants. The film received positive reviews, in which they said the film was funny, colorful, clever and captured the early enthusiasm for aviation. It was treated as a major production, one of only three full-length 70 mm Todd-AO Fox releases in 1965, with an intermission and musical interlude being part of the original screenings.\"Director's Voice-over Commentary\". Those Magnificent Men in their Flying Machines DVD, 2004. Because of the Todd-AO process, the film was an exclusive roadshow feature initially shown in deluxe Cinerama venues, where customers needed reserved seats purchased ahead of time.Munn (1983), p. 161. The film grossed $31.1 million theatrically and made $29.9 million in home video sales. Audiences, both then and now, have been nearly unanimous in assessing the film as one of the \"classic\" aviation films.Hardwick & Schnepf (1989), p. 58.", "In the same piece, Whitman said that Terry-Thomas was one of his best friends. After their collaboration on Those Magnificent Men in their Flying Machines, both would meet for drinks, visit one another, and swim in the ocean while on Whitman's beachfront home in Malibu."]}, {"page": "John Le Mesurier", "response": ["Following his appearance in Josephine and Men, John and Roy Boulting cast Le Mesurier as a psychiatrist in their 1956 Second World War film, Private's Progress. The cast featured many leading British actors of the time, including Ian Carmichael and Richard Attenborough. Dilys Powell, reviewing for The Sunday Times, thought that the cast was \"embellished\" by Le Mesurier's presence, among others. Later in 1956 Le Mesurier again appeared alongside Attenborough, with small roles in Jay Lewis's The Baby and the Battleship and Roy Boulting's Brothers in Law, the latter of which also featured Carmichael and Terry-Thomas. He was also active in television, in a variety of roles in episodes of Douglas Fairbanks Presents, a series of short dramas."]}, {"page": "1990 in film", "response": ["| style=\"text-align:center;\"| 8 || Terry-Thomas || style=\"text-align:center;\"| 78 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1977 in film", "response": ["| The Last Remake of Beau Geste || Universal Pictures || Marty Feldman (director/screenplay); Sam Bobrick (screenplay); Marty Feldman, Michael York, Ann-Margret, Peter Ustinov, James Earl Jones, Trevor Howard, Henry Gibson, Roy Kinnear, Spike Milligan, Terry-Thomas, Sinéad Cusack, Burt Kwouk, Avery Schreiber, Irene Handl, Hugh Griffith, Stephen Lewis, Ed McMahon, Michael McConkey || Historical, Comedy || Live Action "]}, {"page": "1973 in film", "response": ["*Robin Hood, animated film with voices of Roger Miller, Phil Harris, Andy Devine, Peter Ustinov, Terry-Thomas", "*The Vault of Horror, starring Glynis Johns, Terry-Thomas, Curd Jürgens – (U.K.)"]}, {"page": "1969 in film", "response": ["*Arthur? Arthur!, starring Shelley Winters, Terry-Thomas, Tammy Grimes"]}, {"page": "1966 in film", "response": ["* Don't Look Now, We're Being Shot At (La grande vadrouille), starring Terry-Thomas and Bourvil – (France/U.K.)"]}, {"page": "1962 in film", "response": ["*Bachelor Flat, starring Terry-Thomas, Tuesday Weld, Celeste Holm", "*Operation Snatch, directed by Robert Day and starring Terry-Thomas and George Sanders – (U.K.)"]}, {"page": "1961 in film", "response": ["* His and Hers, directed by Brian Desmond Hurst, starring Terry-Thomas and Janette Scott – (U.K.)"]}, {"page": "1960 in film", "response": ["*Make Mine Mink, starring Terry-Thomas – (U.K.)", "*School for Scoundrels, directed by Robert Hamer, starring Ian Carmichael and Terry-Thomas – (U.K.)"]}, {"page": "1959 in film", "response": ["*Carlton-Browne of the F.O., starring Peter Sellers, Terry-Thomas, John Le Mesurier – (Britain)", "*Too Many Crooks, starring Terry-Thomas and George Cole – (Britain)"]}, {"page": "1958 in film", "response": ["*Tom Thumb, starring Russ Tamblyn and Terry-Thomas – (Britain/US)"]}, {"page": "1957 in film", "response": ["*Blue Murder at St Trinian's, starring Terry-Thomas and Joyce Grenfell – (GB)", "*The Naked Truth, starring Terry-Thomas and Peter Sellers – (GB)"]}, {"page": "1956 in film", "response": ["*The Green Man, starring Alastair Sim, George Cole, Terry-Thomas – (GB)"]}, {"page": "1911 in film", "response": ["*July 14 – Terry-Thomas, actor (died 1990)"]}, {"page": "Mickey Finn (drugs)", "response": ["*In the 1957 black comedy movie The Naked Truth, Peggy Mount plays a character who is one of several victims of blackmail by Dennis Price. Her plot line consists of her attempts to obtain a Mickey Finn to incapacitate the villain, before murdering him. She subsequently uses one on Terry-Thomas a fellow victim she mistakes for the blackmailer.  "]}, {"page": "Godalming", "response": ["In the late 20th century, actor Terry-Thomas, comedic actor Terry Scott, actor Christopher Timothy and the singer Alvin Stardust resided in the town."]}, {"page": "Miles Malleson", "response": ["In 1964, he, Roger Livesey, Terry-Thomas, Rita Webb, Avril Angers, and Judith Furse, recorded 'Indian Summer of an Uncle', and 'Jeeves Takes Charge' for the Caedmon Audio record label, (Caedmon Audio TC-1137-s)."]}, {"page": "From the Earth to the Moon", "response": ["The novel (along with Wells' The First Men in the Moon) inspired the first science fiction film, A Trip to the Moon, made in 1902 by Georges Méliès. In 1958, another film adaptation of this story was released, titled From the Earth to the Moon. It was one of the last films made under the RKO Pictures banner. The story also became the basis for the very loose adaptation Jules Verne's Rocket to the Moon (1967), a caper-style British comedy starring Burl Ives and Terry-Thomas. The 1961 Czechoslovak film The Fabulous Baron Munchausen combines characters and plot elements from the Verne novel with those of the stories of Baron Munchausen and Cyrano de Bergerac."]}, {"page": "Hemel Hempstead", "response": ["By 1962, the redevelopment of the new town as originally envisaged was largely complete, though further expansion plans were then put forward. The nearby United States Air Force base of Bovingdon, which had served as the town's 'de facto' airport, reverted to RAF use at this time, continuing as an active military airfield until 1971. A campus of West Herts College, the library, new police station and the Pavilion (theatre and music venue) were all built during the 1960s. The town seemed to attract its fair share of celebrity openings, with shops and businesses opened by Frankie Vaughan, Benny Hill, Terry-Thomas, and the new cinema was opened by Hollywood star Lauren Bacall. The last of the originally-planned neighbourhoods, Grovehill, began construction in 1967. However, further neighbourhoods of Woodhall Farm and Fields End were later built as part of the extended plans."]}, {"page": "Robert Morley", "response": ["Ken Annakin's Those Magnificent Men in Their Flying Machines was released 16 June 1965. In the British period comedy film, Morley is featured among an international ensemble cast including Stuart Whitman, Sarah Miles, Terry-Thomas, James Fox, Red Skelton, Benny Hill, Jean-Pierre Cassel, Gert Fröbe and Alberto Sordi. The film, revolving around the craze of early aviation circa 1910, is about a pompous newspaper magnate (Morley) who is convinced, by his daughter (Miles) and her fiancé (Fox), to organize an air race from London to Paris. A large sum of money is offered to the winner, hence it attracts a variety of characters who participate. The film received positive reviews, describing it as funny, colourful, clever and having captured the early enthusiasm for aviation. It was treated as a major production, one of only three full-length 70 mm Todd-AO Fox releases in 1965 with an intermission and musical interlude part of the original screenings.\"Director's Voice-over Commentary\". Those Magnificent Men in their Flying Machines DVD, 2004. Because of the Todd-AO process, the film was an exclusive roadshow feature initially shown in deluxe Cinerama venues, where customers needed reserved seats purchased ahead of time.Munn (1983), p. 161. The film grossed $31,111,111 theatrically and on home video $29,950,000. Audience reaction both in first release and even today, is nearly universal in assessing the film as one of the \"classic\" aviation films.Hardwick & Schnepf (1989), p. 58."]}, {"page": "Basil Brush", "response": ["Ivan Owen took great care to ensure that he, personally, never received any publicity. Professionally, only Basil had a public persona, with Owen himself remaining entirely unknown. This helped give the character believability, making Basil appear to be real, since—unlike Harry Corbett and Sooty, for example—the audience never saw the puppeteer. Owen modelled Basil's voice on the actor Terry-Thomas, giving the puppet a touch of well-cultivated class."]}, {"page": "Oliver Reed", "response": ["Reed got his first significant role in Hammer Films' Sword of Sherwood Forest (1960), again directed by Fisher. He went back to small roles for His and Hers (1961), a Terry-Thomas comedy; No Love for Johnnie (1961) for Ralph Thomas; and The Rebel (1961) with Tony Hancock."]}, {"page": "James Fox", "response": ["On 16 June 1965, Ken Annakin's Those Magnificent Men in Their Flying Machines was released. In this British period comedy film, Fox is featured among an international ensemble cast including Stuart Whitman, Sarah Miles, Robert Morley, Terry-Thomas, Red Skelton, Benny Hill, Jean-Pierre Cassel, Gert Fröbe and Alberto Sordi. The film, revolving around the craze of early aviation around 1910, is about a pompous newspaper magnate (Morley) who is convinced by his daughter (Miles) and fiancé (Fox), a young army officer, and they organize an air race from London to Paris, where he decides to race. A large sum of money is offered to the winner, attracting a variety of characters to participate. The film received positive reviews, being described as funny, colourful and clever, and as capturing the early enthusiasm for aviation. It was treated as a major production, one of only three full-length 70 mm Todd-AO Fox releases in 1965 with an intermission and musical interlude part of the original screenings.\"Director's Voice-over Commentary\". Those Magnificent Men in their Flying Machines DVD, 2004. The film was initially an exclusive roadshow presentation shown in deluxe Cinerama venues, where customers needed reserved seats purchased ahead of time.Munn (1983), p. 161. The film grossed $31,111,111 theatrically and on home video $29,950,000. Audience reaction, both in first release and even today, is nearly universal in assessing the film as one of the \"classic\" aviation films.Hardwick & Schnepf (1989), p. 58."]}]}}