{"wiki_id": "http://www.wikidata.org/entity/Q711830", "itemLabel": "Chris Riddell", "itemDescription": "British illustrator and cartoonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Riddell", "wikipedia_page": {"main": "Chris Riddell,  ( rid-EL) (born 13 April 1962) is a South African-born English illustrator and occasional writer of children's books and a political cartoonist for the Observer. He has won three Kate Greenaway Medals - the British librarians' annual award for the best-illustrated children's book, and two of his works were commended runners-up, a distinction dropped after 2002.Books that he wrote or illustrated have won three Nestlé Smarties Book Prizes and have been silver or bronze runners-up four times. On 9 June 2015, he was appointed the UK Children's Laureate.", "link_mentions": [{"page": "Ted Hughes", "response": ["* 1986  Ffangs the Vampire Bat and the Kiss of Truth (illustrated by Chris Riddell)"]}, {"page": "List of children's literature writers", "response": ["*Chris Riddell (born 1962) – The Edge Chronicles, Barnaby Grimes"]}, {"page": "Carnegie Medal (literary award)", "response": ["* * Neil Gaiman, The Graveyard Book (Bloomsbury), 9+ — illustrated separately by Dave McKean and Chris Riddell"]}, {"page": "1962 in literature", "response": ["*April 13 – Chris Riddell, South African-born English children's book illustrator"]}, {"page": "Jackanory", "response": ["In November 2006 Jackanory briefly returned with comedian John Sessions as the revived programme's first narrator reading the Lord of the Rings parody Muddle Earth, written by Paul Stewart (and illustrator Chris Riddell). The second narrator was Sir Ben Kingsley, reading The Magician of Samarkand by Alan Temperley. They were broadcast in three 15-minute slots on CBBC and BBC One and later repeated in their entirety on BBC One on consecutive Sundays. The readings of Muddle Earth were heavily accompanied by animation and featured John Sessions speaking the lines of all the animated characters (and occasionally reading those of Joe whenever he was not on-screen), leading to criticism that the spirit of the original programme, a single voice telling a tale with minimal distractions, had been lost. (The original series had occasionally included dramatised material, in e.g. 1984's Starstormers by Nicholas Fisk, and increasingly so towards the end of its run in the mid-1990s.) The Magician of Samarkand was a similar production, albeit without the actors speaking additional lines; Ben Kingsley read both the story and the lines of all the characters. Both of these stories were produced and directed by Nick Willing."]}, {"page": "John Sessions", "response": ["In 2006, Sessions presented some of the BBC's coverage of The Proms and featured in one of the two Jackanory specials, voicing the characters and playing the storyteller in the audiobook version of Paul Stewart and Chris Riddell's children's book Muddle Earth. In 2007 he appeared in the final episode of the second series of Hotel Babylon, playing hotel owner Donovan Credo, and as Geoffrey Howe in 2009's Margaret. In 2010, he played Kenny Prince in Sherlock."]}, {"page": "Raymond Briggs", "response": ["After briefly pursuing painting, he became a professional illustrator, and soon began working in children's books. In 1958, he illustrated Peter and the Piskies: Cornish Folk and Fairy Tales, a fairy tale anthology by Ruth Manning-Sanders that was published by Oxford University Press. They would collaborate again for the Hamish Hamilton Book of Magical Beasts (Hamilton, 1966). In 1961, Briggs began teaching illustration part-time at Brighton School of Art, which he continued until 1986;Briggs, Raymond – MSN Encarta.  read yourself RAW – Profile: Raymond Briggs   one of his students was Chris Riddell who went on to win three Greenaway Medals. Briggs was a commended runner-up for the 1964 Kate Greenaway Medal (Fee Fi Fo Fum, a collection of nursery rhymes) and won the 1966 Medal for illustrating a Hamilton edition of Mother Goose. According to a retrospective presentation by the librarians, The Mother Goose Treasury \"is a collection of 408 traditional and well loved poems and nursery rhymes, illustrated with over 800 colour pictures by a young Raymond Briggs.\""]}, {"page": "Nestlé Smarties Book Prize", "response": ["* 6–8 years: Ottoline and the Yellow Cat by Chris Riddell (Macmillan Children's Books)", "::* 6–8 years: Hugo Pepper by Paul Stewart and Chris Riddell (Doubleday)", "::* 0–5 years: The Emperor of Absurdia by Chris Riddell (Macmillan)", "::* 6–8 years: Corby Flood by Paul Stewart and Chris Riddell (DoubleDay)", "* 6–8 years: Fergus Crane by Paul Stewart and Chris Riddell (Doubleday)", "4Children Special Award: Fergus Crane by Paul Stewart and Chris Riddell (Doubleday) – selected by after school clubs", "::* 6–8 years: Pirate Diary by Richard Platt, illus. Chris Riddell (Walker Books)"]}, {"page": "List of fictional diseases", "response": ["|The Edge Chronicles by Paul Stewart and Chris Riddell"]}, {"page": "Kate Greenaway Medal", "response": [" |2016||Chris Riddell|| The Sleeper and the Spindle || Neil Gaiman", " | 2004 || Chris Riddell || Jonathan Swift's \"Gulliver\" || Jonathan Swift (1726) adapted ", " | 2001 || Chris Riddell || Pirate Diary: The Journal of Jake Carpenter || Richard Platt (informational)", "Only one illustrator, Chris Riddell, has won three Greenaway Medals. Fourteen other illustrators have won two of the 64 Greenaway Medals awarded through 2021. The first winner of two Medals was John Burningham, 1963 and 1970. The most recent is Sydney Smith in 2018 and 2021.", "Oakley and the Church Mice were highly commended for the second time, the first double recognition for a series (books five and eight). Subsequently, Janet Ahlberg (Jolly Postman series) and Chris Riddell (Diary series) were runners-up for the first books and medalists for the sequels.", ":–  \tChris Riddell, Something Else (Puffin), by Kathryn Cave", "*+ Chris Riddell, Castle Diary: The Journal of Tobias Burgess, Page (Walker), \"transcribed by Richard Platt, illuminated\" by Chris Riddell\"  ", "* Chris Riddell, Pirate Diary: The Journal of Jake Carpenter (Walker), by Richard Platt", "* Chris Riddell, Jonathan Swift's \"Gulliver\" (Walker Books), the 1726 classic Gulliver's Travels adapted by Martin Jenkins", "* Chris Riddell, The Emperor of Absurdia (Pan Macmillan) @", "* Chris Riddell, Ottoline and the Yellow Cat (Pan Macmillan) @", "* Chris Riddell, The Graveyard Book (Bloomsbury), by Neil Gaiman", "* Chris Riddell, Goth Girl and the Ghost of a Mouse (Pan Macmillan)", "* Chris Riddell, The Sleeper and the Spindle (Bloomsbury), by Neil Gaiman", "Chris Riddell became the first triple winner in the history of the award, having previously won in 2001 and 2004.", "* Chris Riddell, A Great Big Cuddle (Walker Books), by Michael Rosen "]}, {"page": "The Edge Chronicles", "response": ["The Edge Chronicles is a children's fantasy novel series by Paul Stewart and Chris Riddell. It consists of four trilogies, plus four additional books, and other books related to the universe (The Edge). The series was originally published by Doubleday, a subsidiary of Penguin Random House,  and has sold more than three million copies, according to its publisher."]}, {"page": "1962 in art", "response": ["* 13 April – Chris Riddell, South African-born English children's book illustrator and political cartoonist"]}, {"page": "Island (disambiguation)", "response": ["* Island (Singer novel), 2015, by Nicky Singer, illustrated by Chris Riddell"]}, {"page": "Children's Laureate", "response": ["|Chris Riddell"]}, {"page": "Training ship", "response": ["* Betty Jeanne, in the novel Fergus Crane by Paul Stewart and Chris Riddell"]}, {"page": "Russell Brand", "response": ["Brand made his children's book debut in November 2014 with Russell Brand's Trickster Tales: The Pied Piper of Hamelin. It is the first instalment of an intended series, featuring illustrations by Chris Riddell. In The Guardian, reviewer Lucy Mangan noted: \"The on-Brand need to be noticed is there on every page, his unwillingness to get out of the way of the story tripping the reader up at every turn\" and adding that Chris Riddell's illustrations \"give the book a beauty it does not deserve and a coherence the text does not deliver\". Nicholas Tucker, in The Independent, was even less impressed, noting the book's \"wearingly offensive\" language, and writing:"]}, {"page": "Paul Stewart (writer)", "response": ["Paul Stewart (born June 1955) is a writer of children's books, best known for three series written in collaboration with the illustrator Chris Riddell: The Edge Chronicles, the Free Lance novels, and the Far Flung Adventures series. Stewart lives in the British seaside city of Brighton with his wife and children.", "==Collaboration with Chris Riddell==", "thumb|left|alt=Chris Riddell, Illustrator, photo.| Riddell in 2010", "Stewart first met Chris Riddell in 1993, through having children at the same school. Riddell was looking for someone to write texts that he could illustrate. Stewart had already had a number of books published. Their first collaborative work were the Rabbit and Hedgehog books (published 1998–2003 by Andersen Press). The inspiration for The Edge Chronicles came from a map Riddell drew of an imaginary world in 1994 and then challenged Stewart to write about it. The first book in the sequence, Beyond the Deepwoods, was commissioned by Transworld Publishers (now part of the Random House Group) on the basis of the map and the first four chapters. The book then took three years to write as Stewart and Riddell worked out both the plot and how best to work together. Originally commissioned as a single book, Stewart and Riddell hoped that it might become a trilogy. The series has now extended to fifteen full-length novels, five short stories, a book of maps and a now-defunct blog called Weird New Worlds. The final book, The Descenders, was released in 2019.", "* Rabbit & Hedgehog Series (all illustrated by Chris Riddell)", "===Fiction co-authored with Chris Riddell===", "*  Audio interview with Paul Stewart and Chris Riddell; Scottish Book Trust, 2009, Retrieved 13 February 2010"]}, {"page": "United Kingdom Literacy Association", "response": ["* 12 to 16 category:  The Graveyard Book by Neil Gaiman and Chris Riddell (illustrator)"]}, {"page": "The Last of the Sky Pirates", "response": ["The Last of the Sky Pirates is a children's fantasy novel by Paul Stewart and Chris Riddell, first published in 2002. It is the fifth volume of The Edge Chronicles and the first of the Rook Saga trilogy; within the stories' own chronology it is the seventh novel, following the Quint Saga and Twig Saga trilogies."]}, {"page": "Vox (Stewart and Riddell novel)", "response": ["Vox is a children's fantasy novel by Paul Stewart and Chris Riddell, first published in 2003. It is the sixth volume of The Edge Chronicles and the second of the Rook Saga trilogy; within the stories' own chronology it is the eighth novel, following the Quint Saga and Twig Saga trilogies.", "The Booksellers Wendy Cooling stated that the novel was just as thrilling as the first novel in The Edge Chronicles series. She added that \"[p]owerful imaginations and creative minds have invented this world and filled it with extraordinary characters\". Marya Jansen-Gruber from Through The Looking Glass Children's Book Reviews felt that it was an engrossing story, commenting that she could not \"help marveling at the way in which Paul Stewart and Chris Riddell together have created a world so full of both darkness and light.\" Several reviewers liked the novels' illustrations, with Maggie Elliott writing in Library Media Collection that the \"detailed illustrations of the creatures add to the enjoyment of the book.\""]}, {"page": "List of editorial cartoonists", "response": ["* Chris Riddell, The Observer"]}, {"page": "List of fantasy novels (A–H)", "response": ["*The Edge Chronicles by Paul Stewart and Chris Riddell"]}, {"page": "Archbishop Tenison's School", "response": ["* Chris Riddell, award-winning illustrator, author, political cartoonist"]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|Chris RiddellGoth Girl and the Ghost of a Mouse"]}, {"page": "List of fictional detectives for younger readers", "response": ["|Ottoline Brown||Chris Riddell||Ottoline and the Yellow Cat (2007)"]}, {"page": "Neil Gaiman bibliography", "response": ["| Skottie Young (US)Chris Riddell (UK)Boulet (France)", "| Chris Riddell", "| Chris Riddell", "| Published with illustrations by Chris Riddell"]}, {"page": "Blue Peter Book Award", "response": ["** Best Book with Facts: Pirate Diary by Richard Platt, illus. Chris Riddell (Walker)", "** Goth Girl and the Fete Worse Than Death by Chris Riddell (Walker)", "** Alienography by Chris Riddell (Macmillan)"]}, {"page": "Beyond the Deepwoods", "response": ["Beyond the Deepwoods is a children's fantasy novel by Paul Stewart and Chris Riddell, first published in 1998. It is the first volume of The Edge Chronicles and of the Twig Saga trilogy.", "Chris Riddell says that \"...the books I loved as a child always had intriguing maps in the front of them... But I always wanted to know what lay beyond the edges of the map - where the heffalumps were, over the Northern Mountains or across the sea to the West. So I drew a world that was, literally, on the Edge, and asked Paul to imagine what happened there.\" Paul Stewart decided to set the first book in an area of the map called the Deepwoods. He was heavily inspired by Grimm's fairy tales, by natural history, and by Riddell's artwork."]}, {"page": "Muddle Earth", "response": ["Muddle Earth is a children's novel by Paul Stewart, published in 2003, and illustrated by Chris Riddell. It is largely a parody of The Lord of the Rings by J. R. R. Tolkien. Like LOTR it is divided into three sections: Englebert the Enormous, Here Be Dragons and Doctor Cuddles of Giggle Glade. In 2011, a sequel titled Muddle Earth Too was published."]}, {"page": "Freeglader", "response": ["Freeglader is a children's fantasy novel by Paul Stewart and Chris Riddell, first published in 2004. It is the seventh volume of The Edge Chronicles and the third of the Rook Saga trilogy; within the stories' own chronology it is the ninth novel, following the Quint Saga and Twig Saga trilogies."]}, {"page": "The Graveyard Book", "response": ["Chris Riddell, who illustrated the British children's edition, made the Kate Greenaway Medal shortlist. It was the first time in the award's 30-year history that one book made both the author and illustrator shortlists.", "The fourth chapter, \"The Witch's Headstone\", was published as a short story in the Gaiman anthology M Is for Magic and in Wizards: Magical Tales from the Masters of Modern Fantasy and won the 2008 Locus Award for Best Novelette.  The book was released on 30 September 2008 in the United States by HarperCollins and on 31 October 2008 in the United Kingdom by Bloomsbury Publishing. The cover and interior illustrations of the US edition were created by longtime Gaiman collaborator Dave McKean; he illustrated the UK edition for the adult market. The simultaneous British Children's Edition was illustrated by Chris Riddell, for which he made the 2010 Greenaway Medal shortlist.", "Chris Riddell made the Greenaway Medal shortlist for his illustrations of the Children's Edition."]}, {"page": "Hampshire Book Awards", "response": ["**Island by Nicky Singer, illustrated by Chris Riddell"]}, {"page": "Booktrust Early Years Award", "response": ["***Chris Riddell, Wendel's Workshop (Macmillan Children's Books)"]}, {"page": "Red House Children's Book Award", "response": ["** Younger Readers: Ottoline and the Yellow Cat by Chris Riddell (Macmillan)"]}, {"page": "Saviour Pirotta", "response": ["Pirotta has collaborated with some of the biggest names in children's illustration today, including Jane Ray, Emma Chichester Clark, Catherine Hyde, Chris Riddell, Chris Mould, Jan Lewis, Alan Marks, Toni Goffe and Richard Johnson."]}, {"page": "Richard Platt (writer)", "response": ["One of Platt's famous books is Pirate Diary: The Journal of Jake Carpenter, illustrated by Chris Riddell (Walker, 2001), a 64-page first-person journal. He won the annual Blue Peter Book Award in category Best Book with Facts BBC Press Office press release 16 December 2003 \"Mortal Engines announced as Blue Peter Book of the Year 2003 \" and Riddell won the annual Kate Greenaway Medal for children's book illustration, the first \"information book\" to win since 1975.(Greenaway Winner 2005). Living Archive: Celebrating the Carnegie and Greenaway Winners. CILIP. Retrieved 2012-07-15.Press Desk (directory). CILIP. Retrieved 2012-07-15. Quote: \"media releases relating to the CILIP Carnegie and Kate Greenaway Children's Book Awards in date order.\" 2002 to 2006 releases concern 2001 to 2005 awards. Platt, Riddell, and Walker had inaugurated the Diary series in 1999 with Castle Diary: The Journal of Tobias Burgess, Page, which Platt calls it \"my first attempt at fiction\". Riddell's work was highly commended for the Greenaway Medal and it was a commercial success. Walker markets the 2011 matching set as \"nonfiction\"."]}, {"page": "Barnaby Grimes", "response": ["The Barnaby Grimes series is written by Paul Stewart and Chris Riddell, and follows the title character of Grimes the \"Tic-tock lad\" (a young courier messenger specialising on very fast deliveries, as he takes the most direct route over the rooftops) and his various adventures - mostly with a supernatural spin to them.", "*Chris Riddell"]}]}}