{"wiki_id": "http://www.wikidata.org/entity/Q712025", "itemLabel": "Arthur Whitten Brown", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Whitten_Brown", "wikipedia_page": {"main": "Lieutenant-Colonel Sir Arthur Whitten Brown,  (23 July 1886 – 4 October 1948) was the navigator of the first successful non-stop transatlantic flight.", "link_mentions": [{"page": "Ice", "response": ["For aircraft, ice can cause a number of dangers. As an aircraft climbs, it passes through air layers of different temperature and humidity, some of which may be conducive to ice formation. If ice forms on the wings or control surfaces, this may adversely affect the flying qualities of the aircraft. During the first non-stop flight across the Atlantic, the British aviators Captain John Alcock and Lieutenant Arthur Whitten Brown encountered such icing conditions – Brown left the cockpit and climbed onto the wing several times to remove ice which was covering the engine air intakes of the Vickers Vimy aircraft they were flying."]}, {"page": "University of Manchester Institute of Science and Technology", "response": ["UMIST was instrumental in the founding of what is now the Museum of Science and Industry in Manchester. Famous alumni include Nobel Laureate in nuclear physics Sir John Cockcroft, aeroplane pioneer Sir Arthur Whitten Brown, and designer of the Lancaster bomber Roy Chadwick, while famous academics include mathematicians Louis Joel Mordell, Hanna Neumann, Lewis Fry Richardson and Robin Bullough, and the physicist Henry Lipson."]}, {"page": "1919", "response": ["* June 14–15 – A Vickers Vimy piloted by John Alcock DSC, with navigator Arthur Whitten Brown, makes the first nonstop transatlantic flight, from St. John's, Newfoundland, to Clifden, Connemara, Ireland."]}, {"page": "List of people on the postage stamps of the Canadian provinces", "response": ["*Arthur Whitten Brown (1919)"]}, {"page": "List of people on the postage stamps of the United Kingdom", "response": ["*Arthur Whitten Brown (1969)"]}, {"page": "Heavy bomber", "response": ["The Vickers Vimy, a long-range heavy bomber powered by two Rolls-Royce Eagle engines, was delivered to the newly formed Royal Air Force too late to see action (only one was in France at time of the Armistice with Germany). The Vimy's intended use was to bomb industrial and railway targets in western Germany, which it could reach with its range of  and a bomb load of just over a ton. The Vickers Vimy is best known as the aircraft that made the first Atlantic crossing from St John's Newfoundland to Clifden in Ireland piloted by the Englishman John Alcock and navigated by Scot Arthur Whitten Brown on June 14, 1919.Andrews, C.F. and Eric B. Morgan. Vickers Aircraft since 1908, Second edition. London: Putnam, 1988. "]}, {"page": "1919 in science", "response": ["** June 14–15 – A Vickers Vimy flown by John Alcock and Arthur Whitten Brown makes the first nonstop transatlantic flight, from St. John's, Newfoundland, to Clifden, Ireland."]}, {"page": "Transatlantic flight of Alcock and Brown", "response": ["Arthur Whitten Brown was born in Glasgow, Scotland in 1886 and shortly afterwards the family moved to Manchester. Known to his family and friends as \"Teddie\", he began his career in engineering before the outbreak of the First World War.", "One of the propellers from the Vickers Vimy was given to Arthur Whitten Brown and hung for many years on the wall of his office in Swansea before he presented it to the RAF College Cranwell. It is believed to have been displayed in the RAF Careers Office in Holborn until 1990. It is believed to be in use today as a ceiling fan in Luigi Malone's Restaurant in Cork, Ireland."]}, {"page": "Curtiss NC-4", "response": ["In May 1919, a crew of United States Navy and US Coast Guard aviators flew the NC-4 from New York State to Lisbon, Portugal, over the course of 19 days. This included time for stops of numerous repairs and for crewmen's rest, with stops along the way in Massachusetts, Nova Scotia (on the mainland), Newfoundland, and twice in the Azores Islands. Then its flight from the Azores to Lisbon completed the first transatlantic flight between North America and Europe, and two more flights from Lisbon to northwestern Spain to Plymouth, England, completed the first flight between North America and Great Britain. This accomplishment was somewhat eclipsed in the minds of the public by the first nonstop transatlantic flight, made by the Royal Air Force pilots John Alcock and Arthur Whitten Brown two weeks later. ", "The feat of making the first transatlantic flight was somewhat eclipsed shortly afterwards by the first nonstop transatlantic flight by John Alcock and Arthur Whitten Brown in a Vickers Vimy biplane, when they flew from Newfoundland to Ireland nonstop on 14–15 June 1919, in 16 hours and 27 minutes. Consequently, Alcock and Brown won a prize of £10,000 offered by the newspaper, Daily Mail, which had been first announced in 1913, and then renewed in 1918, to \"the aviator who shall first cross the Atlantic in an aeroplane in flight from any point in the United States, Canada, or Newfoundland to any point in Great Britain or Ireland, in 72 consecutive hours.\"\"50,000 for Flight across Atlantic.\" The New York Times, 1 April 1913. Retrieved: 12 September 2010.\"£10,000 for first transatlantic flight (in 72 consecutive hours).\" Flight magazine, 21 November 1918, p. 1316. Retrieved: 12 September 2010. The conditions also stipulated that \"only one aircraft may be used for each attempt.\" Hence, there was no possibility of changing to a fresh aircraft in Iceland, Greenland, the Azores, and beyond."]}, {"page": "1926 in aviation", "response": ["* January 30 – Ramón Franco and his crew complete the third and longest leg of their Spain-to-Buenos Aires flight, flying 1,429 miles (2,301 km) from Barrera de Inferno in the Cape Verde Islands to Fernando de Noronha in 12 hours at an altitude of 1,000 feet (305 meters). It is the second-longest nonstop flight in history – exceeded only by a 1,890-mile North Atlantic Ocean crossing in a Vickers Vimy on 14-15 June 1919 by John Alcock and Arthur Whitten Brown – and they become the first aviators to cross the South Atlantic Ocean using only one aircraft. Rough weather forces them to spend the night on their flying boat Plus Ultra before they can dock at Fernando de Noronha."]}, {"page": "1919 in aviation", "response": ["* June 14–15 – Captain John Alcock and Lieutenant Arthur Whitten Brown make the first successful non-stop Atlantic crossing by air, flying a Vickers VimyMondey, David, ed., The Complete Illustrated History of the Worlds Aircraft, Secaucus, New Jersey: Chartwell Books, Inc., 1978, , p. 28. from St. John's, Newfoundland, to Clifden, County Galway, Ireland in 16 hours. They win £10,000 from the Daily Mail and are both knighted."]}, {"page": "John Alcock (RAF officer)", "response": ["Captain Sir John William \"Jack\" Alcock  (5 November 189219 December 1919)United Press, “Trans-Atlantic Aviator And Hero Alcock Is Dead,” Riverside Daily Press, Riverside, California, Friday 19 December 1919, Volume XXXIV, Number 301, page 1. was a Royal Navy and later Royal Air Force officer who, with navigator Lieutenant Arthur Whitten Brown, piloted the first non-stop transatlantic flight from St. John's, Newfoundland to Clifden, Ireland. He died in a flying accident in France in 1919.", "After the war Alcock became a test pilot for Vickers and took up the challenge of attempting to be the first to fly directly across the Atlantic.  Alcock and Arthur Whitten Brown took off from St John's, Newfoundland, at 1:45 pm local time on 14 June 1919, and landed in Derrygimla bog near Clifden, Ireland, 16 hours and 12 minutes later on 15 June 1919 after flying . The flight had been much affected by bad weather, making accurate navigation difficult; the intrepid duo also had to cope with turbulence, instrument failure, and ice on the wings. The flight was made in a modified Vickers Vimy bomber and won a £10,000 prize (£ in ) offered by London's Daily Mail newspaper for the first non-stop flight across the Atlantic."]}, {"page": "Transatlantic flight", "response": ["There were four teams competing for the first non-stop flight across the Atlantic. They were Australian pilot Harry Hawker with observer Kenneth Mackenzie-Grieve in a single-engine Sopwith Atlantic; Frederick Raynham and C. W. F. Morgan in a Martinsyde; the Handley Page Group, led by Mark Kerr; and the Vickers entry John Alcock and Arthur Whitten Brown. Each group had to ship its aircraft to Newfoundland and make a rough field for the takeoff.", "; First non-stop transatlantic flight: On 14–15 June 1919, Capt. John Alcock and Lieut. Arthur Whitten Brown of the United Kingdom in Vickers Vimy bomber, between islands, , from St. John's, Newfoundland, to Clifden, Ireland, in 16h 12m."]}, {"page": "Timeline of aviation – 19th century", "response": ["** 23 July – Arthur Whitten Brown, English aviator (died 1948)"]}, {"page": "Arthur Brown", "response": ["* Arthur Whitten Brown (1886–1948), Scottish aviator"]}, {"page": "Heaton Chapel", "response": ["Sir John Alcock, who with Arthur Whitten Brown, made the first non-stop transatlantic flight in 1919, attended St. Thomas' Primary School in Heaton Chapel alongside the church."]}, {"page": "Arthur Brown (aviator)", "response": ["#redirect Arthur Whitten Brown"]}, {"page": "Barbital", "response": ["Barbital was considered to be a great improvement over the existing hypnotics. Its taste was slightly bitter, but better than the strong, unpleasant taste of the commonly used bromides.  It had few side effects, and its therapeutic dose was far below the toxic dose. However, prolonged usage resulted in tolerance to the drug, requiring higher doses to reach the desired effect. \"I'm literally saturated with it,\" the Russian tsarina Alexandra Feodorovna confessed to a friend. Fatal overdoses of this slow-acting hypnotic were not uncommon. Pioneering aviator Arthur Whitten Brown (of \"Alcock and Brown\" fame) died of an accidental overdose."]}, {"page": "1948 in Wales", "response": ["*4 October – Arthur Whitten Brown, British aviator, in Swansea, 62"]}, {"page": "Charles A. Levine", "response": ["*Arthur Whitten Brown"]}, {"page": "Firswood", "response": ["John Alcock, who along with Arthur Whitten Brown was the first man to fly across the Atlantic Ocean, was born in the lodge of Basford House on Seymour Grove, where his father was the coachman."]}, {"page": "List of aviators", "response": ["* Arthur Whitten Brown"]}, {"page": "1919 in the United Kingdom", "response": ["* 14–15 June – a Vickers Vimy piloted by John Alcock DSC with navigator Arthur Whitten Brown makes the first nonstop transatlantic flight, from St. John's, Newfoundland and Labrador, to Clifden, Connemara, Ireland."]}, {"page": "Slipper launch", "response": ["The original builder of these craft was Andrews Boathouses of Bourne End with the 1913 prototype 'Merk' being designed to be as much like a car as possible (and was named after a Mercedes car). She was designed to be a 'motorists boat' with straight stem, flat sides and flat bottom all designed to minimise wash and to look like the racing cars of the day. This boat, now in the collection of the National Maritime Museum, Cornwall, was owned at one time by Arthur Whitten Brown, famous, with John Alcock, for the first non-stop transatlantic flight in 1919. "]}, {"page": "Alcock Island", "response": ["Alcock Island is an island lying west of Charles Point in Hughes Bay, off the west coast of Graham Land. The name Penguin Island was used for the feature by whalers operating in the area in 1922. Since this name has not been used on published maps and is a duplication of an earlier name, it has been rejected and a new name substituted. Alcock Island is for Sir John W. Alcock (1892–1919), who, with Sir Arthur Whitten Brown, made the first nonstop trans-Atlantic flight on June 14–15, 1919."]}, {"page": "Boulton Paul Atlantic", "response": ["There was great pressure on all teams in early 1919  and the company's management had assembled a large group to observe the first flight which probably led to the disastrous first flight of the Atlantic in April. The Boulton & Paul test pilot Frank Courtney had run up each engine to full power, but separately, not together.  Just after take-off one engine failed and the Atlantic crashed with heavy damage though happily leaving Courtney unharmed.  It turned out that there was a fuel fault which only acted when full flow to both engines was required.  Work on a second Atlantic began using what they could of the second Bourges which had crashed and Boulton & Paul immediately began to adapt it for the crossing.  Before they could complete it, John Alcock and Arthur Whitten Brown had made the first non-stop Atlantic crossing in their Vickers Vimy on 14–15 June 1919 and Boulton & Paul abandoned their preparations.Brew, Boulton Paul Aircraft Tempus Publishing 2001 p 29"]}, {"page": "List of pilots awarded an Aviator's Certificate by the Royal Aero Club in 1912", "response": ["|1892–1919 With Arthur Whitten Brown, first to fly across the Atlantic non-stop. Killed in a flying accident in France in 1919."]}]}}