{"wiki_id": "http://www.wikidata.org/entity/Q7128995", "itemLabel": "Pam Sawyer", "itemDescription": "British-born American lyricist and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Pam_Sawyer", "wikipedia_page": {"main": "Pamela Joan Sawyer (born 1938) is a British songwriter/lyricist, who started writing songs in the mid-1960s and whose credits as a co-writer at Motown included \"Love Child\", \"If I Were Your Woman\", \"My Whole World Ended (The Moment You Left Me)\", and \"Love Hangover\".", "link_mentions": [{"page": "The Rascals", "response": ["The line-up of Brigati on vocals, Cavaliere on organ, Cornish on guitar and Danelli on drums would stay true in the Young Rascals' debut single, the Pam Sawyer/Lori Burton \"I Ain't Gonna Eat Out My Heart Anymore\", which was performed in their first television performance on the program Hullabaloo on February 24, 1966. But the track reached only #23 in Canada and did not reach the Top 40 of the US charts. After \"Eat Out My Heart Anymore\"'s modest success, Cavaliere would assume the lead vocals on their subsequent records, starting with its follow-up \"Good Lovin'\", originally recorded by Lemme B. Good and The Olympics in 1965, with the same arrangement and different lyrics from the original. They performed \"Good Lovin'\" on the Ed Sullivan Show. The Young Rascals version became their first Canada/USA #1. Shortly after, their eponymous debut album was released, mostly composed of garage rock renditions of folk rock (\"Just a Little\" and \"Like a Rolling Stone\"), and soul tunes (\"Mustang Sally\" and \"In the Midnight Hour\"), with only one original, the Cavaliere/Cornish penned \"Do You Feel It\". The Young Rascals reached #15 on the Billboard Top LPs chart and #10 in Cashbox. The album was certified Gold by the RIAA."]}, {"page": "Gloria Jones", "response": ["By then, Jones had recorded other songs for Uptown Records, a subsidiary of Capitol/EMI. Included among these was another Cobb-written song, \"Tainted Love\". So strong was Jones's following in Northern England that she was proclaimed \"The Queen of Northern Soul\".Brown, Lynne (1976). \"Gloria Jones Biography\", EMI Records Press Office, 1. Jones also recorded an album for the Uptown label entitled Come Go with Me which was released in 1966. Jones studied piano, and acquired an advanced classical degree primarily in the works of Bach. In 1968, she joined the cast of Catch My Soul, a rock and soul version of the play Othello, which included cast members Jerry Lee Lewis, The Blossoms, and Dr. John. During the summer of 1968, she performed in a play called Revolution, at the Mark Taper Forum in Los Angeles. That winter, she joined the Los Angeles cast of Hair, the musical. Eventually, she was to meet Pam Sawyer, who asked her to write for Motown Records. Jones and Sawyer were amongst the second string of writers at Motown, but still wrote for such artists as Gladys Knight & the Pips, Commodores, The Four Tops and The Jackson 5. As Jones was also initially a singer for the label, protocol demanded a pseudonym, so for some of her co-writes she used the name LaVerne Ware (not to be confused with another Motown songwriter/producer, Leon Ware).Betts, Graham (2014). Motown Encyclopedia. AC Publishing. ", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer", "|Gloria Jones, Pam Sawyer"]}, {"page": "The Shangri-Las", "response": ["The Shangri-Las were imitated by groups like The Nu-Luvs, who had a hit with \"So Soft, So Warm\", which was originally recorded by the Shangri-Las as \"Dressed In Black\" and used as the b-side to Jay and the Americans' original, \"He Cried\". Others included the Pussycats and the Whyte Boots, who scored big with their single \"Nightmare\", originally intended for the Shangri-Las, and written, produced and performed by Lori Burton and Pam Sawyer. The Goodees had a hit in early 1969 with \"Condition Red\", a \"Leader of the Pack\"-inspired tale about a girl who wants to be with her long-haired, bearded boyfriend despite her parents' objections."]}, {"page": "Love Child (song)", "response": ["This prompted Motown label chief Berry Gordy to hold a special meeting in a room at the Pontchartrain Hotel in Detroit, which was attended by a team of writers and producers at the label, including R. Dean Taylor, Frank Wilson, Pam Sawyer, Deke Richards, and Henry Cosby.  The group, who named themselves The Clan, set to work on a hit single for Diana Ross & the Supremes. Instead of composing another love-based song, the team decided to craft a tune about a woman who is asking her boyfriend not to pressure her into sleeping with him, for fear they would conceive a \"love child.\" The woman, portrayed on the record by Diana Ross, is herself a love child, and, besides not having a father at home, had to endure wearing rags to school and growing up in an \"old, cold, run-down tenement slum.\" The background vocals echo this sentiment, asking the boyfriend to please \"wait/wait won't you wait now/hold on/wait/just a little bit longer.\"", "Category:Songs written by Pam Sawyer"]}, {"page": "Jody Watley", "response": ["In October 2009, an \"International\" version of \"The Makeover' was released in the U.K. to positive reviews. Pete Lewis from Blues & Soul noted her evolution as an artist and performer as being showcased on the album. Further stating Watley being hailed by some, as exemplifying the 21st century recording artist continuing to exercise her own creative path.Lewis, Pete (October 21, 2009), Jody Watley, \"Three's A Crowd, Blues & Soul Magazine Retrieved Oct, 22, 2009 Distinguishable from the original release, The Makeover \"International Edition\" featured new cover art and track listing. New inclusions featured the bossa-soul rendering of Bob Marley’s \"Waiting in Vain\", a sparsely arranged version of Carole King's 1960s ballad \"Will You Still Love Me Tomorrow\", Erasure's anthem \"A Little Respect\", and a reworking of the Diana Ross dance classic \"Love Hangover\". Replacing the downtempo ambient version found on the 2006 \"The Makeover\", Watley recorded the new arrangement originally suggested by songwriter Pam Sawyer, for Ross.Nathan, David (October 2009) Jody Watley, The Makeover International, Soul Music.Com  Retrieved October 22, 2009"]}, {"page": "Janet (album)", "response": ["**\"Love Child\", written by R. Dean Taylor, Frank Wilson, Pam Sawyer, Deke Richards and performed by Diana Ross & the Supremes."]}, {"page": "The Diary of Alicia Keys", "response": ["* \"If I Was Your Woman\" is a cover of \"If I Were Your Woman\" by Gladys Knight & the Pips (written by Gloria Jones, Clarence McMurray, Pam Sawyer)"]}, {"page": "You Want This", "response": ["Category:Songs written by Pam Sawyer"]}, {"page": "Love Hangover", "response": ["Category:Songs written by Pam Sawyer"]}, {"page": "R. Dean Taylor", "response": ["After Holland, Dozier and Holland left Motown, more success for Taylor came as a member of the Motown writing and production team known as \"The Clan\", together with Frank Wilson, Pam Sawyer and Deke Richards. This production group was briefly the prime creator of material for Diana Ross & the Supremes after the Holland / Dozier / Holland team left Motown. Among Taylor's successful co-compositions and co-productions during 1968 and 1969 as a member of The Clan were Diana Ross & the Supremes' No. 1 US hit \"Love Child\" and their Top 10 follow-up hit \"I'm Livin' In Shame\"."]}, {"page": "Get Lifted", "response": ["*\"So High\" contains samples from the composition \"I Don't Need No Reason\" as written by Leon Ware and Pam Sawyer."]}, {"page": "One Day in Your Life (album)", "response": ["|2||4||\"Don't Say Goodbye Again\"||Pam Sawyer, Leon Ware||G.I.T.: Get It Together (1973)||3:22"]}, {"page": "Maybe Tomorrow (The Jackson 5 album)", "response": ["# \"The Wall\" (Mel Larson, Jerry Marcellino, Pam Sawyer) – 3:03"]}, {"page": "Skywriter", "response": ["#\"Touch\" (originally performed by the Supremes) (Pam Sawyer, Frank Wilson) – 3:00"]}, {"page": "G.I.T.: Get It Together", "response": ["#\"Don't Say Goodbye Again\" (Pam Sawyer, Leon Ware) a – 3:24", "#\"It's Too Late to Change the Time\" (Pam Sawyer, Leon Ware) a – 3:57"]}, {"page": "Dancing Machine (album)", "response": ["# \"If I Don't Love You This Way\" (Leon Ware, Pam Sawyer) – 3:28"]}, {"page": "Willennium", "response": ["* \"Freakin' It\" embodies portions of \"Love Hangover\", written by Pam Sawyer and Marilyn McLeod, and performed by Diana Ross; and portions of \"Rapper's Delight\", written by Bernard Edwards and Nile Rodgers."]}, {"page": "Diana & Marvin", "response": ["#\"My Mistake (Was to Love You)\" (Gloria Jones, Pam Sawyer) – 2:55"]}, {"page": "Diana Ross (1976 album)", "response": ["# \"Sorry Doesn't Always Make It Right\" (Single Version) (Michael Masser, Pam Sawyer) – 3:33", "# \"Together\" (Single Version) (Michael Masser, Pam Sawyer) – 3:17"]}, {"page": "Together (The Supremes and the Temptations album)", "response": ["#\"For Better or Worse\" (Pam Sawyer, Joe Hinton) (lead singers: Diana Ross, Eddie Kendricks) 2:37"]}, {"page": "I'm Livin' in Shame", "response": ["Category:Songs written by Pam Sawyer"]}, {"page": "Love Child (The Supremes album)", "response": ["Several different producers and production teams worked on the Love Child LP. Nickolas Ashford & Valerie Simpson, the production team behind the Marvin Gaye & Tammi Terrell hit singles, wrote and produced the album's first single, \"Some Things You Never Get Used To\". The single peaked at number 30 on the Billboard Hot 100, the Supremes' weakest chart showing since 1963. Wanting to improve the group's waning sales, Motown CEO Berry Gordy assembled a team (Frank Wilson, Pam Sawyer, Deke Richards, Henry Cosby, R. Dean Taylor, and Gordy himself)  to create a hit single for The Supremes. The result was \"Love Child\", which returned the Supremes to the Billboard Hot 100's number-one position. Staff producers such as Smokey Robinson, Harvey Fuqua, and Johnny Bristol also contributed to the album."]}, {"page": "Machine Gun (Commodores album)", "response": ["* Producers – James Anthony Carmichael (Tracks 1, 2, 4, 5, 8 & 10); Commodores (Tracks 1, 2, 4, 5, 8 & 10); Jeffrey Bowen and George Tobin (Track 3); Gloria Jones and Pam Sawyer (Tracks 6 & 7); Clayton Ivey and Terry Woodford (Track 9)."]}, {"page": "My Mistake (Was to Love You)", "response": ["\"My Mistake (Was to Love You)\" is a song recorded as a duet by Diana Ross and Marvin Gaye which was the second single released off the singers' duet album Diana & Marvin in February 1974. One of the original songs featured on that album, \"My Mistake (Was to Love You)\" was written by Gloria Jones and Pam Sawyer, the team responsible for the Gladys Knight & the Pips' classic \"If I Were Your Woman\". Pam Sawyer was also the co-writer (with Michael Masser) of the Diana Ross hit \"Last Time I Saw Him\" which dropped out of the Top 40 just prior to the Top 40 debut of \"My Mistake (Was to Love You)\" in March 1974: Sawyer would subsequently co-write (with Marilyn Mcleod) Diana Ross' 1976 #1 hit \"Love Hangover\". The narrative of \"My Mistake (Was to Love You)\" outlines how two lovers' relationship fell apart because the man, according to the woman, felt as if \"a girl loves you, you only call them weak\", while the man admits that he let his lover \"slip through, like grains of sand\".", "Category:Songs written by Pam Sawyer"]}, {"page": "Something to Shout About (album)", "response": ["#\"Try to Understand\" (Lori Burton, Pam Sawyer)"]}, {"page": "The First Night", "response": ["\"The First Night\" is a song recorded by American singer Monica for her second studio album, The Boy Is Mine (1998). It was written by Tamara Savage and Jermaine Dupri, featuring production and additional vocals from the latter. Built around a sample of Diana Ross's 1976 recording \"Love Hangover\", penned by Marilyn McLeod and Pam Sawyer, who share co-writing credits, the song is about the protagonist's battle with sexual temptations on the night of her first date, despite her conflicting emotions and strong sexual desires.", "The song samples the dark, bassy piano chords intro section from American singer Diana Ross's \"Love Hangover\" (1976). Due to its sampling, \"Love Hangover\" writers Marilyn McLeod and Pam Sawyer are credited as co-writers. Recording of \"The First Night\" took place at the Krosswire Studios in Atlanta, and mixing was overseen by Phil Tan and Durpi at the Silent Sound Studios. Dupri performs several ad-libs on \"The First Night\" but is not placed as a featured artist on the track. Monica commented about the song in a 1998 interview with MTV News: \"'The First Night' is not an experience of mine, but it's a record that Jermaine Dupri produced, and of whom I've known a long time...It is basically about a guy making an approach towards a woman on the first date.\"", "* Pam Sawyer – writer", "Category:Songs written by Pam Sawyer"]}, {"page": "Right On (The Supremes album)", "response": ["#\"Take a Closer Look at Me\" (Henry Cosby, Pam Sawyer, Joe Hinton)", "#\"Bill, When Are You Coming Back\" (Pam Sawyer, Johnny Bristol)"]}, {"page": "Cream of the Crop", "response": ["#\"Can't You See It's Me\" (Pam Sawyer, Ivy Jo Hunter, Jack Goga) - 2:33"]}, {"page": "Doctor's Advocate", "response": ["* Pam Sawyer - Composer"]}, {"page": "New Ways but Love Stays", "response": ["# \"I Wish I Were Your Mirror\" (Pam Sawyer, Frank Wilson)"]}, {"page": "I Should Be Proud", "response": ["\"I Should Be Proud\" is a 1970 protest song written by Henry Cosby, Pam Sawyer and Joe Hinton and recorded by Motown girl group Martha and the Vandellas (credited as Martha Reeves & the Vandellas). ", "Category:Songs written by Pam Sawyer"]}, {"page": "Stop in the Name of Love (album)", "response": ["#\"Love Child\" (Henry Cosby, Deke Richards, Pam Sawyer, Frank Wilson, R. Dean Taylor) - 3:06"]}, {"page": "Signed, Sealed & Delivered", "response": ["#\"You Can't Judge a Book by Its Cover\" (Cosby, Pam Sawyer, Wonder) – 2:32"]}, {"page": "Touch (The Supremes album)", "response": ["The album included contributions by several Motown artists and staff writers: \"Here Comes the Sunrise\" by actor-composer Clifton Davis (who had written \"Never Can Say Goodbye\" for The Jackson 5); Billy Page's \"Johnny Raven\" (recorded by Kiki Dee in her 1970 Motown album), and \"Have I Lost You\" by Pam Sawyer and Gloria Jones. Wilson also recorded Jean Terrell's vocals to the backing track of a cover of Laura Nyro's \"Time and Love\" that Bones Howe had produced for Diana Ross, but that was shelved and remained unreleased until 2002."]}, {"page": "Blacknuss", "response": ["#\"Take Me Girl, I'm Ready\" (Johnny Bristol, Pam Sawyer, LaVerne Ware) – 3:18 "]}, {"page": "Henry Cosby", "response": ["| Cosby, Pam Sawyer, Joe Hinton"]}, {"page": "White Hot (album)", "response": ["#\"Ain't Gonna Eat Out My Heart Anymore\" (Lori Burton, Pam Sawyer) – 2:50"]}, {"page": "The Supremes (1975 album)", "response": ["#\"This Is Why I Believe in You\" (Michael B. Sutton, Pam Sawyer) a, b - 3:10"]}]}}