{"wiki_id": "http://www.wikidata.org/entity/Q7128925", "itemLabel": "Pam Cook", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Pam_Cook", "wikipedia_page": {"main": "Pam Cook (born 6 January 1943) is Professor Emerita in Film at the University of Southampton. She was educated at Sir William Perkins's School, Chertsey, Surrey and Birmingham University, where she was taught by Stuart Hall, Richard Hoggart, Malcolm Bradbury, and David Lodge. Along with Laura Mulvey and Claire Johnston, she was a pioneer of 1970s Anglo-American feminist film theory. Her collaboration with Claire Johnston on the work of Hollywood film director Dorothy Arzner provoked debate among feminist film scholars over the following decades.In the mid-1980s, Cook co-authored and edited the leading film studies textbook The Cinema Book for the British Film Institute (BFI). From 1985 to 1994, she was Associate Editor and contributor to the BFI magazines Monthly Film Bulletin and Sight and Sound, before becoming a lecturer at the University of East Anglia. In 1998, she was appointed the first Professor of European Film and Media at the University of Southampton.\nSince her retirement in 2006, she continues to publish books and articles on moving image history and culture. In 2007, she set up the independent campaigning blog bfiwatch to monitor developments at the BFI, and she has extended her work to scholarly videography.", "link_mentions": [{"page": "Nicole Kidman", "response": ["Critics have also commented on her acting style and approach to roles. Sharon Marie Carnicke, a professor of critical studies and acting at the USC School of Dramatic Arts, mentioned that \"Kidman's [acting] choices are believable and natural as reactions to the specific circumstances in her world\" and described her work as \"kinetic\". Dennis Bingham, a professor of English and director of film studies at Indiana University–Purdue University Indianapolis, stated that \"Kidman acts always a step or two outside the character, telegraphing her reactions, elongating the time she takes to articulate her decisions and conclusions. Even her emotional responses are presented as signs.\" Pam Cook, a professor of film at the University of Southampton, suggests in her biography of Kidman that \"her emphasis on artifice and technique points to a conception of screen acting that looks to cinematic expression rather than to the actor's body and intentions for the realisation of character.\" Mary Luckhurst, a professor and head of the University of Bristol School of Arts with credentials in theatre and performance, stated how \"she has strategically pursued a high-risk mutability and versatility, and regularly traverses between naturalist and non-naturalist roles and artforms.\" She continues saying that \"she can continually test her own emotional limits, physical skills, politics, values and frames of reference\" and mentions how \"her conception of character acting involves metamorphosing gradually into something that she feels is so 'other' that she frequently speaks of losing herself or getting lost in the role, and her preparedness to challenge herself in this respect has continually surprised other actors, directors and producers.\""]}, {"page": "Cook (surname)", "response": ["*Pam Cook (born 1943), English film theorist"]}, {"page": "Film studies", "response": ["*Pam Cook"]}, {"page": "The Monthly Film Bulletin", "response": ["* Pam Cook (1985-1991; associate editor and contributor)"]}, {"page": "Women's cinema", "response": ["The experimental and avant-garde cinema is the genre considered to be closer to women filmmakers and one that also advances women themes. Annette Kuhn, for instance, noted such special affinity by citing that low investments of money and 'professionalism' have meant that it is more open than the mainstream film industry for women. Both Pam Cook and Laura Mulvey also noted an alignment and alliance of experimental and avant-garde cinema with feminist interest and feminist politics. Specifically, Mulvey explained that mainstream or Hollywood films are unable to provide the experience of contradiction, reinforcing anti-realism and, this is where the avant-garde cinema is useful for women and feminism because they share \"a common interest in the politics of images and problems of aesthetic language.\""]}, {"page": "Stephanie Rothman", "response": ["\"I was never happy making exploitation films\", said Rothman later. \"I did it because it was the only way I could work.\" However her movies have come to receive much critical appraisal, particularly from feminist writers such as Pam Cook and Claire Johnson. She was honoured with a retrospective at the 2007 Vienna International Film Festival.", "Feminist writers, especially Pam Cook and Claire Johnson, have noted Rothman's role creating feminist films in the exploitation genre. Cook stated that:"]}, {"page": "Sir William Perkins's School", "response": ["*Pam Cook - academic, author, Professor Emerita of film"]}, {"page": "The Cinema Book", "response": ["The Cinema Book is a film studies textbook edited by Pam Cook and first published by the British Film Institute (BFI) in 1985 as a resource for teachers. The first edition was based on the BFI Education Department's collection of film clips for use as study guides. However, at the time there were few film textbooks, and The Cinema Book was an unexpected success. Over the next decade it was adopted by many film studies courses around the world and translated into several languages."]}, {"page": "List of people from Hampshire", "response": ["*Pam Cook, film historian, was born in Farnborough"]}, {"page": "Sex symbol", "response": ["A sex symbol is a person or character widely considered sexually attractive.Pam Cook, \"The trouble with sex: Diana Dors and the Blonde bombshell phenomenon\", In: Bruce Babinigton (ed.), British Stars and Stardom: From Alma Taylor to Sean Connery, pp. 169–171. Quote: \"– the sex symbol is usually defined in terms of her excessive sexuality\""]}, {"page": "Norwich Women's Film Weekend", "response": ["Lastly, and emanating more directly from academic film studies, was a strand which re-examined classical and contemporary Hollywood films to analyse their construction of strong female characters – for instance 1940s films noir such as The Reckless Moment (1949) directed by Max Ophuls. Similarly, the screening of The Student Nurses (1970), an exploitation film directed by Stephanie Rothman and produced by Roger Corman was inspired by the feminist film theorist Pam Cook’s review of the film that read it 'against the grain' and showed how, under the stereotypical representations of sexy 'bimbos', the film actually dealt with crucial women's issues such as abortion, while offering powerful female characters."]}]}}