{"wiki_id": "http://www.wikidata.org/entity/Q712425", "itemLabel": "John Moresby", "itemDescription": "British naval officer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Moresby", "wikipedia_page": {"main": "Rear Admiral John Moresby (15 March 1830 – 12 July 1922) was a British naval officer who explored the coast of New Guinea and was the first European to discover the site of Port Moresby.\n\n", "link_mentions": [{"page": "Port Moresby", "response": ["In the 2011 census, Port Moresby had 364,145 inhabitants. An unofficial 2020 estimate gives the population as 383,000. The place where the city was founded has been inhabited by the Motu-Koitabu people for centuries. The first Briton to see it was Royal Navy Captain John Moresby in 1873. It was named in honour of his father, Admiral of the Fleet Sir Fairfax Moresby.", "There was already an important trade centre on the site of Port Moresby when the English Captain John Moresby of HMS Basilisk first visited it. He sailed through the Coral Sea at the eastern end of New Guinea, saw three previously unknown islands, and landed there. At 10 a.m. on 20 February 1873, he claimed the land for Britain and named it after his father, Admiral Sir Fairfax Moresby. He called the inner reach \"Fairfax Harbour\" and the other Port Moresby."]}, {"page": "List of explorers", "response": ["| John Moresby"]}, {"page": "Blackbirding", "response": ["Some Islanders brought to Fiji against their will demonstrated desperate actions to escape from their situation. Some groups managed to overpower the crews of smaller vessels to take command of these ships and attempt to sail back to their home islands. For example, in late 1871, Islanders aboard Peri being transported to a plantation on a smaller Fijian island, freed themselves, killed most of the crew and took charge of the vessel. Unfortunately, the ship was low in supplies and was blown westward into the open ocean where they spent two months adrift. Eventually, Peri was spotted by Captain John Moresby aboard  near to Hinchinbrook Island off the coast of Queensland. Only thirteen of the original eighty kidnapped Islanders were alive and able to be rescued."]}, {"page": "Fairfax Moresby", "response": ["In August 1814, Moresby married in Malta with Eliza Louisa Williams, youngest daughter of John Williams of Bakewell, Derbyshire: they had two daughters: Ellen Mary (1820-) and Mary (1824-1908), and three sons: Commander Fairfax Moresby (1826–1858) who died in the wreck of the brig HMS Sappho off the coast of Victoria, Matthew Fortescue Moresby (1828-1918), a photographer in Australia, and Rear Admiral John Moresby (1830-1922) who surveyed the coast of New Guinea). A descendant was Admiral Sir Hugo Moresby White, Governor of Gibraltar from 1995 to 1997."]}, {"page": "Mission Beach, Queensland", "response": ["On 26 February 1872, the brig Maria carrying 75 people of a gold prospecting expedition to New Guinea was wrecked upon Bramble Reef. The survivors escaped the sinking ship on 3 boats and 2 rafts. Two of the boats made it safely to the nearest British settlement of Cardwell, but the other three craft were washed up on the shoreline at and around what is now Mission Beach. Up to ten of these crew members, including the captain, were found to have been murdered by Aboriginal people residing in this region. Lieutenant Sabben of the Royal Navy was sent to recover the captain's boat and find any survivors. Upon reaching the beached boat they were attacked by about 120 Aboriginal men. In resisting the attack, 8 native people were killed. Fearing further attacks, Magistrate Brinsley Sheridan, ordered Sub-Inspector Robert Arthur Johnstone of the Native Police \"to inflict decisive punishment\". Johnstone and his troopers were significantly aided by another Royal Navy officer in Captain John Moresby who provided additional armed marines and a large schooner. Moresby described how \"several unfortunate blacks were shot down by the native troopers, who showed an unrestrained ferocity that disgusted our officers\". A six-year-old boy was taken during this raid and sent to England by the \"kind act\" of Lieutenant Francis Hayter. The boy died there from pneumonia three years later."]}, {"page": "Cardwell, Queensland", "response": ["In the late 1860s and early 1870s, Cardwell became a transport hub for prospectors heading to the Etheridge Shire goldfields  inland from the town. Captain John Moresby visited Cardwell in 1871 and wrote that \"various tribes of aborigines roam about the vicinity, and not unnaturally regard the white men, who are rapidly dispossessing them of their homes, as mortal enemies. They ... suffer terrible retaliation at the hands of our countrymen, who employ native troopers, commanded by white men to hunt down and destroy the offenders when the opportunity offers\"."]}, {"page": "D'Entrecasteaux Islands", "response": ["The group was named for the French navigator Antoine Raymond Joseph de Bruni d'Entrecasteaux, who, in his ship the Espérance, passed through the area in 1792 while searching for his missing compatriot, Jean-François de Galaup, comte de La Pérouse.  Almost a century later, in 1874, Captain John Moresby of  made a running survey of the west coast of the islands and became the first European to make landfall."]}, {"page": "Markham River", "response": ["The river was named in 1873 by Captain John Moresby, R.N., in honour of Sir Clements Markham, then Secretary of the Royal Geographical Society. A single-lane steel bridge, 1690 feet long – by far the longest bridge built in Papua until that time – was opened in January 1955. "]}, {"page": "Morobe Province", "response": ["* 1874      John Moresby on HMS Basilisk sails along Huon Gulf and names Parsee Point (Salamaua), the Markham, Rawlinson Ranges, and explores around the Markham mouth. ", "1874 John Moresby on HMS Basilisk sails along Huon Gulf and names Parsee Point (Salamaua), the Markham, Rawlinson Ranges, and explores around the Markham mouth, and meet up with people along the coast; who according to him seem to have met white men before."]}, {"page": "Normanby Island (Papua New Guinea)", "response": ["In 1873, the island was visited by British Captain John Moresby, commanding HMS Basilisk, who named it after the Marquess of Normanby, George Augustus Constantine Phipps, a governor of Queensland, Australia."]}, {"page": "Fergusson Island", "response": ["The island was named by Captain John Moresby after Sir James Fergusson, who was Governor-General of New Zealand from 1873 to 1874."]}, {"page": "Markham Valley", "response": ["The Markham Valley is a geographical area in Papua New Guinea. The name \"Markham\" commemorates Sir Clements Markham, Secretary of the British Royal Geographical Society - Captain John Moresby of the Royal Navy named the Markham River after Sir Clements in the course of his voyage of exploration in HMS Basilisk in 1873."]}, {"page": "Goodenough Island", "response": ["The D'Entrecasteaux Islands have probably been inhabited for several thousand years, the people being related to mainland Papuans. The first sighting of the archipelago by a European was by the French mariner Joseph Antoine Bruni d'Entrecasteaux in 1792Bruni d'Entrecasteaux but it remained unexplored by Europeans until 1874 when Captain John Moresby, commanding HMS Basilisk, landed on the westernmost island and gave it a European name after a British naval colleague, Commodore James Graham Goodenough."]}, {"page": "Samarai", "response": ["The island was discovered by Captain John Moresby whilst commanding HMS Basilisk in 1873. Moresby originally called the island Dinner Island, after having a meal on it. Five years later in 1878 the Rev. S. MacFarlane of the London Missionary Society established a mission station on the island. A government officer was posted to the island after a protectorate had been declared over British New Guinea."]}, {"page": "Allerford", "response": ["The village is also home to Allerford House, childhood home of Admiral John Moresby, who explored the coastline of New Guinea and for whom Port Moresby, the capital city of Papua New Guinea, was named. Other traditional sights in the village include thatched cottages, a forge and an old-fashioned red telephone box. There is also a Reading Room, built by the Acland family to foster adult education."]}, {"page": "L. Adams Beck", "response": ["Elizabeth Louisa \"Lily\" Moresby was born on 1862 in Queenstown, Cork, Ireland, UK, the second child of Irish Jane Willis (Scott) and English John Moresby, a Royal Navy Captain who explored the coast of New Guinea and was the first European to visit the site of Port Moresby, and grand-daughter of Fairfax Moresby.Clara Thomas, Canadian Novelists 1920-1945, Longmans, Green and Company, Toronto, 1946 p. 10-11 She had an elder brother Walter Halliday (9 November 1861 – 24 April 1951), and four younger sisters Ethel Fortescue (1865 - ?), Georgina (23 July 1867 - ?), Hilda Fairfax (16 December 1868 – 16 August 1893) and Gladys Moresby (5 April 1870 - ?). While there is some degree of uncertainty about her birth and early life, some sources suggest that Moresby was born in Queenstown, Ireland (then part of the United Kingdom)."]}, {"page": "Ward Hunt Strait", "response": ["The Ward Hunt Strait is a 30 km wide stretch of water in Milne Bay, separating Papua New Guinea from Goodenough Island in the D'Entrecasteaux Islands. The Dart Reefs and Keast Reef are located in the centre of the channel.Australia/Papua New Guinea - Ward Hunt Strait to Torres Strait (Marine Chart : AU_AU210140) Gps Nautical Charts. The strait was named in honour of George Ward Hunt, First Lord of the Admiralty (1874-1877), by Captain John Moresby."]}, {"page": "Holnicote Estate", "response": ["Selworthy is a small village and civil parish which includes the hamlets of Bossington, Tivington, Lynch, Brandish Street and Allerford. Bossington is separated from Porlock Bay by a shingle beach, through which flows the River Horner, forming part of the Porlock Ridge and Saltmarsh Site of Special Scientific Interest. In the 1990s rising sea levels created salt marshes, and lagoons developed in the area behind the boulder bank. The village is on the South West Coast Path. Selworthy was rebuilt as a model village, to provide housing for the aged and infirm of the Holnicote estate, in 1828 by Sir Thomas Acland. Many of the other cottages, some of which are now rented out, are still thatched and are listed buildings, whose walls are painted with limewash that has been tinted creamy yellow with ochre. On the hill above the village is the whitewashed 15th-century Church of All Saints, with a 14th-century tower. One of Allerford's main attractions is the much-photographed packhorse bridge. Built as a crossing over the River Aller (from which the village gets its name), it is thought to be medieval in origin. The village is also home to Allerford House, childhood home of Admiral John Moresby, who explored the coastline of New Guinea and for whom Port Moresby, the capital city of Papua New Guinea, was named. Other features of the village include thatched cottages, a forge and an old-fashioned red telephone box. There is also a Reading Room, built by the Acland family to foster adult education. One of the thatched cottages operated as the local Primary School between 1821 and 1981 and is now a museum containing the West Somerset Rural Life Museum and Victorian School. The museum houses the West Somerset Photographic Archive."]}, {"page": "Bramston Beach, Queensland", "response": ["In March 1872, after the wreck of The Maria on Bramble reef, one of the groups of survivors landed their raft just to the south of Cooper Point. The Djiru people in the area were exceedingly hospitable in feeding and sheltering this group until Captain John Moresby arrived in the Basilisk to return them to the British settlements further south. This group of survivors spent much of their time at a Djiru village that was located at modern day Bramston Beach. Some Djiru villages in the area consisted of quite large huts with multiple entrances. W.T. Forster, a member of this group of castaways recorded his experiences with the Djiru in a pamphlet published later on in 1872. Forster and some officials returned later to thank the Djiru and give gifts of blankets, but the village was devoid of people due to the Native Police having visited the locality the previous day."]}, {"page": "Australia Station", "response": ["|Undertook survey operations around Eastern New Guinea, under the command of Captain John Moresby. Undertook anti-blackbirding operations in the South Pacific."]}, {"page": "1830 in Australia", "response": ["*John Moresby"]}, {"page": "HMAS Moresby (1963)", "response": ["HMAS Moresby, named for the explorer Captain John Moresby, was a hydrographic survey ship of the Royal Australian Navy (RAN). Serving in the RAN from 1964 to 1998,Wilson, Michael; Royal Australian Navy 21st Century Warships, Naval auxiliaries 1911 to 1999 including Defence Maritime Services, Profile No. 4 - Revised Edition , Topmill Pty Ltd, Marrickville. , p. 37 Moresby was then sold into civilian service. Renamed MV Patricia Anne Hotung, the ship was chartered by the International Organisation for Migration."]}, {"page": "Finschhafen", "response": ["The area was charted by the British navigator Captain John Moresby in 1873–74."]}, {"page": "HMAS Moresby (1918)", "response": ["In 1925, Silvio was the last of five of the 24-class sloops to be converted to survey ships. In the same year, the ship was lent to the Australian Government to replace  and assist  in surveying throughout northern Australian waters, including a navigation channel through the Great Barrier Reef.Frame & Baker, Mutiny!, p. 138 The ship was renamed and recommissioned into the Royal Australian Navy as HMAS Moresby, after John Moresby, on 20 June 1925. She departed England on 28 June, and arrived in Australia in September."]}, {"page": "HMAS Moresby", "response": ["Two ships of the Royal Australian Navy have been named HMAS Moresby, for Captain (later Admiral) John Moresby:"]}, {"page": "Swinger Bay", "response": ["Swinger Bay, is a bay on the north west shore of Milne Bay, Papua New Guinea. Named by John Moresby after HMS Swinger. It is also known as Stringer Bay.\"Stringer\" is the \"approved\" U.S. name with \"Swinger\" the \"variant in the official National Geospatial Intelligence Agency Geonames Search  results. U.S. military records and histories of the war period use \"Stringer\" instead of \"Swinger\" for the bay."]}, {"page": "Porlock Bay, Papua New Guinea", "response": ["Porlock Bay is a bay within Dyke Ackland Bay, Oro Province of Papua New Guinea named by Captain John Moresby after Porlock Bay in Somerset, England."]}, {"page": "Cape Ward Hunt", "response": ["Cape Ward Hunt is a cape on the north coast of Oro Province, Papua New Guinea. The cape was named after George Ward Hunt, First Lord of the Admiralty (1874-1877), by Captain John Moresby."]}, {"page": "Dyke Ackland Bay", "response": ["Dyke Ackland Bay is a large bay in the Oro Province of Papua New Guinea. The bay extends from Cape Nelson to Cape Ward Hunt. Porlock Bay and Oro Bay are some of the smaller bays located within the larger bay. The bay was named by Captain John Moresby after his friend Sir Thomas Dyke Acland."]}, {"page": "HMS Basilisk (1848)", "response": ["After the Crimean War, she served on the North America and West Indies Station and afterwards on the China Station and in Japan. On 27 July 1868, she was driven ashore on the coast of China. Repairs cost £1,777. In March 1871 she commenced service on the Australia Station. The Basilisk under Captain John Moresby visited the Ellice Islands in July 1872."]}, {"page": "HMS Endymion (1865)", "response": ["On 23 February 1876, a private in the Royal Marines serving on board Endymion was court-martialled on a charge of insubordination; he pleaded guilty and was sentenced to two years' imprisonment. On 7 March, a fire broke out in the yard of Humphrys & Pearson Ltd, shipbuilders, located in the Victoria Dock. A range of workshops was destroyed, and the ship Sylph, then under construction, was severely damaged. Her rigging and port side were burnt. Royal Marines from Endymion and  assisted in the firefighting operations. On Ascension Day, a salute was fired by Endymion in honour of the Queen. This caused two windows to fall out of a building in Scale Lane, Hull, injuring two passers-by. On 14 August, a fire broke out at a timber yard in Hull. Crewmen from , Endymion and  assisted the Hull police in fighting the fire. Nine days later, crewmen from Endymion gave assistance at another fire at a timber yard in Drypool. John Moresby took command of Endymion on 29 September 1876."]}, {"page": "Cape Nelson (Papua New Guinea)", "response": ["Cape Nelson is a cape on the north coast of Oro Province, Papua New Guinea. The cape was named by Captain John Moresby in 1874 commanding  after Lord Horatio Nelson."]}, {"page": "Mount Trafalgar", "response": ["Mount Trafalgar is an extinct volcano on the north east coast of Oro Province, Papua New Guinea. The mountain is a major andesite volcano, with the magma known for its high levels of Nickel and Chromium. Captain John Moresby named the mountain after the naval battle of Trafalgar."]}, {"page": "Mount Victory (Papua New Guinea)", "response": ["The mountain is a major andesite volcano, with the magma known for its high levels of Nickel and Chromium. Captain John Moresby named the mountain after . The volcano was used as a beacon due by ships, due to the red crater glow. It last erupted in 1935."]}, {"page": "Moresby (surname)", "response": ["* John Moresby (1830–1922), British admiral"]}, {"page": "History of Lae", "response": ["In 1874 John Moresby on  sails along Huon Gulf and names Parsee Point (Salamaua), the Markham, Rawlinson Ranges, and explores around the Markham mouth."]}, {"page": "Cape Vogel", "response": ["Cape Vogel is a cape on the north coast of Milne Bay Province, Papua New Guinea. It lies adjacent to Ward Hunt Strait and forms the northern point of Goodenough Bay. In 1874, Captain John Moresby, commanding  named the cape after Sir Julius Vogel, the then Premier of New Zealand.Scott p. 128"]}, {"page": "Mourilyan Harbour", "response": ["In 1872, John Moresby, a naval captain as well as hydrographer and explorer, charted Mourilyan Harbour on a coastal patrol in . He named it after one of his officers, Lieutenant T. L. Mourilyan."]}, {"page": "Engineer Islands", "response": ["John Moresby discovered the islands in 1873 and named them in honor of the English Engineers of his steamboat HMS Basilisk.Arthur Wichman (Hrsg.): Entdeckungsgeschichte von Neu-Guinea (bis 1828). Bd. 1, E. J. Brill, Leiden 1909, S. 187 The islands were named after the individual crew members from the engine room: Slade, Skelton, Watts, Butchart, Bright, among others."]}, {"page": "Moresby, Queensland", "response": ["The town takes its name from the Moresby Range, which was named by explorer George Elphinstone Dalrymple after hydrographer Captain John Moresby of HMS Basilisk."]}]}}