{"wiki_id": "http://www.wikidata.org/entity/Q712820", "itemLabel": "Howard Jones", "itemDescription": "English musician, singer and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Jones_(British_musician)", "wikipedia_page": {"main": "John Howard Jones (born 23 February 1955) is a Welsh musician, singer and songwriter. He had ten top 40 hit singles in the UK between 1983 and 1986; six of those 10 singles reached the top ten, including, \"What Is Love?\", \"New Song\", and \"Things Can Only Get Better\". His 1984 album Human's Lib reached number one on the UK Albums Chart. Around the world, Jones had 15 top 40 hit singles between 1983 and 1992.  The 1986 hit single \"No One Is to Blame\" reached no. 4 on the US charts.  Four others placed in the US top 20.\nJones is associated with the 1980s Second British Invasion of the US. He has been described by AllMusic editor Stephen Thomas Erlewine as \"one of the defining figures of mid-'80s synth-pop.\" He performed at the historic Live Aid concert in 1985.\n\n", "link_mentions": [{"page": "Howard Jones (American musician)", "response": ["Howard Jones (born July 20, 1970) is an American metalcore vocalist best known as the former lead singer of Killswitch Engage and Blood Has Been Shed. He is the current vocalist of Light the Torch, formerly known as Devil You Know, and SION with YouTuber/guitarist Jared Dines. Jones is known for his distinctive powerful operatic singing voice and strong unclean vocals.", "Howard Jones is an avid fisherman and owns property on the Red River of the North in Manitoba, Canada. He is a frequent guest on Jamey Jasta's podcast on the GaS Digital Network. Jones left Killswitch Engage in early 2012 to allow himself to manage his type 2 diabetes which was worsened by a hectic touring lifestyle. In 2013, Jones stated that his diabetes put him in a coma for three days."]}, {"page": "Junk Culture", "response": ["Virgin Records had been shocked by the hostile critical and commercial response to experimental predecessor album Dazzle Ships (1983). OMD were compelled to sell more records in order to maintain their deal with the label, and consequently moved in a more radio-friendly direction.Waller, Johnny; Humphreys, Mike. Orchestral Manoeuvres in the Dark: Messages. Sidgwick & Jackson. 1987. . pp. 126–132. Keyboardist Paul Humphreys explained, \"We'd pushed the envelope too far and we were scared. We'd bought houses, had a management company, crew, we had financial responsibilities and we panicked. We decided to rely on our songwriting craft... and write a few hits.\" The band elected not to record in their own Gramophone Suite studio in Liverpool; instead, Humphreys and singer Andy McCluskey wrote and demoed songs separately at home. Neither man satisfied with the results of this new approach, OMD regrouped, working at Highland Studios in Inverness for three weeks. The band trialed some of the new compositions on a September 1983 UK club tour, with Howard Jones as support. Afterwards, they recorded with producer Brian Tench at both Chapel Studios in Lincolnshire, and Mayfair Studios in London. In contrast to the arduous Dazzle Ships era, recording sessions were positive and the group were writing prolifically."]}, {"page": "Human's Lib", "response": ["Human's Lib is the debut album by the British pop musician Howard Jones. It was released in March 1984 and entered the UK Album Charts at the no. 1 spot, spending a total of 57 weeks in the charts. The album has been certified double platinum by the BPI for sales in excess of 600,000 copies.", "In a contemporary review for The Village Voice, music critic Robert Christgau panned Human's Lib as a \"revolving self-help manual\" marred by Jones' \"ressentiment\" and unadorned synth-pop. Mike DeGagne of AllMusic was more favourable in a retrospective review and enthusiastically stated that Human's Lib \"is fueled by the nonstop synth-pop hooks and brightly textured melodies that went on to be a trademark of Howard Jones\".", "All tracks composed by Howard Jones unless indicated otherwise. Track timings are taken from the original UK LP edition.", "*Howard Jones – synthesizers, keyboards, vocals, drum machines, Oberheim DX (track 6), Hammond B3 (track 6)", "Category:Howard Jones (English musician) albums"]}, {"page": "Dream into Action", "response": ["Dream into Action is the second studio album by British pop musician Howard Jones. It was released in March 1985 and reached No. 2 in the UK Album Charts. The album also reached the top ten in the US. The album achieved a gold certification in the UK and platinum status in the US and Canada.", "All songs written and composed by Howard Jones.", "* Howard Jones – Lead vocals, electric pianos, synthesizers, electric bass, synth bass, drums, percussion, drum programming", "Category:Howard Jones (English musician) albums"]}, {"page": "Action Replay (EP)", "response": ["Action Replay is a special six-song EP by British pop musician Howard Jones. It was released only in the United States and Canada to support the single version of Jones' hit \"No One Is to Blame\". Other songs on this release include tracks previously only available in the UK, and a handful of extended remixes. The EP was a substantial hit in North America and on import in Europe.", "Category:Howard Jones (English musician) albums"]}, {"page": "One to One (Howard Jones album)", "response": ["One to One is the third album by British pop singer Howard Jones. It was released in October 1986. The CD release also contains the single version of \"No One Is to Blame\" (a song featured on his previous album) with Phil Collins on drums and backing vocals. The album contains the hits \"You Know I Love You...Don't You?\" (US top twenty) and \"All I Want\" (top 40 in many European countries). The album reached number 10 in the UK.", "All songs written by Howard Jones", "* Howard Jones – vocals, keyboards, synthesizers, drum programming, percussion programming, sequencing", "Category:Howard Jones (English musician) albums"]}, {"page": "Piano Solos (for Friends and Loved Ones)", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "Howard Jones discography", "response": ["This is a discography for the British musician Howard Jones.", "! scope=\"row\" | The Best of Howard Jones", "! scope=\"row\" | The Very Best of Howard Jones", "|rowspan=\"1\"| The Best of Howard Jones", "| \"Slip Away\"(Mohito featuring Howard Jones)", "|Howard Jones - Live In Salt Lake City"]}, {"page": "John Howard Jones", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "Things Can Only Get Better (Howard Jones song)", "response": ["\"Things Can Only Get Better\" was released as the first single from Howard Jones' 1985 album Dream into Action.", "In 2013, French house music artist Cedric Gervais released a song featuring the vocal track from Howard Jones' original song. It too was titled \"Things Can Only Get Better\".", "*The Official Howard Jones Website Discography", "Category:Howard Jones (English musician) songs", "Category:Songs written by Howard Jones (English musician)"]}, {"page": "Revolution Remixed & Surrounded", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "I.G.Y. (What a Beautiful World)", "response": ["\"I.G.Y.\" has been covered by British singer and musician Howard Jones, who included a version on his 1993 greatest hits album The Best of Howard Jones."]}, {"page": "Jones, Howard (musician)", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "Engage (Howard Jones album)", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "Timeline of animal welfare and rights", "response": ["| Happidog, first produced in 1980, is widely considered to be the first vegetarian dog food. Vegetarian pop stars Paul McCartney and Howard Jones have both bought Happidog because \"why love animals called pets and feed them the bodies of other animals called 'food animals'?\"Vegetarian and vegan dog diet"]}, {"page": "Howard Jones (musician)", "response": ["#REDIRECT Howard Jones (British musician)"]}, {"page": "Howard Jones (English musician)", "response": ["#REDIRECT Howard Jones (British musician)"]}]}}