{"wiki_id": "http://www.wikidata.org/entity/Q7123608", "itemLabel": "Paddy Richmond", "itemDescription": "Irish hurler", "wikipedia_url": "https://en.wikipedia.org/wiki/Paddy_Richmond", "wikipedia_page": {"main": "Paddy Richmond (born 1980) is an Irish hurler who played as a left corner-back for the Antrim senior team.Richmond made his first appearance for the team during the 2002 National League and was a regular member of the starting fifteen until his retirement after the 2009 championship. During that time he won one Christy Ring Cup winners' medal, seven Ulster winners' medals and a National League (Division 2) winners' medal.\nAt club level Richmond is a seven-time Ulster medalist with Dunloy. In addition to this he has also won eight county championship winners' medals.", "link_mentions": [{"page": "2004 All-Ireland Senior Hurling Championship", "response": ["|Paddy Richmond"]}, {"page": "Ulster Senior Hurling Championship", "response": ["| Paddy Richmond"]}, {"page": "2008 All-Ireland Senior Hurling Championship", "response": ["|Paddy Richmond"]}, {"page": "Ulster Senior Club Hurling Championship", "response": ["|style=\"text-align:left;\"|Paddy Richmond"]}, {"page": "2001–02 All-Ireland Senior Club Hurling Championship", "response": ["|Paddy Richmond"]}, {"page": "List of Antrim senior hurling team captains", "response": ["|style=\"text-align:left;\"|Paddy Richmond"]}, {"page": "2004 All-Ireland Senior Club Hurling Championship Final", "response": ["Dunloy started the second half under pressure. When Martin Curry was fouled in the area for a penalty, goalkeeper McGee stepped up to blast the sliotar into the back of the net and give his side a boost. The Antrim side then closed the gap between the two sides even further after Ben O'Connor missed a straightforward free while at the other end Paddy Richmond slotted over another point for the Northerners to reduce the deficit to two points. The match was as close as Dunloy were to come as Ben O'Connor, Andy O'Brien and James Bowles all found their range to put Newtown six points ahead before Jerry O'Connor claimed the score of the afternoon as he burst through on a fine solo run. Ben O'Connor increased his personal tally to ten points, while Alan T. O'Brien put the icing on the cake, and his third of the game was to be the final point."]}, {"page": "2006 Christy Ring Cup Final", "response": ["Antrim got off to a flying start with a flurry of goals putting them 3-6 to no score clear. Goals from Joey Scullion (13 minutes), Johnny McIntosh (15) and Kieran Kelly (17) gave them an early lead, while Carlow waited 27-and-a-half minutes before Damien Roberts opened their account with a point. They matched Antrim for the remainder of the half – with Roberts and team captain Robbie Foley swapping points with Paddy Richmond and Brian McFall – to cut the gap to 14 points by half-time."]}]}}