{"wiki_id": "http://www.wikidata.org/entity/Q7123473", "itemLabel": "Paddy Flannery", "itemDescription": "Scottish footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paddy_Flannery", "wikipedia_page": {"main": "Patrick Flannery (born 23 July 1976 in Glasgow) is a Scottish footballer. In his senior career he played for Morton, Dumbarton and Stenhousemuir, before going into Junior football with Linlithgow Rose. On 30 July 2011, Flannery played for Camelon Juniors in a preseason game against his former club Linlithgow. Whilst at Greenock Morton he was farmed out to Beith Juniors for half a season.\nAt Dumbarton, he went on to establish himself as one of the club's top all-time scorers. Flannery was the first player to score at the new Strathclyde Homes Stadium in a competitive fixture, netting in 3–0 win over Elgin City back in December 2000. In November 2012, he signed for junior side Rutherglen Glencairn.On 2 May 2014, Paddy Flannery and John Doyle become co-managers at Cambuslang Rangers. On 25 July 2015, Paddy became manager of local amateur football team Ardrossan Castle Rovers.\n He then became player/manager of South of Scotland League side Mid-Annandale.", "link_mentions": [{"page": "Patrick Flannery", "response": ["* Paddy Flannery (born 1976), Scottish footballer"]}, {"page": "Flannery (disambiguation)", "response": ["* Paddy Flannery (born 1976), British football player"]}, {"page": "List of winners of the Scottish League Two and predecessors", "response": ["|align=left|Steven Ferguson (Ross County)Paddy Flannery (Dumbarton)Neil Tarrant (Ross County)"]}, {"page": "1997–98 Dumbarton F.C. season", "response": ["|  Paddy Flannery"]}, {"page": "2000–01 Dumbarton F.C. season", "response": ["* The League match against Elgin City on 2 December marked Alex Grace's and Paddy Flannery's 100th appearances for Dumbarton in all national competitions - the 118th and 119th Dumbarton players respectively to reach this milestone."]}, {"page": "2003–04 Dumbarton F.C. season", "response": ["|  Paddy Flannery"]}]}}