{"wiki_id": "http://www.wikidata.org/entity/Q712150", "itemLabel": "Luke Donald", "itemDescription": "English professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Donald", "wikipedia_page": {"main": "Luke Campbell Donald MBE (born 7 December 1977) is an English professional golfer who has been the World Number One. He plays mainly on the U.S.-based PGA Tour but is also a member of the European Tour.\nDonald had an outstanding year in 2011, winning several tournaments and awards. He won the PGA Tour money list and European Race to Dubai to complete a historic double, becoming the first player to win both money lists on the PGA and European Tours in the same year. He was named the PGA Player of the Year and the European Tour Golfer of the Year. He also became the first Englishman to win the PGA Tour Player of the Year award, the PGA Tour's Vardon Trophy and the Mark H. McCormack Award for the most weeks at number one during a calendar year. He was later awarded honorary life membership of the European Tour for his achievements in 2011.\nIn May 2011, Donald became the number one golfer in the Official World Golf Ranking after winning the BMW PGA Championship at Wentworth Club. He held the number one position for 40 weeks between May 2011 and March 2012 before Rory McIlroy briefly took over as world number one. The pair then exchanged the number one position a further four times in the following two months. On 27 May 2012, Donald regained the world number one ranking after successfully defending his BMW PGA Championship title. He held the number one position for a further 10 weeks before McIlroy displaced him again. Donald has spent a cumulative total of 56 weeks as the World Number One and has spent over 200 weeks in the top-10. He was awarded an MBE in 2012 for services to golf. Donald has had eight top-10 finishes in major championships, with two third-place finishes. He is one of two golfers to achieve the world number one ranking without winning a major, the other being Lee Westwood.", "link_mentions": [{"page": "December 7", "response": ["*  1977   – Luke Donald, English golfer"]}, {"page": "Luke (given name)", "response": ["*Luke Donald (born 1977), English professional golfer", "*Luke Donald (footballer) (born 1971), Australian rules footballer"]}, {"page": "1977", "response": ["* December 7 – Luke Donald, English golfer"]}, {"page": "Marana, Arizona", "response": ["* In 2007, Marana began hosting the PGA Tour's WGC-Accenture Match Play Championship (now the WGC-Cadillac Match Play Championship). Held in late February, the event included the world's top 64 professional golfers. Henrik Stenson won the inaugural event, and Tiger Woods won in 2008. Geoff Ogilvy won the 2009 event. Ian Poulter won the 2010 event and Luke Donald took the 2011 title. The tournament remained in Marana through 2014. (In September 2014, Cadillac was announced as the new title sponsor for 2015, and the event was moved to San Francisco's TPC Harding Park golf course.)"]}, {"page": "Northfield, Illinois", "response": ["* Luke Donald, professional golfer and former Northfield resident."]}, {"page": "High Wycombe", "response": ["*Luke Donald – former world no.1 golfer, educated at the Royal Grammar School."]}, {"page": "Northwestern University", "response": ["Northwestern alumni involved in athletics include Chicago Bulls and Chicago White Sox owner Jerry Reinsdorf, sprinter Betty Robinson, Rick Sund (NBA), Billy McKinney (NBA), Mark Loretta (MLB), Joe Girardi (MLB), Luis Castillo (NFL), Ernie Adams (NFL), Paddy Driscoll (NFL), Otto Graham (NFL), Anthony Walker Jr. (NFL), Mike Adamle (NFL), Mike Kafka (NFL), Trevor Siemian (NFL), Greg Newsome II (NFL), Luke Johnsos (NFL), six-time Olympic medalist Matt Grevers, Irv Cross (NFL) and PGA Tour star Luke Donald."]}, {"page": "Ernie Els", "response": ["On 2 March 2008, Els won the Honda Classic contested at PGA National's Championship Course in Palm Beach Gardens, Florida. Els shot a final round 67 in tough windy conditions, which was enough to give him the win by one stroke over Luke Donald. The win marked the end of a three and a half-year-long stretch without a win on the PGA Tour for Els. The win was also his 16th victory on the PGA Tour.", "Els started the 2012 season in his home country at the Volvo Golf Champions where he finished in a tie for second place after he and Retief Goosen lost out in a playoff to Branden Grace. Els was next in contention at the Transitions Championship, where he needed a win to qualify for the 2012 Masters.  Els led the tournament for most of the final round and had the lead outright until the 16th hole. However, he finished the tournament bogey-bogey missing a short three-footer on the last hole to make a playoff. The tournament was eventually won by Luke Donald. In April, Els failed to qualify for the Masters for the first time since 1993. He was ranked 58th in the world prior to the tournament (the top 50 are given automatic invitations). Ultimately, Els' unsuccessful bids to qualify for the Masters was viewed as the likely end of his competitiveness on the PGA Tour.", "| Luke Donald"]}, {"page": "Jack Nicklaus", "response": ["Nicklaus turned 65 in January that year, which was the last year he could enter The Open Championship as an exempt player. He played with Luke Donald and Tom Watson in his final round. After hitting his tee shot off the 18th tee in the second round, Nicklaus received a ten-minute standing ovation from the crowd. On the eighteenth fairway, he gave his final farewell to professional golf while standing on the iconic Swilcan Bridge. Soon afterwards, Nicklaus ended his career with a birdie, holing a 15-foot birdie putt on the 18th green. Nicklaus missed the 36-hole cut with a score of +3 (147)."]}, {"page": "Jim Furyk", "response": ["| Luke Donald", "| Bae Sang-moon,  Luke Donald, Robert Garrigus"]}, {"page": "Hemel Hempstead", "response": ["* Luke Donald, (born 1977) golfer, was born in Hemel Hempstead. "]}, {"page": "Kings Langley", "response": ["*Luke Donald (b. 1977), professional golfer and former world no.1 lived in Kings Langley and attended the Rudolph Steiner School"]}, {"page": "Farmers Insurance Open", "response": ["| 2005 ||  Tiger Woods (3) || align=center|272 || align=center|−16 || 3 strokes ||  Luke Donald Charles Howell III Tom Lehman || align=center|864,000 || align=center|4,800,000", "| 2004 ||  John Daly || align=center|278 || align=center|−10 || Playoff ||  Luke Donald Chris Riley || align=center|864,000 || align=center|4,800,000"]}, {"page": "John Daly (golfer)", "response": ["Daly won the Buick Invitational in 2004, and he was also selected as PGA Tour Comeback Player of the Year for 2004. Daly won the tournament in a playoff against Luke Donald and Chris Riley. Daly started using Dunlop golf equipment before this tournament, and the Buick Invitational was his first victory in 189 PGA Tour events. Daly also increased his world golf ranking from 299th to a spot in the Top 50 during this time frame. He ranked 4th overall on the PGA tour for 2004.", "| Luke Donald,  Chris Riley", "| Luke Donald,  Chris Riley"]}, {"page": "Tom Watson (golfer)", "response": ["Watson was one of two players to play with Jack Nicklaus in the final two rounds of golf in Nicklaus' career, which ended at the 2005 Open Championship on the Old Course at St Andrews. Englishman Luke Donald was the third member of the group."]}, {"page": "Sergio García", "response": ["In the 2006 Ryder Cup, at the K Club in Republic of Ireland, García won both his fourball and foursome matches (with José María Olazábal and Luke Donald, respectively) on day one, beating David Toms and Brett Wetterich in the fourballs and Tiger Woods and Jim Furyk in the foursomes. On day two, he paired up with Olazábal again, who won both their matches against Phil Mickelson and Chris DiMarco in both the foursomes and fourballs. Going into the final day in the singles, García was heavily tipped to be the second person to win all their matches in one Ryder Cup; however, Stewart Cink beat him 4 and 3. Europe won the cup again, with 18 points to the United States' 9 points."]}, {"page": "Lee Westwood", "response": ["He has represented Europe in ten Ryder Cups. In October 2010, Westwood became the World number one golfer, ending the reign of Tiger Woods, and becoming the first British golfer since Nick Faldo in 1994 to hold that position. He held the number one position for a total of 22 weeks. Westwood and fellow countryman Luke Donald share the distinction of reaching the number one world ranking despite never winning a major. After the 2021 Open Championship he held the record, that he previously shared with Jay Haas, of playing in the most major championships (88) without winning one.", "In May 2011, Westwood contested a playoff at the BMW PGA Championship with fellow Englishman and at the time world number two Luke Donald. On the par five 18th, Donald hit his approach shot into the green leaving six feet for birdie. Westwood attempted to follow him in close to the hole but got too much backspin on his pitch and the ball spun back into the water hazard. Westwood eventually chipped up from the drop zone and went on to make double bogey. Donald then holed his birdie putt to win the championship and in the process became the new world number one.", "On 31 October 2010, Westwood became the World number one golfer, ending the reign of Tiger Woods. He remained World number one for 17 weeks,Official World Golf Ranking – 31 October 2010 before being replaced by Martin Kaymer who held the top spot for 8 weeks. Westwood regained the number one spot after winning the Indonesian Masters on 24 April 2011 and held it for 5 weeks before being replaced by Luke Donald. He spent over 350 weeks in the top-10.", "In 2018, Thomas Bjørn selected Westwood as one of his five vice-captains for the 2018 Ryder Cup at Le Golf National, alongside Graeme McDowell, Luke Donald, Pádraig Harrington and Robert Karlsson.", "| Luke Donald"]}, {"page": "Royal Grammar School, High Wycombe", "response": ["Its alumni founded the town's local rugby club High Wycombe RUFC, originally known as Old Wycombiensians FC. Sporting alumni include golfer Luke Donald, 2003 Rugby World Cup winner Matt Dawson, 1993 Rugby World Cup Sevens winner Nick Beal., 400 metres hurdles athlete Martin Gillingham, England Hockey Captain Jon Wyatt, and the cricketers Phil Newport and Saif Zaib."]}, {"page": "PGA European Tour", "response": ["|align=center|2011 ||  Luke Donald ||  Tom Lewis ||  Luke Donald"]}, {"page": "2004 in golf", "response": ["*18–21 November: WGC-World Cup – England's team of Paul Casey and Luke Donald won by a stroke over home favorites Spain", "*February 15 - John Daly ends an eight-year winless drought by beating Chris Riley and Luke Donald in the Buick Invitational."]}, {"page": "2004 Ryder Cup", "response": ["| align=left| Luke Donald", "|Luke Donald", "|align=left|Luke Donald || 2.5 || 2–1–1 || 0–1–0 || 2–0–0 || 0–0–1"]}]}}