{"wiki_id": "http://www.wikidata.org/entity/Q7123481", "itemLabel": "Paddy Gormley", "itemDescription": "Northern Irish politician (1916-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paddy_Gormley", "wikipedia_page": {"main": "Patrick Joseph Gormley (1916 – August 2001) was an Irish nationalist politician.\nBorn in Claudy, Gormley was educated at St Columb's College and then St. Patrick's College, Maynooth (NUI). In 1945, he was elected to the Londonderry County Council, representing the Nationalist Party. His brother Tom, soon followed him into politics.At the 1953 election to the Parliament of Northern Ireland, Gormley was elected to represent Mid Londonderry.  In the three subsequent elections, he was elected unopposed. However, his increasing distance from the majority of the Nationalist Party lost him the chance to become Chairman of the Parliamentary Party in 1964, Eddie McAteer instead taking charge.Just before the 1965 election, Gormley was seriously injured in a car accident in Carrickmacross.  Although he was elected, he remained in hospital until January the following year and eventually won an action against the driver of a lorry involved in the crash.Despite his injuries, Gormley stood for Londonderry at the 1966 UK general election.  He took second place, with 37% of the votes cast.  In May 1966, he became Deputy Chairman of Ways and Means and Deputy Speaker of the House of Commons, standing down in February 1967.\nIn 1966, Gormley spoke warmly of Prime Minister of Northern Ireland Terence O'Neill's overtures to nationalists.  He began questioning the party line on issues such as interdenominational schooling, and called for the Nationalist Party to become a centre left radical party.His criticism of more radical nationalists at the start of The Troubles and his limited support for some of Stormont's actions lost him his seat at the 1969 election.", "link_mentions": [{"page": "Maynooth University", "response": ["* Paddy Gormley Nationalist Member of the Northern Ireland parliament."]}, {"page": "Gormley", "response": ["* Paddy Gormley (1916–2001), Irish nationalist politician"]}, {"page": "Ivan Cooper", "response": ["In the 1969 general election, Cooper was elected as an independent member of the Parliament of Northern Ireland for Mid-Londonderry, defeating the sitting Nationalist Party MP, Paddy Gormley."]}, {"page": "Irish Anti-Partition League", "response": ["Conventions were again organised to select candidates for the 1953 Northern Ireland general election. McAteer was selected for Foyle in place of Paddy Maxwell, who had abstentionist tendencies. Most constituencies chose MPs who pledged to attend the Parliament, but McGleenan was again selected in South Armagh, and delegates in Mid Tyrone chose Liam Kelly, a jailed republican. Sitting Nationalist MP Edward McCullagh stood against Kelly, in defiance of the convention, but was narrowly defeated. In Mid Londonderry, Nationalist Paddy Gormley beat the APL candidate. Gormley declared that the APL was now felt to be discredited."]}, {"page": "Patrick Gormley", "response": ["#REDIRECT Paddy Gormley"]}, {"page": "Patrick Joseph Gormley", "response": ["#REDIRECT Paddy Gormley"]}, {"page": "Speaker of the House of Commons of Northern Ireland", "response": ["|Paddy Gormley 1966-1967"]}, {"page": "Mid Londonderry (Northern Ireland Parliament constituency)", "response": ["*1953 – 1969: Paddy Gormley, Nationalist Party", "At the 1958, 1962 and 1965 Northern Ireland general elections, Paddy Gormley was elected unopposed."]}, {"page": "Paddy (given name)", "response": ["*Paddy Gormley (1916–2001), Irish politician"]}]}}