{"wiki_id": "http://www.wikidata.org/entity/Q713091", "itemLabel": "Kane Kramer", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Kane_Kramer", "wikipedia_page": {"main": "Kane Kramer is a British inventor and businessman. He is credited with the initial invention of the digital audio player, in 1979.", "link_mentions": [{"page": "Portable media player", "response": ["British scientist Kane Kramer invented the first digital audio player, which he called the IXI. His 1979 prototypes were capable of approximately one hour of audio playback but did not enter commercial production. His UK patent application was not filed until 1981 and was issued in 1985 in the UK and 1987 in the US.UK Patent 2115996 issued in 1985, and  in 1987 However, in 1988 Kramer's failure to raise the £60,000 required to renew the patent meant it entering the public domain, but he still owns the designs. Apple Inc. hired Kramer as a consultant and presented his work as an example of prior art in the field of digital audio players during their litigation with Burst.com almost two decades later.British Man Says He Invented iPod in 1979 , Fox News Channel, 9 September 2008 In 2008, Apple acknowledged Kramer as the inventor of the digital audio player The player was as big as a credit card and had a small LCD screen, navigation and volume buttons and would have held at least 8MB of data in a solid-state bubble memory chip with a capacity of 3½ minutes' worth of audio. Plans were made for a 10-minute stereo memory card and the system was at one time fitted with a hard drive which would have enabled over an hour of recorded digital music. Later Kramer set up a company to promote the IXI and five working prototypes were produced with 16-bit sampling at 44.1 kilohertz with the pre-production prototype being unveiled at the APRS Audio/Visual trade exhibition in October 1986. However, in 1988 Kramer's failure to raise the £60,000 required to renew the patent meant it entering the public domain, but he still owns the designs."]}, {"page": "List of English inventions and discoveries", "response": ["* 1979: Digital audio player (MP3 Player) invented by Kane Kramer (born 1956). His first investor was Sir Paul McCartney."]}, {"page": "List of British innovations and discoveries", "response": ["*Digital audio player – Kane Kramer"]}, {"page": "Kramer (surname)", "response": ["* Kane Kramer (born 1956), British inventor and businessman"]}, {"page": "IXI (digital audio player)", "response": ["The IXI was the world's first digital audio player.  It was invented by Kane Kramer in 1979."]}]}}