{"wiki_id": "http://www.wikidata.org/entity/Q7131894", "itemLabel": "Panton Corbett", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Panton_Corbett", "wikipedia_page": {"main": "Panton Corbett (c. March 1785 – 22 November 1855) was an English Tory politician from Shropshire.\nHis family was a branch of the Norman Corbet family of Caus. Panton Corbett lived at Longnor Hall in Shropshire and Leighton Hall in Montgomeryshire.He was elected at the 1820 general election as a Member of Parliament (MP) for Shrewsbury, having contested the seat unsuccessfully at a by-election in May 1819. He was re-elected in 1826, but was defeated at the 1830 general election.He was High Sheriff of Shropshire in 1849.His oldest surviving son Edward Corbett (1817–1895) was MP for South Shropshire from 1868 to 1877.", "link_mentions": [{"page": "Shrewsbury (UK Parliament constituency)", "response": ["|rowspan=\"2\"|Panton Corbett ||rowspan=\"2\"| Tory"]}, {"page": "Corbett (surname)", "response": ["* Panton Corbett, MP (1785–1855)"]}, {"page": "Edward Corbett (politician)", "response": ["Corbett was the oldest surviving son of Panton Corbett of Longnor Hall in Shropshire and Leighton Hall in Montgomeryshire. His mother was Louisa Favoretta Jones, from Lichfield in Staffordshire, and his father had been the Member of Parliament (MP) for Shrewsbury from 1820 to 1830."]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|rowspan=\"2\"|Shrewsbury(two members)||Panton Corbett||Tory"]}, {"page": "Panton (surname)", "response": ["*Panton Corbett, English politician"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|Panton Corbett||Tory"]}, {"page": "Uvedale Corbett", "response": ["* Uvedale Corbett, barrister, son of Archdeacon Joseph Corbett of Longnor, Shropshire and brother of Panton Corbett"]}, {"page": "George FitzGeorge Hamilton", "response": ["Through his father, FitzGeorge Hamilton was a grandson of Sir Edward Archibald Hamilton, 4th Baronet of Trebinshun House and 2nd Baronet of Marlborough House, and his wife Mary Elizabeth Gill. Also through his father, FitzGeorge Hamilton was a direct descendant of William Hamilton, one of the five Kentish Petitioners of 1701. FitzGeorge Hamilton was a great-great-grandson of both Admiral Sir Edward Hamilton, 1st Baronet (1772–1851) and Member of Parliament Panton Corbett (1785–1855) of the Corbet family. He was also a direct male-line descendant of James Hamilton, 1st Earl of Abercorn (1575–1618), and he was descended from James II of Scotland through his daughter Mary Stewart, Countess of Arran."]}]}}