{"wiki_id": "http://www.wikidata.org/entity/Q713398", "itemLabel": "Edward Belcher", "itemDescription": "British naval officer, hydrographer and explorer (1799-1877)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Belcher", "wikipedia_page": {"main": "Admiral Sir Edward Belcher  (27 February 1799 – 18 March 1877) was a British naval officer, hydrographer, and explorer. Born in Nova Scotia, he was the great-grandson of Governor Jonathan Belcher. He was briefly married to Diana Jolliffe, stepdaughter of Captain Peter Heywood; that marriage ending upon her application for legal separation for his having infected her with venereal disease.", "link_mentions": [{"page": "February 27", "response": ["*1799 – Edward Belcher, British naval officer, hydrographer, and explorer (d. 1877)"]}, {"page": "Northwest Passage", "response": ["McClure's ship was trapped in the ice for three winters near Banks Island, at the western end of Viscount Melville Sound. Finally McClure and his crew—who were by that time dying of starvation—were found by searchers who had travelled by sledge over the ice from a ship of Sir Edward Belcher's expedition. They rescued McClure and his crew, returning with them to Belcher's ships, which had entered the Sound from the east. McClure and his crew returned to England in 1854 on one of Belcher's ships. They were the first people known to circumnavigate the Americas and to discover and transit the Northwest Passage, albeit by ship and by sledge over the ice. (Both McClure and his ship were found by a party from HMS Resolute, one of Belcher's ships, so his sledge journey was relatively short. HMS Resolute had to be abandoned in the ice on that journey. It was later found again and became quite famous.)"]}, {"page": "1799", "response": ["* February 27 – Edward Belcher, British admiral (d. 1877)"]}, {"page": "Belcher Islands", "response": ["Before 1914, English-speaking cartographers knew very little about the Belcher Islands, which they showed on maps as specks, much smaller than their true extent. In that year a map showing them, drawn by George Weetaltuk,George Weetaltuk (ca. 1862–1956) came into the hands of Robert Flaherty, and cartographers began to represent them more accurately. The islands are named for Royal Navy Admiral Sir Edward Belcher (1799-1877)."]}, {"page": "William Henry Smyth", "response": ["He was the author of many works, the best known of which are: The Cycle of Celestial Objects for the use of Naval, Military, and Private Astronomers (1844), for which he was awarded the gold medal of the Royal Astronomical Society; The Mediterranean: a Memoir Physical, Historical, and Nautical (1854); and The Sailor's Word-Book (1867), an invaluable dictionary of nautical terms which as well as sail covers the early years of steam propulsion.Revised and edited by his friend Sir Edward Belcher He also translated and edited François Arago's treatises on Popular Astronomy and on Comets.The complete story of his literary activity is contained in Synopsis of the published and privately printed Works of Admiral W. H. Smyth (1864), which enumerates his fugitive papers as well as his larger works."]}]}}