{"wiki_id": "http://www.wikidata.org/entity/Q7145573", "itemLabel": "Patricia Fara", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Patricia_Fara", "wikipedia_page": {"main": "Patricia Fara is a historian of science at the University of Cambridge.  She is a graduate of the University of Oxford and did her PhD at the University of London. She is a former Fellow of Darwin College and is an Emeritus Fellow of Clare College where she was previously Director of Studies in the History and Philosophy and Science. Fara was also a College Teaching Officer in the Department of History and Philosophy of Science. From 2016 to 2018 Fara was President of the British Society for the History of Science. In 2016 she became President of the Antiquarian Horological Society. Fara is author of numerous popular books on the history of science and has been a guest on BBC Radio 4's science and history discussion series, In Our Time.", "link_mentions": [{"page": "Antiquarian Horological Society", "response": ["The Antiquarian Horological Society, abbreviated to AHS, is the UK-based learned society for scholars and enthusiasts of horology. Its administrative office is at 4 Lovat Lane, a listed building close to the Monument, in the City of London. In early 2016, the Society appointed Dr Patricia Fara of Clare College, Cambridge as its new president, following the untimely death of its previous president Professor Lisa Jardine. The Chairman is Dr James Nye."]}, {"page": "Clive Wilmer", "response": ["Wilmer was born in Harrogate, Yorkshire and attended Emanuel School and King's College, Cambridge.Stringer, Jenny. The Oxford Companion to Twentieth-Century Literature in English. p.725. He is the brother of writer and photographer Val Wilmer. He has a daughter, a son and two grandsons. He shares his life with the historian of science Patricia Fara."]}, {"page": "Leadville (book)", "response": ["Leadville is a book by English writer Edward Platt, published in 2000 by Picador. It won both the John Llewellyn Rhys PrizeBooktrust - John Llewellyn Prize archive  Retrieved 2015-04-16. and the Somerset Maugham Award.Somerset Maugham Past Winners | Society of Authors  Retrieved 2015-04-16. Cambridge History of Science lecturer Patricia Fara selected it as one of her books of the decade.Blackwell's Books of the Decade Retrieved 2015-04-17."]}, {"page": "Template talk:BDWS", "response": ["# Patricia Fara"]}, {"page": "Marsh Family", "response": ["* Ben Marsh (born in 1976), the father, is a history lecturer at the University of Kent who specialises in the colonial history of the United States. He received a history degree from the University of Cambridge's Downing College in 1995. Marsh authored the 2007 book Georgia's Frontier Women: Female Fortunes in a Southern Colony. Book reviewer Kent Anderson Leslie praised the book, calling it \"an important text and sets a high standard of inclusive, insightful scholarship\". Marsh wrote a second book, Unravelled Dreams: Silk and the Atlantic World, 1500-1840, in 2020. It received the Hagley Prize in Business History, which is organised by the Hagley Museum and Library and Business History Conference. Book reviewer Paul D Blanc penned a positive review of the book, stating that it \"is valuable in its own right, but it also is worthy for the foundation it provides to reconsider more broadly the decolonial ecology of textiles\". The historian Patricia Fara wrote that Marsh \"skilfully converts entrepreneurial losses into scholarly gains, providing a much-needed counterbalance to triumphalist tales of innovative success and unsettling easy assumptions of inevitable technological progress\"."]}]}}