{"wiki_id": "http://www.wikidata.org/entity/Q7149519", "itemLabel": "Paul Brightwell", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Brightwell", "wikipedia_page": {"main": "Paul Brightwell is an English actor and director. He has acted in many different plays, films and TV shows since the late 1980s. Theatre direction includes the British premieres of Heiner Muller's Hamletmachine at the Gate Notting Hill, and Witkiewicz's They at the Polish Theatre in Hammersmith.", "link_mentions": [{"page": "Titanic (1997 film)", "response": ["* Paul Brightwell as Quartermaster Robert Hichens: One of the ship's six quartermasters and at the ship's wheel at the time of collision. He is in charge of lifeboat 6. He refuses to go back and pick up survivors after the sinking and eventually the boat is commandeered by Molly Brown."]}, {"page": "Uriah Heep", "response": ["In film and television adaptations, the character has been played by Peter Paget (1934), Roland Young (1935), Maxwell Shaw (1956), Colin Jeavons (1966), Ron Moody (1969), Martin Jarvis (1974), Paul Brightwell (1986), Nicholas Lyndhurst (1999), Frank MacCusker (2000) and Ben Whishaw (2018)."]}, {"page": "1997 in film", "response": ["| Titanic || 20th Century Fox / Paramount Pictures || James Cameron (director/screenplay); Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Frances Fisher, Bernard Hill, Jonathan Hyde, Danny Nucci, Gloria Stuart, David Warner, Victor Garber, Bill Paxton, Eric Braeden, Ioan Gruffudd, Bernard Fox, Suzy Amis, Jason Barry, Michael Ensign, Jonathan Evans-Jones, Mark Lindsay Chapman, Ewan Stewart, Jonathan Phillips, Simon Crane, Edward Fletcher, James Lancaster, Lew Palter, Elsa Raven, Martin Jarvis, Rosalind Ayres, Rochelle Rose, Scott G. Anderson, Paul Brightwell, Martin East, Gregory Cooke, Craig Kelly, Liam Tuohy, Terry Forrestal, Lewis Abernathy, Nicholas Cascone, Anatoly Sagalevich, Anders Falk, Edward Kamuda, Karen Kamuda || Period, Action, Drama, Romance || Live action"]}, {"page": "1998 in film", "response": ["| Sliding Doors || Paramount Pictures / Miramax Films / Mirage Enterprises || Peter Howitt (director/screenplay); Gwyneth Paltrow, John Hannah, John Lynch, Jeanne Tripplehorn, Virginia McKenna, Zara Turner, Paul Brightwell, Nina Young, Kevin McNally, Christopher Villiers || Romance, Comedy, Drama || Live action"]}, {"page": "West Hampstead", "response": ["* Paul Brightwell – actor"]}, {"page": "Malchus", "response": ["Malchus is portrayed by Paul Brightwell in the 2013 TV miniseries The Bible."]}, {"page": "Sliding Doors", "response": ["* Paul Brightwell as Clive"]}, {"page": "Ultimate Force", "response": ["* Paul Brightwell\t- Konchalovsky"]}, {"page": "Spy (2004 TV series)", "response": ["Additional training was conducted by John Potter, and narration was provided by Paul Brightwell."]}, {"page": "Robert Hichens (sailor)", "response": ["Hichens' conduct was featured in the 1997 blockbuster, Titanic, in which he was played by Paul Brightwell. He was depicted as a tall thin man with a cockney accent, when in fact he was 5' 6\", had a stocky build and spoke with a pronounced Cornish accent. He was also depicted saying \"if you don't shut that hole in your face\" to Molly Brown, but in fact those words were spoken by a steward in lifeboat 8."]}, {"page": "Ancient Rome: The Rise and Fall of an Empire", "response": ["*Paul Brightwell as Pompeius"]}, {"page": "The Commander (TV series)", "response": ["* Paul Brightwell as D.S. Brian Hall", "The series began with a one-off feature-length story broadcast in two parts in February 2003. Only known as The Commander for television broadcast, it did not carry an official title until the joint DVD release of series one and two in 2005. The episode gained enough viewers for two more stories to be commissioned. The other investigating officers in this episode are DCI Mike Hedges (Matthew Marsh), DCS Les Branton (Nicholas Jones), DAC Edward Sumpter (Christopher Robbie), DI Ken Miles (Tristan Gemmill), DS Brian Hall (Paul Brightwell) and DC Carol Browning (Poppy Miller).", "The fourth series of The Commander was first broadcast in 2007, in the form of three separate stories each broadcast in two parts. The entire series was released on DVD in 2007 by Acorn Media UK, becoming the last series to be released on DVD in the United Kingdom. This series introduces two new characters to the cast: DCI Doug James (Mark Lewis Jones), and DC Alison Goody (Nadine Marshall), leaving Amanda Burton, Anthony Valentine and Paul Brightwell as the only remaining original cast members. Les Branton also makes a return to the series, this time however played by the original actor, Nicholas Jones.", "The fifth and final installment of the series was first broadcast in 2008, in the form of three separate episodes comprising one story. Abduction becomes the second series of The Commander not released on DVD in the United Kingdom. The series also introduces a further new cast: DS Matt Newton (Niall MacGregor) and DC Marion Randell (Sian Brooke), who join Amanda Burton, Anthony Valentine, Mark Lewis Jones and Paul Brightwell, whose character DS Brian Hall has been suspended from the force."]}, {"page": "The Innocent Sleep", "response": ["* Paul Brightwell as Pelham "]}, {"page": "The Bible (miniseries)", "response": ["* Paul Brightwell – Malchus"]}, {"page": "Children's Film Unit", "response": ["How's Business (1991) Adapted from the book by Alison Prince, this wartime drama follows young Howard Grainger as he is evacuated from London during the Blitz and relocated to the countryside, where he begins a series of schemes to try and accrue sufficient funds to return home. Cast includes: Ben Brazier, Ron Moody, Paul Brightwell, Paul Copley, Sara Clee, Richard Digance, Don Henderson, Brett Fancy, Emily Richard, Ann Way, Carol MacReady"]}, {"page": "The Voices", "response": ["* Paul Brightwell as Jerry's stepfather"]}, {"page": "Hamletmachine", "response": ["The British premiere was on March 7, 1985 at the Gate Theatre in London, in a double bill with Heiner Müller's Mauser, both directed by Paul Brightwell, who had previously directed a student production of Müller's Cement at the University of Essex. The production of Hamletmachine was described as \"a stage teeming with images\" and \"an electrifying message from East Germany\" by Nicholas De Jongh in The Guardian."]}, {"page": "David Copperfield (1986 TV serial)", "response": ["* Paul Brightwell -- Uriah Heep"]}, {"page": "List of Outlander characters", "response": ["|Paul Brightwell", "* Paul Brightwell as Sir Percival Turner"]}, {"page": "Bad Girls (series 6)", "response": ["* Paul Brightwell as DI Ackroyd"]}, {"page": "Brightwell, Paul", "response": ["#redirectPaul Brightwell"]}]}}