{"wiki_id": "http://www.wikidata.org/entity/Q7146783", "itemLabel": "Patrick Huskinson", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Huskinson", "wikipedia_page": {"main": "Air Commodore Patrick Huskinson,  (17 March 1897 – 24 November 1966) was an officer of the Royal Air Force (RAF), who served during the First and Second World Wars. He began his military career in the Royal Flying Corps as a fighter ace, but later switched to bombers. He became well enough versed in armaments that he was appointed Director of Armament Production by Winston Churchill at the start of the Second World War. After being invalided out of the RAF for blindness, he continued to serve as President of the Air Armaments Board and was responsible for designing ever larger bombs for the bombardment of Germany. Eventually, he designed Blockbuster bombs as large as ten tons.", "link_mentions": [{"page": "No. 41 Squadron RAF", "response": ["* Having graduated Sandhurst in 1915, Air Commodore Patrick Huskinson was seconded to the RFC later that same year, and served on 2, 4, and 19 Squadrons before the cessation of hostilities. He was credited with 11 victories, and awarded two Military Crosses. Following the war, he commanded 204 and 70 Squadrons, and then spent four years in instructing roles at Cranwell. For the following 11 years from the mid-1920s, he fulfilled armament and ordinance roles in the United Kingdom and Middle East, with the exception of a 20-month period between February 1930 and October 1931 when he commanded 41 Squadron. Returning to ordinance in March 1938, he became vice president of the Ordnance Committee at Woolwich Arsenal and then the Director of Armament Development with the Ministry of Aircraft Production in 1940, reporting to Lord Beaverbrook. In April 1941, however, Huskinson and his wife were seriously injured by Luftwaffe night-time bombing in the Blitz and Huskinson was blinded. Following nine months’ convalescence, he was retired as an Air Commodore in January 1942. However, he immediately became the president of the Air Armament Board, which post he held until 1945. In this role, he was involved in the development of large bunker-busting bombs, such as the Tall Boy, and in several other technologies, despite his handicap. In 1945, he was appointed a CBE and the U.S. Legion of Merit for his work in this role. Huskinson also wrote an autobiography in 1949 called 'Vision Ahead', which explains his career in some detail. He also recalls his \"very happy years in charge of Number 41 Squadron\". It was also Huskinson who wrote to the Mayor of St. Omer and obtained permission for 41 Squadron to use part of the Town Arms in its badge.", "| Patrick Huskinson, CBE, MC & Bar || 6 February 1930 ||  || William Kent AFC || 1 September 1965"]}, {"page": "List of Old Harrovians", "response": ["*Air Commodore Patrick Huskinson (1897–1966)"]}, {"page": "No. 19 Squadron RAF", "response": ["From November 1917, the squadron started to receive Sopwith Dolphins to replace its Spads, it being fully equipped with the Dolphin during January 1918, flying its first operational patrol with the new fighter on 3 February.Chorlton Aeroplane Autumn 2014, p. 58. In 1918, the squadron was re-equipped with Sopwith Dolphins, flying escort duties. By the end of the war, 19 Squadron had had a score of flying aces among its ranks, including Albert Desbrisay Carter, John Leacroft, Arthur Bradfield Fairclough, Oliver Bryson, Gordon Budd Irving, Frederick Sowrey, future Air Commodore Patrick Huskinson, Cecil Gardner, Roger Amedee Del'Haye, future Air Chief Marshal James Hardman, Finlay McQuistan, Alexander Pentland, John Candy, Cecil Thompson, John Aldridge, and Wilfred Ernest Young."]}, {"page": "Stubbington House School", "response": ["* Patrick Huskinson  , President of the Air Armaments Board and designer of Blockbuster bombs"]}, {"page": "List of World War I aces credited with 11–14 victories", "response": ["| Patrick Huskinson"]}, {"page": "Willi Kampe", "response": ["Beginning 12 August 1917, Kampe would shoot down eight opposing airplanes—seven fighters and an Airco DH.4 light bomber. His final victory came 8 March 1918 near Ypres, when he shot down a No. 19 Squadron Sopwith Dolphin at 1208 hours. He was killed in action in the process, probably by another 19 Squadron Dolphin flown by RAF 'ace' Capt. Patrick Huskinson. Willi Kampe had been honored with both classes of the Iron Cross by the time of his death."]}, {"page": "Herbert Rowley", "response": ["On 5 November 1930 he was promoted to squadron leader, taking command of No. 56 Squadron, based at RAF North Weald on 15 December. On 27 June 1931 his squadron took part in the 12th Air Force Display held at Hendon Aerodrome, mounting a demonstration involving an mock attack on a long-range gun emplacement by Hawker Harts of No. 33 Squadron and Handley Page Hyderabads from No. 503 Squadron, which was defended by the Armstrong Whitworth Siskins of No. 41 Squadron, commanded by Squadron Leader Patrick Huskinson, and No. 56 Squadron, commanded by Rowley. From 18 January 1932 he attended the Staff College at Andover, and from 17 January 1933 he served on the Air Staff at the Headquarters of Iraq Command. He was posted to the Aeroplane and Armament Experimental Establishment at RAF Martlesham Heath for engineer duties on 30 June 1935."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Patrick Huskinson"]}, {"page": "1925 New Year Honours", "response": ["* Patrick Huskinson, ."]}, {"page": "Huskinson", "response": ["*Patrick Huskinson (1897–1966), British Royal Air Force officer"]}]}}