{"wiki_id": "http://www.wikidata.org/entity/Q7146846", "itemLabel": "Patrick John Morris", "itemDescription": "British composer, musician, and songwriter.", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_John_Morris", "wikipedia_page": {"main": "Patrick John Morris (13 April 1948 – 16 January 2008) was a British composer, musician, and songwriter.\nHe was educated at Highgate School, Guildhall School of Music, the Royal Academy of Music, and University College London, where he obtained a degree in philosophy.\nDisillusioned with contemporary classical music in the style of Stockhausen and Boulez, he developed a style that one critic, Jonathan Witshire, has called \"residual\", a label he accepted. He described his main musical influences as Erik Satie and Brian Eno, whom he rated as the most important composers of the twentieth century. His style is associated with that of his contemporary Howard Skempton and has been compared to younger composer Simon Rackham, who released a piece for two pianos called 'Warhorse' dedicated to the memory of Patrick Morris on his 2011 album, Once In a Blue Moonlight.He placed his works into three groups, piano music, instrumental pieces and songs. For the songs he set poems to music and sang them, verses by A. E. Housman, W. E. Henley, Walter de la Mare and other well-known poets, and particularly the Australian-born poet Vicki Raymond. From about 1990, he wrote and sang his own songs, mysterious poems evoking an atmosphere of mortality, lonely, marginalised characters, and wistful melancholy.He gave regular concerts in St Michael's Church, Highgate. His music has been played on BBC Radio 3, he has performed in Germany, the Czech Republic and Slovakia.\nHe produced a number of CDs, including They Call Him Mister P, The World of Mister P, The Essential Mister P and Slow Bulldozing with Mister P.\nHe also wrote the soundtrack for a number of arthouse films, including the documentary, LuXus, about abstract painter Philip Diggle.For the last few years of his life he returned to the house in Highgate, where he had spent his childhood and where he was found dead on 16 January 2008.", "link_mentions": [{"page": "Patrick Morris", "response": ["* Patrick John Morris (1948–2008), British composer, musician and songwriter"]}]}}