{"wiki_id": "http://www.wikidata.org/entity/Q7146055", "itemLabel": "Patrick Anthony Porteous", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Anthony_Porteous", "wikipedia_page": {"main": "Colonel Patrick Anthony Porteous VC (1 January 1918 – 9 October 2000) was a Scottish recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "January 1", "response": ["*1918 – Patrick Anthony Porteous, Scottish colonel, Victoria Cross recipient (d. 2000)"]}, {"page": "October 9", "response": ["*  2000   – Patrick Anthony Porteous, Indian-Scottish colonel, Victoria Cross recipient (b. 1918)"]}, {"page": "1918", "response": ["** Patrick Anthony Porteous, Scottish recipient of the Victoria Cross (d. 2000)"]}, {"page": "Herm", "response": ["Operation Huckaback was a British Second World War military operation that was originally designed to be a raid on Herm, Jethou and Brecqhou, but instead became only a raid on Herm undertaken on the night of 27 February 1943, following an earlier attempt that had been aborted. Ten men of the Small Scale Raiding Force and No. 4 Commando under Captain Patrick Anthony Porteous  landed 200 yards to the north-west of Selle Rocque on a shingle beach and made several unsuccessful attempts to climb the cliff in front of them. Porteous finally managed to climb up the bed of a stream and pulled the others up with a rope. They later reported that they had found no sign of any Islanders or Germans (who were supposed to be billeted near the harbour). They had failed to make contact with the few civilians on the island whose duties included looking after the sheep."]}, {"page": "Patrick Porteous", "response": ["#REDIRECT Patrick Anthony Porteous"]}, {"page": "List of Scottish Victoria Cross recipients", "response": ["*Patrick Anthony Porteous – 1942; Dieppe, France"]}, {"page": "Patrick Anthony Porteous (VC)", "response": ["#REDIRECT Patrick Anthony Porteous"]}, {"page": "2000 in the United Kingdom", "response": ["* 9 October – Patrick Anthony Porteous, recipient of the Victoria Cross (born 1918)"]}, {"page": "1918 in the United Kingdom", "response": ["** Patrick Anthony Porteous, Scottish soldier, recipient of the Victoria Cross (born in the British Raj; died 2000)"]}, {"page": "Index of World War II articles (P)", "response": ["# Patrick Anthony Porteous"]}, {"page": "Porteous", "response": ["* Patrick Anthony Porteous, Victoria Cross, war hero"]}, {"page": "Operation Huckaback", "response": ["Huckaback was reinvented as a raid on Herm alone on the night of 27/28 February 1943. Ten men of the SSRF under Captain Patrick Anthony Porteous VC landed  to the north-west of Selle Rocque on a shingle beach from MTB 344. After three unsuccessful attempts to scale the cliff, Porteous finally managed to climb up the bed of a stream and pulled the others up using toggle ropes."]}, {"page": "January 1918", "response": ["* Born: Patrick Anthony Porteous, British army officer, commander of the No. 4 Commando unit during World War II, recipient of the Victoria Cross, in Abbottabad, British India (d. 2000); Jaja Wachuku, Nigerian politician, first Minister of Foreign Affairs of Nigeria from 1961 to 1965, in Abia State, Nigeria (d. 1996)"]}, {"page": "Cyril Ranatunga", "response": ["He joined the Ceylon Army in 1950 and received his officer training at Royal Military Academy Sandhurst, where his company commander was Patrick Anthony Porteous. After completing his training at Sandhurst, he was sent to Malaya for additional training at the British Army Jungle Warfare School. On his return he was commissioned as a Second Lieutenant in the Ceylon Light Infantry. Later he was transferred to the 1st Reconnaissance (Recce) Regiment at its formation as the 1st Reconnaissance Squadron in 1955 which grew into the Ceylon Armoured Corps. His squadron was deployed in 1956 to Ampara to subdue the Gal Oya riots and thereafter to Trincomalee to control civil unrest. He underwent training at British Army Armoured Center, Bovington in 1957 as the regimental signals officer of the 1 Recce Regiment. In 1958, he served as a military observer in Lebanon United Nations Observation Group during the Lebanon crisis, rejoining his regiment on his return to Ceylon. "]}, {"page": "Deaths in October 2000", "response": ["*Patrick Anthony Porteous, 82, Scottish recipient of the Victoria Cross."]}]}}