{"wiki_id": "http://www.wikidata.org/entity/Q7148252", "itemLabel": "Patsy Healey", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Patsy_Healey", "wikipedia_page": {"main": "Patsy Healey  (née Ingold; born 1 January 1940) is a British urban planner. She is  professor emeritus at Global Urban Research Unit in the School of Architecture, Planning & Landscape, at Newcastle University. She is a specialist in planning theory and practice, with a particular focus on strategic spatial planning for city regions and in urban regeneration policies. She is Senior Editor of Planning Theory and Practice journal, jointly published by TandF and the RTPI.\nShe is the daughter of the mycologist Cecil T. Ingold.", "link_mentions": [{"page": "Global Urban Research Unit", "response": ["* Patsy Healey"]}, {"page": "Participatory planning", "response": ["A group of planning theorists in the 1980s and 90s including Patsy Healey and Judith Innes developed a participatory model of planning which they refer to as communicative planning. Communicative planning draws heavily on Habermas's idea of communicative rationality, and proposes an approach to planning in which diverse stakeholders in the planning process participate in deliberative conversations, work to resolve conflicts in their values and priorities, and collectively create a consensus plan. In this process, planners serve to facilitate this deliberation and offer technical expertise when called for."]}, {"page": "List of Newcastle University people", "response": ["* Patsy Healey - professor"]}, {"page": "Healey (surname)", "response": ["* Patsy Healey (born 1940), professor at Newcastle University, England"]}, {"page": "1999 Birthday Honours", "response": ["* Professor Patsy Healey. Director, Centre For Research in European Urban Environments, Department of Town and Country Planning, University of Newcastle. For services to Planning."]}, {"page": "City Mine(d)", "response": ["From 2003 on City Mine(d) widened its horizons by setting up offices in Barcelona (Spain) and London (UK). After publishing their own road maps to the city - The Networkbook for urban p/arts in London and Tallermapas in Barcelona - local initiatives further developed in all 3 cities. The Bruxel glocal conference in Brussels' Bozar in February 2003, with contributions by Josep Acebillo, Patsy Healey and others was an attempt to bring artists, activists and researchers from throughout Europe together to think and talk about bottom-up initiatives in a globalising context."]}, {"page": "Cecil Terence Ingold", "response": ["His daughter is Patsy Healey'HEALEY, Prof. Patsy', Who's Who 2013, A & C Black, an imprint of Bloomsbury Publishing plc, 2013; online edn, Oxford University Press, Dec 2012 ; online edn, Nov 2012 accessed 29 May 2013 and son is the noted anthropologist Tim Ingold."]}, {"page": "List of fellows of the British Academy elected in the 2000s", "response": ["* Professor Patsy Healey. Professor Emeritus, School of Architecture, Planning and Landscape, Newcastle University"]}, {"page": "Communicative planning", "response": ["Around the same time as this article was published, Patsy Healey also published a number of planning theory texts exploring communicative and collaborative planning. Drawing on the theory of Jürgen Habermas in particular, Healey's work focuses on the impact that communicative acts (which can be in spoken or written form) have on a community planning process. Healey also expands on the work of urban planner John F. Forester and economic geographer Bent Flyvbjerg, both of whom examine Habermasian communication and power structures in their planning work.", "| rowspan=\"4\" |Patsy Healey"]}, {"page": "Zenia Kotval", "response": ["Building on the work of Sherry Arnstein and Patsy Healey, she advocates that economic development should be seen as a tool at the service of community improvements and inclusion, a role this is particularly important in declining areas as a means to include local populations left behind by the development process."]}, {"page": "Stephen Graham (academic)", "response": ["*(Co-Edited with Patsy Healey, Simin Davoudi, Ali Madani-Pour and Stuart Cameron) Managing Cities: The New Urban Context (John Wiley and Sons, Oxford, 1995).   "]}]}}