{"wiki_id": "http://www.wikidata.org/entity/Q7149997", "itemLabel": "Paul Cox", "itemDescription": "English association football player and manager (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Cox_(footballer)", "wikipedia_page": {"main": "Paul Richard Cox (born 6 January 1972) is an English football manager who was previously a professional footballer who is currently manager of National League North club Boston United. \nIn an eleven-year career as a player, Cox played in the Football League with his hometown club Notts County before playing in non-league football with several clubs, most notably Kettering Town. Cox moved into coaching at Eastwood Town in 2003, becoming the manager in 2005. He won the Northern Premier League in 2008–09, and left the club for Mansfield Town in 2011, with whom he won the Conference Premier in 2012–13, before leaving in November 2014. He later managed Torquay United in 2015, Barrow from 2015 until 2017, and Guiseley between 2017 and 2018 when he was appointed manager of Kettering Town.", "link_mentions": [{"page": "Torquay United F.C.", "response": ["Early in 2015, chairwoman Thea Bristow announced that the club was up for sale. After Bristow resigned in March 2015, she agreed to transfer her estimated 80%, one million pound, stake in the club for £1, subject to sale of to new locally based owners. In June 2015, ownership of the club was taken up by a new consortium made up of 10 local business people. The new board, operating on a substantially smaller budget, took decisive action, firstly putting Chris Hargreaves (manager), Lee Hodges (assistant manager) and Kenny Veysey (goalkeeping coach) on gardening leave, disbanding the youth department, and appointing Paul Cox as manager.", "|2015||Paul Cox"]}, {"page": "Boston United F.C.", "response": ["|  Manager ||  Paul Cox", "| Paul Cox"]}, {"page": "Mansfield Town F.C.", "response": ["His replacement, Paul Cox, led Mansfield to their highest Conference finish in his first season. A good run of form after Christmas saw the Stags finish in third in the league, although they lost 2–1 on aggregate to eventual play-off winners York City after extra time in the promotion play-off semi-final.", "|align=left|Paul Cox"]}, {"page": "Tamworth F.C.", "response": ["On 13 October 2010, manager Gary Mills quit Tamworth to join fellow Conference Premier side York City, names of possible replacements started to circulate and many believed that Ian McParland had expressed interest in the job.  However first team coach Des Lyttle became caretaker manager and was later hired as player-manager. He resigned as manager on 13 April 2011, and was replaced by Tamworth legend Dale Belford, who was to manage the club for the remaining four games of the season. Belford led Tamworth to last day safety with a 2–1 home win over Forest Green Rovers, with Jake Sheridan scoring the all important winning goal.  Belford stepped aside at the end of the season, and the search for a new manager to lead the club for the 2011–12 Conference Premier season began, speculation was rife, and the names of former York City manager Martin Foyle, Eastwood Town manager Paul Cox and former Walsall assistant manager Martin O'Connor were all linked to the club, but on 25 May 2011, Tamworth announced Kettering Town manager Marcus Law as the club's new manager."]}, {"page": "Barrow A.F.C.", "response": ["On 1 May 2014, it was announced that club members had voted to allow Dallas businessman Paul Casson to complete a takeover. Barrow were 2014–15 Conference North champions, with a 2–3 win away at Lowestoft Town on the final day of the season. Casson aimed for promotion in the club's first season back in the top flight of non-league football. In November 2015, Barrow parted company with manager Darren Edmondson after a poor run left them mid-table and a 1–0 loss to AFC Fylde knocked them out of the FA Cup. The club appointed former Mansfield and Torquay boss Paul Cox manager the following day.", "|align=left|Paul Cox"]}]}}