{"wiki_id": "http://www.wikidata.org/entity/Q7145461", "itemLabel": "Patricia Beer", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Patricia_Beer", "wikipedia_page": {"main": "Patricia Beer (4 November 1919 – 15 August 1999) was an English poet and critic.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Patricia Beer (1919–1999, E)"]}, {"page": "List of poets", "response": ["*Patricia Beer (1919–1999), English poet and critic"]}, {"page": "D. K. Broster", "response": ["Literary historian Jack Adrian describes Couching at the Door as \"a pure masterwork, one of the most satisfying weird collections of the century\". The poet Patricia Beer was an admirer of Broster's novels, stating she had been fascinated by The Flight of the Heron when she read it aged thirteen."]}, {"page": "1993 in literature", "response": ["*Cholmondeley Award: Patricia Beer, George Mackay Brown, P. J. Kavanagh, Michael Longley"]}, {"page": "Palgrave's Golden Treasury", "response": ["Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Exmouth", "response": ["*Patricia Beer (1919–1999), poet "]}, {"page": "Oxford Book of Contemporary Verse", "response": ["*Patricia Beer"]}, {"page": "The Harvill Book of Twentieth-Century Poetry in English", "response": ["*Patricia Beer"]}, {"page": "British Poetry since 1945", "response": ["A. Alvarez - Kingsley Amis - George Barker - Patricia Beer - Martin Bell - Francis Berry - John Betjeman - D. M. Black - Thomas Blackburn - Alan Bold - Alan Brownjohn - Basil Bunting - Miles Burrows - Charles Causley - Barry Cole - Tony Connor - Iain Crichton Smith - Peter Dale - Donald Davie - Lawrence Durrell - D. J. Enright - Paul Evans - Ian Hamilton Finlay - Roy Fisher - John Fuller - Roy Fuller - Robert Garioch - David Gascoyne - Karen Gershon - Henry Graham - W. S. Graham - Robert Graves - Harry Guest - Thom Gunn - Michael Hamburger - Ian Hamilton Finlay - Lee Harwood - Spike Hawkins - Seamus Heaney - John Heath-Stubbs - Adrian Henri - Geoffrey Hill - Philip Hobsbaum - Anselm Hollo - Ted Hughes - Elizabeth Jennings - Brian Jones - David Jones - Philip Larkin - Peter Levi - Christopher Logue - Edward Lucie-Smith - George MacBeth - Norman MacCaig - Hugh MacDiarmid - Roger McGough - George Mackay Brown - Louis MacNeice - Barry MacSweeney - Derek Mahon - Matthew Mead - Christopher Middleton - Adrian Mitchell - Dom Moraes - Edwin Morgan - Edwin Muir - Jeff Nuttall - Stewart Parker - Brian Patten - Sylvia Plath - Peter Porter - Tom Raworth - Peter Redgrove - Jon Silkin - Stevie Smith - Bernard Spencer - Jon Stallworthy - Nathaniel Tarn - Dylan Thomas - D. M. Thomas - Anthony Thwaite - Charles Tomlinson - Rosemary Tonks - Gael Turnbull - Vernon Watkins - David Wevill"]}, {"page": "Faber Book of Twentieth-Century Women's Poetry", "response": ["Fleur Adcock – Margaret Atwood – Margaret Avison – Elizabeth Bartlett – Patricia Beer – Frances Bellerby – Connie Bensley – Mary Ursula Bethell – Elizabeth Bishop – Louise Bogan – Eavan Boland – Gwendolyn Brooks – Eiléan Ni Chuilleanáin – Amy Clampitt – Gillian Clarke – Jane Cooper – Wendy Cope – Frances Cornford – Elizabeth Daryush – Rosemary Dobson – Freda Downie – Lauris Edmond – U. A. Fanthorpe – Elaine Feinstein – Tess Gallagher – Louise Glück – Barbara Guest – H. D. – Gwen Harwood – Selima Hill – Molly Holden – Robin Hyde – Elizabeth Jennings – June Jordan – Jenny Joseph – Maxine Kumin – Denise Levertov – Gwendolyn MacEwen – Sandra McPherson – Charlotte Mew – Josephine Miles – Edna St. Vincent Millay – Elma Mitchell – Marianne Moore – Lorine Niedecker – P. K. Page – Ruth Pitter – Sylvia Plath – Adrienne Rich – Judith Rodriguez – Muriel Rukeyser – Carol Rumens – E. J. Scovell – Edith Sitwell – Stevie Smith – Anne Stevenson – May Swenson – Anne Szumigalski – Jean Valentine – Ellen Bryant Voigt – Sylvia Townsend Warner – Anna Wickham – Judith Wright – Elinor Wylie"]}, {"page": "Exclusive Brethren", "response": ["* Patricia Beer – Poet."]}, {"page": "Penguin poetry anthologies", "response": ["Kenneth Allott - A. Alvarez - Kingsley Amis - W. H. Auden - George Barker - Patricia Beer - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Norman Cameron - Roy Campbell - Robert Conquest - Hilary Corke - Donald Davie - Cecil Day-Lewis - Walter de la Mare - Lawrence Durrell - T. S. Eliot - William Empson - D. J. Enright - Christopher Fry - Roy Fuller - David Gascoyne - W. S. Graham - Robert Graves - Thom Gunn - John Heath-Stubbs - Geoffrey Hill - John Holloway - Ted Hughes - Aldous Huxley - Elizabeth Jennings - James Joyce - Sidney Keyes - Thomas Kinsella - James Kirkup - Philip Larkin - D. H. Lawrence - Laurie Lee - John Lehmann - Peter Levi - Alun Lewis - Wyndham Lewis - Norman MacCaig - Louis MacNeice - Charles Madge - Jon Manchip White - Harold Monro - Edwin Muir - Norman Nicholson - Wilfred Owen - Sylvia Plath - William Plomer - F. T. Prince - Peter Quennell - Kathleen Raine - Herbert Read - Henry Reed - James Reeves - Anne Ridler - Michael Roberts - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - Francis Scarfe - E. J. Scovell - Jon Silkin - Sacheverell Sitwell - Bernard Spencer - Stephen Spender - Dylan Thomas - Edward Thomas - R. S. Thomas - Anthony Thwaite - Terence Tiller - Charles Tomlinson - Henry Treece - John Wain - Arthur Waley - Rex Warner - Vernon Watkins - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "P. N. Furbank", "response": ["In 1960 in London he married the poet and critic Patricia Beer. The marriage was dissolved by 1964 when she remarried."]}, {"page": "Vernon Scannell", "response": ["*New Poems 1962: A P. E. N. Anthology (Hutchinson, 1962), editor with Patricia Beer and Ted Hughes"]}, {"page": "Patrick Garland", "response": ["* 'Poets on Poetry' interviews with W.H. Auden, Seamus Heaney, Douglas Dunn, Patricia Beer and Marvin Cohen, The Listener, 8 November 1973"]}, {"page": "Cholmondeley Award", "response": ["* Patricia Beer "]}, {"page": "1999 in poetry", "response": ["* August 15 – Patricia Beer, 79, English poet and critic"]}, {"page": "1993 in poetry", "response": ["* Cholmondeley Award: Patricia Beer, George Mackay Brown, P. J. Kavanagh, Michael Longley"]}, {"page": "1988 in poetry", "response": ["* Patricia Beer, Collected Poems"]}, {"page": "1919 in poetry", "response": ["* November 4 – Patricia Beer (died 1999), English poet and critic"]}, {"page": "1963 in poetry", "response": ["* Patricia Beer, The Survivors"]}, {"page": "1959 in poetry", "response": ["*Patricia Beer, The Loss of the Magyar, a first book of poems"]}, {"page": "1967 in poetry", "response": ["* Patricia Beer, Just Like the Resurrection"]}, {"page": "Norton Anthology of Literature by Women", "response": ["* Patricia Beer (1919–1999)"]}, {"page": "Exmouth Community College", "response": ["* Patricia Beer, poet"]}, {"page": "Patricia Duncker", "response": ["Born in Kingston, Jamaica, the daughter of Noel Aston Duncker (1904–1973), an accountant, and Sheila Joan (née Beer) (1918–2016), a teacher,Family of Patricia Duncker - Ancestry.com  Her aunt was the poet Patricia Beer, after whom she was named.A shadow at my shoulder: Interview with Patricia Duncker - The Guardian 12 August 2000 Duncker attended Bedales School in England and, after a period spent working in Germany, read English at Newnham College, Cambridge. She earned a doctorate from St Hugh's College, Oxford."]}, {"page": "George Worsley Adamson", "response": ["Between his portrait of his two-year-old son Peter One Morning (completed in 1950) and Killerton from the North (1979), however, there was a gap of many years during which he pursued his career as illustrator and cartoonist. He went back to printmaking with great enthusiasm in the late 1970s, exhibiting his works both new and old at the Royal Society of Painter-Etchers and Engravers.Adamson, George (contributor) (1984). Among his later prints are portraits of John Ogdon (1979) and Patricia Beer (1982)."]}, {"page": "My postillion has been struck by lightning", "response": ["\"The Postilion Has Been Struck By Lightning\" is the title of a two-stanza poem by Patricia Beer, published in 1967."]}, {"page": "Lives in the Shadow with J. Krishnamurti", "response": ["The book has been favorably reviewed by Tim Heald in The Times (London),Heald, Tim (27 July 1991). \"Turning Krinsh into Christ\". Saturday Review. The Times. London. . . Patricia Beer (London Review of Books),Beer, Patricia (15 August 1991). . London Review of Books. Vol.13. No.15. . .  and Firdaus Kanga in the Times Literary Supplement (London).Kanga, Firdaus (30 August 1991). \"World(ly) Teacher\". Times Literary Supplement. London. . ."]}, {"page": "Open Brethren", "response": ["* Patricia Beer — Poet."]}, {"page": "Deaths in August 1999", "response": ["*Patricia Beer, 79, English poet and critic."]}, {"page": "List of women writers (A–L)", "response": ["*Patricia Beer (1919–1999, England), poet & critic"]}]}}