{"wiki_id": "http://www.wikidata.org/entity/Q7145794", "itemLabel": "Patricia Potter", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Patricia_Potter", "wikipedia_page": {"main": "Patricia Caroline Potter (born 3 March 1975) is an English actress, known for her role as Diane Lloyd in the BBC medical drama series Holby City. From 2016 to 2017, she appeared in the BBC soap opera Doctors as Jane Fairweather.\n\n", "link_mentions": [{"page": "Ricky Gervais", "response": ["Extras had its debut on the BBC on 21 July 2005; directed by Ricky Gervais and Stephen Merchant, the sitcom ran for twelve episodes and starred Gervais as Andy Millman, a background artist. Millman is more self-aware and intentionally humorous than Gervais's The Office character David Brent. Guest stars on the first series of Extras include Ross Kemp, Les Dennis, Patrick Stewart, Vinnie Jones, Samuel L. Jackson, Ben Stiller, Kate Winslet and Francesca Martinez. A second series began on 14 September 2006 in the UK and featured appearances by Daniel Radcliffe, Dame Diana Rigg, Orlando Bloom, Sir Ian McKellen, Chris Martin, Keith Chegwin, Robert Lindsay, Warwick Davis, Ronnie Corbett, Stephen Fry, Richard Briers, Patricia Potter, Sophia Myles, Moira Stuart, David Bowie, Robert De Niro and Jonathan Ross."]}, {"page": "Lynda Suzanne Robinson", "response": ["*\"The unwanted bride\" in WHEN YOU WISH 1997/Nov (with Jane Feather, Sharon & Tom Curtis, Patricia Coughlin, Elizabeth Elliott, Patricia Potter)"]}, {"page": "Holby City", "response": ["Several episodes of the series have been shot on location abroad. In 2004, the romance between nurse Jess Griffin (Verona Joseph) and anaesthetist Zubin Khan (Art Malik) culminated in an episode set in Paris. The following year, registrar Diane Lloyd (Patricia Potter) followed consultant Ric Griffin (Hugh Quarshie) to Ghana as part of the BBC's \"Africa lives\" series, a week of programmes bringing an exploration of African culture to UK audiences. In 2006, an episode shot in Switzerland featured consultant Elliot Hope's (Paul Bradley) wife Gina (Gillian Bevan) committing assisted suicide after her motor neurone disease worsened. A 2007 episode filmed in Dubai focused on Holby registrar Joseph Byrne (Luke Roberts) meeting new nurse Faye Morton (Patsy Kensit), and in 2008, Joseph and consultant Linden Cullen (Duncan Pow) travelled to Cape Town when Faye experienced difficulties there. Series producer Diana Kyle stated in November 2008 that due to major BBC budget cuts, the series would not be filming abroad again for the \"foreseeable future\". However, on 10 December 2012, it was announced that the show had filmed one episode in Stockholm, which focusses on Jac tracking down hospital CEO Henrik Hanssen (Guy Henry) and exploring his backstory.", "In casting the first series of Holby City, Young—who had previously worked on the soap operas Brookside and Family Affairs—selected actors who were already established names in the acting industry, particularly from a soap opera background. French had starred in the BBC's EastEnders, while Stephenson and Faulkner had starred in Brookside. Griffin had also appeared in ITV's Coronation Street. Young explained: \"Some of the best performances on screen have come out of soaps in the past few years. There is a fantastic amount of talent on those shows.\" This propensity for hiring established actors continued as the soap progressed, with former Brookside actress Patricia Potter cast as registrar Diane Lloyd, Star Wars actor Denis Lawson cast as consultant Tom Campbell-Gore, and Family Affairs star Rocky Marshall cast as SHO Ed Keating. Later roles were awarded to comedian Adrian Edmondson, former film actress Patsy Kensit, and Jesus of Nazareth star Powell. When Jane Asher was cast in the recurring role of Lady Byrne in 2007, Inside Soap magazine asked Kyle whether the production team intentionally sought out \"well-known-names\". She responded: \"It's lovely when we have a new member of the cast come in and bring an audience with them. But we want the best actors, and the star names we cast are always the best – which is why we go for them.\""]}, {"page": "Heather Graham Pozzessere", "response": ["* Daughters Of Destiny (2001; with Merline Lovelace and Patricia Potter)"]}, {"page": "List of Brookside characters", "response": ["|Victoria Wilcox || Patricia Potter || 1999–2001"]}, {"page": "Nick Jordan (character)", "response": ["During his time on Holby City, Nick had several romantic interests, including ex-wife and Ward Sister Karen Newburn, Theatre Sister Ellie Sharpe, SHO Kirstie Collins, and Registrars Diane Lloyd and Jac Naylor. The series homepage assesses that: \"He had tremendous pulling power with women, but commitment was not his strong point.\" Michael French, discussing his character shortly after the show's 1999 conception, asserted that: \"Like most blokes, he sometimes treats women as playthings – if they’re willing. A little bit of hanky panky is part of the human condition, after all!\" Sarah Preston, who played Nick's ex-wife Karen in the first two series of the show, stated of her most memorable moments filming: \"I loved my scenes with Michael, he was great to work with. Confrontation scenes give you something to get your teeth into and we had plenty of those!\" Similarly, Rosie Marcel who plays Jac commented that her character and Nick \"have some really bad history between them. [...] They've worked together before and Jac knows Nick will tread on anyone's toes to get to the top. It makes for some great fight scenes.\" Nick's series eight relationship with Diane ended, again acrimoniously, when she was blamed for a mistake he had made in theatre and refused to own up. Patricia Potter, who plays Diane, explained that when confronted; \"[Nick] violently pins her against the wall and warns her never to cross him. She finally sees his other side and is devestated [sic]. Her dreams come falling down around her ears.\""]}, {"page": "MasterChef (British TV series)", "response": ["* 2015: Kimberly Wyatt, Keith Chegwin, Sarah Harding, Yvette Fielding, Arlene Phillips, Samira Ahmed, Andy Akinwolere, Syd Little, Amanda Donohoe, Craig Gazey, Tom Parker, Patricia Potter, Chesney Hawkes, Danny Crates, Mica Paris, Sheree Murphy, Natalie Lowe, Scott Maslen, Rylan Clark and Sam Nixon."]}, {"page": "Casualty@Holby City", "response": ["The four-part October 2005 crossover again stars MacCorkindale, Bleasdale, Packer, Wait, Laird, Redmond, Gibbs, Mealing and Quarshie. It also features Casualty paramedic Paul \"Woody\" Joyner (Will Thorp), staff nurse Kelsey Phillips (Janine Mellor), senior staff nurse Bruno Jenkins (Mark Bonnar), neurology associate specialist Selena Donovan (Elizabeth Carling) and SHO Guppy Sandhu (Elyes Gabel). Holby City characters who appear are registrar Diane Lloyd (Patricia Potter), matron Chrissie Williams (Tina Hobley), consultant obstetrician Owen Davis (Mark Moraghan), medical student Matt Parker (Adam Best), staff nurse Tricia Williams (Sharon Maughan) and cardiothoracic consultant Ed Loftwood (Graeme Garden)."]}, {"page": "Holby City (series 4)", "response": ["*Patricia Potter as Diane Lloyd (from episode 39)"]}, {"page": "Holby City (series 5)", "response": ["*Patricia Potter as Diane Lloyd"]}, {"page": "Holby City (series 6)", "response": ["*Patricia Potter as Diane Lloyd"]}, {"page": "Susan Holloway Scott", "response": ["* Christmas Rogues (1995) (with Anita Mills and Patricia Potter)"]}, {"page": "Holby City (series 7)", "response": ["*Patricia Potter as Diane Lloyd"]}, {"page": "Holby City (series 8)", "response": ["*Patricia Potter as Diane Lloyd"]}, {"page": "Holby City (series 9)", "response": ["*Patricia Potter as Diane Lloyd (episodes 1–38)"]}, {"page": "Abra Durant", "response": ["It was first announced on 4 May 2005 that comedian Adrian Edmondson would be making a guest appearance in Holby City in July of that year, although the character he would be playing was not disclosed. The storyline running at the time saw established character, General Surgical Consultant Ric Griffin (Hugh Quarshie), depart from Holby to work in his brother's hospital in Ghana, with Registrar Diane Lloyd (Patricia Potter) following on in an attempt to persuade him home.  Edmondson's character, Abra Durant, was introduced as a new friend and colleague of Ric's, also working in his brother's clinic. Although the character's given name is actually Percival, it was explained within the episode that he goes by Abra, short for the Ghanaian name 'Abrafo', meaning 'troublemaker'. The episode was shot on location in Ghana, and formed part of the BBC's 'Africa Lives' series, aiming \"to give the viewers a more rounded portrayal of African life and culture through special editions of favourite shows as well as new commissions.\""]}, {"page": "Jac Naylor", "response": ["Jac arrives at Holby City Hospital as part of a team performing a hemicorporectomy. She is initially unsuccessful in securing a permanent position as a registrar, but returns to the hospital in this capacity several weeks later. Jac develops a rivalry with her fellow registrar Diane Lloyd (Patricia Potter), which intensifies when they both apply for the same consultant post. Neither are successful, but Jac is disappointed when Diane is later promoted above her, to locum consultant and later to permanent consultant.", "Writers soon developed a rivalry between Jac and fellow registrar Diane Lloyd (Patricia Potter). The story sees the pair fight for the role of locum consultant, which Diane goes onto secure. A writer from the Liverpool Echo stated that Jac took credit for work Diane had done. They added \"Diane and Jac's working relationship hasn't exactly been an easy one to date, and it doesn't look as if it's going to improve\". The pair later argue over patient care. When a paroled murderer is admitted to Darwin ward, they disagree on the cause of his pain. Jac decides to take over the case and orders x-rays to confirm her diagnosis. She goes to see consultant Dan Clifford (Peter Wingfield) and complains about having to work alongside Diane. He sides with Diane and throws Jac's diagnosis in the bin. When Diane realises that Jac was correct about the man's condition she is forced to apologise."]}, {"page": "Ruth Ryan Langan", "response": ["|Patricia Potter", "|Patricia Potter"]}, {"page": "1975 in British television", "response": ["* 3 March – Patricia Potter, actress"]}, {"page": "Karen Hollins", "response": ["When Karen becomes pregnant, she does not want to have the baby, unlike husband Rob (Chris Walker). She informs him that she wants to have an abortion, which he disagrees with. She has the termination, and as a result, their relationship is initially strained. After Karen stays with her father for a while, she returns and tells Rob she wants to reconcile their marriage. After Rob saves her from a burning building, they have a romantic meal, which is constantly disrupted, however, Rob and Karen sleep in the same bed later that night. Karen's friend Angie Briggs (Den Woods) attempts to get her to see other men, but Karen refuses and stays with Rob. After Rob accidentally hits Karen with his car, she develops amnesia. She forgets who Rob and her children are, and believes she is 18. After she has recovered her memories and their children move out to attend higher education, Rob and Karen decide to become foster parents. Due to feeling incapable to be a foster parent, Rob meets with social worker Jane Fairweather (Patricia Potter) and lies to her by saying that Karen is unable to foster due to her history of amnesia. Jane informs Karen of this, who is angry with Rob due to feeling responsible for his state. When the pair foster Jayden Hunt (Ciaran Stow), a 14-year-old with epilepsy, they look into getting him medical aid for his seizures. They discover that Jayden has been using Karen's money to buy marijuana, since it eases his condition. Rob warns him not to do it again due to his police career being put at stake, but Karen disagrees. She meets with Iris Nicholson (Jenny Stokes), a local drug dealer, to buy Jayden marijuana. She is stopped by Rob's colleague, Pat Dyson (Dawn Butler), who states that she will not tell Rob. However, Karen later confesses what she has done to Rob, who is angry with her decision to go behind his back."]}, {"page": "Rob Hollins", "response": ["After Rob accidentally hits Karen with his car, she develops amnesia. She forgets who Rob and her children are, and believes she is 18. After she has recovered her memories and their children move out to attend higher education, Rob and Karen decide to become foster parents. Bren Lee (Andrea Gordon), the mother of Karen's colleague Ayesha (Laura Rollins), is brought into custody at the police station. Rob's colleague Emma Reid (Dido Miles) is shocked to find that Bren has died in police custody. Rob, the sergeant on shift at the time, had a blackout when he was due to be checking over Bren, and he confides in Emma that he feels responsible. Emma lies to the investigating officer, stating that Rob performed all of the checks diligently. Rob later confesses, and Emma is almost suspended. Ayesha struggles to forgive both Rob and Emma, due to feeling that the pair are trying to cover up a case of police brutality. Feeling responsible for Bren's death, Rob stops going to work and has heightened anger levels. He later approaches Ayesha, where he apologises. Due to feeling incapable to be a foster parent, Rob meets with social worker Jane Fairweather (Patricia Potter) and lies to her by saying that Karen is unable to foster due to her history of amnesia. Jane informs Karen of this, who is angry with Rob due to feeling responsible for his state. When the pair foster Jayden Hunt (Ciaran Stow), a 14-year-old with epilepsy, they look into getting him medical aid for his seizures. They discover that Jayden has been using Karen's money to buy marijuana, since it eases his condition. Rob warns him not to do it again due to his police career being put at stake, but Karen disagrees. She meets with Iris Nicholson (Jenny Stokes), a local drug dealer, to buy Jayden marijuana. She is stopped by Rob's colleague, Pat Dyson (Dawn Butler), who states that she will not tell Rob. However, Karen later confesses what she has done to Rob, who is angry with her decision to go behind his back."]}, {"page": "Characters of Holby City", "response": ["Patricia Potter plays Diane Lloyd, a general surgical registrar who appears between series four, episode 39 and series nine, episode 38. Diane has a disastrous love life, dating a number of hospital staff and marrying consultant obstetrician Owen Davies, who has an affair with his ex-wife, sister Chrissie Williams. Diane's storylines include a fling with nurse Danny Shaughnessy, aborting the child of Steve Waring and miscarrying Owen's child, the death of her sister, and facing an old medical schools teacher of hers who raped her. She also has an on/off relationship with Ric Griffin, who proposed marriage to her before her arrival in the serial, only to be turned down. Diane is promoted to locum general surgical consultant following the departure of Abra Durant. When the stress of the job becomes too much for her and Diane feels betrayed by Ric, she hands in her resignation. Consultant Elliot Hope suggests she take a sabbatical and lends her his car and a cottage to house-sit for a few months. Diane accepts the offer, but that evening parks the car on a railway line and commits suicide."]}, {"page": "List of awards and nominations received by Holby City", "response": ["| Patricia Potter as Diane Lloyd || ", "| rowspan=\"3\" scope=\"row\" | Best Actress || Patricia Potter as Diane Lloyd || ", "| Patricia Potter as Diane Lloyd || ", "| rowspan=\"2\" scope=\"row\" | Best Actress || Patricia Potter as Diane Lloyd || "]}, {"page": "Tuesday's Child (Holby City)", "response": ["\"Tuesday's Child\" is the 38th episode of the seventh series of the British medical drama television series Holby City. The episode was written by Andrew Holden and directed by Simon Meyers, and premiered on BBC One on 5 July 2005. In \"Tuesday's Child\", registrar Diane Lloyd (Patricia Potter) travels to Ghana in an attempt to persuade consultant Ric Griffin (Hugh Quarshie) to return to Holby and save Holby City Hospital's general surgery ward. Ric deals with family issues, whilst trying to secure funding for his brother's clinic."]}, {"page": "Potter (name)", "response": ["*Patricia Potter (born 1975), British actress"]}, {"page": "WPC 56", "response": ["* Patricia Potter as Charlotte Briggs (Series 3)"]}, {"page": "Diane Lloyd", "response": ["Diane Lloyd is a fictional character from the BBC medical drama Holby City, played by actress Patricia Potter. She first appeared in the series four episode \"High Risk\", broadcast on 2 July 2002. Diane arrives at the hospital to work as a surgical registrar. She is characterised as an \"ambitious\" female determined to succeed in a \"male-dominated world\". She is portrayed as unlucky-in-love and has numerous failed relationships during her time on the show."]}, {"page": "Bonobo (2014 film)", "response": ["* Patricia Potter as Sandra"]}, {"page": "Zubin Khan", "response": ["In May 2005, it was revealed that Malik had decided to move on to new roles away from the show. One of the character's last storylines occurs when a patient named Dominic Fryer (Simon Dutton) dies. Consultant cardiothoracic surgeon Connie Beauchamp (Amanda Mealing) decides to open an investigation into his death. She suspects that registrar Diane Lloyd (Patricia Potter) is responsible because Dominic had sexually assaulted her. When the results of a post-mortem are returned, it is revealed that he has died as a result of an anaestethic overdose while being operated on by Zubin. A writer from Inside Soap revealed that Zubin is left \"stunned\" by the revelation he may be to blame for Dominic's death. Dominic had chosen to remain conscious during the routine operation. Zubin had only entered the operating theatre because Diane was treating him when suddenly began fitting, requiring his assistance. Zubin could not understand why his health suddenly deteriorated."]}, {"page": "Absolutely Fabulous: 20th Anniversary", "response": ["* Patricia Potter as Royal Albert Hall manager"]}, {"page": "Holby City (series 21)", "response": ["* Patricia Potter as Diane Lloyd"]}, {"page": "Ed Keating", "response": ["During October 2002, writers had introduced transplant stories for Ed and Tom. When registrar Diane Lloyd (Patricia Potter) tells Ed that a potential heart donor has died, he wants to donate it to a young patient within his care. He argues with nurse Jess Griffin (Verona Joseph), who accuses him of being \"extremely uncaring\" for trying to claim her deceased patient's heart. Ed decides to bypass hospital protocol and points Nick Hadley (Christopher Smith) out to Joy Lester (Beverly Hills), the young girl's grieving mother, to influence her decision to donate. A Daily Record writer revealed that Tom soon discovers Ed's scheme and questions his ethics for attempting to accelerate a transplant procedure. They added that while Tom \"helped fast-track his career, he will not put his own position on the line for Ed's rash decisions.\""]}, {"page": "List of Doctors characters (2016)", "response": ["Doctors is a British medical soap opera which began broadcasting on BBC One on 26 March 2000. Set in the fictional West Midlands town of Letherbridge, the soap follows the lives of the staff and patients of the Mill Health Centre, a fictional NHS doctor's surgery, as well as its sister surgery located at a nearby university campus. The following is a list of characters that first appeared in Doctors in 2016, by order of first appearance. All characters are introduced by the programme's executive producer, Mike Hobson. Ricky Delaine (Neil Roberts) makes a guest appearance in February, while Ben Owens (James Daffern) is introduced in March as a short-term love interest for Niamh Donoghue (Jessica Regan). In April, couple Paul Cuthbert (Andy Moss) and Rhiannon Davis (Lucy-Jo Hudson) first appeared in April, as well as social worker Jane Fairweather (Patricia Potter). Police constable Tyler Green (David Atkins) debuted in October as a love interest for Ayesha Lee (Laura Rollins), followed by Lena Baker (Josephine Butler) in November as a love interest for Emma Reid (Dido Miles). Additionally, multiple other characters appear throughout the year.", "Jane Fairweather, portrayed by Patricia Potter, first appeared on 21 April 2016, and made her final appearance on 11 October 2017. Jane is a social worker that is introduced when Emma Reid (Dido Miles) enquires about Rhiannon Davis' (Lucy-Jo Hudson) history with her firstborn child. Jane informs her that Rhiannon had a drug addiction, and that her neglect of her eight-month-old child led to her having development issues. Jane arranges and attends a hearing on whether or not Rhiannon should have rights to care for her upcoming child, of which the consensus is that she can. Jane disagrees with the result, and pledges to have the baby taken into foster care. "]}]}}