{"wiki_id": "http://www.wikidata.org/entity/Q7148348", "itemLabel": "Patten Wilson", "itemDescription": "British illustrator (1869-1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patten_Wilson", "wikipedia_page": {"main": "Patten Wilson (1869 - 1934) was a British magazine and book illustrator.\nPatten Wilson, the son of a clergyman, was born on 23 March 1869 in Shropshire. His brother was the architect and designer Henry Wilson (1864-1934), who ran an extensive business as a sculptor and metalworker, as well as taught metalwork at the Royal College of Art and at the Central School of Arts and Crafts in London.\nAt age 19, Wilson dropped out of Kidderminster School of Art, and returned home to pursue a course of self-education, studying the work of Albrecht Dürer (1471-1528). In addition,  he made studies of animals and plants. His early designs were \"spirited and full of invention\".  Taking a number of jobs, including secretary to the managing director of the Liverpool gymnasium, he continued his artistic endeavors. His earliest published drawings appeared in the magazine Recreation.\nIn 1894 Wilson was introduced to the publisher John Lane, who gave him a commission to design and illustrate Miracle Plays by Katherine Tynan Hinkson in a series of black-and-white line drawings. Subsequently he was invited as a contributor to the newly launched \"The Yellow Book', which ultimately published thirteen of his drawings. His first contribution, titled “Rustem Firing the First Shot”, appeared in January 1895, Volume 4, and was inspired by a prose translation of the original epic poem, Rustem and Sohrab  by Matthew Arnold. He contributed two more illustrations to the poem in later volumes. Between 1895 and 1897,  Wilson also provided title-illustrations for a number of volumes published by The Bodley Head. He contributed an Arthurian illustration to The Builder Magazine in 1896 and several illustrations to The Architectural Review in 1898. That same year, he was commissioned to provide illustrations for a volume of poetry by Samuel Taylor Coleridge. In 1901 he was asked by J. M. Dent to create twenty illustrations for The Gospel Story of Jesus Christ, along with three other books for that publisher, including another one hundred illustrations for A Child's History of England by Charles Dickens. After 1905, he abandoned line drawings in favour of colour and half-tone, and moved into the fields of natural history and mythology.\nIn April 1900, Wilson married Alice Harding. He died on 22 January 1934 in Chelsea, London.\nBooks illustrated include -\nJ. S. Fletcher: Life in Arcadia (Ballantyne, Hanson, 1896)\nJ. S. Fletcher: God’s Failures (Lane, 1897)\nWalter C. Rhodes: A Houseful of Rebels (Constable, 1897)\nSamuel Taylor Coleridge: Selections From Coleridge (1898)\nIda W. Hutchison: The Gospel Story of Jesus (Hutchinson, 1901)\nT. W. H. Crossland: The Coronation Dumpy Book (Grant Richards, 1902)\nCatherine Gasgoine Hartley: Stories of Early British Heroes (Dent, 1902)\nCharles Dickens: A Child’s History of England (Dent, 1903)\nThe Sunday Dumpy Book For Children (Grant Richards, 1903)\nPatten Wilson: Daniel In The Lions’ Den (Sunday Dumpy Books For Children No 1) (Grant Richards, 1903)\nAugusta Klein; Anotole: A Romance of The Sea (Dent, 1904)\nVivien Phillipps: A Trip To Santa Claus Land, or Ruth’s Christmas Eve (Gay & bird, 1905)\nPatten Wilson: Nature Round The House (Longmans, 1907)\nMarianne Kirlew: Her Path To The Stars (Gay & Bird, 1907)\nCharles John Parrish: Animal Artisans and Other Studies of Birds and Beasts (Longmans, 1907)\nWilliam Samuel Furneaux; Field and Woodland Plants (Longmans, 1909)\nMaude I. Ebbutt; Hero-Myths and Legends of The British Race (Harrap, 1910)\nHomer: Odyssey (Harrap, 1911)\nSara Cone Bryant: Stories To Tell To Children (Harrap, 1912)\nLilian Gask: Legends of Our Little Brothers: Fairy Lore of Bird and Beast (Harrap, 1912)\nNathaniel Hawthorne: The Golden Touch (The Gorgon’s Head) (Wonder Book) (Constable, 1912)\nNathaniel Hawthorne: The Three Golden Apples (Constable, 1912)\nAgnes Herbert: The Moose (Black, 1913)\nMaud D. Haviland: Wild Life On The Wing (Black, 1913)\nLilian Gask: In The “Once Upon A Time” – A Fairy Tale of Science (Harrap, 1913)\nJoseph Henry Harris: Phyllis In Piskie Land: A Tale of Cornwall inspired by Lewis\nLewis Carroll: Carroll’s Wonderland (David Nutt, 1913)\nPatten Wilson: Book of The Zoo: An Animal Book For Old and Young (1913)\nFrederick John Snell: Boys Who Became Famous (Harrap, 1914)\nLilian Gask: True Stories About Horses (Harrap, 1914)\nSamuel Cox; The Signs of the Planets: A Book of Birthday Lore (Arthur Gray, 1932)\nSamuel Cox: What The Stars Predict For You: A Book of Birthday Lore (Arthur Gray, 1933)", "link_mentions": {}}}