{"wiki_id": "http://www.wikidata.org/entity/Q7147862", "itemLabel": "Patrick Wormald", "itemDescription": "British historian (1947-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Wormald", "wikipedia_page": {"main": "Charles Patrick Wormald (9 July 1947 – 29 September 2004) was a British historian born in Neston, Cheshire, son of historian Brian Wormald.\nHe attended Eton College as a King's Scholar. From 1966 to 1969 he read modern history at Balliol College, Oxford, where he was tutored by Maurice Keen and farmed out for tutorials with Michael Wallace-Hadrill (at that time a Senior Research Fellow at Merton College, Oxford) and Peter Brown (at that time a research fellow at All Souls College, Oxford). Wormald's potential was subsequently recognised by both Merton and All Souls when those colleges awarded him, respectively, the Harmsworth Senior Scholarship and a seven-year Prize Fellowship.\nWormald taught early medieval history at the University of Glasgow from 1974 to 1988, where his lectures drew huge enthusiasm from students. There he also met fellow-historian Jenny Brown, whom he married in 1980. They had two sons, but divorced in 2001. While at Glasgow, he became a participant in the Bucknell Group of early medievalists, hosted by Wendy Davies – the group taking its name from a village on the Welsh-English border where it often met. He delivered the Jarrow Lecture in 1984.\nFollowing a British Academy Research Readership (1987–89), Wormald returned to Oxford in 1989 as a college lecturer at Christ Church, where he was then appointed a fellow and university lecturer from 1990, tutoring students in medieval history. He delivered the Deerhurst Lecture in 1991 and the British Academy's Raleigh Lecture in History in 1995. In 1996 he gave the inaugural Richard Rawlinson Center Congress Lecture at the 31st International Congress on Medieval Studies in Western Michigan University in Kalamazoo, Michigan. His greatest work, which took many years to produce, was The Making of English Law, the first volume of which was published in 1999. Volume II was unfinished at the time of his death, although his extensive preparatory papers for the book have now been published online. Following his early retirement from Christ Church in 2001, he was re-engaged as a lecturer by the History Faculty at Oxford, and entered Wolfson College, Oxford. He was elected a fellow of the Society of Antiquaries of London in 2003, and that year also delivered the Brixworth Lecture.\nIn 2009, a collection of essays written by leading scholars in Wormald's honour was published under the title Early Medieval Studies in Memory of Patrick Wormald, edited by Stephen Baxter et al. The book is introduced by articles on Wormald's person and his academic output.", "link_mentions": [{"page": "Alfred the Great", "response": ["Alfred was a son of Æthelwulf, king of Wessex, and his wife Osburh. According to his biographer, Asser, writing in 893, \"In the year of our Lord's Incarnation 849 Alfred, King of the Anglo-Saxons\", was born at the royal estate called Wantage, in the district known as Berkshire (which is so called from Berroc Wood, where the box tree grows very abundantly).\" This date has been accepted by the editors of Asser's biography, Simon Keynes and Michael Lapidge, and by other historians such as David Dumville and Richard Huscroft. West Saxon genealogical lists state that Alfred was 23 when he became king in April 871, implying that he was born between April 847 and April 848. This dating is adopted in the biography of Alfred by Alfred Smyth, who regards Asser's biography as fraudulent, an allegation which is rejected by other historians. Richard Abels in his biography discusses both sources but does not decide between them and dates Alfred's birth as 847/849, while Patrick Wormald in his Oxford Dictionary of National Biography article dates it 848/849. Berkshire had been historically disputed between Wessex and Mercia, and as late as 844, a charter showed that it was part of Mercia, but Alfred's birth in the county is evidence that, by the late 840s, control had passed to Wessex.", "Alfred singled out in particular the laws that he \"found in the days of Ine, my kinsman, or Offa, king of the Mercians, or King Æthelberht of Kent who first among the English people received baptism\". He appended, rather than integrated, the laws of Ine into his code and although he included, as had Æthelbert, a scale of payments in compensation for injuries to various body parts, the two injury tariffs are not aligned. Offa is not known to have issued a law code, leading historian Patrick Wormald to speculate that Alfred had in mind the legatine capitulary of 786 that was presented to Offa by two papal legates.", "When one turns from the domboc's introduction to the laws themselves, it is difficult to uncover any logical arrangement. The impression is of a hodgepodge of miscellaneous laws. The law code, as it has been preserved, is singularly unsuitable for use in lawsuits. In fact, several of Alfred's laws contradicted the laws of Ine that form an integral part of the code. Patrick Wormald's explanation is that Alfred's law code should be understood not as a legal manual but as an ideological manifesto of kingship \"designed more for symbolic impact than for practical direction\". In practical terms the most important law in the code may well have been the first: \"We enjoin, what is most necessary, that each man keep carefully his oath and his pledge\" which expresses a fundamental tenet of Anglo-Saxon law.\"Alfred\" 2, in ."]}, {"page": "Bede", "response": ["Modern historians and editors of Bede have been lavish in their praise of his achievement in the Historia Ecclesiastica. Stenton regards it as one of the \"small class of books which transcend all but the most fundamental conditions of time and place\", and regards its quality as dependent on Bede's \"astonishing power of co-ordinating the fragments of information which came to him through tradition, the relation of friends, or documentary evidence ... In an age where little was attempted beyond the registration of fact, he had reached the conception of history.\" Patrick Wormald describes him as \"the first and greatest of England's historians\"."]}, {"page": "Bretwalda", "response": ["Over the later 20th century, this assumption was increasingly challenged. Patrick Wormald interpreted it as \"less an objectively realized office than a subjectively perceived status\" and emphasised the partiality of its usage in favour of Southumbrian rulers.. In 1991, Steven Fanning argued that \"it is unlikely that the term ever existed as a title or was in common usage in Anglo-Saxon England\"..  The fact that Bede never mentioned a special title for the kings in his list implies that he was unaware of one.  In 1995, Simon Keynes observed that \"if Bede's concept of the Southumbrian overlord, and the chronicler's concept of the 'Bretwalda', are to be regarded as artificial constructs, which have no validity outside the context of the literary works in which they appear, we are released from the assumptions about political development which they seem to involve... we might ask whether kings in the eighth and ninth centuries were quite so obsessed with the establishment of a pan-Southumbrian state\".."]}, {"page": "Æthelred the Unready", "response": ["The 'legend' of an Anglo-Saxon origin to the jury was first challenged seriously by Heinrich Brunner in 1872, who claimed that evidence of the jury was only seen for the first time during the reign of Henry II, some 200 years after the end of the Anglo-Saxon period, and that the practice had originated with the Franks, who in turn had influenced the Normans, who thence introduced it to England. Since Brunner's thesis, the origin of the English jury has been much disputed. Throughout the 20th century, legal historians disagreed about whether the practice was English in origin, or was introduced, directly or indirectly, from either Scandinavia or Francia. Recently, the legal historians Patrick Wormald and Michael Macnair have reasserted arguments in favour of finding in practices current during the Anglo-Saxon period traces of the Angevin practice of conducting inquests using bodies of sworn, private witnesses. Wormald has gone as far as to present evidence suggesting that the English practice outlined in Æthelred's Wantage code is at least as old as, if not older than, 975, and ultimately traces it back to a Carolingian model (something Brunner had done). However, no scholarly consensus has yet been reached."]}, {"page": "Edmund I", "response": ["The threat of divine retribution was important in a society which had limited coercive power to punish law breaking and disloyalty. The military historian Richard Abels argues that \"all\" (omnes) shall swear does not mean literally all, but should be understood to mean those men qualified to take oaths administered by royal reeves at shire courts, that is the middling and great landholders, and that Edmund's oath united his diverse peoples by binding them all to him personally. The emphasis on lordship is further seen in provisions setting out the duties of lords to take responsibility for their followers and stand surety for them. The code was also concerned to prevent theft, especially cattle rustling. The local community is required to cooperate in catching thieves, dead or alive, and to assist in tracking down stolen cattle, while trading had to be witnessed by a high reeve, priest, treasurer or port reeve. According to a provision described by the legal historian Patrick Wormald as gruesome: \"we have declared with regard to slaves that, if a number of them commit theft, their leader shall be captured and slain, or hanged, and each of the others shall be scourged three times and have his scalp removed and his little finger mutilated as a token of his guilt\". The code has the first reference to the hundred as an administrative unit of local government in a provision requiring anyone who refuses to assist in the apprehension of a thief to pay 120 shillings to the king and 30 shillings to the hundred."]}, {"page": "July 9", "response": ["*  1947   – Patrick Wormald, English historian (d. 2004)"]}, {"page": "September 29", "response": ["*  2004   – Patrick Wormald, English historian (b. 1947)"]}, {"page": "Witan", "response": ["For these reasons, in his study of the origins of the English parliament, he generally preferred the more neutral word 'assembly'. He described  as a rare 11th century usage, with only nine pre-Conquest examples, mainly in the crisis of 1051–52. Patrick Wormald was also sceptical, describing  as \"a word always rare and unattested before 1035\"."]}, {"page": "Æthelstan", "response": ["More legal texts survive from Æthelstan's reign than from any other tenth-century English king. The earliest appear to be his tithe edict and the \"Ordinance on Charities\". Four legal codes were adopted at Royal Councils in the early 930s at Grately in Hampshire, Exeter, Faversham in Kent, and Thunderfield in Surrey. Local legal texts survive from London and Kent, and one concerning the 'Dunsæte' on the Welsh border probably also dates to Æthelstan's reign.Pratt, \"Written Law and the Communication of Authority\", pp. 335–336, 345–346; Foot, Æthelstan: The First King of England, p. 137 In the view of the historian of English law Patrick Wormald, the laws must have been written by Wulfhelm, who succeeded Athelm as Archbishop of Canterbury in 926.Wormald, The Making of English Law, pp. 299–300  Other historians see Wulfhelm's role as less important, giving the main credit to Æthelstan himself, although the significance placed on the ordeal as an ecclesiastical ritual shows the increased influence of the church. Nicholas Brooks sees the role of the bishops as marking an important stage in the increasing involvement of the church in the making and enforcement of law.Foot, Æthelstan: The First King of England, pp. 138, 146–148; Pratt, \"Written Law and the Communication of Authority\", pp. 336, 350; Keynes, \"England, c. 900–1016\", p. 471; Brooks, The Early History of the Church of Canterbury, p. 218", "Historians differ widely regarding Æthelstan's legislation. Patrick Wormald's verdict was harsh: \"The hallmark of Æthelstan's law-making is the gulf dividing its exalted aspirations from his spasmodic impact.\" In his view, \"The legislative activity of Æthelstan's reign has rightly been dubbed 'feverish'... But the extant results are, frankly, a mess.\"Wormald, The Making of English Law, pp. 300, 308 In the view of Simon Keynes, however, \"Without any doubt the most impressive aspect of King Æthelstan's government is the vitality of his law-making\", which shows him driving his officials to do their duties and insisting on respect for the law, but also demonstrates the difficulty he had in controlling a troublesome people. Keynes sees the Grately code as \"an impressive piece of legislation\" showing the king's determination to maintain social order.Keynes, \"Royal government and the written word in late Anglo-Saxon England\", p. 237; Keynes, \"England, c. 900–1016\", p. 471 David Pratt describes his legislation as \"a deep and far-reaching reform of legal structures, no less important than developments under King Alfred two generations earlier\".Pratt, \"Written Law and the Communication of Authority\", p. 349"]}, {"page": "Celtic Christianity", "response": ["The term Celtic Church is deprecated by many historians as it implies a unified and identifiable entity entirely separate from that of mainstream Western Christendom.; ; ; ; Kathleen Hughes, The Church in Early English Society (London, 1966); W. Davies and P. Wormald, The Celtic Church (Audio Learning Tapes, 1980). For this reason, many prefer the term Insular Christianity. As Patrick Wormald explained, \"One of the common misconceptions is that there was a Roman Church to which the Celtic Church was nationally opposed.\""]}, {"page": "Synod of Whitby", "response": ["Both accounts basically agree, though Bede gives a much lengthier discourse on the debate. The description of the proceedings, where King Oswiu presides and rules but does not engage in the ecclesiastics' debate himself, parallels examples of other synods in other sources, such as one in the Vita Sancti Bonifati by Willibald (where King Ine of Wessex performed the same function as Oswiu).Catherine Cubitt, Anglo-Saxon Church Councils p. 6–7. Nonetheless, it is important to observe that the authors, despite their relatively good access to sources concerning the synod, still wrote at a distance, and the accounts, especially the quotations attributed to the participants, are more likely to be summaries of how Bede and Stephen understood the issue rather than something like true quotations. Further, the motivations of the authors influenced how they presented the material. Bede placed his description of the event centrally in his narrative, and he has been recognised as overemphasising the historical significance of the synod because Easter calculation was of special interest to him, and also because he wished to stress the unity of the English Church.Patrick Wormald, 'Bede and the 'Church of the English', in The Times of Bede, p. 211. However, Bede's accuracy as a historian has been well regarded by Anglo-Saxon scholars, and historians have generally been comfortable following Bede's basic presentation of the synod. Stephen's text has found more criticism, and Reginald Poole identified many of his inaccuracies, but Stephen's account of the synod did not suffer the same criticism as other passages in his work.see Poole, Reginald L. 'St. Wilfrid and the See of Ripon', in English Historical Review 34 (1919).", "The Synod of Whitby was just one of many councils held concerning the proper calculation of Easter throughout Latin Christendom in the Early Middle Ages.see C. W. Jones introductory text to his edition of Bedae Opera de Temproibus (Cambridge, Mass., 1946) pp. 55–104. It addressed the issues of Easter calculation and of the proper monastic tonsure,Patrick Wormald, 'Bede and the 'Church of the English', in The Times of Bede, p. 210. and concerned only the part of the English Church that answered to the See of Lindisfarne: that is, it was a Northumbrian affair. Wilfrid's advocacy of the Roman Easter has been called \"a triumphant push against an open door\", since most of the Irish had already accepted the Roman Easter and for that reason Iona \"was already in danger of being pushed to one side by its Irish rivals.\"Brown, Rise of Western Christendom, p. 361.", "Although the focus on Whitby is on the decisions on tonsure and dating of Easter, we might also see the synod as an important step in the eventual Romanisation of the church in England; even though this Romanisation might have occurred anyway without the Synod of Whitby.  Nonetheless, since the Protestant Reformation, the events of the synod have been symbolically interpreted as a \"Celtic Church\" opposing a \"Roman Church\", and the decision of Oswiu was thus interpreted as the \"subjugation\" of the \"British Church\" to Rome. There is a debate regarding the reality of a distinction between a pre-Whitby \"Celtic\" Church and a post-Whitby \"Roman\" Church. (Until fairly recently, the Scottish Divinity Faculty course on Church History ran from the Acts of the Apostles to 664 before resuming in 1560.) In the words of Patrick Wormald:", "From the days of George Buchanan, supplying the initial propaganda for the makers of the Scottish Kirk, until a startlingly recent date, there was warrant for an anti-Roman, anti-episcopal and, in the nineteenth century, anti-establishment stance in the Columban or \"Celtic\" Church. ... The idea that there was a \"Celtic Church\" in something of a post-Reformation sense is still maddeningly ineradicable from the minds of students.Patrick Wormald, 'Bede and the 'Church of the English', in The Times of Bede, p. 207."]}, {"page": "All Souls College, Oxford", "response": ["* Patrick Wormald"]}, {"page": "Coenwulf of Mercia", "response": ["The course of events in East Anglia is less clear, but Eadwald's coinage ceased, and new coinage issued by Coenwulf began by about 805, so it is likely that Coenwulf forcibly re-established Mercian dominance there.Kirby, Earliest English Kings, p. 179. The resumption of friendly relations with Wessex under Beorhtric received a setback when Beorhtric died and the throne of Wessex passed to Egbert, who, like Eadberht, had been an exile at Charlemagne's court.Sarah and John Zaluckyj, \"Decline\", in Zaluckyj & Zaluckyj, Mercia, p. 232. The Anglo-Saxon Chronicle records that on the same day that Egbert came to the throne, an ealdorman of the Hwicce named Æthelmund led a force across the Thames at Kempsford but was defeated by the men of Wiltshire under the leadership of Weohstan, also an ealdorman.Swanton, Anglo-Saxon Chronicle, pp. 58–59. Egbert may also have had a claim on the Kentish throne, according to the Chronicle, but he made no move to recover it during Coenwulf's reign.Kirby, Earliest English Kings, p. 189. Egbert appears to have been independent of Mercia from the beginning of his reign, and Wessex's independence meant that Coenwulf was never able to claim the overlordship of the southern English that had belonged to Offa and Æthelbald. He did, however, claim the title of \"Emperor\" on one charter, the only Anglo-Saxon king to do so before the 10th century.Patrick Wormald, \"The Age of Offa and Alcuin\", in Campbell et al. The Anglo-Saxons, p. 101."]}, {"page": "Æthelweard (historian)", "response": ["In the introduction to his Latin Chronicle Æthelweard claims to descend from King Æthelred,Antonia Gransden, Historical Writing in England: c. 500 to c. 1307, 1993, p. 37. while in Book IV he calls Æthelred his atavus, then uses the same term to describe the relationship between the chronicle's recipient, Mathilde, Abbess of Essen, and her great-great-grandfather, King Alfred.Alfred Anscombe, \"The Pedigree of Earl Godwine\" in Transactions of the Royal Historical Society, 1913, 3rd Series, vol. 7, pp. 129-150 According to Patrick Wormald, Æthelweard may have meant that Æthelred was his great-grandfather, great-great-grandfather, great-great-great-grandfather, or merely ancestor,Wormald, Æthelweard but Sean Miller specifies great-great-grandfather. In 957 King Eadwig, the great-grandson of King Æthelred I's brother, Alfred the Great, was obliged to divorce Æthelweard's likely sister Ælfgifu on the grounds of consanguinity."]}, {"page": "Ine of Wessex", "response": ["The laws made separate provision for Ine's English and British subjects, favouring the former over the latter; the weregilds paid for Britons were half of those paid for Saxons of the same social class, and their oaths also counted for less.Yorke, Barbara. 1995. Wessex in the Early Middle Ages. P.72. The evidence they provide for the incomplete integration of the two populations is supported by research into placename history, the history of religious houses, and local archaeology, which indicates that the western part of Wessex was thinly settled by the Germanic newcomers at the time the laws were issued. It is notable that, although issued by the Saxon king of a Saxon kingdom, the term used in the laws to define Ine's Germanic subjects is Englisc. This reflects the existence, even at this early date, of a common English identity encompassing all the Germanic peoples of Britain.Patrick Wormald, \"Bede, the Bretwaldas and the origins of the Gens Anglorum\", in Patrick Wormald, The Times of Bede – studies in early English Christian society and its historian (Oxford 2006), pp. 106–34 at p. 119"]}, {"page": "Frederic William Maitland", "response": ["Beginning in the 1960s, scholars such as S. F. C. Milsom and Patrick Wormald began to point out shortcomings in Maitland's views, which had by then become the orthodoxy, although the criticisms were inevitably coupled with sincere admiration for Maitland. The highly technical nature of Maitland's work, as well as the relative decline of legal history, made Maitland's views \"lasting orthodoxies\", as few historians had either the technical knowledge or the inclination to challenge them. Speaking on the centenary of the publication of Pollock and Maitland, Milsom said that:\"if we go on as we are, we can look forward to our successors celebrating the bicentenary of 'Pollock and Maitland' as still the last word on the history of English law in its most crucial period. I wonder whether he would be pleased.\""]}, {"page": "Neston", "response": ["* Patrick Wormald (1947 in Neston – 2004) a British historian and academic"]}, {"page": "Wiglaf of Mercia", "response": ["The Chronicle reports that in 830, Wiglaf \"obtained the kingdom of Mercia again\".Swanton, Anglo-Saxon Chronicle, pp. 62–63  Wiglaf's return to the throne has generally been taken by historians to indicate the end of Ecgberht's overlordship of Mercia.For example, Blair (Roman Britain, p. 219) comments that Mercia \"recovered its independence\"; and Yorke (Kings and Kingdoms, p. 122) says that Mercia under Wiglaf was \"secure in [his] control of [his] Midland heartlands\".  In particular, historian Frank Stenton argued that the wording of the Chronicle makes it probable that Wiglaf recovered the kingdom by force, and that if Ecgberht had given the kingdom to Wiglaf this would have been recorded.F. M. Stenton, Anglo-Saxon England, pp. 233f. A charter of 836 has also been cited as evidence that Wiglaf was acting as an independent ruler at that time; it records a council at Croft, in Leicestershire, attended by the Archbishop of Canterbury and eleven bishops, including some from West Saxon sees.  Wiglaf refers to the assembly as \"my bishops, duces, and magistrates\", indicating not only a recovery of control over his own territory, but some level of authority over the southern church.Stenton, Anglo-Saxon England, pp. 233–234.  It is significant that Wiglaf was still able to call together such a group of notables; the West Saxons, even if they were able to do so, held no such councils.Patrick Wormald, \"The Age of Offa and Alcuin\", p. 128, in Campbell et al., The Anglo-Saxons.Patrick Wormald, \"The Ninth Century\", p. 138, in Campbell et al., The Anglo-Saxons.  Essex, which had been a Mercian dependency, may have been brought back under Mercian overlordship: a King Sigeric of the East Saxons, described as a minister of Wiglaf's, witnessed a charter in Hertfordshire at some point between 829 and 837.Yorke, Kings and Kingdoms, p. 51.  London, where Ecgberht apparently lost control of the mint, remained a Mercian town through Wiglaf's second reign and beyond.  Berkshire also appears to have returned to Mercian control, though it is possible that this did not occur until after Wiglaf's reign.  Perhaps more surprisingly, given the new strength of Wessex, it appears that the territory along the middle Thames which had formed the heartland of the Gewisse (the precursor people of the 9th-century West Saxon state) remained firmly in Mercian hands.  In the west, either Wiglaf or his successor, Beorhtwulf, brought the Welsh back under Mercian control at some point prior to 853, when a rebellion against Mercia is recorded.", "Both Wessex's sudden rise to power in the late 820s, and the subsequent failure to retain this dominant position, have been examined by historians looking for underlying causes.  Dynastic uncertainty has been suggested as the reason for Mercia's collapse; the 820s were certainly years of instability in the royal line.Patrick Wormald, \"The Age of Offa and Alcuin\", in Campbell, The Anglo-Saxons, p. 128.  The lack of detailed information about Mercian and Wessex administration makes other theories hard to evaluate: for example, it has been suggested that the West Saxons had a stable tributary system that contributed to its success, or that Wessex's mixed Saxon and British population, natural frontiers, and capable administrators were key factors.", "The 836 charter also contains an early reference to the trimoda necessitas, the set of three obligations that kings of the era placed on their subjects.  These duties were the building of royal residences, the obligation to pay feorm, or food rent, to the king, and hospitality to the king's servants.Stenton, Anglo-Saxon England, p. 289.\"I will free them from entertainment of king and ealdormen, and from all building of the royal residence, and from that burden which we call in Saxon fæstingmen\".  Whitelock, English Historical Documents, p. 478.  The privileges granted came at a cost: Wiglaf and one ealdorman received life interests in estates, and another ealdorman was paid six hundred shillings in gold.Whitelock, English Historical Documents, p. 479.Patrick Wormald, \"The Ninth Century\", in Campbell, The Anglo-Saxons, pp. 138–139.  It is perhaps notable that, in common with many other Mercian charters of the 9th century, this grant is of privileges rather than land: the chronicler Bede had commented a century earlier that excessive grants of land to monasteries were leaving kings without land to grant to the nobility, and the Mercian kings may have been responding to this problem.", "Wiglaf was buried at Repton, in a crypt which still can be seen.Patrick Wormald, \"The Age of Bede and Æthelbald\", in Campbell, The Anglo-Saxonbs, p. 95.  The monastery church on the site at that time was probably constructed by Æthelbald of Mercia to house the royal mausoleum; other burials there include that of Wigstan, Wiglaf's grandson.Fletcher, Who's Who, pp. 98–100.Swanton, The Anglo-Saxon Chronicle, pp. 48–49.Fletcher, Who's Who, p. 116.  The vault and columns in the crypt are not original and may date from Wiglaf's time rather than Aethelbald's."]}, {"page": "Peace (law)", "response": ["Unlike medieval England, there is no strong evidence \"for a strong conceptual and ideological royal peace\" concept in medieval Scotland; however, historian Alan Harding argues that 12th-century royal brieves of protection issued by Scottish kings implicitly reflect the same concept. Historian Patrick Wormald suggests that Anglo-Saxon law and Scots law developed in parallel, and that the \"seminal notion of vesting social security in the protection afforded by the king's peace\" applied in both Scotland and England, with very early origins. "]}, {"page": "Beorhtwulf of Mercia", "response": ["The synod at Croft held by Wiglaf in 836, which Beorhtwulf may have attended, was the last such conclave called together by a Mercian king.  During Beorhtwulf's reign and thereafter, the kingdom of Wessex had more influence than Mercia with the Archbishop of Canterbury. A charter of 840 provides evidence of a different kind concerning Beorhtwulf's relations with the church.  The charter concerns lands that had originally been granted by Offa to the monastery of Bredon in Worcestershire.  The lands had come under the control of the church in Worcester, but Beorhtwulf had seized the land again.  In the charter Beorhtwulf acknowledges the church's right to the land, but forces a handsome gift from the bishop in return: \"four very choice horses and a ring of 30 mancuses and a skilfully wrought dish of three pounds, and two silver horns of four pounds ... [and] ... two good horses and two goblets of two pounds and one gilded cup of two pounds.\"Whitelock, English Historical Documents, 86, pp. 479–480.  A mancus was about  of gold; see Campbell, \"The East Anglian Sees Before the Conquest\", p. 119. This is not an isolated case; there are other charters that show Mercian kings of the time disputing property with the church, such as a charter of 849 in which Beorhtwulf received a lease on land from the bishop of Worcester, and promised in return that he would be \"more firmly the friend of the bishop and his community\" and, in the words of historian Patrick Wormald, \"would not rob them in future\".Wormald, \"The Ninth Century\", p. 139. Wormald suggests that this ruthless behaviour may be explained by the fact that landed estates were becoming harder to find, as so much land had been granted to monasteries.  The problem had been mentioned over a century before by Bede, who in a letter to Egbert, the Archbishop of York, had complained of \"a complete lack of places where the sons of nobles and of veteran thegns can receive an estate\".Wormald, \"The Ninth Century\", p. 139.  Wormald includes the quote from Bede, which is from chapter 11 of Bede's letter to Egbert. Beorhtwulf's concession of wrongdoing suggests that he could not rely on his nobles to support him in such a disagreement, and may indicate that his hold on the throne was insecure."]}, {"page": "Æthelwold ætheling", "response": ["After King Æthelred's death in 871, his sons' supporters complained about Alfred keeping property that should have belonged to his nephews. Alfred justified his conduct in a preamble to his will, which probably dates to the 880s. One of Alfred's biographers, Richard Abels, describes the text as \"rather tendentious\", and another, Alfred P. Smyth, as \"ambiguous and vague – and deliberately so\". Patrick Wormald views the will as \"one of the seminal documents of pre-Conquest history, and like many such not easily understood.\"", "In his own will, Alfred left the bulk of his property to Edward, while Æthelhelm was left eight estates, and Æthelwold only three (at Godalming and Guildford in Surrey, and Steyning in Sussex), all in the less important eastern part of the kingdom. The largest of these was Steyning, Æthelwulf's original burial place; in Patrick Wormald's view, Alfred may have moved the body to Winchester because he was required to give the estate to Æthelwold under his agreement with Æthelred, and he did not want his nephew to have the prestige of owning his grandfather's grave. Keynes and Lapidge comment: \"If only to judge from the relatively small number of estates he received, Æthelwold in particular would have had cause to be aggrieved by this allocation of property, and his resentment is shown by his rebellion against Edward soon after Alfred's death.\" Smyth argues that the meeting of the king's council, the witan, was bound to support him:"]}, {"page": "Anglo-Saxon law", "response": ["*Patrick Wormald, The Making of English Law: King Alfred to the Twelfth Century, Vol I, (Blackwell, 1999)"]}, {"page": "List of Balliol College, Oxford people", "response": ["* Patrick Wormald (1966)"]}, {"page": "Oxford History of England", "response": ["Many of the volumes are now considered to be key classic works for their respective periods. In recent years some of the volumes have been released as stand-alone works. A New Oxford History of England was commissioned in 1992 and has produced eleven volumes to date. At least six volumes are still forthcoming. John Bossy wrote in 1996 that the series \"does not much ring in the mind\" except for volumes 1, 2 and 15. Patrick Wormald in 1981 similarly praised the same volumes (and \"perhaps\" volume 12) as \"among the successes of a not entirely happy series\"."]}, {"page": "Beowulf: The Monsters and the Critics", "response": ["The historian Patrick Wormald wrote of the essay: \"it would be no exaggeration to describe [it] as one of the most influential works of literary criticism of that century, and since which nothing in Beowulf studies has been quite the same.\" However, Wormald continues: \"The arguments of Tolkien's paper were not universally accepted, and some of its effects would perhaps have been disowned by the author, but its general impact could be summarized by saying that most critics have learnt to take the Beowulf poet a great deal more seriously\". Wormald added that"]}, {"page": "Anglo-Saxon paganism", "response": ["Nonetheless, some academics still hold reservations about accepting it as containing information pertaining to Anglo-Saxon paganism, with Patrick Wormald noting that \"vast reserves of intellectual energy have been devoted to threshing this poem for grains of authentic pagan belief, but it must be admitted that the harvest has been meagre. The poet may have known that his heroes were pagans, but he did not know much about paganism.\" Similarly, Christine Fell declared that when it came to paganism, the poet who authored Beowulf had \"little more than a vague awareness of what was done 'in those days'.\" Conversely, North argued that the poet knew more about paganism that he revealed in the poem, suggesting that this could be seen in some of the language and references.", "The title of Bretwalda appears to have conveyed the status of some sort of formal or ceremonial overlordship over Britain, but it is uncertain whether it predates the 9th century, and if it does, what, if any, prerogatives it carried. Patrick Wormald interprets it as \"less an objectively realised office than a subjectively perceived status\" and emphasises the partiality of its usage in favour of Southumbrian kings.Wormald (118—119)."]}, {"page": "English nationalism", "response": ["Patrick Wormald has claimed that England was a nation by the time of the Venerable Bede, who wrote the Historia ecclesiastica gentis Anglorum (Ecclesiastical History of the English People) around 730.Patrick Wormald, 'The Venerable Bede and the \"Church of the English\"', Geoffrey Rowell (ed.), The English Religious Tradition and the Genius of Anglicanism (Wantage: Ikon, 1992), p. 26. Wormald attributes Bede with a decisive \"role in defining English national identity and English national destiny\".Wormald, p. 26. Bede uses the label \"English\" to describe the Germanic peoples who inhabited Britain: Angles, Saxons and Jutes, and excluding Britons, Scots and Picts.Hastings, p. 37. In the final paragraph to the preface of the Ecclesiastical History of the English People Bede departs from the usual word \"gens\" and instead uses the word \"natio\" to describe the \"historia nostrae nationis\": the history of our own nation. This is the first verbal appearance of the English nation.Hastings, p. 38.", "* Patrick Wormald, 'The Venerable Bede and the \"Church of the English\"', Geoffrey Rowell (ed.), The English Religious Tradition and the Genius of Anglicanism (Wantage: Ikon, 1992)."]}, {"page": "Bookland (law)", "response": ["The distinction in meaning between these terms is a consequence of Anglo-Saxon land law. The concept of bookland arose in the seventh century and referred to land that could be 'alienated' (i.e., disposed of) at will. It evolved to resemble ownership in the modern sense. Folkland was land held under ancient, unwritten folk-law or custom and by that custom it could not be alienated (i.e., removed) from the kin of the holder, except under special circumstances. No such claim by the kin could be made on bookland. The definition of those ancient folk-laws and customs, and the definition of the word folkland, has long been the subject of controversy. The model suggested by the historian Patrick Wormald, given in the definition above, allows for the graceful sidestepping of that controversy. Land."]}, {"page": "King's Scholar", "response": ["* Patrick Wormald (historian)"]}, {"page": "History of Christian thought on persecution and tolerance", "response": ["After the Fall of the Western Roman Empire, life in the West returned to an agrarian subsistence style of living, becoming somewhat settled sometime in the 500s.  Christian writers of the period were more concerned with preserving the past than in composing original works. The Germanic tribes which had overthrown Rome became the new rulers, dividing the empire between them. Gregory the Great became Pope in 590AD, and he sent out multiple missionaries who peacefully converted Britain, Ireland, Scotland and more. Learning was kept alive in the monasteries they built which became the sole source of education for the next few centuries.  Patrick Wormald indicates the Irish and English missionaries sent out to those territories that would become the Holy Roman empire and then Germany, thought of the pagans on the continental mainland with \"interest, sympathy and occasionally even admiration.\""]}, {"page": "Eardwulf of Northumbria", "response": ["Early evidence of friendly relations between Charlemagne and Offa is tempered by signs of strain. Charlemagne sheltered two exiles from England at his court: Odberht of Kent (probably Eadberht Praen) and Egbert of Wessex. Eadberht Praen ruled the Kingdom of Kent for a short time after Offa's death, but was deposed by Coenwulf. Egbert was more successful, taking and holding the throne of Wessex in 802.Kirby, Earliest English Kings, pp. 176, 189; Yorke, Kings and Kingdoms pp. 31–32, 121; Nelson, \"Carolingian Contacts\", pp. 137–139 & 141. It is clear that Mercian and Frankish interests could not always be reconciled and Frankish policy then moved towards support for Offa's opponents.Kirby, Earliest English Kings, p. 176. To Charlemagne this primarily meant Northumbria: according to Patrick Wormald, \"Charlemagne ... saw England as if it were ruled by two kings only: Æthelred ruling Northumbria and Offa ruling everything to the south\".Wormald, \"The Age of Offa and Alcuin\", p. 101. Frankish support for Northumbria thus appears to have been driven by a desire to counter Mercian influence in southern Britain, an area with long-standing ties to Francia.Nelson, \"Carolingian Connections\", p. 137–139. It has also been suggested that Charlemagne's interest in Northumbria was motivated by a desire for co-operation against Viking raiders, who had first appeared in Northumbria in the early 790s.Riché, Les Carolingiens, p. 134. Alternatively it may be that Charlemagne's conception of the sphere of his authority included Britain, which had once been part of the Roman Empire.Story, Carolingian Connections, pp. 162 & 166–167; Forsman, \"Appeal to Rome\"."]}]}}