{"wiki_id": "http://www.wikidata.org/entity/Q7141838", "itemLabel": "Pascoe Grenfell", "itemDescription": "British businessman and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Pascoe_Grenfell", "wikipedia_page": {"main": "Pascoe Grenfell (3 September 1761 – 23 January 1838) was a British businessman and politician.\n\n", "link_mentions": [{"page": "James Anthony Froude", "response": ["At Ilfracombe Froude met and soon married Charlotte Grenfell, Kingsley's sister-in-law and daughter of Pascoe Grenfell. The two moved first to Manchester and then to North Wales in 1850, where Froude lived happily, supported by his friends Arthur Hugh Clough and Matthew Arnold. Prevented from pursuing a political career because of legal restrictions on deacons (a position which was at the time legally indelible), he decided to pursue a literary career. He began by writing reviews and historical essays, with only sporadic publications on religious topics, for Fraser's Magazine and the Westminster Review. Froude soon returned to England, living at London and Devonshire, in order to research his History of England from the Fall of Wolsey to the Defeat of the Spanish Armada, on which he worked for the next twenty years. He worked extensively with original manuscript authorities at the Record Office, Hatfield House, and the village of Simancas, Spain."]}, {"page": "Taplow", "response": ["* Pascoe Grenfell (1761–1838), businessman and politician"]}, {"page": "Francis Grenfell, 1st Baron Grenfell", "response": ["Born the son of Pascoe St Leger Grenfell and Catherine Anne Grenfell (née Du Pre), and grandson of Pascoe Grenfell. Grenfell was educated at Milton Abbas School in Dorset but decided to leave school early."]}, {"page": "List of people from Cornwall", "response": ["* Pascoe Grenfell, businessman and politician"]}, {"page": "Baron St Just", "response": ["Baron St Just, of St Just in Penwith, County of Cornwall, was a title in the Peerage of the United Kingdom. It was created in 1935 for the banker Edward Grenfell. He was the son of Henry Grenfell, the grandson of Charles Grenfell, the great-grandson of Pascoe Grenfell and the first cousin of William Grenfell, 1st Baron Desborough. The title became extinct upon the death of his son, the second Baron, in 1984."]}, {"page": "George Glyn, 1st Baron Wolverton", "response": ["Lord Wolverton married Marianne Grenfell, daughter of Pascoe Grenfell, MP for Penryn, on 17 March 1823. They had nine sons and two daughters. Several of his sons gained distinction."]}, {"page": "Grenfell", "response": ["* John Pascoe Grenfell (1800–1869), British admiral in the Brazilian Navy", "* Pascoe Grenfell (1761–1838), British businessman and politician"]}, {"page": "Henry Grenfell", "response": ["His Cornish grandfather Pascoe Grenfell was a tin and copper manager and Member of Parliament (MP), while his father, Charles Pascoe Grenfell, was a director of the Bank of England from 1830 to 1864.  His maternal grandfather was William Philip Molyneux, 2nd Earl of Sefton."]}, {"page": "George Glyn, 2nd Baron Wolverton", "response": ["Wolverton was the eldest of the nine sons of the banker George Glyn, 1st Baron Wolverton, and his wife Marianne, daughter of Pascoe Grenfell. His grandfather Sir Richard Carr Glyn, 1st Baronet, of Gaunt's House, and great-grandfather Sir Richard Glyn, 1st Baronet, of Ewell, had been prominent London bankers, both had served as Lord Mayor of London."]}, {"page": "Francis Osborne, 1st Baron Godolphin", "response": ["* The Hon. Sidney Godolphin Osborne (1808–1889); became a religious minister. He was the grandfather of the 12th (and last) Duke of Leeds. Known for his letters to The Times signed S.G.O. as well as for his work during the Crimean War with Florence Nightingale and for his advocating for famine victims in the west of Ireland during the Great Irish Famine (1845–1853). See Osborne's Gleanings in the West of Ireland published in 1850 and his Scutari and its Hospitals published in 1855. Sidney married the sister of Pascoe Grenfell. Under Sidney's auspices, he arranged for his close friends Charles Kingsley and James Anthony Froude to marry his wife's two sisters. Kingsley memorializes the Grenfell sisters in his 1848 novel Yeast A Problem."]}, {"page": "Great Marlow (UK Parliament constituency)", "response": ["| Pascoe Grenfell"]}, {"page": "Penryn (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Pascoe Grenfell"]}, {"page": "Pascoe", "response": ["*Pascoe Grenfell (1761–1838), British businessman and politician", "*Pascoe Grenfell Hill (1804–1882), British priest in the Church of England and an author", "*John Pascoe Grenfell, (1800–1869), British officer in the Brazilian Navy"]}, {"page": "Royal Exchange Assurance Corporation", "response": ["*Pascoe Grenfell (1829–1838)"]}, {"page": "1838 in Wales", "response": ["*23 January - Pascoe Grenfell, industrialist and politician, 76"]}, {"page": "John Pascoe Grenfell", "response": ["John Pascoe Grenfell (20 September 1800 – 20 March 1869) was a British officer of the Empire of Brazil. He spent most of his service in South America campaigns, initially under the leadership of Lord Cochrane and then Commodore Norton. He was the nephew of British politician Pascoe Grenfell and grandfather to General Sir John Grenfell Maxwell.  In Brazil, he rose to the rank of admiral and for his achievements was made a knight grand cross of the Imperial Order of the Rose and a knight of the Imperial Order of the Southern Cross.Stewart, Charles Samuel, Brazil and La Plata, the personal record of a cruise, p. 335", "John Pascoe Grenfell was born in Battersea, Surrey on 20 September 1800 to John Maugham Grenfell and his wife Sophia Turner. In 1811 he entered the service of the British East India Company, and in 1819 he joined the Chilean Navy under Lord Cochrane. He took part in most of the conflicts undertaken by Lord Cochrane during the War of Chilean Independence, and rose to the rank of lieutenant. On 5 November 1820 Grenfell took part in the cutting out of the frigate Esmeralda and the following year in the pursuit of the Venganza and Prueba, the last major Spanish warships in the South Pacific.Vale, Brian Cochrane in the Pacific: Fortune and Freedom in Spanish America, I B Tauris, 2008 In 1823, he followed Lord Cochrane to Brazil, to fight in the Brazilian War of Independence. In August 1823, Grenfell now a Commander in the small brig Dom Miguel  sailed to Belem do Pará and using a similar tactic used by Lord Cochrane at Maranham, persuaded the Portuguese forces to surrender by making them think a larger fleet was in the offing.Vale, Brian Independence or Death! British Sailors and Brazilian Independence, I B Tauris, 1996 During the war with Argentina in 1826, he commanded the brig Caboclo as part of the squadron blockading Buenos Aires under (British) Commodore James Norton.  On 29 July, while engaged in a ship-to-ship engagement with the Argentine commander, Admiral William Brown, he lost his right arm.Vale, Brian A War Betwixt Englishmen: Brazil against Argentina in the River Plate 1825-30, I B Tauris, 2000 He then returned to England to recuperate."]}, {"page": "John Meeson Parsons", "response": ["He then settled in the city of London, and became a member of the Stock Exchange. Early in his London career he took an interest in railways, was elected an associate of the Institution of Civil Engineers on 5 Feb. 1839, and on 9 Feb. 1843 became a director of the London and Brighton Railway Company, of which he was appointed chairman on 19 June 1843. In this office he was succeeded by Pascoe Grenfell on 11 April 1844, and ceased to be a director on 21 Aug. 1848. He was also a director of the Shropshire Union Railway from 1845 to 1849."]}, {"page": "Sidney Glyn", "response": ["Glyn was a younger son of George Glyn, 1st Baron Wolverton, and his first wife Marianne, daughter of Pascoe Grenfell. George Glyn, 2nd Baron Wolverton, and Vice-Admiral the Hon. Henry Carr Glyn were his elder brothers while the Right Reverend the Hon. Edward Glyn, Bishop of Peterborough, was his younger brother. He was elected at the 1880 general election as the Member of Parliament (MP) for Shaftesbury, and held the seat until the constituency was abolished at the 1885 general election."]}, {"page": "Pascoe Glyn", "response": ["Glyn was a younger son of George Glyn, 1st Baron Wolverton, and his wife Marianne, daughter of Pascoe Grenfell. George Glyn, 2nd Baron Wolverton, Vice-Admiral the Hon. Henry Carr Glyn, Sidney Glyn and the Right Reverend the Hon. Edward Glyn, Bishop of Peterborough, were his brothers. He was returned to Parliament for Dorset East in December 1885, but only held the seat until July the following year."]}, {"page": "1803 in Wales", "response": ["**Pascoe Grenfell contracts to trade in copper in the Swansea area."]}, {"page": "Cecil Grenfell", "response": ["Grenfell was the son of Pascoe du Pré Grenfell, of Wilton Park, Beaconsfield, Buckinghamshire, grandson of Pascoe Grenfell. His mother was Sophia (née Grenfell). Cecil Grenfell was one of fifteen recorded children born to Pascoe and Sophia. His schooling included time at Eton. He married Lady Lilian Maud Spencer-Churchill, daughter of George Spencer-Churchill, 8th Duke of Marlborough, in 1898. They had two daughters."]}, {"page": "Charles Grenfell (1823–1861)", "response": ["Grenfell was the eldest son of Charles Grenfell and grandson of Pascoe Grenfell. His mother was Lady Georgiana Frances, daughter of William Molyneux, 2nd Earl of Sefton, while Henry Grenfell was his younger brother. His mother died when he was three years old."]}, {"page": "Charles Grenfell (1790–1867)", "response": ["Charles Pascoe Grenfell (4 April 1790 – 21 March 1867) was a British businessman and Liberal Party politician.", "Grenfell was the son of the Cornishman Pascoe Grenfell and Charlotte (née Grenfell). He was a director of the Bank of England from 1830 to 1864. He was also Chairman of the Board of Directors of the London Brighton and South Coast Railway from 1846 to 1848."]}, {"page": "Edward Carr Glyn", "response": ["Glyn was a younger son of George Glyn, 1st Baron Wolverton and Marianne, daughter of Pascoe Grenfell. He was the brother of George Glyn, 2nd Baron Wolverton, Sidney Glyn, Pascoe Glyn and Henry Glyn, a vice-admiral in the Royal Navy. He was educated at Harrow School and University College, OxfordWho was Who 1897–1990; London, A & C Black, 1991  and ordained in 1868.\"The Clergy List, Clerical Guide and Ecclesiastical Directory\" London, Hamilton & Co 1889"]}, {"page": "Brooks's", "response": ["*Pascoe Grenfell (1761–1838)"]}, {"page": "Pascoe St Leger Grenfell", "response": ["Pascoe St Leger was the second son of Pascoe Grenfell (1761–1838) and Georgiana St Leger and grandson of Pascoe Grenfell (1729–1810) and St Leger St Leger, 1st Viscount Doneraile. He was born 5 November 1798 in London, died 27 March 1879 in Nottingham, and was buried in the family vault in Taplow, Buckinghamshire. He was schooled at Eton College. He married twice, having 9 children by his first wife, one of whom was Field Marshal Francis Grenfell, 1st Baron Grenfell.", "Following the death of his father in 1838, Grenfell took control of Pascoe Grenfell & Sons, his father's and grandfather's copper and tin smelting businesses on the River Tawe, Swansea, Wales. On the abolition of slavery by Britain in 1833, Grenfell applied for compensation for the 347 slaves he owned in Jamaica."]}, {"page": "List of United Kingdom by-elections (1801–1806)", "response": ["| 14 December 1802 || Great Marlow || u* || Thomas Williams || Pascoe Grenfell || died"]}, {"page": "Truro Cathedral School", "response": ["*Pascoe Grenfell (1761–1838), member of parliament"]}, {"page": "Sydney Godolphin Osborne", "response": ["Osborne married in 1834 Emily, daughter of Pascoe Grenfell of Taplow Court, Buckinghamshire; and was therefore brother-in-law to Charles Kingsley and James Anthony Froude. His wife died on 19 December 1875, leaving two sons and two daughters."]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|Pascoe Grenfell||Whig"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Pascoe Grenfell"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Thomas Williams – died  Replaced by Pascoe Grenfell 1802"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Pascoe Grenfell"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Pascoe Grenfell"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| Pascoe Grenfell"]}]}}