{"wiki_id": "http://www.wikidata.org/entity/Q7146378", "itemLabel": "Patrick Dollan", "itemDescription": "Scottish politician, activist and writer (1885-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Dollan", "wikipedia_page": {"main": "Sir Patrick Joseph Dollan (3 April 1885 – 30 January 1963) and his wife, Agnes, Lady Dollan (née Moir; 16 August 1887 –16 July 1966) were Glasgow activists in the Scottish Independent Labour Party. During the First World War they campaigned against the Munitions of War Act of 1915 which suspended trade unionists' rights for the duration of hostilities.", "link_mentions": [{"page": "Baillieston", "response": ["* Sir Patrick Dollan - Lord provost of Glasgow, 1939–1942"]}, {"page": "List of provosts of Glasgow", "response": ["*1938–1941 – Sir Patrick Dollan  (Labour)"]}, {"page": "Kinning Park", "response": ["Andrew Boa was also involved in the formation of Kinning Park Co-Operative SocietyPatrick Dollan (1923), Jubilee History of the Kinning Park Co-Operative Society, Kinning Park Co-Operative Society Ltd in 1871 which flourished up until 1952, opening retail and manufacturing premises in Kinning Park and many other neighbouring districts south of the Clyde."]}, {"page": "Mary Barbour", "response": ["In 1920, Barbour stood as the Labour candidate for Fairfield ward in Govan, and was elected to Glasgow Town Council, becoming the one of the city's first woman councillors. While Barbour has often been credited as being 'the first Labour woman councillor in Glasgow', this is not the case. Barbour was one of a pioneering group of five women who were elected in 1920 which included Eleanor Stewart (Maryhill) as the other Labour woman councillor, and Jessica Baird-Smith, Mary Bell and Mary Anderson Snodgrass all respectively elected as Moderate councillors. It would appear that the misconception about Barbour being the \"first Labour woman councillor\" originated in Patrick Dollan's book about the Kinning Park Co-operative Society, published in 1923. While standing for election, Barbour stated that \"the advent of a woman candidate was seen by some men and women as outrageous\", but contended that women councillors were needed to tackle issues that affected women and children."]}, {"page": "Ayr Burghs (UK Parliament constituency)", "response": ["thumb|120px|Patrick Dollan"]}, {"page": "Dollan", "response": ["#REDIRECT Patrick Dollan"]}, {"page": "Dollan Baths", "response": ["Designed by Alexander Buchanan Campbell and named after former Lord Provost Sir Patrick Dollan, it was opened in 1968 as Scotland's first 50-metre (although not Olympic standard) swimming pool.  It consists principally of pre-stressed concrete and imitates a colossal marquee - the vaulted 324 ft parabolic arched roof appears to be held down by pairs of 'V' shaped-struts that meet the ground at a 30° angle."]}, {"page": "Alexander Buchanan Campbell", "response": ["One of Buchanan Campbell's most notable works was the Dollan Baths complex in East Kilbride (opened 1968 and named after former Lord Provost Sir Patrick Dollan). Influenced by the Beaux-Arts style, his time with Coia and works of Pier Luigi Nervi and Kenzo Tange, the significance of Buchanan Campbell's Dollan Baths was recognised when Historic Scotland listed it as Category A in 2002."]}, {"page": "Politics of Glasgow", "response": ["|1934–1938: Patrick Dollan (Labour)"]}, {"page": "Anchor Line (steamship company)", "response": ["Patrick Dollan, Provost of Glasgow summed the feeling up in an article:"]}, {"page": "1933 Glasgow Corporation election", "response": ["A split between Labour and the Independent Labour Party had ensued a year prior, although Patrick Dollan; a Glaswegian socialist of Irish descent, was able to keep the bulk of the Glasgweian-based ILP on-side. Despite strong support for Labour amongst Glaswegians of Catholic-Irish origin, only 6 out of Glasgow's 116 Councillors following the election were Catholic."]}, {"page": "Scottish Socialist Party (1932)", "response": ["By the early 1930s, there was strong support in the Independent Labour Party (ILP) for disaffiliation from the Labour Party.  This came to a head after the Labour Party refused to endorse ILP candidates at the 1931 general election.  Several leading Scottish members disagreed with the ILP's moves to disaffiliate, including chairman of the Scottish ILP Patrick Dollan, David Kirkwood, who was one of the party's five MPs, and former MP Tom Johnston.  They formed the Scottish Independent Labour Party Affiliation Committee in 1932, campaigning to reverse the policy.  However, this open opposition to a key party policy was not accepted by the majority in the ILP, and the three were expelled in mid-August.  They formed the Scottish Socialist Party at the end of the month, and were immediately successful in affiliating it to the Labour Party.  The new party initially claimed to have 1,000 members, and by November, it claimed 2,200.  This compared with 3,300 Scottish ILP members before the split.James Jupp, The Radical Left in Britain: 1931-1941, p.47"]}, {"page": "Aitken Ferguson", "response": ["At the 1924 Glasgow Kelvingrove by-election, Ferguson stood again.  The Independent Labour Party opposed his candidacy, initially championing Patrick Dollan as a possible Labour candidate, but Dollan withdrew his name, and on this occasion, Ferguson became the official Labour candidate.  However, Arthur Henderson objected to an advert in Workers Weekly, the CPGB newspaper, asking for donations for Ferguson's campaign, and setting out  radical policies.  Official sponsorship was not withdrawn, but Ferguson received no practical support from the national Labour Party.  He increased his vote total to over 11,000, but again missed out as many Liberal Party supporters voted tactically for the Conservative."]}, {"page": "Agnes Dollan", "response": ["Dollan had met Patrick Dollan, a journalist and member of the Independent Labour Party, via the Clarion Scouts. Dollan was married on 20 September 1912, and her only child, James, was born in 1913, and she was exempted from religious instruction at school. James Dollan also became a journalist."]}, {"page": "Mary Burns Laird", "response": ["The Glasgow Women's Housing Association was formed on the eve of the First World War in 1914 with support from the Women's Labour League and the Housing Committee of the Glasgow Labour Party, although the organisation was non-political in its membership and commitments. The organisation became a driving force in supporting the 1915 rent strike, and its formation has been described as the major 'pre-war organizational effort' in support of the strikes. In 1915 the Glasgow Women's Housing Association organised a number of meetings in Morris Hall on Shaw Street in Govan to protest rent increases across Glasgow. The first of these meetings, on 16 February, was chaired by Laird and addressed by John S. Taylor, Patrick Dollan and Harry Hopkins. Laird also played a prominent part in another meeting which took place in St Mungo's Halls. In her role as Chair of the Glasgow Women's Housing Association, Laird criticised tenement housing, stating that these were a challenge for housewives, advocating instead the establishment of  \"cottage homes\"."]}, {"page": "Arthur Brady (politician)", "response": ["With Patrick Dollan and a number of ILP Members of Parliament, Brady founded the Scottish Socialist Party (SSP), which sought to continue ILP policies while re-affiliating to the Labour Party.  Brady was elected as the group's general secretary, and successfully affiliated the group to Labour.  He represented it on the Scottish Council of Labour until it dissolved in 1940, and afterwards served for a while as Chairman of the Scottish Labour Party."]}, {"page": "Sikorski Club", "response": ["Sikorski Club, also known as the Sikorski Polish Club, is a historic Polish club in Glasgow, Scotland. It was founded as the Polish Social and Educational Society in 1954. The building, known as Sikorski House, was donated by Sir Patrick Dollan. It was named in honor of Władysław Sikorski, who served as the Prime Minister of Poland from 1939 to 1943. In 2016, its existence was jeopardized by a lack of funding for a mandatory renovation of its building."]}, {"page": "St Mungo Prize", "response": ["* Lord Provost Patrick Dollan (1940)"]}, {"page": "National Administrative Council", "response": ["|rowspan=10| Patrick Dollan"]}, {"page": "List of recipients of the Order of Industrial Heroism", "response": ["| 96 ||  || Railway guard || || || Co-operative Hall, Carlisle ||  || Award presented by Patrick Dollan."]}]}}