{"wiki_id": "http://www.wikidata.org/entity/Q7147224", "itemLabel": "Patrick Miller of Dalswinton", "itemDescription": "British banker", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Miller_of_Dalswinton", "wikipedia_page": {"main": "Patrick Miller of Dalswinton, just north of Dumfries (1731–1815) was a Scottish banker, shareholder in the Carron Company engineering works and inventor. Miller is buried in a tomb against the southern wall of Greyfriars Kirkyard in Edinburgh.", "link_mentions": [{"page": "Dumfries", "response": ["After working with Patrick Miller of Dalswinton, inventor William Symington intended to carry out a trial in order to show than an engine would work on a boat without the boat catching fire. The trial finally took place on Dalswinton Loch near Dumfries on 14 October 1788. The experiment demonstrated that a steam engine would work on a boat. Symington went on to become the builder of the first practical steamboat."]}, {"page": "Steamboat", "response": ["Meanwhile, Patrick Miller of Dalswinton, near Dumfries, Scotland, had developed double-hulled boats propelled by manually cranked paddle wheels placed between the hulls, even attempting to interest various European governments in a giant warship version,  long. Miller sent King Gustav III of Sweden an actual small-scale version,  long, called Experiment. Miller then engaged engineer William Symington to build his patent steam engine that drove a stern-mounted paddle wheel in a boat in 1785. The boat was successfully tried out on Dalswinton Loch in 1788 and was followed by a larger steamboat the next year. Miller then abandoned the project."]}, {"page": "Alexander Nasmyth", "response": ["Nasmyth was born in Edinburgh on 9 September 1758. Endnote: For an account of the Nasmyth family see James Nasmyth’s Autobiography (1883) He studied at the Royal High School and the Trustees’ Academy and was apprenticed to a coachbuilder. Aged sixteen, he was taken to London by portrait painter Allan Ramsay where he worked on subordinate parts of Ramsay's works. Nasmyth returned to Edinburgh in 1778, where he worked as a portrait painter. Offered a loan by Patrick Miller of Dalswinton, Nasmyth left in 1782 for Italy, where he remained two years furthering his studies. In Italy he devoted most of his attention to landscape painting, and is recorded as having copied a work by Claude Lorrain.Macmillan 1986, p.142. Macmillan suggests that his interest in Classical landscape painting may have been due to the example of the Scottish artist Jacob More, then resident in Rome."]}, {"page": "Paddle steamer", "response": ["In 1787, Patrick Miller of Dalswinton invented a double-hulled boat that was propelled on the Firth of Forth by men working a capstan that drove paddles on each side.", "The next successful attempt at a paddle-driven steam ship was by Scottish engineer William Symington, who suggested steam power to Patrick Miller of Dalswinton. Experimental boats built in 1788 and 1789 worked successfully on Lochmaben Loch. In 1802, Symington built a barge-hauler, , for the Forth and Clyde Canal Company. It successfully hauled two 70-ton barges almost  in 6 hours against a strong headwind on test in 1802. Enthusiasm was high, but some directors of the company were concerned about the banks of the canal being damaged by the wash from a powered vessel, and no more were ordered."]}, {"page": "Thomas Dundas, 1st Baron Dundas", "response": ["Dundas followed his father in having an interest in Grangemouth and in the Forth and Clyde Canal, under construction from 1768 to 1790, and he would have been aware of the 1789 trials on the canal of Patrick Miller of Dalswinton's double-hulled paddle boat powered with a steam engine fitted by William Symington. In 1800 Dundas, as Governor of the Forth and Clyde Canal Company, engaged Symington to design a steam tug on the lines of a failed attempt by Captain John Schank for the Bridgewater Canal. At a meeting of the canal company's directors on 5 June 1800 Dundas \"produced a model of a boat by Captain Schank to be worked by a steam engine by Mr Symington\", and it was agreed this should be immediately put in hand."]}, {"page": "Dumfriesshire", "response": ["*Patrick Miller of Dalswinton, engineer and inventor"]}, {"page": "William Symington", "response": ["The banker Patrick Miller of Dalswinton, just north of Dumfries, had experimented with double hulled pleasure boats propelled by cranked paddle-wheels placed between the hulls, and he got Symington to build the patent steam engine with its drive into a pleasure boat built in 1785 which was successfully tried out on Dalswinton Loch near Miller's house on 14 October 1788. The trial was said to have been a success."]}, {"page": "Charlotte Dundas", "response": ["Development of experimental steam engined paddle boats by William Symington had halted when the sponsor, Patrick Miller of Dalswinton, abandoned the project. Symington had continued building steam pumping engines and mill engines. In 1793 he had developed a drive using a pivoted crosshead beam above the vertical cylinder to transmit power to a crank. "]}, {"page": "Thomas Miller, Lord Glenlee", "response": ["He was brother to Patrick Miller of Dalswinton."]}, {"page": "1815 in the United Kingdom", "response": ["* 9 December – Patrick Miller of Dalswinton, banker and steamboat promoter (born 1730)"]}, {"page": "Patrick Miller", "response": ["* Patrick Miller of Dalswinton (1731–1815), organised an early experimental steamboat"]}, {"page": "John Clerk of Eldin", "response": ["From an early age, Clerk had been interested in shipping, and had cultivated contacts among owners, sailors, and others involved in seafaring. He made the acquaintance of engineer and sometime naval architect Patrick Miller of Dalswinton, who encouraged Clerk's interest in nautical matters."]}, {"page": "Patrick miller of dalswinton", "response": ["#REDIRECT Patrick Miller of Dalswinton "]}, {"page": "Ellisland Farm", "response": ["Patrick Miller of Dalswinton wrote of the area in September 1810, saying;", "Patrick Miller of Dalswinton had offered Burns a choice of three farms, two on the rich holms of the River Nith's east side; and one, Ellisland, on the west bank, composed of a fertile strip along the river itself and stony fields between the river and the Dumfries road.Dougal, Page 282 – 3 Burns visited Ellisland on 27 February 1788 with James Tennant of Glenconner, a friend of himself and his father;McQueen, Page 122 taking James's advice he agreed to sign up to the seventy-six-year lease from his friend Patrick Miller of Dalswinton,Hogg, Page 178 taking up the lease of the farm at Whitsun (25 May) 1788. The lease was divided up into four periods of nineteen years, the rent for the first three years to be £50 per annum, and £70 thereafter.Hecht, Page 181"]}, {"page": "Greyfriars Kirkyard", "response": ["* Patrick Miller of Dalswinton (1731–1815) steamship inventor"]}, {"page": "1815 in Scotland", "response": ["* 9 December – Patrick Miller of Dalswinton, banker and steamboat promoter (born 1730)"]}, {"page": "Patrick Miller (politician)", "response": ["He was the son of Patrick Miller of Dalswinton, an Edinburgh banker.  He was a nephew of Sir Thomas Miller, 1st Baronet  and a first cousin of William Miller (1755–1846)."]}, {"page": "Experiment of Leith", "response": ["Experiment of Leith was a catamaran engineered by the Scottish banker Patrick Miller of Dalswinton, to be used by the Swedish fleet in the Russo-Swedish War (1788-90). By the time the ship reached Stockholm the war was, however, already over.\"Gustav III:s mystiska katamaran\", Vetenskapsradion Historia, Sveriges radio, 12 December 2013. Retrieved 18 August 2014."]}, {"page": "1787 in Scotland", "response": ["** Patrick Miller of Dalswinton demonstrates his design of manually-propelled paddleboat on the Firth of Forth."]}, {"page": "1789 in Scotland", "response": ["* December – steamboat experiments on the Forth and Clyde Canal by Patrick Miller of Dalswinton. "]}, {"page": "Adam Rolland", "response": ["He served as Depute Governor of the Bank of Scotland 1816 until death, replacing Patrick Miller of Dalswinton in this role."]}, {"page": "Kate Kemp", "response": ["Lord Barskimming and later Lord Glenlee was originally known as Sir Thomas Miller of Glenlee, the owner of the Barskimming Estate at the time of the Kemp's residence at Bridge House and the brother of Patrick Miller of Dalswinton who was Burns's landlord when he lived at Ellisland Farm."]}, {"page": "Charles Granville Stuart Menteath", "response": ["His daughter Philadelphia Stuart Menteath married John Francis Miller-Erskine, the Earl of Mar and Kellie, maternal grandson of Patrick Miller of Dalswinton.Gentleman's Magazine vol221"]}, {"page": "William Miller, Lord Glenlee", "response": ["His uncle was Patrick Miller of Dalswinton. His second son Major William Miller of the Royal Horse Guards is buried in the New Calton vault with Lord Glenlee.Inscription in the vault of Lord Glenlee, New Calton"]}]}}