{"wiki_id": "http://www.wikidata.org/entity/Q7143414", "itemLabel": "Pat Earles", "itemDescription": "professional footballer (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Earles", "wikipedia_page": {"main": "Patrick John Earles (born 22 March 1955 in Titchfield, Hampshire) is an English former footballer who played as a forward in the Football League for Southampton and Reading. He was a member of the Southampton squad which reached the 1976 FA Cup Final, and made over 250 appearances for Reading, scoring 85 goals, and helped the club win the Fourth Division title in 1979.\nHe then had a spell playing non-league football, with clubs including Road-Sea Southampton and Bognor Regis Town.\nEarles went on to work as a probation officer for Hampshire Probation Service.", "link_mentions": [{"page": "Reading F.C.", "response": ["| Pat Earles"]}, {"page": "Hugh Fisher (footballer)", "response": ["His greatest moment in a Southampton shirt came in the 1975–76 season. The Saints were having a mediocre season in Division 2, but on 3 January 1976, in an F.A. Cup third round match at the Dell, Saints were 1–0 down against Aston Villa when, in the 89th minute of the game, the ball was crossed into the area by David Peach. The ball was touched on by Pat Earles to Mick Channon and back to Fisher, who shot the ball into the goal through a crowd of defenders. This goal, Fisher's first for 16 months, kept his side in the competition."]}, {"page": "Road-Sea Southampton F.C.", "response": ["A number of former professionals played for Road-Sea Southampton during their Southern League days. These include Kevin Dawtry (former Southampton, Crystal Palace and Bournemouth), Pat Earles (former Southampton and Reading), goalkeeper Ian Turner (for Grimsby Town, Walsall and Southampton, where he played in the memorable 1976 FA Cup winning team), Paul Bennett (former Southampton, Reading and Aldershot) and Dean Mooney, the former Bournemouth striker."]}, {"page": "List of Reading F.C. seasons", "response": ["| align=left |  Pat Earles", "| align=left |  Pat Earles", "| align=left |  Pat Earles   Mike Kearney"]}, {"page": "List of Reading F.C. records and statistics", "response": ["| Pat Earles"]}, {"page": "Earles", "response": ["*Pat Earles (born 1955), English footballer"]}, {"page": "List of people from Hampshire", "response": ["*Pat Earles, footballer, was born in Titchfield"]}]}}