{"wiki_id": "http://www.wikidata.org/entity/Q7148245", "itemLabel": "Patsy Corcoran", "itemDescription": "footballer (1893-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patsy_Corcoran", "wikipedia_page": {"main": "Patrick Corcoran (16 June 1893 – after 1927), known as Paddy, Pat or Patsy Corcoran, was a Scottish professional footballer who played as an outside right for Clyde, Celtic and Hamilton Academical in the Scottish Football League, and for Plymouth Argyle in the English Football League.", "link_mentions": [{"page": "Moses Russell", "response": ["In the tour match against Boca Juniors on 9 July 1924, the home supporters invaded the pitch after their team had scored the opening goal and carried all eleven home players shoulder high around the stadium. After a half-hour delay, the referee restarted the match, but a further invasion was sparked when the referee awarded a penalty against the home side. When the match was again restarted, the Argyle players had agreed that Patsy Corcoran would take the spot-kick and miss. The ultra-competitive Russell was not prepared to accept this and pushed Corcoran aside and took the penalty himself. This prompted a further pitch invasion by the Boca fans and this time the match was abandoned."]}, {"page": "Fred Craig (footballer)", "response": ["In 1923, Craig was selected for the Home Scots v Anglo-Scots international trial match alongside Plymouth Argyle teammate Patsy Corcoran (with whom he had also played at Hamilton Academical), though neither gained a full cap."]}, {"page": "Pat Corcoran", "response": ["#REDIRECT Patsy Corcoran"]}, {"page": "Paddy Corcoran", "response": ["#REDIRECT Patsy Corcoran"]}, {"page": "Patrick Corcoran", "response": ["#REDIRECT Patsy Corcoran"]}, {"page": "History of Plymouth Argyle F.C.", "response": ["In the match against Boca Juniors on 9 July 1924, the Boca Juniors supporters invaded the pitch after their team had scored the opening goal and carried all eleven home players shoulder high around the stadium. After a half-hour delay, the referee restarted the match, but a further invasion was sparked when the referee awarded a penalty against the home side. When the match was again restarted, the Argyle players had agreed that Patsy Corcoran would take the spot-kick and miss, to prevent another pitch invasion. However, the ultra-competitive Russell was not prepared to accept this, and just before Corcoran was about to take the penalty he was pushed aside by Russell who took it himself and scored. This prompted a further pitch invasion by the Boca fans and this time the match was abandoned."]}, {"page": "British football clubs tours to South America", "response": ["In the match against Boca Juniors on 9 July 1924, the Boca Juniors supporters invaded the pitch after their team had scored the opening goal and carried all eleven home players shoulder high around the stadium. After a half hour delay, the referee restarted the match, but a further invasion was sparked when the referee awarded a penalty against the home side. When the match was again restarted, the Argyle players had agreed that Patsy Corcoran would take the spot-kick and miss, to prevent another pitch invasion. However, the ultra-competitive Russell was not prepared to accept this, and just before Corcoran was about to take the penalty he was pushed aside by Russell who took it himself and scored. This prompted a further pitch invasion by the Boca fans and this time the match was abandoned.Chapter 13: 1920-1930 by Colin Parsons on Green on Screen website"]}]}}