{"wiki_id": "http://www.wikidata.org/entity/Q7143866", "itemLabel": "Pat O'Keeffe", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_O%27Keeffe", "wikipedia_page": {"main": "Pat O'Keeffe (17 March 1883 – 16 August 1960, spelled by many sources as Pat O'Keefe), was a professional English boxer who became the British champion in both the welterweight and middleweight weight classes. His professional career spanned the years between 1902 and 1918. In 1914 he made an unsuccessful bid for the European heavyweight belt, losing to Georges Carpentier. Between 1907 and 1910 he left Britain and continued his boxing career in the United States, and then Australia. On the outbreak of World War I he joined the British Army to work as a Physical Training Instructor (PTI) and Recruiting Sergeant for the 1st Surrey Rifles. He won the Lonsdale Belt outright when he defeated Bandsman Blake at the National Sporting Club (N.S.C) on 28 January 1918, becoming British Middleweight Champion.O'Keeffe died on 16 August 1960 at the Mount Vernon Hospital in Middlesex, aged 77.", "link_mentions": [{"page": "Georges Carpentier", "response": ["Born in Liévin in Pas-de-Calais, Carpentier began his career by progressing up through the weight divisions, fighting in every division from welterweight upwards. After making his first professional bout at age 14, he was welterweight champion of France and of Europe in 1911, middleweight champion of Europe in 1912, and light heavyweight champion of Europe in 1913. On June 1, 1913, he beat \"Bombardier\" Billy Wells in Ghent, Belgium to become heavyweight champion of Europe. He defended his title in December against Wells, in January 1914 against Pat O'Keeffe and in London on July 16 he beat Ed \"Gunboat\" Smith to add the \"White Heavyweight Champion of the World\" to his European title. The white heavyweight title bout sported a purse worth 9,000 pounds sterling (equivalent to approximately $ in today's funds).", "|align=left| Pat O'Keeffe"]}, {"page": "Bombardier Billy Wells", "response": ["|align=left| Pat O'Keeffe"]}, {"page": "O'Keeffe", "response": ["* Pat O'Keeffe (1883–1960), English boxer"]}, {"page": "Lonsdale Belt", "response": ["! scope=\"row\" |  Pat O'Keeffe"]}, {"page": "List of British middleweight boxing champions", "response": ["|align=left | Pat O'Keeffe ", "|align=left | Pat O'Keeffe"]}, {"page": "Bandsman Jack Blake", "response": ["Blake was still unbeaten at middleweight and won fights against Nicol Simpson and Harry Reeve before losing to Pat O'Keeffe in May 1915. A year later he fought O'Keeffe for the British middleweight title, taking a twenty-round points decision to become champion. O'Keefe regained the title in January 1918, knocking Blake out in the second round. Blake lost to Army champion Corporal Tooley of the Grenadier Guards in April 1918, and his final fight was a win by fourth-round knockout against Arthur Cameron in 1921."]}, {"page": "Pat O'Keefe", "response": ["#REDIRECT Pat O'Keeffe"]}]}}