{"wiki_id": "http://www.wikidata.org/entity/Q7146637", "itemLabel": "Patrick Hall", "itemDescription": "British politician (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Hall_(politician)", "wikipedia_page": {"main": "Patrick Hall (born 20 October 1951) is a British Labour Party politician who was the Member of Parliament (MP) for Bedford from 1997 to 2010.  He was re-selected by the Labour Party as their candidate in Bedford for the 2015 general election, but failed to be re-elected to Parliament.", "link_mentions": [{"page": "October 20", "response": ["*  1951   – Patrick Hall, English lawyer and politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Patrick Hall", "| Patrick Hall"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Patrick Hall"]}, {"page": "Omar Khayam (drug dealer)", "response": ["In response, at a protest over their publication, Khayam dressed in the style of a suicide bomber. When newspapers traced his whereabouts, he initially refused to apologise, saying his protest was justifiable. However, he later appeared publicly alongside his local Labour MP of the time Patrick Hall to apologise, declaring his actions \"wrong, unjustified and insensitive\", adding \"by me dressing the way I did, I did just that, exactly the same as the Danish newspaper, if not worse. My method of protest has offended many people, especially the families of the victims of the July bombings. This was not my intention.\"'Suicide bomber' protester apologises - The Guardian - February 6, 2006 Hall said \"He acted on impulse - couple of friends, they got on the train and got to London, and I believe this was an impulsive, foolish reaction to what he saw was the offence of the publication of those cartoons.\""]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Bedford || Patrick Hall || Labour || Patrick Hall || Labour"]}, {"page": "Bedford (UK Parliament constituency)", "response": ["| Patrick Hall || Labour"]}, {"page": "List of United Kingdom MPs: H", "response": ["*Patrick Hall"]}, {"page": "2006 Islamist demonstration outside the Embassy of Denmark in London", "response": ["On 6 February 2006, Omar Khayam, accompanied by the chairman of his local mosque and by Patrick Hall MP apologised \"wholeheartedly\" to the families of the July 2005 London bombings and said it had not been his aim to cause offence. He said, \"Just because we have the right of free speech and a free media, it does not mean we may say and do as we please and not take into account the effect it will have on others. But by me dressing the way I did, I did just that, exactly the same as the Danish newspaper, if not worse.\""]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Patrick Hall, Bedford, 1997–2010"]}, {"page": "Bedford Civic Theatre", "response": ["A local campaign to Save Our Civic made up from members of the Amateur Dramatic Societies in Bedford and the surrounding area and other users of the Civic Theatre opposed the closure and conversion of the Theatre. They were supported by Patrick Hall, the town's former Member of Parliament, and Richard Fuller the current MP. However the Civic Theatre was closed in 2012, and the building now houses a Customer Service Centre for Bedford Borough Council."]}, {"page": "List of alumni of Oxford Brookes University", "response": ["*Patrick Hall - former MP"]}, {"page": "East of England Regional Select Committee", "response": ["| Patrick Hall MP"]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Bedford||style=\"background-color: \"| ||Labour||style=\"background-color: \"| ||Richard Fuller (C)||Gain.  Defeated incumbent Patrick Hall (L)"]}, {"page": "Richard Fuller (Conservative politician)", "response": ["Fuller stood as the Conservative candidate for the Bedford constituency in the 2005 general election, losing to the incumbent Labour MP Patrick Hall. Fuller stood again for the Bedford constituency in the 2010 general election, and was elected to office on 6 May 2010, replacing Patrick Hall. He was re-elected in the 2015 general election, but lost to the Labour candidate in the 2017 general election. As MP, Fuller led successful campaigns to retain key services at Bedford Hospital and to enable the establishment of Bedford Free School. Fuller launched a venture fund to invest in local businesses and ran the Bedford Community Business School. In October 2014, Fuller was one of 39 conservative MPs who voted in favour of recognising Palestine."]}, {"page": "Patrick Hall", "response": ["Patrick Hall may refer to:", "* Patrick Hall (politician) (born 1951), British Labour Party politician", "* Patrick Hall (singer), contestant on season 5 of American Idol", "* Patrick Hall (cricketer) (1894–1941), English cricketer", "* Patrick Hall (artist) (1906–1992), British artist", "* Patrick Hall (astronomer) (born 1968), Canadian-American astronomer "]}, {"page": "List of Old Bedford Modernians", "response": ["* Patrick Hall (born 1951), Labour MP"]}, {"page": "List of people from Bedford, England", "response": ["* Patrick Hall, Member of Parliament for Bedford and Kempston from 1997 to 2010"]}, {"page": "List of MPs who lost their seat in the 2010 United Kingdom general election", "response": ["|Patrick Hall"]}]}}