{"wiki_id": "http://www.wikidata.org/entity/Q7145614", "itemLabel": "Patricia Haines", "itemDescription": "British actress (1932-1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patricia_Haines", "wikipedia_page": {"main": "Patricia Haines (3 February 1932 – 25 February 1977) was an English actress, best known for her television work. She was married to Michael Caine from 1954 to 1962.", "link_mentions": [{"page": "Michael Caine", "response": ["Caine began his acting career at the age of 20 in Horsham, Sussex, when he responded to an advertisement in The Stage for an assistant stage manager who would also perform small walk-on parts for the Horsham-based Westminster Repertory Company who were performing at the Carfax Electric Theatre. Adopting the stage name \"Michael White\", in July 1953 he was cast as the drunkard Hindley in the Company's production of Wuthering Heights.Interview with Mike Ostler by Roxanne Blakelock (15 October 2004) for the British Library Theatre Archive Project at www.bl.uk. Retrieved 4 January 2012 He moved to the Lowestoft Repertory Company in Suffolk for a year when he was 21. It was here that he met his first wife, Patricia Haines.The Actors – Sir Michael Caine Q&A, Indie London at www.indielondon.co.uk. Retrieved 4 January 2012 He has described the first nine years of his career as \"really, really brutal\"Rob Carnevale, The Prestige – Michael Caine Interview, Indie London at www.indielondon.co.uk. Retrieved 4 January 2012 as well as \"more like purgatory than paradise\". He appeared in nine plays during his time at the Lowestoft Rep at the Arcadia Theatre with Jackson Stanley's Standard Players.", "Caine was married to actress Patricia Haines from 1955 to 1962. They had a daughter, Dominique (who was named after the heroine of Ayn Rand's novel, The Fountainhead).; He dated Edina Ronay (1961–1964), Natalie Wood (1965–1966), Bianca Jagger (1968–1970) and Jill St. John (1971).Michael Caine doles out relationship advice to David Walliams Zee News, 6 November 2009 Caine has been married to actress and model Shakira Baksh since 8 January 1973. They met after Caine saw her in a Maxwell House coffee commercial and a friend gave him her telephone number. He called her every day for ten days until she finally agreed to meet him. They have a daughter, Natasha Haleema.Births England and Wales 1837–2006  As a Christian married to a Muslim, he says \"no questions or issues ever come up\" and describes his wife's beliefs as \"very benign and peaceful.\"\"This much I know\". The Guardian. Retrieved 14 July 2015"]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Patricia Haines"]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |The trio investigate an operation run by an ex-Nazi doctor who is providing plastic surgery, and hence future anonymity, for international criminals. Craig and Sharron go undercover as an Italian gangster and his moll; however, Richard is forced to move in and masquerade as a vagrant, in order to provide a matching blood group for them (because vagrants provide the raw biological material for the operation).With Dermot Kelly, Anthony Bate, Patricia Haines, Paul Hansard, Robert Russell, Harry Towb"]}, {"page": "Bernard Kay", "response": ["Bernard Kay was married to the actress Patricia Haines from 1963 until her death from cancer in 1977. He never quite recovered from her death. He died on Christmas Day 2014, aged 86."]}, {"page": "Virgin Witch", "response": ["Virgin Witch is a British horror sexploitation film directed by Ray Austin and starring Ann and Vicki Michelle, Patricia Haines and Neil Hallett. The plot concerns a prospective model and her sister who join a coven of white wizards.", "Sisters Christine and Betty (Ann and Vicki Michelle) run away from home to find work as models. They are given a lift to London by Johnny (Keith Buckley), a businessman who is instantly attracted to Betty. Christine successfully auditions for unscrupulous modelling agent Sybil Waite (Patricia Haines) and is offered a weekend's work shooting an advert at a house in the country. Betty goes with her.", "*Patricia Haines as Sybil Waite "]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Charles Tingwell, John Cater, Patricia Haines, Edina Ronay"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Patricia Haines"]}, {"page": "The Adventures of Don Quick", "response": ["#The Quick and The Dead. The pair accidentally land their rocket in a live volcano crater and Sam is convinced he is dead and this is the afterlife. They meet an assortment of gods who unknown to them have made them immune to the heat so they can survive, so Quick thinks the volcano is not real. Patricia Haines as Aphrodite, Pauline Jameson as Hera, Graham Crowden as Zeus. Written by Keith Miles."]}, {"page": "List of former Emmerdale characters", "response": ["|Laura Verney || Patricia Haines || 1973"]}, {"page": "Night Caller from Outer Space", "response": ["While working nights at the lab, secretary Patricia Haines (Ann Barlow) see something moving in the lab. Dr Morley attempts to communicate with the creature, but he is killed. The creature escapes the lab. Costain begins to track the creature.", "* Patricia Haines as Ann Barlow "]}, {"page": "The Last Shot You Hear", "response": ["The Last Shot You Hear is a 1969 British thriller film directed by Gordon Hessler and starring Hugh Marlowe, Zena Walker, Patricia Haines, and William Dysart.", "* Patricia Haines as Anne Nordeck"]}, {"page": "The Rat Catchers", "response": ["Following a trail of traitors to Geneva, Hurst and Smith find the HQ of the people behind the brain drain is in Ireland. Also stars Patricia Haines, Bernard Kay, Edward Burnham and Tom Watson.", "The operation in Ireland looks to be nothing but trouble and they get more than they bargained for when Arlette Maylam (Patricia Haines) shows her true colours. Also stars John Macklin, Alan Gifford, Bernard Kay and Eugene Deckers."]}, {"page": "1977 in British television", "response": ["*25 February – Patricia Haines, 45, actress"]}, {"page": "Hadleigh (TV series)", "response": ["|Geoffrey Chater, Patricia Haines, Joanna Dunham, Joan Haythorne, Gerald James"]}, {"page": "Crane (TV series)", "response": ["1. The Death Of Mary Vetier. A beautiful woman brings murder and treachery into Crane's life. Patricia Haines as Marie, Peter Vaughan as Goddard, Gertan Klauber as Darius, Michael Hawkins as Martin."]}, {"page": "Walk a Crooked Path", "response": ["Walk a Crooked Path  is a 1969 British crime film directed by John Brason and starring Tenniel Evans, Faith Brook and Patricia Haines.BFI.org The film is set at a boarding school where a man plans to murder his wealthy teacher wife. It is sometimes known as Twilight Man.", "* Patricia Haines as Nancy Coleman"]}, {"page": "The Nutshell (The Avengers)", "response": ["* Patricia Haines as Laura "]}, {"page": "Skiboy", "response": ["Played by Patricia Haines (although played by Pauline Challoner in the episode Cold Shoulder). Jane is wife of the hotel owner, Jacques, and mostly helps prepare meals for the inhabitants of the building. She also approves a hatred relationship between Bobbie's dog, Gruff. In some other versions of the show, she is referred as \"Claire\"."]}, {"page": "Clue of the Silver Key", "response": ["* Patricia Haines as Policewoman"]}]}}