{"wiki_id": "http://www.wikidata.org/entity/Q714030", "itemLabel": "Martyn Ware", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Martyn_Ware", "wikipedia_page": {"main": "Martyn Ware (born 19 May 1956) is an English musician, composer, arranger, record producer, and music programmer. As a founding member of both the Human League and Heaven 17, Ware was partly responsible for hit songs such as \"Being Boiled\" and \"Temptation\".\nWare has also worked as a record producer, notably helping to revitalise Tina Turner's career in 1983 with \"Let's Stay Together\", kick starting Terence Trent D'Arby's career by co-producing his solo debut, Introducing the Hardline According to... in 1987 and producing Erasure's I Say I Say I Say album in 1994. He is also noted for work in surround sound technology and, more recently, for creation of sound installations.", "link_mentions": [{"page": "David Bowie", "response": ["Musicologist James Perone credited Bowie with having \"brought sophistication to rock music\", and critical reviews frequently acknowledged the intellectual depth of his work and influence. The Human League founder Martyn Ware remarked that Bowie lived his life \"as though he were an art installation.\" The BBC's arts editor Will Gompertz likened Bowie to Pablo Picasso, writing that he was \"an innovative, visionary, restless artist who synthesised complex avant garde concepts into beautifully coherent works that touched the hearts and minds of millions\". U2 lead singer Bono commented, \"I like Bowie when he’s evenly pulled in the direction of being a pop star and Picasso, where he's right down the middle. That’s usually my favorite, when the songwriting is disciplined but the recording is not. I love when he's pulled equally in the directions of art and populism.\""]}, {"page": "May 19", "response": ["*  1956   – Martyn Ware, English keyboard player, songwriter, and producer "]}, {"page": "Band Aid (band)", "response": ["*Martyn Ware (Heaven 17)"]}, {"page": "Heaven 17", "response": ["Heaven 17 is an English new wave and synth-pop band that formed in Sheffield in 1980. The band were a trio for most of their career, composed of Martyn Ware (keyboards) and Ian Craig Marsh (keyboards) (both previously of the Human League), and Glenn Gregory (vocals). Although most of the band's music was recorded in the 1980s, they have occasionally reformed to record and perform, playing their first ever live concerts in 1997. Marsh left the band in 2007 and Ware and Gregory continued to perform as Heaven 17.", "Ian Craig Marsh and Martyn Ware were the founding members of pioneering British electro-pop group the Human League; Glenn Gregory had been their original choice when seeking a lead singer for the band but he was unavailable at the time, so they chose Philip Oakey instead. When personal and creative tensions within the group reached a breaking point in late 1980, Marsh and Ware left the band, ceding the Human League name to Oakey. They formed the production company British Electric Foundation (B.E.F.).", "thumb|right|Martyn Ware on stage in 2014In the United States, their self-titled Heaven 17 album was a re-working of Penthouse and Pavement with three songs deleted and replaced by \"Let Me Go\", \"Who'll Stop the Rain\", and \"I'm Your Money\" (along with a different mix of \"The Height of the Fighting\"). American new wave audiences were most familiar with \"Let Me Go\", which received high rotation airplay on alternative rock and new wave format radio stations such as Los Angeles, California's KROQ-FM, and Long Island, New York's WLIR, plus frequent MTV exposure.", "In the run up to their 30th anniversary, the band announced several dates in which they would perform their 1981 debut album Penthouse and Pavement live in its entirety for the first time. The dates were scheduled over November and December 2010 with the first date held on 10 November 2010 at the well known Leadmill live music venue in Sheffield. By chance the Leadmill also celebrated a 30-year anniversary in 2010. By their own admission this Leadmill gig was one of the band's most successful. The band performed a couple of dates of the Penthouse and Pavement tour in March 2010, one of which was in Sheffield and was filmed and shown on BBC Two on 16 May 2010. An hour-long documentary about the making of the album was shown on BBC Two the following night. This film was also screened at a special \"Music in Sheffield\" evening of films at the Showroom in Sheffield, at which Martyn Ware attended, on the eve of the announcement of the City of Culture 2013."]}, {"page": "The Human League", "response": ["The only constant band member since 1977 has been lead singer and songwriter Philip Oakey. Keyboard players Martyn Ware and Ian Craig Marsh both left the band in 1980 to form Heaven 17. Under Oakey's leadership, the Human League then evolved into a commercially successful New Pop band,Harvel, Jess. \"Now That's What I Call New Pop!\". Pitchfork Media. 12 September 2005. with a new line-up including female vocalists Joanne Catherall and Susan Ann Sulley. Since the mid-1990s, the band have essentially been a trio of Oakey, Catherall and Sulley with various sidemen.", "Before adopting the name the Human League, the band briefly had two previous incarnations. In early 1977, Martyn Ware and Ian Craig Marsh, who had met at youth arts project Meatwhistle, were both working as computer operators. Their musical collaboration combined pop music (such as glam rock and Tamla Motown) with avant-garde electronic music. With the price of electronic components dropping in the mid-1970s, equipment became more affordable for the average consumer; Ware and Marsh purchased a Korg 700S synthesizer together and learned how to play it. Their musical reputation spread, and they were invited to play at a friend's 21st birthday party. For the party, Ware and Marsh formed themselves into an informal band called The Dead Daughters. Their live highlight was a rendition of the theme of the British TV series Doctor Who.", "Oakey states that when he found out the age of the girls and that they were best friends, he revised his plan for a single female and decided that the two girls could look after each other on the tour. Originally just wanting a single female singer to replace the high backing vocals originally provided by Martyn Ware, he says that he thought having two female vocalists/dancers would also add potential glamour to the band. Because of the girls' ages, Oakey and Wright later had to visit Sulley and Catherall's respective parents to obtain permission for the girls to go on the tour.", "In November and December 2008, the Human League got together with Martin Fry's ABC and Heaven 17 for 'The Steel City Tour' of the UK. This was Philip Oakey's concept of a joint tour of all three bands celebrating the original electronic music of early 1980s Sheffield (the titular Steel City). Much had been made in the UK media of the history between Heaven 17 and the Human League, the original events of 1980 and the fact they were now working together. Both Oakey and Martyn Ware said that any acrimony from that period had long since been forgotten. ", "* Martyn Ware – keyboards (1977–1980)", " bar:Ware text:\"Martyn Ware\""]}, {"page": "27th Annual Grammy Awards", "response": ["**Terry Britten, Carter, Leon \"Ndugu\" Chancler, Wilton Felder, Rupert Hine, Joe Sample, Greg Walsh & Martyn Ware, producers"]}, {"page": "Private Dancer", "response": ["Private Dancer is the fifth solo studio album by Tina Turner. It was released on May 29, 1984, through Capitol Records and was her first album released through the label. Recording sessions for the album took place at several studios in England and was overseen by four different production teams, including Rupert Hine, and Martyn Ware of Heaven 17. A radical departure from the rhythm and blues sound Turner had performed with her former husband and performing partner Ike Turner, the tracks in the album are a mixture of uptempos and ballads, inspired by pop and rock genres; it also features elements of smooth jazz and R&B.", "\"Let's Stay Together\" was produced by Martyn Ware of British band Heaven 17. Terry Britten produced the reggae-tinged \"What's Love Got to Do with It\". Rupert Hine produced \"Better Be Good to Me\", which had been written by Holly Knight, Mike Chapman, and Nicky Chinn, and most of the other songs.  John Carter produced \"Private Dancer\", which was written by Mark Knopfler and has a guitar solo by Jeff Beck. \"Help!\" was recorded with The Crusaders.", "* Martyn Ware – programming, electronic drums (6, 10), arrangements (6, 10), background vocals (6, 10)", "* Martyn Ware – producer (6, 10)"]}, {"page": "Vince Clarke", "response": ["Clarke worked with synthpop producer Martyn Ware (of Heaven 17 and The Human League) in 1999 as The Clarke & Ware Experiment  and released the album Pretentious. The duo collaborated again in 2001 for the album Spectrum Pursuit Vehicle, which was created with \"3D music technology\" specifically designed for listening in headphones. That same year also saw the release of the Clarke-produced album Erasure's Vince Clarke, which featured The Peter Pan Effect, an album that he and Eric Radcliffe produced for his long-time friend Robert Marlow.  Clarke wrote \"Let's Get Together\" for the pop girl group Girl Authority for their second album, Road Trip. The song was originally meant to be for Depeche Mode but was never recorded by them. Clarke also co-wrote \"What Do I Want From You?\" with Freeform Five, for their album Strangest Things (2005).", "Also in 2001, Clarke founded Illustrious Co. Ltd. with Martyn Ware, to create new forms of spatialised sound composition using their unique 3D AudioScape system, collaborating with fine artists, educational establishments, the performing arts, live events, corporate clients, and educational settings round the world.", ";In collaboration with Martyn Ware", "*Spectrum Pursuit Vehicle (2001, as Vincent Clarke & Martyn Ware)"]}, {"page": "Hot Gossip", "response": ["In 1978, during their initial impact period on The Kenny Everett Video Show, Hot Gossip recorded \"Making Love on a Phone\" and with Sarah Brightman on lead vocals recorded \"I Lost My Heart to a Starship Trooper\", a disco song written by Jeff Calvert and Geraint Hughes, the men behind the 1975 hit record, \"Barbados\". \"I Lost My Heart to a Starship Trooper\" reached number 6 on the UK Singles Chart. They went on to record an album in 1981 titled Geisha Boys and Temple Girls, produced by former Human League and then current Heaven 17/BEF member Martyn Ware. A stand-out track called \"I Burn for You\" was written by Sting."]}, {"page": "Marc Almond", "response": ["Almond's next album Fantastic Star saw him part with WEA and sign to Mercury Records. Much of Fantastic Star was originally recorded in New York with Mike Thorne, but later after signing to Mercury, was reworked in London. Almond also recorded a session for the album with John Cale, David Johanson, and Chris Spedding; some made the final cut. Other songs were produced by Mike Hedges and Martyn Ware. Adding to the disjointed recording process was the fact that during recording Almond also spent several weeks attending a treatment centre in Canterbury for addiction to prescription drugs.Almond, M., Tainted Life – the autobiography, Sidgwick and Jackson, 1999, p. 389 However, on its release Fantastic Star gave Almond a hit single with \"Adored and Explored\", and also minor hits and stage favourites such as \"The Idol\" and \"Child Star\". Fantastic Star was Almond's last album with a major record label, and the period also marked the ending of his managerial relationship with Stevo Pearce.Almond, M., Tainted Life – the autobiography, Sidgwick and Jackson, 1999, p. 409"]}, {"page": "Travelogue (The Human League album)", "response": ["Travelogue is the second full-length studio album released by British synthpop group The Human League, released in May 1980. It was the last album with founding members Ian Craig Marsh and Martyn Ware, as they would leave to form Heaven 17 later that year.", "\"Tracks like 'The Black Hit of Space' are way ahead of their time,\" observed Martyn Ware. \"Pumping the synths through massive distortion and overloading the desk. How prescient is that? The ethos of what we were doing was to kind of future-proof it all. We were envisaging people playing this music in ten or twenty years' time.\"", "In 2015 Travelogue was the subject of a BBC 6Music documentary as part of the \"Sounds of a City\" series. The programme examined the album's sound and how it grew out of the city, going on to influence a new generation of musicians. The documentary features interviews with Martyn Ware, Jarvis Cocker and Roisin Murphy, among others.http://www.bbc.co.uk/programmes/b05t2djc Sounds of a City: The Human League – Travelogue – BBC6 Music, 27 December 2015.", "*Martyn Ware – vocals, synthesizer"]}, {"page": "Propaganda (band)", "response": ["On 2 March 2011, Claudia Brücken performed at Scala in London and was joined by Ralf Dörper and Susanne Freytag for some of the tracks. Thomas Leer was also expected to perform but was unable to do so because of a throat operation. The gig was recorded for later DVD release and also featured Glenn Gregory and Martyn Ware of Heaven 17 and Andy Bell of Erasure. However, in an interview around the same time, Brücken said that Mertens was unwilling to work with her any longer."]}, {"page": "Claudia Brücken", "response": ["In March 2011, Brücken performed at the Scala, Kings Cross, London. She performed a selection of songs from her work with Propaganda, Act, Andrew Poppy, OneTwo and several numbers from her solo career. She was joined onstage by a variety of guests including Paul Humphreys, Glenn Gregory, Martyn Ware, Andrew Poppy, Susanne Freytag, Ralf Dorper and Andy Bell. The concert was called 'This Time: It's Claudia Brücken'. The concert was recorded and released on 23 July 2012 as a CD/DVD entitled This Happened: Live at the Scala, and was produced by Paul Humphreys and Martin Gooch who also directed."]}, {"page": "Do They Know It's Christmas?", "response": ["*Martyn Ware (Heaven 17)"]}, {"page": "Clock DVA", "response": ["Newton had previously worked with members of Cabaret Voltaire in a collective called The Studs and with Ian Craig Marsh and Martyn Ware in a band called The Future. He formed the first lineup of Clock DVA in 1978 with Judd Turner (bass), David J. Hammond (guitar), Roger Quail (drums) and Charlie Collins (saxophone, clarinet) (born 26 September 1952, Sheffield).", "In July 2015, another vinyl box set of early material was released on Vinyl on Demand. Horology 2 - Clockdva, The Future & Radiophonic Dvations features recordings made in late 1977/1978 period by Adi Newton prior to and during the formative period of development of Clock DVA, including the original The Future recordings made by the trio of Adi Newton, Martyn Ware, and Ian Craig Marsh before The Future developed into The Human League and Clock DVA."]}, {"page": "Let's Stay Together (Al Green song)", "response": ["*Martyn Ware – programming, electronic drums, arrangements, background vocals", "*Martyn Ware – producer"]}, {"page": "Ball of Confusion (That's What the World Is Today)", "response": ["Turner's synth-driven interpretation of \"Ball of Confusion\" opened the album, was also issued as a single, and became a Top 5 hit in Norway; this led to Capitol Records signing Turner and to Martyn Ware and Ian Craig Marsh recording another 1970s cover with her in late 1983. The track was Al Green's \"Let's Stay Together\", which became a surprise hit single on both sides of the Atlantic and the starting point of Turner's comeback, with the following 1984 album Private Dancer going multi-platinum in 1984."]}, {"page": "Philip Oakey", "response": ["In Sheffield in 1977, a school friend of Oakey's, Martyn Ware, along with Ian Craig Marsh and Adi NewtonAdi Newton later went on to form Clock DVA in 1978 had formed a band called The Future. They were part of an emerging genre of music that used analogue synthesisers instead of traditional instruments, which would later be called synth-pop. Although they had recorded a number of demo tapes, they remained unsigned. Newton left the band after they were turned down by record companies. Ware decided that The Future needed a dedicated lead singer to replace Newton. His first choice, Glenn Gregory, was unavailable. So Ware suggested his old school friend Philip Oakey to Marsh. Although Oakey had no musical experience, he was well known in the Sheffield social scene, principally for his eclectic dress sense and classic motorcycle. Ware went to visit Oakey to ask him to join The Future; finding him away from home, he left a note on Oakey's front door asking him to join. Oakey accepted and joined the band in mid-1977."]}, {"page": "Dare (album)", "response": ["Dare (released as Dare! in the US) is the third studio album by English synth-pop band the Human League, first released in the UK on 16 October 1981 then subsequently in the US in mid-1982. The album was recorded between March and September 1981 following the departure of founding members Martyn Ware and Ian Craig Marsh, and saw the band shift direction from their prior avant-garde electronic style toward a more pop-friendly, commercial sound led by frontman Philip Oakey.", "Dare was almost universally critically acclaimed in the UK. In Melody Maker Steve Sutherland celebrated the fact the album would irritate guitar-rock traditionalists, saying, \"All let's-pretend-pompous it's cornily consistent, cultured, crude, elegant, cheap ... anything you want it to be. Me? I think it's a masterpiece. Sure to upset some, sell to millions more and so it should the way it tramps all over rock traditions. A trite sound, a retarded glam image and a mock respect. All the appeal in the world ... Dare should show up the pathetic farce of pop mythology once and for all.\" Smash Hits critic David Hepworth called it \"chock-full of precise, memorable melodies delivered with style and humour\". Noted music critic Paul Morley wrote in the NME, \"Dare is the second intoxicating intervention to be produced out of the great split [referring to Ian Craig Marsh and Martyn Ware leaving the first incarnation of the Human League, and their album Penthouse and Pavement released with their new band Heaven 17], and already it's the first Human League greatest hits collection ... Much more than ABBA or whoever you like, the Human League signify that deliciously serious, sincerely disposable MOR music can possess style, quality and sophistication ... I think that Dare is one of the Great popular music LPs.\""]}, {"page": "Introducing the Hardline According to Terence Trent D'Arby", "response": ["*Produced by Terence Trent D'Arby and Martyn Ware, except \"If You Let Me Stay\" and \"Seven More Days\" (produced by Howard Grey)."]}, {"page": "Ikutaro Kakehashi", "response": ["Kakehashi died in April 2017, aged 87. Tributes came from musicians such as Tommy Snyder of Godiego, Chris Carter of Throbbing Gristle, Samantha Ronson, Matthew Herbert, Marc Almond of Soft Cell, Martyn Ware of the Human League, and producer Paul Epworth. Moog Music described him as a \"model of resilience and a genuine trailblazer\", and Dave Smith of Sequential wrote that he was \"just an amazing man, a good friend, a very good competitor of course, and just innovative continually all that time\"."]}, {"page": "Penthouse and Pavement", "response": ["*Martyn Ware – synthesisers; Linn LM-1; piano; percussion; backing vocals"]}, {"page": "I Say I Say I Say", "response": ["I Say I Say I Say is the sixth studio album from synthpop duo Erasure, released in 1994 by Mute Records in the UK and Elektra Records in the US. The album was produced by Martyn Ware, who was a founding member of veteran synthpop groups The Human League and Heaven 17.", "* Martyn Ware – Producer"]}, {"page": "List of people from Sheffield", "response": ["*Martyn Ware, musician with Heaven 17"]}, {"page": "Sliver (soundtrack)", "response": ["#* Written by Ian Craig Marsh, Martyn Ware, Glenn Gregory"]}, {"page": "Gary Crosby (bassist)", "response": ["In September 2017, Crosby was named by the British Academy of Songwriters, Composers and Authors (BASCA) as one of 12 recipients (including Michael Gibbs, Paulette Long, Emeli Sandé, Martyn Ware and others) of a Gold Badge Award , which celebrates the unique contribution of those who have supported or inspired the UK songwriting and composing community.\"BASCA Gold Badge Award Recipients for 2017 Announced\" , BASCA, 4 September 2017.\"Gold Badge Awards 2017 Celebrates British Jazz\", M Magazine, 5 September 2017."]}, {"page": "Brighton Palace Pier", "response": ["In 2015, Martyn Ware, founding member of pop group The Human League, made a series of field recordings on the pier as part of a project with the National Trust and British Library project to capture the sounds of Britain."]}, {"page": "Joanne Catherall", "response": ["The Human League had recently split acrimoniously over creative differences, leaving only two of the original four members, Oakey and Adrian Wright, to continue. Crucially, The Human League was contracted to a European tour starting within a week. Already in debt to Virgin Records, Oakey had to recruit new band members in a matter of days for the tour or be sued by the tour's promoters, face bankruptcy, and see the end of the band. Oakey went into Sheffield one evening to recruit a single female backing singer for the tour, needed to replace the original high backing vocals of the now departed Martyn Ware. He immediately noticed Catherall and Sulley dancing together in the Crazy Daisy and now states that they stood out from all the other girls in the club due to their unique dress sense, immaculate make-up, and idiosyncratic but sophisticated dance moves.  Without preamble, Oakey asked both girls to join the tour as dancers and incidental vocalists."]}, {"page": "Preston Heyman", "response": ["After studio sessions (again with Phil Spalding on bass) for the 1987 album Introducing the Hardline According to Terence Trent D'Arby produced by Heaven 17's Martyn Ware, he found himself drumming on the U.S.A. Billboard Hot 100 No. 1 hit \"Wishing Well\"Whitburn, Joel (2004). Top R&B/Hip-Hop Singles: 1942–2004. Record Research. p. 145. (1988) and features in the song's video. He joined Terence's band and spent the next 2 years touring the globe. In nearly every country they landed, both the album and single were No. 1 and at times they found themselves doing 5 T.V. appearances a day, once described as \"The world's wildest craziest party that never ever stopped.\" Eventually, on the verge of another U.S. tour, Heyman decided to leave saying he had to \"save my sanity before it was too late to do so.\" Worldwide, the album sold a million copies within the first three days of going on sale.Whaley, Christopher (September 2007). Sananda Maitreya Speaks! (interview). Sobo Magazine. Retrieved 18 January 2008."]}, {"page": "British Electric Foundation", "response": ["B.E.F. (British Electric Foundation) was a band/production company formed by former Human League members Martyn Ware and Ian Craig Marsh which became largely eclipsed by its best-known project, Heaven 17 (with lead singer Glenn Gregory).", "In March 2007 B.E.F. made their first live performance, as part of the line-up for the Tribute to Billy MacKenzie Concert held at Shepherds Bush Empire, London, in memory of their three-time guest vocalist, and in aid of Sound Seekers. The B.E.F. line-up consisted of Martyn Ware on keyboards, a guitarist/keyboardist and a bassist, with Glenn Gregory and Billie Godfrey, Heaven 17's female vocalist."]}, {"page": "Glenn Gregory", "response": ["Gregory knew the founding members of the Human League for many years. He had been singing and playing bass guitar in bands with Ian Craig Marsh since 1973. In early 1981, he was contacted by Martyn Ware after the original incarnation of the Human League broke up, and was asked to join Heaven 17, a new band resulting from the break-up.", "The band Heaven 17 included the trio of Martyn Ware, Ian Craig Marsh, and Gregory as lead singer. The band released eight studio albums, and had many hits in the UK. However, by the late 1980s their popularity had declined. The band broke up in 1988, but reunited in 1996, and played their first ever live concert in 1997. Marsh left the band in 2007, but Ware and Gregory continued to perform as Heaven 17."]}, {"page": "List of machinima festivals", "response": ["*Martyn Ware, Illustrious Company"]}, {"page": "Let Me Go (Heaven 17 song)", "response": ["Category:Songs written by Martyn Ware"]}, {"page": "Always (Erasure song)", "response": ["\"Always\" is a song by British synth-pop duo Erasure. The ballad was released on 11 April 1994 as the first single from their sixth studio album, I Say I Say I Say (1994). Written by Erasure members Vince Clarke and Andy Bell, it was produced by Martyn Ware. Mute Records issued the single in the United Kingdom, and Elektra Records released it in the United States.", "AllMusic editor Ned Raggett described it as a \"wonderful ballad\" with a \"slightly quirky opening, strong verses both musically and lyrically, and a flat-out brilliant chorus, Bell's impassioned delivery one of his finest moments.\" Larry Flick from Billboard wrote that the song \"glides along at a slick, compu-hip pace. Andy Bell has rarely sounded as good as he does here, contrasting the icy-smooth synth nature of Martyn Ware's production with a warm, well-shaded vocal. The tune is embellished with faster trance beats that fit current trends extremely well, without sacrificing the catchy hook.\" Troy J. Augusto from Cashbox commented that \"flamboyant frontman Bell’s voice is as smooth and bittersweet as ever, a nifty companion to Clarke's upbeat programming and producer Martyn Ware’s almost industrial style.\" David Browne from Entertainment Weekly called it a \"lament\" and a \"moving declaration of undying love.\" He noted Bell's \"pained, naked wisp of a voice dips upward in the chorus (\"I want to be with you\").\" Dave Sholin from the Gavin Report said the song is \"execeptional, mid-tempo Euro-pop\". John Hamilton from Idolator described it as a \"bleep-bloopy disco ballad featuring some of Andy Bell’s most delicate vocals to-date.\" Music writer James Masterton wrote in his weekly UK chart commentary, \"One of the best singles they have released for years, the anthemic pop song is sure to hang around the upper reaches for a few weeks yet.\" "]}, {"page": "I Love Saturday", "response": ["\"I Love Saturday\" is a song by British synthpop duo Erasure, released as the third single from their sixth studio album, I Say I Say I Say (1994), on 21 November 1994. It was written by Vince Clarke and Andy Bell, and produced by Martyn Ware. In addition to the normal vinyl, cassette and CD singles, Mute released the \"I Love Saturday EP\" in the UK shortly afterwards, which contains several new tracks."]}]}}