{"wiki_id": "http://www.wikidata.org/entity/Q7149499", "itemLabel": "Paul Brannigan", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Brannigan", "wikipedia_page": {"main": "Paul Brannigan (born 14 September 1986) is a Scottish actor best known for his roles as Gareth O'Connor in Scottish soap opera River City and as Robbie in the film The Angels' Share (2012). Brannigan also appeared in the 2013 movie Under the Skin.\n\n", "link_mentions": [{"page": "Barrowfield", "response": ["Footballer James McArthurProgramme exclusive: McArthur on gritty Glasgow upbringing, Crystal Palace FC match programme, 1 September 2019 and actor Paul BranniganKevin Brannigan: East End drag artist on his battle to make his mark, Evening Times, 7 January 2019 grew up in Barrowfield in the 1990s."]}, {"page": "Screen International", "response": ["* Paul Brannigan"]}, {"page": "List of River City characters", "response": ["|Gareth O'Connor || Paul Brannigan"]}, {"page": "List of Scottish actors", "response": ["*Paul Brannigan (born 1986)"]}, {"page": "List of British films of 2012", "response": ["|| Director: Ken Loach   Cast: Paul Brannigan, John Henshaw, William Ruane, Gary Maitland"]}, {"page": "List of comedy films of the 2010s", "response": ["|The Angels' Share||Ken Loach||Paul Brannigan, John Henshaw, Gary Maitland||BelgiumFranceItaly||Comedy-drama"]}, {"page": "The Angels' Share", "response": ["The Angels' Share is a 2012 comedy-drama film directed by Ken Loach and starring Paul Brannigan, John Henshaw, and William Ruane. Set in Glasgow, Scotland, it tells the story of a young father who narrowly avoids a prison sentence. He is determined to turn over a new leaf and when he and his friends from the same community payback group visit a whisky distillery, a route to a new life becomes apparent. The title is from \"the angels' share\", a term for the portion (share) of a whisky's volume that is lost to evaporation during aging in oak barrels.", "In the opening scenes, the protagonists are sentenced to hours of community payback. During his first community payback session, Robbie (Paul Brannigan), under the guidance of Harry (John Henshaw), is interrupted and taken to the hospital by Harry as his girlfriend, Leonie (Siobhan Reilly), has gone into labour. At the hospital, Robbie is assaulted by two of his girlfriend's uncles and her dad (Gilbert Martin) before he can see her. Harry takes Robbie back to his house to clean him up, at which point Leonie calls to announce Robbie's son, Luke, has been born. Harry insists that he and Robbie celebrate, and brings out a vintage whisky. With Leonie's encouragement, Robbie agrees to meet with a victim of his former violent crimes, Anthony (Roderick Cowie), who recollects the attack in front of both his family and Leonie. Afterwards, Leonie makes clear that she does not want her son to grow up around violence and long-term feuds. ", "* Paul Brannigan as Robbie"]}, {"page": "2012 British Academy Scotland Awards", "response": ["*Paul Brannigan – The Angels' Share as Robbie"]}, {"page": "British Independent Film Awards 2012", "response": ["*Paul Brannigan - The Angels' Share"]}, {"page": "Sunshine on Leith (film)", "response": ["* Paul Brannigan as Ronnie"]}, {"page": "Paul Brannigan (actor)", "response": ["#REDIRECT Paul Brannigan"]}, {"page": "Ken Loach", "response": ["The Angels' Share (2012) is centered on a young Scottish troublemaker who is given a final opportunity to stay out of jail. Newcomer Paul Brannigan, then 24, from Glasgow, played the lead role. The film competed for the Palme d'Or at the 2012 Cannes Film Festival where Loach won the Jury Prize. Jimmy's Hall (2014) was selected to compete for the Palme d'Or in the main competition section at the 2014 Cannes Film Festival. Loach announced his retirement from film-making in 2014 but soon after restarted his career following the election of a Conservative government in the UK general election of 2015.Interview with Loach in Versus: The Life and Films of Ken Loach, BBC Films/BFI, broadcast 30 July 2016."]}, {"page": "William Ruane", "response": ["In 2012 Ruane's career came full circle when he was cast as Rhino in The Angels' Share, another production directed by Ken Loach, written by Paul Laverty, produced by Rebecca O'Brien and set in the west of Scotland, in which he starred alongside a 'raw talent'—in this case Paul Brannigan—and which had positive feedback at Cannes (the 2012 festival). Another of the main cast members, Gary Maitland (also from Castlemilk), had featured in Sweet Sixteen and Tickets as well."]}, {"page": "Young Scot Awards", "response": ["Notable winners and finalists of past Young Scot Awards include Amy Macdonald, Karen Gillan, Andy Murray, Paolo Nutini, Martin Compston, Nina Nesbitt, Lewis MacDougall, Paul Brannigan, Laura Muir, and Jordan Daly."]}, {"page": "List of British films of 2017", "response": ["|| Director: Simon Hunter  Cast: Sheila Hancock, Kevin Guthrie, Paul Brannigan, Amy Manson, Wendy Morgan"]}, {"page": "Edie (film)", "response": ["Edie is a 2017 British drama film directed by Simon Hunter and written by Elizabeth O'Halloran. The film stars Sheila Hancock, Kevin Guthrie and Paul Brannigan. The soundtrack was written by Debbie Wiseman. Principal photography began in the Scottish Highlands in 2016.", "* Paul Brannigan as McLaughlin"]}, {"page": "Roads (film)", "response": ["* Paul Brannigan as Alan"]}, {"page": "Scottish Mussel", "response": ["*Paul Brannigan as Fraser"]}, {"page": "Brannigan, Paul", "response": ["#redirectPaul Brannigan"]}, {"page": "British Independent Film Award for Breakthrough Performance", "response": ["| Paul Brannigan"]}]}}