{"wiki_id": "http://www.wikidata.org/entity/Q7149341", "itemLabel": "Paul Berliner", "itemDescription": "American ethnomusicologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Berliner_(ethnomusicologist)", "wikipedia_page": {"main": "Paul Franklin Berliner (born 1946) is an American ethnomusicologist, best known for specializing in African music as well as jazz and other improvisational systems. He is best known for his popular ethnomusicology book on the Zimbabwean mbira, The Soul of Mbira: Music and Traditions of the Shona People of Zimbabwe, for which he received the ASCAP Deems Taylor Award.  He also published Thinking in Jazz: The Infinite Art of Improvisation for which he received The Society of Ethnomusicology's Alan Merriam Prize for Outstanding Book in Musicology. Berliner received his Ph.D. from Wesleyan University.\nPaul is the oldest of three and was born in Cambridge, MA to Joe and Ann Berliner.\nBerliner is Professor of Ethnomusicology at the John Hope Franklin Center for International and Interdisciplinary Studies at Duke University. He formerly taught at the School of Music of Northwestern University. He has recorded and produced albums of Shona mbira music, and has been recorded as a performer with the Paul Winter Consort. In 1979 he released an album of jazz played on the kudu horn, \"The Sun Rises Late Here\" (Flying Fish FF092). He was elected a Fellow of the American Academy of Arts and Sciences in 2004.", "link_mentions": [{"page": "Mbira", "response": ["Their arrangements included numerous songs directly drawn from traditional mbira repertoire. Other notable influencers bringing mbira music out of Africa are: Dumisani Maraire, who brought marimba and karimba music to the American Pacific Northwest; Ephat Mujuru, who was one of the pioneer teachers of mbira dzavadzimu in the United States; and the writings and recordings of Zimbabwean musicians made by Paul Berliner. Claire Jones, a student of Dumisani Maraire in the 1970s, has been playing and teaching mbira for more than 40 years. She is also a Festival Coordinator for Zimfest, a Zimbabwean Music Festival held annually in North America that offers many opportunities to learn and listen to mbira."]}, {"page": "Music of Africa", "response": ["* Paul Berliner"]}, {"page": "Music of Zimbabwe", "response": ["* Paul Berliner"]}, {"page": "Suspended chord", "response": ["Red Garland's piano introduction to \"Bye Bye Blackbird\" on the Miles Davis album 'Round About Midnight features suspended 9th chords.Sher, Chuck. (1991, p. 35). The New Real Book, Volume 2. Petaluma, Sher Music. In his book Thinking in Jazz, Paul Berliner writes at length and in detail about how the improvisation unfolds from this opening.Berliner, P. (1994, pp. 678–688), Thinking in Jazz. University of Chicago Press."]}, {"page": "Shona music", "response": ["*Nonesuch Explorer Series 79704 Zimbabwe: The Soul of Mbira: Traditions of the Shona People (1973). Produced by Paul Berliner"]}, {"page": "Cosmas Magaya", "response": ["Raised in the rural areas of Mhondoro-Ngezi, Magaya played a role in the research of musicologist Paul Berliner's books The Soul of Mbira (1978), The Art of Mbira (2019), coauthored with Berliner Mbira's Restless Dance (2020) and also performed mbira on the accompanying Soul of Mbira audio recordings released by Nonesuch Records. Magaya performed internationally in Europe and the United States with Mhuri Yekwa Rwizi, and the Zimbabwe Group Leaders Mbira Ensemble, including members Hakurotwi Mude, Beauler Dyoko, Chaka Chawasarira, Simon Magaya and Paul Berliner."]}, {"page": "List of Wesleyan University people", "response": ["* Paul Berliner (PhD) – professor of music, Duke University"]}, {"page": "Paul Berliner", "response": ["Paul Berliner may refer to:", "* Paul Berliner (ethnomusicologist) (born 1946), professor at Duke University", "* Paul Berliner (trader), trader who settled charges of market manipulation with the Securities and Exchange Commission"]}, {"page": "Paul Berliner (ethnomusicoligist)", "response": ["#REDIRECT Paul Berliner (ethnomusicologist)"]}, {"page": "Earth: Voices of a Planet", "response": ["* Paul Berliner – percussion"]}, {"page": "Paul F. Berliner", "response": ["#REDIRECTPaul Berliner (ethnomusicologist)"]}, {"page": "Berliner (surname)", "response": ["*Paul Berliner (ethnomusicologist), professor at Duke University", "*Paul Berliner (trader), trader who settled charges of market manipulation with the Securities and Exchange Commission"]}, {"page": "List of scholars of African music", "response": ["*Paul Berliner (born 1946), won ASCAP Deems Taylor Award for his ethnomusicology book on the Zimbabwean mbira"]}, {"page": "Paul Franklin Berliner", "response": ["#REDIRECTPaul Berliner (ethnomusicologist)"]}]}}