{"wiki_id": "http://www.wikidata.org/entity/Q7145360", "itemLabel": "Patric Doonan", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Patric_Doonan", "wikipedia_page": {"main": "Patric Doonan (George William Doonan) (18 April 1926 in Derby, Derbyshire – 10 March 1958 in London) was a British stage and screen actor. He was the son of comedian George Vincent Doonan and Doris Mary (Nee Endsor) he was the  brother of fellow actor Tony Doonan.\nHe featured in films of the time such as The Blue Lamp, Train of Events and The Cockleshell Heroes but rarely played the leads. An exception was Wheel of Fate (1953), in which he did have the leading role and top billing. 1953 was probably Doonan's peak year in films, as in that same year he also had good supporting roles in The Net (1953) and The Red Beret (1953).\nHe played Detective Sergeant Trotter in the The Mousetrap at the Ambassadors Theatre in London for three and a half years.\nHe committed suicide by gas in 1958 at his home in Margaretta Terrace, Chelsea. At the time he was engaged to marry actress Ann Firbank, despite the fact that he was already married to actress Aud Johansen.\nIn 1994 the singer Morrissey referenced Doonan in the song 'Now My Heart Is Full'.", "link_mentions": [{"page": "The Blue Lamp", "response": ["* Patric Doonan as Spud"]}, {"page": "The Man in the White Suit", "response": ["*Patric Doonan as Frank"]}, {"page": "The Cockleshell Heroes", "response": ["* Patric Doonan as Sailor Claridge"]}, {"page": "High Treason (1951 film)", "response": ["*Patric Doonan as George Ellis"]}, {"page": "Appointment with Venus (film)", "response": ["*Patric Doonan as Sergeant Forbes"]}, {"page": "List of British films of 1953", "response": ["|Wheel of Fate||Francis Searle||Patric Doonan, Sandra Dorne||Drama||"]}, {"page": "Gift Horse (film)", "response": ["* Patric Doonan as Petty Officer Martin "]}, {"page": "The Red Beret", "response": ["* Patric Doonan as Flash Gordon"]}, {"page": "John and Julie", "response": ["* Patric Doonan as Jim Webber, a bicycle shop owner"]}, {"page": "Seagulls Over Sorrento", "response": ["* Patric Doonan as Petty Officer Herbert"]}, {"page": "Train of Events", "response": ["* Patric Doonan as Ron Stacey"]}, {"page": "Once a Jolly Swagman", "response": ["*Dick Fox - \tPatric Doonan"]}, {"page": "Calling Bulldog Drummond", "response": ["* Patric Doonan as Alec  "]}, {"page": "The Net (1953 film)", "response": ["* Patric Doonan as Brian Jackson"]}, {"page": "I'm a Stranger", "response": ["* Patric Doonan ...  George Westcott"]}, {"page": "What Every Woman Wants (1954 film)", "response": ["What Every Woman Wants is a 1954 British comedy film directed by Maurice Elvey and starring William Sylvester, Elsie Albiin, Brenda De Banzie and Patric Doonan. It also features Brian Rix and Prunella Scales. It was based on a play Relations Are Best Apart by Edwin Lewis.", "* Patric Doonan - Mark"]}, {"page": "Wheel of Fate (film)", "response": ["Wheel of Fate is a 1953 British drama film directed by Francis Searle and starring Patric Doonan, Sandra Dorne and Bryan Forbes.BFI.org The screenplay concerns a man who turns to crime to raise the money he needs to spend time with a woman with whom he falls in love.", "Two brothers working in their father's repair garage: quiet sensible Johnny (Patric Doonan) and the younger and wilder Ted (Bryan Forbes) fall out when Ted brings home Lucky (Sandra Dorne), a beautiful dance hall singer. The brothers feud when she unexpectedly falls for Johnny, and crime and mayhem ensue.", "* Patric Doonan as Johnny Burrows "]}, {"page": "Blackout (1950 film)", "response": ["Blackout is a 1950 British crime drama film directed by Robert S. Baker. The film featured Maxwell Reed, Dinah Sheridan, Patric Doonan, Kynaston Reeves, Annette D. Simmonds, Eric Pohlmann, Michael Evans and Michael Brennan in the lead roles.", "* Patric Doonan as Chalky"]}, {"page": "Ann Firbank", "response": ["She had been engaged to the actor Patric Doonan, when he was married to actress Aud Johansen; he committed suicide in 1958. "]}]}}