{"wiki_id": "http://www.wikidata.org/entity/Q7150660", "itemLabel": "Paul Flather", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Flather", "wikipedia_page": {"main": "Paul Charles Ram Flather (born 28 December 1954) is a British academic. Until 2018 he served as the Secretary-General of the Europaeum, an association of leading European universities, and is Fellow of Mansfield College, Oxford. He is the son of Shreela Flather, Baroness Flather. He was formerly a journalist working for the BBC, Times newspapers and the New Statesman where he was deputy editor. He has written for many publications on education and politics.", "link_mentions": [{"page": "Europaeum", "response": ["A regular newsletter was set up from Oxford, alongside its own website, and a database to try to link academics working in European Law, Politics and Economics. In 2003, a part-time Secretary-General (Dr Paul Flather) was appointed to oversee the overall growth and development of the Europaeum. The Europaeum Office moved from the Central University Offices to rented offices on the Banbury Road, leased from the Oxford Voltaire Foundation, and the organisation became a Charity (Registration Number 1105477) in 2004. Academic mobility was boosted under the Europaeum Visiting Academics scheme enabling leading academics to teach and research at partner institutions within the association, helping nourish future academic and teaching links. Two innovative programmes, an MA in European Politics, Culture, History and Institutions, linking Bologna, Leiden and Oxford, and a plan for modular programmes in European Business, Culture, and Institutions, initially to link Leiden and Oxford, were run as pilot projects."]}, {"page": "Shreela Flather", "response": ["Daughter of Rai Bahadur Aftab Rai, of New Delhi, India, a barrister and diplomat, and Krishna Rai,Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 1, ed. Charles Mosley, Burke's Peerage Ltd, 2003, p. 1444 Flather is the great-granddaughter of Sir Ganga Ram,Bedi, Baba Pyare Lal, Harvest from the desert. The life and work of Sir Ganga Ram, NCA, Lahore 2003 ISBD 969-8623-07-8 (reprint version) pg xvii a noted engineer, philanthropist and agriculturist  during the late 19th century and early 20th century in Punjab, British India (now Pakistan). She was married to Gary Denis Flather until his death in 2017. Their son is Paul Flather. The Baroness' niece is Kesha Ram, a member of the Vermont State Senate."]}, {"page": "Forum for European Philosophy", "response": ["|Paul Flather"]}, {"page": "Jan Hus Educational Foundation", "response": ["* Paul Flather", "Paulflather01.jpg|Paul Flather"]}, {"page": "Gary Flather", "response": ["Flather married Shreela Rai, a politician, daughter of Rai Bahadur Aftab Rai, of New Delhi, India, a barrister and diplomat; their son Paul Flather is an academic and former journalist. Flather fought multiple sclerosis for forty years, necessitating the use of a wheelchair.Burke's Peerage, Baronetage and Knightage, 107th edition, vol. 1, ed. Charles Mosley, Burke's Peerage Ltd, 2003, p. 1444"]}, {"page": "Flather", "response": ["* Paul Flather (born 1954), a British academic."]}, {"page": "Flather, Paul", "response": ["#redirectPaul Flather"]}]}}