{"wiki_id": "http://www.wikidata.org/entity/Q7150064", "itemLabel": "Paul Curran", "itemDescription": "English racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Curran_(cyclist)", "wikipedia_page": {"main": "Paul Curran (born 15 January 1961) is a former professional English racing cyclist from Thornaby, North Yorkshire.Curran rode for Great Britain in the Olympic Games, won the national road championship and won several medals at the Commonwealth Games. With wins in top amateur races in France, he could probably have secured a professional contract with a continental cycling team but preferred to remain in Britain.", "link_mentions": [{"page": "Thornaby-on-Tees", "response": ["* Paul Curran – the championship cyclist was born in Thornaby."]}, {"page": "1986 Commonwealth Games", "response": ["|Team Time Trial|| Alan GornallDeno DavieKeith ReynoldsPaul Curran ||02:13:16|| Blair CoxGraeme MillerGregory FrainePaul Leitch ||02:14:50|| Alastair IrvineCormac McCannJoseph BarrMartin Quinn ||02:16:13"]}, {"page": "Great Britain at the 1984 Summer Olympics", "response": ["* Paul Curran", "* Paul Curran"]}, {"page": "Great Britain at the 1988 Summer Olympics", "response": ["* Paul Curran"]}, {"page": "List of British cyclists", "response": ["* Paul Curran"]}, {"page": "Manchester Wheelers' Club", "response": ["*Paul Curran"]}, {"page": "Archer Grand Prix", "response": ["*1994 Paul Curran "]}, {"page": "Cycling at the 1984 Summer Olympics – Men's points race", "response": ["|align=left| Paul Curran ||align=left| ", "|align=left| Paul Curran ||align=left| ", "|align=left| Paul Curran ||align=left| "]}, {"page": "Cycling at the 1988 Summer Olympics – Men's individual road race", "response": ["|align=left| Paul Curran ||align=left| "]}, {"page": "Dave Lloyd (cyclist)", "response": ["Lloyd began racing in 1969. In 1972 he came seventh in the Milk Race before going on to win the William Tell GP, beating Francesco Moser and Freddy Maertens, and riding in the Munich Olympics. In 1973 he turned professional with Raleigh, and over the next three years he won the national 5000m pursuit championship twice and set a national 50-mile road record. In 1976 a heart condition forced a three-year break from cycling. On recovery he restarted as an amateur and over six years won 125 of 133 races. In 1982 he won the Points, King of the Mountains and Overall in the Girvan 3-Day beating a strong field of riders that included Paul Curran, Joey McLoughlin and Jeff Williams. In 1984 he returned to the professional sport, and finally retired from cycling two years later."]}, {"page": "British National Road Race Championships", "response": ["| 1985 || Paul Watson || Jeff Williams || Paul Curran", "| 1987 || Paul Curran || Gary Baker || Terry Sweeney", "| 1992 || Simon Bray || Steve Farrell || Paul Curran", "| 1995 || Simon Bray || Jeremy Hunt || Paul Curran"]}, {"page": "British National Circuit Race Championships", "response": ["| 1989 || Paul Curran || Mark Walsham || Chris Lillywhite"]}, {"page": "Mark Jamieson", "response": ["Jamieson received a two-year suspension from cycling as a result of the sentence. The suspension expired on 27 January 2011, and Jamieson returned to competitive cycling at the Melbourne Madison in March of that year. He joined the Jayco 2XU cycling team, and in October competed as part of the team in the Tour of Tasmania, where he posted a strong performance, winning the first day of the six-day event. Later that month he competed in the Grafton to Inverell Cycle Classic, which he won by breaking the previous record time set by Paul Curran."]}, {"page": "Hugh Cameron (cyclist)", "response": ["Hugh Cameron is a champion racing cyclist, having won the madison at the British National Track Championships in three consecutive years with Paul Curran. He first became interested in cycling as a schoolboy, it was at Grangefield Grammar School, Stockton-on-Tees in 1968 that he set up a cycling club along with Brian Cossavella.Hugh Cameron on cyclingmasters.com", ":1st  British National Track Championships Madison (with Paul Curran", ":1st  British National Track Championships Madison (with Paul Curran", ":1st  British National Track Championships Madison (with Paul Curran", ":3rd British National Track Championships Madison (with Paul Curran)"]}, {"page": "John Tanner (cyclist)", "response": [":2nd British National 100km Team Time Trial Championships (with Wayne Randle, Paul Curran, Julian Ramsbottom)"]}]}}