{"wiki_id": "http://www.wikidata.org/entity/Q7151548", "itemLabel": "Paul James Rooney", "itemDescription": "English choreographer and dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_James_Rooney", "wikipedia_page": {"main": "Paul James Rooney is an English dancer, choreographer & music artist.\nHe has danced with various companies and choreographers around the world, including names such as; Matthew Bourne, Tim Rushton, Will Tuckett, Danish Dance Theatre & has choreographed many productions for Tivoli (Copenhagen)\nPaul James Rooney is also known for competing on the first series of Den Vildeste Danser - the Danish version of Syco Entertainment's  The Greatest Dancer.\nIn October 2020 Paul James Rooney released his debut single \"Shine\"", "link_mentions": [{"page": "Tivoli (Copenhagen)", "response": ["The Pantomime Theatre is an open-air theatre designed by Vilhelm Dahlerup, also known for the design of the Royal Danish Theatre. It is a toy-like historicist built in Chinese style and noted for its mechanical front curtain that takes five men to operate and unfolds like a peacock's tail. As indicated by the name, it is primarily a scene for pantomime theatre in the classical Italian commedia dell'arte tradition, which is performed daily with a live pit orchestra. Besides this original function, the theatre leads a second life as a venue for ballet and modern dance, performing works by choreographers such as August Bournonville, Dinna Bjørn, Louise Midjord and Paul James Rooney."]}, {"page": "Elmhurst Ballet School", "response": ["*Paul James Rooney"]}, {"page": "Butterfly Lovers", "response": ["In 2017 English Choreographer Paul James Rooney created and choreographed a ballet version of Butterfly Lovers for Tivoli Ballet Theater, Copenhagen, using the music of the Butterfly Lovers' Violin Concerto."]}, {"page": "Billy Elliot the Musical", "response": ["Billy Elliot premiered in Malmö, Sweden on 13 February 2016 at Malmö opera. Billy will be alternately played by Grim Lohman, Oliver Lohk and Jacob Hermansson and Michael by David Fridholm, Carl Sjögren and Uno Elger. Among the cast are Åsa Fång as Mrs. Wilkinson, Lars Väringer as dad, Rasmus Mononen as Tony, Paul James Rooney and Robert Thomsen playing the role of Older Billy. The production will move to Stockholm in 2017 and opens there on 1 March."]}, {"page": "Pantomimeteatret", "response": ["The programme also include ballet performances, including examples of the distinctive Danish Bournonville style and modern dance. HM Queen Margrethe created costumes and scenography several times, including for ballets based on Hans Christian Andersen's The Little Match Girl and The Swineherd in 2007 and 2009. Choreographers who have created works for the Pantomimeteatret include Dinna Bjørn, Louise Midjord, Paul James Rooney and Tim Rushton"]}, {"page": "Matti Silfer", "response": ["Matti Mikael Silfer is a Finnish digital artist. He is known for the performance 'Moving Art', which he created early 2011 in collaboration with choreographer Paul James Rooney, celebrating great Nordic art and artists; including Grieg, H C Lumbye, Roslin and many more. Integrating dance film, a dance photography exhibition and live dancing all in one performance."]}, {"page": "Paul Rooney", "response": ["*Paul James Rooney (born 1984), British dancer and choreographer"]}]}}