{"wiki_id": "http://www.wikidata.org/entity/Q7152715", "itemLabel": "Paul Newsome", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Newsome", "wikipedia_page": {"main": "Paul Newsome is a gold selling musician originally from Royton, Oldham, England and living in Los Angeles. He is the guitarist/songwriter for UK rock group Proud Mary.  He has written several films scores including the movie \"Hide Away\". \"Blackbird\" and  \"Mind Games\" starring Robert Evans Paul has recorded and toured extensively with artists including Neil Young, The Who, The Buzzcocks, David Bowie, Stereophonics, The Black Crowes, Ryan Adams, Paul Weller, Ocean Colour Scene, The Happy Mondays and Oasis to name a few (Proud Mary were the first signings to Noel Gallagher's Sour Mash label and Gallagher produced their first album.)Paul started his career with Manchester band The Ya Ya's who were touring buddies with a then unknown Oasis. They played their first London gigs together and continue their friendship until today. Noel Gallagher described Paul's songs as \"a cross between the Stones, Neil Young and the Band. It's a lesson in songwriting.\"\nPaul can be seen playing piano in the videos for Noel Gallagher's High Flying Birds single  \"In the heat of the moment\" and \"The Ballad of the Mighty I\"\nPaul recently opened up for Noel around Europe and his concert at Dusseldorf Mitsubishi Arena was broadcast in Germany on legendary TV show Rockpalast", "link_mentions": [{"page": "Uncle Dysfunktional", "response": ["* Paul Newsome"]}, {"page": "Proud Mary (band)", "response": ["Proud Mary are an English blues/rock band formed in 1998 in Manchester, England. The current line up consists of Greg Griffin (Lead Vocals), Paul Newsome (guitars, vocals), Tony Auton (lead guitar), Nathan Birkett (bass, guitars), Hani Abassi (drums). Proud Mary released their fifth studio album Songs from Catalina on 26 June 2020.", "Centred around Paul Newsome (Formerly of Manchester Indie band The YA YA'S), and Greg Griffin, Proud Mary were the first signing to Sour Mash Records by label founder Noel Gallagher (Oasis, Noel Gallagher's High Flying Birds) in 2000. Releasing debut album The Same Old Blues to wide critical acclaim in 2001.", "The Same Old Blues was recorded at Wheeler End Studios, featuring singles \"All Good Things\" and \"Very Best Friend\", and was predominantly written by Paul Newsome. A gruelling touring schedule followed the release, alongside tour support for among others Oasis, Paul Weller, Stereophonics, The Black Crowes, and Neil Young. The touring line up included Gary Whelan (Happy Mondays) on drums.", "Love and Light their second studio album was released in 2004 on Redemption Records, again predominantly written by Paul Newsome, and recorded at Wheeler End with other songs being written by Greg Griffin. Two tours followed the release, alongside supporting Ryan Adams, and a MainStage appearance at The Isle of Wight Festival. The album includes fan favourites \"Hats Off\", \"The Blues\" and \"Mexico\". The album featured Andy Rourke (The Smiths) on bass. Mainly due to the heavy touring schedule and Newsome's relocation to Los Angeles, a hiatus followed. During this period, amid inaccurate rumours the band had broken up, both Greg Griffin and Paul Newsome wrote and released solo albums, Glass Bottom Boat (Griffin) and Electric and Palms (Newsome), with Newsome also writing several film scores and commercials.", "In 2015 Paul Newsome was announced as the main headline support in Europe for Noel Gallagher's High Flying Birds, following the release of their album Chasing Yesterday. Newsome can be seen playing keyboards in live band performances on the videos for the singles \"In The Heat of the Moment\" and \"Ballad of the Mighty I\".", "*Paul Newsome – Guitar, Vocals"]}, {"page": "The Same Old Blues", "response": ["*Paul Newsome – guitars, vocals, harmonica"]}, {"page": "Electric and Palms", "response": ["#REDIRECT Paul Newsome "]}, {"page": "Newsome, Paul", "response": ["#redirectPaul Newsome"]}]}}