{"wiki_id": "http://www.wikidata.org/entity/Q7153960", "itemLabel": "Paul Terry", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Terry_(actor)", "wikipedia_page": {"main": "Paul Christopher James Terry (born 7 November 1985) is an English former child actor. He is best known internationally for starring as James in the  1996 film adaptation of Roald Dahl's James and the Giant Peach. He also starred in the four seasons of the children's sitcom Microsoap (1998–2000).", "link_mentions": [{"page": "1996 in film", "response": ["| James and the Giant Peach || Walt Disney Pictures / Allied Filmmakers || Henry Selick (director); Steven Bloom, Karey Kirkpatrick, Jonathan Roberts (screenplay); Paul Terry, Simon Callow, Richard Dreyfuss, Susan Sarandon, Jane Leeves, Miriam Margolyes, David Thewlis, Joanna Lumley, Pete Postlethwaite, Steven Culp, Susan Turner-Cray, Mike Starr, Jeff Bennett || Fantasy, Musical, Family || Live action/ Animation", "* James and the Giant Peach, directed by Henry Selick, starring Miriam Margolyes, Joanna Lumley, Pete Postlethwaite and introducing Paul Terry – (UK/US)"]}, {"page": "James and the Giant Peach (film)", "response": ["James and the Giant Peach is a 1996 musical fantasy film directed by Henry Selick, based on the 1961 novel of the same name by Roald Dahl. It was produced by Tim Burton and Denise Di Novi, and starred Paul Terry as James. The film is a combination of live action and stop-motion animation. Co-stars Joanna Lumley and Miriam Margolyes played James's aunts in the live-action segments, and Simon Callow, Richard Dreyfuss, Susan Sarandon, Jane Leeves, David Thewlis, and Margolyes voiced his insect friends in the animation sequences.", "* Paul Terry as James Henry Trotter", "| Best Performance in a Voiceover – Young Artist ||Paul Terry || "]}, {"page": "Paul Terry", "response": ["Paul Terry may refer to:", "*Paul Terry (cartoonist) (1887–1971), American, founder of Terrytoons", "*Paul Terry (footballer) (born 1979), English ", "*Paul Terry (cricketer) (born 1959), English  ", "*Paul Terry (actor) (born 1985), English"]}, {"page": "Rebecca Hunter", "response": ["Her first TV role was on the Disney-produced, BAFTA award-winning CBBC sitcom Microsoap, alongside Paul Terry, Jeff Rawle and Ryan Cartwright, between 1998 and 2000. She has also appeared in My Dad's the Prime Minister and UGetMe. In addition, while a member of allSTARS*, she made an appearance as a guest on Never Mind the Buzzcocks in 2001."]}, {"page": "1985 in the United Kingdom", "response": ["* 7 November – Paul Terry, actor"]}, {"page": "List of American films of 1996", "response": ["|James and the Giant Peach||Henry Selick || Paul Terry, Miriam Margolyes, Joanna Lumley, Pete Postlethwaite; voices of Richard Dreyfuss, Susan Sarandon, Simon Callow, Jane Leeves, David Thewlis ||Animated ||based on Roald Dahl story"]}, {"page": "Microsoap", "response": ["Microsoap is a children's sitcom, co-written by Mark Haddon and co-produced by the BBC and the Disney Channel. A total of 26 episodes were made, lasting over four series, and airing from 1998 to 2001. It starred Suzanne Burden, Ivan Kaye, Paul Terry, Jeff Rawle and Rebecca Hunter. The program aired in the UK, the US, and internationally.", "Played by Paul Terry, Joe is Emily's cheeky twelve-year-old brother, keen on history and science. He has a colourful imagination, keeps a pet boa constrictor in his room, and is often to be found working on pet projects involving science, occasionally with his best friend Toby. He and his sister mostly get on well, and largely consider themselves to be the only sane people in the house."]}, {"page": "List of people from Watford", "response": ["* Paul Terry, former child actor, star of James and the Giant Peach"]}]}}