{"wiki_id": "http://www.wikidata.org/entity/Q7153641", "itemLabel": "Paul Slack", "itemDescription": "British historian and lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Slack", "wikipedia_page": {"main": "Paul Alexander Slack FBA (born 23 January 1943) is a British historian. He is a former Principal of Linacre College, Oxford, Pro-Vice-Chancellor of the University of Oxford, and Professor of Early Modern Social History in the University of Oxford.", "link_mentions": [{"page": "Linacre College, Oxford", "response": ["* 1996–2010: Paul Slack"]}, {"page": "List of historians by area of study", "response": ["* Paul Slack (born 1943) – Early Modern British Social history"]}, {"page": "Very Short Introductions", "response": ["| 307 || Plague || Paul Slack ||    (2nd ed.) || || medicine"]}, {"page": "Act for the Relief of the Poor 1601", "response": ["*Paul Slack, From Reformation to Improvement: Public Welfare in Early Modern England (1998)", "*Paul Slack, Poverty and Policy in Tudor England (1988)"]}, {"page": "Poor relief", "response": ["The problem of poverty in England was exacerbated during the early 16th century by a dramatic increase in the population. This rose \"from little more than 2 million in 1485, ... [to] about 2.8 million by the end of Henry VII's reign (1509)\". The population was growing faster than the economy's ability to provide employment opportunities. The problem was made worse because during the English Reformation, Henry VIII severed the ecclesiastical governance of his kingdoms of England and Ireland and made himself the Supreme Head of the Church of England. This involved the Dissolution of the Monasteries in England and Wales: the assets of hundreds of rich religious institutions, including their great estates, were taken by the Crown. This had a devastating impact on poor relief. According to the historian Paul Slack, prior to the Dissolution \"it has been estimated that monasteries alone provided 6,500 pounds a year in alms before 1537 []; and that sum was not made good by private benefactions until after 1580.\" In addition to the closing of the monasteries, most hospitals (which in the 16th century were generally almshouses rather than medical institutions) were also closed, as they \"had come to be seen as special types of religious houses\". This left many of the elderly and sick without accommodation or care. In 1531, the Vagabonds and Beggars Act was revised, and a new Act was passed by parliament which did make some provision for the different classes of the poor. The sick, the elderly, and the disabled were to be issued with licences to beg. But those who were out of work and in search of employment were still not spared punishment. Throughout the 16th century, a fear of social unrest was the primary motive for much legislation that was passed by parliament."]}, {"page": "Bradford Grammar School", "response": ["*Paul Slack (born 1943), historian"]}, {"page": "Ford Lectures", "response": ["* 1994–95 Paul Slack, From Reformation to improvement: public welfare in early modern England "]}, {"page": "Peter Clark (historian)", "response": ["* Editor (with Paul Slack), Crisis and Order in English Towns (Routledge, 1972, 2006)"]}, {"page": "Gerald Aylmer", "response": ["In 1993 Aylmer was honoured with a festschrift edited by his long-time colleagues John Morrill and Paul Slack and his former doctoral student Daniel Woolf.", "Aylmer's publications up to 1990 are listed in his Festschrift.William Sheils, 'Select Bibliography', in John Morrill, Paul Slack and Daniel Woolf, eds, Public Duty and Private Conscience in Seventeenth-Century England: Essays Presented to G. E. Aylmer, Oxford, 2003."]}, {"page": "Daniel Woolf", "response": ["In 1961, his family emigrated to Winnipeg, Canada, where Woolf graduated from St. Paul's High School in 1976. He obtained his BA in History from Queen's University in Kingston, Ontario in 1980, and then a DPhil in Modern History from St Peter's College, University of Oxford, in 1983. He was supervised by Gerald E. Aylmer, a distinguished historian of 17th century England and then-Master of St Peter's. Along with historians John Morrill and Paul Slack, Woolf would eventually co-edit a 1993 festschrift honouring Aylmer. Among Woolf's contemporaries at St Peter's was David Eastwood, Vice-Chancellor of the University of Birmingham since 2009.", "* (co-ed., with John Morrill and Paul Slack) Public Duty and Private Conscience in Seventeenth-Century England, Oxford University Press (1993)"]}, {"page": "Faculty of History, University of Oxford", "response": ["*Paul Slack"]}, {"page": "List of Honorary Fellows of Balliol College, Oxford", "response": ["* Paul Slack"]}, {"page": "Samuel Pepys Club", "response": ["|Paul Slack"]}]}}