{"wiki_id": "http://www.wikidata.org/entity/Q7155089", "itemLabel": "Pauline Stafford", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Pauline_Stafford", "wikipedia_page": {"main": "Pauline Stafford is Professor Emerita of Early Medieval History at Liverpool University, and Visiting Professor at Leeds University in England. Dr Stafford is a former Vice-President of the Royal Historical Society.", "link_mentions": [{"page": "Emma of Normandy", "response": ["As Pauline Stafford noted, Emma is the \"first of the early medieval queens\" to be depicted through contemporary portraiture. To that end, Emma is the central figure within the Encomium Emmae Reginae (incorrectly titled Gesta Cnutonis Regis during the later Middle Ages) a critical source for the study of English succession in the 11th century. During the reign of Æthelred, Emma most likely served as little more than a figurehead a physical embodiment of the treaty between the English and her Norman father. However, her influence increased considerably under Cnut. Until 1043, writes Stafford, Emma \"was the richest woman in England ... and held extensive lands in the East Midlands and Wessex.\" Emma's authority was not simply tied to landholdings—which fluctuated greatly from 1036 to 1043—she also wielded significant sway over the ecclesiastical offices of England."]}, {"page": "Æthelred I of Wessex", "response": ["Alfred records in the preamble to his will that Æthelwulf had left property jointly to three of his sons, Æthelbald, Æthelred and Alfred, with the proviso that the brother who lived longest would succeed to all of it. When Æthelbald died in 860, Æthelred and Alfred, who were still young, agreed to entrust their share to the new king, Æthelberht, on a promise that he would return it to them intact. When Æthelred succeeded to the throne, Alfred asked him at a meeting of the witan (assembly of leading men) to give him his share of the property. However, Æthelred said that he had attempted many times to divide it but had found it too difficult, and he would instead leave the whole to Alfred on his death. Some historians see the bequest as including the whole of Æthelwulf's bookland, his personal property which he could leave in his will (as opposed to the folkland which passed according to customary law and property earmarked for the support of the crown); it is further argued that it was considered desirable that the bookland would be kept by the king, so Æthelwulf's provision implies that the throne would pass to each brother in turn. However, other historians assert that the bequest had nothing to do with the kingship, and Alfred Smyth argues that the bequest was provision for Æthelwulf's young sons when they reached adulthood, with Æthelbald as trustee and residuary beneficiary if they died young. When Alfred succeeded, the supporters of Æthelred's infant sons complained that Alfred should have shared the property with them, and Alfred had his father's will read to a meeting of the witan to prove his right to keep the whole of the property. Alfred rarely witnessed Æthelred's charters, and this together with the argument over their father's will suggests that they may not have been on good terms. The historian Pauline Stafford suggests that Æthelred may have chosen to highlight his wife's status as queen in a charter in order to assert his own sons' claims to the succession."]}, {"page": "Æthelflæd", "response": ["Historians disagree whether Mercia was an independent kingdom under Æthelred and Æthelflæd but they agree that Æthelflæd was a great ruler who played an important part in the conquest of the Danelaw. She was praised by Anglo-Norman chroniclers such as William of Malmesbury, who described her as \"a powerful accession to [Edward's] party, the delight of his subjects, the dread of his enemies, a woman of enlarged soul\". According to Pauline Stafford, \"like ... ElizabethI she became a wonder to later ages\". In Nick Higham's view, medieval and modern writers have been so captivated by her that Edward's reputation has suffered unfairly in comparison.", "Some historians believe that Æthelred and Æthelflæd were independent rulers. In the Handbook of British Chronology, David Dumville refers to \"Q. Æthelflæd\" and comments, \"The titles given her by all sources (hlæfdige, regina) imply that she wielded royal power and authority\". Alex Woolf concurs and Pauline Stafford describes Æthelflæd as \"the last Mercian queen\", referred to in charters in such terms as \"by the gift of Christ's mercy ruling the government of the Mercians\". Stafford argues that Æthelred and Æthelflæd exercised most or all of the powers of a monarch after Alfred's death but it would have been a provocative act formally to claim regality, especially after Æthelwold's rebellion. Stafford sees her as a \"warrior queen\", \"Like ... ElizabethI she became a wonder to later ages.\" According to Charles Insley,"]}, {"page": "Æthelwulf, King of Wessex", "response": ["Æthelwulf returned to Wessex to face a revolt by Æthelbald, who attempted to prevent his father from recovering his throne. Historians give varying explanations for both the rebellion and the marriage. In Nelson's view, Æthelwulf's marriage to Judith added the West Saxon king to the family of kings and princely allies which Charles was creating. Charles was under attack both from Vikings and from a rising among his own nobility, and Æthelwulf had great prestige due to his victories over the Vikings; some historians such as Kirby and Pauline Stafford see the marriage as sealing an anti-Viking alliance. The marriage gave Æthelwulf a share in Carolingian prestige, and Kirby describes the anointing of Judith as \"a charismatic sanctification which enhanced her status, blessed her womb and conferred additional throne-worthiness on her male offspring.\" These marks of a special status implied that a son of hers would succeed to at least part of Æthelwulf's kingdom, and explain Æthelbald's decision to rebel. The historian Michael Enright denies that an anti-Viking alliance between two such distant kingdoms could serve any useful purpose, and argues that the marriage was Æthelwulf's response to news that his son was planning to rebel; his son by an anointed Carolingian queen would be in a strong position to succeed as king of Wessex instead of the rebellious Æthelbald. Abels suggests that Æthelwulf sought Judith's hand because he needed her father's money and support to overcome his son's rebellion, but Kirby and Smyth argue that it is extremely unlikely that Charles the Bald would have agreed to marry his daughter to a ruler who was known to be in serious political difficulty. Æthelbald may also have acted out of resentment at the loss of patrimony he suffered as a result of the decimation."]}, {"page": "Æthelbald, King of Wessex", "response": ["Historians give varying explanations for both the marriage and the rebellion. D. P. Kirby and Pauline Stafford see the match as sealing an anti-Viking alliance. Another factor was Judith's descent from Charlemagne: union with her gave Æthelwulf a share in Carolingian prestige. Kirby describes her anointing as \"a charismatic sanctification which enhanced her status, blessed her womb and conferred additional throne-worthiness on her male offspring.\" These marks of a special status implied that a son of hers would succeed to at least part of Æthelwulf's kingdom, and explain Æthelbald's decision to rebel. He may also have feared that he would be disadvantaged if his father returned to rule Wessex while his brother kept Kent. Michael Enright argues that an alliance against the Vikings between such distant territories would have served no useful purpose. He sees the marriage as following Æthelbald's rebellion and being a response to it, intending that a son of Judith would displace Æthelbald as successor to the throne. Janet Nelson goes further, seeing Æthelwulf's pilgrimage as intended from the start to enhance his prestige to assist him in facing down filial resentments. Kirby and Sean Miller argue that it is unlikely that Charles would have agreed to his daughter being taken to a country in a state of civil war, so Æthelbald's revolt was probably a response to the marriage, which threatened to produce sons who had a stronger claim to the throne than he had. Richard Abels argues that Æthelbald probably hoped that his rule would be permanent: \"All knew the dangers that attended a pilgrimage to Rome and were aware of the possibility that Æthelwulf would not return. His departure to Rome all but invited the prowling of hungry æthelings.\" Charles may have agreed to the marriage because he was under attack both from Vikings and from a rising among his own nobility, and Æthelwulf had great prestige due to his victories over the Vikings. The marriage added the West Saxon king to the network of royal and princely allies that Charles was creating.", "Asser is the sole source for the dispute between Æthelwulf and Æthelbald, which is not mentioned in the Anglo-Saxon Chronicle, and according to Asser when Æthelwulf returned to England he agreed to divide the kingdom to avoid a civil war. Most historians state that Æthelbald kept Wessex while Æthelberht agreed to surrender the south-eastern kingdoms of Kent, Essex, Surrey and Sussex to Æthelwulf, although Simon Keynes thinks that Æthelwulf kept a degree of sovereignty. Some historians argue that it is more likely that Wessex itself was divided, with Æthelbald keeping his power base west of Selwood, Æthelwulf taking the east and Æthelberht keeping Kent. Pauline Stafford and D. P. Kirby point out that Asser implies that Judith became queen of the West Saxons in 856. Sean Miller observes that Asser complained that the \"son ruled where by rightful judgment the father should have done; for the western part of the Saxon land has always been more important than the eastern\", and since Kent had been conquered only thirty years previously, it did not make sense to speak of it as having always been a less important part of the kingdom."]}, {"page": "Coenwulf of Mercia", "response": ["A charter of 799 records a wife of Coenwulf named Cynegyth; the charter is forged, but this detail is possibly accurate.Pauline Stafford, \"Political Womena\", in Brown & Farr, Mercia, p. 42, n. 5. Ælfthryth is more reliably established as Coenwulf's wife, again from charter evidence; she is recorded on charters dated between 804 and 817.Ælfthryth 3, PASE. Coenwulf's daughter, Cwoenthryth, survived him and inherited the monastery at Winchcombe which Coenwulf had established as part of the patrimony of his family.Yorke, Kings and Kingdoms, pp. 118–119. Cwoenthryth subsequently was engaged in a long dispute with Archbishop Wulfred over her rights to the monastery. Coenwulf also had a son, Cynehelm, who later became known as a saint, with a cult dating from at least the 970s.Thacker, \"Kings, Saints and Monasteries\", p. 8. According to Alfred the Great's biographer, the Welsh monk and bishop, Asser, Alfred's wife Ealhswith was descended from Coenwulf through her mother, Eadburh, though Asser does not say which of Coenwulf's children Eadburh descends from.Kirby, Earliest English Kings, p. 212."]}, {"page": "Stigand", "response": ["King Edward, on his deathbed, left the crown to his brother-in-law Harold Godwinson, the son of Earl Godwin. Stigand performed the funeral services for Edward.Rex Harold II p. 197 Norman writers claimed that Stigand crowned Harold as king in January 1066.Chibnall Anglo-Norman England p. 21 This is generally considered false propaganda, as it was in William's interest to portray Harold as uncanonically crowned. If Harold was improperly crowned, then William was merely claiming his rightful inheritance, and not deposing a rightful king.Higham Death of Anglo-Saxon England pp. 175–180 The Bayeux Tapestry depicts Stigand at Harold's coronation, although not actually placing the crown on Harold's head.Rex Harold II p. 151 The English sources claim that Ealdred, the Archbishop of York, crowned Harold, while the Norman sources claim that Stigand did so, with the conflict between the various sources probably tracing to the post-Conquest desire to vilify Harold and depict his coronation as improper. Current historical research has shown that the ceremony was performed by Ealdred, owing to the controversy about Stigand's position. However, one historian, Pauline Stafford, theorises that both archbishops may have consecrated Harold.Stafford Unification and Conquest p. 83 Another historian, Frank Barlow, writing in 1979, felt that the fact that some of the English sources do not name who consecrated Harold \"tip(s) the balance in favour of Stigand\".Barlow English Church 1000–1066 p. 60 footnote 4"]}, {"page": "Ælfgifu of Northampton", "response": ["When Swein invaded, northern peoples, many of them of Scandinavian descent, immediately submitted to him. He then married his young son Cnut to Ælfgifu to seal their loyalty. Swein went on to conquer the whole of England and was accepted as King, but he died in February 1014 after a reign of only five weeks. Æthelred then sent an army which forced Cnut to flee back to Denmark, and in the opinion of historian Ian Howard, he left his wife and their baby son, Svein, the future King of Norway, behind with her family. They were anxious to make their peace with Æthelred, but unwilling to hand Ælfgifu and her son over to Æthelred to be killed, so they sent the mother and child with King Swein's body to Denmark. There she became pregnant again and in 1015 or 1016 she gave birth to Harold Harefoot.Ian Howard, Harthacnut: The Last Danish King of England, The History Press, 2008, pp. 13–4. Pauline Stafford, in her Online DNB article on Ælfgifu states only that the marriage took place between 1013 and 1016, but she also states that the marriage was part of Swein's effort to establish himself first in the north Midlands, and as he died in February 1014 it seems likely that the 1013 date is correct.", "During 1036 opinion in England moved towards Harold. By August a report had reached Emma's daughter, Gunnhild, at the German court that her \"unhappy and unjust step-mother\" (i.e. Ælfgifu) was working to deprive Gunnhild's brother, Harthacnut, of the kingdom by holding great feasts, and trying by argument and gifts to persuade the leading nobles to give their fealty to Harold.Stevenson (1913), cited in Pauline Stafford, Queen Emma & Queen Edith, Blackwell, 1001, p. 238 Emma's encomiast attributes to her even more seriously dishonest methods. She makes Ælfgifu an accomplice in the murder of Emma's youngest son, Alfred, by suggesting that she was responsible for sending a forged letter to Normandy inviting Alfred to England. The Encomium Emmae Reginae also claimed that Ælfgifu's son Harold was a servant's son."]}, {"page": "Æthelred, Lord of the Mercians", "response": ["Pauline Stafford comments that \"Alfred's dominance in the 890s over Æthelred, Lord of the Mercians, was as debatable at the time as it still is.\"Stafford, \"'The Annals of Æthelflæd', p. 112"]}, {"page": "Wiglaf of Mercia", "response": ["A medieval tradition preserved at EveshamMacray, Chronicon Abbatiae de Evesham, 1863, cited in Kirby, Earliest English Kings, p. 191 n. 26. records that Wiglaf's grandson Wigstan was a descendant of Coenred, who was a grandson of Penda.  Wigstan's grandfathers were Wiglaf and Ceolwulf I; the tradition might be interpreted to mean that Wiglaf descended from Penda, but it might also be Wiglaf's wife, Cynethryth, who was descended from Penda.Kirby, Earliest English Kings, pp. 190–192  Cynethryth's name is known from two of Wiglaf's charters, dated 831 and 836, and historian Pauline Stafford notes that her name \"seems to hark back to the kin of Coenwulf if not earlier royal lines\", but as with Wiglaf himself, nothing certain is known of her ancestry.Stafford, \"Political Women in Mercia\", pp. 42–43, in Brown & Farr, Mercia.Another Cynethryth was the mother of Ecgfrith of Mercia, Coenwulf's predecessor, and the wife of Offa.  A different connection is mentioned in the medieval Life of St. Wigstan, which asserts that the \"B\" and \"W\" families were related.Yorke, Kings and Kingdoms, p. 120"]}, {"page": "Æthelwold ætheling", "response": ["After Alfred's death in 899, Æthelwold made a bid for the throne. Janet Nelson comments that \"in the eyes of many Englishmen as well as Scandinavians this ætheling had claims stronger than Edward's own.\" According to the 'A' version of the Anglo-Saxon Chronicle, Æthelwold abducted a nun from her convent without the permission of King Edward and against the command of the bishop. Her identity is not known, but it must have been intended to strengthen his claim, and in the view of the historian Pauline Stafford, the Chronicles account is biased in favour of Edward and might have been intended to delegitimise a politically important marriage. Æthelwold took her to the royal manors of Twynham (now Christchurch) and then Wimborne Minster, symbolically important as his father's burial place, and declared that \"he would live or die there\". Lavelle sees Wimborne as strategically significant, close to Roman roads to Dorchester and Salisbury, and at a crossing point of the rivers Allen and Stour; it was the southernmost point for control of access to western Wessex and Æthelwold may have intended a division of the kingdom."]}, {"page": "Edith of Wessex", "response": ["Edith of Wessex ( 1025 – 18 December 1075) was Queen of England from her marriage to Edward the Confessor in 1045 until Edward died in 1066. Unlike most English queens in the 10th and 11th centuries, she was crowned.Pauline Stafford, 'Edith, Edward's Wife and Queen', in Richard Mortimer ed., Edward the Confessor: The Man and the Legend, The Boydell Press, 2009, pp. 119, 129–130. Stafford states (p. 124) that Edith was between 12 and 25 when she married, and probably nearer 25. The principal source on her life is a work she herself commissioned, the Vita Ædwardi Regis or the Life of King Edward who rests at Westminster, which is inevitably biased.Historians disagree whether this was partly written in 1065–66, before Edward's death, or was a unitary work of the late 1060s. Stafford, 2009, pp. 119–120 and note, Ann Williams, ODNB, Edith"]}, {"page": "Ælfgifu (wife of Eadwig)", "response": ["These dangling clues, unsatisfying as they are in themselves, have been used to construct two possible—-and possibly compatible—-genealogies for Ælfgifu, both of which ascribe to her a degree of royal rank. One theory espoused by Cyril Hart and considered by Pauline Stafford makes her a noblewoman of Mercian stock, who descended from Ealdorman Æthelfrith of MerciaS 367, 367a, 371. and his wife Æthelgyth,PASE s.v.  who may have been a daughter of ealdorman Æthelwulf and a niece of King Alfred's Mercian consort Ealhswith.S 1442. PASE s.v.  /  This reconstruction is based on the probability that Risborough (Buckinghamshire), one of Ælfgifu's holdings mentioned in the will, was previously held by Æthelgyth.S 367 and S 1484. The possible implication is that Ælfgifu inherited the estate and many others in Buckinghamshire. Given that she asked Bishop Æthelwold, one of her beneficiaries, to intercede for her \"mother's soul\", she may have done so through the maternal line. If the suggestion is correct, she would have been closely related to the politically prominent family of ealdorman Æthelstan Half-King and his offspring.Hart, Cyril, The Danelaw, p. 462, etc. and 569–604; Stafford, \"Ælfgifu\"; Whitelock, Anglo-Saxon Wills; p. 119"]}, {"page": "Pipe rolls", "response": ["Although the earliest Pipe roll dates from 1130, the 31st year of King Henry I's reign, it is clear that they were being produced by the Exchequer before then, as the 1130 roll is not an experiment. It shows no hesitancy in its use of accounts, or lack of continuity from previous years.Chrimes Administrative History pp. 30–31 An extract from an earlier Pipe roll, from the 25th regnal year of Henry I or 1124, has been found in a 14th-century manuscript now in the Cotton Library at the British Museum.Hagger \"Pipe Roll for 25 Henry I\" English Historical Review  Exactly when the Pipe rolls began to be produced is debated amongst historians. Some hold that they date from Henry I's reign, whether early or late in the reign, but others feel that they were introduced by King William I (reigned 1066–1087). The precursors of the records probably date to the Anglo-Saxon period, as the historian Pauline Stafford argues that financial records must have been kept in some form during the reigns of Cnut (reigned 1016–1035), Æthelred II (reigned 978–1016), and Edgar the Peaceable (reigned 959–975).Stafford Unification and Conquest p. 149 There is a reference to the king's \"rolls\" in a writ from 1110, which purports to be a grant from Henry I to the abbot of Westminster of ten shillings, but the writ may be a forgery, or parts of it may be genuine with some interpolations. As the writ only exists in a copy in a later cartulary, and the Abbey of Westminster is also known to have forged a number of other writs or charters, the writ is not a solid source for royal rolls being kept as early as 1110.Clanchy From Memory to Written Record pp. 137–138"]}, {"page": "Æthelhelm", "response": ["Pauline Stafford identifies him with the Æthelhelm who served as Ealdorman of Wiltshire, the probable father of Ælfflæd,Pauline Stafford, Queen Emma and Queen Edith, Blackwell, 2001, pp. 324–325; PASE s.v.  who became Edward the Elder's second wife about 899. However, Barbara Yorke rejects this idea, arguing that it does not appear to have been the practice for æthelings (princes of the royal dynasty who were eligible to be king) to become ealdormen,Æthelwulf's son Æthelbald may have been an exception. According to Sean Miller, he was appointed an ealdorman in 850 (Sean Miller, Æthelbald, Oxford Online Dictionary of National Biography, 2004), but Simon Keynes suggests that the ætheling and the ealdorman were probably different people (Simon Keynes, Atlas of Attestations, Table XXI, S 301) that a grant from Alfred to Ealdorman Æthelhelm makes no reference to kinship between them, and that the hostile reception to King Eadwig's marriage to Ælfgifu, his third cousin once removed, shows that a marriage between Edward and his first cousin once removed would have been forbidden as incestuous."]}]}}