{"wiki_id": "http://www.wikidata.org/entity/Q715676", "itemLabel": "Ted Turner", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_Turner_(guitarist)", "wikipedia_page": {"main": "David Alan \"Ted\" Turner (born 2 August 1950) is an English guitarist and vocalist best known for his work with the 1970s rock band Wishbone Ash, in which he was famed for his twin lead guitar instrumental arrangements with Andy Powell. Turner also contributed lap steel guitar to a variety of Wishbone Ash recordings.", "link_mentions": [{"page": "August 2", "response": ["*  1950   – Ted Turner, British guitarist"]}, {"page": "Badfinger", "response": ["*Ted Turner – vocals, guitar"]}, {"page": "Wishbone Ash", "response": ["Wishbone Ash are noted for their extensive use of harmony twin lead guitars, which had been attracting electric blues bands since Jeff Beck and Jimmy Page had played together in the Yardbirds in 1966. Their contributions helped Andy Powell and Ted Turner to be voted \"Two of the Ten Most Important Guitarists in Rock History\" (Traffic magazine 1989), and to appear in the \"Top 20 Guitarists of All Time\" (Rolling Stone). Melody Maker (1972) described Powell and Turner as \"the most interesting two guitar team since the days when Beck and Page graced The Yardbirds\". Several notable bands have cited Wishbone Ash as an influence, including Iron Maiden, Van Halen, Lynyrd Skynyrd, Thin Lizzy, Metallica, Dream Theater, Overkill and Opeth.", "Formed in Torquay, Devon, in 1969, out of the ashes of trio The Empty Vessels (originally known as The Torinoes, later briefly being renamed Tanglewood in 1969), which had been formed by Wishbone Ash's founding member Martin Turner (bass & vocals) in 1963 and complemented by Steve Upton (drums and percussion) in 1966. The original Wishbone Ash line-up was completed by guitarists/vocalists Andy Powell and Ted Turner. In 1974, Ted Turner left the band, and was replaced by Laurie Wisefield. The band continued on with strong critical and commercial success until 1980. There followed line-ups featuring former bass players from King Crimson (John Wetton), Uriah Heep (Trevor Bolder), and Trapeze (Mervyn Spence), Wisefield left in 1985. In 1987, however, the original line-up reunited for several albums – Nouveau Calls, Here to Hear and Strange Affair – until 1990, when Upton quit the band. After Martin Turner was replaced in 1991, the band recorded The Ash Live in Chicago, before Ted Turner left in 1993. This left Andy Powell as the sole remaining original founding member of Wishbone Ash to continue the band on into the future.", "Wishbone Ash were formed in October 1969 by bass guitarist Martin Turner and drummer Steve Upton. When Tanglewood's original guitarist, Martin's brother Glenn Turner left the trio and returned to his native Devon, their manager, Miles Copeland III advertised for a guitar player and also for a keyboard player. After an extensive search for a guitarist, the band could not decide between the final two candidates, Andy Powell and Ted Turner (no relation to Martin). It was suggested that they try both guitar players \"just to see what it sounds like\". Differing from the twin lead sound of Southern rock pioneer The Allman Brothers Band, Wishbone Ash included strong elements of progressive rock, and also of folk and classical music. After the band members wrote several suggested band names on two sheets of paper, Martin Turner picked one word from each list – 'Wishbone' and 'Ash'.", "The band had now begun to play major arenas as headliners. Wishbone Four (1973) was the band's first record without producer Derek Lawrence, as the band decided to produce the album themselves. In December 1973, the band released a double live album, Live Dates. There was an album released called Wishbone Ash Live in Memphis, which was a promo to FM radio stations but never sold in stores. Not long after, guitarist Ted Turner left the band. After replacing Turner with guitarist Laurie Wisefield (ex-Home), the band relocated to the US and recorded There's the Rub (1974). Locked In (1976), produced by Tom Dowd, saw the band moving towards US soft-rock territory and the group began touring with a keyboard player.", "In 1987, I.R.S. Records founder and original Wishbone manager Miles Copeland III began a series of albums entitled No Speak, which featured all instrumental music. To launch the label successfully, Copeland needed a big name band that would bring publicity to the project. Copeland approached the four founding members of Wishbone Ash about having the original line-up record an all-instrumental album. For the first time in fourteen years, Andy Powell and Steve Upton joined forces with Martin Turner and Ted Turner to record the album Nouveau Calls, released in February 1988. The original line-up's tour of 1988 was a huge success, as the band played large venues for the first time since the late 1970s. In August 1989, the band released a reunion album with vocals entitled Here to Hear, featuring mainly songs written by Ted and Martin Turner.", "In 1990 the band went back into the studio to record the follow-up to Here to Hear. The band were shocked when founding member Upton, the band's drummer for their entire career, announced his retirement from the music industry. They enlisted drummer Robbie France, but replaced him with Ray Weston when it was determined that personal conflicts between France and Martin Turner could not be resolved. Strange Affair was released in May 1991, featuring mainly songs written by Andy Powell and Ted Turner.", "Later in 1991, the band decided to continue without founding member Martin Turner, with the bassist/vocalist being replaced by returnee Andy Pyle, who had been in the band years earlier. The band toured throughout 1992/93, releasing the live album The Ash Live in Chicago. 1994 saw the second and final departure of Ted Turner. Following Turner's departure, Pyle and Weston also left the band.", "Martin Turner began touring in 2004 with \"Martin Turner's Wishbone Ash\", performing material by the classic line ups of the band. Occasionally Ted Turner and Laurie Wisefield have joined his group on stage as guests. He published his autobiography in 2012.", "* Ted Turner – guitar, vocals, banjo (1969–1974; 1987–1994)"]}, {"page": "Imagine (John Lennon album)", "response": ["*Ted Turner – acoustic guitar (2, 8)"]}, {"page": "How Do You Sleep? (John Lennon song)", "response": ["Lennon recorded \"How Do You Sleep?\" on 26 May 1971 at Ascot Sound Studios, during the sessions for his Imagine album. String overdubs took place on 4 July 1971 at the Record Plant, in New York City. The song features a slide guitar part played by George Harrison. Aside from Lennon on rhythm guitar and vocals, the track also includes contributions from Klaus Voormann on bass, Alan White on drums, acoustic guitar played by Ted Turner, Rod Linton and Andy Davis, as well as additional piano parts by Nicky Hopkins and John Tout. Although he had been united with Lennon, Ringo Starr and Klein, against McCartney, in the recent lawsuit, Harrison recalled that the period was one of \"very strange, intense feelings\" among all the former Beatles, and he was initially wary of Lennon's invitation to play on the new album. Given this, Harrison added, he was relieved that Lennon was \"openly pleased I came\".", "*Ted Turner – acoustic guitar"]}, {"page": "Andy Powell", "response": ["In 1969, Powell answered a Melody Maker classified in which Martin Turner and Steve Upton advertised for a guitar player.  Being unable to choose between Powell and another applicant (Ted Turner), Wishbone Ash was formed with two lead guitarists.", "In 1988, Powell contributed to Miles Copeland III's Night of the Guitar project alongside Ted Turner, touring extensively with artists such as Randy California, Jan Akkerman, Steve Howe, Steve Hunter, Robby Krieger, Leslie West and Alvin Lee."]}, {"page": "Wishbone Ash (album)", "response": ["*Ted Turner - lead guitar, vocals"]}, {"page": "Pilgrimage (Wishbone Ash album)", "response": ["All songs composed by Martin Turner, Steve Upton, Ted Turner and Andy Powell, except where noted.", "*Ted Turner – guitar, vocals"]}, {"page": "Argus (album)", "response": ["Music by Wishbone Ash, lyrics by Martin Turner, except \"Time Was\" by Ted Turner and Martin Turner, and \"Leaf and Stream\" by Steve Upton.", "* Ted Turner – lead (tracks 2, 3, 4, 6), slide (track 3), harmony lead, rhythm and acoustic guitars, vocals"]}, {"page": "Wishbone Four", "response": ["Wishbone Four was also the first release not produced by Derek Lawrence but by the band themselves. There's the Rub, the band's next and fifth studio album' was the first album to feature guitarist-vocalist Laurie Wisefield, who would be a major part of the band's creative direction for the next 11 years, as founding member Ted Turner left the band after the subsequent Wishbone Four tour.", "*Ted Turner – lap-steel, 12 string, acoustic and electric guitars, vocals"]}, {"page": "New England (Wishbone Ash album)", "response": ["All songs written and composed by Martin Turner/Andy Powell/Laurie Wisefield/Steve Upton, except \"Candlelight\" by Martin Turner/Andy Powell/Laurie Wisefield/Steve Upton/Ted Turner."]}, {"page": "List of lead guitarists", "response": ["* Ted Turner (Wishbone Ash)"]}, {"page": "Crippled Inside", "response": ["*Ted Turner – acoustic guitar"]}, {"page": "Martin Turner", "response": ["In 2005, he formed a new band, Martin Turner's Wishbone Ash to perform music from the definitive era of Wishbone Ash. The band's first line-up included guitarists Ray Hatfield and Keith Buck plus drummer Rob Hewins. Their current line-up now includes guitarists Misha Nikolic, Danny Willson (former member of Showaddywaddy) and drummer Tim Brown. Their debut release, entitled New Live Dates Vol.1 was released in 2006, followed by New Live Dates Vol. 2 in 2007. Both featured a guest appearance by original Wishbone Ash member Ted Turner.", "In July 2012 Martin Turner published his autobiography No Easy Road – My Life and Times With Wishbone Ash and Beyond through his website. The book chronicles the classic Wishbone Ash years, as well as Turner's personal journey, and contained contributions from former Wishbone Ash members Ted Turner (who also wrote the foreword to the book), Laurie Wisefield and Ray Weston, as well as other key figures in the story.", "(all compositions written by Martin Turner/Steve Upton/Ted Turner/Andy Powell)", "* Ted Turner - guitars and vocals on tracks 11 to 17"]}, {"page": "David \"Ted\" Turner", "response": ["#REDIRECT Ted Turner (guitarist)"]}, {"page": "Ted Turner (disambiguation)", "response": ["Ted Turner is an American media mogul and philanthropist.", "Ted Turner may also refer to:", "* Ted Turner (guitarist) (born 1950), guitarist and vocalist", "* Ted Turner (baseball) (1892–1958), Major League Baseball pitcher", "* Ted Turner (footballer) (1921–1981), Australian rules footballer"]}, {"page": "Standing in the Rain", "response": ["* A song written by Ted Turner on the 1991 Wishbone Ash album Strange Affair"]}, {"page": "List of slide guitarists", "response": ["*Ted Turner "]}, {"page": "Live from Memphis (album)", "response": ["* Ted Turner – guitar, vocals"]}, {"page": "I.R.S. No Speak", "response": ["| 13024 || various artists || Night of the Guitar - Live! || 1989 || highlights of a 26 November 1988 concert featuring Steve Howe, Leslie West, Robby Krieger, Randy California, Steve Hunter, Pete Haycock, Andy Powell, Ted Turner & Alvin Lee—LP and CD differ slightly in contents"]}]}}