{"wiki_id": "http://www.wikidata.org/entity/Q7151360", "itemLabel": "Paul Holowaty", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Holowaty", "wikipedia_page": {"main": "Paul Holowaty (born 7 March 1985) is an English actor. He was born in Bolton, and is probably most well known for his role as racist bully “Steven \"Macki\" Mackintosh” in popular soap opera Hollyoaks. In 2010, he made his West End debut in the musical Wolfboy at the Trafalgar Studios in London.\nHe made his debut on American television in 2016 appearing in NCIS. He is currently filming a series regular role in a new series about EDM DJs called CVNT5, written by and starring Gareth Emery.", "link_mentions": [{"page": "Gareth Emery", "response": ["On 18 June 2018, American video streaming service go90 announced eight episodes of \"We Are CVNT5\", which will expand on the original CVNT5 mockumentary. The series was directed by Matt Enlow, written by Emery, Alex Madden and Geraint Jones, and featured Paul Holowaty, Taylor Misiak, Dillon Francis, and Pete Tong. The series was based heavily on Emery's musical experience during the United States' electronic dance music boom. A trailer for the series was released on 25 June 2018. Emery revealed through Facebook that the project encountered many issues during its production, including \"tears\", \"screaming\", and lawsuits, but managed to complete it in time. All eight episodes of \"We Are CVNT5\" were made available on 28 June 2018."]}, {"page": "List of former Hollyoaks characters", "response": ["|Stephen Mackintosh || Paul Holowaty || 2005"]}, {"page": "Bethany Platt", "response": ["Bethany is the daughter of Sarah Platt (Tina O'Brien) and her classmate Neil Fearns (Paul Holowaty), half-sister of Billy and Harry Platt, granddaughter of Gail Platt (Helen Worth) and Brian Tilsley (Christopher Quinten), and great-granddaughter of Audrey Roberts (Sue Nicholls). Bethany's storylines have included her taking ecstasy tablets when her uncle, David Platt (Jack P. Shepherd), hid them in her doll. Bethany departed Weatherfield with her mother Sarah for a new life in Milan. Her return storyline saw her running away from home in Milan back to Weatherfield, and since then, her storylines have included the character's infatuation with David's enemy Callum Logan (Sean Ward) in the midst of his conflict against her family; being a victim of school bullying; developing a crush on her mother's boyfriend Gary Windass (Mikey North); her dangerous relationship with local pimp boss Nathan Curtis (Christopher Harper), who subjugates Bethany in child grooming and sexual exploitation; becoming a lapdancer in the follow-up of her grooming ordeal, which involves building a friendship with Craig Tinker (Colson Smith); being stalked and kidnapped by the daughter, Kayla Clifton (Mollie Winnard), of one of the men who abused her; dating Ryan Connor (Ryan Prescott); and helping her colleague Daniel Osbourne (Rob Mallard) with the death of his wife Sinead (Katie McGlynn) and falling in love with him. She left Weatherfield to start a new life in London.", "When Sarah begins dating Todd Grimshaw (Bruno Langley), he accepts Bethany as his own. Much to Gail's disgust, Sarah and Bethany move in with Todd and his family, leading Gail to involving Social Services and causing a rift in the family. When Bethany's father, Neil Fearns (Paul Holowaty), is killed in a car accident in late 2003, Sarah decides to take Bethany to the funeral. Neil's mother, Brenda (Julia Deakin), is pleased to meet Bethany and asks to be part of her life. Neil had decided when Bethany was born that he wanted nothing to do with his daughter."]}, {"page": "Sarah Platt", "response": ["Sarah befriends Candice Stowe (Nikki Sanderson). After her 13th birthday in February 2000, Sarah discovers that she is five months pregnant. Her daughter Bethany Platt is born in June 2000. Bethany's father, Neil Fearns (Paul Holowaty), has no interest in his daughter, but when Neil dies in a car crash in September 2003, Sarah takes Bethany to his funeral and makes friends with Neil's mother, Brenda Fearns (Julia Deakin). This nearly leads to Bethany's death, when Brenda tries to commit suicide with Bethany, fearing that Bethany is being raised in a house of sin. Emily Bishop (Eileen Derbyshire), however, finds them and stops Brenda before harm is done."]}, {"page": "List of former Coronation Street characters", "response": ["|Neil Fearns || Paul Holowaty || 2000"]}, {"page": "List of Coronation Street characters (2000)", "response": ["Mrs. Paton, portrayed by Janice McKenzie, was a head teacher at Weatherfield Comprehensive, and was informed of Sarah-Louise Platt's (Tina O'Brien) pregnancy. She assured Sarah and her concerned parents that Sarah will receive support from the school staff, which Martin was apprehensive about as he didn't want the baby's father Neil Fearns (Paul Holowaty) to be involved.", "Mr. Fearns is the father of Neil Fearns (Paul Holowaty) who impregnates Sarah-Louise Platt (Tina O'Brien) when they are 12 years old. He offers the Platt family help with the baby, which Sarah's mother Gail (Helen Worth) refuses as Neil is not willing to take responsibility for the child. He makes his only appearance just over two months before Sarah's baby is born."]}, {"page": "List of Coronation Street characters (2004)", "response": ["On Christmas Day 2003, Sarah's brother Nick Tilsley (Adam Rickitt), revealed to their mother that his sister was pregnant. By this time Sarah had made a firm decision to keep the baby. For the next few months this caused friction between Gail and Sarah and moved out with Bethany along with Todd to live with  Bethany's paternal grandmother Brenda Fearns (Julia Deakin) until she suffered an mental illness due to  her grieve the loss of her son Neil Fearns (Paul Holowaty). In April 2004, Sarah suffered her first placental abruption, and felt Billy was dead. Once at the hospital, it was discovered Billy was fine, however his heartbeat was slow. This was caused by some uncertainty within Sarah and Todd's relationship. However, when Todd reveals to Sarah that he is gay, she suffers a second placental abruption on 1 June 2004, three months away from her due date. The abruption was so serious Billy had to be born by caesarean section. His first 24 hours alive were critical, and Todd was never granted access to see him. Sarah did not want Todd to see Billy, and she did not want her son, either. On 2 June, Sarah finally agreed to go and see her son, who was in an incubator. However, Billy's health deteriorated and whilst Sarah was bonding with Billy for the first time, he died. Todd never saw his son alive, apart from a photograph that Gail gave him after his death. Although he allowed to name as a father, Gail and Sarah agreed that Billy should have Platt instead. Sarah then  continuously blamed herself for his death until his funeral on 7 June 2004."]}, {"page": "List of Coronation Street characters (2003)", "response": ["Brenda Fearns is the mother of the late Neil Fearns (Paul Holowaty), father of Bethany Platt (Amy and Emily Walton)."]}, {"page": "Wolfboy", "response": ["The musical was previewed between 1 and 4 July 2009, at Tabard Theatre in Chiswick and had a run in 2009 at the Edinburgh Fringe Festival, featuring Gregg Lowe as Bernie, Paul Holowaty as DavidWolfboy program, Ambassador Theatre Group and Lee Latchford-Evans from Steps.", "In 2010 it was presented at Trafalgar Studios in London, featuring Gregg Lowe as Bernie, Paul Holowaty as David, Daniel Boys as Christian, Emma Rigby as Nurse Cherry and Annabel Howitt as Annie. This staging of Wolfboy was produced from 6 to 31 July 2010, directed by Russell Labey, with Iain Vince Gatt as musical director.", "* David: Paul Holowaty"]}, {"page": "Holowaty", "response": ["*Paul Holowaty (born 1985), English actor"]}, {"page": "Holowaty, Paul", "response": ["#redirectPaul Holowaty"]}]}}