{"wiki_id": "http://www.wikidata.org/entity/Q7150146", "itemLabel": "Paul Davies", "itemDescription": "Welsh politician (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Davies_(politician)", "wikipedia_page": {"main": "Paul Windsor Davies (born 1969) is a Welsh politician who served as Leader of the Welsh Conservatives and Leader of the Opposition in Wales from 2018 to 2021. He was Deputy Leader from 2011 to 2018, serving as Acting Leader in 2011 and 2018. \nDavies resigned as Welsh Conservative Leader after possible breaches of Welsh COVID-19 rules. He currently serves as Member of the Senedd (MS) for Preseli Pembrokeshire since 3 May 2007. He gained the seat from Labour and was re-elected in May 2011, and again in May 2016.", "link_mentions": [{"page": "Tamsin Dunwoody", "response": ["Dunwoody was elected (under the name Tamsin Dunwoody-Kneafsey) as Assembly Member for Preseli Pembrokeshire from 2003 to 2007. In October 2005 she was appointed Deputy Minister for Environment, Planning and Countryside and Deputy Minister for Economic Development and Transport in the Welsh Assembly Government. She was defeated in the 2007 election by Conservative Party candidate Paul Davies."]}, {"page": "2003 National Assembly for Wales election", "response": ["| Paul Davies"]}, {"page": "Mid and West Wales (Senedd electoral region)", "response": ["|Paul Davies Conservative", "|rowspan=\"5\"|Paul Davies(Con)"]}, {"page": "Preseli Pembrokeshire (Senedd constituency)", "response": ["| Paul Davies"]}, {"page": "David Melding", "response": ["In July 2018 he supported Paul Davies in his campaign to become the Welsh Conservatives' new leader."]}, {"page": "Nick Ramsay", "response": ["Nick Ramsay (born 10 June 1975) is a British politician who was a Member of the Senedd between 2007 and 2021. He formerly represented the constituency of Monmouth. He was Shadow Minister of Finance under Conservative Leader in the Senedd, Paul Davies MS, but lost the position in Jan 2021 under the new leadership of Andrew RT Davies. Ramsay sat as an Independent member before seeking re-election as an Independent in the 2021 Senedd election.", "Ramsay joined the shadow cabinet under Conservative Leader, Paul Davies MS, in the position of Shadow Minister of Finance and to chair the Public Accounts Committee. In Jan 2021 Andrew RT Davies was named as the new leader of the Welsh Conservatives in the Senedd and sacked Mr Ramsay as finance spokesperson.", "On 2 January 2020 it was reported that Ramsay had been suspended from the Welsh Conservative Party and his parliamentary group following what was described as a \"police incident\" at his home the previous evening. He was held in police custody for 24 hours before being released without charge, but continued to be suspended from the party pending an investigation. On 13 February, Ramsay confirmed that he had been reinstated to the Welsh Conservative Party Group in the Senedd and had dropped his legal challenge against the decision by group leader Paul Davies to suspend him.  Following a period of nearly seven months Ramsay was reinstated to the Conservative party in July 2020 no further comment was made by the Police or the Conservative party. Ramsay left the Conservative Party in March 2020 and sat as an Independent member.", "Mr Ramsay has brought legal action against the Conservative Party on two occasions. The first was against Paul Davies, leader of the Conservative Group in the Senedd when Mr Davies had suspended him from the group after he was arrested following a ‘police incident’ at his home on New Year’s Day 2020 and held in police custody for 24 hours. Eight members of the 11-strong assembly group had supported the suspension. On 13 February, Ramsay confirmed that he had been reinstated to the Welsh Conservative Party Group in the Senedd and had dropped his legal challenge against the decision by group leader Paul Davies to suspend him. Paul Davies was ordered to pay legal costs plus nominal damages fee of £2 to Mr Ramsay, according to a High Court order. Mr Ramsay remained suspended from the Conservative Party."]}, {"page": "Darren Millar", "response": ["In January 2021 the Senedd Commission was investigating Millar for an alleged breach of COVID-19 regulations. He resigned from his frontbench role as chief whip on 23 January 2021 after the leader Paul Davies resigned on the same day."]}, {"page": "Welsh Conservatives", "response": ["In the otherwise mainly successful Welsh Assembly elections of 2011 the long serving Welsh Conservative Leader, Nicholas Bourne (2000–2011) lost his regional list seat in Mid and West Wales. He had been the longest serving of the party political leaders in the Welsh Assembly. The Preseli Pembrokeshire Assembly Member Paul Davies then became the Interim Leader whilst an election took place. The contest was between Andrew RT Davies (South Wales Central) and Nick Ramsay (Monmouthshire). Andrew RT Davies won with some 53.1 per cent of the vote on a 49 per cent turnout of the party's Welsh membership. Also in the post-May 2011 Welsh Assembly elections period David Melding (South Wales Central) was elected as the Deputy Presiding Officer for the Welsh Assembly, the first time a Conservative had held this post."]}, {"page": "2011 National Assembly for Wales election", "response": ["| style=\"background: #9999FF\" | Paul Davies"]}, {"page": "Alun Davies (politician)", "response": ["He was suspended from the Welsh Labour group in the Senedd on 19 January 2021 after allegedly drinking alcohol on Senedd premises while a ban on alcohol sales was in force throughout Wales. The incident happened on 8 December 2020 when Alun Davies met with conservative members Paul Davies, Darren Millar and Nick Ramsay over alcohol in a Tŷ Hywel tearoom to seek their support on his Bill, Welsh Hearts Bill. The Senedd Commssion said it was investigating the incident which \"may have been contrary to public health regulations\". Welsh Government brought in COVID-19 regulations on 4 December 2020, banning the sale of alcohol in licensed premises. At the time of the suspension Alun Davies said he was sorry that the incident gave the impression that he was not upholding the regulations, adding that \"The Senedd Commission has already confirmed to me that I did not breach the coronavirus regulations on the consumption of either food or alcohol that were in force at that time.\""]}, {"page": "Andrew RT Davies", "response": ["He was elected Leader of the Welsh Conservatives in the Senedd on 14 July 2011, resigning the position on 27 June 2018. He was re-appointed as Welsh Conservative leader on 24 January 2021, following the resignation of Paul Davies.", "Davies responded to concerns raised by Airbus in June 2018 regarding the threat of a no-deal Brexit by stating that \"there is a lot of hyperbole flying around\" regarding a no deal Brexit. The comments were criticised by Conservative figures including Guto Bebb. Bebb went on to dispute Davies title as \"Leader of the Welsh Conservatives\", stating he only led the Assembly group. Secretary of State Alun Cairns described Airbus' comments as a \"wake-up call\" for \"one of the jewels in the crown of UK manufacturing\". A number of Davies' Welsh Conservative colleagues, including Secretary of State Alun Cairns, Mr Davies' Deputy, Paul Davies, and Monmouth AM Nick Ramsay, were all Remain supporters, in contrast to Davies role as a Vote Leave voice in the Welsh Conservatives.", "In around April 2018, it was rumoured that his Deputy Leader Paul Davies was planning a leadership challenge to Davies. Amid internal discussions in the party, Nick Ramsay reportedly made it clear to Mr Davies that they did not like each other prior to his resignation, and an AM reportedly \"stormed out\" of a dinner regarding the leadership of the party after Davies had spoken, who later was reported to be Ramsay.", "He was appointed as Leader of the Welsh Conservatives Group on 24 January 2021, following the resignation of Paul Davies, after a scandal involving possible breaches of Welsh COVID-19 regulations."]}]}}