{"wiki_id": "http://www.wikidata.org/entity/Q7153236", "itemLabel": "Paul Riley", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Riley_(musician)", "wikipedia_page": {"main": "Paul Riley (born 3 October 1951, Islington, London) is an English bassist, singer and record producer. He was a member of Chilli Willi and the Red Hot Peppers and Roogalator in the 1970s.", "link_mentions": [{"page": "Snakefinger", "response": ["*Paul Riley (bass player)"]}, {"page": "Inner City Unit", "response": ["By the end of 1979, the line-up of Turner, Thoms and Reeves had been joined by Barry Downes (known as Baz Magneto, bass) and Mick Lee (known as Mick Stupp, drums). They cut demos of \"Space Invaders\" and \"Polyethylene\" for Polydor Records in December, but no deal was forth-coming - these tracks would also be included on the Punkadelic album. They recorded the album Pass Out at Nick Lowe's UK Pro Studios with Paul Riley, also issued on Riddle Records with a sleeve by Bubbles. The album consisted of new recordings of the previous tracks, with covers of the two popular Turner compositions for Hawkwind, \"Master of the Universe\" and \"Brainstorm\", as well as a cover of \"Nuclear Waste\". \"Paradise Beach\" (based on Richard Wagner's \"Ride of the Valkyries\") was released as a single. Steve Redman (known as Speed Machine) momentarily replaced Downes. Turner guested on Sham 69's The Game and his group supported Sham 69 on a British tour, with G.P. Wayne (known as Little Bit) filling in on bass. Soon after Wayne and Stupp left, with Erba rejoining and Reeves playing bass as well as keyboards."]}, {"page": "Pay the Devil", "response": ["*Paul Riley – acoustic bass"]}, {"page": "Bill Kirchen", "response": ["In 2006, Bill kicked off his new deal with Proper Records by recording \"Hammer of the Honky-Tonk Gods\" at their London studio. The band on the album was Nick Lowe, Geraint Watkins and Robert Trehern and it was engineered by Paul Riley.", "This was followed in 2010 by another album – \"Word to the Wise\", once again recorded at Proper's studio in London by Paul Riley, with a band comprising Austin de Lone, Jonny Castle and Jack O'Dell. The record featured many guests including: Paul Carrack, Elvis Costello, Commander Cody, Blackie Farrell, Dan Hicks, Nick Lowe, Maria Muldaur and more.", "2013 saw the third Proper Records album released – also recorded in London by Paul Riley.  The band on \"Seeds And Stems\" was Jack O'Dell and Maurice Cridlin with guest appearances from Austin de Lone and Jorma Kaukonen among others."]}, {"page": "Here Comes the Groom (album)", "response": ["*Paul Riley - bass"]}, {"page": "Nick Lowe and His Cowboy Outfit (album)", "response": ["*Produced by Nick Lowe, Colin Fairley, Paul Riley – (tracks 1–10) & Elvis Costello, Colin Fairley – (track 11)", "Category:Albums produced by Paul Riley (musician)"]}, {"page": "Roogalator", "response": ["The band recorded a demo which resulted in a booking agency deal. Neither Beresford nor Irwin wanted to proceed. With their first live shows ahead, Adler and Plytas rebuilt the line-up. Drummer Dave Solomon, a bandmate of both Plytas and Beresford in a Motown cover band, replaced Irwin. Irwin, noting the band was still minus a bassist, gave a copy of the demo to Paul Riley, a member of the successful pub-scene band Chilli Willi and the Red Hot Peppers. Riley joined Roogalator just before their September 1975 debut, and for a time it was his fame that attracted the band's first press notices."]}, {"page": "The Balham Alligators", "response": ["The following years were spent pursuing individual projects with Watkins and Rickard working with Charlie Hart as, Rickard, Watkins & Hart, with Watkins eventually leading his own outfit, The Wobblers, in 1992. Robin McKidd formed The Companions of The Rosy Hours a western-swing band. Despite the four years since the original band's demise, McKidd was still receiving offers of work for the Alligators, persuading Watkins and Rickard to try out a few gigs with The Wobblers as a backing band, it became apparent that the Alligators were still a viable concern. Bolstered with morale and momentum they recruited session musician Bobby Irwin on drums and ex-Chilli Willi and the Red Hot Peppers' bass guitarist Paul Riley and, by the latter half of 1995,  they recorded Gateway to the South (1996) and followed by Cajun Dance Party (1997).", "*Paul Riley (bass guitar)", "*Produced and recorded by Paul Riley", "*Paul Riley (bass guitar, double-bass)", "*Produced by Paul Riley", "*Paul Riley (bass guitar, double-bass)", "*Produced by Paul Riley", "*Paul Riley (bass guitar, double-bass)"]}, {"page": "Paul \"Bassman\" Riley", "response": ["#REDIRECT Paul Riley (musician)"]}, {"page": "Mr. Lucky (Pete Thomas album)", "response": ["* Paul Riley – bass guitar"]}, {"page": "Desperate Character", "response": ["*Paul Riley – bass"]}, {"page": "Paul Riley", "response": ["Paul Riley may refer to:", "*Paul Riley (actor) (born 1962), Scottish actor", "*Paul Riley (musician) (born 1951), British bassist and record producer", "*Paul Riley (footballer) (born 1963), footballer and coach", "*Paul Riley (cricketer) (born 1981), English cricketer", "*Paul Riley (The Bill), fictional character from TV show The Bill"]}, {"page": "Lew Lewis", "response": ["His album Save the Wail (1979) produced by Paul Riley, featured Buzz Barwell (ex Dr. Feelgood) and Bob Clouter (Ex Mickey Jupp's The Orioles) on drums, Rick Taylor and Pete Zear on guitars and Johnny Squirrel on bass, collectively known as Lew Lewis Reformer, they were, stylistically, \"between pub rock and blues-rock\". They toured Europe, being particularly popular in France and appeared on Musikladen in 1979. Also in 1979 Lewis, Dr Feelgood and Jools Holland performing as 'The Oil City Sheiks', issued a single \"Don't Take but a Few Minutes\" / \"Blues Jam\"."]}, {"page": "Gary Barnacle", "response": ["* Paul Riley"]}, {"page": "Live! on the Battlefield", "response": ["*Paul Riley – bass guitar, vocals"]}, {"page": "My Resistance Is Low", "response": ["| Elvis Costello & Paul Riley & Pete Thomas"]}, {"page": "Karadere beach", "response": ["* Paul Riley"]}, {"page": "What Do Pretty Girls Do?", "response": ["* Paul Riley – bass guitar"]}]}}