{"wiki_id": "http://www.wikidata.org/entity/Q7152730", "itemLabel": "Paul Nicholson", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Nicholson_(businessman)", "wikipedia_page": {"main": "Sir Paul Douglas Nicholson,  (born 7 March 1938) is an English industrialist and was Lord Lieutenant of County Durham from 1997 to 2013.\nNicholson was born in Co. Durham and educated at Harrow School and Clare College, Cambridge. Between Harrow and Cambridge, he was commissioned during National Service in The Coldstream Guards. After qualifying as a Chartered Accountant, he joined Vaux Breweries in 1965 and, from 1976 until 1999, he was Chairman of the Vaux Group, one of the most successful companies in the North East of England.\nHe was Chairman of the Tyne and Wear Development Corporation throughout its existence (1987-1998) and also served  as Chairman of the Northern Region of CBI (1977–1979), Chairman of the Brewers and Licensed Retailers Association, formerly the Brewers Society (1994–1996), and in 1995 he became the inaugural President of the Northeast Chamber of Commerce. He was Knighted in 1993 for 'Services to Industry and the Public in Northeast England'. He was appointed a Knight Commander of the Royal Victorian Order (KCVO) in 2011\nIn his youth he was a prominent amateur rider twice winning the Liverpool Foxhunters steeplechase in 1963 and 1965. Later he was President of the Coaching Club (1990–1997).In 1980 he was appointed High Sheriff of Durham and Lord Lieutenant in 1997.  He has published an autobiography entitled \"Brewer at Bay published by The Memoir Club\".\nNicholson is married to Sarah Bacon, daughter of Sir Edmund Bacon, 13th and 14th Baronet, the premier baronet in the United Kingdom.  They have one daughter, Lucy (b. 1972).\nAlready a Knight Bachelor, Nicholson was appointed Knight Commander of the Royal Victorian Order (KCVO) in the 2011 Birthday Honours.", "link_mentions": [{"page": "List of Old Harrovians", "response": ["*Paul Nicholson (1938–), Lord Lieutenant of Durham (1997–2013)"]}, {"page": "Vaux Breweries", "response": ["By the 1990s, the Vaux Group had expanded into hotels. Despite the brewing business being profitable and an offer to buy it having been received from management, in March 1999 the Board accepted the advice of the Corporate Financier, BT Alex. Brown, a subsidiary of Deutsche Bank, and decided to close both breweries. This caused Chairman Sir Paul Nicholson, who disagreed with the closure decision, to resign.Chairman lifts lid on deal which closed Vaux BBC News, 9 June 2003 The company changed its name to Swallow Group plc, and in July sold its tenanted pub estate to a client of the corporate financier, concentrating on Swallow Hotels business and incorporating the former Vaux-managed pub estate under the Swallow Inns & Restaurants brand."]}, {"page": "Sir Paul Nicholson", "response": ["#REDIRECT Paul Nicholson (businessman)"]}, {"page": "Paul Nicholson", "response": ["Paul Nicholson may refer to:", "*Paul Nicholson (ice hockey) (1954–2011), Canadian ice hockey forward ", "*Paul Nicholson (darts player) (born 1979), English-born Australian darts player", "*Paul Nicholson (businessman) (born 1938), English industrialist and Lord Lieutenant of County Durham", "*Paul Nicholson (footballer) (born 1986), professional footballer"]}, {"page": "Paul Douglas Nicholson", "response": ["#REDIRECT Paul Nicholson (businessman)"]}, {"page": "Paul Nicholson (industrialist)", "response": ["#REDIRECT Paul Nicholson (businessman)"]}]}}