{"wiki_id": "http://www.wikidata.org/entity/Q7155028", "itemLabel": "Pauline Hamill", "itemDescription": "Scottish footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pauline_Hamill", "wikipedia_page": {"main": "Pauline Hamill (born 18 December 1971) is a Scottish former female international football forward who retired in 2011 while playing for Celtic in the Scottish Women's Premier League. A left–sided winger or forward, Hamill enjoyed a long career at club level with spells in Iceland and England.\nHamill made her senior Scotland debut in 1992 and amassed 141 appearances. She was the first woman to reach 100 caps for Scotland and her total was the highest by any Scottish player, male or female, at the time of her retirement.\n\n", "link_mentions": [{"page": "2011 FIFA Women's World Cup qualification – UEFA Group 3", "response": ["*  Pauline Hamill"]}, {"page": "Kim Little", "response": ["At the age of 16, Little made her debut for Hibernian L.F.C. of the Scottish Women's Premier League (SWPL) during a UEFA Women's Champions League match against RCD Espanyol at Almondvale Stadium on 8 August 2006. Hibs had signed Little and other players from their youth team to replace veterans Pauline Hamill, Nicky Grant and Debbie McWhinnie who all left the club that summer. In her SWPL league debut, she scored a hat trick against Hutchison Vale L.F.C. During her time with Hibernian, Little helped the club win the SWPL championship title, Scottish Cup, and the Premier League Cup. She competed with the team in the UEFA Women's Champions League twice. During the 2006–07 season, Hibernian won every match with Little scoring 55 goals in her 30 appearances for the club. The following season, she scored 33 goals in 18 appearances with the club."]}, {"page": "Joanne Love", "response": ["Joanne Love (born 6 December 1985) is a Scottish female international football midfielder. She currently plays for Glasgow City, having previously played in the English FA Women's Premier League for Doncaster Rovers Belles. By the age of 23, Love had amassed over 75 caps for Scotland. Two years later she became the fourth player to make a century of appearances, behind Pauline Hamill, Julie Fleeting and Gemma Fay."]}, {"page": "Gemma Fay", "response": ["Fay moved on to 141 appearances in May 2012, equalling the record held by Pauline Hamill, after playing in a 3–1 friendly win over Poland in Gdańsk. She set a new record of 142 appearances after playing in Scotland's next match, a 4–1 friendly defeat to Sweden."]}, {"page": "Scotland women's national football team results (2010–2019)", "response": ["|Kim Little (2), Pauline Hamill, Julie Fleeting (4), Suzanne Grant", "|Kim Little (2), Pauline Hamill", "|Jen Beattie, Julie Fleeting, Kim Little, Rachel Corsie, Pauline Hamill"]}, {"page": "2008 Cyprus Women's Cup", "response": ["*  Pauline Hamill"]}, {"page": "Scotland women's national under-19 football team", "response": ["*Pauline Hamill (2017–present)"]}, {"page": "Scottish Women's Football Annual Awards", "response": ["| Pauline Hamill"]}, {"page": "Pauline MacDonald", "response": ["After approximately a decade of working for the SFA as coach and assistant coach with the national women's youth teams, MacDonald was appointed coach of the Scotland under-17 women's team in October 2017. She joined her former Scotland teammates Shelley Kerr and Pauline Hamill as a full-time female coach on the SFA payroll."]}, {"page": "Scottish FA Women's International Roll of Honour", "response": ["| 100px|alt=Pauline Hamill"]}, {"page": "2019 UEFA Women's Under-19 Championship squads", "response": ["Head Coach: Pauline Hamill"]}]}}