{"wiki_id": "http://www.wikidata.org/entity/Q7151377", "itemLabel": "Paul Hopkins", "itemDescription": "footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Hopkins_(footballer)", "wikipedia_page": {"main": "Paul David Hopkins (born 29 November 1986 in Liverpool) is an English former professional footballer who played in the Football League for Darlington. He also played for Waterford United in the League of Ireland and for Bangor City in the Welsh Premier League.\nHopkins, a striker who can also play on the right wing, was a prolific goalscorer at schoolboy level with Liverpool. He then joined Everton's youth system, was part of their 2002 FA Youth Cup Final, and continued scoring goals in the under-age teams. He signed professional forms in 2005, and made his debut for England under-20, on 16 August 2005 as a substitute in a 4–0 defeat to their Russian counterparts. He scored only infrequently for Everton's reserve team, and spent a month on loan at League Two club Darlington, during which he made his debut in the Football League, on 7 January 2006 in a 3–2 win against Notts County, and scored once. At the end of the 2005–06 season he was released by Everton.Hopkins signed for League of Ireland Premier Division side Waterford United in July 2006, and joined Bangor City of the Welsh Premier League six months later.", "link_mentions": [{"page": "Hopkins", "response": ["* Paul Hopkins (baseball) (1904–2004), baseball pitcher", "* Paul Hopkins (actor) (born 1968), Canadian television, film and theatre actor", "* Paul Hopkins (footballer) (born 1986), English (soccer) footballer"]}, {"page": "2006–07 Everton F.C. season", "response": ["|  Paul Hopkins"]}, {"page": "Paul Hopkins", "response": ["Paul Hopkins may refer to:", "* Paul Hopkins (baseball) (1904–2004), right-handed relief pitcher in Major League Baseball", "* Paul Hopkins (actor) (born 1968), Canadian television, film and theatre actor", "* Paul Hopkins (footballer) (born 1986), English former footballer", "* Paul Hopkins (pilot) (1951–2014), chief test pilot of British Aerospace in the late 1990s"]}]}}