{"wiki_id": "http://www.wikidata.org/entity/Q7150996", "itemLabel": "Paul Green", "itemDescription": "British taekwondo athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Green_(taekwondo)", "wikipedia_page": {"main": "Paul Green (born 16 February 1977) is a British former international taekwondo athlete, GB National Team player, coach of the GB National Squad, and current coach of the USAT Nationals Team. \nGreen was born in Manchester, England.  After successfully trialling and being selected for the GB National Team, he fought in the 2004 Athens Olympics. Green is now a USA Taekwondo National Team coach.Green coached the 2012 and 2016 Olympic Gold and World Champion Gold 2015 and 2017.", "link_mentions": [{"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Paul Green"]}, {"page": "Paul Green", "response": ["Paul Green may refer to:", "* Paul Green (musician) (born 1972), founder of the Paul Green School of Rock Music", "* Paul Green (playwright) (1894–1981), American playwright ", "* Paul Green (rugby league) (born 1972), Australian rugby league footballer", "* Paul Green (Australian politician) (born 1966), Mayor of Shoalhaven City Council and member of the Legislative Council of New South Wales", "* Paul Green (footballer, born 1983), Irish footballer", "* Paul Green (footballer, born 1987), English footballer", "* Paul Green (engineer) (1924–2018), American electrical engineer", "* Paul Green (taekwondo) (born 1977), GB Taekwondo National Team coach and former Olympic taekwondo athlete", "* Paul Green (American football) (born 1966), American football player", "* Paul Green (cricketer) (born 1976), former English cricketer", "* Paul Greene (disambiguation)"]}, {"page": "Paul Green (taekwondo athlete)", "response": ["#REDIRECT Paul Green (taekwondo)"]}, {"page": "Nguyễn Quốc Huân", "response": ["Nguyen qualified for the Vietnamese squad in the men's flyweight class (58 kg) at the 2004 Summer Olympics in Athens, by granting a berth and placing fifth from the Asian Olympic Qualifying Tournament in Bangkok, Thailand. Nguyen edged past Russia's Seyfula Magomedov in his opening match 12–10, and then yielded a startling 4–2 victory over his British opponent Paul Green in the quarterfinals. Fighting against his Mexico's Óscar Salazar in the semifinals, Nguyen had collected a knee injury which his Mexican opponent ruthlessly exploited and ended the match in a painful 0–8 defeat. In the repechage, Nguyen slipped his chance for Vietnam's first Olympic medal at these Games after he was cautiously beaten by Spain's Juan Antonio Ramos 0–8 in his first playoff, relegating Nguyen to fifth."]}, {"page": "Satriyo Rahadhani", "response": ["Rahadhani qualified for the Indonesian squad in the men's flyweight class (58 kg) at the 2004 Summer Olympics in Athens, by granting a berth and placing fifth from the Asian Olympic Qualifying Tournament in Bangkok, Thailand. Rahadhani crashed out in a tight 5–6 defeat to British taekwondo fighter and 2003 World silver medalist Paul Green in the opening round. With Green losing the quarterfinals to Vietnam's Nguyen Quoc Huan, Rahadhani denied his chance to compete for an Olympic bronze medal in the repechage."]}, {"page": "Seyfula Magomedov", "response": ["Magomedov qualified for the Russian squad in the men's flyweight class (58 kg) at the 2004 Summer Olympics in Athens. Earlier in the process, he boosted a gold-medal victory over Great Britain's Paul Green to secure his place on the Russian team from the European Olympic Qualifying Tournament in Baku, Azerbaijan, before his British rival sought revenge on him to a vicious defeat at the European Championships in Lillehammer, Norway a few months later. Magomedov missed his chance to reinstate another glory over Green for the quarterfinal match, after crashing out in a disgraceful 10–12 defeat to Vietnam's Nguyễn Quốc Huân in the opening round. With his Vietnamese opponent losing the semifinals to Mexico's Óscar Salazar, Magomedov shortened his hopes to aim for Russia's first Olympic taekwondo medal in the repechage."]}]}}