{"wiki_id": "http://www.wikidata.org/entity/Q7153501", "itemLabel": "Paul Scott", "itemDescription": "Footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Scott_(footballer,_born_1979)", "wikipedia_page": {"main": "Paul Scott (born 5 November 1979, in Wakefield) is an English professional footballer who now plays for Wakefield City FC.", "link_mentions": [{"page": "Stephen Dawson", "response": ["In the 2009–10 season, Manager Knill expected Dawson to emulate and improve on his second season at Bury. However, in a 1–0 loss against Cheltenham Town on 12 September 2009, Dawson was at fault when he gave away the ball, leading opposition player Barry Hayles, who scored the winning and only goal for the side. After the match, Dawson made an apology to Bury's supporters for his role. Despite this, Dawson managed to fend off his mistake and scored his first goal of the season on 29 September 2009, in a 3–2 win over Crewe Alexandra. Three weeks later, on 17 October 2009, he scored again, in a 3–2 win over Aldershot Town. His third goal then came on 14 November 2009, in a 3–3 draw against Notts County. Dawson continuously formed a central midfield partnership with Barry-Murphy. By December, he was offered a new contract by the club. However, he turned down a new contract, citing his ambitions to play in the higher division. Despite this, Manager Knill said Dawson remained the key player for the side. It wasn't until on 17 January 2010 when Dawson scored again, in a 2–1 win over Bournemouth. At some point to the season, he was appointed captain at Bury, succeeding Paul Scott and previously captained the side the previous season. Since the start of the season, Dawson played in every match until he was sidelined over personal reason in March 2010, missing one league match against Macclesfield Town. Despite this, Dawson went on to finish his second season, making the total of 47 appearances and scoring 4 times in all competitions. At the end of the 2009–10 season, Dawson was again awarded the club's Player of the Year and was voted into the PFA League Two Team of The Year for the 2009–10 season at the PFA awards."]}, {"page": "Steve Haslam", "response": ["After almost 100 games for Halifax, it was announced on 18 June 2007 that Steve had made a return to the football league by signing a two-year deal with Bury. His first goal for the club was a 30-yard shot against Notts County on 13 October 2007. Although he had a sustained run in the side towards the end of 2008–09 season due to injury to Paul Scott, his contract was not renewed at the end of the season."]}, {"page": "2003–04 Huddersfield Town A.F.C. season", "response": ["|17||Paul Scott||||DF||16 (3)||2||1||0||1||0||1||0||0 (1)||0||19 (4)||2"]}, {"page": "2002–03 Huddersfield Town A.F.C. season", "response": ["|28||Paul Scott||||DF||2 (11)||0||0||0||0 (1)||0||0||0||2 (12)||0"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Paul Scott||||2002–2004||18 (14)||2||1||0||1 (1)||0||1||0||0 (1)||0||21 (16)||2"]}, {"page": "Paul Scott", "response": ["Paul Scott may refer to:", "*Paul Scott (novelist) (1920–1978), English novelist, playwright, and poet", "*Paul Scott (comics), English comic book writer", "*Paul Scott (cricketer) (born 1962), English cricketer", "*Paul Scott (footballer, born 1979), English football player for Huddersfield, Bury and Morecambe", "*Paul Scott (footballer, born 1985), English football player for Burnley", "*Paul Scott (poet), British poet", "*Paul Scott (rugby union), South African rugby union player", "*Paul Scott (politician), American state senator from Oklahoma", "*Paul Scott (decathlete) (born 1970), Australian decathlete and competitor at the 1991 World Championships"]}, {"page": "Paul Scott (footballer born 1979)", "response": ["#REDIRECT Paul Scott (footballer, born 1979)"]}]}}