{"wiki_id": "http://www.wikidata.org/entity/Q7154412", "itemLabel": "Paul Wilmott", "itemDescription": "Financial economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Wilmott", "wikipedia_page": {"main": "Paul Wilmott (born 8 November 1959) is an English researcher, consultant and lecturer in quantitative finance. He is best known as the author of various academic and practitioner texts on risk and derivatives, for Wilmott magazine and Wilmott.com, a quantitative finance portal, and for his prescient warnings about the misuse of mathematics in finance.", "link_mentions": [{"page": "Tobin tax", "response": ["The mathematician Paul Wilmott has pointed out that while perhaps some trading ought to be discouraged, trading for the hedging of derivatives is generally considered a good thing in that it can reduce risk, and this should not be punished. He estimates that any financial tax should be at most one basis point so as to have negligible effect on hedging."]}, {"page": "Technical analysis", "response": ["The contrast against quantitative analysis is less clear cut than the distinction with fundamental analysis. Some sources treat technical and qualitative analysis as more or less synonymous. While others draw a sharp distinction. For example, quantitative analysis expert Paul Wilmott suggests technical analysis is little more than 'charting' (making forecasts based on extrapolating graphical representations), and that technical analysis rarely has any predictive power.  "]}, {"page": "Black–Scholes model", "response": ["Espen Gaarder Haug and Nassim Nicholas Taleb argue that the Black–Scholes model merely recasts existing widely used models in terms of practically impossible \"dynamic hedging\" rather than \"risk\", to make them more compatible with mainstream neoclassical economic theory.Espen Gaarder Haug and Nassim Nicholas Taleb (2011). Option Traders Use (very) Sophisticated Heuristics, Never the Black–Scholes–Merton Formula. Journal of Economic Behavior and Organization, Vol. 77, No. 2, 2011 They also assert that Boness in 1964 had already published a formula that is \"actually identical\" to the Black–Scholes call option pricing equation.Boness, A James, 1964, Elements of a theory of stock-option value, Journal of Political Economy, 72, 163–175. Edward Thorp also claims to have guessed the Black–Scholes formula in 1967 but kept it to himself to make money for his investors.A Perspective on Quantitative Finance: Models for Beating the Market, Quantitative Finance Review, 2003. Also see Option Theory Part 1 by Edward Thorpe Emanuel Derman and Nassim Taleb have also criticized dynamic hedging and state that a number of researchers had put forth similar models prior to Black and Scholes.Emanuel Derman and Nassim Taleb (2005). The illusions of dynamic replication , Quantitative Finance, Vol. 5, No. 4, August 2005, 323–326 In response, Paul Wilmott has defended the model.Paul Wilmott (2008): In defence of Black Scholes and Merton , Dynamic hedging and further defence of Black–ScholesSee also: Doriana Ruffinno and Jonathan Treussard (2006).  Derman and Taleb's The Illusions of Dynamic Replication: A Comment, WP2006-019, Boston University - Department of Economics."]}, {"page": "St Catherine's College, Oxford", "response": ["File:Paul Wilmott - Festivaletteratura 2012 01.JPG| Paul Wilmott, English researcher, consultant and lecturer in quantitative finance"]}, {"page": "Economic model", "response": ["It is straightforward to design economic models susceptible to butterfly effects of initial-condition sensitivity.Paul Wilmott on his early research in finance: \"I quickly dropped ... chaos theory [as] it was too easy to construct ‘toy models’ that looked plausible but were useless in practice.\" "]}, {"page": "Nassim Nicholas Taleb", "response": ["Taleb is co-Editor in Chief of the academic journal Risk and Decision Analysis (since September 2014),IOS Press, 2014, News: New Co-Editor-in-Chief Risk and Decision Analysis, at IOS Press (online), September 19, 2014, accessed 7 May 2014. jointly teaches regular courses with Paul Wilmott in London (19th time, March 2015),Nassim Nicholas Taleb's Home Page, Lecture Page, at fooledbyrandomness.com (online), accessed 9 May 2015. and occasionally participates in teaching courses toward the Certificate in Quantitative Finance.\"Certificate in Quantitative Finance - Course Guide,\" at Wilmott, 2008 (online), see , accessed 9 May 2015. He is also co-faculty at the New England Complex Systems Institute."]}, {"page": "Financial modeling", "response": ["Criticism of the discipline (often preceding the financial crisis of 2007–08 by several years) emphasizes the differences between the mathematical and physical sciences, and finance, and the resultant caution to be applied by modelers, and by traders and risk managers using their models. Notable here are Emanuel Derman and Paul Wilmott, authors of the Financial Modelers' Manifesto. Some go further and question whether the mathematical- and statistical modeling techniques usually applied to finance are at all appropriate (see the assumptions made for options and for portfolios). "]}, {"page": "Heath–Jarrow–Morton framework", "response": ["The HJM framework originates from the work of David Heath, Robert A. Jarrow, and Andrew Morton in the late 1980s, especially Bond pricing and the term structure of interest rates: a new methodology (1987) – working paper, Cornell University, and Bond pricing and the term structure of interest rates: a new methodology (1989) – working paper (revised ed.), Cornell University. It has its critics, however, with Paul Wilmott describing it as \"...actually just a big rug for [mistakes] to be swept under\".One math geek's plan to reform Wall Street, Newsweek, May 2009Newsweek 2009"]}, {"page": "Emanuel Derman", "response": ["Derman together with Paul Wilmott wrote the Financial Modelers' Manifesto, a set of principles for doing responsible financial modeling."]}, {"page": "Professional certification in financial services", "response": ["it was founded by Paul Wilmott in 2003, and is conferred by the CQF Institute.CQF Institute, cqfinstitute.org"]}, {"page": "List of quantitative analysts", "response": ["* Paul Wilmott, (born 1959) UK researcher, consultant and lecturer in quantitative finance."]}, {"page": "Wilmott (magazine)", "response": ["The magazine was launched in 1999 in London. The publishers are Wiley Publishing and editor in chief Paul Wilmott. The magazine's target audience is people working with quantitative finance in hedge fund, investment banks, risk management and professional investment management firms.", "*  Portfolio magazine reportage on Wilmott Magazine and Paul Wilmott", "* Interview with Paul Wilmott New York Times"]}, {"page": "Financial Modelers' Manifesto", "response": ["The Financial Modelers' Manifesto was a proposal for more responsibility in risk management and quantitative finance written by financial engineers Emanuel Derman and Paul Wilmott. The manifesto includes a Modelers' Hippocratic Oath. The structure of the Financial Modelers' Manifesto mirrors that of The Communist Manifesto of 1848.", "Paul Wilmott in 2000:The Use, Misuse and Abuse of Mathematics in Finance"]}, {"page": "Caissa Capital", "response": ["Caissa Capital was a hedge fund founded by Jonathan Kinlay in 2002, based on his research on  volatility arbitrage in the late 1990s.  In addition to Kinlay, who was head of research and portfolio management, the management team comprised International Chess Grandmaster Ron Henley as head of trade execution and Paul Wilmott as risk manager. The fund's strategies used models that were developed by Kinlay's research firm Investment Analytics.Investment Analytics  Caissa, which managed $400M in assets for institutional investors such as Bank of America, was ranked by Fimat as the top performing fund in its class in 2004, but closed shortly after Kinlay's departure.Hedge Fund Alert, Aug 4, 2004  "]}, {"page": "Salih Neftçi", "response": ["He arguably is best known for two particularly well-received textbooks on mathematical finance: An Introduction to the Mathematics of Pricing Financial Derivatives and Principles of Financial Engineering.  These books have become standard texts in many financial engineering programs around the world.  One of financial engineering's most eminent and visible practitioners and educators, Paul Wilmott, has written of An Introduction to the Mathematics of Financial Derivatives:Paul Wilmott Introduces Quantitative Finance (Wiley 2001), pp 136."]}, {"page": "Fugit", "response": ["Fugit provides an estimate of when an option would be exercised, which is then a useful indication for the maturity to use when hedging American or Bermudan products with European options.Eric Benhamou: Fugit (options)  Fugit is thus used for the hedging of convertible bonds, equity linked convertible notes, and any putable or callable exotic coupon notes.  Although see Christopher Davenport, Citigroup, 2003. \"Convertible Bonds A Guide\". and Paul Wilmott's comment on a wilmott.com forum : \"But, yes, remember that you need to put the real drift in there otherwise it's just the risk-neutral time and therefore not so relevant.\" for qualifications here. Fugit is also useful in estimating \"the (risk-neutral) expected life of the option\"Mark Rubinstein (1995). \"On the Accounting Valuation of Employee Stock Options \", Journal of Derivatives, Fall 1995  for Employee stock options (note the brackets)."]}, {"page": "Mathematical finance", "response": ["Contemporary practice of mathematical finance has been subjected to criticism from figures within the field notably by Paul Wilmott, and by Nassim Nicholas Taleb, in his book The Black Swan. Taleb claims that the prices of financial assets cannot be characterized by the simple models currently in use, rendering much of current practice at best irrelevant, and, at worst, dangerously misleading. Wilmott and Emanuel Derman published the Financial Modelers' Manifesto in January 2009 which addresses some of the most serious concerns."]}, {"page": "List of alumni of St Catherine's College, Oxford", "response": ["*Paul Wilmott – British mathematician and quantitative analyst"]}, {"page": "Wilmott, Paul", "response": ["#redirectPaul Wilmott"]}]}}