{"wiki_id": "http://www.wikidata.org/entity/Q7154709", "itemLabel": "Paula Jacobs", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Paula_Jacobs", "wikipedia_page": {"main": "Paula Elsa Jacobs (1932 – 26 June 2021) was a British actress whose television and film career spanned four decades.\nBorn in Liverpool in 1932 into a Jewish family, her father was J.P. Jacobs, whose company supplied all the elastic to Marks & Spencer. Jacobs made her first television appearance in Z-Cars in 1962, going on to play roles in Softly, Softly: Taskforce (1972–1975), Shoestring (1979), Hammer House of Horror (1980), Mapp & Lucia (1985), Mrs Biggs in Porterhouse Blue (1987), The New Statesman (1989), Bergerac (1990), Maud Wilberforce in Jeeves and Wooster (1990), Brookside (1992), French and Saunders (1993), Coronation Street (1994), Casualty (1989–1995), Drop the Dead Donkey (1994–1998), Dalziel and Pascoe (2000), Midsomer Murders (2002), Agatha Christie's Poirot (2004) and Doctors (2008).Her film appearances include Birth of the Beatles (1979), An American Werewolf in London (1981), She'll Be Wearing Pink Pyjamas (1985), We Think the World of You (1988), Duel of Hearts (1991), The Remains of the Day (1993) and Tea with Mussolini (1999).In 1953 in her native Liverpool she married the actor David Swift who on graduating from Cambridge worked for her father's company. She was the mother of actress Julia Swift and the mother-in-law of actor David Bamber. She and her late husband were trustees of the J P Jacobs Charitable Trust, set up in memory of her father.Jacobs died on 26 June 2021.", "link_mentions": [{"page": "1993 in film", "response": ["| The Remains of the Day || Columbia Pictures || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Anthony Hopkins, Emma Thompson, James Fox, Christopher Reeve, Peter Vaughan, Hugh Grant, John Haycraft, Michael Lonsdale, Jeffry Wickham, Paula Jacobs, Ben Chaplin, Abigail Harrison, Rupert Vansittart, Patrick Godfrey, Peter Halliday, Peter Cellier, Peter Eyre, Terence Bayler, Tony Aitken, Tim Pigott-Smith, Lena Headey, Paul Copley, Pip Torrens, Brigitte Kahn, Wolf Kahler || Period, Drama || Live action"]}, {"page": "1979 in film", "response": ["| Birth of the Beatles || || Richard Marquand (director); John Kurland, Jacob Eskendar (screenplay); Stephen MacKenna, Rod Culbertson, John Altman, Ray Ashcroft, Ryan Michael, David Nicholas Wilkinson, Brian Jameson, Wendy Morgan, Gary Olsen, Linal Haft, Eileen Kennally, Richard Marner, Alyson Spiro, Nigel Havers, Paula Jacobs || Biography || Live Action"]}, {"page": "Drop the Dead Donkey", "response": ["* Alfred and Bernice Cooper (Geoffrey Hutchings & Paula Jacobs) — Helen's supposedly conservative parents, from whom she spends years concealing her lesbianism – even going to the extent of persuading Dave to impersonate her boyfriend while they visited for an evening. In Series 6, Helen's father dies, with Helen fearing the shock of him reading a letter from her admitting her sexuality will have killed him. But Helen discovers the letter was never sent and, when she comes out to her mother on the day of his funeral, finds out they had suspected she was a lesbian all along and their lives are not quite as conservative as Helen supposed..."]}, {"page": "Tea with Mussolini", "response": ["* Paula Jacobs as Molly"]}, {"page": "Birth of the Beatles", "response": ["*Paula Jacobs as Mrs Flemming"]}, {"page": "David Bamber", "response": ["Bamber is married to the actress Julia Swift, daughter of actors David Swift and Paula Jacobs."]}, {"page": "List of Brookside characters", "response": ["|Joan Daniels || Paula Jacobs || 1992"]}, {"page": "The Assam Garden", "response": ["* Paula Jacobs as Carol"]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Paula Jacobs"]}, {"page": "List of Bergerac cast members", "response": ["*Paula Jacobs"]}, {"page": "Belfry Witches", "response": ["The show followed two witches, Skirty Marm (Laura Sadler) and Old Noshie (Lucy Davis) as they caused mischief in a quiet English village named Tranter's End, which they fled to after being banished their home on Witch Island. The show revolved around the two witches, the friendly of the church whose belfry they are in, Chris Tucker (played by Scott Charles), the resident \"naughty boy\", a nasty woman named Mrs. Bagg-Meanly (played by Paula Jacobs), and the Head Witch who banished Skirty Marm and Old Noshie - Mrs. Abercrombie (Jan Harvey). The show was called 'Belfry Witches' because the two witches lived in a church belfry. The show was axed due to poor ratings."]}, {"page": "List of The Tomorrow People serials", "response": ["| colspan=\"5\" | Guest Cast: Laurence Bouvard (Lucy), Kerry Shale (Wilkie), Christopher Benjamin (Middlemass), John Judd (Les Bishop), Sally Sagoe (Mrs Jackson), Faith Edwards (Annette), Alwyn Taylor (Doctor Roberts), Peter Aubrey (Colin), Paula Jacobs (Betty), Steve Knowles (Salesman), Stuart Fox (Policeman), William Hootkins (Colonel Cobb), Peggy Mount (Mrs Butterworth), Ian McNeice (Quentin D'Arcy), Simon Bendix (Au Pair), Nonie Ken (Tammy), Michael Benz (Vinny), Mac McDonald (Twitch), Anthony Venditti (Beef), Vincent Marzello (Zimmerman), Bob Sessions (TV Reporter), Jonathan Markwood (Policeman) "]}, {"page": "List of Jeeves and Wooster characters", "response": ["* Maud Wilberforce — Paula Jacobs (1)"]}, {"page": "Duel of Hearts", "response": ["* Paula Jacobs ... Landlady"]}, {"page": "Albion Market", "response": ["* Paula Jacobs as Peggy Sagar, cafe manager"]}, {"page": "Screen Two", "response": ["Cast: Tom Wilkinson, Neil Pearson, Diana Kent, Helen Baxendale, Douglas Henshall, James Fleet, Clive Russell, Meera Syal, Jonathan Cullen, James Ellis, Rosemary Martin, Andy Hamilton, Paula Jacobs, Geoffrey Whitehead, Julian Fellowes, Norman Bird and Mark Benton"]}, {"page": "She'll Be Wearing Pink Pyjamas", "response": ["*Paula Jacobs - Doreen "]}, {"page": "Porterhouse Blue (TV series)", "response": ["Porterhouse Blue is a 1987 television comedy series adapted by Malcolm Bradbury from the 1974 Tom Sharpe novel of the same name for Channel 4 in four episodes. It starred David Jason as Skullion, Ian Richardson as Sir Godber Evans, Barbara Jefford as his wife Lady Mary, Charles Gray as Sir Cathcart D'Eath, and John Sessions as Zipser. Also appearing were Griff Rhys Jones as Cornelius Carrington, Paula Jacobs as Mrs. Biggs, Bob Goody as Walter, Paul Rogers as the Dean, John Woodnutt as the Senior Tutor, Lockwood West as the Chaplain, Willoughby Goddard as Professor Siblington, Harold Innocent as the Bursar and Ian Wallace as the Praelector."]}, {"page": "The Purity of the Turf", "response": ["* Maud Wilberforce – Paula Jacobs"]}, {"page": "Deaths in June 2021", "response": ["*Paula Jacobs, 88–89, English actress (Albion Market, An American Werewolf in London, The Remains of the Day).Births, marriages and deaths: June 2, 2021 "]}]}}