{"wiki_id": "http://www.wikidata.org/entity/Q7150761", "itemLabel": "Paul Futcher", "itemDescription": "Footballer and manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Futcher", "wikipedia_page": {"main": "Paul Futcher (25 September 1956 – 23 November 2016) was an English professional footballer who had a distinguished career as a defender in the English Football League, for England under 21s and as manager of several non-league clubs.\nHe is regarded as a club legend by Grimsby Town who signed him at the age of 35 when he was apparently past his best. He went on to be described as one of the club's greatest ever players. Prior to his time with Grimsby he had enjoyed lengthy spells with Luton Town, Oldham Athletic and Barnsley as well as playing for Chester, \nManchester City, Derby County and Halifax Town. After leaving Grimsby in 1994 he played for Dundalk before moving into management.", "link_mentions": [{"page": "November 24", "response": ["*2016 – Paul Futcher, English footballer (b. 1956)"]}, {"page": "Barnsley F.C.", "response": ["|1985|| Paul Futcher", "|1989|| Paul Futcher"]}, {"page": "List of twins", "response": ["* Ron Futcher and Paul Futcher (1956–)"]}, {"page": "Grimsby Town F.C.", "response": ["1987–88 saw Grimsby Town suffer a second consecutive relegation, placing them in the Fourth Division. The club's financial situation was also dismal, and as the 1988–89 season began, the task at Grimsby was to avoid relegation to the Football Conference, avoid expulsion from the FA and avoid going out of business completely. This was achieved, finishing 9th. Following the resignation of Dave Booth in 1986 (to pursue outside business interests) the club had two managers in two years (Mick Lyons and Bobby Roberts). Alan Buckley was appointed after the 1988 relegation and by 1991 had led the club to two successive promotions with the chairman at that time being Peter Furneaux. Grimsby were to remain in football's second flight for six years. Buckley's crop of players consisting of some of the most popular and biggest cult heroes in the club's history; players such as Shaun Cunnington, Keith Alexander, Mark Lever, Dave Gilbert, Steve Livingstone, Paul Futcher, Paul Groves and Clive Mendonca made the club a solid second-tier side (the Second Division became Division One in 1992 upon the creation of the Premier League from the old First Division). In 1992–93, Grimsby finished 9th in the new Division One, and until well into April they were in the hunt for a play-off place that would have given them the chance of a third promotion in four years. They dipped to 16th place a year later, though they were never in any real danger of relegation.", "|1992|| Paul Futcher || John McDermott", "|1993|| Paul Futcher || Gary Croft"]}, {"page": "Southport F.C.", "response": ["*Paul Futcher – England U21 player; Took Southport to 1997/98 FA Trophy Final at Wembley"]}, {"page": "Skelmersdale United F.C.", "response": ["* Paul Futcher – Chester City & Manchester City"]}]}}