{"wiki_id": "http://www.wikidata.org/entity/Q7153334", "itemLabel": "Paul Ross", "itemDescription": "English television and radio presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Ross", "wikipedia_page": {"main": "Paul Ross (born 31 December 1956) is an English television and radio presenter, journalist and media personality.\nHe is the son of Martha Ross and the elder brother of Jonathan Ross.", "link_mentions": [{"page": "Cockney", "response": ["*Paul Ross, television and radio presenter, born in Romford, raised in Leytonstone"]}, {"page": "Jonathan Ross", "response": ["Jonathan Stephen Ross was born on 17 November 1960 in St Pancras, North London and raised in Leytonstone, East London. The son of John and actress Martha Ross, he has four brothers and one sister. He is the younger brother of journalist, television editor, and media personality Paul Ross."]}, {"page": "Leytonstone", "response": ["*Paul Ross (born 1956), broadcaster"]}, {"page": "Marlow, Buckinghamshire", "response": ["*Television and radio presenter Paul Ross, brother of Jonathan Ross, also lived in Marlow, having moved there after filming Celebrity Fit Club at nearby Bisham Abbey. He moved out of Marlow in 2013."]}, {"page": "BBC London", "response": ["The current Breakfast show presenters are Penny Smith and Paul Ross and the mid morning phone-in show is presented by Vanessa Feltz. The Breakfast and Drivetime shows feature a wealth of local London news and comment with roving reporters out and about. Other programmes such as JoAnne Good or Robert Elms include varied speech and music with local news bulletins every half-hour. "]}, {"page": "Andy Fordham", "response": ["After the incident Fordham visited a doctor, and following medical tests he was informed that, as a result of long term alcohol damage, his liver was operating at only 25% capacity. He was advised to stop drinking alcohol immediately. Fordham's health had long been a concern; at one point he weighed  and was in the habit of regularly consuming 24 bottles of lager before going on stage to play darts. He admitted to the media that he had felt more comfortable playing when not fully sober. The doctors' advice led Fordham to seek help and assistance via the television programme Celebrity Fit Club, where he became friends with the journalist and TV presenter Paul Ross."]}, {"page": "Talksport", "response": ["A year later Talk Radio launched a new breakfast show presented by Paul Ross and Carol McGiffin. Former BBC Radio 1 DJ Simon Bates also joined the station, along with James Whale, Ian Collins, and Mike Dickin."]}, {"page": "Danny Baker", "response": ["Baker's first mainstream break was as roving reporter-presenter on the Michael Aspel LWT regional magazine The Six O'Clock Show alongside former Mastermind winner and former London black cab driver Fred Housego. Paul Ross (brother of Jonathan Ross whom Baker had as his best man) was his researcher. During his stint on The Six O'Clock Show, Baker was filmed having an altercation with a British Rail press officer. This clip is often resurrected for clip shows and can be seen on YouTube."]}, {"page": "Bid Shopping", "response": ["The channel was aimed at families, showing classic and rare black & white British films such as Love in Pawn and the Frankie Howerd bequest comedy A Touch of the Sun. Films on the channel were introduced by film critic Paul Ross. As an interlude, or at the start of the broadcast day, there were showings of a film magazine programme called Sprockets (not to be confused with the SNL sketches with Mike Myers).", "The channel was aimed at a young adult audience, showing a variety of cinematic \"turkeys\", though some of the content was increasingly from matinee movies, especially after 5am. Films included Tomboy starring Betsy Russell, Glen and Randa, Plan 9 from Outer Space and Revenge of the Cheerleaders starring David Hasselhoff. The channel also featured introductions by Paul Ross and episodes of Sprockets."]}, {"page": "BBC Southern Counties Radio", "response": ["*Paul Ross"]}, {"page": "The Big Breakfast", "response": ["As part of his contract with The Big Breakfast, Evans was committed to developing a new show for Channel 4. Don't Forget Your Toothbrush began in early 1994, and Evans cut his involvement with The Big Breakfast to three days a week, Tuesday to Thursday. Former Neighbours actor Mark Little replaced Evans on Mondays and Fridays. When Evans left the show later that year, Little continued Thursdays, and Fridays while Paul Ross took over Mondays to Wednesdays. Richard Orford replaced Ross around Easter 1995 but was quickly dropped and exchanged with Down Your Doorstep presenter Keith Chegwin. In July 1995, the show reverted to using just one male presenter (Mark Little) throughout the week. Chegwin would cover for Little when he was on tour as a comedian or on holiday.", "Mark Lamarr, Keith Chegwin, Paul Ross, Richard Orford, Richard Bacon and Mike McClean were \"down your doorstep\" outside broadcasters, often turning up live and unannounced at an unsuspecting viewer's house, while rooms within the Lock Keeper's Houses featured the puppets Zig and Zag and video games guru Ben the Boffin.", "* Paul Ross (1994–95)"]}, {"page": "Gaby Roslin", "response": ["Roslin frequently appeared on the ITV lifestyle programme This Morning as a newspaper reviewer, often starring with her former radio co-host Paul Ross.", "Roslin sat in for Alan Carr on BBC Radio 2 on 15 and 22 August 2009 with Patrick Kielty and joined Carr to present a Christmas edition of his show on 24 December 2009. She was also a regular stand-in for BBC London 94.9, covering on occasions for Vanessa Feltz and JoAnne Good. On 11 January 2010, Roslin permanently replaced Good as co-host (with Paul Ross) of the BBC London 94.9 breakfast show and remained until January 2013. She was given her own weekly Saturday show, live from noon until 2:00 pm, in January 2013. A year later, she was moved to an extended Sunday afternoon show. In October 2021 Roslin sat in for Chris Evans on the 'Chris Evans Breakfast Show' on Virgin Radio UK, along side Ricky Wilson (of the Kaiser Chiefs)."]}, {"page": "Linda Lusardi", "response": ["In January 2008, Lusardi joined ITV's Dancing on Ice, finishing in sixth place. Her professional skating partner was Daniel Whiston, who temporarily moved into her family home to make training more convenient. Lusardi had to catch up with her fellow skaters after falling and breaking a bone in her foot during her first hour on the ice. She also won the Channel 4 show Celebrity Come Dine With Me in 2008. In the show, she was voted the best dinner host by her fellow contestants Abi Titmuss, Rodney Marsh, Lesley Joseph and Paul Ross. Lusardi participated in the 2011 series of Celebrity Masterchef, where she reached the final five. In December 2020 she took part in The Real Full Monty On Ice for charity."]}, {"page": "The Word (TV series)", "response": ["Paul Ross was the series editor on series 3 and 4, and became executive producer for series 5. Jo Whiley worked as a researcher/band booker on series 2 and half of series 3 and is credited as having given Nirvana their historic and notorious first TV appearance."]}, {"page": "Wendi Peters", "response": ["In 2001, Peters played Pamela Jolly in the ITV series Bad Girls for two episodes. In 2009, Peters was a finalist on Celebrity Masterchef. Her love of baking and cooking has led her to appearances on many cookery programmes including Market Kitchen, Christmas Cooks, This Morning, and  The F Word in 2008 with chef Gordon Ramsay. In 2006, Peters appeared on BBC's Celebrity Mastermind where she finished runner up to Paul Ross. She also appeared on Celebrity Who Wants To Be A Millionaire? with Jamie Theakston. In December 2006, Peters spent a week with resident lexicographer, Susie Dent, in Dictionary Corner on Countdown."]}, {"page": "Abi Titmuss", "response": ["She starred on a celebrity edition of Channel 4's Come Dine with Me with Paul Ross, Lesley Joseph, Linda Lusardi and Rodney Marsh."]}, {"page": "Celebrity Fit Club", "response": ["*Paul Ross (team captain) (presenter and brother of Jonathan Ross) – lost 2 stone 1 pound ()", "The fourth UK series began on 10 January 2006.  In this series, former Fit Club contestants joined the judging panel, with a different ex-contestant appearing each week: so far, they have included Amy Lamé, Aldo Zilli, Jonathan \"Jono\" Coleman, Paul Ross, Alison Hammond, James Whitaker, Lowri Turner, Ann Widdecombe and Kym Mazelle. Also this year the final episode is a 90-minute mini-Olympic event in Sheffield, where Channel 4's The Games takes place, with past celebrities joining the two teams. The celebrities taking part are:", "*Paul Ross – ", "*Paul Ross –  (largest ever gain)"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Paul Ross", "|Paul Ross", "|Paul Ross"]}, {"page": "London Gay Men's Chorus", "response": ["The choir has made many TV appearances and radio broadcasts including Top of the Pops, So Graham Norton, Loose Ends, Ruby Wax Christmas special, London Tonight, the Paul Ross weekend breakfast show on LBC, and Comic Relief, and has sung and performed with stars including Sir Elton John, The Human League, Heather Small, Damien Hirst, Simon Callow, Alison Jiear, Jocelyn Brown, Toyah Willcox, k.d. lang, Rula Lenska, Sandi Toksvig, Dame Cleo Laine, Mark Ronson and The Pet Shop Boys."]}, {"page": "Britain's Worst Celebrity Driver", "response": ["*Paul Ross (TV Presenter And Film Critic)"]}, {"page": "Granada Talk TV", "response": ["The channel is perhaps best known for helping launch the careers of Sacha Baron Cohen (presenter of anarchic children's show F2F), Natasha Kaplinsky (co-presenter of the Paul Ross Show) and Graham Norton (regular guest presenter on F2F)."]}, {"page": "Za Gaman", "response": ["Short segments of the program were used in the British television shows, which humorously examined television programs from around the world. Following Clive James on Television, clips from the now-defunct show were also used in the 1990s in Tarrant on TV. A very short-lived British version of the show was also created, hosted by Paul Ross, but it did not feature the extreme conditions of the original program. Only two series of the British version were produced for Challenge TV, which first aired from 1997 to 1998, and it saw little success.", "The short-lived British version of the show ran for two series (airing from 1997 to 1998) and was hosted by Paul Ross from a 'Japanese-styled' studio with 'Japanese' assistants Hoki and Koki (actually actors Peter Cocks and Stephen Taylor Woodrow, from TVS children's show What's Up Doc?, in yellowface). In series two, Tara O'Connor replaced Olivia Stranger as the host (the 'Gong Banger'), while Chris Sievey (previously seen as Frank Sidebottom on the TVS shows No. 73, Motormouth, and What's Up Doc?) joined as a 'Gimp man' character."]}]}}