{"wiki_id": "http://www.wikidata.org/entity/Q7151543", "itemLabel": "Paul James", "itemDescription": "British basketball player", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_James_(basketball)", "wikipedia_page": {"main": "Paul Julian James (born 11 September 1964) is a former professional basketball player and current head coach of the British Basketball League (BBL) team Plymouth City Patriots.\nBorn in Leicester, England, James' career in basketball started out as a player for his hometown team Leicester All-Stars. He made his league debut on 26 September 1981, just weeks after his 17th birthday, against local rivals Nottingham. He enjoyed seven successful years at the All-Stars (now known as Riders) before moving south to sign for Bracknell Tigers in 1988.After nine years as a player, James was then promoted head coach of the Tigers in 1997, a position he retained until 2005 when the franchise was pulled from the league. However, he was soon offered the coaching position of Guildford Heat, a club established by fans of the former Tigers to take their place in the BBL. In just two seasons, James led the new franchise to fifth place in their rookie season and a League and Cup double in 2007, an achievement for the club, for which he was awarded BBL Coach of the Year 2007. The proceeding season saw James lead the Heat into its first European adventure, competing in the ULEB Cup, however a disappointing campaign finished 0-10 in a Group that contained the likes of DKV Joventut, Alba Berlin and BC Šiauliai.\nThe 2008-2009 season was one of financial struggle for Guildford, and as a cost-cutting measure confirmed that James's contract would not be renewed at the end of the season. Thus leading to the appointment of Chad McKnight, a former player under James at the Heat, as the new player/coach of the Guildford team.\nOn 7 December 2009 it was announced that James was appointed as the new head coach of Worcester Wolves following the resignation of Chuck Evans.On 29 January 2010 it was announced that James was appointed as head coach of the England men's team.On 10 August 2021, it was announced that James was appointed as inaugural head coach of the Plymouth City Patriots a new franchise for the 2021–22 BBL season.", "link_mentions": [{"page": "Plymouth Raiders", "response": ["|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James"]}, {"page": "Surrey Scorchers", "response": ["The arrival of American swingman Daniel Gilbert from Germany was a major coup for the Heat during the summer of 2006, proving playcaller Paul James still has great ability in spotting stars of the future. Guildford kick-started the season with a close away victory against the Scottish Rocks, 95–91, starting a three-game winning streak in the Championship. Heat also qualified for their first-ever cup final appearance after defeating the Sheffield Sharks 87-81 in the Semi-final of the BBL Cup.", "first League title in the franchise's history at just the second time of asking. The following week the Heat once again played host to London United in the BBL Play-off Quarter-final, with a place at the Finals Weekend up for grabs. The Heat managed to win the match 71–68 but in the Semi-final, they were defeated 71–78 by the Scottish Rocks, despite being the top seed. For the incredible rise to success, Coach Paul James was awarded by his peers as the Coach of the Season for 2006-07.", "Domestically, the team maintained a strong assault in the league, hovering near the top of the table for much of the winter period, although they failed in their defence of the BBL Cup at the hands of the Milton Keynes Lions, going down 80-91 in the Semi-final. Coach Paul James let go disappointing centre, Carlton Aaron, and brought in the experienced point-guard E.J. Harrison for Brian Dux, replacing Aaron with Ajou Deng, brother of the Chicago Bulls and Team GB star, Luol Deng.", "Just days after securing a place in the Play-offs, with a 74–65 win at home against the Milton Keynes Lions, club Managing Director Alan McClafferty announced that coach Paul James would not have his contract renewed at the end of the season. The Heat finished the regular season in 4th place with a 21-12 record, qualifying for the Play-off Quarter-final with home court advantage. Drawn against the Plymouth Raiders, which marked the eighth time the two teams had met that season, the Heat suffered a disappointing end to the season, going down 81-89. A lone high-note was that American Keonta Howell was voted into the BBL All-Star first team after coming 3rd in the voting for the MVP award.", "After Paul James’ departure as coach of the first team, the club quickly appointed Chad McKnight as player/coach on 8 July and subsequently brought back Mike Davies as General Manager. The fans were also pleased when the Heat announced that Captain Mike Martin was back and had signed a three-year contract to play for the Heat. However, other players decided to seek their fortunes elsewhere. Heat stalwart Dean Williams went to the Essex Pirates, where he was joined by Alan Metcafle, while point-guard EJ Harrison joined the Milton Keynes Lions. With back-up point-guard and long-time Heat player, Jon May, joining the EBL outfit Reading Rockets, Chad McKnight had a rebuilding job on his hands.", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|align=\"left\"|  Paul James || 2005 || 2009 || 94 || 48 || 5 || 3 ||"]}, {"page": "Worcester Wolves", "response": ["However, the franchise was thrown into turmoil when, on 27 November, it was announced that six players were having their contracts terminated by the club following an unauthorised strike over racially orientated comments made by Head Coach Chuck Evans during a video analysis session. This sent the basketball community of Worcester into an uproar; the story receiving more comments than any other Worcester News story in 2009. Coach Evans ultimately handed in his resignation. Although their names were first kept confidential, the players were later identified as Randy George, Chey Christie, and Lithuanians Evaldas Zabas, Vidmantas Uzkuraitis and Nerijus Karlikanovas, with former player/coach Skouson Harker facing disciplinary action that ultimately led to his departure from the club. Harker's father wrote this letter of support for his son to the Worcester News. Due to the depletion of the roster, a weakened team including several second-team promotees lost heavily 111–59 away to Glasgow Rocks two days later. On 1 December, the BBL announced in a statement on its website that it had agreed to the postponement of Wolves’ next five games until later dates, plus in accordance with the league’s rules, the franchise had been fined an undisclosed amount. The following week the club announced the appointment of former Guildford, Thames Valley Tigers and England national team coach Paul James as Chuck Evans' successor.", "|style=\"text-align:center;\"|Chuck Evans  Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James", "|style=\"text-align:center;\"|Paul James"]}, {"page": "2006–07 British Basketball League season", "response": ["| style=\"text-align:center\"|December||  Paul James (Guildford Heat) ||  Jazwyn Cowan (Chester Jets)", "* Coach of the Year: Paul James (Guildford Heat)"]}, {"page": "Todd Cetnar", "response": ["In 2003, he returned to England, where he signed for Sutton Pumas. His incredible form, achieving an average of around 30 points per game, did not go unnoticed. and on December 17, 2003, Thames Valley Tigers coach Paul James signed Cetnar as a replacement for the injured Nick Moore in the BBL.Thames Valley Tigers story on BBC"]}, {"page": "Skouson Harker", "response": ["Harker's two-year stint as Head Coach at the Wolves has been said to have saved the Wolves from relegation back down to England's 2nd Division.  Additionally Harker's tenor may have put the club in a position to hire current England National Team Head Coach Paul James, as well a move forward with the new Worcester Arena.  Without the conviction and principle of which the sacked Wolves players demonstrated, the club would have never been in a position to hire Coach James."]}, {"page": "Daniel Gilbert (basketball)", "response": ["For the 2006-07 season, Gilbert made the move to England, where he signed for Paul James's Guildford Heat side, who were only in their second year of existence. A major coup for the side, Gilbert became a pivotal player in leading the club to its first ever BBL title. He averaged an impressive 16.9 points in 33.9 minutes per game."]}, {"page": "Paul James", "response": ["Paul James may refer to:", "* Paul James (academic) (born 1958), professor and writer on globalization and social theory", "* Paul James (actor), American actor", "* Paul James (basketball) (born 1964), British professional basketball player and coach", "* Paul James (Canadian musician) (born 1951), blues guitarist", "* Paul James (gardener), host of American television program Gardening by the Yard", "* Paul James (rugby union) (born 1982), Wales international rugby union player", "* Paul James (soccer) (born 1963), Canadian association football (soccer) player and coach", "* Paul James (sportscaster) (1931–2018), American sports announcer", "* Paul James, a pen name used by American banker James Warburg (1896–1969) when writing songs with his wife, Kay Swift", "* Paul James, British writer; creator of the comedy character Constance, Lady Crabtree"]}, {"page": "BBL Coach of the Year Award", "response": ["|style=\"text-align:center\"|2006–07|| Paul James || Guildford Heat"]}, {"page": "2009–10 British Basketball League season", "response": ["* Paul James marked his return to the League in December when he was appointed as Coach of the new-look Worcester Wolves, succeeding Chuck Evans."]}, {"page": "List of British Basketball League seasons", "response": ["||2006–07||Guildford Heat||Newcastle Eagles||Guildford Heat||Plymouth Raiders||Jeff Bonds (Sheffield Sharks) and Brian Dux (Guildford Heat)||Paul James (Guildford Heat)"]}, {"page": "2012–13 British Basketball League season", "response": ["|style=\"text-align:center\"|February||  Paul James (Worcester Wolves)  ||   Kareem Maddox (Newcastle Eagles)"]}, {"page": "2013–14 British Basketball League season", "response": ["|style=\"text-align:center\"|October||  Paul James (Worcester Wolves) ||  Will Creekmore (Worcester Wolves)", "|style=\"text-align:center\"|February||  Paul James (Worcester Wolves)  ||   Victor Moses (Cheshire Phoenix)"]}, {"page": "2016–17 British Basketball League season", "response": ["|style=\"text-align:center\"|January||   Paul James (Worcester Wolves)  ||  Anton Grady (Plymouth Raiders)", "|style=\"text-align:center\"|March||   Paul James (Worcester Wolves)  ||   Jermel Kennedy (Worcester Wolves)"]}, {"page": "Alex Owumi", "response": ["During Owumi's hiatus from basketball, his family encouraged him to return to the game, as it was his primary passion. Stanley Ocitti and Sherrad Prezzie-Blue, players who already knew Owumi, suggested that Paul James, head coach of the Worcester Wolves of the British Basketball League (BBL), look into signing him. In the summer of 2012, the Wolves signed Owumi, who joined Prezzie-Blue in the back court. James said, \"[Owumi] distributes the ball well and will give us multiple options both on offense and defense.\" The coach also described Owumi as a \"tough-nosed player\". He had an immediate impact, recording a team-high 24 points, 5 rebounds, and 3 assists in his debut against the Durham Wildcats on September 22, 2012. He had another strong showing on January 25, 2013, when he put up 30 points in a loss to the Surrey Scorchers. On February 8, he led Worcester to an upset win over the Newcastle Eagles in a BBL Trophy quarterfinal with a season-high 34 points and 9 rebounds. Owumi posted a double-double of 30 points, 16 of which were free throws, and ten rebounds in a loss to the Manchester Giants on March 23. Through the BBL Championship and Play-offs, Owumi averaged 19.4 points, 6.6 rebounds, 3.9 assists, and 1.2 steals. He was named to the BBL Team of the Week First Team on six occasions during the season. He also garnered all-league honorable mention and all-defensive honorable mention honors."]}, {"page": "2017–18 British Basketball League season", "response": ["|  Paul James"]}, {"page": "2018–19 British Basketball League season", "response": ["|  Paul James", "|  Paul James", "|  Paul James"]}, {"page": "2019–20 British Basketball League season", "response": ["|  Paul James"]}, {"page": "2020–21 British Basketball League season", "response": ["|  Paul James"]}, {"page": "2021–22 British Basketball League season", "response": ["|  Paul James", "|  Paul James"]}, {"page": "Plymouth City Patriots", "response": ["On 10 August 2021, it was announced by the Patriots that Paul James was appointed as inaugural head coach.", "|style=\"text-align:center;\"|Paul James"]}]}}