{"wiki_id": "http://www.wikidata.org/entity/Q7154258", "itemLabel": "Paul Watson", "itemDescription": "English footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Watson_(footballer,_born_1975)", "wikipedia_page": {"main": "Paul Douglas Watson (born 4 January 1975) is an English former footballer.\nDuring his career, Watson played for Gillingham, Fulham, Brentford, Coventry City and most notably for Brighton & Hove Albion before dropping into non-League football and playing for Woking, Rushden & Diamonds, Crawley Town and finally Bognor Regis Town.\nAfter retiring from football, Watson studied a part-time course at Brunel University in physiotherapy.  He was appointed as Brighton & Hove Albion's assistant physiotherapist on 11 June 2009.  He was appointed Head of First Team Physiotherapy in 2017.  He was appointed head of Sheffield United's medical team at the start of the 2017–18 season where, after gaining promotion to the Premier League in 2018-19, in their first season they shared the best injury record in the league with Wolverhampton Wanderers. He subsequently added an MSc in Sports Physiotherapy to his CV from Bath University. At the end of the 2020-21 season he left Sheffield United to start work in private practice back in his home county of Sussex. He currently works for SIXPHYSIO in Lindfield.", "link_mentions": [{"page": "January 4", "response": ["*  1975   – Paul Watson, English footballer and physiotherapist"]}, {"page": "Paul Watson (disambiguation)", "response": ["Paul Watson (born 1950) is a Canadian environmental activist, ship's skipper, and founder of the Sea Shepherd Conservation Society.", "Paul Watson may also refer to:", "* Paul Watson (basketball) (born 1994) American basketball player", "* Paul Watson (cyclist) (born 1962), former professional English road racing cyclist", "* Paul Watson (documentary filmmaker) (born 1942), English film-maker", "* Paul Watson (footballer, born 1975), English football player", "* Paul Watson (footballer, born 1990), Scottish football player", "* Paul Watson (football manager) (born 1984), British sports journalist and expatriate football coach", "* Paul Watson (journalist) (born 1959), Canadian photojournalist and author", "* Paul Watson (musician) (born 1952), American cornetist and songwriter"]}, {"page": "2005–06 Coventry City F.C. season", "response": ["| Paul Watson || Brighton and Hove Albion || 16 September 2005 || Free", "| Paul Watson || Woking || 24 November 2005 || Free"]}, {"page": "2005–06 FA Trophy", "response": ["|DF ||?|| Paul Watson ||  || "]}, {"page": "2001 Football League Trophy Final", "response": ["Brentford eased to victory over Second Division strugglers Oxford United in the first round at Griffin Park, with Jay Lovett scoring his first Football League goal with a header from Michael Dobson's ninth minute cross; Scott Partridge bagged a brace and despite Steve Anthrobus pulling one back for Oxford, Scott Marshall wrapped up the scoring with Brentford's fourth goal of a 4–1 victory. Eventual Third Division champions Brighton & Hove Albion would prove to be a much sterner test in the second round, although the venue was changed from the Withdean Stadium to Griffin Park. Brighton's Bobby Zamora provided an assist for Paul Brooker's opener before doubling the home side's advantage himself; Brentford came back though, Marshall halving the deficit on the 35th-minute, before their cause was aided by a red card for former Brentford defender Danny Cullip early in the second half. \"Bees\" striker Mark McCammon equalised with 12 minutes to go and no golden goal was scored in extra-time, leaving the game to be decided with a penalty shootout; it was a night where errors from ex-Brentford players cost Brighton, with Darren Freeman and Paul Watson both missing their penalties to allow Brentford to win the shootout 3–2."]}, {"page": "1997–98 Fulham F.C. season", "response": ["| Paul Watson"]}, {"page": "Paul Watson (footballer born 1975)", "response": ["#REDIRECT Paul Watson (footballer, born 1975)"]}, {"page": "1999–2000 Brentford F.C. season", "response": ["Brentford entered the 1999–2000 Second Division season with the bulk of the squad which finished the 1998–99 season as Third Division champions. Four fringe players were released and the trio of Darren Freeman, Charlie Oatway and Paul Watson were sold to Brighton & Hove Albion for a combined £30,000 fee. Just four players were brought in – three youngsters on free transfers (Richard Kennedy, Stephen Jenkins and David Theobald) and another youngster on a season-long loan, Southampton's Phil Warner.", "| Paul Watson"]}, {"page": "1997–98 Brentford F.C. season", "response": ["|Paul Watson", "| style=\"text-align:left;\"|Paul Watson", "| style=\"text-align:left;\" |Paul Watson||7", "| Paul Watson", "| Paul Watson"]}, {"page": "1998–99 Brentford F.C. season", "response": ["|Paul Watson", "| style=\"text-align:left;\"|Paul Watson", "| style=\"text-align:left;\" |Paul Watson"]}, {"page": "1994–95 Gillingham F.C. season", "response": ["In addition to the Football League, Gillingham also competed in three knock-out competitions.  The team reached the third round of the FA Cup, at which stage they lost to Sheffield Wednesday of the FA Premier League, and the second round of the Football League Trophy, but were eliminated at the earliest stage of the Football League Cup.  The team played a total of 50 competitive matches, winning 12, drawing 12, and losing 26.  Chris Pike was the team's leading goalscorer with 18 goals. Paul Watson made the most appearances for the team, playing 47 times.  The highest attendance recorded at the club's home ground, Priestfield Stadium, was 10,425, for the FA Cup game against Sheffield Wednesday.  The lowest attendance was 963, for a Football League Trophy game against Brighton & Hove Albion, which was the smallest crowd recorded for a competitive match at Priestfield for more than 20 years.", "Gillingham extended their unbeaten league run to four games with two more draws in the last two games of November, but then began December with consecutive defeats at home to Wigan Athletic and away to Rochdale.  Paul Watson, the only player to have played in every game up to this point in the season, was sent off in the defeat to Wigan.  Foster scored his first goal since August against Rochdale.  Gillingham ended the year by playing three games in six days.  On Boxing Day the team won 4–1 at home to Fulham, the first time Gillingham had scored four goals in a game for nearly two years.  The attendance of 4,737 would prove to be the largest of the season for a Third Division game at Priestfield.  The following day Gillingham lost 1–0 away to Barnet, beginning a run of three consecutive defeats.  The team's final match of 1994 was at home to Carlisle United on New Year's Eve; Carlisle won 1–0 meaning that Gillingham finished the year 18th in the table.  Although the team had only lost 3 of 10 league games at Priestfield up to this point in the season, their league position suffered from the fact that they had only won once and drawn twice in 11 games on their opponents' grounds, the worst away record in the division."]}]}}