{"wiki_id": "http://www.wikidata.org/entity/Q7151059", "itemLabel": "Paul H. Harvey", "itemDescription": "British evolutionary biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_H._Harvey", "wikipedia_page": {"main": "Paul H. Harvey  (born 19 January 1947) is a British evolutionary biologist. He is Professor of Zoology and was head of the zoology department at the University of Oxford from 1998 to 2011 and Secretary of the Zoological Society of London from 2000 to 2011, holding these posts in conjunction with a professorial fellowship at Jesus College, Oxford.", "link_mentions": [{"page": "Zoological Society of London", "response": ["*Paul H. Harvey (2000–2011)"]}, {"page": "Paranthropus robustus", "response": ["In 1985, British biologists Paul H. Harvey and Tim Clutton-Brock came up with equations relating body size to life history events for primates, which McHenry applied to australopithecines in 1994. For P. robustus, he reported newborn brain size of 175 cc and weight of , gestation 7.6 months, weaning after 30.1 months of age, maturation age 9.7 years, breeding age 11.4 years, birth interval 45 months, and lifespan 43.3 years. These roughly aligned with other australopithecines and chimps. However, for chimps, he got strongly inaccurate results when compared to actual data for newborn brain size, weaning age, and birth interval, and for humans all metrics except birth interval."]}, {"page": "Phylogenetic comparative methods", "response": ["* Paul H. Harvey"]}, {"page": "Georgina Mace", "response": ["Georgina Mace was born in Lewisham borough of London. Her father was Dr. Bill Mace, a rheumatologist, and her mother was Josephine Mace, a nurse. and educated at the City of London School for Girls before studying at the University of Liverpool where she was awarded a Bachelor of Science degree in 1976. She was awarded a PhD on the evolutionary ecology of small mammals in 1979 from the University of Sussex for research supervised by Paul H. Harvey."]}, {"page": "Tim Clutton-Brock", "response": ["* Readings in Sociobiology. Editor with Paul H. Harvey. (1978, W.H.Freeman & Company; )"]}, {"page": "Paul Harvey (disambiguation)", "response": ["*Paul H. Harvey (born 1947), British evolutionary biologist"]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| Paul H. Harvey||12/03/1992||"]}]}}