{"wiki_id": "http://www.wikidata.org/entity/Q7151299", "itemLabel": "Paul Hindmarch", "itemDescription": "cricketer (born 1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Hindmarch", "wikipedia_page": {"main": "Paul Robert Hindmarch (born 8 February 1988) is an English cricketer. Hindmarch is a right-handed batsman who bowls right-arm medium-fast. He was born at Carlisle, Cumberland, and was educated as Keswick School.\nHindmarch made his debut for Cumberland against Lincolnshire in the 2006 Minor Counties Championship. His next appearance for Cumberland didn't come until 2009, against Northumberland in the Minor Counties Championship, having between those appearances played second XI cricket for a number of first-class counties. His next appearance for Cumberland came in the 2012 Minor Counties Championship against Lincolnshire, with him making three further appearances in that season's competition. He also made his debut in 2012 in the MCCA Knockout Trophy against Dorset. During the 2012 season, Hindmarch was selected to play for the Unicorns in the Clydesdale Bank 40, making his List A debut for the team against Yorkshire at Headingley. He wasn't required to bat during the match, but did take the wicket of Adil Rashid, taking figures of 1/35 from six overs. He made a second appearance during the tournament against Warwickshire at Wormsley Park. Batting at number eleven, Hindmarch made 50 runs from 49 balls, before he was run out by Chris Wright. His partnership of 73 for the tenth wicket with Glen Querl was the highest of the Unicorn's innings of 185. In Warwickshire's successful chase, he bowled five wicketless overs for the cost of 36 runs.", "link_mentions": [{"page": "Hindmarch", "response": ["*Paul Hindmarch (born 1988), English cricketer"]}, {"page": "Keswick Cricket Club", "response": ["Keswick employed their first professional cricketer, Jason Young, in 2000. Since then the following professionals have played for the club: Madjid Jahangir, Mansoor Ahmed, Ata-ur-Rehman, Dinuka Hettiarachchi, Darren Hickey and Paul Hindmarch , current professional is Geeth Kumara,"]}, {"page": "List of people from Carlisle", "response": ["*Paul Hindmarch, cricketer"]}, {"page": "List of Unicorns List A players", "response": ["*Paul Hindmarch (2012–2013): PR Hindmarch"]}, {"page": "Hindmarch, Paul", "response": ["#redirectPaul Hindmarch"]}]}}