{"wiki_id": "http://www.wikidata.org/entity/Q7151275", "itemLabel": "Paul Hicks", "itemDescription": "musician, engineer and mixer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Hicks_(musician)", "wikipedia_page": {"main": "Paul Hicks is a British musician, audio engineer and mixer, who got his start working at Abbey Road Studios in London. Hicks has worked with several notable artists, including Coldplay, Elliott Smith Paul McCartney and Ringo Starr, in addition to his own band thenewno2. Hicks has also been heavily involved in preserving the recordings of the Beatles, working with Giles Martin in remixing and remastering their entire catalogue. He has won three Grammy Awards for his work on Beatles projects. His father is Hollies guitarist Tony Hicks. He is a member of Dhani Harrison's band thenewno2. Hicks has also worked on former Beatle George Harrison's posthumous releases, including the music for Martin Scorsese's 2011 documentary film George Harrison: Living in the Material World.In 2013, Hicks, along with his working partner Dhani Harrison, scored the film Beautiful Creatures. In 2014, they scored the film, Learning to Drive, as well as the AMC TV series The Divide. Hicks and Harrison have gone on to score the music for the TV show Good Girls Revolt, the motion picture Seattle Road, and for the Paul Giamatti-produced show, Outsiders. In 2018, Hicks and Harrison received a nomination for 'Best Music Score' at the International Documentary Association Awards for their work on the Sundance Film Festival Award-winning documentary, Matangi/Maya/M.I.A.. Together with Harrison, Hicks has also written the original theme for the Netflix produced documentary show Dogs, scored the four-part HBO documentary series The Case Against Adnan Syed and the 2019 Bill Gates Netflix docuseries Inside Bill's Brain: Decoding Bill Gates.", "link_mentions": [{"page": "Dhani Harrison", "response": ["In 2013, Harrison launched his career as a composer. Alongside his writing partner Paul Hicks, Harrison scored the Warner Bros. movie Beautiful Creatures. Harrison has gone on to score the music for the TV show Good Girls Revolt, AMC's The Divide, Seattle Road, Learning to Drive, and for the Paul Giamatti-produced show Outsiders. In 2018 Harrison and his writing partner Hicks received a nomination for 'Best Music Score' at the International Documentary Association Awards for their work on the Sundance Film Festival Award Winning documentary Matangi/Maya/M.I.A.. Most recently, Harrison wrote and recorded the title song for the Netflix original series Dogs and, along with Paul Hicks, scored the four-part HBO documentary series The Case Against Adnan Syed, the Bill Gates Netflix docuseries Inside Bill's Brain: Decoding Bill Gates and the 2020 RZA movie Cut Throat City.", "In between working on albums, Harrison, along with Paul Hicks, began their film composing partnership scoring the 2013 film Beautiful Creatures. In 2014, they scored the film Learning to Drive and the television series The Divide. In 2016, they composed music for the Amazon Video television series Good Girls Revolt and continue scoring the WGN TV series Outsiders.", "More recently, Harrison wrote and recorded the title song for the Netflix original series Dogs and, along with Paul Hicks, scored the four-part HBO documentary series The Case Against Adnan Syed and the 2020 RZA movie Cut Throat City."]}, {"page": "Walking into Clarksdale", "response": ["*Paul Hicks – assistant engineering"]}, {"page": "Driving Rain", "response": ["* Geoff Emerick, Paul Hicks – additional engineers"]}, {"page": "Run Devil Run (album)", "response": ["*Geoff Emerick, Paul Hicks – engineer"]}, {"page": "The Boatman's Call", "response": ["*Paul Hicks - assistant engineer"]}, {"page": "Mona Bone Jakon", "response": ["*Mixing – Paul Hicks"]}, {"page": "Ultra (Depeche Mode album)", "response": ["* Paul Hicks – engineering assistance"]}, {"page": "Spiceworld (album)", "response": ["* Paul Hicks – engineering "]}, {"page": "Too Much (Spice Girls song)", "response": ["* Paul Hicks – engineering"]}, {"page": "Flaming Pie", "response": ["* Paul Hicks – orchestral session assistant engineer on \"Beautiful Night\""]}, {"page": "Razorblade Suitcase", "response": ["* Paul Hicks – assistant engineer"]}, {"page": "After Murder Park", "response": ["* Paul Hicks – assistant engineer"]}, {"page": "Chris Hornbrook", "response": ["Hornbrook also makes an appearance on Harrison's live performance film \"IN///PARALIVE\" alongside musicians Davide Rossi of Coldplay, Stephen Perkins of Jane's Addiction, Big Black Delta, Camila Grey of Uh Huh Her and Mereki Beach. \"IN///PARALIVE\"  was filmed and recorded at Jim Henson Studios in Los Angeles, California in late 2017. It was produced and engineered by Paul Hicks. The film was also mixed by Hicks and Ryan Williams. It was released via Harrisons's Facebook page on June 14, 2019.", "|Dhani Harrison & Paul Hicks"]}, {"page": "In the First Place", "response": ["A psychedelic pop song, \"In the First Place\" has been likened by some commentators to Harrison's 1967 Beatles track \"Blue Jay Way\". Massot sequenced the rediscovered recording as the opening track in his 1999 director's cut of Wonderwall. Backed by a new mix of the song, carried out by Paul Hicks, the single was issued to help pay for the cancer treatment being undergone by Manley, who died three months after its release. In 2014, the Remo Four version was included as a bonus track on the Apple Years reissue of Wonderwall Music.", "After its limited showings over 1968–69, Wonderwall earned a reputation as a lost film from London's psychedelic eraJay Allen Sanford, \"Wonderwall w/ George Harrison: Lost 1968 Psychedelic Gem Now on DVD\", San Diego Reader, 24 May 2011 (retrieved 30 May 2017). and was remembered mainly for Harrison's Wonderwall Music soundtrack album.Glenn Erickson, \"Wonderwall on DVD and Blue-ray\", Turner Classic Movies, 2014 (archived version from 13 January 2016; retrieved 30 May 2017). Among the influences Oasis adopted from the Beatles, Noel Gallagher titled their 1995 song \"Wonderwall\" after the album.Bennett & Stratton, pp. 118, 146.Clayson, pp. 438–39. The widespread popularity of Oasis' song encouraged Massot to revisit Wonderwall in November 1997 and prepare a director's cut of the film for general release.Graham Reid, \"JOE MASSOT INTERVIEWED (2001): And after all, you're my wonder wall …\", Elsewhere, 14 February 2011 (retrieved 30 May 2017). Harrison assisted in retrieving the master tapes of the musical soundtrack, so that the film's music could be presented in stereo for the first time, during which he discovered a reel containing the Remo Four's \"In the First Place\".Madinger & Easter, p. 420. In his notes to the engineers restoring the film's audio, Harrison was unable to remember who wrote the song and speculated that it had been used as \"maybe a filler somewhere\" in the original film.\"George's notes to Paul Hicks & Eddie Veal in 1998 during restoration of Wonderwall\", Wonderwall Music CD booklet (Apple Records, 2014; produced by George Harrison), p. 11.", "The recording was remixed by Paul Hicks at Abbey Road Studios for inclusion in the new cut of Wonderwall. Massot used the song over the opening credits, replacing Harrison's Indian piece \"Microbes\"."]}, {"page": "Thenewno2", "response": ["Thenewno2 (styled as thenewno2) is an English alternative rock band from London. Originally composed of Dhani Harrison and Oliver Hecks, with Harrison playing lead guitar and singing lead vocals, and Hecks playing drums and synthesizer. As of 2014, the band consisted of Harrison, Jonathan Sadoff, Jeremy Faccone, Paul Hicks, Aaron Older and Frank Zummo. The name \"Thenewno2\" is a reference to the 1960s British television show The Prisoner. Thenewno2 have been credited with the album design for George Harrison's Brainwashed and Dark Horse Years box set, and for Concert for George,  and the menu design for the 2005 Concert for Bangladesh DVD. Hecks was the still photographer for the Concert for George in 2002, and some of his photographs appear in Genesis Publications' limited-edition book from the same event."]}, {"page": "Beautiful Night (Paul McCartney song)", "response": ["*Paul Hicks – orchestral sessions engineer"]}, {"page": "Bangla Desh (song)", "response": ["Despite the song having been a hit – and its status as the first-ever pop charity single,Frontani, p. 158. fourteen years before Band Aid and USA for AfricaThe Editors of Rolling Stone, p. 43. – \"Bangla Desh\" was mostly ignored by record-company repackagers following 1971. Over a period of 43 years, the studio version received an album release only on the 1976 compilation The Best of George Harrison, which was issued on CD in 1987.Badman, p. 388. The song has since been included as a bonus track, remixed by Paul Hicks,Joe Marchese, \"Review: The George Harrison Remasters – 'The Apple Years 1968–1975'\", The Second Disc, 23 September 2014 (retrieved 26 September 2014). on the 2014 reissue of Harrison's Living in the Material World album, part of the eight-disc Apple Years 1968–75 box set.Kory Grow, \"George Harrison's First Six Studio Albums to Get Lavish Reissues\", rollingstone.com, 2 September 2014 (retrieved 21 September 2014)."]}, {"page": "Memory Almost Full", "response": ["*Adam Noble, David Kahne, Steve Orchard, Geoff Emerick, Paul Hicks – engineers"]}, {"page": "Mixed Emotions (Beverley Craven album)", "response": ["*Engineer – Paul Hicks (track 2)"]}, {"page": "Let It Be... Naked", "response": ["* Paul Hicks – co-producer, mixing"]}, {"page": "50th Annual Grammy Awards", "response": ["**Paul Hicks, surround mix engineer; Tim Young, surround mastering engineer; George Martin & Giles Martin, surround producers (The Beatles)"]}, {"page": "Stronger Than My Heart", "response": ["In 2005, a special edition of Stronger Than My Heart was released. Paul Hicks, who has worked with bands such as Coldplay, Placebo and Travis in the secular stream, remixed the track 'King of Every Heart'. This was accompanied by a video of the song which was directed by Andy Hutch, who in the past has experience of working with The Thrills and Propellerheads."]}, {"page": "53rd Annual Grammy Awards", "response": ["**Jeff Jones, compilation producer; Paul Hicks, Sean Magee, Guy Massey, Sam Okell & Steve Rooke, mastering engineers (The Beatles)"]}, {"page": "Ravi Shankar's Music Festival from India", "response": ["Collaborations marked the first release for Stuart Cooper's concert film of the Music Festival from India, issued on DVD as disc four of the box set. The film was shot at the Royal Albert Hall on Monday, 23 September 1974.Back cover, Collaborations box set (Dark Horse Records, 2010; produced by Olivia Harrison). Text at the start of the DVD's \"concert film\" section explains that much restoration was needed on both footage and audio,Concert Film, introductory text, Music Festival from India – Live at the Royal Albert Hall DVD (Dark Horse Records, 2010; produced by Olivia Harrison; directed by Stuart Cooper). the latter being overseen by producer Paul Hicks and by Shankar's daughter Anoushka Shankar.\"Collaborations Box Set\" > Album credits, georgeharrison.com (retrieved 18 August 2014). With some of Cooper's 35-year-old footage having been destroyed or mislaid, the remainder of the concert's sound is included in a separate, \"concert audio\" section.Olivia Harrison, , Spinner, 18 October 2010 (archived version retrieved 19 August 2014). In her review for Goldmine, Gaar writes that, together with the Music Festival's studio album, the concert DVD features both \"the most traditional Indian music\" and \"the most powerful performances\" on Collaborations."]}, {"page": "Early Takes: Volume 1", "response": ["Early Takes: Volume 1 is a compilation album of outtakes and demo recordings by English rock musician George Harrison, released posthumously on 1 May 2012. The recordings appeared in Martin Scorsese's 2011 documentary film George Harrison: Living in the Material World and were originally issued as part of the deluxe version of the DVD release. Producer Giles Martin compiled the album, working with engineer Paul Hicks. The majority of the tracks date from the sessions for Harrison's 1970 triple album All Things Must Pass.", "Giles Martin said he was invited by George Harrison's widow Olivia to hear tapes of Harrison's unreleased recordings in 2009 and to help compile the music for Martin Scorsese's 2011 documentary film George Harrison: Living in the Material World. Martin worked on the project with engineer Paul Hicks at Harrison's Friar Park home in Oxfordshire. In music historian Warren Zanes' description, the creation of the film \"will likely be remembered as one of the great archaeological digs in rock and roll’s material history\"."]}, {"page": "Paul Hicks", "response": ["Paul Hicks may refer to:", "* Paul Hicks (rugby league) (born 1977), rugby league footballer", "* Paul Hicks (musician) (fl. 1990s–2010s), musician, engineer and mixer"]}, {"page": "Collaborations (Ravi Shankar and George Harrison album)", "response": ["The fourth disc of Collaborations is a DVD containing previously unissued film of a performance by the Music Festival from India, recorded at London's Royal Albert Hall in September 1974. Filmed by director Stuart Cooper, the footage required substantial restoration for its 2010 release. An audio-only track on the DVD, prepared by Anoushka Shankar and Paul Hicks, provides a more complete record of the concert.", "Considerable restoration was required to prepare Live at the Royal Albert Hall for release in 2010, since much of Cooper's footage had been lost during the ensuing decades or damaged.Concert Film, introductory text, Music Festival from India – Live at the Royal Albert Hall DVD (Dark Horse Records, 2010; produced by Olivia Harrison; directed by Stuart Cooper). Olivia Harrison explained: \"We laid music where we had picture and we cheated a little bit with picture where only sound existed to create over an hour of the concert …\" A separate selection on the DVD presents the audio for a more complete version of the performance, lasting over 90 minutes. Also included is a short segment where Anoushka Shankar and Paul Hicks, as remaster producers, work on the concert audio in a San Diego studio and are visited by Shankar and Olivia."]}, {"page": "The Radha Krsna Temple (album)", "response": ["The 1993 Apple CD added the non-album B-side \"Prayer to the Spiritual Masters\" as a bonus track,Album credits, The Radha Krsna Temple CD (Apple/Capitol, 1993; produced by George Harrison). while the 2010 reissue also included the previously unreleased \"Namaste Saraswati Devi\", a song written in praise of Saraswati, the Hindu goddess of knowledge, music and the arts.Liner notes by Andy Davis, The Radha Krsna Temple CD (Apple/EMI, 2010; produced by George Harrison; reissue produced by Andy Davis & Mike Heatley). That year, the album version of \"Govinda\" appeared on Apple's first-ever multi-artist compilation, Come and Get It: The Best of Apple Records. This second Apple reissue was remastered by Paul Hicks and Alex Wharton, led by Abbey Road project coordinator Allan Rouse."]}, {"page": "Matangi/Maya/M.I.A.", "response": ["The score was made by Dhani Harrison and Paul Hicks. The music supervisor was Tracy McKnight, and the film features samples of the M.I.A. tracks \"Born Free\", \"Paper Planes\", \"Bad Girls\" and \"Borders\"."]}, {"page": "Gimme Some Truth. The Ultimate Mixes", "response": ["Gimme Some Truth. The Ultimate Mixes was produced by the team consisting of production manager Simon Hilton, mixer, engineer, and producer Paul Hicks, and mix engineer and producer Sam Gannon—with direction from Yoko Ono and Sean Ono Lennon as the producer and creative director, respectively. The majority of the original tapes from the vault at Abbey Road and New York were digitised at Henson Studios in Los Angeles."]}]}}