{"wiki_id": "http://www.wikidata.org/entity/Q7151365", "itemLabel": "Paul Honeyford", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Honeyford", "wikipedia_page": {"main": "Paul Honeyford (born Manchester, 1958) is an English biographer and writer who has worked on a number of music- and sport- related works. He has often worked with Dave Heaven, a musician, on a variety of musical and design projects. \nHoneyford's biography of Paul Weller's band The Jam (The Modern World By Numbers) was the first such biography, written in consultation with the band at a time when they were at the peak of their success. Other works include Michael Jackson: The Golden Touch and Harrison Ford: A Biography. \nHoneyford also contributed to a number of English magazines, including Vox and Revolver, and acted as consulting editor for a number of cult comics and magazines produced by Quality Communications. \nFor a time he worked with Martin Buchan, a former Manchester United footballer, on a history of Manchester United, but this was never completed.An alumnus of Urmston Grammar School, he is the son of Ray Honeyford, who became well-known in the 1980s over what became known as the Honeyford Affair.", "link_mentions": [{"page": "Peter Milligan", "response": ["Milligan and artist Mike Deodato launched the Elektra series for Marvel Comics in November 1996. Milligan spent the remainder of the decade writing one-off specials such as Face and The Eaters, or miniseries like Egypt and Tank Girl The Odyssey (with its co-creator Jamie Hewlett providing art), as well as acting as advisory editor to Paul Honeyford's Fighting Figurines. Milligan and Brendan McCarthy's psychedelic comic Rogan Gosh was reprinted in a collected edition by Vertigo in 1996, after being first serialised six years earlier in Revolver."]}, {"page": "Quality Communications", "response": ["* Fighting Figurines (1 issue, 1996) — by Paul Honeyford and Dave Heaven, collecting the story originally anthologized in Revolver"]}, {"page": "Urmston Grammar", "response": ["* Paul Honeyford, biographer and linguist"]}, {"page": "West London Institute of Higher Education", "response": ["* Paul Honeyford a successful author and linguist"]}, {"page": "Dave Heaven", "response": ["He has worked in collaboration with writer Paul Honeyford on a number of occasions to produce songs and jingles under the design umbrella of AR Productions."]}, {"page": "Fighting Figurines", "response": ["Fighting Figurines is the title of a British comic book story written by Paul Honeyford and illustrated by Dave Heaven. Originally serialised in Revolver in 1990, it was later collected into a single edition by Quality Communications in 1996."]}, {"page": "Honeyford", "response": ["*Paul Honeyford (born 1958), English biographer"]}, {"page": "Honeyford, Paul", "response": ["#redirectPaul Honeyford"]}]}}