{"wiki_id": "http://www.wikidata.org/entity/Q7152167", "itemLabel": "Paul Mahorn", "itemDescription": "British footballer (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Mahorn", "wikipedia_page": {"main": "Paul Gladstone Mahorn (born 13 August 1973) is an English former football forward. He spent 1992 to 1998 with Tottenham Hotspur, but only played three Premier League games, and was also loaned out to Fulham and Burnley. In 1998, he played one game for Port Vale, before moving into non-league circles with Stevenage Borough, Cambridge City, and Cambridge United.", "link_mentions": [{"page": "Paul Gladstone Mahorn", "response": ["#REDIRECT Paul Mahorn"]}, {"page": "1997–98 Tottenham Hotspur F.C. season", "response": ["| Paul Mahorn", "|| FW || 30 || align=\"left\" | Paul Mahorn|| 0 || 0 || 1 ||1"]}, {"page": "1995–96 Burnley F.C. season", "response": ["||FW|| Paul Mahorn || Tottenham Hotspur || Loan || 28 March 1996"]}, {"page": "1997–98 Port Vale F.C. season", "response": ["The Vale started the season in modest form, as they picked up fourteen points in the opening nine games. On 11 September, John Rudge made the club's record signing by paying Lincoln City £500,000 for the services of midfielder Gareth Ainsworth. To pay for this Jon McCarthy was sold to Birmingham City for £1.5m. Also heading away from Stoke-on-Trent was Arjan van Heusden, who joined Oxford United on loan. The next month Gareth Griffiths left for a loan spell at Shrewsbury Town. Disappointment came on 12 October, with a 2–1 defeat to rivals Stoke City at the newly opened Britannia Stadium. Vale's indifferent form continued, one highlight being a 3–2 win over Manchester City at Maine Road on 4 November. Later in the year Paul Beesley joined on loan from Man City, and played a handful of games. The club's indifferent form then turned to a terrible run of ten defeats in twelve games, which included a run of one goal scored in seven games. Their form picked up in February, though they were still inconsistent. On 1 March, Stoke, who were also in relegation danger, escaped from Vale Park with a goalless draw. Later in month Rudge signed young Tottenham Hotspur forward Paul Mahorn on non-contract terms. On 14 March, a 2–1 win over Manchester City was to prove crucial, though Vale were still in danger of the drop. Going into their final game with Huddersfield Town at the Alfred McAlpine Stadium Vale had lost three straight games, and were in need of a win to ensure their safety in the league. A brace from Jansson, and one each from Martin Foyle and Lee Mills earned Vale a 4–0 win."]}, {"page": "1998–99 Port Vale F.C. season", "response": ["At the end of the season there was a complete clear-out, with ten players leaving: ten-year club veteran Neil Aspin (Darlington); Dave Barnett (Lincoln City); Brian McGlinchey (Gillingham); John McQuade (Raith Rovers); Chris Allen (Stockport County); Rogier Koordes (TOP Oss); Jan Jansson (IFK Norrköping);  Paul Mahorn (Stevenage Borough); Stéphane Pounewatchy (Colchester United); and Paul Beesley (Blackpool)."]}, {"page": "Mahorn", "response": ["*Paul Mahorn (born 1973), English former football forward"]}, {"page": "1996–97 Brentford F.C. season", "response": ["|15 March 1997|| style=\"text-align:center;\" |FW|| Paul Mahorn|| Tottenham Hotspur||March 1997||"]}, {"page": "Mahorn, Paul", "response": ["#redirectPaul Mahorn"]}]}}