{"wiki_id": "http://www.wikidata.org/entity/Q715996", "itemLabel": "Herbert Hall Turner", "itemDescription": "British astronomer and seismologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Hall_Turner", "wikipedia_page": {"main": "Herbert Hall Turner FRS (13 August 1861, Leeds – 20 August 1930, Stockholm) was a British astronomer and seismologist.\n\n", "link_mentions": [{"page": "Parsec", "response": ["The word parsec is a portmanteau of \"parallax of one second\" and was coined by the British astronomer Herbert Hall Turner in 1913 to make calculations of astronomical distances from only raw observational data easy for astronomers. Partly for this reason, it is the unit preferred in astronomy and astrophysics, though the light-year remains prominent in popular science texts and common usage. Although parsecs are used for the shorter distances within the Milky Way, multiples of parsecs are required for the larger scales in the universe, including kiloparsecs (kpc) for the more distant objects within and around the Milky Way, megaparsecs (Mpc) for mid-distance galaxies, and gigaparsecs (Gpc) for many quasars and the most distant galaxies.", "Though it may have been used before, the term parsec was first mentioned in an astronomical publication in 1913. Astronomer Royal Frank Watson Dyson expressed his concern for the need of a name for that unit of distance. He proposed the name astron, but mentioned that Carl Charlier had suggested siriometer and Herbert Hall Turner had proposed parsec. It was Turner's proposal that stuck."]}, {"page": "Pluto", "response": ["The name Pluto, after the Greek/Roman god of the underworld, was proposed by Venetia Burney (1918–2009), an eleven-year-old schoolgirl in Oxford, England, who was interested in classical mythology. She suggested it in a conversation with her grandfather Falconer Madan, a former librarian at the University of Oxford's Bodleian Library, who passed the name to astronomy professor Herbert Hall Turner, who cabled it to colleagues in the United States. "]}, {"page": "List of astronomers", "response": ["| Herbert Hall Turner || England || 1861 || 1930", "*Herbert Hall Turner (England, 1861–1930)"]}, {"page": "Carte du Ciel", "response": ["A fascinating contemporary account of this vast international astronomical collaboration, published in 1912, is given by Herbert Hall Turner, then Savilian Professor of Astronomy at Oxford University.H.H. Turner, 1912 The Great Star Map, Being a Brief General Account of the International Project Known as the Astrographic Chart (John Murray)  Other aspects are covered in various papers in the Proceedings of IAU Symposium Number 133 held in 1988.Proceedings of IAU Symposium Number 133, Mapping the Sky, editor S. Debarbat, 1988"]}, {"page": "Venetia Burney", "response": ["On 14 March 1930, Falconer Madan read the story of the new planet's discovery in The Times, and mentioned it to his granddaughter Venetia. She suggested the name Pluto – the Roman God of the Underworld who was able to make himself invisible − and Falconer Madan forwarded the suggestion to astronomer Herbert Hall Turner, who cabled his American colleagues at Lowell Observatory. Clyde Tombaugh liked the proposal because it started with the initials of Percival Lowell who had predicted the existence of Planet X, which they thought was Pluto because it was coincidentally in that position in space. On 1 May 1930, the name Pluto was formally adopted for the new celestial body. Whether she was really the first person to propose the name has been doubted on plausibility grounds,Geoff Nunberg. Another Plutonian casualty? Language Log. 27 August 2006. but the historical fact is that she was credited as such."]}, {"page": "Bruce Medal", "response": ["* 1927 – Herbert Hall Turner"]}, {"page": "John Louis Emil Dreyer", "response": ["He co-edited the first official history of the Royal Astronomical Society along with Herbert Hall Turner, History of the Royal Astronomical Society 1820–1920 (1923, reprinted 1987)."]}, {"page": "List of minor planets named after people", "response": ["*1186 Turnera (Herbert Hall Turner)"]}, {"page": "Turner (crater)", "response": ["Turner is a small lunar impact crater that lies in the Mare Insularum, near the Moon's equator. The crater was named after British astronomer Herbert Hall Turner. It is located to the southeast of the crater Gambart. Turner is a circular, cone-shaped crater with inner walls that slope down to the midpoint. A similar-sized ghost crater is attached to the western rim, its interior floor submerged by lava and the surviving rim broken in the southwest."]}, {"page": "List of craters on the Moon: T–Z", "response": ["| Turner ||  || align=right | 11.22 || align=center | 1935 || Herbert Hall Turner (1861–1930) || "]}, {"page": "Royal Institution Christmas Lectures", "response": ["| Herbert Hall Turner", "| Herbert Hall Turner", "| Herbert Hall Turner", "| Herbert Hall Turner"]}, {"page": "DM Geminorum", "response": ["DM Geminorum also known as Nova Geminorum 1903 was a nova which erupted in the constellation Gemini in 1903.   It was discovered by Herbert Hall Turner at the Greenwich Observatory on a Carte du Ciel photographic plate taken on 16 March 1903. Post-discovery examination of earlier photographs of the region taken at the Harvard College Observatory showed that the star was fainter than apparent magnitude 9 on 2 March 1903, and magnitude 5.1 on 6 March 1903, making it visible to the naked eye at that time. It had a conspicuous red color due to strong Hα line emission. By 1 April 1903 it had faded to magnitude 8.5.   By 1989 it had reached visual magnitude 17.38."]}, {"page": "Mathematical Association", "response": ["*1909–1910 Herbert Hall Turner"]}, {"page": "Annie S. D. Maunder", "response": ["In January 1890, Annie was told about a position at Greenwich that was available by her good friend Alice Everett. In response, Annie wrote many times to the Royal Observatory hoping to be considered for the position. Annie's father submitted a request for her to obtain the job, and a powerful promoter, Sir Robert Ball, wrote her a letter of recommendation. For a year, Annie worked as a mathematics mistress at the Ladies’ High School on the island of Jersey until she was offered the position by the Chief Assistant, Herbert Hall Turner. In 1891, Annie began her work at the Royal Observatory, Greenwich, serving as one of the \"lady computers\" assigned to the solar department. This was a special department set up in 1873 to photograph the sun. Annie was offered £4 a month which she regarded as being barely enough to live on, as a teacher she had made £8 a year and was provided housing."]}]}}