{"wiki_id": "http://www.wikidata.org/entity/Q7151800", "itemLabel": "Paul Kitson", "itemDescription": "Footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Kitson", "wikipedia_page": {"main": "Paul Kitson (born 9 January 1971) is an English former professional footballer who played as a striker.\nHe notably played in the Premier League for Newcastle United, West Ham United and Charlton Athletic, as well as in the Football League with \nLeicester City, Derby County, Crystal Palace, Brighton & Hove Albion, Rushden & Diamonds and Aldershot Town. He was capped seven times by England U21, scoring 3 goals.", "link_mentions": [{"page": "West Ham United F.C.", "response": ["Redknapp's time at West Ham was notable for the turnover of players during his tenure and for the level of attractive football and success which had not been seen since the managership of John Lyall. Over 134 players passed through the club while he was manager, producing a net transfer fee deficit of £16 million, despite the £18 million sale of Rio Ferdinand to Leeds United. Some were notably successful, such as the signings of Stuart Pearce, Trevor Sinclair, Paolo Di Canio, John Hartson, Eyal Berkovic and Ian Wright. Meanwhile, some were expensive, international players who failed at West Ham, such as Florin Raducioiu; Davor Šuker, who earned as much in wages as the revenue gained from one entire stand and yet made only eight appearances; Christian Bassila, who cost £720,000 and played only 86 minutes of football; Titi Camara; Gary Charles, whose wages amounted to £4.4 million but made only three starts for the club; Rigobert Song; Paulo Futre; and Marco Boogers, a player often quoted as one of the biggest failures in the Premier League. His first season in charge saw West Ham fighting the threat of relegation until the last few weeks, while his third season would also see another relegation battle. Always willing to enter the transfer market, Redknapp bought in the winter transfer window John Hartson and Paul Kitson who added the impetus needed at the season's end."]}, {"page": "Kevin Keegan", "response": ["Newcastle won their first six games of the 1994–95 season to top the league and they appeared capable of winning their first league title since 1927. But the shock departure of Andy Cole to Manchester United in January weakened their attack, and finished the season sixth place in the final table; not enough for even another UEFA Cup campaign. In the meantime, autumn signing Paul Kitson partnered Beardsley in attack."]}, {"page": "2001–02 in English football", "response": ["*19 November 2001 - Out of favour striker Paul Kitson scores a hat-trick for West Ham United in a 4–4 deaw at Charlton Athletic in the Premier League."]}, {"page": "John Hartson", "response": ["Hartson made his debut for West Ham on 15 February 1997 alongside another new signing, Paul Kitson. West Ham lost 1–0 to Derby County and Hartson was booked. His first West Ham goal came in his next following game on 24 February 1997, a 4–3 home win over Tottenham Hotspur. In his first season, he scored five league goals from eleven games and was instrumental in helping West Ham rise from 18th when he joined to a final league position for 1996–97 season of 14th. The next season saw Hartson finish, with 24 goals in 42 games in all competitions, as West Ham's top scorer. Hartson's goal tally was in all a considerable margin ahead of the next highest scorer, Eyal Berkovic with nine goals. He was also the second highest scorer, behind Andy Cole in the Premier League in that season. In the 1998 close season, Manchester United chairman Martin Edwards and assistant manager Brian Kidd expressed their desire for Hartson to sign for Manchester United to manager Alex Ferguson. However, Ferguson decided against making a bid for Hartson. In a training ground incident in September 1998, Hartson kicked West Ham teammate Eyal Berkovic in the face, after the Israeli midfielder had punched Hartson in the leg as he attempted to help Berkovic to his feet. The incident was captured on camera. Hartson was fined and admitted in his biography that it was an error of judgement. Berkovic said of the incident \"If my head had been a ball, it would have been in the top corner of the net\"."]}, {"page": "1994–95 FA Premier League", "response": ["Just before the start of the 1994–95 season, the English transfer record was broken when Blackburn Rovers paid £5 million for 21-year-old Norwich City striker Chris Sutton. But that record was broken again in January when Manchester United paid £6 million for Newcastle United's Andy Cole, in a deal which also saw £1 million-rated Keith Gillespie move to Newcastle. Other significant transfers before and during the 1994–95 season included: Vinny Samways (Tottenham to Everton, £2 million), David Rocastle (Manchester City to Chelsea, £1.25 million), Jürgen Klinsmann (Monaco to Tottenham Hotspur, £2 million), John Scales (Wimbledon to Liverpool, £3 million) and Paul Kitson (Derby County to Newcastle United, £2.2 million)."]}, {"page": "Adam Boyd", "response": ["He then progressed through to Manor College of Technology and he was once again recognised as a football player by the school's headmaster, Alan White, a teacher who had previously taught Steve Harper and Paul Kitson.\"Boyd shooting for the stars\", Northern Echo, first published Saturday 15 May 2004  Boyd also played for five years with a Sunday League team called Hartlepool St. Francis, where he started off by playing in central defence and helped the team win several trophies in the Teesside Junior Alliance league. Boyd caught the eye of Middlesbrough who sent scouts to watch him and gave him a trial. However, they decided against signing him for he joined Hartlepool United instead, which was his favourite team alongside Manchester United.Match magazine 24–30 August, page 29. He had regularly watched Hartlepool United as a young lad with his father."]}, {"page": "1996–97 in English football", "response": ["6 February 1997 – West Ham United pay a club record £2.3million for Newcastle United striker Paul Kitson.", "12 March 1997 – Recently signed striker Paul Kitson scores twice as West Ham United boost their survival bid with a 3–2 home win over Chelsea.", "3 May 1997 – Sunderland play their last game at Roker Park after 99 years and go out on a high by beating Everton 3–0, but are still in danger of Premier League relegation. Their local rivals Newcastle United remain in contention for the league title with a 1–0 win at Arsenal – a result which rules the North Londoners out of the title race. Liverpool remain in it with a 2–1 home win over Tottenham. Paul Kitson ensures West Ham's survival with a hat-trick in their 5–1 home win over Sheffield Wednesday, whose UEFA Cup hopes are ended by the result. Coventry City, meanwhile, are left needing a miracle to save their 30-year tenure in the top flight due to a 2–1 home defeat by Derby County."]}, {"page": "1998–99 West Ham United F.C. season", "response": ["|Paul Kitson"]}, {"page": "Marco Gabbiadini", "response": ["However, Gabbiadini failed to live up to expectation and he made just 25 starts and scored just seven goals before transferring to Derby County for £1 million four months later, which made Derby the third club that he had played for in the space of a season. In a bid to mount a serious promotion challenge, Derby County invested heavily in players around the period of Gabbiadini's arrival. Gabbiadini's first full season at the Baseball Ground, saw him featuring up-front alongside fellow million pound strikers Paul Kitson and Tommy Johnson, signings from Leicester City and Notts County, respectively. During Gabbiadini's first full season at Derby, he was named Derby's Player of the Year. He would become an established first team player for Derby up until the team got promoted to the Premier League."]}, {"page": "List of West Ham United F.C. seasons", "response": ["|Julian DicksPaul Kitson"]}, {"page": "1999–2000 West Ham United F.C. season", "response": ["|Paul Kitson"]}, {"page": "Samassi Abou", "response": ["Abou started playing in France for FC Martigues, before moving to Lyon. In October 1997, after a spell at AS Cannes, he made the move to English football, signing for West Ham United for £250,000. Signed by manager Harry Redknapp to give more options for strikers, Abou made his West Ham debut on 9 November 1997, in a 2–1 away defeat to Chelsea coming on as a substitute for John Moncur. His opening West Ham goal came on 6 January 1998, in the League Cup. In a fifth-round game at the Boleyn Ground, Abou came on as a substitute for Paul Kitson to score their only goal in a 2–1 defeat. In the following game, on 10 January 1998, Abou scored twice as West Ham beat Barnsley 6–0. Abou received his only red card in the next game, a 1–0 away defeat to Tottenham Hotspur. Fouling Ramon Vega in an off-the-ball incident, Abou was dismissed by referee David Elleray. Abou finished the 1997–98 season with 6 goals from 26 games, including two on the last day of the season in a 4–3 home defeat of Leicester City. West Ham fans would boo Abou whenever he scored, making an \"Abooooooooo\" noise. In 31 appearances in all competitions, he scored six times, before being released to Ipswich Town in December 1998, where he scored once against Sheffield United."]}, {"page": "1991–92 in English football", "response": ["11 March 1992 – Queens Park Rangers inflict another 4–1 defeat on a title-chasing side, this time Leeds United at Loftus Road. Derby County spend £1.3million on Leicester City striker Paul Kitson, while Manchester City sign Dutch defender Michel Vonk from HVV for £500,000."]}, {"page": "David Terrier", "response": ["He played for FC Metz and AC Ajaccio in Ligue 1. Terrier also played in the Premier League for West Ham United. He made only one appearance, on 9 August 1997, coming on as a substitute for Paul Kitson in a 2-1 away win against Barnsley."]}, {"page": "Lionel Pickering", "response": ["In January 1992, with Arthur Cox's low budget team just in touch with the leading pack, Pickering embarked on a spending increase, the biggest in the club's history, with the £1 m signing of Marco Gabbiadini from Crystal Palace. Joining  him in that season were Paul Kitson, Tommy Johnson & Paul Simpson, followed by Steve Sutton, Mark Pembridge, Darren Wassall, Craig Short & Martin Kuhl a year later."]}, {"page": "Easington Academy", "response": ["The school's alumni include such professional footballers as Newcastle goalkeeper Steve Harper,Hartlepool fanzine , p36, article by Alan White, a former teacher at Easington Paul Kitson, Chris Brass, Paul Smith, John Hutton, Richard Ord, Stuart Brightwell, and Adam Johnson."]}, {"page": "List of people from Sunderland", "response": ["* Paul Kitson, ex-professional footballer"]}, {"page": "History of West Ham United F.C.", "response": ["Faced with relegation, the board financed two key acquisitions. Firstly, young Arsenal striker John Hartson in a £3.3 million move (again breaking the club's transfer record) and in addition the signing of Newcastle United forward Paul Kitson in a £1.2 million move and battling Manchester City midfielder Steve Lomas for £1.6 million. The strike pair were an instant hit, scoring 13 goals between them in 12 games as a pairing, including those in a vital 4–3 win against close rivals Tottenham, a 3–2 against Chelsea and a hat-trick for Kitson and brace for Hartson in a 5–1 rout of Sheffield Wednesday in the next-to-last game, confirming the club's Premier League survival.", "The summer of 2002 did not bode well for the season ahead. Despite a glaring need for squad reinforcements, the only positive transfer activity involved Irish international Gary Breen signing on a free transfer. Leaving were Paul Kitson and a hatful of youth and fringe players. Another poor start plagued West Ham United through to 2003, and this time Roeder was unable to turn things around. The loss of Kanouté for nearly one-third of the season, and Di Canio at exactly the same period, resulted in the teenage Jermain Defoe leading the line on his own. The loss of form of key players such as Trevor Sinclair, 2001–02 Hammer of the Year Sebastian Schemmel and Michael Carrick, who was still nursing a groin problem, combined with the absence of a dependable left back or left midfielder, merely exacerbated an already difficult situation. The Hammers failed to win a single home game until January and suffered a humiliating defeat at the hands of Manchester United in the FA Cup. The much-attacked Gary Breen was pointedly at fault for a number of errors,Breen's errors vs Utd in match report  but his play was not helped by the lack of any cohesive team."]}, {"page": "Steve Jones (footballer, born March 1970)", "response": ["In January 1996, after a successful spell at the south coast club, West Ham manager Harry Redknapp again brought the player back to Upton Park for a fee of £200,000, with Mark Watson moving to Dean Court. During his second spell with West Ham he was partnered with Mike Newell as twin strikers. With the pair both failing to score goals manager Redknapp bought Paul Kitson and John Hartson to provide the goals needed to keep West Ham from relegation and Jones was allowed to leave. He joined Charlton Athletic in February 1997 for £400,000. He played in their dramatic win over Sunderland in the 1998 play-off final, winning 7–6 on penalties after a 4–4 draw. He had been nominated as the eighth penalty taker, if required."]}, {"page": "Kitson (surname)", "response": ["* Paul Kitson (born 1971), English former footballer"]}, {"page": "List of Derby County F.C. seasons", "response": ["| Paul Kitson"]}, {"page": "1994–95 Manchester United F.C. season", "response": [" Five days later, the two sides met at St James' Park in the league, but neither player turned out for their new side in the game which ended in a 1–1 draw. United had gone ahead with an early goal from Mark Hughes, who suffered a knee injury in the process and was ruled out until the following month, before Newcastle equalised with a goal from Paul Kitson – the man taking Cole's place in the Newcastle attack."]}, {"page": "1996 FA Charity Shield", "response": ["|FW ||28|| Paul Kitson"]}, {"page": "List of Premier League hat-tricks", "response": ["!scope=\"row\"| Paul Kitson"]}, {"page": "History of Derby County F.C. (1967–present)", "response": ["Despite such struggles Saunders had managed an impressive 17 goals, almost half of Derby's 37 total, and it was no surprise that the club failed to hold on to him as he was sold to Liverpool for £2.9m (over £2m more than the previous record fee received for a Derby player), along with Mark Wright, who commanded a £2.3m. Much of the cash from this £5.2m windfall went into paying off Robert Maxwell. Maxwell was replaced first by Brian Fearn and then by Lionel Pickering, who made his fortune through the founding and running of a free newspaper, and brought majority shareholdings and invested £12m in the form of a loan. Derby went from being financially stricken to one of the richest clubs outside the top flight. Derby twice broke its transfer record in the space of a month when in March 1992 they signed Paul Kitson for £1.3m from Leicester City (Phil Gee being one of two players going in the opposite direction) and then Tommy Johnson for Notts County ten days later. Paul Simpson also came in from big money (£800k from Oxford United) as did Marco Gabbiadini (£1.3m from Sunderland) and even Bobby Davison (who had left for Leeds United three years earlier), returned for a spell on loan and reached a century of goals for Derby, only the 7th player and most recent to do so, when he netted in a 2–2 draw with Newcastle United. Despite such attacking prowess, and the setting of a new club record for 12 away wins in a season, Derby could only finish 3rd in the 1991–92 Second Division and missed out on automatic promotion by 2 points. As a result, Derby entered the Football League playoffs for the first time since they had been introduced in 1987. Facing off against fellow big spenders Blackburn Rovers, Derby fell at the semi final stage as a 2–1 win at The Baseball Ground wasn't enough to overcome a 4–2 defeat at Ewood Park in the first leg and they crashed out 4–5 on aggregate and missed out on the opportunity to be a part of the inaugural Premier League, instead spending the 1992–93 season in the renamed Division One.", "Despite the addition of Craig Short for £2.5m from Notts County –  a record for a team outside of the top flight and for a defender at any level – the club could only an 8th-placed finish in the 1992–93 Division One table, largely as a result of taking three points from their opening 7 fixtures, missing out on the playoffs altogether. Whilst the club did manage a trip to Wembley for the first time in nearly 20 years – reaching the final of the Anglo-Italian Cup, where they lost 1–3 to Cremonese – and recorded a club record 7 consecutive away league wins, starting with a 3–1 win at Cambridge United on 3 October 1992 and ending with a 2–1 defeat at Brentford on Boxing Day, 1992, the season was seen as something of a disappointment considering the amount of money spent and the players available to the club. The Anglo Italian cup run, coupled with extended interest in the Coca-Cola Cup (where they took Arsenal to a third round replay) and reaching the FA Cup Quarter-finals for the first time in 9 years, taking Sheffield Wednesday to a replay after a 3–3 draw at The Baseball Ground meant the cup took part in 64 matches between 15 August 1992 and 8 May 1993, a new club record with Paul Kitson taking part in 61 of them and finishing the season as leading scorer, with 24 goals in all competitions. Arthur Cox retired in October of the 1993–94 season, citing severe back problems, leaving the role after 9 years in charge.", "He was replaced by his assistant Roy McFarland (who became the only man to manage the club permanently in two separate spells) who steered the club's to a second playoff campaign. After overcoming Millwall 5–1 on aggregate in the semifinal legs, and surviving a pitch invasion in the 3–1 win at the New Den, Derby came up against local rivals Leicester City at Wembley. Despite taking the lead through Tommy Johnson, Derby lost 2–1 after a double from Steve Walsh and missed out on promotion yet again. Derby had built a side which seemed to be consistently achieving less than the sum of its parts, with Gary Charles, a former England international, Craig Short, Paul Williams, Mark Pembridge, Paul Kitson and Tommy Johnson all keen to test themselves at a higher level. Several of these players left during the 1994–95 season, Kitson joining Newcastle United for £2.25m, Charles and Johnson moving to Aston Villa for a combined £2.9m and Pembridge moving to Sheffield Wednesday. The side was also weakened when goalkeeper Martin Taylor, an ever-present the previous season and touted for a place in the England squad, broke his leg in a 1–0 defeat at Southend United and was out of action for the next 29 months. With chairman Lionel Pickering's increased frustration at no return on his investment, the purse strings were tightened and McFarland was unable to buy suitable replacements, instead blooding youth products such as Dean Sturridge, Russell Hoult and Lee Carsley to fill the gaps created by the departures. In the event Derby could only record a 9th-place finish and McFarland, in the knowledge his contract was not going to be renewed, said his goodbye's in the penultimate match of the season, a 2–1 home defeat at Southend United, ending a 28-year association with the club, broken only by a two-year spell as player-manager at Bradford City."]}, {"page": "Wayne Jentas", "response": ["Since retirement he has coached at numerous teams. From 1982 to 1986, he was the junior varsity soccer coach at Hudson High School. During this time, he also spent one season, 1984–1985, as an assistant with the Canton Invaders. On 11 October 1991, he was named an assistant coach with the Cleveland Crunch.Crunch Pounds Dallas Crowd of 18,327 sees 10-4 Exhibition Triumph Akron Beacon Journal (OH) - Saturday, 12 October 1991 On 26 February 1993, Jentas replaced Paul Kitson as head coach of the Denver Thunder.Thunder names Canadian as new head coach The Denver Post - Saturday, 27 February 1993 He later coached the College of Wooster soccer team. He has also coached the East-West Premier Soccer Club. He is currently the Director of Pennine United."]}, {"page": "1994 Football League First Division play-off Final", "response": ["This was Derby County's first appearance in the second-tier play-off final but they had featured in the 1992 Football League play-offs, where they were eliminated in the semi-finals by Blackburn Rovers.  The club had featured in the second tier since suffering relegation from the top league in the 1990–91 season. Leicester were appearing in their third consecutive  second tier play-off final, having lost in both 1992 and 1993.  They had played in the second tier of English football since they were relegated from the First Division in the 1986–87 season.  Derby County won the first of the two meetings between the clubs during the regular season, with a 3–2 victory at Pride Park in December 1993.  The return fixture was a 3–3 draw at Filbert Street the following April. Derby County's top scorer was Tommy Johnson with 16 goals (13 in the league, 1 in the FA Cup, 1 in the League Cup and 1 in the Anglo-Italian Cup).  Two players had 15 goals for the season: Gabbiadini (13 in the league and 2 in the League Cup), and Paul Kitson (13 in the league, 1 in the League Cup and 1 in the Anglo-Italian Cup). Iwan Roberts and Speedie were Leicester City's top scorers with 13 goals (all in the league for Roberts, while Speedie's tally included 1 in the League Cup), while Julian Joachim had scored 12 during the regular season (11 in the league, 1 in the League Cup).", "|CF ||12||Paul Kitson || || "]}, {"page": "1995–96 Newcastle United F.C. season", "response": ["|align=\"left\"|28||align=\"left\"|FW||align=\"left\"| Paul Kitson"]}, {"page": "1993–94 Newcastle United F.C. season", "response": ["Post-season signings included World Cup stars Marc Hottiger and Philippe Albert, and Derby striker Paul Kitson."]}, {"page": "1996–97 Newcastle United F.C. season", "response": ["Kenny Dalglish sold Forward Paul Kitson to West Ham United F.C for £1,200,000 in February 1997, whilst Midfielder Des Hamilton was signed in March 1997 from Bradford City F.C. for £2,500,000, having fought off competition from Middlesbrough. Hamilton was injured at the time of his arrival and did not make his debut until the following season.", "! scope=\"row\"| Paul Kitson", "|FW ||28|| Paul Kitson", "|align=\"left\"|28||align=\"left\"|FW||align=\"left\"| Paul Kitson"]}, {"page": "1994–95 Newcastle United F.C. season", "response": ["The 1994–95 season also saw the arrival of Marc Hottiger, Philippe Albert, Paul Kitson and Keith Gillespie, as well as the late and close season departures of Barry Venison, Alex Mathie, Mike Jeffrey and Paul Bracewell.", "|align=\"left\"|28||align=\"left\"|FW||align=\"left\"| Paul Kitson", "|  Paul Kitson"]}, {"page": "South London derby", "response": ["* Paul Kitson"]}, {"page": "2000–01 West Ham United F.C. season", "response": ["|align=\"left\"|12||align=\"left\"|FW||align=\"left\"| Paul Kitson"]}, {"page": "2001–02 West Ham United F.C. season", "response": ["|6||ST||9||||data-sort-value=\"Kitson, Paul\"|Paul Kitson||3||0||0||3"]}, {"page": "2002–03 West Ham United F.C. season", "response": ["| Paul Kitson"]}, {"page": "1997–98 West Ham United F.C. season", "response": ["After last season's near miss with relegation, West Ham United looked more convincing than they had done for years during 1997–98. John Hartson matured into one of the best strikers in the Premiership, with his partner Paul Kitson also providing a steady supply of goals. Young centre-back Rio Ferdinand remained loyal to his employers despite endless speculation of a move to a bigger club."]}, {"page": "Derby County F.C.–Leicester City F.C. rivalry", "response": ["* Paul Kitson"]}]}}