{"wiki_id": "http://www.wikidata.org/entity/Q7152888", "itemLabel": "Paul Paton", "itemDescription": "Northern Irish footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Paton", "wikipedia_page": {"main": "Paul Raymond Paton (born 18 April 1987) is a professional footballer who plays as a defensive midfielder for Scottish League One Dumbarton.\nHe has previously played for Queen's Park, Partick Thistle, Dundee United, St Johnstone, Plymouth Argyle, Falkirk, Dunfermline Athletic, East Kilbride and Airdrieonians on loan.\nBorn in Scotland, Paton has represented Northern Ireland at international level.", "link_mentions": [{"page": "Partick Thistle F.C.", "response": ["McNamara and assistant Simon Donnelly guided Thistle to a sixth-place finish in 2011–12 season. The following season Thistle started well and emerged as promotion candidates, competing with Dunfermline and Greenock Morton for a place in the following season's top flight. On 29 January 2013 the club gave permission to Dundee United to speak to McNamara about becoming their new manager. The following day McNamara and his assistant Simon Donnelly resigned, to become the new management team at United. Along with Donnelly, Jackie McNamara brought goalkeeper Craig Hinchliffe, Paul Paton and Chris Erskine to Tannadice. Thistle were second in the league at the time and, because McNamara was under contract, compensation was owed to the club."]}, {"page": "Linwood, Renfrewshire", "response": ["UEFA Champions League winner Paul Lambert grew up in Linwood. Former Dundee United F.C. Captain, Paul Paton is also from Linwood. Ex goalkeeper Billy Thomson grew up in Linwood. "]}, {"page": "Dundee United F.C.", "response": ["* 2013 Paul Paton"]}, {"page": "Dunfermline Athletic F.C.", "response": ["|  Paul Paton"]}, {"page": "Anthony Stokes", "response": ["Stokes scored a goal in each of Celtic's first two league games of the season, 3–0 and 6–1 wins over St Johnstone and Dundee United respectively. However over the course of the season Stokes scored fewer goals than in previous seasons, mainly due to new manager Ronny Deila fielding him in a wide left role as opposed to his more recognised position as a striker. Stokes' form at this time was often unimpressive, drawing criticism from supporters, and he was also disciplined by the club after he returned to Celtic late from a trip to his home city of Dublin. Stokes continued to feature on the left wing for Celtic though, and it was from his cross that Kris Commons scored the opening goal on 15 March 2015 in Celtic's 2–0 win over Dundee United in the League Cup Final. He commented after the final, \"I do need to show that I can still bring something to the team and I thought I did that today. I felt fresher and sharper. I thought I contributed.\" A few days later, Stokes provided the assist for Jason Denayer's opening goal in a 4–0 win over Dundee United in a Scottish Cup quarter-final replay at Parkhead.  However, Stokes was sent off later in the same game for elbowing United's Paul Paton."]}, {"page": "Paton (surname)", "response": ["*Paul Paton (born 1987), professional footballer"]}, {"page": "Greg Tansey", "response": ["After a substitute appearance against Aberdeen, he made his starting debut against Hearts in the League Cup semi-final where he opened the scoring with a thunderous 25-yard-strike. In the quarter-final of the Scottish Cup, in a 5–0 loss to Dundee United, Tansey was sent-off after lunging at Paul Paton. After being suspended for the game against Hibernian, it was confirmed that Tansey was eligible to play in the final of the Scottish League Cup. In the final against Aberdeen, Tansey played the whole 90 minutes plus extra time before the game eventually reached a penalty shoot-out. Aberdeen won the match and the Cup after Tansey, along with Billy McKay, missed their penalties in the shoot-out. Tansey scored his first league goal, of his second spell at Inverness, in a 2–2 draw against St Mirren on 29 March 2014. He then scored his second goal in the last game of the season, a 2–0 win over St Johnstone. On his return to Inverness CT's second spell, Tansey made twenty-one appearances and scored three times in all competitions."]}, {"page": "Morgaro Gomis", "response": ["After training with the club for several weeks, Gomis rejoined Dundee United on 10 October 2013; he signed a contract until the end of the 2013–14 season. He made his first appearance on 26 October, in a 4–0 victory against St Mirren. On 12 April 2014, he came on as a substitute in the Scottish Cup semifinal at Ibrox as United defeated Rangers 3–1, progressing to the final, in which he was an unused substitute as Dundee United lost 2-0 to St Johnstone. With John Rankin and Paul Paton an established pairing in midfield, Gomis struggled for game time. He made only five starts and sixteen substitute appearances in all competitions, and was among nine players to be released by the club when their contracts expired at the end of the season."]}, {"page": "Linwood High School", "response": ["* Paul Paton Partick Thistle Football Club"]}, {"page": "2008–09 Partick Thistle F.C. season", "response": ["|Paul Paton||32||3||3||5||0", "|Paul Paton||2||0||0||0||0", "|Paul Paton||2||0||0||0||0", "|Paul Paton||3||1||0||0||0", "|Paul Paton||6||0||1||0||0", "|Paul Paton||3||0||0||0||3"]}, {"page": "2009–10 Partick Thistle F.C. season", "response": ["| Paul Paton||15 (0)||0||5||0", "|  Paul Paton || 0 || 0 || 0 || 0 || 2 || 0 || 1 || 0 || 3 || 0 || 0 || 0 "]}, {"page": "Chris Erskine", "response": ["On 16 April 2013 it was announced that Erskine, along with Thistle teammate Paul Paton, had signed a pre-contract agreement with Dundee United and would join at the start of the 2013–14 season. He scored his first goal for Dundee United in a 4–0 win against St Mirren."]}, {"page": "Calum Butcher", "response": ["Ten months later, Butcher made a surprise return to the first team in a 3–0 win over St Mirren. As a result, he switched position from defence to midfield, He managed to get a run of games in the team and scored his first goal for the club in a 2–1 defeat to St Johnstone, nearly a year on from the match where he was sent off. In the quarter-final of the Scottish Cup against Celtic, Butcher was involved in an incident, which resulted in teammate Paul Paton being sent-off, in a 1–1 draw. In the end, the Scottish FA decided not take action against Butcher, meaning that he was available to play in the Scottish League Cup Final. The Scottish FA's decision was to allow Butcher to play was criticised by Celtic. He started in the final, playing as a central-midfield, as Dundee United lost 2–0 to Celtic. His return to the first team saw him make fifteen appearances, scoring once in the 2014–15 season."]}, {"page": "Nadir Çiftçi", "response": ["He scored the first goal of his second season with Dundee United in a 2–1 home league win over Ross County on 23 August 2014, opening the scoring in the first half with a header from a Paul Paton free kick.  His next goal came three weeks later in a 2–2 draw with Hamilton Accies, but was sent off the same game just before half time after receiving two bookings.  Çiftçi continued to score regularly for United, and played a pivotal role in his side's 2–1 win league win over Celtic in December 2014. He was booked in the opening minute for a foul on Scott Brown, then opened the scoring four minutes later, taking advantage of Efe Ambrose's fresh-air swipe at a deflected Stuart Armstrong pass, and using his strength and close control to hold off the Celtic defender and fire a shot past Craig Gordon. He then provided the assist for United's second goal, crossing from the right wing to Armstrong who headed past Gordon in goal. Çiftçi finished the season with 16 goals in all competitions, and scored twice in the last game of the season, a 3–0 win over city rivals Dundee. This meant that he was the club's top scorer in both his seasons at Tannadice."]}, {"page": "2011–12 Partick Thistle F.C. season", "response": ["| || DF|| Paul Paton"]}]}}