{"wiki_id": "http://www.wikidata.org/entity/Q7153661", "itemLabel": "Paul Smith", "itemDescription": "English cricketer (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Smith_(cricketer,_born_1964)", "wikipedia_page": {"main": "Paul Andrew Smith born 15 April 1964 in Gosforth, Northumberland is a former English cricketer who played for Warwickshire from 1982 to 1996. He represented England in the Hong Kong and Singapore Sixes.\nA mercurial allrounder, Smith was a big-hitting right-handed batsman, and a genuinely fast right-arm bowler. He made four first-class hundreds in his 221-game career, the first when he was just 19, and in 1986 he became the youngest Warwickshire player to score 1,500 runs in a season. He was a key player in the side which won an unprecedented Treble in 1994 (County Championship, Sunday League, and Benson & Hedges trophy), taking the Man of the Match award in the final of the Benson & Hedges trophy against Worcestershire. The following year, in 1995, he again played an important role as Warwickshire completed the double of County Championship and Natwest Trophy. In all, Smith played in six Lord's one-day finals during his career.\nAlong with opening partner Andy Moles, Smith holds a world record, after the pair shared eight consecutive opening partnerships of 50-plus. In first-class cricket, he scored a total of 8,173 runs at 26.44, with a best of 140.  With the ball, he took 283 wickets at 35.72, which included two hat-tricks and a best of 6 for 91.  Always a potent force in the one-day game, able to turn a match with bat or ball, he won three titles with Warwickshire in the 50-over game, and won all domestic trophies several times. His one-day career saw him amass combined totals 4,430 runs and 234 wickets.\nLate in his career, Smith drew great pride from becoming the first white cricketer to play for Cape Town club St. Augustine’s during the dismantling of apartheid. This sprang directly from the recommendation of former Warwickshire coach, the late Bob Woolmer, and carried a cultural significance as St. Augustine’s C.C. had famously once been the cricketing home of the legendary Basil D’Oliviera.\nHe retired in 1996, and soon afterwards was quoted in a Sunday tabloid as having admitted to drug use in the latter stages of his career. The ECB subsequently banned him for two years.  Smith formed CWB (Cricket Without Boundaries) with Pertemps Group Chairman Tim Watts, with the aim of linking sport to the classroom and then employment. CWB saw a 40% participant return to work. Other projects he initiated included Coachright, who linked sport to academic accreditation. Over 150 schools and 20 community groups benefited from the initiative.\nHe struggled with life after cricket, and moved to America for a time, where he became involved with the Compton Cricket Club in Los Angeles, which seeks to use the spirit and disciplines of cricket to turn youngsters away from crime. This led to Smith being awarded a Certificate of Appreciation from Los Angeles City in 2003. He also works with the Prince's Trust in the U.K.\nIn 2007, Smith published a revealing autobiography entitled Wasted?, described by one reviewer as \"far from a conventional read\" and a work of \"refreshing honesty\".The book was nominated for the shortlist of the Sunday Times Newspaper Book of the Year Award.", "link_mentions": [{"page": "Brian Lara", "response": ["Lara holds several world records for high scoring. He has the highest individual score in both first-class cricket (501 not out for Warwickshire against Durham in 1994) and Test cricket (400 not out for the West Indies against England in 2004). Lara amassed his world record 501 in 474 minutes off only 427 balls. He hit 308 in boundaries (10 sixes and 62 fours). His partners were Roger Twose (115 partnership – 2nd wicket), Trevor Penney (314 – 3rd), Paul Smith (51 – 4th) and Keith Piper (322 unbroken – 5th). Earlier in that season Lara scored six centuries in seven innings while playing for Warwickshire."]}, {"page": "Paul Smith", "response": ["Paul Smith or Paul Smith's may refer to:", "* Paul Smith (composer) (1906–1985), American film music composer", "* Paul Smith (pianist) (1922–2013), Los Angeles jazz pianist", "* Paul Smith (rock vocalist) (born 1979), vocalist and songwriter of British indie rock band Maxïmo Park", "* Paul Smith (Christian music singer) (born 1953), American contemporary Christian music performer and songwriter", "* Paul Smith (music industry executive) (fl. 1985–present), British record label manager and art event producer", "* Paul Smith, drummer in the band Dengue Fever", "* Paul Smith (Irish writer) (1920–1997), writer and playwright", "* Paul Smith (television writer) (born 1961), British creator of television series and television writer", "* Paul Smith (blogger), 21st century British writer and creator of the Twitchhiker Project", "* Paul Smith (journalist) (fl. 2002–present), British football journalist", "* Paul Smith (historian) (born 1937), British historian of Victorian England", "* Paul Smith (Australian actor) (born 1968), starred in the Australian sitcom Hey Dad...!", "* Paul Smith (animator) (1906–1980), American animator and director best known for his work in Woody Woodpecker cartoons", "* Paul Smith (American actor, born 1929), American comic character actor", "* Paul Smith (artist) (1921–2007), American typewriter artist", "* Paul Smith (fashion designer) (born 1946), British fashion designer", "* Paul Smith (comics) (born 1953), American comic book artist", "* M. Paul Smith (fl. 1992–present), British paleontologist", "* Paul Smith (academic) (born 1954), British academic and cultural critic", "* Paul Smith (footballer, born 1954), English football player for Huddersfield Town and Cambridge United", "* Paul Smith (footballer, born 1962), Scottish football player and manager", "* Paul Smith (footballer, born 1964), English football player for Sheffield United, Port Vale and Lincoln City", "* Paul Smith (footballer, born 1967), English football player for Torquay United, Brentford and Bristol Rovers", "* Paul Smith (footballer, born 1971), English football player for Gillingham and Brentford", "* Paul Smith (footballer, born 22 January 1976), English football player for Burnley, Hartlepool United and Sheffield Wednesday", "* Paul Smith (footballer, born 25 January 1976), English football player for Lincoln City", "* Paul Smith (footballer, born 1979), goalkeeper currently at Southend United", "* Paul Smith (footballer, born 1991), English football player for Chester City and Barrow", "* Paul Smith (defensive end) (1945–2000), former NFL defensive end", "* Paul Smith (fullback) (born 1978), former NFL fullback", "* Paul Smith (quarterback) (born 1984), former college quarterback", "* Paul Smith (boxer) (born 1982), British professional boxer", "* Paul Smith (cricketer, born 1820) (1820–?), English cricketer", "* Paul Smith (cricketer, born 1964), English cricketer", "* Paul Smith (cricketer, born 1975), former English cricketer", "* Paul Smith (first baseman) (1931–2019), American baseball player", "* Paul Smith (outfielder) (1888–1958), American baseball player", "* Paul Smith (rugby league) (born 1969), Australian rugby league player", "* Paul Smith (racing driver) (born 1955), British former racing driver", "* Paul Smith (drift driver) (born 1980), British drift driver", "* Paul Smith (1825–1912), born Apollos Smith, founder of one of the first resorts in the Adirondacks, New York", "* Paul Smith (clergy) (born 1935), African-American Presbyterian minister", "* Paul Smith, founder of British motorist lobby group Safe Speed in 2001", "* Paul Smith's College, a private college in New York", "* Paul Smith's Electric Light and Power and Railroad Company Complex, a district on the National Register of Historic Places in Franklin County, New York", "* Paul Smith's Hotel, Brighton, New York", "* Paul Smiths, New York, a hamlet in the town of Brighton"]}, {"page": "Warwickshire County Cricket Club", "response": ["*    Paul Smith"]}, {"page": "Jesmond Park Academy", "response": ["*Paul Smith, Professional Cricketer"]}, {"page": "Compton Cricket Club", "response": ["In 2003, Warwickshire cricketer Paul Smith spent three weeks helping train the CCC. The trip was a part of Smith's work with 'Cricket Without Boundaries', a charity that seeks to empower communities through cricket.BBC Sport Website – Spreading the cricket gospel"]}, {"page": "Asif Din", "response": ["Asif's seventh and last one-day century was the most significant as it came in the final of the 1993 Natwest Trophy. Sussex batting first had set Warwickshire a target of 322 in 60 overs, Asif came to the wicket at 93/3 and shared partnerships first with Paul Smith and then Dermot Reeve to take his side to 306 by the time of his dismissal for 104. Warwickshire went on to win the match off the final ball and Asif was adjudged the man of the match.Sussex v Warwickshire, National Westminster Bank Trophy 1993 (Final), CricketArchive, Retrieved on 1 August 2009"]}, {"page": "Warwickshire County Cricket Club in 1994", "response": ["|| Paul Smith ||  || Right-handed || Right arm fast-medium || Warwickshire cap - 1986", "After winning the toss and batting first Somerset closed the first day on 255/5, the highest scorer being opener Mark Lathwell who made 86 in nearly four hours. Following his dismissal captain Andy Hayhurst and wicket-keeper Robert Turner shared a fifth wicket stand of 100 which was ended shortly before the close. Hayhurst completed a slow-paced century on the second day, before afternoon showers led to the hosts’ declaration. The wickets were shared amongst the Warwickshire bowlers but Richard Davis did take five catches, one short of a county fielding record. Warwickshire closed on 57 without loss. The third day witnessed no play because of rain so to generate a result both teams declared early on the final day leaving Warwickshire a fourth innings target of 321 from 95 overs. They were well placed on 87/1 at lunch but rain returned to wash out the afternoon session leaving the visitors 33 overs to score the 234 more needed to win. Brian Lara set about the unlikely chase by sharing partnerships of 74 in 9 overs with Paul Smith and then 126 in 14 overs with Asif Din. Lara reached his century, his fifth in consecutive innings, off 72 balls and was dismissed for 136 off 94. Warwickshire completed the victory with 20 balls remaining.", "Surrey chose to bowl first on a green pitch and made use of the conditions to reduce Warwickshire to 52/5. Paul Smith suffered injuries to his hand and elbow but batted on to score 34 in two hours while Graeme Welch and Dougie Brown (54) both scored maiden first-class fifties putting on 110 for the ninth wicket. Alec Stewart and Graham Thorpe (38) added 107 for the second wicket before losing five wickets to the medium pace of Roger Twose in a nine over spell on the first evening. The last four wickets fell inside half an hour on the second morning, Tim Munton took three of those while Twose took the other to finish with career best figures. Opener Andy Moles scored his first century of the season and with contributions from Brian Lara (44) and  Twose (31), Warwickshire built a substantial lead by the end of the second day. The best support came from Neil Smith who scored 57 and added 131 with Moles for the sixth wicket. Moles remained unbeaten, his innings breaking the record for the highest at the ground. By the close of the third day Surrey had lost five wickets. The lower order scored quickly on the final morning but could not prevent a heavy defeat. Munton and Neil Smith bowled throughout the final session, Munton took 5/96 to end with match figures of 9/137 and Smith took four wickets.", "| style=\"text-align:left;\" | Paul Smith || 11 || 313 || 22.35 || 65 || 0/1 || 182 || 18 || 33.00 || 3/24 || 2", "| style=\"text-align:left;\" | Paul Smith || 14 || 252 || 18.00 || 45 || 0/0 || 74.2 || 20 || 18.80 || 5.05 || 5/38 || 4"]}, {"page": "Michael Voss (cricketer)", "response": ["He also played first-class cricket for the Western Province first team, making his debut for the province against Transvaal in the 1990/91 Currie Cup. He made nine further first-class appearances for the province, the last of which came against Natal in the 1992/93 Castle Cup. In his ten first-class matches for the team, he scored 331 runs at an average of 17.42, with a high score of 56. It was for Western Province that he made his List A debut for against Eastern Province in the 1990/91 Benson and Hedges Series. He made seven further List A appearances for the province, the last of which came against Transvaal in the 1991/92 Benson and Hedges Series. In his eight List A appearances for the province, he scored 141 runs at an average of 17.62, with a high score of 41. In 1991, he played a single List A match in England for Hertfordshire in the NatWest Trophy against Warwickshire. He scored 2 runs in this match, before being dismissed by Paul Smith. Voss didn't feature in any Minor counties fixtures for the county."]}, {"page": "Jonathan Robinson (English cricketer)", "response": ["He later joined Bedfordshire, making his debut for the county in the 1994 MCCA Knockout Trophy against Suffolk. He played Minor counties cricket for Bedfordshire in 1994 and 1995, making eight Minor Counties Championship appearances and three MCCA Knockout Trophy appearances. He also made a single List A appearance for Bedfordshire in the 1994 NatWest Trophy against Warwickshire. In this match, he bowled eleven wicket-less overs, while with the bat he a fluent 67 runs before being dismissed by Paul Smith. Warwickshire won the match by 197 runs. Robinson later made two first-class appearances for the Marylebone Cricket Club. The first in 1999 against Sri Lanka A saw him make scores of 44 and 33, while the second against New Zealand A saw him make scores of 10 and 35."]}, {"page": "Ian Davidson (cricketer)", "response": ["Davidson made two first-class appearances for Lancashire.  The first came against Warwickshire at Edgbaston in the 1985 County Championship.  Winning the toss and electing to bat first, Lancashire made 148 all out, with Davidson scoring 13 runs before he was dismissed by Paul Smith.  In response, Warwickshire made 122 all out in their first-innings.  Lancashire then made 321 all out in their second-innings, during which Davidson was dismissed for a duck by Anton Ferreira.  Set 348 to win, Warwickshire reached their target with one wicket to spare, despite Davidson taking the wickets of Andy Lloyd and Alvin Kallicharran, claiming figures of 2/24.  His second appearance came against Jamaica at Sabina Park during Lancashire's 1987 tour there.  Winning the toss and electing to bat first, Lancashire were dismissed for just 97, with Davidson scoring a single run before he was dismissed by Nehemiah Perry.  In response, Jamaica made 264/9 declared in their first-innings, with Davidson taking the wickets of Robert Haynes and Ken McLeod, finishing the innings with figures of 2/61.  Lancashire then made 201 all out in their second-innings, during which Davidson was dismissed once again by Perry for 0.  Set 35 to win, Jamaica reached their target with nine wickets to spare."]}, {"page": "List of cricketers' biographies and autobiographies", "response": ["| 2007 || Wasted? || Paul Smith || Paul Smith"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Paul Smith (1982–1996) : P. A. Smith (221)"]}, {"page": "List of doping cases in sport (S)", "response": ["|Paul Smith"]}, {"page": "Cannabis and sports", "response": ["While touring New Zealand in 1996–1997, a restaurant in Christchurch accused Phil Tufnell of smoking cannabis in their bathroom. As the restaurant had a reputation for making up stories about celebrities, the English team's management agreed with Tufnell's denials. Paul Smith retired in 1997 and acknowledged using cannabis; despite his retirement, the ECB suspended him for 22 months. In 2001, five South African players, Roger Telemachus, André Nel, Paul Adams, Justin Kemp, and Herschelle Gibbs, were caught smoking it at a party. They were fined R10,000. Dermot Reeve revealed that he was addicted to cocaine in 2005, and also acknowledged that he had used cannabis during the 1990s while he was an active player, but said that he never used it during the cricket season. In May 2005, Keith Piper of the Warwickshire County Cricket Club was suspended for the remainder of the season for cannabis. Also in 2005, an Australian cricket team from Inverloch provided chocolate cupcakes to a team from Nerrina and did not inform them that they contained cannabis."]}]}}