{"wiki_id": "http://www.wikidata.org/entity/Q7150543", "itemLabel": "Paul Evans", "itemDescription": "British poet, born 1945", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Evans_(poet)", "wikipedia_page": {"main": "Paul Evans (1945 – 1991) was a Welsh poet associated with the British Poetry Revival.  He is included in the anthology British Poetry since 1945 and the 1969 anthology Children of Albion: Poetry of the Underground in Britain.\nHis work has been described as similar to that of Lee Harwood, with a dreamy tone and surrealist images.  His poems have no definite meaning, but alter each time they are read.", "link_mentions": [{"page": "Fulcrum Press", "response": ["Montgomery published Basil Bunting's Loquitur (1965), First Book of Odes (1965), Ode II/2 (1965), his landmark Briggflatts: An Autobiography (1966) and the same poet's Collected Poems (1968). It produced about forty books by more than twenty poets, including Pete Brown, Ed Dorn (Gunslinger 1 & 2, 1970), Robert Duncan, Larry Eigner, Paul Evans, Roy Fisher, Ian Hamilton Finlay, Donald Gardner (born 1938, For the flames, 1974), Allen Ginsberg, Michael Hamburger, Lee Harwood, Spike Hawkins, Alan Jackson, David Jones, Christopher Middleton, Lorine Niedecker, Jeff Nuttall, George Oppen, Tom Pickard (with a preface by Bunting), Omar S. Pound, F. T. Prince, Tom Raworth, Jerome Rothenberg and Gary Snyder. Stuart Montgomery published two books of his own poems, Circe (1969) and Shabby Sunshine (1973), and his medical study Measures of Depression (1978)."]}, {"page": "British Poetry since 1945", "response": ["A. Alvarez - Kingsley Amis - George Barker - Patricia Beer - Martin Bell - Francis Berry - John Betjeman - D. M. Black - Thomas Blackburn - Alan Bold - Alan Brownjohn - Basil Bunting - Miles Burrows - Charles Causley - Barry Cole - Tony Connor - Iain Crichton Smith - Peter Dale - Donald Davie - Lawrence Durrell - D. J. Enright - Paul Evans - Ian Hamilton Finlay - Roy Fisher - John Fuller - Roy Fuller - Robert Garioch - David Gascoyne - Karen Gershon - Henry Graham - W. S. Graham - Robert Graves - Harry Guest - Thom Gunn - Michael Hamburger - Ian Hamilton Finlay - Lee Harwood - Spike Hawkins - Seamus Heaney - John Heath-Stubbs - Adrian Henri - Geoffrey Hill - Philip Hobsbaum - Anselm Hollo - Ted Hughes - Elizabeth Jennings - Brian Jones - David Jones - Philip Larkin - Peter Levi - Christopher Logue - Edward Lucie-Smith - George MacBeth - Norman MacCaig - Hugh MacDiarmid - Roger McGough - George Mackay Brown - Louis MacNeice - Barry MacSweeney - Derek Mahon - Matthew Mead - Christopher Middleton - Adrian Mitchell - Dom Moraes - Edwin Morgan - Edwin Muir - Jeff Nuttall - Stewart Parker - Brian Patten - Sylvia Plath - Peter Porter - Tom Raworth - Peter Redgrove - Jon Silkin - Stevie Smith - Bernard Spencer - Jon Stallworthy - Nathaniel Tarn - Dylan Thomas - D. M. Thomas - Anthony Thwaite - Charles Tomlinson - Rosemary Tonks - Gael Turnbull - Vernon Watkins - David Wevill", "Paul Evans - Spike Hawkins - Anselm Hollo - Barry MacSweeney - Stewart Parker - Rosemary Tonks"]}, {"page": "Alice Hunt Bartlett Prize", "response": ["* 1972: Paul Evans for February"]}, {"page": "Second Aeon", "response": ["Edwin Morgan, Peter Mayer, Harry Guest, Gene Fowler, Alan Bold, Barry MacSweeney, Alan Perry, Gary Snyder, Paul Evans, and others."]}, {"page": "Paul Evans", "response": ["Paul Evans may refer to:", "*Paul Evans (Australian footballer) (born 1978), Port Adelaide AFL footballer", "*Paul Evans (basketball) (born 1945), American college basketball coach", "*Paul Evans (football manager), English football assistant manager and coach and ex goalkeeper", "*Paul Evans (footballer, born 1964), English footballer", "*Paul Evans (soccer, born 1973), South African football player", "*Paul Evans (footballer, born 1974), Welsh football player", "*Paul Evans (ice hockey, born 1954), Canadian ice hockey player who played for the Philadelphia Flyers", "*Paul Evans (ice hockey, born 1955), Canadian ice hockey player who played for the Toronto Maple Leafs", "*Paul Evans (runner) (born 1961), British runner", "*Paul Evans (Oregon politician), American politician who served in the Oregon House of Representatives", "*Paul Evans (Illinois politician), American politician, member of the Illinois House of Representatives", "*Paul Evans Aidoo (born 1958), Ghanaian teacher and politician", "*Paul Evans (musician) (born 1938), American rock and roll singer/songwriter", "*Paul Evans (poet) (born 1945), British poet", "*Paul Evans (RAF officer) (born 1954), British military officer and medical doctor", "*Paul Evans,  American pastor and radio host of Haven of Rest", "*Paul Evans (brand), a New York City-based menswear brand"]}, {"page": "List of people with surname Evans", "response": ["**John Paul Evans (born 1954), Canadian ice hockey player", "*Paul Evans (disambiguation), multiple people", "**Paul Evans (musician) (born 1938), American rock and roll singer/songwriter from the 1950s", "**Paul Evans (poet) (born 1945), British poet", "**Paul Evans (ice hockey, born 1954), Canadian ice hockey player in the NHL who played for the Philadelphia Flyers", "**Paul Evans (ice hockey, born 1955), Canadian ice hockey player in the NHL who played for the Toronto Maple Leafs", "**Paul Evans (athlete) (born 1961), British Olympic runner", "**Paul Evans (footballer, born 1973), South African football player", "**Paul Evans (footballer, born 1974), Welsh football player", "**Paul Evans (Australian footballer) (born 1978), Port Adelaide AFL footballer", "**Paul Evans (basketball), American college basketball coach", "**Paul Evans (football assistant manager), English football assistant manager and coach and ex goalkeeper", "**Paul Evans (Illinois politician), Republican member of the Illinois House of Representatives", "**Richard Paul Evans (born 1962), American author of books with Christian themes"]}, {"page": "1969 in poetry", "response": ["* Paul Evans"]}]}}