{"wiki_id": "http://www.wikidata.org/entity/Q7153498", "itemLabel": "Paul Scott", "itemDescription": "cricketer (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Scott_(cricketer)", "wikipedia_page": {"main": "Stephen Paul Scott (born 18 February 1962) is an English former cricketer. Scott was a right-handed batsman who bowled right-arm medium pace. He was born in Newcastle upon Tyne, Northumberland and later studied at University of Manchester.\nScott made his debut for Northumberland in the 1986 Minor Counties Championship against Hertfordshire. Scott played Minor counties cricket for Northumberland from 1986 to 1988, which included 9 Minor Counties Championship appearances and 2 MCCA Knockout Trophy matches. He made his List A debut against Essex in the 1986 NatWest Trophy. In this match, he took wickets of Chris Gladwin and Keith Pont for the cost of 55 runs from 12 overs. In the Northumberland innings, he wasn't required to bat. He made a further List A appearance, again against Essex, in the 1987 NatWest Trophy. He bowled 5 wicket-less overs in this match, while with the ended Northumberland's innings unbeaten on 0.", "link_mentions": [{"page": "Paul Scott", "response": ["Paul Scott may refer to:", "*Paul Scott (novelist) (1920–1978), English novelist, playwright, and poet", "*Paul Scott (comics), English comic book writer", "*Paul Scott (cricketer) (born 1962), English cricketer", "*Paul Scott (footballer, born 1979), English football player for Huddersfield, Bury and Morecambe", "*Paul Scott (footballer, born 1985), English football player for Burnley", "*Paul Scott (poet), British poet", "*Paul Scott (rugby union), South African rugby union player", "*Paul Scott (politician), American state senator from Oklahoma", "*Paul Scott (decathlete) (born 1970), Australian decathlete and competitor at the 1991 World Championships"]}, {"page": "List of Northumberland County Cricket Club List A players", "response": ["*Paul Scott, 2 matches, 1986–1987"]}]}}