{"wiki_id": "http://www.wikidata.org/entity/Q7167288", "itemLabel": "Percy Collick", "itemDescription": "British politician (1897-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Collick", "wikipedia_page": {"main": "Percy Henry Collick (16 November 1897 – 24 July 1984) was a British Labour Party politician and trade union official.\nOriginally a railway fireman with the Southern Railway, he was a member of the Associated Society of Locomotive Engineers and Firemen, serving as organising secretary from 1934 to 1940 and assistant general secretary from 1940 to his retirement in 1957.\nHe was an unsuccessful candidate at the 1929 general election in the safe Conservative constituency of Reigate in Surrey, coming third with 20.9% of the votes. He stood again in Reigate at the 1931 general election, when there was no Liberal candidate, and he came second with only 17.3% of the vote, a Conservative majority of over 65%. He did not contest the 1935 general election.\nIn the Labour landslide at the 1945 general election, he was elected as Member of Parliament for the Merseyside constituency of Birkenhead West, overturning the previous Conservative majority of 3,753 with a swing of 13.2%.\nHis constituency was abolished in boundary changes for the 1950 general election, and he was returned for the new Birkenhead constituency. He held the seat until he retired from the House of Commons at the 1964 general election.\nIn Clement Attlee's post-war Labour government, he served as Parliamentary Secretary to the Ministry of Agriculture and Fisheries from 1945 to 1947.", "link_mentions": [{"page": "Associated Society of Locomotive Engineers and Firemen", "response": [":1939: Percy Collick"]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Percy Collick"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Percy Collick"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Percy Collick"]}, {"page": "Birkenhead (UK Parliament constituency)", "response": ["| Percy Collick"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Percy Collick"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Percy Collick"]}, {"page": "Attlee ministry", "response": ["|Percy Collick||5 September 1945 – 7 October 1947|| "]}, {"page": "Modern Records Centre, University of Warwick", "response": ["*Percy Collick, assistant general secretary of ASLEF and Labour MP"]}, {"page": "Birkenhead West (UK Parliament constituency)", "response": ["| Percy Collick"]}, {"page": "Percy Henry Collick", "response": ["#REDIRECT Percy Collick"]}, {"page": "Parliamentary Secretary to the Board of Agriculture and Fisheries", "response": ["*1945-1947 Percy Collick (jointly)"]}, {"page": "Hope (painting)", "response": ["Despite the steep decline in Watts's popularity, Hope continued to hold a place in popular culture, and there remained those who considered it a major work. When the Tate Gallery held an exhibition of its Watts holdings in 1954, trade unionist and left-wing M.P. Percy Collick urged \"Labour stalwarts\" to attend the exhibition, supposedly privately recounting that he had recently met a Viennese Jewish woman who during \"the terrors of the Nazi War\" had drawn \"renewed faith and hope\" from her photographic copy. Meanwhile, an influential 1959 sermon by Martin Luther King Jr., now known as Shattered Dreams, took Hope as a symbol of frustrated ambition and the knowledge that few people live to see their wishes fulfilled, arguing that \"shattered dreams are a hallmark of our mortal life\", and against retreating into either apathetic cynicism, a fatalistic belief in God's will or escapist fantasy in response to failure."]}, {"page": "Collick", "response": ["*Percy Collick (1897–1984), British politician and trade union official"]}]}}