{"wiki_id": "http://www.wikidata.org/entity/Q716584", "itemLabel": "Archibald Sayce", "itemDescription": "British Assyriologist and linguist", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Sayce", "wikipedia_page": {"main": "The Rev. Archibald Henry Sayce (25 September 1845 – 4 February 1933), was a pioneer British Assyriologist and linguist, who held a chair as Professor of Assyriology at the University of Oxford from 1891 to 1919. He was able to write in at least twenty ancient and modern languages, and was known for his emphasis on the importance of archaeological and monumental evidence in linguistic research. He was a contributor to articles in the 9th, 10th and 11th editions of the Encyclopædia Britannica.", "link_mentions": [{"page": "Demon", "response": ["According to The Jewish Encyclopedia, originally published in 12 volumes from 1901 to 1906, \"In Chaldean mythology the seven evil deities were known as shedu, storm-demons, represented in ox-like form.\" They were represented as winged bulls, derived from the colossal bulls used as protective jinn of royal palaces.See Delitzsch, Assyrisches Handwörterbuch. pp. 60, 253, 261, 646; Jensen, Assyr.-Babyl. Mythen und Epen, 1900, p. 453; Archibald Sayce, l.c. pp. 441, 450, 463; Lenormant, l.c. pp. 48–51."]}, {"page": "February 4", "response": ["*1933 – Archibald Sayce, English linguist and educator (born 1846)"]}, {"page": "Gilgamesh", "response": ["The first modern literary adaptation of the Epic of Gilgamesh was Ishtar and Izdubar (1884) by Leonidas Le Cenci Hamilton, an American lawyer and businessman. Hamilton had rudimentary knowledge of Akkadian, which he had learned from Archibald Sayce's 1872 Assyrian Grammar for Comparative Purposes. Hamilton's book relied heavily on Smith's translation of the Epic of Gilgamesh, but also made major changes. For instance, Hamilton omitted the famous flood story entirely and instead focused on the romantic relationship between Ishtar and Gilgamesh. Ishtar and Izdubar expanded the original roughly 3,000 lines of the Epic of Gilgamesh to roughly 6,000 lines of rhyming couplets grouped into forty-eight cantos. Hamilton significantly altered most of the characters and introduced entirely new episodes not found in the original epic. Significantly influenced by Edward FitzGerald's Rubaiyat of Omar Khayyam and Edwin Arnold's The Light of Asia, Hamilton's characters dress more like nineteenth-century Turks than ancient Babylonians. Hamilton also changed the tone of the epic from the \"grim realism\" and \"ironic tragedy\" of the original to a \"cheery optimism\" filled with \"the sweet strains of love and harmony\"."]}, {"page": "Hittites", "response": ["As the discoveries in the second half of the 19th century revealed the scale of the Hittite kingdom, Archibald Sayce asserted that, rather than being compared to Judah, the Anatolian civilization \"[was] worthy of comparison to the divided Kingdom of Egypt\", and was \"infinitely more powerful than that of Judah\".The Hittites: the story of a forgotten empire By Archibald Henry Sayce Queen's College, Oxford. October 1888. Introduction Sayce and other scholars also noted that Judah and the Hittites were never enemies in the Hebrew texts; in the Book of Kings, they supplied the Israelites with cedar, chariots, and horses, and in the Book of Genesis were friends and allies to Abraham. Uriah the Hittite was a captain in King David's army and counted as one of his \"mighty men\" in 1 Chronicles 11."]}, {"page": "Lilith", "response": ["Archibald Sayce (1882)Sayce (1887)  considered that Hebrew  (or )  and the earlier Akkadian  are derived from Proto-Semitic. Charles Fossey (1902) has this literally translating to \"female night being/demon\", although cuneiform inscriptions from Mesopotamia exist where Līlīt and Līlītu refers to disease-bearing wind spirits.Fossey (1902) ", "* Archibald Sayce, Hibbert Lectures on Babylonian Religion 1887."]}, {"page": "Solomon Schechter", "response": ["Jacob Saphir was the first Jewish researcher to recognize the significance of the Cairo Geniza, as well as the first to publicize the existence of the Midrash ha-Gadol. Schechter was alerted to the existence of the Geniza's papers in May 1896 by two Scottish sisters, Agnes and Margaret Smith (also known as Mrs. Lewis and Mrs. Gibson), who showed him some leaves from the Geniza that contained the Hebrew text of Sirach, which had for centuries only been known in Greek and Latin translation.Soskice, Janet (2010) Sisters of Sinai.  London: Vintage, 239–40 Letters, written at Schechter's prompting, by Agnes Smith to The Athenaeum and The Academy quickly revealed the existence of another nine leaves of the same manuscript in the possession of Archibald Sayce at University of Oxford. Schechter quickly found support for another expedition to the Cairo Geniza, and arrived there in December 1896 with an introduction from the Chief Rabbi, Hermann Adler, to the Chief Rabbi of Cairo, Aaron Raphael Ben Shim'on.Soskice, Janet (2010) Sisters of Sinai.  London: Vintage, 246 He carefully selected for the Cambridge University Library a trove three times the size of any other collection: this is now part of the Taylor-Schechter Collection.  The find was instrumental in Schechter resolving a dispute with David Margoliouth as to the likely Hebrew language origins of Sirach.Soskice, Janet (2010) Sisters of Sinai.  London: Vintage, 240–41"]}, {"page": "Indus Valley Civilisation", "response": ["In the next issue, a week later, the British Assyriologist Archibald Sayce was able to point to very similar seals found in Bronze Age levels in Mesopotamia and Iran, giving the first strong indication of their date; confirmations from other archaeologists followed. Systematic excavations began in Mohenjo-daro in 1924–25 with that of K. N. Dikshit, continuing with those of H. Hargreaves (1925–1926), and Ernest J. H. Mackay (1927–1931). By 1931, much of Mohenjo-daro had been excavated, but occasional excavations continued, such as the one led by Mortimer Wheeler, a new director-general of the ASI appointed in 1944, and including Ahmad Hasan Dani."]}, {"page": "Sumer", "response": ["According to Archibald Sayce, the primitive pictograms of the early Sumerian (i.e. Uruk) era suggest that \"Stone was scarce, but was already cut into blocks and seals. Brick was the ordinary building material, and with it cities, forts, temples and houses were constructed. The city was provided with towers and stood on an artificial platform; the house also had a tower-like appearance. It was provided with a door which turned on a hinge, and could be opened with a sort of key; the city gate was on a larger scale, and seems to have been double. The foundation stones—or rather bricks—of a house were consecrated by certain objects that were deposited under them.\""]}, {"page": "Tribe of Zebulun", "response": ["In the ancient Song of Deborah, Zebulun are described as sending to the battle those that handle the sopher shebet. Traditionally this has been interpreted as referring to the \"rod of the scribe\", an object that in Assyrian monuments was a stylus of wood or metal used to inscribe clay tablets, or to write on papyrus; thus, those who wielded it would have been the associates/assistants of lawgivers.Archibald Sayce Consequently, in Jewish tradition, the tribe of Zebulun was considered to have a symbiotic relationship with the tribe of Issachar, its neighbour and a tribe that traditionally was seen as having many scholars, whereby Zebulun would financially support Issachar's devotion to study and teaching of the Torah, in exchange for a share of the spiritual reward from such learning; the terms Issachar and Zebulun came to be used by Jews for anyone engaged in such a relationship. More recent Christian scholarship, as expressed for example in translations such as the Revised Standard Version, instead render the description in the Song of Deborah of the people sent to battle by Zebulun as \"those who handle the marshal's staff\"; in other words, Zebulun had simply sent military officers."]}, {"page": "Shalman (Bible)", "response": ["Shalman ( Šalman) is an individual, presumably a king, that is mentioned in Hosea 10:14 as having sacked the city of Beth-Arbel. He is usually identified with the Assyrian kings Shalmaneser II (by Archibald Sayce) or IV (by François Lenormant)."]}, {"page": "Architecture of Mesopotamia", "response": ["The study of ancient Mesopotamian architecture is based on available archaeological evidence, pictorial representation of buildings, and texts on building practices. According to Archibald Sayce, the primitive pictographs of the Uruk period era suggest that \"Stone was scarce, but was already cut into blocks and seals. Brick was the ordinary building material, and with it cities, forts, temples and houses were constructed. The city was provided with towers and stood on an artificial platform; the house also had a tower-like appearance. It was provided with a door which turned on a hinge, and could be opened with a sort of key; the city gate was on a larger scale, and seems to have been double. ... Demons were feared who had wings like a bird, and the foundation stones – or rather bricks – of a house were consecrated by certain objects that were deposited under them.\"Sayce, Rev. A. H., Professor of Assyriology, Oxford, \"The Archaeology of the Cuneiform Inscriptions\", Second Edition-revised, 1908, Society for Promoting Christian Knowledge, London, Brighton, New York; at pages 98–100 Not in copyright"]}, {"page": "List of events named massacres", "response": ["|Massacre of the Jews of Granada (1906)called \"massacre of the Jews of Granada\" by Archibald Sayce in Ancient empires of the East (1906), p. 417."]}, {"page": "Imperial examination", "response": ["Englishmen in the 18th century such as Eustace Budgell recommended imitating the Chinese examination system. Adam Smith recommended examinations to qualify for employment in 1776.Smith, Adam, An Inquiry into the Nature and Causes of the Wealth of Nations Project Gutenberg : (Book V: Chapter I: Part III) In 1838, the Congregational church missionary Walter Henry Medhurst considered the Chinese exams to be \"worthy of imitating.\" In 1806, the British established a Civil Service College near London for training of the East India Company's administrators in India. This was based on the recommendations of British East India Company officials serving in China and had seen the Imperial examinations. In 1829, the company introduced civil service examinations in India on a limited basis. This established the principle of qualification process for civil servants in England.Bodde, Derk, Chinese Ideas in the West Committee on Asiatic Studies in American Education  In 1847 and 1856, Thomas Taylor Meadows strongly recommended the adoption of the Chinese principle of competitive examinations in Great Britain. Both Thomas Babington Macaulay, who was instrumental in passing the Saint Helena Act 1833, and Stafford Northcote, 1st Earl of Iddesleigh, who prepared the Northcote–Trevelyan Report that catalyzed the British civil service, were familiar with Chinese history and institutions. When the report was brought up in parliament in 1853, Lord Monteagle argued against the implementation of open examinations because it was a Chinese system and China was not an \"enlightened country.\" Lord Stanley called the examinations the \"Chinese Principle.\" The Earl of Granville did not deny this but argued in favor of the examination system, considering that the minority Manchus had been able to rule China with it for over 200 years. In 1854, Edwin Chadwick reported that some noblemen did not agree with the measures introduced because they were Chinese. The examination system was finally implemented in the British Indian Civil Service in 1855, prior to which admission into the civil service was purely a matter of patronage, and in England in 1870. Even as late as ten years after the competitive examination plan was passed, people still attacked it as an \"adopted Chinese culture.\" Alexander Baillie-Cochrane, 1st Baron Lamington insisted that the English \"did not know that it was necessary for them to take lessons from the Celestial Empire.\" In 1875, Archibald Sayce voiced concern over the prevalence of competitive examinations, which he described as \"the invasion of this new Chinese culture.\""]}, {"page": "Arabic grammar", "response": ["The schools of Basra and Kufa further developed grammatical rules in the late 8th century with the rapid rise of Islam.Goodchild, Philip. Difference in Philosophy of Religion, 2003. Page 153.Archibald Sayce, Introduction to the Science of Language. Pg. 28, 1880. From the school of Basra, generally regarded as being founded by Abu Amr ibn al-Ala,al-Aṣmaʿī at the Encyclopædia Britannica Online. ©2013 Encyclopædia Britannica, Inc.. Accessed 10 June 2013. two representatives laid important foundations for the field: Al-Khalil ibn Ahmad al-Farahidi authored the first Arabic dictionary and book of Arabic prosody, and his student Sibawayh authored the first book on theories of Arabic grammar. From the school of Kufa, Al-Ru'asi is universally acknowledged as the founder, though his own writings are considered lost,Encyclopaedia of Islam, vol. 5, pg. 174, fascicules 81-82. Eds. Clifford Edmund Bosworth, E. van Donzel, Bernard Lewis and Charles Pellat. Leiden: Brill Publishers, 1980. Arik Sadan, The Subjunctive Mood in Arabic Grammatical Thought, pg. 339. Volume 66 of Studies in Semitic Languages and Linguistics. Leiden: Brill Publishers, 2012.  with most of the school's development undertaken by later authors. The efforts of al-Farahidi and Sibawayh consolidated Basra's reputation as the analytic school of grammar, while the Kufan school was regarded as the guardian of Arabic poetry and Arab culture. The differences were polarizing in some cases, with early Muslim scholar Muhammad ibn `Isa at-Tirmidhi favoring the Kufan school due to its concern with poetry as a primary source.\"Sibawayh, His Kitab, and the Schools of Basra and Kufa.\" Taken from Changing Traditions: Al-Mubarrad's Refutation of Sībawayh and the Subsequent Reception of the Kitāb, pg. 12. Volume 23 of Studies in Semitic Languages and Linguistics. Ed. Monique Bernards. Leiden: Brill Publishers, 1997. "]}, {"page": "Horites", "response": ["According to Archibald Sayce (1915), the Horites have been identified with references in Egyptian inscriptions to Khar (formerly translated as Harri), which concern a southern region of Canaan.James Orr, \"Horites\", in The International Standard Bible Encyclopedia, (1915) page 1421. More recent scholarship has associated them with the Hurrians."]}, {"page": "George Smith (Assyriologist)", "response": ["In November 1873 Smith again left England for Nineveh for a second expedition, this time at the expense of the Museum, and continued his excavations at the tell of Kouyunjik (Nineveh). An account of his work is given in Assyrian Discoveries, published early in 1875. The rest of the year was spent in fixing together and translating the fragments relating to the creation, the results of which were published in The Chaldaean Account of Genesis (1880, co-written with Archibald Sayce)."]}, {"page": "Meroë", "response": ["Meroë was the base of a flourishing kingdom whose wealth was centered around a strong iron industry, as well as international trade involving India and China. Metalworking is believed to have gone on in Meroë, possibly through bloomeries and blast furnaces, and Archibald Sayce reportedly referred to it as \"the Birmingham of Africa\", because of perceived vast production and trade of iron (a contention that is a matter of debate in modern scholarship)."]}, {"page": "Biblical Hittites", "response": ["Because of the perceived discrepancy between the picture of the Hittites as developed in the Bible and the archaeological discoveries, some biblical scholars reject Archibald Sayce's identification of the two peoples, and believe that the similarity in names is only a coincidence. For example E. A. Speiser, referring to \"the children of Heth\" in the Book of Genesis writes \"For reasons of both history and geography, it is most unlikely that this group name has any direct connection either with the Hattians of Anatolia or with their 'Hittite' successors.\""]}, {"page": "William Robertson Smith", "response": ["*On the cutting edge of biblical scholarship, this work builds on a narrower study by his friend professor Julius Wellhausen, Reste Arabischen Heidentums (Berlin 1887), and on other works on the religious history of the region and in general. (Smith's Preface).Not mentioned by Smith are prior publications concerning the nascent anthropology, for example: J. J. Bachofen, Das Mutterrecht (1861); Fustel de Coulanges, Le Cité antique (1864); and, Edward Tylor, Researches into the Early History of Mankind (1865). The author also employs analogies drawn from James George Frazer,Frazer soon would publish his The Golden Bough (1890). to apply where insufficient data existed for the ancient Semites. (Smith's Preface). Hence Smith's methodology was soon criticized by Theodor Nöldeke.Also on account of method Smith was criticized by other contemporaries: Archibald Sayce, and Marie-Joseph Lagrange. Bediako, Primal Religion and the Bible (1997) at 305, n.3."]}, {"page": "Meshech", "response": ["According to Archibald Sayce, Meshech can be identified with Muska, a name appearing in Assyrian inscriptions, and generally believed to refer to the Mushki."]}, {"page": "Diauehi", "response": ["Archibald Sayce suggested that Daiaeni was named after an eponymous founder, Diaus, and thus meant \"people of the land/tribe of Diau(s)\".A.H. Sayce. Cambridge Ancient History, vol. XX. (1925). pp. 169–186. ", "Diau(s) (possible founder/patriarch suggested by Archibald Sayce)"]}, {"page": "Archibald Henry Sayce", "response": ["#REDIRECT Archibald Sayce"]}, {"page": "Archibald H. Sayce", "response": ["#REDIRECT Archibald Sayce"]}, {"page": "Sayce", "response": ["*Archibald Sayce (1846–1933), British linguist and Assyriologist"]}, {"page": "Siloam inscription", "response": ["As the inscription was unreadable at first due to the deposits, Professor Archibald Sayce was the first to make a tentative reading, and later the text was cleaned with an acid solution making the reading more legible. The inscription contains 6 lines, of which the first is damaged. The words are separated by dots. Only the word zada on the third line is of doubtful translation—perhaps a crack or a weak part."]}, {"page": "E. A. Wallis Budge", "response": ["During his years in the British Museum, Budge also sought to establish ties with local antiquities dealers in Egypt and Iraq so that the museum could buy antiquities from them, and avoid the uncertainty and cost of excavating. This was a 19th-century approach to building a museum collection, and it was changed markedly by more rigorous archaeological practices, technology and cumulative knowledge about assessing artefacts in place. Budge returned from his many missions to Egypt and Iraq with large collections of cuneiform tablets; Syriac, Coptic and Greek manuscripts; as well as significant collections of hieroglyphic papyri. Perhaps his most famous acquisitions from this time were the Papyrus of Ani, a Book of the Dead; a copy of Aristotle's lost Constitution of Athens, and the Amarna letters. Budge's prolific and well-planned acquisitions gave the British Museum arguably the best Ancient Near East collections in the world, at a time when European museums were competing to build such collections. In 1900 the Assyriologist Archibald Sayce said to Budge, \"What a revolution you have effected in the Oriental Department of the Museum!  It is now a veritable history of civilization in a series of object lessons\"."]}, {"page": "Shirehampton", "response": ["*Archibald Sayce (1846–1933), Professor of Assyriology at Oxford University from 1891 to 1919, was born in Shirehampton. He was an extremely productive scholar with many significant publications."]}, {"page": "Alexander Henry Sayce", "response": ["#REDIRECT Archibald Sayce"]}]}}