{"wiki_id": "http://www.wikidata.org/entity/Q7167239", "itemLabel": "Percy Barstow", "itemDescription": "British politician (1883-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Barstow", "wikipedia_page": {"main": "Percy Gott Barstow (23 October 1883 – 2 January 1969) was a Labour Party politician in Great Britain.\nBorn in Pontefract, Barstow was educated at Leeds Higher Grade School, then followed his father in becoming an engine driver.  Unlike many engine drivers, he chose to join the National Union of Railwaymen (NUR), and from 1906 he worked full-time as a clerk at the union's headquarters.  In 1913, he was promoted to become a departmental manager at the union, then in 1934 became its office manager.Barstow stood unsuccessfully in Barrow-in-Furness at the 1935 United Kingdom general election.  He was elected as Member of Parliament (MP) for Pontefract at the 1941 Pontefract by-election following the death of Adam Hills.  He was elected unopposed and held the seat until the 1950 General Election.\nPercy Barstow entered the House of Commons on 29 July 1941, and made his maiden speech during the War Situations Debate on 25 February 1942.", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Percy Barstow"]}, {"page": "List of United Kingdom MPs: B", "response": ["*Percy Barstow (1941–1950)"]}, {"page": "Carlisle (UK Parliament constituency)", "response": ["* Labour: Percy BarstowReport of the Annual Conference of the Labour Party, 1939."]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Percy Barstow"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Percy Barstow, Pontefract, 1941–50"]}, {"page": "Pontefract (UK Parliament constituency)", "response": ["| Percy Barstow"]}, {"page": "1941 Pontefract by-election", "response": ["The Labour candidate, Percy Barstow, was returned unopposed."]}, {"page": "Percy Gott Barstow", "response": ["#REDIRECT Percy Barstow"]}, {"page": "Barstow (surname)", "response": ["*Percy Barstow (1883–1969), UK Member of Parliament 1941–1950"]}, {"page": "1933 Clay Cross by-election", "response": ["Unusually, the Constituency Labour Party asked for nominations for the vacancy, and published the list: Percy Barstow of the National Union of Railwaymen, former leader of the party Arthur Henderson, Samuel Sales of the Derbyshire Miners' Association, and Ben Smith, former Member of Parliament for Rotherhithe.  Henderson was chosen as the party's candidate, and Herbert Drinkwater acted as his election agent."]}]}}