{"wiki_id": "http://www.wikidata.org/entity/Q716834", "itemLabel": "Prideaux John Selby", "itemDescription": "English ornithologist, botanist and illustrator (1788–1867)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prideaux_John_Selby", "wikipedia_page": {"main": "Prideaux John Selby FRSE FLS (23 July 1788 – 27 March 1867) was an English ornithologist, botanist and natural history artist.", "link_mentions": [{"page": "List of biologists", "response": ["*Prideaux John Selby (1788–1867), English botanistAbbreviation in zoology: Selby; abbreviation in botany: P.Selby and ornithologist, best known for his Illustrations of British Ornithology"]}, {"page": "Bamburgh", "response": ["*Prideaux John Selby"]}, {"page": "Lovebird", "response": ["The genus Agapornis was introduced by the English naturalist Prideaux John Selby in 1836. The name combines the Ancient Greek αγάπη agape meaning \"love\" and όρνις ornis meaning \"bird\". The type species is the black-collared lovebird (Agapornis swindernianus). The genus contains nine species of which five are monotypic and four are divided into subspecies. They are native to mainland Africa and the island of Madagascar. In the wild, the different species are separated geographically.", "Category:Taxa named by Prideaux John Selby"]}, {"page": "List of botanists", "response": ["*Prideaux John Selby"]}, {"page": "Alnwick", "response": ["*Prideaux John Selby (1788–1867), ornithologist, botanist and artist"]}, {"page": "Brahminy kite", "response": ["In 1760, French zoologist Mathurin Jacques Brisson described and illustrated the Brahminy kite in the first volume of his Oiseaux based on a specimen collected in Pondicherry, India. He used the French name L'aigle de Pondichery. The brahminy kite was included by the French polymath Georges-Louis Leclerc, Comte de Buffon in his Histoire Naturelle des Oiseaux. It was also illustrated in a hand-coloured plate engraved by François-Nicolas Martinet in the Planches Enluminées D'Histoire Naturelle which was produced under the supervision of Edme-Louis Daubenton to accompany Buffon's text.  Neither Brisson nor Buffon included a scientific name but in 1783 the Dutch naturalist Pieter Boddaert coined the binomial name Falco indus in his catalogue of the Planches Enluminées. The brahminy kite is now placed with the whistling kite in the genus Haliastur that was erected by the English naturalist Prideaux John Selby in 1840."]}, {"page": "Loriini", "response": ["Category:Taxa named by Prideaux John Selby"]}, {"page": "Australian shelduck", "response": ["William Jardine and Prideaux John Selby described the Australian shelduck in 1828."]}, {"page": "1867 in science", "response": ["* March 27 – Prideaux John Selby (born 1788), English ornithologist."]}, {"page": "Leafbird", "response": ["Category:Taxa named by Prideaux John Selby"]}, {"page": "List of ornithologists", "response": ["*Prideaux John Selby – England"]}, {"page": "1821 in science", "response": ["* Prideaux John Selby begins publication of Illustrations of British Ornithology, the first set of life-sized illustrations of British birds."]}, {"page": "Loriinae", "response": ["The subfamily Loriinae was introduced in 1836 (as Loriana and Lorianae) by the English naturalist Prideaux John Selby in his book The Natural History of Parrots. Traditionally it was considered that the lories were the only members of the subfamily Loriinae, or were integrated into their own family, Loriidae, but currently they are classified as a tribe, Loriini, within a larger subfamily Loriinae. The genetic studies showed that the lories are closely related to the budgerigar and the fig parrots of the genera Cyclopsitta and Psittaculirostris, that form the other two tribes that make up the subfamily, Melopsittacini and Cyclopsittini, respectively.", "Category:Taxa named by Prideaux John Selby"]}, {"page": "1788 in science", "response": ["* July 23 – Prideaux John Selby, English ornithologist (died 1867)"]}, {"page": "Mergellus", "response": ["Category:Taxa named by Prideaux John Selby"]}, {"page": "Sir William Jardine, 7th Baronet", "response": ["Jardine described of a number of bird species, alone or in conjunction with his friend Prideaux John Selby. He died on 21 November 1874 in Sandown, Isle of Wight.", "*1825 to 1843, Illustrations of Ornithology, written with Prideaux John Selby in four volumes:", "#undated, Ornithology: Pigeons, by Prideaux John Selby with a memoir of Pliny the Elder", "#1866, Ornithology: Parrots, by Prideaux John Selby with a memoir of Thomas Bewick"]}, {"page": "William Yarrell", "response": ["He joined the Royal Institution in 1817. His first publication, at the age of 40, was \"On the Occurrence of some Rare British Birds\" (1825). This was published in the 2nd volume of the 'Zoological Journal' and he later became one of that journal's editors. He was elected a Fellow of the Linnean Society in 1825. He wrote in 1827 on the structure of the tracheae of birds and on plumage changes in pheasants. He corresponded and shared specimens with other naturalists including Thomas Bewick (from 1825), Sir William Jardine, Prideaux John Selby and Nicholas Aylward Vigors, as well as with the Cornish naturalist Jonathan Couch, who provided him with many specimens, especially of fish."]}, {"page": "Ightham Mote", "response": ["The house remained in the Selby family for nearly 300 years. Sir William was succeeded by his nephew, also Sir William, who is notable for handing over the keys of Berwick-upon-Tweed to James I on his way south to succeed to the throne.  He married Dorothy Bonham of West Malling but had no children. The Selbys continued until the mid-19th century when the line faltered with Elizabeth Selby, the widow of a Thomas who disinherited his only son. During her reclusive tenure, Joseph Nash drew the house for his multi-volume illustrated history Mansions of England in the Olden Time, published in the 1840s.  The house passed to a cousin, Prideaux John Selby, a distinguished naturalist, sportsman and scientist.  On his death in 1867, he left Ightham Mote to a daughter, Mrs Lewis Marianne Bigge. Her second husband, Robert Luard, changed his name to Luard-Selby. Ightham Mote was rented-out in 1887 to American Railroad magnate William Jackson Palmer and his family. For three years Ightham Mote became a centre for the artists and writers of the Aesthetic Movement with visitors including John Singer Sargent, Henry James, and Ellen Terry.  When Mrs Bigge died in 1889, the executors of her son Charles Selby-Bigge, a Shropshire land agent, put the house up for sale in July 1889."]}, {"page": "Kererū", "response": ["English ornithologist John Latham wrote about the kererū in his A General Synopsis of Birds in 1783  but did not give it a scientific name. German naturalist Johann Friedrich Gmelin gave it its first formal description in 1789 as Columba novaeseelandiae, with Latham naming it Columba zealandica in his 1790 Index Ornithologicus. The genus Hemiphaga was introduced by the French naturalist Charles Lucien Bonaparte in 1854 with the kererū (Hemiphaga novaeseelandiae) as the type species for that genus. The name combines the Ancient Greek hēmi meaning \"half-\" or \"small\" with the end of the genus name Carpophaga introduced by English naturalist Prideaux John Selby in 1835."]}, {"page": "Hemiphaga", "response": ["The genus Hemiphaga was introduced by the French naturalist Charles Lucien Bonaparte in 1854 with the New Zealand pigeon (Hemiphaga novaeseelandiae) as the type species. The name combines the Ancient Greek hēmi meaning \"half-\" or \"small\" with the end of the genus name Carpophaga introduced Prideaux John Selby in 1835."]}, {"page": "Fallodon", "response": ["Prideaux John Selby, in his work British Forest Trees of 1842, noted several significant trees at Falloden, including several Bedford willows averaging 60 feet high, the two silver firs also noted above, approximately nine feet in circumference and 80 feet high, and two evergreen holm oaks:In Northumberland there are fine thriving specimens, of thirty and forty years growth, at Howick, the seat of the Earl Grey, and two very fine trees at Falloden, the seat of General Sir H. Grey, of one of which our figure is a portrait; this tree is about forty-five feet high, with a trunk seven feet four inches in circumference at two feet from the ground, and a diameter of head of thirty-six feet, but it covered a much larger space previously to a storm of wind a few years ago, which tore off one of its main limbs. The other is not so high, but it covers a much larger space of ground, the diameter of the spread of the branches being upwards of seventy feet, the circumference of the bole at one foot from the ground eleven feet. Both of these trees are within the influence of the sea breeze."]}, {"page": "Selby (disambiguation)", "response": ["*Prideaux John Selby (1788–1867), English ornithologist, botanist and artist and landowner"]}, {"page": "List of authors of names published under the ICZN", "response": ["* Selby – Prideaux John Selby (1788–1867)"]}, {"page": "P.Selby", "response": ["#REDIRECT Prideaux John Selby"]}, {"page": "Horatio McCulloch", "response": ["Horatio McCulloch was trained in the studio of the Glasgow landscape painter John Knox (1778–1845) for about one year alongside Daniel Macnee (1806–1882) and at first earned his living as a decorative painter. He was then engaged at Cumnock, painting the ornamental lids of snuffboxes, and afterwards employed in Edinburgh by William Home Lizars, the engraver, to colour the illustrations in Prideaux John Selby's British Birds and similar works."]}, {"page": "Phaps", "response": ["The genus was introduced in 1835 by the English naturalist Prideaux John Selby with the common bronzewing (Phaps chalcoptera) as the type species. The genus name Phaps is the Ancient Greek word for a pigeon.", "Category:Taxa named by Prideaux John Selby"]}, {"page": "Great North Museum: Hancock", "response": ["The collection of the Hancock Museum can be traced to about 1780 when Marmaduke Tunstall started accumulating ethnographic and natural history material from around the world. He then brought his collection from London to North Yorkshire. In 1790 Tunstall died, and George Allan of Darlington purchased Tunstall's collection; and later in 1823 it was acquired by the Literary and Philosophical Society of Newcastle upon Tyne. In 1829 the Natural History Society of Northumberland, Durham and Newcastle upon Tyne (now the Natural History Society of Northumbria) was formed as a scientific offshoot of the Literary and Philosophical Society. Amongst the founding and early members of the Natural History Society were Joshua Alder, Albany Hancock, John Hancock, Prideaux John Selby and William Chapman Hewitson."]}, {"page": "Mauritius bulbul", "response": ["Category:Taxa named by Prideaux John Selby"]}, {"page": "Spindalis", "response": ["Category:Taxa named by Prideaux John Selby"]}, {"page": "Nyctyornis", "response": ["The genus Nyctyornis was introduced by the naturalists William Jardine and Prideaux John Selby in 1830. The name comes from the Ancient Greek  nukt meaning nocturnal or night and ornis meaning bird. A molecular phylogenetic study published in 2007 showed that the genus is basal and forms a sister group to the remaining members of the bee-eater family.", "Category:Taxa named by Prideaux John Selby"]}, {"page": "Charles William Bigge", "response": ["#Charles John, the eldest, married Lewis Marianne, daughter of Prideaux John Selby. Charles (1803–1846) and Matthew (1822–1906), joined their father as directors of the bank."]}]}}