{"wiki_id": "http://www.wikidata.org/entity/Q716239", "itemLabel": "Stuart Pearson", "itemDescription": "footballer; football manager (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Pearson", "wikipedia_page": {"main": "Stuart James Pearson (born 21 June 1949) is an English former footballer. His nickname was \"Pancho\". He was a skilful forward who played in three FA Cup finals, two for Manchester United and one with West Ham United.", "link_mentions": [{"page": "1949", "response": ["** Stuart Pearson, English football player"]}, {"page": "Paul Mariner", "response": ["Mariner's third England cap came in the return World Cup qualifier in Luxembourg, scoring a last-minute goal in a 2–0 win. By now, Mariner had become one of a number of 'target man'-type centre forwards for England coach Ron Greenwood to select from, with Stuart Pearson and Bob Latchford also on the scene. It was Mariner, however, who would be selected the majority of the time."]}, {"page": "Don Revie", "response": ["With England unseeded, Revie was handed opponents for qualifying for the 1978 World Cup of Italy, Finland and Luxembourg. Only the winner would progress to the finals. Just before the campaign began England suffered a 2–1 defeat to Scotland to finish second in the 1975–76 British Home Championship. England made heavy work of both Finland and Luxembourg, winning 4–1 away and 2–1 at home against the Finns and 5–0 at home and 2–0 away against the Luxembourgers. The failure to inflict heavier defeats on these sides was ultimately the reason why Italy qualified for the finals on goal difference alone. England fell to a 2–0 defeat in Rome where Revie was criticised for his previously untested back four selection of Emlyn Hughes, Dave Clement, Roy McFarland, and Mick Mills; he also played Trevor Brooking out of position and surprised many by selecting Stan Bowles ahead of Stuart Pearson. Sensing that he was disliked by FA chairman Sir Harold Thompson, and with further criticism coming his way after England could only finish third in the 1976–77 British Home Championship, Revie began to look for a way out. He missed a friendly with Brazil in Rio de Janeiro for what he claimed was a scouting assignment on the Italians, when in fact he had travelled to Dubai for contract negotiations with the United Arab Emirates. Revie asked for his contract with England to be cancelled, which the FA refused to do and the FA offered Revie their full support despite having already approached Bobby Robson to replace him. The game with Brazil ended in a 0–0 draw, and their tour of South America concluded with draws with Argentina and Uruguay. On 12 July 1977, Revie revealed in an exclusive to the Daily Mail that he was quitting the England job to become manager of the UAE. The FA suspended Revie from football for ten years on a charge of bringing the game into disrepute; Revie contested his suspension in a lawsuit against the FA, and the court overturned the suspension after ruling that the FA had overreached its powers."]}, {"page": "Alex Stepney", "response": ["United reached the Cup Final again in 1977, against Liverpool, and this time were successful. Stepney got a hand to a bullet shot on the turn from Jimmy Case but couldn't stop it entering the net and levelling the match after Stuart Pearson had scored for United. Jimmy Greenhoff quickly restored United's lead and Stepney made some good saves in the closing stages as Liverpool, chasing an unprecedented 'treble' of trophies (having already won the league title, and just days later going on to win the European Cup), piled on the pressure."]}, {"page": "Jimmy Greenhoff", "response": ["After three goals in sixteen games in 1976–77, he was sold to Tommy Docherty's Manchester United in November 1976 for £120,000; with Stoke needing the money to pay a bill for £250,000 to repair the Victoria Ground following a powerful wind-storm. Though Docherty intended him to play alongside Stuart Pearson, the move also meant that he would play alongside his brother, Brian Greenhoff. He scored a total of 97 goals for Stoke in 338 league and cup starts, putting him ninth in the club's overall goalscoring charts. A legend at the club, many Stoke fans consider him to be the greatest England player never to win a senior cap."]}, {"page": "Gordon Hill (footballer)", "response": ["He joined FC Twente in the Dutch Premier Division for the 1985–86 season, playing 19 times and scoring four goals. He spent the summer of 1986 in Finland with HJK Helsinki, scoring two goals in as many appearances before returning to England where he played under his former teammate Stuart Pearson at Northwich Victoria, before retiring from the game."]}, {"page": "Sam Allardyce", "response": ["Allardyce was hired as a player-coach by Brian Talbot at West Bromwich Albion in February 1989.Walsh, David; \"The Big Interview: Sam Allardyce\" TimesOnline.co.uk, 2 January 2005 (Retrieved 25 July 2009) He spent most of the rest of the 1988–89 season at The Hawthorns managing and playing for the reserve team, before being promoted to first team coach in the summer, in a move that saw former first team coach Stuart Pearson demoted to reserve team coaching. Allardyce and Talbot were sacked in January 1991 following a defeat to Isthmian League side Woking in the FA Cup. He later worked as a part-time coach at Bury, but manager Mike Walsh could not afford to keep him on the staff for the 1989–90 season."]}, {"page": "History of Manchester United F.C. (1969–1986)", "response": ["After the relegation, Docherty culled most of what remained of Busby's squad, with goalkeeper Alex Stepney being the only member of the European Cup-winning team to remain in the first team for the start of the following season. The new-look Manchester United squad was built around youthful players such as Sammy McIlroy, who had come to impress during the final months of the ill-fated 1973–74 campaign. Also in the squad were new signings like centre-half Jim Holton, winger Gordon Hill and forward Stuart Pearson.", "The new-look Manchester United side contained impressive young players like Steve Coppell, Sammy McIlroy, Brian Greenhoff, Jimmy Greenhoff, Arthur Albiston and Stuart Pearson. Although goalkeeper Alex Stepney was still with United, Busby's final signing and United's former captain Willie Morgan had left in the summer of 1975 after a dispute with manager Tommy Docherty. United were now being captained by Martin Buchan."]}, {"page": "MUTV (Manchester United F.C.)", "response": ["*Stuart Pearson"]}]}}