{"wiki_id": "http://www.wikidata.org/entity/Q7167494", "itemLabel": "Percy Morris", "itemDescription": "British politician (1893-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Morris", "wikipedia_page": {"main": "Percy Morris  (6 October 1893 – 7 March 1967) was a British railway clerk, trade unionist and politician who became Mayor of Swansea and represented the town in Parliament. He specialised in railway issues in Parliament, and after being defeated for re-election, he served on public boards in the field of transport and social security.", "link_mentions": [{"page": "Swansea", "response": ["* Percy Morris : 19 February 1958."]}, {"page": "Transport Salaried Staffs' Association", "response": [":1943: Percy Morris", ":1937: Percy Morris"]}, {"page": "Alan Williams (Swansea West MP)", "response": ["He unsuccessfully contested Poole in 1959, coming second to the Conservative incumbent Richard Pilkington. Shortly afterwards he was selected as the candidate for Swansea West which had been won by the Conservatives by a narrow majority of 403 votes. The constituency, containing the city centre, the university and the relatively prosperous western suburbs, had historically been a marginal one for Labour, in contrast to the more working-class Swansea East. Percy Morris, elected in the Labour landslide of 1945 had seen his majority cut to just over a thousand votes in 1955 before he was ousted by the Conservative Hugh Rees four years later. Williams recaptured the seat in 1964, and held it for nearly 46 years. However, it was never entirely safe, and Rees made two unsuccessful attempts to recapture the seat in 1966 and in 1970. Wiliams had a very tight contest at the 1979 election, in the wake of the \"winter of discontent\" and divisions in the Welsh Labour Party over devolution. He held on by only 401 votes – only two less than the Tory majority he had overturned in 1964. His majorities thereafter were more secure but the fact that the Liberal Democrats came close to winning the seat after his retirement in 2010 suggests that he had a substantial personal vote."]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Percy Morris"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Percy Morris"]}, {"page": "Swansea West (UK Parliament constituency)", "response": ["|Percy Morris", "* Labour: Percy Morris"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Percy Morris"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Percy Morris"]}, {"page": "List of people from Swansea", "response": ["*Percy Morris"]}, {"page": "1967 in Wales", "response": ["*7 March – Percy Morris, trade unionist and politician, 73"]}, {"page": "Swansea Guildhall", "response": ["The design envisaged a building finished in white Portland stone, and included a  art deco clock-tower, making it a landmark. The clock-tower featured the prow of a Viking longship, jutting out on each side as a reminder of Sweyn Forkbeard, thought to be the founder of Swansea. The council chamber used panelling made of Australian walnut and columns  high. Bronze busts depicting the local Members of Parliament, David Matthews, David Williams, Percy Morris and David Grenfell,  were subsequently installed outside the council chamber. Percy Thomas won the Bronze Medal for Architecture from the Royal Institute of British Architects for his work in 1935."]}, {"page": "Morris (surname)", "response": ["* Percy Morris (1893–1967), British railway clerk, trade unionist and politician, member of Parliament (1945–1959)", "* Percy Morris (cricketer) (1881–1975), Welsh cricketer"]}, {"page": "1963 Birthday Honours", "response": ["*Percy Morris, Esq., J.P., Alderman, Swansea County Borough."]}, {"page": "National Assistance Board", "response": ["* Percy Morris 1960–1966"]}]}}