{"wiki_id": "http://www.wikidata.org/entity/Q7167371", "itemLabel": "Percy Greenbank", "itemDescription": "British lyricist", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Greenbank", "wikipedia_page": {"main": "Percy Greenbank (24 January 1878 – 9 December 1968) was an English lyricist, best known for his contribution of lyrics to a number of successful Edwardian musical comedies in the early years of the 20th century.  His older brother, lyricist Harry Greenbank, had a brilliant career in the 1890s that was cut short by his death at the age of 33.  Percy picked up where his brother had left off, writing lyrics for some of the most popular musicals from 1900 through World War I and even afterwards.", "link_mentions": [{"page": "1968 in music", "response": ["*December 9 – Percy Greenbank, lyricist, 90"]}, {"page": "1910 in music", "response": ["* The Quaker Girl (Music: Lionel Monckton Lyrics: Adrian Ross & Percy Greenbank  Book: James T. Tanner).  London production opened at the Adelphi Theatre on November 5 and ran for 536 performances.  Starring Gertie Millar, Joseph Coyne and C. Hayden Coffin."]}, {"page": "1909 in music", "response": ["* The Belle of Brittany (Music: Howard Talbot & Marie Horne  Lyrics: Percy Greenbank Book: P. J. Barron & Leedom Bantock)  Broadway production opened at Daly's Theatre on November 8 and ran for 72 performances.  Starring Frank Daniels and Francis Kennedy.", "* Our Miss Gibbs (Music: Ivan Caryll & Lionel Monckton  Lyrics: Adrian Ross & Percy Greenbank)  London production opened at the Gaiety Theatre on January 23 and ran for 636 performances."]}, {"page": "1908 in music", "response": ["* The Belle of Brittany opened at the Queen's Theatre in London on 24 October 1908 with music by Howard Talbot to a book by Leedham Bantock and lyrics by Percy Greenbank"]}, {"page": "1904 in music", "response": ["*  The Cingalee (Lionel Monckton, Adrian Ross and Percy Greenbank) – London production opened at Daly's Theatre on March 5 and ran for 365 performances"]}, {"page": "Arthur Wing Pinero", "response": ["Four of Pinero's plays have been adapted as musicals: The Magistrate as The Boy (1917) with words by Fred Thompson, Percy Greenbank and Adrian Ross and music by Lionel Monckton and Howard Talbot; In Chancery as Who's Hooper? (1919) with lyrics by Thompson and music by Talbot and Ivor Novello; The Schoolmistress  as My Niece (1921) with words by Greenbank and music by Talbot;\"Plays of the Month\", The Play Pictorial, August 1921, p. 63 and Trelawny of the \"Wells\" as Trelawny (1972), adapted by Aubrey Woods, George Rowell and Julian Slade."]}, {"page": "The Cingalee", "response": ["The Cingalee, or Sunny Ceylon is a musical play in two acts by James T. Tanner, with music by Lionel Monckton, lyrics by Adrian Ross and Percy Greenbank, and additional material by Paul Rubens. It opened at Daly's Theatre in London, managed by George Edwardes, on 5 March 1904 and ran until 11 March 1905 for a total of 365 performances.J. P. Wearing \"Productions 1904: The Cingalee; or, Sunny Ceylon\", The London Stage 1900–1909: A Calendar of Productions, Performers, and Personnel (2nd edition, Scarecrow Press; 5 December 2013), p. 176 The musical had a short Broadway run, opening at the original Daly's Theatre in New York on 24 October 1904 and running for 33 performances.The Cingalee, Guide to Musical Theatre, accessed 3 April 2018"]}, {"page": "List of musicals: A to L", "response": ["| Percy Greenbank", "| Adrian Ross and Percy Greenbank", "| Percy Greenbank"]}, {"page": "List of musicals: M to Z", "response": ["| Adrian Ross and Percy Greenbank"]}, {"page": "André Messager", "response": ["| Michel Carré, Frederic Weatherly, Percy Greenbank and Adrian Ross"]}, {"page": "A Connecticut Yankee (musical)", "response": ["Retitled A Yankee at the Court of King Arthur, the show opened in London at Daly's Theatre, under the management of George Edwardes, on 10 October 1929, running for just 43 performances. Harry Fox starred as Martin, with Constance Carpenter as Alice. After closing in London the show toured the UK provinces in the Spring of 1930. Additional numbers interpolated in the UK were by Desmond Carter, Vivian Ellis, H. M. Tennent, Percy Greenbank and others, and the piece now opened with a new Rodgers & Hart number \"A Ladies Home Companion\".Theatre programme: A Yankee at the Court of King Arthur, Wimbledon Theatre, South London, w/c 31 March 1930."]}, {"page": "The Toreador", "response": ["The Toreador is an Edwardian musical comedy in two acts by James T. Tanner and Harry Nicholls, with lyrics by Adrian Ross and Percy Greenbank and music by Ivan Caryll and Lionel Monckton.  It opened at the Gaiety Theatre in London, managed by George Edwardes, on  17 June 1901 and ran for an extremely successful 675 performances.  It starred Marie Studholme, Gertie Millar, Harry Grattan, Edmund Payne, George Grossmith, Jr. and the young Sidney Bracy.  Gabrielle Ray later joined the cast.  The show also enjoyed Broadway runs in 1902 and 1904 and toured internationally."]}, {"page": "George Edwardes", "response": ["Edwardes also used the Apollo Theatre for several musicals, including Three Little Maids (1902) and The Girl from Kays (1902). As Edwardes' success grew, he needed another theatre and added the Adelphi Theatre to his chain of musical houses. There he produced a series of musicals by Lionel Monckton, Percy Greenbank and Adrian Ross, including The Earl and the Girl (1903), The Quaker Girl (1910), The Dancing Mistress (1912), and The Girl from Utah (1913).  At the Lyric Theatre, in 1903, he produced Caryll's comic opera The Duchess of Dantzic.  He also managed the Empire Theatre of Varieties, among other theatres. Edwardes was a founder member of the Society of West End Theatre Managers, along with Frank Curzon, Helen Carte, Arthur Bourchier and sixteen others.\"The Society of West-End Theatre Managers\", The Times, 24 April 1908, p. 17."]}, {"page": "The Messenger Boy", "response": ["The Messenger Boy is a musical comedy in two acts by James T. Tanner and Alfred Murray, lyrics by Adrian Ross and Percy Greenbank, with music by Ivan Caryll and Lionel Monckton, with additional numbers by Paul Rubens.  The story concerned a rascally financier who tries to discredit a rival in love.  After a tryout in Plymouth, it opened at the Gaiety Theatre in London, managed by George Edwardes, on 3 February 1900 and ran for a very successful 429 performances. Harry Grattan and Edmund Payne starred. Marie Studholme later joined the cast.  It had a Broadway run of 128 performances, at Daly's Theatre, from 16 September 1901 to 4 January 1902. The director was Herbert Gresham, and the musical director was Louis F. Gottschalk.  The cast included Georgia Caine as Nora, Jobyna Howland as Lord Punchestown, May Robson as Mrs. Bang and Flora Zabelle as Isabel Blyth.\"Daly's Theatre\", Internet Broadway Database, accessed November 29, 2018"]}, {"page": "A Country Girl", "response": ["A Country Girl, or, Town and Country is a musical play in two acts by James T. Tanner, with lyrics by Adrian Ross, additional lyrics by Percy Greenbank, music by Lionel Monckton and additional songs by Paul Rubens."]}, {"page": "Our Miss Gibbs", "response": ["Our Miss Gibbs is an Edwardian musical comedy in two acts by 'Cryptos' and James T. Tanner, with lyrics by Adrian Ross and Percy Greenbank, music by Ivan Caryll and Lionel Monckton.  Produced by George Edwardes, it opened at the Gaiety Theatre in London on 23 January 1909 and ran for an extremely successful 636 performances.  It starred Gertie Millar, Edmund Payne and George Grossmith, Jr.  The young Gladys Cooper played the small role of Lady Connie."]}, {"page": "The Orchid", "response": ["The Orchid is an Edwardian musical comedy in two acts with music by Ivan Caryll and Lionel Monckton, a book by James T. Tanner, lyrics by Adrian Ross and Percy Greenbank, and additional numbers by Paul Rubens. The story concerns marital mix-ups and the quest of a wealthy man for a $2,000 Peruvian orchid to be sent to France. When foul play keeps the flower from reaching its destination, it is discovered that a nearly identical orchid is growing in the garden of the horticultural college."]}, {"page": "The Quaker Girl", "response": ["The Quaker Girl is an Edwardian musical comedy in three acts with a book by James T. Tanner, lyrics by Adrian Ross and Percy Greenbank, and music by Lionel Monckton.  In its story, The Quaker Girl contrasts dour Quaker morality with Parisienne high fashion.  The protagonist, Prudence, is thrown out of her house by her quaker parents for drinking a glass of champagne.  Later, in Paris, her simple grey dress and bonnet become the height of fashion.", "music by Lionel Monckton and lyrics by Adrian Ross and Percy Greenbank, except as noted."]}, {"page": "The Boy (musical)", "response": ["The Boy is a musical comedy with a book by Fred Thompson and Percy Greenbank (based on Arthur Wing Pinero's 1885 play, The Magistrate), music by Lionel Monckton and Howard Talbot and lyrics by Greenbank and Adrian Ross. The original production opened at the Adelphi Theatre in London in 1917 and ran for 801 performances – one of the longest runs of any musical theatre piece up to that time. It had successful foreign productions and tours.", "During the gloomy days of World War I, audiences, including servicemen on leave, wanted light and uplifting entertainment, and they flocked to theatres to see lighthearted musical comedies, a number of which broke box-office records. These included The Bing Boys Are Here (1916), Chu Chin Chow (1916), and The Maid of the Mountains (1917).Gaye, pp. 1528–1530 Almost as popular were The Boy, The Happy Day (1916) and Yes, Uncle! (1917). Greenbank had worked on a dozen shows with each of Monckton and Ross from 1900 to the time of The Boy, and Talbot and Thompson were also frequent collaborators of theirs in the first two decades of the 20th century.\"Percy Greenbank\" at the British Musical Theatre website, accessed 31 December 2009"]}, {"page": "The Earl and the Girl", "response": ["The Earl and the Girl is a musical comedy in two acts by Seymour Hicks, with lyrics by Percy Greenbank and music by Ivan Caryll.  It was produced by William Greet and opened at the Adelphi Theatre in London on 10 December 1903.  It transferred to the Lyric Theatre on 12 September 1904, running for a total of 371 performances.\"The Earl and the Girl\", The Play Pictorial, December 1903 pp. 55–80Gaye, p. 1531  It also ran at the Casino Theatre in New York beginning on 4 November 1905 for 148 performances (with some added music and lyrics by Jerome Kern and others), starring Eddie Foy and W. H. Denny.\"The Earl and the Girl\", Internet Broadway Database, accessed 3 March 2011. A production toured Australia in 1906 and 1907.  A revival in London in 1914 ran for a total of 107 performances,\"The Theatrical Week\", The Times, 8 February 1915, p. 10 and there were later revivals and tours.\"Dramatis Personae\", The Observer, 20 October 1918, p. 5"]}, {"page": "Daly's Theatre", "response": ["Edwardes engaged Sidney Jones as the resident composer and musical director, and Daly's became well known for a string of highly successful musical comedies. A second edition of An Artist's Model opened in September 1895 and was followed by The Geisha (1896), which ran for 760 performances, A Greek Slave (1898) and San Toy (1899), which ran for 768 performances. Forbes-Winslow rates Edwardes as a perceptive picker of composers: Jones wrote well-received scores for all four of these shows. In the first decade of the 20th century Edwardes's first new production at Daly's was A Country Girl (1902), with music by Lionel Monckton and Paul Rubens and words by Adrian Ross, Percy Greenbank and James T. Tanner, which ran for 729 performances. The same five contributors wrote The Cingalee (1904), which ran for 365 performances.Wearing, p. 176"]}, {"page": "The Girl Behind the Counter", "response": ["The Girl Behind the Counter is an Edwardian musical comedy with a book by Arthur Anderson and Leedham Bantock, music by Howard Talbot and lyrics by Arthur Anderson (and additional lyrics by Percy Greenbank).The Girl Behind the Counter.  Guide to Musical Theatre, accessed 21 July 2011"]}, {"page": "Three Little Maids", "response": ["Three Little Maids is an English musical by Paul Rubens with additional songs by Percy Greenbank and Howard Talbot. The story concerns three simple curate's daughters who go to London to earn their livings serving tea in a Bond Street tea shop.  They become the romantic rivals of three ladies of fashion but succeed because of their freshness."]}, {"page": "The Spring Chicken", "response": ["The Spring Chicken is an Edwardian musical comedy adapted by George Grossmith, Jr. from Coquin de Printemps (1897) by Jaime and Duval, with music by Ivan Caryll and Lionel Monckton and lyrics by Adrian Ross, Percy Greenbank and Grossmith."]}, {"page": "The New Aladdin", "response": ["The New Aladdin is an Edwardian musical comedy in two acts by James T. Tanner and W. H. Risque, with music by Ivan Caryll, Lionel Monckton, and additional numbers by Frank E. Tours, and lyrics by Adrian Ross, Percy Greenbank, W. H. Risque, and George Grossmith, Jr.  It was produced by George Edwardes at the Gaiety Theatre, opening on 29 September 1906 and running for 203 performances."]}, {"page": "Les p'tites Michu", "response": ["The piece enjoyed a long run in London under the title The Little Michus. The English adaptation was by Henry Hamilton, with lyrics by Percy Greenbank, and was produced by George Edwardes at Daly's Theatre. The composer conducted the first night, on 29 April 1905,\"P.I.P. Playgoer\", The Penny Illustrated Paper, 6 May 1905, p. 283 and the piece ran for 400 performances. It starred Adrienne Augarde and Mabel Green, with Robert Evett, Willie Edouin, Huntley Wright, Amy Augarde, Willie Warde, Ambrose Manning, Louis Bradfield.Wearing, p. 230 A role was added during the run for the dancer Adeline Genée. A piece of comic business introduced during the run involved a fictional animal called the Gazeka, which became a London fad.\"P.I.P. Playgoer\", The Penny Illustrated Paper, 25 November 1905, p. 235"]}, {"page": "Véronique (operetta)", "response": ["The opera was presented in Vienna and Cologne (as Brigitte) in 1900, and then Riga in 1901 and Berlin in 1902. It was produced in Lisbon in 1901 and Geneva in 1902. In London it was given in French at the Coronet Theatre in 1903,\"Coronet Theatre\", The Times, 6 May 1903, p. 12 and in English at the Apollo Theatre, adapted by Henry Hamilton with lyrics by Lilian Eldée and alterations and additions by Percy Greenbank, produced by George Edwardes. This production opened on 18 May 1904, and ran for 496 performances. The principal players were Rosina Brandram (Ermerance), Sybil Grey (Aunt Benoit), Fred Emney (Loustrot), Kitty Gordon (Mme. Coquenard), George Graves (Coquenard), Lawrence Rea (Florestan) and Ruth Vincent (Hélène).Wearing, p. 185 An Italian version was given in Milan in the same year."]}, {"page": "The Girl from Kays", "response": ["The Girl from Kays is a musical comedy in three acts, with music by Ivan Caryll and book and lyrics by Owen Hall.  Additional songs were by Paul Rubens, Howard Talbot, Adrian Ross, Percy Greenbank and others.  The farcical story concerns a misguided kiss.The Girl from Kays, Guide to Musical Theatre, accessed 17 January 2013"]}, {"page": "To-Night's the Night (musical)", "response": ["To-Night's the Night is a musical comedy composed by Paul Rubens, with lyrics by Percy Greenbank and Rubens, and a book adapted by Fred Thompson.  Two songs were composed by Jerome Kern.  The story is based on the farce Les Dominos roses by Alfred Hennequin and Alfred Delacour."]}, {"page": "My Lady Molly", "response": ["My Lady Molly is a 'comedy opera' in two acts with a libretto by George H. Jessop, with additional lyrics by Percy Greenbank and Charles H. Taylor, and music by Sidney Jones.  The story centers around Lady Molly Martingale, a vivacious young woman, who disguises herself as a man to win the man she loves."]}, {"page": "Edwardian musical comedy", "response": ["The chief glories of Edwardian musical comedies lie in their musical scores. At their best, these combined the delicacy and sophistication of operetta with the robust tunefulness of the music hall. The major composers of the genre were Sidney Jones (The Geisha), Ivan Caryll (Our Miss Gibbs), Lionel Monckton (The Quaker Girl), Howard Talbot (A Chinese Honeymoon), Leslie Stuart (Florodora) and Paul Rubens (Miss Hook of Holland). Scores were constantly refreshed with \"additional\" or \"specialty\" numbers and re-arranged, often by several different composers and lyricists, to keep audiences coming back. Important writers included Adrian Ross, Harry Greenbank, Percy Greenbank, Owen Hall, Charles H. Taylor and Oscar Asche. Generally, the book, lyrics and music were each written by different people, which was a first for the musical stage, although now this is the usual way of doing things. Adrian Ross wrote the lyrics for well over 50 Edwardian musicals."]}, {"page": "Edward Laurillard", "response": ["In 1894, Laurillard became manager of Terry's Theatre, producing King Kodak, and his first big success was The Gay Parisienne at the Duke of York's Theatre, which introduced the hit song \"Sister Mary Jane's Top Note.\"  Other early productions included My Old Dutch and Oh! Susannah, after which he toured the United States.  The Savoy Theatre in London, closed in 1903 after the D'Oyly Carte Opera Company discontinued producing its Savoy operas there, was reopened under the management of Laurillard in February 1904 with The Love Birds, by Raymond Rôze and Percy Greenbank, starring George Grossmith, Jr., who would later become Laurillard's producing partner.Biography of George Grossmith, Jr. containing information about the Winter Garden Theatre's productions from 1919 to 1926"]}, {"page": "The Girl from Utah", "response": ["The Girl from Utah is an Edwardian musical comedy in two acts with music by Paul Rubens, and Sidney Jones, a book by James T. Tanner, and lyrics by Adrian Ross, Percy Greenbank and Rubens.  The story concerns an American girl who runs away to London to avoid becoming a wealthy Mormon's newest wife.  The Mormon follows her to England, but she is rescued from a bigamous marriage by a handsome actor."]}, {"page": "Henry Hamilton (playwright)", "response": ["*Autumn Manoeuvres, musical play adapted from Tatárjárás by Emmerich Kalman with a Hungarian libretto by Karl von Bakony and R. Bodanskistaged, staged at the Adelphi Theatre on 25 May 1912, with lyrics by Percy Greenbank.\"London Theatres – The Adelphi\", The Stage, 30 May 1912, p. 18, accessed 20 May 2018, via British Newspaper Archive  A version of Tatárjárás had been produced as The Gay Hussars at the Knickerbocker Theatre in 1909."]}, {"page": "1968 in British music", "response": ["*9 December – Percy Greenbank, lyricist, 90"]}, {"page": "The Dancing Mistress", "response": ["The Dancing Mistress is a musical comedy with music by Lionel Monckton, book by James T. Tanner and lyrics by Adrian Ross and Percy Greenbank. It depicts the fortunes of a school dancing mistress who is dismissed and finds fortune and happiness in Switzerland. The piece ran in the West End of London in 1912 and 1913, and toured the British provinces in 1914."]}, {"page": "The Blue Moon (musical)", "response": ["The Blue Moon is an Edwardian musical comedy with music composed by Howard Talbot and Paul Rubens, lyrics by Percy Greenbank and Rubens and a book by Harold Ellis and by Alexander M. Thompson.  It is set in India during the days of the British Raj, and concerns the love of a singing girl for a young British army officer.", "The Blue Moon was originally staged in Northampton on 29 February 1904, with a book by Harold Ellis. By the time of the London production, Ellis had died, and the book was revised by Alexander M. Thompson (credited as \"A. M. Thompson\"). The lyrics were by Percy Greenbank and Paul Rubens, and the music by Rubens and Howard Talbot.\"The Blue Moon\", The Play Pictorial, May 1905, pp. 121–36"]}, {"page": "Nathaniel Newnham-Davis (journalist)", "response": ["The Times described Newnham-Davis as a playwright in addition to his military and journalistic career. While still in the army he made a version of A Midsummer Night's Dream \"adapted to pastoral representation\", published in Calcutta.\"Nathaniel Newnham-Davis\", British Library catalogue, accessed 15 May 2011 He published a play, A Charitable Bequest – A comedietta (1900). He wrote the story for several ballets, and was co-author of a show, Lady Madcap, in collaboration with Paul Rubens and Percy Greenbank, produced in London in 1904. In the same year he joined W.S. Gilbert, F.C. Burnand, Bernard Shaw and others in a charity matinée performance of Gilbert's Rosencrantz and Guildenstern at the Garrick Theatre.\"At the Play\", The Observer, 17 June 1904, p. 6"]}, {"page": "Princess Caprice", "response": ["Princess Caprice is a musical theatre work described as a \"comedy with music\", in three acts, with music by Leo Fall. The book was adapted by Alexander M. Thompson from Fall's operetta Der liebe Augustin by Rudolf Bernauer and Ernst Welisch. The lyrics were by A. Scott-Craven, Harry Beswick and Percy Greenbank. Much of the music was from Der liebe Augustin, but Fall composed four new numbers, with lyrics by Scott-Craven, for the new piece.  The story involves mistaken identities and farcical financial dealings at a European palace, following which the proper romantic partners are paired happily."]}, {"page": "Houp La!", "response": ["Houp La! is an Edwardian musical comedy extravaganza, with music by Nat D. Ayer and Howard Talbot, lyrics by Percy Greenbank and Hugh E. Wright, and a book by Fred Thompson and Hugh E. Wright. The story combines the comic financial troubles of a circus owner with a love triangle.  "]}, {"page": "September 1917", "response": ["* The musical The Boy, by Fred Thompson and Percy Greenbank with music by Lionel Monckton and Howard Talbot, premiered at the Adelphi Theatre in London and ran 801 performances, the longest running show up until that point."]}, {"page": "Yvonne (musical)", "response": ["Yvonne is a musical comedy with a book and lyrics by Percy Greenbank and music by Jean Gilbert and Vernon Duke (at that time still using his birth name of Dukelsky).Vernon Duke, PBS, accessed 22 April 2013 It was adapted by Greenbank from an Austrian musical of the same name. Some additional songs were written by the show's conductor, Arthur Wood. The story concerns an engaged young lady, Yvonne Savigny, the daughter of old professor who loves riotous gaiety. To avoid trouble, she impersonates an absent music hall star at the Scala Music Hall. A young man has fallen in love with Yvonne and disguises himself as a servant in her father's house. After various complications, Yvonne leaves her silly fiancé for the amorous suitor and all ends happily."]}, {"page": "Coralie Blythe", "response": ["In 1906 Grossmith and Blythe were invited to perform in New York by Lew Fields;'English Invasion of the American Stage Will Break All Records This Season', The New York Times, 26 August 1906 she took her brother Vernon Castle with her. Later in 1906 the three of them appeared at the Herald Square Theatre on Broadway in the musical revue About Town.Blythe on the Internet Broadway DatabaseAbout Town Cast List on Broadway World Back in London, she appeared in The White Chrysanthemum and played Ethel Trevor in The Three Kisses, by Percy Greenbank, Leedham Bantock and Howard Talbot (1907) at the Apollo. In 1908 she appeared as Mitzi in The Girls of Gottenberg and as Phyllis Tuppet in a revival of Dorothy at the New Theatre. She next returned to the Prince's Theatre in Bristol in The Gay Gordons (1908–1909) and as Martje in The Girl in the Train (1910–1911).Blythe on the 'Theatricalia' website In between these, in 1909, she played Cesarine de Noce in The Dashing Little Duke at the Hicks Theatre in London and then toured as Consuelo in Havana."]}]}}