{"wiki_id": "http://www.wikidata.org/entity/Q7167637", "itemLabel": "Percy Watson", "itemDescription": "English association footballer (1869-1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Watson_(English_footballer)", "wikipedia_page": {"main": "Percy C. Thomas Watson (March 1869 – 1949) was an English professional footballer who played in the Football League for Rotherham Town and Small Heath. Born in Barnsley, which was then in the West Riding of Yorkshire, Watson played in the Second Division for both Rotherham Town and Small Heath during the 1893–94 season.", "link_mentions": [{"page": "1893–94 Small Heath F.C. season", "response": ["In front of a large crowd, Small Heath suffered what was described as an \"unfortunate\" one-goal defeat at Grimsby Town. Hollis should have done better with Grimsby's opener, Frank Mobley was injured around the eye in collision with the goalkeeper when scoring Small Heath's only goal and showed some bravery in remaining on the field, and Wheldon had an apparently valid goal disallowed. Short, in a \"trifle risky\" style, and the solid Devey again did well in defence. Lost gate receipts because of Aston Villa's withdrawal from the United Counties League was decidedly unpopular with the other members, and the Small Heath committee arranged a smoking concert to raise funds. Those clubs at the bottom of the First Division and top of the Second were all recruiting new players: \"the test matches mean such a lot to the clubs concerned that there is no wonder at this anxiety to secure new blood.\" Small Heath acquired the services of full-backs Percy Watson and William Purves, from Rotherham Town and Irish club Glentoran respectively.", "Fred Speller attempted a comeback, appearing twice for the first team early in the season, but the injury received against Darwen proved the end of his professional football career.Matthews, Complete Record, p. 126. Bernard Pumfrey left for Midland League club Gainsborough Trinity, and went on to captain that club in the Football League., hosted at  . North Lincolnshire Council. Retrieved 15 May 2020. Walter Jackson, William Reynolds and Gilbert Smith were all released to join Birmingham & District League club Berwick Rangers,Matthews, Complete Record, pp. 100, 119, 125. and Percy Watson returned to his native Yorkshire.Joyce, Football League Players' Records, p. 274. Chris Charsley played no more League football, concentrating instead on his police career: he reached the rank of Chief Inspector in the Birmingham force, and in 1899 was appointed Chief Constable of Coventry.Matthews, Complete Record, p. 78. Small Heath signed the former Sunderland full back Jack Oliver, whom they had failed to recruit earlier in the season, but despite the misgivings of the local press, they were to negotiate their debut First Division season with no other major signings."]}, {"page": "Percy Watson (disambiguation)", "response": ["Percy Watson (born 1981) is an American professional wrestler and former professional football player.", "Percy Watson may also refer to:", "*Percy Watson (English footballer) (1869–1949), Australian rules footballer", "*Percy Watson (Australian footballer) (1898–1965), Australian rules footballer", "*Percy Watson (politician) (born 1951), American politician", "*Percy Watson (bowls) (1894–?), Northern Ireland lawn bowler"]}]}}