{"wiki_id": "http://www.wikidata.org/entity/Q7160472", "itemLabel": "Peet Coombes", "itemDescription": "English guitarist and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Peet_Coombes", "wikipedia_page": {"main": "Peter George \"Peet\" Coombes (1952–1997) was an English guitarist, vocalist and songwriter. He was the lead singer and primary songwriter of the group The Tourists, the first charting band to feature guitarist Dave Stewart and singer Annie Lennox, later to gain greater fame as the duo Eurythmics.", "link_mentions": [{"page": "Eurythmics", "response": ["Lennox and Stewart met in 1975 in a restaurant in London, where Lennox worked at that time. They first played together in 1976 in the punk rock band The Catch. After releasing one single as The Catch in 1977, the band evolved into The Tourists. Stewart and Lennox were also romantically involved. The Tourists achieved some commercial success, but the experience was reportedly an unhappy one. Personal and musical tensions existed within the group, whose main songwriter was Peet Coombes, and legal wranglings happened with the band's management, publishers and record labels. Lennox and Stewart felt the fixed band line-up was an inadequate vehicle to explore their experimental creative leanings and decided their next project should be much more flexible and free from artistic compromise. They were interested in creating pop music, but wanted freedom to experiment with electronics and the avant-garde."]}, {"page": "The Tourists", "response": ["Guitarists Peet Coombes and Dave Stewart were members of the folk rock band Longdancer, which was on Elton John's Rocket Records label. They moved to London, where they met singer Annie Lennox, who had dropped out of a course at the Royal Academy of Music to pursue her ambitions in pop music.", "* Peet Coombes – vocals, guitar"]}, {"page": "Annie Lennox", "response": ["Managed by Simon Fuller since the beginning of her solo career, he said that Lennox played an important but unheralded role in the success of the Spice Girls, encouraging the group to \"ham up\" their characters, which helped them top the charts around the world. In 1997, Lennox re-recorded the Eurythmics track \"Angel\" for the Diana, Princess of Wales: Tribute album, and also recorded the song \"Mama\" for The Avengers soundtrack album. In 1998, following the death of a mutual friend (former Tourists member Peet Coombes), she re-united with Dave Stewart. Following their first performance together in eight years at a record company party, Stewart and Lennox began writing and recording together for the first time since 1989. This resulted in the album Peace. The title was designed to reflect the duo's ongoing concern with global conflict and world peace. The record was promoted with a concert on the Greenpeace vessel Rainbow Warrior II, where they played a mixture of old and new songs. \"I Saved the World Today\" was the lead single, reaching number eleven on the UK singles chart. Another single, released at the beginning of 2000, \"17 Again\", made the UK top 40, and topped the US dance chart.[ Eurythmics Album & Song Chart History] Billboard. 7 November 2011 In 2002, Lennox received a Billboard Century Award; the highest accolade from Billboard Magazine, with Editor-in-Chief Timothy White describing her as one of \"the most original and unforgettably affecting artists in the modern annals of popular music.\""]}, {"page": "Dave Stewart (musician and producer)", "response": ["Stewart was born in Sunderland, England, in 1952 and he attended Barnes Infants and Junior School and Bede Grammar School for Boys.Eurythmics Star Dave Stewart Honoured With Award at Sunderland Echo . Retrieved 3 January 2014 Whilst still in his teens, he secured a record deal as part of folk-rock band Longdancer. Despite being signed to Elton John's record label, The Rocket Record Company, they did not achieve commercial success. He also collaborated with Brian Harrison to produce an EP on the Sunderland Multicord label (label number MULT-SH-1, producer Ken McKenzie), recording two songs (\"Girl\" and \"Green She Said\") from a school musical production written by teacher Dick Bradshaw, one traditional number (\"A Blacksmith Courted Me\") and a song written by Dave and Brian (\"Deep December\"). After leaving Wearside Stewart spent several years living in squats in London. In late 1976, he was introduced to Annie Lennox by Paul Jacobs. Soon, Stewart and Lennox became romantically involved. By 1977, the pair had teamed up with Sunderland musician Peet Coombes, releasing a single on Logo Records as The Catch. The band then developed into The Tourists who enjoyed modest success, including a hit in 1979 with a cover of the Dusty Springfield hit \"I Only Want to Be with You\"."]}, {"page": "Chester P", "response": ["Joey Coombes (born 21 June 1976), better known as Chester P, is a rapper in the UK hip-hop scene. He was a founding member of Task Force, Bury Crew and the M.U.D. Family.M.U.D. Family's artist profile on Suspect-Packages.com  He and his brother Farma G are both sons of the late musician Peet Coombes."]}, {"page": "Coombes (surname)", "response": ["* Peet Coombes (1952–1997), British musician, guitarist and vocalist"]}, {"page": "Peet", "response": ["*Peet Coombes (1952–1997), English musician"]}, {"page": "Reality Effect", "response": ["Although the band featured Lennox and her future Eurythmics partner Dave Stewart on guitar, the bulk of the songs were written by singer/guitarist Peet Coombes. The album peaked at #23 on the UK Album Chart, and spent a total of sixteen weeks in the Top 100.", "All tracks composed by Peet Coombes except where indicated", "#\"Circular Fever\" – 3:06 (Peet Coombes, Dave Stewart)", "*Peet Coombes – vocals, electric 6-string & 12-string guitars"]}, {"page": "The Tourists (album)", "response": ["*Original credits:  All tracks written by Peet Coombes.", "* Performer – Annie Lennox, David A. Stewart, Eddie Chin, Jim \"Do It\" Toomey, Peet Coombes", "* All tracks written by – Peet Coombes"]}, {"page": "Luminous Basement", "response": ["All tracks written by Peet Coombes except where noted.", "In a retrospective review for AllMusic, William Ruhlmann wrote, \"The Tourists' third album found the group continuing to expand its musical horizons, especially by integrating Annie Lennox's keyboards into the mix, while maintaining their basic pop/rock focus. Peet Coombes's lyrics had an inward-looking, psychoanalytical focus, and Lennox, on her one contribution, \"One Step Near the Edge,\" maintained that introspection, while Dave Stewart brought in a Yardbirds-like raveup in \"Let's Take a Walk.\" \"Don't Say I Told You\" showed that the group could still come up with an ear-catching single, but it and the album enjoyed only modest success.\""]}, {"page": "Farma G", "response": ["Robin Coombes, better known as Farma G, is a singer and rapper,  one half of UK hip-hop group Task Force, and a founding member of Bury Crew and the M.U.D. Family. He and his brother Chester P are both sons of the late musician Peet Coombes."]}, {"page": "So Good to Be Back Home Again", "response": ["The energetic song \"is one of The Tourists' few love songs, especially unlikely with its cheerful tone\", with Annie Lennox and Peet Coombes harmonising together. It is also \"clearly drawn from early Beatles'\"."]}]}}