{"wiki_id": "http://www.wikidata.org/entity/Q7173887", "itemLabel": "Peter Evans-Freke, 11th Baron Carbery", "itemDescription": "Soldier, insurance company director, peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Evans-Freke,_11th_Baron_Carbery", "wikipedia_page": {"main": "Peter Ralfe Harrington Evans-Freke, 11th Baron Carbery (20 March 1920 – 28 July 2012) was the 11th Baron Carbery from 1970 until his death at the age of 92 in 2012.Evans-Freke was educated at Downside, a Benedictine boarding school in Somerset. He later joined the Royal Engineers and during the Second World War saw active service behind enemy lines in Burma, where he took part in raids to destroy Japanese infrastructure. He then served in British India and ended his military service with the rank of captain.\nFollowing World War II, Evans-Freke became a director of an equine and livestock insurance company. He married firstly Joyzelle, an Australian, and they had three sons and two daughters. In a marriage which lasted more than sixty years, the couple were frequent visitors to Lourdes.On 25 December 1970 Evans-Freke succeeded an uncle in the family peerage and baronetcy. \nHe had an interest in agriculture, music and poetry. He was a Traditionalist Catholic, and became a Military Knight of Malta, one of the most important of the military orders of the Roman Catholic Church. \nFollowing his wife's death in 2006, Carberry married again, remaining with his second wife, Elisabeth, until his death in July 2012.\nCarbery's body was entombed in the ancient family vault, the crypt of the ruined chapel of Castle Freke in West Cork. This followed a funeral ceremony and Tridentine Mass at the church in Rathbarry. His remains were entombed next to those of his first wife, who was buried in the same place in 2006. That was the first time the vault at Castle Freke had been opened since 1852. His religious beliefs were reflected in the placing of a rosary on his coffin for the Mass.Carberry was outlived by his second wife, Elisabeth, Lady Carbery, and his five children, and was succeeded by his son Michael Evans-Freke, 12th Baron Carbery.", "link_mentions": [{"page": "List of Old Gregorians", "response": ["* Peter Evans-Freke, 11th Baron Carbery - Anglo Irish Peer"]}, {"page": "2012 in Ireland", "response": ["*28 July – Peter Evans-Freke, 11th Baron Carbery, 92, Anglo-Irish peer"]}, {"page": "2012 in the United Kingdom", "response": ["** Peter Evans-Freke, 11th Baron Carbery, 92, Anglo-Irish peer."]}, {"page": "Deaths in July 2012", "response": ["*Peter Evans-Freke, 11th Baron Carbery, 92, Anglo-Irish peer."]}, {"page": "Michael Evans-Freke, 12th Baron Carbery", "response": ["The son of Peter Evans-Freke, 11th Baron Carbery, and Joyzelle Mary Binnie, he succeeded to the peerage upon his father's death in 2012. The heir apparent to the title is his son, Hon. Dominic Ralfe Cecil Evans-Freke (born 1969)."]}]}}