{"wiki_id": "http://www.wikidata.org/entity/Q7177013", "itemLabel": "Peter Sneath", "itemDescription": "British microbiologist (1923-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Sneath", "wikipedia_page": {"main": "Peter Henry Andrews Sneath FRS, MD (17 November 1923 – September 9, 2011) was a microbiologist who co-founded the field of numerical taxonomy, together with Robert R. Sokal. Sneath and Sokal wrote Principles of Numerical Taxonomy, revised in 1973 as Numerical Taxonomy. Sneath reviewed the state of numerical taxonomy in 1995 and wrote some autobiographical notes in 2010.A special issue of the journal Antonie van Leeuwenhoek, on microbial systematics, is dedicated to the memory of Peter Sneath.", "link_mentions": [{"page": "Cladistics", "response": ["The term \"clade\" was introduced in 1958 by Julian Huxley after having been coined by Lucien Cuénot in 1940, \"cladogenesis\" in 1958,Webster's 9th New Collegiate Dictionary \"cladistic\" by Arthur Cain and Harrison in 1960, \"cladist\" (for an adherent of Hennig's school) by Ernst Mayr in 1965, and \"cladistics\" in 1966. Hennig referred to his own approach as \"phylogenetic systematics\". From the time of his original formulation until the end of the 1970s, cladistics competed as an analytical and philosophical approach to systematics with phenetics and so-called evolutionary taxonomy. Phenetics was championed at this time by the numerical taxonomists Peter Sneath and Robert Sokal, and evolutionary taxonomy by Ernst Mayr."]}, {"page": "Hypothetical types of biochemistry", "response": ["| Hydrogen fluoride has been considered as a possible solvent for life by scientists such as Peter Sneath.", "Hydrogen fluoride (HF), like water, is a polar molecule, and due to its polarity it can dissolve many ionic compounds. Its melting point is −84 °C, and its boiling point is 19.54 °C (at atmospheric pressure); the difference between the two is a little more than 100 K. HF also makes hydrogen bonds with its neighbor molecules, as do water and ammonia. It has been considered as a possible solvent for life by scientists such as Peter Sneath cited in  and Carl Sagan.", "*Peter Sneath (1923–2011), microbiologist, author of the book Planets and Life."]}, {"page": "Phenetics", "response": ["In biology, phenetics ( - to appear) , also known as taximetrics, is an attempt to classify organisms based on overall similarity, usually in morphology or other observable traits, regardless of their phylogeny or evolutionary relation. It is closely related to numerical taxonomy which is concerned with the use of numerical methods for taxonomic classification. Many people contributed to the development of phenetics, but the most influential were Peter Sneath and Robert R. Sokal. Their books are still primary references for this sub-discipline, although now out of print.Sneath, P. H. A. & R. R. Sokal. 1973. Numerical taxonomy — The principles and practice of numerical classification. W. H. Freeman, San Francisco. xv + 573 p."]}, {"page": "Species", "response": ["In the 1970s, Robert R. Sokal, Theodore J. Crovello and Peter Sneath proposed a variation on the morphological species concept, a phenetic species, defined as a set of organisms with a similar phenotype to each other, but a different phenotype from other sets of organisms. It differs from the morphological species concept in including a numerical measure of distance or similarity to cluster entities based on multivariate comparisons of a reasonably large number of phenotypic traits."]}, {"page": "2011 in the United Kingdom", "response": ["**Peter Sneath, microbiologist (b. 1923)"]}, {"page": "Deaths in September 2011", "response": ["*Peter Sneath, 87, British microbiologist."]}, {"page": "Peter Henry Andrews Sneath", "response": ["#REDIRECTPeter Sneath"]}, {"page": "P.A.H. Sneath", "response": ["#REDIRECTPeter Sneath"]}, {"page": "P.H.A. Sneath", "response": ["#REDIRECTPeter Sneath"]}, {"page": "Peter H. A. Sneath", "response": ["#REDIRECT Peter Sneath"]}, {"page": "Sneath", "response": ["* Peter Sneath (1923–2011), British microbiologist"]}, {"page": "Peter H.A. Sneath", "response": ["#REDIRECT Peter Sneath"]}]}}