{"wiki_id": "http://www.wikidata.org/entity/Q7177552", "itemLabel": "Peter Wales", "itemDescription": "cricketer (1928-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Wales", "wikipedia_page": {"main": "Peter John Wales (30 October 1928 – 3 October 2018) was a former English cricketer. Wales was a right-handed batsman who bowled right-arm medium pace. He was born in Hove, Sussex and was educated at the Hove Grammar School.Wales made his debut for Sussex in the 1948 Minor Counties Championship against Surrey. Shaw played Minor counties cricket for Sussex from 1948 to 1949, which included 13 Minor Counties Championship matches.Wales made a single first-class appearance for Sussex against Hampshire at Manor Sports Ground, Worthing in 1951. In Hampshire's first-innings, Wales took the wickets of Jimmy Gray, Leo Harrison and Derek Shackleton for the cost of 12 runs from nine overs. He opened the batting in Sussex's first-innings, scoring 29 runs before being bowled by Charles Knott. In Hampshire's second-innings, he took the wickets of Alan Rayment and Richard Carty for the cost of just one run from four overs. He ended Sussex's second-innings unbeaten on 9, with Sussex winning by 10 wickets. Despite a strong showing in the match, this was Wales' only major appearance for Sussex.\nWales died in Bognor Regis, Sussex on 3 October 2018 at the age of 89.\n\n", "link_mentions": [{"page": "List of people from Brighton and Hove", "response": ["*Peter Wales, Sussex cricketer, born in Hove in 1928"]}, {"page": "1928 in the United Kingdom", "response": ["**Peter Wales, Sussex cricketer (died 2018)"]}, {"page": "Blatchington Mill School and Sixth Form College", "response": ["* Peter Wales, Sussex cricketerProfile of Peter Wales"]}, {"page": "Wales (surname)", "response": ["* Peter Wales (1928–2008), English cricketer"]}, {"page": "List of people named Peter", "response": ["* Peter Wales (1928–2008), English cricketer"]}, {"page": "2018 in the United Kingdom", "response": ["**Peter Wales, 89, Sussex cricketer.Profile of Peter Wales"]}, {"page": "Deaths in October 2018", "response": ["*Peter Wales, 89, English cricketer.Profile of Peter Wales"]}, {"page": "Wales, Peter", "response": ["#redirectPeter Wales"]}]}}