{"wiki_id": "http://www.wikidata.org/entity/Q7175386", "itemLabel": "Peter Lawrenson", "itemDescription": "British electrical engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Lawrenson", "wikipedia_page": {"main": "Peter John Lawrenson, FIEE, FIEEE, FRS, FREng (12 March 1933 – 27 October 2017) was an Emeritus Professor of Electrical Engineering at the University of Leeds who pioneered and championed the development of switched reluctance drive technology. He also made significant contributions to the analysis and computation of magnetic fields and electrical machines in general, writing several notable text books along with colleagues Kenneth Binns, Martyn Harris and J. Michael Stephenson  and latterly with C.W. (\"Bill\") Trowbridge.", "link_mentions": [{"page": "Prescot", "response": ["*Electrical engineer, scientist and entrepreneur Professor Peter Lawrenson was born in Prescot."]}, {"page": "The Prescot School", "response": ["* Prof Peter Lawrenson, award-winning electrical engineer, President from 1992 to 1993 of the Institution of Electrical Engineers"]}, {"page": "IEEE Edison Medal", "response": ["* 2005: Peter Lawrenson"]}, {"page": "Switched reluctance motor", "response": ["The principles for SR drives were described around 1970, and enhanced by Peter Lawrenson and others from 1980 onwards.\"Variable-speed switched reluctance motors\", P.J. Lawrenson, J.M. Stephenson, P.T. Blenkinsop, J. Corda and N.N. Fulton, IEE Proceedings B - Electric Power Applications, Volume 127, Issue 4, 1980. pp. 253-265 At the time, some experts viewed the technology as unfeasible, and practical application has been limited, partly because of control issues and unsuitable applications, and because low production numbers result in higher cost."]}, {"page": "Lawrenson", "response": ["*Peter Lawrenson (1933–2017), British electrical engineer"]}, {"page": "Peter John Lawrenson", "response": ["#REDIRECTPeter Lawrenson"]}, {"page": "2017 in the United Kingdom", "response": ["**Peter Lawrenson, 84, electrical engineer."]}, {"page": "Deaths in October 2017", "response": ["*Peter Lawrenson, 84, British electrical engineer.Peter John Lawrenson"]}, {"page": "Lawrenson, Peter", "response": ["#redirectPeter Lawrenson"]}]}}