{"wiki_id": "http://www.wikidata.org/entity/Q7173714", "itemLabel": "Peter Dougall", "itemDescription": "Scottish footballer (1909-1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Dougall", "wikipedia_page": {"main": "Peter G. Dougall (21 March 1909 – 12 June 1974) was a Scottish footballer who played at inside-left for various clubs in the 1920s and 1930s. He later managed in the Netherlands.", "link_mentions": [{"page": "Laurie Cumming", "response": ["Cumming was transferred to Southampton in June 1930 for £500, making his Saints debut in a 5–0 defeat by Preston North End on the opening day of the season, followed by a spell of four goals in nine games, including a brace in an away win over Plymouth Argyle. As winter set in and the pitches grew heavier his form dried up, and he never once found the net again in the Football League. He was dropped in February 1931, losing his place to Peter Dougall. At the end of the season, Cumming was placed on the transfer list at his own request."]}, {"page": "Herbert Coates", "response": ["In the following season, he was a regular starter until early March, with Peter Dougall generally filling in when Coates was not available; Coates made a total of 25 appearances during the season, with four goals. He played for the \"Amateurs\" in the 1929 FA Charity Shield. For the 1930–31 season, he was restricted to sixteen appearances, most of which came in a spell between late September and December in which he scored seven goals, including two in a 5–0 victory over Bury on 13 December."]}, {"page": "Peter Dougal", "response": ["#REDIRECT Peter Dougall"]}, {"page": "Amsterdamsche FC", "response": ["| Piet Huisken and  Peter Dougall"]}, {"page": "Arthur Wilson (English footballer)", "response": ["He was quickly spotted by scouts from Southampton and he joined the south coast club in August 1927. After spending two seasons in the reserves, where he showed \"admirable skill\", he made his first-team debut when he replaced the veteran Bert Shelley for a Second Division match away to Reading on 14 December 1929. Wilson retained his position at left-half for the remainder of the season and for the start of the 1930–31 season. After three matches, he lost his place to Bill Adams and briefly switched to inside left before being replaced by Herbert Coates. In the following season, Wilson alternated with Coates and Peter Dougall for the inside-left position."]}, {"page": "DHC Delft", "response": ["* Peter Dougall (1948–)"]}, {"page": "List of foreign Ligue 1 players: S", "response": ["* Peter Dougall – Sète – 1932–33"]}, {"page": "1929–30 Southampton F.C. season", "response": ["Transfer activity continued during the course of the season. In September 1929, the Saints Supporters Club raised £400 to sign Scottish inside-left Peter Dougall (as well as teammate Hood) from Clyde, with an additional £50 to be paid should either player make six appearances for the club. In October, recent amateur signing Ernie Warren left the club to sign another amateur deal with Southwick, although by March 1930 he had returned to sign for the Saints as a professional. The most significant transfer of the season came in February, when the campaign's top scorer Dick Rowley was sold to Tottenham Hotspur for a fee of £3,750, the club's second highest transfer fee to date after the £3,860 received for Bill Rawlings two years earlier. In March the club signed forward Thomas Groves from Blakenall and Scottish half-back Alex Sharp from Ayr United, with Warren also returning on professional terms. Just before the end of the season, Oswald Littler left Southampton to join Southern League side Guildford City.", "!scope=\"row\"|Peter Dougall", "!scope=\"row\"|Peter Dougall"]}, {"page": "1930–31 Southampton F.C. season", "response": ["!scope=\"row\"|Peter Dougall", "|align=\"left\"|Peter Dougall"]}, {"page": "1931–32 Southampton F.C. season", "response": ["Outside of the league and the FA Cup, Southampton played eight additional first-team matches during the 1931–32 season. The first was a friendly match against a Royal Air Force side at The Dell in November, which the Saints won 4–0 thanks to a brace from Frank Matson and goals from Peter Dougall and Arthur Holt. A second friendly in January against Third Division South club Exeter City ended in a 2–0 loss, which was followed in March by a 6–1 thrashing at the hands of a team representing the Dutch FA in Rotterdam (the only goal for the visitors scored by Arthur Wilson). A final friendly, at a side representing the Southern Command, took place in April and ended in a 3–1 win for Southampton, thanks to goals from Johnny Arnold, Tom Brewis and Ted Drake.", "!scope=\"row\"|Peter Dougall"]}, {"page": "1932–33 Southampton F.C. season", "response": ["Due to mounting financial problems, Southampton were forced to sell numerous players after the end of the 1931–32 season. Amongst those transferred were centre-forward Arthur Haddleton, outside-right Bert Jepson and inside-right Bill Fraser, all of whom joined Fulham, who had recently been promoted to the Second Division from the Third Division South. Half-back Arthur Wilson was sold to recently relegated West Ham United for £500, goalkeeper Willie White joined Third Division South side Aldershot, inside-left Peter Dougall was transferred to French side Sète, centre-half Johnny McIlwaine joined Welsh club Llanelli for a season, and inside-forward Henry O'Grady signed for Leeds United in the First Division. The club also sold reserve players Fred Allan and Chris Crossley, while Frank Matson was forced to retire due to problems with his eyesight. The end of the season also marked the end of the playing career of right-half Bert Shelley, who had made a then-club record 465 appearances in all competitions since he joined in 1919 (the record remained until 1964, when it was surpassed by left-back Tommy Traynor). Shelley remained at Southampton as a trainer for the youth team.", "!scope=\"row\"|Peter Dougall"]}, {"page": "Dougall", "response": ["*Peter Dougall (1909–1974), Scottish footballer"]}, {"page": "Dougall, Peter", "response": ["#redirectPeter Dougall"]}]}}