{"wiki_id": "http://www.wikidata.org/entity/Q7174564", "itemLabel": "Peter Hartley", "itemDescription": "English county cricketer and umpire (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Hartley_(cricketer)", "wikipedia_page": {"main": "Peter John Hartley (born 18 April 1960) is an English first-class cricketer and umpire.", "link_mentions": [{"page": "Keighley", "response": ["*Peter Hartley, (1960–), former county cricketer for Yorkshire, Warwickshire and Hampshire"]}, {"page": "James Tomlinson", "response": ["Under new captain Dimitri Mascarenhas, Tomlinson featured heavily in the 2008 County Championship, making his highest amount of first-class appearances in a season for the county, playing in all sixteen of Hampshire's Championship fixtures.  At the forefront of Hampshire's attack, Tomlinson claimed four five wicket hauls across the season, including his career best figures of 8/46 against Somerset at Taunton, figures which remain his innings return to date.  He ended the season with 67 wickets at an average of 24.76, to end the season as the leading wicket-taker in the County Championship, and becoming the first Hampshire cricketer to do so since Malcolm Marshall in 1982.  His 8/46 against Somerset were also the best figures by a Hampshire since Peter Hartley's 8/65 in 1999.  He won his Hampshire cap during this season, and was named the county's Player of the Year."]}, {"page": "2006 ball-tampering controversy", "response": ["On 28 September, the ICC match referee Ranjan Madugalle chaired the hearing into Inzamam's case and acquitted him of the ball-tampering charge stating, \"Having regard to the seriousness of the allegation of ball-tampering [it is an allegation of cheating], I am not satisfied on the balance of probabilities that there is sufficiently cogent evidence that the fielding team had taken action likely to interfere with the condition of the ball\" in his official report,Cricinfo – Ranjan Mudagalle's decision in full but banned him for four One Day Internationals for bringing the game into disrepute. Each of the ICC-appointed match officials (Hair, Doctrove, Cowie, Trevor Jesty, Mike Procter, and Peter Hartley) were of the opinion that markings on the ball indicated tampering."]}, {"page": "Peter Kippax", "response": ["After his rejection by Yorkshire he turned his attention to the leagues and, from 1975 to 1990, Minor Counties cricket with Durham. Fifteen years after his last Yorkshire appearance he turned out for the MCC against the Tykes at North Marine Road Ground, Scarborough in September 1987, taking the wickets of centurians Ashley Metcalfe and Ian Swallow, as well as Peter Hartley and Phil Robinson for a duck."]}]}}