{"wiki_id": "http://www.wikidata.org/entity/Q7172318", "itemLabel": "Pete Vuckovic", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Pete_Vuckovic", "wikipedia_page": {"main": "Peter Bryan Vuckovic (born 1971 in Devon, England) is an English singer-songwriter and bass player.", "link_mentions": [{"page": "Tiverton, Devon", "response": ["*Pete Vuckovic (born 1971), singer/songwriter, was born in Tiverton."]}, {"page": "Diamond Head (English band)", "response": ["*Pete Vuckovic – bass, backing vocals (1992–1994)"]}, {"page": "3 Colours Red", "response": ["In 1994, it was suggested by a mutual friend that bass player/singer Pete Vuckovic should contact guitarist Chris McCormack (ex-Forgodsake/Gunslinger) to start a band, as both had recently left their previous bands and were looking for something new. Due to location they spent the following months trading four track recordings and developing song ideas via post, until they had enough material to record a three-song demo with newly-acquired drummer Keith Baxter (formerly of Skyclad). Terry Thomas was hired as the band's manager as well as producer of the demos (the first to feature guitarist Ben Harding) that secured their recording contract.", "*Pete Vuckovic (lead vocals, bass)"]}, {"page": "Death and Progress", "response": ["* Pete Vuckovic – bass, backing vocals"]}, {"page": "The Union of Souls", "response": ["* Pete Vuckovic- Vocals/ bass"]}, {"page": "Chris McCormack (guitarist)", "response": ["He originally moved to London to join Honeycrack with C. J. from The Wildhearts but ended up forming 3 Colours Red with ex- Diamond Head bassist Pete Vuckovic instead. They went on to record two UK top 40 albums and six UK top 40 singles before splitting at their peak in 1999, due to differences of opinion between the pair. He soon joined electro rockers Grand Theft Audio with Rich Battersby from The Wildhearts, and spent several months touring the US with them before they were eventually dropped by the record label, forcing them to return home. 3 Colours Red reformed in 2002 and released a third album but split again in 2005, due to further problems between himself and Vuckovic."]}, {"page": "Keith Baxter (drummer)", "response": ["Following the split of the band in 1999, Baxter formed the band Elevation with former bandmate from 3 Colours Red, Pete Vuckovic. The pair signed with Sony but were dropped a year later. He moved back north to Lancaster, and briefly played with the Northern Irish band, Therapy? in 2002. 3 Colours Red formed again soon after that to record a third album (The Union of Souls), but split up again, permanently, in 2005.Kerrang! 3 Colours Red's Keith Baxter RIP "]}, {"page": "Pure (3 Colours Red album)", "response": ["* Pete Vuckovic – Vocals/Bass"]}, {"page": "Revolt (3 Colours Red album)", "response": ["All songs written by Chris McCormack and Pete Vuckovic unless otherwise stated.", "* Pete Vuckovic- Vocals/ bass"]}, {"page": "Beautiful Day (3 Colours Red song)", "response": ["The song was written by frontman/bassist Pete Vuckovic and recorded at Westside Studios in London. It surprised many, showing a more sensitive and epic side to the band's previously punk/pop-dominated sound (although their debut album featured 'Fit Boy and Faint Girl' and 'Copper Girl' which were both in a similar vein). It went on to become the band's biggest commercial hit, reaching number 11 in the UK charts in January 1999, throwing them further into the media spotlight at a time when the talk surrounding the band was of them being dropped. It also paved the way for the band's American campaign where the song received considerable radio airplay, even entering the charts. The band toured the US with Silverchair, and Vuckovic subsequently did an acoustic promotional tour of radio stations on the back of the song's success.", "* Pete Vuckovic- Vocals/ Bass/ Composer"]}, {"page": "If You Ain't Got a Weapon...", "response": ["If You Ain't Got a Weapon... is a double compilation CD by U.K Britrock band 3 Colours Red, covering their period with independent label Creation Records. The first disc features the band's singles plus two live tracks, while the second consists of B-sides. Both discs were compiled by frontman/bassist Pete Vuckovic. He also contributes handwritten sleevenotes. It was released on Sanctuary Records in 2005, alongside other compilations by Swervedriver and The Boo Radleys as part of their 'Creation Anthology'. The album title comes from the lyrics of one of their most successful songs, \"Nuclear Holiday.\""]}, {"page": "Nuclear Holiday", "response": ["* Pete Vuckovic - vocals/bass"]}, {"page": "Radiator (band)", "response": ["In 2001 Jarvis formed a new band Elevation with ex-3 Colours Red members Pete Vuckovic and Keith Baxter."]}, {"page": "Serbs in the United Kingdom", "response": ["* Pete Vuckovic, singer/songwriter"]}, {"page": "Vučković", "response": ["*Pete Vuckovic, British singer-songwriter"]}, {"page": "Simon Hall (chemist)", "response": ["Born in Stratford-Upon-Avon, Hall grew up in Tiverton, Devon. He attended Tiverton Comprehensive School (now Tiverton High School), where he played rhythm guitar in the band of future 3 Colours Red frontman Pete Vuckovic. On leaving school, he worked for Reuters Ltd. as a stocks and bonds pricing analyst, simultaneously studying for a BSc degree with the Open University. On graduating with a 2:1 degree in Chemistry with Geology in 1997, he joined the laboratories of Professor Stephen Mann at the University of Bristol to read for a PhD in Materials Chemistry. His doctoral research degree involved the creation of novel nanomaterials using a biomimetic approach and also the first ever electron diffraction study on the phylum Bryozoa."]}, {"page": "Ben Harding (musician)", "response": ["After Senseless Things split in 1995, Harding joined 'Britrock'/punk band 3 Colours Red with vocalist/bassist Pete Vuckovic, guitarist Chris McCormack and drummer Keith Baxter. Three Colours Red released two LPs and a series of singles/EPs between 1996 and 1999, achieving two UK Top 20 albums, and six Top 40 singles, including the Top 20 hit \"Beautiful Day\" before dissolution in 1999. The band played Sex Pistols' Finsbury Park comeback gig in 1996; they also supported KISS and Aerosmith."]}]}}