{"wiki_id": "http://www.wikidata.org/entity/Q7173197", "itemLabel": "Peter Carter", "itemDescription": "British Chief Executive of the Royal College of Nursing", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Carter_(nurse)", "wikipedia_page": {"main": "Peter Carter, OBE (born 1949) is an Independent Healthcare Consultant. Previously he has served as the general secretary and Chief Executive of the Royal College of Nursing. He is a Fellow of the Royal College of Nursing, and Hon fellow of the Royal College of General Practitioners and an Ad Eundem of the Royal College of Surgeons of Ireland", "link_mentions": [{"page": "Noreena Hertz", "response": ["Peter Carter, the general secretary of the Royal College of Nursing, said that the fund offered financial support and \"a helping hand to nurses in times of hardship and times of need.\" Hertz said she picked nurses to be the beneficiaries of the campaign because they were among the worst paid public servants with professional qualifications, earning one-third less than teachers by the time they are established in their careers."]}, {"page": "List of nurses", "response": ["*Dr Peter Carter OBE, British nurse and general secretary of the Royal College of Nursing"]}, {"page": "East Kent Hospitals University NHS Foundation Trust", "response": ["In October 2017 after months of very poor performance against the A&E four hour target it was clearly the worst performing trust in England on A&E in 2017-18, with around 30%t of patients waiting over four hours.  The Chair of the trust, Nikki Cole, resigned and was replaced by Peter Carter.  In 2017-18 East Kent Hospitals saw 74.3% of A&E patients within four hours.The 10 worst A&Es for waits revealed BBC"]}, {"page": "Peter Carter", "response": ["Peter Carter may refer to:", "* Peter Carter (academic lawyer) (1921–2004), Fellow of Wadham College, Oxford", "* Piero Lulli (1929-1991) actor credited as Peter Carter", "* Peter Carter (author) (1929–1999), British children's writer", "* Peter Carter (director) (1933–1982), Canadian film and television director", "* Peter Carter (diplomat) (1956–2014), British Ambassador to Estonia 2007 to 2012", "* Peter Carter (tennis) (1964–2002), Australian tennis player and coach", "* Peter Carter (nurse), British nurse", "* Peter Carter (footballer) (born 1959), Australian rules footballer", "* Peter Carter-Ruck (1914–2003), English lawyer"]}, {"page": "Bahrain health worker trials", "response": ["The International Council of Nurses and World Medical Association issued a joint statement objecting to the closed military trial and stated its belief that \"Doctors and nurses have an ethical duty to care for patients irrespective of their race, colour, creed and political affiliation. No health professional should be put on trial for looking after injured and dying people.\" The U.K.-based Royal College of Nursing wrote to the Bahraini government on the health workers' behalf, as well as sending them a direct video message of support in which General Secretary Peter Carter said, \"All you were doing was your job. You were trying to care for people.\""]}]}}