{"wiki_id": "http://www.wikidata.org/entity/Q7174321", "itemLabel": "Peter Graeme", "itemDescription": "English oboist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Graeme", "wikipedia_page": {"main": "Graeme Peter Crump (1921 – 1 March 2012), known professionally as Peter Graeme and as 'Timmy' Crump to friends and family,  was an English oboist and academic teacher. He was best known as the principal oboist of the Melos Ensemble.", "link_mentions": [{"page": "List of oboists", "response": ["* Peter Graeme (1921–2012), English"]}, {"page": "Léon Goossens", "response": ["Goossens commissioned a number of works for the oboe from such distinguished composers as Sir Edward Elgar, Ralph Vaughan Williams and Rutland Boughton and collaborated extensively with other prominent soloists such as Yehudi Menuhin. Amongst his many pupils were the oboists Evelyn Barbirolli, Joy Boughton, daughter of Rutland Boughton and Peter Graeme, oboist of the Melos Ensemble.Bliss. Clarinet Quintet. Oboe Quintet. Melos Ensemble Gramophone"]}, {"page": "The Curlew", "response": ["* Alexander Young (tenor), Lionel Solomon (flute), Peter Graeme (English horn), Sebastian String Quartet (Argo LP RG 26) (January 1954)Argo listings."]}, {"page": "William Waterhouse (bassoonist)", "response": ["He recorded with the Melos Ensemble, its principal players Richard Adeney and William Bennett (flute), Gervase de Peyer and Keith Puddy (clarinet), Stephen Trier (bass clarinet), Peter Graeme and Sarah Barrington (oboe), Neill Sanders and James Buck (horn), Edgar Williams (bassoon), Emanuel Hurwitz and Ivor McMahon (violin), Cecil Aronowitz (viola), Terence Weil (cello), Adrian Beers (double bass), Lamar Crowson (piano):Melos Ensemble – Music among Friends, EMI"]}, {"page": "Melos Ensemble", "response": ["Other early members included Gervase de Peyer (first clarinet) Emanuel Hurwitz (leader 1956–1972), Ivor McMahon (second violin), William Waterhouse (bassoon), Osian Ellis (harp), James Blades (percussion), Lamar Crowson and Ernst Ueckermann (piano), Peter Graeme and Sarah Barrington (oboe), James Buck (horn), Edgar Williams (bassoon) and Keith Puddy (clarinet), expanded by Colin Chambers (flute and piccolo), Alan Hacker (bass clarinet), Eric Roseberry (piano), Leonard Friedman (violin), Kay Hurwitz (viola), William Bennett (flute), Stephen Pruslin (piano), Leonard Friedman (violin), Hilary Wilson (harp)Wardour Castle Summer School Concert programme 1965 and Timothy Brown (horn). In the opinion of William Waterhouse (writing in 1995), \"it was the remarkable rapport between this pair of lower strings\" (i.e. Terence Weil and Cecil Aronowitz) \"which remained constant throughout a succession of distinguished leaders, that gave a special distinction to this outstanding ensemble.\",Obituary Terence Weil The Independent, William Waterhouse, 9 March 1995 Obituary Gervase de Peyer\"the Guardian\"", "EMI reissued in 2011 a selection from historical recordings, titled \"Melos Ensemble – Music among Friends\". The principal players were Richard Adeney (and William Bennett, flute), Gervase de Peyer (and Keith Puddy, clarinet), Peter Graeme (and Sarah Barrington, oboe), Neil Sanders (and James Buck, horn), William Waterhouse (and Edgar Williams, bassoon), Emanuel Hurwitz (and Kenneth Sillito, first violin), Ivor McMahon (and Iona Brown, second violin), Cecil Aronowitz (and Kenneth Essex, viola), Terence Weil (and Keith Harvey, cello), Adrian Beers (double bass), Osian Ellis (harp) and Lamar Crowson (piano). The ensemble was expanded for single works by Christopher Hyde-Smith (flute), Anthony Jennings and Stephen Trier (bass clarinet), Barry Tuckwell (horn), David Mason and Philip Jones (trumpet), Arthur Wilson and Alfred Flaszinski (trombone), Robert Masters (violin), Manoug Parikian and Eli Goren (violin), Patrick Ireland (viola), Derek Simpson (cello), Hilary Wilson (harp), Marcal Gazelle (piano), James Blades, Tristan Fry, Jack Lees and Stephen Whittaker (percussion), and singers Mary Thomas (soprano) and Rosemary Phillips (contralto)."]}, {"page": "Pro Arte Orchestra", "response": ["In the early years other players in the orchestra included Cecil Aronowitz, Francisco Gabarró, Richard Adeney, Peter Graeme, Gervase de Peyer, Raymond Cohen and Alan Civil. The last London performance advertised by the orchestra was in 1970.\"Today's engagements\", The Times, 30 March 30 1970, p. 8."]}, {"page": "Ivor McMahon", "response": ["McMahon recorded chamber music with the Melos Ensemble, its principal players Richard Adeney and William Bennett (flute), Gervase de Peyer (clarinet), Peter Graeme (oboe), Neill Sanders and James Buck (horn), William Waterhouse (bassoon), Emanuel Hurwitz, Kenneth Sillito and Iona Brown (violin), Cecil Aronowitz  and Kenneth Essex (viola), Terence Weil and Keith Harvey (cello), Adrian Beers (double bass), Osian Ellis and Hilary Wilson (harp) and Lamar Crowson (piano).Melos Ensemble – Music among Friends EMI"]}, {"page": "Graeme (surname)", "response": ["* Peter Graeme (1921–2012), English oboist"]}, {"page": "Timothy Brown (hornist)", "response": ["Brown was a member of the Melos Ensemble in its second phase. In 1982 he performed and recorded with the ensemble at the festival Steirischer Herbst the Octet Op. 67 of Egon Wellesz, with Hugh Maguire and Nicholas Ward (violin), Patrick Ireland (viola), Terence Weil (cello), William Waterhouse (bassoon), Peter Graeme (oboe) and Thea King (clarinet)."]}, {"page": "2012 in the United Kingdom", "response": ["* 1 March – Peter Graeme, 90, oboist."]}, {"page": "Deaths in March 2012", "response": ["*Peter Graeme, 90, British oboist."]}, {"page": "2012 in British music", "response": ["*1 March – Peter Graeme, oboist, 90"]}, {"page": "Graeme Peter Crump", "response": ["#REDIRECT Peter Graeme"]}, {"page": "Graeme Crump", "response": ["#REDIRECT Peter Graeme"]}, {"page": "Peter Crump", "response": ["#REDIRECT Peter Graeme"]}, {"page": "Graeme, Peter", "response": ["#redirectPeter Graeme"]}]}}