{"wiki_id": "http://www.wikidata.org/entity/Q7172962", "itemLabel": "Peter Briggs", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Briggs_(scientist)", "wikipedia_page": {"main": "(Michael) Peter Briggs OBE (born 3 December 1944) was Master of the Company of Educators in the City of London in 2011/2012. He was appointed Officer of the Order of the British Empire (OBE) in the 2010 New Year Honours, shortly after his retirement from Roehampton University. At Roehampton, he was both Principal of Southlands College and a Pro Vice-Chancellor of the University. Prior to taking up his role at Roehampton, Briggs had been Chief Executive of the British Association for the Advancement of Science (the BA), which was subsequently rebranded the British Science Association in 2009. He spent 22 years at the BA, initially being responsible for developing its work with young people, then taking responsibility for media links and for enhancing the Association's growing role in the \"public understanding of science\" before being appointed Executive Secretary (later Chief Executive) in 1990. Briggs graduated from the University of Sussex with a BSc in molecular science in 1966 and a DPhil in theoretical chemistry in 1969. After two post-doctoral posts in the universities of Sheffield and Bristol, he changed tack and worked for seven years in the voluntary sector with roles in the Overseas Division of the Methodist Church and Christian Aid. He was awarded an honorary degree of D.Sc. by the University of Leicester in 2002.", "link_mentions": [{"page": "Peter Briggs", "response": ["Peter Briggs (born 12 December 1965) is an English cinematographer, screenwriter and television writer. Although he has worked in the motion picture industry for more than 20 years, he is best known for the film Hellboy. His films draw heavily on sources as diverse as weird fiction, fantasy, and war."]}, {"page": "Dr. Peter Briggs", "response": ["#REDIRECT Peter Briggs (scientist)"]}, {"page": "Michael Briggs", "response": ["*Michael Peter Briggs (scientist) (born 1944), British scientist and university administrator"]}, {"page": "2010 New Year Honours", "response": ["*Dr. Michael Peter Briggs, lately Pro-Vice-Chancellor, Roehampton University. For services to Higher Education."]}, {"page": "Michael Peter Briggs", "response": ["#REDIRECT Peter Briggs (scientist)"]}, {"page": "Briggs (surname)", "response": [":*Michael Peter Briggs (scientist) (born 1944), British scientist and university administrator"]}]}}