{"wiki_id": "http://www.wikidata.org/entity/Q7173689", "itemLabel": "Peter Doig", "itemDescription": "British politician (1911-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Doig_(politician)", "wikipedia_page": {"main": "Peter Muir Doig (27 October 1911 – 31 October 1996) was a British Labour Party politician.\nDoig was educated at Blackness School, Dundee before taking evening classes.  He later became a sales supervisor. He joined the Labour Party in 1930. During the Second World War he served in the Royal Air Force. He was elected a Dundee town councillor for ten years, serving as honorary town treasurer.\nDoig contested Aberdeen South in 1959. He was Member of Parliament for Dundee West from a 1963 by-election to 1979, preceding Ernie Ross. On 22 September 1963, Doig was chosen ahead of five other people to be the Labour Party candidate in the by-election. At the time he was a bakery supervisor and chairman of the Labour group on Dundee Town Council. He was also deputy chairman of the council.In 1966 Doig was recorded as a member of the Transport and General Workers Union and the Co-operative Society. He was married with two sons.In the 1970s Doig was one of a small number of Labour MPs who supported the restoration of capital punishment, and was reported to favour a \"hard line\" approach towards crime. In 1979, when chairing the Scottish Standing Committee of MPs he used his casting vote to support a Conservative proposal to give police in Scotland wider powers to search for offensive weapons.", "link_mentions": [{"page": "Peter Doig", "response": ["Peter Doig ( ; born 17 April 1959) is a British painter. One of the most renowned living figurative painters, he has settled in Trinidad since 2002. In 2007, his painting White Canoe sold at Sotheby's for $11.3 million, then an auction record for a living European artist. In February 2013, his painting, The Architect's Home in the Ravine, sold for $12 million at a London auction. Art critic Jonathan Jones said about him: \"Amid all the nonsense, impostors, rhetorical bullshit and sheer trash that pass for art in the 21st century, Doig is a jewel of genuine imagination, sincere work and humble creativity.\"Jonathan Jones (16 May 2015), \"Stroke of genius: Peter Doig's eerie art whisks the mind to enchanted places\", The Guardian.", "Peter Doig was born in Edinburgh, Scotland. In 1962 he moved with his family to Trinidad, where his father worked with a shipping and trading company, and then in 1966 to Canada. He moved to London to study at the Wimbledon School of Art in 1979–1980, Saint Martin's School of Art from 1980 to 1983, and Chelsea School of Art, in 1989–1990, where he received an MA. In 1989, the artist held a part-time job as a dresser at the English National Opera with his friend Haydn Cottam.Peter Doig, Gasthof (2002–2004) Christie's Post-War & Contemporary Art Evening Auction, 1 July 2014, London.", "Doig was invited to return to Trinidad in 2000, to take up an artist's residency with his friend and fellow painter Chris Ofili.F. G. Cottam (31 January 2008), \"Peter Doig: A perfectionist in paradise\", The Independent. In 2002, Doig moved back to the island, where he set up a studio at the Caribbean Contemporary Arts Centre near Port of Spain. He also became professor at the Fine Arts Academy in Düsseldorf, Germany.", "Many of Doig's paintings are landscapes, somewhat abstract, with a number harking back to the snowy scenes of his childhood in Canada. He draws inspiration for his figurative work from photographs, newspaper clippings, movie scenes, record album covers and the work of earlier artists like Edvard Munch.Grace Glueck (6 December 2002), \"Peter Doig\", The New York Times. His landscapes are layered formally and conceptually, and draw on assorted art historical artists, including Munch, H. C. Westermann, Friedrich, Monet and Klimt. While his works are frequently based on found photographs (and sometimes on his own) they are not painted in a photorealist style. Doig instead uses the photographs simply for reference. In a 2008 interview, Doig referred to his use of photographs and postcards as painting \"by proxy\" and noted that his paintings \"made no attempt to reflect setting\".", "Shortly after Doig's graduation from the Chelsea College of Arts, he was awarded the prestigious Whitechapel Artist Prize culminating in a solo exhibition at the Whitechapel Art Gallery in 1991. Included in the Whitechapel exhibition were major works including Swamped (1990), Iron Hill (1991), and The Architect's Home in the Ravine (1991). The Architect's Home in the Ravine (1991) shows Eberhard Zeidler's modernist central Toronto home in the Rosedale ravine.Peter Doig, The Architect's Home in the Ravine (1991), Christie's Post-War & Contemporary Art, 13 February 2013, London.", "Doig created a series of paintings of Le Corbusier's modernist communal living apartments known as l’Unité d’Habitation located at Briey-en-Forêt, in France. In the early 1990s Doig was involved with a group of architects and artists who operated from the building.\"Peter Doig, 5 February – 11 May 2008\", Tate Britain, London. The modern urban structures are partially revealed and hidden by the forest that surrounds them. As Doig explains: \"When you walk through an urban environment, you take the strangeness of the architecture for granted.\"\"Biography for Peter Doig\", Dominic Guerrini - Peter Doig Prints.", "Created in the late 1990s, a series of paintings – including works such as Country-Rock (Wing Mirror) (1999) – depict a tunnel, a familiar landmark for Toronto residents since an anonymous artist painted a rainbow over it, at the northbound Don Valley Parkway, in 1972. The rainbow has been repainted more than 40 times over two decades, despite authorities’ attempts to remove it.Carol Vogel (30 June 2014), \"Bacon Painting Sets Pace for Auctions in London\", The New York Times. His 1997 painting Canoe-Lake was inspired by the 1980 slasher film Friday the 13th.Stuart Jeffries (15 February 2002), \"Peter Doig: the outsider comes home\", The Guardian.", "From 6 September to 16 November 2019, Michael Werner Gallery has hosted an exhibition of new paintings by Peter Doig.", "Doig is represented at many international museum collections, with famous paintings including The House that Jacques Built (1992) at the Tel Aviv Museum of Art; Boiler House (1994), at the San Francisco Museum of Modern Art; and Ski Jacket (1994), at Tate Modern, London. He is also represented at the British Museum, in London, Walker Art Gallery, in Liverpool, Southampton City Art Gallery, the National Galleries of Scotland, in Edinburgh, Musée National d'Art Moderne, in Paris, Bonnefanten Museum, in Maastricht, Goetz Collection, in Munich, Kunsthalle, in Nuremberg, Museo Cantonale d'Arte, in Lugano, Museu de Arte Moderna - Colecção Berardo, in Sintra, National Gallery of Canada, in Ottawa, Art Institute of Chicago, Museum of Modern Art, in New York, Metropolitan Museum of Art, in New York, Whitney Museum of American Art, in New York, National Gallery of Art, in Washington, The Hirshhorn Museum, in Washington, Philadelphia Museum of Art and Dallas Museum of Art, among other public collections.Peter Doig at the National Galleries of Scotland", "In 1993, Doig won the first prize at the John Moores exhibition with his painting Blotter. This brought public recognition, cemented in 1994, when he was nominated for the Turner Prize. From 1995 to 2000, he was a trustee of the Tate Gallery.Peter Doig Tate Gallery, London. He was honoured with amfAR’s Award of Excellence for Artistic Contributions to the Fight Against AIDS in 2009.Award of Excellence for Artistic Contributions to the Fight Against AIDS, amfAR, The Foundation for AIDS Research. He was also named the 2017 Whitechapel Gallery Art Icon.\"Peter Doig | Art Icon 2017\", Whitechapel Gallery.", "In 2007, a painting of Doig's entitled White Canoe sold at Sotheby's for $11.3 million, then an auction record for a work by a living European artist. Paul Schimmel, chief curator at the Museum of Contemporary Art, Los Angeles said in an interview that the sale made Doig go from being \"a hero to other painters to a poster child of the excesses of the market\". In 2009, Night Playground (1997–98), a densely painted landscape painting being sold by Joel Mallin, a New York collector, went for $5 million at a Christie's auction in London, well above its high estimate of $3 million.Carol Vogel (30 June 2009), \"Bidding Is Thin at Christie’s in London\", The New York Times. Also at Christie's London, The Architect’s Home in the Ravine (1991) was auctioned at £7.66 million in early 2013. Later that year, César Reyes, a psychiatrist who lives in Puerto Rico and is one of the artist's biggest collectors, sold Jetty, a 1994 canvas of a lone figure on a dock at sunset, for $11.3 million.Carol Vogel (28 June 2013), \"Art Fatigue in London\", The New York Times. His painting Gasthof zur Muldentalsperre was sold at Christie's in 2014 for $17,038,276. This price was surpassed by Swamped, also sold at Christie's in 2015 for $25,950,000. Phillips auctioned Peter Doig's 1991 canvas, “Rosedale,” of a Toronto snowfall, which was guaranteed for $25 million and sold for $28.8 million to a telephone bidder, an auction high for the artist.Robin Pogrebin and Scott Reyburn (18 May 2017), \"A Basquiat Sells for ‘Mind-Blowing’ $110.5 Million at Auction\", The New York Times.", "In 2016, a former Canadian corrections officer began a $5 million lawsuit against Doig over a picture he claimed was by Doig despite the artist's denial it was his work. A Chicago court ruled in Doig's favour later that year, finding that the painting was actually the work of a similarly named man, Peter Doige.", "* Ulf Küster and Richard Shiff, Peter Doig, Hatje Cantz (2015), ", "* Hilton Als, Stéphane Aquin, Angus Cook, Keith Hartley, Peter Doig: No Foreign Lands, Hatje Cantz (2013), ", "* Richard Shiff, Peter Doig: Early Works, Michael Werner (2013), ", "* Kevin Power, Peter Doig: New Paintings, Michael Werner (2012), ", "* Catherine Lampert and Richard Shiff, Peter Doig, Rizzoli (2011), ", "* Philip Hoare, Peter Doig: New Paintings, Michael Werner and Gavin Brown's enterprise (2009), ", "* Judith Nesbitt (ed.), Peter Doig, Tate (2008), ", "* Catherine Grenier, Adrian Searle, and Kitty Scott, Peter Doig, Phaidon Press (2007), ", "* Kadee Robbins (ed.), Peter Doig: Works on Paper, Rizzoli (2006)", "* Nicholas Laughlin and Alice Koegel, Peter Doig: STUDIOFILMCLUB, Walther Koenig (2006), ", "* Bernhard Schwenk and Hilke Wagner, Peter Doig: Metropolitain, Walther Koenig (2004), ", "* Adrian Searle, Peter Doig: Works on Paper, Michael Werner (2002), "]}, {"page": "Ernie Ross", "response": ["Ross was elected Member of Parliament for Dundee West in the May 1979 general election, succeeding Peter Doig.  He supported Tony Benn in the 1981 Labour Party deputy leadership election.  Ross was re-elected five times until his retirement at the 2005 general election, when he was succeeded by Jim McGovern."]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Peter Doig"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Peter Doig"]}, {"page": "Robert Hughes, Baron Hughes of Woodside", "response": ["The infamous 1979 vote of no confidence resulted from the Labour government overturning the \"Yes\" result of the Scottish devolution referendum. Rather than the SNP, prime minister James Callaghan blamed unionist rebels on his own benches for ultimately bringing about the collapse of his government and opening the door to victory for Margaret Thatcher's Conservatives. Hughes was one of those rebels. Tam Dalyell, Peter Doig, and Adam Hunter were the other Scottish Labour MPs who helped overturn the \"Yes\" vote."]}, {"page": "Dundee West (UK Parliament constituency)", "response": ["| Peter Doig"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Peter Doig"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Peter Doig"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Peter Doig"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Peter Doig"]}, {"page": "Doig (surname)", "response": ["*Peter Doig (born 1959), Scottish painter", "*Peter Doig (politician) (1911-1996), British Labour Party politician"]}, {"page": "Ian Swales", "response": ["Ian Swales is the son of Harry Swales and Elizabeth Adamson Doig. Through his Scottish mother he is a first cousin (1R) of Peter Doig, Labour MP for Dundee West from 1963 to 1979. Swales was born in Leeds and grew up in Harrogate; his mother died when he was eight years old. Educated at Woodlands Junior School, he became Head Boy and then won a County Council funded scholarship to Ashville College, Harrogate.polling report | Ashville College  Following a chemical engineering degree at University of Manchester Institute of Science and Technology, where he met his wife, Pat, a Durham miner's daughter, he joined Yorkshire Electricity and qualified as an accountant in 1977. He moved to Teesside in 1978 to join large chemical company ICI and settled in Redcar. From 1983 to 1986, he worked for ICI in Brussels."]}, {"page": "Royal corgis", "response": ["In 1968, Peter Doig called for the royal staff to put up a \"Beware of the dog\" sign at Balmoral after one of the corgis bit the postman. In February 1989, it was reported that the royal family had hired an animal psychologist to tame the dogs after they developed a habit of nipping them and the staff. \"And in 1989, the Queen Mother’s dog, Ranger, led a pack of corgis that attacked and killed the Queen’s beloved dorgi, Chipper.\""]}, {"page": "1963 Dundee West by-election", "response": ["The Dundee West by-election was held on 21 November 1963 due to the death of the incumbent Labour MP John Strachey.  It was won by the Labour candidate, Peter Doig.", "On 22 September 1963, local councillor Peter Doig was chosen ahead of five other people to be the Labour Party candidate. Doig, a bakery supervisor, was chairman of the Labour group on Dundee Town Council. He was also deputy chairman of the council and honorary city treasurer of Dundee. The short list of six had been drawn up from a field of at least ten candidates. This included three other Dundee-based aspirants, one of whom was Doig's fellow councillor Bailie James L. Stewart."]}, {"page": "Deaths in October 1996", "response": ["*Peter Doig, 85, British politician."]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Peter Doig"]}, {"page": "List of MPs for constituencies in Scotland (October 1974–1979)", "response": ["|Peter Doig"]}, {"page": "List of MPs for constituencies in Scotland (February 1974–October 1974)", "response": ["|Peter Doig"]}, {"page": "List of MPs for constituencies in Scotland (1970–February 1974)", "response": ["|Peter Doig"]}]}}