{"wiki_id": "http://www.wikidata.org/entity/Q7172106", "itemLabel": "Pete Livesey", "itemDescription": "British rock climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Pete_Livesey", "wikipedia_page": {"main": "Pete Livesey (12 December 1943 to 26 February 1998), was an English rock climber who raised the standard of technical difficulty in traditional climbing in Britain during the early to mid-1970s. Livesey was renowned for the intensity and competitiveness he brought to the development of his sport as well as a mischievous sense of humor, and during the mid-1970s, Livesey was regarded as Britain's leading rock climber.", "link_mentions": [{"page": "List of climbers and mountaineers", "response": ["* Pete Livesey (1943–1998) UK, influential rock climber in the 1970s"]}, {"page": "Johnny Dawes", "response": ["Dawes' main climbing career roughly splits into an initial period pre-1986 where he focused on gritstone in the Peak District, which was suited to his unique climbing style (e.g. Gaia, and End of the Affair).  From 1986, Dawes focused on Wales and on a diverse range of rock, from the slate quarries of Llanberis (e.g. The Quarryman, The Very Big and the Very Small, and Dawes of Perception), to the limestone cliffs of Gogarth (e.g. Conan the Librarian, and Hardback Thesaurus), and the rhyolite mountain crags of Clogwyn Du'r Arddu (e.g. Indian Face).  Dawes is mostly remembered for his intimidating traditional climbing routes, following the legacy of Pete Livesey and Ron Fawcett, and less for his sport climbing routes, unlike his contemporaries Jerry Moffatt and Ben Moon."]}, {"page": "Froggatt Edge", "response": ["Joe Brown popularised two well-known classic routes in the late 1940s, Sunset Slab (HVS 4b) and Three Pebble Slab (HVS 5a). Whilst the climbing is not difficult, a fall from either climb (particularly Sunset Slab) would result in injuries. One of the best-known climbs at Froggatt Edge is \"Downhill Racer\", a smooth and near-vertical 17 m (50 ft) slab of gritstone. It was first climbed in 1977 by Pete Livesey and represented a breakthrough in that it combined difficulty with real danger: there is no suitable crack in the rock in which to place protection (to anchor a rope), so a climber who slips from the small finger holds will hit the ground. It is now graded E4 6a."]}, {"page": "John Long (climber)", "response": ["In 1975, along with Ron Kauk and John Bachar, Long became the first to free climb a legitimate big wall with the first free ascent of the East Face of Washington Column, in Yosemite Valley, later dubbed Astroman, for two decades widely considered \"The World’s Greatest Free Climb.\"  The following year, also in Yosemite, and with British climber Pete Livesey, Long free climbed the second big wall in history – the 1,700 foot Chouinard/Herbert route on Sentinel Rock.  On June 15, 2011, Alex Honnold free soloed the Chouinard/Herbert for CBS News, with Long hosting alongside 60 Minutes correspondent, Lara Logan."]}, {"page": "Mossdale Caverns", "response": ["Exploration of Mossdale Caverns was begun in 1941 by Bob Leakey of the British Speleological Association. It is a very flood-prone challenging cave system, with many of its passages involving long wet crawls. Other sections have neck-deep water and many of Leakey's explorations were conducted solo as few of his contemporaries had the necessary endurance. The end was finally reached again in 1964 by Mike Boon and Pete Livesey. A return trip to the far end takes between eight and ten hours.", "There is a rock climbing route at Gordale Scar called \"Mossdale Trip\" (E6 6b) that was named in remembrance of the tragedy by the late Pete Livesey."]}, {"page": "Dinas Cromlech", "response": ["The obvious traditional climbing route up the deep ninety degree angled corner resisted attempts for many years until it was climbed by Joe Brown in 1952, and called Cenotaph Corner (1952, E1 5c, with Doug Belshaw).  The outcrop is an important rock climbing venue in Britain, and the corner includes some of the famous traditional climbing routes in British rock climbing history, including  Cemetery Gates (E1 6c) by Don Whillans in 1951, Left Wall (E2 5c) by Ron Moseley in 1956, Right Wall (E5 6c) by Pete Livesey in 1974, and Lord of the Flies (E6 6a) by Ron Fawcett in 1979. It also includes some of the most intimidating traditional climbs in Britain, such as Steve Mayer's 1992 climb, Nightmayer (E8 6c), from which climbers risk very large falls."]}, {"page": "List of orienteers", "response": ["* Pete Livesey, United Kingdom"]}, {"page": "Peter Livesey", "response": ["#REDIRECT Pete Livesey"]}, {"page": "Ron Fawcett", "response": ["Fawcett's dominance of British rock climbing from the mid-1970s followed on from British climber Pete Livesey, with whom Fawcett had an unusual friend–rival relationship; Livesey was Fawcett's early climbing mentor and climbing partner.  Fawcett's dominance waned during the mid-1980s, as emerging British climbers such as Jerry Moffatt and Ben Moon began to push technical levels not just in British climbing, but in international sport climbing."]}, {"page": "Livesey (surname)", "response": ["*Pete Livesey (1943–1998), rock-climber"]}]}}