{"wiki_id": "http://www.wikidata.org/entity/Q7173286", "itemLabel": "Peter Clark", "itemDescription": "British historian, professor emeritus of urban history (University of Helsinki)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Clark_(historian)", "wikipedia_page": {"main": "Peter Alan Clark (born 24 May 1944) is a British historian. Since 2000, he was professor of European urban history at the University of Helsinki. He retired in 2011.Clark was educated at Balliol College, Oxford and graduated (Modern History first class) in 1966. He started his career as a research fellow at Magdalen College, Oxford. He was then lecturer, reader and later professor of economic and social history at the University of Leicester. From 1985 to 1999, he was the first director of the Centre for Urban History of the University of Leicester.In 1989, he was co-founder (with Bernard Lepetit and Herman Diederiks) of the European Association for Urban History and served as its treasurer from 1989 to 2010. He was also Secretary of International Commission for the History of Towns 1993 to 1995.He has contributed to a number of publications, including the Cambridge Urban History of Britain. Clark is a member of the Finnish Academy of Science and Letters and a fellow of the Royal Historical Society, of which he was a Council member from 1991 to 1995. He was elected a member of the Academy of Europe in 2010 and the Royal Belgian Academy (Flemish) in 2015. He was awarded an Honorary Degree of Philosophy by Stockholm University in 2012.", "link_mentions": [{"page": "Peter Clark", "response": ["Peter Clark may refer to:", "* Peter Clark (footballer, born 1979), retired English professional footballer", "* Peter Clark (footballer, born 1938) (1938–2008), English footballer", "* Peter Clark (historian) (born 1944), British historian", "* Peter Clark (athlete) (born 1933), British long-distance runner", "* Peter Clark (translator), translator of Arabic literature and trustee for the International Prize for Arabic Fiction", "* Peter Clarke (disambiguation)"]}, {"page": "The Whitfield Prize", "response": ["|1983||Peter Clark, The English Alehouse: A social history, 1200–1830"]}, {"page": "Peter Clarke (historian)", "response": ["Peter Clarke studied at Eastbourne Grammar School and St John's College, Cambridge, where completed his B.A. in 1963, his M.A. and Ph.D. in 1967, and his Litt.D. in 1989.Who's Who 2013. A & C Black Publishers Ltd; 165th edition (3 Dec 2012).", "His 1971 work Lancashire and the New Liberalism challenged George Dangerfield's thesis, expressed in The Strange Death of Liberal England, that the decline of the Liberal Party was inevitable. Clarke argued that the Liberals successfully modified their policies to embrace the progressive politics of New Liberalism, which helped them capture working class votes in the former Conservative stronghold of Lancashire. It was the First World War, Clarke maintained, that caused the Liberals' decline.F. M. Leventhal, 'Reviewed Work: Lancashire and the New Liberalism by P. F. Clark', The Annals of the American Academy of Political and Social Science, Vol. 399, The Nation's Health: Some Issues (Jan., 1972), pp. 199-200. His next work, Liberals and Social Democrats (1978), examined the relationship between liberalism and socialism by focusing on four liberal and social democratic intellectuals: Graham Wallas, L. T. Hobhouse, J. A. Hobson and J. L. Hammond.J. O. Stubbs, 'Reviewed Work: Liberals and Social Democrats. by Peter Clarke', Political Science Quarterly, Vol. 94, No. 4 (Winter, 1979-1980), p. 729.", "Clarke's The Keynesian Revolution in the Making, 1924–1936 (1988) was a study of John Maynard Keynes's economic proposals from his 1923 work A Tract on Monetary Reform to his 1936 General Theory of Employment, Interest and Money.Susan Howson, 'Reviewed Work: The Keynesian Revolution in the Making 1924-1936 by Peter Clarke', The Economic Journal Vol. 100, No. 399 (Mar., 1990), p. 292."]}, {"page": "Peter A. Clark", "response": ["#REDIRECT Peter Clark (historian)"]}, {"page": "Peter Alan Clark", "response": ["#REDIRECT Peter Clark (historian)"]}]}}