{"wiki_id": "http://www.wikidata.org/entity/Q7173770", "itemLabel": "Peter Dunn", "itemDescription": "British engineer (1927-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Dunn_(engineer)", "wikipedia_page": {"main": "Peter Douglas Dunn OBE (20 January 1927 – 7 March 2014) was a British engineer.\nAfter working at the Atomic Energy Research Establishment, Harwell and jointly holding numerous patents on heat pipes and associated technology with power stations, Prof Peter Dunn joined the Department of Applied Physics in 1964 and started the Department of Engineering  at the University of Reading in 1968.  As head of department, alongside his friend Dr E. F. Schumacher and through the Institute of Mechanical Engineers, Peter Dunn was on the first committees working with Intermediate Technology or Appropriate Technology.  These committees led to the formation of the Intermediate Technology Development Group (now Practical Action).  He encouraged the Departmental research group to contribute to the developing sectors of intermediate technology.\nPeter Dunn started the world's first Master of Science Degrees in Renewable Energy in 1977.  The research group contributed to early UK work on wind energy.  The group included Dr Musgrove who went on to be the first Chairman of the British Wind Energy Association (now called RenewableUK)  and then on to head of development at National Wind Power.\nIn the 1999 New Year Honours Professor Peter Douglas Dunn was honoured with an OBE,  Order of the British Empire \"For services to the development of innovative energy technologies\". (Oxon, Oxfordshire)Gamos was founded in 1989 by Peter Dunn and Simon Batchelor.  Gamos was proposed as an organisation to expand the work of the department in the combination of poverty alleviation and renewable energy.  It has since expanded its work to include poverty alleviation and Information and Communication Technology.\nGamos is a UK organisation specialising in development aid.  Using the word related to hieros gamos but not drawing on its meaning, the organisation has enabling frameworks with the UK Department for International Development.  It has been cited by that agency as having been the eighth most active contractor within DFID's Engineering Knowledge and Research Programme.Gamos contributed to the Commission for Africa report, provoking a multi donor action that supported regulatory change concerning mobile phones in Africa. It was also responsible for the special journal paper, \"Good Practice Paper on ICTs for Economic Growth and Poverty Reduction\" published by the Organisation for Economic Co-operation and Development.Dunn died on 7 March 2014.", "link_mentions": [{"page": "1999 New Year Honours", "response": ["*Professor Peter Dunnill, Director, Advanced Centre for Biochemical Engineering, University College London. For services to Biochemical Engineering."]}, {"page": "Dunn, Peter, (Engineer)", "response": ["#REDIRECT Peter Dunn (engineer)"]}, {"page": "Gamos (organisation)", "response": ["#REDIRECT Peter Dunn (engineer)"]}, {"page": "2014 in the United Kingdom", "response": ["**Peter Dunn, 87, engineer."]}, {"page": "Deaths in March 2014", "response": ["*Peter Dunn, 87, British engineer.Professor Peter Dunn – obituary"]}, {"page": "Peter Dunn (UK Engineer)", "response": ["#REDIRECT Peter Dunn (engineer)"]}, {"page": "Peter Dunn", "response": ["Peter Dunn may refer to:", "* Peter Dunn (author) (born 1977), American financial author and radio host", "* Peter Dunn (cricketer) (1921–2004), Australian cricketer", "* Peter Dunn (engineer) (1927–2014), British engineer", "* Peter Dunn (general) (born 1947), Australian general and ACT Emergency Services Commissioner", "*Peter Dunn (historian), Australian historian", "* Peter Dunn (paediatrician) (born 1929), British paediatrician", "* Peter Dunn (politician) (born 1935), South Australian politician", "* Peter Dunne (disambiguation)"]}, {"page": "Peter Douglas Dunn", "response": ["#REDIRECT Peter Dunn (engineer)"]}]}}