{"wiki_id": "http://www.wikidata.org/entity/Q7174274", "itemLabel": "Peter Goffin", "itemDescription": "British set and costume designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Goffin", "wikipedia_page": {"main": "Peter Goffin F.R.S.A. (28 February 1906 - 22 March 1974), was an English set and costume designer and stage manager, known for his work with the D'Oyly Carte Opera Company.", "link_mentions": [{"page": "The Pirates of Penzance", "response": ["The Pirates of Penzance has been one of Gilbert and Sullivan's most popular comic operas. After its unique triple opening in 1879–80, it was revived in London at the Savoy Theatre in 1888 and in 1900, and for the Savoy's repertory season of 1908–09. In the British provinces, the D'Oyly Carte Opera Company toured it almost continuously from 1880–1884, and again in 1888. It re-entered the D'Oyly Carte touring repertory in 1893 and was never again absent until the company's closure in 1982.Rollins and Witts, pp. 11, 18, 22, 35 et passim New costumes were designed by Percy Anderson in 1919 and George Sheringham in 1929 (who also executed a new Act I set). Peter Goffin created a new touring set in 1957."]}, {"page": "The Mikado", "response": ["The Mikado was revived again while The Grand Duke was in preparation. When it became clear that that opera was not a success, The Mikado was given at matinees, and the revival continued when The Grand Duke closed after just three months. In 1906–07, Helen Carte, the widow of Richard D'Oyly Carte, mounted a repertory season at the Savoy, but The Mikado was not performed, as it was thought that visiting Japanese royalty might be offended by it. It was included, however, in Mrs. Carte's second repertory season, in 1908–09. New costume designs were created by Charles Ricketts for the 1926 season and were used until 1982.Photos of, and information about, the 1926 Mikado costume designs.  Peter Goffin designed new sets in 1952."]}, {"page": "Iolanthe", "response": ["In the British provinces, Iolanthe played – either by itself, or in repertory – continuously from February 1882 through 1885, then not again until late 1891. From then on, it was always present in the D'Oyly Carte Opera Company's touring repertory, being included in some part of every season until the company's closure in 1982.Rollins and Witts, passim Most of the costumes were redesigned by Percy Anderson in 1915 and by George Sheringham in 1932, and Peter Goffin designed new sets in 1957 and some new costumes in 1960. After its original production, Iolanthe was not revived in London until 1901, making it the first of the operas to be revived after the composer's death the year before. It was also included in two Savoy repertory seasons, in 1907 and 1908–09.Rollins and Witts, pp 19–22"]}, {"page": "Ruddigore", "response": ["The first revival was in December 1920 in Glasgow, and the first London revival was the following year. The opera was cut and heavily revised, including a new overture and a new second-act finale.  The revival was a success, and from that point on, Ruddigore was a permanent fixture in the D'Oyly Carte repertory. New costumes were designed by Percy Anderson in 1927.  It was included in every season until the winter of 1940–41, when the scenery and costumes (along with those of three other operas) were destroyed in enemy action. In Australia, no authorised production of Ruddigore was seen until 23 June 1927, at the Theatre Royal, Adelaide, produced by the J. C. Williamson company.  A new D'Oyly Carte production debuted on 1 November 1948, with new costumes and an Act II set designed by Peter Goffin. From then on, it was played in every season through 1976–77, aside from 1962–63 (a season that included a lengthy overseas tour). New touring sets were designed by Goffin in 1957. In the late 1970s, the Company started to play a reduced repertory. Ruddigore was included in the 1976–77 tour, then for five months in 1978–1979; and finally in 1981–82."]}, {"page": "H.M.S. Pinafore", "response": ["Until 1908, revivals of the opera were given in contemporary dress, with ladies' costumes executed by couture houses such as Redfern.Rollins and Witts, Appendix, p. VII After that, designers such as Percy Anderson, George Sheringham and Peter Goffin created Victorian costume designs.Mander, pp. 102–105 The 1887 set was designed by Hawes Craven. In the winter of 1940–41, the D'Oyly Carte Opera Company's scenery and costumes for Pinafore and three other operas were destroyed by German bombs during World War II.Rollins and Witts, p. 165 The opera was revived in London in the summer of 1947.Rollins and Witts, pp. 165–172 It was then included in the D'Oyly Carte repertory in every season from then on, until the company's closure in 1982.Rollins and Witts, pp. 172–186, and supplements The D'Oyly Carte company performed Pinafore before Queen Elizabeth II and the royal family at Windsor Castle on 16 June 1977, during the queen's Silver Jubilee year, the first royal command performance of a Gilbert and Sullivan opera since 1891."]}, {"page": "The Yeomen of the Guard", "response": ["The Yeomen of the Guard was immediately a hit in London, with a successful New York run following shortly thereafter. Percy Anderson designed the original costumes, while the set was by Hawes Craven.Rollins and Witts, Appendix, p. VIII The first English provincial tour opened in 1888, and from then on it was a fixture in the D'Oyly Carte repertory, with at least one official touring company playing it somewhere in almost every season until the company's closure in 1982. New costumes were designed by Anderson in 1919 and 1927, and Peter Goffin designed new sets and costumes in 1940. In Australia, the opera's first authorised performance was on 20 April 1889 at the Princess Theatre, Melbourne, produced by J. C. Williamson, which gave regular performances thereafter in Australasia until the 1960s. In 1932, Yeomen became the first Gilbert and Sullivan opera to be broadcast on the radio in its entirety.Webster, Chris. \"Original D'Oyly Carte Broadcasts\", A Gilbert and Sullivan Discography, 16 July 2005, accessed 22 November 2009."]}, {"page": "The Gondoliers", "response": ["A new production, with new sets and costumes designed by Charles Ricketts, was prepared for the opening of the renovated Savoy Theatre on 21 October 1929. The critic Ernest Newman wrote: \"It was a subtle stroke to open with The Gondoliers; there is a peculiar richness of blood in the music of this work that makes the new theatre and the new designs and dresses by Mr. Charles Ricketts particularly appropriate.\" The performance was conducted by Malcolm Sargent, and the theatre's only box was occupied by Lady Gilbert.Programme with photos of the new theatre and productions Peter Goffin designed new touring sets in 1957, and another notable new production was staged by the company in 1958 at the Princes Theatre with sets and costumes by Goffin.\"New Scenery and Costumes\" for The Gondoliers 1958, The Sphere, 27 December 1958, reprinted at The Gilbert and Sullivan Archive (2008) In 1967, new costumes were designed by Luciana Arrighi, with new sets by John Stoddart.\"Victorian look for Gondoliers\", The Times, 4 December 1967, p. 9"]}, {"page": "Patience (opera)", "response": ["Lady Jane, accompanying herself on the cello,\"Violoncello\" is specified in the original libretto, though in the original production a double bass was used (see Alice Barnett photograph), an instrument specified in the licence copy and first American libretto of the opera. Subsequent productions have varied in their choice of cello, double bass or a similar prop. See photographs of past D'Oyly Carte productions and this photo from Peter Goffin's D'Oyly Carte production. laments the passing of the years and expresses hope that Bunthorne will \"secure\" her before it is too late (\"Silvered is the raven hair\"). Meanwhile, Grosvenor wearily entertains the ladies (\"A magnet hung in a hardware shop\") and begs to be given a half-holiday from their cloying attentions. Bunthorne is furious when Patience confesses her affection for Grosvenor; she laments the bitter lesson she has learned about love (\"Love is a plaintive song\"). Bunthorne longs to regain his former admirers' admiration; Jane offers her assistance (\"So go to him, and say to him\"). The Dragoon officers attempt to earn their partners' love by appearing to convert to the principles of aestheticism (\"It's clear that mediaeval art\"). Angela and Saphir are favourably impressed and accept Calverly and Murgatroyd in matrimony; Dunstable graciously bows out (\"If Saphir I choose to marry\").", "In the British provinces, Patience played – either by itself, or in repertory – continuously from summer 1881 to 1885, then again in 1888. It rejoined the touring repertory in 1892 and was included in every season until 1955–56.  New costumes were designed in 1907 by Percy Anderson, in 1918 by Hugo Rumbold and in 1928 by George Sheringham, who also designed a new set that year. New designs by Peter Goffin debuted in 1957. The opera returned to its regular place in the repertory, apart from a break in 1962–63. Late in the company's history, it toured a reduced set of operas to reduce costs. Patience had its final D'Oyly Carte performances in April 1979 and was left out of the company's last three seasons of touring.Rollins and Witts, supplements"]}, {"page": "D'Oyly Carte Opera Company", "response": ["On 3 September 1939, at the outbreak of World War II, the British government ordered the immediate and indefinite closure of all theatres. Carte cancelled the autumn tour and disbanded the company.Joseph (1994), p. 246 Theatres were permitted to reopen from 9 September,The Times, 9 September 1939, p. 9 but it took some weeks to re-form the company. Some performers, including Martyn Green, were already committed elsewhere, and Grahame Clifford was engaged to play his roles. The company resumed touring, in Edinburgh, on Christmas Day 1939.Rollins and Witts, p. 164 The company continued to perform throughout the war, both on tour and in London, but in 1940 German bombing destroyed the sets and costumes for five of its shows: Cox and Box, The Sorcerer, H.M.S. Pinafore, Princess Ida and Ruddigore. The old productions of Pinafore and Cox and Box were recreated shortly after the war, and Ruddigore received a new production, planned by Carte but not seen until after his death. The other two operas took longer to rejoin the company's repertory. On the other hand, for the first wartime season, Peter Goffin, a protégé of Carte's daughter, Bridget, had designed a new production of The Yeomen of the Guard first seen in January 1940, and his new Ruddigore debuted in 1948. A return to the U.S. in 1947 was very successful, and the company resumed frequent visits to America.", "Rupert died in 1948, leaving a strong company to his daughter Bridget.Joseph (1994), pp. 273–274 She soon hired Frederic Lloyd as general manager. Bridget and Lloyd also took steps to keep the productions fresh, engaging designers to redesign the costumes and scenery. Peter Goffin, who had redesigned Yeomen (1939) and Ruddigore (1948) for the company, created new settings and costumes for Bridget for half a dozen more productions: The Mikado (1952; settings only, most of the celebrated Ricketts costumes being retained), Patience (1957), The Gondoliers (1958), Trial by Jury (1959), H.M.S. Pinafore (1961; ladies' costumes) and Iolanthe (1961). A new production of Princess Ida in 1954 was designed by James Wade.Wilson and Lloyd, p. 154 Eleanor Evans, however, was an example of the company's stage directors from 1949 to 1953 who were said to be reluctant to update and freshen stagings.Watt, John. \"The Ones that I Like\", Interview with Sandford, c. 1972, at the Memories of the D'Oyly Carte website In 1957 Goffin designed a unit set for the company to facilitate touring, reducing the number of vans required to carry the scenery from twenty to nine. A 1957 review of Yeomen in The Times praised the production and marvelled at \"the continued vitality of the Savoy operas\", noting: \"The opera remains enchanting; the singing seems, on the whole, better and more musical than that which one used to hear, say, 30 years since; and though the acting lacks some of the richly crusted performances of those days, it is perhaps none the worse for that\".\"The Lasting Charm of Gilbert and Sullivan\", The Times, 14 February 1957, p. 5 In 1949 the company began a new series of recordings with Decca, featuring Green, who had returned to the company after the war, and continued the series with his successor, Peter Pratt.Wilson and Lloyd, pp. 151 and 154 The company cooperated with the production of the 1953 film The Story of Gilbert and Sullivan, which used some former members of the company in the cast. In 1955 the company gave a seven-month tour to the U.S. to celebrate the 75th anniversary of its first American productions.Wilson and Lloyd, p. 175 In 1959 the company began the tradition of holding a zany \"last night\" on the last evening of each London season."]}, {"page": "Goffin", "response": ["* Peter Goffin (1906–1974), English set and costume designer and stage manager"]}, {"page": "Bridget D'Oyly Carte", "response": ["In 1926, when she was 18, Carte married her first cousin, John David Gathorne-Hardy, the fourth Earl of Cranbrook (1900–1978). They soon separated and finally divorced in 1931;\"High Court of Justice\", The Times, 13 January 1931, p. 6 she relinquished her title and resumed her maiden name by deed poll in 1932, dropping the name Cicely, which she disliked.\"D'Oyly Carte, Dame Bridget\", Who Was Who, Oxford University Press, December 2007, accessed 30 March 2011  She then resumed her education, enrolling at Dartington Hall in Devon from 1931 to 1933, a school with a long musical tradition, taking courses in dance, teacher training, art and design. There she met the designer Peter Goffin who became a lifelong friend.Taylor, C. M. P. \"Carte, Dame Bridget Cicely D'Oyly (1908–1985)\", Oxford Dictionary of National Biography (2004), Oxford University Press, accessed 20 June 2009. "]}, {"page": "Rupert D'Oyly Carte", "response": ["Carte commissioned new costumes and scenery throughout his proprietorship of the company. He engaged Charles Ricketts to redesign The Gondoliers and The Mikado, the costumes for the latter, created in 1926, being retained by all the company's subsequent designers. Other redesigns were by Percy Anderson, George Sheringham, Hugo Rumbold and Peter Goffin, a protégé of Carte's daughter, Bridget.", "Carte was deeply affected by the death of his son Michael in 1932. The actor Martyn Green said, \"The heart dropped right out of him. His interest in both the operas and the hotel seemed to fade away.\"Green, p. 83 Nevertheless, in 1934 the company made a highly successful eight-month North American tour with Green as its new principal comedian, replacing Lytton.Wilson and Lloyd, p. 128 Carte gave approval for, and was closely consulted about, a 1938 film version of The Mikado produced and conducted by Geoffrey Toye, starring Green and released by Universal Pictures,Baily, p. 446Shepherd, Marc. \"The Technicolor Mikado Film (1939)\",  A Gilbert and Sullivan Discography (2001), retrieved 20 November 2009 but his only new stage production after 1932 was of The Yeomen of the Guard designed in 1939 by Peter Goffin. The re-staging was regarded as radical, but when Goffin took fright at the storm of controversy, Carte told him, \"I don't care what they say about the production. I should care if they said nothing.\"Baily, p. 19", "On 3 September 1939, at the outbreak of the Second World War, the British government ordered the immediate and indefinite closure of all theatres. Carte cancelled the autumn tour and disbanded the company.Joseph, p. 246 Theatres were permitted to reopen from 15 September,\"Theatres and Cinemas Today\", The Times, 15 September 1939, p. 8 but it took some weeks to re-form the company. It resumed touring in Edinburgh on Christmas Day 1939, and continued to perform throughout the war.Rollins and Witts, pp. 164–169 German bombing destroyed the sets and costumes for five D'Oyly Carte productions: Cox and Box, The Sorcerer, H.M.S. Pinafore, Princess Ida and Ruddigore. The old productions of Pinafore and Cox and Box were recreated shortly after the war, but the other two operas took longer to rejoin the company's repertory. Peter Goffin designed and directed the new production of The Yeomen of the Guard first seen in January 1940, and his new Ruddigore debuted in 1948, shortly after Carte's death. A return of the company to the US for 21 weeks in 1947 was very successful.Rollins and Witts, p. 172"]}, {"page": "Hugo Rumbold", "response": ["Rumbold was commissioned by Rupert D'Oyly Carte to dress a 1918 revival of Gilbert and Sullivan's Patience, in succession to W. S. Gilbert, who designed the original costumes, and Percy Anderson, who dressed the 1907 revival. Some of Rumbold's costumes (for the \"everyday young girls\") were retained by the D'Oyly Carte Opera Company until Peter Goffin's new designs were introduced in 1957.Rollins and Witts, Appendix, pp. vii and viii For Sir Thomas Beecham, Rumbold designed revivals of La fille de Madame Angot, by Lecocq, and Mozart's Le Nozze di Figaro staged at the Theatre Royal, Drury Lane in 1919.The Times, 30 June 1919, p. 10 In the same year he designed the first British production of Ravel's L'heure espagnole for Covent Garden.\"Hugo Rumbold\", The Daily Mail, 21 November 1932, p. 10 Rumbold designed a revival of Bernard Shaw's Arms and the Man at the Duke of York's Theatre in 1919,The Times, 12 December 1919, p. 12 and The Tempest for Viola Tree's company at the Aldwych Theatre in 1921.The Times, 2 February 1921, p. 8"]}, {"page": "Trial by Jury", "response": ["Richard D'Oyly Carte's opera companies (of which there were often several playing simultaneously) usually programmed Trial by Jury as a companion piece to The Sorcerer or H.M.S. Pinafore. In the 1884–85 London production, a transformation scene was added at the end, in which the Judge and Plaintiff became the Harlequinade characters Harlequin and Columbine and the set was consumed by red fire and flames.Wilson and Lloyd, p. 35 From 1894, the year when the D'Oyly Carte Opera Company established a year-round touring company that had most of the Gilbert and Sullivan works in its repertory, Trial by Jury was always included, except for 1901 to 1903, and then again from 1943 until 1946, when the company played a reduced repertory during World War II. From 1919, costumes were by Percy Anderson, and a new touring set was designed by Peter Goffin in 1957.Rollins and Witts, Appendix, p. VII"]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Peter Goffin"]}, {"page": "Goffin, Peter", "response": ["#redirectPeter Goffin"]}]}}