{"wiki_id": "http://www.wikidata.org/entity/Q7172829", "itemLabel": "Peter Birrel", "itemDescription": "actor (1935-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Birrel", "wikipedia_page": {"main": "Peter Birrel Cohen (19 July 1935 – 23 June 2004) was an English actor who played numerous parts on British television for nearly forty years. He appeared in the Doctor Who story Frontier in Space in 1973, as well as in the documentary I Was a 'Doctor Who' Monster. He also appeared in the first series of Alexander the Greatest. His film credits included Freelance (1971), Arch of Triumph (1984), and the television miniseries Freud (1984), War and Remembrance (1988) and Around the World in 80 Days (1989). In 1979 he played a guest-role in George and Mildred as George’s brother Charlie Roper in the episode A Military Pickle.\nHe married actress Stephanie Cole in 1998, who remained his wife until his death from cancer in 2004 in Bath aged 68.", "link_mentions": [{"page": "1989 in film", "response": ["| Around the World in 80 Days || NBC / Avala Film / Harmony Gold || Buzz Kulik (director); John Gay (screenplay); Pierce Brosnan, Eric Idle, Julia Nickson, Peter Ustinov, Jack Klugman, Roddy McDowall, Darren McGavin, Robert Morley, Stephen Nichols, Lee Remick, Jill St. John, Robert Wagner, Arielle Dombasle, Gabriele Ferzetti, Henry Gibson, John Hillerman, Rick Jason, Christopher Lee, Patrick Macnee, John Mills, Pernell Roberts, James B. Sikking, Simon Ward, John Abineri, Bill Bailey, Peter Birrel, John Carlin, Jean-Pierre Castaldi, Julian Curry, Roy Evans, Don Ferguson, Colin Higgins, Lily Leung, Joseph Long, Victor Maddern, Anna Massey, Ian McNeice, Ajay Mehta, Pierre Olaf, Terrence Scammell, Tommy Tam, Cassie Stuart, Yves Aubert, Lane Cooper, Bruce Troy Davis, Hugo De Vernier, Henry Fong, Michael Gable, Olivier Hémon, Mark Holmes, Arun Pathela, John Rapley, Eve Schickle, Violetta, Ed Wiley, Tariq Yunus || Action, Adventure, Comedy || Live action"]}, {"page": "Stephanie Cole", "response": ["In 1973, Cole married fight director Henry Marshall, who was one of the founders of the British Academy of Dramatic Combat and was a Master at Arms at the Royal Academy of Dramatic Art. They have a daughter, Emma Battcock (born 1973). They divorced in 1988. In 1998, Cole married fellow actor Peter Birrel after meeting him again, thirty years after they first appeared together in a production of Richard II at the Bristol Old Vic."]}, {"page": "Hammer House of Horror", "response": ["Newly appointed morgue worker Edwin Bord (Peter McEnery) becomes obsessed with number 9, which is being often repeated to him in his everyday interactions with people and experiences. Dr. Holt's body is autopsied by Markham (Peter Birrel) and Dr Harris (Emrys James) who is very logical and jovial, with Edwin watching and it is learnt that Holt tried drilling a hole in his skull to liberate an evil virus invading his body, which led to Subdural hemorrhage and thereafter he died during surgery for the same. Edwin begins to think that he is being persecuted by the evil virus too as he is a good person, his suspicions supported by coincidence and confirmation bias."]}, {"page": "Market in Honey Lane", "response": ["*Peter Birrel as Jacko Bennet"]}, {"page": "Play of the Month", "response": ["|Dinsdale Landen,Judi Dench,Bernard Archard,John Quentin,Michael Gough,Alan Rowe,Michael Brennan,Norman Mitchell,Richard Coe,Peter Birrel,Yvonne Antrobus,John Caesar,Geoffrey Cheshire,Martin King,Rex Robinson"]}, {"page": "List of Bergerac episodes", "response": ["| Primi Townsend, Rosalind Lloyd, Peter Birrel, Frank Mills, Derek Smith"]}, {"page": "Alexander the Greatest", "response": ["*Peter Birrel – Murray (series 1)"]}, {"page": "List of British Jewish entertainers", "response": ["*Peter Birrel (1935–2004), actor"]}, {"page": "Sharpe's Company (TV programme)", "response": ["* Peter Birrel as Don Moreno"]}, {"page": "List of Bergerac cast members", "response": ["*Peter Birrel"]}, {"page": "List of stage names", "response": ["Peter Birrel – Peter Berrill"]}, {"page": "Around the World in 80 Days (miniseries)", "response": ["* Peter Birrel as Brindisi Terminal Clerk"]}, {"page": "Freelance (1971 film)", "response": ["*Peter Birrel - Jeff "]}, {"page": "Mildred Roper", "response": ["After the war, Mildred had a fling with Charlie Roper (Peter Birrel) (with whom she went to the cinema to see Gone with the Wind on seven consecutive nights, but claims she still needs to see the film), who introduced her to his brother George Roper (Brian Murphy) who was wearing his gas mask at the time. Mildred married George in 1953, who was working as a bus conductor - a job he would hold up for two weeks. Their wedding day was a disaster as when Mildred was walking up the aisle in her navy blue dress, George accidentally stepped on her bridal train and tripped it clean off. George wore his bus conductor's uniform for his wedding as he had come straight from work. All of George's fly buttons were undone and Mildred had to discreetly do them up at the altar as George was not sober. At the wedding reception, George was at the pub getting drunk to 'steady his nerves' and then put the ring on the vicar's finger. They honeymooned in Dunkirk but Mildred was let down by the weather, 'amongst other things'."]}, {"page": "Freud (miniseries)", "response": ["*Peter Birrel ...  Alfred Adler"]}, {"page": "2004 in British television", "response": ["|Peter Birrel"]}, {"page": "Crane (TV series)", "response": ["3. The Third Bullet. A telephone call from an unknown woman puts Crane's life in danger from an assassin. Leonard Trolley as Shaab, Felix Felton as Major Culcao, Lawrence Hardy as Dr. Salas, Brian Badcoe as Raoul, Peter Halliday as Eladio, Peter Birrel as 1st Guard, Bruce Wightman as 2nd Guard, Margaret Whiting as Tina Mondrego."]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Beryl Reid as Ruby, Bill Maynard as Barney Todd, John F. Landry as Ronnie Todd, Ivor Roberts as Jack Hodgson, Nigel Le Vaillant as Andy, Peter Birrel as John Scott, David Webb as John Draham."]}, {"page": "List of Jewish actors", "response": ["|Peter Birrel"]}, {"page": "Deaths in June 2004", "response": ["*Peter Birrel, 68, English actor, cancer."]}, {"page": "List of The Main Chance episodes", "response": ["|Alister Williamson, John Bown, Peter Birrel, Shirley Dixon", "| Michael Sheard, Denis Lill, Antony Carrick, Frederick Treves, Charles Morgan, Nigel Lambert, Peter Birrel, Edward Underdown"]}, {"page": "BBC2 Playhouse", "response": ["| Robert GillespieBarbara Leigh-HuntAnna CropperPeter BirrelLinda Robson"]}, {"page": "You Can't Win (1966 TV series)", "response": ["* Peter Birrel as Tom Jacobs"]}, {"page": "The Jump (1998 TV series)", "response": ["John Light, Sue Johnston, Michael Angelis and Peter Birrel also star in principal roles. The Jump was first released on VHS on 26 January 2000, before being Region 2 DVD in the United Kingdom on 13 March 2006 via Network, in a double pack with the television adaptation of Cole's novel Dangerous Lady.", "* Peter Birrel as Pa Brunos"]}, {"page": "Birrel, Peter", "response": ["#redirectPeter Birrel"]}]}}