{"wiki_id": "http://www.wikidata.org/entity/Q7175184", "itemLabel": "Peter Kilfoyle", "itemDescription": "British politician (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Kilfoyle", "wikipedia_page": {"main": "Peter Kilfoyle (born 9 June 1946) is a British Labour Party politician who was the Member of Parliament (MP) for Liverpool Walton from 1991 to 2010.", "link_mentions": [{"page": "June 9", "response": ["*  1946   – Peter Kilfoyle, English politician"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Peter Kilfoyle", "| Peter Kilfoyle"]}, {"page": "Geoff Hoon", "response": ["Towards the end of his political career, Hoon acquired the irreverent nickname Buff (Buffoon) as the result of a joke told by fellow Labour Party colleague Peter Kilfoyle."]}, {"page": "Mo Mowlam", "response": ["Following Smith's death in 1994, Mowlam, alongside Peter Kilfoyle, became a principal organiser of Tony Blair's campaign for the Labour leadership. After his victory, Blair made her Shadow Secretary of State for Northern Ireland. She initially resisted being appointed to the position, preferring an economic portfolio, but, after accepting it, she threw her weight into the job."]}, {"page": "Tribune (magazine)", "response": ["Tribune changed format from newspaper to magazine in April 2001, but remained plagued by financial uncertainty, coming close to folding again in 2002. However, Seddon and the Chairman of Tribune Publications, Labour MP Peter Kilfoyle, led a team of pro-bono advisers who organised a rescue package with a consortium of trade unions (Unison, Amicus, Aslef,Plunkett, John, \"Tribune set to close by November\", The Guardian, 9 October 2008. The first cited reference is slightly misleading: Amicus merged with the TGWU in 2007 to form Unite. Communication Workers Union, Community, T&GWU), who became majority shareholders in return for a significant investment in the magazine in early 2004."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Peter Kilfoyle"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Peter Kilfoyle"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Peter Kilfoyle MP"]}, {"page": "List of United Kingdom MPs: K", "response": ["* Peter Kilfoyle (1991–2010)"]}, {"page": "Kelvin MacKenzie", "response": ["The remarks were met with widespread incredulity and condemnation, particularly on Merseyside, where Liverpool F.C., the local Liverpool Echo and numerous local MPs condemned MacKenzie, with Walton MP Peter Kilfoyle arguing that the quotes confirmed that MacKenzie was \"never fit to edit a national newspaper\". The Liverpool Echo called for The Sun to sack MacKenzie as a columnist. The Sun issued a statement saying that they had \"already apologised for what happened and we stand by that apology.\" However, despite reports of consternation at The Sun over MacKenzie's statements, the newspaper chose to retain him as a columnist. MacKenzie refused to comment publicly on the controversy and pulled out of a scheduled appearance on BBC television's Question Time later that week."]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Peter Kilfoyle"]}, {"page": "Minister for the Cabinet Office", "response": ["|Peter Kilfoyle"]}, {"page": "Walton, Liverpool", "response": ["The Liverpool Walton constituency was long a bastion of the left in the Labour Party with a Marxist influence stretching back to the 1950s. This came to a head when the Walton by-election in 1991 saw the Labour Party candidate, Peter Kilfoyle, defeat Walton Real Labour candidate Lesley Mahmood, a member of the Militant group, in the by-election caused by the death of left-wing MP Eric Heffer."]}, {"page": "Liverpool Hope University", "response": ["*Peter Kilfoyle, former Labour MP for Liverpool Walton"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Liverpool Walton || Peter Kilfoyle || Labour || Peter Kilfoyle || Labour"]}, {"page": "Liverpool Walton (UK Parliament constituency)", "response": ["Created by the Redistribution of Seats Act 1885, Liverpool Walton has been held by the Labour Party since the 1964 general election, and is the party's safest seat by size of majority. In 2010 and 2015, it had the largest Labour majority in the country by percentage terms. Labour won over 70% of the vote at every general election in the Walton constituency since 1992, although for many years; it was looked on as a reasonably safe Conservative seat. Until 1964, Labour had only gained Walton once, at their landslide victory after the Second World War ended in 1945. Like other seats in Merseyside, the Conservative Party's share of the vote declined rapidly during the 1980s, and Conservative candidates failed to poll in second place from 1997 until 2017. From 1964 until his death in 1991, the seat was held by the notable left-winger Eric Heffer; the subsequent by-election was won by Peter Kilfoyle, who held the seat until 2010. Steve Rotheram won the seat in 2010 after Kilfoyle stood down.", "| style=\"background-color: \" | || 1991 by-election || Peter Kilfoyle || Labour"]}, {"page": "Terry Fields", "response": ["On 11 July 1991, Fields was jailed for refusing to pay his poll tax bill of £373. In defence of the court's decision, Labour leader Neil Kinnock said: \"Law makers must not be law breakers. I have always made that clear.\"\"1991: Anti-Poll Tax MP Jailed\" , BBC On this Day, 11 July Fields's sentence was for 60 days, meaning that he retained his seat in the House of Commons, as MPs automatically lose their seat if they are imprisoned for more than a year. Labour Party members criticised Fields for his militant approach to the poll tax and his failure to support other Labour candidates, in particular Peter Kilfoyle in a by-election for the neighbouring constituency of Liverpool Walton, following Eric Heffer's death."]}, {"page": "Eric Heffer", "response": ["* Eric Heffer in Politico's Book of the Dead by Peter Kilfoyle (Politico's Publishing, 2003) "]}, {"page": "Michael Carr (Labour politician)", "response": ["Carr sought selection as the Labour candidate for Liverpool Walton when Eric Heffer announced his retirement in 1989, but lost to Peter Kilfoyle. In 1990 when Allan Roberts, the MP for Bootle, died of cancer, Carr was shortlisted for the candidacy along with Joe Benton, Mike Hall and Josie Farrington.Alan Dunn, \"Bootle likely to poll in autumn\", The Guardian, 23 July 1990, p. 2. On 25 April Carr was selected as Labour candidate for the constituency. He easily won the by-election to replace Roberts, on 24 May 1990; Carr told the press afterwards that the Labour Party had treated the constituency as a marginal and had not just campaigned on issues like the Poll Tax but also on bus deregulation, which had hit people living on the outskirts of the town.\"Labour hails 9.8% swing in poll win\", The Guardian, 26 May 1990, p. 7. He also said \"I don't see this as a job for life. I am not a career politician in the sense of following a career path with parliamentary ambitions.\"", "On 20 July 1990, Carr attended a meeting of the General Management Committee of Liverpool Walton CLP in his role as Secretary. The meeting was extremely heated as followers of the Militant tendency were gearing up to increase their influence in the constituency party after the selection of Peter Kilfoyle to follow the retirement of Eric Heffer. Carr felt chest pains and went outside for some fresh air, but broke into a cold sweat and had to sit down. He complained of 'pins and needles' and his hands were numb. An ambulance was called and Carr was admitted to Walton Hospital at 9:54 pm."]}, {"page": "Lesley Mahmood", "response": ["She was also prominent in the campaign against the Poll Tax and was put forward to be the Labour candidate in the Liverpool Walton by-election caused by the death of Eric Heffer in  1991. Although she won a majority of 92 out of 140 Walton Labour Party members, once the union votes were counted, Peter Kilfoyle became the Labour Party candidate.  In the ensuing by-election, Kilfoyle won with 21,317 (53.1%) votes while Mahmood, standing as Walton Real Labour, came third with 2,613 and 6.5% of the vote. The Walton by-election was a factor in the decision by Militant to leave the Labour Party, setting up first Militant Labour and then the Socialist Party.Marxism and the British Labour Party, For The Scottish Turn: Against Dogmatic Methods In Thought And Action"]}, {"page": "1994 Labour Party leadership election", "response": ["| Peter Kilfoyle || Blair || Prescott"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Peter Kilfoyle, Liverpool Walton, 1991–2010"]}, {"page": "1991 in the United Kingdom", "response": ["* 4 July – Labour retains the Walton seat at a by-election, with new MP Peter Kilfoyle gaining more than half of the vote."]}, {"page": "1991 Liverpool Walton by-election", "response": ["When Heffer announced his retirement, Lesley Mahmood, a \"Broad Left\" councillor and a member of Militant, stood for the Labour nomination. Peter Kilfoyle, who had been the Labour Party organiser in the city since 1985, gained the nomination by a narrow margin; he had been involved in removing Militant influence from the Liverpool Labour Party.Andy McSmith Faces of Labour: The Inside Story, London: Verso, 1996, p.115 Mahmood stood as a \"Walton Real Labour\" candidate."]}, {"page": "Equality Act (Sexual Orientation) Regulations 2007", "response": ["In the House of Commons, the regulations  were adopted by 309 votes to 99.The Public Whip division analysis, 19 March 2007  The dissenters were mostly Conservative MPs, although twenty-nine Tories did support the measures (Desmond Swayne, James Duddridge, David Cameron, George Osborne, Crispin Blunt, Andrew Tyrie, Andrew Mackay, Nick Herbert, Hugo Swire, Francis Maude, Oliver Letwin, Patrick McLoughlin, Chris Grayling, Michael Gove, Andrew Mitchell, Alan Duncan, Michael Fabricant, Theresa Villiers, Graham Stuart, Andrew Lansley, Bill Wiggin, Peter Ainsworth, Robert Key, Tony Baldry, David Willetts, Nigel Evans, Jeremy Hunt, John Bercow and Eleanor Laing). However ten Labour Members (Joe Benton, Tom Clarke, Frank Cook, Jim Dobbin, David Drew, Peter Kilfoyle, Jim McGovern, Alan Meale, Geraldine Smith and David Taylor) voted against, along with four Liberal Democrats (Alan Beith, Colin Breed, Tim Farron and Bob Russell)."]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Peter Kilfoyle || Tony Blair || John Prescott"]}, {"page": "Critical friend", "response": ["This dichotomy appealed to Hutchinson who frequently used the term while leader of the South East Midlands Citizen's Charter Quality Network run by the Cabinet Office in Whitehall. In his time running the network he came into regular contact with fellow Lancastrian and Government Minister Peter Kilfoyle MP, Public Service Minister who was responsible for the running of the networks as minister. When Kilfoyle found himself increasingly distanced from the policy agenda of Prime Minister Tony Blair and he chose to resign from Government, Hansard quotes him as saying that he wished to return to the back benches but remain a \"critical friend\" of the Government.", "He was misquoted in The Daily Telegraph as they claimed that he had said that he wished to be a \"candid friend\" to Government. It is not unreasonable to suppose that the term critical friend has its origins in the softer sounding notion of the candid friend. Nonetheless following the resignation of Peter Kilfoyle The Guardian newspaper (a popular publication amongst the intelligentsia and public sector middle management) began to popularise the term which is increasingly entering into general usage. The phrase is still most commonly used in education circles but its wider use in the public sector can to a large part be attributed to Andrew Hutchinson and his natural enthusiasm for the concept, being described as 'a natural critical friend acting with positive intent' in 1999 by the then Chief Executive of Coventry City Council, Iain Roxburgh, who is now Director of the Warwick Research Consortium. While a variety of useful and interesting quotations are to be found on the web perhaps the reason for the popularity of the phrase is best summed up by the following quotation,"]}, {"page": "International reactions to the Gaza War (2008–2009)", "response": ["|||When asked if the UK is \"neutral on this\", Foreign Office Minister Bill Rammell responded: \"I think we’ve taken the right position. We’ve condemned the rocket attacks from Hamas on the state of Israel. [...] But similarly we’ve made clear that there's been a massive loss of life within the Gaza Strip.\" British Prime Minister Gordon Brown condemned Israel over the shelling of the UN HQ in Gaza and said \"\"When the United Nations is doing such vital work - humanitarian work amongst women and children in Gaza - no-one can defend this attack by Israeli forces on the compound... The Israelis have now admitted it is a serious mistake.\"\"Brown condemns Israeli attack as 'indefensible'\"  independent.co.uk 15 January 2009 Link retrieved 25-01-09 The United Kingdom's government called for \"maximum restraint to avoid further civilian casualties\" and for an \"immediate halt to violence\" and on the other side for \"militants in the Gaza Strip to immediately cease all rocket attacks on Israel\". The British Foreign Secretary David Miliband also warned that Israel's attack might encourage further extremism.Death toll reaches 315 as Israel's Gaza assault enters third day 2008-12-29 Gordon Brown criticised Israel for using excessive force during its three-week military offensive against Hamas in the Gaza Strip. Speaking en route to a humanitarian conference in Egypt, the prime minister demanded that Israel reopen Gaza's crossings and allow humanitarian workers full access to the territory. The UK's Foreign and Commonwealth Office wrote that \"We supported the EU statement, which condemned Hamas rocket attacks and described Israeli military action as disproportionate.\" Peter Kilfoyle, a former Labour defence minister, accused Israel of \"state-sponsored terrorism\" and urged the government to \"ensure no arms were exported to the country.\" Sir Menzies Campbell, the former Liberal Democrat leader, said \"if any other democratic state had behaved in the same way, it would be faced with economic sanctions.\" British MP and former (shadow?) minister of labour, Sir Gerald Kaufman accused, \"Olmert, Livni and Barak are mass murderers, war criminals and bring shame on the Jewish people whose Star of David they use as a badge in Gaza.\", Chris Mullin, a former Foreign Office minister, said \"These are war crimes that we are witnessing in Gaza.\" Britain should start talking with EU allies about sanctions and \"at the very least to stop selling them weapons and, perhaps, the withdrawal of our ambassador\"."]}, {"page": "Tony Maudsley", "response": ["| Peter Kilfoyle"]}, {"page": "2009 Speaker of the British House of Commons election", "response": ["*John Bercow – Dai Davies (Ind), Charles Walker (Con), Malcolm Bruce (LD), Adam Price (Plaid), Karen Buck (Lab), Sandra Gidley (LD), Julie Morgan (Lab), Natascha Engel (Lab), Peter Kilfoyle (Lab), David Laws (LD), Anne Begg (Lab), Pete Wishart (SNP), Sadiq Khan (Lab), Patricia Hewitt (Lab), Mark Durkan (SDLP)."]}, {"page": "Mo (2010 film)", "response": ["|Peter Kilfoyle || Tony Maudsley"]}]}}