{"wiki_id": "http://www.wikidata.org/entity/Q7174235", "itemLabel": "Peter Gill", "itemDescription": "English cricketer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Gill_(cricketer)", "wikipedia_page": {"main": "Peter Nigel Gill (born 12 November 1947) is a former English cricketer. Gill was a right-handed batsman who bowled right-arm off break. He was born in Clayton, Staffordshire.\nGill made his debut for Staffordshire in the 1966 Minor Counties Championship against the Lancashire Second XI. Gill played Minor counties cricket for Staffordshire from 1966 to 1985, which included 141 Minor Counties Championship matches and 3 MCCA Knockout Trophy matches. In 1971, he made his List A debut for Staffordshire against Glamorgan in the Gillette Cup. He made 6 further appearances in List A cricket for the county, the last coming against Gloucestershire in the 1984 NatWest Trophy. In his 7 List A matches for the county, he scored 178 runs at an average of 25.42. He made 2 half centuries, with a high score of 52, which came against Glamorgan in 1971.Gill also made List A appearances for Minor Counties East, making his debut for the team in the 1976 Benson & Hedges Cup against Nottinghamshire. He made 11 further List A appearances for the team, the last coming against Northamptonshire in the 1978 Benson & Hedges Cup. In 12 appearances for the team, he scored 146 runs at an average of 12.16, with a high score of 41. He also played 2 first-class matches for the Minor Counties cricket team, the first came in 1976 against the touring West Indians. He was dismissed in the Minor Counties first-innings for 11 runs by Collis King. In their second-innings, Gill was dismissed for 15 by Raphick Jumadeen. He made his second first-class appearance in 1979 against the touring Indians. He was dismissed by Chetan Chauhan for 20 runs in the Minor Counties first-innings, while in their second-innings, he was dismissed by Yashpal Sharma for 18 runs.\n\n", "link_mentions": [{"page": "Peter Gill", "response": ["Peter Gill may refer to:", "* Peter Gill (playwright) (born 1939), British playwright and former actor", "* Peter Gill (VC) (1831–1868), Irish Victoria Cross recipient", "* Peter Gill (chemist), recipient of the 1999 Dirac Medal and 2011 Schrödinger Medal of the World Association of Theoretical and Computational Chemists", "* Peter Gill (politician) (died 2021), Pakistani politician", "* Peter Gill (FGTH drummer) (born 1964), former drummer of the band Frankie Goes to Hollywood", "* Peter Gill (musician) (born 1969), Cheltenham based Musician, Actor, Producer, Playwright", "* Peter Gill (golfer) (1930–2020), English golfer", "* Peter Gill (cricketer) (born 1947), English cricketer", "* Peter Gill (rugby league) (born 1964), Australian rugby league player"]}, {"page": "List of Minor Counties East List A players", "response": ["*Peter Gill (1976–1978): PN Gill"]}]}}