{"wiki_id": "http://www.wikidata.org/entity/Q7177765", "itemLabel": "Peter Womersley", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Womersley", "wikipedia_page": {"main": "Peter Womersley (24 June 1923 – 1993) was a British architect, best known for his work in the modernist style. He lived in the Scottish Borders, where a number of his buildings are located, although he worked on projects throughout the UK. Influenced principally by the work of Frank Lloyd Wright, and by the American Case Study Houses, Womersley's buildings employ such typical modernist elements as in-situ concrete and strong geometric forms, although he introduced a wider palette of materials than was typically used by Le Corbusier and his followers.", "link_mentions": [{"page": "Galashiels", "response": ["Netherdale is home to Gala RFC and Gala Fairydean Rovers, with the football and rugby stadiums adjoining each other at one end. The football club's main stand was built in 1963 to designs by Peter Womersley, based in nearby Gattonside. The cantilevered concrete structure, in the Brutalist style, is now protected as a Category A listed building."]}, {"page": "1958 in architecture", "response": ["* High Sunderland (house for Bernat Klein), near Selkirk, Scottish Borders, designed by Peter Womersley."]}, {"page": "1955 in architecture", "response": ["* House for John Womersley at Farnley Tyas, Yorkshire, England, designed by Peter Womersley."]}, {"page": "1964 in architecture", "response": ["**Gala Fairydean F.C. stand, Netherdale stadium, Galashiels, Scotland, designed by Peter Womersley, opened."]}, {"page": "1957 in architecture", "response": ["* High Sunderland (house for Bernat Klein), Scottish Borders, designed by Peter Womersley."]}, {"page": "1923 in architecture", "response": ["*June 24 – Peter Womersley, British architect (died 1993)"]}, {"page": "Netherdale", "response": ["The football stadium has a capacity of around 2,000. The ground's most striking feature is the main stand, which was opened in 1964. With a capacity of 500 it is the largest stand in the Scottish Borders. Designed by the renowned British architect Peter Womersley in the brutalist style, the concrete structure is sometimes sarcastically dubbed as \"the San Siro of the Borders\". It was awarded a 'B' category listing by Historic Scotland in December 2006, which means the \"character and setting\" of the building must be preserved for \"future generations\"."]}, {"page": "Gala Fairydean Rovers F.C.", "response": ["Gala Fairydean first played its home matches at Eastlands Park in Galashiels between 1909 and 1913, before moving to Mossilee for a spell until the 1920s. The club moved back to Eastlands, and stayed until 1929, when Netherdale was opened. Netherdale has been the club's home since 1929 and is located in the south-east of Galashiels. The ground's main spectator stand was designed by architect Peter Womersley, alongside engineers Ove Arup and built between 1963 and 1965. The stand has a capacity for 750 spectators and the ground as a whole up to 4,000. The cantilevered concrete structure is protected as a Category A listed building. The club bought 300 seats from Newcastle United's St James' Park stadium when it was refurbished, but were replaced in 2006 by wooden benches.Gala Fairydean - Ground , Vale of Leithen F.C.. Retrieved 1 April 2013."]}, {"page": "Western General Hospital", "response": ["*Nuffield Transplant Unit by Peter Womersley, 1955 – distinctive modenist architecture and pedestrian bridge over the south access road"]}, {"page": "DoCoMoMo Key Scottish Monuments", "response": ["| Bernat Klein House and Studio || Scottish Borders || 1957 (house) 1972 (studio) || Peter Womersley || Both buildings Category A listed  ", "| Transplantation Surgery Unit, Western General Hospital || Edinburgh || 1963 || Peter Womersley || "]}, {"page": "Prospect 100 best modern Scottish buildings", "response": ["| Peter Womersley", "| Peter Womersley"]}, {"page": "List of Brutalist structures", "response": ["* Netherdale football stadium, Galashiels, Scottish Borders, Scotland, (Peter Womersley, 1963)"]}, {"page": "Bernat Klein", "response": ["Klein resigned from this company in 1966, setting up on his own again. He based himself at his home near Selkirk, where he commissioned a studio building from the architect Peter Womersley, who had designed Klein's house, High Sunderland, in the 1950s. He established a cottage industry of hand-knitters, employing up to 250 people. During the 1970s he began producing his own clothing collections, and later established himself as a design and colour consultant. The Department of the Environment commissioned him in the latter capacity to develop standard ranges of carpets and upholstery fabrics."]}, {"page": "Gattonside", "response": ["Gattonside was the home of modernist architect Peter Womersley (1923–1993), whose self-designed house, The Rig (1956), is now a Category B listed building."]}, {"page": "Womersley (surname)", "response": ["* Peter Womersley (1923–1993), a British architect"]}, {"page": "Peter Stead (architect)", "response": ["Stead's family had been engaged in building for several generations. In the early 1950s he and his firm Law Stead were engaged in constructing the modernist house designed by Peter Womersley at Farnley Hey. Later in the decade he worked with Stephen Gilbert on experimental construction designs."]}, {"page": "Dingleton Hospital", "response": ["The hospital, which was designed by Brown & Wardrop, opened as the Roxburgh, Berwick and Selkirk District Asylum in May 1872. A new female hospital block was completed in 1898 and two new wings, designed by Sydney Mitchell and Wilson, were completed in 1906. The facility joined the National Health Service as Dingleton Hospital in 1948. A monolithic concrete boiler house, designed by Peter Womersley, which still dominates the local skyline, was completed in 1977."]}, {"page": "High Sunderland", "response": ["High Sunderland is a Modernist house built in woodland in the grounds of the 19th-century Sunderland Hall, between Selkirk and Galashiels in the Scottish Borders.  It was designed in 1957 by Peter Womersley for the textile artist Bernat Klein and his wife Peggy, and completed in 1958.  The interior was decorated with exotic woods, and with fabrics specially designed by Klein. The house, with its clear and coloured panes of glass within a wooden structure, and its woodland setting, has been described as like \"a Mondrian set within a Klimt\".  ", "* \"Peter Womersley's High Sunderland house goes on sale for first time\", The Architects' Journal, 18 August 2017", "* Bauhaus with a British Twist: Peter Womersley’s High Sunderland, Mid-Century Home, 8 October 2017 ", "* Chronicles of Modernism: the history of Klein House, Peter Womersley and Bernat Klein’s paragon of mid-century design, The Modern House", "*  A Borders Icon: Peter Womersley's Klein House, Lyon & Turnbull, 11 April 2018 "]}, {"page": "Listed buildings in Holme Valley (outer areas)", "response": ["|A house in Modernist style designed by Peter Womersley, it is built in stone, pale brick, teak slatting and glass on a timber frame, and has a flat roof.  It has two storeys, an L-shaped plan, and is partly open-plan.  The house was extended in 1964–65."]}, {"page": "Womersley, Peter", "response": ["#redirectPeter Womersley"]}]}}