{"wiki_id": "http://www.wikidata.org/entity/Q7176351", "itemLabel": "Peter Peri", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Peri", "wikipedia_page": {"main": "Peter Peri is a British artist known for his work in painting and drawing. He lives and works in London, where he was born.\nPeri studied at Chelsea College of Art, London, graduating from the MA programme in 2003. He made his debut in 2003 at Bloomberg New Contemporaries. He has also shown at Art Now at Tate Britain in April 2007, the Kunsthalle Basel, Switzerland in September 2006 and his work was shown at Tate Britain's Classified and the Arts Council Collection's How to Improve the World: 60 Years of British Art at the Hayward Gallery, London.\nPeri's work has a personal connection to Modernism. His grandfather was Laszlo Péri (1899–1967), a Hungarian émigré to Britain who was involved in Constructivism before turning to architecture and later in his life to Realism. After 1945 his grandfather adopted the name \"Peter Peri\" also.", "link_mentions": [{"page": "Peter Laszlo Peri", "response": ["László Weisz was born on 13 June 1899 in Budapest, Hungary. His family Magyarized their family name to \"Péri\". When he moved to Germany and became involved in Constructivism, he was known as Laszlo Péri. After he moved to England, he adopted the name \"Peter Peri\". His grandson, an artist born in 1971, also has the name Peter Peri.", "Peri immigrated to England in 1933, after his wife Mary Macnaghten, granddaughter of social reformer Charles Booth, was arrested in possession of Communist propaganda. In 1934, Peri contributed \"several forceful works in coloured concrete\" to the Artists’ International Association (AIA) exhibition The Social Scene. He made contact with John Heartfield. In England, he lived first in Ladbroke Grove, then in Hampstead; in 1938, he moved to a studio in Camden Town where he worked until 1966. While in Hampstead, Peri joined the recently founded English section of the Artists International (later to be known as Artists International Association), an association composed largely of commercial artists and designers whose declared intention was to mobilise \"the international unity of artists against Imperialist War on the Soviet Union, Fascism and Colonial oppression\".  In July 1938, he had a solo exhibition London Life in Concrete in an empty building at 36 Soho Square. In 1939, he became a British citizen and took the name \"Peter Peri\". In November 1948, he held a solo show Peri's People at the AIA Gallery. Late in the 1940s he did a series of commissions for the London County Council. His work was also part of the sculpture event in the art competition at the 1948 Summer Olympics. In 1951, Peri produced a sculptural group originally titled “Sunbathing group - Horizontal”, later known as The Sunbathers for the Festival of Britain.The sculpture was rediscovered in 2017: Guardian Friday 21 April 2017 \"Naked ambition: £15,000 appeal to revive nude sunbather statues\" by Mark Brown", "Peter Peri died on 19 January 1967.", "**1958 Longslade Grammar School. The Mastery of Atom = Self-mastery. Horizontal.Longslade Community College uses Peter Peri's sculpture as its logo (accessed 23 February 2008).", "*1959 Exeter University. Diagonal sculpture.Illustration of Peter Peri's sculpture at University of Exeter: \"Man of the World\". (Accessed 24 February 2008)", "*1968 Peter Peri 1899–1967 Central Library Swiss Cottage, London", "*2008 Peter Peri Exhibition, Sam Scorer Gallery, Lincoln."]}, {"page": "Peri (name)", "response": ["* Peter Peri (born 1971), artist, grandson of Peter Laszlo Péri"]}, {"page": "Adam Szymczyk", "response": ["2006: Gustav Metzger, In Memoriam: New Works; Ahlam Shibli, Trackers; Diango Hernandez, Revolution; Nairy Baghramian, Es ist ausser haus; Kate Davis, STOP!STOP!STOP!; Lee Lozano, WIN FIRST DONT LAST WIN LAST DON'T CARE (retrospective exhibition, travelled to Van Abbemuseum, Eindhoven); Peter Peri Country 10; QUAUHNAUHUAC: The Straight Line Is a Utopia (Maria Thereza Alves, Dr. Atl, Ross Birrell & David Harding, Friederike Clever, Jimmie Durham, Cisco Jiménez, Robert Smithson, Hildegard Spielhöfer)"]}, {"page": "Peri, Peter", "response": ["#redirectPeter Peri"]}]}}