{"wiki_id": "http://www.wikidata.org/entity/Q7172974", "itemLabel": "Peter Bromilow", "itemDescription": "British actor (1933-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Bromilow", "wikipedia_page": {"main": "Peter Brian Bromilow (21 April 1933 - 16 October 1994) was an English-born actor.Active on stage, he made his film debut in 1967 in Camelot, playing Sir Sagramore to Vanessa Redgrave's Guenevere.He moved to Hollywood in the 1970s, and made television guest appearances on Daniel Boone, The Virginian, The Feather and Father Gang, Remington Steele and The Wonder Years. His U.S. theatre work included playing Inspector Lestrade in Sherlock's Last Case, directed by Charles Marowitz, with the Los Angeles Actors' Theatre in 1984.", "link_mentions": [{"page": "The Railway Children", "response": ["| Dr Forrest || John Le Mesurier || John Stuart || John Ringham || Peter Bromilow || David Bamber || TBC"]}, {"page": "1994 in film", "response": ["| style=\"text-align:center;\"| 16 || Peter Bromilow || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1990 in film", "response": ["| Wild at Heart || The Samuel Goldwyn Company || David Lynch (director/screenplay); Nicolas Cage, Laura Dern, Willem Dafoe, Crispin Glover, Diane Ladd, Isabella Rossellini, Harry Dean Stanton, Calvin Lockhart, J. E. Freeman, W. Morgan Sheppard, Grace Zabriskie, Marvin Kaplan, David Patrick Kelly, Freddie Jones, John Lurie, Jack Nance, Pruitt Taylor Vince, Sherilyn Fenn, Frances Bay, Frank Collison, Sheryl Lee, Peter Bromilow, Sally Boyle, Gregg Dandridge, Koko Taylor || Crime, Thriller || Live action"]}, {"page": "1988 in film", "response": ["| Scrooged || Paramount Pictures || Richard Donner (director); Mitch Glazer, Michael O'Donoghue (screenplay); Bill Murray, Karen Allen, John Forsythe, John Glover, Bobcat Goldthwait, Alfre Woodard, David Johansen, Carol Kane, Robert Mitchum, Michael J. Pollard, Mabel King, Jamie Farr, Robert Goulet, Buddy Hackett, John Houseman, Lee Majors, Pat McCormick, Brian Doyle-Murray, Mary Lou Retton, Jean Speegle Howard, June Chandler, Mary Ellen Trainor, Bruce Jarchow, Peter Bromilow, Jack McGee, Kathy Kinney, Tony Steedman, Rebeca Arthur, Selma Archerd, Roy Brocksmith, Sachi Parker, Delores Hall, Anne Ramsey, Logan Ramsey, Wendie Malick, Joel Murray, Mitch Glazer, Maria Riva, Michael O'Donoghue, Amy Hill, Miles Davis, Larry Carlton, David Sanborn, Paul Shaffer, Solid Gold Dancers, Don LaFontaine, John Murray, Nicholas Phillips, Al 'Red Dog' Weber, Michael Eidam, Kate McGregor-Stewart, Lisa Mende, Ryan Todd, Chaz Conner Jr. || Christmas, Comedy || Live action", "| My Stepmother Is an Alien || Columbia Pictures || Richard Benjamin (director); Herschel Weingrod, Timothy Harris, Jonathan Reynolds (screenplay); Dan Aykroyd, Kim Basinger, Jon Lovitz, Alyson Hannigan, Joseph Maher, Seth Green, Ann Prentiss, Wesley Mann, Tony Jay, Harry Shearer, Juliette Lewis, Peter Bromilow || Sci-Fi || Live action"]}, {"page": "1984 in film", "response": ["| Breakin' || Cannon Films / Golan-Globus / MGM/UA || Joel Silberg (director); Charles Parker, Allen DeBevoise (screenplay); Lucinda Dickey, Adolfo 'Shabba Doo' Quiñones, Michael 'Boogaloo Shrimp' Chambers, Ice-T, Scratcher, Ben Lokey, Phineas Newborn III, Christopher McDonald, Vidal \"Lil Coco\" Rodriguez, Bruno \"Pop N' Taco\" Falcon, Timothy \"Popin' Pete\" Solomon, Ana \"Lollipop\" Sanchez, Cooley Jaxson, Peter Bromilow, Michel Qissi, Jean-Claude van Damme || Dance, Comedy, Drama || Live action"]}, {"page": "1977 in film", "response": ["| Semi-Tough || United Artists || Michael Ritchie (director); Walter Bernstein, Ring Lardner Jr. (screenplay); Burt Reynolds, Kris Kristofferson, Jill Clayburgh, Robert Preston, Lotte Lenya, Bert Convy, Brian Dennehy, Richard Masur, Carl Weathers, Roger E. Mosley, Mary Jo Catlett, Joe Kapp, Ron Silver, Jim McKrell, Peter Bromilow, Norman Alden || Sports, Comedy || Live Action "]}, {"page": "Wild at Heart (film)", "response": ["* Peter Bromilow as Hotel Manager"]}, {"page": "Semi-Tough", "response": ["* Peter Bromilow as Kostov's Interpreter"]}, {"page": "Breakin'", "response": ["* Peter Bromilow as Judge"]}, {"page": "Camelot (film)", "response": ["|Peter Bromilow"]}, {"page": "Sagramore", "response": ["* The knight appears in the musical Camelot and was played by Peter Bromilow in the film version. "]}, {"page": "The Railway Children (1970 film)", "response": ["* Peter Bromilow as Doctor Forrest "]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Peter Bromilow"]}, {"page": "Bromilow", "response": ["*Peter Bromilow (1933–1994), British-born actor"]}, {"page": "Deaths in October 1994", "response": ["*Peter Bromilow, 61, English actor."]}, {"page": "Bromilow, Peter", "response": ["#redirectPeter Bromilow"]}]}}