{"wiki_id": "http://www.wikidata.org/entity/Q7177373", "itemLabel": "Peter Tregloan", "itemDescription": "British athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Tregloan", "wikipedia_page": {"main": "Peter Tregloan (born 18 October 1957) is a former strongman and Powerlifter from Cornwall. He has won a number of titles including nine world championships in powerlifting and is the current world record holder in Squat, Deadlift and Total weight for the Masters age class.\n\n", "link_mentions": [{"page": "List of people from Cornwall", "response": ["* Peter Tregloan, powerlifter"]}, {"page": "Jamie Reeves", "response": ["When Reeves saw Bill Kazmaier win his third World's Strongest Man title in 1982, on BBC television, he decided that would be his aim, and took up weights. By 1986 he had become the Yorkshire and North East powerlifting champion in the superheavy class. In addition to powerlifting he had become actively involved in strength athletics and in 1986 won the National Truck Pulling Championships (sponsored by ASA/Bristol Street Motors) and came second to Peter Tregloan in 1986 in the Midland's Strongest Man competition. In 1987 he improved on his second-place finish by winning the Midland's Strongest Man (the first of three consecutive wins). That year he also won the first of three consecutive Yorkshire's Strongest Man competitions and won the England's Strongest Man competition also. In 1988 he took the title of East Britain's Strongest Man and entered John Smith's Trial of Strength, a competition organised by Geoff Capes and David Webster in order to find the successor to the retired Capes. He won the title, the equivalent that year of Britain's Strongest Man. Underlining his calibre, he then broke Tom Topham's 274-year-old record by harness lifting three beer barrels weighing a total of 845 kg."]}, {"page": "Britain's Strongest Man", "response": ["|1988John Smith's Trial of Strength ||  Jamie Reeves ||  Mark Higgins || Peter Tregloan ||Tadcaster"]}, {"page": "List of Cornish sportsmen and sportswomen", "response": ["*Peter Tregloan (born 1957), strongman and powerlifter", "*Peter Tregloan (born 1957), strongman and powerlifter"]}, {"page": "List of people from Jersey", "response": ["*Peter Tregloan, powerlifter (born 1957)"]}, {"page": "Tregloan, Peter", "response": ["#redirectPeter Tregloan"]}]}}