{"wiki_id": "http://www.wikidata.org/entity/Q7173013", "itemLabel": "Peter Bruff", "itemDescription": "British civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Bruff", "wikipedia_page": {"main": "Peter Schuyler Bruff (23 July 1812 – 24 February 1900) was an English civil engineer \nremembered primarily for his part in establishing the East Anglian railway networks between the 1840s and 1860s. His contribution to the region's infrastructure and development extended far beyond the railways, however, and included the renovation of the Colchester water supply (1851-1880) and the Ipswich sewerage system (completed 1881), the development of the town of Harwich and the Essex resorts of Walton-on-the-Naze and Clacton on Sea (which he built up from an empty piece of farmland into a flourishing seaside town), and (not least) the late Victorian revival of the Coalport porcelain factory in Shropshire, which he purchased in 1880.", "link_mentions": [{"page": "Clacton-on-Sea", "response": ["In 1871 the Essex railway engineer and land developer Peter Bruff, the steamboat owner William Jackson, and a group of businessmen built a pier and the Royal Hotel (now converted to flats) on a stretch of farmland adjoining low gravelly cliffs and a firm sand-and-shingle beach near the villages of Great and Little Clacton. The town of Clacton-on-Sea was officially incorporated in 1872 and laid out rather haphazardly over the next few years: though it has a central 'grand' avenue (originally Electric Parade, now Pier Avenue) the street plan incorporates many previously rural lanes and tracks, such as Wash Lane. Plots and streets were sold off piecemeal to developers and speculators. In 1882 the Great Eastern Railway already serving the well-established resort of Walton-on-the-Naze along the coast, built a spur to Clacton-on-Sea with a junction at Thorpe-le-Soken.", "The modern day Clacton-on-Sea was founded by Peter Bruff in 1871 as a seaside resort. Originally the main means of access was by sea; Steamships operated by the Woolwich Steam Packet Company docked from 1871 at Clacton Pier which opened the same year. The pier now offers an amusement arcade and many other forms of entertainment."]}, {"page": "Great Eastern Main Line", "response": ["The only tunnel on the line is just south of . The  long tunnel was built by Peter Bruff as part of the Ipswich & Bury Railway. It was completed in 1846 and it is thought to be the earliest driven on a sharp continuous curve. During the excavation of the tunnel, many important fossils were discovered, including rhinoceros, lion and mammoth; the site was known as the \"Stoke Bone Beds\". The finds are considered important in understanding climate change during the Ice Age. This tunnel had the trackbed lowered so the line could accommodate taller freight trains."]}, {"page": "Frinton-on-Sea", "response": ["Until late Victorian times, Frinton-on-Sea was a church, several farms and a handful of cottages. In the 1890s, the original developer of the town, Peter Bruff, was bought out by the industrialist Richard Powell Cooper, who had already laid out the golf course. (Registration required). Powell Cooper rejected Bruff's plans for a pier, stipulated the quality of housing to be built and prohibited boarding houses and pubs. The Sea Defence Act 1903 established a project to stabilise the cliffs, with the Greensward, which separates the Esplanade from the sea, put in place to stabilise the land further."]}, {"page": "Ipswich railway station", "response": ["The station was re-sited to its present location in 1860. Some sources suggest that the main building was thought to be principally the work of Peter Bruff; who had certainly started the structure. ", "“The present station opened in 1860. By Robert Sinclair, the Eastern Counties Railway’s engineer, although Gordon Biddle suggests the design may have been Peter Bruff’s. Called  ‘graceful and pretty’ in the Handbook of 1864. Perhaps it struck people as that when it was new. White and red brick, with round-arched windows, low and spreading. The buildings on the island platform, added in 1883, are much more ornate, with carved keystones, terracotta roundels and ironwork by Matthew T Shaw & Co, Millwall.”", "Ipswich tunnel was built by the Eastern Union Railway's engineer Peter Bruff and opened in November 1846. Trains from Bury St. Edmunds passed the existing station site (at that point undeveloped) and continued to Halifax Junction south of the tunnel where they then reversed into the original Croft street terminus. The tunnel was built as there was no room between the River Orwell and Stoke Hill to build a railway and is thought to be the first tunnel in the world to be built on a continuous curve. During its construction many fossils were found including those of a Woolly mammoth. Further excavations in 1908 and 1919 were led by Nina Frances Layard revealed remains of mammoths, a turtle and lions. The latter excavation was as a result of the GER widening the cutting east of the tunnel to accommodate some additional sidings. Further bones were found in 1975 by archeologist John Wymer."]}, {"page": "Eastern Union Railway", "response": ["The Eastern Union Railway (EUR) was an English railway company, at first built from Colchester to Ipswich; it opened in 1846. It was proposed when the earlier Eastern Counties Railway failed to make its promised line from Colchester to Norwich. The businessman John Chevallier Cobbold and the engineer Peter Bruff were prominent in launching the company. The allied but nominally independent Ipswich and Bury Railway built a line onwards to Bury St Edmunds, also opening in 1846, and soon amalgamated with the EUR.", "Peter Bruff had been working as an engineer on the construction of the Eastern Counties Railway. It appears that there was friction between him and the company's chief engineer, John Braithwaite. Braithwaite had designed the Eastern Counties Railway with magnificent, but very costly, viaducts and earthworks. Braithwaite estimated that £800,000 was needed to extend the line from Colchester to Ipswich. Bruff believed that a cheaper scheme was more practicable. Bruff was discharged from the service of the Eastern Counties Railway in 1842, but he maintained contact with John Chevallier Cobbold, a director of that company. Cobbold became the driving force in promoting a new railway to connect Ipswich and Colchester, and at a public meeting in Ipswich on 8 August 1843 Bruff explained his scheme. The line would be called the Eastern Union Railway, and would be much more cheaply built than the Eastern Counties Railway's proposed line. With the impetus of Cobbold's support and Bruff's engineering competence, it was shown to be practicable and affordable to extend to Ipswich."]}, {"page": "William Bridges Adams", "response": ["Dissatisfied with the scarf joints then in use for joining iron track, he invented the first railway fishplate, in the form of an unbolted wedge between adjoining chairs, in collaboration with Robert Richardson, a junior engineer under Peter Bruff on the Eastern Counties Railway. The two men patented the invention in 1847. Although the design was successful, with sales to the Eastern Counties Railway among others, financial difficulties forced Adams to relinquish the patent.Manby (1857: 289) This \"wedge\" version was soon overtaken by an improved, bolted design by James Samuel of the Eastern Counties Railway.Manby (1857: 234)"]}, {"page": "Bury St Edmunds railway station", "response": ["The ground breaking ceremony took place in Ipswich on 1 August 1845 where twelve local worthies (including the mayor of Ipswich, engineer Peter Bruff and John Chevallier Cobbold) each filled a wheelbarrow with soil. Building the line was challenging with problems at Ipswich with tunnel construction and at Stowmarket where the local marsh swallowed up a lot of material with test probes finding the bog was 80 feet deep!"]}, {"page": "Elmswell railway station", "response": ["The ground breaking ceremony took place in Ipswich on 1 August 1845 where twelve local worthies (including the mayor of Ipswich, engineer Peter Bruff and John Chevallier Cobbold) each filled a wheelbarrow with soil. Building the line was challenging with problems at Ipswich with tunnel construction and at Stowmarket where the local marsh swallowed up a lot of material with test probes finding the bog was 80 feet deep!", "The station building was designed by Frederick Barnes (architect), an Ipswich-based architect who had worked under Peter Bruff. The main buildings were located on the down side and featured high brick chimneys, Dutch gables and a timber fronted canopy."]}, {"page": "Ashwellthorpe railway station", "response": ["As early as 1853 Peter Bruff surveyed a link between Wymondham and Forncett on the Norwich to Ipswich line for the Eastern Counties Railway but the plans were not developed."]}, {"page": "Ipswich Stoke Hill railway station", "response": ["For more than one hundred and twenty years after the station's closure, the site was in use as railway sidings. These consisted of a carriage and wagon works and Ipswich engine shed. Subsequently the site had its tracks removed and was redeveloped, including Bruff Road, named in honour of Peter Bruff the engineer who brought the railway to Ipswich."]}, {"page": "Coalport porcelain", "response": ["John Rose died in 1841; the enterprise was continued under the former name \"John Rose & Co.\" by his nephew W.F. Rose and William Pugh.  William Pugh continued the production as sole proprietor from 1862 until his death in 1875, after which the company was put in receivership by his heirs. It was purchased in 1880Shropshire Archives, Ref. 1190/3/1133-1294, especially extension 1229, descriptive listings in The National Archives Catalogue. by the East Anglian engineer Peter Bruff (died 1900), who reinstated it as the Coalport China Company. Under the management of his son Charles Bruff from 1889,Burton 1921:105. an extensive export trade to the United States and Canada was initiated in the 1890s, and the works were rebuilt on the original site in 1902.J. Alfrey and C. Clark, The Landscape of Industry: Patterns of Change in the Ironbridge Gorge (Routledge 2005), p.99-100."]}, {"page": "Chappel Viaduct", "response": ["The seven million bricks used in the construction of the viaduct were made from clay excavated from the nearby village of Bures. It was built to carry a double-track railway but only a single track was laid. The bridge was built by Peter Bruff between 1847 and 1849 for the Colchester, Stour Valley, Sudbury & Halstead Railway, later part of the Great Eastern Railway."]}, {"page": "Bruff (surname)", "response": ["*Peter Bruff (1812–24 February 1900), English civil engineer"]}, {"page": "Frederick Barnes (architect)", "response": ["During the 1840s Barnes was working with two of the nascent East Anglian Railways – the Eastern Union Railway and the Ipswich and Bury Railway alongside engineer Peter Bruff. Here he was responsible for several station buildings including Ipswich's first railway station at Stoke Hill (since demolished). Some well-regarded examples survive at Needham Market, Stowmarket and Bury St Edmunds. During this period he also worked closely with Sancton Wood whom he had known when they worked for Sidney Smirke. Sancton Wood is often jointly credited with Barnes on the design of some stations which are in a Jacobean style. ", "| Ipswich Stoke Hill railway station || 1843 || Commissioned by Peter Bruff – station closed in 1860. Site became part of Ipswich engine shed and adjacent wagon works. Now a housing estate."]}, {"page": "Perceval M. Parsons", "response": ["Parsons was a son of John Parsons of Scraptoft, Leicestershire, and was born in London. Schooled privately in Shooter's Hill, he displayed an aptitude for engineering and, from the age of 15, studied for two years at Portsmouth Dockyard before being articled to Messrs. Braithwaite & Milner in London. In 1841, he was employed on railway engineering work by Peter Bruff, working as a resident engineer on the Eastern Counties Railway until 1845. In 1846, Parsons was employed on engineering work by John Rennie, engaged as superintendent of large fixed plant and machinery on the Eastern Union Railway. He then established his own engineering business in London in 1850, being mainly concerned with design and construction of railway fittings, patenting improved switches and axle-boxes.Obituary: Perceval Moses Parsons, Iron and Steel Institute, 1892. Reproduced in Grace's Guide to British Industrial History: Perceval Moses Parsons. Accessed: 6 November 2019.Obituary: Perceval Moses Parsons, Institution of Civil Engineers, 1893. Reproduced in Grace's Guide to British Industrial History: Perceval Moses Parsons. Accessed: 6 November 2019."]}, {"page": "Bruff, Peter", "response": ["#redirectPeter Bruff"]}]}}