{"wiki_id": "http://www.wikidata.org/entity/Q7177422", "itemLabel": "Peter Turner", "itemDescription": "English photographer, curator and writer (1947-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Turner_(writer_and_photographer)", "wikipedia_page": {"main": "Peter Turner (1947–2005) was a photographer, curator, and writer. He was the longest-serving editor of Creative Camera.", "link_mentions": [{"page": "2005 in New Zealand", "response": ["* 1 August – Peter Turner, photographer and writer (born 1947)"]}, {"page": "Guildford School of Art", "response": ["* Peter Turner"]}, {"page": "John Blakemore", "response": ["From 1985 he was one of the contributors, with Peter Turner, Fay Godwin and Lewis Baltz, to workshops at The Photographer's Place in Derby, and in 1991 with Godwin, Derry Brabbs and Thomas Joshua Cooper at Inversnaid Lodge near Loch Lomond and the Trossachs. In 1990 he also gave printing demonstrations and workshops to members of the RPS in his own darkroom at 2 Ferrestone Road, Hornsey, and in 1992 presented Master classes at Duckspool Photographers, Somerset, with Paul Hill, Fay Godwin, Martin Parr, Eamonn McCabe, Peter Goldfield, Tom Cooper, Brian Griffin, Roger Mayne, and Sue Davies. Blakemore, in his eighties, was still conducting printing workshops, at The Photo Parlour, Nottingham, in 2019."]}, {"page": "Peter Turner", "response": ["Peter Turner may refer to:", "* Peter Turner (writer and photographer) (1947–2005), London-born photographer and writer", "* Peter Turner (physician) (1542–1614), English Paracelsian and Member of Parliament ", "* Peter Turner (mathematician) (1586–1652), English mathematician, son of the physician", "* Peter Turner (Australian footballer) (born 1974), Australian rules footballer", "* Peter Turner (Scottish footballer) (1876–1970), Scottish Association football player", "* Peter Turner (rugby league), New Zealand rugby league international"]}, {"page": "Creative Camera", "response": ["Jay left after differences with Osman in December 1969 to set up a short lived high-production periodical Album (1970–1971), and in January 1970 Colin Osman, drawing on his photo-historical interests and amateur photography, became editor. He was joined by Peter Turner, first as Assistant Editor and then as Co-Editor.David Brittain, \"Mirror with a Memory: Thirty Years of Writing in Creative Camera\"; in David Brittain, ed., Creative Camera: Thirty Years of Writing. Turner, like Jay who suggested he take the job, had studied photography at the Guildford School of Art (1965–1968) before becoming a journalist for SLR magazine.", "These changes in social politics took effect in the magazine by 1986, when Colin Osman resigned to make way for full revenue support by the Arts Council of Great Britain and the transfer of editorial decisions to a board of directors so that, while inclusive of traditionalists represented by Gerry Badger, Colin Osman and Peter Turner, perspectives introduced by members Ian Jeffrey, Jo Spence, Rebecca Solnit, Geoffrey Batchen and others in the 1990s brought Creative Camera's critical and intellectual content in line with more general art world publications.", "Artworks provided visual commentary on the ideological and textual content. In 1990, the photographers Henry Bond and Richard Burbridge guest edited a double issue showcasing emerging British photographers—\"The New New\" issue, October–November. The selection they made included the first published examples of photo-based artworks by Sarah Lucas, Damien Hirst and Angus Fairhurst.See artists' pages, p. 2-3; 16-45; and images accompanying scholarly essay, Andrew Renton, \"Disfiguring: Certain New Photographers and Uncertain Images,\" p. 16-21.Also see the comments on that issue made by David Brittain in his Obituary of fellow Creative Camera editor, i.e., David Brittain, \"Peter Turner 1947-2005,\" Afterimage, Sept-Oct, 2005. Bond's collaboration with the magazine continued as an ongoing series of artists' pages that ran as \"openers\"—appearing on the inside front cover and contents page. One spread, created by Hirst, depicted the mutilated corpse of a young man with wounds to the eyes, and was captioned Damien Hirst: Fig. 60 Self-inflicted injuries...; another introduced Fairhurst's self-portrait Man Abandoned by Colour.See: Creative Camera issues 309/310/311/312. A comprehensive database of the magazine contents on hwwilsonweb.com (athens signin required).Facsimiles of the pages on Bond's archive, i.e., Hirst (Issue 309, April–May 1991, p. 2-3); Fairhurst (Issue 312, October–November 1991, p. 2-3)."]}, {"page": "Peter Turner (writer and editor)", "response": ["#REDIRECT Peter Turner (writer and photographer)"]}, {"page": "Dorothy Bohm", "response": ["A major 1969 exhibition in the Institute of Contemporary Arts of photography by Bohm, Don McCullin, Tony Ray-Jones and Enzo Ragazzini drew a response that encouraged one of its organizers, Sue Davies, to embark on a photography gallery for London.Peter Turner, History of Photography (Twickenham: Hamlyn, 1987; ), p.208.She visited South Africa for five weeks in 1974, later exhibiting photographs taken there. With Helena Kovac, she also founded the Focus Gallery for Photography in 1998; the gallery closed in 2004.Diane Smyth, \"The life and work of Dorothy Bohm \", British Journal of Photography, 7 April 2010. Accessed 1 July 2012. She was awarded an honorary fellowship of the Royal Photographic Society in November 2009.List of honorary fellowships, Royal Photographic Society. Accessed 1 July 2012.RPS press release, photographyblog.com, 12 October 2009. Accessed 1 July 2012."]}, {"page": "Gerry Badger", "response": ["*Photo Texts. London: Travelling Light, 1988. . Essays by Badger and Peter Turner."]}, {"page": "Daniel Meadows", "response": ["*\"Serpentine Photography 73.\" Serpentine Gallery (London), 1973. Curated by Peter Turner.Serpentine Photography 73: The Arts Council Presents Work by 43 Young Photographers (London: Serpentine Gallery, 1973). Exhibition catalogue."]}, {"page": "Aaron Scharf", "response": ["In 1969 Aaron Scharf joined The Open University, Milton Keynes, England, moving to Deanshanger 10 miles away. He stayed there, as Professor of Art History writing art history coursesIn interviews with Dr Harriet Atkinson (http://www.vivavoices.org/website.asp?page=Tim%20Benton) Tim Benton, architectural historian, worked at Open University and records how he was attracted to both studying at the Courtauld and working at OU because of Scharf's energy and innovation. and pursuing personal research, until pressured out by other staff in 1982.\"Aaron Scharf (Modernism: Photography: Art) was Professor of Art History at The Open University from 1969 to 1982. He has now retired. Among his publications is 'Art and Photography', first published in 1968.\" from 'Contributors to this issue', History of Photography, Vol. 13, no. 1' JANUARY-MARCH 1989, p.107 Also in 1969, he visited the United States to deliver units on Photography in Modern Art and Seminar in Problems in the History of Photography for Stanford University's 1969 Summer School. From August 1972 he was a member of the photography committee of the Arts Council chaired by Barry Lane with Tristram Powell, a BBC producer; Marina Vaizey, Sunday Times art critic; Bill Gaskins, head of the Audio-Visual Department at Sheffield Polytechnic; David Hurn of Magnum, Ron McCormick and Peter Turner, assistant editor of Creative Camera.Paul Harris, The Guardian, Saturday, 31 January 1976, p.10 The BBC’s landmark eight-part series Pioneers of Photography (1975) was fronted by Aaron Scharf and looked at the history and development of photography."]}, {"page": "Brummels Gallery", "response": ["* 1978, November; Peter TurnerThe Age, Friday 24 Nov 1978, p.42Tony Perry, 'Through dull English eyes,' The Age, Friday 17 November 1978, p.2"]}, {"page": "Light Vision", "response": ["Critical and art-historical writing was building strength before the demise of Light Vision, with extended contributions from significant authorities, Australian and international, of both genders; Beatrice Faust, Peter Turner, Gael Newton, Memory Holloway and in the last issue, Max Kozloff.", "|Peter Turner", "|Peter Turner", "During Creative Camera editor Peter Turner’s visit to Australia in 1977Gaskins, Bill 'PHOTOGRAPHY IN AUSTRALIA’. The British Journal of Photography, Mar 10, 1978; 125 he met Jean-Marc Le Pechoux and significantly, Max Dupain’s The Sunbaker was featured on the covers of both Light Vision and Creative Camera in 1978,Batchen, G. (1995). Max Dupain: Sunbakers. History of Photography, 19(4), 349-357. with Dupain himself contributing an essay in Light Vision issue 5.Online version of the 1978 essay originally published in Light Vision issue 5 provided by Gael Newton  Such exposure, and that of the young Bill Henson in two issuesLight Vision, Nos. 6-7, 1978. raised the profile of Australian photography in the UK. The magazine played a role in setting Australian photography and photographers in an international context and in publicising their work overseasSontag, Milar, Brohaugh, Carroll, Frobisch, Lamprecht, . . . The Nikon Manual. (1978). Photography. Communication Booknotes, 10(1), 16-19. in a quality publication."]}, {"page": "The Photographers' Gallery and Workshop", "response": ["Tony Perry, who reviewed shows there 1978-80, was complimentary of contributions by William Heimermann and the 'Photographers Gallery' to Australian Photography in his article 'Australia: looking for a photographic identity', No.25, Vol.5 No.1 as was Peter Turner's interview with Paul Cox in Light Vision.Light Vision No.2, pp 24-29."]}]}}