{"wiki_id": "http://www.wikidata.org/entity/Q7172571", "itemLabel": "Peter Ashby", "itemDescription": "English musician and composer,", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Ashby", "wikipedia_page": {"main": "Peter Ashby is an English musician and composer, and a founder member of the bands Frenzid Melon, Spasmodic Caress and the insane picnic, as well as co-founder of Falling A Records with Barry Lamb. He was the original bass player and composer in Spasmodic Caress and featured on the track \"Hit the Dead\", which appeared  on the Presage(s) 12' on 4AD Records in 1980, and also on all tracks of Hillside '79 and  Fragments of, both of which were released on Falling A Records. After leaving Spasmodic Caress, he became a multi-instrumentalist and composer in the insane picnic, playing on all of their releases. \nDuring his time with the insane picnic, and since the group disbanded, Ashby has pursued a solo career exploring many musical styles and genres, including avant-garde, experimental, industrial, psychedelic, jazz-rock, electronic, free jazz and progressive rock, the latter two styles being especially notable on his Disturbances in the Ether (Six Armed Man Records SAM8) release,  and has collaborated with such artists as Barry Lamb, Jasun Martz (playing drums, bass guitar, lead guitar and piano on his album The Pillory /The Battle), Hilda Garman, Wavis O'Shave and Tor Cesay.", "link_mentions": [{"page": "Leyton", "response": ["* Peter Ashby – New wave musician and composer, born in Leyton 1963"]}, {"page": "Barry Douglas Lamb", "response": ["Barry Lamb is an English composer, author and musician. He was born in South Shields, but lived in Holland-on-Sea during his secondary school years. He attended Clacton County High School where he first met his long time musical collaborator Peter Ashby. It was during his high school years that he formed Frenzid Melon with Ashby and they began experimenting with music inspired by the immediacy and DIY ethic of punk. Lamb also began making his own experimental music using simple tape manipulation techniques and they began to release their music on cassette. This marked the beginning of what has become known as cassette culture. During this period Ashby & Lamb founded Falling A Records,Record Collector Magazine Oct 2011 no 393 page 54 as one of the early cassette labels and later an independent record label.", "In 2007 he released an album of new material called ...this is which has received critical acclaim in the underground music network. Lamb's continued partnership with former insane picnic and Frenzid Melon member Peter Ashby continues to bear fruit as they work together. Other collaborations include Lamb playing saxophone on Peter Ashby's Disturbances in the ether album, working with up and coming urban hip hop artist Tor Cesay, collaborating with Keith Levene, being covered by Swiss chanteuse Hilda Garman and recording with Wavis O'Shave."]}, {"page": "Peter Ashby (musician)", "response": ["#REDIRECT Peter Ashby"]}, {"page": "Ashby (surname)", "response": ["*Peter Ashby, British musician and composer"]}, {"page": "Ashby, Peter", "response": ["#redirectPeter Ashby"]}]}}