{"wiki_id": "http://www.wikidata.org/entity/Q7173987", "itemLabel": "Peter Firmin", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Firmin", "wikipedia_page": {"main": "Peter Arthur Firmin (11 December 1928 – 1 July 2018) was an English artist and puppet maker. He was the founder of Smallfilms, along with Oliver Postgate. Between them they created a number of popular children's TV programmes, The Saga of Noggin the Nog,  Ivor the Engine, Clangers, Bagpuss and Pogles' Wood.", "link_mentions": [{"page": "Bagpuss", "response": ["Bagpuss is a British children's television series, made by Peter Firmin and Oliver Postgate through their company Smallfilms. The series of 13 episodes was first broadcast from Tuesday 12 February  to Tuesday 7 May 1974. The title character was \"a saggy, old cloth cat, baggy, and a bit loose at the seams\". Although only 13 episodes were made, it remains fondly remembered, and was frequently repeated in the UK until 1986.  In early 1999, Bagpuss topped a BBC poll for the UK's favourite children's television programme.", "Each programme began in the same way: through a series of sepia photographs, the viewer is told of a little girl named Emily (played by Emily Firmin, the daughter of illustrator Peter Firmin), who owned a shop. Emily found lost and broken things and displayed them in the window, so their owners could come and collect them; the shop did not sell anything.", "The scene is set at the turn of the 20th century, with Emily Firmin (Peter Firmin's daughter) playing the part of the Victorian child Emily.Postgate, Oliver (2000) Seeing Things-A Memoir  The first antique village vignette is a cropped image of Horrabridge taken in 1898, though nothing is known of the other photo of the children with the pram. The shop window was at the Firmin family home in Blean.", "Gabriel the Toad was the only character in the series who could move freely without the use of stop-frame animation. Scenes featuring him playing the banjo and singing would have taken quite a bit of time if filmed with the stop-frame method, so Peter Firmin created a mechanism that helped him control Gabriel through a hole in his can. The character was based on a real toad that lived in the basement area of the flat that Peter and Joan rented in Twickenham beside the River Thames. Gabriel (named after Walter Gabriel in The Archers, a long-running British radio soap opera) was originally made for Firmin's live ITV programme The Musical Box. Postgate chose him to be one of the characters in Bagpuss and he was made into a new, slightly larger version."]}, {"page": "Harwich", "response": ["* Peter Firmin (1928- 2018) artist  IMDb Database retrieved January 2018 and puppet maker"]}, {"page": "Kent", "response": ["Blean near Canterbury was home to Smallfilms, the production company founded by Oliver Postgate and Peter Firmin and responsible for children's TV favourites Noggin the Nog, Ivor the Engine and Bagpuss."]}, {"page": "Stop motion", "response": ["Apart from their cutout animation series, British studio Smallfilms (Peter Firmin and Oliver Postgate) produced several stop motion series with puppets, beginning with Pingwings (1961-1965) featuring penguin-like birds knitted by Peter's wife Joan and filmed on their farm (where most of their productions were filmed in an unused barn). It was followed by Pogles' Wood (1965-1967), Clangers (1969-1972, 1974, revived in 2015), Bagpuss (1974) and Tottie: The Story of a Doll's House (1984)."]}, {"page": "Smallfilms", "response": ["Smallfilms is a British television production company that made animated TV programmes for children from 1959 until the 1980s. In 2014 the company began operating again, producing a new series of its most famous show, The Clangers.'Noggin rides again' The Guardian Arts 28 July 2014: interview with Peter Firmin by Julia Raeside. Daniel Postage (Oliver's son) and Peter Firmin working on the BBC remake as Smallfilms. It was originally a partnership between Oliver Postgate (who wrote the scripts, animated the characters, and voiced many of the characters) and Peter Firmin (who made the models of the characters and drew the artwork). Several very popular series of short films were made using stop-motion animation, including Clangers, Noggin the Nog and Ivor the Engine. Another Smallfilms production, Bagpuss, came top of a BBC poll to find the favourite British children's programme of the 20th century.", "He wrote Alexander the Mouse, a story about a mouse born to be king. Using an Irish-produced magnetic system—on which animated characters were magnetically attached to a painted background, then filmed using a 45 degree mirror—he persuaded Peter Firmin, who was then teaching at the Central School of Art, to create the painted backgrounds. Postgate later recalled that they broadcast around 26 of these programmes live-to-air, a task made harder by the production problems encountered by the use and restrictions of using magnets.", "In 2014, Daniel collaborated with Firmin on the production of a new series of Clangers, with Daniel writing many of the episodes.'Noggin rides again' An interview with Peter Firmin by Julia Raeside in The Guardian Arts 28 July 2014"]}, {"page": "Clangers", "response": ["The series was made by Smallfilms, the company set up by Oliver Postgate (who was the show's writer, animator and narrator) and Peter Firmin (who was its modelmaker and illustrator). Firmin designed the characters, and Joan Firmin, his wife knitted and \"dressed\" them. The music, often part of the story, was provided by Vernon Elliott.", "In 1969 (the year of NASA's first landing on the Moon), the BBC asked Smallfilms to produce a new series for colour television, but without specifying a storyline. Postgate concluded that as space exploration was topical the new series should take place in space (and, inspired by the real Moon Landing, Peter Firmin designed a set which strongly resembled the Moon). Postgate adapted the Moonmouse from the 1967 story, by simply removing its tail (\"because it kept getting into the soup\"). Hence the Clangers looked similar to mice (and, from their pink colour, pigs). They wore clothes reminiscent of Roman armour, \"against the space debris that kept falling onto the planet, lost from other places, such as television sets and bits of an Iron Chicken\". And they spoke in whistled language.", "Following the March 2015 special, a full series was commissioned for the summer of that year. The series was narrated by Michael Palin, and co-produced by Smallfilms with the involvement of Peter Firmin and Oliver Postgate's son, Dan. The series was directed by Chris Tichborne and Mole Hill, with music composed by John Du Prez. 52 11-minute episodes were commissioned. The voices of the Iron Chicken, the Soup Dragon, and the Baby Soup Dragon were by Dan Postgate."]}, {"page": "Oliver Postgate", "response": ["Richard Oliver Postgate (12 April 1925 – 8 December 2008), generally known as Oliver Postgate, was an English animator, puppeteer and writer.  He was the creator and writer of some of Britain's most popular children's television programmes. Bagpuss, Pingwings, Noggin the Nog, Ivor the Engine, Clangers and Pogles' Wood, were all made by Smallfilms, the company he set up with collaborator, artist and puppet maker Peter Firmin. The programmes were originally broadcast from the 1950s to the 1980s. In a 1999 BBC poll Bagpuss was voted the most popular children's television programme of all time.", "In 1957 he was appointed a stage manager with Associated-Rediffusion, which then held the ITV franchise for London. Attached to the children's programming section, he thought he could do better with the relatively low budgets of the then black and white television productions. Postgate wrote Alexander the Mouse, a story about a mouse born to be king. Using an Irish-produced magnetic system – on which animated characters were attached to a painted background, and then photographed through a 45-degree mirror – he persuaded Peter Firmin, who was then teaching at the Central School of Art, to create the background scenes. Postgate later recalled they undertook around 26 of these programmes live-to-air, which were made harder by the production problems encountered by the use and restrictions of using magnets.", "*Seeing Things: An Autobiography, Oliver Postgate; illustrated by Peter Firmin, 2000 – ; republished in 2009 – ", "* The Sagas of Noggin the Nog Oliver Postgate and Peter Firmin; illustrated by Peter Firmin, 2001 – "]}, {"page": "Nick Park", "response": ["Nick Park has stated that his main influences have been Ray Harryhausen, Oliver Postgate, Peter Firmin, Chuck Jones, Yuri Norstein, Richard Williams, Terry Gilliam, and Bob Godfrey. He is a Gerry Anderson fan."]}, {"page": "Noggin the Nog", "response": ["Noggin the Nog is a popular British children's character appearing in his own TV series (of the same name, originally broadcast 1959–1965 and 1982) and series of illustrated books (published 1965–1977), created by Oliver Postgate and Peter Firmin. The TV series is considered a cult classic from the golden age of British children's television. Noggin himself is a simple, kind and unassuming King of the Northmen in a roughly Viking-age setting, with various fantastic elements such as dragons, flying machines and talking birds.", "Peter Firmin is said to have come up with the name of Noggin after travelling on the London Underground and seeing Neasden station, which made him think \"Noggin\".'Noggin rides again' Arts Guardian 28 July 2014; An interview with Peter Firmin by Julia Raeside. Firmin also recalled how his children helped him name some of the characters (e.g., Nooka of the Nooks came from his daughter talking about the film Nanook of the North)", "Stories by Oliver Postgate, Pictures by Peter Firmin.", "Various Noggin short stories were also published, and a visitor in one of them, Noggin and the Moon Mouse, provided the basis for the characters in the popular Clangers TV series. All the books were written by Oliver Postgate, illustrated in full colour by Peter Firmin, and published by Kaye & Ward.", "Noggin has received an accolade achieved by very few Norse characters – he appeared with the Ice Dragon reading him a note from Nogbad, on a British commemorative postage stamp (SG1804) in January 1994. The art work for the stamp was drawn by Peter Firmin, who also produced a series of illustrations for the advertising campaign to publicize the new stamps. The stamp was one of a set of ten on the theme of \"messages\", featuring characters from British children's literature. All the characters were pictured holding a letter, note or message. Noggin's note reads: \"I, Nogbad 'the Bad' do hereby promise to be 'the Good'.\""]}, {"page": "Ivor the Engine", "response": ["Ivor the Engine is a British cutout animation television series created by Oliver Postgate and Peter Firmin's Smallfilms company. It follows the adventures of a small green steam locomotive who lives in the \"top left-hand corner of Wales\" and works for The Merioneth and Llantisilly Railway Traction Company Limited. His friends include Jones the Steam, Evans the Song and Dai Station, among many other characters.", "The series was written, animated and narrated by Oliver Postgate. Peter Firmin provided the artwork. The sound effects were endearingly low-tech, with the sound of Ivor's puffing made vocally by Postgate himself. The music was composed by Vernon Elliott and predominantly featured a solo bassoon, to reflect the three notes of Ivor's whistle."]}, {"page": "Basil Brush", "response": ["The original Basil Brush glove puppet was designed by Peter Firmin in 1963 for an ITV television series, and was voiced and performed by Ivan Owen until his death in October 2000.", "Basil first appeared on television in 1962, in a series called The Three Scampies, a story of an out-of-work circus act. The human was Howard Williams, Ivan Owen animated and voiced Basil and Wally Whyton animated and voiced Spike McPike, a very aggressive Scottish hedgehog also made by Peter Firmin."]}, {"page": "Decimal Day", "response": ["A substantial publicity campaign took place in the weeks before Decimal Day, including a song by Max Bygraves called \"Decimalisation\". The BBC broadcast a series of five minute programmes, titled \"Decimal Five\", to which The Scaffold contributed some specially written tunes. ITV repeatedly broadcast a short drama called Granny Gets The Point starring Doris Hare, in which an elderly woman who does not understand the new system is taught to use it by her grandson. At 10 am on 15 February and again the following week, BBC 1 broadcast 'New Money Day', a Merry-Go Round schools' programme in which puppet maker Peter Firmin and his small friend Muskit encountered different prices and new coins when they visited the shops."]}, {"page": "Cutout animation", "response": ["*Oliver Postgate and Peter Firmin's Smallfilms created and produced Alexander the Mouse (1957-1958, lost), Ivor the Engine (1959, 1975-1977) and Noggin the Nog (1959–1965, 1982). Their initial animation system used magnets on cutouts to move the figures around during real-time broadcasting."]}, {"page": "Pingwings", "response": ["Pingwings was an animated black-and-white children's television series, comprising 18 ten-minute episodes, broadcast in the United Kingdom on ITV in three series of six programmes each, between 1961 and 1965. It first aired on Southern Television. Created by Oliver Postgate and Peter Firmin of Smallfilms, it starred a family of penguin-like creatures who lived at the back of a barn on the fictional Berrydown Farm. The Pingwing characters were knitted by Firmin's wife Joan, and the animation was achieved using the stop motion technique.  ", "Some of the animated sequences were filmed in the open air. Such sequences were often intercut with live-action sequences, featuring Mr and Mrs Farmer and Gay the Goat. In this way the Pingwing family interacted with their neighbours on the farm. The series was in fact filmed partly \"on location\": since Peter Firmin and his wife lived in an old farmhouse, and the Smallfilms film studio was located in a disused barn adjacent to it, all the exteriors needed for the series were available literally on their doorstep.Filming Pingwings"]}, {"page": "Pogles' Wood", "response": ["The 32 episodes were filmed using stop-frame animation, in Peter Firmin's barn (not in a BBC television studio). All were made in black-and-white. The episodes were narrated by Oliver Postgate, who introduced the story (typically beginning each episode with the show's catchphrase, Now where shall we find the Pogles?) and also voiced several of the characters.", "Episodes of Pogles Wood, selected by its creators, were initially released on DVD in 2006 by the Dragons' Friendly Society (an organisation founded by Oliver Postgate and Peter Firmin). Subsequently, three further DVDs followed, again released by the Dragons' Friendly Society, including the final collection of 14 episodes, released in November 2015 under the title Pogles' End.", "* Peter Firmin"]}, {"page": "Alan Fletcher (graphic designer)", "response": ["He studied at the Hammersmith School of Art from 1949, then at the Central School of Art, where he studied under noted typographer Anthony Froshaug and befriended Colin Forbes, Terence Conran, David Hicks, Peter Firmin, Theo Crosby, Derek Birdsall and Ken Garland. After a year teaching English at Berlitz Language School in Barcelona, he returned to London to study at the Royal College of Art from 1953 to 1956, where he met Peter Blake, Joe Tilson, Len Deighton, Denis Bailey, David Gentleman and Dick Smith."]}, {"page": "Blean", "response": ["Blean's economy is closely tied to Canterbury and to a lesser extent, Whitstable.  In television entertainment Smallfilms operates here the production company that created the animated series Ivor the Engine, Bagpuss and the Clangers, at Peter Firmin's barn on the Blean farm. The bay window of Firmin's house was featured in the opening sequence of Bagpuss."]}, {"page": "Foxes in popular culture, films and literature", "response": ["* 1963, 1968, 2002, 2006 Peter Firmin's Basil Brush, British television sock-puppet"]}, {"page": "1974 in the United Kingdom", "response": ["* 12 February – BBC1 first broadcasts the children's television series Bagpuss, made by Peter Firmin and Oliver Postgate's Smallfilms in stop motion animation."]}, {"page": "1969 in the United Kingdom", "response": ["* 16 November – BBC One first aired the children's television series Clangers, made by Oliver Postgate and Peter Firmin's Smallfilms in stop motion animation."]}, {"page": "1959 in the United Kingdom", "response": ["*28 December – Associated-Rediffusion first airs the children's television series Ivor the Engine, made by Oliver Postgate and Peter Firmin's Smallfilms in stop motion animation using cardboard cut-outs."]}, {"page": "1928 in the United Kingdom", "response": ["**Peter Firmin, children's stop-motion animator (died 2018)"]}, {"page": "List of people from Kent", "response": ["*Peter Firmin (born 1928) – animator and co-creator of Basil Brush, Bagpuss and The Clangers"]}, {"page": "Babette Cole", "response": ["Cole was born on Jersey in the Channel Islands. She attended the Canterbury College of Art (now the University for the Creative Arts) and received first-class BA Honours. She worked on such children's programmes as Bagpuss (working with Oliver Postgate and Peter Firmin) and Jackanory for BBC television."]}, {"page": "Sam on Boffs' Island", "response": ["The scriptwriter for the series was children's author Michael Rosen. Smallfilms, the production company of Oliver Postgate and Peter Firmin, provided some still video sequences."]}, {"page": "Ivan Owen", "response": ["Owen had already developed expertise in puppet voices when he met Peter Firmin, Basil's designer, in the 1960s. He voiced Basil from his first appearance in 1963, which he modelled, it is reported, on that of Terry-Thomas. He also operated the puppet, although the only moving part of it was the mouth. As well as Basil Brush, he provided the voice for another well-known television puppet, the dog \"Fred Barker\". Basil Brush, who had made his first on-screen appearance in 1963, returned to star in his own show between 1968 and the 1980s."]}, {"page": "Tottie: The Story of a Doll's House", "response": ["One such \"faded\" VHS copy of the second series was restored to watchable condition by the Dragons' Friendly Society (an organisation founded by Oliver Postgate and Peter Firmin.)  The Society released the first series on DVD with individually-burned DVD-R copies of the second series offered for sale exclusively to buyers of the first series DVD.Tottie, the Story of a Dolls' House, Dragons' Friendly Society Accessed 24 March 2019", "Godden's publisher, Kaye Webb, founder of Puffin Books, did not see the point of the exercise either, asking \"Can you really make a film in which the real life adults not only say nothing but don't even move, whilst the dolls speak and come to life?\" If these hurdles were not enough, the BBC shied away from the directness of a film that showed on screen the destruction of a favourite character. Initial doubts were replaced with enthusiasm and Godden took part and persuaded her publisher, her literary agent and his family, as well as Peter Firmin and Oliver Postgate, to take on the roles of the real life characters. The film was bought by Goldcrest and sold to the BBC.", "*Peter Firmin: puppets and settings"]}, {"page": "Canterbury Heritage Museum", "response": ["The Rupert Bear Museum was opened in 2003 with a £500,000 Heritage Lottery Fund grant. The creator of Rupert Bear, Mary Tourtel, grew up and attended art school in Canterbury, and a 1921 first-edition Rupert annual was one of the exhibits. The Rupert Bear Museum involves activities for children on the themes of play, entertainment and education. It includes the Bagpuss and Clangers display with items from the original television shows, such as the Emily shop-window from the opening scene of Bagpuss, because its creators Peter Firmin and Oliver Postgate filmed the programmes at Firmin's house near Canterbury.", "Regular family interactive events were scheduled. In June 2008 there was a two-day celebration of the centenary of Ian Fleming's birth and of the James Bond films. In November 2008 there was a Rupert Bear Day, with the cartoon's new illustrator Stuart Trotter signing Rupert books. In July 2009 the museum celebrated the anniversary of Neil Armstrong's first moonwalk in 1969.  It was an interactive event with the public chatting to astronomers and an astrodome showing a 3D tour of night sky and Solar System. In 2009 the museum celebrated an exhibition and a 40th anniversary of the Clangers TV show with two interactive events which included meetings with Peter Firmin, the show's co-creator. Oliver Postgate, the other creator of Bagpuss and the Clangers, lived locally and died in 2008, but his creations were given to the museum during his lifetime."]}, {"page": "List of cultural icons of England", "response": ["* Smallfilms, the partnership of Oliver Postgate (1925–2008) and Peter Firmin (b. 1928), makers of: Noggin the Nog (BBC, 1959–1965); The Clangers (BBC, 1969–1974); and Bagpuss (BBC, 1974)."]}, {"page": "Jonny Trunk", "response": ["2014 saw the publication of \"The Art Of Smallfilms\", a book exploring the archives of Smallfilms and the world of Oliver Postgate and Peter Firmin. The book is the first to examine their work in minute detail. It was conceived and edited by Jonny Trunk and has a foreword by Stewart Lee."]}, {"page": "Hannah Firmin", "response": ["Firmin is the second daughter of Peter Firmin, co-creator with the late Oliver Postgate, of the children's television programmes  Pingwings, Pogles' Wood, Noggin the Nog, Ivor the Engine, Clangers and Bagpuss."]}, {"page": "1974 in British television", "response": ["*12 February – BBC2 first airs the children's television series Bagpuss, made by Peter Firmin and Oliver Postgate's Smallfilms in stop motion animation."]}, {"page": "The Seal of Neptune", "response": ["The Seal of Neptune is a children's programme created by Oliver Postgate and Peter Firmin, also known for their works Ivor the Engine and Clangers. It was broadcast on BBC Television in 1960. Its plot featured the adventures of a seahorse and a shrimp and was similar in animation style to Ivor the Engine and Noggin the Nog."]}, {"page": "Firmin", "response": ["* Hannah Firmin (born 1956), English illustrator, daughter of Peter Firmin", "* Peter Firmin (1926–2018), English artist and animator"]}, {"page": "List of dragons in literature", "response": ["* Oliver Postgate and Peter Firmin, The Ice Dragon (1962), one of the books in The Saga of Noggin the Nog: an ice dragon whom Noggin intends to fight, but instead helps.\"The Ice Dragon.\" nogginthenog.co.ukLater editions on Worldcat.org and Amazon.com"]}]}}