{"wiki_id": "http://www.wikidata.org/entity/Q7172824", "itemLabel": "Peter Bircumshaw", "itemDescription": "footballer (1938-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Bircumshaw", "wikipedia_page": {"main": "Peter Bircumshaw (29 August 1938 – June 2017) was a footballer who played as a left winger in the Football League for Notts County, Bradford City and Stockport County.Bircumshaw started his professional career with Notts County, where he scored 40 goals in 72 league games before he moved to Bradford City in 1962. He spent just one season at Valley Parade, but he finished as the club's joint top goal-scorer with seven league goals and four in the FA Cup, including a hat-trick in a 5–2 win over Oldham Athletic. He joined Stockport County before he moved into non-league football with Cambridge City.  He was with Cambridge City from February 1964 to January 1965. \nBircumshaw's brother Tony also played professional football.", "link_mentions": [{"page": "List of Bradford City A.F.C. seasons", "response": ["| style=\"text-align:left;\" | Peter BircumshawStan Harland"]}, {"page": "Tony Bircumshaw", "response": ["Bircumshaw was a product of the youth system at Notts County where his older brother Peter Bircumshaw was already a first team regular. Tony Bircumshaw made his Football League debut on 3 April 1961 for Notts County at Brentford and at 16 years and 54 days he set a record as the club's youngest player.M. Golesworthy, Soccer Who's Who, London: Robert Hale, 1964, p. 24 The record remains in place to date,G. & J. Rollin, Sky Sports Football Yearbook 2008–2009, London: Headline, 2008, p. 295 although he was outstripped for the all competitions record when Jermaine Pennant featured for the club in an FA Cup tie as a 15-year-old."]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Peter Bircumshaw||||1962–1963||27||7||"]}, {"page": "List of people from Mansfield", "response": ["*Peter Bircumshaw (born 1938), footballer, born in Mansfield"]}, {"page": "2017–18 in English football", "response": ["* June 2017: Peter Bircumshaw, 78, Notts County, Bradford City and Stockport County forward."]}, {"page": "Bircumshaw", "response": ["* Peter Bircumshaw (1938–2017), English footballer"]}, {"page": "Bircumshaw, Peter", "response": ["#redirectPeter Bircumshaw"]}]}}