{"wiki_id": "http://www.wikidata.org/entity/Q7175776", "itemLabel": "Peter McGarr", "itemDescription": "Composer and teacher", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_McGarr", "wikipedia_page": {"main": "Peter McGarr (born 28 May 1953) is an English classical composer and teacher, working in the English experimental tradition and inspired by Northern English landscape and culture.", "link_mentions": [{"page": "Audlem", "response": ["* Peter McGarr (born 1953), classical composer and teacher; he has written several pieces inspired by Audlem ('Audlem Sonatas', 'Night-time' and 'Mourning Gamelan'), as homage to his mother, who lived in the village when she was a child. Website of UK Composer Peter McGarr"]}, {"page": "Wang Wei (Tang dynasty)", "response": ["* The Wang River Sequence has been set for choir by UK composer Peter McGarr in his piece 'Beautiful Days'."]}, {"page": "List of 21st-century classical composers", "response": ["|Peter McGarr || 1953 ||  || British ||  ||"]}, {"page": "Cresswell, Northumberland", "response": ["Cresswell was the inspiration for 'Tidelines' by UK composer Peter McGarr a piece written for Gamelan at Fenham House."]}, {"page": "Spem in alium", "response": ["Spem in alium has inspired modern composers to write 40-part choral works; examples include Giles Swayne's The Silent Land (1998), Robert Hanson's And There Shall Be No Night There (2002), Jaakko Mäntyjärvi's Tentatio (2006), Peter McGarr's Love You Big as the Sky (2007) and Alec Roth's Earthrise (2009), which was commissioned by the UK choir Ex Cathedra for its 40th anniversary. A London-based choral festival, the Tallis Festival, which always includes a performance of Spem in alium, commissioned both Mäntyjärvi and McGarr."]}, {"page": "List of organ composers", "response": ["* Peter McGarr"]}, {"page": "Openshaw", "response": ["Composer Peter McGarr, born in 1953, lived in Openshaw for many years."]}, {"page": "Kinmel Bay", "response": ["Kinmel Bay was the inspiration for the piece 'Vanishing Games', music written for oboe quartet by composer Peter McGarr."]}, {"page": "Morecambe", "response": ["* Morecambe features in The Acoustics of Morecambe Bay, a music theatre piece by Peter McGarr which evokes the sound contrast between bay and town."]}, {"page": "Tallis Festival", "response": ["In 2007, another new 40-part work was commissioned, Love You Big as the Sky, from Mancunian composer Peter McGarr, which is subtitled a Lindisfarne Love Song and inspired by the island on the Northumbrian coast of England. The text is extensive and covers poems about Lindisfarne, and the detailed geography of the area, including ship wrecks and lighthouses.  It is also a love song and includes text taken from a valentine's day card as part of its inspiration.  The first performance of Love You Big as the Sky was broadcast in full on BBC Radio 3 as part of the Festival coverage.", "*Peter McGarr's website"]}, {"page": "Exmoor Singers of London Chamber Choir", "response": ["*Dreaming England (This Sceptr'd Isle) (2005) – Peter McGarr", "*Love You Big as the Sky (a Lindisfarne Love Song) (2007) – Peter McGarr (broadcast in full on BBC Radio 3)"]}, {"page": "Oboe quartet", "response": ["An Oboe quartet is a composition scored for oboe, violin, viola and basso. While the genre is not very common, Mozart wrote the most well known, his Oboe Quartet, K. 370. Other composers of oboe quartets include Johann Christian Bach, Josef Fiala, Franz Krommer, Colin Matthews and Peter McGarr. The oboe quartet form is often less preferable to composers than the standard string quartet, as indicated by the few compositions for this ensemble."]}, {"page": "Peter mcgarr", "response": ["#REDIRECT Peter McGarr "]}, {"page": "Manchester Academy (secondary school)", "response": ["* Peter McGarr, composer "]}, {"page": "Trevor Grimshaw", "response": ["He illustrated The Singing Street, a book of poems by Mike Harding, and executed limited edition lithographs for Christie's Contemporary Art. He also collborated with composer Peter McGarr in 'Echoes and Reflections' at Cornerhouse Gallery, Manchester and did the title slide images for the early BBC Great Railway Journeys of the World series. Artist Geoffrey Key described Grimshaw, a long time friend, as \"one of the most important graphic artists working in the north during the last half of the 20th century\"."]}, {"page": "McGarr", "response": ["*Peter McGarr (born 1953), English composer"]}, {"page": "Butterworth Prize for Composition", "response": ["* Peter McGarr"]}, {"page": "2013 in British music", "response": ["*Making Music Award: Dry Stone Walls of Yorkshire – Peter McGarr"]}, {"page": "McGarr, Peter", "response": ["#redirectPeter McGarr"]}]}}