{"wiki_id": "http://www.wikidata.org/entity/Q7173483", "itemLabel": "Peter Curran", "itemDescription": "Northern Irish writer, presenter, documentary maker and audiobook publisher", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Curran_(presenter)", "wikipedia_page": {"main": "Peter Curran is a publisher, radio producer, writer, documentary maker and broadcaster. He grew up in Belfast, the eldest of six children and worked on funfairs in the USA before moving to London, working as a carpenter then re-training as a BBC reporter. In 1992 he began DJing full-time for the London radio station BBC GLR. He co-founded audio publisher Talking Music in 2012, publishing books on Eminem, Jimi Hendrix, The Beatles, Glam rock, Acid house, Adele, The Clash and others, written and read by authors such as Charles Shaar Murray, Jane Bussmann and Barney Hoskyns. In 2018, he was commissioned by the Imperial War Museum/14-18 NOW to explore the role of Ireland's borderland communities in the First World War for The Art of Border Living, featuring BBC documentaries and commissioned short story podcasts from Irish authors. With co-writer Patrick Marber, Curran created Bunk Bed (radio programme), a series of bizarre late-night conversations recorded in beds and in the dark, featuring music, archive speech and occasional guests such as Cate Blanchett and Benjamin Zephaniah. First broadcast in April 2014 on BBC Radio 4, Series 9 was aired in January 2022 with guest Harry Shearer. In interviews, Curran describes himself as 'a failed drummer'", "link_mentions": [{"page": "The News Quiz", "response": ["* Peter Curran"]}, {"page": "Patrick Marber", "response": ["He co-writes Bunk Bed for BBC Radio 4, which he created with Peter Curran. It was first broadcast during April 2014, with the fifth series broadcast in 2018, with special guest Jane Horrocks."]}, {"page": "Loose Ends (radio programme)", "response": ["Loose Ends is a British radio programme originally broadcast on Saturday mornings, and then transmitted early Saturday evenings from 1998 by BBC Radio 4. It was hosted by Ned Sherrin until 2006 and has been hosted by Clive Anderson, Nikki Bedi and Peter Curran since 2007. The programme brings together guests, generally from the world of entertainment, in a mix of interviews, sets by comedians and musical sessions.", "When Sherrin became ill with a throat infection in late 2006, later diagnosed as throat cancer, Peter Curran stood in as presenter of Loose Ends with Patrick Kielty and Clive Anderson as guest presenters. Sherrin died of throat cancer on 1 October 2007. Clive Anderson became permanent replacement host in 2007."]}, {"page": "Peter Curran", "response": ["Peter Curran may refer to:", "*Peter Curran (director) (1924–1999), British film director and producer", "*Peter Curran (footballer) (born 1962), Australian rules footballer", "*Peter Curran (presenter), British radio producer, writer, documentary maker, broadcaster and publisher", "*Peter Curran (astronomer) (1977–2016), Irish astronomer"]}, {"page": "14–18 NOW", "response": ["*The Art of Border Living, Documentary maker Peter Curran explored the First World War through the borderland communities of Ireland in a BBC Radio project  live events and commissioned short-stories podcasts https://theartofborderliving.podbean.com/ from Kamila Shamsie and others.", "*Peter Curran"]}, {"page": "Bunk Bed (radio programme)", "response": ["Bunk Bed is a comedy radio programme on BBC Radio 4 hosted by Peter Curran and Patrick Marber. The programme features the hosts lying in bunk beds, discussing various topics. In some episodes, they are joined by a guest on the \"pull-out mattress\" - these have included Kathy Burke, Don Warrington, Cate Blanchett, Benjamin Zephaniah, Rhys Ifans, Jane Horrocks, Guy Garvey & Rachael Stirling."]}]}}