{"wiki_id": "http://www.wikidata.org/entity/Q7174734", "itemLabel": "Peter Horne", "itemDescription": "Scottish rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Horne", "wikipedia_page": {"main": "Peter Horne is a professional rugby union head coach for Ayrshire Bulls. He is a former Scotland international rugby union player; and at club level he previously played for Glasgow Warriors for over a decade. At the time of his retirement he was the club's most capped back.\n\n", "link_mentions": [{"page": "Fife", "response": ["* Peter Horne, rugby player"]}, {"page": "Glasgow Warriors", "response": ["*  Peter Horne: (2009–21) 182 caps", "*2014–15:  Josh Strauss,  Peter Horne,  Tommy Seymour  (3)"]}, {"page": "West of Scotland F.C.", "response": ["West of Scotland played in Premiership Division One in 2008–2009, 2009–2010, and 2010–2011. This marked a strong era for the club, with former players such as British and Irish Lion Gordon Bulloch electing to return to club, alongside brother Alan Bulloch, Rory Kerr, and former Glasgow professional Guy Perrett These 'stars' were augmented by a strong crop of West players including Robert Harley, Robert McAlpine, Murray McConell, all of whom progressed to professional rugby, as well as a selection of young Glasgow professional players, selected in the SRU draft (including Peter Horne, Jon Welsh, Richie Vernon, and Richie Gray).", "* Peter Horne (20 Caps) 2013–"]}, {"page": "Bell Baxter High School", "response": ["* Peter Horne, Scotland rugby international, winner of the 2007 Schools Cup for Bell Baxter"]}, {"page": "List of Rugby World Cup try scorers", "response": ["*Peter Horne"]}, {"page": "Ian Keatley", "response": ["Keatley joined Scottish club Glasgow Warriors in January 2021 on a contract for the remainder of the 2020–21 season, providing fly-half cover for the injured Adam Hastings and Peter Horne. Keatley said of the move: \"This club is a top-quality outfit and I'm relishing the chance to be able to play alongside some of its top-quality talent.\"."]}, {"page": "Howe of Fife RFC", "response": ["* Peter Horne, Glasgow Warriors capped for  in 2013"]}, {"page": "List of Scotland national rugby union players", "response": ["|1043||HornePeter Horne||style=\"text-align:center; background:#A0D1F9;\"|Centre/Fly-half||2013-06-08||v Samoa at Durban"]}, {"page": "Russia at the Rugby World Cup", "response": ["|IC ||12||Peter Horne"]}, {"page": "Scotland national under-20 rugby union team", "response": ["*Peter Horne (Glasgow Warriors)", "*Peter Horne (West of Scotland)", "*Peter Horne (Howe of Fife)"]}, {"page": "2013 June rugby union tests", "response": ["|FH ||22||Peter Horne || || ", "|FH ||22||Peter Horne || ||  || "]}]}}