{"wiki_id": "http://www.wikidata.org/entity/Q7172956", "itemLabel": "Peter Brewis", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Brewis", "wikipedia_page": {"main": "Peter Brewis is a composer and instrumentalist who has been active in several spheres of music from ballet and modern dance to music theatre and rock music. Although he was classically trained, studying under the famous French music educator Nadia Boulanger, he has also written for comedy shows such as Spitting Image, for which he composed \"I've Never Met a Nice South African.\"", "link_mentions": [{"page": "The Wicker Man", "response": ["* Peter Brewis as Musician"]}, {"page": "The Young Ones (TV series)", "response": ["The theme over the end credits was written by Peter Brewis, who also created the incidental music on many episodes."]}, {"page": "Freddie Laker", "response": ["He was also the subject of a musical, Laker!, as performed at Not in Front of the Audience in 1982, and written by Mel Smith and Peter Brewis in reaction to Laker Airways' bankruptcy."]}, {"page": "Not the Nine O'Clock News", "response": ["The main writers included Colin Bostock-Smith, Andy Hamilton, Peter Brewis, Richard Curtis, and Clive Anderson.Cast list at IMDb.com. Retrieved 17 March 2007. However, the producers accepted scripts for sketches from a wide range of writers (including a then-undergraduate Stephen Fry),Fry, Stephen (2010). The Fry Chronicles. London: Penguin Group. p.180. ISBN  and ensured the programme remained topical by recording sketches only days before broadcast. Howard Goodall (subsequently composer of the theme music for Blackadder, Red Dwarf, and The Vicar of Dibley) was musical director. Bill Wilson directed the first three series, while Geoff Posner handled the fourth."]}, {"page": "The Tall Guy", "response": ["The score is by Peter Brewis. The soundtrack also includes Labi Siffre's \"It Must Be Love\", performed by Madness. The film features a montage in which various characters sing along to this song, and which includes a cameo by Madness frontman Suggs. Other tracks include \"Let the Heartaches Begin\" (Long John Baldry), \"Heartbreak Hotel\" (Sam Williams), \"Breaking Up Is Hard to Do\" and \"Crying in the Rain\" (both performed by Phil Pope)."]}, {"page": "The Two Ronnies", "response": ["The show was parodied twice by the Not the Nine O'Clock News team in 1982, with Mel Smith as Barker and Griff Rhys Jones as Corbett. One was as \"The Three Ronnies\", including footage of Ronald Reagan, at the time the President of the United States. The other controversially parodied them as \"The Two Ninnies\", a pastiche of their opening routine and a musical routine, using exaggerated innuendo, e.g. \"Oh vagina, oh vagina, over Chinatown!\"  Barker in particular was quite offended by this sketch while Corbett was reportedly amused by it.\"Ronnie Barker OBE – Comic Actor and Writer\" The latter sketch was written by John Lloyd and Nigel Planer, while the writer of the song was Peter Brewis, who also wrote songs for The Two Ronnies."]}, {"page": "Filthy Rich & Catflap", "response": ["Filthy Rich & Catflap is a BBC sitcom produced in 1986 and broadcast in 1987. The series featured former The Young Ones co-stars Nigel Planer, Rik Mayall, and Adrian Edmondson as its three title characters. It was written by Ben Elton (with additional material credited to Mayall), and produced and directed by Paul Jackson (who also directed The Young Ones), with film sequences directed by Ed Bye. The show's music was written by Peter Brewis. One series consisting of six half-hour episodes was produced. Despite the continuity announcer saying that the show would return the following year,https://thetvdb.com/series/filthy-rich-and-catflap only one series was ever made."]}, {"page": "Smith and Goody", "response": ["Smith and Goody is a children's sketch show on ITV from the 1980s. It was made for the ITV network by Thames Television. It starred, and was written by Mel Smith (at the time, part of the Not The Nine O'Clock News show on BBC2) and Bob Goody, with music provided by Peter Brewis. As well as being a comedy, the series had tried to advocate literature. It was set in a flat in which books, newspapers and magazines were in abundance and  the sketches were designed to encourage young people to enjoy reading."]}, {"page": "Magnet (band)", "response": ["Magnet was a band formed for the purpose of recording the soundtrack to the 1973 film The Wicker Man.  The band was assembled by musician Gary Carpenter (the film's associate musical director) to perform songs composed by New York songwriter Paul Giovanni.  Originally under the moniker Lodestone, later to changed to \"Magnet\" because of a conflict with another band, the group included Peter Brewis (recorders, jaw harp, harmonica, bass guitar, etc.), Michael Cole (concertina, harmonica, bassoon), Andrew Tompkins (guitars), Ian Cutler (violin), Bernard Murray (percussion) and finally Carpenter himself (piano, recorders, fife, ocarina, Nordic lyre, etc.).  Carpenter, Brewis and Cole had recently graduated from The Royal College of Music in London, and Tompkins, Cutler and Murray were all members of Carpenter's band Hocket.  The band featured Giovanni on guitar and vocals for many tracks; he also appeared in the film in various scenes.", "* Peter Brewis' website"]}, {"page": "I've Never Met a Nice South African", "response": ["\"I've Never Met a Nice South African\" is a satirical song originating in a sketch on the British television series Spitting Image (series 2, episode 5). It was written by John Lloyd and Peter Brewis and was sung by Andy Roberts. In 1986 it was commercially released as the B-side of the chart-topping \"The Chicken Song\".\"Spitting Image – The Chicken Song\" at Discogs. When the song was recorded, South Africa was still under the apartheid regime and widely considered to be a pariah state as a result."]}, {"page": "List of musicals by composer: A to L", "response": ["* Peter Brewis"]}, {"page": "Brewis", "response": ["*Peter Brewis, British composer and musician", "*Peter Brewis (British musician), member of the band Field Music"]}, {"page": "Bob Goody", "response": ["While Goody and Mel Smith were working on a two-man show at the Traverse Theatre, they teamed up with composer Peter Brewis and together created three black comedy musicals, 'Ave You 'Eard the One About Joey Baker?, Irony in Dorking which won a Fringe First Award and The Gambler whose 1986 revival at the Hampstead Theatre was nominated for an Olivier Award and was also recorded by the specialist musical theatre label First Night Records. He wrote the libretto for The Fashion, an opera for Deutsche Oper am Rhein, with music by Giorgio Battistelli. This was performed in the company's 2008 season. He co-wrote the BBC sitcom Wilderness Road as well as two volumes of performance poetry: Mixing With The Sharks and Life and Death And A Few Other Bits and Pieces."]}, {"page": "Brewis, Peter", "response": ["#redirectPeter Brewis"]}]}}