{"wiki_id": "http://www.wikidata.org/entity/Q7177665", "itemLabel": "Peter Weston", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Weston", "wikipedia_page": {"main": "Peter Weston (19 October 1943 – 5 January 2017) was a British science fiction fan from Birmingham, UK. \nWeston made many contributions in fan writing, fanzine editing, convention-running and in local science fiction clubs. His 1960s pseudonym \"Malcolm Edwards\" caused some confusion several years later, when a real Malcolm Edwards began contributing to British fanzines. They met in 1970. \nHe produced the first issue of the science fiction fanzine Zenith (later Speculation) in 1963 and he edited the Andromeda series of original anthologies from 1975 until 1977. In 2006, following the success of his Hugo-nominated memoir With Stars in My Eyes, Weston  relaunched his fanzine Prolapse (re-titled Relapse in 2009), after a 23-year hiatus. He was rewarded with a pair of Nova Awards the following year, for \"best fanzine\" and \"best fan\" (the latter being a committee award).\nAs well as organising a series of science fiction symposia in Birmingham inspired by Speculation, Weston co-founded the Birmingham Science Fiction Group (BSFG) in 1971 and helped originate the convention Novacon later that same year. He later chaired Seacon '79, the third Worldcon to be held in the UK, and in October 2008 ran Cytricon V at the George Hotel in Kettering, a sequel to and commemoration of the event at which the modern British Science Fiction Association was created. At the last, a surprise ceremony was held, inducting him and fellow science fiction fan Rog Peyton into the long-dormant \"fannish\" organisation the Knights of Saint Fantony.\nSince 1984, the Hugo Awards (modelled in the shape of rockets and presented at the annual Worldcon) have been cast by the car-parts factory which Weston owned and managed until he retired.", "link_mentions": [{"page": "Science fiction fandom", "response": ["* Peter Weston"]}, {"page": "List of science fiction editors", "response": ["* Peter Weston (1943–2017), UK, published the literary journal Speculation (launched as Zenith in 1963) and later edited the Andromeda original anthologies (1975–77)"]}, {"page": "List of Worldcons", "response": ["| Terry Pratchett (pro)William Tenn (pro)Jack Speer (fan)Peter Weston (fan)"]}, {"page": "Sutton Coldfield", "response": ["*Peter Weston (1944–2017) – British science fiction fan and winner of multiple Hugo Awards"]}, {"page": "Fortean Times", "response": ["In the mid-1960s, while Rickard was studying product design at Birmingham Art College, he met several like-minded science-fiction fans, particularly crediting fellow student Peter Weston's fan-produced Speculation magazine as helping him to \"[learn] the art of putting together a fanzine,\" some years before he created his own. Attending a science-fiction convention in 1968, Rickard obtained Ace paperback copies of all four of Fort's books from a stall run by Derek Stokes (later to run Dark They Were, and Golden-Eyed, and take a role in the day-to-day running of The Fortean Times)."]}, {"page": "List of people from Birmingham", "response": ["*Peter Weston – Influential British science fiction fan"]}, {"page": "62nd World Science Fiction Convention", "response": ["* Peter Weston (fan)"]}, {"page": "Eastercon", "response": ["|25||1974||Newcastle||Tynecon||Bob Shaw, Peter Weston||c415", "|53||2002||Jersey||Helicon 2||Brian Stableford, Harry Turtledove, Peter Weston||?"]}, {"page": "NESFA Press", "response": ["* With Stars in My Eyes: My Adventures in British Fandom, by Peter Weston", "* Peter Weston"]}, {"page": "Trans-Atlantic Fan Fund", "response": ["*\t1974\t<<\tPeter Weston\t"]}, {"page": "Malcolm Edwards", "response": ["Edwards was at one time highly active in science fiction fandom. When he first began contributing to British science fiction fanzines, he was initially confused with \"Malcolm Edwards\", a pseudonym used several years earlier by Peter Weston.a 1986 appreciation of Malcolm Edwards by David Langford He was Director of the Science Fiction Foundation for much of the two decades it was at the North East London Polytechnic. He also served as initial Chairman of the 45th World Science Fiction Convention. He was a Guest of Honour at Loncon 3, the 72nd World Science Fiction Convention, from 14 to 18 August 2014."]}, {"page": "56th World Science Fiction Convention", "response": ["Peter Weston"]}, {"page": "37th World Science Fiction Convention", "response": ["The convention committee was chaired by Peter Weston."]}, {"page": "Birmingham Science Fiction Group", "response": ["There were at least two previous versions of the Birmingham Science Fiction Group prior to the launch of the current incarnation in 1971 (many of those involved had been members of the 1960s fan scene, described in Peter Weston's hardback memoir With Stars in My Eyes).", "In January 1983, Peter Weston won the election for BSFG chair on a platform of re-engaging the Group with wider British fandom; parties were hosted at conventions and an amateur press association set up (APA-B, later known as The Organisation). The last of those projects detached within 18 months, but the BSFG still runs Novacon and has organised three one-off mini-conventions (the 10th Anniversary Con in 1981, Fifteencon in 1986 and Twentycon in 1991; the last was viewed as a financial disaster and the thirtieth anniversary was marked with a small post-meeting party). In the early 1980s, the BSFG was also involved with a media event, Filmcon, but eventually withdrew its support due to concerns over the organisation; Filmcon was cancelled.", "*Co-founder Peter Weston", "*1. Then #4 by Rob Hansen, 1988: \"Of more significance to fandom was that a fortnight later, on Friday 25 June [1971], the newly-reborn Birmingham SF Group held its inaugural meeting in the George Room of Birmingham's Imperial Hotel. [..] From the outset, the BSFG was intended to be more sercon than most groups with formal meetings and guest speakers. [..] The constitution of the new model BSFG was based on that of the Young Conservatives by Peter Weston and it was to this, many years later, that he attributed the group's endurance.\"", "*6. Checkpoint #21, 1972, review by editor Peter Roberts: \"Edited by Peter Weston, [..] Speculation is Britain's best known fanzine, five times a Hugo nominee and considered as the foremost magazine of serious SF criticism in the world.\"", "*With Stars in My Eyes:My Adventures in British Fandom by Peter Weston. Publ. Sep 2004 by NESFA Press. "]}, {"page": "Nova Awards", "response": ["*1973: Speculation #32, ed. Peter Weston", "*2007: Prolapse, ed. Peter Weston; Mark Plummer; Alison Scott", "*2008: Prolapse, ed. Peter Weston; Claire Brialey; Alison Scott"]}, {"page": "EFanzines", "response": ["Hundreds of British and American fanzines are now available to read or download for free, including Mike Glyer's long-running sf newsletter File 770 (six-time Hugo winner), Peter Weston's Nova-winning Prolapse (recently retitled Relapse), Bruce Gillespie's Hugo-nominated and Ditmar-winning critical journal SF Commentary and editions of the digital amateur press association e-APA."]}, {"page": "Ken Slater (science fiction)", "response": ["He was Guest of Honour at Brumcon, the 1959 EasterconSlater at Brumcon by Peter Weston and at Conspiracy '87, the 1987 Worldcon, jointly with his wife Joyce. He received the Doc Weir Award in 1966 and the Big Heart Award in 1995.Science Fiction Awards Watch » About the Big Heart Award At the first Hugo Award ceremony in Philadelphia in 1953, Forrest J Ackerman won the trophy for #1 Fan Personality, but said that the award should have gone to Slater.Obituary - British Science Fiction Association"]}, {"page": "An Infinite Summer", "response": ["\"An Infinite Summer\" was originally published in the anthology Andromeda 1 (1976, ed. Peter Weston, ). A time travel story, it was reprinted in later anthologies, such as Trips in Time (1977, ed. Robert Silverberg, ), and in translation. It was selected for The Best Science Fiction of the Year 6 by editor Terry Carr. Priest says that he interrupted the writing of his 1976 novel The Space Machine (\"somewhere in Chapter 13, to be precise\"), and chose to publish the story  separately \"because there was one strong feeling that would not fit in the novel: the sense that layers of time exist, that places do not change so much as people.\""]}, {"page": "Persoonia asperula", "response": ["Persoonia asperula was formally described in 1991 by Lawrie Johnson and Peter Weston from a specimen collected near the Back River and Wadbilliga National Park. The description was published in the journal Telopea. The specific epithet (asperula) is the diminutive form of the Latin word aspera meaning \"rough\", hence \"somewhat rough\", referring to the leaves."]}, {"page": "List of Worldcon Guests of Honor", "response": ["| Peter Weston"]}, {"page": "2017 in the United Kingdom", "response": ["**Peter Weston, 72, science fiction fanzine editor."]}, {"page": "Deaths in January 2017", "response": ["*Peter Weston, 72, British science fiction fanzine editor, cancer.Peter Weston (1944-2016)"]}, {"page": "Gastrolobium rigidum", "response": ["It was first described as Oxylobium rigidum by Charles Gardner in 1964. It was transferred to the genus, Gastrolobium in 1987 by  Michael Crisp and Peter Weston."]}, {"page": "Weston, Peter", "response": ["#redirectPeter Weston"]}]}}