{"wiki_id": "http://www.wikidata.org/entity/Q7174023", "itemLabel": "Peter Foley", "itemDescription": "Footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Foley", "wikipedia_page": {"main": "Peter Foley (born 10 September 1956 in Bicester, England) is a retired footballer. Born in England he went on to captain the Republic of Ireland at under-18 and under-21 level. He was selected to represent the Republic of Ireland at full international level, however injuries and a clash of fixtures with his club prevented him from doing so. After retirement he managed numerous semi-professional clubs around Oxfordshire and Berkshire.Peter is still active in football being a regular player and referee for the Bicester Fossils over 50's football club.", "link_mentions": [{"page": "Ray Houghton", "response": ["In May 1985, he made a guest appearance for Manchester United in Peter Foley's testimonial."]}, {"page": "Frank Worthington", "response": ["In 1984, Worthington made three guest appearances for Manchester United against the Australian national team, Nottingham Forest and Juventus on their post-season tour of Australia. He then made a further guest appearance for the club in May 1985 against an Oxford United XI for Peter Foley's testimonial."]}, {"page": "Workington A.F.C.", "response": ["The mid-1960s also saw Workington give a debut to one of the earliest black professional footballers in the Football League. This was Peter Foley, who played over 80 games for Workington as a forward and scored some 16 goals for the club, before moving on to Scunthorpe where he kept a young Kevin Keegan out of the team for a couple of years. Later, Foley became an ambassador for racial equality in football, being awarded an O.B.E. from the Queen for his work.", "*Peter Foley – Oct 1978 to Jan 1979"]}, {"page": "Didcot Town F.C.", "response": ["*  Peter Foley"]}, {"page": "List of Oxford United F.C. seasons", "response": ["|align=left|Peter Foley", "|align=left|Peter Foley"]}, {"page": "List of foreign football players in Hong Kong First Division League", "response": ["*Peter Foley - Bulova SA"]}, {"page": "1990 Football League Second Division play-off Final", "response": ["Swindon Town faced Blackburn Rovers in the other play-off semi-final and the first leg was played at Ewood Park in Blackburn on 13 May 1990.  The visitors took the lead after half an hour as Steve White from an David Kerslake break.  Swindon dominated the match and Peter Foley doubled their lead in the 55th minute with a volley from at least .  Andy Kennedy scored a consolation goal in the 73rd minute as the match ended 2–1 to Swindon.  The second leg of the semi-final took place at the County Ground three days later.  A weak backpass from Blackburn defender David Mail allowed Duncan Shearer to intercept and score, making it 3–1 on aggregate to the home side.  Minutes later, Shearer then went clear down the left wing and his pass was converted by White from close range.  Midway through the second half, Howard Gayle's  strike was deflected by Ross MacLaren past Fraser Digby in the Swindon goal to make it 2–1 on the day, but Swindon progressed to the final with a 4–2 aggregate win."]}, {"page": "List of Malawian writers", "response": ["*Peter Foley (b. 1988),author, editor,journalist and language teacher"]}]}}