{"wiki_id": "http://www.wikidata.org/entity/Q7177733", "itemLabel": "Peter Willis", "itemDescription": "English football referee (born 1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Willis", "wikipedia_page": {"main": "Peter N. Willis (26 October 1937 – 20 July 2021) was an English association football referee, who operated in the Football League. He originated from Newfield, near Bishop Auckland, County Durham, and lived in Meadowfield. His other occupation was as a police officer.", "link_mentions": [{"page": "Meadowfield", "response": ["*Peter Willis"]}, {"page": "FA Cup Final referees", "response": ["|1985||Peter Willis||Terry HolbrookD. Keen||J. Harris"]}, {"page": "Terry Holbrook", "response": ["He became a Football League linesman in 1980 and two years later graduated to the referees' List. He was senior linesman to Peter Willis in the 1985 FA Cup Final between Manchester United and Everton.FA Cup Final 1985: soccerbase.com website."]}, {"page": "Wendy Toms", "response": ["Two years after her debut in that league, and having 'run the line' for referee Steve Dunn during Leeds United's 4–3 Premiership away win at Coventry City on 11 September 1999,Match details, Coventry v. Leeds, 1999: soccerbase.com website. she was roundly criticised by the then Coventry manager, Gordon Strachan, who said in an interview with The Independent newspaper: \"We are getting PC decisions about promoting ladies. It does not matter if they are ladies, men or Alsatian dogs. If they are not good enough to run the line they should not get the job. Saturday's was the worst assistant refereeing decision I have seen this season by far and I've said that in my report. The fourth Leeds goal was offside by at least four yards and there were numerous other bad decisions in the game. My message is don't be politically correct and promote people just for the sake of it.\" However, the president of the Referees' Association at the time, Peter Willis, replied: \"She's a very good official...I think the situation is very sad. As a manager of a football club, Strachan is responsible for his players and he is entitled to his opinion on the performance of the officials, but to talk about the sex of the official is irrelevant.\"Gordon Strachan's criticism of Toms, also FIFA status confirmation: article at The Independent website, via the FindArticles service."]}, {"page": "2000 FA Charity Shield", "response": ["Ferguson argued that Riley had created the incident that saw Keane sent off for his tackle on Poyet: \"The referee waited too long to act. There were a lot of players going in hard right throughout the game. You have to be fair to both camps and we were just waiting to see how long he (Riley) was going to leave it. It is a showpiece occasion but if someone commits a yellow card offence, the appropriate action should be taken.\" Hasselbaink apologised to Keane and said he had made an error in the earlier tackle. The Referees' Association president Peter Willis expressed concern that the Premier League will become \"a bloodbath\" if there was continued scrutiny of \"officials' performances\":  \"All of us accept that football is an emotional game, we can make errors of judgement in challenges but there was no misinterpretation of what happened yesterday and I don't think Sir Alex Ferguson can argue against that.\""]}, {"page": "1984–85 Manchester United F.C. season", "response": ["An uneventful final came to life 12 minutes from time when, with the score goalless, Kevin Moran was dismissed by referee Peter Willis for a 'professional foul' on Peter Reid – the first ever sending-off in an FA Cup final. United's ten men held on to force extra time, where they found extra reserves of energy and won the trophy thanks to Whiteside's brilliant curling effort in the 110th minute."]}, {"page": "Spennymoor Grammar School", "response": ["* Peter Willis, former association football refereeMain reference for much of the information: article at Darlington and Stockton Times website."]}, {"page": "2021 in the United Kingdom", "response": ["**Peter Willis, journalist and newspaper editor (Sunday Mirror, The Sunday People).", "**Peter Willis, English football referee (b. 1937)."]}, {"page": "Deaths in July 2021", "response": ["*Peter Willis, 83, English football referee.Former FA Cup final referee Peter Willis dies aged 83"]}, {"page": "Willis, Peter", "response": ["#redirectPeter Willis"]}, {"page": "Peter Willis (disambiguation)", "response": ["Peter Willis (1937–2021) was an English football referee.", "Peter Willis may also refer to:", "*Peter Willis (journalist) (1966–2021), British journalist and newspaper editor"]}]}}