{"wiki_id": "http://www.wikidata.org/entity/Q7179026", "itemLabel": "Petronella Wyatt", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Petronella_Wyatt", "wikipedia_page": {"main": "Petronella \"Petsy\" Aspasia Wyatt (born 6 May 1968) is a British journalist and author.", "link_mentions": [{"page": "The Spectator", "response": ["At this time the paper began jokingly to be referred to as the 'Sextator', owing to the number of sex scandals connected with the magazine during his editorship. These included an affair between columnist Rod Liddle and the magazine's receptionist, and Johnson's own affair with another columnist, Petronella Wyatt. Johnson at first denied the relationship, dismissing the allegations as \"an inverted pyramid of piffle\", but was sacked from the Shadow Cabinet in November 2004 when they turned out to be true. In the same year David Blunkett, the Home Secretary, resigned from the government after it emerged he had been having an affair with the publisher of The Spectator, Kimberly Quinn, and had fast-tracked her nanny's visa application."]}, {"page": "Non-denial denial", "response": ["Boris Johnson became the UK's prime minister in 2019. In November 2004, tabloids revealed that for four years he had been having an affair with Spectator columnist Petronella Wyatt, which resulted in two abortions, one paid for by Johnson. Johnson, who was then married with four children, labelled the stories as an \"inverted pyramid of piffle\"; however, the allegations were subsequently found to be true, and he was sacked from his roles as Conservative party vice-chairman and shadow arts minister. The use of the phrase \"inverted pyramid of piffle\" can be considered an example of a non-denial denial in that it does not categorically deny that an affair took place, though it does use language that seeks to undermine and reduce confidence in the truth of the story."]}, {"page": "Wyatt (surname)", "response": ["*Petronella Wyatt (born 1968), British journalist"]}, {"page": "List of people associated with University College London", "response": ["* Petronella Wyatt, writer, The Spectator"]}, {"page": "Norman Stone", "response": ["Stone was appointed in 1984 as Professor of Modern History at Oxford University, England. Stone's tenure at Oxford was not without controversy. Petronella Wyatt wrote that Stone \"loathed the place as petty and provincial, and for its adherence to the Marxist-determinist view of history.\" During his period at Oxford Stone gained a reputation for groping female students."]}, {"page": "Luisa Casati", "response": ["* The Hon. Pericles Plantagenet James Casati Wyatt (born 1963), became an owner and operator of water parks and recreational-vehicle camps in Arizona; half-brother to journalist Petronella Wyatt."]}, {"page": "Robert Boothby, Baron Boothby", "response": ["Boothby had a colourful, if reasonably discreet, private life, mainly because the press refused to print what they knew of him, or were prevented from doing so. Woodrow Wyatt, whose reliability has been questioned,David Sexton, \"Don't believe all those diary droolings\", Evening Standard (12 October 1998), A 11: \"Robert Rhodes James, the editor of Chips Channon's entertaining diaries, advised caution in believing them. 'Even if the diarist is not attempting to give a deliberately false version, a talented writer can easily over-dramatise...' There is plenty of internal evidence that Wyatt should be approached with a similar caution.\"Stephen Lomax, Valentine Low, \"Did he drool? What a horrible thought\", Evening Standard (19 October 1998), p. 15.Petronella Wyatt, \"All of a tremble\", The Spectator (31 October 1998), p. 71. claimed after the death of Queen Elizabeth the Queen Mother that she had confided to him in an interview in 1991 that \"The press knew all about it\", referring to Boothby's affairs, and that she had described Boothby as \"a bounder but not a cad\".Cullen, Pamela V., A Stranger in Blood: The Case Files on Dr John Bodkin Adams, London, Elliott & Thompson, 2006,  pp. 617–18"]}, {"page": "St Paul's Girls' School", "response": ["* Petronella Wyatt – journalist"]}, {"page": "Woodrow Wyatt", "response": ["In 2000, the journalist Petronella Wyatt, his daughter by his fourth marriage, published a book entitled Father, Dear Father: Life with Woodrow Wyatt."]}, {"page": "Hungarians in the United Kingdom", "response": ["* Petronella Wyatt – journalist"]}, {"page": "Francis Hastings, 16th Earl of Huntingdon", "response": ["** Hon. Pericles Plantagenet James Casati Wyatt (born 1963), became an owner and operator of water parks and recreational vehicle camps in Arizona; half-brother to journalist Petronella Wyatt."]}, {"page": "Boris Johnson", "response": ["In November 2004, tabloids revealed that since 2000 Johnson had been having an affair with Spectator columnist Petronella Wyatt, resulting in two terminated pregnancies. Johnson initially called the claims \"piffle\". After the allegations were proven, Howard asked Johnson to resign as vice-chairman and shadow arts minister for publicly lying; when Johnson refused, Howard dismissed him from those positions.  In July 2005, Who's the Daddy?, a play by The Spectators theatre critics Toby Young and Lloyd Evans being performed at Islington's King's Head Theatre, satirised the scandal.", "Between 2000 and 2004, Johnson had an affair with Spectator columnist Petronella Wyatt when he was its editor, resulting in a terminated pregnancy and a miscarriage. In April 2006, the News of the World alleged that Johnson was having an affair with Guardian journalist Anna Fazackerley. The pair did not comment and shortly afterwards Johnson employed Fazackerley."]}, {"page": "List of Question Time episodes", "response": ["|Francis Maude, John Reid, Matthew Taylor, Petronella Wyatt, Carl Chinn", "|Theresa May, Bill Morris, Mark Oaten, Chris Smith, Petronella Wyatt"]}, {"page": "Petronella", "response": ["*Petronella Wyatt (born 1968), British journalist and author"]}, {"page": "Petsy Wyatt", "response": ["#REDIRECT Petronella Wyatt"]}, {"page": "Peston (TV programme)", "response": ["| | Nicky Morgan, Len McCluskey and Petronella Wyatt with Ed Davey, Catherine West and John Whittingdale"]}]}}