{"wiki_id": "http://www.wikidata.org/entity/Q7184345", "itemLabel": "Philip Sansom", "itemDescription": "British conscientious objector (1916-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Sansom", "wikipedia_page": {"main": "Philip Richard Sansom (19 September 1916 – 24 October 1999) was a British anarchist writer and activist.Sansom began working life as a commercial artist. During the Second World War he was a conscientious objector, and worked in farming for a while. From 1943 he worked on War Commentary, a wartime substitute for the anarchist paper Freedom. With his co-editors Vernon Richards and John Hewetson, he was tried at the Old Bailey in 1945 and imprisoned for nine months for conspiring to publish an article allegedly inciting soldiers to disaffect from their duty or allegiance. He was a charismatic orator at Speakers' Corner, Hyde Park, and elsewhere in the 1950s and 1960s.", "link_mentions": [{"page": "Freedom (British newspaper)", "response": ["In 1944, Richards, his wife Marie-Louise Berneri and two others associated with the paper (Philip Sansom and John Hewetson) were charged with conspiring to cause disaffection among members of the armed forces. Despite a defence campaign backed by the likes of George Orwell, Michael Tippett, T. S. Eliot and Benjamin Britten, Vernon, Sansom and Hewetson were convicted and served nine months in jail.Colin Ward's article on Vernon Richards in the UK Guardian"]}, {"page": "Freedom Press", "response": ["War Commentary was published with an overtly anti-militarist message, co-operating heavily with the pacifist movement, and in November 1944 the homes of several collective members were raided along with the offices of the press itself. When Richards, Marie-Louise Berneri, John Hewetson and Philip Sansom were arrested at the beginning of 1945 for attempting \"to undermine the affections of members of His Majesty's Forces,\"George Orwell at Home pp 71-72 Freedom Press (1998)  Benjamin Britten, E. M. Forster, Augustus John, George Orwell, Herbert Read (chairman), Osbert Sitwell and George Woodcock set up the Freedom Defence Committee to \"uphold the essential liberty of individuals and organizations, and to defend those who are persecuted for exercising their rights to freedom of speech, writing and action.\"Orwell, Sonia and Angus, Ian (eds.). The Collected Essays, Journalism and Letters of George Orwell Volume 4: In Front of Your Nose (1945-1950) (Penguin)", "Over the years the Freedom editorial group has included Jack Robinson, Pete Turner, Colin Ward, Nicolas Walter, Alan Albon, John Rety, Nino Staffa, Dave Mansell, Gillian Fleming, Mary Canipa, Philip Sansom, Arthur Moyse,John Lawrence and many others. Clifford Harper maintained a loose association for 30 years.", "* 1940s-1969 Philip Sansom"]}, {"page": "Colin Ward", "response": ["Ward was born in Wanstead, Essex. He became an anarchist while in the British Army during World War II.  As a subscriber to War Commentary, the war-time equivalent of Freedom, he was called in 1945 from Orkney, where he was serving, to give evidence at the London trial of the editors for publishing an article allegedly intended to seduce soldiers from their duty or allegiance. Ward robustly repudiated any seduction, but the three editors (Philip Sansom, Vernon Richards and John Hewetson) were convicted and sentenced to nine months imprisonment."]}, {"page": "Speakers' Corner", "response": ["* Philip Sansom (1947–ca.1978)", "* Speakers' Corner – an anthology (1977) Edited by Jim Huggon. With a foreword by Philip Sansom."]}, {"page": "Donald Rooum", "response": ["In 1952, Philip Sansom invited Rooum to draw a regular cartoon strip for The Syndicalist and he contributed Scissor Bill. The name derived from an IWW name for a bosses' yes-man. From 1960, his cartoons started appearing in such outlets as  She, The Daily Mirror, Private Eye and The Spectator. Rooum has had a long relationship, with interruptions, with Peace News, his first work appearing for them in 1962. Originals of his cartoons for Peace News up to 1971, together with some for The Spectator, are stored at the British Cartoon Archive."]}, {"page": "Anarchism in the United Kingdom", "response": ["Over the years the Freedom editorial group included Jack Robinson, Pete Turner, Colin Ward, Nicolas Walter, Alan Albon, John Rety, Nino Staffa, Dave Mansell, Gillian Fleming, Mary Canipa, Philip Sansom, Arthur Moyse and numerous others. Clifford Harper maintained a loose association for 30 years."]}, {"page": "Freedom Defence Committee", "response": ["The Committee came into being as a result of Freedom Press and five private houses being raided by police on 12 December 1944, and three editors of War Commentary, Vernon Richards,George Orwell at Home pp 71-72 Freedom Press (1998), Philip Sansom and John Hewetson being prosecuted at the beginning of 1945 for conspiring \"to undermine the affections of members of His Majesty's Forces\" and because the National Council for Civil Liberties was considered a Communist front."]}, {"page": "George Orwell bibliography", "response": ["|Letter to the editor, protesting against the arrest of Philip Sansom, circulated to the press by the Freedom Defence Committee and signed by Orwell and 24 others. Published as \"'Cat and Mouse' Case\" in The Manchester Guardian (18 January 1946) p. 4 ; in Tribune No. 473 (18 January 1946) p. 13; in Peace News (18 January 1946) p. 4; as \"The Sansom Case\" in The Daily Herald (21 January 1946) p. 2; in The New Leader (26 January 1946) p. 7; in Freedom – Through Anarchism (26 January 1946) p. 1; as \"Cat and Mouse Treatment\" in the Freedom Defence Committee Bulletin No. 2 (February–March 1946) p. 2."]}, {"page": "Sansom", "response": ["*Philip Sansom (1916–1999), British writer and anarchist"]}, {"page": "John Olday", "response": [" and produced, along with the English anti-militarist broadsheet, Forces Newsletter, in a small studio shared with Philip Sansom."]}, {"page": "Wildcat (anarchist newspaper)", "response": ["The first edition of Wildcat included a supplement themed around disaffection, mutiny, and desertion in the British Armed Forces. The supplement reprinted an \"Open Letter to British Soldiers\", originally published in 1912 by The Syndicalist. The supplement also ran an article by the conscientious objector Philip Sansom who reflected on his imprisonment for incitement to disaffection. In it Samson wrote, \"Soldiers are not supposed to think and it is a criminal offence to encourage them to do so.\"", "In 1974, Philip Sansom invited anarchist cartoonist and writer Donald Rooum  to provide a cartoon for Wildcat. Both the comic strip and its main character took adopted the name of the paper. Rooum recalled the creation of Wildcat's characters in an interview:There had to be some kind of female, and thinking about that, I decided to make the wildcat female, then I thought about the contrast between the anarchists that I knew. Some of them were, like Colin Ward, very anxious for anarchism to become intellectually respectable. Some were just the opposite and wanted to go around throwing things. I thought the cat could be the wild anarchist, and the free-range egghead could be the intellectual. So that's how it started.After Wildcat's closure, Sansom persuaded Rooum to revive the Wildcat comic strip in the anarchist newspaper Freedom where it featured until the publication ceased printing in 2014.", "* Philip Sansom (anarchist and conscientious objector)"]}]}}