{"wiki_id": "http://www.wikidata.org/entity/Q7183227", "itemLabel": "Philip Best", "itemDescription": "British musician and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Best", "wikipedia_page": {"main": "Philip Neil Best (born 15 June 1968) is an English industrial musician, visual artist, and author. A pioneer of power electronics, he formed the band Consumer Electronics in 1982 at age 14.Best joined the group Whitehouse, in 1983. After a nine-year hiatus starting in 1984, Best rejoined and remained with the group until departing again in 2008.", "link_mentions": [{"page": "Whitehouse (band)", "response": ["Philip Best joined the group in 1982 at the age of 14, after running away from home. He was a member on and off ever since."]}, {"page": "List of noise musicians", "response": ["*Philip Best"]}, {"page": "Dominick Fernow", "response": ["In his early work as Prurient, Fernow worked primarily with a microphone and amplifier, and sometimes drums. He eventually began utilizing more electronics, and currently works primarily with laptop and synthesizers. In the past, he collaborated with artists like John Wiese, Jeff Plummer (of Immaculate:Grotesque and Shallow Waters), Kris Lapke (of Alberich and MCMS), Wolf Eyes, Macronympha, and Philip Best (of Whitehouse and Consumer Electronics).Semtexinc.com  Dead Link"]}, {"page": "List of Durham University people", "response": ["* Philip Best – pioneer in power electronics"]}, {"page": "Mattin", "response": ["Mattin has collaborated with other artists including; Dion Workman, Taku Unami, Emma Hedditch, Margarida Garcia, Xabier Erkizia, Karin Schneider, Oren Ambarchi, Dean Roberts, Bruce Russell, Campbell Kneale, Tony Conrad, Taku Sugimoto, Matthew Bower, Philip Best, Drunkdriver, Ray Brassier, Junko and Jack Callahan."]}, {"page": "Graham Sutton (musician)", "response": ["Sutton has also been in demand as a live sound mixer, including working with Philip Best's Consumer Electronics, A Place to Bury Strangers and as a live sound consultant for These New Puritans."]}, {"page": "Bird Seed (album)", "response": ["*Philip Best – vocals, synthesizer"]}, {"page": "Ramleh (band)", "response": ["After releasing Hole in the Heart cassette and a few records under the Ramleh alias in 1987, Mundy reformed the band in 1989 with Philip Best. The reunion was followed by Grudge for Life LP in 1989. Inspired by Mundy's experimental rock band Skullflower, the band began to incorporate rock influences in their records, starting with Blowhole in 1991. After releasing Caught From Behind, a split with Italian artist M.T.T, and Crystal Revenge, the band added Skullflower members Anthony di Franco on bass and Stuart Dennison on drums to its line-up. The new line-up released Homeless in 1994. The band continued releasing rock records in late 1990s, which included Adieu, All You Judges and Be Careful What You Wish For in 1995, and Works III in 1996. After releasing Boeing, Mundy disbanded Ramleh for the second time.", "* Philip Best – vocals, keyboards, electronics (1989–1997, 2019)"]}, {"page": "Phillip Best", "response": ["#REDIRECT Philip Best"]}, {"page": "Be Careful What You Wish For (Ramleh album)", "response": ["Stewart Mason of AllMusic described the album as \"a remarkable slice of abstract drones by guitarist Gary Mundy, occasionally colored by Philip Best's barely audible, mantra-like vocals and Stuart Dennison's extremely minimal (often beat-free) drumming.\" He also stated that \"Those who think Nine Inch Nails are the ultimate sonic terrorists will be scared silly.\" Everett Jang Perdue of Trouser Press criticized the album for \"leaning too hard in a rock direction\" and described it as \"the band's blandest.\"", "* Philip Best – vocals, electronics"]}, {"page": "Asceticists 2006", "response": ["*Philip Best - vocals, synthesizers"]}, {"page": "Cruise (Whitehouse album)", "response": ["*Philip Best - vocals, synthesizer"]}, {"page": "Mummy and Daddy", "response": ["*Philip Best - synthesizers"]}, {"page": "Racket (album)", "response": ["*Philip Best - vocals, instruments, \"dirty word specialist\""]}, {"page": "Right to Kill", "response": ["* Philip Best – synthesizer"]}]}}