{"wiki_id": "http://www.wikidata.org/entity/Q7182013", "itemLabel": "Phil Holder", "itemDescription": "professional footballer (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Holder", "wikipedia_page": {"main": "Philip Holder (born 19 January 1952) is an English former association football player and manager. As player, he made more than 150 appearances in the Football League representing Tottenham Hotspur, Crystal Palace and AFC Bournemouth, and played in the North American Soccer League for the Memphis Rogues. As manager, he took charge of Brentford for three seasons.", "link_mentions": [{"page": "Marcus Gayle", "response": ["Born Hammersmith, London, Gayle started his career at Brentford in 1988, scoring 27 goals in 194 appearances for the Bees. He was loaned to KuPS in 1990, before becoming a regular player in the Brentford side under new manager Phil Holder in 1990–91, when the Bees qualified for the playoffs but lost to eventual promotion winners Tranmere Rovers in the semi finals. He played 33 games in the Third Division that season, scoring six goals. He was a key part in their Third Division title success for the 1991–92 season, scoring 6 goals in 38 games to give Brentford a place in the new First Division, as the old Second Division would be known from the start of the 1992–93 campaign due to the creation of the FA Premier League. The 1992–93 season looked as though it would be a successful one for the Bees, who entered the new year in 10th place and on the brink of the playoff zone, with all the talk at Griffin Park being about a second successive promotion and top division football for the first time since 1947. However, a collapse in the second half of the season saw the Bees relegated. Gayle initially remained loyal to the Bees, but on 24 March 1994 he linked up with his old Brentford striker partner Gary Blissett in a £250,000 move to Wimbledon, who were in the process of finishing a creditable sixth place in the Premier League. In May 2015, Gayle was inducted into the Brentford Hall of Fame."]}, {"page": "1992–93 in English football", "response": ["17 May 1993 – Six days after leaving Chelsea, David Webb is named as the new manager of Brentford, in place of Phil Holder after the West London club's relegation from Division One."]}, {"page": "Dean Holdsworth", "response": ["He was to prove himself as a prolific goalscorer for the \"Bees\", as the club moved from 13th in 1989–90 to the play-offs in 1990–91, before Holdsworth scored 38 goals in the Third Division championship winning season of 1991–92, in a fruitful partnership with Gary Blissett. For this achievement he was named on the PFA Team of the Year. Phil Holder was unable to keep him at Griffin Park following these exploits."]}, {"page": "1990–91 in English football", "response": ["23 December 1990 – The last matches before Christmas are played. Arsenal extend their unbeaten start to the season to 18 games with a goalless draw at Aston Villa, although Liverpool are still six points ahead of them and have a game in hand. QPR miss the chance to climb out of the relegation zone when Derby hold them to a 1–1 draw at the Baseball Ground. Leeds hold on to fifth place with a 1–0 win over Sunderland at Roker Park. Three players are sent off in a goalless draw between Leicester and Watford at Filbert Street. In the Third Division, Brentford boost their hopes of winning promotion in Phil Holder's first season in management by beating Wigan Athletic 1–0 at Griffin Park. In the Fourth Division, Carlisle United keep their playoff hopes alive with a 1–0 win over Blackpool, who are now 18th in the table."]}, {"page": "1991–92 in English football", "response": ["New manager Phil Holder guided Brentford to a surprise Third Division championship success, while Terry Cooper's Birmingham City occupied the runners-up spot. The play-offs were won by Chris Turner's Peterborough United.", "Phil Holder had a successful first season in management by winning the Third Division title with Brentford."]}, {"page": "John Buttigieg (footballer)", "response": ["Buttigieg began the 1989–90 season in an unfamiliar right back role and gradually fell out of the first team picture. The departure of Perryman as manager and his replacement Phil Holder's tactical change to a long ball game saw Buttigieg further frozen out and after being transfer-listed in November 1990, he was released in May 1991. Buttigieg made 47 appearances during his time at Griffin Park and the 20 caps he won for Malta during that period make him Brentford's most capped international player."]}, {"page": "Joe Allon", "response": ["The \"Bees\" were relegated out of the First Division at the end of the 1992–93 season under Phil Holder. He scored a total of 28 goals in 56 league and cup appearances at Griffin Park. He also had a brief spell on loan at Southend United in September 1993."]}, {"page": "Holder (surname)", "response": ["* Phil Holder (born 1952), English football manager and coach"]}]}}