{"wiki_id": "http://www.wikidata.org/entity/Q7182276", "itemLabel": "Phil Piratin", "itemDescription": "British politician (1907-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Piratin", "wikipedia_page": {"main": "Philip Piratin (15 May 1907 – 10 December 1995) was a member of the Communist Party of Great Britain (CPGB) and one of the four CPGB Members of Parliament during the first thirty years of its existence. (The others were Shapurji Saklatvala, Walton Newbold and Willie Gallacher.)", "link_mentions": [{"page": "Battle of Cable Street", "response": ["* Battle of George Square – a riot in Glasgow in 1919 in which William Gallacher (a colleague of Phil Piratin) was involved "]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Phil Piratin"]}, {"page": "Mile End", "response": ["There was a Mile End Parliament constituency from 1885 to 1950, which was notable for being one of two constituencies in the UK to elect a Communist Party MP Phil Piratin to the House of Commons between 1945 and 1950. The area now is covered by the Bethnal Green and Bow and Poplar and Limehouse constituencies."]}, {"page": "Bethnal Green and Bow (UK Parliament constituency)", "response": ["The borough of Tower Hamlets has a reputation for being a bastion of radical politics, historically with a minority of Communists on its council and more recently with Respect forming the largest opponents to the quite frequent large Labour majorities on the council level.  Before a recent revival, the Conservative Party were absent from the council from 1931 until 2006 – and all of its  revival has been in the two riverside wards which does not apply to any of this seat. The Liberal Party remained the main challengers to Labour in the Bethnal Green area but the loss of Percy Harris as Bethnal Green South West MP and eventually as London County Councillor too (despite a temporary comeback in 1946) put them out of the running in Parliamentary elections until a Liberal revival began in Bow in the late 1970s. Tower Hamlets was the only London Borough to have had seats held by the Communist Party of Great Britain; they lost their last seats in 1971. Between 1945 and 1950, Mile End provided the CPGB with one of its two parliamentary seats, being represented by Phil Piratin. Two Communists also won seats on the London County council (LCC) in 1947."]}, {"page": "List of United Kingdom MPs: P", "response": ["*Phil Piratin"]}, {"page": "Davenant Foundation School", "response": ["* Phil Piratin, Communist MP for Mile End from 1945–50"]}, {"page": "List of UK minor party and independent MPs elected", "response": ["| Phil Piratin"]}, {"page": "Philip Piratin", "response": ["#REDIRECT Phil Piratin"]}, {"page": "Mile End (UK Parliament constituency)", "response": ["In 1945, the seat became one of only two seats in that Parliament to have a Communist MP elected. Phil Piratin had been a local activist and borough councillor.", "| Phil Piratin"]}, {"page": "List of British Jewish politicians", "response": ["*Phil Piratin (1945–1950) Communist Party of Great Britain MP"]}, {"page": "List of atheists in politics and law", "response": ["* Phil Piratin (1907–1995): British member of the Communist Party of Great Britain (CPGB) and one of their few Members of Parliament.\"Mr. Piratin declined to take the oath, saying that he was an atheist, and elected to affirm.\" 'Former Communist M.P.'S Application Suspended Discharge From Bankruptcy', The Times, Saturday, Jul 12, 1952; pg. 3; Issue 52362; col C."]}, {"page": "Douglas Hyde (author)", "response": ["Hyde was sympathetic to the emergence of liberation theology, and was dismayed by Pope John Paul II's opposition to it. He became disillusioned with and distanced himself from the Catholic Church in the 1980s and 1990s, listing himself as an \"agnostic Christian\" on his last hospital admission form. He blocked the republication of his book I Believed, claiming it no longer represented his views. He was on good terms with several veterans of the Communist Party of Great Britain such as former MP Phil Piratin in the years before his death in 1996. Kevin Morgan, ‘Douglas Hyde (1911-1996), campaigner and journalist’ in Keith Gildart and David Howell, eds, Dictionary of Labour Biography, XIII, Palgrave Macmillan, 2010, p. 173. The Catholic Herald obituary noted that Hyde, a former assistant editor of the newspaper, \"ended his life no longer a practising Catholic, but with a renewed interest in Socialism\".Catholic Herald, 4 October 1996."]}, {"page": "List of political parties in the United Kingdom by representation", "response": ["|Willie Gallacher; Cecil L'Estrange Malone; Walton Newbold; Phil Piratin; Shapurji Saklatvala"]}, {"page": "Visa policy of the United Kingdom", "response": ["Although waiving visas or visa charges for United States citizens was discussed as early as 1930, such visas would remain until 1948, when the UK abolished such visas and the US waived visa fees and doubled visa lengths for UK citizens, albeit stopping short at full visa abolition due to domestic considerations; MP Phil Piratin was denied a visa."]}, {"page": "Communist Party of Great Britain", "response": ["In the 1935 general election Willie Gallacher was elected as the Communist Party's first MP in six years, and their first MP elected against Labour opposition. Gallacher sat for West Fife in Scotland, a coal mining region in which it had considerable support. During the 1930s the CPGB opposed the Conservative government's policy of appeasement towards Nazi Germany and Fascist Italy. On the streets the party members played a leading role in the struggle against the British Union of Fascists, led by Sir Oswald Mosley whose Blackshirts tried to emulate the Nazis in anti-Semitic actions in London and other major British cities.According to Joe Jacobs, the party centre tried to stop its members taking part in the defence of Cable Street from the Blackshirts, such that they had to operate under the cover of the 'Ex-Servicemen's Association', and on the day, the party put out a leaflet for another demonstration in Trafalgar Square to draw members away from the East End. Joe Jacobs, Out of the Ghetto, London: Phoenix Books, 1991, p. 238. However, Phil Piratin's personal account suggests the opposite, i.e. the central role of the Communist Party leadership to the anti-fascist actions against the BUF. Phil Piratin, Our Flag stays Red, Lawrence & Wishart, 2006.", "In the 1945 general election, the Communist Party received 103,000 votes, and two Communists were elected as members of parliament: Willie Gallacher was returned, and Phil Piratin was newly electedA.J. Davies, To Build A New Jerusalem. London: Abacus, 1996, p. 179. as the MP for Mile End in London's East End. Harry Pollitt failed by only 972 votes to take the Rhondda East constituency. Both Communist MPs, however, lost their seats at the 1950 general election. The Party was keen to demonstrate its loyalty to Britain's industrial competitiveness as a stepping point towards socialism. At the 19th Congress, Harry Pollitt asked rhetorically, \"why do we need to increase production?\" He answered: \"to pay for what we are compelled to import. To retain our independence as a nation.\"Nineteenth Congress of the Communist Party of Great Britain, Conference Report, February 1947, p. 18", "* Phil Piratin", "* Kevin Marsh and Robert Griffiths, Granite and Honey: the Story of Phil Piratin, Communist MP. Manifesto Press, 2012.", "* Phil Piratin, Our Flag Stays Red. London: Thames Publications, 1948; London: Lawrence and Wishart, 1978–2006."]}, {"page": "Jewish left", "response": ["At the end of the Second World War, the Labour Party entered government again, and several newly elected Labour MPs were Jewish, and often on the socialist left of the Party, radicalised by incidents like the Battle of Cable Street. Those MPs included Herschel Lewis Austin, Maurice Edelman, and Ian Mikardo, as well as Phil Piratin, one of only four MPs in British history to have represented the Communist Party of Great Britain. Several MPs elected in the 1940s and 1950s went on to be Ministers in Harold Wilson's governments of the 1960s and 1970s: The Lord Barnett, Edmund Dell, John Diamond, Reg Freeson, The Baroness Gaitskell, Myer Galpern, Gerald Kaufman, The Lord Lever of Manchester, Paul Rose, The Lord Segal, The Baroness Serota, The Lord Sheldon, John and Samuel Silkin, Barnett Stross, and David Weitzman. A prominent Jewish Labour politician in this era was Leo Abse, who put forward the private members' bill which decriminalised homosexuality and reformed the divorce laws in Britain. Robert Maxwell, a Labour MP during the 1964–66 Wilson government, eventually became a leading newspaper publisher when his holding company purchased Mirror Group Newspapers in 1984."]}, {"page": "Anti-fascism", "response": ["There were debates within the anti-fascist movement over tactics. While many East End ex-servicemen participated in violence against fascists, Communist Party leader Phil Piratin denounced these tactics and instead called for large demonstrations.Phil Piratin Our Flag Stays Red. London: Lawrence & Wishart, 2006. In addition to the militant anti-fascist movement, there was a smaller current of liberal anti-fascism in Britain; Sir Ernest Barker, for example, was a notable English liberal anti-fascist in the 1930s.Andrezj Olechnowicz, 'Liberal anti-fascism in the 1930s the case of Sir Ernest Barker', Albion 36, 2005, pp. 636–60"]}, {"page": "Max Levitas", "response": ["The communists' other main campaign in the East End in the 1930s was against unfair rents. In 1939, Levitas led a four-month rent strike at Brady Street Mansions, where he lived, as did his grandmother. Through this, he met his future wife, Sadie Freedman. He continued to work in the garment trade, serving as a shop steward for the Tailors' and Garment Workers' Union. During World War II, he served as a fire warden. With Phil Piratin, he organised an occupation of the bomb shelter at the Savoy Hotel, in protest at the lack of such shelters in the East End; a few days later, the government agreed to open underground stations as bomb shelters."]}, {"page": "Deaths in December 1995", "response": ["*Phil Piratin, 88, British MP and member of the Communist Party of Great Britain."]}, {"page": "Bertha Sokoloff", "response": ["Sokoloff was a branch secretary at Stepney Borough Council before marrying fellow Young Communist Stan Sokoloff in 1940. In 1943, she took up war work in a factory where she was made productivity officer. Bertha was key in preparing for the 1945 general and municipal elections in the Communist Party of Great Britain (CPGB), and was the agent for Communist Member of Parliament Phil Piratin in 1945 who became elected as a councillor that year."]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Phil Piratin"]}, {"page": "List of Communist Party MPs (UK)", "response": ["| Phil Piratin"]}]}}