{"wiki_id": "http://www.wikidata.org/entity/Q7181645", "itemLabel": "Phil Airey", "itemDescription": "English footballer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Airey", "wikipedia_page": {"main": "Philip Airey (born 14 November 1991), known as Phil Airey, is a retired English footballer, who played as a striker. Airey has played for Premier League club Newcastle United, Scottish Premier League club Hibernian, Blyth Spartans and a spell on loan at Whitley Bay.[Red Row Welfare].", "link_mentions": [{"page": "Airey", "response": ["* Phil Airey (born 1991), English footballer, Newcastle United"]}, {"page": "2010–11 Newcastle United F.C. season", "response": ["|align=\"left\"|38||align=\"left\"|FW||align=\"left\"| Phil Airey"]}, {"page": "2010–11 Premier Reserve League", "response": ["|align=\"left\"| Phil Airey"]}, {"page": "Philip Airey", "response": ["#REDIRECT Phil Airey"]}, {"page": "2011–12 Newcastle United F.C. season", "response": ["*11 August 2011: Defender James Tavernier joins Carlisle United on an initial one-month loan deal and striker Phil Airey joins Hibernian on a six-month loan deal.", "|  Phil Airey", "|  Phil Airey"]}, {"page": "2011–12 Hibernian F.C. season", "response": ["Hibs announced on 29 April that 10 players would be released at the end of their contracts, including loan signing Darryl Duffy. The first two signings of the summer by Hibs were to bring back former heroes Ivan Sproule and Garry O'Connor. This move was questioned by former manager John Hughes, who asked whether they would show the sharpness necessary in their attacking positions. After O'Connor scored a match-winning goal early in the season, however, The Scotsman football writer Stuart Bathgate questioned this logic. After a week in which Hibs signed Isaiah Osbourne and Phil Airey, manager Colin Calderwood commented that he was still looking for more additions to the squad.", "| Phil Airey"]}, {"page": "2012–13 Newcastle United F.C. season", "response": ["*1 June 2012: First-team members Alan Smith, Peter Løvenkrands and Danny Guthrie are released by the club. Youngsters Samuel Adjei, Phil Airey, Ryan Donaldson, Stephen Folan, Jeff Henderson, Tamás Kádár, Greg McDermott and Patrick Nzuzi are also released.", "|  Phil Airey"]}]}}