{"wiki_id": "http://www.wikidata.org/entity/Q7183617", "itemLabel": "Philip Glassborow", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Glassborow", "wikipedia_page": {"main": "Philip Glassborow is a playwright, lyricist and composer who writes for theatre, radio and television. His best-known theatre musical is The Great Big Radio Show! (music and lyrics) with book in collaboration with Nick McIvor, which was premiered by the Watermill Theatre in Newbury, showcased at the Bridewell Theatre in London, and had additional exposure via the off-Broadway York Theatre Company ‘Musicals in Mufti’ series (2005), and Malta’s National Theatre, Teatru Manoel (2014).Other theatre credits include a new musical version of “Peter Pan” by J. M. Barrie (Watermill Theatre, Newbury and Yvonne Arnaud Theatre, Guildford) and “A Kid for Two Farthings” (lyrics) with music by Cyril Ornadel and book in collaboration with Robert Meadwell, based on the novel by Wolf Mankowitz.\nFor BBC Radio, Philip compiled and presented “The Gorey Details” based on the work of Edward Gorey, which starred Frank Langella, Katherine Kellgren, Andreas Brown and David Suchet.  He has dramatized many classic books for radio including “Billy Budd, Sailor” by Herman Melville; “Christopher Himself” based on 'Prater Violet' by Christopher Isherwood (which starred David Suchet, Adam Godley and Bernard Cribbins, and featured an interview with Don Bachardy); “The Secret Garden,” starring Dame Joan Plowright, Ron Moody and Prunella Scales; and “Silas Marner” starring Michael Williams, Jenny Agutter, Alex Jennings and Edward Woodward.  His dramatisation of Anthony Trollope's story \"Christmas Day At Kirkby Cottage\" starred Finty Williams, John Rhys-Davies and Julia McKenzie.In 2014, to commemorate the 60th anniversary of the Red Cross inspection of Theresienstadt Concentration Camp, Glassborow was commissioned by director Adam Forde to write a new music theatre piece, Welcome To Terezin. The play was presented at the Edinburgh FestivalGlassborow's musical play \"Star Of Strait Street\" will be premiered as part of Valletta 2018, European Capital of Culture in May 2018. The play was previewed with the support of the Mackintosh Foundation for Malta's EU 2017 Presidency Arts Celebrations, at the Splendid Cultural Incubation Centre as part of the Strada Stretta Concept under the artistic direction of Giuseppe Schembri Bonaci.", "link_mentions": [{"page": "Edward Gorey", "response": ["* The Gorey Details. BBC Radio program compiled and presented by Philip Glassborow, including interviews with Andreas Brown of the Gotham Book Mart, actor Frank Langella (star of Gorey's Dracula on Broadway), Alison Lurie, Alex Hand, Jack Braginton Smith, Katherine Kellgren, and featuring David Suchet as the voice of Gorey.", "* \"All The Gorey Details\", The Independent, by Philip Glassborow, May 2003."]}, {"page": "Jackanory", "response": ["A spin-off series was Jackanory Playhouse (1972–85), which was a series of thirty-minute dramatisations. These included a dramatisation by Philip Glassborow of the comical A. A. Milne story \"The Princess Who Couldn't Laugh\"."]}, {"page": "Vivian Ellis", "response": ["Ellis became the President of the Performing Right Society and in 1984 the society instituted an annual event – the Vivian Ellis Prize – to encourage young composers and lyricists to write for the musical stage. Ellis gave all the writers the same advice: \"Try and put at least one hit song in every musical you write.\" Several of the promising writers featured in the competition went on to success, including Charles Hart who wrote lyrics for The Phantom of the Opera, and Philip Glassborow whose comedy musical The Great Big Radio Show! was a personal favourite."]}, {"page": "A Kid for Two Farthings", "response": ["A film version directed by Carol Reed was released in 1955 with an adapted screenplay by Mankowitz. A musical play based on the novel was presented at the Bridewell Theatre in London in 1996 by the Mercury Workshop, starring Ron Moody as Kandinsky. Music was by Cyril Ornadel with lyrics by Philip Glassborow and book by Glassborow and Robert Meadwell.Michael Kennedy in Masquerade, The World of Show Music Magazine, Issue 23"]}, {"page": "The Great Big Radio Show!", "response": ["The Great Big Radio Show! is a musical comedy, with music and lyrics by Philip Glassborow.  Piano arrangements and dance music are by David Rhind-Tutt.  Book is by Philip Glassborow with Nick McIvor."]}, {"page": "List of works based on Peter Pan", "response": ["*Peter Pan, book, music, and lyrics by Philip Glassborow (1995), an authorised musical radio adaptation. Directed by Dirk Maggs for the BBC, this production was nominated for a Writer's Guild of Great Britain award.", "*Peter Pan (1996), book, music, and lyrics by Philip Glassborow, an authorised musical stage adaptation based on Glassborow's radio musical."]}, {"page": "List of musicals by composer: A to L", "response": ["* Philip Glassborow"]}, {"page": "Adaptations of Les Misérables", "response": ["* 2002, directed by Philip Glassborow and produced by Paul McCusker for Focus on the Family Radio Theatre."]}, {"page": "Phillip Glassborow", "response": ["#redirect Philip Glassborow "]}]}}