{"wiki_id": "http://www.wikidata.org/entity/Q7182275", "itemLabel": "Phil Pickett", "itemDescription": "English composer, musician, vocal arranger, producer and artist manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Pickett", "wikipedia_page": {"main": "Philip Stuart Pickett (born  19 November 1946) is a double Ivor Novello Award-winning English composer, musician, vocal arranger, producer and artist manager.\nHe is principally known as a songwriter and musician and for co-writing and recording \"Karma Chameleon\", one of the biggest hits of the 1980s era with\nBoy George and Culture Club during his tenure as keyboard player and backing vocalist for the group on every live performance throughout the world during the 1980s. Prior to this, Pickett co-founded hit-making pop band Sailor in 1973 which achieved considerable chart-topping success in the mid-1970s Glamrock period and with whom he still regularly performs to the present day. Pickett's songs have also been recorded by many other artists including Labi Siffre, Sheena Easton, Georgie Fame, Joe Cocker, Brian Kennedy and Malcolm McLaren, used in countless TV commercials and included in the soundtrack of Hollywood films Electric Dreams, Top Secret!, The Lost Boys and his West End Musical Theatre debut, Casper The Musical.", "link_mentions": [{"page": "Culture Club", "response": ["The group's back-up singer, Helen Terry, began work on her solo album, for which George and Hay wrote the song \"Love Lies Lost\". The pair also wrote \"Passing Friend\" for the Beach Boys' album. Culture Club wrote two songs for the soundtrack to the movie Electric Dreams. George and Hay wrote \"The Dream\" and \"Love Is Love\", with the latter being released as a single in Canada and Japan, the E.P \"Love is Love\" became a major hit in Japan. George also collaborated on the song \"Electric Dreams\", sung by P. P. Arnold. The song was written with Phil Pickett (former member of the 1970s band Sailor) who had also co-written \"Karma Chameleon\" and frequently played keyboards for the group.", "* Phil Pickett – keyboards, vocals (1981–1986)"]}, {"page": "Duane Eddy", "response": ["The following year, Duane Eddy was released on Capitol. Several of the tracks were produced by Paul McCartney, Jeff Lynne, Ry Cooder, and Art of Noise. Guest artists and musicians included John Fogerty, George Harrison, Paul McCartney, Ry Cooder, James Burton, David Lindley, Phil Pickett, Steve Cropper, and original Rebels, Larry Knechtel and Jim Horn. The album included a cover of Paul McCartney's 1979 instrumental, \"Rockestra Theme\". In 1982, Duane Eddy's \"Rebel Walk\" was heard in the musical comedy, Grease 2, featured as background music at the bowling alley, when the T-Birds rushed to face rival Leo Balmudo. Though it was not a part of the original soundtrack, it was mentioned in the film's credits. In 1992, Eddy recorded a duet with Hank Marvin on Marvin's album Into the Light, with a cover version of The Chantays' 1963 hit \"Pipeline\"."]}, {"page": "Kissing to Be Clever", "response": ["*Phil Pickett – keyboards, background vocals"]}, {"page": "Jon Moss", "response": ["In 2006 Moss, Mikey Craig and Phil Pickett tried to launch Culture Club on a new tour with another lead singer, as George and Roy Hay had declined to tour.Culture Club#Reunions A UK tour was announced for December 2006, but was postponed to give the new line-up time to finish recording their album. Without official press statements, band manager Tony Gordon said in 2007 that the project was \"on hold\", while Jon stated that the project was shelved."]}, {"page": "Dave Pegg", "response": [";On Phil Pickett albums"]}, {"page": "Sailor (band)", "response": ["The group's leader, Georg Kajanus, had previously written \"Flying Machine\" for Cliff Richard in 1971, although it was Richard's first British single that failed to reach the top 30. Sailor developed from Kajanus Pickett, a singer-songwriter duo that had formed when Phil Pickett and Kajanus met in 1970 at E H Morris, a music publisher where Pickett briefly worked. They later recorded the album Hi Ho Silver for Signpost Records. Sailor first came together in 1973 with the addition of musicians Henry Marsh (ex-Gringo) and Grant Serpell (ex-Affinity).", ";Phil Pickett (born Philip Stuart Pickett, 19 November 1946, Münster, Germany)"]}, {"page": "Colour by Numbers", "response": ["* Phil Pickett – Hammond organ and synthesizers"]}, {"page": "Waking Up with the House on Fire", "response": ["* Phil Pickett – keyboards, background vocals"]}, {"page": "From Luxury to Heartache", "response": ["* Phil Pickett – keyboards, background vocals"]}, {"page": "BA Robertson", "response": ["|Phil Pickett"]}, {"page": "Georg Kajanus", "response": ["Kajanus and Phil Pickett, who had been acquainted for some time, collaborated on an album, Hi Ho Silver! (1972), as Kajanus/Pickett. Deciding to form a group, tentatively named KP Packet, Kajanus and Pickett enlisted drummer and percussionist Grant Serpell (Affinity), and keyboard player and guitarist Henry Marsh (Gringo). In 1973, the foursome made their first recordings in a small studio in North London. Most of this material was not released at the time, but three demos are featured in Sailor's Buried Treasure 2-CD box set (2006).Sailor Albums - Buried Treasure", "In 1989, Kajanus reunited with Henry Marsh and Phil Pickett to write and record some new material. This was not released at the time, but three songs are featured in Sailor's Buried Treasure 2-CD box set (2006)."]}, {"page": "Keziah Jones", "response": ["Jones led a bohemian lifestyle for several years instead of the one envisaged for him. \"Lose all time, love your mind, free your soul!\" were words from his song Free Your Soul. Moving from London to Paris and back again frequently accompanied only by his guitar, the young Jones acquired a reputation as a talented musician and charismatic performer with a unique \"hard funk\" style. In 1990, whilst busking in London's Portobello Road, Keziah was discovered by composer and ex-keyboard player for Sailor and Culture Club, Phil Pickett quickly evolving into full-time management of the artist."]}, {"page": "Simon Nicol", "response": [";With Phil Pickett"]}, {"page": "Pickett", "response": ["*Phil Pickett (born 1948), English composer, musician and record producer"]}, {"page": "Karma Chameleon", "response": ["Category:Songs written by Phil Pickett"]}, {"page": "Flying Machine (song)", "response": ["Hultgreen recorded his own proper version in 1972 as part of Kajanus Pickett (with Phil Pickett), which was released on their sole album Hi Ho SIlver!. His original demo version was later released on the 2006 album Kajanus (Revealed)."]}, {"page": "Take My Time", "response": ["#\"Don't Send Flowers\" (Phil Pickett) 3.02"]}, {"page": "It's a Miracle (Culture Club song)", "response": ["Category:Songs written by Phil Pickett"]}, {"page": "List of musicals by composer: M to Z", "response": ["::     Casper (1999); music also by Phil Pickett", "* Phil Pickett (born 1946)"]}, {"page": "Son of Morris On", "response": ["Son of Morris On is a British folk rock album released in 1976 under the joint names of Ashley Hutchings, Simon Nicol, John Tams, Phil Pickett, Michael Gregory, Dave Mattacks, Shirley Collins, Martin Carthy, John Watcham, John Rodd, The Albion Morris Men, Ian Cutler, and the Adderbury Village Morris Men.", "*Track 13 trad. arr. Phil Pickett;", "*Phil Pickett - bagpipes "]}, {"page": "Time (Clock of the Heart)", "response": ["*Phil Pickett: piano, glockenspiel and tubular bells"]}, {"page": "Henry Marsh (musician)", "response": ["After Oxford, Marsh joined a group with, among others, John G. Perry, at first called Toast, which expanded to become Gringo. He was invited in 1973 by Phil Pickett to join a group called "]}, {"page": "Priscilla (disambiguation)", "response": ["* \"Priscilla\", a song by Phil Pickett, 1971"]}, {"page": "Move Away", "response": ["Category:Songs written by Phil Pickett"]}, {"page": "Primary Wave (company)", "response": ["* Phil Pickett"]}, {"page": "Still from the Heart", "response": ["*Phil Pickett - organ and backing vocals on \"Here Comes Trouble\""]}]}}