{"wiki_id": "http://www.wikidata.org/entity/Q718772", "itemLabel": "James Holden", "itemDescription": "English disc jockey of electronic music", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Holden_(producer)", "wikipedia_page": {"main": "James Alexander Goodale Holden (born 7 June 1979) is a British electronic music artist and DJ. After beginning his career as a DJ and producer, Holden has moved extensively into live performance and founded his own record label Border Community.", "link_mentions": [{"page": "Sasha (DJ)", "response": ["With the 2000 album Communicate, the duo's work moved towards a deeper and darker house music sound. The album featured tracks by Morel, Mainline, and Jimmy Van M. The focus shifted from the melodic themes of previous releases in favour of a stronger emphasis on the bassline. The Delta Heavy Tour and Airdrawndagger marked a dramatic shift in style, and reflected the influences of relaxed ambient and breakbeat music on Sasha's work. These influences inspired the  album's strong melodies, occasional breakbeat loops, and limited use of percussion. Involver was primarily a fusion of the musical style of house and ambient breakbeat music characterised by UNKLE and Lostep. With 2005's Fundacion, Sasha's style was mostly progressive house and electro house music, with work by James Holden, Tiefschwarz, and Swayzak. With his success in progressive house, Sasha has commented that he feels people try to \"pigeon-hole\" him into playing that genre. Rather than calling it progressive house, Sasha considers his most recent material to be between house, trance, and breaks, though he has stated that he prefers not to associate himself with a specific genre of music."]}, {"page": "Market Bosworth", "response": ["In 1885 the 11th Baronet 'Beau' Dixie was forced to auction Bosworth Hall to pay his gambling debts. It was bought by Lady Agnes Tollemache, whose husband Charles Tollemache Scott enlarged the estate, planted woodlands and rebuilt the lodges and farms.James Holden, \"How Charles Tollemache Scott transformed the Bosworth Estate\", New Aspect, November 2005. Lady Agnes' daughter sold the estate in 1913.", "* James Holden (b. 1979) – electronic music producer"]}, {"page": "List of house music artists", "response": ["*James Holden"]}, {"page": "Jeskola Buzz", "response": ["* James Holden, whose early work was produced entirely within Buzz."]}, {"page": "Meredith Music Festival", "response": ["|The War on Drugs, Tiny Ruins, Ty Segall, De La Soul, Mark Lanegan, Factory Floor, Jagwar Ma, Augie March, Sleep, James Holden, Mia Dyson, Ghostface Killah, The Skatalites, Phosphorescent, Jen Cloher, Cloud Nothings, The Lemonheads, The Town Bikes, The Bombay Royal, Vakula, Silence Wedge, Blank Realm, Painters and Dockers, Sun God Replica, City of Ballarat Municipal Brass Band, The Harpoons, Teeth & Tongue, The Public Opinion Afro Orchestra, Misty Nights, Marlon Williams, Dr Phil Smith, Krakatau, Jess McGuire, Hard-Ons "]}, {"page": "Module file", "response": ["Although trackers can be considered to have some technical limitations, they do not prevent a creative individual from producing music that is indiscernible from professionally created music. The demosceners were focused on pushing the limits of technology. Many tracker musicians gained international prominence within MOD software users and some of them went on to work for high-profile video game studios, or began to appear on large record labels. Notable artists include Andrew Sega, Purple Motion, Darude, Alexander Brandon, Peter Hajba, Axwell, Venetian Snares, Jesper Kyd, TDK, Thomas J. Bergersen, Markus Kaarlonen, Michiel van den Bos and Dan Gardopée. It is also widely known that many of Aphrodite's early releases were made on two synchronized Amigas running OctaMED, and that James Holden made majority of his early material in Jeskola Buzz. Deadmau5 and Erez Eisen of Infected Mushroom have both used Impulse Tracker in their early career."]}, {"page": "Leafcutter John", "response": ["In 2019, Burton released his seventh album Yes! Come Parade With Us on James Holden’s label Border Community, featuring modular synth and field recordings from the Norfolk Coast Path."]}, {"page": "System 7 (band)", "response": ["In addition to the albums, System 7 have released a number of club singles with notable remixes from, among others, Richie Hawtin (aka Plastikman), Dubfire, James Holden, Liquid Soul, and Son Kite."]}, {"page": "Exit (festival)", "response": ["|Kelis (cancelled), Dizzee Rascal, The Cult, Scissor Sisters, The Cardigans, Dave Clarke, David Guetta, Derrick May, Eric Prydz, Hernán Cattáneo, James Zabiela, Jeff Mills, Junior Jack, Kid Crème, Layo & Bushwacka!, Nick Warren, Steve Lawler, Umek, Simian Mobile Disco, James Holden, Steve Angello b2b Sebastian Ingrosso, Switch, Loco Dice, Moonspell, Krafty Kuts & Dynamite MC, Soulfly Jam, Andy C & MCGQ, Suzanne Vega, Rambo Amadeus, Let 3, Massimo Savić, Darkwood Dub, Kiril Džajkovski w/ Esma Redžepova & Vlada Divljan, Dog Eat Dog, Pendulum, Madball, Neno Belan, Junkie XL, Siddharta, Partibrejkers, Van Gogh, Eyesburn, Block Out, Šaban Bajramović, Kanda, Kodža i Nebojša, Foltin, Kal, Orthodox Celts, Limewax, E-Play, Ritam Nereda, Obojeni program, Marčelo, Félix Lajkó, Garavi Sokak, Zbogom Brus Li, Blla Blla Blla, Slavic Soul Party!, Tamara Obrovac, Slobodan Trkulja, Cubismo, The Beat Fleet, Chicks on Speed, Darko Rundek, LTJ Bukem & MC Conrad (cancelled), DJs Are Not Rock Stars aka Princess Superstar & Alexander Technique, The Streets (cancelled), Goldie, Plejboj, Vlatko Stefanovski Trio"]}, {"page": "Nothing (disambiguation)", "response": ["* \"Nothing\", by Holden & Thompson; see James Holden (producer)"]}, {"page": "Meltdown (festival)", "response": ["|Polar Bear, Grandmaster Flash, Scratch Perverts, Unkle, Ableton interactive project, Chrissie Hynde, Zacharias Blad, Mark Lanegan, Tor Miller, Petite Noir, Roman Remains, DJ Shadow, James Lavelle, Gilles Peterson, Max Richter, Joshua Homme, Mélanie De Biasio, Auclair, Keaton Henson, Edwyn Collins, Colorama, Radkey, Amazing Snakeheads, Trentemoller, Howie B, James Holden, Not Waving, Glass Animals, Rosie Lowe, Neneh Cherry, screening and live soundtrack of Under the Skin, DJ Harvey, Dooks, Machines, These Ghosts, Benji B, Tom Vek & Olga Bell, Nick Zinner, ESG, 23 Skidoo, Trevor Jackson, Goldie & Heritage Orchestra, Don Letts, Voicelab, JP Duncan, Acid Brass, Horsemeat Disco, Jeff Mills, A Guy Called Gerald, Craig Richard, re-envisioning of A Love Supreme."]}, {"page": "DJ-Kicks", "response": ["The first DJ-Kicks release was C.J. Bolland's in 1995, and the series is still regularly expanded. , there are 56 releases in the series, with a release rate of roughly two to three new entries each year. 2016 was particularly busy with five new mixes, more than any other year so far. Some of the DJ-Kicks mixes are very popular and counted among the regular albums of the compiler, most notably the one by Kruder & Dorfmeister. The entries by Erlend Øye, Four Tet, James Holden, John Talabot, DJ Koze and Moodymann have also received particular acclaim. The DJ-Kicks series has been called \"the most important DJ-mix series ever\" by Mixmag. The 26th release was a special celebratory (and unmixed) \"best of\" compilation,  DJ-Kicks: The Exclusives. It consisted of original tracks by the DJs who had mixed the earlier albums in the series.", "| DJ-Kicks: James Holden", "| James Holden"]}, {"page": "List of silent musical compositions", "response": ["*\"Intentionally Left Blank\" by James Holden (in The Idiots Are Winning (2006))"]}, {"page": "Fabric 24", "response": ["#  Nathan Fake - The Sky Was Pink (James Holden Remix) - Border Community"]}, {"page": "Global Underground 016: Cape Town", "response": ["# James Holden - \"Horizons (Way Out West Remix)\" – 6:08"]}, {"page": "Flash Brothers", "response": ["In 2004, they released Fear of a Silver Planet Vol. 2, a sequel to James Holden's mix on Silver Planet Recordings.  The Flash Brothers also work closely with Holden. "]}, {"page": "Get Together (Madonna song)", "response": ["# \"Get Together\" (James Holden Remix) – 8:00", "# \"Get Together\" (James Holden Remix) – 8:00", "# \"Get Together\" (James Holden Remix) – 8:00", "# \"Get Together\" (James Holden Remix) – 8:00", "# \"Get Together\" (James Holden Remix) – 8:00"]}, {"page": "Silver Planet", "response": ["Silver Planet was a dance music record label active throughout the late nineties and early 2000s, amassing a back catalogue of over seventy recordings, including the earliest releases of DJ and producer James Holden. Timo Maas also released on the label."]}, {"page": "Glastonbury Festival line-ups", "response": ["* James Holden"]}, {"page": "INCredible", "response": ["INCredible is an offshoot of Sony Music Entertainment.  INCredible releases electronic dance music of all kinds, including the Gatecrasher series.  The label has also released singles from artists such as Satoshi Tomiie and James Holden."]}, {"page": "Latitude Festival", "response": ["James Holden (Live)"]}, {"page": "Inheritor", "response": ["* The Inheritors (album), by James Holden"]}, {"page": "MMII (album)", "response": ["# James Holden - \"I Have Put Out The Light\"  – 4:43"]}, {"page": "James Holden (musician)", "response": ["#REDIRECT James Holden (producer) "]}, {"page": "Airdrawndagger", "response": ["Airdrawndagger is the second studio album by Welsh DJ Sasha. It was released on 5 August 2002 through Kinetic Records and BMG, with a digital download release issued by Deconstruction Records. The album features co-production from Charlie May, Junkie XL and James Holden. It was released with one single, \"Wavy Gravy\", on 19 August 2002, which had an amateur remix contest held in 2003. Despite the release of The Qat Collection in 1994, Airdrawndagger was advertised as Sasha's \"debut artist album\". Upon release, the album charted on the UK and US Albums Charts, peaking at number 18 and 157 respectively.", "*James Holden – writing, production (\"Bloodlock\")"]}, {"page": "Fundacion NYC", "response": ["# Andre Kraml - \"Safari\" (James Holden Remix) – 6:35"]}, {"page": "Hope Recordings", "response": ["The label is run by Leon Alexander, with English house music DJ and producer Nick Warren in control of its A&R. It is home to progressive house and breaks artists such as Starecase, Jaytech, Matt Rowan, and Parallel Sound. Well-known electronic music artists such as Max Graham, Timo Maas, James Holden, Hybrid, Starecase and Way Out West (Nick Warren is part of this progressive house duo) have worked with Hope Recordings in the past. Warren is head of Hope's A&R. The label regularly holds dance music events around the world - in the UK, Miami and Ibiza."]}, {"page": "Global Underground 022: Melbourne", "response": ["#James Holden - One For You (Avus' One For The DJs Squelchapella) – 3:46"]}, {"page": "Club Mix", "response": ["#\"Inner Laugh\" (James Holden Remix) - Roland Klinkenberg"]}, {"page": "Patronaat", "response": ["With a strong program and a character of its own Patronaat provides progressive pop music and meets the wishes of its catchment. Over the years artists like Willy DeVille, Solomon Burke, Tori Amos, Dick Dale, Herman Brood, Living Colour, Bo Diddley, dEUS, Zita Swoon, Gabriel Rios, Rickie Lee Jones, The Gutter Twins, Steve Lukather, José Feliciano, Babyshambles, Calexico, Michael Franti & Spearhead, but also heavy acts like Limp Bizkit, Anthrax, The Bloodhound Gang, Marillion, The Misfits, Danko Jones, Soulfly, Therapy?, New Model Army, Y&T, Neurosis, Cradle of Filth, Obituary, D.R.I., Helmet, Dimmu Borgir and Deicide, as well as large names in the electronic music world like Paul Kalkbrenner, Dave Clarke, Knife Party, Steve Aoki, Modeselektor, Jeff Mills, James Holden, DJ Hell,  Orbital, Leftfield, Battles, Pendulum, Chase & Status, Nero, Camo & Krooked, Andy C, Sub Focus, Aphrodite, Ed Rush, Benga, Skream, Caspa and Rusko have found their way to the Haarlem venue."]}, {"page": "James Holden", "response": ["James Holden may refer to:", "* James Holden (mechanical engineer) (fl. 1802), British mechanical engineer, see William Cockerill", "* James Holden (locomotive engineer) (1837–1925), British locomotive engineer", "* James Holden (actor) (1920–2005), American actor", "* James Holden (producer) (born 1979), electronic music artist and producer", "* James Holden, character in The Expanse novel series by James S.A. Corey, and its television adaptation"]}, {"page": "Holden & Thompson", "response": ["#REDIRECT James Holden (producer)"]}, {"page": "Janeiro (song)", "response": ["In 2002, the song's popularity grew with new remixes by DJs such as Armin van Buuren, Kyau & Albert and James Holden. The song was remixed again in 2006 by 4 Strings and San & Sebastian Moore. In 2009, the song appeared again in a new version on the album The New Daylight by Dash Berlin. Dash Berlin later released his 4AM Remix which was featured on A State Of Trance episode 455. A remix by Signum was featured on Corsten's Countdown 149."]}, {"page": "Transport 5", "response": ["#Loki – \"NYCU (James Holden Inertia Remix)\" (7:05)"]}, {"page": "Planet 7", "response": ["| 1 || \"Planet 7 (James Holden Remix)\"  (original version on Encantado) || 09:50 || rowspan=\"2\" | Steve Hillage, Miquette Giraudy and Sander Kleinenberg || rowspan=\"2\" | Steve Hillage & Miquette Giraudy || James Holden"]}, {"page": "Global Underground 032: Mexico City", "response": ["Global Underground 032: Adam Freeland, Mexico City is a DJ mix album in the Global Underground series, compiled and mixed by DJ and producer Adam Freeland, a pioneer of the English breakbeat scene. This is the first Global Underground mix for Adam Freeland.  The two disc mix album features a wide variety of genres ranging from electropop to breaks to the glitchy techno of James Holden."]}, {"page": "List of trance genres", "response": ["|Kyau & Albert, Gui Boratto, Trentemøller, James Holden, Nathan Fake, Dominik Eulberg"]}, {"page": "The Idiots Are Winning", "response": ["The Idiots Are Winning is the debut album by English electronic music producer James Holden. It was released in 2006 as the fourteenth record on Holden's own record label, Border Community.", "Category:James Holden (producer) albums"]}]}}