{"wiki_id": "http://www.wikidata.org/entity/Q7181713", "itemLabel": "Phil Bloss", "itemDescription": "English professional footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Bloss", "wikipedia_page": {"main": "Philip Kenneth Bloss (born 16 January 1953) is an English former professional footballer who played as a midfielder in the Football League.", "link_mentions": [{"page": "Dick Graham", "response": ["In the summer of 1971, the U's took part in the Watney Cup, a short-lived pre-season knock-out tournament for the highest goalscoring teams not promoted. Knocking out Luton Town and Carlisle United, United faced West Bromwich Albion in the final at The Hawthorns. Colchester held West Brom 4–4, with the tie going to a penalty shoot-out, the first penalty shoot-out to be shown on television. The U's won with Phil Bloss slotting home the winning penalty."]}, {"page": "1973–74 Colchester United F.C. season", "response": ["|Phil Bloss"]}, {"page": "1972–73 Colchester United F.C. season", "response": ["|Phil Bloss||MF||||Colchester||||23||2||Apprentice||January 1971||Free transfer"]}, {"page": "1971–72 Colchester United F.C. season", "response": ["Colchester's goalscoring exploits of the previous campaign enabled qualification for the 1971–72 pre-season Watney Cup competition, open to the two highest scoring teams from each division, exclusively for teams that had not achieved promotion or entered into European competition. Both Luton Town and Carlisle United were beaten at Layer Road ahead of the final, held against West Bromwich Albion at their Hawthorns stadium. The encounter registered four goals apiece, taking the fixture to a penalty shoot-out. Albion missed two penalties, while Colchester youngster Phil Bloss scored the decisive spot kick to win the competition.", "|Phil Bloss||MF||||Colchester||||1||1||Apprentice||January 1971||Free transfer", "|align=\"left\"|Phil Bloss"]}, {"page": "1970–71 Colchester United F.C. season", "response": ["|Phil Bloss||MF||||Colchester||||0||0||Apprentice||January 1971||Free transfer", "|Phil Bloss", "|align=\"left\"|Phil Bloss", "|Phil Bloss"]}, {"page": "Bloss", "response": ["*Phil Bloss (born 1953), English former footballer"]}]}}