{"wiki_id": "http://www.wikidata.org/entity/Q7181207", "itemLabel": "Phelan Gibb", "itemDescription": "British artist (1870-1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phelan_Gibb", "wikipedia_page": {"main": "Harry Phelan Gibb (a.k.a. William Phelan \"Harry\" Gibb) (1870–1948) was a British artist influenced by the work of Paul Cézanne, who exhibited in London, Paris and New York.Born in Alnwick, Northumberland, he studied at Newcastle, Edinburgh, Antwerp and Munich as well as Paris under Jean-Paul Laurens where he lived for twenty five years.\nHis style has been described as \"earthy\" and naive and was highly thought of by Roger Fry, Gertrude Stein, and Lucy Wertheim.Wertheim indeed enthused about him in her 1947 book Adventure in Art –  \"The English artist still living whose work probably is of the most permanent value is Phelan Gibb. One day Phelan Gibb will doubtless come into his own, and his finest paintings take their place alongside examples of Manet, Caezanne, Picasso, Kolle and Christopher Wood, in international exhibitions of Modern Art\".Emily Carr studied with Gibb in 1910-1911 in France when Gibb was an expatriate living in Paris, and it was during this association that Carr began experimenting with perspective, scale and colour, rather than remaining faithful to literal representations of natural forms.Gibbs' work was shown at the 1913 International Exhibition of Modern Art organised by the Armory Show American Association of Painters and Sculptors in New York City, and his watercolour 'Belgrave Square and Wilton Crescent' (1928) is held by the Tate.", "link_mentions": [{"page": "List of British artists", "response": ["* Phelan Gibb (1870–1948) – British artist and early modernist, painting in Paris 1910–1914"]}, {"page": "Auckland Art Gallery", "response": ["Another major benefactor was Lucy Carrington Wertheim. Miss Wertheim was an art gallery owner in London and through her support of expatriate artist Frances Hodgkins bestowed on the Auckland Art Gallery a representative collection of British paintings from the interwar period. Her gifts in 1948 and 1950 totalled 154 works by modern British artists, including Christopher Wood, Frances Hodgkins, Phelan Gibb, R. O. Dunlop and Alfred Wallis. The Wertheim collection was initially displayed in a separate room opened by the Mayor J. A. C. Allum on 2 December 1948."]}, {"page": "Henry Stockley", "response": ["There are a number of possible ways in which to categorise Henry Stockley as a painter: the most obvious categories are naive, or primitive; or possibly as a representative of people's art. The newer category of Outsider Art is only appropriate for his more visionary work. While Stockley, as his letters show, was unsympathetic to most contemporary art, he was certainly seen by collectors in the 1930s and 1940s as a modern artist, even if in a naive mode. Lister and Williams, in their book, British Naive and Primitive Art [1977] regard Stockley as one of the \"rare and much to be treasured\" primitives along with Wallis and James Dixon. They write of Stockley's \"primitive enthusiasm\" and \"simple naive style\" [Lister and Williams, 1977:170]. As with so many critics, they were simply unaware of the range and complexity of Stockey's output. Their illustration [Coneys, 1933, as yet untraced] is in dull monochrome:  Stockely's dazzling and unusual colours are shown in a dusty grey. As the Times critic noted in 1932, the bus-driver label attempted to associate his work with La Douanier Rousseau, another naive artist whose work was worthy to be shown alongside great masters. Stockely saw himself differently, as a great if unacknowledged artist, a \"new old master.\"  His letters only passingly mention other artists, but include scathing comments on Graham Sutherland coupled with his own wish to design work for cathedrals. Stockley was certainly familiar with the National Gallery collection; and some of his work resembles Italian Primitives. He also named one of his houses after Rembrandt, and the house still bears the name. He must also have been familiar with the artists his patron Lucy Wertheim showed: Alfred Wallis, Christopher Wood, Phelan Gibb and Frances Hodgkins for example, and the distinctly \"modern\" painters shown by Jack Bilbo in his gallery of Modern Art [a checklist of modern painters, Bilbo, 1946].", "It is crucial to an understanding of Stockley to appreciate the personal as well as historical context in which he produced his remarkable work: his poverty, the almost total lack of leisure, the very long hours of arduous and difficult effort involved in bus driving, particularly in the 1930s and during the War, the hostility of most critics, and above all his isolation as an artist in his working world. Other artists appreciated, and appreciate, his paintings, but apart from the encouragement of Lucy Wertheim and Bilbo, and Phelan Gibb, Stockley was on his own. The effort and expense of visiting a London gallery, or seeing Lucy Wertheim, were usually beyond him (he either couldn't afford it, couldn't get time off work, or his wife prevented it). He was a working man who had lived a bleak life of poverty, particularly in his childhood, and who was haunted by the fear of poverty and hunger. He struggled to be a serious professional artist in an environment almost totally against him. His work was produced an act of courage and determination, against despair. And we should not be surprised that in the end the effort was too much for him."]}, {"page": "Towner Gallery", "response": ["Since the gallery was established it has received donations of work by significant artists including: Walter Sickert, Pablo Picasso, Henry Moore, Victor Pasmore, Alfred Wallis, Frances Hodgkins, Phelan Gibb and David Bomberg."]}, {"page": "List of artists in the Armory Show", "response": ["* Phelan Gibb"]}, {"page": "Lucy Wertheim", "response": ["Whatever finally got her to open the gallery, there were many artists who were no doubt glad she did. Those either exhibited there or supported by Wertheim included Walter Sickert, Rodney Gladwell, Humphrey Slater, Helmut Kolle, Vivin Hume, Phelan Gibb, John Bigge and John Banting, Henry Stockley, Nando Manetti, Rowland Suddaby, Leslie Hurry, Isla Rodmell, Kenneth Hall, Basil Rakoczi, John Melville, Feliks Topolski, Charles Higgins (Pic), David Burton, Cedric Morris, Alfred Wallis, Frances Hodgkins, Elizabeth Rivers, Mostyn Lewis, Jose Christopherson, David Gommon, Kathleen Walne and  Christopher Wood amongst many others.Wertheim, Lucy [1947]. Adventure in Art, Nicholson and Watson, London"]}, {"page": "David Gommon", "response": ["It was through Lucy Wertheim that he held his first one-man show at her gallery in Burlington Gardens, and attracted positive critical attention. During this time he met many other patrons of the arts and he painted the young dancers Margot Fonteyn and Robert Helpmann at Saddlers Wells.  He was part of the 20s group supported by Lucy Wertheim that included Christopher Wood, Barbara Hepworth, Roger Hilton, Robert Medley, Phelan Gibb, David Burton, Humphrey Slater and Victor Pasmore.The Independent"]}]}}