{"wiki_id": "http://www.wikidata.org/entity/Q7183649", "itemLabel": "Philip Gregson-Ellis", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Gregson-Ellis", "wikipedia_page": {"main": "Major General Philip George Saxon Gregson-Ellis CB OBE (31 August 1898 – 20 October 1956) was a senior British Army officer who saw active service during both the First World War and the Second World War, where he commanded the 5th Infantry Division during the Italian Campaign in 1944.", "link_mentions": [{"page": "5th Infantry Division (United Kingdom)", "response": ["Progress for the Allied Armies in Italy (AAI), commanded by General Sir Harold Alexander, towards the end of 1943 had slowed down considerably, due mainly to a combination of worsening weather, stiffening German resistance and the Winter Line (also known as the Gustav Line, a series of formidable defences the Germans had created). The Eighth Army, operating on the Adriatic coast, had already pierced the Gustav Line at its eastern end. However, the appalling weather conditions forbade further progress and so operations there were closed down. As a result, the relatively intact 5th Division was available elsewhere. Therefore, in early January 1944 the division was transferred from the Eighth Army, now under Lieutenant-General Sir Oliver Leese, to the western side of Italy to join Lieutenant-General Richard McCreery's British X Corps. X Corps, stationed along the Garigliano river, was part of Lieutenant General Mark W. Clark's U.S. Fifth Army at the time. The division, now commanded by Major-General Philip Gregson-Ellis and with the veteran 201st Guards Brigade under command,Joslen, p. 266 crossed the Garigliano river as part of the First Battle of Monte Cassino.", "* Jan 1944 – Nov 1944 Major-General Philip Gregson-Ellis", "* 1946–1947 Major-General Philip Gregson-Ellis"]}, {"page": "Gerald Templer", "response": ["He remained in the army during the interwar period and served with his battalion, still the 1st Irish Fusiliers, after briefly returning to England, in operations in Persia (now Iran) and Iraq in 1919–20 as part of a multi-national attempt to prevent the spread of bolshevism, which was followed by service in Egypt.Cloake, pps. 29–37 Returning to England with the battalion, where it was amalgamated with the 2nd Battalion in November 1922,Cloake, pps. 37–38 Templer was a reserve for the 1924 Summer Olympics as a 120-yard hurdler, although in the end he did not compete.Cloake, p. 38 In January 1925 the battalion again returned to Egypt, where it remained until October 1927 when it was sent to India, although Templer did not accompany them. Just before the battalion sailed for India he had returned to England to attend the Staff College, Camberley, which he did from 1928 to 1929, and was the youngest student there, aged just 29.Cloake, p. 47 Among his many fellow students were men such as John Harding, Richard McCreery, Gordon MacMillan, Alexander Galloway, Gerard Bucknall, Philip Gregson-Ellis, Alexander Cameron and Cameron Nicholson. In the year senior to him were Eric Dorman-Smith, John Hawkesworth, John Whiteley, Evelyn Barker, Oliver Leese, Ronald Penney, Robert Bridgeman, Philip Christison and numerous others while, in Templer's second year, in the year below, were George Erskine, Harold Freeman-Attwood, Neil Ritchie, Herbert Lumsden, Reginald Denning and Maurice Chilton. Templer's instructors there included Bernard Paget, Henry Pownall and Bernard Montgomery. Due to the Royal Irish Fusiliers being reduced to a single battalion in 1922, and thus promotion in the regiment being slower than in the rest of the army, Templer was forced to transfer to the Loyal Regiment (North Lancashire), to gain a promotion to captain, which was backdated to 11 August 1928.Heathcote, Anthony pg 274 After graduation from the Staff College, Templer joined the 2nd Battalion of his new regiment, then stationed at Aldershot, in January 1930.Cloake, pps. 49–50"]}, {"page": "Lorne MacLaine Campbell", "response": ["On 20 May Campbell was promoted to the acting rank of brigadier and took command of the 13th Infantry Brigade, part of the 5th Infantry Division, then commanded by Major General Horatio Berney-Ficklin. The brigade, a Regular Army formation, was then serving in Syria, later moving to Egypt, before taking part in the Allied invasion of Sicily, from July until mid-August. After a brief rest, the brigade, and the rest of the division (now under Major General Gerard Bucknall), participated in the Allied invasion of Italy, Campbell leading the brigade throughout the 5th Division's involvement in the Italian campaign, seeing service during the Moro River campaign, the Battle of Monte Cassino, and the Battle of Anzio, before leaving Italy in early July 1944 to return to Egypt, later Palestine, to rest and refit. For eight days in April, he was acting General Officer Commanding of the 5th Division, when the division was in the Anzio beachhead, in place of Major General Philip Gregson-Ellis. Relinquishing command of the brigade in September, Campbell ended the war in the United States, in Washington D.C. as a brigadier with the British Army Staff."]}, {"page": "Richard Hull", "response": ["Following the 1st Armoured Division's disbandment, in late November, Hull succeeded Major General Philip Gregson-Ellis as GOC of the 5th Infantry Division, another Regular Army formation, then serving in Palestine. Composed of the 13th, 15th and 17th Infantry Brigades, along with supporting divisional troops, the 5th Division, nicknamed \"The Globe Trotters\" (after having served in nearly every theatre of war), had fought in Sicily and Italy from July 1943 until July 1944 and was resting in Palestine, and was then preparing to return to Italy.", "Promoted to colonel on 13 April 1946, he again succeeded Major General Philip Gregson-Ellis, this time as Commandant of the Staff College, Camberley in May 1946, an assignment appointed to only the most promising officers. Having been promoted again to major general on 13 June 1947, he became Director of Staff Duties at the War Office in September 1948 and Chief Army Instructor at the Imperial Defence College on 1 January 1951. He became chief of staff at headquarters Middle East Land Forces on 26 January 1953. He was appointed GOC British Troops in Egypt on 15 June 1954 and, having been promoted to lieutenant general on 29 September 1954 and advanced to a Knight Commander of the Order of the Bath in the New Year Honours 1956, he became Deputy Chief of the Imperial General Staff on 5 October 1956. He was appointed Commander-in-Chief Far East Land Forces on 25 June 1958 and, having been promoted to full general on 13 February 1959, and advanced to Knight Grand Cross of the Order of the Bath in the Queen's Birthday Honours 1961."]}, {"page": "Staff College, Camberley", "response": ["*1944–1946 Major-General Philip Gregson-Ellis"]}, {"page": "44th (Home Counties) Division", "response": ["The Territorial Army (TA) was formally disbanded at the end of the Second World War. TA units were reactivated on 1 January 1947, though no personnel were assigned until commanding officers and permanent staff had been appointed in March and April 1947. The division, under the command of Major-General Philip Gregson-Ellis, was reformed in 1947; it included the Northamptonshire Yeomanry, and 47th (London), 131st (Surrey), and 133rd (Kent & Sussex) Infantry Brigades."]}, {"page": "Alfred Dudley Ward", "response": ["In early March the 5th Division, now under Major General Philip Gregson-Ellis, was relieved by elements of the newly-arrived US 88th Division and moved to the Anzio beachhead to relieve the exhausted British 56th Division, which had fought alongside the 5th Division during First Cassino, with Ward's brigade relieving the 56th Division's 168th Brigade on 9 March. Ward's 17th Brigade, now on the defensive, was involved in further heavy fighting in \"The Wadis\" on the beachheads' left flank. Conditions at Anzio became more alike to the trench warfare of the First World War. Ward was awarded the Distinguished Service Order in April 1944."]}, {"page": "1st Armoured Infantry Brigade (United Kingdom)", "response": ["* Brigadier Philip Gregson-Ellis (from 24 July 1943 until 18 January 1944)"]}, {"page": "Douglas Wimberley", "response": ["On 31 July 1944 Wimberley's rank of major-general was confirmed (with seniority backdated to 24 December 1943) and, in mid-December, Wimberley relinquished this appointment and, after handing over to Major-General Philip Gregson-Ellis, was appointed Director of Infantry at the War Office, his last appointment in the army, for which he was responsible for infantry training, although his assignment came at a difficult time, with the British Army then suffering from a severe manpower crisis, and the infantry having been forced to accept the worst recruits throughout the war. He held this post until his resignation from the army on 8 October 1946, after a 31-year military career, when it became clear that, with Montgomery having now become CIGS, in succession to Brooke, he would progress no higher in the army."]}, {"page": "Richard McCreery", "response": ["McCreery was appointed adjutant of his regiment in December 1921. He attended the Staff College, Camberley, from 1928 to 1929. His fellow students in the Junior Division there included Gerard Bucknall, Gerald Templer, Alexander Cameron, Alexander Galloway, I. S. O. Playfair, John Harding, Philip Gregson-Ellis and Gordon MacMillan, whilst the instructors included Richard O'Connor, Bernard Paget, Henry Pownall, Harold Franklyn and Bernard Montgomery.Mead 2010, pps. 43–44 He was then appointed brigade major of the 2nd Cavalry Brigade in 1930 and Commanding Officer of his regiment in 1935.Liddell Hart Centre for Military Archives"]}, {"page": "Anzio order of battle", "response": [":* British 5th Infantry Division (Major-General Philip Gregson-Ellis) (from March 1944)"]}, {"page": "Operation Diadem order of battle", "response": [":* British 5th Infantry Division (Major-General Philip Gregson-Ellis)"]}, {"page": "Gordon MacMillan", "response": ["After the war, MacMillan, having gained a Regular commission in 1915, remained in the army, continuing to serve as his battalion's adjutant until December 1920, when the battalion was stationed in Ireland during \"the troubles\".MacMillan 2013, p. 35 He was promoted to captain on 28 August 1924, serving periodically as a company commander before entering the Staff College, Camberley from 1928 to 1929, where among his fellow students there in his year included several future high-ranking officers, such as Alexander Galloway, Gerard Bucknall, John Harding, Richard McCreery, Philip Gregson-Ellis, James Hare, William Holmes, Claude Nicholson, Charles Miller, Charles Murison, Alexander Cameron, Gerald Templer, Thomas Wilson, I. S. O. Playfair and the Australian Leslie Beavis. His instructors included Henry Pownall, Wilfrid Lindsell, Richard O'Connor, Harold Franklyn, Bernard Paget, George Giffard and Bernard Montgomery.MacMillan 2013, p. 39 On 10 August 1929, MacMillan married Marian Blakiston Houston; they had three children.MacMillan 2013, p. 40 He went on to serve successively as captain, staff captain and General Staff Officer Grade 3 (GSO3) in the War Office in the early 1930s."]}, {"page": "Alexander Galloway", "response": ["Remaining in the British Army during the interwar period, Galloway had a number of regimental and staff jobs, serving from 1925 to 1926 as adjutant to the 2nd Battalion, Cameronians. He attended the Staff College, Camberley for a year from January 1928 and graduated in December 1929. His fellow students there included several future general officers such as Richard McCreery, Gerald Templer, John Harding, Gerard Bucknall, William Holmes, Philip Gregson-Ellis, Gordon MacMillan and I. S. O. Playfair. His appointment after graduating was as including appointments as staff captain at HQ Cairo in February 1930 and also as brigade major of the Canal Brigade in EgyptMead, p. 157. from February 1932. He returned to the Staff College, Camberley in February 1937 July 1938Ammentorp as an instructor, and several of his fellow instructors would rise to prominence in the war."]}, {"page": "Phillip Gregson-Ellis", "response": ["#redirect Philip Gregson-Ellis "]}, {"page": "Thomas Needham Furnival Wilson", "response": ["Remaining in the army during the interwar period, Wilson served in Ireland with the 2nd Battalion, KRRC during the Anglo Irish War. He married in 1922 and attended the Staff College, Camberley, from 1928 to 1929. Among his fellow students there included several who would become general officers during the Second World War, such as Gerald Templer, John Harding, Richard McCreery, Gerard Bucknall, Charles Miller, Alexander Galloway, Alexander Cameron, Philip Gregson-Ellis, Charles Murison, Claude Nicholson, William Holmes, I. S. O. Playfair and Gordon MacMillan. After graduating from Camberley Wilson served briefly again with the 2nd Battalion, KRRC before being sent to the War Office, where he served as a General staff Officer Grade 3 (GSO3) from January 1931 until March 1932."]}]}}