{"wiki_id": "http://www.wikidata.org/entity/Q7183770", "itemLabel": "Philip Howard", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Howard_(pianist)", "wikipedia_page": {"main": "Philip Howard (born 1976) is a British-born composer and pianist, at present best known for his performances of music by Morton Feldman and Iannis Xenakis.\nHoward studied in London, at the Royal Academy of Music. Taught to the age of 18 by  Dr Alexander Abercrombie, his teachers at the RAM were Graeme Humphrey and Michael Finnissy.\nHis first success came as a composer, when in 1992 he won joint First Prize in the first BBC Young Musician of the Year Lloyds Bank Composer Award.\nIn 2003 Howard came to wider international recognition after winning First Prize in the Gaudeamus International Interpreters Award, as the first British winner in 35 years.\nRidley Scott's film Prometheus uses on its soundtrack a performance of Chopin's \"Raindrop\" Prelude recorded by Howard.", "link_mentions": [{"page": "1976 in music", "response": ["**Philip Howard, pianist and composer"]}, {"page": "Philip Howard", "response": ["Philip Howard may refer to:", "*Philip Howard, 13th Earl of Arundel (1557–1595), English nobleman and saint", "*Philip Howard (1629–1717), English army officer and Member of Parliament", "*Philip Howard (died 1686) (c. 1631–1686), English soldier and politician", "*Philip Howard (1669–1711), English Member of Parliament for Morpeth and Carlisle", "*Philip Howard (cardinal) (1629–1694), English Roman Catholic cardinal", "*Philip Howard (journalist) (1933-2014), British journalist", "*Philip Howard (pianist) (born 1976), British pianist and composer", "*Philip Howard (Whig politician) (1801–1883), Member of Parliament for Carlisle "]}, {"page": "List of classical pianists", "response": ["* Philip Howard"]}, {"page": "Gaudeamus International Interpreters Award", "response": ["* 2003 Philip Howard (United Kingdom, piano)"]}, {"page": "List of classical pianists (recorded)", "response": ["* Philip Howard"]}, {"page": "Philip Howard, composer and pianist", "response": ["#REDIRECT Philip Howard (pianist)"]}, {"page": "1976 in British music", "response": ["*10 July - Philip Howard, pianist and composer"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Philip Howard (pianist)"]}, {"page": "Paul Whitty", "response": ["His work has been performed by the London Sinfonietta, Ensemble Expose, IXION, Michael Finnissy, [rout], Philip Howard, and Mieko Kanno amongst others, and his music has featured at festivals including Brighton, Ultima in Oslo, the Gaudeamus Music Week in Amsterdam, the Huddersfield Contemporary Music Festival, the 54th Venice Biennale and at State Of The Nation in London. He has received awards, including from the Arts Council of England, AHRC, the Britten-Pears Foundation, and the British Council. Pianist Philip Howard titled his first album, Decoding Skin (2003), after one of his compositions."]}, {"page": "Alexander Abercrombie", "response": ["Abercrombie married Barbara Dix, a British mezzo-soprano, whom he met at Glyndebourne whilst working as a répétiteur. They ran the Independent Academy of Music and Drama, in Southport, for 30 years. A number of their former pupils have gone on to have solo careers including Philip Howard, Andrew Slater and Rosa Mannion."]}]}}