{"wiki_id": "http://www.wikidata.org/entity/Q7182339", "itemLabel": "Phil Roberts", "itemDescription": "Welsh footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Roberts", "wikipedia_page": {"main": "Phillip Stanley Roberts (born 24 February 1950) is a Welsh former professional footballer whose four-club career spanned three decades. Born in Cardiff, Roberts won six Wales Under 23 caps  whilst with his first club Bristol Rovers (where he is still widely regarded\n). In all Roberts was to make 175 appearances for Rovers before moving to Portsmouth in the 1973 close season as part of new chairman John Deacon's ambitious re-building plans. He was to prove such an effective player on the south coast that in 1974 he was awarded four full Welsh caps. Roberts was to hold the right back spot at Fratton Park for four seasons, his final appearance being in the 5–1 thrashing which consigned the club to fourth division football for the first time in their history. A very brief spell with Hereford United followed before another 100-plus stint with Exeter City ended a successful Football League career.", "link_mentions": [{"page": "Ottery St Mary A.F.C.", "response": ["*Phil Roberts"]}, {"page": "The Creepers", "response": ["Riley then recruited ex-Membranes Mark Tilton and Phil Roberts of Shrubs, and carried on as simply \"The Creepers\".  With a more sophisticated sound, the first release under this name was a cover of Brian Eno's \"Baby's on Fire\", with the album Miserable Sinners following later the same year.  After signing to Red Rhino, a further single, \"Brute\" and album Rock 'n' Roll Liquorice Flavour appeared in 1987 and 1988 respectively. Sleeper: A Retrospective followed in 1989."]}, {"page": "Wales national football team results (1960–1979)", "response": ["|UEFA Euro 1976 qualifying || John Toshack, Mike England, Phil Roberts, Arfon Griffiths, Terry Yorath || 10,539"]}, {"page": "Wales at the UEFA European Championship", "response": ["Wales were drawn in Group 2 in qualifying for UEFA Euro 1976, along with Hungary, Austria and Luxembourg; it was the first time they had met Austria or Luxembourg competitively, and their first meeting with Hungary since qualifying for the 1964 European Nations' Cup. Wales began their campaign away to Austria on 4 September 1974 and took the lead through Arfon Griffiths with 10 minutes left in the first half; however, Wilhelm Kreuz and Hans Krankl each scored in the second half to give Austria a 2–1 win. It was Wales' only defeat of their qualifying campaign. Wales responded with consecutive clean sheets against Hungary and Luxembourg; Griffiths and Toshack gave them a 2–0 win over Hungary at Ninian Park on 30 October, before doing so again at the Vetch Field against Luxembourg, where Mike England, Phil Roberts and Terry Yorath also contributed to make the final score 5–0."]}, {"page": "Philip Roberts (disambiguation)", "response": ["*Phil Roberts (born 1950), Bristol Rovers and Portsmouth player of the 1970s"]}]}}