{"wiki_id": "http://www.wikidata.org/entity/Q7184188", "itemLabel": "Philip Palin", "itemDescription": "officer of British Indian army", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Palin", "wikipedia_page": {"main": "Sir Philip Charles Palin  (1864–1937) was an officer of the British Indian Army who served in frontier campaigns and then commanded British, Indian and South African troops in Egypt, Gallipoli and Palestine during World War I. Postwar he investigated Arab–Jewish conflict in Jerusalem.", "link_mentions": [{"page": "Palin Commission", "response": ["The Commission had three members, Major General Sir Philip Palin, who presided, Brigadier General E. H. Wildblood, and Lieutenant Colonel C. Vaughan Edwards and sat for 50 days. It examined 152 witnesses in eight languages (English, French, Arabic, Hebrew, Yiddish, Jargon, Russian and Hindustani), making the process more lengthy than usual."]}, {"page": "75th Division (United Kingdom)", "response": ["On 16 March 1917 the War Office gave the EEF permission to raise a new British division from infantry battalions of the Territorial Force arriving in Egypt as reinforcements from India. These were primarily from the 43rd (Wessex) and 45th (2nd Wessex) divisions, which had sailed to India in 1914 to relieve Regular troops.Becke, Pt 2a, pp 43–48, 55–60. The division was assigned the number 75, and its three infantry brigades the numbers 232, 233 and 234.Becke, Pt 2b, pp. 123–30. Brigadier-General Philip Palin of 29th Indian Brigade was promoted to command the new division.Army List'Major-Gen Sir Philip Palin', Times (London), 23 January 1937.", "* General Officer Commanding: Maj-Gen Sir Philip Palin"]}, {"page": "June 1917", "response": ["* The British Army established the 75th Division under command of Brigadier-General Philip Palin using British, Indian and South African units, including the Palin's former unit, the 29th Indian Brigade."]}, {"page": "Capture of Wadi el Hesi", "response": ["On the eastern side of Gaza, the 75th Division (XXI Corps) commanded by Major General Philip Palin, with the Imperial Service Cavalry Brigade attached, had been ordered to exploit any potential breakthrough. The cavalry brigade, which had been carrying out patrol duties based at Tel el Jemmi, during fighting for the Gaza to Beersheba line,Grainger 2006 p. 145Anon 1920 p. 14 rode through the ruins of Gaza at 09:00. They arrived at Beit Hanun at 13:00, where the Imperial Service Cavalry Brigade encountered part of the Gaza garrison defending a strong rearguard position on a ridge  south-east of Beit Hanun.Preston 1921 pp. 48–9Grainger 2006 pp. 149–50The Imperial Service Cavalry Brigade had served in the Force in Egypt during the defence of the Suez Canal including the Raid on Suez Canal early in 1915. Subsequently they served on the EEF lines of communication before coming under the direct command of Allenby. [Grainger 2006 pp. 128–9]"]}]}}