{"wiki_id": "http://www.wikidata.org/entity/Q7182178", "itemLabel": "Phil Mealey", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Mealey", "wikipedia_page": {"main": "Phil Mealey is a British actor and writer from Stockport.", "link_mentions": [{"page": "The Royle Family", "response": ["The series features simple production values and a stereotypical portrayal of working-class family life at the turn of the millennium. It therefore has something in common with kitchen sink drama. Almost all of the episodes take place in the Royles' home, largely in the telly-centric living room, with the humour derived from the conversations held therein. Aherne and Cash co-wrote every episode, along with Henry Normal (series one), Carmel Morgan (series two), and Phil Mealey (five Christmas specials). The later specials are presented in a more traditional sitcom format. A sixth special episode was set to be written, but Aherne died on 2 July 2016, effectively ending the programme.", "| Caroline AherneCraig CashJohn RushtonPhil Mealey ", "The subsequent sitcom Early Doors was also written by Craig Cash and Phil Mealey and has a similar production style and setting to The Royle Family. Cash also appears in Early Doors."]}, {"page": "Caroline Aherne", "response": ["Following a disagreement with Cash, Aherne moved to Australia, retreating from the press. She wrote Dossa and Joe which was screened on BBC Two in 2002. Although critics applauded it, the show did not attract viewers and did not return for a second series. Returning to Britain, she began work on another sitcom with Cash but pulled out, after which Cash wrote Early Doors with Phil Mealey – Aherne was listed in the credits in the \"Thanks To\" section.", "After Dossa and Joe, Aherne avoided media attention. When The Fast Show was featured on the BBC One show Comedy Connections, Aherne was the only cast member not interviewed. In April 2006, the BBC said Aherne and Cash were developing a script for a one-off special of The Royle Family. The Royle Family: The Queen of Sheba was broadcast on 29 October 2006, to an audience of 7.8 million. Aherne subsequently made few TV appearances. On 14 October 2008 she appeared in the BBC comedy drama Sunshine, written by Cash and Phil Mealey, as a barmaid. She appeared in The Royle Family, The New Sofa on Christmas Day 2008. In 2009, she appeared in a Royle Family special for Comic Relief as well as another Christmas Day special of The Royle Family entitled The Golden Eggcup. She co-wrote the ITV comedy-drama The Fattest Man in Britain, which was broadcast in December 2009."]}, {"page": "Craig Cash", "response": ["He has also written for The Fast Show and for Aherne on The Mrs Merton Show. With Phil Mealey he wrote the BBC sitcom Early Doors. They went on to write the drama Sunshine, filmed in Marple, and first broadcast on BBC One in 2008. They founded the independent production company Jelly Legs, which produced recent Royle Family specials, \"The New Sofa\" and \"The Golden Egg Cup\", as well as Sunshine."]}, {"page": "Early Doors", "response": ["Early Doors is a BBC sitcom written by Craig Cash and Phil Mealey, who also appear in the series playing best friends Joe and Duffy. The setting is The Grapes, a small public house in Stockport where daily life revolves around the issues of love, loneliness and blocked urinals.", "*Joe (Craig Cash) and Duffy (Phil Mealey), real name Nigel - \"The Lads\" of the pub. Best mates Joe and Duffy's friendship goes back to their childhood. Duffy has children, and has been in trouble with his wife for sleeping with other women.", "*Winnie Cooper (Joan Kempson) - Cleaner of The Grapes and the upstairs flat, friends with Jean, and well liked by the regulars. She often makes comments that she knows will irritate Jean and shares all sorts of gossip with her. She has a son called Darren who has been in trouble several times with the law usually for theft. On the DVD commentary for series 1 it's stated that Winnie is the first name of Phil Mealey's mother.", "In June 2018, it was announced that Craig Cash and Phil Mealey had been writing Early Doors Live, a new stage show based on the series. The show was due to open at The Lowry, Salford in August 2018, before a UK arena tour.", "It was said that the show would bring back almost all of the original cast from the TV series, including pub landlord Ken, played by John Henshaw, 13 years on, reflecting many of the changes in the pub world - most noticeably, the smoking ban. Returning cast from the TV series included John Henshaw as Ken, Phil Mealey as Duffy, Craig Cash as Joe, Susan Cookson as Tanya, Lisa Millett as Debbie, Joan Kempson as Winnie, and James Quinn and Peter Wight as policemen Nige and Phil. Also joining the cast were Judith Barker, Vicky Binns, Nick Birkenshaw, Neil Hurst and Laura Woodward."]}, {"page": "Heaton Norris", "response": ["Some of the scenes for the BBC1 comedy drama Sunshine, starring Steve Coogan, Bernard Hill, Craig Cash and Phil Mealey, were filmed in the Nursery Inn, a local pub. Part of an advert for Paddy Power starring Rhodri Giggs was also filmed in Heaton Norris Park."]}, {"page": "Sunshine (British TV series)", "response": ["Sunshine is a three-part comedy drama that began on 7 October 2008 on BBC One, from the co-writers of The Royle Family and Early Doors. These co-writers, Craig Cash and Phil Mealey, also appear in the series."]}, {"page": "British Academy Television Award for Best Scripted Comedy", "response": ["|rowspan=\"4\" style=\"text-align:center;\"|2007 || style=\"background:#B0C4DE;\"|The Royle Family (Special: The Queen of Sheba)  || style=\"background:#B0C4DE;\"|Caroline Aherne, Craig Cash, John Rushton, Phil Mealey || style=\"background:#B0C4DE;\"|BBC One "]}, {"page": "Mealey", "response": ["*Phil Mealey, British actor"]}, {"page": "Neil Hurst", "response": ["In 2018 Neil, and Coronation Street actress Vicky Binns, joined the original cast of Craig Cash's and Phil Mealey's sitcom Early Doors in the live stage version of the show. Neil was playing the role of 'Freddie' (a replacement character for Mark Benton's character, 'Eddie') and toured arenas in the UK after sold out run at The Lowry, Salford. Neil reprised his role at The Lowry for the 2019 production of Early Doors: One More Chance."]}]}}