{"wiki_id": "http://www.wikidata.org/entity/Q7182542", "itemLabel": "Phil Whitehead", "itemDescription": "British footballer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Whitehead", "wikipedia_page": {"main": "Philip Matthew Whitehead (born 17 December 1969) is an English former professional football goalkeeper. He is mainly remembered for his playing days with Oxford United and Reading. At Reading he made some important penalty saves, including one against AFC Bournemouth's Richard Hughes in a 2–1 win and one against Cambridge United's Tom Youngs in a 2–2 draw. He also saved a crucial Scott Minto penalty during a shootout as Reading knocked Premier League side West Ham United out of the 2001–02 League Cup.His career ended after he suffered a major injury playing for Tamworth during an FA Cup fourth qualifying round replay, although he attempted a short-lived comeback when he made one more appearance for Tamworth in an FA Trophy replay against Aldershot Town. He served Brentford as part-time goalkeeping coach during the 2004–05 season.", "link_mentions": [{"page": "Denis Smith (footballer, born 1947)", "response": ["Smith made a return to management with Oxford on 10 September 1993, and the following day led them to a 4–2 victory over his former club Bristol City. A victory over another former club, Stoke, took Oxford off the bottom of the Second Division, but a sequence of just 2 wins in 17 matches left them in great danger of relegation. He signed goalkeeper Phil Whitehead on loan from Barnsley, signed striker John Byrne (£50,000 from Millwall) for the third time in his career, and then made what he later said was the best signing of his career by bringing in defender Matt Elliott from Scunthorpe United for £170,000. Oxford were boosted by these arrivals and briefly exited the relegation zone, also claiming an FA Cup giant-killing over Leeds at Elland Road after Jim Magilton scored the winning goal in extra time. However, after the match Magilton moved to Southampton for a £600,000 fee. Oxford had struggled in the league during their FA Cup run and were 15 points short of safety with 16 matches to play, but were aided by £60,000 signing Paul Moody, who, despite arriving in February 1994, managed to finish as the club's top-scorer with 12 goals in 15 appearances. His arrival kick-started the club's fightback, and Oxford closed the 15 points gap in just 9 matches. However, a difficult run-in left Oxford needing to beat Notts County on the last day of the season and hope results elsewhere went their way, and though they beat County their relegation rivals also claimed victories and Oxford were relegated."]}, {"page": "Jamie Ashdown", "response": ["On 12 September 2000, Ashdown made his league debut for the club, coming on as a 74th-minute substitute for Phil Whitehead, and played the rest of the game, as he kept a clean in a 5–0 win against Oldham Athletic. This turns out to be his only appearance of the 2000–01 season. Ashdown made his first appearance of the 2001–02 season against Colchester United in the Football League Trophy and helped them win 2–1. Following this, he was offered a new contract by Reading. After Whitehead suffered an injury, Ashdown started in goal once again, coming against Chesterfield on 1 December 2001, as the club lost 1–0. Following this, he signed a contract extension with Reading, keeping him until 2004. Ashdown appeared in the next two matches before the arrival of Marcus Hahnemann and the recovery of Whitehead saw him return to the substitute bench. At the end of the 2001–02 season, he made four appearances in all competitions. Following his loan spell at AFC Bournemouth came to an end, Ashdown returned as the club's second choice goalkeeper for the rest of the 2002–03 season. But he made his an appearance against Grimsby Town on 5 October 2002 and kept a clean sheet, in a 3–0 win."]}, {"page": "2001 Football League Second Division play-off Final", "response": ["The match was refereed by Eddie Wolstenholme in front of a crowd of 50,496.   Reading took the lead through Jamie Cureton half an hour into the game with a volley that crept over the line having struck Jimmy Walker in the Walsall goal.  The half ended with the score 1–0 to Reading. Three minutes into the second half, Walsall levelled the game after Don Goodman scored from an Andy Tillson header.  With the score 1–1 after 90 minutes, the match went into extra time.  Less than a minute into the first half of extra time, Martin Butler's header from a James Harper throw-in put Reading 2–1 ahead.  In the 107th minute, substitute Tony Rougier was credited with an own goal after a clearance from Barry Hunter deflected off him into the Reading goal. Two minutes later, Ian Brightwell passed to Darren Byfield who turned and scored with a low shot which beat Phil Whitehead in the Reading goal. The match ended 3–2 and Walsall were promoted to the First Division.", "Less than a minute into the first half of extra time, Butler's header from a Harper throw-in found the back of the Walsall net to put Reading 2–1 ahead.  Midway through the half, Walsall made a triple substitution, Paul Hall, Leitão and Bennett being replaced by Matt Gadsby, Darren Byfield and Gábor Bukrán respectively.  In the 107th minute, Rougier was credited with an own goal after a clearance from Hunter deflected off him into the Reading goal.  Two minutes later, Ian Brightwell passed to Byfield who was  away from goal.  He turned and advanced on goal, and struck a low shot which beat Phil Whitehead in the Reading goal. The match ended 3–2 and Walsall were promoted to the First Division.", "|GK ||1 ||Phil Whitehead"]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Phil Whitehead||||1992||6||0||"]}, {"page": "2003–04 Reading F.C. season", "response": ["| Phil Whitehead"]}, {"page": "2002–03 Reading F.C. season", "response": ["| Phil Whitehead"]}, {"page": "2001–02 Reading F.C. season", "response": ["| Phil Whitehead", "|1 ||GK||||1 ||Phil Whitehead||15||1||2||0||18"]}, {"page": "2000–01 Reading F.C. season", "response": ["| Phil Whitehead", "|GK ||1 || Phil Whitehead", "|1 ||GK||||1 ||Phil Whitehead||16||1||1||0||0||18", "|1 ||||GK||Phil Whitehead||0||0||0||0||2||0||0||0||0||0||2||0"]}, {"page": "1999–2000 Reading F.C. season", "response": ["| Phil Whitehead", "| Phil Whitehead", "|2 ||GK||||27||Phil Whitehead||3||0||0||0||3", "|27||||GK||Phil Whitehead||2||0||0||0||0||0||0||0||2||0"]}, {"page": "Whitehead (surname)", "response": ["*Phil Whitehead (born 1969), English footballer"]}]}}