{"wiki_id": "http://www.wikidata.org/entity/Q7183297", "itemLabel": "Philip Burlamachi", "itemDescription": "British banker", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Burlamachi", "wikipedia_page": {"main": "Philip Burlamachi (1575 – 1644) was a major financial intermediary of King Charles I of England, and is remembered as the inventor of the concept of a central bank. \nBurlamachi was born Sedan, France. His family was of Italian origin, exiled descendants of the Lucchese Francesco Burlamacchi. He is known to have been in England for at least 30 years (since at least 1605) where he became naturalised by an Act of Parliament.He worked extensively with his brother in law Philip Calandrini who was his financial representative in Amsterdam; for example, in 1626 Philip offered to stand as guarantor for £58,400 for Charles 1. In 1621 Burlamachi acted on behalf of the City of London Merchants, collecting money from foreign merchants and transferring it to the Privy Council. \"Whereas you have undertaken the collecting of such moneys as were thought reasonable and meet for the merchants strangers residing within the City of London and the outports, to contribute towards the expedition against pirates.\" He was entrusted the sum of £30,000 on behalf of the Privy Council with bills of exchange for the service of an army for the States of the United Provinces or 'direct the employment them as he shall think'.One thing that is certain and clear is the importance of Philip Burlamachi in regards to money and finance and his idea (the first of its kind) although he himself did concede \"the proposal has been formerly made.\" Burlamachi’s idea was a national clearing bank: the first known proposal for a central bank, where the word bank is first used for \"a bank for the payment of all large sums of which shall be negotiated\". The idea was originally discussed in the year 1636 and 58 years later, in 1694, the Bank of England was first formed.\nBurlamachi is also known for financing the East India Company. and as Postmaster of Foreign posts from 1637 to 1642.During the Anglo-French War (1627-1629), Burlamachi loaned Charles I the sum of £70,000, though the king's inability to repay him caused him to go bankrupt in 1633.", "link_mentions": [{"page": "Bank of England", "response": ["The establishment of the bank was devised by Charles Montagu, 1st Earl of Halifax, in 1694. The plan of 1691, which had been proposed by William Paterson three years before, had not then been acted upon. \"Its foundation in 1694 arose out the difficulties of the Government of the day in securing subscriptions to State loans. Its primary purpose was to raise and lend money to the State and in consideration of this service it received under its Charter and various Act of Parliament, certain privileges of issuing bank notes. The corporation commenced, with an assured life of twelve years after which the Government had the right to annul its Charter on giving one year's notice. Subsequent extensions of this period coincided generally with the grant of additional loans to the State\". 58 years earlier, in 1636, Financier to the king, Philip Burlamachi, had proposed exactly the same idea in a letter addressed to Sir Francis Windebank.Calendar Of State Papers Domestic Series p. 73 1636–1637. He proposed a loan of £1.2 million to the government; in return the subscribers would be incorporated as The Governor and Company of the Bank of England with long-term banking privileges including the issue of notes. The royal charter was granted on 27 July through the passage of the Tonnage Act 1694.H. Roseveare, /The Financial Revolution 1660–1760/ (1991, Longman), pp. 34. Public finances were in such dire condition at the time that the terms of the loan were that it was to be serviced at a rate of 8% per annum, and there was also a service charge of £4,000 per annum for the management of the loan. The first governor was Sir John Houblon, who is depicted in the £50 note issued in 1994. The charter was renewed in 1742, 1764, and 1781."]}, {"page": "Postmaster General of the United Kingdom", "response": ["|1637–1642||Philip Burlamachi "]}, {"page": "Edward Misselden", "response": ["Two years later (1635) abortive attempts were made to obtain his election as deputy-governor at Rotterdam, and Charles I addressed a letter to the Merchant Adventurers' Company vainly recommending them to deprive Robert Edwards who was in the post. Behind this lay the fact that Missenden had furnished Philip Burlamachi with large sums for the king's service, and in May 1633, £13,000 remained unpaid."]}, {"page": "Phillip Burlamachi", "response": ["#redirect Philip Burlamachi "]}, {"page": "Clearing house (finance)", "response": ["Clearing houses were first proposed in 1636 by Philip Burlamachi, financier to Charles I of England."]}, {"page": "Abraham Harderet", "response": ["Rachel Fontaine was a relation of Jehanne Hersent, the wife of Abraham Aurelle the minister of the French Church on Threadneedle Street. In October 1613 she was a witness at the christening of their daughter Jahel, with Abraham van Delden and Jaél de Peigne, widow of Sir Henry Killigrew. Rachel's daughter Elizabeth Harderet married Caesar Calandrini, a minister of the Italian church in London, from Lucca. Her sister-in-law Elizabeth Calandrini was the wife of the financier Philip Burlamachi.W. Moens & T. Colyer-Fergusson, The Registers of the French Church, Threadneedle Street, London (Lymington, 1896), p. 91: 'Will of Rachell Hardrett, Widow of Blackfriars, City of London', 13 February 1628, PROB 11/153/203."]}]}}