{"wiki_id": "http://www.wikidata.org/entity/Q7182343", "itemLabel": "Phil Robinson", "itemDescription": "English footballer and manager (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Robinson_(footballer,_born_1967)", "wikipedia_page": {"main": "Philip John Robinson (born 6 January 1967) is an English former footballer who played as a midfielder for Aston Villa, Wolverhampton Wanderers, Notts County, Birmingham City, Huddersfield Town, Northampton Town, Chesterfield, Stoke City, Hereford United and Stafford Rangers. He is Manchester City's international youth scouting and recruitment manager.", "link_mentions": [{"page": "Stafford", "response": ["*Phil Robinson (born 1967) Recruitment Manager at Manchester City, former footballer, with 567 pro appearances mainly for Notts County, Huddersfield Town, Stoke City, Hereford United and Stafford Rangers.Soccerbase Database  Retrieved December 2017"]}, {"page": "1993–94 Huddersfield Town A.F.C. season", "response": ["|Phil Robinson||||MF||39||1||2||0||3||0||6||0||50||1"]}, {"page": "1992–93 Huddersfield Town A.F.C. season", "response": ["|Phil Robinson||||MF||35 (1)||4||6||1||1||1||2||0||44 (1)||6"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Phil Robinson||||1992–1994||74 (1)||5||8||1||4||0||8||0||0||0||94 (1)||6"]}, {"page": "1998–99 Stoke City F.C. season", "response": ["Chief executive Jez Moxey predicted that Stoke would lose around £1 million a year through being in the Second Division, such was the price Stoke had to pay after poor financial mismanagement on moving to the Britannia Stadium. In an attempt to retain fan interest, season ticket prices were frozen and chairman Keith Humphreys apologised for the past nine months of \"bloody awful football\" and he also appealed to the supporter group S.O.S (Save Our Stoke) to lift their ban on season tickets and merchandise. SOS wanted to starve out the current board and force them to sell in order to breathe fresh life back into the club. It came as a welcome surprise then when chairman Keith Humphreys appointed former Aston Villa manager Brian Little. Accepting that there was hardly any money available, Little signed players from the lower leagues such as Bryan Small, Phil Robinson and David Oldfield.", "|align=\"left\"|DF||align=\"left\"| Phil Robinson"]}, {"page": "1999–2000 Stoke City F.C. season", "response": ["|align=\"left\"|4||align=\"left\"|DF||align=\"left\"| Phil Robinson"]}, {"page": "Philip Robinson", "response": ["Philip or Phil Robinson may refer to:", "*Phil Robinson (footballer, born 1942) (1942–1989), English professional footballer", "*Phil Robinson (footballer, born 1967), English professional footballer", "*Phil Robinson (cricketer) (born 1963), English cricketer", "*Phil Robinson, Australian bassist of The Cockroaches", "*Phil Robinson, drummer with Autopilot Off", "* Phil Robinson (politician), American politician and member of the Ohio House of Representatives", "* Phil Robinson (born 1978), Faster than Barry Allen"]}, {"page": "1995 Football League Third Division play-off Final", "response": ["The match, refereed by Paul Alcock, was played in front of 22,814 spectators.  Chesterfield won the match 2–0 with first-half goals from Tony Lormor and Phil Robinson to gain promotion back to the third tier of English football five seasons after being relegated. For the club's manager, John Duncan, it was his second success with Chesterfield as a manager, having won the Fourth Division title in 1985. His counterpart, Mike Walsh, parted company with Bury less than four months later.", "Chesterfield faced Mansfield Town in their semi-final and the first leg was played at Field Mill in Mansfield.  After a goalless first half, Phil Robinson gave Chesterfield the lead in the 64th minute after out-pacing the Mansfield Town defence and scoring past Darren Ward in goal. Stewart Hadley levelled the score eight minutes later when he struck from the edge of the Chesterfield penalty area after the defence failed to clear a free kick, and the match ended 1–1.  The second leg took place at Saltergate in Chesterfield three days later.  Paul Holland gave Mansfield the lead after three minutes with a header before Tony Lormor equalised midway through the first half.  Steve Wilkinson then restored Mansfield's lead with a goal on 32 minutes but Robinson equalised and regular time ended by the score at 2–2, and 3–3 on aggregate, sending the game into extra time.  Kevin Lampkin was sent off for Mansfield before Nicky Law scored from a penalty.  Mark Peters was then also dismissed, leaving Mansfield with nine players, and further strikes from Jonathan Howard and Robinson made the final score 5–2 with Chesterfield progressing to the final with a 6–3 aggregate victory.", "|WG ||7 ||Phil Robinson"]}, {"page": "Luke Hubbins", "response": ["Prior to the 2010–11 season, Hubbins joined Notts County, newly promoted to League One, on trial. He was recommended by Birmingham Academy coach, and former player for both clubs, Phil Robinson. The trial was successful and the player joined on loan until 18 January 2011, linking up with Birmingham teammate Jake Jervis, also on loan at County. Hubbins made his debut for the club on 24 August 2010 in the starting eleven for the Football League Cup second-round tie away to Watford. He played 59 minutes as his club won 2–1. He started in the Football League Trophy defeat to Sheffield Wednesday the following week, but made no more first-team appearances before the loan expired."]}, {"page": "Phil Robinson (footballer born 1967)", "response": ["#REDIRECT Phil Robinson (footballer, born 1967)"]}, {"page": "1990 Football League Third Division play-off Final", "response": ["The match was refereed by Roger Milford.  Notts County dominated the early stages of the match with Bartlett having two shots saved within the first 15 minutes and took the lead in the 31st minute through cross from Kevin Bartlett found Tommy Johnson whose low strike beat Eric Nixon in the Tranmere goal.  In the 63rd minute, a free kick played in by Phil Robinson reached Craig Short at the far post who headed it in to make the score 2–0.  The final whistle brought the game to a close with Notts County 2–0 winners and gaining promotion to the Second Division.", "The match kicked off around 3p.m. at Wembley Stadium on 27 May 1990 in front of 29,252 spectators.  Notts County dominated the early stages of the match with Bartlett having two shots saved within the first 15 minutes.  They took the lead in the 31st minute: a cross from Bartlett found Johnson whose low strike beat Nixon in the Tranmere goal.  No changes were made by either side to their personnel at half-time.  Bartlett then beat Nixon to the ball and attempted to lob it into the net but Steve Vickers  cleared it.  Steve Cherry, the Notts County goalkeeper, was forced to tip Jim Steel's header over the bar.  In the 63rd minute, a free kick played in by Phil Robinson reached Craig Short at the far post who headed it in to make the score 2–0.  With 13 minutes of the game remaining, Johnson ran through the Tranmere defence and was fouled by Steve Mungall and a free kick was awarded. Vickers was shown a yellow card for dissent, claiming it should have been a penalty. Johnson's set piece beat the wall but Nixon pushed the ball onto the goalpost.  David Fairclough was then brought on to replace Mungall and his first significant contribution was to head the ball wide of the goal from  following a McNab cross.  Late in the match, Shaun Garnett was booked for a foul on Lund before the final whistle brought the game to a close with Notts County 2–0 winners and gaining promotion to the Second Division.", "|6 ||Phil Robinson"]}]}}