{"wiki_id": "http://www.wikidata.org/entity/Q719680", "itemLabel": "Michael Kenna", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Kenna_(photographer)", "wikipedia_page": {"main": "Michael Kenna (born 1953) is an English photographer best known for his unusual black and white landscapes featuring ethereal light achieved by photographing at dawn or at night with exposures of up to 10 hours. His photos concentrate on the interaction between ephemeral atmospheric condition of the natural landscape, and human-made structures and sculptural mass.\nMany books have been published of his work, the subjects of which range from The Rouge, in Dearborn Michigan, to the snow-covered island of Hokkaido, Japan. Kenna's work is also held in permanent collections at the Bibliothèque Nationale, Paris, The National Gallery of Art, Washington DC, Tokyo Metropolitan Museum of Photography, and the Victoria and Albert Museum in London.", "link_mentions": [{"page": "Michael Kenna (politician)", "response": ["Michael Kenna (August 20, 1857 – October 9, 1946), also known as \"Hinky Dink\", was an American politician who served as alderman of Chicago's 1st Ward from 1897 to 1923 and again from 1939 to 1943. In addition to his position as alderman he was committeeman of the 1st Ward for the Democratic Party from 1893 to 1944. Representing the Chicago Loop and later its environs in such capacities, he led what was often called the \"world's richest ward\". He and his partner, fellow 1st Ward alderman \"Bathhouse John\" Coughlin, controlled the ward for most of the first half of the 20th century.", "Michael Kenna was born in the late 1850s to Catherine ( Ferrel) and John Kenna, both immigrants from County Cork. He was born at the corner of Polk and Sholto (modern-day Carpenter) streets at the edge of \"Connelly's Patch\" on Chicago's Near West Side. At age 10 he left school and began selling newspapers. At age 12, by then an orphan, he borrowed $50 from a barkeeper and purchased a newsstand at the corner of Monroe and Dearborn Streets. He was so successful that he was able to pay back the loan within a month, and would sell newspapers at the stand until 1877. According to legend, it was at this time that Kenna got the nickname \"Hinky Dink\" from Chicago Tribune publisher Joseph Medill due to his small stature; as an adult he stood  tall. Kenna variously professed ignorance of the nickname's origin or claimed that it arose at \"th' old swimming hole.\" He was also known as \"the little fellow\". In 1879 he moved to Leadville, Colorado, to work for a newspaper in the area, returning to Chicago in 1881."]}, {"page": "List of photographers", "response": ["* Michael Kenna (born 1953)"]}, {"page": "1953 in art", "response": ["** Michael Kenna, English landscape photographer"]}, {"page": "Night photography", "response": ["By the 1990s, British-born photographer Michael Kenna had established himself as the most commercially successful night photographer. His black-and-white landscapes were most often set between dusk and dawn in locations that included San Francisco, Japan, France, and England. Some of his most memorable projects depict the Ford Motor Company's Rouge River plant, the Ratcliffe-on-Soar Power Station in the East Midlands in England, and many of the Nazi concentration camps scattered across Germany, France, Belgium, Poland and Austria.", "* Michael Kenna"]}, {"page": "Thomas Tulis", "response": ["* In 2003, Tulis was chosen to be part of Wait Until Dark along with Lewis Baltz, Harvey Caplin, Todd Hido, David Leventhal, William Greiner, Michael Kenna, O. Winston Link, Richard Misrach, Jules Shulman, George Tice and Henry Wessel, Jr. The exhibition took place at The Williams College Museum of Art, Fresno, California. The photographers for this exhibit were selected from the photography collection of Jay Richard DiBiaso."]}, {"page": "Norton Museum of Art", "response": ["* Wesley Stringer, nominated by Michael Kenna"]}, {"page": "St Joseph's College, Up Holland", "response": ["*Michael Kenna (b. 1953), artist, photographer", "*Michael Kenna's images of St Joseph's in his book \"Boarding school\""]}, {"page": "Widnes", "response": ["* Michael Kenna (born 1953 in Widnes) an English photographer best known for his unusual black & white landscapes"]}, {"page": "Kenna (disambiguation)", "response": ["*Michael Kenna (politician) (1857–1946), Chicago politician (\"Hiny Dink\" Kenna)", "*Michael Kenna (photographer) (born in 1953), British photographer"]}, {"page": "Higashikawa Prize", "response": ["| Michael Kenna"]}, {"page": "Mohammadreza Mirzaei", "response": ["In 2006, Mirzaei did a photo series called Humans, which has been exhibited in 4 solo shows in Iran, Turkey, UAE and RussiaThe artistic face of Iran. an interview with Mohammadreza Mirzaei as well as in some group exhibitions in Australia and Italy. Michael Kenna has acclaimed this photo series by an essay : Mr. Mirzaei, with reserved sensibility, kindly provides us with an opportunity to quietly reflect and consider the reasons for our existence. It is a worthy subject to ponder, and this is a worthy group of photographs.Michael Kenna's article on Humans  Mirzaei's photographs have been also credited by his compatriot photographer Mitra Tabrizian, who admired the surreal quality and the sense of isolation in his works."]}, {"page": "Désert de Retz", "response": ["Other visitors include Colette, Jean Cocteau, Elsie de Wolfe, Olga Carlisle, Jacques Prevert and others including the photographers Jerome Zerbe, Raymond Lécuyer, Suzanne La Font, Geoffrey James, Osvald Siren, Emmanuelle Gaboryand, and Michael Kenna. It also inspired Collette's Paradis Terrestre."]}, {"page": "Landscape photography", "response": ["* Michael Kenna (British)"]}, {"page": "List of members of the Ordre des Arts et des Lettres", "response": ["|Michael Kenna|| style=\"background:#c96;\"|Chevalier||2000"]}, {"page": "Forgiveness (2008 film)", "response": ["The film's story is told through a series of narratives from a fictional memoir of the period, illustrated with archival footage provided by the Auschwitz-Birkenau State Museum, Oświęcim, Poland, additional archive material from the Jewish Historical Institute, and photographs of the concentration camp ruins by Michael Kenna. Some of the film's archival footage comes from the same sources used in the French short film Night And Fog."]}, {"page": "William Greiner", "response": ["In 2003, Greiner's work was selected to be part of 'Wait Until Dark'  along with Lewis Baltz, Todd Hido, David Levinthal, Thomas Tulis, Michael Kenna, O. Winston Link, Richard Misrach,  George Tice and Henry Wessel, Jr. The exhibition took place at The Williams College Museum of Art, Williamstown, Massachusetts."]}, {"page": "Anne Fontaine Foundation", "response": ["The 2016 edition featured photographers like Sebastião Salgado, Michael Kenna, Sarah Moon, Antoine Verglas, Claudia Jaguaribe, Pamela Hanson, André Rau and many others, that have been supporting the foundation since the first edition. Among the photographers who joined the 2016 edition are Andrew Moore, Beth Moon from the US, Vincent Rosenblatt, Julia Kater, Valdir Cruz, Oskar Metsavaht, from Brazil and Christophe d’Yvoire from France.Sotheby's - Anne Fontaine Trees in Focus Charity Auction"]}, {"page": "Margaret W. Weston", "response": ["Over the years Weston became a shrewd and obsessive collector, buying both then little-known prints from 19th century photographers and important images from 20th century masters of the art. She was an early collector of Jerry Uelsmann, Ralph Gibson, Michael Kenna, Joel-Peter Witkin and Adam Fuss, and she helped build their reputations by placing their work in important corporate collections like the Gilman Paper Company, Pacific Bell, Mitsubishi, and the Southland Corporation. She also advised the curators at the Museum of Modern Art, San Francisco Museum of Modern Art and the Victoria and Albert Museum."]}, {"page": "Friends of Photography", "response": ["In addition to the exhibitions, the Friends regularly held educational workshops, seminars, photographic technique classes and scholarly conferences. The first was held in 1967, and by 1975 they were presenting about 8-10 per year. During the first 20 years most of these events were held in Carmel, but some took place in San Francisco, Los Angeles, Pacific Grove, Tucson, Seattle and Orcas Island, Washington. Among those who taught at these events over the years were James Alinder, Morley Baer, Lewis Baltz, Ruth Bernhard, Peter Bunnell, William Christenberry, Linda Connor, Imogen Cunningham, Lee Friedlander, Emmet Gowin, Michael Kenna, Annie Leibovitz, Sally Mann, Duane Michals, Richard Misrach, Lisette Model, Wright Morris, Bea Nettles, Arnold Newman, Anne Noggle, Bill Owens, Olivia Parker, Sylvia Plachy, John Sexton, Henry Holmes Smith and Jack Welpott."]}, {"page": "Ray McSavaney", "response": ["For some Southwest subjects, McSavaney frequently resorted to high key printing.  In that rendition, he faced a somewhat different technical problem by the need to further compress the subject tonal range into the three highest tonal values the paper could take. In order for it to work, he had to visualize the final print, then properly expose his negative to enable him to print it in the limited high-key tonal range; that is, he had to plan the complete end-to-end process in some detail.  In those situations Adams' Zone System is most effective.  Having learned at the feet of the master, McSavaney utilized Adams' principles of image management and value management to control the complete process. In Adams' explanation, such control allows a photographer to \"visualize the different possible renderings of a subject at the film plane, and manage the image in such a way as to achieve the desired photographic interpretation.\"Adams, Ansel, (1980)\" - Ch 7\"Ansel Adams, (1983)\" - p176 Easy as pie!. Applying Adams’ instructional approach in critiquing students’ work,Adams, 1980 - Ch 5 McSavaney's workshops attracted generations of large-format photographers. His non-judgmental evaluations of their photographs were authentic learning experiences. At times, he invited other well-known photographers as workshop instructors – for examples Paul Caponigro, Michael Kenna and his former OVPW colleague John Sexton. Occasionally he invited talented writers and artists as joint instructors in his workshop program. A frequent participant was writer John Nichols, another the Santa Fe artist Carol Rose Brown, each a highly acclaimed practitioner of Southwestern themes.  He well knew that their differing insights and viewpoints would enrich his students’ experiences.  Some of his students had successful photography careers; among them the Los Angeles medical doctor  Bernard Lewinsky and a sometime companion in the Southwest, Ken Karagozian (see below)."]}, {"page": "John Wood (poet)", "response": ["Wood authored of over a dozen volumes of photographic history and criticism, including America and the Daguerreotype, which was selected as a 1992 \"Outstanding Academic Book of the Year\" by the American Library Association, and Secrets of the Dark Chamber, which the New York Times named a Best Book of the Year in 1995. In 1988, Wood co-founded the Dageurreian Society and was its first president. He contributed many articles to the Dageurreian Annual and co-curated the Smithsonian Institution's landmark 1995 exhibition Secrets of the Dark Chamber. He also contributed to the National Museum of American Art's exhibition Silver and Gold: Photographs of the Gold Rush. His early research and criticism focused on the Daguerreotype and cyanotype but came to include other photographic processes, including the  Autochrome Lumière, and increasingly focused on contemporary photographers like Sally Mann and Joel-Peter Witkin. He wrote the forwards of more than thirty photography monographs, including work by the artists Jan Saudek, Keith Carter and Connie Imboden and edited more than forty-five monographs of leading photographers such as Masao Yamamoto, Jerry Uelsmann and Michael Kenna. In addition, Wood contributed essays to and wrote the catalog copy for dozens of books of photography, featuring work by artists Jock Sturges, Imogen Cunningham and John Dugdale."]}, {"page": "Longview Museum of Fine Arts", "response": ["Since its foundation in 1958, the LMFA has been physically located at five different sites. Jane Akins, one of the women involved with the museum at its inception, noted that the Junior Service League members would transport paintings from site to site themselves in their personal station wagons. On January 17, 1998, the LMFA's current location on Tyler Street in downtown Longview opened with a workshop and lectures by photographers Ruth Bernhard and Michael Kenna, after the building had been renovated the previous year."]}, {"page": "Michael Kenna", "response": ["Michael Kenna may refer to", "* Michael Kenna (politician) (1857-1946), American politician", "* Michael Kenna (photographer) (born 1953), English photographer"]}]}}