{"wiki_id": "http://www.wikidata.org/entity/Q7194882", "itemLabel": "Pinch", "itemDescription": "dubstep artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Pinch_(dubstep_musician)", "wikipedia_page": {"main": "Rob Ellis, better known as Pinch, is a British dubstep artist from Bristol, England, noted for his fusion of styles such as reggae, World music, and dancehall with dubstep. He released his first album, Underwater Dancehall in 2007, on Tectonic, which he founded. One of Pinch's most well-known tracks is \"Qawwali\", released on Planet Mu records, which references the devotional singing of the same name, and featured samples of harmonium and singer Nusrat Fateh Ali Khan. His songs appear on compilations such as Box of Dub: Dubstep and Future Dub 2  (Soul Jazz Records), Science Faction: Dubstep (Breakbeat Science Recordings), 10 Tons Heavy (Planet Mu) and 200 (Planet Mu). More recently, he has moved away from dubstep towards the UK bass scene, working with producers such as Mumdance and Adrian Sherwood.\n\n", "link_mentions": [{"page": "Planet Mu", "response": ["As the new decade began, Planet Mu began to release jungle and breakcore records from artists such as 0=0, Tim Exile and Shitmat. Later in the decade, Paradinas moved towards grime and dubstep, signing artists such as Boxcutter, Milanese, Mr. Mitch, Pinch, Vex'd and Virus Syndicate. In 2006, the label released three Warrior Dubz compilations curated by Mary Anne Hobbs. In the 2010s, Planet Mu changed direction again, releasing the footwork compilation Bangs & Works Vol. 1 which featured DJ Rashad and brought the Chicago genre to wider attention. Bangs & Works Vol. 2 came out the following year and launched the career of Jlin."]}, {"page": "Pinch", "response": ["Pinch or pinching may refer to:", "* Pinch (action), to grip an object or substance between two fingers. ", "* Pinch (unit), a very small amount of an ingredient, typically salt or a spice", "* Pinch (whisky) or Haig's Pinch, brand of Scotch whisky", "* Pinch, Indiana, an unincorporated community", "* Pinch, West Virginia,  a census-designated place in Kanawha County", "* Pinch (plasma physics), the compression of a plasma filament by magnetic forces, or a device which uses this effect for magnetic fusion energy", "* Pinching is a multi-touch gesture, done by squeezing one's fingers on a touchscreen", "* Pinch point (economics), the level of inventory below which consumers become concerned about security of supply", "* Pinch point (mathematics), a type of singular point on an algebraic surface", "* Pinch analysis, a methodology for minimising energy consumption of chemical processes", "* The Pinch, a literary journal published at University of Memphis", "* Pinched, a 1917 film starring Harold Lloyd", "* Tom Pinch and Ruth Pinch, characters in the novel Martin Chuzzlewit by Charles Dickens", "* Doctor Pinch, character in The Comedy of Errors by William Shakespeare", "* Pinch (film), a 2019 animated short film by Diego Maclean", "* Pinch (drummer) (born Andrew Pinching, born 1965), drummer for punk band The Damned", "* Pinch (dubstep musician) (born Rob Ellis, born 1980), electronic musician who produces dubstep", "* Colin Pinch (1921–2006), Australian cricketer", "* John Pinch the elder (1769–1827), British architect in Bath", "* John Pinch the younger (1796–1849), British architect in Bath", "* Trevor Pinch (born 1952), British sociologist at Cornell University", "* Frank Pinch (1891–1961), English cricketer", "* William Pinch (born 1940), mineralogist from Rochester, New York", "* Evelyn Pinching (1915–1988), British alpine skier", "* William Wyatt Pinching (1851–1878), rugby union international who represented England in 1872", "* Pinch Thomas (1888–1953), backup catcher in Major League Baseball", "* Pinch hitter (baseball), a substitute batter", "* Pinch hitter (cricket), a batsman (not a substitute) promoted up the batting order ", "* Pinch runner, a baseball player substituted for a player on base", "* John Pinch (disambiguation)", "* Pinch point (disambiguation)"]}, {"page": "Adrian Sherwood", "response": ["He produced the original score for the 2006 independent film Johnny Was, starring Vinnie Jones, Roger Daltrey and Samantha Mumba. Since 2015, Sherwood has been recording with Bristol dubstep artist Pinch; they have released two albums under the moniker \"Sherwood and Pinch\"."]}, {"page": "Solid Steel", "response": ["Pinch,"]}, {"page": "Dubstep", "response": ["After releasing 12-inch singles on Big Apple, they founded DMZ Records, which has released fourteen 12\"s to date. They also began their night DMZ, held every two months in Brixton, a part of London already strongly associated with reggae. DMZ has showcased new dubstep artists such as Skream, Kode 9, Benga, Pinch, DJ Youngsta, Hijak, Joe Nice, and Vex'd. DMZ's first anniversary event (at the Mass venue, a converted church) saw fans attending from places as far away as Sweden, the United States, and Australia, leading to a queue of 600 people at the event. This forced the club to move from its regular 400-capacity space to Mass' main room, an event cited as a pivotal moment in dubstep's history. Later Mala would also found the influential label Deep Medi Musik.", "In the summer of 2005, Forward>> brought grime DJs to the fore of the line up. Building on the success of Skream's grimey anthem \"Midnight Request Line\", the hype around the DMZ night and support from online forums (notably dubstepforum.com) and media, the scene gained prominence after Radio 1 DJ Mary Anne Hobbs gathered top figures from the scene for one show, entitled \"Dubstep Warz\", (later releasing the compilation album Warrior Dubz). The show created a new global audience for the scene, after years of exclusively UK underground buzz. Burial's self-titled album appearing in many critics' \"Best of ...\" lists for the year, notably The Wire's Best Album of 2006. The sound was also featured prominently in the soundtrack for the 2006 sci-fi film Children of Men, which included Digital Mystikz, Random Trio, Kode 9, Pressure and DJ Pinch. Ammunition also released the first retrospective compilation of the 2000–2004 era of dubstep called The Roots of Dubstep, co-compiled by Ammunition and Blackdown on the Tempa Label."]}, {"page": "Fabric discography", "response": ["*FABRICLIVE.61 - Pinch (January 2012)"]}, {"page": "Children of Men", "response": ["A number of dubstep tracks, most notably Anti-War Dub by Digital Mystikz, as well as tracks by Kode9 & The Space Ape, Pinch and Pressure are also featured."]}, {"page": "List of music artists and bands from England", "response": ["**Pinch"]}, {"page": "Children of Men soundtracks", "response": ["Several songs that are heard during the movie, such as \"Total State Machine\" by Test Dept, \"Omgyjya Switch7\" by Aphex Twin, \"Anti War Dub\" by Digital Mystikz, \"War Dub\" by Pinch and \"Life in a Glasshouse\" by Radiohead are not included on the soundtrack. Furthermore, the tracks \"Map of the Problematique\" by Muse, \"Gimme Shelter\" by The Rolling Stones, and \"Hoppípolla\" by Sigur Rós were used in TV spots and trailers but were not featured in the film. Former Pulp frontman Jarvis Cocker's song \"Running the World\" is played in the credits of the film."]}, {"page": "List of dubstep musicians", "response": ["* Pinch"]}, {"page": "Shackleton (musician)", "response": ["In 2011, Shackleton collaborated with Pinch on the album Pinch & Shackleton, released on Honest Jon's Records. That same year, Shackleton and Vengeance Tenfold were commissioned by SoundUK to create a \"Sonic Journey\" inspired by sections of two Devon \"train lines – part of the main line between Exeter and Totnes, and a section of the Tarka Line between Exeter and Barnstaple.\"", "*Pinch & Shackleton (2011), Honest Jon's Records – with Pinch"]}, {"page": "Way Out West (festival)", "response": ["*Swamp 81 (Pinch, Mickey Pearce, Loefah & McChunky, Boddika)"]}, {"page": "Distance (musician)", "response": ["*Twilight/V (Pinch remix) (2009)", "*Clockwork/One Blood, One source (Distance remix) (with Pinch) (2009)"]}, {"page": "Evangeline (Mary Anne Hobbs compilation)", "response": ["#Pinch: \"E.Motiv\" (5:28)", "#Pinch: \"E.Motiv\" (5:28)"]}, {"page": "Pinch (artist)", "response": ["#REDIRECT Pinch (dubstep musician)"]}, {"page": "Pinch (dubstep artist)", "response": ["#REDIRECT Pinch (dubstep musician)"]}, {"page": "Tectonic (record label)", "response": ["Tectonic  is a British electronic music label, founded and run by Rob Ellis (Pinch) \"Tectonic Records Biography\"], IMO Records, Retrieved on 12 December 2011. which focuses primarily on dubstep and its related genres. As one of the founding dubstep labels, alongside Tempa, DMZ, Hyperdub, and Hotflush, Tectonic became a focal point for the Bristol scene, as well as introducing artists and releases that were among the first to bridge a gap between dubstep and techno.", "Alongside releases from artists such as Skream, Benga, Digital Mystikz & Joker, Tectonic has also been responsible for some of the scene's  albums - particularly, 2562's Unbalance and Pinch's Underwater Dancehall.", "|War Dub / Alien Tongue||Pinch & P Dutty||TEC001||12\"||2005", "|One Blood, One Source / Trauma||Pinch||TEC017||12\"||2007", "|Underwater Dancehall (Instrumentals)||Pinch||TEC018||12\"||2007", "|Underwater Dancehall (Album)||Pinch||TECCD003||CD||2007", "|Midnight Oil / Joyride||Pinch||TEC024||12\"||2008", "|False Flag / Junktion (Shed Remix)||Pinch & Moving Ninja / Peverelist||TEC028||12\"||2009", "|Get Up (Single)||Pinch ft. Yolanda||TECCD007||CD||2009", "|The Boxer||Pinch||TEC040||12\"||2010", "|Broken / Paranormal Activity||Pinch / Loefah / Roska||TEC048||12\"||2011", "|Shoulda Rolla / Asbestos||Pinch, Roska||TEC070||12\"||2013"]}, {"page": "Music of the United Kingdom (2000s and 2010s)", "response": ["Dubstep developed from garage music at the end of the 1990s and in the early 2000s, using elements of drum'n'bass, techno, and dub, to produce a largely instrumental, \"dark\" sound, based around relatively simple rhythms and often with extended hypnotic mixes.[ \"Dubstep\"], Allmusic, retrieved 30 April 2010. Its origins centred around the London Forward>> club nights and it was disseminated through pirate radio shows. Major artists included Skream, Burial, Kode9, Pinch, Horsepower Productions, Vex'd, Digital Mystikz, Zomby, Shackleton and Benga. Releases like Burial's Untrue (2007) and the mix albums series Dubstep All-Stars helped the subgenre gain critical and some limited commercial success."]}, {"page": "Multiverse Music", "response": ["From 2004-2008, Multiverse was responsible for seminal releases from artists such as Pinch, 2562, Vex'd, Skream, emptyset,  Joker and Pinch's Tectonic (one of the first Dubstep labels) is now recognised as having played a significant role in the genres worldwide growth and success.", "* Pinch - Underwater Dancehall"]}, {"page": "FabricLive.56", "response": ["#  Pinch - Qawwali - Planet Mu"]}, {"page": "List of 2012 albums", "response": ["| Pinch"]}, {"page": "Emika", "response": ["Emika, a classically trained musician who studied classical piano and composition, grew up in Milton Keynes, England. She started to make music at school (using an old sequencer program she found on a computer stashed in a cupboard) and waitressed to save up for her first Apple Mac and copy of Logic Studio. Emika received her Music Technology degree in Bath, then procured an internship at the offices of the London label Ninja Tune, where she worked for a month. As Bristol music scene was making a transition from drum and bass to dubstep, she went to the first parties organised by Pinch.", "Ninja Tune appreciated Emika's new, dark, downtempo dubstep direction and in January 2010, released \"Drop the Other\" as her debut single, which has also found its way into the label's 20th anniversary box set. Since 2009, Emika has appeared on tracks with the likes of Pinch, Kryptic Minds, Paul Frick and MyMy. Her second single \"Double Edge\" came out in May 2010 to be followed by \"Count Backwards\" (April 2011) and \"Pretend/Professional Loving\", the latter came out in September 2011, and was remixed by Brandt Brauer Frick, Kyle Hall and DJ Rashad.", "Emika has collaborated with artists and producers such as Tommy Four Seven, Pinch, Nick Hoppner, Paul Frick, (Brandt Brauer Frick), Amon Tobin and Marcel Dettmann (with whom she co-produced a song for his artist album). She has recorded with the City of Prague Philharmonic Orchestra and in 2014 she revealed plans to create a full orchestral symphony.", "* 2010: \"2012\" (Pinch & Emika, Tectonic)"]}, {"page": "FabricLive.61", "response": ["FabricLive.61 is a 2012 DJ mix album by Pinch. The album was released as part of the FabricLive Mix Series. The mix signalled a shift away from Pinch's earlier dubstep sound, moving towards house and techno."]}, {"page": "Unclassified (Adult Swim album)", "response": ["# Pinch – \"Blow Out The Candle\""]}, {"page": "Pinch & Shackleton", "response": ["Pinch & Shackleton is a 2011 album by Pinch and Shackleton.", "At Metacritic, which assigns a normalised rating out of 100 to reviews from mainstream critics, Pinch & Shackleton received an average score of 84, based on 7 reviews, indicating \"universal acclaim\".", "* Pinch & Shackleton at the official Honest Jon's Records website"]}, {"page": "Emptyset", "response": ["Ginzburg and Purgas began Emptyset in 2005 to explore their shared interests in rhythmic music and bass. Both have backgrounds within Bristol's club music scene: Ginzburg runs Multiverse, a studio complex and collective of record labels that initiated (among others) Pinch's Tectonic and Subtext, which has released many of Emptyset's earlier releases. He also produces club tracks as 'Ginz'. Purgas, who now lives in London, has a history in art and sound art curation, a background in techno, and curates exploratory electronic music events under the banner 'We Can Elude Control'."]}, {"page": "Merry Christmas Mr. Lawrence (instrumental)", "response": ["Part of the song is also pastiched in the theme song to the video game International Karate, written by Rob Hubbard. Japanese post-hardcore band Fact recorded a track by the title Merry Christmas, Mr. Lawrence on their self-titled album. Tokyo Brass Style, a Japanese Big Band recorded a cover of the title theme for their fifth album, 'Brass Style Xmas'. Sherwood & Pinch released a version of the song on their 2017 LP Man vs Sofa."]}, {"page": "Loefah", "response": ["| Broken/Paranormal Activity (with Pinch and Roska) || Tectonic || 2011 || 12\"/Digital"]}, {"page": "Deep Medi Musik", "response": ["* Pinch"]}, {"page": "Addison Groove", "response": ["One of Addison Grooves most well known tracks 'Foot Crab'  was later released on Dubstep legend Loefah's label 'Swamp 81' and features cut up samples influenced by the Chicago 'Juke' sound. He has also released on Tectonic (owned by fellow Bristolian dubstep head honcho Pinch), 50 Weapons (of Modeselektor fame) and 3024."]}, {"page": "Lex Johnson", "response": ["Johnson was responsible for design collaborations with dubstep / techno artists such as Appleblim, Headhunter, Pinch, Komonazmuk, Joker (Kapsize) and 2562. The most notable being an Audio Visual live show with Headhunter (Tempa) now called Addison Groove. He also directed music videos for Appleblim and Addison Groove. The most notable was 'Changa' which premiered on the Adult Swim YouTube Channel  and gained official selection status and was nominated for awards at Aesthetica, London Short Film Festival, Berlin Music Video Awards, The Smalls, Stockholm Independent Film Festival.  His work has been mentioned in books including: Dubstep Graphics and Contemporary Colour Theory. Artwork has been featured in Vice  Adult Swim  Tech Crunch  and includes collaborations with musician Tinie Tempah."]}, {"page": "Flow Festival line-ups", "response": ["Saturday: Arch of Neo, Desto, Pinch"]}, {"page": "Vector Meldrew", "response": ["Vector was responsible for design collaborations with dubstep / techno artists such as Appleblim, Headhunter, Pinch, Komonazmuk, Joker (Kapsize) and 2562. The most notable being an Audio Visual live show with Headhunter (Tempa) now called Addison Groove. He also directed music videos for Appleblim and Addison Groove. The most notable was 'Changa' which premiered on the Adult Swim YouTube Channel  and gained official selection status and was nominated for awards at Aesthetica, London Short Film Festival, Berlin Music Video Awards, The Smalls, Stockholm Independent Film Festival.  His work has been mentioned in books including: Dubstep Graphics and Contemporary Colour Theory. Artwork has been featured in Vice  Adult Swim  Tech Crunch  and includes collaborations with musician Tinie Tempah."]}]}}