{"wiki_id": "http://www.wikidata.org/entity/Q719572", "itemLabel": "Garry Birtles", "itemDescription": "Footballer and manager (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Garry_Birtles", "wikipedia_page": {"main": "Garry Birtles (born 27 July 1956) is an English retired footballer who played as a forward in the Football League between the 1970s and 1990s. He is best known for his time at Nottingham Forest, during which he won the 1979 and 1980 European Cup Finals. He was also capped three times by England.", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["Peter Taylor on 16 July 1976 rejoined Clough becoming his Assistant Manager as he had been when winning the league at Derby. Taylor included being the club's talent spotter in his role. After assessing the players Taylor told Clough \"that was a feat by you to finish eighth in the Second Division because some of them are only Third Division players\". Taylor berated John Robertson for allowing himself to become overweight and disillusioned. He got Robertson on a diet and training regime that would help him become a European Cup winner. Taylor turned Woodcock from a reserve midfielder into a 42 cap England striker. In September 1976 he bought striker Peter Withe to Forest for £43,000, selling him to Newcastle United for £250,000 two years later. Withe was replaced in the starting team by Garry Birtles who Taylor had scouted playing for non-league Long Eaton United. Birtles also went on to represent England. In October 1976 Brian Clough acting on Peter Taylor's advice signed Larry Lloyd for £60,000 after an initial loan period.", "|1979|| Garry Birtles"]}, {"page": "Brian Clough", "response": ["On 16 July 1976 Peter Taylor rejoined Clough, becoming his Assistant Manager, which he had been when winning the league at Derby. Taylor included being the club's talent spotter in his role. After assessing the players Taylor told Clough \"that was a feat by you to finish eighth in the Second Division because some of them are only Third Division players\". Taylor berated John Robertson for allowing himself to become overweight and disillusioned. He got Robertson on a diet and training regime that would help him become a European Cup winner. Taylor turned Woodcock from a reserve midfielder into a 42 cap England striker. In September 1976 he bought striker Peter Withe to Forest for £43,000, selling him to Newcastle United for £250,000 two years later. Withe was eventually replaced in the starting team by Garry Birtles who Taylor had scouted playing for non-league Long Eaton United. Birtles also went on to represent England. In October 1976 Brian Clough acting on Peter Taylor's advice signed Larry Lloyd for £60,000 after an initial loan period."]}, {"page": "Long Eaton", "response": ["*Garry Birtles (born 1956), professional footballer, joined Nottingham Forest FC from Long Eaton United and won two European Cups."]}, {"page": "Grimsby Town F.C.", "response": ["|1990|| Garry Birtles || John McDermott", "|  Garry Birtles", "* Garry Birtles", "* Garry Birtles"]}, {"page": "Peter Withe", "response": ["Withe and Woodcock won the 1977-78 Football League First Division and 1977-78 Football League Cup with Forest. They ended the season as Forest's joint top scorers with 19 goals each. Withe scored in the 1978 FA Charity Shield 5–0 win against Ipswich Town on 12 August 1978. After playing in the 1–1 league home draw the week after against Tottenham Hotspur, Forest agreed to sell him for £225,000 just before his 27th birthday at the end of that month. Withe scored 39 goals in 99 competitive first team games for Forest. This included 28 goals in 75 league games. His place in the next 3 games was given to league debutant, Steve Elliott all of which ended goalless.\"SEASON: 1978–79\" The City Ground The number 9 jersey was then given to 22 year old Garry Birtles who promptly became regular first choice winning the European Cup with Forest this and the season after.\"GARRY BIRTLES\""]}]}}