{"wiki_id": "http://www.wikidata.org/entity/Q7198553", "itemLabel": "Pit Corder", "itemDescription": "language scholar from England (1918-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pit_Corder", "wikipedia_page": {"main": "Stephen Pit Corder (6 October 1918 – 27 January 1990), generally known as Pit Corder, was a professor of applied linguistics at Edinburgh University, known for his contribution to the study of error analysis. He was the first Chair of the British Association for Applied Linguistics, 1967–70, and was instrumental in developing the field of applied linguistics in the United Kingdom.\n\n", "link_mentions": [{"page": "Lapine language", "response": ["Within the books, the rabbits' use of Lapine is presented to readers as Standard English with the inclusion of a number of specialized Lapine lexical terms. Albert Valdman notes that inter-rabbit Lapine is alternately formal and colloquial \"marked by hesitations, interruptions, interjections, incomplete sentences, and false starts\". Pit Corder breaks this down further, finding that the Lapine spoken by the rabbits consists of 64% simple sentences, 14% compound sentences (with 30% paratactic and 70% marked coordination), and 22% complex sentences. The mean Lapine sentence length is 6.3 words."]}, {"page": "Second-language acquisition", "response": ["SLA research began as an interdisciplinary field; because of this, it is difficult to identify a precise starting date. However, two papers in particular are seen as instrumental to the development of the modern study of SLA: Pit Corder's 1967 essay The Significance of Learners' Errors and Larry Selinker's 1972 article Interlanguage. The field saw a great deal of development in the following decades. Since the 1980s, SLA has been studied from a variety of disciplinary perspectives, and theoretical perspectives. In the early 2000s, some research suggested an equivalence between the acquisition of human languages and that of computer languages (e.g. Java) by children in the 5 to 11 year age window, though this has not been widely accepted amongst educators.  Significant approaches in the field today are systemic functional linguistics, sociocultural theory, cognitive linguistics, Noam Chomsky's universal grammar, skill acquisition theory and connectionism."]}, {"page": "Interlanguage", "response": ["The idea that language learners' linguistic systems were different from both their L1 and L2 was developed independently at around the same time by several different researchers. William Nemser called it an approximative system and Pit Corder called it transitional competence."]}, {"page": "List of University of Leeds people", "response": ["*Pit Corder, professor and applied linguist (1961-1964)"]}, {"page": "List of language acquisition researchers", "response": ["* Pit Corder"]}]}}