{"wiki_id": "http://www.wikidata.org/entity/Q719533", "itemLabel": "Victor Feldman", "itemDescription": "English recording artist; jazz musician, vibraphonist", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Feldman", "wikipedia_page": {"main": "Victor Stanley Feldman (7 April 1934 – 12 May 1987) was an English jazz musician who played mainly piano, vibraphone, and percussion. He began performing professionally during childhood, eventually earning acclaim in the UK jazz scene as an adult. Feldman emigrated to the United States in the mid-1950s, where he continued working in jazz and also as a session musician with a variety of pop and rock performers.", "link_mentions": [{"page": "Miles Davis", "response": ["In December 1962, Davis, Kelly, Chambers, Cobb, and Rollins played together for the last time as the first three wanted to leave and play as a trio. Rollins left them soon after, leaving Davis to pay over $25,000 (US$ in  dollars) to cancel upcoming gigs and quickly assemble a new group. Following auditions, he found his new band in tenor saxophonist George Coleman, bassist Ron Carter, pianist Victor Feldman, and drummer Frank Butler. By May 1963, Feldman and Butler were replaced by 23-year-old pianist Herbie Hancock and 17-year-old drummer Tony Williams who made Davis \"excited all over again\". With this group, Davis completed the rest of what became Seven Steps to Heaven (1963) and recorded the live albums Miles Davis in Europe (1964), My Funny Valentine (1965), and Four & More (1966). The quintet played essentially the same bebop tunes and standards that Davis's previous bands had played, but they approached them with structural and rhythmic freedom and occasionally breakneck speed."]}, {"page": "Vince Guaraldi", "response": ["| Nonet; with Conte Candoli (trumpet), Milton Bernhart (trombone), Herb Ellis (guitar), Monty Budwig, Peter Marshall (bass), Jack Sperling, Jerry Granelli (drums), Victor Feldman (percussion); music and dialogue version (no longer in print); nominated for an Academy Award for Best Original Song Score", "| Nonet; with Conte Candoli (trumpet), Milton Bernhart (trombone), Herb Ellis (guitar), Monty Budwig, Peter Marshall (bass), Jack Sperling, Jerry Granelli (drums), Victor Feldman (percussion); complete soundtrack; limited released of 1,000 copies", "* 1959 Latinsville! (Victor Feldman)", "|Octet; with Herb Ellis (guitar), Monty Budwig (bass), Conte Candoli (trumpet), Pete Candoli (trumpet), Frank Rosolino (trombone), Victor Feldman (percussion), Jack Sperling (drums)", "| Nonet; with Conte Candoli (trumpet), Milton Bernhart (trombone), Herb Ellis (guitar), Monty Budwig, Peter Marshall (bass), Victor Feldman (percussion), Jack Sperling, Jerry Granelli (drums)"]}, {"page": "Marimba", "response": ["Brian Jones played a marimba in the Rolling Stones' songs \"Under My Thumb\" and \"Out of Time\". \"Island Girl\" by Elton John and \"Moonlight Feels Right\" by Starbuck also prominently feature the instrument. Ruth Underwood played an electrically amplified marimba in Frank Zappa's The Mothers of Invention. Art Tripp played the marimba on several of Captain Beefheart & the Magic Band's albums, most notably on Lick My Decals Off, Baby and The Spotlight Kid. Victor Feldman played a marimba on several of Steely Dan's early albums. It is played at the start of \"Mamma Mia\" by ABBA and also played by Mike Mainieri in the Dire Straits track \"Private Investigations\".", "The beginning of the Steely Dan track Rikki Don't Lose That Number features Victor Feldman playing the flapamba, but his contribution was cut from the original ABC single version."]}, {"page": "List of percussionists", "response": ["* Victor Feldman"]}, {"page": "Edgware", "response": ["*Victor Feldman — jazz pianist"]}, {"page": "Steely Dan", "response": ["Becker and Fagen recruited a diverse group of session players for Katy Lied (1975), including Porcaro, Paich, and McDonald, as well as guitarist Elliott Randall, jazz saxophonist Phil Woods, saxophonist/bass-guitarist Wilton Felder, percussionist/vibraphonist/keyboardist Victor Feldman, keyboardist (and later producer) Michael Omartian, and guitarist Larry Carlton—Dias, Becker, and Fagen being Steely Dan's only original members. The album went gold on the strength of \"Black Friday\" and \"Bad Sneakers\", but Becker and Fagen were so dissatisfied with the album's sound (compromised by a faulty DBX noise reduction system) that they publicly apologized for it (on the album's back cover) and for years refused to listen to it in its final form. Katy Lied also included \"Doctor Wu\" and \"Chain Lightning\".", "Featuring Michael McDonald's backing vocals, \"Peg\" (No. 11) was the album's first single, followed by \"Josie\" (No. 26) and \"Deacon Blues\" (No. 19). Aja solidified Becker's and Fagen's reputations as songwriters and studio perfectionists. It features such jazz and fusion luminaries as guitarists Larry Carlton and Lee Ritenour; bassist Chuck Rainey; saxophonists Wayne Shorter, Pete Christlieb, and Tom Scott; drummers Steve Gadd, Rick Marotta and Bernard Purdie; pianist Joe Sample and ex-Miles Davis pianist/vibraphonist Victor Feldman and Grammy award-winning producer/arranger Michael Omartian (piano)."]}, {"page": "Christopher Cross (album)", "response": ["* Victor Feldman – vibraphone (3, 4), percussion (3, 7, 8)"]}, {"page": "List of vibraphonists", "response": ["* Victor Feldman"]}, {"page": "Cannonball Adderley", "response": ["The new quintet, which later became the Cannonball Adderley Sextet, and Cannonball's other combos and groups, included such noted musicians as saxophonists Charles Lloyd and Yusef Lateef, pianists Bobby Timmons, Barry Harris, Victor Feldman, Joe Zawinul, Hal Galper, Michael Wolff, and George Duke, bassists Ray Brown, Sam Jones, Walter Booker, and Victor Gaskin, and drummers Louis Hayes and Roy McCurdy."]}, {"page": "Swordfishtrombones", "response": ["*Victor Feldman – bass marimba (1:1–2), marimba (1:2, 2:3), shaker (1:2), bass drum with rice (1:2), bass boo bams (1:3), Brake drum (1:5), bell plate (1:5), snare (1:5, 2:4), Hammond B-3 organ (1:7), snare drum (1:7), bells (1:7), conga (2:3), bass drum (2:3), Dabuki drum (2:3), tambourine (2:4), African talking drum (2:7)"]}, {"page": "Joe Zawinul", "response": ["* Victor Feldman, Soviet Jazz Themes (Äva, 1962)"]}, {"page": "Shelly Manne", "response": ["Manne led a number of small groups that recorded under his name and leadership. One consisting of Manne on drums, trumpeter Joe Gordon, saxophonist Richie Kamuca, bassist Monty Budwig, and pianist Victor Feldman performed for three days in 1959 at the Black Hawk club in San Francisco. Their music was recorded on the spot, and four LPs were issued. Highly regarded as an innovative example of a \"live\" jazz recording,Gioia, pp. 280-81. the Black Hawk sessions were reissued on CD in augmented form years later."]}, {"page": "Herb Ellis", "response": ["With Victor Feldman"]}, {"page": "Scott LaFaro", "response": ["Beginning in 1955, he was a member of the Buddy Morrow big band. He left that organization to work in Los Angeles. LaFaro spent most of his days practicing his instrument. He practiced from sheet music for the higher-pitched clarinet to improve his facility the upper register for bass. Fellow bassist Red Mitchell taught him how to pluck strings with both the index and middle fingers independently. For much of 1958, LaFaro was with pianist/vibraphonist Victor Feldman's band.", "With Victor Feldman", "* The Arrival of Victor Feldman (Contemporary, 1958)"]}, {"page": "Pretzel Logic", "response": ["* Victor Feldman – percussion"]}, {"page": "Can't Buy a Thrill", "response": ["* Victor Feldman – percussion"]}, {"page": "Aja (album)", "response": ["#*Victor Feldman – Fender Rhodes", "#*Victor Feldman – percussion", "#*Victor Feldman – Fender Rhodes", "#*Victor Feldman, Gary Coleman – percussion", "#*Victor Feldman – piano, vibraphone", "#*Victor Feldman – piano, vibraphone, percussion", "#*Victor Feldman – Fender Rhodes"]}, {"page": "Countdown to Ecstasy", "response": ["* Victor Feldman – vibraphone, marimba, percussion"]}, {"page": "One from the Heart (album)", "response": ["* Victor Feldman – timpani on \"You Can't Unring a Bell\""]}, {"page": "Katy Lied", "response": ["* Victor Feldman – vibraphone, percussion"]}, {"page": "Heartattack and Vine", "response": ["* Victor Feldman – percussion, chimes, glockenspiel"]}, {"page": "The Royal Scam", "response": ["* Victor Feldman – percussion, keyboards"]}, {"page": "Gaucho (album)", "response": ["* Victor Feldman – percussion (2)"]}, {"page": "Harold Land", "response": ["With Victor Feldman"]}, {"page": "Frank Rosolino", "response": ["* Victor Feldman, Vic Feldman on Vibes(Mode, 1957)", "* Victor Feldman, Latinsville! (Contemporary, 1964)"]}, {"page": "100 Club", "response": ["In 1942, the venue was a restaurant called Macks, which was hired out beginning 24 October every Sunday evening by Robert Feldman at £4 per night to host a jazz club featuring swing music. The initial line-up of the Feldman Swing Club advertised in Melody Maker included Frank Weir, Kenny Baker and Jimmy Skidmore, with guest artists the Feldman Trio, composed of Feldman's children, including then eight-year-old jazz drummer Victor Feldman.", "The club's clientele included American GIs, who introduced jitterbug to the club, banned at most other music venues. Patrons included Glenn Miller, who auditioned young Victor Feldman, and the club hosted many top American jazz acts, including Mel Powell, Ray McKinley, Art Pepper, and Benny Goodman. Bebop as well as swing was featured. British musicians such as Ronnie Scott and Johnny Dankworth performed there. The club became a mecca for black musicians from the British Empire, such as Frank Holder, Coleridge Goode and Ray Ellington."]}, {"page": "Nat Adderley", "response": ["With Victor Feldman"]}, {"page": "Al McKibbon", "response": ["With Victor Feldman"]}, {"page": "Roots (1977 miniseries)", "response": ["*Bill Summers, Bobbye Hall, Caiphus Semenya, Emil Richards, King Errison, Milt Holland, Paul Bryant, Shelly Manne, Tommy Vig, Victor Feldman, Zak Diouf − percussion"]}, {"page": "Leroy Vinnegar", "response": ["With Victor Feldman"]}, {"page": "John R. Cash", "response": ["*Ron Tutt, Reini Press, David Foster, Larry Muhoberac, Ron Elliot, Ry Cooder, James Burton, Russ Thelman, Jerry Cole, Victor Feldman, Joe Porcaro, Gene Estes, Nick DeCaro, Gene Cipriano – musicians in Los Angeles"]}, {"page": "Greatest Hits (James Taylor album)", "response": ["*Victor Feldman - orchestra bells, vibes (track 11)"]}, {"page": "In the Pocket (James Taylor album)", "response": ["* Victor Feldman – orchestra bells (1), vibraphone (1), percussion (3), marimba (8), bass marimba (8), cymbal (8), wind chimes (8)"]}, {"page": "Gorilla (James Taylor album)", "response": ["* Victor Feldman – percussion (9, 10), marimba (11)"]}, {"page": "The Best of James Taylor", "response": ["*Victor Feldman – vibes, orchestra bells (on \"Shower the People\")"]}, {"page": "The Wrecking Crew (music)", "response": ["Rick Nelson used many Wrecking Crew members in various combinations, mostly  during the mid-1960s, including Earl Palmer, Joe Osborn, James Burton, Tommy Tedesco, Howard Roberts, Billy Strange, Al Casey, Dennis Budimir, Glen Campbell, Don Randi, Mike Melvoin, Ray Pohlman, Chuck Berghofer, Victor Feldman, Frank Capp, and Jim Gordon.Nelson, Rick,  Rick Nelson: Legacy, Box set, Capitol Records Inc., 72435-29521-2-0,  Hollywood, CA, 2000, liner notes", "Other drummers who played in the Wrecking Crew were Frank Capp, John Clauder, and Joe Porcaro.  Gary Coleman played vibraphone and a variety of percussion instruments and contributed to works such as the soundtrack of the musical Hair and Simon & Garfunkel's Bridge Over Troubled Water album.  Some of the other Wrecking Crew percussionists were Julius Wechter, Milt Holland, Gene Estes, and Victor Feldman.  Drummer Jim Keltner is sometimes mentioned in connection with the Wrecking Crew, because he befriended Hal Blaine in the 1960s and would later play with the Wrecking Crew on John Lennon's Rock 'n' Roll album recorded in 1973, but he is more often associated with the later generation of session players who eclipsed the Wrecking Crew in terms of popularity during the 1970s.", "* Percussion: Larry Bunker, Frank Capp, Gary L. Coleman, Gene Estes, Victor Feldman, Milt Holland, Joe Porcaro, Julius Wechter – Note: though not usually mentioned as an actual member of the Wrecking Crew, Sonny Bono contributed percussion to some of their sessions for Phil Spector. Max Weinberg in his book \"The Big Beat\" does include Bono in a list of members of the Wrecking Crew as \"percussion\" and Bono appears in the photograph labeled, \"The Wrecking Crew\" on p. 79 of the book.Weinberg, Max. The Big Beat: Conversations with Rock's Great Drummers\" Billboard Books, Watson-Guptill Publications, New York, 1991 p.76, & p.79"]}]}}