{"wiki_id": "http://www.wikidata.org/entity/Q719046", "itemLabel": "Norman Lebrecht", "itemDescription": "English author, broadcaster, music critic, cultural commentator", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Lebrecht", "wikipedia_page": {"main": "Norman Lebrecht (born 11 July 1948) is a British music journalist and author who specializes in classical music. He is best known as the owner of the classical music blog, Slipped Disc, where he frequently publishes articles. Unlike other writers on music, Lebrecht rarely reviews concerts or recordings, preferring to report on the people and organizations who engage in classical music. Described by Gilbert Kaplan as \"surely the most controversial and arguably the most influential journalist covering classical music\", his writings have been praised as entertaining and revealing, while others have accused them of sensationalism and criticized the frequent errors in them.\nHe was a columnist for The Daily Telegraph from 1994 to 2002, and assistant editor of the London Evening Standard from 2002 to 2009.  On BBC Radio 3, Lebrecht presented lebrecht.live beginning in 2000, and The Lebrecht Interview from 2006 to 2016. He also writes a column for the magazine Standpoint. \nIn additions to writings on the classical music industry, Lebrecht has written 12 books on music. His novels include The Song of Names (2001) and The Game of Opposites: A Novel (2009); the former won a 2002 Whitbread Award and was adapted into a film of the same name directed by François Girard.", "link_mentions": [{"page": "July 11", "response": ["*  1947   – Norman Lebrecht, English author and critic"]}, {"page": "Pierre Boulez", "response": ["In its obituary, The New York Times reported that \"about his private life he remained tightly guarded\". Boulez acknowledged to Joan Peyser that there was a passionate affair in 1946, described as \"intense and tormented\" and which Peyser suggested was the trigger for the \"wild, courageous works\" of that period.Peyser (1976), 33–34 and 113. After Boulez's death, his sister Jeanne told the biographer Christian Merlin that the affair was with the actress Maria Casarès, but Merlin concludes that there is little evidence to support this.Merlin, 42–44. The author and blogger Norman Lebrecht, who knew Boulez, speculated that he was gay, citing the fact that for many years he shared his home in Baden-Baden with Hans Messner, whom he sometimes referred to as his valet.Lebrecht, 183. In his portrait for The New Yorker, published shortly after Boulez's death under the title The Magus, Alex Ross described him as \"affable, implacable, unknowable\"."]}, {"page": "Michael Tippett", "response": ["In 1982, in his comparative study of Britten and Tippett, Whittall asserted that \"it would be difficult to claim that any of the works [Tippett] has begun in his seventies are the equal of earlier compositions\".Whittall (1982), p. 292 Although both Driver and Whittall later modified their opinions,Wright, p. 221 such comments represented a general view among critics that Tippett's creative powers had begun to decline after the triumph of King Priam. This perception was strongly expressed by Derek Puffett, who argued that the decline followed Tippett's abandonment of myth—seen as the key to the success of The Midsummer Marriage and King Priam—and stemmed from his increasingly futile efforts to universalise his private agonies and express them musically. Despite his admiration for the early works, Puffett consigned Tippett \"to the ranks of those noble but tragic composers who have lived beyond their time\". The  critic Norman Lebrecht, writing in 2005, dismissed almost all Tippett's output, labelling him \"a composer to forget\". With the forthcoming centenary celebrations in mind, Lebrecht wrote: \"I cannot begin to assess the damage to British music that will ensue from the coming year's purblind promotion of a composer who failed so insistently to observe the rules of his craft\"."]}, {"page": "Vienna Philharmonic", "response": ["The Vienna Philharmonic was for decades accused of withholding or suppressing information about its connections in the mid-20th century to the Nazi Party.Georgina Prodhan, \"Vienna Philharmonic lifts lid on Nazi history\", Reuters, 9 March 2013 The first orchestral representative to discuss the issue was Clemens Hellsberg (also trained as a musicologist), when he wrote the orchestra's official sesquicentennial history, Demokratie der Könige (Democracy of Kings).Clemens Hellsberg, Demokratie der Könige – Die Geschichte der Wiener Philharmoniker, Zurich, Schweizer Verlagshaus; Wien, Kremayr & Scheriau; Mainz, Musikverlag Schott; 1992, p. 464 In it he determined that at the end of World War II 47% of orchestra members belonged to the Nazi Party or affiliates (the total number is now known to be 49%), that upon the Anschluss thirteen Jewish players were fired, that six of them were murdered (the number is now known to be seven), and \"that the VPO once gave a concert in an SS barracks.\"Norman Lebrecht, \"Beautiful music does not drown out shameful history of the past\", The Jewish Chronicle Online, 15 March 2013 But more remained to be investigated and made public, and access to relevant material in the orchestra's archives was highly restricted. Hellsberg, who became the orchestra's president in 1997, did not have full access to the archives until 2000/2001,James R. Oestreich, \"Orchestra to Disclose Its Nazi Past\", The New York Times, 28 February 2013 and the historian Fritz Trümpi reports that when he began researching the orchestra's Third Reich activities in 2003 and requested access, he \"was rebuffed by the management of the orchestra with a firm 'no' ... the idea that external researchers could come and root around in their archive was long considered taboo.\"Fritz Trümpi, \"The Vienna Philharmonic's Nazi past: lifting the veil of deliberate ignorance\", The Guardian, 17 March 2013 Trümpi was granted access in 2007, but other researchers reported continued exclusion, such as Bernadette Mayrhoffer in 2008;NewsA/T, \"Ausstellung zum Anschluss: Staatsoper stellt sich der eigenen Vergangenheit\", 10 March 2008 the Austrian newspaper Die Presse reported in 2008Anne-Catherine Simon, \"Hellsberg unter Beschuss: 'Absurd und infam'\", Die Presse, 5 March 2008 (in Sebastian Huebel's summary) that \"scholars have had difficulties investigating the Vienna Philharmonic as they were not allowed access to the archives, or sources were delivered reluctantly and with timely delays.\"Sebastian Huebel, The Reichsorchester – A Comparison of the Berlin and Vienna Philharmonics during the Third Reich, Master's thesis, Department of History, University of Victoria, 2009, p. 9"]}, {"page": "Arturo Toscanini", "response": ["* At the point where Puccini left off writing the finale of his unfinished opera, Turandot: \"Here Death triumphed over art\". (Toscanini then left the opera pit, the lights went up and the audience left in silence.).Mosco Carner, Puccini, 1974; Howard Taubman, Toscanini, 1951; quoted in Norman Lebrecht, The Book of Musical Anecdotes"]}, {"page": "Conducting", "response": ["* Norman Lebrecht: The Maestro Myth: Great Conductors in Pursuit of Power (2nd revised and updated edition, New York: Citadel Press, 2001)."]}, {"page": "Daniel Barenboim", "response": ["Barenboim, a supporter of human rights, including Palestinian rights, is an outspoken critic of Israel's conservative governments and the Israeli occupation of the Palestinian territories. In an interview with the British music critic Norman Lebrecht in 2003, Barenboim accused Israel of behaving in a manner that was \"morally abhorrent and strategically wrong\" and \"putting in danger the very existence of the state of Israel\". In 1967, at the start of the Six-Day War, Barenboim and du Pré had performed for the Israeli troops on the front lines, as well as during the Yom Kippur War in 1973. During the Gulf War, he and an orchestra performed in Israel in gas masks."]}, {"page": "Franz Lehár", "response": ["Gustav Mahler and his young wife Alma went to see Lehár's The Merry Widow in Vienna and loved it so much that they danced to its tunes as soon as they were home. From memory they played the waltz on the piano, but could not remember the exact run of one passage. The next day they went to Vienna's main music shop , but hesitated to admit that they were looking for the score of what would be considered a \"popular\" operetta. While Mahler distracted the staff by questioning them about the sales of his own compositions, Alma browsed through the music score of The Merry Widow. As soon as they were out on the street, Alma sang the complete waltz to Mahler.Norman Lebrecht, The Book of Musical Anecdotes, The Free Press, New York 1985, p. 277"]}, {"page": "Malcolm Sargent", "response": ["Sargent was chief conductor of the BBC Symphony Orchestra from 1950 to 1957, succeeding Boult. He was not the BBC's first choice, but John Barbirolli and Rafael Kubelik turned the post down, and it went to Sargent, despite reservations about his commitment.Kenyon, pp. 220 and 228 Unlike Boult he refused to join the staff of the BBC and remained a freelance, accepting other engagements as he pleased.Cox, pp. 164–165 The historian of the BBC Asa Briggs has written, \"Sargent sometimes ruffled the orchestra in a way that Boult had never done. Indeed there were many people inside the BBC who profoundly regretted Boult's departure.\"Briggs, p. 674 Briggs adds that Sargent was the target of criticism from the BBC's own Music Department for \"not devoting enough time to the orchestra\".Briggs, p. 230 The music journalist Norman Lebrecht goes so far as to say that Sargent \"almost wrecked\" the BBC orchestra.Lebrecht, p. 176 The orchestra objected to his \"autocratic and prima-donna attitude towards orchestral players\" and flatly refused to accede to his demand that they all stand up when he came on to the platform. He rapidly became equally unpopular with the BBC music department, ignoring its agenda and pursuing his own.Cox, p. 164 A senior BBC manager wrote:"]}, {"page": "Elisabeth Schwarzkopf", "response": ["* Norman Lebrecht: Schwarzkopf's Career Had Somber Side"]}, {"page": "Marilyn Horne", "response": ["In December 2005, shortly before Horne's 72nd birthday, she was diagnosed with localized pancreatic cancer.Opera News > The Met Opera Guild In January 2007, she appeared at a public function for her Foundation.Anne Midgette: Marilyn Horne Puts Her Protégés on Parade in Song, The New York Times, January 29, 2007. Retrieved 21 May 2007. Interviewed by Norman Lebrecht on BBC Radio 3 on July 26, 2010, she spoke briefly about her cancer and cheerfully said, \"I'm still here!\"Norman Lebrecht interviews Marilyn Horne, BBC Radio 3, 26 July 2010."]}, {"page": "Bar-Ilan University", "response": ["* Norman Lebrecht (born 1948) - British commentator on music and cultural affairs, and novelist"]}, {"page": "Barbara (singer)", "response": ["Influenced originally by songwriters Mireille and Pierre MacOrlan, she developed her own style and the writing of her own songs transformed her image into that of a unique singer-songwriter. In the 1960s, she wrote her landmark song, \"Ma plus belle histoire d'amour c'est vous\" (\"My Most Beautiful Love Story Is You\"), and others for which she remains famous such as \"L'aigle noir\", \"Nantes\", \"La solitude\", \"Göttingen\" and \"Une petite cantate.\" These five songs plus \"Dis, quand reviendras-tu?\" were translated into German by Belgian-German singer-songwriter Didier Caesar. The song \"Göttingen\" (named after the German city of Göttingen) is said to have contributed more to post-war German–French reconciliation than any speech by a politician. On the 40th anniversary of the Elysée agreement, ex-chancellor Gerhard Schröder quoted from the song in his official speech in the Château de Versailles.The Inner Voice of France, BBC Radio 3, December 2011, presented by Norman Lebrecht"]}, {"page": "2002 Whitbread Awards", "response": ["*Norman Lebrecht, The Song of Names"]}, {"page": "Grigory Sokolov", "response": ["After British music critic Norman Lebrecht received the Cremona Music Award 2014, Sokolov, upon learning of his being awarded the Cremona Music Award 2015, refused to accept the honour, making this statement on his website: \"According to my ideas about elementary decency, it is shame to be in the same award-winners list with Lebrecht.\" Sokolov's statement appeared to refer to personal remarks Lebrecht had made about Sokolov's family."]}, {"page": "Symphony No. 5 (Bruckner)", "response": ["Sergiu Celibidache, Herbert von Karajan, Stanisław Skrowaczewski, Herbert Blomstedt and Daniel Barenboim are among other noted contributors to the Bruckner Fifth discography. Takashi Asahina, Japan's most-recorded musician, recorded the Bruckner Fifth numerous times. Norman Lebrecht has singled out Georg Tintner's recording on Naxos Records as one of the 100 best discs of the century and credits it with changing critics' attitude towards that record label: \"It actually sounds as if Tintner had been waiting all of his life to give this performance.\"Norman Lebrecht, \"Masterpieces: 100 Milestones of the Recorded Century\" The Life and Death of Classical Music. New York: Anchor Books (2007): 266–267"]}, {"page": "Symphony No. 7 (Bruckner)", "response": ["Herbert von Karajan's last recording with the Vienna Philharmonic, 23 April 1989, three months before his death, on the Deutsche Grammophon label, of the Haas edition of the 1885 score, has been singled out by Norman Lebrecht as #80 in his list of the 100 best recordings,Norman Lebrecht, \"Masterpieces: 100 Milestones of the Recorded Century\", The Life and Death of Classical Music. New York: Anchor Books (2007): 252–253 and described as \"more human and vulnerable\" than his earlier Berlin recording.Stephen Chakwin, \"Anton Bruckner\" in Classical Music: The Listener's Companion ed. Alexander J. Morin (San Francisco: Backbeat Books, 2002), p. 196 In reviewing the 1999 recording by Kurt Sanderling, the critic David Hurwitz listed as reference (benchmark) recordings of Bruckner's Seventh those by Eugen Jochum in 1976, Bernard Haitink in 1978, Karajan in 1989, and Günter Wand in 1999.David Hurwitz, \"Anton Bruckner Symphony No. 7\" ClassicsToday.com, March 4, 2001 Stephen Johnson prefers Karl Böhm's recording with the Vienna Philharmonic, saying that Böhm balances \"clear-sighted formal understanding with a more fluid, supple approach to phrasing.\"Stephen Johnson, Anton Bruckner Symphony no. 7 (1883), 1001 Classical Recordings You Must Hear Before You Die ed. Matthew Rye. Published by Universe in New York, p. 424. The vast majority of modern recordings use vibrato for the strings, with Roger Norrington's recording with the Radio-Sinfonieorchester Stuttgart des SWR being a notable exception.Shirley, Hugo (2010). \"Bruckner: Symphony No.7\" MusicalCriticism.com"]}, {"page": "Sarah Ioannides", "response": ["* 2016 Norman Lebrecht’s “Woman Conductors: The Power List”"]}, {"page": "Victor de Sabata", "response": ["Norman Lebrecht describes him as \"a musician whose mild manners turned to raging fury whenever he took stick in hand\".Lebrecht, p. 213 One critic used the phrase \"lull and stun\" to summarize his technique."]}, {"page": "Kol Torah", "response": ["* Norman Lebrecht (born 1948), British commentator on music and cultural affairs, and novelist"]}]}}