{"wiki_id": "http://www.wikidata.org/entity/Q7191815", "itemLabel": "Pierce McCan", "itemDescription": "Irish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Pierce_McCan", "wikipedia_page": {"main": "Pierce McCan or McCann (2 August 1882 – 6 March 1919) was an Irish Sinn Féin politician.", "link_mentions": [{"page": "Pierce", "response": ["* Pierce McCan (1882-1919), Irish politician"]}, {"page": "1919 in Ireland", "response": ["*6 March – Pierce McCan, member of 1st Dáil representing Tipperary East."]}, {"page": "Members of the 1st Dáil", "response": ["When the Sinn Féin executive met on 1 January 1919 to plan for the Dáil's inaugural meeting, it considered appointing substitutes for the imprisoned Sinn Féin TDs who would be unable to attend, but decided against this. When Pierce McCan died on 6 March 1919, his East Tipperary seat was left vacant at Westminster. In April 1919 a Dáil committee considering how to fill the vacancy considered allowing nomination by the Labour Party (which had stood aside in the 1918 election to avoid splitting the nationalist vote) before recommending that the Sinn Féin constituency organisation should nominate. However, in June 1919 the Dáil decided that \"it was due to the memory of the late Pierce McCann that his place should not be filled at present\". Later vacancies were also left unfilled; when Diarmuid Lynch resigned his seat in 1920, Arthur Griffith said \"as the letter of resignation was addressed to the people of South-East Cork, the next step in the matter lay with the South-East Cork Executive of Sinn Fein\".", "|Pierce McCan"]}, {"page": "List of Dáil by-elections", "response": ["When Pierce McCan died on 6 March 1919, his East Tipperary seat was left vacant at Westminster. In April 1919 a Dáil committee considering how to fill the vacancy considered allowing nomination by the Labour Party (which had stood aside in the 1918 election to avoid splitting the nationalist vote) before recommending that the Sinn Féin constituency organisation should nominate. However, in June 1919 the Dáil decided that \"it was due to the memory of the late Pierce McCann that his place should not be filled at present\". Later vacancies were also left unfilled; when Diarmuid Lynch resigned his seat in 1920, Arthur Griffith said \"as the letter of resignation was addressed to the people of South-East Cork, the next step in the matter lay with the South-East Cork Executive of Sinn Fein\". Asked in the Civil War about filling Third Dáil vacancies, W. T. Cosgrave as Chairman of the Provisional Government stated \"the condition of the country scarcely warrants the holding of elections\".", "| Pierce McCan"]}, {"page": "Records of members of the Oireachtas", "response": ["|Pierce McCan", "|Pierce McCan"]}, {"page": "East Tipperary (UK Parliament constituency)", "response": ["| Pierce McCan"]}, {"page": "List of Sinn Féin MPs", "response": ["| Pierce McCan"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Pierce McCan", "*Tipperary East--Pierce McCan (Sinn Féin) died 6 March 1919"]}, {"page": "Families in the Oireachtas", "response": ["**his nephew Pierce McCan (1882–1919): SF MP/TD Tipperary East 1918–1919"]}, {"page": "United Kingdom by-election records", "response": ["By the end of the Parliament, the following Sinn Féin MPs had died without being replaced: Pierce McCan (East Tipperary) of influenza on 6 March 1919, Terence MacSwiney (Mid Cork) following a hunger strike in Brixton prison on 25 October 1920, Frank Lawless (North County Dublin) as a result of a riding injury on 16 April 1922, Joseph McGuinness (Longford) on 31 May 1922, Cathal Brugha (Waterford) in action during the Irish Civil War on 7 July 1922, Harry Boland (South Roscommon) shot while being arrested on 2 August 1922, Arthur Griffith (East Cavan and North West Tyrone) on 12 August 1922, and Michael Collins (South Cork assassinated on 22 August 1922). In each case their seats were abolished in 1922 as a result of the establishment of the Irish Free State."]}, {"page": "McCan Barracks", "response": ["McCan Barracks (Irish: Dún Mhic Cana) is the site of two agents of the Irish state: the Garda Síochána College and the Defence Forces. It is located in Templemore, County Tipperary, Ireland. It is named after Pierce McCan who fought in the Irish War of Independence.", "The 2nd Mid-Tipperary Brigade now took over under the command of Brigadier James Leahy together and his Adjutant Michael Hynes. The name of the post was changed to McCan  Barracks. This was to commemorate the first Sinn Féin MP. for Mid-Tipperary, Pierce McCan , who died on hunger strike in Gloucester Prison in 1919."]}, {"page": "United Kingdom general election records", "response": ["|Pierce McCan"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|||Pierce McCan||1882||1919 (Died of Spanish influenza in Gloucester Prison)||Uncharged but implicated in so-called \"German Plot\"||East Tipperary (1918-death but did not sit)||Sinn Féin; also Irish Teachta Dála but unable to sit."]}, {"page": "Pierce McCann", "response": ["#REDIRECT Pierce McCan"]}, {"page": "HM Prison Gloucester", "response": ["* Pierce McCan Irish revolutionary (died in the prison in 1919)"]}, {"page": "List of members of the Oireachtas imprisoned during the Irish revolutionary period", "response": ["|rowspan=2|Pierce McCan"]}, {"page": "Thomas Condon (Irish nationalist politician)", "response": ["Condon was re-elected at each election until 1918, when he lost to Pierce McCan in the Sinn Féin landslide."]}, {"page": "McCan", "response": ["#REDIRECT Pierce McCan"]}]}}