{"wiki_id": "http://www.wikidata.org/entity/Q7205517", "itemLabel": "Plunkett Donaghy", "itemDescription": "Gaelic footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Plunkett_Donaghy", "wikipedia_page": {"main": "Plunkett Donaghy is a former Gaelic footballer who played for the Moy club and the Tyrone county team. With his county, Donaghy won three Ulster Senior Football Championship medals (in 1984, 1986 and 1989) and an All Star in 1986. He lives in The Moy, Co. Tyrone.", "link_mentions": [{"page": "Joe Brolly", "response": ["Joe Brolly is a first cousin of Derry player Liam Hinphey and Monaghan player Vincent Corey, and second cousin to Tyrone footballers Colm and Plunkett Donaghy.  He is from Dungiven, County Londonderry, Northern Ireland."]}, {"page": "List of All Stars Awards winners (football)", "response": ["| MD || 20px|border Plunkett Donaghy || Tyrone || 1"]}, {"page": "Eugene McKenna", "response": ["McKenna was the captain of a noteworthy Tyrone team in the mid-eighties, which included All Star winners, Plunkett Donaghy, Frank McGuigan, Damian O'Hagan and  John Lynch.", "He won the Ulster Championship again in 1989, although this time he was under the skippership of Plunkett Donaghy. Tyrone defeated Donegal in a replayed final."]}, {"page": "History of the Tyrone county football team", "response": ["Tyrone's first successful era came in the mid-eighties with the star-studded team that included players such as Frank McGuigan, Eugene McKenna, Plunkett Donaghy and John Lynch.", "An unprecedented four Tyrone players won All-Star Awards that year, Plunkett Donaghy, John Lynch, Damien O'Hagan and Eugene McKenna won his second.", "Tyrone beat Donegal in the replayed 1989 Ulster Final, with Plunkett Donaghy leading the team out that day. Eugene McKenna received his third All Star award that year, making him the leading representative of Tyrone in the All Star stakes."]}, {"page": "Moy Tír Na nÓg GAC", "response": ["* Plunkett Donaghy"]}, {"page": "Donaghy", "response": ["* Plunkett Donaghy, Tyrone Gaelic footballer"]}, {"page": "1984 International Rules Series", "response": ["|Liam AustinGreg BlaneyP.J. BuckleyPlunkett DonaghyShea FahyMartin FurlongJimmy KerriganMick LyonsMicky MartinPeter McGinnitySeamus McHughF. McMahonDermot McNichollBrian O'DonnellColm O'RourkeJack O'SheaNoel RocheBarney RockTom SpillaneLiam TierneySean Walsh"]}, {"page": "Tyrone county football team", "response": ["The Tyrone team of the mid-eighties included McGuigan, Eugene McKenna, Plunkett Donaghy and John Lynch, winning a fourth Ulster SFC title in 1984, and in 1986, reaching a first ever final of the All-Ireland Senior Football Championship (SFC), where Kerry defeated it by a scoreline of 2–15 to 1-10. Tyrone added a sixth Ulster SFC (after a replay of the final) in 1989.", "* 1986: John Lynch, Plunkett Donaghy, Damien O'Hagan, Eugene McKenna (2nd All Star)"]}]}}