{"wiki_id": "http://www.wikidata.org/entity/Q721082", "itemLabel": "James Muspratt", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Muspratt", "wikipedia_page": {"main": "James Muspratt (12 August 1793 – 4 May 1886) was a British chemical manufacturer who was the first to make alkali by the Leblanc process on a large scale in the United Kingdom.", "link_mentions": [{"page": "Chemical industry", "response": ["However, it was in Britain that the Leblanc process really took off. William Losh built the first soda works in Britain at the Losh, Wilson and Bell works on the River Tyne in 1816, but it remained on a small scale due to large tariffs on salt production until 1824. When these tariffs were repealed, the British soda industry was able to rapidly expand. James Muspratt's chemical works in Liverpool and Charles Tennant's complex near Glasgow became the largest chemical production centres anywhere. By the 1870s, the British soda output of 200,000 tons annually exceeded that of all other nations in the world combined."]}, {"page": "Leblanc process", "response": ["By the early 19th century, French soda ash producers were making 10,000 - 15,000 tons annually.  However, it was in Britain that the Leblanc process became most widely practiced.   The first British soda works using the Leblanc process was built by the Losh family of iron founders at the Losh, Wilson and Bell works in Walker on the River Tyne in 1816, but steep British tariffs on salt production hindered the economics of the Leblanc process and kept such operations on a small scale until 1824.  Following the repeal of the salt tariff, the British soda industry grew dramatically. The Bonnington Chemical Works was possibly the earliest production, and the chemical works established by James Muspratt in Liverpool and Flint, and by Charles Tennant near Glasgow became some of the largest in the world.  Muspratt's Liverpool works enjoyed proximity and transport links to the Cheshire salt mines, the St Helens coalfields and the North Wales and Derbyshire limestone quarries.Peter Reed, Acid Rain and the Rise of the Environmental Chemist in Nineteenth Century Britain, (2014), p. 94  By 1852, annual soda production had reached 140,000 tons in Britain and 45,000 tons in France.  By the 1870s, the British soda output of 200,000 tons annually exceeded that of all other nations in the world combined."]}, {"page": "James Young (chemist)", "response": ["In 1839 Young was appointed manager at James Muspratt's chemical works Newton-le-Willows, near St Helens, Merseyside, and in 1844 to Tennants, Clow & Co. at Manchester, for whom he devised a method of making sodium stannate directly from cassiterite."]}, {"page": "St Helens and Runcorn Gap Railway", "response": ["With the coming of the Industrial Revolution in the 18th century there was a need for coal to be carried from the coalfields in the area of St Helens to the River Mersey for transportation to the growing industrial towns and cities. The first solution was to build the Sankey Canal which opened in 1755 and ran from the Blackbrook canal via Parr to Sankey Bridges, to the west of Warrington.  It was extended to the west, to Fiddlers Ferry, five years later.Diggle, p. 17 Encouraged by the success of the Stockton and Darlington Railway which opened in 1825, in 1829 a group of local businessmen arranged for a survey for a line from Cowley Hill Colliery, north of St Helens, to Runcorn Gap on the River Mersey.  At this time the Liverpool and Manchester Railway, which ran to the south of St Helens, was being built and its surveyor, Charles Blacker Vignoles, was commissioned to undertake the survey; he was later appointed as the engineer. An Act of Parliament was obtained on 29 May 1830.Holt, p. 59 The original capital was £120,000, one-third of which was raised from local coal owners, salt-makers and Liverpool merchants.Diggle, p. 18 These included James Muspratt, soap and alkali manufacturer, and Peter Greenall, who had interests in the brewing, coal and glass manufacturing industries.Hardie, p. 4 Peter Greenall was elected as the first chairman of a board of ten directors. At the south end of the railway, Widnes Dock was built, which led into the Mersey. This was the world's first rail-to-ship facility.Welbourn, p. 4 Because of perceived competition from the railway, the Sankey Canal was extended from Fiddlers Ferry to Runcorn Gap by what was known as the \"New Cut\". The railway terminated between the dock and the end of the canal and Runcorn Gap station was sited to the north of the canal.Hardie, frontispiece map."]}, {"page": "James Sheridan Muspratt", "response": ["James Sheridan Muspratt was born in Dublin and moved to Liverpool with his parents when he was one year old. His father, James Muspratt, was one of the biggest industrial chemicals manufacturers in the UK between 1825 and 1850. James Sheridan Muspratt attended private schools in Bootle, Merseyside, and then went with tutors to travel on the European continent.  Beginning in 1836, he studied chemistry under Thomas Graham at Anderson's University in Glasgow and then moved with Graham to University College London."]}, {"page": "Max Muspratt", "response": ["He was born at Seaforth Hall, Seaforth, Lancashire, the son of Edmund Knowles Muspratt and his wife Frances Jane Baines. He was one of eight children and a brother of Suffragists Nessie Stewart-Brown and Julia Solly.Krista Cowman, 'Brown, Nessie Stewart (1864–1958)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 11 Feb 2014 He was an uncle of Nelia Penman, who served as President of the Women's Liberal Federation.Nottingham Evening Post, 9 April 1937 The Muspratt family were originally from Dublin but moved to Liverpool in 1822 when James Muspratt, the father of Edmund, established a chemical factory in Vauxhall Road.Trevor I. Williams, (2004) 'Muspratt, James (1793–1886)’, Oxford Dictionary of National Biography, Oxford University Press,  Retrieved on 9 March 2007. "]}, {"page": "Dee Estuary", "response": ["Signs of past industry are visible along the whole length of the estuary especially on the Welsh side. Large stretches of what now appear as flood embankments are long abandoned industrial waste heaps, some still containing highly reactive and caustic materials, including large heaps of Galligu, a by-product of the LeBlanc process used at the James Muspratt alkali works at Flint."]}, {"page": "1886 in Ireland", "response": ["*4 May – James Muspratt, chemical manufacturer in Britain (born 1793)."]}, {"page": "Frederic Muspratt", "response": ["He was born in Liverpool, the third son of James Muspratt and his wife Julia Josephine née Connor.  His father was also a chemical industrialist who had established factories in Liverpool, St Helens and Newton-le-Willows.  Richard was sent by his father to study chemistry under Justus von Liebig at the University of Giessen in Hesse-Darmstadt, Germany."]}, {"page": "Richard Muspratt", "response": ["Richard Muspratt was born in Liverpool, England, the second son of James Muspratt and his wife Julia Josephine née Connor.  His father was also a chemical industrialist who had established factories in Liverpool, St Helens and Newton-le-Willows.  Richard was sent by his father to study chemistry under Justus von Liebig at the University of Giessen in Hesse-Darmstadt, Germany."]}, {"page": "Edmund Knowles Muspratt", "response": ["Edmund Knowles Muspratt was born in Seaforth, near Liverpool, England, the fourth and youngest son of James Muspratt and his wife Julia Josephine née Connor.  His father was also a chemical industrialist who had established factories in Liverpool, St Helens and Newton-le-Willows.  He was educated at the Pestalozzian Institute at Worksop, Nottinghamshire.  He was then sent by his father to study chemistry under Justus von Liebig at the University of Giessen in Hesse-Darmstadt, Germany.  When Liebig moved to the University of Munich in 1852, Muspratt went with him and studied medicine thereTrevor I. Williams (2004) 'Muspratt, Edmund Knowles (1833–1923)', rev., Oxford Dictionary of National Biography, Oxford University Press  Retrieved on 2 July 2007 where he gained the degree of PhD He then returned to Liverpool to work with his father in his businesses. He married Frances Jane Baines and together they had eight children, including Suffragists, Nessie Stewart-Brown, Julia Solly and Liberal MP, Max Muspratt.Krista Cowman, ‘Brown, Nessie Stewart (1864–1958)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 11 Feb 2014"]}, {"page": "Muspratt", "response": ["*James Muspratt, a chemical industrialist whose four sons who also worked in the chemical industry:"]}, {"page": "1793 in Ireland", "response": ["*12 August – James Muspratt, chemical manufacturer in Britain (died 1886)."]}, {"page": "George Harley", "response": ["Harley married Emma Jessie, daughter of James Muspratt of Seaforth Hall, near Liverpool. She survived him with three children: Vaughan Harley, M.D. (1863–1923); Ethel Brilliana Tweedie (Mrs. Alec Tweedie), the author; and Olga Harley. Olga Harley married Francis Woodcock Goodbody, M.D."]}, {"page": "Letters of Charles Dickens", "response": ["Dickens's correspondents spanned the whole social scale of 19th century England from reformed street prostitutes to Queen Victoria herself.  They included family members, of course, and Dickens's publishers; writers like Robert Browning, Thomas Carlyle, Wilkie Collins, George Eliot, John Forster, Alfred Tennyson (not yet ennobled), and William Makepeace Thackeray; the artists Clarkson Stanfield and Daniel Maclise; and the actor William Macready.  Letters to several of his friends have little or no representation in the surviving correspondence because they were destroyed by the recipients, their heirs, or by random accidents of history.  These correspondents include his daughter Katey, Augustus Egg, Chauncy Hare Townshend, Hablot K. Browne (\"Phiz\"), Richard Barham, James Muspratt, and his lover Ellen Ternan."]}, {"page": "Muspratt, James", "response": ["#redirectJames Muspratt"]}, {"page": "Manfred Trautschold", "response": ["Adolf Manfred Trautschold was born in Giessen, Germany to Wilhelm Trautschold and his British wife Sophia Johnston, an illegitimate daughter of the industrial chemist James Muspratt. His uncle was the palaeontologist Hermann Trautschold. Little is known of his training in art. He married the Belgian Marguerite De Hees, daughter of a merchant, in Dover, Kent on 22 August 1878. They had two sons, Reginald William Trautschold and Gordon Manfred Trautschold.  He contributed a painting to an 1882 book Bedford Park, celebrating the then-fashionable garden suburb of that name. In 1887 the family emigrated to the US, settling in Montclair, New Jersey. The family home became known as an artists' colony."]}]}}