{"wiki_id": "http://www.wikidata.org/entity/Q721537", "itemLabel": "James Alison", "itemDescription": "Roman Catholic theologian, priest", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Alison", "wikipedia_page": {"main": "James Alison (born 4 October 1959) is an English Roman Catholic priest and theologian. Alison is noted for his application of René Girard's anthropological theory to Christian systematic theology and for his work on LGBT issues.", "link_mentions": [{"page": "Blackfriars, Oxford", "response": ["* James Alison, theologian and author"]}, {"page": "Homosexual clergy in the Catholic Church", "response": ["*James Alison, Roman-Catholic priest in United Kingdom and SpainEurekastreet: Conversation with a gay priest", "*James Alison"]}, {"page": "Allison (surname)", "response": ["*James Alison, Catholic priest, theologian and author"]}, {"page": "René Girard", "response": ["Theologians who describe themselves as indebted to Girard include James Alison (who focuses on mimetic desire's implications for the doctrine of original sin), Raymund Schwager (who builds a dramatic narrative around both the scapegoat mechanism and the theo-drama of fellow Swiss theologian Hans Urs von Balthasar), and Bishop Robert Barron (who has remarked that Girard will be appreciated as a 21st-Century Church Father in the future.)"]}, {"page": "James Allison", "response": ["* James Alison (born 1959), Catholic priest, theologian and author"]}, {"page": "Dissent from Catholic teaching on homosexuality", "response": ["James Alison, an English priest and formerly a member of the Dominican Order, has also argued that the teaching of the Congregation for the Doctrine of the Faith On the Pastoral Care of Homosexual Persons regarding gay people is incompatible with the Gospel, and states that \"it cannot in fact be the teaching of the Church.\" In A Question of Truth, the Dominican priest Gareth Moore states that \"there are no good arguments, from either Scripture or natural law, against what have come to be known as homosexual relationships. The arguments put forward to show that such relationships are immoral are bad.\""]}, {"page": "Alison, James", "response": ["#redirectJames Alison"]}, {"page": "Colloquium on Violence & Religion", "response": ["The Colloquium on Violence & Religion began with a meeting in 1990 at Stanford University with theologians James G. Williams, Robert Hamerton-Kelly, and Charles Mabee as its three co-founders. When constituted formally in 1991, it formed a board with Girard as honorary chair; Raymund Schwager, a theologian from the University of Innsbruck, as president; Williams as executive secretary; and Wolfgang Palaver (de), also a theologian from Innsbruck, as editor of the newsletter. Prominent board members have included James Alison, Eric Gans, and Walter Wink."]}]}}