{"wiki_id": "http://www.wikidata.org/entity/Q72194", "itemLabel": "Henry Hallett Dale", "itemDescription": "English pharmacologist, Nobel laureate", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Hallett_Dale", "wikipedia_page": {"main": "Sir Henry Hallett Dale  (9 June 1875 – 23 July 1968) was an English pharmacologist and physiologist. For his study of acetylcholine as agent in the chemical transmission of nerve pulses (neurotransmission) he shared the 1936 Nobel Prize in Physiology or Medicine with Otto Loewi.", "link_mentions": [{"page": "June 9", "response": ["*1875 – Henry Hallett Dale, English pharmacologist and physiologist, Nobel Prize laureate (died 1968)"]}, {"page": "July 23", "response": ["*1968 – Henry Hallett Dale, English pharmacologist and physiologist, Nobel Prize laureate (b. 1875)"]}, {"page": "Neuroscience", "response": ["| scope=row data-sort-value=\"Dale, Henry\" |Henry Hallett Dale"]}, {"page": "Nervous system", "response": ["\"It is difficult to believe that until approximately year 1900 it was not known that neurons are the basic units of the brain (Santiago Ramón y Cajal). Equally surprising is the fact that the concept of chemical transmission in the brain was not known until around 1930 (Henry Hallett Dale and Otto Loewi). We began to understand the basic electrical phenomenon that neurons use in order to communicate among themselves, the action potential, in the 1950s (Alan Lloyd Hodgkin, Andrew Huxley and John Eccles). It was in the 1960s that we became aware of how basic neuronal networks code stimuli and thus basic concepts are possible (David H. Hubel and Torsten Wiesel). The molecular revolution swept across US universities in the 1980s. It was in the 1990s that molecular mechanisms of behavioral phenomena became widely known (Eric Richard Kandel).\" A microscopic examination shows that nerves consist primarily of axons, along with different membranes that wrap around them and segregate them into fascicles. The neurons that give rise to nerves do not lie entirely within the nerves themselves—their cell bodies reside within the brain, spinal cord, or peripheral ganglia."]}, {"page": "Paul Ehrlich", "response": ["In 1899 his institute moved to Frankfurt am Main and was renamed the Institute of Experimental Therapy (Institut für experimentelle Therapie). One of his important collaborators there was Max Neisser. In 1904, Ehrlich received a full position of honorary professor from the University of Göttingen. In 1906 Ehrlich became the director of the Georg Speyer House in Frankfurt, a private research foundation affiliated with his institute. Here he discovered in 1909 the first drug to be targeted against a specific pathogen: Salvarsan, a treatment for syphilis, which was at that time one of the most lethal and infectious diseases in Europe. In 1914, Ehrlich was awarded the Cameron Prize of the University of Edinburgh. Among the foreign guest scientists working with Ehrlich at his institute were two Nobel Prize winners, Henry Hallett Dale and Paul Karrer. The institute was renamed Paul Ehrlich Institute in Ehrlich's honour in 1947."]}, {"page": "1968", "response": ["** Henry Hallett Dale, English pharmacologist and physiologist (b. 1875)"]}, {"page": "1875", "response": ["* June 9 – Henry Hallett Dale, English pharmacologist and physiologist, Nobel Prize laureate (d. 1968)"]}, {"page": "Acetylcholine", "response": ["In 1914, Arthur J. Ewins was the first to extract acetylcholine from nature. He identified it as the blood pressure decreasing contaminant from some Claviceps purpurea ergot extracts, by the request of Henry Hallett Dale. Later in 1914, Dale outlined the effects of acetylcholine at various types of peripheral synapses and also noted that it lowered the blood pressure of cats via subcutaneous injections even at doses of one nanogram."]}]}}