{"wiki_id": "http://www.wikidata.org/entity/Q722050", "itemLabel": "Charles Dawson", "itemDescription": "British archaeological forger", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Dawson", "wikipedia_page": {"main": "Charles Dawson (11 July 1864 – 10 August 1916) was a British amateur archaeologist who claimed to have made a number of archaeological and palaeontological discoveries that were later exposed as frauds. These included the Piltdown Man (Eoanthropus dawsoni), which he presented in 1912.\nThe eldest of three sons, Dawson moved with his family from Preston, Lancashire, to Hastings, Sussex, when he was still very young. Charles initially studied as a lawyer following his father and pursued a hobby of collecting and studying fossils.He made a number of seemingly important fossil finds. Amongst these were teeth from a previously unknown species of mammal, later named Plagiaulax dawsoni in his honour; three new species of dinosaur, one later named Iguanodon dawsoni; and a new form of fossil plant, Salaginella dawsoni. The British Museum conferred upon him the title of Honorary Collector. For these important finds he was elected a fellow of the Geological Society and a few years later after another find, to the Society of Antiquaries of London in 1895. Dawson died prematurely from septicaemia in 1916 at Lewes, Sussex.", "link_mentions": [{"page": "Pierre Teilhard de Chardin", "response": ["From 1912 to 1914, Teilhard worked in the paleontology laboratory of the National Museum of Natural History, France, studying the mammals of the middle Tertiary period. Later he studied elsewhere in Europe. In June 1912 he formed part of the original digging team, with Arthur Smith Woodward and Charles Dawson, at the Piltdown site, after the discovery of the first fragments of the fraudulent \"Piltdown Man\". Some have suggested he participated in the hoax. Marcellin Boule, a specialist in Neanderthal studies, who as early as 1915 had recognized the non-hominid origins of the Piltdown finds, gradually guided Teilhard towards human paleontology. At the museum's Institute of Human Paleontology, he became a friend of Henri Breuil and in 1913 took part with him in excavations at the prehistoric painted  Cave of El Castillo in northwest Spain."]}, {"page": "Piltdown Man", "response": ["The Piltdown Man was a paleoanthropological fraud in which bone fragments were presented as the fossilised remains of a previously unknown early human. Although there were doubts about its authenticity virtually from the beginning, the remains were still broadly accepted for many years, and the falsity of the hoax was only definitively demonstrated in 1953. An extensive scientific review in 2016 established that amateur archaeologist Charles Dawson was responsible for the fraudulent evidence. ", "In 1912, Charles Dawson claimed that he had discovered the \"missing link\" between ape and man. In February 1912, Dawson contacted Arthur Smith Woodward, Keeper of Geology at the Natural History Museum, stating he had found a section of a human-like skull in Pleistocene gravel beds near Piltdown, East Sussex. That summer, Dawson and Smith Woodward purportedly discovered more bones and artifacts at the site, which they connected to the same individual. These finds included a jawbone, more skull fragments, a set of teeth, and primitive tools.", "At a meeting of the Geological Society of London on 18 December 1912, Charles Dawson claimed that a workman at the Piltdown gravel pit had given him a fragment of the skull four years earlier. According to Dawson, workmen at the site discovered the skull shortly before his visit and broke it up in the belief that it was a fossilised coconut. Revisiting the site on several occasions, Dawson found further fragments of the skull and took them to Arthur Smith Woodward, keeper of the geological department at the British Museum. Greatly interested by the finds, Woodward accompanied Dawson to the site. Though the two worked together between June and September 1912, Dawson alone recovered more skull fragments and half of the lower jaw . The skull unearthed in 1908 was the only find discovered in situ, with most of the other pieces found in the gravel pit's spoil heaps.", "On 23 July 1938, at Barkham Manor, Piltdown, Sir Arthur Keith unveiled a memorial to mark the site where Piltdown Man was discovered by Charles Dawson. Sir Arthur finished his speech saying:", "The focus on Charles Dawson as the main forger is supported by the accumulation of evidence regarding other archaeological hoaxes he perpetrated in the decade or two before the Piltdown discovery. The archaeologist Miles Russell of Bournemouth University analysed Dawson's antiquarian collection, and determined that at least 38 of his specimens were fakes. Among these were the teeth of a reptile/mammal hybrid, Plagiaulax dawsoni, \"found\" in 1891 (and whose teeth had been filed down in the same way that the teeth of Piltdown Man were to be some 20 years later); the so-called \"shadow figures\" on the walls of Hastings Castle; a unique hafted stone axe; the Bexhill boat (a hybrid seafaring vessel); the Pevensey bricks (allegedly the latest datable \"finds\" from Roman Britain); the contents of the Lavant Caves (a fraudulent \"flint mine\"); the Beauport Park \"Roman\" statuette (a hybrid iron object); the Bulverhythe Hammer (shaped with an iron knife in the same way as the Piltdown elephant bone implement would later be); a fraudulent \"Chinese\" bronze vase; the Brighton \"Toad in the Hole\" (a toad entombed within a flint nodule); the English Channel sea serpent; the Uckfield Horseshoe (another hybrid iron object) and the Lewes Prick Spur. Of his antiquarian publications, most demonstrate evidence of plagiarism or at least naive referencing. Russell wrote: \"Piltdown was not a 'one-off' hoax, more the culmination of a life's work.\" In addition, Harry Morris, an acquaintance of Dawson, had come into possession of one of the flints obtained by Dawson at the Piltdown gravel pit. He suspected that it had been artificially aged – \"stained by C. Dawson with intent to defraud\". He remained deeply suspicious of Dawson for many years to come, though he never sought to discredit him publicly, possibly because it would have been an argument against the eolith theory, which Morris strongly supported.Weiner, The Piltdown Forgery, pp. 140–45.", "In a 1999 television documentary about the Piltdown Man, American writer John Evangelist Walsh said about the identity of the forger: \"I’ll give you his name without hesitation and without making you wait. Charles Dawson was the perpetrator. Alone, by himself without the least bit of help.\"History's Mysteries: Hoax of the Ages – Piltdown Man (History Channel, 1999)", "*2003: Full nature of Charles Dawson's career in fakes is exposed.", "* \"Charles Dawson Piltdown Faker\" BBC News"]}, {"page": "Charles", "response": ["|Charles Dawson|| English archaeologist, involved in the Piltdown Man hoax"]}, {"page": "Plagiaulax", "response": ["Another possible species, P. dawsoni, was provisionally named by Woodward in 1891. This came from the county of Sussex, which is further east along the English coast. It was subsequently damaged and there seems not to have been a scientific description. Its discoverer, Charles Dawson has been implicated in the Piltdown hoax and Pevensey tiles hoax.D.P.S. Peacock, 1973, \"Forged Brick-Stamps from Pevensey.\""]}, {"page": "Timeline of paleontology", "response": ["* 1912 — Charles Dawson announces discovery of \"Piltdown Man\" in England, a hoax that would confuse paleoanthropology until the fossils were revealed as forgeries in 1953."]}, {"page": "Harry Price", "response": ["From around May 1908 Price continued his interest in archaeology at Pulborough, Sussex, where he had moved prior to marrying Constance Mary Knight that August. As well as working as a salesman for paper merchants Edward Saunders & Sons, he wrote for two local Sussex newspapers: the West Sussex Gazette and the Southern Weekly News in which he related his remarkable propensity for discovering 'clean' antiquities. One of these, a 'silver' ingot (discovered by Richard Morris to be housed in Price's collection of artefacts at Senate House, University of London and made of base materials) was stamped around the time of the last Roman emperor Honorius. A few years later, another celebrated Sussex archaeologist, Charles Dawson, found a brick at Pevensey Fort in Sussex, which was purportedly made in Honorius' time. In 1910 Professor E. J Haverfield of Oxford University, the country's foremost expert on Roman history and a Fellow of the Royal Academy, declared the ingot to be a fake."]}, {"page": "Australopithecus africanus", "response": ["A. africanus was the first evidence that humans evolved in Africa, as Charles Darwin had postulated in his 1871 The Descent of Man. However, Dart's claim of the Taung child as the transitional stage between apes and humans was at odds with the-then popular model of human evolution which held that large brain size and humanlike characteristics had developed rather early on, and that large brain size evolved before bipedalism. Resultantly, A. africanus was generally cast aside as a member of the gorilla or chimpanzee lineages, most notably by Sir Arthur Keith. This view was perpetuated by Charles Dawson's 1912 hoax Piltdown Man hailing from Britain. Further, the discovery of the humanlike Peking Man (Homo erectus pekinensis) in China also seemed to place the origins of humankind outside of Africa. Humanlike characteristics of the Taung child were attributed to the specimen's juvenile status, meaning they would disappear with maturity. Nonetheless, Dart and Broom continued to argue that Australopithecus was far removed from chimpanzees, showing several physical and claiming some behavioural similarities with humans. To this extent, Dart made note of the amalgamations of large mammal bone fragments in australopithecine-bearing caves which are now attributed to hyena activity. However, Dart proposed that the bones were instead evidence of what he named the \"osteodontokeratic culture\" produced by australopithecine hunters, who manufactured weapons using the long bones, teeth, and horns of large hoofed prey:"]}, {"page": "Arthur Keith", "response": ["Keith was a strong proponent of the Piltdown Man.  Piltdown: A Scientific Forgery, written by the anthropologist Frank Spencer after completing the research of Ian Langham (an Australian historian of science who suspected Keith, and died in 1984), explored the link between Keith and Charles Dawson and suggested it was Keith who prepared the fake specimens for Dawson to plant. Phillip Tobias details the history of the investigation of the hoax, dismissing other theories, and listing inconsistencies in Keith's statements and actions.Tobias, Phillip V. (June 1992) An Appraisal of the Case Against Sir Arthur Keith. Current Anthropology . More recent evidence points to Martin Hinton,TalkOrigins. Retrieved on 8 June 2008. but the case remains open."]}, {"page": "1912 in archaeology", "response": ["* June 23 - Jaw of \"Piltdown Man\" \"found\" by Charles Dawson in Sussex, England (shown to be a hoax in 1953)."]}, {"page": "1953 in archaeology", "response": ["* November 21: Piltdown Man is shown to be a hoax (first presented by Charles Dawson in 1912)."]}, {"page": "Kenneth Oakley", "response": ["In November 1953 Oakley, along with Drs. J. S. Weiner and W. E. le Gros Clark published The Solution of the Piltdown Problem in the Bulletin of The British Museum of Natural History: Geology Department. This publication provided the discovered evidence that proved the \"Piltdown Man\", a skull that was initially deemed a new species and potential \"missing link\" called Eoanthropus dawsoni that had been discovered in 1913 by archeologist Charles Dawson, was in fact a hoax. Through a complete re-analysis of the specimen's teeth abrasion, fluorine content, nitrogen content, and coloring, Oakley and his colleagues concluded that the skull fragments were not of one specimen. Instead, it appeared that the skull was a fabrication produced out of a modern ape mandible that had been skillfully fused to the cranial fragments of another species."]}, {"page": "Pevensey Castle", "response": ["The curtain wall was not all built at once but was constructed in segments, as can be seen from vertical breaks in the stonework which mark where sections met. The wall is built on top of complex foundations constructed from rubble and timber set into a ditch  deep. Oak piles were driven into the trench and packed with flint and clay, above which a horizontal framework of oak beams was set with more flint and clay. The foundation was finally covered over with cement before the walls were built on top.Goodall, p. 16 Some of the timbers have survived, allowing archaeologists to date the fort through dendochronology.Goodall, p. 17 Other dating evidence was discredited in the 1970s. An excavation in 1906–08 found shattered tiles stamped HON AUG ANDRIA, which were used to attribute Pevensey Castle's construction to the reign of the early 5th-century Emperor Honorius. However, the use of thermoluminescence dating revealed that the tiles had been made around the time of the excavation. It is suspected that Charles Dawson, who has been blamed for the Piltdown Man hoax, was the author of the forged tiles.Johnson (1976), pp. 144–5"]}, {"page": "Hastings Museum and Art Gallery", "response": ["The museum has a large collection of papers relating to Hastings, the local are and significant individuals. These include John Logie Baird, Robert Tressell and Charles Dawson. There are also documents and books related the Cinque Ports, smuggling, fishing and local societies. The archive contains maps, photographs, documents and books."]}, {"page": "Anderitum", "response": ["Other dating evidence was discredited in the 1970s. An excavation in 1906–08 found shattered tiles stamped HON AUG ANDRIA, which were used to attribute Pevensey Castle's construction to the reign of the early 5th century Emperor Honorius. However, later use of thermoluminescence dating revealed they had been made around the time of the excavation. It is suspected that Charles Dawson, who has been blamed for the Piltdown Man hoax, was the author of the forged tiles."]}, {"page": "Heathfield railway station (East Sussex)", "response": ["In 1896, the LB&SCR drilled for water at the north end of the station. Natural gas was discovered at . In 1898 and 1899, Charles Dawson gave several demonstrations with the gas and the railway began to use it to light the station. The natural gas was used for that purpose until February 1934, when the station was converted to town gas. The well was sealed in 1963."]}, {"page": "Entombed animal", "response": ["Some of the stories may be based on outright fabrications. Charles Dawson, quite probably the perpetrator of the Piltdown Man hoax, had some years earlier presented the Brighton \"Toad in the Hole\" (a toad entombed within a flint nodule), likely another forgery. Dawson presented the toad to the Brighton and Hove Natural History and Philosophical Society on 18 April 1901, claiming that two workmen had found the flint nodule in a quarry north-east of Lewes a couple of years earlier, which revealed a toad inside when they broke it open.  The toad was eventually passed on to the Booth Museum of Natural History in Brighton via Henry Willett. However, the toad has since shrunk, suggesting that it cannot have been very old at the time of its discovery."]}, {"page": "Landmarks of the Nebraska Territory", "response": ["| Built in 1855 as a trading post before being used as an Overland stage station and Pony Express station. Mark Twain referenced it in his 1872 novel, Roughing It, as did Charles Dawson and Mattes & Henderson."]}, {"page": "Errett Callahan", "response": ["Upon his return from Northern Europe in 1981 Callahan founded Piltdown Productions as a means to sell his many publications, supplies, and instructional materials, as well as the stone tools and knives he produced.  He first used the name, which he took from the infamous Piltdown Man hoax of the early 1900s in which British collector Charles Dawson attempted to pass off the jawbone of an orangutan and fragments of a human skull as an undiscovered human ancestor found in a gravel quarry in Piltdown, England.   Callahan first used the Piltdown name in 1974 in a comic strip he drew for Experimental Archaeology Papers, or A.P.E..  In the comic strip he presented a humorous look at the life of a caveman.  Callahan wrote two more installments of the comic for the A.P.E. and then for the Newsletter of Experimental Archaeology.  During this period, he was also producing documentary and instructional films dealing with various aspects of primitive technology as well as beginner flint knapping kits and tool reproductions that he was sold to universities, colleges, and hobbyists around the country.  Callahan produced several catalogue editions that contain not only his stone tool and instructional materials but a good deal of his philosophy and ethical stances towards the field of flint knapping."]}, {"page": "Dawson (surname)", "response": ["*Charles Dawson (disambiguation)", "**Charles Dawson (1864–1916), British archaeologist"]}, {"page": "Arthur Conan Doyle", "response": ["However, more recent research suggests that Doyle was not involved. In 2016, researchers at the Natural History Museum and Liverpool John Moores University analyzed DNA evidence showing that responsibility for the hoax lay with the amateur archaeologist Charles Dawson, who had originally \"found\" the remains. He had initially not been considered the likely perpetrator, because the hoax was seen as being too elaborate for him to have devised. However, the DNA evidence showed that a supposedly ancient tooth he had \"discovered\" in 1915 (at a different site) came from the same jaw as that of the Piltdown Man, suggesting that he had planted them both. That tooth, too, was later proven to have been planted as part of a hoax."]}, {"page": "Barilium", "response": ["Barilium is a genus of iguanodontian dinosaur which was first described as a species of Iguanodon (I. dawsoni) by Richard Lydekker in 1888, the specific epithet honouring the discoverer Charles Dawson. "]}, {"page": "Plagiaulax dawsoni", "response": ["#redirect Charles Dawson"]}, {"page": "February 1912", "response": ["* Amateur archaeologist Charles Dawson wrote a letter to British paleontologist Arthur Smith Woodward, describing his finding of \"part of a thick human skull\" in \"a very old Pleistocene bed\" between Uckfield and Crowborough in East Sussex, England. Dawson's \"discovery\", known as the \"Piltdown Man\", became one of the great hoaxes of the 20th century.J. S. Weiner, The Piltdown Forgery (Oxford University Press, 2004) p73"]}, {"page": "May 1912", "response": ["* Charles Dawson brought the first five skull fragments of the Piltdown Man to the British Museum. Dawson's \"missing link\" would be proven to be a hoax in 1953.J. S. Weiner, The Piltdown Forgery (Oxford University Press, 2004) pp. 112-1133"]}, {"page": "Piltdown", "response": ["Piltdown is a series of hamlets in East Sussex, England.Villagenet It is located south of Ashdown Forest. It is best known for the Piltdown Man hoax where amateur archaeologist Charles Dawson claimed to have discovered evidence of the \"missing link\" in gravel beds near the village."]}, {"page": "November 1912", "response": ["* The first news story about the Piltdown Man was published in Manchester Guardian, which reported the discovery by Charles Dawson in southern England of the earliest known ancestor of man under the headline, \"The Earliest Man? A Skull Millions of Years Old- One of the Most Important of Our Time\". The discovery would be exposed as a hoax in 1953.Dan Agin, Junk Science: An Overdue Indictment of Government, Industry, and Faith Groups That Twist Science for Their Own Gain (Macmillan, 2007) p. 24"]}, {"page": "Outline of forgery", "response": ["* Charles Dawson (1864–1916) — \"discoverer\" of the Piltdown Man"]}]}}