{"wiki_id": "http://www.wikidata.org/entity/Q7225794", "itemLabel": "Polly Frame", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Polly_Frame", "wikipedia_page": {"main": "Polly Frame (born in 1976) is a Scottish actress who was born in Edinburgh, Scotland and is best known to children as Pinky Pinkerton, the hyperactive sports announcer on Disney Channel's pre-school television series Bunnytown.She moved to Galashiels as a child, then to London after spending a year backpacking through India.  Among her TV shows and films are Meet the Magoons and Half Light. A graduate of Bristol University and its Old Vic Theatre, Frame appeared in a modernized version of William Shakespeare's Macbeth.", "link_mentions": [{"page": "After Miss Julie", "response": ["The Young Vic revived After Miss Julie in March 2012 as its first production of Classics for A New Climate. It was directed by Natalie Abrahami. Natalie Dormer played the title role, Kieran Bew John, and Polly Frame Christine. The production was sold-out with Natalie Dormer receiving particularly high praise. Sarah Hemming of the Financial Times gave it 4 out of 5 stars  as did Lyn Gardner in The Guardian calling it 'Natalie Abrahami's compulsively watchable revival' "]}, {"page": "Cleansed", "response": ["*Grace - Polly Frame"]}, {"page": "List of Scottish actors", "response": ["*Polly Frame (born 1976)"]}, {"page": "Bunnytown", "response": ["*Super Silly Sports, also held in Peopletown, hosted by Pinky Pinkerton (portrayed by Scottish actress Polly Frame), best known for her wearing a pink Alice band in her blonde bouffant hairdo along with a matching neck scarf and sportsjacket over a white tennis dress, along with pink and white-striped above-the-knee socks. An example of this spoofing of sports contests and their telecasts within is a staring contest between an 11-year-old boy and an Idaho potato (because both of them have \"eyes\").  Pinky's signature exclamation is \"Oh me, oh my!\" done multiple times."]}, {"page": "Electric Ink", "response": ["* Carol Pilkington (Polly Frame in series 2). Amelia's replacement as News Editor, she formerly worked at the mass-market tabloid newspaper The Sun."]}, {"page": "Earthquakes in London", "response": ["The original cast includes Lucy May Barker, Gary Carr, Brian Ferguson, Polly Frame, Tom Goodman-Hill, Michael Gould, Anna Madeley, Bill Paterson, Jessica Raine, Geoffrey Streatfeild and Lia Williams.Earthquakes in London Cast Credits"]}, {"page": "List of films and television shows shot at Elstree Studios", "response": ["| Bunnytown || Children's || Spiffy, Baker Coogan Productions || 1 || 26 || 2007—2008 || David Rudman || Andrew Buckley, Polly Frame, Ed Gaughan"]}, {"page": "Natalie Abrahami", "response": ["*After Miss Julie by Patrick Marber, Classics for a New Climate, Young Vic, 2012, cast: Natalie Dormer, Kieran Bew, and Polly Frame.Young Vic Classics For A New Climate Young Vic After Miss Julie "]}, {"page": "1976 in Scottish television", "response": ["*Unknown – Polly Frame, actress"]}, {"page": "Louise Stern", "response": ["She directed a film, Celan, based on the poetry of Paul Celan. The first screening had live spoken accompaniment by Polly Frame. The premiere screening of Celan and accompanying live performance took place at a PoetryFilm Equinox event curated by Zata Kitowski."]}]}}