{"wiki_id": "http://www.wikidata.org/entity/Q7236926", "itemLabel": "Pownoll Pellew, 2nd Viscount Exmouth", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Pownoll_Pellew,_2nd_Viscount_Exmouth", "wikipedia_page": {"main": "Pownoll Bastard Pellew, 2nd Viscount Exmouth (1 July 1786 – 3 December 1833) was an English peer and officer of the Royal Navy. He was the eldest son of Edward Pellew, 1st Viscount Exmouth and his wife Susan Pellew (nee Frowde). Like his father, and his younger brother Fleetwood Pellew, he served in the Royal Navy and attained the rank of Post Captain in 1806. He did not achieve great success in the Navy despite the influence of his father.\nPellew first served as a midshipman in 1798 under his father, Sir Edward Pellew, in the 74-gun ship of the line Impétueux. He was described at this time by his father as \"clever and quick, but idle and unmanageable.\"  This was just after the Spithead and Nore mutinies and the ship's company was still restive. A mutiny was put down and the participants were court martialled and hanged at the yard arm or flogged round the fleet in Port Mahon.\nPellew was made a lieutenant well before he had served the mandatory seven years at sea, as Sir Edward had considerable influence with the authorities. Favours in parliament ensured Pownoll's promotion to commander at the very early age of seventeen. His first command was the 18-gun Fly in the West Indies under Admiral Dacres.  Unfortunately Fly was lost on a reef in 1805, though the crew were saved. Pellew underwent the mandatory court martial for the loss of his ship and was found not guilty of negligence. He rejoined his father now at Madras. Admiral Pellew was by this time Commander in Chief of the Navy in the East Indies. Pownoll was immediately made acting-captain of the frigate Sir Francis Drake, and was given Terpsichore upon his father promoting him to post-rank in 1806.\nBoth father and son were becoming wealthy with the prize money to be won in the East Indies. After his first marriage in 1808, Pellew returned to England and started building the new family seat of Canonteign in Devon. He did not stay in the Navy but became involved in politics, serving as Member of Parliament for Launceston from 1812 to 1830. His father's friendship with the Duke of Northumberland was important in his gaining the seat.\nHis father became Lord Exmouth in 1814 and Viscount Exmouth in 1816. When he died in January 1833, Pownoll became the second Viscount Exmouth, a title he enjoyed for just eleven months. He died at age 47 and was succeeded by his eldest son Edward Pellew.", "link_mentions": {}}}