{"wiki_id": "http://www.wikidata.org/entity/Q724791", "itemLabel": "Jack Osbourne", "itemDescription": "English television personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Osbourne", "wikipedia_page": {"main": "Jack Joseph Osbourne (born 8 November 1985) is an English media personality with dual American and British citizenship. The son of heavy metal singer Ozzy Osbourne, he starred on MTV's reality series The Osbournes (2002–2005), along with his father, mother Sharon, and sister Kelly. Osbourne has since pursued a career as a fitness and travel reporter, presenting shows such as Jack Osbourne: Adrenaline Junkie (2005–2009) and BBC's Saving Planet Earth (2007). In 2016, he and his father Ozzy travelled the world in the History Channel reality series Ozzy & Jack's World Detour.", "link_mentions": [{"page": "1985", "response": ["* November 8 – Jack Osbourne, English television personality"]}, {"page": "Ozzy Osbourne", "response": ["The success of The Osbournes led Osbourne and the rest of his family to host the 30th Annual American Music Awards in January 2003. The night was marked with constant \"bleeping\" due to some of the lewd and raunchy remarks made by Ozzy and Sharon Osbourne. Presenter Patricia Heaton walked out midway in disgust. On 20 February 2008, Ozzy, Sharon, Kelly and Jack Osbourne hosted the 2008 BRIT Awards held at Earls Court, London.. Ozzy appeared in a TV commercial for I Can't Believe It's Not Butter! which began airing in the UK in February 2006. Ozzy appears in a commercial for the online video game World of Warcraft. He was also featured in the music video game Guitar Hero World Tour as a playable character. He becomes unlocked upon completing \"Mr. Crowley\" and \"Crazy Train\" in the vocalist career.", "A documentary film about Osbourne's life and career, entitled God Bless Ozzy Osbourne, premiered in April 2011 at the Tribeca Film Festival and was released on DVD in November 2011.. The film was produced by Osbourne's son Jack. On 15 May 2013 Osbourne, along with the current members of Black Sabbath, appeared in an episode of CSI: Crime Scene Investigation titled \"Skin in the Game\". The History Channel premiered a comedy reality television series starring Ozzy Osbourne and his son Jack Osbourne on 24 July 2016 named Ozzy & Jack's World Detour. During each episode Ozzy and Jack visit one or more sites to learn about history from experts, and explore unusual or quirky aspects of their background."]}, {"page": "Fun Lovin' Criminals", "response": ["Huey Morgan is a radio personality on BBC. Morgan has appeared on Jack Osbourne's Adrenaline Junkie, a boy racer show Slips, sat in for Jonathan Ross and Dermot O'Leary on BBC Radio 2, appeared in Soulboy as a Dick Van Dyke accented London record shop owner, voiced a character in the Scarface: The World Is Yours video game, and most bizarrely appeared with Liza Tarbuck on Liza & Huey's Pet Nation on prime-time SKY TV. Morgan now presents regular shows on BBC Radio 2 and BBC Radio 6 Music."]}, {"page": "Austin Powers in Goldmember", "response": ["* Jack Osbourne as Himself"]}, {"page": "1948 in music", "response": ["*December 3 – Ozzy Osbourne, rock singer (Black Sabbath), husband of Sharon Osbourne and father of Kelly Osbourne and Jack Osbourne)"]}, {"page": "Sharon Osbourne", "response": ["In July 2002, Osbourne had surgery for cancer. She announced it was colon cancer and had spread to her lymph nodes and was more serious than originally thought. She survived the disease against a 33% survival prognosis. Despite battling cancer, she insisted that the MTV cameras document her illness during the filming of the second season of The Osbournes. When Osbourne's hair fell out during her subsequent treatment, her wigs were custom made by Cher's wigmaker. Ozzy Osbourne admitted that he \"fell apart\" during her treatment and recovery, and it was revealed that her son, Jack Osbourne, tried to commit suicide because of his depression stemming from his mother's condition."]}, {"page": "2002 in film", "response": ["| Austin Powers in Goldmember || New Line Cinema || Jay Roach (director); Mike Myers, Michael McCullers (screenplay); Mike Myers, Beyoncé Knowles, Michael Caine, Seth Green, Michael York, Robert Wagner, Mindy Sterling, Verne Troyer, Rob Lowe, Fred Savage, Aaron Himelstein, Josh Zuckerman, Eddie Adams, Scott Aukerman, Evan Farmer, Brian Tee, Masi Oka, Clint Howard, Michael McDonald, Donna D'Errico, Fred Stoller, Greg Grunberg, Kinga Philipps, Kevin Stea, Anna-Marie Goddard, Nina Kaczorowski, Nikki Ziering, Ming Tea, Rachel Roberts, Susanna Hoffs, Matthew Sweet, Christopher Ward, Carrie Ann Inaba, Diane Mizota, Tommy \"Tiny\" Lister Jr., Kristen Johnston, Neil Mullarkey, Nobu Matsuhisa, Peter \"Navy\" Tuiasosopo, Heather Graham, Tom Cruise, Danny DeVito, Gwyneth Paltrow, Kevin Spacey, Steven Spielberg, Quincy Jones, John Travolta, Britney Spears, Ozzy Osbourne, Sharon Osbourne, Kelly Osbourne, Jack Osbourne, Willie Nelson, Burt Bacharach, Nathan Lane, Katie Couric || Comedy, Spoof || Live Action"]}, {"page": "2DTV", "response": ["* Enn Reitel – Tony Blair, Jack Straw, John Prescott, Breckin Meyer, Lyle Lovett, Michael Jackson, Johnny Vegas, Daniel Moder, Anthony McPartlin, Jeremy Clarkson, Michael Howard, Will Young, Tom Cruise, George Clooney, Tim Henman, Justin Hawkins, Simon Cowell, Jack Osbourne, Bill Cosby, James Earl Jones, Eddie Murphy, Gordon Ramsay, Jacques Chirac, Phil Spencer, Jared Fogle, Bertie Ahern, David Dimbleby, Peter Andre, Frank Skinner, Des Lynam, Robbie Williams, Gareth Gates, Lawrence Llewelyn-Bowen, Uri Geller, David Blunkett, Charles Kennedy, Liam Neeson, Dick Cheney, Jay Leno, Arnold Schwarzenegger, Conan O'Brien, Prince Philip, Tom Hanks, Prince Edward, Princes William and Harry, Rowan Atkinson, Tim Allen, Osama Bin Laden, Pope John Paul II"]}, {"page": "Tom Felton", "response": ["On 12 November 2008, Felton appeared alongside Jack Osbourne on Adrenaline Junkie as he participated in various challenges in South Africa, including a 200 ft bungee jump on Bloukrans Bridge, took a ride in a helicopter, followed by a parachute freefall and came face-to-face with great white sharks. Felton portrayed Simon in the 2009 horror/thriller movie The Disappeared.The disappeared movie from The New York Times. Harry Potter and the Half-Blood Prince was released in July of that year as a major commercial success; The Hollywood Reporter described Felton's role as \"perennially glowering\" while the plot of the film \"weighs on him, causing his smug veneer to all but melt away.\""]}, {"page": "Macau Tower", "response": ["Jack Osbourne bungee-jumped off the tower as part of the third series of Jack Osbourne: Adrenaline Junkie. Anthony Bourdain bungee-jumped from the top floor of the building in an episode of Anthony Bourdain: No Reservations. It was also used on the Chinese variety show  for episode 1. The two team captains, Wang Han and Yuan Hong, with their members, were given a mission - sky relay - to be completed on the tower as short a time as possible. Yuan Hong's team won the game, and Wang Han's team was given the punishment of bungee-jumping from the Tower. The jump was carried out by team members Xie Na and Joe Chen."]}, {"page": "Ozzfest", "response": ["Ozzfest was an annual music festival tour of the United States and sometimes Europe and later Japan, featuring performances by many heavy metal and hard rock musical groups. It was founded by Sharon Osbourne and her husband Ozzy Osbourne, both of whom also organised each yearly tour with their son Jack Osbourne, and was held almost annually between 1996 and 2018. The Ozzfest tour featured bands of a variety of genres within heavy metal and hard rock, including alternative metal, thrash metal, industrial metal, metalcore, hardcore punk, deathcore, nu metal, death metal, post-hardcore, gothic metal and black metal. Ozzy Osbourne and Black Sabbath played the tour several times over the years."]}, {"page": "Through the Keyhole", "response": ["| 8 || Jimmy CarrStephen MulhernClaudia Winkleman || Russell GrantJack OsbourneJo Wood || 24 December 2015 || Under 1.91"]}, {"page": "American Music Awards", "response": ["|Jack Osbourne, Kelly Osbourne, Ozzy Osbourne and Sharon Osbourne"]}, {"page": "E! True Hollywood Story", "response": ["* The Osbournes (May 17, 2007)(Ozzy, Sharon, Kelly, and Jack Osbourne)"]}, {"page": "Battle of the Network Stars", "response": ["|Variety (1) (10)Joanna KrupaNick LacheyVanessa LacheyGilles MariniJack Osbourne"]}, {"page": "Studio City, Los Angeles", "response": ["* Jack Osbourne, reality show star"]}, {"page": "Crank Yankers", "response": [":Jack Osbourne"]}, {"page": "List of show business families", "response": ["* Rock and roller and 'Heavy Metal' pioneer Ozzy Osbourne and wife, television personality and agent Sharon Osbourne are the parents of actress, Aimee Osbourne, Fashion Police star, singer and actress Kelly Osbourne, and producer/director Jack Osbourne."]}, {"page": "Papa Don't Preach", "response": ["In 2002, British singer Kelly Osbourne recorded a pop-metal cover of the song with Incubus members Mike Einziger (on guitar) and José Pasillas (on drums); the cover was produced by her brother Jack Osbourne. Osbourne's cover was included as a bonus track on her debut album Shut Up and on the soundtrack of MTV's reality television program The Osbournes and was released as her debut single."]}, {"page": "Ugly Kid Joe", "response": ["The band embarked on a tour in support of the album. They did a snowboard tour, a small club tour, and later a stadium tour opening for Bon Jovi and Van Halen. The band excluded \"Everything About You\" from their set list in order to show the fans that they stand tall on their recent material. At a show in Wembley Stadium in London, the band was joined on stage by Ozzy Osbourne's son, Jack Osbourne before playing Sabbath's \"N.I.B\"."]}, {"page": "Ashlee Simpson", "response": ["Simpson embarked on her I Am Me Tour in the final months of 2005 and began dating her drummer Braxton Olita. In March 2006, Simpson won an MTV celebrity surfing invitational competition, which also featured celebrities such as Meagan Good, Jack Osbourne, Ashley Parker Angel, and Tony Hawk. On April 12, 2006, she hosted and performed at the MTV Australia Video Music Awards, where she won \"Best Female Artist\" and \"Best Pop Video\" for the single \"Boyfriend.\"\"Ashlee Simpson, The Veronicas Among The Winners At MTV Australia Video Music Awards\", MTV News, April 13, 2006. Simpson had a nose job in April 2006. In the May 2007 issue of Harper's Bazaar, she said that she was neither insecure about her appearance nor had been so beforehand. She said that plastic surgery was a \"personal choice\" that one should only decide to do for oneself and not for others.Jenny Hontz, Harper's Bazaar, May 2007. In a September 2007 interview, her father, Joe Simpson, explained of the surgery Ashlee had undergone: \"There was a real problem with her breathing and that was cured.\"Roger Friedman, \"Jessica and Ashlee Simpson: Why They're Not Britney Spears\" , Fox News, September 25, 2007. In the middle of 2006, Simpson gave an interview to Marie Claire magazine, in which she was said to have \"had it with Hollywood's twisted view of feminine beauty\" and was photographed painting a pro-female mural with a group of underprivileged girls from Los Angeles' Green Dot Public School.Dennis Hensley, \"Ashlee Simpson's Body Language\", Marie Claire, July 2006, pages 50–54. By the time the magazine hit newsstands, Simpson had already had her nose job, and some Marie Claire readers complained that this was hypocritical. The magazine received over 1,000 letters of complaint and the magazine's new editor expanded the letters section of the September issue of the magazine to give readers a chance to vent their frustrations.\"Marie Claire Goes Edgy and Anti-Simpson\", Rollingstone.com, July 31, 2006.Jennifer Vineyard, \"Marie Claire Editor, Readers Lash Out At Ashlee Simpson\", MTV News, August 4, 2006."]}, {"page": "International Spy Museum", "response": ["*Ozzy and Jack Osbourne in the eighth episode of season 1 of Ozzy and Jack's World Detour, visit the museum.  "]}]}}