{"wiki_id": "http://www.wikidata.org/entity/Q724227", "itemLabel": "Jimi Mistry", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimi_Mistry", "wikipedia_page": {"main": "Jimi Mistry (born 1 January 1973) is an English actor, known for  appearing in numerous films such as East Is East, Blood Diamond, The Guru, 2012, West is West, Ella Enchanted and The Truth About Love. He is also best known for his roles, as Dr Fonseca in BBC1 soap opera EastEnders, Latif in Cinemax series Strike Back, Kal Nazir in long-running ITV soap opera Coronation Street, and as Tom Bedford in Kay Mellor drama The Syndicate.\n\n", "link_mentions": [{"page": "1973", "response": ["** Jimi Mistry, English actor"]}, {"page": "2001 in film", "response": ["| Born Romantic || United Artists || David Kane (director/screenplay); Craig Ferguson, Jane Horrocks, Catherine McCormack, David Morrissey, Olivia Williams, Adrian Lester, Jimi Mistry, Kenneth Cranham, John Thomson, Ian Hart, Paddy Considine, Hermione Norris, Sally Phillips, Jessica Hynes, Ashley Walters || Comedy || Live action"]}, {"page": "2002 in film", "response": ["* The Guru, starring Jimi Mistry, Heather Graham and Marisa Tomei – (UK/France/US)"]}, {"page": "2003 in film", "response": ["| The Guru || Universal Pictures / StudioCanal / Working Title Films || Daisy von Scherler Mayer (director); Tracey Jackson (screenplay); Jimi Mistry, Heather Graham, Marisa Tomei, Michael McKean, Christine Baranski, Dash Mihok, Bobby Cannavale, Emil Marwa, Ronald Guttman, Malachy McCourt, Ajay Naidu, Anita Gillette, Pat McNamara, Dwight Ewell || Comedy || || Live Action"]}, {"page": "1999 in film", "response": ["* East is East, starring Om Puri, Linda Bassett and Jimi Mistry (U.K.)"]}, {"page": "Heather Graham", "response": ["Graham's other appearances in mainstream fare include playing a fictionalized version of the Jack the Ripper murder victim Mary Kelly in the film From Hell (2001), starring Johnny Depp; Anger Management (2003), starring Adam Sandler and Jack Nicholson; the Farrelly Brothers comedy Say It Isn't So (2001), opposite Sally Field; The Guru, co-starring Jimi Mistry, and Hope Springs (2003), co-starring Colin Firth."]}, {"page": "Birmingham City University", "response": ["Art and design alumni include cartoonist Alex Hughes,  artist Barbara Walker, fashion designer Betty Jackson,  photographer Ravi Deepres, artist Rob Pepper, and industrial product designer Hans Ramzan. Graduates in the performing arts include musicians Roy Priest (formerly of Sweet Jesus) and Nick Duffy, singer-songwriter Stephen Duffy, actors Jimi Mistry, Catherine Tyldesley and Tom Lister, comedian Frank Skinner,  singer and The X Factor contestant Rhydian Roberts, and bass guitarist John Taylor, founder of Duran Duran and HSBC's CEO Noel Quinn, leading one of UK's largest banks."]}, {"page": "Spooks (TV series)", "response": ["The programme was created by writer David Wolstencroft, and produced by Kudos for the BBC. A trademark style, coupled with the series' popularity, attracted a large number of high-profile guest stars. These included Martine McCutcheon, Hugh Laurie, Haluk Bilginer, Robert Hardy, Tim McInnerny, Bruce Payne, Reece Dinsdale, Ian McDiarmid, Ewen Bremner, Jimi Mistry, Andy Serkis, Benedict Cumberbatch, Kevin McNally, Rupert Graves, Andrew Tiernan, Anton Lesser, Anupam Kher, Alexander Siddig, and Anthony Head."]}, {"page": "List of fictional doctors", "response": ["|EastEnders || Dr. Harold LeggDr. Jaggat SinghDr. David SamuelsDr. Fred Fonseca Dr. Johnathon LeroyDr. Oliver CousinsDr. May WrightDr. Anthony TruemanDr. Poppy MerrittDr. Al JenkinsDr. Yusef Khan || Leonard FentonAmerjit DeuChristopher ReichJimi MistryTom EllisIvan KayeAmanda DrewNicholas BaileyAmy DarcyAdam CroasdellAce Bhatti"]}, {"page": "Radyr", "response": ["Several notable people are associated with Radyr. The children's author Roald Dahl (1916–90) lived in the 1920s at a house called Tŷ Mynydd in Radyr (which was demolished in 1967). He called it an \"imposing country mansion, surrounded by acres of farm and woodland\" in his book Boy: Tales of Childhood. Jimi Mistry (born 1973), who is an Asian-British actor and appeared in EastEnders, The Guru and East Is East, attended Radyr Comprehensive School. Actor Harry Ferrier also went to Radyr Comprehensive as he grew up in Radyr. and Tess Griffiths (Nee Davies)."]}, {"page": "Strictly Come Dancing", "response": ["| Jimi Mistry", "|Jimi Mistry"]}, {"page": "The Guru (2002 film)", "response": ["The film stars Jimi Mistry as the eponymous character, Heather Graham as the actress he learns from, and Marisa Tomei, who helps him reach his guru status among her socialite New York City friends.  The film was a commercial success, grossing $24 million in worldwide box office against its budget of $11 million.", "Ramu Gupta (Jimi Mistry), a dance teacher, leaves his native city Delhi, India, to seek his fortune in the United States. He is lured by the exaggerations of his cousin, Vijay, who has already moved to NYC.", "* Jimi Mistry as Ramu Gupta"]}, {"page": "East Is East (1999 film)", "response": ["*Jimi Mistry – Tariq \"Tony\" Khan"]}, {"page": "Birmingham School of Acting", "response": ["Alumni of the school included Ashley Rice, Nicol Williamson, Tom Lister, Catherine Tyldesley, Rachel Bright, Barbara Keogh, Luke Mably, James Bradshaw, Stephen Laughton, Jeffrey Holland, David Holt, Anna Brewster, Jimi Mistry, Helen George, Perry Cree, Ainsley Howard, Tania Hales-Richardson, Carole Boyd, Rosemary Pountney and Nicholas Gledhill."]}, {"page": "Elle Style Awards", "response": ["*Actor - Jimi Mistry"]}, {"page": "Harold Legg", "response": ["Dr Legg's appears semi-regularly from this time, usually only when another character needs medical assistance or advice. However, he remains Walford's GP. He officially retires and leaves after February 1997 and is replaced with a younger, trendier doctor named Fred Fonseca (Jimi Mistry).", "The character served as Walford's GP for 14 years. Although his first name of Harold was first spoken by the visiting DI Marsh (Harry Miller) in the final scene of the show's second episode in 1985, he has always been referred to by the majority of the other characters and in the closing credits as \"Dr Legg\". Though a regular character with his own storylines throughout the 1980s, for much of the 1990s he was a recurring character, making increasingly sporadic appearances, and only when other characters needed medical assistance. In 1998, the executive producer of EastEnders, Matthew Robinson, announced that he was officially retiring Dr Legg. The character was one of many axed by the producer, who was dubbed the \"axeman\" by the British press. Speaking of his decision, Robinson commented \"Dr Legg is getting on a bit, so we're retiring him. He'll be going to a nice cottage in the country.\" His place was filled by a younger alternative medicine fan, Dr Fred Fonseca, played by Jimi Mistry. Leonard Fenton has since spoken about his frustration that Dr Legg did not get to practice enough, claiming that he \"was frustrated for years by Dr Legg's sporadic appearances\". In an interview in 2000, Fenton commented \"I told them I wasn't happy about going on once every two months. That's why it ended...\". Dr Legg was never given an official exit on-screen, his retirement is mentioned by Dr Fonseca in January 1999, when the character Ruth Fowler (Caroline Paterson) requests to see him. "]}, {"page": "Foxdale A.F.C.", "response": ["In 2004, Momentum Pictures used Billy Goat Park in some of the filming of Things to Do Before You're 30. It was released in the UK on 2 June 2006 and was directed by BAFTA Award winner, Simon Shore. The film is a remake of 1997 Dutch film All Stars and stars the likes of Billie Piper, Jimi Mistry, Dougray Scott, Emilia Fox and Shaun Parkes."]}, {"page": "Tracy Barlow", "response": ["Tracy starts an affair with Tony Stewart (Terence Maynard), who is in a relationship with Steve's mother Liz McDonald (Beverley Callard), but tells Liz about it before Steve and Michelle Connor's (Kym Marsh) wedding in May 2015, in which she becomes more jealous about Carla and seeks revenge, that night Tracy sneaks into Carla's flat and tries killing her however she hears someone go to the toilet, who unbeknown to her is Amy, and leaves a candle which she lit to guide her way around the flat near a lamp and runs out causing a fire. Leanne Battersby (Jane Danson) sees the fire and breaks into the flat and manages to get Carla out before her fiancé Kal Nazir (Jimi Mistry) arrives and manages to get Leanne and Amy out before the flat explodes killing him and also Maddie Heath (Amy James-Kelly). As Tracy is nowhere to be seen everyone blames Carla for the fire, making Tracy happy."]}, {"page": "Simon Webbe", "response": ["In 2004 he co-starred in the romantic-comedy The Truth About Love, directed by John Hay. The film also featured Jennifer Love Hewitt, Dougray Scott and Jimi Mistry. His second acting project was a 2006 British gangster movie, Rollin' with the Nines. The film co-starred Vas Blackwood, Billy Murray, Robbie Gee and was directed by Julian Gilbey."]}, {"page": "Rovers Return Inn", "response": ["In 2015, Liz McDonald's (Beverley Callard) boyfriend Tony Stewart (Terence Maynard) grows tired of her and plots with secret lover Tracy Barlow (Kate Ford) to take the pub from the McDonalds. Tony falsely tells Steve McDonald (Simon Gregson) that he needs back the money that he lent him, forcing Steve to sell his 50% of The Rovers. Steve gets an offer from a pub chain called \"Travis Limited\" and accepts it, not knowing that Tony is the real buyer. After being successful in purchasing Steve's share of the pub, Tony sets in motion his mission to con Liz into selling her 50% to \"Travis Limited\" as well, persuading her that they should start afresh a little further away from Weatherfield. When she refuses, he arranges for two of his criminal friends to attack her in the bar. Tony manages to persuade Liz to sell up, promising a new life in Spain with her; however, Michelle Connor's (Kym Marsh) best friend, Carla Connor (Alison King), offers to buy Liz out of the pub. A furious Tony tries to persuade Liz to honour her deal with \"Travis Limited\" but Liz decides to sell her share to Carla after she promises to keep Steve and Michelle as the pub's licensees. In revenge on Carla for offering to buy The Rovers, Tracy sets the Victoria Court flats on fire with Carla and her own daughter, Amy Barlow (Elle Mulvaney), trapped inside. Both Carla and Amy survived the blaze; however, Kal Nazir (Jimi Mistry) and Maddie Heath (Amy James-Kelly) are both killed in an explosion during the fire. Before Carla can sign on the dotted line, Liz learns from a vengeful Tracy of Tony's plan to get the pub. Therefore, Liz still owns her half of the pub while Tony owns the other half."]}, {"page": "Leanne Battersby", "response": ["Leanne develops an attraction to Kal Nazir (Jimi Mistry). They initially attempt to distance themselves from one another fearing a relationship would ruin Nick's recovery from brain damage. When they start a relationship, Nick fires Leanne. She and Kal overcome problems in their relationship and she files for divorce from Nick. Nick behaves harshly towards Leanne and informs Kal's family about Leanne's prostitution past. Leanne begins work at the kebab shop and halts her divorce fearing the stress will take its toll on Nick's health. Nick admits that he faked the effects of his injury after Leanne confronts Nick and smashes items in his restaurant, during Kylie's birthday party, she then returns to working there in December 2014."]}, {"page": "The Truth About Love (film)", "response": ["The Truth About Love is a 2005 film directed by John Hay and starring Jennifer Love Hewitt, Jimi Mistry and Dougray Scott.", "After Alice Holbrook (Jennifer Love Hewitt), a happily married English woman living in Bristol, receives an anonymous Valentine's Day card with radish seeds in it, she automatically assumes the card is from her supposedly loving lawyer husband, Sam (Jimi Mistry), and that he is trying to be romantic. In return, Alice decides to write an anonymous reply to her husband to keep the gimmick going, but only accidentally sends the card after a drunken night with her sister. What Alice does not realise, however, is that her husband did not, in fact, send her the original Valentine's Day card; her husband's best friend and lawyer partner, Archie (Dougray Scott), did.", "* Jimi Mistry – Sam Holbrook"]}, {"page": "Weatherfield", "response": ["A joint venture between local businessman Dev Alahan (Jimmi Harkishin) and personal trainer Kal Nazir (Jimi Mistry). Kal's father, Sharif (Marc Anwar), also has shares within the business. The facility was used by many local residents including Gail McIntyre (Helen Worth), Nick Tilsley (Ben Price), Gary Windass (Mikey North), Mary Taylor (Patti Clare), Eva Price (Catherine Tyldesley), Steve McDonald (Simon Gregson), Sarah Platt (Tina O'Brien), Zeedan Nazir (Qasim Akhtar), Bethany Platt (Lucy Fallon), Callum Logan (Sean Ward) and Jason Grimshaw (Ryan Thomas). The gym has not appeared since 2016. It went bankrupt, and the former staff have new jobs."]}, {"page": "Amy Barlow", "response": ["In May 2015, Amy, along with Carla Connor (Alison King), becomes trapped in a fire in the Victoria Court flats after it was accidentally started by Tracy. Carla is rescued while Leanne and her partner, Kal Nazir (Jimi Mistry) enter the flat to save Amy, but Kal, Leanne and Amy all become trapped when the roof caves in, blocking the door. Luckily, the fire brigade arrive and manage to get Leanne and Amy out of the flat, but an explosion happens, killing Kal. However, Amy does not seem to take Kal's death seriously and feels happier that she was rescued from the fire. In July 2015, Amy is upset to learn that Deirdre died just before she was due to return to Weatherfield. Simon and Amy are both left money by Deirdre in her will. In September 2015, Amy starts at Weatherfield High School and she also decides to take up violin lessons. In November 2015, Simon moves in with the Barlows because he has been physically abusing his adoptive mother, Leanne Battersby (Jane Danson). Amy annoys Simon with her violin, he tries to take the violin from Amy, however Ken catches them arguing and they come up with a solution. Simon and Amy are left alone at the Barlow house and Simon ends up hurting Amy. Amy tells Ken and Tracy, who contact Leanne, who is encouraged by her half-sister Eva Price (Catherine Tyldesley) to admit Simon has been hurting her. Leanne has to take Simon home and the family agree to get Simon help."]}, {"page": "Raoul Bhaneja", "response": ["Bhaneja's first starring role in a feature film was with Andy Jones and Mary Walsh in Extraordinary Visitor in 1998. Directed by John Doyle, it debuted at The Toronto International Film Festival.  Other features include Atom Egoyan's Ararat, The Sentinel opposite Michael Douglas , Godsend with Rebecca Romin,  Touch of Pink with Jimi Mistry and Kyle MacLachlan, Weirdsville with Wes Bentley, the romantic comedy The Right Kind of Wrong, the U.S. independent film As Good As You, Portrait of a Serial Monogamist, Ice Soldiers,  Miss Sloane, opposite Jessica Chastain, HBO Films Fahrenheit 451 and the 2020 Sundance breakout Possessor opposite Christopher Abbot."]}, {"page": "List of former EastEnders characters", "response": ["|Fred Fonseca || Jimi Mistry || 1998–2000"]}, {"page": "Dev Alahan", "response": ["In 2014, Dev begins to develop feelings for Stella and he decides that he is unfit. Gary Windass (Mikey North) hears Dev talking about this, and recommends his army friend Kal Nazir (Jimi Mistry), who has left the army and became a personal trainer. Initially, Dev declines the offer. However, Kal visits the Rovers and Dev later agrees to let Kal help him in his goal to get fit. Kal also begins training with Nick Tilsley (Ben Price), who is still suffering mentally after being involved in a car crash with his brother. On Dev's fiftieth birthday, he asks Stella for a drink. They both return to Dev's flat, unaware that Kal, Lloyd Mullaney (Craig Charles), Steve McDonald (Simon Gregson) and Andrea Beckett (Hayley Tamaddon) are hiding behind his sofa to surprise him. Dev tells Stella that he loves her, only for her to gently reject him, as the four behind the sofa emerge. Dev feels embarrassed."]}, {"page": "V Graham Norton", "response": ["| 16 Jul 2002 || 52 || Jimi Mistry"]}, {"page": "Artistic depictions of the partition of India", "response": ["Directed by Vic Sarin Partition, is a Canada/UK/South Africa co-production. A retired Sikh military officer (played by Jimi Mistry) helps and falls in love with a Muslim teenaged girl (played by Kristin Kreuk)."]}, {"page": "Radyr Comprehensive School", "response": ["* Jimi Mistry, Actor, known for roles on EastEnders, The Guru and East Is East.Bourton, Tom. \"On the global Taff Trail\", BBC News, 21 August 2002. Accessed 12 June 2007. \"Making all the noise this week across the UK media is the premiere of Hollywood meets Bollywood flick The Guru, starring Jimi Mistry and Heather Graham.... I went to school in Radyr, and my wife's from Brecon, so my feet are firmly in Wales - I was always a regular in the hotspots of Cardiff, he said.\""]}, {"page": "Royal Birmingham Conservatoire", "response": ["In 2017 the conservatoire merged with the Birmingham School of Acting, which had been founded as a drama school in 1936, bringing music and drama teaching together into a single organisation. Alumni of the school include Nicol Williamson, Tom Lister, Catherine Tyldesley, Rachel Bright, Barbara Keogh, Luke Mably, James Bradshaw, Stephen Laughton, Jeffrey Holland, David Holt, Anna Brewster, Jimi Mistry, Helen George, Ainsley Howard and Nicholas Gledhill."]}, {"page": "Josie McFarlane", "response": ["Josie initially gets herself a job as a barmaid at The Queen Victoria public house and she later becomes the receptionist at Fred Fonseca (Jimi Mistry)'s surgery. However, things do not run smoothly for her in her new post. Josie is a strict perfectionist, she also expects perfection from everyone else and she isn't adverse to telling them so either. Her strict mannerisms only seek to frighten away half the patients. She eventually manages to settle down with a lot of coaching from Dr Fonseca, however, yet more problems arise when she discovers that her employer is homosexual. Josie is a strict Christian and she feels that working for a homosexual conflicts with her religious beliefs. She goes as far as to accuse him of coercing Kim into becoming a lesbian. She continues down a path of self-righteousness, judging everyone by her own, impossibly high standards. After she discovers that her son has become involved with ex-prostitute, Nina Harris (Troy Titus Adams), she cannot condone their friendship and her aloof manner towards Nina infuriates Mick. It takes bigoted remarks by racist Jim Branning (John Bardon) to make Josie realise that she is as prejudiced in her own way as he is, but by then it is too late. Having forgotten to renew her visa, she is threatened with deportation and is forced to return to Jamaica, leaving Kim in Mick's care. She promises Kim she will return when she sorts out her visa. Her last appearance is in February 2000."]}, {"page": "Fred Fonseca", "response": ["Dr Fred Fonseca is a fictional character from the popular soap opera EastEnders, played by Jimi Mistry from 13 September 1998 to 10 February 2000.", "In July 1998 it was announced that actor Jimi Mistry would be playing the part of Fred, \"an attractive young doctor\". Commenting on his new role, Mistry said \"Let's hope it's a prescription for success - I'm working on my bedside manner\".", "The character's most notable storyline concerns him coming out as a homosexual, and as a result being subjected to homophobia from several other characters. In May 1999, it was reported that bosses at EastEnders were struggling to hold on to actor Jimi Mistry, due to the box office success of a low-budget film he made prior to joining the soap, East is East. Executive producer Matthew Robinson commented, \"We've got Jimi signed up until early next year but by then his choice will be Hollywood or Walford...It could be tricky.\" The film was an international success, and at the end of his contract in 2000, Mistry left EastEnders to pursue a career as a film actor. At the time the press claimed that Mistry quit because his character was \"boring\", and Mistry has since commented that he found playing Fred \"quite hard\"."]}, {"page": "Touch of Pink", "response": ["Touch of Pink is a 2004 Canadian-British gay-themed romantic comedy film written and directed by Ian Iqbal Rashid and starring Jimi Mistry and Kyle MacLachlan. The film takes its title from the Cary Grant film That Touch of Mink.", "* Jimi Mistry as Alim"]}, {"page": "January 1973", "response": ["*Born: Jimi Mistry, English actor, in Scarborough; Rabaki Jeremie Ouedraogo, Burkina Faso road cycling champion"]}, {"page": "Carla Connor", "response": ["Carla accompanies Hayley to the hospital for a scan, where she is diagnosed with pancreatic cancer. Throughout Hayley's illness, she confides in Carla, who becomes protective of her. Carla and Anna Windass (Debbie Rush) find Hayley deceased on her bed with her husband, Roy Cropper (David Neilson). Carla then supports Roy as he grieves for Hayley, and is shocked to learn that Hayley committed suicide. Roy and Carla subsequently become good friends. Carla and Peter hire Tina McIntyre (Michelle Keegan) as a babysitter for Simon. Carla and Peter get married in December 2013, just as Rob discovers that Peter is having an affair with Tina. Tina tries to persuade Peter to leave Weatherfield with her. He agrees, although he feels conflicted, wanting to remain in Weatherfield with Carla. During an argument with Rob and Tracy in The Rovers, Carla announces that she is pregnant just as Tina arrives to collect Peter. Tina storms out, swiftly followed by Peter. They have an almighty argument, ending in Tina scratching Peter across his face. Peter leaves, as Rob visits Tina and attacks her, telling her not to tell Carla about her affair with Peter. Unknown to Rob, Peter tells Carla about the affair. Tina tries to escape Rob, leading to the balcony of the building yard. A scuffle ensues and as Rob pushes Tina; she loses her balance and falls from the balcony, plummeting onto the cobbles below. Rob thinks Tina is dead and leaves the flat, before hearing Tina's groans and realises she is still alive. When Tina reveals that she will lie to the police that Rob intentionally tried to kill her, Rob picks up a metal pipe and brutally beats Tina. Meanwhile, Carla is furious about Peter's affair and storms out into a busy pub, shouting that she wants to \"kill\" Tina. She is restrained by Michelle but eventually leaves the pub. Carla goes to Tina's flat and finds her seriously injured at the bottom of the balcony, and is seen by Leanne and Kal Nazir (Jimi Mistry), and soon finds herself prime suspect. She is arrested due to her fingerprints being on the weapon but later released without charge. At first, it is an assault investigation, but when Tina later dies from her injuries in hospital, it turns into a murder investigation. Carla confides in Roy repeatedly and slaps Peter when he tries to talk to her. Her stress finally catches up with her and she collapses in the street when Rob and Peter are fighting. She is rushed to the hospital, where she is told that she has suffered a miscarriage. Carla struggles to cope with her miscarriage and gets drunk to drown her sorrows. When Rob confesses to Tina's murder to Carla, she fights with him and ultimately chooses to tell the police; Rob is arrested and charged with Tina's murder. From this, Carla begins an intense feud with Tracy."]}, {"page": "Ella Enchanted (film)", "response": ["* Jimi Mistry as Benny, Mandy's boyfriend whom she had accidentally transformed into a giant magic book-(before the films events) and a pumpkin for a short time. He is later turned back into his human form towards the end of the film.", "Jimi Mistry, a British actor of Indian descent, said that he enjoyed playing a talking book in the film because it offered him the opportunity to do something different from his other roles. \"You can't get less Indian than a talking book, and an American talking book, so it was great,\" he said."]}, {"page": "Ethnic Multicultural Media Academy", "response": ["| Jimi Mistry"]}, {"page": "Flavia Cacace", "response": ["| Jimi Mistry", "|Jimi Mistry", "Cacace featured in the eighth series of the show, where her celebrity partner was actor Jimi Mistry. In the first week, their dance was given a score of 26 and they went on to make it to week 6 when they were eliminated despite finishing fourth on the leaderboard, a result that was widely seen as surprising.", "Cacace currently resides in Devon, with her former Strictly Come Dancing partner, Jimi Mistry.  She announced on Twitter on 5 January 2013 that they were engaged, and their marriage took place in London on 28 December 2013.Digital Spy, \"Coronation Street's Jimi Mistry marries Strictly dancer Flavia Cacace\". Accessed 29 December 2013"]}, {"page": "Storylines of Coronation Street", "response": ["Carla's flat is soon engulfed in flames, but she is quickly rescued by Leanne Battersby (Jane Danson). Carla then reveals that Tracy's daughter Amy (Elle Mulvaney) is still inside and both Leanne and her boyfriend Kal Nazir (Jimi Mistry) go back inside to find her. As concerned onlookers soon arrived to help out, Leanne and Amy are helped to safety, with Leanne agreeing to marry Kal, having proposed to her shortly before the fire. Suddenly, a gas cylinder ignites on the balcony and the flat erupts in a huge fireball. Kal is pronounced dead at the scene, after he was still trapped on the balcony at the time of the explosion."]}, {"page": "The Mystic Masseur", "response": ["*Jimi Mistry as Pratap Cooper"]}, {"page": "Partition (2007 film)", "response": ["Partition is a 2007 English-language period film directed by Vic Sarin, written by Patricia Finn and Vic Sarin, and starring Jimi Mistry and Kristin Kreuk. The film is set in 1947, based on the Partition of India and was partially shot in Kamloops, British Columbia, Canada.", "Determined to leave the ravages of war behind, 38-year-old Gian Singh (Jimi Mistry) resigns from the British Indian Army to a quiet life. His world is soon thrown in turmoil when he finds himself responsible for the life of a 17-year-old Muslim girl separated from her family and traumatised by the conflict of the Partition of India. Resisting all the taboos of religious divide, Gian finds himself slowly falling in love with the vulnerable Naseem (Kristin Kreuk).", "*Jimi Mistry as Gian Singh / Mohammad Hassan"]}, {"page": "Things to Do Before You're 30", "response": ["Things to Do Before You're 30 is set in Greenwich, London with a large ensemble cast including Dougray Scott, Emilia Fox, Billie Piper, Jimi Mistry, Shaun Parkes, Bruce Mackinnon, George Innes, George Irving, Rosie Cavaliero, Nina Young, Danny Nussbaum, David Paul West & Neil McGuinness.", "Cass (Dougray Scott), the team's top scorer on and off the pitch, isn't sure he's ready for fatherhood with Kate (Emilia Fox), the love of his life. Adam (Shaun Parkes) still hasn't told the rest of the team he's gay. Colin (Bruce Mackinnon) is desperate to have a threesome even though he's just started going out with the lovely Vicky (Billie Piper). Dylan (Jimi Mistry) is in love with the woman his father is about to marry. Billy (Roger Morlidge) is trying to save his marriage. Johnny (Danny Nussbaum) is not ready to accept the fact that his father, who started the team all those years ago, is dying."]}, {"page": "The Syndicate", "response": ["*Jimi Mistry as Tom Bedford"]}]}}