{"wiki_id": "http://www.wikidata.org/entity/Q724215", "itemLabel": "David Moores", "itemDescription": "British football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Moores", "wikipedia_page": {"main": "David Richard Moores (born 15 March 1946) is the former chairman (1991–2007) and now honorary life president of Liverpool F.C..", "link_mentions": [{"page": "Liverpool F.C.", "response": ["As the owner of Anfield and founder of Liverpool, John Houlding was the club's first chairman, a position he held from its founding in 1892 until 1904. John McKenna took over as chairman after Houlding's departure. McKenna subsequently became President of the Football League. The chairmanship changed hands many times before John Smith, whose father was a shareholder of the club, took up the role in 1973. He oversaw the most successful period in Liverpool's history before stepping down in 1990. His successor was Noel White who became chairman in 1990. In August 1991 David Moores, whose family had owned the club for more than 50 years, became chairman. His uncle John Moores was also a shareholder at Liverpool and was chairman of Everton from 1961 to 1973. Moores owned 51 percent of the club, and in 2004 expressed his willingness to consider a bid for his shares in Liverpool.", "* Honorary life president:  David Moores"]}, {"page": "George N. Gillett Jr.", "response": ["Since October 2006, Gillett and fellow American Tom Hicks had been parties interested in a proposed takeover of Liverpool F.C. of the Premier League. In January 2007, Reports stated that Gillett had made another bid for Liverpool. On January 31, 2007, Dubai International Capital announced they had pulled out of the deal, giving Gillett the opportunity to buy the club from David Moores. On February 2, 2007, Gillett and Hicks reached a deal with the club's board, which was sealed on February 6, thought to be worth in the region of £435 million: £220 million to buy out existing shareholders (including approximately £44.8 million of debt), and £215 million for the new stadium proposed at nearby Stanley Park. The Board unanimously recommended that the club's shareholders accept this offer."]}, {"page": "Billy Liddell", "response": ["In 2002, former Liverpool Reserve player Jimmy Rolfe loaned to Anfield Museum a No. 11 shirt believed to be the only surviving example worn by Liddell in the league. He had acquired it from trainer Albert Shelley on leaving for Chester in 1953.Faulkner, Scott (2005), A Liddell piece of history, Liverpool Echo, 1 March 2002, liverpoolecho.co.uk. Retrieved 14 July 2008. On 4 November 2004, widow Phyllis and Ian Callaghan unveiled a commemorative plaque adjacent to the museum.Jones, David (2004), Reds honour a true great; Legends join in tributes to giant of game, Liverpool Echo, 5 November 2004, liverpoolecho.co.uk. Retrieved 13 July 2008. Liddell's biographer John Keith, who also presented on BBC Radio Merseyside, had proposed the memorial to then chairman David Moores and chief executive Rick Parry.Reds honour legend Billy Liddell, BBC News, 4 November 2004, news.bbc.co.uk. Retrieved 10 July 2008. Further recognition came in 2006 when Liddell attained sixth place in a poll of more than 110,000 people conducted by Liverpool's official website to determine a list of \"100 Players Who Shook The Kop\".Platt, Mark (2006), 100 PWSTK – No. 6: Billy Liddell, liverpoolfc.tv. Retrieved 8 August 2010. When Liverpool approached former players to identify their personal favourites as a complement to the list, Ian Callaghan, Tommy Smith, David Johnson, and Roy Evans included Liddell in their \"top five\".Hunter, Steve (2006), 11 Legends Pick Their Top 5 Players, liverpoolfc.tv. Retrieved 8 August 2010. The Football League included Liddell in a 1998 list of notable players, titled the \"100 Legends\".Sport: Football Legends list in full, BBC News, 5 August 1998, news.bbc.co.uk. Retrieved 8 August 2010."]}, {"page": "List of professional sports team owners", "response": ["* Moores family, among them John Moores and David Moores (1930s-2007)"]}, {"page": "Liverpool F.C.–Manchester United F.C. rivalry", "response": ["The 2005 leveraged takeover of Manchester United by the Glazer family created a schism amongst Manchester fans, directly causing the creation of F.C. United of Manchester, and the \"Love United Hate Glazer\" movement, and subsequently the Red Knights who attempted to buy the Glazers out the club. Two years later, Liverpool went through its own controversial takeover when Chairman David Moores sold the club to American businessmen George Gillett and Tom Hicks. Disagreements between Gillett and Hicks, and the lack of popular support from fans, resulted in the pair looking to sell the club. Martin Broughton was appointed chairman of the club on 16 April 2010 to oversee its sale. Court action finally forced the sale of the club to Fenway Sports Group."]}, {"page": "Rick Parry", "response": ["Parry was appointed as chief executive at Liverpool in July 1998 by then chairman David Moores."]}, {"page": "April 1963", "response": ["*The Beatles performed at Stowe School in Buckinghamshire, UK, for a fee of £100, having accepted a personal request from schoolboy David Moores, a fellow Liverpudlian (and later chairman of Liverpool F.C.)."]}, {"page": "Timeline of Liverpool", "response": ["** David Moores sells Liverpool F.C. to American entrepreneurs Tom Hicks and George N. Gillett Jr.."]}, {"page": "Moores, David", "response": ["#redirectDavid Moores"]}, {"page": "List of leaders of dependent territories in 2017", "response": ["***#David Moores, Acting Administrator of Tristan da Cunha (for Sean Burns) (2018)"]}]}}