{"wiki_id": "http://www.wikidata.org/entity/Q725542", "itemLabel": "Chad Varah", "itemDescription": "English Anglican priest (1911-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chad_Varah", "wikipedia_page": {"main": "Edward Chad Varah  (12 November 1911 – 8 November 2007) was a British Anglican priest and social activist from England. In 1953, he founded the Samaritans, the world's first crisis hotline, to provide telephone support to those contemplating suicide.", "link_mentions": [{"page": "November 8", "response": ["*  2007   – Chad Varah, English priest, founded The Samaritans (b. 1911)"]}, {"page": "1911", "response": ["** Chad Varah, British priest and humanitarian (d. 2007)"]}, {"page": "Lincolnshire", "response": ["* Chad Varah (1911–2007), priest and \"The Samaritans\" founder"]}, {"page": "Samaritans (charity)", "response": ["Samaritans was founded in 1953 by Chad Varah, a vicar in the Church of England Diocese of London. His inspiration came from an experience he had had some years earlier as a young curate in the Diocese of Lincoln. He had taken a funeral for a fourteen-year old girl who had killed herself because she feared she had contracted an STD. In reality, she was menstruating.", "The movement grew rapidly: within ten years there were 40 branches and now there are 201 branches across the UK and Ireland helping many, deliberately organised without regard to national boundaries on the basis that a service which is not political or religious should not recognise sectarian or political divisions. Samaritans offers support through over 21,200 trained volunteers (2015) and is entirely dependent on voluntary support. The name was not originally chosen by Chad Varah: it was part of a headline to an article in the Daily Mirror newspaper on 7 December 1953 about Varah's work.", "===Chad Varah breaks with Samaritans==="]}, {"page": "Dan Dare", "response": ["Hampson's working habits twice caused him to suffer serious breakdowns in health, leaving his assistants to continue the series. The first occurred after two episodes of \"Marooned on Mercury\" (1952), which was taken over by Harold Johns, from scripts by Samaritans founder and clergyman Rev. Chad Varah, who had known Marcus Morris in Southport. Hampson returned to start the following story, \"Operation Saturn\" (1953), but suffered a relapse after 20 weeks. Principal art was taken over by new chief assistant Don Harley, who completed the story and its successor, \"Prisoners of Space\" (the only series to feature extensive work by an artist outside the studio, finishes being provided by Desmond Walduck)."]}, {"page": "Barton-upon-Humber", "response": ["|Chad Varah"]}, {"page": "Lady Sarah Chatto", "response": ["Lady Sarah met Daniel Chatto during her sabbatical in India with her father in the 1980s. Chatto was also working on a film, albeit a different one—Heat and Dust. He is from a theatrical family, the son of actor Tom Chatto (1920–1982) and the theatrical agent Ros Chatto (born Rosalind Joan Thompson; died 2012). He proposed to her with a \"vintage cluster ring.\" The couple married on 14 July 1994, the marriage being officiated by the Reverend Chad Varah, founder of the Samaritans, at St Stephen's, Walbrook, in the City of London. The bride's wedding gown was designed by Jasper Conran. Her bridesmaids were all young teenagers: her half-sister Lady Frances von Hofmannsthal, Zara Phillips (daughter of her cousin Anne, Princess Royal), and Tara Noble-Singh, a family friend. The couple have two sons:"]}, {"page": "Chad of Mercia", "response": ["Chad remains a fairly popular given name, one of the few personal names current among 7th century Anglo-Saxons to do so. However, it was very little used for many centuries before a modest revival in the mid-20th century. Not all of its bearers are named directly after Chad of Mercia. Perhaps the best-known Chad of modern times who was so-named was Chad Varah, an Anglican priest and social activist, whose father was vicar of Barton-upon-Humber – the probable site of Chad's monastery in the north of Lindsey."]}, {"page": "Eagle (British comics)", "response": ["While Morris (who by now had resigned from St James) edited the magazine from Hulton's premises at Shoe Lane in London, the comic was created in a converted bakery in the Churchtown district of Southport. The building was described by Eagle artist Greta Tomlinson as \"very basic, a flagstone floor and a tin roof; there was cold running water in the corner. It was freezing cold in the winter and boiling hot in the summer\".  Working to a tight schedule, Hampson created each Dan Dare episode first in pencil, and then in ink and colour. He and his team of artists posed for photographs, in the positions drawn in his pencil sketches (Hampson usually posed for Dan Dare). These photographs were combined with the rough sketches, and his colleagues then worked on the strip while he tackled the opening frame of each week's story. His drawings of the technology Dan Dare employed were meticulous, and were based on a large body of research and reference material, as well as space ship models, plaster heads, mocked-up space suits, and a complete model of a space station. He also wrote the dialogue for several of the comic's pages. Hampson was assisted in his work by expert consultants, among them Arthur C. Clarke (then an aspiring young science fiction writer). Scriptwriters included Anglican priest Chad Varah (founder of Samaritans). Varah also accompanied Morris on tours of Cathedrals often filled with Eagle readers keen to meet the comic's creators. Peter Ling and Macdonald Hastings were contributors, as was Harris Tweed's creator John Ryan, who was also responsible for Captain Pugwash, printed in the first 19 issues."]}, {"page": "Crisis hotline", "response": ["Such services began in 1953, when Chad Varah, an English vicar, founded The Samaritans service, which soon established branches throughout the United Kingdom. The first Samaritans branch in the United States was established in Boston in 1974.Samaritanshope.org  In addition to Boston, there are currently Samaritan branches in Falmouth, Massachusetts (serving the Cape Cod and Islands area), the Merrimack Valley,Familyserviceinc.com  and the Fall River/New Bedford area. Outside of Massachusetts, there are branches in New York City, Providence, Hartford,Suicidology.org  Albany,Orgsites.com  and Keene, New Hampshire."]}, {"page": "British Rail Class 390", "response": ["| Chad Varah"]}, {"page": "Peter Palumbo, Baron Palumbo", "response": ["Palumbo led the fundraising effort to resurrect and refurbish the Church of St Stephen Walbrook in London, a building by Sir Christopher Wren which had been badly damaged during The Blitz (in World War II) – the sculptor Henry Moore was commissioned by Palumbo to build a stone altar for the church. The former rector of St Stephen Walbrook and founder of The Samaritans, Dr Chad Varah, was also the family chaplain."]}, {"page": "St Stephen Walbrook", "response": ["In 1953 the Samaritans charity was founded  by the rector of St Stephen's, Dr Chad Varah. The first Samaritans branch (known as Central London Branch) operated from a crypt beneath the church before moving to Marshall Street in Soho. In tribute to this, a telephone is preserved in a glass box in the church. The Samaritans began with this telephone, and today the voluntary organisation staffs a 24-hour telephone hot-line for people in emotional need.", "At the time of his retirement in 2003, at the age of 92, Dr Chad Varah was the oldest serving incumbent in the Church of England.", "*Chad Varah 1953–2003"]}, {"page": "British Rail Class 350", "response": ["*350232 - Chad VarahRail industry and Samaritans launch partnership  rail.co.uk 10 October 2012"]}, {"page": "Penthouse Forum", "response": ["Alastair Campbell, a journalist and Tony Blair's former Director of Communications, was a contributor to the magazine, as was Chad Varah, the founder of The Samaritans charity and an Anglican priest, who was a consultant on sex education for the magazine."]}, {"page": "Edward Chad Varah", "response": ["#redirect Chad Varah"]}, {"page": "Raine's Foundation School", "response": ["* Michael Varah (1944–2007), 800m runner, son of Chad Varah, who competed in the 1966 British Empire and Commonwealth Games"]}, {"page": "1953 in the United Kingdom", "response": ["* 2 November – The Samaritans telephone counselling service for the suicidal is started by Rev. Chad Varah in London."]}, {"page": "2007 in the United Kingdom", "response": ["* 8 November – Chad Varah, Anglican priest, founder of the Samaritans (born 1911)"]}, {"page": "List of members of the Order of the Companions of Honour", "response": ["|31 December 1999||75px||Chad Varah||1911–2007||Founder of The Samaritans"]}, {"page": "1911 in the United Kingdom", "response": ["* 12 November – Chad Varah, priest and humanitarian (died 2007)"]}, {"page": "List of University of Oxford people in religion", "response": ["*Chad Varah (Keble) Rector of St Stephen Walbrook 1953-2003, founder of The Samaritans 1953"]}, {"page": "Pride of Britain Awards", "response": ["| Chad Varah"]}, {"page": "Deaths in November 2007", "response": ["* Chad Varah, 95, British Anglican priest, founder of the Samaritans."]}, {"page": "Michael Varah", "response": ["Varah was eldest of triplet boys born in the vicarage of Holy Trinity, Blackburn to Dr Chad Varah and his wife Susan.  His father was the local Anglican vicar, who founded the Samaritans charity in 1953.  His mother later became world president of the Mothers' Union in the 1970s."]}, {"page": "Marcus Morris (publisher)", "response": ["After a chaplaincy in the RAF and postings in Great Yarmouth, Norfolk and Weeley, Essex, he became vicar of St James' Church, Birkdale, in 1945, where he published a magazine, The Anvil, which contained illustrations and design by Frank Hampson, articles by C. S. Lewis, Harold Macmillan, Dorothy L. Sayers and Chad Varah, and short stories for children by Geoffrey Trease, and circulated far beyond his parish, although it did not sell well and put Morris in considerable debt.Marcus Morris, Foreword, The Best of Eagle, Michael Joseph Ltd., 1977", "In 1948 Morris and Chad Varah were part of a group of diocesan editors who formed the Society of Christian Publicity, which took over publishing The Anvil. At its inaugural meeting Morris spoke about the kinds of periodical the Church should be publishing, including a \"strip-cartoon magazine for children\".  In February 1949 he wrote an article for the Sunday Dispatch entitled \"Comics that bring Horror into the Nursery\", in which he decried the violence and sensationalism of American crime and horror comics and their effects on British children, after which he and Hampson set out to produce a more wholesome, uplifting alternative. They devised a proposed strip for the Sunday Empire News called Lex Christian, about the adventures of a brave inner-city parson, but it fell through after the paper's editor died. They turned their attention to creating a new weekly comic, entitled the Eagle. Hampson and fellow artist Harold Johns put together a series of dummies, and Morris presented them to various publishers, of whom Hulton Press agreed to publish it. The first issue proper went on sale on 14 April 1950."]}, {"page": "Kenneth Woollcombe", "response": ["He declined the positions of Provost of Coventry Cathedral and Bishop of Worcester, deciding to serve as canon precentor at St Paul's Cathedral instead, an office that he was installed into on 1 November 1981 and held until he retired in 1989. He was committed to ecumenism, serving as a member of the Churches Council for Covenanting for Unity, and as chairman of the English Anglican-Roman Catholic Conversations.  He sat as one of the five judges of the Court of Ecclesiastical Causes Reserved which granted a retrospective faculty for Henry Moore's controversial new altar commissioned by Chad Varah and Peter Palumbo, Baron Palumbo for St Stephen Walbrook.[[legal citation|[1987] Fam 146, [1987] 2 All ER 578]]"]}, {"page": "Eric Winter (illustrator)", "response": ["Over his working life he was commissioned to illustrate various magazines – Woman's Own, Woman, The Girl. He was commissioned by Reverend Chad Varah to draw religious illustrations for his children's Bible stories in Swift and by Reverend Marcus Morris to do religious illustrations for the Eagle comic."]}, {"page": "Sexual Freedom Awards", "response": ["*Campaigner of the Year - Chad Varah CBE", "*Special Awards - Chad Varah & David Webb"]}]}}