{"wiki_id": "http://www.wikidata.org/entity/Q725390", "itemLabel": "Oscar Gustave Rejlander", "itemDescription": "British photographer (1813-1875)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oscar_Gustave_Rejlander", "wikipedia_page": {"main": "Oscar Gustave Rejlander (Stockholm, 19 October 1813 – Clapham, London, 18 January 1875) was a pioneering Victorian art photographer and an expert in photomontage. His collaboration with Charles Darwin on The Expression of the Emotions in Man and Animals has assured him a position in the history of behavioural science and psychiatry.", "link_mentions": [{"page": "List of photographers", "response": ["* Oscar Gustave Rejlander (1813–1875)"]}, {"page": "Pictorialism", "response": ["Some painters soon adopted photography as a tool to help them record a model's pose, a landscape scene or other elements to include in their art. It is known that many of the great 19th-century painters, including Delacroix, Courbet, Manet, Degas, Cézanne, and Gauguin, took photographs themselves, used photographs by others and incorporated images from photographs into their work.Scharf, pp. 10–12 While heated debates about the relationship between photography and art continued in print and in lecture halls, the distinction between a photographic image and a painting became more and more difficult to discern. As photography continued to develop, the interactions between painting and photography became increasingly reciprocal.Harker, p. 19 More than a few pictorial photographers, including Alvin Langdon Coburn, Edward Steichen, Gertrude Käsebier, Oscar Gustave Rejlander, and Sarah Choate Sears, were originally trained as painters or took up painting in addition to their photographic skills."]}, {"page": "List of Swedish artists", "response": ["*Oscar Gustave Rejlander (1813–1875), photographer"]}, {"page": "Oscar Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Henry Peach Robinson", "response": ["Henry Peach Robinson (9 July 1830, Ludlow, Shropshire – 21 February 1901, Royal Tunbridge Wells, Kent) was an English pictorialist photographer best known for his pioneering combination printingRobinson, H. P. (1860). On Printing Photographic Pictures from Several Negatives. British Journal of Photography, 7(115), 94. - joining multiple negatives or prints to form a single image;Vertrees, A. (1982). The picture making of Henry Peach Robinson'. Perspectives on Photography, Austin, Texas, Humanities Research Center, University of Texas, 79, 101. an early example of photomontage.Oscar Gustave Rejlander preceded Robinson in developing combination printing techniques in the mid-1850s, exhibiting his The Two Ways of Life by 1857, while in the 1855 Journal of Photography Scottish colleagues Berwick and Annan proposed such a technique. Earlier again, in 1852 De Montfort published Procede de grouper plusiers portraits obtenue isolement afin d'en former un seul tableau heliographique (Procedure for grouping several separately obtained portraits in order to make a single heliographic plate). See . Gustave Le Gray, also in 1957, achieved simultaneous detail in both sky and sea through combination printing in his 'The Great Wave', 1857, Albumen print from collodion-on-glass negative. Museum no. 68:004,  Victoria and Albert Museum, London. French architectural photographer Edouard Baldus, commissioned in 1851 to document the state of French architectural heritage, employed combination printing techniques from paper negatives to produce not only panoramas, but also to deal with technical limitations of exposure range and depth of focus, particularly for his Cloister of St.. Trephine, Arles, 1851 He joined vigorously in contemporary debatesRobinson, H. P. (1860). Composition NOT Patchwork. British Journal of Photography, 7(121), 190. in the photographic press and associations about the legitimacy of 'art photography' and in particular the combining of separate images into one.Harker, M. (1989). Henry Peach Robinson:“The Grammar of Art.”. British Photography in the Nineteenth Century."]}, {"page": "Culture of Birmingham", "response": ["Victorian photographer Sir Benjamin Stone (1838–1914) lived and worked in Erdington, Birmingham.  The Birmingham Central Library now holds the Benjamin Stone Collection. The Victorian \"father of art photography\", Oscar Gustave Rejlander lived and worked at nearby Wolverhampton, and was a founder member of the Birmingham Photographic Society.  The BPS later elected Henry Peach Robinson as a member."]}, {"page": "Fine-art photography", "response": ["One photography historian claimed that \"the earliest exponent of 'Fine Art' or composition photography was John Edwin Mayall\", who exhibited daguerreotypes illustrating the Lord's Prayer in 1851.Gernsheim, Helmut. Creative photography: aesthetic trends 1839-1960. New York: Dover, 1991, p. 73.   Successful attempts to make fine art photography can be traced to Victorian era practitioners such as Julia Margaret Cameron, Charles Lutwidge Dodgson, and Oscar Gustave Rejlander and others.  In the U.S. F. Holland Day, Alfred Stieglitz and Edward Steichen were instrumental in making photography a fine art, and Stieglitz was especially notable in introducing it into museum collections."]}, {"page": "O.G. Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Rejlander, O.G.", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Oscar Reilander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "O. G. Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "List of people from Wolverhampton", "response": ["* Oscar Gustave Rejlander (1813–1875) – set up as a portraitist in Wolverhampton, around 1846; \"father of art photography\""]}, {"page": "Oscar G. Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Oscar G Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Rejlander", "response": ["#REDIRECT Oscar Gustave Rejlander"]}, {"page": "Portraits of Charles Darwin", "response": ["| Oscar Gustave Rejlander"]}, {"page": "Art Treasures Exhibition, Manchester 1857", "response": ["The exhibition comprised over 16,000 works split into 10 categories – Pictures by Ancient Masters, Pictures by Modern Masters, British Portraits and Miniatures, Water Colour Drawings, Sketches and Original Drawings (Ancient), Engravings, Illustrations of Photography, Works of Oriental Art, Varied Objects of Oriental Art, and Sculpture. The collection included 5,000 paintings and drawings by \"Modern Masters\" such as Hogarth, Gainsborough, Turner, Constable, and the Pre-Raphaelites, and 1,000 works by European Old Masters, including Rubens, Raphael, Titian and Rembrandt; several hundred sculptures; photographs, including Crimean War images by James Robertson and the photographic tableau Two Ways of Life by Oscar Gustave Rejlander; and other works of decorative arts, such as Wedgwood china, Sèvres and Meissen porcelain, Venetian glass, Limoges enamels, ivories, tapestries, furniture, tableware and armour. The Committee bought the collection of Jules Soulages of Toulouse, founder of the Société Archéologique du Midi de la France for £13,500 to form the core of the collection of medieval and Renaissance decorative arts. The collection had previously been exhibited at Marlborough House in London with a view to being acquired for the South Kensington Museum (now the V&A), but HM Treasury refused to fund the purchase. They were later acquired by the V&A."]}, {"page": "Lewis Carroll", "response": ["Several other writers and scholars have challenged the evidential basis for Cohen's and others' views about Dodgson's sexual interests. Hugues Lebailly has endeavoured to set Dodgson's child photography within the \"Victorian Child Cult\", which perceived child nudity as essentially an expression of innocence. Lebailly claims that studies of child nudes were mainstream and fashionable in Dodgson's time and that most photographers made them as a matter of course, including Oscar Gustave Rejlander and Julia Margaret Cameron. Lebailly continues that child nudes even appeared on Victorian Christmas cards, implying a very different social and aesthetic assessment of such material. Lebailly concludes that it has been an error of Dodgson's biographers to view his child-photography with 20th- or 21st-century eyes, and to have presented it as some form of personal idiosyncrasy, when it was a response to a prevalent aesthetic and philosophical movement of the time."]}, {"page": "Art of Birmingham", "response": ["Victorian photographer Sir Benjamin Stone (1838–1914) lived and worked in Erdington, Birmingham.  The Birmingham Central Library now holds the Benjamin Stone Collection. The Victorian \"father of art photography\", Oscar Gustave Rejlander lived and worked at nearby Wolverhampton, and was a founder member of the Birmingham Photographic Society.  The BPS later elected Henry Peach Robinson as a member."]}, {"page": "A Mysterious Portrait", "response": ["Effects in the film were created using the substitution splice, two multiple exposures, dissolves, and defocusing the lens to create a soft focus effect. The portrait effect is an early example of a matte effect in filmmaking, in which a mask over the lens ensured that only a specific section of the image in view would be filmed and exposed. Matting had been used in still photography since the 1850s, when photographers such as Henry Peach Robinson and Oscar Gustave Rejlander used them to compose painting-like scenes. The first filmmaker to take advantage of it was likely the British cinematic pioneer George Albert Smith (who knew of Méliès through their mutual colleague Charles Urban). Méliès continued to experiment with matting techniques in later films, such as The One Man Band and A Spiritualist Photographer."]}, {"page": "List of photographs considered the most important", "response": ["* Oscar Gustave Rejlander, Two Ways of Life, 1857.none|thumb"]}]}}