{"wiki_id": "http://www.wikidata.org/entity/Q725880", "itemLabel": "Philip Gidley King", "itemDescription": "British Colonial governor (1758-1808)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Gidley_King", "wikipedia_page": {"main": "Captain Philip Gidley King (23 April 1758 – 3 September 1808) was the third Governor of New South Wales.\nWhen the First Fleet arrived in January 1788, King was detailed to colonise Norfolk Island for defence and foraging purposes. As Governor of New South Wales, he helped develop livestock farming, whaling and mining, built many schools and launched the colony's first newspaper. But conflicts with the military wore down his spirit, and they were able to force his resignation.\n\n", "link_mentions": [{"page": "Arthur Phillip", "response": ["In July 1782, in a change of government, Thomas Townshend became Secretary of State for Home and American Affairs, and assumed responsibility for organising an expedition against Spanish America. Like his predecessor, Lord Germain, he turned for advice to Phillip. The plan was for a squadron of three ships of the line and a frigate to mount a raid on Buenos Aires and Monte Video, then to proceed to the coasts of Chile, Peru and Mexico to maraud, and ultimately to cross the Pacific to join the British Navy's East India squadron for an attack on Manila. On 27 December 1782 Phillip, with Lieutenant Philip Gidley King, took charge of the 64-gun , taking. The expedition, consisting of the 70 gun , 74 gun , Europa, and the 32 gun frigate , sailed on 16 January 1783, under the command of Commodore Robert Kingsmill. Shortly after sailing, an armistice was concluded between Great Britain and Spain. Phillip learnt of this in April when he put in for storm repairs at Rio de Janeiro. Phillip wrote to Townshend from Rio de Janeiro on 25 April 1783, expressing his disappointment that the ending of the American War had robbed him of the opportunity for naval glory in South America.", "On 15 February 1788, Phillip sent Lieutenant Philip Gidley King with a party of twenty-three, including fifteen convicts to establish the colony at Norfolk Island. This was partly in response to a perceived threat of losing Norfolk Island to the French and partly to establish an alternative food source for the mainland colony."]}, {"page": "Governor of New South Wales", "response": ["|3|| 80px||  Captain Philip Gidley King || 28 September 1800|| 12 August 1806 || "]}, {"page": "Koala", "response": ["The first written reference of the koala was recorded by John Price, servant of John Hunter, the Governor of New South Wales. Price encountered the \"cullawine\" on 26 January 1798, during an expedition to the Blue Mountains, although his account was not published until nearly a century later in Historical Records of Australia.Moyal, p. 8 . In 1802, French-born explorer Francis Louis Barrallier encountered the animal when his two Aboriginal guides, returning from a hunt, brought back two koala feet they were intending to eat. Barrallier preserved the appendages and sent them and his notes to Hunter's successor, Philip Gidley King, who forwarded them to Joseph Banks. Similar to Price, Barrallier's notes were not published until 1897.Moyal, pp. 9–10 . Reports of the first capture of a live \"koolah\" appeared in The Sydney Gazette in August 1803.The Sydney Gazette, 21 August 1803, p.3 Within a few weeks Flinders' astronomer, James Inman, purchased a specimen pair for live shipment to Joseph Banks in England. They were described as 'somewhat larger than the Waumbut (Wombat)'. These encounters helped provide the impetus for King to commission the artist John Lewin to paint watercolours of the animal. Lewin painted three pictures, one of which was subsequently made into a print that was reproduced in Georges Cuvier's Le Règne Animal (The Animal Kingdom) (first published in 1817) and several European works on natural history.Moyal, pp. 12–13, 45 ."]}, {"page": "Norfolk Island", "response": ["When the First Fleet arrived at Port Jackson in January 1788, Governor Arthur Phillip ordered Lieutenant Philip Gidley King to lead a party of 15 convicts and seven free men to take control of Norfolk Island, and prepare for its commercial development. They arrived on 6 March. During the first year of the settlement, which was also called \"Sydney\" like its parent, more convicts and soldiers were sent to the island from New South Wales. Robert Watson, harbourmaster, arrived with the First Fleet as quartermaster of , and was still serving in that capacity when the ship was wrecked at Norfolk Island in 1790. Next year, he obtained and cultivated a grant of  on the island."]}, {"page": "History of Norfolk Island", "response": ["When the First Fleet arrived at Port Jackson in January 1788, Phillip ordered Lieutenant Philip Gidley King to lead a party of 15 convicts and seven free men, including surgeon Thomas Jamison (the future Principal Surgeon of New South Wales), to take control of the island and prepare for its commercial development. They arrived on 6 March 1788.", "During the first year of the settlement, which was also called \"Sydney\" like its parent, more convicts and soldiers were sent to the island from New South Wales. A second village was started at Ball Bay, named after the captain of HMS Supply, Lieutenant Henry Lidgbird Ball. On 8 January 1789, the first child was born, Norfolk King, the son of Philip Gidley King and a convict, Ann Inett. (Norfolk King went on to become the first British Naval officer born in Australia, and was a Lieutenant, commanding the schooner Ballahoo when an American privateer captured her.)", "A \"Letter from an Officer of Marines at New South Wales, 16 November 1788\", published in the London newspaper, The World, 15 May 1789, reported the glowing description of the island and its prospects by Philip Gidley King, but also drew attention to the fatal defect of the lack of a safe port: “The said Island lies near Port Jackson, and is nearly as large as the Isle of Wight. Lieutenant King, who was sent with a detachment of marines and some convicts, to settle there, gives the most flattering portrayal of it. The island is fully wooded. Its timber is in the opinion of everyone the most beautiful and finest in the world...they are most suitable for masts, yards, spars and such. The New Zealand flax-plant grows there in abundance. European grains and seeds also thrive wonderfully well on Norfolk Island. It only lacks a good port and suitable landing places, without which the island is of no use, but with them it would be of the greatest importance for Great Britain. How far these deficiencies can be improved by art and the hand of man, time must decide.”", "* 6 March 1788 – 24 March 1790: Lieutenant Philip Gidley King (1758–1808)", "* 4 November 1791 – Oct 1796: Lieutenant Philip Gidley King"]}, {"page": "Van Diemen's Land", "response": ["* Julian Stockwin's nautical fiction series, The Kydd Series, includes the book Command (2006) in which Thomas Kydd takes a ship to Van Diemen's Land, at the behest of then governor of New South Wales, Philip Gidley King, for the purpose of preventing French explorers from establishing a French settlement on the island."]}, {"page": "William Bligh", "response": ["Bligh had gained a reputation as a firm disciplinarian. Accordingly, he was offered the position of Governor of New South Wales on the recommendation of Sir Joseph Banks (President of the Royal Society and a main sponsor of the breadfruit expeditions) and appointed in March 1805, at £2,000 per annum, twice the pay of the retiring governor, Philip Gidley King. He arrived in Sydney on 6 August 1806, to become the fourth governor. As his wife Elizabeth had been unwilling to undertake a long sea voyage, Bligh was accompanied by his daughter, Mary Putland, who would be the Lady of Government House; Mary's husband John Putland was appointed as William Bligh's aide-de-camp.Whitaker, Anne-Maree, 'William Bligh', in David Clune and Ken Turner (eds), The Governors Of New South Wales 1788–2010, Federation Press, Sydney, 2009, pp. 87–105, . During his time in Sydney, his confrontational administrative style provoked the wrath of a number of influential settlers and officials. They included the wealthy landowner and businessman John Macarthur, and prominent Crown representatives such as the colony's principal surgeon, Thomas Jamison, as well as senior officers of the New South Wales Corps. Jamison and his military associates were defying government regulations by engaging in private trading ventures for profit, a practice which Bligh was determined to put a stop to."]}, {"page": "1758", "response": ["** Philip Gidley King, British Royal Navy officer, colonial administrator (d. 1808)"]}, {"page": "Joseph Banks", "response": ["Although Banks remained uninvolved in these colonies in a hands on manner, he was, nonetheless, the general adviser to the government on all Australian matters for twenty years. He arranged that a large number of useful trees and plants should be sent out in the supply ship , which was unfortunately wrecked, as well as other ships; many of these were supplied by Hugh Ronalds from his nursery in Brentford. Every vessel that came from New South Wales brought plants or animals or geological and other specimens to Banks. He was continually called on for help in developing the agriculture and trade of the colony, and his influence was used in connection with the sending out of early free settlers, one of whom, a young gardener George Suttor, later wrote a memoir of Banks. The three earliest governors of the colony, Arthur Phillip, John Hunter, and Philip Gidley King, were in continual correspondence with him. Banks produced a significant body of papers, including one of the earliest Aboriginal Australian words lists compiled by a European. Bligh was also appointed governor of New South Wales on Banks's recommendation. Banks followed the explorations of Matthew Flinders, George Bass, and Lieutenant James Grant, and among his paid helpers were George Caley, Robert Brown, and Allan Cunningham."]}, {"page": "Newcastle, New South Wales", "response": ["Newcastle gained a reputation as a \"hellhole\" as it was a place where the most dangerous convicts were sent to dig in the coal mines as harsh punishment for their crimes. By the start of the 19th century the mouth of the Hunter River was being visited by diverse groups of men, including coal diggers, timber-cutters, and more escaped convicts. Philip Gidley King, the Governor of New South Wales from 1800, decided on a more positive approach to exploit the now obvious natural resources of the Hunter Valley. In 1801, a convict camp called King's Town (named after Governor King) was established to mine coal and cut timber. In the same year, the first shipment of coal was dispatched to Sydney. This settlement closed less than a year later."]}, {"page": "Rum Rebellion", "response": ["William Bligh succeeded Philip Gidley King as the fourth Governor of New South Wales in 1805, having been offered the position by Sir Joseph Banks. A naval officer, he was well known for his overthrow in the mutiny on the Bounty. It is likely that he was deliberately selected by the British Government as governor because of his reputation as a \"hard man\", and was expected to have a good chance of reining in the maverick New South Wales Corps; something that his predecessors had not been able to do.Duffy, pp. 248–9 Bligh left for Sydney with his daughter, Mary Putland, and her husband while Bligh's wife remained in England.Ritchie, p. 102"]}, {"page": "Geelong", "response": ["The area of Geelong and the Bellarine Peninsula are the traditional lands of the Wadawurrung (Wathaurong) Indigenous Australian tribe. The first non-Indigenous person recorded as visiting the region was Lieutenant John Murray, who commanded the brig . After anchoring outside Port Phillip Heads (the narrow entrance to Port Phillip, onto which both Geelong and Melbourne now front), on 1 February 1802, he sent a small boat with six men to explore. Led by John Bowen, they explored the immediate area, returning to Lady Nelson on 4 February. On reporting favourable findings, Lady Nelson entered Port Phillip on 14 February, and did not leave until 12 March. During this time, Murray explored the Geelong area and, whilst on the far side of the bay, claimed the entire area for Britain. He named the bay Port King, after Philip Gidley King, then Governor of New South Wales. Governor King later renamed the bay Port Phillip after the first governor of New South Wales, Arthur Phillip. Arriving not long after Murray was Matthew Flinders, who entered Port Phillip on 27 April 1802. He charted the entire bay, including the Geelong area, believing he was the first to sight the huge expanse of water, but in a rush to reach Sydney before winter set in, he left Port Phillip on 3 May."]}, {"page": "European maritime exploration of Australia", "response": ["Just as he was attempting to move the colony, on 24 January 1788 Jean-François de Galaup, comte de Lapérouse arrived off Botany Bay.See extract from La Perouse's journal published in 1799 as; \"A Voyage Around the world\", pp. 179–180 in Frank Crowley (1980), Colonial Australia. A Documentary History of Australia 1, 1788–1840. 3–4, Thomas Nelson, Melbourne. David Hill, 1788: The Brutal Truth of the First Fleet The French expedition consisted of two ships led by La Pérouse, the Astrolabe and the Boussole, which were on the latest leg of a three-year voyage that had taken them from Brest, around Cape Horn, up the coast from Chile to California, north-west to Kamchatka, south-east to Easter Island, north-west to Macao, and on to the Philippines, the Friendly Isles, Hawaii and Norfolk Island.Robert J. King, \"What brought Lapérouse to Botany Bay?\", Journal of the Royal Australian Historical Society, vol.85, pt.2, December 1999, pp.140–147. At: www.articlearchives.com/asia/northern-asia-russia/1659966-1.html ;name=hill The gale also prevented La Pérouse's ships from entering Botany Bay. Though amicably received, the French expedition was a troublesome matter for the British, as it showed the interest of France in the new land. To preempt a French claim to Norfolk Island, Phillip ordered Lieutenant Philip Gidley King to lead a party of 15 convicts and seven free men to take control of Norfolk Island. They arrived on 6 March 1788, while La Pérouse was still in Sydney."]}, {"page": "History of Victoria", "response": ["In 1801 Harbinger, under John Black, was the second vessel to sail through Bass Strait en route to Port Jackson.  She reached the coast near Cape Otway on 1 January 1801, then veered sharply south-west to the north-western tip of Governor King's Island (now King Island), which Black named after the Governor of New South Wales, Philip Gidley King. She then sailed easterly towards Wilsons Promontory.  Proceeding around the tip of the promontory, Black discovered the Hogan Group, which he named after the ship's owner Michael Hogan. Harbinger arrived in Port Jackson on 12 January 1801."]}, {"page": "First Fleet", "response": ["* Lieutenant Philip Gidley King, commandant of Norfolk Island"]}, {"page": "Parramatta", "response": ["In an attempt to deal with the food crisis, Phillip in 1789 granted a convict named James Ruse the land of Experiment Farm at Parramatta on the condition that he develop a viable agriculture. There, Ruse became the first European to successfully grow grain in Australia. The Parramatta area was also the site of the pioneering of the Australian wool industry by John Macarthur's Elizabeth Farm in the 1790s. Philip Gidley King's account of his visit to Parramatta on 9 April 1790 is one of the earliest descriptions of the area. Walking four miles with Governor Phillip to Prospect, he saw undulating grassland interspersed with magnificent trees and a great number of kangaroos and emus.Flynn 1997, p 28"]}, {"page": "Mersey (1801 ship)", "response": ["Philip Gidley King, governor of New South Wales, on 15 May 1804 announced that Mersey would return to India via an \"hithertoo unfrequented passage to Torres Strait in the track of Captain Flinders.\" King had chartered Mersey to purchase 250 cows from Bengal and deliver them to Hobart, Tasmania."]}, {"page": "Philip King", "response": ["* Philip Gidley King (1758–1808), British colonial administrator", ":*Philip King (Australian politician) (1817–1904), named Philip Gidley King after his grandfather above, Australian politician"]}, {"page": "Launceston, Tasmania", "response": ["Initially, the settlement was called Patersonia; however, Paterson later changed the name to Launceston in honour of the New South Wales Governor Captain Philip Gidley King, who was born in Launceston, Cornwall. The name still survives in the tiny hamlet of Patersonia  north-west of Launceston. Paterson himself also served as Lieutenant-Governor of northern Van Diemen's Land from 1804 to 1808."]}, {"page": "Port Phillip", "response": ["The first Europeans to find and enter Port Phillip, were the crew of the Lady Nelson, commanded by John Murray, which entered the bay on 15 February 1802.Norman Houghton – 'The Story of Geelong'  Murray called the bay Port King after the Governor of New South Wales, Philip Gidley King. On 4 September 1805, King formally renamed it Port Phillip, in honour of his predecessor Arthur Phillip.Port Phillip Conservation Council: Excerpts from the 'Port Phillip Survey 1957-1963'  Murray chose to base the Lady Nelson off what is now known as Sorrento Beach. Within days, his contingent was ambushed in an unprovoked attack by the local resident clan of the Boon wurrung. Several Aboriginal Australians were shot at by musket fire and Murray ordered grapeshot and round shot to be fired from the carronades aboard the ship at the fleeing attackers. Murray said  After exploring the southern part of the bay, Murray formally took possession of the area on 8 March 1802 for King George III of Great Britain in a small ceremony at a place now known as the Point King Foreshore Reserve in Sorrento. A few days later Murray sailed out of the heads and returned to Sydney."]}, {"page": "HMS Sirius (1786)", "response": ["Sirius had been converted from the merchantman Berwick. There has been confusion over the early history of Berwick. A note about her by future New South Wales governor Philip Gidley King, describing her as a former 'East country man', was interpreted for many years as relating to the East Indies trade; however, analysis of the maritime nomenclature of the time suggests that this description referred instead to ships participating in the Baltic trade."]}, {"page": "John Hunter (Royal Navy officer)", "response": ["Hunter's difficulties began before he arrived back in Sydney. Phillip left the colony in 1793, at the end of his term as governor, and for the following two years the military were in complete control. During the lieutenant-governorship of Francis Grose, who unmercifully exploited the convicts, a great traffic in alcoholic spirits sprang up, on which there was an enormous profit for the officers concerned. They had obtained the control of the courts and the management of the lands, public stores, and convict labour. Hunter realised that these powers had to be restored to the civil administration, a difficult task. And in John Macarthur he had an opponent who would ruthlessly defend his commercial interests. Hunter found himself practically helpless. A stronger man might have sent the officers home under arrest, but had Hunter attempted to do so he likely would have precipitated the rebellion which took place in William Bligh's time. Anonymous letters were even sent to the home authorities charging Hunter with participation in the very abuses he was striving to prevent. In spite of Hunter's vehement defence of the charges made against him, he was recalled in a dispatch dated 5 November 1799 from the Duke of Portland, one of the three secretaries of state. Hunter acknowledged this dispatch on 20 April 1800, and left for England on 28 September 1800, handing over the government to Lieutenant-Governor Philip Gidley King. When Hunter arrived he endeavoured to vindicate his character with the authorities but was given no opportunity. Hunter was obliged to state his case in a long pamphlet printed in 1802, Governor Hunter's Remarks on the Causes of the Colonial Expense of the Establishment of New South Wales. Hints for the Reduction of Such Expense and for Reforming the Prevailing Abuses, which has become a valuable document in early Australian history.", "Hunter explored and opened up the country near Sydney, and also encouraged the explorations of Matthew Flinders and George Bass. A contemporary, midshipman Daniel Southwell described Hunter as \"devoid of stiff pride, most accomplished in his profession, and, to sum up all, a worthy man.\"Correspondence, Daniel Southwell, Midshipman HMS Sirius, 5 May 1788. Cited in Bladen (ed.) 1978, p. 684 But the circumstances in which he was placed made it very difficult for him to be completely successful as a governor. As his successor Philip Gidley King said, his conduct was \"guided by the most upright intentions\", and he was \"most shamefully deceived by those on whom he had every reason to depend for assistance, information, and advice.\" Of his sojourn in the colony Hunter said that he \"could not have had less comfort, although he would certainly have had greater peace of mind, had he spent the time in a penitentiary\". His service as Governor was ultimately recognised through the grant of an annual pension of £300, approved by then-Prime Minister Henry Addington in October 1802.Bladen 1979, p. 854"]}, {"page": "Swan River Colony", "response": ["The next visit to the area was the first Australian-born maritime explorer, Phillip Parker King in 1822 on Bathurst. King was also the son of former Governor Philip Gidley King of New South Wales. However, King also was not impressed with the area."]}]}}