{"wiki_id": "http://www.wikidata.org/entity/Q725836", "itemLabel": "M. J. Seaton", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/M._J._Seaton", "wikipedia_page": {"main": "Michael John Seaton  (16 January 1923 – 29 May 2007) was an influential British mathematician, atomic physicist, and astronomer.\nHe was born in Bristol, and educated at Wallington County Grammar School (WCGS), a grammar school in Surrey, where he won prizes for his achievements in chemistry.\nFrom 1941 to 1946 he served in the wartime Royal Air Force as a Flight Lieutenant. In this capacity he served first in RAF Bomber Command, navigating Avro Lancasters, and later in one of the elite Pathfinder squadrons, such was his capacity to apply his understanding of mathematics to the task before him.\nAfter demobilisation, he returned to his studies, and the start of a long career at University College London. Gaining a First Class BSc in physics just two years later, he continued, obtaining his PhD on Quantal Calculations of certain reaction rates with applications to Astrophysical and Geophysical problems in 1951. He later did important work on the Quantum Defect Theory.\nWith a break as Chargé de Recherché at the Institut d'astrophysique de Paris from 1954 to 1955, he rose through the ranks at the Department of Physics at UCL, becoming a Reader in 1959, and Professor of Physics in 1963. He was made a Fellow of the College in 1972, the year in which the Departments of Physics and Astronomy merged. He held the status of Professor Emeritus and Honorary Research Fellow from 1988 until his death.\nIn 1964 he became Fellow-Adjoint at the Joint Institute for Laboratory Astrophysics (JILA) in Boulder, Colorado, a combined venture between the American National Institute of Standards and Technology and the University of Colorado.\nIn 1967 he was elected Fellow of the Royal Society. He held Honorary Membership of the American Astronomical Society, awarded in 1983, and was made Foreign Associate of the United States National Academy of Sciences in 1986.\nSeaton held the Presidency of the Royal Astronomical Society [RAS] between 1979 and 1981, and was awarded its Gold Medal in 1983. This was followed by the Guthrie Medal and Prize, from the Institute of Physics in 1984, and the Hughes Medal of the Royal Society in 1992.\nSeaton served as Senior Fellow to the Science and Engineering Research Council EPSRC, 1984–88.\nOther honours include: Honorary Doctorate, Observatoire de Paris, 1976; Honorary DSc QUB, 1982.\n\n", "link_mentions": [{"page": "Gold Medal of the Royal Astronomical Society", "response": ["| 1983 || M. J. Seaton || Fred Whipple || || "]}, {"page": "Seaton", "response": ["* M. J. Seaton (1923–2007), British physicist"]}, {"page": "List of people associated with University College London", "response": ["* M. J. Seaton, British mathematician, atomic physicist and astronomer"]}, {"page": "Michael Seaton", "response": ["#REDIRECT M. J. Seaton"]}, {"page": "Wallington County Grammar School", "response": ["*M. J. Seaton FRS, Professor of Physics at University College London, President of the Royal Astronomical Society"]}, {"page": "1923 in the United Kingdom", "response": ["** M. J. Seaton, astronomer (died 2007)"]}, {"page": "Michael John Seaton", "response": ["#redirect M. J. Seaton"]}, {"page": "M J Seaton", "response": ["#REDIRECT M. J. Seaton "]}, {"page": "M.J. Seaton", "response": ["#REDIRECT M. J. Seaton "]}, {"page": "MJ Seaton", "response": ["#REDIRECT M. J. Seaton "]}, {"page": "UCL Faculty of Mathematical and Physical Sciences", "response": ["* M. J. Seaton"]}, {"page": "Index of physics articles (M)", "response": ["*M. J. Seaton"]}]}}