{"wiki_id": "http://www.wikidata.org/entity/Q7257103", "itemLabel": "Ptolemy Dean", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Ptolemy_Dean", "wikipedia_page": {"main": "Ptolemy Hugo Dean  (born 1968) is a British architect, television presenter and the 19th Surveyor of the Fabric of Westminster Abbey. He specialises in historic preservation, as well as designing new buildings that are in keeping with their historic or natural settings. He is best known for his appearances on two BBC television series, Restoration and The Perfect Village.", "link_mentions": [{"page": "Westminster Abbey", "response": ["The Queen's Diamond Jubilee Galleries have been created in the medieval triforium of the abbey. This is a display area for the abbey's treasures in the galleries high up around the abbey's nave. A new Gothic access tower with lift was designed by the abbey architect and Surveyor of the Fabric, Ptolemy Dean. The new galleries opened in June 2018."]}, {"page": "Capability Brown", "response": ["A commemorative fountain in Westminster Abbey’s cloister garth was dedicated for Lancelot ‘Capability’ Brown after Evensong on Tuesday 29 May 2018 by the Dean of Westminster, the Very Reverend Dr John Hall. The fountain sits over an old monastic well in the garth. It was designed by Ptolemy Dean, the Abbey's Surveyor of the Fabric, and was developed with the assistance of gardener Alan Titchmarsh. The fountain was made in lead by sculptor Brian Turner."]}, {"page": "Severndroog Castle", "response": ["In 1988, the local council could no longer afford the building's upkeep and it was boarded up. In 2002, a community group, the Severndroog Castle Building Preservation Trust, was established. In 2004, it featured in the BBC TV series Restoration (presented by Griff Rhys Jones, Ptolemy Dean and Marianne Suhr) to gain publicity and support to restore the building and open it to the public."]}, {"page": "Ptolemy (name)", "response": ["*Ptolemy Dean (born 1968) – British architect, author, and TV presenter"]}, {"page": "Restoration (TV series)", "response": ["The host of all three series is Griff Rhys Jones, whilst investigating each building in the heats are the show's resident \"ruin detectives\", Marianne Suhr and Ptolemy Dean.", "The Perfect Village was a companion series of architectural travelogues presented by Ptolemy Dean, and shown on BBC Four in 2006. The show chose twelve villages from all around the United Kingdom as illustrations of village life. In the final show Heighington in County Durham was chosen as the UK's \"perfect village\"."]}, {"page": "Heighington, County Durham", "response": ["In 2006 Heighington was judged, by Ptolemy Dean, from amongst 11 other villages around the UK to be the BBC's Perfect Village."]}, {"page": "List of people associated with University College London", "response": ["* Ptolemy Dean (Architecture), architect and TV presenter"]}, {"page": "St Albans School, Hertfordshire", "response": ["Since the 19th century, there have been many additions to the school site, which now comprises a very interesting architectural mixture of buildings dating from the Roman-era cellar, where the archives are kept under the Abbey Gateway, to modern extensions built in the 1990s.Hertfordshire HER & St Albans UAD. heritagegateway.org.uk The school also includes the oldest room in the world regularly used as a classroom, the 12th century West Gate Room, which was incorporated from a previous gateway into the current Abbey Gateway in the 1360s. Ptolemy Dean is the current school architect.The Capital Development Programme – The Old Albanian Club . Oaconnect.co.uk. Retrieved on 13 December 2011."]}, {"page": "Tacita Dean", "response": ["Dean was born in Canterbury, Kent. Her mother is named Jenefer and her father was Joseph Dean, a lawyer who studied classics at Merton College, Oxford. She has a sister named Antigone and a brother, an architect, named Ptolemy Dean. Her grandfather was Basil Dean, the founder of Ealing Studios.", "*Ptolemy Dean"]}, {"page": "Kent College", "response": ["* Ptolemy Dean, architect, and resident \"ruin detective\" on the BBC television programme, \"Restoration\""]}, {"page": "Moggerhanger House", "response": ["As Ptolemy Dean notes, \"with so much of the old fabric concealed by later finishes, it was little wonder that the importance of this building had been so under-recognised. The sense that this house and estate would soon emerge as one of Soane's key masterpieces was unimaginable.\"Dean, Ptolemy. \"It was Unimaginable that this House Would Emerge as a Soane Masterpiece.\" The Architect's Journal 3 May 2007. pp 24–35"]}, {"page": "Marianne Suhr", "response": ["Marianne Suhr MRICS (born c. 1969) is an English Chartered Building Surveyor, writer, and expert on historic buildings. She co-presented the television series Restoration with Ptolemy Dean and Griff Rhys Jones.Marianne Suhr at imdb.com, accessed 23 July 2008Project: Restoration  at electricsky.com, accessed 23 July 2008"]}, {"page": "St Andrew's Church, Farnham", "response": ["From 1990 to 2005, fundraising and planning efforts were made for a large-scale conservation project that would reinforce and repair the building's structure and foundations. £1.3 million was raised and Ptolemy Dean was given the role as architect for the development phase of the work. The tower and clock were restored, the buttresses were rebuilt and the Victorian pews were replaced with chairs."]}, {"page": "Provender House", "response": ["The next owner is their daughter, Princess Olga Andreevna Romanoff, who has three surviving children. The princess, of a state no longer having a royal family but being the maternal family of King George V who died in 1936, saw the house refurbished in the 2000s by the architect Ptolemy Dean."]}, {"page": "Surveyor of the Fabric of Westminster Abbey", "response": ["#Ptolemy Dean (2012–present)"]}, {"page": "The Art of Architecture", "response": ["| Ptolemy Dean"]}]}}