{"wiki_id": "http://www.wikidata.org/entity/Q7253041", "itemLabel": "Prunella Clough", "itemDescription": "British artist (1919-1999)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prunella_Clough", "wikipedia_page": {"main": "Prunella Clough (14 November 1919 – 26 December 1999) was a prominent British artist.  She is known mostly for her paintings, though she also made prints and created assemblages of collected objects. She was awarded the Jerwood Prize for painting, and received a retrospective exhibition at Tate Britain.", "link_mentions": [{"page": "Chelsea, London", "response": ["Its reputation stems from a period in the 19th century when it became a sort of Victorian artists' colony: painters such as James Webb, Dante Gabriel Rossetti, J. M. W. Turner, James McNeill Whistler, William Holman Hunt, and John Singer Sargent all lived and worked here. There was a particularly large concentration of artists in the area around Cheyne Walk and Cheyne Row, where the Pre-Raphaelite movement had its heart. The artist Prunella Clough was born in Chelsea in 1919."]}, {"page": "2 Willow Road", "response": ["Goldfinger himself designed much of the furniture in No. 2, and the house also contains a significant collection of 20th-century art by Bridget Riley, Prunella Clough, Marcel Duchamp, Eduardo Paolozzi, Henry Moore and Max Ernst."]}, {"page": "Peter Adam (filmmaker)", "response": ["Adam was an executive producer with the BBC for 22 years. He was the editor of the arts magazines Review and Arena. He was made an Officier des Arts et des Lettres by the French Government. An autobiography, Mémoires à contre-vent, was published in French by Edition La Différence in April 2010,(in French) Mémoires à contre-vent – livres de Peter Adam – Critique – Telerama.fr previously issued in English as Not Drowning But Waving. An Autobiography (Andre Deutsch, London 1995). His memoirs detailed his friendships with many prominent filmmakers and writers. Adam was a close friend of the painters Prunella Clough and Keith Vaughan, and contributed much to work on both artists."]}, {"page": "Wimbledon College of Arts", "response": ["* Prunella Clough (artist)", "* Prunella Clough (1999 Jerwood Painting Prize winner)"]}, {"page": "Graves Art Gallery", "response": ["The gallery's first director was John Rothenstein, who became director of the Tate Gallery. The painter, George Hamilton Constantine followed from 1938 until the 1950s. Rothenstein and Constantine were key figures in broadening the 20th century British collection which Graves had begun. The search for individual pieces of outstanding significance and quality characterised their vision with works by Walter Sickert, Harold Gilman, Gwen John, C R W Nevinson, Jacob Epstein, Stanley Spencer, William Roberts, Paul Nash, Christopher Wood, David Bomberg, L S Lowry, John Minton, Henry Moore, Keith Vaughan, Prunella Clough and Frank Auerbach purchased for the city."]}, {"page": "Jerwood Painting Prize", "response": ["The Jerwood Painting Prize was a prize for originality and excellence in painting in the United Kingdom, awarded and funded by the Jerwood Foundation. It was open to all artists born or resident in the UK, regardless of age or reputation. Winners of the prize include Craigie Aitchison, Patrick Caulfield, Prunella Clough and Maggi Hambling. The prize was instituted in 1994, and at £30,000 was the largest of its kind in Britain. The prize is no longer awarded.", "* 1999: Prunella Clough"]}, {"page": "Clough (disambiguation)", "response": ["* Prunella Clough (1919 - 1999), British artist"]}, {"page": "Abbot Hall Art Gallery", "response": ["* Prunella Clough"]}, {"page": "York Art Gallery", "response": ["In November 2020 the gallery announced that it had acquired works following a successful application to the Derbyshire School Library Service, which had owned the works but closed in 2018. The works acquired are by four British artists: Prunella Clough, Margaret Mellis, Marion Grace Hocken, and Daphne Fedarb."]}, {"page": "John Salt", "response": ["Salt was born and brought up in the Sheldon district of Birmingham. His father was a motor repair garage owner, whose stepfather in turn had been a signwriter painting stripes on the bodies of cars. As a young boy Salt was encouraged to draw and paint, and at the age of fifteen he gained admittance to the Birmingham School of Art, where he studied from 1952 to 1958. From 1958 until 1960 he studied at the Slade School of Art in London, where he was particularly influenced by the work of the English artist Prunella Clough and American Pop Art figures such as Robert Rauschenberg."]}, {"page": "Falmouth Art Gallery", "response": ["Following a 2009 Art Fund bequest, Falmouth acquired a major collection including etchings by Pierre-Auguste Renoir and Edvard Munch, and several works by Prunella Clough, one of the most significant British painters and printmakers of the post-war period. This was followed in 2013 by a major gift of 20 works of art to the gallery from the British artist Robert Priseman (b. 1965). Known as The Robert Priseman Gift works of art by leading British artists of the 21st century such as Mary Webb, Sir Peter Blake, Nicholas Middleton, Marguerite Horner, Alex Hanna, Simon Burton, Simon Carter and Julian Brown were donated to the Gallery."]}, {"page": "Peter Joyce", "response": ["*\"Exhibition Catalogue: Quiet Waters\" by Joyce, Prunella Clough, Jeremy Gardiner, and John Tunnard, including essays by Simon Olding & Gary Topp (April 2002)"]}, {"page": "Prunella (given name)", "response": ["* Prunella Clough (1919–1999), a prominent British artist"]}, {"page": "List of people who have declined a British honour", "response": ["*Prunella Clough, painter (in 1979;. previously declined OBE in 1968).", "*Prunella Clough, painter (in 1968), later declined CBE in 1979."]}, {"page": "Hastings Contemporary", "response": ["The Hastings Contemporary is a museum of contemporary British art located on The Stade in Hastings, East Sussex and is a not for profit organisation. The gallery opened in March 2012 as the Jerwood Gallery and cost £4m to build. The gallery contains both temporary exhibitions and a permanent collection that includes work from artists including: L. S. Lowry, Augustus John, Stanley Spencer, Walter Sickert, Ben Nicholson, Patrick Caulfield, Maggi Hambling, Craigie Aitchison and Prunella Clough."]}, {"page": "David Blackburn (artist)", "response": ["On the advice of his tutor, Blackburn successfully applied for a place at the Royal College of Art, where he studied from 1959–1962. Although he was initially based in the Textile Department, students were encouraged to move between areas, and Blackburn quickly found himself drawn to the more subtle challenges of landscape art, a slightly unfashionable subject at the time. Many of Blackburn's contemporaries, including David Hockney and R.B. Kitaj, were gaining major critical recognition for their innovations in what would soon become known as Pop Art, or 'Royal College Pop'.Peter Fuller, 'David Blackburn: Light and Landscape', catalogue essay, Yale Centre for British Art (1989), p. 9. Blackburn was unmoved by the playful aesthetic of such trends, preferring instead the quieter visions of landscape artists such as Gerhart Frankl and Prunella Clough, the former of whom went on to become a major influence and personal friend.Fuller, p. 9."]}, {"page": "Monika Kinley", "response": ["Kinley was introduced to the London art scene by working on the bookstall at the Tate Gallery in 1953 selling postcards. She worked in art dealing, first with Victor Waddington and then at the Grosvenor Gallery, and when she separated from Peter Kinley (died 1988) she began to deal on her own account from her home, a flat in Hammersmith. She acted for Prunella Clough, Keith Vaughan, Leon Kossoff and Frank Auerbach, and as an adviser to museums and galleries."]}, {"page": "Druie Bowett", "response": ["Born Drucilla Glover in Ripon, North Yorkshire in 1924, Bowett attended the Queen Margaret's School, York before studying at the Harrogate School of Art under John Cooper, a pupil of Walter Sickert. She became a close friend of Hungarian artist Jean-Georges Simon during her time at Harrogate, and later worked alongside notable artists such as Henry Moore, Graham Sutherland, Terry Frost and Prunella Clough. She was an active member of the prestigious Midland Group - 'a regionally influential collective of Modernist painters based in Nottingham with links to the St Ives School and Wilhelmina Barns-Graham' - and through this formed an enduring friendship with its founding member, Evelyn Gibbs. She married John Bowett in 1943, whose death in 1994 inspired 'an extraordinary series of paintings' shown at the Pierrepoint Gallery, Nottinghamshire."]}, {"page": "Nahem Shoa", "response": ["In 2014, Shoa gave his lecture \"Paradise Found\" at Exeter's Royal Albert Memorial Museum and Art Gallery as part of the exhibition Detached and Timeless, which included paintings by David Bomberg, Prunella Clough, Patrick Heron, Peter Lanyon, and Clare Woods. Shoa's lecture explored the various approaches used by these painters to depict the landscape of Britain's southwest."]}, {"page": "The Nine British Art", "response": ["* Prunella Clough"]}]}}