{"wiki_id": "http://www.wikidata.org/entity/Q725559", "itemLabel": "Edmund Blunden", "itemDescription": "British poet, author and critic (1896–1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edmund_Blunden", "wikipedia_page": {"main": "Edmund Charles Blunden  (1 November 1896 – 20 January 1974) was an English poet, author and critic. Like his friend Siegfried Sassoon, he wrote of his experiences in World War I in both verse and prose. For most of his career, Blunden was also a reviewer for English publications and an academic in Tokyo and later Hong Kong. He ended his career as Professor of Poetry at the University of Oxford. He was nominated for the Nobel Prize in Literature six times.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Edmund Blunden (1896–1974, E)"]}, {"page": "November 1", "response": ["*1896 – Edmund Blunden, English author, poet, and critic (d. 1974)"]}, {"page": "Robert Graves", "response": ["In October 1919, he took up his place at the University of Oxford, soon changing course to English Language and Literature, though managing to retain his Classics exhibition. In consideration of his health, he was permitted to live a little outside Oxford, on Boars Hill, where the residents included Robert Bridges, John Masefield (his landlord), Edmund Blunden, Gilbert Murray and Robert Nichols.Graves (1960) pp. 238–42. Later, the family moved to Worlds End Cottage on Collice Street, Islip, Oxfordshire. India's prisoner: a biography of Edward John Thompson, 1886–1946 His most notable Oxford companion was T. E. Lawrence, then a Fellow of All Souls', with whom he discussed contemporary poetry and shared in the planning of elaborate pranks.Graves (1960) pp. 242–47. By this time, he had become an atheist.\"In addition, between 1919 and 1924 Nancy gave birth to four children in under five years; while Graves (now an atheist like his wife) suffered from recurring bouts of shell-shock.\" Richard Perceval Graves, 'Graves, Robert von Ranke (1895–1985)', Oxford Dictionary of National Biography, Oxford University Press, September 2004; online edition, October 2006  (accessed 1 May 2008). His work was part of the literature event in the art competition at the 1924 Summer Olympics."]}, {"page": "Good-Bye to All That", "response": ["Siegfried Sassoon and his friend Edmund Blunden (whose First World War service had been in a different regiment) took umbrage at the contents of the book. Sassoon's complaints mostly related to Graves's depiction of him and his family, whereas Blunden had read the memoirs of J. C. Dunn and found them at odds with Graves in some places.Hugh Cecil, \"Edmund Blunden and First World War Writing 1919–36\" The two men took Blunden's copy of Good-Bye to All That and made marginal notes contradicting some of the text. That copy survives and is held by the New York Public Library.Anne Garner, \"Engaging the Text: Literary Marginalia in the Berg Collection\", June 4, 2010. Accessed 6 November 2012. Graves's father, Alfred Perceval Graves, also incensed at some aspects of Graves's book, wrote a riposte to it titled To Return to All That."]}, {"page": "Siegfried Sassoon", "response": ["The year 2003 saw the publication of Memorial Tablet, an authorised audio CD of readings by Sassoon recorded during the late 1950s. These included extracts from Memoirs of an Infantry Officer and The Weald of Youth, as well as several war poems including Attack, The Dug-Out, At Carnoy and Died of Wounds, and postwar works. The CD also included comment on Sassoon by three of his Great War contemporaries: Edmund Blunden, Edgell Rickword and Henry Williamson."]}, {"page": "Wilfred Owen", "response": ["Owen's poems had the benefit of strong patronage, and it was a combination of Sassoon's influence, support from Edith Sitwell, and the preparation of a new and fuller edition of the poems in 1931 by Edmund Blunden that ensured his popularity, coupled with a revival of interest in his poetry in the 1960s which plucked him out of a relatively exclusive readership into the public eye. Though he had plans for a volume of verse, for which he had written a \"Preface\", he never saw his own work published apart from those poems he included in The Hydra, the magazine he edited at Craiglockhart War Hospital, and \"Miners\", which was published in The Nation."]}, {"page": "Oxford University Press", "response": ["Japan was a much less well-known market to OUP, and a small volume of trade was carried out largely through intermediaries. The Maruzen company was by far the largest customer, and had a special arrangement regarding terms. Other business was routed through H. L. Griffiths, a professional publishers' representative based in Sannomiya, Kobe. Griffiths travelled for the Press to major Japanese schools and bookshops and took a 10 percent commission. Edmund Blunden had been briefly at the University of Tokyo and put the Press in touch with the university booksellers, Fukumoto Stroin. One important acquisition did come from Japan, however: A. S. Hornby's Advanced Learner's Dictionary. It also publishes textbooks for the primary and secondary education curriculum in Hong Kong. The Chinese-language teaching titles are published with the brand Keys Press (啟思出版社)."]}, {"page": "List of poets", "response": ["*Edmund Blunden (1896–1974), English poet, author and literary critic"]}, {"page": "Lyric poetry", "response": ["Europe, and the British colonies. The English Georgian poets and their contemporaries such as A. E. Housman, Walter de la Mare, and Edmund Blunden used the lyric form. The Bengali poet Rabindranath Tagore was praised by William Butler Yeats for his lyric poetry; Yeats compared him to the troubadour poets when the two met in 1912."]}, {"page": "Regeneration (novel)", "response": ["*Literary critic Alistair M. Duckworth describes the novel building on narratives and thematic elements found in both Robert Graves's Goodbye to All That (1929) and Edmund Blunden's Undertones of War (1928)."]}, {"page": "Laurence Binyon", "response": ["Artists Rifles, a CD audiobook published in 2004, includes a reading of \"For the Fallen\" by Binyon himself. The recording itself is undated and appeared on a 78 rpm disc issued in Japan. Other Great War poets heard on the CD include Siegfried Sassoon, Edmund Blunden, Robert Graves, David Jones and Edgell Rickword.Artists Rifles (1914–18). Ltmrecordings.com. Retrieved on 19 July 2016."]}, {"page": "Gerald Finzi", "response": ["Finzi’s choral music includes the popular anthems Lo, the full, final sacrifice and God is gone up as well as unaccompanied partsongs, but he also wrote larger-scale choral works such as For St. Cecilia (text by Edmund Blunden), Intimations of Immortality (William Wordsworth) and the Christmas scene In terra pax (Robert Bridges and the Gospel of Luke), all from the last ten years of his life."]}, {"page": "Rupert Hart-Davis", "response": ["In his seven years with Cape, Hart-Davis recruited a successful group of authors ranging from the poets William Plomer, Cecil Day-Lewis, Edmund Blunden and Robert Frost, to the humorist Beachcomber. He was well placed to secure Duff Cooper's life of Talleyrand, as Cooper was his uncle. As the junior partner at Cape, he had to handle their difficult authors including Robert Graves, Wyndham Lewis and Arthur Ransome, the last being seen as difficult because of his wife Genia, with her \"distrustfulness, venom and guile\". Hart-Davis was a close friend of Ransome, sharing an enthusiasm for cricket and rugby. After Herbert Jonathan Cape's death in 1960 he commented to George Lyttelton that Cape had been \"one of the tightest-fisted old bastards I've ever encountered\".Hart-Davis, Volume 4, letter of 20 February 1960 The second partner, Wren Howard, was \"even tighter\" than Cape, and neither of them liked fraternising with authors, which they left to Hart-Davis.", "Public honours included honorary doctorates from the universities of Durham and Reading and a knighthood in 1967 for services to literature.  Twenty-two books were dedicated to him between 1936 and 1998, including works by H. E. Bates, Edmund Blunden, C. Day-Lewis, Ray Bradbury, Lady Diana Cooper, Eric Linklater, Compton Mackenzie, Anthony Powell and Leon Edel.Hart-Davis (1998), p. 157 Merlin Holland's Oscar Wilde: A Life in Letters (2003) was dedicated \"To the memory of Rupert Hart-Davis, with love and gratitude.\""]}, {"page": "English poetry", "response": ["The Georgian poets were the first major grouping of the post-Victorian era. Their work appeared in a series of five anthologies called Georgian Poetry which were published by Harold Monro and edited by Edward Marsh. The poets featured included Edmund Blunden, Rupert Brooke, Robert Graves, D. H. Lawrence, Walter de la Mare and Siegfried Sassoon. Their poetry represented something of a reaction to the decadence of the 1890s and tended towards the sentimental."]}, {"page": "1920 in literature", "response": ["*Edmund Blunden – The Waggoner and Other Poems"]}, {"page": "1922 in literature", "response": ["*Edmund Blunden – The Shepherd, and Other Poems of Peace and War", "*Hawthornden Prize for poetry: Edmund Blunden"]}, {"page": "1928 in literature", "response": ["*Edmund Blunden – Undertones of War (autobiography)"]}, {"page": "1974 in literature", "response": ["*January 20 – Edmund Blunden, English poet and critic (born 1896)"]}, {"page": "1956 in literature", "response": ["*Queen's Gold Medal for Poetry: Edmund Blunden"]}, {"page": "William Adams (pilot)", "response": ["* In the city of Itō, Shizuoka, the Miura Anjin Festival is held annually on 10 August. On the seafront at Itō is a monument to Adams. Next to it is a plaque inscribed with Edmund Blunden's poem, \"To the Citizens of Ito\", which commemorates Adams' achievement."]}, {"page": "Edward Young", "response": ["Young's masterpiece Night-Thoughts emerged from obscurity by being mentioned in Edmund Blunden's World War One memoir, Undertones of War (1928), as a source of comfort during time in the trenches. This latter work emerged from the darkness of the more recent past thanks to its mention and discussion in Paul Fussell's The Great War and Modern Memory (1975), which discussed Blunden's reliance on Night-Thoughts. Blunden's mention of Young's poem reintroduced an interesting, sometimes bombastic precursor to the early Romantics to students of English literature."]}, {"page": "Charles Lamb", "response": ["*Charles Lamb and His Contemporaries, by Edmund Blunden, Cambridge University Press, 1933."]}, {"page": "Georgian Poetry", "response": ["The Georgian poets were, by the strictest definition, those whose works appeared in a series of five anthologies named Georgian Poetry, published by Harold Monro and edited by Edward Marsh, the first volume of which contained poems written in 1911 and 1912. The group included Edmund Blunden, Rupert Brooke, Robert Graves, D. H. Lawrence, Walter de la Mare, Siegfried Sassoon and John Drinkwater.James Campbell, A kind of magic, The Guardian, 10 June 2006. It was not until the final two volumes that the decision was taken to include female poets.", "Lascelles Abercrombie - Martin Armstrong - Edmund Blunden - Francis Brett Young - W. H. Davies - Walter de la Mare - John Drinkwater - John Freeman - W. W. Gibson - Robert Graves - Richard Hughes - William Kerr - D. H. Lawrence - Harold Monro - Robert Nichols - J. D. C. Pellow - Frank Prewett - Peter Quennell - Vita Sackville-West - Edward Shanks - J. C. Squire"]}, {"page": "World War I in literature", "response": ["After the war many participants published their memoirs and diaries. One of the first was Storm of Steel (1920) by German writer Ernst Jünger, an account of his experiences as an officer on the Western Front (it was first published in English in 1930). The first memoirs of Allied combatants were published in 1922, not long after the armistice: A Tank Driver's Experiences by Arthur Jenkins and Disenchantment by Charles Edward Montague. These were shortly joined with Undertones of War (1928) by Edmund Blunden, Good-Bye to All That (1929) by Robert Graves, A Subaltern's War (1929) by Charles Edmund Carrington, A Passionate Prodigality (1933) by Guy Chapman and Blasting and Bombardiering (1937) by Percy Wyndham Lewis. Memoirs of airmen included Wind in the Wires (1933) by Duncan Grinnell-Milne, Wings of War (1933) by Rudolf Stark and Sagittarius Rising (1936) by Cecil Arthur Lewis. Nurses also published memoirs of their wartime experiences, such as A Diary without Dates (1918) by Enid Bagnold, Forbidden Zone (1929) by Mary Borden, Testament of Youth (1933) by Vera Brittain and We That Were Young (1932) by Irene Rathbone."]}, {"page": "John Clare", "response": ["Clare was relatively forgotten in the later 19th century, but interest in his work was revived by Arthur Symons in 1908, Edmund Blunden in 1920 and John and Anne Tibble in their ground-breaking 1935 two-volume edition, while in 1949 Geoffrey Grigson edited as Poems of John Clare's Madness (published by Routledge and Kegan Paul). Benjamin Britten set some of \"May\" from A Shepherd's Calendar in his Spring Symphony of 1948 and included a setting of The Evening Primrose in his Five Flower Songs."]}, {"page": "Harold Monro", "response": ["Lascelles Abercrombie, Richard Aldington, John Alford, A. C. Benson, Laurence Binyon, Edmund Blunden, W. S. Blunt, Gordon Bottomley, Robert Bridges, Rupert Brooke, Samuel \"Erewhon\" Butler, Roy Campbell, G. K. Chesterton, Richard Church, Padraic Colum, A. E. Coppard, Frances Cornford, John Davidson, W. H. Davies, Jeffery Day, Walter de la Mare, Lord Alfred Douglas, John Drinkwater, Helen Parry Eden, T. S. Eliot, Vivian Locke Ellis, Michael Field, J. E. Flecker, F. S. Flint, John Freeman, Stella Gibbons, Wilfrid Gibson, Robert Graves, Thomas Hardy, H. D., Philip Henderson, Maurice Hewlett, Ralph Hodgson, Gerard Manley Hopkins, A. E. Housman, Ford Madox Hueffer, T. E. Hulme, Aldous Huxley, James Joyce, Rudyard Kipling, D. H. Lawrence, Cecil Day-Lewis, John Masefield, R. A. K. Mason, Charlotte Mew, Alice Meynell, Viola Meynell, Harold Monro, T. Sturge Moore, Edwin Muir, Henry Newbolt, Robert Nichols, Alfred Noyes, Wilfred Owen, J. D. C. Pellow, H. D. C. Pepler, Eden Phillpotts, Ezra Pound, Peter Quennell, Herbert Read, Isaac Rosenberg, Siegfried Sassoon, Geoffrey Scott, Edward Shanks, Fredegond Shove, Edith Sitwell, Osbert Sitwell, Sacheverell Sitwell, Stephen Spender, J. C. Squire, James Stephens, Edward Thomas, W. J. Turner, Sylvia Townsend Warner, Max Weber, Anna Wickham, Humbert Wolfe, William Butler Yeats"]}, {"page": "Ivor Gurney", "response": ["Edmund Blunden, at the urging of Gerald Finzi, assembled the first collection of Gurney's poetry which was published in 1954. This was followed by P. J. Kavanagh's Collected Poems, first published in 1982 and reissued in 2004. It remains the most comprehensive edition of Gurney's poetry. Gurney is regarded as one of the great World War I poets, and like others of them, such as Edward Thomas, whom he admired, he often contrasted the horrors of the front line with the beauty and tranquillity of his native English landscape – these themes were explored in the 2012 musical play A Soldier and a Maker."]}, {"page": "Palgrave's Golden Treasury", "response": ["William Blake – Walter Savage Landor – T. L. Peacock – John Clare – W. C. Bryant – George Darley – William Barnes – Thomas Lovell Beddoes – Ralph Waldo Emerson – Elizabeth Barrett Browning – H. W. Longfellow – Edward Fitzgerald – Edgar Allan Poe – Alfred Tennyson – Robert Browning – Aubrey de Vere – Emily Brontë – A. H. Clough – Charles Kingsley – Herman Melville – Walt Whitman – Jean Ingelow – Matthew Arnold – William Cory – Coventry Patmore – William Allingham – Sydney Dobell – George Meredith – D. G. Rossetti – Emily Dickinson – Christina Rossetti – Richard Watson Dixon – William Morris – Warren de Tabley – Algernon Charles Swinburne – Thomas Hardy – Robert Bridges – Gerard Manley Hopkins – Andrew Lang – A. W. E. O’Shaughnessy – R. L. Stevenson – John Davidson – A. E. Housman – Francis Thompson – Mary E. Coleridge – Rudyard Kipling – W. B. Yeats – Ernest Dowson – Lionel Johnson – Laurence Binyon – Edwin Arlington Robinson – Hilaire Belloc – T. Sturge Moore – W. H. Davies – Ralph Hodgson – Walter de la Mare – G. K. Chesterton – Robert Frost – John Masefield – Edward Thomas – Harold Monro – Padraic Colum – James Stephens – James Elroy Flecker – D. H. Lawrence – Ezra Pound – Andrew Young – Siegfried Sassoon – Rupert Brooke – Edwin Muir – Edith Sitwell – T. S. Eliot – John Crowe Ransom – W. J. Turner – Dorothy Wellesley – V. Sackville-West – Wilfred Owen – Lilian Bowes Lyon – Robert Graves – Edmund Blunden – F. R. Higgins – William Soutar – Roy Campbell – C. Day-Lewis – John Betjeman – W. H. Auden – Louis MacNeice – Stephen Spender – George Barker – Laurie Lee – Henry Reed – Dylan Thomas – Alun Lewis – David Gascoyne – Sidney Keyes", "Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Dulce et Decorum est", "response": ["Only five of Owen's poems were published in his lifetime. However, after his death, his heavily-worked manuscript drafts were brought together and published in two different editions by Siegfried Sassoon with the assistance of Edith Sitwell (in 1920) and Edmund Blunden (in 1931)."]}, {"page": "Keith Douglas", "response": ["After his bruising brush with authority in 1935, Douglas settled down to a less troubled and more productive period at school, during which he excelled both at studies and games, and at the end of which he won an open exhibition to Merton College, Oxford, in 1938 to read History and English. The First World War-veteran and well-known poet Edmund Blunden was his tutor at Merton, and regarded his poetic talent highly. Blunden sent his poems to T. S. Eliot, the doyen of English poetry, who found Douglas's verses 'impressive'. Douglas became the editor of Cherwell, and one of the poets anthologised in the collection Eight Oxford Poets (1941), although by the time that volume appeared he was already in the army. He does not seem to have been acquainted with somewhat junior but contemporary Oxford poets such as Sidney Keyes, Drummond Allison, John Heath-Stubbs and Philip Larkin, who would make names for themselves. At Oxford, he was good friends with J. C. Hall who became his literary executor."]}, {"page": "Saint Cecilia", "response": ["Her feast day became an occasion for musical concerts and festivals that occasioned well-known poems by John Dryden and Alexander PopeOde on St. Cecilia's Day (composed 1711) at, for example, www.PoemHunter.com and music by Henry Purcell (Ode to St. Cecilia); several oratorios by Marc-Antoine Charpentier (In honorem Caeciliae, Valeriani et Tiburtij canticum; and several versions of Caecilia virgo et martyr to libretti probably written by Philippe Goibaut); George Frideric Handel (Ode for St. Cecilia's Day; Alexander's Feast); Charles Gounod (St. Cecilia Mass); as well as Benjamin Britten, who was born on her feast day (Hymn to St Cecilia, based on a poem by W. H. Auden). Herbert Howells' A Hymn to Saint Cecilia has words by Ursula Vaughan Williams; Gerald Finzi's \"For Saint Cecilia\", Op. 30, was set to verses written by Edmund Blunden; Michael Hurd's 1966 composition \"A Hymn to Saint Cecilia\"Published by Novello & Co., HL.14013968 sets John Dryden's poem; and Frederik Magle's Cantata to Saint Cecilia is based on the history of Cecilia. The Heavenly Life, a poem from Des Knaben Wunderhorn (which Gustav Mahler used in his Symphony No. 4) mentions that \"Cecilia and all her relations make excellent court musicians.\"", "* Gerald Finzi composed \"For St. Cecilia\" for solo tenor, chorus (SATB), and orchestra.  Setting of a work by English poet and author Edmund Blunden. Duration ca 18 minutes."]}, {"page": "1922 in the United Kingdom", "response": ["* Edmund Blunden's collection The Shepherd, and Other Poems of Peace and War."]}, {"page": "Joy Finzi", "response": ["Together with her husband, Finzi played an important part in founding the Newbury String Players. She devoted much time to preserving the work of composer-poet Ivor Gurney, continuing her husband's work after his premature death in 1956. She sketched portraits of contemporary musicians including Ralph Vaughan Williams, Sir Adrian Boult, Howard Ferguson and Sir Arthur Bliss, and writers including Edmund Blunden, Ursula K. Le Guin, Sylvia Townsend Warner and David Jones.."]}, {"page": "Poets' Corner", "response": ["| Edmund Blunden"]}, {"page": "1920 in the United Kingdom", "response": ["* Edmund Blunden's The Waggoner and Other Poems."]}, {"page": "Oxford Book of Modern Verse 1892–1935", "response": ["*Edmund Blunden"]}, {"page": "War poet", "response": ["In November 1985, a slate memorial was unveiled in Poet's Corner commemorating 16 poets of the Great War: Richard Aldington, Laurence Binyon, Edmund Blunden, Rupert Brooke, Wilfrid Gibson, Robert Graves, Julian Grenfell, Ivor Gurney, David Jones, Robert Nichols, Wilfred Owen, Herbert Read, Isaac Rosenberg, Siegfried Sassoon, Charles Sorley and Edward Thomas.Westminster Abbey: Poets of the First World War"]}, {"page": "The New Oxford Book of English Verse 1250–1950", "response": ["William Allingham - Matthew Arnold - W. H. Auden - William Barnes - Richard Barnfield - John Beaumont - Thomas Lovell Beddoes - Aphra Behn - Hilaire Belloc - John Betjeman - Laurence Binyon - William Blake - Edmund Blunden - Mark Alexander Boyd - Nicholas Breton - Robert Bridges - Emily Brontë - Rupert Brooke - William Browne of Tavistock - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - Samuel Butler - John Byrom - George Gordon Noel Byron - Thomas Campbell - Thomas Campion - Thomas Carew - Lewis Carroll - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Henry Chettle - John Clare - John Cleveland - Arthur Hugh Clough - Samuel Taylor Coleridge - William Collins - William Congreve - Richard Corbet - William Cornish - William Cory - Abraham Cowley - George Crabbe - Richard Crashaw - Samuel Daniel - George Darley - William Davenant - John Davidson - John Davies - W. H. Davies - Cecil Day-Lewis - Walter de la Mare - Richard Watson Dixon - John Donne - Keith Douglas - Ernest Dowson - Michael Drayton - William Drummond of Hawthornden - John Dryden - William Dunbar - Edward Dyer - T. S. Eliot - William Empson - Richard Fanshawe - Edward Fitzgerald - James Elroy Flecker - Giles Fletcher - Phineas Fletcher - John Ford - Roy Fuller - George Gascoigne - John Gay - Sidney Godolphin - Oliver Goldsmith - James Graham - Robert Graves - Thomas Gray - Robert Greene - Fulke Greville - William Habington - Thomas Hardy - William Ernest Henley - George Herbert - Lord Herbert of Cherbury - Robert Herrick - Ralph Hodgson - Thomas Hood - Gerard Manley Hopkins - A. E. Housman - Henry Howard, Earl of Surrey - James Leigh Hunt - Lionel Johnson - Samuel Johnson - Ben Jonson - Thomas Jordan - James Joyce - John Keats - Henry King - Rudyard Kipling - Francis Kynaston - Charles Lamb - Walter Savage Landor - William Langland - D. H. Lawrence - Edward Lear - Alun Lewis - Thomas Lodge - Richard Lovelace - John Lyly - Thomas Babington Macaulay - Louis MacNeice - Christopher Marlowe - Andrew Marvell - John Masefield - George Meredith - Alice Meynell - John Milton - Thomas Moore - Thomas Osbert Mordaunt - William Morris - Edwin Muir - Anthony Munday - Thomas Nashe - Charles of Orleans - Wilfred Owen - Coventry Patmore - Thomas Love Peacock - George Peele - Alexander Pope - Ezra Pound - Winthrop Mackworth Praed - Matthew Prior - Francis Quarles - Kathleen Raine - Walter Raleigh - Thomas Randolph - Henry Reed - Anne Ridler - Samuel Rogers - Isaac Rosenberg - Christina Rossetti - Dante Gabriel Rossetti - Charles Sackville - Thomas Sackville - Siegfried Sassoon - John Scott of Amwell - Walter Scott - Charles Sedley - William Shakespeare - Percy Bysshe Shelley - William Shenstone - James Shirley - Philip Sidney - Edith Sitwell - John Skelton - Christopher Smart - Stevie Smith - Robert Southwell - Stephen Spender - Thomas Stanley - Robert Louis Stevenson - William Strode - John Suckling - Jonathan Swift - Algernon Charles Swinburne - Alfred Tennyson - Chidiock Tichborne - Dylan Thomas - Francis Thompson - James Thomson (The Seasons) - James Thomson ('B.V.') - Aurelian Townsend - Thomas Traherne - Walter James Turner - Henry Vaughan - Edmund Waller - Isaac Watts - John Webster - Charles Wesley - Robert Wever - Oscar Wilde - John Wilmot - George Wither - Charles Wolfe - William Wordsworth - Henry Wotton - Thomas Wyatt - W. B. Yeats"]}, {"page": "The Faber Book of Twentieth Century Verse", "response": ["L. Aaronson - Lascelles Abercrombie - Dannie Abse - Drummond Allison - W. H. Auden - George Barker - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Wilfrid Scawen Blunt - Robert Bridges - Rupert Brooke - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - G. K. Chesterton - Alex Comfort - A. E. Coppard - John Davidson - Idris Davies - W. H. Davies - Walter de la Mare - C. M. Doughty - Keith Douglas - Lawrence Durrell - T. S. Eliot - William Empson - James Elroy Flecker - David Gascoyne - Wilfrid Gibson - W. S. Graham - Robert Graves - Thomas Hardy - H. D. - Thomas Hennell - Rayner Heppenstall - Ralph Hodgson - A. E. Housman - James Joyce - Patrick Kavanagh - Sidney Keyes - Rudyard Kipling - James Kirkup - D. H. Lawrence - Laurie Lee - Alun Lewis - C. Day Lewis - Hugh MacDiarmid - Patrick MacDonogh - Louis MacNeice - John Masefield - Harold Monro - T. Sturge Moore - Edwin Muir - Henry Newbolt - Robert Nichols - Norman Nicholson - Wilfred Owen - Herbert Palmer - Ruth Pitter - William Plomer - Paul Potts - Ezra Pound - F. T. Prince - Kathleen Raine - Herbert Read - Edgell Rickword - Anne Ridler - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - John Short - Edith Sitwell - Stevie Smith - Sydney Goodsir Smith - Stephen Spender - J. C. Squire - Arthur Symons - Dylan Thomas - Edward Thomas - W. J. Turner - Dorothy Wellesley - Vernon Watkins - Anna Wickham - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "George Sutherland Fraser", "response": ["In 1949 he accepted the job of replacing Edmund Blunden as Cultural Adviser to the UK Liaison Mission in Tokyo. This ended badly when he suffered a breakdown in 1951 while in Japan. Subsequently he was much less the poet than the all-purpose writer."]}, {"page": "Professor of Poetry", "response": ["| 35 || bgcolor=\"darkblue\"|90px || Edmund Blunden(1896–1974) || 1966 || 1968 "]}, {"page": "John Gawsworth", "response": ["In 1931 he had the poem In Winter by W. H. Davies privately printed in a limited edition of 290 numbered copies, illustrated by Edward Carrick and all individually signed by Davies. A further special limited edition of 15 were printed on handmade paper and also hand-coloured by Carrick.Harlow, S. (1993), W. H. Davies – a Bibliography, Winchester: Oak Knoll Books, St. Paul's Bibliographies. . Three companion titles appeared in similar editions at the same time: In Spring by Edith Sitwell, In Summer by Edmund Blunden and In Autumn by Herbert Palmer.", "Edmund Blunden – A. E. Coppard – W. H. Davies – Lord Alfred Douglas – Ernest Dowson – John Drinkwater – John Freeman – John Gawsworth – Wilfrid Gibson – John Gray – Lionel Johnson – Hugh MacDiarmid – Richard Barham Middleton – Harold Monro – Herbert Palmer – Edith Sitwell – Leonard Strong – Edward Thomas – Theodore Wratislaw"]}]}}