{"wiki_id": "http://www.wikidata.org/entity/Q725186", "itemLabel": "Edward Bouverie Pusey", "itemDescription": "conservative churchman of the Church of England and Hebraist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Bouverie_Pusey", "wikipedia_page": {"main": "Edward Bouverie Pusey (; 22 August 1800 – 16 September 1882) was an English churchman, for more than fifty years Regius Professor of Hebrew at the University of Oxford. He was one of the leading figures in the Oxford Movement.", "link_mentions": [{"page": "Anglicanism", "response": ["Anglicanism was seen as a middle way, or via media, between two branches of Protestantism, Lutheranism and Reformed Christianity. In their rejection of absolute parliamentary authority, the Tractarians – and in particular John Henry Newman – looked back to the writings of 17th-century Anglican divines, finding in these texts the idea of the English church as a via media between the Protestant and Catholic traditions. This view was associated – especially in the writings of Edward Bouverie Pusey – with the theory of Anglicanism as one of three \"branches\" (alongside the Roman Catholic Church and the Orthodox Church) historically arising out of the common tradition of the earliest ecumenical councils. Newman himself subsequently rejected his theory of the via media, as essentially historicist and static and hence unable to accommodate any dynamic development within the church. Nevertheless, the aspiration to ground Anglican identity in the writings of the 17th-century divines and in faithfulness to the traditions of the Church Fathers reflects a continuing theme of Anglican ecclesiology, most recently in the writings of Henry Robert McAdoo.", "By the 19th century, there was a renewed interest in pre-Reformation English religious thought and practice. Theologians such as John Keble, Edward Bouverie Pusey, and John Henry Newman had widespread influence in the realm of polemics, homiletics and theological and devotional works, not least because they largely repudiated the old high-church tradition and replaced it with a dynamic appeal to antiquity which looked beyond the Reformers and Anglican formularies. Their work is largely credited with the development of the Oxford Movement, which sought to reassert Catholic identity and practice in Anglicanism."]}, {"page": "Jonah", "response": ["In the seventeenth and eighteenth centuries, naturalists, interpreting the Jonah story as a historical account, became obsessed with trying to identify the exact species of the fish that swallowed Jonah. In the mid-nineteenth century, Edward Bouverie Pusey, professor of Hebrew at Oxford University, claimed that the Book of Jonah must have been authored by Jonah himself and argued that the fish story must be historically true, or else it would not have been included in the Bible. Pusey attempted to scientifically catalogue the fish, hoping to \"shame those who speak of the miracle of Jonah's preservation in the fish as a thing less credible than any of God's other miraculous doings\"."]}, {"page": "September 18", "response": ["** Edward Bouverie Pusey (Episcopal Church)"]}, {"page": "University of Oxford", "response": ["The mid-19th century saw the impact of the Oxford Movement (1833–1845), led among others by the future Cardinal John Henry Newman. The influence of the reformed model of German universities reached Oxford via key scholars such as Edward Bouverie Pusey, Benjamin Jowett and Max Müller.", "Oxford has also produced at least 12 saints, 19 English cardinals, and 20 Archbishops of Canterbury, the most recent Archbishop being Rowan Williams, who studied at Wadham College and was later a Canon Professor at Christ Church. Duns Scotus' teaching is commemorated with a monument in the University Church of St. Mary. Religious reformer John Wycliffe was an Oxford scholar, for a time Master of Balliol College. John Colet, Christian humanist, Dean of St Paul's, and friend of Erasmus, studied at Magdalen College. Several of the Caroline Divines e.g. in particular William Laud as President of St. John's and Chancellor of the University, and the Non-Jurors, e.g. Thomas Ken had close Oxford connections. The founder of Methodism, John Wesley, studied at Christ Church and was elected a fellow of Lincoln College. Britain's first woman to be an ordained minister, Constance Coltman, studied at Somerville College. The Oxford Movement (1833–1846) was closely associated with the Oriel fellows John Henry Newman, Edward Bouverie Pusey and John Keble. Other religious figures were Mirza Nasir Ahmad, the third Caliph of the Ahmadiyya Muslim Community, Shoghi Effendi, one of the appointed leaders of the Baháʼí Faith, and Joseph Cordeiro, the first Pakistani Catholic cardinal."]}, {"page": "1882", "response": ["* September 16 – Edward Bouverie Pusey, British churchman (b. 1800)"]}, {"page": "1800", "response": ["** Edward Bouverie Pusey, English churchman (d. 1882)"]}, {"page": "Anglo-Catholicism", "response": ["The principal leaders of the Oxford Movement were John Keble, John Henry Newman and Edward Bouverie Pusey. The movement gained influential support, but it was also attacked by some bishops of the Church and by the latitudinarians within the University of Oxford, who believed in conforming to official Church of England practices but who felt that matters of doctrine, liturgical practice, and ecclesiastical organization were of relatively little importance. Within the Oxford movement, there gradually arose a much smaller group which tended towards submission to the supremacy of the Roman Catholic Church. In 1845, the university censured a tract entitled Ideal of a Christian Church and its author, the pro-Roman Catholic theologian W. G. Ward, on which basis was imputed the moniker \"Ideal Ward\". The year 1850 saw the victory of the Evangelical cleric George Cornelius Gorham in a celebrated legal action against church authorities. Consequently, some Anglicans of Anglo-Catholic churchmanship were received into the Roman Catholic Church, while others, such as Mark Pattison, embraced Latitudinarian Anglicanism, and yet others, such as James Anthony Froude, became sceptics. The majority of adherents of the movement, however, remained in the Church of England and, despite hostility in the press and in government, the movement spread. Its liturgical practices were influential, as were its social achievements (including its slum settlements) and its revival of male and female monasticism within Anglicanism."]}, {"page": "John Henry Newman", "response": ["Desiring to remain in Oxford, Newman then took private pupils and read for a fellowship at Oriel College, then \"the acknowledged centre of Oxford intellectualism\". He was elected a fellow at Oriel on 12 April 1822. Edward Bouverie Pusey was elected a fellow of the same college in 1823."]}, {"page": "Keble College, Oxford", "response": ["The main site of Keble contains five quads: Liddon (the largest, named after Henry Parry Liddon), Pusey (named after Edward Bouverie Pusey), Hayward (named after Charles Hayward), De Breyne (named after Andre de Breyne) and Newman (named after John Henry Newman)."]}, {"page": "Oriel College, Oxford", "response": ["Oriel has produced many notable alumni, from statesmen and cricketers to industrialists; a notable undergraduate in the 16th century was Sir Walter Raleigh, an explorer during the Age of Discovery. At the graduate level, the college boasts as former fellows the principal founders of the Oxford Movement: John Keble, Edward Bouverie Pusey, and John Henry Newman. The college has produced many other churchmen, bishops, cardinals, governors, and two Nobel Prize recipients: Alexander Todd (Nobel Prize in Chemistry, 1957) and James Meade (Nobel Memorial Prize in Economic Sciences, 1977)."]}, {"page": "Pusey House, Oxford", "response": ["Pusey House was opened on 9 October 1884Pall Mall Gazette, Th ursday 18 September 1884, p.10 in part as a memorial to Edward Bouverie Pusey, Regius Professor of Hebrew at Oxford University, a canon of Christ Church Cathedral and for 40 years, a leading figure in the Oxford Movement, a movement of the mid-19th century which sought to bring the Church of England to a deeper understanding of its witness as part of the universal (aka 'catholic') Church. It was also intended to continue the work of Pusey in restoring the Church of England's Catholic life and witness.  It was established with a fund of £50,000 to provide a building for Pusey's library, purchase it and create an endowment so that two or more clergy could take charge of it and promote religious life in the university.Alden's Oxford Guide, Oxford: Alden & Co., 1958; p. 101Henry Parry Liddon described its purpose thus: \"A home of sacred learning and rallying-point for Christian faith ... It will form a centre of moral and intellectual and spiritual enthusiasm, in which all that is solid in inquiry and learning, and all that is lofty and aspiring in moral effort shall find encouragement under the consecrating shadow of a great name.\"--quoted in Alden (1958) The first principal was Charles Gore; Vincent Stuckey Coles was principal from 1897 to 1909. The next principal was Darwell Stone. Pusey House celebrated its 125th anniversary of foundation on 31 October 2009, with a Solemn High Mass at which the preacher was Robin Ward, Principal of St Stephen's House. Since 1981 a large part of the original Pusey House site has been occupied by St Cross College."]}, {"page": "Cheshire Cat", "response": ["The scholar David Day has proposed Lewis Carroll's cat was Edward Bouverie Pusey, Oxford professor of Hebrew and Carroll's mentor. "]}, {"page": "John Keble", "response": ["In 1830, he published his edition of Hooker's Works. In 1838, he began to edit, in conjunction with Edward Bouverie Pusey and John Henry Newman, the Library of the Fathers. A volume of Academical and Occasional Sermons appeared in 1847. Other works were a Life of Wilson, Bishop of Sodor and Man. After his death, Letters of Spiritual Counsel and 12 volumes of Parish Sermons were published."]}, {"page": "Annie Besant", "response": ["Besant began to question her own faith. She turned to leading churchmen for advice, going to see Edward Bouverie Pusey, one of the leaders of the Oxford Movement within the Church of England. When she asked him to recommend books that would answer her questions, he told her she had read too many already.Annie Besant: An Autobiography, London, 1885, chapter 5. Besant returned to Frank to make a last unsuccessful effort to repair the marriage. She finally left for London."]}, {"page": "Henry Liddon", "response": ["In 1870 Liddon had also been made Dean Ireland's Professor of the Exegesis of Holy Scripture at Oxford. The combination of the two appointments gave him extensive influence over the Church of England. With Dean Church he restored the influence of the Tractarian school, and he succeeded in popularising the opinions which, in the hands of Edward Bouverie Pusey and John Keble, had appealed to thinkers and scholars. His opposed the Church Discipline Act of 1874, and denounced the Bulgarian atrocities of 1876."]}, {"page": "James Hope-Scott", "response": ["On his return he became, with Newman, one of the foremost promoters of the Tractarian movement at Oxford and was entirely in Newman's confidence. In 1841, he published an attack on the Anglican-German Bishopric in Jerusalem, and further defended the \"value of the science of canon law, in a pamphlet.Ornsby (1884) Ch.XVIIIHope (1842) Edward Bouverie Pusey also valued Hope's advice and canvassed him in 1842 before publishing the Letter to the Archbishop of Canterbury on some Circumstances connected with the Present Crisis in the Church. Hope supported publication."]}, {"page": "Henry Edward Manning", "response": ["Newman's secession in 1845 placed Manning in a position of greater responsibility, as one of the High Church leaders, along with Edward Bouverie Pusey, John Keble and Marriott; but it was with Gladstone and James Robert Hope-Scott that he was at this time most closely associated."]}, {"page": "Nicholas Wiseman", "response": ["Wiseman visited England during 1835–1836, and delivered lectures on the principles and main doctrines of Roman Catholicism in the Sardinian Chapel, Lincoln's Inn Fields, and in the church in Moorfields.  The effect of his lectures was considerable. At Edward Bouverie Pusey's request, John Henry Newman reviewed them in the periodical British Critic during December 1836, treating them for the most part with sympathy as a triumph over popular Protestantism. To another critic, who had claimed a resemblance between Roman Catholic and pagan ceremonies, Wiseman replied admitting the likeness, and saying that it could be shown equally well to exist between Christian and non-Christian doctrines."]}, {"page": "Edward Pusey", "response": ["#REDIRECT Edward Bouverie Pusey"]}, {"page": "William Magee (archbishop of York)", "response": ["He was also a supporter of the movement for abolishing the recitation of the Athanasian Creed in the public services of the Church of England, believing, as he said, that the \"presence\" of the damnatory clauses, \"as they stand and where they stand, is a real peril to the Church and to Christianity itself\", and that those clauses \"are no essential part\" of the creed. The project was laid aside because of the hostility of a large body of the clergy, reinforced by the threat of Edward Bouverie Pusey and Canon Henry Parry Liddon to abandon their offices if it were carried."]}, {"page": "Oxford Movement", "response": ["The movement's philosophy was known as Tractarianism after its series of publications, the Tracts for the Times, published from 1833 to 1841. Tractarians were also disparagingly referred to as \"Newmanites\" (before 1845) and \"Puseyites\" (after 1845) after two prominent Tractarians, John Henry Newman and Edward Bouverie Pusey. Other well-known Tractarians included John Keble, Charles Marriott, Richard Froude, Robert Wilberforce, Isaac Williams and William Palmer. All bar Williams and Palmer were fellows of Oriel College, Oxford."]}, {"page": "Charles Wood, 2nd Viscount Halifax", "response": ["An Anglo-Catholic, Halifax became influenced by the Oxford Movement, and at the request of Edward Bouverie Pusey, became president of the English Church Union, a society dedicated to the promotion of Catholic principles and practices within the Church of England, in 1868. Along with the French priest,  he played a prominent role in the attempt to bring about dialogue between the Roman Catholic Church and the Church of England on the subject of Anglican Orders, including the Malines Conversations.  Due to disagreement from Canterbury and Westminster, no constructive dialogue ever came about, however, and the unhoped result of Halifax's actions was the condemnation of Anglican Orders as \"absolutely null and utterly void\" in the Papal Encyclical Apostolicae curae. The Archbishop of Canterbury Edward White Benson and the Archbishop of Westminster, Cardinal Herbert Vaughan, can be accused of letting this early attempt at rapprochement fall away due to the narrow-minded vision of each other's place in the English Church during that era. It might also be argued that Pope Leo XIII was led astray by Vaughan and like-minded Roman Catholic scholars who viewed the Church of England as a state church with no real theological authority. Benson, like most Anglican clergy in the power structure viewed any Roman Catholic involvement in England as the \"Italian Mission\", with not even a toehold worth acknowledging in English Society."]}, {"page": "High church", "response": ["Until the early 19th century the term high churchmen was used for those who emphasized the link between church and state, the monarchy and the liturgy of the 1662 Prayer Book. The 19th-century Oxford Movement within the Church of England began as a high church movement, following a call to action to save the Church of England, whose position, while emancipation of Roman Catholics and other changes in the English body politic, was perceived as being in danger. High churchmen resisted the erosion of the Church of England's traditionally privileged and legally entrenched role in English society. Over time several of the leading lights of the Oxford Movement became Roman Catholics, following the path of John Henry Newman, one of the fathers of the Oxford Movement and, for a time, a high churchman himself. A lifelong High Churchman, the Reverend Edward Bouverie Pusey remained the spiritual father of the Oxford Movement who remained a priest in the Church of England. To a lesser extent, looking back from the 19th century, the term high church also came to be associated with the beliefs of the Caroline divines and with the pietistic emphases of the period, practised by the Little Gidding community, such as fasting and lengthy preparations before receiving the Eucharist. After the Restoration, the term high church became associated with those who took the view that the Church of England forever ought to be specially protected against all other Christian beliefs, which it termed sectarian. "]}, {"page": "All Saints, Margaret Street", "response": ["William Butterfield was selected as the architect and the site in Margaret Street purchased for £14,500. The last service at the old chapel was held on Easter Monday, 1850, and the foundation stone of the new building was laid on All Saints' Day of that year by Edward Bouverie Pusey. Services were held in a temporary chapel in Titchfield Street for the next nine years, until the new church was finally consecrated on 28 May 1859. The total cost of the church, including the site and endowments was around £70,000; several large individual donations helped to fund it."]}, {"page": "Cilice", "response": ["Some high church Anglicans, including Edward Bouverie Pusey, wore hairshirts as a part of their spirituality."]}, {"page": "Ritualism in the Church of England", "response": ["The leaders of the first generation of the Anglo-Catholic revival or Oxford Movement (e.g. Newman, Edward Bouverie Pusey, and John Keble) had been primarily concerned with theological and ecclesiological questions and had little concern with questions of ritual. They championed the view that the fundamental identity of the Church of England was Catholic rather than Protestant.  They had argued that Anglicans were bound by obedience to the use of the Book of Common Prayer. \"Tract 3\" of the Tracts for the Times series had strenuously argued against any revision of the Book of Common Prayer, viewing its use as a matter of absolute obligation. Even Tract 90, which analysed the 39 Articles, was more concerned with the theological dimension of the issue. It gave little attention to the question of altering current liturgical practice in the Church of England."]}, {"page": "Alexander Forbes (bishop of Brechin)", "response": ["He was at Oxford during the early years of the movement known as Tractarianism, and was powerfully influenced by association with John Henry Newman, Edward Bouverie Pusey and John Keble. This led him to resign his Indian appointment. In 1844 he was ordained deacon and priest in the Church of England, and held curacies at Aston Rowant and St Thomas's, Oxford; but being naturally attracted to the Episcopal Church of his native land, then recovering from long depression, he removed in 1846 to Stonehaven, the chief town of Kincardineshire. The same year, however, he was appointed to the vicarage of St Saviour Church, Richmond Hill, Leeds, a church founded to preach and illustrate Tractarian principles."]}, {"page": "Elizabeth Charles", "response": ["Charles's best known book, written to order for an editor who wished for a story about Martin Luther, The Chronicles of the Schönberg-Cotta Family, was published in 1862, and was translated into most of the European languages, into Arabic, and into many Indian dialects. Mrs Charles wrote in all over fifty books, the majority of a semi-religious character, as well as writing and translating a number of hymns. She took an active part in the work of various charitable institutions, and among her friends and correspondents were Dean Stanley, Archbishop Tait, Charles Kingsley, William Booth, Benjamin Jowett and Edward Bouverie Pusey."]}, {"page": "George Denison (priest)", "response": ["On 7 August and 6 November 1853, he preached two sermons in Wells Cathedral on the real presence of Christ in the Eucharist, taking a position similar to that for which Edward Bouverie Pusey had been suspended ten years before. He resigned his position as examining chaplain to the Bishop of Bath and Wells owing to his pronounced eucharistic views. A suit on the complaint of a neighbouring clergyman ensued and after various complications Denison was condemned by the archbishop's court at Bath (1856). The judgment did not pass unchallenged, and that autumn a protest was issued arguing that Denison's teaching was in conformity with the best Anglican authorities. The protest was signed by fifteen of the most prominent Anglo-Catholics of the time, including Pusey, John Keble, and J. M. Neale."]}, {"page": "E. B. Pusey", "response": ["#REDIRECT Edward Bouverie Pusey"]}, {"page": "Caroline Fry", "response": ["Fry can rightfully be considered a church theologian, a writer, a poet and a Christian educator—someone who wrote from a staunch Reformed perspective on a variety of theological issues.  In her book, The Listener in Oxford she describes herself as someone predestined to arrive \"at the very birth-time\" of conflict.  Her anguish was due to the major theological differences creating strife between the newly formed Tractarian movement led by John Henry Newman, John Keble and Edward Bouverie Pusey and the existing parties of the Church of England. Her description of the Oxford lectures give readers a unique insight as to what impact the Anglo-Catholic movement was having upon the Church during a difficult time of transition, especially in her book entitled, The Table of the Lord, addressing divisive issues held by opposing parties in regard to the theology of the sacraments."]}, {"page": "W. J. E. Bennett", "response": ["William James Early Bennett (1804 – 1886) was an Anglican priest. Bennett is celebrated for having provoked the decision that the doctrine of the Real Presence is a dogma not inconsistent with the creed of the Church of England. This followed the publication of his pamphlet A Plea for Toleration in the Church of England (1867) in the form of a letter to Edward Bouverie Pusey."]}, {"page": "Richard William Jelf", "response": ["He was the second son of Sir James Jelf, of Gloucester, and brother of William Edward Jelf. He was educated at Eton, where he began a lifelong friendship with Edward Bouverie Pusey, and in December 1816 matriculated at Christ Church, Oxford, where he graduated B.A. (with a second class in classics) in 1820, and M.A. in 1823, B.D. 1831, D.D. 1839."]}]}}