{"wiki_id": "http://www.wikidata.org/entity/Q725567", "itemLabel": "Rob Terry", "itemDescription": "Welsh professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Terry", "wikipedia_page": {"main": "Robert Terry (born 30 April 1980) is a Welsh professional wrestler and bodybuilder. He is known for his work in  Total Nonstop Action Wrestling (TNA) under the ring names Rob Terry and The Freak.He is also known for his work in TNA's developmental territory Ohio Valley Wrestling (OVW), where he is a former two-time Heavyweight Champion and a one-time Southern Tag Team and Television Champion. He has also competed for the Wrestle-1 promotion as well as WWE's developmental territory, Florida Championship Wrestling.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Rob Terry (born 1980)"]}, {"page": "René Duprée", "response": ["While still officially the Gaora TV Champion, Duprée made a surprise appearance at the AJPW splinter promotion Wrestle-1's inaugural event on September 8, 2013, teaming with Zodiac in a main event tag team match, where the two were defeated by Bob Sapp and Keiji Mutoh. Three days later, after Duprée had been announced for all future Wrestle-1 events, he returned the Gaora TV Championship to AJPW. During the October tour, Duprée joined Masayuki Kono's Desperado stable. On March 2, 2014, Dupree took part in the big Kaisen: Outbreak event, teaming with Desperado member Masayuki Kono and Samoa Joe losing to Rob Terry, Keiji Mutoh and Taiyō Kea in a six-man tag team match. On March 15, Duprée competed in a battle royal to determine the number one contender for the TNA X Division Championship, which was won by Seiki Yoshioka."]}, {"page": "Kurt Angle", "response": ["At Bound for Glory, Angle was defeated by Hardy, when he turned heel and pinned Anderson after an interference from Hulk Hogan and Eric Bischoff, who then went on to form an alliance named Immortal, with Hardy, Abyss and Jeff Jarrett. On the following episode of Impact! Angle came out to make his retirement speech, after his failed attempt to win the TNA World Heavyweight Championship, but was interrupted by Jarrett, who announced that he had made a deal with Hogan and Bischoff in order to end Angle's career at Bound for Glory, before attacking him, when he was restrained by TNA's security officers Gunner and Murphy. The following week Angle returned, trying to get his hands on Bischoff and Ric Flair, before being stopped by TNA's security officers. Angle returned three weeks later on the November 11 episode of Impact!, saving Samoa Joe from Jeff Jarrett, Gunner and Murphy. After not appearing again for two weeks, Angle made another return on the December 2 episode of Impact!, saving Samoa Joe from Jeff Jarrett and Abyss. On the January 6, 2011 episode of Impact! Angle interrupted Jarrett's $100,000 Mixed Martial Arts Challenge and signed a contract to face him at Genesis in an MMA exhibition match, since he had promised not to wrestle again. The match was thrown out in the third round after Jarrett blinded Angle. After the match Jarrett bloodied Angle, before announcing that he was ending his mixed martial arts career and promised that his wife, Karen Jarrett (formerly Karen Angle), would join the retirement party. On the January 13 episode of Impact! Karen made her return and stopped Angle just as he was about to attack Jeff, telling him that she would not allow him to ruin their personal lives and promised to tell all about their divorce the following week. The following week Karen slapped Kurt, providing a distraction which allowed Jeff to beat him down. At the end of the show Crimson saved Angle from a beating at the hands of Immortal and Fortune. The following week Ric Flair reinstated Angle in order to place him and Crimson in a seven–on–two handicap match against Jarrett, James Storm, Robert Roode, Kazarian, Rob Terry, Gunner and Murphy. The match ended with Jarrett pinning Angle for the win. Afterwards, Angle was saved from another beatdown by the returning Scott Steiner. The following week Fortune turned on Immortal and aligned themselves with Angle, Crimson and Steiner. On February 13 at Against All Odds Jarrett defeated Angle in a singles match and as a result Angle was forced to walk Karen down the aisle, when she and Jarrett renewed their wedding vows on the March 3 episode of Impact!. After the match Angle hinted at a possible retirement by leaving his wrestling boots in the ring. On March 3, Angle proceeded to destroy the wedding set with an axe and forced wedding guest, New York Jet Bart Scott to submit with the ankle lock. On April 17 at Lockdown, Jarrett defeated Angle in an \"Ultra Male Rules\" two out of three falls steel cage match, with help from Karen. On the May 12 episode of Impact Wrestling, Angle revealed Chyna as his backup in taking care of the Jarretts. At Sacrifice, Angle and Chyna defeated the Jarretts in a mixed tag team match. Later that same month, Angle signed a new three-year contract with TNA. With Karen out of the picture, Angle defeated Jarrett on June 12 at Slammiversary IX in what was billed as the \"final battle\" between the two to retain his Olympic gold medal and become the number one contender for the TNA World Heavyweight Championship. However, on the following episode of Impact Wrestling, Jarrett challenged Angle to a Parking Lot Brawl and agreed to sign a contract that would force him to move to Mexico without Angle's children, should he lose the match. Angle ended up winning the fight after choking Jarrett with a shirt, forcing him to say \"adiós\"."]}, {"page": "Scott Steiner", "response": ["On the January 27, 2011 episode of Impact! (taped January 12), Steiner returned to TNA as a face, saving Kurt Angle, Matt Morgan, and Crimson from Fortune and Immortal. The next week, Fortune turned on Immortal and aligned themselves with Steiner, Angle and Crimson. On February 13, at Against All Odds, Steiner, James Storm and Robert Roode defeated Immortal members Rob Terry, Gunner and Murphy in a six-man tag match. Steiner pinned Gunner after the Frankensteiner. Steiner then began feuding with Rob Terry after Terry attacked him on the February 24 Impact!, during a \"posedown\" between the two. The following week, Steiner defeated Terry in a singles match."]}, {"page": "The Dudley Boyz", "response": ["Team 3D turned fan favorite when they joined the TNA Frontline after appearing to join Kurt Angle's Main Event Mafia, double crossing them and jumping them along with Frontline leaders Samoa Joe, A.J. Styles and Rhino.  They also attempted to put Angle through a table. At Final Resolution in December, Team 3D along with Styles and Joe lost to the Main Event Mafia in an eight-man tag team match. After Against All Odds 2009 Team 3D began a feud with Beer Money, Inc. (James Storm and Robert Roode) over the TNA World Tag Team Championship. They faced each other in an Off the wagon challenge match (where if 3D lost then the person who lost is kayfabe fired). Beer Money lost by countout. On April 19, 2009, at Lockdown, IWGP Tag Team Champions Team 3D defeated Beer Money, Inc. to win the TNA World Tag Team Championships in a match where both titles were on the line. This made Team 3D World Tag Team Champions for the 22nd time. On June 21, 2009, at  Slammiversary, Beer Money, Inc. defeated Team 3D to become three-time TNA World Tag Team Champions after outside interference from The British Invasion of Brutus Magnus, Doug Williams and Rob Terry. Soon after, 3D then reignited their feud with the Main Event Mafia from late 2008 by becoming number 1 contenders to face Booker T and Scott Steiner for the TNA Tag Team Championships. After a failed attempt at the titles, they started a long feud with The British Invasion and other members of World Elite. Team 3D was attacked by World Elite on multiple occasions, until Beer Money Inc. intervened, leading to a loose partnership between the two teams."]}, {"page": "Doug Williams (wrestler)", "response": ["Williams re-appeared on TNA television on 30 April 2009, episode of Impact!, as a member of The British Invasion faction, along with Brutus Magnus and Rob Terry. The British Invasion got to the final of the Team 3D Invitational Tag Team Tournament but lost to Beer Money, Inc. (James Storm and Robert Roode) at Sacrifice. In the dark match of Slammiversary, the British Invasion defeated Rhino and Eric Young. Later that evening, they interfered in the TNA World Tag Title match. At Victory Road, Team 3D retained their IWGP World Tag Team Titles against the British Invasion. On 25 July episode of Impact!, the British Invasion, Sheik Abdul Bashir and Kiyoshi defeated the TNA Originals after Eric Young turned on his team. After the match, Young, the British Invasion, Bashir and Kiyoshi formed World Elite. On 30 July episode of Impact!, Williams and Magnus won the IWGP Tag Team Championship by defeating Team 3D in a Tables Match. However, New Japan Pro-Wrestling would state that they still recognised Team 3D as the official champions since TNA did not have proper sanction to make the title change. On 10 August 2009, NJPW formally recognised the title switch. At Bound for Glory the British Invasion lost the IWGP Tag Team Titles back to Team 3D, but managed to win the TNA World Tag Team Titles in a four way Full Metal Mayhem Tag Team match against Booker T and Scott Steiner, Team 3D and Beer Money. The following month at Turning Point Williams and Magnus successfully defended the titles in a three-way match against Beer Money and The Motor City Machineguns (Alex Shelley and Chris Sabin). At Final Resolution they were once again able to retain their titles in a match against Shelley and Sabin. At Genesis the British Invasion lost the TNA World Tag Team Titles to Matt Morgan and Hernandez.", "On 28 January episode of Impact! Williams cashed in Rob Terry's \"Feast or Fired\" briefcase and used it to defeat Amazing Red for the TNA X Division Championship. Two days later Williams competed in his first Ultimate X match at a house show in London, successfully defending his new title against Daniels, Suicide, Amazing Red and Chris Sabin. On 18 February episode of Impact! Rob Terry grew tired of his stable mates' abuse and attacked Magnus, thus completing his face turn. At Destination X Williams successfully defended the TNA X Division Championship against Shannon Moore after hitting him with a brick and afterwards cut a promo, where he claimed to hate the current X Division, full of acrobats calling themselves wrestlers, before announcing that he was going to re-establish the division as a place for pure catch-as-catch-can wrestlers like himself. The British Invasion quietly disbanded after Magnus was taken off television following the event. On 5 April episode of Impact! Williams began using the ring name Douglas Williams. At Lockdown Williams was scheduled to defend his title in a three-way Steel Cage match against both Kazarian and Moore, but was forced to miss the event due to being unable to fly out of England after the country's airspace was closed following a volcano eruption in Iceland. At the event TNA announced that as a result of missing the show, Williams was stripped of the TNA X Division Championship. After missing two more weeks of Impact!, Williams returned on 3 May episode of Impact! and refused to hand the Championship belt over to the new champion, Kazarian, and claimed that he had to beat him for it at Sacrifice, to get it. Two weeks later at Sacrifice Williams defeated Kazarian to regain the TNA X Division Championship. The following month at Slammiversary VIII Williams successfully defended his TNA X Division Championship against Brian Kendrick, using a high flying manoeuvre, a tornado DDT, despite his previous anti–high flying statements.", "On 31 March episode of Impact!, Williams turned heel and reformed the British Invasion with Magnus by attacking the team of Eric Young and Orlando Jordan. In their first match back together, Williams and Magnus were defeated by Ink Inc. (Jesse Neal and Shannon Moore) on 12 April episode of Xplosion. On 17 April at Lockdown, Williams and Magnus were defeated again by Ink Inc. in a four tag team number one contenders' Steel Cage match. Despite not having won a single match since their reformation, it was announced on 2 June episode of Impact Wrestling that the British Invasion would receive a shot at the TNA World Tag Team Championship at Slammiversary IX. At the pay-per-view, Williams and Magnus were unsuccessful in their challenge for the title, losing to the team of James Storm and Alex Shelley, who filled in for Robert Roode, who was sidelined with a storyline injury. On 30 June episode of Impact Wrestling, Williams and Magnus turned face by responding to Mexican America's bad remarks by praising the United States. They were then attacked until Rob Terry returned to save them, effectively adding him back to the group. On 14 July episode of Impact Wrestling, Mexican America's Anarquia and Hernandez defeated Williams and Magnus in a TNA World Tag Team Championship number one contender's match, following outside interference from their stablemate Rosita. In December, Magnus formed a new tag team with Samoa Joe, which eventually led to the dissolution of the British Invasion.", "During the summer of 2012, Williams began working as a trainer in TNA's developmental territory Ohio Valley Wrestling (OVW). In September, Williams also began making appearances for OVW's weekly television program. Despite his new job in OVW, Williams also continued making appearances for TNA, unsuccessfully challenging Zema Ion for the TNA X Division Championship on 4 October episode of Impact Wrestling. On 30 January 2013, Williams defeated Rob Terry to win the OVW Heavyweight Championship for the first time. He held the title until 10 April, when he lost it to Jamin Olivencia. On 5 June 2013, Durdle confirmed that he had been released from his TNA Wrestling contract, which also ended his run with OVW.", "1Forcibly given to him by teammate Rob Terry."]}, {"page": "Rob Conway", "response": ["On September 9, 2016, The Iron Empire were defeated by The Heatseekers (Elliot Russell and Sigmon) losing the NWA World Tag Team Championships. The next day, on September 10, 2016, The Iron Empire regained to championship to become two time NWA World Tag Team Champions defeating The Heatseekers. They lost the title to Kazushi Miyamoto and Rob Terry in Tokyo, Japan on February 23, 2017. On May 12, 2017, Rob Conway defeated Josh Lewis (wrestler) to win his first NWA United States Championship in Hanover, Indiana at NWA Supreme Rebelution 2017.  On May 27, 2017 Rob would lose the United States title to Josh Lewis in Madison Indiana."]}]}}