{"wiki_id": "http://www.wikidata.org/entity/Q725412", "itemLabel": "Lee Evans", "itemDescription": "English stand-up comedian and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Evans_(comedian)", "wikipedia_page": {"main": "Lee John Martin Evans (born 25 February 1964) is a retired English stand-up comedian, actor, musician, singer, and writer. He co-founded the production company Little Mo Films with Addison Cresswell, who was also his agent prior to Cresswell's death in December 2013.Evans became one of the United Kingdom's most popular stand-up comedians, with his Roadrunner tour grossing £12.9 million. He made his cinema debut with the Jerry Lewis comedy Funny Bones (1995), earning the Paris Film Festival Award for Best Actor, and went on to appear in the Hollywood films The Fifth Element (1997), Mouse Hunt (1997), There's Something About Mary (1998), The Ladies Man (2000), and The Medallion (2003). He lent his voice to Zippo the Troodon in the Emmy-nominated miniseries Dinotopia (2002) and made a notable departure from comedy with a leading role in the Irish thriller film Freeze Frame (2004).\nIn 2008, the DVD of Evans' Big – Live at the O2 show became the highest-selling Christmas DVD in the United Kingdom, only to be surpassed by his own Monsters Tour DVD in 2014. In November 2014, he announced his retirement. In 2017, he briefly came out of retirement to star in a run of William Shakespeare and Harold Pinter plays.", "link_mentions": [{"page": "List of comedians", "response": ["* Lee Evans (born 1964)"]}, {"page": "1964", "response": ["* February 25 – Lee Evans, British comedian and actor"]}, {"page": "Bristol", "response": ["Bristol is the birthplace of 18th-century poets Robert Southey and Thomas Chatterton. Southey (born on Wine Street in 1774) and his friend, Samuel Taylor Coleridge, married the Fricker sisters from the city. William Wordsworth spent time in Bristol, where Joseph Cottle published Lyrical Ballads in 1798. Actor Cary Grant was born in Bristol, and comedians from the city include Justin Lee Collins, Lee Evans, Russell Howard and writer-comedian Stephen Merchant."]}, {"page": "List of British comedians", "response": ["*Lee Evans (born 1964)", "*Lee Evans (born 1964)"]}, {"page": "The Magic Roundabout", "response": ["In 2005, a film adaptation (also called The Magic Roundabout) was released. The movie was about Dougal, Ermintrude, Brian and Dylan going on a quest to stop Zebadee's evil twin Zeebad, who intends on creating an eternal winter. It was made using modern computer animation, and adopted the approach of the original creator, Serge Danot, of giving each character its own voice rather than using a narrator. The voices included Tom Baker, Joanna Lumley, Ian McKellen, Jim Broadbent, Kylie Minogue, Robbie Williams, Bill Nighy and Lee Evans. The film received mixed reviews, with a 60% approval rating on Rotten Tomatoes, while Total Film ranked it as the 45th worst children's movie ever made. The two-disc special edition of the UK DVD of the film features five of the original Magic Roundabout episodes on the second disc. They are all presented in the original black and white with the option of viewing them in English or in the original French."]}, {"page": "Stand-up comedy", "response": ["Lee Evans sold £7 million worth of tickets for his 2011 tour in a single day."]}, {"page": "Monster (disambiguation)", "response": ["*Monsters, a 2014 comedy video by Lee Evans"]}, {"page": "Norman Wisdom", "response": ["Wisdom's career revived in the 1990s, helped by the young comedian Lee Evans, whose act was often compared to Wisdom's work. His films for Rank were playing to new audiences via television screenings, with young fans in the United Kingdom and abroad. The high point of this new popularity was the knighthood he was awarded, for services to entertainment, in the 2000 New Year's honours list. During the ceremony, once he had received his knighthood, he walked away and again performed his trademark trip, at which the Queen smiled and laughed."]}, {"page": "2000 in film", "response": ["| The Ladies Man || Paramount Pictures / SNL Studios || Reginald Hudlin (director); Tim Meadows, Dennis McNicholas, Andrew Steele (screenplay); Tim Meadows, Karyn Parsons, Billy Dee Williams, Tiffani Thiessen, Lee Evans, Will Ferrell, Sofia Milos, Jill Talley, John Witherspoon, Ken Hudson Campbell, Rocky Carroll, Tamala Jones, Kevin McDonald, Julianne Moore, Eugene Levy, David Huband, Arnold Pinnock, Shaun Majumder, Sean Thibodeau, Mark McKinney, Chris Parnell, Susan Aceron, Boyd Banks, Reginald Hudlin || Comedy || Live action"]}, {"page": "2002 in film", "response": ["| Dinotopia || ABC / Artisan Home Entertainment / RTL Television Germany / Mat 1 Productions / Hallmark Entertainment || Marco Brambilla (director); James Gurney, Simon Moore (screenplay); Wentworth Miller, Tyron Leitso, David Thewlis, Katie Carr, Jim Carter, Alice Krige, Colin Salmon, Hannah Yelland, Lee Evans, Terry Jones, Stuart Wilson, Geraldine Chaplin, Anna Maguire || Adventure, Fantasy || Live action"]}, {"page": "2003 in film", "response": ["| The Medallion || Screen Gems / TriStar Pictures || Gordon Chan (director/screenplay); Alfred Cheung, Bennett Davlin, Paul Wheeler, Bey Logan (screenplay); Jackie Chan, Lee Evans, Claire Forlani, Julian Sands, John Rhys-Davies, Anthony Wong Chau Sang, Christy Chung, Alex Bao, Johann Myers, Billy Hill, Nicholas Tse, Edison Chen, Scott Adkins, Bruce Khan, Han Guan Hua, Paul Andreovski, Nicola Berwick, Reuben Langdon, Hiro Hayama, Mark Strange, Matt Routledge, Chris Torres, Brad Allan, Jude Poyer || Martial Arts, Comedy || || Live Action", "* The Medallion, starring Jackie Chan, Lee Evans and Claire Forlani – (Hong Kong/US)"]}, {"page": "1995 in film", "response": ["| Funny Bones || Hollywood Pictures || Peter Chelsom (director/screenplay); Peter Flannery (screenplay); Oliver Platt, Jerry Lewis, Lee Evans, Leslie Caron, Richard Griffiths, Sadie Corré, Oliver Reed, George Carl, Freddie Davies, Ian McNeice, Christopher Greet, Ruta Lee, Harold Nicholas, Peter Gunn || Comedy, Drama || Live action", "*Funny Bones, starring Oliver Platt, Lee Evans, Leslie Caron, Jerry Lewis"]}, {"page": "1997 in film", "response": ["| The Fifth Element || Columbia Pictures || Luc Besson (director/screenplay); Robert Mark Kamen (screenplay); Bruce Willis, Gary Oldman, Milla Jovovich, Ian Holm, Chris Tucker, Luke Perry, Brion James, Tommy \"Tiny\" Lister Jr., Lee Evans, Charlie Creed-Miles, Tricky, John Neville, John Bluthal, Mathieu Kassovitz, Christopher Fairbank, Kim Chan, Al Matthews, Maiwenn Le Besco || Sci-Fi, Action || Live action", "| Mouse Hunt || DreamWorks || Gore Verbinski (director); Adam Rifkin (screenplay); Nathan Lane, Lee Evans, Maury Chaykin, Christopher Walken, Vicki Lewis, Eric Christmas, Michael Jeter, Debra Christofferson, Camilla Søeberg, Ian Abercrombie, Annabelle Gurwitch, Eric Poppick, Ernie Sabella, William Hickey, Cliff Emmich || Comedy || Live action"]}, {"page": "1998 in film", "response": ["| There's Something About Mary || 20th Century Fox || Peter Farrelly, Bobby Farrelly (directors/screenplay); Ed Decter, John J. Strauss (screenplay); Cameron Diaz, Matt Dillon, Ben Stiller, Chris Elliott, Lee Evans, Lin Shaye,  Jeffrey Tambor, Markie Post, Keith David, W. Earl Brown, Sarah Silverman, Khandi Alexander, Willie Garson, Harland Williams, Richard Tyson, Rob Moran, Jonathan Richman, Steve Sweeney, Lenny Clarke, Richard Jenkins, Brett Favre || Comedy || Live action", "* There's Something About Mary, directed by the Farrelly brothers, starring Ben Stiller, Cameron Diaz, Matt Dillon, Lee Evans and Chris Elliott"]}, {"page": "1964 in film", "response": ["* February 25 - Lee Evans, English stand-up comedian and actor"]}, {"page": "Comedian", "response": ["Many comics achieve a cult following while touring famous comedy hubs such as the Just for Laughs festival in Montreal, the Edinburgh Fringe, and Melbourne Comedy Festival in Australia. Often a comic's career advances significantly when they win a notable comedy award, such as the Edinburgh Comedy Award (formerly the Perrier comedy award). Comics sometimes foray into other areas of entertainment, such as film and television, where they become more widely known; e.g., Eddie Izzard or Lee Evans.  However, a comic's stand-up success does not guarantee a film's critical or box-office success."]}, {"page": "Blackpool", "response": ["The resort is featured in the 1934 film Sing as We Go, starring Gracie Fields, as well as other cinema and TV productions, including Forbidden (1949), Hindle Wakes (1952), Holiday (1957), Coasting (1990), Funny Bones (1995) starring Lee Evans and Oliver Platt and directed by St. Annes born Peter Chelsom, and The Parole Officer (2001) starring Steve Coogan."]}, {"page": "There's Something About Mary", "response": ["There's Something About Mary is a 1998 American romantic comedy film directed by Peter Farrelly and Bobby Farrelly. It stars Cameron Diaz as the title character with Ben Stiller, Matt Dillon, Lee Evans and Chris Elliott all playing men who are in love with Mary, and vying for her affections. ", "* Lee Evans as Tucker/Norm Phipps"]}, {"page": "The Dumb Waiter", "response": ["In 2007 a revival at the Trafalgar Studios was directed by Harry Burton, with Jason Isaacs as Ben and Lee Evans as Gus."]}, {"page": "The Secret Policeman's Ball", "response": ["In early 1991, Amnesty held a comedy gala at the Duke of York's Theatre in London to commemorate its 30th anniversary. The event was the first Amnesty comedy show since 1979 which did not use the Secret Policeman's title. The performers were primarily alternative comedians including: Tony Slattery, Lee Evans, Simon Fanshawe, Martin Soan, Eddie Izzard and Richard Vranch. The show was videotaped and televised by Granada TV in August 1991."]}, {"page": "Billericay", "response": ["* Lee Evans, comedian, went to school and lives in Billericay"]}, {"page": "Alternative comedy", "response": ["Just about every major British stand-up comedian in the last thirty years started their career in alternative comedy clubs, including Ben Elton, Jo Brand, Jack Dee, Lee Evans, Eddie Izzard, Harry Hill, Peter Kay, Jimmy Carr, and Ross Noble."]}, {"page": "Paul Jackson (producer)", "response": ["Jackson was a member of the council of IPPA, a forerunner of Pact, the body which established terms for trade between independent producers and the BBC and other broadcasters. PJP was eventually taken over by Noel Gay Television, a company chaired by the British entertainment executive, Bill Cotton. Jackson served as the Managing Director and the company produced Red Dwarf, the long-running and internationally successful comedy series, the pilot episode of Bottom (Rik Mayall and Adrian Edmonson) and, working with LWT, the hugely influential Channel Four variety show, Saturday Live. Saturday Live featured such comedy stars as Lenny Henry, Pamela Stephenson, Michael Barrymore, Peter Cook and Barry Humphries and brought to prominence talents such as Ben Elton (as a performer), Fry and Laurie, Harry Enfield and Julian Clary. The company also held the contract to provide all entertainment programming for the short lived UK satellite service, British Satellite Broadcasting and produced shows featuring then unknown names such as Armando Ianucci, Steve Coogan, Lee Evans and Jack Dee, as well as The Happening, a precursor to the long-running BBC show Later... with Jools Holland. In 1988 Jackson also co-produced the Oscar-winning short film, The Appointments of Dennis Jennings, starring Steven Wright and Rowan Atkinson."]}, {"page": "Jason Isaacs", "response": ["Between 2 February and 24 March 2007, Isaacs played Ben, opposite Lee Evans (Gus), in the critically acclaimed 50th-anniversary production of Harold Pinter's The Dumb Waiter, at Trafalgar Studios, in London, his first theatre performance since appearing in The Force of Change (2000)."]}, {"page": "Endgame (play)", "response": ["In 2004, a production with Michael Gambon as Hamm and Lee Evans as Clov was staged at London's Albery Theatre, directed by Matthew Warchus."]}, {"page": "Manchester Arena", "response": ["The first stand-up comedy performance was Peter Kay's final performance of his Mum wants a bungalow Tour in July 2003. He worked at the arena when it opened in 1995 and the performance was filmed for DVD release as Peter Kay at the Manchester Arena. In 2005, Lee Evans set a world record for performing to the biggest audience in front of a crowd of 10,108. Peter Kay's The Tour That Doesn't Tour Tour...Now On Tour ran for 20 consecutive nights and 20 nights at the end of the tour – a record for the venue. Alan Carr filmed the DVD for Spexy Beast in Manchester."]}, {"page": "Wembley Arena", "response": ["Tina Turner is the female artist with the most shows, with 25 and with 5 at Wembley Stadium (three in 1996 and two in 2000) Cliff Richard is the male artist with the most number of shows with 61, whereas Status Quo hold the record for a rock band with 45 performances. Irish band Westlife are the pop band with most shows with 28, and comedian Lee Evans 23 performances."]}, {"page": "Noël Coward Theatre", "response": ["* Endgame (10 March 2004 – 1 May 2004) by Samuel Beckett, starring Lee Evans and Michael Gambon"]}, {"page": "British Comedy Awards", "response": ["* Channel 4 Award for Special Contribution to Comedy: Lee Evans"]}, {"page": "The Glee Club", "response": ["Many professional acts also opt to play secret or low-key tour warm-up shows at The Glee. Among those who've previewed largescale theatre and arena shows, and test out new material, are John Bishop, Lee Evans, Michael McIntyre, Sarah Millican and Jack Whitehall.Howard, Bronte \"Jack Whitehall Surprised Fans With A Secret Gig Last Night\" Wales Online, Cardiff, 18 January 2019. Retrieved 25 February 2019"]}, {"page": "The Medallion", "response": ["The Medallion () is a 2003 action comedy film co-written and directed by the Hong Kong film writer and director Gordon Chan in his English-language debut. It starred Jackie Chan, Lee Evans, Claire Forlani, and Julian Sands. It was much less successful than Chan's other American films such as the Rush Hour film series, Shanghai Noon and its sequel, Shanghai Knights. The film was theatrically released on 15 August 2003 in Hong Kong and 22 August 2003 in the United States by TriStar Pictures.", "Eddie Yang (Jackie Chan) is a Hong Kong police inspector co-operating with Interpol in the capture of a crime lord named AJ \"Snakehead\" Staul (Julian Sands). Snakehead procures an ancient book from a Chinese bookstore keeper, which tells the story of a boy being chosen every thousand years to bind the two halves of a legendary medallion. In Hong Kong, Eddie and Interpol agent Arthur Watson (Lee Evans) lead a raid to capture Snakehead and his men, who are about to kidnap the boy, named Jai (Alex Bao). Eddie and the agents fight off Snakehead's men, infiltrating the temple containing Jai. The agents save Jai, but Snakehead eludes them. Two weeks later, Snakehead captures Jai aboard a cargo boat in Hong Kong. Eddie and a team of Hong Kong police engage and defeat several of Snakehead's men, but Snakehead escapes with Jai to Dublin, Ireland.", "* Lee Evans as Interpol Inspector Arthur Watson "]}, {"page": "Jessie Wallace", "response": ["During her break from EastEnders, Wallace made television guest appearances, including once as Kat Slater, in the 2005 French & Saunders Christmas special. On 17 February 2006, Wallace was the guest host of an edition of the Channel 4 programme The Friday Night Project. In 2007, she appeared in the one-off BBC One television dramas A Class Apart opposite Nathaniel Parker, and The Dinner Party with Lee Evans and Alison Steadman. After visiting Hat Trick Productions with her agent, and singing an impromptu version of Marie Lloyd's song \"The Boy I Love is Up in the Gallery\", she was offered the lead role in Miss Marie Lloyd – Queen of The Music Hall for BBC Four."]}, {"page": "Sheila Hancock", "response": ["In 2013, Hancock starred alongside Lee Evans and Keeley Hawes in the comedy Barking in Essex at Wyndham's Theatre."]}, {"page": "Opportunity Knocks (British TV series)", "response": ["Entertainers who appeared included Freddie Starr and the Delmonts, Su Pollard, Paul Daniels, Darren Day, Pete the Plate Spinning Dog, Los Caracas, later to become Middle of the Road,  Mary Hopkin, Bonnie Langford, Les Dawson, Maureen Myers, Barry Cummings, Royston Vasey (later to find fame as Roy 'Chubby' Brown), Little and Large, Bobby Crush,  Berni Flint, Tony Holland (The Muscle Man), Millican & Nesbitt, Neil Reid, Peters and Lee, Lena Zavaroni, Frank Carson, Max Boyce, Pam Ayres, Juniper Green, Gerry Monroe, Debra Stephenson, Tammy Jones, Paper Lace, Barry and Paul Elliott and Tony Monopoly. Several winners of Opportunity Knocks (notably Tammy Jones, Champagne, Tony Monopoly) later attempted to represent the UK at the Eurovision Song Contest, taking part in the A Song for Europe competition. Lee Evans appeared in 1986 but was rejected and did not make it past the initial audition. Kaz Hawkins appeared in the 1980s' revival as a child."]}, {"page": "Blue Nun", "response": ["In the television series So What Now?, Lee Evans mentions that he will bring a bottle of Blue Nun to gain access to a party."]}, {"page": "Sean Lock", "response": ["Lock frequently appeared on stage, television and radio. His routines were often surreal and delivered in a deadpan style. He also wrote material for Bill Bailey, Lee Evans and Mark Lamarr. Lock was voted the 55th-greatest stand-up comic on Channel 4's 100 Greatest Stand-Ups in 2007, and was ranked 19th in the updated 2010 list. He was a frequent guest on other panel shows including BBC's Have I Got News for You, QI and They Think It's All Over.", "In 1995, Lock played an escaped murderer in an episode of The World of Lee Evans, alongside Lee Evans and Phil Daniels. Lock wrote the screenplay for Andrew Kötting's 2001 feature film This Filthy Earth, based on the novel La Terre by Émile Zola. In 2004, Lock had a guest appearance in television's first ever \"dope opera\", Top Buzzer, written by Johnny Vaughan.", "|The World of Lee Evans"]}, {"page": "Sheffield Arena", "response": ["The arena is a regular venue for some of the world's best known Comedians such as Russell Brand, Lee Evans, Jack Whitehall, Eddie Izzard and Peter Kay who in 2011 played the arena for 5 nights running with all shows selling out within hours of going on sale. In June 2018 Michael McInytyre broke the venue's record attendance for a seated comedy show when his Big World Tour played the FlyDSA Arena on Saturday 23 June 2018 in front of 12,347 fans"]}, {"page": "The Big Fat Quiz of the Year", "response": ["Guest questions were provided by Cee Lo Green, Michael Sheen, Tulisa, Lee Evans, Muppet drummer Animal, Rastamouse, Downton Abbey star Jim Carter, Lenny Kravitz, and Professor Brian Cox. The children of Mitchell Brook Primary School acted out the arrival of Larry the Cat at 10 Downing Street and Cheryl Cole's firing from The X Factor, and Jon Snow gave his news reports on Rebecca Black's \"Friday\" and Jessie J's \"Price Tag\". \"Supergran\" Ann Timson, who was seen in a February 2011 viral video fending off four burglars with just her handbag, appeared as a mystery guest. The Only Way Is Essex cast members Lydia Rose Bright, Lauren Goodger, and Kirk Norcross appeared to present a question about the show."]}, {"page": "Angry Kid", "response": ["* Mike Cooper / Kevin Eldon / Lee Evans as Speccy, Angry Kid's nerdy \"best friend\". Speccy is allergic to nuts (as revealed in \"Swollen\"), and when Angry Kid shoved a handful down his throat, he became severely disfigured, and he was then rushed to hospital by Dad. Speccy is always picked on by Angry Kid, who is cruel to him (e.g. making Speccy do his homework for him or not letting him watch movies with him). In Who Do I Think I Am?, it is revealed that Speccy's real name is Myles."]}, {"page": "Pat Butcher", "response": ["The character of Pat has been spoofed in the cartoon sketch series 2DTV. The impressionist who provides the voice is Jan Ravens, who has not only provided the voice of Pat, but also acted the part on-screen in several episodes of the BBC's Big Impression, which devoted a regular sketch to various EastEnders characters, and she also played Pat in the other impressionist series Dead Ringers. The Impressions Show with Culshaw and Stephenson also contains sketches where impressionist Debra Stephenson portrays Pat in situations, often with Coronation Street character Ken Barlow, played by Jon Culshaw.  She is also the frequent target of jokes in Harry Hill's TV Burp, usually alluding to her former prostitution and alleged sexual promiscuity. Comedian Lee Evans had once used Pat as one of his jokes in his tour Live at the O2 Arena. In the first episode of Series 3 of The Inbetweeners, Jay gets his ears pierced with large round earrings and is mocked by his friend Simon Cooper, who calls it the ‘Pat Butcher look’. The character Pat Butcher portrayed by Jim Howick in the BBC sitcom Ghosts is named for the Eastenders character."]}, {"page": "Clive Exton", "response": ["Barking in Essex made its West End début in September 2013 and starred Lee Evans, Sheila Hancock and Keeley Hawes."]}, {"page": "Hattie Hayridge", "response": ["Hayridge was a part of the late-1980s/early-'90s wave of alternative comedians on the British comedy circuit, appearing alongside Lee Evans, Jack Dee, Julian Clary, Paul Merton, amongst others. Julian Hall of The Independent later commented in August 2007, \"Boom there it is, the deceptive and surprising edge for which she is renowned and applauded by so many of her fellow-comics.\""]}, {"page": "Lee Evans", "response": ["Lee Evans may refer to:", "* Lee Evans (American football) (born 1981), American football player", "* Lee Evans (darts player) (born 1988), British dart player", "* Lee Evans (footballer) (born 1994), Welsh association football player", "* Lee Evans (sprinter) (1947–2021), American sprinter", "* Lee Evans (comedian) (born 1964), English retired comedian and actor", "* Lee Evans (politician) (born 1961), Australian politician"]}, {"page": "Sophie Thompson", "response": ["Thompson starred alongside popular British comedians Alan Davies, in Jonathan Creek, and Lee Evans in So What Now? She has also appeared in Persuasion, Midsomer Murders, The Case-Book of Sherlock Holmes , A Harlot's Progress, and the TV movie Magnolia. She played Miss Bartlett in Andrew Davies' 2007 adaptation of E.M. Forster's A Room with a View and also appeared in the last episode of series 4 of Doc Martin."]}, {"page": "Mouse Hunt", "response": ["Mouse Hunt is a 1997 American black/slapstick film written by Adam Rifkin and directed by Gore Verbinski in his directorial debut. It stars Nathan Lane and Lee Evans, Maury Chaykin, and Christopher Walken. The film follows two Laurel and Hardy-like brothers in their struggle against one small but crafty house mouse for possession of a mansion which was willed to them by their father. While the film is set in the late 20th century, styles range humorously from the 1940s to the 1990s. It was the first family film to be released by DreamWorks Pictures, who released it in the United States on December 19, 1997.", "* Lee Evans as Lars Smuntz, the heir to a string factory."]}, {"page": "Lee Latchford-Evans", "response": ["From Ellesmere Port, Evans was born as Lee Latchford Evans, with his middle name Latchford taken from footballer Bob Latchford of Everton F.C., as his father was a lifelong fan of the club. He began using his middle name professionally to differentiate himself from well-known comedian Lee Evans. For a time he was known as Lee Latchford before adding a hyphen between his middle name and surname."]}, {"page": "The Magic Roundabout (film)", "response": ["| Lee Evans"]}, {"page": "Phoenix Festival", "response": ["Lee Evans", "Lee Evans"]}, {"page": "Geoffrey Hutchings", "response": ["In 1998, he played Carry On actor Sid James in the Royal National Theatre's production of Terry Johnson's stage play Cleo, Camping, Emmanuelle and Dick, a behind-the-scenes look of the love affair between Sid James and his co-star Barbara Windsor, which was subsequently made into an ITV drama called Cor, Blimey! in 2000. In 2004, he played Nagg in Samuel Beckett's Endgame at the Albery Theatre alongside Sir Michael Gambon, Lee Evans and Liz Smith. From October 2006 to April 2007, he played Herr Schultz in the West End production of Cabaret. His final stage role was in 2009 in the West End production of The Shawshank Redemption."]}]}}