{"wiki_id": "http://www.wikidata.org/entity/Q725741", "itemLabel": "Daniel Dunglas Home", "itemDescription": "British medium", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Dunglas_Home", "wikipedia_page": {"main": "Daniel Dunglas Home (pronounced Hume; 20 March 1833 – 21 June 1886) was a Scottish physical medium with the reported ability to levitate to a variety of heights, speak with the dead, and to produce rapping and knocks in houses at will. His biographer Peter Lamont opines that he was one of the most famous men of his era. Harry Houdini described him as \"one of the most conspicuous and lauded of his type and generation\" and \"the forerunner of the mediums whose forte is fleecing by presuming on the credulity of the public.\" Home conducted hundreds of séances, which were attended by many eminent Victorians. There have been eyewitness accounts by séance sitters describing conjuring methods and fraud that Home may have employed.", "link_mentions": [{"page": "James Randi", "response": ["Randi stated that Daniel Dunglas Home, who could allegedly play an accordion that was locked in a cage without touching it, was caught cheating on a few occasions, but the incidents were never made public. He also stated that the actual instrument in use was a one-octave mouth organ concealed under Home's large mustache and that other one-octave mouth organs were found in Home's belongings after his death.Randi 1995, \"Home, Daniel Dunglas\" According to Randi, author William Lindsay Gresham told Randi \"around 1960\" that he had seen these mouth organs in the Home collection at the Society for Psychical Research (SPR). Eric J. Dingwall, who catalogued Home's collection on its arrival at the SPR does not record the presence of the mouth organs. According to Peter Lamont, the author of an extensive Home biography, \"It is unlikely Dingwall would have missed these or did not make them public.\"Lamont 2005, p. 302 The fraudulent medium Henry Slade also played an accordion while held with one hand under a table.Chung Ling Soo. (1898) Slate Writing and Kindred Phenomena. Munn & Company. Scientific American, New York City. pp. 105–106 Slade and Home played the same pieces. They had at one time lived near each other in the U.S. The magician Chung Ling Soo exposed how Slade had performed the trick.Chung Ling Soo. (1898). Spirit Slate Writing and Kindred Phenomena. Munn & Company. pp. 105–106. \"Dr. Henry Slade was, of course, identified and recognized as the principal slate-writing medium, but at various times he presented other phenomena, one of which was the playing of an accordion while held in one hand under the table. The accordion was taken by him from the table with his right hand, at the end containing the strap, the keys or notes at the other end being away from him. He thus held the accordion beneath the table, and his left hand was laid on top of the table, where it was always in plain view. Nevertheless, the accordion was heard to give forth melodious tunes, and at the conclusion was brought up on top of the table as held originally; the whole dodge consisting in turning the accordion end for end as it went under the table. The strap end being now downward, and held between the legs, the medium's hand grasped the keyboard end, and worked the bellows and keys, holding the accordion firmly with the legs and working the hand, not with an arm movement, but mostly by a simple wrist movement. Of course, at the conclusion, the hand grasped the accordion at the strap end, and brought it up in this condition. Sometimes an accordion is tied with strings and sealed so the bellows cannot be worked. This is for the dark séance. Even in this condition the accordion is played by inserting a tube in the air-hole or valve and by the medium's using his lungs as bellows.\""]}, {"page": "William Crookes", "response": ["Between 1871 and 1874, Crookes studied the mediums Kate Fox, Florence Cook, and Daniel Dunglas Home. After his investigation, he believed that the mediums could produce genuine paranormal phenomena and communicate with spirits.Daniel Cohen. (1971). Masters of the Occult. Dodd, Mead & Company. p. 111. Andrew Neher. (2011). Paranormal and Transcendental Experience: A Psychological Examination. Dover Publications. p. 214.  \"William Crookes, the noted English physicist, had endorsed Catherine Fox as genuine... Crookes also endorsed several other mediums who were later exposed, including Anna Eva Fay (who was exposed more than once and who eventually explained how she duped Crookes), Florence Cook (who was the subject of more than one expose), and D. D. Home.\" Psychologists Leonard Zusne and Warren H. Jones have described Crookes as gullible as he endorsed fraudulent mediums as genuine.Leonard Zusne; Warren H. Jones. (2014). Anomalistic Psychology: A Study of Magical Thinking. Psychology Press. p. 216.  \"The fact is that William Crookes, although very good at physics experiments, was rather weak on drawing inferences and on theorizing. Besides, he was gullible. He endorsed several mediums in spite of their demonstrated trickery. Having witnessed a single seance with Kate Fox, he became convinced that the Fox sisters' rappings were genuine.\""]}, {"page": "1833", "response": ["* March 20 – Daniel Dunglas Home, Scottish medium (d. 1886)"]}, {"page": "1886", "response": ["* June 21 – Daniel Dunglas Home, Scottish medium (b. 1833)"]}, {"page": "Psychic", "response": ["In the mid-nineteenth century, Modern Spiritualism became prominent in the United States and the United Kingdom. The movement's distinguishing feature was the belief that the spirits of the dead could be contacted by mediums to lend insight to the living. The movement was fueled in part by anecdotes of psychic powers. One such person believed to have extraordinary abilities was Daniel Dunglas Home, who gained fame during the Victorian period for his reported ability to levitate to various heights and speak to the dead."]}, {"page": "Robert Browning", "response": ["Browning believed spiritualism to be fraud, and proved one of Daniel Dunglas Home's most adamant critics. When Browning and his wife Elizabeth attended one of his séances on 23 July 1855,Donald Serrell Thomas. (1989). Robert Browning: A Life Within Life. Weidenfeld and Nicolson. pp. 157–158.  a spirit face materialized, which Home claimed was Browning's son who had died in infancy: Browning seized the \"materialization\" and discovered it to be Home's bare foot. To make the deception worse, Browning had never lost a son in infancy.John Casey. (2009). After Lives: A Guide to Heaven, Hell and Purgatory. Oxford. p. 373.  \"The poet attended one of Home's seances where a face was materialized, which, Home's spirit guide announced, was that of Browning's dead son Browning seized the supposed materialized head, and it turned out to be the bare foot of Home. The deception was not helped by the fact that Browning never had lost a son in infancy.\""]}, {"page": "The Exorcist (novel)", "response": ["Blatty refers to the Loudun possessions and the Louviers possessions throughout the story, mostly when Fr. Karras is researching possession and exorcism to present the case to his superiors.Pages 245-250 in the 40th Anniversary edition. He also has one of his characters tell a brief story about an unnamed fraudulent medium who had studied to be a Jesuit priest. This story can be found in Proceedings of the Society for Psychical Research, Vol. 114. 1930, in an article about fraudulent practices by Daniel Dunglas Home.Count Petrovsky-Petrovo-Solovo. \"Some Thoughts on D.D. Home.\" In Proceedings of the Society for Psychical Research, Vol. 114. 1930. Quoted in John Casey (2009), After Lives: A Guide to Heaven, Hell and Purgatory. Oxford. pp. 373-374."]}, {"page": "Pyrokinesis", "response": ["The medium Daniel Dunglas Home was known for performing fire feats and handling a heated lump of coal taken from a fire. The magician Henry R. Evans wrote that the coal handling was a juggling trick, performed by Home using a hidden piece of platinum. Hereward Carrington described Evans hypothesis as \"certainly ingenious\" but pointed out William Crookes, an experienced chemist, was present at a séance whilst Home performed the feat and would have known how to distinguish the difference between coal and platinum. Frank Podmore wrote that most of the fire feats could have easily been performed by conjuring tricks and sleight of hand but hallucination and sense-deception may have explained Crookes' claim about observing flames from Home's fingers."]}, {"page": "Colin Wilson", "response": ["By the late 1960s Wilson had become increasingly interested in metaphysical and occult themes. In 1971, he published The Occult: A History, featuring interpretations on Aleister Crowley, George Gurdjieff, Helena Blavatsky, Kabbalah, primitive magic, Franz Mesmer, Grigori Rasputin, Daniel Dunglas Home and Paracelsus, among others. He also wrote a markedly unsympathetic biography of Crowley, Aleister Crowley: The Nature of the Beast, and has written biographies on other spiritual and psychological visionaries, including Gurdjieff, Carl Jung, Wilhelm Reich, Rudolf Steiner, and P. D. Ouspensky."]}, {"page": "Charles Webster Leadbeater", "response": ["An uncle, his father's brother-in-law, was the well-known Anglican cleric William Wolfe Capes. By his uncle's influence, Leadbeater was ordained an Anglican priest in 1879 in Farnham by the Bishop of Winchester.  By 1881, he was living with his widowed mother at Bramshott in a cottage which his uncle had built, where he is listed as \"Curate of Bramshott\".1881 Census of England He was an active priest and teacher who was remembered later as \"a bright and cheerful and kindhearted man\".Warnon, Maurice H., \"Charles Webster Leadbeater, Biographical Notes\".    About this time, after reading about the séances of reputed medium Daniel Dunglas Home (1833–1886), Leadbeater developed an active interest in spiritualism."]}, {"page": "Séance", "response": ["Magicians have a long history of exposing the fraudulent methods of mediumship. Early debunkers included Chung Ling Soo,  Henry Evans and Julien Proskauer.Chung Ling Soo. (1898). Spirit Slate Writing and Kindred Phenomena. Munn & Company. Henry Evans. (1897). Hours With the Ghosts Or Nineteenth Century Witchcraft. Kessinger Publishing. Julien Proskauer. (1932). Spook crooks! Exposing the secrets of the prophet-eers who conduct our wickedest industry. New York, A. L. Burt. Later magicians to reveal fraud were Fulton Oursler, Joseph Dunninger, Joseph Rinn, and James Randi.Fulton Oursler. (1930). Spirit Mediums Exposed. New York: Macfadden Publications. Joseph Dunninger. (1935). Inside the Medium's Cabinet. New York, D. Kemp and Company. Joseph Rinn. (1950). Sixty Years Of Psychical Research: Houdini And I Among The Spiritualists. Truth Seeker. The researchers Trevor H. Hall and Gordon Stein have documented the trickery of the medium Daniel Dunglas Home.Trevor H. Hall. (1984). The Enigma of Daniel Home: Medium or Fraud?. Prometheus Books. Gordon Stein. (1993). The Sorcerer of Kings: The Case of Daniel Dunglas Home and William Crookes. Prometheus Books.  Tony Cornell exposed a number of fraudulent mediums including Rita Goold and Alec Harris.Tony Cornell. (2002). Investigating the Paranormal. Helix Press New York. pp. 400–414. "]}, {"page": "Levitation (paranormal)", "response": ["Many mediums have claimed to have levitated during séances, especially in the 19th century in Britain and America. Many have been shown to be frauds, using wires and stage magic tricks. Daniel Dunglas Home, a prolific and well-documented levitator of himself and other objects, was said by spiritualists to levitate outside of a window. Skeptics have disputed such claims. The researchers Joseph McCabe and Trevor H. Hall exposed the \"levitation\" of Home as nothing more than him moving across a connecting ledge between two iron balconies.", "*Incidents in my Life autobiography by Daniel Dunglas Home"]}]}}