{"wiki_id": "http://www.wikidata.org/entity/Q726991", "itemLabel": "Jah Shaka", "itemDescription": "Jamaican-born British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jah_Shaka", "wikipedia_page": {"main": "Jah Shaka, also known as the Zulu Warrior is a Jamaican reggae/dub sound system operator who has been operating a South East London-based, roots reggae Jamaican sound system since the early 1970s. His name is an amalgamation of the Rastafarian term for God and that of the Zulu king Shaka Zulu.\n\n", "link_mentions": [{"page": "List of Rastafarians", "response": ["*Jah Shaka, sound system operator"]}, {"page": "1980 in film", "response": ["| Babylon || Kino Lorber Repertory / Seventy-Seven / National Film Finance Corporation || Franco Rosso (director/screenplay); Martin Stellman (screenplay); Brinsley Forde, Karl Howman, Trevor Laird, T-Bone Wilson, Mel Smith, Stefan Kalipha, Mark Monero, Alan Igbon, King Sounds, Maggie Steed, Mikey Campbell, Angus Zeb, David Gant, Gary Whelan, Vilma Hollingbery, Jah Shaka, Brian Bovell, Victor Romero Evans, David N. Haynes, Archie Pool, Beverly Michaels, Beverley Dublin, Granville Garner, David Cunningham, Cosmo Laidlaw, Yvonne Agard, Donovan Platt, Anthony Trent, Patrick Worrall, Malcolm Frederick, Cynthia Powell, Ann Duncan || Drama || Live action "]}, {"page": "Dub music", "response": ["In the 1980s, the United Kingdom became a new centre for dub production with Mikey Dread, Mad Professor and Jah Shaka being the most famous. It was also the time when dub made its influence known in the work of harder edged, experimental producers such as Mikey Dread with UB40 and The Clash, Adrian Sherwood and the roster of artists on his On-U Sound label. Many bands characterized as post-punk were heavily influenced by dub. Better-known bands such as The Police, The Clash and UB40 helped popularize Dub, with UB40's Present Arms In Dub album being the first dub album to hit the UK top 40.", "Yale professor Michael Veal described dub as \"the sound of a society tearing itself apart at the seams”. His book, “Starship Africa”, says that the African diaspora is reflected in dub by the \"extensive use of reverberation/delay devices and the fragmentation of the song surface\" – he considers dub's use of reverb a \"sonic metaphor for the condition of diaspora.\" Veal wrote that dub creators used echo and reverb to elicit memories of African culture in their listeners. King Tubby, Lee Perry, Eroll Thompson, Mad Professor, Jah Shaka, Denis Bovell and Lynton Kwesi Johnson influenced rock musicians."]}, {"page": "List of reggae musicians", "response": ["*Jah Shaka"]}, {"page": "Horace Andy", "response": ["* Jah Shaka Meets Horace Andy (1994) Jah Shaka Music", "* Dub Salute 1 Featuring Horace Andy (1994) Jah Shaka Music"]}, {"page": "Aswad", "response": ["*1988: Jah Shaka Meets Aswad in Addis Ababa Studio – Jah Shaka"]}, {"page": "Twilight Circus Dub Sound System", "response": ["Moore's fascination with dub began in the early 1980s, inspired by the nexus of punk rock and dub which film maker Don Letts forged in London, along with the futuristic possibilities hinted at by cyberpunk author William Gibson in Neuromancer. Throughout the 80's he obsessively collected every dub LP he could find, which included Jamaican dub from legends like King Tubby, Prince Jammy, Lee Perry and Scientist as well as 2nd-generation figures operating from London like Adrian Sherwood, Mad Professor, and Jah Shaka. Some of his early dub experiments from the mid-80's are to be heard on the ROIR release 'Twilight Circus - Dub From The Secret Vaults'."]}, {"page": "Fuji Rock Festival", "response": [" Jah Shaka"]}, {"page": "Sound system (Jamaican)", "response": ["The culture of the Sound System was brought to the UK with the mass immigration of Jamaicans in the 1960s and 1970s. Notable UK Sound Systems include Sir Coxsone Outernational, Jah Shaka, Channel One, Aba Shanti-I, Jah Observer, Quaker City, Iration Steppas, Fatman International and Saxon Studio International. One of the first sound systems in the United States was Downbeat the Ruler, founded in Bronx, New York, in the late 1970s."]}, {"page": "List of dub artists", "response": ["*Jah Shaka"]}, {"page": "Mad Professor", "response": ["Mad Professor (born Neil Joseph Stephen Fraser, 1955, Georgetown, Guyana) is a Guyanese-born British dub music producer and engineer known for his original productions and remix work.Mad Professor Interview – Sound On Sound magazine (UK) Issue: August 2007. Retrieved 22 April 2013 He is considered one of the leading producers of dub music's second generation and was instrumental in transitioning dub into the digital age. He has collaborated with reggae artists such as Lee \"Scratch\" Perry, Sly and Robbie, Pato Banton, Jah Shaka and Horace Andy, as well as artists outside the realm of traditional reggae and dub, such as Sade, Massive Attack, The Orb, Gaudi, the Brazilian DJ Marcelinho da lua, Grace Jones, and Perry Farrell.", "*1984 – Jah Shaka Meets Mad Professor at Ariwa Sounds", "*1996 – New Decade of Dub (with Jah Shaka)"]}, {"page": "Clarendon Parish, Jamaica", "response": ["* Jah Shaka"]}, {"page": "Caribbean music in the United Kingdom", "response": ["Roots reggae was increasingly popular with the UK's black working-class youth from the 1970s onwards, its message of Rastafari and overcoming injustice striking a chord with those on the receiving end of racism and poverty. Jamaicans who had settled in the UK (and their children who had been born here) were instrumental in setting up a network of reggae soundsystems. The most popular soundsystems included Jah Shaka, Coxsone Outernational, Fatman, Jah Tubbys and Quaker City.", "As roots music's popularity waned in Jamaica in the 1980s, soundsystems such as Jah Shaka kept the faith in the UK, influencing a new generation of producers, soundsystems and artists, including The Disciples, Irration Steppas, Jah Warrior and The Rootsman. This scene has been referred to as \"UK Dub\"."]}, {"page": "Dry & Heavy", "response": ["As well as appearances at every major Japanese rock and reggae music festival, the band have enjoyed success with their own headline dates in the United Kingdom, France and Switzerland. Concert dates include the Reading and the Hanover based Womad Festivals, and guest appearances in Germany with Asian Dub Foundation and Buju Banton. They also played in Hong Kong with Primal Scream and Adrian Sherwood, and created their own Japanese dubfest, Echomaniacs. This has featured Adrian Sherwood, Andrew Weatherall, Dennis Bovell and 3 Head, and Dry & Heavy have played in concert with Lee Perry, Horace Andy, Jah Shaka and Mad Professor."]}, {"page": "Max Romeo", "response": ["Romeo visited the UK again in 1992, recording albums Fari – Captain of My Ship (1992) and Our Rights (1995) with Jah Shaka. He joined up with UK rhythm section/production team Mafia & Fluxy in 1998 for the album Selassie I Forever. A compilation album, The Many Moods of Max Romeo, was released in the UK in 1999.", "*1992: Fari – Captain of My Ship (with Jah Shaka)", "*1995: Our Rights (with Jah Shaka)"]}, {"page": "Sound clash", "response": ["Although sound clashes are perhaps most commonly associated with Jamaica, they also form an integral part of Black British culture in London, with early proponents such as Jah Shaka running sound systems and engaging in sound clashes as early as the 1970s. Franco Rosso's 1980 cult movie Babylon offered a look into London's sound system and sound clash culture, focusing on the Deptford and Brixton areas in particular."]}, {"page": "Overlord X", "response": ["* Come And Get Me (as B. Balogun) with Jah Shaka / Raggafunk (Mango, 1990 )"]}, {"page": "The Disciples (band)", "response": ["The Disciples are a dub roots reggae group that was formed in 1986 by brothers Russ D. and Lol Bell-Brown. They are said to be named by Jah Shaka after producing exclusively for Jah Shaka. They recorded four albums of instrumental dub for Jah Shaka's King Of The Zulu Tribe label during 1987 to 1990."]}, {"page": "Kevin Martin (British musician)", "response": ["Kevin Martin has discussed his admiration for Jah Shaka, Adrian Sherwood, King Tubby, Lee Perry, Swans, Public Enemy,   and Thomas Koner."]}, {"page": "Chapelton, Jamaica", "response": ["*Jah Shaka"]}, {"page": "Willi Williams", "response": ["*Natty with a Cause (1992, Jah Shaka)", "*See Me (1994, Jah Shaka)"]}, {"page": "Barry Brown (singer)", "response": ["Barry Brown was one of a number of singers to find success in the 1970s under record producer Bunny Lee.  After forming a short-lived group called The Aliens with Rod Taylor and Johnny Lee,Liner notes to Rod Taylor's Shining Bright album Brown went solo. Although his first release, \"Girl You're Always on My Mind\", had little impact, his vocal style soon found popularity, with his first hit single coming with 1979's \"Step It Up Youthman\", which led to an album of the same name on Paradise Records.Larkin, Colin (1998) The Virgin Encyclopedia of Reggae, Virgin Books, , p. 40 One of the most successful artists of the early dancehall era, Brown worked with some of Jamaica's top producers of the time, including Linval Thompson, Winston \"Niney The Observer\" Holness, Sugar Minott and Coxsone Dodd, as well as releasing self-produced material. He recorded for Studio One in 1983, including Far East. After releasing eleven albums between 1979 and 1984, Brown's releases became more sporadic, although his work continued to feature prominently on sound systems such as those of Jah Shaka."]}, {"page": "Twinkle Brothers", "response": ["*Dub Salute Part 5 (1996) Jah Shaka"]}, {"page": "Trinity Centre", "response": ["During the early part of this decade, the centre provided a much needed outlet for local youth culture, hosting nights of dub and reggae from the likes of Jah Shaka and Quaker City, and playing host to some of the biggest domestic and international music stars of the time, notably from the punk and new wave genres, such as U2, Crass, The Cramps, Echo and the Bunnymen, Joy Division and New Order alongside local favourites such as The Stingrays and Disorder."]}, {"page": "List of roots reggae artists", "response": ["*Jah Shaka"]}, {"page": "Reggae Geel", "response": ["* Jah Shaka", "* Jah Shaka"]}, {"page": "Shaka (disambiguation)", "response": ["* Jah Shaka, a British musician"]}, {"page": "Zion Train", "response": ["Perch said in 2016 interview that his influences were Jah Shaka, King Tubby, Ravi Shankar and Jimi Hendrix."]}, {"page": "Babylon (1980 film)", "response": ["* Jah Shaka as Himself"]}, {"page": "Prince Alla", "response": ["Born in St. Elizabeth, and raised in Greenwich Town, Kingston, Jamaica, Blake's career began in the vocal group The Leaders with Milton Henry and Roy Palmer, who recorded three tracks for producer Joe Gibbs in the late 1960s.Campbell, Howard (2015) \"Prince Alla's Second Coming\", Jamaica Observer, 3 September 2015. Retrieved 18 September 2015 When The Leaders broke up, Blake continued to work with Gibbs, who issued his debut solo release, \"Woo Oh Oh\". Blake had been interested in the Rastafari movement since he had a vision as a child, and in 1969, Blake's Rastafarian faith saw him get heavily involved in Jamaica's camp community, withdrawing from the music scene and living in Prince Emmanuel Edwards' camp at Bull Bay. He re-entered the music scene in the mid-1970s, releasing a single \"Born a Fighter\" for producer Teddy Powell, before working with Bertram Brown's Freedom Sounds, with a series of recordings, now under the name Prince Alla, that are now regarded as roots reggae classics, such as \"Sun Is Shining\", \"Bucket Bottom\", \"Lot's Wife\", and \"Stone\". He also recorded for producer Tapper Zukie, including the album Heaven Is My Roof. Continuing interest in his work saw the release of two albums of material from the 1970s on Blood & Fire records, Only Love Can Conquer and I Can Hear The Children Singing, which brought his work to a new audience. Alla continued to release records occasionally through the 1980s and 1990s, including an album with Jah Shaka. Alla has continued to be in demand with digital roots producers, and has released several albums with the  likes of Jah Warrior. Since 2010 Prince Alla is touring the world with Rockers Agency and stays in popular demand for live performances across the globe.", "*Jah Children Gather Round (1996), Jah Shaka"]}, {"page": "Jah Warrior", "response": ["Mosco first got interested in reggae as a teenager in Manchester. He started attending sound system events in Moss Side and Hulme, before travelling further afield, experiencing the likes of Jah Shaka.  In 1981 he moved to London and was invited by Tim Westwood to do a reggae show on a pirate station called LWR. He also worked as a selector on the Humble Lion sound system, which in 1987 was renamed Jah Warrior. In 1990 he put out an album called Warrior Dub under the name Zulu Warriors. In 1995 he started the Jah Warrior record label, the first release being \"The 22nd Book\" by Naph-Tali, followed by the album One of These Days. Since 1999, he has concentrated on production."]}, {"page": "Vibronics", "response": ["Vibronics are a reggae collective, based in Leicester, England, starting in 1995. Centred on Steve Vibronics and Richi Rootz, they initially gained exposure via the Egg Experience '97 shows, leading to a deal with Zion Train's Universal Egg label.Larkin, Colin:\"The Virgin Encyclopedia of Reggae\", 1998, Virgin Books,   Mainly working in digital dub, Vibronics' early releases such as \"Universal Love\" and \"Jah Light, Jah Love\" found favour with sound systems such as Jah Shaka's,  Iration Steppas, and Aba Shanti-I.  With Jah Free, Vibronics performed on a series of dub conferences in several European countries, leading to the release of the album Outernational Dub Conference Volume One in 1998."]}, {"page": "Hopeton Lewis", "response": ["The Disciples roots reggae and dub   musicians  have a record label entitled Boom Shaka Laka, named in honour of, and inspired by Hopeton Lewis' song (as well as by Jah Shaka and reggae culture and history in general). The Disciples also wrote a highly influential roots reggae fanzine called Boom Shaka Laka, also named after the Hopeton Lewis record. The author, Lol Bell-Brown ( who works for Dub Vendor  ) named the magazine after the Hopeton Lewis classic song, Boom-Shacka-Lacka. The first issue was released in 1988 and over the four following years the magazine became one of the most important publications to cover, for the time, the current roots scene as well as classic roots records. There was 11 issues released of which all are sought after collectors items."]}, {"page": "Bobby Valentino (British musician)", "response": ["* Jah Shaka/Mad Professor -\"Jah Shaka Meets Mad Profes..\" (1984) Violin"]}, {"page": "Alpha & Omega (band)", "response": ["Alpha And Omega are a roots dub duo that mix both analogue and digital elements, comprising bassist Christine Woodbridge and keyboard player John Sprosen, both of whom had played in reggae bands previously, Sprosen also having worked with the Roaring Lion Sound System.Colin Larkin (1998) The Virgin Encyclopedia of Reggae, Virgin Books, , p.10David V. Moskowitz (2006) Caribbean Popular Music: An Encyclopedia of Reggae, Mento, Ska, Rock Steady, and Dancehall, Greenwood Press, , p.9-10 They began working together in the mid-1980s, splitting their time between their home towns of London and Plymouth, and issued their debut home-recorded cassette in 1988. They were picked up by Greensleeves Records, who acted as a parent company to the duo's A&O label, and also worked with Jah Shaka, for whom they supplied rhythm tracks. Although they are strongly influenced by artists such as Lee \"Scratch\" Perry, King Tubby and Augustus Pablo, they have developed a sound that has been described as \"uniquely British\".Craig Harris \"[ Alpha & Omega Biography]\", Allmusic, Macrovision Corporation In a review of their Mystical Things album, Rick Anderson, writing for Allmusic, wrote: \"This prolific London-based duo is responsible for some of the most convincing old-school reggae to come from the first world.\"Rick Anderson \"[ Mystical Things Review]\", Allmusic, Macrovision Corporation"]}, {"page": "List of Red Bull Music Academy lecturers", "response": ["* Jah Shaka"]}, {"page": "All Tomorrow's Parties (2009 film)", "response": ["The film features music and performances from Belle And Sebastian, Grizzly Bear, Sonic Youth, Battles, Boards of Canada, Portishead, Daniel Johnston, Grinderman, Lightning Bolt, David Cross, Animal Collective, The Boredoms, Les Savy Fav, Mogwai, Octopus Project, Slint, Dirty Three, Yeah Yeah Yeahs, the Gossip, GZA, Roscoe Mitchell, Seasick Steve, Iggy and the Stooges, A Hawk and a Hacksaw, Fuck Buttons, Micah P Hinson, Two Gallants, The Mars Volta, Akron/Family, Jah Shaka, Saul Williams, Shellac, Patti Smith and John Cooper Clarke."]}, {"page": "Stranger Cole", "response": ["Cole was born in Kingston, Jamaica on 26 July 1942 and nicknamed \"Stranger\" by his family, as they considered that he didn't resemble any member of his family. Cole was initially successful as a songwriter, writing \"In and out the Window\", which was a hit for Eric \"Monty\" Morris.Boehm, Mike (2001) \"StrangeJah in Laguna Reggae Musicians Will Perform at a Benefit to Provide Toys for Children at Orangewood\", Los Angeles Times, 21 December 1988, retrieved 30 August 2009 This success gave him the chance to make his recording debut in 1962, instantly finding success with singles such as \"Rough and Tough\" and \"When You Call My Name\" (a duet with Patsy Todd) for producer Arthur \"Duke\" Reid.Larkin, Colin (1998) The Virgin Encyclopedia of Reggae, Virgin Books, , p. 64 Further success followed with singles for Reid through to the mid-1960s, and he also worked with other producers at this time, including Clement \"Coxsone\" Dodd (a duet with Ken Boothe on \"Worlds Fair\"), and Prince Buster. Further duets included recordings with Gladstone Anderson (on \"Just Like a River\")Leggett, Steve \"[ Stranger Cole Biography]\", AllMusic and Hortense Ellis, the tendency to record duets apparently due to his shyness when it came to singing alone. In the late 1960s and early 1970s he recorded with several producers, including Bunny Lee, Lee \"Scratch\" Perry, and Sonia Pottinger.Moskowitz, David V. (2006) Caribbean Popular Music: An Encyclopedia of Reggae, Mento, Ska, Rock Steady, and Dancehall, Greenwood Press, , p. 66-7 These included further material with Todd as \"Stranger & Patsy.\" In 1971 he emigrated to England, where he toured extensively, and moved on again to Canada in 1973, settling in Toronto. He worked as a machinist in the Tonka Toy factory in Toronto and later opened a record store the first Caribbean shop in Toronto's Kensington Market area His first album, \"Forward\" in the Land of Sunshine, was released in 1976, with a handful of further albums released over the next ten years, mostly on his own label. In 2006, Cole released his first album in twenty years, Morning Train, a collaboration with Jah Shaka. Cole is featured in the 2009 documentary Rocksteady: The Roots of Reggae, in which he and other stars of the rocksteady era reunited to record a new album of the same name, released in August 2009.Braun, Liz (2009) \"A pleasure getting to the roots of reggae\", Calgary Sun, 28 August 2009, retrieved 30 August 2009", "*Morning Train (2006), Jah Shaka Music"]}, {"page": "Tony Tuff", "response": ["Tuff started his career in 1969 as a member of the vocal trio The African Brothers, along with Sugar Minott and Derrick \"Bubbles\" Howard.Larkin, Colin (1998) The Virgin Encyclopedia of Reggae, Virgin Books, , p. 303Moskowitz, David V. (2006) Caribbean Popular Music: an Encyclopedia of Reggae, Mento, Ska, Rock Steady, and Dancehall, Greenwood Press, , p. 298 The African Brothers split up in the mid-1970s, and Tuff pursued other work outside music until he returned as a solo artist in the late 1970s, with the album Tony Tuff Meets Errol Schorder , split with Errol Scorcher, and self-productions including the \"I'm So Glad\" single on his own Winston label. He worked with Yabby You on the Tony Tuff album in 1980, and worked with Minott again on the 1981 album Presenting Mr. Tuff, released on Minott's Black Roots label. He worked on several sound systems in the late 1970s and 1980s, including Lees Unlimited and Henry \"Junjo\" Lawes' Volcano system.Anderson, Rick \"[ Say Something Review]\", AllMusic Lawes also produced several successful singles by Tuff including \"Water Pumpee\", and \"Mix Me Down\", and also produced his 1983 album Come Fe Mash It. He continued to be active during the 1980s, but was largely absent from the music scene in the 1990s. He returned in 2000, and has recorded several albums in the new millennium, including How Long, recorded with Jah Shaka. He toured Europe twice in 2002, before touring Canada and the United States.Walters, Basil (2003) \"Tony Tuff coming 'fi mash it' at Startime tomorrow\", Jamaica Observer, 11 July 2003, retrieved 16 September 2009", "*How Long (2006), Jah Shaka Music", "*How Long Dub (2009), Jah Shaka Music – Jah Shaka featuring Tony Tuff"]}]}}