{"wiki_id": "http://www.wikidata.org/entity/Q726029", "itemLabel": "Granville Sharp", "itemDescription": "English campaigner for the abolition of the slave trade (1735-1813)", "wikipedia_url": "https://en.wikipedia.org/wiki/Granville_Sharp", "wikipedia_page": {"main": "Granville Sharp (10 November 1735 – 6 July 1813) was one of the first British campaigners for the abolition of the slave trade.  He also involved himself in trying to correct other social injustices. Sharp formulated the plan to settle black people in Sierra Leone, and founded the St George's Bay Company, a forerunner of the Sierra Leone Company. His efforts led to both the founding of the Province of Freedom, and later on Freetown, Sierra Leone, and so he is considered to be one of the founding fathers of Sierra Leone. He was also a biblical scholar, a classicist, and a talented musician.", "link_mentions": [{"page": "George Frideric Handel", "response": ["Handel's works were collected and preserved by two men: Sir Samuel Hellier, a country squire whose musical acquisitions form the nucleus of the Shaw-Hellier Collection,Best, Terence, ed. Handel collections and their history, a collection of conference papers given by the international panel of distinguished Handel scholars. Clarendon Press, 1993 and the abolitionist Granville Sharp. The catalogue accompanying the National Portrait Gallery exhibition marking the tercentenary of the composer's birth calls them two men of the late eighteenth century \"who have left us solid evidence of the means by which they indulged their enthusiasm\".Jacob Simon (1985). Handel, a celebration of his life and times, 1685–1759. p. 239. National Portrait Gallery (Great Britain) With his English oratorios, such as Messiah and Solomon, the coronation anthems, and other works including Water Music and Music for the Royal Fireworks, Handel became a national icon in Britain, and featured in the BBC series, The Birth of British Music: Handel – The Conquering Hero."]}, {"page": "July 6", "response": ["*1813 – Granville Sharp, English activist (b. 1735)"]}, {"page": "Magna Carta", "response": ["It also greatly extended the powers of Parliament. Under this new constitution, monarchical absolutism was replaced by parliamentary supremacy. It was quickly realised that Magna Carta stood in the same relation to the King-in-Parliament as it had to the King without Parliament. This supremacy would be challenged by the likes of Granville Sharp. Sharp regarded Magna Carta as a fundamental part of the constitution, and maintained that it would be treason to repeal any part of it. He also held that the Charter prohibited slavery."]}, {"page": "November 10", "response": ["*1735 – Granville Sharp, English activist and scholar, co-founded the Sierra Leone Company (d. 1813)"]}, {"page": "Sierra Leone", "response": ["Many in London thought that moving them to Sierra Leone would lift them out of poverty.Peter Fryer in Staying Power: The History of Black People in Britain (London: Pluto Press, 1984; p. 195) quotes a contemporary commentator who called them \"indigent, unemployed, despised and forlorn\", saying that \"it was necessary they should be sent somewhere, and be no longer suffered to invest [sic] the streets of London\" (C. B. Wadström, An Essay on Colonization, 1794–5, II, 220). The Sierra Leone Resettlement Scheme was proposed by entomologist Henry Smeathman and drew interest from humanitarians like Granville Sharp, who saw it as a means of showing the pro-slavery lobby that black people could contribute towards the running of the new colony of Sierra Leone. Government officials soon became involved in the scheme as well, although their interest was spurred by the possibility of resettling a large group of poor citizens elsewhere. William Pitt the Younger, prime minister and leader of the Tory party, had an active interest in the Scheme because he saw it as a means to repatriate the Black Poor to Africa, since \"it was necessary they should be sent somewhere, and be no longer suffered to infest the streets of London\"."]}, {"page": "History of Sierra Leone", "response": ["In 1787, a plan was established to settle some of London's \"Black Poor\" in Sierra Leone in what was called the \"Province of Freedom\". This was organised by the Committee for the Relief of the Black Poor, founded by British abolitionist Granville Sharp, which preferred it as a solution to continuing to financially support them in London. Many of the Black Poor were African Americans, who had been given their freedom after seeking refuge with the British Army during the American Revolution, but also included other West Indian, African and Asian inhabitants of London.", "The Sierra Leone Resettlement Scheme was proposed by entomologist Henry Smeathman and drew interest from humanitarians like Granville Sharp saw it as a means of showing the pro-slavery lobby that black people could contribute towards the running of the new colony of Sierra Leone. Government officials soon became involved in the scheme as well, although their interest was spurred by the possibility of resettling a large group of poor citizens elsewhere. William Pitt the Younger, prime minister and leader of the Tory party, had an active interest in the Scheme, because he saw it as a means to repatriate the Black Poor to Africa, since \"it was necessary they should be sent somewhere, and be no longer suffered to infest the streets of London\".Michael Siva, \"Why did the Black Poor of London not support the Sierra Leone Resettlement Scheme?\", History Matters Journal, Vol. 1, No. 2 (Winter, 2021), p. 35."]}, {"page": "1787", "response": ["* May 22 – In Britain, Thomas Clarkson and Granville Sharp found the Society for Effecting the Abolition of the Slave Trade, with support from John Wesley, Josiah Wedgwood and others."]}, {"page": "1735", "response": ["* November 10 – Granville Sharp, English abolitionist (d. 1813)"]}, {"page": "1813", "response": ["* July 6 – Granville Sharp, English abolitionist (b. 1735)"]}, {"page": "Abolitionism", "response": ["The British abolitionist movement started in the late 18th century when English and American Quakers began to question the morality of slavery. James Oglethorpe was among the first to articulate the Enlightenment case against slavery, banning it in the Province of Georgia on humanitarian grounds, and arguing against it in Parliament, and eventually encouraging his friends Granville Sharp and Hannah More to vigorously pursue the cause. Soon after Oglethorpe's death in 1785, Sharp and More united with William Wilberforce and others in forming the Clapham Sect.Wilson, Thomas, The Oglethorpe Plan, 201–06."]}, {"page": "William Wilberforce", "response": ["In 1787, he came into contact with Thomas Clarkson and a group of anti-slave-trade activists, including Granville Sharp, Hannah More and Charles Middleton. They persuaded Wilberforce to take on the cause of abolition, and he soon became one of the leading English abolitionists. He headed the parliamentary campaign against the British slave trade for twenty years until the passage of the Slave Trade Act of 1807.", "Pro-slavery advocates claimed that enslaved Africans were lesser human beings who benefited from their bondage. Wilberforce, the Clapham Sect and others were anxious to demonstrate that Africans, and particularly freed slaves, had human and economic abilities beyond the slave trade, and that they were capable of sustaining a well-ordered society, trade and cultivation. Inspired in part by the utopian vision of Granville Sharp, they became involved in the establishment in 1792 of a free colony in Sierra Leone with black settlers from Britain, Nova Scotia and Jamaica, as well as native Africans and some whites. They formed the Sierra Leone Company, with Wilberforce subscribing liberally to the project in money and time. The dream was of an ideal society in which races would mix on equal terms; the reality was fraught with tension, crop failures, disease, death, war and defections to the slave trade. Initially a commercial venture, the British government assumed responsibility for the colony in 1808. The colony, although troubled at times, was to become a symbol of anti-slavery in which residents, communities and African tribal chiefs, worked together to prevent enslavement at the source, supported by a British naval blockade to stem the region's slave trade."]}, {"page": "Clapham Sect", "response": ["Some of the group, Granville Sharp, Thomas Clarkson and William Wilberforce, were responsible for the founding in 1787 of Sierra Leone as a settlement for some of the African-Americans freed by the British during the American Revolutionary War; it thus became the first non trading-post British \"colony\" akin to a fledgling mission state in Africa, whose purpose in Clarkson's words was \"the abolition of the slave trade, the civilisation of Africa, and the introduction of the gospel there\". Later, in 1792, another of the group John Clarkson was instrumental in the creation of its capital Freetown.", "* Granville Sharp (1735–1813), campaigner for social justice, scholar and administrator"]}, {"page": "Freetown", "response": ["The area was first settled in 1787 by 400 formerly enslaved black people sent from London, England, under the auspices of the Committee for the Relief of the Black Poor, an organisation set up by Jonah Hanway and the British abolitionist Granville Sharp.Roman Adrian Cybriwsky, Capital Cities around the World: An Encyclopedia of Geography, History, and Culture, ABC-CLIO, USA, 2013, p. 109 These black people were African Americans, Afro-Caribbeans, Africans, Southeast Asians, and black people born in Great Britain. They established the 'Province of Freedom' and the settlement of Granville Town on land purchased from local Koya Temne subchief King Tom and regent Naimbana. The British understood the purchase meant that their new settlers had the land \"for ever.\" Although the established arrangement between Europeans and the Koya Temne included provisions for permanent settlement, some historians question how well the Koya leaders understood the agreement, as they had a different conception of the uses of property."]}, {"page": "Fulham", "response": ["* Granville Sharp (1735-1813), abolitionist and brother of William", "File:Granville Sharp (Hoare memoire).jpg|Granville Sharp (Hoare memoire). He is buried in Fulham"]}, {"page": "List of places named after people", "response": ["* Granville, Jamaica – Granville Sharp", "* Granville Town, Province of Freedom – Granville Sharp"]}, {"page": "William Murray, 1st Earl of Mansfield", "response": ["Mansfield ordered a hearing for 22 January 1772. Following an adjournment, the case was not heard until 7 February 1772. In the meantime, the case had attracted a great deal of attention in the press, and members of the public were forthcoming with donations to fund lawyers for both sides of the argument.Heward (1979) p. 140 An activist layman, Granville Sharp, who continually sought test cases against the legal justifications for slavery, was Somersett's real backer. When the case was heard, no fewer than five advocates appeared for the slave, speaking at three separate hearings between February and May. These lawyers included William Davy SL, John Glynn SL,Van Cleve (2006) p. 2 James Mansfield and Francis Hargrave, who was later to become a noted barrister based on his work in this case. Charles Stewart was represented by John Dunning and James Wallace."]}, {"page": "Beilby Porteus", "response": ["He was ordained as a priest in 1757, and in 1762 was appointed as domestic chaplain to Thomas Secker, Archbishop of Canterbury, acting as his personal assistant at Lambeth Palace for six years. It was during these years that it is thought he became more aware of the conditions of the enslaved Africans in the American colonies and the British West Indies. He corresponded with clergy and missionaries, receiving reports on the appalling conditions facing the slaves from Revd James Ramsay in the West Indies and from Granville Sharp, the English lawyer who had supported the cases of freed slaves in England.", "In 1787, Porteus was translated to the bishopric of London on the advice of Prime Minister William Pitt, a position he held until his death in 1809. As is customary, he was also appointed to the Privy Council, and Dean of the Chapel Royal. In 1788, he supported Sir William Dolben's Slave Trade Bill from the bench of bishops, and over the next quarter century he became the leading advocate within the Church of England for the abolition of slavery, lending support to such men as Wilberforce, Granville Sharp, Henry Thornton and Zachary Macaulay to secure the eventual passage of the Slave Trade Act in 1807."]}, {"page": "Thomas Clarkson", "response": ["The essay was influential, resulting in Clarkson's being introduced to many others who were sympathetic to abolition, some of whom had already published and campaigned against slavery. These included influential men such as James Ramsay and Granville Sharp, many Quakers, and other nonconformists. The movement had been gathering strength for some years, having been founded by Quakers both in Britain and in the United States, with support from other nonconformists, primarily Methodists and Baptists, on both sides of the Atlantic. In 1783, 300 Quakers, chiefly from the London area, presented Parliament with their signatures on the first petition against the slave trade.", "Following this step, a small offshoot group formed the Committee for the Abolition of the Slave Trade, a small non-denominational group that could lobby more successfully by incorporating Anglicans. Under the Test Act, only those prepared to receive the sacrament of the Lord's Supper according to the rites of the Church of England were permitted to serve as MPs, thus Quakers were generally barred from the House of Commons until the early nineteenth century. The twelve founding members included nine Quakers, and three pioneering Anglicans: Clarkson, Granville Sharp, and Philip Sansom. They were sympathetic to the religious revival that had predominantly nonconformist origins, but which sought wider non-denominational support for a \"Great Awakening\" amongst believers.", "Encouraged by publication of Clarkson's essay, an informal committee was set up between small groups from the petitioning Quakers, Clarkson and others, with the goal of lobbying members of parliament (MPs). In May 1787, they formed the Committee for the Abolition of the Slave Trade. The Committee included Granville Sharp as chairman and Josiah Wedgwood, as well as Clarkson. Clarkson also approached the young William Wilberforce, who as an Anglican and an MP was connected within the British Parliament. Wilberforce was one of few parliamentarians to have had sympathy with the Quaker petition; he had already put a question about the slave trade before the House of Commons, and became known as one of the earliest Anglican abolitionists."]}, {"page": "Hannah More", "response": ["In the 1780s Hannah More became a friend of James Oglethorpe, who had long been concerned with slavery as a moral issue and who was working with Granville Sharp as an early abolitionist.Thomas Wilson, The Oglethorpe Plan. Epilogue. Charlottesville, Va.: University of Virginia Press, 2012. More published Sacred Dramas in 1782, which rapidly ran through 19 editions. These and the poems Bas-Bleu and Florio (1786) mark a gradual transition to graver views, expressed in prose in Thoughts on the Importance of the Manners of the Great to General Society (1788) and An Estimate of the Religion of the Fashionable World (1790). By this time she was close to William Wilberforce and Zachary Macaulay, sympathising with their evangelical views. Her poem Slavery appeared in 1788. For many years she was a friend of Beilby Porteus, Bishop of London and a leading abolitionist, who drew her into a group of anti-slave traders that included Wilberforce, Charles Middleton and also James Ramsay at Teston in Kent."]}, {"page": "1767 in music", "response": ["* Granville Sharp – A Short Introduction to Vocal Musick"]}, {"page": "Olaudah Equiano", "response": ["As early as 1783, Equiano informed abolitionists such as Granville Sharp about the slave trade; that year he was the first to tell Sharp about the Zong massacre, which was being tried in London as litigation for insurance claims. It became a cause célèbre for the abolitionist movement and contributed to its growth.", "Several events in Equiano's life led him to question his faith. He was distressed in 1774 by the kidnapping of his friend, a black cook named John Annis, who was taken forcibly off the British ship Anglicania on which they were both serving. His friend's kidnapper, William Kirkpatrick, did not abide by the decision in the Somersett Case (1772), that slaves could not be taken from England without their permission, as common law did not support the institution in England & Wales. Kirkpatrick had Annis transported to Saint Kitts, where he was punished severely and worked as a plantation labourer until he died. With the aid of Granville Sharp, Equiano tried to get Annis released before he was shipped from England but was unsuccessful. He heard that Annis was not free from suffering until he died in slavery. Despite his questioning, he affirms his faith in Christianity, as seen in the penultimate sentence of his work that quotes the prophet Micah (): \"After all, what makes any event important, unless by its observation we become better and wiser, and learn 'to do justly, to love mercy, and to walk humbly before God?'\"", "In his account, Equiano also told of his settling in London. He married an English woman and lived with her in Soham, Cambridgeshire, where they had two daughters. He became a leading abolitionist in the 1780s, lecturing in numerous cities against the slave trade. Equiano records his and Granville Sharp's central roles in the anti-slave trade movement, and their effort to publicise the Zong massacre, which became known in 1783."]}, {"page": "Poets' Corner", "response": ["| Granville Sharp"]}, {"page": "Henry Thornton (reformer)", "response": ["In 1791 Thornton played a major part in the establishment of the Sierra Leone Company, which took over the failed attempt by Granville Sharp to create a colony for the settlement of freed slaves in Africa. The company sponsored the voyage to London (1791–93) of the Temne prince John Naimbanna."]}, {"page": "Anthony Benezet", "response": ["* Some Historical Account of Guinea ... With an inquiry into the rise and progress of the slave-trade ... Also a republication of the sentiments of several authors of note on this interesting subject; particularly an extract of a treatise by Granville Sharp, 1767"]}, {"page": "Pan-Africanism", "response": ["Coinciding with numerous New World slave insurrections; highlighted by the Haitian Revolution, the end of the 19th century birthed an intercontinental pro-African political movement that sought to unify disparate campaigns in the goal to end oppression. Another important political form of a religious pan-Africanist worldview appeared in the form of Ethiopianism. In London, the Sons of Africa was a political group addressed by Quobna Ottobah Cugoano in the 1791 edition of his book Thoughts and Sentiments on the Evil of Slavery. The group addressed meetings and organised letter-writing campaigns, published campaigning material and visited parliament. They wrote to figures such as Granville Sharp, William Pitt and other members of the white abolition movement, as well as King George III and the Prince of Wales, the future George IV."]}, {"page": "Zong massacre", "response": ["Following the first trial, Olaudah Equiano, a freedman, brought news of the massacre to the attention of the anti-slavery campaigner Granville Sharp, who worked unsuccessfully to have the ship's crew prosecuted for murder. Because of the legal dispute, reports of the massacre received increased publicity, stimulating the abolitionist movement in the late 18th and early 19th centuries; the Zong events were increasingly cited as a powerful symbol of the horrors of the Middle Passage, the transoceanic route by which enslaved people were brought to the New World.\"The Zong case study\", Understanding Slavery Initiative website, 2011.", "Robert Stubbs was the only witness in the first Zong trial and the jury found in favour of the owners, under an established protocol in maritime insurance that considered slaves as cargo.Walvin 2011, pp. 103, 139, 142. On 19 March 1783, Olaudah Equiano, a formerly enslaved person, told the anti-slave-trade activist Granville Sharp of the events aboard Zong and a newspaper soon carried a lengthy account, reporting that the captain had ordered the enslaved people killed in three batches.Lovejoy 2006, pp. 337, 344.Walvin 2011, pp. 1, 140. Sharp sought legal advice the next day, about the possibility of prosecuting the crew for murder.Walvin 2011, p. 164.", "The insurers applied to the Earl of Mansfield to have the previous verdict set aside and for the case to be tried again.Lewis 2007, pp. 365–366. A hearing was held at the Court of King's Bench in Westminster Hall on 21–22 May 1783, before Mansfield and two other King's Bench judges, Mr Justice Buller and Mr Justice Willes.Walvin 2011, p. 138. The Solicitor General, John Lee, appeared on behalf of the Zong owners, as he had done previously in the Guildhall trial.Weisbord 1969, p. 563. Granville Sharp was also in attendance, together with a secretary he had hired to take a written record of the proceedings.Walvin 2011, p. 139.", "John Lee responded by saying that the enslaved people \"perished just as a Cargo of Goods perished\" and were jettisoned for the greater good of the ship.Walvin 2011, p. 146. The insurers' legal team replied that Lee's argument could never justify the killing of innocent people; each of the three addressed issues of humanity in the treatment of the slaves and said that the actions of Zong crew were nothing less than murder. Historian James Walvin has argued that it is possible that Granville Sharp directly influenced the strategy of the insurers' legal team.", "There is no evidence that another trial was held on this issue.Krikler 2007, p. 37.Weisbord 1969, p. 564. Despite Granville Sharp's efforts, no member of the crew was prosecuted for murder.Walvin 2011, p. 167. Even so, the Zong case did eventually gain both national and international attention. A summary of the appeal on the Zong case was eventually published in the nominate reports prepared from the contemporaneous manuscript notes of Sylvester Douglas, Baron Glenbervie, and others. It was published in 1831 as Gregson v Gilbert (1783) 3 Doug. KB 232.", "Granville Sharp campaigned to raise awareness of the massacre, writing letters to newspapers, the Lords Commissioners of Admiralty and the Prime Minister (the Duke of Portland).Weisbord 1969, pp. 565–567.Rupprecht, \"A Very Uncommon Case\" (2007), p. 336. Neither Portland nor the Admiralty sent him a reply. Only a single London newspaper reported the first Zong trial in March 1783, but it provided details of events.Walvin 2011, p. 1.  The newspaper article in March 1783 was the first public report of the massacre, and it was published nearly 18 months after the event.Swaminathan 2010, p. 485. Little else about the massacre appeared in print before 1787.", "The Zong massacre has inspired several works of literature. Fred D'Aguiar's novel Feeding the Ghosts (1997) tells the story of an African who survives being thrown overboard from the Zong. In the novel, the journal of the slave—Mintah—is lost, unlike that of Granville Sharp. According to the cultural historian Anita Rupprecht, this signifies the silencing of African voices about the massacre.Rupprecht 2008, p. 268.", "* Faubert, Michelle (2018). Granville Sharp's Uncovered Letter and the Zong Massacre. Palgrave. ."]}, {"page": "Ottobah Cugoano", "response": ["In 1786 he played a key role in the case of Henry Demane, a kidnapped black man who was to be shipped back to the West Indies. Cugoano contacted Granville Sharp, a well-known abolitionist, who was able to have Demane removed from the ship before it sailed.Harris, Jennifer. \"Quobna Ottabah Cugoano\", Dictionary of Literary Biography Yearbook: 2002, Detroit, MI: Gale Research Company, 2003."]}, {"page": "Christopher Wordsworth (divine)", "response": ["Twelve years later he received the degree of DD. He took holy orders, and obtained successive preferments through the patronage of Charles Manners-Sutton, Bishop of Norwich, afterwards (1805) Archbishop of Canterbury, to whose son Charles (afterwards Speaker of the House of Commons, and Viscount Canterbury) he had been tutor. He had in 1802 attracted attention by his defence of Granville Sharp's then novel canon \"on the uses of the definitive article\" in New Testament textual criticism."]}, {"page": "Slavery Abolition Act 1833", "response": ["In May 1772, Lord Mansfield's judgment in the Somerset case emancipated a slave in England and thus helped launch the movement to abolish slavery. Peter P. Inks, John R. Michigan, R. Owen Williams (2007) Encyclopedia of antislavery and abolition, p. 643. Greenwood Publishing Group, 2007 Blumrosen, Alfred W. and Ruth G., Slave Nation: How Slavery United the Colonies and Sparked the American Revolution, Sourcebooks, 2005 The case ruled that slaves could not be transported out of England against their will, but did not actually abolish slavery in England. However, many campaigners, including Granville Sharp, took the view that the ratio decidendi of the Somerset case meant that slavery was unsupported by law within England and that no ownership could be exercised on slaves entering English or Scottish soil.(1827) 2 Hag Adm 94.Simon Schama, Rough Crossings (London: BBC Books, 2005), p. 61. In 1785, English poet William Cowper wrote:"]}, {"page": "Durham School", "response": ["* Granville Sharp, founder of Sierra Leone"]}, {"page": "Clarkson Memorial", "response": ["The memorial consists of a statue mounted on a high platform. Above this rises a canopy, in the form of a spire. The whole structure is 68 feet (20.6 m) high. On three of the four sides are carved bas-reliefs, representing William Wilberforce and Granville Sharp, both prominent figures in the campaign against the slave trade, and a manacled slave in a beseeching attitude. The fourth side bears an inscription to the memory of Clarkson."]}, {"page": "Sierra Leone Company", "response": ["The Sierra Leone Company was the corporate body involved in founding the second British colony in Africa on 11 March 1792 through the resettlement of Black Loyalists who had initially been settled in Nova Scotia (the Nova Scotian Settlers) after the American Revolutionary War.  The company came about because of the work of the ardent abolitionists, Granville Sharp, Thomas Clarkson, Henry Thornton, and Thomas's brother, John Clarkson, who is considered one of the founding fathers of Sierra Leone. The company was the successor to the St. George Bay Company, a corporate body established in 1790 that re-established Granville Town in 1791 for the 60 remaining Old Settlers.", "Both ventures were promoted by the anti-slavery activist Granville Sharp, who published a prospectus for the proposed company in 1790 entitled Free English Territory in AFRICA. The prospectus made clear its abolitionist view and stated that several respectable gentlemen who had already subscribed had done so \"not with a view of any present profit to themselves, but merely, through benevolence and public spirit, to promote a charitable measure, which may hereafter prove of great national importance to the Manufactories, and other Trading Interests of this Kingdom\"."]}, {"page": "Slavery at common law", "response": ["It is inferred that, because he was from Russia, Cartwright's slave was white, and probably a Christian, although this is not recorded.In his arguments in Somersett's case, Granville Sharp averred that the court held: \"...and it was resolved, that England was too pure an air for a slave to breathe, and so everyone who breathes it becomes free. Everyone who comes to this island is entitled to the protection of English law, whatever oppression he may have suffered and whatever may be the colour of his skin.\" However it is not clear from where Sharp drew this authority, and he may have embellished the reports of the decision that he had found. However, it is possible that he was African, as, although they were uncommon, African slaves in Russia were not unknown prior to the emergence of the Atlantic slave trade.", "The question of a slave's rights as against his putative master (as opposed to merchants' rights as against each other) eventually came before Lord Mansfield and the King's Bench in 1771.  A writ of habeas corpus had been issued to secure the release of James Somersett, a black man confined in irons on board a ship arrived in the Thames from Virginia, bound for Jamaica, and the return stated that he was a slave under the law of Virginia.  Lord Mansfield was anxious to avoid the issue principle, and pressed the parties to settle; but the case was taken up by the West India merchants, who wanted to know whether slaves were a safe investment, and by abolitionists such as Granville Sharp, so that it became a cause célèbre.  The law of villeinage was turned by Somersett's counsel into an argument against slavery, since the kind of proof that was required to establish villein status was not available in claiming slaves.  After arguments closed it still took Lord Mansfield three agonising months before he delivered his judgment, which in the end, was short and delivered orally only.  In the event the court ordered in 1772 that \"the black must be discharged\".  But Lord Mansfield, while stating that slavery was \"odious\", did not decide that slavery was unlawful, nor even that Somersett was no longer a slave, confining himself to the narrow point that a slave could not be made to leave England against his will.  The decision also left aside the problem in the conflict of laws; if a person was a slave by law of his domicile, which was not disputed in the case of Somersett, a mere temporary presence in England would not set him free permanently, even for the purpose of English law.English law is fond of such fudges; in land law, after 12 years a trespasser may obtain \"squatter's rights\" and cannot then be evicted by the true landowner, but the trespasser cannot himself be registered as the landowner until a subsequent period passes and he acquires it by prescription.  Several contract cases concerning overseas slaves in fact came before Lord Mansfield, and counsel did not even think it worth arguing that the contracts were illegal or contrary to public policy."]}, {"page": "Ferdinando Fairfax", "response": ["From the 1770s onward, individuals in France, Britain, and North America developed plans to colonize freed black people as a way of encouraging emancipation. These individuals proposed to form colonies in Africa, in the Caribbean, or in the American West; notable proponents include Granville Sharp of England, LaFayette of France, and Thomas Jefferson of America. One of the first such plans came from four enslaved black men in New England, who petitioned the colonial government for permission to buy their own freedom and then transport themselves to a colony they wanted to found on the African coast."]}, {"page": "Society for Effecting the Abolition of the Slave Trade", "response": ["The society was established by twelve men; including prominent campaigners Thomas Clarkson and Granville Sharp, who, as Anglicans, were able to be more influential in Parliament than the more numerous Quaker founding members. The society worked to educate the public about the abuses of the slave trade, and achieved abolition of the international slave trade  when the British Parliament passed the Slave Trade Act 1807, at which time the society ceased its activities.", "Three Anglicans were founding members: Thomas Clarkson, campaigner and author of an influential essay against the slave trade; Granville Sharp who, as a lawyer, had long been involved in the support and prosecution of cases on behalf of enslaved Africans; and Philip Sansom."]}, {"page": "Letters from a Farmer in Pennsylvania", "response": ["As the letters were published anonymously, Dickinson's identity as the author was not generally known until May 1768. Governor Bernard of Massachusetts speculated privately that the letters might originate from New York. Lord Hillsborough, Secretary of State for the Colonies, might have suspected Benjamin Franklin of authoring the letters, as Franklin related to his son in a letter: \"My Lord H. mentioned the Farmer's letters to me, said he had read them, that they were well written, and he believed he could guess who was the author, looking in my face at the same time as if he thought it was me. He censured the doctrines as extremely wild, &c.\" Franklin in turn speculated that a \"Mr. Delancey\", possibly a reference to Daniel Dulany, might be the author. Due to the initial anonymity of the author, the character of \"the farmer\" attained a lasting reputation independent of Dickinson. \"The farmer\" was the subject of numerous official tributes throughout the colonies, such as a paean written by the town of Boston on the suggestion of Samuel Adams, and was sometimes compared to Whig heroes such as William Pitt and John Wilkes. The letters sparked limited critical reactions in the colonies, such as a series of satirical articles organized by the speaker of the Pennsylvania assembly, Joseph Galloway, which like the original Letters appeared in the Pennsylvania Chronicle. The response to the letters was substantially critical in England with only a few favorable views, such as from Granville SharpBritain and the American Revolution, by H. T. Dickinson, p. 168 and James Burgh.Neither Kingdom Nor Nation, By Neil Longley York, p. 88An English Audience for American Revolutionary Pamphlets Tory papers in England rebutted Dickinson's constitutional argument by arguing that the colonists were virtually represented in Parliament, and by emphasizing the indivisibility of Parliament's sovereignty in the Empire; these rebuttals were not widely circulated in the colonies. Praise for the letters in English Whig newspapers were more widely reprinted in the colonies, producing a skewed impression in the colonies of the English reaction."]}, {"page": "Thomas Peters (revolutionary)", "response": ["In 1791, Peters went to London, where he helped convince the Royal government (with the help of Granville Sharp) to allow them to settle a new colony in West Africa. This was ultimately established as Freetown, Sierra Leone. Peters was well received during his trip to London, and he was introduced to some notable people  by his former commander, General Henry Clinton, who was politically out of favour. It was decided in London that Peters and the Naval Officer John Clarkson, the brother of English abolitionist Thomas Clarkson, would assist in recruiting blacks to settle in Sierra Leone."]}, {"page": "The Starfish and the Spider", "response": ["English lawyer Granville Sharp's decision to defend the freedom of a slave named Jonathan Strong leads him to connect with the Quakers and to advocate for the abolition of the slave trade. The authors use Sharp's story to illustrate five foundational principles called the Five Legs: 1) Circles; 2) The Catalyst; 3) Ideology; 4) The Preexisting Network; 5) The Champion. They apply the Five Legs to the story of Elizabeth Cady Stanton who served as a catalyst to the women's rights movement in the USA with Susan B. Anthony as the champion. They then focus on some examples of catalysts: Jimmy Wales of Wikipedia; Deborah Alvarez-Rodriguez, who worked for the city of San Francisco and later Goodwill; entrepreneur Auren Hoffman and Josh Sage. They list a set of catalyst's tools including: Genuine Interest in Others, Loose Connections, Mapping, Desire to Help, Meet People Where They Are, Emotional Intelligence, Trust, Inspiration, Tolerance for Ambiguity, Hands-Off Approach and Receding. They contrast the work of a catalyst with that of a CEO."]}, {"page": "1813 in the United Kingdom", "response": ["* 6 July – Granville Sharp, abolitionist (born 1735)"]}, {"page": "John Sharp (bishop)", "response": ["Sharp was married, by John Tillotson, at Clerkenwell in 1676 to Elizabeth Palmer of Winthorpe, Lincolnshire. Of his fourteen children, only four survived him. Of these, John Sharp (1678–1727) of Grafton Park represented Ripon in Parliament from 1701 to 1714; he was a commissioner of trade from 15 September 1713 to September 1714, and died on 9 March 1726–7; in Wicken church, Northamptonshire, there is a monument to him and his wife Anna Maria, daughter of Charles Hosier of Wicken Park. Thomas (1693–1758), the youngest son, was a churchman and the biographer of his father. The English surgeon William Sharp and his brother the abolitionist Granville Sharp were sons of Thomas. Sir Joshua Sharp, Sheriff of London in 1713, was the Archbishop's brother."]}, {"page": "1787 in Great Britain", "response": ["* 22 May – Thomas Clarkson and Granville Sharp found the Society for Effecting the Abolition of the Slave Trade with support from John Wesley, Josiah Wedgwood and others."]}, {"page": "Christopher Wyvill", "response": ["Wyvill's correspondence with Pitt, and the political correspondence, are known as the \"Wyvill Papers\". Three volumes appeared in 1794–5 as Political Papers, chiefly respecting the Attempt of the County of York and other considerable Districts, commenced in 1779 … to effect a Reformation of the Parliament of Great Britain. Collected by the Rev. Christopher Wyvill, Chairman of the late Committee of Association (York). The preface is dated Burton Hall, 26 May 1794; in June 1802 Wyvill wrote the preface to a fourth volume, and the papers were eventually concluded in six. They show the proceedings of the Yorkshire Association, and the sympathy of others interested in the reform of Parliament. The correspondence includes letters between the chairman of the association and, among others, the Duke of Grafton, Lord Holland, Lansdowne, Lord Stanhope, Charles James Fox, Major John Cartwright, Capel Lofft, William Mason, William Strickland, Joseph Priestley, Richard Price, Bishop Richard Watson, Tom Paine, Granville Sharp, John Jebb, Sir George Savile, and Benjamin Franklin."]}]}}