{"wiki_id": "http://www.wikidata.org/entity/Q7265287", "itemLabel": "Q-Tee", "itemDescription": "British rapper", "wikipedia_url": "https://en.wikipedia.org/wiki/Q-Tee", "wikipedia_page": {"main": "Q-Tee (born Tatiana Mais, 1976 in Kidbrooke, London) is a British rapper.\nShe provided rapping vocals on two songs by Saint Etienne; the first of these being \"Filthy\" (B-side to \"Only Love Can Break Your Heart\" and also released on Smash The System: Singles and More) and the second being \"Calico\" (on So Tough). At the time she recorded these songs she was 15 years old. In 1990, she was the featured vocalist on History's UK No. 42 hit, \"Afrika\".In 1993, Q-Tee provided rapping vocals on \"Beautiful\" by Babble, who were essentially the last two remaining members of Thompson Twins. It was released on their album, The Stone (Warner Bros./Reprise Records), and remixes were also released on the double A-side single, \"Beautiful\"/\"Tribe\".\nShe was signed to a recording contract to Saint Etienne's label, Heavenly Records in her own right four years later, and released one song, \"Gimme That Body\" in January 1996. The single reached No. 40 in the UK Singles Chart. She also provided rapping vocals on Mark Morrison's 1996 single \"Horny\".", "link_mentions": [{"page": "Heavenly Recordings", "response": ["Over the next few years, Heavenly signed and released records by The Rockingbirds, Flowered Up, Beth Orton, The Hybirds, Monkey Mafia, Dot Allison, Q-Tee and Espiritu. Colleague and friend Martin Kelly became a partner in the label, as well as manager of Saint Etienne. Beth Orton's first album Trailer Park was nominated for two Brit Awards and for the 1997 Mercury Prize. Orton won a Brit for her second album, Central Reservation, in 2000.", "* Q-Tee"]}, {"page": "Little Louie Vega", "response": ["*1990 \"Afrika\", as History, with Q-Tee"]}, {"page": "So Tough", "response": ["* Q-Tee – vocals (on \"Calico\")"]}, {"page": "You Need a Mess of Help to Stand Alone (album)", "response": ["*Q-Tee - vocal (\"Filthy\")"]}, {"page": "The Stone (album)", "response": ["The Stone is the first album by Babble, an electronic dance music group that was composed of Tom Bailey, Alannah Currie (formerly of the Thompson Twins), and Keith Fernley. The group changed its name as it changed the outward appearance of its sound, from pop to dub-influenced chill-out. The underlying melodies and the familiar voices of Bailey and Currie still gave a Thompson Twins tone. However, the addition of Quest vocalist Amey St. Cyr (\"Take Me Away\" and \"Tribe\"), emcee Q-Tee (\"Beautiful\"), deep basslines, and loads of spacious effects made it a much more relevant album for the lounge music scene. Promotion of the album was minimal.  However, during an interview in Classic Pop magazine in 2014, Bailey stated the album was influential in the recording of Original Soundtracks 1, an album released in 1995 by U2 and Brian Eno under the pseudonym Passengers."]}, {"page": "Tatiana Mais", "response": ["#REDIRECT Q-Tee"]}, {"page": "Horny (Mark Morrison song)", "response": ["\"Horny\" is a song by British R&B musician Mark Morrison. It was released in December 1996 as the sixth single from his debut album, Return of the Mack. The song features guest rap vocals by Q-Tee and peaked at number five on the UK Singles Chart. The song also contains an uncredited sample of \"Encore\" by Cheryl Lynn."]}, {"page": "Gary Barnacle", "response": ["* Q-Tee"]}, {"page": "Gary Barnacle discography", "response": ["* 1990 \"Afrika\" (Love And Laughter Remix) by History Featuring Q-Tee (Tracks B1- Afrika (Louie Louie's Mix) and B2- Afrika (Louie Louie's Instrumental) - Produced by Louie Louie and featuring Gary Barnacle on Baritone/Soprano Saxophones and Flute) (12 inch single)", "* 1990 \"Afrika\" by History featuring Q-Tee (Track 2 - Afrika (Louie Louie's Mix) Produced by Louie Louie and featuring Gary Barnacle on Baritone/Soprano Saxophones and Flute) (cd single)"]}]}}