{"wiki_id": "http://www.wikidata.org/entity/Q726447", "itemLabel": "William Wright", "itemDescription": "Scottish physician and botanist (1735-1819)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wright_(botanist)", "wikipedia_page": {"main": "Dr William Wright  (1735–1819) was a Scottish physician and botanist. In 1783 he was a joint founder of the Royal Society of Edinburgh.\n\n", "link_mentions": [{"page": "Charles Bell", "response": ["Bell was elected a Fellow of the Royal Society of Edinburgh on 8 June 1807, on the nomination of Robert Jameson, William Wright and Thomas Macknight. He served as a Councillor of the RSE from 1836 to 1839."]}, {"page": "William Roxburgh", "response": ["In 1791 he was erected a Fellow of the Royal Society of Edinburgh. His proposers were William Wright, Daniel Rutherford and John Walker. In 1799 he was elected a Fellow of the Linnean Society."]}, {"page": "John Gillies (historian)", "response": ["In 1793 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were James Gregory, William Wright, and John Playfair."]}, {"page": "List of Scottish scientists", "response": ["| William Wright"]}, {"page": "William Wright", "response": ["*William Wright (poet) (1782–?), Scottish poet", "*William Wright (actor) (1911–1949), American film actor in the 1940s", "*William Wright (author) (1930–2016), American non-fiction writer", "*William Wright (Indian civil servant) (1895–1990), British World War I flying ace", "*William Wright (Medal of Honor recipient) (1835 - ?), Medal of Honor Recipient ", "*William Wright (New Jersey politician) (1794–1866), mayor of Newark, New Jersey and U.S. Senator", "*William Wright (Australian politician) (1816–1877), British Army officer and politician in colonial Victoria", "*William Wright (Canadian politician) (1853–1926), Canadian Member of Parliament, Muskoka", "*William Wright (Scottish politician) (1862–1931), Member of Parliament for Rutherglen, 1922–1931", "*William Wright (Northern Ireland politician) (born 1925), Unionist politician", "*William Wright (priest) (1563–1639), English Catholic missionary priest", "*William Wright (missionary) (1837–1899), Irish missionary in Damascus ", "*William Wright (Canadian bishop) (1904–1990), Canadian Anglican bishop ", "*William Wright (Australian bishop) (born 1952), bishop of Maitland-Newcastle", "*William Wright (botanist) (1735–1819), Scottish physician and botanist", "*William Wright (surgeon) (1773–1860), English aural surgeon", "*William Wright (engineer) (c. 1880), American railway engineer", "*William Wright (cricketer, born 1841) (1841–1916), English cricketer", "*William Wright (cricketer, born 1909) (1909–1988), English cricketer", "*William Wright (footballer) (1893–1945), English footballer for Exeter City and Huddersfield Town", "*William Wright (privateer) (), English privateer and buccaneer", "*William Wright (orientalist) (1830–1889), professor of Arabic at the University of Cambridge", "*William Wright (master), English academic", "*William Wright (journalist), founder of the London-based think tank New Financial", "*Dan DeQuille (1829–1898), pseudonym for William Wright, American journalist", "*Rasty Wright (outfielder) (1863–1922), born William Wright, American baseball player"]}, {"page": "Thomas Thomson (chemist)", "response": ["In 1802 he began teaching Chemistry in Edinburgh. In 1805 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Robert Jameson, William Wright, and Thomas Charles Hope."]}, {"page": "Wrightia", "response": ["The genus was named for William Wright (1735-1819), Scottish physician and botanist, by Robert Brown."]}, {"page": "Richard Pulteney", "response": ["In 1793 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Daniel Rutherford, Dr Alexander Monro, and William Wright."]}, {"page": "List of authors of South African botanical taxa", "response": ["*William Wright (1735–1819) S ........ W.Wright"]}, {"page": "Wernerian Natural History Society", "response": ["*William Wright, M.D., F.R.S.S. (London and Edinburgh), A.L.S."]}, {"page": "William Wallace (mathematician)", "response": ["In 1804 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were John Playfair, Thomas Charles Hope and William Wright."]}, {"page": "William Lochead", "response": ["In 1791 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were John Walker, William Wright and Daniel Rutherford."]}, {"page": "Greyfriars Kirkyard", "response": ["* William Wright (1735–1819) botanist"]}, {"page": "Griffith Hughes", "response": [":Other authors: James Grainger, William Wright, and Benjamin Moseley"]}, {"page": "List of fellows of the Royal Society W, X, Y, Z", "response": ["|William Wright||12/03/1778||March 1735 – 19 September 1819"]}, {"page": "Alexander Anderson (botanist)", "response": ["In January 1791 he was elected a Fellow of the Royal Society of Edinburgh, proposed by Daniel Rutherford, John Walker and William Wright. In the same year he went into Guiana on a botanising expedition; the plants he obtained being sent to Banks, are now in the herbarium of the British Museum. He was also elected to the American Philosophical Society in that year."]}, {"page": "Simarouba amara", "response": ["Simarouba amara was first described by Jean Baptiste Christophore Fusée Aublet in French Guiana in 1775 and is the type species of the genus Simarouba. In 1790, William Wright described Quassia simarouba, which Auguste Pyrame DeCandolle suggested was the same species as S. amara. However, because S. amara was described as monoecious by Aublet and Q. simarouba was described as dioecious by Wright, they were still regarded as separate species in 1829. By 1874, when the Flora Brasiliensis was published, they were considered synonymous."]}, {"page": "W.Wright", "response": ["#REDIRECT William Wright (botanist)"]}, {"page": "List of botanists by author abbreviation (W–Z)", "response": ["* W.Wright – William Wright (1735–1819)", "* W.W.Sm. – William Wright Smith (1875–1956)"]}, {"page": "William Saunders (physician)", "response": ["In 1790 he was elected a Fellow of the Royal College of Physicians, to whom he delivered the Goulstonian Lecture of 1792 on diseases of the liver. In 1792 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Daniel Rutherford, William Wright and Andrew Duncan, the elder."]}, {"page": "List of presidents of the Royal College of Physicians of Edinburgh", "response": ["| Dr William Wright"]}, {"page": "John Drummond of Jamaica", "response": ["Drummond appears to have made frequent returns to Britain, and seems to have had families in each country. He was elected a Fellow of the Royal Society of Edinburgh in 1789. His proposers were William Wright, James Gregory, and Prof Alexander Hamilton. His contribution to the Society (which usually then required a degree of public speaking and presentation to other Fellows) is not clear."]}, {"page": "List of fellows of the Royal Society elected in 1778", "response": ["# William Wright (1735–1819), botanist"]}, {"page": "Robert Hamilton (advocate)", "response": ["In 1795 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Allan Maconochie, Lord Meadowbank, William Wright, and Alexander Keith of Ravelston. In 1799 he successfully pursued William Hamilton of Wishart’s claim to the title of Lord Belhaven."]}, {"page": "Robert Townson (natural historian)", "response": ["In 1787 Townson was studying under the chemist Balthasar Georges Sage at the École des Mines. In 1788 he became a student at the University of Edinburgh. He was elected a Fellow of the Royal Society of Edinburgh in 1791, proposed by James Hutton, Alexander Monro (secundus) and William Wright."]}, {"page": "James Muttlebury", "response": ["In 1819 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were fellow-botanists Robert Jameson, William Wright, and Hugh Murray."]}, {"page": "Alexander Philips Wilson Philip", "response": ["He was educated at the High School in Edinburgh then studied medicine at the University of Edinburgh gaining his doctorate (MD) in 1792 and then taking up practice in the city. Early influences included Alexander Adams and he also studied under William Cullen. He became a Fellow of the Royal Medical Society in 1791 and received his doctorate in 1792 with a thesis on an experimental esay on the process of digestion. He conducted several experimented on himself, having orange juice and forcing himself to vomit it the next day to examine the state of digestion.  In 1795, aged 25, he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Alexander Monro (secundus), Andrew Duncan, the elder, and William Wright. In 1797 he was elected President of the Royal Medical Society."]}, {"page": "Campanula alaskana", "response": ["Campanula alaskana is a species of flowering plant in the family Campanulaceae, native to north-western North America (the Aleutian Islands, Alaska, the Yukon, British Columbia, Washington state). It was first described by Asa Gray in 1886 as Campanula rotundifolia var. alaskana and elevated to a full species by William Wright in 1918."]}, {"page": "Johann Gottfried Schmeisser", "response": ["In 1794 he was elected a Fellow of the Royal Society of London, his proposer being Joseph Banks. In 1795 he was elected a Fellow of the Royal Society of Edinburgh during his tour of Scotland. His proposers were John Rotherham, Andrew Duncan, the elder, and William Wright. He was also a member of the Linnean Society."]}, {"page": "Thomas Spens (physician)", "response": ["In 1803 he succeeded Dr William Wright as President of the Royal College of Physicians of Edinburgh, having previously served as the college Treasurer. Like his father he was a member of the Royal Company of Archers (the monarch's bodyguard in Scotland). He presented his father's yew bow to the Company where it remains on display.Paul, J. B. (1875). The history of the Royal Company of Archers: The Queen's body-guard for Scotland. Edinburgh: W. Blackwood. He was succeeded in his role as President by Charles Stuart of Dunearn."]}, {"page": "List of plant genera named for people (Q–Z)", "response": ["|data-sort-value=\"Wright\"|William Wright (1735–1819)"]}]}}