{"wiki_id": "http://www.wikidata.org/entity/Q727276", "itemLabel": "Stewart Jackson", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stewart_Jackson", "wikipedia_page": {"main": "Stewart James Jackson (born 31 January 1965) is a British politician and adviser. Jackson served as a Conservative Member of Parliament (MP) for Peterborough from 2005 to 2017. After being ousted by Labour's Fiona Onasanya at the 2017 general election, he served as Chief of Staff, and Special Adviser to David Davis, Secretary of State for Exiting the European Union, until July 2018 when Davis resigned his position.", "link_mentions": [{"page": "Peterborough", "response": ["The city formed a parliamentary borough returning two members from 1541, with the rest of the Soke being part of Northamptonshire parliamentary county. The Great Reform Act did not affect the borough, although the remaining, rural portion of the Soke was transferred to the northern division of Northamptonshire.Formally the Representation of the People Act 1832 (2 & 3 Will. IV c.45). In 1885, the borough's representation was reduced to one member,Under the Redistribution of Seats Act 1885 (48 & 49 Vict. c.23). and in 1918, the boundaries were adjusted to include the whole Soke.Youngs, Frederic A. Guide to the Local Administrative Units of England Volume II: Northern England (Part III: Parliamentary Constituencies) Royal Historical Society, London, 1991. Recent Members of Parliament for Peterborough have included the Conservative Sir Harmar Nicholls (1950–1974), Labour's Michael Ward (1974–1979), Conservative Brian Mawhinney (1979–1997), Labour's Helen Clark (1997–2005) and Conservative Stewart Jackson, from 2005. Fiona Onasanya won the 2017 general election for Labour; Onasanya was then expelled from the Labour party in December 2018, but kept her seat as an independent until being ejected on 1 May 2019 after a recall petition, triggering a by-election,Fiona Onasanya no longer Peterborough's MP . Accessed 22 May 2019. which won by Labour's Lisa Forbes (June - November 2019). The current incumbent is Conservative Paul Bristow, who won the seat in the 2019 general election."]}, {"page": "Flag of the United Kingdom", "response": ["In November 2007 the then culture minister Margaret Hodge said she would consider a redesign of the Union Flag to incorporate the Welsh dragon, during a debate in the House of Commons on the frequency with which the flag flies above public buildings. The issue was initially raised by Ian Lucas, another Labour MP, who complained that the flag introduced in 1606 following the accession of James VI of Scotland to the English throne as James I combined the cross of St George and the saltire of St Andrew. This principle continued in 1801 when the St Patrick cross was incorporated following the Union with Ireland Act 1800. Lucas claimed the identity of Wales had been suppressed ever since the Laws in Wales Acts 1535–1542. In the debate, Albert Owen MP said that \"we in Wales do not feel part of the union flag because the dragon or the cross of St David is not on it.\"Wintour, Patrick (28 November 2007).  \"Minister proposes a redesign for the union flag\", The Guardian Conservative MP Stewart Jackson described the comments as \"eccentric\".Cleland, Gary (27 November 2007). \"Union Jack should include Welsh flag, says MP\", Daily Telegraph"]}, {"page": "Helen Clark (British politician)", "response": ["Helen Rosemary Clark (née Dyche; born 23 December 1954) is an English politician.Dod's parliamentary companion She was the Labour Member of Parliament for the Peterborough constituency from 1997 until the 2005 general election, when she lost her seat to Conservative  Stewart Jackson."]}, {"page": "Action Medical Research", "response": ["Their current appeal 'Touching Tiny Lives' is raising money for research to prevent premature births, and pre-eclampsia and other life-threatening complications of pregnancy. It also aims to improve treatments for babies requiring special care. Supported by celebrities including Tony Hadley and Martin Fry, the campaign had raised almost £4 million by March 2009.Parliamentary Information Management Services: Early Day Motion 1762: Touching Tiny Lives campaign and pre-term birth (accessed 28 September 2007) Action Medical Research is also involved in lobbying the UK government to increase funding for research in these areas, which has led to an early day motion from Stewart Jackson, MP, signed by a total of 69 MPs."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Peterborough || Stewart Jackson || Conservative || Helen Clark || Labour"]}, {"page": "Peterborough (UK Parliament constituency)", "response": ["Helen Clark (née Brinton) won the seat for Labour in 1997. She was defeated by Conservative candidate Stewart Jackson at the 2005 election, following which it was widely reported that Clark was planning to defect to the Conservative Party, an announcement which was not popular locally.POLITICS: 'A slap in the face' Peterborough Evening Telegraph, 9 May 2005  However, by early June it emerged that while she had left the Labour Party, she had not in fact joined the Conservatives and did not intend to.Moss, Stephen Thrown out of the house The Guardian, 1 June 2005", "|| Stewart Jackson || Conservative"]}, {"page": "2005 United Kingdom general election", "response": ["|Stewart Jackson"]}, {"page": "Votes at 16", "response": ["In 2008 members of the coalition met a few MPs ahead of the second reading of the Voting Age (Reduction) Bill in the UK Parliament, but the bill was talked down by Stewart Jackson, Conservative MP for Peterborough. The Labour Party's Conference in 2008 voted to accept the recommendation of Labour's National Policy Forum to support Votes at 16."]}, {"page": "List of United Kingdom MPs: J", "response": ["*Stewart Jackson"]}, {"page": "Chatham House Grammar School", "response": ["* Stewart Jackson, Conservative MP for Peterborough (2005–2017)"]}, {"page": "London Nautical School", "response": ["* Stewart Jackson, politician and adviser"]}, {"page": "Peterborough City Council", "response": ["On Thursday 23 June 2016 Peterborough voted in the 2016 EU Referendum under the provisions of the European Union Referendum Act 2015 where voters were asked to decide on the question \"Should the United Kingdom remain a member of the European Union or leave the European Union?\" by voting for either \"Remain a member of the European Union\" or \"Leave the European Union\". The result produced a large \"Leave\" majority by 61% of voters on a turnout of 72% across the city with only the wards of Peterborough Central, Barnack and late postal votes in the city council area returning \"Remain\" votes and all other wards returning \"Leave\" majority votes. The then local MP Stewart Jackson backed \"Leave\", whereas local MP Shailesh Vara campaigned for a \"Remain\" vote."]}, {"page": "Stewart James Jackson", "response": ["#REDIRECT Stewart Jackson"]}, {"page": "Jackson Stewart", "response": ["*Stewart Jackson (born 1965), British politician, Conservative MP"]}, {"page": "HM Prison Peterborough", "response": ["HMP Peterborough was built on the site of the former Baker Perkins engineering works. The prison opened in 2005, despite a great deal of protest from local residents. The Prison Service claimed at the time that Peterborough as a 'mixed-use' prison would become a blueprint for the prisons of the future. Peterborough Prison was soon involved in controversy however, when the jail advertised to recruit 2 holistic therapists to offer reflexology, aromatherapy and Indian head massages to inmates. The MP for Peterborough, Stewart Jackson accused the prison of pampering inmates and sending out the wrong message to hard-working families."]}, {"page": "Blair Babe", "response": ["| 11. || Helen Clark, Helen Brinton at the time || Peterborough || 1997 || 2005 || Lost seat to Conservative Stewart Jackson"]}, {"page": "Knighthood of Salman Rushdie", "response": ["Conservative MP Stewart Jackson (the chairman of the all-party group on Pakistan) spoke against the honour, saying \"We do not need a situation where we are gratuitously offending our allies in the fight against terror. I think the prime minister's office should think very carefully about that decision.\""]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Stewart Jackson; MP for Peterborough (2005–2017) "]}, {"page": "Jackson (name)", "response": ["*Stewart Jackson (born 1965), British politician and adviser"]}, {"page": "List of expenses claims in the United Kingdom parliamentary expenses scandal", "response": ["*Stewart Jackson (Shadow Communities Minister/Conservative, Peterborough) – reported to have claimed £11,000 in 'professional fees' and over £300 for maintaining the swimming pool at his home. When questioned, Jackson admitted that the swimming pool claim could be \"construed as excessive\" and as such would repay the money."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Peterborough||style=\"background-color: \"| ||Conservative||style=\"background-color: \"| ||Stewart Jackson (C)||Seat held"]}]}}