{"wiki_id": "http://www.wikidata.org/entity/Q7279340", "itemLabel": "Rachel Nicholls", "itemDescription": "British soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Rachel_Nicholls", "wikipedia_page": {"main": "Rachel Nicholls is an English soprano in opera and concert.", "link_mentions": [{"page": "English Touring Opera", "response": ["*2006: Autumn: Baroque Festival Tour: ETO mounted a baroque opera festival with over 40 complementary events in twelve venues throughout the UK. Orfeo by Claudio Monteverdi, with Katherine Manley as Music and Euridice and Hal Cazalet as Orfeo; Erismena by Francesco Cavalli, with Andrew Slater as Erimante and Rachel Nicholls as Erismena; Jephté by Giacomo Carissimi with David Stout as Jephté and Jane Harrington as Filia; Dido & Aeneas by Henry Purcell with Joana Thomé as Dido and Patricia Orr as Sorceress; and Tolomeo by George Frederick Handel with Jonathan Peter Kenny as Tolomeo and Iestyn Morris as Alessandro"]}, {"page": "Rachel Nichols", "response": ["*Rachel Nicholls, English soprano"]}, {"page": "Nicholls (name)", "response": ["* Rachel Nicholls, English soprano"]}, {"page": "Bach Collegium Japan", "response": ["* Rachel Nicholls"]}, {"page": "Meine Seufzer, meine Tränen, BWV 13", "response": ["* J. S. Bach: Cantatas Vol. 42, Masaaki Suzuki, Bach Collegium Japan, Rachel Nicholls, Robin Blaze, Gerd Türk, Peter Kooy, BIS 2008"]}, {"page": "Wir müssen durch viel Trübsal, BWV 146", "response": ["* J. S. Bach: Cantatas Vol. 19 (Cantatas from Leipzig 1724), Masaaki Suzuki, Bach Collegium Japan, Rachel Nicholls, Robin Blaze, Gerd Türk, Peter Kooy, BIS 2008"]}, {"page": "Madeleine Mitchell", "response": ["* Rachel Nicholls, soprano"]}, {"page": "Grange Park Opera", "response": ["Singers who have performed with Grange Park Opera include Bryn Terfel, Simon Keenlyside, Joseph Calleja, Claire Rutter, Rachel Nicholls, Bryan Register, Susan Gritton, Wynne Evans, Sally Matthews, Alfie Boe, Robert Poulton, Jeffrey Lloyd-Roberts, Sara Fulgoni, Clive Bayley and Alistair Miles. In recent years, the repertoire has included musicals: Fiddler on the Roof in 2015 and Oliver! in 2016. Fiddler on the Roof was subsequently staged in the Royal Albert Hall as part of the 2015 BBC Proms."]}, {"page": "Peter Pan (1950 musical)", "response": ["In September 2008 the world premiere performance of the full Bernstein score was performed in concert with Alexander Frey conducting the Gulbenkian Orchestra, with dialogue adapted from the original J. M. Barrie play by Nina Bernstein Simmons. Three performances were given in Cascais, Portugal, for a combined audience of over 10,000 people, and featured Geraldine James (narrator), John Sackville-West (Peter Pan), Charlotte Ellett and Rachel Nicholls (Wendy) and Nicholas Lester (Captain Hook)."]}, {"page": "Une voix dans le désert", "response": ["* Elgar – Bax – For the Fallen, 2016 (CD HLL7544) recording live 7 April 2016 orchestra and choir The Hallé, cond. Mark Elder, recording including \"The Spirit of England\", Op. 80 (The Hallé, Elder Mark, soprano Rachel Nicholls), \"Grania and Diarmid\", Op. 42 (mezzo-soprano Shaw Madeleine) and Arnold Bax In Memoriam (only for orchestra) always 2016"]}, {"page": "Silla (opera)", "response": ["*Principal singers: James Bowman (Silla), Joanne Lunn (Lepido), Simon Baker (Claudio), Rachel Nicholls (Metella), Natasha Marsh (Flavia), Elizabeth Cragg (Celia), Christopher Dixon (The god)"]}, {"page": "Gott fähret auf mit Jauchzen, BWV 43", "response": ["* J. S. Bach: Cantatas Vol. 44, Masaaki Suzuki, Bach Collegium Japan, Rachel Nicholls, Robin Blaze, Gerd Türk, Peter Kooy, BIS 2008"]}, {"page": "Carolyn Sampson", "response": ["In 2007, she recorded with Suzuki Bach's Mass in B minor, with Rachel Nicholls, Robin Blaze, Gerd Türk and Peter Kooy. A review noted: \"The soloists are uniformly strong, and are major names in Bach performance. Carolyn Sampson leads the sopranos with a tone at once rich but still pure\"."]}, {"page": "List of people from Bedford, England", "response": ["* Rachel Nicholls, soprano in opera and concert"]}, {"page": "Wasfi Kani", "response": ["Singers who have performed with the company include Bryn Terfel, Simon Keenlyside, Joseph Calleja, Claire Rutter, Rachel Nicholls, Bryan Register, Susan Gritton, Wynne Evans, Sally Matthews, Alfie Boe, Robert Poulton, Jeffrey Lloyd-Roberts, Sara Fulgoni, Clive Bayley and Alastair Miles. The festival has also included musicals with productions of Fiddler on the Roof in 2015 and Oliver! in 2016. Fiddler on the Roof was subsequently staged in the Royal Albert Hall as part of the 2015 BBC Proms."]}]}}