{"wiki_id": "http://www.wikidata.org/entity/Q7274104", "itemLabel": "R. W. H. T. Hudson", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/R._W._H._T._Hudson", "wikipedia_page": {"main": "Ronald William Henry Turnbull Hudson (16 July 1876 – 20 September 1904) was a British mathematician.  \nRonald W.H.T. Hudson was considered in his day to be the most gifted geometer in all of Cambridge.  Hudson's life was cut short when he died in a mountaineering accident at the age of 28, but his posthumously-published book Kummer's Quartic Surface allows mathematicians today access to his work.He was the son of W.H.H. Hudson, Professor of mathematics at King's College London. Hudson's sister, Hilda Hudson was likewise a gifted mathematician, being a graduate of Newnham, a lecturer at the University of Berlin, and ultimately being awarded the O.B.E. in 1919.\n\n", "link_mentions": [{"page": "1904", "response": ["** R. W. H. T. Hudson, British mathematician (born 1875)"]}, {"page": "G. H. Hardy", "response": ["After schooling at Cranleigh, Hardy was awarded a scholarship to Winchester College for his mathematical work. In 1896, he entered Trinity College, Cambridge. After only two years of preparation under his coach, Robert Alfred Herman, Hardy was fourth in the Mathematics Tripos examination.In the 1898 Tripos competition, R. W. H. T. Hudson was 1st, J. F. Cameron was 2nd, and James Jeans was 3rd. \"What became of the Senior Wranglers?\" by D. O. Forfar Years later, he sought to abolish the Tripos system, as he felt that it was becoming more an end in itself than a means to an end. While at university, Hardy joined the Cambridge Apostles, an elite, intellectual secret society."]}, {"page": "Ernst Kummer", "response": ["* R. W. H. T. Hudson, Kummer's Quartic Surface, Cambridge, [1905] rept. 1990."]}, {"page": "Ronald Hudson", "response": ["#REDIRECT R. W. H. T. Hudson"]}, {"page": "Ronald Hudson (mathematician)", "response": ["#REDIRECT R. W. H. T. Hudson"]}]}}