{"wiki_id": "http://www.wikidata.org/entity/Q7271264", "itemLabel": "Quentin Gibson", "itemDescription": "physiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Quentin_Gibson", "wikipedia_page": {"main": "Quentin Howieson Gibson FRS (December 9, 1918 – March 16, 2011) was a Scottish American physiologist, and professor at University of Sheffield, and Cornell University.", "link_mentions": [{"page": "List of biologists", "response": ["*Quentin Gibson (1918–2011), British-American biochemist known for work on haem proteins"]}, {"page": "List of biochemists", "response": ["* Quentin Gibson FRS (1918–2011). British-American biochemist at Sheffield and later Cornell who worked on haem proteins. Member Natl. Acad. Sci. USA."]}, {"page": "Stopped-flow", "response": ["Stopped-flow is an experimental technique for studying chemical reactions with a half time of the order of 1 ms, introduced by Britton Chance and extended by Quentin Gibson (Other techniques, such as the temperature-jump method, are available for much faster processes.)"]}, {"page": "List of members of the National Academy of Sciences (Biochemistry)", "response": ["|Quentin Gibson (d)"]}, {"page": "List of physiologists", "response": ["* Quentin Gibson"]}, {"page": "Mabel Hokin", "response": ["Mabel worked as a technician in the Medical Research Council Unit for Research in Cell Metabolism under Hans Krebs at the University of Sheffield from 1943 to 1946, and enrolled as a student in 1946, continuing to work for Krebs. Krebs recognized Mabel's scientific mind and talent in the laboratory, and urged her to pursue doctoral work, which she began in 1949 after receiving her Bachelor of Science Honors degree in Physiology. She did her graduate research under Quentin Gibson in the Physiology department. In a short time, Mabel met Krebs' graduate student Lowell Hokin, and the two began a romantic as well as professional relationship. Mabel received her Ph.D. in 1952."]}, {"page": "Quentin Howieson Gibson", "response": ["#REDIRECTQuentin Gibson"]}, {"page": "Jane Gibson", "response": ["Whilst at the University of Sheffield, Audrey Jane Pinsent met her future husband, biochemist Quentin Gibson, in 1951. They married and had four children. Now Jane Gibson, she continued working part-time. In 1963, they emigrated to the United States, where she took up positions, first at the University of Pennsylvania and then, three years later, at the Section of Microbiology at Cornell University where, in 1970, she was made Associate Professor and served as Acting Chairman. Gibson later moved to the Section of Biochemistry, Molecular and Cell Biology, and was promoted to full Professor in 1979."]}]}}