{"wiki_id": "http://www.wikidata.org/entity/Q7273649", "itemLabel": "R. Geraint Gruffydd", "itemDescription": "Welsh academic", "wikipedia_url": "https://en.wikipedia.org/wiki/R._Geraint_Gruffydd", "wikipedia_page": {"main": "Robert Geraint Gruffydd, FLSW, FBA (9 June 1928 – 24 March 2015) was a scholar of Welsh language and literature. From 1970 to 1979, he was Professor of Welsh Language and Literature at the University of Wales, Aberystwyth, and was made Emeritus Professor in 1993.", "link_mentions": [{"page": "June 9", "response": ["*1928 – R. Geraint Gruffydd, Welsh critic and academic (died 2015)"]}, {"page": "Dafydd ap Gwilym", "response": ["Dafydd ap Gwilym ( 1315/1320 –  1350/1370) is regarded as one of the leading Welsh poets and amongst the great poets of Europe in the Middle Ages. (Dafydd ap Gwilym scholar R. Geraint Gruffydd suggests  1315- 1350 as his dates; other scholars  place him a little later,  1320- 1370.)", "According to R. Geraint Gruffydd he died in 1350, a possible victim of the Black Death. Tradition says that he was buried within the precinct of the Cistercian Strata Florida Abbey, Ceredigion. This burial location is disputed by supporters of the Talley Abbey theory who contend that burial took place in the Talley Abbey Churchyard:"]}, {"page": "Aberystwyth University", "response": ["*R. Geraint Gruffydd, Chair of Welsh Language and Literature (1970–79)"]}, {"page": "Sheldon Vanauken", "response": ["*  Obituary for R. Geraint Gruffydd, a student friend at Oxford who wrote a poem in Welsh in memory of Jean Vanauken"]}, {"page": "National Library of Wales", "response": ["*R. Geraint Gruffydd (1980–1985)"]}, {"page": "R. Tudur Jones", "response": ["Most of Jones' publications were of an historical nature. Nevertheless, his theology and his opinions on doctrine would surface regularly in his work. He was a firm Calvinist, and although it is tempting to classify him as evangelical (see also his fellow Welsh Christian scholars Bobi Jones and R. Geraint Gruffydd), he distanced himself from the pietistic evangelicalism that rose from the ashes of the 1904–1905 Welsh Revival. He opposed liberal theology and feared humanism's effect on the people of Wales."]}, {"page": "Bobi Jones", "response": ["*R. Geraint Gruffydd"]}, {"page": "R Geraint Gruffydd", "response": ["#REDIRECT R. Geraint Gruffydd"]}, {"page": "Literature Wales", "response": ["The Academi was initially formed as a Welsh language society in 1959, following a public discussion between Robert Maynard Jones and the poet Waldo Williams. The Academi attracted notable Welsh writers and academics into its society from the beginning, and while a Welsh language–only publication, had as its chairmen Iorwerth Peate (1959–1963), T. J. Morgan (1963–1966) and J. E. Caerwyn Williams (1966–1975). An English-language section was added in 1968 through the initiative of the editor and linguist Meic Stephens in his capacity as literature director of the Welsh Arts Council. The first chairman of the English-language section was Glyn Jones, who held the post until 1973. He was followed by Roland Mathias (1973–1978), G. O. Jones (1978–1981), Sam Adams (1981–1984), Tony Curtis (1984–1987), Gillian Clarke (1987–1993) and Sally Roberts Jones (1993–1997). The Welsh-language chairmen after J. E. Caerwyn Williams were R. M. Jones (1975–1978), Alun Llywelyn-Williams (1978–1982), R. Gerallt Jones (1982–1987), R. Geraint Gruffydd (1987–1990), Gwenlyn Parry (1990–1991), Harri Pritchard Jones (1991–1996) and Nesta Wyn Jones (1996–1998)."]}, {"page": "1928 in Wales", "response": ["*9 June – R. Geraint Gruffydd, academic and theologian (d. 2015)"]}, {"page": "Cambrian Archaeological Association", "response": ["* 1991 Dolgellau: Professor R. Geraint Gruffydd   "]}, {"page": "Geraint Gruffydd", "response": ["#Redirect R. Geraint Gruffydd"]}, {"page": "Learned Society of Wales", "response": ["*R. Geraint Gruffydd"]}, {"page": "Prof R Geraint Gruffydd", "response": ["#REDIRECTR. Geraint Gruffydd"]}, {"page": "2015 in the United Kingdom", "response": ["**R. Geraint Gruffydd, 86, celtist."]}, {"page": "2015 in Wales", "response": ["*24 March – R. Geraint Gruffydd, Celtic scholar, 86"]}, {"page": "Deaths in March 2015", "response": ["*R. Geraint Gruffydd, 86, Welsh celtist.Emeritus Professor R Geraint Gruffydd"]}, {"page": "J. Glyn Davies", "response": ["A book of poems, Cerddi Edern a cherddi ereill (published posthumously in 1955), includes acerbic satirical verses and many lyrics which, in the judgement of the critic R. Geraint Gruffydd, \"will undoubtedly live\".  In collaboration with D. E. Jenkins he also translated Ibsen's The Pretenders into Welsh as Yr Ymhonwyr (1922)."]}, {"page": "The Ruin (Dafydd ap Gwilym poem)", "response": ["\"The Ruin\" is Dafydd's only poem about a house, but it resembles six other poems of his, namely \"Summer\", \"A Cock-thrush\", \"A Magpie\", \"Longing\", \"A Woodcock\", and \"His Shadow\", in that it represents him in conversation with a non-human interlocutor.  This may not be not the only fantastic motif in the poem.  Dafydd twice uses the word teulu, \"horde\"; R. Geraint Gruffydd argued that this is a reference to the Phantom Horde of the mythological figure Gwyn ap Nudd.  By this interpretation the poem would compare the wind's destructive passage, stripping away the good old days, to Gwyn's horde.  Another critic sees it as implicit in the poem that the figure of the poet-figure is himself a ghost."]}, {"page": "The Woodland Mass", "response": ["The poem tells us that the thrush was sent from swydd goeth Gaer, a phrase which scholars have interpreted variously.  Ifor Williams and Thomas Parry were agreed in taking it to be Carmarthenshire, but it has alternatively been argued that it can be translated as the earldom of Chester, or, if a variant reading be accepted, the county of Caerleon.  There is also disagreement about the word geiriog, two lines later.  R. Geraint Gruffydd suggested that it was the name Ceirio, referring to a place in northern Ceredigion, and that the thrush was sent there, but Rachel Bromwich considered it to be the adjectival form of the noun gair, and translated it \"with eloquence\".  The thrush's course is directed, according to the poem, i Nentyrch.  W. J. Gruffydd identified this with Nannerch in Clwyd; Ifor Williams treated it as a corruption of yn entyrch, \"to the upper part of the valley\"; and R. Geraint Gruffydd called it an unidentified place-name."]}]}}