{"wiki_id": "http://www.wikidata.org/entity/Q727856", "itemLabel": "Stanley Middleton", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Middleton", "wikipedia_page": {"main": "Stanley Middleton FRSL (1 August 1919 – 25 July 2009) was a British novelist.\n\n", "link_mentions": [{"page": "August 1", "response": ["*1919 – Stanley Middleton, English author (d. 2009) "]}, {"page": "Booker Prize", "response": ["! Stanley Middleton"]}, {"page": "July 25", "response": ["*  2009   – Stanley Middleton, English author (born 1919)"]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|style=\"background:gold;white-space:nowrap\" | Stanley Middleton || style=\"background:gold;white-space:nowrap\" | Holiday || style=\"background:gold;white-space:nowrap\" | Hutchinson"]}, {"page": "Nadine Gordimer", "response": ["Gordimer collected the James Tait Black Memorial Prize for A Guest of Honour in 1971 and, in common with a number of winners of this award, she was to go on to win the Booker Prize. The Booker was awarded to Gordimer for her 1974 novel, The Conservationist, and was a co-winner with Stanley Middleton's novel Holiday. The Conservationist explores Zulu culture and the world of a wealthy white industrialist through the eyes of Mehring, the antihero. Per Wästberg described The Conservationist as Gordimer's \"densest and most poetical novel\". Thematically covering the same ground as Olive Schreiner's The Story of an African Farm (1883) and J. M. Coetzee's In the Heart of the Country (1977), the \"conservationist\" seeks to conserve nature to preserve the apartheid system, keeping change at bay. When an unidentified corpse is found on his farm, Mehring does the \"right thing\" by providing it a proper burial; but the dead person haunts the work, a reminder of the bodies on which Mehring's vision would be built."]}, {"page": "1919 in literature", "response": ["*August 1 – Stanley Middleton, English novelist (died 2009)"]}, {"page": "1974 in literature", "response": ["*Booker Prize: Nadine Gordimer, The Conservationist and Stanley Middleton, Holiday."]}, {"page": "Peter Bowles", "response": ["Bowles was born in London, England, the son of Herbert Reginald Bowles,Peter Bowles Biography (1936–). Filmreference.com. valet-companion and chauffeur to Drogo Montagu, son of the Earl of Sandwich, then a butler to the daughter of Lord Beaverbrook, and Sarah Jane (née Harrison), from Scotland, who served as a nanny to the family of the Duke of Argyll before coming to England and working for Beaverbrook's family, which is where they met. Upon the outbreak of the Second World War, Bowles's father was seconded to work as a chauffeur at Rolls-Royce in Nottingham, where the family lived in a small \"two-up, two-down\" house. Bowles attended Mapperley Plains Primary School, then at the Nottingham High Pavement Grammar School, where he was taught English by the novelist Stanley Middleton, and won a scholarship to train as an actor at the Royal Academy of Dramatic Art (RADA), where he is still an associate."]}]}}