{"wiki_id": "http://www.wikidata.org/entity/Q7288135", "itemLabel": "Ralph Sweet-Escott", "itemDescription": "Welsh rugby union player (1869-1907)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Sweet-Escott", "wikipedia_page": {"main": "Ralph Bond Sweet-Escott (11 January 1869 – 11 November 1907) was an English-born international rugby union half back who played club rugby for Cardiff and was capped three times for Wales. Sweet-Escott also played cricket for Glamorgan representing the county in the Minor Counties Cricket Championship. His brother, Edward Sweet-Escott, was a notable cricketer for Glamorgan.", "link_mentions": [{"page": "Essington", "response": ["* Ralph Sweet-Escott (1869 in Essington – 1907) an English-born international rugby union player, he also played cricket for Glamorgan"]}, {"page": "Penarth RFC", "response": ["*  Ralph Sweet-Escott"]}, {"page": "1907 in Wales", "response": ["*11 November – Ralph Sweet-Escott, English-born Wales rugby international and Glamorgan cricketer, 38"]}, {"page": "1894 in Wales", "response": ["**22 June / 23 June – Glamorgan play against the touring South Africans. The Glamorgan team contains three Wales rugby internationals, Billy Bancroft, Selwyn Biggs and Ralph Sweet-Escott."]}, {"page": "1869 in Wales", "response": ["*11 January – Ralph Sweet-Escott, English born, Wales rugby international (died 1907)"]}, {"page": "Edward Sweet-Escott", "response": ["Sweet-Escott's brother was Wales international rugby player Ralph Sweet-Escott; his brother-in-law was onetime Somerset cricketer William Hancock."]}, {"page": "1891 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), William McCutcheon (Swansea), Dickie Garrett (Penarth), David Gwynn (Swansea), George Thomas (Newport), Ralph Sweet-Escott (Cardiff), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), Sydney Nicholls (Cardiff), Tom Graham (Newport), William Bowen (Swansea), Walter Rice Evans (Swansea), David Daniel (Llanelli), Rowley Thomas (London Welsh), Willie Thomas (Llanelli) capt."]}, {"page": "1894 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Norman Biggs (Cardiff), Tom Pearson (Oldham), Jack Elliott (Cardiff), Dai Fitzgerald (Cardiff), Ralph Sweet-Escott (Cardiff), Fred Parfitt (Newport), Frank Mills (Swansea), Fred Hutchinson (Neath), David Daniel (Llanelli), Jim Hannan (Newport), Frank Hill (Cardiff) capt., Harry Day (Newport), David Nicholl (Llanelli), Wallace Watts (Newport)"]}, {"page": "1895 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), Tom Pearson (Cardiff), Owen Badger (Llanelli), Arthur Gould (Newport) capt., Thomas (Newport), David Morgan (Llanelli), Ralph Sweet-Escott (Cardiff), Albert Jenkin (Swansea), Arthur Boucher (Newport), Ernie George (Pontypridd), Jim Hannan (Newport), Harry Packer (Newport), Charles Nicholl (Llanelli), Frank Mills (Cardiff), Wallace Watts (Newport)"]}, {"page": "Hugh Ingledew", "response": ["In 1891 season, Ingledew was back in the Welsh squad when he was selected for the opening game of the 1891 Championship. Now under the captaincy of William Bowen, as Gould was working in the West Indies, Wales lost the match 7-3. Ingledew's final international game was the second match of the 1891 tournament against Scotland. Wales lost heavily by a goal and six tries and Ingledew, along with his half-back partner Ralph Sweet-Escott were dropped to be replaced by Swansea pairing, brother's Evan and David James."]}, {"page": "Fred Parfitt", "response": ["Parfitt was reselected for Wales for the 1894 Championship, but Welsh campaign had a terrible start when England beat them 24-3. Parfitt gained his only international points during this game when he scored a try, though the Welsh pack squabbled throughout the game, with Frank Hill working against the wishes of his captain Gould. After a win against Scotland, Parfitt saw his partnership at scrum-half change, when in the final game of the tournament against Ireland, Phillips was replaced by Cardiff's Ralph Sweet-Escott."]}, {"page": "Selwyn Biggs", "response": ["On 22 June 1894, Biggs was part of the Glamorgan team to face the touring South African cricket team at the Cardiff Arms Park. Biggs played alongside fellow rugby internationals Billy Bancroft and Ralph Sweet-Escott. Glamorgan lost by ten wickets, with Biggs taking two wickets, including Frank Hearne, for 76 runs in 24 overs."]}, {"page": "William McCutcheon", "response": ["McCutcheon began playing rugby with Swansea playing as a full-back but was brought onto the wing. It was as a wing that McCutcheon was selected to represent Wales when he was chosen for the second game of the 1891 Home Nations Championship. Played away to Scotland at Raeburn Place, McCutcheon was one of three new Welsh caps in the game, the others being Ralph Sweet-Escott at half-back and David Daniel in the pack. Wales lost the game 15–0, and McCutcheon lost his place in the next game to Tom Pearson, who McCutcheon himself had replaced the game before. At the end of the 1890/91 season he was again part of a Championship County winning team with Lancashire."]}, {"page": "Percy Phillips (rugby union)", "response": ["Phillips played just two more international games, both as part of the 1894 Home Nations Championship. Again linking up with Parfitt, Wales lost the first game of the competition, defeated heavily by England. Phillips was selected for the very next game against Scotland, which Wales won 7–0, all points coming from Cardiff's Dai Fitzgerald. Phillips was replaced by Ralph Sweet-Escott for the final game, against Ireland, his international career over."]}, {"page": "Ben Davies (rugby union)", "response": ["Despite playing no further part in the 1895 tournament, Davies was given another international cap the next year, again in the opening game of the tournament against England. This time Davies' half-back partner was Llanelli team mate David Morgan. The Welsh selectors often favoured less able half-back pairing which came from the same club team, giving a level of continuity to the back play. Morgan was first capped in the last game of the 1895 tournament, a home win over Ireland. Morgan was retained, while his partner Ralph Sweet-Escott was dropped to allow Davies another chance. Played away at Rectory Field in Blackheath, Wales were completely outclassed, losing 25-0. Neither Morgan or Davies were ever selected for Wales again."]}, {"page": "David Morgan (rugby union)", "response": ["Morgan first played international rugby when he was selected for the final game of the 1895 Home Nations Championship in a game against Ireland. Morgan was brought in as a replacement for Cardiff's Selwyn Biggs and was paired at half back with another Cardiff player, Ralph Sweet-Escott. Under the captaincy of Arthur 'Monkey' Gould, Wales faced Ireland in a 'wooden spoon' decider, with both countries having already lost against England and Scotland. Wales won the game 5-3, thanks to an inventive try from Tom Pearson. The next season the Welsh selectors kept faith with Morgan bringing him into the team for the opening game of the 1896 Championship. This time the selectors chose a Llanelli pairing, bringing in Ben Davies, to whom this was also his second international. The match was a sporting disaster for Wales, losing 25-0, and although the forwards took the brunt of the blame, the selectors also reacted by dropping both Morgan and Davies, neither of whom ever represented Wales again."]}, {"page": "Sweet-Escott", "response": ["* Ralph Sweet-Escott (1869–1907) English rugby union player"]}]}}