{"wiki_id": "http://www.wikidata.org/entity/Q7288155", "itemLabel": "Ralph Tester", "itemDescription": "British codebreaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Tester", "wikipedia_page": {"main": "Ralph Paterson Tester (2 June 1902 – May 1998) was an administrator at Bletchley Park, the British codebreaking station during World War II. He founded and supervised a section named the Testery for breaking Tunny (a Fish cipher).", "link_mentions": [{"page": "Bletchley Park", "response": ["The Lorenz messages were codenamed Tunny at Bletchley Park. They were only sent in quantity from mid-1942. The Tunny networks were used for high-level messages between German High Command and field commanders. With the help of German operator errors, the cryptanalysts in the Testery (named after Ralph Tester, its head) worked out the logical structure of the machine despite not knowing its physical form. They devised automatic machinery to help with decryption, which culminated in Colossus, the world's first programmable digital electronic computer. This was designed and built by Tommy Flowers and his team at the Post Office Research Station at Dollis Hill. The prototype first worked in December 1943, was delivered to Bletchley Park in January and first worked operationally on 5 February 1944. Enhancements were developed for the Mark 2 Colossus, the first of which was working at Bletchley Park on the morning of 1 June in time for D-day. Flowers then produced one Colossus a month for the rest of the war, making a total of ten with an eleventh part-built. The machines were operated mainly by Wrens in a section named the Newmanry after its head Max Newman."]}, {"page": "Colossus computer", "response": ["This technique would then be applied to other pairs of, or single, impulses to determine the likely start position of all five chi wheels. From this, the de-chi (D) of a ciphertext could be obtained, from which the psi component could be removed by manual methods. If the frequency distribution of characters in the de-chi version of the ciphertext was within certain bounds, \"wheel setting\" of the chi wheels was considered to have been achieved, and the message settings and de-chi were passed to the \"Testery\". This was the section at Bletchley Park led by Major Ralph Tester where the bulk of the decrypting work was done by manual and linguistic methods."]}, {"page": "Fish (cryptography)", "response": ["* Ralph Tester —    linguist and head of Testery"]}, {"page": "Lorenz cipher", "response": ["After this cracking of Tunny, a special team of code breakers was set up under Ralph Tester, most initially transferred from Alan Turing's Hut 8. The team became known as the Testery. It performed the bulk of the subsequent work in breaking Tunny messages, but was aided by machines in the complementary section under Max Newman known as the Newmanry.", "* Ralph Tester: linguist and head of Testery"]}, {"page": "TICOM", "response": ["* Ralph Tester, senior British codebreaker who worked on the TICOM project"]}, {"page": "Jerry Roberts", "response": ["Roberts was one of the four founding members of the Testery at Bletchley Park; the other two senior cryptanalysts were Major Denis Oswald and Captain Peter Ericsson, whilst head of the unit, Major Ralph Tester, was a linguist but not cryptanalyst. The Testery was tasked with breaking the Lorenz cipher code, named \"Tunny\" by the British. This was the Nazis' highest-level communications cipher system, which was used for communications between the Germany Army High Command in Berlin and their Army Commands in the field throughout occupied Europe, some of which were signed \"Adolf Hitler, Führer\". The cipher was Adolf Hitler's most secret code system and had 12 wheels against well-known 3 wheel Enigma; it was declassified in 2002, compared with Enigma in the 1970s."]}, {"page": "List of people associated with Bletchley Park", "response": ["* Ralph Tester, linguist, head of the Testery and member of a TICOM team (accountant with Unilever)"]}, {"page": "Testery", "response": ["The Testery was a section at Bletchley Park, the British codebreaking station during World War II. It was set up in July 1942 as the \"FISH Subsection\" under Major Ralph Tester, hence its alternative name. Four founder members were Tester himself and three senior cryptographers were Captain Jerry Roberts, Captain Peter Ericsson and Major Denis Oswald. All four were fluent in German. From 1 July 1942 on, this team switched and was tasked with breaking the German High Command's most top-level code Tunny after Bill Tutte successfully broke Tunny system in Spring 1942.", "* Ralph Tester linguist and head of Testery (not a codebreaker)"]}, {"page": "Signals intelligence in modern history", "response": ["The Lorenz messages were codenamed Tunny at Bletchley Park. They were only sent in quantity from mid-1942. The Tunny networks were used for high-level messages between German High Command and field commanders. With the help of German operator errors, the cryptanalysts in the Testery (named after Ralph Tester, its head) worked out the logical structure of the machine despite not knowing its physical form. They devised automatic machinery to help with decryption, which culminated in Colossus, the world's first programmable digital electronic computer. This was designed and built by Tommy Flowers and his team at the Post Office Research Station at Dollis Hill. The first was delivered to Bletchley Park in December 1943 and commissioned the following February. Enhancements were developed for the Mark 2 Colossus, the first of which was working at Bletchley Park on the morning of D-day in June. Flowers then produced one Colossus a month for the rest of the war, making a total of ten with an eleventh part-built. The machines were operated mainly by Wrens in a section named the Newmanry after its head Max Newman."]}, {"page": "Cryptanalysis of the Lorenz cipher", "response": ["The Testery was the section at Bletchley Park that performed the bulk of the work involved in decrypting Tunny messages. By July 1942, the volume of traffic was building up considerably. A new section was therefore set up, led by Ralph Tester—hence the name. The staff consisted mainly of ex-members of the Research Section, and included Peter Ericsson, Peter Hilton, Denis Oswald and Jerry Roberts. The Testery's methods were almost entirely manual, both before and after the introduction of automated methods in the Newmanry to supplement and speed up their work."]}, {"page": "Tester (surname)", "response": ["* Ralph Tester (1902–1998), head of the Testery, a British codebreaking station at Bletchley Park"]}, {"page": "Denis Oswald (codebreaker)", "response": ["Oswald served in the Intelligence Corps during the Second World War, initially as a private. He was commissioned as a second lieutenant in June 1941. In Autumn 1942, Oswald, alongside Ralph Tester, Jerry Roberts and Peter Ericsson, founded the Testery section at Bletchley Park."]}]}}