{"wiki_id": "http://www.wikidata.org/entity/Q7288000", "itemLabel": "Ralph Reader", "itemDescription": "actor (1903-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Reader", "wikipedia_page": {"main": "William Henry Ralph Reader  (25 May 1903 – 18 May 1982), known as Ralph Reader, was a British actor, theatrical producer and songwriter, known for staging the original Gang Show, a variety entertainment presented by members of the Scouting movement, and for leading community singing at FA Cup Finals.", "link_mentions": [{"page": "Peter Sellers", "response": ["Born in Southsea, Portsmouth, Sellers made his stage debut at the Kings Theatre, Southsea, when he was two weeks old. He began accompanying his parents in a variety act that toured the provincial theatres. He first worked as a drummer and toured around England as a member of the Entertainments National Service Association (ENSA). He developed his mimicry and improvisational skills during a spell in Ralph Reader's wartime Gang Show entertainment troupe, which toured Britain and the Far East. After the war, Sellers made his radio debut in ShowTime, and he eventually became a regular performer on various BBC radio shows. During the early 1950s, Sellers, along with Spike Milligan, Harry Secombe and Michael Bentine, took part in the successful radio series The Goon Show, which ended in 1960.", "In September 1943, he joined the Royal Air Force, although it is unclear whether he volunteered or was conscripted; his mother unsuccessfully tried to have him deferred on medical grounds. Sellers wanted to become a pilot, but his poor eyesight restricted him to ground staff duties. He found these duties dull, so auditioned for Squadron Leader Ralph Reader's RAF Gang Show entertainment troupe: Reader accepted him and Sellers toured the UK before the troupe was transferred to India. His tour also included Ceylon and Burma, although the duration of his stay in Asia is unknown, and Sellers may have exaggerated its length. He also served in Germany and France after the war."]}, {"page": "Tony Hancock", "response": ["In 1942, during the Second World War, Hancock joined the RAF Regiment. Following a failed audition for the Entertainments National Service Association (ENSA), he ended up on the Ralph Reader Gang Show. After the war, he returned to the stage and eventually worked as resident comedian at the Windmill Theatre, a venue which helped to launch the careers of many comedians at the time, and took part in radio shows such as Workers' Playtime and Variety Bandbox."]}, {"page": "Television Wales and the West", "response": ["The main opening programme came at 7:00 pm with The Stars Rise in the West, a filmed special introduced by It's That Man Again regular Jack Train. The programme, produced in association with ITN, featured appearances from Ralph Richardson, Stanley Baker (later a founder of TWW's successors, Harlech Television), Naunton Wayne, Donald Sinden, Tessie O'Shea, Donald Houston, Petula Clark, Tommy Cooper and Ralph Reader. Harry Secombe also appeared in a short film clip, performing Nessun Dorma."]}, {"page": "The Scout Association", "response": ["In 1929, the Boy Scouts Association hosted the 3rd World Scout Jamboree at Arrowe Park in Cheshire; some 56,000 Scouts from 35 countries attended, making it the largest World Scout Jamboree to date. The first Gang Show, produced by Ralph Reader, opened at the Scala Theatre in London in October 1932.Cohen pp. 29–30 Following the outbreak of World War II, over 50,000 Scouts trained under the National War Service scheme. Tasks undertaken included police messengers and stretcher bearers. The Air Scout branch was launched in January 1941, allowing Scout Troops to specialise in activities related to aircraft and flying. Lord Baden-Powell died in 1941 and was succeeded as the association's Chief Scout by Lord Somers.Cohen p. 36 Starting in 1944, the Scout International Relief Service (SIRS) sent teams of Rover Scouts and Scouters to continental Europe to provide humanitarian aid; ten SIRS teams worked at the recently relieved Bergen-Belsen concentration camp.Cohen p. 37"]}, {"page": "Dick Emery", "response": ["During the Second World War he was called up to the RAF and rose to the rank of corporal. However, because of family problems, he returned to London, joining the chorus line of The Merry Widow at the Majestic Theatre. He was recruited by Ralph Reader into the RAF Gang Show to entertain air and ground crew at bases in Great Britain."]}, {"page": "Crewkerne", "response": ["Thomas Coryat a traveller and writer of the late Elizabethan and early Jacobean age was born in Crewkerne around 1577. Mathematician John Caswell was also born here. A later traveller Colonel Joshua Fry was born in the town in 1699 before becoming a surveyor, adventurer, mapmaker, soldier, and member of the House of Burgesses, the legislature of the colony of Virginia. Another Englishman from Crewkerne who emigrated to the American Colonies was William Phelps who was born around 1599 and became one of the founders of both Dorchester, Massachusetts and Windsor, Connecticut, foreman of the first grand jury in New England, served most of his life in early colonial government, and played a key role in establishing the first democratic town government in the American colonies. Ralph Reader CBE an actor, theatrical producer and songwriter, best known for staging the original Gang Show, a Variety show for members of the Scouting Movement, was born in Crewkerne in 1903. The cricketer Michael Barnwell was born in the town in 1943."]}, {"page": "Graham Stark", "response": ["During the Second World War he served in 334 company of the BEF in Salonika, Greece, where he was a turner in group workshops.Michael Coveney \"Graham Stark obituary\", The Guardian, 31 October 2013 While there he first met Dick Emery, Tony Hancock and Peter Sellers, the latter two as fellow members of Ralph Reader's Gang Shows. Sellers would become a long-lasting close friend. With the Gang Shows, Stark toured the locations where military personnel were seeing active service. After the war he studied at the Royal Academy of Dramatic Art,Cheryl Mullin Graham Stark Obituary, Reading Post, 30 October 2013 and joined the regulars at Grafton's, a pub in Victoria run by Jimmy Grafton, a venue at which soon-to-be-prominent entertainers of the next few decades regularly gathered."]}, {"page": "Norbury", "response": ["* Ralph Reader (1903–1982), actor"]}, {"page": "Gang Show", "response": ["The format was created by Ralph Reader, who wrote material including the signature tune, \"Crest of a Wave\". Other standards Reader wrote include \"Strolling\", \"Great Great Game\", \"Gee, It's A Wonderful life\", \"Gee, It's Great To Be Young\", \"A Touch of Silver\", \"Three Cheers\", \"Show Time\", \"Together\", \"These are the Times\" and \"The Scout Hymn\".", "In 1937, the London show became the first amateur production to have a Royal Command Performance (an honour repeated in 1957 and 1964). A feature film called The Gang Show, starring Ralph Reader and The Gang, premièred at the Lyceum Theatre, London in April the same year, and in New York in December 1938.", "When the Gang Show started in London in 1932, Reader organised the cast as a Scout Troop; an arrangement which persists only in a few shows now, mainly in Australia and New Zealand. Members of the first troop wanted an identifying feature, deciding on a red scarf or necker. The red scarf has become a worldwide symbol, and to distinguish shows, an insignia in gold thread (UK: the initials GS in Reader's handwriting shot through with the show's name - AUS: usually a design related to the masks of comedy and tragedy and incorporating the show's name) is embroidered into the point of the scarf. Ralph Reader was originally called \"The Holborn Rover\" and was with the 4th Holborn Group whose scarf was half red and half green. Reader chose to have the gang show scarf red to be part of the 4th Holborn.", "Ralph Reader", "* Reader, Ralph Ralph Reader Remembers, Bailey Brothers and Swinfen [London], 1975", "*History of Ralph Reader and the Gang Show"]}, {"page": "Jim Davidson", "response": ["The son of a Scottish father from Glasgow and Irish mother from Cork, Davidson was born in Kidbrooke, London, and attended Kidbrooke Park Primary School, Blackheath, and St Austin's School in Charlton. Having impressed some acquaintances of his father with impressions of celebrities, he was chosen to appear in Ralph Reader's Gang Show at the Golders Green Hippodrome aged 12 and appeared on television in the Billy Cotton Band Show. He also briefly attended a stage school in Woolwich."]}, {"page": "Stan Tracey", "response": ["The Second World War meant that Tracey had a disrupted formal education, and he became a professional musician at the age of sixteen as a member of an ENSA touring group playing the accordion, his first instrument. He joined Ralph Reader's Gang Shows at the age of nineteen, while in the RAF and formed a brief acquaintance with the comedian Tony Hancock. Later, in the early 1950s, he worked in groups on the transatlantic liners Queen Mary and Caronia and toured the UK in 1951 with Cab Calloway. By the mid-1950s, he had also taken up the vibraphone, but later ceased playing it. At this time he worked widely with leading British modernists, including drummer Tony Crombie, clarinettist Vic Ash, the saxophonist-arranger Kenny Graham and trumpeter Dizzy Reece."]}, {"page": "Ralph reader", "response": ["#REDIRECT Ralph Reader "]}, {"page": "South Heighton", "response": ["Ralph Reader, originator of the Scouting Gang Show and Ursula Mommens, the great-granddaughter of Charles Darwin and the great-great-granddaughter of the potter Josiah Wedgwood."]}, {"page": "Scouting and Guiding in Victoria", "response": ["* Melbourne Gang Show, - started in 1953. \"Wonderful Life\", by Ralph Reader, is used as its signature tune. From its 25th season through to its 49th, cast and crew would also sing \"Touch of Silver\" after the curtain came down on the final performance, but in 2002, for the 50th Melbourne Gang Show, this was replaced by \"Golden Days\" with lyrics by John Jenkins and music by Alexandra Boemo and this new song continues to be used in this way."]}, {"page": "Denton, East Sussex", "response": ["Ralph Reader who created the Gang Show for the Scout movement was from the village and the local Scout group is known as \"The 2nd Denton & South Heighton (Ralph Reader's Own)\"."]}, {"page": "Golders Green Hippodrome", "response": ["Its capacity was reduced by half with the construction of a full theatre stage, and it began to be used for pre- and post-London tours, and has been used as a receiving venue for West End transfers - Laurence Olivier, Marlene Dietrich, Stephane Grappelli, Arthur Askey, Charlie Chester, Django Reinhardt and Chico Marx played there. Donald Swann's Wild Thyme played in 1955, and its regular performances included an annual pantomime and Ralph Reader's Gang Show."]}, {"page": "Milton Shulman", "response": ["Shulman received the IPA Award as Critic of the Year 1966. In 1956, he wrote a scathing review of a musical Wild Grows the Heather based on a J. M. Barrie play, The Little Minister. Directed by Ralph Reader who also wrote the lyrics, it received an ovation on its first night but Shulman and other critics knew that this was because Reader had given out first night tickets to the boys taking part in one of his Boy Scout productions and told them to go along and give the piece a good reception.  Among other things, Shulman said that the plot \"moved at the pace of cold porridge going uphill.\""]}, {"page": "Downe Scout Activity Centre", "response": ["Downe Camp, close to Orpington, opened in 1929 as a Scoutmasters' Training Ground. From 1933 it was available to Scout Groups and the site offered camping and some activities, including swimming. This was possible by the construction of a swimming pool which was funded by the proceeds from the very first Gang Show, which was organised by Ralph Reader for this very purpose."]}, {"page": "He's Got the Whole World in His Hands", "response": ["The song made the popular song charts in a 1957 recording by English singer Laurie London with the Geoff Love Orchestra, which reached #12 on the UK singles chart in late 1957.  The songwriting on London's record was credited to \"Robert Lindon\" and \"William Henry\", which were pseudonyms used by British writers Jack Waller and Ralph Reader, who had used the song in their 1956 stage musical Wild Grows the Heather. Wild Grows the Heather, Allmusic.com. Retrieved 25 February 2017 Wild Grows the Heather, OvertheFootlights.co.uk. Retrieved 25 February 2017"]}, {"page": "RADA Studios", "response": ["When the London Regiment was broken up and the battalions reallocated to other units in August 1937, the hall became the home of The Rangers, The King’s Royal Rifle Corps. During the Second World War the hall was used for Ralph Reader's Gang Shows."]}, {"page": "The Cox Twins", "response": ["Their career began with Steffani's Songsters and they then appeared in the Ralph Reader RAF Gang Shows during World War II, touring Europe and North Africa. Later they went into Variety, performing in summer seasons and pantomime. They married twins sisters, Estelle and Pauline Miles, who became part of their act. In 1972 they appeared as Tweedledum and Tweedledee in the film Alice's Adventures in Wonderland. Other films in which the twins appeared include Up Jumped a Swagman (1965) with Frank Ifield, and Funny Bones (1995) with Lee Evans and Jerry Lewis. Their numerous television appearances included Barrymore and The Story of Light Entertainment (2006) with Stephen Fry and Simon Cowell."]}, {"page": "Sandy Johnson (director)", "response": ["Johnson's father Alfred managed a hotel near Loch Lomond which was frequented by celebrities and film stars touring the UK. Betty Hutton stayed there when appearing at the Glasgow Empire in 1952, also the likes of Laurence Olivier and Vivien Leigh, Glynis Johns, Richard Todd (whose Irish Wolfhounds were bigger than him), Jack Train, Kenneth Wolstenholme, Ralph Reader and Terence Rattigan."]}, {"page": "Stars in Battledress", "response": ["Stars in Battledress encompassed all three services. The RAF had a group called the RAF Gang Show, which was organised by Ralph Reader (who had in the pre-war years produced the Boy Scout Gang Show). The Navy also produced many concert parties that performed both afloat and in onshore venues."]}, {"page": "9th World Scout Jamboree", "response": ["In conjunction with the Jamboree the Scouting Association promoted a week-long Gang Show at the Hippodrome Theatre in central Birmingham between 5 August and 10 August, led by Ralph Reader and featuring the full 150 strong cast from his London-based Gang Show. Buses were provided each evening to bus up to 500 campers into the city centre for the show."]}, {"page": "List of British films of 1937", "response": ["| The Gang Show || Alfred J. Goulding ||  Ralph Reader, Gina Malo || Musical ||"]}, {"page": "Tony Melody", "response": ["Initially as a dancer, Melody spent three years touring the Mediterranean with Ralph Reader's Gang Show, performing for British troops in various countries along with Tony Hancock and Norrie Paramor. In 1952 he spent a season performing at the Windmill Theatre in London, among the nudes, where he featured as a comedy singer, before returning to Yorkshire, where he performed semi-professionally in local clubs while working in a factory in Leeds during the day. In 1955 he appeared on What Makes A Star? on BBC local radio. He became a regular on BBC regional radio, working in the North region of the BBC Home Service from 1958 with, among others, Jimmy Clitheroe (who he also appeared with on stage, touring the Variety theatres) and with Harry Worth. With Clitheroe, he did a regular double-act on a radio variety show called Call Boy, as well as doing much the same act together on stage in the theatres."]}, {"page": "Scouting in North West England", "response": ["The Blackpool Gang Show was first staged in 1961. It has appeared at the Opera House, Grand Theatre & Pavilion Theatre, then from 2005, the Globe Theatre. It was visited by the Gang Show founder Ralph Reader at the Opera House. It has a cast of over 100 members from all sections of the Scout Association and Girlguiding UK along with leaders from both Associations.", "The Crewe Gang Show originated in 1938, although the South West Cheshire Scout District had been running an evening of entertainment for attendees of their Annual General Meeting for many years beforehand. In 1949, it was performed at the New Theatre, Crewe. This venue has continued to 2008, which will mark the 70th Anniversary. The Gang Show was awarded the privilege of using the coveted Red Necker in 1964. Ralph Reader, the man behind the original Gang Show held in 1931, visited the Crewe Gang Show in 1980, and wrote in a letter, \"With no hesitation, I say again, it was one of the finest Gang Shows I have ever seen\". The 2006 show included 23 Cub Scouts and 62 Scouts and Leaders as the cast, and many others as production crew."]}, {"page": "Derby Day (1952 film)", "response": ["* Ralph Reader ...  Bill Hammond "]}, {"page": "List of recipients of the Bronze Wolf Award", "response": ["| Ralph Reader"]}, {"page": "Scouting in South West England", "response": ["The Bristol Gang Show was held annually at The Bristol Hippodrome, in Bristol. In the 1930s there were two Boy Scout Revues. The Bristol Gang Show started in its current form in 1971, with a cast consisting of 85 Cubs and 59 adults, in the Victoria Rooms. It moved to the Bristol Hippodrome in 1972. In 1974 the Bristol Gang Show became Avon County Gang Show as the county of Bristol had become part of the Avon. In 1975 the show was awarded the Gang Show Emblem to wear on the red Gang Show neckerchiefs. Ralph Reader, who founded the Gang Show idea, came to see the show in 1978 and gave it much praise. In 1997 the show celebrated its Silver Jubilee, and regained its title of Bristol Gang Show. In 1999 girls were introduced into the junior cast, and now account for about half of the total junior cast.Bristol Gang Show The show is no longer a Gang Show, but has become the grass roots show of Avon Scouts on Stage and is open to all Scouting members in the county."]}, {"page": "Glamorous Night", "response": ["Glamorous Night was produced by Ivor Novello.  The musical opened at the Theatre Royal, Drury Lane in London on 2 May 1935 to robust ticket sales, but had a limited run due to the pre-booking of a pantomime at the theatre. It then toured in the British provinces before re-opening at the London Coliseum in May 1936 for another short run, for a total of 234 London performances.  The role of Anthony Allen was played by Novello, and that of the gypsy (Militza Hajos) was played by Mary Ellis.  It was directed by Leontine Sagan, with choreography by Ralph Reader.  The plot echoed current events in Rumania, where the king was willing to give up his reign to marry a Romany actress, Mme. Lupesco.Ellacott, Vivyan. \"London Musicals 1935-1939\", Over the Footlights, accessed 12 March 2013"]}, {"page": "New Wine Church", "response": ["The cinema was opened as the Odeon Theatre on 25 October 1937 with Ralph Reader in The Gang Show. It was designed for the Oscar Deutsch chain of Odeon Cinemas by architect George Cole who came up with a streamlined Art Deco style."]}, {"page": "Limelight (1936 film)", "response": ["* Ralph Reader as Ralph  ", "This drama musical romance features Arthur Tracy's street singing. The film's Dance Director was Ralph Reader. His work was so appreciated by Herbert Wilcox that he created a part for Reader to dance with Neagle in the actual film."]}, {"page": "Telegram messenger", "response": ["* Ralph Reader, founder of the Scout Gang Shows"]}, {"page": "List of Royal Variety Performances", "response": ["| From London Rhapsody, Len Lewis, George Lane, Raymond Newell, Henry Carlisle, Serge Ganjou, Henry Carlisle, Mary Young, Rosarito, George Ganjou, The Gypsy Boys Band, Norman Evans, Florence Desmond, Señor Wences, George Formby, Cicely Courtneidge with the Harry Dennis Dance Sexette and the Sherman Fisher Girls, Max Miller, Jack La Vier, Ethel Revnell and Gracie West, Ralph Reader's Gang Show, The London Palladium Gang Show, Gracie Fields, Will Fyffe", "| The Kaye Sisters, Max Bygraves, The George Carden Dancers, The George Mitchell Singers, The Goofers, Jimmy Logan, Harry Secombe with the Morriston Orpheus Choir, The Crazy Gang, Leo De Lyon, Gracie Fields, Dickie Henderson, Count Basie and his Orchestra, Ralph Reader and his Gang Show, Judy Garland, Jimmy Brooks, Bud Flanagan, Ben Lyon, Jerry Desmonde, Alfred Marks, Brian Reece, Mario Lanza, Norrie Paramor's Big Ben Banjo Band, Ronnie Hilton, Dickie Valentine, Malcolm Vaughan, Teddy Johnson, Dennis Lotis, Frankie Vaughan, David Whitfield, Herschel Henlere, Arthur Askey and Vera Lynn, Alicia Markova, Alma Cogan, The John Tiller Girls, Tommy Cooper, Winifred Atwell, Tommy Steele and his Steelmen.", "| The John Tiller Girls, Tommy Cooper, The Bachelors, Gil Dova, Cilla Black, Millicent Martin, Kathy Kirby, Brenda Lee, Dennis Spicer, Morecambe and Wise, Gracie Fields, The Moiseyev Dance Company, Ralph Reader's Gang Show, Jimmy Tarbuck, Cliff Richard & The Shadows, Bob Newhart, Lena Horne with the Chico Hamilton Quartette"]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Ralph Reader's Gang Show: 1937, 1957, 1964"]}, {"page": "List of Desert Island Discs episodes (1942–1946)", "response": ["|||Ralph Reader||No book||No item"]}, {"page": "A Night in Spain", "response": ["The show opened at the 44th Street Theatre on May 3, 1927, then transferred to the Winter Garden Theatre on October 10, 1927, and closed on November 12, 1927.  It was produced by the Shubert Brothers, directed by Gertrude Hoffmann and Charles Judels, with additional dances choreographed by Ralph Reader"]}, {"page": "Victor Rietti", "response": ["Due to popular demand, To Live in Peace was re-staged for television in early 1952 (BBC), 1956 (RAI), and again in 1957 (BBC), and was broadcast for radio as well in 1953 and 1956 with Rietti repeating his performance in all six productions, and his son Robert playing the part of Maso. In addition NBC's prestigious Kraft Theatre televised a special color broadcast of To Live in Peace in 1953 - the first of only two color broadcasts Kraft Theatre did in its eleven-year run. CBC Television televised it in 1957. Rietti's television success with To Live in Peace led to his touring internationally with the play for Ralph Reader. Samuel French bought the book rights to the play, and published it in 1952. Producer Sydney Box planned a motion picture of the play starring Rietti which never evolved. Eleven additional radio productions of the play were broadcast around the world. Rietti's overnight success led to his surprise appearance on the televised gala special Life Begins at Sixty and established him as a lead actor in television."]}, {"page": "The Blue Squadron (1934 film)", "response": ["* Ralph Reader as Verdi"]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Ralph Reader||Goodbye Mr Chips by James Hilton||Typewriter and paper|| more"]}, {"page": "Don Smoothey", "response": ["Smoothey joined the army at the outbreak of World War II and entertained troops as half of a double act with Len Marten.  In 1942, he became a member of the official army organization Stars in Battledress.  He left the service in 1946 and returned to civilian life and variety entertainment by appearing at The Grand, Clapham Junction.  During this time he used several stage names, including Don Maxwell and Chester Ladd.  He completed a long tour in the production of The Old Town Hall, which was followed by Ralph Reader's The Gangs All Here."]}]}}