{"wiki_id": "http://www.wikidata.org/entity/Q728503", "itemLabel": "Gifton Noel-Williams", "itemDescription": "British footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gifton_Noel-Williams", "wikipedia_page": {"main": "Gifton Ruben Elisha Noel-Williams (born 21 January 1980) is an English former footballer who played for Watford, Stoke and Burnley among other clubs. After a serious knee injury in 1999, he was affected by rheumatoid arthritis for much of the rest of his career. \nHe retired from professional football in 2010 and moved into coaching, briefly managing Burnham in 2016 and Codicote in 2017. He is currently interim manager of Watford Women.\n\n", "link_mentions": [{"page": "Luther Blissett", "response": ["In the summer of 2016, Blissett was appointed Director of Football at Burnham, briefly serving as caretaker after the departures of both Dave Tuttle and Gifton Noel-Williams."]}, {"page": "Eddie Johnson (English footballer)", "response": ["Johnson's move to Austin Aztex was finalised in March and completed their initial starting side, which included fellow English players Alex Tapp and Gifton Noel-Williams and Welshman Gareth Evans. Upon Johnson's transfer, team manager Adrian Heath said: \"I think it's fair to say that Eddie has lost his way recently and I hope we can get him back on the right path to where he is again one of the bright young players in English football.\" Johnson played in the club's first game, which was a 2–0 friendly defeat to Major League Soccer's New England Revolution and scored in another pre-season match. Johnson scored his first goal for Austin on 25 April against fellow expansion side the Cleveland City Stars when he scored in the 13th minute of play. Johnson scored his second goal in the final minute of the match. In the 2009 season, Johnson played 22 league matches, scoring five goals making him the Aztex leading goalscorer, but he was forced to miss part of the season because of work permit problems after he returned to England with Evans. Johnson also played in two of the Aztex's three US Open Cup matches, playing in the first round, scoring the second goal in a 2–0 win over Mississippi Brilla and in Austin's 2–0 defeat to Houston Dynamo in the third round. The Austin Chronicle named Johnson the city's best player. The newspaper's citation said: \"he's been out there hustling every game and providing leadership and a steadying influence on and off the field. At 24, with a background that includes Manchester United and English national youth teams, he might not be with us much longer, but it's a treat while it lasts.\" He went on to win one of the club's player of the season awards."]}, {"page": "DFW Tornados", "response": ["*  Gifton Noel-Williams"]}, {"page": "Burnham F.C.", "response": ["\"Football Weekly\" podcast. On 27 September, Burnham announced that former Watford player Gifton Noel-Williams would be taking over the managerial job at the club. He led the team to their first points of the season in October, but the club announced on 9 November that Noel-Williams had left the club. As a result, Blissett again took charge of the team."]}, {"page": "Regent High School", "response": ["* Gifton Noel-Williams, former professional footballer"]}, {"page": "Micah Hyde (footballer)", "response": ["At the end of the 2005–06 season, he was placed on the transfer list by Burnley manager Steve Cotterill along with three other players; Gifton Noel-Williams, Danny Karbassiyoon and Duane Courtney, but due to his efforts in pre-season was once again welcomed back to the first-team squad and taken off the list."]}, {"page": "Northwood F.C.", "response": ["In June 2016, the club appointed former Watford and Stoke City striker Gifton Noel-Williams as to be their Reserves and Under-18's manager. It was expected that there would be closer ties between the first team and the other age groups at the club, a vision spearheaded by chairman Ian Barry, however in early October Noel-Williams left his role and Dave Fox was re-appointed shortly after. Manager Mark Burgess suffered the blow of losing eight of the 2015-16 squad, including George Nicholas, Max Holland, player of the year Andy Lomas and captain Steve Brown to Harrow Borough in the summer of 2016."]}, {"page": "2002 FA Cup Final", "response": ["Arsenal entered the competition in the third round and was drawn to play Watford of the First Division. They took the lead in the eighth minute, where good play by Nwankwo Kanu allowed Thierry Henry to round goalkeeper Alec Chamberlain and tap the ball into the empty goal. The lead was doubled two minutes later: Kanu again found Henry, who \"unselfishly squared the ball to midfielder Freddie Ljungberg for another tap-in.\" Gifton Noel-Williams moments later halved the scoreline, heading the ball in from a Gary Fisken cross. After squandering numerous chances to increase their lead, Arsenal added a late third and fourth goal from Kanu and Dennis Bergkamp, before Marcus Gayle scored what was a mere consolation for Watford in stoppage time."]}, {"page": "Gifton Noel Williams", "response": ["#REDIRECT Gifton Noel-Williams"]}, {"page": "List of professional sports families", "response": ["|Gifton Noel-Williams"]}, {"page": "List of Stoke City F.C. seasons", "response": ["|align=left|Ade Akinbiyi, Gifton Noel-Williams", "|align=left|Gifton Noel-Williams"]}, {"page": "Alex Tapp", "response": ["In the late summer of 2008, Tapp moved to the United States and after seven months during which he acclimatised to the Texan weather and astroturf pitches, he joined the Austin Aztex ahead of their first season in the United Soccer Leagues First Division. He was the club's second English signing, following Gifton Noel-Williams, and joined another expatriate Adrian Heath, the manager of the side. "]}, {"page": "CD Jávea", "response": ["In January 2008 CD Jávea were featured on British television in a Sky Sports special called \"La Lower Liga\" which explored the impact of the British ex-pat community on football on Spain's Costa Blanca. Whilst CD Jávea was heavily featured, the programme also featured Gifton Noel-Williams who was playing for Second Division Elche CF at the time. A follow-up programme entitled \"La Lower Liga: The Second Half\" was broadcast in the summer of 2008. Also featured in the programmes were CD Jávea's international supporters club, the Peña Javeamigos."]}, {"page": "2009 Austin Aztex season", "response": ["| Gifton Noel-Williams"]}, {"page": "History of Millwall F.C.", "response": ["Further into the season due to injuries to players like Gary Alexander Jackett signed out of favour striker Jermaine Easter from Plymouth Argyle F.C. on an initial one-month loan deal, and former Burnley F.C. striker Gifton Noel-Williams on a short-term contract after being released from his contract by Spanish side Elche CF."]}, {"page": "History of Watford F.C.", "response": ["The ongoing financial difficulties saw a large number of players released that summer, including record signing Allan Nielsen and strikers Tommy Smith and Gifton Noel-Williams. To make matters worse, Manchester United loanee Davis was killed in a car-crash on the opening day of the new campaign. This had a huge effect on the team's form at the beginning of the season, and notably on his close friend Danny Webber. But a strong finish to the season saw the club finish in mid-table. The 2004–05 season saw a continuation of the good form of the end of the previous season, with the club well in the upper half of the Championship at the end of September. However, a long run of poor form subsequently saw the club drop steadily towards the relegation zone. Another good cup run further eased the club's financial position, with the team reaching the semi-final of the League Cup, soundly beating Premiership sides Portsmouth and Southampton on the way, before losing narrowly to Liverpool. The club's poor league form, however, came to a head in March, with a run of terrible performances and Lewington was sacked on the 22nd. His sacking was controversial, and many fans were unhappy at the loss of a man who had led the club to two cup semi finals in three seasons, enduring considerable financial hardships."]}, {"page": "1999 Football League First Division play-off Final", "response": ["Bolton's top scorer in the league was Bob Taylor who had fifteen goals for the season.  Gifton Noel-Williams was Watford's leading marksman with ten league goals, but had not featured for his club since suffering a fractured hip in January.  Mooney was second in the list of Watford's top scorers with nine league goals.  The match was broadcast live in the UK on Sky Sports 2 with highlights shown later that evening on ITV.  According to bookmakers Coral and Littlewoods, Bolton were favourites to win the match.  The match was estimated in the media to be worth around £10million to the winning team. The referee for the match was Terry Heilbron from Newton Aycliffe in County Durham."]}, {"page": "2003–04 Stoke City F.C. season", "response": ["Manager Tony Pulis made a number of alterations to his squad in the summer of 2003 as a number of players which helped Stoke gain promotion and subsequent survival left the club and in came several new players. These included experienced goalkeeper Ed de Goey, defenders Clint Hill and John Halls, midfielders John Eustace and Darel Russell and forwards Carl Asaba and Gifton Noel-Williams whilst the most notable departures was that of James O'Connor and fan favourite Sergei Shtanuk.", "|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Gifton Noel-Williams"]}, {"page": "2004–05 Stoke City F.C. season", "response": ["|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Gifton Noel-Williams"]}, {"page": "2002–03 Watford F.C. season", "response": ["The 2002–03 season marked Watford Football Club's third consecutive season in the Football League First Division, following relegation from the Premier League in the 1999–2000 season. The club was managed by its former reserve team manager Ray Lewington, following the dismissal of Gianluca Vialli at the end of 2001–02. The club finished 13th in the First Division, reached the semi-final of the FA Cup, and were eliminated in the first round of the League Cup. Watford were operating under severe financial constraints following the collapse of ITV Digital, and at the end of the season were forced to offload several first-team players, including Tommy Smith, Gifton Noel-Williams, Stephen Glass, and record signing Allan Nielsen."]}, {"page": "2006–07 Burnley F.C. season", "response": ["!scope=\"row\"|Gifton Noel-Williams ", "|21||FW|| Gifton Noel-Williams || Real Murcia || £50k || 24 January 2007"]}, {"page": "2005–06 Burnley F.C. season", "response": ["|15||FW|| Gifton Noel-Williams || Stoke City || Free || 14 June 2005", "|15||FW|| Gifton Noel-Williams || Brighton & Hove Albion || Loan || 23 March 2006"]}, {"page": "2001–02 Arsenal F.C. season", "response": ["Arsenal entered the FA Cup in the third round, in which they were drawn to play Watford of the First Division. They took the lead in the eighth minute, where good play by Kanu allowed Henry to round goalkeeper Alec Chamberlain and tap the ball into the net. The lead was doubled two minutes later: Kanu again found Henry, who \"unselfishly squared the ball to midfielder Freddie Ljungberg for another tap-in.\" Gifton Noel-Williams moments afterwards halved the lead, when Arsenal failed to deal with a corner; Noel-Williams headed the ball in from a Gary Fisken cross. After squandering numerous chances to increase their lead, Arsenal added a late third and fourth goal from Kanu and Bergkamp before Marcus Gayle scored what was a mere consolation for Watford in stoppage time. Arsenal faced cup holders Liverpool the following round, whom they lost to in the 2001 FA Cup Final. A solitary goal scored by Bergkamp in the 27th minute was enough for Arsenal to progress, in a match layered with controversy: Martin Keown, Bergkamp and Liverpool's Jamie Carragher were sent off in the space of ten minutes – the latter footballer for hurling back a coin at the crowd. Against Gillingham in the fifth round, Arsenal twice had their lead cancelled out, before Adams, making his long-awaited return, scored the match-winning goal."]}, {"page": "List of English football transfers summer 2003", "response": ["|27 May||Gifton Noel-Williams||||Watford||Stoke City||Free"]}, {"page": "2003–04 Watford F.C. season", "response": ["The ongoing financial difficulties saw a large number of players released that summer, including record signing Allan Nielsen and strikers Tommy Smith and Gifton Noel-Williams. To make matters worse, Manchester United loanee Jimmy Davis was killed in a car crash on the opening day of the new campaign. This had a huge effect on the team's form at the beginning of the season, and notably on his close friend Danny Webber. But a strong finish to the season saw the club finish in mid-table."]}]}}