{"wiki_id": "http://www.wikidata.org/entity/Q7285345", "itemLabel": "Raj Persaud", "itemDescription": "British psychiatrist and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Raj_Persaud", "wikipedia_page": {"main": "Rajendra 'Raj' Persaud FRCPsych (born 13 May 1963) is an English consultant psychiatrist, broadcaster and author of books about psychiatry. He is known for raising public awareness of psychiatric and mental health issues in the general media, has published five books and received numerous awards.\nIn October 2008, Persaud resigned from his position as consultant psychiatrist at the South London and Maudsley NHS Foundation Trust, following a three-month suspension by the General Medical Council for dishonesty in plagiarising other sources in his book From the Edge of the Couch.\n\n", "link_mentions": [{"page": "Obedience (human behavior)", "response": ["Raj Persaud, in an article in the BMJ, comments on Milgram's attention to detail in his experiment:"]}, {"page": "Waheed Alli, Baron Alli", "response": ["He is one of a group of highly successful Guyanese people in Britain (Michael White of The Guardian refers to them as the \"Guyanese mafia\"), which includes Raj Persaud, Herman OuseleyMichael White, \"Balls gets his retaliation in first as annual GCSE row begins\" , The Guardian, 27 August 2009. and David Dabydeen, Cynthia Pine, Keith Waithe and Rudolph Dunbar.Guyanese Achievers UK (2007) by Dindayal Vidur."]}, {"page": "Historical Jesus", "response": ["*It has been suggested by psychiatrists Oskar Panizza, George de Loosten, William Hirsch, William Sargant, Anthony Storr, Raj Persaud, psychologist Charles Binet-Sanglé and others that Jesus had a mental disorder or psychiatric condition. This theory is based on the fact that the Gospel of Mark (Mark 3:21) reports that When his family heard this they went out to restrain him, for they said, ″He is out of his mind.″New English Translation Psychologist Władysław Witwicki states that Jesus had difficulties communicating with the outside world and suffered from multiple personality disorder, which made him a schizothymic or even schizophrenic type.Karina Jarzyńska (racjonalista.pl), \"Jezus jako egocentryczny schizotymik\" (Polish) In 1998–2000 Polish author Leszek Nowak (born 1962) from Poznań authored a study in which, based on his own history of delusions of mission and overvalued ideas, and information communicated in the Gospels, made an attempt at reconstructing Jesus’ psycheLeszek Nowak, Prywatna Witryna Internetowa Leszka Nowaka at Internet Archive (Polish) with the view of the apocalyptic prophet.Analysis of fragments of the New Testament books for Jesus as apocalyptic prophet: Leszek Nowak, \"A great mistake and disappointment of early Christianity\" at Internet Archive (Polish)"]}, {"page": "City, University of London", "response": ["* Raj Persaud – British consultant psychiatrist, broadcaster, and author on psychiatry"]}, {"page": "Brian Deer", "response": ["In 2008, the media psychiatrist Raj Persaud was suspended from practising medicine and resigned his academic position after being found guilty of plagiarism following an investigation by Deer."]}, {"page": "List of people associated with University College London", "response": ["* Raj Persaud, Consultant Psychiatrist in General Adult and Community Psychiatry, Bethlem Royal & Maudsley Teaching Hospitals and Clinical Tutor to Bethlem & Maudsley Senior House Officers, since 1994", "* Raj Persaud, psychiatrist and broadcaster"]}, {"page": "Celebrity Poker Club", "response": ["* Raj Persaud"]}, {"page": "Visiting Gresham Professor", "response": ["| 6 || Dr Raj Persaud || Psychiatry ||1 Sep 2004"]}, {"page": "Criticism of Jesus", "response": ["A number of writers, including David Strauss, Lemuel K. Washburn, Oskar Panizza and Friedrich Nietzsche,Nietzsche, Friedrich, The Antichrist, § 31, 32. have questioned Jesus' sanity by claiming he was insane for believing he was God and/or the messiah. Psychologists and psychiatrists Georg Lomer, Charles Binet-Sanglé,  William Hirsch, Georges Berguer, Y. V. Mints,  Władysław Witwicki, William Sargant, Raj Persaud, and Anthony Storr, have said Jesus suffered from religious delusions and paranoia."]}, {"page": "Avinash Persaud", "response": ["Persaud is the son of development economist Bishnodat Persaud and novelist Lakshmi Persaud. His elder brother is psychiatrist Raj Persaud and his younger sister is former city Economist Sharda Dean."]}, {"page": "Doctor, Doctor (talk show)", "response": ["Doctor, Doctor is a live talk show broadcast on British television on Five starting in 2005, and hosted by co- presenters Mark Porter (who is also a general practitioner) and Raj Persaud (who is also a psychiatrist). It was produced by Princess Productions."]}, {"page": "All in the Mind (BBC radio)", "response": [" Former presenters have included Dr Raj Persaud, Dr Kwame McKenzie, Dr Tanya Byron,"]}, {"page": "Reborn doll", "response": ["Many reborn owners are simply doll collectors, while others have experienced miscarriage, stillbirth or neonatal death, have no means for adoption, or suffer from empty nest syndrome. They may utilize the dolls as a substitute for a child. Some owners dress the dolls, wash their hair, and may even take them for walks in strollers and take them shopping. Reborn hobbyists refer to the emotional response to holding their dolls as cuddle therapy. Studies suggest cuddling a baby releases hormones which produce a sense of emotional well-being, and some psychologists believe that this may happen with realistic dolls as well. Consultant psychiatrist Raj Persaud explains that mothering a real newborn baby releases the hormone oxytocin in the mother, and hypothesizes that this may explain why \"reborn mothers\" become emotionally attached to the reborn baby doll."]}, {"page": "Dr. Raj Persaud", "response": ["#REDIRECT Raj Persaud"]}, {"page": "Life Beyond the Box: Margo Leadbetter", "response": ["The film also includes celebrity cameos from  Richard and Judy, Max Clifford, Raj Persaud, John Sergeant and Judith Chalmers."]}, {"page": "British Indo-Caribbean people", "response": ["Indo-Trinidadian people are thought to number well over 25,000, which is even more than the number of people born in Trinidad and Tobago living in the UK according to the 2001 Census. Notable Britons of Indo-Trinidadian descent include Waheed Alli, Baron Alli, Chris Bisson, Vahni Capildeo, Krishna Maharaj, Shiva Naipaul, V. S. Naipaul, Lakshmi Persaud, and Raj Persaud."]}, {"page": "List of doctors working in the British media", "response": ["* Raj Persaud"]}, {"page": "Kick the cat", "response": ["Kicking the cat is looked upon unfavourably and viewed as a sign of  poor anger management. According to author Steve Sonderman, \"Men funnel 90 percent of their emotions through anger\" and may \"kick the cat\" as a substitute for grief, anxiety or other emotions. Psychology author Raj Persaud suggests that people \"kick the cat\" as a means of catharsis because they fear expressing their full emotions to the peers and colleagues."]}, {"page": "Dr Raj Persaud", "response": ["#REDIRECT Raj Persaud"]}, {"page": "Rajendra Persaud", "response": ["#REDIRECT Raj Persaud"]}, {"page": "Cynthia Pine", "response": ["She is one of a group of highly successful Guyanese people in Britain (Michael White of The Guardian refers to them as the \"Guyanese mafia\"), which includes Waheed Alli, Raj Persaud, Herman Ouseley and David Dabydeen, Keith Waithe and Rudolph Dunbar."]}, {"page": "Mental health of Jesus", "response": ["Jesus' mental health was also questioned by the British psychiatrists William Sargant and Raj Persaud, a number of psychologists of the psychoanalytic orientation, e.g.,  in his study \"Quelques traits de la vie de Jésus au point de vue psychologique et psychanalytique\"."]}]}}