{"wiki_id": "http://www.wikidata.org/entity/Q7287296", "itemLabel": "Ralph Butler", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Butler", "wikipedia_page": {"main": "Ralph Thomas Butler (12 October 1886 – 8 April 1969) was a British songwriter, responsible for the lyrics of many popular songs of the 1930s and later, mostly with comic or novelty elements.\nHe was active as a songwriter from the late 1920s until the mid-1950s. Among his most famous songs were \"All By Yourself In The Moonlight\" (1929), published under the pseudonym Jay Wallis, which reportedly sold over a million copies; \"Let’s Sing The Cuddly Song\" (written with Julian Wright, 1929); \"The Sun Has Got His Hat On\" (1932), \"Run Rabbit Run\" (1939), and \"Hey! Little Hen\" (1941), all co-written with Noel Gay; \"Let's All Go To The Music Hall\" (1934), written with Harry Tilsley and Lawrence Wright; \"There's A Lovely Lake In London\" (1935), with Tolchard Evans and Stanley Damerell; \"Horsey Horsey\" (1938), with Paddy Roberts; \"Come And Have A Drink At The Victory Arms\" (1941), with Tolchard Evans; and \"Nellie the Elephant\" (1956), written with Peter Hart.  Another song, also co-written with Noel Gay, \"We Don't Know Where We're Going\" (1944), was used to great effect during war scenes in the movie Overlord.\nHe died in 1969 in a London hospital, at the age of 82.", "link_mentions": [{"page": "1941 in music", "response": ["* \"Hey Little Hen\" w.m. Ralph Butler & Noel Gay"]}, {"page": "Noel Gay", "response": ["Gay went on to write songs for revues by The Crazy Gang, and for star artists like Gracie Fields, Flanagan and Allen and George Formby, as well as penning popular World War II songs such as \"Run Rabbit Run\" (with lyrics by Ralph Butler). He wrote two songs for the 1938 comedy film Save a Little Sunshine.", "| The Sun Has Got His Hat On  || || || || Ralph Butler & Noel Gay || LCC 1932", "| Round The Marble Arch || || || || Ralph Butler & Noel Gay || LCC 1932", "| Run, Rabbit, Run || The Little Dog Laughed || Ralph Butler & Noel Gay || Noel Gay ||  || NLA", "| The Girl Who Loves A Soldier || || Ralph Butler & Noel Gay || Noel Gay || || NLA", "| Oh What A Wonderful Night We've Had Tonight || || Ralph Butler & Noel Gay || Noel Gay || || NLA", "| Oh! Buddy, I'm in Love || || Ralph Butler & Noel Gay || Noel Gay || || NLA", "| Hey! Little Hen || || || || Ralph Butler & Noel Gay || NLA", "| I'd Never Fall in Love Again || || || || Ralph Butler & Noel Gay || NLA", "| Oh! How He Misses His Missus (Since He Became A Military Man) || || || || Ralph Butler & Noel Gay || NLA", "| 1942 || The First Waltz || || || || Ralph Butler & Noel Gay || NLA", "| Sitting on a Cloud || || || || Ralph Butler & Noel Gay || NLA", "| 1944 || We Don't Know Where We're Going || || || || Ralph Butler & Noel Gay || NLA", "| 1946 || When Alice Blue Gown Met Little Boy Blue || || Arnold, Ralph Butler & Simpson || Noel Gay || || NLA"]}, {"page": "Alexander Armstrong", "response": ["Armstrong participated in VE Day 70: A Party to Remember on 9 May 2015, a televised commemorative concert from Horse Guards Parade in London, where he sang \"We Must All Stick Together\" by Ralph Butler and Raymond Wallace, and \"London Pride\". He sang in Songs of Praise: The Big Sing, broadcast on 20 September 2015, a special programme from the Royal Albert Hall to commemorate Queen Elizabeth II becoming the world's longest-serving monarch. Armstrong sang I Would Be True."]}, {"page": "Arabian riff", "response": ["* \"Nellie the Elephant\" by Ralph Butler (1956)"]}, {"page": "Nellie the Elephant", "response": ["\"Nellie the Elephant\" is a children's song written in 1956 by Ralph Butler and Peter Hart about a fictional anthropomorphic elephant of that name. ", "Category:Songs with lyrics by Ralph Butler"]}, {"page": "Captain Bogg and Salty", "response": ["# Nellie the Elephant (Ralph Butler, Peter Hart (songwriter))"]}, {"page": "Role of music in World War II", "response": ["* Run Rabbit Run - Sung by Flanagan and Allen (1939) Words by Noel Gay & Ralph Butler. Music by Noel Gay."]}, {"page": "Butler (surname)", "response": ["*Ralph Butler, British lyricist"]}, {"page": "The Sun Has Got His Hat On", "response": ["\"The Sun Has Got His Hat On\" is a song by Noel Gay and Ralph Butler. It is known for its appearance in the 1985 version of the musical Me and My Girl, and was originally recorded in 1932 by two popular UK dance bands – Ambrose and his Orchestra, with vocals by Sam Browne, and by the Henry Hall BBC Dance Orchestra with vocals by Val Rosing.Rust, Brian.  \"The Dance Bands\". Rustbooks, 1972, p. 358.", "Category:Songs with lyrics by Ralph Butler"]}, {"page": "Dig That Groove Baby", "response": ["#  \"Nellie the Elephant\" (Ralph Butler, Peter Hart) – 3:27"]}, {"page": "Run Rabbit Run", "response": ["Run Rabbit Run is a song written by Noel Gay and Ralph Butler. The music was by Noel Gay and the song was originally sung by Flanagan and Allen accompanied by the Harry Bidgood orchestra.", "Category:Songs with lyrics by Ralph Butler"]}, {"page": "Horsey Horsey", "response": ["Horsey, horsey is a comedy song written in 1937 by Paddy Roberts, Elton Box, Desmond Cox and Ralph Butler and which was made popular by Jack Jackson, Billy Cotton and Henry Hall.NME artists, http://www.nme.com/artists/paddy-roberts, retrieved 17/04/09.", "Category:Songs with lyrics by Ralph Butler"]}, {"page": "We Don't Know Where We're Going", "response": ["\"We Don't Know Where We're Going (Until We're There!)\" is a popular song written by British composer Noel Gay and lyricist Ralph Butler, and published in 1944.", "Category:Songs with lyrics by Ralph Butler"]}, {"page": "List of songs recorded by Sissel", "response": ["| Ralph Butler"]}, {"page": "VE Day 70: A Party to Remember", "response": ["*Alexander Armstrong – \"We Must All Stick Together\" (by Ralph Butler & Raymond Wallace), \"London Pride\""]}, {"page": "Huntley Trevor", "response": ["Born in Bethnal Green, London, he began writing lyrics, especially for comic and novelty songs, before the First World War, and continued with some success until the 1930s.  His most successful songs included  \"When It’s Apple Blossom Time In Normandy\" (written with Harry Gifford and Tom Mellor, 1913); \"Your King and Country Need You\" (1914, written with Henry E. Pether); \"Give Yourself a Pat on the Back\" (1929, written with Ralph Butler); \"Jolly Good Company\" (1931), for which he wrote both words and music; \"Old Father Thames\" (1933, written with Lawrence Wright, who used the pseudonym \"Betsy O'Hogan\"); \"You Can't Do That There 'Ere\" (1935, written with Jack Rolls); and \"With My Shillelagh Under My Arm\" (1936, written with Billy O'Brien). Songs written or co-written by Huntley Trevor, The Database of Popular Music. Retrieved 4 January 2021 \"I'm a Lady Policeman\", Folk Song and Music Hall. Retrieved 4 January 2021"]}]}}