{"wiki_id": "http://www.wikidata.org/entity/Q72867", "itemLabel": "Craig Ferguson", "itemDescription": "Scottish television host, comedian, author, and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Ferguson", "wikipedia_page": {"main": "Craig Ferguson (born 17 May 1962) is a Scottish-American comedian, actor, writer and television host. He is best known for hosting the CBS late-night talk show The Late Late Show with Craig Ferguson (2005–14), for which he won a Peabody Award in 2009 for his interview with South African archbishop Desmond Tutu that year. He also hosted the syndicated game show Celebrity Name Game (2014–17), for which he won two Daytime Emmy Awards, and Join or Die with Craig Ferguson (2016) on History. In 2017 he released a six-episode web show with his wife, Megan Wallace Cunningham, titled Couple Thinkers.After starting his career in the UK with music, comedy, and theatre, Ferguson moved to the U.S., where he appeared in the role of Nigel Wick on the ABC sitcom The Drew Carey Show (1996–2004). Ferguson has written three books: Between the Bridge and the River, a novel; American on Purpose, a memoir; and Riding the Elephant: A Memoir of Altercations, Humiliations, Hallucinations & Observations. He holds both British and American citizenship.\nHe has written and starred in three films, directing one of them, and has appeared in several others, including several voice-over roles for animations. He provided voice work for Gobber in the How to Train Your Dragon film series (2010–2019), Owl in Winnie the Pooh (2011) and Lord Macintosh in Brave (2012).\nSince 2021, Ferguson has hosted the American game show The Hustler on the ABC television network.", "link_mentions": [{"page": "Burroughs Corporation", "response": ["Burroughs B205 hardware has appeared as props in many Hollywood television and film productions from the late 1950s. For example, a B205 console was often shown in the television series Batman as the Bat Computer; also as the computer in Lost in Space. B205 tape drives were often seen in series such as The Time Tunnel and Voyage to the Bottom of the Sea. Craig Ferguson, American talk show host, comedian and actor was a Burroughs apprentice in Cumbernauld, Scotland."]}, {"page": "List of comedians", "response": ["* Craig Ferguson (born 1962)"]}, {"page": "David Letterman", "response": ["Letterman appeared as a guest on CNN's Piers Morgan Tonight on May 29, 2012, when he was interviewed by Regis Philbin, the guest host and Letterman's longtime friend. Philbin again interviewed Letterman (and Shaffer) while guest-hosting CBS's The Late Late Show (between the tenures of Craig Ferguson and James Corden) on January 27, 2015. In June 2013, Letterman appeared in the second episode of season two of Comedians in Cars Getting Coffee. On November 5, 2013, he and Bruce McCall published a fiction satire book, This Land Was Made for You and Me (But Mostly Me), .", "Letterman started his production company, Worldwide Pants Incorporated, which produced his show and several others, in 1991. The company also produces feature films and documentaries and founded its own record label, Clear Entertainment. Worldwide Pants received significant attention in December 2007 after it was announced that it had independently negotiated its own contract with the Writers Guild of America, East, thus allowing Letterman, Craig Ferguson, and their writers to return to work, while the union continued its strike against production companies, networks, and studios with whom it had not yet reached agreements.", "| The Late Late Show with Craig Ferguson"]}, {"page": "List of Scots", "response": ["* Craig Ferguson (born 1962)", "* Craig Ferguson (born 1962)"]}, {"page": "Jason Alexander", "response": ["Alexander appeared in the Star Trek: Voyager episode \"Think Tank\" as Kurros, a genius alien trying to get Seven of Nine to serve on his ship. He appeared in \"One Night at Mercy\", the first episode of the short-lived 2002 revival of The Twilight Zone, playing Death. He featured in the 2005 Monk episode \"Mr. Monk and the Other Detective\" as Monk's rival, Marty Eels. On the June 26, 2006, episode of Jimmy Kimmel Live!, Alexander demonstrated several self-defense techniques. He hosted the July 4, 2006, PBS \"A Capitol Fourth\" celebrations in Washington, D.C., singing, dancing, and playing tuned drums. In 2006, Alexander signed on to feature as a regular cast member in the second season of Everybody Hates Chris. He hosted the Comedy Central Roast of William Shatner on August 13, 2006 (first airdate: August 20, 2006). In 2007, Alexander was a guest star in the third episode of the improv comedy series Thank God You're Here. He has been a frequent guest and panelist on Bill Maher's Politically Incorrect and Real Time; Hollywood Squares; the Late Late Show, with both Craig Kilborn and Craig Ferguson; and Late Show with David Letterman."]}, {"page": "May 17", "response": ["*  1962   – Craig Ferguson, Scottish-American comedian, actor, and talk show host"]}, {"page": "Trevor Jones (composer)", "response": ["| Craig Ferguson"]}, {"page": "1962", "response": ["** Craig Ferguson, Scottish-American actor, comedian and television host "]}, {"page": "The Price Is Right (American game show)", "response": ["The 2013 April Fools' show featured Carey and announcer George Gray modeling the prizes while the show's models performed hosting and announcing duties for the day. On the April Fools' Day episode in 2014, Craig Ferguson, Carey's former castmate from The Drew Carey Show, and Shadoe Stevens hosted and announced, swapping places with Carey and Gray respectively, who performed the same roles on the previous night's episode of The Late Late Show."]}, {"page": "Helen Atkinson-Wood", "response": ["Craig Ferguson wrote in his book American on Purpose that he and Atkinson-Wood were in a romantic relationship that lasted five years. He acknowledges that she changed his life \"beyond recognition\" by improving his health and his career."]}, {"page": "Michael Caine", "response": ["Craig Ferguson ran segments on his show where he parodied Caine, usually while wearing a space suit. In a 2010 interview with The Telegraph, Caine spoke of the impersonations and how everyone he meets quotes lines at him, to the point he quotes them quoting him. When asked whether he ever tired of telling his anecdotes, Caine stated: \"I enjoy making people laugh. The trick is to tell them against yourself. If you praise yourself your stories aren't funny.\""]}, {"page": "Peabody Awards", "response": ["Formal presentation of the Peabody Awards is traditionally held in late May or early June. For many years, the awards were given during a luncheon in New York City. The ceremony moved to a red carpet evening event for the first time on May 31, 2015, with Fred Armisen serving as host. Several famous names have served as Peabody Awards ceremony hosts over the years, among them Walter Cronkite, Lesley Stahl, Jackie Gleason, Jon Stewart, Morley Safer, Craig Ferguson, Larry King, and Ira Glass. From 2014 to 2016, the Peabody Awards aired on a tape-delayed basis on the TV channel Pivot.\"Participant Media’s Pivot to Broadcast Peabody Awards Through 2016,\" from Variety 3/17/2014 On June 2, 2017, a television special of the 76th Annual Peabody Awards Ceremony was broadcast on both PBS and FUSION networks."]}, {"page": "Late Show with David Letterman", "response": ["Lassally, who had served as an executive producer for Johnny Carson on The Tonight Show, was invited back to Late Show in January 2005 as a guest to discuss the recent death of Carson. Lassally served as executive producer for Worldwide Pants' The Late Late Show from late 1994 to February 2015, encompassing the tenures of hosts Tom Snyder, Craig Kilborn and Craig Ferguson. Lassally also served as Executive Producer of the Tony Mendez Show, an online webcast featuring Late Shows \"cue card boy\", Tony Mendez (c.1945–July 29, 2021).Tony Mendez, David Letterman's cue-card guy, reportedly dies at 76. Retrieved August 16, 2021. Mendez served in that capacity until 2014, when after a long-running dispute with writer Bill Scheft over Scheft micromanaging Mendez's job, he attacked Scheft and was fired.Buiso, Gary (October 19, 2014). Late Show cue-card man fired after argument, assault on writer. New York Post. Retrieved August 16, 2021.", "The final segment consisted of a live musical performance, a comedian performing a stand-up routine, or another guest interview. Musical guests included artists from David Bowie, U2, Neil Young, Coldplay to indie bands like Grizzly Bear, Gorillaz, MENEW, and Animal Collective. The CBS Orchestra frequently accompanied musical guests in performing their songs. Episodes occasionally concluded with Letterman recommending viewers stay tuned for Tom Snyder, Craig Kilborn, Craig Ferguson (James Corden in 2015), but usually he simply waved to the camera, saying, \"Good night everybody!\" In the latter part of the run, the admonishment to watch Craig Ferguson and James Corden was delivered by Alan Kalter, via voiceover."]}, {"page": "Johnny Carson", "response": ["Comedians who have claimed Carson as an influence include David Letterman, Jay Leno, Conan O'Brien, Dennis Miller, Bill Maher, Joan Rivers,video: Joan Rivers on Johnny Carson Show Larry Wilmore, Ray Romano, Don Rickles, Bob Newhart, Angie Dickinson, Carl Reiner, Mel Brooks, Dick Cavett, Norm Macdonald, David Steinberg, Jerry Seinfeld, Ellen DeGeneres, Garry Shandling, Steve Martin, Arsenio Hall, Craig Ferguson, and Jimmy Fallon."]}, {"page": "Comic Relief", "response": ["* United States: In 2015, Red Nose Day was formally brought to the United States under the auspices of Comic Relief, Inc., an organization unrelated to the defunct Comic Relief USA. The 2015 Red Nose Day Special aired on NBC on 21 May 2015 and was hosted by David Duchovny, Seth Meyers and Jane Krakowski, raising $23 million. The 2016 NBC special aired 26 May with Craig Ferguson as the host. Sponsored by Walgreens, Red Nose Day has since become an annual event."]}, {"page": "Ozark, Arkansas", "response": ["On April 17, 2007, Late Late Show host Craig Ferguson mentioned Ozark during his guest appearance on the Late Show with David Letterman. While telling Dave a story about travelling the country, Craig said he had stopped in \"Ozark, which is a town in Arkansas,\" and discovered catfish. It was the first time Craig had eaten catfish. He described it as being \"a tasty fish\". On June 14, 2007, Ferguson displayed a letter from Mayor Vernon McDaniels, making Ferguson an honorary citizen of Ozark. After becoming an honorary citizen, Ferguson set out to become an honorary citizen of as many U.S. cities as possible and later became an official U.S. citizen, all thanks to Ozark starting the trend. On June 25, 2009, Ferguson again mentioned Ozark during his opening monologue. He told his audience that Ozark was the place to stop for good catfish and described it as a \"lovely town\". Ferguson later financed a bond to build a $415,000 turf field for their high school football team in 2010."]}, {"page": "Michelle Yeoh", "response": [".https://www.ft.com/content/9c8e79dc-65c4-11e9-a79d-04f350474d62 In July 2008 she confirmed her engagement to him during an interview with Craig Ferguson on CBS's The Late Late Show."]}, {"page": "Puppeteer", "response": ["* Craig Ferguson (Scottish-American television host)"]}, {"page": "The Rocky Horror Show", "response": ["The Rocky Horror Show has toured the United Kingdom regularly since the 1990–91 West End revival at the Piccadilly Theatre in productions produced by Richard O'Brien's and Howard Panter's Rocky Horror Company. Notable celebrities have been cast including Daniel Abineri, Peter Blake, Tim McInnerny, Anthony Head, Robin Cousins, Jason Donovan and Jonathan Wilkes as Frank-N-Furter, Gina Bellman as Janet Weiss, Edward Tudor-Pole as Riff Raff and TV's Craig Ferguson and Adrian Edmonson as Brad Majors."]}, {"page": "2001 in film", "response": ["| Born Romantic || United Artists || David Kane (director/screenplay); Craig Ferguson, Jane Horrocks, Catherine McCormack, David Morrissey, Olivia Williams, Adrian Lester, Jimi Mistry, Kenneth Cranham, John Thomson, Ian Hart, Paddy Considine, Hermione Norris, Sally Phillips, Jessica Hynes, Ashley Walters || Comedy || Live action"]}, {"page": "2000 in film", "response": ["| Saving Grace || Fine Line Features || Nigel Cole (director); Mark Crowdy, Craig Ferguson (screenplay); Brenda Blethyn, Craig Ferguson, Martin Clunes, Tchéky Karyo, Valerie Edmond, Jamie Foreman, Bill Bailey, Diana Quick, Tristan Sturrock, Phyllida Law, Linda Kerr Scott, Leslie Phillips, Paul Brooke, Ken Campbell, Clive Merrison || Comedy || Live action"]}, {"page": "1999 in film", "response": ["| The Big Tease || Warner Bros. Pictures || Kevin Allen (director); Sacha Gervasi, Craig Ferguson (screenplay); Craig Ferguson, Frances Fisher, Mary McCormack, David Rasche, Sara Gilbert, Chris Langham, Donal Logue, Isabella Aitken, Kevin Allen, Angela McCluskey, Francine York, Nina Siemaszko, Charles Napier, Melissa Rivers, David Hasselhoff, Drew Carey, Cathy Lee Crosby || Comedy || Live action"]}, {"page": "1962 in television", "response": ["| Craig Ferguson"]}, {"page": "1962 in film", "response": ["*May 17 - Craig Ferguson, Scottish-American television host, comedian, author and actor"]}, {"page": "Panel show", "response": ["In 2013, The CW revived Whose Line Is It Anyway?, which features improv sketches. In 2014, Celebrity Name Game with Craig Ferguson premiered in syndication, in which players and celebrities try to get each other to guess famous names. In 2015, ABC announced primetime revivals for Match Game and To Tell The Truth."]}, {"page": "Pierce Brosnan", "response": ["In February 2013, Brosnan was awarded honorary patronage of the Dublin University Players society at Trinity College, Dublin. He also starred opposite Owen Wilson in No Escape, playing a \"heroic government agent\". Brosnan was slated to star in Last Man Out, a crime film adapted from Stuart Neville's novel titled The Twelve (released as Ghosts of Belfast in the US) by Craig Ferguson and Ted Mulkerin, with director Terry Loan at the helm. However, it never came to fruition after years in development, and Brosnan is no longer attached to the production."]}, {"page": "Grammy Award for Best Comedy Album", "response": ["| Craig Ferguson", "| Craig Ferguson", "* Craig Ferguson"]}, {"page": "United Service Organizations", "response": ["Other entertainers who have traveled to the Middle East to perform include Al Franken (who made six USO tours in Kosovo, Iraq and Afghanistan before being elected a United States Senator from Minnesota), Robin Williams, Craig Ferguson, Gary Sinise, Zac Brown, Five Finger Death Punch, Artie Lange, Gary Dell'Abate, Nick DiPaolo, Jim Florentine, Jim Norton, Dave Attell, Avenged Sevenfold, Jessica Simpson, Carrie Underwood, Drowning Pool, Toby Keith (with special guest Gina James), Montgomery Gentry, Kellie Pickler, Mayra Veronica, Carlos Mencia, O.A.R., Trace Adkins, Kathleen Madigan, Louis C.K.,Louis C.K's USO Blog, louisck.net  Dane Cook, Lewis Black, Third Day, Colin Quinn, Kathy Griffin and Neil McCoy."]}, {"page": "Worldwide Pants", "response": ["In 1993, the company produced two shows, one was the sitcom The Building, starring Bonnie Hunt, and the other show was the new late night program Late Show with David Letterman, both on CBS, although the former flopped, the latter show went on to succeed, for a whopping 22-year run until 2015. In 1995, Worldwide Pants launched The Late Late Show franchise, starting with one hosted by Tom Snyder, then with Craig Kilborn, and then with Craig Ferguson. Worldwide Pants produced these Late Late Show iterations until 2015. Also that year, it teamed up with Bonnie Hunt again to start out Bonnie, which went on to last one season on the air on CBS.", "During the first part of the strike reruns of Worldwide Pants shows were aired. This changed when Worldwide Pants broke ranks with the AMPTP by negotiating an independent, interim collective bargaining agreement with the Writers Guild of America in which Worldwide Pants essentially agreed to operate in accordance with the contract demands of the WGA for the duration of the labor dispute. The agreements automatically reverted to the final contract terms that the guild reached with the AMPTP at the end of the strike. The agreement allowed both the Late Show with David Letterman and The Late Late Show with Craig Ferguson to return to the airwaves with their full writing staffs on January 2, 2008.", "In 2008 Worldwide Pants signed a product placement deal with Ford to promote the Ford Flex during The Late Late Show with Craig Ferguson, using a series of weekly custom-written skits in which Ferguson played the leader of a band riding in a Flex as they traveled from Los Angeles International Airport to the CBS Studio.", "The company's principal property, Late Show with David Letterman, wrapped up production in 2015. Its production of The Late Late Show also ended once James Corden's version of the franchise launched in March 2015, though Worldwide Pants did continue to produce the show while it was fronted by a series of guest hosts between the departure of Craig Ferguson at the end of 2014 and Corden's premiere. The company is not producing either The Late Show with Stephen Colbert or The Late Late Show with James Corden, both of which are owned outright by CBS.", "*The Late Late Show with Craig Ferguson (2005–2014, co-produced with CBS Television Studios 2012–2014)"]}, {"page": "Buzz Lightyear of Star Command", "response": ["*  (voiced by Craig Ferguson): NOS-4-A2 is a robotic vampire created by Zurg. He is capable of draining any system or entity driven by electrical power, as well as controlling any machine he bites. His bite (in combination with radioactive moonrock) also transformed Ty Parsec into Wirewolf. Using Wirewolf and XL, he briefly usurped control of Planet Z from Zurg and attempted to transform everyone in the galaxy into robots for him to feed on, but was defeated and destroyed by Buzz, XR, and a reformed XL. His name is a pun on the term Nosferatu."]}, {"page": "John Mayer", "response": ["Mayer made many appearances on talk shows and other television programs, most notably on a Chappelle's Show comedy skit, the Late Show with David Letterman and on the final episode of Late Night with Conan O'Brien. Mayer appeared with Rob Dyrdek in the MTV show Rob Dyrdek's Fantasy Factory. Mayer wrote the theme song to the OWN network show Rollin' with Zach, which features Zach Anner. CBS invited him to guest host The Late Late Show in early 2015 on three dates, February 4–6, after the retirement of Craig Ferguson."]}, {"page": "Ted Danson", "response": ["Danson was born in San Diego to Edward \"Ned\" Bridge Danson, Jr. (March 22, 1916 – November 30, 2000), an archaeologist and director of the Museum of Northern Arizona from 1959 to 1975, and Jessica MacMaster (November 2, 1916 – January 11, 2006), and has an older sister, Jan Ann Haury (born January 11, 1944). Danson was raised in Flagstaff, Arizona.  His ancestry is mostly English and also partially Scottish, his ancestry goes back to colonial New England, being descended from Roger Williams, Anne Hutchinson, John Webster and Roger Ludlow.Danson stated in an interview with Craig Ferguson, that he has Scottish ancestry; "]}, {"page": "Partick Thistle F.C.", "response": ["*Craig Ferguson, former host of the popular American chat show The Late Late Show with Craig Ferguson."]}, {"page": "Jayson Blair", "response": ["* During the White House Correspondents' Dinner in 2008, Craig Ferguson remarked, \"The New York Times unfortunately did not buy a table. They feel -- I just want to make sure I get this right -- they felt that this event undercuts the credibility of the press.  It's funny, you see I thought that Jayson Blair and Judy Miller took care of that.\""]}, {"page": "Billy Connolly", "response": ["Later in the year, Connolly topped an unscientific poll of \"Britain's Favourite Comedian\" conducted by the network Five, placing him ahead of performers such as John Cleese, Ronnie Barker, Dawn French, and Peter Cook. In 2006, he revealed he has a house on the Maltese island of Gozo.The Late Late Show with Craig Ferguson, 28 September 2006. He and his wife also have an apartment in New York City near Union Square.The Late Late Show with Craig Ferguson, 2 November 2009.", "In 2012, Connolly provided the voice of King Fergus in Pixar's Scotland-set animated film Brave, alongside fellow Scottish actors Kelly Macdonald, Craig Ferguson, Robbie Coltrane, Emma Thompson, and Kevin McKidd. Connolly appeared as Wilf in Quartet, a 2012 British comedy-drama film based on the play Quartet by Ronald Harwood, directed by Dustin Hoffman."]}, {"page": "Arnold Rimmer", "response": ["In \"Confidence and Paranoia\" (1988), Lister believes that the only reason that Rimmer became a part of the love celibacy society was because he couldn't get a date, and he could never get a date because Rimmer's mum bought all of Rimmer's casual clothes. Rimmer denies this, pointing out he went to bed with Yvonne McGruder, but Lister says she thought Rimmer was someone else due to her wonky vision from a concussion. Lister, with the help of a solid manifestation of Lister's confidence (played by Craig Ferguson), deduces where Kochanski's personality disc is hidden as well as a means of how the ship can power two holograms at once. Lister is still unable to go on a date with Kochanski, however, as the disc inside Kochanski's box has been swapped with one containing a duplicate of Rimmer."]}, {"page": "Courteney Cox", "response": ["From 2014 to 2017, she executive produced the syndicated game show Celebrity Name Game, hosted by Craig Ferguson. It ended after three seasons. The series earned her a nomination for the Daytime Emmy Award for Outstanding Game Show."]}, {"page": "David Sedaris", "response": ["A frequent guest of late-night US talk show host Craig Ferguson, in April 2012, Sedaris joined Ferguson and the cast of CBS's The Late, Late Show in Scotland for a theme week in and around Ferguson's hometown between Glasgow and Edinburgh. The five weeknight episodes aired in May 2012."]}, {"page": "Broadcast syndication", "response": ["The 2014–15 season saw the introduction of Celebrity Name Game, hosted by former The Late Late Show host Craig Ferguson; the series was renewed for a second season in January 2015, while Ferguson would also win a Daytime Emmy Award for Daytime Emmy Award for Outstanding Game Show Host for his work on the program. In January 2016, Fox owned-and-operated stations began a test run of South of Wilshire—a game show produced by TMZ. The 2017 summer season includes the game show iWitness created by TV judge Judith Sheindlin."]}, {"page": "Bob Barker", "response": ["*He has appeared on various talk shows such as: Dinah!, Larry King Live, The Arsenio Hall Show, Crook & Chase, Donny & Marie, The Rosie O'Donnell Show, The Ellen DeGeneres Show, The Wayne Brady Show, the Late Show with David Letterman, and The Late Late Show with Craig Ferguson."]}, {"page": "Steve Jones (musician)", "response": ["Jones made a cameo appearance on Portlandia's second-season finale, \"Brunch Village\", which aired on 9 March 2012. In May 2012, Jones appeared on The Late Late Show with Craig Ferguson in a sketch playing himself as the roommate to Prince Charles (played by Craig Ferguson), as well as playing guitar on a cover of Ninian Hawick's \"Scottish Rite Temple Stomp\" in a cold open to a week of shows shot in Scotland. He later appeared on Ferguson's last show in December 2014, playing guitar during a rendition of Dead Man Fall's \"Bang Your Drum.\""]}]}}