{"wiki_id": "http://www.wikidata.org/entity/Q728073", "itemLabel": "Guy Jonson", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Guy_Jonson", "wikipedia_page": {"main": "Guy Jonson (5 November 1913 – 10 March 2009) was an English classical Pianist and distinguished music teacher.\nHe was born Stanley Guy Johnson at Finchley, north London, the son of an auctioneer. Though neither of his parents were musical, his prodigious talent at the piano was recognized from an early age and he became a pupil of Betty Humby, wife of the distinguished conductor Sir Thomas Beecham. He gave his first piano recital in Eastbourne at the age of 13. He attended Highgate School in north London but left at 14 to continue his piano studies with Tobias Matthay (formerly of the Royal Academy of Music). In 1930, at the age of 16, he won a scholarship to the Royal Academy of Music in London. Subsequently, he studied under Alfred Cortot.\nHis first major recital was given at the famous Wigmore Hall, London, in November 1936, and he went on to perform several solo recitals and concertos for the BBC (at Broadcasting House) which were broadcast live on the overseas radio network. In 1939, shortly after being made the youngest ever Professor at the Royal Academy, Jonson was called up to serve in the Royal Artillery, then the Army Educational Corps. He married Patricia Burrell in 1944. In 1946 he was demobilized and returned to his position of Professor at the Royal Academy.\nGuy Jonson adjudicated at music festivals throughout Britain and Ireland and gave piano recitals all around the world. After retiring from the Royal Academy he continued to teach privately. Among his distinguished pupils were Pianists Dimitris Sgouros, Martin Jones, Angela Lear, Julian Saphir and Philip Smith and the composers Sir John Tavener and Iain Hamilton.", "link_mentions": [{"page": "Tobias Matthay", "response": ["Many of his pupils went on to define a school of 20th century English pianism, including York Bowen, Myra Hess, Clifford Curzon, Harold Craxton, Moura Lympany,  Irene Scharrer, Lilias Mackinnon, Guy Jonson, Vivian Langrish, Eileen Joyce, jazz \"syncopated\" pianist Raie Da Costa, Harriet Cohen, Dorothy Howell, and the duo Bartlett and Robertson. He taught many Americans, including Ray Lev, Eunice Norton, and Lytle Powell, and he was also the teacher of Canadian pianist Harry Dean, English composer Arnold Bax and English conductor Ernest Read."]}, {"page": "Martin Jones (pianist)", "response": ["Martin Jones (born 4 February 1940 in Witney, England) is an English concert pianist. He studied at the Royal Academy of Music in London under Guido Agosti, Guy Jonson, and Gordon Green.Martin Jones (Piano) - Short Biography He has been highly regarded since debuting in the international arena when he won the Dame Myra Hess Award in 1968.Martin Jones"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Guy Jonson (pianist and teacher)", "* Guy Jonson (former professor of Piano)"]}]}}