{"wiki_id": "http://www.wikidata.org/entity/Q7286085", "itemLabel": "Rajesh Rao", "itemDescription": "English cricketer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rajesh_Rao_(cricketer)", "wikipedia_page": {"main": "Rajesh Krishnakant Rao (born 9 December 1974) is a former English cricketer.  Rao was a right-handed batsman who bowled leg break googly.  He was born in Park Royal, London.\nRao made his first-class debut for Sussex against Cambridge University in 1996.  From 1996 to 1999, he represented the county in 27 first-class matches, the last of which came against Gloucestershire in the County Championship.  In his 27 first-class matches for Sussex, he scored 874 runs at an average of 20.80, with six half centuries and a high score of 89.  In the field he took 7 catches.  With the ball he took 4 wickets at a bowling average of 74.00, with best figures of 1/1.  It was for Sussex that Rao also made his debut in List A cricket, which came against Durham in the 1996 AXA Equity and Law League.  From 1996 to 1999, he represented the county in 40 List A matches, the last of which came against Gloucestershire in the Benson and Hedges Cup.In 2000, he played his first List A match for the Middlesex Cricket Board against Wiltshire in the 2000 NatWest Trophy.  From 2000 to 2002, he represented the Board in four List A matches, the last of which came against Cambridgeshire in the 2nd round of the 2003 Cheltenham & Gloucester Trophy which was held in 2002.  In his career total of 44 List A matches, he scored 1,038 runs at an average of 24.71, with 7 half centuries and a single century high score of 15.  In the field he took 12 catches, while with the ball he took 5 wickets at an average of 33.80, with best figures of 3/31.", "link_mentions": [{"page": "Sussex County Cricket Club", "response": ["* Rajesh Rao"]}, {"page": "Rajesh Krishnakant Rao", "response": ["#REDIRECT Rajesh Rao (cricketer)"]}, {"page": "List of Middlesex Cricket Board List A players", "response": ["*Rajesh Rao (2000–2002): RK Rao"]}]}}