{"wiki_id": "http://www.wikidata.org/entity/Q728087", "itemLabel": "Ron Arad", "itemDescription": "Israeli industrial designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ron_Arad_(industrial_designer)", "wikipedia_page": {"main": "Ron Arad (Hebrew: רון ארד; born (1951-04-24)24 April 1951) is an Israeli industrial designer, artist, and architectural designer.", "link_mentions": [{"page": "April 24", "response": ["*1951 – Ron Arad, Israeli architect and academic"]}, {"page": "Tel Aviv", "response": ["* Ron Arad (b. 1951), architect and industrial designer"]}, {"page": "Centre Pompidou", "response": ["* Ron Arad (2008)"]}, {"page": "List of architects", "response": ["*Ron Arad (born 1951), Israel"]}, {"page": "Victoria and Albert Museum", "response": ["In November 2012, the Museum opened its first gallery to be exclusively dedicated to furniture. Prior to this date furniture had been exhibited as part of a greater period context, rather than in isolation to showcase its design and construction merits. Among the designers showcased in the new gallery are Ron Arad, John Henry Belter, Joe Colombo, Eileen Gray, Verner Panton, Thonet, and Frank Lloyd Wright."]}, {"page": "List of furniture designers", "response": ["* Ron Arad (born 1951)"]}, {"page": "Ron Arad", "response": ["Ron Arad may refer to:", "* Ron Arad (pilot) (1958-1986), Israeli Air Force weapon systems officer; classified as missing in action since 1986", "* Ron Arad (industrial designer) (born 1951), Israeli industrial designer, artist and architect"]}, {"page": "List of Israelis", "response": ["* Ron Arad – designer", "* Ron Arad – MIA navigator"]}, {"page": "Dolce & Gabbana", "response": ["In addition to developing runway shows and advertising campaigns for its collections, Dolce & Gabbana use their spaces to host photography and other art exhibitions. Soon after the opening of the Il Metropol, they hosted two exhibitions by artist Ron Arad in the lobby space: Blo-Glo between April 2006 and April 2007, and Bodyguards in late April 2007. They held photography exhibitions featuring the work of Enzo Sellerio in 2007 and Herbert List in 2008. In 2011 Dolce & Gabbana held an open house and architectural exhibition with Studio Piuarch showcasing the studio's various architectural designs and projects since 1996. Studio Piuarch built the Dolce & Gabbana headquarters in 2006, which was where the exhibition and open house was held."]}, {"page": "List of found objects", "response": ["*Ron Arad "]}, {"page": "Architectural Association School of Architecture", "response": ["*Ron Arad"]}, {"page": "List of chairs", "response": ["* Rover chair, designed by Ron Arad"]}, {"page": "Bezalel Academy of Arts and Design", "response": ["*Ron Arad (born 1951), industrial designer"]}, {"page": "List of industrial designers", "response": ["* Ron Arad (born 1951)"]}, {"page": "Rover P6", "response": ["The Rover chair, designed by Ron Arad in 1981, incorporated seats from P6 cars."]}, {"page": "Penguin Classics", "response": ["* The Idiot was designed by industrial designer Ron Arad and has no cover, so the reader will pick it up and read the author's first words. It is stripped back to show the glue and thread in the spine, which is visible through an acrylic slipcase (with a lid) with a fresnel lens, so the text appears to move as the lid is removed. Arad explains: \"By not wanting to have a cover, it ended with the book becoming an amazing object that is alive, but which maintains its transparency. It became a glorious box with a book inside—almost like a monument.\" "]}, {"page": "Atar Arad", "response": ["Arad and his brother, architect Ron Arad, were born in Tel Aviv, Israel. Arad began his training on the violin in Tel Aviv and received an Artist Diploma in 1966 from the Samuel Rubin Israeli Academy of Music.  In 1968 he was selected for study at Chapelle Musicale Reine Elisabeth in Waterloo, Belgium, earning a Laureate there in 1971 and a Diplome Superieure from Brussels Conservatory in 1973."]}, {"page": "London Design Festival", "response": ["Previous winners are Dame Vivienne Westwood, Tom Dixon, Daniel Charny, Ross Atkin, Neri Oxman, Hussein Chalayan, Grace Wales Bonner, Eva Jiricna, Es Devlin, Paul Priestman, Margaret Calvert, Julian Melchiorri, Sir David Adjaye, Kenneth Grange, Bethan Laura Wood, Daan Roosegaard, Edward Barber and Jay Osgerby, Marjan Van Aubel, Peter Brewin and Will Crawford, the Bourellec brothers, Nicolas Roope, Roland Lamb, Lord Richard Rogers, Daniel Rybakken, Dieter Rams, David Constantine, Alexandra Daisy Ginsberg, Jane Ni Dhulchaointigh, Rosario Hurtado and Roberto Feo, Vidal Sassoon, Sir Ken Adam, Peter Saville, Marc Newson, Sir Paul Smith, Dame Zaha Hadid, Thomas Heatherwick, Sir Terence Conran, and Ron Arad."]}, {"page": "Sleuth (2007 film)", "response": ["Director Branagh found shooting in the house difficult yet interesting. \"The minimalism I found was a great challenge. The elevator was Harold's idea, so that was there and was a central feature of what we are going to bring to it. And then everything else was drawn from contemporary British architecture, contemporary British artists. The wire figure is by Anthony Gormley, one of our most famous sculptors. Gary Hume did all the artwork on the walls.\"Michael Caine and Director Kenneth Branagh Talk About Sleuth , by Rebecca Murray, About.com. Retrieved 8 March 2008. Custom designed furniture from Ron Arad completes the look."]}, {"page": "Israel Cultural Excellence Foundation", "response": ["The artistic advisory committees consist of 35 artists and public opinion makers, including six Israel Prize laureates, all acting on a voluntary basis.  Members include Dubi Lenz, Gal Uchovsky, David Tartakover, Michal Smoira-Cohn, Chaim Topol, Dani Caravan, Yossi Marhaim, Mendi Rodan, Ohad Naharin, Danny Gottfried, Ron Arad, Asher Fisch, Gershon Bram, Alex Padua, and Micah Lewensohn."]}, {"page": "Zion Square", "response": ["In 2006 the Jerusalem Foundation floated a secret proposal to rename the square Rapaport Plaza, after a Waco, Texas philanthropist who pledged $2 million toward the square's renovation. Architect Ron Arad of London was hired and presented a plan to install a towering, red, reflective steel sculpture as a focal point for the square. The plan, which was not reported to the public, was spotted on the Jerusalem Foundation website and brought to public attention by Lemallah, a grassroots citizens watch group, which launched a successful public protest against the name change and the sculpture. At the same time, Lemallah produced its own counterproposal for a round, six-sided, steel \"peace dome\" to span the square and Jaffa Road. That idea, too, did not come to fruition."]}, {"page": "Roberto Paci Dalò", "response": ["In 2007 he presents his solo exhibition City Works - urban explorations and interventions in the cities of Berlin, Ciudad de México, Linz, Napoli, Rimini, Rome, Vancouver - at the Gallery SESV (University of Florence - Department of Architecture). In the same year he presents his solo exhibition Sparks (site-specific installation and drawings on paper) at the contemporary arts centre Palazzo delle Papesse Siena and the videoinstallation Shadows at Studio Zero, the exhibition space of Duomo Hotel created by Ron Arad in Rimini. In the same year he presents a triple project at the Ars Electronica Festival in Linz. In that occasion he performed Napoli (the historical work created in 1993 and already presented in Linz in 1995). Napoli is an immersive multi-channel sound portrait of the Italian city. Within the festival he premiered the film IMA Fiction #3 Heidi Grundmannima.or.at » portrait #3 07 (a portrait of the seminal figure in radio and telecommunication world) and the electronic performance Elektra.", "* 2007 Shadows - after the videoinstallation for the Duomo Hotel created by Ron Arad"]}, {"page": "Charles Kaisin", "response": ["Kaisin is a designer whose work explores the processes that generate a form. He graduated from the Royal College of Art in 2001, in Ron Arad's studio in London, after having completed an Architecture degree in Brussels."]}, {"page": "Moritz Waldemeyer", "response": ["Moritz Waldemeyer (born 1974) is a British/German designer and engineer. He trained as an engineer at King's College London and completed his master's degree in 2001. Since then, he has collaborated with many of the world’s top architects and fashion designers including Ron Arad, Zaha Hadid and Hussein Chalayan. His work is a fusion of technology, art, fashion and design.", "Having worked as a research scientist at Phillips, Waldemeyer began his career in design engineering projects such as Ron Arad’s "]}, {"page": "Neotu Gallery", "response": ["* Ron Arad (industrial designer)", "* 1986 September November - \"English Eccentrics\" - Ron Arad, André Dubreuil, Tom Dixon, Sue Golden, Jasper Morrisson, John Webb", "* 1994 - \"International Design Yearbook 9' - Ron Arad - Publisher Abbeville Press - New York - 1994 - "]}, {"page": "Max Penson", "response": ["In 1948 the increase in anti-Semitism under pressure by Joseph Stalin forced Penson to leave his 25-year-long position with the Pravda Vostoka. Penson had three children. His son, Miron Penson, became a prominent cinematographer during the Soviet Era. His grandson, Maxime Penson, is a prominent commercial photographer, publisher, designer, and entrepreneur in Tashkent. Penson's relatives also include Ron Arad, a prominent Israeli designer, artist, and architect, and Atar Arad, an Israeli violinist, in addition to Boris Penson, a prominent Soviet Refusenik who was featured in the documentary Operation Wedding for his role in the Dymshits–Kuznetsov hijacking affair. Max Penson died in 1959 in Uzbekistan."]}, {"page": "David Shaw Nicholls", "response": ["While in school in Scotland, Nicholls gained recognition for his two-seater welded tubular steel and stainless steel wire chair at Edinburgh College of Art. In 1980, Design reg. No.995257, his first prototypal piece, was acknowledged as “uncluttered and straightforward”, “a clean starting point and an attempt to reduce the object to its original state”. Alongside British Designer Craftsmen, John Makepeace and Martin Grierson, the collection was shown at the Edinburgh International Festival in 1980, in The Fine Arts Society in Glasgow, showing “Charles Rennie Mackintosh and The Modern Movement” in 1980, at the “Light” exhibition in “High-Tech”, Milan in 1983, alongside Gaetano Pesce, James Irvine, Philippe Starck, Jasper Morrison, Massimo Iosa Ghini, Ron Arad, “Shiro” and “other young guns”. The Asflexi prototypes were also editorialized extensively throughout the world during this period. (Domus, Modo, Abitare, Interni, Mobilla)"]}, {"page": "Clear (magazine)", "response": ["Clear has had profiles of and interviews with people including Takashi Murakami, Philippe Starck, Dolce & Gabbana, Jean Nouvel, Ross Lovegrove, Zaha Hadid, Oscar Niemeyer, Sonia Rykiel, Massimo and Leila Vignelli, Karim Rashid, Marcel Wanders, Martin Margiela, David Lynch, Dennis Hopper, Wendell Castle, Shiro Kuramata, Dror Benshetrit, Ron Arad, Alexander Wang, Christophe Coppens, Stephen Jones and Kenji Yanobe."]}, {"page": "Afroditi Krassa", "response": ["Afroditi Krassa (born 1974) is a British product designer and interior designer and founded her own design consultancy Afroditi Krassa LTD in 2002 in London. Krassa was educated at Central St Martins College of Art and Design and later on, the Royal College of Art, under architect Ron Arad."]}, {"page": "Ingo Maurer", "response": ["* Ingo Maurer (ed.): The International Design Yearbook 2000. Laurence King Publishing, London 2000, 240 p. (Essays by Philippe Starck, Ron Arad, Mario Bellini and Jasper Morrison)"]}, {"page": "Sukkah City", "response": ["The jury included Rick Bell, Executive Director of the New York Chapter of the American Institute of Architects, Geoff Manaugh, a senior editor at Dwell magazine, architecture critic Paul Goldberger designer Ron Arad, architect Thom Mayne, winner of the Pritzker Prize, Michael Arad, Allan Chochinov, Matias Corea, Steven Heller, Natalie Jeremijenko, Maira Kalman, Thomas de Monchaux, Ada Tolla and Adam Yarinsky.\"Sukkah City\", Sam Grawe, Dwell, May 30, 2010. Archived from dead url on February 12, 2012. The rabbinic adviser was Dani Passow.\"Who Is Behind It\", n.d. Retrieved August 16, 2018."]}, {"page": "London Contemporary Orchestra", "response": ["LCO's inaugural 2008 season featured music by Mark-Anthony Turnage, Kaija Saariaho, Thomas Adès, Iannis Xenakis, Simon Holt, Roberto Carnevale, Olivier Messiaen, Radiohead's Jonny Greenwood, and new works by young composers Emily Hall, Colin Alexander and Jonathan Cole.London Contemporary Orchestra In May 2009 the LCO collaborated with experimental electronic duo Matmos and composer Anna Meredith for a series of performances at Shoreditch warehouse Village Underground. LCO appeared at the Roundhouse in January 2010 as part of contemporary music festival 'Reverb', performing works by Steve Reich, John Cage, Biosphere and the world premiere of Shiva Feshareki's turntable concerto \"TTKonzert\".News - London Contemporary Orchestra LCO made its debut at the Spitalfields Music Summer Festival in June 2010 and at Aldeburgh Music's 'Faster Than Sound' in May 2010.Faster Than Sound: London Contemporary Orchestra  Aldeburgh Music In October 2010, the Roundhouse staged three screenings of Metropolis (restored version) with Gottfried Huppertz's original score performed live by the LCO. Later that year, the LCO gave a performance of Frank Zappa's \"The Yellow Shark\" as part of the Roundhouse's 'Frank Zappa – 70th Birthday Celebration'.Past - London Contemporary Orchestra LCO returned to the Roundhouse in August 2011 to collaborate with Ron Arad on 'Curtain Call'. LCO staged its first 'LCO Soloists' project at The Old Vic Tunnels in May 2011. In March 2012, the LCO performed works by Xenakis, Gabriel Prokofiev, Jonny Greenwood and Vivier to a capacity audience of 1,200 as part of 'Reverb 2012' at the Roundhouse. LCO made its Southbank Centre debut in 2012 closing Meltdown Festival (curated by Antony Hegarty) with a performance of William Basinski's \"The Disintegration Loops\".LCO closes Southbank Centre's Meltdown Festival with William Basinski's 'The Disintegration Loops' - London Contemporary Orchestra"]}, {"page": "Thomas Feichtner", "response": ["Even as a student, Thomas Feichtner designed numerous products for the Austrian sporting industry, like skateboards and snowboards for Heavy Tools or ski bindings for Tyrolia and Fischer. He later designed skis for Head>> produkt: XP 100, X40 ::: . dip. Retrieved on October 25, 2011. and Blizzard. In the area of visual communications, Feichtner worked for companies like Swarovski, Adidas Eyewear, European Capital of Culture or the British-Israeli designer Ron Arad. After his early successes as an industrial designer, Feichtner turned to experimental product design in 2005, working with traditional fabricators such as J. & L. Lobmeyr, Porzellanmanufaktur Augarten, , Neue Wiener Werkstätten, Wiener Silbermanufactur and Stamm. He has also completed freelance projects in cooperation with Vitra und FSB. His works have found their way into major design collections, like that of MAK – Austrian Museum for Applied Arts/Contemporary Arts.Thomas Feichtner, Edge to Edge, Hrsg. Peter Noever, Shonquis Moreno, Lilli Hollein, Bernhard E. Bürdek, Michael Hausenblas. 2010, MAK – Österreichisches Museum für angewandte Kunst / Gegenwartskunst, Birkhäuser Verlag, Basel-Boston-Berlin. "]}, {"page": "Design Museum Holon", "response": ["Design Museum Holon is the first museum in Israel dedicated to design. The building of the museum was planned and designed by Israeli architect and  industrial designer Ron Arad in cooperation with Bruno Asa.A Small Miracle, HaaretzRon Arad's Metallic Vision, The New York Times The museum is in the eastern part of the new culture area of Holon that includes the Médiathèque (central library, theater, cinémathèque). Nearby is the faculty of design in the Holon Institute of Technology.", "The museum opened on 3 March 2010. That is the first building that was planned by Ron Arad."]}, {"page": "Gidi Avivi", "response": ["* Ron Arad - Not Without White Gloves. Director: Avida Livny; a documentary that focuses on a year in the life of Ron Arad, the world-renowned artist, industrial designer, and architect, as he develops, creates, and exhibits his installations and art works in Jerusalem, Venice, Groningen, London, Holon and Tel Aviv. The premiere of the film took place at Docaviv  – Tel Aviv International Documentary Film Festival."]}, {"page": "List of Jewish architects", "response": ["* Ron Arad (Hebrew: רון ארד‎) (24 April 1951, Tel Aviv, Israel–), is an industrial designer, artist, and architectural designer. Israel"]}]}}