{"wiki_id": "http://www.wikidata.org/entity/Q7298137", "itemLabel": "Ray St. John", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_St._John", "wikipedia_page": {"main": "Raymond St. John is an English songwriter, record producer, electric/acoustic guitarist and bassist. He is a former member of the Latin soul band Pride, active from 1979 to 1982.  Sade Adu was also a member of Pride in the early 1980s, and St. John is perhaps best known for co-writing her song \"Smooth Operator\".After leaving Pride in 1982, St. John went into hiatus for the next five years, before eventually forming the band Halo James with vocalist Christian James, and keyboard player Neil Palmer in 1988. Their second single release \"Could Have Told You So\", reached No. 6 in the UK Singles Chart in February 1990 and became a major success all over Europe, bringing the band to international audiences.  Their sole album The Witness was also acclaimed by the music critics of that era, and sold over 100,000 copies in its first year of release, peaking at No. 18 on the UK Albums Chart. However, soon after this, the band split up.\nFollowing the demise of Halo James, St. John remained active as a lyricist and producer for the remainder of the 1990s, going on to write numerous songs for other artists, including several hits in the US and throughout Europe, for performers such as Gabrielle and Snoop Dogg amongst others..", "link_mentions": [{"page": "Diamond Life", "response": ["Producer Robin Millar met the band in 1983, and the band members had never worked in a professional studio and only had demos and recordings from the BBC studios and EMI publishing studios. Millar booked a week's worth of studio time and noted that the limitations of recording before computers had an impact upon the sound. \"We used a real piano and a Fender Rhodes piano, painstakingly synching them up.\" They recorded 15 songs, all written by Adu and members of the group, except \"Smooth Operator\" written exclusively by Adu and Ray St. John. They also recorded a cover version of \"Why Can't We Live Together\" (1972) by Timmy Thomas."]}, {"page": "Boston Crusaders Drum and Bugle Corps", "response": ["|1986 || ||Fifth Symphony by Dmitri Shostakovich / Coronation March by Pyotr Ilyich Tchaikovsky / Smooth Operator by Sade Adu and Ray St. John / Bluesette by Toots Thielemans / Conga by Enrique E. Garcia / Conquest by Alfred Newman  ||79.90 ||16th"]}, {"page": "Smooth Operator", "response": ["Ray St. John, who co-wrote \"Smooth Operator\" with Sade Adu, was previously a member of Adu's former band Pride, although he was not a member of the band Sade. The pair co-wrote the song in 1982 while still members of Pride, but did not get around to recording it because St. John left Pride shortly after Sade joined.", "Category:Songs written by Ray St. John"]}, {"page": "Valeriya", "response": ["Valeriya's 2007 album Out Of Control (recorded in two versions, English and Russian) featured collaborations with several well-known producers and musicians, including Ray St. John, David Richards and Chantal Kreviazuk. One of the tracks, a cover version of the Bee Gees's \"Stayin' Alive\" was recorded with Robin Gibb."]}, {"page": "Ray Saint John", "response": ["#REDIRECT Ray St. John"]}, {"page": "The Rise (Carl Riseley album)", "response": ["#\"Smooth Operator\" (Sade Adu, Ray St. John) - 3:40"]}, {"page": "Halo James", "response": ["Halo James formed in London. Named after the main character from the comic strip The Ballad of Halo Jones, the band were fronted by session musician/vocalist Christian James (born 21 December 1965) and included Ray St. John (guitar, bass, songwriting; formerly of Latin soul band Pride) and Neil Palmer (keyboards; formerly of short-lived synth-rock act Atomage and dance duo Two People) among its members. Their sound incorporated elements of soft rock, soul and synth-pop. Originally established as a side-project to Ray St. John's songwriting career after a chance meeting between St. John and James in early 1988 while both were doing session work in the same studio, the band was formed in November that year when Palmer, who had been a school friend of James, became involved in the project after the two other members decided that they needed a keyboard player to complete some rough demos that they were working on, and James recommended Palmer to St. John."]}, {"page": "St John (name)", "response": ["*Ray St. John, British musician"]}]}}