{"wiki_id": "http://www.wikidata.org/entity/Q7299217", "itemLabel": "Raymond Waring", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Waring", "wikipedia_page": {"main": "Raymond Waring (born 21 July 1977) is an English actor. He was born in Liverpool and grew up in Runcorn, Cheshire, where he attended St. Chad's Secondary School. In 1994, he was accepted into the National Youth Theatre of Great Britain and, in 1997, attended the Guildhall School of Music & Drama. He also trained with the renowned Alain Knapp.\nRaymond has appeared in numerous films including submerged, Lucky Break directed by Peter Cattaneo, as well as collaborating with Michael Winterbottom on the films 24 Hour Party People, A Cock and Bull Story and The Look of Love. He has appeared in Sally Potter's Yes. He appeared in the box office smash 28 Weeks Later and horror thriller Intruders, both directed by Juan Carlos Fresnadillo.", "link_mentions": [{"page": "2002 in film", "response": ["| 24 Hour Party People || United Artists || Michael Winterbottom (director); Frank Cottrell Boyce (screenplay); Steve Coogan, Paddy Considine, Danny Cunningham, Sean Harris, Shirley Henderson, Lennie James, Andy Serkis, John Simm, John Thomson, Mark Windows, Ralf Little, Tim Horrocks, Chris Coghill, Paul Popplewell, Ron Cook, Kieran O'Brien, Raymond Waring, Dave Gorman, Peter Kay, Enzo Cilenti, Rob Brydon, Simon Pegg, Christopher Eccleston, John Stammers, Helen Schlesinger, Kate Magowan, Tony Wilson,  Nigel Pivaro, Kenny Baker, Howard Devoto, Rowetta, Terri Seymour, Paul Ryder, Clint Boon, Elizabeth Dawn, Martin Coogan, Jon DaSilva, Mark E. Smith, Mike Pickering, Dave Haslam, Vini Reilly, Keith Allen, Gary Mounfield, Fiona Allen, Conrad Murray || Comedy, Drama || Live Action"]}, {"page": "Runcorn", "response": ["* Raymond Waring (born 1977), actor"]}, {"page": "24 Hour Party People", "response": ["* Raymond Waring as Vini Reilly (singer-guitarist of The Durutti Column)"]}, {"page": "Michael Winterbottom", "response": ["Winterbottom often works with the same actors; many faces can be seen in several of his films, including Shirley Henderson, Paul Popplewell, John Simm, Steve Coogan, Rob Brydon, Raymond Waring and Kieran O'Brien. His production company is Revolution Films and the company signed a first look deal with Fremantle."]}, {"page": "Yes (film)", "response": ["Yes is a 2004 British-American film written and directed by Sally PotterMUBI and starring Joan Allen, Simon Abkarian, Samantha Bond, Sam Neill, Shirley Henderson, Raymond Waring, Stephanie Leonidas, and Sheila Hancock."]}, {"page": "A Cock and Bull Story", "response": ["*Raymond Waring as Corporal Trim / Raymond Waring"]}, {"page": "List of 28 Days Later characters", "response": ["Sam (played by Raymond Waring) is Karen's boyfriend. He joins the group of survivors during the second Rage Virus outbreak, and tries to climb on Flynn's helicopter to escape infected, only to fall, either dying or becoming infected."]}, {"page": "List of American films of 2007", "response": ["| 28 Weeks Later || Fox Atomic || Juan Carlos Fresnadillo (director/screenplay); Rowan Joffé, E. L. Lavigne, Jesus Olmo (screenplay); Robert Carlyle, Rose Byrne, Jeremy Renner, Harold Perrineau, Catherine McCormack, Imogen Poots, Idris Elba, Mackintosh Muggleton, Amanda Walker, Garfield Morgan, Emily Beecham, Philip Bulcock, Roderic Culver, Karen Meagher, Raymond Waring || Horror"]}, {"page": "List of comedy films of the 2000s", "response": ["|A Cock and Bull Story||Michael Winterbottom||Steve Coogan, Rob Brydon, Raymond Waring||United Kingdom||"]}, {"page": "Lucky Break (2001 film)", "response": ["*Raymond Waring as Darren"]}, {"page": "Intruders (2011 film)", "response": ["* Raymond Waring and Adam Leese as Policemen"]}, {"page": "Knightfall (TV series)", "response": ["* Raymond Waring as Daniel"]}, {"page": "Anne (British TV series)", "response": ["* Raymond Waring as Steve Hart"]}]}}