{"wiki_id": "http://www.wikidata.org/entity/Q7298603", "itemLabel": "Raymond Bond", "itemDescription": "English cricketer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Bond", "wikipedia_page": {"main": "Raymond Ernest Bond (born 7 September 1944) is a former English cricketer.  Bond was a left-handed batsman who bowled right-arm medium-fast.  He was born in Burnham, Buckinghamshire.\nBond made his debut for Buckinghamshire in the 1965 Minor Counties Championship against Suffolk.  Bond played Minor counties cricket for Buckinghamshire from 1965 to 1979, which included 72 Minor Counties Championship matches.  In 1969, he made in his List A debut for Buckinghamshire, against Middlesex in the Gillette Cup.  He played 4 further List A matches for Buckinghamshire, the last coming against Suffolk in the 1979 Gillette Cup.  He also played 4 List A matches for Minor Counties South, spread over the 1973 and 1974 Benson & Hedges Cup  In total, he played 9 List A matches, taking 15 wickets at a bowling average of 18.46, with a single five wicket haul against Cambridgeshire in the 1972 Gillette Cup, with Bond taking figures of 5/17 in the match.During his career, Bond played just the single first-class match.  This came for a combined Minor Counties cricket team against the touring West Indians in 1973.  He wasn't required to bat in this match, but did take 2 wickets: Roy Fredericks' in both the West Indian first-innings and second-innings.\n\n", "link_mentions": [{"page": "The Hoodlum (1951 film)", "response": ["* Raymond Bond as Old Man (uncredited)"]}, {"page": "Frederick Harris (cricketer)", "response": ["Harris made his debut for Buckinghamshire in the 1957 Minor Counties Championship against Norfolk.  Harris played Minor counties cricket for Buckinghamshire from 1957 to 1976, which included 90 Minor Counties Championship matches.  In 1965, he made his List A debut against Middlesex in the Gillette Cup.  He played 6 further List A matches for Buckinghamshire, the last coming against Middlesex in the 1975 Gillette Cup.  In his 6 List A matches, he scored 30 runs at a batting average of 6.00, with a high score of 13.  With the ball he took 11 wickets at a bowling average of 19.45, with best figures of 4/21.  His best figures came against Cambridgeshire, where in partnership with Raymond Bond (5/17), he helped bowl Cambridgeshire out for 41.  This at the time was the joint lowest total a team had been bowled out for in List A cricket."]}, {"page": "Stephen Long (sportsman)", "response": ["Long made his debut for Suffolk in the 1974 Minor Counties Championship against Buckinghamshire.  He played Minor counties cricket for Suffolk from 1974 to 1980, which included 34 Minor Counties Championship appearances.  He made his List A debut against Buckinghamshire in the 1979 Gillette Cup.  In this match, he was dismissed for 5 runs by Raymond Bond.  He made a further List A appearance against Sussex in the 2nd round of the same competition.  In this match, he scored 7 runs before being dismissed by Colin Wells."]}, {"page": "List of Buckinghamshire CCC List A records", "response": ["* Best Bowling: 5/17 Raymond Bond v Cambridgeshire at Fenner's, Cambridge, 1972", "|Raymond Bond|||| 10"]}, {"page": "John David Whalen", "response": ["Whalen was born John David Woodmency Whalen in Baltimore, Maryland.  His father was John Whalen, III, a veteran of the Vietnam War who died in 1989 as a result of exposure to Agent Orange. His mother, Linda Whalen, taught elementary school in the Baltimore County Public Schools school district and now owns Whalen Properties LLC.  Whalen's great- grandfather was Raymond Bond, an actor during the 1950s who appeared in films such as A Foreign Affair (1948) and The Man From Planet X (1951). Following his father's death, his mother enrolled him at the prestigious Boys' Latin School of Maryland. There Whalen discovered lacrosse and acting. Later he played, and eventually served as an assistant coach, on the Navy lacrosse team prior to his commissioning in the US Navy.  Whalen currently owns several businesses ranging from medical devices to lighting design to social experience venues."]}, {"page": "Bond (surname)", "response": ["*Raymond Bond (born 1944), English cricketer"]}, {"page": "List of Minor Counties South List A players", "response": ["*Raymond Bond (1973–1974): RE Bond"]}]}}