{"wiki_id": "http://www.wikidata.org/entity/Q7297924", "itemLabel": "Ray Pahl", "itemDescription": "British sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Pahl", "wikipedia_page": {"main": "Raymond Edward Pahl (17 July 1935 – 3 June 2011) was a British sociologist, best known for his studies of social interaction, polarisation, work and friendship in suburban and post-industrial communities.\n\n", "link_mentions": [{"page": "Household", "response": ["In sociology, household work strategy (a term coined by Ray Pahl in his 1984 book, Divisions of Labour) is the division of labour among members of a household. Household work strategies vary over the life cycle as household members age, or with the economic environment; they may be imposed by one person, or be decided collectively."]}, {"page": "St Albans School, Hertfordshire", "response": ["* Ray Pahl (1935–2011), sociologist"]}, {"page": "Pahl", "response": ["*Ray Pahl (1935–2011), British sociologist"]}, {"page": "2011 in the United Kingdom", "response": ["**Ray Pahl, sociologist (b. 1935)"]}, {"page": "Deaths in June 2011", "response": ["*Ray Pahl, 75, British sociologist, cancer."]}, {"page": "Raymond Edward Pahl", "response": ["#REDIRECT Ray Pahl"]}, {"page": "Raymond Pahl", "response": ["#REDIRECT Ray Pahl"]}, {"page": "Claire Wallace", "response": ["Claire Wallace graduated from the University of Kent, where she undertook a PhD about young people on the Isle of Sheppey under the supervision of Ray Pahl. She subsequently worked at the University of Plymouth and Lancaster, before moving to Prague to help set up the Central European University (now in Budapest) together with Ernest Gellner funded by George Soros and was finally Head of Sociology and Politics.  She then moved to the Institute for Advanced Studies in Vienna, where she later became Head of Sociology. Since 2005 she has been working at the University of Aberdeen as Professor of Sociology, although she was Vice Principal for Research and Knowledge Exchange between 2011 and 2014 and before that Director of Research for the College of Arts and Social Science.", "Claire Wallace started her career on the pioneering Sheppey project with Ray Pahl looking at the transformations of work and employment for young people and households. She developed the idea of household work strategies in her later work in various European Union projects where she looked at all forms of work (domestic, employment, informal economy etc.) and how they were changing. This, together with her work on young people's transitions into adulthood, formed the basis of her early books. Whilst in Prague she became interested in East–West migration and published a series of papers and a book on this topic. She also wrote a series of papers about aspects of transition in Eastern Europe including ones on health, ethnic identity, work and well-being, as well as being involved in a series of project including ENRI-East, Health in Transition Times (HITT), Living Conditions, Lifestyles, and Health (LLH), Households, Work and Flexibility, and Workcare: Social Quality and the Changing Relationship between Work, Care and Welfare in Europe. These were continued through various research projects whilst in Vienna and Aberdeen. Since moving to Aberdeen she became co-investigator in the dot.rural Digital Economy Hub funded by the UK Research Council, where she looked at digital transformations of rural life. Over the last ten years she has been creating a model of well-being, quality of life and what makes a decent society by developing the Social quality model."]}, {"page": "Sexuality and Its Discontents", "response": ["Sexuality and Its Discontents received positive reviews from Christopher Meade in New Statesman, N. W. Bell in Choice, Jim Monk in The Body Politic, and the gay rights activist Dennis Altman in The Advocate, Michael-Roy Kingham in The Sociological Review, the sociologist Barry D. Adam in the American Journal of Sociology, the sociologist Michael Messner in The Social Science Journal, and Peter F. Murphy in Feminist Studies, a mixed review from the sociologist William Simon in Contemporary Sociology, and a negative review from the sociologist Stephen O. Murray in the Journal of Homosexuality. The book was also reviewed by Lisa Davis in Psychology Today and discussed by the sociologist Ray Pahl in New Statesman & Society."]}, {"page": "List of fellows of the British Academy elected in the 2000s", "response": ["* Professor Ray Pahl, Visiting Research Professor, University of Essex; professor emeritus of Sociology, University of Kent"]}]}}