{"wiki_id": "http://www.wikidata.org/entity/Q729694", "itemLabel": "Jack Phillips", "itemDescription": "Titanic's Wireless Operator", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Phillips_(wireless_officer)", "wikipedia_page": {"main": "John George \"Jack\" Phillips (11 April 1887 – 15 April 1912) was a British sailor and the senior wireless operator aboard the Titanic during its ill-fated maiden voyage in April 1912.\nOn the final evening, Phillips had been exceptionally busy clearing a backlog of messages caused by a wireless breakdown. His consequent failure to respond to incoming signals is cited as a principal cause of the disaster. When the steamship Mesaba sent an ice alert, he acknowledged it, but failed to pass it on to the bridge. Another from the nearby SS Californian was ignored altogether. After they struck the iceberg, however, Phillips did his utmost to contact other ships for assistance. He died in the sinking.\n\n", "link_mentions": [{"page": "April 15", "response": ["**Jack Phillips, English telegraphist (b. 1887)"]}, {"page": "Guglielmo Marconi", "response": ["RMS Titanic radio operators Jack Phillips and Harold Bride were not employed by the White Star Line but by the Marconi International Marine Communication Company. After the sinking of the ocean liner on 15 April 1912, survivors were rescued by the RMS Carpathia of the Cunard Line.Eaton, John P. and Haas, Charles A. (1994) Titanic – Triumph and Tragedy, A Chronicle in Words and Pictures.  . The Carpathia took a total of 17 minutes to both receive and decode the SOS signal sent by the Titanic. There was a distance of 58 miles between the two ships.\"Marconi: The Man Who Networked the World | CBC Radio.\" CBCnews, CBC/Radio Canada, 10 Nov. 2016, www.cbc.ca/radio/ideas/marconi-the-man-who-networked-the-world-1.3845164. When Carpathia docked in New York, Marconi went aboard with a reporter from The New York Times to talk with Bride, the surviving operator. After this incident, Marconi gained popularity and became more recognised for his contributions to the field of radio and wireless technology.RMS Titanic, Inc. \"Recovery Expedition to Titanic Sets Target Departure Date for 2021.\" PR Newswire: News Distribution, Targeting and Monitoring, 22 July 2020,"]}, {"page": "1912", "response": ["** Jack Phillips, English ship's senior wireless officer (b. 1887)"]}, {"page": "Titanic (1997 film)", "response": ["* Gregory Cooke as Jack Phillips: Senior wireless operator on board the Titanic whom Captain Smith ordered to send the distress signal."]}, {"page": "Stanley Lord", "response": ["On the night of 14 April 1912, as the Californian approached a large ice field, Captain Lord decided to stop around 10:21 p.m. (ship's time) and wait out the night. Before turning in for the night, he ordered his sole wireless operator, Cyril Evans, to warn other ships in the area about the ice. When reaching the Titanic, Evans tapped out \"I say old man, we are stopped and surrounded by ice.\" The Californian was so close to the Titanic that the message was very loud in the ears of Titanic First Wireless Operator Jack Phillips, who angrily replied \"Keep out! Shut up! I am working [i.e., communicating with] Cape Race.\" Earlier in the day the wireless equipment aboard the Titanic had broken down and Phillips, along with Second Wireless Operator Harold Bride, had spent the better part of the day trying to repair it. Now they were swamped with outgoing messages that had piled up during the day and Phillips was exhausted after such a long day. Evans listened in for a while longer as Phillips sent routine traffic through the Cape Race relaying station before finally turning in for bed at around 11:30 p.m."]}, {"page": "CQD", "response": ["On 15 April 1912, RMS Titanic radio operator Jack Phillips initially sent \"CQD\", which was still commonly used by British ships. Harold Bride, the junior radio operator, suggested using , saying half-jokingly that it might be his last chance to use the new code. Phillips thereafter began to alternate between the two. Although Bride survived, Phillips perished in the sinking."]}, {"page": "John Phillips", "response": ["*Jack Phillips (wireless officer) (John George Phillips, 1887–1912), wireless operator on board the R.M.S. Titanic.", "*Jack Phillips (disambiguation)"]}, {"page": "Godalming", "response": ["===Jack Phillips memorial cloister and gardens===", "The radio operator of RMS Titanic, Jack Phillips, was born and lived in Farncombe, worked in Godalming and was then at sea. He is famed for remaining at his post, sending repeated distress calls, until the ship sank. Phillips is remembered in several ways around the town, including a section of Godalming Museum, a memorial fountain, a cloister and garden walk near the church, and a public house named in his honour."]}, {"page": "SS Californian", "response": ["Titanic on-duty wireless operator, Jack Phillips, was busy clearing a backlog of passengers' messages with the wireless station at Cape Race, Newfoundland,  away, at the time. Evans's message that SS Californian was stopped and surrounded by ice, due to the relative proximity of the two ships, drowned out a separate message Phillips had been in the process of receiving from Cape Race, and he rebuked Evans: \"Shut up, shut up! I am busy; I am working Cape Race!\". Philips never passed this message to the bridge, but in his defence, Evans had not prefixed the message with the letters, \"MSG\", which stood for Master Service Gram, as was customary for all messages intended for the bridge. Evans, feeling that he had done what was asked of him despite Philips's rude apparent rejection of the message, then switched off his wireless equipment and went to bed. One hour and 10 minutes later, Titanic hit an iceberg. One hour and twenty-five minutes after that, she transmitted her first distress call."]}, {"page": "Harold Bride", "response": ["After the Titanic struck an iceberg at 11:40 pm 14 April 1912, Bride and his senior colleague Jack Phillips were responsible for relaying CQD messages (later SOS at Captain Edward Smith's urging) to ships in the vicinity, which led to the survivors being picked up by the RMS Carpathia. The men remained at their posts until the ship's power was almost completely out. Bride was washed off the ship as the boat deck flooded, but managed to scramble onto the upturned lifeboat Collapsible 'B', and was rescued by the Carpathia later in the morning. Despite being injured, he helped Harold Cottam, the Carpathia's wireless operator and a personal friend of his, transmit survivor lists and personal messages from the ship.", "In 1912 Harold Bride joined the crew of the RMS Titanic as the junior wireless operator and assistant to Jack Phillips at Belfast, Ireland. Stories have appeared that Bride knew Phillips before the Titanic, but Bride insisted that they had never met before Belfast. The Titanic left on her maiden voyage to New York City from Southampton, England, on 10 April. During the voyage, Bride and Phillips worked from the wireless room on the Boat Deck, sending out passengers' personal messages and receiving iceberg warnings from other ships. On 11 April, a day after the ship set sail, Phillips and Bride had celebrated Phillips' 25th birthday, with pastries brought from the first class dining room.", "On the evening of 14 April 1912 Bride had gone to bed early in preparation to relieve Jack Phillips at midnight, two hours earlier than normal. The wireless had not been working earlier and Phillips was busy catching up on a backlog of passengers' personal messages being sent to Cape Race, Newfoundland.", "Jack Phillips sent out CQD while Bride took messages to the Captain about which ships were coming to the Titanic assistance. However, the closest ship to respond, the RMS Carpathia, would not reach the Titanic until after she sank. At one point Bride reminded Phillips that the new code was SOS and jokingly said, \"Send SOS, it's the new call, and it may be your last chance to send it.\" Later Phillips took a quick break and Bride took over the wireless. Phillips soon returned to the wireless room reporting that the forward part of the ship was flooded and that they should put on more clothes and life vests. Bride began to get dressed while Phillips went back to work on the wireless machine."]}, {"page": "Farncombe", "response": ["thumb|100px|Jack Phillips", "*John George \"Jack\" Phillips (1887–1912) was born in Farncombe. He died while serving as senior wireless operator on board the maiden voyage of the RMS Titanic. He continued working as the ship sank, trying to contact other ships that might be able come to the assistance of the Titanic.Titanic The Jack Phillips pub in Godalming High Street is named after him."]}, {"page": "Clifden", "response": ["Clifden gained prominence after 1905 when Guglielmo Marconi decided to build his first high power transatlantic long wave wireless telegraphy station four miles (6 km) south of the town to minimize the distance to its sister station in Glace Bay, Nova Scotia. The first point-to-point fixed wireless service connecting Europe with North America opened for public service with the transmission of 10,000 words on 17 October 1907. At peak times, up to 200 people were employed by the Clifden wireless station, among them Jack Phillips, who later perished as Chief Radio Operator on the Titanic."]}, {"page": "Cape Race", "response": ["In 1904, the first wireless station in Newfoundland was built at Cape Race. On the night Titanic sank, wireless operator Jack Phillips was sending telegraphs to Cape Race for relay to New York City.  When Cyril Evans, wireless operator of the SS Californian, sent an iceberg warning to Titanic, only a few miles away, Phillips was annoyed with the loud signal (due to the proximity) and responded \"Keep out, Shut up, I'm working Cape Race.\"  This would become a famous incident, as the bored Evans soon went to sleep, and Titanic hit an iceberg only fifteen minutes later. After Titanic's distress call, Cape Race played a major role in relaying news of the sinking to other ships and land locations."]}, {"page": "Kenneth Griffith", "response": ["He appeared in many British films between the 1940s and 1980s, notably as Archie Fellows in The Shop at Sly Corner, Jenkins in Only Two Can Play (1962), the wireless operator Jack Phillips on board the Titanic in A Night to Remember (1958), in the crime caper Track the Man Down (1955) and especially in the comedies of the Boulting brothers, including Private's Progress (1956) and I'm All Right Jack (1959).   Other notable film roles included the murderous pedophile Seely in Revenge (1971), the gay medic Witty in The Wild Geese (1978) and a whimsical mechanic in The Sea Wolves (1980)."]}, {"page": "Ghosts of the Abyss", "response": ["* Justin Shaw as Wireless Officer  Jack Phillips"]}]}}