{"wiki_id": "http://www.wikidata.org/entity/Q7298551", "itemLabel": "Raymond Allen", "itemDescription": "British television writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Allen_(scriptwriter)", "wikipedia_page": {"main": "Raymond Allen (born 1940/1941 in Ryde, Isle of Wight) is a British television screenwriter and playwright best known for creating the 1970s BBC sitcom Some Mothers Do 'Ave 'Em. He wrote comedy sketches for Frankie Howerd, Dave Allen, Max Wall and Little and Large.", "link_mentions": [{"page": "Isle of Wight", "response": ["* Scriptwriter Raymond Allen"]}, {"page": "Norman Wisdom", "response": ["Wisdom was one of several actors initially considered for the role of Frank Spencer in Some Mothers Do 'Ave 'Em. However, he turned the role down and it eventually went to Michael Crawford. The creator of the series Raymond Allen later stated \"Norman Wisdom was offered the role but turned it down because he didn't find it funny\"."]}, {"page": "Some Mothers Do 'Ave 'Em", "response": ["Some Mothers Do 'Ave 'Em is a British sitcom broadcast on BBC1, created and written by Raymond Allen and starring Michael Crawford and Michele Dotrice. It was first broadcast in 1973 and ran for two series, including two Christmas specials in 1974 and 1975; after a three-year absence it returned for a third series in 1978, and in 2016 for a one-off special. The series regularly garnered 25 million viewers and was broadcast in 60 countries."]}, {"page": "Ryde", "response": ["*Raymond Allen (born 1940), a TV screenwriter (Some Mothers Do 'Ave 'Em), attended Ryde Secondary Modern School."]}, {"page": "List of people from the Isle of Wight", "response": ["*Raymond Allen, television scriptwriter best known for Some Mothers Do 'Ave 'Em, born and lives in Ryde"]}, {"page": "Raymond Allen", "response": ["Raymond Allen may refer to:", "*Raymond Allen (television actor) (1929–2020), best known for his recurring roles on Good Times and Sanford and Son", "*Raymond Allen (stage actor) (1921–1994), who appeared in light opera from the 1950s through the 1980s", "*Raymond Allen (scriptwriter) (born 1940), who wrote the 1970s BBC comedy series Some Mothers Do 'Ave 'Em"]}, {"page": "Some Mothers Do 'Ave 'Em (play)", "response": ["Some Mothers Do 'Ave 'Em is a play by Guy Unsworth based on the BBC TV sitcom of the same name by Raymond Allen."]}]}}