{"wiki_id": "http://www.wikidata.org/entity/Q7299323", "itemLabel": "Rayner Heppenstall", "itemDescription": "British writer (1911-1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rayner_Heppenstall", "wikipedia_page": {"main": "John Rayner Heppenstall (27 July 1911 in Lockwood, Huddersfield, Yorkshire, England – 23 May 1981 in Deal, Kent, England) was a British novelist, poet, diarist, and a BBC radio producer.", "link_mentions": [{"page": "Animal Farm", "response": ["A BBC radio version, produced by Rayner Heppenstall, was broadcast in January 1947. Orwell listened to the production at his home in Canonbury Square, London, with Hugh Gordon Porteous, amongst others. Orwell later wrote to Heppenstall that Porteous, \"who had not read the book, grasped what was happening after a few minutes.\""]}, {"page": "George Orwell", "response": ["In June, Burmese Days was published and Cyril Connolly's positive review in the New Statesman prompted Blair to re-establish contact with his old friend. In August, he moved into a flat, at 50 Lawford Road, Kentish Town, which he shared with Michael Sayers and Rayner Heppenstall. The relationship was sometimes awkward and Blair and Heppenstall even came to blows, though they remained friends and later worked together on BBC broadcasts.A Kind of Compulsion, p. 392 Blair was now working on Keep the Aspidistra Flying, and also tried unsuccessfully to write a serial for the News Chronicle. By October 1935 his flatmates had moved out and he was struggling to pay the rent on his own. He remained until the end of January 1936, when he stopped working at Booklovers' Corner. In 1980, English Heritage honoured Orwell with a blue plaque at his Kentish Town residence.", "In his tramping days, he did domestic work for a time. His extreme politeness was recalled by a member of the family he worked for; she declared that the family referred to him as \"Laurel\" after the film comedian. With his gangling figure and awkwardness, Orwell's friends often saw him as a figure of fun. Geoffrey Gorer commented \"He was awfully likely to knock things off tables, trip over things. I mean, he was a gangling, physically badly co-ordinated young man. I think his feeling [was] that even the inanimate world was against him.\"Geoffrey Gorer – recorded for Melvyn Bragg BBC Omnibus production The Road to the Left 1970 When he shared a flat with Heppenstall and Sayer, he was treated in a patronising manner by the younger men.Rayner Heppenstall Four Absentees in Audrey Coppard and Bernard Crick Orwell Remembered 1984 At the BBC in the 1940s, \"everybody would pull his leg\"Sunday Wilshin in Stephen Wadhams Remembering Orwell Penguin Books 1984 and Spender described him as having real entertainment value \"like, as I say, watching a Charlie Chaplin movie\".Stephen Spender in Stephen Wadhams Remembering Orwell Penguin Books 1984 A friend of Eileen's reminisced about her tolerance and humour, often at Orwell's expense."]}, {"page": "July 27", "response": ["*1911 – Rayner Heppenstall, English author and poet (d. 1981)"]}, {"page": "May 23", "response": ["*  1981   – Rayner Heppenstall, English author and poet (b. 1911)"]}, {"page": "Keep the Aspidistra Flying", "response": ["In October 1934, after Orwell had spent nine months at his parents' home in Southwold, his aunt Nellie Limouzin found him a job as a part-time assistant in Booklovers' Corner, a second-hand bookshop in Hampstead run by Francis and Myfanwy Westrope. The Westropes, who were friends of Nellie in the Esperanto movement, had an easygoing outlook and provided Orwell with comfortable accommodation at Warwick Mansions, Pond Street. He was job sharing with Jon Kimche who also lived with the Westropes. Orwell worked at the shop in the afternoons, having the mornings free to write and the evenings to socialise.Rayner Heppenstall, \"Four Absentees\", in Audrey Coppard and Bernard Crick, eds, Orwell Remembered, 1984", "By the end of February 1935 Orwell had moved into a flat in Parliament Hill; his landlady, Rosalind Obermeyer, was studying at the University of London. It was through a joint party with his landlady that Orwell met his future wife, Eileen O'Shaughnessy. In August Orwell moved into a flat in Kentish Town, which he shared with Michael Sayers and Rayner Heppenstall. Over this period he was working on Keep the Aspidistra Flying, and had two novels, Burmese Days and A Clergyman's Daughter, published. At the beginning of 1936 Orwell was dealing with pre-publication issues for Keep the Aspidistra Flying while he was touring the North of England collecting material for The Road to Wigan Pier. The novel was published by Victor Gollancz Ltd on 20 April 1936."]}, {"page": "Victor Gollancz", "response": ["Gollancz formed his own publishing company in 1927, publishing works by writers such as Ford Madox Ford and George Orwell, who wrote that \"Gollancz is of course part of the Communism-racket,\" to Rayner Heppenstall in July 1937 (Orwell went to Secker and Warburg from Homage to Catalonia onwards). The firm, Gollancz Ltd., published pacifist and socialist nonfiction as well as, by the mid-1930s, a solid selection of contemporary fiction, including authors such as Elizabeth Bowen, Daphne du Maurier, and Franz Kafka. While Gollancz published The Red Army Moves by Geoffrey Cox on the Winter War in 1941, he omitted some criticisms of the USSR."]}, {"page": "Homage to Catalonia", "response": ["The first edition was published in the United Kingdom in April 1938 by Secker & Warburg after being rejected by Gollancz, the publisher of all Orwell's previous books, over concerns about the book's criticism of the Stalinists in Spain. \"Gollancz is of course part of the Communism-racket,\" Orwell wrote to Rayner Heppenstall in July 1937. Orwell had learned of Warburg's potential willingness to publish anti-Stalinist socialist content in June, and in September a deal was signed for an advance of £150 (). \"Ten years ago it was almost impossible to get anything printed in favour of Communism; today it is almost impossible to get anything printed in favour of Anarchism or 'Trotskyism',\" Orwell wrote bitterly in 1938.Bowker, p. 230."]}, {"page": "1939 in literature", "response": ["*Rayner Heppenstall – The Blaze of Noon"]}, {"page": "We (novel)", "response": ["Orwell began Nineteen Eighty-Four (1949) some eight months after he read We in a French translation and wrote a review of it.Orwell (1946). Russell, p. 13. Orwell is reported as \"saying that he was taking it as the model for his next novel\".Bowker (p. 340) paraphrasing Rayner Heppenstall. Brown writes that for Orwell and certain others, We \"appears to have been the crucial literary experience\".Brown trans., Introduction, p. xvi. Shane states that \"Zamyatin's influence on Orwell is beyond dispute\".Shane, p. 140. Robert Russell, in an overview of the criticism of We, concludes that \"1984 shares so many features with We that there can be no doubt about its general debt to it\", however, there is a minority of critics who view the similarities between We and 1984 as \"entirely superficial\". Further, Russell finds that \"Orwell's novel is both bleaker and more topical than Zamyatin's, lacking entirely that ironic humour that pervades the Russian work\"."]}, {"page": "Eileen Blair", "response": ["Eric Blair married Eileen O'Shaughnessy the next year, on 9 June 1936, at St Mary's Church, Wallington, Hertfordshire (as Eric Arthur Blair and Eileen Maud O'Shaughnessy; at this time he was known as Orwell only in his writing, his friends knew him as Eric or Blair; and he \"never quite got around to changing it\").  Blair, though a non-practising member of the Church of England, \"was sufficiently a traditionalist to wish to be married in it.\" They tried to have children, but Eileen did not become pregnant and they learnt later that Orwell was sterile, as he told Rayner Heppenstall, as Eileen confided in Elizaveta Fen."]}, {"page": "Deal, Kent", "response": ["* North & South Deal were swapped round in the semi-autobiographical novel The Pier by Rayner Heppenstall."]}, {"page": "The Faber Book of Twentieth Century Verse", "response": ["L. Aaronson - Lascelles Abercrombie - Dannie Abse - Drummond Allison - W. H. Auden - George Barker - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Wilfrid Scawen Blunt - Robert Bridges - Rupert Brooke - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - G. K. Chesterton - Alex Comfort - A. E. Coppard - John Davidson - Idris Davies - W. H. Davies - Walter de la Mare - C. M. Doughty - Keith Douglas - Lawrence Durrell - T. S. Eliot - William Empson - James Elroy Flecker - David Gascoyne - Wilfrid Gibson - W. S. Graham - Robert Graves - Thomas Hardy - H. D. - Thomas Hennell - Rayner Heppenstall - Ralph Hodgson - A. E. Housman - James Joyce - Patrick Kavanagh - Sidney Keyes - Rudyard Kipling - James Kirkup - D. H. Lawrence - Laurie Lee - Alun Lewis - C. Day Lewis - Hugh MacDiarmid - Patrick MacDonogh - Louis MacNeice - John Masefield - Harold Monro - T. Sturge Moore - Edwin Muir - Henry Newbolt - Robert Nichols - Norman Nicholson - Wilfred Owen - Herbert Palmer - Ruth Pitter - William Plomer - Paul Potts - Ezra Pound - F. T. Prince - Kathleen Raine - Herbert Read - Edgell Rickword - Anne Ridler - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - John Short - Edith Sitwell - Stevie Smith - Sydney Goodsir Smith - Stephen Spender - J. C. Squire - Arthur Symons - Dylan Thomas - Edward Thomas - W. J. Turner - Dorothy Wellesley - Vernon Watkins - Anna Wickham - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "Terence Tiller", "response": ["In 1946 he joined the BBC Features Department, where he was responsible for hundreds of plays and feature broadcasts on a wide range of subjects, but mainly on history, literature and mythology. His contemporaries in the department included the fellow poets Rayner Heppenstall, Louis MacNeice and W R Rodgers.E.S. Guralnick. 'Radio Drama: The Stage of the Mind', in Virginia Quarterly Review"]}, {"page": "John Middleton Murry", "response": ["He met Katherine Mansfield at the end of 1911, through W. L. George.Carswell, p. 66. His intense relationship with her, her early death, and his subsequent allusions to it, shaped both his later life and the attitudes (often hostile) of others to him. Leonard Woolf in his memoirs called Murry \"Pecksniffian\".Downhill All the Way (1967), p. 49. By 1933 his reputation \"had touched bottom\", and Rayner Heppenstall's short book of 1934, John Middleton Murry: A Study in Excellent Normality, could note that he was \"the best-hated man of letters in the country\".Lea, p. 213.", "Plowman co-founded (in 1934) and ran the Adelphi Centre. It was an early commune, based on a farm in Langham, Essex bought by Murry.Dennis Hardy, Utopian England: Community Experiments, 1900–1945 (2002), p. 42. Short-lived in its original conception, it ran a Summer School in August 1936 that was stellar: George Orwell spoke on \"An Outsider Sees the Distressed Areas\" on 4 August, with Rayner Heppenstall in the chair. Other speakers were Steve Shaw, Herbert Read, Grace Rogers, J. Hampden Jackson, N. A. Holdaway (a Marxist theorist and schoolmaster, and a director of the centre), Geoffrey Sainsbury, Reinhold Niebuhr, Karl Polanyi, John Strachey, Plowman and Common.Peter Davison (editor), George Orwell: A Kind of Compulsion 1903–1936 (1998), p. 493."]}, {"page": "Penguin poetry anthologies", "response": ["Kenneth Allott - W. H. Auden - George Barker - Julian Bell - John Betjeman - Ronald Bottrall - Norman Cameron - Christopher Caudwell - John Cornford - Hugh Sykes Davies - Clifford Dyment - William Empson - Gavin Ewart - Edgar Foxall - Roy Fuller - David Gascoyne - Geoffrey Grigson - Bernard Gutteridge - Robert Hamer - Rayner Heppenstall - Peter Hewitt - Laurie Lee - John Lehmann - C. Day-Lewis - Louis MacNeice - Charles Madge - H. B. Mallalieu - Philip O'Connor - Clere Parsons - Geoffrey Parsons - F. T. Prince - John Pudney - Henry Reed - Anne Ridler - Michael Roberts - Roger Roughton - Francis Scarfe - John Short - Bernard Spencer - Stephen Spender - Randall Swingler - Julian Symons - Dylan Thomas - Ruthven Todd - Rex Warner - Vernon Watkins"]}, {"page": "B. S. Johnson", "response": ["Johnson led and associated with a loose circle of experimental authors in 1960s Britain, who included Alan Burns, Eva Figes, Rayner Heppenstall, Ann Quin, Stefan Themerson, Wilson Harris and others. Many contributed to London Consequences, a novel consisting of a palimpsest of chapters passed between a range of participating authors, edited by Margaret Drabble and Johnson. Johnson also made numerous experimental films, published poetry, and wrote reviews, short stories and plays. For some years he was poetry editor of Transatlantic Review."]}, {"page": "Heppenstall", "response": ["* Rayner Heppenstall (1911–1981), British novelist, poet, diarist, and radio producer"]}, {"page": "Martin Seymour-Smith", "response": ["The polyglot Seymour-Smith further used the book to champion writers he regarded as under-rated, such as James Hanley, Laura Riding, Wyndham Lewis, Roberto Arlt, Pio Baroja, Rayner Heppenstall and Jose Maria Arguedas, while attacking those he felt were overvalued, such as George Bernard Shaw, W. H. Auden and as mentioned above, T. S. Eliot. Seymour-Smith also disparaged Harold Pinter, Margaret Atwood, and Tom Stoppard, whom he thought over-rated.  "]}, {"page": "Eva Figes", "response": ["In the 1960s, she was associated with an informal group of experimental British writers influenced by Rayner Heppenstall that included Stefan Themerson, Ann Quin, Alan Burns, and its informal leader, B. S. Johnson. Unger worked in publishing until 1967, when she became a full-time writer."]}, {"page": "Léon Bloy", "response": ["A study in English is Léon Bloy by Rayner Heppenstall (Cambridge: Bowes & Bowes, 1953)."]}, {"page": "The Phoenix (pacifist journal)", "response": ["A pacifist quarterly, The Phoenix was noteworthy for the willingness of its editors to publish material that the mainstream media would consider countercultural, radical, and revolutionary.  The writing of Henry Miller, which could find no outlet elsewhere in the United States at the time, was featured in all of the initial issues, as were excerpts from the diaries of Anaïs Nin.  The works of writers such as Hervey White, Kay Boyle and Jean Giono were printed in their entirety, as well as the poetry of Robert Duncan, Rayner Heppenstall, Derek Savage,Guardian obituary of Derek Savage. Thomas McGrath, J. C. Crews and William Everson (Brother Antonius)."]}, {"page": "Young Men in Spats", "response": ["Richard Usborne adapted \"The Amazing Hat Mystery\" into a radio drama, which was broadcast on the BBC Home Service on 25 April 1962. Produced by Rayner Heppenstall, \"The Amazing Hat Mystery\" featured Ronald Baddiley as Percy Wimbolt, David Enders as Nelson Cork, Denise Bryer as Elizabeth Bottsworth, and Mary Wimbush as Diana Punter."]}, {"page": "Mull Little Theatre", "response": ["*Jules Renard - Clean Break; Daily Bread (translated by Rayner Heppenstall, first stage production)"]}, {"page": "Ann Quin", "response": ["Quin is associated with a loosely constituted circle of 'experimental' authors in Sixties Britain, headed by B. S. Johnson and including Stefan Themerson, Rayner Heppenstall, Alan Burns and Eva Figes, influenced by Samuel Beckett and recent French fiction (Marguerite Duras, Alain Robbe-Grillet). They stood in opposition to the dominant tendency for social realism, manifest from John Osborne and John Wain to Karl Miller's Writing in England Today (Penguin, 1968).Gordon, Giles, \"Introduction\", to Ann Quin, Berg, Dalkey Archive, 2001. pp xii-xiv."]}, {"page": "1940 in poetry", "response": ["* Rayner Heppenstall, Blind Men's Flowers are Green"]}, {"page": "Max Plowman", "response": ["Plowman co-founded in 1934 and ran the Adelphi Centre.First World War.com – Prose & Poetry – Max Plowman It was an early commune, based on a farm in Langham, Essex bought by Middleton Murry.Dennis Hardy, Utopian England: Community Experiments, 1900–1945 (2002), p. 42. Short-lived in its original conception, it ran a Summer School in August 1936 that was stellar: Orwell spoke on \"An Outsider Sees the Distressed Areas\" on 4 August, with Rayner Heppenstall in the chair. Other speakers were Steve Shaw, Herbert Read, Grace Rogers, J. Hampden Jackson, N. A. Holdaway (a Marxist theorist and schoolmaster, and a Director of the Centre), Geoffrey Sainsbury, Reinhold Niebuhr, Karl Polanyi, John Strachey, Plowman and Common.Peter Davison (editor), George Orwell: A Kind of Compulsion 1903–1936 (1998), p. 493."]}, {"page": "Edgar Foxall", "response": ["*Proems (1938)With Oswald Blakeston, Lawrence Durrell, Patrick Evans, Rayner Heppenstall and Ruthven Todd."]}, {"page": "Gangrel (magazine)", "response": ["The first issue of Gangrel appeared in October 1945. The magazine was based in London and was published on a quarterly basis. Running to a total of four issues between 1945 and 1946, it included articles by Alfred Perles, Henry Miller, Robert Simpson, Neil M. Gunn, Rayner Heppenstall and George Orwell, as well as poems by Lawrence Durrell, R. S. Thomas, James Kirkup and Kenneth Patchen."]}, {"page": "Nineteen Eighty-Four", "response": ["Other influences include Darkness at Noon (1940) and The Yogi and the Commissar (1945) by Arthur Koestler; The Iron Heel (1908) by Jack London; 1920: Dips into the Near FutureJohn A. Hobson, 1920: Dips into the Near Future by John A. Hobson; Brave New World (1932) by Aldous Huxley; We (1921) by Yevgeny Zamyatin which he reviewed in 1946;George Orwell, \"Review\", Tribune, 4 January 1946. paraphrasing Rayner Heppenstall, he reportedly said \"that he was taking it as the model for his next novel\". Bowker, p. 340. and The Managerial Revolution (1940) by James Burnham predicting perpetual war among three totalitarian superstates. Orwell told Jacintha Buddicom that he would write a novel stylistically like A Modern Utopia (1905) by H. G. Wells."]}, {"page": "July 1911", "response": ["*Born: Rayner Heppenstall, British novelist and radio producer, in Lockwood, West Yorkshire (d. 1981)"]}, {"page": "London Consequences", "response": ["The interior chapters are by Rayner Heppenstall, Eva Figes, Gillian Freeman, Jane Gaskell, Wilson Harris, Olivia Manning, Adrian Mitchell, Paul Ableman, John Bowen, Melvyn Bragg, Vincent Brome, Peter Buckman, Alan Burns, Barry Cole, Julian Mitchell, Andrea Newman, Piers Paul Read and Stefan Themerson."]}, {"page": "Temporary gentlemen", "response": ["Other former temporary officers joined the colonial police services where they could more easily maintain their status as gentlemen.  As with the First World War the post-war memoirs of serving officers are dominated by the works of temporary gentlemen, such as Freddie Spencer Chapman.  In Evelyn Waugh's 1945 novel Brideshead Revisited the main character, the middle-class Charles Ryder, despises his subordinate, the temporary gentleman Hooper.  Rayner Heppenstall's 1946 short story \"Local Boy\" focuses on the awkward relationship between a temporary gentleman and his working-class family and neighbours."]}, {"page": "Juliet Jacques", "response": ["She began her journalistic career writing about film for Filmwaves, Cineaste and other film publications, while working in a data entry job in Brighton. In 2007, she published a book on English avant-garde author Rayner Heppenstall for Dalkey Archive Press."]}, {"page": "Bachelor griller", "response": ["George Orwell used a bachelor griller in 1935 while sharing a flat with Rayner Heppenstall in Bloomsbury, London."]}, {"page": "Charles William Daniel", "response": ["A new journal, Focus (later changed to Purpose) was a more general cultural magazine. Its long list of contributors includes Henry Miller, Lawrence Durrell, John Middleton Murry, T. S. Eliot, Elizabeth Bowen, Rayner Heppenstall and Dylan Thomas among lesser-known names. Most of the editing work of this magazine was done by Daniel's associate W. T. Symons – they seem to have shared the pseudonym \"John Marlow\". "]}, {"page": "Style (book)", "response": ["Style was generally well received.F. L. Lucas, Style: The Art of Writing Well, Harriman House Publishing 2012, pp.i–iii (press quotations)Nowell-Smith, Simon, The House of Cassell, 1848-1958 (London 1958) \"A delightful book,\" wrote Time and Tide, \"exemplifying brilliantly all that it seeks to instill – enjoyment of reading and mastery of writing.\"Hugh Gordon Porteus, review of Style in the Time and Tide, September 1955 It was Lucas's most successful book.Wilkinson, L. P., Kingsmen of a Century, 1873–1972 (Cambridge 1980) He had long had a reputation as a stylist,Sir Richard Livingstone, Foreword to Lucas's Euripides and his Influence (Boston 1923)Lucas's own style had been analysed in A. J. J. Ratcliff's Prose of Our Time (London 1931) \"one whose pen possesses the sparkle and fascination which made the essay, in the hands of writers such as Bacon and Montaigne, a thing of beauty and interest\".Cassell's advertisement for Lucas's Studies French and English (London 1934), dust-jacket Raymond Mortimer in The Sunday Times, however, found the author \"sometimes laboured in his anxiety to be debonair\". Some reviewers expressed the view that \"The book's most obvious merit lies in its quotations\" (Rayner Heppenstall in the New Statesman). \"There are almost as many in French as in English, and their range and aptness are remarkable.\"Rayner Heppenstall, 'Prose for General Purposes', review of Style in The New Statesman and Nation, 24 September 1955, p.371-372 Others, however, felt that there should have been fewer examples from poetry and more from contemporary prose.J. M. Cohen, review of Style in The Spectator, 18 November 1955 The Listener approved \"the entertaining relevance of anecdote\".Review of Style in The Listener, September 1955 Sir Bruce Fraser praised Lucas's close analysis of faulty style: \"The passage in which he dissects a great hunk of Swinburne's prose, reduces it by more than half, recognizes that it could be made shorter still, and ends by suggesting that it need not have been written at all, is in itself worth the whole price of the book\".Foreword by Sir Bruce Fraser to 1974 Cassell reprint of Style Philip Toynbee of The Observer disliked the work and dismissed its author as \"middlebrow\": \"There have been wonderful styles which illustrate the virtues of clarity, brevity, simplicity and vitality. Other styles, no less wonderful, have exhibited obscurity, amplitude, complexity and decadence. Good writers have been urbane, gay and healthy: other good writers have been boorish, melancholic and diseased... Mr Lucas pays lip-service to the recalcitrant disorder of the scene\" but \"writes far too briefly of variety\".Philip Toynbee, review of Style in The Observer, 11 September 1955 More recently, Joseph Epstein in The New Criterion (2011) considered the book \"filled with fine things ... F. L. Lucas wrote the best book on prose composition, for the not-so-simple reason that, in the modern era, he was the smartest, most cultivated man to turn his energies to the task\".Epstein, Joseph, 'Heavy Sentences', The New Criterion June 2011  The 2011 article \"brought attention to this neglected classic and helped set in train its reissue\".F. L. Lucas, Style: The Art of Writing Well (Harriman House Publishing 2012), Publisher's Acknowledgements, p.257Walther, Matthew, 'The Art of Writing Well', review of Style in New English Review, July 2012"]}, {"page": "Michael Sayers", "response": ["In the 1930s, age 18, Sayers first worked for T.S. Eliot, who made him a theater reviewer for The Criterion.    A.R. Orage gave him the same role for The New English Weekly.  Through A.R. Orage, Sayers wound up sharing a flat with fellow writers Rayner Heppenstall and Eric Blair (\"George Orwell\").  Sayers published stories in Edward J. O'Brien's annual Best British Short Stories."]}]}}