{"wiki_id": "http://www.wikidata.org/entity/Q729092", "itemLabel": "James Meek", "itemDescription": "British novelist and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Meek_(author)", "wikipedia_page": {"main": "James Meek (born 1962) is a British novelist and journalist, author of The People's Act of Love. He was born in London, England, and grew up in Dundee, Scotland.", "link_mentions": [{"page": "Borscht", "response": ["In the Soviet Union, borscht was one of the most popular everyday dishes. It was described by James Meek, a British correspondent in Kyiv and Moscow, as \"the common denominator of the Soviet kitchen, the dish that tied together ... the high table of the Kremlin and the meanest canteen in the boondocks of the Urals, ... the beetroot soup that pumped like a main artery through the kitchens of the east Slav lands\". Among Soviet leaders, the Ukrainian-born Leonid Brezhnev was especially partial to borscht, which his wife continued to personally cook for him even after they had moved into the Kremlin."]}, {"page": "Royal Society of Literature", "response": ["| James Meek"]}, {"page": "Czechoslovak Legion", "response": ["The 2005 novel The People's Act of Love, by the British writer James Meek, describes the occupation of a small Siberian town by a company of the Czechoslovak Legion in 1919. The original inhabitants of the town are members of the Christian sect of Skoptsy, or castrates."]}, {"page": "Krishna Dharma", "response": ["In 1999 Krishna Dharma published the first edition of his adaptation of the Mahabharata. British author and journalist James Meek wrote in his review in The Guardian:"]}, {"page": "Orwell Prize", "response": ["**James Meek – Private Island: Why Britain Now Belongs to Someone Else"]}, {"page": "Grove Academy", "response": ["* James Meek, author"]}, {"page": "Department of Journalism, City University", "response": ["* James Meek – writer, former ITN journalist"]}, {"page": "Canongate Books", "response": ["James Meek (author)"]}, {"page": "James Meek", "response": ["James Meek FRSE (1742–1810) (or Meik) was Minister of Cambuslang from 1774 until his death. He was Moderator of the General Assembly of the Church of Scotland in 1795, but is most remembered as the model Enlightenment cleric who wrote the entry for Cambuslang in the First Statistical Account of Scotland.", "James Meek was born the son of John Meek and Janet Millar of Fortissat House in Shotts. He was baptized in Shotts Parish Church on 21 March 1740, according to the Parish records, two years after a brother John. His family were minor landowners, or lairds who had held land in the area since at least the 17th century. Several of his ancestors had been cautioned, imprisoned and bonded, and finally had their land confiscated for Covenanting activity during the reign of King James VII. There is a so-called Covenanters Stone still at Fortissat, and the Mains Farm still exists, as does Fortissat House. The family lands were restored with the so-called Glorious Revolution, when William of Orange invaded England and drove King James VII from is throne. Meek's coat-of-arms incorporated the family motto Jungor ut implear (\"I am joined that I may be complete\", or \"Unity is Strength\") and all the heraldric colours and elements of the family - crescents, duck proper and boar's head. James Meek later experienced great difficulties at the hands of Parishioners who saw themselves as the heirs of the Covenanters and him as their enemy. His brother William inherited the estates and James carried on a family tradition of going into the Church.", "An appeal was lodged with the Synod of Glasgow and Ayr. This, on the 12th of October, ordered the Presbytery to investigate the objections thoroughly, which it did by means of a committee. It restated its earlier findings (that the objections were groundless) and issued a lesser form of excommunication on some of the objectors. The objectors appealed again to the Synod, which, in October 1774, overturned the judgement of the Presbytery. It was then referred to the following year's  General Assembly. Mr Meek had been invited to preach to the Lord High Commissioner, the King's emissary to the Assembly - an indication of the high esteem in which Mr Meek continued to be held. He preached from Luke xxiv. 26, and in his sermon repeated some of the doctrines which the objectors had raised. The Assembly considered the case on 31 May 1775. During the debate, Meek had some heavyweight support, including that of a previous Moderator of the General Assembly, namely the famous historian Principal Robertson, whose nephew John Robertson was to become Meek's assistant and successor. Its judgement was \"The General Assembly having reasoned on this affair, did, and hereby do dismiss the process... and sustain Mr James Meek, minister of Cambuslang.\" This ended the formal objections to Meek becoming minister at Cambuslang.", "* Boswell, James, Parish of Cambuslang : the commissioners of His Grace the Duke of Hamilton ... who has presented the Reverend Mr. James Meek ... to that ... parish; and certain heritors, and a few heads of families ... appellents; all the elders\", one hundred heads of families, and certain heritors ... respondents Church of Scotland 1773"]}, {"page": "Ondaatje Prize", "response": ["*2006 James Meek, The People's Act of Love"]}, {"page": "Duncan McLean (writer)", "response": ["In December 1990, with the writer James Meek, McLean set up and ran the Clocktower Press, a small but influential publishing house, which helped bring a new generation of Scottish writers to wider attention. McLean, Meek and the artist Eddie Farrell invested £50 each to print the first booklet, Safe/Lurch, with both writers contributing a story and Farrell illustrating the cover. After the first three booklets Meek moved to Kiev and McLean went on to publish seven more, including the first separately-published extracts of what would later become Irvine Welsh's Trainspotting. The fifth of the Clocktower series, it was printed in April 1992 in an edition of 300 under the title Past Tense: four stories from a novel."]}, {"page": "Association for Scottish Literary Studies", "response": ["Since its first issue in 1983, many contemporary Scottish writers have had early work published in ASLS's annual anthology of new short fiction and poetry, New Writing Scotland, including Leila Aboulela, Lin Anderson, Iain Banks, Polly Clark,  Anne Donovan, Janice Galloway, Jane Harris, Gail Honeyman, Kathleen Jamie, A L Kennedy, James Meek, Ian Rankin, James Robertson, Suhayl Saadi, Ali Smith, Chiew-Siah Tei, Irvine Welsh, and others. New Writing Scotland is part-funded by Creative Scotland."]}, {"page": "The Guardian", "response": ["* Foreign Reporter of the Year (James Meek, 2004; Ghaith Abdul-Ahad, 2008);"]}, {"page": "Walter Scott Prize", "response": ["* James Meek, To Calais, In Ordinary Time — 14th century, England"]}, {"page": "Meek (surname)", "response": ["* James Meek, minister", "* James Meek (author)"]}, {"page": "2012 Costa Book Awards", "response": ["*James Meek, The Heart Broke In"]}, {"page": "Dhaka Lit Fest", "response": ["Notable international guests include V. S. Naipul, Adunis, Shashi Tharoor, William Dalrymple (historian), Tilda Swinton, Marcel Theroux, Lionel Shriver, Shirshendu Mukhopadhyay, Mohammed Hanif, Nandita Das, Monica Ali, HM Naqvi, Tishani Doshi, Swapnamoy Chakraborty, James Meek (author), Jude Kelly, and Jon Snow (journalist), among many others."]}, {"page": "Scottish Mortgage Investment Trust Book Awards", "response": ["*2006 James Meek, The People's Act of Love"]}, {"page": "Cultural depictions of Isabella of France", "response": ["* To Calais, in Ordinary Time (2019) by James Meek."]}, {"page": "List of people from Broughty Ferry", "response": ["*James Meek, journalist"]}, {"page": "Jerwood Fiction Uncovered Prize", "response": ["*The Heart Broke In by James Meek"]}, {"page": "Kätlin Kaldmaa", "response": ["* James Meek Suurim armastusakt (The People's Act of Love, Eesti Päevaleht, 2008)"]}, {"page": "J Meek", "response": ["#REDIRECT James Meek (author)"]}, {"page": "Talking Politics", "response": ["| James Meek on the NHS", "| James Meek, British journalist and novelist, author of the discussed article NHS SOS published in the London Review of Books"]}]}}