{"wiki_id": "http://www.wikidata.org/entity/Q7298803", "itemLabel": "Raymond Glendenning", "itemDescription": "British sports commentator", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_Glendenning", "wikipedia_page": {"main": "Raymond Carl Glendenning (25 September 1907 – 23 February 1974) was a BBC radio sports commentator and occasional character actor.", "link_mentions": [{"page": "Hancock's Half Hour", "response": ["* Other guest stars: Noel Dryden (episode 1);  Anne Lancaster (episode 4, 14); Liz Fraser (episode 4); Raymond Glendenning (episode 5); Lillian Grasson (episode 6); Fraser Kerr (episodes 6, 11); Lee Crutchley (episode 6); Harry Towb (episode 7); Mavis Villiers (episode 9); Errol McKinnon (episode 9); Jack Watson (episode 10, 14); Fenella Fielding (episode 11); Joan Frank (episode 12); Frank Partington (episode 13); impressionist Peter Goodwright (episode 14); Jerry Stovin (episode 14); Ronald Wilson (episode 14);"]}, {"page": "List of sports announcers", "response": ["* Raymond Glendenning – BBC Radio late 1939–1964", "* Raymond Glendenning – BBC Radio at least 1938–1960", "* Raymond Glendenning – BBC Radio 1945-1963, BBC Sport 1950-1951"]}, {"page": "The Rag Trade", "response": ["| Guest Stars: Frank Thornton and Raymond Glendenning"]}, {"page": "The Iron Maiden", "response": ["* Raymond Glendenning as the Rally's MC."]}, {"page": "Ted Lowe", "response": ["Born in Lambourn, Berkshire, Lowe was general manager of London's Leicester Square Hall, the home of professional billiards and snooker. He got his break one day when the BBC's regular commentator, Raymond Glendenning, was suffering from laryngitis."]}, {"page": "Sports Report", "response": ["*Raymond Glendenning (1948–53)"]}, {"page": "1962 FA Cup Final", "response": ["BBC Radio commentary was provided by Raymond Glendenning and Alan Clarke"]}, {"page": "London After Dark", "response": ["The commentators featured on the first edition of London After Dark were Murrow, CBC radio reporter Robert Bowman, Raymond Glendenning, Larry LeSueur, Eric Sevareid, Vincent Sheean, Michael Standing, Wynford Vaughan-Thomas, and J. B. Priestley."]}, {"page": "1974 in the United Kingdom", "response": ["* 23 February – Raymond Glendenning, radio sports commentator (born 1907)"]}, {"page": "1951 FA Cup Final", "response": ["Radio listeners around the nation could tune in to hear the match on the BBC light programme with commentary from Raymond Glendenning. However, only the second half of the match was televised by the BBC with commentary from Jimmy Jewell, his last cup final before his death the following year,<Ref></Ref> and Kenneth Wolstenholme.<Ref></ref> The Television footage has since been lost."]}, {"page": "1963 FA Cup Final", "response": ["The game was broadcast live on BBC television as a cup final special edition of Grandstand, making it the 19th cup final to be broadcast live on television. The programme was presented by David Coleman from pitchside, where he spent the build-up to the game interviewing the players and officials as they walked onto the field an hour before kick-off. He then handed over to commentator Ken Wolstenholme, who was acting as the television commentator for his 11th FA Cup final. The match was broadcast in black and white, so the BBC requested that one team change kit, as the red of Manchester United and blue of Leicester would be indistinguishable to the viewers; Leicester was the team to change, wearing their white away kit. A newsreel broadcast was also shown in cinemas that evening by both Pathé and Movietone, both in colour. BBC radio coverage was provided by Raymond Glendenning and Alan Clarke, with a young Brian Moore acting as pitchside reporter."]}, {"page": "1907 in the United Kingdom", "response": ["* 25 September – Raymond Glendenning, radio sports commentator (died 1974)"]}, {"page": "1907 in Wales", "response": ["*25 September – Raymond Glendenning, radio sports commentator (died 1974)"]}, {"page": "Peter Bromley", "response": ["By 1960, criticism from the racing fraternity of Raymond Glendenning's commentaries - he showed little interest in the sport and required the assistance of a race reader - was intensifying, and the rise of television was making the field of commentary more specialised.  Bromley was advised by Peter Dimmock not to go to radio because Peter O'Sullevan could not go on forever (O'Sullevan was only 42 at the time) and he would be the next in line, but after commentating for radio on a number of races in 1960, Bromley became BBC Radio's main racing commentator from the beginning of 1961 (Glendenning's last racing commentary was on the King George VI Chase at Kempton Park on 26 December 1960, although he would continue to commentate on football, racing and tennis until the early part of 1964).  Bromley would, however, continue to commentate for BBC Television on occasions until around 1970."]}, {"page": "Twmbarlwm", "response": ["The hillfort is known to locals as \"the pimple\" or \"the nipple\". An example of the use of the term \"pimple\" came during a boxing commentary on national radio by the BBC's Raymond Glendenning, who had grown up in Newport. As one of the boxers rose after being floored, Glendenning excitedly announced to the listeners that \"he has a lump on his head the size of the pimple on the top of Twm Barlwm!\""]}, {"page": "Newport High School, Bettws Lane", "response": ["* Raymond Glendenning, sports commentator"]}, {"page": "Make Mine a Million", "response": ["* Raymond Glendenning - Himself, Cameo appearance "]}, {"page": "Dry Rot (film)", "response": ["* Raymond Glendenning as himself"]}, {"page": "The Galloping Major (film)", "response": ["It features appearances by several figures well known at the time, including the jockey Charlie Smirke and the radio commentators Raymond Glendenning and Bruce Belfrage."]}, {"page": "The Rainbow Jacket", "response": ["Sixty years after the premiere, TV Guide felt that \"a trite outcome mars this fairly entertaining film, which features real-life British racing figures Raymond Glendenning and Gordon Richards,\" while Time Out noted that the film was \"the first collaboration between Dearden and TEB Clarke after The Blue Lamp...Despite its intriguing subject, the film offers little but the cosy, sentimental view of life that is typical of late Ealing films.\""]}, {"page": "Handlebar Club", "response": ["The world's oldest whisker club, the Handlebar Club was founded in a London pub in April 1947 by a convivial gathering of ten, including raconteurs Jimmy Edwards and Frank Muir as well as sports commentator Raymond Glendenning. Their stated intention was to show that \"men with moustaches are men of good character\", and the mustachioed cohort resolved to meet monthly for \"sport, conviviality\" and charitable engagements. Enormous moustaches were quite popular among the flying officers of the Royal Air Force in the Second World War, and in founding the club Edwards sought to perpetuate the custom. The Strand Magazine greeted the establishment as \"an indication that Handlebars have outlived their time\", interpreting the preponderance of \"men with a distinctive type of face-wear\" banding together as a sign of weakness.", "The club was founded in April 1947 in the dressing room of comedian Jimmy Edwards at the Windmill Theatre in London. There were 10 founder members, including Edwards, Raymond Glendenning, and Frank Muir. The minutes of that first meeting are in the Club archives and it appears that although there was a goodly number of founder members they were outnumbered by chorus girls!"]}, {"page": "Alan Clarke (sports commentator)", "response": ["Alan Clarke (1920–1969) was a BBC Radio sports commentator from 1947 to 1969, who covered every major football event alongside Raymond Glendenning, Maurice Edelston, Brian Moore and Peter Jones. He was at the microphone as Geoff Hurst scored England's 4th in the 1966 FIFA World Cup Final. He died in May 1969 at the age of 49. His last broadcast was the second leg of the European Cup semi-final between Manchester United and A.C. Milan earlier in the month. He commentated on other sports including motor racing and also hosted music programmes for the Corporation throughout his career, and for some time he was head of sport for the BBC in the North of England."]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["*  Chose as one of his records a football commentary by Raymond Glendenning of Bolton Wanderers versus Chelsea F.C., 2 June 1945."]}, {"page": "Small Town Story (film)", "response": ["Small Town Story is a 1953 British thriller, directed by Montgomery Tully and starring Donald Houston and Susan Shaw (in a rare bad-girl role).  The film is set in the world of association football and features appearances from sporting legend Denis Compton and commentator Raymond Glendenning, as well as players from the Arsenal, Millwall and Hayes football teams.  It also features the only screen acting credit of Kent Walton, later to himself become a famous sports commentator.", "*  Raymond Glendenning as Himself"]}, {"page": "Asking for Trouble", "response": ["* Raymond Glendenning as Commentator"]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Raymond Glendenning||Pears Cyclopaedia||Watercolour paints|| more"]}, {"page": "1956 Grand National", "response": ["Aintree maintained a refusal to allow the race to be broadcast either live or delayed by any Television company, the BBC having submitted a request every year since 1946. However, The BBC's rights to broadcast the race live on radio remained in place, making this the twenty-fifth consecutive live coverage of the race since 1927. The race was broadcast live on the BBC Light Programme from 3pm with Raymond Glendenning calling in the winner while Michael O'Hehir and Peter O'Sullevan called the action out in the country. Claude Harrison, Bob Haynes, and Aubrey Renwick assisted by calling competitors that dropped out of the race. As per all previous years, part of the agreement to broadcast was that the copyright for the recording would be held by Tophams and not the BBC.  https://genome.ch.bbc.co.uk/page/8842832a0de44cdd8af235c8be0aa583?page=8 "]}, {"page": "1951 Grand National", "response": ["The BBC had requested to screen the race live on Television but Aintree refused, leaving the BBC light radio programme to issue a thirty-minute broadcast at 3pm. David Black called the runners over the early fences, Michael O'Hehir took over at Becher's and Canal turn with Richard North calling them up the Canal Side before handing over to lead commentator, Raymond Glendenning to call the runners home. Each commentator was assisted by a race caller who would spot and identify horses departed the contest. Peter O'Sullevan, who would eventually be known as the voice of Racing, this year acted as O'Hehir's caller.https://genome.ch.bbc.co.uk/page/b06143a9960744fe8151ae924fa341e3?page=35"]}, {"page": "List of Freemasons (E–Z)", "response": ["* Raymond Glendenning (1907-1974), British BBC sports commentator. Nioba Lodge No 5264 (Newport, Wales), Avenue Lodge No 3231 (London), Shakespear Lodge No 99 (London), and Grand Stewards' Lodge (London)."]}, {"page": "Glendenning (disambiguation)", "response": ["* Raymond Glendenning, BBC radio sports commentator"]}, {"page": "1952/1953 News of the World Snooker Tournament", "response": ["On 6 December the BBC showed two short, 30 minute, TV programmes of the final day of the match between Joe Davis and John Pulman. The commentators were Raymond Glendenning and  Sidney Smith."]}, {"page": "1907 in radio", "response": ["* September 25 – Raymond Glendenning, Welsh-born radio sports commentator (died 1974)"]}, {"page": "List of Wimbledon broadcasters", "response": ["|Raymond Glendenning"]}]}}