{"wiki_id": "http://www.wikidata.org/entity/Q7298247", "itemLabel": "Ray Walker", "itemDescription": "British footballer (born 1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Walker_(footballer,_born_1963)", "wikipedia_page": {"main": "Raymond Walker (born 28 September 1963) is an English former football midfielder. He played 440 games for Port Vale in all competitions between 1986 and 1997, ensuring himself a place in the club's history. He was twice the club's player of the season, and was named on the PFA Team of the Year three times. He was promoted twice with the club and also played a part in the club's highest ever post-war finish in the English Football League. With Aston Villa in the early '80s, he joined Port Vale in 1986, after a short loan spell in 1984. After eleven years at Vale Park he went into non-league football with Leek Town and Newcastle Town.", "link_mentions": [{"page": "Port Vale F.C.", "response": ["Following McGrath's dismissal, his assistant John Rudge was appointed as manager in December 1983. Though he was unable to halt Vale's immediate return to the bottom tier of the Football League, he succeeded in steadying the ship. Helped by the goals of prolific Welshman Andy Jones, Vale were promoted back to the third tier in 1985–86 after losing just once at Vale Park in the league all season. A major cup upset came on 30 January 1988, when Vale defeated First Division side Tottenham Hotspur 2–1, thanks to a superb strike from Ray Walker. After three seasons in the third tier, Rudge's Vale achieved another promotion in 1988–89 after Robbie Earle scored the winning goal at Vale Park to complete a 2–1 aggregate play-off final victory over Bristol Rovers; this marked the club's return to the Second Division after a 33-year absence."]}, {"page": "Robbie Earle", "response": ["Earle won a regular first team place in August 1984, and hit 19 goals in 56 games in 1984–85, including a hat-trick against Hereford United at Vale Park on 2 February; Earle and Alistair Brown's partnership got the club a combined total of 40 goals. An ever-present in the 1985–86 Fourth Division promotion squad, he scored 17 goals in 58 games; he and strike partner Andy Jones bagged a total of 35 goals for the club. Earle made 142 consecutive appearances between September 1984 and January 1987, the run coming to an end due to a groin strain. The strain led to a hernia operation in the autumn of 1987, but he returned to first team action in January 1988. He scored seven goals in 35 games in 1986–87 and scored four goals in 11 games in 1987–88. That season he played in the FA Cup upset when Vale knocked out Tottenham Hotspur.  A regular in the 1988–89 season, Rudge claimed that Earle and Ray Walker was one of the best-ever midfield partnerships at the Vale. He scored both goals past Bristol Rovers in the two-legged 1989 play-off final that took Vale through to the Second Division. After the match Earle wept in the tunnel, such was his emotions to have taken his local team to victory in the play-off final. Over the course of the 1988–89 campaign he scored 19 goals in 57 appearances."]}, {"page": "John Rudge", "response": ["Major signings for the start of the 1986–87 season were Mark Grew and Ray Walker (£12,000 from Aston Villa), who would feature heavily for the club in the coming years, as well as Paul Smith. Smith was purchased for £10,000 from Sheffield United and was sold for four times that figure to Lincoln City just over a year later. The club finished mid-table, twelve points above the drop. The winter signing of veteran Bob Hazell helped to shore up the Vale's defence. At the end of the season, Bill Bell was made the club's chairman. Also Darren Beckford was signed from Manchester City for £15,000. He would become the club's top scorer for the next four seasons."]}]}}