{"wiki_id": "http://www.wikidata.org/entity/Q7290627", "itemLabel": "Rana Dasgupta", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rana_Dasgupta", "wikipedia_page": {"main": "Rana Dasgupta (born 5 November 1971 in Canterbury, England) is a British Indian novelist and essayist. He grew up in Cambridge, England, and studied at Balliol College, Oxford, the Conservatoire Darius Milhaud in Aix-en-Provence, and, as a Fulbright Scholar, the University of Wisconsin–Madison. In 2010 The Daily Telegraph called him one of Britain's best novelists under 40. In 2014 Le Monde named him one of 70 people who are making the world of tomorrow. Among the prizes won by Dasgupta's works are the Commonwealth Prize and the Ryszard Kapuściński Award.\nDasgupta is a former Literary Director of the JCB Prize for Literature.", "link_mentions": [{"page": "1971 in literature", "response": ["*November 5 – Rana Dasgupta, English-born Indian novelist"]}, {"page": "John Llewellyn Rhys Prize", "response": ["|2005 || Uzodinma Iweala || Beasts of No Nation || ||Rana Dasgupta, Tokyo CancelledPeter Hobbs, The Short Day DyingSinéad Morrissey, The State of the PrisonsRebecca Ray, NewfoundlandRachel Zadok, Gem Squash Tokoloshe"]}, {"page": "Hilary and Jackie", "response": ["Rana Dasgupta wrote in an essay about biographical films that \"the film's tagline – 'The true story of two sisters who shared a passion, a madness and a man' – is a good indication of its prurient intent. The book's moving account of love and solidarity, whose characters are incomplete and complex but not \"mad\", is rejected in favour of a salacious account of social deviance.\" Essay about Beethoven, du Pre and biographical films."]}, {"page": "List of Balliol College, Oxford people", "response": ["* Rana Dasgupta (1990)"]}, {"page": "2005 in literature", "response": ["*Rana Dasgupta – Tokyo Cancelled"]}, {"page": "Orwell Prize", "response": ["**Rana Dasgupta – Capital: The Eruption of Delhi"]}, {"page": "List of people from Kent", "response": ["*Rana Dasgupta (born 1971) – writer"]}, {"page": "Jaipur Literature Festival", "response": ["The 2009 festival had about 12,000 attendees and over 140 authors/speakers including Vikram Seth, Pico Iyer, Michael Ondaatje, Simon Schama, Tina Brown, Hanif Kureshi, Hari Kunzru, Pankaj Mishra, Tariq Ali, Ahmed Rashid, Patrick French, Mohsin Hamid, Mohammed Hanif, Wendy Doniger, Sunil Gangopadhyay, Tarun Tejpal, Sashi Tharoor, U R Ananthmurthy, Alka Saraogi, Anuragh Mathur, Ashok Vajpeyi, Ashis Nandy, Basharat Peer, Charles Nicoll, Christophe Jaffrelot, Colin Thubron, Daniyal Mueenuddin, Geetanjali Shree, Mukul Kesavan, Musharraf Ali Farooqui, G. T. Narayana Rao, Nikita Lalwani, Paul Zacharia, Pavan K Varma, Rana Dasgupta, S R Faruqui, Tash Aw, Udayan Vajpeyi, Farah Khan and Sonia Faleiro, with music provided by DJ Cheb i Sabbah, Nitin Sawney, Salman Ahmad (Junoon Unplugged), Shye Ben Tzur, Rajasthan Roots, Paban Das Baul and others in evening concerts over the five days. The special theme was the oral tradition, in India and elsewhere."]}, {"page": "Dasgupta", "response": ["* Rana Dasgupta, British-Indian writer"]}, {"page": "List of British Indians", "response": ["* Rana Dasgupta, author"]}, {"page": "Rana (name)", "response": ["* Rana Dasgupta (born 1971), British-Indian novelist and essayist"]}, {"page": "Bengal Film Journalists' Association – Best Cinematographer Award", "response": ["| 2007 || Rana Dasgupta || Kantataar"]}, {"page": "Kantatar", "response": ["|Rana Dasgupta"]}, {"page": "Fasting, Feasting", "response": ["*Introduction to Anita Desai's Fasting, Feasting by Rana Dasgupta"]}, {"page": "John Freeman (author)", "response": ["Freeman joined the UK-based Granta in December 2008, became acting editor in May 2009, and was named editor in October 2009. While at the magazine, he edited Mary Gaitskill, Kenzaburō Ōe, Rana Dasgupta, Dinaw Mengestu, Peter Carey, Jeanette Winterson, Natsuo Kirino, Victor LaValle, Herta Müller, Daniel Alarcón, Wole Soyinka, Aleksandar Hemon, Salman Rushdie, Yiyun Li, Tony D'Souza, Colum McCann, Ngũgĩ wa Thiong'o, George Saunders, Marie Darrieussecq, Joshua Ferris, Aminatta Forna, Jim Crace, Richard Russo, Kamila Shamsie, Mo Yan, A. L. Kennedy, Mohsin Hamid, and Chimamanda Adichie. Writers who debuted in Granta during his tenure included Chinelo Okparanta, Phil Klay, Claire Vaye Watkins and Maria Venegas."]}, {"page": "Anupam Mishra", "response": ["Anupam Mishra (1948 – 19 December 2016) was an Indian Gandhian, author, journalist, environmentalist, TED speaker, and water conservationist who worked on promoting water conservation, water management and traditional rainwater harvesting techniques.Rural Jal Yodhas:Anupam Mishra rainwaterharvesting.org. He had been awarded the 1996 Indira Gandhi Paryavaran Puraskar (IGPP) award instituted by the Ministry of Environment and Forests, Government of India.List of Indira Gandhi Paryavaran Purashkar Awardees  Indira Gandhi Paryavaran Puraskar, Official website. He travelled to villages across several Indian states, especially Rajasthan, Madhya Pradesh, Maharashtra, and Uttar Pradesh, describing the value of time-tested systems of water harvesting. He advocated conservation of traditional water structures in India as well as abroad. He wrote books like Aaj Bhi Khare Hain Talaab (Ponds Are Still Relevant, 1993) and Rajasthan Ki Rajat Boondein (Radiant Raindrops of Rajasthan, 1995), landmark works in the field of water conservation.  An extensive interview with Mishra about the history and future of the Yamuna River occupies the last chapter of Rana Dasgupta's book Capital: The Eruption of Delhi."]}, {"page": "Tokyo Cancelled", "response": ["Tokyo Cancelled is the debut novel by British Indian novelist Rana Dasgupta. The novel narrates the stories told by thirteen different passengers stranded in an airport, each telling a separate tale to pass the time. Tokyo Cancelled presents short stories tenuously linked together by their use of fairy-tale like narratives, with short interludes between the narratives which link the tales together. These tales, whilst having little-to-no interaction with each other, all present the overarching themes of modern globalization and metamorphosis, as well as links into the magic realism genre."]}, {"page": "Ryszard Kapuściński Award", "response": ["| 100px|alt=Rana Dasgupta", "| for the translations of Rana Dasgupta's Capital: A Portrait of Delhi in the Twenty‑First Century,  Ed Vulliamy's The War is Dead, Long Live the War: Bosnia: The Reckoning and  Martin Caparrós Hunger (El Hambre) respectively"]}]}}