{"wiki_id": "http://www.wikidata.org/entity/Q7291475", "itemLabel": "Randal Plunkett", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Randal_Plunkett", "wikipedia_page": {"main": "The Hon. Randal Edward Sherborne Plunkett (15 November 1848 – 25 December 1883) was a British Conservative politician.\nPlunkett was the eldest son of Admiral Edward Plunkett, 16th Baron of Dunsany, and the Hon. Anne Constance, daughter of John Dutton, 2nd Baron Sherborne. Sir Horace Plunkett was his younger brother.\nPlunkett was elected Member of Parliament for Gloucestershire West in 1874, a seat he held until 1880.Plunkett died unmarried at Madeira in December 1883, aged 35, predeceasing his father by six years. His younger brother John later succeeded in the barony.", "link_mentions": [{"page": "West Gloucestershire (UK Parliament constituency)", "response": ["|Hon. Randal Plunkett"]}, {"page": "Randal Edward Sherborne Plunkett", "response": ["#REDIRECT Randal Plunkett"]}, {"page": "Randall Edward Sherborne Plunkett", "response": ["#REDIRECT Randal Plunkett"]}, {"page": "Randall Plunkett", "response": ["#REDIRECT Randal Plunkett"]}, {"page": "Randal Plunket", "response": ["#REDIRECT Randal Plunkett"]}, {"page": "Randal Plunkett (MP)", "response": ["#REDIRECT Randal Plunkett"]}, {"page": "Randal Plunkett, 19th Baron of Dunsany", "response": ["Randal Plunkett was born in Dublin on 25 August 1906 and was educated at Eton College, Eton, Berkshire, England. He fought in the North-West Frontier in 1930 in the Guides Cavalry regiment of the British Indian Army, and was promoted to the rank of Lieutenant-Colonel. He also fought in the Second World War and retired from Military Service in 1947 having been decorated (Medal and Clasp). In 1957 he succeeded to the family title on the death of his father the 18th Lord Dunsany.", "On 23 August 1938 Randal Plunkett married Vera de Sà Sottomaior (d.1986), the youngest daughter of Dr. Genesio de Sà Sottomaior of Sao Paulo, Brazil, and formerly wife of Ivar Bryce. Just over one year later the couple had their only child Edward John Carlos Plunkett, who would later succeed his father as 20th Lord Dunsany in 1999. However, the couple were divorced in 1947 and on 8 October 1947 Randal Plunkett married Sheila Victoria Katrin Philipps (1912-1999), daughter of Sir Henry Philipps, 2nd Bt. of Picton Castle in Pembroke. From this marriage the Hon. Beatrice Mary Plunkett was born on 15 July 1948.  Randal Dunsany was survived by both of his children, and by two grandchildren by Edward and Maria Alice Plunkett.", "Randal Plunkett, the Rt. Hon. The Lord Dunsany was promoted to the rank of Lieutenant-Colonel and was decorated for his service in the North-West Frontier in 1930. On 21 September 1962 the official inauguration of the Military and Hospitaller Order of St. Lazarus of Jerusalem Bailiwick (later to be Grand Priory) of Ireland took place at Dunsany Castle and Lord Dunsany was invested as the first Chancellor of the Order in Ireland."]}]}}