{"wiki_id": "http://www.wikidata.org/entity/Q7298165", "itemLabel": "Ray Strachey", "itemDescription": "British feminist activist and writer (1887-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Strachey", "wikipedia_page": {"main": "Ray Strachey (born Rachel Pearsall Conn Costelloe; 4 June 1887 – 16 July 1940) was a British feminist politician, mathematician, engineer, artist and writer.", "link_mentions": [{"page": "Florence Nightingale", "response": ["While better known for her contributions in the nursing and mathematical fields, Nightingale is also an important link in the study of English feminism. She wrote some 200 books, pamphlets and articles throughout her life. During 1850 and 1852, she was struggling with her self-definition and the expectations of an upper-class marriage from her family. As she sorted out her thoughts, she wrote Suggestions for Thought to Searchers after Religious Truth. This was an 829-page, three-volume work, which Nightingale had printed privately in 1860, but which until recently was never published in its entirety. An effort to correct this was made with a 2008 publication by Wilfrid Laurier University, as volume 11 Privately printed by Nightingale in 1860. of a 16 volume project, the Collected Works of Florence Nightingale. The best known of these essays, called \"Cassandra\", was previously published by Ray Strachey in 1928. Strachey included it in The Cause, a history of the women's movement. Apparently, the writing served its original purpose of sorting out thoughts; Nightingale left soon after to train at the Institute for deaconesses at Kaiserswerth."]}, {"page": "1918 United Kingdom general election", "response": ["*Ray Strachey, aged 31, Independent, Brentford and Isleworth, MiddlesexHallam, David J.A., ibid, pp 73–90"]}, {"page": "Logan Pearsall Smith", "response": ["Smith's sister Alys was the first wife of philosopher Bertrand Russell. His sister Mary was married twice, first to the Irish barrister Benjamin Conn \"Frank\" Costelloe. Their two daughters were Ray Strachey and Karin Stephen, in-laws to Lytton Strachey and Virginia Woolf, respectively. Mary later married the art historian Bernard Berenson."]}, {"page": "Mud March (suffragists)", "response": ["The Mud March was the largest-ever public demonstration at that time in support of woman's suffrage. Although it brought little by way of immediate progress on the parliamentary front, its significance in the general suffrage campaign was considerable. By embracing activism, the constitutionalists' tactics become closer to those of the WSPU, at least in relation to the latter's non-violent activities. In her 1988 study of the suffrage campaign, Tickner observes that \"modest and uncertain as it was by subsequent standards, [the march] established the precedent of large-scale processions, carefully ordered and publicised, accompanied by banners, bands and the colours of the participant societies.\" The feminist politician Ray Strachey wrote:"]}, {"page": "1940 in the United Kingdom", "response": ["* 16 July – Ray Strachey, feminist campaigner (born 1887)"]}, {"page": "1887 in the United Kingdom", "response": ["* 4 June – Ray Strachey, born Rachel Costelloe, feminist campaigner (died 1940)"]}, {"page": "Mary Berenson", "response": ["Mary had two daughters with Frank Costelloe; Ray Strachey and Karin Stephen. Through them Mary was related by marriage to the Bloomsbury Group of English artists and literary figures: Karin married Adrian Stephen who was Virginia Woolf's brother, and Ray married Oliver Strachey who was Lytton Strachey’s brother "]}, {"page": "Rachel Conn Costelloe", "response": ["#redirect Ray Strachey"]}, {"page": "Rachel Pearsall Conn Strachey", "response": ["#redirect Ray Strachey"]}, {"page": "Ladies' Medical College", "response": ["That the College's ambitions were limited appears to have limited its life-span. Aspiring female physicians were concerned with access to the acquisition of credentials enabling them to be listed on the Medical Register, and these the College did not offer. As a result, it was not supported by leading campaigners for the medical education of women such as the Edinburgh Seven nor Elizabeth Garrett Anderson. In 1872, the Society renamed it The Obstetrical College for Women' and unsuccessfully sought funds to extend the curriculum offered; the College closed in 1873. Writing in a later period, Ray Strachey noted that the College was \"a half-measure'."]}, {"page": "Barbara Strachey", "response": ["Barbara Strachey was born to parents Oliver Strachey, a cryptographer in World War I and World War II, and the feminist politician, writer, and amateur painter Ray Strachey. She attended schools in Switzerland, Vienna, and Oxford High School. She studied history at Lady Margaret Hall, Oxford University. Later she worked for the BBC for a period, and was involved in the transformation of the General Overseas Service into the World Service in 1965.", "* The Cause: A Short History of the Women's Movement in Great Britain (with Ray Strachey)"]}, {"page": "Pippa Strachey", "response": ["In 1900, Strachey visited India, and the experience of independence made her decide to seek her own career.  She became a teacher at Allenswood for a few years, but then met the feminist Emily Davies, who encouraged her to join the National Union of Women's Suffrage Societies (NUWSS).  Strachey's mother, Jane, was a friend of Millicent Fawcett and was already active in the NUWSS, so it was relatively easy for Pippa to become a committee member, then in 1907 to become secretary of the organisation.  One of her first tasks was the organisation of the \"Mud March\"; this was deemed so successful, that she thereafter planned all the group's demonstrations. Pippa's and her sister-in-law, Ray Strachey were both involved in the suffrage movement.", "Strachey supported World War I, but was unable to work in field hospitals due to her health.  Instead, she worked with Ray Strachey, with a particular focus on finding women good work opportunities.  As a result, they founded the Women's Service Bureau, with Pippa as its unpaid secretary.  She continued after the war as it became the London Society for Women's Service and, eventually, the Fawcett Society.  Under her leadership, the organisation created a substantial library and purchased a building to use as a social club and headquarters."]}, {"page": "Ray Costelloe", "response": ["#REDIRECT Ray Strachey"]}, {"page": "Blanche Athena Clough", "response": ["After Clough's retirement in 1923, she devoted her time to gardening, bird-watching, and volunteering for the London and National Society for Women’s Service which became the Fawcett Society in 1953. A. J. Pertz painted Clough while Principal of Newnham College and the portrait hangs in the college today. Ray Strachey painted two portraits of Clough between 1925–1931 which are now in the National Portrait Gallery."]}]}}