{"wiki_id": "http://www.wikidata.org/entity/Q7301728", "itemLabel": "Rebecca Egan", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Rebecca_Egan", "wikipedia_page": {"main": "Rebecca Egan is a British actress known mostly for the role of Marilyn Tanner in the Second Sight series, and has been seen in the guest role of Kendra Hills-Smythe in the British soap opera EastEnders.\nThe daughter of Myra Frances (1943–2021) and Robert Taylor, and step-daughter of Peter Egan (born 1946), all actors, Egan followed their lead when she made her first television appearance in an episode of Cardiac Arrest in 1996 as a doctor. After a few bit parts in television series, Egan was given the role of Marilyn Tanner for the television movie Second Sight in 1999. Its success brought on three sequels, all released in 2000, and led to Egan landing bigger parts in more well-known television series such as Murder in Mind, Holby City, Midsomer Murders, Doctors, The Bill and Casualty.", "link_mentions": [{"page": "Mike Walker (radio dramatist)", "response": ["| Neil Dudgeon and Rebecca Egan"]}, {"page": "List of former EastEnders characters", "response": ["|Kendra Hills-Smythe || Rebecca Egan || 2008–2009"]}, {"page": "Peter Egan", "response": ["He was married to former actress Myra Frances for 49 years until her death from cancer on 30 March 2021. Egan's stepdaughter is Rebecca Egan."]}, {"page": "Myra Frances", "response": ["Frances first married to the actor Robert Taylor; the couple had one child, actress Rebecca Egan, but divorced. Frances met her second husband Peter Egan in 1972 while working on the show The Organisation; they married on 13 February 1972. Frances died on 30 March 2021, after suffering from cancer over a long period."]}, {"page": "Testament: The Bible in Animation", "response": ["* Rebecca Egan − Lady Potiphar"]}, {"page": "List of EastEnders characters (2008)", "response": ["Kendra Hills-Smythe played by Rebecca Egan, was a solicitor employed by Jack Branning (Scott Maslen) to defend his partner Tanya Branning (Jo Joyner)."]}, {"page": "Second Sight (TV series)", "response": ["The series also follows Tanner's battles with his irrepressible Inspector, Catherine Tully (Claire Skinner), who urges him to tell the truth for the sake of his own health. Rebecca Egan also co-stars as Tanner's long-suffering wife, Marilyn; while Benjamin Smith appears as his son, Sam. Following the broadcast of the final episode on 6 February 2001, Second Sight was axed by BBC executives, with poor viewing figures cited as the reason.", "* Rebecca Egan as Marilyn Tanner"]}, {"page": "Ned Chaillet", "response": ["| Nicholas Le Prevost, Julian Barnes, Ron Cook, Timothy Watson, Sylvester Morand, Jonathan Tafler, Tracy Wiles, Rebecca Egan, Martin Hyder, Richard Firth, Scott Brooksbank, Emma Woolliams and Laura Doddington", "| Neil Dudgeon and Rebecca Egan"]}, {"page": "List of people named Rebecca", "response": ["*Rebecca Egan (fl. 1990s–2000s), British actress"]}]}}