{"wiki_id": "http://www.wikidata.org/entity/Q7307809", "itemLabel": "Reg King", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Reg_King", "wikipedia_page": {"main": "Reg King (5 February 1945, Paddington, West London – 8 October 2010, Belvedere, Kent) was an English singer and songwriter, most famous for being the solo and lead singer with The Boys and The Action. He died of cancer, aged 65, in October 2010.", "link_mentions": [{"page": "The Action", "response": ["The band was formed as The Boys in August 1963, in Kentish Town, North West London. The original members were Reg King (lead vocals), Alan 'Bam' King (rhythm guitar, vocals), Mike \"Ace\" Evans (bass guitar, vocals) and Roger Powell (drums). They had a brief spell as a bar band in Germany, and then as a backing band for Sandra Barry, (sometimes referred to as Sandra Barry and the Boyfriends) playing on her single \"Really Gonna Shake\" in 1964. After the stint with Barry, Pete Watson was recruited as lead guitarist, and in 1964 they changed their name to The Action.", "The Action now set about gathering original new material for a projected LP, but recording demos in a radically different Byrds-influenced psychedelic style failed to secure them their hoped-for recording deal (the 1967/68 demos were eventually released in the 1990s under the title Rolled Gold). With the band seemingly having reached an impasse vocalist Reg King's behaviour became increasing unpredictable, and he departed the band in mid-1968. King's exit left Ian Whiteman and Alan King to share vocal duties, and at this point The Action decided on a brief change of name to Azoth. However the band soon reverted to their old name to record a new set of five demos, where they moved toward a more mid-tempo West Coast-influenced psychedelic ballad style and then into folk rock (these demos were eventually released in 1985 as The Action Speaks Louder Than Words). By January 1969 however, upon signing to Head Records (a fledgling independent label run by their former roadie John Curd), The Action was finally and permanently re-christened Mighty Baby.", "# Reg King Interview (BBC Radio's Saturday Club 1966)"]}, {"page": "Robbers on High Street", "response": ["Scratchie/New Line Records folded shortly after the New Year.  After an extended rest, Robbers on High Street returned to form in 2008 - playing shows (sometimes as Electric Light Orchestra), writing new songs and recording several covers - Emitt Rhodes, The Style Council, and even New Edition - for various compilation releases.  After purchasing a TASCAM MS-16 1\" 16 track, the band entered the studio in October 2009 to begin work on their third full-length album. Produced by Trokan with engineer Matt Shane (Flight of the Conchords, Rosanne Cash), they settled in at Tommy Brenneck’s (The Budos Band, Menahan Street Band) Dunham Studio for mixdown.  Delving deeper into their Anglophilia a la The Pretty Things and the blue-eyed power of Reg King and The Action, this was the current line-up’s first proper recording session, drawing little help from the outside save that of a horn section borrowed from Daptone Records.  In June 2010, the 7\" single Electric Eye b/w Face In The Fog, two tracks from the yet unreleased upcoming album tentatively titled Hey There Golden Hair, was released on Engine Room Recordings.  Some brief Northeast tours in the Summer and Fall in support followed, as well as an appearance at the 2010 CMJ Music Marathon."]}, {"page": "Mark Charig", "response": ["* Reg King, Reg King (United Artists, 1971)"]}, {"page": "Mighty Baby", "response": ["With Reg King", "*Reg King (album, United Artists Records 29157, 1971)"]}, {"page": "Danny McCulloch", "response": ["In 1971, McCulloch was the bassist on the solo album of Reg King, former lead singer of The Action.  Other musicians included Mick Taylor, Steve Winwood and Brian Auger.  Also in 1971, he joined Renaissance as a bassist for a short period, playing with former Plebs bandmate Michael Dunford, who was a composer and guitarist with Renaissance."]}, {"page": "All Good Clean Fun", "response": ["# \"Gone Away\" – Reg King (2:35)", "# \"Little Boy\" – Reg King"]}, {"page": "2010 in the United Kingdom", "response": ["**Reg King, singer-songwriter (b. 1945)"]}, {"page": "Deaths in October 2010", "response": ["*Reg King, 65, British singer (The Action), cancer."]}, {"page": "Alan King (guitarist)", "response": ["Alan King was one of the founding members of the British pop group The Action, for whom he played rhythm guitar and sang backing vocals. King started the group with original members Reg King, Mike Evans and Roger Powell in August 1963 as The Boys, who had a brief spell as a bar band in Germany, and then as a backing band for Sandra Barry, including on her single \"Really Gonna Shake\" in 1964. ", "A number of line up changes, including the departures of Watson and singer Reg King, and their being dropped by Parlaphone led to  band altering their style further and The Action went on to become the psychedelic/progressive rock band Mighty Baby, with Alan King taking over as lead singer, with addition of guitarist Martin Stone and multi-instrumentalist and songwriter Ian Whiteman. After the dissolution of Mighty Baby in 1971, King briefly joined former Action lead singer Reg King in B B Blunder, an offshoot of psychedelic band Blossom Toes."]}]}}