{"wiki_id": "http://www.wikidata.org/entity/Q7307741", "itemLabel": "Reg Bunn", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Reg_Bunn", "wikipedia_page": {"main": "Reginald \"Reg\" Bunn (d.1971) was a British comic book artist, best known for his work on The Spider in  Lion, and work in other British comics during the 1960s.As a young man, Bunn produced commissioned portraits and caricatures to supplement his income. He spent the war years in Liverpool, suffering a serious motor accident there in 1944 which rendered him paralysed from the neck down. He was told he would never walk again but with considerable effort he recovered, although he would suffer back problems for the rest of his life. \nAfter the war he worked as a draughtsman at Rolls-Royce in Derby. In 1949 Amalgamated Press launched a nationwide search for artists for their publications. Bunn was a joint winner and would go on to draw for The Comet (Buck Jones and Robin Hood), Sun (Clip McCord), Thriller Comics and, most notably, Lion, for which he co-created The Spider with writer Ted Cowan. His work was noted for its highly detailed and angular qualities.Bunn married and had three children, two sons and a daughter. He spent more than 20 years working from a studio in his home and died in 1971 at the age of sixty-six.", "link_mentions": [{"page": "List of cartoonists", "response": ["* Reg Bunn"]}, {"page": "1905", "response": ["** Reg Bunn, English comic book artist (d. 1971)"]}, {"page": "Kings Norton", "response": ["*Reg Bunn (1905–1971), artist"]}, {"page": "1965 in comics", "response": ["* June 26: The first episode of Ted Cowan and Reg Bunn's The Spider is published. It will run until 1969."]}, {"page": "List of British artists", "response": ["* Reg Bunn (1905–1971)"]}, {"page": "Albion (comics)", "response": ["| The Spider || The Spider || Lion || Fleetway || Ted Cowan & Reg Bunn || 1965 || "]}, {"page": "Lion (comics)", "response": ["* The Spider (1965–1969) — Part villain, part hero, he would fight master criminals using his skills and weapons. Created by writer Ted Cowan and artist Reg Bunn, Superman co-creator Jerry Siegel took over the writing of the character with his third adventure and would write the bulk of his stories."]}, {"page": "The Spider (British comics)", "response": ["The Spider is a British comic book character who began as a supervillain before becoming a superhero. He appeared in Lion between 26 June 1965 and 26 April 1969 and was reprinted in Vulcan. He was created by writer Ted Cowan and artist Reg Bunn. Superman co-creator Jerry Siegel took over the writing of the character with his third adventure, and would write the bulk of his adventures.Dwyer, Theo. \"The Spider Reprint Announced by 2000AD With Work From Jerry Siegel,\" Bleeding Cool (July 11, 2020).Bruton, Richard. \"More Brit Classics: Jerry Siegel’s 60s Super-Crook, ‘The Spider’, Gets Collected,\" Comicon.com (June 26, 2020).Viswa, Nathan. \"When Batman got Knocked Off – and encountered British comics “The Spider” along the way!\" DownTheTubes.net (JANUARY 3, 2018).Stock, Karl. \"Web of Intrigue,\" Judge Dredd Megazine #431 (May 2021), pp. 42–44.", "Despite no origin ever being given for the Spider's appearance: pointed ears and teeth, and upswept eyebrows: it fits into the angular style of the artist Reg Bunn, who was most comfortable with designing and plotting the actions scenes from the scripts he was given by employing \"triangular\" artwork. This emphasized (and made easier) the interaction of subject matter and framing within each action picture. Reg Bunn commented later on in the 1960s of the humorous irony of the later Spock \"borrowing\" his ears. (The character's face also bears a resemblance to the much-earlier comic character Namor.)"]}, {"page": "1971 in comics", "response": ["* Reg Bunn, British comics artist (The Spider), dies at age 65 or 66."]}, {"page": "1969 in comics", "response": ["* April 26: The final episode of Ted Cowan and Reg Bunn's The Spider is published."]}]}}