{"wiki_id": "http://www.wikidata.org/entity/Q7301957", "itemLabel": "Rebecca Tunney", "itemDescription": "British gymnast", "wikipedia_url": "https://en.wikipedia.org/wiki/Rebecca_Tunney", "wikipedia_page": {"main": "Rebecca Tunney (born 26 October 1996) is a retired British artistic gymnast who competed at the 2012 Summer Olympics.", "link_mentions": [{"page": "October 26", "response": ["*1996 – Rebecca Tunney, English gymnast"]}, {"page": "Imogen Cairns", "response": ["At the beginning of July, Cairns was selected to represent the United Kingdom at the 2012 Summer Olympics in London, along with Tweddle, Whelan, Jennifer Pinches and Rebecca Tunney. "]}, {"page": "1996 in the United Kingdom", "response": ["* 26 October – Rebecca Tunney, gymnast"]}, {"page": "Hannah Whelan", "response": ["In June, Whelan competed at the British Championships in Liverpool. She placed third in the all-around with a score of 55.800. In event finals, she placed fourth on uneven bars (14.250), second on balance beam (13.850), and third on floor (13.900). The following month, she was selected to compete for the United Kingdom at the Olympics in London, alongside Imogen Cairns, Jennifer Pinches, Rebecca Tunney, and Beth Tweddle."]}, {"page": "Tunney", "response": ["*Rebecca Tunney, Olympic gymnast  "]}, {"page": "2010 European Women's Artistic Gymnastics Championships", "response": ["| align=\"left\" | Rebecca Tunney"]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["Great Britain fielded a full team of five gymnasts in both the men's and women's artistic gymnastics events. The women's team qualified through a top eight finish in the 2011 World Artistic Gymnastics Championships, whilst the men qualified by winning the Olympic qualification event, after failing to qualify at the world championships. Included in the squads were Louis Smith, who won a bronze medal in the pommel horse at the 2008 Games, Beth Tweddle, 2009 World Floor Champion and 2010 Uneven Bars Champion, and Rebecca Tunney, who, at the age of 15, was the youngest Team GB athlete from any sport.", "| style=\"text-align:left;\" | Rebecca Tunney", "| style=\"text-align:left;\" | Rebecca Tunney"]}, {"page": "2012 Gymnastics Olympic Test Event", "response": ["*: Rebecca Tunney"]}, {"page": "European Artistic Gymnastics Championships – Women's team all-around", "response": ["| Becky DownieRuby HarroldClaudia FragapaneRebecca TunneyHannah Whelan"]}, {"page": "Gymnastics at the 2012 Summer Olympics – Women's artistic team all-around", "response": ["|Rebecca Tunney"]}, {"page": "2012 European Women's Artistic Gymnastics Championships", "response": ["| align=\"left\" | Rebecca Tunney", "| Youngest || Rebecca Tunney ||    United Kingdom|| 26/10/96  || 15 years"]}, {"page": "Gymnastics at the 2012 Summer Olympics – Women's artistic individual all-around", "response": ["|Rebecca Tunney || "]}, {"page": "Gymnastics at the 2012 Summer Olympics – Women's uneven bars", "response": ["| style=\"height:25px; text-align:left;\"|Rebecca Tunney||style=\"text-align:left;\"|||8.425||||14.825|| R"]}, {"page": "Ruby Harrold", "response": ["Later in that month, Harrold competed with Rebecca Tunney at the World Challenge Cup in Osijek, Croatia. She won a gold medal in the uneven bars final with a score of 14.125, 0.850 clear from silver medalist Annika Urvikko."]}, {"page": "List of Olympic female artistic gymnasts for Great Britain", "response": ["|  || 2012 || \"Rebecca Tunney\". sports-reference.com. Retrieved July 14, 2013."]}, {"page": "2013 World Artistic Gymnastics Championships – Women's qualification", "response": [" | align=left|Rebecca Tunney|| style=\"text-align:left;\"|||14.866||13.600||12.200||13.466||54.132||Q"]}, {"page": "2014 in artistic gymnastics", "response": ["| Senior AA: Rebecca Tunney Senior VT: Kelly Simm    Senior UB: Rebecca Tunney    Senior BB: Becky Downie    Senior FX: Elizabeth Beddoe   Junior AA: Amy Tinkler Junior VT: Tyesha Mattis Junior UB: Tyesha Mattis Junior BB: Teal Grindle Junior FX: Catherine Lyons & Amy Tinkler", "|  Great Britain || Senior AA: Rebecca Tunney Senior VT: Kelly Simm    Senior UB: Rebecca Tunney    Senior BB: Becky Downie    Senior FX: Elizabeth Beddoe  || Senior AA: Becky DownieSenior VT: Claudia Fragapane    Senior UB: Becky Downie    Senior BB: Hannah Whelan    Senior FX: Emily Crowe   || Senior AA: Claudia Fragapane Senior VT: Emma White    Senior UB: Claudia Fragapane    Senior BB: Rebecca Tunney    Senior FX: Hannah Whelan", "| Rebecca Tunney"]}, {"page": "Tyesha Mattis", "response": ["On 23 April, it was announced by the British Olympic Association that Mattis was to represent Great Britain at the first ever European Games alongside 2012 Olympian Rebecca Tunney and 2014 Commonwealth champion Kelly Simm, although due to a recent operation with Mattis and perpetual injuries with Tunney they were both withdrawn from the competition and replaced by double 2014 Commonwealth bronze medalist Georgina Hockenhull and 2014 World Championships reserve athlete Charlie Fellows (gymnast)."]}, {"page": "2016 in artistic gymnastics", "response": ["| Senior: Rebecca Tunney  Junior: Taeja James"]}, {"page": "2014 European Women's Artistic Gymnastics Championships", "response": ["| Rebecca DownieRuby HarroldClaudia FragapaneRebecca TunneyHannah Whelan", "| align=\"left\" | Rebecca Tunney", "| align=\"left\" | Rebecca Tunney", "| Ruby HarroldRebecca TunneyBecky DownieHannah WhelanClaudia Fragapane"]}, {"page": "Great Britain at the 2015 European Games", "response": ["On 2 June 2015, it was announced that five athletes had withdrawn from the British team: Lisa Whiteside (boxing), Tyesha Mattis and Rebecca Tunney (both artistic gymnastics), and Helen Jenkins and Jess Learmonth (both triathlon). Mattis and Tunney were replaced by Charlie Fellows and Georgina Hockenhull."]}, {"page": "Kelly Simm", "response": ["On 23 April it was announced by the British Olympic Association that Simm was to represent Great Britain at the first ever European Games. Simm was originally selected to compete alongside 2012 Olympian Rebecca Tunney and senior newcomer Tyesha Mattis, but both withdrew due to injuries. On 2 June it was released by British Gymnastics that Simm was to now compete with double 2014 Commonwealth Games bronze medalist Georgina Hockenhull and 2014 World Championships reserve athlete Charlie Fellows. As a team of three they will represent Team GB at the 2015 European Games in Baku, Azerbaijan in June."]}, {"page": "Amy Tinkler", "response": ["Towards the end of March, Tinkler competed at the British Championships at the Echo Arena in Liverpool. In the all-around final she became the British champion and like in the English Championships, the winner from 2014, Rebecca Tunneyhttp://www.british-gymnastics.org/results/7640/Womens_Senior_Championships_-_All_Around.pdf didn't attend this competition. She scored 14.850 on the vault. 13.650 on the uneven bars, 13.750 on the balance beam and 14.400 on the floor exercise to improve on the English Championships result of 56.200 to end with a total of 56.650. Tinkler competed in 3 out of the 4 apparatus finals, in the uneven bas final, Tinkler placed 4th with a score of 13.300, and in the balance beam final she finished in 5th place with a score of 12.550, although in the floor exercise final, Tinkler won the gold medal with a score of 14.450, beating Commonwealth floor exercise champion and fan favourite, Claudia Fragapane.", "Tinkler competed at the American Cup, after the withdrawal of Rebecca Tunney and finished ninth in the all-around after withdrawing from the Floor Exercise. At the British Championships that year, she only competed on the uneven bars. In April, Tinkler competed at the London World Cup, coming in third behind Tabea Alt of Germany and Victoria Nguyen of the United States. Following these competitions, she had surgery on her knee, to remove pieces of floating bone."]}, {"page": "Charlie Fellows (gymnast)", "response": ["On 2 June it was released by British Gymnastics that Fellows was selected to compete at the first ever European Games. Alongside 2014 Commonwealth medalists Kelly Simm and Georgina Hockenhull, as a team of three they are to represent Team GB at the 2015 European Games in Baku, Azerbaijan. The original team selected to compete in Baku were Simm, Rebecca Tunney and Tyesha Mattis but due to injuries, both Tunney and Mattis were withdrawn from the games."]}, {"page": "Great Britain women's national artistic gymnastics team", "response": ["*:Imogen Cairns, Jennifer Pinches, Rebecca Tunney, Beth Tweddle, Hannah Whelan"]}, {"page": "List of gymnasts at the 2016 Summer Olympics", "response": ["* Rebecca Tunney"]}, {"page": "List of people named Rebecca", "response": ["*Rebecca Tunney (born 1996), British artistic gymnast who competed at the 2012 Summer Olympics"]}, {"page": "Gymnastics at the 2011 Commonwealth Youth Games", "response": ["|  Rebecca Tunney", "|  Rebecca Tunney"]}]}}