{"wiki_id": "http://www.wikidata.org/entity/Q7308617", "itemLabel": "Reginald Brabazon, 12th Earl of Meath", "itemDescription": "British politician (1841-1929)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Brabazon,_12th_Earl_of_Meath", "wikipedia_page": {"main": "Reginald Brabazon, 12th Earl of Meath,  (31 July 1841 – 11 October 1929) was an Irish politician and philanthropist.\nThe Honourable Reginald Brabazon was born into an old Anglo-Irish family in London, the second son of William Brabazon, 11th Earl of Meath and Harriot Brooke. When his father succeeded to the Earldom  in 1851, Reginald, now  the heir (his elder brother, Jacques, died of diphtheria in 1844), was styled Lord Brabazon. He was educated at Eton College and in 1863 joined the Foreign Office as a clerk, and later became a diplomat.\nIn 1868 he married Lady Mary Jane Maitland, daughter of the 11th Earl of Lauderdale. On the insistence of his in-laws, Brabazon refused to accept a posting to Athens (which they considered too remote) in 1873 and was effectively suspended without pay, finally resigning from the Diplomatic Service in 1877. He and his wife decided to devote their considerable energies to \"the consideration of social problems and the relief of human suffering\". Both were subsequently involved in many charitable organisations. He established the Metropolitan Public Gardens Association in 1882, which created parks and gardens in London for public recreation. The Earl and his wife leased Ottershaw Park from 1882 to November 1883 from Sir Edward Colebrooke.In May 1887, Brabazon succeeded his father as 12th Earl of Meath. Lord Meath was also a prominent Conservative politician in the House of Lords as Baron Chaworth, and an ardent imperialist, and was responsible for the introduction in England of Empire Day, which was officially recognised by the British Government in 1916. He was a member of the London County Council, the Privy Council of Ireland and the Senate of Southern Ireland. He was also Chief Scout Commissioner for Ireland.\nLord Meath was appointed Knight of the Order of St Patrick (KP) in 1902, Knight Grand Cross of the Order of the British Empire (GBE) in the 1920 civilian war honours, and Knight Grand Cross of the Royal Victorian Order (GCVO) in the 1923 Birthday Honours.\nHis younger daughter, Lady Violet Constance Maitland Brabazon (1886–1936), married the 4th Earl of Verulam.\n\nThere is a statue in his honour outside the Columbia Hotel near Lancaster Gate, in London. Recordings of his voice exist made in October 1910, in the form of three speeches on the Empire Movement.Lord Meath is buried in the graveyard of the Church of Ireland parish church in the small village of Delgany, County Wicklow, Ireland, along with his wife and son. There are some streets and squares in The Coombe, Dublin, named in his honour: Reginald Street, Reginald Square and Brabazon Square. Meath Gardens in Bethnal Green, opened as a public park in 1894 through the efforts of the Metropolitan Public Gardens Association, is named in his honour.", "link_mentions": {}}}