{"wiki_id": "http://www.wikidata.org/entity/Q7307821", "itemLabel": "Reg Matthewson", "itemDescription": "English footballer (1939-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reg_Matthewson", "wikipedia_page": {"main": "Reg Matthewson (6 August 1939 – 29 August 2016) was an English professional footballer. He played as a defender in The Football League for three clubs, making 394 appearances in the process.", "link_mentions": [{"page": "List of people from Sheffield", "response": ["*Reg Matthewson, footballer"]}, {"page": "Trevor Matthewson", "response": ["Trevor Matthewson was born in Sheffield into a footballing family: both his grandfather (Tommy Matthewson for Sheffield Wednesday and South Shields) and uncle (Reg Matthewson) had played professionally. He began his football career as an apprentice with home-town club Sheffield Wednesday, but failed to make the grade. After two seasons as a professional he dropped down a division to join Newport County and two years later he dropped another division to Stockport County. After a further two years he left the Football League entirely and signed for Lincoln City in the Conference. As captain he led them to the Conference championship and promotion to the Football League in 1988."]}, {"page": "John James (footballer, born 1948)", "response": ["In February 1973, James moved to Chester for £5,000, playing his first game alongside fellow home debutant Reg Matthewson in a 5–0 win over Darlington, that saw James amongst the scorers. The following season saw James net 21 league goals, the highest tally by a Chester player since Gary Talbot in 1968–69, but his most memorable campaign would follow in 1974–75."]}, {"page": "Gary Potter", "response": ["A product of Chester's youth policy, Potter made his Chester first team debut in a Welsh Cup semi–final against Cardiff City in March 1973, with his league debut arriving against Hartlepool in the second game of 1973–74 while regulars Dave Pountney and Reg Matthewson were ruled out injured.Sumner (1997), p 85 Potter helped Chester win three successive games but defeats to Exeter City and Mansfield Town led to Chester breaking their transfer record to sign Chris Dunleavy."]}, {"page": "Matthewson", "response": ["*Reg Matthewson (born 1939), English footballer"]}, {"page": "2016 in association football", "response": ["* 29 August: Reg Matthewson, English footballer (born 1939)"]}, {"page": "2016 in the United Kingdom", "response": ["**Reg Matthewson, 77, footballer (Sheffield United, Fulham)."]}, {"page": "2016–17 in English football", "response": ["* 29 August 2016: Reg Matthewson, 77, Sheffield United, Fulham and Chester defender.RIP Reg Matthewson"]}, {"page": "Deaths in August 2016", "response": ["*Reg Matthewson, 77, English footballer (Sheffield United, Fulham).RIP Reg Matthewson"]}, {"page": "1972–73 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Reg Matthewson"]}, {"page": "1973–74 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Reg Matthewson"]}, {"page": "1974–75 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Reg Matthewson"]}, {"page": "1975–76 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | Reg Matthewson"]}]}}