{"wiki_id": "http://www.wikidata.org/entity/Q731088", "itemLabel": "Malcolm McVean", "itemDescription": "Scottish footballer (1871-1907)", "wikipedia_url": "https://en.wikipedia.org/wiki/Malcolm_McVean", "wikipedia_page": {"main": "Malcolm McVean (7 March 1871 – 6 June 1907) was a Scottish association footballer who played as a winger. He is notable for having scored Liverpool's first ever goal, in a friendly against Rotherham Town on 1 September 1892, which Liverpool won 7–1.\nHe started his career with Third Lanark before he was signed by newly formed Liverpool in 1892. As well as scoring their first ever goal, McVean was also Liverpool's captain for their first ever competitive match, in the Lancashire League against Higher Walton on 3 September 1892. Walton did not arrive until forty-five minutes after the scheduled kick-off time, and Liverpool won 8–0.\nWhen Liverpool were admitted to the Football League a year later, it was McVean who scored their first ever goal in the League, in a 2–0 win away from home over Middlesbrough Ironopolis on 2 September 1893. He also scored twice in Liverpool's first ever victory over top flight opposition when Preston North End were beaten 3–2 in a classic FA cup upset in 1894.In all McVean made 89 league appearances for the Reds, forty-three of them in the top division where he scored eight goals in four seasons from 1893 until 1897 when he spent the end of his fourth, and final league season with Burnley where he made just four appearances.\nMcVean has the unusual distinction of having experienced promotion or relegation in each of his four seasons in England; Liverpool 1894 – promoted, 1895 – relegated, 1896 – promoted, Burnley, 1897 – relegated.\nHe left English league football for his native Scotland where he joined Dundee. He also had spells with Bedminster and Clydebank.", "link_mentions": [{"page": "List of Liverpool F.C. records and statistics", "response": ["*First player to score for Liverpool: Malcolm McVean (against Rotherham Town, 1 September 1892)."]}, {"page": "John McKenna", "response": ["McKenna met the founder of Liverpool Football Club John Houlding, who invited him to Anfield to watch his Everton team play. He remained with Houlding after Everton left Anfield for Goodison Park. Houlding was a major driving force for Liverpool throughout the early years, and he used his connections to look for players in Glasgow. His team was known as the \"Team of Macs\" due to the number of players with \"Mc\" in their surname: Duncan McLean, James McBride, Malcolm McVean, Hugh McQueen, Matt McQueen, John McCartney, Bill McOwen and Joe McQue."]}, {"page": "1892–93 Liverpool F.C. season", "response": ["| Malcolm McVean", "|FW|| Malcolm McVean|| Third Lanark||Unknown||07-1892"]}, {"page": "List of Dundee F.C. seasons", "response": ["|Malcolm McVean"]}, {"page": "Ben Bull", "response": ["Ben Bull (born May 1873) was an English footballer who played as a midfielder. Bull made one appearance for Liverpool during his career, where he replaced regular winger Malcolm McVean for a match against Lincoln City and the second goal in a 6–1 victory. He made no further appearances for the club when McVean returned."]}, {"page": "History of Liverpool F.C. (1892–1959)", "response": ["The club's first match in the Football League was against Middlesbrough Ironopolis on 2 September 1893, which they won 2–0, with Malcolm McVean scoring Liverpool's first goal in League football. Liverpool's first season in the Football League saw them unbeaten in 28 matches, 22 of which they won. They finished at the top of the Second Division, but as at that time there was no automatic promotion to the First Division, they were entered into the test match system. This involved a knockout match with the bottom team in the First Division, Newton Heath (later renamed Manchester United). Liverpool won, and took their place in the First Division. Their stay in the division lasted only a season, as they finished in bottom position, with seven wins from thirty matches. They were relegated to the Second Division, after facing Bury in the test match and losing 1–0, despite Bury playing most of the match with ten men after their goalkeeper was sent off."]}, {"page": "McVean", "response": ["*Malcolm McVean (1871–1907), Scottish footballer"]}, {"page": "1893–94 Liverpool F.C. season", "response": ["The club's first match in the Football League was against Middlesbrough Ironopolis on 2 September 1893. Liverpool won 2–0, Malcolm McVean scoring their first goal in league football."]}]}}