{"wiki_id": "http://www.wikidata.org/entity/Q7324900", "itemLabel": "Richard Corish", "itemDescription": "Irish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Corish", "wikipedia_page": {"main": "Richard Corish (17 September 1886 – 19 July 1945) was an Irish politician.Born in Wexford in 1886, Corish was the son of carpenter Peter Corish and Mary Murphy. He was educated by the Christian Brothers in the town. As a fitter in the Wexford Engineering foundry he was blacklisted by his employers after the 1911 Lockout, and became a trade union official in the new Irish Foundry Workers' Union.In 1913 he married Catherine Bergin and they had three children.\nRichard Corish became Mayor of Wexford in 1920 as an Irish Labour Party representative. However, as the Labour Party in the southern 26 counties, later the Irish Free State, chose not to contest the 1921 elections, Corish ran as a Sinn Féin candidate and was elected to Dáil Éireann for the Wexford constituency. He ran as a member of the Labour Party at the 1922 general election. He served in the Dáil and as Mayor of Wexford until his death in 1945.\nHis death caused a by-election to the Dáil which was won by his son, Brendan Corish, who was later a leader of the Labour Party and Tánaiste.Corish was a member of the Irish National Foresters, and was its High Chief Ranger in 1942.", "link_mentions": [{"page": "County Wexford", "response": ["*Richard Corish - Trade Unionist"]}, {"page": "Brendan Corish", "response": ["He was born at William Street in Wexford town. His father, Richard Corish, a well-known trade union official and Sinn Féin member, had been elected to the Second Dáil shortly after the birth of his son and later joined the Labour Party, serving as a local and national politician until his death in 1945. His mother was Catherine Bergin."]}, {"page": "Wexford (Dáil constituency)", "response": ["Following the death of Labour Party TD Richard Corish, a by-election was held on 4 December 1945. The seat was won by the Labour Party candidate Brendan Corish, son of the deceased TD."]}, {"page": "Irish National Foresters", "response": ["* Richard Corish, High Chief Ranger in 1942\"Foresters Meet\", Irish Independent, 25 May 1942, p. 3."]}, {"page": "Families in the Oireachtas", "response": ["*Richard Corish (1889–1945): Lab TD Wexford 1921–1945"]}, {"page": "History of the Labour Party (Ireland)", "response": ["The Government of Ireland Act 1920 effected the partition of Ireland with elections in June 1921 planned for the lower houses of the parliaments of of Northern Ireland and of Southern Ireland. The Labour national executive decided to leave the field to Sinn Féin, although its 1921 report suggested that it was unaware that Sinn Féin intended to use the elections to replace the First Dáil with a Second Dáil. The executive reprimanded Richard Corish and the Wexford Trades Council for accepting his Sinn Féin election nomination. When the truce of July 1921 ended the Irish War of Independence, Labour was not involved in any way in the negotiations that led to the Anglo-Irish Treaty of December 1921, by which a new Irish Free State would be established as a Dominion of the British Empire equivalent in status to Canada.", "The Anglo-Irish Treaty divided the Labour party. It did not take an official stand. From his American prison cell, Jim Larkin opposed the Treaty while the only Labour member of the Dáil, Richard Corish of Wexford spoke and voted for the Treaty. Johnson, never a republican, privately supported the Treaty, while O'Brien did not oppose it. Following the approval of the Treaty by the Dáil in January 1922, the executive of the ILPTUC succeeded at a special conference held in February, in passing a motion to participate in the forthcoming General Election. Successful Labour candidates were required to take their seats in the new Free State Dáil, and a reformist programme was adopted."]}, {"page": "Anglo-Irish Treaty Dáil vote", "response": ["|Richard Corish"]}, {"page": "Corish", "response": ["* Richard Corish (1889–1945), Irish politician"]}, {"page": "Corish, Richard", "response": ["#redirectRichard Corish"]}]}}