{"wiki_id": "http://www.wikidata.org/entity/Q7324086", "itemLabel": "Richard Bellamy", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Bellamy_(singer)", "wikipedia_page": {"main": "Richard Bellamy (1743?–1813) was an English bass singer. One of the chief bass singers of his day, Bellamy was appointed a gentleman of the Chapel Royal 28 March 1771, and a lay vicar of Westminster Abbey 1 Jan. 1773.Bellamy married Miss Elizabeth Ludford: their son, the singer Thomas Ludford Bellamy, inherited considerable property from his mother's father, Thomas Ludford (died 1776).In 1777 Richard Bellamy became a vicar choral of St. Paul's Cathedral, and from 1793 to 1800 he was also almoner and master of the choristers. In 1784 he was one of the principal basses at the Handel commemoration in Westminster Abbey. He gave up all his appointments in 1801, and died on 11 September 1813. Bellamy published a few sonatas, a collection of glees, and a Te Deum with orchestral accompaniment.", "link_mentions": [{"page": "Richard Bellamy", "response": ["Richard Bellamy may refer to:", "*Richard Bellamy (art dealer) (1927–1998), American art dealer", "*Richard Bellamy (politician) (1825–1892), farmer, land surveyor and politician in New Brunswick, Canada", "*Richard Bellamy (singer) (1743–1813), English bass singer", "*Richard Bellamy (Upstairs, Downstairs), a character in the 1971 TV series Upstairs, Downstairs"]}, {"page": "John C. Clifton", "response": ["John Clifton was born in London in 1781. His father had expected him to become a merchant, but Clifton's early talent for music was so clear that he was put under the care of a relation, the singer Richard Bellamy, with whom he studied music for five years. He then became the pupil of Charles Wesley, and eventually decided to follow music as a profession, giving up an appointment in the Stationery Office, which he held for about two years."]}, {"page": "List of musicians at English cathedrals", "response": ["* 1793–1800 Richard Bellamy  (Vicar Choral)"]}, {"page": "Thomas Ludford Bellamy", "response": ["The son of Richard Bellamy, he was born in St. John's parish, Westminster. He learned singing and music from his father and Benjamin Cooke, and after his voice had broken from Elisa Taccani Tasca."]}, {"page": "John Sale", "response": ["In 1800 he succeeded Richard Bellamy as almoner of St Paul's and master of the choristers, which posts he held until 1812. In 1818, becoming senior gentleman or father of the Chapel Royal, he was excused further duty and attendance."]}, {"page": "Gentleman of the Chapel Royal", "response": ["* Richard Bellamy"]}]}}