{"wiki_id": "http://www.wikidata.org/entity/Q7329792", "itemLabel": "Richard Walsh", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Walsh_(actor)", "wikipedia_page": {"main": "Richard Francis Evelyn Walsh (born 8 December 1952 in Lewisham, London) is an English actor, best known for playing fireman Bert \"Sicknote\" Quigley in the long-running ITV drama series London's Burning from 1986 to 2000. He has also appeared in other well-known British television shows, including Midsomer Murders, Doctors and Heartbeat. He is married to fellow actress Sarah Keller with one son, named James.", "link_mentions": [{"page": "1952", "response": ["* December 8 – Richard Walsh, English actor"]}, {"page": "Lewisham", "response": ["*Richard Walsh (actor), born in Lewisham"]}, {"page": "London's Burning (TV series)", "response": ["* Bert 'Sicknote' Quigley (Richard Walsh; movie, series 1–12) – A chronic hypochondriac, Sicknote was often complaining about his health, from ulcers to headaches. With ambitions to be a professional actor or singer, he was often in stage productions with his wife Jean, which the other members of the watch grudgingly attended. He was a social activist, attempting to introduce a smoking ban and healthier food to Blackwall. He was elected as a local councillor. He received his twenty-year service medal in Series 9, although he pessimistically regarded this as a confirmation of old age. Sicknote was killed in an explosion at a Chinese fireworks factory in Series 12. He was the last remaining character in the series from the pilot movie."]}, {"page": "Richard Walsh", "response": ["*Richard Walsh (actor) (born 1952), British television actor", "*Richard Walsh (Australian publisher) (born 1941), Australian publisher and one of the original co-editors of 1960s satirical magazine Oz", "*Richard Walsh (English politician), High Sheriff of Worcestershire", "*Richard Walsh (fighter) (born 1988), martial artist", "*Richard Walsh (Irish politician) (1889–1957), Irish Fianna Fáil politician, TD for Mayo South", "*Richard Walsh (IATSE), former president of the International Alliance of Theatrical Stage Employees (IATSE)", "*Richard Walsh (24 character), from television's 24"]}, {"page": "Francis Spring", "response": ["Spring was portrayed by Stephen Fry in the 2015 British biographical film The Man Who Knew Infinity, which recounts the story of Ramanujan's adult life and his career at Cambridge University. Spring was portrayed by Richard Walsh in the 2014 film Ramanujan."]}, {"page": "Ramanujan (film)", "response": ["* Richard Walsh as Francis Spring", "Gnana Rajasekaran looked for an actor who would physically resemble Ramanujan and signed Abhinay Vaddi, who is the grandson of veteran Tamil actor Gemini Ganesan, for the main role. Michael Lieber was signed to play Edensor Littlewood. Lieber confessed he had no knowledge of Ramanujan, when he signed the film, and went as far as to meet Béla Bollobás, who worked with Littlewood personally, for his research work. He found it difficult to speak the Tamil lines, but appreciated it later on, \"I would be lying if I said that the task of learning Tamil was not daunting at first, but once I got the hang of it I was able to appreciate what a beautiful language it is. There were many different ways of learning the Tamil lines; some used audio tapes, prompting, flash cards, or word boards. I learnt the meaning of the words and memorised chunks of dialogue.\" Similarly, Kevin McGowan, who was signed for the role of G. H. Hardy, was unfamiliar with the story of Ramanujan.  The film also stars Bhama, Suhasini Maniratnam, Abbas and Richard Walsh amongst others. Sunny Joseph, best known for his high-profile Malayalam works with directors Adoor Gopalakrishnan and Shaji N. Karun, was signed as cinematographer."]}, {"page": "Michael Lieber", "response": ["His first film was in the 2013 biopic Ramanujan, a period drama set in 1914 about the life of mathematician Srinivasa Ramanujan. Lieber played mathematician John Edensor Littlewood, starring alongside Kevin Mcgowan, Cloudia Swann, and Richard Walsh. When preparing to play the part, he spoke to math professor Béla Bollobás who had worked with Littlewood."]}, {"page": "The Crown (season 3)", "response": ["* Richard Walsh as Joe Gormley, president of the National Union of Mineworkers"]}]}}