{"wiki_id": "http://www.wikidata.org/entity/Q7325491", "itemLabel": "Richard Ellison", "itemDescription": "British politician (1754-1827)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Ellison_(politician)", "wikipedia_page": {"main": "Richard Ellison (1754 – 7 July 1827) was a British politician.\nHe was the eldest son of Richard Ellison, banker, of Sudbrooke Holme, Lincolnshire.\nHe was appointed High Sheriff of Lincolnshire in 1793 and was Member of Parliament (MP) for Lincoln from 1796 to 1812, and for Wootton Bassett from 1813 to 1820. He became Recorder of Lincoln and a member of the Board of Agriculture (1798).\nHe married twice; firstly Hannah, the daughter of John Cookson of Whitehill, co. Durham and secondly Jane Maxwell, with whom he had 4 sons. He also had an illegitimate daughter.\nRichard Ellison MP is the great-great-great grandfather of Richard Ellison (cricketer).", "link_mentions": [{"page": "Foss Dyke", "response": ["In 1671, during the reign of Charles II, Lincoln obtained an Act which authorised improvements from Boston to the Trent. Work was carried out on the Foss Dyke, but only the first  of the Witham, from Brayford Pool to High Bridge, received attention. The work was carried out by Samuel Fortrey, a man with previous experience of draining the fens. He was required to bear some of the cost himself, in exchange for some of the profits. The work was completed in 1672, and included a navigable sluice or lock at Torksey, which had first been proposed by Simon Hill in 1632. Warehouses and wharves were built at Brayford Pool, but by 1717, passage from Torksey was again difficult. Coal traffic averaged  per year, bound for Lincoln, but tolls were insufficient to finance repairs. The city of Lincoln did not have the expertise to manage the waterway, and so leased it to Richard Ellison in 1741, who had experience with the River Don Navigation. He paid £75 per year for a navigation which generated around £100 in toll receipts. He dredged it to provide  of depth, and re-opened it in 1744. Two years later, the tolls were £595, and continued to increase. Under his son, the tolls were £2,367 in 1789, while his grandson collected £5,159 in 1811.", "The Witham Navigation was soon needing repairs, and the commissioners asked John Rennie for advice in 1802. His report, published in 1803, included recommendations to demolish High Bridge so that a waterway  wide could be built under a new bridge, and improvements to the Foss Dyke costing £12,260. Neither action was followed. The canal was difficult to maintain, because much of it ran through sand and quicksand. The situation was more complex, because it had been leased to the Ellisons for three generations, and Richard Ellison III was not keen to spend any money on it. Income from tolls would have more than covered repairs, but there was little that could be done. A challenge to the legality of his lease was considered in the 1820s, but was not thought likely to succeed. He died in 1827, and Humphrey Sibthorp, his niece's husband, who was a proprietor on the River Witham, took over responsibility for it. He asked Isambard Brunel to survey it, and although he did so in 1833, no improvements were made.", "Railways arrived in Lincoln in 1848. The Wakefield, Lincoln and Boston Railway had negotiated with the proprietors of the Witham and Foss Dyke in 1846, to guarantee them an income by leasing the waterways. Richard Ellison IV had agreed a lease for 894 years, at £9,570 per year, based on the average profit for the previous three years plus 5 per cent. The line was built by the Great Northern Railway (GNR), who took over the leases already agreed. The Witham was affected more than the Foss Dyke, as the line followed its bank from Lincoln to Boston. The Manchester, Sheffield and Lincolnshire Railway (MSLR) passed through Saxilby to Lincoln a little later. Combined figures for the two waterways showed a drop in goods carried of two-thirds between 1848 and 1868. Cargoes of coal and wool were the first to transfer to the railways. However, the MSLR, by then renamed the Great Central Railway (GCR), built a dock and transshipment warehouse at Brayford in 1897. The Foss Dyke carried  in 1905, and an average of  between 1913 and 1917, most of it general goods and agricultural produce. A series of takeovers and mergers resulted in its ownership changing several times, before it was nationalised, and became the responsibility of the British Waterways Board in 1948."]}, {"page": "Lincoln (UK Parliament constituency)", "response": ["|rowspan=\"4\"| Richard Ellison\t "]}, {"page": "Ellison", "response": ["* Richard Ellison (cricketer)", "* Richard Ellison (politician) (1754–1827), British Member of Parliament (MP)"]}, {"page": "Wootton Bassett (UK Parliament constituency)", "response": ["|rowspan=\"3\"| Richard Ellison"]}, {"page": "Richard Ellison", "response": ["Richard Ellison may refer to:", "* Richard Ellison (cricketer) (born 1959), former English cricketer", "* Richard Ellison (politician) (1754–1827), English Member of Parliament (MP) for Lincoln 1796–1812 and for Wootton Bassett 1813–1820"]}, {"page": "Richard Ellison (MP)", "response": ["#REDIRECT Richard Ellison (politician)"]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|11 March 1813||Wootton Bassett||u*||James Kibblewhite||Richard Ellison||Resignation"]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Richard Ellison"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Richard Ellison"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Richard Ellison"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Richard Ellison"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Richard Ellison"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["|  James Kibblewhite – resigned Replaced by  Richard Ellison  1813 "]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["|  Richard Ellison  "]}]}}