{"wiki_id": "http://www.wikidata.org/entity/Q7329260", "itemLabel": "Richard Stokes", "itemDescription": "British television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Stokes_(producer)", "wikipedia_page": {"main": "Richard Stokes is a British television producer and executive producer. In 2003, he was interviewed for the post of producer on the then in pre-production revival of Doctor Who, but ultimately lost out on the job to Phil Collinson.", "link_mentions": [{"page": "Holby City", "response": ["McHale was the show's lead writer for several years, and was the first British writer ever to become the showrunner of a major prime time drama. Under his tenure as executive producer, attempts were made at modernising the programme and appealing to a younger audience by taking on the filmizing technique and introducing musical montage segments into each episode. Twenty-two series of Holby City have aired with a twenty-third currently airing; it was confirmed in June 2021 that this series would be its last. The show has run for over 1000 hour-long episodes. It is filmed at the BBC Elstree Centre in Hertfordshire, and has featured special episodes filmed on location abroad. From October 2010, Holby City moved to high definition broadcasting. Its first executive producers were Young and Johnathan Young, who were succeeded by Kathleen Hutchison from 2002 to 2004, Richard Stokes from 2004 to 2006, McHale from 2006 to 2010, Belinda Campbell from 2010 to 2011, Johnathan Young from 2011 to 2013, Oliver Kent from 2013 to 2017 and Simon Harper from 2017 to 2021. Holby City airs once a week, all year round, and each series now contains 52 episodes.", "Series producer Richard Stokes believes that the series' popularity stems from the fact the hospital setting presents numerous plotline opportunities, explaining: \"You have licence to create life-and-death situations every week, something you cannot do in any other set piece. The interaction of the characters can be sexy and social issues also permeate the writing. But, basically, hospital drama is successful because the viewers will forgive all the yukky bits for the wonder of a life saved.\" The focus of the series has developed since its conception, expanding to cover extra wards, including a gynaecology ward, an acute assessment unit and a maternity ward. When the maternity ward and a special care baby unit were introduced during series four, Young explained that new wards were necessary to allow the crew to rotate sets, maximising filming potential."]}, {"page": "Torchwood", "response": ["Richard Stokes produced series 1 and 2 of Torchwood; Originally, James Hawes (a Doctor Who director) was lined up as the producer, but he later withdrew from this project. Series 3 was produced by Peter Bennett. Series 4 was produced by Kelly A Manners, with UK filming produced by Brian Minchin, producer of Series 4 and 5 of The Sarah Jane Adventures. The series also shares Doctor Who's production designer, Edward Thomas. Music for the series was composed by Ben Foster and Doctor Who's composer Murray Gold, with composer Stu Kennedy assisting on Series 4.", "| Richard Stokes", "| Richard Stokes"]}, {"page": "Gwen Cooper", "response": ["In the first series of Torchwood, Gwen functioned as an audience surrogate. Russell T Davies likened her character type to that of 2005–06 Doctor Who lead female Rose Tyler (Billie Piper): \"She is the ordinary person who stumbles into something extraordinary and finds herself their equal.\" Eve Myles characterised Gwen as an ambitious and feisty young woman, who at the same time embodies many aspects of the girl next door archetype. Her distinct role within the team stems from the fact that \"she's there for the people\", who she feels \"instinctive and passionate\" about. Producer Richard Stokes noted that Gwen possesses more \"human empathy\" than the more mercenary members of the team, who are seen to be \"technology-and-alien-obsessed\". In this vein, lead actor John Barrowman commented that Gwen brings a \"little bit of soul\" back to Jack. Describing the ways in which Gwen's methods differ from the rest of the team, Myles explained how her police procedural training relates to the job: \"she deals with the families, she deals with profiling, she deals with searching people's backgrounds. It's a new way of working she brings in\". Myles stated that Gwen would have made a \"fantastic policewoman\" prior to joining Torchwood, drawing on the character's ability to get vulnerable characters to \"open up by making them feel comfortable\". Myles perceived Gwen to be \"the heart and emotion of Torchwood\", and \"Torchwood's social worker\" who can \"run and fight and stand in her own corner and win\". Gaining insight into Torchwood through curiosity, Gwen becomes part of Torchwood because they need her, just as she needs them. Gwen's friendship with former colleague Andy is used by the production team to juxtapose her extraordinary life with a mundane one, as well as highlighting her transformation into a harder woman. Andy is present immediately before Gwen first encounters Torchwood, and Myles feels his later appearances \"takes you right back to the beginning, it reminds you where she came from, how Jack found Gwen\". Myles observed that Gwen's many facets prevent her from getting bored; she feels constantly challenged \"physically\", \"mentally\" and \"morally\" through portraying the character.", "Much of Gwen's characterisation centers on her developing relationship with her partner Rhys. Eve Myles describes the character as Gwen's \"normality base\". The relationship is tested by Gwen's affair with colleague Owen Harper (Gorman), a betrayal which Myles believes to be \"completely out of character\" for Gwen, explaining that the guilt experienced over her actions tears her to pieces. The production team had originally planned for Rhys to die in the first series but he was given a reprieve. Producer Richard Stokes explains that Rhys' presence keeps Gwen from losing her \"heart\" and that without him \"it simply becomes a sci-fi show about sci-fi people, running around and hunting aliens\".Richard Stokes interview, \"That's all Stokes\", Torchwood Magazine, issue 4, May 2008, p. 31. Julie Gardner adds that in the discussion, the writers had felt they could not have written Gwen as ever recovering from Rhys' loss, and so chose not to kill off the character. In his analysis of Gwen, Daniel Rawcliffe opines that Rhys helps to keep her mental health intact, and argues that his presence prevents her from undergoing the same psychological deterioration as Suzie."]}, {"page": "Toshiko Sato", "response": ["Naoko Mori's addition to the cast of Torchwood was announced in April 2006. Mori had previously appeared in the Doctor Who episode \"Aliens of London\". Speaking of the decision to cast her in Torchwood executive producer Russell T Davies stated: \"she was absolutely brilliant [in Doctor Who], and I knew then that I wanted to bring her back\". Toshiko is introduced as the technical expert of the Torchwood team. The official Torchwood website described the character as \"quiet but highly intelligent\" and \"focused and intensely professional, though sensitive\". In a 2006 interview Mori described the character as being \"at the cutting edge of technology\" and stated that she \"loves the challenge of trying to work things out\". Though Toshiko at first seems \"a bit square and quiet\" Mori contends that \"she's actually just a very private person\" who doesn't like to share her feelings. Toshiko has a \"very strong bond\" with her boss Jack Harkness though is \"not scared of expressing her opinions with him\" and is shown to have a crush on colleague Owen Harper who Mori feels to be \"one of those guys you can't help but really like ... and fancy a little bit\". Torchwood producer Richard Stokes felt that in her characterisation of Toshiko \"Naoko ... has a real vulnerability that you completely believe\" and stated the character to be \"emotionally the opposite to Owen\". Mori felt the Toshiko centric episode \"Greeks Bearing Gifts\" to be \"a real learning curve\" that makes the character \"stronger\" and well as \"more truthful and honest\"."]}, {"page": "Random Shoes", "response": ["* Producer Richard Stokes likened this episode to the 1946 comedy/drama film It's a Wonderful Life, in which the main character is afforded the chance to look back over his own life and reevaluate it, while remaining invisible to the other characters."]}, {"page": "British Academy Television Award for Best Drama Series", "response": ["|Silk || Hilary Salmon, Peter Moffat, Richard Stokes, Jeremy Webb || BBC Television"]}, {"page": "Kiss Kiss, Bang Bang (Torchwood)", "response": ["The blowfish in the opening scene was intended by executive producer Russell T Davies to be \"like Finding Nemo, but evil\" and the producer of the episode, Richard Stokes, wanted the designs to be as flamboyant as \"the lionfish in The Spy Who Loved Me\". The first designs of the costume were visibly different from the final design; the first designs were more fish-like than humanoid. After a humanoid design was approved by the production team, Millennium FX, who previously created the prosthetics for Doctor Who and the first series of Torchwood, immediately sculpted the costume to Paul Kasey's dimensions. Two versions of the mask were created; one was animatronic, which included mechanical fins, and one was used for the stunt where the blowfish was shot in the head."]}, {"page": "To the Last Man (Torchwood)", "response": ["\"To the Last Man\" is the third episode of the second series of the British science fiction television series Torchwood, which was first broadcast on BBC Two on 30 January 2008. The episode was written by returning series guest writer, Helen Raynor, directed by Andy Goddard and produced by Richard Stokes. As with all episodes of Torchwoods first two series, \"To the Last Man\" featured series regulars John Barrowman, Eve Myles, Burn Gorman, Naoko Mori and Gareth David Lloyd, with Mori's character Toshiko Sato given the main focus."]}, {"page": "Meat (Torchwood)", "response": ["\"Meat\" is the fourth episode of the second series of British science fiction television series Torchwood, which was first broadcast on BBC Two on 6 February 2008. It was written by Catherine Tregenna, who had previously written episodes for the first series of the show, directed by Colin Teague and produced by Richard Stokes. The episode featured the five initial series regulars John Barrowman, Eve Myles, Burn Gorman, Naoko Mori and Gareth David Lloyd plus recurring actor Kai Owen in a central role.", "\"Meat\" was made alongside \"Sleeper\", the second episode of the series which was also directed by Teague, as part of block two of production which ran from 3 June to 5 July 2007.Walker, \"Part Six: Episode Guide-2.04: Meat\" p. 146Torchwood Magazine Yearbook, p. 50 It originally had the working title \"Another Working Day\". In discussing the origins of the central alien writer Catherine Tregenna states that \"we were just throwing ideas around and true to form Russell [T Davies] said \"why isn't it just a great big whale in a warehouse?\"\" Davies states the alien was designed to be \"one of Torchwood and Doctor Whos biggest monsters\" not in terms of concept but its \"literal size\". He felt this provided insight into \"the strangeness of life\". Producer Richard Stokes states that the concept design team created an idea of what they envisaged the whale to look like. Tregenna felt that the original design for the creature was \"a little fanciful\" in that it was a bit too \"beautiful and exotic\" before deciding \"if it looked like that they [the villains] would exhibit it, it would be a freak show.\" She characterises the final design as resembling \"a giant kebab\". Contrary to observations from commentators, Tregenna did not intend the story to promote vegetarianism as she is not a vegetarian — she simply wanted to write an episode that was more action based than her series one episodes (\"Out of Time\" and \"Captain Jack Harkness\"). The hypothetical size of the space whale resulted in Teague having to find this \"huge great warehouse\" and hire a fifty-foot crane for camera angles. Whilst the main body of the alien was created using computer-generated imagery a prosthetic version of the cut wound in the side of the alien was available for the actors to interact with on set. Actor Eve Myles describes it as being like filming within a \"blood soaked, soppy big sponge\". The opening of the creature's eye was created using green screen. Owen felt having to react to this to be the most unusual acting experience he'd had whilst filming Torchwood."]}, {"page": "Law & Order: UK", "response": ["Law & Order: UK was first imagined by franchise creator Dick Wolf in 2000; however, at the time, no network was willing to pick up a pilot for the series. Wolf managed to attract scriptwriter Chris Chibnall, who had previously worked on British productions Torchwood, Life on Mars and Born and Bred, to write a series of 13 adaptions from the original Law & Order series. Wolf then asked Chibnall to look through the Law & Order Bible, a book released in the United States containing a collection of synopses for every episode. Chibnall picked 13 episodes that could be adapted for British television, watched the originals on DVD, and then wrote the adaptations to accommodate contractual requirements with production company Kudos, and to build on the show's reputation of successful storytelling. Subsequently, the series was picked up by ITV. One of the episodes Chibnall adapted, however, had to be scrapped because of incompatibility with English law, resulting in a different episode being adapted. Wolf then attracted producer Richard Stokes to the series, but he stated that a 13-episode series would be too long for broadcast on British television, and thus, he separated the 13 scripts into two separate series. Wolf, however, objected to this, claiming that it wouldn't be an issue, as each series in the United States contains 22 episodes per series. Wolf pushed ITV for more episodes per series, but his attempt was unsuccessful. Each of the 13 scripts was updated for contemporariness, and while the difficulties of adapting the scripts for the English legal system exceeded the expectations of the production team, Stokes opined that audiences familiar with both shows would enjoy them for their distinctions. Further series have continued to adapt scripts from the original Law & Order series. Many of the familiar hallmarks of the original Law & Order series were carried through into the adaptation, including the styling of the opening music, black-and-white intertitles, using Wolf's signature \"clanging cell door\" sound, and hand-held camera work. Stokes later expressed his praise for the Kudos' method of guerrilla filming on the streets of London. Wolf later described the biggest difference between the two series as the wigs, claiming: \"The law is not really that dissimilar and, you know, murder is murder.\"", "*Interview with Richard Stokes", "*Interview with Richard Stokes", "*Interview with Richard Stokes", "* Interview with Richard Stokes"]}, {"page": "Torchwood Magazine", "response": ["The magazine includes the latest news from the Torchwood set, cast and crew interviews, behind-the-scenes features on the show's special effects, and ten pages of original Torchwood comic strip fiction.  The first few issues featured regular columns from Torchwood's lead writer Chris Chibnall and producer Richard Stokes. Issue 8 saw the introduction of an original piece of short prose every month. Issue 14 saw the magazine become a bi-monthly production with a larger page count. Issue 25 will be the final issue."]}, {"page": "Something Borrowed (Torchwood)", "response": ["\"Something Borrowed\" is the ninth episode of the second series of the British science fiction television series Torchwood. It was first broadcast on BBC Three on 5 March 2008 and repeated on BBC Two one week later. The episode was written by Phil Ford, directed by Ashley Way and produced by Richard Stokes. The episode featured the five initial series regulars John Barrowman, Eve Myles, Burn Gorman, Naoko Mori and Gareth David Lloyd plus recurring actor Kai Owen in a central role.", "Describing the tone of the episode Ford describes it as \"an all out romp\" and an \"action, rollercoaster ride\" with \"a lot of comedy in it as much as thrills and nasty monsters\". Davies stated that \"the whole point of the episode is to have a right old laugh\". Expanding on the comedic aspects, something Ford considered whilst writing the episode was that \"the trick is to have the comedy come out of the characters\" rather than the scenario itself. It was Eve Myles' idea to have Gwen compulsively eat gherkins after waking up pregnant; the script had only specified the character drinking a glass of water. The episode also plays on Gwen's conflicted feelings between Jack and Rhys. Davies felt it would be \"irresistible\" to have the wedding temporarily halted by \"the one man Rhys doesn't want to see running down the aisle.\" Ford stated that whilst Jack is \"the series hero\" Rhys is \"the hero of this episode\". He compares a sequence where Rhys arms himself with a chainsaw to defend Gwen to the character being in \"Evil Dead mode\". Producer Richard Stokes commented that the episode illuminated that \"even though [Gwen]'s put [Rhys] through some really difficult times, she really does love him and want to be with him.\"Richard Stokes interview, \"That's all Stokes\", Torchwood Magazine, issue 4, May 2008, p. 31. In an early draft of the script Gwen and Rhys had their memories wiped at the end of the episode in addition to the other guests and were convinced by Jack that the wedding had been problem free.", "The episode was filmed between October and November 2007 in the sixth production block of the series, alongside \"Exit Wounds\". The sequence of Jack, Ianto and Owen leaving for Gwen's wedding was recorded at Roald Dahl Plass on 25 October 2007. A number of locations were used for the wedding venue. Producer Richard Stokes notes that \"it felt like we were organising a real wedding but one that was being shot in about five different venues\". Director Ashley Way states that in directing the wedding scenes, the production team had to make sure that the colour scheme co-ordinated in regards to aspects like the bridesmaids costumes and the flower patterns. Costume designer Ray Holman experienced difficulty sourcing a maternity wedding dress to accommodate the nine-month baby bump worn by Eve Myles. He remarks that in trying to source three such dresses from bridal shops in Cardiff he was regarded \"as if I was the biggest sinner in the world\" and ended up designing the dress worn by Gwen himself.Torchwood Magazine Yearbook, p. 82"]}, {"page": "Adrift (Torchwood)", "response": ["\"Adrift\" is the eleventh episode of the second series of the British science fiction television series Torchwood, which was first broadcast on BBC Three on 19 March 2008, and repeated on BBC Two one week later. The episode was written by series one and two head writer Chris Chibnall, directed by Mark Everest and produced by Sophie Fante and Richard Stokes. The episode featured the five initial series regulars John Barrowman, Eve Myles, Burn Gorman, Naoko Mori and Gareth David Lloyd plus recurring actors Kai Owen and Tom Price.", "\"Adrift\" was produced as part of its own production block: block seven. Filming of the episode was \"double banked\" with block five, which consisted of the episodes \"From Out of the Rain\" and \"Fragments\". This accounted for the lack of availability of some of the regular cast members. Unlike the rest of the episodes in the series, this episode was not solely produced by regular series Richard Stokes but by guest producer Sophie Fante.Walker, \"Part Six: Episode Guide-2.11: Adrift\" p. 210 Discussing the premise of the story writer Chris Chibnall states that \"the issue of loss\" is what drives the narrative and that he had \"always wanted to write a story about people who go missing\". Director Mark Everest noted that \"people go missing all the time\" and that to tackle this theme was \"a brave thing to do\". Executive producer Russell T Davies felt it provided good drama to have a story that would also examine elements of \"paranoia\" and \"fear\" and \"mistrust\" between Gwen and Jack as result of her realising she does not know the full extent of his work within Torchwood. Davies later stated in his book The Writer's Tale that \"Adrift\" was one of the scripts that \"paved the way\" for the third series of the show; his intention being to write Torchwood characters as \"real people\" with \"families, feuds, aches and pains\". The episode underwent less rewriting than any other script from the first two series with the final version being essentially a second draft. Gwen was initially referred to by her husband's surname, Williams, but Eve Myles vetoed this idea as she believed that an independent professional woman would want to keep her maiden name. A change made in the editing of the episode was the cutting of a short scene hinting at a possible romance between Nikki and Andy. This scene is included in the deleted scenes included in the series two boxset.", "Ruth Jones was cast in the central guest role of Nikki. The actress stated that she was both \"excited\" and \"scared\" to appear in the series as it was \"a very serious role\" and comedy had previously been her \"comfort zone\". Robert Pugh was cast as the aged and scarred version of Nikki's son Jonah. Richard Stokes estimated that the actor had to spend between two and two and a half hours in make-up in addition to a twelve-hour filming day to have prosthetics applied to create the appearance of scarring. Ruth Jones found the prosthetics to be \"absolutely fantastic\" and \"very gruesome\". The reveal of Jonah's Scream was initially going to be a wholly alien effect with Pugh just miming on set. However, Pugh was keen to give the scream a go. Everest states that in the final dub the scream was \"tweaked\" and \"layers were added\" although stated that the fundamental basis of it was Pugh \"screaming his lungs out\". Discussing the return of Andy, Stokes stated that it was always the plan for the production team to give the character greater focus in an episode due to his \"comic value\", whilst Eve Myles had joked it was her \"personal mission\" to get the character back."]}, {"page": "Rhys Williams (Torchwood)", "response": ["The original intention of the writers had been to kill off Rhys at the end of the first series, but series creator Russell T Davies found it necessary to keep the show grounded through Rhys as Gwen evolved as a character. Producer Richard Stokes stated that \"without him, it simply becomes a sci-fi show about sci-fi people, running around and hunting aliens.\" Following from the first series the production team decided to make Rhys less of a \"sap\" whilst continuing to use him as a contrast to Torchwood's activities and its charismatic leader Jack Harkness. Whilst early response to the character was mixed — the character was parodied as \"Barry Backstory\" — subsequent reviews praised the character's larger role in later episodes.", "Rhys is a \"down to earth trucker\", who functions as Gwen Cooper's normality base. At the start of the series he believes alien interference to be a result of hallucinations induced by psychotropic drugs in the water supply and that his girlfriend's job is nothing more unusual than generic \"special ops\". Writer Stephen James Walker feels that Rhys \"originally didn't look to have much to him initially but really came into his own as Series One progressed\", attributing this to the \"spot-on performance of the perfectly cast Kai Owen.\" The original intention of the writers had been for Rhys to die at the end of series one, but Richard Stokes explains that it was overruled by show creator Russell T Davies, who felt that without Rhys, the show's main link to the real world would be lost.Richard Stokes interview, \"That's all Stokes\" Torchwood Magazine, issue 4, May 2008, page 29 Executive Producer Julie Gardner expands on this by stating that \"It's a show where you've got to contrast the ordinary everyday with the extraordinary and (with) Gwen going home to Rhys and then going to work in an underground secret base ... it's right to have that balance.\" Actor Kai Owen attributes part of his character's success to his on-screen rapport with actress Eve Myles."]}, {"page": "Captain John Hart (Torchwood)", "response": ["Teasing John's role in \"Exit Wounds\" Marsters stated that he's someone \"who's in way over his head and doesn't even know it yet\" and that \"things do change\" in regards to his character. Chibnall, Marsters and producer Richard Stokes discuss the role of \"Exit Wounds\" in developing John's character and placing him on a redemptive path. Marsters felt the character to be on a \"journey\" whilst Chibnall deliberately played upon the question of \"can you trust him, or can't you?\" Stokes commented that the character isn't the \"selfish and anarchic\" character seen in \"Kiss Kiss Bang Bang\" and that his \"affection and love for Captain Jack are enough to make him try and do the noble thing\". Stephen James Walker, a writer of reference works on Doctor Who and its spin-offs, notes that because of the reluctance of Hart's collaboration with Gray and his remorse for his actions the episode leaves the audience \"a little more favourably disposed\" towards the character. In April 2008 Marsters indicated that he expected to return to Torchwood in the near future. He later expressed a desire to be part of Torchwoods fourth series after it was revealed the show would be largely produced in Los Angeles."]}]}}