{"wiki_id": "http://www.wikidata.org/entity/Q7323658", "itemLabel": "Richard Albrecht", "itemDescription": "actor, writer, director", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Albrecht", "wikipedia_page": {"main": "Richard Albrecht (born 1950) is an English actor, director, producer and writer. His work include all facets of British theatrical life: commercials, corporates, film, narration, television, theatre and voice-over.\nTrained at the E15 Acting School (1967–70), he then went into repertory theatre at Oldham, Lincoln, Birmingham, Nottingham, Newcastle, Leicester, Greenwich, Colchester, Salisbury and Cheltenham. Touring theatre with Pentabus, Bristol Express, Monstrous Regiment, Shared Experience. Fringe Theatre with the Combination, Soho Poly, Traverse, Young Vic, Stratford East, a one-man show RIP Maria Callas at the Edinburgh Festival. West End Happy as a Sandbag. Richard appeared at the Royal Court Theatre in Ashes and Sand and My Child.\nTV appearances include Coronation Street, EastEnders, Casualty, The Bill, King Lear, Threads, Doctors, Agatha Christie's Poirot, Heartbeat, Where The Heart is and Holby City.\nFilms include Jude, The Man Who Cried and the recently completed The Glasshouse. Voice work includes narrating Wainwright-the Man Who Loved the Lakes, 17 episodes of Extraordinary Animals and the kids cartoon/film of Badly Drawn Roy. Latest theatre appearance was in Independent Means at the Library Theatre, Manchester.\nRichard is president of the North London Guinea Pig Fanciers Society and strives to breed the perfect guinea pig in his spare time. His other hobbies include men's netball (in which he represented England in his youth), foraging for mushrooms and crocheting doilies.\n\n", "link_mentions": [{"page": "List of Dalziel and Pascoe cast members", "response": ["*Richard Albrecht"]}, {"page": "List of former Emmerdale characters", "response": ["|Ron Hudson || Richard Albrecht || 1997"]}, {"page": "List of former Coronation Street characters", "response": ["|Derek Heavey || Richard Albrecht || 1999, 2002–2003"]}, {"page": "Roy (TV series)", "response": ["| Series 1-4 || Richard Albrecht || Narrator ||"]}, {"page": "Walking with the Enemy", "response": ["* Richard Albrecht as Rabbi Cohen"]}, {"page": "Albrecht, Richard", "response": ["#redirectRichard Albrecht"]}]}}