{"wiki_id": "http://www.wikidata.org/entity/Q732617", "itemLabel": "Simeon Solomon", "itemDescription": "British artist (1840 – 1905)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simeon_Solomon", "wikipedia_page": {"main": "Simeon Solomon (9 October 1840 – 14 August 1905) was a British painter associated with the Pre-Raphaelites who was noted for his depictions of Jewish life and same-sex desire.  His career was cut short as a result of public scandal following his arrests and convictions for attempted sodomy in 1873 and 1874.\n\n", "link_mentions": [{"page": "August 14", "response": ["*1905 – Simeon Solomon, English soldier and painter (b. 1840)"]}, {"page": "Elagabalus", "response": ["* Heliogabalus, High Priest of the Sun (1866), by the Pre-Raphaelite Simeon Solomon"]}, {"page": "October 9", "response": ["*1840 – Simeon Solomon, English painter (d. 1905)"]}, {"page": "1905", "response": ["* August 14 – Simeon Solomon, British artist (b. 1840)"]}, {"page": "1840", "response": ["* October 9 – Simeon Solomon, British artist (d. 1905)"]}, {"page": "Pre-Raphaelite Brotherhood", "response": ["* Simeon Solomon (painter)", "Many members of the ‘inner’ Pre-Raphaelite circle (Dante Gabriel Rossetti, John Everett Millais, William Holman Hunt, Ford Madox Brown, Edward Burne-Jones) and ‘outer’ circle (Frederick Sandys, Arthur Hughes, Simeon Solomon, Henry Hugh Armstead, Joseph Noel Paton, Frederic Shields, Matthew James Lawless) were working concurrently in painting, illustration, and sometimes poetry. Victorian morality judged literature as superior to painting, because of its “noble grounds for noble emotion.” Robert Buchanan (a writer and opponent of the Pre-Raphaelite Brotherhood) felt so strongly about this artistic hierarchy that he wrote: “The truth is that literature, and more particularly poetry, is in a very bad way when one art gets hold of another, and imposes upon it its conditions and limitations.\" as cited in Welland, D.S.R. The Pre-Raphaelites in Literature and Art. London, UK: George G. Harrap & Co. Ltd., 14. This was the hostile environment in which Pre-Raphaelites were defiantly working in various media. The Pre-Raphaelites attempted to revitalize subject painting, which had been dismissed as artificial. Their belief that each picture should tell a story was an important step for the unification of painting and literature (eventually deemed the Sister Arts), or at least a break in the rigid hierarchy promoted by writers like Robert Buchanan."]}, {"page": "Aestheticism", "response": ["Artists associated with the Aesthetic style include Simeon Solomon, James McNeill Whistler, Dante Gabriel Rossetti, Albert Joseph Moore, GF Watts and Aubrey Beardsley. Although the work of Edward Burne-Jones was exhibited at the Grosvenor Gallery which promoted the movement, it is narrative and conveys moral or sentimental messages hence falling outside the movement's purported programme."]}, {"page": "Eric Stenbock", "response": ["Stenbock attended Balliol College in Oxford but never completed his studies.  While at Oxford, Eric was deeply influenced by the homosexual Pre-Raphaelite artist and illustrator Simeon Solomon. He is also said to have had a relationship with the composer and conductor Norman O'Neill and with other \"young men\"."]}, {"page": "Angel of Death", "response": ["* The Angel of Death (1895), a painting by Simeon Solomon"]}, {"page": "Victorian morality", "response": ["Simeon Solomon and poet Algernon Charles Swinburne, as they contemplated their own sexual identities in the 1860s, fastened on the Greek lesbian poet Sappho. They made Victorian intellectuals aware of Sappho, and their writings helped to shape the modern image of lesbianism.Elizabeth Prettejohn,  \"Solomon, Swinburne, Sappho.\" Victorian Review 34#2 (2008): 103–128. online"]}, {"page": "Henry Holiday", "response": ["Holiday was born in London. He showed an early aptitude for art and was given lessons by William Cave Thomas. He attended Leigh's art academy (where a fellow student was Frederick Walker) and in 1855, at the age of 15, was admitted to the Royal Academy Schools. Through his friendship with Albert Moore and Simeon Solomon he was introduced to the artists Dante Gabriel Rossetti, Edward Burne-Jones and William Morris of the Pre-Raphaelite Brotherhood. This movement was to be pivotal in his future artistic and political life.", "In 1867, Holiday visited Italy for the first time and was inspired by the originality of the Renaissance artists he saw on display there.Simeon Solomon in Italy  for more details. In 1871 he went to Ceylon as part of the \"Eclipse Expedition\". His astronomical drawings were subsequently published in the national press and attracted great interest."]}, {"page": "1860 in art", "response": ["* Simeon Solomon – The Mother of Moses"]}, {"page": "1866 in art", "response": ["* Simeon Solomon – Love in Autumn"]}, {"page": "1873 in art", "response": ["* Early – Pre-Raphaelite painter Simeon Solomon is arrested in a public urinal in London and convicted and fined for gross indecency."]}, {"page": "1864 in art", "response": ["* Simeon Solomon – Sappho and Erinna in a Garden at Mytilene"]}, {"page": "1867 in art", "response": ["* Simeon Solomon – Carrying the Scrolls of the Law"]}, {"page": "List of LGBT Jews", "response": ["* Simeon Solomon, painterglbtq >> arts >> Solomon, Simeon "]}, {"page": "Gordon Bottomley", "response": ["Bottomley studied the work of artists and was a dedicated collector. He bought artworks when he could afford to and his friends also gave him their art in gratitude for his support and friendship. In the 1940s Bottomley and his wife Emily gave their personal art collection of six hundred paintings, prints and drawings to the Tullie House Museum and Art Gallery in Carlisle, Cumberland. The bequest included a nationally important collection of works by the Pre-Raphaelites including pictures by Dante Gabriel Rossetti, Edward Burne-Jones, William Morris, Arthur Hughes, Ford Madox Brown, Elizabeth Siddal and Simeon Solomon. The collection also included work from artists of other genre including those of Stanley Spencer, Samuel Palmer, Albert Moore, Frederic, Lord Leighton, Henri Fantin-Latour, Lucien Pissarro, William Nicholson, Walter Crane, Charles Conder, Jessie Marion King, William Morris's daughter May Morris, William Rothenstein, Charles Ricketts and of course Paul Nash."]}, {"page": "Oscar Browning", "response": ["Browning's personal relationships with boys were a further matter of concern to Hornby. Although Browning took a firm personal line against homosexuality, masturbation and any other sexual practices, he maintained a series of romantic friendships with boys. He had favourites, who were often replaced with a brutal suddenness when they lost their appeal. Sometimes, one of these would accompany him on his regular European trips during the summer holidays, as did Gerald Balfour, the future prime minister's brother, in 1869.   Although this type of close, even affectionate master-boy relationship was considered generally acceptable in Victorian public school life,  Browning's flamboyance and mannerisms were contrary to Hornby's vision for the school; Anstruther writes: \"The mere sight of Oscar Browning with his pale face and effeminate manner was enough in itself to make Hornby suspicious\". Furthermore, Browning's friendship with the artist Simeon Solomon was widely known. Solomon, like Browning, was an advocate of \"Greek love\", a concept derived from Plato's Dialogues which held that the highest form of love was that of men for each other, exclusive of physical expression. The two holidayed together, and Solomon was a frequent visitor to Eton – he exchanged with Browning a series of intimate letters in which they mutually extolled the beauties of various boys.   In February 1873 Solomon was convicted of an act of gross indecency in a London public lavatory – a consensual act of sodomy with a mature working-class male was far from the ideals of Greek love, and Browning ended the relationship with Solomon immediately."]}]}}