{"wiki_id": "http://www.wikidata.org/entity/Q7329072", "itemLabel": "Richard Skinner", "itemDescription": "British Radio DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Skinner_(broadcaster)", "wikipedia_page": {"main": "Richard Skinner (born circa 1951/1952) is a British radio and television presenter.\nHe was the opening announcer and TV anchor at the Live Aid concert in 1985, and is the only presenter to have fronted all three of the BBC's leading pop music programmes, The Old Grey Whistle Test and Top of the Pops on television and the Radio One Top 40 show.\n\n", "link_mentions": [{"page": "BBC Radio 1", "response": ["News coverage on the station was boosted in 1973 when Newsbeat bulletins air for the first time. and Richard Skinner joins the station as one of the new programme's presenters."]}, {"page": "The Stone Roses", "response": ["In 1988 and early 1989 the Stone Roses recorded their debut album at Battery Studios and Konk Studios in London and Rockfield Studios in Wales, produced by Leckie. The first single for Silvertone, \"Elephant Stone\", made little impact, and in early 1989 the band's performances outside the north-west were still attracting small audiences.Robb, p. 195 \"Made of Stone\" received more press attention and was picked up for airplay by DJ Richard Skinner on his late night Radio One show, but peaked at number ninety on the UK Singles Chart. The Stone Roses was released in April  / May 1989, initially to mostly positive reviews, and entered the UK Albums Chart at number 32 in mid-May, the highest position it would reach that year.Robb, p. 207 This was followed with the single \"She Bangs the Drums\", which gave them a top forty UK hit, and a number one on the UK Independent Chart, and by that point they were receiving much greater press attention and were selling out shows across the country.Robb, p. 218Lazell, Barry (1998) Indie Hits 1980–1989, Cherry Red Books, , p. 218 The band gained widespread notoriety when, one minute into a live 1989 TV performance on the BBC's The Late Show, the power failed, prompting Ian Brown to repeatedly squeal \"Amateurs!\" at Tracey MacLeod. Later in 1989 the band released a double A-side single, \"Fools Gold/What the World Is Waiting For\", which reached number eight on the UK Singles Chart in November.Roberts, David, ed. (2006). British Hit Singles & Albums (19th ed.). HiT Entertainment. p. 534. . Originally intended as a B-side, \"Fools Gold\" quickly became the Roses' most famous song and a performance of it on Top of the Pops cemented their national fame. It gave them their first top ten hit and the album rose to number nineteen in the chart early the following year."]}, {"page": "Band Aid (band)", "response": ["Geldof was so moved by the plight of starving children in Ethiopia, that he decided to try to raise money using his contacts in pop music. Geldof enlisted the help of Midge Ure, from the group Ultravox, to produce a charity record. Ure took Geldof's lyrics, and created the melody and backing track for the record. Geldof called many of the most popular British and Irish performers of the time, persuading them to give their time free. His one criterion for selection was how famous they were, to maximise sales of the record. He then kept an appointment to appear on a show on BBC Radio 1, with Richard Skinner, but instead of promoting the new Boomtown Rats material as planned, he announced the plan for Band Aid."]}, {"page": "Live Aid", "response": ["Broadcaster Richard Skinner opened the Live Aid concert with the words:", "The concert was the most ambitious international satellite television venture that had ever been attempted at the time. In Europe, the TV feed was supplied by the BBC, whose broadcast was presented by Richard Skinner, Andy Kershaw, Mark Ellen, David Hepworth, Andy Batten-Foster, Steve Blacknell, Paul Gambaccini, Janice Long and Mike Smith and included numerous interviews and chats in between the various acts. The BBC's television sound feed was mono, as was all UK TV audio before NICAM was introduced, but the BBC Radio 1 feed was stereo and was simulcast in sync with the TV pictures. Unfortunately, in the rush to set up the transatlantic feeds, the sound feed from Philadelphia was sent to London via transatlantic cable, while the video feed was via satellite, which meant a lack of synchronisation on British television receivers. Due to the constant activities in both London and Philadelphia, the BBC producers omitted the reunion of Crosby, Stills, Nash & Young from their broadcast. The BBC, however, did supply a 'clean feed' to various television channels in Europe.", "* Richard Skinner—opened the show and introduced Charles, Prince of Wales and Diana, Princess of Wales"]}, {"page": "Dexys Midnight Runners", "response": ["In April, Dexys prevailed to win their release from EMI, although without the financial support of a label, they were unable to mount the spring tour that had planned and had to settle for playing only five dates, including one recorded by BBC Radio 1.  In June they signed to Mercury Records, where Dexys remained until their 1987 breakup.  Dexys' first single for Mercury, \"Show Me\", produced by Tony Visconti. was released in July 1981 and reached No. 16 in the UK.  The label switch was followed by a session for Richard Skinner's BBC Radio 1 show in which the band previewed tracks that would be reworked later on Too-Rye-Ay. Wynne was sacked by the group at this point, to be replaced by Mick Gallick (whom Rowland gave the stage name \"Giorgio Kilkenny\") on bass.  Music journalist Paolo Hewitt commented about this version of Dexys: \"Dexys wouldn't make a record unless they thought it was great. And they wouldn't play a gig unless they thought they were gonna be great.\""]}, {"page": "The Old Grey Whistle Test", "response": ["Following the departure of Nightingale in 1982, Mark Ellen, David Hepworth and Richard Skinner also took turns as presenters. In 1983, the programme was moved to a live mid-evening slot. The title was abridged to Whistle Test and the title credits and music were changed. Andy Kershaw joined the series as a presenter in 1984. The same four presenters co-presented the BBC's television coverage of Live Aid in 1985."]}, {"page": "Alternative rock", "response": ["In contrast, British alternative rock was distinguished from that of the United States early on by a more pop-oriented focus (marked by an equal emphasis on albums and singles, as well as greater openness to incorporating elements of dance and club culture) and a lyrical emphasis on specifically British concerns. As a result, few British alternative bands have achieved commercial success in the US. Since the 1980s alternative rock has been played extensively on the radio in the UK, particularly by disc jockeys such as John Peel (who championed alternative music on BBC Radio 1), Richard Skinner, and Annie Nightingale. Artists that had cult followings in the United States received greater exposure through British national radio and the weekly music press, and many alternative bands had chart success there.Charlton, p. 349."]}, {"page": "Judie Tzuke", "response": ["Promotion for the album had begun in March when a three-track promo had been issued widely to independent record stores, and Tzuke made two live performances at London's Shaw Theatre in April. These performances were the first time neither Muggleton, Paxman or Bob Noble were part of her live band. \"Outlaws\" was released as a single by Columbia in June 1991, but neither the album nor single made an impact upon the charts despite Radio 1 DJ Richard Skinner making \"Outlaws\" his record of the week on his Saturday afternoon show. Her tenure with Columbia ended after only one album."]}, {"page": "BBC Radio Solent", "response": ["* Richard Skinner (broadcaster) (newsreader, left to join BBC Radio 1 in 1973)"]}, {"page": "Absolute Radio", "response": ["The station launched as Virgin 1215 at 12.15 pm on 30 April 1993. The original line-up of DJs included Richard Skinner, Russ Williams, Jono Coleman, Mitch Johnson, Graham Dene, Nick Abbot, Wendy Lloyd, Tommy Vance, Emperor Rosko and Dave Fanning. Chris Evans was also hired to present a Saturday morning show, following his success at BBC GLR in the weekend mid-morning slot. The Show, The Big Red Mug Show was sponsored by Nescafe. The first song was a cover version of the Steppenwolf song \"Born to be Wild\", recorded by Australian group INXS. Richard Branson was the first voice to be heard, live from the Virgin Megastore in Manchester, with Richard Skinner the first voice back in the London studios. Skinner was also programme director, a role he shared with John Revell. John Pearson was launch sales director, a role he had previously held at LBC . Andy Mollett was launch finance director. David Campbell, previously managing director of one of Virgin's post-production television companies, was the chief executive at launch.", "Virgin Radio's original line-up included Russ Williams, Richard Skinner, Mitch Johnson, Tommy Vance, Jonathan Coleman and Nick Abbot.", "Launched on 29 November 2011, Absolute 70s is the seventh radio station launched under the Absolute branding. The station is broadcast on DAB and online. With Rod Stewart, David Bowie and Prince as highlights of the station's broadcast, it plays music originating from the 1970s. Richard Skinner, another previous DJ from the Virgin Radio days, returned to Golden Square to feature on this station."]}, {"page": "Laughing Stock", "response": ["Hollis cited Can's Tago Mago, John Coltrane's \"In a Sentimental Mood\" – where \"it sounds like the bloke's setting his kit up\" – and Bob Dylan's New Morning as influences, \"because there, if you're talking about sounds being honest, I don't think you can get much more honest than that. It just sounds like the band's in the front room with you.\" In a radio interview with Richard Skinner at the time of the album's release, Hollis commented that \"I think silence is an extremely important thing. It isn't something that should be abused. And that's my biggest worry because of the whole way that communications have developed, that there is a tendency just to allow this background noise all the time rather than thinking about what is important. The silence is above everything, and I would rather hear one note than I would two, and I would rather hear silence than I would one note,\" and according to Wyndham Wallace, \"this helps explain the fifteen seconds of amplifier hiss that open the record's first track, 'Myrrhman', the huge amounts of space left in final track 'Runeii', and the overall sonic concept perfected by Friese-Greene and Brown, who declares third track 'After The Flood' to be \"probably the best engineering for me in the past forty years.\" Drums were miked far from the kit, sounds were allowed to echo through the studio space, mistakes were an integral part of the performance, and the album's dynamics are entirely genuine, the live feel of a jazz record.\""]}, {"page": "Magic (UK radio station)", "response": ["In an attempt to cut costs, Magic began networking its mid-morning show, hosted by Richard Skinner, and automated overnight output with the eight other Magic stations in the North of England in January 2002.  Audience figures fell on all nine stations in the twelve months that followed, some arguing a lack of local content had driven listeners to tune away.  Networking was ended in January 2003, although the eight 'northern' Magic stations continued to share a mid-morning show, hosted by Mark Thorburn, and were subsequently networked again, with the exception of local breakfast shows, following a repositioning of the northern Magic group in mid-2006. These stations were later rebranded into the Bauer City 2 network in 2015."]}, {"page": "Alan Freeman", "response": ["He died on 27 November 2006 in Brinsworth House, aged 79, after a short arthritis illness. His funeral took place at South West Middlesex Crematorium on 7 December 2006, and was attended by singer Kenny Lynch, his producer Phil Swern and DJs including Dave Lee Travis, Ed Stewart, Dave Cash, Paul McKenna, Nicky Campbell, Paul Gambaccini and his Radio One Top 40 successors Wes Butters, Simon Bates and Richard Skinner."]}, {"page": "Absolute Radio Classic Rock", "response": ["Formerly known as Virgin Radio Classic Rock, it originally was an internet-only radio station, and launched in 2000 under the name Virgin Classic by Lee Roberts, SMG Radio Director. On DAB Digital Radio in London, the station launched at 12:15pm with Richard Skinner introducing Steppenwolf's \"Born to Be Wild\". The launch time, presenter, and song (though not the artist) were identical to its parent station Virgin Radio.", "Former presenters include Richard Skinner, Tommy Vance, Alan Freeman, and Alice Cooper."]}, {"page": "Adventures in Modern Recording", "response": ["Initially, Carerre only planned three single releases of Adventures in Modern Recording tracks: \"I Am a Camera\" with a B-side of \"Fade Away\" in October 1981, the title track with \"Blue Nylon\" as its B-side in January 1982 and \"On TV\" with a longer version of \"Blue Nylon\" later that year. However, the album's success in continental Europe led to the label releasing both \"Lenny\" and \"Beatnik\" as singles in 1982. \"On TV\" and \"Fade Away\" garnered an exclusive flexidisc release via Trouser Press magazine, while the title track ran on the seventh issue of SFX Cassette Magazine, where guest critic Richard Skinner applauded Horn's singing and compared it to the works of Crosby, Stills, Nash & Young."]}, {"page": "Tommy Vance", "response": ["Vance had a two-year stint (10 January 1982 to 1 January 1984) hosting the Sunday-afternoon Top 40, where he showed knowledge of and enthusiasm for a wide range of music and displayed a similar keenness when he hosted Top of the Pops around the same time. He also deputised on the Top 40 for Richard Skinner (in 1984 and 1985), Bruno Brookes (in 1987) and Mark Goodier (in 1991 and 1992)."]}, {"page": "Bob Harris (radio presenter)", "response": ["Harris rejoined BBC Radio 1 in 1989, standing in for Richard Skinner for two weeks on the weekday 122 am slot, before being offered his own weekly show on Sunday nights from 11 pm to 2 am later that year following the death of Roger Scott. Harris then took over the weekday 122am slot from April 1990, which then became 124 am when Radio 1 started broadcasting 24 hours a day on 1 May 1991.BBC Programme Index - BBC Radio 1, 1 May 1991"]}, {"page": "Johnnie Walker (DJ)", "response": ["In September 1991, as well as presenting for Radio 5, Walker returned to Radio 1, taking over from Richard Skinner on The Saturday Sequence (renamed from its original incarnation as The Stereo Sequence, as that appellation was now deemed irrelevant by the fact that both Radios 1 and 2 had by then long had their own separate FM frequencies) every Saturday from 3 to 7pm. He went out from 3 to 6pm in March 1992."]}, {"page": "7 (Madness album)", "response": ["*Dale Griffin – producer on Richard Skinner session ", "*Mike Engels – engineer on Richard Skinner session"]}, {"page": "Radio X (United Kingdom)", "response": ["A new schedule was launched on 12 January 2009. Changes at this date included Jo Good leaving the Afternoon Show, including Afternoon X List, and new signing Richard Skinner taking over the Morning Show from Rick Shaw. The times of the shows were also adjusted, with the morning show only becoming a two-hour show (previously a three-hour show) and the afternoon show becoming a four-hour show (previously a 3-hour show). The weekend schedule was also adjusted at this time, with Rick Shaw moving to present the Weekend Morning Show on Saturday and Sunday from 10 am to 2 pm and Lliana Bird taking over the afternoon slots. This led to other changes in the weekend schedule, such as Marsha Shandur's Sunday Brunch ending, and the air times of Marc Haynes Certificate X changing (from 1 pm – 3 pm to 6 pm – 8 pm). Jo Good left the station during these changes, but rejoined at the end of 2012.", "The re-appointment of a previous Programme Controller in 2011 led to a number of changes to Xfm's output. Specialist shows such as Music:Response and Mix Master Mike Show returned, as did presenter Danny Wallace. In September 2011 a new Xfm schedule began, and included Mary Anne Hobbs moving to a re-launched evening show, Music:Response. A new \"local\" slot was introduced. Broadcaster Richard Skinner left the station after two years. The show Import:Export, produced and directed by Redefined Media, was resurrected and linked to KROQ-FM Los Angeles. Further weekend signings included The Sun journalist Gordon Smart starting a three-hour Sunday show. Smart's show ended in October 2013 when he left to join the Scottish Sun as editor. As part of the 2013 schedule Jon Holmes took over the breakfast show. Comedian Josh Widdicombe presented a show on Saturdays between 10 am and 1 pm. It was announced in March 2015 that Russell Brand would be hosting a new Sunday night show, which was to first air on 15 March.", "*Richard Skinner"]}, {"page": "Girls at Our Best!", "response": ["Pleasure was reissued in 1994 by Vinyl Japan in an expanded edition that included the first two singles and \"This Train\". Another reissue, issued by Cherry Red Records on 18 May 2009, included the 1994 edition's bonus material as well as a four-song 1981 Richard Skinner session and a previously unreleased demo track. A 2014 double-vinyl reissue of the album by Optic Nerve Recordings featured the original album on the first LP and all four singles on the second."]}]}}