{"wiki_id": "http://www.wikidata.org/entity/Q7327059", "itemLabel": "Richard Kershaw", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Kershaw", "wikipedia_page": {"main": "Richard Ruegg Kershaw (16 April 1934 – 28 April 2014) was a British television reporter and interviewer.\nBorn in London, he was educated at Cheltenham College (an independent school for boys) in England. He was then called up for National Service as a second lieutenant in the Royal Artillery, serving in Germany before  graduating from Clare College, Cambridge with a history degree and studying at the University of Virginia Graduate School in the USA.He was best known for his contributions as a reporter to the BBC's Panorama current affairs series. Later he joined Nationwide. He was also a reporter on other BBC current affairs programmes including 24 hours, Newsday, Newsweek and general election night broadcasts. He died aged 80 on 28 April 2014.", "link_mentions": [{"page": "Kershaw", "response": ["* Richard Kershaw (1934–2014), UK television reporter"]}, {"page": "The World Tonight", "response": ["Presenters with strong journalistic credentials, including John Tusa, Anthony Howard, Richard Kershaw, Isabel Hilton and Robin Lustig, have secured and maintained the programme's reputation for authoritative coverage.", "* Richard Kershaw"]}, {"page": "Africa Confidential", "response": ["Africa Confidential focuses on issues that affect the continent, analyses political complexities and reports on areas and topics that receive little coverage in the mainstream press. With its investigations into corruption and political intrigue, the journal punches above its weight and was famously the subject of a record six-year libel case that ended in June 2001. Its Zimbabwe, Kenya, Nigeria and Sudan coverage often makes the news in the mainstream press. Patrick Smith has edited Africa Confidential since 1991. Former editors include Richard Kershaw (1964–1968) and Stephen Ellis (1986–1991)."]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Richard Kershaw – presenter and reporter on various current affairs programmes, including Panorama, Nationwide and 24 Hours during the 1970s and 1980s. He died in 2014."]}, {"page": "1934 in the United Kingdom", "response": ["**Richard Kershaw, journalist (died 2014)"]}, {"page": "2014 in the United Kingdom", "response": ["**Richard Kershaw, 80, broadcaster and journalist."]}, {"page": "Deaths in April 2014", "response": ["*Richard Kershaw, 80, British broadcaster and journalist.Richard Kershaw obituary"]}, {"page": "Kershaw, Richard", "response": ["#redirectRichard Kershaw"]}, {"page": "Tonight (1975 TV programme)", "response": ["1 September 1975 until 5 July 1979 on BBC One. It was initially presented by Sue Lawley, Denis Tuohy and Donald MacCormick and reporters included John Pitman, Richard Kershaw, David Lomax, David Jessel and Michael Delahaye. Michael Bunce was the programme's first editor. Unlike its predecessor also called Tonight which was shown in the early evening,  this programme was generally the last BBC One programme each evening and appeared at variable times. It took over from the 24 Hours programme, also on BBC One in late evenings, and ran in the same years as the BBC's Nationwide which was shown early evening."]}]}}