{"wiki_id": "http://www.wikidata.org/entity/Q7325943", "itemLabel": "Richard Glanfield", "itemDescription": "British squash player and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Glanfield", "wikipedia_page": {"main": "Richard Glanfield (born 11 June 1964 in Ely, Cambridgeshire) is a squash coach and former professional squash player from Shropshire, England.\nSince turning professional in 1983, Glanfield has gained most of his coaching experience working outside his native England. He became the world's youngest international squash coach aged 21 years old when coaching Cyprus at the European Championships 1986 Aix-en-Provence, France. Since then Glanfield has coached in the Netherlands, Spain, France and as national coach of Malaysia, Peru, and most recently Trinidad and Tobago. In Malaysia he spent 11 years as national elite coach and is most well known for developing the talents of Nicol David, the woman's world number 1 squash player for a record 9 years, whom he coached from the age of 11 years, from 1995 to 2002. Glanfield is the only national coach to have coached national teams at the European, asian, south American, Pan American  and Caribbean team championships, as well as the Commonwealth Games   and Asian Games. Since Moving to the United States in 2012 Glanfield spent four years coaching in Las Vegas and  Santa Barbara, before taking over the post as the director of squash at The Baldwin School, Pennsylvania, and director of squash at the Baldwin Squash Academy, The United States of America.", "link_mentions": [{"page": "Nicol David", "response": ["David is the first squash player to have won the World Junior title twice; in 1999 and 2001 under the tutelage of Richard Glanfield. She remained the only female squash player to have achieved this, until Raneem El Weleily emulated David's feat by winning her second World Junior Championship in 2007. David joined WISPA and turned professional in 2000 when she won her first WISPA title, after only a month on the tour. The victory came in February, when she defeated Salma Shabana in the final of the Savcor Finnish Open. On 7 June 2008, David was honoured with the Order of Merit (Darjah Bakti) or D.B. in conjunction with the birthday of the His Majesty Tuanku Mizan Zainal Abidin. She was the first recipient of the award which was established on 26 June 1975. David was also invited to carry the Olympic torch for Malaysia during the build up to the Athens Olympics in 2004 and being appointed as UNDP National Goodwill Ambassador for Malaysia.", "David won the Women's World Junior Squash Championships of 1999 beating her compatriot Lynn Leong in the final in Antwerp, Belgium, making her the youngest woman to become the world junior champion at the age of 15. In the process, she defeated three players ranked in the world top 20. She successfully defended the title in Penang in 2001, becoming one of only two players in the history of squash to have won it twice; her coach was Richard Glanfield."]}, {"page": "Glanfield", "response": ["*Richard Glanfield (born 1964), English squash player and coach"]}, {"page": "Glanfield, Richard", "response": ["#redirectRichard Glanfield"]}]}}