{"wiki_id": "http://www.wikidata.org/entity/Q7324306", "itemLabel": "Richard Boys", "itemDescription": "English priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Boys", "wikipedia_page": {"main": "Reverend Richard Boys MA (1785–1867) was a Church of England clergyman and author, most notable for his tenure as Chaplain on St. Helena at the time of Napoleon Bonaparte's exile there. A controversial figure during his time there, he also played a part in the mystery surrounding Napoleon's death mask.", "link_mentions": [{"page": "Maidstone Museum", "response": ["There are internationally important collections of artefacts of Pacific, Oceanic and African ethnography as well as diverse material from Asia and North and South America. Napoleon's chair has been held in the museum since 1866.  It was one of a pair in the house of Reverend Richard Boys on St Helena, and after Napoleon was exiled there in 1815 he habitually sat in this chair, conversed with Boys and damaged the chair with his penknife while talking."]}, {"page": "Loose, Kent", "response": ["In the village, the Brooks Path is a picturesque causeway along the Loose Stream that joins the two ends of the village, dividing the mill pond which once fed the village mill. All Saints Church in the Diocese of Canterbury, overlooks this section of river. A local tradition has it that whoever sticks a pin in the old yew tree in the churchyard, then runs around it anticlockwise at midnight, will on looking through a small window above the Charlton Memorial against the church wall, see a vision of a woman killing a baby. The Reverend Richard Boys was vicar here and also chaplain of St Helena during Napoleon Bonaparte's exile on the island.\"Napoleon's chair found in storage\", BBC Kent, 6 July 2009 He is buried in the churchyard."]}, {"page": "List of Old King's Scholars", "response": ["*Richard Boys (1785–1867), Anglican clergyman, chaplain on St. Helena and author", "*Richard Boys (1785–1867), Anglican clergyman, chaplain on St. Helena, and author"]}, {"page": "Boys, Richard", "response": ["#redirectRichard Boys"]}]}}