{"wiki_id": "http://www.wikidata.org/entity/Q7328168", "itemLabel": "Richard Ollard", "itemDescription": "British historian and biographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Ollard", "wikipedia_page": {"main": "Richard Ollard (1923–2007) was an English historian and biographer. He is best known for his work on the English Restoration period.", "link_mentions": [{"page": "Samuel Pepys", "response": ["Several detailed studies of Pepys's life are available. Arthur Bryant published his three-volume study in 1933–1938, long before the definitive edition of the diary, but, thanks to Bryant's lively style, it is still of interest. In 1974 Richard Ollard produced a new biography that drew on Latham's and Matthew's work on the text, benefiting from the author's deep knowledge of Restoration politics. Other biographies include: Samuel Pepys: A Life, by Stephen Coote (London: Hodder & Stoughton, 2000) and, Samuel Pepys and His World, by Geoffrey Trease (London: Thames and Hudson, 1972)."]}, {"page": "Michiel de Ruyter", "response": ["In 1664, a year before the Second Anglo-Dutch War began, Robert Holmes had captured several Dutch West India Company trading posts and ships on the West African coast, seeking to forcibly expel Dutch influence from the region.Richard Ollard: Man of War. Sir Robert Holmes and the Restoration Navy. London (1969). Although Johan de Witt wanted to avoid an all-out war with England, he considered that this provocation must be responded to, and proposed to the States General that de Ruyter's squadron in the Mediterranean should be sent to West Africa to retake the West India Company's forts there. De Ruyter received his instructions at Málaga on 1 September 1664 and, by early the next month, all the Dutch West African posts had been recaptured and the squadron was ready to cross the Atlantic to attack English shipping in the West Indies and at the Newfoundland fisheries in reprisal."]}, {"page": "A. L. Rowse", "response": ["Rowse was born at Tregonissey, near St Austell, Cornwall, the son of Annie (née Vanson) and Richard Rowse, a china clay worker. Despite his parents being poor and having little formal education, he won a place at St Austell County Grammar School and then a scholarship to Christ Church, Oxford, in 1921. He was encouraged in his pursuit of an academic career by a fellow Cornish man of letters, Sir Arthur Quiller-Couch, of Polperro, who recognised his ability from an early age. Rowse endured doubting comments about his paternity, thus he paid particular attention to his mother's association with a local farmer and butcher from Polgooth, near St Austell, Frederick William May (1872–1953).Richard Ollard; A Man of Contradictions: A Life of A. L. Rowse Any such frustrations were channelled into academia, which reaped him dividends later in life."]}, {"page": "National Maritime Museum", "response": ["* 1992: Richard OllardPenguin Books author biography: Richard Ollard , accessed 20 October 2007."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Richard Ollard (1923–2007), author, editor and historian"]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "Abbots Leigh", "response": ["A description of the house appears in the book The Escape of Charles II, After the Battle of Worcester by Richard Ollard: Watercolour images of Abbot's Leigh House https://www.watercolourworld.org/painting/side-view-abbots-leigh-house-where-charles-ii-took-refuge-after-battle-worcester-tww000440 https://www.watercolourworld.org/painting/gateway-abbots-leigh-house-where-charles-ii-took-refuge-after-battle-worcester-tww00043e http://www.bl.uk/onlinegallery/onlineex/kinggeorge/a/003ktop00000038u012a0000.html"]}, {"page": "Robert Holmes (Royal Navy officer)", "response": ["* Richard Ollard: Man of War. Sir Robert Holmes and the Restoration Navy. London 1969"]}, {"page": "Deaths in January 2007", "response": ["*Richard Ollard, 83, British historian and biographer."]}, {"page": "John Thornborough", "response": ["*A. L. Rowse, \"Bishop Thornborough: A Clerical Careerist\", in Richard Ollard and Pamela Tudor-Craig (editors), For Veronica Wedgwood These Studies in Seventeenth-Century History (1986)"]}, {"page": "Leigh Court", "response": ["The original Leigh Court was an Elizabethan mansion built by Sir George Norton. His great-great-grandson, also George Norton (born 1622), unknowingly hosted Charles II, who arrived at the house the evening of 12 September 1651, during his escape to France following the Battle of Worcester. The Nortons were friends of the Kings's travelling companion, Jane Lane. The Nortons were unaware of the King's identity during his three-day stay. While staying at Leigh Court and after being recognised by the elderly butler, who had served the King when a young Prince at Richmond, Charles deflected suspicion by asking a trooper, who had been in the King's personal guard, to describe the King's appearance and clothing at the Battle of Worcester. The man looked at Charles and said, \"The King was at least three inches taller than you.\"Count Grammont. Memoirs of the Court of Charles the Second and the Boscobel Narratives , edited by Sir Walter Scott, Publisher: Henry G Bohn, York Street, London, 1846. Chapter: King Charles's escape from Worcester: (The King's own account of his escape and preservation after the Battle of Worcester as dictated to Samuel Pepys at Newmarket on Sunday, October 3rd, and Tuesday, 5 October 1680). p.466J. Hughes (ed.) (1857). The Boscobel Tracts: Relating to the Escape of Charles the Second After the Battle of Worcester and his subsequent adventures , William Blackwood and Sons. p.166 Richard Ollard describes the house in The Escape of Charles II, After the Battle of Worcester:"]}, {"page": "Heywood Hill Literary Prize", "response": ["| Norman Lewis and Richard Ollard (shared)"]}, {"page": "List of New College, Oxford people", "response": ["*Richard Ollard, historian and biographer"]}, {"page": "R. L. Ollard", "response": ["#REDIRECT Richard Ollard"]}, {"page": "Edward Chaney", "response": ["No one interested in the impact of Italy on English civilisation from the Middle Ages onwards will read this remarkable book without finding out something he did not know and experiencing the thrill of a connection he has not seen. Professor Chaney’s range is as wide and refreshing as his learning is exact. He uses his eyes and his judgement is never indecisive.Richard Ollard"]}, {"page": "Ollard, Richard", "response": ["#redirectRichard Ollard"]}, {"page": "Ollard", "response": ["*Richard Ollard (1923–2007), English historian and biographer"]}, {"page": "Collected Short Stories (O'Brian book)", "response": ["Richard Ollard, O'Brian's editor at William Collins, described the tale in his 1973 pre-publication assessment as being \"disquieting and faintly eerie\". Tolstoy speculated that the feeling of loss may have derived from the author's occasional and quite irrational concerns that he might lose his wife or her affections.", "Richard Ollard described this tale in his 1973 assessment for William Collins as \"exciting and terrifying\". Tolstoy noted that the opening description provides a lyrical evocation of the largely unaltered Collioure of O'Brian's early days in the town.", "Reviewing the story for the its 1955 US publication, Donald Barr for The New York Times said that it \"laughingly arrays the Seven Deadly Sins and the cardinal virtues in the guise of a medieval saint's legend.\"  In his 1973 assessment, Richard Ollard called this story \"enchantingly funny.\"  King considered it to stand out from his other stories \"like a glorious speckled trout in a goldfish pond.\"", "In his assessment of 1973, Richard Ollard considered the tale to be notably good in setting the scene and in evoking the emotions kindled by the sport.", "In his 1973 assessment Richard Ollard noted this story as being \"disquieting and faintly eerie.\""]}]}}