{"wiki_id": "http://www.wikidata.org/entity/Q7325204", "itemLabel": "Richard Digby Day", "itemDescription": "British theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Digby_Day", "wikipedia_page": {"main": "Richard Digby Day (born 27 December 1938) is a British stage director and international professor and lecturer. He is well known for his work in the classical theatre, in particular the plays of William Shakespeare and George Bernard Shaw. He is vice president of the Shaw Society, a Fellow of the Royal Society of Arts, and has staged more productions of Shaw's work than any other living director. His productions of Stephen Sondheim musicals have also been notable.", "link_mentions": [{"page": "Hugh Grant", "response": ["Soon afterwards he was offered a supporting role in The Bounty (1984) starring Mel Gibson and Anthony Hopkins, but was prevented from playing the role because he didn't yet have an Equity card, which could only be earned through acting in regional theatre. To obtain his Equity card, he joined the Nottingham Playhouse and lived for a year at Park Terrace in The Park Estate in Nottingham. Richard Digby Day directed him in small roles at the Nottingham Playhouse in Lady Windermere's Fan, an avant-garde production of Hamlet and Coriolanus.Smith, Madeline C.; Eaton, Richard (eds). Eugene O'Neill Production Personnel: A Biographical Dictionary of Actors, Directors, Producers, and Scenic and Costume Designers in Stage and Screen Presentations of the Plays. McFarland & Company, 2005. p. 80."]}, {"page": "Edward Fox (actor)", "response": ["Fox has consolidated his reputation with regular appearances on stage in London's West End. He was seen in Four Quartets, a set of four poems by T. S. Eliot, accompanied by the keyboard music of Johann Sebastian Bach, performed by Christine Croshaw. In 2010, Fox performed a one-man show, An Evening with Anthony Trollope, directed by Richard Digby Day. In 2013, he replaced Robert Hardy in the role of Winston Churchill in the premiere of The Audience, after Hardy had to withdraw for health reasons. In 2018, he appeared with his son Freddie Fox in an adaption of Oscar Wilde's An Ideal Husband."]}, {"page": "Nottingham Playhouse", "response": ["Subsequent artistic directors were Stuart Burge, Richard Eyre, Geoffrey Reeves, Richard Digby Day, Kenneth Alan Taylor, Pip Broughton, Martin Duncan and Giles Croft. The Playhouse is currently under the leadership of Stephanie Sirr, Chief Executive and Adam Penford, Artistic Director. "]}, {"page": "Bruce Payne", "response": ["| Directed by Richard Digby Day (Nottingham Playhouse); play by William Shakespeare"]}, {"page": "Richard Day", "response": ["*Richard Digby Day (born 1941), British stage director"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Richard Digby Day (Directing Certificate 1963)"]}, {"page": "An Awfully Big Adventure", "response": ["Hugh Grant based his characterization of Meredith on Richard Digby Day, a past director of his from Nottingham Playhouse."]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Richard Digby Day"]}, {"page": "List of Fordham University faculty", "response": ["* Richard Digby Day"]}, {"page": "Swan Theatre, Worcester", "response": ["The theatre has had many Associate and Assistant Directors which have included Phyllida Lloyd CBE, David Wood OBE, Richard Digby Day, Paul Clarkson, and Sam Walters."]}, {"page": "Worcester Repertory Company", "response": ["Michael Winter had previously been a Staff Producer at the Saddlers Wells Opera and the Director of Productions for Bournemouth Theatre Company before he was appointed as the Worcester Repertory Company's Artistic Director. Productions during his tenure continued the eclectic programme set up by John Hole and included A Midsummer Night's Dream, The Lion in Winter, The Philanthropist, The Mating Game, Boeing Boeing, Sleuth, Absurd Person Singular, Oh Coward, Funny Peculiar and Mrs. Warren's Profession. Associate directors during Michael Winter's tenure included, Don Dryden and Richard Digby Day.", "* Richard Digby Day"]}, {"page": "University of Bristol Theatre Collection", "response": ["Including: Dr Kathleen Barker (1925–1991), Richard Digby Day (b. 1941), George Rowell (d. 2001), Richard Southern (1903–1989) and Glynne Wickham (1922–2004)"]}, {"page": "Adam Klasfeld", "response": ["He studied theatre at Rutgers University and followed up on his studies at the Academy of Theatre in London under Richard Digby Day."]}]}}