{"wiki_id": "http://www.wikidata.org/entity/Q7321789", "itemLabel": "Rhys Hopkin Morris", "itemDescription": "Member of Parliament in the United Kingdom (1888-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhys_Hopkin_Morris", "wikipedia_page": {"main": "Sir Rhys Hopkin Morris (5 September 1888 – 22 November 1956) was a Welsh Liberal politician who was a Member of Parliament from 1923–1932 and from 1945–1956.\n\n", "link_mentions": [{"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "Maesteg", "response": ["* Sir Rhys Hopkin Morris, (1888–1956), politician, stipendiary magistrate, first director of the Welsh Region BBC."]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "Ceredigion (UK Parliament constituency)", "response": ["Evans held on as a 'National Liberal' (as Lloyd George's supporters called themselves) in the 1922 general election but with a slim majority of 515 votes (2.0%) over Rhys Hopkin Morris.", "The first Labour Party candidate stood against Rhys Hopkin Morris at the 1931 general election and polled 24% of the vote in a straight fight against Morris, who had a 13,752 (52.0%) majority.", "| Rhys Hopkin Morris"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Rhys Hopkin Morris"]}, {"page": "National Liberal Club", "response": ["The club continued to be a venue for large-scale meetings of Liberals. On Armistice Day 1924, over one hundred defeated Liberal candidates met at the club to express their anger at Lloyd George's failure to use his infamous \"Lloyd George fund\" to help the Liberals in the disastrous general election campaign one month earlier.Frank Owen, Tempestuous Journey: Lloyd George, His Life and Times (Hutchinson, London, 1954), p. 684. After the 1929 general election, the first meeting of the newly expanded Parliamentary Liberal Party was held at the club, with all MPs except one (the independently minded Rhys Hopkin Morris) re-electing Lloyd George as Liberal Party Leader.J. Graham Jones, David Lloyd George and Welsh Liberalism (National Library of Wales, Aberystwyth, 2010), p. 271."]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "Hopkin", "response": ["* Rhys Hopkin Morris (1888–1956), Welsh politician"]}, {"page": "Chairman of Ways and Means", "response": ["| Rhys Hopkin Morris"]}, {"page": "List of UK minor party and independent MPs elected", "response": ["| Rhys Hopkin Morris"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Rhys Hopkin Morris"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Rhys Hopkin Morris"]}, {"page": "List of Liberal Party (UK) MPs", "response": ["* Rhys Hopkin Morris, Cardiganshire, 1923–32; Carmarthen, 1945–56Elected as an Independent Liberal in 1923 against an official Liberal, took the Liberal whip from 1924 onwards.", "* Rhys Hopkin Morris, Cardiganshire, 1923–1932; Carmarthen, 1945–1956"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "Rhys Hopkin-Morris", "response": ["#REDIRECTRhys Hopkin Morris"]}, {"page": "1957 Carmarthen by-election", "response": ["The seat became vacant as a result of the death of Sir Rhys Hopkin Morris on 22 November 1956. The Liberal Party was in a period of decline and Hopkin Morris had been one of only six Liberal Members of Parliament. Hopkin Morris's majorities had been narrow and it was recognised that a significant number of voters had favoured him personally and might not transfer their allegiance to a new Liberal candidate."]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Rhys Hopkin Morris"]}, {"page": "1957 in Wales", "response": ["*28 February – Carmarthen by-election is held following the death of Sir Rhys Hopkin Morris the previous year. The Liberal Party lose the seat to Labour's Lady Megan Lloyd George, herself a former Liberal MP."]}, {"page": "1956 in Wales", "response": ["*22 November – Rhys Hopkin Morris MP, politician, 68"]}, {"page": "1944 in Wales", "response": ["*BBC commentator Alun Williams marries Perrie Hopkin Morris, daughter of Sir Rhys Hopkin Morris."]}, {"page": "Carmarthen (UK Parliament constituency)", "response": ["||1945 || Rhys Hopkin Morris || Liberal"]}, {"page": "Moelwyn Hughes", "response": ["He was elected to the House of Commons at an unopposed by-election in 1941, as Member of Parliament for Carmarthen, following the resignation of Labour MP Major Daniel Hopkin MC. However, at the 1945 general election, he lost the seat by 1,279 votes to the Liberal candidate Rhys Hopkin Morris."]}, {"page": "Ernest Evans (politician)", "response": ["From November 1918 until December 1920 Evans served as private secretary to the Prime Minister David Lloyd George. Matthew Vaughan-Davies, the long-serving Liberal MP for Cardiganshire, was elevated to the peerage as Baron Ystwyth, of Tan-y-Bwlch in the County of Cardigan, in the 1921 New Year Honours, and in February 1921, Evans was elected as Member of Parliament (MP) for Cardiganshire at a by-election representing the Coalition Liberals.  He held the seat at the 1922 general election, but was defeated at the 1923 general election by the independent Rhys Hopkin Morris."]}, {"page": "Owen Evans (politician)", "response": ["He was elected as Member of Parliament (MP) for Cardiganshire at a by-election in 1932, following the resignation of the Liberal MP Rhys Hopkin Morris.  Evans held the seat until his sudden death, probably of heart failure, shortly before the 1945 general election. His death robbed him of becoming a Knight Bachelor; his appointment had been announced in the Dissolution Honours List published on 7 June 1945 but he died before he could be knighted."]}, {"page": "1923 in Wales", "response": ["**Rhys Hopkin Morris gains Ceredigion for the Independent Liberals (from the Liberals)."]}, {"page": "United Kingdom general election records", "response": ["*Carmarthen, 1950: Rhys Hopkin Morris* and Lynn Ungoed-Thomas"]}, {"page": "1880s in Wales", "response": ["**5 September – Rhys Hopkin Morris, politician (died 1956)"]}, {"page": "1888 in Wales", "response": ["*5 September – Rhys Hopkin Morris, politician (died 1956)"]}, {"page": "Morris (surname)", "response": ["* Rhys Hopkin Morris (1888–1956), Welsh Liberal politician, Member of Parliament (1923–1932, (1945–1956)"]}, {"page": "Emrys Roberts", "response": ["The immediate post-war period continued to be difficult for the Liberal Party in terms of political positioning. There was an ideological debate going on as to whether the party should be a party of classical liberal ideas, Free Trade, small government and individual liberty or if it should stand for social liberalism in the more recent traditions of H H Asquith's post-1908 administration, the economic thinking of John Maynard Keynes and the social and industrial heritage of William Beveridge and David Lloyd George.G Lippiatt, entry on the Radical Reform Group in Brack & Randall, Dictionary of Liberal Thought: Politico’s, 2007 p.239 Together with Lady Megan Lloyd George and Edgar Granville, Roberts was one of a group of MPs determined to stand up against what they saw as the party's drift to the Right under the leadership of Clement DaviesD Dutton. A History of the Liberal Party in the 20th Century, Palgrave Macmillan, 2004 p.171 and to save its Radical soul.Mervyn Jones, A Radical Life: The Biography of Megan Lloyd George, Hutchinson, 1991 p.212 In 1950, Roberts criticised Davies saying that the party was being badly led and that he should be consulting the Deputy Leader (Lady Megan) rather than the Chief Whip on matters of policy in the first instance.P Barberis, Liberal Lion, Jo Grimond: A Political Life; I B Tauris, 2005 p.50  As a reward for their pro-Labour leanings (see also next section below) and support of the Labour government in Parliamentary votes, the Conservatives decided to renew their opposition against Lady Megan in Anglesey and Roberts in MerionethThe Times, 8.10.51 and their intervention was a critical factor in the loss of these two long-standing Liberal seats.The Times, 27 October 1951 By way of contrast, the Conservatives declined to stand candidates in the constituencies held by Clement Davies, Roderic Bowen and Rhys Hopkin Morris who had the reputation of being more right-wing, all of whom held their seats. After the 1951 general election a number of leading Radicals gave up on the Liberal Party with Lady Megan and Granville defecting to Labour followed soon after by other former MPs Dingle Foot and Wilfrid Roberts."]}, {"page": "Radio in Wales", "response": ["The lack of Welsh-language broadcasting saw an alliance of organisations who waged a campaign to amend the situation. The University of Wales sent a deputation to London to argue for greater recognition of the nation in late 1928, but by the mid 1930s they were joined by the National Union of Welsh Societies, the Welsh Parliamentary Party and Plaid Genedlaethol Cymru in pressuring the BBC. The argument put forward by the BBC was that a lack of wavelengths made it technically impossible to separate the West and Wales. This argument was demolished by 19 year-old physicist Edward George Bowen and the resulting pressure resulted in a studio being established in north Wales at Bangor in 1935. In addition a transmitter was erected in Llangoed and Wales was given its first Welsh Regional Director, Rhys Hopkin Morris. Finally, in July 1937, Wales was allocated its own wavelength and broadcast its first program on 4 July. Historian John Davies argued that the establishment of the Welsh Region was an important concession to nationalist sentiment."]}, {"page": "1943 University of Wales by-election", "response": ["After serving as private secretary to the Prime Minister David Lloyd George, he was elected as Coalition Liberal MP for Cardiganshire at a by-election in 1921.  He held the seat at the 1922 general election as a National Liberal candidate, but was defeated standing as a Liberal at the 1923 general election by the Independent Liberal Rhys Hopkin Morris."]}, {"page": "William Nathaniel Jones", "response": ["The by-election did presage a change in political fortunes in the constituency. At the 1929 general election Jones lost the seat to Dan Hopkin in another three-cornered fight.  Evans regained it for the Liberals in 1931 but lost to Hopkin in 1935. The seat returned to the Liberals in 1945 when it was won by Sir Rhys Hopkin Morris but was recaptured for Labour in 1957 at the by-election which was caused by Hopkin Morris’ death; the successful Labour candidate being Lady Megan Lloyd George who had herself defected from Liberal to Labour."]}, {"page": "Welsh Liberal Party", "response": ["After World War I, David Lloyd George remained Prime Minister and leader of a national government.  The Welsh National Liberal Council remained loyal to him, but a substantial majority wished to stand independent Liberal Party candidates, and formed the rival Welsh Liberal Federation, with Henry Gladstone as their president.  In 1924, the Welsh Liberal Federation rejoined the National Council, against the lone objection of Rhys Hopkin Morris.", "At the 1945 General Election the Liberal Party was reduced to a small group of twelve MPs, of whom seven represented Welsh constituencies. This group of seven has been described by a prominent historian of Welsh Liberalism, J. Graham Jones, as \"a disparate team. lacking in cohesion and a common political philosophy\". Emrys Roberts and Megan Lloyd George were increasingly close to Labour on issues such as the formation of the National Health Service. In contrast, Lady Megan's brother Gwilym, who represented Pembrokeshire, drifted towards the Conservatives and had the Liberal whip withdrawn in 1946. Clement Davies, who became party leader in 1945, and had represented Montgomeryshire since 1929, had been a member of the Liberal faction led by Sir John Simon in the 1930s but had subsequently become more radical in his views. Rhys Hopkin Morris, who won Carmarthen from Labour against the tide in 1945, was fiercely independent in his views, while Roderic Bowen, elected for the first time in Cardiganshire in 1945, was at the time an unknown quantity. Finally, the University of Wales seat (abolished in 1950) as held by the academic Professor W. J. Gruffydd, who had defeated former Plaid Cymru president Saunders Lewis in a fiercely contested by-election in 1943. Despite these differences within the group, the fact remained that the rural west and north Wales was now one of the party's last remaining sources of significant support. To some extent this reflected the continuing correlation between Liberalism and nonconformity, although it has been suggested that the connection was sustained more by habit than conviction."]}, {"page": "1932 Cardiganshire by-election", "response": ["The seat had become vacant when the constituency's Liberal Member of Parliament (MP), Rhys Hopkin Morris (5 September 1888 – 22 November 1956) resigned after being appointed a Metropolitan Police Magistrate (a full-time paid magistrate, sitting as a judicial officer at courts in the London Metropolitan Police area).", "Rhys Hopkin Morris was born in Maesteg, Glamorgan. He qualified as a barrister in 1919, after serving as an Army officer during the First World War.", "Hopkin Morris had first contested Cardiganshire, as the official candidate of the Liberal Party, in the 1922 general election. He lost to Lloyd George's private secretary Ernest Evans, standing for the National Liberal Party. In the 1923 general election, after the two Liberal factions had re-united, Evans was the Liberal nominee. Rhys Hopkin Morris stood again, as an Independent Liberal, and won the seat. Thereafter he took the Liberal whip and was MP for the seat until resigning in August 1932.", "Rhys Hopkin Morris was Deputy Chairman of Ways and Means (a deputy Speaker of the House of Commons) between November 1951 and November 1956. He was knighted in 1954."]}, {"page": "Alun Williams", "response": ["He was married to Perrie Hopkin Morris, daughter of Liberal MP Sir Rhys Hopkin Morris and his wife Gwladys."]}, {"page": "List of members of Middle Temple", "response": ["* Sir Rhys Hopkin Morris (1888-1956), Welsh Liberal politician."]}, {"page": "London Welsh Centre", "response": ["*1936–1937 Rhys Hopkin Morris"]}, {"page": "1954 New Year Honours", "response": ["*Rhys Hopkin Morris, MBE QC MP, Deputy Chairman of Ways and Means, House of Commons, since 1951. Member of Parliament for Cardiganshire, 1923–1932, and for Carmarthen since 1945."]}]}}