{"wiki_id": "http://www.wikidata.org/entity/Q7329107", "itemLabel": "Richard Smith", "itemDescription": "bishop in England (1624 - 1632)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Smith_(bishop)", "wikipedia_page": {"main": "Richard Smith (Hanworth, England, November 1568 – Paris, 18 March 1655), (officially the Bishop in partibus of Chalcedon). Having studied at the English College in Rome, he taught at Valladolid and Seville. He succeeded William Bishop, as the second Catholic Vicar apostolic for England, Wales and Scotland.", "link_mentions": [{"page": "Richard Smith", "response": ["Richard Smith may refer to:", "* Richard Smith (silent film director) (1886–1937), American silent film director", "* Richard Smith (screenwriter), Scottish screenwriter, film director, BAFTA-winning writer of Trauma", "* Richard Smith (artist) (1931–2016), English painter", "* Richard Smith (American guitarist), jazz guitarist in California", "* Richard Smith (English guitarist) (born 1971), English-born fingerstyle guitarist in Nashville, Tennessee", "* Richard Smith (editor), British medical doctor, former editor of the British Medical Journal", "* Richard Smith (soldier) ( - 1819), Canadian soldier and magistrate", "* Richard Smith (East India Company officer) (1734–1803), Commander-in-Chief, India", "* Richard Smith (MP for Arundel), Member of Parliament (MP) for Arundel", "* Richard Smith (MP for Devizes), MP for Devizes, 1402", "* Richard Smith (died 1516), MP for Reading", "* Richard Smith (died 1581), MP for Newcastle-under-Lyme", "* Richard Smith (fl. 1584), MP for Cricklade", "* Richard Smith (Canadian politician) (1931–1978), former Liberal MPP for Nipissing, Ontario", "* Richard Smith (Continental Congress) (1735–1803), lawyer and New Jersey delegate to the Continental Congress", "* Richard Smith (diplomat) (1934–2015), Australian diplomat, Australian High Commissioner to the United Kingdom", "* Richard Smith (mining engineer) (1783–1868), English-born mining engineer and politician in Nova Scotia", "* Richard Smith (historical geographer) (born 1946), British academic, historical geographer and demographer", "* Richard Smith (rugby union, born 1973), former Wales international rugby union player", "* Richard Smith (rugby league) (born 1973), rugby league player", "* Richard Smith (footballer, born 1967), English footballer for Mansfield Town and Wolverhampton Wanderers", "* Richard Smith (footballer, born 1970), English footballer for Leicester City, Cambridge United and Grimsby Town", "* Richard Smith (wide receiver) (born 1980), American football player", "* Richard Smith (American football coach) (born 1955), former defensive coordinator for the NFL's Houston Texans", "* Richard Smith (field hockey) (born 1987), British field hockey player", "* Richard Smith (rugby union, born 1987), Cardiff Blues centre", "* Richard Smith (umpire) (born 1972), Irish cricket umpire", "* Richard Smith (Costa Rican footballer) (born 1967), former footballer with Alajuelense, Antigua and Carmelita", "* Richard Smith (sport shooter) (born 1950), American sports shooter", "* Richard Smith (Barbadian cricketer) (1873-1954), Barbadian cricketer", "* Richard Smith (Trinidadian cricketer) (born 1971), Trinidadian cricketer", "* Richard Smith (South African cricketer) (born 1972), South African cricketer", "* Richard Smith (businessman) (1836–1919) managing director of Australian company Harris Scarfe", "* Richard Smith (merchant) (1707–1776), English merchant in the West Indies trade", "* Richard Smith (settler) (1596–1666), one of earliest settlers of Rhode Island", "* Richard Smith (bishop) (1568–1655), English Catholic Bishop, titular of Chalcedon in Asia Minor"]}, {"page": "Chalcedon", "response": ["After the Great Schism, the Latin Church retained Chalcedon as a titular see with archiepiscopal rank,Annuario Pontificio 2013 (Libreria Editrice Vaticana, 2013, ), p. 855 with known incumbents since 1356. Among the titular bishops named to this see were William Bishop (1623–1624) and Richard Smith (1624–1632), who were appointed vicars apostolic for the pastoral care of Catholics in England at a time when that country had no Catholic diocesan bishops. Such appointments ceased after the Second Vatican Council and the titular see has not been assigned since 1967.Chalcedon (Titular See)"]}, {"page": "John Floyd (Jesuit)", "response": ["* Hermanni Loemelii ... Spongia quâ diluuntur Calumniæ nomine Facultatis Parisiensis impositæ libro qui inscribitur Apologia Sanctæ Sedis Apostolicæ circa Regimen Catholicorum Angliæ, St. Omer, 1631. A rejoinder was published on the part of the Sorbonne.Joseph Gillow gives a list of the principal books occasioned by Floyd's works against Richard Smith, bishop of Chalcedon, and the French clergy who supported him."]}, {"page": "Arthur Lake (bishop)", "response": ["Thomas Fuller noted that he was promoted \"not so much by the power of his brother, sir Thomas, as his own deserts, as one whose piety may be justly exemplary to all of his order\". Richard Smith, another of his contemporaries, was much impressed by his great humility, temperance, affability and contempt of riches. Smith described him as one of the ‘greatest benefactors of our times’ who ruled his household well.", "*Folger Shakespeare Library, V.a.510, Richard Smith Papers"]}, {"page": "Roman Catholic Diocese of Westminster", "response": ["*Richard Smith (1624–1632)"]}, {"page": "Apostolic Vicariate of the London District", "response": ["Bishop was succeeded in office by Richard Smith, also ordained a bishop, who arrived in England in April 1625. However, two warrants were issued for Smith's arrest in August 1631, and he was forced to resign and flee to France, where he eventually died in Paris in 1655. After 1631, there was no Roman Catholic bishop in England for another 54 years, and the void was to some extent filled by a dean and chapter of rather unsure legal status, first established by Bishop and confirmed by Smith."]}, {"page": "Apostolic Vicariate of the Midland District", "response": ["In 1623 Pope Urban VIII decided once again to appoint a bishop with jurisdiction in England. So it was that Dr William Bishop was appointed with the title of Apostolic Vicar of England. He died shortly afterwards and was succeeded by Dr Richard Smith, who in August 1631 was forced to resign and fled to France. The office then remained vacant until its revival in 1685 with the appointment of Dr John Leyburn as Apostolic Vicar."]}, {"page": "Apostolic Vicariate of the Northern District (England)", "response": ["The Vicars Apostolic were established in 1622 by the Congregation for the Propagation of Faith\"Vicariate/Diocesan Papers\", Ushaw College Library to provide a Roman Catholic Bishop with jurisdiction in England. So it was that Dr William Bishop was appointed, with the title of Vicar Apostolic of England. He died shortly afterwards and was succeeded by Dr Richard Smith, who in August 1631 was forced to resign and fled to France. The office then remained vacant until its revival in 1685 with the appointment of Dr John Leyburn as Vicar Apostolic and bishop.Lilly, William. \"England (Since the Reformation).\" The Catholic Encyclopedia Vol. 5. New York: Robert Appleton Company, 1909. 29 February 2020"]}, {"page": "Apostolic Vicariate of the Western District (England and Wales)", "response": ["In 1623, Pope Urban VIII decided once again to provide a bishop with jurisdiction in England. So it was that Dr William Bishop was appointed, with the title of Vicar Apostolic of England. He died shortly afterwards and was succeeded by Dr Richard Smith, who in August 1631 was forced to resign and fled to France. The office then remained vacant until its revival in 1685 with the appointment of Dr John Leyburn as bishop."]}, {"page": "William Bishop (bishop)", "response": ["His post was filled by Father Richard Smith."]}, {"page": "John Leyburn", "response": ["Richard Smith had served as chaplain to Viscountess Montague, wife of Anthony-Maria Browne, 2nd Viscount Montagu, at Battle Abbey in Sussex, from 1603 to 1609, when he left to go to Paris to study and write at Arras College. Smith was appointed Apostolic Vicar for the whole of England, Wales and Scotland in 1625, the same year that George Leyburn went to Arras. When Smith returned to England, he stayed in Turvey, Bedfordshire, at the house of Lord Montagu. In 1628 a warrant was issued for his arrest. He resigned his post in 1631, when he fled to Paris. After his ordination, John Leyburn was, for a time, secretary to Bishop Smith.", "Leyburn was one of the divines recommended to the authorities at Rome in 1657 as successor to Richard Smith, Titular Bishop of Chalcedon, as Vicar Apostolic of England. "]}, {"page": "Rudesind Barlow", "response": ["From 1621 to 1629 Barlow served as the President General of the English Benedictine Congregation. In 1633 he became titular Cathedral-Prior of Canterbury. Beyond a circular letter to the English Benedictines about their relations with the Vicar Apostolic of England, none of his writings survive. According to Dom Ralph Weldon, Barlow was looked on as a leading theologian and canonist; and effectively opposed Richard Smith, who claimed leadership of the English Roman Catholics, in becoming Bishop of Chalcedon. On the death of William Bishop, the first Vicar Apostolic of England, Barlow was consulted by the pope as to the best successor, and recommended Smith; but later he differed on the question of the extent of the vicar's jurisdiction."]}, {"page": "Edward Waterson", "response": ["Born in London, Waterson was brought up in the Church of England. As a young man he travelled to Turkey with some English merchants. In 1588, on his return, he stopped in Rome and was brought into the Catholic Church there by Richard Smith. The Pilgrim-book of the English College records his stay there, 29 November-11 December, 1588. Waterson proceeded to Reims, arriving there 24 January, 1589. He received the tonsure and minor orders on 18 August, 1590, subdiaconate on 21 September, 1591, diaconate on 24 February, 1592, and was ordained priest 11 March 1592.Burton, Edwin. \"Ven. Edward Waterson.\" The Catholic Encyclopedia Vol. 15. New York: Robert Appleton Company, 1912. 3 February 2019"]}, {"page": "Old Chapter", "response": ["An integral part of his scheme was the creation of a chapter consisting of twenty-four canons with  John Colleton as dean. The ecclesiastical status of the chapter has been disputed. A chapter without a diocese is an anomaly, unknown in canon law, and Rome always refrained from any positive act of recognition. On the other hand, she equally refrained from any censure, although it was known that the chapter was claiming and exercising large functions. They therefore argued that the chapter existed \"sciente et tacente sede apostolica\" (with the knowledge and silent consent of the pope) and that this was sufficient to give it a canonical status. When Dr. Bishop died they sent a list of names from which his successor might be chosen, and the Holy See accepted their action choosing the first name, Dr. Richard Smith. Three years later he had to leave the country, and spent the rest of his life in Paris. After his death the chapter assumed the right to rule the country in the vacancy of the episcopal office, and for thirty years all faculties were issued by the dean who claimed the verbal approval of Pope Alexander VII."]}, {"page": "Bishop Richard Smith", "response": ["#REDIRECT Richard Smith (bishop)"]}, {"page": "Lettice Mary Tredway", "response": ["Bishop Richard Smith, who was charged with the spiritual care of the Catholics of Great Britain, then in exile in Paris, helped them generously and may be counted a co-founder. He blessed Lady Tredway as abbess, and the Priory of Notre-Dame-de-Sion was permanently established on the Rue des Fosses in 1639. Carre and Tredway were also practically the founders of the Seminary of St. Gregory (now Downside Abbey) for training priests for the English mission. A pension for English ladies and a school were attached to the new monastery, of which Tredway held the office of abbess till 1675, when illness compelled her to resign. "]}, {"page": "William Dean (priest)", "response": ["Edward Shelley of Warminghurst, Sussex, and East Smithfield, London (son of Edward Shelley, of Warminghurst, a Master of the Household of the sovereign, and the settlor in \"Shelley's case\", and Joan, daughter of Paul Eden, of Penshurst, Kent). His grandfather was Sir John Shelley of Michelgrove near Arundel. He was apparently uncle by marriage to Benjamin Norton, afterwards one of the seven vicars of Dr. Richard Smith.Wainewright, John. \"Ven. Richard Leigh.\" The Catholic Encyclopedia. Vol. 9. New York: Robert Appleton Company, 1910. 3 Feb. 2014"]}, {"page": "Father Richard Smith", "response": ["#REDIRECT Richard Smith (bishop)"]}, {"page": "George Musket", "response": ["On 9 September 1608 he left Douay for the English mission. He resided for the most part in London. He was dexterous in managing conferences between representatives of his own co-religionists and Protestants. On 21 and 22 April 1621, he and John Percy the Jesuit held a disputation with Daniel Featley and Thomas Goad. In the reign of Charles I he was in confinement for many years. On 6 January 1627 the secretaries of state Edward Conway, 1st Viscount Conway and John Coke issued a warrant for the apprehension of him and of Richard Smith, bishop of Chalcedon. A memorandum of the period states that Musket had several years before broken out of Wisbech Castle, had since been banished, and, having returned, had again been taken prisoner."]}, {"page": "St Augustine's Priory, Ealing", "response": ["Lettice Mary Tredway, CRL, was a member of a French community of Canonesses Regular of the Lateran at the Priory of Notre-Dame-de-Beaulieu in the village of Sin-le-Noble, near Douai, in the County of Flanders, which provided nursing care to the region. She was authorized by the religious authorities, including Bishop Richard Smith, Vicar Apostolic for Great Britain, to found an English-speaking community of her Order. She founded the monastery, called Notre-Dame-de-Sion, in 1631 in Paris. Shifting from medical care, the school was opened by the community in 1634 for English pupils escaping the persecution of Catholics in their homeland. The priory remained in operation there until the canonesses were forced to flee France at the outbreak of the French Revolution, at which point they returned to England. Finding refuge in their native country, they re-established their religious community and the school under its current name."]}, {"page": "Charroux Abbey", "response": ["*Richard Smith (resigned 1648), an Englishman, Vicar Apostolic of England and titular Bishop of Chalcedon"]}, {"page": "Arras College", "response": ["Among those setting up the college, near Porte St Victoire, were Richard Smith, who had gained papal approval for it, Anthony Champney, Matthew Kellison, and Richard Ireland. William Bishop joined them shortly, after release from prison in England.DNB article on Bishop. Henry Holden was there in 1623 after his ordination;ODNB article on Holden. a few years later George Leyburn resided there before going on the English mission.DNB article on Leyburn."]}, {"page": "George Leyburn", "response": ["In 1648 Richard Smith, bishop of Chalcedon, then residing at Paris, appointed Leyburn his vicar-general in England, in conjunction with Mark Harrington, B.D., of the Sorbonne. Later Leyburn was chosen president of the English College at Douai, on the death of William Hyde, and was installed by patent dated 24 June 1652. He governed the college for about eighteen years, resigning the presidency in favour of his nephew, John Leyburn, in 1670. Subsequently, he resided at Rome for a year and a half. He died at Chalon-sur-Saône on 29 December 1677. Throughout his life he was hostile to the jurisdiction of the Old Chapter in England."]}, {"page": "Francis Gage", "response": ["Born 1 February 1621, he was son of John Gage of Haling, Surrey, by his second wife, Mrs. Barnes, a widow. He was half-brother of Sir Henry Gage, governor of Oxford, of George Gage and of Thomas Gage, missionary and traveller. He was a student in the English College, Douay from 1630 to 1641, when he went to Paris to pursue theological studies under William Clifford at Tournai College, which had been granted by Cardinal Richelieu to Richard Smith for the education of the English clergy."]}, {"page": "English College, Lisbon", "response": ["The moving force behind the foundation was the priest William Newman (1577–1640), though he never became head of the College. Newman had been entrusted with property from the estate of the late Nicholas Ashton, a Catholic chaplain in Lisbon. Initial progress was slow after a papal brief of Pope Gregory XV in 1622, with only a church erected on property given by Coutinho, who also gave endowment. Richard Smith, the Catholic bishop in England, took a hand and sent one of his archdeacons, Joseph Haynes (also Hynes, Harvey). The foundation was supported by the arrival of group of students and teachers from the English College, Douai in 1628, the first president being Haynes. Haynes, however, then died quite suddenly, shortly after the college opened in 1629."]}, {"page": "Thomas Bell (Catholic priest)", "response": ["* The Downefall of Poperie, proposed by way of challenge to all English Jesuites and … Papists, London, 1604 and 1605; reprinted and entitled The Fall of Papistrie in 1628. Robert Parsons, Richard Smith, and Francis Walsingham wrote answers to this work."]}, {"page": "English College of St Gregory", "response": ["In 1596, in Seville, Persons wrote Memorial for the Reformation of England,A Memoriall for the Reformation of England conteyning certayne notes and advertisements which seeme might be proposed in the first parliament and nationall councell of our country after God of his mercie shall restore it to the catholique faith [...]; gathered and set downe by R. P., 1596.  concerning how England might be returned to the Roman Catholic faith. Teaching staff included Richard Smith who developed different ideas from Persons about the project. Partly through the influence of Cardinal Richelieu, Smith was to return to England as a Roman Catholic bishop.Bergin, J.  Smith, Richard (1567–1655), vicar apostolic of the English church. Oxford Dictionary of National Biography. Retrieved 10 Dec. 2021"]}, {"page": "Eileen M. Schuller", "response": ["After completing her undergraduate studies, she worked as a lecturer at Newman Theological College and St. Joseph's College in Edmonton from 1973-1977. At the Atlantic School of Theology in Halifax, she began as an assistant professor from 1982 to 1986 and then taught as an associate professor from 1986 to 1989. Lasha Morningstar notes that Archbishop Richard Smith was one of her students. After earning her Doctorate, she went on to teaching at McMaster University in 1990. For two years she taught as a tenure-track stream professor and from 1992 to 1996 she taught as a tenured, associate professor. Currently, she continues to teach as a tenured Professor (since 1996) and holds a Senator William McMaster Chair in the Department of Religious studies."]}, {"page": "Apostolic Vicariate of England", "response": ["Bishop was succeeded in office by Richard Smith, also ordained a bishop, who arrived in England in April 1625. However, two warrants were issued for Smith's arrest in August 1631, and he was forced to resign and flee to France, where he eventually died in Paris in 1655. After 1631, there was no Roman Catholic bishop in England for another 54 years, and the void was to some extent filled by a dean and chapter of rather unsure legal status, first established by Bishop and confirmed by Smith.", "|align=center|1624 ||align=center|1632 ||Richard Smith, Titular Bishop of Chalcedon ||Appointed vicar apostolic on 29 November 1624 and consecrated titular bishop on 12 June 1625. Resigned in 1632 and died on 18 March 1655."]}]}}