{"wiki_id": "http://www.wikidata.org/entity/Q732480", "itemLabel": "Paul Gardiner", "itemDescription": "musician (1958-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Gardiner", "wikipedia_page": {"main": "Paul Andrew Gardiner (1 May 1958 – 18 February 1984) was a British musician who played bass guitar with Gary Numan and Tubeway Army, as well as creating material under his own name.", "link_mentions": [{"page": "Gary Numan", "response": ["When Numan was 15 years old, his father bought him a Gibson Les Paul, which became his most treasured possession. He briefly played in various bands  and looked through ads in Melody Maker for bands to join. He claims to have unsuccessfully auditioned as guitarist for the then-unknown band the JamGary Numan (R)evolution: The Autobiography, Constable 2020, Chapter Three before joining Mean Street and the Lasers where he met Paul Gardiner. The latter band eventually morphed into Tubeway Army with his uncle Jess Lidyard on drums and Gardiner on bass and were signed to Beggars Banquet Records. His initial pseudonym was \"Valerian\", probably in reference to the hero in French science fiction comic series Valérian and Laureline.Steve Malins (1999). The Plan 1999 reissue liner notes He later picked the surname \"Numan\" from an advertisement in the Yellow pages for a plumber whose surname was \"Neumann\".", "With his former backing band, Chris Payne (keyboards; viola), Russell Bell (guitar), and Ced Sharpley (drums) now reformed as Dramatis, Numan contributed vocals to the minor hit \"Love Needs No Disguise\" from the album For Future Reference and lent vocals to the first single released by his long-term bassist Paul Gardiner, \"Stormtrooper in Drag\", which also made the charts. However, Numan's career had begun to experience a gradual decline, and he was eclipsed commercially by former support act Orchestral Manoeuvres in the Dark, as well as by the Human League, Duran Duran, and Depeche Mode. Each album also saw a new \"image\", none of which captured the public's imagination to nearly the same extent as the lonely android of 1979."]}, {"page": "Northolt", "response": ["* Paul Gardiner (1958–1984), musician, bass guitar player in Gary Numan's Tubeway Army, died in Northolt."]}, {"page": "Hayes, Hillingdon", "response": ["* Musician Paul Gardiner (1958–1984) of Gary Numan's Tubeway Army was born in Hayes."]}, {"page": "Tubeway Army", "response": ["Aged 18 years, Gary Webb had fronted London band Mean Street in 1976 (their song \"Bunch of Stiffs\" appeared on the Live at the Vortex compilation, and was the B-side of the Vortex 7\").  After leaving this band, he auditioned as lead guitarist for another band called The Lasers, where he met bass-player Paul Gardiner. The Lasers soon became Tubeway Army, and were eventually reformed with Webb's uncle Jess Lidyard on drums.Gary Numan (R)evolution: The Autobiography Constable 2020, Chapter Four Webb rechristened himself \"Valerian\", Gardiner \"Scarlett\" and Lidyard \"Rael\".", "The next single, \"Are 'Friends' Electric?\" was very successful, reaching the No. 1 spot. By the end of 1979 it had become the fourth highest selling single in the UK that year. The underlying context of this song was also a reference to another Philip K. Dick novel, Do Androids Dream of Electric Sheep? A special picture-disc helped boost sales but what particularly grabbed the British public's imagination was Tubeway Army's appearance on the BBC show The Old Grey Whistle Test, followed soon after by a slot on Top of the Pops on 24 May 1979. The band, now including Ultravox keyboardist Billy Currie, Chris Payne, Paul Gardiner and drummer Cedric Sharpley, appeared all dressed in black and near-motionless, Numan in particular giving a performance often referred to as being \"like an android\" (a style that was later reported to have been a means of covering stage nerves but which then became his trademark). The single remained at number one in the UK charts for four weeks, with Replicas following suit in the album charts. With Tubeway Army still avoiding live shows, Numan recruited some additional musicians to make these television appearances (see above).", "* Paul Gardiner (a.k.a. \"Scarlett\") – bass, backing vocals (1977–1979; died 1984)", "* Paul Gardiner – bass, backing vocals", "* Paul Gardiner – bass, backing vocals", "* Paul Gardiner – bass, backing vocals", "* Paul Gardiner – bass, backing vocals", "* Paul Gardiner – bass, backing vocals"]}, {"page": "Cars (song)", "response": ["* Paul Gardiner – bass guitar"]}, {"page": "Down in the Park", "response": ["* Paul Gardiner - Bass guitar"]}, {"page": "Are \"Friends\" Electric?", "response": ["* Paul Gardiner – bass guitar"]}, {"page": "Dance (Gary Numan album)", "response": ["* Paul Gardiner - bass, guitar, ARP Odyssey"]}, {"page": "Replicas (album)", "response": ["*Paul Gardiner – bass guitar"]}, {"page": "List of bass guitarists", "response": ["* Paul Gardiner (Tubeway Army, Gary Numan)"]}, {"page": "Continental (album)", "response": ["It is a compilation that includes previously released material such as the UK hit \"He's on the Phone\" as well as curios like their cover of the Paul Gardiner/Gary Numan song \"Stormtrooper in Drag\". Many of the tracks were recorded during the 'wilderness' years of 1996/97 when the band members worked on their separate projects. The remix versions on this album had all appeared on Casino Classics."]}, {"page": "The Pleasure Principle (album)", "response": ["* Paul Gardiner – bass"]}, {"page": "Telekon", "response": ["* Paul Gardiner – bass, backing vocals"]}, {"page": "We Are Glass", "response": ["* Paul Gardiner: Bass guitar"]}, {"page": "I Die: You Die", "response": ["** Paul Gardiner: Bass guitar"]}, {"page": "Tubeway Army (album)", "response": ["*Paul Gardiner – bass guitar, backing vocals"]}, {"page": "She's Got Claws", "response": ["An obscure single in July 1981 called \"Stormtrooper in Drag\", released under the name of his friend and bass-player Paul Gardiner but co-written and sung by Numan, provided a foretaste of the latter’s new sound, far removed from the science fiction influenced synthpop that had made him a star. Aside from being a departure from previous material, \"She's Got Claws\" was unusual among Numan’s jazz-style output in utilising the sax as lead instrument rather than simply for a discreet solo; it was played by Mick Karn from Japan, who also contributed bass on the track. Numan was a great fan of Japan's 1980 album Gentlemen Take Polaroids,Gary Numan - Dance (CD liner notes) (2002) and this influenced him to adopt this new musical style."]}, {"page": "Bombers (Tubeway Army song)", "response": ["** Paul Gardiner: Bass guitar", "*The original demo version, recorded 7–9 March 1978 at Spaceward Studios, near Cambridge. This recording was not released to the public until October 1984, on an album of previously unissued tracks from the same sessions called The Plan. These sessions featured Gary Numan, Paul Gardiner, and Numan's uncle Jess Lidyard on drums."]}, {"page": "That's Too Bad", "response": ["At this stage of his career, Numan (born Gary Webb) had not yet found his future stage name and called himself 'Valerian'; his band mates Paul Gardiner ('Scarlett') and Jess Lidyard ('Rael') also used assumed names. Webb's compositional credits on the original vinyl single were under the Valerian pseudonym as well. The back of the original vinyl single's sleeve contained two discrepancies: Valerian was spelt 'Valeriun'; and the band picture featured live drummer Bob Simmonds, not Jess Lidyard who actually played in the recording session.Steve Malins (1998). The Plan: CD liner notes ", "* Scarlett (Paul Gardiner) – bass guitar"]}, {"page": "Stormtrooper in Drag", "response": ["\"Stormtrooper in Drag\" is the debut single by Paul Gardiner, who was the bass player in Gary Numan's backing band (and in Numan's first band, Tubeway Army). Numan is featured on the single as a co-composer, producer, musician and vocalist.", "Though the single was released under Gardiner's name alone in 1981, it is often credited as Paul Gardiner featuring Gary Numan, and appears on a number of Numan's compilation albums. Numan not only played on and produced the recording but also co-composed and sang lead vocals. It was published by Numan Music and released by Numan's then-current label, Beggars Banquet.", "# \"Stormtrooper in Drag\" (Paul Gardiner, Gary Numan) – 4:48", "** Paul Gardiner: Guitar, Keyboards (ARP Odyssey), Backing vocals"]}, {"page": "Paul Gardner", "response": ["*Paul Gardiner (1958–1984), British musician"]}, {"page": "Clues (Robert Palmer album)", "response": ["*Paul Gardiner – bass guitar (track 5)"]}, {"page": "Berserker (Gary Numan album)", "response": ["The poignant track \"A Child with the Ghost\" was Numan's tribute to his friend and former bassist Paul Gardiner, who died in February 1984 from a heroin overdose. The track was also covered by the duo Tik and Tok on their Intolerance album (which featured Numan) the same year. The industrial undertones of the Berserker album would be more fully explored on Numan's next album, The Fury (1985)."]}, {"page": "Warriors (Gary Numan album)", "response": ["Warriors was supported by a 40-date UK tour from September to October 1983 (with support from robotic mime and music duo Tik and Tok). These were Numan's first live dates in the UK since his Wembley farewell concerts in 1981. Numan's friend and former bassist, Paul Gardiner, made an onstage appearance during a \"Warriors\" show at the Hammersmith Odeon, London. To date, no live albums or videos from the 1983 tour have been officially released, although the BBC did record the final night at the Hammersmith Odeon, and the 20 October show in Glasgow is believed to have been professionally filmed. Bootleg-quality audio from that Glasgow show has surfaced on YouTube, along with more professional-quality audio from the tour's 10 June 1983 Leicester date."]}, {"page": "Living Ornaments '79", "response": ["*Paul Gardiner – bass"]}, {"page": "Living Ornaments '80", "response": ["*Paul Gardiner – bass"]}, {"page": "New Man Numan: The Best of Gary Numan", "response": ["# \"Stormtrooper in Drag\" by Paul Gardiner featuring Gary Numan", "All songs written by Gary Numan except \"Love Needs No Disguise\" (Cedric Sharpley, Chris Payne, Denis Haines, Rrussell Bell) and \"Stormtrooper In Drag\" (Paul Gardiner)"]}]}}