{"wiki_id": "http://www.wikidata.org/entity/Q7323973", "itemLabel": "Richard Barrett", "itemDescription": "British diplomat and intelligence officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Barrett_(counter-terrorism_expert)", "wikipedia_page": {"main": "Richard Martin Donne Barrett CMG OBE (born 14 June 1949) is a former British diplomat and intelligence officer now involved in countering violent extremism. Barrett is a recognised global expert on terrorism who frequently appears as a panellist in related conferences and whose commentary is regularly featured in the press.", "link_mentions": [{"page": "Special Air Service", "response": ["Members of the Special Air Service were deployed to Northern Iraq in late August 2014, and according to former MI6 chief Richard Barrett, would also be sent to Syria, tasked with trying to track down the Islamic State of Iraq and the Levant (ISIL) terrorist group that the press labelled the Beatles."]}, {"page": "Richard Barrett", "response": ["Richard Barrett may refer to:", "* Richard Barrett (bishop) (died 1645), Irish bishop", "* Richard Barrett (FRS) (fl. 1713), a Fellow of the Royal Society of London", "* Riocard Bairéad (Richard Barrett) (1740–1819), poet and schoolmaster from County Mayo, Ireland ", "* Richard Barrett (abolitionist) (fl. 1840); see World Anti-Slavery Convention", "* Richard Barrett (Irish republican) (1889–1922), executed during Irish Civil War", "* Richard Barrett (Medal of Honor) (1838–1898), American soldier and Indian Campaigns Medal of Honor recipient", "* Richard Barrett (lawyer) (1943–2010), American lawyer and white nationalist", "* Richard Barrett (author) (born 1945), British author", "* Richard Barrett (counter-terrorism expert) (born 1949), coordinator of the United Nations 1267 Monitoring Team", "* Richard Barrett (composer) (born 1959), Welsh composer", "* Richard Barrett (fl. 1987), playwright; see Griffin Theatre Company", "* Richard Barrett, a character in the 1960s British television series The Champions", "* Richard Barrett House, on the National Register of Historic Places listings in Summit County, Utah"]}, {"page": "Afghan Peace Jirga 2010", "response": ["In July 2010, Richard Barrett, since March 2004 the coordinator of the monitoring team of the so-called 1267 Committee on al-Qaida and the Taliban, said that removing former Taliban members from the sanction list was a key issue for both the Afghan government and the Taliban. There was a list of 10 candidates to be removed.\"UN to cautiously review Afghan delisting request: official\""]}, {"page": "2011 in Afghanistan", "response": ["* Richard Barrett, coordinator of the Al Qaeda and Taliban UN Security Council Sanctions Committee's monitoring team, said that he expected more than 138 Taliban names would be presented to the Security Council on June 16 for a decision on whether they should be removed from the blacklist. Proponents of lifting the sanctions — a major demand of the Taliban for peace talks — say it would boost prospects for reconciliation. Those who are on the list are barred from traveling outside the country, and their bank accounts are supposed to be frozen."]}, {"page": "Global Center on Cooperative Security", "response": ["The Global Center's staff include a number of scholars and practitioners with expertise in multilateral security policy.Global Center on Cooperative Security, Staff, http://www.globalcenter.org/experts/staff/ Richard Barrett, a Senior Fellow for the Global Center (UK), is the Director of The Global Strategy Network, a former British diplomat and intelligence officer who led the UN monitoring team concerning al-Qaida and the Taliban, and Director of Global Counter Terrorism Operations in the United Kingdom. Peter Romaniuk, a Senior Non-resident Fellow at the Global Center, is an Associate Professor of Political Science at the John Jay College of Criminal Justice.John Jay College of Criminal Justice, Faculty, https://www.jjay.cuny.edu/faculty/peter-romaniuk", "*Richard Barrett CMG OBE, Director of The Global Strategy Network"]}, {"page": "Murder of Lee Rigby", "response": ["On 25 November 2014, the findings of a British parliamentary inquiry into Rigby's murder was published. The report found that his death could not have been prevented, although his killers had appeared in seven intelligence investigations.\"Report on the Intelligence Relating to the Murder of Fusilier Lee Rigby \" Intelligence and Security Committee, 25 November 2014. In December 2012, Michael Adebowale had discussed killing a soldier on Facebook with a foreign-based extremist known as \"Foxtrot\". The UK authorities did not have access to the details of the conversation until June 2013, when they were disclosed to GCHQ. The Intelligence and Security Committee stated \"Had MI5 had access to this exchange, their investigation into Adebowale would have become a top priority.\" Facebook said that it did not comment on individual cases, but responded that \"Facebook’s policies are clear, we do not allow terrorist content on the site and take steps to prevent people from using our service for these purposes.\" In an interview with BBC News on 26 November 2014, Richard Barrett, the former Director of Global Counter-terrorism at MI6, said that it was unfair to expect companies to monitor websites for all potentially extremist content. Facebook had blocked seven of Adebowale's accounts prior to the killing, five of which had been flagged for links with extremism. The accounts had been flagged by an automated process, and no person at Facebook had manually checked the accounts."]}, {"page": "International Centre for Counter-Terrorism", "response": ["* Mr. Richard Barrett CMG OBE is a Senior VP at the Soufan Group, and  former UK overseas counter-terrorism chief and coordinator of the UN 1267 Monitoring Team."]}, {"page": "United Kingdom and the Islamic State", "response": ["William Hague, then Foreign Secretary, estimated in June 2014 that 400 British citizens were fighting in Syria, some for ISIL. Khalid Mahmood, a Labour MP, estimated that there were at least 1,500 Britons in ISIL. A more accurate source from the BBC estimates around 850 people from the UK had traveled to Iraq and Syria to support or fight for jihadist groups. Former MI6 counter-terrorism head Richard Barrett raised concerns about the potentially large number of radicalised fighters that had returned to Britain from Syria and Iraq."]}, {"page": "The Beatles (terrorist cell)", "response": ["A significant force of the British Special Air Service was deployed to Northern Iraq in late August 2014, and according to former MI6 chief Richard Barrett would be sent to Syria, tasked with trying to track down the Beatles using a range of high-tech equipment and with potentially freeing other hostages.  As of September 2014, British intelligence and security agencies, including MI5 and Scotland Yard, aided by GCHQ communication monitoring, were working with the FBI and CIA, and field teams from MI6 and the CIA in Northern Syria, to identify and locate the group. British and US electronic eavesdropping agencies have targeted communications by the group."]}, {"page": "Alex Younger", "response": ["On 16 February 2019, when interviewed by the British press, Younger was asked about the wives of British ISIS fighters stuck in Syria after the fall of the caliphate. He acknowledged their plight, but warned that such people would have acquired skills and connections that made them dangerous to the public. Home Secretary Sajid Javid later chose to strip Shamima Begum, who had married an ISIS fighter, of her British citizenship, leaving the future of her and her son unclear. Richard Barrett, who is a former director of global counter-terrorism at MI6, told the press that Begum should be given a chance to rebuild her life with her son. He also suggested it would be unreasonable to expect the Syrian Defence Force to look after her indefinitely. Barrett stated that British society should be strong enough to reabsorb her. He said the immediate reaction of the British government \"has been a complete lack of concern for her plight\"."]}, {"page": "Fatima Akilu", "response": ["Fatima Akilu is a Nigerian Muslim psychologist, author, educator, former government official, education advocate and public speaker in the areas of preventing and countering violent extremism (CVE) and counter-terrorism. She is currently the executive director of the Neem Foundation and the former director of Behavioural Analysis and Strategic Communication at the office of the National Security Advisor in Nigeria, where she helped develop the country's first Countering Violent Extremism Programme. Akilu is a part of the Global Strategy Network team with industry expert Richard Barrett and other individuals."]}]}}