{"wiki_id": "http://www.wikidata.org/entity/Q7327920", "itemLabel": "Richard Moss", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Moss", "wikipedia_page": {"main": "Richard Moss (1823 – 2 March 1905) was an English brewer and Conservative politician who sat in the House of Commons in two periods between 1880 and 1892.\nMoss was the son of Richard Moss of the City of London. He was educated privately and was involved in brewing interests in London before becoming a brewer in Winchester. He was secretary and later chairman of the County Brewers' Society and took part in the amendment of the licensing laws in 1869 and 1872. He was one time master of the Worshipful Company of Scriveners.At the 1880 general election Moss was elected Member of Parliament for Winchester. He held the seat until 1885. He regained the seat in a by-election in 1888 and held it until 1892.Moss died at the age of 81.\nMoss married Mary Jeffreys Snow, daughter of John Wright Snow of London in 1858.", "link_mentions": [{"page": "Winchester (UK Parliament constituency)", "response": ["| Richard Moss", "|Richard Moss"]}, {"page": "Crash Zone", "response": ["* Nigel Hartford (Richard Moss) - He is Alexandra's assistant. "]}, {"page": "Richard Moss (MP)", "response": ["#REDIRECT Richard Moss"]}, {"page": "ToryBoy The Movie", "response": ["According to Richard Moss, the BBC's North East & Cumbria Political editor, \"some silliness aside, it is a thought-provoking insight into the way our political system works or doesn't work on the ground... But I'm not sure he quite nails down a case against Stuart Bell.. And John Walsh doesn't help his case with some of the content in the film.\" Liberal Democrat commentator Mark Pack wrote on his blog that \"John Walsh portrays life on the campaign trail as it really is. It is a hugely enjoyable documentary, which mixes humour, drama and education\". Samuel Scott from review site DVD Compare gave it a B- and wrote \"I found this documentary very intriguing and very honest. John is a very likable character, and I wouldn't hesitate in voting for someone with so much passion for a second.\"DVD Compare 14 April 2015 Doc Geeks commented that the film was \"a blunt exposé combined with a tinge of lightheartedness. Satirical animation cleverly frames Britain in its political context\".Doc Geeks November 14th, 2011 On his blog, novelist Christopher Fowler wrote that ToryBoy The Movie was \"a snapshot of our country’s political apathy in microcosm. It’s heartbreaking to see people blindly supporting their own demise as if they’re playing some kind of long game they’ll probably never live to see the outcome of. Oh, and it’s also very funny.\"", "Although not explicitly inspired by the film, Neil Macfarlane, in a report for local newspaper Teesside Gazette, asked \"Are Teessiders getting enough from Sir Stuart Bell?\" when he failed to answer over 100 telephone calls made to his constituency office. The Gazette story was picked up by national newspapers. The Independent asked \"is Sir Stuart Bell Britain's laziest MP?\"Jonathan Brown No surgeries for 14 years - is Sir Stuart Bell Britain's laziest MP?, Independent, 7 September 2011Richard Moss Middlesbrough MP Sir Stuart Bell fights laziest MP tag, BBC, 9 September 2011 The Guardian fact-checked the \"laziest MP\" claim and found it false, reporting that the laziest MP was Roger Godsiff and that Bell was an active parliamentarian but did not always maintain an office in his constituency: \"Bell has been an MP for nearly 30 years and has had a distinguished career in parliament as a frontbench spokesman on trade and industry in opposition and the spokesman for the Church of England in the House of Commons and member of the House of Commons commission until last year. He's part of a breed of politicians – also including the Tory Edward Leigh and Labour's Gerald Kaufman – who have been extremely active parliamentarians but not always maintained an office in their constituency. One measure of their parliamentary work is the proportion of votes they turn up to.\" (Bell had stopped holding surgeries after an assault in 1997.) The Labour Party said it would be totally unacceptable if constituents had been unable to contact their MP."]}, {"page": "Moss, Richard", "response": ["#redirectRichard Moss"]}, {"page": "Fourth National Climate Assessment", "response": ["While the CSSR is \"designed to be an authoritative assessment of the science of climate change\" in the United States, it does not include policy recommendations. On August 20, 2017, the Trump administration notified the 15-person Federal Advisory Committee for the Sustained National Climate AssessmentThe 15-person Federal Advisory Committee for the Sustained National Climate Assessment included \"academics as well as local officials and corporate representatives.\" Ben Friedman, NOAA's acting administrator \"informed the committee’s chair that the agency would not renew the panel\" on August 18, 2017. that he was dissolving the Federal Advisory Committee. The Federal Advisory Panel translating the NCA's scientific studies and findings into actionable public policy that individual states could implement to reduce emissions. According to an August 20, 2017 article in the Washington Post, the role of the Federal Advisory Panel for the National Climate Assessment was to assist \"policymakers and private-sector officials incorporate the government’s climate analysis into long-term planning\". The panel was tasked with translating dozens of studies and scientific revelations that constitute the National Climate Assessment into policy actions that states could use to reduce greenhouse gas emissions. In January 2018 Andrew Cuomo, Governor of the State of New York, part of a coalition of States, reconvened a modified and limited version of the science advisory panel chaired by Columbia University's Earth Institute's Richard Moss. The States' panel cannot \"replace federal support for science, including maintaining satellites and building better climate models\" nor will it have any \"sway over federal climate policy\"."]}]}}