{"wiki_id": "http://www.wikidata.org/entity/Q7329160", "itemLabel": "Richard Southern", "itemDescription": "British scenic designer (1903-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Southern_(theatre_designer)", "wikipedia_page": {"main": "Richard Southern (October 5, 1903 – August 1, 1989) was a British theatre designer and lecturer, best known for his extensive pictorial documentation of historical theatre construction, the Richard Southern Print Collection, comprising some 22,500 visual images. A prolific stage designer and theatre restorer, Southern devoted decades to researching and documenting theatre construction.", "link_mentions": [{"page": "University of Southampton", "response": ["The university's main Highfield campus is home to three main arts venues supported and funded by the university and Arts Council England. The Nuffield Theatre opened in 1963 with construction funded by a grant from the Nuffield Foundation of £130,000 (£2,450,000 in 2013). The building was designed by Sir Basil Spence as part of his campus masterplan with additional direction provided by Sir Richard Southern. The theatre consists of a 480-seat auditorium, that also served as the principal lecture theatre at the time of construction, as well as additional lecture theatres and adjacent Kitchen bar. The theatre went into administration in May 2020 and permanent closure was announced in July 2020."]}, {"page": "R. W. Southern", "response": ["*Palmer, William. \"Sir Richard Southern Looks Back: A Portrait of the Medievalist as a Young Man\", Virginia Quarterly Review, Winter 1998."]}, {"page": "ArenaPAL", "response": ["**Richard Southern Collection,"]}, {"page": "Southern (surname)", "response": ["* Richard Southern (theatre designer) (1903–1989), British theatre designer "]}, {"page": "University of Bristol Theatre Collection", "response": ["Including: Dr Kathleen Barker (1925–1991), Richard Digby Day (b. 1941), George Rowell (d. 2001), Richard Southern (1903–1989) and Glynne Wickham (1922–2004)"]}, {"page": "London Theatre Studio", "response": ["The school's design course was taught by Sophie Harris, Margaret Harris, and  Elizabeth Montgomery, who were collectively a unit known as Motley, and Richard Southern taught stage scenery design and its history. This was the first theatrical design course at an English drama school.Theatre Design & Technology, Volume 30 (Spring, 1994), p. 13", "*Richard Southern (1903–1989), stage scenery"]}]}}