{"wiki_id": "http://www.wikidata.org/entity/Q7326339", "itemLabel": "Richard Hayes", "itemDescription": "Irish politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hayes_(politician)", "wikipedia_page": {"main": "Richard Francis Hayes (1878–1958) was an Irish politician, historian and medical doctor. He was a volunteer and fought in the Easter Rising in 1916 and was involved in the Garristown and Ashbourne fighting. He was elected as a Sinn Féin MP for Limerick East at the 1918 general election. In January 1919, Sinn Féin MPs who had been elected in the Westminster elections of 1918 refused to attend the British House of Commons and instead assembled in the Mansion House, Dublin as a revolutionary parliament called Dáil Éireann. Hayes could not attend as he was imprisoned by the British authorities at the time.During the War of Independence he was interned in the Curragh Camp. He was elected at the 1921 elections as a Sinn Féin Teachta Dála (TD) for Limerick City–Limerick East and was released after the truce.  He supported the Anglo-Irish Treaty and voted in favour of it. He was re-elected at the 1922 general election as a pro-Treaty Sinn Féin TD and subsequently as a Cumann na nGaedheal TD at the 1923 general election.He resigned from the Dáil in January 1924 and retired from politics. He later became Irish Film Censor (1941–54) and Director of the Abbey Theatre. As a historian, he was a leading authority on Irish connections with France from the seventeenth to nineteenth centuries. He authored several major historical studies, including The Last Invasion of Ireland: When Connacht Rose (1st ed. 1937), which has been reappraised by Guy Beiner as a groundbreaking book for its use of oral traditions alongside more conventional archival sources. Other titles include Ireland and Irishmen in the French Revolution (1932), Irish Swordsmen of France (1934), Old Irish Links with France (1940), and Biographical Dictionary of Irishmen in France (1949), alongside numerous articles. For his work on the Irish military in France he received the Légion d'honneur.\nHe was a hard-working and much-loved doctor, and apparently a very good one.  Frank O'Connor records that he deduced, correctly, that their mutual friend George William Russell had terminal cancer  simply because Russell (who had moved to England)   in a letter to O'Connor complained of what he believed to be colitis. When O'Connor  showed Hayes  the letter he read it quickly and  said  \"I am sorry but that is cancer, not colitis.\"\nFor several years he was the closest friend of Frank O'Connor, who acknowledged the extraordinary help Hayes gave him in researching  The Big Fellow, his biography of Michael Collins. After some years, however, the friendship cooled, and the portrait of Hayes in O'Connor's memoir My Father's Son, is surprisingly unflattering, given their earlier closeness.\nHe is buried in Deansgrange Cemetery.", "link_mentions": [{"page": "1958 in Ireland", "response": ["*1 January – Richard Hayes, doctor and Sinn Féin MP (born 1878)"]}, {"page": "East Limerick (UK Parliament constituency)", "response": ["| Richard Hayes"]}, {"page": "List of Sinn Féin MPs", "response": ["| Richard Hayes"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Richard Hayes"]}, {"page": "Hayes (surname)", "response": ["| Richard Hayes (politician) || before 1918 || 1958 || IrishNational politician", "*Richard Hayes (professor) (born 1945), academic in the areas of Buddhist philosophy and Sanskrit", "*Richard Hayes (disambiguation)"]}, {"page": "Limerick (Dáil constituency)", "response": ["Following the resignation of Cumann na nGaedheal TD Richard Hayes, a by-election was held on 28 May 1924. The seat was won by the Cumann na nGaedheal candidate Richard O'Connell."]}, {"page": "The Big Fellow", "response": ["The Big Fellow covers the period of Collins's life from the Easter Rising in 1916 to his death during the Irish Civil War in 1922.  Unlike most conventional biographies of famous leaders, O'Connor establishes a clear goal in portraying Collins's character and human qualities above his major achievements. Through his friendship with Richard Hayes, O'Connor was able to meet and interview many people who had known Collins; in particular he received invaluable information from Collins' secretary, Joe O'Reilly."]}, {"page": "Anglo-Irish Treaty Dáil vote", "response": ["|Richard Hayes"]}, {"page": "Richard Hayes", "response": ["Richard Hayes may refer to:", "*Richard Hayes (professor) (born 1945), professor of Buddhist philosophy", "*Richard Hayes (politician) (1878–1958), Irish politician, historian, film censor and medical doctor", "*Richard Hayes (biotech policy advocate), Visiting Scholar, University of California at Berkeley College of Natural Resources / Energy and Resources Group", "*Richard Hayes (singer) (1930–2014), singer best known for his version of The Old Master Painter", "*Richard Hayes (pilot), New Zealand helicopter pilot", "*Richard Hayes (general), U.S. Army general", "*Richard Hayes (priest) (died 1938), Dean of Derry"]}, {"page": "James Bartholomew Blackwell", "response": ["According to the Irish historian Richard Hayes (politician), \"Before the outbreak of the Revolution, Blackwell had associated himself with the reform party, becoming an intimate friend of Georges Danton, Camille Desmoulins and the other leading spirits of the clubs who helped to precipitate the insurrection of the fourteenth of July 1789.\"Hayes, Richard, Ireland and Irishmen in the French Revolution (Dublin, 1932), p. 29."]}, {"page": "Richard Hayes (Irish politician)", "response": ["#REDIRECT Richard Hayes (politician)"]}, {"page": "Dick Hayes TD", "response": ["#redirectRichard Hayes (politician)"]}, {"page": "Dick Hayes", "response": ["#REDIRECT Richard Hayes (politician)"]}, {"page": "Her Sister's Secret", "response": ["In 1947, the film was banned in Ireland by Richard Hayes for featuring an unwed mother, a decision which was eventually reversed by the Appeal Board. This reversal was described by Irish film historian Kevin Rockett as \"an indication of the slightly more flexible approached being adopted in the post-war years by the Appeal Board.\""]}, {"page": "Liam Ó Rinn", "response": ["* Hygiene by Richard Hayes"]}, {"page": "List of members of the Oireachtas imprisoned during the Irish revolutionary period", "response": ["| Richard Hayes"]}]}}