{"wiki_id": "http://www.wikidata.org/entity/Q7324287", "itemLabel": "Richard Bowring", "itemDescription": "British Japanologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Bowring", "wikipedia_page": {"main": "Richard John Bowring (born 6 February 1947) is an English academic serving as Professor of Japanese Studies at the University of Cambridge and an Honorary Fellow of Downing College. In 2013, Bowring was awarded the Order of the Rising Sun 3rd Class, Gold Rays with Neck Ribbon for contributions to the development of Japanese studies, Japanese language education and the promotion of mutual understanding between Japan and the United Kingdom.After a long academic career, Bowring was elected as Master of Selwyn College, Cambridge. During his time in office (2000–2012), Bowring oversaw major expansion of Selwyn College, Cambridge, including the construction of Anne's court and two new Victorian stone and brick buildings on the main college site.", "link_mentions": [{"page": "Nagasaki", "response": ["Consensus among historians was once that Nagasaki was Japan's only window on the world during its time as a closed country in the Tokugawa era. However, nowadays it is generally accepted that this was not the case, since Japan interacted and traded with the Ryūkyū Kingdom, Korea and Russia through Satsuma, Tsushima and Matsumae respectively. Nevertheless, Nagasaki was depicted in contemporary art and literature as a cosmopolitan port brimming with exotic curiosities from the Western World.Cambridge Encyclopedia of Japan, Richard Bowring and Haruko Laurie"]}, {"page": "Murasaki Shikibu", "response": ["In 996 when her father was posted to a four-year governorship in Echizen Province, Murasaki went with him, although it was uncommon for a noblewoman of the period to travel such a distance that could take as long as five days.Mulhern (1991), 83–85 She returned to Kyoto, probably in 998, to marry her father's friend Fujiwara no Nobutaka (), a much older second cousin. Descended from the same branch of the Fujiwara clan, he was a court functionary and bureaucrat at the Ministry of Ceremonials, with a reputation for dressing extravagantly and as a talented dancer. In his late forties at the time of their marriage, he had multiple households with an unknown number of wives and offspring. Gregarious and well-known at court, he was involved in numerous romantic relationships that may have continued after his marriage to Murasaki. As was customary, she would have remained in her father's household where her husband would have visited her. Nobutaka had been granted more than one governorship, and by the time of his marriage to Murasaki he was probably quite wealthy. Accounts of their marriage vary: Richard Bowring writes that the marriage was happy, but Japanese literature scholar Haruo Shirane sees indications in her poems that she resented her husband."]}, {"page": "The Tale of Genji", "response": ["The debate over how much of Genji was actually written by Murasaki Shikibu has gone on for centuries and is unlikely to ever be settled unless some major archival discovery is made. It is generally accepted that the tale was finished in its present form by 1021, when the author of the Sarashina Nikki wrote a diary entry about her joy at acquiring a complete copy of the tale. She writes that there are over 50 chapters and mentions a character introduced at the end of the work, so if other authors besides Murasaki Shikibu did work on the tale, the work was finished very near to the time of her writing. Murasaki Shikibu's own diary includes a reference to the tale, and indeed the application to herself of the name 'Murasaki' in an allusion to the main female character. That entry confirms that some if not all of the diary was available in 1008 when internal evidence suggests convincingly that the entry was written.The Diary of Lady Murasaki, ed. Richard Bowring, Penguin Classics 2005, p. 31, note 41. In his introduction to the text, Bowring discusses its dating which, in any case, is generally accepted by most authorities. Royall Tyler, in his edition of the Tale of Genji cited below, also draws attention to the entry in Murasaki Shikibu's diary: see the Penguin Books edition, 2003, Introduction, p. xvii"]}, {"page": "Hōnen", "response": ["Richard Bowring condenses these charges into two general forms. First is the nature of a single practice. Hōnen's emphasis on the single practice of nembutsu denied the usefulness of all other Buddhist practices. The sole emphasis on Amitābha was also coupled with discouraging the traditional worship of the kami. The second charge was that Hōnen placed the most lowly layperson on equal footing with the wisest monk, rendering the entire monastic establishment as useless.Bowring, Richard.  Religious Traditions of Japan: 500-1600. Cambridge: Cambridge University Press, 2005.  247."]}, {"page": "Donald Keene", "response": ["Keene studied for a year at Harvard University before transferring to Cambridge University as a Henry Fellow, where he earned a second master's and became a Fellow of Corpus Christi College, Cambridge from 1948 to 1954, and a University Lecturer from 1949 to 1955.Donald Keene, 'Reminiscences of Cambridge', in Richard Bowring (ed.), Fifty years of Japanese at Cambridge, 1948–98: A Chronicle with Reminiscences (Cambridge: Faculty of Oriental Studies, University of Cambridge, 1998), pp.16-7. In the interim, in 1953,Donald Keene.  \"Donald Keene reflects on 70-year Japan experience\" Japan Times. January 1, 2015 he also studied at Kyoto University, and earned a PhD from Columbia in 1949. Keene credits Ryūsaku Tsunoda as a mentor during this period.Arita, Eriko.  \"Keene: A life lived true to the words,\" Japan Times. September 6, 2009; retrieved November 18, 2012."]}, {"page": "Blundell's School", "response": ["*Richard Bowring, Master of Selwyn College, Cambridge"]}, {"page": "The Diary of Lady Murasaki", "response": ["By the early 11th century new genres of women's court literature were appearing in the form of diaries and poetic stories. Women, relegated to the private sphere, quickly embraced the use of kana, unlike men who still conducted business in Chinese.Shirane (2008), 114  Women's writing showed a marked difference from men's, more personal and introspective in nature.  Thus written Japanese was developed by women who used the language as a form of self-expression and, as Japanese literature scholar Richard Bowring says, by women who undertook the process of building \"a flexible written style out of a language that had only previously existed in a spoken form\".Bowring (2005), xviii", "Richard Bowring published translation in 1982,Ury (1983), 175 which contains a \"lively and provocative\" analysis."]}, {"page": "Order of the Rising Sun", "response": ["* Richard Bowring (1947- ), 2013"]}, {"page": "Roger Mosey", "response": ["In 2013, Mosey was elected to succeed Richard Bowring as the Master of Selwyn College, Cambridge.\"New Master of Selwyn College elected\", University of Cambridge News, 2 July 2013 Announced on 2 July, he took up the role in October 2013. In 2013 it was announced Mosey would be the Chair of Bishop Grosseteste University's university council."]}, {"page": "Bowring", "response": ["*Richard Bowring (b. 1947), Professor of Japanese Studies at the University of Cambridge"]}, {"page": "Timeline of the Middle Ages", "response": ["| 1021 || || The Tale of Genji, written by Murasaki Shikibu, is completed sometime before this date.The Diary of Lady Murasaki, ed. Richard Bowring, Penguin Classics 2005, p.31, note 41. In his introduction to the text, Bowring discusses its dating which, in any case, is generally accepted by most authorities. Royall Tyler, in his edition of the Tale of Genji cited below, also draws attention to the entry in Murasaki Shikibu's diary: see the Penguin Books edition, 2003, Introduction, p.xvii || It is sometimes called the world's first novel, the first modern novel, the first psychological novel or the first novel still to be considered a classic."]}, {"page": "The Tales of Ise", "response": ["At least four theories for the title of the work have been proposed by commentators from the Kamakura period onwards: the work was written by Lady Ise and named after her; the title followed from section 69, as the central character visits the Priestess at Ise Grand Shrine; in the Nihon Shoki, the character for I reads as woman, and Se reads as man, leading to the text embodying the theme of union; the author deliberately distorted events, places, people, and times, embodying the phrase Ise ya Hyuga or 'topsy-turvy'.Pages 431-432, Richard Bowring, 'The Ise monogatari: A short cultural history'", "* Richard Bowring, 'The Ise monogatari: A short cultural history', Harvard Journal of Asiatic Studies, vol. 52, no. 2 (December 1992), pp. 401–480. "]}, {"page": "Kōshin", "response": ["* Richard Bowring, The Religious Traditions of Japan,  Cambridge University Press, 2005, "]}, {"page": "Kagerō Nikki", "response": ["*Watanabe, Minoru; Richard Bowring. \"Style and Point of View in the Kagero Nikki.\"Journal of Japanese Studies, Vol. 10, No.2. (Summer, 1984), pp. 365–384. ."]}, {"page": "List of masters of Selwyn College, Cambridge", "response": ["The college has elected thirteen masters since its founding in 1882. The first master of the college, Arthur Lyttelton (1882–1893), was instrumental in coordinating the establishment of the college and the development of its first court. The second master of the college, John Richardson Selwyn (1893–1898), was a son of the college's namesake, George Augustus Selwyn. Particularly significant or influential masters have been commemorated through the naming of buildings and rooms throughout the college, such as the Owen Chadwick Room.http://www.sel.cam.ac.uk/selwyn-college/selwyn-history-1973/ Other masters such as Richard Appleton (1907–1909) have had their initials engraved on the exterior stones of the college's Dining Hall. The Master is provided use of the Master Lodge in Old Court for the duration of their term. The Master's Lodge has traditionally served both as the residence of the master as well as a place for college meetings, receptions, and events. Subsequent Masters of the college, including Richard Bowring (2000–2013) and Roger Mosey have continued to lead the college's expansion through the development of new academic and residential buildings.", "* 2000–2013 Richard Bowring"]}, {"page": "William E. Skillend", "response": ["Skillend was born in Liverpool and went on to study Japanese at Christ's College, Cambridge, where he received a first-class degree and later completed a PhD. He became one of the generation of British orientalists who started as military translators, in his case at Bletchley Park.William E. Skillend, 'The Early Days, 1947-55', in Richard Bowring (ed.), Fifty years of Japanese at Cambridge, 1948–98: A Chronicle with Reminiscences (Cambridge: Faculty of Oriental Studies, University of Cambridge, 1998), pp. 8-15."]}, {"page": "List of Honorary Fellows of Downing College, Cambridge", "response": ["* Richard Bowring"]}, {"page": "Annie Shepley Omori", "response": ["She translated Diaries of Court Ladies of Old Japan in 1920. The book, published with Kochi Doi, combined a translation of The Diary of Lady Murasaki with that of Izumi Shikibu (The Izumi Shikibu nikki) and of the Sarashina nikki. Their translation had an introduction by Amy Lowell. A more recent English translation was published by Richard Bowring in 1982."]}, {"page": "Mikael Adolphson", "response": ["Adolphson’s first academic appointment was at the University of Oklahoma from 1995 to 1999, and then Harvard University, where he was assistant and associate professor of Japanese History. In 2008 he joined the faculty at the University of Alberta as Professor of Japanese Cultural Studies, and served as chair of the Department of East Asian Studies and associate dean in the Faculty of Arts. As associate dean, he founded the first pedagogical research unit for Arts, Humanities and Social Sciences, named the Arts Pedagogy Research and Innovation Laboratory, where one of his project-based courses is featured. Adolphson has been Keidanren Professor of Japanese Studies at Cambridge since January 2016; the post was held previously by Richard Bowring and Peter Kornicki. During his inaugural lecture at Cambridge in October 2016, Adolphson announced the launching of a new vision for Japanese Studies at Cambridge, entitled Japan and the World. In March 2020, he co-founded the Japan Global Research Center in Tokyo, which aims to connect Japanese and Cambridge researchers through large and collaborative projects."]}, {"page": "Bowring, Richard", "response": ["#REDIRECT Richard Bowring"]}]}}