{"wiki_id": "http://www.wikidata.org/entity/Q7329989", "itemLabel": "Richard William Hunt", "itemDescription": "British palaeographer and bibliographer (1908-79)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_William_Hunt", "wikipedia_page": {"main": "Richard William Hunt (11 April 1908 – 13 November 1979) was a scholar, grammarian, palaeographer, editor, and author of a number of books about medieval history. He began his career as a lecturer in palaeography at Liverpool University, and worked at Bush House during World War II. In 1945 he obtained the position of Keeper of the Western Manuscripts at the Bodleian Library, and he relocated to Oxford, remaining in the position until 1975.On 11 December 1939 he married Edith Irene Joyce Twamley at Spondon. She died from complications of pregnancy on 7 December 1940. On 14 February 1942 Hunt remarried to Katharine (Kit) Eva Rowland (1913/14–1977), daughter of timber merchant Harry Rowland of Parkgate, Cheshire. Three sons were born to them, including Tim Hunt.On Hunt's retirement from the Bodleian in 1975, he was honoured with an Oxford exhibition, The Survival of Ancient Literature, as well as a collection of essays. His death in 1980 was marked by a second major exhibition, Manuscripts at Oxford.", "link_mentions": [{"page": "Spondon", "response": ["*Richard William Hunt, Keeper of the Western Manuscripts, Bodleian Library."]}, {"page": "List of Balliol College, Oxford people", "response": ["* Richard William Hunt"]}, {"page": "Richard Hunt", "response": ["* Richard William Hunt (1908–1979), English editor, medieval historian, palaeographer"]}, {"page": "Tim Hunt", "response": ["Hunt was born on 19 February 1943 in Neston, Cheshire, to Richard William Hunt, a lecturer in palaeography in Liverpool, and Kit Rowland, daughter of a timber merchant. After the death of both his parents, Hunt found his father had worked at Bush House, then the headquarters of BBC World Service radio, most likely in intelligence, although it is not known what he actually did. In 1945, Richard became Keeper of the Western Manuscripts at the Bodleian Library, and the family relocated to Oxford. At the age of eight, Hunt was accepted into the Dragon School, where he first developed an interest in biology thanks to his German teacher, Gerd Sommerhoff. When he was fourteen, he moved to Magdalen College School, Oxford, where the science prizes now bear his name, becoming even more interested in science and studying subjects such as chemistry and zoology.Creative Breakthroughs | Tim Hunt | TEDxLancasterUBBC Radio 4 interview with Jim Al-Khalili on The Life Scientific"]}, {"page": "F. M. Powicke", "response": ["*Studies in Mediaeval History Presented to Frederick Maurice Powicke. (1969) edited by Richard William Hunt, William Abel Pantin and R. W. Southern"]}, {"page": "Hélinand of Froidmont", "response": ["He was born of Flemish parents at Pronleroy in France around 1150. He studied under Ralph of Beauvais.Richard William Hunt, \"Studies on Priscian in the Twelfth Century, II: The School of Ralph of Beauvais\", in The History of Grammar in the Middle Ages: Collected Papers (John Benjamins, 1980), pp. 39–94, esp. 49–50."]}, {"page": "R. A. B. Mynors", "response": ["His tenure at Oxford University saw the beginning of his comprehensive work on medieval manuscripts. From the late 1920s onwards, Mynors was drawn more to matters of codicology than to purely classical questions. He prepared an edition of the 6th-century scholar Cassiodorus, for which he travelled extensively in continental Europe; a critical edition was published in 1937. In 1929, he was appointed librarian of Balliol College. This position gave impetus to create a catalogue of the college's medieval manuscripts. A similar project, a catalogue of the manuscripts housed at Durham Cathedral, was compiled in the 1930s. Mynors's interest in codicology gave rise to a close co-operation with the medievalists Richard William Hunt and Neil Ripley Ker."]}, {"page": "L. D. Reynolds", "response": ["In 1954, Reynolds was elected to his first academic appointment, a research fellowship at The Queen's College, Oxford. During his three years there, he worked mainly on the Letters of Seneca the Younger, which would later form the basis of his reputation as a Latinist. In this period, he came under the influence of three textual critics working at Oxford: Neil Ripley Ker, Richard William Hunt, and R. A. B. Mynors, the senior chair of Latin at the university. They encouraged him to study the transmission of the text of Seneca."]}, {"page": "Ralph of Beauvais", "response": ["Born in England, Ralph moved to France no later than 1140 to study under Peter Abelard, who died in 1142. Although he was largely forgotten by the end of the Middle Ages, he was famous in his own day. Gerald of Wales, referring to the late 1160s and 1170s when he was a student at Paris, writes that Ralph \"far outdistanced all others in our days as the singular teaching authority on the art of literature and knowledge of grammar\" (in artis litteratorie peritia grammaticaque doctrina singulari prerogativa nostris diebus ceteris cunctis longe preminebat). The chronicler Helinand, who was his pupil, calls him \"erudite in divine as much as in secular letters\" (in divinis quam in saecularibus litteris eruditus). His career was spent entirely as a teacher of grammar in the cathedral school of Beauvais. Sometime between 1182 and 1185, when he was an old man, he exchanged letters with Peter of Blois, reproaching Peter for having abandoned the schools to work for the archdiocese of Canterbury and being reproached by Peter in turn for having stuck to grammar when his peers had moved on to higher things.Richard William Hunt, \"Studies on Priscian in the Twelfth Century, II: The School of Ralph of Beauvais\", in The History of Grammar in the Middle Ages: Collected Papers (John Benjamins, 1980), pp. 39–94, esp. 49–50. Among his students were Peter of Spain, Robert Blund and Robert of Paris.L. Kaczmarek, \"Ralph of Beauvais (fl. 1175)\", Encyclopedia of Language and Linguistics (Elsevier, 2005), vol. 10, p. 356."]}, {"page": "A. C. de la Mare", "response": ["* (with B. C. Barker-Benfield). Manuscripts at Oxford: An Exhibition in Memory of Richard William Hunt, 1908–1979: Keeper of Western Manuscripts at the Bodleian Library, Oxford, 1945–1975, On Themes Selected and Described by Some of His Friends. Oxford: Bodleian, 1980."]}, {"page": "R. W. Hunt", "response": ["#REDIRECT Richard William Hunt"]}, {"page": "R.W. Hunt", "response": ["#REDIRECT Richard William Hunt"]}]}}