{"wiki_id": "http://www.wikidata.org/entity/Q7329885", "itemLabel": "Richard Wells", "itemDescription": "Film and TV Composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Wells_(composer)", "wikipedia_page": {"main": "Richard Wells is a British film, TV and games composer.Wells began his composing career writing music for computer games in 1994, after meeting games composer Dave Punshon. He met horror film director Jake West in 1997 whilst working on computer game MIA. This led to him starting a career in film in 1998, scoring for West's first film Razor Blade Smile, an extremely low-budget film. Since then, Wells has worked on two more films with Jake West: Evil Aliens and Doghouse.\nIn 2002, Wells began to score music for film trailers. He has now composed for over 50 film trailers including The Grudge, Infernal Affairs, and Seven Swords.\nHis recent credits include re-scoring the Thai martial arts film Ong-Bak in 2005, scoring for Mutant Chronicles in 2009, and working on Toby Whithouse's TV series Being Human.Wells lives in the UK with his wife and two children.", "link_mentions": [{"page": "Being Human (British TV series)", "response": ["| Richard Wells", "In 2011, a soundtrack was released for Being Human that contained music from Series 1 and Series 2. The music was composed by Richard Wells, and featured a track listing of 24 songs. A soundtrack for the third series was released on 25 March 2013. It featured 48 minutes and 25 tracks of music composed by the same composer."]}, {"page": "Richard Wells", "response": ["Richard Wells may refer to:", "*Sir Richard Wells (Royal Navy officer) (1833–1896), British admiral", "*Sir Richard Wells, 1st Baronet (1879–1957), Conservative Member of Parliament for Bedford", "*Richard Wells (nurse) (1950–1993), British nurse, nursing adviser and health care administrator", "*Richard Wells (composer), British film, TV and games composer", "*C. Richard Wells, American evangelical pastor, theologian, and college president", "*Richard Wells (cricketer) (born 1956), Rhodesian-born English cricketer"]}, {"page": "List of major music film awards apart from Academy Award", "response": ["* Richard Wells"]}, {"page": "British Academy Television Craft Award for Best Original Music", "response": ["| Being Human || Richard Wells || BBC Three"]}]}}