{"wiki_id": "http://www.wikidata.org/entity/Q732872", "itemLabel": "David Lack", "itemDescription": "British ornithologist and biologist (1910-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Lack", "wikipedia_page": {"main": "David Lambert Lack FRS (16 July 1910 – 12 March 1973) was a British evolutionary biologist who made contributions to ornithology, ecology, and ethology. His 1947 book, Darwin's Finches, on the finches of the Galapagos Islands was a landmark work as were his other popular science books on Life of the Robin and Swifts in a Tower. He developed what is now known as Lack's Principle which explained the evolution of avian clutch sizes in terms of individual selection as opposed to the competing contemporary idea that they had evolved for the benefit of species (also known as group selection). His pioneering life-history studies of the living bird helped in changing the nature of ornithology from what was then a collection-oriented field. He was a longtime director of the Edward Grey Institute of Field Ornithology at the University of Oxford.", "link_mentions": [{"page": "Ornithology", "response": ["This early idea that the study of living birds was merely recreation held sway until ecological theories became the predominant focus of ornithological studies. The study of birds in their habitats was particularly advanced in Germany with bird ringing stations established as early as 1903. By the 1920s, the Journal für Ornithologie included many papers on the behaviour, ecology, anatomy, and physiology, many written by Erwin Stresemann. Stresemann changed the editorial policy of the journal, leading both to a unification of field and laboratory studies and a shift of research from museums to universities. Ornithology in the United States continued to be dominated by museum studies of morphological variations, species identities, and geographic distributions, until it was influenced by Stresemann's student Ernst Mayr. In Britain, some of the earliest ornithological works that used the word ecology appeared in 1915. The Ibis, however, resisted the introduction of these new methods of study, and  no paper on ecology appeared until 1943. The work of David Lack on population ecology was pioneering. Newer quantitative approaches were introduced for the study of ecology and behaviour, and this was not readily accepted. For instance, Claud Ticehurst wrote:", "David Lack's studies on population ecology sought to find the processes involved in the regulation of population based on the evolution of optimal clutch sizes. He concluded that population was regulated primarily by density-dependent controls, and also suggested that natural selection produces life-history traits that maximize the fitness of individuals. Others, such as Wynne-Edwards, interpreted population regulation as a mechanism that aided the \"species\" rather than individuals. This led to widespread and sometimes bitter debate on what constituted the \"unit of selection\". Lack also pioneered the use of many new tools for ornithological research, including the idea of using radar to study bird migration."]}, {"page": "List of biologists", "response": ["* David Lack (1910–1973), British ornithologist who introduced Lack's Principle to explain the evolution of avian clutch sizes"]}, {"page": "Behavioral ecology", "response": ["There are many examples of parent-offspring conflict in nature. One manifestation of this is asynchronous hatching in birds. A behavioral ecology hypothesis is known as Lack's brood reduction hypothesis (named after David Lack). Lack's hypothesis posits an evolutionary and ecological explanation as to why birds lay a series of eggs with an asynchronous delay leading to nestlings of mixed age and weights. According to Lack, this brood behavior is an ecological insurance that allows the larger birds to survive in poor years and all birds to survive when food is plentiful. We also see sex-ratio conflict between the queen and her workers in social hymenoptera. Because of haplodiploidy, the workers (offspring) prefer a 3:1 female to male sex allocation while the queen prefers a 1:1 sex ratio. Both the queen and the workers try to bias the sex ratio in their favor. In some species, the workers gain control of the sex ratio, while in other species, like B. terrestris, the queen has a considerable amount of control over the colony sex ratio. Lastly, there has been recent evidence regarding genomic imprinting that is a result of parent-offspring conflict. Paternal genes in offspring demand more maternal resources than maternal genes in the same offspring and vice versa. This has been show in imprinted genes like insulin-like growth factor-II."]}, {"page": "Darwin's finches", "response": ["The term \"Darwin's finches\" was first applied by Percy Lowe in 1936, and popularised in 1947 by David Lack in his book Darwin's Finches. Reissued in 1961 by Harper, New York. Reissued in 1983 by Cambridge University Press, . Lack based his analysis on the large collection of museum specimens collected by the 1905–06 Galápagos expedition of the California Academy of Sciences, to whom Lack dedicated his 1947 book. The birds vary in size from 10 to 20 cm and weigh between 8 and 38 grams. The smallest are the warbler-finches and the largest is the vegetarian finch. The most important differences between species are in the size and shape of their beaks, which are highly adapted to different food sources. The birds are all dull-coloured.", "Whereas Darwin spent just five weeks in the Galápagos, and David Lack spent three months, Peter and Rosemary Grant and their colleagues have made research trips to the Galápagos for about 30 years, particularly studying Darwin's finches."]}, {"page": "James Bond (ornithologist)", "response": ["James Bond noted that the distribution of hutias was limited by what he thought may have been a marine boundary. In 1973 David Lack proposed that this be called Bond's Line, a biogeographical boundary between Tobago and the Lesser Antilles that also divided birds of North and South American origin. In 2015 a new subspecies of hutia was described as Plagiodontia aedium bondi and named after Bond for his recognition of the biogeographical divide."]}, {"page": "1910 in science", "response": ["* July 16 – David Lack (died 1973), English ornithologist."]}, {"page": "Alan Hodgkin", "response": ["From an early life on, Hodgkin and his brothers were encouraged to explore the country around their home, which instilled in Alan an interest in Natural History, particularly ornithology. At the age of 15, he helped Wilfred Backhouse Alexander with surveys of heronries and later, at Gresham's School, he overlapped and spent a lot of time with David Lack. In 1930, he was the winner of a bronze medal in the Public Schools Essay Competition organised by the Royal Society for the Protection of Birds.Protection of Birds Measures Urged By Royal Society in The Times, Saturday, 29 March 1930; pg. 14; Issue 45474; col C"]}, {"page": "List of ornithologists", "response": ["*David Lack – England"]}, {"page": "Edward Grey Institute of Field Ornithology", "response": ["The first Director of the fledgling Institute was W. B. Alexander, remembered in the name of the EGI's library, the Alexander Library. Alexander was succeeded in 1945 by former school-teacher David Lack, one of the pioneers of population biology, who had already published The Life of the Robin.’The Life of the Robin’, D.Lack. .First edition published by H.F.Witherby, London 1943. Lack served as Director until his death in 1973, working with field assistants such as Denis Owen, and oversaw the growth of the EGI into an internationally known centre for research into population biology of birds."]}, {"page": "Timeline of ornithology", "response": ["*1943 – David Lack makes calculations of bird mortality using reports of ringed birds"]}, {"page": "Salim Ali", "response": ["Salim Ali was very influential in ensuring the survival of the BNHS and managed to save the then 100-year-old institution by writing to the then Prime Minister Pandit Nehru for financial help. Salim also influenced other members of his family. A cousin,Ali (1985):192 Humayun Abdulali became an ornithologist while his niece Laeeq took an interest in birds and was married to Zafar Futehally, a distant cousin of Ali, who went on to become the honorary Secretary of the BNHS and played a major role in the development of bird study through the networking of birdwatchers in India. A grand-nephew Shahid Ali also took an interest in ornithology. Ali also guided several MSc and PhD students, the first of whom was Vijaykumar Ambedkar, who further studied the breeding and ecology of the baya weaver, producing a thesis that was favourably reviewed by David Lack.Ali (1985):168Ali (1985):213"]}, {"page": "1973 in science", "response": ["* March 12 – David Lack (b. 1910), English ornithologist"]}, {"page": "1947 in science", "response": ["* David Lack publishes Darwin's Finches."]}, {"page": "1943 in science", "response": ["* David Lack's study The Life of the Robin is published in England."]}, {"page": "Icons of Evolution", "response": ["In the chapter on Darwin's finches, Wells argues that Darwin's finches were merely a \"speculative afterthought\". Wells claims that ornithologist David Lack is more to be credited with the popular finches, and that it was Lack who paraded the finches and claimed that they were instrumental in Darwin's theories. This claim is contradicted by Alan D. Gishlick and Dave Wisker, who state that Darwin was in fact heavily influenced by the finches as early as 1837, with Wisker stating that \"Wells seems to be the one doing the speculating\".Jonathan Wells and Darwin's Finches Dave Wisker. TalkOrigins Archive, 2002Icon 7 — Darwin's Finches, Alan D. Gishlick, National Center for Science Education Wells argues that, rather than evolving, the finch species may be \"merging\", combining from multiple species into a single species rather than diverging from a single species into multiple species. Wells argues that, due to interbreeding between many of the finch \"species\", the 13 species may actually be less than previously thought. Contradicting this, Gishlick states that the separation \"according to which species are separated by behaviors that lead animals to recognize potential mates\" is \"widely accepted\". Wisker states that hybridization among finch species on the Galápagos Islands is, in fact, rare. Both agree that even if hybridization did occur, it would be irrelevant, because evolution does not specifically require divergence."]}, {"page": "Crested penguin", "response": ["Crested penguins lay two eggs, but almost always raise only one young successfully. All species exhibit the odd phenomenon of egg-size dimorphism in breeding; the first egg (or A-egg) laid is substantially smaller than the second egg (B-egg). This is most extreme in the macaroni penguin, where the first egg averages only 60% the size of the second.Williams (The Penguins) p. 38 The reason for this is a mystery remains unknown, although several theories have been proposed. British ornithologist David Lack theorized that the genus was evolving toward the laying of a one-egg clutch. Experiments with egg substitution have shown that A-eggs can produce viable chicks that were only 7% lighter at time of fledging.  Physiologically, the first egg is smaller because it develops while the mother is still at sea swimming and thus has less energy to invest in the egg."]}, {"page": "John Crook (ethologist)", "response": ["Crook was a pioneer in the early development of socio-ecology, adding this dimension to ethology which was then dominated by the ideas of \"Niko\" Tinbergen and Konrad Lorenz. His student paper on the gulls of Southampton WaterCrook, J.H. 1953. An observational study of the gulls of Southampton Water. British Birds 46: 386–397. while at University of Southampton, led to his doctoral study at Jesus College, CambridgeCrook, J.H. 1964. The Evolution of Social organisation and Visual Communication in the Weaver Birds (Ploceinae). Behaviour Monograph. 10. Brill. Leiden. of the weaver birds (Ploceidae) of West Africa, supervised by William Homan Thorpe and Robert Hinde. This was followed by further research in India, the Seychelles Islands and East Africa. His theoretical interpretation subsequently contributed to David Lack’s discussion of the behavioural component in avian population research.Lack, D. 1966. Population Studies of Birds. Clarendon. Oxford, quoting Crook, J.H. 1965. The adaptive significance of Avian Social organisations. Symp. Zool. Soc. Lond. 14: 181–218. Also Crook, J.H. 1970. Social organisation and the environment: aspects of contemporary Social Ethology. Animal Behaviour 18: 197–209. His fieldwork was further supported by laboratory experimentation on the endocrinal basis for the behaviour observed in the field.For example: Crook, J.H. and P. Butterfield. 1970. Gender role in the social system of Quelea. pp. 221–248. In Social behaviour in Birds and Mammals. J.H. Crook (Ed.). Academic. London."]}, {"page": "Richard Leacock", "response": ["He was educated at Dartington Hall School from 1934 to 1938, alongside Robert Flaherty's daughters; David Lack (Life of the Robin) taught biology at the school. After filming Lack's expedition to the Canary and Galapagos Islands (1938–39), Leacock moved to the US and majored in physics at Harvard to master the technology of filmmaking. Meanwhile, he worked as cameraman and assistant editor on other peoples films, notably To Hear Your Banjo Play (1941)—Leacock filmed a folk music festival atop a mountain in south Virginia where there was no electricity, using a 35mm studio camera and 35mm optical film sound recorder with batteries in a large truck, a rare achievement at that time. He then spent three years as a combat photographer in Burma and China, followed by 14 months as cameraman on Robert Flaherty's Louisiana Story (1946–48)."]}, {"page": "Evolutionary ecology", "response": ["A large part of evolutionary ecology is about utilising models and finding empirical data as proof. Examples include the Lack clutch size model devised by David Lack and his study of Darwin's finches on the Galapagos Islands. Lack's study of Darwin's finches was important in analyzing the role of different ecological factors in speciation. Lack suggested that differences in species were adaptive and produced by natural selection, based on the assertion by G.F. Gause that two species cannot occupy the same niche.\"Lack, David Lambert.\" Complete Dictionary of Scientific Biography, vol. 17, Charles Scribner's Sons, 2008, pp. 521–523. Gale Virtual Reference Library, go.galegroup.com/ps/i.do?p=GVRL&sw=w&u=tusc49521&v=2.1&id=GALE%7CCX2830905204&it=r&asid=f73ad736d17e749682f6a72c03aeca54. Accessed 10 Nov. 2017.", "* David Lack (1910–1973), a follower of Charles Darwin, worked to merge the fields of evolutionary biology and ecology, focusing mainly on birds and evolution."]}, {"page": "Chris Perrins", "response": ["Perrins was educated at Charterhouse School and Queen Mary College where he was awarded a Bachelor of Science degree in Zoology in 1957. He completed his postgraduate study and research at the University of Oxford where he was awarded a Doctor of Philosophy degree in 1963 for research on brood size in tits supervised by David Lack.", "Perrins research interests are in the population dynamics and breeding biology of birds, particularly tits (Paridae), mute swans  and seabirds on Skomer and Skokholm.  He investigated animal lead poisoning of swans from lead shot. He is renowned for his work on avian population ecology and, in particular, reproductive rates. He has made a number of important contributions to the long-term study of the great tit at Wytham Woods — an area of mixed woodland established in 1947 by evolutionary biologist David Lack – one of the most famous studies in population ecology."]}, {"page": "Character displacement", "response": ["In the initial explication of character displacement, many of the examples set forth as potential evidence for character displacement were observations between multiple pairs of birds. These included rock nuthatches in Asia, Australian honeyeaters of the genus Myzantha, Australian parrots, shearwaters in the Cape Verde Islands, flycatchers of the Bismarck Archipelago and notably, Darwin's finches in the Galapagos. David Lack found that when the two species Geospiza fortis and G. fuliginosa occurred on large islands together, they could be distinguished unequivocally by beak size. When either one occurred by itself on a smaller island, however, the beak size was intermediate in size relative to when the two co-occurred. Similarly, Peter and Rosemary Grant found that a Geospiza fortis island population diverged in beak size (due to high mortality) from competitor G. magnirostris in a year with low food supply, apparently due to increased competition for larger seeds that both species fed on. Most character displacement studies focus on morphological differences in feeding apparatus rather than on those relating to habitat use. However, comparisons of micro-habitat use and morphological adaptations of Western and Eastern Rock Nuthatches indicate that these two species show spatial niche segregation in addition to trophic niche segregation."]}, {"page": "David Lambert Lack", "response": ["#redirectDavid Lack"]}, {"page": "Puerto Rican amazon", "response": ["British ornithologist David Lack considered that the Puerto Rican amazon had evolved from the Hispaniolan amazon (A. ventralis) found in Hispaniola, but it has since been argued that he omitted some elements in his analysis, including the similarities found between the black-billed amazon (A. agilis) of Jamaica and the Puerto Rican amazon.Snyder et al., p. 47 Subsequent studies showed that size and color patterns were not sufficient to assess evolutionary relationships, and that patterns changed with relative ease even within members of the same species. The research concluded that the Puerto Rican amazon may share a common ancestor with the Jamaican A. agilis.Snyder et al., p. 52 However, recent phylogenetic studies show that the Puerto Rican amazon is more closely related to the Hispaniolan amazon and the Cuban amazon than to the black-billed amazon.Russello and Amato, p. 428"]}, {"page": "Robert H. MacArthur", "response": ["University of Toronto to Marlboro College.  MacArthur received his Bachelor's degree in mathematics from Marlboro College, followed by a Master's degree in mathematics from Brown University in 1953. A student of G. Evelyn Hutchinson, MacArthur earned his Ph.D. from Yale University in 1957; his thesis was on the division of ecological niches among five warbler species in the conifer forests of Maine and Vermont. From 1957 to 1958, MacArthur worked as a postdoc with David Lack."]}, {"page": "List of Christians in science and technology", "response": ["*David Lack (1910–1973): director of the Edward Grey Institute of Field Ornithology and in part known for his study of the genus Euplectes. He converted to Anglicanism at 38 and wrote Evolutionary Theory and Christian Belief in 1957."]}, {"page": "List of ecologists", "response": ["* David Lack (UK)"]}, {"page": "Clutch (eggs)", "response": ["In birds, ornithologist David Lack carried out much research into regulation of clutch size.   In species with altricial young, he proposed that optimal clutch size was determined by the number of young a parent could feed until fledgling.  In precocial birds, Lack determined that clutch size was determined by the nutrients available to egg-laying females.  An experimental study in Black Brent Geese (Black Brant), which rarely lay more than 5 eggs, found that the probability of an egg successfully leading to a fledged gosling declined from 0.81 for two-egg clutches to 0.50 for seven-egg clutches, whilst the nesting period increased with the increasing number of eggs laid.  This suggests that there is no benefit for female Black Brant to lay more than five eggs.  "]}, {"page": "Robert Hinde", "response": ["In 1948, Hinde accepted a position at Oxford University, studying under David Lack. Although Lack had envisioned Hinde's research to focus on the feeding ecology of jackdaws and rooks, Hinde convinced him to change the research program to pursue study of the great tit.  While Lack was Hinde's official supervisor, and \"was enormously helpful in teaching [Hinde] to be critical and describe selectively and write concisely\", Hinde credited the most major influence on his later work to Niko Tinbergen, who arrived at Oxford in 1950. Tinbergen was on the cusp of becoming a seminal figure in the field of ethology and behavior with his \"four ‘why’s’ of behavior\", and this allowed Hinde to learn the ethological methods early on and apply them to the rest of his career. Hinde received a D.Phil in 1950; his thesis focused on the annual cycle and behavior of the great tit, and on comparing it to other members of the family Paridae. The thesis marked the first systematic observation and description of the annual behavior of the species.Hinde, R. (1951). A comparative behaviour study of the Paridae (PhD thesis). University of Oxford."]}, {"page": "1943 in the United Kingdom", "response": ["* David Lack's study The Life of the Robin."]}]}}