{"wiki_id": "http://www.wikidata.org/entity/Q7328120", "itemLabel": "Richard O'Brien", "itemDescription": "British consultant", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_O%27Brien_(economist)", "wikipedia_page": {"main": "Richard Rhys O'Brien (born 19 November 1950, Banbury, Oxfordshire) is a British economist, futurist, author and co-founder of Outsights, a scenario planning consultancy. Since 2009 he has also been a singer songwriter.", "link_mentions": [{"page": "Outsights", "response": ["Outsights is an independent scenario planning consultancy founded in 1998 by Richard O'Brien and Tim Bolderson. The company is based in Islington, London, with seven full-time employees and 30 associates. Outsights uses scenario planning and future thinking to help business, Government and organisations to anticipate, interpret and act upon important external developments in the outside world, and to plan strategies for several possible futures."]}, {"page": "Richard O'Brien (disambiguation)", "response": ["Richard O'Brien (born 1942) is an English actor, television presenter, writer and theatre performer.", "Richard O'Brien may also refer to:", "* Richard O'Brien (author) (born 1934), American writer on the subject of toys and toy collecting", "* Richard O'Brien (economist) (born 1950), English economist", "* Sir Richard O'Brien (industrial relations expert) (1920–2009), British industrial relations expert and British Army officer", "* Richard O'Brien (Fox News) (1956–2017), American creative director who worked for Fox News", "* Richard O'Brien Three-Decker, an apartment house listed in the United States National Register of Historic Places", "* Lucius Richard O'Brien (1832–1899), Canadian artist"]}, {"page": "Society of Professional Economists", "response": ["*Richard O'Brien"]}, {"page": "Henry Bakis", "response": ["The work of Bakis demonstrates that ICT does not lead to the \"death of distance\", or \"the end of geography \" in spite of the assertions of some futurologists as Richard O'Brien,Global Financial Integration: The End of Geography, 1992. See: Richard O'Brien (economist) Frances Cairncross,The death of distance, 2001. \"Wireless (...) is killing rent, putting the world in our pockets\" (p. 2 ), \"The communications revolution is democratic and profoundly liberating, leveling the imbalance between wide and small, rich and poor. The death of distance, overall, shoulds be welcomed and enjoyed.\" ( p. 6) Kenichi Ohmae.The Borderless World Power and Strategy in an Interlinked Economy 1999 "]}]}}