{"wiki_id": "http://www.wikidata.org/entity/Q7326589", "itemLabel": "Richard Hughes", "itemDescription": "English cricketer (1926-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hughes_(cricketer)", "wikipedia_page": {"main": "Richard Clive Hughes (30 September 1926 – 5 March 2020) was an English first-class cricketer who played 11 games for Worcestershire in the early 1950s.Hughes was born in Watford, Hertfordshire in September 1926 and was educated at Watford Grammar School for Boys. He made his first-class debut for Worcestershire against the Combined Services at New Road in May 1950; in the second innings he took 3-38, which was to remain his career best innings return. His victims were Wilfred Payton, Anthony Thackara and Michael Ainsworth, the last-named being a capped Worcestershire player himself. Hughes played no other first-class cricket in 1950, although he did appear several times for the county's Second XI in the Minor Counties Championship.\nThe 1951 season saw Hughes play ten more games for Worcestershire, but with limited success: his 12 wickets cost him over 53 runs apiece, while in nine innings he scored a mere 43 runs, almost half of them courtesy of the career-best 21 he made against Surrey in June. His last game was at Scarborough against Yorkshire at the end of August, in which his only wicket was that of Edward Lester. Hughes later played club cricket for Harrow Town, as well as Minor Counties cricket for Hertfordshire, his native county, until he retired in 1960 due to injury. He died in March 2020 at the age of 93.", "link_mentions": [{"page": "Richard Hughes", "response": ["Richard Hughes may refer to:", "* Sir Richard Hughes, 1st Baronet (c. 1708–1779), British naval commander, first of the Hughes baronets of East Bergholt in the County of Suffolk", "* Sir Richard Hughes, 2nd Baronet (c. 1729–1812), British naval officer and Lieutenant-governor of Nova Scotia", "* Richard Hughes (cricketer) (1926–2020), English cricketer", "* Richard Hughes (footballer) (born 1979), Scottish footballer", "* Richard Hughes (jockey) (born 1973), Irish jockey", "* Richard Hughes (journalist) (1906–1984), Australian journalist", "* Richard Hughes (musician) (born 1975), drummer with Keane", "* Richard Hughes (British writer) (1900–1976), British writer", "* Richard Hughes (Archdeacon of Bangor) (1881–1962)"]}, {"page": "Watford Grammar School for Boys", "response": ["* Richard Hughes (1926– ), cricketer "]}, {"page": "Deaths in March 2020", "response": ["*Richard Hughes, 93, English cricketer (Worcestershire).Richard Hughes"]}]}}