{"wiki_id": "http://www.wikidata.org/entity/Q7326569", "itemLabel": "Richard Howitt", "itemDescription": "English cricketer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Howitt_(cricketer,_born_1977)", "wikipedia_page": {"main": "Richard William John Howitt (born 17 August 1977) is a former English cricketer. Howitt is a left-handed batsman who bowls right-arm medium pace. He was born in Grantham, Lincolnshire.\nHowitt made his Minor Counties Championship debut for Lincolnshire in 1999 against Hertfordshire. From 1999 to 2002, he represented the county in 24 Minor Counties Championship matches, as well as 13 MCCA Knockout Trophy matches, the last of which came in the 2002 Trophy against the Leicestershire Cricket Board. Howitt also made his List-A debut for Lincolnshire in the 1999 NatWest Trophy against Wales Minor Counties. From 1999 to 2002, he represented the county in 7 List-A matches, the last of which came against Cheshire in the 2nd round of the 2003 Cheltenham & Gloucester Trophy which was played in 2002.\nEducated at Cambridge University, Howitt made his first-class debut for Cambridge University Cricket Club in 2000 against Lancashire. During the 2000 season, he represented the University in 6 first-class matches, the last of which came in against Oxford University. In his 6 first-class matches, he scored 274 runs at a batting average of 34.25, with a single half century and single century high score of 118*. With the ball he took 4 wickets at a bowling average of 63.50, with best figures of 2/54.In 2005, Howitt joined Berkshire, making his debut for the county in the 2003 Minor Counties Championship against Oxfordshire. From 2003 to 2004, he represented the county in 8 Minor Counties Championship matches, as well as 2 MCCA Knockout Trophy matches against Hertfordshire and Wales Minor Counties. He also represented the county in 2 List-A matches, the first of which came against Durham in the 2003 Cheltenham & Gloucester Trophy and the second of which came against Kent in the 2004 Cheltenham & Gloucester Trophy at St Lawrence Ground, Canterbury. In his combined List-A career, he scored 155 runs at an average of 17.22, with a single half century high score of 52. With the ball he took a single wicket at a cost of 83.00, with best figures of 1/33. He also took 2 catches.\nIn 2006, he joined Bedfordshire, where he made his Minor Counties Championship debut for the county against Cumberland. From 2006 to 2008, he represented the county in 12 matches, with his final match coming in the 2006 Championship against Norfolk. Howitt also represented the county in the MCCA Knockout Trophy, making his debut for the county in that competition against Suffolk. From 2006 to 2006, he represented the county in 8 Trophy matches, the last of which came against Oxfordshire in the 2006 Trophy.Howitt today plays club cricket for Wolverhampton Cricket Club who play in the Birmingham and District Premier League.", "link_mentions": [{"page": "Grantham", "response": ["*Richard Howitt (born 1977), first-class cricketer"]}, {"page": "Worcestershire County Cricket League", "response": ["*Richard Howitt Colwall"]}, {"page": "Richard Howitt", "response": ["Richard Howitt may refer to:", "* Richard Howitt (poet) (1799–1869), British poet", "* Richard Howitt (cricketer, born 1864) (1864–1951), English cricketer", "* Richard Howitt (cricketer, born 1977), English cricketer", "* Richard Howitt (politician) (born 1961), British politician and CEO"]}, {"page": "List of Lincolnshire County Cricket Club List A players", "response": ["*Richard Howitt (1999–2002): RWJ Howitt"]}]}}