{"wiki_id": "http://www.wikidata.org/entity/Q7324041", "itemLabel": "Richard Beard", "itemDescription": "British photographer and businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Beard_(photographer)", "wikipedia_page": {"main": "Richard Beard (22 December 1801 – 7 June 1885) was an English entrepreneur and photographer who vigorously protected his photographic business by litigation over his photographic patents and helped to establish professional photography in the UK.", "link_mentions": [{"page": "List of photographers", "response": ["* Richard Beard (1801–1885)"]}, {"page": "Daguerreotype", "response": ["Without bills being passed by Parliament, as had been arranged in France, Arago having presented a bill in the House of Deputies and Gay-Lussac in the Chamber of Peers, there was no possibility of repeating the French arrangement in England which is why the daguerreotype was given free to the world by the French government with the exception of England and Wales for which Richard Beard controlled the patent rights.", "Daguerre patented his process in England, and Richard Beard patented his improvements to the process in ScotlandScottish patent taken out by Richard Beardtext of daguerrotype patentDaguerreotype patentMidley addenda R Derek WoodJohn Hannavy – Scottish Daguerreotype patent During this time the astronomer and member of the House of Deputies François Arago had sought a solution whereby the invention would be given free to the world by the passing of Acts in the French Parliament. Richard Beard, controlled most of the licences in England and Wales with the exception of Antoine Claudet who had purchased a licence directly from Daguerre.", "Johnson's father travelled to England with some specimen portraits to patent the camera and met with Richard Beard who bought the patent for the camera, and a year later bought the patent for the daguerreotype outright. Johnson assisted Beard in setting up a portrait studio on the roof of the Regent Street Polytechnic and managed Beard's daguerreotype studio in Derby and then Manchester for some time before returning to the US.John Johnson, photographer by David Simkin", "Daguerre did not patent and profit from his invention in the usual way. Instead, it was arranged that the French government would acquire the rights in exchange for lifetime pensions to Daguerre and to Niépce's son and heir, Isidore. The government would then present the daguerreotype process \"free to the world\" as a gift, which it did on 19 August 1839. However, five days previous to this, Miles Berry, a patent agent acting on Daguerre's behalf filed for patent No. 8194 of 1839: \"A New or Improved Method of Obtaining the Spontaneous Reproduction of all the Images Received in the Focus of the Camera Obscura\". The patent applied to \"England, Wales, and the town of Berwick-upon-Tweed, and in all her Majesty's Colonies and Plantations abroad\". This was the usual wording of English patent specifications before 1852. It was only after the 1852 Act, which unified the patent systems of England, Ireland and Scotland, that a single patent protection was automatically extended to the whole of the British Isles, including the Channel Isles and the Isle of Man. Richard Beard bought the patent rights from Miles Berry, and also obtained a Scottish patent, which he apparently did not enforce. The United Kingdom and the \"Colonies and Plantations abroad\" therefore became the only places where a license was legally required to make and sell daguerreotypes.Johnathan Carter 2002 Bulletin of Société Jersaise", "The other major innovation was a chemical one. In Daguerre's original process, the plate was sensitized by exposure to iodine fumes alone. A breakthrough came with the discovery that when exposure to bromine or chlorine fumes was correctly combined with this, the sensitivity of the plate could be greatly increased, which in turn greatly reduced the required exposure time to between fifteen and thirty seconds in favorable lighting conditions, according to Eder. Several experimenters discovered the propensity of using chlorine and bromine in addition to iodine: Wolcott, whose \"Wolcott's mixture\" was marketed by his partner, John Johnson that they called \"quickstuff\"; two unrelated individuals with the surname Goddard – Philadelphia physician and chemist Paul Beck Goddard,Paul Beck Goddard and John Frederick Goddard who lectured at the Adelaide Gallery before assisting Beard with setting up the first daguerreotype portraiture studio on the roof of the Regent Street Polytechnic;Historic Camera Richard BeardJohn Frederick Goddard (John Frederick Goddard was the first to publish information that bromine increased the sensitivity of daguerreotype plates in the Literary Gazette of 12 December 1840)Literary Gazette 12 December 1840The British Journal of Photography 15 December 1863 Jabez Hughes The Discoverer of the Use of Bromine in Photography: a Few Facts and an Appeal and in Vienna: Krachowila and the Natterer brothers.", "André-Adolphe-Eugène Disdéri and Jules Itier of France, and Johann Baptist Isenring of Switzerland, became prominent daguerreotypists. In Britain, however, Richard Beard bought the British daguerreotype patent from Miles Berry in 1841 and closely controlled his investment, selling licenses throughout the country and prosecuting infringers.Wood, R. Derek. \"The Daguerreotype in England: Some Primary Material Relating to Beard's Lawsuits.\" History of Photography, October 1979, Vol. 3, No. 4, pp. 305–09. Among others, Antoine Claudet and Thomas Richard Williams produced daguerreotypes in the UK."]}, {"page": "Cumberland Presbyterian Church", "response": ["*Richard Beard"]}, {"page": "Hand-colouring of photographs", "response": ["The first hand-coloured daguerreotypes are attributed to Swiss painter and printmaker Johann Baptist Isenring, who used a mixture of gum arabic and pigments to colour daguerreotypes soon after their invention in 1839.Henisch, H.K. & Henisch, B. (1996). The painted photograph 1939-1914: Origins, techniques, aspirations. Pennsylvania: The Pennsylvania State University Press. p. 21. Coloured powder was fixed on the delicate surface of the daguerreotype by the application of heat. Variations of this technique were patented in England by Richard Beard in 1842 and in France by Étienne Lecchi in 1842 and Léotard de Leuze in 1845. Later, hand-colouring was used with successive photographic innovations, from albumen and gelatin silver prints to lantern slidesRobinson, D., Herbert, S., Crangle, R., & Magic Lantern Society of Great Britain. (2001). Encyclopaedia of the magic lantern. London: Magic Lantern Society, p. 73-74. and transparency photography."]}, {"page": "John Jabez Edwin Mayall", "response": ["In 1844, Mayall entered into partnership with Samuel Van Loan, who had previously worked as a daguerreotypist in the English town of Manchester, only 30 miles from where Mayall was living in 1841. Richard Beard had established a daguerreotype portrait gallery at Ducie Place, Manchester on 18 November 1841. Beard had passed on the Manchester studio to the American daguerreotypist John Johnson in November 1842 and it is possible that Van Loan travelled with Johnson when he returned to America in 1844.", "Upon his return to England in 1846, Mayall worked for a short time with Antoine Claudet at his Daguerreotype Portrait Gallery on King William Street, near the Strand in London. Antoine Claudet (1797–1867) was Richard Beard's main rival in London in 1846.", "It seems that Mayall was worried about the financial cost of possible legal action from Richard Beard, the patentee of the daguerreotype process in England. Mayall told Thornbury, \"I was at that time fighting the battle of the patent rights of the daguerreotype.\" This struggle with Richard Beard is alluded to by William Constable, the daguerreotype licensee in Brighton, who referred to Beard's conflict with a \"photographer from Philadelphia.\"", "In the 1840s, the daguerreotype portrait had virtually supplanted the hand-painted portrait miniature. Some critics complained that the daguerreotype portrait on a metal plate was cold and harsh and lacked the finesse and charm of the small-scale painted portrait. In March 1842, Richard Beard had patented a method of colouring daguerreotype pictures. The following month a newspaper reported that \"Mr Beard has now discovered the means of colouring the plates after the photographic drawing is completed, thus giving the warmth and truth of a miniature painting.\" It is known that Mayall used a similar method of hand-colouring daguerreotype portraits while based in Philadelphia. When two journalists visited Mayall's new premises in London's Regent Street in 1853, they observed the work of the \"colouring room\" in which \"two damsels were busily at work\" adding colour to Mayall's daguerreotype portraits."]}, {"page": "Beard v. Egerton", "response": ["#redirectRichard Beard (photographer)"]}, {"page": "John Frederick Goddard", "response": ["John Frederick Goddard (1795–1866) was an English chemist who made important contributions to the early development of photography, in particular in his work for Richard Beard."]}, {"page": "Thomas Richard Williams", "response": ["Williams left Claudet's employ in the years following his marriage, most likely due to the increasing needs of his growing family. It is speculated he worked for renowned photographer Richard Beard after leaving Claudet, but research has yet to turn up anything definitive on that point."]}, {"page": "Richard Beard", "response": ["Richard Beard may refer to:", "*Richard Beard (photographer) (1801–1885), English entrepreneur and photographer", "*Richard Beard (courtier) ( 1540), English courtier", "*Richard Beard (author) (born 1967), English writer"]}, {"page": "Richard Beard (Photographer)", "response": ["#REDIRECT Richard Beard (photographer) "]}]}}