{"wiki_id": "http://www.wikidata.org/entity/Q7329836", "itemLabel": "Richard Watson", "itemDescription": "(1923-1998) British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Watson_(bishop_of_Burnley)", "wikipedia_page": {"main": "Richard Charles Challinor Watson  (16 February 1923 – 1 March 1998) was an Anglican clergyman who was the seventh Bishop of Burnley from 1970 to 1988. \nBorn in Watford, Hertfordshire, he was the son of Francis William Watson,  and his wife, Alice Madelein Collings-Wells. He was educated at Rugby and New College, Oxford and studied for ordination at Westcott House, Cambridge  before a curacy in Stratford, London . After that he was successively: a tutor at Wycliffe Hall, Oxford; Chaplain of Wadham College, Oxford ; Vicar of Hornchurch; and finally, before his ordination to the episcopate, Rural Dean of Havering. \nHe  married Anna Chavasse, elder daughter of the Bishop of Rochester Christopher Chavasse. He retired to Thame in 1988 and died 10 years later in Bullingdon, Oxfordshire.", "link_mentions": [{"page": "Richard Watson (bishop of Llandaff)", "response": ["thumb|right|200px|Richard Watson", "Richard Watson (1737–1816) was an Anglican bishop and academic, who served as the Bishop of Llandaff from 1782 to 1816. He wrote some notable political pamphlets. In theology, he belonged to an influential group of followers of Edmund Law that included also John Hey and William Paley.", "Watson contributed to the Revolution controversy, with A treatise upon the authenticity of the Scriptures, and the truth of the Christian religion (1792) and most notably in 1796 when he delivered his counterblast to Thomas Paine's The Age of Reason in An Apology for the Bible which he had \"reason to believe, was of singular service in stopping that torrent of irreligion which had been excited by [Paine's] writings\".Anecdotes of the life of Richard Watson, Bishop of Landaff (1817) p. 287. In 1798 he published An Address to the People of Great Britain, which argued for national taxes to be raised to pay for the war against France and to reduce the national debt. Gilbert Wakefield, a Unitarian minister who taught at Warrington Academy, responded with A Reply to Some Parts of the Bishop Llandaff's Address to the People of Great Britain, attacking the privileged position of the wealthy.", "An autobiography, Anecdotes of the life of Richard Watson, Bishop of Landaff, was finished in 1814 and published posthumously in 1817."]}, {"page": "List of Old Rugbeians", "response": ["*Richard Watson, Bishop of Burnley"]}, {"page": "Bishop of Burnley", "response": ["|align=\"center\"| 1970 ||align=\"center\"| 1988 || Richard Watson || "]}, {"page": "Richard Watson", "response": ["Richard Watson may refer to:", "* Richard Watson (Methodist) (1781–1833), British Methodist theologian", "* Richard Watson (bishop of Burnley) (1923–1998), Bishop of Burnley", "* Richard Watson (bishop of Llandaff) (1737–1816), Anglican clergyman and academic", "* Richard Watson (singer) (1903–1968), actor and singer, especially with D'Oyly Carte Opera Company", "* Richard Watson (cricketer) (1921–1987), English cricketer", "* Richard Watson (1840-1921), British painter", "* Richard Watson (philosopher) (1931–2019), American philosopher, speleologist and author", "* Richard Watson (politician) (1800–1852), British Member of Parliament for Canterbury and Peterborough", "* Richard Watson (author) (born 1961), English writer and lecturer known for his books on the future"]}, {"page": "Richard Charles Challinor Watson", "response": ["#REDIRECT Richard Watson (bishop of Burnley)"]}, {"page": "Richard Watson (Bishop of Burnley)", "response": ["#REDIRECT Richard Watson (bishop of Burnley)"]}]}}