{"wiki_id": "http://www.wikidata.org/entity/Q7325213", "itemLabel": "Richard Dinnis", "itemDescription": "English footballer and manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Dinnis", "wikipedia_page": {"main": "Richard R. Dinnis (born 11 December 1942) is an English former football coach and player.\nDinnis played semi-professionally as a centre-half. Little is known of his playing career, but he signed with Bishop Auckland in 1961 after a successful trial. He later went into coaching, and joined Blackburn Rovers as their reserve team coach. He was caretaker manager of the club from 1973 to 1974, remaining as reserve team coach once Gordon Lee was appointed. In 1975, he joined Lee at Newcastle United, becoming the assistant manager. When Lee left the club  in January 1977, Dinnis saw out the rest of the season as caretaker manager. He was appointed manager of Newcastle that summer, but was sacked after a poor start. Dinnis then spent a few years in the North American Soccer League (NASL), firstly as coach of the Philadelphia Fury, and later as assistant coach at the Vancouver Whitecaps. Following a brief return to Blackburn, he then had a multitude of coaching roles for various clubs over the next two decades, including a stint in Saudi Arabia. He also maintained a job as a physical education teacher during this time. Towards the end of the 1990s and throughout the 2000s, Dinnis worked as a football summariser and analyst for BBC Radio Lancashire, commentating on football games in North West England.", "link_mentions": [{"page": "Newcastle United F.C.", "response": ["Harvey bought striker Malcolm Macdonald in the summer of 1971, for a club record transfer fee of £180,000 (equivalent to £2,265,000 in 2021). He was an impressive goal scorer, who led United's attack to Wembley in their 1974 FA Cup Final defeat at the hands of Liverpool. The club also had back to back triumphs in the Texaco Cup in 1974 and 1975. Harvey left the club in 1975, with Gordon Lee brought in to replace him. Lee took the team to the 1976 Football League Cup Final against Manchester City, but failed to bring the trophy back to Tyneside. However, he sold Macdonald to Arsenal at the end of the season, a decision of which Macdonald later said \"I loved Newcastle, until Gordon Lee took over\". Lee left for Everton in 1977, and was replaced by Richard Dinnis."]}, {"page": "Barrow A.F.C.", "response": ["|align=left|Richard Dinnis"]}, {"page": "1977–78 in English football", "response": ["9 November 1977: Newcastle United sack manager Richard Dinnis, as a result of the club's appalling form combined with Dinnis publicly criticising chairman Lord Westwood's running of the club.", "18 November 1977: Bill McGarry is appointed as Newcastle United's new manager, and shakes the club up by immediately announcing that several of the players who threatened strike action to secure the appointment of previous manager Richard Dinnis earlier in the year, in particular Alan Gowling, Tommy Craig and team captain Geoff Nulty, are transfer-listed with immediate effect and will not play for the club again."]}, {"page": "Gordon Lee (footballer)", "response": ["He sold striker Malcolm \"Supermac\" Macdonald to Arsenal for the unusual fee of £333,333.33. His team started the 1976–77 campaign positively, but Lee switched clubs in January 1977. United went on to finish the season in fifth place under the stewardship of Richard Dinnis. During his time at St James' Park, Lee signed Burnley apprentice Kevin Carr and striker Alan Gowling from Huddersfield Town. Though he maintained a respectable record on Tyneside, his functional, workmanlike approach to the game and his \"no stars\" policy, particularly his decision to sell \"Supermac\", made him unpopular with many supporters."]}]}}