{"wiki_id": "http://www.wikidata.org/entity/Q7324993", "itemLabel": "Richard Cullen", "itemDescription": "Australian musician and artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Cullen_(artist)", "wikipedia_page": {"main": "Richard Cullen (born 26 July 1970) is a British animator, designer, director, and screenwriter.", "link_mentions": [{"page": "Darren Hayes", "response": ["On 9 April 2007, Hayes released the album track \"Who Would Have Thought\" from This Delicate Thing We've Made as a teaser track on his official website, as well as his MySpace profile. This was accompanied by an animation for the song created by his partner, animator and director, Richard Cullen. Around April 2007, remixes of the album track \"Step into the Light\" were being played in clubs around the world. The album version of \"Step into the Light\" was released as a teaser on Hayes's official website and MySpace on 30 April 2007.", "Hayes started coming out as gay to friends and the head of his label, Sony, in the early 2000s. He entered into a private marriage ceremony with his boyfriend of two years, Richard Cullen, on 23 July 2005 in London. On 19 June 2006, also in London, they entered into a formal civil partnership. Hayes and Cullen applied for a marriage licence in California, and were married on 15 July 2013, to show their support for those fighting for same-sex marriage rights. Hayes and Cullen live in the United States. Though public speculation about his sexual orientation had been present throughout his career, he kept his personal life private. He announced the event the day prior on his official website. Before the announcement, Cullen's name had appeared on the website as the designer of the cover for Hayes's single \"So Beautiful\"."]}, {"page": "So Beautiful", "response": ["The song was written for Hayes's boyfriend Richard Cullen, whom he married in a civil partnership ceremony in London on 19 June 2006. The song peaked at number 27 on the US Adult Contemporary chart.[ Darren Hayes Adult Contemporary history] It reached number 8 in Darren Hayes' native Australia. The single itself features a different version of the song that did not feature on the album, produced by Robert Conley. This version resembles Hayes's solo work more than the album version does, which sounds more like Savage Garden's work. The single version of the song contains a different introduction and a slightly faster tempo. The album version also appears in edited form on the UK maxi single as \"Spike's Radio Edit\" and is the version used for the video. It was produced by Mark \"Spike\" Stent."]}, {"page": "Darren Hayes discography", "response": ["|Richard Cullen", "|Darren Hayes, Richard Cullen", "|Richard Cullen", "|Richard Cullen"]}, {"page": "Talk Talk Talk (song)", "response": ["The music video for \"Talk Talk Talk\" premiered on Hayes' official YouTube account on 20 June 2011, at a total length of three minutes and three seconds.Archived at Ghostarchive and the Wayback Machine:  Prior to the release of the music video, screenshots and behind-the-scenes footage from the video shoot appeared on Hayes' official website. The music video was released for airplay via British music channels on 24 June 2011.Archived at Ghostarchive and the Wayback Machine:  The video depicts Hayes performing the song in front of a wide variety of different landscapes, all designed by his partner Richard Cullen, who also directed the video."]}, {"page": "This Delicate Film We've Made", "response": ["The DVD was released on 3 February 2009.MusicaFilm.com Retrieved 7 Aug 11 The film is a visual realization of tracks from Hayes' third studio album, This Delicate Thing We've Made. Each track was animated and placed together in a film narrative. The film was produced by Richard Cullen and Damien Hale from the company Pixelfing.EQ Music - Review Retrieved 5 Aug 11 The film has no dialogue and includes minimal sound effects."]}, {"page": "Stupid Mistake", "response": ["The music video for \"Stupid Mistake\" premiered on Hayes' official YouTube account on 5 April 2012, at a total length of three minutes and forty-seven seconds. The music video shows Hayes in a dark room, which appears to be his dressing room, sitting in front of a mirror, whilst dressing himself up as a clown. Once completely in costume, Hayes appears to make his way to the stage to perform the remainder of the song in costume. The video was directed and produced by Richard Cullen, Hayes' husband."]}, {"page": "Richard Cullen", "response": ["Richard Cullen may refer to:", "*Richard Cullen (artist) (born 1970), British animator, designer and director, married to Darren Hayes, previously of Savage Garden", "*Richard Cullen (attorney) (born 1948), former Attorney General of Virginia and U.S. attorney for the Eastern District of Virginia"]}]}}