{"wiki_id": "http://www.wikidata.org/entity/Q7328015", "itemLabel": "Richard Needham", "itemDescription": "British former politician (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Needham", "wikipedia_page": {"main": "Richard Francis Needham, 6th Earl of Kilmorey,  (born 29 January 1942), usually known as Sir Richard Needham, is a British Conservative politician. A Member of Parliament from 1979 to 1997, he served as Under-Secretary of State for Northern Ireland between 1985 and 1992 and as Minister of State for Trade between 1992 and 1995. From January 1961 until April 1977, he was entitled to use the courtesy title Viscount Newry and Mourne.", "link_mentions": [{"page": "Derry", "response": ["Even though the city provides cheap labour by standards in Western Europe, critics have noted that the grants offered by the Northern Ireland Industrial Development Board have helped land jobs for the area that only last as long as the funding lasts. This was reflected in questions to the Parliamentary Under-Secretary of State for Northern Ireland, Richard Needham, in 1990. It was noted that it cost £30,000 to create one job in an American firm in Northern Ireland."]}, {"page": "List of earls in the peerages of Britain and Ireland", "response": ["|36. ||The Earl of Kilmorey||1822||25px||Sir Richard Needham (6th Earl of Kilmorey)||data-sort-value=4|Ireland||"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Richard Needham"]}, {"page": "Stephen O'Brien", "response": ["In 2000, he introduced a Private Member's Bill for Honesty in Food Labelling (country of origin and standards of production). From 1999, O'Brien has served on the Conservative Party's National Membership Committee. Between 1995 and 1999, O'Brien was Chairman of the Public and Parliamentary Affairs Committee of BMP (National Council of Building Materials Producers, latterly the Construction Products Association)constructionproductsassociation.org.uk and sat on BMP's Committee of Management and Strategy sub-committee. He was a trade member of the 1994 mission to Argentina and Brazil with the Rt Hon Sir Richard Needham MP (Minister for Trade). O'Brien was elected a member of the South East Regional Council of the CBI, serving between 1995 and 1998, and sat on the CBI's International Investment Committee and Working Parties on Anti-Corruption (pan-European) and Corporate Governance (UK)."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Richard Needham"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Richard Needham"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Richard Needham"]}, {"page": "Earl of Kilmorey", "response": [" the titles are held by the fifth Earl's eldest son, the sixth Earl, who succeeded in 1977. He does not use his titles and did not use his courtesy title of Viscount Newry and Mourne which he was entitled to from 1969 to 1977, and is known as Sir Richard Needham. He is a former Conservative government minister."]}, {"page": "Andrew Neil", "response": ["According to Neil, he was replaced as Sunday Times editor in 1994 because Murdoch had become envious of his celebrity. Many years later, in November 2017, former Conservative cabinet minister Kenneth Clarke said Neil had been removed because Neil's article about corruption in the Malaysian government of Mahathir Mohamad conflicted with Murdoch's desire to acquire a television franchise in the country. The Malaysian prime minister at the time told Clarke on a ministerial visit that he had achieved Neil's sacking after a telephone conversation with Murdoch. The conflict between Neil and Mohamad did become public knowledge at the time. The British minister of state for trade Richard Needham criticised Neil and the newspaper for potentially putting thousands of jobs at risk."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Richard Needham (b. 1942)"]}, {"page": "Laganside Corporation", "response": ["The Department of the Environment-commissioned Laganside Concept Plan was completed in March 1987, an initiative of Chris Patten and Richard Needham, two Northern Ireland Office ministers.  To deliver this plan, Laganside Ltd. was established in October 1987 as an interim measure; the Laganside Development Order (Northem Ireland) 1989 established the Laganside Corporation in May 1989."]}, {"page": "North Wiltshire (UK Parliament constituency)", "response": ["| Richard Needham"]}]}}