{"wiki_id": "http://www.wikidata.org/entity/Q7329334", "itemLabel": "Richard Symonds", "itemDescription": "English academic and civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Symonds_(academic)", "wikipedia_page": {"main": "Richard Symonds (2 October 1918 – 15 July 2006) was an English academic and civil servant.\nHe was born in Oxford, the son of neurologist Sir Charles Symonds and Janet Poulton. He was educated at Cothill House and Rugby School and gained a scholarship to Corpus Christi College, Oxford. When an undergraduate he went to Spain with Edward Heath and a few other undergraduates during their Civil War and experienced air raids there. After leaving Oxford University he joined the Friends' Ambulance and drove ambulances during the London blitz.  He was also in charge of the above-ground air-raid shelters.\nWhen the Japanese were threatening India with air raids, he was sent by the Friends' Ambulance to advise because of the expertise he had already gained.In 1947, Symonds returned to India to work with Partition refugees.  After contracting typhoid, he was brought, at the insistence of Mahatma Gandhi, to Birla House in New Delhi, where he spend several weeks recuperating under Gandhi's care.Richard Symonds served in the United Nations and was Resident Representative in various countries including Sri Lanka (then Ceylon), Greece, Yugoslavia and Tunisia.\nAfter a period as a professorial fellow at Sussex University, he returned to Oxford and to Queen Elizabeth House. He became a senior associate member of St Antony's College.  He set up the United Nations Career Records Project, based at St Antony's.  It was later taken over by the Bodleian Library.\nSymonds was the author of many books. His first was The Making of Pakistan published by Faber and Faber and was a best-seller. His last book was In the Margins of Independence, a semi-autographical account of his life as a relief worker on the Indian continent.\nSymonds was married three times; firstly to Anne Harrisson (marriage dissolved 1948); secondly to Juanita Ellington (died 1979); thirdly to Ann Hazel Spokes.\n\n", "link_mentions": [{"page": "Partition of India", "response": ["Some critics allege that British haste led to increased cruelties during the partition.Stanley Wolpert, 2006, Shameful Flight: The Last Years of the British Empire in India, Oxford University Press,  Because independence was declared prior to the actual partition, it was up to the new governments of India and Pakistan to keep public order. No large population movements were contemplated; the plan called for safeguards for minorities on both sides of the new border. It was a task at which both states failed. There was a complete breakdown of law and order; many died in riots, massacre, or just from the hardships of their flight to safety. What ensued was one of the largest population movements in recorded history. According to Richard Symonds, at the lowest estimate, half a million people perished and twelve million became homeless."]}, {"page": "Symonds", "response": ["*Richard Symonds (academic) (1918–2006), British UN administrator and academic", "*Richard Symonds (diarist) (1617–1692?), English royalist and Civil War diarist"]}, {"page": "Cothill House", "response": ["*Richard Symonds, civil servant."]}, {"page": "Charles Symonds", "response": ["He qualified as a Member of the Royal College of Surgeons (MRCS) and Licentiate of the Royal College of Physicians (LRCP) early in 1915, and was then commissioned into the Royal Army Medical Corps.  He was initially attached to the Royal Flying Corps at Farnborough, gaining his first experience of aviation medicine.  In this role he also regularly visited Aldershot where he worked with Edgar Adrian, a neurologist, and this was when he decided to specialise in neurology himself. He married Janet (née Palmer), daughter of Edward Bagnall Poulton in 1915, they were to have two sons, one of whom was the political satirist Richard Symonds. After his MRCP in 1916 he returned to France with 101 Field Ambulance and medical officer to 1st battalion, the Middlesex Regiment, and was promoted temporary captain on 8 May 1916, He resigned his commission on the grounds of ill-health contracted on active service on 2 February 1919."]}, {"page": "Richard Symonds", "response": ["Richard Symonds may refer to:", "*Richard Symonds (academic) (1918–2006), writer and United Nations development officer", "*Richard Symonds (diarist) (1617–1660), English royalist and antiquary", "*Richard Symonds (footballer) (born 1959), Norwich City F.C.  footballer", "*Richard Symonds-Tayler (1897–1971), Royal Navy officer"]}, {"page": "Ann Spokes Symonds", "response": ["In 1980 she married the United Nations official and historian Richard Symonds (1918–2006)The TelegraphObituary of Richard Symonds and was henceforth known as Ann Spokes Symonds.", "* Follow Me: A Dog's View of the Gospel Story (with Richard Symonds)."]}, {"page": "Anne Symonds", "response": ["In May 1940, she married an Oxford friend, Richard Symonds, who was sent to India with the Cripps Mission. With the Quakers, she set up a home for evacuee children in Torquay, and then worked briefly with her cousin Tom Harrisson on Mass Observation. Later, she was given a job at the Ministry of Information, working under Arthur Gore, 8th Earl of Arran. As the war in Europe ended, she was dispatched to Austria, working in Vienna and Carinthia on copy for Austrian newspapers, where she met the executioner Albert Pierrepoint. In 1945, she wrote a book as “Anne Damer” with Jack Denton Scott, called Too Lively to Live."]}]}}