{"wiki_id": "http://www.wikidata.org/entity/Q7322910", "itemLabel": "Riccardo Gabbiadini", "itemDescription": "English footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Riccardo_Gabbiadini", "wikipedia_page": {"main": "Riccardo Gabbiadini (born 11 March 1970) is a Welsh-born English former footballer. He is the brother of former player Marco Gabbiadini, and played his solitary game for Sunderland alongside his brother in the 1988-89 Second Division season.In January 1994 Gabbiadini signed for Sligo Rovers in the League of Ireland First Division. Under manager Willie McStay, he was a key member of the team that won the 1993–94 League of Ireland First Division title and League of Ireland First Division Shield, before beating four Premier Division sides en route to winning the FAI Cup. His best moment of the campaign was an audacious chipped goal in a crucial away game against Athlone Town near the end of the season. The win enabled Sligo to leapfrog Athlone Town, and they held on to take the title. Scored two goals in eight league appearances for Sligo.\nIn the Northern section of Masters Football 2011 he represented Sunderland along with brother Marco however he failed to score and Sunderland failed to qualify from the group stages. The Sunderland 'Masters 2011' team also included Sean Musgrave, Martin Gray, Lee Howey, Martin Smith, Marco Gabbiadini, Chris Makin and Brian Atkinson.", "link_mentions": [{"page": "Riccardo", "response": ["*Riccardo Gabbiadini, Welsh footballer"]}, {"page": "Gabbiadini", "response": ["*Riccardo Gabbiadini (born 1970), Welsh footballer"]}, {"page": "List of people from Newport", "response": ["* Riccardo Gabbiadini"]}, {"page": "Ricardo Gabbiadini", "response": ["#REDIRECT Riccardo Gabbiadini"]}, {"page": "1993–94 League of Ireland First Division", "response": ["The First Division was contested by 10 teams and Sligo Rovers F.C. won the division. Under player manager Willie McStay and with a team that also included Riccardo Gabbiadini and Eddie Annand, Rovers also completed a treble when they won the First Division Shield and the FAI Cup. "]}]}}