{"wiki_id": "http://www.wikidata.org/entity/Q7329948", "itemLabel": "Richard Whiting", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Whiting_(rugby_league)", "wikipedia_page": {"main": "Richard Whiting (born (1984-12-20)20 December 1984), also known by the nickname \"Superman\", is an English former professional rugby league footballer who last played for the Toronto Wolfpack in the Kingstone Press Championship. Able to play in a variety of positions, he was considered a utility player.Previously playing in the Championship for the Featherstone Rovers and the Leigh Centurions, he spent most of his professional career in the Super League with Hull FC, with whom he won the 2005 Challenge Cup, and was named Super League's Young Player of the Year in 2005.", "link_mentions": [{"page": "Richard Whiting", "response": ["Richard Whiting may refer to:", "* Richard Whiting (abbot) (1461–1539), last Abbot of Glastonbury Abbey before the Dissolution of the Monasteries", "* Richard Whiting (rugby league) (born 1984), English rugby league player"]}, {"page": "Fuifui Moimoi", "response": ["Moimoi left Leigh once the club was promoted to the Super League to join the newly founded Toronto Wolfpack in Kingstone Press League 1 and rejoined former teammates Liam Kay, Greg Worthington, Jonny Pownall, Bob Beswick, Andrew Dixon, Richard Whiting and Jacob Emmitt as well as coach Paul Rowley. On 18 January 2018, it was reported that Moimoi, along with teammates Ryan Bailey and David Taylor, parted ways with the club by \"mutual agreement\" following a preseason training camp in Portugal. It was later reported that the players had twice missed curfew during the trip."]}, {"page": "2005 Challenge Cup", "response": ["Katherine Jenkins performed at the match which was on 27 August at Millennium Stadium, Cardiff and attended by 74,213 spectators. Leeds came to the final 4/1 favourites to win and stamped their authority on the game in the early stages with a penalty try which was converted by Kevin Sinfield. Hull fought back with a try from Motu Tony converted by Danny Brough. Hull took the lead for the first time through Gareth Raynor's try in the corner after a superb pass by Nathan Blacklock. Brough converted brilliantly to make the score 12–6. Leeds fought back and a try from Danny Ward was converted by Sinfield to draw the scores level. A dreadful Marcus Bai error in his own in-goal area as he tried to keep the ball alive gifted Richard Whiting a try for Hull which was converted by Brough. Minutes later Brough added a drop goal to make the score 19–12 to Hull. A Mark Calderwood converted try set up a tense finish with the score at 19–18.", "* 4. Richard Whiting"]}, {"page": "Richard Whiting (Rugby league footballer)", "response": ["#REDIRECT Richard Whiting (rugby league)"]}, {"page": "2006 Super League Grand Final", "response": ["| style=\"text-align:center;\"| Richard Whiting"]}, {"page": "Richard Whiting (Rugby League player)", "response": ["#REDIRECT Richard Whiting (rugby league)"]}, {"page": "Featherstone Lions", "response": ["*Richard Whiting"]}, {"page": "Man of Steel Awards", "response": ["| Richard Whiting"]}, {"page": "2009 Hull FC season", "response": ["|Richard Whiting"]}]}}