{"wiki_id": "http://www.wikidata.org/entity/Q7323276", "itemLabel": "Rich Good", "itemDescription": "guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rich_Good", "wikipedia_page": {"main": "Rich Good (born 17 June 1974) is a British musician and recording artist. His first recognized musical work was as a songwriter and founding member of San Francisco band The Pleased, alongside Joanna Newsom, Noah Georgeson, Genaro Vergoglini, Luckey Remington and Jason Clark.", "link_mentions": [{"page": "The Psychedelic Furs", "response": ["In 2006, Richard Butler released a solo album, Richard Butler. Since re-forming in 2001, the band continued to tour worldwide. The current Psychedelic Furs touring line-up includes Richard Butler, Tim Butler, Williams, Amanda Kramer and Rich Good.", "* Rich Good – guitars (2009–present)"]}, {"page": "Golden Shoulders", "response": ["Golden Shoulders is a band from Nevada City, California. Formed in 2001 by songwriter Adam Kline, the group operates with a rotating lineup and has featured significant contributions from such notables as Joanna Newsom (who sang and played piano on the first Golden Shoulders album, Let My Burden Be, before going on to international acclaim), Todd Roper and Greg Brown (Cake, Deathray), Rich Good (the Psychedelic Furs, the Pleased), Dan Elkan (Broken Bells, Hella), Josh Klinghoffer (Red Hot Chili Peppers, John Frusciante, PJ Harvey, Beck), Rusty Miller (Jackpot), Jonathan Hischke (Dot Hacker), Rob Kieswetter (Bobby Birdman), Hunter Burgan (AFI), songwriter Brett Shady, drummer Neal Morgan, and more.  A complete, current list of contributors can be found here."]}, {"page": "The Pleased", "response": ["The band consisted of members Noah Georgeson (as lead vocalist and guitarist), Rich Good (as vocalist and guitarist), Genaro Vergoglini (as drummer), Luckey Remington (as bassist), and Joanna Newsom and Jason Clark (as keyboardists)."]}, {"page": "Astrological Straits", "response": ["*Rich Good – design"]}, {"page": "Rachel Fannan", "response": ["As a solo artist, Fannan has shared the stage with other prominent musicians such as Hunter Burgan (AFI), Carla Azar (Autolux), Rich Good (Psychedelic Furs), and Dash Hutton (Haim and Mini Mansions).", "Other musicians that have previously played with the group include Amy Aileen Wood, Jon Sortland (Cigar, Broken Bells), Rich Good (Kings & Queens, Psychedelic Furs), Evan Weiss (Slang Chickens, Wires on Fire), Dash Hutton (Slang Chickens, Wires on Fire, Papa)."]}, {"page": "Made of Rain", "response": ["When the band reunited in 2000, they had intended on recording new material but principal songwriter Richard Butler did not feel confident in any newly written songs until six months before prior to the sessions for Made of Rain. It is the first studio release by the group since 1991's World Outside and was preceded by lead single \"Don't Believe\" on 31 January 2020. The album was initially scheduled to be released on 1 May, but was delayed until 31 July due to logistical issues stemming from the COVID-19 pandemic. The album is the band's first with members Rich Good (formerly of The Pleased, who joined in 2009) and Amanda Kramer (formerly of Information Society, who joined in 2002).", "*Rich Good – guitar, production"]}]}}