{"wiki_id": "http://www.wikidata.org/entity/Q7326444", "itemLabel": "Richard Hickmet", "itemDescription": "British politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hickmet", "wikipedia_page": {"main": "Richard Saladin Hickmet (born 1 December 1947 in Hammersmith, London) is a British Conservative Party politician.", "link_mentions": [{"page": "1987 United Kingdom general election", "response": ["|Richard Hickmet"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Richard Hickmet"]}, {"page": "United Kingdom by-election records", "response": ["*1990 Eastbourne by-election: Richard Hickmet fails to defend the seat for the Conservatives, after publicly stating that for electors not to support him would be a moral victory for the Provisional Irish Republican Army."]}, {"page": "Richard Saladin Hickmet", "response": ["#REDIRECT Richard Hickmet"]}, {"page": "1990 Eastbourne by-election", "response": ["The result was a victory for the Liberal Democrat candidate David Bellotti, who defeated former Conservative MP Richard Hickmet by a majority of 4,550 votes and with more than half the votes cast.  The loss came as a shock to many Conservatives who had expected (not least given the circumstances under which the by-election was held, as well as the fact that it had been retained by a majority of more than 16,000 votes in 1987) that they would retain the seat. Conservative MP Ann Widdecombe sent a message to voters saying that the IRA would be \"toasting their success\".The Guardian :Ask Aristotle, Andrew Roth, 20 March 2001"]}, {"page": "Glanford and Scunthorpe (UK Parliament constituency)", "response": ["| Richard Hickmet"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Richard Hickmet"]}, {"page": "List of British Turks", "response": ["*Richard Hickmet, Conservative MP in 1983-87 (Turkish Cypriot origin)"]}, {"page": "List of Turkish Cypriots", "response": ["*Richard Hickmet, British-born Conservative MP in 1983-87 (Turkish Cypriot father)"]}, {"page": "British Cypriots", "response": ["Many Turkish Cypriots have also contributed to the arts, literature, music, sciences, sports and politics in the UK. Mustafa Djamgoz is Professor of Cancer Biology at Imperial College London and Chairman of the College of Medicine’s Science Council; Tracey Emin, CBE, (Turkish Cypriot father) is an artist and a  Royal Academician of the Royal Academy of Arts; Touker Suleyman is a fashion retail entrepreneur and a \"dragon\" on Dragon's Den; Hussein Chalayan, MBE, is the winner of the British Designer of the Year in 1999 and 2000; Selin Kiazim is a celebrity chef and winner of the Great British Menu; Ramadan Güney was the founder of the first Turkish mosque in the UK (Shacklewell Lane Mosque) and former owner of the UK's largest cemetery Brookwood Cemetery; Richard Hickmet was the first British-Turkish Cypriot politician who was a Conservative MP in 1983–87; Meral Hussein-Ece, OBE, is the first Turkish Cypriot member of the House of Lords; Alp Mehmet, MVO, was the first of two foreign-born politicians to be appointed ambassador by the UK, having served in Iceland in 2004; and Emma Edhem is a lawyer and councilwoman of the City of London Corporation. In music, notable performers include Erol Alkan; Işın Karaca (Turkish Cypriot mother) Ziynet Sali and B Young. Notable sportspeople include Paralympic swimmer Dervis Konuralp (Turkish  Cypriot father); boxing trainer Adam Booth (Turkish Cypriot father); snooker player Michael Georgiou; and numerous football players, including Muzzy Izzet and Colin Kazim-Richards who have played for the Turkish national football team; Billy Mehmet who plays for the Turkish Cypriot national football team; and Rhian Brewster (Turkish Cypriot mother) who currently plays for the England national under-21 football team."]}, {"page": "List of British people of Cypriot descent", "response": ["*Richard Hickmet, Conservative MP in 1983-87"]}, {"page": "Hickmet, Richard", "response": ["#redirectRichard Hickmet"]}]}}