{"wiki_id": "http://www.wikidata.org/entity/Q7325121", "itemLabel": "Richard Davison", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Davison", "wikipedia_page": {"main": "Richard Davison (1796 – 20 February 1869) was a Belfast solicitor and Conservative politician.Davison was Member of Parliament (MP) for Belfast from 1852 to 1860, when he resigned his seat. A defender of the established church in Ireland, in 1863 Davison read a paper 'On the present position of the Irish Church' to the 5th annual conference of the united dioceses of Down, Connor and Dromore.", "link_mentions": [{"page": "Charles Lanyon", "response": ["This house was designed and built in 1850 for Richard Davison an MP, on the site of another MP, Samuel Getty, who had a gentleman's cottage on the site.  It was named \"The Abbey\" because it was on the site of an ancient Cistercian Abbey which stood nearby from 1215 to 1925.  Its entrance is very like Abbeydene, but with no pillars."]}, {"page": "Belfast (UK Parliament constituency)", "response": ["|rowspan=\"2\" | Richard Davison"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Richard Davison; MP for Belfast (1852–1860)"]}, {"page": "Richard Davidson (disambiguation)", "response": ["*Richard Davison (racing driver) in 1984 Australian Grand Prix", "*Richard Davison (1796–1869), MP for Belfast", "*Richard Davison (equestrian) (born 1955), dressage rider"]}, {"page": "Richard Davison (MP)", "response": ["#REDIRECT Richard Davison"]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Richard Davison"]}, {"page": "Davison, Richard", "response": ["#redirectRichard Davison"]}, {"page": "Whiteabbey Hospital", "response": ["The Abbey was designed by the renowned architect Charles Lanyon in 1850 for Richard Davison, the Conservative MP for Belfast at the time. The house is a large two storey mansion with an Italian architectural style. Charles Lanyon bought the house himself in 1862 and lived in the house with his family until his death in 1889. Following Lanyon's death, the house was sold at auction in Belfast, and lay derelict until 1897 when it was purchased by the Granville Hotel Company, who intended to convert the house into a private tuberculosis treatment centre. By the turn of the century, tuberculosis was the most pressing health problem in the UK and Ireland, but the hospitals of the time were unable to cope with the volume of patients suffering from the disease. Most TB patients were nursed in cramped, crowded hospital wards. It was soon realised that Belfast needed a dedicated hospital for the treatment of tuberculosis, and in 1904 The Abbey was purchased by Belfast Union to function as a sanitorium."]}]}}