{"wiki_id": "http://www.wikidata.org/entity/Q7324921", "itemLabel": "Richard Cottrell", "itemDescription": "British theatre director", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Cottrell", "wikipedia_page": {"main": "Richard Cottrell (born 15 August 1936) is an English theatre director. He has been the Director of the Cambridge Theatre Company and the Bristol Old Vic in England, and of the Nimrod Theatre in Sydney, Australia. He has also directed for the Royal Shakespeare Company, the Chichester Festival, the Stratford Shakespeare Festival in Stratford, Ontario, the National Theatre of Portugal, and other theatre companies around the world.\nCottrell is also a translator of plays, and an author of a book on art appreciation.\n\n", "link_mentions": [{"page": "Ian McKellen", "response": ["After four years in regional repertory theatres, McKellen made his first West End appearance, in A Scent of Flowers, regarded as a \"notable success\". In 1965 he was a member of Laurence Olivier's National Theatre Company at the Old Vic, which led to roles at the Chichester Festival. With the Prospect Theatre Company, McKellen made his breakthrough performances of Richard II (directed by Richard Cottrell) and Marlowe's Edward II (directed by Toby Robertson) at the Edinburgh festival in 1969, the latter causing a storm of protest over the enactment of the homosexual Edward's lurid death."]}, {"page": "Richard II (play)", "response": ["The play had limited popularity in the early twentieth century, but John Gielgud exploded onto the world's theatrical consciousness, through his performance as Richard at the Old Vic Theatre in 1929, returning to the character in 1937 and 1953 in what ultimately was considered as the definitive performance of the role. Another legendary Richard was Maurice Evans, who first played the role at the Old Vic in 1934 and then created a sensation in his 1937 Broadway performance, revived it in New York in 1940 and then immortalised it on television for the Hallmark Hall of Fame in 1954. In England, Paul Scofield, who played it at the Old Vic in 1952, was considered the definitive Richard of more modern times. In the 1968–1970 seasons of the Prospect Theatre Company, Ian McKellen made a breakthrough performance as Richard, opposite Timothy West as Bolingbroke. The production, directed by Richard Cottrell, toured Britain and Europe, featuring in the Edinburgh Festival in 1969 and on BBC TV in 1970. In 1974, Ian Richardson and Richard Pasco alternated the roles of Richard and Bolingbroke in a production from John Barton at the Royal Shakespeare Theatre: thirty years later this was still a standard by which performances were being judged. One of the most accessible versions was the 1978 television production by the BBC of the play, shown as part of \"The Shakespeare Plays\" (a several years-long project to put all of Shakespeare's plays on tape). This version, still available on DVD, starred Derek Jacobi as Richard, with John Gielgud making an appearance as John of Gaunt. In 1997, Fiona Shaw played the role as a man. More recently, the play was staged by Trevor Nunn in modern costume at the Old Vic in 2005, with Kevin Spacey in the title role, and by Michael Grandage at the Donmar Warehouse in 2011–12 with Eddie Redmayne in the title role."]}, {"page": "A Room with a View", "response": ["The novel was first adapted for the theatre by Richard Cottrell with Lance Severling for the Prospect Theatre Company, and staged at the Albery Theatre on 27 November 1975 by directors Toby Robertson and Timothy West."]}, {"page": "Timothy West", "response": ["* Richard II and Edward II, as Bolingbroke and Young Mortimer, with Ian McKellen as the kings, Prospect Theatre Company, Edinburgh Festival, International tour and Piccadilly Theatre, Dir Richard Cottrell/Toby Robertson, 1969"]}, {"page": "Daniel Day-Lewis", "response": ["| Richard Cottrell", "| Richard Cottrell", "| Richard Cottrell"]}, {"page": "BBC Television Shakespeare", "response": ["Although An Age of Kings, which was the most expensive and ambitious Shakespearean production up to that point, was a critical and commercial success, The Spread of the Eagle was not, and afterwards, the BBC decided to return to smaller scale productions with less financial risk. In 1964, for example, they screened a live performance of Clifford Williams' Royal Shakespeare Company (RSC) production of The Comedy of Errors from the Aldwych Theatre, starring Ian Richardson as Antipholus of Ephesus and Alec McCowen as Antipholus of Syracuse. 1964 also saw the broadcast of Hamlet at Elsinore, directed by Philip Saville and produced by Peter Luke. Starring Christopher Plummer as Hamlet, Robert Shaw as Claudius and June Tobin as Gertrude, the entire play was shot on-location in Helsingør at the real Elsinore Castle. In 1970, they screened The Tragedy of Richard II, sourced from Richard Cottrell's touring production, and starring Ian McKellen as Richard and Timothy West as Bolingbroke."]}, {"page": "Three Sisters (play)", "response": ["| 29 September 1979 || The Other Place, Stratford-upon-Avon || Trevor Nunn || Version by Richard Cottrell"]}, {"page": "Bristol Old Vic", "response": ["|Richard Cottrell"]}, {"page": "Ian Charleson", "response": ["In late 1974, he played the title role in Hamlet with the Cambridge Theatre Company, where he had previously performed that year in The School for Scandal and Six Characters in Search of an Author, and the production went on tour into 1975.\"Hamlet\". In: Johns, Eric (ed). \"Plays of the Year 1974\",  British Theatre Review 1974. Vance-Offord Publications Limited, 1975. pp. 137–138. \"Directed with clarity and firmness by Richard Cottrell, it had a very well played Prince in Ian Charleson, who was especially impressive in his speaking of the great soliloquies. ... Presented by the Cambridge Theatre Company at the Cambridge Arts Theatre on 17 September 1974.\" His performance of Hamlet garnered good reviews; nevertheless Charleson felt he had not done the notoriously difficult role complete justice.", "| Richard Cottrell", "| Richard Cottrell"]}, {"page": "William de Ros, 6th Baron Ros", "response": ["The text of Richard II is often cut by directors, either to tighten the plot or to avoid problems with weak casting, and the role of Lord Ross is occasionally omitted. For example, in the 1981 Bard Productions film, Ross' part was given to the Exton character, and in the Erickson-Farrell 2001 film, Ross was one of seven characters dropped, his part again given to Exton. He has still been played by several actors in post-war performances. At the 1947 Avignon Festival, Pierre Lautrec played to Jean Vilar's Richard; Vilar also directed the play. The same year, Walter Hudd directed it with the Shakespeare Memorial Theatre at Stratford-upon-Avon, with Joss Ackland as Ross to Robert Harris' Richard. Four years later, Anthony Quayle—also with the SMT—directed Michael Redgrave as the King, Harry Andrews as Bolingbroke, and Philip Morant in the part of Lord Ross. In 1968 the Prospect Theatre toured Richard II in two legs. Directed by Richard Cottrell and with Ian McKellen and Timothy West as Richard and Bolingbroke respectively, Ross was played by Peter Rocca on the first half of the tour and David Calder on the second. In 1973, Charles Keating played Ross to Richard Pasco and Ian Richardson's king and Bolingbroke, in John Barton's production. Ariane Mnouchkine's 1984 production for the Théâtre du Soleil cast Robert Gourp as Ross, and five years later the English Shakespeare Company's production—directed by Michael Bogdanov—had John Dougall playing Ross to Michael Pennington's Richard. Keith Dunphy played Ross in Steven Pimlott's RSC production in 2000, to Sam West's Richard and David Troughton's Bolingbroke. A production at the Globe Theatre in 2015 from Tim Carroll saw Mark Rylance as the King and Ekow Quartey as Ross. Jonathan Slinger played the King in Michael Boyd's 2007 RSC production, and Rob Carroll played Ross. Joshua Richards played Ross in Gregory Doran's 2013 production, with David Tennant in the lead role."]}, {"page": "Edward Bond", "response": ["*Anton Chekhov : Three Sisters (1966), with Richard Cottrell, for William Gaskill"]}, {"page": "Do the Bartman", "response": ["* Richard Cottrell - recording engineer"]}, {"page": "Annette Badland", "response": ["After drama school, Badland joined Ian McKellen's Actors' Company at the Cambridge Arts Theatre; her first professional productions were in director Noel Willman's Three Arrows  (by Iris Murdoch) and Richard Cottrell's Ruling the Roost (Georges Feydeau)  in October 1972. After pantomime (Toad of Toad Hall at the Dukes Theatre, Lancaster), at the end of that year she moved on to the 1973 season with the Royal Shakespeare Company at Stratford. Her Audrey in As You Like It was considered an auspicious debut in a leading company.", "|Richard Cottrell"]}, {"page": "Michael Culver", "response": ["*Charles in Howards End adapted by Lance Sieveking in collaboration with Richard Cottrell from the novel by E. M. Forster; toured 1967. Directed by Dacre Punt."]}, {"page": "Deborah Norton", "response": ["| Waiting for the Parade || John Murrell || Richard Cottrell || Lyric Theatre (Hammersmith)"]}, {"page": "Anthony May", "response": ["At the Bristol Old Vic he played Leonidik in Arbuzov's The Promise, and another production of Macbeth, this time playing Banquo, directed by Richard Cottrell. A film of Chekov's Zinotchka. An Australian film They Ran Before the Wind, filmed in the South Seas, in which Anthony played Fletcher Christian in a story of what happened after the mutiny on the Bounty."]}, {"page": "Sam Walters", "response": ["*The Game Hunter(Monsieur Chasse farce, Feydeau, translated by Richard Cottrell), April 2003"]}, {"page": "Chichester Festival production history", "response": ["*The Rivals by Richard Brinsley Sheridan, directed by Richard Cottrell", "*The School for Scandal by Richard Brinsley Sheridan, directed by Richard Cottrell", "*Lady Windermere's Fan by Oscar Wilde, directed by Richard Cottrell"]}, {"page": "Robert Eddison", "response": ["When being interviewed by McKellen's biographer he reminisced that “It was a wonderful time… At the Piccadilly Theatre there were always queues at the Box Office and the younger members of the cast got very excited and I thought, poor things, they have been deprived” Eddison loved being in the company and had “the greatest admiration and affection for Ian. The Duke of York was a dull part, really, but I loved playing it - and Richard Cottrell exercised his considerable persuasive powers [as director] on me to do this and Lightborn. I was quite happy to do that as I thought it was the only possible part for me - I couldn’t really see myself as one of those Lancastrian barons.”Joy Leslie Gibson (1986) Ian McKellen: A Biography, Weidenfeld and Nicolson, London "]}, {"page": "Samantha Spiro", "response": ["* Glyn & ‘It’ (Clara Bow)  d: Richard Cottrell Yvonne Arnaud & tour"]}, {"page": "Cambridge Arts Theatre", "response": ["The directors of the company were Richard Cottrell (1969–1975), Robert Lang (1975–1976), Jonathan Lynn (1976–1981), Bill Pryde (1981–1988), Robin Midgley (1988–1991), and Mike Alfreds (1991–1999). The company's headquarters were moved to London and its name was changed to \"Method and Madness\" in 1995.Mike Alfreds In 1999 the company dissolved in the face of declining interest in quality drama in the provinces.Christiansen, Rupert. Cambridge Arts Theatre: Celebrating Sixty Years. Granta Editions, 1996. p. 78."]}, {"page": "Rebecca Massey", "response": ["| Richard Cottrell"]}, {"page": "Three Hours After Marriage", "response": ["In 1996, Richard Cottrell directed a Royal Shakespeare Company production at the Swan Theatre. Dr. Fossil was played by Clive Francis, his new wife was played by Jane Gurnett, with her two persistent suitors Plotwell (Richard McCabe) and Underplot (Adam Godley). This production won two Laurence Olivier Awards for Best Set Designer and Best Costume Designer for Tim Goodchild in 1998."]}, {"page": "Paul Charlier", "response": ["* Ying Tong - Dir: Richard Cottrell. Sydney Theatre Company. (2007)"]}, {"page": "Iain Mackintosh", "response": ["In 1962 Sweeting and Mackintosh were joined on the board of Prospect by Richard Cottrell, who was associate director from 1964 to 1969, and by Toby Robertson, who became artistic director in 1964, following his production of The Provok’d Wife with Eileen Atkins. The Provok’d Wife opened at the 350-seat mobile Century Theatre which was parked by Mackintosh in an idyllic setting beside the Thames for the summer of 1963 while the Oxford Playhouse was closed for remodelling. The production was the first show for over a century at the 1788 Georgian Theatre Royal Richmond, Yorkshire. After Richmond The Provok’d Wife transferred to the Vaudeville Theatre London."]}, {"page": "Prospect Theatre Company", "response": ["The Prospect Theatre Company was an English company founded, as Prospect Productions, in 1961. Based at the Arts Theatre, Cambridge from 1964 until 1969, the company, with Toby Robertson as artistic director and Richard Cottrell as associate director, toured both nationally and internationally with a mainly classical repertoire, providing notable appearances of such actors as Ian McKellen and Timothy West. The company became closely associated with the Edinburgh Festival after its first appearance there in 1967. Separating from the Arts Theatre in 1969, the company, renamed The Prospect Theatre Company, survived without a permanent base for the next eight years under the direction of Toby Robertson, mounting productions in which Derek Jacobi and Dorothy Tutin made significant appearances. Eventually the company found a new home at London's Old Vic in 1977: two years later it became the Old Vic Theatre Company. Though noted for its exemplary ensemble playing, the company lost its Arts Council of Great Britain funding in 1980 after Timothy West's first season as Robertson's successor, leading to Prospect's demise.", "Iain Mackintosh, Richard Cottrell and Elizabeth Sweeting formed Prospect Productions in 1961 to present a summer season of plays at the Oxford Playhouse. A successful first season led to a further season in 1962. The following year, when the Playhouse closed for renovations, Prospect became a touring company associated with the Century Theatre. Toby Robertson directed the last play of the season, Vanbrugh's The Provoked Wife, with Eileen Atkins and Trevor Martin. The production opened the newly restored Georgian Theatre Royal in Richmond, North Yorkshire, then transferred to the Vaudeville Theatre, London. The success of the Oxford seasons prompted the idea that Prospect should present productions beyond the summer season each year.", "In 1964, with support from the Arts Council of Great Britain and Dr. George Rylands, Prospect became a touring company based at the Arts Theatre, Cambridge, with Toby Robertson as artistic director, Richard Cottrell as associate director, and Iain Mackintosh as administrator. Between 1964 and 1966 Prospect staged 15 productions, presenting well-known plays as well as several rarely performed Classics including Vanbrugh's The Confederacy, with Robert Eddison and Hy Hazell, to celebrate the third centenary of Vanbrugh's birth, and Etherege's The Man of Mode, and a number of new plays. Timothy West joined the Company in 1966 to play Prospero. Later that year Prospect had its first invitation to the Edinburgh Festival.", "In 1969 the Company was asked to extend its touring to the large \"No 1\" theatres in the regions; at the same time the Cambridge Arts Theatre wanted Prospect to help in the formation of a new theatre company. As these two developments pointed in totally different directions with implications of a conflicting scale of work, Richard Cottrell left Prospect to become director of the newly formed Cambridge Theatre Company: Toby Robertson became director of Prospect, and its role as the UK's leading touring company was recognised, with its new name - The Prospect Theatre Company."]}, {"page": "Eilene Hannan", "response": ["She regularly sang with Victoria State Opera including La Boheme (Mimi) 1985 conducted by Richard Divall and Brian Stacey, Directed by John Copley; and Tannhaüser (Venus) 1989 conducted by Richard Divall, directed by Richard Cottrellhttp://richardcottrelldirector.com/directing%20credits.html both productions at the then relatively new State Theatre, Victorian Arts Centre. In 1996 she created the role of Emma in Richard Mills' opera Summer of the Seventeenth Doll with Victoria State Opera.Matthew Westwood, \"Opera world mourns former OA singer\". The Australian, 15 July 2014. Retrieved 15 October 2014"]}, {"page": "Ross O'Hennessy", "response": ["O'Hennessy picked up a career in the theatre and gained his first appearance at Chichester Festival Theatre in a play called The Visit in which he acted opposite Hollywood actress Lauren Bacall which was directed by Terry Hands. With such a big production came a lot of attention for Ross and so he was asked the join The Royal Shakespeare Company where he performed in As You Like It directed by Steven Pimlott, Three Hours After Marriage directed by Richard Cottrell and Troilus and Cressida directed by Ian Judge."]}, {"page": "John Tydeman", "response": ["Even before joining the BBC as a general trainee, following his graduation from Trinity in 1959, Tydeman had received a credit on the BBC Third Programme, as an actor. He appeared in the radio broadcast of the Cambridge University Marlowe Society’s production of Christopher Marlowe's Edward II.Cambridge University Marlowe Society radio broadcast of Christopher Marlowe  Edward II, BBC Third Programme, 31 March 1959, BBC Genome Tydeman played the Archbishop of Canterbury in a cast led by Derek Jacobi as Edward II, and student contemporaries including John Drummond, Clive Swift and Richard Cottrell, directed by Trinity alumnus Toby Robertson. Edward II was broadcast on 31 March 1959, and Tydeman joined the BBC as a general trainee later in the year, working in various parts of the Corporation, until he settled into the Radio Drama department. There he would cut his teeth on productions that would include many episodes of the popular radio soap, The Dales, as well as forays into the classics. His first radio production credit in drama was Operation Toothless, by Tom Waldron, on the BBC Home Service on 20 July 1959.First Tydeman production, BBC Genome,  Operation Toothless, BBC Home Service, 20 July 1959"]}, {"page": "John Sheedy (director)", "response": ["Sheedy has a career working with Australian theatre companies. For Belvoir Street Theatre, Sheedy directed Sarah Kane’s play Blasted, Lawrence Mooney’s Sink or Swim and Patricia Cornelius’ play Love ( 2006 ), Sheedy was also Assistant Director on The Lieutenant of Inishmore with Neil Armfield (2004). Sheedy directed a season of Mark Ravenhill’s play Some Explicit Polaroids at Darlinghurst Theatre. Some Explicit Polaroids and Love were both nominated for Best Independent Production at the 2006 Sydney Theatre Awards. For the Sydney Theatre Company Sheedy was Assistant Director to Richard Cottrell on Ying Tong – A Walk with the Goons, which went on to tour Australia and assisted Julian Meyrick on Doubt for its national tour. Sheedy directed several rehearsed play readings of the winning scripts for the Patrick White awards and directed the season of Storm Boy in 2013 and 2015 at the Sydney Theatre Company."]}, {"page": "Cottrell, Richard", "response": ["#redirectRichard Cottrell"]}, {"page": "Michael Sheasby", "response": ["| Richard Cottrell"]}]}}