{"wiki_id": "http://www.wikidata.org/entity/Q732540", "itemLabel": "John Anster Fitzgerald", "itemDescription": "British artist (1819-1906)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Anster_Fitzgerald", "wikipedia_page": {"main": "John Anster Christian Fitzgerald (1819 – 1906) was a Victorian era fairy painter and portrait artist. He was nicknamed \"Fairy Fitzgerald\" for his main genre. Many of his fairy paintings are dark and contain images of ghouls, demons, and references to drug use; his work has been compared to the surreal nightmare-scapes of Hieronymus Bosch and Pieter Brueghel.", "link_mentions": [{"page": "A Midsummer Night's Dream", "response": ["File:Titania and Bottom John Anster Fitzgerald.JPG|Titania and Bottom by John Anster Fitzgerald", "File:Fitzgerald, John Anster - The Marriage of Oberon and Titania.jpg|The Marriage of Oberon and Titania by John Anster Fitzgerald"]}, {"page": "Fairy", "response": ["The Victorian era was particularly noted for fairy paintings. The Victorian painter Richard Dadd created paintings of fairy-folk with a sinister and malign tone. Other Victorian artists who depicted fairies include John Anster Fitzgerald, John Atkinson Grimshaw, Daniel Maclise, and Joseph Noel Paton. Interest in fairy-themed art enjoyed a brief renaissance following the publication of the Cottingley Fairies photographs in 1917, and a number of artists turned to painting fairy themes."]}, {"page": "List of British painters", "response": ["*John Anster Fitzgerald (c. 1819–1906)"]}, {"page": "John Fitzgerald", "response": ["*John Anster Fitzgerald (died 1906), fairy painter and portrait artist"]}, {"page": "Fairy painting", "response": ["Fairy painting was not exclusively the domain of outside art, however. The work of John Anster Fitzgerald debuted at London's Royal Academy. His work, in the form a series of Christmas-themed fairy illustrations, received wider public visibility in the Illustrated London News. The Scottish artist Joseph Noel Paton exhibited two immensely detailed paintings, The Quarrel of Oberon and Titania and The Reconciliation of Titania and Oberon, based on the popular fairy scenes of A Midsummer Night's Dream. Even Edwin Landseer, sometimes named \"Victoria's favourite artist\", produced a painting of Titania and Bottom in the genre's style, his Scene from A Midsummer Night's Dream."]}, {"page": "William Thomas Fitzgerald", "response": ["Educated at Greenwich, the Royal College of Navarre in the University of Paris and the Inner Temple where his tutor was Vicary GibbsWilliam Thomas Fitz-Gerald -The Annual Biography and Obituary 1830 Longman Rees & Co, London, 1830 he married very late in life to Maria Howorth in December 1826. It appears only one of their children was born after this marriage. They were the parents of the Victorian painter John Anster Fitzgerald."]}, {"page": "Rupert Maas", "response": ["Maas is frequently called upon to provide independent valuations for museums, both domestic and international, and has previously valued individual pictures and entire collections (for example the John Wharlton Bunney 1828-1882 archive) for Acceptance in Lieu. In 2006 Maas was duped into paying £20,000 for a faked art work claimed to be by fairyland painter John Anster Fitzgerald (1823–1906)."]}, {"page": "Great Bookcase", "response": ["Fourteen artists were involved in the decoration of the bookcase; Edward Burne-Jones, John Anster Fitzgerald, Henry Holiday, Stacy Marks, Albert Moore, Thomas Morten, Edward Poynter, Dante Gabriel Rossetti, Charles Rossiter, Frederick Smallfield, Simeon Solomon, William Frederick Yeames, Fred Weeks, Nathaniel Westlake, and Burges himself."]}]}}