{"wiki_id": "http://www.wikidata.org/entity/Q7321812", "itemLabel": "Rhys McWilliams", "itemDescription": "British ice hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhys_McWilliams", "wikipedia_page": {"main": "Rhys McWilliams (born 29 November 1985, Birmingham, England) is an English professional ice hockey player, currently playing with the Coventry Blaze organisation at ENIHL level.  In the year 2000 he began his professional career, making his debut for the Solihull Barons as a young forward having also featured for their U-19 team, the Solihull Knights.  Whilst playing for the Knights, McWilliams managed the astounding total of 55 points in just 17 games.  He went on to become much more of a regular for the Barons in the following season and showed enough promise to play for the England U-18 team.  McWilliams remained in Solihull through the name and league changes, icing 32 times for the Solihull MK Kings.\nDuring the 2002/03 season, McWilliams also played for another local team, the Birmingham Rockets for just six games, but totalled seven points in this brief spell.  McWilliams also made two more appearances for the England U-18 squad.\nThe 2003/04 season proved to be a season of change for McWilliams.  He began the year playing for the Peterborough Phantoms, but after 27 games was spotted by the EIHL club, the Nottingham Panthers.  This was a big step up for McWilliams, and he played only twice during the rest of the season.  The 2004/05 season was again split between the Solihull Kings in the EPL and the Panthers.  During his second spell in Nottingham, McWilliams played in 14 games and managed to grab his first EIHL goal.\nMcWilliams would continue to split seasons between teams in the EPL and the EIHL - whilst mainly icing for the Solihull Barons, he would also spend time again in Nottingham during 2005/06 and playing for the league-winning Coventry Blaze in 2006/07.\nSeeking consistency, McWilliams moved away from the Midlands area and moved further north to sign for the Manchester Phoenix, yet another EIHL team.  Whilst at the Phoenix, McWilliams was re-united with his former Barons team-mate, Nick Whyatt.  In his time at the Altrincham Ice Dome, McWilliams was mainly used as an energy player on the third line.  Despite playing in over 40 games for the Phoenix, McWilliams was released from his Manchester contract by head coach Tony Hand in February 2008.\nAfter being released, McWilliams would return to Coventry, and in the summer of 2008 would once again play for the Coventry Blaze organisation, although this time at ENIHL level.", "link_mentions": [{"page": "Phil Hamer", "response": ["Hamer had impressed at junior level with the Phoenix, and his opportunity came towards the end of the 2007-08 season, with Phoenix head coach Tony Hand's decision to release Rhys McWilliams from the Phoenix roster.  Hamer stepped into the role with relish and started five regular season games for the Phoenix in the 2007-08 season.  His work rate and effort impressed Hand enough to ensure his permanent promotion to the senior squad for the following 2008-09 term. Following several appearances for the Phoenix, Hamer was dropped although he still plays for the ENL side also named Manchester Phoenix."]}, {"page": "McWilliams", "response": ["*Rhys McWilliams (b. 1985), English ice hockey player"]}]}}