{"wiki_id": "http://www.wikidata.org/entity/Q7327955", "itemLabel": "Richard Murphy", "itemDescription": "Irish poet and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Murphy_(poet)", "wikipedia_page": {"main": "Richard Murphy (6 August 1927 – 30 January 2018) was an Anglo-Irish poet.\n\n", "link_mentions": [{"page": "List of English-language poets", "response": ["*Richard Murphy (1927–2018, Ir/SLk)"]}, {"page": "List of poets", "response": ["*Richard Murphy (1927–2018), Irish poet"]}, {"page": "List of Irish people", "response": ["* Richard Murphy – poet, Aosdána"]}, {"page": "Adelaide Festival", "response": ["| Sir Michael Tippett's first opera The Midsummer Marriage; the Israel Philharmonic Orchestra under Zubin Mehta; Roger Woodward's series of Beethoven's 32 piano sonatas performed in 12 days; Compagnie Philippe Genty; Kabuki Theatre, and East by Steven Berkoff.  Prominent authors at Writers' Week included Manning Clark, Barry Humphries and Frank Moorhouse, American writer Chaim Potok and Irish poet Richard Murphy."]}, {"page": "Patrick Kavanagh", "response": ["In 1942 he published his long poem The Great Hunger, which describes the privations and hardship of the rural life he knew well. Although it was rumoured at the time that all copies of Horizon, the literary magazine in which it was published, were seized by the Garda Síochána, Kavanagh denied that this had occurred, saying later that he was visited by two Gardaí at his home (probably in connection with an investigation of Horizon under the Special Powers Act). Written from the viewpoint of a single peasant against the historical background of famine and emotional despair, the poem is often held by critics to be Kavanagh's finest work. It set out to counter the saccharine romanticising of the Irish literary establishment in its view of peasant life. Richard Murphy in The New York Times Book Review described it as \"a great work\" and Robin Skelton in Poetry praised it as \"a vision of mythic intensity\"."]}, {"page": "Penguin Modern Poets", "response": ["#Richard Murphy, Jon Silkin, Nathaniel Tarn"]}, {"page": "George Sutherland Fraser", "response": ["A. Alvarez - Kingsley Amis - W. G. Archer - Patricia Avis - Bernard Bergonzi - Thomas Blackburn - Arthur Boyars - Alan Brownjohn - George Bruce - Charles Causley - Robert Conquest - Hilary Corke - Maurice James Craig - Donald Davie - Paul Dehn - Keith Douglas - Lawrence Durrell - D. J. Enright - Iain Fletcher - Roy Fuller - Robert Garioch - David Gascoyne - W. S. Graham - Thom Gunn - J. C. Hall - Michael Hamburger - Jacquetta Hawkes - John Heath-Stubbs - Geoffrey Hill - John Holloway - Elizabeth Jennings - Peter Johnson - Sidney Keyes - Thomas Kinsella - James Kirkup - Philip Larkin - Laurie Lee - Alun Lewis - Christopher Logue - Rob Lyle - George MacBeth - Norman MacCaig - Mairi MacInnes - Ewart Milne - Richard Murphy - Norman Nicholson - Kathleen Nott - Philip Oakes - Jonathan Price - F. T. Prince - Henry Reed - Anne Ridler - W. R. Rodgers - Alan Ross - E. J. Scovell - Tom Scott - Martin Seymour-Smith - John Short - Jon Silkin - Burns Singer - Robin Skelton - Sydney Goodsir Smith - Bernard Spencer - R. S. Thomas - Terence Tiller - Charles Tomlinson - Constantine Trypanis - John Wain - John Waller - Vernon Watkins - Gordon Wharton - Sheila Wingfield - Diana Witherby - David Wright"]}, {"page": "Penguin poetry anthologies", "response": ["Frank O'Connor - Charles Wolfe - Jeremiah Joseph Callanan - George Darley -- Eugene O'Curry - James Clarence Mangan - Gerald Griffin - Francis Sylvester Mahony - Edward Walsh - George Fox - Samuel Ferguson - Aubrey de Vere - Thomas Davis - William McBurney - Arthur G. Geoghegan - Lady Wilde - John Kells Ingram - Michael Joseph McCann - Thomas Caulfield Irwin - William Allingham - Thomas D'Arcy McGee - John Todhunter - Edward Dowden - John Boyle O'Reilly - Arthur O'Shaughnessy - Emily Lawless - Alfred Perceval Graves - William Larminie - John Keegan Casey - Fanny Parnell - Oscar Wilde - T. W. Rolleston - John Synge - Thomas MacDonagh - Patrick Pearse - Joseph Plunkett - Francis Ledwidge - W.B. Yeats - George William Russell - Oliver St. John Gogarty - Joseph Campbell - Seamus O'Sullivan - Padraic Colum - James Joyce - James Stephens - Austin Clarke - Monk Gibbon - F.R. Higgins - R. N. D. Wilson - Patrick MacDonogh - Ewart Milne - C. Day-Lewis - Padraic Fallon - Bryan Guinness - Patrick Kavanagh - Samuel Beckett - John Hewitt - Louis MacNeice - Denis Devlin - Robert Farren - W. R. Rodgers - W. B. Stanford - Donagh MacDonagh - Sigerson Clifford - Valentin Iremonger - Kevin Faller - Roy McFadden - Padraic Fiacc - Anthony Cronin - Jerome Kiely - Eugene R. Watters - Pearse Hutchinson - Richard Kell - Richard Murphy - John B. Keane - Ulick O'Connor - Basil Payne - Thomas Kinsella - John Montague - Patrick Galvin - Seán Lucy - Richard Weber - Sean O'Meara - James Simmons - James Liddy - Rivers Carew - James McAuley - Desmond O'Grady - Brendan Kennelly - Rudi Holzapfel - Seamus Heaney - Michael Longley - Seamus Deane - Timothy Brownlow - Michael Hartnett - Derek Mahon - Eilean Ni Chuilleanain - John F. Deane - John Ennis - Paul Durcan - Eavan Boland - Hayden Murphy - Tom McGurk - Richard Ryan - Hugh Maxton - Frank Ormsby - Peter Fallon - Paul Muldoon - Thomas McCarthy - Aidan Carl Mathews."]}, {"page": "Oxford poetry anthologies", "response": ["Thomas Wyatt - Henry Howard, Earl of Surrey - Giles Fletcher - Edmund Spenser - Walter Ralegh - Fulke Greville - Philip Sidney - Arthur Gorges - George Chapman - Henry Constable - Samuel Daniel - Michael Drayton - Joshua Sylvester - William Shakespeare - John Davies of Hereford - Thomas Campion - William Alabaster - Barnabe Barnes - John Davies - John Donne - Richard Barnfield - Lord Herbert of Cherbury - William Drummond - Mary Wroth - William Browne - George Herbert - Thomas Carew - William Habington - Edmund Waller - John Milton - Charles Cotton - Philip Ayres - Aphra Behn - Thomas Edwards - Thomas Gray - Thomas Warton - William Cowper - Anna Seward - Charlotte Turner Smith - John Bampfylde - Mary Robinson - William Lisle Bowles - Helen Maria Williams - Thomas Russell - William Wordsworth - Samuel Taylor Coleridge - Mary Tighe - Robert Southey - Charles Lamb - Walter Savage Landor - Ebenezer Elliott - James Henry Leigh Hunt - George Gordon, Lord Byron - John Keble - Percy Bysshe Shelley - John Clare - George Darley - John Keats - Hartley Coleridge - Thomas Hood - William Barnes - Thomas Lovell Beddoes - Elizabeth Barrett Browning - Henry Wadsworth Longfellow - John Greenleaf Whittier - Charles Tennyson Turner - Edgar Allan Poe - Alfred Tennyson, Lord Tennyson - William Bell Scott - Robert Browning - William Edmondstoune Aytoun - Arthur Hugh Clough - Frederick Goddard Tuckerman - Matthew Arnold - William Cory - William Allingham - Sydney Dobell - George Meredith - Dante Gabriel Rossetti - Christina Rossetti - Samuel Butler - John Leicester Warren - Algernon Charles Swinburne - Augusta Webster - Wilfrid Scawen Blunt - Thomas Hardy - Robert Buchanan - Edward Dowden - Robert Bridges - Ada Cambridge - Gerard Manley Hopkins - Louisa Sarah Bevington - Michael Field - Alice Meynell - Digby Mackworth Dolben - William Ernest Henley - Philip Bourke Marston - Robert Louis Stevenson - Oscar Wilde - Agnes Mary Frances Robinson - Francis Thompson - Mary Coleridge - Laurence Hope - Rudyard Kipling - Arthur Symons - William Butler Yeats - Edwin Arlington Robinson - Robert Frost - Edward Thomas - Siegfried Sassoon - Rupert Brooke - Elizabeth Daryush - Robinson Jeffers - Edwin Muir - John Crowe Ransom - Kenneth Leslie - Archibald MacLeish - Edna St. Vincent Millay - Wilfred Owen - Sylvia Townsend Warner - Aldous Huxley - Robert Graves - Charles Hamilton Sorley - Edgell Rickword - Roy Campbell - Kenneth Slessor - Merrill Moore - Patrick Kavanagh - Norman Cameron - William Empson - W. H. Auden - Alec Derwent Hope - Paul Engle - Malcolm Lowry - Roy Fuller - George Barker - Weldon Kees - Dylan Thomas - Gavin Ewart - Charles Causley - Robert Lowell - John Heath-Stubbs - William Meredith - Edwin Morgan - Richard Wilbur - Donald Davie - Philip Larkin - Louis Simpson - James Merrill - Richard Murphy - Peter Porter - Anthony Thwaite - Derek Walcott - Alan Brownjohn - Alistair Elliott - Geoffrey Hill - George MacBeth - Fleur Adcock - Seamus Heaney - Michael Longley - Derek Mahon - Douglas Dunn - Eavan Boland - Susan Wicks - Christopher Reid - Paul Muldoon - Jane Draycott - Carol Ann Duffy - Alan Jenkins - Jamie McKendrick - Simon Armitage - Alice Oswald"]}, {"page": "1927 in Ireland", "response": ["*6 August – Richard Murphy, poet."]}, {"page": "Richard Murphy", "response": ["Richard Murphy may refer to:", "* Richard Murphy (screenwriter) (1912–1993), American film and television writer", "* Richard Murphy (poet) (1927–2018), Irish poet", "* Richard Murphy (architect) (born 1955), Scottish architect", "* Bos Murphy (Richard Murphy, 1924–2000), New Zealand boxer", "* Richard Murphy (rower) (born 1931), American Olympic rower", "* Richard Murphy (American football) (born 1986), American football running back ", "* Richard Murphy (sea captain) (1838–1916), American sea captain in Gloucester, Massachusetts", "* Richard Murphy (marine ecologist) (born 1942), American marine ecologist", "* Richard Murphy (tax campaigner) (born 1958), British campaigner and accountant", "* Richard Murphy (police officer) (fl. 1999), American police officer, involved in shooting of Amadou Diallo"]}, {"page": "Battle of Aughrim", "response": ["The battle was the subject of a 1728 tragic drama by Robert Ashton, The Battle of Aughrim or the Fall of Monsieur St Ruth, which after initial neglect became enormously popular from 1770 onwards into the 19th century. Though the play was intended to celebrate the Williamite victory, and casts Saint-Ruhe firmly in the role of antagonist, it also portrays Sarsfield and his lieutenants as heroic figures and incorporates a \"lament for Catholic patriotism\", so that \"both Catholics and Protestants were attracted to the play for generations\".Wheatley, \"Heroic Palimpsest: Robert Ashton's \"The Battle of Aughrim\" in Eighteenth-Century Ireland / Iris an dá chultúr, v.11 (1996), 54 In 1804 it was noted of Ashton's play that \"a more popular Production never appeared in Ireland; it is in the hands of every Peasant who can read English; and [...] is committed to memory and occasionally recited\".Wheatley (1996), 56 In 1885, artist John Mulvany completed a painting of the battle; it was exhibited in Dublin in 2010.Irish Times 2 Oct. 2010 The Battle of Aughrim was also the subject of a long 1968 poem by Richard Murphy, who noted that he had ancestors fighting on both sides."]}, {"page": "Jon Silkin", "response": ["*Penguin Modern Poets 7 (1965) with Richard Murphy and Nathaniel Tarn"]}, {"page": "Omey Island", "response": [" In fact, for more than 30 years the only full-time inhabitant was the former stuntman and wrestler Pascal Whelan.http://connachttribune.ie/last-resident-of-omey-island-passes-away/ The Irish poet Richard Murphy lived for some time on Omey Island, where he built an octagonal retreat that still exists."]}, {"page": "Mary Ure", "response": ["The Irish poet Richard Murphy includes a poem about Mary Ure in his Collected Poems, where she is depicted as a nymph-like figure on the shores of Lough Mask on a summer afternoon."]}, {"page": "Cleggan", "response": ["In 1927, in what became known as the Cleggan Bay Disaster, 25 fishermen from the local area drowned during a great gale which arose without warning while they were mackerel fishing in the bay. The nearby village of Rossadilisk lost sixteen men and was subsequently abandoned. Nine men from Inishbofin and twenty men from County Mayo were also lost. Due to the death of so many breadwinners, the area was devastated. The disaster and the devastation visited on the local families made international news and funds were raised from as far away as the U.K., U.S. and Australia. The disaster is remembered in stories, poems and on stone markers. It was recorded by local Marie Feeney in her book \"The Cleggan Bay Disaster\", by TG4 Documentary \"The Cleggan Disaster\" / \"An Bádhadh Mór\" directed by Petra Conroy, and remembered in Richard Murphy's poem \"The Cleggan Disaster\", from his 1963 book \"Sailing to an Island\". Irish singer/songwriter Saoirse Mhór wrote the song \"The Cleggan Bay Disaster\" (Greenhill Media 2013) which was the title track of the 2013 release by the German/Irish Folk band Fleadh."]}, {"page": "1985 in poetry", "response": ["* Richard Murphy, The Price of Stone, including \"Morning Call\""]}, {"page": "1974 in poetry", "response": ["* Richard Murphy, High Island, including \"Seals at High Island\" and \"Stormpetrel\", Irish poet published in the United Kingdom", "* Richard Murphy, High Island"]}, {"page": "1963 in poetry", "response": ["* Richard Murphy, Sailing to an Island, including \"The Poet on the Island\",Crotty, Patrick, Modern Irish Poetry: An Anthology, Belfast, The Blackstaff Press Ltd., 1995,  London: Faber and Faber;  Irish Poets Online/ Author/ Richard Murphy\" at the Irish Poets Online Web site, accessed October 20, 2007 New York: Chilmark Press, 1965 Irish work published in the United Kingdom", "* Richard Murphy, Sailing to an Island, London: Faber and Faber; New York: Chilmark Press, 1965 Irish"]}, {"page": "Faber Book of Irish Verse", "response": ["Æ - William Allingham - Samuel Beckett - Brendan Behan - Eavan Boland - Jeremiah Joseph Callanan - Joseph Campbell - James Carney - Ciaran Carson - Austin Clarke - Brian Coffey - Colman - Colmcille - Padraic Colum - Maurice James Craig - Anthony Cronin - George Darley - Seamus Deane - Aubrey De Vere - Denis Devlin - Eilís Dillon - John Lyle Donaghy - Charles Donnelly - John Swanwick Drennan - Padraic Fallon - Samuel Ferguson - Piaras Feiritéar - Gerald Fitzgerald, Earl of Desmond - Robin Flower - George Fox - Oliver St. John Gogarty - Oliver Goldsmith - Alfred Perceval Graves - Robert Graves - Michael Hartnett - George Campbell Hay - Seamus Heaney - John Hewitt - F. R. Higgins - Pearse Hutchinson - Douglas Hyde - Valentin Iremonger - Thomas Caulfield Irwin - Robinson Jeffers - James Joyce - Patrick Kavanagh - Geoffrey Keating - Joan Keefe - John V. Kelleher - Brendan Kennelly - Thomas Kinsella - William Larminie - Francis Ledwidge - Earl of Longford - Michael Longley - Seán Lucy - Donagh MacDonagh - Thomas MacDonagh - Patrick MacDonogh - Cathal Buí Mac Giolla Ghunna - Hugh MacGowran - Thomas MacGreevy - Thomas MacIntyre - Niall Mór Mac Muireadach - Aindrais MacMarcuis - Giolla Brighde MacNamee - Louis MacNeice - Owen Roe MacWard - Derek Mahon - James Clarence Mangan - David Marcus - Hugh Maxton - Vivian Mercier - Brian Merriman - Kuno Meyer - Ewart Milne - John Montague - Thomas Moore - Michael Moran - Thomas Mozeen - Paul Muldoon - Richard Murphy - Paul Murray - Eiléan Ní Chuilleanáin - Flann O'Brien - Máire Cruise O'Brien - David O'Bruadair - Turlough O'Carolan - Eibhlin Dubh O'Connell - Frank O'Connor - Eugene O'Curry - Gofraidh Fionn Ó Dálaigh - Muireadach O'Dalaigh - Gregory O'Donoghue - Feargal Óg MacWard - Desmond O'Grady - Mahon O'Heffernan - Tadhg Dall O'Huiginn - Eochaidh O'Hussey - Aogán Ó Rathaille - Seán Ó Riada - Owen Roe O'Sullivan - Seamus O'Sullivan - Antoine Ó Raifteiri - George Reavey - W. R. Rodgers - George William Russell - Richard Ryan - Sedulius Scottus - James Simmons - Robin Skelton - Richard Stanihurst - James Stephens - Jonathan Swift - J. M. Synge - Samuel Thompson - Arland Ussher - Helen Waddell - Edward Walsh - J. F. Webb - Richard Weber - Charles Wilson - R. N. D. Wilson - W. B. Yeats - Augustus Young."]}, {"page": "1965 in poetry", "response": ["* Richard Murphy, Sailing to an Island, London: Faber and Faber; New York: Chilmark Press, Irish poet with books published originally in the United Kingdom", "* Richard Murphy, Sailing to an Island, London: Faber and Faber; New York: Chilmark Press, Irish poet"]}, {"page": "1968 in poetry", "response": ["* Richard Murphy, The Battle of Aughrim", "* Richard Murphy, The Battle of Aughrim, IrelandCrotty, Patrick, Modern Irish Poetry: An Anthology, Belfast, The Blackstaff Press Ltd., 1995, "]}, {"page": "1927 in poetry", "response": ["* August 6 – Richard Murphy, Irish-born poet"]}, {"page": "Claddaghduff", "response": ["The village, now sparsely populated, overlooks Omey Island which contains the ruins of Teampal Feichin, a medieval granite church dedicated to St. Feichin. Omey Island is a part of the Omey Granite Pluton, one of the oldest granites in Connemara;  and its human history dates back at least 5,000 years. Claddaghduff has been a site for writers and artists. Richard Murphy's poetry was inspired by the local lore, landscapes, and seascapes and novelist John McGahern also resided in the village. Much of the scenery and ambience of Walter Macken's famous novels is based on his time in and around Claddaghduff."]}, {"page": "Ernest Gébler", "response": ["In Dublin in 1952 Gébler met future novelist Edna O'Brien, then working in a pharmacist's shop.Kersnowski p.xvii After opposition from O'Brien's family, they moved to England, married in 1954, and made their home at Lake Park House, overlooking Lough Dan, in Co Wicklow. They had two sons, Karl (later Carlo) and Sasha, who became respectively a writer and an architect. The house was sold in 1955 to the poet Richard Murphy. It was Gébler who introduced O'Brien to her first publisher, Iain Hamilton of Hutchinson. and her literary career eclipsed Gébler's after her début novel The Country Girls in 1960."]}, {"page": "Wake Forest University Press", "response": ["Wake Forest Press publishes poets from the Republic of Ireland and from Northern Ireland. Poets published include Brendan Kennelly, Ciarán Carson, Austin Clarke, Harry Clifton, Denis Devlin, Peter Fallon, Leontia Flynn, Alan Gillis, Vona Groarke, Michael Hartnett, Thomas Kinsella, Michael Longley, Derek Mahon, Richard Murphy, Medbh McGuckian, Paula Meehan, John Montague, Paul Muldoon, Nuala Ní Dhomhnaill, Eiléan Ní Chuilleanáin, Caitríona O'Reilly, Conor O'Callaghan, and Peter Sirr. The Press also published The Donegal Pictures, a book of black-and-white photographs by photographer Rachel Geise (now Brown)."]}, {"page": "William Lindsay Murphy", "response": ["Sir William Lindsay Murphy, KCMG (1888–1965) was the British Governor of the Bahamas from 28 July 1945 to 1950.e-publiclibrary.org – National Timelines Prior to his appointment as governor, he was the Colonial Secretary of Bermuda from 1942 to 1945, before which he was the Mayor of Colombo and first Municipal Commissioner from 1937 to 1941 in Ceylon.Meeting Richard Murphy  The Irish poet Richard Murphy is his son. Sir William was educated at The Abbey Grammar School in Tipperary,"]}, {"page": "Diarmuid Murphy (writer)", "response": ["* Richard Murphy, born 1927"]}, {"page": "Ardoileán", "response": ["Between 1969 and 1998, the island was in the possession of Irish poet Richard Murphy, then a resident of Inishbofin. In personal memoirs published by Granta in The Kick (2002), Murphy remembers the opportunity when the previous owner considered selling the island: \"I got excited at the thought of buying this inaccessible holy island, restoring the beehive cells and oratory of its derelict hermitage and preserving the place from destruction either by tourists or by sheep.\"Richard Murphy, The Kick, p. 276."]}, {"page": "Relationships that influenced Philip Larkin", "response": ["Patsy Strang discovered and read some of Larkin's sexual diaries.Richard Bradford, (2005) First boredom, then fear: the life of Philip Larkin. Peter Owen. London. Pages 96–100. She later married the poet Richard Murphy."]}, {"page": "Neil Astley", "response": ["Philip Gross and George Szirtes went on to win the T. S. Eliot Prize with Bloodaxe collections, as did Jen Hadfield from Shetland, with her second collection. He has also sought to redress the neglect of marginalised poets, publishing important collected editions of writers such as Martin Bell (1988), James Wright (1992), Basil Bunting (2000), Barry MacSweeney (2003), Martin Carter (2006), Arun Kolatkar (2010), A. S. J. Tessimond (2010), Bernard Spencer (2011) and Richard Murphy (2013), as well as a seminal readers' edition of Edward Thomas: The Annotated Collected Poems (2008) edited by Edna Longley.Bloodaxe Books' new books and complete list 2014. In 2014, his ten-year search to find and republish the poet Rosemary Tonks, who famously \"disappeared\" in 1979 after severing all contact with the literary world, bore fruit with her posthumously published Bedouin of the London Evening: Collected Poems & Selected Prose."]}, {"page": "August 1927", "response": ["*Born: Richard Murphy, Irish poet, in County Mayo (d. 2018)"]}, {"page": "List of members of Aosdána", "response": ["|\tRichard Murphy\t"]}, {"page": "AWB Vincent Literary Award", "response": ["* 1983 – Richard Murphy"]}, {"page": "2018 in Ireland", "response": ["** Richard Murphy, 90, poet."]}, {"page": "Deaths in January 2018", "response": ["*Richard Murphy, 90, Irish poet.An Anglo-Irish poet who wrote to unite his divided self and land"]}, {"page": "2018 in literature", "response": ["**Richard Murphy, Irish poet, 90 (born 1927)"]}]}}