{"wiki_id": "http://www.wikidata.org/entity/Q7329585", "itemLabel": "Richard Turpin", "itemDescription": "cricketer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Turpin_(cricketer)", "wikipedia_page": {"main": "Richard Charles Turpin (born 5 May 1967) is an English former cricketer. Turpin was a right-handed batsman who played as a wicket-keeper. He was born at Solihull, Warwickshire.\nTurpin made his debut for Devon in the 1984 Minor Counties Championship against Oxfordshire. From 1984 to 1990, he represented the county in 29 Championship matches, the last of which came against Cornwall. His MCCA Knockout Trophy debut for the county came against Oxfordshire in 1984. From 1984 to 1990, he represented the county in 7 Trophy matches, the last of which came against Lincolnshire.He also represented Devon in List A cricket. His debut List A match came against Nottinghamshire in the 1986 NatWest Trophy. From 1986 to 1990, he represented the county in 4 List A matches, the last of which came against Somerset in the 1990 NatWest Trophy. In his 4 matches, he scored 59 runs at a batting average of 19.66, with a high score of 29*. Behind the stumps he took 2 catches.\n\n", "link_mentions": [{"page": "Dick Turpin", "response": ["Richard Turpin (bapt. 21 September 1705 – 7 April 1739) was an English highwayman whose exploits were romanticised following his execution in York for horse theft. Turpin may have followed his father's trade as a butcher early in his life but, by the early 1730s, he had joined a gang of deer thieves and, later, became a poacher, burglar, horse thief and killer.  He is also known for a fictional  overnight ride from London to York on his horse Black Bess, a story that was made famous by the Victorian novelist William Harrison Ainsworth almost 100 years after Turpin's death.", "Three days later Turpin, accompanied by the same men along with William Saunders and Humphrey Walker, brutally raided a farm in Marylebone.  The attack netted the gang just under £90.  The next day the Duke of Newcastle offered a reward of £50 in exchange for information leading to the conviction of the \"several persons\" involved in the two Woodford robberies, and the robberies of the widow Shelley and Reverend Dyde.  On 11 February Fielder, Saunders, and Wheeler, were apprehended.  Two accounts of their capture exist.  One claims that on their way to rob the Lawrence household the gang had stopped at an alehouse in Edgware, and that on 11 February, while out walking, the owner noticed a group of horses outside an alehouse in Bloomsbury.  He recognised these horses as those used by the same group of men who had stopped at his alehouse before the Lawrence attack, and called for the parish constable.  Another account claims that two of the gang were spotted by a servant of Joseph Lawrence. Regardless, the three, who were drinking with a woman (possibly Mary Brazier) were promptly arrested and committed to prison.  Wheeler, who may have been as young as 15, quickly betrayed his colleagues, and descriptions of those yet to be captured were circulated in the press.  In The London Gazette, Turpin was described as \"Richard Turpin, a butcher by trade, is a tall fresh coloured man, very much marked with the small pox, about 26 years of age, about five feet nine inches high, lived some time ago in Whitechapel and did lately lodge somewhere about Millbank, Westminster, wears a blue grey coat and a natural wig\".", "left|thumb|upright|Thomas Kyll's pamphlet, published 10 days after Turpin's execution, provides an eye-witness account of the trial. While it contains some small errors and omissions, it is generally considered a reliable account.|alt=Title page of a pamphlet, entitled The Trial of the Notorious Highwayman Richard Turpin.", "Although there was some question as to where the trial should be held—the Duke of Newcastle wanted him tried in London—Turpin was tried at York Assizes. Proceedings began three days after the winter Assizes opened, on 22 March.  Turpin was charged with the theft of Creasy's horses: a mare worth three pounds, a foal worth 20 shillings, and a gelding worth three pounds.  The indictments stated that the alleged offences had occurred at Welton on 1 March 1739, and described Turpin as \"John Palmer alias Pawmer alias Richard Turpin ... late of the castle of York in the County of York labourer\".  Technically the charges were invalid—the offences had occurred at Heckington, not Welton, and the date was also incorrect; the offences were in August 1738.", "Some of the Turpin legend can be sourced directly to Richard Bayes' The Genuine History of the Life of Richard Turpin (1739), a mixture of fact and fiction hurriedly put together in the wake of the trial, to satisfy a gullible public. The speeches of the condemned, biographies of criminals, and trial literature, were popular genres during the late 17th and early 18th centuries; written for a mass audience and a precursor to the modern novel, they were \"produced on a scale which beggars comparison with any period before or since\". Such literature functioned as news and a \"forum in which anxieties about crime, punishment, sin, salvation, the workings of providence and social and moral transgression generally could be expressed and negotiated.\""]}]}}