{"wiki_id": "http://www.wikidata.org/entity/Q7326454", "itemLabel": "Richard Hill, 7th Baron Sandys", "itemDescription": "British Baron (1931-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Hill,_7th_Baron_Sandys", "wikipedia_page": {"main": "Richard Michael Oliver Hill, 7th Baron Sandys DL (21 July 1931 – 11 February 2013), was a British landowner and Conservative politician.Sandys was the only son of Arthur Fitzgerald Sandys Hill, 6th Baron Sandys, and his wife Cynthia Mary (née Gascoigne), and was educated at the Royal Naval College, Dartmouth. He served with the Royal Scots Greys from 1950 to 1955, achieving the rank of Lieutenant. In 1961 he succeeded his father in the barony and took his seat on the Conservative benches in the House of Lords.\nHe served under Edward Heath as a Lord-in-waiting (government whip in the House of Lords) in 1974 and was an Opposition Whip in the House of Lords from 1974 to 1979. Between 1979 and 1982, he was Captain of the Yeomen of the Guard (Deputy Chief Whip in the House of Lords) in the first Conservative administration of Margaret Thatcher. Apart from his political career he was also a Deputy Lieutenant of Worcestershire in 1968.\nLord Sandys married Patricia, daughter of Captain Lionel Hall, in 1961. They had no children. Following the death of both Lord Sandys and his wife, the family seat of Ombersley Court was put up for sale.", "link_mentions": [{"page": "Marquess of Downshire", "response": ["In 2013, the 9th Marquess succeeded, under the terms of a special remainder of 1802, to the title Baron Sandys. The barony had been created for Mary Hill, Marchioness of Downshire, the widow of the second Marquess, with remainder to her younger sons, Lord Arthur Moyses William Hill, Lord Marcus Hill, Lord Augustus Hill and Lord George Hill successively, but if the male line failed, could be inherited by her male heirs of the eldest son, the third Marquess. This occurred in April 2013 with the death of Richard Hill, 7th Baron Sandys without male heirs."]}, {"page": "Scarba", "response": ["Scarba () is an island, in Argyll and Bute, Scotland, just north of the much larger island of Jura.  The island was owned by Richard Hill, 7th Baron Sandys, and has not been permanently inhabited since the 1960s. It is now covered in heather and used for grazing animals. Kilmory Lodge is used seasonally as a shooting lodge, the island having a flourishing herd of red deer."]}, {"page": "Richard Hill", "response": ["* Richard Hill, 7th Baron Sandys (1931–2013), British landowner and Conservative politician"]}, {"page": "Richard Michael Oliver Hill, 7th Baron Sandys", "response": ["#REDIRECT Richard Hill, 7th Baron Sandys "]}, {"page": "2013 in the United Kingdom", "response": ["**Richard Hill, 7th Baron Sandys, 81, peer and landowner."]}, {"page": "Deaths in February 2013", "response": ["*Richard Hill, 7th Baron Sandys, 81, British peer and landowner.Last chapter written in Lord Sandys eventful life"]}]}}