{"wiki_id": "http://www.wikidata.org/entity/Q7329902", "itemLabel": "Richard West", "itemDescription": "British foreign correspondent (1930-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_West_(journalist)", "wikipedia_page": {"main": "Richard West (18 July 1930 – 25 April 2015) was a British journalist and author best known for his reporting of the Vietnam War and Yugoslavia. He is described by Damian Thompson as \"one of the finest foreign correspondents of the 20th century\", with a career that covered the span of the Cold War in most of its theatres.", "link_mentions": [{"page": "Josip Broz Tito", "response": ["Soon after the outbreak of World War I in 1914, the 25th Croatian Home Guard Regiment marched toward the Serbian border. Broz was arrested for sedition and imprisoned in the Petrovaradin fortress in present-day Novi Sad. Broz later gave conflicting accounts of this arrest, telling one biographer that he had threatened to desert to the Russians, but also claiming that the whole matter arose from a clerical error. A third version was that he had been overheard saying that he hoped the Austro-Hungarian Empire would be defeated. After his acquittal and release, his regiment served briefly on the Serbian Front before being deployed to the Eastern Front in Galicia in early 1915 to fight against Russia. Tito in his own account of his military service did not mention that he participated in the failed Austrian invasion of Serbia, instead giving the misleading impression that he fought only in Galicia, as it would have offended Serbian opinion to know that he fought in 1914 for the Habsburgs against them. On one occasion, the scout platoon he commanded went behind the enemy lines and captured 80 Russian soldiers, bringing them back to their own lines alive. In 1980 it was discovered that he had been recommended for an award for gallantry and initiative in reconnaissance and capturing prisoners. Tito's biographer, Richard West, wrote that Tito actually downplayed his military record as the Austrian Army records showed that he was a brave soldier, which contradicted his later claim to have been opposed to the Habsburg monarchy and his self-portrait of himself as an unwilling conscript fighting in a war he was opposed to. Broz was regarded by his fellow soldiers as kaisertreu (\"true to the Emperor\").", "After recuperating, in mid-1916 he was transferred to the Ardatov POW camp in the Samara Governorate, where he used his skills to maintain the nearby village grain mill. At the end of the year, he was again transferred, this time to the Kungur POW camp near Perm where the POWs were used as labour to maintain the newly completed Trans-Siberian Railway. Broz was appointed to be in charge of all the POWs in the camp. During this time he became aware that the Red Cross parcels sent to the POWs were being stolen by camp staff. When he complained, he was beaten and put in prison. During the February Revolution, a crowd broke into the prison and returned Broz to the POW camp. A Bolshevik he had met while working on the railway told Broz that his son was working in an engineering works in Petrograd, so, in June 1917, Broz walked out of the unguarded POW camp and hid aboard a goods train bound for that city, where he stayed with his friend's son. The journalist Richard West has suggested that because Broz chose to remain in an unguarded POW camp rather than volunteer to serve with the Yugoslav legions of the Serbian Army, this indicates that he remained loyal to the Austro-Hungarian Empire, and undermines his later claim that he and other Croat POWs were excited by the prospect of revolution and looked forward to the overthrow of the empire that ruled them."]}, {"page": "The Spectator", "response": ["Chancellor's editorship of the paper relied principally on a return to earlier values. He adopted a new format and a more traditional weekly style, with the front page displaying five cover lines above the leader. Most significantly, he recognised the need \"to bring together a number of talented writers and, with the minimal of editorial interference, let them write\". To this end he persuaded Auberon Waugh (who had been sacked by Nigel Lawson) to return from the New Statesman, and enticed Richard West and Jeffrey Bernard from the same magazine. Another columnist recruited by Chancellor was Taki Theodoracopulos whose column ‘High Life’ was then printed beside Bernard's ‘Low Life’. Taki's column, frequently criticised for its content by the press,Matthew Bell \"What's the point of Taki if he isn't offensive any more?\", The Independent on Sunday, 16 May 2010; Leader: \"Selective spectator\", The Guardian, 21 October 2004. remains in the paper."]}, {"page": "Rise, O Voices of Rhodesia", "response": ["Foreign observers were less than impressed; the British journalist Richard West, remarking that white Rhodesians were \"renownedly philistine\", asked \"how could one not... squirm with embarrassment when the TV ends at night with the Rhodesian national anthem to the tune of Beethoven's Choral Symphony?\""]}, {"page": "Auberon Waugh", "response": ["He had a house in France and, despite his conservatism, was a fervent supporter of European integration and the single currency, which he saw as a means of de-Americanising the UK. He said that his ideal government would be a \"junta of Belgian ticket inspectors\". Neither did he conform to reactionary stereotypes in his strong opposition to the death penalty, or in his antipathy towards the police force in general (especially when they sought to prevent drink-driving; Waugh believed strongly that this was not as serious a problem as it is widely believed to be, and referred to the anti-drink-driving campaign as the \"police terror\"). He opposed anti-tobacco smoking legislation (despite a heart condition which was ultimately to kill him prematurely) and in his later years he was highly critical of Labour attempts to ban fox hunting. In 1995 he fervently opposed attempts by the then Home Secretary Michael Howard to introduce a national identity card, a policy which at the time was opposed by the Labour opposition. Along with Patrick Marnham and Richard West, Waugh was one of three signatories to a letter to The Times that called for a British monument to honour those repatriated as a result of the Yalta Conference; it was eventually erected in 1986."]}, {"page": "Aloysius Stepinac", "response": ["After his consecration, Stepinac visited Belgrade to pledge his allegiance to King Alexander. The journalist Richard West quotes Stepinac:", "On 10 April 1945, Stepinac held a mass in the Zagreb Cathedral for the 4th anniversary of the NDH's founding, and Te Deum's were sung for what was left of the Ustaše state. Richard West writes that, on 15 April, as Pavelić and other Ustaše leaders were getting ready to flee, \"Archbishop Stepinac devoted his sermon to what he believed was Croatia's worst sin, not mass murder, but swearing.\""]}, {"page": "Anthony Howard (journalist)", "response": ["*Anthony Howard and Richard West (1965) The Making of the Prime Minister Jonathan Cape [USA edition: The Road to Number 10 Macmillan 1965]"]}, {"page": "Richard West", "response": ["Richard West may refer to:", "*Richard West, 7th Baron De La Warr and 4th Baron West (1430–1475/6)", "*Richard West (died 1674) (1636–1674), English landowner and politician", "*Richard West (priest) (1670?–1716), English churchman and academic, archdeacon of Berkshire", "*Richard West (Lord Chancellor of Ireland) (c. 1691–1726), 18th-century Irish politician and lawyer", "*Richard West (outlaw) (1860–1898), outlaw of the Old West", "*W. Richard West Sr. (1912–1996), Cheyenne, artist and director of Bacone College's art program", "*Richard West (cricketer, born 1916), English cricketer", "*Richard West (cricketer, born 1920) (1920–1985), English cricketer", "*Richard West (journalist) (1930–2015), British journalist and author", "*W. Richard West Jr. (born 1943), Cheyenne, founding Director of the Smithsonian National Museum of the American Indian", "*Richard West (keyboardist) (born 1967), member of British rock band Threshold", "*Mr. C (Richard West, born 1968), British DJ and musician", "*Richard West (rugby union) (born 1971), former English rugby union footballer", "*Richard West (footballer), (born 1985),  Jamaican footballer", "*Richard West Houses, a building in Toronto, Canada "]}, {"page": "Mary Kenny", "response": ["Kenny married journalist and writer Richard West in 1974 and the couple raised two children: Patrick and Ed West, both journalists. Richard died in 2015."]}, {"page": "Patrick West", "response": ["He is the son of British journalist Richard West and Irish journalist Mary Kenny, the brother of the journalist Ed West, and cousin of actors Timothy West and Samuel West."]}, {"page": "Patrick Marnham", "response": ["In 1980 he was appointed Literary Editor of The Spectator under Alexander Chancellor. At that time he led a campaign with Richard West and Auberon Waugh for the installation of a British monument to honour those repatriated to Soviet concentration camps as a result of the Yalta Conference. Despite fierce resistance from the Foreign Office and the Soviet Embassy a prominent memorial was eventually erected in South Kensington in 1986.  He left The Spectator to travel in Mexico and through the war zones of Guatemala, El Salvador and Nicaragua, an experience which he described in So Far from God: A Journey to Central America.  Marnham's travel writing was described in the Dictionary of Literary Biography as covering \"complex cultural histories\" and tackling \"substantial questions about belief, skepticism, communal responsibility and individual freedom... In the tradition of such anatomizers of late British imperialism as Graham Greene, Malcolm Lowry and Evelyn Waugh, Marnham documents with tragic irony and self-deprecating wit the fate of parts of the world that were once administered - and are still in many ways controlled - by Europe and the United States... He uses common sense and Orwellian honesty to puncture political illusions and cultural misconceptions about the Third World\"."]}, {"page": "Franciscan friary, Široki Brijeg", "response": ["Several key Ustaše officials, like Andrija Artuković were educated at the friary. According to journalist Richard West, the Franciscans of Bosnia and Herzegovina played a leading role in the atrocities during World War II, particularly against Serbs and their center of operations was the Široki Brijeg monastery. Both the friary and the church were damaged during the war. In  May and June 1945 during the Macelj massacre 25 Catholic priests were massacred by Yugoslav communists under command by Josip Broz Tito. The church was hit with 304 cannonballs. The renovation started only in 1958 and continued during the 1960s and 1970s."]}, {"page": "Edmond Paris", "response": ["The journalist Richard West noted that Paris was one of a group of \"anti-Catholic polemicists\" who used events in the Independent State of Croatia to attack the Catholic Church as a whole. West observes that Genocide in Satellite Croatia, 1941–1945 was first published in French, and later in English. It was subsequently reprinted by a Protestant publisher in the United States as Convert or Die..., with a \"blood-red cover showing a man kneeling at gunpoint in front of a priest\". Despite this horrific imagery, West opines that Paris' book is based on careful research, much of it from Magnum Crimen. West states that Paris relied heavily on the testimony of Serbs who fled Yugoslavia after the war, whose testimony \"bears out what we know of the Ustaše massacres from German, Italian and Yugoslav government sources\".Richard West: Tito and the Rise and Fall of Yugoslavia, Faber & Faber, 2012 , Notes chapter, second page"]}, {"page": "Ed West (journalist)", "response": ["He is the son of British journalist Richard West and Irish journalist Mary Kenny and the brother of the journalist Patrick West."]}, {"page": "Viktor Gutić", "response": ["He stated that he had received orders from the highest ranking Ustaše authorities to ethnically cleanse Bosanska Krajina of non-Croats. According to author Richard West, Gutić was one of the first Ustaša on record to use the term \"cleansing\" (čišćenje) as a euphemism for mass murder. Referring to Serbs at an Ustaše rally in Sanski Most on 30 May, he was quoted saying:"]}, {"page": "John Bulmer", "response": ["*The White Tribes of Africa. London: Cape, 1965. New York: Macmillan, 1965. Photographs by Bulmer, text by Richard West.", "*The Gringo in Latin America. London: Cape, 1967. Photographs by Bulmer, text by Richard West."]}, {"page": "Colin Welch", "response": ["James Colin Ross Welch (23 April 1924 – 28 January 1997) was an English political journalist. According to Richard West in his obituary of Welch, he was a \"strong and eloquent advocate of individual liberty against the power of government\"."]}, {"page": "2015 in the United Kingdom", "response": ["**Richard West, 84, journalist and author."]}, {"page": "Deaths in April 2015", "response": ["*Richard West, 84, British journalist and author.Richard West, writer – obituary"]}, {"page": "Twelve Responses to Tragedy", "response": ["Plans for a memorial were initiated after a letter was written to The Spectator in the 1970s signed by Richard West, Patrick Marnham and Auberon Waugh who proposed that a memorial be erected to the \"... memory of the hundreds of thousands of innocent people who were forcibly repatriated by the Allies to the Soviet and Yugoslav authorities at the end of the Second World War, a crime that was carefully hushed up at the time and even concealed from Parliament for fear of the outcry that would have resulted\". A later letter to The Times calling for a memorial was signed by politicians Bernard Braine, Jo Grimond, Donald J. Stewart, John Mackintosh, James Molyneaux, Gwynfor Evans, Nicholas Bethell, John Foster, Christopher Mayhew, and Harmar Nicholls, and writers Rebecca West, Hugh Trevor-Roper, Nicolas Cheetham, Nikolai Tolstoy and John Jolliffe."]}]}}