{"wiki_id": "http://www.wikidata.org/entity/Q7332255", "itemLabel": "Rico Daniels", "itemDescription": "television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Rico_Daniels", "wikipedia_page": {"main": "Rico Daniels is an English television presenter who has his own show, The Salvager on Discovery Real Time. A passionate recycler, the second series (similar in content to the first) saw him moving in France and was called Le Salvager.\nBorn in Basildon, Essex in 1962, Daniels was brought up in the town and left school at 15 to become a  civil servant, but soon realised this was not for him and enrolled as an art student. Disliking the formal tuition Daniels embarked on a range of jobs before settling for the life of a market trader. In 2002 he was invited to screen test for a new programme about men and their sheds. While he was not quite suitable for this assignment, the producer liked his idiosyncratic style and commissioned him for a series of programmes showcasing his imaginative talent for changing something unwanted into a distinctive piece of furniture which was to become the show we know today as The Salvager name changed to Le Salvager when the presenter moved to France. After filming of the show.The Salvager is occasionally aired on Quest.", "link_mentions": [{"page": "Fontenoy-le-Château", "response": ["Rico Daniels who is Le Salvager, a TV programme made by Discovery Real Time, lives here and his TV show is filmed here."]}, {"page": "Rico (name)", "response": ["* Rico Daniels (born 1962), English television presenter"]}, {"page": "The Salvager", "response": ["The Salvager is a British reality television show produced by Attaboy Productions and aired on Discovery Real Time. The show ran for two series featuring Rico Daniels a passionate recycler and salvager scouring scrap yards, council tips and charity shops finding scrap metal and wood and transforming them into useful and unusual items. The second series re-titled Le Salvager relies on the same premise but sees Daniels relocate to the Vosges of eastern France.http://www.questtv.co.uk/le-salvager/ The show is often repeated on Quest and Discovery Shed in the United Kingdom.", "Daniels was born in Basildon, Essex in 1952. He left school at the age of 15 to become a civil servant but quickly realised it wasn't for him and became an art student. This also displeased Daniels and he eventually became a market trader.Rico Daniels", "In 2002 Daniels was invited for a screen test about men and their sheds. Although he was not quite right for the show, the producer liked his unique style and commissioned a series showing his talent for transforming trash into treasures.Rico Daniels", "|Rico Daniels explains how to create a coffee table from the remnants of old tea caddies as well as other salvaged materials.http://www.radiotimes.com/programme/cykc/the-salvager", "|Salvage expert Rico Daniels tests his skills to the limit when he uses some railway sleepers and an axle from an old Jaguar to create a dining room table of the highest quality.", "|Presenter Rico Daniels tries to fit a Shaker-style country kitchen using old doors to create a new cabinet, and finishes the design off with a reclaimed Belfast sink.", "|Presenter Rico Daniels continues with his Shaker-style kitchen project, fashioning a butcher's block from scrap wood, and a unique wine-rack from 20 old bean tins.", "|Expert craftsman Rico Daniels demonstrates how four old doors can be transformed into a wardrobe, finished with a coating of rustic paint.", "|Rico Daniels dismantles an old storage chest and produces a wall mirror complete with iron fixings.", "|Rico Daniels creates a storage unit using just three old doors and four fruit crates.", "|Rico Daniels turns a pile of old fence posts and floorboards into a stylish four-poster bed.", "|Rico Daniels skins the leather off old bags, coats and shoes as he sets about designing his own unique headboard.", "|Rico Daniels uses stained glass and dark wood to construct an elegant bookcase.", "|Salvage expert Rico Daniels uses an old galvanised water tank and two 1950s fire extinguishers to create a home entertainment unit.", "|Rico Daniels uses an iron street grid, fence posts, a wooden tripod and a Victorian trolley to create a low coffee table and the base of a lamp.", "|Craftsman Rico Daniels strips back a broken sofa and rebuilds it into a conservatory chair.", "|Salvage expert Rico Daniels guts an old harmonium to create a computer cabinet, before cutting down an old church pew to form a matching chair.", "|Rico Daniels makes a corner unit out of used floorboards, with an old saw blade as a decorative motif.", "|Rico Daniels creates a bespoke refectory table out of two tree trunks, using roots and old floorboards for the top.", "|Rico Daniels converts a transit van into a boat by cutting off the top, fitting out the interior and adding layers of glass fibre.", "|Using an old van axle, a steel channel and a sprinkler pipe, Rico Daniels builds a trailer for his newly completed boat.", "|Rico Daniels uses wood and metal to make a decorative boiler cover.", "|Rico Daniels creates an unusual fitted kitchen, using a huge French army copper pot as the sink and various flea market finds as the fixtures and fittings.", "|Rico Daniels adds the finishing touches to the fitted kitchen, including a splashback made from Roman roof tiles", "|Rico Daniels uses rivets and welding to convert a Renault 4 into a metal chaise longue, incorporating the car's headlights.", "|Rico Daniels tries to build a greenhouse from reclaimed timber and doors.", "|Rico Daniels adds the finishing touches to his greenhouse project by creating a garden path made of roof tiles.", "|Using a large pine tree from his local forest, Rico Daniels creates a rustic bookcase which he models almost completely with just one tool."]}]}}