{"wiki_id": "http://www.wikidata.org/entity/Q7331432", "itemLabel": "Rick Guard", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rick_Guard", "wikipedia_page": {"main": "", "link_mentions": [{"page": "Chorley", "response": ["*Rick Guard (jazz singer and songwriter)"]}, {"page": "List of Decca Records artists", "response": ["* Rick Guard"]}, {"page": "Kristyna Myles", "response": ["Kristyna Myles (born 10 May 1984) is a MOBO nominated British singer-songwriter who is currently based in Manchester. Originally from Leicestershire, she came into prominence after winning Busk Idol, a 2005 nationwide singing competition organised by BBC Radio 5 Live. Since winning, she has featured on albums by Chris de Burgh and Rick Guard, and has performed on television programmes such as Songs of Praise, Wogan Now & Then and Play It Again. She also sang a duet with de Burgh on his European tour. In 2009, she was nominated for a MOBO award as part of gospel act DTWG : Desire To Worship God and most recently nominated for a MOBO for her own music in 2014.", "During 2008, Myles was the only unsigned artist to feature on the Universal Music compilation album Songbird 2008, with \"My Lord\", a track from One of a Kind. In July she supported Mick Hucknall on part of his UK tour, playing at venues such as Echo Arena Liverpool and in October she performed at Oxjam events in Lancaster, Lancashire, alongside Joe De Luca and Mike Dignam. During the next year she recorded a duet named \"Making Movies\" with jazz singer Rick Guard for his 2009 album Anyone But Me. That August, Myles was nominated for Best Gospel Act at the MOBO Awards 2009 as part of the gospel collective DTWG : Desire To Worship God, but lost out to Victizzle.", "|Duet with Rick Guard"]}, {"page": "Northern Light (Jon Christos album)", "response": ["Northern Light is the debut album from classical musician and Salford born tenor Jon Christos. The album was released in 2005 by Roots Music Group and produced by Alan Gregson peaked at number 9 in the official UK classical album charts. The album is a collection of new classical crossover songs as composed by Matteo Saggese, James Shearman, Sam Babbenia, Rick Guard and Phil Rice along with well established arias and songs such as; Nessun Dorma, \"Caruso\", Ch'ella mi creda and Non ti scordar di me.composer and other credits appear within the album's cover booklet"]}, {"page": "Dancing with the Stars (Australian season 2)", "response": ["| \"Stop it I Like It\"—Rick Guard"]}, {"page": "Eesti otsib superstaari (season 3)", "response": ["* Getter Jaani – \"Stop It (I Like It)\" by Rick Guard"]}, {"page": "Brian Sterling-Vete", "response": ["In business, Sterling partnered with Perry Hughes (Roots Music Group), manager to opera star Jon Christos, contemporary jazz singer and songwriter Rick Guard and former manager to opera star Russell Watson)."]}, {"page": "Phil Rice", "response": ["Phil Rice (also known as Philip James Rice) (born Lancashire, England) is a songwriter, producer and keyboard player. He is part of a songwriting and performing partnership with Rick Guard. As a live performer, Rice has worked with some of the leading artists in the world, including Lionel Richie, Russell Watson, Shirley Bassey, and Ronan Keating.", "In the year of its release, \"Stop It I Like It\" (written with Rick Guard) was a Top 20 hit in eleven countries, the 75th highest played song on the radio in the world, and in the top 10 of ringtone charts in Europe. It has also been used on a top-selling computer game Pop Life and Dance: UK.", "*  \"Stop It I Like It\" - Rick Guard  (Decca 2002)", "*  \"Show Me Yours\" - Rick Guard  (Decca 2002)", "*  \"Hands of a Giant\" - Rick Guard  (Decca 2002)", "* \"The Truth About Love\" - Rick Guard (Linermedia 2007)", "* \"Anyone But Me\" - Rick Guard (Linermedia 2009)"]}, {"page": "Getter Jaani", "response": ["| rowspan=\"2\" style=\"text-align:center;\"| 6 || \"Stop it (I Like It)\" || Rick Guard ||rowspan=\"2\" style=\"background:#B4FB84\"| Safe"]}, {"page": "Guard (surname)", "response": ["*Rick Guard, English singer-songwriter"]}]}}