{"wiki_id": "http://www.wikidata.org/entity/Q7332093", "itemLabel": "Ricky Holmes", "itemDescription": "British footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ricky_Holmes", "wikipedia_page": {"main": "Ricky Lee Holmes (born 19 June 1987) is an English professional footballer who plays for Farnborough as a striker or a winger.", "link_mentions": [{"page": "Charlton Athletic F.C.", "response": ["|2017|| Ricky Holmes"]}, {"page": "Northampton Town F.C.", "response": ["* 2016  Ricky Holmes (League Two)"]}, {"page": "Portsmouth F.C.", "response": ["* 2014 –  Ricky Holmes"]}, {"page": "Rossi Jarvis", "response": ["In June 2010, Jarvis joined Barnet. He made his debut for the Bees on the opening day of the 2010–11 season away to Chesterfield and was replaced in the 54th minute by fellow debutant, Ricky Holmes. He left Barnet at the end of the 2010–11 season, having made 22 league appearances."]}, {"page": "Chris Hackett (footballer)", "response": ["At the start of the 2014–15 season, Hackett missed two matches, due to an Achilles injury. He made his return from injury on 19 August 2014, coming on as a substitute in the 64th minute, in a 2–0 loss against Portsmouth. Since returning to the first team from injury, Hackett regained his first team place for the side. During a 2–1 loss against Cambridge United on 14 November 2014, he came off as a substitute in the 56th minute – six minutes after setting up a goal for Ivan Toney; after the match, Manager Chris Wilder said: \"Chris Hackett had to come off because of his heart condition.\" Despite this, he then scored his first goal of the season, in a 3–2 loss against Bury on 26 December 2014. Towards the end of the 2014–15 season, Hackett soon found himself in the substitute bench in a number of matches, due to good forms from Lawson D'Ath and Ricky Holmes. Despite this, he contributed for the side when he scored two more goals between 21 February 2015 and 28 February 2015 against York City and Shrewsbury Town. At the end of the 2014–15 season, making forty appearances and scoring three times in all competitions, Hackett was placed on a transfer list by Manager Chris Wilder."]}]}}