{"wiki_id": "http://www.wikidata.org/entity/Q7332078", "itemLabel": "Ricky Gillies", "itemDescription": "Scottish footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ricky_Gillies", "wikipedia_page": {"main": "Richard Gillies (born 24 August 1976) is a Scottish former professional footballer. He had two five-year spells with St Mirren.", "link_mentions": [{"page": "2000–01 Scottish Premier League", "response": ["|  Ricky Gillies || St Mirren || style=\"text-align:center\"|10"]}, {"page": "Scott Gemmill", "response": ["Raised in East Kilbride,Gemmill is too young to be an old head, Scottish Football League, 17 September 2010 Gemmill was selected for the Lanarkshire Schools XI in 2002 alongside future Scotland international forward Steven Fletcher, while a pupil at Duncanrig Secondary School.Driver steers Select to Scottish Cup win, The Scotsman, 25 May 2002 He began his club career with St Mirren, where he made 10 appearances, all as a substitute, scoring no goals. His debut on 9 August 2003 against Raith Rovers at the age of 16 years 61 days made him St Mirren's youngest ever first team player, breaking a mark set by Ricky Gillies; this record still stands."]}, {"page": "1993 Scottish Challenge Cup Final", "response": ["|FW || || Ricky Gillies || "]}, {"page": "Eastwood High School, Newton Mearns", "response": ["*Ricky Gillies, footballer (St Mirren)"]}, {"page": "Aberdeen University F.C.", "response": ["January 2000 saw a memorable day for the University F.C. when a strong Aberdeen side were held to a 0–0 draw in a friendly fixture held at Cameron Barracks. The Dons side included notable Premier Division players such as Gary Smith, Jim Hamilton, Ricky Gillies, Darren Mackie, Dennis Wyness and Kevin Rutkiewicz."]}, {"page": "Liam Lindsay", "response": ["Lindsay's uncle Ricky Gillies was also a professional footballer, whilst his father, James, was once on the books at Celtic."]}, {"page": "List of St Mirren F.C. seasons", "response": ["|Ricky Gillies", "|Ricky Gillies"]}]}}