{"wiki_id": "http://www.wikidata.org/entity/Q7330091", "itemLabel": "Richard Wordsworth", "itemDescription": "English actor (1915-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Wordsworth", "wikipedia_page": {"main": "Richard Curwen Wordsworth (19 January 1915 – 21 November 1993) was an English character actor. He was the great-great-grandson of the poet William Wordsworth.\nAs a young man he followed in the footsteps of his clergyman father, reading Divinity at Cambridge University. But he quickly found acting more to his taste and, after performing at the Cambridge Footlights, he decided to study drama at the Embassy School of Acting in London.\nThis proved an excellent choice. He quickly developed a talent for character acting which sustained him and his family through a long and richly varied career. In classical theatre he worked with John Gielgud, Donald Wolfit, Anthony Quayle and Richard Burton. After successful Shakespearian seasons at the Old Vic and Stratford-upon-Avon, he starred in the musical Lock Up Your Daughters which launched the Mermaid Theatre in London. He also found success as Captain Hook in several Christmas productions of Peter Pan. Later he would tour Australia as Fagin in the musical Oliver which he also produced.\nHis film career included a standout performance as the monstrous astronaut in The Quatermass Xperiment, which launched Hammer Film Productions’ famous run as the UK’s foremost producers of horror movies. Later he played a scene as a sinister taxidermist with James Stewart (whom he described as 'a perfect gentleman') in Alfred Hitchcock's second version of The Man Who Knew Too Much. He also played leading parts in British TV dramas such as Huntingtower and The Tripods.\nIn the final decades of his life he developed The Bliss of Solitude a one-man tribute to his great ancestor with which he toured Britain and the United States. He also founded the Wordsworth Summer School - a week of poetry, lectures and walks in his beloved Lake District.", "link_mentions": [{"page": "1993 in film", "response": ["| style=\"text-align:center;\"| 21 || Richard Wordsworth || style=\"text-align:center;\"| 78 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "The Quatermass Xperiment", "response": ["The Quatermass Xperiment (a.k.a. The Creeping Unknown in the United States) is a 1955 British science fiction horror film drama from Hammer Film Productions, based on the 1953 BBC Television serial The Quatermass Experiment written by Nigel Kneale. The film was produced by Anthony Hinds, directed by Val Guest, and stars Brian Donlevy as the eponymous Professor Bernard Quatermass and Richard Wordsworth as the tormented Carroon. Jack Warner, David King-Wood, and Margia Dean appear in co-starring roles.", "The film concerns three astronauts who have been launched into space aboard a single stage to orbit rocket designed by Professor Quatermass. It crashlands with only one of its original crew, Victor Carroon (Richard Wordsworth), still aboard. He begins mutating into an alien organism, which, if it spawns, will engulf the Earth and destroy humanity. After Carroon escapes from custody Quatermass and Inspector Lomax (Jack Warner) of Scotland Yard have just hours to track him/it down and prevent a catastrophe.", "* Richard Wordsworth as Victor Carroon", "Richard Wordsworth was cast by Val Guest as the hapless Victor Carroon because \"he had the right sort of face for the part\". He was best known at the time for his work in the theatre. His performance in The Quatermass Xperiment is frequently compared with that of Boris Karloff in Frankenstein (1931).See, for example, ; ; . Guest, aware of the risk of an actor going over the top with the part, directed Wordsworth to \"hold back just a mite of what you're feeling\". Summing up Wordsworth's performance, film critic Bill Warren said, \"All Carroon's anguish and torment are conveyed in one of the best mime performances in horror and science fiction films... A sequence in which he is riding in a car with his wife is uncanny: only the alien is visible for a long moment\". Wordsworth went on to appear in three more Hammer films: The Camp on Blood Island (1958), The Revenge of Frankenstein (1958), and The Curse of the Werewolf (1961). He remained known predominantly as a stage actor, among other things devising and starring in a one-person show dedicated to his great-great grandfather, the poet William Wordsworth.", "thumb|right|alt=A black-and-white screenshot from the film depicting a tall man in a white coat reading a clipboard watched by a man with a moustache wearing a dark suit. In the foreground a man is seated rigidly staring straight ahead, his eyes and face sunken into a skeletal appearance|Quatermass (Brian Donlevy) (centre) and Briscoe (David King-Wood) (left) examine Carroon (Richard Wordsworth) (seated) in a scene from The Quatermass Xperiment. Makeup artist Phil Leakey worked with cinematographer Walter J. Harvey to accentuate the shadows around Wordworth's face to give him a skeletal appearance.", "The work of makeup artist Phil Leakey in transforming Richard Wordsworth's Carroon into the mutating creature was a key contribution to the effectiveness of the film. Val Guest, Anthony Hinds, and Leakey all agreed that the makeup should make Carroon appear pitiful rather than ugly. Leakey placed a light above the actor in the makeup chair and then worked on accentuating the shadows cast by his eyebrows, nose, chin and cheekbones. The makeup was a liquid rubber solution mixed with glycerine to give the impression of sweat. Leakey's job was made easier by Wordsworth's natural high cheekbones and hollow temples and he also worked closely with cinematographer Walter J. Harvey to ensure the lighting in each shot emphasised Wordsworth's features. Leakey also created Carroon's mutating arm. The hand was created from a cast of the hand of an arthritis victim, enlarged and exaggerated by Leakey. The rest of the arm was built up using latex and rubber and, inside, had a series of plastic tubes through which fluid was pumped to give the effect of the arm swelling. A large sponge-rubber prosthetic was used for a brief scene in the zoo showing Carroon's mutation had advanced further. The shrivelled corpses of Carroon's victims, glimpsed from time to time in the film, were also made by Leakey.", "Among the critics and film historians who have reviewed The Quatermass Xperiment in the years since its release have been John Baxter who said, in Science Fiction in the Cinema (1970), \"In its time, The Quatermass Experiment was a pioneering sf film... Brian Donlevy was stiff but convincing... Much of the film is saved, however, by Richard Wordsworth... one of the finest such performances since Karloff's triumphs of the Thirties\". This view was echoed by John Brosnan in The Primal Screen (1991): \"One of the best of all alien possession movies\", he wrote, \"Not since Boris Karloff as Frankenstein's monster has an actor managed to create such a memorable, and sympathetic, monster out of mime alone\". Bill Warren in Keep Watching The Skies! (1982) found that \"the buildup is slightly too long and too careful\" but also said, \"It's an intelligent, taut and well-directed thriller; it showcases Nigel Kneale's ideas well; it's scary and exciting. It was made by people who cared about what they were doing, who were making entertainment for adults. It is still one of the best alien invasion films\". Steve Chibnall, writing for the British Film Institute's Screenonline, describes The Quatermass Xperiment as \"one of the high points of British SF/horror cinema\". The horror fiction writer Stephen King praised the film in his non-fiction book Danse Macabre (1991) as one of his favourite horror movies between 1950 and 1980 . The film director John Carpenter, who later collaborated with Nigel Kneale on the film Halloween III: Season of the Witch (1982), has claimed that The Quatermass Xperiment \"had an enormous, enormous impact on me – and it continues to be one of my all-time favourite science-fiction movies\"."]}, {"page": "List of fictional butlers", "response": ["| Lane || manservant to Algernon Moncrieff in Oscar Wilde's The Importance of Being Earnest ||Richard Wordsworth, John Turnbull, Munson Hicks, Walter Hudd, John Woodnutt, Michael Hordern, Edward Fox, Neil Dickson, Paul O'Brien || 1895 ||"]}, {"page": "The Curse of the Werewolf", "response": ["* Richard Wordsworth as Beggar"]}, {"page": "The Imaginary Invalid", "response": ["*The Imaginary Invalid was directed by János Nyíri at the Vaudeville Theatre in London's West End in 1968 with Richard Wordsworth as Argan."]}, {"page": "The Man Who Knew Too Much (1956 film)", "response": ["* Richard Wordsworth as Ambrose Chappell, Jr. (uncredited)"]}, {"page": "Clarence Derwent Awards", "response": ["* 1954 Richard Wordsworth as Antonio in Venice Preserv'd"]}, {"page": "R3 (TV series)", "response": ["*Dr Peter Travers – Richard Wordsworth"]}, {"page": "Wordsworth (disambiguation)", "response": ["*Richard Wordsworth, (1915–1993), actor, great-great-grandson of William Wordsworth"]}, {"page": "List of science fiction films of the 1950s", "response": ["|The Quatermass Xperiment ||Val Guest||Brian Donlevy, Jack Warner, Richard Wordsworth, Margia Dean||United Kingdom||U.S. title: The Creeping Unknown."]}, {"page": "Time Without Pity", "response": ["* Richard Wordsworth as Maxwell"]}, {"page": "Lock Up Your Daughters (1969 film)", "response": ["* Richard Wordsworth as Coupler"]}, {"page": "Julia Lockwood", "response": ["|Richard Wordsworth, Patricia Garwood", "|Michael Williams, Richard Wordsworth, Patrick Desmond"]}, {"page": "Chocky (TV series)", "response": ["||1  2  3 4  5  6 ||29 September 1986  2 October 1986  6 October 1986  9 October 1986  13 October 1986  16 October 1986||Andrew Ellams (Matthew Gore)  James Hazeldine (David Gore) <Br> Glynis Brooks (Chocky - voice)  Anabel Worrell (Albertine Meyer) <Br> Prentis Hancock (Arnold Meyer)  Paul Russell (Paul Barclay)  Freddie Brooks (Mike)  Karina Wilsher (Su Lin) <Br> Joan Blackham (Mrs. Gibson) <Br> Ilona Linthwaite (Dr. Liddle) <Br> Roy Boyd  (Prof. Fraycott)  Kristine Howarth (Prof. Wade)  Richard Wordsworth (Prof. Ferris)  Leon Eagles (General)  Norma Ronald (Chocky's parent - voice)"]}, {"page": "The Camp on Blood Island", "response": ["* Richard Wordsworth as Dr. Robert Keiller"]}, {"page": "The Regiment (TV series)", "response": ["|Richard Wordsworth"]}, {"page": "Gervase Fen", "response": ["The Moving Toyshop was adapted for the 1960s BBC TV anthology series Detective, Fen was played by Richard Wordsworth."]}, {"page": "List of former Footlights members", "response": ["| Richard Wordsworth || 1915 || 1993 || Character actor"]}, {"page": "Wordsworth, Richard", "response": ["#redirectRichard Wordsworth"]}, {"page": "Frankenstein (Hammer film series)", "response": ["| style=\"text-align:center;\"| Richard Wordsworth"]}, {"page": "Nicholas Nickleby (1957 TV series)", "response": ["* Richard Wordsworth as Newman Noggs (9 episodes)"]}, {"page": "More Than Robbery", "response": ["* Richard Wordsworth as Tredford"]}]}}