{"wiki_id": "http://www.wikidata.org/entity/Q7346369", "itemLabel": "Robert Kinglake", "itemDescription": "English rower and barrister", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Kinglake", "wikipedia_page": {"main": "Robert Alexander Kinglake (9 June 1843 – 10 June 1915) was an English rower and barrister.\nKinglake was born at Taunton. He was the second son of John Alexander Kinglake, MP for Rochester, and his wife Louisa Rebecca Liddon, daughter of John Liddon of Taunton. He was educated at Eton and Trinity College, Cambridge.  Kinglake rowed in the Cambridge boat in the Boat Races of 1863, 1864, 1865 and 1866, all of which were won by Oxford. He was president of Cambridge University Boat Club in 1866.  In 1864 he won the Silver Goblets at Henley Royal Regatta partnering John Richardson Selwyn.Kinglake was admitted at the Inner Temple in November 1865 and was called to the bar on 17 November 1868. He was on the Western Circuit, and was Recorder of Penzance from 1883 to 1899 and of Bournemouth from 1899 to 1915.\nKinglake later lived at Moushill Manor, Milford, Surrey. He died at Harrogate at the age of 72.", "link_mentions": [{"page": "Milford, Surrey", "response": ["*Robert Kinglake, rower and barrister"]}, {"page": "John Selwyn (bishop)", "response": ["Selwyn was born in Waimate North, New Zealand, the youngest son of George Augustus Selwyn and his wife Sarah Harriet the only daughter of Sir John Richardson. His father was the first Bishop of New Zealand in whose memory Selwyn College, Cambridge was named. Selwyn was educated at Eton College and Trinity College, Cambridge, graduating in 1866. Like his father, Selwyn rowed for Cambridge and took part in the Boat Races of 1864 and 1866, both of which were won by Oxford.Walter Bradford Woodgate Boating 1888 In 1864 he won the Silver Goblets at Henley Royal Regatta partnering Robert Kinglake and beating Edwin Brickwood and his brother in the final.Henley Royal Regatta Results of Final Races 1839-1939 "]}, {"page": "John Alexander Kinglake", "response": ["Kinglake was at born at Chilton-on-Polden, the son of Robert Kinglake MD of Taunton and his wife Joanna Apperly, daughter of Anthony Apperly of Herefordshire. He was educated at Eton College and at Trinity College, Cambridge graduating BA in 1826 and MA in 1830. He was called to the bar at Lincoln's Inn in 1830. In 1844 he was made a Serjeant-at-Law. He was Recorder of Exeter in 1849 and became Recorder of Bristol in 1856. He was a barrister on the western Circuit and was a Deputy Lieutenant and J.P. for Somerset.Debretts House of Commons and the Judicial Bench 1870", "Kinglake married Louisa Rebecca Liddon daughter of John Liddon of Taunton in 1835. Their son Robert Kinglake was a rower in the Boat Race and at Henley Royal Regatta."]}, {"page": "The Boat Race 1864", "response": ["The Cambridge crew weighed an average of 11 st 11.5 lb (74.9 kg),  per rower more than their Dark Blue opposition. Cambridge's crew, however, was tall, averaging over  per rower. Oxford's crew contained three rowers from the previous years race in William Awdry, F. H. Kelly and W. B. R. Jacobson.  The Cambridge boat also saw three participants from the 1863 race: bow John Hawkshaw, number five Robert Kinglake and cox Francis Archer (who had also coxed the Light Blues in the 1862 race) returned."]}, {"page": "The Boat Race 1865", "response": ["The Oxford crew weighed an average of 11 st 11.25 lb (74.8 kg),  per rower more than their Light Blue opposition.  Cambridge saw the return of five former Blues, including the cox Francis Archer and number four Robert Kinglake, both of whom had represented the university twice before.Burnell, p. 58  Three of Oxford's crew had rowed in the previous year's race. "]}, {"page": "The Boat Race 1866", "response": ["In late 1865, the Cambridge University Boat Club president Robert Kinglake wrote to Oxford in order to draw up rules on the seniority of participants in the Boat Race, asserting that Cambridge could not agree to send out a challenge unless this agreement was made.MacMichael, p. 320 The proposal included the suggestion that \"no pass or πολλ man may row after one year has elapsed from the date of him having passed his final examination.  That no honour man may row after the end of his fourth year from the date of his commencing residence.\"MacMichael, p. 321 While both universities were agreed with regard to the exclusion of those reading \"ordinary\" degrees (also referred to as \"pass\" degrees, as opposed to honours degrees), Oxford rejected the second clause which would have potentially excluded a small number of rowers given the differences in timetables between the universities.MacMichael, pp. 322–323", "The two crews were nearly identical in weight: the average of the Cambridge crew was 11 st 12.875 lb (75.5 kg),  per rower more than Oxford.Dodd, p. 297  Each crew saw the return of five former Blues, including the Light Blue number six Robert Kinglake who was rowing in his fourth Boat Race; Dark Blues Robert Taunton Raikes, Brown and Charles Tottenham were making their third Boat Race appearance."]}, {"page": "Kinglake, Robert", "response": ["#redirectRobert Kinglake"]}, {"page": "Kinglake (surname)", "response": ["*Robert Kinglake (1843–1915), English rower and barrister", "*Robert Kinglake (physician) (1765–1842), English physician"]}]}}