{"wiki_id": "http://www.wikidata.org/entity/Q7341647", "itemLabel": "Robert Atwell", "itemDescription": "Bishop of Exeter; Bishop of Stockport", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Atwell", "wikipedia_page": {"main": "Robert Ronald Atwell (born 3 August 1954) is a British Anglican bishop, writer, and former Benedictine monk. Since April 2014, he has been the Bishop of Exeter. From 2008 to 2014, he was Bishop of Stockport, a suffragan bishop in the Diocese of Chester.", "link_mentions": [{"page": "Bishop of Exeter", "response": ["The Bishop of Exeter is the ordinary of the Church of England Diocese of Exeter in the Province of Canterbury.Crockford's Clerical Directory, 100th edition, (2007), Church House Publishing. . Since 30 April 2014 the ordinary has been Robert Atwell.Diocese of Exeter – Election of new Bishop of Exeter formally confirmed (Accessed 9 May 2014) ", "Henry Phillpotts served as Bishop of Exeter from 1830 to his death in office in 1869. He was England's longest serving bishop since the 14th century. The diocese was divided in 1876 along the border of Devon and Cornwall, creating the Diocese of Truro (but five parishes which were at the time in Devon were included in this diocese as they had always been within the Archdeaconry of Cornwall). The diocese covers the County of Devon. The see is in the City of Exeter where the seat is located at the Cathedral Church of Saint Peter which was founded as an abbey possibly before 690. The current incumbent is Robert Atwell.", "| 60px Robert Atwell"]}, {"page": "Diocese of Exeter", "response": ["The Diocese of Exeter is a Church of England diocese covering the county of Devon. It is one of the largest dioceses in England.  The Cathedral Church of St Peter in Exeter is the seat of the diocesan Bishop of Exeter. It is part of the Province of Canterbury. The diocesan bishop (Robert Atwell since 30 April 2014) is assisted by two suffragan bishops, the Bishop of Crediton and the Bishop of Plymouth. The See of Crediton was created in 1897 and the See of Plymouth in 1923.", "The current diocesan Bishop of Exeter is Robert Atwell, who is assisted by Nick McKinnel, Bishop suffragan of Plymouth and Jackie Searle, Bishop suffragan of Crediton. The provincial episcopal visitor (for parishes in this diocese – among twelve others in the western part of the Province of Canterbury – which do not accept the ordination of women as priests, since 1994) is the Bishop suffragan of Ebbsfleet (for traditional Anglo-Catholics), and Rod Thomas, Bishop of Maidstone (for Conservative Evangelicals); they are licensed as honorary assistant bishops in the diocese."]}, {"page": "Westcott House, Cambridge", "response": ["*Robert Atwell, current bishop of Exeter"]}]}}