{"wiki_id": "http://www.wikidata.org/entity/Q7349136", "itemLabel": "Robert Radcliffe, 1st Earl of Sussex", "itemDescription": "English Earl", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Radcliffe,_1st_Earl_of_Sussex", "wikipedia_page": {"main": "Robert Radcliffe, 10th Baron Fitzwalter, 1st Earl of Sussex, KG, KB, PC (c. 1483 – 27 November 1542), also spelled Radclyffe, Ratcliffe, Ratcliff, etc., was a prominent courtier and soldier during the reigns of Henry VII and Henry VIII who served as Chamberlain of the Exchequer and Lord Great Chamberlain.", "link_mentions": [{"page": "Sewing", "response": ["During the Middle Ages, Europeans who could afford it employed seamstresses and tailors. The vital importance of sewing was indicated by the honorific position of \"Lord Sewer\" at many European coronations from the Middle Ages. An example was Robert Radcliffe, 1st Earl of Sussex who was appointed Lord Sewer at the coronation of Henry VIII of England in 1509. Sewing for the most part was a woman's occupation, and most sewing before the 19th century was practical. Clothing was an expensive investment for most people, and women had an important role in extending the longevity of items of clothing. Sewing was used for mending. Clothing that was faded would be turned inside-out so that it could continue to be worn, and sometimes had to be taken apart and reassembled to suit this purpose. Once clothing became worn or torn, it would be taken apart and the reusable cloth sewn together into new items of clothing, made into quilts, or otherwise put to practical use. The many steps involved in making clothing from scratch (weaving, pattern making, cutting, alterations, and so forth) meant that women often bartered their expertise in a particular skill with one another. Decorative needlework such as embroidery was a valued skill, and young women with the time and means would practice to build their skill in this area. From the Middle Ages to the 17th century, sewing tools such as needles, pins and pincushions were included in the trousseaus of many European brides. Sewing birds or sewing clamps were used as a third hand and were popular gifts for seamstresses in the 19th century.Munro, Heather, \"A Little Token of Love: The Sewing Bird,\" Western Illinois Museum, February 2014Sewing Bird.  National Museum of American History. Patented 15 February 1853, to Charles Waterman of Meridan, Connecticut thumb|A sewing bird or sewing clamp provides a \"third hand\" to hold fabric taut. Watercolor by Frank McEntee, National Gallery of Art, Index of American Design."]}, {"page": "Edward Stafford, 3rd Duke of Buckingham", "response": ["By his father's marriage to Catherine Woodville, Stafford had a younger brother, Henry Stafford, 1st Earl of Wiltshire, and two sisters: Elizabeth, who married Robert Radcliffe, 1st Earl of Sussex, and Anne, who married firstly Sir Walter Herbert (d. 16 September 1507), an illegitimate son of William Herbert, 1st Earl of Pembroke,. and secondly George Hastings, 1st Earl of Huntingdon.; ; ; ."]}, {"page": "Manticore", "response": ["The manticore (mantyger) first appeared in English heraldry in c. 1470, as a badge of William Hastings, 1st Baron Hastings; and in the 16th century, it was used as a badge by Robert Radcliffe, 1st Earl of Sussex, and by Sir Anthony Babyngton."]}, {"page": "Henry Fitzalan, 12th Earl of Arundel", "response": ["His second wife was Mary, daughter of Sir John Arundell of a prominent Cornish family, and widow of Robert Radcliffe, 1st Earl of Sussex. They had no children."]}, {"page": "Baron FitzWalter", "response": ["*Robert Radcliffe, 1st Earl of Sussex, 1st Viscount FitzWalter, 10th Baron FitzWalter (d. 1542)"]}, {"page": "Henry Stafford, 1st Earl of Wiltshire", "response": ["By his father's marriage to Catherine Woodville, Stafford had an elder brother, Edward Stafford, 3rd Duke of Buckingham,According to Davies he may have had another brother, Humphrey Stafford, who died young. and two sisters, Elizabeth, who married Robert Radcliffe, 1st Earl of Sussex, and Anne, who married firstly, Sir Walter Herbert (d. 16 September 1507), an illegitimate son of William Herbert, 1st Earl of Pembroke,. and secondly, George Hastings, 1st Earl of Huntingdon.; ; ; ."]}, {"page": "Earl of Sussex", "response": ["*Robert Radcliffe, 1st Earl of Sussex (1483–1542)"]}, {"page": "Thomas Wharton, 2nd Baron Wharton", "response": ["Wharton was knighted in 1545 by Edward Seymour, 1st Earl of Hertford, and in May 1547 married Anne Radcliffe, the younger daughter of Robert Radcliffe, 1st Earl of Sussex, by his second wife, Margaret Stanley, the daughter of Thomas Stanley, 2nd Earl of Derby.; ; ."]}, {"page": "Cleeve Abbey", "response": ["Soon after Cleeve became Crown property, it was leased to Anthony Busterd for 21 years. In 1538, the freehold of the site was granted to Robert Radcliffe, 1st Earl of Sussex. The church was demolished, save for the south wall which bounded the cloister, and the rest of the abbey converted into a mansion suitable for a gentleman. By the early seventeenth century, however, Cleeve had turned into a farm. The dormitory was now a large barn, the cloister was the farmyard and the rest of the buildings were used for agricultural purposes and a farm house. A red sandstone barn was built which abuts the south-west corner of the abbey."]}, {"page": "Henry Wriothesley, 2nd Earl of Southampton", "response": ["On 19 February 1566, at her father's house in London, Southampton (aged twenty) married the thirteen-year-old Mary Browne (d. 1607), daughter of Anthony Browne, 1st Viscount Montagu, by Jane Radcliffe, the daughter of Robert Radcliffe, 1st Earl of Sussex.; . On 19 March 1566 he was admitted to Lincoln's Inn.. On reaching the age of majority in 1566 he sued his livery, and was granted licence to enter on his lands by letters patent dated 7 February 1568.. According to Elzinga, Southampton had six residences and landed income between £2000 and £3000 in the 1560s, and 'lived in a grand way, maintaining a large and lavish household'.."]}, {"page": "Thomas Stanley, 2nd Earl of Derby", "response": ["*Margaret Stanley (d. shortly after January 1534), who married Robert Radcliffe, 1st Earl of Sussex, and by him had two daughters, Jane, who married Anthony Browne, 1st Viscount Montague, and Anne, who married Thomas Wharton, 2nd Baron Wharton."]}, {"page": "Little Dunmow", "response": ["The Parish Church was founded in 1104 by Lady Juga Baynard, wife of Ralph Baynard. After her death her son Geoffrey Baynard founded in 1106 an Augustinian priory dedicated to St Mary. One of its canons served as curate to the parish. The majority of the original structure has been lost but the Lady chapel survives and became the east end of the choir of the large and stately Little Dunmow Priory church, now the Parish Church. It retains the magnificent columns and beautiful Gothic windows as evidence of its former grandeur. The monastic buildings stood to the southwest of the church but, along with much of the Priory, were razed to the ground after the Dissolution of the Monasteries, when the priory site, with the manors of Little Dunmow and Clopton Hall, were granted to the patron of the priory, Robert Radcliffe, 1st Earl of Sussex."]}, {"page": "Anthony Browne, 1st Viscount Montagu", "response": ["Anthony Browne married firstly, Jane Radcliffe, daughter of Robert Radcliffe, 1st Earl of Sussex, by whom he had twin children, a son and a daughter:"]}, {"page": "Robert Radclyffe, 1st Earl of Sussex", "response": ["#REDIRECT Robert Radcliffe, 1st Earl of Sussex"]}, {"page": "Mary Wriothesley, Countess of Southampton", "response": ["The daughter of Anthony Browne, 1st Viscount Montagu, by his first marriage to Lady Jane Radcliffe, a daughter of Robert Radcliffe, 1st Earl of Sussex, and Lady Margaret Stanley. Mary Browne had a twin brother, Anthony, but they lost their mother in the childbirth. Before 10 December 1558 Montagu married Magdalen Dacre, by whom he had three sons, Sir George, Thomas and Henry, and three daughters, Elizabeth, Mabel and Jane.G. E. Cokayne, ed. Geoffrey H. White, The Complete Peerage vol. XII, part I (London: St Catherine Press, 1953), p. 127; ."]}, {"page": "Jane Radcliffe, Viscountess Montague", "response": ["Jane Radcliffe was the daughter of Robert Radcliffe, 1st Earl of Sussex, by his second wife, Margaret Stanley, daughterMargaret had three brothers, John, Edward Stanley, 3rd Earl of Derby, and Henry. of Thomas Stanley, 2nd Earl of Derby, and Anne Hastings, the daughter of Edward Hastings, 2nd Baron Hastings. Jane had one sister, born of the same parents, Anne Radcliffe, who married Thomas Wharton, 2nd Baron Wharton.."]}, {"page": "Edward Radclyffe, 6th Earl of Sussex", "response": ["Radclyffe was the son of Sir Humphrey Radclyffe and his wife Isabel Harvey. He was the grandson of Robert Radcliffe, 1st Earl of Sussex and Elizabeth Stafford, Countess of Sussex. In 1586 he was elected Member of Parliament for Petersfield. He was elected MP for Bedfordshire in 1588 and for Portsmouth in 1593. He was elected MP for Bedfordshire again in 1597, 1601 and 1604. He was appointed Sheriff of Bedfordshire in 1598."]}, {"page": "Thomas Poynings, 1st Baron Poynings", "response": ["He married Katherine Marney, widow of George Radcliffe, a younger son of Robert Radcliffe, 1st Earl of Sussex, and elder daughter and co-heir of John Marney, 2nd Baron Marney, by whom he had an only son, baptized in March 1539, who died an infant."]}, {"page": "Little Dunmow Priory", "response": ["Never large nor rich, Little Dunmow Priory, assessed at around £150, came under the Suppression of Religious Houses Act 1535 and was closed down. Its lands were given to Robert Radcliffe, 1st Earl of Sussex."]}, {"page": "Mary Arundell (courtier)", "response": ["Mary Arundell's half brother, Sir Thomas Arundell of Wardour Castle, is said to have arranged her first marriage to Robert Radcliffe, 1st Earl of Sussex, and at the same time to have entered into negotiations with Thomas Cromwell, who wished to marry his son, Gregory, to Sir Thomas Arundell's sister, Jane Arundell (d. 1577). In the end, Jane did not marry, but served as a gentlewoman in the household of Queen Mary, and eventually returned to Lanherne, her father, Sir John Arundell (c.1474 – 8 February 1545), having provided for her financially. Jane Arundell is commemorated in St Mawgan church..", "It is now known that these four collections of sententiae from Greek and English sources (BL, Royal MSS 12 A.i–iv) were translated into Latin, not by Mary Arundell, but by Mary FitzAlan, later the first wife of Thomas Howard, 4th Duke of Norfolk, and dedicated as New Year's gifts to her father, Mary Arundell's second husband, Henry FitzAlan, 19th Earl of Arundel (d. 24 February 1580). According to Hodgson-Wright, two were written before Mary FitzAlan's marriage and two afterwards, the final one having been co-translated with Mary FitzAlan's stepbrother, Sir John Radcliffe, Mary Arundell's only surviving son from her first marriage to Robert Radcliffe, 1st Earl of Sussex..", "*Firstly on 14 January 1537, as his third wife, to Robert Radcliffe, 1st Earl of Sussex (d.1542), thus Mary Arundell became stepmother of Sussex's three sons and two daughters by his two previous marriages.  His first wife, whom he married shortly after 23 July 1505, had been Elizabeth Stafford (the elder daughter of Henry Stafford, 2nd Duke of Buckingham by his wife Katherine Woodville) by whom he had three sons His second marriage, before 1 September 1532, was to Margaret Stanley (only daughterMargaret had three brothers, John, Edward Stanley, 3rd Earl of Derby, and Henry. of Thomas Stanley, 2nd Earl of Derby by his wife Anne Hastings, daughter of Edward Hastings, 2nd Baron Hastings) by whom he had two daughters. Mary Arundell bore two sons to Sussex:"]}, {"page": "Robert Radcliffe", "response": ["*Robert Radcliffe, 1st Earl of Sussex (c. 1483–1542), courtier and soldier"]}, {"page": "John Acland (died 1620)", "response": ["*5th: Argent a bend engrailed sable (Radcliffe), as borne by Robert Radcliffe, 1st Earl of Sussex (died 1542);"]}, {"page": "Mary Hungerford", "response": ["*Anne Hastings (buried 17 November 1550), who married Thomas Stanley, 2nd Earl of Derby (d. 23 May 1521), by whom she had three sons, John, Edward Stanley, 3rd Earl of Derby, and Henry, and a daughter, Margaret, who married Robert Radcliffe, 1st Earl of Sussex.."]}, {"page": "William Hervey, 1st Baron Hervey", "response": ["Hervey married  firstly, in May 1597, Mary, dowager Countess of Southampton, widow of Sir Thomas Heneage, and formerly of Henry Wriothesley, 2nd Earl of Southampton, and daughter of Anthony Browne, 1st Viscount Montagu, by his first wife, Jane Radcliffe, daughter of Robert Radcliffe, 1st Earl of Sussex. They had no issue and she died in 1607. He married secondly on 5 February 1607, Cordell Annesley, daughter of Brian Annesley, of Lee and Kidbrooke, Kent, gentleman-pensioner, and his wife Audrey Tirrell, daughter of Tirrell, of Essex, warden of the Fleet Prison."]}, {"page": "John Radcliffe (died 1568)", "response": ["Sir John Radcliffe (31 December 1539 – 9 November 1568), was the son of Robert Radcliffe, 1st Earl of Sussex, and his third wife, Mary Arundell..", "Sir John Radcliffe, baptized on 31 December 1539 at the church of St Lawrence Pountney in London, was the younger but only surviving son of Robert Radcliffe, 1st Earl of Sussex, and his third wife, Mary Arundell. By his father's two earlier marriages he had three brothers and two sisters of the half blood.", "Sir John Radcliffe's father, Robert Radcliffe, 1st Earl of Sussex, married firstly, shortly after 23 July 1505, Elizabeth Stafford, the elder daughter of Henry Stafford, 2nd Duke of Buckingham, and Katherine Woodville, by whom he had three sons:."]}, {"page": "Anthony Browne (1552–1592)", "response": ["Browne was born at Cowdray House, Midhurst, Sussex, in 1552, the eldest son and heir of Anthony Browne, 1st Viscount Montagu (1528–1592), by his first marriage to Lady Jane Radcliffe, a daughter of Robert Radcliffe, 1st Earl of Sussex. He had a twin sister, Mary (1552–1607; later Countess of Southampton), but their mother, Lady Jane, died in childbirth. Their grandfather was another Sir Anthony Browne (died 1548), knight of the shire for Surrey, and their great-grandfather, Sir Anthony Browne (died 1506) held the office of Standard Bearer of England. By 1558 their father, Lord Montagu, had married secondly Magdalen Dacre, by whom he had three further sons, George, Thomas and Henry, and three daughters, Elizabeth, Mabel and Jane.G. E. Cokayne, ed. Geoffrey H. White, The Complete Peerage vol. XII, part I (London: St Catherine Press, 1953), p. 127;  "]}, {"page": "Chapel Cleeve Manor", "response": ["Following the Dissolution of the Monasteries the house was leased by Henry VIII to Anthony Busted however this was revoked and the estate given to Robert Radcliffe, 1st Earl of Sussex for his services to the king. In the early 17th century the property was owned by the Stewkley family who used it as a family home until 1723. It was then purchased by Sir James Langham, 7th Baronet. In the early 19th century woods were planted on the estate, when the house was extended following designs by Richard Carver."]}, {"page": "List of peers 1520–1529", "response": ["|Earl of Sussex (1529)||Robert Radcliffe, 1st Earl of Sussex||1529||1542||New creation; Viscount Fitzwalter in 1525"]}, {"page": "List of peers 1530–1539", "response": ["|Earl of Sussex (1529)||Robert Radcliffe, 1st Earl of Sussex||1529||1542||"]}, {"page": "List of peers 1540–1549", "response": ["|rowspan=\"2\"|Earl of Sussex (1529)||Robert Radcliffe, 1st Earl of Sussex||1529||1542||Died"]}, {"page": "John Arundell (1474–1545)", "response": ["**Mary Arundell (died 1557) who married firstly, Robert Radcliffe, 1st Earl of Sussex and secondly, Henry FitzAlan, 19th Earl of Arundel. She was a Lady in waiting to Jane Seymour (1536), Anne of Cleaves, and Princess Mary in 1539. She is sometimes confused with her step daughter Mary FitzAlan."]}, {"page": "List of portrait drawings by Hans Holbein the Younger", "response": ["| The precise identity of the sitter is unknown. Robert Radcliffe, 1st Earl of Sussex had three wives, the third one, prominent courtier Mary Arundell being the most likely candidate.Parker 1945, p.41 The wife of the Earl's third son Sir Humphrey Radcliffe has also been suggested."]}]}}