{"wiki_id": "http://www.wikidata.org/entity/Q7347466", "itemLabel": "Robert McCance", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_McCance", "wikipedia_page": {"main": "Robert Alexander McCance, CBE, FRS (9 December 1898 in Ulster– 3 March 1993 in Cambridge) was a paediatrician, physiologist, biochemist and nutritionist and was the first Professor of Experimental Medicine at the University of Cambridge.", "link_mentions": [{"page": "Sidney Sussex College, Cambridge", "response": ["The college's strong tradition in the sciences is seen by the association of the Nobel Prize–winning physicists Cecil Frank Powell and C. T. R. Wilson, 1997 Nobel Prize in Chemistry recipient John E. Walker and the 2002 Nobel prize in Chemistry recipient Alan MacDiarmid. Sir Benjamin Lockspeiser, the first president of CERN was also an undergraduate at the college, along with psychiatrist W. Ross Ashby. Robert McCance Professor of Experimental Medicine, played a leading part in wartime rationing and 1940s government nutrition efforts. Professor Dame Ann Dowling has been a Fellow since 1977 and is the President of the Royal Academy of Engineering. The inaugural recipient of the Rosalind Franklin award Professor Sue Gibson was an undergraduate at the college. The \"father of radio astronomy in Australia\" Joe Pawsey obtained his PhD at Sidney Sussex in 1935."]}, {"page": "Rationing", "response": ["Rationing on a scientific basis was pioneered by Elsie Widdowson and Robert McCance at the Department of Experimental Medicine, University of Cambridge. They worked on the chemical composition of the human body, and on the nutritional value of different flours used to make bread. Widdowson also studied the impact of infant diet on human growth. They studied the differing effects from deficiencies of salt and of water and produced the first tables to compare the nutritional contents of foods before and after cooking. They co-authored The Chemical Composition of Foods, first published in 1940 by the Medical Research Council. Their book, \"McCance and Widdowson\", became known as the dietician's bible and formed the basis for modern nutritional thinking."]}, {"page": "Royal Naval Air Service", "response": ["* Robert McCance – later Professor of Experimental Medicine, Cambridge University"]}, {"page": "1940 in science", "response": ["* Robert McCance and Elsie Widdowson publish the standard text The Chemical Composition of Foods."]}, {"page": "King's College Hospital", "response": ["* Robert McCance (1898-1993) Effects of salt deficiency, iron regulation mechanism, The Chemical Composition of Foods, modern nutrition"]}, {"page": "Rationing in the United Kingdom", "response": ["In December 1939, Elsie Widdowson and Robert McCance of the University of Cambridge tested whether the United Kingdom could survive with only domestic food production if U-boats ended all imports. Using 1938 food production data, they fed themselves and other volunteers one egg,  of meat and  of fish a week;  of milk a day;  of margarine; and unlimited amounts of potatoes, vegetables and wholemeal bread. Two weeks of intensive outdoor exercise simulated the strenuous wartime physical work Britons would likely have to perform. The scientists found that the subjects' health and performance remained very good after three months; the only negative results were the increased time needed for meals to consume the necessary calories from bread and potatoes, and what they described as a \"remarkable\" increase in flatulence from the large amount of starch in the diet. The scientists also noted that their faeces had increased by 250% in volume."]}, {"page": "Elsie Widdowson", "response": ["Elsie Widdowson  (21 October 1906 – 14 June 2000), was a British dietitian and nutritionist. She and Dr Robert McCance, a pediatrician, physiologist, biochemist, and nutritionist, were responsible for overseeing the government-mandated addition of vitamins to food and wartime rationing in Britain during World War II.", "Widdowson met Robert McCance in the kitchens at King's College Hospital in 1933, when she was studying industrial cooking techniques as part of her diploma on dietetics. McCance was a junior doctor researching the chemical effects of cooking as part of his clinical research on the treatment of diabetes. Widdowson pointed out an error in McCance's analysis of the fructose content of fruit, based on her PhD research. Instead of being offended, McCance obtained a grant for Widdowson to analyze and correct all previous data. From there on they became scientific partners and worked together for the next 60 years, until McCance died in 1993. A few years after the first grant, McCance obtained a second grant for Widdowson to continue working on the food composition of fruits, vegetables, and nuts."]}, {"page": "List of Old St. Beghians", "response": ["* Robert McCance (1898–1993), Professor of Experimental Medicine, Cambridge University."]}, {"page": "McCance", "response": ["*Robert McCance (1898–1993), British academic"]}, {"page": "Robert Alexander McCance", "response": ["#REDIRECTRobert McCance"]}, {"page": "Neonatal Society", "response": ["Previous presidents include David Hull, Robert McCance, Peter Tizard, Elsie Widdowson, Maureen Young, Andrew Wilkinson and, the current president-elect of the British Medical Association, Neena Modi."]}]}}