{"wiki_id": "http://www.wikidata.org/entity/Q7340478", "itemLabel": "Rob Purdie", "itemDescription": "Footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Purdie", "wikipedia_page": {"main": "Robert James Purdie (born 28 September 1982) is an English retired footballer who last played for Hereford as a midfielder.\nPurdie was a versatile Utility player who played primarily as an attacking midfielder, but he could also play in the full-back position, in midfield, or in the \"hole\" as a striker.", "link_mentions": [{"page": "Hereford United F.C.", "response": ["*  Rob Purdie"]}, {"page": "Jon Worthington", "response": ["On 26 May 2009, he joined Oldham Athletic, becoming Dave Penney's second new signing after Rob Purdie."]}, {"page": "Andy Williams (footballer, born 1986)", "response": ["His first season in the Football League saw him played out of position on the right wing for the majority of the season resulting in 48 first team appearance, with only Rob Purdie and Alan Connell making more appearances. Williams' eight goals also made him third highest goalscorer, and he was awarded the Away Goal of the Season for his goal against Bury."]}, {"page": "Paul Green (footballer, born 1987)", "response": ["It was announced on 8 July 2014 that Paul Green had returned to his former club Tamworth of the Conference North. Following a disappointing start to the season, manager Dale Belford left the club, Green was asked to perform the role of caretaker assistant manager, working alongside Rob Purdie, who took on the role of caretake manager. The pair only led the team for one game, a 1–1 home draw with Colwyn Bay."]}, {"page": "2006 Conference National play-off Final", "response": ["As early as the 6th minute there was controversy as Hereford captain Tamika Mkandawire handled the ball in his own penalty area, but the offence was not spotted by referee Dean Whitestone.\"Green's art gives Turner prize of League return\". The Independent. London. 21 May 2006. Retrieved 12 May 2008. Both teams had shots on target in the first 25 minutes before Halifax took the lead. Hereford had briefly been reduced to 10 men while Rob Purdie received treatment for a cut lip. While he was being treated, Greg Young's cross was not properly cleared and a lucky ricochet fell to Lewis Killeen, who curled a shot into the top corner from outside the area.", "|MF ||21||Rob Purdie"]}, {"page": "2007–08 Hereford United F.C. season", "response": ["|  Rob Purdie"]}, {"page": "2006–07 Hereford United F.C. season", "response": ["|align=\"left\"|6||align=\"left\"|MF||align=\"left\"| Rob Purdie"]}, {"page": "2008–09 Oldham Athletic A.F.C. season", "response": ["| align=left|–  || align=left|MF || align=left| Rob Purdie", " | Rob Purdie"]}, {"page": "Purdie", "response": ["* Rob Purdie (born 1982), English footballer"]}, {"page": "2010–11 Torquay United F.C. season", "response": ["When new loan signing Jake Robinson scored after ten minutes of his debut against Hereford on the first day of the month, Torquay United looked set to put the misery of their FA Cup exit behind them.  However, even before the game had reached half time, it was made known to Paul Buckle that Robinson's registration had not been completed before the required deadline and was actually ineligible to play in the fixture.  With the possibility of any points won from the match being deducted by the FA, Buckle was unable to prevent the demoralised Gulls from slipping to a 3–1 defeat. Incredibly, it emerged days later that Hereford had also fielded an ineligible player in the same game, with midfielder Rob Purdie’s registration also not being completed in time for the match.", "The saga regarding the fielding of the unregistered Jake Robinson in the February match against Hereford was finally resolved with Torquay receiving a one-point deduction and a £10,000 fine.  With Hereford playing the equally ineligible Rob Purdie in the same match, they were also fined £10,000 and deducted the three points they had gained from the match. While it could be argued that, having lost a point they had never gained in the first place, the Gulls were more harshly treated than the Bulls, Torquay decided not to appeal against the Football League's ruling."]}, {"page": "2010–11 Hereford United F.C. season", "response": ["|align=\"left\"| 32 ||align=\"left\"|MF||align=\"left\"| Rob Purdie", "| Rob Purdie", "| Rob Purdie"]}, {"page": "2010–11 Oldham Athletic A.F.C. season", "response": ["|Rob Purdie "]}, {"page": "Aidan Thomas", "response": ["Thomas, a Hereford United youth team graduate, was handed the number 19 shirt for the 2010–11 season, signing a one-year professional deal. However, he started his professional career battling against injury. He recovered to make his debut on 6 November 2010, replacing Rob Purdie 75 minutes into a 5–1 home win over Hythe Town in the FA Cup First Round. His second appearance came in the Fourth Round of the competition, he replaced James McQuilkin on 81 minutes as Sheffield Wednesday won 4–1 at Hillsborough on 29 January 2011. In March 2011 he joined AFC Telford United on a months loan in order to gain first team experience. He was released by Hereford at the end of the season after failing to break into the first team, he then joined local side Westfields. He had a trial with Stoke city in April 2012."]}, {"page": "A49 derby", "response": ["* Rob Purdie"]}]}}