{"wiki_id": "http://www.wikidata.org/entity/Q7340959", "itemLabel": "Robbie Mustoe", "itemDescription": "professional footballer (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_Mustoe", "wikipedia_page": {"main": "Robin \"Robbie\" Mustoe (born 28 August 1968) is an English retired footballer who now works as a commentator for NBC Sports. He made nearly 500 appearances in the Football League and Premier League, playing as a defensive midfielder for Oxford United, Middlesbrough, where he spent the majority of his career, Charlton Athletic and Sheffield Wednesday.Mustoe was born in Witney, Oxfordshire.", "link_mentions": [{"page": "Lexington, Massachusetts", "response": ["* Robbie Mustoe, former English Footballer, current ESPN analyst"]}, {"page": "List of sports announcers", "response": ["* Robbie Mustoe – ESPN UK/ESPN/ABC 2008–2013, NBC 2013–present"]}, {"page": "Harry Kewell", "response": ["Kewell scored a goal against Croatia which took Australia through to the knockout stages of the 2006 FIFA World Cup, the Australian national team's second World Cup. He is a member of the Executive Committee of the Australian Professional Footballers' Association. Kewell also has a British passport through his father's heritage. Former Middlesbrough midfielder-turned pundit Robbie Mustoe named Kewell as one of the greatest players he had played against but questioned his consistency and attitude after his initial injuries. Former German international Michael Ballack has also highlighted Kewell's ability and inconsistency."]}, {"page": "Witney", "response": ["*Robbie Mustoe, footballer, notably with Middlesbrough"]}, {"page": "Steve McManaman", "response": ["In late November 2010 and in May 2011, McManaman was the halftime in-studio analyst alongside Gary Lineker and Trevor Francis for La Liga's El Clásico broadcast on Al Jazeera Sports +3. McManaman and Darke were the main ESPN commentary team for Euro 2012, while McManaman was also a guest on daily panel show, ESPN PressPass (now re-branded as ESPN FC), alongside Steve Nicol, Robbie Mustoe, Shaka Hislop, Robbie Earle and Gabriele Marcotti."]}, {"page": "NBC Sports", "response": ["* Premier League on NBC – Lee Dixon, Graeme Le Saux, Tim Howard, Robbie Earle, Robbie Mustoe,  Danny Higginbotham, Stephen Warnock", "* Premier League on NBC – Robbie Mustoe, Robbie Earle, Tim Howard, Danny Higginbotham"]}, {"page": "Derek Rae", "response": ["In June 2010, he was in South Africa to commentate on 12 matches at the 2010 FIFA World Cup finals for ESPN USA partnered by Robbie Mustoe and Ally McCoist. In the summer of 2010 it was announced that Rae would be making the move back to the UK to continue commentating on a wider basis for ESPN's London-based channel."]}, {"page": "Adrian Healey", "response": ["Healey started work in the US in 1992 as a mid day DJ for Boston's WFNX. He then got a TV job commentating for the New England Revolution, replacing the departing Derek Rae. He left the Revolution to join ESPN, where he started with play-by-play commentary with Robbie Mustoe on ESPN2's alternate broadcast of UEFA Champions League play."]}, {"page": "1997 FA Cup Final", "response": ["|CM ||8 || Robbie Mustoe || || "]}, {"page": "David Murphy (footballer, born 1984)", "response": ["Murphy signed his first professional contract with Premier League side Middlesbrough in August 2001, having previously been part of the club's youth academy. He made his professional debut in a 3–1 victory over Northampton Town in the League Cup on 11 September 2001, a game where he also scored his first ever senior goal. He appeared in Middlesbrough's next League Cup match, a 2–1 defeat to Blackburn Rovers, before making his FA Cup debut on 16 February 2002, in a 1–0 victory over Blackburn. Three days later, he made his Premier League debut in a 2–1 victory over Fulham, coming off the substitute's bench around the hour mark to replace Robbie Mustoe. He went on to make a total of eight appearances during the 2001–02 season, scoring one goal."]}, {"page": "PressPass", "response": ["ESPN FC PressPass was a 60-minute show which airs six times a week, Sunday to Friday, and features robust soccer discussion between presenters Andrew Orsatti, Adrian Healey, Dan Thomas and analysts including Robbie Mustoe, Gabriele Marcotti, Tommy Smyth, Janusz Michallik, Shaka Hislop, Robbie Earle, Steve Nicol, Stewart Robson, Craig Burley, Sid Lowe, Julien Laurens, Raphael Honigstein, Martin Ainstein, Steve McManaman, Frank Leboeuf and Martin Keown."]}, {"page": "1997 Football League Cup Final", "response": ["|MF ||8 || Robbie Mustoe", "|CM ||8 || Robbie Mustoe"]}, {"page": "1998 Football League Cup Final", "response": ["|CM ||6 || Robbie Mustoe"]}, {"page": "List of FIFA World Cup broadcasters", "response": ["|Efan EkokuJohn HarkesRobbie MustoeAlly McCoistRoberto Martínez"]}, {"page": "2002–03 Middlesbrough F.C. season", "response": ["|30 August 2002|| Robbie Mustoe||Charlton Athletic||Free"]}, {"page": "2001–02 Middlesbrough F.C. season", "response": ["* CM: #7,  Robbie Mustoe, 38"]}, {"page": "Ross Dyer", "response": ["At ESPN International he presents for ESPN FC, and commentates: UEFA Champions League, UEFA Europa League, Serie A, La Liga, Bundesliga, 2.Bundesliga, DFB-Pokal, UEFA European Championship, FIFA World Cup Qualifying matches from Europe and South America. His co-commentators have included: Frank Leboeuf, Robbie Mustoe, Craig Burley, Shaka Hislop, Kyle Martino, Shep Messing, Tommy Smyth, Janusz Michallik, Paul Mariner and Steve Nicol."]}, {"page": "List of current Major League Soccer broadcasters", "response": ["|Alexi Lalas (select games)Robbie Earle (select games)Robbie Mustoe (select games)Stuart Holden (select games)Angela Hucles (select games)Warren Barton (select games)Mariano Trujillo (select games)Lori Lindsey (select games)Danielle Slaton (select games)Heath Pearce (select games)Rodolfo Landeros (select games)Christopher Sullivan (select games)Aly Wagner (select games)"]}, {"page": "1998–99 Middlesbrough F.C. season", "response": ["|align=\"left\"|7||align=\"left\"|MF||align=\"left\"| Robbie Mustoe"]}, {"page": "NBCSN", "response": ["* Robbie Mustoe: studio analyst (2013–present)"]}, {"page": "MLS on NBC", "response": ["* Robbie Mustoe – alternate color commentator"]}, {"page": "Match of the Day (American TV series)", "response": ["Match of the Day is a program that airs on NBCSN. The show, based on the BBC version also titled Match of the Day, features highlights of the day's Premier League action most Saturdays.  A sister program, Match of the Day II, which also bears the same name as its BBC counterpart, highlights the Sunday fixtures. The show is hosted by Rebecca Lowe and features analysis by Robbie Earle, Robbie Mustoe and Kyle Martino, as well as contributions by the UK counterpart's respective host and commentator Gary Lineker and Steve Bower, and Neil Ashton."]}, {"page": "Mustoe (surname)", "response": ["*Robbie Mustoe (born 1968), English footballer, manager and commentator"]}, {"page": "1990–91 Middlesbrough F.C. season", "response": ["| July 1990 || Robbie Mustoe|| Oxford United||£396,000"]}, {"page": "Premier League on NBC", "response": ["* Studio analysts: Robbie Earle, Robbie Mustoe, Tim Howard, Danny Higginbotham"]}]}}