{"wiki_id": "http://www.wikidata.org/entity/Q7345346", "itemLabel": "Robert Hayward", "itemDescription": "British Conservative Party politician (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Hayward,_Baron_Hayward", "wikipedia_page": {"main": "Robert Antony Hayward, Baron Hayward,  (born 11 March 1949) is a British Conservative Party politician.", "link_mentions": [{"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Robert Hayward, Baron Hayward"]}, {"page": "Roger Berry", "response": ["Berry was selected to contest the marginal seat of Kingswood at the 1987 General Election and was defeated by Robert Hayward by over 4,000 votes. Berry again contested Kingswood against Hayward at the 1992 General Election and this time was victorious, winning the seat with a majority of 2,370. He made his maiden speech on 10 June 1992."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Robert Hayward"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Robert Hayward"]}, {"page": "Dave Allen (comedian)", "response": ["This prompted MP Robert Hayward to ask a parliamentary question about \"offensive language\" in broadcasting. In 1993, Allen returned to ITV, where he starred in the Dave Allen Show, which was his final regular television series."]}, {"page": "Kingswood (UK Parliament constituency)", "response": ["| Robert Hayward"]}, {"page": "List of Old Abingdonians", "response": ["* Robert Hayward, Baron Hayward OBE (born 1949), Conservative MP for Kingswood"]}, {"page": "1993 in the United Kingdom", "response": ["* 29 July – Conservative Party loses the Christchurch by-election to the Liberal Democrats – a seat they have held since 1910. New MP Diana Maddock gains more than 60% of the vote – twice as many as the Conservative candidate Robert Hayward. This sees the Conservative parliamentary majority fall to 17 seats."]}, {"page": "United Kingdom by-election records", "response": ["*1993 Christchurch by-election: Robert Hayward loses one of the Conservatives' safest seats to the Liberal Democrats."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Robert Hayward"]}, {"page": "Kings Cross Steelers", "response": ["* Robert Hayward, Baron Hayward"]}, {"page": "LGBT+ Conservatives", "response": ["* Lord Robert Hayward"]}, {"page": "Rob hayward", "response": ["#REDIRECT Robert Hayward, Baron Hayward"]}, {"page": "1993 in England", "response": ["** Conservative Party loses the Christchurch by-election to the Liberal Democrats - a seat they have held since 1910. New MP Diana Maddock gains more than 60% of the vote - twice as many as the Conservative candidate Robert Hayward."]}, {"page": "Rob Hayward", "response": ["#REDIRECT Robert Hayward, Baron Hayward"]}, {"page": "2015 Dissolution Honours", "response": ["* Robert Hayward , to be Baron Hayward, of Cumnor in the County of Oxfordshire"]}, {"page": "Robert Hayward", "response": ["Robert Hayward may refer to:", "* Robert Hayward, Baron Hayward (born 1949), British Conservative politician"]}, {"page": "Baron Hayward", "response": ["#REDIRECT Robert Hayward, Baron Hayward"]}, {"page": "List of LGBT politicians in the United Kingdom", "response": ["|Robert Hayward"]}, {"page": "2019 United Kingdom local elections", "response": ["Leading up to the election journalist had noted the high turnout of the 2015 local election, when the 2015 general election took place, benefited the Conservatives greatly. Various sources have predicted a loss of seats for the Conservatives between 500 and 1000; with Conservative peer Lord Robert Hayward projected that them losing at least 800 seats, predicting 500 to go to the Liberal Democrats and 300 to Labour. Because the group of local councils varies with each cycle of local elections, the BBC and other analysts calculated a projected national vote share, which aims to assess what the council results indicate the UK-wide vote would be if the results were repeated at a general election. The BBC's estimate put Labour and the Conservatives on 28% (both down 7% from last year), the Liberal Democrats on 18% (up 2% from last year) and all other parties as 'other' on 25%. Some have argued that the Conservatives put their expectations so low so that the impact of losses were reduced. Media reports described the results as poor for both Labour and the Conservatives, with many noting decline of Labour representation in some leave areas. It was also regarded as a disappointing result for the Labour because of expectations that they would gain."]}, {"page": "List of University of Zimbabwe people", "response": ["* Lord Robert Hayward; British politician and Member of Parliament 1983–1992"]}, {"page": "2019 Bath and North East Somerset Council election", "response": ["Following the 2015 election, the council was controlled by the Conservative Party, although previously the council had been under no overall control since its creation in 1996. In the New Statesman, the journalist Stephen Bush wrote that if the Conservatives maintained control of Bath and North East Somerset in 2019, it would represent a strong national performance for the party. Conservative peer Robert Hayward predicted that the Liberal Democrats would gain several seats on the council from the Conservatives due to a \"Brexit penalty\"."]}]}}