{"wiki_id": "http://www.wikidata.org/entity/Q7340307", "itemLabel": "Rob Lewis", "itemDescription": "British entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Lewis_(entrepreneur)", "wikipedia_page": {"main": "Rob Lewis (born 23 May 1969) is an English businessman and serial entrepreneur. Lewis has established several publishing and technology ventures including Business & Technology magazine, Cromwell Media, Silicon Media Group, Omnifone, rara.com and most recently ROXi. Lewis is a 2009 Ernst & Young Entrepreneur of the Year.", "link_mentions": [{"page": "MusicStation", "response": ["* 14 January 2003: British Entrepreneurs Rob Lewis, Phil Sant and Mark Knight form Omnifone", "*Rob Lewis"]}, {"page": "Robert Lewis", "response": ["*Rob Lewis, fictional character in Neighbours", "*Rob Lewis (producer) (born 1976), American music arranger and musical director", "*Rob Lewis (record producer) (active since 1982), American record producer", "*Rob Lewis (entrepreneur) (born 1969), entrepreneur and executive chairman of Omnifone", "*Rob Lewis (marine scientist), director of SARDI"]}, {"page": "Omnifone", "response": ["Omnifone was privately funded by the company's founders Rob Lewis, Phil Sant and Mark Knight with additional funding from diversified alternative investment firm Sofaer Capital.", "UK entrepreneurs Rob Lewis, Phil Sant and Mark Knight established Omnifone in January 2003 after more than seven years working together in the internet space founding software development company Cromwell Media (sold to InterX for £850m in 2000) and IT industry news site Silicon.com (sold to NASDAQ-listed CNET Networks, part of CBS in 2001). The trio founded Omnifone to enable the next generation of digital content services to be delivered globally. The company spent four years developing its unlimited music service platform before announcing MusicStation in February 2007.", "*14 January 2003: British Entrepreneurs Rob Lewis, Phil Sant and Mark Knight form Omnifone", "* Ernst & Young UK Entrepreneur of the Year Awards 2009: London & South – Rob Lewis, CEO, Omnifone", "* PwC UK Technology, Innovation & Growth Awards 2008 Entrepreneur of the Year – Rob Lewis, CEO, Omnifone"]}, {"page": "Rob Lewis (record producer)", "response": ["Rob Lewis is a record producer from the Bronx, New York who met D.J. Chuck Chillout, a legendary New York hip-hop D.J. and radio personality, and crew (Kool Chip, Deuces Wild and D.J. Funkmaster Flex) during the late 1980s / early 1990s and was asked to do pre-production on Chuck and Chip's album, \"Rhythm is the Master\"."]}]}}