{"wiki_id": "http://www.wikidata.org/entity/Q7340519", "itemLabel": "Rob Ryan", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Ryan_(artist)", "wikipedia_page": {"main": "Rob Ryan (born 1962) is a British  visual artist who specialises in Papercutting and screen-printing. He is known for his detailed paper cut outs. His artwork has featured in Vogue, Elle, and Stylist. He has also collaborated with fashion designer Paul Smith.Ryan has illustrated book and album covers, including John Connolly's novel The Book of Lost Things, Erasure's album Nightbird, Louis de Bernières short-story collection Notwithstanding and Dara Horn's novel The World to Come. His first book, This Is for You, was published in October 2007 by Hodder & Stoughton; it consists of a fairy tale told through his paper cut-out art and explores themes of love and loneliness. Ryan also creates the Global Gift greeting cards for the charity Trocaire.", "link_mentions": [{"page": "Kate Greenaway Medal", "response": ["* Rob Ryan, The Gift (Barefoot Books), by Carol Ann Duffy"]}, {"page": "Olympia London", "response": ["In 2012, Olympia celebrated 125 years of events by commissioning British artists Peter Blake, Rob Ryan, Sanna Annukka and Paul Hicks to create their interpretations of the venues."]}, {"page": "Nightbird (Erasure album)", "response": ["The album graphic artwork was made by the British artist Rob Ryan."]}, {"page": "Papercutting", "response": ["* Rob Ryan, British papercut and serigraph artist"]}, {"page": "Clothkits", "response": ["After a period of hibernation, the Clothkits brand was bought in 2007 by artist Kay Mawer and the company relaunched in early 2008.  Clothkits continue to produce kit clothing, also available pre-assembled, inspired by the original concept. Collaborations with contemporary artists and designers form the core of the business, and partnerships include with screen printer Jane Foster, papercut artist Rob Ryan and designers People Will Always Need Plates."]}, {"page": "Robert Ryan (disambiguation)", "response": ["* Rob Ryan (born 1962), American football coach", "* Rob Ryan (artist) (born 1962), British visual artist", "* Rob Ryan (baseball) (born 1973), former baseball outfielder", "* Rob Ryan (businessman), co-owner of the Las Vegas Locomotives", "* Rob Ryan (entrepreneur) (born 1948), founder of Ascend Communications and Entrepreneur America"]}, {"page": "Tatty Devine", "response": ["They have designed ranges for the Tate galleries across the UK, Victoria and Albert Museum, South Bank and the Baltic Gateshead where Tatty Devine created 'Angel of the North' jewellery for artist Anthony Gormley. Limited pieces have also been made for the artists Mark Pawson and Rob Ryan,Rob Ryan and Tatty Devine DazedDigital.com and Basso & Brooke,", "In 2004 Tatty Devine created 'Join The Circus' which included pieces they still make today including the Horse and Carriage necklace, Trapeze Necklace, and their Dinosaur necklace. Their friend and artist Rob Ryan screen printed a small selection of clothing with Price Tickets printed on."]}, {"page": "Stylist (magazine)", "response": ["Stylist has commissioned children's author and illustrator Quentin Blake and artist Rob Ryan to create bespoke front covers.Stylist lines up Quentin Blake as new cover star, guardian.co.uk"]}, {"page": "Coast (magazine)", "response": ["In The Great Seaside Poster Revival (June 2010), seven artists (Rob Ryan, Angie Lewin, Barbara Hulanicki, Nick Higgins, Wayne and Gerardine Hemingway, Andy Tuohy and Christopher Wormell) were asked to reinvent the seaside poster to publicise a chosen resort. The original artwork of each of these posters was auctioned on eBay with funds raised (£5,000) going to the Marine Conservation Society. Readers also submitted their own designs in a related competition."]}]}}