{"wiki_id": "http://www.wikidata.org/entity/Q7344770", "itemLabel": "Robert Gilfillan", "itemDescription": "British poet and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Gilfillan", "wikipedia_page": {"main": "Robert Gilfillan (7 July 1798 – 4 December 1850) was a Scottish poet and songwriter.", "link_mentions": [{"page": "Dunfermline", "response": ["In literature, the critically acclaimed author, Iain Banks; poet and novelist, John Burnside and Robert Gilfillan all have links to the town."]}, {"page": "1850 in literature", "response": ["*December 4 – Robert Gilfillan, Scottish poet (born 1798)"]}, {"page": "Robert Fergusson", "response": ["The poet Robert Burns privately commissioned and paid for a memorial headstone of his own design in 1787, which was erected in 1789. The stone was restored in April 1850 by the poet Robert Gilfillan.Oxford Dictionary of National Biography: Robert Gilfillan In the later nineteenth century, Robert Louis Stevenson intended to renovate the stone, but died before he could do so. The epitaph that Stevenson planned to add to the stone is recorded on a plaque added to the grave by the Saltire Society on the Society's 50th anniversary in 1995."]}, {"page": "List of Scottish musicians", "response": ["*Robert Gilfillan (1798–1850), poet and songwriter"]}, {"page": "1850 in the United Kingdom", "response": ["** Robert Gilfillan, poet (born 1798)"]}, {"page": "Gilfillan", "response": ["* Robert Gilfillan (1798–1850), Scottish songwriter"]}, {"page": "South Leith Parish Church", "response": ["The graveyard or kirkyard is the burial place for the playwright John Home, author of Douglas, and John Pew, the man from whom the author Robert Louis Stevenson reputedly derived the character of Blind Pew in the novel Treasure Island. Pew was a maltman and was reputed to have had 25 children. Stevenson was related to the Balfour family so he may have seen the Pew grave whilst visiting the church of his family. Other notable people are Adam Whyte who was Leith's first Provost, Hugo Arnot, historian, and John Hadaway, Lieutenant of the Bellerophon during the Battle of the Nile which no longer exists (whose memorial no longer exists?). The poet and songwriter Robert Gilfillan lies just to the south-east of the church."]}, {"page": "Bobby Gilfillan", "response": ["*Robert Gilfillan, Scottish poet and songwriter"]}, {"page": "List of Scottish poets", "response": ["*Robert Gilfillan"]}, {"page": "Gilfillan, Robert", "response": ["#redirectRobert Gilfillan"]}]}}