{"wiki_id": "http://www.wikidata.org/entity/Q7349364", "itemLabel": "Robert Rollins", "itemDescription": "English cricketer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Rollins", "wikipedia_page": {"main": "Robert John Rollins (born 30 January 1974) is a former English cricketer. Rollins was a right-handed batsman who bowled right-arm medium pace, but played primarily as a wicketkeeper.\nIn a career that lasted 11 years, he represented Essex in first-class cricket and List-A cricket, Cambridgeshire in Minor Counties and List-A cricket and Huntingdonshire in List-A cricket.In his 7-year career with Essex, he forged a successful, if inconsistent first-class career.  He played 69 first-class matches, where he scored 2,258 runs at a batting average of 22.35, with 11 half centuries and a single century.  His highest score in first-class cricket was 133*.  Behind the stumps he took 158 catches and made 21 stumpings.  In List-A cricket, he played from 1993 to 2003 with a number of counties, playing a total of 109 matches, where he scored 1,197 runs at an average of 17.86.  In the process, he made 6 half centuries with a high score of 87*.  Behind the stumps he took 87 catches and made 26 stumpings.\nHis brother Adrian played first-class and List A cricket for Derbyshire and Northamptonshire.\n\n", "link_mentions": [{"page": "NBC Denis Compton Award", "response": ["*Essex – Robert Rollins"]}, {"page": "Adrian Rollins", "response": ["Rollins has two brothers who have both played cricket, Gary Rollins and Robert Rollins."]}, {"page": "List of Essex List A cricket records", "response": ["| 6th || 127 ||  Stuart Law Robert Rollins || v Hampshire || Southampton || 1996"]}, {"page": "List of Cambridgeshire County Cricket Club List A players", "response": ["*Robert Rollins, 4 matches, 2001–2003"]}, {"page": "List of international under-19 cricket records", "response": ["* 36 –  Robert Rollins; 1991–1993", "* 14 –  Andrew Flintoff;  Shoaib Malik;  Robert Rollins"]}, {"page": "Rollins, Robert", "response": ["#redirectRobert Rollins"]}]}}