{"wiki_id": "http://www.wikidata.org/entity/Q7347034", "itemLabel": "Robert Lucas Chance", "itemDescription": "British glass maker", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Lucas_Chance", "wikipedia_page": {"main": "Robert Lucas Chance (8 October 1782 – 7 March 1865), known as Lucas Chance, was an English glass merchant and manufacturer in Birmingham. He founded the company which became Chance Brothers.", "link_mentions": [{"page": "Key Hill Cemetery", "response": ["*Robert Lucas Chance (d. 1897): director of Chance Brothers, glass makers of Smethwick. Plot 902.K."]}, {"page": "Peace Society", "response": ["*Robert Lucas Chance; founder of Chance Brothers glassworks"]}, {"page": "Chance Brothers", "response": ["thumb|upright|Robert Lucas Chance – from a photograph", "Robert Lucas Chance (8 October 1782 – 7 March 1865), known as 'Lucas', bought the British Crown Glass Company's works in Spon Lane in 1824. The company specialised in making crown window glass.Revolutionary Players  The company ran into difficulty and its survival was guaranteed in 1832 by investment from Chance's brother, William (29 August 1788 – 8 February 1856) who owned an iron factoring business in Great Charles Street, Birmingham. After the partnership with the Hartley Brothers was dissolved in 1836, Lucas and William Chance became partners in the business, which was renamed Chance Brothers and Company."]}, {"page": "Georges Bontemps", "response": ["Georges Bontemps was a director of a French glass manufacturer based at Choisy-le-Roi until 1848. In 1830, he acted as an agent to the Englishman Robert Lucas Chance, assisting in the recruitment of French and Belgian glass workers to work for him - an illegal act that could have resulted in both men being imprisoned. Chance was looking for ways to improve the production of flat glass at his newly formed factory in Smethwick, Birmingham."]}, {"page": "Hartley Wood and Co", "response": ["John Hartley of Dumbarton, Scotland, moved to the Nailsea, near Bristol, England, in 1812 and began working with Robert Lucas Chance at the  Nailsea Glassworks. On 1 April 1828, he transferred to the British Crown Glass Company manufactory at Oldbury (then Worcestershire), which had been bought up by Robert Lucas Chance in 1824. By 1832 British Crown Glass was experimenting with the new sheet glass manufacturing method, which required French workers to make it and this was not favoured by Hartley's two sons, James and John. After John Hartley Snr. died in 1833, the two brothers were taken into partnership by Robert Lucas Chance in 1834 and the firm became known as Chances and Hartleys in 1834."]}, {"page": "Nailsea Glassworks", "response": ["John Hartley of Hartley Wood and Co moved to Nailsea in 1812 and began working with Robert Lucas Chance who was the eldest son of William Chance, one of the partners. In the 1820s a new cone was built which survived until 1905, and in the 1840s the\"Lily cone\" was added for the production of sheet glass."]}]}}