{"wiki_id": "http://www.wikidata.org/entity/Q7349995", "itemLabel": "Robert Stanford Tuck", "itemDescription": "British fighter pilot and test pilot", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Stanford_Tuck", "wikipedia_page": {"main": "Wing Commander Robert Roland Stanford Tuck,  (1 July 1916 – 5 May 1987) was a British fighter pilot, flying ace and test pilot. Tuck joined the Royal Air Force (RAF) in 1935 and first engaged in combat during the Battle of France, over Dunkirk, claiming his first victories. In September 1940 he was promoted to squadron leader and commanded a Hawker Hurricane squadron. In 1941–1942, Tuck participated in fighter sweeps over northern France. On 28 January 1942, he was hit by anti-aircraft fire, was forced to land in France, and was taken prisoner. At the time of his capture, Tuck had claimed 29 enemy aircraft destroyed, two shared destroyed, six probably destroyed, six damaged and one shared damaged.", "link_mentions": [{"page": "Catford", "response": ["*Robert Stanford Tuck, Second World War fighter ace."]}, {"page": "Distinguished Flying Cross (United Kingdom)", "response": ["* Wing Commander Robert Stanford Tuck, Royal Air Force flying ace who was awarded the DFC three times"]}, {"page": "Battle of Britain (film)", "response": ["The Battle of Britain has a large all-star international cast. The film was notable for its attempt to accurately portray the role of the Germans, with participants in the battle including Group Captain Tom Gleave, Wing Commander Robert Stanford Tuck, Squadron Leader Bolesław Drobiński and Luftwaffe Generalleutnant Adolf Galland involved as consultants.Simpson, Geoff. The History of the Battle of Britain Fighter Association : Commemorating the Few, p. 115. During the war, Drobiński had heavily damaged Galland's plane and forced him into a crash-landing.", "Former participants of the battle served as technical advisers including Douglas Bader, James Lacey, Robert Stanford Tuck, Adolf Galland and Dowding himself.", "The character Major Falke is based on Generalleutnant Adolf Galland, a famous ace during the Second World War, who did ask Reichsmarshall Göring for \"an outfit of Spitfires for my squadron\". Galland explained in his autobiography that his request was only a way to upset Göring, because he was \"unbelievably vexed at the lack of understanding and stubbornness with the command (i.e. Göring) who gave us orders we could not execute\". Galland did feel that the Spitfire was more manoeuvrable than the Bf 109, which he felt made it more suitable as a defensive fighter but he also states that \"fundamentally I preferred the Bf 109\".Galland 2005, pp. 28–29. Galland was upset about the director's decision not to use the real names. While making the film, Galland was joined by his friend Robert Stanford Tuck."]}, {"page": "Adolf Galland", "response": ["In March 1945, Galland returned to operational flying and was permitted to form a jet fighter unit which he called Jagdverband 44. He flew missions over Germany until the end of the war in May. After the war, Galland was employed by Argentina's Government and acted as a consultant to the Argentine Air Force. Later, he returned to Germany and managed his own business. Galland also became friends with many former enemies, such as RAF aces Robert Stanford Tuck and Douglas Bader. Adolf Galland died on 9 February 1996.", "In 1969, he served as technical adviser for the film Battle of Britain, in which the character Major Falke is based on Galland. Galland was upset about the director's decision not to use the real names. While making the film, Galland was joined by his friend Robert Stanford Tuck. Galland also threatened to withdraw at a planned sequence involving him giving a Nazi salute to Göring. Tuck also wrote into the producers, urging them to reconsider; at one point Galland brought his lawyer to Pinewood Studios. In 1973, Galland appeared in the British television documentary series The World at War, in episodes four and twelve, \"Alone (May 1940 – May 1941)\" and \"Whirlwind: Bombing Germany (September 1939 – April 1944)\".", "On 10 September 1963, Galland married his secretary, Hannelies Ladwein. They had two children: a son, Andreas Hubertus (nicknamed \"Andus\") born 7 November 1966; and a daughter, Alexandra-Isabelle born 29 July 1969. The RAF ace Robert Stanford Tuck was the godfather of his son Andreas.  Galland remained friends with Tuck until the latter's death on 5 May 1987. Galland felt his loss greatly. Galland's marriage to Hannelies did not last and on 10 February 1984, he married his third wife, Heidi Horn, who remained with him until his death."]}, {"page": "RAF Coltishall", "response": ["|13 February 1947||22 January 1948||Wing Commander||Robert Stanford Tuck"]}, {"page": "Boulton Paul Defiant", "response": ["In October 1939, No. 264 (Madras Presidency) Squadron was reformed at RAF Sutton Bridge to operate the Defiant. Initial training, formal squadron acceptance, and development of tactics began with other aircraft as it received its first Defiants only in early December at Martlesham Heath.Brew 1996, p. 19. In February 1940, the Defiant commenced night fighter training operations; the squadron tested its tactics against British medium bombers – Hampdens and Blenheims – and 264's CO flew against Robert Stanford Tuck in a Spitfire, showing that the Defiant could defend itself by circling and keeping its speed up. It became clear during these trials that the Defiant was suited only to performing bomber-destroyer duties."]}, {"page": "Johnnie Johnson (RAF officer)", "response": ["Johnson flew various operations over France including the Rhubarb ground attack missions which Johnson hated—he considered it a waste of pilots. Several successful fighter pilots had been lost this way. Flight Lieutenant Eric Lock and Wing Commander Paddy Finucane were killed on Rhubarb operations in August 1941 and July 1942 respectively. Squadron leader Robert Stanford Tuck would be captured carrying out a similar operation in January 1942. During this time, Dundas and other pilots also expressed dissatisfaction with the formation tactics being used in the wing. After a long conversation into the early hours, Bader accepted the suggestions by his senior pilots and agreed to the use of more flexible tactics to lessen the chances of being taken by surprise. The tactical changes involved operating overlapping line abreast formations similar to the German finger-four formation. The tactics were used thereafter by all RAF pilots in the wing."]}, {"page": "List of British Jews", "response": ["* Wing Commander Roland Robert Stanford Tuck, DSO, DFC and Two Bars, AFC (1916-1987), RAF fighter pilot, Battle of Britain and Battle of France (27 air-to-air kills), English Electric Canberra test pilot"]}, {"page": "Robert", "response": ["* Robert Stanford Tuck, British fighter pilot, flying ace, and test pilot, member of the Royal Air Force, war hero of World War II"]}, {"page": "No. 303 Squadron RAF", "response": ["On 13 March 1942, the Squadron lost F/Lt W Łokuciewski, shot down by JG 26 and taken prisoner, and on 4 April F/L Daszewski (killed) and F/L Kustrzyński (POW) were lost over Saint-Omer having shot down two FW190 fighters. F/L Kustrzyński was taken prisoner while still sitting in the cockpit of his crash-landed Spitfire because his back was badly injured and he could not move. He was later transferred to Colditz Castle POW camp and ultimately to Stalag Luft III Sagan for continually trying to escape. He finally made a successful escape with RAF fighter ace, W/C Robert Stanford Tuck, and they were repatriated back to Britain by Russian military authorities who found them after they had walked across Poland following their escape.Larry Forrester \"Fly For Your Life\""]}, {"page": "Stalag Luft III", "response": ["* Wing Commander Robert Stanford Tuck, a British flying ace with 29 victories, was imprisoned at Sagan until shortly before the Great Escape; suspected of being a ringleader, he was transferred to Belaria, which Tuck credited with saving his life. (His mentor, Roger Bushell, was among those shot after the Great Escape). Tuck eventually managed to escape on 1 February 1945, during the evacuation of the camp, with the help of Polish RAF pilot Zbigniew Kustrzyński. Both made it to the Russian lines.Forrester, Larry. Fly for Your Life: The Story of RR Stanford Tuck, DSO, DFC (Fortunes of War). London: Cerberus Publishing Ltd., 1981. . Page 334, 339, 347."]}, {"page": "Piece of Cake (novel)", "response": ["*In the novel, the character of Moggy Cattermole is pursuing a mortally damaged German bomber and he notices that one of the Luftwaffe crewmen has become hopelessly stuck in the escape hatch beneath the aircraft, his legs dangling in mid-air. Cattermole shoots him dead. A similar real-life incident occurred in December 1941 when Wing-Commander Robert Stanford Tuck, then leading the Biggin Hill Fighter Wing, with the aid of another pilot, shot down a Junkers Ju 88 over the Channel. A solitary survivor was sighted floating in the water, without a dinghy and many miles from the Dutch coast and with no ships in sight to rescue him. Tuck, wishing to spare the German airman a slow, painful death from exposure, strafed the water and killed him. Tuck later wrote, \"If that were me, down there.....this is what I would want to happen. It was the right thing, the only thing to do. But I will tell no one, for some may not understand.\"Forrester, Larry. Fly For Your Life. Panther Books Ltd 1973. p175-177."]}, {"page": "Hans-Joachim Marseille", "response": ["While returning from a bomber-escort mission on 23 September 1940 flying Werknummer (W.Nr.—factory number) 5094, his engine failed  off Cap Gris Nez after combat damage sustained over Dover. Pilot Officer George Bennions from 41 Squadron may have shot Marseille down. According to another source, W.Nr 5094 was destroyed in this engagement by Robert Stanford Tuck, who had pursued a Bf 109 to that location and whose pilot was rescued by a Heinkel He 59 naval aircraft. Marseille is the only German airman known to have been rescued by a He 59 on that day and in that location. Tuck's official claim was for a Bf 109 destroyed off Cap Gris Nez at 09:45—the only pilot to submit a claim in that location."]}, {"page": "Pembrey", "response": ["Military connections include the past use of areas of the Ashburnham estate as a firing range. In the 20th century, a RAF station, RAF Pembrey was situated in Pembrey and played a role in Britain's defences as home to both fighter and bomber aircraft. Close by, a Royal Ordnance Factory, ROF Pembrey, provided high explosives for Britain's war effort. Both these facilities attracted a number of Luftwaffe raids over the village during World War II. One airman based and living in Pembrey, Wing Commander Guy Gibson, went on to lead the Dambusters. Flying ace Robert Stanford Tuck was at Pembrey with 92 Squadron in 1940."]}, {"page": "Günther Rall", "response": ["Rall remained in a prisoner of war camp for a matter of weeks. Rall was approached by the Americans who were recruiting Luftwaffe pilots who had experience with the Messerschmitt Me 262 fighter. He was transferred to Bovingdon near Hemel Hempstead, and then based at RAF Tangmere, where he met the RAF fighter pilot Robert Stanford Tuck, with whom he became close friends."]}, {"page": "Tuck (surname)", "response": ["* Robert Stanford Tuck (1916–1987), British Second World War fighter ace and test pilot"]}, {"page": "No. 92 Squadron RAF", "response": ["* Robert Stanford Tuck 27 enemy aircraft destroyed, two shared destroyed, six probably destroyed, six damaged and one shared damaged", "* Forrester, Larry and Wootton, Frank. Fly For Your Life: The Glorious Story Of Englands Greatest Air Ace Robert Stanford Tuck And His Deadly Spitfire. Bantam Books, 1956 (reprinted in 1978 by Bantam Books and by Cerebus in 2002 as Fly for your life: the story of Bob Stanford Tuck)."]}, {"page": "RAF Martlesham Heath", "response": ["The A&AEE moved to RAF Boscombe Down on 9 September 1939 at the outbreak of World War II and Martlesham then became the most northerly station of No. 11 Group RAF, Fighter Command. Squadrons of Bristol Blenheim bombers, Hawker Hurricanes, Supermarine Spitfires and Hawker Typhoons operated from this airfield, and among the many pilots based there were such famous men as Robert Stanford Tuck, and Squadron Leader Douglas Bader, there as Commanding Officer of 242 Squadron. Ian Smith, the post-war Rhodesian prime minister, was at Martlesham for a time."]}, {"page": "No. 257 Squadron RAF", "response": ["thumb|left|Robert Stanford Tuck in a 257 sqn Hurricane", "* Robert Stanford Tuck"]}]}}