{"wiki_id": "http://www.wikidata.org/entity/Q7345162", "itemLabel": "Robert Haldane", "itemDescription": "mathematician (1772-1854)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Haldane_(mathematician)", "wikipedia_page": {"main": "Robert Haldane FRSE (27 January 1772 in Perthshire – 9 March 1854 in St Andrews) was a British mathematician and minister of the Church of Scotland.", "link_mentions": [{"page": "Robert Haldane", "response": ["Robert Haldane (28 February 1764 – 12 December 1842) was a religious writer and Scottish theologian. Author of Commentaire sur l'Épître aux Romains, On the Inspiration of Scripture and Exposition of the Epistle to the Romans.", "Robert Haldane 3rd of Airthrey was the son of James Haldane 2nd of Airthrey, and his wife, Katherine Duncan. Robert was born on 28 February 1764 in Queen Anne Street, Cavendish Square in London. Robert and his younger brother James Alexander Haldane were raised by their grandmother Lady Lundie and uncles. Robert and James attended classes at Dundee Grammar School, the Royal High School in Edinburgh, and the University of Edinburgh.", "In 1816 Robert published a work on the Evidences and Authority of Divine Revelation.  In the summer of 1816 Robert Haldane visited Europe, first at Geneva and afterwards in Montauban. He lectured and interviewed large numbers of theological students with remarkable effect; among them were César Malan, Frédéric Monod and Jean-Henri Merle d'Aubigné. This circle of men spread the revival of evangelical Protestant Christianity across the continent of Europe (Le Réveil), impacting France, Germany (Die Erweckung) and the Netherlands (Het Reveil). Through conversion and missionary impetus the effects of this revival were felt as far afield as Italy and Hungary.", "Robert Haldane married Catherine Cochrane Oswald, daughter of George Oswald of Scotstoun, on 24 April 1785. They were married for 58 years and had one child, Margaret Haldane, during their marriage. Margaret married James Farquhar Gordon in 1805.", "Along with his brother, James Haldane, Robert Haldane established 85 churches in Scotland and Ireland. Churches planted by the Haldanes practiced baptism by immersion, weekly communion, and congregational polity (autonomous government). The Haldanes also operated a seminary, and were influenced in their principles by other independent thinkers such as John Glas and Robert Sandeman.", "*Gazetteer for Scotland - Robert Haldane", "*Scottish Preachers Hall of Fame - Robert Haldane"]}, {"page": "List of Moderators of the General Assembly of the Church of Scotland", "response": ["*1827 Robert Haldane (Principal, St Mary's College, St Andrews)"]}, {"page": "St Andrews Cathedral", "response": ["* Robert Haldane (mathematician)"]}, {"page": "Regius Professor of Mathematics", "response": ["* 1807–1809 vacantJ. J. O'Connor and E. F. Robertson (2006) Robert Haldane; MacTutor History of Mathematics; read 27. November 2015.", "* 1809–1820 Robert Haldane"]}, {"page": "Stevenson McGill", "response": ["In 1828 he succeeded Very Rev Robert Haldane as Moderator of the General Assembly. He in turn was succeeded in 1829 by Rev Patrick Forbes of Old Machar."]}, {"page": "George Buist (minister)", "response": ["He was licensed to preach by the Presbytery of he Church of Scotland of Cupar in 1801 and began his ministry at Falkland in central Fife. He was translated to St Andrews in 1813, as second charge under Rev Robert Haldane. He was given a chair in Church History at St Andrews University the following year. Still acting as professor he was given the principal charge of the cathedral church in 1823. He served as Moderator of the General Assembly in 1848."]}]}}