{"wiki_id": "http://www.wikidata.org/entity/Q7341029", "itemLabel": "Robbie Willmott", "itemDescription": "English association football player (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_Willmott", "wikipedia_page": {"main": "Robbie James Willmott (born 16 May 1990) is an English footballer who plays as a winger or midfielder for Newport County.", "link_mentions": [{"page": "Cambridge United F.C.", "response": ["Cambridge United's Centre of Excellence is widely regarded throughout professional football circles as one of the best in England.http://www.cambridge-united.co.uk/page/COENews/0,,10423~1082778,00.html  Many players have come through the youth team to establish themselves as first team players at Cambridge (for example Dan Gleeson, Daniel Chillingworth, Robbie Willmott and Josh Coulson) and go on to play at a higher level (recent examples include John Ruddy, Michael Morrison and Josh Simpson). Wales international Jack Collison was in the youth squads for several years before joining West Ham United's youth academy after the centre closed down following relegation to the Conference Premier."]}, {"page": "Willmott", "response": ["*Robbie Willmott (born 1990), English footballer"]}, {"page": "2009 Conference Premier play-off Final", "response": ["|RM ||18||Robbie Willmott || || "]}, {"page": "2008–09 Cambridge United F.C. season", "response": ["|Robbie Willmott"]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Robbie Willmott"]}, {"page": "2010–11 Luton Town F.C. season", "response": ["Twenty-year-old Cambridge United winger Robbie Willmott signed for Luton for £50,000 on an 18-month contract on 28 January.", "Four goals in the last twenty minutes from Claude Gnakpa, Alex Lawless and two from Lloyd Owusu secured a 4–0 home victory over Darlington on 1 February. Robbie Willmott and Luke Graham made their debuts as substitutes during the match.", "With the league now their priority, Luton secured a 1–0 away win over Rushden & Diamonds on 22 March, Robbie Willmott scoring the only goal.", "Luton drew 3–3 with Kidderminster Harriers on 2 April in an attacking display of football, marking the first time in over two months, and over the course of 13 games, that the club had scored more than two goals in a match. Robbie Willmott, Claude Gnakpa and Jason Walker were on the scoresheet. A third consecutive draw followed on 5 April, the club drawing 2–2 with Kettering Town with Jake Howells and Amari Morgan-Smith scoring the goals.", "|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| Robbie Willmott", "| 28 January 2011 ||  Robbie Willmott || Cambridge United ||align=\"center\"| £50,000 ||align=\"center\"|"]}, {"page": "2011 Conference Premier play-off Final", "response": ["|LM ||11||Robbie Willmott || || "]}, {"page": "2011–12 Luton Town F.C. season", "response": ["After a 30-point deduction and subsequent relegation from The Football League in 2008–09, Luton found themselves in unfamiliar territory in a league outside the top four divisions for the first time in 89 years. Their first campaign in the Conference Premier ended with defeat in the play-offs to York City, despite finishing the season in second place with the highest goals scored tally. The next season saw the club again placed as favourites for promotion, though no team in the division could even come close to overtaking runaway leaders Crawley Town as champions. The failure to win automatic promotion saw manager Richard Money leave the club by mutual consent towards the end of the season, where he was replaced by assistant manager Gary Brabin. The season also saw a large turnaround in playing staff, not least in the departures of the 2009–10 season's top scorers Tom Craddock and Kevin Gallen, sold and loaned respectively to clubs in the league above, and the retirement of club captain Kevin Nicholls. The club's transfer policy, previously focused on signing experienced ex-league players like Mark Tyler, Adam Newton and Alan White, instead shifted to buying younger players who had spent the vast majority of their career in non-league football, such as Andy Drury, Charlie Henry, Alex Lawless, Amari Morgan-Smith, Jason Walker, and Robbie Willmott.", "Luton recorded a 5–1 victory over Southport on 20 August, with goals coming from Adam Watkins, Will Antwi, Amari Morgan-Smith, Robbie Willmott and Danny Crow. Two days after his impressive performance against Southport, 19-year-old Watkins signed a two-year contract extension.", "Before Luton's game away at Mansfield Town on 23 August, it was announced that first-team midfielders Alex Lawless, Keith Keane and Robbie Willmott had all picked up injuries and were ruled out, expanding the injury list to seven first-team players. Luton went a goal down for the third time in as many games, but secured a 1–1 draw when Will Antwi headed in late on.", "Transfer deadline day, 31 August, saw Luton reject a bid from Forest Green for winger Robbie Willmott. Later that evening, Luton signed two strikers; Trinidad and Tobago international Collin Samuel as a free agent on a one year-contract, and Hereford United's Stuart Fleetwood on a two-year contract for an undisclosed fee.", "October began with Luton getting back to winning ways, claiming a 5–1 home victory over Barrow. Despite going a goal down within two minutes, two goals from Robbie Willmott, one from Adam Watkins, a first Luton goal from winger James Dance, and one from top scorer Amari Morgan-Smith secured the win, pushing the club into sixth place in the table. A week later, Luton won their second away game of the season with a 2–1 victory at Kidderminster Harriers, winger Robbie Willmott scoring two goals for the second game in succession. Defenders Shane Blackett and George Pilkington made their first appearances of the season as they returned from long-term injuries. On 11 October, Luton drew 2–2 away to Ebbsfleet United, conceding two late goals after strikes from Morgan-Smith and Dance had initially put them in control. Four days later Luton beat fellow promotion-hopefuls Gateshead 5–1 at Kenilworth Road. Two goals apiece from Jake Howells and Jamie Hand, and one from Aaron O'Connor, pushed the club into third in the table.", "The first game of Buckle's tenure on 9 April ended the team's poor run of form, as Luton notched up a comfortable 4–2 win over Hayes & Yeading United. Stuart Fleetwood scored twice, having been placed into his preferred role as a striker, rather than a winger as he often had under Gary Brabin's management. Andre Gray scored his fourth goal in his first four games, setting a Luton Town record in the process. A 0–0 draw with Alfreton Town on 14 April was followed by a 3–0 victory over Ebbsfleet United three days later, Fleetwood scoring twice again, and Craig McAllister scoring his first goal of the season. A vital game against fellow play-off candidates Kidderminster Harriers on 21 April went in Luton's favour, as a second-half Robbie Willmott goal secured a 1–0 win in front of Kenilworth Road's then-biggest crowd of the season. The result left Luton needing two points from their last two games to ensure a play-off place. This task went down to the final game of the league season after Luton could only manage a 0–0 draw with Gateshead in their game-in-hand on 24 April. A win or draw away to free-scoring champions Fleetwood Town would be enough to secure fifth place for the team, while a loss coupled with a Kidderminster win in their own game would see the Harriers take fifth instead. An early own goal and an Andre Gray strike were enough to see Luton win 2–0 at Fleetwood, their fifth clean sheet in a row, meaning they would face second-placed Wrexham in the play-off semi-final.", "On 7 June, the club announced that Keith Keane, who had made his Luton debut in 2003 and played in 284 games across four different leagues, was to join League One side Preston North End on a free transfer once his contract ended on 1 July. Defender Alex Lacey, who had spent the vast majority of the season out on loan at three different clubs, signed a two-year contract extension on 14 June. The next day, the club released a statement confirming that midfielders Robbie Willmott and Godfrey Poku had rejected new contracts. As Poku was under 24 years of age, the club were entitled to money from a tribunal in the event he moved to another club.", "|align=\"left\"|11||align=\"left\"|MF||align=\"left\"| Robbie Willmott", "|align=\"left\"|LTSC Junior Members' Player of the Year||align=\"left\"| Robbie Willmott||align=\"left\"|11||align=\"left\"|MF"]}, {"page": "2012–13 Newport County A.F.C. season", "response": ["The first fixture of the new year was the home visit of Forest Green Rovers. County were decisively beaten 5–0 and dropped to 3rd in the table as a result. The next match at home to Wrexham ended in a 1–1 draw, which was enough to put Wrexham top of the table, with County staying 3rd, one point behind. County rose to 2nd in the table following the 4–2 away win at Lincoln City, with débutant Robbie Willmott scoring a brace. With momentum in their favour County were desperate to get the home match with bottom-placed Barrow on, but the Rodney Parade pitch was under several feet of snow on the morning of 19 January. Over 120 fans helped to clear the pitch but County went on to lose 2–0. Following that setback, Newport then went on a seven-match unbeaten run, including completing the double over Mansfield Town and Hereford United in the process. The Hereford match being particularly notable for the award of three penalties to Hereford, two of which were scored. In the following match a 90th-minute winner for Kidderminster Harriers resulted in them being the only team to complete double victories over County and move into top place in the table as a result. The next game resulted in a second consecutive County defeat away at Stockport County — Stockport winning 1–0 as a result of a Lee Minshull own goal. County now faced the prospect of the remaining 10 matches in just 26 days. However they went on another unbeaten run, winning at Southport three days later, followed by a 0–0 away draw with Gateshead two days after that. The Gateshead match was played at Boston United's York Street ground with the match having been postponed on four previous occasions. A further 0–0 draw was played out with Dartford just two days later. Newport got back to winning ways with their second victory over Nuneaton Town two days after that. Following a 0–0 away draw with Cambridge United a place in the play-offs was secured with a 1–0 home victory over Braintree Town which also represented the seventh double of the season. Newport finished their home season with victories over Macclesfield Town and Alfreton Town, the latter of which was played in torrential rain with large pools of standing water. The penultimate game of the season was a 2–2 away draw with Luton Town with the final game against fellow play-off contenders Grimsby Town. County manager Justin Edinburgh fielded a much-changed side, resting many first-team players ahead of the play-off matches. As a result, County lost 3–0 and set up a semi-final first leg back at Blundell Park four days later.", "|24||FW||align=\"left\"| Robbie Willmott||10 (9)||6||0 (0)||0||10 (9)||6", "|10 January 2013||FW|| Robbie Willmott||Cambridge United||Undisclosed", "|FW ||24|| Robbie Willmott"]}, {"page": "2012 Conference Premier play-off Final", "response": ["|LM ||11 ||Robbie Willmott"]}, {"page": "2012–13 Luton Town F.C. season", "response": [" Robbie Willmott and Godfrey Poku also rejected contracts, with Poku signing a deal to join Mansfield Town.", "The transfers arranged for the beginning of the month became official, with Keith Keane, George Pilkington, Godfrey Poku and Robbie Willmott all leaving the club, and defender Garry Richards joining. On 2 July, Luton signed former Torquay United defender Lathaniel Rowe-Turner on a free transfer. A day later, former Luton goalkeeper Carl Emberson re-joined the club as first team development coach, linking back up with Paul Buckle, who he had been a coach with at Bristol Rovers. Midfielder Alex Lawless and youth team graduates Alasan Ann and Newman Carney signed one-year contract extensions on 4 July. This was followed by striker Dan Walker, who had previously rejected two contracts and been placed on the transfer list, signing a one-year deal himself on 5 July. Midfielder John Paul Kissock joined Macclesfield Town on loan for six months on 9 July. Iraqi midfielder Yaser Kasim joined Luton from Championship side Brighton & Hove Albion on a six-month loan on 12 July.", "| 1 July 2012 ||  Robbie Willmott || Cambridge United || style=\"text-align:center;\"| Free ||align=\"center\"|"]}]}}