{"wiki_id": "http://www.wikidata.org/entity/Q7346674", "itemLabel": "Robert Lacey Everett", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Lacey_Everett", "wikipedia_page": {"main": "Robert Lacey Everett (28 January 1833 – 21 October 1916) was an English farmer and Liberal politician who sat in the House of Commons three times between 1885 and 1910.", "link_mentions": [{"page": "Robert Everett", "response": ["* Robert Lacey Everett (1833–1916), English farmer and Liberal politician"]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Robert Lacey Everett"]}, {"page": "Rushmere St Andrew", "response": ["*Robert Lacey Everett (1833-1916), farmer, Liberal politician, and Member of Parliament for Woodbridge"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Robert Lacey Everett "]}, {"page": "Woodbridge (UK Parliament constituency)", "response": ["| Robert Lacey Everett", "| Robert Lacey Everett", "| Robert Lacey Everett"]}, {"page": "Robert Hamilton Lloyd-Anstruther", "response": ["At the 1886 general election, Lloyd-Anstruther was chosen by the Conservative Party to contest the South Eastern or Woodbridge Division of Suffolk, a constituency held by the Liberal Party Member of Parliament, Robert Lacey Everett. He won the seat for the Conservatives, but only served a single term in parliament, with Everett regaining the seat in 1892 general election."]}, {"page": "Joseph David Everett", "response": ["Born at Rushmere, near Ipswich, Suffolk, on 11 September 1831, he was the eldest son of Joseph David Everett, a landowner and farmer of Rushmere, by his wife Elizabeth, eldest daughter of John Garwood, a corn merchant in London;  Robert Lacey Everett was a brother. He was educated at Mr. Buck's private school at Ipswich. On leaving school he attended classes in mathematics at the Ipswich Mechanics' Institution under Stephen Jackson, proprietor of the Ipswich Journal, who advised him to teach."]}, {"page": "Orwell Park", "response": ["After George Tomline's death in 1889, the estate was inherited by Ernest George Pretyman. Pretyman was elected member of parliament for the local constituency of Woodbridge, defeating the liberal candidate Robert Lacey Everett. After Everett regained the seat in 1906 Pretyman held the parliamentary seat of Chelmsford from 1908 until 1923. This enabled him to continue his political career."]}]}}