{"wiki_id": "http://www.wikidata.org/entity/Q7344858", "itemLabel": "Robert P. Gordon", "itemDescription": "Regius Professor of Hebrew at the University of Cambridge", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_P._Gordon", "wikipedia_page": {"main": "Robert Patterson Gordon (born 9 November 1945) was Regius Professor of Hebrew at the University of Cambridge from 1995 to 2012.Born in Belfast, Northern Ireland, Gordon was educated at the Methodist College Belfast and at St Catharine's College, Cambridge, where as an undergraduate, Gordon was placed in the first class of the Oriental Studies Tripos. In 1973 he earned the PhD at the University of Cambridge with a thesis entitled A Study of Targum Jonathan to the Minor Prophets from Nahum to Malachi, written under the supervision of Professor J.A. Emerton. In 2001 he was awarded the University of Cambridge’s Litt.D. on the basis of his published body of work.\nWhile pursuing doctoral studies, Gordon was appointed as Assistant Lecturer (later, Lecturer) in Hebrew and Semitic Languages at the University of Glasgow. Teaching Ancient Near Eastern History at Glasgow had a formative influence on Gordon’s subsequent research on the Old Testament. He returned to Cambridge as a Lecturer in Old Testament and Intertestamental Studies in the Faculty of Divinity in 1979. Upon his election as the Regius Professor of Hebrew in 1995, a post he held until his retirement in 2012, Gordon moved to the Faculty of Oriental Studies (now the Faculty of Asian and Middle Eastern Studies). He is an Emeritus Fellow of St Catharine’s College, Cambridge.\nGordon is an active churchman and has been particularly involved in the broader evangelical fellowship in the United Kingdom and elsewhere.\nHe is considered a particularly adept supervisor of doctoral students and is widely appreciated among them for his academic and pastoral roles in their success. He has served on advisory committees for three major Bible translations: Revised English Bible, New International Version, and English Standard Version.\nGordon’s publishing record is diverse and wide-ranging. Identified generally as an Old Testament scholar, a solid stream of his writing has addressed issues presented by the so-called Old Testament versions. These are the Aramaic- (Targums), Greek- (Septuagint), and Syriac-language (Peshitta) traditions that serve as conduits of the text and interpretation of the Hebrew Bible/Old Testament. This research interest issued in his supervision of a notable series of doctoral students working in, inter alia, Septuagint studies. Others of Gordon’s works have addressed the biblical text of the Old and New Testaments directly.\nSupported by a plethora of articles, Gordon’s major authored or edited works  include 1 and 2 Samuel (OT Guides; Sheffield); 1 and 2 Samuel: A Commentary (Exeter; repr. Grand Rapids, 2004); The Targum of the Minor Prophets (The Aramaic Bible 14; Wilmington; with K.J. Cathcart); Studies in the Targum to the Twelve Prophets: From Nahum to Malachi (SVT 51; Leiden); The Place Is Too Small For Us: The Israelite Prophets in Recent Scholarship (ed.; Winona Lake); Wisdom in Ancient Israel (Fs J.A. Emerton; ed. w. J. Day, Hugh G. M. Williamson; Cambridge); The Old Testament in Syriac according to the Peshitta Version, IV, 2: Chronicles (The Peshitta Institute, Leiden); Holy Land, Holy City: Sacred Geography and the Interpretation of the Bible (Didsbury Lectures 2001; Carlisle); The Old Testament in its World: Papers Read at the Winter Meeting, January 2003, The Society for Old Testament Study, and at the Joint Meeting, July 2003, The Society for Old Testament Study and Het Oudtestamentisch Werkgezelschap in Nederland en België (OS 52; ed. w. J.C. de Moor; Leiden); Hebrew Bible and Ancient Versions: Selected Essays of Robert P. Gordon (Aldershot); The God of Israel (ed.; Cambridge); Hebrews. A Commentary (2nd edn; Sheffield Phoenix Press, Sheffield); ‘Thus Speaks Ishtar of Arbela’: Prophecy in Israel, Assyria, and Egypt in the Neo-Assyrian Period (ed. w. H.M. Barstad; Winona Lake); Leshon Limmudim: Essays on the Language and Literature of the Hebrew Bible in Honour of A. A. Macintosh (ed. w. D.A. Baer; LHBOTS 593; London); and Syriac Peshitta Bible with English Translation. Chronicles/English translation by Robert P. Gordon (Gorgias, Piscataway). The International Critical Commentary volume on Amos (T. & T. Clark/Bloomsbury) is in preparation.\nGordon is a member of the British Society for Old Testament Study and served as the Society's president in 2003. He is a member of the editorial board of Vetus Testamentum, and served as the journal's Book List editor from 1998 to 2009. He was the secretary of the International Organization for the Study of the Old Testament from 2001 to 2004.\nGordon married Helen Ruth Lyttle in Belfast in 1970. He is the father of a daughter and two sons.", "link_mentions": [{"page": "Robert Gordon", "response": ["* Robert P. Gordon (born 1945), professor of Hebrew at Cambridge"]}]}}