{"wiki_id": "http://www.wikidata.org/entity/Q7342529", "itemLabel": "Robert Burrows", "itemDescription": "English cricketer (1871-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Burrows_(cricketer)", "wikipedia_page": {"main": "Robert Dixon Burrows (6 June 1871 – 12 February 1943) was a first-class cricketer who played for Worcestershire County Cricket Club between 1899 and 1919, he also umpired one test match and set a world record in 1911 when he sent a bail spinning 67 yards and 6 inches when he bowled Huddleston at Old Trafford.\nHe bowled right arm fast medium and was a more than handy right-handed batsman.  He took 96 wickets in 1901 and exactly 100 wickets in 1910, at 23.46 and 1913 at 21.41, leading his county's attack for some years.\nBurrows scored 112 against Gloucestershire County Cricket Club at Worcester in 1907 and averaged 25.28, but his bowling fell to 57 wickets at 24 runs apiece, as Arnold and Cuffe came to the fore.  He recorded his second first-class century, 107* again against Gloucestershire, at Worcester in July 1914, when he batted number ten. In all first-class cricket he scored 5223 runs at 14.07 and took 894 wickets, with a best of 8 for 48 at 26.40 apiece.  He held 138 catches, mostly at point. In 1923 he joined the first-class umpire's list and served during nine seasons.  His sole test match in charge came in the England v Australia match at Trent Bridge from 12 to 15 June 1926.", "link_mentions": [{"page": "Worcestershire County Cricket Club", "response": ["*9th: 181 by John Cuffe and Robert Burrows v. Gloucestershire, Worcester, 1907"]}, {"page": "List of Test cricket umpires", "response": ["|Robert Burrows||||1||1926||1926"]}, {"page": "William Lowe (cricketer)", "response": ["On his return to England, Lowe played three times for Cambridge in 1896, but was then out of the game until August 1899 when he joined Worcestershire in the county's maiden first-class season. The highlight of his summer was undoubtedly the unbeaten 102 he hit against Derbyshire, when he added 87 in barely half an hour with Robert Burrows for the ninth wicket to set up a crushing innings win, one of only two County Championship wins by the county all season."]}, {"page": "George Gaukrodger", "response": ["He enjoyed another good season with the bat in 1903, once more passing 500 runs and hitting his highest first-class score when he made 91 against Lancashire in June, putting on 167 with HK Foster to drag Worcestershire from the depths of 32/4. With the exception of last man Robert Burrows (18), Gaukrodger and Foster were the only batsmen to reach double figures in the first innings. His 37 dismissals in 1903 also contributed to a satisfactory summer."]}, {"page": "Australian cricket team in England in 1902", "response": ["Albert Bird got six wickets for Worcestershire after they were put in the field at New Road. The Australians made 274, then bowled out Worcestershire for 202 despite a last-wicket stand of 62 between George Gaukrodger and Robert Burrows. At the end of the second day, the Australians had added a further 169 for the loss of five wickets, and though they lost their final wickets for 30 runs, Worcestershire were bowled out for 97 by Ernie Jones (six for 53) and Warwick Armstrong (four for 34)"]}, {"page": "Burrows (surname)", "response": ["* Robert Burrows (1871-1943), English cricketer"]}, {"page": "James Cragg", "response": ["Cragg made a single first-class appearance for Lancashire against Worcestershire at New Road, Worcester, in the 1908 County Championship. Lancashire won the toss and elected to bat first, making 217 all out, with Cragg opening the batting and scoring a single run before he was dismissed by Robert Burrows. Worcestershire then made 362 all out in their first-innings, to which Lancashire responded to in their second-innings by making 378 all out, with Cragg this time batting at number six, from where he scored 9 runs before he was dismissed by Ted Arnold. Worcestershire reached their target of 233 with nine wickets to spare. This was his only major appearance for Lancashire. He later joined Cheshire, making his debut for the county in the 1912 Minor Counties Championship against Northumberland. He made three further appearances for the county in that season, before returning to play for it after World War I. He made a single Minor Counties Championship appearance in 1920 against Glamorgan, before making a single appearance the following season against the Lancashire Second XI. His final appearance came in 1923 against the same opposition."]}, {"page": "Archibald Harris", "response": ["Harris made a single first-class appearance for Warwickshire against Worcestershire in 1919 at New Road, Worcester. Worcestershire won the toss and elected to bat first, making 187 all out. In response, Warwickshire were dismissed in their first-innings for 145, with Harris dismissed for 4 runs by William Taylor. Worcestershire then made 102/7 declared in their second-innings, leaving Warwickshire with a target of 145 for victory. Harris opened the innings in Warwickshire's chase alongside Frederick Santall, scoring 14 runs before he was dismissed by Robert Burrows. Warwickshire reached their target for the loss of two wickets. This was his only major appearance for the county."]}, {"page": "Robert Burrowes", "response": ["* Robert Burrows (artist) (1810-1893), English painter and photographer", "* Robert Burrows (cricketer) (1871–1943), English cricketer", "* Robert Burrows (politician) (1884–1964), British businessman and politician"]}, {"page": "Robert Burrows", "response": ["Robert Burrows may refer to:", "* Robert Burrows (artist) (1810-1893), English painter and photographer", "* Robert Burrows (cricketer) (1871–1943), English cricketer", "* Robert Burrows (politician) (1884–1964), British businessman and politician"]}]}}