{"wiki_id": "http://www.wikidata.org/entity/Q7348150", "itemLabel": "Robert Orchard", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Orchard", "wikipedia_page": {"main": "Robert Orchard is a freelance British journalist and lecturer.One of three children born to a Devonshire farmer and a Welsh nurse, he was educated at a grammar school in mid-Devon and read Politics, Philosophy and Economics (PPE) at Corpus Christi College, Oxford, followed by a year's PGCE teacher training course.\nOrchard succeeded Geoffrey Perkins as president of Oxford University's student revue company, the Etceteras, and gathered a talented team of sketch-writers that included former TW3 scriptwriter and chemistry tutor, John Albery, and fellow-students Rowan Atkinson and Richard Curtis, who met here for the first time.He began his journalistic career at the Western Mail newspaper in Cardiff, before moving on to BBC Wales and worked in broadcasting for the BBC for more than 30 years, covering mainly politics and parliament for TV and radio from 1984 — including the Brighton Bomb and the fall of Margaret Thatcher. He also worked in Brussels and Strasbourg setting up a new EU reporter post for BBC regions before becoming political correspondent, first for BBC Wales and then for network BBC TV and Radio News in a team led by John Cole, and including his former BBC Wales colleague, Huw Edwards. Orchard focused on reporting Parliament from 1992, mainly on Radio 4, becoming a BBC parliamentary correspondent and presenting Yesterday in Parliament — with a brief to entertain as well as inform, and later the more measured, nightly Today in Parliament, along with other specialist parliamentary programmes on TV and radio. He reported on major UK politicians such as John Major.He edited BBC News Online's General Election coverage in 2001; and later compiled the BBC College of Journalism's first online Guide to Parliament, to help other BBC journalists understand how the Westminster Parliament works and how to report it.He has written numerous articles for the UK Parliament's The House magazine, the BBC News website, the Hansard Society, and also lectures on politics and the media. He has lent his voice to create historical character cameos for a range of BBC Radio 4 political programmes. Documentaries he wrote and presented for BBC Radio 4 include Fool's Gold, on the 19th-century Welsh Goldrush; a series for You & Yours assessing the privatisation of water, nuclear power and the Royal Mail; The Age of Ming, on ageism in politics; Hung, Drawn and Thwarted, on the prospects and perils of a hung parliament; a 70th-anniversary tribute to Today in Parliament; and A Very Welsh Coup, 25 years after the fall of Margaret Thatcher. Robert Orchard is now a freelance political journalist and lecturer, and was a mature student, achieving an MA in Politics and Contemporary History at King's College London, 40 years after his first degree.\nIn 2014, he advised on government communication to the Maltese government.Away from UK parliament, he has organised poetry-reading tours of schools, and been an amateur actor, including at the pro-am Everyman Open Air Theatre Festival held at Dyffryn Gardens near Cardiff from 1983 to 1995; he was also Festival treasurer then chairman. With Tim Riley, he went on to found Moonlight Theatre, staging open air musicals at the Festival for several years. After leaving the BBC, he has returned to acting, this time with London's The Tower Theatre and, most recently, with his own company's production of Under Milk Wood by Dylan Thomas, which toured to Malta in 2019.", "link_mentions": [{"page": "Today (BBC Radio 4)", "response": ["The programme has a regular slot for sports news and items, 'Sports Desk', between 26 and 30 minutes past each hour, regularly presented by Garry Richardson, Jonathan Legard or Rob Bonnet and occasionally by Alison Mitchell, Karthi Gnanasegaram or Chris Dennis.BBC Radio 4 – Today. BBC (1 January 1970). If Parliament is in session the previous day there will be a summary at about 06:50 (Yesterday in Parliament\"Westminster to your ears\". BBC News (13 May 2004).) presented by two from Robert Orchard, David Wilby,David Wilby  Rachel Hooper and Susan Hulme.Susan Hulme "]}, {"page": "Experimental Theatre Club", "response": ["ETC was home to Oxford's student revue company, the Etceteras – by the early 1970s a rather poor relation of the Cambridge Footlights. Then, in 1975, two figures who would together become major players in TV and film comedy met after answering an advert to join the Etceteras revue-writing team. They were Richard Curtis and Rowan Atkinson – a graduate engineering student who made his memorable Oxford debut in a Leapyear Revue at the Oxford Playhouse on 29 February 1976, directed by Etceteras president, Robert Orchard. Curtis had already taken his own first bow in another show by the same director, \"Allswellthatendsrock!\". From 1977 to 1981, Paul Twivy and Ian Hislop then took over the Etceteras, producing several shows at the Edinburgh Festival and Oxford Playhouse.", "*Robert Orchard"]}, {"page": "Oxford University Broadcasting Society", "response": ["* Robert Orchard"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Robert Orchard – long-serving BBC correspondent. He joined BBC Wales in 1979, later becoming their Political Correspondent, then working in the same role for the national news. He became a BBC Parliamentary Correspondent in 1992 and frequently presented 'Yesterday in Parliament'. He left the BBC in 2013."]}, {"page": "Premiership of Tony Blair", "response": ["Tony Blair's touch was less sure with regard to the Millennium Dome project. The incoming government greatly expanded the size of the project and consequently increased expectations of what would be delivered. Just before its opening, Blair claimed the Dome would be \"a triumph of confidence over cynicism, boldness over blandness, excellence over mediocrity\". In the words of BBC correspondent Robert Orchard, \"the Dome was to be highlighted as a glittering New Labour achievement in the next election manifesto\"."]}, {"page": "Queen Elizabeth's Grammar School, Crediton", "response": ["* Robert Orchard, BBC parliamentary correspondent. QES 1964–72"]}, {"page": "Robert Orchard (rugby league)", "response": ["Robert Orchard is a New Zealand former professional rugby league footballer who played in the 1960s and 1970s. He played at representative level for New Zealand (Heritage No. 443), Bay of Plenty, Auckland and Queensland, as a , or , during the era of contested scrums."]}, {"page": "Orchard (surname)", "response": ["*Robert Orchard, British journalist", "*Robert Orchard (rugby league), New Zealand rugby league player"]}, {"page": "1971 Kangaroo tour of New Zealand", "response": ["| Robert Orchard"]}, {"page": "Orchard, Robert", "response": ["#redirectRobert Orchard"]}]}}