{"wiki_id": "http://www.wikidata.org/entity/Q7340074", "itemLabel": "Rob Deering", "itemDescription": "British musician and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Deering", "wikipedia_page": {"main": "Rob Deering (born 1972) is an English comedian, musician and writer.", "link_mentions": [{"page": "List of comedians", "response": ["* Rob Deering (born 1972)"]}, {"page": "Basil Brush", "response": ["On 16 November 2018, Basil appeared on Strictly Come Dancing: It Takes Two alongside Alexandra Burke, Jamie Cullum and Rob Deering as a part of the Friday Panel. He revealed that his favourite dance is the Foxtrot."]}, {"page": "V Festival", "response": ["* Rob Deering"]}, {"page": "Jammin' (radio programme)", "response": ["*Rob Deering"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Rob Deering", "* Rob Deering"]}, {"page": "Soapstar Superstar", "response": ["The first series was hosted by Fern Britton and Ben Shephard, with Jayne Middlemiss and Duncan James hosting a companion show for the series on ITV2, entitled Soapstar Superstar: Extra Tracks. For the second series, the show was presented by Zoe Ball, with the ITV2 companion show, retitled as Soapstar Superstar: Bonus Tracks, hosted by Mark Durden-Smith, Sheree Murphy and Rob Deering. Both series featured Billy Sammeth and Chris Cowey as part of the judging panel, with assistance from Cilla Black in 2006, and Martine McCutcheon and Michael Ball in 2007."]}, {"page": "Never Mind the Full Stops", "response": ["| Pam Ayres & Rob Deering", "| Victoria Mailer & Rob Deering", "| Kirsty Wark & Rob Deering"]}, {"page": "Andy Zaltzman", "response": ["| Showcase. With John Oliver and Rob Deering"]}, {"page": "Janice Connolly", "response": ["Janice is the artistic director and founder member of Birmingham-based Women and Theatre. The company is committed to social change through new theatre and drama and in its mission statement states that it aims to make heard the voices of those who are not usually listened to. The company performs in a variety of settings including schools, arts centres, health centres and conference halls. She ran the 'Laughing for a Change' project, funded by Time to Change, which encouraged comedians and audiences to talk about mental health; this culminated in a stand-up tour in 2014 featuring Seymour Mace, Rob Deering and others."]}, {"page": "Underbelly (events promoter)", "response": ["*Rob Deering"]}, {"page": "Rob Brydon's Annually Retentive", "response": ["| Trisha Goddard, Rob Deering"]}, {"page": "BBC New Comedy Award", "response": ["| 2001 || Alan Carr || Marcus BirdmanKeith Carter (as \"Nige\")Jarred ChristmasMichael DowneyDes ClarkeRob DeeringRussell HowardJustin Moorhouse"]}, {"page": "Paul Tonkinson", "response": ["As a fan of Man Utd he co-presented podcast ManYoo Redcast with fellow-fan Eddie Nestor. He also participates in the Running Commentary running podcast along with Rob Deering."]}, {"page": "Lord Williams's School", "response": ["* Rob Deering, comedian, guitarist and writer"]}, {"page": "Banter (radio show)", "response": ["*Episode 2 - Rob Deering, Lynn Ferguson, Russell Howard"]}, {"page": "Outside the Box Comedy Club", "response": ["*Rob Deering"]}, {"page": "The Jon Richardson Show", "response": ["Rob Deering,"]}, {"page": "Celebrity Mastermind", "response": ["| rowspan=\"4\"|28 December 2014 || Rob Deering ||Novels of Jane Austen || Winner", "| Rob Deering || Stranger Things || Winner"]}, {"page": "Total Wipeout", "response": ["Another two specials were broadcast at the close of the series. The first episode aired on 9 April 2011 and featured Aggie MacKenzie, Calum Best, Chantelle Houghton, Chico Slimani, Chris Simmons, Gemma Bissix, John Fashanu, Kelli Young, Phoebe Thomas and Rob Deering. It was won by John Fashanu with Chico in second and Calum Best in third."]}, {"page": "Jack Waley-Cohen", "response": ["Jack Waley-Cohen (born 1979) is a British quizzer and company director. He was a co-host on the UK Game Show Totally Top Trumps, which was hosted by Sky Sports presenter Andy Goldstein, alongside regular panellists Rob Deering and Dan Clark.UK Game Shows, Totally Top Trumps "]}, {"page": "2003 in British television", "response": ["**Debut of 99 Things to do Before You Die on Five, which four people (Syirin Said, Steve Jones, Alexandra Aitken and Rob Deering) to taking challenges from around the world. The series continues with a compilation of the best moments on 2 June, and it was later repeated on Sky Travel until 2005."]}, {"page": "Totally Top Trumps", "response": ["Totally Top Trumps is a British gameshow that aired on Challenge for 20 episodes in 2004. It was presented by Andy Goldstein and supported by captains Rob Deering, Dan Clark and scorer/quiz geek Jack Waley-Cohen. It was loosely based on the card game Top Trumps."]}, {"page": "Sing If You Can", "response": ["*Rob Deering"]}, {"page": "List of Celebrity Juice episodes", "response": ["| Joe Swash, Rob Deering"]}, {"page": "Film Fandango", "response": ["* Episode 21 - Rob Deering on Rampart & Mission: Impossible"]}, {"page": "NATYS: New Acts of the Year Show", "response": ["** Rob Deering – second"]}, {"page": "Seymour Mace", "response": ["He took part in the 'Laughing for a Change' project in 2014, which aimed to raise awareness of mental health through a comedy tour, also featuring Mrs Barbara Nice and Rob Deering. The project was supported by Time to Change."]}, {"page": "The Horne Section", "response": ["|Rob Deering", "|I Scratched My Arse, Hello Hello Tomato, Rob Deering's Song, How Long, Super Wolf Bloodmoon"]}]}}