{"wiki_id": "http://www.wikidata.org/entity/Q7348927", "itemLabel": "Robert Plane", "itemDescription": "British clarinettist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Plane_(clarinettist)", "wikipedia_page": {"main": "Robert Plane is a British clarinettist.\nPlane won the Royal Overseas League Music Competition in London in 1992. He performed with the Zurich Chamber Orchestra, the City of London Sinfonia, Northern Sinfonia and the Malta Philharmonic. Plane has played with the London Symphony, Philharmonia, Royal Philharmonic and BBC Symphony Orchestras and with the Chamber Orchestra of Europe. He is the principal clarinetist of the BBC National Orchestra of Wales (since 1999). His performance of Rossini's Introduction, Theme and Variations was broadcast live on BBC from the 2004 The Proms in the Park. He teaches clarinet at the Royal Welsh College of Music and Drama, and is an artist-in-residence at Queen’s University.", "link_mentions": [{"page": "Chetham's School of Music", "response": ["*Robert Plane – clarinettist"]}, {"page": "Clarinet Concerto (Nielsen)", "response": ["*Robert Plane. Clarinet Concerto, BBC MM205 (c) 1999, (p) 1999"]}, {"page": "Clarinet Concerto (Copland)", "response": ["*Robert Plane. American Landmarks. BBC MM205 DDD  2001, (p) 2001"]}, {"page": "Robert Plane", "response": ["Robert Plane may refer to:", "* Robert Plane (clarinettist), British clarinettist"]}, {"page": "Piers Hellawell", "response": ["In 2008, Hellawell worked with the BBC National Orchestra of Wales and the clarinettist Robert Plane in creating a piece Agricolas, premiered at the Vale of Glamorgan Festival that year. Two years following this, his piano piece Syzygy was performed by William Howard at the Spitalfields Festival in London. In 2013, he was commissioned by the Swedish Chamber Orchestra and the Stockholm Kammarbrass Syzygy which was premiered in the spring of that year and supported the Leverhulme Fellowship.", "*Agricolas (2008) – Commissioned by Robert Plane with funds from the Britten-Pears Foundation and Vaughan-Williams Trust"]}]}}