{"wiki_id": "http://www.wikidata.org/entity/Q7345401", "itemLabel": "Robert Henley, 2nd Baron Henley", "itemDescription": "British lawyer and Member of Parliament", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Henley,_2nd_Baron_Henley", "wikipedia_page": {"main": "Robert Henley Henley, 2nd Baron Henley (3 September 1789 – 3 February 1841), was a British lawyer and Member of Parliament.\nBorn Robert Henley Eden, he was the son of Morton Eden, 1st Baron Henley, and Lady Elizabeth Henley, youngest daughter of Lord Chancellor Robert Henley, 1st Earl of Northington (c. 1708 – 1772). He served as a Master in Chancery from 1826 to 1840 and between 1826 and 1830 he also sat as Member of Parliament for Fowey. In 1830 he succeeded his father as second Baron Henley, but as this was an Irish peerage it did not entitle him to a seat in the House of Lords. The following year, Lord Henley assumed by royal licence the surname of Henley in lieu of Eden. in commemoration of his maternal ancestors, and the same year he published a biography of his maternal grandfather, entitled Memoir of the Life of Robert Henley, Earl of Northington, Lord High Chancellor of Great Britain.\nHenley married Harriet Peel, daughter of Sir Robert Peel, 1st Baronet, and sister of Prime Minister Sir Robert Peel, 2nd Baronet, in 1823. He died in February 1841, aged 51, and was succeeded in the barony by his son Anthony. Lady Henley died in 1869.", "link_mentions": [{"page": "Eden baronets", "response": ["***** Robert Henley, 2nd Baron Henley (1789–1841) m. Harriet Eleanora Peel (daughter of Sir Robert Peel, 1st Baronet)"]}, {"page": "Anthony Henley, 3rd Baron Henley", "response": ["Henley was the son of Robert Henley, 2nd Baron Henley. Lord Chancellor Robert Henley, 1st Earl of Northington, was his great-grandfather. He succeeded his father as third Baron Henley in 1841 but as this was an Irish peerage it did not entitle him to a seat in the House of Lords. He was instead elected to the House of Commons for Northampton in 1859, a seat he held until 1874. In 1885 the Northington title held by his great-grandfather was revived when he was created Baron Northington, of Watford in the County of Northampton, in the Peerage of the United Kingdom. This title gave him and the later Barons an automatic seat in the House of Lords."]}, {"page": "Henley (name)", "response": ["* Robert Henley, 2nd Baron Henley (1789–1841), British lawyer and politician"]}, {"page": "Robert Henley", "response": ["* Robert Henley, 2nd Baron Henley (1789–1841), British lawyer and Member of Parliament"]}, {"page": "Laurence Peel", "response": ["Peel was the sixth son of Sir Robert Peel, 1st Baronet and Ellen Yates. Among his siblings were older brothers, Sir Robert Peel, 2nd Baronet, William Yates Peel (an MP who married Lady Jane Elizabeth Moore, daughter of Stephen Moore, 2nd Earl Mount Cashell), Edmund Peel (also an MP), and Jonathan Peel (a soldier, politician and owner of racehorses). Among his sisters was Harriet Peel (who married Robert Henley, 2nd Baron Henley) and Mary Peel (who married politician George Robert Dawson). His father was a wealthy industrialist and one of early textile manufacturers who sat in the House of Commons representing Tamworth as a 'Church and King' Tory and a staunch supporter of William Pitt the Younger. His grandfather, Robert Peel, and great-grandfather, William Peel, were both yeomen."]}, {"page": "Robert Henry, 2nd Baron Henry", "response": ["#REDIRECTRobert Henley, 2nd Baron Henley"]}]}}