{"wiki_id": "http://www.wikidata.org/entity/Q7347956", "itemLabel": "Robert Nares", "itemDescription": "English clergyman, author and philologist (1753-1829)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Nares", "wikipedia_page": {"main": "Robert Nares (9 June 1753, York – 23 March 1829) was an English clergyman, philologist and author.", "link_mentions": [{"page": "Hoax", "response": ["The English philologist Robert Nares (1753–1829) says that the word hoax was coined in the late 18th century as a contraction of the verb hocus, which means \"to cheat,\" \"to impose upon\" or (according to Merriam-Webster) \"to befuddle often with drugged liquor.\" Hocus is a shortening of the magic incantation hocus pocus, whose origin is disputed.See the Hocus Pocus article for more detail.", " Robert Nares defined the word hoax as meaning \"to cheat,\" dating from Thomas Ady's 1656 book A candle in the dark, or a treatise on the nature of witches and witchcraft."]}, {"page": "Judas Iscariot", "response": ["and by William Shakespeare.Judas colour  in p. 473 of A glossary: or, Collection of words, phrases, names, and allusions to customs, proverbs, etc., which have been thought to require illustration, in the words of English authors, particularly Shakespeare, and his contemporaries, Volumen 1. Robert Nares, James Orchard Halliwell-Phillipps, Thomas Wright. J. R. Smith, 1859 The practice is comparable to the Renaissance portrayal of Jews with red hair, which was then regarded as a negative trait and which may have been used to correlate Judas Iscariot with contemporary Jews.Judas' Red Hair and The Jews, Journal of Jewish Art (9), 1982, Melinnkoff R.M"]}, {"page": "Primo visto", "response": ["Opposing claims to this theory include the fact that the earliest known reference to the name Primo visto appears in  Greene's \"Notable Discovery of Coosnage\" published in 1591, more than half a century after the name Primero was in common use. John Minsheu, an English linguist and lexicographer, claims that Primero and Prima vista (hence Primo visto) were two distinct card games - \"That is, first and first seen, because he that can shew such an order of cardes first winnes the game\", although he gives but one set of names and just one reason for their namesA Glossary: or, Collection of words, phrases, names, etc. v. II pg. 687, Robert Nares, James Orchard Halliwell-Phillipps, London 1859 Robert Nares in his book \"A Glossary\" states that the circumstance of the cards being counted in the same way, with the \"Six\" reckoned for eighteen and the \"Seven\" for twenty-one, seems to determine that Primo visto was the same as Primero, or even possibly a later variation of the latter.Earle's Microcos. Char. 12  His words are like the cards at primi-vist, where six is eighteen, and seven twenty-one; for they never signify what they sound. "]}, {"page": "James Nares (composer)", "response": ["He was the father of Revd Robert Nares (1753–1829), the philologist and author."]}, {"page": "Nares (disambiguation)", "response": ["*Robert Nares, English writer"]}, {"page": "Noddy (card game)", "response": ["Edmund Gayton (Festivous Notes upon Don Quixot, 1654) speaks of noddy boards, but Robert Nares in A Glossary: or Collection of words, phrases, names and allusions to customs, proverbs, &c (1822) says that Noddy was not played with a board,Once a Week, Eneas Sweetland Dallas vol. X p. 364 - Bradbury & Evans, London, Dec-Jun 1864 which seems to be plausible due to the natural evolution of card games."]}, {"page": "British Critic", "response": ["William Jones of Nayland and William Stevens, established the British Critic in 1793. Robert Nares and William Beloe, editor and assistant editor respectively, were joint proprietors with the booksellers and publishers Francis and Charles Rivington. It was started as a monthly, but in 1825 its frequency was shifted to quarterly. Nares and Beloe edited the review for about 20 years. Around 1811 the magazine was bought by Joshua Watson and Henry Handley Norris, associated with the high-church pressure group known as the Hackney Phalanx."]}, {"page": "Cock ale", "response": ["A contemporary biographer claimed that King William III preferred Cock ale over wine.  The drink's entry in Robert Nares's Glossary describes it as \"a sort of ale which was very celebrated in the seventeenth century for its superior quality\".  Also included in that entry is a quote from Ned Ward's The London Spy, which calls Cock ale \"a mixture of small-beer and treacle\", although the author continues: \"if this be cock-ale, said I, e'en let cocks-combs drink it.\"  Nathan Bailey's Dictionarium britannicum (1736) describes it as a \"pleasant drink, said to be provocative\", a sentiment mirrored by Francis Grose's Classical Dictionary of the Vulgar Tongue (1785), which also calls it provocative.  Writing in 1929, William Henry Nugent claimed that Cock ale was a concoction of bread and ale fed to fighting birds."]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| Robert Nares||10/05/1804||9 June 1753 – 23 March 1829"]}, {"page": "William Beloe", "response": ["During his time at Norwich Beloe married, and then went to London, where he worked for publishers. In 1793 he established, with Robert Nares, the British Critic, the first forty-two volumes of which were partly edited by him. He also, according to his biographer in the Gentleman's Magazine, \"gave his assistance in editing various books of considerable popularity and importance, which it is less expedient to specify\", doubtless because the reputed authors' obligations to him were too extensive."]}, {"page": "Warburton Lectures", "response": ["*1800–1804 Robert Nares"]}, {"page": "John Bridges (topographer)", "response": ["Bridges's manuscripts fill thirty folio volumes, with five quarto volumes of descriptions of churches collected for him and four similar volumes in his own handwriting. These went to the Bodleian Library at Oxford. Left by Bridges as an heirloom to his family, they were placed by his brother William, secretary of the stamp office, in the hands of Gibbons, a stationer and law-bookseller at the Middle Temple Gate, who circulated proposals for their publication by subscription, and engaged Samuel Jebb to edit them. Before many numbers had appeared Gibbons became bankrupt, and the manuscripts remaining in the hands of the editor, who had received no compensation for his labours, were at length secured by William Cartwright, M.P., of Aynho, for his native county, and a local committee was formed to accomplish the publication of the work. This was entrusted to the Rev. Peter Whalley, a master at Christ's Hospital. The first volume appeared in 1762, and the first part of the second in 1769; but delay arose after the death of Sir Thomas Cave, chairman of the committee, and the entire work was not published till 1791.The History and Antiquities of Northamptonshire. Compiled from the manuscript collections of the late learned antiquary, John Bridges, Esq. By the Rev. Peter Whalley, late fellow of St. John's College, Oxford, 2 vols., Oxford, 1791, folio. Whalley's part in the work was slight, and he claimed to have added little of his own, except what he compiled from Anthony Wood and William Dugdale. Robert Nares wrote the preface, and Samuel Ayscough compiled the index."]}, {"page": "William Tooke", "response": ["In 1795 he produced two volumes of Varieties of Literature, followed in 1798 by the similar  Selections from Foreign Literary Journals. He was principal editor, assisted by William Beloe and Robert Nares, of the New and General Biographical Dictionary, published in fifteen volumes in 1798; and in the same year he wrote Observations on the Expedition of General Bonaparte to the East A few years later he began a translation in ten volumes of the sermons of the Swiss divine Georg Joachim Zollikofer. The first two appeared in 1804 (2nd edit. 1807), two in 1806, two in 1807, and two in 1812; they were followed in 1815 by a translation of the same divine's Devotional Exercises and Prayers."]}, {"page": "Archdeacon of Lichfield", "response": ["* 28 April 1801 – 23 March 1829 (d.): Robert Nares"]}, {"page": "Francis Gregg", "response": ["In the 1790s Gregg was a social figure of literary London. He dined and drank in 1790–1 with James Boswell (who admired of one of his young daughters), in company with Thomas Bever and Caleb Whitefoord. Another poem written by Parsons commemorated a dinner invitation from Gregg, with Robert Nares and William Boscawen."]}, {"page": "George Bennet (hebraist)", "response": ["In 1800, Bennet established a school at Fisher Street in Carlisle, advertising a wide curriculum that incorporated English (grammar and composition), Arithmetic, Book-keeping, Geography, Greek and Latin. Another source states that during his time in Carlisle he \"passed a great portion of his life\" studying Hebrew, becoming deeply familiar with rabbinical scholarship which, he believed, was sometimes better able than Christian sources to \"catch the rays of light\" emanating from the Bible. He was also a prodigious letter writer, engaging in scholarly exchanges with contemporary theologians including Isaac Milner, the eccentric and endlessly curious Dean of Carlisle and his brother, the church historian Joseph Milner. Other correspondents included Archdeacon William Paley, Archdeacon Robert Markham, Archdeacon Robert Nares, Bishop Beilby Porteus and Bishop Samuel Horsley. The scholarly content of Bennet's letters must have been substantive, since the analyses and critiques that he expressed found their way across the Atlantic, and in 1802 George Bennet was the recipient of an honorary Doctorate of Divinity from Harvard College in Massachusetts."]}, {"page": "John Russell Smith", "response": ["Among the books Smith published were Robert Nares's Glossary (edited by Thomas Wright and Halliwell-Phillipps), William Barnes's Dialect Poems and Grammar, Edward Johnston Vernon's Guide to the Anglo-Saxon Tongue, and Joseph Bosworth's Anglo-Saxon Dictionary, abridged. He is best remembered for his \"Library of Old Authors\" series of reprints, mainly of sixteenth and seventeenth century literature, printed by the Chiswick Press and issued between 1856 and 1875."]}, {"page": "Nares, Robert", "response": ["#redirectRobert Nares"]}]}}