{"wiki_id": "http://www.wikidata.org/entity/Q7341015", "itemLabel": "Robbie Turner", "itemDescription": "professional footballer (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_Turner", "wikipedia_page": {"main": "Robert Peter Turner (born 18 September 1966) is an English former professional footballer, born in Easington, County Durham, who played as a striker for Huddersfield Town, Cardiff City, Hartlepool United, Bristol Rovers, Wimbledon, Bristol City, Plymouth Argyle, Notts County, Shrewsbury Town, Exeter City, Cambridge United and Hull City in the Football League, and for Taunton Town and Newton Abbot in non-league football. He is the younger brother of goalkeeper John Turner.", "link_mentions": [{"page": "Top of the World Tour", "response": ["*Robbie Turner – steel guitar"]}, {"page": "Robbie", "response": ["*Robbie Turner, from Atonement (film) (2007)"]}, {"page": "Severnside derby", "response": ["|Gary Shelton, Bob Taylor, Robbie Turner"]}, {"page": "1984–85 Huddersfield Town A.F.C. season", "response": ["|Robbie Turner||||FW||0 (2)||0||0||0||1||0||1 (2)||0"]}, {"page": "Robert Turner", "response": ["Robert, Rob, Bob, Bobby or Robbie Turner may refer to:", "*Robbie Turner (born 1966), English footballer", "*Robbie Turner (drag queen)"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Robbie Turner||||1983–1985||0 (2)||0||0||0||1||0||0||0||0||0||1 (2)||0"]}, {"page": "1988–89 Liverpool F.C. season", "response": ["|FW |||| Robbie Turner || || "]}, {"page": "1988 FA Charity Shield", "response": ["|FW |||| Robbie Turner || || "]}, {"page": "Paul Robinson (footballer, born 1971)", "response": ["During Argyle's pre-season tour of Sweden, Sunday Independent journalist Rupert Metcalf assessed Robinson as more mobile than fellow new arrival, target-man Robbie Turner, and with \"genuine potential, although he clearly still has some rough edges to be refined\". On his first competitive start, Robinson scored twice in a minute – first a header, then a run followed by a shot from distance – in a 3–2 win against Millwall. This earned him a place in the starting eleven for the next few matches, but he failed to score and lost his place. In the second half of the season he scored once from three starts and one substitute appearance, and returned to the Fourth Division with Hereford United for 1991–92. He was reportedly disappointed at being given insufficient opportunity to succeed at the higher level."]}]}}