{"wiki_id": "http://www.wikidata.org/entity/Q7349803", "itemLabel": "Robert Simons", "itemDescription": "cricketer (1922-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Simons", "wikipedia_page": {"main": "Robert George 'Bob' Simons (23 March 1922 – 21 December 2011) was an English cricketer. Simons was a right-handed batsman who fielded as a wicket-keeper. He was born at Watford, Hertfordshire, and was educated at Berkhamsted School.\nSimons made his debut for Hertfordshire in the 1939 Minor Counties Championship against Bedfordshire, with him making two further appearances that season against Buckinghamshire and Berkshire. World War II ended county cricket for six seasons until 1946. Following the war, Simons resumed playing for Hertfordshire in 1948. From 1948 to 1969, he made 116 further Minor Counties Championship appearances for the county, with his final appearance coming in the 1969 season against Bedfordshire. He made a single first-class appearance for the Minor Counties against the touring Indians at Longton Cricket Club Ground, Stoke-on-Trent in 1959. He was dismissed for a duck by being run out in the Minor Counties first-innings, while he wasn't required to bat in their second-innings. Behind the stumps he caught Naren Tamhane and stumped Pankaj Roy from the bowling of Colin Atkinson.Simons also played two List A matches for Hertfordshire. The first came in the 1964 Gillette Cup in Hertfordshire's inaugural List A match against Durham. Hertfordshire were dismissed for 63, which was at the time the lowest total made in that format. Simons was dismissed by John Bailey for 7 runs, with Durham winning by 7 wickets. His second match in that format came against Berkshire in the 1966 Gillette Cup, with him being dismissed for 7 by David Mordaunt, with Hertfordshire scoring 167 all out in their innings. Berkshire won the match by 2 wickets.Later in his life he became the President of the Hertfordshire County Cricket Association, of which he later became an honorary life member. He was also the Chairman of Hertfordshire County Cricket Club from 1988 to 1992, and its President until 2003. He died on 21 December 2011, aged 89.", "link_mentions": [{"page": "1922", "response": ["** Robert Simons, English cricketer, cricket administrator (d. 2011)"]}, {"page": "Berkhamsted School", "response": ["*Robert Simons (1922–2011), cricketer"]}, {"page": "Simons", "response": ["* Robert Simons (1922–2011), English cricketer"]}, {"page": "2011 in the United Kingdom", "response": ["*21 December – Robert Simons, cricketer (b. 1922)"]}, {"page": "Deaths in December 2011", "response": ["*Robert Simons, 89, English cricketer (Hertfordshire)."]}, {"page": "List of people from Berkhamsted", "response": ["* Robert Simons (1922–2011), cricketer"]}, {"page": "Robert George Simons", "response": ["#REDIRECT Robert Simons"]}, {"page": "Bob Simons", "response": ["#REDIRECT Robert Simons"]}, {"page": "March 1922", "response": ["**Robert Simons, English cricketer and wicket-keeper; in Watford, Hertfordshire (d. 2011)"]}, {"page": "List of people from Watford", "response": ["* Robert Simons (1922–2011), cricketer"]}, {"page": "Simons, Robert", "response": ["#redirectRobert Simons"]}, {"page": "List of Hertfordshire County Cricket Club List A players", "response": ["*Robert Simons (1964–1966): RG Simons"]}]}}