{"wiki_id": "http://www.wikidata.org/entity/Q7344659", "itemLabel": "Robert Gallagher", "itemDescription": "British photojournalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Gallagher", "wikipedia_page": {"main": "Robert Gallagher (born 1969 in Kensington, England) is a commercial and editorial photographer currently based in Los Angeles, California. He has been awarded four times in the Communication Arts Photography Annual, named one of the 'Top 25 Photographers of 2016' by Creative Quarterly and is archived in The National Portrait Gallery in London.", "link_mentions": [{"page": "Gallagher (surname)", "response": ["*Robert Gallagher, magazine photographer"]}, {"page": "Robert gallagher", "response": ["#REDIRECT Robert Gallagher "]}, {"page": "John James Nazarian", "response": ["Nazarian was in high demand during the Anthony Pellicano trial because many consider that Nazarian is the only other high-profile P. I. that has become rich and a celebrity in his own right by doing what he does. His insight on the fall from grace of Pellicano; the California Lawyers Magazine felt the case had such significance that the magazine did a full spread on the \"Pellicano Effect\" and featured Nazarian including a two-page photo spread of Nazarian.Martin Lasden, \"The Pellicano Effect,\" California Lawyer, October 2006.Paul Lieberman and Louise Roug, \"A Hollywood gumshoe under investigation,\" Chicago Tribune, December 2, 2002. Nazarian also appeared in the German Magazine Der Spiegel discussing the guilty plea of John McTiernan a client of PellicanoLars-Olav Beier and John Goetz Translated from the German by Jan Liebelt, \"Fear and Loathing in LA Bugging Scandal Reveals Hollywood's Paranoia,\" Der Spiegel, March 8, 2011. in which he was photographed by Robert Gallagher as part of the six picture slide show which is part of the article."]}, {"page": "Bob Gallagher", "response": ["*Robert Gallagher (born 1969), English commercial and editorial photographer"]}, {"page": "Gallagher, Robert", "response": ["#redirectRobert Gallagher"]}]}}