{"wiki_id": "http://www.wikidata.org/entity/Q7343951", "itemLabel": "Robert Eden", "itemDescription": "Scottish Episcopal bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Eden_(bishop)", "wikipedia_page": {"main": "Robert Eden (2 September 1804 – 26 August, 1886) was a British Anglican bishop. He was Bishop of Moray, Ross and Caithness and Primus of the Scottish Episcopal Church.\n\n", "link_mentions": [{"page": "George Ward Hunt", "response": ["Hunt married Alice, daughter of the Right Reverend Robert Eden, Bishop of Moray, Ross and Caithness, in 1857. They had five sons and five daughters, including Sir Allen Thomas Hunt, an Admiral in the Royal Navy."]}, {"page": "Leigh-on-Sea", "response": ["Robert Eden, who became rector of Leigh in 1837, demolished the previous rectory and commissioned a large new one, which was completed in 1838. One quarter of the building remains today as Leigh Library, as the other wings of the building were demolished by Southend Corporation when they acquired the building and the surrounding land. The rectory and grounds occupied a  site, and the work carried out by Eden included the construction of Rectory Grove as a public right of way, which replaced an existing cliff-top path called Chess Lane, and a second trackway between Elm Road and the springs situated near the top of Billet Lane. Leigh Library was designated as a listed building at Grade II in 1974.", "*Robert Eden, rector of Leigh-on-Sea"]}, {"page": "Primus of the Scottish Episcopal Church", "response": ["| Robert Eden"]}, {"page": "Sir Frederick Eden, 2nd Baronet", "response": ["Frederick Morton Eden was the eldest son of Sir Robert Eden, 1st Baronet, of Maryland, and his wife Caroline Calvert, sister of the last Lord Baltimore and niece of Thomas Bladen's wife. His father was governor of Maryland and was created a baronet in 1776. Frederick inherited the baronetcy on the death of his father in 1784. Eden studied at Christ Church, Oxford.  He was one of the founders of the Globe Insurance Company and later its chairman. 1803", "* Rt Reverend Robert Eden (2 September 1804 – 26 Aug 1886)"]}, {"page": "James Kelly (bishop)", "response": ["In 1877 Kelly returned to his country of birth, where he became vicar of Kirkby, Lancashire, from 1877 to 1880, bishop-commissary for the Bishop of Chester (1879-1884) and Archdeacon of Macclesfield from 1880 to 1884. He later became Provost of Inverness Cathedral and Assistant Bishop of Moray, Ross and Caithness in 1885, becoming diocesan bishop in 1886 after Robert Eden. In 1901, he was unanimously elected Primus of the Scottish Episcopal Church and served in that capacity for three years until his retirement."]}, {"page": "Joseph Leycester Lyne", "response": ["An acquaintance with Bishop Robert Eden procured Lyne's admission to Trinity College, Glenalmond. There he studied theology under William Bright, and impressed the warden, John Hannah, by his earnest piety. After a year's lay work as catechist in Inverness, where his eccentricity and impatience of discipline brought him into collision with Bishop Eden, Lyne was ordained into the diaconate in 1860, on the express condition that he should remain a deacon and abstain from preaching for three years. He became curate to George Rundle Prynne, vicar of St Peter's, Plymouth, and soon started a guild for men and boys, called the Society of the Love of Jesus, with himself as superior. Prynne, to Lyne's mother, wrote: \"He was animated by a very true spirit of devotion in carrying out such work as was assigned to him; and his earnest and loving character largely won the affections of those among whom he ministered.\""]}, {"page": "Eden baronets", "response": ["thumb|200px|right|Sir Robert Eden,  1st Baronet, of Maryland", "The Eden Baronetcy of West Auckland was created in the Baronetage of England on 13 November 1672 for Robert Eden, subsequently Member of Parliament for County Durham. He was the son of Colonel John Eden, a supporter of the Royalist cause in the Civil War. The second and fourth Baronets also represented County Durham in the House of Commons. The fifth Baronet assumed the additional surname of Johnson. On his death in 1844, unmarried, the title was inherited by Sir William Eden, 4th Baronet, of Maryland (see below), who became the sixth Baronet of West Auckland as well. He served as High Sheriff of Durham in 1848. The ninth/seventh Baronet is a Conservative politician. On 3 October 1983 he was created a life peer as Baron Eden of Winton, of Rushyford in the County of Durham, in the Peerage of the United Kingdom. Windlestone Hall was the family seat from the 17th to the 20th century.", "The Eden Baronetcy of Maryland in North America, was created in the Baronetage of Great Britain on 19 October 1776 for Robert Eden, the last Governor of Maryland under British rule. He was the second son of the third Baronet of West Auckland. The third Baronet was killed at the Battle of New Orleans in 1814. His cousin, the aforementioned fourth Baronet, succeeded as sixth Baronet of West Auckland in 1844. See above for further history of the titles.Kidd, Charles, Williamson, David (editors). Debrett's Peerage and Baronetage (1990 edition). New York: St Martin's Press, 1990, ", "*Sir Robert Eden, 1st Baronet (died 1720)", "*Sir Robert Eden, 3rd Baronet (died 1755)", "*Sir Robert Eden, 1st Baronet (1741–1784)", "* Robert Eden, third son of the second Baronet of Maryland, was Primus of Scotland and Bishop of Moray, Ross and Caithness.", "* Robert Eden (1836–1907), a grandson of Morton Eden, 1st Baron Henley, fought in the American Civil War with the 37th Wisconsin Volunteers, was editor of the Northwestern newspaper, and became senior engineer with the Edison Light Co.", "* Sir Robert Eden, 1st Baronet, of West Auckland (d. 1720) m. Margaret Lambton", "*** Sir Robert Eden, 3rd Baronet (ca.1715–1755)Cokayne, George E. Complete baronetage 1900 m. Mary Davison", "**** Sir Robert Eden, 1st Baronet, of Maryland (1741–1784) m. Caroline Calvert (b. ) (daughter of Charles Calvert, 5th Baron Baltimore)", "********** Sir Robert Eden, 10th and 8th Baronet (b. 1964)", "********* Robert Eden (b. and d. 1928)", "****** Robert Eden (1804–1886) m. Emma Park", "***** Robert Eden, 3rd Baron Auckland (1799–1870) m. Mary Hurt (–1872)", "********** Robert Eden, 10th Baron Auckland (b. 1962)"]}, {"page": "Bishop of Moray, Ross and Caithness", "response": ["| Robert Eden"]}, {"page": "Inverness Cathedral", "response": ["Bishop Robert Eden decided that the Cathedral for the united Diocese of Moray, Ross and Caithness should be in Inverness. The foundation stone was laid by the Archbishop of Canterbury, Charles Longley, in 1866Gerald Stranraer-Mull: Steps on the Way: the journey of the Scottish Episcopal Church 1513-2013 and construction was complete by 1869, although a lack of funds precluded the building of the two giant spires of the original design. The architect was Alexander Ross, who was based in the city. The cathedral is built of red Tarradale stone, with the nave columns of Peterhead granite.", "* Robert Eden"]}, {"page": "1886 in the United Kingdom", "response": ["* 26 August – Robert Eden, bishop in the Scottish Episcopal Church (born 1804)"]}]}}