{"wiki_id": "http://www.wikidata.org/entity/Q7341018", "itemLabel": "Robbie Vincent", "itemDescription": "British radio DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Robbie_Vincent", "wikipedia_page": {"main": "Robbie Vincent (born 9 June 1947) is an English radio broadcaster and DJ whose catch phrase for many years was \"If it moves, Funk it\". As a champion of jazz, funk and soul music in the UK during the late 1970s his contribution both live in clubs and on radio cannot be overestimated. Vincent himself proved as important a radio pioneer as some of the great American soul artists he interviewed and in 1995 was voted Independent Radio Personality of the Year at the prestigious Variety Club of Great Britain annual awards.\n\n", "link_mentions": [{"page": "BBC Radio 1", "response": ["In 1984, Robbie Vincent joined to host a Sunday evening soul show. Mike Smith left for a while to present on BBC TV's Breakfast Time, Gary Davies then took over the weekday lunchtime slot. Bruno Brookes joined and replaced Peter Powell as presenter of the teatime show, with Powell replacing Blackburn on a new weekend breakfast show."]}, {"page": "June 9", "response": ["*  1947   – Robbie Vincent, UK disc jockey and radio presenter"]}, {"page": "Felixstowe", "response": ["* Robbie Vincent (born 1947) an English radio broadcaster and DJ"]}, {"page": "Old Kent Road", "response": ["Public houses on Old Kent Road have been closing since the 1980s. At one point, there were 39 pubs. The Dun Cow at No. 279 opened in 1856 and was well known as a gin palace, and later became a champagne bar and featured DJs such as Steve Walsh and Robbie Vincent. The premises closed in 2004 to become a surgery. The World Turned Upside Down had been on the Old Kent Road since the 17th century, and may have been named after the discovery of Australia, Van Diemen's Land, or Tierra del Fuego in South America. The pub became a music venue in the 20th century and is where Long John Baldrey gave his first live performance in 1958. It closed in 2009 and is now a branch of Domino's Pizza. The Duke of Kent was converted into a mosque in 1999; in 2021 the building was demolished for a purpose built mosque. The Livesey Museum for Children closed in 2008 owing to council budget cuts and is now used for short term accommodation."]}, {"page": "Bobby Womack", "response": ["In 1980, Wilton Felder released the album Inherit The Wind on MCA Records which featured Womack.  He had a soulful song featuring on the Wilton Felder single \"(No Matter How High I Get) I'll Still Be Looking Up to You\". This song became a soul classic, notably in the UK—Robbie Vincent at Radio London included the track as one of his all-time winners in October 1982. In 1981, Womack signed with Beverly Glen Records and had his first R&B top 10 single in five years—since the 1976 single \"Daylight\"—with \"If You Think You're Lonely Now\" that peaked at number three on the R&B singles chart. His accompanying album The Poet reached number one on the R&B album charts and is now seen as the high point of his long career, bringing him wider acclaim not only in the U.S. but also in Europe. He had two more R&B top 10 singles during the 1980s including the Patti LaBelle duet, \"Love Has Finally Come at Last\"(1984), and \"I Wish He Didn't Trust Me So Much\"(1985).I wish he didn't trust me retrieved 14 October 2021 In 1986, Bobby recorded soul song \"Living in a Box\" with new group Living in a Box."]}, {"page": "BBC Radio Kent", "response": ["The radio station was launched in 1970 under the name of BBC Radio Medway, originally only serving the Medway Towns. It broadcast from studios at 30 High Street in Rochester, a former newspaper office which was subsequently named Media House.  The local radio station became well known in the early 1980s for its early Friday evening soul music show presented by DJ Dave Brown becoming one of the most listened to soul shows in the UK before DJ Robbie Vincent earned that achievement with the national broadcaster BBC Radio 1 in 1983."]}, {"page": "BBC Radio London", "response": ["*Robbie Vincent"]}, {"page": "Third World (band)", "response": ["In 1983, Third World had cross-over success on the UK Jazz Funk scene with their reggae single 'Lagos Jump' largely thanks to Robbie VincentRobbie Vincent Saturday Show, Radio London, 5 May 1983 and Jeff Young who played the 12\" version on their Radio London shows. The track also became popular on the London club scene and in particular at Flicks in Dartford."]}, {"page": "Brit funk", "response": ["Brit funk (or Britfunk) is a musical style that has its origins in the British music scene of the late 1970s and which remained popular into the 1980s. It mixes elements from jazz, funk, soul, urban dance rhythms and pop hooks. The scene originated in southern England and spread with support from DJs including DJ Froggy,  Greg Edwards, Robbie Vincent, Chris Hill and Colin Curtis. Major funk acts included Average White Band, Ian Dury & the Blockheads, Hi-Tension, Light of the World, Level 42, Central Line, Beggar and Co, Shakatak, Freeez and Linx. The genre also influenced 1980s new wave/pop groups such as Haircut 100, Culture Club, Bow Wow Wow, Pigbag and Dexys Midnight Runners.", "The British funk scene developed from the Home Counties, principally Essex at Lacy Lady in Ilford and The Goldmine on Canvey Island, along with clubs such as Crackers and the 100 Club on London's Oxford Street, Royalty in the London suburb of Southgate and Frenchies in Camberley, Surrey. According to 'Bluey' Maunick, the club scene attracted \"a real mix of Black kids and white kids getting on in a surrounding that they all enjoyed, where they could be themselves\", helping to break down the racial barriers which he had grown up with. In the South DJ Chris Hill and his Funk Mafia were pioneers, and in the North Colin Curtis, among others, were instrumental in its growth in popularity.\"Feel the Chant: The Brit Funk Story\", 16 March 2013, retrieved 12 January 2014. Although the scene enjoyed significant underground popularity - a 1980 all-day event at Knebworth featuring Light of the World attracted 12,000 people - it attracted little mainstream media attention outside of Robbie Vincent's show on BBC Radio London: the BBC did produce Black Current, a TV pilot featuring Hi-Tension which was intended to launch a show conceived as a British equivalent of Soul Train, but this was not picked up for a full series."]}, {"page": "Frankie Beverly", "response": ["The group's popularity was enhanced considerably in the UK by DJs Greg Edwards and Robbie Vincent in the late 1970s and early 1980s when they performed live at London's Lyceum Ballroom for broadcast on Capital Radio.  They are best known there for their UK No. 57 hit single, \"Joy and Pain\"."]}, {"page": "Maze (band)", "response": ["Their next recording was Live in New Orleans, three quarters of which was recorded at the Saenger Theatre, on November 14–15, 1980. Three of those songs got into the US R&B chart, including \"Running Away\", \"Before I Let Go\", and \"We Need Love to Live\". By that time, the band had a reputation in America and enjoyed a following in the United Kingdom with promotional support from the British DJ Robbie Vincent. In May 1985, Maze sold out eight nights at the Hammersmith Odeon."]}, {"page": "Gino Soccio", "response": ["In the UK he received airplay from Robbie Vincent on BBC Radio London, and Greg Edwards on Capital Radio on imported RFC Records, a subsidiary of Warner Bros. Records."]}, {"page": "Jazz-funk", "response": ["While the vast majority of jazz-funk bands are American, several British jazz-funk artists and bands emerged in the late 1970s and early 1980s    who broke away from the disco and commercial scene, encouraged by club DJs like Chris Hill, Robbie Vincent who was then on BBC Radio London, and Greg Edwards who had a Saturday evening show on London's first ever commercial radio station Capital Radio. This type of music was also heavily played on Europe's first soul radio station, Radio Invicta and later pirate radio stations such as Solar Radio, Horizon, and Kiss FM.  The first of these self-contained bands to establish a real UK identity was Light of the World formed by Breeze McKrieth, Kenny Wellington, Jean-Paul 'Bluey' Maunick, Paul 'Tubbs' Williams, Peter Hinds and David Baptiste. Offshoots of the band also formed Beggar & Co and Incognito."]}, {"page": "Jazz FM (UK)", "response": ["*Robbie Vincent (Sundays)"]}, {"page": "Faze FM", "response": ["The Kiss 102/105 dance music format was the brainchild of two highly experienced UK radio programmers, Mike Gray and Guy Hornsby, who first worked together at the original BBC Radio London where they produced the station's leading DJ presenters Robbie Vincent and Tony Blackburn."]}, {"page": "George Howard (jazz)", "response": ["Howard was born September 15, 1956 in Philadelphia. In the late 1970s, he toured with Grover Washington, Jr., who was one of his idols. In the early 1980s, Howard released his first and second studio albums, Asphalt Gardens and Steppin' Out. Both albums were well received and ranked high on the Billboard magazine jazz album charts at No. 25 and 9, respectively.  The last track on 'Steppin' Out' is called 'Dream Ride' and features George playing soprano saxophone.  The track was promoted in 1984 in the UK by DJ Robbie Vincent and is now a classic among soul and jazz enthusiasts."]}, {"page": "Kiss 102", "response": ["The frequency was originally issued  to Sunset 102 Radio - The Kickin FM but that suffered some financial problems. In May 1993, the Radio Authority made a decision to prematurely terminate Sunset's licence, apparently accusing the station of providing inaccurate information about its financial and management affairs. In August 1993 the station reportedly had its transmission facilities withdrawn by NTL for non-payment. Following a brief return to the air the liquidator was called in and Sunset's frequency finally fell silent. The liquidator was later to re-apply on behalf of Sunset Radio for its re-advertised licence. Faze FM won the re-advertised licence for Manchester. Like Sunset, Faze FM's remit was to broadcast dance music, licensing the brand name \"Kiss\" from London station Kiss 100FM and the station launched as Kiss 102 on the 16 October 1994. The licence win was spearheaded by Eugene Perera's Level Broadcast and included shareholders UKRD, Eastern Counties Newspaper Group and 3i. The format was the brainchild of two highly experienced UK radio programmers - Managing Director, Guy Hornsby and Programme Director, Mike Gray who first worked together at the original BBC Radio London where they produced the station's highest profile presenters Tony Blackburn and Robbie Vincent."]}, {"page": "Soulboy", "response": ["There was simultaneous development of the subculture at nightclubs in South East England, such as The Goldmine in Canvey Island and The Royalty in Southgate. DJs involved with the soulboy scene included Chris Hill, Robbie Vincent, Froggy, Greg Edwards, Pete Tong ( George Power )and Chris Bangs. Caister Soul Weekenders became one of the main features of the scene, and still exist today. The Casual subculture that emerged in the 1980s was heavily influenced by the soulboys, including the sideways fringed wedge hairstyle and Lois jeans "]}, {"page": "Major Harris (singer)", "response": ["In 1984, Harris recorded the LP I Believe In Love on Streetwave Records, the title track of the same name which did receive airplay that year on BBC Radio 1 from DJ Robbie Vincent. However, the LP had limited success."]}, {"page": "List of British films of 1943", "response": ["|Happidrome||Philip Brandon||Harry Korris, Robbie Vincent||Comedy||"]}, {"page": "Chris Hill (DJ)", "response": ["Chris Hill (born 8 January 1945) is a British disc jockey. He worked at the club Lacy Lady in Ilford, as well as at the Goldmine Canvey Island and was the head of the 'Soul Mafia' a group of DJs which included Greg Edwards, DJ Froggy, Jeff Young and Robbie Vincent, in London and the South East of England into the early 1980s. He had a major input into the creation of the British 'Brit Funk' music scene of the late 1970s and early 1980s."]}, {"page": "Keith Thomas (saxophonist)", "response": ["Thomas, making his first album at FreeRange Studios, with sound engineer and record producer Marc Frank, was introduced to Robbie Vincent, who managed the R&B band Second Image. "]}, {"page": "British pop music", "response": ["In 1987, George Michael reinvented himself as a white soul ('blue-eyed soul') singer with the multi-platinum album Faith.G. Wald, Soul's Revival: White Soul, Nostalgia and the Culturally Constructed Past, M. Guillory and R. C. Green, Soul: Black power, politics, and pleasure (New York University Press, 1997), pp. 139–58. In the 1980s, soul emerged as a major influence on British pop music, with flourishing soul scenes in major cities like London and Manchester, the latter known for being part of the Northern Soul scene which included venues such as the Twisted Wheel and the Wigan Casino. Many black artists were supported by local radio stations (both licensed and pirate) and radio presenters/DJs like Robbie Vincent, Chris Hill and Steve Walsh.A. Donnell, ed., Companion to contemporary Black British culture (London: Taylor & Francis, 2002), pp. 285–6. In October 1987, about seven months before he died, Walsh had a number nine hit with a cover of \"I Found Lovin'\" which was joined in the Top Ten by the original 1983 recording by the Fatback Band in the same week, while other popular soul covers included Phil Collins's \"You Can't Hurry Love\", his first number one from 1982. Other songs influenced by soul included Culture Club's \"Church of the Poison Mind\" (1983), The Style Council's \"Speak Like a Child\" (1983), Eurythmics' \"Missionary Man\" (1986), and Steve Winwood's \"Roll With It\" (1998). Also significant were Sade, Simply Red and toward the end of the decade Lisa Stansfield and Soul II Soul. Soul II Soul's breakthrough R&B hits \"Keep on Movin'\" and \"Back to Life\" in 1989 have been seen as opening the door to the mainstream for black British soul and R&B performers."]}, {"page": "The Chi-Lites", "response": ["In 1980, Thompson, Jones, and Lester re-formed the group. Lester was the lead singer. The new group continued using the Chi-Lites established name. Creadel Jones left for a second time in 1982, and the group would remain a trio. In 1983, the group released the critically acclaimed Bottoms Up album and achieved notable club and R&B chart success with the title track and \"Changing For You.\" Released on LARC Records, the album was also released in the UK on the R&B label under the distribution wing of PRT. \"Changing For You\" album version was released in the UK as a 12\" single which became popular in London clubs including Flicks in Dartford and The Goldmine in Canvey Island. \"Changing For You\" also remained on the Caister Weekender playlist for two years. \"Changing For You\" and the title track \"Bottoms Up\" were heavily played and promoted by UK Jazz Funk Soul DJ Robbie Vincent. An edited version of \"Changing For You\" entered the UK Charts and reached No. 61. Record left again in 1988, and new lead Frank Reed joined to replace him. Singer Anthony Reynard Watson replaced Reed later that year and the duty of lead vocals would alternate between Reed and Watson over the course of the next decade. (Lester took over singing lead on \"Oh Girl\", while Watson led on their other songs)."]}, {"page": "DJ Froggy", "response": ["Steven Howlett (8 November 1950 – 28 March 2008), aka DJ Froggy, was an English DJ who worked as a 'beatmixer DJ' on the British club music scene in the 1970s, 1980s and 1990s.  He was a member of the Soul Mafia group of DJs which included Robbie Vincent, Greg Edwards, Jeff Young and Chris Hill.", "In 1978 he incorporated his sound system at one of Britain's first soul \"all-dayers\", the National Soul Festival in Purley and a year later in 1979 he became DJ at the first \"Caister Soul Weekender\" based in Great Yarmouth.  He worked alongside DJs which included Robbie Vincent, Chris 'Rent-a-Santa' Hill, Greg Edwards of Capital Radio's 1970s/1980s 'Soul Spectrum' programme fame and Jeff Young who all became known as the 'Soul Mafia'. Froggy then went on to the Prestatyn soul weekender when Original Caister Promoter Adrian Webb moved the Event to Wales. His use of tape recorders and mixing decks alongside his own sound system and the mixing consoles which were also designed by himself, were popular with the British club scene and became an introduction to the 1980s rave culture.DJ Froggy www.thetimes.co.uk Retrieved 20 June 2020"]}, {"page": "Somewhere in England (film)", "response": ["* Robbie Vincent - Pte. Enoch"]}, {"page": "BBC Radio 2", "response": ["* Robbie Vincent (1997 only)"]}, {"page": "2013 in British radio", "response": ["*29 November – Robbie Vincent announces he will leave Jazz FM. His final show airs on Sunday 1 December."]}, {"page": "Greg Edwards (DJ)", "response": ["It was at Capital Radio that Edwards worked alongside DJs including the late Kenny Everett, Dave Cash and Chris Tarrant.  From the mid-1970s and into the early 1980s he went on to present a Saturday early evening programme on Capital Radio called \"Soul Spectrum\" from 5-8pm where his infamous 'bathroom call' was announced, playing music for those who were 'getting ready to go out and party on the town'. Edwards was one of a group of DJs who became stars on the club music scene.  They were affectionately known as the ‘soul mafia’ with DJs Chris Hill, Jeff Young, Robbie Vincent and the late DJ Froggy (Steve Howlett) among them. "]}, {"page": "Timeline of BBC Radio 1", "response": ["**1 January – Robbie Vincent joins the station on a permanent basis to present a Sunday evening soul music show.", "**December – At the end of the year, Robbie Vincent leaves."]}, {"page": "Timeline of BBC Radio 2", "response": ["*Robbie Vincent joins, but later leaves."]}, {"page": "Timeline of BBC Radio London", "response": ["**Robbie Vincent launches a late-night phone-in called Late Night London.", "**May – Robbie Vincent moves from Late Night London to the lunchtime show, swapping with David Simmons who moves to the late evening show in August.", "**17 November – BBC Radio London makes major changes to its weekday programming. Home Run, which had been on air since the station's launch, is replaced by London News Desk and a new arts-based programme called Stop, Look, Listen, London Live moves from mid-morning to early afternoon and is replaced in mid-morning by The Robbie Vincent Telephone Programme with Rush Hour extended by an hour. The evening shows are dropped with weeknight programming ending at 8pm instead of 10pm with some of the displaced programmes moving to Sunday afternoons.", "** Robbie Vincent leaves. He had been at the station since its launch."]}, {"page": "2021 in British radio", "response": ["**Jazz FM begins a new Sunday presenting line up which sees Tony Minvielle moving from a late night slot to replace Jeff Young's show, and the fulltime return of Robbie Vincent.", "**Jazz FM launches The Robbie Vincent Music Garden Party, a streaming channel featuring music played by Robbie Vincent on his show for the station. "]}, {"page": "Hi-Tension (album)", "response": ["In August 1978, \"British Hustle\" was released as a single and became the band's only UK Top 10 hit, where it reached number 8. The track was popularised by British DJs like Greg Edwards and Robbie Vincent, and according to Easlea, \"[t]he single had a freshness, edginess and pizzazz that simply wasn’t coming out of the US disco phenomenon at that point.\" Black Echoes reported in September that the album would be named Bless the Funk and released on 20 October. To promote the upcoming record, Hi-Tension began a 40-date tour in autumn 1978, but the album was not yet completed, \"so it was almost a waste of time\" according to Joseph. The band also found their equipment kept getting damaged, commenting: \"It's like the better you become, and the more things you get, the worse it becomes.\" In early 1979, the band fired their management team – who operated internally at Island – due to the problems surrounding the album's production, and signed to a new company who gave them what they saw as \"the right balance of guidance and independence."]}, {"page": "Timeline of Jazz FM (UK)", "response": ["*29 November – Robbie Vincent announces he will leave Jazz FM. His final show airs on Sunday 1 December.", "**Jazz FM begins a new Sunday presenting line up which sees Tony Minvielle moving from a late night slot to replace Jeff Young's show, and the fulltime return of Robbie Vincent."]}, {"page": "Solar Radio", "response": ["On 1 June 1999, Solar returned through satellite broadcasting, initially broadcasting on Astra 1, and then Astra 2 (used by Sky TV) from 9 August 2000 where they stayed until 31 May 2019. From 29 October 2015, Solar also commenced broadcasting on DAB, as part of small-scale DAB trials. In 2006 the well known soul and jazz funk DJ Robbie Vincent was occasionally a guest presenter on Tony Monson's 10 am to 1 pm weekday show on the station."]}]}}