{"wiki_id": "http://www.wikidata.org/entity/Q7341381", "itemLabel": "Robert Aim Lennie", "itemDescription": "British doctor (1889-1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Aim_Lennie", "wikipedia_page": {"main": "Robert Aim Lennie (5 April 1889 – 26 March 1961) was Regius Professor of Midwifery at the University of Glasgow from 1946 to 1955.\nLennie was born at Cambuslang, Glasgow in 1889 the son of Ritchie Lennie (24 January 1847 – 28 June 1909), an oil and colour manufacturer, from Kincardine, (then) Perthshire, and his wife Isabella Crawford Smith, daughter of Brodie Smith, a drapery merchant, from Leslie, Fife. R.A. Lennie graduated MB from the University of Glasgow in 1912, and was admitted as a Fellow of the Royal College of Obstetricians and Gynaecologists in 1936. \nDuring World War I, Lennie was in command of a Desert Ambulance Train with the Royal Army Medical Corps. During World War II, he served as a Colonel with the RAMC, in charge of Number 4 Scottish General Medical Hospital, later the Military Hospital at Drimnin, on the Morvern peninsula. \nAfter World War I Lennie worked at the Glasgow Royal Maternity Hospital, succeeding John Martin Munro Kerr as head of the wards there, and as gynaecologist to the Glasgow Victoria Infirmary, in 1934. In 1946 he succeeded to the Chair of Midwifery at the University of Glasgow after the death of James Hendry. \nA man of conservative judgement, Lennie disapproved of surgeons who were too quick, in his opinion, to solve the complexity of childbirth by induction or Caesarean section. He retired in 1955.\nR. A. Lennie married Dr Mary Kirk Jeffrey at Glasgow in 1926. Famed for his passion for golf, he was captain of the Glasgow Golf Club. He died at Helensburgh, Dumbartonshire in 1961.", "link_mentions": [{"page": "Helensburgh", "response": ["*Robert Aim Lennie, doctor"]}, {"page": "Regius Professor of Obstetrics and Gynaecology (Glasgow)", "response": ["* Robert Aim Lennie MD LLD (1946)"]}, {"page": "Murdoch Cameron", "response": ["Nevertheless, Cameron held the position of Professor of Midwifery for thirty-two years, and was awarded an honorary LLD for ‘a long period of faithful, useful and distinguished service’ The Glasgow Herald, Glasgow, 29 April 1930. by the University of Glasgow at his retirement. During four decades of academic teaching, Cameron taught four of his successors to the Chair of Midwifery: John Martin Munro Kerr, Samuel James Cameron, James Hendry and Robert Aim Lennie. Murdoch Cameron died in Glasgow in 1930."]}, {"page": "Robert Lennie", "response": ["#REDIRECT Robert Aim Lennie"]}, {"page": "Index of World War II articles (R)", "response": ["# Robert Aim Lennie"]}, {"page": "Lennie (surname)", "response": ["* Robert Aim Lennie (1889–1961), Professor of Midwifery "]}]}}