{"wiki_id": "http://www.wikidata.org/entity/Q7341843", "itemLabel": "Robert Bamford", "itemDescription": "British engineer and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Bamford", "wikipedia_page": {"main": "Robert Bamford (16 June 1883 – 1942) was an English engineer, who with Lionel Walker Birch Martin (15 March 1878– 21 October 1945), founded a company in January 1913 that became Aston Martin.", "link_mentions": [{"page": "Aston Martin", "response": ["Aston Martin Lagonda is a British independent manufacturer of luxury sports cars and grand tourers. Its predecessor was founded in 1913 by Lionel Martin and Robert Bamford. Steered from 1947 by David Brown, it became associated with expensive grand touring cars in the 1950s and 1960s, and with the fictional character James Bond following his use of a DB5 model in the 1964 film Goldfinger. Their sports cars are regarded as a British cultural icon. Aston Martin has held a Royal Warrant as purveyor of motorcars to the Prince of Wales since 1982, and has over 160 car dealerships in 53 countries, making it a global automobile brand. The company is traded at the London Stock Exchange and is a constituent of the FTSE 250 Index. In 2003 it received the Queen's Award for Enterprise for outstanding contribution to international trade. The company has gone bankrupt seven times in its history.", "Aston Martin was founded in 1913 by Lionel Martin and Robert Bamford. The two had joined forces as Bamford & Martin the previous year to sell cars made by Singer from premises in Callow Street, London where they also serviced GWK and Calthorpe vehicles. Martin raced specials at Aston Hill near Aston Clinton, and the pair decided to make their own vehicles. The first car to be named Aston Martin was created by Martin by fitting a four-cylinder Coventry-Simplex engine to the chassis of a 1908 Isotta Fraschini."]}, {"page": "Culture of the United Kingdom", "response": ["The UK has had a long history of car making. Some of the best known British brands are Rolls Royce, Bentley, Aston Martin, Jaguar, Land Rover, MG, and the Mini. Rolls-Royce was founded by Charles Stewart Rolls and Sir Frederick Henry Royce in 1906. In addition to the company's reputation for superior engineering quality in its cars, Rolls-Royce Limited was known for manufacturing the high-powered \"R\" engines, including the iconic Rolls-Royce Merlin aero engine which was used for many World War II aircraft.\"Rolls Royce history\" . Rolls Royce. Retrieved 6 October 0216 Bentley Motors Limited was founded by W. O. Bentley in 1919 in Cricklewood, North London, and, like Rolls Royce, is regarded as a British luxury automobile icon. Aston Martin was founded in 1913 by Lionel Martin and Robert Bamford, and became associated with luxury grand touring cars in the 1950s and 1960s, and with the fictional British spy James Bond. Jaguar was founded in 1922. The Jaguar E-Type sports car was released in 1961; Enzo Ferrari called it \"the most beautiful car ever made\".Classic Car Review 1964, articolo di Sean Curtis Jaguar has, in recent years, manufactured cars for the British Prime Minister. The company also holds royal warrants from Queen Elizabeth II and Prince Charles. The Land Rover launched in 1948 and specialises in four-wheel-drive. Many models have been developed for the Ministry of Defence (MoD). The Mini was released by the British Motor Corporation in 1959 and became a 1960s cultural icon. The performance versions, the Mini Cooper, was a successful rally car. The distinctive two-door Mini was designed for BMC by Sir Alec Issigonis. It has been named Britain's favourite car in a poll."]}, {"page": "List of company name etymologies", "response": ["*Aston Martin – In 1913, Lionel Martin and Robert Bamford co-founded a company to sell Singer cars in London, and Martin developed their first car to take part in races at Aston Hill, near Aston Clinton. Bamford & Martin Ltd ran into financial difficulties, and in 1925, Martin was forced to sell the company (Bamford had already left). The new owners renamed it Aston Martin Motors and started the production of an entirely new range of cars from a new factory in Feltham in London."]}, {"page": "Edward Bamford", "response": ["Edward Bamford was born on 28 May 1887 to the Rev. Robert Bamford, Chaplain to the Yeatman Hospital in SherborneSusan Penn and Ray Penn, A History of Long Street, Sherborne (Sherborne Museum, 2008) (died 9 November 1898, aged 44), and Blanch Edith Bamford (later Mrs E.B. Bamford, 89, Bloomfield Avenue, Bath). The family lived at Lynton House (now known as Abbot's Litten), Long Street, Sherborne, Dorset.", "Edward was educated at Sherborne Preparatory School, and later at Sherborne School, which he attended as a day boy from September 1900 until April 1902. His two brothers, Robert Bamford (1883–1942) who was one of the founders of Aston Martin and Arthur Bamford (1889–1915) were also educated as day boys at Sherborne School.  Arthur, who became a private in the Grenadier Guards, was killed near Loos on 11 October 1915 and is commemorated at St Mary's A.D.S. Cemetery, Haisnes, IX.D.13., and on the Sherborne School War Memorial and Sherborne School Book of Remembrance.", "An obituary for Major Edward Bamford, V.C. appeared in The Shirburnian, the Sherborne School magazine, December 1928: Major Bamford, the son of the late Rev. Robert Bamford, was born in 1887, and was a day-boy at Sherborne from 1900 to 1902. He joined the R.M.L.I in 1905, and served at various times in H.M.S. Bulwark, Magnificent, Britannia, Chester, Royal Sovereign, and High Flyer. He was gazetted Captain in 1916, and awarded the D.S.O. for his services at the Battle of Jutland. He won his V.C. as a leader of the landing party from the Vindictive on the Zeebrugge Mole on St. George's Day, 1918, and he will always be remembered as one of the outstanding heroes of that most gallant adventure. He died of pneumonia on September 30th, in China, where he held the appointment of Instructor of Small Arms and Musketry Officer at Hong Kong. In him Sherborne mourns one of her most distinguished sons.Obituary for Major Edward Bamford, V.C., The Shirburnian, December 1928."]}, {"page": "Lionel Martin", "response": ["During his driving ban he had become friends with another cyclist in the Bath Road Club, Robert Bamford. In 1912 they began to sell cars together.  They co-founded Bamford and Martin Limited, at Henniker Mews in Kensington. Martin participated in competitions of the Motor Cycling Club, including those from London to Edinburgh. Their first advert was in the Bath Road News."]}, {"page": "Automotive Hall of Fame", "response": ["* Robert Bamford"]}, {"page": "Robin Jacques", "response": ["In 1943, Jacques married Patricia Bamford, daughter of engineer Robert Bamford, co-founder of Aston Martin, and fashion designer Matilda Etches, and they had one son, John Paul Jacques. After her death he married Azetta van der Merwe in 1958, and after her death, he married Alexandra Mann (died 1995), which ended in divorce."]}, {"page": "Lamarsh", "response": ["Robert Bamford one of the two founders of Aston Martin was born in 1883 in Lamarsh."]}, {"page": "Bamford (surname)", "response": ["*Robert Bamford (1883-1942), Founded the well-known car brand Aston Martin"]}, {"page": "Matilda Etches", "response": ["In 1919, Etches married the engineer Robert Bamford, who founded a company that became Aston Martin. They had a daughter, Patricia Bamford, who married the illustrator Robin Jacques."]}, {"page": "Bamford, Robert", "response": ["#redirectRobert Bamford"]}]}}