{"wiki_id": "http://www.wikidata.org/entity/Q7343435", "itemLabel": "Robert Dawes", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Dawes", "wikipedia_page": {"main": "Robert Dawes (fl. 1610–1614) was an English actor of the Jacobean era. He is unique in the extant records of English Renaissance theatre, in that his individual employment contract with one of his acting companies has survived.Dawes was an early and perhaps an original member and \"sharer\" (a partner who shared in the profits, rather than a hired man who worked for a wage) with Prince Charles's Men, from at least 1610 on. He remained with that company only until 1614, however, when he left for the Lady Elizabeth's Men. Dawes was admitted as a sharer in the Lady Elizabeth's troupe; his personal 3-year contract with managers Philip Henslowe and Jacob Meade, dated 7 April of that year, spells out a schedule of graduated penalties for minor and major infractions of the rules:\nIf Dawes was late for a rehearsal, he had to pay a fine of \"twelve pence,\" one shilling (1 s.).\nIf he missed a rehearsal entirely, the fine was 2 s.\nIf he was late for a performance, the fine rose to 3 s.\nIf he was drunk at the start of a performance (in the judgement of four troupe members), the fine was 10 s.\nIf he missed a performance with no adequate excuse, the fine rose to one pound (£1).\nAnd if he was found guilty of appropriating any of the company's expensive costumes or other property (as by wearing a costume outside the theatre), the fine was a hefty (almost astronomical) £40.(As a comparison, William Shakespeare paid £60 for New Place, the largest house in Stratford-upon-Avon, in 1597.)\nSince no other comparable contract for an actor of the period exists, scholars cannot be certain that the Dawes document is representative. Yet there is nothing in Dawes's career that suggests he was particularly unusual, so that his contract was probably within the range of what was normal and typical for the actors of the period.", "link_mentions": [{"page": "Playing company", "response": ["In Renaissance-era London, playing company was the usual term for a company of actors. These companies were organised around a group of ten or so shareholders (or \"sharers\"), who performed in the plays but were also responsible for management.For examples of the legal complications involved in the share structure, see: Susan Baskervile; Richard Baxter; Robert Dawes. The sharers employed \"hired men\" that is, the minor actors and the workers behind the scenes. The major companies were based at specific theatres in London; the most successful of them, William Shakespeare's company the King's Men, had the open-air Globe Theatre for summer seasons and the enclosed Blackfriars Theatre in the winters. The Admiral's Men occupied the Rose Theatre in the 1590s, and the Fortune Theatre in the early 17th century.", "In 1605 the actor Augustine Phillips left specific pieces of his wardrobe to an apprentice in his last will and testament including his \"mouse-colored\" velvet hose, purple cloak, white taffeta doublet, and black taffeta suit. To a modern sensibility, this may sound quaint and odd; but when \"a doublet and hose of seawater green satin cost £3\",Chambers, Vol. 2, p. 184. the monetary value of Phillips' items was not negligible. Actors could face serious penalties for appropriating the costumes of their companies. [See Robert Dawes for an example.] (The players could defray some of their costs in the used clothing market. As an example, the King's Men bought discarded items of Gondomar's wardrobe for the actor playing the Black Knight in A Game at Chess. Melissa D. Aaron, Global Economics: A History of the Theatre Business, the Chamberlain's/King's Men, and Their Plays, 1599–1642, Newark, DE, University of Delaware Press, 2003; p. 120. Often, \"eminent lords and knights at their decease\" would leave articles of their finery to their servants much of it \"unseemly\" for servingmen and women to wear. Such garments would end up the property of the actors.)Gurr, Shakespearean Stage, pp. 194, 198."]}, {"page": "Lady Elizabeth's Men", "response": ["In 1613, Lady Elizabeth's Men combined with the Children of Whitefriars; the combined troupe performed A Chaste Maid in Cheapside, by Thomas Middleton, at the Swan in 1613. Sometime in the next year or so, they joined in another combination with Prince Charles's Men. The company acted Ben Jonson's Bartholomew Fair at the newly built Hope Theatre on 31 October 1614.Actor Robert Dawes joined the troupe in 1614; his individual contract with the company is the only such document that survives from the era – and its rigorous terms show something of how Henslowe did business."]}, {"page": "Prince Charles's Men", "response": ["Seven actors are listed in the patent: John Garland, William Rowley, Thomas Hobbes, Robert Dawes, Joseph Taylor, John Newton, and Gilbert Reason. Rowley was their dramatist and clown; Joseph Taylor would be their leading man in future years, and then fill the same function with the King's Men, when he replaced the late Richard Burbage in May 1619. Garland was a veteran, having been a founding member of Queen Elizabeth's Men in 1583. Hobbes had a comparably long career ahead of him: he would be with the King's Men as late as 1637. Newton and Reason continued with the company until its end in 1625.Edwin Nunzeger, A Dictionary of Actors and of Others Associated with the Representation of Plays in England Before 1642, New Haven, Yale University Press, 1929; pp. 146–7, 193, 259, 293."]}, {"page": "Robert Dawes (disambiguation)", "response": ["Robert Dawes was an English actor.", "Robert Dawes may also refer to:", "*Sir Robert Dawes (died 1690), second baronet of the Dawes baronets"]}, {"page": "Dawes, Robert", "response": ["#redirectRobert Dawes"]}]}}