{"wiki_id": "http://www.wikidata.org/entity/Q7345597", "itemLabel": "Robert Home", "itemDescription": "British portrait painter in India (1752-1834)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Home", "wikipedia_page": {"main": "Robert Home (1752–1834) was a British oil portrait painter who travelled to the Indian subcontinent in 1791. During his travels he also painted historic scenes and landscapes.\n\n", "link_mentions": [{"page": "Military history of India", "response": ["Indian soldier of Tipu Sultan's army.jpg|A Mysorean soldier from India, using his Mysorean rocket as a flagstaff (Robert Home, 1793/4)."]}, {"page": "History of metallurgy in the Indian subcontinent", "response": ["Indian soldier of Tipu Sultan's army.jpg|A Mysorean soldier using his Mysorean rocket as a flagstaff (Robert Home, 1793/4)."]}, {"page": "Savandurga", "response": ["Savandurga is formed by two hills known locally as Karigudda (black hill) and Biligudda (white hill). The earliest record of the name of the hill is from 1340 AD by Hoysala Ballala III from Madabalu where it is called Savandi. Another view is that the name is originated from Samantadurga attributed to a Samantharaya, a governor under Ahchutaraya at Magadi, although there is no inscription confirming this. This was the secondary capital of the Magadi rulers such as Kempegowda. From 1638 to 1728, Mysore took over this place and Dalavayi Devaraja occupied this place with the palace at Nelapattana. In 1791 Lord Cornwallis captured it from Tipu Sultan's forces during the Third Anglo-Mysore War.Wilks, Mark. Historical Sketches of the South of India in an Attempt to Trace the History of Mysoor: from the origin of the Hindoo government of that state, to the extinction of the Mohammedan dynasty in 1799. Edited with notes by Murray Hammick. Mysore: Government Branch Press, 1930-1932. Robert Home in his Select views in Mysore (1794) shows distant views of the hill from Bangalore.Home, Robert. Select Views in Mysore: the country of Tippoo Sultan from drawings taken on the spot by Mr. Home with historical descriptions. First publ. London: Bower, 1794. He called it Savinadurga or the fort of death. There were no steps to reach the hill top and it was covered by bamboos and other trees forming a barricade."]}, {"page": "Robert Bowyer", "response": ["Due to his relationship with Smart, Bowyer also published a series of engravings regarding India. In 1794, for example, he published Picturesque Views, with a Descriptive History of the Country of Tipoo Sultan after drawings by Robert Home and in 1797 Oriental Scenery: Twenty-Four Views in Hindoostan after drawings by Thomas Daniell."]}, {"page": "History of rockets", "response": ["Indian soldier of Tipu Sultan's army.jpg|A Mysorean soldier from India, using his Mysorean rocket as a flagstaff (Robert Home, 1793/4)."]}, {"page": "Robert Hunter (painter)", "response": ["His portraits were excellent likenesses, if not of the first rank in painting. He had an extensive practice until the arrival of Robert Home in 1783, who attracted Hunter's prime business. Hunter contributed frequently to the Dublin Society of Artists after helping to found it. Many of his portraits were engraved in mezzotint, including John, lord Naas (by W. Dickinson), Simon, earl Harcourt, now at Nuneham Park (by E. Fisher), Dr. Samuel Madden (by R. Purcell), John Wesley, painted in Dublin (by James Watson), and others.", "He contributed six works, including a \"Susanna and the Elders,\" to the exhibition of the Society of Artists in George's Lane in 1765, and was then living in Bolton Street. In 1766 he was in Stephen Street, and from 1769 at 16 Stafford Street. He regularly contributed to the exhibitions of the Dublin Artists down to 1777, and again, for the last time, in 1800. He was employed by the Corporation of Dublin in 1788 to repair a portrait of Charles II. Hunter was for many years at the head of his profession as a portrait painter and had a large and profitable practice; but after the arrival of Robert Home in 1780 his vogue declined. He held an exhibition and sale of his pictures in 1792. He was living in 1803, but the date of his death has not been ascertained. In Carey's \"Memoirs\" he is described as \"a walking chronicle of everything relative to the Irish artists and arts and was intimate with Madden and Prior.\" \"Sleator's Gazetteer\" for 12 March 1763, contains verses on the merits of Hunter as a portrait painter. After lauding his great genius and matchless merits the writer concludes with the lines:"]}, {"page": "Siege of Bangalore", "response": ["The Fort Cemetery, where the officers who fell in the Siege of Bangalore were buried, is illustrated in Robert Home's book, Select Views in Mysore, the country of Tippoo Sultan, published by Robert Bowyer, London, 1794. Home's painting shows the graves of Captains James Smith, James Williamson, John Shipper, Nathaniel Daws and Jeremiah Delany, Lieutenant Conan and Lieutenant-Colonel Gratton. As recorded in 1895, The cemetery was located just outside the Fort Church, with the church being responsible for its maintenance. The cemetery had cypress trees, rose bushes and flowers. The Government of Mysore, had constructed a wall and gate for the cemetery.", "The siege of Bangalore, resulted in a number of sketches by artists such as James Hunter, Thomas Daniell, William Daniell, Robert Home, etc. These sketches provide a detailed record of the landscape around the Bangalore Fort at that period.", "File:View of the burial ground at Bangalore.jpg|View of the burial ground at Bangalore, with Officers who fell in the Battle for Bangalore - Select Views in Mysore, the country of Tippoo Sultan by Robert Home (1752-1834)", "File:North view of Bangalore from the pettah, shewing the curtain and bastions that were breached.jpg|North view of Bangalore from the pettah, (View from the around the present Avenue Road, facing Fort) shewing the curtain and bastions that were breached, by Robert Home (1752-1834)", "File:View of the Pettah Gateway where Colonel Morehouse (Moorehouse) fell (Robert Home, 1792).jpg|View of the Pettah Gateway where Colonel Morehouse (Moorehouse) fell (Robert Home, 1792)", "File:South View of Bangalore.jpg|View of Bangalore Fort, from the Kempegowda South Tower. South view of Bangalore with the fortress in the distance by Robert Home (1752-1834) in 1792", "File:Plan of Bangalore (with the Attacks) taken by the English Army under the Command of the Rt. Honble. Earl Cornwallis KG etc. etc. etc. March 22nd 1791..jpg|Ink wash of a plan of Bangalore by Robert Home (1752-1834) in 1791. Plan of Bangalore (with the Attacks) taken by the English Army under the Command of the Rt. Honble. Earl Cornwallis KG etc. March 22, 1791. Part of 22 drawings along with a map and three plans completed by Home, whilst accompanying the British army under Cornwallis during the 3rd Mysore War 1791-1792", "File:View of the inside gate at Bangalore with the guard room.jpg|View of the inside gate at Bangalore with the guard room, by James Fittler (1758-1835) after sketches of Robert Home (1752-1834)"]}, {"page": "Siege of Seringapatam (1792)", "response": ["Although fire ceased on 24 February, peace was not formally agreed until 18 March, when Tipu agreed to the severe terms of the Treaty of Seringapatam.  Cornwallis made a preliminary demand that Tipu surrender two of his sons as hostages of war to guarantee Tipu's performance.  On 26 February, in a ceremony immortalized in art by Robert Home, who accompanied Cornwallis on the expedition, Tipu's sons, aged seven and eleven, were delivered with great pomp and circumstance to Cornwallis' care.Wickwire, p. 170"]}, {"page": "Cornwallis in India", "response": ["One of the largest issues confronting Cornwallis in managing the army was its diversity.  In addition to British Army and East India Company European forces, there were German troops from Hanover, and a large number of native sepoys from a diversity of cultural backgrounds, speaking different languages and having varied religious and dietary requirements. To meet the needs of this patchwork of forces, the army was followed by a number of camp followers that was unusually large by comparison to typical European or North American armies, further increasing the need for reliable supply.  The army he took over from General Medows had 15,000 troops and 60,000 camp followers. He permitted the artist Robert Home to accompany the army on its campaign; the resulting artwork is one of the legacies of the campaign."]}, {"page": "Home (surname)", "response": ["* Robert Home (1752–1834), British painter"]}, {"page": "Home, Robert", "response": ["#redirectRobert Home"]}]}}