{"wiki_id": "http://www.wikidata.org/entity/Q7349047", "itemLabel": "Robert Prizeman", "itemDescription": "English composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Prizeman", "wikipedia_page": {"main": "Robert Gordon Prizeman (28 February 1952 – 8 September 2021) was a British composer. He was born in the London Borough of Lambeth. He attended the Royal College of Music in South Kensington. Prizeman studied organ with Timothy Farrell and John Birch, and harpsichord with Millicent Silver.\nIn 1986 he composed the theme to Songs of Praise, which was published by Chester Music and Wilhelm Hansen, and from 1985 was the programme's musical director. The programme's theme was initially an organ composition.\nHe worked as a choirmaster from 1970. In 1984 his choir performed with Sal Solo in his arrangement. He founded the successful boys choir Libera in 1995, which is based in south London and records for EMI Classics. In 2010 he became an Associate of the Royal School of Church Music. He died on 8 September 2021.", "link_mentions": [{"page": "Norbury", "response": ["* Robert Prizeman (1952–), composer"]}, {"page": "Libera (choir)", "response": ["Libera is an all-boy English vocal group founded by the late Robert Prizeman. Libera performs concerts in many countries, including the UK, the US and throughout Asia, and often makes recordings for their own album releases and other projects.", "In 1999, Robert Prizeman released a single and a CD, Libera. The CD contained seven remixes of his original song, \"Libera\". The first four tracks feature Libera with Daren Geraghty as the main soloist; the last 3 tracks are performed by other artists. In the same year, the choir, calling itself Libera, performed the song on the TV programme Sunday Live. In 1999, the choir released another album entitled Libera, published by Warner Classics. From that point on, the choir has been consistently referred to as \"Libera\" when acting in its commercial capacity. The next Libera album, Luminosa, was released by Warner Classics in 2001. In 2003, Warner Classics re-released Libera and Luminosa as a two CD set entitled Complete Libera. Ever since 2004, Libera has been under contract with EMI. Their first EMI album was Free. Visions came out in 2005. Libera's 2006 album, Angel Voices, was nominated as Album of the Year by the Classical Brit Awards. New Dawn was released in March 2008. In December 2008, they released their first double CD entitled Eternal (The best of Libera) which contains 26 tracks taken from earlier albums and six new tracks. Their album Peace was released in 2010. November 2011 saw the release of Libera: The Christmas Album.", "Libera has a distinctive sound. All of its singers are boys, most with unchanged boy soprano (also known as treble) voices, with those boys in their early teens singing the lowest parts. Almost all their songs are either new compositions by Robert Prizeman or new arrangements of classical and contemporary tunes. Prizeman often composed and arranged pieces with individual soloists in mind, to emphasize the variety of characteristics and qualities in the boys' voices. His compositions blended innovative textures, meditative soloists and vibrant ecstatic chorus harmonies that stretch across the full range of the boys' range. Libera's music frequently combines elements of Gregorian chant, classical composers such as Debussy, Beethoven and Pachelbel, as well as contemporary pop and new age music. Some of their songs, such as \"Sanctus\", have appeared in different versions on several of their albums. Some more contemporary songs have been covered by the group, such as Enya's Orinoco Flow.", "Most of Libera's lyrics come from traditional hymns, the Latin Rite liturgy, and contemporary songs by artists ranging from Brian Wilson and Billy Joel to Enya. However, lyrics from various poems and original lyrics are also used. For example, We are the Lost uses the poems \"In Flanders Fields\" by John McCrae and \"For the Fallen\" by Laurence Binyon, along with a single stanza from the English hymn, \"O God, Our Help in Ages Past\" by Isaac Watts. While most of the Libera's original lyrics are written by Robert Prizeman, other individuals, including former Libera soloist Steven Geraghty, have also contributed new lyrics to recent albums.", "Libera uses a variety of instrumentation. Robert Prizeman, Ian Tilley and Steven Geraghty play electronic keyboards, piano and organ. Steven Geraghty also played clarinet for Free, Visions and Angel Voices, and percussion for Visions and Angel Voices. All of their EMI albums feature Fiona Pears on the violin. Angel Voices: Libera in Concert has additional backing by Il Novecento Orchestra. The City of Prague Philharmonic Orchestra provides backing to their New Dawn album.", "* Libera (1999), featuring Liam O'Kane, Adam Harris, Steven Geraghty, Alex Baron as vocal soloists. No instrumentalists are credited on the album, however Robert Prizeman did the keyboard work.", "* Free (2004), featuring Ben Crawley, Joseph Platt, Christopher Robson, Anthony Chadney and Raoul Neumann as vocal soloists, and Robert Prizeman, Fiona Pears, Dominic Kelly, Steven Geraghty, Chris Dodd, Ian Tilley and Helen Cole as instrumentalists. ", "* Visions (2005), featuring Tom Cully, Conor O'Donnell, Michael Horncastle, Joseph Sanders-Wilde, Callum Payne, James Vereycken as vocal soloists and Robert Prizeman as director, conductor and instrumentalist. Other instrumentalists included Ian Tilley, Fiona Pears, John Anderson, Steven Geraghty and Chris Dodd.", "* Welcome to Libera's World (2006), featuring Joseph Platt, Ben Crawley, Liam O'Kane, Michael Horncastle and Joseph Sanders-Wilde as vocal soloists, and Robert Prizeman, Fiona Pears, John Anderson, Steven Geraghty, Chris Dodd, Ian Tilley as instrumentalists. The album was released only in Japan. Most of the tracks are re-released from the earlier albums. It includes only one new track, \"Far Away\".", "* Angel Voices (2006), featuring Michael Horncastle, Ed Day, Connor O'Donnell, Tom Cully, Joshua Madine, Joseph Platt, Christopher Robson, Anthony Chadney, Joseph Sanders-Wilde and James Vereycken as vocal soloists, and Robert Prizeman, Fiona Pears, John Anderson, Steven Geraghty, Chris Dodd and Ian Tilley on various instruments.", "* Angel Voices: Libera in Concert (2007), featuring Joshua Madine, Ben Philipp, Tom Cully, Ed Day, Liam Connery, Sam Leggett and Joe Snelling as vocal soloists, and Robert Prizeman, Fiona Pears, Steven Geraghty, Il Novecento Orchestra as instrumentalists.", "* New Dawn (2008), featuring Tom Cully, Joshua Madine, Ed Day, Liam Connery, Joe Snelling and Benedict Philipp as vocal soloists. Robert Prizeman, Fiona Pears, Ian Tilley, Steven Geraghty, Sam Coates and the City of Prague Philharmonic Orchestra filled instrumental roles."]}, {"page": "Peace (Libera album)", "response": ["*Directed and conducted by Robert Prizeman", "*Produced by Ian Tilley, Robert Prizeman and Sam Coates", "*Musicians: Robert Prizeman, Ian Tilley, Steven Geraghty, Fiona Pears, Jonathan Howell", "*Directed and conducted by Robert Prizeman", "*Produced by Ian Tilley, Robert Prizeman and Sam Coates", "*Musicians: Robert Prizeman, Ian Tilley, Steven Geraghty, Fiona Pears, Jonathan Howell"]}, {"page": "List of people from the London Borough of Merton", "response": ["*Robert Prizeman – classical crossover music composer; choirmaster of Libera and St Phillip's Parish Church, Norbury; composed the BBC's Songs of Praise signature music"]}, {"page": "Libera discography", "response": ["Libera is an all-boy English vocal group directed by Robert Prizeman. Their discography consists of 13 studio albums, three live albums, ten compilation albums, three video albums, an extended play, and six singles. Their early works were released under the names St. Philip's Choir and Angel Voices."]}, {"page": "Prizeman, Robert", "response": ["#redirectRobert Prizeman"]}, {"page": "Deaths in September 2021", "response": ["*Robert Prizeman, 68, British composer.Robert Prizeman RIP"]}]}}