{"wiki_id": "http://www.wikidata.org/entity/Q7346104", "itemLabel": "Robert Jobling", "itemDescription": "British artist (1841-1923)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Jobling", "wikipedia_page": {"main": "Robert Jobling (1841–1923) was a British artist. He first had work accepted by both the Royal Academy and Royal Society of British Artists in 1883. He painted regularly at  the fishing village of Cullercoats and later at Staithes. He attained a position of some standing in the Staithes group. His main artistic exposure was in exhibitions in the north of England.Jobling lived in Whitley Bay (near Cullercoats) and was a prominent member of the Cullercoats artist colony, along with Henry Emmerson, and various other artists including Winslow Homer. In 1890, the Newcastle Daily Journal wrote, \"Mr. Jobling has made Cullercoats famous for his canvases, and by-the-by he will be famous for over-running the village with tourists.\"", "link_mentions": [{"page": "North Shields", "response": ["*Robert Jobling – artist"]}, {"page": "Cullercoats", "response": ["Homer was the most famous of the professional artists who were part of  the \"Cullercoats Colony\" in the period 1870–1920. Others included Henry H. Emmerson, Robert Jobling, Arthur H. Marsh, Isa Thompson, John Falconer Slater and John Charlton and visitors like Ralph Hedley."]}, {"page": "Ralph Hedley", "response": ["After concluding his apprenticeship, Hedley established a successful woodcarving business, whilst also producing lithographs for the local press and taking every opportunity to work as an artist.  He had the first of many paintings, The Newsboy, accepted for exhibition at the Royal Academy in 1879.  Joining with Henry Hetherington Emmerson and Robert Jobling, they founded the Bewick Club which encouraged and exhibited the work of the local artists of the North East, staging the first exhibition in 1884.Artist Biographies- Bewick Club www.artbiogs.co.uk, accessed 16 December 2019"]}, {"page": "Hatton Gallery", "response": ["Other important artists represented in the collection include Francis Bacon, Victor Pasmore, William Roberts and Paolo di Giovanni, Palma Giovane, Richard Hamilton, Panayiotis Kalorkoti, Thomas Bewick, Eduardo Paolozzi, Camillo Procaccini, Patrick Heron and Richard Ansdell. Watercolours by Wyndham Lewis, Thomas Harrison Hair and Robert Jobling are also held."]}, {"page": "Staithes group", "response": ["*Robert Jobling (1841–1923)"]}, {"page": "Jopling", "response": ["* Robert Jobling (1841–1923), British artist"]}, {"page": "Henry Hetherington Emmerson", "response": ["Upon his return to northern England, he lived in Ebchester and met his soon-to-be wife. Emmerson was a founding member and first president of the Bewick Club, a Newcastle association of painters and illustrators that also included among its founders the likes of Robert Jobling, Ralph Hedley, John Surtees, and Thomas Dickinson. Notable paintings of Emmerson, some of which hung in the Royal Academy, include The Queen's Letter, The Critics, The First Suit, and The Foreign Invasion. His paintings of children were numerous and well known, with several being reproduced and popularised as engravings. A total of 58 works by Emmerson were exhibited at the Royal Academy during his lifetime."]}, {"page": "Jobling, Robert", "response": ["#redirectRobert Jobling"]}, {"page": "Jobling", "response": ["*Robert Jobling (1841–1923), British artist"]}]}}