{"wiki_id": "http://www.wikidata.org/entity/Q7347731", "itemLabel": "Robert Moberly", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Moberly_(bishop)", "wikipedia_page": {"main": "Robert Hamilton Moberly was the 7th Anglican Bishop of Stepney from 1936 until 1952 when he was appointed Dean of Salisbury.He was born into an eminent ecclesiastical family in 1884 and educated at Winchester College and New College, Oxford before embarking on an ecclesiastical career with a Curacy at Dover.  During the Great War, he served from June, 1917, as a Temporary Chaplain to the Forces, and was regarded as ‘A1’. Inner city posts followed before promotion to the Suffragan Bishopric of Stepney, a post he held until transferring to the Deanery at Salisbury sixteen years later. A brilliant scholar he died in 1978.", "link_mentions": [{"page": "Bishop of Stepney", "response": ["| 60px Robert Moberly"]}, {"page": "Dean of Salisbury", "response": ["*1952–1960 Robert Moberly"]}, {"page": "John Eastaugh", "response": ["He was born on 11 March 1920 and educated at the University of Leeds and  ordained in 1944. He was made a deacon on Trinity Sunday 1944 (4 June) by Geoffrey Fisher, Bishop of London, and ordained a priest the next Michaelmas (23 September 1945) by Robert Moberly, Bishop of Stepney — both times at St Paul's Cathedral. He began his career with a curacy at All Saints' PoplarParish website and then held incumbencies at Hackney and Heston before being collated Archdeacon of Middlesex in 1966.Crockford's clerical directory1976 Lambeth, Church House,  Having been elected and confirmed Bishop of Hereford during December 1973/January 1974,New Bishop of Hereford The Times Tuesday, Feb 27, 1973; pg. 16; Issue 58718; col E he was ordained to the episcopate by Michael Ramsey, Archbishop of Canterbury, at Westminster Abbey on 24 January 1974, serving until he died in post 17 years later on 16 February 1990, aged 69."]}]}}