{"wiki_id": "http://www.wikidata.org/entity/Q7344098", "itemLabel": "Robert Entwistle", "itemDescription": "English cricketer (1941-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Entwistle", "wikipedia_page": {"main": "Robert Entwistle (20 October 1941 – 11 July 2019) was an English cricketer. Entwistle was a right-handed batsman. He was born in Burnley, Lancashire.Entwistle made his first-class debut for Lancashire against Gloucestershire in the 1962 County Championship. He made 47 further first-class appearances for the county, the last of which came against Yorkshire in the 1966 County Championship. In these matches he scored a total of 1,554 runs at an average of 20.72, with a highest score of 85 against the Marylebone Cricket Club in 1964.His List A debut came against Leicestershire in the Preliminary round of the 1963 Gillette Cup, which was the first ever List A match to be played. Opening the batting, he was the first person to be dismissed in List A cricket, hit wicket to Rodney Pratt for 18. He made eight further List A appearances for Lancashire, the last of which came against Middlesex in the 1966 Gillette Cup. In his nine List A matches for the county, he scored 150 runs at an average of 25.00, with a high score of 48. He left Lancashire at the end of the 1966 season.\nIn 1967, Entwistle joined Cumberland, making his debut for the county in the Minor Counties Championship against Durham. He played Minor counties cricket for Cumberland from 1967 to 1984, making 91 Minor Counties Championship and two MCCA Knockout Trophy appearances. During this time he also made a single first-class appearance for the Minor Counties against the touring West Indians in 1976, scoring 8 runs in the Minor Counties first-innings before being dismissed by John Holder, while in their second-innings he scored exactly 50 runs before being dismissed by Albert Padmore. He also made a single List A appearance for Cumberland, which came in the 1984 NatWest Trophy against Derbyshire. In a match which Cumberland lost by 9 wickets, Entwistle was dismissed for a duck by Roger Finney.He played as a professional for four Northern Cricket League teams from 1967 to 1986: Netherfield, Fleetwood, Darwen and St Annes. He scored 15,674 runs in all at an average of 51.13.\n\n", "link_mentions": [{"page": "List of Cumberland County Cricket Club List A players", "response": ["* Robert Entwistle, 1 match, 1984"]}, {"page": "Entwistle (surname)", "response": ["* Robert Entwistle (1941–2019), English cricketer"]}, {"page": "Darwen Cricket Club", "response": ["*Robert Entwistle."]}, {"page": "2019 in the United Kingdom", "response": ["**Robert Entwistle, 77, English cricketer (Minor Counties, Cumberland, Lancashire)."]}, {"page": "Deaths in July 2019", "response": ["*Robert Entwistle, 77, English cricketer (Minor Counties, Cumberland, Lancashire).Bob Entwistle"]}, {"page": "Bob Entwistle", "response": ["#REDIRECTRobert Entwistle"]}, {"page": "Entwistle, Robert", "response": ["#redirectRobert Entwistle"]}]}}