{"wiki_id": "http://www.wikidata.org/entity/Q7345204", "itemLabel": "Robert Hamilton", "itemDescription": "Irish footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Hamilton_(Irish_footballer)", "wikipedia_page": {"main": "Robert \"Bud\" Templeton Hamilton (11 November 1903 – 7 February 1964) was an Irish professional footballer.\nHamilton started his career with his hometown club, Newry Town. He then moved to Scotland with Rangers, where he was a member of their 1929–30 'clean-sweep' team which claimed the Scottish Football League championship, Scottish Cup, Glasgow Cup and Charity Cup. He had already won the double in 1927–28 and the league title in 1928–29 (losing in the 1929 Scottish Cup Final), and claimed one further championship medal in 1930–31.He left Ibrox in February 1933 to sign for English Division Two side, Bradford City. In two seasons at Valley Parade he made 26 appearances before moving north of the border again to join Third Lanark (taking part in the 1936 Scottish Cup Final, a defeat to former employers Rangers), and later moved to Morton before returning to Northern Ireland with Bangor.Whilst with Rangers, Hamilton added five Ireland caps to the Inter-League honour he had won while with Newry Town just before moving to Glasgow. He tasted victory just once, on his debut against Scotland in February 1928.", "link_mentions": [{"page": "Robert Hamilton", "response": ["Robert Hamilton may refer to:", "* Robert Hamilton (congressman) (1809–1878), U.S. Representative from New Jersey", "* Robert Hamilton (judge) (1753–1809), judge and political figure in Upper Canada", "* Robert Hamilton (merchant) (1787–1856), political figure in Upper Canada", "* Robert Hamilton (Northwest Territories politician) (1842–1911), Canadian politician", "* Robert Hamilton (Liberal politician) (1867–1944), Scottish Member of Parliament for Orkney and Shetland", "* Robert Hamilton, 8th Lord Belhaven and Stenton (1793–1868), Scottish peer", "* Robert Hamilton-Udny, 11th Lord Belhaven and Stenton (1871–1950), Scottish representative peer and soldier", "* Robert Hamilton, 12th Lord Belhaven and Stenton (1903–1961), Scottish peer", "* Robert Hamilton (civil servant) (1836–1895), Australian politician, governor of Tasmania", "* Robert Hamilton of Preston (1650–1701), one of the leaders of the Scottish Covenanters", "* Robert Hamilton (moderator) (1707–1787), twice Moderator of the General Assembly of the Church of Scotland", "* Robert Hamilton (priest) (1853–1928), Dean of Armagh", "* Robert Hamilton (Scottish footballer) (1877–1948), Scottish footballer often known as R.C. Hamilton", "* Robert Hamilton (Irish footballer) (1907–1964), Northern Irish footballer who played for Rangers F.C.", "* Robert Hamilton (Norwegian governor) (died 1677), Scottish born, Norwegian military officer and governor", "* Robert Hamilton (economist) (1743–1829), Scottish economist and mathematician", "* Robert Hamilton (advocate) (1763–1831), Scottish advocate and friend of Sir Walter Scott", "* Robert Hamilton (archaeologist) (1905–1995), British archaeologist and academic", "* Robert Hamilton (surgeon) (died c. 1832), president of the Royal College of Surgeons in Ireland"]}, {"page": "Fred Wallbanks", "response": ["His performances earned him a return to the Football League with Bradford City. He rarely appeared for his first two seasons with the Second Division side, where he was converted to play at left back. In \"an effort to strengthen the defence\", Wallbanks came into the side at left back in place of Robert Hamilton for the third match of the 1934–35 season. Bradford City won, and he retained the position for a couple of months, until Charlie McDermott was preferred. Wallbanks signed for another Second Division club, West Ham United, in December 1934. but played only once, standing in at right half as West Ham were eliminated from the 1934–35 FA Cup by Stockport County, before moving on to Nottingham Forest at the end of the season. Although he had a run of six matches early in the season, he played only twice for the first team thereafter, and was transfer-listed at the end of the season. He spent the 1936–37 season with Northampton Town of the Third Division South, but appeared only once, in the Third Division South Cup."]}]}}