{"wiki_id": "http://www.wikidata.org/entity/Q7345276", "itemLabel": "Robert Harrild", "itemDescription": "printer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Harrild", "wikipedia_page": {"main": "Robert Harrild  (1 January 1780 – 28 July 1853) was an English printing pioneer. Harrild was the founder of the business Harrild & Sons, his history is recorded in 'The House of Harrild' by Edward Liveing written in 1949, which gives the complete history of the Company, and also many names and dates of Harrilds.\n\n", "link_mentions": [{"page": "Richard Jefferies", "response": ["Jefferies spent several of his earlier years, between the ages of four and nine, with his aunt and uncle, the Harrilds, in Sydenham, where he attended a private school, returning to Coate in the holidays.Besant (1905), 27–8; Thomas (1909), 39; Rossabi (2004). His uncle, Thomas Harrild, was a son of the printing innovator Robert Harrild. Jefferies kept a close friendship with Mrs. Ellen Harrild (nee Gyde) and his letters to her are an important source for biographers. At Coate, he spent most of his time in the countryside; and much of what he narrates of Bevis is true of himself. His father had taken him shooting when he was eight; and already at nine he had shot a rabbit. He was soon spending much of his time hunting (both with a gun and with snares) and fishing.Thomas (1909), 39; 41–2; Looker and Porteous (1965), 16. He also, like Bevis, added home-made rigging to a boat to sail on the reservoir; and he is said to have built his own canoe, like the hero of After London.Besant (1905), 29–30; Thomas (1909), 40. At the same time, he became a keen reader: favourite books included Homer's Odyssey, Percy's Reliques, Don Quixote and James Fenimore Cooper's The Pathfinder, which served as a model for mock battles fought on a field between the farm and the reservoir.Thomas (1909), 45–6."]}, {"page": "St Antholin, Budge Row", "response": ["In 1829, the upper part of the spire was replaced and the portion removed, with its dragon's head weathervane, was sold for £5 to Robert Harrild, a printer, who had it erected on his property, Round Hill House in Sydenham, now London SE26. It remains there today, now surrounded by modern  houses."]}, {"page": "George Baxter (printer)", "response": ["Baxter was born in 1804 in Lewes, Sussex, and was the second son of John Baxter, a printer. At 20, Baxter was illustrating books printed by his father; at 23, Baxter moved to London to be apprenticed to Samuel Williams, a wood engraver. In 1827, Baxter set up his own business and married Mary Harrild, daughter of Robert Harrild, a printing engineer and a friend of Baxter's father. Baxter now began to experiment with his own methods of colour printing – his first known colour print, Butterflies, was published in 1829.Etheridge 1929: 17–18 Baxter's experiments first bore commercial fruit in 1834, with two small vignettes published in Mudie's \"British Birds\".Lycett, p 6."]}, {"page": "Gothic bluebooks", "response": ["Important publishers of gothic bluebooks, who often referred to the works as \"pamphlets\", included Thomas Tegg, Dean and Munday, Robert Harrild, and John Aliss, who each had distribution networks throughout Britain. If a bluebook story was not long enough to fill the allotted page length, publishers had versions of shorter stories on hand that they would attach to the end. One story that was commonly attached was \"Mary, A Fragment\",Print. which was just one page long. Gothic bluebooks remained a popular trade through the first decade of the 19th century."]}, {"page": "Robert harrild", "response": ["#REDIRECT Robert Harrild "]}, {"page": "Composition roller", "response": ["Eventually, a substance was found with the right adhesion and elasticity to make suitable cylindrical rollers. Composition for use in inking was developed in England in the 1810s by Robert Harrild and another individual named Forster; they first used it for making ink balls, though they soon turned to making rollers. Bryan Donkin was the first to apply the composition roller to machine press. By 1826, they had begun to be introduced to the United States."]}, {"page": "Harrild & Sons", "response": ["Harrild & Sons Limited is a defunct British manufacturer of printing machinery and supplies. The company was founded in 1809 by Robert Harrild at Norwich Street, London, and closed down in 1949. The company helped to establish the use in London of composition rollers instead of ink balls to ink the printing plates.", "Robert Harrild established the company Harrild & Sons Limited in 1809 in Farringdon, London. The company used to manufacture printing presses for letterpress printing. The company started manufacturing presses with ink balls (since the printing presses then used ink balls rather than composition rollers to ink the plates). In 1813, Harrild joined the discussion within the London printing community and talked about use of \"composition rollers\" instead of \"ink balls\" to ink the printing plates. The majority of hand printers preferred use of ink balls over composition rollers but after successful demonstration of Harrilds composition roller, every printer in London started using the composition roller. To manufacture the rollers, Harrild established another company at 25 Farringdon Street in London. Harrild & Sons eventually started manufacturing all kinds of printing equipment.", "After his death in 1853, the company was operated by Robert Harrild's sons until it ceased operations in 1949."]}, {"page": "Harrild", "response": ["* Robert Harrild, printing pioneer"]}, {"page": "Harrild, Robert", "response": ["#redirectRobert Harrild"]}]}}