{"wiki_id": "http://www.wikidata.org/entity/Q7357974", "itemLabel": "Roger Chase", "itemDescription": "British violinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Chase", "wikipedia_page": {"main": "Roger Chase (born in London in 1953) is a British violist who currently teaches at the Chicago College of Performing Arts at Roosevelt University.", "link_mentions": [{"page": "Lionel Tertis", "response": ["He owned a 1717 Montagnana from 1920 to 1937 which he found during one of his concert tours to Paris in 1920, and took a chance in acquiring. According to his memoirs, it was \"shown to me in an unplayable condition, without bridge, strings or fingerboard.... No case was available – it was such a large instrument 17 1/8 inches – so my wife came to the rescue by wrapping it in her waterproof coat, and that is how it was taken across the English Channel.\" Tertis preferred a large viola to get an especially rich tone from his instrument. Knowing that some would find a 17-1/8-inch instrument too large he created his own Tertis model, which provides many of the tonal advantages of the larger instrument in a manageable 16-3/4-inch size. Tertis sold the 1717 Montegnana to his pupil Bernard Shore in 1937, who in turn passed it on to his pupil Roger Chase. ", "In February 2007 Roger Chase, along with his accompanist, pianist Michiko Otaki), initiated \"The Tertis Project,\" a series of concerts devoted to works composed for Tertis.Roger Chase: The Tertis Project  A CD, The Tertis Tradition, was issued in 2009.Dutton CDLX7231"]}, {"page": "List of violists", "response": ["* Roger Chase (b. 1953)"]}, {"page": "Homogenic", "response": ["** Roger Chase, Hrund Hardardottir, Bill Hawkes, Peter Lale, George Robertson, Moeidur Anna Sigurdardottir – violas"]}, {"page": "Penguin Cafe Orchestra", "response": ["* Roger Chase – viola"]}, {"page": "Madeleine Mitchell", "response": ["Mitchell was one of the artists representing Britain in both the festival UKinNY with a recital at Lincoln Center \"https://web.archive.org/web/20011003142639/http://www.nypl.org/press/lpaprograms10-01.html\" and for the centenary of Entente Cordiale with France. She has given recitals at Sydney Opera House (17.3.89), Seoul Center for the Arts (13.4.89) and Hong Kong (18.4.89) as part of a three month tour with the pianist Klaus Zoll under the auspices of the British Council and the Goethe Institute. Mitchell has played at many international and most of the major British festivals and frequently performs in London. She was leader of the Bridge String Quartet 2000-2007. She was invited by Norbert Brainin to perform with him for his 80th birthday concert at Wigmore Hall in 2003.\"https://www.independent.co.uk/arts-entertainment/music/reviews/monica-huggett-norbert-brainin-friends-wigmore-hall-london-107368.html\" Mitchell performed a solo recital at the Wigmore Hall in March 2015 accompanied by Nigel Clayton.\"https://wigmore-hall.org.uk/whats-on/bridge-elgar-and-macmillan-201503191300\" Lisa Peacock Presents Thursday Lunchtime Showcases; accessed 12 June 2016 Other artists with whom she has collaborated include Paul Watkins, Joanna MacGregor, Craig Ogden and Roger Chase. Her recitals have frequently been broadcast by BBC, S4C, ABC and Bayerischer Rundfunk.\"https://www.lizwebb.org.uk/madeleine-mitchell\"", "*Roger Chase"]}, {"page": "Roger chase", "response": ["#REDIRECT Roger Chase "]}, {"page": "Nash Ensemble", "response": ["* Roger Chase (viola)"]}, {"page": "Stanley Bate", "response": ["That same year a recording of the Viola Concerto (1944-6) by Roger Chase and the BBC Concert Orchestra conducted by Stephen Bell helped spark a modern revival of interest.Dutton Vocalion CDLX 7216, Duttonvocalion.co.uk This intensively lyrical work also immediately brings to mind the music of Vaughan Williams, to whom it is dedicated. Recordings of the Symphony No 4 (1954–55)Dutton Vocalion CDLX 7255, Duttonvocalion.co.uk followed in 2011, and the Third Piano Concerto (1938) and Sinfonietta No 1 (1940) in 2012.Stanley Bate & Franz Reizenstein: Piano Concertos, Dutton Vocalion CDLX 7282, Duttonvocalion.co.uk A recording of the Cello Concerto (1954) was issued by Lyrita in 2015.Cello Concerto, reviewed by MusicWeb International"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Roger Chase (violist)"]}, {"page": "Quartet San Francisco", "response": ["Keith Lawrence, member from March 2008 to 2012, began learning viola in Pittsburgh, Pennsylvania, at the age of 11, then pursued undergraduate study at Oberlin Conservatory, taking instruction from Peter Slowik and Roger Chase. He attended the Henry Mancini Institute three years during his time at Oberlin. Until 2007, he studied at the DePaul University School of Music with Rami Solomonow.Keith Lawrence, viola.  Biographies, Quartet San Francisco. Accessed on February 12, 2010."]}, {"page": "Gwendolyn Masin", "response": ["In chamber music, she has had concerts with notable violinists (Philippe Graffin, Jan Talich, Maxim Vengerov...), violists (Guy Ben-Ziony, Gérard Caussé, Isabel Charisius and Roger Chase), cellists (Adrian Brendel, Alexander Baillie, Gavriel Lipkind, Martti Rousi, Alexander Rudin...), pianists Kit Armstrong, Julia Bartha, Finghin Collins, Peter Frankl, György Sebök...), conductors (Janos Fürst and Gerhard Markson), wind instrumentalists (Reto Bieri and Kaspar Zehnder), soprano (Rachel Harnisch), and the actor Hanns Zischler. The pianist Simon Bucher has performed regularly with her since 1997."]}, {"page": "Cyril Huvé", "response": ["* Schubert's Trout Quintet - Hummel's  Quintet Op. 87. Erard pianoforte 1822, with the Hausmusik Ensemble: Monica Huggett (violin), Roger Chase (viola) Richard Lester (cello), Chi-chi Nwanoku (doublebasse) (EMI 1991, reissued by Virgin Classics)"]}, {"page": "Bernard Shore", "response": ["By 1937 Tertis was finding he could no longer play to the standards he set himself, so he sold his beloved 1717 Montagnana viola to Shore.Tertis, Lionel. My Viola and I, a Complete Autobiography, 1974 Shore eventually passed the viola on to his own pupil, Roger Chase.Strauss, Elaine. A Little Respect to the Once Neglected Viola (2007)", "In 1937 Shore wrote a book, The Orchestra Speaks,Shore, 1944 which arose out of his experience of orchestral playing. It discusses the inner workings of an orchestra and also includes a collection of character sketches of conductors of the time, including Thomas Beecham, Adrian Boult, Malcolm Sargent, Henry Wood, Eugene Goossens and Hamilton Harty. In 1947 he wrote a second book, Sixteen Symphonies,Shore, 1949 discussing symphonies from  Haydn to Walton. Shore was also an occasional composer of songs and instrumental pieces. His 1933 Scherzo for viola, published in 1933, has been recorded by Roger Chase.The Virtuoso Viola, Naxos 8.572293 (2010), reviewed by MusicWeb International"]}, {"page": "Union Cafe", "response": ["*Roger Chase – Soloist, Viola"]}]}}