{"wiki_id": "http://www.wikidata.org/entity/Q7358697", "itemLabel": "Roger Munby", "itemDescription": "English football executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Munby", "wikipedia_page": {"main": "Roger Munby is a British businessman and former chairman of Norwich City Football Club.", "link_mentions": [{"page": "Steve Foley (footballer, born 1953)", "response": ["He joined Norwich City in 1996, appointed by manager Mike Walker, who had worked with Foley at Colchester, and had spent ten years with the club in various roles when his coaching contract was terminated with immediate effect in May 2006. Chairman Roger Munby said that, although Foley's input had been \"invaluable\", it was time to \"freshen up the coaching set-up\", though the press suggested that Foley was being made the scapegoat for the team's poor performance during the 2005–06 season. Foley then joined the coaching staff at Norwich City's arch rivals Ipswich Town."]}, {"page": "Bryan Gunn", "response": ["Following the sacking of Roeder as Norwich manager in January 2009, Gunn was asked to take temporary charge of the first team. In an interview with BBC Radio Norfolk, he revealed that he \"told the players that they've let people down.\" In his first match as caretaker manager, he received \"a euphoric reception\" from the fans, and Norwich beat Barnsley 4–0. The players were equally supportive: according to Scotland on Sunday, \"in the dressing room afterwards, [Norwich] midfielder, Darel Russell, dragged the chairman, Roger Munby, into the shower, and demanded that Gunn be appointed permanently.\" Momentum gathered, and a Facebook group called \"Bryan Gunn for manager\", created by his then 17-year-old daughter, Melissa, soon attracted about 3,000 members. Gunn considered applying for the role on a longer-term basis; he had previously applied without success to be Norwich manager in 1998. On 19 January 2009 he phoned the directors and requested to be considered. He was interviewed that afternoon and \"by 10.30 am the next day had been appointed manager until the end of the season\"."]}]}}