{"wiki_id": "http://www.wikidata.org/entity/Q7352549", "itemLabel": "Robin Howard", "itemDescription": "British philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Howard", "wikipedia_page": {"main": "Robin Jared Stanley Howard CBE (17 May 1924 – 12 June 1989) was a British philanthropist, dance patron and founder of The Place who promoted modern dance in England.", "link_mentions": [{"page": "List of Old Etonians born in the 20th century", "response": ["*Robin Howard (1924–1989), philanthropist, dance patron and founder of The Place"]}, {"page": "The Place, London", "response": ["The Place is a dance and performance centre in Duke's Road near Euston in the London Borough of Camden. It is the home of London Contemporary Dance School and the Robin Howard Dance Theatre, and formerly the Richard Alston Dance Company.", "The drill hall, which had been colloquially known as \"The Artists Place\", became simply \"The Place\" when the Contemporary Ballet Trust took over the premises in 1969. In 1976 the Contemporary Ballet Trust, under the leadership of Robin Howard, acquired the freehold of the premises as well as a site in Flaxman Terrace so facilitating an extension studio block to be built. "]}, {"page": "London Contemporary Dance Theatre", "response": ["The London Contemporary Dance Theatre (LCDT) was a contemporary dance company, based at The Place, founded by Robin Howard with Robert Cohan as its Artistic Director.", "The company closed in 1994 when The Place refocused its work, creating the Richard Alston Dance Company, and developing a bigger presenting programme for the Robin Howard Dance Theatre."]}, {"page": "London Contemporary Dance School", "response": ["London Contemporary Dance School (informally LCDS) is a contemporary dance school located in London, England and a part of the Conservatoire for Dance and Drama. It was founded by Robin Howard in 1966 to train new dancers for his company, London Contemporary Dance Theatre.", "London Contemporary Dance School and its partner company, London Contemporary Dance Theatre, were founded in 1966 under the governance of the Contemporary Dance Trust. After receiving support from its founder, Robin Howard, the Contemporary Dance Trust moved to 17 Duke's Road in 1969, which it renamed The Place. In 1978, with assistance from the Arts Council and Linbury Trust, The Place underwent a major redevelopment, with new studios created for the School on Flaxman Terrace. In 1982, LCDS began offering a BA Honours degree in Contemporary Dance, validated by the University of Kent. In 1994, London Contemporary Dance Theatre was closed and the Richard Alston Dance Company formed. In October 2001 a £7.5 million redevelopment of The Place, including the construction of six new dance studios, was completed. In the same year LCDS and the Royal Academy of Dramatic Arts (RADA) formed the Conservatoire for Dance and Drama. In 2008 a £1.1 million development at The Place added two new further studios."]}, {"page": "Index of World War II articles (R)", "response": ["# Robin Howard"]}, {"page": "Gravetye Manor", "response": ["In 1958, the property and grounds were leased to business partners Robin Howard, and restaurateur Peter Herbert and his first wife Pip. Herbert was later considered a pioneer of the country house hotel, turning the property into a 17 bedroom hotel which, through use of a noted kitchen garden, gained its Michelin star. During his 40 years of ownership, Herbert also restored Robinson's core  natural gardens (which cost £50,000 per annum to maintain), with the hotel and kitchen becoming rated one of the UK's top five hotels."]}, {"page": "Queen Elizabeth II Coronation Award", "response": ["*1975 - Robin Howard"]}, {"page": "The Hero of Color City", "response": ["*Robin Howard as Tangerine/Periwinkle/Aquamarine"]}]}}