{"wiki_id": "http://www.wikidata.org/entity/Q7356739", "itemLabel": "Rodger Wylde", "itemDescription": "English footballer (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rodger_Wylde", "wikipedia_page": {"main": "Rodger Wylde, born in Sheffield, Yorkshire on 8 March 1954, is a former professional football player who played for Sheffield Wednesday, Oldham Athletic, Sporting CP, Sunderland, Barnsley and Stockport County. Wylde played as a striker, he was good in the air but had fine skill on the ground for a tall man.  In his final few years in football he took a degree in physiotherapy and is the current Physio at EFL Championship club Peterborough United\n\n", "link_mentions": [{"page": "Peterborough United F.C.", "response": ["* Physio: Rodger Wylde"]}, {"page": "List of Sheffield Wednesday F.C. seasons", "response": ["|Rodger Wylde"]}, {"page": "Wylde (surname)", "response": ["* Rodger Wylde (1954– ), English footballer"]}, {"page": "List of Oldham Athletic A.F.C. seasons", "response": ["| Div 2 || 42 || 12 || 15 || 15 || 39 || 48 || 39 || 15th || R3 || R2 || || || || Rodger Wylde || 12", "| Div 2 || 42 || 15 || 14 || 13 || 50 || 51 || 59 || 11th || R3 || R3 || || || || Rodger Wylde || 17", "| Div 2 || 42 || 14 || 19 || 9 || 64 || 47 || 61 || 7th || R3 || R2 || || || || Rodger Wylde || 19"]}, {"page": "Mick Prendergast", "response": ["Prendergast returned to first team action in February 1975 to play five games in a struggling Wednesday side that suffered relegation to Division Three for the first time in their history. He scored the club's first ever goal in Division Three in a 1–2 away defeat at Southend in August 1975 and went on to have a good season as he netted 13 goals in 39 appearances to be top scorer for the second time. In the 1976–77 campaign he was limited to five full appearances as injury and the good form of Rodger Wylde and Tommy Tynan kept him out of the team. In April 1977, after ten years service with the club, he was granted a testimonial match against Leicester City with 3,179 fans turning up to see Leicester win 3–2 with Ron Springett and Peter Swan coming out of retirement to play for Mick. Prendergast was placed on the transfer list in January 1978 as Jack Charlton, who had taken over as Wednesday manager, began a clear out of staff. In March 1978 just before the transfer window closed he signed for Barnsley for a fee of £14,000.\"One Hundred Years at Hillsborough\", Jason Dickinson,  Page 361 Gives general information and specific on testimonial details. Prendergast was recently voted as the favourite player of fans who remembered the Sheffield Wednesday teams of the mid-1970s in John Dyson's book: \"Our Lowest Ebb: A New History of Sheffield Wednesday's Darkest Times - 1973-76\"."]}, {"page": "Jim Steel (footballer)", "response": ["Steel was born in Dumfries, and raised in nearby Dalbeattie.\"Jim Steel\" He began his football career when he was signed as an apprentice by Jimmy Frizzell for Oldham Athletic. After scoring two goals against Cardiff City on his debut, he established himself in the first team as the \"Latics\" battled away in the lower half of the Second Division table in 1978–79, 1979–80, 1980–81, and 1981–82. During his time he built successful strike partnership with Simon Stainrod and Rodger Wylde. Frizzell was dismissed in early 1982 and Steel was unable to establish himself under new manager Joe Royle. Steel had loans spells with Third Division clubs Wigan Athletic (scoring two goals in his two league games under Larry Lloyd) and Wrexham (where he scored six goals from his nine league games). Steel left Boundary Park in March 1983 after making 108 league appearances and scoring 24 goals."]}, {"page": "Trust Oldham", "response": ["OASF held \"A Question of Latics\" event in March 2009 at the Playhouse 2 in Shaw. Former players Ian Wood, David Eyres, Rodger Wylde and Andy Barlow joined Inspiral Carpets guitarist Graham Lambert and Lee Hughes, who at the time was a Latics player. The event took the format of a Michael Parkinson style interview followed by A Question of Sport."]}, {"page": "Colin Gregson", "response": ["Tuesday, 30 August 1977, saw him make his debut, as a 19-year-old, in the first team during a League Cup match away at Blackpool (score 2–2). Wednesday's second goal of the match occurred after Gregson challenged Blackpool's goalkeeper who, under pressure from the challenge, dropped the ball to enable another Wednesday player to score. It was reported, \"Colin Gregson was drafted into the team in place of the injured Rodger Wylde and made a promising debut\". He went on to make his debut in the Football League, Saturday 1 October 1977 away at Portsmouth (score 2–2). However, on 5 October 1977, Len Ashurst was sacked by Wednesday, and reserve team coach, Ken Knighton, appointed as caretaker manager."]}, {"page": "2013–14 Sheffield Wednesday F.C. season", "response": ["Sheffield Wednesday's first pre-season fixtures were announced on 15 May; the club confirmed that the first pre-season game would be away to Scunthorpe United on 13 July and then the side would, like the previous season, play two pre-season fixtures in Portugal, this time against Hull City in the second game in Portugal on 20 July, while the first game in the country was later confirmed to be Sporting Braga on 16 June 2013. A day later Chesterfield were confirmed to be friendly opponents on 27 July at their ground. Scottish giants Rangers was confirmed at the end of May to be the only pre-season friendly that will be at home, with the game due to take place mid-week on 24 July. The Owls played in their first pre-season friendly on 6 July 2013 with a \"behind-closed-doors\" friendly. The game was hosted at St George's Park National Football Centre, where the team played Romanian first-tier champions Steaua București. It ended in a 1–1 draw with goals either side of the half with Miguel Llera scoring for Wednesday in the second-half. Tuesday, 9 July saw Sheffield Wednesday play in a friendly-testimonial game against Stockport County. The game was a testimonial for Rodger Wylde, whose first club was Sheffield Wednesday and his last Stockport County, between his career spanning 1972–1989. Wednesday took the lead within 43 seconds when Michail Antonio scored for the Owls, Martin Taylor scored after 12-minutes and the game was wrapped up when Chris Maguire scored a penalty at the stroke of half-time. There were no further goals in the game but ex-Wednesday players Chris Waddle and David Hirst made appearances in the last 15 minutes of the game for the Owls. Three days after this game, one of last season's loanees signed on a permanent-basis: Jérémy Hélan signed on a four-year contract, making it the longest current contract at the club. The weekend after Hélan's signing, Sheffield Wednesday faced Scunthorpe United away in a friendly. It was a first-half strike by new signing Hélan that gave the Owls a 1–0 victory in this pre-season friendly. Similarly to last season's pre-season Sheffield Wednesday flew to a training camp in Portugal, where they would play two games in just under a week. The first game was against top Portuguese side Sporting Braga, whom although were trailing by one goal thanks to a Martin Taylor's header after nineteen minutes, scored twice in the last five-minutes of the first half and then also scored in the second to win the game 3–1. Although it was Sheffield Wednesday's first loss of their pre-season it was still seen as a good workout. Wednesday's second and last game in Portugal was against newly promoted Hull City, the game was fairly even and the Owls's best chance fell after great work by Michail Antonio in the middle of the park led to a pass threading through to Jérémy Hélan, who rounded the goalkeeper and had his shot cleared off the line. Meanwhile, Hull's best chance was when they scored, though the goal was disallowed for offside. Another pre-season workout was completed, but this time finished in a goalless draw. Sheffield Wednesday returned from their trip to Portugal in the week commencing 22 July, where they prepared for their final two pre-season friendlies against Rangers and Chesterfield. The Rangers game was the only home friendly of pre-season for the Owls and Rangers brought 6,000 fans to the game, selling out the away stand at Hillsborough Stadium, just for a friendly match. Although the away support was as if the game was a competitive fixture, the match was still played like a friendly. Both sides were fairly evenly matched and when Wednesday got a corner on 12-minutes Michail Antonio's shot bounced off the ground a looped into the goal to give Sheffield Wednesday the lead. And that was the only goal of the game, giving Sheffield Wednesday their third win of pre-season. Under 24-hours after the Rangers game and Sheffield Wednesday signed their third player of the new season, European striker Atdhe Nuhiu. Nuhiu has played in the top-league of Austria for the most of his career and signed on a three-year contract on a free transfer from Rapid Wien. Two-days later and Nuhiu played in Sheffield Wednesday's final pre-season fixture, this being away to Chesterfield. Although the Owls dominated the first half, it was Chesterfield who were leading at half-time thanks to a goal from Hamza Bencherif on 29 minutes. Wednesday deservedly equalised though late in the second-half with just two-minutes of normal time as Chris Maguire scored from 20-yards. Sheffield Wednesday's pre-season was over after seven pre-season friendlies in preparation for the upcoming season, with the first game a week away against Queens Park Rangers."]}]}}