{"wiki_id": "http://www.wikidata.org/entity/Q7356419", "itemLabel": "Rod de'Ath", "itemDescription": "Welsh musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rod_de%27Ath", "wikipedia_page": {"main": "Roderick Morris Buckenham de'Ath (; 18 June 1950 – 1 August 2014) was a Welsh musician, best known for his role as drummer with Irish guitarist Rory Gallagher in the 1970s.", "link_mentions": [{"page": "June 18", "response": ["*1950 – Rod de'Ath, Welsh drummer and producer (d. 2014)"]}, {"page": "Rory Gallagher", "response": ["Gallagher admitted in several interviews that there were not any international Irish acts until Van Morrison and he, and later Phil Lynott and Thin Lizzy. The line-up which included Rod de'Ath on drums and Lou Martin on keyboards, performed together between 1973–1976. However, he eventually dropped down to just bass, guitar and drums, and his act became a power trio. Other releases from that period include Against the Grain, Calling Card, Photo-Finish, and Top Priority.", "* 1972–1978: Gerry McAvoy (bass), keyboardist Lou Martin, and drummer Rod de'Ath."]}, {"page": "Irish Tour '74", "response": ["* Rod de'Ath – drums"]}, {"page": "Tattoo (Rory Gallagher album)", "response": ["*Rod de'Ath – drums, percussion"]}, {"page": "Blueprint (Rory Gallagher album)", "response": ["For Blueprint Gallagher replaced drummer  Wilgar Campbell with Rod de'Ath and decided to add Lou Martin, the keyboardist from de'Ath's previous band Killing Floor. This four-piece lineup was to be one of Gallagher's most successful resulting in many of his most popular songs and documented in live film and TV appearances on shows such as Rockpalast and the Old Grey Whistle Test. The band would play together for five years. Blueprint, as with all the studio albums recorded by the Gallagher quartet illustrated Gallagher's eclectic musical influences.", "*Rod de'Ath – drums, percussion"]}, {"page": "Calling Card", "response": ["Calling Card is the sixth studio album and eighth album overall by Irish singer/guitarist Rory Gallagher.  A 1976 release, it was his second of four albums released on Chrysalis Records in the 1970s. Deep Purple/Rainbow bass guitarist Roger Glover co-produced with Gallagher: it was the first time that Gallagher worked with a \"name\" producer and the only successful such collaboration.The only other attempt was the failed next album. Gallagher tried letting Elliot Mazer produce in San Francisco. After the album was finished Gallagher scrapped it and fired most of his band. The Mazer versions of these songs were posthumously released as Notes From San Francisco. It was also the last album Gallagher would do with Rod de'Ath (drums) and Lou Martin (keyboards). After Calling Card, Gallagher retained only his long-time bass guitarist Gerry McAvoy and hired Ted McKenna on drums. This revised power trio was Gallagher's line up for the next five years when Brendan O'Neil took the sticks.", "*Rod de'Ath – drums"]}, {"page": "Lou Martin", "response": ["After leaving Gallagher's band, Martin and drummer Rod de'Ath formed Ramrod, after which Martin played with Downliners Sect and Screaming Lord Sutch, and also toured with Chuck Berry and Albert Collins."]}, {"page": "Against the Grain (Rory Gallagher album)", "response": ["*Rod de'Ath – drums, percussion"]}, {"page": "BBC Sessions (Rory Gallagher album)", "response": ["*Rod de'Ath – drums on tracks 1-9", "*Rod de'Ath – drums on tracks 1–2, 4 & 7–9"]}, {"page": "The G-Man Bootleg Series Vol.1", "response": ["*Rod de'Ath - Drums, Percussion", "*Rod de'Ath - Drums, Percussion "]}, {"page": "Rory Gallagher discography", "response": ["Gallagher is documented in the 1974 film Irish Tour '74, directed by Tony Palmer. During the heightened periods of political unrest in Ireland, as other artists were warned not to tour, Gallagher was resolute about touring Ireland at least once a year during his career, winning him the dedication of thousands of fans, and in the process, becoming a role model for other aspiring young Irish musicians.  The line-up for the Irish Tour which included Rod de'Ath on drums and Lou Martin on keyboards, performed together between 1973 and 1976.  Releases from that period include Blueprint, Tattoo, Irish Tour '74, Against the Grain and Calling Card. This Gallagher band performed several TV and radio shows across Europe, including Beat-Club in Bremen, Germany and the Old Grey Whistle Test. Gallagher recorded two Peel Sessions, both in February 1973 and containing the same tracks, but only the first was broadcast.The Peel Sessions BBC Radio 1 retrieved 26 February 2011 Along with Little Feat and Roger McGuinn, Gallagher performed the first Rockpalast live concert at the Grugahalle, Essen, Germany in 1977."]}, {"page": "Wilgar Campbell", "response": ["While with Gallagher, Campbell performed on the albums Rory Gallagher, Deuce and Live in Europe. With the increased touring that followed the success of the albums, Campbell developed a fear of flying and missed two concerts during a short tour of Ireland, being replaced by Rod de'Ath from the band Killing Floor. A month later, Campbell refused to leave his house to fly to a concert in Lausanne, Switzerland, and was again replaced by de'Ath. Three weeks later in June 1972, Campbell left Gallagher's band by mutual consent and was permanently replaced by de'Ath. After a few shows, Gallagher expanded his lineup by adding Killing Floor's keyboard player Lou Martin, who stayed for five years. According to McAvoy, Martin was recruited to help fill out the band's sound as de'Ath was not as technically proficient as Campbell."]}, {"page": "Wheels Within Wheels", "response": ["*Rod de'Ath – drums"]}, {"page": "De'Ath", "response": ["*Rod de'Ath (1950–2014), a Welsh drummer"]}, {"page": "Notes from San Francisco", "response": ["*Rod de'Ath – drums"]}, {"page": "Irish Tour '74 (film)", "response": ["Irish Tour '74 is a film directed by Tony Palmer. It documents Rory Gallagher's tour of Ireland in 1974. Gallagher toured at a time of great political turmoil and violence. Gallagher's band at the time was  Gerry McAvoy on bass guitar, Lou Martin on keyboards and Rod de'Ath on drums.", "* Rod de'Ath – drums"]}, {"page": "2014 in Wales", "response": ["*1 August – Rod de'Ath, musician, 64"]}, {"page": "2014 in the United Kingdom", "response": ["**Rod de'Ath, 64, drummer (Rory Gallagher)."]}, {"page": "Deaths in August 2014", "response": ["*Rod de'Ath, 64, Welsh drummer (Rory Gallagher).Rod de'Ath dies"]}, {"page": "Killing Floor (British band)", "response": ["The band were again indebted to Edward, who arranged for them to appear at the California Ballroom in Dunstable, where they supported Ten Years After, Jethro Tull, Chicken Shack, and The Herd.  They also played at the Marquee Club in London, supporting Yes and The Nice.  In 1969, the band expanded their loyal fan base when undertaking two UK nationwide concert tours with the American bluesman, Freddie King. The band also took the opportunity to back Arthur \"Big Boy\" Crudup. Following the release of Killing Floor and a couple of BBC Radio 1 sessions, Lou Martin left the band, and they continued for a while as a four piece. In March 1970, the band played at the Easter Festival in Hamburg, Germany. In 1970 and 1971, further line-up changes took place which included the former Juicy Lucy vocalist Ray Owen, drummer Rod de'Ath, and bassist Mick Hawksworth, joining the band. The latter had previously been with Andromeda, and later went on to join Fuzzy Duck."]}]}}