{"wiki_id": "http://www.wikidata.org/entity/Q7356257", "itemLabel": "Rod Jones", "itemDescription": "English rock guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rod_Jones_(musician)", "wikipedia_page": {"main": "Rodric Iwan Pryce Jones (born 3 December 1976) is a Welsh guitarist, singer and songwriter.\nHe is best known as a founding member of Scottish indie rock band Idlewild, with whom he has co-written and recorded six studio albums. Jones has released two solo albums and also currently fronts rock band The Birthday Suit. He is also a co-creator of the ongoing musical project, The Fruit Tree Foundation.", "link_mentions": [{"page": "The Remote Part", "response": ["The Remote Part is the third studio album by Scottish rock band Idlewild, released on 15 July 2002 by Parlophone. As they were becoming increasingly aware of their label's interest in them and their demos, the band's musical direction was being steered by guitarist Rod Jones. For the first half of 2001, the band recorded songs with producers Stephen Street and Lenny Kaye. Due to the uneven nature of the songs done between tours, they spent some time reworking 20 tracks in the Scottish Highlands. They recorded at Rockfield Studios in Wales, RAK Studios in London, and Sawmills Studios in Cornwall with producer Dave Eringa. Described as an alternative rock and indie rock record, it lacked the punk rock elements of their previous work.", "Woomble noted that the band felt like \"a collective of songwriters\" during the writing process for the next album. He credits guitarist Rod Jones with influencing their musical direction, stating that Jones \"really started to take steps forward in terms of his guitar playing, and also his harmonies\".", "* Rod Jones – guitar"]}, {"page": "Captain (album)", "response": ["Captain is the first release by the Scottish rock band Idlewild, issued by Deceptive Records in 1998. Although the number of tracks would normally classify it as an EP, Captain is commonly known as a mini-album. The guitarist Rod Jones notes that the album \"was a sort of introduction to Idlewild\".", "* Rod Jones - guitar"]}, {"page": "100 Broken Windows", "response": ["100 Broken Windows opens with \"Little Discourage\", a track that beings with a Nirvana-esque guitar part. Its call-and-response chorus section contains touches of new wave keyboards. It was one of the first songs written for the album, and initially sounded closer to \"You're the Voice\" (1986) by John Farnham. They subsequently changed the song; its lyrics were intentionally vague, spurred on by the opening line, which Woomble had written on its own at the top of his notebook. \"These Wooden Ideas\" is critical of the music industry, and was compared to Murmur (1983)-era R.E.M. The band borrowed a keyboard and guitar from Teenage Fanclub for the song as they were recording in another room at Rockfield. \"Roseability\" is an alternative rock track; Woomble said he was inspired by a poem by Gertrude Stein. When working on a song, Woomble wanted to play along to it to come up with potential lyrics, to which Eringa said he'd \"give him an idea track\". The song \"Idea Track\" was subsequently named after this, and deals with optimism. Guitarist Rod Jones said it was the band's first attempting at writing a track while at a studio. The chorus sections came about as Woomble was unable to settle on a melody that he enjoyed, so Eringa combined all six existing vocal takes into one. The bridge section features a violin performance from Jones, as they had found the instrument while at Jacob's.", "* Rod Jones – guitar"]}, {"page": "Hope Is Important", "response": ["Roddy Woomble lived in South Carolina, USA, between the ages of 13 and 15, where his music taste assimilated various punk and alternative rock albums. Upon moving to Scotland, he wanted to start a band that emulated the sound of those releases. In late 1995, Idlewild formed in Edinburgh, with its initial line-up consisting of Woomble on vocals, Rod Jones on guitar, Phil Scanlon on bass, and Colin Newton on drums. After a year of touring, the band released their debut single, \"Queen of the Troubled Teens\", in March 1997 through local label Human Condition. The band parted ways with Scanlon and replaced him with Bob Fairfoull. As \"Queen of the Troubled Teens\" received attention from media outlets, the band signed with Fierce Panda Records. With this label, the band released their next single \"Chandelier\" in December 1997. The band released the mini album Captain in January 1998; it was intended as a single for Deceptive Records before becoming a mini album.", "* Rod Jones – guitar"]}, {"page": "Idlewild (band)", "response": ["Idlewild are a Scottish rock band formed in Edinburgh in 1995. The band's line-up consists of Roddy Woomble (lead vocals), Rod Jones (guitar, backing vocals), Colin Newton (drums), Andrew Mitchell (bass), and Luciano Rossi (keyboards). To date, Idlewild have released nine full-length studio albums.", "Idlewild, named after the quiet meeting place in Anne of Green Gables, formed in December 1995 in Edinburgh, Scotland when a 19-year-old Roddy Woomble met drummer Colin Newton at a party. The two discovered that they had much in common, including similar musical interests and record collections. By the end of the night, they had discussed forming a band together. On the same night, the two were introduced to guitarist Rod Jones and the three kept in contact afterwards, meeting up to listen to music. Soon, the trio began writing songs together, and, in need of a bassist, they brought Phil Scanlon into the fold, due to the fact that he owned a bass guitar.", "In July 2006, Roddy Woomble released an album of folk music under his own name titled My Secret is My Silence. Woomble's solo material was written alongside Rod Jones, friend Michael Angus and folksinger Karine Polwart, and produced by folk musician John McCusker. Roddy toured the album in July and August. Jones meanwhile worked on an album with Inara George called George Is Jones", "Initial emails indicated a release date to fans who had pre-ordered the album of mid-April, but the album was eventually mailed out on 10 June 2009.  Fans who pre-ordered the album were also allowed to download their choice of live tracks that the band had recorded at the King Tut's series of shows. The album was officially released in October, preceded by the single \"Readers & Writers\". In April 2010, Woomble announced that the band would enter a hiatus following the band's tour in support of Post Electric Blues. However this comment only referred to the writing and recording of new material as Woomble later suggested. Idlewild announced their first American tour since 2005 and a short UK tour in support of the EMI re-release of 100 Broken Windows.  During the UK shows (as well as a New York and Los Angeles show) the album was to be played in its entirety.  However, due to an injury to Rod Jones, the American dates were cancelled. The 100 Broken Windows reissue was released on 8 November 2010 and featured a second disc of B-Sides and unreleased material.", "In 2006, Woomble worked with several musicians including Kate Rusby, his wife Ailidh Lennon, songwriter Karine Polwart (to whom he presented the Horizon Award at the BBC Folk Awards 2005, and with whom he performed at Celtic Connections) and Idlewild guitarist Rod Jones on his debut solo album My Secret is My Silence, produced by John McCusker. The album was released in July 2006, and Woomble toured the United Kingdom in support of the album's release. My Secret is my Silence reached number one in the UK Folk Charts, and a year later, on 10 July 2007, My Secret is my Silence was released in the United States on 7–10 Music. Woomble's follow-up album, Before the Ruin, written and recorded with Kris Drever and John McCusker, was released on 15 September 2008 through Navigator Records. In March 2011, Woomble released his second solo album, The Impossible Song & Other Songs.", "* Rod Jones – guitar, backing vocals, keyboards (1995–2010, 2013–present)", " bar:Rod text:\"Rod Jones\""]}, {"page": "List of guitarists", "response": ["*Rod Jones (Idlewild)"]}, {"page": "Warnings/Promises", "response": ["By December 2002, the band were in the process of writing material for their next album. It became their longest writing process up to this point due to including every member in it. The constant touring started becoming a strain on the members' health as they would have little time to rest in between tours. Idlewild spent the second half of 2003 writing material in the Scottish Highlands. They rented a house and set up all of their equipment there. It marked the first time that every member of the band contributed to the writing process, as previous releases were done for the most part between vocalist Roddy Woomble and guitarist Rod Jones. In retrospect, Jones felt they had \"maybe too many song ideas\" with \"quite a lot of compromising going on\". He added that they \"weren't skilled enough with our communication skills at that point\" to let Fox and Stewart offer more to the writing.", "* Rod Jones – guitar"]}, {"page": "Queen of the Troubled Teens", "response": ["Category:Songs written by Rod Jones (musician)"]}, {"page": "Love Steals Us from Loneliness", "response": ["Category:Songs written by Rod Jones (musician)"]}, {"page": "El Capitan (Idlewild song)", "response": ["Category:Songs written by Rod Jones (musician)"]}, {"page": "Roddy Woomble", "response": ["Idlewild was formed in 1995 by Woomble, Rod Jones, Colin Newton and Phil Scanlon.", "thumb|left|Roddy Woomble performing with Rod Jones and Kate Rusby at the launch party for My Secret is My Silence", "In 2006, Woomble worked with several musicians including Kate Rusby, his wife Ailidh Lennon, songwriter Karine Polwart (to whom he presented the Horizon Award at the BBC Folk Awards 2005, and with whom he performed at Celtic Connections) and Idlewild guitarist Rod Jones on his debut solo album My Secret Is My Silence, produced by John McCusker. The album was released in July 2006, and Woomble toured the United Kingdom in support of the album's release. My Secret Is My Silence reached number one in the UK Folk Charts, and a year later, on 10 July 2007, My Secret Is My Silence was released in the US on 7–10 Music.", "Living in Edinburgh, he met Colin Newton and Rod Jones, both future members of Idlewild. He moved back to the United States after the success of Idlewild's Top Ten album, The Remote Part, and lived in New York City for some time.  "]}, {"page": "Bob Fairfoull", "response": ["In 2009, when asked if the members of Idlewild remain friends with Fairfoull, Rod Jones stated that \"there are no bad feelings between any of us and we have all seen Bob a few times over the last few years and remain on good terms.\"Interview: Rod Jones (Idlewild), stereokill.net; accessed 6 December 2017. For his part, Fairfoull did not begrudge the band for carrying on without him and approved of being replaced by his good friend Gavin Fox, though he did remark, \"It felt a bit like if you left your wife, and a week later she started shagging your brother.\" Fifteen years after leaving the band, Fairfoull joined Idlewild onstage as a surprise guest to play several songs at shows marking the 15th anniversary of the album The Remote Part in Glasgow and Edinburgh."]}, {"page": "My Secret Is My Silence", "response": ["The album, produced by John McCusker, features tracks co-written by McCusker, Rod Jones, Michael Angus and Karine Polwart, as well as the vocals of folk singer Kate Rusby.", "* Rod Jones – acoustic guitar (3 and 4), electric guitar (2, 3, 4, 5, 6, 8, 9, 10 and 11), vocals (2, 3, 4, 5, 6, 7, 9, 10 and 11) "]}, {"page": "A Modern Way of Letting Go", "response": ["Category:Songs written by Rod Jones (musician)"]}, {"page": "Make Another World", "response": ["According to the guitarist Rod Jones, the album references each of the band's previous albums, and is a \"summing up of the past twelve years\". The album was noted for its return to Idlewild's heavier roots, while continuing to maintain a strong sense of melody as displayed on more recent albums. Q described the album as \"the sound of a band re-energised.\"", "The album was performed in full on 21 December 2008, alongside their first album, Captain, at King Tut's Wah Wah Hut in Glasgow. In an interview following the gig, the guitarist Rod Jones said that the album - alongside Warnings/Promises - is his favourite release, saying that he \"feels that we have become better at our craft as time goes on and I feel more confident in our song-writing as time goes by.\"", "* Rod Jones – guitar, keyboards, vocals", "* Interview with Rod Jones - 28 June 2007"]}, {"page": "The Twilight Sad", "response": ["Singer James Graham appears on the live album Quietly Now! by fellow Scottish band Frightened Rabbit, providing additional vocals on the track \"Keep Yourself Warm\". In 2011, Graham appeared as a guest vocalist and songwriter on the album First Edition by The Fruit Tree Foundation, a supergroup collaboration of Scottish musicians headed by Rod Jones and Emma Pollock for the benefit of the Mental Health Foundation for Scotland. In 2015, Graham participated in Aidan Moffat's backing band during Moffat's UK tour performing Scottish folk songs. The tour was part of the documentary film Where You're Meant to Be, which was released the following year.YouTube – Aidan Moffat – The Parting Song at Glasgow Barrowlands – GFF16 In 2016, Graham featured as a guest vocalist with supergroup Minor Victories on their song \"Scattered Ashes (Song for Richard)\". The track appeared on Minor Victories' self-titled album. In 2017, Graham co-founded the band Out Lines, with fellow musicians Kathryn Joseph and Marcus Mackay. Out Lines's debut album, Conflats, was released on 27 October 2017 via Rock Action Records, Mogwai's label, where Graham also works outside his Twilight Sad duties."]}, {"page": "Rod Jones (Musician)", "response": ["#REDIRECT Rod Jones (musician) "]}, {"page": "Rod Jones", "response": ["Rod Jones may refer to:", "*Rod Jones (author) (born 1953), Australian author", "*Rod Jones (cornerback) (born 1964), American football cornerback in the National Football League", "*Rod Jones (offensive lineman) (born 1974), American football tackle in the National Football League", "*Rod Jones (tight end) (1964-2018), former professional American football tight end", "*Rod Jones (English footballer) (born 1945), goalkeeper for Rotherham United, Burnley and others", "*Rod Jones (Welsh footballer) (born 1946), Welsh footballer known also known as 'Roddy'", "*Rod Jones (musician) (born 1976), guitarist with the band Idlewild"]}, {"page": "List of people with surname Jones", "response": ["*Rod Jones (musician) (born 1976), English guitarist, founding member of Indie band Idlewild", "*Rod Jones (author), Australian writer", "*Rod Jones (football player) (born 1964), cornerback", "*Rod Jones (offensive lineman) (born 1974), offensive tackle"]}, {"page": "Under One Sky (album)", "response": ["*Rod Jones - harmony vocals (\"Long Time Past\")"]}, {"page": "Post Electric Blues", "response": ["Post Electric Blues is the seventh studio album by Scottish indie rock band Idlewild, self-released to around 3000 fans in June 2009. The album was subsequently released on 5 October 2009 on Cooking Vinyl. Prior to recording, guitarist Rod Jones revealed that the album has \"quite an upbeat musical feel,\" and that it sounds \"like a band having a good time.\"", "* Rod Jones – guitar, keyboards, vocals"]}, {"page": "A Sentimental Education (Rod Jones album)", "response": ["A Sentimental Education is the debut studio album by Idlewild guitarist Rod Jones, self-released in February 2010 and on Borough Music in April 2010. The album was mixed by regular Idlewild producer Dave Eringa.", "*Rod Jones - vocals, guitar, bass, keyboards", "*Rod Jones - recording, producer"]}, {"page": "The Fruit Tree Foundation", "response": ["The Fruit Tree Foundation is a Scottish musical project founded by Idlewild guitarist Rod Jones and former Delgados vocalist and guitarist Emma Pollock in 2010. Created in conjunction with the Mental Health Foundation, the project's overall aim is to \"raise awareness of mental health and challenge perceptions of mental health problems by creating great art.\"", "In both 2008 and 2009, Idlewild guitarist Rod Jones and former Delgados vocalist Emma Pollock curated concerts for Scottish Mental Health Arts & Film Festival, entitled, 'Music Like a Vitamin'. The concerts featured notable Scottish indie acts; Frightened Rabbit, The Twilight Sad, Sons and Daughters and Attic Lights, alongside folk musicians; Karine Polwart, James Yorkston and Alasdair Roberts. Regarding the shows, Pollock noted, \"They were great gigs, with huge attendance as we always kept the ticket prices so low.\""]}, {"page": "The Birthday Suit", "response": ["The Birthday Suit is a Scottish indie rock band from Edinburgh, formed in 2011 by Idlewild guitarist Rod Jones. Alongside Jones, the band's line-up includes Jacqueline Irvine, David Jack, Steve Morrison, Séan McLaughlin and Catrin Pryce-Jones."]}, {"page": "The Eleventh Hour (The Birthday Suit album)", "response": ["In 2010 Idlewild entered an indefinite hiatus and so guitarist and backing vocalist Rod Jones subsequently formed The Birthday Suit in 2011 after writing material for his second album, Jones noted:", "*Rod Jones"]}, {"page": "Everything Ever Written", "response": ["Everything Ever Written is the eighth studio album by Scottish indie rock band Idlewild, released on 16 February 2015 on Empty Words Records. Produced by guitarist Rod Jones, the album was recorded after a lengthy hiatus, during which the future of the band was uncertain. The album is the first to feature keyboardist Luciano Rossi and guitarist and bassist Andrew Mitchell.", "During the band's hiatus, Roddy Woomble recorded and released two solo albums, The Impossible Song & Other Songs (2011) and Listen to Keep (2013), guitarist Rod Jones formed the indie rock band The Birthday Suit, releasing three studio albums, while drummer Colin Newton moved to Canada.", "Recording began in late 2013, with guitarist Rod Jones occupying the role of producer. Regarding his production influences, Jones stated: \"I’m a big fan of Wilco and Jeff Tweedy, I’m a big fan of how their records are so much lower than other peoples, not in terms of volume but in terms of tone. I like to think of them as thick, like a nice thick broth. It's a strange analogy, but that's the one we use.\"", "*Rod Jones – electric guitar, acoustic guitar (7), backing vocals, trumpet (9), string arrangements", "*Rod Jones – producer"]}, {"page": "Interview Music", "response": ["*Rod Jones – electric guitar, acoustic guitar"]}, {"page": "Kobi Onyame", "response": ["Onyame's album Gold was nominated for the Scottish Album of the Year in 2018, where it was described as \"an almost wistful echo of a yearning for home and originality that somehow has its roots in the past and present simultaneously.\" Following this nomination, he was the recipient of funding from the PRS Foundation, to support the recording of his next album.  Along with C Duncan, Modern Studies, and Rod Jones, Onyame performed at the Live at the Longlist event where the 2019 Scottish Album of the Year award winner were announced."]}]}}