{"wiki_id": "http://www.wikidata.org/entity/Q7359013", "itemLabel": "Roger Tolchard", "itemDescription": "English Test and County cricketer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Tolchard", "wikipedia_page": {"main": "Roger William Tolchard (born 15 June 1946 in Torquay, Devon, England) is an English former cricketer, who played in four Tests and one One Day International for England in the late 1970s.", "link_mentions": [{"page": "International cricket in South Africa from 1971 to 1981", "response": ["*Brian Close (captain); Ray East; John Edrich; Bruce Francis (Australian); John Gleeson (Australian); Graham Johnson; Peter Lee; Graham Roope; John Snow; Roger Tolchard; Bob Woolmer (a South African, who was born in India and played for England)", "The next games for a representative South African side therefore took place on Derrick Robins third tour to South Africa in March and April 1975. This DH Robins' XI was again an international side. Captained once again by Brian Close, it included the following players from Robins' preceding tour: Bruce Francis (Australian), John Shepherd (West Indian), Roger Tolchard, Younis Ahmed (Pakistani). In addition, the following also toured: Malcolm Francke (Sri Lanka/Australia), Geoff Greenidge (West Indies), Tony Greig (South African-born England player), Jackie Hampshire, Frank Hayes, Eddie Hemmings, Terry Jenner (Australia), John Lyon, Clive Radley, Stephen Rouse, John Steele, Stuart Turner, Max Walker (Australia).", "The members of touring party were (England unless stated): Phil Carrick, Trevor Chappell (Australia), Geoff Cope, John Douglas (Australia), Frank Hayes, Mike Hendrick, Geoff Howarth (New Zealand), Andrew Kennedy, Peter Lee, David Lloyd (captain), Derek Randall, Phil Slocombe, David Steele, Fred Titmus, Roger Tolchard, Gary Troup (New Zealand), Dav Whatmore (Australia)."]}, {"page": "List of International cricket families", "response": ["*Roger Tolchard"]}, {"page": "Leicestershire County Cricket Club", "response": ["* Roger Tolchard"]}, {"page": "Brian Brain", "response": ["Now approaching forty years old, Brain's form began to tail off, although he was still good enough to take a total of 106 first-class and 46 List A wickets in the next two seasons, with 6–68 against Glamorgan in May 1980 a highlight of his later years. He took his last first-class wicket (John Barclay) against Sussex in July 1981, although he did play two further Championship games without reward. His final List A game was for Minor Counties against Leicestershire in the 1982 Benson and Hedges Cup; he picked up the wickets of ex-Test cricketers Chris Balderstone and Roger Tolchard."]}, {"page": "Indian cricket team in England in 1971", "response": ["This match proved to be the turning point for the Indians who now began to win consistently. The match was played in warm sunshine before a crowd that included many Indians. Barry Dudleston and David Steele began with a stand of 50 runs in an hour before Chandra caught and bowled Steele. Baig ran Dudleston out for 51 and Solkar took a spectacular catch at short squareleg to dismiss Brian Davison. Leicestershire were dismissed before tea for 198. Gavaskar and Wadekar added 231 for the second wicket. Wadekar once swung Jack Birkenshaw over fineleg, shattering the window panes. India was 120 for 1 at close on the first day, and added another 125 without loss before lunch on the second. Wadekar was well caught by Birkenshaw at short midwicket having made 126 with 18 fours and the six. Gavaskar made 165 in five and a half fours with 21 fours. India declared after tea with a lead of 218. Leicestershire lost quick wickets on the last day before Chris Balderstone and Roger Tolchard added 72 for the fifth wicket. Tolchard was dropped by Solkar but Gavaskar had him caught at slip. The match ended ten minutes after lunch. Chandra returned figures of 5 for 63 and 6 for 64 (11 for 127)."]}, {"page": "D. H. Robins' XI cricket team in Sri Lanka in 1977–78", "response": ["The team was captained by Mike Denness and included several well-known players such as David Gower, Peter Willey, Harry Pilling, Intikhab Alam, Roger Tolchard, John Lever, Phil Carrick, Geoff Howarth, John Wright, Chris Cowdrey and John Emburey."]}, {"page": "Paul Fisher (cricketer, born 1954)", "response": ["Early the following year, Fisher made his first-class debut, for Oxford against Leicestershire at The University Parks, taking a catch to dismiss opposition keeper Roger Tolchard and scoring 14 and 15."]}, {"page": "List of Leicestershire cricket captains", "response": ["* Roger Tolchard (1981–1983)"]}, {"page": "Richard Twose", "response": ["Twose's brother, Roger, played Test cricket for New Zealand, his uncle, Roger Tolchard, played Test cricket for England, and his uncles Jeffrey and Ray, played first-class and List A cricket for Leicestershire and Devon respectively."]}, {"page": "List of Old Malvernians", "response": ["* Roger Tolchard, England cricketer"]}, {"page": "Tom Sidwell", "response": ["Thomas Edgar Sidwell (30 January 1888 – 8 December 1958) was an English cricketer. A right-hand batsman and a wicketkeeper, Sidwell made 392 appearances for Leicestershire County Cricket Club between 1913 and 1933. His 551 catches and 127 stumpings were a county record until beaten by Roger Tolchard, and his keeping skill made him a rival of incumbent national keeper Herbert Strudwick though Sidwell was never selected for England. Two of his three centuries came in the 1928 season where he hit 1,153 runs, and he batted in both the lower and top order."]}, {"page": "Old Malvernians Cricket Club", "response": ["Notable members of the club have included Gavin Franklin,Teams Gavin Franklin played for. www.cricketarchive.com. Retrieved 14 July 2010. Mark Hardinges,Teams Mark Hardinges played for. www.cricketarchive.com. Retrieved 14 July 2010. Roger Tolchard,Teams Roger Tolchard played for. www.cricketarchive.com. Retrieved 14 July 2010. Jeff Tolchard,Teams Jeff Tolchard played for. www.cricketarchive.com. Retrieved 14 July 2010. Jonathan Wileman,Teams John Wileman played for. www.cricketarchive.com. Retrieved 14 July 2010. Mark Vermeulen and Ivan Johnson."]}, {"page": "List of Wellington representative cricketers", "response": ["|  || 1994/95 || 2000/01 || 27 || 1994/95 || 2000/01 || 71|| - || - || - || Brother of Richard Twose and nephew of Jeff, Ray and Roger Tolchard."]}, {"page": "List of international cricket five-wicket hauls by B. S. Chandrasekhar", "response": ["*Roger Tolchard"]}, {"page": "Ray Julian", "response": ["By the mid-1960s, recruits from other countries brought in by the Leicestershire secretary, later manager, Mike Turner, such as Stanley Jayasinghe and Clive Inman and from other counties such as John Cotton and Peter Marner, helped make Leicestershire a more competitive side. Julian played regularly through to the end of the 1965 season, but for 1966 the 20-year-old Roger Tolchard, a Devonian via Malvern College, was preferred and Julian then became his deputy, appearing in only three further first-class matches to the end of the 1971 season, when he left the county staff. He had appeared in Leicestershire's first three List A matches, one each in the Gillette Cup competitions of 1963, 1964 and 1965, but all three games were lost."]}, {"page": "International XI cricket team in Pakistan, India and Ceylon in 1967–68", "response": ["An International XI cricket team toured numerous countries from January to April 1968 and their itinerary included four first-class matches in Pakistan, India and Ceylon during February and March. The team consisted of Mickey Stewart (captain), Roger Tolchard (wk), Derek Underwood, Dennis Amiss, Keith Fletcher, Khalid Ibadulla, Harold Rhodes, Gamini Goonesena, Ken Suttle, Harry Latchman and Mike Denness."]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["*  Roger Tolchard (1967–1976/77) : R. W. Tolchard (Leicestershire). Tours: India, Pakistan & Sri Lanka (1972/73); India, Sri Lanka & Australia (1976/77)."]}, {"page": "Tolchard", "response": ["*Roger Tolchard (born 1946), English cricketer"]}, {"page": "List of international cricket five-wicket hauls at Wankhede Stadium", "response": ["*Roger Tolchard"]}]}}