{"wiki_id": "http://www.wikidata.org/entity/Q7358682", "itemLabel": "Roger Morgan", "itemDescription": "footballer (born 1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Morgan", "wikipedia_page": {"main": "Roger Ernest Morgan (born 14 November 1946) is an English former footballer, born in Walthamstow, London, who played as a winger in the Football League for Queens Park Rangers and Tottenham Hotspur.Morgan came through the ranks at Queens Park Rangers to make his debut in a 2–2 draw against Gillingham on 3 October 1964. He scored QPR's first ever goal at Wembley, their first goal in the 1967 Football League Cup Final against West Bromwich Albion, which QPR won 3–2 with further goals from Rodney Marsh and Mark Lazarus to overturn a two-goal deficit.In total, Roger played 180 league games for QPR scoring 39 goals before joining Tottenham Hotspur in 1969. Injury forced his early retirement in 1973.\nHe spent 18 years at West Ham United as Football in the Community Manager. Roger Morgan coached David Beckham as a youngster.\nMorgan's identical twin brother Ian also played for QPR. They adopted different hairstyles in order to tell them apart when playing in the same team.", "link_mentions": [{"page": "E. H. Carr", "response": ["Carr exercised wide influence in the field of Soviet studies and international relations. The extent of Carr's influence could be seen in the 1974 festschrift in his honour, entitled Essays in Honour of E.H. Carr ed. Chimen Abramsky and Beryl Williams. The contributors included Sir Isaiah Berlin, Arthur Lehning, G. A. Cohen, Monica Partridge, Beryl Williams, Eleonore Breuning, D. C. Watt, Mary Holdsworth, Roger Morgan, Alec Nove, John Erickson, Michael Kaser, R. W. Davies, Moshe Lewin, Maurice Dobb, and Lionel Kochan.Ambramsky, C. & Williams, Beryl Essays in Honour of E.H. Carr pp. v–vi"]}, {"page": "Rodney Marsh", "response": ["His first full season with Rangers was his most successful, as he formed an effective strike partnership with Les Allen, whilst Roger Morgan and Mark Lazarus delivered reliable service from the wings. Marsh scored his first hat-trick for the club in a 4–0 win over Middlesbrough. He scored 44 goals in 53 games as the club became Third Division champions; his 30 league goals made him the division's top-scorer. QPR also won the League Cup, with Marsh setting Rangers on their way with four goals during a 5–0 victory over Colchester United at Layer Road. They needed a replay to overcome Aldershot, before they beat Swansea Town, top-flight Leicester City, Carlisle United and Birmingham City. Their opponents in the Wembley final were West Bromwich Albion, who had won the cup the previous year. The \"Baggies\" took a two-goal lead before half-time, but Rangers fought back in the second half and on the 75th minute Marsh scored what he described as \"the defining goal of my career\" when he made a mazy run past numerous defenders before finding the net with a 25-yard shot that went in off the post. Lazarus scored QPR's third goal six minutes later to win the game 3–2. A week after the final Tottenham Hotspur manager witnessed Marsh put in a strong performance against Bournemouth & Boscombe Athletic and he offered to pay QPR £180,000 for Marsh and Morgan, but his offer was rejected by chairman Jim Gregory."]}, {"page": "Alec Stock", "response": ["It was perhaps Stock's time as manager of Queens Park Rangers where he is most fondly remembered. It was during his spell in the 1960s that coincided with the development of the club with chairman Jim Gregory. The team enjoyed unprecedented success in 1967 and 1968 winning consecutive promotions with the club reaching the First Division for the first time and becoming the first Third Division team to win the Football League Cup in 1967 beating then First Division West Bromwich Albion 3–2 in a come from behind win. Stock had a focus on youth bringing many of the team through the club's youth system (including Frank Sibley, Tony Hazell, Roger Morgan, Ian Morgan and Mick Leach) as well as blending characters such as Rodney Marsh and Mark Lazarus into the set up."]}, {"page": "1967 Football League Cup Final", "response": ["Watched by a crowd of 97,952, Albion took the lead in the first half when Clive Clark scored in the 7th minute. He scored again later in the half to give Albion a 2–0 lead at half-time. QPR reduced the deficit in the 63rd minute when Roger Morgan scored and then levelled the match 12 minutes later courtesy of a goal by Rodney Marsh. Mark Lazarus scored a third goal for QPR in the 81st minute, as QPR won the match 3–2 to win the League Cup for the first time.", "Until the first leg of the semi-final against Birmingham City, QPR had not won an away match during their League Cup campaign. They were one goal down at half time, and again were forced to recover the deficit during the second half. In the 55th minute, Marsh scored his 34th goal of the season, he headed the ball into the goal after a corner kick from Allen. Marsh was involved again in QPR's second and third goal as he set up Roger Morgan for the second, and then back heeled the ball through to Lazarus for the third. QPR's fourth and final goal saw Marsh hit a header direct from a free kick to Allen who scored.  The second leg secured QPR's first trip to Wembley, and marked the first time that a team from the Third Division had reached any Wembley final. They won the game 3–1, but they did not score until the last twelve minutes of the match. ", "The teams came out for the second half, and Rangers began an attack almost immediately. A series of short, quick passes from Marsh and Roger Morgan released Allen but he was not quick enough to make something of the chance. A high pass from Keen followed, striking defender Clarke in the back, from which the Albion defence were forced to clear. The attacks continued to come from Rangers as Lazarus passed the ball through to Marsh who took the ball around two defenders, but his shot went over the bar. QPR were rewarded for their perseverance in the sixty-third minute as Lazarus took the ball around Albion captain Graham Williams, crossing the ball in for Morgan, who scored with a header to reduce the deficit to a single goal.Macey (2009): p. 188", "| FW ||11|| Roger Morgan"]}, {"page": "Morgan (surname)", "response": ["*Roger Morgan (1946) English footballer, QPR, Tottenham."]}, {"page": "History of Queens Park Rangers F.C.", "response": ["In 1966–67, QPR won the Division Three championship and also became the first Third Division club to win the League Cup, when on Saturday, 4 March 1967, they defeated West Bromwich Albion 3–2, (coming back from a two-goal deficit). As of today, it is still the only major trophy that Rangers have won. It was also the first League Cup Final to be held at Wembley Stadium. The undoubted star of the team was Rodney Marsh who scored 44 goals, but also included Les Allen, Roger Morgan and captain Mike Keen. They won promotion again the following year, reaching the top flight for the first time in their history."]}, {"page": "List of people from the London Borough of Waltham Forest", "response": ["* Roger Morgan"]}, {"page": "1966–67 Football League Cup", "response": ["The final was contested by Third Division side Queens Park Rangers and First Division side West Bromwich Albion at Wembley Stadium in London. Clive Clark scored twice in the first half to give West Bromwich Albion a 2–0 half-time lead. However, second-half goals from Queens Park Rangers' Roger Morgan, Rodney Marsh, and Mark Lazarus turned the game around. Queens Park Rangers, who also won the Third Division championship this season, eventually won the match 3–2 to claim the trophy.", "| ||11||Roger Morgan"]}, {"page": "List of UEFA Cup and Europa League winning players", "response": ["|Roger Morgan"]}]}}