{"wiki_id": "http://www.wikidata.org/entity/Q7358074", "itemLabel": "Roger Davies", "itemDescription": "British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Davies_(astrophysicist)", "wikipedia_page": {"main": "Roger Llewelyn Davies (born 13 January 1954) is a British astronomer and cosmologist, one of the so-called Seven Samurai collaboration who discovered an apparent concentration of mass in the Universe called the Great Attractor. He is the Philip Wetton Professor of Astrophysics at Oxford University. His research interests centre on cosmology and how galaxies form and evolve. He has a longstanding interest in astronomical instruments and telescopes and developed the scientific case for the UK's involvement in the 8m Gemini telescopes project. He has pioneered the use of a new class of astronomical spectrograph to measure the masses and ages of galaxies, as well as search for black holes in their nuclei. He is the founding Director of the Oxford Centre for Astrophysical Surveys which is funded by the Hintze Family Charitable Foundation.\n\n", "link_mentions": [{"page": "Timeline of knowledge about galaxies, clusters of galaxies, and large-scale structure", "response": ["* 1987 — David Burstein, Roger Davies, Alan Dressler, Sandra Faber, Donald Lynden-Bell, R. J. Terlevich, and Gary Wegner claim that a large group of galaxies within about 200 million light years of the Milky Way are moving together towards the \"Great Attractor\" in the direction of Hydra and Centaurus,"]}, {"page": "List of astronomers", "response": ["| Roger Davies || UK || 1954 ||", "*Roger Davies (UK, 1954–)"]}, {"page": "Roger Davies", "response": ["Roger Davies may refer to:", "* Roger Davies (actor), English actor known for Renford Rejects and The Cloverfield Paradox", "* Roger Davies (manager) (born 1952), Australian-born manager in the music industry", "* Roger Davies (Harry Potter), fictional character in the Harry Potter book series", "* Roger Davies (footballer) (born 1950), English footballer, MVP of the North American Soccer League in 1980", "* Roger Davies (astrophysicist) (born 1954), English astrophysicist"]}, {"page": "Donald Lynden-Bell", "response": ["In the 1980s, he was a member of a group of astronomers known as the 'Seven Samurai' (with Sandra Faber, David Burstein, Alan Dressler, Roger Davies, Roberto Terlevich, and Gary A. Wegner) who postulated the existence of the Great Attractor, a huge, diffuse region of material around 250 million light-years away that results in the observed motion of our local galaxies.Dennis Overbye, Lonely Hearts of the Cosmos, 1st. ed., p. 410, Harper Collins, 1991"]}, {"page": "John Leggott College", "response": ["* Roger Davies, Philip Wetton Professor of Astrophysics since 2002 at the University of Oxford, and Professor from 1994–2002 of Astronomy at Durham University (1965–72)"]}, {"page": "List of Durham University people", "response": ["* Roger Davies – Philip Wetton Professor of Astrophysics at Oxford University; President of the Royal Astronomical Society (2010–2012)"]}, {"page": "English-Speaking Union", "response": ["Fellowships are awarded following a rigorous application process, undertaken by a committee, chaired by Professor James Raven, Deputy Chairman of the ESU, which represents the full range of scientific fields eligible for a fellowship. In 2017 the panel comprised: Professor Dirk Aarts – Christ Church; Professor Paul Beer – Wadham College; Professor Ben Berks – Wadham College; Professor Roger Davies – Christ Church; Dr Martin Grossel – Southampton; Dr Karen Mooney-McAuley – Queens University Belfast; Professor Sir David Read – Royal Society and Professor Mary Rees – Liverpool University."]}, {"page": "Roberto Abraham", "response": ["Abraham received a Bachelor of Science from the University of British Columbia in 1987 and a PhD from Oxford University in 1992, working under the supervision of Ian M. McHardy and Roger Davies."]}, {"page": "Faber–Jackson relation", "response": ["In 1962, Rudolph Minkowski had discovered and wrote that a \"correlation between velocity dispersion and [luminosity] exists, but it is poor\" and that \"it seems important to extend the observations to more objects, especially at low and medium absolute magnitudes\".Minkowski, R. (1962), Internal Dispersion of Velocities in Other Galaxies  This was important because the value of \\gamma depends on the range of galaxy luminosities that is fitted, with a value of 2 for low-luminosity elliptical galaxies discovered by a team led by Roger Davies,Davies, R. L.; Efstathiou, G.; Fall, S. M.; Illingworth, G.; Schechter, P. L. (1983), The kinematic properties of faint elliptical galaxies and a value of 5 reported by Paul L. Schechter for luminous elliptical galaxies.Paul L. Schechter (1980), Mass-to-light ratios for elliptical galaxies   "]}, {"page": "Seven Samurai (disambiguation)", "response": ["*The \"Seven Samurai\", a group of optical astronomers who published numerous papers, including the proposing the existence of a Great Attractor: they were David Burstein, Roger Davies, Alan Dressler, Sandra Faber, Donald Lynden-Bell, Roberto Terlevich, and Gary A. Wegner"]}, {"page": "Royal Society Wolfson Research Merit Award", "response": ["* Roger Davies"]}, {"page": "Galaxy Zoo", "response": ["Galaxy Zoo recruited volunteers to help with the largest galaxy census ever carried out. Opening the project to the general public saved the professional astronomers the task of studying all the galaxies themselves, resulting in classification of a large number of galaxies undertaken in a shorter time than what smaller research teams would be able to do, classifying 900,000 galaxies in months rather than years if done by smaller research teams. Computer programs had been unable to reliably classify galaxies: several groups had attempted to develop image-analysis programs. Kevin Schawinski stated: \"The human brain is actually much better than a computer at these pattern recognition tasks.\" However, volunteers astonished the project's organizers by classifying the entire catalog years ahead of schedule. An online forum was later set up two weeks after the initial start, partially due to a large volume of emails being sent around, to the point that it was troublesome for those receiving them to process and respond to them. This led volunteers to point out anomalies that on closer inspection have turned out to be new astronomical objects such as 'Hanny's Voorwerp' and 'the Green Pea galaxies'. “I’m incredibly impressed by what they’ve managed to achieve,” says University of Oxford astronomer Roger Davies, former president of the Royal Astronomical Society.“They’ve made it possible to do things with a huge survey.”", "The Galaxy Zoo forum became a hotbed for the discussion of the SDSS images and more general science questions. Its 'global moderator', UK teacher Alice Sheppard, said of it: \"I don't quite know what it is, but Galaxy Zoo does something to people. The contributions, both creative and academic, that people have made to the forum are as stunning as the sight of any spiral, and never fail to move me.\" Author Michael Nielsen wrote in his book Reinventing Discovery: \"But Galaxy Zoo can go beyond computers, because it can also apply human intelligence in the analysis, the kind of intelligence that recognizes that Hanny's Voorwerp or a Pea galaxy is out of the ordinary, and deserves further investigation. Galaxy Zoo is thus a hybrid, able to do deep analyses of large data sets that are impossible in any other way.\" A community feeling was also created. Roger Davies stated: \"The community of Galaxy Zoo gives them the opportunity to participate that they’re looking for.” This community became known as the 'Zooites'. Aida Berges, a homemaker living in Puerto Rico who has classified hundreds of thousands of galaxies, stated: \"Every galaxy has a story to tell. They are beautiful, mysterious, and show how amazing our universe is. It was love at first sight when I started in Galaxy Zoo ... It is a magical place, and it feels like coming home at last.\" The Galaxy Zoo Forum became a read-only archive in July 2014. After seven years online and over 650,000 posts, it continues to generate science."]}, {"page": "Roger Llewelyn Davies", "response": ["#REDIRECT Roger Davies (astrophysicist)"]}, {"page": "European Astronomical Society", "response": ["The first person to hold the title of President of the European Astronomical Society was Lodewijk Woltjer, a post he held from the founding of the EAS until 1994. The post has a term of office of four years, the same as the other offices on the governing Council of the Society, and the office transfers from the incumbent at the conclusion of the final EAS Annual Meeting of their term.  and Roger Davies are the only holders to have been re-elected for a second term.", "The current president is Roger Davies (Oxford, UK), who took up the role in 2017.", "| 07 || 100px ||  Roger Davies  || 2017 || 2026 || || "]}, {"page": "President of the Royal Astronomical Society", "response": ["| 87 || 100px ||  Roger Davies || 2010 || 2012 || Astronomer, physical cosmologist || "]}]}}