{"wiki_id": "http://www.wikidata.org/entity/Q7350752", "itemLabel": "Robert W. Thomson", "itemDescription": "British academic (1934-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_W._Thomson", "wikipedia_page": {"main": "Robert William Thomson (24 March 1934, Cheam, London UK – 20 November 2018, Oxford) was Calouste Gulbenkian Professor of Armenian Studies at Oxford University.Thomson graduated from the University of Cambridge with a degree in classics, then studied at the Halki seminary in Turkey. Thomson received his PhD from Cambridge after defending his doctoral dissertation on Armenian and Syriac versions of Athanasius of Alexandria's works.When an Armenian Studies Professorship was established in the Faculty of Arts and Sciences at the Harvard University in 1969, Thomson was appointed to the chair which was subsequently named in honor of Armenian saint and scholar Mesrob Mashtots. Thomson held this position until 1992, when he accepted the Gulbenkian Chair in Armenian Studies at Oxford University in England. He retired in 2001. In 1984–1989 he was the Director of the Dumbarton Oaks Research Library and Collection. In 1995, he was elected a fellow of the British Academy. Among other distinctions, he received the Saint Sahak and Saint Mesrop Medal from Vazgen I, Catholicos of All Armenians for his contributions to Armenian studies.Thomson translated into English several Classical Armenian, Syriac and Greek texts as well as having written two textbooks on the Armenian language, one of which is the sole English-language textbook on Classical Armenian.Thomson died in 2018.", "link_mentions": [{"page": "David IV of Georgia", "response": ["According to the Life of King of Kings David, David was the only son of George II. The contemporaneous Armenian chronicler Matthew of Edessa mentions David's brother Totorme, who, according to the modern historian Robert W. Thomson, was his sister. The name of David's mother, , is recorded in a margin note in the Gospel of Matthew from the Tskarostavi monastery; she is otherwise unknown.  David bore the name of the biblical king-prophet, from whom the Georgian Bagratids claimed their descent and whose 78th descendant David was proclaimed to be."]}, {"page": "Robert Thomson", "response": ["* Robert W. Thomson (1934–2018), philologist"]}, {"page": "Dumbarton Oaks", "response": ["*Robert W. Thomson, 1984–1989"]}, {"page": "Gregory of Narek", "response": ["Gregory was the first major Armenian lyrical poet and is considered the most beloved person in Armenian Christianity. Robert W. Thomson described him as the \"most significant poet of the whole Armenian religious tradition,\" while Jos Weitenberg declared him the \"most outstanding theological, mystical and literary figure of Armenian culture.\" James R. Russell lists Gregory as one of the three visionaries of the Armenian tradition, along with Mesrop Mashtots and Yeghishe Charents. Agop Jack Hacikyan et al. note that through his \"lively, vibrant, and highly individual style\" Gregory shaped, refined, and greatly enriched Classical Armenian through his works. According to Hrachik Mirzoyan, Gregory created up to 2,500 new Armenian words, although many of which are not actively used."]}, {"page": "Mkhitar Gosh", "response": ["Mkhitar Gosh (; 1130–1213) or Mkhitar the Thinbearded was an Armenian scholar,Robert W. Thomson. The Lawcode (Datastanagirk') of Mxit'ar Goš. — Rodopi, 2000Antony Eastmond. Tamta's World. — Cambridge University Press, 2017. — P. 126 \"At the same time Mkhitar Gosh (d. 1213), the great Armenian jurist, poet and theologian, worked for the Mkhargrdzelis from the monasteries of Getik and then Goshavank, both of which were sited well away from any large settlements.\" writer, public figure, thinker, and priest. He was one of the representatives of the Armenian Renaissance.Encyclopedia Americana. — Americana Corporation, 1965. — vol. 2. — p. 270:\"The Armenian Renaissance reached its height in this period, with the works of the Vardapet Hovhannes (John) Sarkawag (d. 1129), ... Hetum, author of Narratives of the Tatars and Chronological Tables; Hovhan Erzenkatsi (John of Erzincan), moralist, theologian, poet, and grammarian ; Nerses Lambro- natsi (Nerses of Lambron, 1153-1198), theologian, moralist, and orator ; Mekhitar Gosh (d. 1213), who compiled the Armenian Code\"", "*Robert W. Thomson. The Lawcode (Datastanagirk') of Mxit'ar Goš. — Rodopi, 2000"]}, {"page": "James R. Russell", "response": ["By 1992, Russell was short-listed and soon accepted and was appointed to the Mashtots Chair in Armenian Studies in the Near Eastern Languages and Civilizations Department at Harvard University, succeeding Robert W. Thomson the first holder of that chair since 1969 who had returned to Oxford University in England. Russell occupied the Mashtots Chair from 1993 until his retirement."]}, {"page": "Elishe", "response": ["There is an abridged English translation by Neumann, C. F. (1830)Neumann, C. F. Elisaeus Bishop of the Amadunians: The History of Vartan and of the battle of the Armenians: Containing an account of the religious wars between the Persians and Armenians. London, 1830. and unabridged editions by Dickran H. Boyadjian (1952) and Robert W. Thomson (1982).Ełišēi. History of Vardan and the Armenian War. Translation and Commentary by R. W. Thomson. Cambridge, MA: Harvard University Press, 1982. ."]}, {"page": "Ghazar Parpetsi", "response": ["The History of Armenia, translated into English by Robert W. Thomson (1991)."]}, {"page": "Armenian studies", "response": ["*Robert W. Thomson (born 1934)"]}, {"page": "Movses Khorenatsi", "response": ["Earlier critical points were revived Aram Toptchyan. \"Moïse de Khorène\" in Claude Mutafian (ed.), Arménie, la magie de l'écrit. Somogy, 2007, p. 143. . in the second half of the twentieth century.Toumanoff, Cyril. \"On the Date of Pseudo-Moses of Chorene,\" Handes Amsorya 75 (1961): pp. 467–471.Malkhasiants. \"Nakhaban,\" pp. 3–5, 47–50. For instance Robert W. Thomson, the former holder of the chair in Armenian Studies at Harvard University and the translator of several classical Armenian works, claimed that Movses' account contained various anachronisms.Thomson, Robert W. \"Armenian Literary Culture through the 11th Century.\" in Richard G. Hovannisian (ed.) The Armenian People from Ancient to Modern Times: The Dynastic Periods: From Antiquity to the Fourteenth Century. St. Martin's Press, 1997. . His approach in evaluating Movses's work was criticized when the English translation of History of the Armenians appeared in 1978.Nersessian, Vrej. \"Review of History of the Armenians.\" Journal of Ecclesiastical History 30 (October 1979): pp. 479–480. The points he raised have since been challenged.See  Albert Musheghyan, “Vortegh e gtnvel Movses Khorenatsu hishatakvats Byutanyan?” [Where was the Bithynia Mentioned by Movses Khorenatsi?] Patma-Banasirakan Handes 1 (1990) and idem  “Vaspurakan termini nshanakutyune Hay dasakan matenagrutyan mej” [The Meaning of the Term ‘Vaspurakan’ in Classical Armenian Literature] Iran Nameh 2–3 (1996). Vrej Nersessian, the Curator of the Christian Middle East Section at the British Library, took issue with many of Thomson's points, including his later dating of the writing and his contention that Movses was merely writing an apologist work for the Bagratunis:"]}, {"page": "Family of David IV of Georgia", "response": ["According to the Life of King of Kings David (ცხორებაჲ მეფეთ-მეფისა დავითისი), written  1123–1126, David was the only son of King George II (r. 1072–1089). The contemporaneous Armenian chronicler Matthew of Edessa mentions David's brother Totorme. The latter, according to the modern historian Robert W. Thomson, was his sister. The name of David's mother, Elene, is recorded in a margin note in the Gospel of Matthew from the Tskarostavi monastery; she is otherwise unattested. David bore the name of the biblical king-prophet, whose 78th descendant he was claimed to be."]}]}}