{"wiki_id": "http://www.wikidata.org/entity/Q7350304", "itemLabel": "Robert Taylor", "itemDescription": "English association football player and manager (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Taylor_(footballer,_born_1971)", "wikipedia_page": {"main": "Robert Anthony Taylor (born 30 April 1971) is an English former professional footballer, licensed football agent and manager who is in charge of Watton United.\nAs a player he was a forward and was active as a professional between 1990 and 2003. Although featuring for Wolverhampton Wanderers and Manchester City, he notably had lengthy and prolific spells with Leyton Orient, Brentford and Gillingham. He notably scored for the Gills at Wembley Stadium in the 1999 Division Two Play-off final against Manchester City, only months before he would join The Blues. Taylor also played professionally for Norwich City, Birmingham City, Queens Park Rangers, Grimsby Town and Scunthorpe United. He retired in 2003 following a brief spell with Non-League side Gorleston, although whilst manager of Diss Town he did make three more senior appearances between 2008 and 2012. Since retiring Taylor has managed at Non-League level for Watton United, King's Lynn Town, Dereham Town, Diss Town, Mundford, Swaffham Town and Acle United.", "link_mentions": [{"page": "Gillingham F.C.", "response": ["Goalkeeper Ron Hillyard holds the record for Gillingham appearances, having played 657 matches in all competitions between 1974 and 1990, while the record for appearances solely in the Football League is held by another goalkeeper, John Simpson, with 571 between 1957 and 1972. Brian Yeo is the club's all-time leading league goalscorer, having scored a total of 136 goals between 1963 and 1975.  He also jointly holds the club record for the most Football League goals scored in a single season, having scored 31 goals in the 1973–74 season, equalling the record set by Ernie Morgan in 1954–55.  The highest number of goals scored by a player in a single game at a professional level is the six registered by Fred Cheesmur against Merthyr Town in April 1930.  The highest transfer fee received by the club is £1.5 million for Robert Taylor, paid by Manchester City in 1999, and the highest fee paid by Gillingham is £600,000 for Carl Asaba, signed from Reading in 1998."]}, {"page": "Robert Taylor", "response": ["Robert Taylor may refer to:", "* Robert Taylor (American actor) (1911–1969), American actor ", "* Robert Taylor (animator) (1944–2014), American animator; directed The Nine Lives of Fritz the Cat, TaleSpin and Heidi's Song", "* Robert Taylor (artist) (born 1951), Oklahoma Native artist", "* Robert Taylor (Australian actor) (born 1963), Australian actor, Agent Jones in The Matrix", "* Robert Taylor (British Army officer) (1760–1839), British general", "* Robert Taylor (died 1696), Irish MP for Askeaton", "* Robert Taylor (died 1723) (c. 1682–1723), Irish MP for Askeaton and Tralee", "* Robert Taylor (congressman) (1763–1845), U.S. Representative from Virginia", "* Robert Taylor (Labour politician) (1881–1954), British Member of Parliament for Morpeth, 1935–1954", "* Robert Taylor (Conservative politician) (1932–1981), Conservative MP for Croydon North West, South London, 1970–1981", "* Robert Taylor (archdeacon of Lewes) (fl. 1558–1559)", "* Robert Taylor (Radical) (1784–1844), English clergyman turned freethinker", "* Robert Taylor (provost of Cumbrae) (1873–1944), Anglican priest and author", "* Robert Taylor (footballer, born 1971), English footballer", "* Robert Taylor (footballer, born 1994), Finnish footballer", "* Robert Taylor (cricketer, born 1873) (1873–?), English cricketer", "* Robert Taylor (cricketer, born 1989), Scottish cricketer", "* Robert Taylor (New Zealand cricketer) (1835–1901)", "* Robert Taylor (American football coach) (1940–2006), American football player and coach", "* Robert Taylor (rugby league), rugby league footballer of the 1950s, and 1960s", "* Robert Taylor (rugby union coach) (born 1980), Australian rugby union football coach", "* Robert Taylor (sprinter, born 1948) (1948–2007), American runner, 1972 Olympics gold medal winner in 4 × 100 m relay", "* Robert Taylor (sprinter, born 1953), American runner, 1975 Pan American Games gold medal winner in 4 × 400 m relay", "* Robert Taylor (architect) (1714–1788), English architect", "* Robert Taylor (Australian businessman) (1792–1850), Englishman transported to New South Wales", "* Robert Taylor (mining engineer) (1855–1921), British mining engineer in India", "* Robert Taylor (trade unionist) (1900–1986), Scottish trade union leader", "* Robert Taylor (computer scientist) (1932–2017), American computer scientist", "* Robert Taylor Homes, a housing project in the South Side of Chicago", "* Robert Taylor incident, a 1979 UFO sighting and potential alien abduction in West Lothian, Scotland"]}, {"page": "Tony Pulis", "response": ["Pulis then joined Gillingham in the summer of 1995, whom he managed for a further four seasons, turning a team that had struggled at the very bottom of the Football League into a promotion winning one in his first season, and laying the foundations for the club's eventual elevation to the First Division for the first time in their history. In the 1999 Second Division play-off final, the \"Gills\" were 2–0 up with less than two minutes left, following goals by the prolific partnership of Robert Taylor and Carl Asaba, only to see Manchester City score twice, the equaliser in injury time, and after that win a penalty shoot-out 3–1. Following the defeat, Pulis was controversially sacked by the club amidst claims of gross misconduct. He later brought a £400,000 court case against Gillingham chairman Paul Scally for unpaid bonuses, which was settled out of court in 2001 for £75,000."]}, {"page": "Paul Dickov", "response": ["Dickov retained his place in the first team at the start of the 1999–2000 season. He started each of the first fifteen League games, despite suffering a facial injury on 26 September 1999 in which he lost a tooth. The run of starting appearances came to an end on 27 October, when he damaged knee ligaments in a match against Ipswich Town. During the subsequent absence, Manchester City signed Robert Taylor, and most of Dickov's appearances in the second half of the season were as a substitute. One of these substitute appearances was the final match of the season, a 4–1 win at Blackburn. Dickov scored the fourth Manchester City goal as City clinched promotion to the Premier League."]}, {"page": "Nicky Forster", "response": ["While at Brentford, Forster formed prolific partnerships with Carl Asaba and Robert Taylor, both of whom would later join his former club Gillingham. He made 109 league appearances for Brentford and scored 39 goals during his time at Griffin Park. He was later capped by England at under-21 level soon afterwards. In January 1997, Forster moved to Birmingham City for a fee of £700,000. He made 67 league appearances and scored eleven league goals for the club."]}, {"page": "Carl Asaba", "response": ["After failing to make an impact at Reading, scoring just eight goals in 32 league appearances, Asaba was signed to Gillingham for a club record fee of £590,000. He soon formed a formidable partnership with Robert Taylor and finished the 1998–99 season as the club's top scorer, scoring 23 goals in all competitions. He scored in the season's play-off final against Manchester City, opening the scoring 1–0 to Gillingham in the 81st minute. Strike partner Taylor scored the second in the 86th minute, but a last minute comeback from City took the tie to extra time and then on to penalties, which City won 3–1. In a spell that was dogged by injury, Asaba scored 40 goals in 91 appearances in all competitions."]}, {"page": "Paul Crichton", "response": ["He returned to Burnley in a permanent move on 19 November 1998, costing the Clarets £100,000 and quickly established himself in the Burnley side. He was an ever-present in the 1999–2000 season, as Burnley won promotion to Division One, but the following season lost his place to Greek international goalkeeper Nikolaos Michopoulos. His spell at Burnley may be remembered for his part in one of Burnley's worst ever spells in football. In February 1999, Burnley played Gillingham at Turf Moor, Gillingham won 5–0 with Robert Taylor scoring all 5 goals (at the time it was a post-war record for number of goals scored by one person on an away ground). Things went from bad to worst in the following fixture, again at home, this time to Manchester City as City won 6–0. Crichton was in goal for both games, and although the defence was perhaps more to blame than him, it was the most goals he had conceded in two games."]}, {"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Robert Taylor||||FW||20022002-2003||41||10"]}, {"page": "List of Gillingham F.C. seasons", "response": ["|align=left|Robert Taylor"]}, {"page": "History of Gillingham F.C.", "response": ["In June 1995 a London-based former office supplies salesman, Paul Scally, stepped in and bought the club for a nominal fee. Scally brought in new manager Tony Pulis, who signed almost a complete new team and led Gillingham to promotion in his first season, finishing second in Division Three (now Football League Two). This season was also notable for the fact that the team only conceded 20 league goals – a league record for a 46-game season.The official Football League website  lists this achievement in second place on the overall list of teams who have conceded the fewest goals in a season, behind Liverpool, who conceded 16 in the 1978–79 season, however, as evidenced by the final 1978–79 First Division table , Liverpool played only 42 matches, giving Gillingham the record for a 46-match season. In 1999 Gillingham reached the playoffs, but lost in the Second Division play-off final against Manchester City.  Following goals by the prolific partnership of Robert Taylor and Carl Asaba, the Gills led 2–0 with less than two minutes left, only to see Manchester City score twice, the equaliser in injury time, and then win a penalty shoot-out 3–1."]}, {"page": "List of Gillingham F.C. records and statistics", "response": ["The record for most games played for the club is held by Ron Hillyard, who made 655 appearances between 1974 and 1991. Brian Yeo is the club's record goalscorer, scoring 149 goals during his Gillingham career.  Andrew Crofts holds the record for the most international caps gained as a Gillingham player, having made 12 appearances for Wales.  The highest transfer fee ever paid by the club is the £600,000 paid to Reading for Carl Asaba in 1998, and the highest fee received is the £1,500,000 paid by Manchester City for Robert Taylor in 1999.  The highest attendance recorded at Priestfield was 23,002 for the visit of Queens Park Rangers in 1948.  The club holds one Football League record, having conceded the fewest goals in a 46-match season, when the team conceded only 20 goals during the 1995–96 season."]}, {"page": "1994–95 Football League", "response": ["|align=center| 4|| Robert Taylor || Brentford ||align=center| 23"]}, {"page": "1999 Football League Second Division play-off Final", "response": ["It was Gillingham's first match at Wembley Stadium, although Manchester City had played there on eleven previous occasions.   The final drew a crowd of just under 77,000 and was refereed by Mark Halsey.  The match was scoreless until the 81st minute, when Carl Asaba gave Gillingham the lead. Robert Taylor added a second goal five minutes later.  Kevin Horlock scored for City in the 90th minute to halve the deficit and, in the fifth minute of injury time, Paul Dickov scored an equaliser to make the score 2–2 and send the game into extra time.  With no further goals being scored, the match was decided by a penalty shoot-out, which City won 3–1 to gain promotion.", "Gillingham's opponents for their play-off semi-final were Preston North End, with the first match of the two-legged tie taking place at Deepdale in Preston on 16 May 1999. After a goalless first half, David Eyres put Preston ahead in the 54th minute.  Robert Taylor equalised with 11 minutes to go and the match ended 1–1.  The second leg was held three days later at Priestfield Stadium in Gillingham.  Within two minutes of the start of the match, Gillingham took the lead through Andy Hessenthaler: Barry Ashby passed to Carl Asaba who guided the ball to Hessenthaler to score.  Gillingham dominated the remainder of the half and, despite pressure from Preston after the interval, they held onto their lead; Vince Bartram, the Gillingham goalkeeper, dived full-length across his goal to keep out a strike from Jon Macken.  The match ended 1–0 and Gillingham progressed to the final with a 2–1 aggregate victory.", "|CF ||11||Robert Taylor || "]}, {"page": "Denny Mundee", "response": ["Now behind the 'FT Index' (Nicky Forster and Robert Taylor) in the pecking order up front, Mundee was a regular off the bench in the first half of the 1994–95 season, before finally breaking into the starting line-up in November 1994. He made 45 appearances and scored five goals during a frustrating season, in which the Bees finished second in the Second Division, only to be forced to settle for a play-off place due to the reduction in size of the Premier League and its effect on the league pyramid. Brentford lost on penalties to Huddersfield Town in the semi-finals, with Mundee missing his spot kick in the second leg."]}]}}