{"wiki_id": "http://www.wikidata.org/entity/Q7358871", "itemLabel": "Roger Sainsbury", "itemDescription": "Bishop of Barking", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Sainsbury_(bishop)", "wikipedia_page": {"main": "Roger Frederick Sainsbury (born 2 October 1936) is a retired Anglican bishop. He was the second area Bishop of Barking (the seventh Bishop of Barking) in the Church of England from 1991 to 2002.Sainsbury was educated at Jesus College, Cambridge before beginning his ordained ministry as a curate at Christ Church, Spitalfields. He was then \"missioner\" at Shrewsbury House, Liverpool, Warden of the Mayflower Family Centre, Canning Town; Vicar of Walsall; and finally, before being ordained to the episcopate, the Archdeacon of West Ham. In retirement he serves as an assistant bishop in the Diocese of Bath and Wells.", "link_mentions": [{"page": "Diocese of Bath and Wells", "response": ["*2003–present: Roger Sainsbury, retired area Bishop of Barking, lives in Portishead."]}, {"page": "Sainsbury (surname)", "response": ["*Roger Sainsbury (bishop), British retired Anglican bishop"]}, {"page": "Bishop of Barking", "response": ["|align=\"center\"| 1991 ||align=\"center\"| 2002 || Roger Sainsbury || (b. 1936) "]}, {"page": "Archdeacon of West Ham", "response": ["*1988–1991 (res.): Roger Sainsbury"]}, {"page": "Roger Sainsbury", "response": ["Roger Sainsbury may refer to:", "*Roger Sainsbury (bishop) (born 1936), British retired Anglican bishop", "*Roger Sainsbury (engineer) (born 1940), civil engineer"]}, {"page": "Donald Wright (schoolmaster)", "response": ["Born in Wolverhampton, Wright was the youngest son of the marriage of Charles North Wright and Beatrice May Walker.\"Wright Arthur R D, Walker\" in Register of Births for\tWolverhampton Registration District, vol. 6b (1923), p. 900 His family was \"Church of England, but still touched by a Methodist past\". He was educated at The Downs, a Quaker school, where his teachers included W. H. Auden.Roger Sainsbury, Obituary: Arthur Robert Donald Wright in The Church Times dated 9 November 2012, accessed 31 March 2019"]}, {"page": "Roger Frederick Sainsbury", "response": ["#REDIRECT Roger Sainsbury (bishop)"]}]}}