{"wiki_id": "http://www.wikidata.org/entity/Q7357865", "itemLabel": "Roger Bigod, 5th Earl of Norfolk", "itemDescription": "English peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Bigod,_5th_Earl_of_Norfolk", "wikipedia_page": {"main": "Roger Bigod (c. 1245 – bf. 6 December 1306) was 5th Earl of Norfolk.", "link_mentions": [{"page": "December 6", "response": ["*1306 – Roger Bigod, 5th Earl of Norfolk (b. 1270)"]}, {"page": "1306", "response": ["* December 6 – Roger Bigod, 5th Earl of Norfolk (b. 1270)"]}, {"page": "Edward I of England", "response": ["Opposition from the laity took longer to surface. This resistance focused on two things: the King's right to demand military service, and his right to levy taxes. At the Salisbury parliament of February 1297, Earl Marshal Roger Bigod, 5th Earl of Norfolk, objected to a royal summons of military service. Bigod argued that the military obligation only extended to service alongside the King; if the King intended to sail to Flanders, he could not send his subjects to Gascony. In July, Bigod and Humphrey de Bohun, 3rd Earl of Hereford and Constable of England, drew up a series of complaints known as the Remonstrances, in which objections to the extortionate level of taxation were voiced.. Undeterred, Edward requested another lay subsidy. This one was particularly provocative, because the King had sought consent only from a small group of magnates, rather than from representatives from the communities in parliament. While Edward was in Winchelsea, preparing for the campaign in Flanders, Bigod and Bohun turned up at the Exchequer to prevent the collection of the tax. As the King left the country with a greatly reduced force, the kingdom seemed to be on the verge of civil war. What resolved the situation was the English defeat by the Scots at the Battle of Stirling Bridge. The renewed threat to the homeland gave king and magnates common cause. Edward signed the Confirmatio cartaruma confirmation of Magna Carta and its accompanying Charter of the Forestand the nobility agreed to serve with the King on a campaign in Scotland."]}, {"page": "Duke of Norfolk", "response": ["Before the Dukes of Norfolk, there were the Bigod Earls of Norfolk, starting with Roger Bigod from Normandy (died 1107). Their male line ended with Roger Bigod, 5th Earl of Norfolk, who died without an heir in 1306, so their titles and estates reverted to the crown. Edward II then granted his brother, Thomas of Brotherton, the title of Earl of Norfolk in 1312. It passed to Thomas's daughter (and granddaughter of Edward I), Margaret, and then to her grandson, Thomas Mowbray."]}, {"page": "Bungay", "response": ["Bungay Castle, which is shown on Bungay's town sign,  was built by the Normans but was later rebuilt by Roger Bigod, 5th Earl of Norfolk and his family, who also owned Framlingham Castle. The castle contains a unique surviving example of mining galleries, dating to the siege of the castle in 1174. They were intended to undermine and thus collapse the castle's tower and keep."]}, {"page": "Bungay Castle", "response": ["The site was subsequently restored yet again to the Bigods and was further developed in 1294 by Roger Bigod, 5th Earl of Norfolk, who probably built the massive gate towers on the site. Roger fell out with Edward I and after his death the castle reverted to the Crown, falling into disrepair and ruin. From 1483, it was primarily owned by the Dukes of Norfolk until the 20th century.Visiting Bungay Castle , Bungay Suffolk, accessed 24 April 2011."]}, {"page": "Earl Marshal", "response": ["* Roger Bigod, 5th Earl of Norfolk 1269–1306"]}, {"page": "Earl of Norfolk", "response": ["*Roger Bigod, 5th Earl of Norfolk (died 1306)"]}, {"page": "Tintern Abbey", "response": ["The Abbey was mostly rebuilt during the 13th century, starting with the cloisters and domestic ranges, and finally the great church between 1269 and 1301. The first mass in the rebuilt presbytery was recorded to have taken place in 1288, and the building was consecrated in 1301, although building work continued for several decades. Roger Bigod, 5th Earl of Norfolk, the then lord of Chepstow, was a generous benefactor; his monumental undertaking was the rebuilding of the church. The earl's coat of arms was included in the glasswork of the Abbey's east window in recognition of his contribution."]}, {"page": "Chepstow", "response": ["The castle was expanded by William Marshal in the late twelfth century and, a century later, by Roger Bigod, 5th Earl of Norfolk.  Bigod was also responsible for establishing a weekly market and annual fair, in the town which had grown up on the slopes between the castle and priory, and for building the Port Wall around it shortly after 1274.  A toll gate controlled entry to the market area; this Town Gate was rebuilt in the 16th century.  The town faced some hostile attacks from the Welsh to the west, but after the 14th century the castle's importance diminished.Rick Turner and Andy Johnson (eds.), Chepstow Castle – its history and buildings, Logaston Press, 2006, , pp.207–211  The port of Chepstow developed during the mediaeval period, one reason being that its control by a Marcher Lord, rather than by the King, meant that it was exempt from English taxation.  It mainly traded in timber and bark from the Wye Valley, and with Bristol.  From mediaeval times, Chepstow was the largest port in Wales; its ships sailed as far as Iceland and Turkey, as well as to France and Portugal, and the town was known for its imports of wine."]}, {"page": "Roger Bigod, 4th Earl of Norfolk", "response": ["Roger had no children, and was succeeded by his nephew Roger Bigod, 5th Earl of Norfolk (1245-1306)."]}, {"page": "John II, Count of Holland", "response": ["# Alice or Alix (d. 26 October 1317), who married 1290 Roger Bigod, 5th Earl of Norfolk, by whom she had no issue."]}, {"page": "Hugh Bigod (Justiciar)", "response": ["*Roger Bigod, 5th Earl of Norfolk, who married firstly Aline Basset, and secondly Alice of Hainault, but had no issue by either marriage.", "*John Bigod, a cleric, who was heir to his elder brother, Roger Bigod, 5th Earl of Norfolk."]}, {"page": "Eleanor of Castile", "response": ["Their household records witness incidents that imply a comfortable, even humorous, relationship. Each year on Easter Monday, Edward let Eleanor's ladies trap him in his bed and paid them a token ransom so he could go to her bedroom on the first day after Lent; so important was this custom to him that in 1291, on the first Easter Monday after Eleanor's death, he gave her ladies the money he would have given them had she been alive. Edward disliked ceremonies and in 1290 refused to attend the marriage of Earl Marshal Roger Bigod, 5th Earl of Norfolk; Eleanor thoughtfully (or resignedly) paid minstrels to play for him while he sat alone during the wedding."]}, {"page": "Thomas of Brotherton, 1st Earl of Norfolk", "response": ["Thomas's father died when he was 7 years old. Thomas's half-brother Edward, became king of England, as \"King Edward II\", and Thomas was heir presumptive until his nephew, the future King Edward III, was born in 1312. The Earldom of Cornwall had been intended for Thomas, but his brother the King instead bestowed it upon his favourite, Piers Gaveston, in 1306. When Thomas was 10 years old, King Edward II assigned to him and his brother Edmund, the estates of Roger Bigod, 5th Earl of Norfolk, who had died without heirs in 1306."]}, {"page": "Chepstow Castle", "response": ["In 1270, the castle was inherited by Roger Bigod, 5th Earl of Norfolk, who was a grandson of William Marshal's eldest daughter, Maud. He constructed a new range of buildings in the Lower Bailey, as accommodation for himself and his family.  Bigod was also responsible for building Chepstow's town wall, the \"Port Wall\", around 1274–78. The castle was visited by King Edward I in 1284, at the end of his triumphal tour through Wales.  Soon afterwards, Bigod had built a new tower (later known as \"Marten's Tower\"), which now dominates the landward approach to the castle, and also remodelled the Great Tower."]}, {"page": "List of the titled nobility of England and Ireland 1300–1309", "response": ["|align=center| Norfolk || Roger Bigod, 5th Earl of Norfolk || 25 July 1270 || shortly bef. 6 December 1306 || Nephew of Roger Bigod, 4th Earl of Norfolk. Died without issue."]}, {"page": "Roger Bigod", "response": ["*Roger Bigod, 5th Earl of Norfolk (1245 – 1306)"]}, {"page": "Bigod family", "response": ["*Roger Bigod, 5th Earl of Norfolk, son of Hugh Bigod (Justiciar), heir of 4th earl. No male issue, lands and titles revert to crown"]}, {"page": "List of peers 1290–1299", "response": ["|Earl of Norfolk (1140)||Roger Bigod, 5th Earl of Norfolk||1270||1306||"]}, {"page": "List of peers 1280–1289", "response": ["|Earl of Norfolk (1140)||Roger Bigod, 5th Earl of Norfolk||1270||1306||"]}, {"page": "Roger Bigod, Fifth Earl of Norfolk", "response": ["#redirect Roger Bigod, 5th Earl of Norfolk"]}, {"page": "Roger Bigod, fifth Earl of Norfolk", "response": ["#redirect Roger Bigod, 5th Earl of Norfolk"]}, {"page": "Roger Bigod (5th Earl of Norfolk)", "response": ["#redirect Roger Bigod, 5th Earl of Norfolk"]}, {"page": "Striguil", "response": ["The Marcher lordship of Striguil was established by William fitz Osbern, who started the building of the castle at Chepstow.  On his death in 1071 the lordship passed to his son, Roger de Breteuil, but he plotted against King William, was captured and imprisoned, and had his estates forfeited.  The lordship then reverted to the English crown until about 1115, when it was granted to Walter fitz Richard de Clare, the son of Richard fitz Gilbert.  It remained with the de Clare family, including Richard de Clare known as \"Strongbow\", before passing to William Marshal on his marriage to Richard's daughter Isabel in 1189. It then passed in turn to Marshal's sons, the last of whom, Anselm, died without issue in 1245.  The Lordship of Striguil was then divided into several parts, with Chepstow and Netherwent being  allotted to Marshal's grandson, Roger Bigod, 5th Earl of Norfolk, and the castles at Trellech and Usk, and their surrounding areas, forming new lordships under other members of the family.  The area of the lordship extended east of the River Wye to take in the manors of Tidenham, Woolaston, Beachley and Lancaut, which became part of Gloucestershire in 1535 under the Laws in Wales Act."]}, {"page": "Count of Hainaut", "response": ["rect 308 1116 391 1141 Roger Bigod, 5th Earl of Norfolk"]}, {"page": "1300s in England", "response": ["** Roger Bigod, 5th Earl of Norfolk (born 1270)"]}, {"page": "Devauden", "response": ["Chepstow Park Wood, located immediately south of the village towards Itton, is an extensive area of mixed woodland owned and managed by the Forestry Commission,Forestry Commission popular with walkers. It was established as a hunting forest around 1280 by Roger Bigod, 5th Earl of Norfolk, the lord of Striguil or Chepstow Castle. It covers about 3,300 hectares, and was originally enclosed by a fence stretching 7.8 km.  Around 1340, it was occupied and taken over by a band of outlaws led by William de Derneford and his son Robert. It was re-enclosed with a stone wall around 1630, and at the same time a stone lodge was built in the centre of the forest, with views back towards Chepstow, for the use of visitors to the forest.Rick Turner and Andy Johnson (eds.), Chepstow Castle - its history and buildings, 2006,  Later, the wood became notorious as a haunt of highwaymen. Historically, the woodland lay within the parish of Newchurch East.Vision of Britain"]}, {"page": "Ballymoon Castle", "response": ["Ballymoon Castle is thought to have been built in the 13th century or early 14th century. Much of the history has been lost, but it is thought to have been built by Roger Bigod, 5th Earl of Norfolk, in the turbulent times, or by the Carew family, who acquired the land when Bigod died without issue. In the late 1800s, the castle was bought by Michael Sheill from Wexford who established a number of local businesses."]}, {"page": "England in the Late Middle Ages", "response": ["Edward was less successful in Gascony, which was overrun by the French. His commitments were beginning to outweigh his resources. Chronic debts had been incurred by wars against Flanders and Gascony in France, and Wales and Scotland in Britain. The clergy refused to pay their share of the costs, with the Archbishop of Canterbury threatening excommunication; Parliament was reluctant to contribute to Edward's expensive and unsuccessful military policies. Humphrey de Bohun, 3rd Earl of Hereford and Roger Bigod, 5th Earl of Norfolk, refused to serve in Gascony, and the barons presented a formal statement of their grievances. Edward was forced to reconfirm the charters (including Magna Carta) to obtain the money he required. A truce and peace treaty with the French king restored the duchy of Gascony to Edward. Meanwhile, William Wallace had risen in Balliol's name and recovered most of Scotland, before being defeated at the Battle of Falkirk. Edward summoned a full Parliament, including elected Scottish representatives for the settlement of Scotland. The new government in Scotland featured Robert the Bruce, but he rebelled and was crowned king of Scotland. Despite failing health, Edward was carried north to pursue another campaign, but he died en route at Burgh by Sands. Even though Edward had requested that his bones should be carried on Scottish campaigns and that his heart be taken to the Holy Land, he was buried at Westminster Abbey in a plain black marble tomb that in later years was painted with the words Scottorum malleus (Hammer of the Scots) and Pactum serva (Honour the vow). He was succeeded by his son as Edward II."]}, {"page": "Philip Basset", "response": ["* Aline, who  married firstly Hugh le Despencer, 1st Baron le Despencer and secondly Roger Bigod, 5th Earl of Norfolk"]}, {"page": "Philippa of Luxembourg", "response": ["* Alix (died 1317), wife of Roger Bigod, 5th Earl of Norfolk"]}, {"page": "Gilbert de Lyvet", "response": ["Geoffrey de Lyvet, likely Gilbert's son, owned a \"great stone hall\" in the city, according to contemporaneous records. Sir Philip de Lyvet, Knight, probably also a son of Gilbert, was identified in early records as a \"kinsman\" of William Brun, one of Dublin's most important citizens. In 1278, Sir Gilbert Lyvet, Knight, is listed in a petition of Maurice FitzMaurice to the King and Council. Sir Gilbert Lyvet was also an active businessman in the city. Reginald Lyvet, probably either a son or grandson of Gilbert, was named by Roger Bigod, 5th Earl of Norfolk and marshall of England, as Bigod's Irish attorney for the year in which Bigod would be away in Wales on the King's business."]}]}}