{"wiki_id": "http://www.wikidata.org/entity/Q7351312", "itemLabel": "Robert Yelverton Tyrrell", "itemDescription": "Irish classical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Yelverton_Tyrrell", "wikipedia_page": {"main": "Robert Yelverton Tyrrell, FBA (January 21, 1844 – September 19, 1914) was an Irish classical scholar who was Regius Professor of Greek at Trinity College, Dublin.", "link_mentions": [{"page": "Oliver St. John Gogarty", "response": ["A serious interest in poetry and literature also began to manifest itself during his years at Trinity.  His witty conversation made him a favourite with the dons, particularly John Pentland Mahaffy (formerly the tutor of Oscar Wilde) and Robert Yelverton Tyrrell, and between 1901 and 1903 he won three successive Vice-Chancellor's prizes for verse.  In 1900 he made the acquaintance of W. B. Yeats (of whom his mother highly approved) and of George Moore (of whom she did not) and began to frequent Dublin literary circles.O'Connor, pp. 29–30 He also formed close friendships with other up-and-coming young poets, such as Seamus O'Sullivan and James Joyce.  In 1904 he spent two terms at Oxford to compete for the Newdigate Prize, but lost to G.K.A. Bell, the future Bishop of Chichester, who became a friend and frequent correspondent over the next few years.O'Connor, pp71-75"]}, {"page": "The Acharnians", "response": ["* Robert Yelverton Tyrrell, 1883 – verse: full text"]}, {"page": "George Tyrrell", "response": ["Tyrrell was born on 6 February 1861 in Dublin, Ireland. His father, a journalist, died shortly before Tyrrell was born. George was first cousin to Irish classical scholar Robert Yelverton Tyrrell. A childhood accident resulted in George eventually becoming deaf in the right ear.Tyrrell, George. Autobiography of George Tyrrell, 1861-1884, Longmans, Green & Company, 1912, p. 33 The family had to move repeatedly due to financial straits."]}, {"page": "Regius Professor of Greek (Dublin)", "response": ["* Robert Yelverton Tyrrell 1880–1898"]}, {"page": "John Kells Ingram", "response": ["It was set to music for voice and piano in 1845 by John Edward Pigot. Ingram's ballad was translated into Latin by Robert Yelverton Tyrrell and into Irish by Dr. Douglas Hyde. The song became a popular Irish nationalist anthem. It is one of the best-known of Irish Republican songs and often played by the piper at Republican funerals."]}, {"page": "Tyrrell, Robert Yelverton, Ll.D., D.C.L.", "response": ["#REDIRECT Robert Yelverton Tyrrell"]}]}}