{"wiki_id": "http://www.wikidata.org/entity/Q7358194", "itemLabel": "Roger Fleetwood-Hesketh", "itemDescription": "British politician (1902-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Fleetwood-Hesketh", "wikipedia_page": {"main": "Lieutenant-Colonel Roger Fleetwood Hesketh  (28 July 1902 – 14 November 1987), born Roger Bibby-Hesketh, was a Conservative Party politician in the United Kingdom. He was Member of Parliament (MP) for Southport from 1952 to 1959.", "link_mentions": [{"page": "Operation Fortitude", "response": ["In his 2000 book, Fortitude: The D-Day Deception Campaign, Roger Fleetwood-Hesketh, who was a member of Ops (B), concluded, \"No evidence has so far been found to show that wireless deception or visual misdirection made any contribution to Fortitude North\". It is thought that the Germans were not actually monitoring the radio traffic that was being simulated.Hesketh, p. 167"]}, {"page": "Stretton, Rutland", "response": ["The Ram Jam Inn (former Winchelsea Arms), situated on the Great North Road next to a service station, is (just) in the parish of Greetham. It was bought by the then-owner of Stocken Hall,  Major Charles Fleetwood-Hesketh (1871–1947), in the 1920s, who transformed it into a well-known roadside inn. He was also a Deputy Lieutenant of Lancashire, as was his son, Roger Fleetwood-Hesketh, who became a Conservative MP. Geno Washington & the Ram Jam Band took their name from the inn in the 1960s. Also in the parish of Greetham is the former Greetham Inn (previously the New Inn)."]}, {"page": "Southport (UK Parliament constituency)", "response": ["| style=\"background-color: \" | || 1952 by-election || Roger Fleetwood-Hesketh || Conservative"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| Roger Fleetwood-Hesketh"]}, {"page": "SS City of Benares", "response": ["City of Benares was part of convoy OB-213 and was being used as an evacuee ship in the overseas evacuation scheme organised by CORB. She was carrying 90 child evacuee passengers who were being evacuated from wartime Britain to Canada. Also aboard were Mary Cornish, an accomplished classical pianist who had volunteered as a children's escort; James Baldwin-Webb, a parliamentarian; Rudolf Olden an exiled German writer, and his wife; documentary director Ruby Grierson; Anne Fleetwood-Hesketh, mother of Roger Fleetwood-Hesketh; 15-year-old Anthony Quinton, with his mother, Letitia; Monika Mann with her husband; and the miners' leader William Golightly. The ship left Liverpool on 13 September 1940, bound for the Canadian ports of Quebec and Montreal, under the command of her Master, Landles Nicoll. She was the flagship of the convoy commodore Rear Admiral E.J.G. Mackinnon DSO RN and the first ship in the centre column."]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Roger Fleetwood-Hesketh"]}, {"page": "1987 in the United Kingdom", "response": ["* 14 November – Roger Fleetwood-Hesketh, soldier and politician (born 1902)"]}]}}