{"wiki_id": "http://www.wikidata.org/entity/Q7358030", "itemLabel": "Roger Coulam", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Coulam", "wikipedia_page": {"main": "Roger Keith Coulam, (born 21 August 1940, Blackburn, Lancashire, England, died October 2005), was a British keyboard session musician, who formed Blue Mink in the autumn of 1969, with Madeline Bell (vocalist), Roger Cook (vocalist), Alan Parker (guitarist), Herbie Flowers (bassist), and Barry Morgan (drummer).", "link_mentions": [{"page": "Jimmie Nicol", "response": ["In 1964 Nicol helped to form The Shubdubs with former Merseybeats bassist Bob Garner, a jazz line-up similar in musical style to Georgie Fame and the Blue Flames, a group with whom Nicol had sat-in with when they were the resident house band at London's now defunct Flamingo Jazz Club. Other members of The Shubdubs were Tony Allen (vocals), Johnny Harris (trumpet), Quincy Davis (tenor saxophone), and Roger Coulam (organ – went on to form Blue Mink). It was at this point that he received a telephone call from the Beatles' producer, George Martin. Nicol recalled: \"I was having a bit of a lie down after lunch when the phone rang.\""]}, {"page": "Iain Matthews", "response": ["In 1969 Matthews recorded his debut solo album,  Matthews' Southern Comfort, which was rooted in American country music and rockabilly. He made the album with ex-Fairport colleagues Richard Thompson, Simon Nicol and Ashley Hutchings, plus guitarist Mark Griffiths, drummers Ray Duffy and Gerry Conway, pedal steel guitarist Gordon Huntley, and keyboardists Dolly Collins and Roger Coulam. This was his first significant experience as a songwriter, although the band did also cover versions of Neil Young and Ian and Sylvia songs. He followed it up by forming a working band, Matthews Southern Comfort (using the name of his first album, but without the apostrophe), releasing two more albums in short succession, Second Spring (1970 – UK #52) and Later That Same Year (1970)."]}, {"page": "Nilsson Schmilsson", "response": ["* Roger Coulam – organ on 5"]}, {"page": "Blue Mink", "response": ["Roger Coulam (keyboards) formed the band in the autumn of 1969, with American-born Madeline Bell (vocalist), Roger Cook (vocalist), Alan Parker (guitarist), Herbie Flowers (bassist), and Barry Morgan (drummer). Most of the songs were written by Cook and Roger Greenaway. Flowers, Morgan and Parker all worked with Coulam at London's Morgan Studios. The four of them recorded several backing tracks, with which Coulam approached Bell and Greenaway, (who had been half of David and Jonathan), as vocalists. Greenaway declined, but put forward Cook (the other half of David and Jonathan)."]}, {"page": "Histoire de Melody Nelson", "response": ["* Roger Coulam – keyboards"]}, {"page": "CCS (band)", "response": ["Formed in 1970 by musical director John Cameron and record producer Mickie Most, CCS consisted largely of session musicians, and was created primarily as a recording outfit. The personnel also included Peter Thorup, vocals; Alan Parker, guitar; Harold McNair, flute; Herbie Flowers, bass; Roger Coulam, keyboards; Barry Morgan, drums; plus Don Lusher and Bill Geldard, trombone. Some of the musicians were also members of Blue Mink."]}, {"page": "Roger Cook (songwriter)", "response": ["As a performer Cook is best remembered as a member of Blue Mink, sharing lead vocals with Madeline Bell. The group was formed in 1969, primarily as a producer's outfit, featuring a wealth of top session musicians including Herbie Flowers (bassist), Alan Parker (guitarist), Roger Coulam (keyboardist) and Barry Morgan (drummer), who were simultaneously members of the jazz / rock / big band fusion outfit CCS, another mainly recording act."]}, {"page": "Later That Same Year", "response": ["*Roger Coulam - piano"]}, {"page": "Matthews' Southern Comfort (album)", "response": ["*Roger Coulam - piano & Hammond organ"]}, {"page": "Johnny Harris (musician)", "response": ["Johnny Harris was born in Edinburgh, Scotland to Welsh parents and was a graduate of the Guildhall School of Music in London. He was originally a trumpet player with the Norman Burns band and big bands led by Vic Lewis, Ken Mackintosh, Cyril Stapleton and then a member of the short-lived beat group The Shubdubs with drummer Jimmie Nicol and organist Roger Coulam. In 1964, he recorded a Beatles cover version album and EP called Beatlemania with Jimmie Nicol which resulted in Nicol replacing the ill Ringo Starr on a worldwide Beatles tour."]}, {"page": "Barbados Sky", "response": ["Barbados Sky is the first and only LP released by Typically Tropical, released in 1975. It was most famous for its hit single \"Barbados\".[ \"Biography by Amy Hanson\"]. Allmusic.com. Retrieved 10 September 2010. The musicians included top session players Chris Spedding, Roger Coulam, Vic Flick, Joe Moretti, Clem Cattini and Alan Caddy."]}, {"page": "J.W. Hodkinson", "response": ["Hodkinson was born in Leigh, Lancashire, now in Greater Manchester, England. After performing as Johnny Goode, with Larry Parnes' \"The Big New Rock 'n' Trad Spectacular\", and billed as a \"Teenage Idol\" with Billy Raymond, Georgie Fame, Billy Fury and Jimmie Nicol, in 1961, he recorded, as Tony Allen, the first of a series of 45s for Philips, all with arrangements by Ivor Raymonde. In 1966, he sang the theme track for the United Artists spy thriller movie Triple Cross, starring Christopher Plummer and Yul Brynner. In 1964, he joined The Shubdubs with Jimmie Nicol, Bob Garner, Johnny Harris, Quincy Davis, and Roger Coulam."]}, {"page": "Only When I Laugh (album)", "response": ["*Keyboards: Ann Odell, Roger Coulam"]}, {"page": "Good Morning Freedom", "response": ["* Roger Coulam – keyboards"]}]}}