{"wiki_id": "http://www.wikidata.org/entity/Q7358162", "itemLabel": "Roger Evans", "itemDescription": "British Army general (1886-1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Evans_(British_Army_officer)", "wikipedia_page": {"main": "Major-General Roger Evans  (9 January 1886 – 22 October 1968) was a British Army officer who commanded the 1st Armoured Division during the early stages of the Second World War.\n\n", "link_mentions": [{"page": "Operation Cycle", "response": ["On 20 May, the 2nd Panzer Division advanced  to Abbeville on the English Channel, overran the 25th Infantry Brigade of the 50th (Northumbrian) Infantry Division and captured the town at  Only a few British survivors managed to retreat to the south bank of the Somme. At  on 21 May, the III Battalion, Rifle Regiment 2 reached the coast, west of Noyelles-sur-Mer. The 1st Armoured Division (Major-General Roger Evans) had arrived in France from 15 May without artillery, short of an armoured regiment and the infantry of the Support Group, which had been diverted to Calais. From 4 June to 4 July the Franco-British forces south of the Abbeville bridgehead, held by the German 2nd Panzer Division, then the 57th Infantry Division, recaptured about half of the area; the Allied forces lost many of their tanks and the Germans much of their infantry, some units running back over the River Somme. On 5 June, the German 4th Army attacked out of the remains of their bridgeheads south of the Somme and the Franco-British divisions opposite, drastically depleted by their counter-attacks of the previous four weeks, were pushed back to the Bresle with many casualties."]}, {"page": "5th Royal Inniskilling Dragoon Guards", "response": ["*1937–1947: Maj-Gen. Roger Evans, CB, MC"]}, {"page": "Frederick E. Morgan", "response": ["On 8 August 1939, just a few weeks before the outbreak of the Second World War, Morgan was promoted to the temporary rank of brigadier and assumed command of the 1st Support Group of Major-General Roger Evans's 1st Armoured Division. When the 1st Support Group was shipped to France shortly after the German invasion of France in mid-May 1940 it had already been stripped of its two field artillery regiments and two infantry battalions. As a result, Morgan's command included only a force of Royal Engineers and a Territorial Army (TA) battalion of the Royal Welch Fusiliers, which was in the process of converting to an anti-aircraft/anti-tank regiment and armed only with anti-tank guns. His group was, therefore, in no position to fulfil its normal role supporting the division's armoured brigades and so was sent to reinforce the 51st (Highland) Infantry Division south of the River Somme. During a confused retreat most of the 1st Support Group was captured along with the 51st Division at Saint-Valery-en-Caux but the remainder, including Morgan, got away and were evacuated to England."]}, {"page": "John Crocker", "response": ["Crocker was not to remain there long, however, as on 21 April 1940 he was promoted to the acting rank of brigadier and was appointed to command of the 3rd Armoured Brigade. The brigade formed part of Major-General Roger Evans's 1st Armoured Division (formerly the Mobile Division), then serving in England but preparing to move to France. Crocker's brigade was depleted as the British Expeditionary Force (BEF) was expelled from the continent during the Battle of France in May–June 1940. Landed at Cherbourg as the rest of the BEF retreated to Dunkirk in late May, the division unsuccessfully attacked the German bridgeheads over the River Somme before returning to Cherbourg where the remnants (including the brigade's last 13 tanks) were evacuated. Crocker and his brigade were evacuated in mid-June, Crocker himself returning with Lieutenant-General James Marshall-Cornwall on the last ship.Mead, p. 106Delaney, pps. 128-129"]}, {"page": "Charles Keightley", "response": ["In 1940, during the Second World War, he was appointed as Assistant Adjutant & Quartermaster General (chief administrative officer) of the 1st Armoured Division, then commanded by Major-General Roger Evans, during that division's deployment to France. After the evacuation from France the division reformed back in England. On 13 May 1941, Keightley, on promotion to the acting rank of brigadier, was given command of the 30th Armoured Brigade, part of the 11th Armoured Division, which by this time was commanded by Major-General Percy Hobart. He was appointed an Officer of the Order of the British Empire in July 1941."]}, {"page": "Structure of the British Army in 1939", "response": ["** Headquarters, 1st Armoured Division commanded by Major General Roger Evans"]}, {"page": "Edward Alexander Wilmot Williams", "response": ["He was still adjutant upon the outbreak of World War II in September. By then the battalion, alongside the 1st Rifle Brigade (The Prince Consort's Own), formed the infantry component of the 1st Support Group, under Brigadier Frederick Morgan, of the 1st Armoured Division, now under Major General Roger Evans. Instead of being sent to France to join the British Expeditionary Force (BEF), however, the division remained in the United Kingdom. In late April 1940 the 2nd KRRC, now under Lieutenant Colonel Euan Miller, and the 1st Rifle Brigade were transferred to the 30th Infantry Brigade, under Brigadier Claude Nicholson, and was initially to be sent to Norway to fight in the Norwegian Campaign. However, the German Army invaded France and the brigade was instead sent, in mid-May, to Calais, France, where, despite fighting bravely for several days, the 30th Brigade, along with most of the battalion, including Williams and Miller, the battalion's Commanding Officer (CO), was forced to surrender, most spending the rest of the conflict as a prisoner of war (POW)."]}, {"page": "Vyvyan Pope", "response": ["On the outbreak of the Second World War in September 1939, Pope was appointed Chief of Staff to II Corps, which had been mobilised at Salisbury under Brooke's command.Lewin 1976, p. 101. Pope designed II Corps' badge of a salmon leaping over a stylised \"brook\", as a play on his commander's name.Lewin 1976, p. 101n. At the end of September 1939 the corps crossed to France to join the British Expeditionary Force (BEF). Pope went with them, but returned to England in December to take command of the 3rd Armoured Brigade, part of Major General Roger Evans's 1st Armoured Division.Generals.dkLewin 1976, pp. 105–6. In April 1940, he was appointed Inspector of the Royal Armoured Corps (RAC).Lewin 1976, pp. 107–118. He was then posted as Adviser on Armoured Fighting Vehicles (AFV) on General Lord Gort's staff at BEF headquarters in France. He soon contrived to become more closely involved in the fighting and was a prominent commander in the Allied counter-attack at Arras on 21 May, which, although it did not halt the advancing Germans, shook their confidence.Mead, p. 358"]}, {"page": "Battle of Abbeville", "response": ["The 1st Armoured Division (Major-General Roger Evans) arrived in France from 15 May without artillery, short of an armoured regiment and the infantry of the 1st Support Group, which had been diverted to Calais. From 27 May to 4 June, attacks by the Franco-British force south of the Abbeville bridgehead, held by the 2nd Panzer Division, then the 57th Infantry Division, recaptured about half of the area; the Allied forces lost many of their tanks and the Germans much of their infantry, some units running back over the River Somme. On 5 June, the divisions of the German 4th Army attacked out of the bridgeheads south of the Somme and pushed back the Franco-British divisions opposite, which had been much depleted by their counter-attacks, to the Bresle with many casualties."]}, {"page": "1st Armoured Division (United Kingdom)", "response": ["When Brooke was promoted, his replacement was Major-General Roger Evans, a cavalry officer.", "The 1st Armoured Division first saw service during the Second World War in incomplete form under the command of Major-General Roger EvansJoslen, p. 13 when the second British Expeditionary Force was sent to France in May 1940.Chappell, p.12 The 1st Armoured Division, consisting of the understrength 2nd and 3rd Armoured Brigades, along with the 1st Support Group, and with no infantry support (which had been transferred in April to form the 30th Infantry Brigade), landed in France on 14 May 1940Joslen, p. 15 and, after suffering heavy tank losses during the Battle of France, was evacuated to England on 16 June, having fought south of the river Somme, isolated from the other British formations."]}, {"page": "Roger Evans", "response": ["Roger Evans may refer to:", "* Roger Evans (London politician) (born 1964), member of the London Assembly", "* Roger Evans (British Army officer) (1886–1968), British Army officer", "* Roger Evans (footballer) (1879–?), Welsh footballer", "* Roger Evans, a character in the TV series Sister, Sister"]}, {"page": "Thomas Needham Furnival Wilson", "response": ["Promoted on 1 January 1932 to the brevet rank of major, and major on 27 July 1932, Wilson served for just under three years, from March 1932 to January 1935, as Commander of the Company of Gentleman Cadets at the Royal Military College, Sandhurst. Promoted to the brevet rank of lieutenant colonel on 1 January 1936, he then returned to the War Office, this time serving as Deputy Assistant Adjutant-General, from February 1936. Relinquishing this post on 18 January 1938, he was made Military Assistant to the Chief of the Imperial General Staff (CIGS), then General Lord Gort. On 1 August 1938 he was promoted to lieutenant colonel and succeeded Lieutenant Colonel Evelyn Barker, a fellow KRRC officer and student at the Staff College, as Commanding officer (CO) of the 2nd Battalion, KRRC. The battalion was then serving in England as part of the Mobile Division (later the 1st Armoured Division), then under Major General Roger Evans. Wilson commanded the battalion until the outbreak of the Second World War in September 1939."]}, {"page": "General Evans", "response": ["*Roger Evans (British Army officer) (1886–1968), British Army major general"]}]}}