{"wiki_id": "http://www.wikidata.org/entity/Q735824", "itemLabel": "Johnny Douglas", "itemDescription": "Cricket player of England (1882-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Johnny_Douglas", "wikipedia_page": {"main": "John William Henry Tyler Douglas (3 September 1882 – 19 December 1930) was an English cricketer who was active in the early decades of the twentieth century. Douglas was an all-rounder who played for Essex County Cricket Club from 1901 to 1928 and captained the county from 1911 to 1928. He also played for England and captained the England team both before and after the First World War with markedly different success. As well as playing cricket, Douglas was a notable amateur boxer who won the middleweight gold medal at the 1908 Olympic Games.", "link_mentions": [{"page": "September 3", "response": ["*1882 – Johnny Douglas, English cricketer and boxer (d. 1930)"]}, {"page": "W. G. Grace", "response": ["Having ended his international career in 1899, Grace then began the last phase of his overall first-class career when he joined the new London County Cricket Club, based at Crystal Palace Park, which played first-class matches between 1900 and 1904.Gibson, p. 57.Christopher Martin-Jenkins: The Wisden Book of County Cricket (1981), p. 441. Grace's presence initially attracted other leading players into the team, including C. B. Fry, Ranjitsinhji and Johnny Douglas, but the increased importance of the County Championship, combined with Grace's inevitable decline in form and the lack of a competitive element in London's matches, led to reduced attendances and consequently the club lost money.Midwinter, pp. 144–146. Nevertheless, Grace remained an attraction and could still produce good performances. As late as 1902, though aged 54 by the end of the season, he scored 1,187 runs in first-class cricket, with two centuries, at an average of 37.09. London's final first-class matches were played in 1904 and the enterprise folded in 1908.Midwinter, p. 146."]}, {"page": "Douglas (surname)", "response": ["* Johnny Douglas (conductor) (1920–2003), English composer, musical director and conductor", "* Johnny Douglas (1882–1930), English cricketer"]}, {"page": "Crystal Palace National Sports Centre", "response": ["London County Cricket Club was a short-lived cricket club founded by the Crystal Palace Company. In 1898 they invited W. G. Grace to help them form a first-class cricket club. Grace accepted the offer and became the club's secretary, manager and captain. As a result, he severed his connection with Gloucestershire County Cricket Club during the 1899 season. The club played first-class matches from 1900 to 1904.Alan Gibson: The Cricket Captains of England (1989), p57.Christopher Martin-Jenkins: The Wisden Book of County Cricket (1981), p441. Some of the best players of the time played some matches for the club while continuing to play for their usual teams, among them CB Fry, Johnny Douglas and K S Ranjitsinhji. However, the games were little more than exhibition games — and money-making exercises for Dr Grace — and so it quickly lost its first-class status, and with that the ability to attract the top players. The club folded in 1908."]}, {"page": "Australia national cricket team", "response": ["Test cricket resumed in the 1920/21 season in Australia with a touring English team, captained by Johnny Douglas losing all five Tests to Australia, captained by the \"Big Ship\" Warwick Armstrong. Several players from before the war, including Warwick Armstrong, Charlie Macartney, Charles Kelleway, Warren Bardsley and the wicket-keeper Sammy Carter, were instrumental in the team's success, as well as new players Herbie Collins, Jack Ryder, Bert Oldfield, the spinner Arthur Mailey and the so-called \"twin destroyers\" Jack Gregory and Ted McDonald. The team continued its success on the 1921 tour of England, winning three out of the five Tests in Warwick Armstrong's last series. The side was, on the whole, inconsistent in the latter half of the 1920s, losing its first home Ashes series since the 1911–12 season in 1928–29."]}, {"page": "Body Language (Kylie Minogue album)", "response": ["Body Language is the ninth studio album by Australian singer Kylie Minogue. It was released on 10 November 2003 by Parlophone. Following the commercial success of her eighth studio album Fever (2001), Minogue enlisted a diverse group of writers and producers to aid in creating a new album, including Cathy Dennis, Dan Carey, Emiliana Torrini, Johnny Douglas, and Kurtis Mantronik among others. Influenced by the musical works of the 1980s and artists like Prince and Scritti Politti, Body Language musically differs from Minogue's previous albums, which mainly featured disco-oriented dance-pop tracks, and instead explores genres like synth-pop, electroclash, R&B, and hip hop. Lyrically, the album touches upon themes of enjoyment, flirting, and sex.", "Soon, Minogue began work on her ninth studio album Body Language. Aiming to create a dance-pop album inspired by electronic music from the 1980s, Minogue enlisted collaborators such as Cathy Dennis, Dan Carey, Emiliana Torrini, Johnny Douglas and Mantronix. Talking further about Scritti Politti, a British post-punk band, Minogue reminisced about her collaboration with the band's frontman Green Gartside, who provides vocals on the track \"Someday\", saying, \"To this day I haven't met him! I left a message on his answering machine, saying, \"Hi, it's Kylie! I just wanted to say thanks so much! You sound brilliant!\" \"After Dark\" was co-written by Dennis, who had previously co-written \"Can't Get You Out of My Head\" for Minogue. Torrini, who co-wrote \"Slow\", revealed how she was approached for writing the song, saying \"It was like I had just accidentally walked into the line of fire with, \"Hey! You There! It was all quite surreal. I still think Kylie's people were trying to call Jamelia, and they just got the wrong number. It'd be much more funny if that is how it actually happened\". The recording of Body Language took place during the summer of 2003, in London, England; Dublin, Ireland and Marbella, Spain.", "* Johnny Douglas – all instruments, backing vocals ", "* Johnny Douglas – vocal production, additional production ; production, mixing "]}, {"page": "1914 in sports", "response": ["* Wisden Cricketers of the Year – Johnny Douglas, Percy Fender, Wally Hardinge, Donald Knight, Sydney Smith "]}, {"page": "C. B. Fry", "response": ["Fry scored 94 first-class centuries, including an unprecedented six consecutive centuries in 1901. No one else has scored more consecutive hundreds. On 12 September 1901, playing for the Rest of England against Yorkshire at Lord's, he scored 105, which was his sixth consecutive first-class century.The sequence was framed by scores in the 80s, so he nearly made it eight consecutive hundreds. For Sussex he scored 88 and 106 against Hampshire (scorecard), 209 against Yorkshire (scorecard), 149 against Middlesex (scorecard), 105 against Surrey (scorecard), 140 against Kent (scorecard), and then in his last innings of the season, for Rest of England, he scored 105 against the County Champions Yorkshire (scorecard). In his first innings of 1902, he scored 82 for London County against Surrey (scorecard). Donald Bradman equalled the record of six consecutive centuries in 1938–39, and Mike Procter did so again in 1970–71  He made his highest first-class score of 258 not out in 1911, a season which led to his recall to the England Test team as captain in 1912. In 1921 Fry was once again considered for the Test side. The Selection Committee asked him to play in the First Test match at Nottingham under the captaincy of Johnny Douglas, with a view to taking over the captaincy for the remainder of the series if, as they anticipated, things went wrong. Fry declined on the basis that there was no sense in recalling a forty-nine-year-old merely as a player, but stated that he would consider returning as captain. As England were badly beaten at Nottingham the Selection Committee again pressed Fry to return for the Second Test but once again he declined, due to poor form. Following another heavy defeat in the Second Test the Selection Committee made a further attempt to persuade Fry to return for the Third Test as captain, a job he was now keen to accept. He injured a finger taking a catch during Hampshire's match with the Australians. In the short term, the injury did not appear too serious: he scored a half-century in Hampshire's first innings and, when they followed on in reply to the Australians' massive total he top scored with 37. Furthermore, in his next match against Nottinghamshire he scored 61 in the first innings (but registered a duck in the second). It appears however that the injury was affecting his fielding more than his batting and, for last time, C.B. felt obliged to stand down from the side for the next Test. Fry later commentated on cricket matches, being called \"one of the most eloquent cricket commentators of all time.\""]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Johnny Douglas"]}, {"page": "Sydney Barnes", "response": ["Barnes joined the MCC tour of Australia in 1911–12 and played in all five Tests. In the first Test at Sydney, which England lost, captain Johnny Douglas shared the new ball with left-arm seamer Frank Foster. Barnes, disgusted at being made a change bowler, sulked and gave a performance that was well below par. At Melbourne, however, Douglas bowed to the pressure and surrendered the new ball to the Staffordshire bowler, who responded with a spell of four wickets for one run in his first five overs. His first four victims were Warren Bardsley, Charles Kelleway, Clem Hill and Warwick Armstrong. When Frank Foster dismissed Victor Trumper and Barnes added Roy Minnett, the home side were reduced to 38 for six. Barnes took 39 wickets in the series with three five-wicket hauls.Test bowling record by season. CricketArchive. Retrieved 5 January 2014. These efforts led him to being retrospectively calculated as achieving the number one ranking in the ICC Test Bowler Rankings (he retained it for the next 2 years)."]}, {"page": "List of England cricket captains", "response": ["| rowspan=6 | Johnny Douglas 100px"]}]}}