{"wiki_id": "http://www.wikidata.org/entity/Q7350496", "itemLabel": "Robert Tuite Boothby", "itemDescription": "British banker", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Tuite_Boothby", "wikipedia_page": {"main": "Sir Robert Tuite Boothby KBE (29 June 1871 – 7 February 1941) was a British banker.", "link_mentions": [{"page": "Corstorphine", "response": ["* Sir Robert Tuite Boothby, banker, lived at Beechwood house after Asher and is also buried in Corstorphine churchyard"]}, {"page": "Robert Boothby, Baron Boothby", "response": ["The only son of Sir Robert Tuite Boothby, KBE, of Edinburgh and a cousin of Rosalind Grant, mother of the broadcaster Sir Ludovic Kennedy, Boothby was educated at St Aubyns School, Eton College, and Magdalen College, Oxford. Before going up to Oxford, near the end of the First World War, he trained as an officer and was commissioned into the Brigade of Guards, but was too young to see active service.Article by John Grigg. Boothby read History at the University of Oxford; the shortened war course was not classed, being marked either 'Pass' or 'Fail'. He attended a few lectures and did some general reading, but, as he cheerfully observed, \"there were far too many other things to do\".Robert Rhodes James, Robert Boothby: A Portrait of Churchill's Ally, Harmondsworth: Viking Penguin, 1991, pp. 38–39 He achieved a pass without distinction in 1921.Oxford University Calendar 1925, Oxford: Clarendon Press, 1925, p. 229 After Oxford, he became a partner in a firm of stockbrokers."]}, {"page": "Boothby (surname)", "response": ["*Robert Tuite Boothby (1871–1941), British banker, father of Robert Boothby"]}, {"page": "Fitz Boothby", "response": ["Boothby was born in 1861 in Scotland, the son of Robert Tod Boothby.http://www.golfcollectors.co.uk/u/cms/TTG_87_2008December.pdf His younger brother was Robert Tuite Boothby, the father of Baron Boothby. His sister Edith Cunningham Boothby was the second wife of Walter Cunliffe, 1st Baron Cunliffe."]}, {"page": "1929 New Year Honours", "response": ["*Robert Tuite Boothby, Chairman of the Associated Life Offices of Scotland and of the Insurance Institute in Edinburgh. For public services."]}]}}