{"wiki_id": "http://www.wikidata.org/entity/Q7356508", "itemLabel": "Roddy Scott", "itemDescription": "British photojournalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roddy_Scott", "wikipedia_page": {"main": "Roddy Scott (23 February 1971 – 26 September 2002) was an English freelance photojournalist who documented neglected conflicts in such places as Sierra Leone, Yemen, Iraq, Afghanistan and Ethiopia. He derived the bulk of his income from updating The World's Most Dangerous Places and traveled widely in his freelance journalism career, usually without sponsors or payment.\nHe died in Russia while working for Britain's Frontline Television News.", "link_mentions": [{"page": "Second Chechen War", "response": [":;Journalists: Andrei Babitsky, Supian Ependiyev (killed 1999), Adlan Khasanov (killed 2004), Ramzan Mezhidov (killed 1999), Anna Politkovskaya (assassinated 2006), Roddy Scott (killed 2002), Fatima Tlisova, and others"]}, {"page": "Human rights in Russia", "response": ["A number of journalists were killed in Chechnya purportedly for reporting on the conflict. List of names includes less and more famous: Cynthia Elbaum, Vladimir Zhitarenko, Nina Yefimova, Jochen Piest, Farkhad Kerimov,  Natalya Alyakina, Shamkhan Kagirov, Viktor Pimenov, Nadezhda Chaikova, Supian Ependiyev, Ramzan Mezhidov and Shamil Gigayev, Vladimir Yatsina, Aleksandr Yefremov, Roddy Scott, Paul Klebnikov, Magomedzagid Varisov, Natalya Estemirova and Anna Politkovskaya."]}, {"page": "Ruslan Gelayev", "response": ["From his bases in Pankisi, Gelayev organised a series of cross-border hit-and-run attacks into Russia. He would not perform any large-scale raid into Chechnya because he wanted to avoid clashes with fellow  Chechens serving in pro-Moscow forces and because of his strained relations with Maskhadov and Basayev. However, more than 100 Chechen fighters left his group and returned to Chechnya under the command of Umarov in 2002. Many Dagestani and Kabarday fighters also split from Gelayev and returned to their own republics, Dagestan and Kabardino-Balkaria, launching the local insurgencies there. In September 2002, Gelayev personally led an incursion into the Russian republic of Ingushetia, capturing the villages of Tarskoye and Galashki, but his fighters became surrounded, took large losses and were dispersed. According to Russia, 30-40 Chechen fighters were killed in shootouts and air attacks and five were captured (though Chechen sources said that seven fighters were killed and five were missing).Russians 'beat off Chechen rebels', BBC News, 26 September 2002Fierce Clash Between Rebels, Russian Troops, Los Angeles Times, September 27, 2002 17 Russian servicemen were also reported killed.46 killed in attacks on Russia government, China Daily, 2004-06-22 Among those killed was Roddy Scott, a British freelance reporter who travelled with the rebels and was allegedly shot by a Russian sniper while attempting to surrender.Briton killed in Chechen rebel skirmish, BBC News, 26 September 2002 Gelayev himself was severely injured and for a time being was out of action. In an October 2002 interview, he said he would \"continue to fight until not only our country but all the nations of the Caucasus are freed from the double-headed eagle [of Russia].\"North Caucasus Weekly Volume 3, Issue 28 (October 1, 2002)"]}, {"page": "List of journalists killed in Russia", "response": ["* 26 September 2002 – Cameraman and editor Roddy Scott was killed in Ingushetia. Russian soldiers found his body in the republic's Galashki region, near the border with Chechnya, following a bloody battle between Russian forces and a group of Chechen fighters."]}, {"page": "Roddy", "response": ["* Roddy Scott (1971-2002), British photojournalist"]}, {"page": "David Loyn", "response": ["Loyn is on the board of the Media Standards Trust and a trustee of the Roddy Scott Foundation. He is on the Advisory Council of the Mcdonald Centre for Theology, Ethics and Public Life in Oxford, and is a founder member of London's Frontline Club."]}, {"page": "Template talk:Assassinated Russian journalists", "response": [": Currently the following entries are misplaced: Anastasia Baburova, Larisa Yudina, Yuri Shchekochikhin, as per arguments I presented above. Rory Peck, Cynthia Elbaum, Jochen Piest, Roddy Scott, Andrew Shumack - not Russian journalists. Journalists killed in the Chechen war should probably have their own template. --illythr (talk) 12:35, 22 December 2011 (UTC)"]}, {"page": "Disappearance of Ali Astamirov", "response": ["* Roddy Scott"]}]}}