{"wiki_id": "http://www.wikidata.org/entity/Q7355761", "itemLabel": "Rocky Dean", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rocky_Dean", "wikipedia_page": {"main": "Rocky Dean (born 17 June 1978) is a British professional boxer from Thetford in Norfolk, England.  He is a former Southern Area champion at Featherweight and has twice competed for the full British title at Super Bantamweight.", "link_mentions": [{"page": "Martin Power", "response": ["Power made his professional debut in June 2001 with a victory over Sean Grant at the York Hall in Bethnal Green.  He compiled an unbeaten ledger of 19-0 with wins over the likes of Rocky Dean and Shinny Bayaar before getting a crack at the vacant British title in May 2005.  He won the title with a win over Dale Robinson at the Elephant & Castle center in Southwark to become British Bantamweight champion."]}, {"page": "Matthew Marsh (boxer)", "response": ["Marsh begun his professional career in September 2004 with a win over Freddy James at the York Hall in Bethnal Green. By December 2006 he had compiled a winning ledger of 6–0 with wins over the likes of Welshman Dai Davies and French journeyman Frederic Gosset,Marsh beats Gosset  Britishboxing.net, Retrieved 24 October 2008.   and had earned a crack at the Southern Area featherweight championship. He challenged reigning champion Rocky Dean at the Excel Arena in the London Docklands and won a 10-round decision. The two fighters met again in July 2007 this time for the super bantamweight version of the same belt. Going into the second match up Dean was confident saying \"I am faster and fitter, and I am twice the fighter I was when I last met Marsh...Last time we met, I gave him the first four rounds. That will not happen again\".", "Following the back to back wins over Rocky Dean, Marsh once again stepped up to featherweight to box the current holder of the WBU title Derry Mathews. Mathews was himself a former ABA bantamweight champion, winning the title in 2002 two years before Marsh would pick up the same crown. The fight in October 2007 ended with a first defeat for Marsh with the step up in class proving a bit too much when the fight was stopped in the 11th round. It was the first time Marsh had been taken beyond 10 rounds and observers noted that the fatigue was beginning to show as he struggled into the later stages.", " Marsh made the first defence of his new title against the man he had already beaten twice, Rocky Dean, at the York Hall on 21 November 2008. The fight ended with a majority decision for the champion handing Marsh his third win over Dean.", "Rocky Dean record  Britishboxing.net Retrieved 22 November 2008.  "]}, {"page": "Jason Booth", "response": ["On 17 April 2009, Booth won the vacant British super-bantamweight title with a victory over English champion Mark Moran. Booth had been meant to fight Lee Haskins for the British super-flyweight title before Haskins pulled out with a hand injury. Moran was originally scheduled to fight Matthew Marsh for the super-bantamweight title before Marsh pulled out citing difficulties in making the weight. Booth won the fight when a clash of heads forced the fight to be stopped on cuts in the sixth round although he had been dominating the fight prior to the stoppage. The victory meant that Booth had become a two-weight British champion having also won the flyweight title in 1999. On 30 June 2009 Booth made the first defence of his new title against Thetford fighter Rocky Dean winning a unanimous points decision. Promoter Frank Maloney said after the fight that he would try to get Booth a world title fight in the near future."]}, {"page": "Gary Davies (boxer)", "response": [" when he was defeated by journeyman Steve Gethin by technical knock-out in the second round. His second fight on 5 October 2002, against Jason Thomas resulted in a first win and the year was topped off with a victory against Simon Chambers at the Liverpool Olympia. Davies did not fight at all in 2003 and in 2004 only fought once, winning against Furhan Rafiq. One more solitary fight in 2005 resulted in a second career loss for him, stopped in the fourth round at York Hall by Rocky Dean."]}, {"page": "Andy Morris (boxer)", "response": ["Morris had his first professional contest in January 2003 when he scored a points win over Jason Nesbitt at the Guild Hall in Preston.  Four more fights that year resulted in four more victories giving Morris an unbeaten record of 5-0 at the end of his debut year.  The following year saw another four wins for the Manchester boxer ensuring a record of 9-0 at the end of 2004.  On 20 May 2005 Morris won the English title with a victory over Rocky Dean at the Elephant and Castle in Southwark.Boxrec | Andy Morris professional record"]}]}}