{"wiki_id": "http://www.wikidata.org/entity/Q7358374", "itemLabel": "Roger Hynd", "itemDescription": "Scottish footballer (1942-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Hynd", "wikipedia_page": {"main": "John Roger Shankly Hynd (2 February 1942 – 18 February 2017) was a Scottish professional footballer who played as a centre half.\nHe started his playing career at Rangers, for whom he played in the 1967 European Cup Winners' Cup Final, before moving to the English Football League. He played nearly 300 League matches for Crystal Palace, Birmingham City – with whom he played more than 200 games and was named Player of the Year as they won promotion to the First Division in 1972 – Oxford United and Walsall. He had a brief spell as manager of Motherwell and a six-game spell as interim manager of St Johnstone before leaving professional football to work as a PE teacher. He was the nephew of Bill Shankly.In 2012, Hynd was one of seven former players elected to Birmingham City's Hall of Fame. He died in February 2017, aged 75.", "link_mentions": [{"page": "Motherwell F.C.", "response": ["|align=left|Roger Hynd 1977–1978"]}, {"page": "Jock Stein", "response": ["Four days after the second leg against Dukla, Celtic defeated Aberdeen 2–0 in the 1967 Scottish Cup Final. Celtic were involved in a close race with Rangers for the Scottish league championship, decided by an Old Firm game at Ibrox on the final day of the league season. Celtic needed a point to clinch the championship. Archie Macpherson wrote in his biography of Stein that it was one of the best Old Firm games he had seen, as both sides played without a fear of losing: Rangers needed the victory to win the championship, while Stein believed Celtic's best chances lay in attacking their opponents. Rangers took the lead in the 40th minute, but Celtic equalised within a minute thanks to a \"scrambled effort\" by Jimmy Johnstone. Celtic went 2–1 ahead with 15 minutes remaining, when Johnstone beat some opponents then fired a left-footed shot high into the net. Roger Hynd scored an equalising goal for Rangers, but the match finished in a 2–2 draw and Celtic won the championship."]}]}}