{"wiki_id": "http://www.wikidata.org/entity/Q7356618", "itemLabel": "Roderick Gradidge", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Roderick_Gradidge", "wikipedia_page": {"main": "Roderick Gradidge AA Dipl. ARIBA (3 January 1929 – 20 December 2000) was a British architect and writer on architecture, former Master of the Art Workers Guild and campaigner for a traditional architecture.", "link_mentions": [{"page": "Bodelwyddan Castle", "response": ["Partnerships were formed with the National Portrait Gallery and the Royal Academy of Arts, so that the castle could be used to display objects from these collections. In order to house these items, the interior of the castle was restored by Roderick Gradidge, an expert on Victorian architecture. The portrait gallery opened in 1988 and was named Museum of the Year in 1989. The castle's association with the National Portrait Gallery came to an end in 2017 after its funding was cut by Denbighshire County Council."]}, {"page": "Harold Falkner", "response": ["===Roderick Gradidge and Michael Blower===", "A number of his projects have been altered, restored and extended by the twin and eminent skills of architects, Michael Blower of Farnham and Roderick Gradidge of Chiswick, such as Overdeans Court, The Priory, Merlewood and Tancreds Ford (for the author Ken Follett). The latter was the subject of two fine articles in Country Life by Clive Aslet.Country Life 17 & 24 November 1983", "* The Surrey Style, by Roderick Gradidge. Kingston: Surrey Historic Buildings Trust, 1991 (paperback, ).", "* Dream Houses: The Edwardian Ideal, by Roderick Gradidge. Constable, 1980 (hardback, )."]}, {"page": "Michael Blower", "response": ["The practice had been founded by Farnham's most eminent architect of the time, Arthur Stedman in 1895. After his death in 1958, the practice was continued by Leonard Stedman, his son. Michael took over the practice in its entirety in 1968 on the latter's retirement. He was awarded First Prize by the RICS/The Times for the preservation of The Tanyard, Farnham's oldest house in 1982 and an RIBA Award for The New House with Roderick Gradidge in 1998. The practice is now known as Stedman Blower Architects.", "=== Roderick Gradidge===", "Blower completed a number of fine restorations and extensions to country houses in Surrey in the 1980s and 1990s. He did these in a loose partnership with the prominent Chiswick-based architect, Roderick Gradidge. Their first projects were on Voysey's New House in Haslemere and on Detmar Blow's Charles Hill Court for an Austrian industrialist. From there, they went on to Harold Falkner's Tancreds Ford, which they designed and built for the writer Ken Follett and his first wife, and which was published in two articles in Country Life.Country Life 17 & 24 November 1983 Next came The New House, reputedly designed by Hugh Thackeray Turner and for which they jointly won a RIBA Award, which was also published in Country Life.Country Life 3 September 1998 Just prior to Roderick's death, they were working on a project at Combe Court, which was completed by Michael Blower and his son Robert, through their architectural practice, Stedman Blower.", "* The Surrey Style, by Roderick Gradidge. Kingston: Surrey Historic Buildings Trust, 1991 (paperback, )."]}, {"page": "David Sweetman", "response": ["He subsequently became a television documentary director and producer, collaborating with Roderick Gradidge for a series on architecture, with Stephen Bayley for a series on design, and with Anton Dolin and Wayne Sleep for a series on the ballet. Sweetman's documentary reports were also broadcast on Omnibus."]}]}}