{"wiki_id": "http://www.wikidata.org/entity/Q7352809", "itemLabel": "Robin Stubbs", "itemDescription": "English footballer (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Stubbs", "wikipedia_page": {"main": "Robin Gregory Stubbs (born 22 April 1941) is an English former professional footballer, born in Quinton, Birmingham, who played as a centre forward. He made nearly 400 appearances and scored 170 goals in the Football League playing for Birmingham City, Torquay United (in two separate spells) and Bristol Rovers.While with Birmingham, Stubbs played in the early rounds of their 1958–60 and 1960–61 campaigns in the Inter-Cities Fairs Cup, but not in either final. At the age of 22 he joined Torquay for what was then their club record fee of £6,000. Over the following six seasons he scored at a rate of better than a goal every two games, and was the Torquay fans' choice in the 2007 PFA Fans' Favourites poll.Stubbs was formerly married to Anthea Redfern, who went on to marry Bruce Forsyth and assist him on the BBC game-show The Generation Game.On 6 January 2020 Torquay United announced that Stubbs had been appointed to the board as an Honorary Life President of the club.", "link_mentions": [{"page": "Torquay United F.C.", "response": ["Torquay came very close to regaining their Division Three status when they finished sixth in both the 1962–63 and 1963–64 campaigns. In 1963, Webber signed striker Robin Stubbs for a club record fee of £6,000 from Birmingham City; he went on to be the club's top goalscorer at the end of the 1963–64 scoring 24 goals in 34 games in his debut season.", "In front of Plainmoor's second ever largest attendance – the official attendance was slightly above 20,000 – the team performed well: Billy Atkinson put United 1–0 up from the penalty spot after Robin Stubbs had been felled; Spurs responded turning on the style to give themselves a 3–1 lead with two goals from Alan Gilzean and one from Maurice Norman; and then, in the last few minutes, it was the turn of record signing Robin Stubbs to net two goals and make it 3–3.", "During the following end-of-season clear-out, star striker Robin Stubbs was sold to Bristol Rovers for £12,000. Another two seasons of indifference in Division Three saw the club finish in mid-table positions, then at the end of the 1971–72 campaign, United found themselves in the relegation zone, and back in the basement division.", "* Robin Stubbs from Birmingham City for £6,000 in 1963 (previous club record)"]}, {"page": "Eric Webber", "response": ["In the 1956–57 season, he almost took Torquay to promotion from Division Three (South). On the final day of the season they needed to take maximum points from their game against Crystal Palace, but only managed to obtain a draw, so Ipswich Town took the only promotion place then available (on goal average). He did however lead Torquay to promotion from Division Four in 1960, Torquay finishing in 3rd place. Torquay were relegated two years later, again on the last day of the season, but Webber remained at the club until he was surprisingly sacked in May 1965, to be replaced by Frank O'Farrell after Torquay had finished in 12th place at the end of the season. He had spent nearly 14 years as Torquay manager, signing a number of players who would go on to greater things, including Robin Stubbs whom he signed from Birmingham City for £6,000."]}, {"page": "Fred Binney", "response": ["He signed for Torquay as an amateur, before turning professional in October 1966. Whilst a regular scorer for Torquay's reserve side, which played in the Western League, the form of Robin Stubbs meant that Binney's debut would have to wait. It finally came in September 1967, a 1–1 draw away to Grimsby Town, but Binney could not gain a regular place in the side and was loaned to Exeter City in February 1969, scoring 11 goals in 17 league games."]}, {"page": "List of Torquay United F.C. seasons", "response": ["|align=left|Robin Stubbs||25", "|align=left|Robin Stubbs||39", "|align=left|Robin Stubbs||21", "|align=left|Robin Stubbs||10", "|align=left|Robin Stubbs||19"]}, {"page": "List of Torquay United F.C. records and statistics", "response": ["Sammy Collins has held the club's goalscoring record since 1958 with 219 in all competitions.  Ron Shaw, Tommy Northcott and Robin Stubbs are the only other players to have scored more than 100 goals for Torquay.", "* Most goals in a single match: Robin Stubbs, 5 (against Newport County, 19 October 1963, Division Four)."]}, {"page": "Q3 Academy Langley", "response": ["* Robin Stubbs (1941– ), Birmingham City and Torquay Utd footballer "]}, {"page": "1969–70 Football League", "response": ["|16||align=left|  Robin Stubbs ||align=left| Bristol Rovers ||15||2||0||17"]}, {"page": "1970–71 Football League", "response": ["|10||align=left|  Robin Stubbs ||align=left| Bristol Rovers ||17||1||1||19"]}, {"page": "Anthea Redfern", "response": ["Redfern was born in Newton Abbot, Devon. She trained as a dancer and then went on to work as a model in Paris and the United Kingdom: she was one of the first models to appear on Page Three of The Sun, albeit not topless. In 1969 Redfern became a Playboy Bunny working in the London club in Park Lane, where her bunny name was Sasha. She became \"Miss London\" in 1970. Her first marriage was to Torquay United and Bristol Rovers footballer Robin Stubbs. Redfern auditioned against fifty-two other applicants and was chosen to host The Generation Game with Forsyth."]}, {"page": "Tommy Northcott", "response": ["He again teamed up with Sammy Collins, but also played alongside his younger brother George, a central defender. He scored 13 times during the remainder of the 1957–58 season, twenty the following season and 15 in the 1959–60 season as Torquay won promotion to the Third Division. In 1963 Torquay signed Robin Stubbs from Birmingham City and Northcott quickly established a fruitful relationship with him. The pair scored over 100 goals over the next three seasons and in 1966 helped Torquay to promotion back to the Third Division. However, he was released by manager Frank O'Farrell at the end of that promotion season."]}, {"page": "Alex Jackson (footballer, born 1935)", "response": ["Jackson was born in Glasgow where he grew up with Sisters Jean and Shirley, and brother Jim. He joined Birmingham City from junior club Shettleston for a fee of £2,000 in April 1958. He made his debut in the First Division on 15 November 1958, deputising for Eddy Brown in a home game against Newcastle United which Birmingham won 1–0. Jackson had a run of five games at centre forward a few weeks later, but despite scoring six goals in those five games, his first-team football was restricted to the FA Cup thereafter, and new arrival Robin Stubbs stepped into the league side.Matthews, p. 194."]}, {"page": "1961 Inter-Cities Fairs Cup Final", "response": ["In Copenhagen, melted snow and rain left standing water on the pitch, and the kickoff had been moved to late afternoon so that the match against KB could be televised. This meant the attendance was very low, and the floodlighting was inadequate. Having twice taken a two-goal lead, Birmingham conceded two late goals and the game ended 4–4. Young goalkeeper Colin Withers had let in six goals in his first appearance as replacement for Johnny Schofield, who had fractured his skull, but made several saves to keep Birmingham from losing this match. The Daily Mirror reporter suggested that if the other forwards had taken full advantage of new signing Jimmy Bloomfield's creativity, the score would have been rather different. The score in the home leg was indeed different. Goals from Robin Stubbs (2), Bloomfield, Mike Hellawell, and debutant Jimmy Harris gave Birmingham a 9–4 aggregate victory.", "Going into this match, Birmingham were bottom of the table with only one win in ten games. The previous week, forward Robin Stubbs had dislocated his shoulder, and during a Football League Cup replay unhelpfully scheduled for the Monday night, 48 hours before the Roma match, England international Trevor Smith had to leave the field with a thigh strain as Birmingham lost to Third Division side Swindon Town. The 19-year-old Winston Foster, who had previously been used only at right-back, took Smith's place at centre-half, alongside Hennessey and Malcolm Beard in a half-back line composed entirely of teenagers. The players were intended to enjoy a relaxing visit to Warwick Castle the day before the game, but the weather was so wet that the trip was cancelled."]}]}}