{"wiki_id": "http://www.wikidata.org/entity/Q7352346", "itemLabel": "Robin Dalglish", "itemDescription": "Royal Navy admiral", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Dalglish", "wikipedia_page": {"main": "Rear Admiral Robin Campsie Dalglish, Companion of the CB (3 December 1880 – 17 December 1934) was a senior officer in the Royal Navy. He represented Great Britain in Fencing at the 1920 and 1924 Summer Olympics. He was the first Australian-born admiral in the Royal Navy.", "link_mentions": [{"page": "HMS Barham (04)", "response": ["Barham became flagship of the 1st Battle Squadron of the Atlantic Fleet in April 1919, and made a port visit to Cherbourg, France that month together with the rest of the squadron.Burt 2012a, p. 134 Captain Robin Dalglish relieved Horne on 1 October 1920.Jones, p. 265 She retained her position when the 1st and 2nd Battle Squadrons were merged in May 1921. Dalglish was relieved in his turn by Captain Percy Noble on 18 October 1922. Barham participated in the Fleet review on 26 July 1924 at Spithead. A few months later, now under the command of Captain Richard Hill, the ship again retained her position as the 1st Battle Squadron was split in two and the Queen Elizabeths of the new 1st Battle Squadron were transferred to the Mediterranean Fleet on 1 November 1924. On 14 October 1925, Captain Francis Marten relieved Hill, but he retained command only until 9 March 1926 when Captain Joseph Henley assumed command. Together with her sister , Barham was sent to Alexandria, Egypt, in May 1927 during a time of unrest. Now under the command of Captain Hubert Monroe and accompanied by the battleship , she cruised along the coast of West Africa from December 1927 to February 1928. She became a private ship in January of that year and was refitted at Portsmouth Royal Dockyard in February–July. Shortly after her return to the Mediterranean, Barham again became flagship of the 1st Battle Squadron in September after her sister Warspite had to return home for repairs after running aground. Captain James Somerville relieved Monroe on 1 December and he was relieved in his turn on 16 March 1929 by Captain John C. Hamilton. The ship was relieved as flagship by  in JuneBurt 2012a, p. 135 and she was ordered to Palestine in August where her crew helped to suppress rioting in Haifa and also operated the Haifa-Jerusalem railroad.Jones, pp. 115–116 The ship was transferred to the 2nd Battle Squadron of the Atlantic Fleet in November 1929, and, together with Malaya, made a port visit to Trondheim, Norway in mid-1930 where they fired a salute to celebrate the birth of Princess Ragnhild on 9 June.Jones, pp. 121–122"]}, {"page": "Great Britain at the 1920 Summer Olympics", "response": ["|rowspan=2| Robin Dalglish", "| Ronald Campbell  Robin Dalglish  William Hammond  Herbert Huntington  Cecil Kershaw  William Marsh  Alfred Ridley-Martin"]}, {"page": "Great Britain at the 1924 Summer Olympics", "response": ["| Robin Dalglish", "| Edward Brookfield  Archibald Corble  Robin Dalglish  William Hammond  Cecil Kershaw  William Marsh"]}, {"page": "Fencing at the 1920 Summer Olympics – Men's épée", "response": ["| 4 ||align=left| Robin Dalglish ||align=left|  || 4 || 4 || ", "| 11 ||align=left| Robin Dalglish ||align=left|  || 1 || 9 || ", "|align=left| Robin Dalglish ||align=left|  || 4 || 4 ||data-sort-value=4| 4th || 1 || 9 ||data-sort-value=11| 11th || 5 || 13"]}, {"page": "Fencing at the 1920 Summer Olympics – Men's sabre", "response": ["| style=\"text-align: left;\" | Robin Dalglish ||align=left| ", "| style=\"text-align: left;\" | Robin Dalglish ||align=left| ", "| style=\"text-align: left;\" | Robin Dalglish ||align=left| "]}, {"page": "Fencing at the 1920 Summer Olympics – Men's team sabre", "response": ["* Robin Dalglish"]}, {"page": "Fencing at the 1924 Summer Olympics – Men's sabre", "response": ["This was the seventh appearance of the event, which is the only fencing event to have been held at every Summer Olympics. Four of the twelve finalists from 1920 returned: bronze medalist Adrianus de Jong of the Netherlands, fourth-place finisher Oreste Puliti of Italy, fifth-place finisher Jan van der Wiel of the Netherlands, and eighth-place finisher Robin Dalglish of Great Britain. De Jong had won the first two world championships in 1922 and 1923. Ivan Osiier of Denmark, in his fourth Olympics of seven in which he would compete, entered the sabre for the first time. The Hungarian team, which had claimed five of the six possible medals in 1908 and 1912 before being uninvited to the 1920 Games after World War I, returned to competition. Hungary was favored with multiple excellent fencers, but de Jong and Puliti were also strong contenders."]}, {"page": "Fencing at the 1924 Summer Olympics – Men's team sabre", "response": ["* Robin Dalglish"]}]}}