{"wiki_id": "http://www.wikidata.org/entity/Q7351194", "itemLabel": "Robert Wiseman", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Wiseman", "wikipedia_page": {"main": "Robert Ramsey Wiseman (18 April 1916 – 7 December 2004) was the founder of Robert Wiseman Dairies, one of the United Kingdom's largest dairy businesses.", "link_mentions": [{"page": "Wiseman (surname)", "response": ["* Robert Wiseman, Scottish businessman"]}, {"page": "1947 in the United Kingdom", "response": ["* Robert Wiseman Dairies founded by Robert Wiseman with a horse and cart used for doorstep deliveries in East Kilbride."]}, {"page": "Müller Milk & Ingredients", "response": ["Müller Milk & Ingredients, formerly Robert Wiseman Dairies and later Müller Wiseman Dairies, is the largest milk supplier and distributor in Great Britain. It is part of the Müller UK & Ireland Group, owned by the German Müller family. ", "Robert Wiseman Dairies was founded in 1947 by Robert Wiseman Senior. It started off as a small family farm in East Kilbride that carried out doorstep deliveries using a horse and cart. Alan Wiseman joined the business straight from school in 1967, and worked his way up to become chairman. Eight years later, Robert Wiseman Jnr became managing director.", "Robert Wiseman Dairies was listed on the London Stock Exchange in 1994. In the same year, the government abolished the Milk Marketing Board, allowing dairy farmers to sell their milk to whoever they chose. At this time, Wiseman created the Wiseman Milk Partnership, a group of farmers contracted to supply their milk direct to Robert Wiseman Dairies.", "Robert Wiseman Dairies opened a dairy in Bridgwater in September 2008, which is considered to be Britain’s most efficient and environmentally advanced fresh milk dairy. In January 2012, the company agreed to a takeover by the family run, German dairy company, Müller, and was returned to private ownership. The business then became known as Müller Wiseman Dairies, and is part of the Müller UK & Ireland Group."]}, {"page": "Mackie's", "response": ["Mackie's of Scotland is a Scottish ice cream and confectionery manufacturer based in Rothienorman, Aberdeenshire, Scotland. It was founded in 1912 as a dairy farm but diversified into the manufacture of ice cream after selling the milk retail business to Robert Wiseman during 1997. In 2009 a partnership was formed with a Tayside potato farmer to produce crisps, marketed under the name of Mackie's at Taypack. The manufacture of chocolate was added in 2014."]}, {"page": "1947 in Scotland", "response": ["* Robert Wiseman Dairies founded by Robert Wiseman with a horse and cart used for doorstep deliveries in East Kilbride."]}, {"page": "Wiseman, Robert", "response": ["#redirectRobert Wiseman"]}]}}