{"wiki_id": "http://www.wikidata.org/entity/Q7364785", "itemLabel": "Ronald Dalzell, 12th Earl of Carnwath", "itemDescription": "Royal Navy and British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Dalzell,_12th_Earl_of_Carnwath", "wikipedia_page": {"main": "Ronald Arthur Dalzell, 12th Earl of Carnwath, (3 June 1883 – 15 July 1931), was the second but only surviving son of Robert Dalzell, 11th Earl of Carnwath. \nWith the death of his elder brother in 1904, he became heir to his father's Earldom, and was then styled Lord Dalzell. He succeeded to the title of Earl of Carnwath upon his father's death on 8 March 1910. Posted to the Royal Naval Volunteer Reserve with the outbreak of war in 1914 he was attached to the Air Service. Invalided out in 1915 he joined the Welsh Horse Yeomanry and served in France. Due to poor health he was exempted from duty in 1919. Married on 23 July 1910 to Maude Maitland Savile, the Earl had no children. \nUpon Lord Carnwath's death in 1931, the Earldom passed to his uncle, Arthur Dalzell.", "link_mentions": [{"page": "Ronald Arthur Dalzell, 12th Earl of Carnwath", "response": ["#REDIRECT Ronald Dalzell, 12th Earl of Carnwath"]}, {"page": "J. E. Savill", "response": ["*Maude Maitland SavillShe and her father are accorded the surname \"Savile\" in National Portrait Gallery and Peerage references and hence also the related Wikipedia article but whether erroneously or not cannot be determined. It may be significant that her sister Vivienne was a Savill in her marriage notices. (1875–1956) married Ronald Dalzell, 12th Earl of Carnwath (1883–1931) on 23 July 1910. The National Portrait Gallery has several photographic portraits of the Countess.http://www.npg.org.uk/collections/search/person/mp66932/maud-maitland-ne-savile-countess-of-carnwath They need info"]}, {"page": "C. Leslie Macdonald", "response": ["*Maude Maitland Dalzell (1875–1956), who married Ronald Dalzell, 12th Earl of Carnwath (1883–1931) on 23 July 1910 and so became Countess of Carnwath"]}]}}