{"wiki_id": "http://www.wikidata.org/entity/Q7364701", "itemLabel": "Ronald Brown", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Brown_(mathematician)", "wikipedia_page": {"main": "Ronald Brown is an English mathematician. Emeritus Professor in the School of Computer Science at Bangor University, he has authored many books and more than 160 journal articles.", "link_mentions": [{"page": "Alexander Grothendieck", "response": ["In 1983, stimulated by correspondence with Ronald Brown and Tim Porter at Bangor University, Grothendieck wrote a 600-page manuscript titled Pursuing Stacks, starting with a letter addressed to Daniel Quillen. This letter and successive parts were distributed from Bangor (see External links below). Within these, in an informal, diary-like manner, Grothendieck explained and developed his ideas on the relationship between algebraic homotopy theory and algebraic geometry and prospects for a noncommutative theory of stacks. The manuscript, which is being edited for publication by G. Maltsiniotis, later led to another of his monumental works, Les Dérivateurs. Written in 1991, this latter opus of about 2000 pages further developed the homotopical ideas begun in Pursuing Stacks. Much of this work anticipated the subsequent development of the motivic homotopy theory of Fabien Morel and Vladimir Voevodsky in the mid-1990s."]}, {"page": "Category theory", "response": ["Higher-dimensional categories are part of the broader mathematical field of higher-dimensional algebra, a concept introduced by Ronald Brown.  For a conversational introduction to these ideas, see John Baez, 'A Tale of n-categories' (1996)."]}, {"page": "Homotopy group", "response": ["* Ronald Brown, `Groupoids and crossed objects in algebraic topology', Homology, Homotopy and Applications, 1 (1999) 1–78.", "* Ronald Brown, Philip J. Higgins, Rafael Sivera, Nonabelian algebraic topology: filtered spaces, crossed complexes, cubical homotopy groupoids, EMS Tracts in Mathematics Vol. 15, 703 pages, European Math. Society, Zürich, 2011.  "]}, {"page": "Group extension", "response": ["A paper of Ronald Brown and Timothy Porter on Otto Schreier's theory of nonabelian extensions uses the terminology that an extension of K gives a larger structure."]}, {"page": "Seifert–Van Kampen theorem", "response": ["This groupoid consists of homotopy classes relative to the end points of paths in X joining points of A ∩ X. In particular, if X is a contractible space, and A consists of two distinct points of X, then \\pi_1(X,A) is easily seen to be isomorphic to the groupoid often written \\mathcal I with two vertices and exactly one morphism between any two vertices. This groupoid plays a role in the theory of groupoids analogous to that of the group of integers in the theory of groups.Ronald Brown. \"Groupoids in Mathematics\". http://groupoids.org.uk/gpdsweb.html The groupoid \\mathcal I also allows for groupoids a notion of homotopy: it is a unit interval object in the category of groupoids.", "There is a version of the last theorem when X is covered by the union of the interiors of a family \\{U_\\lambda : \\lambda \\in \\Lambda\\} of subsets.Ronald Brown, Philip J. Higgins and Rafael Sivera. Nonabelian Algebraic Topology: filtered spaces, crossed complexes, cubical homotopy groupoids, European Mathematical Society Tracts vol 15, August, 2011.Higher-dimensional, generalized Van Kampen theorems (HD-GVKT) http://planetphysics.org/encyclopedia/HDGvKTVanKampenTheorems.html", "As explained above, this theorem was  extended by Ronald Brown to the non-connected case by using the fundamental groupoid \\pi_1 (X,A) on a set A of base points.  The theorem for arbitrary covers, with the restriction that A meets all threefold intersections of the sets of the cover, is given in the paper by Brown and Abdul Razak Salleh.Brown, Ronald and Razak Salleh, Abdul, \"A Van Kampen theorem for unions of nonconnected spaces\". Archiv der Mathematik (Basel) 42 (1984), no. 1, 85–88.  The theorem and  proof for the fundamental group, but using some groupoid methods, are also given in  J. Peter May's book.May, J. Peter, \"A Concise Introduction to Algebraic Topology\", chapter 2, (1999)   The version that allows more than two overlapping sets but with A a singleton is also given in Allen Hatcher's book below, theorem 1.20.", "Applications of the fundamental groupoid on a set of base points to the Jordan curve theorem, covering spaces, and orbit spaces are given in Ronald Brown's book.Brown, Ronald, \"Topology and Groupoids\", Booksurge, (2006) In the case of orbit spaces, it is convenient to take A to include all the fixed points of the action. An example here is the conjugation action on the circle.", "References to higher-dimensional versions of the theorem which yield some information on homotopy types are given in an article on higher-dimensional group theories and groupoids.Ronald Brown. \"Higher-dimensional group theory\" . 2007. http://www.bangor.ac.uk/~mas010/hdaweb2.htm Thus a 2-dimensional Van Kampen theorem which computes nonabelian second relative homotopy groups was given by Ronald Brown and Philip J. Higgins.Brown, Ronald and Higgins, Philip J. \"On the connection between the second relative homotopy groups of some related spaces\", Proceedings of the London Mathematical Society (3) 36 (1978), 193-212. A full account and extensions to all dimensions are given by Brown, Higgins, and Rafael Sivera,Brown, Ronald, Higgins, Philip J., and Sivera, Rafael, \"Nonabelian algebraic topology: filtered spaces, crossed complexes, cubical homotopy groupoids\", EMS Tracts in Mathematics vol 15, 20011. http://groupoids.org.uk/nonab-a-t.html while an extension to n-cubes of spaces is given by Ronald Brown and Jean-Louis Loday.Brown, Ronald and Loday, Jean-Louis, \"Van Kampen theorems for diagrams of spaces,  Topology 26 (1987), 311–334.", "* Ronald Brown (mathematician)", "* Ronald Brown, Groupoids and Van Kampen's theorem, Proc. London Math. Soc. (3) 17 (1967) 385–401.", "* Ronald Brown, Topology and groupoids (2006) Booksurge LLC ", "* Ronald Brown, Higher-dimensional group theory (2007) (Gives a broad view of higher-dimensional Van Kampen theorems involving multiple groupoids)."]}, {"page": "Ronald Brown", "response": ["*Ronald Brown (English politician) (1921–2002), British Member of Parliament for Hackney South and Shoreditch", "*Ronald Brown (rugby union) (born 1995), South African rugby player", "*Ronald Brown (bishop) (1926–2019), Bishop of Birkenhead", "*Ronald Brown (mathematician) (born 1935), British mathematician"]}, {"page": "Pushout (category theory)", "response": ["*  Ronald Brown  \"Topology and Groupoids\"  pdf available Gives an account of some categorical methods in topology, use the fundamental groupoid on a set of base points to give a generalisation of the Seifert-van Kampen Theorem."]}, {"page": "Path (topology)", "response": ["* Ronald Brown, Topology and groupoids, Booksurge PLC, (2006)."]}, {"page": "Adjunction space", "response": ["* Ronald Brown, \"Topology and Groupoids\" pdf available  , (2006) available from amazon sites. Discusses the homotopy type of adjunction spaces, and uses adjunction spaces as an introduction to (finite) cell complexes."]}, {"page": "Eilenberg–Zilber theorem", "response": ["An important generalisation to the non-abelian case using crossed complexes is given in the paper by Andrew Tonks below. This give full details of a result on the (simplicial) classifying space of a crossed complex stated but not proved in the paper by Ronald Brown and Philip J. Higgins on classifying spaces."]}, {"page": "Presentation complex", "response": ["* Ronald Brown and Johannes Huebschmann,   Identities among relations, in Low  dimensional topology, London Math. Soc. Lecture Note Series 48 (ed. R.  Brown and T.L. Thickstun, Cambridge University Press, 1982), pp. 153–202."]}, {"page": "Timeline of category theory and related mathematics", "response": ["| 1983 || Alexander Grothendieck ||| Pursuing stacks: Manuscript circulated from Bangor,  written in English  in response to a correspondence in English with Ronald Brown and Tim Porter, starting with a letter addressed to Daniel Quillen, developing mathematical visions  in a 629 pages manuscript, a kind of diary, and to be published by the Société Mathématique  de France, edited by G. Maltsiniotis. ", "| 1983 || Alexander Grothendieck ||| First appearance of strict ∞-categories in pursuing stacks, following a 1981 published definition by Ronald Brown and Philip J. Higgins.  ", "| 1999 || Ronald Brown–George Janelidze ||| 2-dimensional Galois theory"]}, {"page": "Ronnie Brown (disambiguation)", "response": ["*Ronald Brown (mathematician) (born 1935), English mathematician", "*Ronald Brown (disambiguation)"]}, {"page": "Higher-dimensional algebra", "response": ["Double groupoids were first introduced by Ronald Brown in 1976, in ref. and were further developed towards applications in nonabelian algebraic topology.Non-Abelian Algebraic Topology book Nonabelian Algebraic Topology: Higher homotopy groupoids of filtered spaces A related, 'dual' concept is that of a double algebroid, and the more general concept of R-algebroid.", "*Ronald Brown"]}, {"page": "Ronald (R.) Brown (British, HDA mathematician)", "response": ["#REDIRECT Ronald Brown (mathematician)"]}, {"page": "Bangor University", "response": ["* Ronald Brown, English mathematician known for his work in algebraic topology"]}, {"page": "Timeline of manifolds", "response": ["| 1999 || Ronald Brown–George Janelidze ||| 2-dimensional Galois theory."]}]}}