{"wiki_id": "http://www.wikidata.org/entity/Q7368436", "itemLabel": "Rosemary Stewart", "itemDescription": "Author, professor", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosemary_Stewart_(business_theorist)", "wikipedia_page": {"main": "Rosemary Stewart (20 December 1924 – 15 June 2015) was a British researcher and writer on business management and healthcare management.\nStewart was born in London but the family later moved to Pulborough, West Sussex. Most of her schooling was in Saskatoon, Canada, where her mother had relatives. She graduated in Economics from the University of British Columbia, Vancouver, then in 1945, after the end of the Second World War, returned to England.She received a doctorate in Management Studies from the London School of Economics, and in 1956 became a researcher for the Acton Society, an independent organisation studying management of the newly nationalised industries and the health service; she rose to become a director of the society.Formerly a Fellow in Organisational Behaviour at Templeton College, Oxford, she was appointed an Honorary Fellow of that college. Her research covered a range of subjects and organisations in industry, commerce and the National Health Service England and Wales (NHS). She ran workshops for many years for NHS chief executives and chairs. She lectured in many parts of the world. She was dean of the Oxford Centre for Management Studies from 1983 to 1985, and director of the Oxford Health Care Management Institute on its foundation in 1996.Stewart was the author of more than a dozen books on management, and she edited books and numerous articles in academic and practitioner journals in the areas of general management, managerial behaviour and healthcare management.\nShe was granted the Honorary Degree of Doctor of Philosophy by Uppsala University in Sweden, and in 2008 gained membership of the Royal Society of Medicine.Stewart married in 1961 Ioan Mackenzie James, a fellow of St John's College, Oxford, and they settled in that town. She died on 15 June 2015 at the age of 90.", "link_mentions": [{"page": "List of business theorists", "response": ["* Rosemary Stewart - business theorist"]}, {"page": "Ioan James", "response": ["He married Rosemary Stewart, a writer and researcher in business management and healthcare management, in 1961. She died in 2015, aged 90."]}, {"page": "Rosemary Stewart", "response": ["Rosemary Stewart may refer to:", "* Rose Stone (Rosemary Stewart, born 1945), African-American singer and keyboardist", "* Rosemary Stewart (business theorist) (1924–2015), British writer and researcher in business management and healthcare management"]}, {"page": "Rosemary Stewart (author)", "response": ["#REDIRECT Rosemary Stewart (business theorist)"]}, {"page": "Roy Lewis", "response": ["* The Boss: The Life and Times of the British Business Man (with Rosemary Stewart, 1958); revised and enlarged edition, 1960, U.S. title, The Managers: a new examination of the English, German and American executive (1961)"]}, {"page": "Green Templeton College, Oxford", "response": ["* Rosemary Stewart, business theorist"]}, {"page": "Stewart (name)", "response": ["* Rosemary Stewart (business theorist) (1924–2015), British researcher and writer in business management"]}, {"page": "Acton Society Trust", "response": ["Directors of the organisation included Rosemary Stewart. Teddy Chester and Reg Revans both worked for the trust before moving to the University of Manchester, as did David Layton. ", "* The human effects of mergers: the impact on managers; Rosemary Stewart, Pauline Wingate and Randal Smith, 1963"]}]}}