{"wiki_id": "http://www.wikidata.org/entity/Q7363954", "itemLabel": "Ron Hunt", "itemDescription": "Professional footballer (1945-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ron_Hunt_(footballer,_born_1945)", "wikipedia_page": {"main": "Ron Hunt (19 December 1945 – 23 August 2018) was an English footballer who made 219 appearances in the Football League playing as a defender for Queens Park Rangers in the 1960s and early 1970s.", "link_mentions": [{"page": "1945", "response": ["** Ron Hunt, English footballer (d. 2018)"]}, {"page": "Mark Lazarus", "response": ["He moved back to QPR once more, who were in the Football League Third Division. Lazarus was involved in the cup run the team went on in the League Cup. In the fifth round, he set up both the QPR goals as they defeated Carlisle United 2–1. He scored the third goal against Birmingham City in the first leg of the semi final, which was also the first time QPR had won in an away match in the League Cup. The two legged semi-final win took them to the final of the 1967 League Cup where they faced cup holders West Bromwich Albion. Having gone two goals down by half time, the QPR team staged a comeback during the second half. With nine minutes of the game remaining, Ron Hunt collided with the WBA goalkeeper, knocking the ball loose. Lazarus latched onto the loose ball and slammed it into the back of an empty net, his team winning the match and trophy 3–2. A£15,000 offer was placed by Reading for the player's services, but he decided not to move clubs. He spent a further year at QPR before being transferred to Crystal Palace for £10,000 in December 1967. Like Rangers, Palace were aiming for promotion at the time and manager Bert Head convinced Lazarus to move clubs. Lazarus made 39 appearances in season 1968–69, in which Palace achieved promotion to the top flight for the first time. "]}, {"page": "1967 Football League Cup Final", "response": ["QPR continued to be outplayed for the most part by their First Division opponents. In the twenty fifth minute, Clark once again ran with the ball down the left hand side of the pitch, outrunning QPR's Ron Hunt, before crossing it into the path of Jeff Astle. His subsequent shot was saved by QPR goalkeeper Peter Springett, who managed to push the ball around the post. QPR briefly had a chance for a counterattack as Mark Lazarus found himself on the halfway line with the ball, before taking it around Ian Collard and found the Albion defence out of position, leaving him with a clear path to goal. But the opposition players were gaining on him as he approached the penalty area, with the attack falling apart shortly afterwards. Nine minutes before half time, QPR found themselves under attack by Albion again with some cross pitch passing resulting in Clark's second goal of the game. QPR had a corner just before half time which fell to the feet of club captain Mike Keen, but his shot went off the post. The game went into half time at 2–0 to Albion.", "| MF ||5 || Ron Hunt"]}, {"page": "Hunt (surname)", "response": ["*Ron Hunt (born 1941), American baseball player", "*Ron Hunt (born 1933), English footballer", "*Ron Hunt (born 1945), English footballer"]}, {"page": "1966–67 Football League Cup", "response": ["| ||5 ||Ron Hunt"]}, {"page": "Ron Hunt (disambiguation)", "response": ["Ron Hunt (born 1941) is a former Major League Baseball player.", "Ron Hunt may also refer to:", "*Ron Hunt (footballer, born 1933) (1933–1999), English footballer (Colchester United)", "*Ron Hunt (footballer, born 1945) (1945–2018), English footballer (QPR)"]}, {"page": "2018–19 in English football", "response": ["* 23 August 2018: Ron Hunt, 72, Queens Park Rangers defender."]}, {"page": "Deaths in August 2018", "response": ["*Ron Hunt, 72, English footballer (Queens Park Rangers).QPR League Cup winner Ron Hunt dies aged 72"]}]}}