{"wiki_id": "http://www.wikidata.org/entity/Q7365874", "itemLabel": "Ronnie Golden", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronnie_Golden", "wikipedia_page": {"main": "Ronnie Golden, born Tony De Meur, is a British singer, guitarist and comedian. He was the founder of the band The Fabulous Poodles. After the group broke up, he worked as a comedian as a member of The Comic Strip. From the early 1980s he made many appearances at The Comedy Store and on the London alternative comedy circuit. He appeared in the second episode of the comedy series, The Young Ones, hanging upside-down from the ceiling as Buddy Holly still in his parachute.\nGolden now fronts an R&B and soul group, Ronnie and the Rex. He also writes songs and sketches for BBC Radio 4's The Right Time.\nA long-time musical collaborator with Barry Cryer, Golden and Cryer performed at the Nine Lessons and Carols for Godless People show at The Bloomsbury Theatre and Hammersmith Apollo in December 2009. Cryer and Golden's performance was broadcast on BBC Four on 23 January 2010.", "link_mentions": [{"page": "Barry Cryer", "response": ["* \"Peace & Quiet\", performed by Barry Cryer with Ronnie Golden at Nerdstock: 9 Lessons and Carols for Godless People, 2009."]}, {"page": "Mac McDonald", "response": ["At about this time McDonald joined another company, this time presenting children's shows in conjunction with the Inner London Education Authority. In 1982 he and another member, Hilary, left to form a three-person musical comedy troupe, The Cheap Shots, with McDonald's close friend Sakal providing the music. The threesome developed \"The Chip Shop Show\", a series of spoof musicals popular on the newly burgeoning London alternative comedy circuit, making many appearances at London's The Comedy Store alongside Ronnie Golden, John Hegley and others, including several future Red Dwarf players."]}, {"page": "Jammin' (radio programme)", "response": ["*Ronnie Golden"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Barry Cryer and Ronnie Golden"]}, {"page": "John Dowie (humourist)", "response": ["As a director, he worked on Heathcote Williams’ Whale Nation and Falling for a Dolphin, as well as directing shows by, among others, Neil Innes, Arthur Smith, Barry Cryer and Ronnie Golden, Simon Munnery and the late Pete McCarthy in The Hangover Show. His children’s show Dogman, directed by Victor Spinetti, was described by the Daily Mails Jack Tinker as the best show he had seen in Edinburgh that year. Dowie went on to write and perform Jesus – My Boy which was performed in London’s West End by Tom Conti, in Tel Aviv by noted Israeli comedian Gil Kopatz, and in various productions/translations in Canada, Sweden, Norway, Germany and the Netherlands. He retired from theatrical work entirely in 2005."]}, {"page": "Fabulous Poodles", "response": ["*Ronnie Golden"]}, {"page": "Tony De Meur", "response": ["#REDIRECT Ronnie Golden"]}, {"page": "Golden (name)", "response": ["*Ronnie Golden, British singer, guitarist and comedian"]}, {"page": "Nine Lessons and Carols for Godless People", "response": ["The presenter was Robin Ince. The participants shown in the BBC broadcast were Brian Cox, Mark Steel, Shappi Khorsandi, Richard Dawkins, Jim Bob, Simon Singh, Baba Brinkman, Ben Goldacre, Robyn Hitchcock, Richard Herring, Barry Cryer and Ronnie Golden"]}]}}