{"wiki_id": "http://www.wikidata.org/entity/Q7366011", "itemLabel": "Ronnie Tod", "itemDescription": "British army officer (1905-1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronnie_Tod", "wikipedia_page": {"main": "Brigadier Ronald John Frederick Tod  (3 November 1905 – 5 April 1975) was a British Army officer who was instrumental in the development of the British Commandos during the Second World War.", "link_mentions": [{"page": "Commandos (United Kingdom)", "response": ["The very first Commando raid – Operation Collar on 23 June 1940 – was not actually carried out by a Commando unit, but by one of their predecessors: No.11 Independent Company. The mission, led by Major Ronnie Tod, was an offensive reconnaissance carried out on the French coast south of Boulogne-sur-Mer and Le Touquet. The operation was a limited success; at least two German soldiers were killed whilst the only British injury was a flesh wound suffered by Lieutenant-Colonel Dudley Clarke, who had accompanied the raiders as an observer.Moreman, p.13. A second and similarly inconsequential raid, Operation Ambassador, was made on the German-occupied island of Guernsey on the night of 14 July 1940 by men from H Troop of No. 3 Commando and No. 11 Independent Company. One unit landed on the wrong island and another group disembarked from its launch into water so deep that it came over their heads. Intelligence had indicated that there was a large German barracks on the island but the Commandos found only empty buildings. When they returned to the beach heavy seas had forced their launch offshore, and they were forced to swim out to sea to be picked up."]}, {"page": "Operation Ambassador", "response": ["The raiding party consisted of 40 men from the newly formed No. 3 Commando under the command of Lieutenant Colonel John Durnford-Slater,Some sources state that Durnford-Slater was a major at the time, however, the discrepancy seems to stem from the fact that his rank of lieutenant colonel was a brevet rank, while he held an acting rank of major and substantive rank of captain. Durnford-Slater 2002, p. ix. and 100 men of No.11 Independent Company under Major Ronnie Tod.There is a minor discrepancy in the sources. Most sources state 140 men, but Chappell states that this number was actually 139 men in total, with 40 men from No. 3 Commando and presumably only 99 men from No. 11 Ind Coy. Chappell 1996, p. 5.", "Code named \"Ambassador\", it was decided that the operation would follow two preliminary operations code named \"Anger\".Cruickshank 1991, p. 81. The preliminary operations would be undertaken to gather necessary intelligence prior to a raid by 140 men which would land on the island of Guernsey and attack the airfield with the purpose of destroying aircraft and buildings, as well as capturing or killing members of the garrison. The units that were chosen for the raid were 'H' Troop from No. 3 Commando and No. 11 Independent Company. No. 3 Commando, under Lieutenant Colonel John Durnford-Slater, had only just been raised, having completed its recruitment on 5 July, and had not yet begun training, while No. 11 Independent Company under the command of Major Ronnie Tod had been raised earlier in JuneNo. 11 Independent Company was raised on 14 June from volunteers for commando service and members from the recently disbanded No. 9 Independent Company. Parker 2000, p. 21. and had a few weeks earlier undertaken Operation Collar, which had been a hastily organised and largely unsuccessful raid on Boulogne.Parker 2000, p. 22. During the planning stage, Durnford-Slater went to London where he worked out most of the details with David Niven, who was then serving as a staff officer in the Combined Operations Headquarters.Durnford-Slater 2000, p. 22."]}, {"page": "Tod", "response": ["* Ronnie Tod (1905–1975), British Army officer"]}, {"page": "Operation Roast", "response": ["On 1 April 1945 the whole of 2nd Commando Brigade was engaged in the operation. The brigade comprised No. 2, No. 9, No. 40 Royal Marine Commando and No. 43 (RM) Commando under the command of Brigadier Ronnie Tod."]}, {"page": "Gothic Line order of battle", "response": [":*British 2nd Commando Brigade (Brigadier Ronnie Tod) (1945)"]}, {"page": "Operation Collar (commando raid)", "response": ["Operation Collar was the codeword for the first commando raid conducted by the British forces during the Second World War. The location selected for the raid was the Pas-de-Calais department on the French coast. The British Commandos had not long been formed and were not yet trained, so the operation was given to No. 11 Independent Company under the command of Major Ronnie Tod.", "Under pressure from Winston Churchill to start raiding operations, Combined Operation Headquarters came up with Operation Collar. The objective of Operation Collar was to be a reconnaissance of the French coast and to capture prisoners. The raid was to take place just three weeks after Operation Dynamo, the evacuation of the British Expeditionary Force from Dunkirk, and the French had just signed the Second Armistice at Compiègne with Germany on 22 June 1940.Haining (2004), p.116 The newly formed British Commandos were not yet adequately trained and most units were still short of troops. So one of the independent companies which were in the process of being absorbed into the commandos was selected. The unit chosen was No. 11 Independent Company, under the command of Major Ronnie Tod of the Argyll and Sutherland Highlanders. No. 11 Company had been raised after the other Independent Companies on  14 June 1940. They were formed by asking for volunteers from the men already serving in the other companies and  had an establishment of 25 officers and 350 other ranks.Moreman (2006), p.13"]}, {"page": "2nd Special Service Brigade", "response": ["*Brigadier Ronnie Tod"]}, {"page": "No. 9 Commando", "response": ["No. 9 Commando undertook its first raid, Operation Sunstar, on the night of 22/23 November 1941 on the French coast at Houlgate. The raid was a success; the men landed and evacuated without any loss. After this raid, leadership of the commando was taken over by Lieutenant Colonel Ronnie Tod."]}, {"page": "British Commando operations during the Second World War", "response": ["The first commando raid was Operation Collar, which took place on 24/25 June 1940.Clarke, Dudley. \"The Birth of the Commandos\". The Listener. 25 November 1948. p. 799. The raid  was not carried out by a commando unit, but by one of their predecessors, No.11 Independent Company. Under the command of Major Ronnie Tod it was an offensive reconnaissance on the French coast south of Boulogne-sur-Mer and Le Touquet. The operation was a limited success, and the only British injury was a bullet graze to Lieutenant Colonel Dudley Clarke (who was there as an observer), while at least two German soldiers were killed.Moreman, p.13 A second and similarly inconsequential attack, Operation Ambassador, was launched on the German-occupied island of Guernsey on the night of 14 July 1940, by men drawn from H Troop of No. 3 Commando under command of John Durnford-Slater and No. 11 Independent Company. One unit landed on the wrong island, another disembarked from its launch into water that came over their heads. Intelligence had indicated that there was a large German barracks on the island but the Commandos only discovered empty buildings. On their return to the beach they discovered that heavy seas had forced their launch off shore and they then had to swim out to sea to get picked up.Haswell, p.47", "On 1 April 1945, the whole of 2nd Commando Brigade, consisting of Nos. 2, 9, 40 (RM) and 43 (RM), under Brigadier Ronnie Tod were engaged in Operation Roast at Comacchio lagoon, north east Italy. This was the first major action in the big spring offensive to push the Germans back across the River Po and out of Italy. After a fierce three-day battle, the Commandos succeeded in clearing the spit separating the lagoon from the Adriatic, so securing the flank of the 8th Army and fostering the idea the main offensive would be along the coast and not though the Argenta Gap."]}]}}