{"wiki_id": "http://www.wikidata.org/entity/Q7360160", "itemLabel": "Roland Beamont", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Roland_Beamont", "wikipedia_page": {"main": "Wing Commander Roland Prosper \"Bee\" Beamont,  (10 August 1920 – 19 November 2001) was a British fighter pilot for the Royal Air Force and an experimental test pilot during and after the Second World War. He was the first British pilot to exceed Mach 1 in a British aircraft in level flight (P.1A), and the first to fly a British aircraft at Mach 2 (P.1B).During the Second World War, he flew more than five hundred operational sorties. He also spent several months as a Hawker experimental test pilot developing the Hawker Typhoon and Tempest, and was responsible for introducing these types into operational squadron service. He pioneered the ground attack capabilities of the Typhoon and led the air to air campaign against the V-1 flying bomb\nIn 1945 he commanded the Air Fighting Development Squadron at RAF Central Fighter Establishment, before leaving the service in 1947. During his subsequent career as English Electric Aviation chief test pilot (and later for BAC), he directed the flight test programmes of the Canberra, the Lightning, and TSR-2, making the maiden flight of each type.When he retired from test flying in 1968, he had flown 167 different types during a total of 5,100hr and 8,000 flights—of which more than 1,100 were supersonic. He set three Atlantic records in the Canberra, including Britannia Trophy for the first double Atlantic flight in one day. In 1971, he became Panavia flight operations director, responsible for the testing of the Tornado, retiring in August 1979 following the maiden flight of the first production Tornado. After retirement he contributed to aviation journals and wrote a number of books about his experiences.\nBeamont was a careful pilot who understood the capabilities of the aircraft he flew. He was proud that he had never broken an aircraft, nor had to bail out or eject. Even when his Tempest was shot down, he had made the best landing possible in the circumstances and got out, free of injury.", "link_mentions": {}}}