{"wiki_id": "http://www.wikidata.org/entity/Q7366967", "itemLabel": "Ros Altmann", "itemDescription": "UK pensions expert and campaigner", "wikipedia_url": "https://en.wikipedia.org/wiki/Ros_Altmann", "wikipedia_page": {"main": "Rosalind Miriam Altmann, Baroness Altmann, CBE (born 8 April 1956) is a British life peer, leading UK pensions expert, and political campaigner. She was appointed to the House of Lords following the 2015 general election as a Conservative, but describes her work both before and after the election as being politically independent, championing ordinary people and social justice.She became well known in 2002 for leading the \"pensionstheft\" campaign on behalf of 150,000 workers and their families whose company pensions disappeared when their employers' final salary scheme failed. Having been assured their pensions were safe and protected by law, these workers from companies such as Allied Steel and Wire, Kalamazoo Computer Group, Dexion, British United Shoe Machinery and UEF suddenly faced losing their whole life savings and her work contributed to establishing the Pension Protection Fund and the Financial Assistance Scheme. She has also supported the campaign for people whose pensions were placed in peril by Equitable Life.\nIn 2011, she campaigned against the sudden, short notice increases in women's state pension age, achieving success in reducing the planned rises, and was instrumental in highlighting the injustices of the annuities market, which culminated in the Government's announcement of the end to quasi-mandatory annuitisation of pensions. Although best known for her work on pensions, she is also involved in economic analysis and most recently in highlighting the inadequacies of the social care system.  She has twice been the recipient of the Pensions Personality of the Year Award.  She is a governor of the London School of Economics. and also an advisor to the International Longevity Centre – UK. She was Director General of the Saga Group from 2010 to 2013.  In 2011 her work as the \"leading commentator on pensions and other matters affecting the lives of the nation's over 50s\" was recognised when she was presented with the Public Affairs Achiever of the Year award.", "link_mentions": [{"page": "Mike O'Brien (British politician)", "response": ["On 29 June 2007, O'Brien was appointed as Minister of State for Pension Reform in the Department for Work and Pensions under Secretary of State Peter Hain. Referring to the long running Pensions Action Group campaign and speaking on the BBC Radio 4 Moneybox programme on the day compensation was announced,  pensions expert Ros Altmann, credited Peter Hain and O'Brien with \"having been very different to deal with than their predecessors and ... willing and eager to engage and find a way to sort this out.\" The Pensions Act 2008 completed its major stages whilst O' Brien was minister and received Royal Assent in November 2008."]}, {"page": "Edward Garnier", "response": ["Workers joined Ros Altmann's company pensions campaign blaming Venture Capitalist Apax Partners for having engineered the collapse and Garnier was the first East Midlands MP to question Apax's role. Apax's chairman at the time was a major donor to the Labour Party and Garnier asked what discussions \"Ministers have had with Sir Ronald Cohen ..about the collapse of the pension scheme\". Garnier raised the issue again with the new Minister for Pensions Reform Stephen Timms citing the \"mysterious circumstances\" under which the pensions disappeared. Timms agreed to \"look into\" the complaints saying that \"in recent years, there have been too many instances of that kind.\""]}, {"page": "List of people associated with University College London", "response": ["* Baroness Ros Altmann (Economics and later lecturer), UK pensions expert and former government minister"]}, {"page": "Mike Penning", "response": ["Dexion workers, 700 of whom worked in the constituency, lost their pensions when the company went into receivership in 2003. Dexion played a prominent part in Dr Ros Altmann's Pensions theft campaign. Penning, whose support for Dexion preceded his election, offered compensation from unclaimed assets in his 2005 Manifesto and has spoken on the issue 26 times in Parliament. Dexion pensioners were featured celebrating a victory at the High Court in February 2007 which eventually led to increased compensation from the then-Labour government."]}, {"page": "Apax Partners", "response": ["The circumstances surrounding the demerger, transfer of assets and subsequent collapse of the British United Shoe Machinery in 2000 led to questions about Apax's behaviour being raised in Parliament by MPs of both main parties.  After calls for an enquiry into the loss of hundreds of pensions were refused, Ros Altmann, the pensions expert and, as of 2015, UK Pensions minister described it  \"one of the worst cases ..I have seen  ..the actions of the former owners - Apax have been immoral.\" The Member of Parliament Ashok Kumar said,  \"I think these people needed flogging  ..these are greedy, selfish, capitalists who live on the backs of others.\""]}, {"page": "List of people associated with the London School of Economics", "response": ["* Ros Altmann, Baroness Altmann, Minister of State for Pensions"]}, {"page": "Henrietta Barnett School", "response": ["* Ros Altmann, Minister of State for Pensions (2015–2016)"]}, {"page": "British United Shoe Machinery", "response": ["The failure caused little initial surprise or anger as shop floor Convenor and Pensions Trustee Bob Duncan had long assured workers that whatever happened to the Company their pensions were safe. Unfortunately and unknown to Duncan, the official advice on which this was based on simply wasn't true. As one of four Judicial Review litigants, Duncan played a key part in Dr Ros Altmann's eventually successful Pensionstheft campaign. Invited to give evidence before the Public Administration Select Committee, Duncan blamed the government's misleading information. The Committee agreed.", "Following advice from Ros Altmann workers went to see their MPs, and also found strong support from both National and local newspapers. They blamed Apax for having engineered the collapse Edward Garnier named Sir Ronald Cohen and asked what discussions \"ministers have had..about the collapse of the pension scheme\". Patricia Hewitt, the Health Secretary and a local MP also called for an enquiry. In a letter to Alan Johnson MP, the Department of Trade and Industry minister, she recommended \"that the Companies Investigation Branch should look at the concerns raised by my constituent. It may be that the problem falls between DTI and OPRA; but it is clearly important that such serious allegations are properly investigated.\" The response merely referred to the CIB investigation in 2002 and its conclusion that \"the issues raised were best dealt with by other bodies.\" Garnier raised the issue again with the new Minister for Pensions Reform Stephen Timms citing the \"mysterious circumstances\" under which the pensions disappeared. Timms agreed to \"look into\" the complaints saying that \"in recent years, there have been too many instances of that kind.\"  ", "Sir Ronald Cohen and Apax insist all questions have been addressed but in the absence of any meaningful enquiry, it was left to MPs, Ros Altmann, and the media to comment on Apax's behaviour.", "Ros Altmann described BUSM as  \"one of the worst cases of scheme wind-ups that I have seen.  ..the actions of the former owners - Apax - have been immoral.\""]}, {"page": "Pensions Management Institute", "response": ["The PMI's Annual Conference 2016 saw Baroness Ros Altmann open the event with a welcome speech in which she told delegates that 'the UK was in a pensions and retirement revolution with radical reform happening all the way through from state to private pensions.'"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Ros Altmann, Baroness Altmann"]}, {"page": "Kennedy Scholarship", "response": ["*Ros Altmann – economist, Baroness Altmann CBE, Ministor for Pensions (2015–),former member of Number 10 Policy Unit"]}, {"page": "Altmann (surname)", "response": ["* Ros Altmann, British pensions campaigner"]}, {"page": "Peter Hain", "response": ["He set a level of compensation for the taxpayer funded Financial Assistance Scheme similar to that of the Industry funded Pension Protection Fund (PPF) for those whose schemes had collapses before the establishment of the PPF. Referring to the long running Pensions Action Group campaign and speaking on the BBC Radio 4 Moneybox program on the day compensation was announced, pensions expert Ros Altmann, credited Hain and Mike O'Brien with \"having been very different to deal with than their predecessors and..willing and eager to engage and find a way to sort this out.\""]}, {"page": "Baroness Altmann", "response": ["#REDIRECT Ros Altmann"]}, {"page": "People's Vote", "response": ["In July 2017, the Parliament of the United Kingdom established an all-party parliamentary group (APPG) on the UK's relations with the European Union. Co-chairs are Chuka Umunna MP (Liberal Democrats, formerly Labour and Change UK) and Anna Soubry MP (Change UK, formerly Conservative); the remaining members of the group are Caroline Lucas MP (Green), Jo Swinson MP (Liberal Democrats), Jonathan Edwards (Plaid Cymru), Stephen Gethins MP (Scottish National Party), Ros Altmann (Conservative), Andrew Adonis (Labour), John Kerr (crossbench), Sharon Bowles (Liberal Democrats), and Dafydd Wigley (Plaid Cymru)."]}]}}