{"wiki_id": "http://www.wikidata.org/entity/Q7364739", "itemLabel": "Ronald Chetwynd-Hayes", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Chetwynd-Hayes", "wikipedia_page": {"main": "Ronald Chetwynd-Hayes (30 May 1919 – 20 March 2001) (a.k.a. Ronald Henry Glynn Chetwynd-Hayes or R. Chetwynd-Hayes) was a British author, best known for his ghost and horror stories.", "link_mentions": [{"page": "Isleworth", "response": ["* Ronald Chetwynd-Hayes (1919–2001) was born in Isleworth. For over 30 years, Chetwynd-Hayes published more than 200 short stories, 8 novels, and over 20 collections, as well as editing 24 anthologies including many of the Fontana Ghost Stories series of anthologies."]}, {"page": "Bram Stoker Award for Lifetime Achievement", "response": ["* 1988: Ray Bradbury – Ronald Chetwynd-Hayes"]}, {"page": "John Carradine filmography", "response": ["# The Monster Club (1981) as Ronald Chetwynd-Hayes"]}, {"page": "Brides of Dracula", "response": ["* In the alternate history novel Anno Dracula (1992), Dracula becomes dominant in Britain and eventually weds Queen Victoria, becoming Prince consort and Lord Protector. Despite being married to Victoria he keeps his retinue of Brides. It is mentioned that one of the Brides is Barbara of Celje. In the first sequel, The Bloody Red Baron, the Brides of Dracula are mentioned as including Mata Hari, Lady Marikova (from the novel The House of Dracula by Ronald Chetwynd-Hayes), Lola-Lola (from the film The Blue Angel), Sadie Thompson, Lemora and Baron Meinster (from the film The Brides of Dracula).In the beginning of the second sequel, Dracula Cha Cha Cha, a list of Dracula's official Brides is given. They are: Elisabeta of Transylvania (from Bram Stoker's Dracula), 1448–1462; Ilona Szilagy (Vlad III's real-life second wife), 1466–1476; Marguerite Chopin of Courtempierre (from Vampyr), 1709–1711; Queen Victoria, 1886–1888; and Sari Gábor, 1948–1949. The plot surrounds Dracula's engagement to Princess Asa Vajda (from Black Sunday)."]}]}}