{"wiki_id": "http://www.wikidata.org/entity/Q7368915", "itemLabel": "Rosie Rowell", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosie_Rowell", "wikipedia_page": {"main": "Rosie Rowell (born 29 April 1965) is a British actress, probably best known for her roles as Eileen Callan in Family Affairs (a role she played from 2002 until the series ended in 2005) and Donna Tucker in Soldier Soldier. She has also had parts in several other well-known British TV series, including The Bill, Casualty and Where the Heart Is, as well as providing voice-over for documentaries and television commercials.\n\n", "link_mentions": [{"page": "Family Affairs", "response": ["Charlotte Day (Leanne Lakey) arrived and began working at the Black Swan, quickly becoming a love interest for Pete Callan. She was later joined by her younger sister Lucy (Julia Lee Smith) and their mother Eileen (Rosie Rowell). After Charlotte's departure, Eileen and Lucy continued in the series, becoming involved in several highly dramatic events. Eileen soon became Pete Callan's fourth wife after his divorce from Siobhan.", "|Eileen Callan || Rosie Rowell || 2002–2005"]}, {"page": "Soldier Soldier", "response": ["*Rosie Rowell as Donna Tucker (Series 1-5)"]}, {"page": "Eileen Callan", "response": ["Eileen Callan (née Day) was a fictional character in the UK soap opera Family Affairs, played by Rosie Rowell from 2002 until the end of the series in 2005."]}, {"page": "List of Family Affairs characters", "response": ["Eileen Callan (née Day) was played by Rosie Rowell from 2002 until the final episode in 2005."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Rosie Rowell"]}, {"page": "Rob Spendlove", "response": ["In the 1990s, Spendlove was in a relationship with actress Sandy Hendrickse and have one daughter together, Bianca Hendrickse-Spendlove. He then began a relationship with actress Rosie Rowell and they had a daughter named Ruby. They later had a second child named Alfie."]}, {"page": "Gabriel & Me", "response": ["Jimmy Spud is a young loner living in the Byker Wall. Ever since his father threw him high in the air from South Shields pier, he dreamt of being able to fly, and specifically of being an angel. He lives with his brutish but terminally ill father, played by Iain Glen, his mother (Rosie Rowell) and philosophical grandfather (David Bradley). He is bullied at school. Whilst \"praying\" in a derelict and abandoned church one day, Jimmy is visited by Gabriel (Billy Connolly), who advises him on how to become an angel."]}, {"page": "1965 in British television", "response": ["*29 April – Rosie Rowell, actress"]}, {"page": "Casualty (series 13)", "response": ["*Rosie Rowell as Pam Wilson (episodes 5−16)"]}, {"page": "Sean O'Connor (producer)", "response": ["In 2005, O'Connor was appointed producer of the Channel 5 soap opera Family Affairs. He planned to revamp the show but was told that the show would be axed. He appointed Dominic Treadwell-Collins, his future predecessor in EastEnders as story producer and reintroduced characters Eileen Callan (Rosie Rowell) and Melanie Costello (Rebecca Hunter)."]}]}}