{"wiki_id": "http://www.wikidata.org/entity/Q7367907", "itemLabel": "Rose Prince", "itemDescription": "British food writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rose_Prince_(writer)", "wikipedia_page": {"main": "Rose Prince (born 4 December 1962) is a food writer, author, cook and activist. Her writing career did not start until her mid thirties. Previously she had worked as a chef and the cook in the Notting Hill specialist bookshop, Books for Cooks. She worked there with Clarissa Dixon Wright. She was the in-house cook at The Spectator magazine for seven years.\nShe has a weekly column in The Daily Telegraph. Her columns are widely syndicated. She also has a monthly column in the Catholic weekly, The Tablet (although herself an Anglican she is married to a Catholic). She is a prolific writer and contributes to The Daily Mail, The Spectator, The Times, and Sunday Telegraph. For three years she had a column on The Daily Express. In 2000 she produced a two-part biopic about the food writer, Elizabeth David for British broadcaster Channel 4 which also aired in Australia.\nShe contributes regularly to BBC Radio 4's The Food Programme and was a judge for its Food and Farming Awards in 2009. She was a member of the House of Lords Committee of Inquiry into the meat industry in 2000. She was the winner of a Glenfiddich Food and Drink Award in 2001 and in 2009 was named by Vogue magazine as one of the most inspirational women in Britain.In 2011 She launched the Pocket Bakery with her children Jack and Lara (then 8 and 11 years old), a community bakery run in her Battersea kitchen making slow fermentation (sourdough) breads for the neighbourhood. In 2012 the bakery transferred its weekly pop-up to the Doodle Bar in Battersea, providing pastries and bread for locals. A non-profit business, the children received pocket money as an income and other young workers were invited to take part with paid training in enterprise and baking skills.She is married to Dominic Prince, a fellow journalist and sometime amateur jockey. They have two children, Jack and Lara.", "link_mentions": [{"page": "Elizabeth David", "response": ["David's writing influenced the cultural approach of the British towards food.Culver, Carody (2012). \"A Pinch of Salt and a Dash of Plot: The Power of Narrative in Contemporary Cookbooks\". Contemporary Cookbooks (118): pp. 33–50. doi:10.1179/000127912805304873Humble, pp. 135–136 According to the food journalist Joanna Blythman, she \"performed both a cultural and gastronomic miracle in post-war Britain by introducing the nation to a vision of fresh Continental food\",Blythman, Joanna. \"Writer who performed a gastronomic miracle dies\", The Independent, 23 May 1992, p. 2 while the writer Rose Prince considers that David \"changed for ever the way British people cook\". Janet Floyd, professor of American Literature at King's College London, argues that David was not a driver of change, but came to epitomise that change.Floyd, p. 130 The literary historian Nicola Humble observes that \"the food revolution of the post-war years would probably have happened without Elizabeth David, though in her absence it would have happened very differently\".Humble, p. 136"]}, {"page": "The Art of Cookery Made Plain and Easy", "response": ["Rose Prince, writing in The Independent, describes Glasse as \"the first domestic goddess, the queen of the dinner party and the most important cookery writer to know about.\" She notes that Clarissa Dickson Wright \"makes a good case\" for giving Glasse this much credit, that Glasse had found a gap in the market, and had the distinctions of simplicity, an \"appetising repertoire\", and a lightness of touch. Prince quotes the food writer Bee Wilson: \"She's authoritative but she is also intimate, treating you as an equal\", and concludes \"A perfect book, then; one that deserved the acclaim it received.\""]}, {"page": "Elizabeth David bibliography", "response": ["David revised the book for a second edition, published in the UK and the U.S.  by Penguin Books. Translations were published in Italian in 1975 and Danish in 1980.\"Summer Cooking\" , WorldCat, accessed 17 May 2011 David further revised and enlarged the book for a third edition, published by Penguin in 1987. In 2009 the Folio Society published an edition with new illustrations by Sophie MacCarthy and an introduction by Rose Prince.\"Summer Cooking\" , Folio Society, accessed 17 May 2011"]}, {"page": "List of women cookbook writers", "response": ["*Rose Prince (born 1962), cookbook writer"]}]}}