{"wiki_id": "http://www.wikidata.org/entity/Q7368993", "itemLabel": "Rosita Spencer-Churchill, Duchess of Marlborough", "itemDescription": "British artist; third wife of John Spencer-Churchill, 11th Duke of Marlborough", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosita_Spencer-Churchill,_Duchess_of_Marlborough", "wikipedia_page": {"main": "Dagmar Rosita Astrid Libertas, Duchess of Marlborough (née Douglas, sometimes Spencer-Churchill; born 26 September 1943, Madrid), is a British artist of Swedish and German descent. She was the third wife of John Spencer-Churchill, 11th Duke of Marlborough, from 1972 until their divorce in 2008.", "link_mentions": [{"page": "Douglas (surname)", "response": ["* Rosita Spencer-Churchill, Duchess of Marlborough née Douglas"]}, {"page": "Vanderbilt family", "response": ["#Rosita Spencer-Churchill, Duchess of Marlborough (born 1943): 3rd wife of John Spencer-Churchill, 11th Duke of Marlborough"]}, {"page": "Charlbury", "response": ["On the outskirts of Charlbury is Lee Place, the former dower house of Ditchley and now the home of Rosita Spencer-Churchill, Duchess of Marlborough.  "]}, {"page": "Gustaf Douglas", "response": ["In 1963, he married Elisabeth von Essen, the daughter of Baron Eric von Essen and Louise (née Tamm). Gustaf and Elisabeth Douglas have two children, Carl and Eric. Both serve at different positions within the family group of companies. The Douglas family live at Rydboholm Castle outside Åkersberga. One of his younger sisters is Rosita Spencer-Churchill, Duchess of Marlborough third (and former) wife of John Spencer-Churchill, 11th Duke of Marlborough. Gustaf’s other sister, Princess Elisabeth, Duchess in Bavaria is married to Prince Max, Duke in Bavaria."]}, {"page": "Libertas Schulze-Boysen", "response": ["Libertas Schulze-Boysen was the youngest of three children. Her father was Heidelberg born, Otto Ludwig Haas-Heye couturier to aristocracy and her mother was noted pianist Viktoria Ada Astrid Agnes Gräfin zu Eulenburg. Libertas' parents had married in  on 12 May 1909 and had lived for a time in London and Paris. They were Christian protestants who believed in providing a religious upbringing to their children. Schulze-Boysen never became overtly religious to an extent that dictated her existence, although many of her early poems and later letters show her strong Christian roots. Her siblings consisted of her sister, who was Countess Ottora Maria Douglas-Reimer (1910-2001), who married Count Carl Ludvig Douglas,(1908–1961), a Swedish diplomat. The couple had four children, their first son was Count Gustav Archibald Sigvart Douglas (1938), a stockbroker, their first daughter was Princess Elisabeth Christina Douglas (1940), their second daughter Rosita Spencer-Churchill, Duchess of Marlborough (1943), an artist and their youngest son, Carl Philipp Morton, a civil engineer. Her older brother  (1912-2008), was a journalist and diplomat."]}, {"page": "Walburga Habsburg Douglas", "response": ["Walburga married the Swedish Count Carl Axel Archibald Douglas (born 27 November 1949 in Stockholm), son of Count Archibald Douglas and Baroness Margareta Lagerfelt, on 5 December 1992 in Budapest, Hungary. Her husband's family is a prominent noble family in Sweden, descended from the Scots Robert Douglas, Count of Skenninge, member of the Scottish Clan Douglas and founder of the Swedish branch of this noble house. The family's comital title, conferred by Queen Christina of Sweden in 1654, is legally recognized in the country.. Her husband is a first cousin of Princess Elisabeth, Duchess in Bavaria, and her siblings Rosita Spencer-Churchill, Duchess of Marlborough, and Count Gustaf Douglas, and first cousin once removed of Sophie, Hereditary Princess of Liechtenstein."]}, {"page": "Dagmar Spencer-Churchill, Duchess of Marlborough", "response": ["#REDIRECT Rosita Spencer-Churchill, Duchess of Marlborough"]}, {"page": "Duchess of Marlborough", "response": ["* Rosita Spencer-Churchill, Duchess of Marlborough (née Douglas, born 1943), third wife of the 11th Duke"]}, {"page": "Scandinavian migration to Britain", "response": ["| Rosita Spencer-Churchill, Duchess of Marlborough"]}, {"page": "Ludvig Douglas", "response": ["* Counts Douglas-Stjernorp, the branch descending from the Swedish general Archibald Douglas-Stjernorp, second son of Ludvig. This branch resides at Stjärnorp Castle and Rydboholm Castle. Archibald, through his eldest son, Carl Ludvig, is the grandfather of financier Count Gustaf Douglas and his sisters, Princess Elisabeth, Duchess in Bavaria and Rosita Spencer-Churchill, Duchess of Marlborough."]}, {"page": "Archibald Douglas (1883–1960)", "response": ["He was the father of the Ambassador Carl Ludvig Douglas (1908–1961) and company executive Gösta Archibald Douglas (1910–1992) and grandfather of financier Gustaf Douglas. Through his eldest son, Carl Ludvig, he is the grandfather of Princess Elisabeth, Duchess in Bavaria, wife of Prince Max, Duke in Bavaria. He is also the grandfather of Rosita Spencer-Churchill, Duchess of Marlborough, the third wife of John Spencer-Churchill, 11th Duke of Marlborough, they divorced in 2008."]}, {"page": "Countess Rosita Douglas", "response": ["#REDIRECTRosita Spencer-Churchill, Duchess of Marlborough"]}, {"page": "Duke of Marlborough (disambiguation)", "response": ["*Rosita Spencer-Churchill, Duchess of Marlborough (Dagmar Douglas) (b. 1943), the current Duchess"]}, {"page": "Spencer-Churchill", "response": ["*Rosita Spencer-Churchill, Duchess of Marlborough (born 1943), British artist"]}, {"page": "Dagmar Rosita Astri Libertas Douglas", "response": ["#REDIRECT Rosita Spencer-Churchill, Duchess of Marlborough"]}]}}