{"wiki_id": "http://www.wikidata.org/entity/Q7367734", "itemLabel": "Rose Gentle", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rose_Gentle", "wikipedia_page": {"main": "Rose Gentle is the mother of Gordon Gentle, a 19-year-old from Pollok who was killed in 2004 by a roadside bomb in Basra during the Iraq War. Since his death she has campaigned against the war and set up the Justice 4 Gordon Gentle campaign.  Alongside Reg Keys she is a founder member of Military Families Against the War. She has been a long term critic of Tony Blair's role in the Iraq War.", "link_mentions": [{"page": "Cairo Anti-war Conference", "response": ["The fifth Cairo Conference was held between March 29 and April 1, 2007. Its declaration is here . According to the Al-Ahram, the conference was organised by  Alkarama (Dignity), Al-Ishtirakyin Al-Sawryin (Socialist Revolutionary Party), Al-Ikhwan Al-Muslimin (Muslim Brotherhood) and Al-'Amal (Labour), and was held at the Egyptian Press Syndicate, with close to 600 participants and observers from around the world, including a delegation of 80 South Koreans and 20 Canadians.Al-Ahram  The Muslim Brotherhood reported there were activists present from Palestine (including Hamas members), Iraq, Lebanon, Venezuela, Turkey, Greece, Nigeria, Britain, Tunisia, Sudan, France and Iran. Speakers included Ali Fayed of Hizbullah, Sadala Mazraani of the Lebanese Communist Party, James Clark of the Canadian Peace Alliance, Feroze Mithiborwala of the Muslim Intellectual Forum of India,Al-Ahram  John Rees of the Socialist Workers Party (UK)Al-Ahram Weekly | Special | 'Our opponents are on the defensive'  and Rose Gentle (the mother of Gordon Gentle, a British soldier killed while serving in Iraq, and a leading figure in Military Families Against the War)."]}, {"page": "List of parties contesting the 2005 United Kingdom general election", "response": ["There are fifty-nine seats in Scotland.  The SNP stood in every one, while Labour, the Conservatives and Lib Dems did not contest the Speaker's seat and the SSP did not stand against the independent candidate Rose Gentle.  Several other parties stood in a smaller selection of constituencies."]}, {"page": "Scottish Socialist Party", "response": ["It worked closely with Military Families Against the War, particularly in the Justice 4 Gordon Gentle campaign, standing down at the 2005 general election for Rose Gentle in the East Kilbride constituency. In 2009, the grandmother of Dundee soldier Kevin Elliot, who died in Afghanistan, joined the party because of its firm anti-war stance. The party has also campaigned against rendition flights, including introducing a debate in the Scottish Parliament over the issue, and against the lack of response from the UK government in Israel's war on Lebanon."]}]}}