{"wiki_id": "http://www.wikidata.org/entity/Q7360342", "itemLabel": "Roland Mathias", "itemDescription": "Welsh poet and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Roland_Mathias", "wikipedia_page": {"main": "Roland Glyn Mathias (4 September 1915 – 16 August 2007) was a Welsh writer, known for his poetry and short stories. He was also a literary critic, and responsible with Raymond Garlick for the success of the literary magazine Dock Leaves (from 1949), later from 1957 The Anglo-Welsh Review. He edited it from 1961 to 1976. His other writing includes books on David Jones, Vernon Watkins and John Cowper Powys, and Anglo-Welsh Poetry 1480-1980 with Raymond Garlick.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Roland Mathias (1915–2007, W)"]}, {"page": "Llansantffraed", "response": ["The parish is the burial place of the poet Henry Vaughan (1621–1695), who was born in the hamlet of Scethrog within the parish. Vaughan's grave in the churchyard, on the slopes of a hill known as Allt-yr-Esgair or simply The Allt, overlooks the River Usk. The poets Siegfried Sassoon, Roland Mathias, Brian Morris and Anne Cluysenaar were all inspired to write poems by their visits to the grave. Sassoon's \"At the Grave of Henry Vaughan\" is the best-known of these and is read every year at the graveside following the Vaughan memorial service."]}, {"page": "Henry Vaughan", "response": ["Henry Vaughan was acclaimed less in his lifetime than after his death, on 23 April 1695 aged 74. He was buried in the churchyard of St Bride's, Llansantffraed, Powys, where he had spent most of his life.Images of Wales: St Bride's Church, Llansantffraed juxta Usk, Breconshire. Accessed 19 April 2014. The grave is visited by enthusiasts and has been the inspiration for other poets, including Siegfried Sassoon, Roland Mathias and Brian Morris."]}, {"page": "Welsh literature in English", "response": ["The beginnings of an Anglo-Welsh tradition are found by some in the novels of Allen Raine (Anne Adalisa (Evans) Puddicombe) (1836–1908), from Newcastle Emlyn, Carmarthenshire, whose work, Stephen Thomas Knight proposes, \"realised a real, if partial, separate identity and value for a Welsh social culture\".A Hundred Years of Fiction, p.25. (Other possible precursors are Monmouthshire-born Arthur Machen (1863–1947), and Joseph Keating (1871–1934), who began his working life as a South Wales miner.) However, many see the Carmarthenshire-born satirical short-story writer and novelist Caradoc Evans (1878–1945) as the first—or first modern—Welsh writer in English. His short-story collections My People (1915) and Capel Sion (1916) were highly controversial, and Roland Mathias bitterly comments that \"No other Anglo-Welsh prose writer. .. displayed such ill will to Wales or to Welsh people\".Anglo-Welsh Literature, p.82. W. H. Davies (1871–1940), born in Newport, became famous principally for his The Autobiography of a Super-Tramp which was set mostly in North America. The principal themes in his work are observations about life's hardships, the ways in which the human condition is reflected in nature, his own tramping adventures and the various characters he met. In his poetry he was particularly inspired by birds, the weather and the seasons. His prose works were nearly all autobiographical and were sometimes, as with his 1918 \"A Poet's Pilgrimage (or A Pilgrimage In Wales)\", set in his homeland. (See also Gerard Manley Hopkins (1844–89), Edward Thomas (1878–1917) and Joseph Keating (1871–1934).)", "Amongst these was Swansea suburbanite Dylan Thomas (1914–53), whose first collection, 18 Poems, was published in 1934. Then there is Geraint Goodwin (1903–41) from Newtown in mid-Wales, who, in such works as the novel The Heyday in the Blood (1936), wrote about declining rural communities in the border region. David Jones (1895–1974), whose father was from North Wales, was born in a London suburb. His epic poem In Parenthesis, which deals with his World War I experiences, was published in 1937. Another Swansea poet Vernon Watkins (1906–67) likewise does not belong with the main group of writers of the so-called First Wave from the South Wales mining communities. Roland Mathias suggests that \"his use of Welsh tradition was highly selective – only the ancient custom of the Mari Lwyd and the legend of Taliesin\".The Pocket Guide, p.112; Anglo-Welsh Literature, p.95. Alun Lewis (1915–44), from Cwmaman near Aberdare, published both poetry and short fiction and might well have been a major figure in the decades after the war but for his early death.", "Amongst other poets of the second half of the twentieth century, the names of Roland Mathias (1915–2007), Leslie Norris (1921–2006), John Ormond (1923–1990), Dannie Abse (born 1923), Raymond Garlick (born 1926), Peter Finch (born 1947), and Paul Groves (born 1947) have a significant place. With regard to the current situation of Welsh poetry in English, Ian Gregson suggests that \"much of the most exciting poetry in Britain is being written in Wales\". He singles out Oliver Reynolds (born 1957), Gwyneth Lewis (born 1959), and Stephen Knight (born 1960) as having fulfilled \"their early promise\".The New Poetry in Wales. Cardiff: University of Wales Press, 2007, p.1.", "*Roland Mathias, Anglo-Welsh Literature: An Illustrated History . Poetry Wales Press: Brigend, 1987."]}, {"page": "John Cowper Powys", "response": ["Powys's first published works were poetry: Odes and Other Poems (1896), Poems (1899), collections which have \"echoes […] of Tennyson, Arnold, Swinburne, among contemporaries, and of Milton and Wordsworth and Keats\". These were published with the assistance of his cousin Ralph Shirley, who was a director of William Rider and Son the publisher of them.name=Kenneth Hopkins 1964, p. 13 In the summer of 1905 Powys composed \"The Death of God\" an epic poem \"modelled on the blank verse of Milton, Keats, and Tennyson\" that was published as Lucifer in 1956.Autobiography (1967), p. 338. Lucifer was published by Macdonald. There were three further volumes of poetry: Wolf's Bane (1916), Mandragora (1917) and Samphire (1922). The first two collections were published by Powys's manager G. Arnold Shaw. An unfinished, short narrative poem \"The Ridge\" was published in January 1963, shortly before Powys's death that June.Review of English Literature, vol. IV, no.1, pp. 53–58. In 1964 Kenneth Hopkins published John Cowper Powys: A Selection from his Poems and in 1979 the Welsh poet and critic Roland Mathias thought this side of Powys worthy of critical study and published The Hollowed-Out Elder Stalk: John Cowper Powys as Poet.London: Enitharmon Press. Belinda Humfrey, suggests that \"[p]erhaps Powys's best poems are those given to Jason Otter in Wolf Solent and Taliessin in Porius.\"\"Introduction\" to Essays on John Cowper Powys, ed. Belinda Humfrey. Cardiff: University of Wales Press, 1972, p. 24."]}, {"page": "Penguin poetry anthologies", "response": ["Drummond Allison - Kenneth Allott - Patrick Anderson - W. H. Auden - George Barker - John Bayliss - William Bell - Peter Black - George Bruce - Demetrios Capetanakis - Leonard Clark - Alex Comfort - Dorian Cooke - R. N. Currey - Paul Dehn - Patric Dickinson - Keith Douglas - Lawrence Durrell - D. J. Enright - Robin Fedden - G. S. Fraser - Ernest Frost - Roy Fuller - Roland Gant - Wrey Gardiner - David Gascoyne - W. S. Graham - K. R. Gray - Bernard Gutteridge - Michael Hamburger - John Heath-Stubbs - Alexander Henderson - J. F. Hendry - John Jarmain - Seán Jennett - Sidney Keyes - Francis King - James Kirkup - Christopher Lee - Laurie Lee - Patrick Leigh Fermor - Alun Lewis - C. Day-Lewis - Reg Levy - Robert Liddell - Emanuel Litvinoff - Norman MacCaig - Neil McCallum - Louis MacNeice - Roland Mathias - J. S. Mollison - James Monahan - Jane Moore - Nicholas Moore - Norman Nicholson - Julian Orde - David Paul - Mervyn Peake - F. T. Prince - Kathleen Raine - Henry Reed - Anne Ridler - Iver Roberts-Jones - W. R. Rodgers - Alan Rook - Alan Ross - Vernon Scannell - Francis Scarfe - Lawrie Scarlett - Bernard Spencer - Stephen Spender - Hal Summers - Julian Symons - Dylan Thomas - R. S. Thomas - Frank Thompson - Terence Tiller - Ruthven Todd - Henry Treece - James Walker - Vernon Watkins - Paul Widdows"]}, {"page": "King Edward VI Five Ways School", "response": ["#Roland Mathias 1964 - 1969"]}, {"page": "Talybont-on-Usk", "response": ["*Roland Mathias (1915-2007), poet and short story writer."]}, {"page": "1972 in Wales", "response": ["*Roland Mathias – Absalom in the Tree"]}, {"page": "Raymond Garlick", "response": ["After teaching at Bangor he moved to Pembroke Dock in April 1949, to take up a post teaching English at Pembroke Dock County School, under Roland Mathias.  That year, at the age of twenty-three, he became a co-founder of the review, Dock Leaves (from 1958 renamed The Anglo-Welsh Review) and from 1949 to 1960 was its first editor. As editor he made contacts with many writers of Welsh and English; and during this time he also began broadcasting for the BBC. These years saw the appearance of his first books of poems – Poems from the Mountain House (1950), The Welsh-Speaking Sea (1954) and Requiem for a Poet (1954).", "In 1960 he left Wales, gave up his editorship of the Anglo-Welsh Review and began to teach at an international school at Eerde in the Netherlands. But in 1967 he returned to Wales, and eventually he became a Principal Lecturer, in charge of the Welsh Studies course, at Trinity College, Carmarthen (now part of the University of Wales, Trinity Saint David). There with enthusiasm he introduced his students to the works of such writers as David Jones, Idris Davies, Glyn Jones, Alun Lewis, Dylan Thomas, R. S. Thomas, John Ormond and Leslie Norris. His own poetry was influenced by the writings of Roy Campbell, and of R. S. Thomas and John Cowper Powys. During these years he published his A Sense of Europe (1968), A Sense of Time (1972) and Incense (1976), as well as his study, An Introduction to Anglo-Welsh Literature (1970) and the anthology, Anglo-Welsh Poetry 1480–1980 (1984) (which he edited with Roland Mathias). He also established a link with the Central University of Iowa, USA, for their module on Anglo-Welsh literature.  He continued lecturing at Trinity until he retired in 1987, when his Collected Poems 1946–86 appeared. He continued to live at Carmarthen, until at the end of his life he moved to a care home in Cardiff."]}, {"page": "1942 in Wales", "response": ["*Roland Mathias - Days Enduring"]}, {"page": "Literature Wales", "response": ["The Academi was initially formed as a Welsh language society in 1959, following a public discussion between Robert Maynard Jones and the poet Waldo Williams. The Academi attracted notable Welsh writers and academics into its society from the beginning, and while a Welsh language–only publication, had as its chairmen Iorwerth Peate (1959–1963), T. J. Morgan (1963–1966) and J. E. Caerwyn Williams (1966–1975). An English-language section was added in 1968 through the initiative of the editor and linguist Meic Stephens in his capacity as literature director of the Welsh Arts Council. The first chairman of the English-language section was Glyn Jones, who held the post until 1973. He was followed by Roland Mathias (1973–1978), G. O. Jones (1978–1981), Sam Adams (1981–1984), Tony Curtis (1984–1987), Gillian Clarke (1987–1993) and Sally Roberts Jones (1993–1997). The Welsh-language chairmen after J. E. Caerwyn Williams were R. M. Jones (1975–1978), Alun Llywelyn-Williams (1978–1982), R. Gerallt Jones (1982–1987), R. Geraint Gruffydd (1987–1990), Gwenlyn Parry (1990–1991), Harri Pritchard Jones (1991–1996) and Nesta Wyn Jones (1996–1998)."]}, {"page": "St Clement Danes School", "response": ["* Roland Mathias, poet"]}, {"page": "Nigel Jenkins", "response": ["* 1985: Common Ground, (with Roland Mathias, Robert Minhinnick, John Tripp, Gillian Clarke, Jeremy Hooker and Anne Stevenson, ed. Susan Butler), Poetry Wales Press"]}, {"page": "2007 in the United Kingdom", "response": ["** Roland Mathias, poet and literary critic (born 1915)"]}, {"page": "2007 in Wales", "response": ["**Roland Mathias, poet, 91"]}, {"page": "1915 in Wales", "response": ["*4 September - Roland Mathias, poet and critic (died 2007)"]}, {"page": "1915 in the United Kingdom", "response": ["* 4 September – Roland Mathias, Welsh poet (died 2007)"]}, {"page": "Deaths in August 2007", "response": ["*Roland Mathias, 91, British poet and literary critic."]}, {"page": "Owen Glendower (novel)", "response": ["When John Cowper Powys began Owen Glendower in April 1937 he referred to it in his diary, as \"my Romance about Owen Glyn Dwr \",Quoted in W. J. Keith, Aspects of John Cowper Powys's Owen Glendower (London: The Powys Society, 2008), p. 20. but then, in subsequent years, he generally referred to it as a historical novel, and it was so sub-titled when it was published.W. J. Keith, Aspects of John Cowper Powys's Owen Glendower, pp. 20-21 This description of the novel is supported by a scholarly introduction, or \"Argument\", giving historical background both to Glendower and to the period, which indicates, Powys had thoroughly researched his subject.See \"Argument\" to Owen Glendower (1941), pp. vii-xx (It came at the end of the British edition of 1942), and Morine Krissdottir, Descents of Memory, p. 330. Indeed the novel reveals that \"Powys was no amateur in the academic world\"C. A. Coates, John Cowper Powys in Search of a Landscape (Totowa, NJ: Barnes and Noble, 1982), p.137.Herbert Davies comments, in John Cowper Powys (Brigend: Seren,1997). p. 125: \"The Argument he appends to the novel shows an awesome grasp of the historical context\". Glen Cavaliero, John Cowper Powys: Novelist (Oxford: The Clarendon Press, 1973), p. 107: \"The whole background of fifteenth-century Wales is presented with unobtrusive artistry\". But Welshman Roland Mathias, is highly critical of Powys's handling of Welsh history, arguing that he \"chooses to ignore the heart and spirit of early fifteenth-century Wales in favour of a deep-rooted theory of his own\".\"John Cowper Powys and 'Wales': A limited study\". Powys Review 17 (1985), p. 22.But another Welshman, Meirion Pennar, has a more favourable opinion. \"In Search of the Real Glendower\", Powys Review, 18 (1986), pp. 20-23. See also Jeremy Hooker's sensitive response to Mathias, \"John Cowper Powys: Figure of the Marches\", in Imagining Wales (Cardiff: University of Wales Press, 2001), pp. 95-6."]}, {"page": "Cowley International College", "response": ["* Roland Mathias (1915-2007), poet"]}, {"page": "Christine Evans (poet)", "response": ["While on maternity leave in 1976, Christine Evans started writing poems in English. Her first book, Looking Inland, appeared seven years later. Cometary Phases was declared Welsh Book of the Year in 1989. Her Selected Poems won her the inaugural Roland Mathias Prize in 2005, from the Brecknock Society and Museum Friends, for its \"fresh eye and boldness of metaphor, a sense of living on the threshold of other worlds.\""]}, {"page": "Brecknock Society and Museum Friends", "response": ["The organization publishes the historical journal Brycheiniog since 1955. It also awards the annual Roland Mathias Prize, a literary prize named after author Roland Mathias.Staff report (February 9, 2005). Welsh writers shortlisted for new literary prize. News Wales, ISSN 1744-4004 In 2007, they successfully petitioned for government funds to restore the Brecknock Museum and Art Gallery.  Staff report (November 12, 2007). Museum's £400,000 repairs grant  BBC News"]}, {"page": "Patrick McGuinness", "response": ["*2005 Roland Mathias Prize, shortlist, The Canals of Mars"]}, {"page": "Glyn Mathias", "response": ["Mathias was born on 19 February 1945, and is one of three children of the writer and poet Roland Mathias (1915–2007) and Mary Annie (Molly) Hawes. He moved around the country as he grew up, as his father (a teacher at the time) taught in places including Carlisle, London, and Pembroke.", "In 2005, the Roland Mathias Poetry Prize was established under the auspices of the Brecknock Society and Museum Friends, and Glyn Mathias was its Committee chairman from 2005 to 2011. He has also been a director of Autism Cymru, The Beacons Trust and Brecon Action Ltd. In 2011, Mathias became Chair of OFCOM's Advisory Committee for Wales and a member of the OFCOM Content Board. In the same year, he became Chair of the New Welsh Review."]}, {"page": "The Anglo-Welsh Review", "response": ["The Anglo-Welsh Review was a literary and cultural magazine published in Wales between 1949 and 1988.Anglo-Welsh Review Archive, National Library of Wales Its original title was ″Dock Leaves″, a reference to the fact that it was published in Pembroke Dock, the town in which its founding editor Raymond Garlick lived and taught in the local school. He published an account of the early years of the magazine in 1971.\"Planet\" No. 9 pp.71-76 The name was changed in 1957 to reflect the editor’s work in defining a tradition of writing known as ‘Anglo-Welsh Literature’, prefigured in an editorial to the magazine in 1952 expressing the hope that “someone will persuade a publishing house to put forth a badly needed anthology of Anglo-Welsh poetry”.Editorial to ″Dock Leaves″ Spring 1952 Garlick, together with fellow founder of the magazine Roland Mathias, eventually published such an anthology.″Anglo-Welsh Poetry 1480-1980″ (Poetry Wales Press, 1984) The name change also placed the magazine in a tradition with ″The Welsh Review″ (1939-1948). Roland Mathias took over the editorship in 1960 by which time, financially supported by the Welsh Arts Council, it had become more substantial both in terms of the number of pages and the breadth of its coverage of Welsh cultural life. The magazine was subsequently edited by Gillian Clarke who joined Roland Mathias as Reviews Editor in 1973 and became its editor in 1976. Greg Hill joined her as Reviews Editor in 1980 and himself became editor in 1985.", "The growth of the book review section indicates an  attempt to provide a coverage of all aspects of Welsh life but also enabled a series of reviews editors to take on a substantial editorial role and gradually move to co-editing before taking over as main editors. This process is well documented in memoirs by Gillian Clarke Interview published in ″Common Ground″ ed. Susan Butler (Poetry Wales Press, 1985) Roland Mathias guest editorial  to ″The Anglo-Welsh Review″ no 78 and Greg Hill.‘Gillian Clarke as Editor in ″Trying the Line″ ed. Menna Elfyn,pp. 31-36 (Gomer Press, 1997) The magazine had been printed since its early days and eventually published by  Five Arches Press and ceased publication in 1988 following a review of franchise arrangements linking Welsh Arts Council funded publications with printers.As indicated in the editorial to ″The Anglo-Welsh Review″, No 86 Following this review the publication grant was awarded to a consortium including The Welsh Academy for a magazine which has since been published as New Welsh Review."]}, {"page": "Jane Aaron (educator)", "response": ["In 1998, Aaron herself produced Pur Fel y Dur: Y Gymraes yn Llen Menywod y Bedwaredd Ganrif ar Bymtheg, an account in Welsh of the contribution by women to 19th-century Welsh literature. For this she received the Ellis Griffith Memorial Prize in 1999. She also wrote Nineteenth-Century Women's Writing in Wales: Nation, Gender and Identity (2007), for which she was awarded the Roland Mathias Prize in 2009."]}, {"page": "Tiffany Atkinson", "response": ["Tiffany Atkinson (born 1972) is a British academic and award-winning poet. In 1993, she moved to Wales, where after completing her studies in Cardiff, she became a lecturer in English and Creative Writing at Aberystwyth University. In 2014, she was appointed Professor of Creative Writing at the University of East Anglia. She was the recipient of the Roland Mathias Poetry Award.", "Atkinson has published three poetry collections: Kink and Particle (2006), Catulla et al (2011), and So Many Moving Parts (2014). Kink and Particle looks back on a thirty-year-old's memories of childhood and adolescence, and glimpses the future. The book gained positive reviews, won the Jerwood Aldeburgh First Collection Prize and became a Poetry Book Society Recommendation. Catulla et al is a modern rendering of the poetry of Catullus. Writing in The Guardian, Patrict McGuinness welcomes the collection as being \"in the finest tradition of creative adaptation: keeping the originals as ballast, but unafraid to sail off on their own tangents.\" So Many Moving Parts, depicting the awkward relationship of body and spirit and their sometimes surprising practical effects, won the Roland Mathias Poetry Award in 2015."]}]}}