{"wiki_id": "http://www.wikidata.org/entity/Q7367711", "itemLabel": "Rose English", "itemDescription": "British actor and film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Rose_English", "wikipedia_page": {"main": "Rose English is a British artist working in performance, installation, theatre, dance and film. She has been writing, directing and performing her own work for over thirty five years in venues as various as Tate Britain; Royal Court Theatre; Queen Elizabeth Hall; the Adelaide Festival; and Lincoln Center, New York. Her productions feature a diversity of co-performers including musicians, dancers, circus performers, magicians and horses.\nHer shows range from her site-specific performances and collaborations of the 1970s including Quadrille, Berlin and Mounting, her acclaimed solos of the 1980s including Plato's Chair and The Beloved to her large scale spectaculars of the 1990s including Walks on Water, The Double Wedding and Tantamount Esperance.\nHer internationally celebrated solo with a horse – My Mathematics – was produced by Michael Morris' Cultural Industry, and a series of vignettes with horses were presented by The Banff Centre, Canada and The Serpentine Gallery, London. The Long Time Ago Story – a collaboration with a composer David Sawyer was commissioned for BBC Radio 4 in 2003. Ornamental Happiness, a show in song and circus, opened the Liverpool Biennial of Contemporary Art in 2006, followed by Flagrant Wisdom commissioned by the National Glass Centre in 2009. The full length sequel featuring flying, glass, singing and Chinese acrobatics is currently in development.\nEnglish's performance works of the 1970s featured in the exhibition WACK! Art and the Feminist Revolution at the Museum of Contemporary Art, Los Angeles, and toured museums in the US and Canada 2007/2009. Her installation STORYBOARD, commissioned by the National Glass Centre featured in Interloqui, a group exhibition at Caterina Tognon Arte Contemporanea, to coincide with the 54th Venice Biennale, 2011. She exhibited an installation composed of elements and documents relating to her 1975 performance, Quadrille, in Taking Matters into Our Own Hands at Richard Saltoun and Karsten Schubert, London 2013.\nShe co-wrote and designed the feature film The Gold Diggers, directed by Sally Potter in 1983; digitally re-mastered and released on BFI DVD in 2009.\n\n...The Gold Diggers is a key film of early 80s feminist cinema. Made with an all-woman crew, featuring stunning photography by Babette Magolte and a score by Lindsay Cooper it embraces a radical and experimental narrative structure. Celeste (Colette Laffont) is a computer clerk in a bank who becomes fascinated by the relationship between gold and power. Ruby (Julie Christie) is an enigmatic film star in quest of her childhood, her memories and the truth about her own identity. As their paths cross they come to sense that there could be a link between the male struggle for economic supremacy and the female ideal of mysterious but impotent beauty.\nEnglish's work with dance includes choreographing Ariadne auf Naxos at the Munich Staatsoper, directed by Tim Albery and her collaborations with choreographer Matthew Hawkins, including Angels and Exiles at the Royal Opera House.\nAs an actress English has appeared in a wide range of theatre, film and television productions, working with directors including Richard Jones, Sally Potter and Nick Philippou. She has appeared in Mauvaise passe; Our Mutual Friend; Surviving Picasso; Cracker (UK TV series); The Brooch Pin and Sinful Clasp; and The Witches.English's awards include The Time Out Performance Award, The Wingate Scholarship and the Paul Hamlyn Award for Artists.", "link_mentions": [{"page": "1996 in film", "response": ["| Surviving Picasso || Warner Bros. Pictures || James Ivory (director); Ismael Merchant, David L. Wolper (screenplay); Anthony Hopkins, Natascha McElhone, Julianne Moore, Joss Ackland, Peter Eyre, Jane Lapotaire, Joseph Maher, Bob Peck, Diane Venora, Joan Plowright, Dennis Boutsikaris, Peter Gerety, Susannah Harker, Dominic West, Laura Aikman, Nigel Whitmey, Leon Lissek, Andreas Wisniewski, Anthony Milner, Tom Fisher, Vernon Dobtcheff, Hamish McColl, Sandor Eles, Brigitte Kahn, Olegar Fedoro, Rose English, Judith Sharp || Period, Drama || Live action"]}, {"page": "1990 in film", "response": ["| The Witches || Warner Bros. Pictures || Nicolas Roeg (director); Allan Scott (screenplay); Anjelica Huston, Mai Zetterling, Jasen Fisher, Rowan Atkinson, Jane Horrocks, Charlie Potter, Anne Lambton, Angelique Rockas, Annabel Brooks, Sukie Smith, Bill Paterson, Brenda Blethyn, Jenny Runacre, Emma Relph, Rose English, Nora Connolly, Rosamund Greenwood, Darcy Flynn, Vincent Marzello, Elsie Eide, Grete Nordrå, Ola Otnes, Merete Armand, Jim Carter, Roberta Taylor, Stella Tanner, Barbara Hicks, Michael Palin || Comedy, Fantasy || Live action"]}, {"page": "Surviving Picasso", "response": ["* Rose English "]}, {"page": "The Witches (1990 film)", "response": ["* Rose English as Dora, a witch"]}, {"page": "List of Sundance Film Festival selections", "response": ["|Sally Potter, Rose English"]}, {"page": "The Gold Diggers (1983 film)", "response": ["The Gold Diggers is a 1983 British film directed by Sally Potter, her debut, and stars Julie Christie, Kassandra Colson and Siobhan Davies. It was written by Sally Potter and Rose English. The movie was made with an all-female crew, and features photography by Babette Mangolte and a score by Lindsay Cooper."]}, {"page": "David Charles Manners", "response": ["David designed and/or made costumes for performance artist Rose English, dance company Moving Mountains, theatre company 20th-Century Vixen and Glyndebourne Festival Opera."]}, {"page": "Carousel (charity)", "response": ["Aggiss and Cowie created three more shows with the company: 'La Soupe' (1990), 'The Surgeon's Waltz' (2000) and 'Rice Rain' (2001). Other choreographers who worked with High Spin included Rose English, Ben Craft, Laurie Booth, Miriam King and Maxine Doyle. High Spin came to an end following the decision to move away from integrated arts to projects controlled by the learning disabled artists themselves."]}, {"page": "WACK! Art and the Feminist Revolution", "response": ["* Rose English British performance artist"]}, {"page": "Jacky Lansley", "response": ["In 1972 Lansley began choreographing for Richard Alston CBE's Strider dance company. In 1974-1977 along with Sally Potter and Rose English, Lansley co-founded Limited Dance Company with a focus on performance based art."]}]}}