{"wiki_id": "http://www.wikidata.org/entity/Q7365116", "itemLabel": "Ronald Millar", "itemDescription": "British actor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Millar", "wikipedia_page": {"main": "Sir Ronald Graeme Millar (12 November 1919 – 16 April 1998) was an English actor, scriptwriter, and dramatist.\n\n", "link_mentions": [{"page": "Margaret Thatcher", "response": ["Some Heathite Conservatives in the Cabinet, the so-called \"wets\", expressed doubt over Thatcher's policies. The 1981 England riots resulted in the British media discussing the need for a policy U-turn. At the 1980 Conservative Party conference, Thatcher addressed the issue directly, with a speech written by the playwright Ronald Millar, that notably included the following lines:"]}, {"page": "Robert Browning", "response": ["In 1930, the story of Browning and his wife was made into the play The Barretts of Wimpole Street, by Rudolph Besier. It was a success and brought popular fame to the couple in the United States. The role of Elizabeth became a signature role for the actress Katharine Cornell. It was twice adapted into film. It was also the basis of the stage musical Robert and Elizabeth, with music by Ron Grainer and book and lyrics by Ronald Millar."]}, {"page": "Mervyn LeRoy", "response": ["| Ronald Millar, George Froeschel"]}, {"page": "Alastair Sim", "response": ["After doing little stage work in the 1950s, Sim resumed his theatre career in earnest in the 1960s. His range was wide, from Prospero in The Tempest (1962) and Shylock in The Merchant of Venice (1964), to the villainous Captain Hook in Barrie's Peter Pan (1963, 1964 and 1968) and the hapless Mr Posket in Pinero's farce The Magistrate (1969). The new plays in which Sim appeared were Michael Gilbert's Windfall (1963), William Trevor's The Elephant's Foot (1965) and Ronald Millar's Number Ten (1967); he directed all three productions. The first was dismissed by The Times as a tepid comedy about a progressive young headmaster thwarted by a reactionary member of his staff; the second, billed as a pre-London tour, started and finished in the provinces; the last was castigated by Philip Hope-Wallace in The Guardian as \"maladroit playmaking\" with a tedious plot about political machinations. Sim's performances provided some consolation: in the first, The Times said, his \"treacherously sweet smiles, triple takes and unheralded spasms of apoplectic fury almost make the evening worth while\".Lyric Theatre. \"Mr Sim again the Indulgent Pedagogue\",  The Times, 3 July 1963, p. 13 (Windfall); \"Briefing\", The Observer, 4 April 1965, p. 22 (The Elephant's Foot); and Hope-Wallace, Philip. \"Number 10 at the Strand Theatre\", The Guardian, 16 November 1967, p. 6 (Number Ten)"]}, {"page": "1946 in literature", "response": ["*Ronald Millar – Frieda"]}, {"page": "1954 in literature", "response": ["* Ronald Millar – Waiting for Gillian"]}, {"page": "1956 in literature", "response": ["* Ronald Millar – The Bride and the Bachelor"]}, {"page": "1958 in literature", "response": ["*Ronald Millar – The Big Tickle"]}, {"page": "Diana Rigg", "response": ["She returned to the stage in the Ronald Millar play Abelard and Heloïse in London in 1970 and made her Broadway debut with the play in 1971, in which she appeared nude with Keith Michell.  She earned the first of three Tony Award nominations for Best Actress in a Play. She received her second nomination in 1975, for The Misanthrope. A member of the National Theatre Company at the Old Vic from 1972 to 1975, Rigg took leading roles in premiere productions of two Tom Stoppard plays, Dorothy Moore in Jumpers (National Theatre, 1972) and Ruth Carson in Night and Day (Phoenix Theatre, 1978)."]}, {"page": "Westland affair", "response": ["On 27 January, Labour set down an adjournment motion. Whitelaw, Howe, Wakeham, John Biffen and Douglas Hurd helped Thatcher draft her speech for this occasion. Ronald Millar, one of the Prime Minister's friends, was asked to help revise the speech and Thatcher remarked to him that she might not be Prime Minister by six o'clock that evening if things went badly."]}, {"page": "List of musicals: M to Z", "response": ["| Ronald Millar", "| Ronald Millar"]}, {"page": "Robert and Elizabeth", "response": ["Robert and Elizabeth is a musical with music by Ron Grainer and book and lyrics by Ronald Millar.  The story is based on an unproduced musical titled The Third Kiss by Judge Fred G. Moritt, which in turn was adapted from the play The Barretts of Wimpole Street by Rudolph Besier.  It is an operetta-style musical which tells the story of the romance and elopement of poets Robert Browning and Elizabeth Barrett. The original 1964 London production was a success, starring John Clements as Barrett, June Bronhill as Elizabeth and Keith Michell as Robert.  Several revivals have followed."]}, {"page": "Googie Withers", "response": ["In 1954 she starred with McCallum in the West End play Waiting for Gillian by Ronald Millar."]}, {"page": "Héloïse", "response": ["*Ronald Millar's play Abelard & Heloise was a 1971 Broadway production at the Brooks Atkinson Theatre, starring Diana Rigg and Keith Michell, script published by Samuel French, Inc, London, 1970."]}, {"page": "Yvonne Arnaud", "response": ["She also appeared in British films, beginning with the role of Pauline in Desire, in 1920, opposite Dennis Neilson-Terry. In 1929–30, she played the role of Elma Melton in the stage version (both London and New York) and then the film version of Frederick Lonsdale's Canaries Sometimes Sing. She also appeared in some dramatic roles in the 1930s and 1940s, including some Shakespearean roles. Among these were several productions of Love for Love during the Second World War. Arnaud made more films during the 1930s and 1940s, including film versions of some of the successful plays in which she had starred.Archive: \"Tom Walls (1883–1949)\" , British Pictures.com, accessed 2 June 2012 Arnaud's likeness was drawn in caricature by Alex Gard for Sardi's, the New York City theatre district restaurant. The picture is now part of the collection of the New York Public Library.The New York Public Library Inventory of Sardi's Caricatures She continued to act on stage well into the 1950s. In 1958 she appeared in the West End with Jack Hulbert in Ronald Millar's The Big Tickle."]}, {"page": "Ron Miller", "response": ["*Ronald Millar (1919–1998), English actor, writer and dramatist"]}, {"page": "Jack Hulbert", "response": ["Hulbert's popularity waned as the 1930s came to an end, and after the war he and his wife continued to entertain chiefly on stage. In 1951 he appeared in the West End in The White Sheep of the Family and the following year directed his brother in Lord Arthur Savile's Crime. In 1958 he starred with Yvonne Arnaud in Ronald Millar's The Big Tickle. In 1962 he appeared in the BBC radio sitcom Discord in Three Flats, along with Courtneidge and Vic Oliver."]}, {"page": "Speechwriter", "response": ["*Sir Ronald Millar wrote for British Prime Minister Margaret Thatcher"]}, {"page": "John McCallum (actor)", "response": ["He appeared with Withers on the West End stage in the play Waiting for Gillian by Ronald Millar."]}, {"page": "Keith Michell", "response": ["In 1958, he played Nestor-Le-Fripe in the musical Irma La Douce, also starring in the role with the National Theatre in Washington, DC, and on Broadway in 1960–1961. At the newly opened Chichester Festival Theatre, in 1962, he played Don John in The Chances and then Ithocles in The Broken Heart, and in British television adaptations, he starred as Heathcliff in Wuthering Heights (1962) and, in a series of  Roman plays titled The Spread of the Eagle, he played Mark Antony (1963). He later sang in a series of television specials written for him. Also on Broadway, he played the Count in The Rehearsal by Jean Anouilh (1963). In 1964 in London, he starred as Robert Browning in the musical Robert and Elizabeth, opposite Australian soprano June Bronhill.Australian Dictionary of Biography – Ronald Erle Grainer He played the dual role of Miguel de Cervantes and his fictional creation Don Quixote in the musical Man of La Mancha, first starring in the original London production of the musicalAllMusic – Keith Michell biography; cast album: Man of La Mancha sound recording – Trove entry and then on Broadway. He also starred as Abelard in the Broadway play Abelard and Heloise with Diana Rigg by Ronald Millar (1971) and as Georges in La Cage aux Folles in the 1980s.Keith Mitchell, Internet Broadway Database, accessed 28 November 2015"]}, {"page": "List of Old Carthusians", "response": ["*Sir Ronald Millar (1919–1998), actor, scriptwriter and speechwriter for Margaret Thatcher"]}, {"page": "Scaramouche (1952 film)", "response": ["The film stars Stewart Granger, Eleanor Parker, Janet Leigh, and Mel Ferrer. It was directed by George Sidney and produced by Carey Wilson from a screenplay by Ronald Millar and George Froeschel. The original music score was composed by Victor Young and the cinematography by Charles Rosher."]}, {"page": "Betrayed (1954 film)", "response": ["Betrayed is a 1954 Eastmancolor US/British international co-production war drama film directed by Gottfried Reinhardt from a screenplay by Ronald Millar and George Froeschel, and starring Clark Gable, Lana Turner, Victor Mature, and Louis Calhern. The musical score was by Walter Goehr and Bronislau Kaper, and the cinematography by Freddie Young. The picture, Gable's last for Metro-Goldwyn-Mayer, was filmed on location in the Netherlands and England, and was based on the story of turncoat Dutch resistance leader Christiaan Lindemans, also known as \"King Kong\". The supporting cast features O. E. Hasse, Wilfrid Hyde-White, Ian Carmichael, Niall MacGinnis, and Theodore Bikel. Betrayed was the fourth and final movie in which Gable played opposite Turner, and their third pairing set during World War II. (They played comrades, not simply lovers, in all three war films.)"]}, {"page": "Never Let Me Go (1953 film)", "response": ["Never Let Me Go is a 1953 MGM romantic adventure filmVariety film review; 25 March 1953, page 6.Harrison's Reports film review; 28 March 1953, page 51. starring Clark Gable and Gene Tierney. The picture, directed by Delmer Daves and produced by Clarence Brown, was from a screenplay by George Froeschel and Ronald Millar, based on the 1949 novel Came the Dawn by Roger Bax (a.k.a. Andrew Garve/Paul Winterton/Paul Somers)."]}, {"page": "The Miniver Story", "response": ["The Miniver Story is a 1950 American drama film that is the sequel to the 1942 film Mrs. Miniver. Like its predecessor, the picture, made by MGM, stars Greer Garson and Walter Pidgeon, but it was filmed on-location in England. The film was directed by H.C. Potter and produced by Sidney Franklin, from a screenplay by George Froeschel and Ronald Millar based on characters created by Jan Struther. The music score was by Miklós Rózsa and Herbert Stothart, with additional uncredited music by Daniele Amfitheatrof, and the cinematography by Joseph Ruttenberg."]}, {"page": "The Living Dead (TV series)", "response": ["* Sir Ronald Millar, speech-writer for Mrs Thatcher 1975–90"]}, {"page": "We Dive at Dawn", "response": ["*Ronald Millar as Lieutenant Ronnie Johnson, Third Officer"]}, {"page": "Chichester Festival production history", "response": ["*Robert and Elizabeth, book & lyrics by Ronald Millar, music by Ron Grainer, directed by Stewart Taylor"]}, {"page": "Frieda (film)", "response": ["Frieda is a 1947 British drama film directed by Basil Dearden and starring David Farrar, Glynis Johns and Mai Zetterling. Made by Michael Balcon at Ealing Studios, it is based on the 1946 play of the same title by Ronald Millar who co-wrote the screenplay with Angus MacPhail. The film's sets were designed by the art directors Jim Morahan and Michael Relph."]}, {"page": "The lady's not for turning", "response": ["It was written by the playwright Sir Ronald Millar, who had been Thatcher's speech-writer since 1973, and was a pun on the 1948 play The Lady's Not for Burning by Christopher Fry, although Thatcher missed the reference herself.  Millar had intended the \"you turn if you want to\" line, which preceded it, to be the most popular, and it received an ovation itself, but it was \"the lady's not for turning\" that received the headlines. At the time, Thatcher was already being referred to as the \"Iron Lady\"."]}, {"page": "Viola Lyel", "response": ["In the 1950s, she rejoined the Old Vic, where her parts included the Widow of Florence in All's Well That Ends Well and the Queen in King John. Returning to comedy in February 1954 she played Miss Ashford in a revival of The Private Secretary. In 1956 she appeared in the long-running comedy The Bride and the Bachelor by Ronald Millar in the West End. She returned to the role of Mrs Hardcastle in She Stoops to Conquer, at the Bristol Old Vic in 1960 and played the part in Lebanon with the same company. Also at Bristol she played the Abbess in The Comedy of Errors, and the Nurse in Romeo and Juliet.", "* The Bride and the Bachelor by Ronald Millar (1956)"]}, {"page": "The Masters (novel)", "response": ["Ronald Millar's dramatisation of the novel opened at the Savoy Theatre, London, on 29 May 1963, and ran for eight months.  John Clements, who directed it, played Jago, and David Dodimead Lewis Eliot.  John Barron was Crawford.", "An adaptation of Ronald Millar's stage version was broadcast on the BBC Overseas Service in 1974 with John Pullen as Eliot, Denys Hawthorne as Jago, and Frederick Treves again playing Crawford."]}, {"page": "The Affair (play)", "response": ["The Affair is a 1962 play by Ronald Millar based on the novel by C. P. Snow."]}, {"page": "Norman Pierce", "response": ["His West End stage roles included Frank Harvey's Brighton Rock and Ronald Millar's Waiting for Gillian."]}, {"page": "Abelard and Heloise", "response": ["* Abelard and Heloise (play), a play by Ronald Millar"]}, {"page": "John Warner (actor)", "response": ["Other stage appearances included Canon Fulbert in Ronald Millar's Abelard and Heloise at Wyndham's Theatre (1970), the RSC's Becket and The Taming of the Shrew (both 1961), Shaw's Widowers' Houses at the Theatre Royal Stratford East (1965) and Ring Round the Moon at the Haymarket Theatre (1968). Warner played 'Rattie' four times in productions of Toad of Toad Hall, and he regularly appeared at the Chichester Festival from 1978."]}, {"page": "1966 in British music", "response": ["*On the Level – music by Ron Grainer, book and lyrics by Ronald Millar (premièred on 19 April, starring Gary Bond and Angela Richards)"]}, {"page": "Peter Abelard", "response": ["*Ronald Millar's play Abelard & Heloise was a 1971 Broadway production at the Brooks Atkinson Theatre, starring Diana Rigg and Keith Michell, script published by Samuel French, Inc, London, 1970."]}, {"page": "Robert Sidaway (actor)", "response": ["* Number 10 by Ronald Millar, directed by David Scase, with Alastair Sim, Michael Denison, Dulcie Gray and John Gregson. Premiered at the King's Theatre, Glasgow on 29 August 1967 and toured Canada in October 1967 before opening at the Strand Theatre in London.", "* Abelard and Heloise by Ronald Millar, directed by Robin Phillips, with Diana Rigg, Keith Michell, Timothy West and Elspeth March. Originally opened at the Wyndham's Theatre, London on 19 May 1970"]}]}}