{"wiki_id": "http://www.wikidata.org/entity/Q7369291", "itemLabel": "Ross Donnelly Mangles", "itemDescription": "English politician and Chairman of the East India Company", "wikipedia_url": "https://en.wikipedia.org/wiki/Ross_Donnelly_Mangles", "wikipedia_page": {"main": "Ross Donnelly Mangles (1801 – 1877) was an English politician, Member of Parliament for Guildford between 1841 and 1857. In the latter year he became Chairman of the East India Company.", "link_mentions": [{"page": "Ross Mangles", "response": ["Mangles was the son of Ross Donnelly Mangles. He was educated at Windlesham House School, Brighton (1842–43), Bath Grammar School and East India Company College (1851–52).Entry in the 'Writers' petitions' archival sub-series, British Library, Asia, Pacific & Africa Collections (ref. J/1/80/153-161). He took up a place in the Bengal Civil Service in 1853. He was 24 years old, and a civilian in the Bengal Civil Service during the Indian Mutiny when the following deed took place at Arrah for which he was awarded the VC:"]}, {"page": "Guildford (UK Parliament constituency)", "response": ["| rowspan=\"4\"| Ross Donnelly Mangles"]}, {"page": "John Crawfurd", "response": ["A lifelong advocate of free trade policies, in A View of the Present State and Future Prospects of the Free Trade and Colonization of India (1829), Crawfurd made an extended case against the East India Company's approach, in particular in excluding British entrepreneurs, and in failing to develop Indian cotton. He had had experience in Java of the export possibilities for cotton textiles. He then gave evidence in March 1830 to a parliamentary committee, on the East India Company's monopoly of trade with China. Robert Montgomery Martin criticised Crawfurd, and the evidence of Robert Rickards, an ex-employee of the Company,\"Rickards, Robert (1769–1836), of Sloane Street, Mdx.\". The History of Parliament for exaggerating the financial burden of the monopoly on tea. Crawfurd put out a pamphlet, Chinese Monopoly Examined. Ross Donnelly Mangles defended the East India Company in 1830, in an answer addressed to Rickards and Crawfurd.Carlyle, E. I. (1901) \"Mangles, Ross Donnelly (1801–1877), chairman of the East India Company\" in Dictionary of National Biography. When the Company's charter came up for renewal in 1833, the China trade monopoly was broken. Crawfurd's part as parliamentary agent for interests in Calcutta had been paid (at £1500 per year); his publicity work had included facts for an Edinburgh Review article written by another author.Greenberg, Michael (1969) Ch. VII \"The Victory of the Free Traders\", pp. 175, 183–4 in British Trade and the Opening of China 1800–1842."]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|rowspan=\"2\"|Guildford(two members)||Ross Donnelly Mangles||Liberal"]}, {"page": "List of East India Company directors", "response": ["|Ross Donnelly Mangles", "|Ross Donnelly Mangles"]}, {"page": "Tongham", "response": ["The manor of Poyle Park which decayed from a wealthy gentleman's architecturally impressive farmhouse into no more than a farm, was in the north of Seale but now forms most of the east of Tongham.  In the 14th century Tongham, seemingly inclusive of this area, was assessed in the subsidy roll at £3 8s 5.5d.  The Poyle family owned a synonymous manor in a parish of Guildford, held of the King. After the Gaynesford and Vyne families, the family of Sir Nicholas Woodroffe, Lord Mayor of London for 1579, held it until at least 1906, by passing to female-line descendants, the Chester family. In 1792 owner William Woodroffe (born Billinghurst) who was High Sheriff of Surrey for 1792 had his estate in bankruptcy (chancery) due to the expense of that office which he could not afford.  Colonel Ross Donnelly Mangles, the Chairman of the East India Company was a tenant in the mid-19th century. The Grade II listed 17th century Poyle Cottage sits below the former manor. Poyle Farm is largely intact in terms of uninterrupted farmland."]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|rowspan=\"2\"|Guildford(two members)||Ross Donnelly Mangles||Liberal"]}, {"page": "James Spencer-Bell", "response": ["James Bell, as he was then called, was elected as one of the two MPs for Guildford at the general election of 1852 along with R. D. Mangles (both Liberals),The Times, Saturday, 17 July 1852; pg. 2; Issue 21170; col E: \"The General Election\" who had held the Guildford seat since 1841. After the 1852 election, there was a petition, alleging bribery and treating, which was found to be groundless and costs were awarded against the petitioner, in March 1853.\"GUILDFORD ELECTION. HC Deb 07 March 1853 vol 124 c1220 1220 LORD SEYMOUR appeared at the bar with the Report of the Select Committee appointed to try to determine the proceedings at the Election for the Borough of Guildford. The Committee had determined that Ross Donnelly Mangles, Esq., and James Bell, Esq., are duly elected to serve in this present Parliament for the Borough of Guildford; and the Committee had further agreed to the following Resolutions:— \"That the allegations of bribery and treating contained in the Petition were made without any reasonable ground, and are frivolous and vexatious.\" \"The Committee have thereupon ordered, that all costs and expenses, of and relating to the said allegations, shall be forthwith paid by the Petitioner and his surety, to the said Ross Donnelly Mangles and James Bell, esquires.\" Source: Hansard online"]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Ross Donnelly Mangles"]}]}}