{"wiki_id": "http://www.wikidata.org/entity/Q7364845", "itemLabel": "Ronald Eyre", "itemDescription": "British director", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Eyre", "wikipedia_page": {"main": "Ronald Eyre (13 April 1929 – 8 April 1992) was an English theatre director, actor and writer.", "link_mentions": [{"page": "Falstaff (opera)", "response": ["Among revivals in the 1950s and later, Hepokoski singles out as particularly notable the Glyndebourne productions with Fernando Corena and later Geraint Evans in the title role; three different stagings by Franco Zeffirelli, for the Holland Festival (1956), Covent Garden (1961) and the Metropolitan Opera (1964); and Luchino Visconti's 1966 version in Vienna.Hepokoski, pp. 136–137 A 1982 production by Ronald Eyre, more reflective and melancholy than usual, was staged in Los Angeles, London and Florence; Renato Bruson was Falstaff and Giulini conducted.Higgins, John. \"Autumnal mastery of Verdi's emotional range\", The Times, 16 April 1982, p. 9 Among more recent players of the title role Bryn Terfel has taken the part at Covent Garden in 1999, in a production by Graham Vick, conducted by Bernard Haitink.Milnes, Rodney. \"In the belly of the best\", The Times, 8 December 1999, p. 44 and at the Metropolitan Opera in a revival of the Zeffirelli production, conducted by James Levine in 2006.Clark, Robert S. Music Chronicle, The Hudson Review, Winter, 2006, pp. 633–634 "]}, {"page": "Alan Bennett", "response": ["Bennett wrote the play Enjoy in 1980. It barely scraped a run of seven weeks at the Vaudeville Theatre, in spite of the stellar cast of Joan Plowright, Colin Blakely, Susan Littler, Philip Sayer, Liz Smith (who replaced Joan Hickson during rehearsals) and, in his first West End role, Marc Sinden. It was directed by Ronald Eyre.Shenton, Mark.\"Which flops are ripe for revival?\" Theatre Blog, The Guardian, 28 August 2008 A new production of Enjoy attracted very favourable notices during its 2008 UK tourLet's enjoy Alan Bennett's revival play for what it is – Daniel Tapper on Alan Bennett's Enjoy guardian.co.uk, 6 February 2009 and moved to the West End of London in January 2009.Enjoy by Alan Bennett at the Gielgud Theatre, review The Daily Telegraph, 3 February 2009 The West End show took over £1 million in advance ticket salesCurtain re-opens on Bennett Play BBC News, 29 January 2009 and even extended the run to cope with demand.Bennett's Enjoy extends two weeks to 16 May 2009 London Theatre, 18 February 2009 The production starred Alison Steadman, David Troughton, Richard Glaves, Carol Macready and Josie Walker."]}, {"page": "Timothy West", "response": ["* When We Are Married, with Prunella Scales, Dir Ronald Eyre, Whitehall Theatre, 1985"]}, {"page": "Emma Thompson", "response": ["Thompson was born in London on 15 April 1959. Her mother is the Scottish actress Phyllida Law, while her English father, Eric Thompson, was involved in theatre, and was the writer–narrator of the popular children's television series The Magic Roundabout. Her godfather was the director and writer Ronald Eyre. She has one sister, Sophie Thompson, who also works as an actress. The family lived in West Hampstead in north London, and Thompson was educated at Camden School for Girls. She spent much time in Scotland during her childhood and often visited Ardentinny, where her grandparents and uncle lived."]}, {"page": "BBC Television Shakespeare", "response": ["There were also four multi-part made-for-TV Shakespearean adaptations shown during the 1950s and 1960s; three specifically conceived as TV productions, one a TV adaptation of a stage production. The first was The Life and Death of Sir John Falstaff (1959). Produced and directed by Ronald Eyre, and starring Roger Livesey as Falstaff, the series took all of the Falstaff scenes from the Henriad and adapted them into seven thirty-minute episodes. The second was An Age of Kings (1960). Produced by Peter Dews and directed by Michael Hayes, the show comprised fifteen episodes between sixty and eighty minutes each, which adapted all eight of Shakespeare's sequential history plays (Richard II, 1 Henry IV, 2 Henry IV, Henry V, 1 Henry VI, 2 Henry VI, 3 Henry VI and Richard III). The third was The Spread of the Eagle (1963), directed and produced by Dews. Featuring nine sixty-minute episodes, the series adapted the Roman plays, in chronological order of the real life events depicted; Coriolanus, Julius Caesar and Antony and Cleopatra. The fourth series was not an original TV production, but a made-for-TV \"re-imagining\" of a stage production; The Wars of the Roses, which was screened in both 1965 and 1966. The Wars of the Roses was a three-part adaptation of Shakespeare's first historical tetralogy (1 Henry VI, 2 Henry VI, 3 Henry VI and Richard III) which had been staged to great critical and commercial success at the Royal Shakespeare Theatre in 1963, adapted by John Barton, and directed by Barton and Peter Hall. At the end of its run, the production was remounted for TV, shot on the actual Royal Shakespeare Theatre stage, using the same set as the theatrical production, but not during live performances. Directed for television by Michael Hayes and Robin Midgley, it originally aired in 1965 as a three parter, just as the plays had been staged (the three parts were called Henry VI, Edward IV and Richard III). Due to the popularity of the 1965 broadcast, the series was again screen in 1966, but the three plays were divided up into ten episodes of fifty minutes each.Willis, p. 328.", "The Prefaces to Shakespeare episode for Othello was presented by Bob Peck who had played Iago in a 1979 RSC production directed by Ronald Eyre. The Shakespeare in Perspective episode was presented by author Susan Hill."]}, {"page": "Edward Herrmann", "response": ["Herrmann and Dianne Wiest collaborated as directors on the Williamstown Theater Festival in its 1985 offering Not About Heroes, playing Sassoon. Frank Rich praised the performance: \"If Mr. Baker's Wilfred is a bit of an uncomplicated, foursquare boy scout and if Mr. Herrmann's stiff-upper-lipped Siegfried at first arouses deja vu, they form a passionate symbiosis as the darker clouds gather in Act II. Both actors also have a natural way with the rhetoric of their characters' respective canons.\" During 1988, Herrmann appeared in the New York production Julius Caesar as Gaius Cassius Longinus.  Herrmann stated he had joined after becoming tired with constantly having to wear a suit in his prior roles and finding Cassius the most complex of the available roles. Frank Rich opined that Herrmann was the \"liveliest of the leads by far\" and that he would be better suited in the role of Brutus. In 1988–89, Herrmann starred with Alec Guinness in the London West End production of A Walk in the Woods. The play debuted at the Comedy Theater in November 1988, and was directed by Ronald Eyre.  As the New York Times reported, \"Mr. Guinness and Mr. Herrmann share the stage uninterrupted for some two hours. The fictional play is rooted in the real-life relationship between a Soviet diplomat and an American negotiator who broke protocol in 1982 and made a private limited arms control deal while taking a stroll in a forest outside Geneva.\""]}, {"page": "Noël Coward Theatre", "response": ["A 1970 Royal Shakespeare Company production of Dion Boucicault's London Assurance, directed by Ronald Eyre, with Donald Sinden as Sir Harcourt Courtly, (for which he received the 1975 Drama Desk Special Award)Who's Who in the Theatre, 17th edition (1981), Roger Rees as Charles, Judi Dench as Grace and Dinsdale Landen as Dazzle, transferred to the New Theatre in 1972 for a year, prior to its 1974 run in New York. A revival of Oliver! ran from 1977 to 1980"]}, {"page": "The Wednesday Play", "response": ["Dramatised by Ronald Eyre."]}, {"page": "Patsy Rowlands", "response": ["Other West End theatre credits included Semi-Detached with Laurence Olivier and directed by Tony Richardson (with whom she was to work often, appearing in his 1963 film Tom Jones), Shut Your Eyes and Think of England, with Donald Sinden, The Seagull and Ben Travers's The Bed Before Yesterday, both directed by Lindsay Anderson and When We Are Married for Ronald Eyre. She also starred in Cameron Mackintosh's revival of Oliver! in the mid-1990s, as well as playing Jack's mother in the original London cast of Sondheim's Into the Woods. Her final appearance was as Mrs Pearce in the National Theatre's production of My Fair Lady which also starred Jonathan Pryce."]}, {"page": "Russell Harty", "response": ["Harty was the son of Fred Harty, a fruit-and-vegetable stallholder on the local market in Blackburn, Lancashire, and Myrtle Rishton. He attended Queen Elizabeth's Grammar School on West Park Road in Blackburn, where he enjoyed appearing in school plays and met, for the first time, the then English teacher Ronald Eyre, who directed a number of the productions. Thereafter he studied at Exeter College, Oxford, where he obtained a degree in English literature."]}, {"page": "Donald Sinden", "response": ["In 1979 he played the title role in Othello, directed by Ronald Eyre, becoming the last 'blacked-up white' actor to play the role for the RSC. Everyman editor and critic Gareth Lloyd Evans noted that his interpretation was \"not…about colour or racialism\" but one that illuminated the character's personal tragedy.quoted in "]}, {"page": "Giggleswick School", "response": ["*Ronald Eyre, theatre director, writer and actor."]}, {"page": "Tony Award for Best Direction of a Play", "response": ["| Ronald Eyre"]}, {"page": "Michael Blakemore", "response": ["In 1969, Blakemore joined the National Theatre at the Old Vic to direct The National Health by Peter Nichols. He later directed Laurence Olivier in Eugene O'Neill's Long Day's Journey into Night (1971). In 1970, as the National Theatre began a slow, and much delayed, transition from the Old Vic premises to the multi-stage South Bank site, Blakemore was invited by Laurence Olivier to become one of two Associate Directors.Blakemore (2013) p.1. The other A.D. was to be Ronald Eyre, but he dropped out and was replaced by John Dexter. Since Olivier had already suffered from medical crises that were a feature of the last quarter of his life, the question of eventual succession as Artistic Director was obviously in the background. Blakemore felt he was a probable candidate, and indeed, according to Olivier's biographer Philip Ziegler, he was highly favoured.Ziegler, pp. 316,343"]}, {"page": "Frontiers (1989 TV series)", "response": ["* \"Long Division\": Ronald Eyre looked at the people living on both sides of the border in Ireland that splits the Republic from Ulster."]}, {"page": "Marc Sinden", "response": ["Sinden's acting work in the theatre includes over 40 regional tours or West End productions to his credit, including ‘Charles Surface’ in The School for Scandal (Duke of York's) with his father Donald Sinden and directed by John Barton. This was chosen as the British Council's 50th anniversary tour, playing in 21 cities in 10 countries. He also starred in Her Royal Highness? (Palace) and Two into One (Shaftesbury), both written and directed by Ray Cooney; 'Squire Sullen' in The Beaux' Stratagem (Lyttelton, Royal National Theatre) opposite Brenda Blethyn and Stephen Dillane; Over My Dead Body (Savoy) with June Whitfield; Underground with Raymond Burr (Prince of Wales and Royal Alexandra, Toronto); Ross with Simon Ward (Old Vic and Royal Alexandra, Toronto); Ray Davies' first musical Chorus Girls (Theatre Royal, Stratford East) written by Barrie Keeffe and the première of Alan Bennett's Enjoy (Vaudeville) with Joan Plowright, directed by Ronald Eyre."]}, {"page": "Habeas Corpus (play)", "response": ["Directed by Ronald Eyre, designed by Derek Cousins; music by Carl Davis.Bennett, pp. 7–8 In February 1974 Robert Hardy succeeded Guinness as Dr Wicksteed, and the author took over the role of Mrs Swabb.\"Briefing\", The Observer, 3 March 1974, p. 33"]}, {"page": "Chichester Festival production history", "response": ["*A Patriot for Me by John Osborne, directed by Ronald Eyre", "*The Chalk Garden by Enid Bagnold, directed by Ronald Eyre"]}, {"page": "29th Tony Awards", "response": ["** Ronald Eyre – London Assurance"]}, {"page": "Faith in Buddhism", "response": ["* BBC documentary about self-power and other-power in Japanese Buddhism, by Ronald Eyre, part of the awarded The Long Search series"]}, {"page": "London Assurance", "response": ["According to casting notes from Methuen & Co Ltd's 1971 publication of the play, the Royal Shakespeare Company produced the show with director Ronald Eyre.  The first show was June 23, 1970, and featured Donald Sinden as Sir Harcourt Courtly, Michael Williams as Charles, Judi Dench as Grace and Barrie Ingham as Dazzle which transferred to the Albery Theatre in London and toured to New York, where Eyre was nominated for a Broadway Tony Award for his directing and Sinden was the first recipient of the Broadway Drama Desk Special Award.Who's Who in the Theatre, 17th edition (1981) "]}, {"page": "Enjoy (play)", "response": ["Following a national tour, directed by Ronald Eyre, it opened at the Vaudeville Theatre, in London's West End on 15 October 1980, but in spite of the stellar cast of Joan Plowright, Colin Blakely, Susan Littler, Marc Sinden, Philip Sayer and Liz Smith (who replaced Joan Hickson during rehearsals), it closed on 6 December 1980.Enjoy flop and subsequent revival success"]}, {"page": "Mischa Scorer", "response": ["*Ronald Eyre, Ronald Eyre on The Long Search, Fount 1979"]}, {"page": "Opera North: history and repertoire, seasons 1981–82 to 1989–90", "response": ["|1989–90 || Peter Grimes ||  Britten ||  John Treleaven (Peter Grimes), Marie Slorach (Ellen Orford), Malcolm Donnelly (Balstrode) ||  David Lloyd-Jones/Roy Laughlin ||  Ronald Eyre ||  Mark Thompson"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Ronald Eyre||A talking book by Judi Dench||Supply of flower bulbs|| more"]}, {"page": "Roger Martin (actor)", "response": ["A theatre director with over 20 years experience, Martin is the Artistic Director of Fresh Look Theatre. His directing credits include Clive Barker’s The Secret Life of Cartoons, Three Men on the Bummel, Shakespeare – The Good Beer Guide, performed at the Edinburgh Fringe Festival, Duet for One at the Lyric Theatre in Hammersmith, Songs from the Head (a song-cycle for which he wrote both the music and lyrics) at the Redgrave Theatre in Farnham; and Raspberry and Scrooge for the London Fringe Festival. He was Assistant Director to Ronald Eyre on A Patriot for Me at the Theatre Royal Haymarket and the Ahmanson Theatre in Los Angeles.Martin on westendtheatre.com  He directed The Watcher at the Edinburgh Fringe which was revived at the Waterloo East Theatre in 2011."]}, {"page": "The Long Search", "response": ["The Long Search was a 1977 BBC documentary television series spanning 13 episodes. Presented by theatre director Ronald Eyre, the series surveyed several major world religions, including Protestant, Orthodox, and Catholic Christianity. Other episodes surveyed Theravada and Zen Buddhism, Islam, Judaism, Hinduism, and the New Age movement. Location filming took place in India, England, Italy, Japan, Israel, Romania, Sri Lanka, Taiwan, the United States, Egypt, Indonesia, and South Africa."]}, {"page": "Voytek (designer)", "response": ["His later stage work included Ronald Eyre's production of Much Ado About Nothing for the Royal Shakespeare Company in 1971, and The Marquis of Keith by Wedekind (1974, also for the RSC). In 1983 he won a Critics' Circle Theatre Award for best designer, for his set for Botho Strauss's Great and Small at the Vaudeville Theatre, which was set inside a massive, plastic tower doubling as a prison cage. He won his second Bafta for production design on the LWT miniseries Dandelion Dead (1994), after which he retired from television work."]}, {"page": "Escape (British TV series)", "response": ["Morris Barry directed the filmed inserts, while Ronald Eyre directed the studio sequences. Among its guest stars were Michael Caine and Roy Dotrice. As usual for the period, it was transmitted live; no recordings are known to survive.BBC Television Drama Research Guide, Kaleidoscope, 2011, pp. 1133–34."]}, {"page": "Tom Grattan's War", "response": ["Artist Clive Hicks-Jenkins appeared as a guest star in one multiple episode story line. Some episodes were directed by Ronald Eyre and others by Stephen Frears."]}, {"page": "Radio Lives", "response": ["|Ronald Eyre"]}, {"page": "List of Jackanory episodes", "response": ["|99|| The Lion ||  || Ronald Eyre || 02-May-66", "|100|| The Donkey ||  || Ronald Eyre || 03-May-66", "|101|| The Wren ||  || Ronald Eyre || 04-May-66", "|102|| The Hare ||  || Ronald Eyre || 05-May-66", "|103|| The Tiger, the Monkey, the Snake, the Goldsmith and the Poor Scholar ||  || Ronald Eyre || 06-May-66", "|288|| Winnie-the-Pooh: Pooh and Some Bees || A. A. Milne || Ronald Eyre || 20-Mar-67", "|289|| Winnie-the-Pooh: Pooh Goes Visiting and Gets Into a Tight Place || A. A. Milne || Ronald Eyre || 21-Mar-67", "|290|| Winnie-the-Pooh: Piglet Meets a Heffalump || A. A. Milne || Ronald Eyre || 22-Mar-67", "|291|| Winnie-the-Pooh: Eeyore Loses a Tail and Pooh Finds One || A. A. Milne || Ronald Eyre || 23-Mar-67", "|292|| Winnie-the-Pooh: Kanga and Baby Roo || A. A. Milne || Ronald Eyre || 24-Mar-67", "|453|| The Selfish Giant || Oscar Wilde || Ronald Eyre || 18-Dec-67", "|647|| Christmas Stories: The Selfish Giant || Oscar Wilde || Ronald Eyre || 27-Dec-68", "|1138|| Tim and Charlotte || Edward Ardizzone || Ronald Eyre || 13-Apr-71", "|1139|| Paul the Hero of the Fire || Edward Ardizzone || Ronald Eyre || 14-Apr-71", "|1140|| Johnny's Bad Day/Diana and Her Rhinoceros || Edward Ardizzone || Ronald Eyre || 15-Apr-71", "|1141|| Johnny the Clockmaker || Edward Ardizzone || Ronald Eyre || 16-Apr-71"]}]}}