{"wiki_id": "http://www.wikidata.org/entity/Q7365099", "itemLabel": "Ronald Max Hartwell", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Max_Hartwell", "wikipedia_page": {"main": "Ronald Max Hartwell (1921–2009) was an Australian-born liberal economic historian of the British Industrial Revolution.\nHartwell's first academic appointment was at University of New South Wales (1950–56), where he held the chair of economic history.  This was followed by a readership in recent economic and social history at the University of Oxford, and then as a professorial fellow of Nuffield College, Oxford, 1956–77 (emeritus 1977).  He served as the editor of the Economic History Review from 1960 through 1968.  From his retirement in 1977, Hartwell served as visiting professor of economics at the University of Virginia every fall semester into the early 1990s, and often spent the spring semester at the University of Chicago in a similar capacity.His article \"The Rising Standard of Living in England, 1800–1850\" in the Economic History Review generated a great deal of controversy. Hartwell's view that industrialisation had immeasurably improved the lot of the poor was in contrast to the prevailing opinion, notably that of Eric Hobsbawn, that stressed the damaging economic effects industrialization on the poor.He was a member and – from 1992 to 1994, president – of the Mont Pelerin Society.\n\n", "link_mentions": [{"page": "On the Principles of Political Economy and Taxation", "response": ["Ricardo claims in the preface that Turgot, James Steuart, Adam Smith, Jean-Baptiste Say, Sismondi, and others had not written enough \"satisfactory information\" on the topics of rent, profit, and wages. Principles of Political Economy is Ricardo's effort to fill that gap in the literature. Regardless of whether the book achieved that goal, it secured, according to Ronald Max Hartwell, Ricardo's position among the great classical economists Adam Smith, Thomas Malthus, John Stuart Mill, and Karl Marx."]}, {"page": "Ronald", "response": ["* Ronald Max Hartwell, Australian historian"]}, {"page": "Deaths in March 2009", "response": ["*Ronald Max Hartwell, 88, Australian economic historian."]}, {"page": "Max Hartwell", "response": ["#redirectRonald Max Hartwell"]}]}}