{"wiki_id": "http://www.wikidata.org/entity/Q736808", "itemLabel": "John Sydenham Furnivall", "itemDescription": "British scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sydenham_Furnivall", "wikipedia_page": {"main": "John Sydenham Furnivall (often cited as JS Furnivall or J.S. Furnivall) was a British-born colonial public servant and writer in Burma. He is credited with coining the concept of the plural society and had a noted career as an influential historian of Southeast Asia, particularly of the Dutch East Indies (modern-day Indonesia) and British Burma. He published several books over a long career, including the influential Colonial Policy and Practice and wrote for more than 20 major journals, although his work is now criticized as being Eurocentric and biased in favor of continued colonialism.", "link_mentions": [{"page": "List of historians", "response": ["*John Sydenham Furnivall (1878–1960), Burma, Southeast Asia"]}, {"page": "Great Bentley", "response": ["*John Sydenham Furnivall, a former Cambridge University scholar and later British colonial administrator to Burma, was born in the village."]}, {"page": "Thiri Thudhamma Thingaha", "response": ["*John Sydenham Furnivall, Burma public servant and historian – Grand Commander 1949"]}, {"page": "1960s in anthropology", "response": ["*John Sydenham Furnivall"]}, {"page": "J S Furnivall", "response": ["#REDIRECT John Sydenham Furnivall"]}, {"page": "Tha Myat", "response": ["| U Tha Myat and John Sydenham Furnivall"]}, {"page": "Alkaff Mansion", "response": ["In 1936, the Chinese community, through the Chinese Consul General, made full use of the building to host a visiting general and provincial governor from China. In this function, a dinner was held and attended by people of various linguistic groups (to the point of necessitating a translator). A press conference was also held, whereby the Chinese governor expressed his \"appreciation of the unity of the Chinese in Singapore\". These events which cut across racial lines are significant as they call into question the theories of Colonial scholar John Sydenham Furnivall, who argued that British ruled colonial societies were 'plural societies' – societies divided along communal lines that only converged at the market place, or in violence and instability once the ambit of British colonial power was gone. The various communities, far from being totally segregated met at the mansion, and such meetings were entirely spontaneous without explicit support of the British. The antecedents of \"racial and religious harmony\" which dominates race discourse in present-day Singapore, thus found expression in the mansion."]}, {"page": "Charles Duroiselle", "response": ["A member of the École française d'Extrême-Orient, he served as a Professor of Pali at the University of Rangoon. He also served as a Superintendent, Archaeological Survey of Burma from 1912 to 1940, succeeding Taw Sein Ko. In March 1910, he co-founded the Burma Research Society along with colleagues including John Sydenham Furnivall, May Oung, and Pe Maung Tin. The following year, the Journal of the Burma Research Society, was launched. He retired in 1939."]}, {"page": "Furnivall", "response": ["* John Sydenham Furnivall (1878–1960), British civil servant in Burma"]}]}}