{"wiki_id": "http://www.wikidata.org/entity/Q7363848", "itemLabel": "Ron Green", "itemDescription": "English footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ron_Green_(footballer)", "wikipedia_page": {"main": "Ronald Rex Green (born 3 October 1956) is a former professional footballer who played as a goalkeeper in the Football League.", "link_mentions": [{"page": "Richard Money", "response": ["With the appointment of Mick Buxton as manager in April 1987, Scunthorpe came close to automatic promotion in the 1987–88 and 1988–89 Fourth Division seasons, but lost in the play-offs on both occasions.http://www.rsssf.com/engpaul/fla/1987-88.html & http://www.rsssf.com/engpaul/fla/1988-89.html Highlighting Andy Flounders, Tony Daws, Kevin 'Ticker' Taylor and Ron Green as particularly talented team-mates during this time, when asked if the team was good enough to get promoted, Money admitted: \"Yes, definitely. We should have gone up automatically.\"Bell, Max (31 August 2020). Scunthorpe United: 20 Legends. Vertical Editions. p61. "]}, {"page": "Simon Tracey", "response": ["Tracey played most of his professional career at Sheffield United. He started out as a goalkeeper at Wimbledon in 1985. He made his debut in a 2–1 loss to Liverpool in the Charity Shield in 1988 after Dave Beasant, the hero of the FA Cup Final win that gave Wimbledon their place in the match, had been sold to Newcastle United. He kept his place for the first League game of the season but did not perform well in a 5–1 defeat and was dropped and replaced temporarily with Ron Green and then, permanently, Hans Segers."]}, {"page": "Steve Cherry", "response": ["Derby teammate Steve Buckley recommended Cherry to his brother, Walsall manager Alan Buckley, who won Cherry's signature with the promise of a £17,500 signing-on fee. Walsall paid Derby a £25,000 fee in August 1984. He replaced Ron Green as the \"Saddlers\" number one and enjoyed a good start to the 1984–85 Third Division campaign. Walsall played former club Derby four times during the season as they drew them in the first round of the Associate Members' Cup and Cherry was subjected to taunting from Derby fans throughout the games, which he admitted \"was an occupational hazard, but it still gets to you\". He was an instant success with the Walsall fans however and was voted as the club's Player of the Season."]}, {"page": "Ronald Green", "response": ["*Ron Green (American football), see 1966 Minnesota Vikings season", "*Ron Green (footballer) (born 1956), of 1992–93 Colchester United F.C. season", "*Ron Greene (1938-2021), American basketball coach"]}, {"page": "1992–93 Colchester United F.C. season", "response": ["|Ron Green", "|align=\"left\"|Ron Green", "|Ron Green"]}]}}