{"wiki_id": "http://www.wikidata.org/entity/Q7368286", "itemLabel": "Rosemarie Wright", "itemDescription": "English musician *1931", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosemarie_Wright", "wikipedia_page": {"main": "Rosemarie Wright (12 December 1931 – 25 April 2020) was an English pianist.Wright was born in Chorley, Lancashire. She studied at the Royal Academy of Music with Patrick Cory and Harold Craxton, winning many prizes including the Chappell Silver Medal and Tobias Matthay Fellowship. Her later studies were with Bruno Seidlhofer at the Vienna Academy of MusicStaatsakademie, and with Edwin Fischer and Wilhelm Kempff.  She studied chamber music with the cellist Pablo Casals. Wright won the Haydn Prize in the International Haydn-Schubert Competition in Vienna in 1959, and in 1960 became the first British pianist ever to win the Bösendorfer Prize.Wright made her recital debut in the Großer Saal of the Vienna Musikverein in 1960, stepping in for an indisposed Martha Argerich. This launched a distinguished international career including recitals, concerto performances and chamber music worldwide. She appeared as concerto soloist with many of Europe's renowned orchestras and with many distinguished conductors, and was broadcast from over thirty different European radio stations. At home she made her debut at the Proms at the Royal Albert Hall in 1971, as soloist with the Philharmonia Orchestra conducted by Sir Adrian Boult.Wright was pianist-in-residence at the University of Southampton (1972–1980), senior lecturer in keyboard studies at the Royal Northern College of Music (RNCM) (1972–78) and professor of piano at the Royal Academy of Music (1978–1997). She was elected a fellow of the RNCM in 1993.Wright was married in 1961 and had two sons.She died in 2020.", "link_mentions": [{"page": "Chorley", "response": ["*Rosemarie Wright (1931–2020), (pianist)"]}, {"page": "Wright", "response": ["*Rosemarie Wright (1931–2020), English pianist"]}, {"page": "Duncan Honeybourne", "response": ["Honeybourne was born at Weymouth, Dorset. He began his studies at the Royal Academy of Music Junior Department, where he won the senior piano prize. He gave his first London recital at the age of fifteen and toured extensively throughout Britain as solo recitalist and concerto soloist. Awarded a place to continue at the RAM, he chose instead to move to the Royal Birmingham Conservatoire where he graduated in 2000 with a B.Mus First Class Honours degree and won many prizes, and later received the honorary award of HonRBC for professional distinction. His teachers included Rosemarie Wright and Philip Martin, and his further piano studies were in London with John York, Leeds with Fanny Waterman, and subsequently for three years on a Goldenweiser Scholarship in London with the Russian pianist Mikhail Kazakevich. He made his debut as soloist at Symphony Hall, Birmingham and the National Concert Hall, Dublin, in 1998."]}, {"page": "2020 in the United Kingdom", "response": ["** Rosemarie Wright, classical pianist and pedagogue, 88", "*3 June – Rosemarie Wright, 88, pianist. (death announced on this date)"]}, {"page": "Deaths in April 2020", "response": ["*Rosemarie Wright, 88, English pianist.Rosemarie Wright obituary"]}, {"page": "2020 in British music", "response": ["* 3 June – Rosemarie Wright, pianist, 88. (death announced on this date)"]}]}}