{"wiki_id": "http://www.wikidata.org/entity/Q7372094", "itemLabel": "Rowland Baring, 2nd Earl of Cromer", "itemDescription": "British diplomat and courtier (1877-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rowland_Baring,_2nd_Earl_of_Cromer", "wikipedia_page": {"main": "Rowland Thomas Baring, 2nd Earl of Cromer,  (29 November 1877 – 13 May 1953), styled Viscount Errington between 1901 and 1917, was a British diplomat and courtier.", "link_mentions": [{"page": "Gilbert Elliot-Murray-Kynynmound, 4th Earl of Minto", "response": ["* Lady Ruby Florence Mary Elliot-Murray-Kynynmound (26 September 18865 November 1961), married Rowland Baring, 2nd Earl of Cromer, and had issue;"]}, {"page": "Evelyn Baring, 1st Earl of Cromer", "response": ["His brother was Edward Baring, 1st Baron Revelstoke. Rowland Baring, 2nd Earl of Cromer, and Evelyn Baring, 1st Baron Howick of Glendale, were two of his sons."]}, {"page": "Ethel Snowden", "response": ["During a 1910 trip to the United States, Ethel Snowden was interviewed and sketched by Marguerite Martyn of the St. Louis Post-Dispatch. During the interview, Snowden mocked anti-suffrage parliamentarian Rowland Baring, 2nd Earl of Cromer, by affecting an accent and, as Martyn put it:"]}, {"page": "Rowland Thomas Baring, 2nd Earl of Cromer", "response": ["#REDIRECT Rowland Baring, 2nd Earl of Cromer"]}, {"page": "Mrs Henderson Presents", "response": ["Eccentric 70-year-old widow Mrs Laura Henderson purchases a redundant cinema and remodels it to create the Windmill Theatre in London, as a post-widowhood hobby and appoints autocratic manager Vivian Van Damm. In 1937, they start a continuous variety revue called \"Revudeville\", but after other theatres copy this innovation, they begin losing money. Mrs Henderson suggests they add female nudity, similar to the Moulin Rouge in Paris, something unprecedented in the United Kingdom. The Lord Chamberlain (Rowland Baring, 2nd Earl of Cromer) reluctantly allows this under the condition that the nude performers remain immobile, so the performances can be considered art, the equivalent of nude statues in museums."]}, {"page": "List of recipients of the Royal Victorian Chain", "response": ["|Rowland Baring, 2nd Earl of Cromer "]}, {"page": "Cromer (disambiguation)", "response": ["**Rowland Baring, 2nd Earl of Cromer"]}, {"page": "Dorothy Minto", "response": ["From the 1920s she regularly toured with new productions before they were brought to London. In 1923 she was described in print as an \"Actress Manageress\", a position shared at the time with only two others in London (Gladys Cooper and Marie Lohr).Dundee Courier, 15 May 1923. In 1927 she starred in Wild-Cat Hetty (renamed in London from its touring name, Hell-Cat Hetty) in a title role that had echoes of Eliza Doolittle in Shaw's Pygmalion, a role for which she might have been considered if she had not changed direction in 1912. In 1927 the Lord ChamberlainThe position, which then included theatre censorship duties, was held between 1922 and 1937 by Rowland Baring, 2nd Earl of Cromer, who was married to the daughter of the (probably unrelated to Dorothy) 4th Earl of Minto. deemed it necessary to inspect the pyjamas she was wearing in the production of P. G. Wodehouse's Good Morning, Bill (\"a tight-fitting, black lace, filmy affair\"). After suitably close scrutiny the pyjamas were passed fit for public viewing.London Evening Telegraph, 25 Nov 1927. In 1930-31 she did a season in repertory at the Ambassadors Theatre, Southend. She toured in Canada  in 1932, performing in Shaw's Too True to be Good and Robert E. Sherwood's The Queen's Husband.Reports of the tour can be found in the Montreal Gazette and in The Varsity, undergraduate newspaper of the University of Toronto, Oct 4, 1932. Throughout her career she received good reviews, with reviewers often praising her attractiveness as well as her acting skills."]}, {"page": "Baring (surname)", "response": ["*Rowland Baring, 2nd Earl of Cromer (1877–1953), English Lord Chamberlain"]}, {"page": "Household of George V and Mary", "response": ["*1922–1936: Rowland Baring, 2nd Earl of Cromer, GCB, GCIE, GCVO"]}, {"page": "Rowland Thomas Baring", "response": ["#REDIRECT Rowland Baring, 2nd Earl of Cromer"]}]}}