{"wiki_id": "http://www.wikidata.org/entity/Q7372715", "itemLabel": "Roy Cross", "itemDescription": "Footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Cross_(footballer)", "wikipedia_page": {"main": "Roy Cross (born 4 December 1947) is an English former footballer who played as a central defender. He played 161 games in a nine-year career in the Football League, 182 games in four seasons of play in the Southern League, and finally made 54 appearances in two Alliance Premier League campaigns.\nHe began his career at Walsall, making his debut in the 1966–67 season. However he featured just 13 times in four seasons before he moved on to Port Vale in July 1970. He was an ever-present in the 1971–72 season and made 134 consecutive appearances from his debut until he twisted his knee in March 1973. Another knee injury seven months later then caused him to be sidelined for 17 months. He took a free transfer to Nuneaton Borough at the end of the 1974–75 season. He made 236 league and cup appearances over the next six seasons at Nuneaton, lifting the Birmingham Senior Cup in 1980, before he retired due to other work commitments the following year.", "link_mentions": [{"page": "Wednesbury", "response": ["*Roy Cross, footballer, played for Port Vale in the early 1970s and transferred to Nuneaton Borough in 1975"]}, {"page": "Gordon Lee (footballer)", "response": ["Preparing for life in the Third Division, Lee released Ken Wookey, Stuart Shaw, Eric Magee, Stuart Chapman, and Gordon Logan. In their place he signed centre-half Roy Cross from Walsall, inside-forward Brian Horton from Hednesford Town, and full-back Mick Hopkinson from Mansfield Town. He steadied the ship in the midst of infighting in the boardroom, and the team went on a four-game winning streak in October that included a 2–0 win over fallen-giants Aston Villa. In January, he signed John Brodie from Northern Premier League side Bradford Park Avenue for £250, and noted that his team's performances were not helped by the 'boo boys' at Vale Park. Safety was assured with a 17th place, three points above relegated Reading."]}, {"page": "Cross (surname)", "response": ["*Roy Cross (footballer) (born 1947), English footballer"]}, {"page": "David Harris (footballer, born 1953)", "response": ["Born in Stoke-on-Trent, his father was Wilf Harris, who had a trial with Stoke City in his youth. A tall defender, rose through the ranks of Port Vale juniors after being signed from junior team Abbey Hulton United. He signed his first professional contract in July 1973, with Vale then in the Third Division. He went on to make his debut in a 3–1 win over Rochdale on 3 November 1973 after Bill Summerscales was suspended and Roy Cross injured. Over the course of the 1973–74 season he scored five goals in 36 games, and picked up the club's Player of the Year award. His first senior goal came in a 2–1 win against Scarborough in the FA Cup on 15 December. He also scored goals against Luton Town, Tranmere Rovers, Bournemouth, and Brighton & Hove Albion."]}, {"page": "History of Port Vale F.C.", "response": ["A dire financial situation meant seven players were released for 1975–76: John Woodward, Tony Lacey, Roy Cross, Bill Summerscales, Frank Sharp and Reg Edwards. Attempts to sign Wales  internationals Mike England and Wyn Davies failed, and so Mick Cullerton, Terry Lees and Geoff Morris were the only new signings. Cullerton was in fine scoring form, though the promotion campaign fell away and Horton was sold to Brighton for £30,000, which led to a healthy profit on the season. For the club's centenary celebrations a match was held with Stoke City, which finished 1–1, an impressive result considering the \"Potters\" were going through one of the most successful periods in their history."]}, {"page": "Roy Cross", "response": ["Roy Cross may refer to:", "* Roy Cross (footballer) (born 1947), English footballer", "* Roy Cross (artist) (born 1924), British artist"]}, {"page": "1970–71 Port Vale F.C. season", "response": ["The pre-season saw the arrival of centre-half Roy Cross (Walsall); inside-forward Brian Horton (Hednesford Town); and full-back Mick Hopkinson (Mansfield Town).", "|align=\"left\"|DF||align=\"left\"| Roy Cross", "|–||DF||||Roy Cross||1||0||0||1", "| June 1970 || DF ||  || Roy Cross || Walsall || Free transfer || "]}, {"page": "1971–72 Port Vale F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Roy Cross"]}, {"page": "1972–73 Port Vale F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Roy Cross"]}, {"page": "1973–74 Port Vale F.C. season", "response": ["The season opened with four games unbeaten, though Tommy McLaren soon damaged his ligaments, and the team suffered in his absence. On 1 October, Vale beat Wrexham 1–0 in an 'ugly' game that saw five players booked and Colin Tartt and opposition player Arfon Griffiths separated by police following a scrap in the tunnel. Later in the month Roy Cross badly injured his knee, and would later have to leave the professional game due to the injury. Vale slipped down the league, and by Christmas they were sixth from bottom, with only John Woodward in good form. Lee then took out striker Keith Leonard on loan from Aston Villa, and bought left-back Neil Griffiths from Chester for a £5,000 fee. He also changed the formation from 4–4–2 to 4–3–3, hoping to give Brian Horton more room in the centre of the park. After an upturn in form in the new year, Bill Summerscales broke his neck, and Lee departed for the management position at Blackburn Rovers. Lee had been seen to have done an excellent job with little money. In his place club legend Roy Sproson was appointed as caretaker manager, who advocated an 'entertaining' style of play as opposed to battling for every point. Winning his first match 1–0 at Shrewsbury Town, he cracked his head on the concrete trainer's box after leaping up to celebrate McLaren's goal. On 17 February, 8,505 turned up at Vale Park to witness a 3–1 win over high-flying Bristol Rovers in an experimental Sunday game. Later Leonard returned to Villa Park at the end of his loan deal, and £5,000 was not enough to tempt Villa to part with his services permanently. From mid-March Vale went eleven games without a win, and on 25 March they could have ended this run, but 'a shocking mistake' from Alan Boswell handed Walsall an equalizer as he palmed a header into his own net. The team continued to rack up yellow cards, and following a warning from The Football Association, Sproson arranged for local referee Roy Capey to lecture the players on sportsmanship. In the middle of April, Sproson was given the management job on a permanent basis, despite his team falling to fifth from bottom. Sproson stated that he was 'calculated' and 'controlled', compared to Lee who 'fizzes like a bottle of pop'. By the time they broke their poor run with a 2–1 home win over managerless Charlton Athletic, other results had already ensured their safety from the drop.", "|align=\"left\"|DF||align=\"left\"| Roy Cross"]}, {"page": "1974–75 Port Vale F.C. season", "response": ["On the financial side, a loss was made of £16,964 despite donations of £13,803 from the development funds. The supporters group also paid £1,200 for video equipment, allowing the club to record games and show players their mistakes. The average home attendance of 4,346 was the third-lowest in the division. Wages stood at £72,874, gate receipts took in £43,199, and there was a loss in the transfer market of £6,000. The financial situation meant that seven players were released and thirteen were retained. Amongst those departing were: John Woodward (Scunthorpe United); Frank Sharp (Northwich Victoria); Roy Cross (Nuneaton Borough); Bill Summerscales (Rochdale); and Reg Edwards (Brereton Social).", "|align=\"left\"|DF||align=\"left\"| Roy Cross", "| May 1975 || DF ||  || Roy Cross || Nuneaton Borough || Free transfer || "]}]}}