{"wiki_id": "http://www.wikidata.org/entity/Q7372710", "itemLabel": "Roy Cromack", "itemDescription": "English racing cyclist (1940-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Cromack", "wikipedia_page": {"main": "Roy Cromack (18 February 1940 – 10 November 2017) was a racing cyclist who represented Britain in track races and in international road races such as the Peace Race. He was the first British cyclist to ride more than 500 miles in a 24-hour time trial. He was educated at the Percy Jackson Grammar School and Sheffield University (Maths, Physics).", "link_mentions": [{"page": "List of British cyclists", "response": ["* Roy Cromack"]}, {"page": "List of cycling records", "response": ["* Roy Cromack set the road record at  in 24 hours in UK in 1969."]}, {"page": "Oxford University Cycling Club", "response": ["In the 1960s and 1970s, a much-diminished membership reflected the national decline in cycle sport and cycling in general. Fortunately for the survival of OUCC, a steady trickle of committed ‘club’ cyclists, who already belonged to their local clubs and had raced as juniors, passed through the University club. As well as maintaining, through several lean years, all the essential events in the club calendar, including the inter-college ‘Cuppers’ 10-miles time trial, the club promoted the 1962 UAU. 50-mile championship time trial, in which it won its first individual and team medals at British Universities level; only Roy Cromack, then riding for Sheffield University, denying Bill Fowler (Keble Coll.) the gold. The outstanding racing member of the mid-to-late ‘60s was Mark Carritt (Univ. Coll.), a typical OUCC. ‘all-rounder’, though very untypical in that he excelled at every form of cycling competition. Carritt took the Bucks-Oxon-Berks road race title twice, as well as the British Universities road race, while in time trials he was among the best British 12-hour riders of his day, and, at the 25-mile distance, was the first OUCC rider to break the hour, recording a time of 58 minutes and 4 seconds in the 1968 Varsity Match."]}, {"page": "Great Britain at the 1968 Summer Olympics", "response": ["* Roy Cromack"]}, {"page": "British National Team Pursuit Championships", "response": ["| 1965 || Solihull CC Trevor Bull Graham WebbRoy CromackAndy King ||   ||", "| 1966 ||Solihull CC Trevor Bull Graham WebbRoy CromackBarry Moss || Polytechnic CCIan Alsop  ||"]}, {"page": "Golden Book of Cycling", "response": ["* Roy Cromack was an all-rounder, winning championship medals from 4,000 metres on the track to 24 hours on the road. He competed in the road race at the 1968 Summer Olympics in Mexico. Citation in 1991, aged 51."]}, {"page": "Cycling at the 1968 Summer Olympics – Men's team time trial", "response": ["| 11 ||align=left| John BettisonRoy CromackPete SmithJohn Watson ||align=left|  || 2:16:38.60"]}, {"page": "Outwood Academy Adwick", "response": ["* Roy Cromack (1950 entrant), Road Cyclist "]}, {"page": "Cromack", "response": ["* Roy Cromack (1940–2017), English racing cyclist"]}]}}