{"wiki_id": "http://www.wikidata.org/entity/Q7375172", "itemLabel": "Royce Mills", "itemDescription": "British actor (1942-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Royce_Mills", "wikipedia_page": {"main": "Anthony Royce Mills (12 May 1942 – 21 May 2019) was an English television, stage and film actor.He attended Eastbourne College, then studied fine art for five years and qualified as a theatre designer before attending the Guildhall School where he was a prize-winning student. He then joined in Bristol Old Vic and appeared in many theatres. In later years he proved himself to be among the finest pantomime dames in the country, notably in his appearances at the Yvonne Arnaud Theatre, Guildford. Mills was a performer with the Theatre of Comedy (from 1983), whose artistic director was Ray Cooney, and at the National Theatre. From around 1999, he appeared in Gilbert and Sullivan productions for the revived D'Oyly Carte company at the Savoy Theatre.He became a legend of the West End having acted in most of the theatres during a career that lasted more than fifty years, starring alongside Peter O'Toole in Jeffrey Bernard is Unwell  later revived by Tom Conti with whom Mills teamed up with many times in other productions.\nMills was in the original production of Phantom of the Opera with Michael Crawford, playing Monsieur Firmin - the Theatre Manager. Other musicals include Some Like it Hot with Tommy Steele.\nMills made numerous television and film appearances including History of the World, Part I (1981) with Mel Brooks  and the Frankie Howerd films Up Pompeii and Up the Chastity Belt (1971), and has appeared with many entertainers including; Marti Caine, Bing Crosby, Jim Davidson, Les Dawson, Dick Emery and Mike Yarwood. He also provided voiceovers for many television commercials.Mills died on 21 May 2019, at the age of 77.", "link_mentions": [{"page": "Dalek", "response": ["Besides Hawkins and Graham, other voice actors for the Daleks have included Roy Skelton, who first voiced the Daleks in the 1967 story The Evil of the Daleks and provided voices for five additional Dalek serials including Planet of the Daleks,Planet of the Daleks. Writer Terry Nation, Director David Maloney, Producer Barry Letts. Doctor Who. BBC1, London. 7 April–12 May 1973. and for the one-off anniversary special The Five Doctors. Michael Wisher, the actor who originated the role of Dalek creator Davros in Genesis of the Daleks, provided Dalek voices for that same story, as well as for Frontier in Space, Planet of the Daleks, and Death to the Daleks. Other Dalek voice actors include Royce Mills (three stories), Brian Miller (two stories), and Oliver Gilbert and Peter Messaline (one story).Day of the Daleks. Writer Louis Marks, Director Paul Bernard, Producer Barry Letts. Doctor Who. BBC1, London. 1–22 January 1972. John Leeson, who performed the voice of K9 in several Doctor Who stories, and Davros actors Terry Molloy and David Gooderson also contributed supporting voices for various Dalek serials."]}, {"page": "British sitcom", "response": ["Rings on Their Fingers (1978–80)  was written by Richard Waring and produced by Harold Snoad for the BBC. It ran from 1978 to 1980 for 20 episodes in 3 series. It concerns a young unmarried couple (Sandy Bennett and Oliver Pryde) played by Diane Keen and Martin Jarvis. The cast also included Tim Barrett, Barbara Lott, Anna Dawson, John Kane and Royce Mills. Sandy wishes to marry whereas Oliver is happy to remain unmarried. During the first series they do marry and in the second series they adjust to married life. A proposed fourth series would have concerned Sandy becoming pregnant unexpectedly, and Sandy and Oliver adapting to parenthood, but the series was not re-commissioned."]}, {"page": "Up Pompeii!", "response": ["The show inspired three films. The first was also called Up Pompeii (1971) and added such characters as Bilius, Voluptua, Scrubba and Villanus. It ended with the eruption of Mount Vesuvius, which anachronistically (for AD79) included Nero (who added, \"Wait till you see what I've up for Rome!\"), and had a brief epilogue in which Howerd played a modern-day museum guide showing the petrified remains of the Pompeiian characters. It was produced by Ned Sherrin and retained only Frankie Howerd from the cast of the original series (Ludicrus, for example, was played by Michael Hordern in the film adaptation, Erotica by Madeline Smith and Nausius by Royce Mills).  However, Aubrey Woods appeared in the TV series and the film, playing different roles."]}, {"page": "Mills (surname)", "response": ["*Royce Mills (1942–2019), English actor"]}, {"page": "Minder (TV series)", "response": ["Recurring characters included Des (George Layton) (series 1–3), a back-street mechanic friend of Terry's who was friendly and likable, but not beyond car theft when called for; professional gambler Maurice Michaelson (Anthony Valentine) (series 1–2), kind-hearted stripper Debbie Mitchell (Diana Malin) and air stewardess Penny (Gennie Nevinson), both recurring girlfriends of Terry's; Ray Winstone as mechanic Arnie (series 4–7, conceived as a replacement for George Layton's Des, and as dim as Des was sharp); and wide boy Justin James (Mark Farmer) (series 5–7), who idolised Arthur and aspired to be like him, seeing him as a kind of godfather. Royce Mills also starred as Arthur's financial adviser, Andrew, whose character appeared in a number of episodes across several series."]}, {"page": "Ben Travers", "response": ["After the abolition in 1968 of theatre censorship in Britain, Travers was for the first time able to write about sexual matters without discreet allusion or innuendo. The Bed Before Yesterday (1975) depicts a middle-aged woman discovering the pleasure of sex, to the consternation of some who know her and the delight of others. Joan Plowright played the central character with John Moffatt, Helen Mirren and Royce Mills in the main supporting roles. It received enthusiastic notices and ran for more than 500 performances, far outstripping the original runs of any of Travers's Aldwych farces.Wardle, Irving. \"The Bed Before Yesterday\", The Times, 10 December 1975, p. 8; and \"Theatres\", The Times, 30 April 1977, p. 8"]}, {"page": "Monty Bodkin", "response": ["Royce Mills portrayed Monty Bodkin in the 1988 radio dramatisation of Heavy Weather, part of the Blandings radio series. In the 1995 TV adaptation of Heavy Weather made by the BBC and partners, also broadcast in the United States by PBS, and titled Heavy Weather, Monty Bodkin was played by Samuel West. Monty was portrayed by Nicholas Boulton in the 2000 BBC radio adaptation of The Luck of the Bodkins."]}, {"page": "Play of the Month", "response": ["|Danny La Rue,Ronnie Barker,Coral Browne,Dinsdale Landen,John Standing,Robert Coote,Royce Mills,Reginald Barratt,George Giles"]}, {"page": "Pipkins", "response": ["| Fred Pipkin  || Royce Mills"]}, {"page": "The Invisible Japanese Gentlemen", "response": ["\"The Invisible Japanese Gentlemen\" was one of several Greene stories adapted for the 1970s British television series Shades of Greene. Denholm Elliott, starring Royce Mills and Celia Bannerman."]}, {"page": "Eastbourne College", "response": ["*Royce Mills, actor"]}, {"page": "See How They Run (play)", "response": ["In 1984, Ray Cooney directed a revival of Philip King's farce \"See How They Run,  which opened at London's Shaftesbury Theatre on February 8, presented by the Theatre of Comedy. It had Maureen Lipman (Miss Skillion), Royce Mills (Rev. Lionel Toop), Liza Goddard (Penelope Toop), Carol Hawkins (Ida), Christopher Timothy (Corporal Clive Winton), Peter Blake (The Intruder), Derek Nimmo (Rev. Arthur Humphrey), Michael Denison (Bishop of Lax) and Bill Pertwee (Sgt. Towers) in leading roles. "]}, {"page": "Edward and Friends", "response": ["*Voices: Bernard Cribbins, Royce Mills, Bill Pertwee, Sheila Steafel"]}, {"page": "List of Keeping Up Appearances characters", "response": ["Bunty and Dorian (played by Marcia Warren and Royce Mills) were two extremely eccentric neighbours of Bruce and Violet, who appeared in \"Violet's Country Cottage\". They lived in a manor house next door to the aforementioned cottage, but whether they actually were aristocracy or not was not mentioned (it was, however, strongly hinted, in that Hyacinth was keen to ingratiate herself with \"the lady from the manor house\" and in that she recalled Violet's description of her as \"eccentric but very well-connected\"). They tended to dress in shabby country wear and behaved very oddly, as befits friends of the equally eccentric Bruce, whom Bunty referred to as \"The Weirdo\". Bunty enjoyed drinking, hunting and shooting. She first met Hyacinth while looking for her lost dog (Hyacinth and Richard were staying in the cottage at the time). Unlike many of the people Hyacinth seeks to impress, Bunty didn't seem to find anything amiss in Hyacinth's genteel manner. Richard met up with her husband Dorian while helping to look for the missing dog at Hyacinth's behest, and brought Dorian back to the cottage with him. Bunty quickly became drunk and Dorian started to pursue Hyacinth amorously, which amused Bunty to no end. For once, Hyacinth did not act snobbishly but went with the flow, and the three of them danced a conga line at the end of the episode."]}, {"page": "Run for Your Wife (play)", "response": ["*Royce Mills as Bobby Franklyn"]}, {"page": "List of fictional Romans", "response": ["* Nausius - the effeminate son of Ludicrus Sextus and Ammonia in the TV series Up Pompeii! and its 1971 film adaptation. In the original TV series and the spinoff Further Up Pompeii, he was portrayed by Kerry Gardner. In the 1971 film, he was portrayed by Royce Mills.Nausius (Character) "]}, {"page": "List of The Tomorrow People serials", "response": ["| colspan=\"5\" | Guest Cast: Anulka Dziubinska (Pavla), Jan Murzynowski (KGB Man), Gabor Vernon (Senior KGB Man), Vivien Heilbron (Major Ann Turner), Royce Mills (Dr. Taylor), Steve Ismay (S I S Sergeant)"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: T. P. McKenna as J.J. Mooney, Shaun Curry as Sprott, Royce Mills as Andrew, Vivian Mann as Tony, Rosalind Lloyd as Fenella, Timothy Bateson as Railwayman, Hugh Futcher as Mo, Alan Chuntz as Punter in Betting Shop.", "|colspan=\"3\"|Guest stars: Jake D'Arcy as McTaggart, Peter Capaldi as Ozzie, Jan Francis as Sarah Bates, Timothy Carlton as Granger, Benjamin Whitrow as Doctor, David Daker as Sir Ronald Bates, Debbie Arnold as Julie, Royce Mills as Andrew, Howard Attfield as Private Detective.", "|colspan=\"3\"|Guest stars: Penny Morrell as Daphne Mount, Mark Farmer as Justin, Jonathan Elsom as Mr Muir, Ben Howard as Second-hand Sid, Robert Austin as Freddy the Fly, Royce Mills as Andrew, Johnnie Wade as Albert, Paul Cooper as Ron, John Alkin as John Beadle, Barry Ewart as 1st Reporter, John Livesey as 2nd Reporter", "|colspan=\"3\"|Guest stars: Paul Eddington as Guy Wheeler, Simon Cadell as William Pierce, the bank manager, Michael Lees as Tony Davis, Iain Cuthbertson as McKenna, Mark Farmer as Justin, Cassie Stuart as Veronica, Royce Mills as Andrew, Morris Perry as DHSS Manager"]}, {"page": "Blandings (radio series)", "response": ["Adapted from Summer Lightning (1929). In addition to the regular cast, the voice actors included Graham Seed as Ronnie Fish, Royce Mills as Hugo Carmody, Wendy Murray as Millicent, Susannah Fellows as Sue Brown, ", "Adapted from Heavy Weather (1933). Additional voice actors included John Savident as Lord Tilbury, Josephine Tewson as Lady Julia, Royce Mills as Monty Bodkin, Jeremy Nicholas as Hugo, Charles Collingwood as Ronnie Fish, Moir Leslie as Sue Brown, Norman Bird as Pirbright, and Roger Sloman as Pilbeam. ", "Adapted from Pigs Have Wings (1952). Additional voice actors included Joan Sims as Maudie Digby, Susannah Fellows as Penny Donaldson, Royce Mills as Jerry Vail, Charles Collingwood as Orlo Vosper, David Graham as Binstead, and Moir Leslie as Gloria Salt."]}, {"page": "2019 in British television", "response": ["|Royce Mills"]}, {"page": "2019 in the United Kingdom", "response": ["*21 May – Royce Mills, 77, English actor (History of the World, Part I, Up the Chastity Belt, Doctor Who)."]}, {"page": "2019 in England", "response": ["*21 May – Royce Mills, 77, English actor (History of the World, Part I, Up the Chastity Belt, Doctor Who)."]}, {"page": "Deaths in May 2019", "response": ["*Royce Mills, 77, British actor (History of the World, Part I, Up the Chastity Belt, Doctor Who).Obituary: Royce Mills – ‘master farceur and much-admired pantomime dame’"]}]}}