{"wiki_id": "http://www.wikidata.org/entity/Q7373215", "itemLabel": "Roy Noakes", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Noakes", "wikipedia_page": {"main": "Roy Noakes  (June 10, 1936 - February 9, 2002) was a British sculptor.", "link_mentions": [{"page": "Isabel Nicholas", "response": ["Lambert died in 1951 and Rawsthorne returned to Paris to paint. She continued to see Giacometti, but eventually settled with Alan Rawsthorne. They moved to a thatched cottage in rural Essex with a purpose built studio, near friends such as the politician Tom Driberg, poet Randall Swingler, artists Michael Ayrton and Biddy and Roy Noakes; Bacon had a house not far away. Six of Bacon's portraits of Rawsthorne were shown in his 1967 show, including Portrait of Isabel Rawsthorne. In all, between 1964 and 1970 he painted 14 images of her, including five triptychs. Giacometti died in 1966 and Rawsthorne in 1992; Bacon outlived Rawsthorne by a few months. Apart from visits to London and Paris, Africa, Greece and Australia, and a short period in Cambridge (1972-3), she lived in the cottage for forty years - half of her life. She raised geese, a nod to her interest in Konrad Lorenz, and became involved in the emergent environmentalist movement. She and her last husband are buried in Thaxted churchyard.Thaxted churchyard.", "Rawsthorne explored the ambiguities of appearance through the theme of the double – reflections, such as those seen in the practice room mirrors, for instance. During the late 1960s and 70s, the deaths of Giacometti and Rawsthorne prompted her to refine these ideas in a set of ethereal double portraits juxtaposing living, dead and sculpted likenesses.For example, Reflected Portrait of Alan These works returned to the matière relief effects of the early 1950s and exchanged ideas with Bacon and the sculptor Roy Noakes. Some of these new works and a selection of her innovative dancers were presented to the public at the Marlborough Gallery  in 1968.Isabel Lambert, Marlborough Gallery, London, 1968"]}, {"page": "Noakes", "response": ["*Roy Noakes (1936–2002), British sculptor"]}, {"page": "List of monumental masons", "response": ["*Anselm Odling, English, active early-to-mid-20th century, mentor to sculptor Roy Noakes."]}]}}