{"wiki_id": "http://www.wikidata.org/entity/Q7373273", "itemLabel": "Roy Powell", "itemDescription": "English rugby league footballer (1965-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Powell_(rugby_league)", "wikipedia_page": {"main": "Roy Colin Powell (30 April 1965 – 27 December 1998) was an English professional rugby league footballer who played in the 1980s and 1990s. He played at representative level for Great Britain, and at club level for St John Fisher (in Dewsbury), Leeds, Bradford Northern, Featherstone Rovers, Batley and Rochdale Hornets, as a prop, or second-row, i.e. number 8 or 10, or 11 or 12.", "link_mentions": [{"page": "Batley Bulldogs", "response": ["* Roy Powell"]}, {"page": "Rochdale Hornets", "response": ["In October 1998, Karl Marriott died following a training session and a couple of months later Roy Powell died in similar circumstances. Hornets struggled early in the campaign when they occupied bottom spot for a couple of weeks. They recovered slightly and had moved up to 15th position, fourth bottom, by late June."]}, {"page": "1994 Kangaroo tour of Great Britain and France", "response": ["|PR ||8||Roy Powell"]}, {"page": "Roy Powell", "response": ["Roy Powell (born 2 October 1965 in Langham, Rutland) is a British jazz pianist."]}, {"page": "Terry O'Connor (rugby league)", "response": ["O'Connor went on to represent Ireland at the 2000 Rugby League World Cup, and went on to captain Ireland on numerous occasion. The side earned fabulous reviews under the guidance of Terry and his best friend Barrie McDermott. O'Connor also represented Lancashire in the Origin Series in 2001 and 2002 and never lost against arch rivals; Yorkshire. He was awarded the Roy Powell Medal for his performance in the 2001 series. O'Connor retired from Great Britain in 2002 with 15 caps."]}, {"page": "1990 Kangaroo tour of Great Britain and France", "response": ["|PR ||8||Roy Powell", "|SR ||12|| Roy Powell", "Bob Fulton made a number of changes from the first test loss at Wembley. Dale Shearer returned to the wing in place of Michael Hancock. A knee injury against Castleford when his knee had collided with the head of teammate Glenn Lazarus (who suffered a bad cut requiring 17 stitches) had ended centre Mark McGaw's tour with Laurie Daley returning to the test team to partner Meninga in the centres despite having a broken bone in his right hand. Cliff Lyons, who had won a premiership with Manly under Fulton in 1987, was called up to make his test debut with Ricky Stuart moving to halfback in place of Allan Langer. Others coming into the side were Benny Elias (hooker) for his first test since the 1988 World Cup Final, Glenn Lazarus in the front row and playing in headgear to protect the stitches, while Brad Mackay come in at lock with Bob Lindner moving to the second row at the expense of John Cartwright who dropped to the bench. Mal Reilly stuck with much of the same side that had won the first test, though injury ruled out Bradford's Karl Fairbank with Leeds forward Roy Powell moved to the bench. Wigan's Andy Platt came into the team in the front row and Paul Dixon dropping back to his preferred second row.", "|IC ||17|| Roy Powell", "|IC ||15|| Roy Powell"]}, {"page": "List of Leeds Rhinos international players", "response": ["* Roy Powell won caps for Great Britain while at Leeds 13+6-caps 1985-91"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Roy Powell circa-1988", "* Roy Powell circa-1988", "*Roy Powell"]}]}}