{"wiki_id": "http://www.wikidata.org/entity/Q737654", "itemLabel": "Robert John Lechmere Guppy", "itemDescription": "British naturalist (1836-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lechmere_Guppy", "wikipedia_page": {"main": "Robert John Lechmere Guppy (15 August 1836 in London – 5 August 1916 in San Fernando, Trinidad and Tobago) was a British-born naturalist after whom the guppy is named.  He contributed much to the geology, palaeontology and zoology of the West Indian region, in particular Trinidad.\nHe was one of four children of Robert Guppy (1808-1894), a lawyer who went to Trinidad and became Mayor of San Fernando, and Amelia Elizabeth Guppy, a painter and one of the pioneers of photography, who navigated the Orinoco River accompanied by only a few native Indians. \"Lechmere\", as he was called, was raised by his grandparents, Richard Parkinson and Lucy (née Lechmere, daughter of Royal Navy officer William Lechmere, Vice-Admiral of the White), in Kinnersley Castle, a 13th-century Norman castle in Herefordshire. Richard Parkinson wanted Lechmere to take over the castle, a role in which he had no interest. Having come into an inheritance from another relative, he left England at the age of 18. He visited Australia, Tasmania and was shipwrecked on the coast of New Zealand in 1856. After living with the Māori for two years and mapping the area, Lechmere left New Zealand for Trinidad, where his parents were living. He married Alice Rostant, the daughter of local French  planters and a descendant of the Counts of Rostant, French aristocrats who had fled to Trinidad to escape the French Revolution.  Lechmere became Trinidad's Chief Inspector of Schools until his retirement in 1891.\nAlthough he had no formal training in the sciences  Lechmere wrote and published numerous articles on the palaeontology of the region. He served as President of the Scientific Association of Trinidad, as well as of the Royal Victoria Institute Board. He contributed about seventy memoirs or papers between 1863 and 1913. His special interest went to paleoconchology and Recent mollusks, especially the terrestrial and fluviatile species.\nThough sometimes rumoured to have been a clergyman, Lechmere Guppy was, in fact, an agnostic.Guppy discovered the Guppy fish in Trinidad in 1866, and the fish was named Girardinus guppii in his honour by Albert C. L. G. Günther later that year. However, it was later discovered the fish had previously been described in America. Although Girardinus guppii is now considered a junior synonym of Poecilia reticulata, the common name \"guppy\" still remains.\n\n", "link_mentions": []}}