{"wiki_id": "http://www.wikidata.org/entity/Q737197", "itemLabel": "Craig Sives", "itemDescription": "Scottish footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Sives", "wikipedia_page": {"main": "Craig Stuart Sives (born 9 April 1986) is a Scottish former professional association football player who played as a defender. Sivers began his career with Edinburgh club Heart of Midlothian, where he made two appearances and was sent on loan to Partick Thistle and Queen of the South. He subsequently played with Irish club Shamrock Rovers and Australian side Hume City, before returning to Scotland to play for Livingston. After a brief loan spell with Cowdenbeath in 2016, he signed for the club permanently, playing thirteen matches before retiring from football in January 2017.", "link_mentions": [{"page": "Shamrock Rovers F.C.", "response": ["*2011: Craig Sives"]}, {"page": "Edinburgh derby", "response": ["The clubs then had difficulty scheduling the 2004–05 match, partly due to the clubs arranging other friendly matches. The Festival Cup match was eventually played at Tynecastle on 4 September 2004. Both teams were well below full strength because several players were training with their national teams. Playing the game in September also meant that the game was played after the start of the 2004–05 Scottish Premier League season and after the end of the Festival. Hearts won the second and to date last Festival Cup match 3–1. The Hearts goals were scored by Craig Sives, Mark de Vries and Dennis Wyness, while Stephen Dobbie scored a penalty kick for Hibs. The match was not in played in 2005 as Hearts had a protracted search for a new head coach. It was not resurrected in 2006 and has not been contested since."]}, {"page": "Festival Cup", "response": ["The following year, pre-arranged friendlies and fixture congestion meant that the clubs found it difficult to find a suitable date within the Festival period. The international fixture weekend in early September was agreed upon, but this meant that both sides were missing players who were representing national teams, effectively reducing the game to little more than a reserve team fixture. Amongst the sides who played, Craig Sives and Calum Elliot had both yet to feature in the Hearts first team, while Hibs included untried personnel in the form of John Kane and Jay Shields."]}, {"page": "2011 Shamrock Rovers F.C. season", "response": ["|4||DF||align=\"left\"| Craig Sives", "|Craig Sives"]}, {"page": "2012 St Patrick's Athletic F.C. season", "response": ["The Saints faced Shamrock Rovers away in their next league game after a 1–0 win vs ÍBV in their last game. The Inchicore men started off the better side, with new signing Anto Flood coming close. Craig Sives scored a header from a Billy Dennehy free-kick in the 71st minute for Rovers but in the 2nd minute of injury time, John Russell put Pat Flynn through on goal and he smashed home an equalizer against his old club to send the away end into pandemonium."]}, {"page": "Sean Gannon (footballer)", "response": ["Gannon made his senior debut for Shamrock Rovers in February 2011, coming on as a half-time substitute for Craig Sives in a Leinster Senior Cup game away to Dundalk. His league debut came on 12 September when he started in a 1–1 draw with St Patrick's Athletic, his only league appearance of the 2011 season. Gannon was part of the Shamrock Rovers squad that became the first ever Irish side to reach the group stage of European competition when they knocked out Partizan Belgrade in the Europa League 4th qualifying round, however he made no appearances in qualifying and was cut from the 25-man squad for the group stage."]}, {"page": "List of foreign League of Ireland players", "response": ["* Craig Sives – Shamrock Rovers"]}, {"page": "PFAI Team of the Year", "response": ["!scope=row|Craig Sives "]}, {"page": "List of foreign Australian State League players", "response": ["* Craig Sives"]}, {"page": "2016–17 Livingston F.C. season", "response": ["| Craig Sives"]}]}}