{"wiki_id": "http://www.wikidata.org/entity/Q7373436", "itemLabel": "Roy Tunks", "itemDescription": "English footballer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Tunks", "wikipedia_page": {"main": "Roy William Tunks (born 21 January 1951) is a German-born English former professional footballer who played as a goalkeeper. He made over 850 appearances in a playing career spanning over twenty years.\nHe was signed for a record fee by Preston North End in 1974 as a goalkeeper from Rotherham United where he was known as the \"boy with the golden gloves\". He played well over 300 games for Preston North End, and was the club's Player of the Year for the 1979–80 season.\nHe moved to Wigan Athletic in 1981, and was part of the team that won the Associate Members' Cup in 1985.After retiring in 1990, Tunks moved into coaching. He joined the FA and worked with England youngsters at under 16 to under 20 level. He also worked at Premier League clubs Blackburn Rovers and Newcastle United as a goalkeeping coach. He was part of the backroom staff at Tranmere Rovers before moving on to become head of Goalkeeping Department at Manchester City F.C", "link_mentions": [{"page": "Preston North End F.C. Player of the Year", "response": ["* 1979–80 Roy Tunks"]}, {"page": "History of Preston North End F.C.", "response": ["Promotion was won under Nobby Stiles in 1977–78, inspired by the likes of goalkeeper Roy Tunks, defender Mick Baxter, midfielder Gordon Coleman and the dynamic strike force of Alex Bruce and Mike Elwiss. At the same time the emerging Michael Robinson was sold for a club record fee of £765,000 to Manchester City, whilst Alan Spavin retired."]}, {"page": "Tunks", "response": ["* Roy Tunks (born 1951), professional footballer"]}, {"page": "Simon Smith (footballer)", "response": ["On 16 September 2004 Smith handed in his resignation and left the club. He was replaced by Roy Tunks."]}, {"page": "Peter Litchfield", "response": ["Born in 1956 in Manchester, England, Litchfield started his career as a junior player with Manchester City and made three reserve appearances before being released at the end of the 1976–1977 season. He turned down a move to Stockport County and returned to City in September 1977 to play for the juniors on a monthly basis following an injury to another young keeper Tony Armstrong.Manchester City v Bristol City football programme, 24 September 1977, p20 Later he moved on to local non-league side Droylsden. In January 1979, he was signed by Football League Second Division-side Preston North End for £3,000. He waited two years to replace first-choice goalkeeper Roy Tunks for his Preston debut, which came on 28 February 1981 against Chelsea, keeping a clean sheet in a 1–0 victory and earning The Sun newspaper's man of the match award. His prize was a £1,000 charity cheque, which he donated to a motor neurone disease cause, in memory of former Preston player Mel Holden, who had died from the disease. He made another two appearances in the Second Division, as the club were relegated in the 1980–81 season, and went on to play a total of 107 league appearances with Preston, winning the club's player of the year in the 1983–84 season. His Preston career ended with relegation to the Fourth Division."]}, {"page": "List of footballers in England by number of league appearances", "response": ["!scope=row data-sort-value=\"Tunks, Roy\"|Roy Tunks"]}]}}