{"wiki_id": "http://www.wikidata.org/entity/Q7373497", "itemLabel": "Roy Wilkinson", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Wilkinson", "wikipedia_page": {"main": "Roy Wilkinson is a British music journalist and band manager.\nAs a journalist he is best known for his work in Sounds, Select and Q, but has contributed to various other publications. Considered an authority on the Pixies, he appears in their 2002 documentary Gouge, available on the 2004 Pixies DVD. He also appeared in a 1998 BBC Scotland  documentary about Belle and Sebastian. With NME journalist Keith Cameron, he started the Costermonger record label, on which the pair released records by bands including Gene. Until November 2005, he managed British Sea Power, a band which includes his younger brothers Jan and Hamilton.Wilkinson's book Do It For Your Mum, a biography of British Sea Power and a memoir of his family, was published in 2011.", "link_mentions": [{"page": "Sea Power (band)", "response": ["September 2011 saw the publication on Rough Trade Books of Do It for Your Mum by Roy Wilkinson (brother of Yan and Hamilton), an account of the author's experiences of managing the band and of how the family's octogenarian father became the group's most ardent fan."]}, {"page": "Gene (band)", "response": ["By the time NME journalists Keith Cameron and Roy Wilkinson encountered Gene, the band had already gained some live experience and written several songs. Cameron and Wilkinson were impressed enough to form independent record label Costermonger with the sole purpose of promoting Gene to a wider audience.  Their double A-sided debut single \"For The Dead\" / \"Child's Body\" was released on Costermonger in May 1994. The single received a great deal of attention from the music press: Select named it \"Single Of The Month\", whilst NME made it their \"Single of the Week\".", "The band members have all continued to work in music. Roy Wilkinson went on to manage the band British Sea Power, while Snake Newton went on to mix an assortment of acts including Duran Duran, Sugababes, Pet Shop Boys and Snow Patrol."]}, {"page": "Coming Up (album)", "response": ["Reviews were generally positive and seemed to respect Suede's new poppy and direct sound. James Delingpole of The Daily Telegraph wrote: \"Coming Up is their defiant reminder of what made Suede so special [...] If Dog Man Star was Diamond Dogs, then this is Suede's Ziggy Stardust – extravagant, steeped in glam and unashamedly poppy.\" Roy Wilkinson of Select called it: \"a wondrous pop album, simultaneously immediate and full of scope, a lovely, charming mix of absolute beauty and the thrillingly awkward.\" Caroline Sullivan of The Guardian felt that even despite the album's simplistic composition of \"vibrant three-minute howla-longs\", it still manages to avoid being too mainstream and incomparable to rivals Oasis and Blur. Andy Gill of The Independent, however was a harsh critic of the album. In contrast to the band's earlier work, he wrote: \"two albums and one guitarist later, they sound utterly mined out.\" He added: \"in many ways, it's a step back from Dog Man Star – and their manner grows increasingly obnoxious.\""]}, {"page": "Me and a Monkey on the Moon", "response": ["Me and a Monkey on the Moon is the tenth and final album by English alternative rock band Felt, released in 1989. It was originally issued on Mike Alway's él label, part of Cherry Red. In a review for Sounds, Roy Wilkinson described it as \"perhaps their finest album yet.\""]}, {"page": "Change Giver", "response": ["Q magazine's Martin Aston noted that Shed Seven had \"enjoyed an arresting development to date\", when reviewing Change Giver in October 1994. He remarked on the group's knack of \"covering different bases\" throughout the record, and surmised that they \"neatly mirror the original mod tendency to expand in the direction of acid rock\". Singling out \"Dolphin\" as one of the album's highlights, he labelled the song \"a memorably chunky slice of Northern pop scruff\", and went on to claim that \"Speakeasy\" was \"even better\". The latter track was also praised by Select magazine's Roy Wilkinson, who stated that \"the inclusion of a song as poutingly self-confident as 'Speakeasy' shows that Shed Seven can cut the mustard\". He chose the deftness of \"Ocean Pie\" and the \"I Am the Resurrection\"-esque \"On an Island with You\" as other notable tracks, but found most of the songs on the record to have more in common with the sound of \"Dolphin\"—a track that he described as a \"clanking half-tune\". Deeming the album's shortcomings to be \"no felony\" when considering the band's youthful age, Wilkinson concluded that there was \"enough here to show they could soon make a record to dwarf this one.\" Craig McLean of Vox magazine thought that Change Giver managed to \"transcend\" the connotations with Oasis and the New Wave of New Wave scene that faced Shed Seven prior to the record's release. He compared \"Dolphin\" to the \"tom-tom frothiness\" of the Jack Rubies, noted a Byrds-like vocal interplay in \"Speakeasy\", and declared that the album \"rides off into the sunset with the eight-minute riff-a-thon 'On an Island with You'.\"  Music Week gave Change Giver a four out of five rating, and stated that it comprised \"tight ensemble playing and a soul-tinged, mod-pop cool that is built to last.\""]}, {"page": "Select (magazine)", "response": ["*Roy Wilkinson, reviews editor"]}, {"page": "Wilkinson (surname)", "response": ["* Roy Wilkinson, British music journalist"]}, {"page": "Natland", "response": ["There is a long-standing legend that Natland has a Treacle Mine. What is certain is that there is a cave system running under the village from Helm to the river although the precise route is not known. For more information see Natland Treacle Mines and Natland Treacle Tours. Yan, Hamilton and Woody of the rock band British Sea Power were raised in the village, as was their former manager Roy Wilkinson.", "*Roy Wilkinson (living), music journalist and British Sea Power manager"]}, {"page": "1919 Cincinnati Reds season", "response": ["With Roy Wilkinson in the ballgame, the Reds added two more runs in the seventh inning, as Heinie Groh singled home Jake Daubert, and Pat Duncan drove in Groh on a groundout, giving Cincinnati an 8–1 lead.  In the eighth inning, the Reds took a 9–1 lead as Dutch Ruether hit his second triple of the game off of Grover Lowdermilk, driving home Greasy Neale.", "In the fifth inning, the Reds Larry Kopf tripled off of Bill James, and was brought home after a Greasy Neale single, making it 6-1 Cincinnati.  The Reds continued to pour on the offense in the sixth inning, when Hod Eller singled off of James, followed by a walk by Morrie Rath, knocking James out of the game.  The White Sox brought in Roy Wilkinson to pitch, however, Jake Daubert reached first base after an error, loading the bases.  Edd Roush then singled, scoring Eller and Rath, followed by a single by Pat Duncan, scoring Roush, and giving the Reds a 9–1 lead."]}, {"page": "8-Way Santa", "response": ["\"Jinx\" and \"Jack Pepsi\" were the singles released from this album. Pepsi filed a lawsuit against the band for using their logo on the single \"Jack Pepsi\". The song itself was, in the words of music journalist Roy Wilkinson, \"the true story of how Tad and his mate tanked up on Jack Daniels and cola before taking a pick-up onto an ice-covered lake — tempting fate... and sure enough, they crashed through\"."]}, {"page": "1922 Chicago White Sox season", "response": ["| Roy Wilkinson || 4 || 14.1 || 0 || 1 || 8.79 || 3"]}, {"page": "Incubate (festival)", "response": ["* Roy Wilkinson"]}]}}