{"wiki_id": "http://www.wikidata.org/entity/Q7372363", "itemLabel": "Roxanne Emery", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Roxanne_Emery", "wikipedia_page": {"main": "Roxanne Emery, known also by her stage name RØRY, is a London-based singer-songwriter, multi-instrumentalist and producer. She is the sister of the DJ and producer Gareth Emery. Her music has been featured in episodes of several popular television shows, including Cougar Town, Awkward, and Keeping Up with the Kardashians. She also runs her own label Late Records, which manages other independent artists.", "link_mentions": [{"page": "Gareth Emery", "response": ["Gareth Emery was born in Southampton, England, United Kingdom  His sister is the singer-songwriter Roxanne Emery. He lived in Southampton until the age of 26 before relocating to Manchester, England, U.K. where he had a studio and ran a night club and record label, both called Garuda. He has a degree in Politics from University of Warwick and is trained in classical piano. Prior to becoming involved in electronic music he played guitar in a punk band in the mid-nineties. He now lives in Los Angeles with his wife Kat and two daughters."]}, {"page": "Times Like These (song)", "response": ["*Trance DJ and producer Ciaran McAuley recorded the song in collaboration with vocalist Roxanne Emery under their HØLY WATERS alias."]}, {"page": "On Fire", "response": ["* \"On Fire\", by Luke Bond featuring Roxanne Emery, 2014"]}, {"page": "Kelly Sweet", "response": ["In November 2016, Haliene wrote the song Saving Light with Gareth Emery, Roxanne Emery, Karra and Matthew Steeper. It was released January 30, 2017, by the Canadian label, Monstercat. The song reached number one on the Beatport overall chart within a week of its release, becoming the first trance single to do so in 5 years. The artists partnered with the UK's largest anti-bullying charity Ditch the Label, launching a campaign titled after the song to raise money for the victims of bullying."]}, {"page": "Earth Mover", "response": ["#A Day That Fades (Featuring Roxanne Emery) – 6:10"]}, {"page": "Aly & Fila", "response": ["Following the FSOE 200 celebrations, Aly & Fila released their second studio album entitled Quiet Storm. This album followed their debut artist album, Rising Sun which was released in 2010. Quiet Storm featured collaborations with Solarstone, Arctic Moon, John O'Callaghan, Giuseppe Ottaviani, and many more. From that point on, Aly & Fila have released another album, The Other Shore, which features collaborations with Ferry Tayle, Stoneface & Terminal, Roger Shah, Roxanne Emery, and others. The album was released on October 3, 2014. In 2015, the duo released an album called The Chill Out which consists of remixes of tracks like \"We Control the Sunlight\" and \"Mysteries Unfold\". Most recently, Aly & Fila announced their plans for their next milestone, celebrating 450 episodes on their radio show, Future Sound of Egypt. They have confirmed stops at the Hollywood Palladium in Los Angeles, California on July 3, 2016, at the Victoria Warehouse in Manchester, United Kingdom on October 1, 2016, a Weekender on October 6 and 7 at Karnak Temple Complex in Luxor and as last station on October 29 in Kaohsiung in Taiwan.", "|Luke Bond feat. Roxanne Emery – On Fire"]}, {"page": "Dash Berlin", "response": ["! scope=\"row\"| \"Shelter\"(featuring Roxanne Emery)", "! scope=\"row\"| \"Lighting The Bridges\" (featuring Roxanne Emery)"]}, {"page": "List of vocal trance artists", "response": ["*Roxanne Emery"]}, {"page": "Classic Tour", "response": ["*Roxanne Emery"]}, {"page": "The Reason 4", "response": ["The Reason 4 received a great deal of press throughout 2011 including a 14-page spread in Gay Times magazine, a double page spread in Attitude and various interviews in The Daily Star and various other newspapers and magazines. They also supported Peter Andre on a number of UK tour dates through the summer, played many light switch ons where they were joined on stage by Keith Lemon in Blackpool. In November 2011 were the official support act for Joe McElderry on his UK Classic Tour alongside Roxanne Emery."]}, {"page": "List of University of Warwick people", "response": ["* Roxanne Emery – solo singer/songwriter artist, founder of LATE records"]}, {"page": "Letters Tour", "response": ["The support act on the tour was Kyle Parry on the first two dates and Roxanne Emery thereafter."]}, {"page": "Andrew Rayel", "response": ["* 2020 \"Never Going Down\" (with Roxanne Emery)"]}, {"page": "Drive (Gareth Emery album)", "response": ["Drive is the second studio album produced by the electronic dance music artist Gareth Emery, released on 1 April 2014. The album is the follow up to Emery's first studio album, Northern Lights, released in 2010. The album features vocals from Christina Novelli who also sang on \"Concrete Angel\". Also featured are Gavin Beach, Ben Gold, LJ Ayrten, Asia Whiteacre, Krewella, Bo Bruce and Emery's sister Roxanne Emery."]}, {"page": "Roxanne (given name)", "response": ["* Roxanne Emery (born 1984), English singer-songwriter, multi-instrumentalist and producer"]}, {"page": "Alan Walker discography", "response": ["| style=\"text-align:center\"| Dash Berlin(featuring Roxanne Emery)"]}, {"page": "Jauz discography", "response": ["|Lema & Shafer featuring Roxanne Emery "]}, {"page": "Saving Light", "response": ["\"Saving Light\" is a song by English trance producers Gareth Emery and Standerwick, featuring vocals from Haliene. Roxanne Emery, Haliene, Matthew Steeper, and Karra wrote the song. It premiered in June 2016, during the Electric Daisy Carnival music festival and was digitally released on 30 January 2017. \"Saving Light\" is an uplifting trance song with lyrics about standing up to bullying and supporting victims by being their \"saving light\". Monstercat released the song as part of an initiative called \"Make Trance No. 1 Again\". Their goal was to encourage fans to purchase \"Saving Light\" on Beatport to support Ditch the Label and get the song to the top of the Beatport charts; this was achieved on 16 February 2017.", "Gareth Emery arranged Roxanne Emery, Haliene, Matthew Steeper, and Karra for a writing session in his home studio. Gareth Emery was not able to attend however and instead gave them a demo that he and Standerwick had been working on beforehand. Roxanne Emery suggested that they write a song about suicide; the lyrics were written in under an hour.", "* Roxanne Emery", "* Songwriting – Roxanne Emery, Kelly Sweet, Matthew Steeper, and Karra Madden", "Category:Songs written by Roxanne Emery"]}, {"page": "Michael Pollack (musician)", "response": ["|Alex Schwartz, Alexandra Sholler, Jacob Torrey, Jantine Heij, Joe Khajadourian, Roxanne Emery"]}, {"page": "Ahmed Romel", "response": ["* 2020: Ahmed Romel With Roxanne Emery - Don't Say Goodbye", "# Don't Say Goodbye (With Roxanne Emery)"]}, {"page": "Black Magic (Jonasu song)", "response": ["Category:Songs written by Roxanne Emery"]}, {"page": "List of songs written by Charli XCX", "response": ["| Joel CorryTimucin LamCharlotte AitchisonDiamonté HarperJanée BennettAmber Van DayCamille PurcellLewis ThompsonHolly LapsleyNeave ApplebaumNonôRoxanne EmeryPaul Van Haver\"Out Out\" contains a sample of \"Alors on danse\", written and performed by Stromae."]}]}}