{"wiki_id": "http://www.wikidata.org/entity/Q7373102", "itemLabel": "Roy MacGregor-Hastie", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_MacGregor-Hastie", "wikipedia_page": {"main": "Roy Alasdhair Niall MacGregor-Hastie (28 March 1929 – 12 February 1994) was a British author, journalist, political commentator, poet, and translator from and into Romanian.\nMacGregor-Hastie was born in Manchester in 1929. In the late 1950s and early 1960s he was a regular contributor to the Sunday Express, and his columns were syndicated worldwide by London Express features. He speaks seven languages, including Russian, was one of the most widely read commentators on Communist affairs, and has reported from Moscow, Warsaw, Prague, Budapest and Bucharest. He also broadcast on radio and TV.He published many books, including biographies of Nikita Khrushchev, Mao Zedong, Charles George Gordon, and Mircea Snegur. His biography of Nikita Khrushchev sold over 150,000 copies, and has been translated into many European languages and Turkish.\nHe taught at Kingston upon Hull College of Education (now called Hull College of Education) when Cyril Bibby was Principal (1959-1977). MacGregor-Hastie died in 1994.He appeared as a castaway on the BBC Radio programme Desert Island Discs on 27 July 1964.", "link_mentions": [{"page": "Marie-Thérèse Walter", "response": ["On 8 January 1927, Walter first met Picasso in front of the Galeries Lafayette in Paris. Author Herbert T. Schwartz dates their first meeting back to January 1925 at Gare Saint-Lazare, Paris; whereas author Roy MacGregor-Hastie dates the encounter up to 8 January 1928. At the time, Picasso was married to Olga Khokhlova, a Ukrainian ballerina, with whom he had a five-year-old son. He and Walter, then seventeen years old, began a relationship which was kept secret from his wife until 1935. From 1927 onwards, Walter lived close to Picasso's family, who lived in an apartment provided by and next door to his art dealer and friend, Paul Rosenberg, in Rue La Boétie. From 1930, she stayed in a house opposite Picasso's at Rue La Boétie 44.famsf.org, \"Picasso: The Women Behind the Artist\""]}, {"page": "Victor Felea", "response": ["Felea also published translations of Robert Frost, Marcel Brion, Roy MacGregor-Hastie, and others."]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Roy MacGregor-Hastie||The Day of the Lion by Roy MacGregor-Hastie||Cigarettes|| more"]}]}}