{"wiki_id": "http://www.wikidata.org/entity/Q7372192", "itemLabel": "Rowland Stephenson", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rowland_Stephenson_(banker)", "wikipedia_page": {"main": "Rowland Stephenson (19 May 1782 – 2 July 1856) was a British banker and politician who precipitated the collapse of a bank and took refuge in America.\n\nThe son of banker and great nephew of his namesake, MP for Carlisle (1787–1790), he had been born at sea when his family returned from Florida when their business failed after the American War of Independence. He joined Remington, Stephenson & Company on leaving Eton. He already had several properties in Essex, the manor of Cockermouth and How Hatch estate in Dagenham,  before adding to his property in Romford by buying Marshalls in 1816.", "link_mentions": [{"page": "Leominster (UK Parliament constituency)", "response": ["| Rowland Stephenson"]}, {"page": "Marshalls (house)", "response": ["In 1748 Marshalls passed from John Leigh to Mary Frost, and later passed to Jackson Barwis who was High Sheriff of Essex for 1796, the property remaining in the possession of his widow until her death on 24 December 1815. The house was then bought by local banker Rowland Stephenson of the bank Remington, Stephenson & Company in 1816. During his time Marshalls was described as ‘Princely’, but Stephenson, MP for Leominster had embezzled the bank of nearly half a million pounds and in 1828 he fled the country. Marshalls was then bought by Hugh McIntosh, who also owned the Manor of Havering and passed to his nephew David McIntosh who lived there until 1850 when he moved to the newly built mansion in Havering Park, although he had been letting Marshalls for some years."]}, {"page": "Thomas Hornor (surveyor)", "response": ["By 1820, he was in London again and began a project to depict the view of London from the dome of St Paul's Cathedral. Initial plans to sell panoramic views came to nothing but an elaborate scheme to create a 360 degree panorama on the inside of a dome of the Colosseum, specially built in Regents Park (and resembling the Roman Pantheon rather than the Colosseum), came to fruition but at such expense that his principal backer, Rowland Stephenson MP, had to flee to America in 1828, soon followed by Hornor. The Colosseum included a device to take \"the visitor who pays an extra price\" to a suitably elevated viewpoint: Hornor had designed the first passenger lift in England."]}, {"page": "London Colosseum", "response": ["The Colosseum was a venture of English artist and surveyor, Thomas Hornor, built to exhibit a vast panoramic view of London. The panorama was based on drawings Hornor had made from the vantage point of a temporary hut placed at the top of the dome of St Paul's Cathedral, while the cross and ball were being replaced in 1821–2. Initial plans to sell panoramic views came to nothing, but an elaborate scheme to create a 360-degree panorama on the inside of a dome of the Colosseum, specially built in Regents Park (and resembling the Roman Pantheon rather than the Roman Colosseum), came to fruition, but at such expense that its principal backer, Rowland Stephenson MP, had to flee to America in 1828, soon followed by Hornor."]}, {"page": "Rowland Macdonald Stephenson", "response": ["Born in Bloomsbury on 9 January 1808, into a long-established Cumberland family, Rowland Macdonald Stephenson was the oldest son of banker and politician Rowland Stephenson and wife Mary Eliza.  Educated at Harrow, he began work in his father's bank but its failure in 1828 (and his father's consequent exile in America) caused him to move into engineering, at first as London agent for the Gospel Oak Ironworks in Staffordshire. He applied himself to the study of railway engineering and became and associate of the Institution of Civil Engineers in 1836. In 1838 he became secretary of \"The Comprehensive Company for establishing Regular Steam Communication with India\", which became the \"Peninsular and Oriental Steam Navigation Company\" in 1840. In 1840, Sir Rowland married Marianne, the daughter of Lieutenant Edward Hederstedt, R.N., and together, they had twelve children. After Marianne's death in 1882, Sir Rowland, at the age of 75, married Elizabeth Tindall, the widow of J. Tindall of Scarbough.", "* The Spectator Archive. \"Rowland Stephenson\".(25 April 1829), p. 10. "]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|11 February 1830||Leominster||u||Rowland Stephenson||John Ward||Unseated for Bankruptcy"]}, {"page": "Jonathan Raine", "response": ["In 1816 Raine became King's Counsel. In 1818 his seat at Newport, while \"owned\" by the 3rd Duke of Northumberland, was actually contested by candidates put up by Thomas John Phillipps, who also had property there. In 1823 he was appointed First Justice for the Counties of Anglesey, Carnarvon and Merioneth, a position abolished in 1830. As a Welsh judge, he stood down for Newport in order to contest the seat again: he was re-elected at the by-election, after Rowland Stephenson opposed him. He voted against the Great Reform Bill, which would abolish the Newport constituency."]}, {"page": "Sir Digby Neave, 3rd Baronet", "response": ["Neave was a friend of John Constable, visiting his London studio on 21 May 1819. In 1825 Constable painted portraits of Neave and his brother Sheffield.John Constable, Toward A Complete Chronology, Edited by Charles S. Rhyne, Reed College (PDF) at p. 134 and p. 208 In the same year, Neave became godfather to Constable's daughter Emily.Constable Portraits, The Painter and his Circle (PDF) at p. 31 Constable stayed with him at Epsom; this was at Pitt Place, which at that date, 1831, was leased by Neave from Rowland Stephenson. He and family members later bought it at auction, in 1840."]}, {"page": "Charles Russell (1786–1856)", "response": ["In 1829, Russell again received an offer from the same source to allow himself, or Henry, to gain the seat of Leominster upon the retirement of Tory MP Rowland Stephenson. Russell was not convinced by assurances that there would be no contest and so did not pursue the matter."]}, {"page": "Edward Knubley", "response": ["He was commissioned a captain in the Westmorland Militia in 1780 by Lowther, then the Lord Lieutenant of Westmorland. Lowther (Lord Lonsdale after 1784) arranged to have him pricked High Sheriff of Cumberland in 1785. This made him returning officer for Cumberland, a position of advantage to support Lowther's electioneering. Lonsdale had gained control of the corporation of Carlisle in 1784, and arranged for the creation of 1,400 mostly non-resident freemen of the city, largely selected from among his tenantry and outnumbering the existing freemen two-to-one. His opportunity to test his electoral strength there came in 1786, when the Earl of Surrey, sitting member and leader of the opposition to Lonsdale there, succeeded as Duke of Norfolk and vacated his seat. Lonsdale put forth Knubley as a candidate for Carlisle at the ensuing by-election of 29 November 1786. Knubley outpolled his rival Rowland Stephenson 554 to 405, but the election was overturned on petition on 26 February 1787 and Stephenson was seated. "]}, {"page": "Rowland Stephenson", "response": ["Rowland Stephenson may refer to:", "*Rowland Stephenson (banker) (1782–1856), British politician", "*Rowland Stephenson (Carlisle MP) (??–1807), English politician"]}]}}