{"wiki_id": "http://www.wikidata.org/entity/Q7377409", "itemLabel": "Rudolph Dunbar", "itemDescription": "American conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Rudolph_Dunbar", "wikipedia_page": {"main": "Rudolph Dunbar (26 November 1907 – 10 June 1988) was a Guyanese conductor, clarinetist, and composer, as well as being a jazz musician of note in the 1920s. Leaving British Guiana at the age of 20, he had settled in England by 1931, and subsequently worked in other parts of Europe but lived most of his later years in London. Among numerous \"firsts\", he was the first black man to conduct the London Philharmonic Orchestra (1942), the first black man to conduct the Berlin Philharmonic (1945) and the first black man to conduct orchestras in Poland (1959) and Russia (1964). Dunbar also worked as a journalist and a war correspondent.", "link_mentions": [{"page": "List of composers of African descent", "response": ["* Rudolph Dunbar, Guyana (1907–1988)"]}, {"page": "Waheed Alli, Baron Alli", "response": ["He is one of a group of highly successful Guyanese people in Britain (Michael White of The Guardian refers to them as the \"Guyanese mafia\"), which includes Raj Persaud, Herman OuseleyMichael White, \"Balls gets his retaliation in first as annual GCSE row begins\" , The Guardian, 27 August 2009. and David Dabydeen, Cynthia Pine, Keith Waithe and Rudolph Dunbar.Guyanese Achievers UK (2007) by Dindayal Vidur."]}, {"page": "Cyril Blake", "response": ["Blake moved to England about 1918, where he played in a British group called the Southern Syncopated Orchestra. He worked in Paris and London as a musician throughout the 1920s, and in the 1930s played in the bands of Leon Abbey, Happy Blake, Rudolph Dunbar, Leslie Thompson, Joe Appleton, and Lauderic Caton. In 1938 he formed his own band, which was centred on Jig's Club in London; he recorded several times with this ensemble. In the 1940s Blake led his band behind Lord Kitchener for recordings on Parlophone Records, playing in a calypso style. Late in his life he returned to Trinidad, where he continued to lead bands. He died of an illness in 1951."]}, {"page": "Mary Lucas", "response": ["Lucas had a special affinity with the clarinet, and may have encouraged her niece Pauline Juler (1914-2003) to become a professional clarinetist. (Juler later became associated with the clarinet music of composers such as York Bowen, Gerald Finzi and Howard Ferguson).'Pauline Rosemary (Juler) Richards (1914-2003)', biography at WikiTree Her Clarinet Sonata was written for Juler in 1938.The Clarinet Sonata was revived by Peter Cigleris and Martin Cousin in Weymouth on 10 February 2019. Around this time she was also performing  duo recitals with the clarinet Rudolph Dunbar, and a recording of them playing her Lament for clarinet and piano was issued by Octacros Records in the late-1930s.Michael Thomas: Octaras A performance of the impressionistic Circus Suite for orchestra, conducted by Henry Wood at the Royal Albert Hall on 4 July 1942, gave Lucus her Proms debut at the age of sixty.BBC Proms ArchiveJacobs, Arthur. Henry J Wood, Maker of the Proms (1994), p. 369 "]}, {"page": "Dunbar (surname)", "response": ["* Rudolph Dunbar (1907–1988), Guyanese conductor, clarinetist and composer"]}, {"page": "Nabaclis", "response": ["The artist Emerson Samuels was born and brought up here, studying at the Golden Grove Methodist School.  Also born here was conductor Rudolph Dunbar.\"W. Rudolph Dunbar: Pioneering Orchestra Conductor\", The Black Perspective in Music, Vol. 9, No. 2 (Autumn 1981), pp. 193-225."]}, {"page": "Cynthia Pine", "response": ["She is one of a group of highly successful Guyanese people in Britain (Michael White of The Guardian refers to them as the \"Guyanese mafia\"), which includes Waheed Alli, Raj Persaud, Herman Ouseley and David Dabydeen, Keith Waithe and Rudolph Dunbar."]}, {"page": "Rita Lawrence", "response": ["She moved to London in 1934 and during the war she would play at bottle parties in Soho bars. She would have like to have been a concert pianist but she obtained work as a singer or a pianist where she was an unusual black performer. She danced with Adelaide Hall and Fats Waller. Her name was changed at the suggestion of Fela Sowande who included her in his Jubilee Singers. She then sang with Rudolph Dunbar's dance band and met Ivy Benson. She met the Cuban Don Marino Barreto (1907–1995) and he encouraged her career. He persuaded her that she should train again at the Guildhall School of Music and in return he would teach her Latin-American rhythm. She played piano in his band and they became a couple."]}, {"page": "Associated Negro Press", "response": ["* Rudolph Dunbar was an ANP correspondent in London."]}, {"page": "Fay M. Jackson", "response": ["In 1932, Fay M. Jackson directed publicity for the re-election campaign of white Senator Samuel M. Shortridge.\"To Direct Publicity\" Pittsburgh Courier (June 25, 1932): 1. via Newspapers.com In 1937, Jackson and Rudolph Dunbar were the only black reporters\"Fay Jackson Triumphs!\" Pittsburgh Courier (May 22, 1937): 8. via Newspapers.com admitted to Westminster Abbey to cover the coronation of George VI,Rebecca J. Scott, Jean M Hébrard, Freedom Papers: An Atlantic Odyssey in the Age of Emancipation (Harvard University Press 2012): 173-174.  Jackson as foreign correspondent for the Associated Negro Press (ANP).Penelope McMillan, \"Granddaughter Keeps Memory of Pioneering Black Journalist Vivid\" Los Angeles Times (September 5, 1988).Thomas Cripps, Making Movies Black: The Hollywood Message Movie from World War II to the Civil Rights Era (Oxford University Press 1993): 11.  In 1938, she founded the Cinema League of Colored Peoples, to shape the representation of racial minority characters and stories in Hollywood films.Chris Robé, Left of Hollywood: Cinema, Modernism, and the Emergence of U.S. Radical Film Culture (University of Texas Press 2011): 178-179.  She was also press agent for soprano Ruby Elzy in the 1930s.David E. Weaver, Black Diva of the Thirties: The Life of Ruby Elzy (University Press of Mississippi 2009). "]}, {"page": "Freddy Grant", "response": ["Grant was born in British Guiana.  He toured South America as a member of Vicente Gomez's band, before moving to Trinidad in 1933 where he joined the Trinidad Constabulary Band.  In 1937, he moved to England, and worked with several jazz and swing bands, including those led by Joe Appleton, Fela Sowande, Rudolph Dunbar, Johnny Claes, and Cyril Blake.  In 1942 he joined the Royal Air Force for two years, and on his discharge joined the bands led by Carlo Krahmer and Leslie \"Jiver\" Hutchinson. John Chilton, Who's Who of British Jazz: 2nd Edition, Bloomsbury, 2004, p.155"]}, {"page": "John Lucien Keith", "response": ["During the Second World War was the Colonial Office Welfare Officer responsible for the British Honduras Forestry Unit. When the Guyanese journalist Rudolph Dunbar wrote a critical article about the conditions the workers in this unit had to endure, Keith responded defending the conditions in their camps, which he had visited several times. Whilst he admitted the food had been of poor quality, he claimed that this had been remedied. Whilst Keith denied that there were no problems with the sanitary arrangements, Dunbar's account of their inadequacy had also been born out by Dr Patterson, the Medical Officer of the unit."]}, {"page": "Ike Hatch", "response": ["The duo split up in 1930, and Carpenter returned to the United States where he reputedly played the piano part mimed by Dooley Wilson in Casablanca.  Hatch established himself as a regular performer in London nightclubs, and starred with Florence Mills in the touring stage musical Blackbirds, with a band that included pianist Will Vodery and saxophonist Rudolph Dunbar.  He also contributed musical numbers to the popular and long-lasting BBC radio series The Kentucky Minstrels, starring comedians Scott and Whaley.Denis Gifford, The Golden Age of Radio, B.T. Batsford Ltd, London, 1985, , p.145  "]}]}}