{"wiki_id": "http://www.wikidata.org/entity/Q7373062", "itemLabel": "Roy Lancaster", "itemDescription": "British gardener and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Lancaster", "wikipedia_page": {"main": "Charles Roy Lancaster CBE (born 1937) is a British plantsman, gardener, author and broadcaster.", "link_mentions": [{"page": "Celebrity gardener", "response": ["* Roy Lancaster"]}, {"page": "Gardeners' World", "response": ["Alys Fowler, Chris Baines, Chris Beardshaw, Mary Spiller, Liz Rigby, Diarmuid Gavin, Clay Jones, Stefan Buczacki, Christine Walkden, Sarah Raven, Gay Search, Anne Swithinbank, Nigel Colborn, Geoffrey Smith, Roy Lancaster, Peter Seabrook, Joe Swift, Ali Ward, Pippa Greenwood, Rachel de Thame, Advolly Richmond, Frances Tophill, Carol Klein, Bob Flowerdew, Mark Lane, Adam Frost, Arit Anderson, John Kelly, Nick Bailey, Flo Headlam and Arthur Parkinson."]}, {"page": "Plantsman", "response": ["Notable modern British plantsmen include Roy Lancaster, the late Christopher Lloyd of Great Dixter (1921–2006) and the late Beth Chatto (1923–2018). American nurserymen and plant-collectors who qualify for the title include plant-breeder Dan Heims of Terra Nova Nurseries (who styles himself a \"hortiholic\"), Dan Hinkley, co-founder of Heronswood (now an independent author, lecturer and horticultural consultant), and Tony Avent, owner of the renowned Plant Delights Nursery."]}, {"page": "Sir Harold Hillier Gardens", "response": ["Run as a registered charity, the Gardens are continually developed to further Sir Harold’s philosophy of horticulture, conservation, education and recreation. The president of the trust is the Duchess of Cornwall and the  patrons are Lord Sainsbury and Roy Lancaster, who was the first curator. A team of 18 experienced horticulturalists and arborists look after the collection alongside students and a team of 200 volunteers.", "Sir Harold Hillier Gardens started a hypericum trial in 2014. This three year trial was in association with the Royal Horticultural Society and led by curator David Jewell. The aim of the trial was to establish garden worthiness, resolve any naming problems and assess their medicinal properties. The trial included approximately 65 different types of plants. The hypericum lancasteri, grown at the Gardens, is named in honour of patron Roy Lancaster. These trial grounds can be visited in the Gardens and are located behind Jermyn's House."]}, {"page": "Victoria Medal of Honour", "response": ["** Roy Lancaster (1937–)\"BBC Gardening: TV and Radio: Presenter biographies: J to L: Roy Lancaster\" BBC Gardening"]}, {"page": "Lancaster (surname)", "response": ["* Roy Lancaster, UK TV gardener, author and plant hunter"]}, {"page": "Ulmus 'Jacqueline Hillier'", "response": ["The cultivar was named for a daughter-in-law of Sir Harold Hillier by Roy Lancaster, when Curator of the Hillier Arboretum."]}, {"page": "The Garden (journal)", "response": ["Over its long history, most of Britain's most influential gardeners, garden writers and horticulturists have contributed articles to the publication, whether as The Journal of the Royal Horticultural Society or, later, The Garden. In recent years, Christopher Lloyd was a frequent contributor (until his death in January 2006), and the noted plantsman Roy Lancaster has a regular column. Hugh Johnson, the magazine's Editorial Consultant for many years, contributed a monthly column, Tradescant's Diary, from 1975 until December 2006."]}, {"page": "Beesia", "response": ["Beesia is a genus of flowering plants in the buttercup family. It was named in 1915 after the plant nursery firm Bees of Chester, who financed the plant hunting trips of George Forrest and Frank Kingdon-Ward in China.Roy Lancaster Travels in China: A Plantsman's Paradise "]}, {"page": "List of people from Bolton", "response": ["*Roy Lancaster (born 1938) – gardener and broadcaster, Gardeners' World, born in Farnworth"]}, {"page": "Veitch Memorial Medal", "response": ["* 1972 : Xenia Field (1894–1998),; Roy Lancaster (born 1938); Mrs T. Rochford; E. Smith (silver medal) "]}, {"page": "Hardy Plant Society", "response": ["The Hardy Plant Society is a British charityThe Hardy Plant Society is a Registered Charity No. 208080. that promotes the cultivation of hardy herbaceous plants.  The society was founded in 1957http://www.nhm.ac.uk/jdsml/research-curation/library/digital-library/nature-societies-online/index.dsml?body_name=Hardy+Plant+Society&body_id=409&action=view&baction=listbyalpha&alpha=h by a group of gardeners and nurserymen. It has approximately 7,500 members and provides information about familiar and less well known perennials, how to grow them and where they may be obtained. The society also works towards ensuring that garden-worthy perennial plants remain in cultivation and have the widest distribution.  Its president is Roy Lancaster.  "]}, {"page": "1999 New Year Honours", "response": ["*Charles Roy Lancaster. For services to Horticulture."]}, {"page": "National Trust Magazine", "response": ["*Roy Lancaster"]}, {"page": "Bluebell Arboretum", "response": ["Bluebell Arboretum is an arboretum and associated plant nursery near the village of Smisby in South Derbyshire, England. It is a Royal Horticultural Society recommended garden,http://apps.rhs.org.uk/rhsgardenfinder/gardenfinder3.asp?id=96&cboCounty=null&chkFree=on comprising a large selection of rare trees, shrubs and climbers growing in a woodland garden.  Planting was started by the owners, Suzette and Robert Vernon (a Royal Horticultural Society committee member and Chelsea Flower Show judge) in 1992 on what was then a six acre (2.2 hectare) meadow, just under 500 feet (150 metres) above sea level. The arboretum was officially opened by Roy Lancaster, OBE VMH in 1997, and has since been expanded and is now open to the public throughgout the year, excluding Sundays during the winter months.http://www.bluebellnursery.com/information/?page=The%20Gardens"]}, {"page": "Buddleja 'Pink Pagoda'", "response": ["Buddleja 'Pink Pagoda' (sold as  in the USA) is a sterile hybrid cultivar,Oregon Dept. of Agriculture. Sterile Buddleja List.  raised in 1998 by Peter Moore, Chief Propagator at the Longstock Park Nursery in Hampshire, England, and named by Roy Lancaster. The cultivar is the result of a crossing of Buddleja 'Pink Delight' with Buddleja × weyeriana 'Golden Glow'.Moore, P. (2012). Buddleja List 2011-2012 Longstock Park Nursery. Longstock Park, UK.  Plant breeders' rights were awarded in 2008. "]}, {"page": "List of botanists by author abbreviation (K–L)", "response": ["* Lancaster – Roy Lancaster (born 1937)"]}, {"page": "Caroline Donald", "response": ["Her book, The Generous Gardener: Private Paradises Shared is a compilation of 43 article or essays, primarily from The Sunday Times. Gardeners and their gardens covered include Jilly Cooper, Will Alsop, Henry Cecil, Corinne Bailey Rae, Jim Carter, Imelda Staunton, Christopher Gibbs, Natasha Spender, Penelope Hobhouse, Bob Flowerdew, Kelly Brook, and Roy Lancaster. It has been described as a \"a pick up and browse gem to lift the spirits and reinforce what we all know – that gardening is good for you!\""]}]}}