{"wiki_id": "http://www.wikidata.org/entity/Q7372109", "itemLabel": "Rowland Burdon", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rowland_Burdon_(died_1838)", "wikipedia_page": {"main": "Rowland Burdon (c. 1757 – 17 September 1838) was an English landowner and Tory politician from Castle Eden in County Durham.", "link_mentions": [{"page": "Sunderland", "response": ["By 1770 Sunderland had spread westwards along its High Street to join up with Bishopwearmouth. In 1796 Bishopwearmouth in turn gained a physical link with Monkwearmouth following the construction of a bridge, the Wearmouth Bridge, which was the world's second iron bridge (after the famous span at Ironbridge). It was built at the instigation of Rowland Burdon, the Member of Parliament (MP) for County Durham, and described by Nikolaus Pevsner as being 'a triumph of the new metallurgy and engineering ingenuity [...] of superb elegance'. Spanning the river in a single sweep of , it was over twice the length of the earlier bridge at Ironbridge but only three-quarters the weight. At the time of building, it was the biggest single-span bridge in the world; and because Sunderland had developed on a plateau above the river, it never suffered from the problem of interrupting the passage of high-masted vessels."]}, {"page": "John Soane", "response": ["It was then that Soane met Maria Hadfield (they became lifelong friends) and Thomas Banks. Soane was now fairly fluent in the Italian language, a sign of his growing confidence.Darley, 1999, p. 41 A party, including Thomas Bowdler, Rowland Burdon, John Patteson, John Stuart and Henry Grewold Lewis, decided to visit Sicily and paid for Soane to accompany them as a draughtsman.Darley, 1999, p. 43 The party headed for Naples on 11 April, where on 21 April they caught a Swedish ship to Palermo. Soane visited the Villa Palagonia, which made a deep impact on him.Darley, 1999, pp. 44–45 Influenced by the account of the Villa in his copy of Patrick Brydone's Tour through Sicily and Malta, Soane savoured the \"Prince of Palagonia's Monsters ... nothing more than the most extravagant caricatures in stone\", but more significantly seems to have been inspired by the Hall of Mirrors to introduce similar effects when he came to design the interiors of his own house in Lincoln's Inn Fields.Edward Chaney, The Evolution of the Grand Tour (London, 2000), pp. 32–36 Leaving Palermo from where the party split, Stuart and Bowdler going off together. The rest headed for Segesta, Trapani, Selinunte and Agrigento, exposing Soane to Ancient Greek architecture.Darley, 1999, p. 45 From Agrigento the party headed for Licata, where they sailed for Malta and Valletta returning on 2 June, to Syracuse, Sicily. Moving on to Catania and Palazzo Biscari then Mount Etna, Taormina, Messina and the Lepari Islands.Darley, 1999, pp. 47–48 They were back in Naples by 2 July where Soane purchased books and prints, visiting Sorrento before returning to Rome.Darley, 1999, p. 48 Shortly after, John Patterson returned to England via Vienna, from where he sent Soane the first six volumes of The Life and Opinions of Tristram Shandy, Gentleman, delivered by Antonio Salieri.Darley, 1999, p. 49", "In Rome Soane's circle now included Henry Tresham, Thomas Jones (artist) and Nathaniel Marchant. Soane continued to study the buildings of Rome, including the Basilica of St. John Lateran. Soane and Rowland Burdon set out in August for Lombardy. Their journey included visits to Ancona, Rimini, Bologna, Parma and its Accademia, Milan, Verona, Vicenza and its buildings by Andrea Palladio, Padua, the Brenta (river) with its villas by Palladio, Venice. Then back to Bologna where Soane copied designs for completing the west front of San Petronio Basilica including ones by Palladio, Giacomo Barozzi da Vignola and Baldassare Peruzzi. Then to Florence and the Accademia delle Arti del Disegno of which he was later, in January 1780 elected a member; then returned to Rome.Darley, 1999, p. 50", "Soane counted many members of the Royal Academy as friends, including J. M. W. Turner, with whom he spent the Christmas after his wife's death; Soane also owned three works by the artist. John Flaxman, professor of sculpture at the Royal Academy, was an old friend and Soane also acquired several plaster-casts of Flaxman's work for his museum.  Soane also counted Thomas Banks as a friend (and owned sculptures by him), and Thomas Lawrence, who painted Soane's portrait. Despite the professional falling-out with his old master, George Dance the Younger, they remained firm friends. After Dance's death Soane purchased his drawings. After the death of his other teacher, Henry Holland, Soane tried to buy his drawings and papers, but found they had been destroyed; he did however purchase some of his antique sculptures.Stroud, 1966, p. 152 Despite being professional rivals, Soane got on with fellow architect John Nash; they often dined together.Darley, 1999, p. 292 Soane called on William Thomas Beckford both in London and when he was taking the waters in Bath in 1829. Soane had other friends including James Perry, Thomas Leverton Donaldson, Barbara HoflandWaterfield, p. 45 and Rowland Burdon, whose friendship was formed while on the Grand Tour."]}, {"page": "Burdon (surname)", "response": ["* Rowland Burdon (died 1838) (1757–1838), English landowner and politician", "* Rowland Burdon (Sedgefield MP) (1857–1944), English landowner and politician"]}, {"page": "County Durham (UK Parliament constituency)", "response": ["| Rowland Burdon"]}, {"page": "Rowland Burdon (Sedgefield MP)", "response": ["Colonel Rowland Burdon, VD, DL, JP (19 June 1857 – 1 August 1944) was an English landowner and Conservative Party politician from County Durham. He sat in the House of Commons from 1918 to 1922.", "In October 1947 his daughter Mrs Sclater-Booth presented the Castle Eden Vase to the British Museum, in his memory.  The glass vase was a 6th-century Anglo-Saxon \"claw beaker\" which had been found by a labourer working on a hedge on the Castle Eden estate in about 1775, in the time of his great-grandfather Rowland Burdon MP."]}, {"page": "Rowland Burdon", "response": ["Rowland Burdon  may refer to:", "*Rowland Burdon (1857–1944), MP for Sedgefield", "*Rowland Burdon (died 1838) (c. 1757–1838), MP for County Durham"]}, {"page": "Wearmouth Bridge (1796)", "response": ["The bridge was instigated, sponsored and patented by Rowland Burdon, the Member of Parliament for County Durham, and built under the direction of Thomas Wilson, who designed its architectural features.Tyrrell, Henry Grattan : \"History of Bridge Engineering\", pp 153-154, 1911 "]}, {"page": "The Bishoprick Garland", "response": ["|72||short bio||Rowland Burdon M.P||||||||"]}, {"page": "List of Geordie songwriters", "response": ["|Writer of \"Sunderland Bridge\" which appears on page 285 of John Bell's Rhymes of Northern Bards and page 72 of (Sir) Cuthbert Sharpe's The Bishoprick Garland which also includes a brief bio. The song is not about the village of Sunderland Bridge, County Durham, but about Wearmouth Bridge, the iron bridge over the River Wear at Sunderland, and sponsored by the M.P. Rowland Burdon."]}, {"page": "List of Geordie characters, events and places", "response": ["* Rowland Burdon - The subject of a song/poem and also a Member of Parliament. The work \"Sunderland Bridge\" is written by \"M W of North Shields!. For more details see \"M. W\" in part 1"]}, {"page": "Rowland Burdon (d. 1838)", "response": ["#REDIRECT Rowland Burdon (died 1838)"]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Rowland Burdon"]}, {"page": "Militia and Volunteers of County Durham", "response": ["*Easington Ward Gentlemen and Yeomanry Cavalry (1798—1802), raised by Rowland Burdon"]}, {"page": "Hawks family", "response": ["At around the year 1842, the Hawks company erected a cast iron bridge at York, which spans the river Ouse in one arch of 172 feet in width. They company also reconstructed the Rowland Burdon iron bridge at Sunderland, which consists of a single arch of a width of 237 feet. The company also constructed the wrought iron gates for the Northumberland Docks; the iron lighthouses at Gunfleet, Harwich, and Calais; and the iron pier at Madras. The company also built bridges in Constantinople. Sir Robert Hawks financed the construction of St John's Church, Gateshead Fell. The company built the High Level Bridge over the Tyne, which consisted of 5050 tons of iron. George Hawks, the Mayor of Gateshead (see below), drove in the last key of the structure on 7 June 1849. The bridge was opened by Queen Victoria later that year. thumb|The carriageway level of the High Level Bridge"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Rowland Burdon"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Rowland Burdon"]}, {"page": "List of MPs elected in the 1790 British general election", "response": ["| Rowland Burdon"]}]}}