{"wiki_id": "http://www.wikidata.org/entity/Q7373471", "itemLabel": "Roy Walker", "itemDescription": "Northern Irish comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Walker_(comedian)", "wikipedia_page": {"main": "Robert \"Roy\" Walker (born 31 July 1940) is a Northern Irish television personality and comedian, who worked for many years as both a television presenter and comedy actor. He is best known as the original host of the game show Catchphrase between 1986 and 1999, and as one of the stars of the comedy showcase The Comedians.", "link_mentions": [{"page": "Belfast", "response": ["* Roy Walker (comedian), gameshow host, best known for  Catchphrase"]}, {"page": "List of comedians", "response": ["* Roy Walker (born 1940)"]}, {"page": "1940", "response": ["* July 31 – Roy Walker, Northern Irish comedian"]}, {"page": "1940 in television", "response": ["*July 31 - Roy Walker, television host"]}, {"page": "The Comedians (1971 TV series)", "response": ["Comedians appearing on the show included Russ Abbot (as Russ Roberts), Lennie Bennett, Stan Boardman, Jim Bowen, Jimmy Bright, Duggie Brown, Mike Burton, Dave Butler, Brian Carroll, Frank Carson, Johnnie Casson, Eddie Colinton, Mike Coyne, Jimmy Cricket, Colin Crompton, Bob Curtiss, Pauline Daniels, Charlie Daze, Les Dennis, Vince Earl, Steve Faye, Ray Fell, Eddie Flanagan, Stu Francis, Mike Goddard (known as Mike Goodwin in the early years of the show), Ken Goodwin, Jackie Hamilton, Jerry Harris, Jimmy Jones, Mike Kelly, George King, Bobby Knutt, Bernard Manning, Jimmy Marshall, Mike McCabe, Paul Melba, Mick Miller, Pat Mooney, Hal Nolan, Tom O'Connor, Tom Pepper, Bryn Phillips, Don Reid, Mike Reid, George Roper, Harry Scott, Paul Shane, Phil Silvers, Pat Tansey, Sammy Thomas, Johnny Wager, Roy Walker, Jos White, Charlie Williams, Lee Wilson and Lenny Windsor."]}, {"page": "Peterlee", "response": ["*Roy Walker (born 1940), comedian and television presenter"]}, {"page": "Phoenix Nights", "response": ["It is the opening day of Brian Potter's new club, the Phoenix (two of his previous clubs having burned down while another flooded). With \"TV's own Roy Walker\" opening the club, Brian wants everything to be perfect. But he has to contend with a power cut that leaves the club in the dark, the theft of the bingo machine, a German-speaking \"Das Boot\" arcade machine, Max the doorman injuring himself and a racist folk band called \"Half A Shilling\" (with the lead singer played by Tim Healy). The band are ostensibly singing about Holy Communion Shoes, although journalist Deborah Quinn detects the racist metaphor in the song entitled \"Send The Buggers Back\". These factors soon ruin everything. The auditioning act at the end of the episode is a pair of spacemen, one on a spinning disc, miming to a David Bowie song."]}, {"page": "Lionel Blair", "response": ["In 1988, Blair made an appearance in aid of charity on the British television game show Catchphrase, hosted by Irish comedian Roy Walker. Other celebrities also appeared alongside Blair, including radio DJ Chris Tarrant."]}, {"page": "I'm Famous and Frightened!", "response": ["| Roy Walker"]}, {"page": "I'm Gonna Be (500 Miles)", "response": ["Kay also directed a video clip of the song featuring himself as Brian Potter, Lucas as Andy, David Walliams as Lou, The Proclaimers and an audience of celebrity guests, comprising Johnny Ball, David Beckham, David Bellamy, Dusty Bin, Tony Blackburn, Stan Boardman, Basil Brush, Bob the Builder, Holly Willoughby, Bucks Fizz, Cannon and Ball, Bob Carolgees & Spit the Dog, Jasper Carrott, Keith Chegwin, Jimmy Cricket, Tess Daly, Bobby Davro (referred to in the lyrics), Carol Decker, Sally Dynevor, Lesley Garrett, Andy Gray, Clare Grogan, Paul Henry, Frazer Hines, Siobhan Redmond (credited as \"Her off Holby City\"), Elton John, The Krankies, Burt Kwouk, Bonnie Langford, Eddie Large, Michael Le Vell, Limahl, Kenny Lynch, Des Lynam, Timmy Mallett, Jennie McAlpine, Bill Oddie, Paul O'Grady, Postman Pat, Wendi Peters, Robert Powell, Rod, Jane and Freddy, Rupert the Bear, Showaddywaddy, Status Quo, Frank Sidebottom, Sonia, Dennis Taylor, David Tennant, Willie Thorne, Kate Thornton, Dave Lee Travis, Owen Newton, Martin Tyler, Roy Walker, Louis Walsh, Pete Waterman, Elton Welsby, June Whitfield, Gary Wilmot, and Bob Wilson. "]}, {"page": "UK national selection for the Eurovision Song Contest", "response": ["| Roy Walker"]}, {"page": "The Chris Moyles Show", "response": ["*Car Park Catchphrase - two listeners in their cars have to guess a catchphrase answer from an anecdote-style clue. The first to beep their car horn gets a chance to give their answer but a wrong answer will get them frozen out and leave their opponent to guess while more of the clue is revealed. The feature is 'hosted' by voice samples of the Northern Irish comedian and original Catchphrase presenter, Roy Walker. Simple and reasonably-obvious catchphrases are chosen and the anecdotal clue often involves the fictional character Mr Fish, a reference to Mr Chips from the original game show. The game is played as a best-of-3 knockout and the prize is the chance to compete again when the feature returns (though this was usually ignored if the contestants were entertaining enough, usually with Moyles wiping points off), usually in the next show. Car Park Catchphrase was played with for the last and final time between Andi Peters and Alan Carr with Peters becoming champion on Wednesday 12 September 2012.", "*Roy Walker - host of Car Park Catchphrase (2004-2012)"]}, {"page": "Ted Robbins", "response": ["He has performed as a warm-up artist for numerous pre-recorded comedy shows that have been filmed before live studio audiences including Granada Television's Wood and Walters and Birds of a Feather, provided the voiceover in Catchphrase from 1994 to 1996 and returned in Roy Walker's penultimate series in 1998 and 1999, and the BBC's Little Britain. He also starred in Peter Kay's Phoenix Nights (2001–02) for both series as Den Perry, the main \"villain\", and also the Governor in The Slammer. His most recent roles were in Benidorm in 2012 as Victor St. James as well as Hank Zipzer in episode 8 playing Bob and Diddy TV playing Larry Weinsteinberger/Bingbongberger."]}, {"page": "Catchphrase (British game show)", "response": ["Catchphrase was presented by Northern Irish comedian Roy Walker from its 1986 premiere until 1999, airing weekly at night. Nick Weir took the programme over in 2000 and hosted it until the end of series 16 on 23 April 2004. Mark Curry replaced Weir for the final series, which moved to a daytime slot and ran from 24 June to 19 December 2002.", "In the original series, two contestants, one male and one female, standing in blue lectern and red lectern, (in the Roy Walker era), and the purple lectern and orange lectern (in the Nick Weir/Mark Curry era) would have to identify the familiar phrase represented by a piece of animation accompanied by background music. The show's mascot, a golden robot called \"Mr. Chips\", appears in many of the animations. In the revived version of the show, the same format remains, but there are three contestants and there is no particular attention paid to gender.", "From series 2, (the Roy Walker era) a new feature which was not seen in the US version, the \"Ready Money Round\", was introduced. This round followed a similar structure to a standard round, except that all catchphrases were worth a fixed amount of money (originally £50) and there was no bell, so the contestants could buzz in and answer them whenever they wished and as many times until the puzzle is solved or time runs out. In the TVS series from 1986 to 1994, this round was played only after the second normal round, subsequent rounds being played as standard with the bell and money randomiser. In the Carlton series from 1994 to 1999, however, all of the rounds in part two (up until the end of round klaxon) were ready money rounds. The amount for a normal catchphrase in the first Ready Money round increased to £100 for series 11 and £125 for series 12–13. From series 11–13, each catchphrase would be worth £150 in the second Ready Money round. If the end of round klaxon sounds and the bonus catchphrase had yet to be solved, the panels would be gradually removed until a player buzzed in with an answer. If neither player guessed correctly, a normal catchphrase would determine who won the bonus bank money.", "In the Super Catchphrase, the winning contestant faced a 5 x 5 board of 25 squares, each marked with a letter from A to Y in ascending order. The contestant chose a square and attempted to solve a catchphrase behind it. During the Roy Walker era, the aim was to get five squares in 60 seconds.", "In homage to the show, a popular radio parody of Catchphrase, entitled Car Park Catchphrase was broadcast on The Chris Moyles Show on BBC Radio 1 from January 2004 until December 2005. It returned to the airwaves on 8 January 2007. It was taken off the air again because of the phone-in competitions being suspended but later returned. The format in comparison to the TV show slightly changed and required callers to play from their cars and 'honk' their horns when they knew the catchphrase being described. Roy Walker himself records voice samples for the game.", "One of the most famous moments in the show's history included a ready money bonus catchphrase where the answer to the puzzle was \"Snake charmer\". However, the puzzle was uncovered in such a way which caused the audience, the contestants and host Roy Walker to laugh uncontrollably as the game went on as it appeared Mr. Chips and the snake were doing something sexual. Originally broadcast on 30 December 1994 as the ninth episode of series ten (production episode was listed as the fifth episode), digital channel Challenge sometimes broadcasts this episode (albeit with modified animation), and it has appeared on many \"out-take\" or \"blooper\" shows, such as It'll Be Alright on the Night (the episode titled Alright on the Night's Cockup Trip, first aired on 12 October 1996).", "The first DVD game was released in October 2005, and in November 2007, Walker returned to host an all-new interactive DVD game, complete with original theme music and Mr. Chips. Roy Walker also voiced the interactive play along version of Catchphrase on WedigTV."]}, {"page": "Nick Weir", "response": ["In 2000, Weir replaced Roy Walker as the host of the TV game show Catchphrase. During his first series, he broke his foot during a recording of the show by falling down the stairs as he made his entrance to the studio floor. The incident was edited out but was shown in a later show to explain why he was in a cast and on crutches. He continued to present his first series of Catchphrase while his foot healed, wearing a cast throughout many episodes of the show. Despite his unpopularity with viewers at the time, he succeeded in the mission of markedly improving the ratings of Series 14 and 15 in comparison to Walker's last series."]}, {"page": "United Kingdom in the Eurovision Song Contest 2006", "response": ["* Northern IrelandRoy Walker"]}, {"page": "Steal (game show)", "response": ["Steal is a British game show that aired on ITV from 17 February to 12 May 1990. It is hosted by Mark Walker, son of Catchphrase presenter Roy Walker, with Stephen Rhodes as the voiceover."]}, {"page": "The All Star Talent Show", "response": ["| Roy Walker || Operatic singing || 1st", "The two guest judges on this episode were Lucy Benjamin and Christopher Biggins. The winner of this heat was Roy Walker.", "| Roy Walker || Operatic singing || 2nd"]}, {"page": "Mariann Hendley", "response": ["#REDIRECT Roy Walker (comedian)"]}, {"page": "List of contestants from the UK national selection for the Eurovision Song Contest", "response": ["| Roy Walker"]}, {"page": "Roy Walker", "response": ["Roy Walker may refer to:", "* Roy Walker (baseball) (1893–1962), Major League Baseball pitcher", "* Roy Walker (production designer), film production designer", "* Roy Walker (comedian) (born 1940), television personality and comedian from Northern Ireland", "* Roy Walker (footballer) (born 1957), football manager and former player", "* \"Roy Walker\", a song by Belle & Sebastian from the album Dear Catastrophe Waitress"]}, {"page": "Just a Minute", "response": ["*Roy Walker"]}, {"page": "1999 in British television", "response": ["**Roy Walker presents his final episode of Catchphrase."]}, {"page": "1940 in British television", "response": ["* 31 July – Roy Walker, Northern Irish comedian"]}, {"page": "Wipeout (British game show)", "response": ["| 29 December 1998 || Roy Walker, Ruth Madoc and Gary Wilmot"]}, {"page": "It's Only TV...but I Like It", "response": ["| 4x07 || 9 August 2002 || Roy Walker and Katy Hill || Diarmuid Gavin and Nicholas R. Bailey || TBC"]}, {"page": "Family Catchphrase", "response": ["A one-off edition of Family Catchphrase was made by TVS in 1992 & broadcast on ITV on 1 January 1994, hosted by regular Catchphrase presenter Roy Walker, in which teams of family would play Catchphrase. In early 1994, The Family Channel (now Challenge) produced a spin-off series of Family Catchphrase, hosted by Andrew O'Connor. The game was played by teams of two related players (normally parent and child) and featured slightly different rules to the normal game. The teams played for points rather than pounds and the second round would feature the players taking alternative turns, rather than answering the phrases as a team.", "Based on Roy Walker's Ready Money Round, O'Connor's version was renamed \"Fast and Furious\" because there was no money involved. Unlike Walker's round, the randomiser could select any amount on the screen from 110 to 150 points. There was no bell for this round."]}, {"page": "List of programmes broadcast by Challenge", "response": ["|A celebration of classic British gameshows. Presented by Roy Walker.", "|Roy Walker's Gameshow Moments || 2009 || 2009–2012 || Series of clips from gameshows, past and present. Later shown under the title Roy Walker's Guide to Gameshows.", "| Roy Walker's TV Bloomers || 2009 || 2009–2012 || The Catchphrase host's take on the Auntie's Bloomers format."]}, {"page": "Roy Walker (television personality)", "response": ["#REDIRECT Roy Walker (comedian)"]}, {"page": "Roy Walker (TV personality)", "response": ["#REDIRECT Roy Walker (comedian)"]}, {"page": "July 1940", "response": ["*Born: Roy Walker, television personality and comedian, in Belfast, Northern Ireland"]}, {"page": "Pick Me!", "response": ["Pick Me! is a British game show that aired on ITV from 19 October to 20 November 2015 and is hosted by Stephen Mulhern and voiced by Roy Walker, both of whom have presented Catchphrase."]}, {"page": "The Real Marigold Hotel", "response": ["|Miriam Margolyes, Sylvester McCoy, Wayne Sleep, Roy Walker, Rosemary Shrager, Bobby George, Patti Boulaye, Jan Leeming"]}, {"page": "Timeline of TVS", "response": ["** 12 January – The first edition of the long-running game show Catchphrase is aired, hosted by Roy Walker. "]}]}}