{"wiki_id": "http://www.wikidata.org/entity/Q7380333", "itemLabel": "Rupert Murray", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Rupert_Murray", "wikipedia_page": {"main": "Rupert Murray (born 28 May 1969) is a film director working in London. Murray began by making television documentaries for Channel Four's Cutting Edge series including Playing For England and Seconds To Impact (cameraman and editor), and short films Outsiders and This Was My War, co-directed with Beadie Finzi.\nIn 2005 he directed British documentary film Unknown White Male, the story of an Englishman Doug Bruce living in New York who experienced retrograde amnesia. The film premiered at Sundance and was nominated for a Grierson award, a British Independent Film Award and a Directors Guild of America award.\nThe film was greeted with some scepticism from film critics in the USA on release, several of whom believed it was an elaborate hoax. The filmmakers have consistently rejected this allegation. Influential film critic Roger Ebert of the Chicago Sun-Times said that he was \"convinced of its truthfulness\".In 2007 he directed Wild Art: Olly and Suzi for BBC Storyville.Murray also directed The End of The Line, a documentary about the effects of overfishing. The film was shown at Sundance 2009 and has resulted in major retailers changing their fish sourcing policy,.He also worked on a film about climate change deniers for the BBC.", "link_mentions": [{"page": "Albert II, Prince of Monaco", "response": ["In June 2009, Prince Albert co-authored an op-ed published in The Wall Street Journal with Charles Clover, the author of The End of the Line, a book about overfishing and ocean conservation issues that had recently been made into a documentary by Rupert Murray. In the piece, Prince Albert and Clover note that bluefin tuna have been severely overfished in the Mediterranean, and decry the common European Union practice of awarding inflated quotas to bluefin fleets.Clover, Charles; Grimaldi, Albert (5 June 2009). It's Not Too Late to Save the Tuna, The Wall Street Journal. Albert also announced that Monaco would seek to award endangered species status to the Mediterranean bluefin, Thunnus thynnus, (also called the Northern bluefin) under the Convention on International Trade in Endangered Species (CITES). This was the first time a nation had called for the inclusion of Mediterranean bluefin under CITES since Sweden at the 1992 CITES Conference, which was vehemently opposed by Japan who eventually threatened retaliation through trade barriers. Sweden withdrew its proposal."]}, {"page": "Murray (surname)", "response": ["*Rupert Murray (born 1969), film director"]}, {"page": "Almadraba", "response": ["* Rupert Murray's The End of the Line (2009 film) demonstrates almadraba when discussing declining catches."]}, {"page": "Unknown White Male", "response": ["Unknown White Male is a 2005 documentary film directed by Rupert Murray, covering the life of his childhood friend Doug Bruce, a British resident of New York who appeared to suffer from sudden amnesia, who woke up on a subway train in Coney Island in 2003, not knowing who or where he was.", "The film makers address the hoax theory with a six-minute-long DVD feature titled, \"Questions With The Director & Producer.\"    It opens with a written message responding to the allegations of a hoax with: \"We, the film makers, Douglas, his friends and family categorically deny this claim.\"  Director Rupert Murray states that he finds it shocking when people believe the film to be fake, because it raises the question \"Is my life a fake?\"  Of Bruce, he admits, \"He coincidentally happened to film himself [thus providing footage used in the documentary], which people find strange.\"  Producer Beadie Finzi explains her belief in Bruce's amnesia with, \"The bottom line is that anyone and everyone who has ever known Douglas, [his] friends and family, is completely convinced that this traumatic event did indeed happen to him.  And indeed, every physician that has treated him is also convinced that this has happened to him.\""]}, {"page": "58th Directors Guild of America Awards", "response": ["* Rupert Murray – Unknown White Male"]}, {"page": "Doug Bruce", "response": ["Doug Bruce (born 1967) is an English-American photographer.  He is the subject of Rupert Murray's 2005 documentary film Unknown White Male.", "According to filmmaker Rupert Murray, his documentary Unknown White Male is a uniquely filmed exploration into the phenomenon of amnesia from the perspective of an amnesiac, and it includes video film footage which Bruce filmed himself beginning within a week of the start of his amnesia."]}, {"page": "Christopher Monckton, 3rd Viscount Monckton of Brenchley", "response": ["Monckton is a director of Resurrexi Pharmaceutical. It asserts it is  \"responsible for invention and development of a broad-spectrum cure for infectious diseases.\" In the BBC documentary, \"Meet the Sceptics\" (2011), he claimed to have cured himself of Graves' disease.Rupert Murray \"Meet the Climate Sceptics\", Storyville, 3 February 2011. UKIP's CV for Monckton claims that his methods have produced cures for multiple sclerosis, influenza, and herpes, as well as reducing the viral load of an HIV patient. In an interview with Australia's Radio National, Monckton said that his methods had had some initial successes but \"we cannot claim that we can cure anything\".", "Between 2009 and 2010 the film maker Rupert Murray followed Monckton on his climate change tour. The film was later broadcast on 31 January 2011 on BBC Four titled Meet the Sceptics. Prior to its broadcast its depiction of Monckton was described by fellow denialist James Delingpole as \"another hatchet job\" and Monckton's attempt to gain an injunction failed."]}, {"page": "The End of the Line (book)", "response": ["The film was directed by Rupert Murray, executive produced by Christopher Hird and Chris Gorell Barnes produced by George Duffield and Claire Lewis, and narrated by Ted Danson. A French version was narrated by actress Mélanie Laurent and was released in June 2012 by LUG Cinéma."]}, {"page": "Directors Guild of America Award for Outstanding Directing – Documentaries", "response": ["|Rupert Murray || Unknown White Male"]}, {"page": "2009 Bergen International Film Festival", "response": ["* End of the Line, directed by Rupert Murray  "]}, {"page": "Doc Society", "response": ["Documentary titles the Foundation has supported include The Bengali Detectivehttp://thebengalidetective.com/ The Bengali Detective  by Phillip Cox, Hell and Back Again by Danfung Dennis, Self Made by Gillian Wearing, The Yes Men Fix the World by Mike Bonanno, Andy Bichlbaum & Kurt Engfehr, Erasing David by filmmaker David Bond (d.) Ashley Jones (p.), Sounds Like Teen Spirit: a Popumentary by Jamie Jay Johnson, Moving to Mars by Mat Whitecross (d.) and Karen Katz (p.), The End of the Line by Rupert Murray, The Solitary life of Cranes by Eva Weber, Afghan Star by Havana Marking, We Are Together Paul Taylor (d.) and Teddy Leifer (p.) and Here's Johnny by Adam Lavis, Kat Mansoor and Will Hood."]}, {"page": "Mattanza", "response": ["* Rupert Murray's The End of the Line (2009 film) demonstrates almadraba when discussing declining catches"]}, {"page": "British Independent Film Award for Best Documentary", "response": ["| Rupert Murray", "| Rupert Murray, George Duffield, Claire Lewis"]}]}}