{"wiki_id": "http://www.wikidata.org/entity/Q738532", "itemLabel": "William Playfair", "itemDescription": "British mathematician, engineer and political economist (1759-1823)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Playfair", "wikipedia_page": {"main": "William Playfair (22 September 1759 – 11 February 1823), a Scottish engineer and political economist, served as a secret agent on behalf of Great Britain during its war with France. The founder of graphical methods of statistics, Playfair invented several types of diagrams: in 1786 the line, area and bar chart of economic data, and in 1801 the pie chart and circle graph, used to show part-whole relations. As secret agent, Playfair reported on the French Revolution and organized a clandestine counterfeiting operation in 1793 to collapse the French currency.", "link_mentions": [{"page": "Victorian era", "response": ["In the field of statistics, the nineteenth century saw significant innovations in data visualisation. William Playfair, who created charts of all sorts, justified it thus, \"a man who has carefully investigated a printed table, finds, when done, that he has only a very faint and partial idea of what he has read; and that like a figure imprinted on sand, is soon totally erased and defaced.\" For example, in a chart showing the relationship between population and government revenue of some European nations, he used the areas of circles to represent the geographical sizes of those nations. In the same graph he used the slopes of lines to indicate the tax burden of a given population. While serving as nurse during the Crimean War, Florence Nightingale drew the first pie charts representing the monthly fatality rates of the conflict, distinguishing deaths due to battle wounds (innermost section), those due to infectious disease (outer section), and to other causes (middle section). (See figure.) Her charts clearly showed that most deaths resulted from disease, which led the general public to demand improved sanitation at field hospitals. Although bar charts representing frequencies were first used by the Frenchman A. M. Guerry in 1833, it was the statistician Karl Pearson who gave them the name histograms. Pearson used them in an 1895 article mathematically analyzing biological evolution. One such histogram showed that buttercups with large numbers of petals were rarer."]}, {"page": "Information visualization", "response": ["In 1786, William Playfair published the first presentation graphics."]}, {"page": "Scottish Enlightenment", "response": ["* William Playfair (1759–1823) engineer, political economist, founder of graphical methods of statistics"]}, {"page": "Florence Nightingale", "response": ["Florence Nightingale exhibited a gift for mathematics from an early age and excelled in the subject under the tutelage of her father. Later, Nightingale became a pioneer in the visual presentation of information and statistical graphics. She used methods such as the pie chart, which had first been developed by William Playfair in 1801. While taken for granted now, it was at the time a relatively novel method of presenting data. (alternative pagination depending on country of sale: 98–107, bibliography on p. 114) online article – see documents link at left "]}, {"page": "Chart", "response": ["* A bar chart is a chart with rectangular bars with lengths proportional to the values that they represent. The bars can be plotted vertically or horizontally. The first known bar charts are usually attributed to Nicole Oresme, Joseph Priestley, and William Playfair.", "* A pie chart shows percentage values as a slice of a pie; first introduced by William Playfair.", "* A line chart is a two-dimensional scatterplot of ordered observations where the observations are connected following their order. The first known line charts are usually credited to Francis Hauksbee, Nicolaus Samuel Cruquius, Johann Heinrich Lambert and William Playfair."]}, {"page": "John Playfair", "response": ["Playfair's brothers were architect James Playfair, solicitor Robert Playfair and engineer William Playfair. His nephew, William Henry Playfair (1790–1857) was an eminent architect in Scotland."]}, {"page": "Information design", "response": ["* William Playfair's line, bar, pie, and area charts illustrating England's trade (1786 and 1801)"]}, {"page": "1801 in science", "response": ["* William Playfair produces the first pie chart and circle graph, to show part-whole relations."]}, {"page": "1786 in science", "response": ["* William Playfair produces the first line and bar charts."]}, {"page": "List of amateur mathematicians", "response": ["*William Playfair (draftsman)"]}]}}