{"wiki_id": "http://www.wikidata.org/entity/Q7381346", "itemLabel": "Russell Bartlett", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Russell_Bartlett", "wikipedia_page": {"main": "Russell Bartlett is a businessman and property investor and the former chairman and majority shareholder of Hull City football club.He purchased Hull City from Adam Pearson in June 2007 as part of a consortium with Paul Duffen and (reportedly at the time) Martin Walker. They had made unsuccessful attempts to take over West Ham United and Cardiff City. Bartlett and Walker jointly own the Fortis property company. Duffen later stated, however, that Walker is not a shareholder in Hull City.On 29 October 2009, with the club reportedly in financial difficulty, Duffen left his position at Hull City following disagreements with Bartlett over the direction of the club. Bartlett re-appointed Adam Pearson as Chairman on 2 November, with one of his objectives being to attract outside investment - Bartlett is reportedly willing to sell up to 20% of his stake in the club.Following Hull City's relegation from the Premier League in May 2010, a boardroom reshuffle took place at the club, seeing Adam Pearson step down as club chairman, a position which Bartlett himself then took up.On 10 November 2010, it was reported that the owner of East Yorkshire-based Allam Marine, Assam Allam along with his son Ehab Allam had agreed to purchase a controlling interest in Hull City from Russell Bartlett. It was announced that Bartlett would remain involved in the club, although no information regarding his position as chairman was released.On 17 December 2010, following a protracted period of due diligence, it was confirmed that Bartlett had sold his entire shareholding in Hull City to the Allam family for the nominal fee of £1, severing all links with the club and its liabilities. He was succeeded as chairman by Assem Allam.", "link_mentions": [{"page": "Hull City A.F.C.", "response": ["In the club's annual report for the 12-month period up to 31 July 2009, auditors Deloitte stated that £4.4 million had gone out of the club and stadium company to owner Russell Bartlett's holding companies in loans, while at least £2.9 million of it was used in the take-over itself of the club. A further £560,000 was paid, according to the audit, by the stadium company to Bartlett's holding companies in \"management fees,\" while at least £1 million was owed to him personally as a \"salary\". After the warning from\tDeloitte, Bartlett gave the club a £4 million loan, \"which\tbrought\tthe money he had taken out and put in since taking over to about even.\""]}, {"page": "Adam Pearson (sports executive)", "response": ["Pearson was also Head of the Stadium Management Company, which operates the KCOM Stadium, the home of Hull City and rugby league side Hull F.C. But on 11 June 2007 at 12:00 midday, it was announced at a press conference broadcast live on BBC Radio Humberside that Pearson had sold the club and the SMC to a consortium consisting of Paul Duffen, Russell Bartlett and Martin Walker. It was confirmed that Paul Duffen would take over as Chairman, but Pearson would remain on the board of directors to provide continuity. However, on 31 July 2007 he resigned from the board, thus severing all ties with the club.", "Following Hull City's relegation from the Premier League in May 2010, amid widespread speculation regarding the financial viability of the club, there was once again restructuring in the boardroom, with Adam Pearson stepping down from the role of Chairman to become Head of Football Operations, being succeeded as chairman by vice-chairman and club owner Russell Bartlett."]}, {"page": "Paul Duffen", "response": ["In June 2007, Duffen, in a consortium with majority shareholder Russell Bartlett, purchased Hull City from Adam Pearson for a reported £13 million in June 2007 and replaced him as chairman and chief executive of the football club and the related Stadium Management Company Ltd.David Conn, \"The rise of a club beyond its history and dreams\", \"The Guardian\", 19 November 2008\"The rise of a club beyond its history and dreams\", \"BBC Sport\", 11 June 2007 The consortium had already made unsuccessful attempts to take over West Ham United and Cardiff City.\"A Look At Paul Duffen\", \"Vital Football\", 16 June 2007"]}, {"page": "Martin Walker (football director)", "response": ["He joined Hull City in June 2007 as part of a consortium with Paul Duffen and Russell Bartlett. They had made unsuccessful attempts to take over West Ham United and Cardiff City."]}, {"page": "2010–11 Football League Championship", "response": ["|Russell Bartlett"]}, {"page": "2010–11 Hull City A.F.C. season", "response": ["After weeks of speculation about a local business man looking to be interested in investing in Hull City, it was confirmed on 18 October 2010 that Assem Allam, along with his son Ehab had entered negotiations with Hull City owner and chairman, Russell Bartlett. Allam confirmed at the time that he felt the need to pay back to the area, and that Hull City were important to the area.", "Whilst it was originally reported that Allam intended to only purchase a majority shareholding in the club, and would continue to work with Russell Bartlett, a protracted period of due diligence indicated that the investment required would be substantially higher than originally planned; this resulted in a move to completely seize control of the club. The deal was formally completed at 10.45 pm on 16 December 2010, with the club exchanging hands for the nominal fee of £1, but with Allam, and his son, Ehab committing to invest £30 million, as well as providing assurances for a further £10 million."]}, {"page": "Assem Allam", "response": ["In September 2010, there was speculation that Allam was interested in investing in Hull City, the local football team, which had been relegated from the Premier League earlier in 2010 with extensive financial problems. On 18 October 2010 it was said that Allam, along with his son Ehab Allam, had entered negotiations with Hull City owner and chairman, Russell Bartlett. Allam confirmed at the time that he felt the need to \"pay back to the area,\" and that Hull City were important to the area."]}]}}