{"wiki_id": "http://www.wikidata.org/entity/Q7383032", "itemLabel": "Ruth Harrison", "itemDescription": "British activist (1920-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Harrison", "wikipedia_page": {"main": "Ruth Harrison  (née Winsten; 24 June 1920 – 13 June 2000) was an English animal welfare activist and writer.", "link_mentions": [{"page": "Peter Singer", "response": ["One day at Balliol College in Oxford, he had what he refers to as \"probably the decisive formative experience of my life\". He was having a discussion after class with fellow graduate student Richard Keshen, a Canadian (who would later become a professor at Cape Breton University), over lunch. Keshen opted to have a salad after being told that the spaghetti sauce contained meat. Singer had the spaghetti. Singer eventually questioned Keshen about his reason for avoiding meat. Keshen explained his ethical objections. Singer would later state, \"I'd never met a vegetarian who gave such a straightforward answer that I could understand and relate to.\" Keshen later introduced Singer to his vegetarian friends. Singer was able to find one book in which he could read up on the issue (Animal Machines by Ruth Harrison) and \"within a week or two\" he approached his wife, saying that he thought they needed to make a change to their diet, and that he did not think they could justify eating meat.Finding Ruth Harrison's book Animal Machines at 23m36s.Note: In this version of the story, Singer writes of the conversion process of himself and his wife happening \"Over the next two months\"."]}, {"page": "Animal welfare", "response": ["Significant progress in animal welfare did not take place until the late 20th century.Phillips 2009. p 56. In 1965, the UK government commissioned an investigation—led by Professor Roger Brambell—into the welfare of intensively farmed animals, partly in response to concerns raised in Ruth Harrison's 1964 book, Animal Machines. On the basis of Professor Brambell's report, the UK government set up the Farm Animal Welfare Advisory Committee in 1967, which became the Farm Animal Welfare Council in 1979. The committee's first guidelines recommended that animals require the freedoms to \"stand up, lie down, turn around, groom themselves and stretch their limbs.\" The guidelines have since been elaborated upon to become known as the Five Freedoms."]}, {"page": "Animal Liberation (book)", "response": ["In an essay entitled \"Animal Liberation: A Personal View\", Singer describes the personal background that led to his adoption of the views he sets out in Animal Liberation. He writes of how he arrived in Oxford in October 1969, and in 1970 had lunch with a fellow graduate student, Richard Keshen, who avoided meat. This led Singer to inquire as to why. Singer then read Ruth Harrison's book, Animal Machines, as well as a paper by Roslind Godlovitch (who would later co-edit Animals, Men and Morals), which convinced him to become a vegetarian and to take animal suffering seriously as a philosophical issue."]}, {"page": "Richard D. Ryder", "response": ["Ryder first became involved with animal rights in 1969, when he protested against an otter hunt in Dorset.Ryder, Richard D. (2011). Speciesism, Painism and Happiness: A Morality for the 21st Century. Imprint Academic, pp. 38ff, 152–153. He was working at the time in the Warneford psychiatric hospital, and in April and May that year had three letters to the editor published in The Daily Telegraph, the first one headed \"Rights of Non Human Animals,\" in which he criticised experiments on animals based on his own experiences in universities as an animal researcher. There was an increase in interest in animal rights during this period, following the publication of Ruth Harrison's Animal Machines (1964), a critique of factory farming, and a long article, \"The Rights of Animals\" (10 October 1965), by the novelist Brigid Brophy in The Sunday Times.Garner, Robert (2004). Animals, Politics and Morality. Manchester University Press, p. 3ff."]}, {"page": "Friends' Ambulance Unit", "response": ["*Ruth Harrison (1920–2000), animal welfare campaigner (ODNB entry)"]}, {"page": "Stephen Winsten", "response": ["He married the artist Clara Birnberg (1894–1989); they both became Quakers. She as Clare Winsten is known for some sculptures, including one of St. Joan in the garden of Shaw’s house in Ayot St Lawrence in Hertfordshire, where Shaw and the Winstens were neighbours.  Stephen's and Clara's daughter Ruth Harrison, a conscientious objector in WW2, was known as a campaigner for animal rights."]}, {"page": "Clara Birnberg", "response": ["Their daughter Ruth Harrison was known as a campaigner for animal welfare.  Ruth married Dexter Harrison, a London architect."]}]}}