{"wiki_id": "http://www.wikidata.org/entity/Q7380283", "itemLabel": "Rupert Evans", "itemDescription": "English cricketer (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rupert_Evans_(cricketer)", "wikipedia_page": {"main": "Rupert Arnold Evans (born 24 February 1954) is a Jamaican born former English cricketer.  Evans was a right-handed batsman who bowled right-arm off break.  He was born in Kingston, Jamaica.\nEvans made his debut for Oxfordshire in the 1973 Minor Counties Championship against Cornwall.  Evans played Minor counties cricket for Oxfordshire from 1973 to 1996, which included 155 Minor Counties Championship matches and 26 MCCA Knockout Trophy matches.  He made his List A debut against Warwickshire in the 1983 NatWest Trophy.  He played 9 further List A matches for Oxfordshire, the last coming against Lancashire in 1996 NatWest Trophy.  In his 10 List A matches for Oxfordshire, he took 9 wickets at a bowling average of 43.77, with best figures of 3/46.Playing for Oxfordshire allowed him to represent the Minor Counties cricket team.  He played a single first-class match for the team in 1990 against the touring Indians.  He took 2 wickets in the match, those of Ravi Shastri and Kapil Dev.  He also played List A cricket for the Minor Counties, first appearing for them in limited-overs cricket against Northamptonshire in the 1988 Benson & Hedges Cup.  He played 17 further List A matches for the team, the last coming in the 1995 Benson & Hedges Cup against Warwickshire.  Evans took just 4 wickets in his 18 matches for the team, coming at an expensive average of 137.25.", "link_mentions": [{"page": "Rupert Evans", "response": ["Rupert Evans (born 9 March 1977) is a British actor. He is a member of the Royal Shakespeare Company and starred in the Amazon series The Man in the High Castle and currently in the CW's Charmed series."]}, {"page": "List of people with surname Evans", "response": ["*Rupert Evans (cricketer) (born 1954), Jamaican born English cricketer", "*Rupert Evans (born 1977), English actor"]}]}}