{"wiki_id": "http://www.wikidata.org/entity/Q7385154", "itemLabel": "Ryland Davies", "itemDescription": "Welsh opera singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ryland_Davies", "wikipedia_page": {"main": "Ryland Davies (born 9 February 1943) is a Welsh operatic tenor.\nDavies was born in Cwm, Ebbw Vale. He studied at the Royal Manchester College of Music. in 1964 he made his professional debut, at Glyndebourne Festival Opera, where he sung the part of Almaviva in Gioachino Rossini's opera, The Barber of Seville. During his active career he also sang important roles at the Royal Opera House, the Paris Opéra, San Francisco Opera and the Metropolitan Opera. In his prime, the music critic Alan Blyth considers, \"he had a sweet-toned, lyrical voice and excellent diction.\"", "link_mentions": [{"page": "Joan Sutherland", "response": ["* Esclarmonde—Joan Sutherland (Esclarmonde), Huguette Tourangeau (Parséis), Clifford Grant (Phorcas), Giacomo Aragall (Roland), Louis Quilico (the bishop of Blois), Ryland Davies (Enéas), Robert Lloyd (Cléomer), Finchley Children's Music Group, John Alldis Choir, National Philharmonic Orchestra, Richard Bonynge, Decca 3 CDs 475 7914 DM3 (2006 release)"]}, {"page": "Idomeneo", "response": ["| 1968 || Margherita Rinaldi,Pauline Tinsley,Ryland Davies,George Shirley,Robert Tear ||Colin DavisBBC Symphony OrchestraBBC Symphony Chorus||CD: Philips,Cat:420 130-2"]}, {"page": "Great Mass in C minor, K. 427", "response": ["* Sir Colin Davis, London Symphony Orchestra & Chorus, Helen Donath, Heather Harper, Ryland Davies, Stafford Dean. Label: Philips Classics Records, recorded February 1971."]}, {"page": "Dialogues of the Carmelites", "response": ["* Catrin Wyn-Davies, Ashley Holland, Peter Wedd, Gary Coward, Felicity Palmer, Josephine Barstow, Orla Boylan, Sarah Tynan, Jane Powell, Anne Marie Gibbons, Ryland Davies, William Berger, James Edwards, Roland Wood, Toby Stafford-Allen, David Stephenson; Orchestra and Chorus of English National Opera; Paul Daniel, conductor (Chandos, titled The Carmelites, sung in English)"]}, {"page": "Ryland", "response": ["*Ryland Davies (born 1943), Welsh operatic tenor"]}, {"page": "La Navarraise", "response": ["* 1975 – Marilyn Horne (Anita), Plácido Domingo (Araquil); Sherrill Milnes (Garrido), Nicola Zaccaria (Remigio), Gabriel Bacquier (Bustamente), Ryland Davies (Ramon), Leslie Fyson (Un soldat); London Symphony Orchestra, Ambrosian Opera Chorus, conducted by Henry Lewis. Studio recording (July 1975, London) issued on 1 LP – RCA Red Seal ARL1-1114. –  1 CD – RCA Red Seal 50167-2"]}, {"page": "Esclarmonde", "response": ["* 28 November 1983 – the Royal Opera House premiere at Covent Garden, London, followed by four performances on 6, 10, 13 and 16 December. Production by Lotfi Mansouri, Beni Montresor (set design, costumes and lighting), Terry Gilbert (choreography), Richard Bonynge (conducting), Joan Sutherland (Esclarmonde), Ernesto Veronelli (Roland), Diana Montague (Parséïs), Ryland Davies (Énéas), Gwynne Howell (Phorcas), Jonathan Summers (Bishop of Blois).", "A studio recording by Decca was made on 2-15 July 1975 at the Kingsway Hall, London, with Joan Sutherland (Esclarmonde), Huguette Tourangeau (Parséis), Clifford Grant (Phorcas), Giacomo Aragall (Roland), Louis Quilico (The Bishop of Blois), Ryland Davies (Enéas), Robert Lloyd (Cléomer), Finchley Children's Music Group, John Alldis Choir, National Philharmonic Orchestra, cond. Richard Bonynge. Decca. 475-7914 (3 CDs). ADD STEREO STUDIO.", "* Joan Sutherland, Diana Montague (Parséis), Gwynne Howell (Phorcas), Ernesto Veronelli (Roland), Jonathan Summers (The Bishop of Blois), Geoffrey Moses (Cléomer), Ryland Davies, Royal Opera Covent Garden Chorus and Orchestra, cond. Richard Bonynge, November 28, 1983), live in-house recording. Available as the web stream at Opera Today archives (TT: 142'55\")"]}, {"page": "Saul (Handel)", "response": ["||1973||Donald McIntyre,Margaret Price,Sheila Armstrong,Ryland Davies,James Bowman,Stafford DeanJohn Winfield||Charles Mackerras,English Chamber Orchestra,Leeds Festival Chorus||CD:Archiv 0289 447 6962 3 ADD AX3"]}, {"page": "Judas Maccabaeus (Handel)", "response": ["|1977 || Ryland DaviesFelicity PalmerJohn Shirley-QuirkJanet BakerPaul EsswoodChristopher Keyte|| Charles MackerrasEnglish Chamber OrchestraWandsworth School Boys' Choir|| CD: Deutsche GrammophonCat: 447692"]}, {"page": "Henry Lewis (musician)", "response": ["Henry Lewis' musical legacy also includes several recordings from the operatic repertoire with his wife Marilyn Horne. Over the course of several decades starting in the 1960s he recorded over twenty albums for several leading international record labels including: Decca Records, London Records, RCA Red Seal, CBS Masterworks, Contour records, Red Label, RPO Records, EMI Records, Opera D'Oro and RelArt. His collaborators on these recordings include several of the world's leading international vocalists and pianists of his era including: Gabriel Bacquier, Boris Carmeli. Ryland Davies, Ivan Davis, Plácido Domingo, Nicolai Gedda, Alfredo Giacomotti, Robert El Hage, Sherrill Milnes, Fritz Peter, Leontyne Price, Margherita Rinaldi, Janis Vakarelis, and Nicola Zaccaria."]}, {"page": "1943 in Wales", "response": ["*9 February – Ryland Davies, operatic tenor"]}, {"page": "Thérèse (opera)", "response": ["*1973: first commercial recording of the opera (Decca) with Huguette Tourangeau, Ryland Davies, Louis Quilico, conducted by Richard Bonynge."]}, {"page": "Gabriel Bacquier", "response": ["* Mozart: Così fan tutte. Pilar Lorengar, Teresa Berganza, Jane Berbié, Ryland Davies, Tom Krause, Gabriel Bacquier (Alfonso), London Philharmonic Orchestra. Conductor: Georg Solti. Decca, 1973."]}, {"page": "The Complete Mozart Edition", "response": ["|19||422 519-2||Masses/Requiem||9||1991, 05||MDR Choir Leipzig, MDR Symphony Orchestra, Herbert Kegel; Vienna Boys' Choir, Vienna Symphony, Uwe Christian Harrer; John Alldis Choir, London Symphony Orchestra, Sir Colin Davis; Monteverdi Choir, English Baroque Soloists, John Eliot Gardiner; Sächsische Staatskapelle Dresden, Peter Schreier; Edith Mathis, Helen Donath, Celestina Casapietra, Annelies Burmeister, Peter Schreier, Hermann Christian Polster, Peter Jelosits, Gerhard Eder, Gillian Knight, Ryland Davies, Clifford Grant, Sylvia McNair, Diane Montague, Anthony Rolfe Johnson, Cornelius Hauptmann, Margaret Price, Trudeliese Schmidt, Francisco Araiza, Theo Adam ...||49, 65, 66, 139, 140, 167, 192, 194, 220, 257, 258, 259, 262, 275, 317, 337, 427, 626", "|20||422 520-2||Litanies/Vespers||5||1991, 06||MDR Choir Leipzig, MDR Symphony Orchestra, Herbert Kegel; London Symphony Orchestra & Choir, Sir Colin Davis; Mitsuko Shirai, Isabella Nawe, Heidi Ries, Eberhard Büchner, Hermann Christian Polster, Kiri Te Kanawa, Elizabeth Bainridge, Ryland Davies, Gwynne Howell, Dagmar Schellenberg-Ernst, Rosemarie Lang, Ralph Eschrig, René Pape||109/74e, 243, 321, 125, 195/186d, 193/186g, 339, 341/368a, 618, 165/158a, 20, 33, 34, 44/73u, 47, 72/74f, 86/73s, 86/73v, 90, 91/186i, 108/74d, 117/66a, 198/C3.08, 222/205a, 260/248a, 273, 276/321b, 277/272a, 322/296a, 323/App. 15", "|10||464 8602||Missae; Requiem; Organ sonatas & solos||11||Masses/Requiem: MDR Choir Leipzig, MDR Symphony Orchestra, Herbert Kegel; Vienna Boys' Choir, Vienna Symphony, Uwe Christian Harrer; John Alldis Choir, London Symphony Orchestra, Sir Colin Davis; Monteverdi Choir, English Baroque Soloists, John Eliot Gardiner; Sächsische Staatskapelle Dresden, Peter Schreier; Edith Mathis, Helen Donath, Celestina Casapietra, Annelies Burmeister, Peter Schreier, Hermann Christian Polster, Peter Jelosits, Gerhard Eder, Gillian Knight, Ryland Davies, Clifford Grant, Sylvia McNair, Diane Montague, Anthony Rolfe Johnson, Cornelius Hauptmann, Margaret Price, Trudeliese Schmidt, Francisco Araiza, Theo Adam; Organ Sonatas & Solos: Daniel Chorzempa, Deutsche Bachsolisten, Helmut Winschermann||49, 65, 66, 139, 140, 167, 192, 194, 220, 257, 258, 259, 262, 275, 317, 337, 427, 626, 67/41h, 68/41i, 69/41k, 144/124a, 145/124b, 212, 224/241a, 241, 225/241b, 244, 245, 263, 274/271d, 278/271e, 328/317c, 329/317a, 336/336d, 594, 608, 616", "|11||464 8702||Litanies; Vespers; Oratorios; Cantatas; Masonic Music||13||Litanies & Vespers: MDR Choir Leipzig, MDR Symphony Orchestra, Herbert Kegel; London Symphony Orchestra & Choir, Sir Colin Davis; Mitsuko Shirai, Isabella Nawe, Heidi Ries, Eberhard Büchner, Hermann Christian Polster, Kiri Te Kanawa, Elizabeth Bainridge, Ryland Davies, Gwynne Howell, Dagmar Schellenberg-Ernst, Rosemarie Lang, Ralph Eschrig, René Pape; Oratorios, Cantatas, Masonic Music: Choir of the Süddeutscher Rundfunk, Stuttgart Radio Symphony Orchestra, Sir Neville Marriner; Mozarteum Orchestra of Salzburg, Kammerchor Salzburg, Leopold Hager; MDR Choir Leipzig, Sächsische Staatskapelle Dresden; Margaret Marshall, Inga Nielsen, Ann Murray, Hans Peter Blochwitz, Aldo Baldin, Peter Schreier, Hanna Schwarz, Ileana Cotrubaș, Walter Berry, Gabriele Fuchs, Margarita Zimmermann, Andreas Schmidt; Apollo et Hyacinthus: Mozarteum Orchestra of Salzburg, Kammerchor Salzburg, Leopold Hager; Arleen Auger, Edith Mathis, Hanna Schwarz, Anthony Rolfe Johnson.||38, 109/74e, 243, 321, 125, 195/186d, 193/186g, 339, 341/368a, 618, 165/158a, 20, 33, 34, 44/73u, 47, 72/74f, 86/73s, 86/73v, 90, 91/186i, 108/74d, 117/66a, 198/C3.08, 222/205a, 260/248a, 273, 276/321b, 277/272a, 322/296a, 323/App. 15, 35, 146/317b, 42/35a, 118/74c, 469, 623, 546, 468, 148/125h, 429/468a, 477/479a, 483, 484, 471, 619, 623a"]}, {"page": "Così fan tutte discography", "response": ["|Pilar LorengarTeresa BerganzaJane BerbiéRyland DaviesTom KrauseGabriel Bacquier"]}, {"page": "Cwm, Blaenau Gwent", "response": ["*Ryland Davies - operatic tenor born in Cwm in 1934"]}, {"page": "Frederic Cox", "response": ["Distinguished pupils of his included John Mitchinson, Joseph Ward, Ryland Davies, Anne Howells, Elizabeth Harwood, Rosalind Plowright, Robert Alderson, Dennis O'Neill, Mary Brennan, Sandra Browne, and Ann Murray."]}, {"page": "Georg Solti discography", "response": ["|Ryland Davies, Tom Krause, Gabriel Bacquier, Pilar Lorengar, Teresa Berganza, Jane Berbié"]}, {"page": "List of operas performed at the Santa Fe Opera", "response": ["|1998 || The Magic Flute || Wolfgang Amadeus Mozart || German || 1791 || Robert Spano || || Roni Toren,Judy Levin,Duane Schuler || Raymond Very,Heidi Grant Murphy,Thomas Barrett,Jami Rogers /Cyndia Sieden,Ryland Davies,Stephen Richardson", "|1999 || Countess Mariza || Emmerich Kálmán || German || 1924 || John Crosby || Daniel Pelzig || Maxine Willi Klein,Dona Granata,Duane Schuler || Sheri Greenawald,Tamara Acosta,Ryland Davies,Kevin Anderson"]}, {"page": "Anne Howells", "response": ["Howells has been married twice, to Ryland Davies from 1966 to 1981, and to Stafford Dean from 1981 to 1988. She has one son and one daughter."]}, {"page": "Les Troyens discography", "response": ["| 1969 || Jon Vickers,Peter Glossop,Anthony Raffell,Roger Soyer,Ian Partridge,Ryland Davies,Anne Howells,Berit Lindholm,Josephine Veasey,Heather Begg"]}]}}