{"wiki_id": "http://www.wikidata.org/entity/Q7384315", "itemLabel": "Ryan McGuffie", "itemDescription": "Scottish footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ryan_McGuffie", "wikipedia_page": {"main": "Ryan McGuffie (born 22 July 1980 in Dumfries, Scotland) is a Scottish former professional footballer who last played for Australian club St Albans Saints. McGuffie is a utility player who can line up in either defence or midfield.", "link_mentions": [{"page": "St Albans Saints SC", "response": ["The 2014 season will be remembered by the Saints' impressive 2014 FFA Cup run. St Albans beat FC Clifton Hill, Avondale FC, Eastern Lions SC and Northcote City FC to qualify for the FFA Cup Round of 32. Dinamo drew Parramatta FC at the Melita Stadium in Sydney, Australia. Barry Devlin scored the lone goal as Dinamo progressed to the Round of 16. Dinamo then drew A-League side Perth Glory. The match was played at sister-club Melbourne Knights' Knights Stadium. The game was played in front of 3,500 supporters, with the entire Victorian Croatian community rallying around the side for this huge encounter. Unfortunately, Dinamo lost by four goals to one, as their fully professional opponents' quality shone through in the second half. St Albans sacked head coach Toby Paterson and his son Brodie in September 2014, after an altercation broke out in their Round 23 NPL clash against Richmond SC. Captain Ryan McGuffie took on a caretaker player-coach role, leading the side in the remainder of the 2014 season. At the club's AGM towards the end of 2014, Richmond FC star ruckman Ivan Marić was appointed as president of the club."]}, {"page": "2006–07 in Scottish football", "response": ["|Ryan McGuffie"]}, {"page": "Alex Walker (footballer, born 1984)", "response": ["He began his career at Rangers, where he made 2 appearances. Walker made his senior league début in a 1–0 win over Motherwell at Fir Park, coming off the bench to replace Hamed Namouchi. Walker had a six-month loan spell at Clyde in which he made his Bully Wee début in a 1–0 victory at Broadwood Stadium against Ross County. During this time, Walker won the SFL young player of the month award for September 2004. After his short-term deal at Broadwood, Walker went to Sweden for a couple of months but decided to come back home. he joined Morton in July 2005. Walker made his Morton début in a 3–2 (AET) Challenge Cup win over Gretna, in which assistant boss at Morton, Derek Collins, and later-to-be teammate Ryan McGuffie played for the opposition. His senior league debut was the following week against Raith Rovers, in which Morton triumphed 2–0 in front of 3,222 fans. He signed a new contract in May 2009, for another year at Morton. Being out of contract in the summer, and struggling for fitness, Walker was loaned to Brechin City for three months in January 2010. Walker suffered a recurrence of a groin injury, where he underwent surgery but remained at Brechin until April. He was released at the end of the 2009–10 season. After his release from Morton, Walker decided to go part-time and was signed up by ex-manager Jim McInally at East Stirlingshire for the 2010–11 season."]}, {"page": "2005–06 Scottish Second Division", "response": ["|  Ryan McGuffie || Gretna || style=\"text-align:center\"|13"]}, {"page": "2006 Scottish Cup Final", "response": ["|DF ||8 || Ryan McGuffie"]}, {"page": "2008–09 Greenock Morton F.C. season", "response": ["|Ryan McGuffie ", "|Iain Russell    Brian Wake Erik Paartalu Jon Newby Kevin Finlayson Ryan McGuffie ", "|Ryan McGuffie  Kevin Finlayson Iain Russell Peter Weatherson Brian Wake  James Grady    ", "|Ryan McGuffie Erik Paartalu ", "|Peter Weatherson Ryan McGuffie ", "|Brian Wake Ryan McGuffie ", "|Ryan McGuffie ", "|Ryan McGuffie   Brian Wake    Iain Russell    Erik Paartalu ", "|Steven Masterton   Ryan McGuffie  ", "|Brian Wake   Ryan McGuffie ", "|MF ||style=\"text-align:left\"|  Ryan McGuffie || 38 || 1 || 8 "]}, {"page": "2009–10 Greenock Morton F.C. season", "response": ["|Ryan McGuffie    Brian Wake  Steven Masterton Brian Graham  ", "|Erik Paartalu   Ryan McGuffie ", "|Ryan McGuffie   Brian Wake     Erik Paartalu  David van Zanten ", "|Peter Weatherson     Michael Tidser   Ryan McGuffie ", "|Ryan McGuffie   Stewart Greacen ", "|David Witteveen     Ryan McGuffie   Donovan Simmonds ", "|Ryan McGuffie   Kevin Finlayson   Allan Jenkins ", "|MF ||style=\"text-align:left\"|  Ryan McGuffie || 36 || 2 || 4 || 0 || 2"]}, {"page": "2010–11 Greenock Morton F.C. season", "response": ["Ryan McGuffie signed a pre-contract agreement with hometown club Queen of the South.", "| Ryan McGuffie"]}, {"page": "2002–03 Newcastle United F.C. season", "response": ["|  Ryan McGuffie"]}, {"page": "2000–01 Newcastle United F.C. season", "response": ["|  Ryan McGuffie"]}, {"page": "2010 Scottish Challenge Cup Final", "response": ["|CB ||4|| Ryan McGuffie"]}, {"page": "2011–12 Queen of the South F.C. season", "response": ["||| DF|| Ryan McGuffie", "|6|| ||Ryan McGuffie"]}, {"page": "2012–13 Queen of the South F.C. season", "response": ["||| DF|| Ryan McGuffie", "|5|| ||Ryan McGuffie"]}, {"page": "McGuffie", "response": ["*Ryan McGuffie (born 1980), Scottish footballer"]}]}}