{"wiki_id": "http://www.wikidata.org/entity/Q7383045", "itemLabel": "Ruth Holton", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Holton", "wikipedia_page": {"main": "Ruth Holton (born 1961) is an English soprano singer.", "link_mentions": [{"page": "Wo soll ich fliehen hin, BWV 5", "response": ["* Bach Edition Vol. 19 – Cantatas Vol. 9, conductor Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Nico van der Meel, Bas Ramselaar, Brilliant Classics 2000"]}, {"page": "Meine Seufzer, meine Tränen, BWV 13", "response": ["* Bach Edition Vol. 9 – Cantatas Vol. 4, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Knut Schoch, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "Amsterdam Baroque Orchestra & Choir", "response": ["In 1994, Koopman embarked on a ten-year project to conduct the group in recordings and performances of the complete vocal works of Johann Sebastian Bach. His more than 200 cantatas were recorded in 22 volumes, first under the label Erato, since 2003 Challenge/Antoine Marchand Records, reissuing also the former volumes.Bach cantatas  details on volumes 1-22, Antoine Marchand Soloists for this project included sopranos Els Bongers, Ruth Holton, Lisa Larsson, Marlis Petersen, Sandrine Piau, Dorothea Röschmann, Sibylla Rubens, Barbara Schlick, Caroline Stam (a member of the choir from the beginning), Deborah York, Ruth Ziesak and Johannette Zomer, altos Bogna Bartosz, Michael Chance, Franziska Gottwald, Bernhard Landauer, Elisabeth von Magnus, Annette Markert, Andreas Scholl, Nathalie Stutzmann and Kai Wessel, tenors Paul Agnew, Jörg Dürmüller, James Gilchrist, Guy de Mey, Christoph Prégardien and Gerd Türk, and bass Klaus Mertens. Bach: Cantatas Vol 22 / Koopman, Amsterdam Baroque review of Vol. 22 and the complete recordings by George Chien in \"Fanfare\""]}, {"page": "Der Himmel lacht! Die Erde jubilieret, BWV 31", "response": ["* Bach Edition Vol. 21 – Cantatas Vol. 12, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Nico van der Meel, Bas Ramselaar, Brilliant Classics 2000"]}, {"page": "Alles nur nach Gottes Willen, BWV 72", "response": ["* Bach Edition Vol. 4 – Cantatas Vol. 1, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "Wer da gläubet und getauft wird, BWV 37", "response": ["* Bach Edition Vol. 4 – Cantatas Vol. 1, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Knut Schoch, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "Jesu, nun sei gepreiset, BWV 41", "response": ["* Bach Cantatas Vol. 17: Berlin, John Eliot Gardiner, Monteverdi Choir, English Baroque Soloists, Ruth Holton, Lucy Ballard, Charles Humphries, James Gilchrist, Peter Harvey, Soli Deo Gloria 2000", "* Bach Edition Vol. 21 – Cantatas Vol. 12, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Knut Schoch, Bas Ramselaar, Brilliant Classics 2000"]}, {"page": "Am Abend aber desselbigen Sabbats, BWV 42", "response": ["* Bach Edition Vol. 4 – Cantatas Vol. 1, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Knut Schoch, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "Gott fähret auf mit Jauchzen, BWV 43", "response": ["* Bach Edition Vol. 19 – Cantatas Vol. 10, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Nico van der Meel, Bas Ramselaar, Brilliant Classics 2000"]}, {"page": "Sie werden euch in den Bann tun, BWV 44", "response": ["* Bach Edition Vol. 5 – Cantatas Vol. 2, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Knut Schoch, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "List of alumni of Clare College, Cambridge", "response": ["*Ruth Holton, soprano"]}, {"page": "Nun komm, der Heiden Heiland, BWV 62", "response": ["* Bach Edition Vol. 12 – Cantatas Vol. 6, Pieter Jan Leusink, Holland Boys Choir, Netherlands Bach Collegium, Ruth Holton, Sytse Buwalda, Nico van der Meel, Bas Ramselaar, Brilliant Classics 1999"]}, {"page": "Dido and Aeneas discography", "response": ["|Carolyn WatkinsonRuth HoltonGeorge MosleyTeresa Shaw"]}, {"page": "Georg Christoph Biller", "response": ["* J. S. Bach: Johannes-Passion, Marcus Ullmann, Gotthold Schwarz, Ruth Holton, Matthias Rexroth, Henryk Böhm, Thomanerchor, Gewandhausorchester Leipzig, conductor Georg Christoph Biller, Rondeau 2007 "]}]}}