{"wiki_id": "http://www.wikidata.org/entity/Q739953", "itemLabel": "Robert Lowth", "itemDescription": "Bishop of St David's; Bishop of Oxford; Bishop of London (1710-1787)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Lowth", "wikipedia_page": {"main": "Robert Lowth  ( LOWDH; 27 November 1710 – 3 November 1787) was a Bishop of the Church of England, Oxford Professor of Poetry and the author of one of the most influential \ntextbooks of English grammar.", "link_mentions": [{"page": "November 27", "response": ["*1710 – Robert Lowth, English bishop and academic (d. 1787)"]}, {"page": "November 3", "response": ["*1787 – Robert Lowth, English bishop and academic (b. 1710)"]}, {"page": "Robert Lowth", "response": ["Robert Lowth  ( ; 27 November 1710 – 3 November 1787) was a Bishop of the Church of England, Oxford Professor of Poetry and the author of one of the most influential ", "3Notes & Queries (OUP) in 1983 Vol. 30, Page 55-58 by Sailendra Kumar Sen, Robert Lowth :the first imagery critic of Shakespeare.", "* Tieken-Boon van Ostade, I. M. (2010), The Bishop's Grammar: Robert Lowth and the Rise of Prescriptivism. Oxford: OUP", "* Robert Lowth at the Eighteenth-Century Poetry Archive (ECPA)"]}, {"page": "Split infinitive", "response": ["Although it is sometimes reported that a prohibition on split infinitives goes back to Renaissance times, and frequently the 18th century scholar Robert Lowth is cited as the originator of the prescriptive rule,Richard Lederer, A Man of My Words: Reflections on the English Language, St. Martin's Press, 2003, , p. 248: \"The prohibition of that practice was created in 1762 by one Robert Lowth, an Anglican bishop and self-appointed grammarian.\" Similarly Peter Stockwell, Sociolinguistics: A Resource Book for Students, Routledge, 2002, , p. 98. such a rule is not to be found in Lowth's writing, and is not known to appear in any text before the 19th century."]}, {"page": "1787", "response": ["* November 3 – Robert Lowth, English bishop, grammarian (b. 1710)"]}, {"page": "1710", "response": ["* November 27 – Robert Lowth, English bishop and grammarian (d. 1787)"]}, {"page": "Fulham", "response": ["* Robert Lowth (1710–1787), Bishop of London"]}, {"page": "Johann David Michaelis", "response": ["The personal character of Michaelis can be read between the lines of his autobiography with the aid of the other materials collected by J. M. Hassencamp (J. D. Michaelis Lebensbeschreibung, etc., 1793). The same volume contains a full list of his works. Besides those already mentioned it is sufficient to refer to his Introduction to the New Testament (the first edition, 1750, preceded the full development of his powers, and is a very different book from the later editions), his reprint of Robert Lowth's Praelectiones with important additions (1758–1762), his German translation of the Bible with notes (1773–1792), his Orientalische und exegetische Bibliothek (1775–1785) and Neue O. und E. Bib. (1786–1791), his Mosaisches Recht (1770–1771) (quite influenced by Montesquieu's L'esprit des lois of 1748) and his edition of Edmund Castell's Lexicon syriacum (1787–1788). His Litterarischer Briefwechsel (1794–1796) contains much that is interesting for the history of learning in his time."]}, {"page": "William Warburton", "response": ["In 1762 he launched a vigorous attack on Methodism under the title of The Doctrine of Grace. He also engaged in a keen controversy with Robert Lowth, later bishop of London, on the book of Job, in which Lowth brought home charges of lack of scholarship and of insolence that admitted of no denial. His last important act was to found in 1768 the Warburtonian lecture at Lincoln's Inn, \"to prove the truth of revealed religion ... from the completion of the prophecies of the Old and New Testament which relate to the Christian Church, especially to the apostasy of Papal Rome.\""]}, {"page": "Double negative", "response": ["When two negatives are used in one independent clause, in standard English the negatives are understood to cancel one another and produce a weakened affirmative (see the Robert Lowth citation below): this is known as litotes. However, depending on how such a sentence is constructed, in some dialects if a verb or adverb is in between two negatives then the latter negative is assumed to be intensifying the former thus adding weight or feeling to the negative clause of the sentence. For this reason, it is difficult to portray double negatives in writing as the level of intonation to add weight in one's speech is lost. A double negative intensifier does not necessarily require the prescribed steps, and can easily be ascertained by the mood or intonation of the speaker. Compare", "In Standard English, two negatives are understood to resolve to a positive. This rule was observed as early as 1762, when Bishop Robert Lowth wrote A Short Introduction to English Grammar with Critical Notes. For instance, \"I don't disagree\" could mean \"I certainly agree\",  \"I agree\", \"I sort of agree\", \"I don't understand your point of view (POV)\", \"I have no opinion\", and so on; it is a form of \"weasel words\". Further statements are necessary to resolve which particular meaning was intended.", "In his Essay towards a practical English Grammar of 1711, James Greenwood first recorded the rule: \"Two Negatives, or two Adverbs of Denying do in English affirm\". Robert Lowth stated in his grammar textbook A Short Introduction to English Grammar (1762) that \"two negatives in English destroy one another, or are equivalent to an affirmative\". Grammarians have assumed that Latin was the model for Lowth and other early grammarians in prescribing against negative concord, as Latin does not feature it.  Data indicates, however, that negative concord had already fallen into disuse in Standard English by the time of Lowth's grammar, and no evidence exists that the loss was driven by prescriptivism, which was well established by the time it appeared."]}, {"page": "Richard Mant", "response": ["Mant's Ancient Hymns from the Roman BreviaryAncient Hymns from the Roman Breviary (1837) was one of the earliest collections of translated Latin hymnody in English. He belonged to a group of revivalist translators of Latin hymns, with John Chandler (1806–1876) and Isaac Williams. John Ellerton commented on his good taste, but also discerned a lack of understanding of the group of hymns he was handling. The Psalms in an English Metrical VersionPsalms in an English Metrical Version (1824) were influenced by Robert Lowth's theories of biblical poetry, the psalms becoming \"stiff and stately odes\" according to John Julian."]}, {"page": "1710 in literature", "response": ["*November 27 – Robert Lowth, English poet, grammarian and bishop (died 1787)"]}, {"page": "1758 in literature", "response": ["*Robert Lowth – The Life of William of Wykeham"]}, {"page": "1762 in literature", "response": ["*Robert Lowth – A Short Introduction to English Grammar"]}, {"page": "1777 in literature", "response": ["*April 12 – The poet and grammarian Robert Lowth is appointed Bishop of London."]}, {"page": "1787 in literature", "response": ["*November 3 – Robert Lowth, English poet, grammarian and bishop (born 1710)"]}, {"page": "Linguistic prescription", "response": ["Some elements of prescription in English are sometimes thought to have been based on the norms of Latin grammar. Robert Lowth is frequently cited  as having done so, but he specifically objected to \"forcing the English under the rules of a foreign Language\".A Short Introduction to English Grammar, p. 107, condemning Richard Bentley's \"corrections\" of some of Milton's constructions.", "Finally, there is the problem of inappropriate dogmatism. Although competent authorities tend to make careful statements, popular pronouncements on language are apt to condemn. Thus, wise prescriptive advice identifying a form as colloquial or non-standard and suggesting that it be used with caution in some contexts may – when taken up in the classroom – become converted into a ruling that the dispreferred form is automatically unacceptable in all circumstances, a view academic linguists reject. (Linguists may accept that a construction is ungrammatical or incorrect in relation to a certain lect if it does not conform to its inherent rules, but they would not consider it absolutely wrong simply because it diverges from the norms of a prestige variety.) A classic example from 18th-century England is Robert Lowth's tentative suggestion that preposition stranding in relative clauses sounds colloquial. This blossomed into a grammatical rule that a sentence should never end with a preposition. Such dogmatism has often caused resentment."]}]}}