{"wiki_id": "http://www.wikidata.org/entity/Q739629", "itemLabel": "Jesse Pennington", "itemDescription": "English footballer (1883-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jesse_Pennington", "wikipedia_page": {"main": "Jesse Pennington (23 August 1883 – 5 September 1970) was an English football player in the early part of the 20th century. He was nicknamed \"Peerless Pennington\".\nBorn in West Bromwich, Pennington was a left-back for West Bromwich Albion for 19 years, from March 1903 to May 1922. Although his career was interrupted by World War I, Pennington made 455 league appearances for the club, captaining them to the league title in 1919–1920. He had also been a part of the team promoted from the Second Division in 1911 and had received an FA Cup runners-up medal in 1912.\nDuring World War I, with regular league play suspended, Pennington was employed in Coventry to work in a munitions factory. While in the city he made a number of guest appearances for Coventry City in the 1918–19 Football League Midland Section, a temporary wartime division operating while the main league was suspended.On the international front, Pennington earned 25 caps for England between 18 March 1907 and 10 April 1920, captaining the side in his last two matches. At the time of his final cap he was, at 36 years and 231 days, England's oldest capped outfield player. This record has since been exceeded by Stanley Matthews, Leslie Compton and Stuart Pearce.\nAfter retiring, he worked as a scout for West Bromwich Albion from 1950 to 1960 and was made a life member of the club in 1969, a year before he died in Kidderminster. Pennington was named as one of West Bromwich Albion's 16 greatest players in a poll organised as part of the club's 125th anniversary celebrations in 2004.Until the shop was bought by the Co-operative in 1934, Pennington also owned a fishing tackle shop at 33 Smethwick High Street, where his family had lived since 1911.", "link_mentions": [{"page": "West Bromwich Albion F.C.", "response": ["Albion's most capped international player, taking into account only those caps won whilst at the club, is Chris Brunt. He appeared 55 times for Northern Ireland as an Albion player, earning 65 caps in total before retiring from international football in 2017. Jesse Pennington is the club's most capped England international, with 25 caps.Matthews (2007) pp. 404–405. The highest transfer fee paid by the club is £15 million to RB Leipzig for Oliver Burke on 25 August 2017. The record transfer fee received by Albion from another club was for the transfer of Salomón Rondón to Dalian Yifang in July 2019 for  £16.5 million."]}, {"page": "1883", "response": ["** Jesse Pennington, English footballer (d. 1970)"]}, {"page": "1970", "response": ["** Jesse Pennington, English footballer (b. 1883)"]}, {"page": "Kidderminster Harriers F.C.", "response": ["The club reverted to amateur status in the Birmingham and District League the following season as Kidderminster Harriers. The club again reached the 1st Round of the F.A Cup in 1906–07, losing to Oldham Athletic away 5–0. In 1910 the then current England international full-back Jesse Pennington signed for Harriers after a dispute with his then club West Bromwich Albion. He played one game before the dispute was resolved and he returned to Albion."]}, {"page": "Emlyn Hughes", "response": ["Greenwood included him in the squad for the European Championship finals in Italy as an experienced reserve, but Hughes ultimately did not play and England were eliminated in the group stages. Hughes was England's only connection with their previous foray into the finals of a tournament – the 1970 World Cup – but his non-participation in either made him England's most capped player never to feature in a major finals. He also became only the fifth player to represent England in three separate decades, joining Jesse Pennington, Stanley Matthews, Bobby Charlton and Peter Shilton. The 57 caps Hughes earned in the 1970s make him the most capped England player of that decade."]}, {"page": "England national football team records and statistics", "response": [": Sam Hardy and Jesse Pennington, 1900s, 1910s, 1920s", "|Jesse Pennington"]}, {"page": "Sam Hardy (footballer)", "response": ["Many goalkeeping experts – as well as England and West Bromwich Albion full-back Jesse Pennington – regard Sam Hardy as the greatest keeper of all, a statement that goes a long way to be backed up by Hardy appearing on the BBC's Football Legends List. He also was voted in at No. 94 in the official Liverpool Football Club web site poll.100 Players Who Shook The Kop "]}, {"page": "1883 in association football", "response": ["* 23 August – Jesse Pennington (d. 1970), England international full-back in 25 matches (1907–1920)."]}, {"page": "Pascoe Bioletti", "response": ["In 1913, Bioletti approached West Bromwich Albion F.C. and England captain Jesse Pennington and offered £5 per player for Albion to endeavour not to win their forthcoming game against Everton F.C. on 29 November. p.5"]}, {"page": "1970 in the United Kingdom", "response": ["* 5 September – Jesse Pennington, footballer (born 1883)"]}, {"page": "1912 FA Cup Final", "response": ["|FB || || Jesse Pennington (c)", "|FB || || Jesse Pennington (c)"]}, {"page": "1907–08 British Home Championship", "response": ["|align=left|Jesse Pennington"]}, {"page": "1883 in the United Kingdom", "response": ["* 23 August – Jesse Pennington, footballer (died 1970)"]}, {"page": "1908–09 British Home Championship", "response": ["|align=left|Jesse Pennington"]}, {"page": "1910–11 British Home Championship", "response": ["|align=left|Jesse Pennington"]}, {"page": "1912–13 British Home Championship", "response": ["|align=left|Jesse Pennington"]}, {"page": "1911–12 British Home Championship", "response": ["|align=left|Jesse Pennington"]}, {"page": "History of Coventry City F.C.", "response": ["The club then entered suffered a slump in fortune. They finished thirteenth in 1912–13 and financial pressure led to the cutting of the professional staff form 24 to 18. The following season they finished bottom of the league and were relegated to division two of the Southern League. The quality of teams was much lower and Coventry had some big victories in the 1914–15 season but the finances of the club were once more in grave danger. The club tried unsuccessfully to join the Football League's second division and came close to extinction in the summer of 1915. They were saved in part by the decision to abandon the upcoming FA Cup and Southern League seasons because of World War I. Although no football was played for the next few years City still had liabilities and in 1917 had to be rescued by David Cooke, who paid off the debts and began replenishing the club's staff. Seeking to make the step up to the Football League after the war, the club played regular friendly matches against local clubs such as Aston Villa during 1918 and then negotiated a place for itself in the 1918–19 Football League Midland Section, a temporary wartime division operating while the main league was suspended. The rules allowed guest players and City made use of two internationals based in Coventry during the war – England's Jesse Pennington and Scotland's George Chaplin. The division was somewhat amateurish due to the absence of many players but Coventry acquitted themselves well, winning games against top-flight Nottingham Forest, Sheffield Wednesday, and Huddersfield Town. In early 1919 they made a speculative application for league status and were successful, topping the ballot and gaining entry to the second division when full-time football restarted in 1919–20."]}, {"page": "List of West Bromwich Albion F.C. records and statistics", "response": ["*Most capped player for England: Jesse Pennington, 25 caps as an Albion playerMatthews (2007) pp. 404–408."]}, {"page": "Pennington (surname)", "response": ["* Jesse Pennington (1883–1970), English footballer"]}, {"page": "1913–14 Birmingham F.C. season", "response": ["In November 1913, Birmingham captain Womack was offered an inducement of £55 to fix the result of the match against Grimsby Town. A similar offer was made to West Bromwich Albion captain Jesse Pennington in relation to their match against Everton. Both men reported the matter to club officials and the police, an arrest was made, and the culprit, one Pascoe Bioletti, who was connected with a football betting service based in Switzerland,Matthews (2010), Complete Record, p.272.\"Alleged Attempt to Bribe Football Captain\". The Times (London): p.5. 12 December 1913.\"Alleged Attempt to Bribe Football Captains\". The Times (London): p.56. 31 December 1913. was convicted and sentenced to five months' imprisonment in relation to Pennington. After his release, the charge in relation to Womack was withdrawn, as \"the Football Association did not want to be vindictive as Bioletti was 68 years old.\"\"Charge of Football Bribery Withdrawn\". The Times (London): p.5. 16 June 1914."]}, {"page": "1913 FA Charity Shield", "response": ["There were a number of changes from the teams originally selected. Bromley's Ernest Peacock replaced Oxford City's Kenneth Hunt at centre half for the Amateurs, and the right flank of the Professionals lineup had to be reorganised. Fanny Walden came in on the wing in place of the injured Jock Simpson of Blackburn, and Tom Brittleton's \"indisposition\" gave a chance at right half to Sunderland's Frank Cuggy, who, according to the Daily Express, \"has not so far reproduced in representative games the form he shows in inter-club football.\" An injury to Jesse Pennington, West Bromwich Albion's left back, meant a late call-up for Birmingham's Frank Womack."]}, {"page": "September 1970", "response": ["**Jesse Pennington, 87, English soccer football left-back with 25 appearances on the England national team"]}]}}