{"wiki_id": "http://www.wikidata.org/entity/Q7408733", "itemLabel": "Sam Smith", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Samantha_Smith_(tennis)", "wikipedia_page": {"main": "Samantha Smith (born 27 November 1971) is an English former professional tennis player, who was the British ladies' No. 1 from 1996 to 1999. She now commentates on the game, predominantly for the BBC, ITV, Sky Sports, BT Sport and Eurosport and Amazon Prime as well as in Australia on the Australian Open which she has been a part of for 11 years with the Seven Network and as of 2019 the Nine Network.", "link_mentions": [{"page": "French Open", "response": ["ITV Sport and Eurosport held broadcasting rights to show the French Open tennis tournaments until 2021. The bulk of the daily coverage is broadcast on ITV4 although both singles finals plus other weekend matches are shown on ITV. John Inverdale hosts the coverage. Commentators include Nick Mullins, Jonathan Overend, Mark Petchey, Sam Smith, Jim Courier, Fabrice Santoro and Anne Keothavong."]}, {"page": "Great Britain at the 1992 Summer Olympics", "response": ["|Sam Smith, Clare Wood"]}, {"page": "BBC Sport", "response": ["For the most recent tournament in 2021, the commentators included, Chris Bradnam, James Burridge, Andrew Castle, Matt Chilton, Andrew Cotter, Katherine Downes, Paul Hand, John Inverdale, David Law, Nick Lester, Dan Lobb, Alison Mitchell, Ronald McIntosh, Nick Mullins, Pete Odgers, Mark Petchey, Simon Reed, Sam Smith and Andy Stevenson.  Co-commentators included, Tracy Austin, Marion Bartoli, Boris Becker, Pat Cash, Annabel Croft, Colin Fleming, Peter Fleming, Tim Henman, Anne Keothavong, John Lloyd, Miles Maclagan, John McEnroe, Martina Navratilova, Arvind Parmar, Louise Pleming, Chanda Rubin, Liz Smylie and Mel South. Lee McKenzie, Rishi Persad, John Inverdale and Simon Mundie were the reporters. Regular tournament weather updates are provided by Carol Kirkwood."]}, {"page": "ITV Sport", "response": ["In 2011, ITV Sport won the rights from the BBC to show the French Open and started televising the event in 2012. The bulk of the daily coverage was broadcast on ITV4 although both singles finals plus other weekend matches were shown on ITV. In 2018, ITV renewed its deal to show the tournament for another 3 years. From 2022, Eurosport won exclusive rights to the French Open, ending a 10-year spell of the French Open being on ITV. For the final year ITV broadcast the French Open, John Inverdale hosted the coverage with commentators including Nick Mullins and Jonathan Overend. Analysts and Co-commentators included Marion Bartoli, Jim Courier, Anne Keothavong, Mark Petchey, Fabrice Santoro and Sam Smith."]}, {"page": "Seven Sport", "response": ["* Sam Smith (Commentator)"]}, {"page": "Anne Keothavong", "response": ["Keothavong announced her retirement on 24 July 2013. After that, she became a member of BT Sport's tennis coverage team, alongside Martina Navratilova and fellow British ex-number one Sam Smith. In 2017, Keothavong became Fed Cup captain for Great Britain, leading the team to win all four ties played in the Europe/Africa Zone Group I. She continued as captain for the 2018 and 2019 Fed Cup, winning promotion in April 2019 to World Group II for the first time in 26 years."]}, {"page": "Melanie South", "response": ["In the first half of 2006, she won the third ITF tournament of her career in Hull and reached the semifinals of another ITF event, this one in Tenerife, as a qualifier before losing to Andrea Hlaváčková. In the run-up to Wimbledon 2006, she played two WTA tournaments courtesy of wildcards. She lost in the first round of the Birmingham Classic (Tier III) to fellow wildcard Sarah Borwell in three sets, and also lost in the first round of qualifying for the Tier-II tournament in Eastbourne. In June, South played for the first time in the Wimbledon main draw as a wildcard and reached the second round by beating No. 11 seed, Francesca Schiavone, in the first round. She lost to Shenay Perry in the second round. South's win over world No. 14 Schiavone was a career-first top-20 victory, and the best win in terms of ranking for a British player since Sam Smith beat No. 7, Conchita Martínez, at Wimbledon in 1998. After Wimbledon, South won another ITF tournament, reached three semifinals and two more quarterfinals. She participated in the qualifying tournament for the US Open in September but did not progress further than the first round. Her year-end ranking was world No. 176."]}]}}