{"wiki_id": "http://www.wikidata.org/entity/Q7407370", "itemLabel": "Sam Cree", "itemDescription": "Northern Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Cree", "wikipedia_page": {"main": "Samuel Raymond Cree (1928–1980) was a Northern Irish playwright. During the 1960s and 1970s he wrote several long running and popular plays for comedians James Young and Jimmy Logan. His plays remain a favourite with Northern Ireland audiences and amateur theatre companies.", "link_mentions": [{"page": "Sid James", "response": ["On 26 April 1976, while on a revival tour of The Mating Season, a 1969 farce by the Irish playwright Sam Cree, James suffered a heart attack on stage at the Sunderland Empire Theatre. Actress Olga Lowe thought that he was playing a practical joke at first when he failed to reply to her dialogue.  When he failed to reply to her ad libs, she moved towards the wings to seek help. The technical manager, Melvyn James (no relation), called for the curtain to close and requested a doctor, while the audience – who were unaware of what was happening – laughed, believing the events to be part of the show. An ambulance was called and he was pronounced dead on arrival at Sunderland Royal Hospital. He was 62."]}, {"page": "Bed (disambiguation)", "response": ["* The Bed, a 1971 play by Sam Cree"]}, {"page": "Lisburn", "response": ["* Sam Cree (1928–1980) – playwright."]}, {"page": "Sheila Florance", "response": ["Florance's theatre work in the 1970s included a lavish production of William Shakespeare's comedy All's Well That Ends Well directed by Sir Tyrone Guthrie, which opened at the Princess Theatre, Melbourne (21 October 1970 – 14 November 1970). The production travelled to Canberra (18 November 1970 – 21 November 1970), before a final performance at the Octagon Theatre, Crawley, Western Australia, as part of the Festival of Perth. In 1972, she was selected to perform with Sid James in Sam Cree's farce The Mating Season at the Comedy Theatre.The Mating Season, 30 September 1972, Playbill, Comedy Theatre Melbourne"]}, {"page": "On the Buses", "response": ["A stage play called Busman's Holiday, written by Sam Cree, starred Stephen Lewis, Bob Grant and Anna Karen. It was performed as a 1973 summer season at the Pavilion Theatre, Torquay. All of the character names were different from those in the original television series."]}, {"page": "The Mating Season", "response": ["* The Mating Season (play), a 1969 comedy by Sam Cree whose lead actor in a 1976 revival, Sid James, died on stage"]}, {"page": "List of writers from Northern Ireland", "response": ["*Sam Cree (1928–1980)"]}, {"page": "James Young (comedian)", "response": ["Following the withdrawal of Sam Thompson's play Over The Bridge from Ulster Group Theatre, Young was invited to bring his unique comedy talents to the venue. Young asked one of his popular sketch writers Sam Cree to adapt Glenn Melvyn's The Love Match for an Ulster audience. The play premiered on 8 March 1960, and ran for ten weeks. The play was a success and Young and Hudson were invited to become joint managing directors of the Group Theatre in the autumn of 1960.", "*The Love Match (1960) – By Glenn Melvyn,  Adapted for a Northern Irish setting by Sam Cree (As Alec Galbraith) ", "*Wedding Fever (1960) – By Sam Cree (As Alec Galbraith) "]}, {"page": "Morag Hood", "response": ["Hood's first stage appearance was in Sam Cree's Wedding Fever in 1964, at the Metropole in Glasgow. On London's West End, she appeared in The Servant of Two Masters in 1968, and A Streetcar Named Desire in 1974, and three David Greig plays, among other shows. She received acclaim in 2001 for her final stage performance, in A Listening Heaven, by Torben Betts, at the Royal Lyceum Theatre in Edinburgh. She was nominated for Best Actress in that year's TMA Awards."]}, {"page": "1980 in Northern Ireland", "response": ["*Sam Cree, playwright (born 1928)."]}, {"page": "1928 in Northern Ireland", "response": ["*19 February – Sam Cree, playwright (died 1980)."]}, {"page": "Knocknagoshel", "response": ["The Spike Players is a local drama group which started with a variety show in 2010. In 2011, the group staged the comedy Troubled Bachelors, and in 2016 self-produced The Mountainy Puck, which lead to an invite to perform in London. In 2020, the group produced and performed a Sam Cree play titled Separate Beds. "]}, {"page": "John McDonnell (playwright)", "response": ["The play came to the attention of Belfast based actor James Young, who contacted the author with a view to performing the play at the Ulster Group Theatre. As had been his practice with his former writer Sam Cree, Young felt that the play would need reworked for a Belfast audience. Young was quoted as saying about McDonnell that he had \"no arty airs about him and, being a journalist, set about the changes I suggested in a most realistic fashion\". McDonnell's rewrites would remove some of the more serious aspects of the play and introduced a new character."]}]}}