{"wiki_id": "http://www.wikidata.org/entity/Q7405166", "itemLabel": "Sally Hunt", "itemDescription": "British trade union leader", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Hunt", "wikipedia_page": {"main": "Sally Colette Hunt  (born 1964) is a British trade union leader, the General Secretary of the Association of University Teachers until its merger into the new University and College Union (UCU), of which Hunt was the General Secretary until 2019.", "link_mentions": [{"page": "Association of University Teachers", "response": ["The Association of University Teachers (AUT) was the trade union and professional association that represented academic (teaching and research) and academic-related (librarians, IT professionals and senior administrators) staff at pre-1992 universities in the United Kingdom. The final general secretary of AUT was Sally Hunt.", "* 2002-06 Sally Hunt"]}, {"page": "Paul Mackney", "response": ["Paul Mackney (born 25 March 1950) is a British educator and trade union leader.  From 1997 to 2006, he was General Secretary of the National Association of Teachers in Further and Higher Education (NATFHE). NATFHE merged with the Association of University Teachers (AUT) in 2006 to form the University and College Union, at which time Mackney was elected Joint general secretary (serving alongside Sally Hunt). He retired from union service in May 2007. He then worked part-time as an Associate Director of the National Institute of Adult Continuing Education (NIACE) until May 2009 when he took ill-health retirement.", "Mackney worked to improve the effectiveness and strength of NATFHE by seeking a merger of the trade union with the Association of University Teachers. Merger of the two unions occurred in 2006. Mackney was elected Joint general secretary along with AUT leader Sally Hunt. The new trade union represented about 120,000 academics and academic-related staff in further and higher education throughout the United Kingdom."]}, {"page": "Christopher Snowden", "response": ["There was additional criticism of a substantial pay increase, including by UCU general Secretary Sally Hunt. However this was later clarified as being the difference between Snowden's payment for his first 10 months in his role in 2015-16 compared to his salary first full 12 months in employment in the academic year 2016-17."]}, {"page": "University and College Union", "response": ["UCU was formed by the merger on 1 June 2006 of the Association of University Teachers (AUT) and the National Association of Teachers in Further and Higher Education (NATFHE).  For its first year, a set of transitional rules was in place until full operational unity was achieved in June 2007.  During the first year of the new union the existing General Secretaries (Sally Hunt and Paul Mackney) remained in post, managing the union’s day-to-day business jointly. Paul Mackney did not stand for General Secretary of UCU owing to ill-health and Sally Hunt was elected general secretary of the union on 9 March 2007, and took office on 1 June 2007.", "Sally Hunt was re-elected twice, in 2012 and 2017, but was then forced to resign due to health reasons in February 2019.", "The Jewish Leadership Council (JLC) wrote to the Equalities and Human Rights Commission (EHRC) to express its concern, while a letter of protest was sent to UCU General Secretary Sally Hunt from Mick Davis (chair of trustees of the JLC), Gerald M. Ronson (trustee of the JLC and chairman of the Community Security Trust (CST)), Vivian Wineman (president of the Board and chair of the Council of Membership of the JLC) and Sir Trevor Chinn CVO (vice-president of the JLC). Wineman, also wrote to university vice chancellors asking them to consider whether maintaining a normal relationship with UCU was compatible with their requirement to \"eliminate discrimination and foster good relations\" with minorities. Representatives of the JLC, the Board and the Community Security Trust appealed to government ministers David Willetts and Eric Pickles to support a formal EHRC investigation into the decision, and Ariel Hessayon, a lecturer at Goldsmiths University, resigned from the UCU in protest at the union's disassociation from the EU's discussion paper. NB: The article inaccurately states that Hessayon is a professor; he is not—see Goldsmith's website. Sally Hunt responded that the UCU remained opposed to antisemitism and asked for a meeting with Jewish leaders to help write an \"acceptable\" definition of anti-Jewish prejudice.", ":2006: Sally Hunt and Paul Mackney", ":2007: Sally Hunt"]}, {"page": "Academic boycott of Israel", "response": ["In 2011, Ronnie Fraser unsuccessfully sued the UCU for violation of the Equality Act 2010, alleging repeated antisemitic harassment by fellow UCU members.  Under cross-examination, UCU general secretary Sally Hunt admitted that Fraser \"would be entitled to infer ... that the union was not taking antisemitism seriously.\" The UCU later ceased to promote anti-Israel boycotts.Fraser, Ronnie. \"Fraser versus the University College Union: A Personal Reflection.\" Anti-Zionism on Campus: The University, Free Speech, and BDS, edited by Andrew Pessin and Doron S. Ben-Atar, Indiana University Press, 2018, pp. 105-121."]}, {"page": "General Council of the Trades Union Congress", "response": ["|rowspan=2| Sally Hunt", "| rowspan=7 | Sally Hunt", "|rowspan=2| Sally Hunt"]}, {"page": "2018–2021 UK higher education strikes", "response": ["UCU general secretary Sally Hunt said that preparations for strikes during the exam period would be made, while urgently seeking further talks.See further 'How we got to yesterday and what's next' (14 March 2018).", "On 1–3 June, a tumultuous UCU congress included calls for the general secretary, Sally Hunt, to resign over what was perceived to be undemocratic practice within the Union's prosecution of the dispute. Much of the congress's proceedings had to be aborted, and a new congress was proposed for the future.Chris Havergal, 'Sally Hunt clings on as UCU leader as congress curtailed', Times Higher Education (1 June 2018). (On 18 October a recalled congress saw the withdrawal of motions to call for resignation, but a motion of censure was passed complaining at a lack of transparency and accountability in Hunt's representation of UCU members during the dispute.Jack Grove, 'UCU's Sally Hunt censured over handling of pensions strike', Times Higher Education (18 October 2018).)"]}, {"page": "Jo Grady", "response": ["The General Secretary of UCU, Sally Hunt, stood down in February 2019, and Grady ran in the resulting election.  Her campaign was noted for its strong online presence, and prominent badges and posters.  She defeated Jo McNeill and Matt Waddup, taking 64% of the vote in the final round of voting."]}]}}