{"wiki_id": "http://www.wikidata.org/entity/Q7407961", "itemLabel": "Sam Nicholls", "itemDescription": "fictional character from Holby City", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Nicholls", "wikipedia_page": {"main": "Sam Nicholls is a fictional character from the BBC medical drama Casualty, played by Charlotte Salt. She first appeared in the twenty-sixth series episode \"Mea Culpa\", broadcast on 15 October 2011. Sam is a former major in the Royal Army Medical Corps, who joined the Holby City Hospital Emergency Department on a nine-month secondment, later becoming a Specialty registrar in emergency medicine. Salt was contracted for a year and she spoke with army medics to help her prepare for the role.\nSam is portrayed as being a fearless, headstrong, competitive \"action girl\". Salt said Sam is also haunted by her time in Afghanistan. A few months after her arrival, it emerges that Sam is married to fellow ED doctor Dylan Keogh (William Beck). The estranged couple struggle to stay professional, especially when Sam files for divorce. A storyline arc focusing on whether Sam used excessive force on a patient began in early 2012. A formal complaint is made against Sam, resulting in a General Medical Council hearing. The character's backstory is also explored further in a special Red Button episode set in Afghanistan.\nSam was later given a love interest in Tom Kent (Oliver Coleman). The couple's relationship is tested by her friendship with Iain Dean (Michael Stevenson), but they later marry and make their last appearances in twenty-eighth series episode \"Away in a Manger\", which aired on 14 December 2013. On 25 April 2017, it was announced that Salt had reprised her role as Sam. Salt said she was \"thrilled\" to return and was excited about telling Sam's story once again. Sam returned on 23 September 2017, as a paramedic. During her second stint, Sam has a brief relationship with nurse Jacob Masters (Charles Venn). When Salt wanted to leave the show once more, producers decided to kill her character off, and Sam's final scenes aired in episode 1094, broadcast on 18 August 2018. Sam was well received by critics and viewers.", "link_mentions": [{"page": "Newcastle-under-Lyme", "response": ["*Charlotte Salt, (born 1985), actress as Sam Nicholls in Casualty (TV series)''"]}, {"page": "Sam Nicholls (Casualty)", "response": ["#Redirect Sam Nicholls"]}, {"page": "Characters of Casualty", "response": ["Iain Dean, played by Michael Stevenson, first appears in the red-button special \"Under Fire\", credited as Corporal Dean. The character is introduced as a former Army colleague of Sam Nicholls (Charlotte Salt) whom she had an affair with in Afghanistan. Iain then appears in an episode of Casualty during the twenty-sixth series. Producers reintroduced the character in series 28 as a student paramedic working with Dixie Dixon (Jane Hazlegrove) and Jeff Collier (Matt Bardock). He was involved in a love triangle with Sam and her partner, Tom Kent (Oliver Coleman). Following her departure, Iain's backstory is explored and it is revealed that he is suffering from post-traumatic stress disorder (PTSD). Stevenson was pleased with the story. He becomes involved in a hostage situation involving a distressed Army colleague and his paramedic colleague, Big Mac (Charles Dale). This leads to the character's departure from the series. Series producer Erika Hossington announced in August 2014 that Iain would be reintroduced as a regular character, following Bardock's exit. She wanted to explore Iain and Dixie's partnership following the death of Jeff. He returns in early series 29 for Jeff's funeral, before accepting a paramedic position.", "Jan Jenning, portrayed by Di Botcher, made her first appearance on 19 May 2018. The character and Botcher's casting details were first published in a TV Times interview with Lucy Raffety. Jan is a paramedic and operational duty manager, who takes control of the Holby Ambulance Service. Sophie Dainty of Digital Spy billed Jan as \"bold, brash and bossy\", which makes her clash with her colleagues, especially paramedics Iain Dean (Michael Stevenson) and Sam Nicholls (Charlotte Salt). Raffety joked that Jan would \"read them the riot act and whip them into shape\". Despite her assertive personality, Jan always protects the people on her team. Her backstory states that she is already friends with nurse Lisa \"Duffy\" Duffin (Cathy Shipton). On the character, Dainty commented, \"Give this one a go, she'll grow on you.\"", "On 30 September 2011, it was announced that Oliver Coleman was joining Casualty as Tom Kent, a new pediatrician. Coleman's casting was announced the same time as  Sam Nicholls (Charlotte Salt) his now off screen wife. The BBC said, \"Oliver (28) takes the role of pediatric specialist doctor Tom Kent. Gentle, calm and a brilliant children's doctor, Tom finds his maturity at work doesn't always carry over into his private life.\"  Series producer  Nikki Wilson said of his casting: \"Charlotte and Oliver are incredibly talented, much sought-after actors and we're delighted to welcome them to the new Casualty set in Cardiff. Both new characters are set to inject a shot of excitement into the emergency department and, as ever, both will have an air of intrigue about them.\"", "Tom becomes romantically involved with Sam Nicholls in series 27, where the couple end up kissing after a night out in the pub. Over time, their relationship grows closer, and Tom announces that he wants a committed relationship with her after he gets jealous when another doctor asks her out. A speech exclaiming his feelings towards her and a kiss in the middle of the E.D convinces her that she really loves him. Tom then struggled through a drug addiction due to panic attacks, but Sam helped him through it and he promised to stop taking the drugs. After a short row where Tom hit Sam by accident, Sam forgave him and the two made up, leaving the series 27 finale with a kiss. The couple have returned to their 'happy-in-love' stage, and their relationship grows ever closer. In series 28, Tom decides he wants to propose to Sam but his proposal plan was ruined by Robyn and Iain. Sam hastily proposes to Tom herself, to which he accepts. Sam and Tom marry and leave Holby together for an 'extended honeymoon' and fresh start.", "Dylan Keogh, played by William Beck, made his first appearance on 12 March 2011. Dylan is a Consultant in emergency medicine. He was married to fellow doctor Sam Nicholls (Charlotte Salt) and developed a friendship with Zoe Hanna (Sunetra Sarker). Dylan departed in 2012. On 16 August 2014, it was announced that Casualty were reintroducing a character from the past, but they initially kept the identity of this character a secret. It was later revealed that Beck had reprised his role and Dylan returned on 25 October 2014.", "====Sam Nicholls====", "Sam Nicholls, played by Charlotte Salt, is a Specialty Registrar in Emergency Medicine and a former major in the Royal Army Medical Corps. The character and Salt's casting details were announced on 30 September 2011. Salt's casting was announced the same time as Tom Kent (Oliver Coleman). Sam is billed as an \"ambitious army medic\" who is \"fast-living, fearless and fiery\". Sam also has a connection with another character. On Salt's casting, series producer Nikki Wilson commented, \"Charlotte and Oliver are incredibly talented, much sought-after actors and we're delighted to welcome them to the new Casualty set in Cardiff. Both new characters are set to inject a shot of excitement into the emergency department and, as ever, both will have an air of intrigue about them.\" Sam makes her first appearance in the series 26 episode \"Mea Culpa\", first broadcast on 15 October 2011. Salt and Coleman decided to leave the series in 2013, departing in the series 28 episode \"Away in a Manger\", first broadcast on 14 December 2013.", "Ruby Spark, portrayed by Maddy Hill, made her first appearance on 14 July 2018. Ruby is billed as an \"incredibly conscientious\" and \"naïve\" newly-qualified paramedic, who despite knowing the rules of her job, has lots to learn about being a paramedic. Ruby clashes with paramedics Iain Dean (Michael Stevenson) and Sam Nicholls (Charlotte Salt), although producer Lucy Raffety stated that Ruby would learn from Iain and Sam. Raffety told Emma Bullimore of TV Times that Ruby's introduction builds to the show's thirty-third series, which she billed as the \"Year of the Paramedic\". She also said that seeing paramedic life from Ruby's perspective would be \"heartwarming and heartbreaking\". Hill began filming in February 2018. Hill expressed her delight at joining the cast and commented, \"Ruby is like no one I've ever played before.\" Raffety also expressed her joy at Hill's casting and praised the actress. She hoped that Ruby would become a \"massive hit\" with the audience. Hill appears as Ruby in a crossover two-part episode with Casualty spin-off series, Holby City, originally broadcast in March 2019.", "Less than a year later, Tamzin returns to the hospital after gaining further experience and deciding to try again at Holby. She is thrown into the deep end as she, Jeff and Dixie Dixon (Jane Hazlegrove) go to an accident at a music festival with doctors, Sam Nicholls (Charlotte Salt) and Tom Kent (Oliver Coleman). After some encouragement from Dixie, Tamzin asks Tom if he is single - which doesn't go unnoticed by Sam. Jeff and Tamzin later treat a small child called Lucy whose mother, Taylor, is struggling to cope. Consultant, Dylan Keogh (William Beck) becomes protective over Lucy and becomes angry with Taylor over her care. Tamzin steps in to defend Taylor, leaving Jeff wondering why. He later continues to become concerned over Tamzin when they attend to an injured lap dancer.", "Blake Gardner, played by Kai Thorne, is the son of Elle Gardner (Jaye Griffiths) and Jacob Masters (Charles Venn). He made his first appearance on 3 June 2017, where he was brought into the emergency department after being beaten up at school. Blake developed a crush on his father's coworker, Sam Nicholls (Charlotte Salt), and tried to kiss her. She pushed him away, and he left in embarrassment. In October 2018, Blake met his grandmother Omo, and helped her shopping. On the bus, she began hearing voices due to her schizophrenia, and she left Jacob on the bus."]}]}}