{"wiki_id": "http://www.wikidata.org/entity/Q7405142", "itemLabel": "Sally Geoghegan", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Geoghegan", "wikipedia_page": {"main": "Sally Geoghegan is an English actress. She is best known for playing teacher Jayne (or Jane) Carver in the long-running CBBC school drama Grange Hill between 1995–2002. She left the series when production moved from London to Liverpool.\nSally Geoghegan should not be confused with the geography bee winner of the same name. \nShe has also appeared in Carlton TV's Head Over Heels and BBC One's Bernard and the Genie.\nGeoghegan appeared in the 2002 S Club Juniors video \"One Step Closer\".", "link_mentions": [{"page": "Howards End (film)", "response": ["* Allie Byrne, Sally Geoghegan, Paula Stockbridge, Bridget Duvall, Lucy Freeman, Harriet Stewart, Tina Leslie as Blue-stockings"]}, {"page": "1992 in film", "response": ["| Howards End || Sony Pictures Classics || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Anthony Hopkins, Vanessa Redgrave, Helena Bonham Carter, Emma Thompson, James Wilby, Samuel West, Jemma Redgrave, Prunella Scales, Joseph Bennett, Adrian Ross Magenty, Jo Kendall, Ian Latimer, Simon Callow, Mary Nash, Siegbert Prawer, Susie Lindeman, Nicola Duffett, Mark Payton, Barbara Hicks, Peter Cellier, Crispin Bonham-Carter, Patricia Lawrence, Margery Mason, Peter Darling, Mark Tandy, Anne Lambton, Allie Byrne, Sally Geoghegan  || Period, Drama || Live action"]}, {"page": "Bernard and the Genie", "response": ["* Sally Geoghegan as Waitress"]}, {"page": "Geoghegan", "response": ["* Sally Geoghegan, Grange Hill actress, not to be confused with the geography bee winner of the same name"]}, {"page": "List of Grange Hill characters", "response": ["| Sally Geoghegan "]}, {"page": "Head over Heels (British TV series)", "response": ["Head over Heels is a British television comedy-drama programme lasting one series, which was broadcast on ITV from 11 January to 22 February 1993. It starred Ann Bell as Gracie Ellis, Sally Geoghegan as Catherine Ellis, Kathy Kiera Clarke as Bernadette Brennan and Elena Ferrari as Patsy Willoughby. The programme was produced at the Pinewood Studios.", "*Catherine Ellis – Sally Geoghegan"]}, {"page": "Grange Hill (series 23)", "response": ["Returning cast members included: Stuart Organ (Peter Robson, Lee Cornes (Jeff Hankin), Sally Geoghegan (Jayne Carver), Rachel Bell as (Margaret Holmes), Clive Hill (Dai \"Hard\" Jones), Aidan J. David (James \"Arnie\" Arnold), Colin Ridgewell (Colin Brown), Peter Morton (Wayne Sutcliffe, Kate Bell (Kelly Bradshaw) Laura Hammett (Sarah-Jane Webster), Diana Magness (Evelyn Wright), Oliver Elmidoro (Tom Smith), Charlotte McDonagh (Lisa West), Robert Stuart (Matt Singleton), Jonathon Marchant-Heatley (Sam \"Cracker\" Bacon), Sally Morton (Tracy Long), John Joseph (Ian Hudson), Michael Obiora (Max Abassi), Daniel Lee (Ben Miller), Sam Bardens (Adam Hawkins), Francesco Bruno (Franco Savi), Colin White (Spencer Hargreaves), Arnold Oceng (Calvin Braithwaite), Jalpa Patel (Anika Modi), Lindsey Ray (Amy Davenport), and Adam Sopp (Darren Clarke). Judith Wright and Emma Waters joined as sisters, Emily and Katy Fraser; Emily is a Maths teacher and Katy is a pupil, and are from Australia."]}]}}