{"wiki_id": "http://www.wikidata.org/entity/Q7407998", "itemLabel": "Sam Parkin", "itemDescription": "English footballer (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Parkin", "wikipedia_page": {"main": "Samuel Parkin (born 14 March 1981) is an English former footballer; a radio presenter for BBC Wiltshire, regularly involved with Swindon Town's coverage; and commentator for Chelsea TV. Throughout his career Parkin has played as a forward for Chelsea, Millwall, Wycombe Wanderers, Oldham Athletic, Northampton Town, Swindon Town, Ipswich Town, Luton Town, Leyton Orient, Walsall, St Johnstone, Queen of the South, St Mirren, and most recently Exeter City in League Two.", "link_mentions": [{"page": "Exeter City F.C.", "response": ["At the end of the 2012–13 campaign, poor funds and lack of income led to an unfortunate squad trim with boss Paul Tisdale having to let go: Jamie Cureton, lead goal scorer of the last campaign netting over 21 goals and the 2010 campaign (with similar statistics); Guillem Bauzà, Kevin Amankwaah, unable to renew his contract despite his fan-favourite status and great playing abilities heralding fan chants and songs; Mark Molesley, despite being there only half a season; Rhys Evans and later Tully's new contract was withdrawn due to financial constraints. Despite this Tisdale managed to sign Sam Parkin and Doug Bergqvist."]}, {"page": "Jimmy Davis (footballer)", "response": ["A few days after his death, Swindon dedicated their 4–0 win over Notts County to Davis, with Davis's mother making a speech in front of the Swindon fans before the kick-off. Additionally, Swindon Town took part in a memorial match with his local club Redditch United; Swindon won 2–1 with Sam Parkin scoring the goals. Manchester United paid tribute to him during their 2003 FA Community Shield victory against Arsenal, with both teams wearing black armbands during the match. At the suggestion of captain Roy Keane, United also paid tribute to him after their victory in the 2004 FA Cup Final, when after the final whistle and before the presentation they changed into shirts printed with Davis's name and squad number, 36. Watford commemorated Davis in their next match after his death, a 1–0 win over AFC Bournemouth in the League Cup, with both teams wearing black armbands, the captains placing wreathes and the entire stadium holding a minute's silence before kick-off; at full time, Davis' friend and teammate, Danny Webber, took off his shirt to reveal a vest printed with Davis' name and Watford squad number. England's game against Croatia on 20 August was also preceded by a minute's silence in memory of Davis and former coach Ray Harford, who had died the same day as Davis."]}, {"page": "Rory Fallon", "response": ["Despite the departure of Tommy Mooney, Fallon found himself regularly on the bench in the 2004–05 season. He was loaned out to Yeovil Town to increase his confidence and he scored on his debut against Scunthorpe United. He failed to score in the remainder of the season, but a red card for kicking Huddersfield Town defender David Mirfin in the face meant he missed the opening two games of the following season. After Sam Parkin was sold in summer 2005, Fallon was given greater opportunities to play at Swindon, scoring on his return to action against Nottingham Forest."]}, {"page": "Jack Smith (footballer, born 1983)", "response": ["After originally being offered as a makeweight in a rejected bid to take Sam Parkin to Watford, Smith signed with Swindon Town a free transfer in July 2005, signing a one-year deal. Despite being right-footed, Smith made his debut on the left side of defence on the opening day of the season, in a 2–0 defeat at Barnsley. Doing a steady job without being outstanding, he remained the first choice in this position until retiring with a groin strain during a 0–0 draw at Brentford in October – a result that brought to an end a club record run of eight successive defeats, but an injury that kept Smith out of action for almost a month."]}, {"page": "2006–07 Ipswich Town F.C. season", "response": ["Ipswich were still financially recovering from administration, with limited funds restricting the playing budget. Magilton's first signing as manager saw Alex Bruce arrive from Birmingham City on a free transfer on 2 August 2006. Ian Westlake was sold to Leeds United on 4 August for a reported fee of £400,000, potentially rising to £500,000 with add-ons, in a deal which also saw Dan Harding move in the other direction, signing a three-year deal with Ipswich. French midfielder Sylvain Legwinski also joined on a free transfer from Fulham on 31 August, signing a two year contract with the club. Stikers Sam Parkin and Nicky Forster also debarted for fees, joining Luton Town and Hull City respectively before the end of August. Magilton also utilized the loan market, with midfielders Simon Walton and Mark Noble joining on loan from Charlton Athletic and West Ham United respectively. Republic of Ireland striker Jon Macken also joined on loan until January from Crystal Palace.", "| Sam Parkin"]}, {"page": "History of Swindon Town F.C.", "response": ["On the pitch, Andy King signed the Chelsea reserve striker Sam Parkin, whose 26 goals in 2002-03 saw Swindon finish tenth in Division Two."]}, {"page": "List of Swindon Town F.C. seasons", "response": ["| Sam Parkin (26)", "| Sam Parkin (23)", "| Sam Parkin (24)"]}, {"page": "List of Swindon Town F.C. players", "response": ["|Sam Parkin ||||FW||2002–05 ||142||73"]}, {"page": "List of Swindon Town F.C. records and statistics", "response": ["|style=\"text-align:right;\"|16||style=\"text-align:left;\"|Sam Parkin || 73 || 142 || 0.51"]}, {"page": "2004–05 Football League", "response": ["|6||align=left| Sam Parkin ||align=left| Swindon Town ||23"]}, {"page": "Rob Wolleaston", "response": ["Wolleaston returned to Chelsea but again left on a loan deal ahead of the 2001–02 season, joining Second Division-side Northampton Town with fellow Chelsea youngster Sam Parkin. Wolleaston's debut for Northampton came on 18 August 2001 as they lost 2–0 to Stoke City, going on to make eight appearances in three months for the club, seven in the league, again without scoring a goal. He returned to Chelsea but never appeared in another first-team appearance in another two seasons."]}]}}