{"wiki_id": "http://www.wikidata.org/entity/Q7407807", "itemLabel": "Sam Loggin", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Loggin", "wikipedia_page": {"main": "Samantha \"Sam\" Loggin (born 1977) is an English actress. She was born in Northamptonshire, UK. Her noteworthy performances include the roles of Lucy in Lucy Sullivan Is Getting Married and Anna in Girls in Love.", "link_mentions": [{"page": "Login (disambiguation)", "response": ["* Sam Loggin (born 1977), English actress"]}, {"page": "Girls in Love (TV series)", "response": ["* Sam Loggin as Anna Allard, Ellie's step mother, much younger than her father. Ellie and Anna soon start to be friends after having their ups and downs in the first few episodes."]}, {"page": "The Missing Postman", "response": ["* Sam Loggin       ...     Patricia Flint"]}, {"page": "Lucy Sullivan Is Getting Married", "response": ["The novel was adapted into an 8-hour, sixteen part, television drama series by Carnival Films for the LWT network. It originally aired on ITV in November 1999. It was described as a \"saga about broken hearts and terrifyingly unsuitable boyfriends\" with \"plenty of workplace-mileage to be extracted from Lucy's job at Nudawn Supplies\". Sam Loggin played Lucy. Her flatmates, Charlotte, a promiscuous dippy blonde, and Karen, a bossy Scottish communal financer, were played by Letitia Dean and Zoë Eeles respectively. Other characters included Lucy's three colleagues: sensitive Meredia (Debbie Chazen), loud-mouthed Megan (Sara Stockbridge), and middle-class Hetty (Gwyneth Strong). The group of girls party their way around London looking for would-be husbands or boyfriends. Gerard Butler starred as Lucy's unreliable lover, Gus.", "*Sam Loggin as Lucy Sullivan"]}, {"page": "Loggins", "response": ["* Sam Loggin (born 1977), English actress"]}, {"page": "Press Play", "response": ["* Press Play, a 2006 short film starring Sam Loggin"]}, {"page": "Every Woman Knows a Secret", "response": ["*Sam Loggin as Catherine"]}, {"page": "Judit Schell", "response": ["* Girls in Love: Anna – Sam Loggin"]}, {"page": "The Law (2002 film)", "response": ["* Sam Loggin as Anna Darmon"]}, {"page": "Loggin", "response": ["#REDIRECT Sam Loggin"]}]}}