{"wiki_id": "http://www.wikidata.org/entity/Q7407134", "itemLabel": "Sam Bain", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Bain", "wikipedia_page": {"main": "Sam Bain (born 3 August 1971) is a British comedy writer, best known for the Channel 4 sitcom Peep Show. He attended St Paul's School in London before graduating from the University of Manchester, where he met his writing partner Jesse Armstrong.\n\n", "link_mentions": [{"page": "Jack Docherty", "response": ["In 1997 he was part of the launch of Channel 5 becoming Britain's first five nights a week chat show host on The Jack Docherty Show. The show also featured some of the first television work of writers Kevin Cecil and Andy Riley, Jesse Armstrong and Sam Bain, and writer/performers David Mitchell and Robert Webb. Not The Jack Docherty Show, broadcast when Docherty was on holiday, featured guest hosts including Phill Jupitus, Rich Hall, Melinda Messenger and, most notably, Graham Norton, who was signed by Channel 4 after his stint to host So Graham Norton. Docherty quit the show in 1999 and Channel 5 did not replace him, ending their production of late night chat shows. In 2000, he hosted the BAFTA film awards in London. Notoriously, he began the night by revealing the twist ending to The Sixth Sense, a move that did not go down well with the audience. In 2000 to 2001 he hosted the Radio 2 show Saturday Night Jack which reunited him with his Absolutely colleague Pete Baikie. He was also an occasional host of Radio 2's Friday night arts show."]}, {"page": "British Comedy Awards", "response": ["* Writers' Guild of Great Britain Award: Sam Bain and Jesse Armstrong"]}, {"page": "Peep Show (British TV series)", "response": ["Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb, among others. It was broadcast on Channel 4 from 2003 until 2015. In 2010, it became the longest-running comedy in Channel 4 history in terms of years on air.", "Peep Show follows the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usborne (Webb), two very different, dysfunctional best friends who share a flat in Croydon, South London. Mark is a socially awkward and despondent loan manager, while Jeremy is a childish slacker and unemployed musician who lives in Mark's spare room. Stylistically, the show uses point of view shots—giving the programme its title—with the thoughts of main characters Mark and Jeremy audible as voice-overs. The show is also noted for its veristic portrayal of human life through a general lack of conventional character development in Mark and Jeremy, and their purgatorial lifestyle together from their twenties to their forties as a result of their shared inability to change. The show has been described by co-creator Sam Bain as portraying \"the stubborn persistence of human suffering\", and, through the exploration of existentialism and loneliness, as a realistic portrayal of \"why ordinary people are evil\".", "Writers Jesse Armstrong and Sam Bain met actors/writers Mitchell and Webb during a failed attempt to complete a team-written sitcom for the BBC. They had an old, unproduced script that they wanted to revive called All Day Breakfast and brought in Mitchell and Webb to help out. The show did not work out but the four developed as a partnership, and one idea eventually evolved into Peep Show for Channel 4. Peep Show was originally conceived as a sitcom in the style of Beavis and Butt-head revolving around two characters watching and discussing television. However, the idea was dropped due to the large expense that airing clips from other shows would bring as well as Mitchell and Webb's fear that, because their characters would only be watching television, \"[they] wouldn't be in the show\".", "In May 2019, Sam Bain, co-creator of the original Peep Show series, confirmed in a Guardian article that another US remake is in the works in collaboration with FX Networks. It was being written by Karey Dorenetto and would feature two female leads, but thus far has not come to fruition."]}, {"page": "David Mitchell (comedian)", "response": ["Mitchell and Webb's next project came in 2003, with starring roles in the Channel 4 sitcom Peep Show, as flatmates Mark Corrigan and Jeremy Usbourne respectively. The show originated from writers Jesse Armstrong and Sam Bain's failed attempt to complete a team-written sitcom for the BBC; they had an old script that they wanted to revive and Mitchell and Webb helped out, with it eventually evolving into Peep Show. Despite low viewing figures (which almost got the show cancelled after series three) the show was received to wide critical acclaim. The British Sitcom Guide called it \"without a doubt one of the best sitcoms of the decade.\" Ricky Gervais has been cited as saying \"the last thing I got genuinely excited about on British TV was Peep Show, which I thought was the best sitcom since Father Ted\". The BBC hailed Mitchell's performance in the series, citing that \"As Mark Corrigan, David reached out to all those middle-aged men in a twentysomething's body, who believe drugs are boring and systems are necessary if society is to function at all.\" Mitchell has stated that he empathises with Mark and enjoys playing him and that he \"agrees with many of [Mark's] opinions.\" Peep Show aired for nine series, which makes it the longest-running sitcom in Channel 4 history.", "Their first film, Magicians, was released on 18 May 2007. It was directed by Andrew O'Connor and written by Jesse Armstrong and Sam Bain. Mitchell played the role of a magician named Harry. Later in 2007, the pair recorded a pilot BBC Radio 2 sitcom entitled Daydream Believers, in which Mitchell played Ray, a science-fiction writer. The show was previously a one-off television pilot from Channel 4's Comedy Lab, and also starred Mitchell and Webb."]}, {"page": "Reece Shearsmith", "response": ["In 2012, he appeared in Bad Sugar, a comedy pilot written by Sam Bain & Jesse Armstrong, along with Olivia Colman, Julia Davis and Sharon Horgan. A full series order was cancelled due to availability of the writers and cast. He also appeared in comedy pilot The Function Room."]}, {"page": "That Mitchell and Webb Sound", "response": ["Apart from Mitchell and Webb, a fair proportion of the sketches are written by the other cast members and other writers. These include Jesse Armstrong and Sam Bain (the writers of Peep Show, in which Mitchell and Webb star), Mark Evans, David Quantick, Jonathan Dryden Taylor, Toby Davies, Simon Kane and John Finnemore. It is produced by Gareth Edwards."]}, {"page": "Jesse Armstrong", "response": ["===Collaborations with Sam Bain===", "Armstrong met his writing partner Sam Bain while at the University of Manchester, living with him in his final year. They began writing together after they graduated, when they had both moved to London.", "In 2014 Armstrong, with Danny Boyle, Robert Jones and Sam Bain, co-created the Channel 4 comedy-drama Babylon.  Armstrong wrote the first and last of the six initial episodes and co-wrote the pilot with Sam Bain.", "| Co-written with Sam Bain", "| Co-written with Chris Morris & Sam Bain", "| Co-written with Sam Bain", "| Co-created with Andrew O'Connor & Sam Bain", "| Co-created with Sam Bain", "| Co-created with Sam Bain", "| Co-created with Danny Boyle, Robert Jones, & Sam Bain", "* Ideas Factory interview with Sam Bain and Jesse Armstrong"]}, {"page": "That Mitchell and Webb Look", "response": ["That Mitchell and Webb Look is a British sketch comedy television show starring David Mitchell and Robert Webb.  As well as Mitchell and Webb themselves, the writers include Jesse Armstrong, James Bachman, Sam Bain, Mark Evans, Olivia Colman, Joel Morris, John Finnemore, Simon Kane and others. It was produced by Gareth Edwards. Colman, Bachman, and Evans were also members of the cast, alongside Gus Brown, Sarah Hadland, Daniel Kaluuya and Paterson Joseph. The first two series were directed by David Kerr, and the third and fourth series were directed by Ben Gosling Fuller."]}, {"page": "Ronald Frankau", "response": ["Ronald Frankau had several children including TV producer John Frankau, father of Nicholas Frankau. He had two children with the actress Renée Roberts – Roberta and Rosemary. Rosemary Frankau pursued a career in acting, appearing in many series of the TV sitcom Terry and June as June's best friend Beattie. Rosemary's son, Sam Bain, became a comedy writer and co-created the Channel 4 sitcom Peep Show."]}, {"page": "Magicians (2007 film)", "response": ["Magicians is a 2007 British comedy film released on 18 May 2007. It stars comic duo Robert Webb and David Mitchell as stage magicians Karl and Harry. The two magicians compete together in a magic competition, despite their personal differences. Parts and ideas of the film have been taken to parody the 2006 film The Prestige by Christopher Nolan, though this had not been released when Magicians was filmed (though the original novel by Christopher Priest had been published in 1995). The film is directed by Andrew O'Connor and written by Jesse Armstrong and Sam Bain, who are also the writers of the Channel 4 sitcom Peep Show, which stars Mitchell and Webb. Other principal cast members include Jessica Hynes, Darren Boyd, Steve Edge, Peter Capaldi, and Andrea Riseborough."]}, {"page": "List of Peep Show episodes", "response": ["Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was broadcast on Channel 4 in the United Kingdom. Written by Jesse Armstrong and Sam Bain, the series explores the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usbourne (Webb). It is filmed almost entirely from the physical points-of-view of the characters, and viewers can hear the interior monologues of Mark and Jez."]}, {"page": "Chicago Film Critics Association Award for Best Original Screenplay", "response": ["|Four Lions || Jesse Armstrong, Sam Bain, and Chris Morris"]}, {"page": "List of Old Paulines", "response": ["*Sam Bain (born 1971); screenwriter; co-creator of Peep Show"]}, {"page": "BBC Studios", "response": ["*VAL (Various Artists Limited) (with Sam Bain, Jesse Armstrong, Phil Clarke and Roberto Troni; 20%)"]}, {"page": "Bill Bain (director)", "response": ["In 1968 he married the British actress Rosemary Frankau  and they had two sons Matthew and Sam Bain."]}, {"page": "Julia Frankau", "response": ["She married the London cigar importer Arthur Frankau (1849–1904) in 1883.Todd M. Endelman, \"The Frankaus of London: A Study in Radical Assimilation, 1837-1967\", Jewish History Vol. 8 Nos 1–2, 1994 p. 126 They lived first at 103 Gloucester Terrace (London W), moving to 32a Weymouth Street in the later 1880s.Gilbert Frankau, Self-Portrait, Hutchinson 1940 p15 Two of their three sons were author Gilbert Frankau (1884–1952) and actor Ronald Frankau (1894–1951) (thus Julia Frankau is grandmother of novelist Pamela Frankau and actress Rosemary Frankau, and great-grandmother of bibliographer Timothy d'Arch Smith and scriptwriter Sam Bain), and their daughter was the Cambridge don Joan Bennett (1896–1986), one of the \"constellation of critics\" called by the defence in the Lady Chatterley Trial.Michael Squires (ed.), Lady Chatterley's Lover and \"À Propos of Lady Chatterley's Lover\", Cambridge University Press 1993, Introduction ppxxxviii-xxxix In this connection, Julia herself was credited by Mrs Belloc Lowndes with having been \"one of the very few to recognise the genius of D. H. Lawrence\".Mrs Belloc Lowndes, The Merry Wives of Westminster, Macmillan, 1946, p. 62"]}, {"page": "San Diego Film Critics Society Award for Best Original Screenplay", "response": ["|style=\"text-align:center;\"|2010 || Four Lions ||Chris Morris, Jesse Armstrong, and Sam Bain"]}]}}