{"wiki_id": "http://www.wikidata.org/entity/Q7407943", "itemLabel": "Sam Morsy", "itemDescription": "Egyptian football player (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Morsy", "wikipedia_page": {"main": "Samy Sayed Morsy (born 10 September 1991) is a professional footballer who plays as a defensive midfielder for EFL League One club Ipswich Town, where he is also club captain, and the Egypt national team.\nHe joined the Port Vale youth set-up in 2008, having been released from the Wolverhampton Wanderers Academy. Winning his debut in February 2010, he turned professional at the club in the summer. He established himself in the first-team picture in 2010–11, after which he was given a two-year contract. He helped the club to secure promotion out of League Two in 2012–13. He joined Chesterfield in July 2013, and played for the club in the 2014 final of the Football League Trophy, helping them to win the League Two title in 2013–14. He was sold to Wigan Athletic in January 2016, and helped the club to win the League One title in 2015–16. He joined Barnsley on loan in August 2016, and Wigan were relegated from the Championship upon his return to the club. However he became a key first-team player as they secured an immediate return by winning the League One title again in 2017–18. He was named as Wigan's Player of the Year for the 2019–20 campaign and joined Middlesbrough in September 2020 following administration and relegation at Wigan. He was sold on to Ipswich Town in August 2021.", "link_mentions": [{"page": "Wigan Athletic F.C.", "response": ["|2019–20|| Sam Morsy"]}, {"page": "Jim Gannon", "response": ["Results continued to go against the Vale though, as on 19 March they lost 3–0 at Accrington Stanley, and as a result dropped out of the play-off zone for the first time in the season. Ugly post-match scenes at the Crown Ground saw Geohaghon confront fans who singled him out for abuse, whilst Gannon was ushered quietly out of the back door. Roberts told the media \"I don't think the manager likes me and, to be honest, I don't like him\". Rumours circulated that Gannon would soon be on his way out. These rumours were proved accurate two days later, as Gannon's departure was confirmed by the club. Hugely unpopular with Vale supporters, his sacking was \"quick and with little emotion\", whilst his poor man-management skills helped to earn him the dubious honour of having the shortest reign in the club's history. Despite this he did receive credit for spotting the potential talent in a teenage Sam Morsy, and for bringing Tom Pope to the club. Gannon himself made a statement on his website declaring his disappointment in the club's decision to terminate his contract after such a short period of time, and also bemoaned that he \"wasn't able to add many new players [to the squad]\". The \"Valiants\" continued to struggle under caretaker manager Mark Grew, winning just two of their remaining ten games, and finishing 2010–11 in eleventh place."]}, {"page": "Lee Collins (footballer, born 1988)", "response": ["Collins attended Thomas Telford School as a youth, alongside fellow professionals such as Elliott Bennett and Danny Guthrie. Also attending the school was future Port Vale teammate Sam Morsy. Collins and his partner had three daughters, born in 2010, 2016 and 2017."]}, {"page": "List of Ipswich Town F.C. players", "response": ["Below lists the club captains of Ipswich Town since the club turned professional in 1936. The club's first professional captain was Jimmy McLuckie, who captained the club from 1936 to 1945. Mick Mills has made the highest number of appearances as Ipswich Town captain, having captained the club for 11 years between 1971 and 1982. The club's current captain is Luke Chambers, who has held the captaincy since 2014, after Carlos Edwards left the club. In July 2021, Chambers left Ipswich after making close to 400 appearances in 9 years at the club, having been club captain since 2014. Following Chambers’ departure, new signing Sam Morsy was named club captain in October 2021.", "|scope=\"row\"| Sam Morsy"]}, {"page": "Chris Shuker", "response": ["He began the 2012–13 season in a central midfield partnership with Sam Morsy, rather than in his usual position on the wing. He scored his second and final goal for the club in a League Cup tie against Burnley. He then was in-and-out of the starting line-up, as Ryan Burge staked his claim for a first team spot. Shuker featured 34 times by the end of the campaign, as Vale secured promotion with a third-place finish."]}]}}