{"wiki_id": "http://www.wikidata.org/entity/Q7409550", "itemLabel": "Samir Soni", "itemDescription": "Indian actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Samir_Soni", "wikipedia_page": {"main": "Samir Soni (born 29 September 1968) is an Indian film and television actor, director and former fashion model.\n\n", "link_mentions": [{"page": "1968", "response": ["** Samir Soni, Indian film and TV actor"]}, {"page": "List of Indian male film actors", "response": ["* Samir Soni"]}, {"page": "Mahesh Bhatt", "response": ["As a director and producer, Mahesh Bhatt has a legacy of mentoring many actors and actresses and launching their careers, giving big names to Bollywood. He is notable for launching the careers of Anupam Kher in Saaransh (1984), Rahul Roy, Anu Agarwal and Deepak Tijori in Aashiqui (1990), daughter Pooja Bhatt in Dil Hai Ki Manta Nahin and Sadak (1991), Atul Agnihotri in Sir (1993), Sonali Bendre in Naaraaz (1994), Samir Soni in A Mouthful of Sky (1995), Sharad Kapoor, Sushmita Sen and Mukul Dev in Dastak (1996), Ashutosh Rana in Tamanna (1997), Manoj Bajpayee in Dastak (1996), Tamanna (1997), Dushman (1998) and Sangharsh (1999), Aftab Shivdasani in Kasoor (2001), Dino Morea and Bipasha Basu in Raaz (2002), Aparna Tilak in Footpath (2003), Emraan Hashmi in Footpath and Murder (2004), Mallika Sherawat in Murder (2004), Kunal Khemu in Kalyug (2005), Shiney Ahuja and Kangana Ranaut in Gangster and Woh Lamhe (2006) and Sunny Leone in Jism 2 (2012)."]}, {"page": "Rahul Roy", "response": ["Roy was born to Deepak and Indira Roy and educated at the Lawrence School, Sanawar. He has a brother named Romeer. His maternal uncle is Cory Walia, a renowned name in tinsel town, and on the fashion circuit.Himachal Pradesh Residential schools: Smart learning  at tribuneindia.com, accessed 11 March 2012 He was married to Rajlakshmi Khanvilkar (Rani), a fashion model, who had been previously married to Samir Soni."]}, {"page": "Samir", "response": ["*Samir Soni, Indian actor", "*Samir Soni, Indian film actor"]}, {"page": "1968 in India", "response": ["*29 September – Samir Soni, actor."]}, {"page": "Baghban (2003 film)", "response": ["Baghban () is a 2003 Indian Hindi-language drama film directed by Ravi Chopra. It tells the story of an elderly couple, Raj (Amitabh Bachchan) and Pooja (Hema Malini), who have been married for 40 years. After Raj retires, they reunite with their four sons (Aman Verma, Samir Soni, Saahil Chadha, and Nasir Khan) to discuss who will support them. None of the sons want to take care of both parents, causing Raj and Pooja to live separately.", "* Samir Soni as Sanjay Malhotra"]}, {"page": "Neelam Kothari", "response": ["In October 2000, Neelam married Rishi Sethia, the son of a businessman from the UK. They got divorced soon after. After a brief relationship with actor Samir Soni, she married him in 2011. After 2 years of marriage, in 2013, they adopted a daughter and named her Ahana."]}, {"page": "Salim–Javed", "response": ["| 2003 || Baghban || Ravi Chopra || Amitabh Bachchan, Salman Khan, Hema Malini, Aman Verma, Samir Soni, Mahima Chaudhry, Rimi Sen || Uncredited."]}, {"page": "Vivah", "response": ["*Samir Soni as Sunil Bajpayee: Harish Chandra's elder son; Prem's elder brother; Bhavna's husband; Rahul's father"]}, {"page": "China Gate (1998 film)", "response": ["* Samir Soni... Udit \"Uditanshu\" Tandon"]}, {"page": "Jassi Jaissi Koi Nahin", "response": ["The show follows how Jassi becomes successful at Gulmohur but must face difficulties and trouble created by several people unhappy with her success, one of whom is Armaan's arrogant girlfriend Mallika (Rakshanda Khan). She is forced to disappear when things get too murky and is saved by businessman Purab Mehra (Samir Soni) who eventually becomes responsible for Jassi's makeover so she can hide her real identity and avenge the wrongs done to her and her family. Meanwhile, Armaan falls in love with Jassi, and while mourning her disappearance, is inexplicably attracted to her alter ego Jessica Bedi.", "* Samir Soni as Purab Mehra, a successful businessman who helps Jassi overcome her fears and knows her identity all along (Dead in Episode 388)"]}, {"page": "Bigg Boss (Hindi TV series)", "response": ["|Samir Soni"]}, {"page": "Basti (film)", "response": ["Basti  is a 2003 Indian crime film. The film stars Samir Soni and Faisal Khan in lead roles, with Sheeba in a special guest appearance, Shama Sikander, Govind Namdeo, Sadashiv Amrapurkar and Kulbhushan Kharbanda in supporting roles.", "The film starts with a voice (Kader Khan) narrating a small town of Mumbai. A gangster named Kanta (Sadashiv Amrapurkar) wants to destroy the town and is in a battle with Karanjia (Kulbhushan Kharbanda), who wants to replace the town with a shopping mall. Ramesh \"Rama\" Kulkarni (Samir Soni) returns to his town after several years and is greeted by all of his friends, neighbors and youngest sister, Pinky (Mamta Mishra). It's only Rama's father, Vinayak Kulkarni (Govind Namdeo), a school teacher, who does not greet him and is angered with Rama.", "* Samir Soni as Ramesh \"Rama\" Kulkarni"]}, {"page": "Kumkum – Ek Pyara Sa Bandhan", "response": ["* Samir Soni as Advocate Yash Thakur"]}, {"page": "List of Bollywood films of 2003", "response": ["|Baghban || Ravi Chopra || Amitabh Bachchan, Hema Malini, Sharat Saxena, Aman Verma, Lillete Dubey,Samir Soni, Rimi Sen, Suman Ranganathan, Divya Dutta, Salman Khan, Paresh Rawal, Mahima Chaudhry || Drama, Family", "|Basti ||Basharat Khan || Samir Soni, Faisal Khan || Action"]}, {"page": "List of Bollywood films of 2006", "response": ["|Vivah || Sooraj Barjatya || Shahid Kapoor, Amrita Rao, Mohnish Bahl, Anupam Kher, Samir Soni || Romance, Drama ||"]}, {"page": "List of Bollywood films of 2008", "response": ["|Fashion || Madhur Bhandarkar || Priyanka Chopra, Kangana Ranaut, Arbaaz Khan, Mugdha Godse, Arjan Bajwa, Ashwin Mushran, Samir Soni || Drama, Romance"]}, {"page": "List of Bollywood films of 1998", "response": ["| China Gate || Rajkumar Santoshi || Samir Soni, Mamta Kulkarni, Amrish Puri, Om Puri, Nasseruddin Shah, Danny Denzongpa || Social, War, Action"]}, {"page": "Fashion (2008 film)", "response": ["At Rahul Arora's (Samir Soni) fashion show, Meghna meets supermodel Shonali Gujral (Kangana Ranaut) and is ridiculed by the show's choreographer, Christine, and told to have her portfolio photographed by Kartik (Rohit Roy). To afford Kartik's fees, Meghna shoots a lingerie advertisement; she is mentored by another aspiring model, Janet (Mugdha Godse). Meghna's lingerie photos appear on the cover of a magazine; her relatives in Mumbai see the cover and ask her to leave the house. She moves into an apartment with Maanav. Meghna is noticed by Anisha Roy (Kitu Gidwani), an executive at Panache, a major modeling agency. Anisha introduces her to her superior, Abhijit Sarin (Arbaaz Khan), who is impressed by Meghna's ambition and confidence. Panache's top model is Shonali, but her drug abuse becomes problematic. Abhijit includes Meghna in a fashion show organised by Vinay Khosla, but is replaced after a misunderstanding. Abhijit consoles her, and decides to replace Shonali with Meghna as Panache's new top model.", "* Samir Soni as Rahul Arora, a designer,Janet's best friend and later on husband and biggest supporter and well wisher of Meghana.", "Casting began in October 2007, when Priyanka Chopra signed to play the lead role in the film. Chopra initially refused the role, feeling she would not be able to do it justice. 6 months later, she agreed to appear in the film because of Bhandarkar's confidence in her. The media reported that Chopra was unhappy with the first draft of the film and wanted script changes before signing the film. Bhandarkar was also unhappy with the first draft and agreed to rewrite the script. Kangana Ranaut was cast as the film's second lead; she was pleased with the script and found it challenging, interesting and exciting. In December 2007, Arbaaz Khan and Arjan Bajwa were cast opposite Chopra. After confirming the principal cast, the media reported that Bhandarkar was having difficulty casting the male roles, including that of a homosexual clothing designer. Samir Soni and Harsh Chhaya were cast as the homosexual designers, and model Mugdha Godse was cast in a supporting role. According to Godse, Bhandarkar offered her a part when they were shooting a jewellery advertisement; a year later, she agreed to appear in the film. The Hindustan Times said that several models and designers played themselves, giving the film the appearance of a documentary.", "Chopra said she studied method acting to make her character seem real. The actress said that her character is determined and added, \"While her father wants her to become an accountant she aspires to become the leading model in fashion industry\". Addressing rumours that the film was an exposé of the fashion industry, she said, \"It is nothing like that. Whatever problems that come up to my character in the film are not because of the profession but because of the choices that my character makes in her life\". Ranaut said, \"In this script my character is such that you get to express you emotions, emotions that you have never delivered before in front of the camera. So when I heard the script, it was something new and much more challenging, more interesting and exciting.\" Godse said that she accepted her role in the film because she identified with her character, Janet Sequira, whom she described as \"outgoing, vibrant, bold and outspoken\". Arjan Bajwa described his character, an aspiring fashion model, as uncompromising, achieving success in his own way. Samir Soni found his role as a closeted fashion designer very challenging, requiring research to flesh out the character and his personality. Soni's greatest challenge was to avoid a stereotypical homosexual character, instead subtly expressing his sexuality in his personality and relationships with the film's other characters."]}, {"page": "Soni (name)", "response": ["*Samir Soni, actor"]}, {"page": "List of Punjabi people", "response": ["* Samir Soni"]}, {"page": "A Mouthful of Sky", "response": ["* Samir Soni as Ashok Mathur"]}, {"page": "Hello Friends (TV series)", "response": ["*Samir Soni"]}]}}