{"wiki_id": "http://www.wikidata.org/entity/Q7405306", "itemLabel": "Sally Talbot", "itemDescription": "Australian politician (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sally_Talbot", "wikipedia_page": {"main": "Sally Elizabeth Talbot (born 22 March 1953) is an Australian politician. She has been a Labor Party member of the Western Australian Legislative Council since 2005, representing the region of South West.", "link_mentions": [{"page": "Murdoch University", "response": ["*Sally Talbot - Australian politician, member of the WA Legislative Council, representing Australian Labor Party (Western Australian Branch)"]}, {"page": "Sharryn Jackson", "response": ["After initially considering running for the Division of Brand in the forthcoming 2007 Federal election to replace outgoing member Kim Beazley, Jackson announced in January 2007 that she intended to once again seek Labor Party endorsement for the seat of Hasluck. She also signalled her intention to resign as State President of Labor if she gained endorsement. Silvia Barzotto, from Labor's \"New Right\" faction also nominated, and Jackson was successful. Jackson resigned from her position within the Department of Premier and Cabinet in March 2007, and Sally Talbot succeeded Jackson as State Labor President in June 2007."]}, {"page": "Members of the Western Australian Legislative Council, 2005–2009", "response": ["|| Sally Talbot || Labor || South West || 2005–present"]}, {"page": "Giz Watson", "response": ["During her political career she had portfolio responsibilities for an enormous range of matters, including not only biodiversity, environment and climate change but also health, justice and prisons, human rights, mandatory sentencing, and the over-representation of Aboriginal and Torres Strait Islander peoples in the criminal justice system. In addition, throughout her Parliamentary career Watson maintained a steadfast commitment to the principles of open and accountable government. Her parliamentary career has been characterised by – in her words – \"working in the spirit of consensus but also standing firm on matters of principle\". Watson was the first openly lesbian parliamentarian in Australia and she played a significant role in lesbian and gay law reform in Western Australia. Her parliamentary career also included an active role in the achievement of abortion law reform in Western Australia. Watson's activism in the causes of gay and lesbian rights, social justice, indigenous rights, and peace and environmentalism, together with her parliamentary service made a major contribution to civil and human rights in Western Australia.  Her service and contributions were recognised in 2011 when she was inducted into the Western Australian Women's Hall of Fame. Watson campaigned in parliament on a number of issues, including the banning of uranium mining and radioactive waste disposal in Western Australia. She also campaigned against female genital mutilation since at least 1998, and in 2004 successfully lobbied Jim McGinty, the WA Attorney-General, to introduce laws making the practice a crime. She introduced legislation to manage cats and another to protect WA's biodiversity. Watson and Labor MP Sally Talbot have spoken out against uranium mining, nuclear power, and radioactive waste disposal in WA."]}, {"page": "South West Region (Western Australia)", "response": ["| rowspan=\"7\"|Sally Talbot"]}, {"page": "Candidates of the 2008 Western Australian state election", "response": ["#Sally Talbot*"]}, {"page": "Members of the Western Australian Legislative Council, 2009–2013", "response": ["|| Hon Sally Talbot || Labor || South West || 2005–present"]}, {"page": "Candidates of the 2005 Western Australian state election", "response": ["#Sally Talbot*"]}, {"page": "Women in the Western Australian Legislative Council", "response": ["|Sally Talbot", "  from:2005 till:2022 color:AL text:\"Sally Talbot (2005–present)\""]}, {"page": "Candidates of the 2013 Western Australian state election", "response": ["#Sally Talbot*"]}, {"page": "Uranium in Western Australia", "response": ["There has been some opposition to uranium and nuclear industries in WA, especially since the 2011 Fukushima nuclear disaster, including anti-uranium campaigns from the Conservation Council of Western Australia, Nuclear-Free Alliance, and the Anti-Nuclear Alliance. In the past WA Greens leader Giz Watson and Labor MP Sally Talbot have spoken out against uranium mining, nuclear power and radioactive waste disposal in WA."]}, {"page": "Members of the Western Australian Legislative Council, 2013–2017", "response": ["|| Hon Sally Talbot || Labor || South West || 2005–present"]}, {"page": "Candidates of the 2017 Western Australian state election", "response": ["# Sally Talbot*"]}, {"page": "Members of the Western Australian Legislative Council, 2017–2021", "response": ["|| Hon Sally Talbot || Labor || South West || 2005–present"]}]}}