{"wiki_id": "http://www.wikidata.org/entity/Q7411606", "itemLabel": "Samuel Halkett", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Halkett", "wikipedia_page": {"main": "Samuel Halkett (1814–1871) was a Scottish librarian, now known for his work on anonymous publications.", "link_mentions": [{"page": "Advocates Library", "response": ["Librarian Samuel Halkett began an ambitious catalogue, based on the rules of John Winter Jones for the British Museum catalogue of 1839, but with extensive  biographical information on authors. It was published in six volumes, from 1858 to 1878.Cadell & Matheson, pp. 211–2. Halkett's successor, Thomas Hill Jamieson, had to deal with a fire that damaged some thousands of books on 9 March 1875.", "*1849–1871 Samuel Halkett"]}, {"page": "1871 in the United Kingdom", "response": ["* 20 April – Samuel Halkett, Scottish librarian (born 1814)"]}, {"page": "Thomas Hill Jamieson", "response": ["Jamieson, born in August 1843 at Bonnington, near Arbroath, in Scotland, was educated at the burgh and parochial school of that town, and afterwards (1862) at Edinburgh High School and University. While still at college he acted as a sub-editor of Chambers's Etymological Dictionary, and subsequently became assistant to Samuel Halkett, librarian of the Advocates' Library."]}, {"page": "Warriston Cemetery", "response": ["* Samuel Halkett (1814–1877) librarian and author"]}, {"page": "Edmund Larken", "response": ["*The Miller of Angibault (1847), translated from George Sand, edited by Matilda Hays.Samuel Halkett, John Laing, A Dictionary of the Anonymous and Pseudonymous Literature of Great Britain. Including the Works of Foreigners Written in, or Translated into the English Language vol. 2 (1883, 2006 reprint), cols. 1616–7; Google Books."]}, {"page": "List of works by Arthur Ashley Sykes", "response": ["*Samuel Halkett, Catherine Laing, John Laing, Henry Benjamin Wheatley, A Dictionary of the Anonymous and Pseudonymous Literature of Great Britain (1882)"]}, {"page": "John Laing (bibliographer)", "response": ["After the death of Samuel Halkett in 1871, the materials Halkett had collected for a dictionary of anonymous literature were given to Laing, who more than doubled the collection. He died before the work went to press; with the exception of the indices, it was arranged and edited by his elder surviving daughter, and appeared in four volumes entitled A Dictionary of Anonymous and Pseudonymous Literature of Great Britain, between 1882 and 1888."]}, {"page": "1871 in Scotland", "response": ["* 20 April – Samuel Halkett, librarian (born 1814)"]}, {"page": "1814 in Scotland", "response": ["* 21 June – Samuel Halkett, librarian (died 1871)"]}, {"page": "William Hamilton Reid", "response": ["Some of Reid's compiled works were published anonymously. A satirical play, The Democrat Cured, is not extant. Walks Through London (1817), published under the name David Hughson, which has been attributed to Reid, and to his wife, was by Edward Pugh (died 1813), according to Samuel Halkett and John Laing."]}, {"page": "Halkett and Laing", "response": ["#REDIRECT Samuel Halkett"]}]}}