{"wiki_id": "http://www.wikidata.org/entity/Q741094", "itemLabel": "John Clements Wickham", "itemDescription": "Explorer of Australia (1798-1864)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Clements_Wickham", "wikipedia_page": {"main": "John Clements Wickham (21 November 1798 – 6 January 1864) was a Scottish explorer, naval officer, magistrate and administrator. He was first officer on HMS Beagle during its second survey mission, 1831–1836, under captain Robert FitzRoy. The young naturalist and geologist Charles Darwin was a supernumerary on the ship, and his journal was published as The Voyage of the Beagle. After that expedition, Wickham was promoted to Commander and made captain of the Beagle on its third voyage, from 1837 and conducted various maritime expeditions and hydrographic surveys along the Australian coastline.In 1843, after his retirement from the Royal Navy, Wickham was made Police Magistrate and, later, Government Resident of the Moreton Bay District, in the Colony of New South Wales (NSW). Wickham retired in 1859, when the Moreton Bay District was separated from NSW, forming basis of the Colony of Queensland. When the Queensland and NSW governments disagreed over which was responsible for his pension, Wickham moved to France, where he died.\n\n", "link_mentions": [{"page": "Darwin, Northern Territory", "response": ["The greater Darwin area is the ancestral home of the Larrakia people. On 9 September 1839,  sailed into Darwin Harbour during its survey of the area. John Clements Wickham named the region \"Port Darwin\" in honour of their former shipmate Charles Darwin, who had sailed with them on the ship's previous voyage, which ended in October 1836. The settlement there became the town of Palmerston in 1869, but it was renamed Darwin in 1911. The city has been almost entirely rebuilt four times, following devastation caused by the 1897 cyclone, the 1937 cyclone, Japanese air raids during World War II, and Cyclone Tracy in 1974.", "The Dutch visited Australia's northern coastline in the 1600s and landed on the Tiwi Islands only to be repelled by the Tiwi peoples. The Dutch created the first European maps of the area. This accounts for the Dutch names in the area, such as Arnhem Land and Groote Eylandt. The first British person to see Darwin harbour appears to have been Lieutenant John Lort Stokes of  on 9 September 1839. The ship's captain, Commander John Clements Wickham, named the port after Charles Darwin, the British naturalist who had sailed with them both on the earlier second expedition of the Beagle."]}, {"page": "HMS Beagle", "response": ["FitzRoy had been given reason to hope that the South American Survey would be continued under his command, but when the Lords of the Admiralty appeared to abandon the plan, he made alternative arrangements to return the Fuegians. A kind uncle heard of this and contacted the Admiralty. Soon afterwards FitzRoy heard that he was to be appointed commander of  to go to Tierra del Fuego, but due to her poor condition Beagle was substituted for the voyage. FitzRoy was re-appointed as commander on 27 June 1831 and Beagle was commissioned on 4 July 1831 under his command, with Lieutenants John Clements Wickham and Bartholomew James Sulivan.", "In the six months after returning from the second voyage, some light repairs were made and Beagle was commissioned to survey large parts of the coast of Australia under the command of Commander John Clements Wickham, who had been a lieutenant on the second voyage, with assistant surveyor Lieutenant John Lort Stokes who had been a midshipman on the first voyage of Beagle, then mate and assistant surveyor on the second voyage (no relation to Pringle Stokes). They left Woolwich on 9 June 1837, towed by HM Steamer Boxer, and after reaching Plymouth spent the remainder of the month adjusting their instruments. They set off from Plymouth Sound on the morning of 5 July 1837, and sailed south with stops for observations at Tenerife, Bahia and Cape Town."]}, {"page": "Houtman Abrolhos", "response": ["During Admiralty surveys of the north west coast in 1840, crew from  discovered a brass gun of about three pounds calibre, an iron swivel on which paint still adhered as well as numerous other artefacts signifying European occupation, on the largest island in the Pelsart Group. The commander, John Clements Wickham, named the place Gun Island and the passage between the Easter and Pelsart Groups, Zeewijk Channel. p. 15 Later during the 19th century many islets were used by men collecting guano."]}, {"page": "Tortoise", "response": ["Harriet was a resident at the Australia Zoo in Queensland from 1987 to her death in 2006; she was believed to have been brought to England by Charles Darwin aboard the Beagle and then on to Australia by John Clements Wickham. Harriet died on June 23, 2006, just shy of her 176th birthday."]}, {"page": "Geraldton", "response": ["The explorer George Grey, while on his second disastrous expedition along the Western Australian coast, passed over the future site of Geraldton on 7 April 1839. George Fletcher Moore, the colony's attorney-general, on the colonial schooner Champion, explored the region in January 1840 and discovered Champion Bay. He was followed by Captain John Clements Wickham and Lieutenant John Lort Stokes of , who led an expedition to the area in April 1840, and named and surveyed Point Moore and Champion Bay."]}, {"page": "Burdekin River", "response": ["The river was first discovered by Europeans by John Clements Wickham aboard  in 1839 who named it the Wickham River. In 1849, Ludwig Leichhardt named the river after Thomas Burdekin, one of the sponsors of Leichhardt's expedition.  Because he was inland away from the coast he was not aware it was the same watercourse named by Wickham. The town of Wickham was established on Rita Island at the river mouth but was soon swept away during a flood in the 1860s."]}, {"page": "Harriet (tortoise)", "response": ["Harriet was reportedly collected by Charles Darwin during his 1835 visit to the Galápagos Islands as part of his round-the-world survey expedition, transported to England, and then taken to her final home, Australia, by John Clements Wickham, the retiring captain of the Beagle. However, some doubt was cast on this story by the fact that Darwin had never visited the island that Harriet originally came from.", "In August 1994, a historian from Mareeba published a letter in the local newspaper about two tortoises he remembered at the Botanic Gardens in 1922 and that the keepers of the time were saying that the tortoises had arrived at the Gardens in 1860 as a donation from John Clements Wickham, who was the first lieutenant (and later captain) of  under Fitzroy during the voyage of the Beagle in 1835."]}, {"page": "Bathurst Island (Northern Territory)", "response": ["In 1828, the island was named Bathurst Island by Scottish explorer John Clements Wickham, after the explorer Phillip Parker King's ship which had explored the area in August 1821. He named the island during a voyage in March 1838 when he was second in command of HMS Beagle in Charles Darwin's expedition. The ship's name honours Henry Bathurst, 3rd Earl Bathurst, (1762-1834), former British Secretary of State for the Colonies."]}, {"page": "Kangaroo Point, Queensland", "response": ["In 1823, explorer John Oxley described Kangaroo Point as a \"jungle, fringed with mangroves with the higher land open forest, covered with grass\". During the time of the subsequent convict settlement (1825–1841), Kangaroo Point was cleared and used for cultivation of crops. Subsequently, the area was opened up for free settlement, the first land sales taking place on 13 December 1843. Among the early purchasers was Captain John Clements Wickham, the Police Magistrate and later Government Resident. Surveyor James Warner built the first house at Kangaroo Point in 1844."]}, {"page": "Timeline of Australian history", "response": ["| || 9 September ||HMS Beagle sailed into Darwin Harbour during its surveying of the area. John Clements Wickham named the area Port Darwin in honour of their former shipmate Charles Darwin. The settlement became the town of Palmerston in 1869 and was renamed Darwin in 1911."]}, {"page": "Ayr, Queensland", "response": ["The first British exploration of the area occurred in 1839 during the third voyage of HMS Beagle where Captain John Clements Wickham travelled 10 miles up the waterway later known as the Burdekin River. His progress was stopped by a fishing weir built by the local Aboriginal people that spanned the river."]}, {"page": "City Botanic Gardens", "response": ["The Gardens were also the home for over 100 years for Harriet, a tortoise reportedly collected by Charles Darwin during his visit to the Galápagos Islands in 1835 and donated to the Gardens in 1860 by John Clements Wickham, former commander of  and later Government Resident for Moreton Bay. Harriet was named in honour of Harry Oakman, curator of the Gardens from 1945 to 1962 and the creator of the (now disbanded) zoo at the Gardens. The zoo closed in 1952. Harriet lived out her final years at Australia Zoo until dying in June 2006."]}, {"page": "Caloundra", "response": ["Caloundra Head was previously known as Petrie Point and Point Wickham (or Wickham Point). Point Wickham takes its name from John Clements Wickham, who did a hydrographic survey of the northern section of Moreton Bay in 1846 and was later the Government Resident of Moreton Bay from 1853 to 1859. Point Wickham was in use by 1860, where it was noted on official maps. In an 1892 map it is named \"Caloundra Head (Wickham Point)\" and at some time later the use of Caloundra Head became dominant and the use of the name Point Wickham seems to have discontinued.Queensland Surveyor General's Map of The Catchment Areas of Brisbane River and the Logan and Albert Rivers, July 1893"]}, {"page": "John Lort Stokes", "response": ["Following this, Stokes was promoted to the rank of lieutenant, and served under Commander John Clements Wickham for a survey of Australasian waters. When Wickham was invalided in 1841, Stokes took command of the ship. While Stokes was in command, Beagle surveyed Timor and New Zealand, returning to England in 1843. When he returned he wrote an account of this voyage of the Beagle, which was published in 1846 in two volumes.Volume 1 Volume 2 "]}, {"page": "Supreme Court of Queensland", "response": ["Prior to separation of Queensland from New South Wales, the former naval officer, Captain John Clements Wickham, tried minor crimes in the Moreton Bay District. More serious cases were tried at the Supreme Court of New South Wales in Sydney. Two years before separation from New South Wales, the Moreton Bay Supreme Court Act 1857 (NSW) established the jurisdiction of the Supreme Court of New South Wales in the Moreton Bay District and Samuel Milford served as Judge. Milford resigned in February 1859, and was replaced by Alfred Lutwyche.Initially, the Brisbane Supreme Court served as the Supreme Court for all of Queensland. As the colony's population grew, two other courts were constructed. The first sittings of the Northern Supreme Court were held at Bowen in 1874 and the Bowen Court House was built in 1880 in classical revival style. The Central Supreme Court was officially opened at Rockhampton in 1896. After the opening of the Central Supreme Court at Rockhampton, the Northern Supreme Court moved from Bowen to Townsville. Justice Virgil Power, who served as the first Judge of the Central Supreme Court, was the first Queensland-born Supreme Court Judge. As the population of Queensland has grown, additional courts have been built at locations such as Bundaberg, Mackay, Cairns, Longreach, Maryborough, Roma and Townsville."]}, {"page": "Patrick Leslie", "response": ["In 1845 Leslie acquired 14 hectares of land in his father's name on the banks of Breakfast Creek, Brisbane and built Newstead House (), where he lived while pasturing flocks at Canning Downs. In 1846 he acquired 'Goomburra' on the Darling Downs. Newstead House was sold to his brother-in-law, John Clements Wickham, the following year."]}, {"page": "John Wickham", "response": ["*John Clements Wickham, 19th-century British ship captain — later a police magistrate in Brisbane, Queensland, Australia"]}, {"page": "Wickham, John Clements", "response": ["#redirectJohn Clements Wickham"]}, {"page": "Rowley, East Riding of Yorkshire", "response": ["Also among the 1638 emigrants were two brothers, Richard and Thomas Wickham. Samuel, a son of Thomas, settled in Rhode Island and became a Freeman of the Colony and a Deputy. Another descendant, Captain John Clements Wickham served on the Royal Navy ship  during its voyage with Charles Darwin and was later the first Magistrate and administrator of Queensland."]}, {"page": "Wickham, Western Australia", "response": ["Wickham was established in 1970 by Cliffs Robe River Iron Associates (Robe) and named after John Clements Wickham, the captain of HMS Beagle, who surveyed the north-west coast in 1840."]}, {"page": "Wickham Park, Brisbane", "response": ["thumb|upright|John Clements Wickham", "Wickham Park was named after John Clements Wickham. It was formerly known as the Wickham Terrace Reserve and Wickham Terrace Park."]}, {"page": "Newstead House, Brisbane", "response": ["Newstead House is the oldest surviving home in Brisbane, but not the oldest surviving building, built in 1846, for Patrick Leslie and his wife Catherine (née McArthur).New South Wales fdRegistrar of Births, Deaths and Marriages In 1847 he sold Newstead House to his brother-in-law John Clements Wickham (married to Anna McArthur), the Police Magistrate and Government Resident."]}, {"page": "History of Darwin", "response": ["Lieutenant John Lort Stokes of HMS Beagle was the first British person to spot Darwin harbour on 9 September 1839, 51 years after the first European settlement of Australia. The ship's captain, Commander John Clements Wickham, named the port after Charles Darwin, the English naturalist who had sailed with them both on the earlier second expedition of the Beagle. It was not until 1869 that a permanent European settlement was established by the South Australian Government who had control of the Territory at that time."]}, {"page": "Newstead, Queensland", "response": ["Pride of the suburb is Newstead House, Brisbane’s oldest existing home, built for pioneer Darling Downs squatter Patrick Leslie in 1846. It is set in superb grounds overlooking the mouth of the creek and is within easy walking distance of the famed Breakfast Creek Hotel - a flamboyant Victorian structure which has been described as 'the very soul of Brisbane'. Newstead House’s glory days came during the time of the residence of Captain John Clements Wickham, the official resident and magistrate of the Moreton Bay settlement and a noted and gracious host.  Wickham had previously been Commander of  and sailed with Charles Darwin. While an admission fee must be paid to visit the house, the gardens (now Newstead Park) are a public park."]}, {"page": "Second voyage of HMS Beagle", "response": ["The 27-year-old FitzRoy had hopes of commanding a second expedition to continue the South American survey, but when he heard that the Lords of the Admiralty no longer supported this, he grew concerned about how to return the Fuegians. He made an agreement with the owner of a small merchant-vessel to take himself and five others back to South America, but a kind uncle heard of this and contacted the Admiralty. Soon afterwards, FitzRoy heard that he was to be appointed commander of HMS Chanticleer to go to Tierra del Fuego, but due to her poor condition, Beagle was substituted. On 27 June 1831, FitzRoy was commissioned as commander of the voyage, and Lieutenants John Clements Wickham and Bartholomew James Sulivan were both appointed."]}, {"page": "Hannibal Hawkins Macarthur", "response": ["The couple had at least four daughters. One, Elizabeth (17 May 181527 November 1899), married Philip Gidley King, son of Philip Parker King. Another, Anna (7 December 181623 June 1852), married John Clements Wickham. A third, Catherine (14 June 181810 April 1894) married Patrick Leslie.C.G. Drury Clarke, \"Captain John Clements Wickham, R.N. his antecedents and descendants\" (1984) Journal of the Royal Historical Society of Queensland, Vol. 12 no. 1, pp. 1–25 . A fourth, Emmeline (10 July 1828 – 23 December 1911), married George Farquhar Leslie (brother to Patrick Leslie). A son, John Alexander (January 1827 - June 23, 1904), married Clara Pollard and after her death, Mary Goodrich."]}, {"page": "Wickham", "response": ["* John Clements Wickham (1798–1864), Australian naval officer on Darwin's HMS Beagle, judge in Queensland"]}, {"page": "Australian native police", "response": [" A select committee inquiry into improving the Native Police was implemented and in late 1856 the control of the Native Police was transferred from the Inspector General of Police in Sydney to John Clements Wickham who was the Government Resident in Brisbane. New officers such as Moorhead, Thomas Ross, Walter David Taylor Powell, Francis Allman, Evan Williams, Frederick Carr and Charles Phibbs were appointed. In May 1857, the vacant position of Commandant was filled by E.N.V. Morisset and the headquarters of the Native Police was shifted from Traylan to Cooper's Plains just west of Maryborough. However, even with this reorganisation, strong indigenous resistance continued."]}, {"page": "John Clements", "response": ["*John Clements Wickham (1798–1864), naval officer and judge"]}, {"page": "Easter Group", "response": ["The group was discovered and named in April 1840 by the crew of HMS Beagle, under the command of John Clements Wickham. Stoke's journal, published as Discoveries in Australia in 1846, records the following for April 11: "]}, {"page": "North Island (Houtman Abrolhos)", "response": ["The earliest recorded sighting of North Island occurred in May 1840, during the third survey voyage of HMS Beagle, commanded by John Clements Wickham. It was sighted from the peak of Flag Hill on East Wallabi Island in early May, explored on 22 May, and given its name due to \"its relative position to the remainder of Houtman's Abrolhos\". Before he left the island, Wickham left a letter in a bottle atop the highest hill, which he accordingly christened Record Hill."]}, {"page": "Record Hill", "response": ["Record Island was discovered on 22 May 1840 by John Clements Wickham, Commander during the third voyage of HMS Beagle: \"The highest hill on the south-west point, measuring 42 feet, received the name of Record Hill, from our leaving a paper in a bottle, giving an account of our cruise.\""]}, {"page": "Fish Point (Houtman Abrolhos)", "response": ["It was discovered in May 1840 by John Clements Wickham, Commander during the third voyage of HMS Beagle: "]}, {"page": "Gun Island", "response": ["During Admiralty surveys of the north-west coast in 1840, the crew of HMS Beagle discovered a brass gun of about three pounds calibre and an iron swivel on which paint was still adhered. Captain Stokes, with Commander John Clements Wickham, named the place Gun Island. p. 15 They also discovered several coins, including one dated about 1707 and another dated 1720. Also seen was what appeared to be the beam of a ship with an iron bolt through it, and glass bottles and clay pipes. The material was presumed to have been left there by the Zeewyk castaways 112 years earlier."]}, {"page": "Batavia Road", "response": ["Batavia Road is an anchorage, or roadstead, in the Pelsaert Group of the Houtman Abrolhos, off the coast of Western Australia. It is located at , on the eastern side of Pelsaert Island, near its southern end.Australia 1:100000 Topographic Survey, Map sheet 1640 (Edition 1): Abrolhos Special It was discovered and named in April 1840 by John Clements Wickham, captain of HMS Beagle. Wickham's assistant John Lort Stokes later wrote: "]}, {"page": "Cherokee-class brig-sloop", "response": ["The first voyage of Beagle set out in 1826 under Captain Pringle Stokes as part of Phillip Parker King's survey of South American coasts, which returned late in 1830 with Beagle by then commanded by Robert FitzRoy. Captain Henry Foster commanded HMS Chanticleer on his survey around the South Atlantic, known as his \"pendulum expedition\", from 1827 to 1831. Chanticleer was then intended to be used for FitzRoy's next survey expedition, but was found to be in poor condition. Instead, the Beagle was repaired and modified for its famed second survey voyage from 1831 to 1836, which took along the naturalist Charles Darwin as a self-funded supernumerary. The Beagle subsequently carried out a survey of coasts of Australia from 1837 to 1843 under John Clements Wickham and John Lort Stokes. "]}, {"page": "Flag Hill (Houtman Abrolhos)", "response": ["Although East Wallabi Island was extensively explored by survivors of the 1629 Batavia shipwreck, no records of that event refer specifically to Flag Hill. Accordingly, discovery of the hill is attributed to John Clements Wickham, Commander during the third voyage of HMS Beagle, which surveyed East Wallabi Island in May 1840. Wickham's lieutenant, John Lort Stokes, later wrote: "]}, {"page": "Darwin central business district", "response": ["The first British person to see Darwin harbour appears to have been Lieutenant John Lort Stokes of HMS Beagle on 9 September 1839. The ship's captain, Commander John Clements Wickham, named the port after Charles Darwin, the British naturalist who had sailed with them both on the earlier second expedition of the Beagle."]}]}}