{"wiki_id": "http://www.wikidata.org/entity/Q7412225", "itemLabel": "Samuel Morley", "itemDescription": "British Member of Parliament", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Morley_(MP)", "wikipedia_page": {"main": "Samuel Morley  (15 October 1809 – 5 September 1886), was an English woollen manufacturer and political radical. He is known as a philanthropist, Congregationalist dissenter, abolitionist,  and statesman.", "link_mentions": [{"page": "Stamford Hill", "response": ["Stamford Hill had many eminent Jewish residents, including the Montefiore family. Italian-born Moses Vita Montefiore (died 1789) was living there in 1763. His son Joseph (died 1804) married Rachel Mocatta, and his grandson Abraham Montefiore (died 1824) married Henrietta, whose father, the financier Nathan Meyer Rothschild, lived near the modern Colberg Place from 1818 to 1835. The Montefiores' property a little further south was to be transformed by Abraham's grandson, Claude Montefiore, into Montefiore House school. With the increased development of the area, many distinguished families moved away: In 1842, there were few remaining of the wealthy Jews who had once settled in Hackney.'Hackney: Judaism', A History of the County of Middlesex: Volume 10: Hackney (1995), pp. 145-48. Date accessed: 31 October 2006. The philanthropist and abolitionist MP Samuel Morley had a residence here from about 1860. The gardening writer and cottage gardener Margery Fish was born Margery Townshend in Stamford Hill in 1892.ODNB entry by Catherine Horwood. Retrieved 2 November 2012. Pay-walled."]}, {"page": "Stoke Newington", "response": ["* Samuel Morley MP (1809–1886), businessman, statesman, philanthropist and abolitionist—lived in Stoke Newington."]}, {"page": "List of philanthropists", "response": ["* Samuel Morley MP – founded Morley College, London; endowed other institutions and causes"]}, {"page": "List of political families in the United Kingdom", "response": ["* Samuel Morley, MP 1866-85"]}, {"page": "Baron Hollenden", "response": ["Baron Hollenden, of Leigh in the County of Kent, is a title in the Peerage of the United Kingdom. It was created in 1912 for Samuel Morley, who had previously served as Governor of the Bank of England. He was the son of Samuel Morley and Rebekha Maria Hope and the elder brother of Arnold Morley. Lord Hollenden was succeeded by his son, the second Baron. He was High Sheriff of the County of London in 1917. In 1923 he assumed by deed poll the additional surname of Hope. On his death the title passed to his nephew, the third Baron. He was the only son of the Hon. Claude Hope Hope-Morley, younger son of the first Baron. Lord Hollenden was an Alderman of the City of London.  the title is held by his son, the fourth Baron, who succeeded in 1999."]}, {"page": "Homerton College, Cambridge", "response": ["By 1817, the institution had become known as \"Homerton Academy Society\", later \"Homerton College Society\". At that time, it produced some of the nation's foremost dissenting figures, many closely involved in the movements opposed to the slave trade and the Corn Laws. For several years, the college was affiliated to the University of London, but when its theological function was moved to New College London in 1850, it was re-founded by the Congregational Board of Education to concentrate on the study of education itself. It did so by transferring its theological courses to New College London, of which the Rev. John Harris DD was the Congregationalist Principal, and by extending and rebuilding the old mansion house and 1820s buildings of the academy, at a cost of £10,000. The college reopened in April 1852 as the Training Institution of the Congregational Board of Education, with Samuel Morley as its treasurer. Shortly afterwards, it began admitting women students. Then Principal John Horobin called an end to mixed education in 1896, shortly after the move to Cambridge, and the college remained all-women for 80 years thereafter.", "File:Samuel Morley MP.png|Samuel Morley (MP) (1786–1864) English manufacturer, philanthropist, dissenter, abolitionist, political radical, and statesman.", "| Samuel Morley "]}, {"page": "The Old Vic", "response": ["In 1880, under the ownership of Emma Cons (for whose memory there are plaques outside and inside the theatre) it became the Royal Victoria Hall and Coffee Tavern and was run on \"strict temperance lines\"; by this time it was already known as the \"Old Vic\".'The Royal Victoria Hall –The Old Vic' , Survey of London: Vol. 23. Lambeth: South Bank and Vauxhall (1951), pp. 37–9. Retrieved 28 April 2007. The \"penny lectures\" given in the hall led to the foundation of Morley College. An endowment from the estate of Samuel Morley led to the creation of the Morley Memorial College for Working Men and Women on the premises, which were shared; lectures were given back stage, and in the theatre dressing rooms. The adult education college moved to its own premises nearby in the 1920s."]}, {"page": "Samuel Morley", "response": ["Samuel Morley may refer to:", "*Samuel Morley (VC) (1829–1888), recipient of the Victoria Cross", "*Samuel Morley (MP) (1809–1886), British Member of Parliament and philanthropist", "* Samuel Morley, 1st Baron Hollenden (1845–1929), British businessman", "* Samuel Morley (bishop) (1841–1923), Bishop of Tinnevelly"]}, {"page": "Abney Park Cemetery", "response": ["Earlier in the 19th century, one of the hottest issues for political and social reform was the abolition of slavery, and Stoke Newington and the Quakers, separately and together, played a prominent role in this. Indeed, William Wilberforce himself planned to be buried in the village at St Mary's Church with his sister, his will being overturned on his death since parliament considered a state funeral at Westminster Abbey more fitting. Wilberforce's son-in-law, the abolitionist lawyer James Stephen, was also a frequent visitor, as his father lived at the Fleetwood Summerhouse adjacent to Abney Park. Dr Thomas Binney, the \"Archbishop of Non-conformity\", has a portrait in the National Portrait Gallery that shows him at the Anti-Slavery Society Convention in 1840 (with Josiah Conder); Binney is buried close to the Church Street entrance in Abney Park Cemetery. Christopher Newman Hall, who was influential on the side of slavery emancipation in the American Civil War, is buried here with his father. So is the Rev. James Sherman, who wrote the introduction to Harriet Beecher Stowe's hugely influential Uncle Tom's Cabin. The novel was partly based on Josiah Henson, whose escape to freedom in Britain was assisted by the philanthropist Samuel Morley, who is buried in the cemetery. The Rev. Joseph Ketley, a Congregational missionary and abolitionist in Demerara, is also interred here, as is Rev. Dr John Morison, patron of the escaped slave and influential African-American autobiographer Moses Roper. "]}, {"page": "Christopher Newman Hall", "response": ["After some years at Surrey Chapel it became apparent to Newman Hall and the chapel's trustees that closure was inevitable. A considerable sum had been bequeathed by the chapel's founder for the perpetuation of his work on the expiration of the lease; but, owing to some legal flaw in the will, the bequest had to be given to the residuary legatee, Hackney Itineracy, later known as Hackney College, a non-conformist theological institution co-founded by George Collison. The trustees were faced with the prospect of raising all of the funds needed to buy a new lease on Surrey Chapel, or moving elsewhere. Surrey Chapel on Blackfriars Road was by then a popular religious, educational, and music venue with many associated foundations and charities, but was too small to house all of these. To provide sufficient space, a local temperance hall in Waterloo Road had been leased, and duly renamed Hawkstone Hall - the country seat of relatives of Rev. Rowland Hill. Were a more spacious site found for an entirely new chapel, the trustees might provide on-site facilities for some of the foundations and perhaps acquire a freehold. Costly though this would be, Newman Hall was undaunted by this challenge. Through weekly offertories and donations, and fund-raising in America, he led a campaign to raise sufficient money and loans. A grand building project emerged at the junction of the Kennington and Westminster Bridge Roads on the site of a former Orphan Asylum. It comprised a large new chapel, Christ Church, adjoined by a large lecture hall and school building to which the name Hawkstone Hall was transferred, and an international monument to Abraham Lincoln - the Lincoln Memorial Tower. The whole complex was initially designed by the architect E.C. Robins FRIBA in 1873, and then enlarged and modified by Paull & Bickerdike. Within four years of the new complex being opened by Samuel Morley MP in 1876, the total cost of about £60,000 was cleared."]}, {"page": "T. A. Denny", "response": ["Denny was one of a small group of wealthy benefactors who sustained the Salvation Army in its early years. He attended meetings called in 1877 by Samuel Morley, another benefactor, to discuss differences with William Booth, after which he continued to provide financial support despite continuing to disagree with Booth about doctrine and methods. His support included, in 1881, paying the first year's rent on the organisation's headquarters at 101 Queen Victoria Street in London and supporting the establishment of the Army in France. In 1882 he contributed to the repayment of debts incurred for the building of barracks."]}, {"page": "Morley College", "response": ["Local enthusiasm for these \"penny lectures\" and success in attracting substantial philanthropic funding, led in 1889 to the opening of Morley Memorial College for Working Men and Women. The College was founded by an endowment from Samuel Morley, MP for Nottingham and later Bristol. Samuel Morley is buried at Dr Watts' Walk, Abney Park Cemetery, in Stoke Newington, London."]}, {"page": "Thomas Binney", "response": ["Its eminent members included Samuel Morley MP as well as William Hone and members of his family."]}, {"page": "The Arboretum, Nottingham", "response": ["*Memorial to Samuel Morley (MP) 1920 by Joseph Else Grade II listed."]}, {"page": "Emma Cons", "response": ["Cons also helped found Swanley Horticultural College (which amalgamated with Wye College later part of Imperial College London, a part of University of London before closure in 2009), in 1892, the first such college for women, and she founded Morley College for working men and women, aided by money donated by Bristol based millionaire manufacturer and philanthropist, Samuel Morley.", "In 1882, Samuel Morley began to take an interest in the affairs of the theatre, and in 1884 he joined the executive committee. He contributed a large amount of money to the scheme, and his business advice was of value. Morley College developed from the lectures given at the Old Vic."]}, {"page": "The Bee-Hive (journal)", "response": ["Potter went on to establish the London Working Men's Association (LWMA), with the Bee-Hive as its official journal. The journal continued to advocate rights for trade unions and supported the more radical members of the Liberal Party. Potter took up editing of the Bee-Hive, but it sold poorly and was only saved from bankruptcy when Samuel Morley (a Liberal MP) and Daniel Platt bought up shares in the newspaper in June 1868."]}, {"page": "Arnold Morley", "response": ["Morley was a younger son of Samuel Morley and Rebekah Maria, daughter of Samuel Hope of Liverpool. Lord Hollenden was his elder brother."]}, {"page": "Bristol (UK Parliament constituency)", "response": ["|rowspan=\"4\"| Samuel Morley"]}, {"page": "Aaron Buzacott", "response": ["Greatly influenced by his mother, he was born in South Moulton, Devon where his father was a whitesmith and ironmonger and the family attended the local Congregational chapel. Sarah, his wife, was also from South Moulton, and became known for her educational work and writings in the South Seas mission. Her sisters also married missionaries, and her brother, Mr George Hitchcock, a friend and neighbour of Samuel Morley's at St Paul's Churchyard, became noted for his support of Congregationalism and his support for the nascent YMCA (Young Men's Christian Association)."]}, {"page": "King's Weigh House", "response": ["Reynolds ministered until 1727, then James Wood, 1727–42; William Langford, 1742–75; Samuel Wilton, 1776–1778; and John Clayton 1778–1826. Thomas Binney, 1829–69, was one of the notable Congregational ministers of the nineteenth century. During Binney's time the Weigh House site was required for widening the approaches to London Bridge. In 1833-4 a new building in Fish Street Hill designed by William Tate and seating 1000 people was erected. Prominent members during this period included Samuel Morley and George Williams who founded the YMCA in 1844."]}, {"page": "Samuel Morley, 1st Baron Hollenden", "response": ["Morley was the son of Samuel Morley and Rebekah Maria Hope, daughter of Samuel Hope of Liverpool. The Liberal politician Arnold Morley was his younger brother."]}, {"page": "United Kingdom general election records", "response": ["The first Congregationalist general election victor was Samuel Morley at the 1865 general election."]}, {"page": "Nottingham (UK Parliament constituency)", "response": ["| Samuel Morley"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["* Samuel Morley, MP 1866–85, and son Arnold, MP 1880–95.", "The first Congregationalist general election victor was Samuel Morley at the 1865 general election."]}, {"page": "Reform League", "response": ["During the first few months of the League's existence, it proved important that Howell's role was a full-time one that was paid for by a few wealthy supporters. This enabled him to concentrate on marketing the League in newspapers and communicating announcements of the Reform League's Executive Committee. This helped recruit supporters. New branches were rapidly opened in both London and the provinces. During its first year the League received donations of £621, of which £476 came from rich Radicals such as P.A. Taylor MP, Samuel Morley MP and Sir Wilfred Lawson MP.", "\"Advanced Liberal\" politicians of respectability, who had worked with the League in 1866–7 and had tasted its power to cause reform, were determined not to let the League die at a time when they needed support against Conservative resistance to changes in Ireland. The very wealthy Samuel Morley gave the League £250 in November 1867, followed by £25 from P. A. Taylor and £20 from Abraham Walter Paulton in January 1868, £100 from Titus Salt in April 1868 and £100 from Thomas Thomasson in June 1868. However, Samuel Morley gave another donation of £1,900 which enabled the League to send out numerous \"deputations\" to boroughs where a useful Trade Union and working-class vote might be won for the \"advanced Liberalism\" of the General Election of Nov 1868. Their help was gratefully received and enough \"advanced Liberals\" were elected in Nov 1868 to cause the immediate resignation of Benjamin Disraeli's cabinet."]}, {"page": "List of people from the London Borough of Hackney", "response": ["* Samuel Morley, philanthropist and abolitionist, born in Homerton and lived in Stamford Hill"]}, {"page": "Noel Park", "response": ["*Morley Avenue: Samuel Morley, MP for Bristol and Director of the Artizans Company 1877–1880"]}, {"page": "Surrey Chapel, Southwark", "response": ["These additional premises included a nearby temperance hall (leased for about twenty years from 1844 using a centenary commemoration fund raised by James Sherman in honour of  Rowland Hill, thus renamed Hawkstone Hall after his birthplace); and Lambeth Baths (whose use was paid for by Samuel Morley (MP) for additional Sunday services, meetings, lectures, classes, newspaper readings and musical entertainments). This growth led to the educational institutions of Surrey Chapel becoming probably more extensive than those connected with any free Church in the south of England. It became the nucleus of thirteen Sunday schools, four of them evening Ragged Schools, as well as day schools at Mansfield Street, Harrow Street, Kent Street, and Castle Yard, where more than five thousand children were taught by over four hundred teachers."]}, {"page": "Charlotte Sharman", "response": ["By 1873 Sharman was caring for 206 children. The mansion was in very poor condition, and the order to pull it down led to Sharman deciding to build her own orphanage. On 22 July 1875 the foundation stone of the 'Orphans nest' was laid by the Duchess of Sutherland. Samuel Morley, M.P., presided. On 6 May 1876, exactly nine years after opening her first home, the north wing of the new building was completed. During the building process Sharman moved some of the residents of the smaller houses to Hampton. When the North Wing was opened, some of these Hampton residents were moved back, but others were sent to Gravesend where she had acquired an old building called 'the castle'. The last wing of the new building was completed in 1884. The building still exists and currently (2010) houses the administrative offices of the Imperial War Museum."]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Samuel Morley"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| Samuel Morley"]}, {"page": "John Waddington (minister)", "response": ["In 1846 he moved to Southwark, to Union Street Chapel, the oldest congregational church in the world. He found it in financial difficulties, which at one time threatened to disperse the congregation, but which he eventually overcame. In May 1864, with the support of leading congregationalists such as Thomas Binney and Samuel Morley a new building, under the name The Pilgrim Church. was opened in Buckenham Square; erected as a memorial to the Pilgrim Fathers, several of whom were claimed for the congregation."]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Samuel Morley"]}, {"page": "Borough Welsh Congregational Chapel", "response": ["About 1870 the freehold for the ground on which the chapel stood was purchased and a new chapel was built on the site. The foundation stone was laid on 31 July 1872 by Samuel Morley (MP) a famous Congregationalist, who donated £500 to the new chapel which was opened on Sunday, 23 February 1872. The Chapel today stands in the same place as the old chapel but instead of the entrance facing Little Guildford Street, it now faces Southwark Bridge Road. On 8 August 1881, David Simon Davies from Carmarthen College was ordained as the first Minister."]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Samuel Morley"]}, {"page": "Adriano Cecioni", "response": ["File:Samuel Morley, Vanity Fair, 1872-06-15.jpg|Samuel Morley. Caricature published in Vanity Fair, 1872"]}, {"page": "List of members of the London School Board", "response": ["| Samuel Morley MP", "| Samuel Morley MP"]}, {"page": "List of public art in Nottingham", "response": ["|Samuel Morley "]}]}}