{"wiki_id": "http://www.wikidata.org/entity/Q7412629", "itemLabel": "Samuel Sim", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Sim", "wikipedia_page": {"main": "Samuel Sim is a British composer, record producer, musician and songwriter. His work spans concert music, recordings, arrangements and film and television scores. He writes in full orchestral as well as electronic and contemporary idioms, and is often known for his use of choir and vocal elements in his music.\nRecent releases include the Ivor Novello Award nominated score for the Bafta Award winning series The Mill, the multi-award-winning soundtrack for Home Fires, released 6 May 2016 by Sony Classical Records. and the music to The Halcyon released by Decca Records in January 2017.", "link_mentions": [{"page": "List of film score composers", "response": ["* Samuel Sim"]}, {"page": "Are We Changing Planet Earth?", "response": ["Part of a themed season by the BBC entitled \"Climate Chaos\", the programmes were produced in conjunction with the Discovery Channel and the Open University. They were directed by Nicolas Brown and produced by Jeremy Bristow. The music was composed by Samuel Sim."]}, {"page": "Dunkirk (TV series)", "response": ["**Won: Golden FIPA for TV Series and Serials (Music): Samuel Sim"]}, {"page": "Emma (2009 TV serial)", "response": ["| Samuel Sim", "The original soundtrack with music composed by Samuel Sim was released on 8 December 2009 and features numerous themes featured in the series, including music from the dance sequences during the ball at the Crown Inn. A track listing for the album is as follows:"]}, {"page": "Daniel Pemberton", "response": ["| Netflix miniseries, co-composer with Samuel Sim Original Dark Crystal theme by Trevor Jones"]}, {"page": "Varèse Sarabande albums discography", "response": ["*VSD-00164 The Dark Crystal: Age of Resistance: Volume 2 - Daniel Pemberton / Samuel Sim", "*VSD 888072149618 The Dark Crystal: Age of Resistance: Volumes 1 & 2 - Daniel Pemberton / Samuel Sim"]}, {"page": "International Film Music Critics Association Award for Best Original Score for Television", "response": ["| The Dark Crystal: Age of Resistance || Daniel Pemberton and Samuel Sim || Netflix"]}, {"page": "The Feast", "response": ["Jessica Kiang of Variety had enjoyed \"the chilly control of Jones' filmmaking\", which, according to her, was \"enhanced by the pristine, deadened soundscape\". She also found \"Samuel Sim's atmospheric score, keeps our attention squirming on the hook."]}]}}