{"wiki_id": "http://www.wikidata.org/entity/Q7418476", "itemLabel": "Sanjay Shah", "itemDescription": "businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Sanjay_Shah", "wikipedia_page": {"main": "See also List of people who have lived in airportsSanjay Shah is a Dubai-based British businessman. He founded Solo Capital, a hedge fund firm which closed in 2016, and Autism Rocks, a charitable organization that raises awareness for autism.Shah is a prime suspect in a case regarding the Danish Government being allegedly defrauded of 12.7 billion DKK for (1.65 billion euros) between 2012 and 2015, part of the CumEx-Files involving multiple European nations and involves a number of the world's largest banks such as Barclays, Merrill Lynch, JP Morgan, Morgan Stanley, BNP Paribas, Banco Santander, Macquarie Bank and Deutsche Bank. Shah has admitted his company legally enabled clients to legitimately reclaim around DKK 8 billion from the Ministry of Taxation. He claimed innocence, as the trade was legal and claimed that he was only using legal tax loopholes, where dividend income is taxed differently in various jurisdictions.\n\n", "link_mentions": [{"page": "Trump International Hotel and Tower (Chicago)", "response": ["Two units on the 87th and 88th floors sold for prices in excess of $5 million in 2009 directly from the developer. After a few soft years in the real estate market, it took until August 2014, for units to sell for prices in excess of $1000 per square foot. Two units sold for over $3 million that month including a $3.99 million sale, which was the highest sale price in the building since 2009. The penthouse sold for $17 million in late 2014 to Sanjay Shah, the founder and CEO of Vistex."]}, {"page": "Geoffrey Cox (British politician)", "response": ["On 10 December 2019, Danish media claimed that Geoffrey Cox, as a leading barrister and based on his financial interest declaration to Parliament, had earned £380,000 (3.4 million DKK) in legal fees during the years 2015–2017 for representing Sanjay Shah, a Dubai-based British businessman and prime suspect in what is reported to have been the largest tax fraud case Denmark has ever seen. Shah and his legal team asserted that he only exploited legal loopholes which Denmark had failed to close."]}, {"page": "Sanjay Shah (businessman)", "response": ["#REDIRECT Sanjay Shah "]}, {"page": "Shah (surname)", "response": ["* Sanjay Shah, Dubai-based businessman"]}, {"page": "Zahra Kamalfar", "response": ["*Sanjay Shah"]}, {"page": "SKAT (tax agency)", "response": ["*Sanjay Shah"]}, {"page": "Hiroshi Nohara", "response": ["* Sanjay Shah"]}, {"page": "Feng Zhenghu", "response": ["* Sanjay Shah"]}, {"page": "Sanjay Shah (Businessman)", "response": ["#REDIRECT Sanjay Shah"]}, {"page": "Andrew Baker", "response": ["In April 2021 he dismissed a billion-dollar lawsuit against British \"financier\" Sanjay Shah and several other people. The Danish Tax Agency raised the case in 2018. The case has been rejected on the grounds that it falls under the so-called revenue rule, which is a several hundred year old law. https://www.ft.com/content/84e19602-708f-4d91-adcb-bdf76cff3107"]}, {"page": "2018 Madhya Pradesh Legislative Assembly election", "response": ["|Sanjay Shah"]}, {"page": "CumEx-Files", "response": ["*Sanjay Shah"]}]}}