{"wiki_id": "http://www.wikidata.org/entity/Q7411024", "itemLabel": "Samuel Butcher", "itemDescription": "British Royal Navy admiral (1770-1849)", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Butcher_(Royal_Navy_officer)", "wikipedia_page": {"main": "Vice-Admiral Samuel Butcher (22 November 1770 – 8 May 1849) was an officer of the British Royal Navy during the French Revolutionary and Napoleonic Wars.", "link_mentions": [{"page": "Samuel Butcher", "response": ["Samuel Butcher may refer to:", "*Samuel Butcher (Royal Navy officer) (1770–1849), British naval officer", "*Samuel Butcher (bishop) (1811–1876), his son, Bishop of Meath, 1866–1876", "*Samuel Butcher (classicist) (1850–1910), his son, Anglo-Irish classical scholar and politician"]}, {"page": "John Butcher, 1st Baron Danesfort", "response": ["Butcher was the second son of the Most Reverend Samuel Butcher, Bishop of Meath, the grandson of Vice-Admiral Samuel Butcher (1770–1849), and the younger brother of Samuel Henry Butcher. His mother was Mary, daughter of John Leahy. He was educated at Marlborough College and Trinity College, Cambridge, and was called to the Bar, Lincoln's Inn, in 1878.thepeerage.com John George Butcher, 1st and last Baron Danesfort"]}, {"page": "HMS Guachapin (1801)", "response": ["Captain Charles Penrose of the third rate  captured Guachapin in the Leeward Islands. The London Gazette reports that on 9 April 1800, Sans Pareil captured the Spanish letter of marque trader Guakerpin, of 165 tons burthen (bm), ten guns and 38 men. She belonged to Saint Andero, and was sailing from there to Vera Cruz with a cargo of iron, porter, and linens. The British took her into service and commissioned her in February 1801 under Commander Samuel Butcher."]}, {"page": "Samuel Butcher (bishop)", "response": ["Samuel Butcher PC (9 October 1811 – 29 July 1876) was an Irish Anglican bishop in the Church of Ireland in the 19th century.“A New History of Ireland”, Moody, T.M; Martin, F.X; Byrne, F.J; Cosgrove, F: Oxford Oxford University Press, 1976, Joseph Jackson Howard, Fred Arthur Crisp, Visitation of Ireland vol. 2 (1898) 69.", "Butcher was born in Danesfort, County Kilkenny, the son of Samuel Butcher, a distinguished naval commander, and Elizabeth Anne Herbert. He graduated from Trinity College, Dublin in 1829He was educated at Trinity College, Dublin.Alumni Dublinenses : a register of the students, graduates, professors and provosts of Trinity College in the University of Dublin (1593–1860), George Dames Burtchaell/Thomas Ulick Sadleir p. 121: Dublin, Alex Thom and Co, 1935 and joined the clergy of the Church of Ireland."]}, {"page": "Samuel Butcher (admiral)", "response": ["#REDIRECT Samuel Butcher (Royal Navy officer)"]}]}}