{"wiki_id": "http://www.wikidata.org/entity/Q7411240", "itemLabel": "Samuel Davidson", "itemDescription": "Irish biblical scholar (1807-1898)", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Davidson", "wikipedia_page": {"main": "Samuel Davidson (September 1806 – 1 April 1898) was an Irish biblical scholar.", "link_mentions": [{"page": "Jesus and the woman taken in adultery", "response": ["Beginning with Lachmann (in Germany, 1840), reservations about the pericope became more strongly argued in the modern period, and these opinions were carried into the English world by Samuel Davidson (1848–51), Tregelles (1862),S. P. Tregelles, An Introduction to the Critical Study and Knowledge of the Holy Scripture (London 1856), pp. 465–468. and others; the argument against the verses being given body and final expression in Hort (1886). Those opposing the authenticity of the verses as part of John are represented in the 20th century by men like Cadbury (1917), Colwell (1935), and Metzger (1971).Bruce M. Metzger, A Textual Commentary on the Greek New Testament, Deutsche Bibelgesellschaft, Stuttgart 2001, pp. 187–189."]}, {"page": "1898 in Ireland", "response": ["*1 April – Samuel Davidson, biblical scholar (born 1806)."]}, {"page": "Andrew B. Davidson", "response": ["The final question which may be asked on this topic is whether Davidson ever accepted in full the tenets of the documentary theory of the origin of the Pentateuch. The answer to that question, in as far as it can be answered is that they did not. There are two reasons for this answer, the first of which is that he had studied as was noted earlier under Heinrich Ewald, who had revived Wellhausen's interest in the Hebrew language and history in his teaching, but Ewald never accepted the basis of the documentary hypothesis. The second reason has been reported by Professor Andrew Harper who stated that, \"Consequently, though he recognised the greatness of scholars like Wellhausen, he was never affected by the Wellhausen or other orthodoxies which soon grew up in the critical schools\".J. Strahan, 'Andrew Bruce Davidson,' London 1917, p. 113. Finally, it is a fact that, \"he remained sceptical and even sarcastic of the finer distinctions, to which so many critics have carried literary analysis within the limits of the four main Pentateuchal documents.\"George Adam Smith, 'The Late Professor A.B. Davidson,' The Biblical World, Vol 20 No 3 1902, p.177. A piece of supportive evidence which should be considered is the fact that in a recently published collection of the letters written by Julius Wellhausen to various correspondents around the world not one was ever written to Andrew Bruce Davidson, whereas some 118 were written to and in support of William Roberston Smith.Rudolf Smend, 'Julius Wellhausen Briefe,' Mohr Siebeck  2013, p. 881. It should be further noted that the only Davidson mentioned in Rudolpf Smend's collection is that of Professor Samuel Davidson, to whom 2 letters were addressed."]}, {"page": "Davidson (name)", "response": ["*Samuel Davidson (1807–1898), Irish Biblical scholar"]}, {"page": "Forced conversion", "response": ["During the French Revolution, a campaign of dechristianization happened which included removal and destruction of religious objects from places of worship; English librarian Thomas Hartwell Horne and biblical scholar Samuel Davidson write that \"churches were converted into 'temples of reason,' in which atheistical and licentious homilies were substituted for the proscribed service\".Latreille, A. FRENCH REVOLUTION, New Catholic Encyclopedia v. 5, pp. 972–973 (Second Ed. 2002 Thompson/Gale) Spielvogel (2005):549.Tallet (1991):1"]}, {"page": "James Guinness Rogers", "response": ["In 1857 charges of heresy were brought against Samuel Davidson, who as one of his tutors had taken part in the ordination of Rogers. The main point was an alleged impugning of the Mosaic authorship of the Pentateuch. Nothing contributed more to the expulsion of Davidson from his chair in the Lancashire Independent CollegeNow the British Muslim Heritage Centre than a bitter anonymous pamphlet, \"Dr. Davidson: His Heresies, Contradictions, and Plagiarisms. By Two Graduates\" [Enoch Mellor and Rogers]. Long after, Rogers wrote of Davidson: The controversies of later years separated us, but they never led me to forget or underrate the benefit I derived from his patient, painstaking, and most valuable labours; this contradicts the tone of the, pamphlet, but Rogers was a man who mellowed in many respects as time went on. In 1865 he was chairman of the Lancashire Congregational Union; in the same year he moved to the pastorate of Clapham (Gratton Square) congregational church. Here he ministered till 1900.Dictionary of National Biography, 1912 supplement; Rogers, James Guinness (by Alexander Gordon)"]}, {"page": "5 Maccabees", "response": ["The book survives in Arabic, but was probably composed in Hebrew, judging from numerous Hebraisms. As no trace of a Hebrew text exists, some scholars (e.g. Zunz, Heinrich Graetz and Samuel Davidson) consider the work to have been in Arabic from Hebrew memoirs.  ", "The designation 5 Maccabees was introduced in 1832 by Henry CottonHenry Cotton, trans. The Five Books of Maccabees in English, with Notes and Illustrations. Oxford: Oxford UP, 1832. and perpetuated by Samuel Davidson and others. Alternative titles include Arabic 2 Maccabees and Arabic Maccabees. The name is also used to denote a text contained in the Translatio Syra Peshitto, edited by Ceriani, which however is nothing more than a Syriac version of the 6th book of Josephus' Jewish War."]}, {"page": "John Campbell (minister)", "response": ["Edward Miall had differed with Campbell (the \"Author of Jethro\" of The Patriot) over his British Anti-State Church Association in the early 1840s, and on Christian mission with his The British Churches in Relation to the British People (1849), and came out in due course for Lynch and the liberals. Thomas Binney, seeing the Congregational Union deeply split, intervened as a peacemaker, at cost to his health. James Baldwin Brown published The Way of Peace for the Congregational Union (1857), and found his liberal theology led him subsequently out of Calvinism. Campbell's broader denunciation of \"Germanism\" saw in 1856–7 Samuel Davidson lose his position at Lancashire Independent College, over a new edition of Thomas Hartwell Horne's standard work on biblical criticism, in the face of hostility from Campbell and Recordites."]}, {"page": "1806 in Ireland", "response": ["*September – Samuel Davidson, biblical scholar (died 1898)."]}, {"page": "Temple of Reason", "response": ["A Temple of Reason (French: Temple de la Raison) was, during the French Revolution, a temple for a new belief system created to replace Christianity: the Cult of Reason, which was based on the ideals of reason, virtue, and liberty. This \"religion\" was supposed to be universal and to spread the ideas of the revolution, summarized in its \"Liberté, égalité, fraternité\" motto, which was also inscribed on the Temples. According to the conservative critics of the French Revolution, within the Temple of Reason, \"atheism was enthroned\". English theologian Thomas Hartwell Horne and biblical scholar Samuel Davidson write that \"churches were converted into 'temples of reason,' in which atheistical and licentious homilies were substituted for the proscribed service\"."]}, {"page": "Samuel Cleland Davidson", "response": ["Samuel Davidson quickly gained a reputation as a hard working, trustworthy and successful estate manager.  He applied his agricultural and engineering knowledge to significantly improve crop yields, and to begin mechanising every stage of the archaic and very labour-intensive processes involved in turning plucked tea leaves into a marketable product of consistent quality.  As a person who had not pursued higher education at home, Samuel's innovations mainly came about through persistent experimentation, and his greatest successes were sometimes counter-intuitive to the assumptions of engineers at the time.  Not knowing that what he was trying to achieve with centrifugal fans was considered impossible by more educated mechanical engineers turned out to be a great blessing.  When he later travelled to America to prove to sceptical patent authorities that his design actually worked he said \"An ounce of fact is worth a ton of theory.\" ('The Sirocco Story: Birth and growth of an industry' by Edward Maguire 1958)", "Samuel Cleland Davidson married Clara Mary Coleman in 1873 and they had five children, Annie Davidson 1873–1874 who was born and died in India, Clara May Davidson 1875–1950, James Samuel Davidson 1877–1916, Richard 'Dick' Frederick Davidson 1878–1897 (died of Meningitis aged 18) and Kathleen Davidson 1882–1970. Clara married one of her father's employees, Frederick George Maguire, in 1903. James worked as general manager in his father's business and patented several of his own mechanical engineering developments. He toured the world in 1911 making business deals in Russia, Japan and America, and was expected to eventually take over from his father.  He served as a volunteer with the 1st Battalion North Down Regiment of the Ulster Volunteer Force and during World War I he became a captain in the 13th Royal Irish Rifles. James was shot dead by a German sniper on 1 July 1916, the first day of the Battle of the Somme, aged 39, while being carried back to the British trenches after fighting hard all day and being shot in the knee."]}, {"page": "Thomas Raffles", "response": ["The first professor of biblical criticism at the College was Samuel Davidson, the author of the second volume in the tenth edition, 1856, of the Introduction to the Critical Study and Knowledge of the Holy Scriptures by Thomas Hartwell Horne. In the controversy raised by this publication, which produced Davidson's resignation in 1858, Raffles took the conservative side. On 20 June 1861 his services to the college were acknowledged by the foundation of the Raffles scholarship and the Raffles library."]}, {"page": "William Urwick the younger", "response": ["Born at Sligo on 8 March 1826, he was second son of William Urwick the elder  (1791–1868), nonconformist divine, and his wife Sarah (1791–1852), daughter of Thomas Cooke of Shrewsbury. His early education was under his father. He graduated at Trinity College, Dublin, B.A. in 1848, M.A. in 1851. From Dublin he went on to the Lancashire Independent College, Manchester, where he studied (1848–51) under Robert Vaughan and Samuel Davidson."]}, {"page": "Samuel Davidson Professor of Old Testament Studies", "response": ["The Samuel Davidson Professorship of Old Testament Studies is a chair in Old Testament studies at King's College, London (formerly of the University of London). It was established in 1925 and is named after the Irish Biblical scholar Samuel Davidson.", "==List of Samuel Davidson Professors=="]}]}}