{"wiki_id": "http://www.wikidata.org/entity/Q7416726", "itemLabel": "Sandra Overend", "itemDescription": "Northern Ireland politician (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sandra_Overend", "wikipedia_page": {"main": "Sandra Overend (born 11 May 1973) is an Ulster Unionist Party politician in Northern Ireland. She served as a Member of the Legislative Assembly (MLA) for Mid-Ulster from 2011 to 2017.\nOverend was born near Stewartstown, County Tyrone and educated at Cookstown High School and the University of Ulster. She lives near Bellaghy, County Londonderry. She is married with three children; her father-in-law is former Vanguard politician Robert Overend. She worked in accountancy before taking up employment as office manager for her father Billy Armstrong MLA in 1998. Overend is the Ulster Unionist Party Women's Development Officer.Overend stood unsuccessfully in Mid Ulster at the 2010 UK general election, taking 11% of the vote and fourth place. In 2015, she stood again in Mid Ulster at the 2015 UK general election, taking 15.4% of the vote and second place and overtaking the DUP in Mid Ulster.Overend has said that there must be an equitable solution found for Northern Ireland's dairy farmers or else the industry runs the risk of being strangled by low prices. \"Whilst Thursday's increase in the milk auction, 25.04ppl to 26.22ppl, is to be welcomed we must remember that exactly the same auction last year produced results of 29.53ppl. Therefore whilst milk prices may be rising from their cripplingly low 22ppl only a few months ago, they still have much further to go to simply match last year’s prices.\"\n\n", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": [":Sandra Overend, Ulster Unionist MLA and daughter-in-law of Robert Overend", ":Billy Armstrong, Ulster Unionist MLA and father of Sandra Overend"]}, {"page": "Billy Armstrong", "response": ["He served as Assembly Member for Mid Ulster from 1998 until 2011, when he was succeeded by his daughter, Sandra Overend. He was a member of the Agriculture and Rural Development Committee, the Committee for Enterprise, Trade & Industry and the Committee of the Environment. In 2005, he became the first Ulster Unionist candidate since 1983 to contest Mid Ulster in the Westminster General Election.  "]}, {"page": "Mid Ulster (Assembly constituency)", "response": ["| rowspan=3|Sandra Overend(UUP)"]}, {"page": "List of Ulster University people", "response": ["*Sandra Overend, Ulster Unionist Party MLA since 2011 for Mid. Ulster  "]}, {"page": "Robert Overend", "response": ["Outside politics, he worked as a pig farmer and was chair of the Ulster Pork and Bacon Forum. His daughter-in-law, Sandra Overend, is an Ulster Unionist member of the Northern Ireland Assembly. He also has another two sons and a daughter, Wesley, Nigel and Elizabeth.Deerpark Pedigree Pigs official website, deerpark-pigs.com; accessed 11 November 2015."]}, {"page": "List of members of the 4th Northern Ireland Assembly", "response": ["|Sandra Overend", "|Sandra Overend"]}, {"page": "2017 Northern Ireland Assembly election", "response": ["|Sandra Overend*", "|Sandra Overend"]}, {"page": "List of members of the 5th Northern Ireland Assembly", "response": ["|Sandra Overend", "|Sandra Overend"]}, {"page": "Overend", "response": ["*Sandra Overend (born 1973), Northern Ireland politician"]}]}}