{"wiki_id": "http://www.wikidata.org/entity/Q7417279", "itemLabel": "Sandy Herd", "itemDescription": "Scottish footballer (1902-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sandy_Herd_(footballer)", "wikipedia_page": {"main": "Andrew Clark \"Sandy\" Herd (4 October 1903 – 1 December 1984) was a Scottish professional footballer.\nA miner by trade, Herd started his senior career with Dundee, whom he joined from junior side Hearts of Beath, in 1923. He joined Dunfermline Athletic a year later, helping them to win the Division Two title in 1925–26. He was signed by Hearts in 1927 in a £250 transfer deal, with Colin Dand moving to Dunfermline as part of the agreement.Herd spent ten seasons with the Tynecastle club, making 291 first team appearances in the process. Initially selected as a fullback, he switched to the left half position when Andy Anderson joined the club in 1929, and established himself in the latter role. His half-back combination with Alex Massie and John Johnston proved both durable and successful for Hearts, the trio proving a constant part of the side between 1930 and 1935, and eventually all three would gain selection for the Scottish national team. Herd's sole cap was earned against Ireland in 1935, while he also made one appearance for the Scottish League XI, against the (English) Football League XI in 1934.In 1936, Herd was awarded a joint testimonial match, alongside Northern Irish centre half Willie Reid. Chelsea provided the opposition and Andy Black scored Hearts' goal in a 1–1 draw in front of 8,500 spectators. By now 34, Herd's career was considered to be drawing to a close and he was allowed to leave for Second Division East Fife at the end of the 1936–37 season.\nHerd was to an enjoy an Indian summer with the Methil side though, and in his first season with East Fife they remarkably reached the final of the Scottish Cup. Kilmarnock were their opponents at Hampden Park and the match was drawn 1–1 but Herd suffered an injury which would force him to miss the replay. His replacement John Harvey, loaned from Hearts for the occasion, helped the Fifers to a 4–2 victory, making them the first club from the Second Division to win the trophy. Although he missed the decisive match, Herd had played in every game of East Fife's cup run up to that point, notably scoring twice in their quarter-final defeat of Raith Rovers, and the club successfully petitioned the Scottish FA to allow him to receive a winner's medal.Herd retired in 1939 and emigrated to Melbourne, Australia later that year. His younger brother Alec maintained the family's representation in the professional footballing ranks, playing for Manchester City and representing Scotland in several unofficial wartime internationals during World War II. Herd's nephew, Alec's son David, would also later represent Scotland.", "link_mentions": [{"page": "David Herd (footballer)", "response": ["Born in Hamilton, Lanarkshire, Herd was the son of former Manchester City player Alec Herd and the nephew of Scottish international Sandy Herd."]}, {"page": "Sandy Herd", "response": ["thumb|upright=1.2|Sandy Herd c. 1900"]}, {"page": "Andrew Herd", "response": ["Grandson of Fred Herd Scottish Golfer 1898 US Open Champion & Nephew of Sandy Herd Scottish golfer,", "*Sandy Herd (1868–1944), Scottish golfer, Open Championship winner in 1902", "*Sandy Herd (footballer) (born 1902), Scottish football player (Dundee FC, Dunfermline Athletic, Heart of Midlothian FC, East Fife, Scotland)"]}, {"page": "List of English association football families", "response": ["*  Sandy Herd,  Alec Herd (brother), David Herd (nephew - son of Alec)"]}, {"page": "List of Scottish football families", "response": ["* Sandy Herd, Alec Herd (brother), David Herd (nephew – son of Alec)"]}, {"page": "Hearts of Beath F.C.", "response": ["*Sandy Herd"]}]}}