{"wiki_id": "http://www.wikidata.org/entity/Q7425708", "itemLabel": "Saskia Wickham", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Saskia_Wickham", "wikipedia_page": {"main": "Saskia Wickham (born 14 January 1967) is a former English actress best known for playing Alex Wilton in the drama series Boon and Dr. Erica Matthews in the ITV television drama series Peak Practice between 1996 and 1998.", "link_mentions": [{"page": "The Lion in Winter", "response": ["A radio parody of The Lion in Winter entitled The Leopard in Autumn by Neil Anthony was originally broadcast in BBC Radio 4 in 2001 and 2002 and  re-broadcast on BBC Radio 4 Extra in 2011. Broadcast in two series, it starred David Swift as Prince Ludovico, the ambitious and henpecked ruler of Monte Guano (the smallest and most inconsequential city-state in Renaissance Italy), Siân Phillips as his wife Princess Plethora, Graham Crowden as Francesco (Ludovico's perpetually drunken secretary), Saskia Wickham as Countess Rosalie (Ludovico's mistress [with Plethora's full knowledge and approval]), and as Ludovico's perpetually squabbling sons: Nick Romero as the overly religious Salvatore (whose ambition is to become Pope some day), Paul Bigley as Allesandro (an eternally hopeful would-be artist and inventor) and Christopher Kellen as Guido (a fierce follower of Martin Luther)."]}, {"page": "1996 in film", "response": ["| Angels & Insects || The Samuel Goldwyn Company || Philip Haas (director/screenplay); Belinda Haas (screenplay); Mark Rylance, Patsy Kensit, Kristin Scott Thomas, Jeremy Kemp, Douglas Henshall, Annette Badland, Chris Larkin, Anna Massey, Saskia Wickham, Lindsay Thomas, Michelle Sylvester, Clare Lovell, Jenny Lovell, Oona Haas, Angus Hodder, John Veasey || Romance, Drama || Live action"]}, {"page": "1997 in film", "response": ["| Anna Karenina || Warner Bros. Pictures / Icon Productions || Bernard Rose (director/screenplay); Sophie Marceau, Sean Bean, Alfred Molina, Mia Kirshner, James Fox, Fiona Shaw, Danny Huston, Saskia Wickham, Phyllida Law, David Schofield, Jennifer Caron Hall, Anna Calder-Marshall, Petr Shelokhonov, Vernon Dobtcheff, Larisa Kuznetsova, Jeremy Sheffield, Justine Waddell, Valerie Braddell || Romance, Drama || Live action"]}, {"page": "Sean Bean", "response": ["During the late 1980s and early 1990s, Bean became an established actor on British television. In 1990, Bean starred in Jim Sheridan's adaption of the John B. Keane play The Field. Also in 1990, his role as the journalist Anton in Windprints examined the difficult problems of apartheid in South Africa. He appeared in the BBC productions Clarissa (1991) (with Saskia Wickham and Lynsey Baxter) and Lady Chatterley (1993) (with Joely Richardson). In 1996, he combined his love of football with his career to finally achieve his childhood dream of playing for Sheffield United, starring as Jimmy Muir in the film When Saturday Comes. Although the film was not critically acclaimed, Bean received credit for a good performance. In August 1997, Bean appeared in what became a famous Sky Sports commercial for the upcoming 1997–98 Premier League season. His football related work continued in 1998 when he narrated La Coupe de la Gloire, the official film of the 1998 FIFA World Cup held in France."]}, {"page": "Peak Practice", "response": ["*Erica Matthews – Saskia Wickham (1996–1998)"]}, {"page": "Clarissa", "response": ["The BBC adapted the novel as a television series in 1991, starring Sean Bean, Saskia Wickham, and Sean Pertwee.."]}, {"page": "Monarch of the Glen cast", "response": ["| colspan=\"1\" style=\"background:lightgray;\"| Saskia Wickham (g)"]}, {"page": "List of characters in Monarch of the Glen", "response": ["Abigail Cruttenden / Hilary Maclean / Saskia Wickham ", "*Series 5 - Episode 6 (Saskia Wickham)"]}, {"page": "Angels & Insects", "response": ["* Saskia Wickham as Rowena Alabaster"]}, {"page": "List of former Hollyoaks characters", "response": ["| Anna Blake || Saskia Wickham || 2013"]}, {"page": "Saskia", "response": ["* Saskia Wickham (born 1967), British actress"]}, {"page": "Boon (TV series)", "response": ["The cast included Michael Elphick (Ken Boon) and David Daker (Harry Crawford). Neil Morrissey joined in the second series as Rocky, his first major television role. Other regular characters were played by Rachel Davies (Doreen Evans), Lesley-Anne Sharpe (Debbie Yates), Amanda Burton (Margaret Daly), Elizabeth Carling (Laura Marsh), Brigit Forsyth (Helen Yeldham), Saskia Wickham (Alex Wilton), Joan Scott (Ethel Ellard) and Gordon Warnecke (Hanif Kurtha). Christopher Eccleston had a small role, one of his first."]}, {"page": "Green Wing (series 1)", "response": ["The thirteen main characters appear in all nine episodes of the first series. Amongst the recurring guest characters, Lyndon, Oliver (Ken Charles), Lady Emily \"Emmy\" Lewis Westbrook (Daisy Haggard), Liam (Oliver Milburn), Cordelia Denby (Saskia Wickham) and Charles Robertson (Harley) all appear. However, Charles is credited as \"Chief Executive\" in the episode that he appears. Guest actors who appear in this series include John Oliver, Stephen Merchant, Kevin Eldon and Rosie Cavaliero. Other than Harley, other Green Wing writers make cameos. These include Fay Rusling, Gary Howe, Oriane Messina and Henry James."]}, {"page": "Wickham", "response": ["* Saskia Wickham (born 1967), British actress"]}, {"page": "Janie Dee", "response": ["Janie Dee is married to the actor and barrister Rupert Wickham and they have two children. Her sister-in-law is actress Saskia Wickham."]}, {"page": "Robert Bierman", "response": ["He has three children from his first marriage and three daughters from his second marriage to Saskia Wickham."]}, {"page": "Blue Murder (British TV series)", "response": ["* Saskia Wickham as DCS Louise Hogg (Series 3–5)"]}, {"page": "Demons (TV series)", "response": ["* Saskia Wickham as Jenny Rutherford: Luke's mother fears that he is becoming like his father: vague and always disappearing without telling her why."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["Leah takes a locket belonging to deceased Anna Blake (Saskia Wickham) that had been put in the vent outside the flat of Martha Kane (Carli Norris) and later returns it telling Martha that she had seen Anna’s son Will Savage (James Atherton) getting out of his wheelchair and putting it in a vent, revealing Will as Anna’s killer. Amy brings Leah and Lucas back to the village throughout November to December 2014 as Ste has a drug addiction."]}, {"page": "Ian Charleson Awards", "response": ["*Saskia Wickham, for Sonya in Uncle Vanya (Old Vic Theatre)"]}, {"page": "Arkangel Shakespeare", "response": ["* Saskia Wickham - Helena", "* Saskia Wickham - Lady Anne", "* Saskia Wickham - Silva"]}, {"page": "Leanne Holiday", "response": ["Dennis' cousin, Will Savage (James Atherton) frames Leanne for killing her friend, Texas Longford (Bianca Hendrickse-Spendlove), and she is charged and remanded in custody. When Dennis arrives back he is determined to get Leanne out of prison. Will's mother Anna Blake (Saskia Wickham) later takes the blame for killing Texas and Leanne is released. Dennis proposes to Leanne and she accepts. Leanne looks after Leah Barnes (Ela-May Demircan) and Lucas Hay (William Hall) whilst Lucas' father, Ste Hay (Kieron Richardson), goes to court. Leah overhears Leanne on the phone to Dennis telling him that Ste killed his mother Pauline Hay (Julie Hogarth). Leah runs away but is safely found."]}, {"page": "Prince of Jutland", "response": ["* Saskia Wickham as Gunvor"]}, {"page": "Clarissa (TV series)", "response": ["Clarissa is a 1991 British period drama television miniseries starring Sean Bean, Saskia Wickham and Lynsey Baxter. It aired on the BBC in three episodes between 27 November and 11 December 1991. It was based on the novel Clarissa published in 1747-48 by Samuel Richardson. It follows a virtuous young woman who is oppressed by her ambitious family and a rake who becomes obsessed with her."]}, {"page": "List of Hollyoaks characters (2011)", "response": ["Will admits to his mother Anna Blake (Saskia Wickham) that he killed Texas and she takes the blame because she doesn't want Will to go to prison. Will and Ash start a relationship but when Will discovers Ash is visiting Anna for a work experience placement and hasn't told him, he contemplates killing her. Will visits his mother and tells her that his new girlfriend has been lying to him. Anna is unaware that it is Ash but is concerned that Will's new girlfriend might meet the same fate as Texas. Will lures Ash to a cliff edge and tries to pluck up the courage to push her off but changes his mind when Ash tells him the truth about visiting Anna. Will asks her to change her placement, which she does but not before coming clean to Anna about dating her son. She continues to keep contact with Anna in secret as a friend, behind Will's back. Anna makes Will dump Ash but when Ash threatens to go on the rebound a jealous Will decides he wants her back. Fearing Will will kill Ash, Anna tries to contact him and leaves a message on Ash's phone saying \"he killed Texas and I think he's going to kill again\". Will drugs Ash and steals her visitor's pass to gain entry to the hospital. There he drowns Anna in a bath of water, after discover that his mother loves her ex-husband and Dodger and Sienna more than Dirk and their kids, but is seen escaping from the murder scene by Patrick Blake (Jeremy Sheffield). Will makes sure he is home before Ash awakens so that he can use her as an alibi. Patrick recognises Will's trainers and confronts him but nobody believes Patrick's claims that Will can walk and that he killed Anna. Ash thinks that Patrick killed Anna and Texas and Will breaks into Patrick's flat to try and frame him but Patrick catches him red handed. Will then blackmails Patrick into keeping quiet and the police give out a verdict of accidental death because there is no evidence of murder or suicide.", "Dirk arrives with his family and squats in the McQueen household. He charms Myra into letting him move his campervan into their front garden. The pair have a casual fling, much to the annoyance of the rest of the McQueen household. He also asked her to marry him but she says no she's not ready. Dirk later supports Liberty through her exam results, while more bad news for Dirk, as his son Will was in an accident. After the accident he thinks that Texas Longford (Bianca Hendrickse-Spendlove) was the one who caused the accident and left him paralysed, and found out that Anna Blake (Saskia Wickham) is still alive. Will began to hate him, after he thinks that he betrayed him for Dodger, but, told him that he loved him and cared for him, despite him killing Anna and Texas. In 2015, Will dies, and he attends the funeral alongside his brother Dr. Charles S'avage (Andrew Greenough) and girlfriend Cindy Cunningham (Stephanie Waring). Liberty and his nephew Dennis Savage (Joe Tracini) cannot attend the funeral, along with his adoptive son Dodger and twin sister Sienna Blake (Anna Passey) who had refused to attend."]}, {"page": "Accolade (play)", "response": ["Accolade is a 1950 play by the Welsh playwright Emlyn Williams. Accolade  was first presented in London by H. M. Tennent Ltd, in association with Leland Hayward and Joshua Logan, at the Aldwych Theatre, on 7 September 1950, with Emlyn Williams as Will Trenting and a cast including Diana Churchill, Anthony Nicholls, Dora Bryan, John Cavanah and Noel Willman. It ran for 180 performances.Wearing p.43 It was revived in 2011 at the Finborough Theatre and the cast included Graham Seed, Aden Gillett and Saskia Wickham"]}, {"page": "Jeffry Wickham", "response": ["Jeffry Wickham (5 August 1933 – 17 June 2014) was an English stage, film and television actor. He served as President of the actors' trade union Equity from 1992 to 1994 and was the father of the actress Saskia Wickham and Rupert Wickham. His death after a long illness was announced on 18 June 2014."]}, {"page": "Circles of Deceit", "response": ["* Saskia Wickham as Liz Baker"]}, {"page": "List of Hollyoaks characters (2012)", "response": ["Sienna Blake, played by Anna Passey, made her first screen appearance on 21 November 2012. Daniel Kilkelly from Digital Spy announced the character's introduction to the serial on 7 October 2012. He said that she would be introduced in a \"shock storyline twist\" when established character Dodger Savage (Danny Mac) discovers she is his twin sister. Kilkelly tipped the character to cause \"mayhem\" in the village upon her arrival. It was announced that actress Emily Lawrence would play the character and that the character will be introduced along with her father, Patrick Blake (Jeremy Sheffield). Of her casting, Lawrence said: \"Joining Hollyoaks is going to be fun and a great experience for me. It goes without saying that working with Jeremy is brilliant\". Kilkelly announced on 26 October 2012 that the character had been recast and would instead be played by Anna Passey. Dodger decides to find Patrick and while visiting him sees a girl who he later discovers is Patrick's daughter, Sienna. Dodger reveals that he is Patrick's son but Patrick believes his son is dead as Sienna and Dodger's mother, Anna (Saskia Wickham) told him he was. Mac explained \"It's an afternoon of bombshells because after Dodger proves his real identity, Patrick reveals Sienna is his twin sister\". He added that Sienna and Patrick later arrive in the village and \"try to build a relationship with Dodger\". Official E4 Hollyoaks website describes Sienna being \"swathed in mystery and intrigue\". Passey describes Sienna as a \"very guarded, intelligent and feisty\" character."]}, {"page": "Martha Kane", "response": ["Martha's remaining on-screen children, Ash and Callum, were killed-off during October 2013. The storyline saw Martha arriving at their memorial service drunk and accuses Ash's boyfriend Will Savage (James Atherton) of killing her. Digital Spy released an article announcing that Martha vows to expose Will's lies. When Leah Barnes (Ela-May Demircan) hands Martha a necklace belonging to the deceased Anna Savage (Saskia Wickham) she questions how she came to be in its possession. She explains that Will was hiding it in Martha's flat and is not disabled as he claims to be. Martha realises the extent of Will's lies. Atherton told Digital Spy's Kilkelly that Martha begins to uncover the truth that he murdered Anna and Texas Longford (Bianca Hendrickse-Spendlove). Martha tells Dennis Savage (Joe Tracini) and Dodger Savage (Danny Mac) of her suspicions and they decide to expose him. But Will overhears there conversation, Atherton said \"the wheels are really starting to come off the wagon for him, so he acts in the only way he knows how.\" Martha's discoveries culmulate with Will taking Martha and his family hostage. The show aired the Martha's final scenes on 8 November 2013, when she leaves to stay with her sister and Lacey. Norris had to keep her departure a secret until transmission. Norris told Kilkelly that \"I was originally only meant to be in Hollyoaks for a few episodes, so to be asked to stay for two years was a blessing.\" While Kilkelly noted that Martha was determined to move forward with her remaining family."]}, {"page": "Dodger Savage", "response": ["Mark \"Dodger\" Savage (born Mark Blake) is a fictional character from the British Channel 4 serial drama, Hollyoaks, played by Danny Mac. He made his first on-screen appearance on 7 April 2011 and was introduced as part of the Savage family by creator Paul Marquess. Dodger is played as being a bit \"cocky\" and as thinking he has \"got it all\". For his portrayal, Mac has won and been nominated for various awards. In November 2014 Mac opted to leave the role and Dodger on screen on 20 January 2015. Dodger was the biological son of Patrick Blake (Jeremy Sheffield) and Anna Blake (Saskia Wickham), the twin brother of Sienna Blake (Anna Passey), the adoptive son of Anna's husband Dirk Savage (David Kennedy), the half-brother of Will Savage (James Atherton), Liberty Savage (Abi Phillips) and Minnie Minniver and the father of Nico Blake (Persephone Swales-Dawson) and Myra-Pocahontas Savage-McQueen.", "A stranger, named \"Ellie\" comes to the village and starts looking after Will. Will soon discovers her to be Anna Blake (Saskia Wickham). Dodger is shocked when his mother Anna had arrived at the village, Dirk tells Anna how Will had suffered and was depressed for the whole time she had left. Anna explains to Dodger why she left, and how their father, Patrick, had beaten her. She told Dodger how she tried to kill him and Sienna when they were young, later on, Dodger forgives her. Patrick has her sectioned for this. Will and Dodger continually visits Anna in hospital, Will tries to get Sienna to visit her too. Ash Kane (Will's girlfriend) arrives on Anna's secure unit and before long the two of them become close, Will tells Anna to stay away from Ash, but she doesn't listen."]}, {"page": "Screen Two", "response": ["Cast: John Thaw, Richard Pasco, Nicholas Day, Michael Bryant, Saskia Wickham, Barbara Leigh-Hunt, Clare Higgins, Paul Moriarty, George Harris, Oliver Ford Davies, Alastair Galbraith, Tyrone Huggins, Judith Coke, Martin Jarvis and Judy Damas"]}, {"page": "Ash Kane", "response": ["Ash started a relationship with conman Ally Gorman (Dan O'Connor) which ended when Callum and their mother, Martha Kane (Carli Norris), caught him in bed with their younger sister, Lacey Kane (Georgia Bourke). Ash begins a relationship with Will after his wife, Texas Longford (Bianca Hendrickse-Spendlove) is murdered on their wedding day. When he discovered Ash's patient list he saw his mother Anna Blake's (Saskia Wickham) name on there which angered him. He took her on a picnic near cliffs and when he \"dropped\" his phone and asked Ash to pick it up he stood up behind her, ready to push her off but changed his mind. He made her quit her placement but Ash decided to continue seeing Anna."]}, {"page": "The Leopard in Autumn", "response": ["The Leopard in Autumn starred David Swift as Prince Ludovico, ruler of Monte Guano; Siân Phillips as his wife Princess Plethora; Graham Crowden as Francesco (Ludovico's secretary); Saskia Wickham as Countess Rosalie (Ludovico's mistress) and as Ludovico's perpetually squabbling sons: Nick Romero as the religious Salvatore, Paul Bigley as Allesandro (artist and inventor) and Christopher Kelham as Guido (a staunch Lutheran)."]}, {"page": "Patrick Blake (Hollyoaks)", "response": ["Blake's character is introduced when Dodger decides to find Patrick. Danny Mac said that Dodger is \"shocked\" when he finds Patrick as his house is \"huge with expensive cars on the driveway. It's the opposite to the place where Dodger grew up\". Mac added that Dodger sees a girl when visiting Patrick who he learns is Patrick's daughter. Dodger is \"struck by what a decent, charming, handsome bloke\" Patrick is and reveals he is his son. Patrick does not give Dodger the reaction he was hoping for and is \"adamant that his son Mark - which is Dodger's real name - is dead, because that's what Dodger's mum Anna (Saskia Wickham) told him years ago. It's an afternoon of bombshells because after Dodger proves his real identity, Patrick reveals Sienna is his twin sister\". Mac explained that Patrick and Sienna later arrive in the village and try to build a relationship with Dodger. A writer for the official Hollyoaks website said \"Patrick is a strong, conservative, disciplinarian head-teacher. However, the man that the world knows may not be the same behind closed doors...\" When Jeremy Sheffield appeared on Lorraine, he commented that Patrick was \"nice\", \"intelligent, successful\", but also said that \"there's a whole other side to him which I'm not going to tell you.\"", "Patrick's abusive nature was first revealed, during the casting of Anna Blake (Saskia Wickham), where it was revealed that Anna would tell her children that Patrick was an abusive partner, and that is why she ran away with Dodger. Patrick's abusive nature is then seen, when he intimidates Anna into scaring away Dodger and Sienna by claiming that she doesn't know who her real children actually are. Jeremy Sheffield said of his abuse toward Anna that dominance is what Patrick \"strives for in all of his relationships and all aspects of his life\", and commented that his character saw this as \"completely normal\" instead of abusive."]}, {"page": "Sienna Blake", "response": ["Sienna was raised by her controlling and physically abusive father Patrick Blake (Jeremy Sheffield), after her mentally unstable mother Anna Blake (Saskia Wickham) left with twin brother Mark, known as Dodger Savage (Danny Mac) after trying to kill Sienna and Mark in a murder/suicide attempt. Believing her brother to be dead, she was raised as an only child in a wealthy home. Sienna attended private school but at the age of 13, she had a brief encounter with a teenage boy at a school where her father was working at over the summer. Sienna became pregnant at this time, not knowing that her brief encounter with the teenage boy was in fact her estranged twin brother Dodger, and was locked in a basement whilst she had the baby. She named the baby Sophie, who later turns to be Nico Blake (Persephone Swales-Dawson), however Patrick lied that Nico was stillborn."]}, {"page": "List of Hollyoaks characters (2013)", "response": ["Anna Blake, played by Saskia Wickham, made her first screen appearance on 15 March 2013. Anna and Wickham's casting were announced in the 10 February 2013 edition of the Daily Star. Anna is the estranged mother of Sienna Blake (Anna Passey), Dodger Savage (Danny Mac), Will Savage (James Atherton) and Liberty Savage (Abi Phillips). She is also the former wife of Sienna and Dodger's father Patrick Blake (Jeremy Sheffield) and Will and Liberty's father Dirk Savage (David Kennedy). Anna arrives in Hollyoaks with the revelation that Patrick has abused her, an accusation which he denies. A Hollyoaks insider said that when Anna arrives she \"has a lot of questions to answer. Her children are going to struggle with her reasons for leaving\"."]}, {"page": "List of fictional British politicians", "response": ["* Claudia Seabrook MP (Saskia Wickham), Our Friends in the North"]}, {"page": "Nico Blake", "response": ["Nico Blake (born Sophie Blake, also known as Nico Bradley) was a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Persephone Swales-Dawson. The character made her first screen appearance during the episode broadcast on 6 June 2014. The character and casting was announced on 20 May 2014. Nico is the daughter and niece of established twins characters Dodger Savage (Danny Mac) and Sienna Blake (Anna Passey), the adoptive daughter of Sienna's boyfriend Ben Bradley (Ben Richards), and the granddaughter of Sienna and Dodger's parents Patrick Blake (Jeremy Sheffield) and Anna Blake (Saskia Wickham) and the niece of their half-brother Will Savage (James Atherton) and their half-sisters Liberty Savage (Abi Phillips/Jessamy Stoddart) and Minnie Minniver, and a half-sister and cousin of Dodger's daughter Myra-Pocahontas Savage-McQueen."]}]}}