{"wiki_id": "http://www.wikidata.org/entity/Q7421735", "itemLabel": "Sara Pascoe", "itemDescription": "English writer, stand-up comedian and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sara_Pascoe", "wikipedia_page": {"main": "Sara Patricia Pascoe (born 22 May 1981) is an English comedian and writer. She has appeared on TV programmes including 8 Out of 10 Cats Does Countdown for Channel 4, QI for BBC  and Taskmaster for the digital channel Dave.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Sara Pascoe (born 1981)"]}, {"page": "Catherine Parr", "response": ["In 2015, the Stratford Festival in Stratford Ontario debuted a new play called The Last Wife about Catherine Parr and her relationships with Henry VIII, Thomas Seymour and Henry's three children. The play was written by Kate Hennig. Maev Beaty played Katherine Parr. In the retelling of Henry VIII's sixth wife by Sara Pascoe in Drunk History (UK version, series 2, episode 9) Catherine Parr is portrayed by Emma Bunton."]}, {"page": "List of British comedians", "response": ["*Sara Pascoe (born 1981)"]}, {"page": "The News Quiz", "response": ["* Sara Pascoe"]}, {"page": "QI", "response": ["* Sara Pascoe"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe", "|Sara Pascoe"]}, {"page": "Animal Aid", "response": ["Animal Aid's current patrons are Peter Egan, Sara Pascoe, Carol Royle, Peter Tatchell and Wendy Turner Webster.  It has other celebrity supporters, including Thom Yorke, Stella McCartney, Richard Wilson, Massive Attack, Alexei Sayle, Benjamin Zephaniah, Martin Shaw, Chrissie Hynde, Alan Davies and the Reverend Professor Andrew Linzey. Patrons and supporters now deceased have included Watership Down author Richard Adams, Tony Benn and comedian Spike Milligan. "]}, {"page": "Francesca Martinez", "response": ["In 2014, her best-selling book WHAT THE **** IS NORMAL?! was published by Random House to critical acclaim. It was nominated for the Chortle Comedy 'Best Book' Award and The Bread And Roses Radical Publishing Award. She was described as one of 'Britain's Five Funniest Women' in The Guardian in November 2014, along with Bridget Christie, Sara Pascoe, Katherine Ryan and Susan Calman."]}, {"page": "Jeremy Hardy Speaks to the Nation", "response": ["|2||How To Be a Woman in the 21st Century|||7 Mar 2013||Gordon Kennedy, Sara Pascoe"]}, {"page": "The Big Fat Quiz of the Year", "response": ["|Glow in the Dark Ghosts || Sara Pascoe ||  James Acaster "]}, {"page": "Tonight at the London Palladium", "response": ["| 5 || 7 June 2015 || Jack Whitehall || Simply Red, Jess Glynne, EL Squad, Jack Dagger, The Unkillable Jenny, Leona Lewis, Sara Pascoe and Jack Carroll"]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|Alex Horne – Monsieur Butterfly James Acaster – Recognise Liam Williams – Capitalism Romesh Ranganathan – Rom Wasn't Built in a Day Sam Simmons – Death of a Sails-Man Sara Pascoe – Sara Pascoe vs History"]}, {"page": "Chain Reaction (radio programme)", "response": ["* Katherine Ryan interviewing Sara Pascoe", "* Sara Pascoe interviewing Harry Hill"]}, {"page": "Geoff Lloyd", "response": ["In 2018, Lloyd created and co-produced a comedy talk-show format, 'Am I Normal?', hosted by Sara Pascoe and Aisling Bea, and broadcast on BBC Radio 2."]}, {"page": "Alex Horne", "response": ["In May 2018, Horne presented The Horne Section Television Programme, a musical comedy stage show based on his BBC Radio 4 show, The Horne Section. The show was recorded for UKTV in front of a live audience at the London Palladium and aired on Dave on 24 May. The show featured The Horne Section band as well as performances from comedians Sue Perkins, Sara Pascoe and Joe Wilkinson, drag act and opera singer Le Gateau Chocolat, and Girls Aloud singer Nadine Coyle."]}, {"page": "Chris Shepherd", "response": ["Shepherd directed a short film for Arte France with regular collaborators Autour De Minuit called Brexicuted which premiered in Edinburgh Film Festival on 27 June 2018. and a feature film which he is attached to direct written by David Quantick.  In 2020 he created animations for Sara Pascoe's sitcom with illustrator  Stephen Collins for BBC 2 called Out Of Her Mind. Since lockdown Shepherd has frequently mentioned that he’s writing a graphic novel called Anfield Road."]}, {"page": "Emmy the Great", "response": ["In 2017, she wrote original music for Strangers, a series by the filmmaker Mia Lidofsky, as well as the original songs for comedian Sara Pascoe's stage adaptation of Jane Austen's Pride and Prejudice."]}, {"page": "Saturday Kitchen", "response": ["* Sara Pascoe"]}, {"page": "1981 in the United Kingdom", "response": ["* 22 May – Sara Pascoe, writer and comedian"]}, {"page": "Live at the Apollo (TV series)", "response": ["|Phill Jupitus and Sara Pascoe", "|Sara Pascoe and Nathan Caton", "|Sara Pascoe", "|Sara Pascoe", "* Sara Pascoe", "* Sara Pascoe"]}, {"page": "Havering Sixth Form College", "response": ["* Sara Pascoe, Comedian"]}, {"page": "List of Room 101 episodes", "response": ["|Sara PascoeJonathan RossMichael Vaughan"]}, {"page": "The Unbelievable Truth (radio show)", "response": ["| Lloyd Langford, Henning Wehn, Sara Pascoe, Miles Jupp", "| Lloyd Langford, Henning Wehn, Sara Pascoe, Miles Jupp", "| Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle", "| Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle", "| Frankie Boyle, Miles Jupp, Sara Pascoe, Holly Walsh", "|Holly Walsh, Miles Jupp, Sara Pascoe, Frankie Boyle"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Sara Pascoe and Brian McFadden (Westlife)", "|Sara Pascoe and John Cooper Clarke"]}, {"page": "Great Lives", "response": ["|Sara Pascoe, stand-up comedian"]}, {"page": "So You Think You're Funny", "response": ["*Sara Pascoe (3rd Place)"]}, {"page": "Derek Pascoe", "response": ["Pascoe is the father of writer, stand-up comedian and actress Sara Pascoe."]}, {"page": "Chortle Awards", "response": ["*Breakthrough act, sponsored by Time Out: Sara Pascoe (nominees: John Kearns, Katherine Ryan, Romesh Ranganathan", "File:XIMG 2241.jpg|Sara Pascoe, Breakthrough Act", "*Book Award : Sara Pascoe: Animal (Nominees: Alan Partridge: Nomad, Shappi Khorsandi - Nina Is Not OK, Isy Suttie - The Actual One)"]}, {"page": "Rosa Newmarch", "response": ["Newmarch died in Worthing in 1940, aged 82. She was the great-grandmother of comedian Sara Pascoe."]}, {"page": "The Museum of Curiosity", "response": ["*Sara Pascoe"]}, {"page": "Pascoe", "response": ["*Sara Pascoe (born 1981), British comedian, daughter of Derek"]}, {"page": "Would I Lie to You? (game show)", "response": ["*Sara Pascoe"]}, {"page": "Scroobius Pip", "response": ["In 2014, Scroobius Pip started a weekly podcast series called The Distraction Pieces Podcast. In each episode, he has held an in-depth interview with a range of comedians, actors, musicians and DJs. In the series so far he has interviewed, among others, Aisling Bea, Doc Brown, Goldie, Russell Brand, Josie Long, John Osborne, Paddy Considine, Frank Turner, Stewart Lee, Sara Pascoe, Simon Pegg, Nick Frost, Zane Lowe, Eddie Izzard, Kathy Burke, Richard Herring, Rufus Hound, Stephen Graham, Robin Ince, Wim Hof, James McAvoy, John Cooper-Clarke, Professor Green and Killer Mike."]}, {"page": "Insert Name Here", "response": ["* Sara Pascoe"]}, {"page": "List of Mock the Week episodes", "response": ["|Sara Pascoe and Josh Widdicombe", "|Rob Beckett and Sara Pascoe", "|Sara Pascoe and Josh Widdicombe", "|James Acaster and Sara Pascoe", "|Rob Beckett, Sara Pascoe and Romesh Ranganathan", "|Ed Gamble and Sara Pascoe", "|Rob Beckett, Elis James and Sara Pascoe", "|Rob Beckett, Sara Pascoe and John Robins"]}, {"page": "Eastbury Community School", "response": ["*Sara Pascoe, comedian."]}, {"page": "List of people from the London Borough of Barking and Dagenham", "response": ["* Sara Pascoe – writer, stand-up comedian and actress"]}, {"page": "Amar Latif", "response": ["In 2019, Latif and Sara Pascoe featured in the BBC Two documentary Travelling Blind, in which they explored Istanbul's Grand Bazaar, remote Black Sea-bordering mountains, traditional summer oil wrestling festivities, traditional alpine cattle and bee farming methods and Cappadocia rock formations."]}, {"page": "The Half Moon, Putney", "response": ["It has also hosted comedy, including Billy Connolly, Andy Parsons, Harry Hill, Rufus Hound, Shappi Khorsandi, Norman Lovett, Bob Mills, Milton Jones, Al Murray, Stewart Lee, Richard Herring, Jack Whitehall, Alistair McGowan, Katherine Ryan, Cardinal Burns, Reginald D. Hunter, Stewart Francis, Bridget Christie, Josh Widdicombe, Sara Pascoe, Rob Beckett, Sean Hughes, Kevin Eldon, Henning Wehn, Hal Cruttenden, Holly Walsh, Danny Bhoy, Aisling Bea and James Acaster."]}, {"page": "Larmer Tree Festival", "response": ["The comedy covers all bases with past performers including Josie Long, Mark Watson, Dylan Moran, Sara Pascoe and Nish Kumar, new comers, Edinburgh Festival Fringe previews and live podcast recordings. "]}, {"page": "Frankie Boyle", "response": ["Frankie Boyle's Referendum Autopsy was released on 28 September 2014, and Frankie Boyle's Election Autopsy was released on 17 May 2015, through BBC iPlayer. Featuring guests Katherine Ryan and Sara Pascoe, Boyle dissected the Scottish independence referendum, 2014 and general election. Frankie Boyle's American Autopsy dissected the buildup and fallout of the United States presidential election, tackling topics such as feminism, entertainment, propaganda, and guns. Special guests include Sara Pascoe, Katherine Ryan, Michelle Wolf, Desiree Burch, and Richard Osman."]}, {"page": "Just a Minute", "response": ["*Sara Pascoe"]}, {"page": "Let's Sing and Dance", "response": ["| Sara Pascoe", "| Sara Pascoe"]}]}}