{"wiki_id": "http://www.wikidata.org/entity/Q7422920", "itemLabel": "Sarah Woolgar", "itemDescription": "English stage actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Woolgar", "wikipedia_page": {"main": "Sarah Jane Woolgar (8 July 1824 – 8 September 1909) was an English stage actress. She had leading roles in plays by notable dramatists of the day, including original productions. She had a long association with the Adelphi Theatre in London.", "link_mentions": [{"page": "Charity (play)", "response": ["* Ruth Tredgett, a tramp (aged 37) – Miss Woolgar (Sarah Woolgar?)"]}, {"page": "Walter Goodman (artist)", "response": ["Goodman is also credited with a portrait of the then Duke of Edinburgh (Queen Victoria's second son Alfred). His last Royal Academy submission (1888) was a portrait entitled Mrs. Keeley in her 83rd Year which is recorded as having subsequently found its way to London's bohemian Savage Club, of which the artist was a member from 1873 to 1894 and where his brother Edward was chairman of the committee.New York Times 22 June 1879. p. 2 Another Keeley painting, Mrs. Keeley at Fourscore (now housed at the Garrick Club) was exhibited at Institute of Oil Painters and Bond Street's Burlington GallerySunday Times 26 July 1885 in 1885. Goodman was an admirer of Mary Anne Keeley and her acting family, publishing an appreciation in 1895 entitled The Keeleys on the Stage and at Home, which contains engravings of several of his portrait paintings. Goodman's life interest in the theatre culminated in an appearance with Mrs. Keeley in a full-scale production on the stage of the Prince of Wales Theatre on the night of 16 January 1884. At about the same time he painted the actress, Mrs. Alfred Mellon (née Sarah Woolgar) . Another actress whose portrait Goodman painted was Amy Sedgwick. A year after her death in 1897, her third husband presented the portrait to the Garrick Club, where it remained until 1969.A Catalogue of Pictures in the Garrick Club compiled by C K Adams & published by the Club 1936 Other arts-related personalities who were captured by Goodman's brush included Negro Delineator, E. W. Mackney, the dramatist Henry Pettitt and composer Sir George A. MacFarren (who also sat for Goodman's mother Julia)."]}, {"page": "Woolgar", "response": ["*Sarah Woolgar (1824–1909), English actress"]}, {"page": "Alfred Mellon", "response": ["He married Sarah Woolgar, a well-known actress on 28 July 1855. There were two daughters, the younger of which, Mary Woolgar Mellon, also became an actress.Oxford Dictionary of National Biography Mellon died at his home at The Vale, Chelsea, and is buried in Brompton Cemetery, London. He was so well-known and respected that thousands attended his funeral.Alfred Mellon: Brompton Cemetery"]}, {"page": "Paul Pry (play)", "response": ["It returned to London's Adelphi Theatre, for the 1851–52 season, featuring Edward Richard Wright and Sarah Woolgar, receiving extensive, positive press comment."]}, {"page": "Sarah Jane Woolgar", "response": ["#REDIRECT Sarah Woolgar"]}, {"page": "Edward Richard Wright", "response": ["Wright became a citizen of London and a member of the Skinners' Company. After acting, in September 1832 at the Margate Theatre, John Reeve's part of Marmaduke Magog in the Wreck Ashore of John Baldwin Buckstone, he was seen in London, in 1834, at the Queen's Theatre. After a time spent on the stage in Birmingham and Bristol, he came to the St. James's Theatre, then built and opened by John Braham, and on the first night made his earliest recognised appearance as a comedian, on 29 Sept. 1837, as Splash in the ‘Young Widow,’ and Fitzcloddy in a farce called ‘Methinks I see my Father.’ His reception was favourable. On 20 March 1838 he was the original Wigler in Selby's ‘Valet de Sham.’ At this house, too, he was the first Simmons in Haynes Bayly's ‘Spitalfields Weaver.’ On 3 December 1838 at the Adelphi, destined to be his home, and with which his fame is principally associated, he was the first Daffodil Primrose, a valet in Stirling's ‘Grace Darling, or the Wreck at Sea,’ and on 28 October 1839l the first Shotbolt in Buckstone's ‘Jack Sheppard.’ He also played in a burletta called ‘The Giant of Palestine.’ During one year he visited the Princess's; then, returning to the Adelphi, remained there, with the exception of visits of a few days or weeks to the Strand, the Standard, or other houses, until the year of his death. His constant associates were Paul Bedford and, in his later years, Sarah Woolgar (Sarah Jane Mellon)."]}, {"page": "Sarah Jane Mellon", "response": ["#redirect Sarah Woolgar"]}, {"page": "The Willow Copse", "response": ["A September 1859 revival at the Adelphi played for thirty-six consecutive nights, and featured Benjamin Nottingham Webster as Luke Fielding, Sarah Woolgar as Meg, and John Lawrence Toole as  Augustus de Rosherville.The Adelphi Theatre Calendar 1859-60 (2013), retrieved 27 March 2015"]}, {"page": "Woolgar, Sarah", "response": ["#redirectSarah Woolgar"]}]}}