{"wiki_id": "http://www.wikidata.org/entity/Q7422908", "itemLabel": "Sarah Willingham", "itemDescription": "British entrepreneur, investor and personal finance expert", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Willingham", "wikipedia_page": {"main": "Sarah Louise Willingham (born 21 December 1973) is a British entrepreneur, investor and consumer champion best known for her management of high-street restaurants such as Planet Hollywood and Pizza Express and her tenure as a \"Dragon\" on the thirteenth and fourteenth series of Dragons' Den.\nWillingham bought the Bombay Bicycle Club in partnership with The Clapham House Group, expanding the restaurant chain from six locations to seventeen.", "link_mentions": [{"page": "Cranfield University", "response": ["File:Sarah Willingham portrait.jpg|Sarah Willingham – entrepreneur and former \"dragon\" on the series Dragons' Den", "* Sarah Willingham – entrepreneur and former \"dragon\" on the BBC Two business series Dragons' Den"]}, {"page": "Newcastle-under-Lyme School", "response": ["*Sarah Willingham (born 1973), media entrepreneur"]}, {"page": "Dragons' Den", "response": ["| colspan=\"2\" | Sarah Willingham"]}, {"page": "Cranfield School of Management", "response": ["* Sarah Willingham – letssavesomemoney.com, former \"dragon\" on the BBC Two business series Dragons' Den."]}, {"page": "Dragons' Den (British TV programme)", "response": ["| Sarah Willingham", "| Sarah Willingham", "| Sarah Willingham", "| Nick Jenkins and Sarah Willingham", "| Sarah Willingham", "| Sarah Willingham", "| Nick Jenkins and Sarah Willingham", "| Nick Jenkins and Sarah Willingham", "| Deborah Meaden, Peter Jones and Sarah Willingham British Cassis declined the investment offers stating her accountant had pre-advised her not to release more than 20% of equity. The company remains active.", "On 23 January 2015, Kelly Hoppen announced her departure from the show after two series, stating she was unable to commit to the filming schedule whilst she focussed on other commitments. She was replaced by Sarah Willingham from series 13 onwards.", "===Sarah Willingham===", "Jenkins confirmed he was leaving on 31 January 2017 alongside Sarah Willingham, also after two series, saying \"I have thoroughly enjoyed making Dragons' Den but I want to focus more on my portfolio of educational technology businesses and that would make it difficult to take on any more investments from the den.\" He was replaced by Tej Lalvani from series 15 onwards."]}, {"page": "The Restaurant (British TV series)", "response": ["Each week, Blanc set a task, such as to make as much profit from selling cocktails or desserts. Each couple's restaurant was visited by Blanc's \"inspectors\" – restaurant industry experts David Moore and Sarah Willingham - who reported back to Blanc on the service, food and organisation of each. There was then a \"boardroom\" showdown in which each couple was given individual feedback. All couples were then called in together and the \"Restaurant of the Week\" award was presented to the couple deemed to have performed the best during the task. Blanc then named the three (or two in later episodes) poorest performing couples that would perform a further challenge."]}, {"page": "The Restaurant (British series 2)", "response": ["*Challenge: Masterclasses – Instead of sending them out to a challenge, he hands the couples' front-of-house to David Moore to test while personally putting the couples' chefs through a much tougher cooking regime than they expected. Then Sarah Willingham tests the couples' business skills. After that they have to serve up what they have learned to some of the most discerning palates and fastidious managers in the trade."]}, {"page": "The Restaurant (British series 3)", "response": ["The judges were again Raymond Blanc, Sarah Willingham and David Moore. Nine couples competed for the chance to open their own restaurant, this time backed by all three judges."]}, {"page": "David Moore (restaurateur)", "response": ["David Moore has made several TV appearances including BBC MasterChef: The Professionals and BBC Out of the Frying Pan, both of which aired in summer 2010. He is most likely to be remembered as an inspector on BBC The Restaurant, series 2 and 3, alongside his former mentor Raymond Blanc and fellow inspector Sarah Willingham."]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Sarah Willingham (born 1973), entrepreneur, investor and personal finance."]}, {"page": "2015 in British television", "response": ["|BBC Two confirms that entrepreneurs Nick Jenkins, Sarah Willingham and Touker Suleyman will join Dragons' Den for series 13."]}, {"page": "The House Crowd", "response": ["Sarah Willingham stated that Fearnhead's pitch was \"the most disrespectful pitch from an individual\" and that she was \"offended\"."]}, {"page": "Touker Suleyman", "response": ["In 2015, Suleyman was chosen to join the investors' panel on the thirteenth series of BBC television programme Dragons' Den, alongside Nick Jenkins and Sarah Willingham. Suleyman is the only dragon out of the three to have remained on the show since."]}, {"page": "List of restaurateurs", "response": ["*  Sarah Willingham "]}, {"page": "The Saturday Show (2015 TV series)", "response": ["| Jon Culshaw, Sarah Willingham, Kerry Howard and Josie Gibson"]}, {"page": "2017 in British television", "response": ["|It is announced that Nick Jenkins and Sarah Willingham will leave Dragons' Den when the current series ends on 26 February.", "|Crystal Palace chairman Steve Parish and former banker Jenny Campbell will join the next series of Dragons' Den, replacing Nick Jenkins and Sarah Willingham."]}, {"page": "Willingham, Sarah", "response": ["#redirectSarah Willingham"]}, {"page": "I'll Get This", "response": ["|Peter Jones (£5,000), Sara Davies (£5,000), Sarah Willingham (£5,000) and Tej Lalvani (£5,000), Touker Suleyman (£5,000)"]}]}}