{"wiki_id": "http://www.wikidata.org/entity/Q742170", "itemLabel": "Robert Sherard", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Sherard", "wikipedia_page": {"main": "Robert Harborough Sherard (3 December 1861 – 30 January 1943) was an English writer and journalist. He was a friend, and the first biographer, of Oscar Wilde, as well as being Wilde's most prolific biographer in the first half of the twentieth century.\n\n", "link_mentions": [{"page": "Oscar Wilde", "response": ["His earnings, plus expected income from The Duchess of Padua, allowed him to move to Paris between February and mid-May 1883. While there he met Robert Sherard, whom he entertained constantly. \"We are dining on the Duchess tonight\", Wilde would declare before taking him to an expensive restaurant. In August he briefly returned to New York for the production of Vera, his first play, after it was turned down in London. He reportedly entertained the other passengers with \"Ave Imperatrix!, A Poem on England\", about the rise and fall of empires. E. C. Stedman, in Victorian Poets, describes this \"lyric to England\" as \"manly verse – a poetic and eloquent invocation\".", "Wilde's life has been the subject of numerous biographies since his death. The earliest were memoirs by those who knew him: often they are personal or impressionistic accounts which can be good character sketches, but are sometimes factually unreliable. Frank Harris, his friend and editor, wrote a biography, Oscar Wilde: His Life and Confessions (1916); though prone to exaggeration and sometimes factually inaccurate, it offers a good literary portrait of Wilde. Lord Alfred Douglas wrote two books about his relationship with Wilde. Oscar Wilde and Myself (1914), largely ghost-written by T. W. H. Crosland, vindictively reacted to Douglas's discovery that De Profundis was addressed to him and defensively tried to distance him from Wilde's scandalous reputation. Both authors later regretted their work. Later, in Oscar Wilde: A Summing Up (1939) and his Autobiography he was more sympathetic to Wilde. Of Wilde's other close friends, Robert Sherard; Robert Ross, his literary executor; and Charles Ricketts variously published biographies, reminiscences or correspondence. The first more or less objective biography of Wilde came about when Hesketh Pearson wrote Oscar Wilde: His Life and Wit (1946). In 1954 Wilde's son Vyvyan Holland published his memoir Son of Oscar Wilde, which recounts the difficulties Wilde's wife and children faced after his imprisonment. It was revised and updated by Merlin Holland in 1989."]}, {"page": "1906 in literature", "response": ["*Robert Sherard – The Life of Oscar Wilde"]}, {"page": "Bromsgrove", "response": ["Dugdale described the town in 1819 as \"a large and dirty place, full of shops and manufacturers of needles, nails, sheeting and other coarse linen.\" By 1897, Robert Sherard depicts a town that appears rather bucolic and \"bright and sweet and clean.\" However, approaching the nailmaker's cottages, one could \"pass in one minute from prosperous burgherdom to the lowest slavery\".", "The industry featured in Robert Sherard's book The White Slaves of England in 1897 which includes a detailed picture of nailmaking in its final years. At this time, working weeks of 70–90 hours were commonplace and poverty still widespread. Their diet was typically bread, margarine and tea, with cheese as an occasional supplement, and sometimes meat. Chickens and pigs were often kept as another way to supplement their diet."]}, {"page": "Ernest Dowson", "response": ["In 1899, Robert Sherard found Dowson almost penniless in a wine bar. Sherard brought him to his cottage in Catford, where Dowson spent his last six weeks."]}, {"page": "Gyles Brandreth", "response": ["Brandreth has written a series of seven works of historical fiction called The Oscar Wilde Murder Mysteries, in which Oscar Wilde works with both Robert Sherard and Arthur Conan Doyle."]}, {"page": "Baron Sherard", "response": ["Philip Sherard, 2nd Earl and Baron Harborough, and 4th Baron Sherard, had previously represented Rutland in Parliament and also served as Lord-Lieutenant of Rutland. Two of his sons, Bennet, the 3rd Earl, and Robert, the 4th, also succeeded in turn to the Sherard barony, while a younger son, Philip(died 1790), was a Lieutenant-General in the British Army. Robert was succeeded by his son Philip and grandson Robert Sherard, the 6th and last Earl of Harborough, and 8th Baron Sherard. ", "*Robert Sherard, 4th Earl of Harborough and Baron Harborough, 6th Baron Sherard (1719–1799)", "*Robert Sherard, 6th Earl of Harborough and Baron Harborough, 8th Baron Sherard (1797–1859)", "***** Robert Sherard, 4th Earl of Harborough (1719–1799)", "******* Robert Sherard, 6th Earl of Harborough (1797–1859)", "****** Robert Sherard (1777–1835)"]}, {"page": "Beast of Gévaudan", "response": ["* In 1904, the author and journalist Robert Sherard reworked Berthet's idea in his novel Wolves: An Old Story Retold, which once again featured both a werewolf and a huge savage wolf. Élie Berthet's La Bête du Gévaudan is mentioned in the introduction as being the source of the story."]}, {"page": "Elizabeth College, Guernsey", "response": ["Alumni in the arts include actor Barry Jones; authors William Adolf Baillie Grohman and P.G. Wodehouse;Wodehouse, quoted in Jasen, p. 8 and Jean Hugo, artist and great-grandson of Victor Hugo; as well as journalist and novelist Robert Sherard; and engineer and author Hugh Pembroke Vowles. Alumni in the sciences includes physician and academic author Dr Norman Hay Forbes; anthropologist Arthur Maurice Hocart; John Richard Magrath, Vice-Chancellor of the University of Oxford; egyptologist Sir Peter le Page Renouf;The Letters of Peter le Page Renouf (1822-1897), edited by Kevin J. Cathcart, 4 vols. (University College Dublin Press, 2002-2004), reviewed by Patricia Usick (British Museum), retrieved 25 May 2009   geologist Nick McCave;‘McCAVE, Prof. (Ian) Nicholas’, Who's Who 2017, A & C Black, an imprint of Bloomsbury Publishing plc, 2017 and nuclear physicist Ian Chapman."]}, {"page": "United Alkali Company", "response": ["Following the merger of the companies, some concerns were raised about the impact on employment. In Robert Sherard's The White Slaves of England (1896) he quotes of the impact in Runcorn, where the Alkali factory previously employed about 500 men but fewer than ten after amalgamation."]}]}}