{"wiki_id": "http://www.wikidata.org/entity/Q7422224", "itemLabel": "Sarah Cullen", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Cullen", "wikipedia_page": {"main": "Sarah Cullen (6 October 1949 – 22 January 2012) was a British radio and television journalist who worked for ITN, as well as BBC Radio 4's  Today programme. Remembered for her red hair and volatile temperament, Cullen forged a reputation for reporting from the street, and undertook many assignments in Northern Ireland, including covering events during the closing days of The Troubles.", "link_mentions": [{"page": "University College London", "response": ["* Activists, journalists and commentators including A. A. Gill (columnist), three former editors of The Economist, most notably Walter Bagehot, two editors of The Times Literary Supplement, Jonathan Dimbleby (television and radio current affairs presenter), Roly Drower (satirist and activist), Tom Dyckhoff (architecture critic and TV presenter), former ITN Home Affairs Correspondent Sarah Cullen, Aliza Ayaz (international climate activist through United Nations and House of Lords), and Simon Inglis (architectural historian and sports writer); Dr. Alexandra Bulat (first Romanian elected to an English county council and advocate for EU citizens during Brexit);"]}, {"page": "List of people associated with University College London", "response": ["* Sarah Cullen (BA English, 1972), radio and TV journalist"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Sarah Cullen – former ITN Home Affairs correspondent"]}, {"page": "1949 in British television", "response": ["* 6 October – Sarah Cullen, television and radio journalist (died 2012)"]}, {"page": "Cullen (surname)", "response": ["*Sarah Cullen, British television journalist"]}, {"page": "2012 in British television", "response": ["|Sarah Cullen"]}, {"page": "Deaths in January 2012", "response": ["*Sarah Cullen, 62, British radio and television journalist."]}, {"page": "2012 in the United Kingdom", "response": ["**Sarah Cullen, 62, radio and television journalist."]}, {"page": "2012 in British radio", "response": ["*22 January – Sarah Cullen, 62, broadcast journalist, reporter on The Today Programme"]}, {"page": "Joan Thirkettle", "response": ["Thirkettle began her career in journalism as a trainee researcher with Associated Rediffusion in 1965 and as a researcher for Radio Caroline, before moving into print journalism, first joining the Daily Mail and later working for the Sunday Times as property correspondent and a business writer in 1969. She moved to radio in 1970, reporting for the BBC and the British Forces Broadcasting Service, and in 1973 was one of the founding members of London's news station London Broadcasting Company (LBC). She joined ITN the following year and quickly became a familiar presence on television screens. Along with Carol Barnes, Sarah Cullen and Sue Lloyd-Roberts, Thirkettle was one of the first female reporters to be seen on the broadcaster. Along with Barnes, Thirkettle was recruited by editor Nigel Ryan and the two were later known as \"Ryan’s Daughters\"."]}, {"page": "Cullen, Sarah", "response": ["#redirectSarah Cullen"]}]}}