{"wiki_id": "http://www.wikidata.org/entity/Q7422788", "itemLabel": "Sarah Solemani", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Solemani", "wikipedia_page": {"main": "Sarah Solemani (born 4 September 1982) is an English actress, writer and activist, best known for starring in the BAFTA winning sitcom Him & Her, playing Renee Zellweger's best friend 'Miranda' in Working Title's Bridget Jones's Baby, for which she was nominated for an Evening Standard Best Actress Award. She is also known for her roles in the British comedy TV series Bad Education and The Wrong Mans.", "link_mentions": [{"page": "62 Group", "response": ["Author Jo Bloom researched the events and wrote a novel, Ridley Road, published in 2014, with the 62 Group and events in the summer of 1962 as a backdrop, named after a street in the East End of London known as a fascist meeting place, around which battles took place. A television drama of the same name based on the book, written and adapted for television by Sarah Solemani, was announced in 2019 and broadcast by BBC One in October 2021."]}, {"page": "Caitlin Moran", "response": ["Moran's semi-autobiographical novel, How to Build a Girl (2014), is set in Wolverhampton in the early 1990s. It is the first of a planned trilogy, to be followed by How to Be Famous, and concluding with How To Change The World. Moran co-wrote the screenplay for the film adaptation of the same name alongside John Niven. She also served as an executive producer on the film, directed by Coky Giedroyc, and starring Beanie Feldstein, Alfie Allen, Paddy Considine and Sarah Solemani."]}, {"page": "Persian Jews", "response": ["*Sarah Solemani - English actress"]}, {"page": "Ralph Brown", "response": ["Brown played Sarah Solemani's father in Him & Her, which began airing in 2010 and continued through 2014 for BBC Three comedy, winning a BAFTA for the final series, \"The Wedding.\" In 2012, he worked on Inspector George Gently with Martin Shaw, The Poison Tree for ITV, and The Mimic for C4.  In 2013, he worked on the aborted Marvin Gaye film Sexual Healing directed by Julian Temple, and the ABC series The Assets in Vilnius, Lithuania. In 2014, he shot Babylon for C4 and Elementary for CBS, followed by TURN: Washington's Spies for AMC, playing General Sir Henry Clinton, leader of the redcoats. Brown returned for seasons 3 and 4 of the series. He also played Johann Fennhoff (Dr Faustus), in Agent Carter for Marvel, and guest starred on Blacklist."]}, {"page": "Mrs Henderson Presents", "response": ["* Sarah Solemani as Vera"]}, {"page": "Cowards (comedy troupe)", "response": ["As a director, Golaszewski has won the Edinburgh Comedy Award for Best Newcomer twice: in 2007 for Basden's solo show Won't Say Anything and in 2009 for Jonny Sweet's show Mostly About Arthur. Golaszewski has also written a BBC Three sitcom called Him & Her, starring Russell Tovey and Sarah Solemani, as well as writing a play Sex with a Stranger that was staged in the West End in early 2012. Woolf has performed in BBC Three series The Wrong Door, the short films Nightwalking and How Much for My Brother?, and various television adverts. More recently, Woolf has co-written Parents, a six-part sitcom which aired on Sky1 in summer 2012."]}, {"page": "Henrietta Barnett School", "response": ["* Sarah Solemani, actress and writer"]}, {"page": "List of British Jewish entertainers", "response": ["*Sarah Solemani (born 1982), actress"]}, {"page": "Roman's Empire", "response": ["Roman's Empire is a British television comedy programme starring Mathew Horne, Neil Dudgeon, Chris O'Dowd, Montserrat Lombard and Sarah Solemani.  Written by brothers Harry and Jack Williams (sons of writer Nigel Williams) as their TV writing debut, the programme's first episode was aired on BBC Two on 12 April 2007 by the British Broadcasting Corporation.", "* Sarah Solemani - Jenny", "Roman's Empire was not recommissioned by the BBC, and was to remain as a one-off series. Sarah Solemani and Mathew Horne subsequently appeared in Jack Whitehall's Television series, Bad Education."]}, {"page": "List of American films of 2005", "response": ["| Mrs Henderson Presents || The Weinstein Company || Stephen Frears (director); Martin Sherman (screenplay); Judi Dench, Bob Hoskins, Kelly Reilly, Will Young, Christopher Guest, Toby Jones, Thelma Barlow, Anna Brewster, Rosalind Halstead, Sarah Solemani, Natalia Tena, Thomas Allen, Richard Syms, Samuel Barnett || Biography ||"]}, {"page": "Tom Basden", "response": ["Basden was born in Sutton, Greater London. He was educated at King's College School, an independent school for boys in Wimbledon in South-West London, where he was in the same year as fellow actors Khalid Abdalla and Ben Barnes; followed by Pembroke College, Cambridge. He was vice-president of Cambridge Footlights and his contemporaries included Stefan Golaszewski, Sarah Solemani, Tim Key (who pretended to be studying for a Ph.D at Cambridge to be part of a Footlights production) and Dan Stevens."]}, {"page": "Stefan Golaszewski", "response": ["Golaszewski's sitcom Him & Her, starring Russell Tovey and Sarah Solemani, aired on BBC Three for four series from 2010 to 2014 and won the 2014 British Academy Television Award for Best Situation Comedy. Golaszewski wrote Sex with a Stranger, staged in early 2012 and starring Tovey and Jaime Winstone."]}, {"page": "Lloyd Woolf", "response": ["At university Woolf became involved in the Cambridge Footlights, performing alongside the likes of Ed Weeks, Dan Stevens, Sarah Solemani, Mark Watson, Matt Kirshen, Tim Key, Tom Basden and Stefan Golaszewski."]}, {"page": "Undone (radio series)", "response": ["Undone is a radio comedy broadcast by the BBC on the digital channel BBC 7, written by and starring Ben Moor.  It uses a sci-fi theme of parallel universes to poke fun at life and especially the media business in London.  The series focuses on the life of Edna Turner (Sarah Solemani in Series One and Alex Tregear in Series Two and Three), a journalist for a listings magazine who discovers a weird parallel version of London called \"Undone\".", "In the first series finale, weirdness threatens to flood London while mundaneness threatens Undone.  Edna discovers that she is the one who can maintain the balance between realities. In the process, she perceives even more universes, including one in which she is \"a fictional character played by Sarah Solemani\". She restores the balance, but Tankerton and other Undoners she has come to know vanish, and the gaps between London and Undone are closed.  Returning to her flat, she wonders if she imagined everything, but sees the gifts Tankerton gave her, and discovers she can cross to Undone simply by concentrating.", "* Edna Turner (Sarah Solemani in Series 1, Alex Tregear in Series 2 and 3), a neophyte journalist. After meeting the Prince, Edna is not sure whether to continue believing in Tankerton's work, or the Prince's own plans. As the story progresses, she becomes uncomfortably aware of her increasing number of abilities, including the trick of switching to a new reality when the current one becomes too boring."]}, {"page": "Jack Whitehall", "response": ["In 2012, Whitehall starred in a self-penned comedy drama series Bad Education on BBC Three, which began on 14 August, in which he plays Alfie, a teacher who is \"the worst teacher ever to grace the British education system and is a bigger kid than the kids he teaches\". The series also stars Mathew Horne as Fraser, the headmaster, Sarah Solemani as Miss Gulliver, the biology teacher, and Michelle Gomez as Miss Pickwell, the deputy head. In 2015, Whitehall starred in a feature-film version of Bad Education, about a school trip to Cornwall. The film was provisionally entitled The Bad Education Movie."]}, {"page": "Coky Giedroyc", "response": ["In 2018, it was announced Giedroyc would direct How to Build a Girl, based upon the novel of the same name by Caitlin Moran, who also wrote the film's screenplay alongside John Niven. Beanie Feldstein, Alfie Allen, Paddy Considine, Sarah Solemani, Joanna Scanlan, Arinze Kene and Frank Dillane will star in the film."]}, {"page": "Psychoville", "response": ["| Sarah Solemani || Emily"]}, {"page": "Olivia Poulet", "response": ["Poulet has also appeared on stage productions including  The Queef of Terence and The Bird Flu Diaries. She has also voiced roles in video game Dragon Age II by BioWare. In 2011, Poulet and her comedy partner Sarah Solemani wrote a sitcom for the BBC, which will be produced by Charlie Hanson. She also completed a screenplay called Ocean Road for producer Harriet Rees."]}, {"page": "Writers Guild of America Award for Television: Comedy Series", "response": ["| Alec Berg, Duffy Boudreau, Bill Hader, Emily Heller, Liz Sarnoff, Ben Smith, Sarah Solemani"]}, {"page": "Writers Guild of America Award for Television: New Series", "response": ["| Alec Berg, Duffy Boudreau, Bill Hader, Emily Heller, Liz Sarnoff, Ben Smith, Sarah Solemani"]}, {"page": "National Theatre Connections", "response": ["*The Crazy Sexy Cool Girls' Fan Club by Sarah Solemani"]}, {"page": "Him & Her", "response": ["Him & Her is a British television sitcom about a lazy twenty-something couple: Steve and Becky, who live in Walthamstow, London.Steve gives his postcode during a phone call in s1 e3 It was first broadcast in the United Kingdom on BBC Three on 6 September 2010. It is written by Stefan Golaszewski and stars Russell Tovey and Sarah Solemani. The theme tune is the song \"Boom Bang-a-Bang\" by Lulu.", "* Becky Williams (Sarah Solemani; 25 episodes), Steve's partner", "On reviewing the final episode, Aidan Smith of The Scotsman summarised the show as \"a jam and fluff-covered gem featuring charming performances from Russell Tovey and Sarah Solemani as Steve and Becky\". The series was awarded the BAFTA for British Academy Television Award for Best Situation Comedy in 2014."]}, {"page": "IdeasTap", "response": ["IdeasTap awards its funding, mentoring and support through creative briefs. Notable brief winners include HighTide Festival Theatre (Ideas Fund Edinburgh); RashDash (Ideas Fund Edinburgh); Sabrina Mahfouz (OVNV TS Eliot US/ UK Exchange) Folly for a Flyover (Innovators Fund); Pierfrancesco Celada (IdeasTap Photographic Award); Ella Hickson (OVNV 24 Hour Plays); Sarah Solemani (OVNV 24 Hour Plays); Nick Blood (Old Vic New Voices Theatre 503 Award). IdeasTap distributes its core funds through the Ideas Fund scheme, which is divided into five sections: Ideas Fund Innovators, Ideas Fund Shorts, Ideas Fund Green and the Top Up Fund."]}, {"page": "List of bisexual characters in television", "response": ["|Rosie Gulliver || Sarah Solemani || Bad Education || Dated multiple men and also dated a female former student."]}, {"page": "Soleymani", "response": ["*Sarah Solemani (born 1982), British actress and writer"]}, {"page": "Bad Education (TV series)", "response": ["The series focuses on Alfred \"Alfie\" Wickers (Jack Whitehall), a posh, newly graduated secondary school History teacher at the fictional Abbey Grove School, in WatfordBad Education, s1 or Tring,Bad Education, s3 Hertfordshire. Ever determined to impress his crush, Rosie Gulliver (Sarah Solemani) Alfie makes repeated efforts to appear \"cool\", such as coaching the school football team, organising a weapons amnesty, and fielding a candidate for the school elections. Usually, in these efforts, he turns to his mismatched class for help, despite them often disapproving of his actions. They are teacher's pet Joe (Lawrence), tough guy Mitchell (Wernham), wheelchair user rudeboy Rem Dogg (Binstead), sexually promiscuous Chantelle (Runeckles), camp Stephen (Williams), studious Jing (Alexander), outwardly fiery Cleopatra (Opia) and school bully Frank (Bence).", "| Sarah Solemani", "* Rosie Gulliver (portrayed by Sarah Solemani) – Rosie is the Biology teacher and former interim Deputy Headteacher at Abbey Grove School. She is openly bisexual and was one of the few teachers who takes pride when inspiring and teaching her students. She is passionate about charity work, animal rights, human rights, feminism, and the struggles of people with disabilities. When teachers were asked to do a sex education class, she is the only one who leads an honest discussion of human sexuality and shows acceptance and patience of the changes that the students were going through. When mistakenly believing Alfie was raped by a teacher at Middleton House when he attended it, she urges him to accept that he was a victim and speak for all those who have had their \"voices silenced\". In \"Funeral\", Fraser asks her to become interim Deputy Headteacher, and, to Alfie's alarm, begins to develop similarities to Pickwell's dictatorial style. Her tenure ended with the appointment of Professor Green in \"Valentine's Day\". At the beginning of series 1, she breaks up with her boyfriend Richard, stating she was too \"physical\" for him. At first, she finds Alfie callow and does not share his feelings for her, though over time she warms to him. At the school dance in the finale of series 1, she compares him to a student who really frustrates her, but has potential and is \"perfect\" after all, and kisses him in front of most of the student body. In the second series, however, Alfie is upset to learn that they are not together, and that she has formed a lesbian relationship with her former student, Alex Scott. In the fourth episode of the second series, this relationship comes to an end, and Rosie's feelings for Alfie return. She gets a job offer in Soweto in the final episode of series 2, but decides to decline it when Alfie declares his feelings for her, and she returns them. They share another kiss. By the beginning of series 3, they are living together, but she moves out after Alfie wrongly accuses her of cheating. She refuses to acknowledge the status of their relationship until \"Prom\", when the thought that Alfie will no longer be around shows her that she still cares deeply about him, and they get back together."]}, {"page": "List of American films of 2013", "response": ["| The Look of Love || Film4 Productions || Michael Winterbottom (director) Matt Greenhalgh (screenplay); Steve Coogan, Imogen Poots, Anna Friel, Tamsin Egerton, David Walliams, Chris Addison, Shirley Henderson, James Lance, Paul Popplewell, Sarah Solemani, Vera Filatova, Matthew Beard, Simon Bird, Kieran O'Brien, Matt Lucas, Stephen Fry, Miles Jupp, Peter Wight, Liam Boyle || "]}, {"page": "The Wrong Mans", "response": ["* Sarah Solemani as Lizzie Green", "Filming began on the new series in August 2014, with Field Smith returning as producer/director.  The new plotline was conceived as a direct continuation of the events of the first, using a deliberately hanging plot thread—the bomb seen planted under a car in the final shot—as the starting-point in a storyline that charted the duo's equally outlandish attempts to reclaim their ordinary lives. Describing their efforts in comparison to the original, Corden and Baynton reiterated that \"this new series is bigger and bolder... If series one was the frying pan, this is the fire.\" Other returning cast members include Dawn French, Rebecca Front, Sarah Solemani and Tom Basden, all reprising their roles from the first series. BBC Two scheduled the new series as part of their 2014 Christmas programming line-up, running the episodes in two hour-long blocks successively on 22 and 23 December. The same episodes broken into four half-hours subsequently premiered on Hulu.com on 24 December."]}, {"page": "Crackanory", "response": ["* Sarah Solemani \"Pleasure Drone\"  and "]}, {"page": "Old Vic New Voices", "response": ["* Sarah Solemani"]}, {"page": "The Secrets (TV series)", "response": ["The Secrets is a British drama television serial first broadcast on BBC One in 2014. The five-part series, made by Working Title Television, is directed by Dominic Savage. The writers are Elinor Cook, Nick Payne, Ben Ockrent and Sarah Solemani."]}, {"page": "Inside No. 9", "response": ["*Sarah Solemani"]}]}}