{"wiki_id": "http://www.wikidata.org/entity/Q7422906", "itemLabel": "Sarah Williams", "itemDescription": "English poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Williams_(poet)", "wikipedia_page": {"main": "Sarah Williams (December 1837 – 25 April 1868) was an English poet and novelist, most famous as the author of the poem \"The Old Astronomer\". She published short works and one collection of poetry during her lifetime under the pseudonyms Sadie and S.A.D.I., the former of which she considered her name rather than a nom de plume. Her posthumously published second poetry collection and novel appeared under her given name.", "link_mentions": [{"page": "John Brashear", "response": ["His ashes are interred in a crypt below the Keeler Telescope at Allegheny Observatory, along with those of his wife. A plaque on the crypt reads: \"We have loved the stars too fondly to be fearful of the night.\", a paraphrase of the last line of the poem \"The Old Astronomer to His Pupil\" by Sarah Williams. He was survived by a daughter and several siblings."]}, {"page": "Oxford period poetry anthologies", "response": ["Lascelles Abercrombie – Percy Addleshaw – Douglas Ainslie – Thomas Bailie Aldrich – William Alexander – William Allingham – Sir Edwin Arnold – Matthew Arnold – Thomas Ashe – Alfred Austin – William Edmonstoune Aytoun – Philip James Bailey – Richard Harris Barham – Maurice Baring – George Barlow – Jane Barlow – William Barnes – Benjamin Disraeli, 1st Earl of Beaconsfield – Thomas Lovell Beddoes – Henry Charles Beeching – Charles Dent Bell – Hilaire Belloc – Arthur Christopher Benson – Laurence Binyon – John Stuart Blackie – Richard Doddridge Blackmore – Mathilde Blind – Wilfrid Scawen Blunt – George Henry Boker – Gordon Bottomley – Francis William Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Robert Barnabas Brough – Oliver Madox Brown – Thomas Edward Brown – Elizabeth Barrett Browning – Robert Browning – William Cullen Bryant – Robert Buchanan – Arthur Gray Butler – Wathen Mark Wilks Call – Thomas Carlyle – Bliss Carman – John Clare – Caroline Clive – Arthur Hugh Clough – Hartley Coleridge – Mary E. Coleridge – Sara Coleridge – Mortimer Collins – Frances Cornford – William Cory – Frances Burdett Money Coutts – Dinah Maria Craik – Walter Crane – Marquess of Crewe – Arthur Shearly Cripps – Henry Cust – George Darley – John Davidson – William H. Davies – Thomas Osborne Davis – William James Dawson – Walter De la Mare – Lord De Tabley – Sir Aubrey De Vere – Aubrey De Vere – Emily Dickinson – Richard Watson Dixon – Bertram Dobell – Sydney Dobell – Austin Dobson – Alfred Domett – Lord Alfred Douglas – Edward Dowden – Ernest Dowson – Sir Francis Hastings Doyle – John Drinkwater – Agnes Mary Frances Duclaux – Helen, Lady Dufferin – George Louis Palmella Busson du Maurier – Matilda Betham Edwards – George Eliot – Ebenezer Elliott – Henry Ellison – Ralph Waldo Emerson – Frederick William Faber – Sir Samuel Ferguson – Michale Field – Edward Fitzgerald – James Elroy Flecker – Alice Furlong – Norman Gale – Richard Garnett – Wilfrid Wilson Gibson – Adam Lindsay Gordon – Edmund Gosse – Charles Granville – David Gray – Dora Greenwell – Gerald Griffin – Louise Imogen Guiney – Fitz-Greene Halleck – Thomas Hardy – Bret Harte – Robert Stephen Hawker – William Ernest Henley – Maurice Hewlett – Emily Henrietta Hickey – Katharine Tynan Hinkson – Oliver Wendell Holmes – Thomas Hood – George Hookham – Gerard Manley Hopkins – Richard Henry Horne – Lord Houghton – Laurence Housman – Julia Ward Howe – William Dean Howells – Leigh Hunt – Douglas Hyde – Jean Ingelow – Lionel Johnson – Ebenezer Jones – Ernest Charles Jones – James Joyce – John Keble – Frances Anne Kemble – Henry Clarence Kendall – John Kenyon – Charles Kingsley – Henry Kingsley – Rudyard Kipling – Walter Savage Landor – Andrew Lang – Emily Lawless – Eugene Lee-Hamilton – Edward Cracroft Lefroy – Richard Le Gallienne – Amy Levy – William James Linton – Frederick Locker-Lampson – John Gibson Lockhart – Henry Wadsworth Longfellow – James Russell Lowell – Henry Dawson Lowry – Sir Alfred Comyn Lyall – Thomas Toke Lynch – Sidney Royse Lysaght – Earl of Lytton – Lord Lytton – Lord Macaulay – Denis Florence MacCarthy – George MacDonald – Charles Mackay – H. C. Compton Mackenzie – Francis Mahony – James Clarence Mangan – Philip Bourke Marston – Theophile Marzials – John Masefield – Gerald Massey – Annie Matheson – George Meredith – Herman Charles Merivale – Alice Meynell – Richard Middleton – William Cosmo Monkhouse – Harold Monro – Mary Montgomerie – T. Sturge Moore – Sir Lewis Morris – William Morris – Neil Munro – Ernest Myers – Frederic William Henry Myers – John Mason Neale – Henry Newbolt – John Henry Newman – John Nicol – Roden Berkeley Wriothesley Noel – Caroline Elizabeth Sarah Norton – Alfred Noyes – Moira O'Neill – John Boyle O'Reilly – Arthur William Edgar O'Shaughnessy – Francis Turner Palgrave – Sir Gilbert Parker – Fanny Parnell – Coventry Patmore – John Payne – John Swinnerton Phillimore – Stephen Phillips – Eden Phillpotts – William Philpot – Edgar Allan Poe – Walter Herries Pollock – Ezra Pound – Winthrop Mackworth Praed – May Probyn – Adelaide Anne Procter – Bryan Waller Procter – Sir Arthur Quiller-Couch – Ernest Radford – William Brighty Rands – Hardwick Drummond Rawnsley – Ernest Rhys – James Logie Robertson – Sir James Rennell Rodd – Samuel Rogers – T. W. Rolleston – William Caldwell Roscoe – William Stanley Roscoe – Christina Georgina Rossetti – Dante Gabriel Rossetti – Earl of Rosslyn – John Ruskin – George William Russell – Lady Margaret Sackville – George Santayana – William Bell Scott – John Campbell Shairp – William Sharp – Dora Sigerson Shorter – Joseph Skipsey – Douglas Brook Wheelton Sladen – Menella Bute Smedley – Alexander Smith – Walter C. Smith – James Stephens – Robert Louis Stevenson – Charles Swain – Elinor Sweetman – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – John M. Synge – Sir Henry Taylor – Rachel Annand Taylor – Frederick Tennyson – Lord Tennyson – William Makepeace Thackeray – Francis Thompson – Edward William Thomson – James Thomson (B.V.) – Henry David Thoreau – Wilfrid Thorley – Walter Thornbury – John Todhunter – Archbishop Trench – Herbert Trench – Charles Tennyson Turner – Samuel Waddington – Thomas Wade – Edward Walsh – Thomas Herbert Warren – Rosamund Marriott Watson – William Watson – Theodore Watts-Dunton – Augusta Webster – Thomas Westwood – Charles Whitehead – Walt Whitman – John Greenleaf Whittier – Oscar Wilde – Sarah Williams – Nathaniel Parker Lewis – Margaret L. Woods – Thomas Woolner – William Butler Yeats"]}, {"page": "Amateur Astronomers Association of Pittsburgh", "response": ["The club's motto is \"We have loved the stars too fondly to be fearful of the night,\" from the Sarah Williams poem \"The Old Astronomer to his Pupil\"."]}, {"page": "Set in Darkness", "response": ["Set in Darkness is a 2000 crime novel by Ian Rankin. It is the eleventh of the Inspector Rebus novels. It won the 2005 Grand Prix du Roman Policier (France) under the title Du fond des ténèbres. The title comes from the poem \"The Old Astronomer\" by Sarah Williams. In an interview, Rankin linked the quote to the rise of a restored Scottish Parliament and the redemption of the Inspector in the novel."]}, {"page": "1868 in Wales", "response": ["*25 April – Sarah Williams, English novelist of Welsh parentage, 30"]}, {"page": "Sadie", "response": ["* Sarah Williams (poet) (1837-1868), English poet"]}, {"page": "Sarah Williams", "response": ["Sarah Williams may refer to:", "*Sarah Williams (poet), English poet and novelist", "*Sarah Williams (screenwriter), English screenwriter", "*Sarah Williams (Labyrinth), the main character of the 1986 film Labyrinth, played by Jennifer Connelly", "*Sarah Williams, a character of the 2000 film Waking the Dead, also played by Jennifer Connelly"]}, {"page": "The Old Astronomer", "response": ["#REDIRECT Sarah Williams (poet)"]}]}}