{"wiki_id": "http://www.wikidata.org/entity/Q742464", "itemLabel": "John Pond", "itemDescription": "British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Pond", "wikipedia_page": {"main": "John Pond FRS (1767 – 7 September 1836) was a renowned English astronomer who became the sixth Astronomer Royal, serving from 1811 to 1835.", "link_mentions": [{"page": "Astronomer Royal", "response": ["| 6. ||  || John Pond || 1811 || 1835 || "]}, {"page": "Royal Observatory, Greenwich", "response": ["To help mariners at the port and others in line of sight of the observatory to synchronise their clocks to GMT, Astronomer Royal John Pond installed a very visible time ball that drops precisely at 1pm (13:00) every day atop the observatory in 1833. Initially it was dropped by an operator; from 1852 it was released automatically via an electric impulse from the Shepherd Master Clock. The ball is still dropped daily at 13:00 (GMT in winter, BST in summer)."]}, {"page": "List of astronomers", "response": ["| John Pond || England || 1767 || 1836", "*John Pond (England, 1767–1836)"]}, {"page": "Academy Award for Technical Achievement", "response": ["* To Daniel J. Bloomberg, John Pond, William Wade and the Engineering and Camera Departments of Republic Studio for the Naturama adaptation to the Mitchell camera."]}, {"page": "George Biddell Airy", "response": ["In June 1835 Airy was appointed Astronomer Royal in succession to John Pond, and began his long career at the national observatory which constitutes his chief title to fame. The condition of the observatory at the time of his appointment was such that Lord Auckland, the first Lord of the Admiralty, considered that \"it ought to be cleared out,\" while Airy admitted that \"it was in a queer state.\" With his usual energy he set to work at once to reorganise the whole management. He remodelled the volumes of observations, put the library on a proper footing, mounted the new (Sheepshanks) equatorial and organised a new magnetic observatory. In 1847 an altazimuth was erected, designed by Airy to enable observations of the moon to be made not only on the meridian, but whenever it might be visible. In 1848 Airy invented the reflex zenith tube to replace the zenith sector previously employed. At the end of 1850 the great transit circle of 203 mm (8 inch) aperture and 3.5 m (11 ft 6 in) focal length was erected, and is still the principal instrument of its class at the observatory. The mounting in 1859 of an equatorial of 330 mm (13 inch) aperture evoked the comment in his journal for that year, \"There is not now a single person employed or instrument used in the observatory which was there in Mr Pond's time\"; and the transformation was completed by the inauguration of spectroscopic work in 1868 and of the photographic registration of sunspots in 1873.", "The formidable undertaking of reducing the accumulated planetary observations made at Greenwich from 1750 to 1830 was already in progress under Airy's supervision when he became Astronomer Royal. Shortly afterwards he undertook the further laborious task of reducing the enormous mass of observations of the moon made at Greenwich during the same period under the direction, successively, of James Bradley, Nathaniel Bliss, Nevil Maskelyne and John Pond, to defray the expense of which a large sum of money was allotted by the Treasury. As a result, no fewer than 8,000 lunar observations were rescued from oblivion, and were, in 1846, placed at the disposal of astronomers in such a form that they could be used directly for comparison with the theory and for the improvement of the tables of the moon's motion."]}, {"page": "Pond Inlet", "response": ["To the Inuit, the place \"is and always has been Mittimatalik.\" The hamlet shares its name with an arm of the sea that separates Bylot Island from Baffin Island. The place name for the body of water, an arm of the ocean that separates Baffin Island from Bylot Island to the north – Pond's Bay –  was chosen by the explorer John Ross in 1818 in honour of the English astronomer John Pond, at the time the sixth Astronomer Royal.  The hamlet shares that English name, Pond Inlet, used by the early Scottish whalers and traders, the Sikaatsi. On August 29, 1921, when the Hudson's Bay Company opened its trading post near an Inuit camp called Pond's Inlet, they named the HBC post, Pond Inlet, marking the expansion of its trading empire into the High Arctic.Scottish explorer John Ross  (1777-1856) with naming the body of water and arm of the sea between Bylot Island and Baffin Island—Pond Inlet—in his failed exploratory 1818 expedition organized by the British Admiralty to find the Northwest passage. There was no hamlet until the trading companies arrived much later in the twentieth century. In an arctic whaling ship, the  Ross produced a detailed map of the western coast of Greenland and the eastern coast of Baffin Island, naming dozens of capes, mountains, islands, and other geographical features after Scottish and English people and places. He named Pond Inlet after John Pond, a leading English astronomer who was Astronomer Royal from 1811 to 1835. During this first expedition to find the Passage, Ross became confused by a mirage of apparent mountains, at what he thought was the end of Lancaster Sound—a range he called \"Croker Mountains\"—and decided to turn back, much to the discouragement of Lieutenant William Edward Parry, who was the captain of the second ship in the 1818 expedition, the . Parry returned the next year and continued beyond the \"Croker Hills\" mountain mirage, and discovered the main axis of the Northwest Passage.More"]}, {"page": "Lee, London", "response": ["The churchyard of St Margaret's Church (current church rebuilt 1839–41, architect: John Brown) is the burial place of three Astronomers Royal: Edmond Halley, Nathaniel Bliss and John Pond."]}, {"page": "1823 in science", "response": ["* Copley Medal: John Pond"]}, {"page": "John Brinkley (astronomer)", "response": ["Brinkley's observations that several stars shifted their apparent place in the sky in the course of a year were disproved at Greenwich by his contemporary John Pond, the Astronomer Royal. In 1826, he was appointed Bishop of Cloyne in County Cork, a position he held for the remaining nine years of his life. Brinkley was elected President of the Royal Astronomical Society in 1831, serving in that position for two years."]}, {"page": "HM Nautical Almanac Office", "response": ["*John Pond (1829–1831) Astronomer Royal"]}, {"page": "Time ball", "response": ["The first time ball was erected at Portsmouth, England, in 1829 by its inventor Robert Wauchope, a captain in the Royal Navy. Others followed in the major ports of the United Kingdom (including Liverpool) and around the maritime world. One was installed in 1833 at the Greenwich Observatory in London by the Astronomer Royal, John Pond, originally to enable tall ships in the Thames to set their marine chronometers, and the time ball has dropped at 1 p.m. every day since then. Wauchope submitted his scheme to American and French ambassadors when they visited England. The United States Naval Observatory was established in Washington, D.C., and the first American time ball went into service in 1845."]}]}}