{"wiki_id": "http://www.wikidata.org/entity/Q742827", "itemLabel": "Colin McGinn", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_McGinn", "wikipedia_page": {"main": "Colin McGinn (born 10 March 1950) is a British philosopher. He has held teaching posts and professorships at University College London, the University of Oxford, Rutgers University and the University of Miami.McGinn is best known for his work in the philosophy of mind, and in particular for what is known as new mysterianism, the idea that the human mind is not equipped to solve the problem of consciousness. He is the author of over 20 books on this and other areas of philosophy, including The Character of Mind (1982), The Problem of Consciousness (1991), Consciousness and Its Objects (2004), and The Meaning of Disgust (2011).In 2013 McGinn resigned from his tenured position at the University of Miami after being accused of sexual harassment by a female graduate student. The resignation touched off a debate about the prevalence of sexism and sexual harassment within academic philosophy.", "link_mentions": [{"page": "Chinese room", "response": ["Colin McGinn argues that the Chinese room provides strong evidence that the hard problem of consciousness is fundamentally insoluble. The argument, to be clear, is not about whether a machine can be conscious, but about whether it (or anything else for that matter) can be shown to be conscious. It is plain that any other method of probing the occupant of a Chinese room has the same difficulties in principle as exchanging questions and answers in Chinese. It is simply not possible to divine whether a conscious agency or some clever simulation inhabits the room."]}, {"page": "Ludwig Wittgenstein", "response": ["Kripke's book generated a large secondary literature, divided between those who find his sceptical problem interesting and perceptive, and others, such as Gordon Baker, Peter Hacker, Colin McGinn, and Peter Winch who argue that his scepticism of meaning is a pseudo-problem that stems from a confused, selective reading of Wittgenstein. Kripke's position has, however recently been defended against these and other attacks by the Cambridge philosopher Martin Kusch (2006)."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Colin McGinn"]}, {"page": "Philosophical Investigations", "response": ["The discussion of private languages was revitalized in 1982 with the publication of Kripke's book Wittgenstein on Rules and Private Language.Kripke, Saul. Wittgenstein on Rules and Private Language. Basil Blackwell Publishing, 1982. In this work, Kripke uses Wittgenstein's text to develop a particular type of skepticism about rules that stresses the communal nature of language-use as grounding meaning.Stern 2004:2–7 Critics of Kripke's version of Wittgenstein have facetiously referred to it as \"Kripkenstein,\"  scholars such as Gordon Baker, Peter Hacker, Colin McGinn, and John McDowell seeing it as a radical misinterpretation of Wittgenstein's text. Other philosophers – such as Martin Kusch – have defended Kripke's views."]}, {"page": "Saul Kripke", "response": ["* Colin McGinn (1984), Wittgenstein on Meaning.  ."]}, {"page": "University of Miami", "response": ["University of Miami faculty includes, or has included, physicists Paul Dirac and Carolyne M. Van Vliet, Judge Marilyn Milian, geologist Cesare Emiliani, historian Charlton Tebeau, marine biologist Samuel H. Gruber, economist Neil Wallace, audio engineer Bill Porter, artist and architect Bonnie Seeman, architect Elizabeth Plater-Zyberk, sociologist Lowell Juilliard Carr, constitutional law expert John Hart Ely, legal expert Paul R. Verkuil, bassist Jaco Pastorius, guitarist Pat Metheny, artist Walter Darby Bannard, and philosopher Colin McGinn."]}, {"page": "The Age of Spiritual Machines", "response": ["Reviewers appreciated Kurzweil's track record with predictions, his ability to extrapolate technology trends, and his clear explanations. However, there was disagreement on whether computers will one day be conscious. Philosophers John Searle and Colin McGinn insist that computation alone cannot possibly create a conscious machine. Searle deploys a variant of his well-known Chinese room argument, this time tailored to computers playing chess, a topic Kurzweil covers. Searle writes that computers can only manipulate symbols which are meaningless to them, an assertion which if true subverts much of the vision of the book.", "Colin McGinn, an author and philosophy professor at the University of Miami, wrote in The New York Times that machines might eventually exhibit external behavior at a human-level, but it would be impossible to know if they have an \"inner subjective experience\" as people do. If they do not, then \"uploading\" someone into a computer is equivalent to letting their mind \"evaporate into thin air,\" he argues. McGinn is skeptical of the Turing test, claiming it smacks of the long-abandoned doctrine of behaviorism, and agreeing with the validity of Searle's \"quite devastating\" Chinese room argument. He believes minds do compute, but that it does not follow that computation alone can create a mind, instead he says minds have phenomenological properties, perhaps originating from organic tissue. Therefore, he insists that neither silicon chips nor any future technology Kurzweil mentions will ever be conscious."]}, {"page": "Sentience", "response": ["According to Thomas Nagel in his paper \"What Is It Like to Be a Bat?\", consciousness can refer to the ability of any entity to have subjective perceptual experiences, or as some philosophers refer to them, \"qualia\"—in other words, the ability to have states that it feels like something to be in. Some philosophers, notably Colin McGinn, believe that the physical process causing consciousness to happen will never be understood, a position known as \"new mysterianism.\" They do not deny that most other aspects of consciousness are subject to scientific investigation but they argue that qualia will never be explained. Other philosophers, such as Daniel Dennett, argue that qualia are not a meaningful concept."]}, {"page": "Greedy reductionism", "response": ["A departure from strict reductionism in the opposite direction from greedy reductionism is called nonreductive physicalism. Nonreductive physicalists deny that a reductionistic analysis of a conscious system like the human mind is sufficient to explain all of the phenomena which are characteristic of that system.  This idea is expressed in some theories that say consciousness is an emergent epiphenomenon that cannot be reduced to physiological properties of neurons. Those nonreductive physicalists, such as Colin McGinn, who claim the true relationship between the physical and the mental may be beyond scientific understanding—and therefore a \"mystery\"—have been dubbed Mysterians by Owen Flanagan."]}, {"page": "Edmund Gettier", "response": ["* Colin McGinn suggests that knowledge is atomic (it is not divisible into smaller components). We have knowledge when we have knowledge, and an accurate definition of knowledge may even contain the word \"knowledge\". reprinted in "]}, {"page": "David Chalmers", "response": ["After the publication of Chalmers' landmark paper, more than twenty papers in response were published in the Journal of Consciousness Studies.  These papers (by Daniel Dennett, Colin McGinn, Francisco Varela, Francis Crick, and Roger Penrose, among others) were collected and published in the book Explaining Consciousness: The Hard Problem. John Searle critiqued Chalmers' views in The New York Review of Books."]}, {"page": "Brain in a vat", "response": ["A second argument deals directly with the stimuli coming into the brain. This is often referred to as the account from externalism or ultra-externalism. In the BIV, the brain receives stimuli from a machine. In an embodied brain, however, the brain receives the stimuli from the sensors found in the body (via touching, tasting, smelling, etc.) which receive their input from the external environment. This argument oftentimes leads to the conclusion that there is a difference between what the BIV is representing and what the embodied brain is representing. This debate has been hashed out, but remains unresolved, by several philosophers including Uriah Kriegel, Colin McGinn, and Robert D. Rupert, and has ramifications for philosophy of mind discussions on (but not limited to) representation, consciousness, content, cognition, and embodied cognition."]}, {"page": "Hans Moravec", "response": ["On the other hand, the book was reviewed less favorably by Colin McGinn for The New York Times. McGinn wrote, \"Moravec … writes bizarre, confused, incomprehensible things about consciousness as an abstraction, like number, and as a mere \"interpretation\" of brain activity. He also loses his grip on the distinction between virtual and real reality as his speculations spiral majestically into incoherence.\""]}, {"page": "Patricia Churchland", "response": ["2014 saw a brief exchange of views on these topics with Colin McGinn in the pages of the New York Review Of Books.http://www.nybooks.com/articles/archives/2014/jun/19/brains-and-minds-exchange/"]}, {"page": "Jerry Fodor", "response": ["Philosopher Colin McGinn, who taught with Fodor at Rutgers, described him in these words:"]}]}}