{"wiki_id": "http://www.wikidata.org/entity/Q7427291", "itemLabel": "Saul Dibb", "itemDescription": "British film director and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Saul_Dibb", "wikipedia_page": {"main": "Saul Dibb (born 18 August 1968) is an English director and screenwriter. His father is the documentary maker Mike Dibb.\nBorn in London, England, Saul Dibb is a graduate of the University of East Anglia. He is best known for co-writing and directing Bullet Boy, for which he was nominated for the Douglas Hickox Award, The Line of Beauty, and The Duchess, which won the Academy Award for Best Costume in 2009. In 2016, he directed the adaptation for BBC2 of Zadie Smith's bestselling novel NW into a 90-minute television film of the same name, starring Nikki Amuka-Bird and Phoebe Fox. Dibb directed a film adaptation of R. C. Sherriff's 1928 play Journey's End, which was released in 2017. This has been dubbed \"The best ever film about the Great War\" by The Times.", "link_mentions": [{"page": "Duke of Devonshire", "response": ["The fifth Duke and Duchess of Devonshire are portrayed in the 2008 film The Duchess directed by Saul Dibb.  The film is based on Amanda Foreman's biography of the scandalous 18th-century English aristocrat Georgiana Cavendish, Duchess of Devonshire (portrayed by Keira Knightley) and her relationship with the Duke (Ralph Fiennes) and his next wife, Lady Elizabeth Foster."]}, {"page": "Georgiana Cavendish, Duchess of Devonshire", "response": ["* The Duchess (2008),  portrayed by Keira Knightley and directed by Saul Dibb, based on the biography Georgiana, Duchess of Devonshire by Amanda Foreman"]}, {"page": "Keira Knightley", "response": ["Knightley then starred as the 18th-century English aristocrat Georgiana Cavendish, Duchess of Devonshire in Saul Dibb's period drama The Duchess (2008), based on the best-selling biographical novel, Georgiana, Duchess of Devonshire by Amanda Foreman.- -  The film tells the story of Georgiana's rise in society as a sociopolitical tastemaker after her marriage disintegrates. The script Knightley was sent was covered in \"huge white ostrich feathers\" and a gold ribbon. Gabrielle Tana, the film's producer, stated Knightley \"brought an instinctive understanding\" of such aspects of Georgiana's life as a celebrity from her own experiences. Knightley was attracted to her character's strength and status as a political influence and fashion prowess, while being inwardly vulnerable and isolated. Simon Crooke of Empire described her performance as an \"an enigmatic, free-spirited turn and a role she'll be remembered for, probably her best role to date in a film not directed by Joe Wright.\" The following year, she was nominated for a British Independent Film Award for Best Actress. A film adaptation of William Shakespeare's tragedy King Lear set to star Knightley and Anthony Hopkins was cancelled due to recession."]}, {"page": "Zadie Smith", "response": ["Smith's novel NW was published in 2012. It is set in the Kilburn area of north-west London, the title being a reference to the local postcode, NW6. NW was shortlisted for the Royal Society of Literature's Ondaatje Prize and the Women's Prize for Fiction.\"Zadie Smith\" at Rogers, Coleridge & White. NW was made into a BBC television film directed by Saul Dibb and adapted by Rachel Bennette. Starring Nikki Amuka-Bird and Phoebe Fox,Onwuemezi, Natasha, \"Amuka-Bird and Fox to star in NW adaptation\", The Bookseller, 10 June 2016. it was broadcast on BBC Two on 14 November 2016.Meltzer, Tom, \"NW star Nikki Amuka-Bird: 'Zadie is purposefully challenging the viewer'\", The Guardian, 14 November 2016.Lobb, Adrian, \"NW Star Nikki Amuka-Bird Interview: 'Bursting through the glass ceiling can cause damage'\", The Big Issue, 21 November 2016."]}, {"page": "Kristin Scott Thomas", "response": ["She was also seen in The Woman in the Fifth (2011), a film adaption of Douglas Kennedy's novel of the same name, Lasse Hallström's Salmon Fishing in the Yemen (2011), Ralph Fiennes's The Invisible Woman (2013), Philippe Claudel's Before the Winter Chill (2013), and in Nicolas Winding Refn's Only God Forgives, which premiered at the 2013 Cannes Film Festival. In 2014, she voiced the narration of Kay Summersby, General Eisenhower's driver, in the documentary series D-Day Sacrifice. She appeared in Israel Horovitz's My Old Lady (2014) and Suite Française, the 2015 film adaptation of Irène Némirovsky's World War II novel directed by Saul Dibb."]}, {"page": "Omar Bakri Muhammad", "response": ["British journalist Jon Ronson's Them: Adventures With Extremists, a documentary (The Tottenham Ayatollah, directed by Saul Dibb) and book published in 2001, depicts Ronson and Dibb's interactions with Bakri. Ronson depicts Bakri as a charismatic orator who tells a cheering crowd of 5000 that \"he will not rest\" until he sees \"the Black Flag of Islam flying over Downing Street\", and calls for the stoning of fornicators and closing of pubs. He tells Ronson, \"I cannot take a day off, an hour off, even a minute off. I will take time off when I am with Allah, when I die in the battlefield and become a martyr.\" But he also describes Bakri as living in a semi-detached council house, enjoying watching a video of Disney's The Lion King, being unable to hold a fish caught on a fishing line, and calling himself \"actually very nice\"."]}, {"page": "2004 Toronto International Film Festival", "response": ["* Bullet Boy (Saul Dibb)"]}, {"page": "Lambert Wilson", "response": ["| Saul Dibb"]}, {"page": "Alexandra Maria Lara", "response": ["*Suite Française (2015, directed by Saul Dibb) as Leah"]}, {"page": "Ashley Walters (actor)", "response": ["Walters is also an actor, appearing under his full name, Ashley Walters. He appeared on television as Omar in The Young Indiana Jones Chronicles at the age of 10, and as Andy in Grange Hill at the age of 14. He appeared in Saul Dibb's 2004 feature film Bullet Boy, where he played Ricky, who had just been released from prison and back into living a normal life, a role for which Walters was named Best Newcomer at the British Independent Film Awards. He also appeared in 2005's Get Rich or Die Tryin'."]}, {"page": "Kill, County Kildare", "response": ["Bishopscourt was home to John Ponsonby, speaker of the Irish House of Commons (1753–61), William Ponsonby, leader of the Irish Whigs (1789–1803) and birthplace of his brother George Ponsonby (1755–1817) leader of the Whig Party in the British House of Commons at Westminster (1808–17), his uncle Major-General Sir William Ponsonby (1772–1815) whose inept charge at the Battle of Waterloo resulted in his death at the hands of the Polish Lancers  and was studied as an example of failed battle strategy for generations afterwards, and of his sister Mary Ponsonby, wife of Charles Grey, British Prime Minister from 1830–34, best known as the Earl Grey of the tea brand. Lady Ponsonby was mentioned in the Saul Dibb film, The Duchess. Ponsonby descendants include Sir Alec Douglas-Home (British Prime Minister, 1963–64), Nicky Haslam, and Princess Diana. "]}, {"page": "Evening Standard British Film Awards", "response": ["*Most Promising Newcomer : Saul Dibb – Bullet Boy"]}, {"page": "Jaime Winstone", "response": ["|Saul Dibb"]}, {"page": "Bullet Boy (soundtrack)", "response": ["Bullet Boy by Robert Del Naja and Neil Davidge of Massive Attack is the soundtrack to the film, directed by Saul Dibb."]}, {"page": "Sam Riley", "response": ["In 2015, he played Benoit  Labarie in Saul Dibb's film adaptation of Irène Némirovsky's novel Suite Française, opposite Michelle Williams, Matthias Schoenaerts,"]}, {"page": "Bullet Boy", "response": ["Bullet Boy is a 2004 British drama film directed by Saul Dibb, written by Saul Dibb and Catherine Johnson, and stars Ashley Walters. The film's original music was composed and performed by Robert Del Naja of Massive Attack, who released it as an album. The film is about a family in crime-ridden Hackney, East London, the eldest son's involvement in gun crime, and the effects of this on his younger brother.", "| rowspan=\"5\"| Saul Dibb", "Category:Films directed by Saul Dibb"]}, {"page": "Festival International de Programmes Audiovisuels", "response": ["* Fipa d'or: NW by Saul Dibb (United-Kingdom)"]}, {"page": "British Independent Film Awards 2004", "response": ["*Saul Dibb - Bullet Boy"]}, {"page": "Catherine Johnson (novelist)", "response": ["Catherine Johnson FRSL (born 1962) is a British author and screenwriter. She has written several young adult novels and co-wrote the screenplay for the 2004 drama film Bullet Boy (directed by and co-written with Saul Dibb)."]}, {"page": "Suite française (Némirovsky novel)", "response": ["The film rights to Suite française were purchased by Universal in 2006. Ronald Harwood, who wrote the script for The Pianist, was set to write the screenplay, with Kathleen Kennedy and Frank Marshall producing the film. In 2007, TF1 Droits Audiovisuels acquired the rights to the novel from publisher Éditions Denoël. The novel was then adapted for the screen by Saul Dibb and Matt Charman, with Dibb directing. Production began to move forward in 2012, with Michelle Williams starring as Lucille Angellier alongside Kristin Scott Thomas as her mother-in-law, and Matthias Schoenaerts as Bruno von Falk. Filming began in Belgium and Paris in June 2013 and the film was released in 2015."]}, {"page": "Matthias Schoenaerts", "response": ["In 2015, the actor appeared in 7 films: The Loft, the American remake of the Belgian film Loft, in which he played the same character and which was also his first English-language film; in Saul Dibb's Suite Française, playing the German officer Bruno von Falk opposite Michelle Williams and Kristin Scott Thomas; in Thomas Vinterberg's Far from the Madding Crowd as Gabriel Oak, one of Carey Mulligan's three love interests; in Alan Rickman's period drama A Little Chaos, as French landscape architect André Le Nôtre, opposite Kate Winslet. In the same year, Schoenaerts was announced as William Clark on HBO's miniseries Lewis and Clark, co-starring Casey Affleck as Meriwether Lewis. The six-hour miniseries was executive produced by Tom Hanks, Edward Norton, and Brad Pitt. Production got shut down in August 2015 due to \"internal and external, weather-related factors\"."]}, {"page": "Bath Chronicle", "response": ["The Bath Chronicle appears in the 1963 film 80,000 Suspects and in Saul Dibb's 2008 British film The Duchess."]}, {"page": "List of American films of 2008", "response": ["| The Duchess ‡ || Paramount Vantage || Saul Dibb (director/screenplay); Jeffrey Hatcher, Anders Thomas Jensen (screenplay); Keira Knightley, Ralph Fiennes, Charlotte Rampling, Dominic Cooper, Hayley Atwell, Aidan McArdle, Simon McBurney, Sebastian Applewhite, Calvin Dean, Emily Jewell, Richard McCabe, Bruce Mackinnon, Alistair Petrie, Georgia King, Camilla Arfwedson || Drama"]}, {"page": "The Duchess (film)", "response": ["The Duchess is a 2008 British drama film directed by Saul Dibb. It is based on Amanda Foreman's biography of the late-18th-century English aristocrat Georgiana Cavendish, Duchess of Devonshire. It was released in September 2008 in the United Kingdom. The film won the Academy Award for Best Costume Design, and was nominated for Best Art Direction.", "Regarding lead actress Keira Knightley, director Saul Dibb said The Duchess was \"a chance to take a character from late childhood – she's married at 17 – into full adulthood, 10 years later.\" It was also a chance for Knightley to work with Ralph Fiennes, whom she regarded as one of her most accomplished co-stars to date; Dibb said, \"When I said, 'We've got Ralph interested in playing the Duke,' we both took a gulp and went, 'F---.'  ... But I didn't for one second feel that she wasn't up to the task.\" Originally, the film was to be directed by Susanne Bier.(18 September 2006) Susanne Bier finds The Duchess: Open Hearts helmer glamming up for period love story, Total Film", "Most reviewers highly praised Knightley and Fiennes' performances. Time Out London wrote: \"[Saul Dibb] is also helped enormously by a mature, restrained portrayal from Knightley, a masterclass in passive aggression from Fiennes and a performance of tender seduction from Atwell.\" Film Ireland writes \"It is a slow movie, but it is well-acted with Knightley and Fiennes suited to their roles, especially Fiennes who gives a formidable and powerful performance.\"  Cameron Bailey, the co-chair of the Toronto International Film Festival comments, \"The Duchess Of Devonshire, with Keira Knightley, which is a beautiful film and she gives a really mature performance. You're seeing her really turn into something beyond the kind of pretty face that we've seen her do already so well. But she's actually a very serious actress, and she's turning into a great, great performer.\"", "Category:Films directed by Saul Dibb"]}, {"page": "Hildur Guðnadóttir", "response": ["|Saul Dibb"]}, {"page": "List of Welsh films", "response": ["2017: Journeys end was filmed in Pinewood Studio, Cardiff and directed by Saul Dibb."]}, {"page": "List of British films of 2004", "response": ["|Bullet Boy||Saul Dibb ||Ashley Walters, Luke Fraser ||Crime drama ||"]}, {"page": "List of British films of 2008", "response": ["|The Duchess||Saul Dibb ||Keira Knightley, Hayley Atwell, Ralph Fiennes ||Historical drama || Winner of Academy Award and BAFTA for Best Costume Design"]}, {"page": "List of directorial debuts", "response": ["* Saul Dibb♦ – Bullet Boy"]}, {"page": "Richmond Park Academy", "response": ["* Saul Dibb, film director (The Duchess)"]}, {"page": "2008 Toronto International Film Festival", "response": ["* The Duchess by Saul Dibb"]}, {"page": "Margot Robbie", "response": ["She was nominated for the Rising Star Award at the 68th British Academy Film Awards. Her next appearance was alongside Michelle Williams and Kristin Scott Thomas in Saul Dibb's war romantic drama Suite Française, a film based on the second part of Irène Némirovsky's 2004 novel of the same name. In the film, she played a woman falling for a German soldier during the German occupation of France during World War II, a role which Leslie Felperin of The Hollywood Reporter found \"underwritten\"."]}, {"page": "Chris Dickens", "response": ["|Saul Dibb"]}, {"page": "Matt Charman", "response": ["Charman's first feature was Suite Française (2014) co-written with director Saul Dibb, starring Michelle Williams, Kristin Scott Thomas and Margot Robbie. His 2015 feature, Bridge of Spies, was directed by Steven Spielberg, co-written by Charman and Joel and Ethan Coen and starred Tom Hanks, Mark Rylance, and Amy Ryan. Set in Brooklyn and Berlin, the film tells the story of James B. Donovan, an American lawyer who in 1962 negotiated the exchange of Soviet spy Rudolf Abel for the captured pilot of a downed U-2 spy plane, Francis Gary Powers, and American student Frederic Pryor. The film was critically acclaimed, with the New York Times calling it “a consummate entertainment that sweeps you up with pure cinema.” and the New York Post calling it Spielberg's best film since Saving Private Ryan. Charman's script was nominated for Best Original Screenplay at both the 2016 Academy Awards and BAFTA Awards. He was also nominated for a WGA award and Critics' Choice award in the same category. Bridge of Spies was a box office hit, grossing $165.5 million worldwide and receiving six Academy Award nominations including Best Picture and Best Original Screenplay, winning Best Supporting Actor for Mark Rylance's performance as Rudolf Abel."]}, {"page": "Gyula Pados", "response": ["| Saul Dibb"]}, {"page": "List of World War I films", "response": ["|Saul Dibb"]}, {"page": "European Film Academy Lux Award", "response": ["| colspan=\"2\"|The Duchess || Saul Dibb || "]}, {"page": "Chris Field (composer)", "response": ["|Saul Dibb"]}, {"page": "Mike Dibb", "response": ["Mike Dibb (born Wharfedale, Bradford, West Yorkshire, 29 April 1940) is an English documentary filmmaker. In almost half a century of making films mainly for television – on subjects including cinema, literature, art, jazz, sport and popular culture – \"he has defined and re-defined not only the televisual art documentary genre but has been able to make moving image pieces as a form of self portraiture\".AFTERIMAGE: Engagements with the Cinematic, Arc magazine. Dibb has made many acclaimed films, including on Federico García Lorca, C. L. R. James, Astor Piazzolla, Miles Davis, Keith Jarrett, Barbara Thompson and other notable subjects. In the words of Sukhdev Sandhu in The Guardian: \"In a career spanning almost five decades, it's possible Dibb has shaped more ideas and offered more ways of seeing than any other TV documentarian of his generation.\"Sukhdev Sandhu, \"Ways of Seeing opened our eyes to visual culture\", The Guardian, 7 September 2012. Mike Dibb is the father of film director Saul Dibb."]}, {"page": "Dibb", "response": ["*Saul Dibb (born 1968), a British film director"]}, {"page": "List of World War II films since 1990", "response": ["|Saul Dibb"]}, {"page": "Clare Perkins", "response": ["Her film credits include Ladybird, Ladybird (Ken Loach), Secrets & Lies (Mike Leigh), Bullet Boy (Saul Dibb) and 7 Lives."]}]}}