{"wiki_id": "http://www.wikidata.org/entity/Q7422765", "itemLabel": "Sarah Scott", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Scott", "wikipedia_page": {"main": "Sarah Scott (née Robinson) (21 September 1720 – 3 November 1795) was an English novelist, translator, social reformer, and member of the Bluestockings. Her most famous work was her utopian novel A Description of Millenium Hall and the Country Adjacent, followed closely by the sequel The History of Sir George Ellison.", "link_mentions": [{"page": "Conyers Middleton", "response": ["Elizabeth Montagu was a granddaughter of Sarah Drake, and she spent much time as a child with the Middletons in Cambridge, as did her sister Sarah Scott."]}, {"page": "1772 in literature", "response": ["*Sarah Scott – The Test of Filial Duty"]}, {"page": "1778 in literature", "response": ["*October – On her father's death, novelist Sarah Scott receives a legacy that enables her to give up writing.Kelly, Gary. \"Scott, Sarah (1720–1795).\" Oxford Dictionary of National Biography. Oxford UP, 2004."]}, {"page": "1750 in literature", "response": ["*Sarah Scott – The History of Cornelia"]}, {"page": "1754 in literature", "response": ["*Sarah Scott:"]}, {"page": "1762 in literature", "response": ["*Sarah Scott – Millenium  Hall and the Country Adjacent"]}, {"page": "1766 in literature", "response": ["*Sarah Scott – The History of Sir George Ellison"]}, {"page": "Matthew Robinson, 2nd Baron Rokeby", "response": ["Lord Rokeby was born Matthew Robinson in a large family from Yorkshire. His parents were Matthew Robinson (1694–1778) of Edgely and West Layton, Yorkshire, and Elizabeth, daughter of Robert Drake of Cambridge; his sisters included the novelists Elizabeth Montagu and Sarah Scott. Of his six brothers, Thomas the second was known as a legal writer, William the fifth as a cleric, and the youngest, Charles, as a Member of Parliament. His father inherited property in the neighbourhood of Rokeby from his great-uncle Matthew Robinson, rector of Burneston; and his mother inherited the Mount Morris estate at Monks Horton, near Hythe, Kent, from her brother Morris Drake Morris, which Rokeby in turn succeeded to in 1746.", "In January 1755 Mrs. Montagu wrote to their sister, Sarah Scott:"]}, {"page": "Sarah Fielding", "response": ["Fielding's sisters died between 1750 and 1751 and Henry in 1754. Fielding retired from London and moved to a small house just outside Bath. The famous philanthropist Ralph Allen and the similarly famous Elizabeth Montagu (a member of the Blue Stockings Society) gave her some financial aid. In about 1767, the novelist Sarah Scott, sister of Elizabeth Montagu, invited Fielding to come and live with her in a female utopian community, as an attempt to create the utopia described in Millenium Hall, but Fielding declined. She died in 1768. There is a memorial plaque to her on the west porch of Bath Abbey.", "*Stockstill, Ashley. \"Better Homes and Gardens: The Fairy World(s) of Sarah Fielding and Sarah Scott\". Feminist Studies in English Literature 6.2 (1998): 137–58."]}, {"page": "Elizabeth Montagu", "response": ["Elizabeth Montagu (née Robinson; 2 October 1718 – 25 August 1800) was a British social reformer, patron of the arts, salonnière, literary critic and writer, who helped to organize and lead the Blue Stockings Society. Her parents were both from wealthy families with strong ties to the British peerage and learned life. She was sister to Sarah Scott, author of A Description of Millenium [sic] Hall and the Country Adjacent. She married Edward Montagu, a man with extensive landholdings, to become one of the richer women of her era. She devoted this fortune to fostering English and Scottish literature and to the relief of the poor.", "She was born in Yorkshire to Matthew Robinson (1694–1778) of West Layton and Edgeley in Yorkshire, and Elizabeth daughter of Robert Drake of Cambridge, by his wife Sarah Morris, daughter of Thomas Morris of Mount Morris, Monks Horton. Elizabeth was the eldest of their three daughters. Conyers Middleton, the prominent Cambridge don, was the second husband of her Drake grandmother Sarah Morris. Between 1720 and 1736 the family owned part of what is now a National Trust property: Treasurer's House, in York. Elizabeth and her sister Sarah, the future novelist Sarah Scott, spent time as children on extended stays with Dr Middleton, as both parents were somewhat aloof. The two girls learned Latin, French, and Italian and studied literature. As a child, Elizabeth and Sarah, in particular, were very close, but grew apart after Sarah became sick with smallpox.", "In 1738, Montagu wrote to Harley explaining that she had no desire for men or marriage. She saw marriage as a rational and expedient convention and did not suppose it possible to love a man. In 1742 she married Edward Montagu, grandson of the Edward Montagu, 1st Earl of Sandwich, who owned numerous coal mines and had several rents and estates in Northumberland. She was 22 and he was 50 years old. The marriage was advantageous, but apparently not very passionate. All the same, she bore a son, John, the next year, and she loved her child immensely. When the child died unexpectedly in 1744, she was devastated. She and Edward remained friendly throughout their remaining time together, but there were no more children or pregnancies. Prior to the loss of her son, she had not been very religious, but his death brought her to take religion increasingly seriously. Meanwhile, her sister, Sarah Scott, was also growing increasingly devout.", "Elizabeth was accompanied most of the time by a lady's companion, in a role derived from that of a royal lady in waiting. A companion would be expected to carry things and aid Elizabeth on her daily round. Barbara Schnorrenberg suggests that Sarah Scott took this function and adds that there is good reason to suggest that Scott married poorly to escape it (Schnorrenberg 723). After Elizabeth's mother died, her father moved to London with his housekeeper or possibly mistress, giving no money at all to his children. When Sarah was removed from her bad marriage, Elizabeth's father (whose ward she was) not only gave her no financial help, but forbade either Elizabeth or Matthew, her brother, from relieving her distress.", "Her most frequent correspondence on literature was with her sister, Sarah Scott, followed by her friends, Elizabeth Carter and Gilbert West. She and Scott were both avid readers of published letters throughout their lives, reading collections by Pope and Swift. This influenced the women's own letter writing. Their frequency of correspondence waxed and waned over the years depending on the circumstances of their lives; Montagu is believed to have written to Scott more frequently than she replied."]}, {"page": "Augustan literature", "response": ["In the midst of this development of the novel, other trends were also taking place. Women were writing novels and moving away from the old romance plots that had dominated before the Restoration. There were utopian novels, like Sarah Scott's Millennium Hall (1762), autobiographical women's novels like Frances Burney's works, female adaptations of older, male motifs, such as Charlotte Lennox's The Female Quixote (1752) and many others. These novels do not generally follow a strict line of development or influence."]}, {"page": "Augustan prose", "response": ["At the same time, women were writing novels and moving away from the old romance plots that had dominated before the Restoration.  There were utopian novels, like Sarah Scott's Millennium Hall (1762), autobiographical women's novels like Frances Burney's works, female adaptations of older, male motifs, such as Charlotte Lennox's The Female Quixote (1752) and many others.  These novels do not generally follow a strict line of development or influence.  However, they were popular works that were celebrated by both male and female readers and critics."]}, {"page": "Bathsua Makin", "response": ["By 1673 Makin and Mark Lewis had established a school for gentlewomen in Tottenham High Cross, then four miles out of London. Elizabeth Drake, the mother of Elizabeth Montagu, and Sarah Scott are said to have been educated at the school. The school at which Makin was governess taught music, song and dance, but also writing in English, keeping accounts, Latin and French. If students wished they could also learn Greek, Hebrew, Italian and Spanish."]}, {"page": "Mary Leapor", "response": ["Bridget Freemantle continued her quest to publish Leapor's work. In 1748 she arranged for the posthumous publication of Poems upon Several Occasions with some 600 subscribers, for the benefit of Philip Leapor. A second volume of poetry and drama was published three years later by Samuel Richardson and edited by Isaac Hawkins Browne. Mary Delany, Stephen Duck, Elizabeth Montagu, and Sarah Scott were among the subscribers. These volumes secured Leapor's reputation as \"one of the most interesting of the natural poets.\"Janet Todd, ed. \"Leapor, Mary (Molly).\" British Women Writers: a critical reference guide. London: Routledge, 1989, p. 402. John Duncombe praised her in The Feminead (1754), and Bonnell Thornton and George Colman included her in their Poems by Eminent Ladies (1755). Leapor herself seems not to have welcomed her status as a \"natural\" poet \"untainted\" by artifice. She worked hard to acquire a literary education as best she could and embraced the neoclassical ideals of her period. At the time of her death she had accumulated 17 volumes and several volumes of plays: a considerable library for someone with a limited income. There are many grammatical errors in Leapor's work, for which Freemantle apologises in the Preface to the \"Poems Upon Several Occasions\", assuring readers that had Leapor lived to edit them, the poems would have been flawless. She adds that they are, nevertheless, entertaining."]}, {"page": "Edward Haytley", "response": ["thumb|Sarah Scott, 1744", "*1744: Sarah Scott"]}, {"page": "Millenium Hall", "response": ["A Description of Millenium Hall and the Country Adjacent is a 1762 novel by Sarah Scott.", "Elizabeth Montagu, Sarah Scott's sister, had become a leader of the bluestockings, a coterie of reform-minded individuals.  They believed in female equality, education, and limited economic justice.  They were also active in prison and health care reform.  Although Elizabeth may be lightly satirized in the figure of Lady Brumpton in Millenium Hall, the Hall is a fictional embodiment of bluestocking ideals.", "Although Millenium Hall has received renewed attention, it is not a novel that participates in the tradition of the novel in general.  Sarah Scott's novel is not primarily interested in character (as Samuel Richardson's had been or Frances Burney's would be) or social act (as Henry Fielding's had been) or entertainment (as Aphra Behn's had been).  Instead, her novel is directed toward morality, example, and, to some degree, a polemic of female education.  It seeks to reform the individual female reading the novel and engage the male reader in pity.  As the subtitle to the novel says, it contains \"Anecdotes and Reflections as May excite in the Reader proper Sentiments of Humanity, and lead the Mind to the Love of VIRTUE,\" with 'virtue' being understood in its masculine (virtus) and feminine (virginity) senses."]}, {"page": "Baron Rokeby", "response": ["Elizabeth Montagu, sister of the second Baron, was a social reformer, patron of the arts, hostess, literary critic and writer. Sarah Scott, another sister of the second Baron, was a novelist, translator and social reformer."]}, {"page": "Mary: A Fiction", "response": ["Wollstonecraft's epigrammatic allusion to Rousseau's Julie (1761) signifies her debt to the novel of sensibility, one of the most popular genres during the last half of the 18th century. Along with other female writers, such as Mary Hays, Helen Maria Williams, Charlotte Turner Smith, Mary Robinson, Maria Edgeworth, and Hannah More, Wollstonecraft felt compelled to respond to the Rousseauvean ideological aesthetic that had come to dominate British fiction.Kelly, \"Introduction\" to Mary, ix; see also Anne K. Mellor, \"The Rights of Woman and the women writers of Wollstonecraft's day\" in The Cambridge Companion to Mary Wollstonecraft. Romantic heroines, Wollstonecraft scholar Gary Kelly writes, \"represent woman constructed for man: the heroic feminine victim of the courtly rake and gallant, the virtuous feminine companion of the ideal professionalized gentleman, and the intellectually and erotically subservient companion of the ideal bourgeois man\".Kelly, Revolutionary Feminism, 42. Wollstonecraft would also attack Rousseau in her best-known work, A Vindication of the Rights of Woman, because of his sexism in the second part of Emile. She announces in the \"Advertisement\" (a section similar to a preface) of Mary that she is offering her heroine, who is a \"genius\", as a contrast to characters such as Samuel Richardson's Clarissa and Rousseau's Sophie.Kelly, Revolutionary Feminism, 42; see also Wollstonecraft, Mary (Kelly), 1. In addition the text is peppered with allusions to popular sentimental novels such as The History of Eliza Warwick (1778) and The Platonic Marriage (1787), which critique their presentation of the heroine of feminine sensibility. Mary is more akin to the charitable and industrious heroines of Bluestocking Sarah Scott's Millenium Hall (1762) than to the passive, weepy heroines found in most sentimental novels.Kelly, Revolutionary Feminism, 50. Debate concerning the relationship between gender and sensibility continued into the early 19th century; Jane Austen, for example, made it the explicit focus of her novel Sense and Sensibility (1811).Mellor, 156."]}, {"page": "List of LGBT writers", "response": ["| Sarah Scott || 1723–1795 || English || novelist ||A Description of Millenium Hall and the Country Adjacent"]}, {"page": "Jane Collier", "response": ["Collier's The Art of Ingeniously Tormenting has been described as the \"best-known generic satire written in the 18th century by a woman.\"Rizzo \"Renegotiating\" p. 59 She is one of the many female 18th-century authors (including Frances Burney, Sarah Fielding, Sarah Scott, and Charlotte Smith) who experimented with \"alternative models for relationships, for different ways of regarding others and even for ameliorating society.\"Rizzo p. 24"]}, {"page": "Sarah Robinson", "response": ["* Sarah Scott (née Sarah Robinson, 1723–1795), writer and social reformer"]}, {"page": "List of horror films of 2005", "response": ["| Olga Levens || Sarah Scott, Travis Hammer, Courtney Scheuerman || United States || "]}, {"page": "George Lewis Scott", "response": ["He was married for a short time to the writer Sarah Scott but they separated after less than a year. His younger brother Caroline Frederick Scott was an army officer, who gained a reputation for brutality in the aftermath of the "]}, {"page": "Duke Ernest Gottlob of Mecklenburg", "response": ["Ernest was described by novelist Sarah Scott as a \"very pretty sort of man, with an agreeable person.\"Moore, p. 38. In March 1762 Ernest was said, according to Scott, to have \"fallen desperately in love with\" Mary Eleanor Bowes, the richest heiress in Britain and possibly the richest in Europe.Moore, p. 30. Scott speculated that were the marriage to take place, Ernest would become even richer than his elder brother Adolphus Frederick IV, Duke of Mecklenburg. However, King George III disallowed the marriage, as he disapproved of his brother-in-law marrying someone not of royal blood. Charlotte Papendiek, Queen Charlotte's wardrobe keeper, wrote many years later that the match would \"have made him a Prince indeed; but as he was a younger brother, it might have disturbed the harmony of the house of Mecklenburg-Strelitz.\"Papendick, p. 75.Moore, pp. 38–39. Ernest does not appear in Mary's letters, and it does not seem likely that his affection was reciprocated.Moore, p. 39."]}, {"page": "List of utopian literature", "response": ["*Millenium Hall (1762) by Sarah Scott"]}]}}