{"wiki_id": "http://www.wikidata.org/entity/Q7436380", "itemLabel": "Scott Gammer", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Gammer", "wikipedia_page": {"main": "Scott Gammer (born 24 October 1976) is a Welsh former professional boxer who competed from 2002 to 2009. He held the British heavyweight title from 2006 to 2007 and challenged once for the lesser European Union heavyweight title in 2008.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Scott Gammer (born 1976)"]}, {"page": "Danny Williams (boxer)", "response": ["In December 2006 when Skelton dropped out of a fight with Audley Harrison, Williams stepped in at a weeks notice. By his own admission he had been training for eight weeks for a fight with British champion Scott Gammer. Williams lost by T.K.O. in the 3rd round, suffering a broken nose.", "In March 2007 Williams regained the British title in Wales with a 9th-round knockout of Scott Gammer. Williams came in at the lightest he had been since his pro debut 16 stones 4 pounds {4 stones lighter than his previous fight} after training himself for the fight just with a piece of paper that contained a conditioning programme given to him by Joe Dunbar who had worked with Lennox Lewis.", "|style=\"text-align:left;\"| Scott Gammer"]}, {"page": "Audley Harrison", "response": ["Williams had trained 8 weeks for a fight with British champion Scott Gammer. This time Harrison fought far more aggressively, decking Williams twice and winning on a third-round knockout. Williams suffered a broken nose and severe lacerations, and Harrison was once again lauded as a contender for a world title. Following the victory over Williams, Harrison signed a promotional deal with Frank Warren, whose aim was to get Harrison a world title fight in 2007."]}, {"page": "Julius Francis", "response": ["|align=left| Scott Gammer"]}, {"page": "Robert Helenius", "response": ["Helenius turned pro in 2008 to fight for Germany's Wilfried Sauerland. In 2009 Helenius knocked out former British heavyweight champion Scott Gammer and defeated Taras Bidenko with a third round stoppage.", "|style=\"text-align:left;\"| Scott Gammer"]}, {"page": "List of British heavyweight boxing champions", "response": ["|align=left | Scott Gammer"]}, {"page": "Francesco Pianeta", "response": ["|style=\"text-align:left;\"| Scott Gammer"]}, {"page": "John McDermott (boxer)", "response": ["In September 2007, he had also become the mandatory challenger for a second shot at the British title after beating Scott Gammer on points over 10 rounds. He had fought for the title once before in December 2005 losing in the 1st round to Matt Skelton.", "|style=\"text-align:left;\"| Scott Gammer"]}, {"page": "Paul Hyland (boxer)", "response": ["Hyland turned professional on 5 November 2004 in Hereford Leisure Centre, England on an undercard of bill that included Jason Cook, Jason McKay and Scott Gammer. In his début Hyland defeated fellow débutant Hungarian Janos Garai with a second-round TKO knockout."]}, {"page": "Prizefighter series", "response": ["The eighth tournament was held on 2 October 2009, it was originally due to be held at the York Hall in Bethnal Green, but was moved to the larger ExCeL London due to demand for tickets, increasing the potential attendance by 5,000. The boxers involved initially were Danny Williams, Audley Harrison, Michael Sprott, Scott Gammer, Scott Belshaw, Michael Holden, Coleman Barrett and Danny Hughes."]}, {"page": "Coleman Barrett", "response": ["Coleman competed in the Prizefighter series on 2 October 2009 at the ExCeL London, London Docklands, London. He made his way to the final as a 25/1 outsider, beating Scott Gammer and Carl Baker, losing to Audley Harrison by TKO in round 2 of 3. Barrett recently won the Irish heavyweight title against Colin Kenna.", "| Scott Gammer"]}, {"page": "Carl Baker (boxer)", "response": ["|style=\"text-align:left;\"| Scott Gammer"]}, {"page": "Boxing in Wales", "response": ["|align=left | Scott Gammer"]}, {"page": "Roman Bugaj", "response": ["Among his more illustrious opponents have been Sinan Şamil Sam, Scott Gammer, Ruediger May and  WBO cruiserweight title holder and British number 2 cruiserweight Enzo Maccarinelli.", "|align=left| Scott Gammer"]}, {"page": "List of male boxers", "response": ["*Scott Gammer"]}, {"page": "Franklin Egobi", "response": ["Nicknamed \"the Prince\", Egobi started his boxing career in South Africa, making his debut against Donovan Luff on 22 February 2000 and winning a unanimous judges decision after four rounds. He fought seven more times, all knock-out victories, before defeating Isaac Mahlangu for the IBF Continental Africa heavyweight title on 25 September 2001. His first defeat was at the hands of Petr Sedlak in Ploiești, Romania on 24 June 2003. Egobi was due to fight Scott Gammer on in June 2007 as a replacement for Colin Kenna (who had suffered a nose injury), but Egobi in turn suffered an injury of his own and pulled out of the fight four days before."]}, {"page": "List of Welsh boxing champions", "response": ["|align=left | Scott Gammer"]}]}}