{"wiki_id": "http://www.wikidata.org/entity/Q743330", "itemLabel": "Alex Brown", "itemDescription": "English rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Brown_(rugby_union,_born_1979)", "wikipedia_page": {"main": "Alex Brown (born 17 May 1979 in Bristol) is a former English rugby union player, who played at lock position.\nHe attended Colston's Collegiate School in Bristol.\nHe started playing rugby at u7s level for Clifton in 1985 and worked his way through the age levels there\nAfter a brief period with Bath and Pontypool, he joined his home city club Bristol and was a key player when they won the first Under 21 Zurich Premiership. Under the tutelage of rugby director Dean Ryan, he was voted the club’s player of the year in the 2000–01 season. Brown's father played rugby for Clifton.\nBrown signed for Gloucester Rugby in the summer of 2003 rejoining Dean Ryan. The England Saxons international topped the line-out statistics charts during the 2003–04 season and was voted the players' player of the year.\nHe played for England Saxons in the first Churchill Cup and was called into the England senior squad for the 2005 Autumn Internationals.Brown was expected to make his international debut against Australia in November, but he suffered a neck injury and was ruled out of the entire Autumn programme.He made his senior international debut for England during their 2006 summer tour, in a defeat to Australia.Brown then played in both tests on the 2007 summer tour, England losing both games to South Africa. He picked up the Gillette Power Award for the 2006–07 season. He is widely regarded as one of the most consistent performers in the Premiership and then signed a three-year contract extension with Gloucester until 2011. After proving himself one of the most consistent lock forwards in the premiership, Brown's contract was extended until 2013. Unfortunately, following an shoulder injury sustained during the first match of the 2012-13 season, Brown was forced to announce his retirement on 20 December 2012He was appointed Rugby Operations Manager at Kingsholm Stadium with Gloucester Rugby in 2013. He became a director in 2019, In 2020 he was further promoted to Chief Operating Officer; a role which will partly replace director of rugby.", "link_mentions": [{"page": "Gloucester Rugby", "response": ["On 27 June 2020, Gloucester announced London Irish Forwards Coach George Skivington as their new head coach, with Alex Brown promoted to the position of Chief Operating Officer. This means Skivington handles the playing side of his new job whilst Brown focuses on rugby related matters like recruitment and regulatory issues at Gloucester.", "*Alex Brown — Chief Operating Officer"]}, {"page": "Steve Borthwick", "response": ["Borthwick initially failed to make England's squad for the 2005 Autumn internationals, with Gloucester forward Alex Brown seemingly poised for a start instead, but injury ruled Brown out of contention and Borthwick stepped in, playing a significant role against Australia, New Zealand and Samoa."]}, {"page": "Alex Brown", "response": ["Alex Brown may refer to:", "* Alex Brown (cornerback) (born 1996), American football player", "* Alex Brown (defensive end) (born 1979), American football player", "* Alex Brown (footballer, born 1914) (1914–2006), English football forward for Chesterfield, Darlington, and Mansfield", "* Alex Brown (footballer, born 1992), English footballer", "* Alex Brown (Liberian footballer) (born 1978)", "* Alex Brown (rugby league) (born 1987), Jamaican rugby league player", "* Alex Brown (rugby union, born 1905) (1905–1986), Scotland international rugby union player", "* Alex Brown (rugby union, born 1979), former English rugby union player", "* Alex Brown (rugby union, born 1989), English rugby union player for Exeter Chiefs", "* Alex Brown (musician) (1966–2019), American guitarist", "* Alex Brown, prominent businessperson and landowner in the history of Walnut Grove, California", "* Alex Browne (disambiguation)"]}, {"page": "Marco Bortolami", "response": ["In the summer of 2006 he joined English Premiership side Gloucester Rugby when he was considered by many top judges to be one of the best players in the world around the time, and stepped straight into the starting team for their first game of the season, immediately taking the role of captain. He made a formidable partnership with Alex Brown and shared captaincy with Peter Buxton. Due to injuries and World Cup commitments, the 2007–08 season wasn't as consistent and he lost the Italian captaincy to Italian No. 8 Sergio Parisse, but continued to put in powerful performances for Gloucester. His outstanding leadership qualities meant he kept the captaincy last year and by the end of the season he was back to his formidable best. He made 23 appearances for Gloucester in 2008–09."]}, {"page": "Franklin's Gardens", "response": ["|RL ||5 || Alex Brown"]}, {"page": "2006–07 Premiership Rugby", "response": ["|RL ||5 || Alex Brown "]}, {"page": "Dave Attwood", "response": ["Attwood attended The Ridings High School in Bristol.  He graduated from Bristol University with a joint Honours degree in Physics and Philosophy with the support of the Bristol Rugby Academy before moving on to the First Team squad. His rugby heroes include Alex Brown, Will Greenwood and coach and personal friend Phil Cue, his then coach at Bristol Minis and Juniors and Dings Crusaders. In 2007 aged 20, he was described as \"the thinking man's Martin Johnson\" (rugby union). He was England under 16 discus champion and still enjoys throwing although he complains that \"he never finds the time.\""]}, {"page": "2006 England rugby union tour of Australia", "response": ["England: 15.Iain Balshaw, 14.Tom Varndell, 13.Mathew Tait, 12.Mike Catt, 11.Tom Voyce, 10.Olly Barkley, 9.Peter Richards, 8.Pat Sanderson (capt.), 7.Lewis Moody, 6.Magnus Lund, 5.Alex Brown, 4.Louis Deacon, 3.Julian White, 2.Lee Mears, 1.Graham Rowntree,  – replacements: 16.George Chuter, 17.Tim Payne, 18.Chris Jones, 19.Joe Worsley, 20.Nick Walshe, 21.Andy Goode, 22.Jamie Noon "]}, {"page": "2007 England rugby union tour of South Africa", "response": ["|align=right|Victor Matfield||align=right|L||align=center|5||L||Alex Brown", "|align=right|Victor Matfield||align=right|L||align=center|5||L||Alex Brown"]}, {"page": "2008–09 EDF Energy Cup", "response": ["|RL ||5 || Alex Brown"]}, {"page": "List of England national rugby union players", "response": ["|1269||Alex Brown||lock ||2006-06-11||v Australia at Sydney"]}, {"page": "2009–10 LV Cup", "response": ["|RL ||5 || Alex Brown"]}, {"page": "2010–11 LV Cup", "response": ["|RL ||5 || Alex Brown"]}, {"page": "List of 2013–14 Premiership Rugby transfers", "response": ["* Alex Brown retired "]}, {"page": "2006 Barbarians end of season tour", "response": ["England XV: 15. Mark Van Gisbergen; 14.James Simpson-Daniel (Armitage from 77'), 13.Mathew Tait, 12.Mike Catt; (Stuart Abbott from 55'), 11.Iain Balshaw; 10.Olly Barkley, 9.Peter Richards(Scott Bemand from 75'); 8. Pat Sanderson (capt) 7.Michael Lipman(James Haskell from 75'), 6.James Forrester, 5.Alex Brown, 4. James Hudson (Kieran Roche from 55'), 3. Duncan Bell, 2. Lee Mears (David Paice from 55'), 1.Tim Payne (David Barnes from 55') "]}, {"page": "Leicester Tigers in cup finals", "response": ["|RL ||5 || Alex Brown "]}]}}