{"wiki_id": "http://www.wikidata.org/entity/Q7436050", "itemLabel": "Scott Brown", "itemDescription": "English association football player, born May 1985", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Brown_(footballer,_born_May_1985)", "wikipedia_page": {"main": "Scott Brown (born 8 May 1985) is an English professional footballer who plays as a central midfielder. He has played in the English Football League for Bristol City, Cheltenham Town, Port Vale, Morecambe and Accrington Stanley.\nStarting his career with Everton in their youth system, before moving on to Bristol City, having failed to make an appearance for Everton. After three years with City, he transferred to Cheltenham Town in January 2007. Not longer after joining Cheltenham he broke his leg and spent the next 18 months in recovery and then had a brief spell with Port Vale, before signing for Morecambe in 2010. After a brief spell with Fleetwood Town, he signed with York City in January 2012. He played for York in the victorious 2012 Conference Premier play-off Final at Wembley Stadium, which saw the club promoted to League Two. He had a brief spell at Macclesfield Town in August 2012, before joining Chester the following month. He helped Chester to win both the Conference North title and the Cheshire Senior Cup in the 2012–13 season.\nBrown signed with Southport in July 2013, and stayed with the club for one season before joining Conference Premier club Grimsby Town for an 18-month stay in June 2014. He signed with Accrington Stanley in January 2016, and helped the club win the League Two title in the 2017–18 season. He joined Harrogate Town in May 2019 and spent much of the 2019–20 and 2020–21 seasons loan at Warrington Town.", "link_mentions": [{"page": "Runcorn", "response": ["* Scott Brown (born 1985), footballer"]}, {"page": "Scott Brown", "response": ["Scott Brown may refer to:", "*Scott Brown (American football), American college football coach of Kentucky State", "*Scott Brown (baseball) (born 1956), former Major League Baseball pitcher for the Cincinnati Reds", "*Scott Brown (footballer, born April 1985), English footballer (goalkeeper)", "*Scott Brown (footballer, born May 1985), English footballer", "*Scott Brown (footballer, born June 1985), Scottish footballer for Hibernian, Celtic and Scotland", "*Scott Brown (footballer, born 1994), Scottish footballer for Clyde and Bradford City", "*Scott Brown (gymnast) (born 1983), Australian trampolinist", "*Scott Brown (golfer) (born 1983), American professional golfer", "*Scott Brown (bassist), Canadian bassist of the rock band Trooper", "*Scott Brown (broadcaster), Scottish television producer", "*Scott Brown (DJ) (born 1972), Scottish disc jockey", "*Scott Brown (politician) (born 1959), former U.S. Ambassador to New Zealand and Samoa; former United States Senator", "*Scott Brown (Royal Navy chaplain) (born 1968), Chaplain of the Fleet of the Royal Navy", "*Scott Brown (writer), American author, screenwriter, critic, and composer", "*Scott Brown, character in The OA", "*Archie Scott Brown (1927–1958), British racing driver", "*Denise Scott Brown (born 1931), Rhodesian-American architect"]}, {"page": "Luke Howell", "response": ["Having stayed for the club about two months until on 26 October 2010, he took part in an open training session, while under the supervision of Steve Tilson and Paul Brush at Lincoln City. He is subsequently signed on a one-month loan with the Imps after failing to break into the MK Dons first team. He made his debut, in a 2–2 draw against Wycombe Wanderers. In a match against Morecambe, he suffered a horror tackle from Scott Brown, which he lucky to escape from having a serious injury, which ended his loan spell at Lincoln City. Instead, he was out for four weeks A week later, Howell extended his loan spell until the New Year."]}, {"page": "Dean Glover", "response": ["A win at Shrewsbury Town instigated a run of four away wins out of five. However Vale soon returned to their poor form, and slid back down the table. At the end of October, former Vale star Dave Brammer joined on loan from Millwall, and would join permanently in the January transfer window. The next month Scott Brown also arrived on loan from Cheltenham Town, and would also join on a permanent transfer two months later. This is also what happened with defender Gareth Owen, who arrived after leaving Stockport County following a bust-up with Jim Gannon. Notts County player Neil MacKenzie also joined on loan, but would not enjoy his short stay in Stoke-on-Trent. Attempts to bring back Chris Birchall on loan failed. Leaving Burslem was Chris Slater, who returned to former club Chasetown. In December, Andy Porter left the club's backroom staff after seventeen years at the club, highlighting the unrest in the camp. Both Porter and Mark Grew had turned down offers to become Glover's assistant."]}, {"page": "2008–09 Port Vale F.C. season", "response": ["The season started well in August, but all four league games in September ended in defeat. However Sinnott refused to compromise his managerial philosophy in order to pick up results. A 4–1 home defeat to Macclesfield Town on 20 September would prove to be Sinnott's last game in charge. Sinnott was sacked on 22 September, with the Valiants in 16th place, Dean Glover taking over as caretaker manager for the second time in twelve months. The players were against the decision to axe Sinnott. Sinnott would later take court action against the club for a breach of contract, and settle out of court. Glover was appointed as manager on a permanent basis on 6 October. A win at Shrewsbury Town instigated a run of four away wins out of five. However Vale soon returned to their poor form, and slid back down the table. At the end of October, former Vale star Dave Brammer joined on loan from Millwall, and would join permanently in the January transfer window. The next month Scott Brown also arrived on loan from Cheltenham Town, and would also join on a permanent transfer two months later. This is also what happened with defender Gareth Owen, who arrived after leaving Stockport County following a bust-up with Jim Gannon. Notts County player Neil MacKenzie also joined on loan, but would not enjoy his short stay in Stoke-on-Trent. Attempts to bring back Chris Birchall on loan failed. Leaving Burslem was Chris Slater, who returned to former club Chasetown. In December, Andy Porter left the club's backroom staff after seventeen years at the club, highlighting the unrest in the camp. Both Porter and Mark Grew had turned down offers to become Glover's assistant.", "At the end of the season most of the playing staff were retained, though Scott Brown returned to Cheltenham Town, Kyle Perry was released and signed with Mansfield Town, and Dave Brammer had to retire after Chairman Bill Bratt informed him via voicemail that he would not be offered a new contract. Youth team graduate Paul Dixon was not offered a new contract. Dean Glover, unpopular with the fans, was also informed that he would not be retained as manager for the following season, and left the club permanently after he rejected the opportunity to remain as a youth coach. A slow uptake of season ticket sales was one major factor in Glover's sacking. Following Glover's departure the club withdrew their contract offer to Paul Edwards, who went on to play for Barrow. However Player of the Year Joe Anyon stayed at the club, despite claiming other clubs were interested in his signature.", "|align=\"left\"|MF||15||align=\"left\"| Scott Brown", "|–||MF||||15||Scott Brown||1||0||0||0||1", "| January 2009 || MF ||  || Scott Brown || Cheltenham Town || Free transfer || ", "| 21 November 2008 || MF ||  || Scott Brown || Cheltenham Town || 2 January 2009 || "]}, {"page": "2011–12 York City F.C. season", "response": ["York were 2–0 down in their New Year's Day fixture at home to Mansfield until the 77th minute when Blair scored, and in the first minute of stoppage time substitute Fyfield scored the equaliser to draw the match at 2–2. Ashikodi was signed on a permanent contract until the end of the season, having scored one goal in six appearances for the club while on loan. Challinor signed an extended contract until the end of the season, while McDermott was allowed to join Telford after being unable to break into the team. Henderson joined Forest Green for a second loan spell, signing until the end of the season. On the same day, York signed former Fleetwood midfielder Scott Brown on a contract until the end of the season. Blair scored both of York's goals in a 2–0 victory away to Lincoln, which was the team's first win in five league matches. Striker Matthew Blinkhorn was signed on a contract until the end of the season after his contract with League of Ireland Premier Division club Sligo Rovers expired.", "|Scott Brown", "|Scott Brown", "!scope=row|Scott Brown"]}, {"page": "2012 Conference Premier play-off Final", "response": ["|MF ||19||Scott Brown || "]}, {"page": "2012–13 York City F.C. season", "response": ["Following the previous season's conclusion Moses Ashikodi, Matthew Blinkhorn, Eugen Bopp and Scott Brown were released, while James Meredith, Adriano Moke and Danny Pilkington departed for Bradford City, Cambridge United and Kidderminster Harriers respectively. Jon Challinor, Chambers, Chris Doig, Jamal Fyfield, Michael Ingham, Scott Kerr and Daniel Parslow signed new contracts with York. New players signed ahead of the start of the season were defender Danny Blanchett from Burton Albion, midfielders Lee Bullock from Bradford City, John McReady from Darlington 1883 and Jonathan Smith from Swindon Town, winger Michael Coulson from Grimsby Town and striker Oli Johnson from Oxford United. Midfielder Tom Platt, the previous season's youth-team captain and Youth Team Player of the Year, entered the first-team squad after agreeing a professional contract."]}, {"page": "Scott Brown (footballer born May 1985)", "response": ["#REDIRECT Scott Brown (footballer, born May 1985)"]}, {"page": "2015–16 Accrington Stanley F.C. season", "response": ["!scope=\"row\"|Scott Brown"]}, {"page": "2015 Conference Premier play-off Final", "response": ["|CM ||4 || Scott Brown ||  || "]}, {"page": "2016 Football League Two play-off Final", "response": ["Wimbledon's opponents in their play-off semi-final were Accrington Stanley with the first match of the two-legged tie being played on 14 May 2016 at Kingsmeadow in Greater London.  After a goalless first half in which no shots on target were made by either side, Tom Beere's low shot three minutes into injury time beat Neil Etheridge in the Accrington goal to ensure the match ended 1–0.  The second leg of the semi-final play-off took place four days later at the Crown Ground in Accrington.  Josh Windass levelled the tie with a penalty six minutes before half-time after Scott Brown was fouled.  Piero Mingoia then put Accrington ahead on aggregate with a strike in the 59th minute.  Midway through the second half, a header from Adebayo Akinfenwa made it 2–1 and with no further change to the scoreline, the game went into extra time.  Lyle Taylor then scored after Etheridge had saved an effort from Jake Reeves, and Wimbledon progressed to the final with a 3–2 aggregate victory."]}, {"page": "2016–17 Accrington Stanley F.C. season", "response": ["|align=left|Scott Brown", "|Scott Brown"]}, {"page": "2016–17 Cheltenham Town F.C. season", "response": ["| 9 January 2017 || GK ||  || Scott Brown || Wycombe Wanderers || End of season || "]}, {"page": "2017–18 Wycombe Wanderers F.C. season", "response": ["| 1 ||  || Scott Brown ||  || 2016"]}, {"page": "2017–18 Accrington Stanley F.C. season", "response": ["|align=left|Scott Brown", "||MF||8||align=left| Scott Brown||1||0||0 ||1||2", "|Scott Brown"]}, {"page": "2018–19 Accrington Stanley F.C. season", "response": ["|align=left| Scott Brown"]}, {"page": "2019–20 Accrington Stanley F.C. season", "response": ["| 1 July 2019 || DM ||  || Scott Brown ||  Harrogate Town || Free transfer || "]}]}}