{"wiki_id": "http://www.wikidata.org/entity/Q7436604", "itemLabel": "Scott Kay", "itemDescription": "Footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Kay", "wikipedia_page": {"main": "Scott John David Kay (born 18 September 1989) is an English semi-professional footballer who plays for Ashton United .\n\n", "link_mentions": [{"page": "Kay (surname)", "response": ["* Scott Kay, Jewelry Designer"]}, {"page": "Finlay Enterprises", "response": ["Bailey Banks & Biddle was formerly owned by Zale corporation.  They compete with other high-end retailers such as Tiffany and independent jewelry stores.  The name \"Zell Bros\" is used for one location.  The stores tend to carry many high-end designer lines, including Scott Kay, Tacori, Ritani, Mikimoto, and David Yurman.  Stores use the slogan \"Where Treasures Live\".  There were 72 Bailey Banks and Biddle locations as of May 22, 2007.  15 Texas locations branded as \"Corrigan's\" and \"Sweeney's\" were transferred to the Bailey Banks & Biddle nameplate when Zale decided to make the chain national."]}, {"page": "Richard Brodie (footballer)", "response": ["Brodie joined Southport permanently on 18 June 2014, being signed by his former York and Hereford manager Foyle. His first appearance after signing permanently came as a 62nd-minute substitute for Scott Kay in a 0–0 away draw with Torquay United on 16 August 2014, before starting the following match, a 2–1 home win over Altrincham a week later, scoring Southport's first goal after reacting first to a John Marsden header that had hit the post. Brodie was Southport's top scorer in 2014–15 with 14 goals from 41 appearances as Southport finished 19th in the Conference Premier. He signed a new contract with the club in May 2015."]}, {"page": "2011–12 Manchester City F.C. season", "response": ["|  Scott Kay"]}, {"page": "2011–12 Macclesfield Town F.C. season", "response": ["|4 || ||MF ||Scott Kay || 3 || 0 || 0 || 0 || 1 || 0 || 0 || 0 || 4 || 0", "| Scott Kay"]}, {"page": "Scott (given name)", "response": ["* Scott Kay, English footballer"]}]}}