{"wiki_id": "http://www.wikidata.org/entity/Q7437013", "itemLabel": "Scott Paterson", "itemDescription": "Scottish footballer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Paterson", "wikipedia_page": {"main": "Scott Thomas Paterson (born 13 May 1972) is a Scottish professional football coach and former player who played as a defender. He was most recently assistant manager of Partick Thistle. He played for numerous clubs in Scotland and England, including Liverpool, Carlisle United, Bristol City, Partick Thistle and Dundee United.", "link_mentions": [{"page": "Partick Thistle F.C.", "response": ["On 30 January 2013, Alan Archibald was appointed as the club's interim manager, with former Thistle player Scott Paterson as his assistant. On 22 March, the duo were given the job on a permanent basis signing a one-year rolling contract. The following month on 20 April 2013, the club clinched promotion to the Scottish Premiership having sealed the First Division championship with a 2–0 victory away to Falkirk. The title win meant Thistle returned to the top flight of Scottish football for the first time in nine years. The team also lost the Scottish Challenge Cup final to Queen of the South on penalties in April 2013."]}, {"page": "Cowdenbeath F.C.", "response": ["|Assistant Manager|| Scott Paterson"]}, {"page": "Alan Archibald", "response": ["On 30 January 2013, he was appointed interim manager with former player Scott Paterson as assistant following the departure of Jackie McNamara to Dundee United. On 22 March, the duo were given the job on a permanent basis signing a one-year rolling contract. Archibald later guided Thistle to the First Division title (now known as the Championship) gaining the Jags promotion to the Scottish Premiership. Thistle also lost the Scottish Challenge Cup final to Queen of the South on penalties in April 2013."]}, {"page": "Scott Patterson (disambiguation)", "response": ["* Scott Paterson (born 1972), Scottish footballer", "* G. Scott Paterson (born 1964), venture capitalist"]}, {"page": "Scott Paterson (footballer)", "response": ["#REDIRECT Scott Paterson"]}, {"page": "1999–2000 Cambridge United F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Scott Paterson"]}, {"page": "2012–13 Partick Thistle F.C. season", "response": ["Thistle began the season under the management of Jackie McNamara. On 29 January 2013, the club gave permission to Dundee United to speak to McNamara about becoming their new manager. The following day McNamara and his assistant Simon Donnelly resigned, to become the new management team at United. Later the same day the club announced that Alan Archibald and Scott Paterson would take over as the club's interim management team. On 22 March, the duo were given the job on a permanent basis signing a one-year rolling contract."]}, {"page": "David Beattie (businessman)", "response": ["He was formally the chairman of his boyhood team Partick Thistle. As director, he helped the club see off a debt of around £3 million and, along with a managerial team of Alan Archibald and Scott Paterson, led Thistle into the 2013-14 Scottish Premiership. He also introduced the club's popular under-16s go free to Firhill scheme along with the then manager Ian McCall."]}, {"page": "2004–05 Partick Thistle F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Scott Paterson"]}, {"page": "1999–2000 Plymouth Argyle F.C. season", "response": ["| 16|| || DF|| Scott Paterson|| 5|| 0|| 0"]}]}}