{"wiki_id": "http://www.wikidata.org/entity/Q7436835", "itemLabel": "Scott McLean", "itemDescription": "Scottish footballer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_McLean_(footballer,_born_1976)", "wikipedia_page": {"main": "Scott James McLean (born 17 June 1976 in East Kilbride, South Lanarkshire) is a Scottish professional footballer.\nA striker, McLean began his career with St Johnstone in 1995. He remained at McDiarmid Park for just a year, making six league appearances. In 1996, he joined Inverness Caledonian Thistle. In three years with the Highland club he made 48 appearances, scoring 32 goals. After a loan period at Queen of the South in 1999, he joined Partick Thistle. He went on to make 80 appearances for the Jags and scored 38 goals in the process.\n\nMcLean won the Scottish third, second and championship trophy's and was named PFA second division player of the year in 2002 with Thistle.\n\nIn 2002, he signed for St Mirren, but remained with the club for just six months before moving to Stirling Albion. He scored 30 goals for Albion in 49 appearances. His most recent club, for the 2005-06 season, was Stranraer.He currently owns a successful building company", "link_mentions": [{"page": "2003–04 Scottish Third Division", "response": ["|  Scott McLean ||style=\"text-align:center\"|21 ||Stirling Albion"]}, {"page": "Scottish Football League monthly awards", "response": ["| Scott McLean"]}, {"page": "List of Inverness Caledonian Thistle F.C. seasons", "response": ["|Scott McLean"]}, {"page": "1999 Scottish Challenge Cup Final", "response": ["Newly promoted to the First Division as runners-up in the Second Division the previous season, Inverness entered the first round and faced fellow First Division club St. Mirren at Caledonian Stadium. Inverness won the match 1–0 with a late goal in the 88th minute from Mike Teasdale to progress to the second round.\"Results – BELL'S SCOTTISH LEAGUE CHALLENGE CUP First round\", The Guardian (London), 11 August 1999. Retrieved 28 May 2013. The second round draw paired the club with Second Division club Hamilton Academical at Douglas Park. Inverness comfortably won the tie 3–0 with two goals from Iain Stewart and one from Scott McLean to advance to the quarter-finals. Results & Matches on: Tue, 24 Aug 1999, soccerbase.com, Retrieved 28 May 2013."]}, {"page": "List of Partick Thistle F.C. seasons", "response": ["|Scott McLean"]}, {"page": "Scott McLean", "response": ["Scott McLean may refer to:", "* Scott McLean (American football) (born 1960), linebacker (Dallas Cowboys)", "* Scott McLean (footballer, born 1976), Scottish footballer (St. Johnstone, Inverness CT, Partick Thistle)", "* Scott McLean (footballer, born 1997), Scottish footballer (Kilmarnock FC)", "* Scott McLean (rugby league) (born 1981), Australian rugby league player"]}]}}