{"wiki_id": "http://www.wikidata.org/entity/Q7436015", "itemLabel": "Scott Bond", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Scott_Bond", "wikipedia_page": {"main": "Scott Bond is a trance music artist, producer, and promoter from Birmingham, England, who began DJing in 1989. He started out DJing at venues such as Cream, Miss Moneypenny's, Fun and Gatecrasher, which he co-founded. He has toured internationally with Gatecrasher. He was voted World's Finest Resident DJ in the Mixmag Dance Awards.Scott Bond, John Purser, Darren Hodson and Nick Rose have also recorded under the name Q:Dos, producing and writing dance tracks as well as re-mixing for most of the major dance labels. Scott has also worked on many tracks with Solarstone. One of his most critically acclaimed releases has been in collaboration with Solarstone, a track called \"Third Earth\" [more commonly known as 3rd Earth].One of his mix albums is called Gatecrasher Wet.\nHis most recent production Airfoil is a collaboration with Marc Mitchell, and was released in September 2014.\n\n", "link_mentions": [{"page": "Gatecrasher", "response": ["Gatecrasher is an international clubbing brand made famous by the \"Gatecrasher\" (later \"Crasher\") dance music events, which were held at the Republic nightclub in Sheffield, UK during the late 1990s and early 2000s. The promoters of the brand were Linus Schaxmann, Simon Raine and Simon Oates and, until 2004, Scott Bond. By August 2014, the only Gatecrasher venue remaining was located in the United Kingdom city of Birmingham. This venue was closed down permanently by the authorities on 25 November 2015.", "During the early 1990s, Scott Bond was a DJ for nightclubs in Birmingham. In approximately 1992, Bond met Simon Raine who was the manager of a club called Bakers at the time. Bond subsequently agreed to become the new resident DJ at Bakers, while Raine focused on the promotion of a new club night called Absolutely Ridiculous. In 1993, Bond started his own night at Bakers called Republica and later that year, the pair decided to collaborate on a new one-off event named Gatecrasher.", "Gatecrasher offered an all-night event, with big-name DJs throughout the night, with Judge Jules as resident DJ. This attracted people from all over the country who liked a style of music that was originally Techno and House oriented. The door admittance policy was notoriously strict, seemingly turning people away for no apparent reason. Instead of discouraging people to attend, this policy only made the event more popular as gaining admittance to the club only added to the sense of excitement. The door policy also ensured that only dedicated and enthusiastic clubbers gained access. This resulted in a clientele and atmosphere that was rare at that time in any club in the UK. The door policy, and fashion at the end of the 1990s, encouraged people to dress in a flamboyant style to ensure entry to the night. The club developed a cult following (Gatecrasher Kids) who in turn developed their own style of fashion, identifiable by fluorescent clothes, dummies, and spiky hair. Scott Bond's style of dance music was reflected in the DJs booked for the nights and at the end of the 1990s, Gatecrasher was instrumental in the rise of trance music with the use of DJs like Ferry Corsten.", "* Scott Bond"]}, {"page": "Agnelli & Nelson", "response": ["The pair have collaborated with other major artists, including Matt Darey, Jon the Dentist, Scott Bond, Solarstone, and Chicane. They have also appeared on BBC Radio 1 six times. They produced music for Xtravaganza, and labels such as Tsunami Records and ID&T.", "*2004 Solar Stone vs. Scott Bond – \"3rd Earth\" [Made In England]"]}, {"page": "Third Earth", "response": ["*\"3rd Earth\" (alternatively spelled \"Third Earth\"), a 2003 song by Scott Bond and Solarstone"]}, {"page": "Gatecrasher Wet", "response": ["On 26 July 1999, the Sheffield-based club Gatecrasher released their third album, titled Gatecrasher Wet. Despite the massive success of the Gallagher produced albums Gatecrasher Black (1998) and Gatecrasher Red (Feb 1999) the third installment was initially rebuked by Simon Raine and Scott Bond due to the Northern expression \"don't talk wet\", but Gallagher persevered with his concept, explaining that its release date would coincide with what was to be an incredible summer of dance music. The album debuted at #3 in the UK compilation charts.", "Scott Bond once again mixed the album and gave the album a 'Wet' feel and theme, with a selection of songs that gave wet, Ibiza sound. \"Saltwater\" by Chicane - one of the years big hits, was added to the album which tried to reflect the sounds that people associate with the summer - bright, wet, and uplifting."]}, {"page": "Dj Scott Bond", "response": ["#redirect Scott Bond"]}, {"page": "Third Earth (song)", "response": ["#REDIRECT Scott Bond"]}, {"page": "QDOS", "response": ["* Q:Dos, a recording name for trance musicians Scott Bond, Darren Hodson, John Purser, Nick Rose"]}, {"page": "List of Essential Mix episodes", "response": ["| 18 February|| Scott Bond ", "| 9 January|| Scott Bond ", "| 3 January|| Scott Bond ", "| || Scott Bond "]}, {"page": "Bond (surname)", "response": ["*Scott Bond, British record producer"]}, {"page": "Solarstone", "response": ["In 2003 and 2004 Solarstone collaborated with Scott Bond, releasing the three singles \"3rd Earth\", \"Naked Angel\" and \"Red Line Highway\". The group's debut album, AnthologyOne, was released in 2006. In 2008, the second studio album, Rain Stars Eternal, was released.", "| rowspan=\"2\" | 2003 || Third Earth ||  || with Scott Bond", "| 2004 || Naked Angel ||  || with Scott Bond", "| 2005 || Red Line Highway ||  || with Scott Bond"]}]}}