{"wiki_id": "http://www.wikidata.org/entity/Q7440917", "itemLabel": "Sean Crummey", "itemDescription": "Irish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sean_Crummey", "wikipedia_page": {"main": "Seán Crummey (born 1957 – died 13 November 2011) was a Belfast playwright, actor and comic impressionist who is most notable as both the writer and the male voice-over star of The Folks on the Hill, a hugely successful, popular programme that started in 2001 and ran for over 10 years with a total of seventeen radio and animated television series. The show is considered by many to be one of BBC NI's most successful programmes due to its longevity and popularity.\nHe graduated from Queen's University Belfast in 1980 with a BA in French and Classical Greek. He taught French language for seventeen years at school. He worked the after-dinner comic entertainment circuit for many years, and he felt that his language background contributed to his voice-over impressions. During the Troubles, comedians needed to adopt a non-partisan stance, so his stage name was a neutral-sounding non-Catholic pseudonym.Seán Crummey was well known for his hilariously accurate depictions and his gentle, humorous political satire. He impersonated dozens of voices, particularly of Northern Ireland politicians. Some of Crummey's favourite voices to impersonate were the late PUP leader David Ervine, Pope John Paul II, and Bill McLaren.He also wrote and starred in Stormont, a stage play produced by Martin Lynch and directed by Michael Poynor, that ran at the Theatre at the Mill in Newtownabbey mid-September to early October 2010 selling out many nights of the show's run. On stage, Crummey alternately mimicked two politicians, Ulster Unionist Michael McGimpsey and Sinn Féin's Gerry Kelly.He died from a cancer-related illness just a day after his final show was broadcast. Politicians from across the political spectrum gave respectful tribute to his comic genius, penetrating humour, and talented political commentary. His funeral was attended by thousands and an unusually large number of famous individuals from all walks of life.A tribute show was broadcast on New Year's Day, 2012. A memorial fund set up in memory of Seán Crummey donated £60,000 to Queen's Centre for Cancer Research and Cell Biology (CCRCB).", "link_mentions": [{"page": "The Folks on the Hill", "response": ["The Folks on the Hill was a satirical sketch show, which started in January 2001 as a Saturday morning BBC Radio Ulster broadcast. In 2004, it evolved into an animated television show, first aired on 9 January 2004, on BBC One Northern Ireland.  In its 10th year, the final, 17th series was broadcast on BBC Radio Ulster from Saturday 8 October until 12 November 2011, the day before writer and voice-over star Sean Crummey died.", "The programme was written by Belfast impressionist, Sean Crummey, animated by Liam O'Neill (later Ciaran Boyle) and produced by Owen McFadden. The music was by Paul Rocks. Female voice impersonations were by Kathy Clugston, who provided the voices for Anne Robinson, Iris Robinson, Camilla, the Queen, Bairbre de Brun and many others."]}]}}