{"wiki_id": "http://www.wikidata.org/entity/Q7440740", "itemLabel": "Seamus Close", "itemDescription": "British politician (1947-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Seamus_Close", "wikipedia_page": {"main": "Seamus Anthony Close OBE (12 August 1947 – 7 May 2019) was a Northern Irish politician, member of the Northern Ireland Assembly for Lagan Valley and a deputy leader of the Alliance Party.In August 1981, he was the Alliance candidate for the second Fermanagh and South Tyrone by-election. The following year under the redistribution and expansion of Northern Ireland's constituencies his local political base became part of the new Lagan Valley constituency which he has contested in the Alliance interest in all elections since 1983 apart from the 1986 by-election called in protest against the Anglo-Irish Agreement when the local Alliance branch declined to contest the seat as they believed the by-election was a political stunt.\nClose also held several positions in the Alliance, including serving as Chair between 1981 and 1982 and as Deputy Leader from 1991 until 2001. He was often a member of the key Alliance delegations in successive talks about the future of the province, culminating in the Belfast Agreement of 1998.\nIn the 1996 elections for the Northern Ireland Forum, Close stood at the head of the Alliance's list for Lagan Valley but the party failed to secure enough votes to win one of the local seats. Close was also included on the province-wide list and as the most senior Alliance member to not be elected locally he won one of Alliance's two seats. In the 1998 election for the new Northern Ireland Assembly he topped the poll in Lagan Valley and gained a further personal triumph in the 2001 general election when he had the highest vote share of any Alliance candidate.\nIn June 2001, he resigned as Deputy Leader of the party, citing differences with the leadership of Seán Neeson. Close has remained a member of the Assembly and successfully held his seat in the 2003 Assembly election.\nIn July 2005, Mr Close proposed that the Lisburn Council deny gay couples access to the council's designated wedding facility if they were seeking a civil partnership under the Civil Partnership Act 2004. The council adopted his recommendation to the great annoyance of many liberal campaigners.  This ran against Alliance policy, which had been strongly supportive of the introduction of civil partnership laws, and he was publicly criticised by other senior party members.In November 2006, Close announced that he was retiring from politics In the 2007 election he was succeeded as Alliance Party Lagan Valley Assembly representative by the then Mayor of Lisburn, Councillor Trevor Lunn.Close was succeeded as Mayor of Lisburn by Harry Lewis.", "link_mentions": [{"page": "Alliance Party of Northern Ireland", "response": ["| Seamus Close"]}, {"page": "List of members of the 2nd Northern Ireland Assembly", "response": ["|Seamus Close", "|Seamus Close"]}, {"page": "Lisburn City Council", "response": ["* 1993 – 94: Seamus Close, Alliance Party of Northern Ireland"]}, {"page": "Seán Neeson", "response": ["The following year the 2001 general election saw a number of misfortunes for Alliance and Neeson personally. He failed to be selected to fight his own constituency by his local association. An attempt to negotiate an electoral pact with the Ulster Unionists, with the hope of Alliance winning the East Belfast seat broke down in negotiations. Subsequently, Alliance took the controversial decision to withdraw from several constituencies which looked likely to be fierce contests between the Ulster Unionists and/or the SDLP against the Democratic Unionists and/or Sinn Féin, instead urging voters to support the pro Agreement candidate best placed for peace. The party lost a number of council seats in the local elections held on the same day. Shortly after the election the party's deputy leader, Seamus Close, resigned citing differences over direction with the leadership. Subsequently, in September 2001 Neeson chose to resign from the leadership, being succeeded by David Ford, although he remained a member of the Assembly."]}, {"page": "Eileen Bell", "response": ["In June 2001 Bell was appointed Deputy Leader of the Alliance by Seán Neeson, following the resignation of Seamus Close over disagreements on the party's direction. However Neeson himself soon resigned and Bell stood for the leadership as a traditionalist bridge-building candidate, against David Ford who was on the more consciously Liberal, internationalist wing of the party. At the Party's council Bell received 45 votes to Ford's 86 and she remained as the party's deputy leader. In the 2003 Assembly elections she retained her seat."]}, {"page": "August 1981 Fermanagh and South Tyrone by-election", "response": ["The new by-election also saw four additional candidates stand. Seamus Close stood for the Alliance Party of Northern Ireland even though this was traditionally one of their weakest areas. Tom Moore stood for the Workers Party Republican Clubs who were descended from the Official IRA. Two fringe candidates also stood: Martin Green on a \"General Amnesty\" ticket and Simon Hall-Raleigh as \"The Peace Lover.\""]}, {"page": "Catholic unionist", "response": ["Many prominent members of the Alliance Party of Northern Ireland have been Catholics, including the majority of its past leaders (such as John Cushnahan, Oliver Napier and Seán Neeson), some of its Deputy Leaders (such as Seamus Close and Eileen Bell), former MP (of the Northern Ireland Parliament) Thomas Columba Gormley, as well as three of its seven current Assembly members. The Alliance Party is not, as such, a Unionist party, as its support for the Union is based purely on that being the wishes of the majority of the people of Northern Ireland."]}, {"page": "Northern Ireland Forum", "response": ["|John Alderdice, Seamus Close, Sean Neeson, Steve McBride, Eileen Bell, Anne Gormley, Elizabeth McCaffrey, Mary Clark-Glass, Susan O'Brien, Wendy Watt"]}, {"page": "2007 Northern Ireland Assembly election", "response": ["* Seamus Close (Alliance, Lagan Valley)"]}, {"page": "List of members of the 1st Northern Ireland Assembly", "response": ["|Seamus Close", "|Seamus Close"]}, {"page": "Members of the Northern Ireland Forum", "response": ["|Seamus Close", "|Seamus Close"]}, {"page": "1947 in Northern Ireland", "response": ["*12 August – Seamus Close, former Alliance Party MLA."]}, {"page": "Members of the 1982 Northern Ireland Assembly", "response": ["|Seamus Close", "|Seamus Close"]}, {"page": "South Antrim (Assembly constituency)", "response": ["| Seamus Close(Alliance)"]}, {"page": "Lagan Valley (Assembly constituency)", "response": ["| rowspan=3|Seamus Close(Alliance Party)", "| align=\"right\" |Seamus CloseFrazer McCammondMary Clark-GlassBill WhitleyBetty Campbell"]}, {"page": "Paul Butler (politician)", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "Trevor Lunn", "response": ["He was elected to the Northern Ireland Assembly for Lagan Valley in the 2007 assembly election. Lunn took over the Alliance candidacy for Lagan Valley from Seamus Close, the longtime representative for the area. While many pundits predicted that Alliance would struggle to hold on to the seat, Lunn's performance saw the new candidate elected 4th out of 6 seat available. He retained the seat at the 2011 Assembly election. He is a former chairman of the Alliance Party."]}, {"page": "United Kingdom general election records", "response": ["|Seamus Close", "|Seamus Close", "|Seamus Close", "|Seamus Close", "|Seamus Close", "|Seamus Close"]}, {"page": "Séamus", "response": ["* Seamus Close (1947–2019), Northern Irish politician"]}, {"page": "Close (surname)", "response": ["* Seamus Close, Northern Ireland politician"]}, {"page": "2005 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "2001 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1997 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1993 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1989 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1985 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1981 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}, {"page": "1977 Northern Ireland local elections", "response": ["| align=\"right\" |Seamus Close"]}]}}