{"wiki_id": "http://www.wikidata.org/entity/Q7441260", "itemLabel": "Sean Michael Wilson", "itemDescription": "Scottish comic book writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sean_Michael_Wilson", "wikipedia_page": {"main": "Sean Michael Wilson is a comic book writer from Edinburgh, Scotland. He has written more than 30 books with a variety of US, UK and Japanese publishers and has been nominated for both the Eisner and Harvey book awards, and won a medal in the Japanese government's 'International Manga Award', 2016 (the first British person to receive that award).", "link_mentions": [{"page": "Miyamoto Musashi", "response": ["Even in Musashi's time there were fictional texts resembling comic books. It is therefore quite difficult to separate fact from fiction when discussing his life. There have been numerous works of fiction made about or featuring Musashi. Eiji Yoshikawa's novelization (originally a 1930s daily newspaper serial) has greatly influenced successive fictional depictions (including the manga Vagabond by Takehiko Inoue) and is often mistaken for a factual account of Musashi's life. In 2012, writer Sean Michael Wilson and Japanese artist Chie Kutsuwada published an attempt at a more historically accurate manga entitled The Book of Five Rings: A Graphic Novel, based on research and translations by William Scott Wilson."]}, {"page": "Wuthering Heights", "response": ["In 2011, a graphic novel version was published by Classical Comics. It was adapted by Scottish writer Sean Michael Wilson and hand painted by comic book veteran artist John M Burns. This version, which stays close to the original novel, was shortlisted for the Stan Lee Excelsior Awards.Stan Lee Excelsior Awards: Sort List 2012."]}, {"page": "The Book of Five Rings", "response": ["*  The Book of Five Rings: a graphic novel, by manga writer Sean Michael Wilson and Japanese artist Chie Kutsuwada, 2012, Shambhala Publications, Boston, USA. A graphic novel based on the translations of William Scott Wilson.."]}, {"page": "Michael Albert", "response": ["Sean Michael Wilson created a comic book based on Albert and his ideas in 2013."]}, {"page": "Glasgow Caledonian University", "response": ["*Sean Michael Wilson, comic book writer"]}, {"page": "Garo (magazine)", "response": ["In 2008 Drawn & Quarterly published Good-Bye, the third volume of their ongoing edition of the work of Yoshihiro Tatsumi. Some of the comics collected in Good-Bye originally appeared in Garo. In 2010 an English version of the anthology AX was published by Top Shelf Productions under the title AX: alternative manga (edited by Sean Michael Wilson and former Garo editor Mitsuhiro Asakawa). It featured several of the creators who had previously appeared in Garo in its later years and received a high level of praise from critics."]}, {"page": "The Canterville Ghost", "response": ["A graphic novel version published by Classical Comics in 2010 adapted by Scottish writer Sean Michael Wilson, with art by Steve Bryant and Jason Millet"]}, {"page": "William Scott Wilson", "response": ["* Sean Michael Wilson's homepage - includes manga/graphic novel versions of William Scott Wilson's books."]}, {"page": "Top Shelf Productions", "response": ["*AX: alternative manga edited by Sean Michael Wilson"]}, {"page": "Seven Stories Press", "response": ["*Sean Michael Wilson"]}, {"page": "Lee O'Connor (comics)", "response": ["* Iraq: Operation Takeover (with Sean Michael Wilson, graphic novel, War on Want/Boychild Productions, June 2007, )"]}, {"page": "Mike Collins (comics)", "response": ["Major work recently published is a 135-page adaptation of Charles Dickens' A Christmas Carol for Classical Comics. His regular Doctor Who collaborators, inker David Roach and colour artist James Offredi, worked with him on the book, with the script writer being Sean Michael Wilson. The graphic novel was chosen as one of the Top Ten Graphic Novels of the year by The Sunday Times and has gone on to sell well across by the UK and US, with several foreign language versions also coming out.", "*A Christmas Carol (adapted by Sean Michael Wilson, with inks by David Roach, 132 pages, Classical Comics, October 2008, Original Text, , Quick Text, )"]}, {"page": "NBM Publishing", "response": ["* The Story of Lee, manga by Sean Michael Wilson and Chie Kutsuwada"]}, {"page": "Chūshingura", "response": ["A graphic novel/manga version, well researched and close to the original story, has been written by Sean Michael Wilson  and illustrated by Japanese artist Akiko Shimojima: The 47 Ronin: A Graphic Novel (2013)."]}, {"page": "Neill Cameron", "response": ["* Beautiful Things (with Sean Michael Wilson, Boychild productions, June 2005, ):"]}, {"page": "Adaptations of A Christmas Carol", "response": ["* A Christmas Carol: The Graphic Novel (2008), by Sean Michael Wilson and Mike Collins (). The graphic novel was chosen as one of the Top Ten Graphic Novels of the year by The Sunday Times."]}, {"page": "Classical Comics", "response": ["*A Christmas Carol (by Charles Dickens and adapted by Sean Michael Wilson, with pencils by Mike Collins and inks by David Roach, 160 pages, October 2008, Original Text, )", "*The Canterville Ghost (by Oscar Wilde and adapted by Sean Michael Wilson, with art by Steve Bryant and Jason Millet, 136 pages, February 2010, Original Text, )", "*Sweeney Todd (by anonymous and adapted by Sean Michael Wilson, with art by Declan Shalvey, 168 pages, November 2010, Original Text, )", "*Wuthering Heights (by Emily Brontë and adapted by Sean Michael Wilson, with art by John M. Burns, 160 pages, August 2010, Original Text, )", "** 'Wuthering Heights' by Scottish writer Sean Michael Wilson,Sean Michael Wilson and hand painted by comic book veteran artist John M Burns, received a nomination for the Stan Lee Excelsior Awards, 2012 voted for by pupils from 170 schools across the UK."]}, {"page": "List of people with surname Wilson", "response": ["*Sean Michael Wilson, English comic book writer"]}, {"page": "Insomnia Publications", "response": ["*Buskers by Jeyems Samuel, Sean Michael Wilson and Michiru Morikawa (Oct 2009)"]}, {"page": "AX (magazine)", "response": ["In October 2008, North American publisher Top Shelf announced that it will release a 400-page selection of underground manga stories from the magazine as an anthology called AX Collection, edited by Sean Michael Wilson. The volume was nominated for \"Best American Edition of Foreign Material\" at the 2011 Harvey Awards."]}, {"page": "Sean Wilson", "response": ["*Sean Michael Wilson, Scottish comic book writer"]}, {"page": "List of people named Sean", "response": ["*Sean Michael Wilson, Scottish comic book writer"]}, {"page": "Eisner Award for Best Adaptation from Another Medium", "response": ["| style=\"background:;\" | , adapted by Sean Michael Wilson and Michiru Morikawa"]}]}}