{"wiki_id": "http://www.wikidata.org/entity/Q7441484", "itemLabel": "Sean Terry", "itemDescription": "cricketer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sean_Terry", "wikipedia_page": {"main": "Sean Paul Terry (born 1 August 1991 in Southampton, Hampshire) is a former Irish  cricketer.  Terry is a right-handed batsman who bowls right-arm off break for Leinster, Northamptonshire and Ireland. He made his One Day International (ODI) debut for Ireland on 14 July 2016 against Afghanistan. He made his Twenty20 International (T20I) debut against Hong Kong on 5 September 2016. He retired from all forms of professional cricket in July 2018. However he returned to the professional scene in February 2019, being selected to play in the Perth Scorchers final game of the 2018–19 Big Bash League season, after performing well for the Melville Cricket Club in Western Australian Grade Cricket.\n\n", "link_mentions": [{"page": "List of international cricketers from Hampshire", "response": ["Hampshire is one of the eighteen counties which make up the first-class structure of English county cricket. It has produced international cricketers for the England cricket team in all forms of the game — Tests, One Day Internationals (ODIs) and Twenty20 Internationals (T20Is). No player born in Hampshire has ever captained England. Victor Barton, from Netley, became the first Hampshire-born player to represent England when he played against South Africa in 1892, which was his only Test appearance. Nine cricketers born in Hampshire have represented England, with Chris Tremlett, born in Southampton, the last. Sean Terry, born in Southampton, is the only international player born in Hampshire to represent another nation, in this case Ireland. 109 cricketers born outside of Hampshire have played county cricket for Hampshire, as well as playing international cricket. Of these, 73 have played international cricket for a team other than England, while 4 have played internationally, but not in matches recognised by the ICC. 3 cricketers who represented Hampshire Cricket Board but not Hampshire have also played international cricket, their statistics are also listed below."]}, {"page": "Terry (surname)", "response": ["* Sean Terry (born 1991), English cricketer"]}, {"page": "List of Old Aquinians", "response": ["* Sean Terry – first-class Hampshire"]}, {"page": "List of people from Hampshire", "response": ["*Sean Terry, cricketer, was born in Southampton"]}, {"page": "Afghan cricket team in Ireland in 2016", "response": ["* Sean Terry"]}, {"page": "Hong Kong cricket team in Ireland in 2016", "response": ["* Sean Terry"]}, {"page": "2016 Inter-Provincial Championship", "response": ["* Sean Terry"]}, {"page": "2016 Inter-Provincial Cup", "response": ["* Sean Terry"]}, {"page": "Ireland Wolves cricket team in Bangladesh 2017–18", "response": ["* Sean Terry", "* Sean Terry"]}, {"page": "List of Perth Scorchers cricketers", "response": ["|style=\"text-align: left;\" data-sort-value=\"Terry, Sean\" |Sean Terry"]}]}}