{"wiki_id": "http://www.wikidata.org/entity/Q7449758", "itemLabel": "Semothy Jones", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Semothy_Jones", "wikipedia_page": {"main": "Andrew Hughes, better known as Semothy Jones or Sem for short, is an English songwriter and record producer from Islington, London.\nThe earliest releases from Sem were around 2005, a grime instrumental mixtape series called 'Delivery Boy'.\nIn 2009, Semothy was asked to help promote Timbaland's new Beaterator software in the UK.In 2010, Semothy signed a three-year publishing deal with Major Music/BMG Publishing and became part of the Biffco/Biff Stannard songwriting/production team.", "link_mentions": [{"page": "Dressed for the Occasion", "response": ["Category:Albums produced by Semothy Jones"]}, {"page": "Hands (Little Boots album)", "response": ["* Semothy Jones – production ", "Category:Albums produced by Semothy Jones"]}, {"page": "So Human", "response": ["# \"I Got You Dancing\" Semothy Jones Remix"]}, {"page": "Just Be Good to Green", "response": ["The track was originally made back in 2007 when Professor Green was signed to The Beats. The song was composed and produced by Semothy Jones and, at the time, featured Neon Hitch on the chorus.  Though when The Beats folded the track was put on hold."]}, {"page": "Semothy jones", "response": ["#REDIRECT Semothy Jones"]}, {"page": "Alive Till I'm Dead", "response": ["\"Just Be Good to Green\" was originally written and produced back in July 2007 when Green was signed to Mike Skinner's record label, The Beats. It was composed and produced by Semothy Jones, and at the time featured Neon Hitch on the chorus. When The Beats closed down, the track was put on hold, and later purchased by Green for use on his next record. Green spoke about how the collaboration came about between him and Lily Allen, saying that they began speaking through Facebook.", "Category:Albums produced by Semothy Jones"]}, {"page": "List of people from the London Borough of Islington", "response": ["*Semothy Jones, songwriter/record producer, grew up in Holloway"]}]}}