{"wiki_id": "http://www.wikidata.org/entity/Q745714", "itemLabel": "Herbert MacNair", "itemDescription": "British artist (1868-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_MacNair", "wikipedia_page": {"main": "James Herbert MacNair (23 December 1868 – 22 April 1955), was a Scottish artist, designer and teacher whose work contributed to the development of the Modern Style (British Art Nouveau style) during the 1890s.", "link_mentions": [{"page": "History of Scotland", "response": ["Scotland also played a major part in the development of art and architecture. The Glasgow School, which developed in the late 19th century, and flourished in the early 20th century, produced a distinctive blend of influences including the Celtic Revival the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe and helped define the Art Nouveau style. Among the most prominent members were the loose collective of The Four: acclaimed architect Charles Rennie Mackintosh, his wife the painter and glass artist Margaret MacDonald, her sister the artist Frances, and her husband, the artist and teacher Herbert MacNair.Stephan Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Courier Dover, 2002), pp. 283–4."]}, {"page": "Charles Rennie Mackintosh", "response": ["Around 1892, Mackintosh met fellow artist Margaret Macdonald at the Glasgow School of Art. He and fellow student Herbert MacNair, also an apprentice at Honeyman and Keppie, were introduced to Margaret and her sister Frances MacDonald by the head of the Glasgow School of Art, Francis Henry Newbery, who saw similarities in their work. Margaret and Charles married on 22 August 1900. The couple had no children. MacNair and Frances also married the previous year. The group worked collaboratively and came to be known as \"The Four\", and were prominent figures in Glasgow Style art and design. Mackintosh and Margaret married, setting up their first home in Mains Street on Blythswood Hill, the street later being renamed as Blythswood Street, Glasgow.Glasgow's Blythswood, by Graeme Smith, 2021. Subsequently, they moved to Southpark Avenue, close to Glasgow University.", "Mackintosh, his future wife Margaret MacDonald, her sister Frances MacDonald, and Herbert MacNair met at evening classes at the Glasgow School of Art (see above). They became known as a collaborative group, \"The Four\", or \"The Glasgow Four\", and were prominent members of the \"Glasgow School\" movement. The group exhibited in Glasgow, London and Vienna, and these exhibitions helped establish Mackintosh's reputation. The so-called \"Glasgow\" style was exhibited in Europe and influenced the Viennese Art Nouveau movement known as Sezessionstil (in English, the Vienna Secession) around 1900.  Mackintosh also worked in interior design, furniture, textiles and metalwork. Much of this work combines Mackintosh's own designs with those of his wife, whose flowing, floral style complemented his more formal, rectilinear work. Blackie commissioned him in the 1920s to work on bindings for their publications. One of these works was an abstract design that was intended for a new uniform of G. A. Henty's novels. It was instead used for Yarns on the Beach by Henty, and for a series entitled The Boys and Girls Bookshelf, c. 1926. Both Newbolt and Floyer speculate that Mackintosh may have designed the cover for another series by Blackie.", "In 2012, one of the largest collections of art by Charles Rennie Mackintosh and the Glasgow Four Glasgow School was sold at auction in Edinburgh for £1.3m. The sale included work by Mackintosh's sister-in-law Frances Macdonald and her husband Herbert MacNair."]}, {"page": "Margaret Macdonald Mackintosh", "response": ["It is unclear exactly when the Macdonald sisters met Charles Rennie Mackintosh and his friend/colleague Herbert MacNair, but they probably met around 1892 at the Glasgow School of Art (Mackintosh and MacNair were studying as night students), introduced by the Headmaster Francis Newbery because he recognised that they were working in similar styles. By 1894 they were showing their work together in student exhibitions, some of which was made collaboratively. Reception of the work was mixed, and it was commented that the gaunt, linear forms of the Macdonald sisters' artwork - clearly showing the influence of Aubrey Beardsley - were 'ghoulish' and earned them the moniker 'The Spook School'. They became known locally as \"The Four\"."]}, {"page": "1904 in art", "response": ["* Herbert MacNair – The Gift of Doves"]}, {"page": "Liverpool School of Tropical Medicine", "response": ["The school's traditional emblem depicts a Viking longboat under sail and was designed by the famed Glaswegian designer Herbert MacNair. The elements of the emblem all have meaning."]}, {"page": "List of industrial designers", "response": ["* Herbert MacNair (1868-1955)"]}, {"page": "Glasgow School", "response": ["Among the most prominent definers of the Glasgow School collective were The Four. They were the painter and glass artist Margaret MacDonald, acclaimed architect Charles Rennie Mackintosh (MacDonald's husband), MacDonald's sister Frances and Herbert MacNair. Together, The Four defined the Glasgow Style's fusion of influences including the Celtic Revival, the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe. The Four, otherwise known as the Spook School, ultimately made a significant impact on the definition of Art Nouveau. The name, Spook School, or Spooky or Ghoul School,  was originally a \"derisive epithet\" given to their work which \"distorted and conventionalized human... form.\""]}, {"page": "1892 in art", "response": ["* Charles Rennie Mackintosh and Herbert MacNair are introduced to Margaret and Frances MacDonald in Glasgow"]}, {"page": "Frances MacDonald", "response": ["The sister of artist-designer Margaret Macdonald Mackintosh, she was born in Kidsgrove, Stoke-on-Trent, and moved to Glasgow with her family in 1890. Both sisters enrolled in painting classes at the Glasgow School of Art in 1891, where they met the young architects Charles Rennie Mackintosh and Herbert MacNair. Frances went on to marry MacNair in 1899, and Margaret married Mackintosh in 1900. After they met, they exhibited together in a 'School of Art Club' exhibition and due to their similar stylistic approach came to be referred to as \"The Four\"."]}, {"page": "Herbert Macnair", "response": ["#REDIRECT Herbert MacNair "]}, {"page": "Herbert McNair", "response": ["#REDIRECT Herbert MacNair"]}, {"page": "Herbert Mcnair", "response": ["#REDIRECT Herbert MacNair"]}, {"page": "James Herbert MacNair", "response": ["#REDIRECT Herbert MacNair"]}, {"page": "J. Herbert MacNair", "response": ["#REDIRECT Herbert MacNair"]}, {"page": "J Herbert MacNair", "response": ["#REDIRECT Herbert MacNair"]}, {"page": "1955 in the United Kingdom", "response": ["*22 April – Herbert MacNair, Scottish artist (born 1868)"]}, {"page": "Scottish art", "response": ["For the late nineteenth century developments in Scottish art are associated with the Glasgow School, a term that is used for a number of loose groups based around the city. The first and largest group, active from about 1880, were the Glasgow Boys, including James Guthrie (1859–1930), Joseph Crawhall (1861–1913), George Henry (1858–1943) and E. A. Walton (1860–1922).R. Billcliffe, The Glasgow Boys (London: Frances Lincoln, 2009), . They reacted against the commercialism and sentimentality of earlier artists, particularly represented by the Royal Academy, were often influenced by French painting and incorporated elements of impressionism and realism, and have been credited with rejuvenating Scottish art, making Glasgow a major cultural centre.Chilvers, Oxford Dictionary of Art and Artists, p. 255. A slightly later grouping, active from about 1890 and known as \"The Four\" or the \"Spook School\", was composed of acclaimed architect Charles Rennie Mackintosh (1868–1928), his wife the painter and glass artist Margaret MacDonald (1865–1933), her sister the artist Frances (1873–1921), and her husband, the artist and teacher Herbert MacNair (1868–1955). They produced a distinctive blend of influences, including the Celtic Revival, the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe and helped define the Art Nouveau style.S. Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Mineola, NY: Courier Dover, 2002), , pp. 283–4."]}, {"page": "Modern Style (British Art Nouveau style)", "response": ["The group known as \"The Four\" will make the biggest impact in the field of painting and the style in general. The group consisted of Charles Rennie Mackintosh, his friend Herbert MacNair, and sisters Frances MacDonald and Margaret Macdonald Mackintosh. \"The Four\" met at painting classes at Glasgow School of art in 1891. Frances married Herbert in 1899 and Margaret married Charles in 1900. Although all were great artists in their own right, Margaret was a stand out when it comes to painting, she greatly influenced Charles and he praised her as a genius. Both sisters were influenced by the work of William Blake and Aubrey Beardsley and this is reflected in their use of elongated figures and linear elements. Margaret exhibited with her husband at the 1900 Vienna Secession, where they were an influence on Gustav Klimt, Josef Hoffmann, and artist that will form Wiener Werkstätte. They continued to be popular in the Viennese art scene, both exhibiting at the Viennese International Art Exhibit in 1909.", "File:MacNair,_The_Gift_of_Doves.jpg|The Gift of Doves, 1904. by Herbert MacNair"]}, {"page": "Prima Esposizione Internazionale d'Arte Decorativa Moderna", "response": ["Numerous interiors were on display, including \"A Lady's Writing Room\" designed by Frances MacDonald and Herbert MacNair of the Glasgow School."]}, {"page": "Olive Biller", "response": ["She initially studied design, illustration, and various arts and crafts at the School of Architecture and Applied Art at University College, Liverpool (now known as University of Liverpool School of Architecture), commencing October 1898. There, she was taught by Robert Anning Bell, and was particularly mentored by Herbert MacNair. In 1900, After a brief time at the Lambeth School of Art, London, she attended the Slade School of Art, London. She studied most notably with Henry Tonks of whom she made a satirical drawing (now in the collection of the Strang, University College London). From 1901, as Olive Allen, she was an illustrator of magazines, children's books and Christmas annuals, chiefly for publisher T. C. & E. C. Jack. For example, E. Johnson, Fact and Fable (London, 1901) [illus. by Olive Allen]; M. Edgeworth, retold and illus. by O. Allen,, The Birthday Present (London, 1908). Some titles were translated into German and enjoyed wide circulation."]}, {"page": "List of painters by name beginning with \"M\"", "response": ["*Herbert MacNair (1868–1955), Scottish artist, designer and teacher"]}, {"page": "Scotland in the modern era", "response": ["The shift in attitudes to a romantic view of the Highlands at the end of the 18th century had a major impact on Scottish art.C. W. J. Withers, Geography, Science and National Identity: Scotland Since 1520 (Cambridge: Cambridge University Press, 2001), , pp. 151–3. Romantic depictions can be seen in the work of 18th-century artists including Jacob More, and Alexander Runciman.E. K. Waterhouse, Painting in Britain, 1530 to 1790 (Yale University Press, 5th edn., 1994), , p. 293. and the next generation of artists, including the portraits of Henry Raeburn (1756–1823),C. C. Ochterbeck, ed., Michelin Green Guide: Great Britain Edition (Michelin, 5th edn., 2007), , p. 84. and the landscapes of Alexander Nasmyth (1758–1840)I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 433. and John Knox (1778–1845).D. Kemp, The Pleasures and Treasures of Britain: A Discerning Traveller's Companion (Dundurn, 1992), , p. 401. The Royal Scottish Academy of Art was created in 1826, allowing professional painters to more easily exhibit and sell their works.L. A. Rose, M. Macaroon, V. Crow, Frommer's Scotland (John Wiley & Sons, 12th edn., 2012), , p. 23. Andrew Geddes (1783–1844) and David Wilkie (1785–1841) were among the most successful portrait painters. The tradition of highland landscape painting was continued by figures such as Horatio McCulloch (1806–67), Joseph Farquharson (1846–1935) and William McTaggart (1835–1910).F. M. Szasz, Scots in the North American West, 1790–1917 (University of Oklahoma Press, 2000), , p. 136. Aberdeen born William Dyce (1806–64), emerged as one of the most significant figures in art education in the United Kingdom.I. Chilvers, ed., The Oxford Dictionary of Art and Artists (Oxford: Oxford University Press, 4th edn., 2009), , p. 195. The Glasgow School, which developed in the late 19th century, and flourished in the early 20th century, produced a distinctive blend of influences including the Celtic Revival the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe and helped define the Art Nouveau style. Among the most prominent members were the loose collective of The Four: acclaimed architect Charles Rennie Mackintosh, his wife the painter and glass artist Margaret MacDonald, her sister the artist Frances, and her husband, the artist and teacher Herbert MacNair.S. Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Courier Dover, 2002), , pp. 283–4."]}, {"page": "1955 in Scotland", "response": ["* 22 April – Herbert MacNair, artist (born 1868)"]}, {"page": "Scottish art in the nineteenth century", "response": ["The beginnings of the Arts and Crafts movement in Scotland were in the stained glass revival of the 1850s, pioneered in Edinburgh by James Ballantine and in Glasgow by Daniel Cottier. The Glasgow-born designer and theorist Christopher Dresser was one of the first, and most important, independent designers, a pivotal figure in the Aesthetic Movement and a major contributor to the allied Anglo-Japanese movement. A Celtic Revival, drawing on ancient myths and history to produce art in a modern idiom, was pursued by artists including Anna Traquair, John Duncan, Stewart Carmichael and George Dutch Davidson. In the late nineteenth century developments in Scottish art are associated with the Glasgow School. This was made up of loose groups including the Glasgow Boys, of James Guthrie, Joseph Crawhall, George Henry and E. A. Walton, who were influenced by French Impressionism and Realism. From around 1890 \"The Four\" or the \"Spook School\", was composed of acclaimed architect Charles Rennie Mackintosh, Margaret MacDonald, Frances and Herbert MacNair. They produced a distinctive blend of influences that helped define the Art Nouveau style.", "A slightly later grouping, active from about 1890 and known as \"The Four\" or the \"Spook School\", was composed of acclaimed architect and artist Charles Rennie Mackintosh (1868–1928), his wife the painter and glass artist Margaret MacDonald (1865–1933), her sister the artist Frances (1873–1921), and her husband, the artist and teacher Herbert MacNair (1868–1955). They produced a distinctive blend of influences, including the Celtic Revival, the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe and helped define the Art Nouveau style that would come to prominence in the early twentieth century.S. Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Mineola, NY: Courier Dover, 2002), , pp. 283–4."]}, {"page": "Art in modern Scotland", "response": ["For the late nineteenth century and early twentieth century, developments in Scottish art are associated with the Glasgow School, a term that is used for a number of loose groups based around the city. The most important grouping, active from about 1890 and known as \"The Four\" or the \"Spook School\", was composed of acclaimed architect Charles Rennie Mackintosh (1868–1928), his wife the painter and glass artist Margaret MacDonald (1865–1933), her sister the artist Frances (1873–1921), and her husband, the artist and teacher Herbert MacNair (1868–1955). They produced a distinctive blend of influences, including the Celtic Revival, the Arts and Crafts Movement, and Japonisme, which found favour throughout the modern art world of continental Europe and helped define the Art Nouveau style.S. Tschudi-Madsen, The Art Nouveau Style: a Comprehensive Guide (Mineola, NY: Courier Dover, 2002), , pp. 283–4."]}, {"page": "1868 in Scotland", "response": ["* 23 December – Herbert MacNair, artist and designer (died 1955)"]}, {"page": "MacNair", "response": ["*Herbert MacNair, Scottish artist"]}]}}