{"wiki_id": "http://www.wikidata.org/entity/Q745066", "itemLabel": "Nicky Weaver", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Weaver", "wikipedia_page": {"main": "Nicholas James Weaver (born 2 March 1979) is an English former professional footballer who played as a goalkeeper most notably for Manchester City. \nWeaver is a former England under-21 international and began his career with Mansfield Town in 1995. He joined Manchester City in 1997 and would go on to be a part of the club that earned promotion from the Second Division in 1999 in which he saved the decisive penalty in the play-off final shootout with Gillingham at Wembley Stadium. He would go on to earn promotion to the Premier League the following season and in total was promoted three times with City in a ten-year spell. By the time he left the club in 2007 he had been the club's second choice keeper for a number of years and had acted as understudy to the likes of Peter Schmeichel, David Seaman and David James. He went on to appear for Charlton Athletic, Dundee United, Burnley, Sheffield Wednesday and Aberdeen.", "link_mentions": [{"page": "March 2", "response": ["*  1979   – Nicky Weaver, English footballer"]}, {"page": "Andreas Isaksson", "response": ["After the 2006 FIFA World Cup, Isaksson completed a £2 million move to Manchester City of the Premier League on 15 August 2006. He was expected to replace David James as their first choice goalkeeper, but due to knee and ankle injuries and the form of Nicky Weaver, he did not achieve this. He made his debut on 9 December 2006, when he replaced the injured Weaver at half-time in a Manchester derby match which City lost 3–1 to Manchester United. After his second start for City on 14 March 2007, he played all of the remaining ten games of 2006–07, keeping four clean sheets, and saved a penalty kick from Jermain Defoe on the last day of the season, although City nonetheless lost 2–1 to Tottenham Hotspur."]}, {"page": "David James (footballer, born 1970)", "response": ["On the last day of the 2004–05 season, James was playing for City who needed to beat Middlesbrough to qualify for the UEFA Cup at the opposition's expense. With five minutes remaining the score was 1–1, when City's manager Stuart Pearce replaced midfielder Claudio Reyna with the substitute goalkeeper Nicky Weaver, and James was moved to play in attack for the remainder of the game. The unusual tactic almost worked when, in injury time, Middlesbrough defender Franck Queudrue conceded a penalty by handling a cross that was aimed at James. However, Robbie Fowler's penalty was saved by Middlesbrough goalkeeper Mark Schwarzer and so Middlesbrough not City qualified for the UEFA Cup."]}, {"page": "Nicky", "response": ["* Nicky Weaver (born 1979), English football goalkeeper"]}, {"page": "Tim Flowers", "response": ["He was transferred to Leicester City, where he collected a Football League Cup winner's medal in his first season. In August 2002 he went on loan to Manchester City to provide cover for Carlo Nash after injuries to Peter Schmeichel and Nicky Weaver. He stayed with Leicester for one season after their relegation to Division One two years later before retiring as a player. His final appearance for Leicester City was against Wolverhampton Wanderers at Molineux in May 2003. It was the final game of the season, and with Leicester 1–0 down, Flowers came on as a late substitute for Ian Walker. Leicester were awarded a late penalty, and despite shouts from the travelling Leicester fans for Flowers to take the penalty, and Flowers himself signalling to the bench, Micky Adams (then Leicester manager) ignored the fans, and allowed Trevor Benjamin to take it, who scored."]}, {"page": "Killamarsh", "response": ["*Nicky Weaver, footballer who played as a goalkeeper, grew up in Killamarsh."]}, {"page": "List of people from Sheffield", "response": ["*Nicky Weaver, goalkeeper"]}, {"page": "Tommy Miller", "response": ["At the beginning of the 2010–11 season, Miller changed his squad number from 6 to 8. He was named PFA Fans' Player of the Month in League One for October 2010, pipping teammate Nicky Weaver to the award."]}, {"page": "2001 FA Cup Final", "response": ["Anfield hosted Manchester City in the fifth round. It was the start of a decisive week for Liverpool, as they faced Roma midweek in the UEFA Cup, then Birmingham City in the 2001 Football League Cup Final. Liverpool were awarded a penalty after five minutes, as goalkeeper Nicky Weaver fouled Vladimír Šmicer inside the 18-yard box. Jari Litmanen converted the spot kick to give Liverpool the lead, which quickly became 2–0 when Heskey's shot found its way past Weaver. Andrei Kanchelskis' goal in the 28th minute halved the scoreline, but Šmicer and Markus Babbel each scored in the second half to put Liverpool in a commanding lead. City persisted and in stoppage time scored their second goal of the match; Shaun Goater's deflected shot did enough to beat goalkeeper Sander Westerveld."]}, {"page": "Joe Hart", "response": ["Hart's move to Manchester City was completed as soon as Hart returned from England under-19 duty in Belgium, where a defeat to Serbia and Montenegro in the elite round meant England failed to qualify for the 2006 UEFA European Under-19 Championship. It was reported at the time that City were to pay an initial £600,000 fee for Hart, rising to £1.5 million if undisclosed clauses were achieved, but John Wardle, then City chairman, revealed in 2012 that the transfer fee was actually £100,000. Hart was recommended to City hierarchy by the club's goalkeeping coach Tim Flowers who believed he had great potential. Hart made his debut for City on 14 October 2006 after injuries ruled out Andreas Isaksson and Nicky Weaver for the Premier League match against Sheffield United. He kept a clean sheet in the match, which finished goalless.", "Hart's 18 clean sheets in the 2010–11 Premier League season earned him the Premier League Golden Glove award. He also set a new club record for the most clean sheets during a season, with 29; the previous mark was set by Nicky Weaver with 26 when the team were playing two divisions lower. He also received City's Performance of the Season award for the match against Tottenham Hotspur in August 2010. Hart's position as City's \"number one\" was cemented when Given departed City for Aston Villa in July 2011. On 8 August 2011, he signed a new contract until 2016. Hart won the Golden Glove award for the second year running in 2011–12, and helped City to win their first Premier League title, and first top-flight title for 44 years, which they clinched on the final day of the season by beating Queens Park Rangers 3–2."]}, {"page": "Stephen Bywater", "response": ["On 20 September 2011, Bywater joined Sheffield Wednesday on loan for 3 months due to an injury picked up by first choice 'keeper Nicky Weaver. Bywater's loan spell proved to be very successful, with Wednesday losing just 1 of his 12 games and keeping six clean sheets, moving boss Gary Megson to state his intention to make Bywater's move permanent, with Derby manager Nigel Clough confirming talks with Wednesday over a potential transfer. On 30 December 2011, it was reported that Bywater was to join Wednesday on a permanent transfer when the January transfer window opened. On 31 December 2011, Bywater signed for Wednesday on a permanent transfer, with a contract until the end of the 2011–2012 season, the move went ahead on 1 January 2012. After this permanent move, he was initially second choice behind Nicky Weaver before taking over as first choice in a 3–1 win against Scunthorpe United on 24 January 2012. Bywater played in all the remaining games of the season, keeping 14 clean sheets in 34 appearances. Wednesday secured promotion to the Championship by coming runners up in League One, narrowly finishing ahead of local rivals Sheffield United.", "Bywater then entered contract talks with the club, with a new one-year contract signed on 27 June 2012, upon signing this new contract Bywater praised manager David Jones and called Wednesday \"the biggest club out of the Premiership and that is a fact\". Bywater's goalkeeping competition for 2012–13 season consisted of Arron Jameson, Chris Kirkland and Nicky Weaver."]}, {"page": "Darren Randolph", "response": ["Randolph made his first-team debut for the already relegated Charlton in their last match of the 2006–07 Premier League season, away against Liverpool. Replacing loanee Scott Carson, who was ineligible to play against his parent club, Randolph performed well, limiting Liverpool to two goals, one of which was a penalty kick in the 90th minute for a 2–2 draw. He was second-choice behind Nicky Weaver in 2007–08, and in February 2008, joined Bury of League Two on loan. After featuring 14 times, Randolph was recalled by Charlton to cover for Weaver, who was sent off in a match against Plymouth Argyle. He started Charlton's next match, at home to Southampton, and contributed to a farcical own goal when he appeared to catch a high ball, then dropped it into the net via teammate Paddy McCarthy."]}, {"page": "Rob Elliot", "response": ["Back at Charlton, Elliot was considered to be behind Nicky Weaver and Darren Randolph for most of the 2007–08 season. After Randolph moved to Bury on loan Elliot was promoted to second choice. He made an unexpected debut for Charlton on 5 April 2008 after Weaver had been sent off in a match against Plymouth Argyle. He made his first start for Charlton in a League Cup defeat to Yeovil Town in August 2008. During the 2008–09 season, he displaced Weaver and established himself as the club's first choice goalkeeper. A string of impressive performances contributing to a record breaking start to a season for Charlton in 2009–10 led to him signing a contract extension committing him to the club until 2012. In August 2011, Newcastle United made an offer of £100,000 which was rejected by Charlton."]}, {"page": "Andy Morrison", "response": ["Morrison was signed by Joe Royle for Manchester City, in the 1998–99 season, following their relegation to Division Two. The transfer fee was £80,000. Morrison made his debut in a 2–1 victory against Colchester United in October 1998. Morrison headed in City's second goal of the game and received a man of the match award, which was presented to him by former City winger Dennis Tueart. Morrison also scored in his second game for City, a 3–0 victory against Oldham Athletic. Morrison endeared himself to the City fans and was soon made captain. He scored his third goal for City in a 1–1 draw with Luton Town. One fanzine asked: \"Where can we get another half-dozen Andy Morrisons?\" According to goalkeeper Nicky Weaver: \"Morrison was a huge signing for us. Joe made him captain straight away. He was an intimidating figure for the opposition and he could be intimidating as a team-mate as well. I'd stand behind him in the tunnel and he'd be beating his chest, ready for battle. The other team would be thinking, 'I don't fancy tangling with him today'. But to be fair to Andy, he wasn't just a brute and growling pitbull. He had a great touch, too.\" In an 1–0 defeat to Wimbledon, in the FA Cup, Morrison was sent off after a scuffle with Carl Cort. Morrison scored his fourth goal of the season, via a thundering header from a corner, in a 6–0 victory against Burnley (Shaun Goater scored a hat trick and Kevin Horlock and Danny Allsopp scored the other goals). City finished in the play-off places in the league. Morrison captained City to victory over Gillingham in the 1999 Football League Second Division play-off Final at Wembley in May 1999.  In the match Morrison's teammates Kevin Horlock and Paul Dickov scored late goals to take the match to extra time and penalties (which City won). Morrison was presented with the playoff trophy at the end of the game and became the fifth City captain (following Sam Cowan, Roy Paul, Tony Book and Mike Doyle) to lift a trophy at Wembley. He has been succeeded, in this respect, by Carlos Tevez (who captained City to victory in the 2011 FA Cup Final) and Vincent Kompany (who has won the EFL Cup four times with City), although they captained City to victories at the new Wembley Stadium."]}, {"page": "Alan Pouton", "response": ["At the beginning of the 1999-2000 season, Grimsby Town made an approach to take Pouton on loan. Despite not starting a game during his month-long loan spell, Pouton impressed sufficiently in his six substitute appearances to prompt Grimsby to pay £150,000 to secure him on a permanent basis. Upon signing, Pouton became a first team regular and went on to play in the majority of Grimsby's games that season. Surprisingly, in hindsight, Pouton only picked up two bookings that season in 41 games. His first goal for Grimsby (and only goal of the season) was an equaliser at Blundell Park, Pouton volleyed in at the far post after Nicky Weaver parried Lee Ashcroft's cross in a 1–1 draw with Manchester City. Over the next three seasons, Pouton was booked 18 times and sent off twice. Despite his occasional lapses in discipline, Pouton was generally a success at Grimsby, and although he was not noted for his goals, he still managed eleven goals including a hat-trick in the 6–2 home win against Wimbledon (although two of those goals were penalties). He became a cult hero for his Never Say Die attitude, and his repeat step-overs, although he suffered increasing disciplinary problems, missing many games through a combination of injury and suspension. In the 2002-03 season, Grimsby were relegated to Division Two after finishing bottom of Division One. Injury prevented Pouton from playing until December and he only then played five times before leaving the club to free up finances."]}, {"page": "Carlo Nash", "response": ["He had a three-year spell with Stockport County after leaving Crystal Palace. Stockport loaned Nash to Wolverhampton Wanderers in late 2000 to provide cover for Michael Oakes. Shortly afterwards he made a move to Manchester City for a fee of £100,000 on a four-and-a-half-year deal in January 2001. On his Premier League debut on 11 April 2001, he lost 4–0 at home to Arsenal. During Kevin Keegan's management of Manchester City, Nash and Nicky Weaver were rotated frequently as starting goalkeeper. "]}, {"page": "List of Manchester City F.C. players", "response": ["|align=\"left\" | Nicky Weaver ||  || 1998–2007 || Goalkeeper || 175 || 0 || 31 || 0 || 1 || 0 || align=\"right\" | 207 || align=\"right\" | 0 ||  ||"]}, {"page": "Richard Edghill", "response": ["Edghill started his career with Manchester City as a product of the youth scheme which he joined as a schoolboy in 1988.Manchester City save best till last His first team debut came in the 1993–94 season in a match against Wimbledon. Edghill was capped by England at under-21 and 'B' level, but his development was hampered by a series of serious injuries, including missing the entire 1996–97 season due to a knee injury. After recovery from this injury Edghill featured regularly in the first team for the next three seasons and also scored in the penalty shootout of the play-off final despite, at this point, never having scored in his professional career. In the 1999–2000 season an injury to team captain Andy Morrison saw Edghill take over as captain and he helped earn City promotion back into the Premiership. The 1999–2000 season also saw Richard score his first professional goal in a 2–0 win against Blackburn Rovers. By then City's longest serving player, Edghill suffered a poor start to the 2000–01 season including a calamitous own goal in a 2–1 defeat against Coventry City where he was substituted at half-time. His team-mate Nicky Weaver criticized the crowd's treatment of Edghill, who had been withdrawn by manager Joe Royle to spare him further embarrassment. Edghill lost his first team place and the captaincy, and he was loaned to Birmingham City for a month."]}, {"page": "Keiren Westwood", "response": ["Westwood was born in Manchester. He started his career at Fletcher Moss Rangers, he then moved onto Manchester City. He never played a first team game and was released as he was understudy to David James and Nicky Weaver. Weeks before his release he had broken his hand while on loan at Oldham Athletic. He then had unsuccessful trials at Bradford City and Accrington Stanley."]}, {"page": "Last-minute goal", "response": ["* 1998–99 Football League Second Division play-off Final – Manchester City vs. Gillingham, 30 May 1999: Having finished third and fourth in the league respectively, Manchester City and Gillingham had qualified for the play-offs and, after winning their respective semi-finals, faced each other in the final to compete for promotion to the First Division. Neither team could find the net until late on in the second half, when Carl Asaba burst into the City penalty area in the 81st minute and punted the ball high into the net. Then in the 87th minute, Gillingham doubled their lead as Bob Taylor scored Gillingham's second. However, in the 90th minute, City's Kevin Horlock ran onto a loose ball outside the box and smashed a shot through a crowd of players to bring the score to 2–1. Then, on 90+5 minutes, the ball was fed in to Paul Dickov in the Gillingham penalty area, who, falling backwards, managed to lever a shot over the sliding challenge of Adrian Pennock, which rocketed into the top corner. No more goals were scored in extra-time, so the match went to penalties, where City won 3–1. City keeper Nicky Weaver saved two of Gillingham's penalties. Dickov and Vince Bartram, Gillingham's keeper and Dickov's best man, swapped shirts at the end of the match."]}, {"page": "Brian Murphy (footballer, born 1983)", "response": ["Murphy spent four seasons with Manchester City where the competition for the number one jersey included David Seaman, Nicky Weaver and Carlo Nash, but made the 1st team bench on a number of occasions in the old 1st Division (second tier) and the Premier League. Loaned out to Oldham Athletic in 2002–03, he made his senior début during a loan period with Peterborough United that same season away to Brentford in League One in May 2003."]}, {"page": "2007–08 Charlton Athletic F.C. season", "response": ["| 4 July 2007 ||||Nicky Weaver|| Manchester City||Free||", "* GK: #1,  Nicky Weaver, 48"]}, {"page": "Shay Logan", "response": ["On 30 January 2014, Logan signed for Scottish Premiership side Aberdeen on loan until the end of the 2013–14 season, linking up with former teammates Willo Flood, Niall McGinn and Nicky Weaver. Upon the move, Logan stated that agreeing a deal allowing him to spend time with his family was an important factor in his move and that he was motivated to help the club win trophies. Logan made his debut against St Johnstone in the League Cup semi-final which Aberdeen won 4–0. He made his league debut, playing on the right of midfield, as Aberdeen won 1–0 against St Mirren On 16 March, Logan played the full 120 minutes of normal plus extra time in the Scottish League Cup Final against Inverness Caledonian Thistle which Aberdeen won 4–2 on penalty kicks. Logan then scored his first goal for the club on 3 May 2014, as Aberdeen lost 5–2 against Celtic. Logan's successful loan spell came to an end at the end of the campaign after making 18 appearances and scoring one goal."]}, {"page": "2007–08 Manchester City F.C. season", "response": ["|  Nicky Weaver"]}, {"page": "1999 Football League Second Division play-off Final", "response": ["Manchester City faced Wigan Athletic in their semi-final and the first leg was played at Springfield Park in Wigan on 15 May 1999.  Within 20 seconds, the home side had taken the lead: a misunderstanding between Manchester City goalkeeper Nicky Weaver and his team-mate Gerard Wiekens allowed Stuart Barlow to score from .  Paul Dickov equalised with 13 minutes of the match remaining and the game ended 1–1.  The second leg took place four days later at Maine Road in Manchester.  City dominated the early stages and took the lead in the 27th minute through Shaun Goater, who put the ball past Roy Carroll in the Wigan goal with his chest from a Michael Brown cross.  With four minutes remaining, a shot by Wigan's Graeme Jones struck the crossbar.  The match ended 1–0 and Manchester City progressed to the final 2–1 on aggregate.", "|GK ||1||Nicky Weaver"]}, {"page": "Sheffield Wednesday F.C. Academy", "response": ["|Head of academy goalkeeping|| Nicky Weaver"]}, {"page": "2009–10 Dundee United F.C. season", "response": ["The club confirmed the pre-contract signings of three players in June, with Slovakian goalkeeper Dušan Perniš to follow in January. Scotland international Andy Webster followed on a season-long loan deal - some eight years after nearly signing from Arbroath, and former Manchester City goalkeeper Nicky Weaver signing on a short-term contract. In late September 2009, midfielder Mark Fotheringham was signed on a three-month contract ahead of his January 2010 move to Anorthosis Famagusta. In February, Latvian defender Pāvels Mihadjuks signed a short-term deal until the end of the season."]}, {"page": "2009–10 Burnley F.C. season", "response": ["|31||GK|| Nicky Weaver ||  Dundee United || Free || 27 January 2010", "!scope=\"row\"|Nicky Weaver"]}, {"page": "2009–10 Middlesbrough F.C. season", "response": ["| January 2010 ||  Nicky Weaver ||Dundee United || ||"]}, {"page": "2005–06 Manchester City F.C. season", "response": ["|  Nicky Weaver"]}, {"page": "2004–05 Manchester City F.C. season", "response": ["|12||GK||align=\"left\"| Nicky Weaver"]}]}}