{"wiki_id": "http://www.wikidata.org/entity/Q746126", "itemLabel": "George Macartney", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Macartney_(British_consul)", "wikipedia_page": {"main": "Sir George Macartney should not be confused with his kinsman George Macartney, an earlier British statesman.\nSir George Macartney  (Chinese: 馬繼業) (19 January 1867 –19 May 1945) was the British consul-general in Kashgar at the end of the 19th century. He was succeeded by Percy T. Etherton. Macartney arrived in Xinjiang in 1890 as interpreter for the Younghusband expedition. He remained there until 1918. Macartney first proposed the Macartney-MacDonald Line as the boundary between China and India in Aksai Chin.\nMacartney was born at Nanjing and was half-Chinese while his godfather was Chinese politician Li Hongzhang. His father, Halliday Macartney, was a member of the same family as  George Macartney, the 18th century British ambassador to China, and his mother was a near relative of Lar Wang, one of the leaders of the Taiping rebellion.Macartney married Catherine Borland in 1898. In Kashgar his wife, Catherine, Lady Macartney, assisted the archaeologists who found the library at Dunhuang. The Macartneys had three children.The Macartneys retired to Jersey in the Channel Islands, where they were trapped by the German occupation during World War II. Macartney died on Jersey, just a few days after the German surrender.", "link_mentions": [{"page": "Aksai Chin", "response": ["In 1893, Hung Ta-chen, a senior Chinese official at St. Petersburg, gave maps of the region to George Macartney, the British consul general at Kashgar, which coincided in broad details. In 1899, Britain proposed a revised boundary, initially suggested by Macartney and developed by the Governor General of India Lord Elgin. This boundary placed the Lingzi Tang plains, which are south of the Laktsang range, in India, and Aksai Chin proper, which is north of the Laktsang range, in China. This border, along the Karakoram Mountains, was proposed and supported by British officials for a number of reasons. The Karakoram Mountains formed a natural boundary, which would set the British borders up to the Indus River watershed while leaving the Tarim River watershed in Chinese control, and Chinese control of this tract would present a further obstacle to Russian advance in Central Asia. The British presented this line, known as the Macartney–MacDonald Line, to the Chinese in 1899 in a note by Sir Claude MacDonald. The Qing government did not respond to the note. According to some commentators, China believed that this had been the accepted boundary."]}, {"page": "Francis Younghusband", "response": ["In 1890, Younghusband was sent on a mission to Chinese Turkestan, accompanied by George Macartney as interpreter. He spent the winter in Kashgar, where he left Macartney as British consul.Dictionary of National Biography Sir George Macartney Younghusband wanted to investigate the Pamir Gap, a possible Russian entry route to India, but he had had to ensure that the Chinese at Kashgar were sorted out, to prevent a tripartite attempt by the Hunza clans. It was for this reason he recruited a Mandarin interpreter, junior officer George Macartney, to accompany his missions into the frozen mountains. They wintered in Kashgar as a listening post, meeting in conference with the Russian Nikolai Petrovsky, who had always resisted trade with Xinjiang (Sinkiang). The Russian agent was well-informed about British India, but proved unscrupulous. Believing he had succeeded, Younghusband did not reckon on Petrovsky's deal with the Taotai of Xinjiang."]}, {"page": "George Macartney, 1st Earl Macartney", "response": [":George Macartney should not be confused with Sir George Macartney, a later British statesman.", "George Macartney, 1st Earl Macartney  (14 May 1737 – 31 May 1806) was an Anglo-Irish statesman, colonial administrator and diplomat who served as the governor of Grenada, Madras and the British-occupied Cape Colony. He is often remembered for his observation following Britain's victory in the Seven Years' War and subsequent territorial expansion at the Treaty of Paris that Britain now controlled \"a vast Empire, on which the sun never sets\".", "He was an Irishman descended from a Scottish branch of the McCartney family whose ancestors originated in Ireland and were granted land in Scotland for serving under Edward the Bruce, Robert the Bruce's brother, see McCartney (surname), the Macartneys of Auchenleck, Kirkcudbrightshire, settled in Lissanoure County Antrim, Ireland, where he was born. He was the only son of George Macartney and Elizabeth Winder. After graduating from Trinity College Dublin, in 1759, he became a student of the Temple, London. Through Stephen Fox, elder brother of Charles James Fox, he was taken up by Lord Holland.", "On his return from a confidential mission to Italy in 1795, he was raised to the British peerage as Baron Macartney, and in the end of 1796 was appointed governor of the newly acquired territory of the Cape Colony, where he remained until ill health compelled him to resign in November 1798. In early 1797 he was requested to assist with the proposed plan to send an attacking force from the Cape under Major-General J. H. Craig to the South West coast of Spanish America by way of the British colony in New South Wales.Dundas to Macartney, 21 January 1797, \"Correspondence of George Macartney, 1st Earl Macartney, whilst Governor of the Cape of Good Hope\", Bodleian Library, GB 0162 MSS.Afr.t.2–4*. See also Robert J. King, \"An Australian Perspective on the English Invasions of the Rio de la Plata in 1806 and 1807\", International Journal of Naval History, vol. 8 no.1, April 2009,  He died at Chiswick, Middlesex, on 31 May 1806, the title becoming extinct.  After the death of his widow (Lady Jane Stuart, daughter of the 3rd Earl of Bute; they were married in 1768), his property passed to his niece, whose son took the name.", "*George Macartney papers, Kislak Center for Special Collections, Rare Books and Manuscripts, University of Pennsylvania"]}, {"page": "Lord Macartney", "response": ["*George Macartney, 1st Earl Macartney (1737-1806)", "*George Macartney (British consul) (1867–1945)"]}, {"page": "George Macartney", "response": ["George Macartney may refer to:", "*George Macartney (British Army officer) (died 1730)", "*George Macartney (1672–1757), MP for Belfast, Newton Limavady and Donegal", "*George Macartney (died 1724), MP for Belfast", "*George Macartney, 1st Earl Macartney (1737–1806), first British Ambassador to China", "*George Macartney (British consul) (1867–1945), British consul-general in Kashgar", "*George Macartney (Australian politician), member of the Victorian Legislative Assembly"]}, {"page": "Father Hendricks", "response": ["Accompanied by a Polish nobleman called Adam Ignatovich whom he had met in Omsk on his way to Chinese Turkestan,John Avetaranian, Richard Schafer and John Bechard, \"A Muslim who became a Christian\", 2003, page 83 Hendricks arrived in Kashgar in 1885 and remained there until his death. During his stay in Kashgar, Hendricks clashed with Nikolai Petrovsky, the Russian consul-general, and lived for a time with George Macartney at Chini-Bagh.\"Ruins of Desert Cathay – Personal Narrative of Explorations in Central Asia and Westernmost China\", Volume 1, M A Stein, 1907, p. 124 "]}, {"page": "Nikolai Petrovsky", "response": ["Petrovsky's main adversary during his time in Central Asia was George Macartney, his British counterpart. The competition between their two countries for influence in Central Asia is known as the Great Game. Between 1899 and June 1902 the two did not speak to each other, although both were on friendly terms with visiting travellers such as Sven Hedin. "]}, {"page": "Rudolf Hoernlé", "response": ["The first forged manuscript came from Islam Akhun, purchased by George Macartney and sent to Hoernle in 1895. Thereafter several more Akhun manuscripts followed. According to Peter Hopkirk, Backlund stationed in Central Asia wrote to Hoernle, informing him of his suspicions about Akhun's forgery, and reasons to doubt purchases from Akhun. However, Hoernle found reasons to dismiss Backlund's concerns and continue his analysis of manuscripts sold by Akhun, stating \"if these are copies freshly produced, then they are copies of ancient manuscripts\" just like reprints of old books."]}, {"page": "Islam Akhun", "response": ["It was in this competitive environment that Islam Akhun emerged. In 1895 he approached the British Consul in Kashgar, Sir George Macartney, with a number of manuscripts on paper.  Some were in a script similar to Brahmi and the documents were in several different formats, many bound with copper ties. Macartney purchased the documents and sent them to India in the hope that Augustus Rudolf Hoernlé, a prominent scholar of Indo-Aryan languages, would be able to decipher them.", "thumb|left|A forgery produced by woodblock printing by Islam Akhun and sold to George Macartney in Kashgar, 1896."]}, {"page": "A. R. B. Shuttleworth", "response": ["For a time in 1908, Shuttleworth was acting Consul in Kashgar while George Macartney was in England. During this time, Shuttleworth became involved in investigating the expeditions of Eizaburo Nomura and Zuicho Tachibana, even dining with them at Chini-Bagh. Shuttleworth reported his suspicions to Sir Francis Younghusband, and these suspicions about the two Japanese eventually made its way to Lord Morley, Secretary of State for India.Galambos, Imre (2010). \"Japanese ‘spies’ along the Silk Road: British suspicions regarding the second Otani expedition (1908-09)\". Japanese religions, Vol. 35 (1 & 2), pp. 33–61.Hopkirk, Peter (1980). Foreign Devils on the Silk Road: The Search for the Lost Cities and Treasures of Chinese Central Asia. Amherst: The University of Massachusetts Press. ."]}, {"page": "Pyotr Kozlov", "response": ["During the first decade of the 20th century, when the Great Game reached its peak, Kozlov rivaled Sven Hedin and Aurel Stein as the foremost researcher of Xinjiang. Although he was on good terms with Hedin and other foreign explorers, the British government, as represented by George Macartney, monitored his movements across Central Asia. Kozlov's 1905 visit to the Dalai Lama in Urga gave \"the British War Office a fright\",Palace, Wendy. The British Empire and Tibet, 1900–1922. Routledge, 2005. . Page 71. especially after the Lama declared his intention to \"settle within the confines of Russia\".Andreyev, Alexandre. Soviet Russia and Tibet: The Debacle of Secret Diplomacy, 1918-1930s. Brill Publishers, 2003. . Page 29."]}, {"page": "George Macartney, consul-general", "response": ["#REDIRECT George Macartney (British consul)"]}, {"page": "George Macartney (consul-general)", "response": ["#REDIRECT George Macartney (British consul)"]}, {"page": "Sino-Indian border dispute", "response": ["In 1893, Hung Ta-chen, a senior Chinese official at St. Petersburg, gave maps of the region to George Macartney, the British consul general at Kashgar, which coincided in broad details. In 1899, Britain proposed a revised boundary, initially suggested by Macartney and developed by the Governor General of India Lord Elgin. This boundary placed the Lingzi Tang plains, which are south of the Laktsang range, in India, and Aksai Chin proper, which is north of the Laktsang range, in China. This border, along the Karakoram Mountains, was proposed and supported by British officials for a number of reasons. The Karakoram Mountains formed a natural boundary, which would set the British borders up to the Indus River watershed while leaving the Tarim River watershed in Chinese control, and Chinese control of this tract would present a further obstacle to Russian advance in Central Asia. The British presented this line, known as the Macartney-MacDonald Line, to the Chinese in 1899 in a note by Sir Claude MacDonald. The Qing government did not respond to the note.: \"The proposed boundary seems never to have been considered in the same form again until Alastair Lamb revived it in 1964\". According to some commentators, China believed that this had been the accepted boundary."]}, {"page": "George McCartney (British consul)", "response": ["#REDIRECT George Macartney (British consul)"]}, {"page": "Halliday Macartney", "response": ["Macartney was a member of the same family as George Macartney, the 18th century British ambassador to China."]}, {"page": "Chini-Bagh", "response": ["Chini-Bagh was the Kashgar, Xinjiang residence of George Macartney, Britain's consul-general and his wife, Lady Catherine Macartney, for 28 years."]}, {"page": "Macartney–MacDonald Line", "response": ["William Johnson, a civil servant with the Survey of India proposed the \"Johnson Line\" in 1865, which put Aksai Chin in Kashmir. This was accepted by China until 1893, when Hung Ta-chen, a senior Chinese official at St. Petersburg, gave maps of the region to George Macartney, the British consul at Kashgar, which coincided with it in broad details.: \"Clarke added that a Chinese map drawn by Hung Ta-chen, Minister in St. Petersburg, confirmed the Johnson alignment showing West Aksai Chin as within British (Kashmir) territory.\""]}, {"page": "1913 New Year Honours", "response": ["*George Macartney, Esq., C.I.E., Consul-General at Kashgar."]}, {"page": "1900 Birthday Honours", "response": ["*George Macartney, Esq., Assistant to the Resident in Kashmir for Chinese Affairs."]}, {"page": "Catherine Macartney", "response": ["Catherine Theodora, Lady Macartney (1877-1949). Catherine (née Borland) was born in Bexley, Kent, England. She was the second daughter of James Borland born 1836 in Castle Douglas, Scotland. In 1898, she married Sir George Macartney, the British Consul in Kashgar. Catherine's father  had studied in Scotland with George Macartney's father, Halliday Macartney."]}, {"page": "Ella Sykes", "response": ["In 1915 she set off again to accompany her brother. He had been asked to become the temporary consul replacing Sir George Macartney in Kashgar whilst he and Catherine Macartney took a vacation. They had to journey to Tashkent and then proceed by pony over passes 12,000 feet above sea level to find Kashgar in Turkestan. The journey took them over a month. Whilst they were there they travelled further in some places this was exploration. She was the first British woman to pass through the \"Katta Dawan\" pass that was 13,000 feet high. Their journey home also took a month and these journeys were recorded in photographs. In 1920 she and her brother Percy published Through Deserts and Oases of Central Asia."]}, {"page": "List of politicians of Chinese descent", "response": ["* George Macartney"]}]}}