{"wiki_id": "http://www.wikidata.org/entity/Q7460027", "itemLabel": "Shabana Bakhsh", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Shabana_Bakhsh", "wikipedia_page": {"main": "Shabana Akhtar Bakhsh (born 1981) is a British-Pakistani actor of Pakistani descent who has appeared in soap operas such as River City and Doctors. Her best known role is in the BBC One school-based drama series, Waterloo Road starring as English teacher Jasmine Koreshi.", "link_mentions": [{"page": "Waterloo Road (TV series)", "response": ["Series 3 introduced several new characters, including new deputy head Eddie Lawson (Neil Morrissey) and, in the seventh episode, new headteacher Rachel Mason (Eva Pope). Other staff arrivals include NQT English teacher Jasmine Koreshi (Shabana Bakhsh) and Head of Music and Drama Matt Wilding (Chris Geere). Pupils introduced in the third series include Aleesha Dillon (Lauren Thomas), Danielle Harker (Lucy Dixon), Karla Bentham (Jessica Baglow), Paul Langley (Thomas Milner), Bolton Smilie (Tachia Newall) and Michaela White (Zaraah Abrahams)."]}, {"page": "List of Waterloo Road characters", "response": ["*Jasmine Koreshi (Shabana Bakhsh, series 3−4) is a newly qualified English teacher. She often butts heads with her Head of Department Grantly Budgen as he doesn't think she's up to the job, but she later earns his respect and he supports her as her union representative when school bully Michaela White falsely accuses Jasmine of hitting her. As a result of these allegations Jasmine is temporarily suspended but returns to the school when the truth comes out. She is also close friends with Davina Shackleton and Matt Wilding. In series 4 she develops a relationship with Head of PE Rob Cleaver, but breaks up with him after he is suspended for giving Bolton Smilie performance-enhancing drugs."]}, {"page": "List of Scottish actors", "response": ["*Shabana Bakhsh (born 1981)"]}, {"page": "Shabana bakhsh", "response": ["#REDIRECT Shabana Bakhsh "]}, {"page": "List of British Pakistanis", "response": ["* Shabana Bakhsh – actress who has appeared in soaps such as River City and Doctors"]}, {"page": "Shabhana Akhtar Bakhsh", "response": ["#REDIRECT Shabana Bakhsh"]}, {"page": "Scottish Asian", "response": ["* Shabana Bakhsh, actress"]}, {"page": "List of Doctors characters", "response": ["| Shabana Bakhsh"]}, {"page": "Shabana", "response": ["*Shabana Bakhsh, Scottish actress"]}, {"page": "Eilidh McCreadie", "response": ["| Julie Austin and Shabana Bakhsh"]}, {"page": "List of British Muslims", "response": ["* Shabana Bakhsh  actress who has appeared in soaps such as River City and Doctors"]}, {"page": "Waterloo Road (series 3)", "response": ["Another central character this series is Davina Shackleton (Christine Tremarco), who is accused of having a sexual relationship with pupil, Brett, and who was then forced to date his father. Other storylines included the deportation of a pupil, a plagiarism scam in the school that catches the examination board's attention and English teacher Jasmine Koreshi (Shabana Bakhsh) being accused by new pupil Michaela White (Zaraah Abrahams) of assault. ", "* Shabana Bakhsh as Jasmine Koreshi; English teacher (19 episodes)"]}, {"page": "Waterloo Road (series 4)", "response": ["* Shabana Bakhsh as Jasmine Koreshi; Deputy Head of English (19 episodes)"]}, {"page": "Shabana Akhtar Bakhsh", "response": ["#REDIRECT Shabana Bakhsh"]}, {"page": "List of British Punjabis", "response": ["* Shabana Bakhsh – actor"]}]}}