{"wiki_id": "http://www.wikidata.org/entity/Q746977", "itemLabel": "Rex McCandless", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rex_McCandless", "wikipedia_page": {"main": "Rex McCandless (1915–1992) was a former motorcycle racer, designer and constructor from Northern Ireland.Born in Hillsborough, County Down, McCandless had been a successful motorcycle racer prior to the Second World War. During the war, he worked in the aviation industry. He had been working as a vehicle mechanic when in 1943, he went into business with his brother Cromie McCandless to repair vehicles for the Ministry of Supply. It was at this time that he built his own motorcycle which became the prototype for the successful featherbed frame adapted by the Norton Motorcycle Company.In the following years McCandless worked on the frame design, improving it and calling it the 'Kneeler'. This version went on to break many world speed records. In the mid-1950s he moved into four wheels and he designed two aluminum-bodied racing cars for Harry Ferguson. In the 1960s he turned his attention to aviation and built his own autogyro.", "link_mentions": [{"page": "Ulster Folk and Transport Museum", "response": ["Attractions in the grounds themselves include a model railway operated by the Model Engineers Society of Northern Ireland. The model engineers give train rides to thousands of children and adults every year free of charge. A small donation helps the Society to pay for fuel for the trains. This facility is a great asset to the transport museum and enjoyed by many thousands of visitors every year who keep returning to the museum and avail of this model railway experience. There is the 120 ton steel schooner Result. Recent additions to the collection include a full set of Stanley Woods racing memorabilia, and two of his bikes. Also on display is a Rex McCandless vehicle and an early Formula 1 racing car. A little known fact of which there are examples in the museum is that the pogo stick was invented in Comber, County Down. Previously used by local potato farmers to make holes for planting their seed it was later developed by local inventor Archibald Springer who saw potential for its use as a mode of transport and sporting novelty."]}, {"page": "Cromie McCandless", "response": ["Cromie McCandless (17 January 1921 – 18 January 1992)Isle of Man Courier page 2 & 22 24 January 1992 was a Grand Prix motorcycle road racer. His best season was in 1951, when he finished in third place in the 125cc world championship behind Carlo Ubbiali and Gianni Leoni. McCandless won two Grand Prix races during his career. He was the brother of Rex McCandless who designed the successful featherbed frame used by the Norton Motorcycle Company."]}, {"page": "Norton ES2", "response": ["From 1959 it used the Rex McCandless designed Featherbed frame, with upgrades featuring an improved AMC gearbox, revised cylinder head, crankshaft-mounted Lucas RM15 60-watt alternator with coil ignition and an 8-inch front brake with full width hubs front and rear.The Motor Cycle, Road Test, 4 June 1959 The wideline Featherbed-framed bike was road tested in The Motor Cycle 4 June 1959 issue and was reported to have a mean top speed of 82 mph with petrol consumption of 56 mpg at 60 mph."]}, {"page": "Featherbed frame", "response": ["The featherbed frame was a motorcycle frame invented by the McCandless brothers and offered to the British Norton motorcycle company to improve the performance of their racing motorcycles in 1950. It was considered revolutionary at the time,\"As opposition companies strove to develop completely new machines with multi-cylinder engines, far more powerful than the Norton single, Bracebridge Street was content to find new speed in 1950 with a revolutionary new frame which steered and handled so superbly that it immediately earned the now forever-famous tag Featherbed\". Sixty Years of Speed, 1967 a Motorcycle News publication, pp.41-42 Accessed 26 January 2018Motorcycle handling and chassis design: the art and science by Tony Foale. 2006 and the best handling frame that a racer could have.\"Introduced in 1950, the featherbed Norton frame, designed by Rex McCandless, of Belfast, became, and still is, the standard by which handling and steering of all racing machines is judged\". Sixty Years of Speed, 1967 a Motorcycle News publication, p.41 Accessed 26 January 2018The Café Racer Phenomenon by A Walker. 2009 Later adopted for Norton production motorcycles,Motorcycle Mechanics, August 1966, pp.36-37 Featherbed stripdown. \"Developed from the one-time, world-beating Manx Norton, the Dominator 'featherbed' frame is still regarded as the ultimate in steering, handling and roadholding.\" Accessed 8 February 2018 it was also widely used by builders of custom hybrids such as the Triton, becoming legendary and remaining influential to this day.Motor Cycle, 23 April 1964, pp.494-497 Norton Featherbed Twins by John Ebrell. \"The famous featherbed frame, beloved of specials builders. Its absolute rigidity makes a big contribution to the legendary Norton roadholding\". Accessed and added 4 February 2018Do not mourn the Featherbed! Motorcycle Sport, August 1978, p.218 \"The Featherbed Nortons were some of the all time greats, but to ascribe to the shape of the frame some magic properties is to detract from the design of the whole bicycle, its weight distribution and geometry and to give to the frame's progenitors some of the credit due to the likes of Ken Sprayson, who knows a thing or three about its development.\" Accessed 10 January 2018", "In 1949 brothers Rex and Cromie McCandless offered Norton a new frame to support their successful 500cc race single. Rex McCandless was a self-taught Belfast motorcycle engineer and raced competitively with his brother on a Triumph Tiger 100. He had made several improvements to the Triumph, notably an innovative new frame with a swinging arm fitted with vertical hydraulic shock absorbers from a Citroen car. BSA bought several of his converted motorcycles but Norton saw the real opportunity and contracted him to work exclusively for them from 1949. The Norton Motorcycle Company were concerned at the reliability of their plunger (or \"Garden Gate\") frame, as several had broken through the stress of racing. Norton engineer Joe Craig solved the problems by making the frames heavier but handling suffered as a consequence.", "* Picture of Rex McCandless"]}, {"page": "Rex (given name)", "response": ["* Rex McCandless (1915–1992), Northern Irish motorcycle racer "]}, {"page": "1949 Ulster Grand Prix", "response": ["|  Rex McCandless"]}, {"page": "McCandless (surname)", "response": ["* Rex McCandless (1915–1992), motorcycle road racer, designer of the Norton Featherbed frame, brother of Cromie"]}, {"page": "Norton Model 88 Dominator", "response": ["Norton had commissioned Belfast racer and engineer Rex McCandless to build a new frame for their Manx racers. The McCandless frame was first used in 1950 and brought many victories for the Norton team and praise from the riders. The landmark design influenced motorcycle chassis design for many years. The 88 used the featherbed frame to provide a sportier road bike, although the road going versions of the frame were made from mild steel tubing rather than the Reynolds 531 tube of the racers. Early frame could distort if bumped into a curb which was resolved by adding a reinforcing gusset. The frame was  than the ES2 type frame of the Model 7."]}]}}