{"wiki_id": "http://www.wikidata.org/entity/Q748500", "itemLabel": "Black Radical Mk II", "itemDescription": "rapper", "wikipedia_url": "https://en.wikipedia.org/wiki/Black_Radical_Mk_II", "wikipedia_page": {"main": "Black Radical Mk II (born Felix Joseph in 1971) is a British hip hop artist from Tottenham, London, England. He was one of the pioneers of the British scene, releasing his first single in 1987 and continuing to release records until 1998. He is most well known for his strident political views, which he often used as the basis for his records.", "link_mentions": [{"page": "Music of the United Kingdom (1980s)", "response": ["A British hip hop scene emerged in the early 1980s, largely based on American hip hop music at parties and club nights, In this period some pop records dabbled with rap – such as Adam and the Ants' \"Ant Rap\" (1981), Wham!'s \"Wham Rap! (Enjoy What You Do)\" (1982) and Malcolm McLaren's \"Buffalo Gals\" (1982). More serious British artists were rapping live or recording amateur tapes in the early 1980s, but the first British hip hop tune released on record was \"London Bridge\" by Newtrament in 1984. Over the next few years, more UK hip hop and electro was released: Street Sounds Electro UK (1984), which was produced by Greg Wilson and featured an early appearance from MC Kermit, who later went on to form the Wilson produced Ruthless Rap Assassins; The Rapologists' \"Kids Rap/Party Rap\" (1984), but releases and national publicity were still rare. Mainstream radio did play British hip hop on occasion, and instrumental in giving the scene wider recognition were DJs such as Dave Pearce, Tim Westwood, and John Peel, but in this period it made very little impact on the mainstream charts. The scene remained predominantly underground depending on word of mouth and the patronage of pirate radio stations. The first UK record label devoted to releasing UK hip hop acts was Simon Harris' Music of Life label, founded in 1986. It was home to Derek B, the first UK rapper to achieve chart success. Music of Life went on to sign groups such as Hijack, the Demon Boyz, Hardnoise (later Son of Noise) and MC Duke. Other acts and styles developed from the hip hop scene, resulting in new genres to describe them – for example Massive Attack with trip hop, or Galliano with acid jazz. Hip Hop Connection, the first major British hip hop magazine, was founded in 1989 and by the early 1990s the British hip hop scene seemed to be thriving. Not only was there a firm base of rappers in London –  such as Blade, Black Radical Mk II and Overlord X – but many distinct scenes developed nationally."]}, {"page": "British hip hop", "response": ["Moving away from its US roots, British hip hop started to develop its own sounds: acts like Hijack, II Tone Committee, Hardnoise, and Silver Bullet developed a fast and hardcore style, while many other acts took influences from elsewhere. Caveman and Outlaw Posse developed a jazz influenced style, whilst MC Mell'O' mixed jazz and hardcore. London Posse, Black Radical Mk II and DJ Ruf Cut And Tuf C were more influenced by reggae and disco whilst the Wee Papa Girl Rappers, Cookie Crew and Monie Love achieved chart success with more radio-friendly hip hop. However, despite the chart success of some British-born hip hop artists – for example Monie Love, Slick Rick, Young MC and MF Doom, who all moved to the US – the majority of the scene was still underground and small scale.", "Hip Hop Connection — the first major British hip hop magazine – was founded in 1989 and by the early 1990s the British hip hop scene seemed to be thriving. Not only was there a firm base of rappers in London such as Blade, Black Radical Mk II, Overlord X and Bushkiller (including Sirus) — but many distinct scenes developed nationally."]}, {"page": "Black Radical MK II", "response": ["#REDIRECT Black Radical Mk II "]}, {"page": "Black Radical", "response": ["#Redirect Black Radical Mk II"]}, {"page": "Black Radicle", "response": ["#Redirect Black Radical Mk II"]}, {"page": "Black Radicle MK II", "response": ["#Redirect Black Radical Mk II"]}, {"page": "Black Radicle Mk II", "response": ["#Redirect Black Radical Mk II"]}]}}