{"wiki_id": "http://www.wikidata.org/entity/Q7488052", "itemLabel": "Shane Duff", "itemDescription": "Northern Irish footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shane_Duff", "wikipedia_page": {"main": "Shane Joseph Duff (born 2 April 1982) is an English former-born Northern Irish footballer, who last played for Bradford City. He was forced to retire from the professional game on 26 January 2012 due to injury. His elder brother, Michael Duff played for Premier League side Burnley.\nKnown as an uncompromising centre back, he was at Cheltenham Town F.C. for 10 years until 2010. He is also a principal member of Jaguar Sports Coaching.", "link_mentions": [{"page": "Cheltenham Town F.C.", "response": ["Yates, ahead of his first full season with Cheltenham, revamped the squad, releasing eight players, including defender Shane Duff, who had just completed his tenth year with the club. The season proved to be successful to begin with, with the Robins remaining close to the play-off positions, but they collapsed in the second half of the season and finished 17th, with only five wins in 26 games in 2011."]}, {"page": "Duff (surname)", "response": ["* Shane Duff, Northern Irish footballer"]}, {"page": "Richard Keogh", "response": ["Upon his return to City, he still wasn't named in a single matchday squad and so returned to League One on loan for a third time on 11 March, this time with Cheltenham Town. He went straight into the starting XI on the day of his arrival, helping the club to a 2–1 win away at Leeds United. His one-month loan was later extended to the end of the season and he played every minute of the 10 Cheltenham matches that his loan period covered. Manager Keith Downing said that he was \"very pleased\" with Keogh's performances, calling him a \"tremendous asset\" who \"strengthened the defence\" and formed a partnership at centre-back with Shane Duff that was as good as any in the League. Keogh helped the club to four wins and two draws, The Robins finished 19th and three points above the relegation zone. In July 2008, with Keogh out of contract at the end of the season, clubs began to show an interest in signing him, though due to his age City were entitled to compensation. Keogh was again offered a new contract but the club openly admitted that they expected him to leave, with newly promoted Championship club Doncaster Rovers and League One clubs Southend United and Carlisle United interested in signing him.", "Keogh captained Ireland for the second time on 31 May 2016 in the 2–1 home defeat to Belarus. At Euro 2016, Keogh was an unused sub for Ireland's first two group matches. He was then brought in to the starting eleven for Ireland's final two games; partnering Shane Duffy at centre-back against Italy and France respectively."]}, {"page": "Michael Wylde", "response": ["Born in Birmingham, West Midlands, Wylde signed his first professional contract with The Robins aged 19-year-old. Wylde suffered a broken jaw in a clash with Cheltenham Town teammate Shane Duff in a pre-season friendly against Hereford United on 4 August 2007."]}, {"page": "Michael Townsend", "response": ["Following a lengthy period of injury Townsend returned to regain his place in the Cheltenham side alongside Shane Duff, and helping Cheltenham to avoid relegation. As of August 2009, Townsend has made 140 appearances for Cheltenham Town."]}, {"page": "Sri Lanka Premier League", "response": ["|  Shane Duff"]}, {"page": "2006 Football League Two play-off Final", "response": ["Cheltenham Town's opponents in their play-off semi-final were Wycombe Wanderers, with the first match of the two-legged tie taking place at Adams Park in High Wycombe on 13 May 2006.  The visitors took the lead two minutes before half-time when John Finnigan scored from Shane Duff's knockdown.  Steve Guinan doubled their lead in the 75th minute before a close-range volley from Wycombe's Tommy Mooney in the last minute of the match made the final score 2–1 to Cheltenham.  The second leg of the semi-final was held at Whaddon Road in Cheltenham five days later.  The game ended goalless, with Guinan shooting over the Wycombe crossbar from close range in the 70th minute.  Cheltenham progressed to the final with a 2–1 aggregate victory.", "|CB ||4 ||Shane Duff"]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Shane Duff||||2010–2011||14||1||"]}, {"page": "2010–11 Bradford City A.F.C. season", "response": ["|align=\"left\"|Shane Duff", "| = || DF || 16 || Shane Duff || 1 || 0 || 0 || 0 || 1", "|Shane Duff"]}, {"page": "2010–11 Cheltenham Town F.C. season", "response": ["| Shane Duff"]}, {"page": "Bedale High School", "response": ["*Shane Duff, footballer"]}, {"page": "2011–12 Bradford City A.F.C. season", "response": ["| Shane Duff"]}]}}