{"wiki_id": "http://www.wikidata.org/entity/Q7488218", "itemLabel": "Shane Oakley", "itemDescription": "British illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Shane_Oakley", "wikipedia_page": {"main": "Shane Oakley is a British illustrator and comic book artist from Stoke-on-Trent, England.", "link_mentions": [{"page": "Roger Corman", "response": ["Corman operated a short-lived comic book imprint in 1995–1996 called Roger Corman's Cosmic Comics. It produced comics based on his films, written and drawn in a similar no-hold-barred style. Titles included Bram Stoker's Burial of the Rats, Caged Heat 3000, Death Race 2020, Welcome to The Little Shop of Horrors, and Rock & Roll High School — the latter featuring the Melvins (instead of the Ramones). Reed, Patrick A. \"Pop Music Comics: The 90s, part three. Roger Corman & The Melvins, and more KISS,\" Depth of Field (February 11, 2012). Notable creators published by Cosmic Comics included Trevor Goring, James Kochalka, Jason Lutes, Pat Mills, Shane Oakley, Jerry Prosser, and J. R. Williams. The longest-running title was Death Race 2020, which lasted eight issuesRoger Corman's Cosmic Comics at the Grand Comics Database. Retrieved Apr. 26, 2021. — but was left unfinished when the company closed down."]}, {"page": "Alan Grant (writer)", "response": ["Grant has set-up his own comics publishing company Berserker Comics, the first title was The Dead: Kingdom of Flies with another, Church of Hell, published in 2009. Both have Simon Bisley on art duties. Grant is a part of Renegade Arts Entertainment which, with Berserker Comics, is co-publishing Channel Evil, a four-issue mini-series with art by Shane Oakley."]}, {"page": "Rock 'n' Roll High School", "response": ["Corman's short-lived comic book publishing imprint, Roger Corman's Cosmic Comics, released a two-issue take on the film in 1995, written by Bob Fingerman with art by Shane Oakley and Jason Lutes. Unable to acquire likeness licenses for the Ramones, the comic instead featured the Melvins.Reed, Patrick A. \"Pop Music Comics: The 90s, part three. Roger Corman & The Melvins, and more KISS,\" Depth of Field (February 11, 2012)."]}, {"page": "Mister X (Vortex)", "response": ["Mister X was a series of comic books first published in 1983–1990 by Canadian company Vortex Comics.  Created by album and book cover designer Dean Motter, it was developed for a year in close collaboration with comic artist and illustrator Paul Rivoche, whose series of poster illustrations stirred up great interest in the project. The series published early work by comic artists who would later emerge as important alternative cartoonists, including Jaime Hernandez, Gilbert Hernandez, Mario Hernandez, Seth, Shane Oakley and D'Israeli.", "After the first volume of the Motter-based series ended in 1985, a second 12-issue black-and-white series concluding the saga was written by Jeffrey Morgan. The first six issues were penciled by Shane Oakley, and the remaining six by D'Israeli with inks by Ken Holewczynski."]}, {"page": "Steve Moore (comics)", "response": ["Moore was portrayed, as himself, in Albion #1 (WildStorm, Aug. 2005); the six-issue limited series aimed to revive classic IPC-owned British comics characters, all of whom appeared in comics published by Odhams Press and later IPC Media during the 1960s and early 1970s, such as Smash!, Valiant, and Lion.Contino, Jennifer M. \"Andrew Sumner & Albion,\" Comicon.com (22 Feb. 2005). In the comic, the fictional Moore admits to having signed the so-called \"Official Secrets Act,\" which ensured that the fact that IPC characters were actually real would be kept secret from the public. Albion was plotted by Alan Moore, written by his daughter Leah Moore and her husband John Reppion, with art by Shane Oakley and George Freeman."]}, {"page": "Steve Niles", "response": ["*Cthulhu Tales (with Chee, Shane Oakley, Boom! Studios, 2008, ongoing, first tpb December 2008, )We Are But Ants: Mark Waid & Steve Niles Talk Lovecraft , Comics Bulletin, February 1, 2008"]}, {"page": "D'Israeli (cartoonist)", "response": ["In 1988 he worked as the penciller on issues 7 to 12 of Mister X (volume two). His early work also includes the surreal Timulo, which appeared in Deadline magazine in 1989. Also in Deadline, he co-created Fatal Charm with Shane Oakley. In 1991 he co-created the cyberpunk series Lazarus Churchyard with Warren Ellis."]}, {"page": "Albion (comics)", "response": ["Albion is a six-issue comic book limited series plotted by Alan Moore, written by his daughter Leah Moore and her husband John Reppion, with covers by Dave Gibbons and art by Shane Oakley and George Freeman. As a result of a deal forged by Vice-President Bob Wayne of DC Comics and Publishing Director Andrew Sumner of IPC Media,Brady, Matt. \"Inside the DC-IPC Deal\", Newsarama, 2 August 2004.", "*Shane Oakley: Albion Artist, John Freeman interviews Shane Oakley, 23 February 2007"]}, {"page": "The Steel Claw (comics)", "response": ["The character again entered limbo, until it was announced in 2005 that DC Comics would be using the character along with a number of other IPC characters, in a six issue mini-series called Albion. This would be plotted by Alan Moore, and written by Leah Moore and John Reppion, with art by Shane Oakley and George Freeman. The series was complemented by an album collection, published by Titan Books, reprinting the Ken Bulmer/Jesus Blasco serials from Valiant."]}, {"page": "United Kingdom Comic Art Convention", "response": ["| [Early] Sept. 1991 || London  ||  Murphy Anderson and Dan Jurgens || Cover by Simon Bisley; interior work by Paul Johnson, David Pugh, Philip Bond, Martin Hand, Mark Buckingham, Paul Grist, Craig Dixon, Mike Gibas, Arthur Ranson, Woodrow Phoenix, Mike Collins, Sean Phillips, Hunt Emerson, Lew Stringer, Phil Elliott, Leigh Baulch, Barry Kitson, Duncan Fegredo, Angus McKie, Murphy Anderson, Peter Doherty, Kevin O'Neill, Bob Lynch, Davey Jones, Darryl Cunningham, John Higgins, Simon Harrison, John McCrea, Rian Hughes, Kev F. Sutherland, Gary Erskine, Martin Griffith, Art Wetherell, Davy Francis, Ed McHenry, Shane Oakley, Alan Davis, Martin Nodell, and Lee Sullivan  ||"]}, {"page": "Leah Moore", "response": ["*Albion (plotted by Alan Moore, with co-author John Reppion, and art by Shane Oakley, Wildstorm, 2006, tpb, Wildstorm, 176 pages, December 2006, , Titan Books, 144 pages, January 2007, )"]}, {"page": "John Reppion", "response": ["*Albion (plotted by Alan Moore, with co-author Leah Moore, and art by Shane Oakley, Wildstorm, 2006, tpb, Wildstorm, 176 pages, December 2006, , Titan Books, 144 pages, January 2007, )"]}, {"page": "Robot Archie", "response": ["In 2005–2006, Robot Archie, as well as many of IPC's adventure heroes, appeared in the six-issue limited series Albion, published by the Wildstorm imprint of DC Comics. Albion  was plotted by Alan Moore, and written by Leah Moore and John Reppion, with art by Shane Oakley and George Freeman. Robot Archie was featured on the cover of the first issue, which was drawn by Dave Gibbons.Albion #1-6 (WildStorm [DC Comics], Aug. 2005–Nov. 2006)."]}, {"page": "Bob Fingerman", "response": ["* Rock & Roll High School #1–2 (with Shane Oakley and Jason Lutes) (Roger Corman's Cosmic Comics, 1995)"]}, {"page": "Alan Moore bibliography", "response": ["* Albion #1–6 (plot, scripted by Leah Moore and John Reppion, art by Shane Oakley and George Freeman, 2005–2006) collected as Albion (tpb, 144 pages, 2006, )"]}, {"page": "Neil Gaiman bibliography", "response": ["*Blaam!: \"The Great Cool Challenge\" (with Shane Oakley, anthology one-shot, Willyprods/Small Time Ink, 1988)", "**Forbidden Brides of the Faceless Slaves in the Secret House of the Night of Dread Desire (adapted and drawn by Shane Oakley, graphic novel, 48 pages, 2017, )"]}, {"page": "Jason Lutes", "response": ["* (inks) Rock & Roll High School #1–2 (with Bob Fingerman and Shane Oakley) (Roger Corman's Cosmic Comics, 1995)"]}, {"page": "David Hitchcock (comics)", "response": ["Recent projects include Gothic, a collection of short stories, some original and some previously published. He is also working on a short story for Boom! Studios' Cthulhu Tales with Shane Oakley. He is currently illustrating a two-volume graphic novel called Madam Samurai, with screenwriter Gary Young, whose credits include the film Harry Brown starring Michael Caine.", "* \"a whistle for the deep\" (art, with writer Shane Oakley, in Cthulhu Tales No. 12, Boom! Studios, March 2009)"]}, {"page": "Andrew Sumner", "response": ["During his time at IPC, Sumner revived Fleetway's classic British comics library, overseeing Dirk Maggs' Adventures of Sexton Blake for BBC Radio 2, co-publishing (with DC Comics) Leah Moore, John Reppion and Shane Oakley's Albion; Dave Gibbons and John Higgins' Thunderbolt Jaxon; and Garth Ennis and Colin Wilson's Battler Britton. He curated Titan Books' reprint archive editions The King of Crooks, The Steel Claw, and Albion Origins.\"Albion Man\". Retrieved 19 October 2012.\"Forever Albion\". Retrieved 19 October 2012."]}, {"page": "Oakley (surname)", "response": ["*Shane Oakley, English illustrator and comic book artist"]}, {"page": "Janus Stark", "response": ["Janus Stark appears in the six-issue limited series Albion (2005) by Alan Moore, Leah Moore, John Reppion, Shane Oakley, and George Freeman. In this \"new\" two-page adventure, he is imprisoned, along with at least Spring-heeled Jack and Joseph Merrick (the Elephant Man), by an Inspector Bryant, simply for being thought by the Victorian government to be \"dangerous individuals.\" Stark succeeds in breaking them all out of prison.Albion #1 (Wildstorm, August 2005)."]}, {"page": "Rod McKie", "response": ["McKie was portrayed, as himself, in Albion #3 (WildStorm, Dec. 2005), the six-issue limited series that aimed to revive classic IPC-owned British comics characters, all of whom appeared in comics published by Odhams Press and later IPC Media during the 1960s and early 1970s, such as Smash!, Valiant, and Lion.Contino, Jennifer M. \"Andrew Sumner & Albion,\" Comicon.com (Feb. 22, 2005). (Albion was plotted by Alan Moore, written by his daughter Leah Moore and her husband John Reppion, with art by Shane Oakley and George Freeman.)"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Shane Oakley illustrator and comic book artist."]}, {"page": "List of Eagle Award nominees and winners", "response": ["**Albion (Alan Moore/Leah Moore/John Reppion/Shane Oakley)"]}, {"page": "Mike Higgs", "response": ["Higgs was portrayed, as himself, in Albion #1 (WildStorm, Aug. 2005); the six-issue limited series aimed to revive classic IPC-owned British comics characters — including Higgs' The Cloak — all of whom appeared in comics published by Odhams Press and later IPC Media during the 1960s and early 1970s, such as Smash!, Valiant, and Lion.Contino, Jennifer M. \"Andrew Sumner & Albion,\" Comicon.com (Feb. 22, 2005). Albion was plotted by Alan Moore, written by his daughter Leah Moore and her husband John Reppion, with art by Shane Oakley and George Freeman."]}]}}