{"wiki_id": "http://www.wikidata.org/entity/Q7493623", "itemLabel": "Shelina Zahra Janmohamed", "itemDescription": "British writer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shelina_Zahra_Janmohamed", "wikipedia_page": {"main": "Shelina Zahra Janmohamed (born 13 April 1974) is a British writer. She is the author of Love in a Headscarf (2009), a memoir of growing up as a British Muslim woman. Her new book titled Generation M: Young Muslims Changing the World was published in August 2016. Generation M, as The Guardian puts it, \"is the first detailed portrait\" of the influential segment of the world’s \"fastest growing religion\", Islam. She is also a blogger: her blog is called Spirit 21.", "link_mentions": [{"page": "Haberdashers' School for Girls", "response": ["*Shelina Zahra Janmohamed, author (Class of 1992)"]}, {"page": "Women in Islam", "response": ["#Consumerism. Shelina Zahra Janmohamed, the author and Vice President of brand consultancy Ogilvy Noor, has warned that the rise of contemporary Islamic fashion as exemplified by the ḥijāb risks being overwhelmed by the \"consumerism and objectification\" of the mainstream fashion industry: \"Muslim fashion is teetering between asserting a Muslim woman's right to be beautiful and well-turned out, and buying more stuff than you need, and being judged by your clothes – both of which are the opposite of Islamic values.\""]}, {"page": "Muslim Writers Awards", "response": ["On 22 November 2011, the fifth Muslim Writers Awards took place at Shakespeare's Globe in London. The event was supported by Muslim Hands and sponsored by the Penguin Group, Puffin Books, Islam Channel and the Brit Writers Awards. Singer Dawud Wharnsby performance poet zkthepoet performed at the event. Guests included authors Aamer Hussein, Roopa Farooki, Irfan Master and Shelina Zahra Janmohamed amongst wider literary and publishing industry figures."]}, {"page": "100 Women (BBC)", "response": ["| Shelina Zahra Janmohamed ||  ||Blogger, columnist and author", "| Shelina Zahra Janmohamed || Blogger, columnist and author"]}, {"page": "Shelina Janmohamed", "response": ["#REDIRECT Shelina Zahra Janmohamed"]}]}}