{"wiki_id": "http://www.wikidata.org/entity/Q7498860", "itemLabel": "Shirley Summerskill", "itemDescription": "British politician (born 1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shirley_Summerskill", "wikipedia_page": {"main": "Shirley Catherine Wynne Summerskill (born 9 September 1931) is a British Labour Party politician and former government minister, who served as the Member of Parliament for Halifax from 1964 to 1983.", "link_mentions": [{"page": "September 9", "response": ["*  1931   – Shirley Summerskill, English physician and politician"]}, {"page": "1983 United Kingdom general election", "response": ["|Shirley Summerskill"]}, {"page": "List of political families in the United Kingdom", "response": ["** Shirley Summerskill, MP for Halifax 1964–1983. Daughter of Edith."]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Dr. Shirley Summerskill"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Dr. Shirley Summerskill"]}, {"page": "Donald Rooum", "response": ["Rooum proved that an offensive weapon had been planted on him.Driver, Christopher, The Disarmers: A Study in Protest, London: Hodder and Stoughton, 1964 On 11 July, he had joined a demonstration against the royal party at Claridge's hotel. He held up a banner reading, \"Lambrakis RIP\", referring to a Greek MP and peace activist who had been murdered.  According to Rooum's account, the banner was confiscated by a police officer and read by four plain clothes men.  Rooum asked, \"Can I have my banner back?\"  He was approached by one of the officers: \"This big one with the short-back-and-sides stepped forward. 'Can you have your what back?' \"'My banner.\"  \"He smiled at me.  'You're fucking nicked, my old beauty,' he said, and gave me a terrific clout on the ear.\"Rooum, Donald, \"I've dislodged a bit of brick\", Anarchy, No.36, Vol.4. No.2, February 1964 At the police station, the officer, Detective Sergeant Harold Challenor, \"took from his pocket a screwed-up newspaper, which he opened with a flourish.  Inside was a piece of brick.  His smile widened. 'There you are, my old beauty.  Carrying an offensive weapon.  You can get two years for that.'\" Rooum was a member of the National Council of Civil Liberties and he had, by good fortune, read some material on forensic science and so gave his clothes to his defence solicitor Stanley Clinton Davis for analysis. No brick dust was found in his pocket and Rooum convinced the magistrate that therefore no brick could have been there at the time of the alleged offence.Link to article on Challenor, mentioning Rooum's role in exposing him James Morton (1993) Bent Coppers pp.118–9 There followed a public inquiry that criticised the police and led to the imprisonment of three officers.Parliamentary question by Shirley Summerskill to Home Office ministers Report of Enquiry, by Mr A.E.James, QC, 1965 HMSO, Cmnd 2735 Rooum received £500 compensation (£9,655 at 2017 value) and other convictions were overturned. Challenor was deemed mentally unfit to plead and was committed to Netherne mental hospital. A subsequent enquiry found that he had probably been suffering from the onset of paranoid schizophrenia for some months before the incident, but the lack of any successful prosecution against him was seen by some as evidence of further establishment corruption.Parliamentary question to Attorney General re Challenor by Arthur Lewis"]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Dr. Shirley Summerskill"]}, {"page": "Ben Summerskill", "response": ["His paternal grandmother (Baroness) Edith Summerskill and his aunt (Dr) Shirley Summerskill were both Labour Members of Parliament and government ministers. Dr Edith Summerskill, a former Chairman of the UK Labour Party, was an early advocate of Britain's free National Health Service and a vocal campaigner for women's equality. Shirley Summerskill helped introduce the UK's Sex Discrimination Act, as a Home Office minister. His maternal grandfather Sydney Elliott was a newspaper editor of various papers, including the London Evening Standard. In 1944 Elliott became Editorial Advisor at the Daily Mirror, where he masterminded its campaign to support the Labour Party at the 1945 general election."]}, {"page": "Parliamentary Under-Secretary of State for the Home Department", "response": ["*March 1974: Shirley Summerskill (to 1979)"]}, {"page": "Halifax (UK Parliament constituency)", "response": ["|1964 || Shirley Summerskill || Labour"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Shirley Summerskill"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Dr Shirley Summerskill"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Shirley Summerskill"]}, {"page": "Edith Summerskill", "response": ["Summerskill was married in 1925 to Dr Jeffrey Samuel. Their children took their mother's surname. Her daughter, Shirley Summerskill, also served as a physician, member of parliament and government minister. Her grandson Ben Summerskill became chief executive of the British gay equality charity Stonewall in 2003."]}, {"page": "Socialist Health Association", "response": ["*Dr Shirley Summerskill MP"]}, {"page": "Roy Galley", "response": ["Having stood unsuccessfully for Dewsbury in 1979, he was elected as Member of Parliament for Halifax in the 1983 general election. He ousted from Westminster the re-selected Labour candidate, Dr Shirley Summerskill. As in many seats the win, by 1,869\tvotes, 3.4%, was due a swing from Labour to the SDP, and when that vote fell in the 1987 general election, he was defeated by Labour's Alice Mahon.See election results for Halifax: 1979, 1983 and 1987"]}, {"page": "John Ryman", "response": ["Ryman was a former husband of Shirley Summerskill, another Labour MP. They married in 1957 but had divorced by the time he entered Parliament.The New York Times Biographical Service, Volume 6, page 1614 He was married five times in all. He claimed to have invested some money belonging to his fifth wife Nicola, a wealthy widow, in a high-yield Swiss bank account but in fact squandered the money on a horse, Jaguar car and holidays on the Orient Express. He had previously narrowly escaped being prosecuted by the family of a mistress whose money he had also claimed to have invested in a Swiss account."]}, {"page": "Labour government, 1974–1979", "response": ["|Under-Secretary of State for Home Affairs||Shirley Summerskill||8 March 1974|| "]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["* Edith Summerskill, MP for Fulham West 1938–55 and Warrington 1955–61, was mother of Shirley Summerskill, MP for Halifax 1964–83. Their consecutive service in the Commons totalled 43 years and spans 45 years.", "Shirley Summerskill, MP for Halifax 1964–83, who divorced in 1971 from her husband John Ryman, who later became MP for Blyth 1974–83, and Blyth Valley 1983–87."]}, {"page": "List of University of Oxford people in British public life", "response": ["| Shirley Summerskill"]}, {"page": "Ford sewing machinists strike of 1968", "response": ["The movement ultimately resulted in the passing of the Equal Pay Act 1970, which came into force in 1975 and which did, for the first time, aim to  prohibit inequality of treatment between men and women in Britain in terms of pay and conditions of employment.Equality Act an important milestone says Unite , Unite, 1 October 2010. Retrieved 8 October 2010Equal pay heroes honoured , TUC, 5 June 2006Women's Worth: the story of the Ford sewing machinists notes by Sue Hastings, Sue Hastings, 2006, accessed 201-10-08 In the second reading debate of the bill, MP Shirley Summerskill spoke of the machinists playing a \"very significant part in the history of the struggle for equal pay\". "]}, {"page": "Summerskill", "response": ["*Shirley Summerskill (born 1931), British Labour Party politician and former government minister"]}, {"page": "1978 North Sea storm surge", "response": ["Flood warnings were issued two to three hours before the highest water levels in the coastal towns of Lincolnshire. Clement Freud the Member of Parliament for North East Cambridgeshire called for an inquiry into the failure of the flood warnings in East Anglia. The Junior Minister Shirley Summerskill reported that an \"Alert\" message was received by Police in Wisbech at 0705 hours and a further message at 1414 hours confirming that there was danger of tidal flooding at 1928 hours. On receipt of the second message, the Fenland District Council was notified immediately. The message was passed simultaneously to the Anglian Water Authority by the Cambridgeshire Constabulary headquarters. Gavin Strang of the Ministry of Agriculture, Fisheries and Food responded that the storm tide warning service issued an alert to the Norfolk Police at 0625 hours and a warning at 1318 hours on 11 January in relation to the Norfolk coast as far east as Mundesley. An alert for the coastal area to the East and South of Mundesley was issued at 1150 hours and a warning at 1810 hours. The police are responsible for passing on these messages to other authorities."]}, {"page": "List of female members of the House of Commons of the United Kingdom", "response": ["|She resigned as an MP and was made a life peer as Baroness Summerskill, of Kenwood in the County of London. In 1966 she was made a CH. She was the mother of Shirley Summerskill."]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Shirley Summerskill MP (1931), Labour Party politician and former government minister"]}, {"page": "List of female members of the House of Lords", "response": ["|Edith Summerskill, Baroness SummerskillLabour MP 1938-1961. Mother of Shirley Summerskill"]}]}}