{"wiki_id": "http://www.wikidata.org/entity/Q7495859", "itemLabel": "Sheyla Bonnick", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheyla_Bonnick", "wikipedia_page": {"main": "Sheyla Bonnick is a singer/songwriter performer Co-producer fashion designer author among other things. Born in Jamaica and brought up in England. Her name was previously spelled as Sheila Bonnick and Sheila Bonnique.", "link_mentions": [{"page": "Boney M.", "response": ["After a slow start, the song became a hit in the Netherlands and Belgium. It was then that Farian decided to hire performers to create a group for TV appearances. Farian found model-turned-singer Maizie Williams (originally from Montserrat) and her Jamaican singer friend Sheyla Bonnick, along with a dancer known only as \"Mike\" for the early performances. Also during 1975, a singer named Nathalie joined but was soon replaced by Jamaican-born Claudja Barry. Then Bonnick and Mike left, and Maizie Williams brought in Bobby Farrell, a male exotic dancer from Aruba. Singer Marcia Barrett (from Jamaica) joined the group, who brought in Liz Mitchell, a former member of the Les Humphries Singers to replace Claudja Barry who left in February 1976 to pursue a solo career. The enduring Boney M. line-up was Liz Mitchell, Maizie Williams, Marcia Barrett, and Bobby Farrell."]}, {"page": "Maizie Williams", "response": ["Brought up in Birmingham, England, Williams began working as a model, eventually gaining the title Miss Black Beautiful in a contest in 1973. After this initial success she went on to front her own band — Black Beautiful People. She later moved to West Germany with her friend Sheyla Bonnick. One day in 1975, while at a restaurant, the two were approached by an agent who asked if they were interested in joining a new pop group called Boney M. \"She asked if we could sing. Well, you don't say no, do you,\" Williams later recalled in an interview. She had previously been singing with a local band back in England but had been told off by her brother Billy: \"You have a terrible voice. Better keep working as a walking clothes-hanger.\"Gerd Röckl: Boney M. (German book, 1978) p. 126", "Both Liz Mitchell and Marcia Barrett were singers and would participate in the group's recordings together with producer Frank Farian who did the deep male voice. The threesome recorded the follow-up single \"Daddy Cool\" which soon became a worldwide hit and launched the group's phenomenal career, with numerous hit singles and albums over the next decade. Williams and Bobby Farrell did not sing on the records since \"their voices weren't suited for this particular kind of music\" as Farian put it in a Bravo interview in 1978. It did not create a scandal – both Williams and Farrell did sing during the group's many live performances during their extensive world tours 1977–1979.  Williams remained with the group until the ultimate break-up in 1990. In 1994, she did what her former colleagues Liz Mitchell and Bobby Farrell had also done, she formed her own Boney M group, billed as Boney M featuring Maizie Williams. The group also featured Sheyla Bonnick from the short-lived original 1975 line-up. Williams herself would finally front as a lead singer in the group's renditions of the hits \"Brown Girl in the Ring\", \"Hooray! Hooray! It's a Holi-Holiday\", \"Sunny\" and \"Daddy Cool\"."]}, {"page": "Phoenix Academy, Shepherd's Bush", "response": ["* Sheyla Bonnick, singer"]}, {"page": "List of Jamaican British people", "response": ["* Sheyla Bonnick, singer-songwriter, performer, co-producer, fashion designer, author "]}, {"page": "Brad Vee Johnson", "response": ["After graduating from New York University, he relocated to Europe in 1986 where he took up residence in Stockholm, Sweden. There he continued his singing career and furthered it by performing in various musicals such as Jesus Christ Superstar at Østre Gasværk Teater in Copenhagen, Denmark under the direction of Lars Kaalund, Show Boat, Company, Miss Saigon in Malmö, The Buddy Holly Story at Göta Lejon in Stockholm, and The Lion King in Scandinavia, Germany and the Netherlands. In 1992 he met Sheyla Bonnick, founding member of Boney M with whom he continues to tour to this day under the Sounds of Boney M Formation. In 1994, he also successfully started Sweden's premiere gospel choir One Voice, together with singer and friend Blossom Tainton.", "He relocated to Romania in 2004 after a concert at the then called Tutankamon (now Obsession) in Cluj-Napoca, Romania where he was immediately offered a record contract with Roton Records. He recorded two house/club singles with Romanian composer DJ Raoul. During his time in Romania he organized a number of concerts in order to raise awareness on Romanian youth suffering from HIV/AIDS and the stigma it may carry. He has since relocated to Bucharest, where he is currently based, performing both locally and internationally with his gospel group, jazz and blues band, and under the formation of the Sounds of Boney M with Sheyla Bonnick. He earned his PhD in Sociology in 2012 based on his work on researching and shedding light on the inequality present in the modern education system."]}, {"page": "Sheyla", "response": ["*Sheyla Bonnick, Jamaican singer and performer, active since 1975"]}, {"page": "Kivi (board game)", "response": ["Kivi (Finnish for \"stone\" or \"rock\") is a 2016 abstract strategy board game for two to four players, invented by British Maureen Hiron and Jamaican-born British Sheyla Bonnick."]}, {"page": "List of Jamaican inventions and discoveries", "response": ["*Kivi (2016)  -  co-designed by Jamaican-born Sheyla Bonnick", "*Eye Catch (2017) -  co-designed by Sheyla Bonnick", "*Sneak Peek (2018) - co-designed by Sheyla Bonnick"]}]}}