{"wiki_id": "http://www.wikidata.org/entity/Q7491007", "itemLabel": "Shaun Williamson", "itemDescription": "English actor, singer, media personality and occasional presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Shaun_Williamson", "wikipedia_page": {"main": "Shaun Williamson (born 29 November 1965) is an English actor best known as Barry Evans in EastEnders and as a satirical version of himself in the BBC/HBO sitcom Extras.", "link_mentions": [{"page": "EastEnders", "response": ["In 2003, cast member Shaun Williamson, who was in the final months of his role of Barry Evans, said that the programme had become much grittier over the past 10 to 15 years, and found it \"frightening\" that parents let their young children watch."]}, {"page": "Carry On (franchise)", "response": ["A new film, Carry On London, was announced in 2003 by producer Peter Rogers and producer James Black but remained in pre-production well into 2008. The script was signed off by the production company in late March 2008, and \"centred on a limousine company ferrying celebrities to an awards show\". The film had several false starts, with the producers and cast changing extensively over time. Only the little-known Welsh actress Jynine James remained a consistent name from 2003 to 2008. Danniella Westbrook, David Jason, Shaun Williamson and Burt Reynolds were also once attached to the project. It was announced in May 2006 that Vinnie Jones and Shane Richie were to star in the film, which was to be directed by Peter Richardson, though Ed Bye later replaced him as the named director. At the 50th anniversary party held at Pinewood Studios in March 2008, Peter Rogers confirmed that he was planning a series of Carry On films after London, subject to the success of the first."]}, {"page": "Ricky Gervais", "response": ["The Guardians Chris Tryhorn explained the \"few gripes\" he had with Extras, \"particularly in the second series\". \"You can forgive Gervais a certain arrogance after the success of The Office, but....\" He remarks on the confused tone of the series, taking in the clash between the broad comedy of characters Barry (Shaun Williamson) and Darren (Stephen Merchant), and the apparent parody of this style with When The Whistle Blows, and \"given their total indulgence of Gervais, the BBC is portrayed as interfering, its comedy department run by a rather crudely stereotyped gay couple\"."]}, {"page": "1965 in television", "response": ["| Shaun Williamson"]}, {"page": "Maidstone", "response": ["*Shaun Williamson (born 1965), actor"]}, {"page": "Porridge (1974 TV series)", "response": ["In 2009 Porridge was adapted into a stage show, also written by Clement and La Frenais, starring former EastEnders actor Shaun Williamson as Fletcher and Daniel West as Godber. Peter Kay, a fan of the show, was previously offered the role but turned it down. It opened in September 2009 to positive reviews."]}, {"page": "The Secret Policeman's Ball", "response": ["The show included appearances from Frank Skinner, Alan Carr, Graham Norton, Sean Lock, Kristen Schaal, Fearne Cotton, Matt Berry, Katherine Parkinson, Mitchell and Webb, Jason Manford, Shappi Khorsandi, Russell Howard, Katy Brand, Tim Minchin, Sarah Millican, Kayvan Novak, Meera Syal, Shaun Williamson, Sharon Horgan, Nick Mohammed, Dan Clark, David Armand, Eddie Izzard, Ed Byrne, Deborah Meaden, Jon Culshaw, Gok Wan, and Mike Fenton Stevens. Additionally, Keane and Razorlight gave musical performances while Russell Peters appeared via video-tape."]}, {"page": "Anything Goes", "response": ["The critically acclaimed Sheffield Theatres production directed by Daniel Evans began a UK and Ireland tour at the New Wimbledon Theatre on January 29, 2015, and was scheduled to visit 32 venues in its nine-month run. The production starred Debbie Kurup as Reno Sweeney and Matt Rawle as Billy Crocker with Hugh Sachs as Moonface Martin and Jane Wymark as Evangeline Harcourt until April 4, 2015, followed by Shaun Williamson and Kate Anthony, respectively, from April 6, 2015. The tour was cut short and ended at the Grand Opera House, Belfast on May 30, 2015."]}, {"page": "Keith Chegwin", "response": ["In November 2011 Chegwin played himself in the comedy horror film Kill Keith. He made an appearance in Ricky Gervais and Stephen Merchant's comedy series Life's Too Short with Shaun Williamson and Les Dennis. In August 2012, he was presented with a Lifetime Achievement Award at the National Reality TV Awards.\"National Reality TV Awards 2012 – Winners Announced\" , National Reality TV Awards; accessed 11 December 2017.\"Les Dennis, Shaun Williamson, Chegwin for 'Life's Too Short' return\" , DigitalSpy.co.uk, 28 August 2012."]}, {"page": "Norman Stanley Fletcher", "response": ["In 2009, the character was revived in a stage production, penned by Dick Clement and Ian La Frenais, and is played by Shaun Williamson."]}, {"page": "Paul Trueman", "response": ["During his time on the show, Paul instigates a feud with his brother Anthony (Nicholas Bailey); copes with the untimely death of their mother Audrey (Corinne Skinner-Carter); develops a close interaction with Audrey's ex-husband Patrick (Rudolph Walker), who soon turns out to be Paul's adopted father; sparks friendships with the square's local hardman Phil Mitchell (Steve McFadden) and his nemesis Steve Owen (Martin Kemp); gets blackmailed by old acquaintance Angel Hudson (Goldie) into repaying him the money he owes and later having a relationship with the latter's estranged lover Precious (Judi Shekoni); conspire with Phil's cousin Billy (Perry Fenwick) to force his enemy Trevor (Alex Ferns) into leaving Walford so his wife, Little Mo Mitchell (Kacey Ainsworth), would be prevented from further domestic abuse; temporarily romanced with Phil's sister Sam (Kim Medcalf); briefly date Billy's ex-girlfriend Janine Butcher (Charlie Brooks) until she ends up causing the death of his friend Barry Evans (Shaun Williamson) on the day after they got married; support Patrick on his wedding day to his fellow shopkeeper Yolande (Angela Wynter); and end up working for Sam's gangland husband Andy Hunter (Michael Higgs) that ultimately contributes to Paul's departure from the show.", "That same year, Paul begins a sexual relationship with Billy's ex-girlfriend Janine Butcher (Charlie Brooks); she concocts a plan to fleece her step-brother Barry Evans (Shaun Williamson) of all his money and invites Paul into her scheme, which he accepts. Janine professes to love Barry while all the time sleeping with Paul. However, on Janine's wedding day to Barry, Paul attempts to stop the plan by confessing that he loves her and they do not need Barry's money. However, Janine refuses and marries Barry anyway - as she has also been led to believe that he is terminally ill and could use the opportunity to inherit his wealth. But when Janine learns from Barry that his illness is a false alarm, she becomes repulsed and confesses that their marriage is a sham to him - also revealing her affair with Paul in the process. Barry attempts to get Janine to love him by forgiving her, but she ends up pushing him away and Barry consequently falls down a ravine to his death."]}, {"page": "Webber Douglas Academy of Dramatic Art", "response": ["*Shaun Williamson"]}, {"page": "Have I Been Here Before?", "response": ["|Shaun Williamson"]}, {"page": "Pat Butcher", "response": ["In 2000, Pat and Frank go on a holiday with their respective spouses alongside fellow couple Terry Raymond (Gavin Richards) and his wife Irene Raymond (Roberta Taylor) in Spain. During this time, Frank seduces Pat and she tries to end the affair; however, when Frank turns up on her doorstep with no clothes and a comedy bow-tie on his neck, she realizes that she had never stopped loving him either. The duo continue their affair they eventually decide to elope to Manchester. They are due to depart on Guy Fawkes Night in November 2000, when Pat has second thoughts. But it is too late — Peggy has already found Frank's farewell letter, and shames the cheating duo by reading it to the entire pub before slapping Frank and Pat. Peggy throws Frank out and he leaves Walford alone. Roy is initially willing to forgive Pat and explains that certain things have got to change, but his son Barry (Shaun Williamson), alerts him to a suitcase containing massage oils along with fishnet stockings and a red Basque that Pat was planning to take with her for Frank. Enraged by her betrayal, Roy throws Pat out and she is left penniless and homeless. Roy later asks Pat for a divorce. "]}, {"page": "Extras (TV series)", "response": ["* Shaun Williamson as Barry from EastEnders (himself)", "Andy Millman (Ricky Gervais) is an aspiring actor who can only find work as an extra, which he calls being a \"background artist\" as a means of making the work seem more dignified. Andy is accompanied on his various projects by his platonic best friend and fellow extra, Maggie Jacobs (Ashley Jensen). Maggie is well-meaning but ditzy, often missing obvious social cues and failing to exhibit appropriate tact and subtlety in conversations. Unlike Andy, Maggie has no aspirations toward being anything more than an extra. Andy's agent, Darren Lamb (Stephen Merchant), has no real experience in the field of entertainment. He is incompetent, often taking no steps at all to find work for Andy, and even discouraging potential employers from hiring his client due to his flabby physique, age, and lack of acting experience. Darren is assisted by former soap opera star Shaun Williamson, who plays himself. Lamb frequently tries to undermine Andy by suggesting Williamson (who Lamb refers to by his former EastEnders character name, \"Barry\") is better suited for various acting roles that are offered to Andy."]}, {"page": "Mel Owen", "response": ["When she first arrived in the square, Mel started working for local businessman Ian Beale (Adam Woodyatt). They soon begin dating and Ian later requests Mel to help with his children; Mel finds the children hard to deal with at first but grows to love them. Ian and Mel plan to marry, but Mel gets cold feet – realising she doesn't truly love Ian. When Ian discovers this, he claims that his daughter Lucy (Casey Anne Rothery) is dying of cancer in a desperate bid to retain his romantic bond with Mel; she gives in and later agrees to marry him. The pair marry on New Year's Eve 1999, in a double wedding with fellow neighbors Barry Evans (Shaun Williamson) and Natalie Evans (Lucy Speed). At their reception, however, Mel discovers a letter that Ian threw away – which officially gave Lucy the all-clear; she confronts Ian and, after he admits to lying about his daughter's health, dumps him just as the clock strikes midnight and the new millennium begins.", "An unlikely romance was scripted into Mel's narrative when she began dating her boss Ian Beale (Adam Woodyatt). The pairing has been described as one of \"the most unbelievable soap couples\", but Outwaite defended it in 1999, saying \"I know I've fancied some not particularly attractive men in my time, but I don't think Ian is actually ugly. He has a vulnerable side and that's what is attractive. When he is being all hot-headed and gets above himself then I personally don't like Ian. But when he is being vulnerable I can see the attraction. People talk to me about it all the time. I have taxi drivers telling me I could do much better than Ian. The other day someone shouted that I should go back with [Mel's former fling] Steve Owen. It's incredible, they'd rather [Mel] went out with [Steve who is] a murderer than with [Ian, who is] a hard-working father raising three children.\" Their relationship was the focus of the storyline that aired to mark the Millennium celebrations, when Ian emotionally blackmailed Mel into marrying him by claiming that his daughter was dying of cancer; storylines in the latter part of 1999 focused on the build-up to a joint Millennium wedding on New Year's Eve 1999 with Barry Evans (Shaun Williamson) and Natalie Evans (Lucy Speed). The wedding went as planned; however, Mel and Ian's marriage ended hours later as the clock struck midnight to signify the beginning of the New Year after Mel discovered Ian's lie. The Millennium Eve episodes drew in 20.89 million viewers – the biggest soap audience since the character Tiffany Mitchell (Martine McCutcheon) was killed off in EastEnders precisely one year earlier (New Year's Eve 1998). An EastEnders spokeswoman commented: \"This is a remarkable endorsement of the power of EastEnders that over 20 million viewers chose to see the Millennium celebrations in Albert Square.\" The episodes were also broadcast on screens in London's Trafalgar Square, a typical “haunt for New Year's Eve revelers”."]}, {"page": "Steve Owen (EastEnders)", "response": ["Before the events of Dan's trial, Mel alerts Steve that his mother expects a visit from him about her condition to her terminal heart disease. At first Steve doesn't want to visit Barbara and refuses to explain his reasons to Mel, but he eventually changes his mind after having a heart-to-heart with local neighbour Natalie Price (Lucy Speed) about their relationship progressions; with Natalie confining to Steve about how her past troubles have been overcome thanks to her marriage with Roy's only-son, Barry (Shaun Williamson). Afterwards, Steve visits his mother in her flat and it quickly becomes clear that she is in critical condition due to her terminal heart disease. It is then revealed that Barbara had previously abused Steve when he was a child, and that she never appeared to care for either him or Jackie. When Steve confronts her about her past behaviour, she sarcastically defends her actions by claiming that his late father Richard had left her to bring up him and Jackie with no money. Steve reluctantly goes to call an ambulance as his mother's condition appears to escalate, but she refuses and instead demands Steve give her a kiss. Steve call an ambulance and asks him to kiss her. He gives her a peck on the forehead but she asks for a kiss on the lips. When he leans forward, she grabs him and gives him an extremely passionate kiss, telling him he is an attractive man. Disgusted and traumatized, Steve furiously disowns his mother and leaves after calling her sick. Mel is later informed that Barbara has died and tells Steve about it, but he reacts indifferently and refuses to attend her funeral; Mel later ends up going to the funeral on her own. She subsequently confronts Steve for his callousness over his mother's death, but then sympathizes with her husband when he is forced to explain how his mother neglected and abused him during his childhood."]}, {"page": "Lyn Paul", "response": ["In 2011, she embarked on a nationwide tour of a new musical Rhinestone Mondays starring alongside Faye Tozer, Ian \"H\" Watkins and Shaun Williamson. She played the role of Sophie. The musical was said to be the first ever country and western jukebox musical to be created and, although the performances were generally well received with Paul singing classics such as \"Stand By Your Man\" and \"Crazy\", the show completed its run five weeks early."]}, {"page": "Janine Butcher", "response": ["The character has been described as a \"super-bitch\" and a \"classic villainess\". She has proven popular with critics and fans of the show. Her storylines typically involve her in an antagonistic role. She has been married four times to Barry Evans (Shaun Williamson) whom she killed on New Year’s Day 2004, David (Harry Towb), Ryan Malloy (Neil McDermott) and Michael Moon (Steve John Shepherd). Her feuds include a long-standing conflict with stepmother Pat Butcher (Pam St Clement), Sonia Jackson (Natalie Cassidy), Lynne Slater (Elaine Lordan), Laura Beale (Hannah Waterman), Peggy Mitchell (Barbara Windsor), Stacey Slater (Lacey Turner) and Kat Slater (Jessie Wallace). Her initial departure saw Janine being wrongfully charged for the death of Laura Beale. Upon her return, Janine is caught forging a wedding that ends with the her new husband abruptly dying of a fatal heart attack. She later accidentally kills local resident Danielle Jones (Lauren Crace) in a hit-and-run car drive; conspires with Peggy's husband Archie (Larry Lamb) to defraud the Mitchell family from their ownership of The Queen Victoria public house; becomes a prime suspect in Archie's murder investigation before attempting to kill her third husband Ryan by poisoning him. She later gives birth to a daughter Scarlett with fourth husband Michael before eventually killing him - leading to her third departure from the show. ", "Janine gets a job working at Barry Evans' (Shaun Williamson) car lot after becoming friendly with Barry, following the death of his father Roy. She and her friend, Paul Trueman (Gary Beadle) plan to fleece Barry out of his money. She seduces Barry and moves in with him, but also sleeps with Paul. Eventually, Barry proposes to Janine, and she accepts, thinking that Barry has a life-threatening heart murmur. They marry on New Year's Eve 2003 in Scotland, but Janine is furious when Barry's illness turns out to be a false alarm. They take a stroll around the hills and cliffs on New Year's Day 2004, but Janine cracks and admits everything. Barry refuses to believe that she does not love him and tries to embrace her. Repulsed, Janine pushes him away and he falls down a cliff, fatally hitting his head on a rock; Janine watches him die. As his widow, Janine inherits Barry's estate and has him cremated in Scotland, denying his friends and family a chance to pay their respects. This makes Barry's ex-wife Natalie (Lucy Speed) suspicious, and she becomes close to Paul, who feels guilty about his role in Barry's death. Spurred on by Natalie, Paul gives a statement to the police, implicating Janine in Barry's death."]}, {"page": "List of former EastEnders characters", "response": ["|Barry Evans || Shaun Williamson || 1994–2004"]}, {"page": "Emma Barton", "response": ["During the 2016–17 Christmas pantomime season, Barton played the role of Tinkerbell in the Crawley Hawth Theatre pantomime production of Peter Pan alongside Shaun Williamson as Captain Hook and Richard David-Caine and Joseph Elliott (from CBeebies Swashbuckle) as pirates on Captain Hook's ship."]}, {"page": "Roy Evans (EastEnders)", "response": ["Roy arrives in Albert Square with his son Barry (Shaun Williamson) at the end of 1994, a successful car-dealer and business associate of David Wicks (Michael French). While undertaking business arrangements, Roy meets and is instantly attracted to David's mother Pat Butcher (Pam St. Clement). Recently separated from her former husband Frank (Mike Reid), who has mysteriously disappeared, Pat is unwilling to begin a new romance with Roy. However, David, sensing that it may benefit a favorable outcome between their businesses, encourages the relationship and the pair soon fall in love and move in together. The relationship suffers a setback when it is revealed that Roy is unable to consummate his love for Pat because he has been impotent for many years. Although Pat is understanding, Roy nevertheless feels emasculated. Eventually they both agree that love and companionship are more important than sex. Pat and Roy's relationship blossoms until the reappearance, on Christmas Day 1995, of Frank – who has come home to claim his business and his wife. Frank and Roy are involved in a feud over the ownership of the car lot and Frank continuously tries to convince Pat to resume their relationship. Despite Frank stirring up buried feelings in Pat and a secret one-night stand, she ends up divorcing him and marries Roy in 1996.", "In 2002, it was announced that Roy was being written out of the soap. Caunter said playing Roy had been \"the happiest period of my career. We felt we'd done enough with Roy, and it was time for me to move on. I will miss working alongside my screen family and all the team at EastEnders, but I look forward to trying out some new roles.\" Executive producer Louise Berridge said, \"The character of Roy has been invaluable to us. He provides a centre of stability it will be hard to replace, and represents a sense of values we must make sure we retain. I agree that it's time for the character to move on, but we will all miss Tony very much. Apart from being always the consummate professional, he is also a really lovely man, and we all wish him every success in whatever he turns his hand to next.\" In 2003, it was reported that Roy would depart the serial by being killed off. A source told the Daily Mirror, \"He decided to leave the show but wanted scriptwriters to leave the door open for his character to return for guest spots. Sadly, the producers have closed that door by killing him off. Tony is disappointed by the way he'll be leaving Albert Square. He's a popular character and viewers will be sad to see him go.\" Roy suffered a fatal heart attack following the breakdown of his son Barry's (Shaun Williamson) marriage to Natalie (Lucy Speed), making his final appearance in March 2003."]}, {"page": "The British Soap Awards", "response": ["| \"Best Exit\" || Sheree Murphy (Tricia Dingle in Emmerdale) || Henry Luxemburg (Toby Mills in Hollyoaks)  Miles Petit (Roy Farmer in Family Affairs)  Shaun Williamson (Barry Evans in EastEnders)"]}, {"page": "Ricky Butcher", "response": ["Ricky returns to Walford in August 2002 with Liam after hearing from his former stepmother Pat Evans (Pam St. Clement), that his sister Janine Butcher (Charlie Brooks) has resorted to prostitution and drug abuse. Ricky remains to help Janine and returns to his old job as a mechanic at the Arches. He begins a second affair with Natalie, which ruins her marriage to Roy's son Barry (Shaun Williamson). By then, Roy and Pat have formed a marriage together. Roy soon passes away after suffering a fatal heart attack amid learning about the affair and that Pat had kept it secret at the time she found out about it herself.", "The spin-off paved the way for Ricky to return to EastEnders as a regular character in 2002, without Bianca. The most notable storyline featuring the character during this period was a second affair with Natalie Evans (Lucy Speed), breaking up her marriage to Barry Evans (Shaun Williamson). In a plot twist, this affair ended in disaster when Ricky was caught having a one-night stand with his ex-wife Sam (Kim Medcalf)."]}, {"page": "Lucy Speed", "response": ["Away from acting, Speed has appeared in television game shows. These include Celebrity Ready, Steady, Cook, and Celebrity Weakest Link hosted by Anne Robinson, and Pointless Celebrities partnering her former on-screen EastEnders husband, Shaun Williamson. In 2007, Speed fronted the first self-protection instructional DVD, entitled \"Stay Safe With Lucy Speed\". The DVD features special forces and \"martial arts guru\" Andy Hopwood, and teaches various self-defence techniques."]}, {"page": "Natalie Evans", "response": ["Executive producer Matthew Robinson reintroduced the character in 1999 as a businesswoman and a love interest for Barry Evans (Shaun Williamson). Storylines included a rocky marriage to Barry, contemplating abortion, almost sleeping with her brother-in-law, rekindling her affair with Ricky, a relationship with Paul Trueman (Gary Beadle) and desperately trying to get Janine Butcher (Charlie Brooks) arrested for murdering Barry. Speed began to appear less frequently in 2003 due to personal reasons. Her departure was announced in early 2004, and Natalie left on 10 May 2004.", "In 1999, Natalie reappears as a new self-confident business woman, running a dating agency. Barry Evans (Shaun Williamson), unaware of Natalie's history, uses her agency, \"Romantic Relations\". Despite Natalie's attempts to set Barry up with other female hopefuls, she eventually becomes attracted to him herself and they begin dating. Natalie's reappearance is met unfavourably by Bianca and fights ensue. However, they eventually call a truce and become friends again. Natalie's business does not prosper and closes soon after.", "After a four-year absence, Lucy Speed decided that she wanted to return to the series. She mentioned this to her former castmate Ross Kemp, who played Grant Mitchell in the serial and he initiated contact between Speed and then executive-producer, Matthew Robinson. Robinson had been thinking of introducing a new love-interest for the character Barry Evans (Shaun Williamson) and he had already considered the possibility that the love interest could be Natalie. Speed has commented \"It was good timing. He thought I and the character fit the bill\". Natalie made her reappearance on-screen on 8 March 1999 and a relationship between the two characters was developed. A friendship was also re-established between the characters Natalie and Bianca in a special four-hander episode – although \"the closeness was never quite the same\".", "The storyline reached its climax in March 2003. On-screen the character's plans to abscond with Ricky and her son (on the night of her surprise birthday party) were thwarted by Barry's discovery of the affair – leading to a public confrontation between the three protagonists. Shaun Williamson who played Barry has commented \"Barry is absolutely devastated as his whole life is ripped apart. He can’t believe Nat has betrayed him. He loves his life with Natalie and Jack, and would do anything to make it work as a family again. Losing Natalie is going to be really difficult for Barry, but I think the hardest thing will be losing his son\". The storyline signified the end of the characters' three-year marriage and in a final plot twist Natalie opts to finish with Ricky and leave Walford alone, having discovered that he has recently slept with his ex-wife Samantha.", "To mark the character's exit a special documentary was aired in March 2004, entitled EastEnders Revealed: Natalie Evans. The programme looked back over 10 years of the character's time in the soap and featured interviews from Speed and tributes from her former castmates Shaun Williamson (Barry), Charlie Brooks (Janine), Natalie Cassidy (Sonia Jackson), Gary Beadle (Paul), Pam St. Clement (Pat) and Tony Caunter (Roy).", "In 2002 the character was featured in a spoof of the Michael Jackson hit video, Thriller, which was made as part of the annual fund-raising event, Children in Need. Shaun Williamson as Barry played the Michael Jackson role, while Lucy Speed as Natalie took on Ola Ray's role as his date. Unlike the original video – where Jackson was seen to turn into a zombie – the spoof saw Natalie transformed into the walking dead. A dozen cast-members took part in the spoof where they recreated the dance routine made famous in the original video. Speed has commented \"I really enjoyed that. We were there on our day off but it was brilliant fun. I used to be a dancer and to be able to do some moves on the Square was good. We all wanted to look as horrific and disgusting as possible. Shaun split his trousers while doing it as well. I think they were really tight though\"."]}, {"page": "Barry Evans (EastEnders)", "response": ["Barry Evans is a fictional character from the BBC soap opera EastEnders, played by Shaun Williamson. He first appeared in episode 1072, originally shown in the United Kingdom on 27 December 1994, and made his last appearance in episode 2653, originally shown on 2 January 2004. The character is portrayed as a \"buffoon\".Barry Evans played by Shaun Williamson Williamson controversially left the serial after nine years in 2003 after executive producer Louise Berridge refused to allow him time off to star in a seasonal pantomime, and the character was killed off.", "left|thumb|200px|An early image of Barry in the 1990s.The character was originally intended to appear in four episodes, debuting in December 1994. According to Barry's actor Shaun Williamson, the character was originally conceived as a tall, blond haired man. Williamson was neither particularly tall nor blond, and after being called for an audition to read for the part, he thought about dropping out as he was not a physical match. However, the director stated that \"nothing is laid in cement\" with regard to the character, so Williamson went ahead with the audition. Williamson has said that Barry was meant to be a vehicle to bring his father Roy Evans (Tony Caunter) into the show, as Roy was being scripted as a new love interest for the regular character Pat Butcher (Pam St Clement); in Barry's first appearance he meets Pat to apologise for a dodgy car he had sold her, paving the way for Roy to be introduced to her. For the next year and a half, Barry made sporadic appearances, in Williamson's own words \"popping in and out\". When a storyline in 1996 saw Barry imprisoned for arson, Williamson has said that he was uncertain whether his character would appear again; however the character was brought back on a more permanent basis later in the year.", "Viewers saw Natalie and Barry's marriage sour towards the end of 2002 when, in the New Year's Eve episode, Natalie rekindles a secret affair with her former lover Ricky Butcher (Sid Owen), which continued into 2003. Speed commented “Natalie's always had strong feelings for Ricky. And now she's grown tired of being a mother to baby Jack and Barry.\" The storyline reached its climax in March 2003. On-screen Natalie's plan to abscond with Ricky were thwarted by Barry's discovery of the affair, leading to a public confrontation between the three protagonists. Shaun Williamson has commented “Barry is absolutely devastated as his whole life is ripped apart. He can’t believe Nat has betrayed him. He loves his life with Natalie and Jack, and would do anything to make it work as a family again. Losing Natalie is going to be really difficult for Barry, but I think the hardest thing will be losing his son.” The storyline signified the end of the characters’ three-year marriage.", "In 2002 the character was featured in a spoof of the Michael Jackson hit video, Thriller, which was made as part of the annual fund-raising event, Children in Need. Shaun Williamson (as Barry) played the Michael Jackson role, while Lucy Speed (as Natalie) took on Ola Ray’s role as his date. The spoof saw Natalie transformed into a zombie, as Jackson was in the original video. Several cast members took part in the spoof where they recreated the dance routine made famous in the original video.", "Following his stint on EastEnders, Shaun Williamson had a regular role as a comically unemployable version of himself in the Ricky Gervais and Stephen Merchant comedy series Extras, in which his career has bogged down partially as a result of the incompetence of his agent Darren Lamb (played by Merchant). A frequent running gag is that even Lamb is unable to remember his client's real name, instead referring to him as \"Barry off EastEnders,\" in reference to Williamson's EastEnders character. The character of Barry Evans has also been spoofed in the cartoon sketch show 2DTV.", "On 20 January 2017, EastEnders actor Jake Wood and Channel Four posted a satirical video showing \"Barry\" singing (Something Inside) So Strong at the inauguration of  President Donald Trump on Twitter. The video actually shows Shaun Williamson performing at the 2014 World Indoor Bowls Championship in Great Yarmouth."]}, {"page": "Cindy Beale", "response": ["In 1992, Ian discovers that Simon has abandoned Cindy and Steven. Ian persuades her to return to Walford so he can help her bring Steven up. They reunite and Cindy gets pregnant in 1993. Richard Cole (Ian Reddington) is romantically interested in Cindy but she rejects him, so Richard tells people that he is the father of her twins. Everyone believes him, and Ian and Cindy almost separate but the truth emerges, just before Lucy and Peter are born in December. Married life and motherhood takes its toll on Cindy and she has two affairs, first with Matt (Toby Walton), a lifeguard, in 1994, and then with Simon's half-brother, David Wicks (Michael French), also Ian's half-brother, in 1995. Cindy and David meet secretly for a year and she falls in love with David, growing less and less tolerant of Ian. Suspecting Cindy is cheating, Ian hires a private investigator, who records Cindy and David in a clinch. Ian vows to take Cindy to court for custody of their children. David loses interest in Cindy so she takes drastic action and in October 1996, she hires John Valecue (Steve Weston), a hitman to kill Ian. Although she changes her mind, it is too late and Ian is shot, collapsing in a pool of blood in front of Cindy. The police suspect Cindy is involved and when David is called in for questioning, Cindy knows she will soon be arrested, so decides to flee with her children. Assisted by David and Barry Evans (Shaun Williamson), she collects her sons, but is unable to get Lucy, and is forced to leave without her. David also stays behind, promising Cindy that he will try to get Lucy and join her later, but he never does."]}, {"page": "Beppe di Marco", "response": ["Now out of work ever since getting fired at the police force, Beppe starts to look for jobs - and initially gets one working as a cap driver on behalf of local businessman Barry Evans (Shaun Williamson). He soon develops a close friendship with Phil's nemesis and Grant's antagonistic business partner Steve Owen (Martin Kemp), up to the point where the latter hires Beppe to work at his nightclub: the E20. Sometime later, Beppe establishes a business partnership with Steve and ends up managing the E20 on his behalf. His newfound job continues to build when drugs are found in the club at one stage, and Beppe's police contacts come in handy after he manages to persuade them to turn a blind eye."]}, {"page": "Cindy Williams (EastEnders)", "response": ["In 1995, Cindy Beale's chaotic relationship to husband Ian Beale had been struggling for some time. The marriage was already damaged by both partners' selfishness and Cindy's promiscuity, with Cindy growing tired of Ian, which led to the start of an affair with Ian's half-brother David Wicks (Michael French). However, Ian discovered their relationship and vowed to obtain custody of their children, Steven, Peter and Lucy. By October 1996, Cindy snapped and hired a hitman to kill Ian; when this proved unsuccessful she fled the country with the help of David and Barry Evans (Shaun Williamson), taking Steven and Peter to Italy."]}, {"page": "System Addict", "response": ["On the second season DVD of Ricky Gervais' Extras there is a hidden feature that shows Shaun Williamson and Steve Merchant performing an almost candid dance routine to \"System Addict\"."]}, {"page": "The Playhouse, Weston-super-Mare", "response": ["*2006 - Dick Whittington starring Jeremy Edwards, Anna Kumble and Shaun Williamson"]}, {"page": "Marlowe Theatre", "response": ["The Marlowe Theatre's pantomime is produced with Evolution Pantomimes, who produce number of pantomimes across the country. Past stars in The Marlowe Theatre pantomimes have included Natalie Imbruglia, Martine McCutcheon, Danniella Westbrook, Shelia Ferguson, Shaun Williamson, Daniel MacPherson, Robert Powell, Lewis Collins, Emma Barton, Adrian Edmonson, John Thompson, John Partridge, Toyah Willcox, Samantha Womack, Rita Simons and Gareth Gates."]}, {"page": "24 Hour Quiz", "response": ["24 Hour Quiz is a British game show that was broadcast on ITV between 16 February and 2 April 2004, presented by Shaun Williamson and Matt Brown and created by Richard Osman for Endemol UK."]}, {"page": "All Shook Up (musical)", "response": ["In 2015, a UK tour of the show commenced at Manchester Opera House in June 2015 with the show being retitled \"Love Me Tender\". The production starred Mica Paris as 'Sylvia', Sian Reeves as ‘Mayor Matilda Hyde’, Shaun Williamson as ‘Jim’ and Ben Lewis as ‘Chad'."]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Shaun Williamson and Coleen Nolan", "|Claire Richards (Steps) and Shaun Williamson"]}, {"page": "The Secret Policeman's Ball (2006)", "response": ["*Shaun Williamson"]}, {"page": "1965 in the United Kingdom", "response": ["*4 November – Shaun Williamson, actor"]}, {"page": "Kris Fisher", "response": ["Auditions were held for the part of Kris with actor Gerard McCarthy hailing from Belfast, Northern Ireland going onto secure the part. McCarthy had wanted a role in the show because actor Shaun Williamson had advised him to get a part to boost his profile. After initial screen tests with casting directors he was called in to meet Bryan Kirkwood who gave McCarthy the outline of the character and later he was contracted with the show long-term."]}, {"page": "EastEnders in popular culture", "response": ["Shaun Williamson frequently plays himself in Ricky Gervais's Extras, where he is referred to at all times as \"Barry from EastEnders\". Derek Martin (Charlie Slater) appeared in episode three in the third series of Little Britain in 2005. The sketch primarily focused around the character Marjorie Dawes telling her Fat Fighters group not to mention the fact that Martin is in EastEnders, then mentioning it herself. In the Comic Relief special of Little Britain, the character Dennis Waterman refers to his \"daughter - the one in EastEnders\". This is a reference to the real actor Dennis Waterman, who is the father of Hannah Waterman, who played Laura Beale in the show. In another ‘'Little Britain'’ scene, there are several pictures of Matthew Rose on a character's wall."]}, {"page": "Comic Relief Does Fame Academy", "response": ["| Shaun Williamson", "*Shaun Williamson (3rd)"]}, {"page": "Julian Dutton", "response": ["Recent television appearances include the Emmy Award-nominated My Life as a Popat for ITV, The Sarah Jane Adventures, a Doctor Who spin-off for CBBC produced by Russell T Davies, Nuzzle and Scratch, a children's comedy series, and Scoop with Shaun Williamson."]}, {"page": "Saturday Night Fever (musical)", "response": ["A London revival ran from 6 July 2004 to 16 February 2006 at the Apollo Victoria Theatre, prior to a lengthy UK tour. . The cast included Stephane Anelli as Tony and Zoe Ebsworth as Stephanie, with Kym Marsh as Annette and Shaun Williamson as DJ Monty."]}, {"page": "List of people from Kent", "response": ["*Shaun Williamson (born 1964) – TV presenter and actor in TV's Eastenders"]}]}}