{"wiki_id": "http://www.wikidata.org/entity/Q7492388", "itemLabel": "Sheena Porter", "itemDescription": "British children's writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheena_Porter", "wikipedia_page": {"main": "Sheena Porter (born 1935) is a British author of children's novels. She won the 1964 Carnegie Medal from the Library Association, recognising Nordy Bank as the year's best children's book by a British subject.Sheena Porter has worked as a librarian in Leicester, Nottingham and Shropshire, and currently lives in Ludlow.\nHer work is particularly notable for its atmosphere and characterization. It has a feeling for landscape, often portraying actual places, especially in the high country of the Welsh Marches, such as Nordy Bank, and the Long Mynd in The Knockers. She also weaves the history and folklore of the region into her narratives.", "link_mentions": [{"page": "Ludlow", "response": ["Dick Heckstall-Smith (1934–2004) from Ludlow was an English jazz and blues saxophonist. Sheena Porter (born 1935) a British author of children's novels, lives in Ludlow. The actor John Challis (1942-2021) who played Boycie in Only Fools & Horses lived near Ludlow, as did Pete Postlethwaite (1946–2011). The actress Holly Davidson (born 1980) (from Casualty and The Bill) grew up locally. Hollie Robertson (born 1985), winner of the BBC's Strictly Dance Fever in 2006 is from Ludlow. Impressionist Alistair McGowan (born 1964), now lives in Ludlow, where he is patron of the Ludlow Fringe Festival in which he has appeared performing live.Report by Rory Smith."]}, {"page": "1964 in literature", "response": ["*Carnegie Medal for children's literature: Sheena Porter, Nordy Bank"]}, {"page": "Long Mynd", "response": ["The Long Mynd features in literature in the poetry of A. E. Housman, the novels of Mary Webb (in particular Gone to Earth) and Malcolm Saville's Lone Pine series for children, and Sheena Porter's The Knockers (1965).Marcus Crouch, The Nesbit Tradition: The Children's Novel in England 1945–1970, Ernest Benn, 1972, pp. 155–56."]}, {"page": "Nordy Bank", "response": ["Nordy Bank is the location setting of Sheena Porter's novel Nordy Bank (1964).\"Nordy Bank by Sheena Porter\" . Literary Heritage: West Midlands. Shropshire Council. 14 September 2003."]}, {"page": "Nordy Bank (novel)", "response": ["Nordy Bank is a children's adventure novel by Sheena Porter, published by Oxford in 1964 with illustrations by Annette Macarthur-Onslow. Set in the hills of Shropshire, it features children whose camping holiday seems to engage the prehistoric past. Porter won the annual Carnegie Medal for excellence in British children's literature.", "The novel is set primarily in a precisely described location, Nordy Bank on Brown Clee Hill in Shropshire. The surrounding countryside, the Shropshire Hills, the village of Clee St. Margaret, and the market town of Ludlow also feature prominently.\"Nordy Bank by Sheena Porter\" . Literary Heritage: West Midlands. Shropshire Council. 14 September 2003. (As of 2007 Porter lives in Ludlow.)", "In The Nesbit Tradition, Marcus Crouch calls Nordy Bank Sheena Porter's finest book. He describes the camping scenes as beautifully done, conveying a sense of adventure and good companionship, but he regards the novel as primarily concerned with the development of personality. \"In Nordy Bank Sheena Porter shows how self-discovery can go hand-in-hand with the discovery of society. It is an effective lesson, the more so because the lesson is contained in an absorbing and dramatic story and the inner and outer themes are inseparable.\"Marcus Crouch, The Nesbit Tradition: The Children's Novel in England 1945–1970, Ernest Benn, 1972, p. 210."]}, {"page": "List of Jackanory episodes", "response": ["|1475|| Nordy Bank: Part 1 - A Camp on the Hill || Sheena Porter || Rosemary Leach || 05-Feb-73", "|1476|| Nordy Bank: Part 2 - Wolf! || Sheena Porter || Rosemary Leach || 06-Feb-73", "|1477|| Nordy Bank: Part 3 - Alone on the Hill || Sheena Porter || Rosemary Leach || 07-Feb-73", "|1478|| Nordy Bank: Part 4 - Out of the Question || Sheena Porter || Rosemary Leach || 08-Feb-73", "|1479|| Nordy Bank: Part 5 - If Anyone Can Do It.... || Sheena Porter || Rosemary Leach || 09-Feb-73"]}]}}