{"wiki_id": "http://www.wikidata.org/entity/Q7497691", "itemLabel": "Shinny Bayaar", "itemDescription": "boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Shinny_Bayaar", "wikipedia_page": {"main": "Shinebayar Sukhbaatar 'Shinny Bayaar' (born 27 August 1977) is a Mongolian professional boxer with British nationality fighting in the flyweight division. He is based in Oldham, Greater Manchester and is the former British Flyweight champion.", "link_mentions": [{"page": "List of British flyweight boxing champions", "response": ["|align=left | Shinny Bayaar"]}, {"page": "Martin Power", "response": ["Power made his professional debut in June 2001 with a victory over Sean Grant at the York Hall in Bethnal Green.  He compiled an unbeaten ledger of 19-0 with wins over the likes of Rocky Dean and Shinny Bayaar before getting a crack at the vacant British title in May 2005.  He won the title with a win over Dale Robinson at the Elephant & Castle center in Southwark to become British Bantamweight champion."]}, {"page": "Chris Edwards (boxer)", "response": ["Edwards fought once more for a title in January 2009, this time moving back down to flyweight to challenge once more for the still-vacant British and Commonwealth flyweight titles. The fight in Edwards' home town of Stoke against fellow challenger Wayne Bloy saw Edwards pick up both belts when Bloy retired hurt in the fourth round.BBC Sport | Edwards reigns again at Flyweight On 29 May 2009, Edwards made the first defence of his new title with a 12-round decision over a man he had defeated previously, Derby's Usman Ahmed.BBC Sport | Edwards too strong for Ahmed Edwards lost the title, fighting in Bolton to Shinny Bayaar, a Mongolian fighter who had recently gained British nationality, making him eligible to the fight for the belt.", "The loss against Bayaar had also meant the loss of Edwards' Commonwealth title, which, despite not being on the line, had to be given up following the defeat to another Commonwealth fighter. On 19 February 2010, he returned to Stoke-on-Trent to fight for the now-vacant belt, beating Namibian Abmerk Shindjuu in 12 rounds, winning 115-114 on each of the judges' scorecards.This is Staffordshire | Potteries boxer Edwards feeds off Fenton roar to lift Flyweight belt Edwards was victorious over Francis Croes in four rounds on 4 December 2010, and then regained the British title with a victory in a closely fought contest against Paul Edwards at the Olympia in Liverpool on 11 June 2011.BBC Sport | Chris Edwards reclaims British flyweight title  Edwards made a successful defence on 10 December 2011 over the man who had previously beaten him, Shinny Bayaar.BBC Sport | Theophane and Edwards retain titles", "|align=left| Shinny Bayaar ", "|align=left| Shinny Bayaar"]}, {"page": "List of Mongolians", "response": ["*Shinny Bayaar (b. 1977), boxer, British Flyweight champion."]}, {"page": "Ashley Sexton", "response": ["Following the Ahmed win, Sexton challenged reigning British flyweight champion Shinny Bayaar. Bayaar had won the title from Edwards. The fight on 14 May 2010 was a step up for Sexton as Bayaar was the more experienced boxer with a record of 15-4-1. After losing many of the initial rounds, Sexton began to dominate later on as Shinny Bayaar struggled with a cut injury. The fight, at the Goresbrook Leisure Centre in Dagenham, was scored a draw, although a number of observers felt that Bayaar might have done enough to win.  On 2 April 2011 Sexton returned to winning ways with a trip to Germany resulting in a victory against Salim Salimov and then on 30 April 2011 Sexton beat Mike Robinson at the Olympia in London over 8 rounds.  Sexton again traveled to Germany on 2 July 2011 to fight Mike Robinson in a rematch, with the fight on the undercard to David Haye's challenge to Wladimir Klitschko for the world heavyweight title.  The fight was close and this time the judges scored the contest a draw with Robinson, who said that he would like to fight Sexton again but this time for the English title.", "|style=\"background:#abcdef;\" |Draw||9-0-1||align=left| Shinny Bayaar"]}, {"page": "Paul Edwards (boxer)", "response": ["Edwards made his professional debut on 19 July 2008, winning a four-round points decision over Robert Palmer at the Olympia in Liverpool. He won his next 6 fights before facing Shinny Bayaar for the British flyweight title on 15 Dec 2010, at the Kings Hall, Belfast, Northern Ireland. Edwards won by first round technical knockout (TKO) after Bayaar suffered a cut above his left eye.", "|align=left| Shinny Bayaar"]}, {"page": "Shinny (disambiguation)", "response": ["*Shinny Bayaar (born 1977), Mongolian professional boxer"]}]}}