{"wiki_id": "http://www.wikidata.org/entity/Q7490850", "itemLabel": "Shaun Gale", "itemDescription": "footballer; football manager (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Shaun_Gale", "wikipedia_page": {"main": "Shaun Michael Gale (born Reading 8 October 1969) is an English former footballer and current manager of Gosport Borough.\n\n", "link_mentions": [{"page": "Gale (surname)", "response": ["* Shaun Gale (born 1969), English former footballer"]}, {"page": "Gosport Borough F.C.", "response": ["*First team manager: Shaun Gale"]}, {"page": "Ian Allinson", "response": ["During a game against Havant & Waterlooville in January 2011, the ball was put out of play so a Havant player could receive treatment, and upon passing the ball back to the Havant keeper, Boreham Wood player Mario Noto overhit his pass back to the goalkeeper and the ball hit the back of the net. Allinson signalled to his players to allow Havant to score a goal unchallenged. For this gesture, Allinson was hailed for his sportsmanship by Havant manager Shaun Gale."]}, {"page": "Havant & Waterlooville F.C.", "response": ["Baird resigned as manager on 1 October 2007 to become manager of Eastleigh and was replaced by Shaun Gale.Havant & Waterlooville.Net Club History (to July 2007)  Havant & Waterlooville FC In the 2007–08 FA Cup, the Hawks beat Bognor Regis, Fleet Town, Leighton Town, Conference Premier team York City and League Two club Notts County, before causing an even bigger upset by defeating League One side Swansea City 4–2 in a third round replay. In the fourth round, they played Premier League Liverpool at Anfield and caused a sensation by leading twice before eventually losing 5–2. Havant & Waterlooville player Alfie Potter, on loan at the time from Peterborough United, was voted 'Player of the Round'.", "The 2011–12 season was a poor one for Havant & Waterlooville, and after dropping to second from bottom in the league following a defeat at Basingstoke Town, Shaun Gale was sacked on 1 April. Assistant manager Steve Johnson and stadium manager/fitness coach Adrian Aymes were placed in charge on a caretaker basis. In a tense finale, the Hawks avoided relegation with literally the last kick by a Havant & Waterlooville player in the entire season; Joe Dolan's 93rd-minute winner in the final match against Staines Town ensuring that Maidenhead United (who believed themselves to be safe having scored a last-minute winner themselves) would fill the final relegation spot.", "In the 2018–19 season, Havant & Waterlooville struggled to adjust to life in the National League and were relegated with three matches remaining. On 22 April 2019, Havant & Waterlooville released a statement confirming Lee Bradbury had left by mutual consent. The next day, assistant manager Shaun Gale was appointed caretaker manager for their final two games of the season. On 29 April, it was announced that former Sutton United manager Paul Doswell had signed a three-year contract, bringing Ian Baird back to the club as his assistant.", "* Shaun Gale (Oct 2007 – Mar 2012)", "* Shaun Gale (Oct 2012 – Apr 2019)", "* Shaun Gale (Jan 2004 – Oct 2007)", "* Shaun Gale (Apr 2019)", "* Shaun Gale (Nov 2004)", "* Shaun Gale – 118 (106+12)"]}, {"page": "Alan Knight (footballer, born 1961)", "response": ["On 8 October 2007, Knight was appointed goalkeeping coach at Havant & Waterlooville by the team's newly appointed manager Shaun Gale, a former teammate of Knight at Portsmouth."]}]}}