{"wiki_id": "http://www.wikidata.org/entity/Q7493163", "itemLabel": "Sheila Walsh", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheila_Walsh_(author/singer)", "wikipedia_page": {"main": "Sheila Walsh (born 5 July 1956) is a Scottish-born American contemporary Christian vocalist, songwriter, evangelist, author, inspirational speaker, and talk-show host.", "link_mentions": [{"page": "1956", "response": ["** Sheila Walsh, Scottish Christian artist and talk-show hostess"]}, {"page": "The 700 Club", "response": ["The 700 Club has been in production since 1966.  It is hosted by Gordon Robertson, Terry Meeuwsen, Ashley Key and Wendy Griffith. Previous co-hosts include Pat Robertson (1966–2021), Ben Kinchlow (1975–88, 1992–96), Sheila Walsh (1987–92), Danuta Rylko Soderman (1983–88), Kristi Watts (1999–2013), and Lisa Ryan. Tim Robertson served as host for a year (1987–88) along with Kinchlow and actress Susan Howard, while Pat Robertson ran unsuccessfully for President in the 1988 campaign.", "*Sheila Walsh (1987–92)"]}, {"page": "Christian Broadcasting Network", "response": ["* Sheila Walsh - co-host of The 700 Club"]}, {"page": "Sparrow Records", "response": ["* Sheila Walsh"]}, {"page": "Barry Blue", "response": ["|I Hope And I Pray||Alvin Stardust & Sheila Walsh||1986||Brenner, Lippell, Moss||Barry Blue||(s) see title"]}, {"page": "Cliff Richard discography", "response": ["|\"Drifting\"with Sheila Walsh", "| style=\"text-align:left;\" rowspan=\"1\"| War of Love (UK edition titled 'Drifting')(Sheila Walsh album)", "|rowspan=\"2\"|1983||\"Drifting\"||Sheila Walsh||War of Love (titled Drifting in the UK)", "|rowspan=\"2\"|2020||\"It is Well\"||Sheila Walsh||Braveheart Worship"]}, {"page": "Joni Eareckson Tada", "response": ["* Honestly (1996) Sheila Walsh, Joni Eareckson Tada"]}, {"page": "List of Scottish Americans", "response": ["* Sheila Walsh, Christian singer"]}, {"page": "Turn! Turn! Turn!", "response": ["* Scottish singer Sheila Walsh recorded the song in 1983 for her album War of love. It was released that year as a single, produced by Cliff Richard and Craig Pruess."]}, {"page": "Mont Campbell", "response": ["*Sheila Walsh (author/singer) - Hope (Women of Faith, Integrity Music 14072, 1998)"]}, {"page": "Fire by Nite", "response": ["Jun-87\t#010 Sex, Dating, and Relationships (Sheila Walsh) (03-219)"]}, {"page": "London School of Theology", "response": ["* Sheila Walsh"]}, {"page": "Craig Pruess", "response": ["Craig Pruess (born 1950) is an American composer, musician, arranger and gold & platinum record producer who has been living in Britain since 1973. His career has covered diverse areas including: record production for international stars such as Anu Malik, Sir Cliff Richard, Sarah Brightman, Sheila Walsh (whose first album, \"War of Love\" was produced and arranged by Craig and was nominated for a Grammy Award in 1983); musical arrangements for Massive Attack, Def Leppard, Bond; feature film soundtrack music (Bride & Prejudice, Bend It Like Beckham, It's a Wonderful Afterlife, What's Cooking?, Bhaji on the Beach); world music producing, performing (sitar, keyboards and African percussion) and arranging for international acts such as Massive Attack, Katie Melua, Manic Street Preachers, Def Leppard and Pascal Obispo; television music (\"Peak Practice\", Sue Lawley Show, Rich Deceiver, ZigZag Kenya, Samson Superslug) and also arranging, sitar and sound design work (for such well known composers as Danny Elfman, Gabriel Yared, Patrick Doyle, Carl Davis, John Altman, Rachel Portman, and George Fenton); television and film advertising/corporate music (over 300 commercials to date); lecturing and teaching; concert performing (solo and with his own ensembles but also with Mike Oldfield for the world premiere of \"Tubular Bells II\", September 1992, at the Edinburgh Castle); sound engineering, synthesizer and computer music programming, sound design and music technology innovations.", "* Cliff Richard - albums: Now You See Me and Silver; singles: \"The Only Way Out\", \"Where Do We Go From Here\", \"Little Town\", \"Ocean Deep\", \"Drifting\" (with Sheila Walsh)", "* Sheila Walsh - albums: War of Love, Triumph in the Air, Don't Hide Your Heart, singles: \"Turn, Turn, Turn\", \"Drifting\" (with Cliff Richard)"]}, {"page": "Sheila Walsh Miller", "response": ["#REDIRECT Sheila Walsh (author/singer)"]}, {"page": "Sheila Walsh (singer)", "response": ["#REDIRECT Sheila Walsh (author/singer)"]}, {"page": "The Catch (British duo)", "response": ["Don Snow, now known as Jonn Savannah, is a multi-instrumentalist and has also played for many bands and artists including Lene Lovich, Procol Harum, Van Morrison, Tina Turner, the Vibrators, the Quick, Judie Tzuke, Tracey Ullman, Nik Kershaw, ABC, Sheila Walsh, Holly Johnson, Right Said Fred, Ray Charles, Gary Moore and Joe Cocker. Snow rejoined Squeeze on two temporary occasions in the 1990s."]}, {"page": "Music... The Air That I Breathe", "response": ["The duets included were recorded between 2009 and 2020 and feature artists including Albert Hammond, Sheila Walsh, the Bellamy Brothers, Bonnie Tyler, and the Piano Guys."]}, {"page": "Alvin Stardust discography", "response": ["| align=\"left\" |\"I Hope and I Pray\" (both tracks duets with Sheila Walsh)b/w \"Speak of Love\""]}]}}