{"wiki_id": "http://www.wikidata.org/entity/Q7490876", "itemLabel": "Shaun Harvey", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Shaun_Harvey", "wikipedia_page": {"main": "Shaun Antony Harvey (born 25 February 1970) is an English former football executive. Harvey was the chief executive of the English Football League having formerly been the CEO of Leeds United, as well as a club director. Prior to joining Leeds, Harvey was managing director at Bradford City. In June 2011, Harvey was elected to the Football League board of Directors and on 29 July 2013 became its Chief Executive. On 18 February 2019, he announced his resignation, effective at the end of the 2018-2019 season.", "link_mentions": [{"page": "Grasstrack", "response": ["| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Shaun Harvey/Danny Hogg", "| Nick Radley/Shaun Harvey"]}, {"page": "Leeds United Football Club Limited", "response": ["Leeds United Football Club Limited, founded 4 May 2007, is a limited company, the directors of which are Ken Bates, Shaun Harvey and Mark Taylor. The company purchased Leeds United A.F.C. via a creditors vote after the club entered administration, but this ownership was challenged by HM Revenue & Customs and the club was subsequently put up for sale by the administrators KPMG."]}, {"page": "2007–08 Leeds United F.C. season", "response": ["* 4 May: Leeds' relegation from the Championship is confirmed as chairman Ken Bates puts Leeds into administration. Hours later, alongside Mark Taylor and Shaun Harvey, Bates buys back the club under a newly formed company, Leeds United Football Club Limited, from administrators, KPMG. Ex-Leeds director Simon Morris reveals plans for a £10 million takeover of the club.", "* 27 September: The FA declined to recommend referral to an independent tribunal regarding Leeds' 15-point deduction. Chief Executive Shaun Harvey released a statement on the club's official web-site commenting \"We are amazed that the Football Association do not feel it is appropriate to intervene in a matter which we believe is fundamentally wrong, and sets a dangerous precedent for the future.\" He also stating that the club will be taking legal advice regarding the situation.", "* 23 April: Leeds decline to comment on claims they may have broken Football Association rules relating to their arbitration hearing against The Football League. It is believed that Leeds' Chief Executive, Shaun Harvey sent a letter outlining the argument which Leeds planned to present to the arbitration hearing."]}, {"page": "2011–12 Leeds United F.C. season", "response": ["*1 February: Simon Grayson is sacked as manager following the 4–1 home defeat to Birmingham City the previous day. In an official statement, the club's chief executive Shaun Harvey, stated that Leeds made the decision in the belief that \"a new managerial team will be able to get more out of the existing squad of players\" and ensure a play-off finish. Reserve team manager Neil Redfearn is appointed caretaker manager with immediate effect."]}, {"page": "Shawn Harvey", "response": ["*Shaun Harvey, businessman"]}, {"page": "David Baldwin (executive)", "response": ["He was appointed to the role of CEO of the English Football League in December 2019, replacing Shaun Harvey, and officially began on 17 June 2020. He previously held executive roles at Bradford City and Burnley. Whilst at Burnley, in December 2018 he was nominated for the Premier League CEO of the Year at the Football Business awards."]}]}}