{"wiki_id": "http://www.wikidata.org/entity/Q7490472", "itemLabel": "Sharron Kraus", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sharron_Kraus", "wikipedia_page": {"main": "Sharron Kraus is an English singer, songwriter and musician with strong ties to the US. Kraus was born in New York but grew up in Leicester, England. She has lived in Philadelphia and collaborated with American musicians, including Meg Baird, Helena Espvall, Christian Kiefer, Tara Burke (Fursaxa), and Gillian Chadwick (Ex Reverie) .\nKraus has been compared to 1970s English folk singers such as Shirley Collins and Anne Briggs and heralded as one of the strongest voices in English contemporary folk. She has recorded a collection of traditional folk songs, Leaves From Off the Tree, with Meg Baird and Helena Espvall of Philadelphia psych folk band Espers, but the majority of her work is self-authored, influenced by English and Appalachian folk song, but with its own distinctive voice. Musically Kraus' work is described as 'spine-tingling' 'spooky' and 'the sound of England and its enchanted gardens'.Kraus has toured Europe and the US with United Bible Studies, Meg Baird, James Blackshaw, Fursaxa, Thinguma*jigSaw and The Iditarod.\n\n", "link_mentions": [{"page": "Efnysien", "response": ["* 'A Hero's Death' on Friends and Enemies; Lovers and Strangers by singer-songwriter Sharron Kraus tells the story of Efnisien."]}, {"page": "Kraus", "response": ["* Sharron Kraus, English singer, songwriter, and musician"]}, {"page": "Terrastock", "response": ["Avarus, Bardo Pond, Black Forest/Black Sea, Bridget St. John, Brothers of the Occult Sisterhood, Charalambides, Cul de Sac, Damon and Naomi, Fursaxa, Ghost, Glenn Jones, The Green Pajamas, Kemialliset Ystävät, Kinski, The Kitchen Cynics, Sharron Kraus, Landing, Larkin Grimm, Lightning Bolt, The Magic Carpathians Project, Major Stars, Marissa Nadler, MV+EE with the Bummer Road, Paik, P.G. Six, Jack Rose, Salamander, St. Joan, Spacious Mind, Spires that in the Sunset Rise, Tanakh, Thought Forms, Urdog, Windy and Carl", "The Photographic, Parlour, Elephant Micah, Dead Maids, Hush Arbors, United Bible Studies, Sharron Kraus, Ignatz, Antietam, Black Forest/Black Sea, Sleeping Pill, Tanakh, Plastic Crimewave Sound, The Linus Pauling Quartet, Major Stars, Damon and Naomi, Helena Espvall, Oneida, Wooden Shjips, Tara Jane O'Neil, Kinski, MV+EE with the Golden Road, Bardo Pond, Grails, Motorpsycho, Sapat, Mono, Kohoutek, Sexfist, Rob Sharples, Thee American Revolution, Insect Factory, Simply Saucer, Pelt, Jack Rose and the Black Twig Pickers, The Entrance Band, Windy and Carl, Paik, Makoto Kawabata"]}, {"page": "Chanctonbury Ring", "response": ["The album Chanctonbury Rings by Justin Hopper, Sharron Kraus and Belbury Poly, released on Ghost Box Records in 2019, contains prose and poetry detailing the geography and legends relating to the rings and its environs."]}, {"page": "William Schaff", "response": ["* 2004 Sharron Kraus, Songs of Love and Loss"]}, {"page": "Ghost Box Records", "response": ["| Justin Hopper & Sharron Kraus with The Belbury Poly|| Chanctonbury Rings (2019) || CD/LP || GBX033", "| Sharron Kraus with Belbury Poly || Other Voices 10: Something Out of Nothing/Something Out of Nothing (Belbury Poly Mix) (2019) || Single || GBX720"]}, {"page": "Belbury Poly", "response": ["Jim Jupp has released EPs, singles and six albums on Ghost Box under the name of Belbury Poly. He is also a member of The Belbury Circle along with Jon Brooks (of The Advisory Circle) and occasional collaborator, John Foxx. In 2019 he co-wrote and produced the music and spoken word album Chanctonbury Rings with Justin Hopper and Sharron Kraus. He has recorded library tracks for KPM, BMG and Lo-Editions. He has remixed tracks for several artists including John Foxx and Bill Ryder-Jones (The Coral). The track \"The Willows\" taken from the first Belbury Poly album of the same name was reworked by Paul Weller as \"Earth Beat\" for his 2020 album On Sunset. The debut EP by Belbury Poly, Farmer’s Angle was included in an Electronic Sound magazine feature, A History of Electronic Music in 75 Records.", "| Sharron Kraus with Belbury Poly || Other Voices 10: Something out of Nothing || 7\"/DL || GBX720 || 2018", "| Chanctonbury Rings ||Justin Hopper, Sharron Kraus and Belbury Poly  || Ghost Box || GBX033 || 2019", "| Something Out of Nothing || Sharron Kraus || Other Voices 10 || Ghost Box || GBX720 || 2018"]}, {"page": "Durtro", "response": ["* Sharron Kraus"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Sharron Kraus (folk singer)"]}, {"page": "The Bramble Briar", "response": ["*Meg Baird, Helena Espvall & Sharron Kraus on their 2006 album Leaves From Off The Tree"]}, {"page": "Ex Reverie", "response": ["Gillian Chadwick has also performed with Jessica Weeks as Woodwose, and with Sharron Kraus as Rusalnaia, in addition to being a contributing member to the band Golden Ball which she co-founded with her ex-husband."]}, {"page": "Meg Baird", "response": ["*Meg Baird, Helena Espvall, Sharron Kraus, Leaves from Off the Tree CD/LP (2006) (Bo'Weavil)"]}, {"page": "Jim Jupp", "response": ["Since 2004 he has recorded six albums for Ghost Box with Belbury Poly,Belbury Poly and Ghost Box feature reviewThe GuardianBelbury Tales reviewBBC Music and one album as Eric Zann and also records with Jon Brooks as The Belbury Circle. He has collaborated on Ghost Box singles and EPs with John Foxx, Pye Corner Audio, Spacedog, The Advisory Circle and Moon Wiring Club,Ghost Box Catalogue , - from the Ghost Box website Jupp has remixed work by Pye Corner Audio, The Advisory Circle, Moon Wiring Club, Bill Ryder-Jones, John Foxx, Mirrors, Bernard Fevre, The Memory Band, Sharron Kraus. The track \"The Willows\" taken from the first Belbury Poly album of the same name was reworked by Paul Weller as \"Earth Beat\"https://hauntedgeneration.co.uk/2020/05/08/jim-jupp-intermission-and-ghost-box-records/ Interview with Jim Jupp by The Haunted Generation Blog for his 2020 album On Sunset. The debut EP by Belbury Poly, Farmer's Angle was included in an Electronic Sound magazine feature, A History of Electronic Music in 75 Records.https://electronicsound.co.uk/product/issue-65-print-edition/"]}, {"page": "Dear Companion", "response": ["Dear Companion is Espers vocalist Meg Baird's first solo album.  It was released in 2007 to critical praise.  The album contains three traditional folk songs, four covers of more recent songs, and two original songs written by Baird.  The album is lightly orchestrated traditional folk music, without Espers' psychedelic and prog influences, dense orchestration, and dark atmosphere.  Dear Companion was recorded at the same time as the Espers album II, at Baird's home in Philadelphia.Murphy, Matthew. Album Review: Dear Companion.  Pitchfork Media.  2007-04-30.  Two of the traditional songs (\"Willie o Winsbury\" and \"Barbry Ellen\") also appeared on Leaves From Off the Tree, an album by Baird, Espers bandmate Helena Espvall, and Sharron Kraus that came out the year before.  Two versions of the title song open and close the album, the second one a cappella."]}, {"page": "Camera Obscura (record label)", "response": ["Camera Obscura was a record label founded by Australian music journalist Tony Dale in 1996. Described by Dale as 'a conduit for the release of contemporary acid-folk, psych-pop and space-rock,' the label put out almost ninety releases over fourteen years, the vast majority of which were full-length CDs. Bands and musicians who released material on the label included the Green Pajamas, Patrick Porter, Abunai!, the Azusa Plane, Black Sun Ensemble, Sharron Kraus and Primordial Undermind. Dale formally discontinued the label in 2010, shortly before he died due to cancer.", "* Sharron Kraus"]}, {"page": "Helena Espvall", "response": ["Espvall subsequently entered Philadelphia's flourishing psychedelic and weird-folk circles.  She joined Espers shortly after they recorded their first album, was a member of The Valerie Project, and formed the duo Anahita with Tara Burke (a.k.a. Fursaxa).  In 2006 a trio consisting of Espvall, Espers bandmate Meg Baird, and English folk singer Sharron Kraus released an album of traditional folk songs under the title Leaves From Off The Tree.Leech, Jeanette. Seasons They Change: The Story of Acid and Psychedelic Folk. Jawbone Press, 2011.", "===With Sharron Kraus and Meg Baird==="]}, {"page": "Outdoor Miner", "response": ["\"Outdoor Miner\" has been covered by several artists. Notable versions include Lush in 1992, Flying Saucer Attack in 1994, The Lightning Seeds and Luna in 1996. In a unique move, a tribute album to the song was released in 2004 on the 25th anniversary of the song, A Houseguest's Wish: Translations of Wire's \"Outdoor Miner\" features 19 different interpretations of the song. As well as the Lush and Flying Saucer Attack covers, it features covers by Sharron Kraus, Boy Division and Adam Franklin amongst others."]}, {"page": "Will Z.", "response": ["After the release of his next album, New Start, with the first posthumous appearances of Daevid Allen and Carmeta Mansilla, lead singer of Can AM Des Puig, on an album, Will Z. performed in 2015 during concerts in Belgium and Germany with guests like Sharron Kraus and Alice Artaud. He wrote his last solo album in 2016, A New Mirrored You, inspired by La Vita Nuova, a text by Dante Alighieri."]}, {"page": "Folk Songs II", "response": ["#\"A Man Indeed\" (featuring Mary Hampton and Sharron Kraus)"]}, {"page": "Martin Arnold (composer)", "response": ["Arnold’s most recent large-scale commission was The Gay Goshawk (2019), written for the BBC Scottish Symphony Orchestra, alongside improvising soloists Angharad Davies and Sharron Kraus. It was premiered at the Tectonics festival in Glasgow and subsequently broadcast by BBC Radio 3."]}]}}