{"wiki_id": "http://www.wikidata.org/entity/Q7509256", "itemLabel": "Sidney Northcote", "itemDescription": "British actor and director (1884-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Northcote", "wikipedia_page": {"main": "Sidney Webber Northcote was an actor and film director.\nHe was born in Liverpool, Lancashire in 1884. He married Kathleen Kerr in Manchester in 1921 and they had 3 sons. He died in London 1952 at the age of 67. He was the director 14 silent films made between 1912 and 1914. He also appeared as an actor in 7 short films shot on location in Wales and Cornwall that he directed in 1912 for the British and Colonial Kinematograph Company. All of them were scripted by Harold Brett and featured Dorothy Foster in the starring role. None is known to have survived.\n1912\n\nThe Witch of the Welsh MountainsA wounded window recovers in time to save the \"wrong girl\" from being burned at the stake (1)The Smuggler's Daughter of Anglesea (sic)\nThe Belle of Bettwys-y Coed (sic)\nThe Pedlar of Penmaenmawr\nThe Fishergirl of Cornwall\nA Cornish Romance\nA Tragedy on the Cornish Coast\nThrough Death's Valley\nSaved by Fire1913\n\nAdventures of Pimple1914\n\nThe Troubles of an Heiress (Vera Northcote as 'The Kandy Kid')\nThe King of Crime\nDetective Daring and the Thames Coiners\nMary the Fishergirl1915\n\nThe Monkey's PawFrom a story by W.W. Jacobs, starring John Lawson as John White. White is shown a strange monkey's paw that will grant three wishes. He steals it from his friend, and learns that you must be careful what you wish for.1927\n\nIn July 1927, Northcote appeared as Amiens and as Jacques in a production of Shakespeare's 'As You Like It' in Cardiff, Wales.1932\n\nIn 1932 he produced what appears to have been his final film, 'Verdict of the Sea'.\"A ship's captain plans on delivering some gems to their rightful owner; a gang of malcontents plots to grab the diamonds for themselves. Thanks to the help of a former doctor, the plot is foiled.\" (2)", "link_mentions": {}}}