{"wiki_id": "http://www.wikidata.org/entity/Q7507744", "itemLabel": "Sid Binks", "itemDescription": "English footballer (1899-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sid_Binks", "wikipedia_page": {"main": "Sydney Binks (25 July 1899 – 4 February 1978) was a professional footballer who played for Bishop Auckland, Spennymoor United, Sheffield Wednesday, Huddersfield Town, Blackpool, Portsmouth, Southend United, Fulham, Chesterfield before returning to Sheffield Wednesday.", "link_mentions": [{"page": "List of Sheffield Wednesday F.C. seasons", "response": ["|Sid Binks", "|Sid Binks"]}, {"page": "Binks", "response": ["* Sid Binks, professional footballer"]}, {"page": "Teddy Davison", "response": ["Davison was appointed Chesterfield manager on 2 January 1928 at a wage of £6 a week. He immediately reorganised the club making clear divisions between the administrative and playing sides and bringing in experienced players such as Sid Binks. An improvement in results followed culminating in winning the Third Division North championship in 1930–31 with the team securing the championship on the last day of the season, scoring eight goals against Gateshead, Davison's home town club. Davison consolidated Chesterfield's position in Division Two the following season continuing to bring in experienced players such as ex England international George Ashmore, he also established a scouting network in his native north east to bring in young players. Davison had become one of the most talented and well organised managers around and it was no surprise when he was offered the newly created position of secretary/manager at Sheffield United in June 1932 as a replacement for the legendary John Nicholson who had been killed in a traffic accident earlier in the year after being Blades secretary for 33 years.Official Chesterfield F.C. site. Gives details of time as manager of Chesterfield."]}, {"page": "1925–26 Huddersfield Town A.F.C. season", "response": ["|Sid Binks||||FW||2||1||0||0||2||1"]}, {"page": "1924–25 Huddersfield Town A.F.C. season", "response": ["|Sid Binks||||FW||2||0||0||0||2||0"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Sid Binks||||1924–1925||4||1||0||0||0||0||0||0||0||0||4||1"]}, {"page": "Charlie Petrie", "response": ["At Wednesday, he made his debut in a 2–0 defeat at Nottingham Forest on 11 February 1922, replacing Johnny McIntyre who had left for Blackburn Rovers. Petrie retained his place for the remainder of the season, but in October 1922 was in turn replaced by the newly signed Andy Smailes. After Smailes moved on to Bristol City early in the 1923–24 season, Petrie was recalled to the first team. Petrie linked up well with Sid Binks at centre-forward and Sammy Taylor at inside-right, scoring 44 goals between them, of which Petrie contributed 16.Sheffield Wednesday: Season 1923–24 Although Petrie started the next season, he soon lost out to Arthur Prince, making only three appearances."]}]}}