{"wiki_id": "http://www.wikidata.org/entity/Q7507932", "itemLabel": "Sid Tickridge", "itemDescription": "English footballer (1923-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sid_Tickridge", "wikipedia_page": {"main": "Sid Tickridge (10 April 1923 in Stepney – 6 January 1997 in Canterbury) was a professional footballer who played for Tottenham Hotspur, Chelsea, Brentford and represented England at schoolboy level.", "link_mentions": [{"page": "April 10", "response": ["*  1923   – Sid Tickridge, English footballer (d. 1997)"]}, {"page": "Johnny McNichol", "response": ["On his Chelsea debut away at Manchester United, McNichol found himself playing at right back after ten minutes when Sid Tickridge sustained an injury. Once restored to the forward line, his goals helped Chelsea avoid relegation to the Second Division at the end of his first season. A \"dramatic last-minute goal ... enabled Chelsea to snatch a lucky victory at West Bromwich\" with three games left, and he scored the third goal of Chelsea's 3–1 defeat of Manchester City in their last fixture of the season which confirmed their escape from the relegation positions."]}, {"page": "West London derby", "response": ["* Sid Tickridge – first Chelsea, then Brentford."]}, {"page": "1955–56 Brentford F.C. season", "response": ["After finishing the previous season strongly, Brentford went into the 1955–56 Third Division South season full of optimism. Youth products Jim Towers and Dennis Heath had established themselves in the first team, while George Francis and Gerry Cakebread also made their debuts. Full backs Alan Bassham, George Lowden and half backs Wally Bragg and George Bristow also made up the ranks of home-grown players in the first team squad and forward John Pearson would be another to graduate from the youth team during the 1955–56 season. Chelsea full back Sid Tickridge was manager Bill Dodgin Sr.'s only major signing of the off-season and he replaced Frank Latimer as club captain.", "|Sid Tickridge (c)", "| style=\"text-align:left;\" |Sid Tickridge", "| Sid Tickridge"]}, {"page": "1956–57 Brentford F.C. season", "response": ["|Sid Tickridge (c)", "| style=\"text-align:left;\" |Sid Tickridge", "| Sid Tickridge"]}, {"page": "1957–58 Brentford F.C. season", "response": ["After the departure of Bill Dodgin Sr, Brentford recruited Kilmarnock manager Malky MacDonald for their vacant managerial position in May 1957. MacDonald was no stranger to Griffin Park, having spent just under three years as a player-coach with the Bees between 1946 and 1949. First on MacDonald's list of priorities was to ensure that Brentford finished in the top half of the Third Division South table, to avoid becoming founder members of the new Fourth Division in the following season. Ageing and injury-ravaged players Sid Tickridge, Wally Bragg and Frank Dudley were released, while Jeff Taylor, the club's second-leading scorer in each of the previous two seasons, elected to retire and pursue a career in opera. MacDonald recruited former Brentford player Fred Monk as trainer and made just one signing of note, full back Tom Wilson from Fulham, whom he named captain. Ken Horne, Ian Dargie and Johnny Rainford (three players who had seen their playing time reduced under previous manager Dodgin) would be regulars again under MacDonald during the season."]}]}}