{"wiki_id": "http://www.wikidata.org/entity/Q750204", "itemLabel": "Kwasi Kwarteng", "itemDescription": "British politician (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kwasi_Kwarteng", "wikipedia_page": {"main": "Kwasi Alfred Addo Kwarteng (born 26 May 1975) is a British Conservative Party politician serving as Secretary of State for Business, Energy and Industrial Strategy since 2021. He has been the Member of Parliament (MP) for Spelthorne since 2010.\nOn 16 November 2018, Kwarteng was appointed Under-Secretary of State at the \nDepartment for Exiting the European Union (DExEU), following the resignation of Suella Braverman. Following the election of Boris Johnson as Prime Minister in July 2019, Kwarteng was promoted to Minister of State for Business, Energy and Clean Growth, attending Cabinet as part of the role.", "link_mentions": [{"page": "Cabinet of the United Kingdom", "response": ["| scope=\"row\" style=\"text-align:center\" |The Right HonourableKwasi KwartengMP for Spelthorne(born 1975)"]}, {"page": "University Challenge", "response": ["*Kwasi Kwarteng – Trinity College, Cambridge, 1995"]}, {"page": "Departments of the Government of the United Kingdom", "response": ["| The Rt Hon Kwasi Kwarteng MPSecretary of State for Business, Energy and Industrial Strategy"]}, {"page": "Lord Randolph Churchill", "response": ["However, Churchill's most well-known act during his time at the India Office was his role in the invasion and annexation of Burma in the Third Anglo-Burmese War.Kwasi Kwarteng, Ghosts of Empire: Britain's Legacies in the Modern World, Bloomsbury, 2011, Part III Siding with British commercial (especially cotton) and military interests, and hoping to boost Conservative fortunes in the upcoming general election, Churchill directed the Viceroy, Lord Dufferin, to invade Upper Burma in November 1885.Foster, Randolph Churchill, pp. 206-213 With little discussion, Churchill then decided to annex the Burmese kingdom, adding it as a new province of the Indian Raj as a \"New Year present\" for Queen Victoria on New Year's Day 1886. Not only is the war itself widely regarded as a piece of blatant imperialism, but the continuing guerrilla war lasted into the later 1880s and cost the Indian taxpayer ten times Churchill's original financial estimates.Foster, Randolph Churchill, p. 209"]}, {"page": "List of Ghanaians", "response": ["*Kwasi Kwarteng, British Conservative Party politician"]}, {"page": "Order of precedence in England and Wales", "response": ["| The Rt. Hon. Kwasi Kwarteng, MP"]}, {"page": "Order of precedence in Northern Ireland", "response": ["#* The Secretary of State for Business, Energy and Industrial Strategy (Kwasi Kwarteng MP)"]}, {"page": "List of current members of the British Privy Council", "response": ["| Kwasi Kwarteng"]}, {"page": "List of United Kingdom MPs: K", "response": ["* Kwasi Kwarteng (2010–present)"]}, {"page": "Parliamentary Private Secretary", "response": ["|Rt Hon. Kwasi Kwarteng MP"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Kwasi Kwarteng (b. 1975)"]}, {"page": "Ashford, Surrey", "response": ["Ashford is part of the Spelthorne parliamentary constituency which has been represented by the Conservative Kwasi Kwarteng since 2010."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Kwasi Kwarteng (born 1975), Conservative MP and historian"]}, {"page": "Bow Group", "response": ["| Kwasi Kwarteng ", "In April 2012, at a Bow Group debate with David Starkey, Shami Chakrabarti and Kwasi Kwarteng, Starkey described Scottish First Minister Alex Salmond as a \"Caledonian Hitler\"."]}, {"page": "Spelthorne (UK Parliament constituency)", "response": ["Spelthorne is a constituency represented in the House of Commons of the UK Parliament since 2010 by Kwasi Kwarteng, a Conservative.", "During the 2016 referendum on the UK's EU membership, the majority of voters in the area voted in favour of exiting the European Union. This was the preferred outcome of Spelthorne MP Kwasi Kwarteng.", "The constituency's first MP was Philip Pilditch, an architect who piloted the Ancient Monuments Act 1931 through Parliament: see Scheduled Monument.  The MP for Spelthorne since 2010 is the author, columnist and historian Kwasi Kwarteng.", "|Kwasi Kwarteng || Conservative"]}, {"page": "Green Alliance", "response": ["Green Alliance hosts a blog and a podcast giving voice to organisations, opinion formers, experts and commentators on environmental issues. It holds regular events, including hosting major speeches by senior ministers and political leaders, such as Tony Blair, Caroline Lucas, David Cameron, Al Gore, Nicola Sturgeon, Alok Sharma and Kwasi Kwarteng."]}]}}