{"wiki_id": "http://www.wikidata.org/entity/Q750104", "itemLabel": "Mark Lazarowicz", "itemDescription": "British politician (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Lazarowicz", "wikipedia_page": {"main": "Mark Lazarowicz ( lə-ZUURR-ə-vitch; born Marek Lazarowicz; 8 August 1953) is a British Labour Co-operative politician and lawyer who was the Member of Parliament (MP) for Edinburgh North and Leith from 2001 to 2015.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Mark Lazarowicz"]}, {"page": "Alan Whitehead", "response": ["Whitehead's Private Members Bill, was 'talked out' by Conservative backbenchers in 2005, but many of the Bill's most important aspects were incorporated into the Climate Change and Sustainable Energy Act 2006, sponsored by Mark Lazarowicz MP."]}, {"page": "People & Planet", "response": ["*Former members include Mark Lazarowicz, MP; Catherine Stihler, MEP (alumna and 52nd Rector at the University of St Andrews); and Mark Ballard, former MSP and Rector (at the University of Edinburgh) where the People & Planet group was instrumental in his election in 2006, against a field including Magnus Linklater, Boris Johnson and John Pilger."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Edinburgh North and Leith || Mark Lazarowicz || Labour/Co-operative || (boundary changes) || Labour"]}, {"page": "Edinburgh North and Leith (UK Parliament constituency)", "response": ["|| 2001 || Mark Lazarowicz || Labour Co-op"]}, {"page": "Clause Four Group", "response": ["People who were involved in Clause Four include Labour MPs Fraser Kemp, Mike Gapes, Alan Whitehead, John Mann, John Denham, Mark Lazarowicz and Margaret Curran, and MSPs Johann Lamont and Sarah Boyack."]}, {"page": "Alex Wood (politician)", "response": ["Members of the Labour group of councillors felt however that his politics were further left than theirs and in May 1986 voted they had no confidence in his leadership. He was replaced as council leader with Mark Lazarowicz.DINWOODIE, Robbie, \"Labour at War Over the Wood 'Ambush'\", The Scotsman (16 June 1986)MEEK, Brian, \"Battling It Out In the Red Corner\", Glasgow Herald (26 June 1986)"]}, {"page": "List of United Kingdom MPs: L", "response": ["*Mark Lazarowicz"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Mark Lazarowicz, Edinburgh North and Leith, 2001–2015"]}, {"page": "List of Labour Co-operative MPs", "response": ["* Mark Lazarowicz, Edinburgh North and Leith, 2001–2015"]}, {"page": "Climate Change and Sustainable Energy Act 2006", "response": ["The Act was piloted through the House of Commons as a Private Member's Bill by Mark Lazarowicz, MP."]}, {"page": "Marek Lazarowicz", "response": ["#REDIRECT Mark Lazarowicz"]}, {"page": "Poles in the United Kingdom", "response": ["*Mark Lazarowicz – Labour and Co-operative MP for Edinburgh North and Leith, whose father was Polish"]}, {"page": "List of MPs for constituencies in Scotland (2005–2010)", "response": ["|Mark Lazarowicz"]}, {"page": "Full fiscal autonomy for Scotland", "response": ["The 2011 Scottish Social Attitudes Survey core finding was that while 32% of respondents supported Scottish independence, 43% supported greater autonomy within the UK. 29% of respondents supported devo-max, but only 21% supported the status quo.The election of a majority Scottish National Party government in May 2011, committed to holding an independence referendum, also brought the possibility that FFA could be an extra option in the vote.Scotland independence vote could contain 'financial autonomy' option www.guardian.co.uk, 8 May 2011 Some senior Scottish Labour Party figures have also suggested that they would support devo max, including Malcolm Chisholm MSP,Malcolm Chisholm: Labour must support Devo-Max and abandon Calman  newsnetscotland.com, accessed 23 October 2011 Mark Lazarowicz MP,Salmond gives backing to ‘devo max’ ballot choice www.scotsman.com, 23 October 2011 and former First Minister Henry McLeish."]}, {"page": "2008 Scottish Labour leadership election", "response": ["| Mark Lazarowicz MP || ||"]}, {"page": "2009 Speaker of the British House of Commons election", "response": ["*Sir Alan Beith – Alan Whitehead (Lab), Denis Murphy (Lab), Mark Lazarowicz (Lab), Martin Linton (Lab), Fiona McTaggart (Lab), Elfyn Llwyd (Plaid), Vince Cable (LD), Jenny Willott (LD), Michael Moore (LD), Annette Brooke (LD), Chris Huhne (LD), Phil Willis (LD), Roger Williams (LD), Greg Mulholland (LD), Steve Webb (LD)."]}, {"page": "2014 Scottish independence referendum", "response": ["| style=\"text-align:center;\"|Mark Lazarowicz"]}, {"page": "Mike Crockart", "response": ["In 2005 he stood for the Westminster constituency of Edinburgh North and Leith, coming second to Labour's Mark Lazarowicz and securing a swing of 8.3 per cent from Labour to Lib Dem. In November 2005 he again sought election to the city council, standing in another by-election in Murrayfield, and again came second. In the 2007 Scottish Parliament elections in the smaller Scottish constituency of Edinburgh North and Leith, and again secured a large swing from Labour but still finished in second place."]}, {"page": "List of MPs elected in the 2010 United Kingdom general election", "response": ["| Edinburgh North and Leith||style=\"background-color: \"| ||Labour ||style=\"background-color: \"| ||Mark Lazarowicz (L)||Seat held"]}, {"page": "List of MPs for constituencies in Scotland (2010–2015)", "response": ["|Mark Lazarowicz"]}, {"page": "2010 Labour Party leadership election (UK)", "response": ["*Ed Miliband (63): Adrian Bailey, Margaret Beckett, Anne Begg, Hilary Benn, Luciana Berger, Roberta Blackman-Woods, Paul Blomfield, Karen Buck, Margaret Curran, Wayne David, Geraint Davies, John Denham, Frank Dobson, Jack Dromey, Maria Eagle, Clive Efford, Natascha Engel, Bill Esterson, Frank Field, Hywel Francis, Helen Goodman, Tom Greatrex, Lilian Greenwood, Peter Hain, David Hamilton, Jimmy Hood, Graham Jones, Susan Jones, Sadiq Khan, Ian Lavery, Mark Lazarowicz, Andy Love, Ian Lucas, Shabana Mahmood, John Mann, Gordon Marsden, Jim McGovern, Ann McKechin, Catherine McKinnell, Michael Meacher, Alan Meale, Madeleine Moon, Grahame Morris, Paul Murphy, Lisa Nandy, Sandra Osborne, Albert Owen, Stephen Pound, Rachel Reeves, Emma Reynolds, Lindsay Roy, Joan Ruddock, Alison Seabeck, Jim Sheridan, Andy Slaughter, Owen Smith, Emily Thornberry, Stephen Timms, Chuka Umunna, Alan Whitehead, Christopher Williamson, Rosie Winterton", "| Mark Lazarowicz || Ed Miliband || None || None || None || None"]}, {"page": "Theresa McDermott", "response": ["During 2005-06 she was detained by Israeli authorities while trying to attend a conference in the West Bank on non-violent resistance. Her MP, Mark Lazarowicz, raised this issue in Parliament."]}, {"page": "Second Ivorian Civil War", "response": ["According to UK shadow international development minister Mark Lazarowicz, the UN aid programmes for Ivory Cost and Liberia are \"grossly underfunded\"."]}, {"page": "2011 Scottish Labour leadership election", "response": ["Parliamentary nominations - MSPs: Claire Baker, Neil Bibby, Kezia Dugdale, Mary Fee, Mark Griffin, Ken Macintosh, Margaret McCulloch, Margaret McDougall, Jenny Marra, Michael McMahon, John Park, Graeme Pearson, Richard Simpson. MPs: Willie Bain, Gordon Banks, Alistair Darling, Russell Brown, Thomas Docherty, Brian Donohoe, Frank Doran, Gemma Doyle, Mark Lazarowicz, Anne McGuire, Jim Murphy, Frank Roy. MEPs: Catherine Stihler.", "Parliamentary nominations - MSPs: Jackie Baillie, Claire Baker, Claudia Beamish, Neil Bibby, Kezia Dugdale, Patricia Ferguson, Mark Griffin, James Kelly, Hanzala Malik, Jenny Marra, Paul Martin, Michael McMahon, Siobhan McMahon, Duncan McNeil, Anne McTaggart, John Park, Graeme Pearson, John Pentland, Drew Smith. MPs: Douglas Alexander, Willie Bain, Gordon Banks, Russell Brown, Tom Clarke, Alistair Darling, Thomas Docherty, Gemma Doyle, Sheila Gilmore, Tom Greatrex, Jim Hood, Cathy Jamieson, Eric Joyce, Mark Lazarowicz, Michael McCann, Gregg McClymont, Anne McGuire, Iain McKenzie, Jim Murphy, Ian Murray, Pamela Nash, Fiona O'Donnell, Frank Roy, Anas Sarwar. MEPs: Catherine Stihler."]}, {"page": "Private Members' Bills in the Parliament of the United Kingdom", "response": ["|Ballot 6||Employee Share Schemes ||Mark Lazarowicz||Labour (Co-op)||Edinburgh North and Leith", "|Ballot 4||Climate Change and Sustainable Energy Act 2006||Mark Lazarowicz||Labour (Co-op)||Edinburgh North and Leith"]}]}}