{"wiki_id": "http://www.wikidata.org/entity/Q750398", "itemLabel": "Marcus Jones", "itemDescription": "British politician (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcus_Jones_(politician)", "wikipedia_page": {"main": "Marcus Charles Jones (born 5 April 1974) is a Conservative Party politician in the UK who has been the Member of Parliament (MP) for Nuneaton since 2010. Previously he had been Leader of Nuneaton and Bedworth Borough Council.", "link_mentions": [{"page": "Order of precedence in England and Wales", "response": ["| Marcus Jones, MP"]}, {"page": "Order of precedence in Northern Ireland", "response": ["#Comptroller of the Household (Marcus Jones MP)"]}, {"page": "Bill Olner", "response": ["Olner declared his retirement as MP for Nuneaton on 25 March 2007; he served until the 2010 general election where Labour's new candidate, Jayne Innes, was defeated by Conservative Marcus Jones."]}, {"page": "Comptroller of the Household", "response": ["In modern times, the Comptroller has become a less prominent position in British politics. The holder is one of the Government whips in the House of Commons, and their responsibilities for the Royal Household are now largely ceremonial. The role has been occupied by Marcus Jones since 17 September 2021.", "*2021–Present: Marcus Jones"]}, {"page": "Nuneaton (UK Parliament constituency)", "response": ["Nuneaton is a constituency represented in the House of Commons of the UK Parliament since 2010 by Marcus Jones, a Conservative. Since 1997, the seat has been seen as an important national bellwether.", "Labour regained the constituency at the 1992 election. Bill Olner beat Stevens and retained the seat in 1997, 2001 and 2005. Olner announced in 2007 that he would not be contesting the 2010 general election and would be standing down at the end of the 2005–2010 parliament.Coventry Telegraph 27 March 2007 Accessed 26 November 2007 Former Nuneaton and Bedworth Council Leader Marcus Jones was successful in taking the seat for the Conservative Party at the 2010 election and retained the seat in 2015, 2017 and 2019.", "| Marcus Jones"]}, {"page": "Vice-Chamberlain of the Household", "response": ["| Marcus Jones || 2020 || 2021 || Became Comptroller of the Household ||"]}]}}