{"wiki_id": "http://www.wikidata.org/entity/Q7518383", "itemLabel": "Simon Burney", "itemDescription": "English racing cyclist and cycling team manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Burney", "wikipedia_page": {"main": "Simon Burney spent three years racing the professional cyclo-cross circuit before an injury forced him into team management.  For over twenty years, Burney managed cyclo-cross and mountain bike teams, before joining the Union Cycliste Internationale (UCI) as first a technical delegate, then as Mountain Bike Coordinator. He recently accepted a position as Off Road Manager for the UCI.\nAs a manager and the creator of the Ace Racing Team along with professional mountain bike teams throughout the 1990s, Simon was privileged to work with the finest 'cross riders of that generation: world champions Dominique Arnould and Henrik Djernis, plus Beat Wabel, and Peter Van Den Abeele, among others. Simon served as manager of the Great Britain mountain bike team in the 2000 and 2004 Olympic Games. In the 2002 and 2006 Commonwealth Games, he was manager of the English team. From 2000 to 2007, Simon worked for British Cycling as the performance manager of their mountain bike and cyclo-cross teams, and continued to manage the national team at the world championships until 2009. \nThe 2019 World Championships at Bogense, Denmark was Simon's thirty seventh consecutive year at Worlds as either a rider, mechanic, team manager, TV commentator, sport coordinator or spectator, and he vows to keep going until an English speaker (preferably a Brit!) wins an elite race.\nHe has written a popular book which is on its 3rd Edition named Cyclocross: Training and Technique, and has organized several World Cup Cross races.", "link_mentions": [{"page": "Ace Racing Team", "response": ["#REDIRECT Simon Burney"]}, {"page": "Ace RT", "response": ["#REDIRECT Simon Burney"]}, {"page": "Ace RT Peugeot Cycles", "response": ["#REDIRECT Simon Burney"]}, {"page": "Peugeot-Ritchey", "response": ["#REDIRECT Simon Burney"]}, {"page": "Peugeot-Look", "response": ["#REDIRECT Simon Burney"]}, {"page": "Peugeot - Ritchey", "response": ["#REDIRECT Simon Burney"]}, {"page": "Peugeot - Look", "response": ["#REDIRECT Simon Burney"]}, {"page": "BWM ProFlex UK International Mountain Bike Team", "response": ["#REDIRECT Simon Burney"]}, {"page": "BWM ProFlex International Mountain Bike Team", "response": ["#REDIRECT Simon Burney"]}]}}