{"wiki_id": "http://www.wikidata.org/entity/Q7519512", "itemLabel": "Simon Pepper", "itemDescription": "Scottish environmentalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Pepper", "wikipedia_page": {"main": "Simon Pepper  (1947 – 18 September 2018) was Director of the World Wildlife Fund (Scotland) from 1985 to 2005. He was also Lord Rector of the University of St Andrews between 2005 and 2008, having been inaugurated on 10 March, and was succeeded by Kevin Dunion.Pepper was a board member of the Deer and Forestry Commissions in Scotland, as well as acting as an advisor to Scottish Ministers on Sustainable Development as a member of the Cabinet Sub-Committee on Sustainable Scotland.He was awarded the OBE in the Millennium Honours List for his services to Sustainable Development, having served as a member of the Secretary of State's Advisory Group on Sustainable Development from 1994 to 1998.\nBefore joining WWF, Simon Pepper ran his own business in Scotland, providing holiday courses about cultural and natural heritage.  In 1971 he worked for one year as United Nations Volunteer for the Food and Agriculture Organization in Chad.In 2011, Simon Pepper was appointed a member of the Heritage Lottery Fund's Committee for Scotland.\nSimon Pepper died suddenly on 18 September 2018.", "link_mentions": [{"page": "Gordon Ramsay", "response": ["In July 2006, Ramsay won the Catey award for \"Independent Restaurateur of the Year\", becoming only the third person to have won three Catey awards. Ramsay's two previous Catey awards were in 1995 (Newcomer of the Year) and 2000 (Chef of the Year). The other two triple-winners are Michel Roux and Jacquie Pern. In September 2006, he was named as the most influential person in the UK hospitality industry in the annual Caterersearch 100 list, published by Caterer and Hotelkeeper magazine. He overtook Jamie Oliver, who had been top of the list in 2005. Also in 2006, Ramsay was nominated as a candidate for Rector of the University of St Andrews, but lost at the polls to Simon Pepper."]}, {"page": "Rector of the University of St Andrews", "response": ["|Simon Pepper"]}, {"page": "Royal Scottish Geographical Society", "response": ["* Simon Pepper (2015)"]}]}}