{"wiki_id": "http://www.wikidata.org/entity/Q7519230", "itemLabel": "Simon Lowe", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Lowe", "wikipedia_page": {"main": "Simon Lowe (born 30 October 1973) is a British actor who, among other titles, has played series regulars in Bodies (Dr. Tim Sibley), and The Grimleys (Shane Titley), both of which were written by Jed Mercurio. He also played Derek Evans in EastEnders.\nHe also played the regular character, Sgt. James Collins in the British series, Doctors. As a teenager at the end of the 1980s, he had a regular role in the Central Independent Television soap opera Crossroads, playing Jason Grice. In 2007, he portrayed the survivor of the Hindenburg disaster, Joseph Spah, in the drama from Channel 4, Hindenburg: The Untold Story, directed by Sean Grundy.\nIn 2010, in Channel 4's Bloody Foreigners, he played the role of Jan Zumbach, of 303 squadron. In 2011, he made a single appearance in HBO's Game of Thrones as a wine merchant, and he has portrayed Mr. Bell in the 4 O'Clock Club from 2013 to 2020. He also played Sir Cumference in the \"A Knight's Tail\" section of Hacker Time.\nTheatre work includes the portrayal of Dudley Moore in the show, Pete and Dud: Come Again that successfully toured United Kingdom in 2007, alongside actor Gareth Tunley playing Peter Cook. In 2013, Lowe appeared as the monk in Bryan Singer's Jack the Giant Slayer, as Dr. Quentin in the adaptation of The Big Four, for the final series of Agatha Christie's Poirot, and as a snobbish maître d' in an episode of Downton Abbey.", "link_mentions": [{"page": "Bodies (TV series)", "response": ["* Simon Lowe as Dr. Tim Sibley"]}, {"page": "List of fictional doctors", "response": ["|Bodies || Dr. Maya DuttaDr. Polly GreyDr. Roger HurleyDr. Rob LakeDr. Maria OrtonDr. Tim SibleyDr. Tony Whitman || Preeya KalidasTamzin MallesonPatrick BaladiMax BeesleySusan LynchSimon LoweKeith Allen"]}, {"page": "The Big Four (novel)", "response": ["The novel was adapted for television with David Suchet as Poirot, as part of the final series of Agatha Christie's Poirot. The film premiered on ITV on 23 October 2013 and on PBS on 27 July 2014 in the United States; it also guest-starred Sarah Parish, Patricia Hodge, Tom Brooke, Nicholas Burns, and Simon Lowe. Suchet's former co-stars Hugh Fraser, Philip Jackson, and Pauline Moran reprised their roles as Hastings, Japp, and Miss Lemon (who was added to the proceedings despite not appearing in the novel) after an approximately ten-year absence from the show itself. The episode explains their absence by implying that Hastings has been living on his Argentinian ranch, and Miss Lemon enjoying a quiet life on her own after leaving Poirot's employ. Japp has been promoted to Assistant Commissioner of the Met, and in the episode he assumes the role of Poirot's sidekick, whereas it was Hastings who filled the position in the novel. The guest cast includes Nick Day as Ingles, James Carroll Jordan as Ryland, Patricia Hodge as Madame Olivier, Steven Pacey as Paynter and Sarah Parish as Flossie."]}, {"page": "List of former EastEnders characters", "response": ["| Derek Evans || Simon Lowe || 2007–2010, 2015–2016"]}, {"page": "The Grimleys", "response": ["Other domestic characters are their older sister Lisa Grimley (Corrieann Fletcher) and their Nan (Barbara Keogh), who seems to be obsessed with the \"Grimley curse\". The Grimleys' next-door neighbours are the Titleys, consisting of Geraldine, plumber uncle Reg (Paul Angelis) and his son Shane (Simon Lowe), a Bay City Roller lookalike and self-styled ladies' man with a clapped-out Vauxhall Viva car.", "*Simon Lowe as Shane Titley (series 1 and 2)"]}, {"page": "Lisa Fowler", "response": ["Several years later, Jack Branning (Scott Maslen), a former policeman, tells Phil that Lisa and Louise are living in South East London. After seeing Louise call another man \"daddy\", Phil decides that she is better off with Lisa. Two years later, Louise arrives alone in Walford, saying that Lisa has gone on holiday but not returned. Louise is taken into care but when Phil discovers this, he has a DNA test to prove Louise is his daughter and gains custody of her. Later that year, Phil is visited by a social worker, Derek Evans (Simon Lowe), who says that Lisa has made an application to see Louise. Phil does not want Lisa to have contact with Louise, but Phil's mother Peggy Mitchell (Barbara Windsor) takes her to see Lisa on Louise's request. Peggy slaps Lisa for abandoning her daughter, and Lisa reveals she had a breakdown and thought Louise might be better off without her, but the neighbour she left Louise with promised to look after her. Lisa worries that Phil might hurt Louise physically after Phil has hit Peggy. Peggy is unable to assure her that this will not happen. Peggy allows Louise to stay with Lisa permanently as long as Phil can visit her. Phil steals the social worker's bag to get Lisa's address, and drives there to confront her but finds the house abandoned and empty."]}, {"page": "List of Star Wars cast members", "response": ["| Simon Lowe"]}, {"page": "List of EastEnders characters (2007)", "response": ["Derek Evans is a social worker, played by Simon Lowe. In March 2007, he visits Bert Atkinson (Dave Hill) and his grandson Jay Brown (Jamie Borthwick), when Bert is trying to get a residency order for Jay to live with him permanently. Jay charms Derek, offering him a cup of tea and talking to him politely, impressing him. In January 2008, Derek visits Tanya Branning (Jo Joyner) and her sister Rainie Cross (Tanya Franks). In October that year, he attempts to sort out Jay's foster care problems when Billy Mitchell (Perry Fenwick) offers to care for him, as Jay does not want Dawn Swann (Kara Tointon) to be his foster mother. Derek inspects the flat above The Queen Victoria public house, and allows Jay to stay with Billy, despite Roxy Mitchell's (Rita Simons) messiness. In July 2009, he visits Denise Wicks (Diane Parish) after Jordan Johnson's (Michael-Joel David Stuart) mother Trina (Sharon Duncan Brewster) reports her to the police, claiming that Denise has been abusing Jordan. In June 2010, he visits Phil Mitchell (Steve McFadden) to assess his family situation involving his children Louise (Brittany Papple) and Ben (Charlie Jones), who has assaulted Jordan. The following month he visits Phil and his mother Peggy Mitchell (Barbara Windsor) to say that Louise's mother Lisa Fowler (Lucy Benjamin) has made an application to see her daughter. Derek explains that the final decision is not up to Phil and Peggy says that Derek is a typical social worker – an interfering, home-wrecking busybody. Derek responds sarcastically and leaves. When Peggy returns Louise to Lisa, they contact Derek again, and when he arrives, Phil steals his bag to get Lisa's address."]}, {"page": "Hindenburg: The Untold Story", "response": ["*Joseph Späh: Simon Lowe"]}, {"page": "Lowe (surname)", "response": ["* Simon Lowe (born 1973), British actor"]}, {"page": "Steve Huison", "response": ["Huison took the role of porter Norman Dunstan in January 2008 in the daily hospital drama by ITV1, The Royal Today, the spin off of the popular Sunday night drama, The Royal. Huison played Eddie Windass in Coronation Street from 2008 to 2011. He briefly starred as Mr. Byron in the first season of the series by CBBC, 4 O'Clock Club, which began airing in January 2012. His role was then taken over by Simon Lowe by Season 2 which began airing in January 2013."]}, {"page": "Special People (film)", "response": ["*Simon Lowe - Policeman"]}, {"page": "List of fictional doctors in television", "response": ["|Bodies || Dr. Maya DuttaDr. Polly GreyDr. Roger HurleyDr. Rob LakeDr. Maria OrtonDr. Tim SibleyDr. Tony Whitman || Preeya KalidasTamzin MallesonPatrick BaladiMax BeesleySusan LynchSimon LoweKeith Allen"]}, {"page": "4 O'Clock Club", "response": ["In the second series, Nathan leaves Elmsbury and new music teacher Dexter Harris (Jason Callender) joins the school. Dexter becomes Josh and his mother's new lodger, taking Josh's room as a result. As such, Josh antagonizes Dexter through much of the series, until he finally accepts his presence and labels him as an \"honorary Carter brother\". The series also featured Crispin Bell (Simon Lowe) as the new headmaster, who replaces Byron, and proved to be far stricter than Byron. Mr Bell was a brutal enemy of Josh and Dexter for the remainder of the series. Issac (Layton Blake) made a guest and a 1st appearance in Series 2 Episode 1 but his name wasn't confirmed and the credits says \"Fowlmere Josh\" Josh is 14 in this season", "This series saw the final appearances of CJ and Crispin Bell Bell (Rufus King-Dabbs and Simon Lowe) episode 4 and 10 respectively and Owen (Lewis Brindley), Fleur (Chloe Davison), Eleesha (Grace McIntosh), Katie (Jasmine Payne), Polly (Mischa Taylor Eckersley) and Evan (Zak Sutcliffe) in episode 13 as they left sixth form. CJ Bell returned in episode 10 as part of a rap, and Crispin Bell returned in episode 13 for a guest appearance.", "| Mr Crispin Bell || Simon Lowe || Headteacher (2x01–3x02, 8x04–9x10), Co Headteacher (3x03–3x13), History Teacher (4x01–9x10), Deputy Headteacher (5x01–7x02), Acting Headteacher (7x02–8x04) Chauffeur (9x13)|| 2x01–9x10, 9x13, Flashbacks (Series 7 and 8) || 2013–2020", "| Simon Lowe"]}, {"page": "List of Tracy Beaker Returns characters", "response": ["|  Mr Spooner is the owner of the scooter Liam (Richard Wisker) crashes. Liam is sentenced to community service at an old peoples home where Mr Spooner live. When Liam overhears Mr Spooner on the phone to Eddie (Simon Lowe), Mr Spooner is annoyed with Liam, however, he almost falls and Liam takes him into his room. Mr Spooner talks to Liam about his National Service and Liam apologises about his scooter. When Liam looks at Eddie's repair charges, he tells Mr Spooner that Eddie is ripping him off. Liam spots Eddie disconnecting the battery on Mr Spooner's scooter and Mr Spooner is convinced by Eddie to trade in his scooter, however, Mr Spooner cannot afford a new one, so Eddie lets him have a reconditioned scooter. Liam tells Mr Spooner that Eddie is ripping him off and Liam jumps into the back of Eddie's van to prove it. Liam films Eddie connecting the battery on Mr Spooner's scooter and selling it to an old lady and shows the video to Mr Spooner and Tracy (Dani Harmer). When Eddie is about to sell a scooter to Mr Spooner, Liam goes through what he has charged Mr Spooner for repairs before showing him the video he took. Eddie gives Mr Spooner a free scooter on the condition Liam deletes the video, however the police arrive soon after and arrest Eddie."]}, {"page": "Large (film)", "response": ["*Simon Lowe as Rob"]}, {"page": "Simon Lowe (disambiguation)", "response": ["Simon Lowe is a British actor.", "Simon Lowe may also refer to:", "* Simon Lowe (footballer) (born 1962), English former footballer", "*Simon Lowe (Ned's Declassified School Survival Guide)", "*Simon Lowe (MP) (died 1578), MP for Stafford and New Shoreham"]}, {"page": "List of Crossroads characters", "response": ["|Simon Lowe"]}, {"page": "Nativity Rocks!", "response": ["* Simon Lowe as Rory B. Bellows"]}]}}