{"wiki_id": "http://www.wikidata.org/entity/Q7519448", "itemLabel": "Simon Nye", "itemDescription": "British screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Nye", "wikipedia_page": {"main": "Simon Nye (born 29 July 1958) is an English comic television writer. He wrote the hit sitcom Men Behaving Badly, and all of the four ITV Pantos. He co-wrote the 2006 film Flushed Away, created an adaptation of Richmal Crompton's Just William books in 2010, and wrote the drama series The Durrells.", "link_mentions": [{"page": "List of comedians", "response": ["* Simon Nye"]}, {"page": "July 29", "response": ["*  1958   – Simon Nye, English screenwriter and producer"]}, {"page": "Tommy Cooper", "response": ["In February 2007 The Independent reported that Andy Harries, a producer of The Queen, was working on a dramatisation of the last week of Cooper's life. Harries described Cooper's death as \"extraordinary\" in that the whole thing was broadcast live on national television. The film subsequently went into production over six years later as a television drama for ITV. From a screenplay by Simon Nye, Tommy Cooper: Not Like That, Like This was directed by Benjamin Caron and the title role was played by David Threlfall. It was broadcast 21 April 2014."]}, {"page": "Burgess Hill", "response": ["* Simon Nye - TV writer who was born in Burgess Hill."]}, {"page": "Men Behaving Badly", "response": ["Men Behaving Badly is a British sitcom that was created and written by Simon Nye. It follows the lives of Gary Strang (Martin Clunes) and his flatmates Dermot Povey (Harry Enfield; series 1 only) and Tony Smart (Neil Morrissey; series 2 onwards). It was first broadcast on ITV in 1992. A total of six series were made, along with a Christmas special and a trilogy of episodes that make up the feature-length \"last orders\".", "Men Behaving Badly is based on Simon Nye's 1989 book of the same title. Producer Beryl Vertue first considered it for a film before deciding it was suited for television adaptation. Harry Enfield, already a well-known comedian, was cast first. He had seen Martin Clunes perform in a play and recommended him for the other lead.", "In 2002 it was revealed that Simon Nye and the cast had agreed to revive the series for three further specials the following year, in which Vertue wanted the show to focus on how Gary and Dorothy were coping with parenthood. The idea was shelved the following year after Caroline Quentin became pregnant. In October 2014, Clunes and Morrissey returned to the characters of Gary and Tony for the first time since 1998 in a sketch for Channel 4's \"The Feeling Nuts Comedy Night\" and Stand Up to Cancer telethon.", "A BBC article suggests that Gary and Tony were \"a reaction against the onset of the caring, sharing 'new man'. It appeared to revel in a politically incorrect world of booze, burps and boobs\". Critics Jon Lewis and Penny Stempel have stated that the show \"allowed male viewers to indulge in vicarious laddism, whilst allowing female viewers to ridicule the bad but lovable Tony and Gary\". They further commented that \"it was also a genuine sitcom in that the humour came from the characters and their context\". Simon Nye remarked: \"I don't do mad, plot-driven farragoes. You have to allow your characters time to talk.\"", "A companion guide to the show, The A–Z of Behaving Badly was released on 1 November 1995. It features many handy tips from Gary and Tony and was written by Simon Nye. On 27 July 2000, two audio compilations were released featuring eight shows from series three and four.", "A script book entitled The Best of Men Behaving Badly was released on 5 October 2000. It contains 25 of the 42 scripts, along with some new material, black and white pictures, and introductions by Simon Nye."]}, {"page": "My Family and Other Animals", "response": ["In 2005, it was adapted by the BBC as a 90-minute film, My Family and Other Animals, starring Eugene Simon as the young Gerry, Imelda Staunton as Mrs. Durrell and Omid Djalili as Spiro. This adaptation was written by Simon Nye.", "On 3 April 2016 ITV began running the six-part series The Durrells, also adapted by Simon Nye. Loosely based on the Corfu trilogy, it stars Keeley Hawes as Louisa Durrell and Milo Parker as Gerald Durrell. Three subsequent series of The Durrells were broadcast, in 2017, 2018, and 2019. The first series is set in 1935, the second in 1936, the third in 1937, and the fourth in 1938-39."]}, {"page": "The Fall and Rise of Reginald Perrin", "response": ["Martin Clunes starred in a BBC revival of the series, titled simply Reggie Perrin. The supporting cast were Fay Ripley, Wendy Craig, Geoffrey Whitehead, Neil Stuke and Lucy Liemann. The series was written by Simon Nye and original series creator David Nobbs. It ran for two series from April 2009 to November 2010."]}, {"page": "Martin Clunes", "response": ["While Clunes was appearing on stage at the Hampstead Theatre, Harry Enfield came to see him; the acquaintanceship developed into a friendship where Clunes played characters in Enfield's sketch shows (most notably one of the Rugby Players). Enfield then recommended Clunes for the role of Gary in the sitcom Men Behaving Badly, written for Enfield by Simon Nye, for which Clunes won a BAFTA television award for Best Comedy Performance in 1996. He played the part of Group Captain Barker in the two-part TV mini-series Over Here that same year. In 1993, he played Dick Dobson in Demob about a pair of demobilised soldiers who have to adjust to civilian life after entertaining Second World War troops with a raunchy cabaret act."]}, {"page": "The Darling Buds of May (TV series)", "response": ["In 2016, having filmed a cinema adaptation of another classic TV series, Dad's Army, Zeta-Jones responded positively to suggestions that The Darling Buds of May might also be similarly remade, stating \"I'd be playing Ma Larkin, but I'm up for it\". However, by 2020 any plans for a film were put on hold, with the Radio Times reporting that ITV was to remake the series with Simon Nye writing the scripts and with Bradley Walsh and Joanna Scanlan in the cast. The series, with the title The Larkins, aired in October 2021 starring Walsh and Scanlan, with Sabrina Bartlett and Peter Davison also amongst the cast."]}, {"page": "Rod Hall", "response": ["*Simon Nye (wrote the television show Men Behaving Badly)."]}, {"page": "Peter Serafinowicz", "response": ["On 1 May 1997, he appeared in The Election Night Armistice as Moz Bingham, the fictional press secretary to the then shadow Chancellor of the Exchequer Gordon Brown, who verbally abuses the BBC's Nick Robinson in a spoof phone call over the politician's news coverage. In 1998 he appeared on TV in Comedy Nation and You Are Here. He also had a role in the sitcom How Do You Want Me? penned by Simon Nye."]}, {"page": "The Doctor (Doctor Who)", "response": ["Episodes written by Steven Moffat have continued to hint at the Doctor's romantic capacity: his stories during the Russell T Davies tenure as showrunner included the admission of a sex life in \"The Doctor Dances\" and the romance with Madame de Pompadour in \"The Girl in the Fireplace\", past marriages in \"Blink\", and the introduction of recurring character River Song in the 2008 episodes \"Silence in the Library\"/\"Forest of the Dead\", who indicates she is a lover of the Doctor. In his tenure as showrunner (2010–2017), the series continued to imply that the Doctor will have a relationship with, and perhaps marry, River Song. Additionally, Moffat has companion Amy Pond attempt to seduce the Doctor in \"Flesh and Stone\", although he expresses shock at the idea, protesting that she was human. In \"A Christmas Carol\", the Eleventh Doctor finds himself accidentally engaged to film star Marilyn Monroe during a visit to 1950s Hollywood. The Doctor's past romantic relationship with Elizabeth I is alluded to in Moffat episodes \"The Beast Below\" and \"The Wedding of River Song\", as well as in \"Amy's Choice\" by Simon Nye."]}, {"page": "Carrie & Barry", "response": ["Produced by Hartswood Films, it reunited Morrissey with writer Simon Nye, executive producer Beryl Vertue and director Martin Dennis. It was produced by Sue Vertue."]}, {"page": "Donmar Warehouse", "response": ["For its revivals of foreign plays, the company regularly commissioned new translations or versions, including Ibsen's The Wild Duck (David Eldridge), Racine's Phaedra (Frank McGuinness), Dario Fo's Accidental Death of An Anarchist (Simon Nye) and Strindberg's Creditors (David Greig)."]}, {"page": "Charlotte Coleman", "response": ["Other television appearances in the 1980s and '90s included roles in Thames Television's The Bill and Central Independent Television's Inspector Morse, the short-lived comedy series Freddie and Max, with Anne Bancroft, a drama about homelessness, Sweet Nothing and another lesbian role, as Barbara Gale in the political satire Giving Tongue (1996). She also appeared in Simon Nye's sitcom How Do You Want Me? (1998–2000), alongside Dylan Moran and Emma Chambers, and voiced the lead female character, Primrose, in the animated adaptation of Brambly Hedge.\"TV Toons: Brambly Hedge (1996–2000)\" Toonhound.com, 2008 Coleman's final television appearance was in the adaptation of Jacqueline Wilson's Double Act, where she played the twins' teacher, Miss Debenham.", "*How Do You Want Me? ... Lisa Lyons; 24 February 1998 – 22 December 1999, Kensington Films & Television for BBC (writer: Simon Nye; director: John Henderson)"]}, {"page": "The College of Richard Collyer", "response": ["*Simon Nye, writer of Men Behaving Badly"]}, {"page": "How Do You Want Me?", "response": ["How Do You Want Me? is a British television sitcom, produced by Kensington Films & Television, written by Simon Nye, and directed by John Henderson."]}, {"page": "Fay Ripley", "response": ["Bon Voyage marked Ripley's last television acting appearance until 2009. During that time she appeared as a guest on panel shows and talk shows. In 2009, she returned to television screens as Nicola Perrin alongside Martin Clunes' eponymous character in the BBC One sitcom Reggie Perrin. She took the role because she had previously worked with Clunes and the writer Simon Nye.Staff (9 October 2010). \"Fay Ripley's back as put-upon wife Nicola in a new series of Reggie Perrin on BBC One\". Western Mail (Western Mail & Echo): p. 10 (magazine supplement). As the series was Ripley's first studio sitcom, she approached the role with apprehension; she told The Independent on Sunday, \"I basically just hung off Martin's coat-tails and hoped for the best.\"Montgomery, Hugh (19 April 2009). \"Fay Ripley\". The Independent on Sunday (Independent News & Media): p. 49. Ripley compared Nicola to Reggie's house-bound wife Elizabeth in the original series, noting that the modern character needed a job and independence from her husband because of changes in society.Smith, Christine (18 April 2009). \"The Rise and Rise of fabulous Fay\". Daily Record (Scottish Daily Record & Sunday Mail): p. 45. She reprised the role in the second series in 2010, after which the series was cancelled.Walker, Tim (22 June 2011). \"Fay Ripley: Working-class TV just a fad\". The Daily Telegraph (Telegraph Media Group): p. 9."]}, {"page": "Hardware (TV series)", "response": ["Hardware is a British sitcom that aired on ITV from 2003 to 2004. Starring Martin Freeman, it was written and created by Simon Nye, the creator of Men Behaving Badly and directed by Ben Kellett."]}, {"page": "Sylvestra Le Touzel", "response": ["Le Touzel has also been seen on television in shows as diverse as Dixon of Dock Green, The Brontes of Haworth, The Uninvited, Catherine Cookson's The Gambling Man as Charlotte Keane (1995),The Gentle Touch, The Professionals, Lovejoy, Alas Smith and Jones, Midsomer Murders, My Family and The Long Walk to Finchley (as Patricia Hornsby-Smith).  In 1994, she played Sarah Teale in the TV series Between the Lines. In 2000, Le Touzel was cast as a veterinary surgeon in the sitcom Beast, written by Simon Nye, which also starred Alexander Armstrong."]}, {"page": "Anne-Marie Duff", "response": ["Holly in the first series of Simon Nye sitcom, Wild West, alongside Dawn French and Catherine Tate in 2002. In 2002, Duff appeared in her first major film role as Margaret McGuire in The Magdalene Sisters."]}, {"page": "Wild West (TV series)", "response": ["Wild West is a British television sitcom that aired from 22 October 2002 to 13 April 2004, starring Dawn French and Catherine Tate. It was described as a dark comedy from the pen of Simon Nye and was filmed on location in Portloe, Cornwall. Set in the hamlet of St Gweep, Wild West observes the strange goings-on in the local Cornish community. Shop owners Mary Trewednack and her life-partner Angela Phillips are the main focus but there are many other characters in this sitcom."]}, {"page": "Emma Wray", "response": ["She is best known for starring as Brenda Wilson in the Granada Television sitcom Watching between 1987 and 1993, for which she also sang the theme tune \"What Does He See In Me?\" She also played a major role in Yorkshire Television's Stay Lucky throughout the same period, along with roles in many TV series such as Boon and Minder, and TV films including Defrosting the Fridge. After several years away from television, she returned to primetime TV in 1996 with the lead role in the drama comedy True Love, created by Men Behaving Badly writer Simon Nye. Nye adapted the drama into the series My Wonderful Life, which co-starred Elizabeth Berrington and Tony Robinson and ran for three series from 1996 to 1999."]}, {"page": "The Savages (TV series)", "response": ["The Savages is a British sitcom that aired on BBC One in 2001. Starring Geoffrey Palmer and comedian Marcus Brigstocke, it was written by Simon Nye, the writer of Men Behaving Badly."]}, {"page": "Nigel Lindsay", "response": ["| 2004 || Tunnel of Love || Geoff || written by Simon Nye"]}, {"page": "Horsham", "response": ["* Simon Nye – Writer of Men Behaving Badly, attended Collyer's when it was still a grammar school"]}, {"page": "Catwalk Dogs", "response": ["Catwalk Dogs is a British television film written by Simon Nye and produced by Shed Productions for ITV. It stars Kris Marshall and Georgia Mackenzie and was first shown on 21 October 2007. Filming took place between 17 and 24 June in Teddington."]}, {"page": "Is It Legal?", "response": ["Is It Legal? is a British television sitcom set in a solicitors office in Hounslow, west London, which ran from 12 September 1995 to 9 December 1998. It was produced by Hartswood Films and was shown on ITV for Series 1-2 and Channel 4 for Series 3. It was written by Simon Nye, who also wrote other ITV sitcoms such as Men Behaving Badly and Hardware."]}, {"page": "BAFTA Award for Best Animated Film", "response": ["| Flushed Away || David Bowers, Sam Fell || Dick Clement, Ian La Frenais, Simon Nye || United Kingdom, United States"]}, {"page": "Just William (book series)", "response": ["In July, 2009, it was announced that the BBC were working on a new series of Just William. The episodes were written by Men Behaving Badly writer Simon Nye and broadcast in 2010 starring Daniel Roche (Ben in Outnumbered) who plays William and newcomer Robert A Foster who plays Henry. The series was narrated by Martin Jarvis."]}, {"page": "List of Men Behaving Badly episodes", "response": ["Men Behaving Badly is a British sitcom that was created and written by Simon Nye.  It was first broadcast on ITV from 1992, moving to BBC One from 1994 to 1998.  A total of six series were made along with a Christmas special and three final episodes that make up the feature-length \"last orders\"."]}, {"page": "Shed Productions", "response": ["One-off drama Catwalk Dogs – written by Men Behaving Badly creator Simon Nye and starring Kris Marshall and Georgia MacKenzie – aired on ITV1 in 2007 and introduced viewers to the world of dog shows. This was followed in 2008 by Rock Rivals, another ITV commission that starred Michelle Collins and Sean Gallagher as Karina and Mal Faith – the bickering judges on a phenomenally successful TV talent show."]}, {"page": "Between Us (Murray Head album)", "response": ["*Peter Kelsey, Robin Black, Simon Nye - engineer"]}, {"page": "Spencer Campbell", "response": ["Following Cold Feets conclusion in 2003, Campbell produced Donovan, a psychological thriller serial starring Tom Conti, and the comedy drama Christmas Lights and its spin-off Northern Lights, both starring Robson Green and Mark Benton. In 2006, he co-produced Joanne Lees: Murder in the Outback, a dramatisation of the events surrounding the murder of Peter Falconio. Campbell pledged not to deviate from the facts of the case, saying \"We've obviously researched it pretty thoroughly, so really it's a story about how difficult it was to bring Murdoch [the killer] to justice.\"Maynard, Roger (23 August 2006). \"Falconio murder to be made into film\". The Guardian (Guardian News & Media): p. 17. In 2007, he began working for Shed Productions, where he developed Catwalk Dogs, a comedy television film written by Simon Nye and starring Kris Marshall.Conlan, Tara (29 May 2007). \"Marshall in ITV doghouse\". MediaGuardian (Guardian News & Media). Retrieved on 16 November 2007. From 2008 to 2009 he produced two series of Shed Productions' school drama Waterloo Road and in 2009 produced the series Hope Springs. In 2011 he produced Mad Dogs for Left Bank Pictures and Sky1, and for the BBC he produced Blandings (2013)."]}, {"page": "Dick Whittington and His Cat", "response": ["A number of television versions have been created, including a 2002 version written by Simon Nye and directed by Geoff Posner.2002 television version at IMDB database"]}, {"page": "British Academy Television Award for Best Comedy (Programme or Series)", "response": ["| Men Behaving Badly || Beryl Vertue, Martin Dennis, Simon Nye", "| Men Behaving Badly || Beryl Vertue, Martin Dennis, Simon Nye"]}, {"page": "Reggie Perrin", "response": ["On 14 January 2009, it was announced by the BBC that Martin Clunes would star in a contemporary version of the sitcom, taking the title role of Reggie. The remake was commissioned by Jay Hunt, controller of BBC1, and Cheryl Taylor, controller of BBC Comedy. Clunes was joined in the cast by Fay Ripley, Wendy Craig, Geoffrey Whitehead, Neil Stuke, Kerry Howard, Jim Howick and Lucy Liemann. The new version was written by Simon Nye and the original creator of the Reggie character, David Nobbs, who had authored four Reginald Perrin novels as well as the original version of the sitcom."]}, {"page": "2004 in British television", "response": ["*27 December – Debut of Pride, Simon Nye's tale about two lion cubs growing up on the African plains, and which is aired on BBC One. The film features the voices of numerous British actors and uses CGI technology to enhance footage of actual lions and other animals.  "]}, {"page": "My Family and Other Animals (film)", "response": ["My Family and Other Animals is a 2005 television film written by Simon Nye and directed by Sheree Folkson. The film is based on the 1956 autobiographical book of the same title written by Gerald Durrell, in which he describes a series of anecdotes relating to his family's stay on Corfu from 1935–1939, when he was aged 10–14."]}, {"page": "Simulated reality in fiction", "response": ["* Doctor Who episodes \"Forest of the Dead\" and \"Extremis\", written by Steven Moffat and \"Amy's Choice\", written by Simon Nye."]}, {"page": "Doctor Who (series 5)", "response": ["In addition to the six episodes written by Moffat, Mark Gatiss, Toby Whithouse, Simon Nye, Richard Curtis, and Gareth Roberts wrote one episode each; Chris Chibnall wrote a two-episode story. The series was meant to be fantastical to stand out from other science-fiction and fantasy shows, and the production team strove for a fairy-tale quality because Moffat believed that media aimed at children were some of the most popular among adults. The episodes were directed by directors who were new to Doctor Who. Filming began in late July 2009, lasting about nine months. The series was filmed primarily in Wales, except for \"The Vampires of Venice\" and \"Vincent and the Doctor\" (which had scenes filmed in Trogir, Croatia). Design changes from the previous series included a new logo, title sequence, variant of the Doctor's sonic screwdriver, interior and exterior of the TARDIS, and a change in the theme music.", "Toby Whithouse originally planned to write a different episode, but Moffat and Wenger considered it too similar to other episodes in the series. Whithouse wrote \"The Vampires of Venice\" instead, and his original episode was moved back to the next series. He was asked to write \"a big bold romantic episode\" which would be a \"good jumping off point\" for new viewers of Doctor Who. Moffat thought that in the middle of the series, a viewer could \"start watching it again\" and it should be \"something romantic and funny\". For the next episode, Moffat asked comedy writer Simon Nye to write a story which challenged the relationship between Amy and the Doctor. The episode, \"Amy's Choice\", was intended to have the character choose between excitement with the Doctor or life with Rory. The scene in which Rory dies in the false reality was intended to reveal Amy's feelings for him. Nye wanted to stress that Amy really loved Rory, and he was not \"just a cypher boyfriend or fiancé\".", "| Simon Nye"]}]}}