{"wiki_id": "http://www.wikidata.org/entity/Q7519647", "itemLabel": "Simon Richman", "itemDescription": "British footballer (born 1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Richman", "wikipedia_page": {"main": "Simon Andrew Richman (born 2 June 1990) is an English semi-professional footballer who most recently played for National League club Altrincham as a midfielder.\nA former youth player with Port Vale, he was a regular in the first team throughout the 2008–09 season, picking up the club's young player of the year award. He was released in the summer of 2010, at which point he joined Worcester City for a season. He signed with Altrincham in June 2011, and helped the club to win promotion out of the Conference North via the play-offs in 2014 and to win the Northern Premier League Premier Division title in 2017–18 and the National League North play-offs again in 2020.", "link_mentions": [{"page": "Richman", "response": ["* Simon Richman (b. 1990), English footballer"]}, {"page": "Maricourt Catholic School", "response": ["*Simon Richman, professional footballer."]}, {"page": "Simon Andrew Richman", "response": ["#REDIRECT Simon Richman"]}, {"page": "2007–08 Port Vale F.C. season", "response": ["|align=\"left\"|MF||32||align=\"left\"| Simon Richman"]}, {"page": "2008–09 Port Vale F.C. season", "response": ["|align=\"left\"|MF||19||align=\"left\"| Simon Richman", "|3||MF||||19||Simon Richman||5||0||0||0||5", "|19||||MF||Simon Richman||2||0||0||0||0||0||0||0||2||0"]}, {"page": "2009–10 Port Vale F.C. season", "response": ["At the end of the season Joe Anyon was offered a new contract at Vale Park on reduced pay, but instead signed with Lincoln City. Chris Martin signed a new two-year contract, which came with an increase in wages. Released players moved on to other clubs: Luke Prosser (Southend United); Simon Richman and Danny Glover (Worcester City); David Howland (Glentoran);  and James Lawrie (AFC Telford United). Ross Davidson also joined Stafford Rangers, after having spent much of the season loan at the club, as well as a brief time at Nantwich Town. Geoff Horsfield retired as a player to concentrate on his role as assistant manager.", "|align=\"left\"|MF||19||align=\"left\"| Simon Richman", "| April 2010 || MF ||  || Simon Richman || Worcester City || Released || "]}, {"page": "Football at the 2013 Summer Universiade", "response": ["| James Aldred James Baldwin James Belshaw Alex Dyer Luke Graham Timothy Horn Joe Lolley Sammy MacVicar Gavin Malin Thomas McCready Craig Moses Kieran Murphy George Nash Marc Newsham Jake Parrott Nicholas Platt Michael Rae Simon Richman George Williams Jack Winter"]}, {"page": "Great Britain at the 2013 Summer Universiade", "response": ["| Simon Richman || Manchester University"]}]}}