{"wiki_id": "http://www.wikidata.org/entity/Q7518627", "itemLabel": "Simon Dobson", "itemDescription": "British composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Dobson", "wikipedia_page": {"main": "Simon Dobson (born 1981) is an English composer particularly noted for his brass band compositions.", "link_mentions": [{"page": "British brass band", "response": ["* Simon Dobson: The Drop, Lydian Pictures & Penlee"]}, {"page": "Penlee lifeboat disaster", "response": ["In 2015, Cornish-American singer-songwriter Jim Wearne's album Half Alive in Wallaroo featured the track \"The Boys of Penlee\", written by fellow Cornish bard Craig Weatherhill, and featuring Weatherhill playing mellotron whose haunting choir sound ends the song with the line \"For those in peril on the sea\", from the popular sailors' hymn. Simon Dobson wrote a test piece for brass band entitled \"Penlee\" about the incident."]}, {"page": "Madison Scouts Drum and Bugle Corps", "response": ["|2019|| Majestic || Afterburners by Chuck Naffier / Backlash (from Euneirophrenia) by Simon Dobson / 715–CRΣΣKS by Justin Vernon (Bon Iver) / Young Person's Guide to the Orchestra by Benjamin Britten / One Voice by Barry Manilow  || 82.138  || 17th"]}, {"page": "Blue Devils Drum and Bugle Corps", "response": ["|2017|| Metamorph ||Birth of Eternity, Dreamscape & Facing Future by Dave Glyde / The Triumph of Time by Peter Graham / Flight of the Bumblebee by Nikolai Rimsky-Korsakov /  Everything Must Change by Benard Ighner / STAY. (from Interstellar) by Hans Zimmer / Who Knows One? (Traditional) / Crystal by Simon Dobson  || 98.538 || 1st"]}, {"page": "Carolina Crown Drum and Bugle Corps", "response": ["|2016 || Relentless ||The Good, the Bad and the Ugly by Ennio Morricone / The Ecstasy of Gold by Ennio Morricone / Medea's Dance of Vengeance, Op. 23a by Samuel Barber / Journey of the Lone Wolf by Simon Dobson / El Tango de Roxanne by Sting, Craig Pearce, Baz Luhrmann, Mariano Mores / Hallelujah by Leonard Cohen / Il Triello (The Trio) by Ennio Morricone / Equilibrium by Paul Lovatt-Cooper ||97.088|| 3rd"]}, {"page": "Dobson (surname)", "response": ["*Simon Dobson (born 1981), English composer"]}, {"page": "Bring Me the Horizon", "response": ["On 22 April 2016, the band performed a live concert with an orchestra conducted by Simon Dobson at the Royal Albert Hall in London. The concert marked the first time the band had performed with a live orchestra. It was recorded, and the live album, Live at the Royal Albert Hall, was released on 2 December 2016 through the crowdfunding platform PledgeMusic on CD, DVD, and vinyl, with all proceeds donated to Teenage Cancer Trust.  Following the show, Fish hinted at the possibility of doing a full tour with an orchestra, saying: \"It seems almost a bit of a shame to go to all this effort for months and months for just one night.\""]}, {"page": "2012 in British music", "response": ["*Wind Band or Brass Band: A Symphony of Colours – Simon Dobson"]}, {"page": "Live at the Royal Albert Hall (Bring Me the Horizon album)", "response": ["Live at the Royal Albert Hall is the second live album and video by British rock band Bring Me the Horizon. It was recorded on 22 April 2016 at the Royal Albert Hall, with accompaniment from the Parallax Orchestra conducted by Simon Dobson. The album was released on 2 December 2016 through the crowdfunding platform PledgeMusic, with all proceeds being donated to Teenage Cancer Trust.", "On 26 November 2015, it was announced that Bring Me the Horizon would be performing at the Teenage Cancer Trust concerts at the Royal Albert Hall in London on 22 April 2016, being accompanied for the first time by a full live orchestra and choir. Tickets for the show went on sale on 4 December 2015. American rock band PVRIS performed as the opening act. Bring Me the Horizon performed alongside Parallax Orchestra conducted by Simon Dobson, and gave live debuts for That's the Spirit tracks \"Avalanche\" and \"Oh No\", as well as performing \"It Never Ends\" and \"Empire (Let Them Sing)\" (from There Is a Hell... and Sempiternal, respectively) for the first time since 2014."]}, {"page": "2018 in British music", "response": ["* Wind Band or Brass Band: Simon Dobson – The Turing Test"]}, {"page": "Nihilist Blues", "response": ["* Simon Dobson – strings, trumpet"]}, {"page": "Live at the Royal Albert Hall (featuring The Parallax Orchestra)", "response": ["Live at the Royal Albert Hall is the fourth live album by the American rock band Alter Bridge. Recorded on October 2 and 3, 2017, at Royal Albert Hall in London, England, the band played two sold-out shows with the 52-piece Parallax Orchestra, conducted by Simon Dobson. For the occasion, the band performed songs that are rarely played, such as The End Is Here and Words Darker Than Their Wings, the latter receiving its live debut.", "*Simon Dobson – Conductor, Music Director & Orchestral arrangements (Except where noted)"]}, {"page": "Music to Listen To...", "response": ["* Simon Dobson – trumpet , fluegelhorn "]}, {"page": "For Those That Wish to Exist", "response": ["* Simon Dobson – brass, strings, arrangement"]}]}}