{"wiki_id": "http://www.wikidata.org/entity/Q7518925", "itemLabel": "Simon Haughton", "itemDescription": "English rugby league and rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Haughton", "wikipedia_page": {"main": "Simon James Haughton (born 10 November 1975) is an English former professional rugby league and rugby union footballer who played as a second-row forward in the 1990s and 2000s. He played representative level rugby league for Great Britain and England, and at club level for the Wigan Warriors (Heritage № 887) and Oldham RLFC (Heritage № 1164), and club level rugby union for Orrell R.U.F.C..", "link_mentions": [{"page": "1995 Rugby League World Cup", "response": ["*  Simon Haughton"]}, {"page": "Orrell R.U.F.C.", "response": ["Immediate changes were seen, not all of them universally popular with the former members, but Orrell began to prosper again. Most of the players who had been looking elsewhere were persuaded to stay, and Phil Jones, who completed his first season in the game by playing for the full England side against the Barbarians at Twickenham, was recruited from the Rugby League Club. Andy Craig who had been playing rugby league for Widnes Vikings returned, and was capped for Scotland on their summer tour of North America and played for Scotland throughout the autumn series of internationals and the Six Nations. Also that season, Wade Kelly an outstanding centre from Australia, Nick Easter at the time playing for Rosslyn Park who has won 54 caps as the England No.8, Sam Reay a former England Rugby League school boy came from Rugby League side Wigan Warriors, along with Simon Haughton who played for England Rugby League during the 1995 Rugby League World Cup and won the Super League Grand Final with Wigan in 1998 and Wes Davies, a Wales Rugby League International swelled the ranks. They were joined by Orrell stalwarts the journeyman locks Alex Bennett and the legendary Chas Cusani.", "During the close season, former Australian International flank-forward Ross Reynolds was appointed as head coach, most of the previous season's squad re-signed and further re-enforcements were drafted-in with the signing of Samoan scrum half Stephen So'oialo, hooker Mike Howe from Newcastle, Steve Barretto a prop from Leinster, Drew Hickey a super 12 player from Australia, Simon Haughton, another rugby league international out of the Warriors stable, and Steve Moore a Welsh international lock. They went full-time at the end of the season and set their sights on Premiership rugby. With a new side coming together they had a disastrous opening month but then things improved, with them only losing one more league game throughout the campaign to finish a creditable 4th. Their season highlight was a 20-13 win over Exeter in the Powergen Shield final at Twickenham.", "*  Simon Haughton, England Rugby league International & Super League Grand Final Winner"]}, {"page": "Bingley Grammar School", "response": ["* Simon Haughton, international Rugby League player who represented Wigan, England and Great Britain."]}, {"page": "Bradford Dudley Hill", "response": ["*Simon Haughton – Represented England and Great Britain."]}, {"page": "1998 Super League Grand Final", "response": ["||  Simon Haughton"]}]}}