{"wiki_id": "http://www.wikidata.org/entity/Q7518479", "itemLabel": "Simon Clist", "itemDescription": "British footballer (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Clist", "wikipedia_page": {"main": "Simon James Clist (born 13 June 1981) is an English footballer who plays as a midfielder. He began his career at Tottenham Hotspur and went on to play for Bristol City, Torquay United, Barnet, Hereford United, Oxford United and Forest Green Rovers.", "link_mentions": [{"page": "July 13", "response": ["*  1982   – Simon Clist, English footballer"]}, {"page": "Paul Fairclough", "response": ["Despite some edgy performances, Fairclough kept Barnet's promotion hopes alive, cementing 4th place and setting up a play-off semi-final with Shrewsbury Town. Barnet won the first leg at Underhill 2–1 thanks to a dramatic injury-time header from Bees defender Simon Clist. The second leg was a cagey affair and the tie was eventually settled on penalties – Barnet losing 5–3 in the shootout. Although the team had failed to reach the play-off final, Fairclough was handed the job on a permanent basis shortly after by Barnet chairman Tony Kleanthous."]}, {"page": "Graham Killoughery", "response": ["His league debut came while still a trainee, on 29 March 2003 when came on as a late replacement for Simon Clist in the 1-1 draw at home to Boston United. He made a further appearance as a substitute against Southend United the following month and two days later started the 2-2 home draw with Leyton Orient. "]}, {"page": "1982 in the United Kingdom", "response": ["* 13 July – Simon Clist, footballer"]}, {"page": "Lee Matthews (footballer)", "response": ["On 15 March he joined Bristol City on loan, after coming off the bench the next day to score against Millwall in a 2–1 win at Ashton Gate, he was signed permanently for £100,000 (initially £70,000, with a maximum bonus of £35,000 dependent on appearances) on 20 March. Three days later he did the same thing in a 3–1 win at Reading, his goal coming three minutes after coming onto the pitch. A semi-regular in 2001–02, he scored just five goals, though Two of these came in a Bristol derby game on 9 January, City celebrating a 3–0 home win in the Football League Trophy. He also scored in City's Severnside derby victory over Cardiff City. However, he missed many games that season due to injury, including an ankle injury which required surgery. In April 2002 he was transfer listed by manager Danny Wilson, along with Mickey Bell, Mark Lever, Steve Jones and Simon Clist."]}, {"page": "John Johnson (footballer)", "response": ["Northampton signed Johnson on a two-year contract in July 2010 following the successful loan spell.Johnson joins Northampton . Sky Sports. 23 July 2010. Retrieved 12 March 2013. After signing for the club on a permanent basis, Johnson's first match was the opening game of the season, in a 3–0 loss against Torquay United. Two months later, he received a straight red card after fouling Simon Clist and lost his appeal, resulting in a one-match ban, missing a 3–1 loss against Oxford United. A week after his suspension, he scored his first goal as a permanent Northampton player in a 2–0 win over Lincoln City. In his first season at Northampton (as a permanent player), he made 41 appearances and scored seven goals."]}, {"page": "2009–10 Oxford United F.C. season", "response": ["At the start of the month Chris Wilder was once again awarded manager of the month, with Ryan Clarke awarded player of the month after keeping five clean sheets out of seven games. The lead at the top was reduced to 6 points after a 1–1 draw at Barrow. A behind-the-scenes friendly was played against Watford mid-week to give players without game time a run out, the result being 1–0 to Oxford. The biggest winning margin of the season followed, with a 5–0 thrashing of Grays Athletic. A late equaliser from Simon Clist gave United a 1–1 draw away at York City. The Fourth Qualifying Round of the FA Cup followed, with a 2–0 win over Thurrock. Damian Batt's first goal for the club gave the U's a 1–0 win over Altrincham. Before the FA Cup tie against Yeovil Town, Oxford beat Leicester City 4–0 in a behind-closed-doors friendly, and on the same day Shane Killock and Alex Rhodes left the club.", "|align=\"left\"|11||align=\"left\"|MF||align=\"left\"|Simon Clist"]}, {"page": "2010–11 Oxford United F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MF||align=\"left\"|Simon Clist"]}, {"page": "2010 Conference Premier play-off Final", "response": ["|LM ||11 ||Simon Clist"]}, {"page": "2011–12 Oxford United F.C. season", "response": ["|= ||MF || ||23 ||Simon Clist || 0 || 0 || 1 || 0 || 1", "| Simon Clist", "| Simon Clist"]}, {"page": "2011–12 Hereford United F.C. season", "response": ["|18 || ||MF ||Simon Clist || 4 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 5 || 0", "| Simon Clist", "| Simon Clist"]}, {"page": "1999–2000 Bristol City F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Simon Clist"]}, {"page": "2012 Football League Cup Final", "response": ["Cardiff entered the 2011–12 Football League Cup in the first round where they faced Oxford United. The match played at the Kassam Stadium saw Cardiff take the lead in the 10th minute when Craig Conway scored. Oxford equalised 20 minutes later courtesy of a Simon Clist goal. Neither side was able to score a winning goal during the remainder of the match, which went into extra-time at 1–1. Two goals from Peter Whittingham and Nathaniel Jarvis secured a 3–1 victory for Cardiff. Their opponents in the second round were Huddersfield Town. Two goals in the first 16 minutes courtesy of Gabor Gyepes and Jon Parkin gave Cardiff an early 2–0 lead, which they held until the 55th minute when Huddersfield reduced the deficit to 2–1 courtesy of a Jordan Rhodes goal. Daniel Ward equalised for Huddersfield in the 69th minute before Rhodes scored his second goal of the match to give Huddersfield a 3–2 lead in the 87th minute. Cardiff equalised two minutes into stoppage time when Don Cowie headed the ball in from close range. With the score at 3–3 after 90 minutes the match went to extra-time.  A goal each from Conway and Cowie gave Cardiff a 5–3 victory and progression to the third round."]}, {"page": "History of Shrewsbury Town F.C.", "response": ["In the semi-finals, Shrewsbury faced Barnet over two legs. The opening leg at Underhill saw Shrewsbury lose 2–1, with Barnet scoring an injury time winner. Over 7,000 saw the return match at Gay Meadow, a match that was televised live on Sky Sports. Shrewsbury drew level on aggregate following a Luke Rodgers penalty. With the teams level after extra-time, Scott Howie saved a penalty from Barnet's Simon Clist, and Darren Moss scored the winning penalty, setting Shrewsbury for the Conference playoff final against Aldershot Town, at the neutral venue of the Britannia Stadium, home of Stoke City."]}, {"page": "List of Forest Green Rovers F.C. seasons", "response": ["| Simon ClistDanny Carey-Bertram", "Simon Clist", "Simon Clist", "Simon Clist"]}, {"page": "2000–01 Bristol City F.C. season", "response": ["|align=\"left\"|31||align=\"left\"|MF||align=\"left\"| Simon Clist"]}, {"page": "List of people from Bournemouth", "response": ["* Simon Clist (born 1981) footballer who plays as a midfielder, made 379 pro. appearances"]}]}}