{"wiki_id": "http://www.wikidata.org/entity/Q7519216", "itemLabel": "Simon Lister", "itemDescription": "British sportswriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Lister", "wikipedia_page": {"main": "Simon Lister (born London, 1969) is an English author.\nHis first book, Supercat, the authorised biography of the former West Indies captain, Clive Lloyd, was published by Stephen Chalke in 2007. The book was shortlisted for the 2008 British Sports Book Awards, and the cricket correspondent of the Guardian, Mike Selvey, chose it as his Book of the Year. His 2015 book Fire in Babylon, about the successful West Indian cricket teams from the 1970s to the 1990s, won The Cricket Society/ MCC Book of the Year in 2016.Lister is also a regular contributor to The Wisden Cricketer magazine and has written for the Wisden Cricketers' Almanack.", "link_mentions": [{"page": "Clive Lloyd", "response": ["In 2005, Lloyd offered his patronage to Major League Cricket for their inaugural Interstate Cricket Cup in the United States, to be named the Sir Clive Lloyd Cup. His son, Jason Clive Lloyd, is a goalkeeper for the Guyana national football team. In 2007, Lloyd's authorised biography, Supercat, was published. It was written by the cricket journalist Simon Lister."]}, {"page": "The Cricket Society", "response": ["* 2016: Fire in Babylon by Simon Lister"]}, {"page": "Stephen Chalke", "response": ["Chalke retired from Fairfield Books at the end of 2019 having run it more than 20 years. During that time Fairfield produced 40 books, of which Chalke wrote 17. Other authors include David Foot, John Barclay, Peter Walker, Mark Wagh and Simon Lister."]}, {"page": "Michael Bore", "response": ["Remarkably, Bore found the middle of the bat time and again, and when the last over started, another 14 runs were needed. Stephen Booth bowled the first ball of the season's last over and Bore scored a boundary.  The second ball went to the ropes again, and the third went for two runs.  Nottinghamshire needed four more runs from three balls to complete a remarkable win. Bore blocked the fourth ball and Andy Pick, Nottinghamshire's number 11, walked down the pitch to ask \"What did you do that for?\" \"It wasn't in the right place.\" Bore replied. The next delivery saw Bore launch a blow towards the stands.  The crowd and the entire Nottingham team were on their feet and Bore thought, as soon as he'd hit it, \"That's it, we've won\". However Somerset's Richard Ollis ran in and caught the ball above his head, just ten feet from the boundary.  Nottinghamshire had lost by three runs and Bore's innings had been in vain.  As Bore related in an interview with Simon Lister \"We were stunned. We got in the car and I don't think we spoke a word until we were well past Gloucester. No matter how many times I lie in bed and replay that ball I never score those four runs\"."]}, {"page": "Stephen Moreton", "response": ["In August 2005, Moreton was rated as having bowled the fifth worst over of all time by Simon Lister when writing for the website Cricinfo. The over in question came on his first-class debut against Gloucestershire. Moreton was given the ball close to the close of play on day two of the match, by which stage Gloucestershire had a first-innings lead approaching 400 and Craig Spearman unbeaten on 136. Spearman dispatched Moreton's first over in first-class cricket for 34 runs, hitting 6, 6, 6, 6, 4, 6, to advance his score to 170. The over ranks as the seventh most expensive of all time in first-class cricket."]}]}}