{"wiki_id": "http://www.wikidata.org/entity/Q7518783", "itemLabel": "Simon Fraser, 13th Lord Lovat", "itemDescription": "British noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Fraser,_13th_Lord_Lovat", "wikipedia_page": {"main": "Simon Fraser, 13th Lord Lovat and 2nd Baron Lovat (21 December 1828 – 6 September 1887), was a Scottish peer. While legally the 13th Lord, he was referred to as the 15th Lord Lovat.", "link_mentions": [{"page": "Simon Fraser", "response": ["* Simon Fraser, 13th Lord Lovat (1828–1887), Scottish peer"]}, {"page": "Lord Lovat", "response": ["* Simon Fraser, 13th Lord Lovat, 2nd Baron Lovat (1828–1887)"]}, {"page": "Simon Christopher Joseph Fraser, 15th Lord Lovat", "response": ["#REDIRECT Simon Fraser, 13th Lord Lovat"]}, {"page": "Sir William Stirling-Maxwell, 9th Baronet", "response": ["* Brigadier General Archibald Stirling, of Keir (14 September 186718 February 1931), married on 14 April 1910 The Hon. Margaret Mary Fraser (25 June 18814 August 1972), daughter of Simon Fraser, 13th Lord Lovat and Alice Mary Weld-Blundell, and had six children:"]}, {"page": "Lord Lieutenant of Inverness", "response": ["*Simon Fraser, 13th Lord Lovat 18 April 1873 – 6 September 1887"]}, {"page": "Simon Fraser, 14th Lord Lovat", "response": ["Born on 25 November 1871, he was the eldest surviving son of nine children born to Simon Fraser, 13th Lord Lovat, and Alice Mary Weld-Blundell.  Among his siblings were Hon. Mary Laura Fraser (wife of John Scott, Viscount Encombe and mother of John Scott, 4th Earl of Eldon), Hon. Alice Mary Charlotte Fraser (wife of Hon. Bernard Constable-Maxwell and mother of Gerald Maxwell), Hon. Etheldreada Mary Fraser (wife of diplomat Sir Francis Oswald Lindley), Hon. Hugh Joseph Fraser, a Major with the Scots Guards who was killed in the First Battle of Ypres during World War I), Hon. Alastair Thomas Joseph Fraser (husband of Lady Sybil Grimston, daughter of James Grimston, 3rd Earl of Verulam), Hon. Margaret Mary Fraser (wife of Brig.-Gen. Archibald Stirling and mother of Sir David Stirling) and Hon. Muriel Mary Rose Fraser, who became a Catholic nun. His father served as Lord Lieutenant of Inverness and aide-de-camp to Queen Victoria from 1883 to 1887."]}, {"page": "Simon Fraser, 15th Lord Lovat (1828-1887)", "response": ["#REDIRECT Simon Fraser, 13th Lord Lovat"]}, {"page": "Beaufort Castle, Scotland", "response": ["From 1746 the estate was run by the Forfeited Estates Commissioners, appointed by Parliament to dispose of confiscated estates, and a small house was built on the site of the demolished castle to house the  factor (estate manager). In 1774 the estate was returned to Lovat's son, Simon Fraser of Lovat (1726–1782), who had raised and commanded the 78th Fraser Highlanders for the British Army. Proposals for a new house on the site were put forward in 1777 but not executed. In 1815 the estate was inherited by Thomas Fraser of Strichen (1802–1875), who was reinstated to the Lordship of Lovat in 1854. In 1839 he commissioned William Burn to extend the house, and also improved the grounds and estate. His son Simon Fraser, 13th Lord Lovat (1828–1887), built the present Beaufort Castle, to designs by James Maitland Wardrop, incorporating part of the 18th-century house."]}, {"page": "Thomas Fraser, 12th Lord Lovat", "response": ["* Simon Fraser, 13th Lord Lovat (1828–1887), who married Alice Mary Weld-Blundell, daughter of Thomas Weld-Blundell."]}, {"page": "Fort Augustus Abbey", "response": ["The site at Fort Augustus was given by Simon Fraser, 13th Lord Lovat. It comprised the buildings of a dismantled fort, built in 1729 and originally erected for the suppression of Highland Jacobites. It had been purchased from the Government by the Lovat family, in 1867."]}, {"page": "James Grimston, 3rd Earl of Verulam", "response": ["*Lady Sibyl Grimston (1887–1968); married to Major The Hon. Alastair Thomas Joseph Fraser, son of Simon Fraser, 13th Lord Lovat, and wife Alice Mary Weld-Blundell"]}, {"page": "Gerald Maxwell", "response": ["Maxwell was born in Beauly near Inverness, Scotland, to the Honourable Bernard Constable-Maxwell (son of William Constable-Maxwell, 10th Lord Herries of Terregles) and the Honourable Alice Fraser (daughter of Simon Fraser, 13th Lord Lovat), both of whom were scions of notable Scottish recusant families. He was educated at Downside School."]}, {"page": "Francis Oswald Lindley", "response": ["In 1903, Lindley married Etheldreda Mary Fraser (1872–1949), third daughter of Simon Fraser, 13th Lord Lovat. Her elder brother was Simon Fraser, 14th Lord Lovat and among her younger siblings was Alastair Thomas Joseph Fraser (who married Lady Sybil Grimston, daughter of James Grimston, 3rd Earl of Verulam) and Margaret May Fraser (who married Brig-Gen Archibald Stirling, son of Sir William Stirling-Maxwell, 9th Baronet). They had four daughters, all of whom had prominent marriages:"]}, {"page": "Rose Leslie", "response": ["Leslie was born in Aberdeen, Scotland, and raised at Lickleyhead Castle in Aberdeenshire, her family's 15th-century ancestral seat, where she lived until the age of 10. Her father, Sebastian Arbuthnot-Leslie, is the Aberdeenshire Chieftain of Clan Leslie. Her mother is Candida Mary Sibyl \"Candy\" Leslie (née Weld) of Clan Fraser of Lovat, whose maternal great-grandfather was Simon Fraser, 13th Lord Lovat and a descendant of King Charles II. Through her mother, Leslie is a great-great-granddaughter of Frederick Weld, the sixth prime minister of New Zealand, and through her father, she is a great-great-granddaughter of Don Guillermo Landa y Escandón, who served as governor of Mexico City. Leslie's ancestors include Ambrose Lisle March Phillipps De Lisle, politician Charles March-Phillipps and MP James Grimston, 3rd Earl of Verulam. Her family currently lives at the 12th-century Wardhill Castle in Old Rayne."]}, {"page": "John Scott, 4th Earl of Eldon", "response": ["His father was the eldest son, and heir apparent, of John Scott, 3rd Earl of Eldon and Henrietta Scott, Countess of Eldon (a granddaughter of Godfrey Macdonald, 3rd Baron Macdonald). Among his large family was aunt Lady Margaret Scott, a golfer who won the first three British Ladies Championships and uncles Michael Scott, who won the British Amateur Golf Championship in 1933, Osmund Scott, the runner-up at the 1905 Amateur Championship, and Denys Scott, also a competitive golfer. His maternal grandparents were Simon Fraser, 13th Lord Lovat and Alice Mary Blundell, daughter of Thomas Weld-Blundell. "]}, {"page": "Leslie Rowan", "response": ["In 1944, in Kensington, Rowan married Catherine Patricia Love, an officer in the Women's Royal Naval Service and a daughter of Brigadier R. H. A. D. Love, of Mayford, and they had four children, Sarah Josephine Rowan, Susannah V. Rowan, Charles Rowan and Mark D. R. Rowan.Burke's Peerage, vol. 3 (2003), p. 3834; \"LOVE Catherine P / Rowan /\t Kensington 1a 177\" in England & Wales, Civil Registration Marriage Index, 1916-2005 (1944, first quarter); \"Miss Catherine Patricia Love\" in List of Officers on the Active List of the Royal Navy (1942), p. 390 Their daughter Susannah married Johnson Tamlyn, and their granddaughter Joanna Tamlyn married Sir Henry de la Poer Beresford-Peirse, 7th Baronet.Beresford-Peirse, of Bagnall, Waterford (UK Baronet, 1814), cracroftspeerage.co.uk, accessed 5 February 2021 Their son Mark married Katharine Julia Fraser, a great-granddaughter of Simon Fraser, 13th Lord Lovat, and they have four children.Burke's Peerage, vol. 2 (2003), p. 2,414"]}]}}