{"wiki_id": "http://www.wikidata.org/entity/Q7518513", "itemLabel": "Simon Coombs", "itemDescription": "British politician (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Coombs", "wikipedia_page": {"main": "Simon Christopher Coombs (born 21 February 1947), is a former British Conservative politician.\nCoombs was MP for Swindon from 1983 until 1997 when the seat was divided by boundary changes. Coombs stood in the new Swindon South seat but lost to Labour's Julia Drown. He stood again for the seat in 2001, but was unsuccessful.\nCoombs' Parliamentary term coincided with Swindon being the centre of a technology boom. Sir Tim Berners Lee developed the idea of the World Wide Web while at the Science and Engineering Research Council (SERC) in Swindon. Coombs served as Treasurer of PITCOM, the Parliamentary Information Technology Committee and as Parliamentary Private Secretary (PPS) to Rt. Hon Kenneth Baker, MP, Minister of Information Technology in the Department of Trade and Industry, and as PPS to Baker during his 1984–85 term as Minister for the Environment. He later served as PPS to Rt. Hon Ian Lang, MP during his terms as Secretary of State for Scotland (1992–1995) and President of the Board of Trade (1995–1997). Coombs also served as Parliamentary advisor to the UK Cable Television Association, representing at the time the constituency with the highest cable penetration in the country. He was also Chairman of the Conservative Backbench Tourism Committee and a member of the British Recording Industry Association's All-Party Parliamentary Group and the Select Committee on Employment. Since leaving Parliament, he has kept active in the music sphere as a trustee of the Ralph Vaughan Williams  Society and organizer of the Vaughan Williams exhibition in the composer's home village of Down Ampney.", "link_mentions": [{"page": "Coombs", "response": ["* Simon Coombs (born 1947), British politician"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Simon Coombs"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Simon Coombs"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Simon Coombs"]}, {"page": "David Stoddart, Baron Stoddart of Swindon", "response": ["Stoddart became the Labour Member of Parliament for Swindon in 1970, but in 1983 he lost his seat to the Conservative Simon Coombs.  Stoddart was a government whip from 1975 to 1978, PPC to the Housing Minister 1974–75 and Front Bench opposition spokesman on Trade and Industry."]}, {"page": "Simon Christopher Coombs", "response": ["#REDIRECTSimon Coombs"]}, {"page": "Swindon (UK Parliament constituency)", "response": ["|| 1983 || Simon Coombs || Conservative"]}, {"page": "Jo-Anne L. Coe", "response": ["She was born Jo-Anne Lee Johnson in Coronado, California, daughter of Admiral Roy L. Johnson, former Commander in Chief, United States Pacific Fleet (1965-67), and the former Margaret Louise Gross. While in college, she was briefly married to Benjamin Plaisted Coe and had one daughter, Kathryn Coe Coombs (1953-2011), who was married to British Member of Parliament Simon Coombs from 1983 to 2002."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Simon Coombs; MP for Swindon (1983–1997)"]}, {"page": "Rate-capping rebellion", "response": ["After the rate-capping of Thamesdown was announced, the Member of Parliament for Swindon Simon Coombs (who was Parliamentary Private Secretary to Kenneth Baker, the local government minister) pressed the council to use the appeal mechanism provided in the Rates Act 1984. The ruling Labour group maintained the unity of the capped councils by refusing to appeal, and on this issue had the support of Conservative councillors.Hugh Clayton, \"Forum plan may end Tory GLC discord\", The Times, 17 September 1984, p. 2. However the leadership of the Labour group was relatively moderate and wary of the 'no rate' strategy. Thamesdown seemed to some observers an odd target for capping; The Times' correspondent reported local rumours that it had been selected for capping in the hope that it might appeal and be removed, thereby damaging the policy of confrontation.Hugh Clayton, \"Why the axe fell on Hinton Parva\", The Times, 8 December 1984, p. 3."]}, {"page": "Robert Buckland", "response": ["In 2005, Buckland was selected as the Conservative Party's prospective Parliamentary Candidate for South Swindon, replacing former MP Simon Coombs who had represented Swindon between 1983 and 1997, and had unsuccessfully contested the seat in 2001. At the 2005 general election, Buckland lost to Labour candidate Anne Snelgrove, who polled 17,534 votes to his 16,181, a narrow majority of 1,353 votes."]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Simon Coombs"]}]}}