{"wiki_id": "http://www.wikidata.org/entity/Q7519181", "itemLabel": "Simon Law", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Law", "wikipedia_page": {"main": "Simon Law (born 28 May 1961, in Luton, England) is a producer, keyboardist and songwriter for Soul II Soul.", "link_mentions": [{"page": "Guru's Jazzmatazz, Vol. 1", "response": ["The album combines a live jazz band performance with hip hop production and rapping. It features contributions from singers N'Dea Davenport, Carleen Anderson, Dee C Lee, French rapper MC Solaar, and musicians Simon Law, Branford Marsalis, Courtney Pine, Donald Byrd, Gary Barnacle, Lonnie Liston Smith, Ronny Jordan, Roy Ayers and Zachary Breaux."]}, {"page": "Soul II Soul", "response": ["By 1988, the official lineup was Jazzie B, Caron Wheeler, Nellie Hooper, Simon Law, Doreen Waddell, Rose Windross, Daddae, Aitch B, and Jazzie Q. They released their first single, \"Fairplay\", with Rose Windross on lead vocals, recorded at the Africa Centre. where the collective hosted a regular Sunday-night residency. The song charted at number 63 on the UK Singles Chart, while their follow-up single \"Feel Free\", which featured Doreen on lead vocals, charted at number 64.", "* Simon Law – producer, keyboards, drums (1988)"]}, {"page": "Caron Wheeler", "response": ["In 2016, Soul II Soul released a single \"A New Day\", featuring Louie Vega, which is credited to Caron Wheeler and Jazzie B. In November 2016, the group released a live album titled Origins: The Roots of Soul II Soul.Origins: The Roots of Soul II Soul - Soul II Soul (Overview). AllMusic. Retrieved on July 11, 2017 In 2017, Wheeler made an appearance on her former Soul II Soul colleague Simon Law's album Look to the Sky on the lead single \"Morning Love\"."]}, {"page": "Vol. II: 1990 – A New Decade", "response": ["*Simon Law - keyboards (uncredited)"]}, {"page": "Back to Life (However Do You Want Me)", "response": ["Category:Songs written by Simon Law"]}, {"page": "Precious (Chanté Moore album)", "response": ["Precious is the debut studio album by American singer Chanté Moore. It was released on September 29, 1992, through Silas Records and MCA Records. in the United States. The album featured production from Simon Law, Bebe Winans, George Duke, among others. It was preceded by the release of the singles \"Love's Taken Over\" and \"It's Alright\". Two further singles were subsequently released from the album, \"Who Do I Turn to\" and \"As If We Never Met\".", "Category:Albums produced by Simon Law"]}, {"page": "A Love Supreme (Chanté Moore album)", "response": ["A Love Supreme is the second album by American singer Chanté Moore, released on November 15, 1994, through Silas Records and MCA Records. The album features production from Simon Law, Moore, Ross Anderson, Jimmy Jam and Terry Lewis, Kenneth Crouch, Kipper Jones, Tricky Stewart, among others.", "Category:Albums produced by Simon Law"]}, {"page": "This Moment Is Mine", "response": ["This Moment Is Mine is the third album by American singer Chanté Moore. The album was released on May 25, 1999, through Silas Records and MCA Records. It was Moore's first album release in four and a half years after her previous album, A Love Supreme. The album featured production from Rodney Jerkins, Simon Law, Moore, Robin Thicke, Jermaine Dupri, Jimmy Jam and Terry Lewis, among others.", "Category:Albums produced by Simon Law"]}, {"page": "Shutterbugg", "response": ["Category:Songs written by Simon Law"]}, {"page": "Arlene Bishop", "response": ["Arlene Bishop was born in Churchill, Manitoba and raised in Ottawa, Ontario.  She currently resides in Toronto. As a recording artists Bishop has placed several songs in film and television. Most notably her song \"98 Points\" has appeared in New Waterford Girl, The Michael Jackson Story and The Man in the Mirror for VH1. As a first time music producer Bishop (along with Scott Dibble), released \"Begin Again\" with two parts: Part One as a voice production with acoustic guitar  and Part Two with an array of special guests that included Amin Bhatia, Blair Packham, Simon Law (Soul II Soul) and Will Ackerman.  The resulting album is titled \"Twenty Four is Twelve Twice or Twenty Four for Short\".  In 2017 Bishop assembled a vocal orchestra she called The Spirit of Adventure and recorded a live concert album called \"Together Tonight\" and in 2019 she discovered and released a bootleg recording from 1992 at The Cabana Room in Toronto."]}, {"page": "Gary Barnacle", "response": ["In 2016 and 2017, Barnacle worked with writer/producer Simon Law on two projects :- Laid-Back Beats album (incl. The Ace/Deep in It/Be You/My Destiny - all featuring Ruinz Ason) and Simon's first solo album Look to the Sky on Dome Records (incl. the title track featuring Jazzie B, on which Gary played Tenor/Alto Saxes and the first two singles :- 'Morning Love' featuring Caron Wheeler - with Gary on Flutes - and 'Fire on Fire' featuring Lain Gray, with brass by the Blackjack Horns (Nik Carter/Jack Birchwood/G.B.) arranged and engineered by Gary Barnacle @ 241 Studios (aka. Barnacle's Barn) . Fire on Fire was written by Simon Law/Lain Gray/Gary Barnacle - with the single remixes by Nigel Lowis (Release date :- 4 August 2017).", "In 2018 Barnacle participated in the Soft Cell reunion concert at the O2 on 30 September, along with Jack Birchwood (Trumpet) from the Blackjack Horns. This event was filmed and recorded and was released as a live album and DVD in 2019. Also, 2018 saw the release of another single on Dome Records from Simon Law :- Look to the Sky (NK OK and Blue Lab Beats Remix) Feat. Jazzie B and Lain Gray with Gary Barnacle on Tenor and Alto Saxes. He also played Sax on the Geoff Everett album Night Patrol which was released in 2018.", "* Simon Law"]}, {"page": "List of songs recorded by JoJo", "response": ["| Jazzie BCaron WheelerNellee HooperSimon Law"]}, {"page": "List of Unsung episodes", "response": ["| Interviews with Chante Moore, Fred Moultrie, Kevin Ross, Felipe Darrell, Laney Stewart, Keith Washington, Terry Ellis (of En Vogue), Simon Law, Ernie Singleton, Vassal Benford, Donnie Simpson, Kurupt, Von McAlpin, Kiki Shepard, Cheryl Cobb-DeBrosse, Jeff Sharp, Michael Mauldin, and Jamie Foster Brown."]}, {"page": "2012 Summer Olympics opening ceremony", "response": ["| Jazzie B, Caron Wheeler, Nellee Hooper, Simon Law"]}, {"page": "Gary Barnacle discography", "response": ["* 1991 Hands of Time by Kazzing (Love Jones) (Prod. Simon Law)", "* 1991 Chills by Kazzing (Love Jones) (Prod. Simon Law)", "* 1992 Silent Way by Angie Giles (Simon Law remix)", "* 1993 Come Undone (Simon Law Mix) by Duran Duran", "* 1995 Given You All by Kenny Thomas (Prod. Simon Law)", "* 2016 Laid-Back Beats - by Various (incl. \"The Ace\" - composed by Simon Alban Law/Ruinz Ason/Jennifer Dawn Schaffer/\"Deep In It\" - composed by Simon Alban Law/Ruinz Ason/\"Be You\" - composed by Simon Alban Law/Ruinz Ason/\"My Destiny\" - composed by Simon Alban Law/Ruinz Ason. Performed by Simon Law and Ruinz Ason - with Saxes by Gary Barnacle) (digital download album on Music House Int./EMI Production Music) ", "* 2017 Look To The Sky by Simon Law (Horns on Fire On Fire by the Blackjack Horns :- Nik Carter/Gary Barnacle - Saxes/ Jack Birchwood - Trumpet/Trombone) (album)", "* 2018 Look To The Sky (NK-OK and Blue Lab Beats Remix) by Simon Law feat. Jazzie B and Lain Gray - with Gary Barnacle on Tenor/Alto Saxes (which were engineered and played by G.B. @ 241 Studios UK).", "* 1990 \"Treat Me Good\" by Yazz (written by Simon Law/Yazz/Yvonne Turner - produced by Simon Law - horn section and solo sax by Gary Barnacle) (single)", "* 1990 \"First Time Ever [Louie-Louie Remix]\" by Joanna Law (Produced by The Funky Ginger (Simon Law) and remixed by Louie-Louie) (featuring Gary Barnacle on Saxophone & Flute with Steve Barnacle - Bass & Programming) (12 inch single)", "* 1991 \"Circle of One\" by Oleta Adams (cd maxi single - Track 3:- \"Circle Of One\" ('T' Remix) Produced by The Funky Ginger (Simon Law) and Dr. Ross, with Sax/Flute by Gary Barnacle) (single)", "* 1992 \"Don't Sweat The Technique\" by Eric B and Rakim (US 12-inch single:- A1. Funky Ginger Club Mix. A2. Funky Ginger Radio Edit. B1. UK Flavor Club Version. B2. UK Flavor Single Edit. Saxophones by Gary Barnacle) (Prod. by Simon Law and Mr. Lee.)  ", "* 1992 \"Self Control\" on Sing by Vivienne McKone (12 inch single) (Prod. Simon Law)", "* 1992 \"How Can You Tell Me It's Over ?\" by Lorraine Cato (Simon Law 7 inch mix & Simon Law 12 inch mix) (Flutes by Gary Barnacle) (single)", "* 1992 \"Cash\" (London Remix) by Tonton David (Prod. Simon Law) (Feat. Gary Barnacle on Saxes/Flute) (single)", "* 1994 \"Save Our Love\" by Eternal (band) (Simon Law Mix with brass by Gary Barnacle - Sax/ Dennis Rollins - Trombone) (12\" single)", "* 2017  \"Morning Love\" by Simon Law featuring Caron Wheeler. Written by S.Law/C.Wheeler. (Flutes - engineered and played by Gary Barnacle) (on Dome Records)  (single)", "* 2017  \"Fire On Fire\" (Nigel Lowis Remixes) by Simon Law featuring Lain Gray. Written by S.Law/L.Gray/G.Barnacle. (with Blackjack Horns :- Nik Carter/Gary Barnacle - Saxes/ Jack Birchwood - Trumpet & Trombone. Horns arranged and engineered by Gary Barnacle). (on Dome Records)  (single)", "* 2017  \"Rocket Ship\" by Simon Law featuring Lain Gray (with Flutes by Gary Barnacle) (on Dome Records) (single)"]}, {"page": "The Chimes (album)", "response": ["*Simon Law – piano (tracks 3, 4, 5 & 8)"]}, {"page": "Tenderland", "response": ["# \"Now That Love's Taken Over\" (Chanté Moore, Simon Law) – 4:37"]}]}}