{"wiki_id": "http://www.wikidata.org/entity/Q7519344", "itemLabel": "Simon Messingham", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Messingham", "wikipedia_page": {"main": "Simon Messingham is a British science fiction writer, and a comedy writer and performer, who has written six Doctor Who novels and another Doctor Who story released as a BBC Audio Drama. Messingham has also witten an original novel, Sirens, which was released in 2017. He also wrote and performed in the cable television programmes The Dave Saint Show and Tales of Uplift and Moral Improvement Messingham is also an actor. They went to drama school and have worked in the theatre.\n\n", "link_mentions": [{"page": "Romana (Doctor Who)", "response": ["In the BBC Books Eighth Doctor Adventures novels, Romana undergoes a second regeneration, and her new incarnation (Romana III, whose appearance was modelled on silent movie actress Louise Brooks) is far less sympathetic and far more ruthless than the other two. This third incarnation pursues the Eighth Doctor in a story arc relating to the Future War, a War between the Time Lords and an as-yet-unidentified enemy, seeking to use his new companion Compassion – who has been unintentionally mutated into a Type 102 TARDIS in the aftermath of the destruction of the Doctor's own ship – as breeding stock for the new sentient TARDISes in the Future War. With the Doctor refusing to allow the Time Lords to make Compassion a slave, he, Compassion and fellow companion Fitz Kreiner go on the run between The Shadows of Avalon and The Ancestor Cell, the final confrontation on board the Doctor's believed-destroyed original TARDIS resulting in the obliteration of Gallifrey and the apparent retroactive wiping out of the Time Lords from history. A flashback in the final Eighth Doctor Adventures novel The Gallifrey Chronicles suggests that Romana is killed by Faction Paradox skulltroopers just before Gallifrey's destruction. However, it is hinted in Tomb of Valdemar by Simon Messingham that Romana may be one of a few Time Lords who survived this cataclysm, possibly in a fourth incarnation and The Gallifrey Chronicles itself suggests that the Doctor will eventually restore Gallifrey and all the dead Time Lords whose minds are stored in the Matrix, in time for its destruction again in the Time War.", "*Tomb of Valdemar by Simon Messingham (Romana I; may also appear in a later incarnation)"]}, {"page": "1994 in literature", "response": ["*Simon Messingham – Strange England"]}, {"page": "Worthing", "response": ["* Simon Messingham, science fiction writer"]}, {"page": "Virgin New Adventures", "response": ["|29 || Strange England ||Simon Messingham || Ace, Bernice || August 1994"]}, {"page": "Bernice Summerfield", "response": ["*Strange England by Simon Messingham"]}, {"page": "Bretton Hall College of Education", "response": ["*Simon Messingham  "]}, {"page": "Tegan Jovanka", "response": ["*Zeta Major by Simon Messingham"]}, {"page": "Nyssa (Doctor Who)", "response": ["*Zeta Major by Simon Messingham"]}, {"page": "Ace (Doctor Who)", "response": ["*Strange England by Simon Messingham"]}, {"page": "Zoe Heriot", "response": ["*The Indestructible Man by Simon Messingham"]}, {"page": "Jamie McCrimmon", "response": ["*The Indestructible Man by Simon Messingham"]}, {"page": "Sabbath (Doctor Who)", "response": ["*The Infinity Race by Simon Messingham"]}, {"page": "Eighth Doctor Adventures", "response": ["|18 || The Face-Eater||Simon Messingham || January 1999", "|61 || The Infinity Race||Simon Messingham || Fitz, Anji, Sabbath || November 2002"]}, {"page": "Fifth Doctor", "response": ["*Zeta Major by Simon Messingham"]}, {"page": "Past Doctor Adventures", "response": ["|13 || Zeta Major || Simon Messingham || 5th || Tegan and Nyssa || July 1998", "|29 || Tomb of Valdemar || Simon Messingham || 4th || Romana I and K-9 || February 2000", "|69 || The Indestructible Man || Simon Messingham || 2nd || Jamie and Zoe || November 2004"]}, {"page": "Fourth Doctor", "response": ["* Tomb of Valdemar by Simon Messingham"]}, {"page": "New Series Adventures", "response": ["|26 ||The Doctor Trap|| Simon Messingham ||Tenth|| Donna Noble || 4 September 2008 ||||Russell Tovey", "|5 ||The Day of the Troll|| Simon Messingham ||Tenth|| None || David Tennant || 8 October 2009 ||  "]}, {"page": "Zeta Major", "response": ["Zeta Major is a BBC Books original novel written by Simon Messingham and based on the long-running British science fiction television series Doctor Who. It features the Fifth Doctor, Tegan, and Nyssa. It is a sequel to the television serial Planet of Evil.", "Category:Novels by Simon Messingham"]}, {"page": "Tomb of Valdemar", "response": ["Tomb of Valdemar is a BBC Books original novel written by Simon Messingham and based on the long-running British science fiction television series Doctor Who. It features the Fourth Doctor, Romana I, and K-9.", "Category:Novels by Simon Messingham"]}, {"page": "The Infinity Race", "response": ["The Infinity Race is a BBC Books original novel written by Simon Messingham and based on the long-running British science fiction television series Doctor Who. It features the Eighth Doctor, Fitz and Anji.", "Category:Novels by Simon Messingham"]}, {"page": "Strange England", "response": ["Strange England is an original novel written by Simon Messingham and based on the long-running British science fiction television series Doctor Who. It features the Seventh Doctor, Ace and Bernice. A prelude to the novel, also penned by Messingham, appeared in Doctor Who Magazine #215.", "Category:Novels by Simon Messingham"]}, {"page": "The Face-Eater", "response": ["The Face-Eater is an original novel written by Simon Messingham and based on the long-running British science fiction television series Doctor Who. It features the Eighth Doctor and Sam.", "Category:Novels by Simon Messingham"]}, {"page": "Captain Scarlet (character)", "response": ["In the BBC Past Doctor Adventures series – a series of novels based on Doctor Who, featuring the first seven incarnations of the Doctor in original adventures – the novel The Indestructible Man by Simon Messingham draws heavily on Gerry Anderson's shows in general and Captain Scarlet in particular, with an organization known as 'PRISM' acting against the mysterious Myloki with the aid of Captain Grant Matthews, transformed into an indestructible state when he was killed and duplicated by the Myloki to such a degree that his original personality asserted itself. In keeping with the adult nature of this interpretation, Grant Matthews is presented as being tormented by his immortality, various sources noting that he is technically only a copy of Grant Matthews rather than being the original man in a new body, ideas that may have been suggested but never analysed regarding Captain Scarlet's nature in the original show."]}, {"page": "List of Doctor Who novelists", "response": ["* Simon Messingham"]}]}}