{"wiki_id": "http://www.wikidata.org/entity/Q7518339", "itemLabel": "Simon Brint", "itemDescription": "English musician and comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Brint", "wikipedia_page": {"main": "Simon Tracey Brint (26 September 1950 – 29 May 2011) was a British musician, best known for his role as part of the comedy duo Raw Sex with Rowland Rivron.  He also composed for many British TV comedy and drama programmes.", "link_mentions": [{"page": "List of British comedians", "response": ["*Simon Brint (born 1950), comic and composer of themes for numerous TV programmes"]}, {"page": "French and Saunders", "response": ["The first series was intentionally set up to look like a low-budget variety show in which the duo were constantly attempting grandiose stunts and often failing miserably. Often a \"famous\" guest star would be brought on but then treated badly. Also featured during this series were a troupe of geriatric dancers, called The Hot Hoofers, and a bongos/keyboard music duo called Raw Sex, actually Comic Strip collaborators Simon Brint and Rowland Rivron in character as stepfather and stepson Ken and Duane Bishop respectively. Alison Moyet and Joan Armatrading each appeared in one episode. The dancing and music were included to fulfill the series' mandate as a light entertainment series to include \"a certain amount of variety\" rather than pure comedy. The show-within-a-show premise was dropped with the second series in 1988.", "|Simon Brint"]}, {"page": "Neil Innes", "response": ["In late 2010, Innes announced the formation of the Idiot Bastard Band, a comedy musical collective featuring himself, Adrian Edmondson, Phill Jupitus, Simon Brint and Rowland Rivron. The band debuted, with an 8-week residency, at the Wilmington Arms in Clerkenwell, London in December, playing a range of comedy songs old and new, with deliberately little rehearsal."]}, {"page": "Coupling (British TV series)", "response": ["Mari Wilson performed the song \"Perhaps, Perhaps, Perhaps\", written by Osvaldo Farrés and Joe Davis, to accompany the opening and closing credits. Simon Brint composed and arranged the incidental music. The title sequence, as Mark Lawson described, consists of \"brightly coloured and suggestive shapes swirl around the screen: circles, curves, and angles tumble like limbs locked together in sex. As the names of the actors discreetly sweep across in black lettering, the bright shapes form the title: Coupling.\" Lawson calls the design \"elegant simplicity, showing how a clever choice of theme tune can evoke an atmosphere and set a pace to which images can be cut.\" The colour scheme was changed for the fourth series, although the basic design remained."]}, {"page": "Blue Peter", "response": ["* Simon Brint: September 1989 to September 1992", "* Simon Brint: September 1992 to September 1994"]}, {"page": "Arnold Brown (comedian)", "response": ["He appeared as himself in the 1994 partially-improvised comedy film  There's No Business..., starring the comedy duos Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys. He has appeared in Stewart Lee's Comedy Vehicle in various roles; and in \"Torture\" (from Saturday Live), he is the one who has gone through the Chinese water torture beforehand."]}, {"page": "Stephen Frost", "response": ["In 1994 the Oblivion Boys starred opposite the comedy duo Raw Sex (Simon Brint and Rowland Rivron) in the partially-improvised comedy film There's No Business...."]}, {"page": "2000 in British music", "response": ["*Simon Brint with Kenny G - Monarch of the Glen"]}, {"page": "London's Burning (TV series)", "response": ["The London's Burning theme used between Series 1–10 was composed by Simon Brint, Rowland Rivron, and Roddy Matthews; it was loosely based on the children's round of the same title (sung by a group of schoolchildren in the pilot film.) Series 11–13 used a theme composed by Warren Bennett (son of The Shadows drummer Brian Bennett); revamped opening titles created by Capital FX were introduced. The theme tune and opening titles were updated again for Series 14. The titles were made to fit the look ITV were giving to shows at the time. The series 14 theme was composed by Stuart Hancock and Toby Jarvis. Hancock also composed the original incidental music score to all episodes of series 14."]}, {"page": "Eat the Rich (film)", "response": ["# Simon Brint – \"Terrorists\"", "# Simon Brint – \"Arriba Salsa\"", "# Simon Brint – \"Car Approach\""]}, {"page": "Rowland Rivron", "response": ["Rivron played drums on Fat Les's 1998 single \"Vindaloo\". As one half of the band \"Raw Sex\" (with Simon Brint) he also featured regularly on BBC TV's French and Saunders show."]}, {"page": "Girls on Top (British TV series)", "response": ["* Simon Brint and Rowland Rivron as Shelley's backing band (\"Cancel Toast\")"]}, {"page": "Penny Smith", "response": ["Smith appeared briefly as herself in the partially-improvised comedy 1994 film There's No Business..., which starred the comedy duos Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys."]}, {"page": "Cash (The Young Ones)", "response": ["The episode features a performance from Ken Bishop's Nice Twelve, a one-off conglomerate of high-profile rock musicians and theme writers, including Jools Holland, Simon Brint, Stewart Copeland and Chris Difford performing \"Subterranean Homesick Blues\" by Bob Dylan. For contractual reasons, this performance was edited out of most early home video releases in both the UK and US. On the original DVD releases, along with the edit, the scenes of the main cast that take place during the performance are also cut. The band's name is also edited out of the credits, but rather than simply erase the name, the portion of credits with the group name is cut, with the credits before and after that intersected by a thick orange line, which also shows two sets of footage playing. However, when a total list of all cast members of all twelve episodes of the series are in the credits for \"Summer Holiday\", the names of three of the musicians are not taken out."]}, {"page": "Mark Arden", "response": ["Arden was born in Newbury, Berkshire. He and Frost came to prominence in the late 1970s alternative comedy boom, and became recognisable to a national audience with regular spots on Saturday Live. In the early 1980s, they were instrumental in the forming of the long-running north London comedy show News Revue, and shortly afterwards began appearing as a pair in episodes of series such as The Black Adder and The Young Ones; they are perhaps most remembered for a series of commercials for Carling Black Label lager, one of which involved Arden and Frost appearing in the nude. Arden continued to perform with Frost in comedy clubs, although he did not follow his partner into the genre of improvisation. Nevertheless, he featured as the chauffeur Johnny Blackpool (a paranoid ex-soldier) in the partially-improv 1994 comedy film There's No Business..., opposite Raw Sex (Simon Brint and Rowland Rivron)."]}, {"page": "Lee Cornes", "response": ["He played a major role as the harassed talent agent Dickie Valentino in the 1994 partially-improvised comedy film There's No Business..., alongside comedy duos Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys (Stephen Frost and Mark Arden)."]}, {"page": "Kevin Turvey", "response": ["In 1982 a one-off mockumentary, Kevin Turvey the Man Behind the Green Door was broadcast. In this, a BBC 'fly-on-the-wall' camera crew followed Kevin for a week as he went about his \"investigations.\" Robbie Coltrane played Mick the lodger (who was AWOL from the Army), Ade Edmondson played Keith Marshall, and Gwyneth Guthrie played Kevin's mum. Roger Sloman appeared as a psychotic park-keeper.  Making guest appearances, as part of Kevin's band \"20th Century Coyote\", were Simon Brint and Rowland Rivron, known as Raw Sex."]}, {"page": "Gilson Lavis", "response": ["Lavis now tours around the United Kingdom with Jools Holland, his long-term musical partner. They both appeared (uncredited) as members of \"The Nice Twelve\" in the 1994 partially-improvised comedy film There's No Business... starring Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys."]}, {"page": "The Winjin' Pom", "response": ["Music Composed and Arranged by: Simon Brint, Roddy Matthews with Richard Vranch (eps 2 & 4)"]}, {"page": "Paul Mark Elliott", "response": ["As the crazed guitarist Bernie Cosmos he destroyed VU meters in the partially-improvised comedy 1994 film There's No Business..., starring Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys."]}, {"page": "Who Else!", "response": ["*Simon Brint – editing (track 1), production assistance (track 10)"]}, {"page": "Rent (song)", "response": ["*The TV series French and Saunders (BBC, 1987-2017) included a parody of this song, performed by Raw Sex (collaborators Simon Brint and Rowland Rivron), who played the parts of Neil Tennant and Chris Lowe in the sketch."]}, {"page": "Tilly Vosburgh", "response": ["As a child, Tilly began attending after-school classes at the Anna Scher Theatre. This soon led to minor roles in British television series, playing roles in The Prince and the Pauper, Grange Hill and Crown Court. She went on to star in the films Phoelix and Radio On in the early Eighties. Further TV roles included appearances in The Gentle Touch, Maria Marten, Gulliver in Lilliput, Treatment, Meantime, You'll Never See Me Again, Will You Love Me Tomorrow, Strong Poison and Minder, throughout the Eighties. Vosburgh also featured in the films The Missionary, The Pirates of Penzance, and Eric the Viking in the Eighties. In the Nineties, she appeared in Poirot, A Touch of Frost, five episodes of The Men's Room as Delia, and as Betty Mason in The Darling Buds of May Christmas Special in 1991; and in the 1994 film Shopping. She featured in the comedy series Full Stretch in 1993. One role that propelled her towards stardom was as 'Tilly' in the partially-improvised comedy film  There's No Business... with Raw Sex (Simon Brint and Rowland Rivron) and The Oblivion Boys. She played Ella Twite in six episodes of Blackhearts in Battersea (1995–1996)."]}, {"page": "Raw Sex", "response": ["*a British comedy musical group consisting of Rowland Rivron and Simon Brint, featured regularly on BBC TV's French and Saunders show"]}, {"page": "2011 in the United Kingdom", "response": ["**Simon Brint, musician (b. 1950)"]}, {"page": "Ade Edmondson", "response": ["In 2010, he founded The Idiot Bastard Band with Simon Brint, Rowland Rivron, Neil Innes and Phill Jupitus. The Idiot Bastard Band perform original comedy songs as well as cover versions, and their shows often feature guest performers. The group continued to perform following the death of Brint in 2011."]}, {"page": "Deaths in May 2011", "response": ["*Simon Brint, 60, British musician, suicide."]}, {"page": "Simon Wallace", "response": ["Wallace collaborated with the film and television composer Simon Brint from 1980 until Brint's death in 2011. They composed music for television series including Absolutely Fabulous, Coupling, French and Saunders, Murder Most Horrid, All Rise For Julian Clary, The Ruby Wax Show, Bosom Pals, The All New Alexie Sayle Show, The Clive James Show and The Ben Elton Show.. In 1982 they scored A Shocking Accident which won 1983 Oscar for 'best live action short  their last  broadcast work together was the music for The One Ronnie in December 2010. Independently of Brint he scored the 1982 David Leland television drama R.H.I.N.O., the 1998 series Duck Patrol,  and the documentary series Famous Authors.  He worked on two series of The Armstrong and Miller Show (2007-2009 BBC1) arranging and playing music for the Brabbins and Fyffe sketches."]}, {"page": "2011 in British music", "response": ["*29 May – Simon Brint, musician, composer, actor and comedian (Raw Sex), 60 (suicide)"]}, {"page": "1950 in British music", "response": ["*26 September – Simon Brint, comedy musician and composer (died 2011)"]}, {"page": "Simon Tracey Brint", "response": ["#REDIRECT Simon Brint"]}, {"page": "List of 2010s deaths in rock and roll", "response": ["| Simon Brint || style=\"text-align:center;\"|60 || May 29, 2011 || || Suicide"]}, {"page": "Mr Thomas", "response": ["Set design was by Matthew Duguid and John Pope, music by Simon Brint."]}]}}