{"wiki_id": "http://www.wikidata.org/entity/Q7519073", "itemLabel": "Simon Jordan", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Jordan", "wikipedia_page": {"main": "Simon Jordan (born 24 September 1968) is an English businessman who made his fortune in the mobile phone industry. In 2000, he purchased Crystal Palace Football Club and remained chairman of the club until administration in early 2010. In 2002, he co-founded and funded the car magazine Octane, selling his 50% shareholding in 2006. In 2006, he opened the restaurant Club Bar and Dining in London's Warwick Street, Jordan sold it to the Ottolenghi Group in 2010 who renamed the restaurant Nopi. Jordan is currently known for his role as a co-presenter on the weekday mid-morning TalkSPORT programme, White and Jordan.", "link_mentions": [{"page": "Charlton Athletic F.C.", "response": ["In 1985, Charlton was forced to ground-share with Crystal Palace after safety concerns at The Valley. They played their home fixtures at the Glaziers' Selhurst Park stadium until 1991. The arrangement was seen by Crystal Palace chairman Ron Noades as essential for the future of football, but it was unpopular with both sets of fans. Charlton fans campaigned for a return to The Valley throughout their time at Selhurst Park. In 2005, Palace were relegated by Charlton at the Valley after a 2–2 draw. Palace needed a win to survive. However, with seven minutes left, Charlton equalised, relegating their rivals. Post-match, there was a well-publicised altercation between the two chairmen of the respective clubs, Richard Murray and Simon Jordan. Since their first meeting in the Football League in 1925, Charlton have won 17, drawn 13 and lost 26 games against Palace. The teams last met in 2015, a 4–1 win for Palace in the League Cup."]}, {"page": "Thornton Heath", "response": ["*Simon Jordan, businessman"]}, {"page": "Crystal Palace F.C.", "response": ["Terry Venables returned to Palace for a second spell as manager and the club competed in European competition during the summer when they played in the UEFA Intertoto Cup. Palace then went into administration in 1999, when owner Mark Goldberg was unable to sustain his financial backing of the club. Venables left and Steve Coppell took over again as manager. The club emerged from administration under the ownership of Simon Jordan, and Coppell was replaced as manager by Alan Smith for a second time. Palace were almost relegated in Jordan's first season, in 2000–01. Smith was sacked in April and long-serving coach Steve Kember took over as caretaker manager and he managed to win the two remaining fixtures that would guarantee Palace survival, with Dougie Freedman scoring the winner in the 87th minute on the final day of the season, securing a 1–0 victory over Stockport County. Steve Bruce was appointed manager for the 2001–02 season. A good start to the season gave Palace hope for a promotion challenge, but Bruce attempted to walk out on the club after just four months at the helm to take charge of Birmingham City.Stewart, Colin. \"Bruce Left in Limbo as Palace Turn Down Resignation.\" The Scotsman: 3. 3 November 2001. ProQuest. Web. 31 May 2013. Archived on 3 June 2013. After a short spell on 'gardening leave', Bruce was eventually allowed to join Birmingham, succeeded by Trevor Francis, who had ironically been his predecessor at the Midlands club.", "Following that relegation, Simon Jordan was unable to put the club on a sound financial footing over the next few years, and in January 2010 Palace were once again placed in administration, this time by a creditor. Due to the Football League's regulations, the club were deducted ten points, and the administrators were forced to sell key players including Victor Moses and José Fonte. Neil Warnock had also departed as manager in the early part of 2010. He had been appointed in 2007, replacing the former Palace favourite Peter Taylor who had a brief spell as manager. Paul Hart took over as caretaker manager for the final weeks of the season. Survival in the Championship was only secured on the final day of the season after a memorable 2–2 draw at Sheffield Wednesday, which was itself relegated as a result.", "Local builder Arthur Wait established a consortium of seven other businessmen to purchase the club in 1949, and they initially rotated the chairmanship. In 1958 Wait became the chairman, before being replaced by Raymond Bloye in 1972.\"New chairman ends freeze at Palace.\" Times [London, England] 27 October 1972: 10. The Times Digital Archive. Web. 29 May 2013.\"New Man Bloye Kills 'Moneybags' Tag\", Croydon Advertiser, 27 October 1972, p.58 \"Twenty two years ago ... seven men formed a board ... (n)ow the last of the seven, Arthur Wait, steps (down)\" Bloye's ownership lasted until 26 January 1981, when property developer Ron Noades and his consortium took control of the club. Noades eventually sold the club to Mark Goldberg on 5 June 1998, becoming the second longest serving Palace chairman behind Sydney Bourne. However, Noades did maintain ownership of Selhurst Park, leasing it to the club to use. Goldberg's tenure of the club was not a success and Palace entered administration in March 1999. Although the fans established a group called the Crystal Palace Supporters' Trust in a bid to gain control of the club, millionaire and lifelong fan Simon Jordan negotiated a deal with creditors and the administrator, and a new company, CPFC 2000 took control. This company entered administration in January 2010, and it was not until June of that year that a takeover was completed by a consortium of four wealthy fans known as CPFC 2010.King, pp. 42–60"]}, {"page": "Neil Warnock", "response": ["Warnock spoke to Milan Mandarić about the vacant managerial role at Leicester City in the summer, but was never handed the job. Simon Jordan spoke to Warnock about taking over at Crystal Palace following the sacking of Peter Taylor and, after initially not being keen over the job, he returned to football management with Palace on 11 October 2007. Having his personal friend Simon Jordan as owner and chairman was certainly a help in him getting the job. Jones returned from his own sabbatical to join Warnock's team as assistant. Under Warnock and Jones, Palace made a massive turn-around, moving from relegation battlers to promotion contenders in the space of six months, with Warnock's use of youngsters a major factor in the improved performances and results. Palace made the play-offs in the end, but were beaten at the semi-final stage by Bristol City, who went on to lose to Hull City in the final."]}, {"page": "Selhurst Park", "response": ["When Mark Goldberg bought Crystal Palace, he bought just the club.  Former Palace chairman Ron Noades retained ownership of the Selhurst Park ground, having purchased it from the club in 1986. Chairman Simon Jordan took out a ten-year lease on the ground upon his purchase of the club in 2000, and Noades received rent from Palace. Wimbledon relocated to Milton Keynes in 2003, a section of their fans already having decamped to the newly established AFC Wimbledon in protest, when the old club were given permission by the FA to move in 2002.", "Palace chairman Jordan stated that he had completed a purchase of the freehold of Selhurst Park from Altonwood Limited (Ron Noades' company) for £12m in October 2006. However, Simon Jordan never owned the freehold or had any interest in it and his reasons for claiming he had bought it are unknown. Ownership was in fact held by Selhurst Park Limited, a joint venture between HBOS and the Rock property empire owned by Paul Kemsley, a former director of Tottenham Hotspur. In April 2008, a 25-year lease was granted to Crystal Palace at an annual rent of £1.2m."]}, {"page": "Graeme Souness", "response": ["In June 2006, the chairman of Crystal Palace, Simon Jordan, claimed he wished to discuss with Souness a role in managing the club following the departure of Iain Dowie. However, no contract materialized."]}, {"page": "Iain Dowie", "response": ["He remained at Palace when the club was relegated to the Championship despite rumours that he was approached by other Premier League clubs to take over. The only actual report of a club approaching Palace to speak to Dowie was when Portsmouth chairman Milan Mandarić approached Palace chairman Simon Jordan to speak to Dowie, in November 2005. Jordan refused this approach, and for the meantime Dowie remained at Selhurst Park."]}, {"page": "Clinton Morrison", "response": ["Over the summer transfer of 2002, Morrison was linked a move away from Crystal Palace, with Premier League clubs, including Birmingham City, were interested in signing him. But Manager Trevor Francis was willing to sell the player if the club signed a replacement, although Simon Jordan objected to this. With a tricky relationship becoming clear between Morrison and Trevor Francis, then Palace manager, it was Birmingham City who fought and won his signature, for £4.25 million, in exchange for Andrew Johnson.", "At the start of the 2006–07 season, Morrison scored his first goal of the season, in a 1–0 win against Leeds United on 13 August 2006. After the match, Manager Peter Taylor praised his performance despite lacking fitness that saw him placed on the substitute bench. His second goal of the season came a month later on 23 September 2006, in a 1–0 win against Coventry City. However, he found himself in a rift with Manager Peter Taylor that saw him placed on the substitute bench. But Crystal Palace's chairman Simon Jordan responded to the claims that the pair had not fallen out, with Taylor having dealt with Morrison over their differences.  He then managed to regain his first team place, making a number of starts as the club's first choice striker for the rest of the 2006. Morrison then added four more goals by the end of the year. This last until January when he found himself placed on the substitute bench, appearing in the club's four out of the club's six matches during the month. By February, Morrison regained his first team place as Crystal Palace's first choice striker once again. Towards the end of the 2006–07 season, Morrison scored six more goals, including three goals in two consecutive matches against Luton Town and Burnley. Despite failing to help the club reach the play–offs, he expressed his desire to stay at Crystal Palace. At the end of the 2006–07 season, Morrison went on to make forty–four appearances and scoring twelve times in all competitions, making him as the club's top scorer for the fifth time in his Crystal Palace's career."]}, {"page": "Steve Coppell", "response": ["Following the resignation of manager Terry Venables in January 1999, Coppell once again returned as the manager of Palace. By that time the club had severe financial problems. High earners like Venables and Lombardo had been removed to try and cut spending, and the club was close to going bankrupt. With relegation seeming a realistic possibility, he guided the club to respectable finishes of 14th and 15th in the league. In the 2000 close season Simon Jordan bought the club and replaced Coppell with Alan Smith, who had taken over from Coppell on his first resignation seven years earlier. Jordan said Coppell had done a \"fantastic job\", but the club needed to \"evolve or die\"."]}, {"page": "The Wright Stuff", "response": ["* Simon Jordan (2017–18)"]}, {"page": "Neil Ruddock", "response": ["He was also accused by Crystal Palace chairman, Simon Jordan in November 2005, of \"taking the team out and getting them wasted when we were fighting relegation\"."]}, {"page": "Wayne Routledge", "response": ["On 10 July 2008, Routledge was the subject of a scathing verbal attack from Crystal Palace chairman Simon Jordan. Jordan was giving an interview about now ex-Palace midfielder John Bostock, during which he used Routledge as an example of why he believed the youth player should not leave Palace to join Tottenham. He said Routledge \"grabbed the money\" of a Tottenham move before learning his trade at Palace, and had not become a first-teamer at any of his subsequent clubs."]}, {"page": "Andy Linighan", "response": ["After more than six years at Highbury, he was sold to Division One promotion chasers Crystal Palace for £110,000 in January 1997. He helped Palace as they won promotion to the Premiership that year as playoff winners. Linighan also in that year became the captain of the Eagles, but was unable to prevent them from being relegated straight back to Division One. He stuck with Palace during the club's financial problems, even after they were forced to loan him to Queens Park Rangers for the final stages of the 1998–99 season to reduce their wage bill. Linighan returned to the club after his loan spell as captain, and in his 38th year was voted as Crystal Palace's Player of the Year in 1999–2000. After a falling out with new owner Simon Jordan, he was given a free transfer in the autumn of 2000."]}, {"page": "Purley High School for Boys", "response": ["* Simon Jordan, businessman, former Chairman of Crystal Palace football club"]}, {"page": "Ron Noades", "response": ["Former Crystal Palace chairman Simon Jordan made public his intentions to either purchase and re-develop Selhurst Park, or move to a new stadium.  However, Noades announced in April 2006 that Jordan had not made any offers for the stadium, and that he had no intention of selling the stadium, either. Nonetheless, in October 2006, Jordan announced he had purchased the freehold of the stadium site four days previously for £12m, using an investment mechanism that kept his identity secret. It later turned out that this was incorrect and the freehold was owned by companies under the control of Paul Kemsley. Jordan announced in April 2008 that he had secured the football club a 25-year lease for Selhurst Park Stadium together with the option to purchase the freehold within that period."]}, {"page": "Alan Smith (football manager)", "response": ["One of Kevin Keegan’s first appointments on joining Fulham was to employ Smith as the club's new Academy Director, a role he held from 1997 to 2000. Smith resigned this position in the summer of 2000 to again replace Steve Coppell as Manager of Crystal Palace under new Chairman Simon Jordan."]}, {"page": "Kingswood, Surrey", "response": ["* Simon Jordan - Former owner of Crystal Palace Football Club"]}, {"page": "Steve Kember", "response": ["He stayed in that role until April 2001, when, with Palace once again facing relegation to the third tier, manager Alan Smith was sacked by new chairman Simon Jordan, and Kember was made caretaker for the remaining two games of the season. Palace were six points short of survival, and it seemed unlikely that relegation could be avoided."]}, {"page": "Andy Morrison", "response": ["In City's first game in Division One, they lost 1–0 to Wolverhampton Wanderers. Robbie Keane scored the only goal of the game. In City's second game in Division One, Morrison was famously sent off for sticking out his tongue at Stan Collymore in a 0–0 draw with Fulham. Morrison remonstrated angrily before leaving the pitch, pushing Collymore in the face as he left. Collymore mentioned the incident in his autobiography, stating that Morrison 'stuck his tongue in my mouth' and that he was one of three players (along with Andy Todd and Darren Purse) who sought to 'prove that they were real hard men when they were up against me'. City's first victory of the season came in 6–0 defeat of Sheffield United. Morrison's performances endeared him to then Scotland manager Craig Brown. Brown was reportedly interested in calling Morrison up to the international team to play in the UEFA Euro 2000 qualifying play-offs against England. However, twelve games into the season, Morrison picked up an injury, in a 2–1 victory against Port Vale. As a result, Morrison was not available to be picked by Brown for Scotland and he missed the rest of the 1999–2000 season. The season ended with City being promoted to the Premier League (a rare second successive promotion). Morrison spent 14 months attempting to return to the Manchester City team, even requesting that Royle loan him out to his former club Blackpool who were managed by Steve McMahon at the time. Morrison played 6 times and scored once (in a game against Hartlepool United) for Blackpool. In one of his appearances for Blackpool, they beat Kidderminster Harriers 4–1 with both Brett Ormerod and Paul Simpson scoring braces. Morrison then joined Crystal Palace (then managed by Alan Smith), on a months loan in October 2000, to continue improving his match fitness. Palace signed Morrison, on loan, as a replacement for Andy Linighan, who was sacked following a dispute with Palace Chairman Simon Jordan. At Crystal Palace, Morrison played alongside both Neil Ruddock and Steve Staunton in defence. Morrison made his debut for Palace in a 2–1 defeat to Birmingham City. In Morrison's second game for Palace, despite defending 'in a ruggedly efficient manner', they lost 3–1 to Fulham (with Louis Saha scoring once and Lee Clark scoring a brace for Fulham). Morrison subsequently played in a 3–2 defeat to Portsmouth and a 1–0 defeat to Grimsby Town After the defeat to Grimsby, Morrison farted during a team talk by Smith, enraging Simon Jordan. Morrison's final game for Palace was a 3–3 draw with Bolton Wanderers, in which Dougie Freedman and Clinton Morrison scored late goals to earn a point. Morrison returned to City at the end of his loan spell."]}, {"page": "Michelle Dewberry", "response": ["On 22 July 2020, Dewberry gave birth nine weeks early to her first child, a baby boy. Dewberry's partner and father of their son is businessman and former Crystal Palace Football Club owner Simon Jordan."]}, {"page": "Danny Kelly (journalist)", "response": ["After several seasons presenting The Full Time Phone-In on Saturday nights up to 2020, and hosting a Sunday evening show with ex-Crystal Palace owner Simon Jordan, he currently presents a Monday evening show called the PressBox, where he and the football editor of The Sun Sean Custis, are joined by \"a behemoth of Fleet Street to pick apart the stories that have been filling our back pages\" and Trans-Euro Express on Sunday nights, a programme rounding up  European football.\"\".Radio Listings"]}, {"page": "Crystal Palace Baltimore", "response": ["Crystal Palace Baltimore was established on May 5, 2006 by Crystal Palace's Chairman Simon Jordan, Vice Chairman Dominic Jordan, Chief Executive Phil Alexander, Director of Football Bob Dowie and Jim Cherneski, the new American-based club's Sporting Director. This was the first trans-Atlantic partnership of its kind in North America.\"Palace Baltimore To Sit 2011 NASL Season Out,\" Crystal Palace Baltimore, Friday, December 3, 2010.  The Baltimore franchise originally intended to be in the USL Premier Development League (PDL). Instead, it joined the USL Second Division (USL-2) when it began playing a full schedule of contests in 2007. The team's original official title was Crystal Palace F.C. USA until January 27, 2010, when it was changed to the more popularly accepted name Crystal Palace Baltimore.\"A Whole New Ballgame for Crystal Palace Baltimore,\" Crystal Palace Baltimore, Wednesday, January 27, 2010. "]}, {"page": "Wayne Carlisle", "response": ["He began his career with then English Championship side Crystal Palace. Due to the club's financial troubles during the late 1990s, first-team opportunities became available for the then-young trainee. He made his league debut in February 1999 in Palace's 1–1 draw at home to Birmingham City. Carlisle featured in 46 first team league matches while at Selhurst Park, but when Simon Jordan stepped in to save the club, investments in more experienced and high-profile players limited Carlisle's chances."]}, {"page": "Mark Goldberg (football manager)", "response": ["At the end of the 1997–98 season, Goldberg appointed Terry Venables as head coach for the following season and former manager Steve Coppell became Director of football. The club was not successful under his chairmanship and in January 1999 it was taken over by administrators who counted £22 million of debts, including £2m owed to Terry Venables and £7m to banks, the remainder to football clubs, players and HMRC. The club also failed to reach the standards set when Goldberg took over, with their financial crisis not being solved until a takeover by Simon Jordan was completed more than a year later, and a return to the Premier League was not achieved until 2004."]}, {"page": "Peter Morley", "response": ["After Chairman Mark Goldberg fell into financial ruin in 1999, and the club into administration, Morley was appointed temporary chairman.  He stayed in this role until the summer of 2000, when Simon Jordan took control of the club."]}, {"page": "Fortune: Million Pound Giveaway", "response": ["*Simon Jordan – mobile phone entrepreneur and the then owner of Crystal Palace F.C."]}, {"page": "Wembley Stadium", "response": ["The first match at the stadium was a game played behind closed doors between Multiplex and Wembley Stadium staff. The first game in front of spectators was between the Geoff Thomas Foundation Charity XI and the Wembley Sponsors Allstars on 17 March 2007. The Geoff Thomas Foundation Charity XI won 2–0 (scorers Mark Bright and Simon Jordan). The first official match involving professional players was England U21s vs Italy U21s on 24 March 2007, which finished 3–3. Official attendance was 55,700 (although all of the 60,000 tickets that were made available were sold in advance). The first player to score in a FIFA-sanctioned match was Italian striker Giampaolo Pazzini after 28 seconds of the same game; he also scored the first hat-trick at Wembley. The first English player to score in a full-scale match was David Bentley with a free kick in the same game."]}]}}