{"wiki_id": "http://www.wikidata.org/entity/Q7519497", "itemLabel": "Simon Patterson", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Patterson_(artist)", "wikipedia_page": {"main": "Simon Patterson (born 1967) is an English artist and was born in Leatherhead, Surrey. He was shortlisted for the Turner Prize in 1996 for his exhibitions at the Lisson Gallery, the Gandy Gallery, and three shows in Japan. He is the younger brother of the painter Richard Patterson.", "link_mentions": [{"page": "Tube map", "response": ["* In Tate Modern hangs The Great Bear by Simon Patterson, a subtle parody of the contemporary map design, first displayed in 1992 in which the station names on the Tube map have been replaced by those of famous figures."]}, {"page": "Wilfred Owen", "response": ["The forester's house in Ors where Owen spent his last night, Maison forestière de l'Ermitage, has been transformed by Turner Prize nominee Simon Patterson into an art installation and permanent memorial to Owen and his poetry, which opened to the public on 1 October 2011."]}, {"page": "Camberwell", "response": ["The core of the later-to-be YBAs, graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Henry Bond and Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–90, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter. Collishaw has a studio in a pub in Camberwell. as does the sculptor Anish Kapoor.Architects Journal June 2012 http://www.architectsjournal.co.uk/news/daily-news/caseyfierro-unwraps-anish-kapoor-studio/8625145.article"]}, {"page": "Turner Prize", "response": ["Douglas Gordon becomes the first video artist to win the Turner Prize. Other nominees included photographer Craigie Horsfield, painter Gary Hume and installation artist Simon Patterson."]}, {"page": "Young British Artists", "response": ["The core of the YBA group graduated from the Goldsmiths BA Fine Art degree course in the classes of 1987–90. Liam Gillick, Fiona Rae, Steve Park and Sarah Lucas, were graduates in the class of 1987. Ian Davenport, Michael Landy, Gary Hume, Anya Gallaccio, Lala Meredith-Vula, Henry Bond, Angela Bulloch, were graduates in the class of 1988; Damien Hirst, Angus Fairhurst, Mat Collishaw, Simon Patterson, and Abigail Lane, were graduates from the class of 1989; whilst Gillian Wearing, and Sam Taylor-Wood, were graduates from the class of 1990. During the years 1987–1990, the teaching staff on the Goldsmiths BA Fine Art included Jon Thompson, Richard Wentworth, Michael Craig-Martin, Ian Jeffrey, Helen Chadwick, Mark Wallinger, Judith Cowan and Glen Baxter."]}, {"page": "Leatherhead", "response": ["* Richard Patterson (b. 1963) and his brother Simon Patterson (b. 1967), both artists, were born in the town."]}, {"page": "1992 in art", "response": ["*Simon Patterson – The Great Bear (lithograph)"]}, {"page": "List of contemporary artists", "response": ["* Simon Patterson (born 1967), conceptual artist"]}, {"page": "Ikon Gallery", "response": ["Solo exhibitions since 2000 include Santiago Sierra, On Kawara, Roy Arden, Marcel Dzama, Olafur Eliasson, Simon Patterson, Richard Billingham, Julian Opie, Cornelia Parker, and Haroon Mirza (November 2018 — February 2019) "]}, {"page": "The Great Bear (lithograph)", "response": ["The Great Bear is a 1992 lithograph by Simon Patterson. At first glance the work looks like the London Underground Tube map, but Patterson uses each line to represent groups of people, including scientists, saints, philosophers, comedians, explorers and footballers."]}, {"page": "White City Place", "response": ["The rear of Media Centre included gardens designed by Christopher Bradley-Hole. A poem Voices of White City by Poet Laureate Andrew Motion was inlaid into the paving in the piazza. The site featured artworks such as Simon Patterson's art wall in Broadcast Centre which is based on First World War dazzle camouflage and Yuko Shiraishi's mural in Media Centre reception. She was also responsible for the overall colour scheme in both buildings.Jeremy Myerson, Philip Ross, Space to Work: New Office Design (Laurence King Publishing, 2006), pp 76–81 Energy Centre features the Olympic Rings as a marker of the finishing line of the 1908 Olympic marathon, with a plaque unveiled by IOC president Jacques Rogge in 2005.Mark Barden London's first Olympics, BBC News 26 April 2008"]}, {"page": "Freeze (art exhibition)", "response": ["*Simon Patterson"]}]}}