{"wiki_id": "http://www.wikidata.org/entity/Q7518538", "itemLabel": "Simon Cox", "itemDescription": "Footballer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Cox_(footballer,_born_1984)", "wikipedia_page": {"main": "Simon Cox (born 23 March 1984) is an English former football goalkeeper.He attended ADT College (now Ashcroft Technology Academy) when he was a teenager.Cox started his career with Reading F.C. and joined to Oxford United in 2002. He was released in 2005, and has since been without a club.", "link_mentions": [{"page": "Simon Cox", "response": ["Simon Cox may refer to:", "* Simon Cox (Australian rules footballer), AFL player", "* Simon Cox (car designer), British car designer", "* Simon Cox (footballer, born 1984), English footballer", "* Simon Cox (footballer, born 1987), Irish footballer", "* Simon Cox (golfer) (born 1952), Welsh golfer", "* Simon Cox (rower) (born 1970), British lightweight rower"]}, {"page": "2000–01 Reading F.C. season", "response": ["| Simon Cox", "|30 June 2001||GK||||Simon Cox||Oxford United||"]}, {"page": "Simon Cox (footballer born 1984)", "response": ["#REDIRECT Simon Cox (footballer, born 1984)"]}, {"page": "2015–16 Birmingham City F.C. season", "response": ["Unlike in recent seasons, there were only three debutants in the opening-day fixture, at home to Reading. With all senior players available for selection, the team lined up in manager Gary Rowett's preferred 4–2–3–1 formation with Kuszczak in goal, Caddis and Grounds at full back, Spector and Morrison at centre back, Kieftenbeld alongside Stephen Gleeson in defensive midfield, Gray and Cotterill as wide midfielders, and Toral in support of lone striker Donaldson. Either side of half-time, Birmingham took a two-goal lead via Cotterill's deflected free kick and Toral's header from Donaldson's cross. Kuszczak's fumble led to the visitors making the score 2–1, but well into stoppage time, substitute David Davis's challenge conceded a penalty. Kuszcazk atoned for his earlier error by parrying the kick, and Reading's Simon Cox failed to convert the rebound."]}, {"page": "2017 EFL Trophy Final", "response": ["For their second round match, Oxford travelled to Roots Hall for a match against Southend United. The match remained goalless until close to the end when Maguire scored for Oxford, a free-kick from  out. The lead was short-lived, as Southend's Anthony Wordsworth equalised immediately. For the third game in a row in the competition, Oxford faced a penalty shoot-out. This time they were successful, scoring all but one of their kicks while Eastwood saved from Southend's Simon Cox and Stephen McLaughlin's penalty went over the bar. Their reward was a home tie in the last 16, in which they hosted Scunthorpe United. The visitors dominated early and took the lead after ten minutes, Luke Williams scoring a penalty after he had been fouled in the area. Duane Holmes then took a shot when he had only Eastwood to beat, but the Oxford goalkeeper saved it. Oxford turned the game around, Marvin Johnson equalising on 18 minutes in the team's first attack of the game and taking the lead four minutes later. Hemmings was the scorer of this goal and he added two more in the second half, one of them a penalty, to complete his hat-trick as Oxford won the game 4–1."]}, {"page": "2019–20 Blackpool F.C. season", "response": ["A week later, Blackpool travelled to the south coast to face Southend. Simon Grayson retained the same lineup that started against Bristol Rovers. An own-goal from the hosts' Harry Lennon gave the Seasiders the lead after nine minutes. Three minutes later, Nathan Delfouneso opened his scoring account for the campaign with a strike. He scored his second on 37 minutes, giving Blackpool a 3–0 lead at the break. James Husband was given a straight red card for a reckless challenge on Elvis Bwomono. Simon Cox pulled one back for Southend with fifteen minutes to go. Blackpool moved to the top of the table on goal-difference with the victory.Southend United 1–3 Blackpool - BBC Sport, 10 August 2019"]}]}}