{"wiki_id": "http://www.wikidata.org/entity/Q7519433", "itemLabel": "Simon Nicholson", "itemDescription": "British artist (1934-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Nicholson", "wikipedia_page": {"main": "Simon Hepworth Nicholson (3 October 1934  – 17 January 1990) was a British painter and sculptor. He was the son of sculptor Barbara Hepworth and her second husband, artist Ben Nicholson.\nNicholson attended Dartington Hall School before studying sculpture at the Royal College of Art from 1953 to 1954 and then archaeology and anthropology at Trinity College, Cambridge, from 1954 to 1957.  Like his parents, Nicholson lived and worked in St Ives from 1960 to 1964.  \nHe moved to the United States in 1964 to teach, first at the Moore College of Art and Design, Philadelphia, and later at the University of Berkeley, California.  During this time, he had solo exhibitions in San Francisco and Pittsburgh.  Nicholson returned to England in 1971 where he was an Open University (OU) lecturer until 1989.  He became chairman of the Art and Environment course at the OU, which developed into a popular practical arts module (TAD292). The associated week long summer school achieved some notoriety.After his death, a retrospective exhibition at Falmouth College of Arts and Dartington Hall was held in 1999.\nIn addition to Simon and his parents, the Nicholson family also produced four other artists, his grandfather William Nicholson, aunt Nancy Nicholson, sister Rachel and half-sister Kate Nicholson.", "link_mentions": [{"page": "October 3", "response": ["*  1934   – Simon Nicholson, English sculptor and painter (d. 1990)"]}, {"page": "Nicholson (name)", "response": ["* Simon Nicholson, British painter and sculptor"]}, {"page": "Pier Arts Centre", "response": ["| • Alan Davie || • Barbara Hepworth || • Simon Nicholson || • John Wells"]}, {"page": "Adventure playground", "response": ["The architect Simon Nicholson numbered among the advantages of the adventure playground, \"the relationship between experiment and play, community involvement, the catalytic value of play leaders, and indeed the whole concept of a free society in miniature.'\" Essential in this for Nicholson was the concept of 'loose parts':  \"In any environment, both the degree of inventiveness and creativity, and the possibility of discovery, are directly proportional to the number and kind of variables in it.\" In a playground context loose parts would include:"]}, {"page": "Kate Nicholson", "response": ["In addition to Kate and her parents, the Nicholson family also produced other artists, including her grandparents, William Nicholson and Mabel Pryde, aunt Nancy Nicholson, and half-brother Simon Nicholson, and half-sister painter Rachel Nicholson."]}, {"page": "Moore College of Art and Design", "response": ["* Simon Nicholson, artist and teacher from 1964 to 1966"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Simon Nicholson"]}]}}