{"wiki_id": "http://www.wikidata.org/entity/Q7519214", "itemLabel": "Simon Lipson", "itemDescription": "British comedian, actor and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Lipson", "wikipedia_page": {"main": "Simon Lipson is an actor, writer, comedian and impressionist from England.\nHis radio career has included being lead impressionist on BBC Radio 5 Live's The Game's Up, regular presenter and impressionist on Interesting...Very Interesting, Radio 4's Dead Ringers, a regular panelist on BBC Radio 2's And This is Them and a frequent guest on Radio 4's Loose Ends. His TV appearances have included BBC1's The Stand Up Show and Auntie's Sporting Bloomers, Channel 4's 100 Greatest Cartoons and 100 Funniest Moments and ITV's Talking Telephone Numbers and Celebrity Squares.\nLipson has performed three solo shows at the Edinburgh Festival Fringe and in 2005, together with Philippa Fordham, his show He Barks, She Bites was nominated for the prestigious Dubble Act Award. Simon and Philippa were subsequently commissioned to write and star in their own sketch comedy show on BBC Radio 4. The Fordham & Lipson show was recorded at the BBC Radio Theatre in September 2007 and was broadcast that winter.\nAs a voiceover artist, Lipson has done numerous TV and radio commercials.  He has also voiced cartoon characters on shows such as BBC2's Comedy Nation. In addition, he has provided after dinner entertainment at numerous corporate events.\nHe made his debut radio broadcast on BBC Radio 5 Live in May 1994 and his first television appearance on LWT's Dial Midnight later that August. He soon became a regular at many comedy clubs in London, including Jongleurs, the Comedy Cafe and The Comedy Store.\nHe started his performing career on a whim in 1993 - he was formerly a solicitor who co-founded a legal recruitment business, Lipson Lloyd-Jones in 1987, of which he was then the Managing Director.", "link_mentions": [{"page": "NATYS: New Acts of the Year Show", "response": ["** Simon Lipson - finalist", "** Simon Lipson - finalist"]}, {"page": "List of Dead Ringers episodes", "response": ["The first series starred Alistair McGowan, Jon Culshaw, Simon Lipson, Kate Robbins (episodes 1–2) and Jan Ravens (episodes 3–4)."]}]}}