{"wiki_id": "http://www.wikidata.org/entity/Q7518736", "itemLabel": "Simon Ferguson", "itemDescription": "English cricketer (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Ferguson", "wikipedia_page": {"main": "Simon Alexander Ross Ferguson (born 13 May 1961) played List A cricket for Suffolk in 1984 and first-class cricket for Somerset in 1985. He was born in Lagos, Nigeria.\nFerguson was an opening or middle order right-handed batsman and a right-arm medium-pace bowler. He attended Framlingham College in Suffolk, where he represented the school 1st XI for four years, breaking all school batting records. He captained Lancaster University for two years and led them to two indoor Universities Athletic Union Titles. In 1983 after successfully leading English Roses to the Universities Championship, he then Captained Great Britain and Ireland Universities against an Essex side captained by former England captain Mike Denness. He played for Essex for two seasons, topping the second eleven batting averages. He played Minor Counties cricket for Suffolk in 1983 and 1984, which led to his solitary List A appearance in the first-round NatWest Trophy match against Worcestershire at New Road, Worcester in 1984, when he made 12 and did not bowl. In 1985, he spent two seasons with Somerset, but played almost exclusively for the second eleven in the Minor Counties Championship and the Second Eleven Championship where he topped the batting averages. His one first-eleven game came late in a season of turmoil for Somerset, who unexpectedly finished bottom of the County Championship, and he scored just eight in a single innings against Middlesex at Weston-super-Mare. He did not return to Somerset in 1986.\nWhilst playing for Somerset County Cricket Club he captained Staplegrove Cricket Club, where he broke the then existing league records for batting. In one 45 over League game he scored 207.  He then proceeded to represent Hampstead CC where he scored 211 in a club game before lunch and Richmond CC in the Middlesex League, where he also captained the Middlesex League and Middlesex Cricket Union. He represented the England Amateur XI on several occasions. Whilst representing Constantia Cricket Club in South Africa he was a member of the side that won the Supersport National Club Championships at Centurion in defeating Stellenbosch University in the final. He reached the unusual record of having scored one hundred hundreds in all cricket.\nPlaying later in club cricket in London, he recommended a New Zealand-born fast bowler Andy Caddick to Somerset's coach, Peter Robinson.", "link_mentions": [{"page": "List of Somerset County Cricket Club players", "response": ["* Simon Ferguson (1985) 1 match CA"]}]}}