{"wiki_id": "http://www.wikidata.org/entity/Q7519114", "itemLabel": "Simon Kerrigan", "itemDescription": "English cricketer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Kerrigan", "wikipedia_page": {"main": "Simon Christopher Kerrigan (born 10 May 1989) is an English cricketer who plays for Northamptonshire. He bowls slow left arm orthodox spin. Kerrigan signed for the Lancashire in September 2008, and made his debut for the first team in 2010, filling in for Gary Keedy, Lancashire's senior spinner. In August 2011, Kerrigan was selected for the England Lions for the first time. The following month he took the best first-class bowling figures for Lancashire since 1953 (9 wickets for 51 runs) and that year Lancashire won the County Championship for the first time since 1950.\nThe 2012 season saw Kerrigan replace Keedy as Lancashire's main spinner in first-class cricket. He played his only Test match in the fifth Ashes Test at The Oval in 2013.", "link_mentions": [{"page": "Preston, Lancashire", "response": ["* Simon Kerrigan, cricketer"]}, {"page": "Northamptonshire County Cricket Club", "response": ["|style=\"text-align:center\"|10|| Simon Kerrigan  ||  ||  || Right-handed || Slow left-arm orthodox ||"]}, {"page": "Kerrigan", "response": ["* Simon Kerrigan (born 1989), English cricketer"]}, {"page": "Palace Shield", "response": ["Current Test stars such as Andrew Flintoff and Simon Kerrigan began their careers in the Palace Shield, though it remains a competition for amateurs only. Teams such as Vernon Carus, Thornton Cleveleys, Fulwood & Broughton, Freckleton and Longridge have dominated in latter years, but an influx of new clubs such as Walton-le-Dale ensures that competition remains keen and standards of facilities and play continue to improve."]}, {"page": "Gary Keedy", "response": ["In a warm-up match against Durham before the 2010 season started, Keedy broke his collar bone. The injury left him unable to play for several months. In Keedy's absence, Lancashire's young spinners, Stephen Parry and Simon Kerrigan, were given opportunities in the first team. Kerrigan was chosen ahead of Parry in the four-day team and cemented his place in the side. When Keedy returned from injury he and Kerrigan sometimes bowled together in the County Championship. Their partnership began with them competing to out perform each other. After a discussion the pair decided they would be more effective if they worked together to build pressure while bowling. Keedy finished the season with 31 first-class wickets at an average of 22.19."]}, {"page": "NBC Denis Compton Award", "response": ["*Lancashire – Simon Kerrigan", "*Lancashire – Simon Kerrigan"]}, {"page": "Edge Hill University", "response": ["*Simon Kerrigan (Cricketer)"]}, {"page": "Stephen Parry (cricketer)", "response": ["In April 2010, immediately before the start of the English cricket season, Lancashire's experienced and established spinner, Gary Keedy, suffered a broken collar bone. With several months on the sidelines, Keedy's absence gave the opportunity to young spinners Parry and Simon Kerrigan to play first-team cricket. Lancashire coach Peter Moores said \"We're lucky in some ways in that we've got Stephen Parry, who played quite a lot of first-team cricket last season, but we've also got Simon Kerrigan, who bowled beautifully to take six wickets in the pre-season game against Yorkshire in Barbados and we could also use Steven Crofty's off-spin\". Kerrigan was chosen ahead of Parry in the four-day team and cemented his place in the side. However, following a string of impressive twenty20 performances for Lancashire Lightning during the 2010 season, Parry was called up to the England Lions squad for their triangular series with India A and West Indies A. At the time of his selection, he was Lancashire's leading wicket-taker in the 2010 Friends Provident t20, and he finished as the competition's fourth-highest wicket-taker in 2010. He made his debut for the Lions on 8 July in their victory over India A; Parry took three wickets in the match."]}, {"page": "Ollie Rayner", "response": ["On 21 January 2014, Rayner was called up to the England Lions Squad for the forthcoming tour of Sri Lanka. He replaced the injured Simon Kerrigan who would be monitored with the possibility of him joining the squad later on in the tour if his condition improved."]}, {"page": "2013 Ashes series", "response": ["After naming an unchanged squad for the first two Tests, England were forced into a change for the third Test after Pietersen suffered a calf injury on the third day at Lord's. After much speculation regarding his replacement, Nottinghamshire batsman James Taylor was called up on the back of an unbeaten century against the Australians in a tour match against Sussex, for whom he was making a guest appearance. The England selectors also made the decision to allow Finn and Onions to return to their clubs, to be replaced by seamer Chris Tremlett and another spin option in Monty Panesar. Following the fourth Test at Chester-le-Street, Tim Bresnan was ruled out for the summer, so Simon Kerrigan and Chris Woakes were given surprise call-ups and would both go on to make their debuts in the fifth Test at The Oval.", "* Simon Kerrigan†"]}, {"page": "September 2010 in sports", "response": ["***Nottinghamshire 400/9d (89.4 overs; Adam Voges 126, Simon Kerrigan 5/80); Lancashire 11/3 (4.4 overs). Match drawn."]}, {"page": "England Lions cricket team in Australia in 2012–13", "response": ["* Simon Kerrigan (Lancashire)"]}, {"page": "2013 County Championship", "response": ["After a short break, the County Championship returned to action in the second week of July. Hampshire's 41 run first innings lead against Glamorgan proved to be crucial, as they won the game by just 43 runs. Lancashire's victory against title rivals Northamptonshire at Northampton promoted the visitors to the top spot in the Division Two standings, ahead of their hosts for that game. Kent chased 411 in the fourth innings of their game against Gloucestershire to claim their first Championship victory of the season. However, a flat pitch in their match against Hampshire prevented any chance of a second consecutive win—the contest ended as a high-scoring draw. Despite a twelve-wicket match haul for Simon Kerrigan, division leaders Lancashire could also only manage a draw against Glamorgan. Leicestershire continued to struggle for Championship form, falling to an innings defeat against Essex. Worcestershire's chances of promotion were dented when Gloucestershire completed a six wicket victory over them. At the end of July all nine counties had completed ten games apiece, and Lancashire, the only unbeaten team in the division, led Northamptonshire by eight points, while Essex were a further eighteen points adrift in third. Leicestershire, the only winless team at this stage, were eighteen points behind their nearest rivals, Glamorgan.", "| align=\"left\"| Simon Kerrigan"]}, {"page": "Australian cricket team in England in 2013", "response": ["* Simon Kerrigan"]}, {"page": "Indian cricket team in England in 2014", "response": ["*Simon Kerrigan"]}]}}