{"wiki_id": "http://www.wikidata.org/entity/Q7518738", "itemLabel": "Simon Festing", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Festing", "wikipedia_page": {"main": "Simon Festing is chief executive of the British Occupational Hygiene Society.", "link_mentions": [{"page": "Pro-Test", "response": ["A number of politicians and scientists addressed the Pro-Test demonstrators. These included Evan Harris, the Liberal Democrat science spokesperson and MP for Oxford West and Abingdon; the Radcliffe Hospital's neurosurgeon and Pro-Test committee member Professor Tipu Aziz, whose research into Parkinson's disease \"involves the use of primates,\"  and who recently spoke out in support of testing cosmetics on animals;\"Scientist backs animal testing for cosmetics\" (The Guardian, 4 March 2006) Simon Festing of the Research Defence Society, a lobby group funded by the pharmaceutical industry and universities; and Pro-Test committee member Professor John Stein, an Oxford neurophysiologist who \"induces Parkinson's disease in monkeys and then attaches electrodes to their brains to test therapies which may help human sufferers,\" according to The Guardian. In his speech to the crowd, Stein declared, \"This is a historic day; we are drawing a line in the sand.\"\"Oxford swamped by Protest demo\", 4 News website, 25 February 2006. "]}, {"page": "Research Defence Society", "response": ["Its last executive director was Dr. Simon Festing, who became CEO of Understanding Animal Research.Understanding Animal Research About Us page"]}, {"page": "Michael Festing", "response": ["He is the father of Simon Festing, the former executive director of the Research Defence Society, which focuses on supplying information about, and defending, the use of animals in medical experiments in the UK.", "*\"RDS, Michael Festing, and Simon Festing: Who's Who\", Americans for Medical Advancement, retrieved February 22, 2006"]}, {"page": "Tipu Aziz", "response": ["Simon Festing, director of the pro-animal experimentation lobby group Research Defence Society said of Aziz: \"He's not involved in cosmetic testing himself, [Britain's] not involved in cosmetic testing, it's been banned here. There's no movement from the scientific community or the cosmetics industry to have it brought back in. I can't see it being particularly relevant apart from being his personal view.\""]}]}}