{"wiki_id": "http://www.wikidata.org/entity/Q7526914", "itemLabel": "Sir George Robinson, 1st Baronet", "itemDescription": "British MP and director of East India Company", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_George_Robinson,_1st_Baronet", "wikipedia_page": {"main": "Sir George Abercrombie Robinson, 1st Baronet (29 March 1758 – 13 February 1832) was a British MP and Chairman of the East India Company.\nHe was born the son of John Robinson of Calcutta, who died at the Cape of Good Hope in 1779, and Margaret, daughter of George Leslie of Kimrawgie, North Britain. He joined the East India Company in 1779 as a cadet and was successively promoted to ensign, Commissary-General (1786), Aide-de-Camp to Lord Cornwallis (Governor-General of Bengal) (1788), Head Assistant in the Military Auditor-General's office (1788–92), Garrison Storekeeper at Fort William and Secretary to the Military Board, captain (1798) and Military Auditor-General (1798). He retired in 1802 and served as Private Secretary to Cornwallis from July to October, 1805.\nHe became a director of the East India Company from 1808 to 1829, acting as Chairman in 1820 and 1826 . and was also a director of the Globe Insurance Company. He was elected as the MP for Honiton in 1812 (until 1818).\nHe was created the first Baronet of Batts House, Somerset on 11 November 1823. The title would become extinct in 1944 on the death of Sir Douglas Robinson, 6th Baronet.On 27 March 1794 he married, in Calcutta, Margaret Southwell, the natural daughter of Thomas Howard, 14th Earl of Suffolk, with whom he had seven sons and a daughter:\nGeorge-Best - died young\nFrancis-Matilda - died young\nSir George Best Robinson, 2nd Baronet - became the second chief superintendent of British trade in China in 1835.\nFrancis-Horsley\nThe Revd William-Scott Robinson, Rector of Dyrham, Gloucestershire\nCharles-Cornwallis - died young\nHenry-Sterling\nEdward InnesHe died on 13 February 1832 at his son William-Scotts house in Dyrham after a long illness. Margaret predeceased him on 21 May 1824.", "link_mentions": [{"page": "George Robinson", "response": ["*Sir George Robinson, 1st Baronet (1758–1832) of Batts House, Somerset, British MP and Chairman of the East India Company"]}, {"page": "Sir George Robinson, 2nd Baronet", "response": ["Son of Sir George Robinson, 1st Baronet and Margaret Southwell, the natural daughter of Thomas Howard, 14th Earl of Suffolk, he succeeded to the baronetcy on 13February 1832."]}, {"page": "Sir George Abercrombie Robinson, 1st Baronet", "response": ["#REDIRECTSir George Robinson, 1st Baronet"]}, {"page": "Alice Perrin", "response": ["Perrin was born in the hill station of Mussoorie in Anglo-India in 1867. Her parents were Bertha and her second husband John Innes Robinson. Her father would become a Major General in the Bengal Cavalry. and her great grandfather, Sir George Robinson, 1st Baronet had been a director of the East India Company. She was sent to England where she went to school and when she returned she married an engineer named Charles Perrin on 26 May 1886 in Dehra. Once married and after the birth of their only child she took to writing to relieve the boredom of life in India for a British woman. She published a short story titled Caulfield's Crime in the 1892 Belgravia Annual. "]}]}}