{"wiki_id": "http://www.wikidata.org/entity/Q7528923", "itemLabel": "Sir Rupert Clarke, 3rd Baronet", "itemDescription": "Australian businessman (1919-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Rupert_Clarke,_3rd_Baronet", "wikipedia_page": {"main": "Sir Rupert William John Clarke, 3rd Baronet, AM, MBE (5 November 1919 – 4 February 2005) was an Australian soldier, businessman and pastoralist. He achieved success in a number of fields, including horseracing, the military and as a corporate chairman.", "link_mentions": [{"page": "Deaths in February 2005", "response": ["*Sir Rupert Clarke, 3rd Baronet, 85, Australian soldier and businessman."]}, {"page": "Rupert Clarke", "response": ["**Sir Rupert Clarke, 3rd Baronet (1919-2005)"]}, {"page": "Alice River, Queensland", "response": ["The estate is also known as Rupertswood, because the estate was named by the developer who was Sir Rupert Clarke, 3rd Baronet of Rupertswood, after his ancestral home \"Rupertswood\" at Sunbury, Victoria, Australia. However, Alice River was named by one of the Bell & Reid party in 1865 for a lady of his acquaintance.Thuringowa Past And Present, Page 19. The suburb along with its neighbour Rangewood, Queensland are up and coming suburbs with numerous housing developments expected in future due to the ample availability of flat develop-able land and close proximity to the Townsville Orbital road and James Cook University. Existing suburbs to the east are almost entirely built out with only some subdivision of smaller parcels and in-fill development possible. "]}, {"page": "Sir Rupert Clarke", "response": ["#REDIRECT Sir Rupert Clarke, 3rd Baronet"]}, {"page": "Index of World War II articles (S)", "response": ["# Sir Rupert Clarke, 3rd Baronet"]}, {"page": "List of alumni of Magdalen College, Oxford", "response": ["* Sir Rupert Clarke, 3rd Baronet, soldier, businessman and horse rider"]}, {"page": "Rupert Clarke, 3rd Baronet", "response": ["#REDIRECT Sir Rupert Clarke, 3rd Baronet"]}, {"page": "Sir Rupert Grant Alexander Clarke, 4th Baronet", "response": ["Sir Rupert Grant Alexander Clarke is the 4th Baronet Clarke of Rupertswood, having succeeded his father, Sir Rupert Clarke, 3rd Baronet.Official Roll "]}]}}