{"wiki_id": "http://www.wikidata.org/entity/Q7526599", "itemLabel": "Sir Edward Petre, 3rd Baronet", "itemDescription": "English Jesuit and adviser to King James II", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Edward_Petre,_3rd_Baronet", "wikipedia_page": {"main": "Sir Edward Petre, 3rd Baronet,  (1631 – 15 May 1699) was an English Jesuit who became a close adviser to King James II and was appointed a privy councillor.", "link_mentions": [{"page": "May 15", "response": ["*1699 – Sir Edward Petre, 3rd Baronet, English politician (b. 1631)"]}, {"page": "Pope Innocent XI", "response": ["Innocent XI dispatched Ferdinando d'Adda as nuncio to the Kingdom of England, the first representative of the Papacy to go to England for over a century. Even so, the Pope did not approve the imprudent manner in which James II attempted to restore Catholicism in England. He also repeatedly expressed his displeasure at the support which James II gave to the autocratic King Louis XIV in his measures against the Church. It is not surprising, therefore, that Innocent XI had less sympathy for James than for William of OrangeCrane Brinton, \"Italy and the Papacy, 1655 A.D.-1799 A.D.\" in An Encyclopedia of World History (1941), Boston:  Houghton Mifflin. and that he did not afford James help in his hour of trial.Kelly, 288 Innocent refused to appoint James II's choice as a Cardinal, Sir Edward Petre, 3rd Baronet."]}, {"page": "1699", "response": ["* May 15 – Sir Edward Petre, 3rd Baronet, English Jesuit, privy councillor (b. 1631)"]}, {"page": "Baron Petre", "response": ["Another member of the Petre family was Father Sir Edward Petre, 3rd Baronet, the unpopular chaplain and advisor to James II. James made him Clerk of the Closet and asked the Pope to make him a bishop and later a Cardinal but was refused both requests."]}, {"page": "Father Edward Petre", "response": ["#REDIRECT Sir Edward Petre, 3rd Baronet"]}, {"page": "Petre", "response": ["*Sir Edward Petre, 3rd Baronet (1631–1699), English Jesuit and privy councillor"]}]}}