{"wiki_id": "http://www.wikidata.org/entity/Q7527111", "itemLabel": "Sir Henry Bunbury, 7th Baronet", "itemDescription": "British Army general (1778-1860)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Henry_Bunbury,_7th_Baronet", "wikipedia_page": {"main": "Sir Henry Edward Bunbury, KCB, 7th Baronet (4 March 1778 – 13 April 1860) was a British soldier and historian.", "link_mentions": [{"page": "1778", "response": ["** Sir Henry Bunbury, 7th Baronet, British Army general (d. 1860)"]}, {"page": "Lady Sarah Lennox", "response": ["* Emily Louisa Augusta Napier (11 July 1783 – 18 March 1863); married Lt.-Gen. Sir Henry Bunbury, 7th Baronet (nephew of her mother's first husband) on 22 September 1830"]}, {"page": "Lady Louisa Conolly", "response": ["Themselves unhappily childless, at that point they took up the welfare of young children from disadvantaged backgrounds as a lifelong project, contributing both money and effort towards initiatives which would enable foundlings and vagabonds to acquire productive skills and support themselves. They developed one of the first Industrial Schools where boys learnt trades, and Lady Louisa took active personal interest in mentoring the students.History Conolly Family Turtle Bunbury. In middle age, Lady Louisa also virtually adopted her niece Emily Napier (1783-1863), the daughter of her sister Lady Sarah Lennox. Emily, who would spend long months with her aunt in Kildare, married Sir Henry Bunbury, 7th Baronet, and moved to Suffolk, although she remained close to her aunt until her death."]}, {"page": "George Napier", "response": ["* Emily Louisa Augusta Napier (1783 – 1863), married Sir Henry Bunbury, 7th Baronet"]}, {"page": "Great Barton", "response": ["In 1816 Sir Henry Bunbury, 7th Baronet, the major land owner in the area, founded one of the earliest allotment schemes in the country. He started granting land to his labouring tenants at the end of 1816 and early 1817 shortly after the food and anti-machinery riots, commonly known as the 'Bread or Blood' riots. The allotments were situated in the land bounded by Vicarage Farm Lane, Mill Road, and Livermere Road. He wrote in his memoirs of the allotments:"]}, {"page": "Henry Edward Bunbury", "response": ["#REDIRECT Sir Henry Bunbury, 7th Baronet"]}, {"page": "Edward Bunbury", "response": ["Bunbury was the second son of Sir Henry Bunbury, 7th Baronet, and the grandson of Henry Bunbury. His mother was Louisa Emilia, daughter of General the Hon. Henry Edward Fox, younger son of Henry Fox, 1st Baron Holland, and his wife Lady Caroline Lennox, the eldest of the famous Lennox sisters. Through the latter he was a descendant of Charles II. He was educated at Trinity College, Cambridge. He was called to the bar by the Inner Temple in 1841."]}, {"page": "Henry Bunbury", "response": ["*Sir Henry Bunbury, 7th Baronet (1778–1860), his son, British lieutenant-general, MP for Suffolk"]}, {"page": "Sir Charles Bunbury, 8th Baronet", "response": ["He was born in Messina, the eldest son of Sir Henry Bunbury, 7th Baronet and Louisa Amelia Fox and was educated at Trinity College, Cambridge. He married Frances Joanna Horner, daughter of Leonard Horner, on 31 May 1844 in London. They had no children."]}, {"page": "Bunbury (surname)", "response": ["* Sir Henry Bunbury, 7th Baronet (1778–1860), British soldier and historian"]}, {"page": "Henry William St Pierre Bunbury", "response": ["Bunbury was the son of Lt.-Gen. Sir Henry Bunbury, 7th Baronet, who served as Under-Secretary of State for War and the Colonies. His mother, Louisa Amelia, was the daughter of Henry Edward Fox and the granddaughter of Henry Fox, 1st Baron Holland. Bunbury's brothers, Sir Charles and Sir Edward, had prominent careers of their own."]}]}}