{"wiki_id": "http://www.wikidata.org/entity/Q7527162", "itemLabel": "Sir Henry Johnson, 1st Baronet", "itemDescription": "Irish soldier", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Henry_Johnson,_1st_Baronet", "wikipedia_page": {"main": "Major-General Sir Henry Johnson, 1st Baronet,  (1 January 1748 – 18 March 1835) was an Anglo-Irish general in the British Army.", "link_mentions": [{"page": "Bath Abbey", "response": ["* Sir Henry Johnson, 1st Baronet, general (1748–1835)"]}, {"page": "Henry Johnson", "response": ["* Sir Henry Johnson, 1st Baronet (1748–1835), British Army officer"]}, {"page": "81st Regiment of Foot (Loyal Lincoln Volunteers)", "response": ["*1798–1819: Gen. Sir Henry Johnson, 1st Baronet., GCB"]}, {"page": "Hunt Walsh", "response": ["He was an uncle of Sir Henry Johnson, 1st Baronet and of John Allen Johnson-Walsh."]}, {"page": "Johnson baronets", "response": ["*Sir Henry Johnson, 1st Baronet (1748–1835)"]}, {"page": "Johnson-Walsh baronets", "response": ["The Johnson-Walsh Baronetcy, of Ballykilcavan, was a title in the Baronetage of Ireland. It was created on 24 February 1775 for John Allen Johnson, who changed his name by royal licence in 1809 to John Allen Johnson-Walsh. He was the elder brother of Sir Henry Johnson, 1st Baronet, of Bath (see Johnson Baronets). He was M.P. for Baltinglass from 1784 to 1790, and High Sheriff of Queen's County for 1792."]}, {"page": "General Johnson", "response": ["*Sir Henry Johnson, 1st Baronet (1748–1835), British Army general"]}, {"page": "Charles Cooper Johnson", "response": ["Johnson was the sixth son of Sir Henry Johnson, 2nd Baronet, and a grandson of Sir Henry Johnson, 1st Baronet. He commissioned into the 33rd Bengal Native Infantry. He later transferred into the Bengal Staff Corps, which was amalgamated into the Indian Staff Corps in 1861. He was promoted to Major on 7 June 1864. In 1877, while holding the rank of Colonel, he was made a Companion of the Order of the Bath. He was promoted to the rank of full General on 1 April 1894. Johnson was made Knight Grand Cross of the Order of the Bath in the 1900 Birthday Honours."]}]}}