{"wiki_id": "http://www.wikidata.org/entity/Q7526148", "itemLabel": "Sir Brooke Boothby, 6th Baronet", "itemDescription": "linguist, translator, poet (1744-1824)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Brooke_Boothby,_6th_Baronet", "wikipedia_page": {"main": "Sir Brooke Boothby, 6th Baronet (3 June 1744 – 23 January 1824) was a linguist, translator, poet and landowner, based in Derbyshire, England. He was part of the intellectual and literary circle of Lichfield, which included Anna Seward and Erasmus Darwin. In 1766 he welcomed the philosopher Jean-Jacques Rousseau to Ashbourne circles, after Rousseau's short stay in London with Hume. Ten years later, in 1776, Boothby visited Rousseau in Paris, and was given the manuscript of the first part of Rousseau's three-part autobiographic Confessions. Boothby translated the manuscript and published it in Lichfield in 1780 after the author's death, and donated the document to the British Library in 1781.\nThe well-known portrait of Boothby by Joseph Wright of Derby, from 1781, shows him reclining in a wooded glade with a book carrying on its cover simply the name Rousseau, indicating Boothby's admiration and promotion of the writer and his work generally.Several portraits were also made of Boothby's daughter, Penelope—by Henry Fuseli and Joshua Reynolds and in sculpture by Thomas Banks. She died young, and was the subject of a book of poetry by her grieving father.", "link_mentions": [{"page": "Ashbourne, Derbyshire", "response": ["*Sir Brooke Boothby, 6th Baronet (1744–1824), poet, was born here.Rebecca Mills, \"Boothby, Sir Brooke, seventh baronet (1744–1824)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, May 2010 accessed 2 January 2017 "]}, {"page": "St Oswald's Church, Ashbourne", "response": ["One in particular stands out; the Boothby monument to Penelope Boothby, daughter of Sir Brooke Boothby, 6th Baronet. It is an exquisite and highly realistic sculpture made from Carrara marble (Italian) in the form of a sleeping child.  It is considered to be the masterpiece of the artist Thomas Banks, and was commissioned by Penelope's father. There is an inscription on the tomb from Dante, one in French, one in Latin. That in English reads \"She was in form and intellect most exquisite. The unfortunate Parents ventured their all on this frail Bark. And the wreck was total.\""]}, {"page": "Brooke Boothby", "response": ["*Sir Brooke Boothby, 6th Baronet (1744–1824), British poet and friend of Jean-Jacques Rousseau"]}, {"page": "Ashbourne Hall", "response": ["Sir Brooke Boothby, 6th Baronet married in 1784 and leased the hall from his father.Eighteenth Century Book Reviews: Jacques Zonneveld. Sir Brooke Boothby: Rousseau's Roving Baronet Friend. Review by JoLynn Edwards  accessed 29 May 2008 He began the restoration of Ashbourne Hall using his wife's dowry to renovate the structure, remodel the parkland, purchase rare plants and obtain works of art. Boothby, like his father before him, was extravagant. He purchased from Joseph Wright of Derby two paintings of Dovedale, two views of nearby Matlock, two paintings of bridges in Rome as well as an unusual portrait of himself."]}, {"page": "Boothby (surname)", "response": ["*Sir Brooke Boothby, 6th Baronet (1744–1824), British poet and friend of Jean-Jacques Rousseau"]}, {"page": "Sir Brooke Boothby", "response": ["#REDIRECT Sir Brooke Boothby, 6th Baronet"]}]}}