{"wiki_id": "http://www.wikidata.org/entity/Q7527594", "itemLabel": "Sir John Bayley, 2nd Baronet", "itemDescription": "English cricketer (1793-1871)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_John_Bayley,_2nd_Baronet", "wikipedia_page": {"main": "Sir John Edward George Bayley, 2nd Baronet (23 December 1793 – 23 December 1871) was an English baronet and amateur cricketer.\nBorn in London, he was the son of Sir John Bayley, 1st Baronet and his wife Elizabeth, the youngest daughter of John Markett. Bayley was called to the bar by the Inner Temple in 1835 and went then to the Northern Circuit. He succeeded his father as baronet in 1841.\nBayley played first-class cricket from 1817 to 1832. Mainly associated with Marylebone Cricket Club (MCC), he made 11 known appearances in first-class matches. He represented the Gentlemen in the Gentlemen v Players series.\nIn 1822, he married firstly Charlotte, the daughter of John Minet Fector the elder. After her death in 1854, Bayley remarried Selina Marley. He died at Kensington in 1871 and was succeeded in the baronetcy by his son John. The couple's second son was Hon. Lyttleton Holyoake Bayley.", "link_mentions": [{"page": "John E.G. Bayley", "response": ["#REDIRECT Sir John Bayley, 2nd Baronet"]}, {"page": "John E. G. Bayley", "response": ["#REDIRECT Sir John Bayley, 2nd Baronet"]}, {"page": "Sir John Edward George Bayley, 2nd Baronet", "response": ["#REDIRECT Sir John Bayley, 2nd Baronet"]}, {"page": "John Edward George Bayley", "response": ["#REDIRECT Sir John Bayley, 2nd Baronet"]}, {"page": "John Bayley", "response": ["*Sir John Bayley, 2nd Baronet (1793–1871), British baronet and cricketer 1817–1832"]}, {"page": "Sir John Bayley, 1st Baronet", "response": ["By his wife Elizabeth, the daughter of John Markett of Meopham Court Lodge, co. Kent, he had three sons and three daughters. His eldest son, Sir John Bayley, 2nd Baronet, was a noted cricketer. The 3rd baronet, the Rev. Sir John Laurie Emilius Bayley, was his grandson."]}, {"page": "List of English cricketers (1787–1825)", "response": ["|Sir John Bayley, 2nd Baronet"]}, {"page": "List of English cricketers (1826–1840)", "response": ["|Sir John Bayley, 2nd Baronet"]}, {"page": "John Bayley, 2nd Baronet", "response": ["#redirectSir John Bayley, 2nd Baronet"]}, {"page": "Emilius Bayley", "response": ["Bayley was born in Bloomsbury in London in May 1823, the son of lawyer Sir John Bayley, 2nd Baronet and his first wife Charlotte.Carlaw D Kent County Cricketers A to Z. Part One: 1806–1914, pp.33–34. (Available online at the Association of Cricket Statisticians and Historians. Retrieved 2019-12-26.)Rev. Sir John Robert Laurie Emilius Laurie of Maxwelton, 3rd Bt., The Peerage. Retrieved 2017-03-26. He is thought to have been given the name Emilius, by which he was generally known, after the name of one of his father's horses which won The Derby in 1823.Rev. Sir Emilius Laurie, Dumfriesshire and Galloway Natural History and Antiquarian Society. Retrieved 2017-03-26. His grandfather, Sir John Bayley, 1st Baronet, had the Bayley Baronetcy of Bedford Square created for him in 1834. This became known as the Laurie baronetcy after 1887."]}]}}