{"wiki_id": "http://www.wikidata.org/entity/Q7526096", "itemLabel": "Sir Baldwyn Leighton, 8th Baronet", "itemDescription": "English landowner and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Baldwyn_Leighton,_8th_Baronet", "wikipedia_page": {"main": "Sir Baldwyn Leighton, 8th Baronet  (27 October 1836 – 22 January 1897) was an English Conservative Party politician who sat in the House of Commons from 1877 to 1885.\nLeighton was the son of Sir Baldwin Leighton, 7th Baronet and his wife Mary Parker, daughter of Thomas Netherton Parker of Sweeney Hall, Shropshire. He was educated at Eton College and Christ Church, Oxford, graduating in 1859. He served in the rank of cornet in the South Salopian Yeomanry Cavalry and was a J.P. and Deputy Lieutenant for Shropshire. In 1871, he inherited the baronetcy on the death of his father. Leighton classed himself as a liberal Conservative and published several pamphlets on \"Poor Law\" and \"Labour\" for example. He also published \"Letters of the late Edward Denison MP\".In August 1877, Leighton was elected at a by-election as a Member of Parliament (MP) for South Shropshire. He held the seat until the constituency was abolished in 1885.Leighton died at the age of 60 and was buried in the parish churchyard of his family seat, Loton Park, at Alberbury, Shropshire.\nLeighton married Hon. Eleanor Leicester Warren (1841-1914), daughter of George Warren, 2nd Baron de Tabley. Their son Bryan Leighton succeeded to the baronetcy. Leighton's brother Stanley Leighton was also a Shropshire MP.", "link_mentions": [{"page": "Oliver Leese", "response": ["On 18 January 1933 Leese married a granddaughter of Sir Baldwyn Leighton, 8th Baronet, Margaret Alice (died 1964), daughter of Cuthbert Leighton (recte Leicester-Warren), DL, JP, (1877–1954), of Tabley House, Knutsford, by Hilda Margaret Davenport; they had no children. Lady Leese's brother was the last of the line to own the Tabley estate which he left on his death in 1975 to the National Trust."]}, {"page": "George Warren, 2nd Baron de Tabley", "response": ["*Hon. Eleanor (1841-14 August 1914), married Sir Baldwyn Leighton, 8th Baronet (1836-2 January 1897), of Loton, Shropshire, in 1864. She was (eventual) heir to her brother in 1895, and in 1900 took the name Leighton-Warren. Barbara Sotheby (1870–1952), photographer and painter, was her daughter."]}, {"page": "Leighton baronets", "response": ["*Sir Baldwyn Leighton, 8th Baronet (1836–1897)"]}, {"page": "Alfred Seymour", "response": ["He married on 18 August 1866 Isabella Leighton (d. 7 April 1911), daughter of Sir Baldwyn Leighton, 8th Baronet, and wife, and widow of Beriah Botfield of Hopton Court, Shropshire, Member of Parliament, and had one daughter: "]}, {"page": "Baldwin Leighton", "response": ["* Sir Baldwyn Leighton, 8th Baronet (1836–1897), English landowner and politician, MP 1877–1885"]}, {"page": "Apollo University Lodge", "response": ["* Sir Baldwyn Leighton, 8th Baronet, Conservative politician"]}]}}