{"wiki_id": "http://www.wikidata.org/entity/Q7529521", "itemLabel": "Cameron Gull", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Cameron_Gull", "wikipedia_page": {"main": "Sir William Cameron Gull, 2nd Baronet,  (6 January 1860 – 15 December 1922), known as Sir Cameron Gull, was a barrister and Liberal Unionist politician in England, who served for five years as a member of parliament (MP).", "link_mentions": [{"page": "William Gull", "response": ["They had three children:  Caroline Cameron Gull was born in 1851 at Guy's Hospital and died in 1929; she married Theodore Dyke Acland MD (Oxon.) FRCP, the son of Sir Henry Acland, 1st Baronet MD FRS. They had two children, a daughter (Aimee Sarah Agnes Dyke Acland) who died in infancy in 1889, and a son, Theodore Acland (1890–1960), who became headmaster of Norwich School.Theodore Dyke Acland at thepeerage.com. Retrieved 23 August 2008.", "Cameron Gull was born about 1858 in Buckhold, Pangbourne, Berkshire and died in infancy.", "William Cameron Gull was born on 6 January 1860 in Finsbury, Middlesex and died in 1922.  He was educated at Eton College, inherited his father's title as 2nd Baronet of Brook Street, and later served as the Liberal Unionist Member of Parliament (MP) for Barnstaple from July 1895 to September 1900.", "The following persons were appointed as executors: his wife, Dame Susan Anne Gull, his son, Sir William Cameron Gull, of Gloucester Street, Portman Square (the new baronet), Mr. Edmund Hobhouse, and Mr. Walter Barry Lindley.", "Lady Gull was bequeathed the remainder of his plate, his pictures, furniture, and household effects and the sum of £3,000, along with the use for the remainder of her life of the house at 74 Brook Street.  She also received a life annuity of £3,000, commencing 12 months after Sir William's death.  Sir William's daughter Caroline received £26,000 in trust, while his son Sir William Cameron Gull received the sum of £40,000 and all the real estate."]}, {"page": "Barnstaple (UK Parliament constituency)", "response": ["| Cameron Gull"]}, {"page": "Sir William Gull, 2nd Baronet", "response": ["#REDIRECT Cameron Gull"]}, {"page": "Sir William Cameron Gull", "response": ["#REDIRECT Cameron Gull"]}, {"page": "William Cameron Gull", "response": ["#REDIRECT Cameron Gull"]}, {"page": "Sir Cameron Gull, 2nd Baronet", "response": ["#REDIRECT Cameron Gull"]}, {"page": "Gull (surname)", "response": ["* Cameron Gull (1860–1922), Liberal Unionist politician from England"]}, {"page": "Sir William Cameron Gull, 2nd Baronet", "response": ["#REDIRECT Cameron Gull"]}, {"page": "1918 Birthday Honours (OBE)", "response": ["*Sir William Cameron Gull  National Service Representative"]}]}}