{"wiki_id": "http://www.wikidata.org/entity/Q7527510", "itemLabel": "Sir James Whitehead, 1st Baronet", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_James_Whitehead,_1st_Baronet", "wikipedia_page": {"main": "Sir James Whitehead, 1st Baronet DL (2 March 1834 – 20 October 1917) was a British merchant and Liberal Party politician.", "link_mentions": [{"page": "List of lord mayors of London", "response": ["| 1888 || Sir James Whitehead, 1st Baronet || Fanmaker ||"]}, {"page": "Sir John Barker, 1st Baronet", "response": ["Barker began his career by working as a draper in Folkestone and Dover. In 1858, he worked for Spencer, Turner & Boldero in Marylebone, London. He subsequently worked for William Whiteley on Westbourne Grove in Bayswater, London. After Whiteley refused to partner with Barker, the latter decided to open a store on Kensington High Street with Sir James Whitehead, 1st Baronet instead. As a result, the two men founded Barkers of Kensington. It became a public company known as John Barker & Co Ltd in 1894."]}, {"page": "Whitehead baronets", "response": ["*Sir James Whitehead, 1st Baronet (1834–1917)"]}, {"page": "Sir Rowland Whitehead, 5th Baronet", "response": ["He could speak Danish, Dutch, French, Italian, and Romanian and Swedish in addition to his native English, and was president of the Institute of Translation and Interpreting in 1996.  He became master of the Worshipful Company of Fruiterers in 1995, emulating his great-grandfather, Sir James Whitehead, 1st Baronet (who was also a Lord Mayor of London).  He was involved in the establishment of the Guild of Public Relations Practitioners, and was its master in 2002–2003."]}, {"page": "James Whitehead (politician)", "response": ["#REDIRECT Sir James Whitehead, 1st Baronet"]}, {"page": "James Whitehead (MP)", "response": ["#REDIRECT Sir James Whitehead, 1st Baronet"]}, {"page": "Sir Rowland Whitehead, 3rd Baronet", "response": ["The second son of Sir James Whitehead, 1st Baronet, he was educated at Clifton College and University College, Oxford, where he took a First Class degree in history."]}, {"page": "James Whitehead", "response": ["*Sir James Whitehead, 1st Baronet (1834–1917), British merchant and Liberal Party politician"]}]}}