{"wiki_id": "http://www.wikidata.org/entity/Q7528693", "itemLabel": "Sir Robert Abercromby, 5th Baronet", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Robert_Abercromby,_5th_Baronet", "wikipedia_page": {"main": "Sir Robert Abercromby, 5th Baronet of Birkenbog and Forglen, FRSE KGCB DL (4 February 1784 – 6 July 1855) was a Scottish politician.", "link_mentions": [{"page": "Dashwood baronets", "response": ["*Sir Edwin Hare Dashwood, 7th Baronet (7 September 1825 – 8 May 1882) was an English soldier and landowner. Raised to a military career, he served with distinction at the Battle of Sobraon, and subsequently became a sheepfarmer in New Zealand. He was the son of Capt. Edwin Sandys Dashwood (fourth son of the 4th Baronet) and Emily Hare. His father died of delirium tremens in Paris in 1835, and the younger Edwin was educated at a military school in Germany. He obtained an ensigncy in the 10th (the North Lincolnshire) Regiment of Foot, and went with them to India. There, he showed great gallantry at the Battle of Sobraon, planting the regimental colors in the Sikh trench-line. He shortly after left for England and exchanged into an English regiment. In 1848, Dashwood resigned his commission and emigrated to New Zealand, and bought a farm at Motueka and a sheep station near Blenheim on the Awatere River. In 1850, he and Captain E.M. Mitchell reconnoitered a route from Blenheim to Christchurch along the Waihopai River, which, however, proved unsuitable for sheep driving. Dashwood Pass, which he discovered during this expedition, now bears his name. During his time in New Zealand, Dashwood, like his father and uncle, became an alcoholic, perhaps in part because of the death of his beloved sister Amelia Caroline in 1847. In 1852, he visited England again and on 25 October 1853, married Roberta Henrietta (d. 11 November 1901), daughter of Sir Robert Abercromby, 5th Baronet and the couple had four sons:"]}, {"page": "Abercromby baronets", "response": ["*Sir Robert Abercromby, 5th Baronet (1784–1855)"]}, {"page": "Robert Abercromby", "response": ["*Sir Robert Abercromby, 5th Baronet (1784–1855), British politician"]}, {"page": "John Forbes-Sempill, 18th Lord Sempill", "response": ["He was the son of William Forbes-Sempill, 17th Lord Sempill, and Frances Emily Abercromby, the daughter of Sir Robert Abercromby, 5th Baronet,Reitwiesner and succeeded to the titles on the death of his father in 1905, prior to which he was known by the courtesy title \"Master of Sempill\". In addition to two sisters, he was the eldest of five brothers, four of whom served in the military; Douglas, a Major in the Seaforth Highlanders, was killed on the North-West Frontier of India in 1908, whilst Robert, a Lieutenant with the Gordon Highlanders, was killed near Festubert in northern France during the Great War. The youngest of the four, Arthur, served with the Royal Navy and survived the Battle of Jutland.Forbes, p.6 A fifth brother, William, died in infancy.Burke's, p. 1082"]}, {"page": "William Forbes-Sempill, 17th Lord Sempill", "response": ["The second marriage was in 1862 to Frances Emily Abercromby, the youngest daughter of Sir Robert Abercromby, 5th Baronet, in 1862. They had seven children, five sons and two daughters. Their third son, William, died aged one. The remaining sons served in the military. The eldest, John commanded a battalion of the Black Watch at the Battle of Loos. The second son, Douglas, a Major in the Seaforth Highlanders, was killed on the North-West Frontier of India in 1908. The fourth son, Robert, a Lieutenant in the 5th Bn. Gordon Highlanders, was killed by a sniper on 2 June 1915, aged 45, near Festubert whilst working with his men repairing a gap blown in the parapet of their trench. He is buried in Le Touret Military Cemetery. The youngest of the four, Arthur, was in the Royal Navy, and survived the Battle of Jutland.p.6,  The elder daughter, Evelyn, married Duncan Vernon Pirie MP, whilst the younger, Gertrude, never married."]}, {"page": "Robert Abercromby, MP", "response": ["#REDIRECT Sir Robert Abercromby, 5th Baronet"]}, {"page": "Munro of Auchinbowie", "response": ["#William Munro (1815–1881), a Major in the 79th Queen's Own Cameron Highlanders, married Elizabeth, daughter of Sir Robert Abercromby, 5th Baronet."]}, {"page": "Forglen House", "response": ["Forglen House is a mansion house that forms the centrepiece of the Forglen estate in the parish of Forglen, northwest of Turriff, Aberdeenshire, in the northeast of Scotland. The lands were given to the abbots of the Abbey of Arbroath by King William the Lion before 1211 and the Monymusk Reliquary was held there. The original castle, built around 1346, was replaced by a vernacular harled house that was later extended. Significant development of the estate began when it was acquired by the family of Lord Banff and they started the work of landscaping and planting trees. It became their main family seat during the 18th century. After the death of William Ogilvy, the eighth and final Lord Banff, the estate passed by marriage to the Abercromby baronets who continued to enhance the property and maintained it as their main residence. Sir Robert Abercromby, 5th Baronet commissioned the Aberdeen City Architect, John Smith to design the present house in 1839.", "The Abercromby baronets owned a significant amount of property in Ireland, as most of the town of Fermoy had been purchased by them from John Anderson in the early 19th century. By 1814 Forglen was used as the main family seat of the Abercromby family; in 1877 they also acquired the 1793-built Dunlugas House, which was sited on the other side of the River Deveron. Lady Jane Abercromby's son, Sir Robert Abercromby, 5th Baronet, continued to enhance the grandeur of the estate policies by commissioning the building of a new mansion and several other buildings."]}, {"page": "Muriel Ashley, Lady Mount Temple", "response": ["She married Rear-Admiral Arthur Forbes-Sempill, the son of William Forbes-Sempill, 17th Lord Sempill and a grandson of Sir Robert Abercromby, 5th Baronet, on 25 November 1903. They divorced in 1914 on the grounds of adultery; the case was not defended. "]}]}}