{"wiki_id": "http://www.wikidata.org/entity/Q7529126", "itemLabel": "Thomas Frankland Lewis", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Frankland_Lewis", "wikipedia_page": {"main": "Sir Thomas Frankland Lewis, 1st Baronet (14 May 1780 – 22 January 1855) was a British Poor Law Commissioner and moderate Tory MP.", "link_mentions": [{"page": "George Cornewall Lewis", "response": ["He was born in London, the son of Thomas Frankland Lewis of Harpton Court, Radnorshire and his wife Harriet Cornewall, daughter of the banker and plantation owner Sir George Cornewall, 2nd Baronet and his wife Catherine Cornewall, daughter of Velters Cornewall."]}, {"page": "Secretary to the Treasury", "response": ["|rowspan=2|Joseph Planta || Thomas Frankland Lewis"]}, {"page": "Treasurer of the Navy", "response": ["|1830||Thomas Frankland Lewis"]}, {"page": "List of political families in the United Kingdom", "response": ["* Thomas Frankland Lewis, MP 1812–55"]}, {"page": "Richard Oastler", "response": ["The ensuing Poor Law Amendment Act set up a three-man Poor Law Commission, an 'at arms' length' quango to which Parliament delegated the power to make appropriate regulations, without making any provision for effective oversight of the Commission's doings. Local poor-rates payers still elected their local Board of Poor Law Guardians and still paid for local poor law provisions, but those provisions could be specified to the Board of Guardians by the Poor Law Commission; where they were the views of the local rate-payers were irrelevant. The Act was passed by large majorities, despite Oastler personally lobbying Tory leaders (including the Duke of Wellington) to oppose it. Oastler's objections were that the Act pursued aims dictated by political economy by un-Christian treatment of the poor (and particularly of the married poor: \"whom God hath joined together let no man part asunder\"), and to ensure this was done with consistent heartlessness was setting up an unconstitutional body. Oastler told the Duke \"if that Bill passes, the man who can produce the greatest confusion in the country will be the greatest patriot, and I will try to be that man\". The chairman of the Commission was Sir Thomas Frankland Lewis, an exact contemporary of Thornhill at Eton", "thumb|One of the 'Somerset House Despots': Sir Thomas Frankland Lewis, (Chairman of Poor Law Commission 1834–39: at Eton with Oastler's employer 1792–98)The new dispensation was implemented progressively, starting with the southern counties of England, where it achieved a considerable reduction in the poor rates. Not until January 1837 were the first steps taken to introduce the system into the West Riding by setting up 'poor law unions' and electing Boards of Guardians for them. The Poor Law Boards were then to appoint a clerk to administer whatever system of relief was specified for that Union by the central Commission. The Commission intended (or said they intended) to allow the new Poor Law Boards in manufacturing areas to continue out-relief, but opponents of the New Poor Law held that best way to defend out-relief was to prevent new Poor Law Boards being established (or clerks to Poor Law Boards being appointed), since their existence would greatly facilitate the cessation of out-relief should the Commission change its mind (or not be telling the truth). Short Time Committee men played a prominent part in organising protest meetings, disruption of Poor Law Board meetings (Keighley, Huddersfield) and/or election of anti- Poor Law 'Poor Law Guardians' (Huddersfield)."]}, {"page": "William Grant (Master of the Rolls)", "response": ["On 24 June 1824, he was appointed to the Royal Commission for inquiring into the nature and extent of the Instruction afforded by the several Institutions in Ireland established for the purpose of Education where he served with the other Commissioners: Thomas Frankland Lewis, John Leslie Foster, James Glassford and Anthony Richard Blake.A copy of the Report of the Commission is available at: http://eppi.dippam.ac.uk/documents/9883/eppi_pages/217631 (accessed 18/11/2012)."]}, {"page": "Poor Law Amendment Act 1834", "response": ["thumb|One of the \"Somerset House Despots\": Sir Thomas Frankland Lewis, Chairman of Poor Law Commission 1834–39", "*Thomas Frankland Lewis – former Tory MP"]}, {"page": "Thomas Lewis", "response": ["*Thomas Frankland Lewis (1780–1855), British Poor Law Commissioner"]}, {"page": "Ennis (UK Parliament constituency)", "response": ["| Thomas Frankland Lewis"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Radnor||Sir Thomas Frankland Lewis, Bt||Liberal"]}, {"page": "Wellington–Peel ministry", "response": ["| Thomas Frankland Lewis"]}, {"page": "Sir Thomas Frankland, 5th Baronet", "response": ["*Anne Frankland (d. 1842), married first John Lewis (by whom she bore Thomas Frankland Lewis), second Rev. Robert Hare"]}, {"page": "Poor Law Commission", "response": ["|Sir Thomas Frankland Lewis||align=right|18 August 1834||–||30 January 1839"]}, {"page": "Sampson Kempthorne", "response": ["He was the son of Rev. John Kempthorne.  He began practising in Carlton Chambers on Regent Street in London. His father was a friend of the Poor Law Commissioner Thomas Frankland Lewis, which may have helped him to get the commission to build workhouses."]}, {"page": "George Nicholls (commissioner)", "response": ["In the meantime the first poor-law commissioners, appointed in February 1832, had drawn up their report. Nicholls had been especially applied to by them (through Mr. Cowell, one of the assistant commissioners) in the course of their inquiries, and the report, published in February 1834, contains frequent favourable references to the system in work at Bingham and Southwell, the principles ultimately recommended as the basis of legislation being those which had been advocated in Nicholls's ‘Letters by an Overseer.’ The Poor-law Amendment Act (4 and 5 Will. IV, c. 76) was passed the same year, and in August Nicholls was appointed one of the three commissioners entrusted with its administration, the other two being Thomas Frankland Lewis (later succeeded by his son George Cornewall Lewis) and John Shaw-Lefevre (later succeeded by Edmund Head); Edwin Chadwick was appointed secretary."]}, {"page": "Radnor (UK Parliament constituency)", "response": ["| Sir Thomas Frankland Lewis"]}, {"page": "Radnorshire (UK Parliament constituency)", "response": ["| rowspan=\"2\" | Thomas Frankland Lewis"]}, {"page": "George Cornewall", "response": ["*Harriet Cornewall (1787-1838), married Thomas Frankland Lewis, 12 January 1805."]}, {"page": "1855 in Wales", "response": ["*22 January – Sir Thomas Frankland Lewis, politician, 74"]}, {"page": "1843 in Wales", "response": ["*October – Sir Thomas Frankland Lewis is appointed to chair the commission of enquiry into the Rebecca Riots."]}, {"page": "1846 in Wales", "response": ["*27 June - Thomas Frankland Lewis is created a baronet."]}, {"page": "1847 in Wales", "response": ["**Sir Thomas Frankland Lewis becomes MP for Radnor Boroughs."]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["* Sir Thomas Frankland Lewis, MP 1812–55, and son George Cornewall Lewis, MP 1847–63."]}, {"page": "1830 in Wales", "response": ["*Sir Thomas Frankland Lewis is appointed Treasurer of the Navy by the Duke of Wellington."]}, {"page": "1839 in Wales", "response": ["*date unknown – Sir Thomas Frankland Lewis resigns as chairman of the Poor Law Commission, to be replaced by his son, George Cornewall Lewis."]}, {"page": "Sir Thomas Lewis, 1st Baronet", "response": ["#REDIRECT Thomas Frankland Lewis"]}, {"page": "1780s in Wales", "response": ["**14 May - Sir Thomas Frankland Lewis, politician (died 1855)"]}, {"page": "1817 in Wales", "response": ["*Sir Thomas Frankland Lewis drafts the report on the Poor Law which brings its abuses to the attention of the public."]}, {"page": "1780 in Wales", "response": ["*14 May - Sir Thomas Frankland Lewis, politician (died 1855)"]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| Thomas Frankland Lewis||8 June 1820||14 May 1780 – 22 January 1855"]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|11 February 1828||Ennis||u||Thomas Frankland Lewis||Thomas Frankland Lewis||Vice President of the Board of Trade", "|9 April 1828||Radnorshire||u*||Walter Wilkins||Thomas Frankland Lewis||Death", "|23 April 1828||Ennis||u||Thomas Frankland Lewis||William Smith O'Brien||Resignation to contest Radnorshire", "|1 March 1830||Radnorshire||u*||Thomas Frankland Lewis||Thomas Frankland Lewis||Treasurer of the Navy"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|Radnorshire||Thomas Frankland Lewis||Tory"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Radnorshire||Thomas Frankland Lewis||Tory"]}, {"page": "Sir Thomas Frankland Lewis", "response": ["#REDIRECT Thomas Frankland Lewis"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|Ennis||Thomas Frankland Lewis||Tory"]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|1 March 1830||Radnorshire||u||Thomas Frankland Lewis||Thomas Frankland Lewis||Treasurer of the Navy", "|11 February 1828||Ennis||u||Thomas Frankland Lewis||Thomas Frankland Lewis||Vice President of the Board of Trade"]}, {"page": "Sir Thomas Frankland Lewis, 1st Baronet", "response": ["#REDIRECT Thomas Frankland Lewis"]}, {"page": "List of fellows of the Royal Society elected in 1820", "response": ["# Thomas Frankland Lewis (1780–1855)"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|Beaumaris || Thomas Frankland Lewis||"]}]}}