{"wiki_id": "http://www.wikidata.org/entity/Q7527807", "itemLabel": "Sir John Graham, 4th Baronet", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_John_Graham,_4th_Baronet", "wikipedia_page": {"main": "Sir John Alexander Noble Graham, 4th Baronet,  (15 July 1926 – 11 December 2019) was a British diplomat who was ambassador to Iraq, Iran and NATO.", "link_mentions": [{"page": "July 15", "response": ["*  1926   – Sir John Graham, 4th Baronet, English diplomat (d. 2019)"]}, {"page": "1926", "response": ["** Sir John Graham, 4th Baronet, English diplomat (d. 2019)"]}, {"page": "John Graham", "response": ["*Sir John Graham, 4th Baronet (1926–2019), British diplomat who was ambassador to Iraq, Iran and NATO"]}, {"page": "Reginald Graham", "response": ["In 1920 Graham married Rachel Sprot, daughter of Sir Alexander Sprot, 1st Baronet. They had one son (who inherited the baronetcy as Sir John Graham, 4th Baronet) and one daughter, Lesley, who married Jock Wykeham Strang Steel.Debrett's Peerage & Baronetage 2011 – Steel of Philiphaugh Baronet"]}, {"page": "Graham baronets", "response": ["The Graham Baronetcy, of Larbert House in Larbert and of Househill in Dunipace in the County of Stirling, was created in the Baronetage of the United Kingdom on 4 December 1906 for John Graham. He was a member of the firm of William Graham and Co, merchants, of Glasgow, and of Grahams Co, of London, East India merchants. This branch of the Graham family is descended from John, third son of Sir David Graham of Dundaff, ancestor of the Dukes of Montrose. The third Baronet was Lieutenant-Colonel Sir Reginald Graham, 3rd Baronet VC OBE, brother of Glenda Spooner founder, chairman and organising secretary of the Ponies of Britain Club. Sir John Graham, 4th Baronet was Ambassador to Iraq from 1974 to 1977 and Iran from 1979 to 1980. His son Sir Andrew Graham, 5th Baronet is a lieutenant general who was Director General of the Defence Academy of the United Kingdom."]}, {"page": "Sir Andrew Graham, 5th Baronet", "response": ["Graham is the son of Sir John Graham, 4th Baronet: he succeeded as 5th Baronet on his father's death on 11 December 2019.  He was educated at Eton College and Trinity College, Cambridge.Mosley, Charles (2003), Burke's Peerage, Baronetage and Knightage: Clan Chiefs, Scottish Feudal Barons"]}, {"page": "Deaths in December 2019", "response": ["*Sir John Graham, 4th Baronet, 93, British diplomat, ambassador to Iraq (1974–1977), Iran (1979–1980) and NATO (1982–1986).Graham"]}]}}