{"wiki_id": "http://www.wikidata.org/entity/Q7525974", "itemLabel": "Sir Alfred Hickman, 1st Baronet", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_Alfred_Hickman,_1st_Baronet", "wikipedia_page": {"main": "Sir Alfred Hickman, 1st Baronet (3 July 1830 – 11 March 1910) was a British industrialist and Conservative party politician who was a Member of Parliament (MP) between 1885 and 1906.\nHickman was the son of George Rushbury Hickman of Tipton, Staffordshire and his wife Mary Haden. His father was the owner of the Moat Colliery in Tipton. Hickman was educated at King Edward's School, Birmingham. He became a colliery proprietor and ironmaster, as the family acquired Springvale Furnace in 1866. He was a director of Lloyd's Staffordshire Proving House, a Member of Council of the Mining Association of Great Britain, and chairman of Staffordshire Railway and Canal Freighter's Association. In 1882 he formed the Staffordshire Steel Ingot & Iron Company Ltd to produce steel using the Bessemer process.Hickman stood for parliament for the Conservatives at Wolverhampton in 1880 but was defeated. Under the Redistribution of Seats Act 1885 the Wolverhampton constituency was divided and in the 1885 general election, Hickman was elected Member of Parliament for Wolverhampton West. He lost the seat in 1886, regained it in 1892 and held it until 1906.Hickman was knighted in 1891 and created a baronet in 1903. He was President of the British Iron Trades Council and President of Wolverhampton Chamber of Commerce. In July 1902 he was given the honorary freedom of the borough of Wolverhampton. In 1906 he became Chairman of the newly formed Tarmac Limited; the company used large quantities of his waste slag. The Staffordshire Steel Ingot & Iron Company later became part of Stewarts & Lloyds.\nOn his death in 1910, he bequeathed a park (Hickman Park) to the people of Bilston.\nHickman married Lucy Owen Smith in 1850. Their eldest son Alfred William Hickman, a Justice of the Peace, died in August 1902, aged 51. His grandson Alfred succeeded to the baronetcy.", "link_mentions": [{"page": "Hickman baronets", "response": ["*Sir Alfred Hickman, 1st Baronet (1830–1910)"]}, {"page": "List of people from Wolverhampton", "response": ["* Sir Alfred Hickman, 1st Baronet (1830–1910) – industrialist and Conservative MP 1885–1906"]}, {"page": "Edwin Butler Bayliss", "response": ["At eighteen he returned to his family's large house in Tettenhall, The Woodhouse. He joined his father's manufacturing firm, but at twenty-seven he had left to pursue his artistic ambitions. He painted works inspired by scenes from both his father's iron foundry and the steel works of Sir Alfred Hickman, 1st Baronet, who was a friend of his father's."]}, {"page": "Alfred Hickman (disambiguation)", "response": ["*Sir Alfred Hickman, 1st Baronet (1830–1910), industrialist and Conservative politician"]}]}}