{"wiki_id": "http://www.wikidata.org/entity/Q7540879", "itemLabel": "Slipmatt", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Slipmatt", "wikipedia_page": {"main": "Matthew Nelson (born 22 April 1967 in Loughton, Essex, England), better known as DJ Slipmatt, is British electronic music producer and DJ. He was one half of breakbeat hardcore group SL2, who had a 1992 UK hit with \"On a Ragga Tip\".\n\n", "link_mentions": [{"page": "Happy hardcore", "response": ["The breakbeat hardcore rave scene was beginning to fragment by late 1992 into a number of subsequent breakbeat-based genres: darkcore (tracks embracing dark-themed samples and stabs), hardcore jungle (reggae basslines and influences became prominent), and 4-beat also known as happy hardcore where piano rolls and uplifting vocals were still central to the sound. DJs such as Slipmatt, DJ Sy, DJ Seduction, Wishdokta, DJ Dougal, and DJ Vibes continued to play and put out music of this nature throughout 1993/4 – notably Slipmatt through the SMD releases, Wishdokta as Naughty Naughty, and Seduction on the Impact label. "]}, {"page": "List of jungle and drum and bass artists", "response": ["* Slipmatt"]}, {"page": "Shitmat", "response": ["Shitmat is used as a pseudonym by artist Henry Collins, who also uses monikers such as Kyler, Armand Van Hard-On and Misty Conditions. DJ Slipmatt took exception to the name when they were both on the same lineup and insisted on Shitmat's name being written in smaller text."]}, {"page": "Kiss (UK radio station)", "response": ["In the mid-late 1990s, DJs and presenters have included: Tall Pall, Matt Jam Lamont, Dreem Teem, Fabio & Grooverider, Brandon Block, Jumpin Jack Frost, Kenny Ken, DJ Hype, Ray Keith, R-Solution (4hero & Kirk Degiorgio), Tony De Vit, and Slipmatt."]}, {"page": "Pure Dance", "response": ["Warren Street, Dan Wood, Matt Forest, Ryan Morrison, Ben & Nixxi, Stu Allan, Billy 'Daniel' Bunter, Slipmatt, Lisa Lashes, Angelli & Nelson, Warp Brothers"]}, {"page": "Helter Skelter (rave music promoter)", "response": ["In 2005, Helter Skelter teamed up with Ministry of Sound to release a compilation CD, 'Hardcore Classics', mixed by Billy Daniel Bunter and Slipmatt. Further compilations followed; 'United In Hardcore' in 2006 and a versus mix with Raindance, in Hardcore 2007 and Billy Daniel Bunter* & Slipmatt – Helter Skelter & Raindance Present The Sound Of Hardcore 2009"]}, {"page": "DJ Slipmatt", "response": ["#redirect Slipmatt"]}, {"page": "Luna-C", "response": ["Kniteforce records were not selling in the numbers Howell had anticipated. To bring more sales to the label, he commissioned a series of remixes from big-name DJs including Slipmatt, Sy, Vibes and Ramos."]}, {"page": "SL2 (group)", "response": ["SL2 are an English breakbeat hardcore group from London, England. They also recorded, remixed or produced under the names Slipmatt & Lime and T.H.C.", "Starting out as a group of three, SL2 was originally a coming together of DJs Matt \"Slipmatt\" Nelson and John \"Lime\" Fernandez, and rap vocalist Jason \"Jay-J\" James. The SL2 name came from the founders' initials: Slipmatt (S) and Lime (L), and the fact that they were a duo, hence \"SL2\".", "Their big break came in 1989 through Slipmatt's older brother, Paul Nelson, who was running the party-promoting organisation Raindance; they became the enterprise's resident DJs, playing parties all over the United Kingdom.", "In 1997, a remix of their biggest hit, \"On a Ragga Tip\" re-entered the chart, leading Slipmatt and Lime to reconvene.  Although no new material was ever released, they still continue to DJ on a semi-regular basis. \"On a Ragga Tip\", was used in the opening ceremony, of the 2014 Commonwealth Games.", "*Slipmatt's official homepage", "*DJ Slipmatt at Fantazia.org", "*DJ Slipmatt - Back to the Old Skool"]}, {"page": "Darren Styles", "response": ["His first records were as part of the breakbeat hardcore group DJ Force & The Evolution (with Paul Hobbs, James Broomfield and Paul Hughes) released in 1993. The group signed to hardcore record label Kniteforce and many of their tracks were played by Carl Cox. The group also produced tracks using the alias A Sense of Summer for another hardcore label Universal Records owned by Slipmatt."]}, {"page": "List of electronic music festivals", "response": ["|style=\"text-align:left\"|One of the best known rave names on the UK rave scene in the late 1980s and early 1990s. The first event was held at a circus tent on 16 September 1989 at Jenkins Lane, Beckton in east London. This was Britain's first legal all-night rave. DJs such as Carl Cox, Dave Angel, LTJ Bukem, Mr C, DJ Rap, John Digweed, Kevin \"Reece\" Saunderson, Slipmatt (where he and partner John \"Lime\" Fernandez would create SL2 during this event in 1989), Fabio and Grooverider started out at Raindance."]}, {"page": "SMD", "response": ["* Slipmatt Dubs (born 1967), Breakbeat hardcore series"]}, {"page": "MC Magika", "response": ["His first appearance at the UK rave Dreamscape (a rave held in the custom-built sanctuary music studios in Milton Keynes) was in 1993, featuring DJs such as Slipmatt, Dougal, Dave Angel, LTJ Bukem, Carl Cox and MC Conrad.Discogs, Dreamscape VI Credited for ruining many DJ sets over the years (with the expert help of the stixman), he appeared on many of the cassette tape compilations of the time including Dreamscape where he was known for his live collaborations with DJ Dougal. This was the dream team of mid 90s hardcore - with Dougal providing the ever cheesier beats and magika and stixman trying to rap over the top of it."]}, {"page": "Raindance (rave music promoter)", "response": ["DJs such as Carl Cox, Dave Angel, LTJ Bukem, Mr C, DJ Rap, John Digweed, Kevin \"Reece\" Saunderson, Slipmatt, Fabio and Grooverider started out at Raindance. Live acts such as Shades of Rhythm, N-Joi and The Prodigy have all played at Raindance.", "From 1989 to 1993, Raindance went on to hold large-scale events across Essex, Cambridgeshire, Leicestershire, Oxfordshire, Somerset and even Spain. The venues Raindance used held up to 10,000 ravers. DJ Slipmatt's brother, Paul Nelson, was one of the original promoters. The original idea to hold a rave came from Slipmatt himself."]}, {"page": "All over the UK", "response": ["* Slipmatt – remixing (track 4)"]}, {"page": "The Dance Years", "response": ["The show featured talking head interviews with artists such as Double 99, Artful Dodger, Faithless, Slipmatt, Fabio, Judge Jules, Joey Negro, Sneaker Pimps, Boy George, Tony Wilson, Graeme Park, Roger Sanchez, Phats & Small and M&S. Following the TV series of The Dance Years, Pearce went on to release a set of compilation albums under the same name in 2009,The Belfast Telegraph and hosted a similarly titled radio series in 2012.Music Week "]}, {"page": "Slipmat (DJ)", "response": ["#REDIRECT Slipmatt"]}, {"page": "The Eclipse (club)", "response": ["Virgin Records would release a two volume retrospective compilation The Eclipse Presents Dance 'Til Dawn in 1996 - one mixed by Stu Allan and the other Slipmatt."]}, {"page": "Happy 2b Hardcore", "response": ["Happy 2b Hardcore was also released to critical acclaim. John Bush of AllMusic rated the album four and a half stars out of five and said it is \"the best place for happy hardcore novices to begin as well as a great mix (by Slipmatt) for fans who already have most of the material.\" He concluded that, \"along with several volumes in the Now We're Totally Bonkers series, the collection is one of the best documents in happy hardcore's immense catalog.\" In 2002, Billboard noted the album's release was a significant moment in the history of Moonshine, \"documenting the underground sound of happy hardcore.\" The album, along with other instalments in the series, later influenced happy hardcore producer one nut Chaos D.", "# JDS – \"Higher Love\" (Slipmatt Remix) – 5:50"]}]}}