{"wiki_id": "http://www.wikidata.org/entity/Q75426", "itemLabel": "Lady Gabriella Kingston", "itemDescription": "English freelance writer (born 1981); daughter of Prince and Princess Michael of Kent", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Gabriella_Kingston", "wikipedia_page": {"main": "Lady Gabriella Marina Alexandra Ophelia Kingston (née Windsor; born 23 April 1981) is an English freelance writer and a member of the British royal family. She is the daughter of Prince and Princess Michael of Kent. She is 56th in the line of succession to the British throne, at her birth she was 18th.", "link_mentions": [{"page": "Prince Philip, Duke of Edinburgh", "response": ["From 20 to 24 December 2019, Philip stayed at King Edward VII's Hospital and received treatment for a \"pre-existing condition\", in a visit described by Buckingham Palace as a \"precautionary measure\". He had not been seen in public since attending Lady Gabriella Kingston's wedding in May 2019. A photo of Philip with the Queen as they isolated at Windsor Castle during the COVID-19 pandemic was released ahead of his 99th birthday in June 2020. In July 2020, he stepped down as Colonel-in-Chief of The Rifles, a position he had held since 2007. He was succeeded by the Duchess of Cornwall."]}, {"page": "Prince Michael of Kent", "response": ["* Lady Gabriella Kingston, born 23 April 1981 at St Mary's Hospital, London; married, 18 May 2019, Thomas Kingston. Educated at Downe House, Brown University in the US, and Linacre College, Oxford.", "| Lady Gabriella Kingston || 23 April 1981 || 18 May 2019 || Thomas Kingston ||"]}, {"page": "Princess Michael of Kent", "response": ["*Lady Gabriella Kingston, born 23 April 1981 at St Mary's Hospital, London. She married Thomas Kingston on 18 May 2019.", "| Lady Gabriella Kingston || 23 April 1981 || 18 May 2019 || Thomas Kingston ||"]}, {"page": "Order of precedence in Northern Ireland", "response": ["#Lady Gabriella Kingston"]}, {"page": "Kensington Palace", "response": ["The Queen gave the keys to the five-bedroom, five-reception grace-and-favour Apartment 10 to Prince and Princess Michael of Kent on the occasion of their marriage in 1978.  Their children, Lord Frederick Windsor and Lady Gabriella Kingston were raised at the residence. In 2008, there was controversy when it was claimed that the couple paid a rent of only £70 per week, though they fulfilled no official duties on behalf of the Queen. The British Monarchy Media Centre denied these reports and stated that, \"The Queen is paying the rent for Prince and Princess Michael of Kent's apartment at a commercial rate of £120,000 annually from her own private funds... This rent payment by The Queen is in recognition of the Royal engagements and work for various charities which Prince and Princess Michael of Kent have undertaken at their own expense, and without any public funding.\"Corrections to inaccurate media stories about the royal family It was announced that from 2010, that Prince and Princess Michael would begin paying rent of £120,000 a year out of their own funds to continue living in the apartment. In 1996, Prince Michael's older brother, Prince Edward, Duke of Kent and his wife Katharine moved into Wren House on the Kensington Palace estate."]}, {"page": "Lady Gabriella Windsor Marina Alexandra Ophelia", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "Succession to the British throne", "response": ["**** (56) Lady Gabriella Kingston (née Windsor; b. 1981) "]}, {"page": "St Mary's Hospital, London", "response": ["*Lady Gabriella Kingston (born 1981) daughter of Prince and Princess Michael of Kent"]}, {"page": "Gabriella M A O Windsor", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "Gabriella Windsor", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "Ella Windsor", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "Descendants of George V", "response": ["|  Lady Gabriella Kingston"]}, {"page": "List of members of the House of Windsor", "response": ["| Lady Gabriella Kingston"]}, {"page": "The Lady Gabriella Windsor", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "Lady Gabriella Windsor", "response": ["#REDIRECT Lady Gabriella Kingston"]}, {"page": "List of Brown University alumni", "response": ["*Lady Gabriella Kingston (A.B. 2004) – freelance writer and member of the royal family of the United Kingdom"]}]}}