{"wiki_id": "http://www.wikidata.org/entity/Q755567", "itemLabel": "Matty James", "itemDescription": "English association football player (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matty_James", "wikipedia_page": {"main": "Matthew Lee James (born 22 July 1991) is an English professional footballer who plays for Championship club Bristol City. His regular position is in midfield, but he can play in defence when required. James began his career with Manchester United, where his brother Reece also came through the youth ranks, but left the club for a spell on loan at Preston North End before joining Leicester City on a permanent basis in 2012.", "link_mentions": [{"page": "July 22", "response": ["*1991 – Matty James, English footballer"]}, {"page": "Alex Ferguson", "response": ["Following the sacking of his son Darren by Preston North End in 2010, Ferguson immediately recalled loaned players Ritchie De Laet, Joshua King and Matty James from Preston under its new managerial system. Ferguson later said that it was the players' own request not to return to Preston after the change of manager. Stoke City manager Tony Pulis followed soon after in recalling two former Manchester United players from Preston as well, stating the need for the players to supplement his team's intensive schedule. Preston were relegated at the end of the season."]}, {"page": "Bacup", "response": ["*Matty James, footballer for Barnsley F.C."]}, {"page": "Dean Hammond", "response": ["Hammond made his Leicester City debut, coming on as a late second-half substitute, in a 2–0 win over Wigan Athletic on 14 September 2013. It wasn't until on 23 November 2013 when he made his first start for the club, in a 2–0 win over Ipswich Town. Hammond scored his first goal for Leicester with a late, headed equaliser against Wigan Athletic on 1 April 2014, helping the Foxes extend their lead at the top of the Sky Bet Championship to seven points. However, since his move to Leicester City, Hammond appeared on the substitute bench, due to strong competitions from central–midfielders duo Danny Drinkwater and Matty James. Hammond played 29 times as Leicester won the Championship en route to promotion to the Premier League."]}, {"page": "James (surname)", "response": ["* Mathew, Matt, Matthew and Matty James (disambiguation), multiple people", "***** Matty James (Matthew Lee James, born 1991), English footballer for Leicester City"]}, {"page": "Darren Ferguson", "response": ["Following his sacking by Preston, his father Sir Alex Ferguson immediately recalled all three Manchester United players on loan at Preston; Joshua King, Ritchie De Laet, and Matty James. In addition, the Stoke City manager Tony Pulis recalled the two Stoke players on loan at Preston; Danny Pugh and Michael Tonge. This meant that in a single week, Preston had lost five key first-team players, effectively sealing the team's relegation."]}, {"page": "The Valley Leadership Academy", "response": ["* Matty James, professional footballer"]}, {"page": "Andy King (footballer, born 1988)", "response": ["King regained his form at the beginning of the following season though, scoring a goal in both the opening 2012–13 Championship fixtures against Peterborough United and Charlton Athletic respectively. King's central midfield partner often changed between Matty James and Danny Drinkwater with former forming a formidable partnership with King in the latter part of the season as Leicester attempted to get their promotion push back on track. King scored his 50th goal for Leicester on the final day of the 2012–13 season away at Nottingham Forest, a game that city won 3–2, a result that clinched 6th place and the final play-off position. King scored 7 times during the 2012–13 season in 48 games.", "Upon his return to Leicester, King's number 10 shirt was reassigned to James Maddison, with King himself taking number 37. On 6 January 2019, King played for the first time of the season for Leicester in the FA Cup defeat against League Two side Newport County. He came on as a substitute for Matty James."]}, {"page": "Ritchie De Laet", "response": ["On 14 May 2012, De Laet signed a three-year deal with Leicester City. He was joined at Leicester by fellow United player Matty James, who signed on the same day. De Laet scored his first goal for Leicester shortly before half time in the 6–1 thrashing of Huddersfield Town on 1 January 2013. He scored his second just four days later, against Burton Albion in the first round of the FA Cup. De Laet ended his first season with Leicester having played 46 games and scoring twice in all competitions, steering City into the Championship play-offs. In the 2013–14 season, he helped Leicester gain promotion back to the top flight playing regularly in the first team once more. De Laet featured 35 times scoring two goals."]}, {"page": "Matty (name)", "response": ["* Matty James (born 1991), English footballer"]}, {"page": "2008–09 Manchester United F.C. season", "response": ["|align=\"left\"|47||align=\"left\"|MF||align=\"left\"| Matty James"]}, {"page": "Matthew James", "response": ["*Matty James (Matthew Lee James, born 1991), English footballer for Leicester City"]}, {"page": "2009–10 Manchester United F.C. season", "response": ["|align=\"left\"|43||align=\"left\"|MF||align=\"left\"| Matty James", "|  Matty James"]}, {"page": "Matthew James (footballer)/version 2", "response": ["#REDIRECT Matty James"]}, {"page": "Joshua King (footballer)", "response": ["After impressing for Manchester United in the 2010–11 pre-season, King joined Championship side Preston North End – managed by Manchester United manager Sir Alex Ferguson's son, Darren – on a three-month loan deal on 7 August 2010, becoming Preston's 1,000th player and linking up with fellow United loanee Matty James. He made his debut the next day, coming on as a 70th-minute substitute for Paul Hayes in Preston's 2–0 defeat by Doncaster Rovers on the opening day of the 2010–11 season.", "King played in seven of Preston's first 12 league games, but suffered an ankle injury at the end of October 2010 that ruled him out for the rest of the loan, and he returned to Manchester United. After his recovery towards the end of November, King returned to Preston on another loan until 4 January 2011; however, he made just one more appearance for the club before being recalled by Manchester United a few days early. Some sources suggested that Alex Ferguson recalled King and fellow loanees Matty James and Ritchie De Laet in retaliation for Preston sacking his son, Darren, but Alex later indicated that King and De Laet had not enjoyed their time at Preston and did not want to return to the club."]}, {"page": "2010–11 Manchester United F.C. season", "response": ["|align=\"left\"|43||align=\"left\"|MF||align=\"left\"| Matty James", "|  Matty James"]}, {"page": "2010–11 Preston North End F.C. season", "response": ["| Matty James || Manchester United || 2 July 2010 || 2 July 2011"]}, {"page": "2011–12 Manchester United F.C. season", "response": ["|align=\"left\"|43||align=\"left\"|MF||align=\"left\"| Matty James"]}, {"page": "2011–12 RFU Championship", "response": ["|FB ||22|| Matty James", "|FH ||22|| Matty James"]}]}}