{"wiki_id": "http://www.wikidata.org/entity/Q7554713", "itemLabel": "Sohini Alam", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sohini_Alam", "wikipedia_page": {"main": "Sohini Alam (Bengali: সোহিনী আলম) is a British singer of Bangladeshi descent who sings in the bands Khiyo, Lokkhi Terra, and GRRRL. She has performed internationally on stage, radio, and television and worked on music for dance, theatre, and film. Alam is a founding member of the arts company Komola Collective  and co-music director of the documentary film Rising Silence. After providing vocals for dancer/choreographer Akram Khan's DESH, she spent three years touring internationally with his show Until the Lions.\n\n", "link_mentions": [{"page": "List of British Bangladeshis", "response": ["* Sohini Alam – Singer in bands Khiyo., Lokkhi Terra and GRRRL. Co-founder of arts company Komola Collective. Vocalist for Birangona: Women of War and Akram Khan's Desh and Until the Lions. Co-Music Director of documentary Rising Silence."]}, {"page": "List of Angelo State University people", "response": ["* Sohini Alam (born 1978), British Bangladeshi singer"]}, {"page": "Oliver Weeks", "response": ["After fieldwork on the Baul musicians (mystic poets and singers) of Bengal, Weeks collaborated with the Bengali singer Moushumi Bhowmik to form the syncretic group Parapar.  He also plays in the instrumental metal band Astrohenge  and formed the band Khiyo with singer Sohini Alam in 2007."]}, {"page": "Kishon Khan", "response": ["Khan set up Lokkhi Terra, a musical project combining Bangladeshi music traditions with those from Africa and Latin America. A few members of the Motimba crew also play for Lokkhi Terra; in addition, the band features the Bengali vocalists Sohini Alam, Aanon Siddiqua and Aneire Khan. Lokkhi Terra have released two albums to date."]}, {"page": "Lokkhi Terra", "response": ["Besides Khan, band members are Justin Thurgur on trombone, Graeme Flowers on trumpet, Phil Dawson on guitar, Tansay Omar on drums, Jimmy Martinez/Patrick Zambonin on bass, Javier Camilo on bongos/vocals, Hassan Mohyeddin on tabla and vocalists Sohini Alam, Aanon Siddiqua, and Aneire Khan. Their albums also feature additional artists including Nazrul Islam on dhol, Pandit Dinesh on tabla, Haider Rahman on bansuri and Finn Peters on flute."]}, {"page": "People's Romeo", "response": ["*Sohini Alam as singer", "The cast of three actors; Delwar Hossain Dilu, Caitlin Thorburn and Leesa Gazi play multiple roles, transitioning from one character, although the story has been pared down. Characters such as Mercutio and Count Paris have been left out all together. Several important parts have been left out, notably, the reason for Romeo not knowing that Juliet has faked her death was omitted. The company of five also includes singer Sohini Alam joining in traditional and modern Bengali folk songs, and percussionist Swagata Biswas provides us with a live musical score. The set was designed by Sophie Jump's and the lighting designed by Howard Hudson."]}, {"page": "Khiyo", "response": ["Khiyo () are an English fusion band of British and Bengali descent formed in London, England in 2007. The three core members of Khiyo are Sohini Alam on vocals, Oliver Weeks on guitar and piano, and Ben Heartland on bass."]}]}}