{"wiki_id": "http://www.wikidata.org/entity/Q7563157", "itemLabel": "Sophy Rickett", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophy_Rickett", "wikipedia_page": {"main": "Sophy Rickett (born 22 September 1970) is a visual artist, working with photography and video/sound installation. She lives and works in London.", "link_mentions": [{"page": "List of photographers", "response": ["* Sophy Rickett (born 1970)"]}, {"page": "Video installation", "response": ["* Sophy Rickett"]}, {"page": "Ed Hughes (composer)", "response": ["Commissions have come from City of London Festival/The Opera Group (an opera, The Birds), Brighton Festival (Memory of Colour, Battleship Potemkin), Glyndebourne Festival Opera / Photoworks (Auditorium, a film with Sophy Rickett), Tacet Ensemble, I Fagiolini, amongst others."]}, {"page": "Anouchka Grose", "response": ["Anouchka Grose (born 1970 in Sydney, Australia) is a British-Australian Lacanian psychoanalyst and writer.Liz Hoggard, Evening Standard, 11 February 2010.  She is a member of The Centre for Freudian Analysis and Research, where she lectures.http://www.cfar.org.uk/ Her journalism has been published by The Guardian,'Why I Envy My Daughter', The Guardian, 6 Feb 2010, https://www.theguardian.com/lifeandstyle/2010/feb/06/maternal-envy-jealous-of-daughter and The Independent,'Before You Condemn, ask: What Would I Have Done?' The Independent, 22 October 2011, https://www.independent.co.uk/opinion/commentators/anouchka-grose-before-you-condemn-ask-what-would-i-have-done-2374292.html and her short stories have appeared in Granta Magazine and The Erotic Review. She also discusses psychoanalysis and current affairs on the radio, appearing on Moral Maze, Broadcasting House, Woman's Hour and Beyond Belief, as well as presenting one of Radio 4's Lent Talks in 2017.  Before training as a psychoanalyst, she studied Fine Art at Goldsmiths' College and was a guitarist and backing vocalist with Terry, Blair & Anouchka (with Terry Hall of The Specials). She has written about numerous artists, including Clare Woods, Joanna Piotrowska, Martin Creed and Sophy Rickett, and has worked with the French-British artist Alice Anderson, writing about her work,http://artnews.org/yvonlambert/?exi=5089&Yvon_Lambert&Alice_Anderson interviewing her, and composing and performing music for her film, The Night I Became a Doll. She played lap steel guitar with Martin Creed's band between 2009 and 2017.Marcus Field, The Independent on Sunday, 15 July 2012, https://www.independent.co.uk/arts-entertainment/art/features/martin-creed-i-can-still-recall-the-naked-fat-polish-woman-7944207.html"]}, {"page": "Rickett", "response": ["*Sophy Rickett (born 1970), visual artist, working with photography and video/sound installation"]}, {"page": "Photography and the Archive Research Centre", "response": ["Val Williams is its director and Brigitte Lardinois its deputy director. The Centre has a core group of members including Tom Hunter, Alistair O'Neill, Patrick Sutherland, Wiebke Leister, Jennifer Good (née Pollard), David Moore, Paul Lowe, Corinne Silva, Paul Tebbs, Mark Ingham, Martina Caruso, Peter Cattrell, Monica Biaglioli, Anne Williams, Jananne Al-Ani, Sophy Rickett, Joanna Love and Sara Davidmann. Current staff are Corinne Silva (Research Fellow), Robin Christian (Projects Manager) and Melanie King (Research Administrator)."]}, {"page": "Bettina von Zwehl", "response": ["In 2010 she was commissioned to take a series of outdoor portraits of athletes and paralympians preparing for the 2012 London Olympics. Recently she has been invited to create works in reaction to the collections of several museums, including the Victoria & Albert Museum (V&A), the Holburne Museum and the Freud Museum. In 2014 she collaborated with her friend and fellow artist Sophy Rickett on a project reacting to an album from the Sir Benjamin Stone Archive at the Library of Birmingham.", "*Album 31 (collaboration with Sophy Rickett), Fotogaleriet, Oslo, Norway (2015)"]}, {"page": "Chris Harrison (photographer)", "response": ["In 1997 Harrison was awarded a scholarship to attend the Royal College of Art and studied alongside Clare Strand, Anne Hardy, Bettina von Zwehl, Sophy Rickett, Gareth McConnell and Alison Jackson"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Sophy Rickett, visual artist"]}, {"page": "List of British women photographers", "response": ["* Sophy Rickett (born 1970), installation artist and photographer"]}]}}