{"wiki_id": "http://www.wikidata.org/entity/Q7562969", "itemLabel": "Sophie Bryant", "itemDescription": "Irish mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Bryant", "wikipedia_page": {"main": "Sophie Willock Bryant (15 February 1850, Sandymount, Dublin, – 14 August 1922, Chamonix, France) was an Anglo-Irish mathematician, educator, feminist and activist.", "link_mentions": [{"page": "February 15", "response": ["*1850 – Sophie Bryant, Irish mathematician, academic and activist (d. 1922)"]}, {"page": "1850 in science", "response": ["* February 15 – Sophie Bryant (died 1922), Irish-born mathematician and educationalist."]}, {"page": "1922 in science", "response": ["* August 29 – Sophie Bryant (born 1850), Anglo-Irish mathematician and educationalist (in hiking accident in the Alps)."]}, {"page": "1884 in science", "response": ["* Sophie Bryant becomes the first woman in England to be awarded the degree of Doctor of Science, by the University of London. Also in this year, she is the first woman to publish a paper with the London Mathematical Society."]}, {"page": "British Psychological Society", "response": ["* Sophie Bryant"]}, {"page": "Bedford College, London", "response": ["*Sophie Bryant (1850–1922), Anglo-Irish mathematician and feminist"]}, {"page": "North London Collegiate School", "response": ["*Sophie Bryant (1895–1918)The book entitled The North London Collegiate School 1850 – 1950 contains references in the index to this person and a black-and-white photographic plate with printed signature- See Bibliography for further detail of book"]}, {"page": "Antipathy", "response": ["Sophie Bryant observed the occurrence of pseudo-antipathy which consists in \"the careless and arbitrary interpretation of another person's acts and expressions in accordance with the worst side of one's self\".Bryant, Sophie. (1895). Antipathy and Sympathy. Mind, 4 (15), pp. 365-370. In other words, people tend to project their own faults onto others and dislike or hate them. Pseudo-antipathy is based on the (implicit) knowledge about the negative sides of a person's own character. Bryant compares the resulting feeling with \"a certain wrong-headed sense of cleansing\"."]}, {"page": "List of women in mathematics", "response": ["* Sophie Bryant (1850–1922), Anglo-Irish mathematician, educator, feminist and activist"]}, {"page": "Sophie Willock", "response": ["#REDIRECT Sophie Bryant"]}, {"page": "Index of women scientists articles", "response": ["*Sophie Bryant"]}, {"page": "Timeline of women's education", "response": ["* United Kingdom: Sophie Bryant becomes the first woman in Britain to earn a DSc."]}, {"page": "October 1901", "response": ["* The British Psychological Society was founded by ten professionals who gathered at University College London, including W. R. Boyce Gibson, William McDougall, W. H. R. Rivers, James Sully, Robert Armstrong-Jones, Frederick Mott and Sophie Bryant.David B. Baker, The Oxford Handbook of the History of Psychology: Global Perspectives (Oxford University Press, 2012) p. 190"]}, {"page": "Isabella Mulvany", "response": ["In 1904 Trinity College, Dublin awarded Honorary Degrees to three leading Irish women, Isabella Mulvany, President of the Irish Association of Women Graduates, Sophie Bryant, principal of North London Collegiate School, Jane Barlow, novelist and author of Irish Idylls."]}, {"page": "Alice Oldham", "response": ["In 1904 Trinity College, Dublin finally admitted women to the University and that year awarded Honorary Degrees to three leading Irish women, Isabella Mulvany, President of the Irish Association of Women Graduates, Sophie Bryant, principal of North London Collegiate School, Jane Barlow, novelist and author of Irish Idylls. Despite her perseverance in getting women admitted to Trinity and the fact of her having achieved a University degree, Oldham was not included in this. Ironically, women were admitted to Trinity just after the death of Provost George Salmon.Royal Irish Academy, Dictionary of Irish Biography – George Salmon by Roderick Gow "]}, {"page": "Rose Stern", "response": ["From 1897 to 1902, Stern worked as a science mistress at the County School, Bangor. In 1902, Stern became a science mistress at North London Collegiate School for Ladies (later \"for Girls\"). NLCS had been founded by Frances Mary Buss (1827-1894), whose father Robert Buss was the first science teacher at the school. Both Frances Mary Buss and her successor Sophie Willock (Dr. Sophie Bryant) emphasized the importance of teaching \"real science\"."]}, {"page": "Grace Chappelow", "response": ["Born in Islington, London, in 1884 to John Stephen Chappelow (a chartered accountant) and Emily Mary Elizabeth Chappelow, Chappelow enjoyed a fairly wealthy upbringing where she was sent to the North London Collegiate School, enjoyed singing,Islington Gazette, 2 November 1903, Northern London Collegiate School. Pupils' Concert, https://www.britishnewspaperarchive.co.uk and had singing lessons with George Bernard Shaw’s mother (Lucinda Elizabeth Shaw), who was an accomplished musicianEncyclopedia of Creativity, volume two, edited by Mark A Runco and Steven R Pritzker, Academic Press, 1999 and who had become the school's singing mistress in January 1886.A Bernard Shaw Chronology, A. Gibbs, Springer, 2001 During her time at the North London Collegiate School, Dr Sophie Bryant was the headmistress,London Daily News, Monday 31 December 1906, https://www.britishnewspaperarchive.co.uk so it is possible that Chappelow from an early age was interested in the suffragette movement. She also had a brother named Claude who was four years her senior."]}, {"page": "List of people associated with Royal Holloway, University of London", "response": ["* Sophie Bryant (1850–1922) Anglo-Irish mathematician, educator, feminist and activist"]}]}}