{"wiki_id": "http://www.wikidata.org/entity/Q7563060", "itemLabel": "Sophie Rundle", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Rundle", "wikipedia_page": {"main": "Sophie Rundle (born 21 April 1988) is a British actress. She is best known for portraying Ada Shelby in the BBC One historical crime drama television series Peaky Blinders, Ann Walker in BBC One and HBO's period drama Gentleman Jack, Vicky Budd in the BBC television series Bodyguard, code-breaker Lucy in the ITV drama series The Bletchley Circle and Labia in the British/American television sitcom Episodes. She also plays Alice in Sky One's 2017 drama Jamestown.", "link_mentions": [{"page": "An Inspector Calls", "response": ["In 2015, an 86-minute An Inspector Calls film was screened on BBC One. Adapted by Helen Edmundson and directed by Aisling Walsh for Drama Republic,BBC One announces ambitious season of classic 20th-century literature, BBC Media Centre, 24 April 2014, Retrieved 28 June 2015 it stars David Thewlis as Inspector Goole,, Evening Standard, 28 August 2015, Retrieved 20 October 2015 Chloe Pirrie as Sheila Birling, Sophie Rundle as Eva Smith/Daisy Renton, Ken Stott as Arthur Birling, Kyle Soller as Gerald Croft, Miranda Richardson as Sybil Birling and Finn Cole as Eric Birling."]}, {"page": "Bournemouth", "response": ["A number of TV actors came from Bournemouth, including , Juliette KaplanJuliette Kaplan website, autobiography  retrieved 28 September 2017 from the BBC comedy Last of the Summer Wine, Ray LonnenThe Guardian website  retrieved 28 September 2017 from the series The Sandbaggers (1978–80), Alison Newman, actress who played Hazel BaileyMetro website  retrieved 28 September 2017 in Footballers' Wives and DI Samantha KeebleDigital Spy website  retrieved 28 September 2017 in EastEnders. Jack Donnelly (born 1985) actor, played the role of Jason Metro website  retrieved 28 September 2017 in the BBC series Atlantis and Sophie Rundle (born 1988) actress, portrayed Ada Shelby Birmingham Mail website  retrieved 28 September 2017 in the BBC One series Peaky Blinders and Ben Hardy (born 1991) actor, played Peter BealeDigital Spy website  retrieved 28 September 2017 in the BBC soap opera EastEnders."]}, {"page": "Rundle", "response": ["*Sophie Rundle, English actress"]}, {"page": "Martin Compston", "response": ["Compston stars alongside Sophie Rundle in the television series The Nest, which began airing on BBC One on 22 March 2020."]}, {"page": "Bournemouth School for Girls", "response": ["* Sophie Rundle, actress"]}, {"page": "Saturday Kitchen", "response": ["* Sophie Rundle"]}, {"page": "1988 in the United Kingdom", "response": ["* 21 April – Sophie Rundle, English actress"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Sophie Rundle (BA Acting 2011)"]}, {"page": "Sally Wainwright", "response": ["Wainwright is the creator of the 2019 HBO and BBC One television series Gentleman Jack starring Suranne Jones as Anne Lister and Sophie Rundle as Ann Walker.", "In 2019, Wainwright's Gentleman Jack, a drama about the 18th-century Yorkshire landowner, diarist, and open lesbian, Anne Lister, played by Suranne Jones, and Lister's courtship of Ann Walker, played by Sophie Rundle, premiered on both BBC One in the UK and HBO in the US."]}, {"page": "1987 in the United Kingdom", "response": ["* 21 April – Sophie Rundle, actress "]}, {"page": "List of Merlin characters", "response": ["Sefa (portrayed by Sophie Rundle) was the servant of Queen Guinevere in \"Arthur's Bane, Part One\", the opening episode of Series 5, Sefa was caught listening to Camelot's councils meeting about how they would attack Izmir, Ruadan's (Ruadan had a brief alliance with Morgana) fortress, however Sefa claimed she was bringing in the Queen's dinner and was believed. But, it turned out that Sefa was in fact Ruadan's daughter and she had been placed in Camelot as a mole for Ruadan. With the information given from Sefa, Ruadan and Morgana ambushed the Knights of Camelot, who were on their way to rescue the captured Percival and Gawaine, who returned to Camelot claiming that there must have been a spy in their midst who had given the information of their whereabouts to Morgana and Ruadan. Guinevere figured it must have been Sefa who had betrayed them and Sefa confessed to the crime, being sentenced to death by Gwen in the absence of Arthur. In the following episode, \"Arthur's Bane, Part Two\", Sefa is due to be hanged for treason. However, Gwen reveals that she will not hang Sefa as she is just trying to capture Ruadan who she will hope will come rescue his daughter. Ruadan does show and does rescue Sefa, however, is stabbed in the process. He and Sefa escape but Ruadan dies a few miles out of Camelot and Sefa runs off, her current whereabouts are unknown."]}, {"page": "Episodes (TV series)", "response": ["* Sophie Rundle as Labia (Seasons 2–3) – Matt's stalker who has been stalking Matt for 15 years. She was a Make-A-Wish child whose wish had Matt take her to Disneyland, but she survives cancer and starts stalking him, leading to him getting a restraining order against her. Nevertheless, he has slept with her more than once. She subsequently outgrows Matt in Season 3."]}, {"page": "Titanic (2012 TV series)", "response": ["| |Sophie Rundle || Roberta Maioni"]}, {"page": "Merlin (series 5)", "response": ["* Sophie Rundle as Sefa"]}, {"page": "The Bletchley Circle", "response": ["* Sophie Rundle as Lucy, the youngest member of the circle. She is married to an indolent man named Harry, who beats her when she returns from an investigation. Lucy has an eidetic memory and specialises in recalling and processing data."]}, {"page": "Peaky Blinders (TV series)", "response": ["| Sophie Rundle", "* Sophie Rundle as Ada Thorne, née Shelby, the Shelby brothers' only sister."]}, {"page": "Shetland (TV series)", "response": ["*Sophie Rundle as Sophie"]}, {"page": "Dickensian (TV series)", "response": ["| Honoria, Lady Dedlock || Sophie Rundle || 1–20 "]}, {"page": "Tamaryn Payne", "response": ["| Alongside Chris R. Wright, Warwick Davis, Hannah Flint & Sophie Rundle"]}, {"page": "Matt Stokoe", "response": ["Stokoe is engaged to actress Sophie Rundle, whom he met on the set of Bodyguard. Stokoe and Rundle welcomed their first child, a son, in April 2021."]}, {"page": "An Inspector Calls (2015 TV film)", "response": ["* Sophie Rundle as Eva Smith/Daisy Renton/Mrs Birling/Alice Grey"]}, {"page": "Holy Trinity Church, Goodramgate, York", "response": ["The ceremony was recreated on location in the church for the series finale of the 2019 BBC dramatisation of the life of Anne Lister, Gentleman Jack starring Suranne Jones and Sophie Rundle as Anne Lister and Ann Walker respectively."]}, {"page": "Not Safe for Work (TV series)", "response": ["* Sophie Rundle as Jenny"]}, {"page": "Brief Encounters (TV series)", "response": ["* The Daily Telegraph gave it 4 out 5: 'Brief Encounters: these desperate housewives were funny and full of heart: Brief Encounters (ITV) is a sparky new six-part drama about Ann Summers reps in Eighties Yorkshire, set against a backdrop of unemployment. An unpromising pitch on paper, perhaps, but this first episode was a revelation: frank, funny, and full of heart. Going against her family’s wishes, married mother Steph (Sophie Rundle) made a life-changing decision to run parties selling “exotic lingerie and marital aids”. She roped in two working-class pals and Pauline (Penelope Wilton), the well-to-do lady for whom she cleaned. This motley quartet soon declared: “It’s our duty to sexually awaken the women of Sheffield.\" It was as if Victoria Wood had rewritten The Full Monty. Brief Encounters was drama by women, about women – but not just for women.'"]}, {"page": "Jamestown (TV series)", "response": ["*Sophie Rundle as Alice Kett – Farm girl betrothed to Henry Sharrow but married to his brother Silas"]}, {"page": "Bodyguard (British TV series)", "response": ["* Sophie Rundle as Vicky Budd, David's wife and the mother of their two children, who works as a ward sister at a London hospital. David's unpredictable moods and issues with PTSD since returning from Afghanistan left them estranged.BBC One-Bodyguard-Vicky Budd www.bbc.co.uk. BBC One-Bodyguard."]}, {"page": "Gentleman Jack (TV series)", "response": ["* Sophie Rundle as Ann Walker, Anne Lister's love interest", "In July 2017, the series was renamed Gentleman Jack and Suranne Jones was announced in the protagonist role of Lister. Wainwright, who had previously worked with Jones in Scott & Bailey and Unforgiven, deemed her capable of embodying the \"boldness, subtlety, energy and humour\" required to depict Lister. In April 2018, Sophie Rundle joined the production as Ann Walker, Lister's intended spouse."]}, {"page": "2018 in British television", "response": ["| 3 || Bodyguard || 14.3 || 23 September || BBC One || The final episode of the first series. Aikens (Matt Stokoe) abducts Budd (Richard Madden) and fits him inside a suicide vest. The police then are called by Budd and refuse to believe his version of events as they believe he is involved in the conspiracy due to his links to Apsted (Tom Brooke). Budd suspects MI5 is watching him and gives false information regarding the information of the kompromat. The security service then sends Longcross (Michael Schaeffer) to retrieve it, who is then arrested by the police on site. Budd's innocence is then proven after he leads the police to his flat and Vicky (Sophie Rundle) discovers the kompromat and blank rounds from his firearm. Budd then discovers that Craddock (Pippa Haywood) is the police insider for Aikens. She then confesses to providing Aikens information regarding Montague's (Keeley Hawes) whereabouts which led to her assassination and chose Budd to be her PPO as his background made him the perfect fall guy. Nadia (Anjli Mohindra) is later interviewed again and is revealed to have lied about Longcross's e-fit and is the builder of the explosive devices and led to the attack on the school of Budd's children."]}, {"page": "List of people from Bournemouth", "response": ["* Sophie Rundle (born 1988) actress, portrayed Ada Shelby in the BBC One series Peaky Blinders"]}, {"page": "Risa Shimizu (actress)", "response": ["|Sophie Rundle"]}, {"page": "Talking to the Dead (TV series)", "response": ["Talking to the Dead is a two-part British television crime drama, written by Gwyneth Hughes and directed by China Moo-Young, that first broadcast on Sky Living on 15 October 2013. The series, which stars Sophie Rundle and Russell Tovey in the principal roles, follows Fiona Griffiths (Rundle), a detective constable with the Cardiff Major Crimes Squad, who tries to solve the murders of a prostitute and her daughter, while dealing with the effects of Cotard's syndrome, which has left her with a deep and peculiar empathy for the dead.", "Jane Simon of The Mirror wrote a similar review, commenting; \"The last in the Drama Matters series is my least favourite but, ironically, the one most likely to go to a full series because it’s another off-kilter police procedural of the kind TV viewers can’t seem to get their fill of. It’s also the only one in the run to be served up in two parts with the concluding half on Thursday. Sophie Rundle, who’s currently being so ballsy in Peaky Blinders, stars as the terrifyingly young-looking detective constable Fiona Griffiths with Russell Tovey as a fellow cop. I was really looking forward to the moment when Fiona would solve her first murder by actually talking to the dead, or more specifically, the moment when the dead would talk to her. But like Wire in the Blood and Waking the Dead, that title promises much more spookiness than it delivers.\"", "Ellen Jones of The Independent published a slightly more positive review, writing; \"Detective Fiona Griffiths began her first day in a new job by clumsily dropping all her casework folders at the feet of her CO. Apparently, she's old enough to be investigating murders, despite looking approximately 12. You may recognise the actress as 25-year-old Sophie Rundle, who plays Ada Shelby in BBC2's Peaky Blinders. That's the more glamorous role, but it's her performance in this two-part crime drama that really reveals Rundle's charm. This adaptation clearly struggled to sort the story's myriad details into a properly paced sixty minutes, but once you gave up on following the murder plot, there was plenty else to enjoy. The four previous one-off dramas in Sky Living's Drama Matters series have varied from unsatisfying morsels to hearty dramatic meals. Like one of Kimberly's perfectly baked canapés, Talking to the Dead offered just enough flavour to tantalise, while leaving us hungry for the next course.\"", "* Sophie Rundle as DC Fiona Griffiths "]}, {"page": "The Midnight Sky", "response": ["The film was announced in June 2019, with George Clooney directing and starring. Netflix would distribute, with filming set to begin in October. Felicity Jones was added to the cast in July. Jones became pregnant sometime after having been cast. Clooney opted to rewrite her character as pregnant versus using a body double. Kyle Chandler and David Oyelowo joined the cast in August. Tiffany Boone and Caoilinn Springall were added in October. In November 2019, Demián Bichir joined the cast of the film. Sophie Rundle, Ethan Peck, Tim Russ and Miriam Shor were announced as being added in January 2020."]}, {"page": "Ann Walker (landowner)", "response": ["Gentleman Jack is a historical drama television series created by Sally Wainwright, co-produced by HBO and Lookout Point (for the BBC), and starring Suranne Jones as landowner and industrialist Anne Lister and Sophie Rundle as wealthy neighbouring heiress Ann Walker. The series begins in 1832 in Halifax, West Yorkshire and is based on the collected diaries of Lister, which contain over five million words, one-sixth of which are written in code. Series one premiered on 22 April 2019 in the United States, and on 19 May 2019 in the United Kingdom. It was renewed for a second series by BBC One on 23 May 2019. Penguin Books published a companion volume to the series Gentleman Jack: The Real Anne Lister by the series' senior consultant, Anne Choma, which includes newly transcribed and decoded entries from Lister's diaries. The drama's end credits acknowledge that it was \"inspired by the books Female Fortune and Nature's Domain\" by Jill Liddington, who acted as consultant and whose own website summarises Lister's extraordinary life as \"dazzling worldly achievements plus unbuttoned lesbian affairs.\" O'Hooley & Tidow's song \"Gentleman Jack\" serves as the series' primary theme music."]}, {"page": "Elizabeth Is Missing", "response": ["*Sophie Rundle as Susan \"Sukey\" Jefford, Maud's sister who went missing seventy years earlier"]}, {"page": "The Nest (British TV series)", "response": ["The Nest is a BBC One five-part television drama series starring Sophie Rundle and Martin Compston as a married couple unable to conceive with Mirren Mack as the 18-year-old who offers to be their surrogate mother. Broadcasting began on 22 March 2020.", "* Sophie Rundle as Emily Docherty", "The Nest was filmed in Glasgow, East Kilbride, Paisley and Helensburgh. Emily (Sophie Rundle) and Dan's (Martin Compston) house in the series is called Cape Cove, a holiday rental house on the shore of Scotland's Loch Long. Speaking on finding the house, producer Clare Kerr said: \"It was a challenge, but it was always in the script, and because water runs through the script as a kind of theme... We were really lucky in that nobody else had used it, because it's got such a particular look.\" The scenes where Emily is swimming were also filmed in Loch Long. Kaya's (Mirren Mack) flat is situated in Gorbals, while the fictional \"Calderwood Falls\" waterfall is located at the Devil's Pulpit. The Devil's Pulpit has previously been used as a setting for Starz period drama Outlander."]}, {"page": "Mirren Mack", "response": ["Mack made her professional acting debut in a stage production of Bat Boy as Mayor Maggie. She then made her television debut in three episodes of the Netflix series Sex Education as Florence. In 2020, Mack was cast in her first leading role as Kaya on the BBC drama series The Nest alongside Martin Compston and Sophie Rundle.  Mack came out of Covid lockdown to appear in the 7th series of Portrait Artist of the Year on Sky Arts."]}]}}