{"wiki_id": "http://www.wikidata.org/entity/Q7563042", "itemLabel": "Sophie Morgan", "itemDescription": "British television personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Morgan", "wikipedia_page": {"main": "Sophie Morgan (born 1985) is a British Television Presenter and Disability Advocate. Morgan sustained a T6 spinal cord injury in a road traffic accident in 2003, resulting in paralysis from the chest down. In 2021, she was a lead presenter for Channel 4's TV coverage of the Summer Paralympics in Tokyo. She  has been voted one of the most influential disabled people in the UK.\n\n", "link_mentions": [{"page": "Loose Women", "response": ["| style=\"text-align:center\" |Sophie Morgan"]}, {"page": "Beyond Boundaries", "response": ["The team included Ade Adepitan, Jane Atkinson, Amar Latif, Sophie Morgan, Daryl Beeton, Warren Wolstencroft, Karl Sacks, Glenn Kirk, Lorraine Pooley, Charlie Fennel and Toby Farrar – two in wheelchairs, one deaf, one blind, one double foot amputee, two arm amputees, one with spina bifida and the other three were single leg amputees. Only seven participants finished the expedition."]}, {"page": "Simon Rimmer", "response": ["| 3 series; with Kate Quilton,  Adam Pearson & Sophie Morgan", "| With Sophie Morgan"]}, {"page": "BAFTA Award for Best Short Film", "response": ["|Bouncer || Michael Baig Clifford, Natasha Carlish, Sophie Morgan, Geoff Thompson"]}, {"page": "Morgan (surname)", "response": ["*Sophie Morgan (born 1985), British television presenter", "*Sophie Morgan (author) (born 1979), British author", "*Sophie Morgan (singer-songwriter) (born 1997), English singer-songwriter"]}, {"page": "Britain's Missing Top Model", "response": ["The show followed eight young women with disabilities, who competed for a modelling contract (which included a photo shoot with Rankin and a cover photo in Marie Claire). One of the contestants, Sophie Morgan, had already appeared on another reality TV show, Beyond Boundaries, in 2005. The series aired over a period of five weeks. The women lived together and competed in a series of challenges and photo shoots. Each week, at least one contestant was sent home.", "*First Call-Out: Sophie Morgan", "*Bottom Two: Jessica Kellgren-Hayes & Sophie Morgan", "*Final Two: Kelly Knox & Sophie Morgan", "| Sophie Morgan"]}, {"page": "Carolyne Underwood", "response": ["Underwood was one of the first disabled Reality TV show contestants to appear in two different Reality TV shows about disability. Sophie Morgan, who appeared in Beyond Boundaries and Britain's Missing Top Model, is the other disabled woman who has also appeared in two reality shows in the UK. Underwood participated in BBC Three's Dancing on Wheels in 2010, competing in a ballroom dancing competition with the English rugby league player Martin Offiah as her dancing partner,BBC programmes. Retrieved 6 October 2012 and in the first series of The UndateablesThe Undateables. CarolyneFrom wheelchair dancing to dating. The Ouch Blog. BBC. Retrieved 6 October 2012 which was shown on Channel 4 in 2012. Underwood also appeared briefly at the end of the second series of 'The Undateables' in an episode shown on Channel 4 on 5 February 2013 entitled 'Series One Revisited', and in Episode 5 of Series 4 in February 2015 in an episode entitled \"Two weddings and a baby\"."]}, {"page": "Kate Quilton", "response": ["In 2015, she presented Superfoods: The Real Story, a four-part series for Channel 4. The show returned for a second series of six episodes in 2016. She presented The Shopper's Guide to Saving Money, with David Fishwick, for four episodes in 2015. Since January 2016, she presented Tricks of the Restaurant Trade alongside Simon Rimmer. The programming returned for a second series in November 2016. For the third series, she was replaced by Sophie Morgan. In 2016, she co-presented Be Your Doctor on Channel 4, alongside Tamal Ray. She took part in a special edition of Christmas University Challenge in December 2016, as part of the University of Bristol alumni team."]}, {"page": "Cosmopolitan Ultimate Women of the Year Awards", "response": ["* Ultimate Campaigner – Sophie Morgan"]}]}}