{"wiki_id": "http://www.wikidata.org/entity/Q7562875", "itemLabel": "Sophia Duleep Singh", "itemDescription": "British suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophia_Duleep_Singh", "wikipedia_page": {"main": "Princess Sophia Alexandrovna Duleep Singh (8 August 1876 – 22 August 1948) was a prominent suffragette in the United Kingdom. Her father was Maharaja Sir Duleep Singh, who had been taken from his kingdom of Punjab to the British Raj, and was subsequently exiled to England. Sophia's mother was Bamba Müller, and her godmother was Queen Victoria. She had four sisters, including two half-sisters, and four brothers. She lived in Hampton Court in an apartment in Faraday House given to her by Queen Victoria as a grace and favour.\nDuring the early twentieth century, Singh was one of several Indian women who pioneered the cause of women's rights in Britain. Although she is best remembered for her leading role in the Women's Tax Resistance League, she also participated in other women's suffrage groups, including the Women's Social and Political Union.", "link_mentions": [{"page": "Golders Green Crematorium", "response": ["* Sophia Duleep Singh (1876–1948) Indian princess and suffragette, daughter of the last Maharaja of the Punjab. Cremated here, ashes scattered in the Punjab."]}, {"page": "Isleworth", "response": ["Within the old union workhouse complex stood a school, facing Twickenham Road, called Percy House – Percy being the surname of the dukes of Northumberland. Owing to its gradual disuse as a school it was adapted to function as a military hospital during World War I of 1914–18. From 1915 onwards it treated some 5,000 war-wounded soldiers, and ceased operation at the end of 1918. Among the VAD nurses was Sophia Duleep Singh. The building was demolished in 1978."]}, {"page": "Women's Social and Political Union", "response": ["* Sophia Duleep Singh"]}, {"page": "List of suffragists and suffragettes", "response": ["*Sophia Duleep Singh (1876–1948) – had a leading role Women's Tax Resistance League, the Women's Social and Political Union", "* Sophia Duleep Singh (1876–1948) – had leading roles in the Women's Tax Resistance League, and the WSPU"]}, {"page": "Women's Tax Resistance League", "response": ["*Princess Sophia Duleep Singh"]}, {"page": "Voluntary Aid Detachment", "response": ["*Sophia Duleep Singh, suffragette "]}, {"page": "Black Friday (1910)", "response": ["On 18 November 1910, in an attempt to resolve the parliamentary impasse arising from the House of Lords veto on Commons legislation, Asquith called a general election, and said that parliament would be dissolved on 28 November; all remaining time was to be given over to official government business. He did not refer to the Conciliation Bill. At noon on the same day the WPSU held a rally at Caxton Hall, Westminster. The event had been widely publicised, and the national press were prepared for the expected demonstration later in the day. From Caxton Hall, approximately 300 members—divided into groups of ten to twelve by the WSPU organiser Flora Drummond—marched to parliament to petition Asquith directly. The deputation was led by Emmeline Pankhurst. The delegates in the lead group included Dr Elizabeth Garrett Anderson, Dr Louisa Garrett Anderson, Hertha Ayrton and Princess Sophia Duleep Singh. The first group arrived at St Stephen's entrance at 1:20 pm. They were taken to Asquith's office where his private secretary informed them that the prime minister refused to see them. They were escorted back to St Stephen's entrance, where they were left to watch the demonstration."]}, {"page": "1948 in the United Kingdom", "response": ["* 22 August – Sophia Duleep Singh, Princess and suffragette (born 1876)"]}, {"page": "Women in Sikhism", "response": ["*Princess Sophia Duleep Singh,  prominent suffragette of womans civil rights movemenent in the United Kingdom "]}, {"page": "Charlotte Despard", "response": ["From 1912 to 1921, she worked with Kate Harvey, another pacifist feminist and tax resister, along with other prominent members like Sophia Duleep Singh. She wrote in her diary re Kate Harvey that \"the anniversary of our love\" began on 12 January 1912, though it remains unclear the extent of what she meant by the words. Kate Harvey converted her house, Brackenhill, in Highland Road, Bromley, to a thirty-one-bed hospital, initially intended for wounded soldiers in World War I. However, refugee women and children were sent there instead. Despard and Harvey bought a 12-acre tract in Upper Hartfield, which they also called 'Brackenhill'. Previously, Harvey had become involved in Theosophy, as did Despard and the children from Bromley were transferred to The Cloisters, an open-air school dedicated to that cause in Letchworth. The School in Hartfield became an Open Air School, which closed in 1939."]}, {"page": "Anita Anand (journalist)", "response": ["* Anand, Anita. (2015) Sophia: Princess, Suffragette, Revolutionary. Bloomsbury Publishing, . It tells the story of the Indian princess Sophia Duleep Singh, granddaughter of the last Sikh Maharani and Maharaja of Lahore. She was born in exile in England, and went on to struggle for causes including Indian independence, the welfare of Indian soldiers in the First World War and women's suffrage. Anand also presented Sophia, Suffragette Princess, a 30-minute television documentary programme based on the book, which aired first on BBC One in late November 2015. "]}, {"page": "Feminism in India", "response": ["* Sophia Duleep Singh – prominent suffragette and daughter of Maharaja Duleep Singh. She was a firebrand feminist and is best remembered for her leading role in the Women's Tax Resistance League, but she also participated in other women's suffrage groups including the Women's Social and Political Union. Secret documents revealed her identity as a firebrand \"harridan law breaker\" for her diaries revealed that she maintained contacts with the leaders of the Indian nationalist movement like Gopalkrishna Gokhale, Sarala Devi and Lala Lajpat Rai."]}, {"page": "Louisa Garrett Anderson", "response": ["From 1903, Anderson had been active in organizations affiliated with the NUWSS, which advocated for gaining voting rights through peaceful means. Frustrated by the lack of progress on voting rights, in 1907, she became an active member of the more radical WSPU. On 18 November 1910, Anderson joined her mother, Emmeline Pankhurst, Alfred Caldecott, Hertha Ayrton, Mrs Elmy, Hilda Brackenbury, Princess Sophia Duleep Singh, and 300 women to petition Prime Minister Asquith for voting rights. The protest became known as Black Friday, due to the violence and sexual assault the protesters faced from the police and male bystanders. More than one hundred women were arrested, including Anderson, but all were released without charge. In 1912, she was imprisoned in Holloway, briefly, for her suffragette activities which included breaking a window by throwing a brick. In 1914, Anderson joined Agnes Harben and the new group of women and men: H. J. Gillespie, Gerald Gould, Bessie Lansbury and George Lansbury, Mary Neal, Emmeline Pethick-Lawrence, Julia Scurr and John Scurr, Evelyn Sharp, and Edith Ayrton, Louise Eates and Lena Ashwell  in starting the United Suffragists which grew to have branches in London, Liverpool, Edinburgh and Glasgow."]}, {"page": "British Indians", "response": ["thumb|Sophia Duleep Singh - British Indian suffragette sells newspapers", "Sophia Duleep Singh was a suffragette of Indian origin. A number of organisations exist that have been established by British Indians to promote and advocate for issues important to Indian Britons. These include the India League (formally established in 1928), which was a Britain-based organisation whose aim was to campaign for the full independence and self-governance of India. It has more recently (in 2020) been resurrected as the 1928 Institute; its new objectives include 'being a think-tank which examines the views of Indians in the UK'. It received publicity for its aim to be conduct the first ever survey of British Indian Census to collate data around Britain's estimated 1.5 million British Indians. The Indian Workers' Association (IWA) is a political organisation in Great Britain consisting of Indian immigrants to Britain and their descendants. IWA branches are organised in some major cities such as Birmingham and London. It fought  for better working and living standards, it also lobbied for Indian independence and campaigned on issues such as racism and on civil liberties."]}, {"page": "1876 in the United Kingdom", "response": ["** Sophia Duleep Singh, Princess and suffragette (died 1948)"]}, {"page": "List of British Indians", "response": ["*Sophia Duleep Singh, suffragette"]}, {"page": "Suffragette", "response": ["Prominent British-Indian suffragette Sophia Duleep Singh, the third daughter of the exiled Sikh Maharajah Duleep Singh, campaigned for support for the British Indian Army and lascars working in the Merchant Navy. She also joined a 10,000-woman protest march against the prohibition of a volunteer female force. Singh volunteered as a British Red Cross Voluntary Aid Detachment nurse, serving at an auxiliary military hospital in Isleworth from October 1915 to January 1917.", "* Sophia Duleep Singh"]}, {"page": "Sophia Alexandra Duleep Singh", "response": ["#REDIRECT Sophia Duleep Singh"]}, {"page": "Sophia Alexandra Singh", "response": ["#REDIRECT Sophia Duleep Singh"]}]}}