{"wiki_id": "http://www.wikidata.org/entity/Q7563017", "itemLabel": "Sophie Kennedy Clark", "itemDescription": "Scottish actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Kennedy_Clark", "wikipedia_page": {"main": "Sophie Kennedy Clark (born 1990) is a Scottish actress. She is the daughter of actress and singer Fiona Kennedy and the granddaughter of singer Calum Kennedy.", "link_mentions": [{"page": "Calum Kennedy", "response": ["Kennedy's daughter Fiona is also a singer and was, for a time, co-host of the long-running BBC children's series Record Breakers with Roy Castle, and his granddaughter, model, and actress, Sophie Kennedy Clark. Kennedy's owned Leethland House, Glenpatrick Road, Elderslie. Which since a fire has been left in ruins. As well as Fiona, Calum also has another five daughters, Kirsteen, Morag, Morven, Deirdre from his first marriage to Ann Gilles and Eilidh from his second marriage to Christine Kennedy."]}, {"page": "List of Scottish actors", "response": ["*Sophie Kennedy Clark (born 1990)"]}, {"page": "List of British actors", "response": ["* Sophie Kennedy Clark (born 1990)"]}, {"page": "Dark Shadows (film)", "response": ["* Sophie Kennedy Clark as Hippie Chick 1"]}, {"page": "Colin Vaines", "response": ["In 2015, he produced The Marriage of Reason and Squalor, directed by Turner-nominated artist Jake Chapman, and starring Rhys Ifans and Sophie Kennedy Clark. Written by Brock Norman Brock from the book by Jake Chapman, this surreal take on romance novels was financed largely by Sky Arts, who transmitted a four-part version. A feature version for the international theatrical market premiered at the Edinburgh International Film Festival."]}, {"page": "Kieran Leonard", "response": ["On 2 June 2017, Saint Leonard released 'Little Girl Scientist', the first single from the album. A music video was released on 12 June, directed by Markus Schroder and starring Sophie Kennedy Clark; with Jonathan Meades providing additional narration."]}, {"page": "Single Father (TV series)", "response": ["*Sophie Kennedy Clark – Tanya, Dave's 18-year-old daughter by his first marriage to Michelle, who also has a three-year-old son"]}, {"page": "Nymphomaniac (film)", "response": ["Several years later, Joe engages in a contest with her friend B (Sophie Kennedy Clark) during a train journey; whichever of the two women has sex with the most passengers by the train's arrival at the station wins a bag of chocolate sweets. After having sex in the toilet with several of the men she comes across, Joe wins by performing a blowjob on a passenger in a first class car, S (Jens Albinus). S is a married man who resists both her and B's advances, but ultimately Joe forces herself on him. Joe tells Seligman her encounter with S is the first of many terrible things she's done, but he waves off her accusation.", "* Sophie Kennedy Clark as B"]}, {"page": "List of LGBT-related films of 2013", "response": ["| Nymphomaniac || Lars von Trier || United KingdomDenmarkBelgiumFranceGermany || Drama || Charlotte Gainsbourg, Stellan Skarsgård, Stacy Martin, Shia LaBeouf, Christian Slater, Jamie Bell, Uma Thurman, Willem Dafoe, Mia Goth, Sophie Kennedy Clark, Connie Nielsen, Michaël Pas, Jean-Marc Barr, Udo Kier || ||"]}, {"page": "List of British films of 2013", "response": ["|| Director: Lars von Trier   Cast: Charlotte Gainsbourg, Stellan Skarsgård, Stacy Martin, Shia LaBeouf, Christian Slater, Uma Thurman, Sophie Kennedy Clark, Connie Nielsen, Jamie Bell, Willem Dafoe, Mia Goth, Michaël Pas, Jens Albinus, Jean-Marc Barr, Udo Kier"]}, {"page": "Philomena (film)", "response": ["In addition to the main cast, Sophie Kennedy Clark plays a young Philomena, Kate Fleetwood plays a young Sister Hildegarde, Simone Lahbib plays Kate Sixsmith, Cathy Belton plays Sister Claire, Charlie Murphy plays Kathleen, Amy McAllister plays Sister Anunciata, Sean Mahon plays Michael, Philomena's son, and Peter Hermann plays Pete Olsson."]}, {"page": "Stonehearst Asylum", "response": ["* Sophie Kennedy Clark as Millie"]}, {"page": "Tomorrow (2018 film)", "response": ["Tomorrow is a 2018 British drama film directed by Martha Pinson, written by Stuart Brennan and Sebastian Street, and starring Sebastian Street, Stuart Brennan, Stephen Fry, Sophie Kennedy Clark, James Cosmo, Paul Kaye, Stephanie Leonidas and Joss Stone. Its plot concerns the difficulties faced by soldiers returning home from war. It is the directorial debut of Pinson, a long-time script supervisor to Martin Scorsese. Filming began on 22 September 2014 in London and shot for nine weeks, then moved to Spain, for a further week.", "* Sophie Kennedy Clark as Lee-Anne", "On 22 September the complete cast was announced, which includes Stephen Fry, Sophie Kennedy Clark, Paul Kaye, Stephanie Leonidas, Joss Stone, Stuart Brennan and Sebastian Street. On 17 October James Cosmo joined the film. "]}, {"page": "2014 British Academy Scotland Awards", "response": ["Sophie Kennedy Clark – Philomena as Young Philomena"]}, {"page": "Keep the Village Alive", "response": ["The lead-single from the album, \"C'est la Vie\", was first played on The Chris Evans Breakfast Show and was released the following day. A music video was released the same day on Stereophonics' Vevo channel, it was directed by Kelly Jones with cinematography by John Conroy and stars Antonia Thomas, Aneurin Barnard and Mathew Aubrey. The second single, \"I Wanna Get Lost With You\", was released on 21 July 2015 – the music video was released the day before, starring Barnard and Sophie Kennedy Clark. The third single, \"Song for the Summer\", was released on 27 November 2015 but the music video was uploaded to the band's YouTube channel a month before and stars only them. \"White Lies\" was released as the fourth single on 19 February 2016, the music video was uploaded to YouTube a day before, directed by Jones and features the band performing live at one of their December 2015 shows."]}, {"page": "I Wanna Get Lost with You", "response": ["The music video for \"I Wanna Get Lost With You\" aired on 20 July 2015 and was directed by Kelly Jones. It stars Aneurin Barnard (who was previously in the \"C'est la Vie\" video) along with Sophie Kennedy Clark who play unnamed characters. The opening shots are the band playing their instruments in a room filled with coloured christmas lights. By the time Jones starts singing, the first shot of Barnard is shown with him pouring shots in a bar, with the same lights shown in the background. Soon after, Kennedy Clark has arrived and is offered a shot from Barnard. After the first chorus both characters have left the bar and are shown hanging out in different scenarios: walking together in the rain, Barnard playing guitar and both of them kissing. During the song's bridge, the characters are under a bridge arguing and eventually Kennedy Clark walks away; Barnard runs after her and after talking with one another both of them make-up. The remaining shots are again both the characters hanging out kissing, riding a bike, running down a street, Kennedy Clark now playing guitar and lying in grass."]}, {"page": "Go North (film)", "response": ["Go North is a coming-of-age thriller film directed by Matt Ogens and co-written by Kyle Lierman and Ogens. The film stars Jacob Lofland, Sophie Kennedy Clark, Patrick Schwarzenegger, and James Bloor.", "* Sophie Kennedy Clark as Jessie", "Greg Kuehn  is scoring the film, with Josh Gold and Jay Thames producing the film. Matt Ogens and Kyle Lierman co-wrote the script and Ogens would direct the film. Music Supervision by Donny Dykowsky. The cast would be Jacob Lofland, Sophie Kennedy Clark, Patrick Schwarzenegger, and Atif Hashwi. James Bloor also joined the film later.  Jostein Sagnes joined the cast in the feature film and starred in the promotional VR experience."]}, {"page": "James Bloor (actor)", "response": ["Bloor starred in the thriller film Go North along with Jacob Lofland, Sophie Kennedy Clark, and Patrick Schwarzenegger. Matthew Ogens directed the film."]}, {"page": "The Phenom (film)", "response": ["* Sophie Kennedy Clark as Dorothy Boyer"]}, {"page": "Tristan Pigott", "response": ["In 2015 he was shortlisted for the BP Portrait Award with the National Portrait Gallery, London.NPG The same year he made a portrait of actress Sophie Kennedy Clark."]}, {"page": "Greg Kuehn", "response": ["Kuehn got his start in film working on the score for cult classic Repo Man, on which he arranged music and played keyboards.  Since then, Kuehn has scored numerous films, including Confessions of a Superhero and Meet the Hitlers, both directed by Matt Ogens and produced by film maker Morgan Spurlock, A Small Section of the World, directed by Lesley Chilcott, and The Achievers, The Story of The Lebowski Fans. One of his songs was featured in the documentary The Other F Word, directed by Andrea Nivens. He worked with producer Peter Jackson scoring the trailer for the Amy Berg directed doc, West of Memphis, and has completed the score for Go North a new feature film directed by Matt Ogens, and starring Jacob Lofland, Sophie Kennedy Clark and Patrick Schwarzenegger. Kuehn composed the music for Shooting An Elephant, a narrative short film featured in the 2016 Tribeca film festival, directed by JP Rothie and written by Alec Sokolow. Code Blue, a short film Kuehn scored based on the T.S.O.L. song and the Jack Grisham short story, was featured in the 2016 Cannes Film Festival Court Metrage (Short Film Corner)."]}, {"page": "National Film Awards UK", "response": ["* Best Actress: Sophie Kennedy Clark (Obey)"]}, {"page": "List of British films of 2018", "response": ["|| Director: Martha Pinson  Cast: Sebastian Street, Stuart Brennan, Stephen Fry, Sophie Kennedy Clark, James Cosmo, Paul Kaye, Stephanie Leonidas, Joss Stone"]}, {"page": "A Bird Flew In", "response": ["* Sophie Kennedy Clark"]}]}}