{"wiki_id": "http://www.wikidata.org/entity/Q7562978", "itemLabel": "Sophie Choudry", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Choudry", "wikipedia_page": {"main": "Sophia Choudry (born 8 February 1983) is a singer, host and actress born in UK and based in India. She has been active primarily in Hindi language films and is also a former MTV India VJ and occasional model, and television presenter.", "link_mentions": [{"page": "Priyanka Chopra", "response": ["Chopra has participated in a number of world tours and concerts. She took part in a world concert tour, \"Temptations 2004\", and performed with other Bollywood actors (including Shah Rukh Khan, Saif Ali Khan, Rani Mukerji, Preity Zinta and Arjun Rampal) in 19 stage shows. In 2011, she participated (with Shahid Kapoor and Shah Rukh Khan) in a concert in Durban, South Africa celebrating 150 years of India–South Africa friendship. In 2012, she performed at M. A. Chidambaram Stadium, Chennai in the opening ceremony of the fifth season of cricket's Indian Premier League with Amitabh Bachchan, Salman Khan, Kareena Kapoor and Katy Perry. The same year, she performed at Dubai Festival City's Ahlan Bollywood Concert with other Bollywood stars such as Salman Khan and Sophie Choudry."]}, {"page": "List of MTV VJs", "response": ["*Sophie Choudry"]}, {"page": "Star Academy", "response": ["| rowspan=\"3\" | Mandira Bedi (Season 1-Celebrity)Manav Gohil (Season 1-Celebrity)Sophie Choudry (Season 2)"]}, {"page": "List of people associated with the London School of Economics", "response": ["* Sophie Choudry, Indian actress"]}, {"page": "Shaadi No. 1", "response": ["Shaadi No. 1 (Translation: Marriage No. 1) is an Indian comedy film released in November 2005. The film, directed by David Dhawan, stars Sanjay Dutt, Fardeen Khan, Zayed Khan, Sharman Joshi, Esha Deol, Ayesha Takia, Soha Ali Khan, Aarti Chabria, Riya Sen, Sophie Choudry, Satish Shah and Rajpal Yadav. The film was produced by Vashu Bhagnani. The film is a remake of 2001 Kannada movie Kothigalu Saar Kothigalu by Rajendra Singh Babu.", "Raj Mittal (Fardeen Khan), Veer Saxena (Zayed Khan) and Aryan Kapoor (Sharman Joshi) are unhappy with their respective marriages even though they love their spouses. Their wives Bhavana (Ayesha Takia), Diya (Esha Deol) and Sonia (Soha Ali Khan) are busy with their everyday lives, and their husbands feel ignored by them. Bhavana constantly uses religion as an excuse to not be intimate with her husband, Diya aspires to be an actress for Mr.Y (Rajpal Yadav), and Sonia is a lawyer who is obsessed with doing cases with her partner H.S Gulati (Ali Asgar). the three men try to commit suicide as Veer tries to hang himself on a tree but falls, Aryan drinks expired rat poison and Raj wishes he was run over by a train but their suicide plan does not work until they also meet Kothari (Satish Shah) who is also trying to commit suicide because he had three companies that have broken down. The three men get a job as Kothari hires them to work for him. Soon the three men come across Kothari's daughters: Madhuri (Riya Sen), Rekha (Aarti Chhabria) and Dimple (Sophie Choudry). It is not long before they are tempted by them. Unfortunately for them, Lucky Bhai (Sanjay Dutt) is out to make their life hell and expose them to their unassuming wives. The three men sign a contract as the three beauties have been deceived and that their wives are disappointed at them. Once again the three friends commit suicide by standing on top of a ladder but are left hanging when Kothari tries to cut the ladder with a chainsaw. their wives come but are left hanging to as Lucky Bhai saves them but Raj falls into a lump of dust and junk, Aryan falls through wires and electricity and Kothari and Veer fall at the same time but Veer falls into a dog van with a broken arm along with Kothari who falls onto a cement packet. Injured, Veer, Raj, and Aryan apologize to Lucky Bhai as he feels awkward about saving people but has trust in them.", "* Sophie Choudry as Dimple Kothari (Veer's girlfriend)"]}, {"page": "Biddu", "response": ["* Sophie Choudry – Le Mera Dil (2008)"]}, {"page": "Manish Malhotra", "response": ["Among the prominent personalities who walked the ramp for them were Shabana Azmi, Sophie Choudry, Huma Qureshi, Athiya Shetty, Tara Sharma, Kajol, Riya Sen, Tisca Chopra etc.", "|Sophie Choudry"]}, {"page": "Heyy Babyy", "response": ["* Sophie Choudry"]}, {"page": "Jiah Khan", "response": ["An autopsy was performed at JJ Hospital in Byculla. Her body was then brought back to her residence around 7:00 am on Wednesday, 5 June 2013, following the post-mortem. On the same day her Namaz-e-janaza (funeral prayer) took place at Sonapur Kabar Walla Masjid and she was buried at Juhu Muslim cemetery after Dhuhr prayer per Islamic rites. Bollywood actors in attendance included Aamir Khan, Kiran Rao, Riteish Deshmukh, Siddharth Mallya, Sophie Choudry, Urvashi Dholakia, Prem Chopra, Ranjeet, Deepak Parashar, Sanjay Khan and Nagma. Bollywood stars reacted with shock at her death."]}, {"page": "Sophia Chaudhary", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Jhalak Dikhhla Jaa", "response": [" |Sophie Choudry"]}, {"page": "Aggar (film)", "response": ["* Sophie Choudry as Nisha Raval"]}, {"page": "Nitu Chandra", "response": ["Chandra was signed up as the brand ambassador for the Hoop, a Gitanjali brand. She also took part in a commercial for Mysore Sandal Soap. Nitu Chandra also appeared in music director Ismail Darbar's music video \"Rasiya Saajan\" along with Zubeen Garg. She was also seen in the music video of Bombay Vikings' singer Neeraj Shridhar's hit single \"Aa Raha Hoon Main\". She also appeared in a successful remix of Sajna Hai Mujhe from D.J. Hot Remix Vol.1 (and the song appeared in 7 other albums after that), and the super hit song Mera Babu Chhail Chhabila (CD - Sophie & Dr.Love, DVD - D. J. Hot Remix Vol.2 & The Return Of Kaanta Mix) alongside Sophie Choudry (the song appeared in 9 other albums after that)."]}, {"page": "List of Bollywood films of 2005", "response": ["|Shaadi No. 1 ||David Dhawan || Fardeen Khan, Zayed Khan, Sharman Joshi, Esha Deol, Ayesha Takia, Soha Ali Khan, Sanjay Dutt, Rajpal Yadav, Riya Sen, Sophie Choudry, Aarti Chhabria  || Comedy, Romance "]}, {"page": "List of Bollywood films of 2007", "response": ["|Speed ||Vikram Bhatt || Sanjay Suri, Zayed Khan, Urmila Matondkar, Sophie Choudry, Aftab Shivdasani, Tanushree Dutta, Amrita Arora, Aashish Chaudhary || Thriller"]}, {"page": "Sophie", "response": ["* Sophie Choudry (born 1982), Indian singer and VJ"]}, {"page": "List of Bollywood films of 2009", "response": ["|Neil Mukesh, Bipasha Basu, Rahul Dev, Sophie Choudry"]}, {"page": "Aa Dekhen Zara", "response": ["| Sophie Choudry || Bindiya Avasti||"]}, {"page": "Sophia Chaudhry", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Sophie Chaudhry", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Kidnap (2008 film)", "response": ["* Sophie Choudry in a special appearance in the item number Meri Ek Ada Shola"]}, {"page": "Sophie chaudhary", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "T-Series (company)", "response": ["*Sophie Choudry"]}, {"page": "Sophie Chaudhary", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Mumzy Stranger", "response": ["|Sophie Choudry ft. Mumzy Stranger"]}, {"page": "Sound of Sophie", "response": ["Sound Of Sophie is the first studio album by British Indian dance-pop singer Sophie Choudry. It was released by Times Music in December 2009.", "Category:Sophie Choudry albums"]}, {"page": "Fame X", "response": ["The sole season was in November 2006The first episode of Fame X and it extended until the finals in 2007. It was broadcast on Indian SAB TV television station. The dean of the show was Palash Sen. Auditions were held in Ahmedabad, Jaipur, Delhi, Kolkata and Mumbai. Originally the host was Sophie Choudry, but she was replaced in later stages by Shilpa Sakhlani.", "*Sophie Choudry (originally)"]}, {"page": "Sophia Choudhry", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Sophie Choudhary", "response": ["#REDIRECT Sophie Choudry"]}, {"page": "Manasvi Mamgai", "response": ["Manasvi put together the \"Humanity United against Terror\" a Bollywood Charity Concert which took place on 15 October 2016 at NJ Exposition center in Edison, New Jersey. The concert was addressed by President-Elect Donald Trump. She even performed in it with Bollywood celebrities including Malaika Arora Khan, Prabhu Deva, Sophie Choudry."]}, {"page": "Aap Jaisa Koi", "response": ["Harry Anand produced a remix of the song for his 2004 Sweet Honey Mix album, released under the T-Series label. Sung by Sophie Choudry, the remix had a music video starring Negar Khan. The song was also used in the 2016 Trinidadian film Bazodee."]}]}}