{"wiki_id": "http://www.wikidata.org/entity/Q7563068", "itemLabel": "Sophie Stanton", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sophie_Stanton", "wikipedia_page": {"main": "Sophie Stanton (born 1971 in London, England) is an English actress, director and playwright. She is best known for her role as DCI Jill Marsden in the BBC soap opera EastEnders in which she has appeared on and off since 2001.", "link_mentions": [{"page": "EastEnders", "response": ["In 2010, EastEnders came under criticism from the police for the way that they were portrayed during the \"Who Killed Archie?\" storyline. During the storyline, DCI Jill Marsden (Sophie Stanton) and DC Wayne Hughes (Jamie Treacher) talk to locals about the case and Hughes accepts a bribe. The police claimed that such scenes were \"damaging\" to their reputation and added that the character DC Deanne Cunningham (Zoe Henry) was \"irritatingly inaccurate\". In response to the criticism, EastEnders apologised for offending real life detectives and confirmed that they use a police consultant for such storylines."]}, {"page": "John Falstaff", "response": ["*In Phyllida Lloyd's 2017 all-female Donmar Warehouse production of Henry IV (combining both parts), which was videotaped and broadcast, Sophie Stanton played Falstaff."]}, {"page": "Beautiful Thing (play)", "response": ["* 28 July 1993 (World premiere): Bush Theatre, London, directed by Hettie MacDonald. It featured Patricia Kerrigan, Mark Letheren, Jonny Lee Miller, Sophie Stanton and Philip Glenister.", "* 29 March 1994: West End at the Donmar Warehouse which ran until 23 April 1994,Donmarwarehouse.com with Amelda Brown, Mark Letheren, Shaun Dingwall, Sophie Stanton and Hugh BonnevilleInstagramWilldowe.comHughbonneville.uk", "* January to March 2006: Sound Theatre in London starring Andrew Garfield, Gavin Brocker, Leo Bill, Sophie Stanton and Naomi Bentley."]}, {"page": "Caliban", "response": ["*In Phyllida Lloyd's 2017 all-female Donmar Warehouse production set in a women's prison and performed by its inmates, Caliban was played by Sophie Stanton."]}, {"page": "Prime Suspect", "response": ["* Sophie Stanton as Detective Sergeant Christine Cromwell (series 4)"]}, {"page": "Kathy Burke", "response": ["In 2007, Burke contracted Clostridium difficile while in hospital for an operation, resulting in her having to pass directing duties on Dying for It at the Almeida Theatre (which starred Charlie Condou and Sophie Stanton who she worked with on Gimme Gimme Gimme)."]}, {"page": "Almeida Theatre", "response": ["* The Knot of the Heart by David Eldridge, directed by Michael Attenborough, starring Sophie Stanton (2011)"]}, {"page": "Andy Hunter (EastEnders)", "response": ["The next day, Dalton's murder becomes public knowledge and Andy takes control of The Firm. He soon questions both Dennis and Phil about their alleged involvement in Dalton's death, up to the point where he has the mob keep them under surveillance — to which Phil wrongfully assumes is the police led by his arch-rival DCI Jill Marsden (Sophie Stanton). Later on, Andy confronts Phil just as he is about to go on a holiday with his fiancée Kate Morton (Jill Halfpenny) and daughter Louise (Rachel Cox). He explains to Phil that it was the mob and not the police that were keeping him and Dennis under surveillance. When Phil refuses to tell Andy the truth behind the events of Dalton's murder, Andy tricks Phil into exposing Dennis' role by offering him a sweet — to which Andy would take Phil's acceptance as confirmation that Dennis was the one who killed Dalton. This works successfully as Phil takes the sweet before leaving, and Andy later confronts Dennis with the knowledge that he murdered Dalton. Just as it appears that Andy is going to have Dennis killed, however, he instead pardons him and the two proceed to form a mutual friendship from there onwards; though Andy would later trigger Dennis' feud with Phil after he tells Dennis that Phil grassed him to the mob over Dalton's murder. Two months later, Den unexpectedly reappears in Walford after being presumed dead for the past fourteen years. This prompts Andy to order his goons to bring Den to him for a meet-up at the rendezvous point, where Andy decides to condone Den for his previous crimes against The Firm."]}, {"page": "Phil Mitchell", "response": ["The follow-up of Sharongate saw Phil embarking on a problematic marriage with Ben's mother Kathy Beale (Gillian Taylforth); constantly tormenting Kathy's eldest child Ian Beale (Adam Woodyatt) over the course of their long-running animosity; having a one-night stand with Ian's ex-wife Mel Healy (Tamzin Outhwaite); escalating his two most competitive rivalries with Mel's husband Steve Owen (Martin Kemp) and their common nemesis Dan Sullivan (Craig Fairbrass); becoming the surrogate father of godson Jamie (Jack Ryder); establishing a companionship with Jamie's estranged uncle Billy (Perry Fenwick); clashing with love rival Mark Fowler (Todd Carty) over Louise's parentage; harbouring resentment against Mark's younger brother Martin Fowler (James Alexandrou) for accidentally killing Jamie in a car accident; teaming up with Sharon's adoptive brother Dennis Rickman (Nigel Harman) to eliminate their crime boss Jack Dalton (Hywel Bennett) and then cover up the latter's murder; marrying policewoman Kate Morton (Jill Halfpenny) after saving her from Dalton's earlier arrangement to have her killed; crossing paths with Kate's superior DCI Jill Marsden (Sophie Stanton) when she occasionally tries to bring him to justice; being set-up for armed robbery by Sharon and Dennis' illegitimate father Den Watts (Leslie Grantham); helping exonerate Sam for Den's murder after the latter's spouse and killer Chrissie (Tracy-Ann Oberman) frames her for the crime; waging a conflict against Peggy's gangland enemy Johnny Allen (Billy Murray) that culminated in Get Johnny Week; discovering at his wedding to Stella Crawford (Sophie Thompson) that she had been abusing Ben during their relationship; becoming a prime suspect in the murder of his uncle Archie (Larry Lamb); setting fire to The Queen Victoria public house in light of his addiction to crack cocaine; getting shot by ex-lover Shirley Carter (Linda Henry) on the day of his wedding to Sharon; rescuing his two cousins Ronnie (Samantha Womack) and Roxy (Rita Simons) from being murdered by their notorious adversary Nick Cotton (John Altman); framing ex-business partner Max Branning (Jake Wood) for the murder of Ian's daughter Lucy (Hetti Bywater) in the aftermath of her killer being revealed to be Lucy's younger brother Bobby (Eliot Carrington); coping with Peggy's death after she commits suicide to end her cancer endurance; having a child with Denise Fox (Diane Parish); getting hospitalized by Martin's wife Stacey Fowler (Lacey Turner) after threatening to extort money from her closest relative Kat (Jessie Wallace); ending his prolonged marriage to Sharon upon discovering that she had been sleeping with Louise's boyfriend, Keanu Taylor (Danny Walters) and that he is not responsible for her pregnancy as a result of their hidden romance; and being partly responsible for the death of Sharon's son Denny (Harry Hickles/Bleu Landau) after his confrontation with Keanu over the affair had instigated a boat accident that resulted in the younger's death. On 25 December 2020, Phil was later revealed to be the assailant who attacked Ian in the storyline \"Who Attacked Ian Beale?\"", "Following Danielle's funeral, Peggy asks Phil to kill Archie so they could get justice for Danielle and Ronnie. He obliges and has Archie kidnapped, but lets him go after threatening him to stay away from Walford. However, Archie later returns to the square and ignores Phil's constant demands that he leave Walford again. As Christmas approaches in December 2009, Phil and Peggy are horrified to learn that Archie has extorted the pub from them after he formed a relationship with Janine and the two conspired to have Ian collaborate with them – particularly when Phil gave Ian a loan and gets beaten up as a result of not being able to pay it back. This could have been a motive for both Phil and Peggy, along with their family, when Archie is later murdered on Christmas night. Afterwards, Phil is surprised when DCI Jill Marsden (Sophie Stanton) takes charge of the murder investigation; as Phil and Marsden became sworn enemies ever since she investigated his shooting – before going on to intercept Phil's criminal activities prior to him being set up for the robbery. During the investigation, Phil clashes with Janine as they both plan to retake various properties from the square. However, it is later revealed that Archie's killer was in fact his rape victim Stacey Slater (Lacey Turner); this was discovered just moments after her husband Bradley (Charlie Clements) fell to his death whilst on the run from the police, which Phil had witnessed in the midst of celebrating Ricky and Bianca's second wedding."]}, {"page": "Steve Owen (EastEnders)", "response": ["When the pair return from their honeymoon, they hear about Phil's shooting and Steve is promptly implicated as the prime suspect. It soon transpires that the weapon that hospitalized Phil was Steve's handgun, which has gone missing ever since the incident occurred just at the end of Steve and Mel's wedding. Steve is later arrested when police detective DCI Jill Marsden (Sophie Stanton) and her unit gather evidence of his implication, most notably his motive for knowing about Mel sleeping with Phil on Christmas 2000. Upon hearing of this, both Phil's mother Peggy (Barbara Windsor) and his young godson Jamie (Jack Ryder) constantly accuse Steve of committing the crime. Steve insistently proclaims his innocence behind Phil's shooting and ends up clashing with Jamie on multiple occasions; at this stage, Jamie has already grown to dislike Steve since he was recently Matthew's best-friend and had previously testified against Steve for Saskia's murder. Steve later visits Phil in the hospital and threatens him should he ever use Mel to his advantage in their feud again. Later that evening, Steve receives a visit from Dan and is again confronted by Jamie moments later. When Steve tauntingly tells Jamie that Phil is a liar, Jamie punches Steve and they fight when Steve punches Jamie back. Dan breaks up the fight just as Robbie's sister Sonia (Natalie Cassidy), who is also Jamie's girlfriend, intervenes as well. Jamie demands Steve to get out of the square for good, but Steve refuses and again protests his innocence. However, when Phil recovers and discharges himself from the hospital that night, Steve is indeed proven innocent when Phil ends up confronting the real culprit: his former girlfriend and Mel's best-friend, Lisa Shaw (Lucy Benjamin)."]}, {"page": "Billy Mitchell (EastEnders)", "response": ["After learning that Phil and Grant plan to do a robbery that is set to be botched, Billy alerts their sister Sam Mitchell (Danniella Westbrook) and her boyfriend Beppe di Marco (Michael Greco) about their plans – which sparks a police chase on the Mitchell Brothers that results in them driving into the River Thames; Phil is rescued while Grant is presumed dead. Following Grant's departure, Phil is shot (see Who Shot Phil?) by an unknown assailant on the night Steve marries their lover Mel Healy (Tamzin Outhwaite). As local chief detective DCI Jill Marsden (Sophie Stanton) embarks an investigation on Phil's shooting, Billy clashes with Phil's stepson Ian Beale (Adam Woodyatt) and his cousin Mark Fowler (Todd Carty) upon learning that the pair had separate motives for the crime. He also gets in a fight with Jamie over his ability to manage Phil's business, but is overpowered and forced to submit to his nephew's demand to be left alone. Soon afterwards, Phil discharges himself from hospital and frames his friend-turned-enemy Dan Sullivan (Craig Fairbrass) for the crime – even though his ex-girlfriend Lisa Fowler (Lucy Benjamin) was responsible for the shooting. Phil then forces Billy to testify against Dan to ensure his imprisonment. Steve observes this interaction – as he too wishes for Dan to get sent down, despite both of them being Phil's archenemies, in order to stop him from further tormenting Mel. However, Billy's testimony fails and Dan is found not guilty. Dan later confronts Billy in search of revenge for Phil and Steve, forcing him to acquire information about the pair's commonality to him. Billy ends up confiding to Dan about Mel sleeping with Phil before marrying Steve, which leads to him kidnapping Mel, holding her hostage, and asking for a £200,000 ransom. When Steve and Phil learn about this, they confront Billy about allowing Dan to get leverage over them. Billy manages to help Steve and Phil rescue Mel, but they fail to stop Dan from fleeing Walford with the money. In light of Dan's departure and Mel's kidnapping ordeal, Billy finds himself further embroiled in Phil and Steve's rivalry – up to the point where they each deem him distrustful. Their feud ultimately ends with Steve kidnapping Phil's infant daughter Louise to flee Walford with Mel and exact his last-ditch revenge. When Billy learns about this, he informs Phil and the latter manages to rescue Louise after Steve crashes his car and is killed in the ensuing explosion; Billy later accompanies Mel in arranging and then attending at Steve's funeral."]}, {"page": "Jamie Mitchell", "response": ["With his interaction with Billy improving better than it was, Jamie appears to have sorted out his troubles and plans to get engaged to Sonia. However, he gets into trouble with Phil once again, when Lisa decides to leave the country with Louise and Jamie unwittingly helps them. Phil learns about this and confronts Sonia in front of Jamie, believing that she was the one colluding with Lisa against him. Phil prepares to attack Sonia when Jamie comes to her defense, and admits that he was the one who helped Lisa. In response, Phil brutally attacks Jamie and beats him up until Sonia is forced to tell him that Lisa has taken Louise to Portugal. Phil quickly leaves to try and get Louise back, while Sonia nurses Jamie back to health and they get engaged. When Phil returns, his relationship with Jamie has deteriorated and a conflict ensues between them when Sonia suspects Phil of murdering Lisa. The would-be couple soon get in touch with DCI Jill Marsden (Sophie Stanton), the police detective who investigated Phil's shooting a year ago, with this theory and Phil ends up getting arrested; he is later released without charged due to lack of evidence."]}, {"page": "List of former EastEnders characters", "response": ["|Jill Marsden || Sophie Stanton || 2001–2003, 2009–2010, 2012, 2015"]}, {"page": "Kate Mitchell (EastEnders)", "response": ["Kate Morton made her first appearance in Walford, a fictionalized borough in East London, at the local hospital - where she meets Phil Mitchell (Steve McFadden), the local hardman of Walford's community area: Albert Square. She quickly learns that Phil is visiting his godson, Jamie (Jack Ryder), who is dying from injuries sustained in a road accident. When Jamie dies, Kate supports Phil and they begin a relationship. As an undercover policewoman, she introduces herself as Kate Tyler and tells him that she is a nail technician. Kate helps her boss Jill Marsden (Sophie Stanton) and DI Dominic Price (Paul Brennen) set up a honey trap, hoping Phil will confess to murdering his ex-girlfriend Lisa Fowler (Lucy Benjamin).  However, Kate unintentionally sabotages her own efforts by falling in love with Phil - prompting Marsden to fire her. Phil soon learns about Kate's police identity and ends their relationship, threatening to kill her if they ever meet again."]}, {"page": "Bradley Branning", "response": ["Bradley and Stacey attend Archie's funeral, though Stacey does not want to. After the funeral, Stacey spits in the grave. Later, Becca overhears them talking about Christmas Day. Bradley leaves and Becca finds him in the Square, saying he should not be too hard on Stacey, and she has told her about what Archie did. However, Stacey tells Bradley that Becca only knows that Archie was a creep, and knows nothing about Christmas Day or the baby. Bradley proposes to Stacey, she accepts and they have sex in the car lot. Becca lets slip that Stacey is pregnant and everyone finds out, and Bradley worries that it will ruin everything. Bradley begins acting strangely whenever someone mentions the police or the murder. Then at Tiffany Dean's (Maisie Smith) birthday party, Tiffany tells her great uncle (also Bradley's uncle) Jack Branning (Scott Maslen) that she saw Bradley washing blood off his hands on Christmas Day. Jack demands to know why he had blood on his hands, and Bradley breaks down and tells Jack and Max about punching Archie and Stacey's rape. Jack threatens to go to the police if Bradley does not, but Max stops him and convinces him not to. However, Bradley is scared when DCI Jill Marsden (Sophie Stanton) reveals that a new forensic profile has been found and DNA screening will start soon. Max says Bradley should stay with his mother until everything has blown over, but while Bradley is in the car lot, the police come in and ask him to give a DNA sample. Following this, Jack bribes DC Wayne Hughes (Jamie Treacher) to make the samples disappear. When Janine Butcher (Charlie Brooks) is arrested for Archie's murder, Stacey tells Bradley everything will be fine."]}, {"page": "Stowmarket High School", "response": ["*Sophie Stanton – actress"]}, {"page": "Ben Mitchell (EastEnders)", "response": ["Ben continues to feel angst towards Phil for rejecting him. He anonymously stalks Phil, terrorising him with evidence about his past crimes, including a newspaper clip of the death of Steve Owen (Martin Kemp). DCI Jill Marsden (Sophie Stanton), who has been attempting to imprison Phil for over a decade, opens an investigation. She interviews Ben regarding Stella's death in 2007. Ben tells her that Phil forced Stella to jump off a building on threat of being pushed. Phil plans to flee the country before arrest, but is stalled by Ben, who reveals himself as his father's stalker. Phil is charged with Stella's murder and when the Mitchell family discover Ben's involvement in his father's arrest, they disown him. Ben's brother Ian eventually discovers Ben lied to DCI Marsden and informs the police. Phil is released; however, Ben mistakingly believes he has been betrayed by Heather Trott (Cheryl Fergison), who also knows he set Phil up. He confronts Heather in fear and desperation, and hits her over the head with a metal picture frame, killing her. Phil returns from prison moments after Heather's murder. Feeling responsible for his son's behaviour, Phil covers up Ben's involvement with Jay's help, who was present when Heather was killed. Shirley, Phil's fiancée, discovers Heather's body, and as she was her best friend, she vows to find the killer. Worried she will discover the truth, Ben convinces Phil to break-up with Shirley and she is thrown out of their home, while Jay is so traumatised by Heather's murder that he moves out of the Mitchells'. Ben and Phil wrestle with guilt and argue regularly, with Phil turning to alcohol. Needing to confide in someone, Ben admits his crime to Ian; the confession contributes to Ian's mental breakdown, and amidst threats from Phil to stay silent, Ian absconds, leaving Phil and Ben searching for him to no avail."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Sophie Stanton (Acting Diploma 1991)"]}, {"page": "Stella Crawford", "response": ["In January 2012, local shopkeeper Denise Fox (Diane Parish) is led to believe that Phil had murdered her husband Kevin Wicks (Phil Daniels) in late December 2007. Denise later suspects that Phil pushed Stella to her death on their wedding day, but Phil denies her accusations and insists that Stella committed suicide. However, Denise goes to the police, telling them she believes that Phil murdered Stella. Ben (now played by Joshua Pascoe) goes to the police and tells police detective DCI Jill Marsden (Sophie Stanton), who has been trying to imprison Phil for years, that Phil forced Stella to jump - telling her that if she did not, then he would shove her instead. Phil is then arrested for Stella's murder and is later charged, but Marsden is forced to release him when Ian reveals to her that Ben had lied about Phil murdering Stella."]}, {"page": "Mercury Fur", "response": ["| England || 2005 || Drum Theatre, Plymouth.Later transferred to the Menier Chocolate Factory, London. || Company: Paines Plough.Director: John Tiffany.Cast: Ben Whishaw (Elliot), Robert Boulter (Darren), Shane Zaza (Naz), Neet Mohan (Party Piece), Harry Kent (Lola), Fraser Ayres (Spinx), Sophie Stanton (Duchess), Dominic Hall (Party Guest). In the London production Party Piece was played by Prem and Previ Gami. || World Premiere10 - 26 February 2005 in Plymouth.London Premiere2 - 27 March 2005 in London."]}, {"page": "Dressing for Breakfast", "response": ["* Sophie Stanton as Rose"]}, {"page": "List of EastEnders characters (2007)", "response": ["In July 2015, he appears at the police station when Ben (now Harry Reid) is arrested for the murder of Lucy Beale (Hetti Bywater). He tells DCI Jill Marsden (Sophie Stanton) that witness Arsim Kelmendi (Tomasz Aleksander) has arrived at the station and escorts Ben back to his cell. He is later on desk duty when Ritchie Scott (Sian Webber) arrives and asks for Ben's whereabouts. Morris is on the phone and tells her to wait but she ignores him and goes into the station. Morris is forced to apologise to Marsden for not stopping her and she tells him to escort Ritchie back to the front desk. He is also present when Phil arrives at the police station and Morris asks him to wait. Bobby Beale (Eliot Carrington) later comes to the police station and asks to see DI Samantha Keeble (Alison Newman) but Morris is taking another phone call and tells him to wait too. Morris later informs Marsden that Phil has returned to the station and wants to see her.", "He returns on 28 December 2009 following the murder of Archie Mitchell (Larry Lamb). He is the central colleague of DCI Jill Marsden (Sophie Stanton). When a DNA screening begins, Jack Branning (Scott Maslen) pays Hughes a bribe to make the samples disappear. Hughes contacts Jack when his nephew Bradley Branning (Charlie Clements) is about to be arrested. He becomes involved in the chase with Bradley and he watches him fall to his death."]}, {"page": "Jack Branning", "response": ["The feud between Jack and Phil recommences. Phil discovers that Jack is dealing drugs and when Shirley Carter (Linda Henry) buys drugs from one of his contacts, Phil forces Jack to buy them back. Humiliated, Jack employs Phil's sister Sam Mitchell (Danniella Westbrook), infuriating Phil. Despite knowing she is engaged to Ricky Butcher (Sid Owen), Jack and Sam begin an affair. Archie intervenes and pays Jack to keep seeing Sam as part of his plan to take over The Queen Vic. He also tells Jack's niece and Ricky's ex-wife Bianca (Patsy Palmer) about the affair. Later, Bianca drags Sam into The Queen Vic by her hair and forces her to tell Ricky in front of Jack about the affair she was having. Jack is distraught as Roxy was about to give him Ronnie's address but when the affair is revealed, Roxy changes her mind and throws him out of the pub. Ronnie gets pregnant but she has a miscarriage when Archie pushes her against the bar in the pub during an argument. Jack comforts Ronnie and takes in Ronnie, Roxy and Amy when they are made homeless by Archie. Jack confronts Archie on Christmas Day 2009 and threatens to kill him if he hurts Ronnie again. Archie is murdered that day and an investigation begins. Four weeks later, Jack asks Ronnie to dinner, to which she agrees but not until after Archie's funeral. At the funeral, Jack offers DC Wayne Hughes (Jamie Treacher) to help with any \"local information\" he might need. He later sees Ronnie tearing up the flowers on Archie's grave and asks her why. She thinks he is accusing her of murder. She later sees him talking to DCI Jill Marsden (Sophie Stanton), who is investigating the murder. Ronnie asks Jack how he would feel if he knew she had killed Archie, leading him to suspect her and also tells him, despite Jack's desire, that starting a relationship with him again is not what she wants. At his great-niece Tiffany Butcher's (Maisie Smith) birthday party, he cuts his hand and Tiffany tells him that she saw Bradley washing blood off his hands on Christmas Day. Jack confronts Bradley who eventually reveals that he found out from Stacey on Christmas Day that Archie had raped and impregnated her, and Bradley punched Archie."]}, {"page": "List of EastEnders characters (2005)", "response": ["In July 2015, Ritchie represents Ben (now Harry Reid) when he is arrested for Lucy's murder. She barges into the police station and interrupts a video identity parade Keeble and DCI Jill Marsden (Sophie Stanton) are holding with a witness. Ritchie is furious with Marsden and berates her for her methods, accusing her of bending the rules. She then advises Ben to remain silent during his interview, which she sits in on. She later updates Phil on Ben's situation and he thanks her, causing Ritchie to remind him to pay her on time. Marsden asks Ritchie to wait in the interview room whilst she and Keeble review some new evidence. Ritchie then calls Phil from the police station and gives him another update on Ben's situation. Ritchie is annoyed at being kept waiting by Marsden and nearly overhears her telling DS Cameron Bryant (Glen Wallace) that she used to be a stripper to pay her fees for law school. Later in the week, Ritchie reveals that Ben will still be held in custody for mugging Lucy and that the police will be wanting to question Jay over the mugging too, causing Jay to flee. Ritchie sits in on Marsden's interview of Ben over Lucy's mugging. When Marsden goads Ben and reduces him to tears, Ritchie orders her to terminate the interview and release Ben, threatening to report her to her superior officer if she does not. In November, Ritchie helps Sharon seize control of Phil's assets by power of attorney after his drinking spirals out of control and she signs them over to Sharon and Ben."]}, {"page": "List of EastEnders characters (2001)", "response": ["Detective Chief Inspector Jill Marsden is played by Sophie Stanton. She makes her first appearance on 5 March 2001, when she investigates who shot Phil Mitchell (Steve McFadden) which is part of the whodunit storyline, Who Shot Phil?. She returns in 2002 and 2003, and returns again in 2009 for another whodunit storyline, Who Killed Archie? and returns again on 5 January 2012 for her third whodunnit storyline, 'Who's Stalking Phil?'.", "DS Burton, played by Cyril Nri, is a policeman who assisted his fellow chief detective Jill Marsden (Sophie Stanton) with investigating the shooting of Phil Mitchell (Steve McFadden) — the criminal hardman of Albert Square, a local community of the fictionalized borough Walford in East London. The events of Phil's shooting occurred on 1 March 2001 after he antagonized several of his neighbors and fellow residents by the time his archenemy, Steve Owen (Martin Kemp), had married his wife Mel Healy (Tamzin Outhwaite) — who had a one-night stand with Phil on Christmas Day 2000. At the point where DS Burton joined Marsden in questioning Steve and Mel over Phil's shooting, he encountered Phil's cousin Billy (Perry Fenwick) and grew curious with his belief over the identity of two other suspected assailants; Phil's stepson Ian Beale (Adam Woodyatt) and love rival Mark Fowler (Todd Carty) over different reasons."]}, {"page": "List of EastEnders characters (2003)", "response": ["He mainly helps Kate with initial searches of the Mitchell house, constantly reminding her that \"the boss\" wants to nail Phil. He later starts to suspect that Kate is developing feelings for Phil, and reminds her that Phil could be a murderer. Kate gives Phil an ultimatum: to tell the truth about Lisa's whereabouts or she will finish with him. After Phil calls her bluff and finishes with her, Price takes Kate off the case, however, after Phil phones her and says he will tell her everything, she is congratulated by \"the boss\" – DCI Jill Marsden (Sophie Stanton) – who has wanted to convict Phil since 2001."]}, {"page": "Hindle Wakes (play)", "response": ["It was the play in performance at the Royal Exchange Theatre during the 1996 Manchester bombing and the play with which the theatre reopened in December 1998 after almost two-and-a-half years of repair works following the bomb damage. Both productions were directed by Helena Kaut-Howson with Ewan Hooper as Mr Jeffcote, Sue Johnston as Mrs Jeffcote, Colin Prockter as Mr Hawthorn, Nicholas Gleaves as Alan Jeffcote and Sophie Stanton as Fanny Hawthorn. The production won a MEN Award."]}, {"page": "List of Ashes to Ashes characters", "response": ["Marjorie Drake (Sophie Stanton) is the wife of Bryan Drake and the mother of Peter Drake.  They reside in a house at number 2 Stanley Road."]}, {"page": "Hunter (British TV serial)", "response": ["*Jan Speddings — Sophie Stanton"]}, {"page": "Whitechapel (TV series)", "response": ["*Sophie Stanton as Mary Bousefield, a police officer and victim of the new Ripper."]}, {"page": "Mitchell family", "response": ["Ben's stalking is revealed when D.C.I. Jill Marsden (Sophie Stanton) returns to arrest him and accuses him of murdering Stella Crawford after her abuse is exposed. Phil is sent to prison, but found not guilty. Ben panicks about his father's return, and kills Shirley's best friend Heather Trott (Cheryl Fergison) while arguing with her. Phil covers up the death, despite Shirley's devastation at her friend's death. Ben's crime is exposed several months later and he is sent to prison, while Shirley ends her relationship with Phil."]}, {"page": "Who Killed Archie?", "response": ["Ronnie finds Archie on the floor of The Queen Victoria and he apologises to her before he dies. When the police are notified of the death they arrest Ronnie, but later release her without charge. DCI Jill Marsden (Sophie Stanton) investigates the rest of the Mitchell family. Phil is given a false alibi by his friend Shirley Carter (Linda Henry), who finds a blood-stained shirt amongst his belongings. Phil explains that he found Archie dead and lost his balance, falling into the blood, but did not call the police because he panicked. They burn the shirt, and when Marsden visits them again, asking to see the clothes Phil was wearing at Christmas, Shirley produces a freshly laundered one. Shirley's flatmate Heather Trott (Cheryl Fergison) reveals that Phil was not really with Shirley on Christmas Day, prompting Shirley to make an anonymous call stating she saw Janine enter The Queen Victoria on the day of the murder, deflecting suspicion from Phil. Peggy and Phil attempt to pin the murder on Sam, who retaliates by blaming Peggy. Both are questioned by Marsden at the police station, and though Peggy is released without charge, Sam is arrested for breaking her bail."]}, {"page": "EastEnders Live", "response": ["* Sophie Stanton as DCI Jill Marsden"]}, {"page": "Girls' Night", "response": ["*Sophie Stanton — Jane"]}, {"page": "Cheerful Weather for the Wedding (film)", "response": ["* Sophie Stanton as Millman"]}, {"page": "Lu Kemp", "response": ["| James Anthony Pearson, Stuart McQuarrie, Ayesha Antoine, Sophie Stanton, Lesley Nicol and John Lightbody", "| Alex Austin, Vincent Ebrahim, Sophie Stanton, Caitlin FitzGerald and Austin Moulton"]}, {"page": "List of EastEnders characters (2012)", "response": ["| A duty solicitor who advises Ben Mitchell (Joshua Pascoe) after he confesses to murdering Heather Trott (Cheryl Fergison). Ben is not believed by DCI Jill Marsden (Sophie Stanton) but is arrested by DS Luke Crisp (Rufus Wright). Ben then gets his friend Jay Mitchell (Jamie Borthwick) to back up his story by getting Mike to pass a note to Jay's solicitor."]}, {"page": "Oliver Emanuel", "response": ["| Alex Austin, Vincent Ebrahim, Sophie Stanton, Caitlin FitzGerald and Austin Moulton"]}, {"page": "Beautiful Thing (film)", "response": ["| Sophie Stanton || Louise"]}]}}