{"wiki_id": "http://www.wikidata.org/entity/Q7576046", "itemLabel": "Spencer Fearon", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Spencer_Fearon", "wikipedia_page": {"main": "Spencer Fearon (born 20 December 1973, Brixton, London, England) is a boxing promoter and media personality.Fearon is the manager and promoter of, amongst others, British light-welterweight champion Darren Hamilton, Prizefighter junior middleweight champion Larry Ekundayo and former southern area junior middleweight champion Nathan Graham.He also appears in Sky Sports' weekly podcast Toe 2 Toe with Ed Robinson.", "link_mentions": [{"page": "David Pearce (boxer)", "response": ["* Spencer Fearon said \"David Pearce was a fantastic warrior, he was so rugged and powerful\"."]}, {"page": "British Urban Film Festival", "response": ["On 7 July 2014 it was announced that \"The Trials of Muhammad Ali\" was to premiere in the UK as part of the 2014 British Urban Film Festival. Two gala screenings were scheduled to take place at the Prince Charles Cinema in Leicester Square (4 September) and the Genesis Cinema in Whitechapel (7 September). It was also announced that the Sky Sports boxing pundit Spencer Fearon was to present the opening night gala in London's West End. On 13 August 2014, it was announced that BUFF would screen two film festival selections for the first time on network television with the terrestrial premieres of \"Driftwood\" & \"Sunny Boy\" on Channel 4 as part of the Shooting Gallery short film strand. Overnight figures (released on 26 August 2014) revealed that 120,000 viewers tuned in to the 25 August broadcast."]}, {"page": "Choi Tseveenpurev", "response": ["His boxing career saw him travel to Finland, Russia, South Korea, Thailand, Indonesia and China before settling in the UK in 2000. Tseveenpurev is currently trained by promoter Spencer Fearon, having previously worked with Jack Doughty and Lee Wilkins.", "There followed a 15-month period of inactivity described as \"criminal\" by UK publication Boxing News which led him to briefly to retire,Living the Dream 29, The UB Post before returning to the ring with Spencer Fearon's Hard Knocks Boxing Promotions in June 2009."]}, {"page": "Prizefighter series", "response": ["Local fighter Larry Ekundayo, coming into the competition with only two fight's experience, defied the odds to win the coveted Betfair Prizefighter trophy. Ekundayo, who became his manager Spencer Fearon's second Prizefighter champ after Choi won last year, claimed the £32,000 winner's cheque plus a £2,000 KO bonus with a stoppage victory over Terry Carruthers in the final. He had previously beaten two Scot's to get there with a win over the pre-tournament favourite, Craig McEwan, in the opening quarter-final and Kris Carslaw in the semi."]}, {"page": "Ed Robinson", "response": ["Edwin Robinson (born October 21, 1971) is a presenter and producer on Sky Sports, most notably in the sports channel's boxing programmes. He is a regular on Saturday Fight Night and other boxing broadcasts on Sky Sports & currently fronts the popular weekly Toe 2 Toe internet podcast alongside former professional boxer Spencer Fearon."]}, {"page": "Premier Sports", "response": ["From September 2010, Premier Sports began to air a number of live boxing events, featuring the likes of Lucian Bute, Érik Morales, Shane Mosley and Felix Sturm. On 8 December 2010, Premier Sports announced an exclusive UK deal with AIBI for the World Series of Boxing starting from December. In February 2011, Premier Sports announced they would air all ShoBox: The New Generation events in 2011 and access Gary Shaw's archive of world title fights from the past five years. Premier Sports will also air eight Top Rank events in 2011–2012. On 14 August 2011, the channel signed a deal with Spencer Fearon's Hard Knocks Boxing Promotions that saw six events from York Hall broadcast live, starting on 7 October 2011."]}, {"page": "Spencer (given name)", "response": ["*Spencer Fearon (born 1962), British media personality"]}, {"page": "Darren Hamilton", "response": ["Guided by Spencer Fearon  short notice fights were relished, first against John Watson, and then Ashley Theophane for the Lonsdale Belt. These fights took him from relative obscurity to become the British Light Welterweight Boxing Champion. "]}, {"page": "Timeline of boxing on UK television", "response": ["** September – Premier Sports begins to show boxing and over the next year, it does deals with Hennessy Sports, AIBI for the World Series of Boxing,  ShoBox: The New Generation events in 2011, Top Rank for eight events in 2011–2012 and Spencer Fearon's Hard Knocks Boxing Promotions for six events from York Hall."]}, {"page": "Timeline of Premier Sports", "response": ["** September – Premier Sports begins to show boxing and over the next year, it does deals with Hennessy Sports, AIBI for the World Series of Boxing,   ShoBox: The New Generation events in 2011,  Top Rank for eight events in 2011-2012 and Spencer Fearon's Hard Knocks Boxing Promotions for six events from York Hall."]}]}}