{"wiki_id": "http://www.wikidata.org/entity/Q7576126", "itemLabel": "Spencer Madan", "itemDescription": "British bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Spencer_Madan", "wikipedia_page": {"main": "Spencer Madan (1729–1813) was an English churchman, successively of Bishop of Bristol and Bishop of Peterborough.", "link_mentions": [{"page": "Peterborough Cathedral", "response": ["*Bishop Spencer Madan"]}, {"page": "Ibstock", "response": ["*Spencer Madan – Bishop of Bristol, Bishop of Peterborough"]}, {"page": "George Warde", "response": ["He married Charlotte Madan, daughter of Spencer Madan (1729–1813) and Charlotte née Cornwallis (died 1794); their son Charles WardeFor more on Charles Warde see:  was a captain in the Royal Navy ."]}, {"page": "Bishop of Peterborough", "response": ["| 60px Spencer Madan"]}, {"page": "Judith Madan", "response": ["On 7 December 1723 Cowper married Colonel Martin Madan, groom of the bedchamber to Frederick, Prince of Wales, and MP for Wootton Basset. He died at Bath on 4 March 1756, aged 53. Their sons included Rev. Martin Madan, author of Thelyphthora a defence of polygamy, and the Right Rev. Spencer Madan, bishop successively of Bristol and Peterborough. Their elder daughter, Maria Frances Cecilia, married William Cowper of Hertingfordbury, her first cousin; a volume of Frances Maria Cowper's religious verse, attributed to \"a lady\" and revised by her famous poet cousin, was published in 1792. Their younger daughter, Penelope (died 22 December 1805), became the wife of General Sir Alexander Maitland (1728–1820). Judith was the aunt of William Cowper the English poet and hymnodist, and grandmother of General Frederick Maitland."]}, {"page": "Martin Madan (politician)", "response": ["Their sons included Rev. Martin Madan, author of Thelyphthora, a defence of polygamy, and the Right Rev. Spencer Madan, bishop successively of Bristol and Peterborough. Their elder daughter, Maria Frances Cecilia, married William Cowper of Hertingfordbury, her first cousin; the younger daughter Penelope (died 22 December 1805), became the wife of General Sir Alexander Maitland (1728–1820). Madan was the grandfather of General Frederick Maitland."]}, {"page": "Richard Vyse", "response": ["He was returned to parliament in 1806 for Beverley, but in the following year made way for his son, Howard Vyse. He attained the rank of general on 1 January 1812, and died at Lichfield on 30 May 1825. He filled for some time the office of comptroller to Ernest Augustus, Duke of Cumberland.'General Richard Vyse', Gentleman's Magazine, Vol. 95 Part 2 (1825), p. 180 (Google)'Succession of Colonels: Richard Vyse', in Historical Records of the Third, or Prince of Wales's Regiment of Dragoon Guards (By Command, London 1838), pp. 127–28 (Internet Archive). He was buried in Lichfield Cathedral near his parents: in 1827 his sister Mary (1745-1827), who had become the second wife of Spencer Madan, Lord Bishop of Peterborough, was buried beside him in the same vault.W. Newling and J.C. Woodhouse, A Short Account of Lichfield Cathedral, Fourth Edition, with additions and an engraving (T.G. Lomax, Lichfield 1834), pp. 81–83 (Google). Their sister Catherine in 1768 became the second wife of Sir George Smith, 1st Bart., was widowed in the following year, and died in 1786.B. Redford (ed.), The Letters of Samuel Johnson, Vol II: 1773-1776 (Princeton University Press, Princeton New Jersey 1992), p. 222 note 3 (Google), citing A.L. Reade, Johnsonian Gleanings, Vol. 5: The Doctor's Life, 1728-1735 (London 1928), p. 211; Vol. 11: Consolidated Index of Persons (London 1952), p. 436."]}]}}