{"wiki_id": "http://www.wikidata.org/entity/Q7599629", "itemLabel": "Stanley Gill", "itemDescription": "British computer scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Gill", "wikipedia_page": {"main": "Professor Stanley J. Gill (26 March 1926 – 1975) was a British computer scientist credited, along with Maurice Wilkes and David Wheeler, with the invention of the first computer subroutine.", "link_mentions": [{"page": "EDSAC", "response": ["Another video game was created by Stanley Gill and involved a dot (termed a sheep) approaching a line in which one of two gates could be opened. The Stanley Gill game was controlled via the lightbeam of the EDSAC's paper-tape reader. Interrupting it (such as by the player placing their hand in it) would open the upper gate. Leaving the beam unbroken would result in the lower gate opening.", "* The Preparation of Programs for an Electronic Digital Computer by Professor Sir Maurice Wilkes, David Wheeler and Stanley Gill, Addison–Wesley, Edition 1, 1951 archive.org."]}, {"page": "Maurice Wilkes", "response": ["Wilkes was a founder member of the British Computer Society (BCS) and its first president (1957–1960). He received the Turing Award in 1967, with the following citation: \"Professor Wilkes is best known as the builder and designer of the EDSAC, the first computer with an internally stored program. Built in 1949, the EDSAC used a mercury delay-line memory. He is also known as the author, with David Wheeler and Stanley Gill, of a volume on Preparation of Programs for Electronic Digital Computers in 1951, in which program libraries were effectively introduced.\" In 1968 he received the Harry H. Goode Memorial Award, with the following citation: \"For his many original achievements in the computer field, both in engineering and software, and for his contributions to the growth of professional society activities and to international cooperation among computer professionals.\""]}, {"page": "David Wheeler (computer scientist)", "response": ["Wheeler was born in Birmingham, England, the second of the three children of (Agnes) Marjorie, née Gudgeon, and Arthur Wheeler, a press tool maker, engineer, and proprietor of a small shopfitting firm. He was educated at a local primary school in Birmingham and then went on to King Edward VI Camp Hill School after winning a scholarship in 1938. His education was disrupted by World War II, and he completed his sixth form studies at Hanley High School. In 1945 he gained a scholarship to study the Cambridge Mathematical Tripos at Trinity College, Cambridge, graduating in 1948. He was awarded the world's first PhD in computer science in 1951.The Preparation of Programs for an Electronic Digital Computer by Maurice Wilkes, David Wheeler, and Stanley Gill; (original 1951); reprinted with new introduction by Martin Campbell-Kelly; 198 pp.; illus; biblio; bios; index; ", "Wheeler's contributions to the field included work on the Electronic delay storage automatic calculator (EDSAC) in the 1950s and the Burrows–Wheeler transform (published 1994). Along with Maurice Wilkes and Stanley Gill, he is credited with the invention around 1951 of the subroutine (which they referred to as the closed subroutine), and gave the first explanation of how to design software libraries; as a result, the jump to subroutine instruction was often called a Wheeler Jump. Wilkes published a paper in 1953 discussing relative addressing to facilitate the use of subroutines.Proceedings of the Cambridge Philosophical Society, Vol 49, Pt 1, pgs 84-9 (However, Turing had discussed subroutines in a paper of 1945 on design proposals for the NPL ACE, going so far as to invent the concept of a return address stack. reprinted in )"]}, {"page": "Worthing College", "response": ["* Stanley Gill, Professor of Computing from 1964-70 at Imperial College London, and President of the British Computer Society from 1967-8, and invented the first computer subroutine"]}, {"page": "Gill (name)", "response": ["*Stanley Gill (1926 – 1975), British computer scientist"]}, {"page": "List of Worthing inhabitants", "response": ["* Stanley Gill, computer scientist, was born in Worthing in 1926 and is co-credited with the invention of the first computer subroutine"]}, {"page": "List of presidents of the British Computer Society", "response": ["* 1967–1968 Stanley Gill *"]}, {"page": "Real Time Club", "response": ["A selection of offices held by former RTC chairmen: Geoff McMullen and Stanley Gill served as President of the British Computer Society.http://www.bcs.org/content/conWebDoc/1635, British Computer Society, UK. Charles Hughes held office at the Worshipful Company of Information Technologists. Basil Cousins co-founded OpenForum Europe. Philip Virgo is Chairman of the Conservative Technology Forum and was a founding officer at the Parliamentary Information Technology Committee (PITCOM). Lord Harry Renwick also held office at PITCOM and is President of EURIM.", "* Stanley Gill (1970–1975)"]}, {"page": "Subroutine", "response": ["The name subprogram suggests a subroutine behaves in much the same way as a computer program that is used as one step in a larger program or another subprogram. A subroutine is often coded so that it can be started several times and from several places during one execution of the program, including from other subroutines, and then branch back (return) to the next instruction after the call, once the subroutine's task is done. The idea of a subroutine was initially conceived by John Mauchly during his work on ENIAC, and recorded in a January 1947 Harvard symposium on \"Preparation of Problems for EDVAC-type Machines\".J.W. Mauchly, \"Preparation of Problems for EDVAC-type Machines\" (1947), in Brian Randell (Ed.), The Origins of Digital Computers, Springer, 1982. Maurice Wilkes, David Wheeler, and Stanley Gill are generally credited with the formal invention of this concept, which they termed a closed subroutine, contrasted with an open subroutine or macro. However, Turing had discussed subroutines in a paper of 1945 on design proposals for the NPL ACE, going so far as to invent the concept of a return address stack. reprinted in "]}, {"page": "Margaret Marrs", "response": ["In 1951, Marrs worked as a computer programmer for Ferranti, a UK electrical engineering and equipment firm based in Manchester. Her work focused on adapting 39 differential equations for automatic computers. She accomplished this by working from a paper published in the late 1940s by Stanley Gill, adapting the Runge–Kutta method of solving differential equations for automatic computers."]}, {"page": "Department of Computing, Imperial College London", "response": ["The origins of the department start with the formation of the Computer Unit in 1964, led by Stanley Gill, out of the Department of Electrical Engineering. However, earlier work had also been done by the Department of Mathematics, which had built the Imperial College Computing Engine, an early digital relay computer. In 1966, the postgraduate Centre for Computing and Automation came into being and consumed the pre-existing Computer Unit, with John Westcott migrating his Control Group from the Electrical Engineering department and joining Stanley Gill as joint head. In 1970, Gill left for industry, the department was renamed to The Department of Computing and Control, and Westcott became the head.", "* 1964-66, Stanley Gill (also British Computer Society President 1967-68; Founding member of Real Time Club)", "* 1966-1970, Stanley Gill (computing) and John Westcott (automation)"]}, {"page": "Stanley J. Gill", "response": ["#redirect Stanley Gill "]}, {"page": "List of people from Sussex", "response": ["* Stanley Gill (1926—1975), co-inventor of first computer subroutine"]}, {"page": "The Preparation of Programs for an Electronic Digital Computer", "response": ["The Preparation of Programs for an Electronic Digital Computer  (sometimes called WWG, after its authors' initials) was the first book on computer programming. Published in 1951, it was written by Maurice Wilkes, David Wheeler, and Stanley Gill of Cambridge University. The book was based on the authors' experiences constructing and using EDSAC, one of the first practical computers in the world."]}]}}