{"wiki_id": "http://www.wikidata.org/entity/Q7599905", "itemLabel": "Stanley Reed", "itemDescription": "British politician (1872-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Reed_(British_politician)", "wikipedia_page": {"main": "Sir Herbert Stanley Reed  (28 January 1872 – 17 January 1969) was an important figure in the media of India in the early 20th century who later became a Conservative Party politician in the UK. He was conservative member for the Aylesbury division of Buckinghamshire.Reed was the  longest serving Editor  of The Times of India from 1907 until 1924. He received correspondence from the major figures of India such as Mahatma Gandhi. In all he lived in India for fifty years. He was respected in the United Kingdom as an expert on Indian current affairs. He christened Jaipur as 'the Pink City of India'.\nReed was returned as Conservative Member of Parliament (MP) for Aylesbury in a by-election in 1938. He was re-elected at the 1945 general election and stepped down at the 1950 general election, when aged 78. He served as chairman of the India and Burma Association.\nHe died in January 1969 aged 96.", "link_mentions": [{"page": "The Times of India", "response": ["Sir Stanley Reed edited The Times of India from 1907 until 1924 and received correspondence from major figures of India such as Mahatma Gandhi. In all he lived in India for fifty years. He was respected in the United Kingdom as an expert on Indian current affairs."]}, {"page": "Aylesbury (UK Parliament constituency)", "response": ["Sir Stanley Reed edited The Times of India from 1907 until 1924 and received correspondence from the major figures of India such as Mahatma Gandhi. In all he lived in India for fifty years. He was respected in the United Kingdom as an expert on Indian current affairs. He devised the sobriquet for Jaipur, 'the Pink City of India'.", "|Sir Stanley Reed || Conservative", "Stanley Reed"]}, {"page": "Stanley Reed", "response": ["Stanley Reed may refer to:", "*Stanley Reed (artist) (1908–1978), British artist", "*Sir Stanley Reed (British politician) (1872–1969), British Conservative politician"]}, {"page": "Stanley Reed (British Politician)", "response": ["#REDIRECT Stanley Reed (British politician) "]}, {"page": "Herbert Stanley Reed", "response": ["#REDIRECT Stanley Reed (British politician)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Stanley Reed; MP for Aylesbury (1938–1950)"]}, {"page": "Diocese of Medak of the Church of South India", "response": ["|M. VidyanandamSir Stanley Reed (Compiled), The Times of India Directory and Year Book Including Who's who 1954, Bennett, Coleman & Company, Calcutta, 1954, p.961.||Old Testament||Andhra Christian Theological College, Rajahmundry||1964-66", "During the 1950s, the Diocese accommodated Bishop Bunyan Joseph of the erstwhile Anantapur-Kurnool Diocese which had since been integrated into Rayalaseema Diocese.  He was AssistantSir Stanley Reed (Compiled), The Times of India Directory and Year Book Including Who's who 1957, Times of India Press, Calcutta, 1957, p.903. Bishop - in - Medak and worked together with Frank Whittaker, Eber Priestley, B. G. Prasada Rao and others.  Bunyan Joseph also served as Presbyter - in - Charge at the CSI-Church of St. John the Baptist, Secunderabad during 1956-57 and 1960-61CSI-Church of St. John the Baptist, History of the Diocese - Presbyters. until he finally retired in October 1963.Rajaiah David Paul, Ecumenism in action: a historical survey of the Church of South India, Christian Literature Society, Madras, 1972, p.107."]}, {"page": "Reed (name)", "response": ["* United Kingdom or India (1872–1969) Stanley Reed (British politician)"]}, {"page": "Stanley Reed (UK politician)", "response": ["#REDIRECT Stanley Reed (British politician)"]}, {"page": "Harifal", "response": ["Stanley Reed (28 January 1872 – 17 January 1969) was a British Conservative Party politician and an important figure in the media of India in the early 20th century. He claims;The British India founded that Maler kotla's ruling family, though famed as Pathan, is actually Sayyid in its origin, for its ancestral progenitor was Sayyid Husain who migrated from Ghaur during the reign of caliph Abd al-Malik ibn Marwan (646–705 the 5th Umayyad Caliph) and settled in the region neighboring `Kooh-e-Sulaiman.My State, Malerkotla"]}, {"page": "Sir Stanley Reed", "response": ["#REDIRECT Stanley Reed (British politician)"]}, {"page": "1938 Aylesbury by-election", "response": ["The local Conservatives selected Sir Stanley Reed as candidate. He was a 66-year-old  who had been a newspaper editor in India where he lived for 50 years. "]}, {"page": "1916 Birthday Honours", "response": ["*Herbert Stanley Reed  Editor of The Times of India"]}, {"page": "1919 New Year Honours", "response": ["*Sir Stanley Reed, Vice-President, Central Publicity Board"]}, {"page": "Bunyan Joseph", "response": ["Bishop Bunyan Joseph (20 August 1894 – 25 October 1986) was the first and only electedChurch of South India, Order of Service for the Consecration  of the First New Bishops of  The Church of South India, Printed at London Mission Press, Nagercoil, 1947.  Cited by Joseph G. Muthuraj, Speaking Truth to Power A Critique of the Church of South India Episcopacy (Governance) of the 21st Century, Globethics, Geneva, 2015, pp.209-229. Bishop - in - Anantapur-Kurnool DioceseThe Living Church;, Volume 114, April 27, 1947, p.9 who was consecrated on 27 September 1947 and was among the 15Sir Stanley Reed (Compiled), The Times of India Directory and Year Book Including Who's who, 1949, Times of India Press, Calcutta, 1949, p.550. inauguralP. John John, The Church of South India and the Modernization of Kerala in Journal of Kerala Studies, Volume III, Part II, June 1976, pp. 223. Bishops when the Church of South India was inaugurated at the CSI-St. George's Cathedral, Chennai.  He was presented for consecration by The Venerable F. F. Gladstone and Canon T. Sithers. to the Presiding Bishop Cherakarottu Korula Jacob, who as the first Moderator, consecrated Bunyan Joseph.", "After Bunyan Joseph returned to the fold of the CSI in 1952, Arthur Michael Hollis, then Moderator, invited him to be Assistant Bishop - in - Madras.  Bunyan Joseph chose to proceed to Secunderabad where Frank Whittaker, then Bishop - in - Medak accommodated him in Medak Diocese made him as Assistant Bishop.Sir Stanley Reed (Compiled), The Times of India Directory and Year Book Including Who's who 1957, Times of India Press, Calcutta, 1957, p.903. Bunyan Joseph also served as Presbyter during the period 1956-1957 and 1960-1961 at the CSI-Church of St. John the Baptist in Secunderabad.CSI-Church of St. John the Baptist, History of the Diocese - Presbyters.  Rajaiah David Paul recorded that Bunyan Joseph retired in August 1959 after attaining superannuation.  However, he also recorded that it was only in October 1963Rajaiah David Paul, Ecumenism in action: a historical survey of the Church of South India, Christian Literature Society, Madras, 1972, p.107. that he finally retired from active service of the Church."]}]}}