{"wiki_id": "http://www.wikidata.org/entity/Q7597898", "itemLabel": "Stan Steele", "itemDescription": "Footballer (1937-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stan_Steele", "wikipedia_page": {"main": "Stanley Frederick Steele (5 January 1937 – 15 July 2005) was an English footballer. A half-back and inside-forward, he scored 97 goals in 370 league and cup games for Port Vale between 1955 and 1968. His parents named him Stanley Frederick in honour of Stanley Matthews and Freddie Steele.He was prolific in his first spell at Port Vale between 1955 and 1961, and hit 66 goals in 185 league games, helping the \"Valiants\" to the Fourth Division title in 1958–59. He was sold to West Bromwich Albion in March 1961 for £10,000, but returned to Port Vale for the same fee four months later. He proved to be less prolific in his second spell at the club, and was given a free transfer in April 1965. He spent time in South Africa with Port Elizabeth City before a brief and unsuccessful third spell at Port Vale in January 1968. He later had spells with non-league outfits Eastwood, Armitage, and Great Haywood.", "link_mentions": [{"page": "Fenton, Staffordshire", "response": ["* Stan Steele (born 1937) former footballer, scored 97 goals in 370 league and cup games for Port Vale F.C."]}, {"page": "Tom Pope", "response": ["On 1 September 2018, Pope scored in a 2–1 home defeat to Newport County, to take his tally at the Vale Park ground one clear of Stan Steele to a record 56; after the game Pope said that \"I would rather not have scored and have got the three points [and] I would give up any individual award and any record for another promotion. It's a team game, not an individual sport\". In December he signed a new two-year contract to keep him tied to the club until summer 2021. On 12 January, he picked up a hamstring injury during a 3–0 home loss to Colchester United and was ruled out of action for 'a few weeks'. On 30 March, he scored the winning goal in a 2–1 victory over Northampton Town, and in doing so became only the third player (after Wilf Kirkham and Martin Foyle) to score 100 goals for the club. He finished as the club's top-scorer for the fifth time for the 2018–19 season, and was named as that year's PFA Community Champion at the club's end of the year awards."]}, {"page": "Norman Low", "response": ["Low signed 'speedy and direct' winger Brian Jackson from Liverpool for £2,000, experienced left-back Roy Pritchard from Notts County, and Peter Hall from Stoke City. They picked up just two points from their first five home games, before turning Vale Park into a fortress. In mid-season he handed keeper Ken Hancock and striker Graham Barnett their débuts. Vale went twelve games unbeaten to rise to the top of the table, and thrashed Gateshead 8–0 on Boxing Day. He put veteran Roy Sproson back into the defensive line, whilst up front Stan Steele 'did the work of two men', Harry Poole brought 'flexibility and fluidity', and Graham Barnett scored from half-chances. They finished as Fourth Division champions in 1958–59 with 64 points, four points clear of second, and seven clear of fifth spot, scoring a club record 110 goals.", "Low prepared for the 1960–61 season by recruiting former Wales international inside-right Noel Kinsey from Birmingham City as a player-coach, and 21-year-old outside-left Dennis Fidler from the Manchester City Reserves. His £10,000 offer for Aston Villa's Gerry Hitchens was rejected, whilst interest in re-signing Ronnie Allen also went nowhere. Low instead got 'bustling' Ted Calland on a free transfer from Exeter City, and sold Fred Donaldson to Exeter for £2,000. In November he signed Bert Llewellyn from Crewe Alexandra for £7,000. His team put in some memorable performances, including a 5–0 win over Grimsby Town at Blundell Park, in what Roy Sproson later described as his 'greatest memory' and 'one of their finest hours'; the performance was so impressive they received 'a standing ovation' from the home crowd, as the \"Valiants\" finished the game 'rolling the ball about like a game of chess'. Vale were in the promotion hunt until late in the season, as Low released Albert Leake and sold Stan Steele to West Bromwich Albion for £10,000. Vale recorded a seventh-place finish, and Low ended the campaign by releasing Harry Oscroft (Brantham Athletic), Ted Calland (Lincoln City), John Poole (Macclesfield Town), and Peter Hall (Bournemouth & Boscombe Athletic).", "He added to his squad for the 1961–62 campaign by spending £2,000 on inside-forward Arthur Longbottom (Queens Park Rangers); £10,000 on Stan Steele (back from West Brom); and £2,000 on centre-half John Nicholson (Liverpool); whilst free signings included winger Stan Edwards (Everton), goalkeeper Peter Taylor (Middlesbrough), and Joe Maloney (Shrewsbury Town). He sold Cliff Portwood to Grimsby Town for £6,000 to balance the books. The Sentinel commented that \"gloom has descended\" following a poor start to the season, however the Vale's form improved after Low sold Dennis Fidler to Grimsby Town for £2,000, signed Colin Grainger from Leeds United for £6,000, and further added to his firepower by signing Ralph Hunt from Swindon Town for £3,500. Stanley Matthews' return to the Victoria Ground resulted in Low unsuccessfully trying to tempt Tom Finney out of retirement. The Vale finished in 12th place, and Low sold three players for £2,000 each: Brian Jackson to Peterborough United, Ralph Hunt to Newport County, and David Raine to Doncaster Rovers."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|Stan Steele", "|Stan Steele"]}, {"page": "History of Port Vale F.C.", "response": ["The 1957–58 season was unique, as the bottom twelve in both Third Divisions would be relegated to a newly created Fourth Division. Low made many changes of personal, making the team barely recognisable to that of the glory days just a few years earlier. New man Stan Steele rifled in a total of 22 goals, but it was not enough to prevent a 15th-place finish, and therefore a ticket to the new fourth tier. Their first season in this new division was extremely successful, as the club took the title with a club record 110 goals. Normal Low picked out three star players: 'the supreme goalscorer' Graham Barnett, 'the find of the season' Ken Hancock and that 'model of consistency' Stan Steele. With five forwards hitting double figures, a profit being made and the gate receipts increasing, optimism was high in Burslem, especially with the Bycars End terrace work being completed leading to an overall capacity of 50,000.", "On 9 January 1960, Port Vale gave 'one of the finest performances in their history', beating high flying Second Division outfit Cardiff City 2–0 at Ninian Park, and 'thoroughly deserved' their Third Round victory. In round four, 'the defence took the honours' in a 1–0 win at second tier Scunthorpe United. The fifth round held eventual Second Division champions Aston Villa, who ran out 2–1 winners at Vale Park. Their fine cup form did not transfer over to the league however, and a mid-table position finished the 1959–60 season. Stan Steele was an ever-present for the third season running. The club meant business in 1960–61, as proven by a £10,000 attempt to sign Villa's Gerry Hitchens. In January, Albert Leake left for Macclesfield Town, leaving Roy Sproson the only surviving member of the legendary 1953–54 outfit. After Stan Steele was 'rested' following 195 consecutive appearances and consequently put in a transfer request. In March 1961 he moved to West Brom for a £10,000 fee. Cliff Portwood's 26 goals helped the club achieve a seventh-place finish.", "The club's poor start to 1962–63 left a heckled Stan Steele transfer listed. On 30 October Low shocked the fans with his resignation, even more surprisingly old boss Freddie Steele was reinstated. The \"Steele curtain\" returned to Vale Park, as the team went 525 minutes without conceding a goal, ironically this run was ended by Ronnie Allen, now with Crystal Palace scored an otherwise meaningless consolation goal. The previous season's top scorers Bert Llewellyn and Arthur Longbottom were sold to Northampton Town for £7,000 and Millwall for £2,000 respectively. On 13 March the club went out of the FA Cup at the fourth round, defeated 2–1 by top tier Sheffield United. Tony Richards was bought for £9,000 in March and amazingly became the season's top scorer with 13 goals in three months and 14 games. With rivals Stoke promoted from the second tier and Crewe from the fourth, Vale finished in third, four points off the Second Division.", "The club flopped completely in 1964–65. Goalkeeper Ken Hancock was sold to Ipswich Town at Christmas time, raising £10,000. Freddie Steele departed in February, as Jackie Mudie was appointed caretaker manager. Mudie created 'a punchier attack and a far more stable defence' as the club managed four home wins in a row. However the club were relegated in 22nd place, five points away from safety. No club in the Football League had scored less than Vale's tally of 41, with top scorer Cheesebrough managing just seven strikes. To slash the wage bill, Stan Steele, Ron Smith, Ron Andrew, Tim Rawlings and Stan Trafford all left on free transfers. The season saw a financial loss of around £15,000, the home attendance being an average of around 5,500."]}, {"page": "Stanley Frederick Steele", "response": ["#REDIRECT Stan Steele"]}, {"page": "Stanley Steele", "response": ["#REDIRECT Stan Steele"]}, {"page": "Cliff Portwood", "response": ["He joined Third Division Port Vale in August 1959, when manager Norman Low paid out £750 to secure his services. He scored his first senior goal against Queens Park Rangers on 5 December 1959, in a 3–3 draw in the FA Cup. He finished the 1959–60 campaign with 12 goals to his name, bagging braces in wins over Grimsby Town and Bury. He was the club's top scorer for the 1960–61 season with 26 goals, netting twice in clashes with Chelmsford City, Watford, Bristol City and Grimsby Town, and hitting a hat-trick in a 5–0 boxing day win over Tranmere Rovers in front of over 14,000 spectators at Vale Park. He was sold to Grimsby Town for £6,000 in July 1961, as the club were looking to raise £10,000 to re-sign Stan Steele from West Bromwich Albion. He had scored 38 goals in 74 games for Port Vale in league and cup competitions."]}, {"page": "Jack Wilkinson (footballer, born 1931)", "response": ["Wilkinson thereafter signed with Norman Low's Port Vale in June 1957, a move which suited him as his home with wife and two children was in nearby Middlewich. He scored a total of 19 goals in 44 appearances in the 1957–58 season. However his goals could not prevent the \"Valiants\" finishing within the lower half of the Third Division South table and thereby become founding members of the inaugural Football League Fourth Division. He then scored 21 goals in 34 games in Port Vale's campaign of 1958–59, wherein Vale stormed to promotion as the Fourth Division's inaugural champions. Some of the other members of Vale's highly effective front-line for that season included Harry Poole, Stan Steele and Noel Kinsey. Having scored just once in six league games at the start of the 1959–60 season, he was sold to Exeter City for a £2,500 fee in October 1959. Wilkinson was flown down to St James Park by helicopter to sign with the club, and went on to score on his debut for the \"Grecians\". He also helped Frank Broome's side post a ninth-place finish in the Fourth Division of the 1959–60 season. The club had to apply for re-election in the 1960–61 season, and despite boasting a record of 26 goals in 48 league games for Exeter, Wilkinson moved on to non-league sides Wellington Town and Murgatroyd's, and served Winsford United as a player-coach."]}, {"page": "Football League Third Division North versus South representative matches", "response": ["| Stan Steele"]}, {"page": "1956–57 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Stan Steele", "|9||FW||||Stan Steele||3||0||3"]}, {"page": "1957–58 Port Vale F.C. season", "response": ["The season opened with a 1–0 win over Aldershot at the Recreation Ground. This started a sequence of just four defeats in seventeen games, which included doing the double over Southampton (a 3–0 win at The Dell followed by a 4–0 win at Vale Park). This was achieved with Low's attacking policy, a stark contract to 'the Steele Curtain' defence. However their five clean sheets in their first eight games also illustrated their defensive strength. In September, right-half Selwyn Whalley turned part-time, dividing his duties between playing football and teaching at Hanley High School. Winger Alan Bennett was also transferred to Crewe Alexandra. By November, Vale were third in the league, and Low signed Bert Carberry and Jack Wilkinson. Following this top-scorer Stan Steele went off the boil, as the Vale lost their form in the Christmas period, losing 1–0 twice to Coventry City in two days. Though before this a 6–1 victory was recorded over Aldershot.", "They finished in fifteenth position with 42 points from 46 games. Five points away from the top half of the table, their 'remarkable decline' continued with a second relegation in two years. Their 58 goals conceded was a respectable total, as was their 67 goals scored. Stan Steele, Jack Wilkinson, and Harry Poole all proved themselves consistent goalscorers, scoring 22, 19, and 16 goals respectively.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|1||FW||||Stan Steele||21||1||22"]}, {"page": "1958–59 Port Vale F.C. season", "response": ["The 1958–59 season was Port Vale's 47th season of football in the English Football League, and their first season in the newly created Fourth Division following their relegation from the Third Division South. They scored a club-record 110 goals in 46 league matches to storm to the Fourth Division title. Forwards Stan Steele, Jack Wilkinson,  Graham Barnett, Harry Poole, and John Cunliffe all reached double-figures in front of goal.", "A twelve match unbeaten run followed, taking Vale four points clear at the top. This included a triumphant 8–0 Boxing day win over Gateshead (a Vale Park record and their biggest win since 24 September 1932), followed by a 4–0 win at Redheugh Park on New Year's Day. Roy Sproson was then brought back into the defensive line, whilst up front Stan Steele 'did the work of two men', Harry Poole brought 'flexibility and fluidity', and Barnett scored from half-chances. Just as Vale seemed to be running away with the title, defeat came on 16 March at Highfield Road to Coventry City. The following month the \"Valiants\" beat the \"sky blues\" 3–0, taking them six points ahead of the chasing pack. Promotion was secured on 18 April with a 1–1 draw at home to Darlington, and the title was secured with a final day victory over Millwall.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|1||FW||||Stan Steele||22||0||22"]}, {"page": "1959–60 Port Vale F.C. season", "response": ["They finished in fourteenth spot with 46 points, a good finish for a club just promoted. Stan Steele had put in his third successive ever-present season, whilst Barnett was the top-scorer despite leaving in March. The club toured Czechoslavakia at the end of the season, due to Stoke-on-Trent's close relationship with the town of Lidice that developed from local MP Barnett Stross's Lidice Shall Live campaign. The team defeated Cottwaldov, Přerov, Karlovy Vary; drew with FK Teplice; and were beaten by Jihlava.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|4||FW||||Stan Steele||10||1||1||11"]}, {"page": "1960–61 Port Vale F.C. season", "response": ["In sixth place, a 6–2 hammering from Walsall at Fellows Park on 17 December set them back. The goals continued, this time in Vale's favour, with a 5–0 win and 3–3 draw with Tranmere Rovers, and a 4–1 victory over Bury. In January, Albert Leake was transferred to Macclesfield Town, leaving Sproson as the only survivor of the legendary 1953–54 outfit. Vale continued to entertain and win games, as The Sentinel's Jon Abberley described Harry Poole as 'one of the best wing-halves ever produced in the Potteries. By 11 February, Vale were four points from second place, as Vale battled to a 1–1 draw with Torquay United in 'a sea of mud' at Plainmoor. A week later Llewellyn scored a hat-trick past Swindon Town. However, on 4 March QPR ended their promotion hopes with a 1–0 win at Loftus Road, the second of a streak of five games without a win for Vale. The next week Notts County easily beat Vale 3–1, in a game for which Stan Steele was rested after 195 consecutive appearances. Steele immediately handed in a transfer request, and got picked up by West Bromwich Albion for a £10,000 fee. Vale's season then petered out, ending with an attendance of only 4,088 for a 1–1 draw with Bristol City at Vale Park, followed by two away draws.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|3||FW||||Stan Steele||10||0||3||1||14", "| March 1961 || FW ||  || Stan Steele || West Bromwich Albion || £10,000 || "]}, {"page": "1961–62 Port Vale F.C. season", "response": ["The pre-season saw Norman Low spend some of the £10,000 in transfer funds he was allocated. He spent £2,000 acquiring inside-forward Arthur Longbottom from Queens Park Rangers. Low then repaid West Bromwich Albion the £10,000 for Stan Steele in order to bring him back to Vale Park. This meant a 'shock' for the fans, as Cliff Portwood was sold to Grimsby Town for £6,000 to balance the books. Another £2,000 was spent on bringing centre-half John Nicholson from Liverpool. Free signings included winger Stan Edwards (Everton), goalkeeper Peter Taylor (Middlesbrough), and Joe Maloney (Shrewsbury Town). Low declared that the logic behind the signings was to improve the defence and that his side was now 'capable of getting promotion'. To whip the new signings into shape trainer Lol Hamlett took them on a seven-mile run.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|3||FW||||Stan Steele||8||0||0||8", "| July 1961 || FW ||  || Stan Steele || West Bromwich Albion || £10,000 || "]}, {"page": "1962–63 Port Vale F.C. season", "response": ["The season opened with six points from four games, with three clean sheets to boot. Rowland was dropped from the first eleven following a 2–0 defeat at Ashton Gate on 1 September. Vale then became inconsistent, and so Low added young forward Terry Harkin to the squad from Coleraine, and transfer-listed Stan Steele after he began to be targeted by hecklers at Vale Park. Despite beating Southend United 5–1, the club continued to sink down the table. They then began a nine-game unbeaten streak on 20 October with a 1–1 draw with Carlisle United at Brunton Park. However ten days later manager Norman Low tendered his resignation, to the shock of fans and pundits. Low cited disagreements with the board as the reason for his departure. The club felt they needed a marquee signing and so approached first Tom Finney and then European cup winning coach Béla Guttmann, who had just departed Benfica, both declined the role. Low's successor instead proved to be his predecessor, Freddie Steele, in another development that took many by surprise. Roy Sproson later noted \"He [Steele] had changed. He had not got the enthusiasm or drive as before, but the lads still responded to him\".", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|–||FW||||Stan Steele||6||1||0||7"]}, {"page": "1963–64 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Stan Steele", "|5||FW||||Stan Steele||5||1||0||6"]}, {"page": "1964–65 Port Vale F.C. season", "response": ["On the financial side, a £15,497 was recorded despite a donation of £16,320 from the Sportsmen's Association, the Development Fund, and the social club. The average home attendance was a mere 5,508, almost half that of the previous season. Gate receipts had plummeted to just £24,117, compared to a wage bill of £41,092; meanwhile a £6,250 profit was made on transfers. A clear-out of players could not be avoided, as twelve were handed free transfers, including: Billy Bingham (retired); Stan Steele (left the country); Ron Smith (Southport); Ron Andrew (retired); Tim Rawlings (Nuneaton Borough); Stan Trafford (retired); and Albert Cheesebrough (joined Mansfield Town for free, although Vale had wanted £5,000 for him).", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "|–||FW||||Stan Steele||3||0||0||3", "| April 1965 || FW ||  || Stan Steele ||  Port Elizabeth City || Free transfer || "]}, {"page": "1967–68 Port Vale F.C. season", "response": ["In January the League's investigation resulted in a Football Association commission to investigate six charges: numerous amateurs had received a weekly wage; associate schoolboys played for the club despite this being against the rules; extra bonuses were offered for reaching the Second Round of the League Cup; John Ritchie had received illegal payments; Clint Boulton and Gordon Logan had received illegal bonuses; and that young players had been given gifts in breach of league rules. With this hanging over the club's head form suffered, and Jimmy Hill left the club to become player-manager of Derry City. Stan Steele returned from South Africa and joined on a month-long trial, however he only managed to score an 'incredible' own goal by lobbing Stuart Sharratt in a 3–0 loss to Aldershot. On 20 February the FA-Football League joint-inquiry 'severely censured' Port Vale officials at Lancaster Gate after the officials admitted the charges held against them. The club received a £2,000 fine and a recommendation that they be expelled from the league, a month later on 6 Mach another £2,000 fine was issued and the club were informed that they would be expelled from the Football League at the end of the season. The club's officials were 'shocked and appalled' at the 'savage penalties', and Stoke City chairman Albert Henshall also called the punishment 'severe'. The club changed the leadership structure and defiantly stated their aim to win promotion from the Fourth Division, and also their decision to appoint a new player-manager to lead them to such an aim. On the pitch, Vale hovered uncomfortably above the re-election zone, and only finished above the re-election zone with a 1–0 win over Lincoln City at Sincil Bank on the final day.", "|align=\"left\"|FW||align=\"left\"| Stan Steele", "| January 1968 || FW ||  || Stan Steele ||  Port Elizabeth City || Trial || ", "| Summer 1968 || FW ||  || Stan Steele ||  Port Elizabeth City || Released || "]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Stan Steele (born 1937), played for Port Vale."]}]}}