{"wiki_id": "http://www.wikidata.org/entity/Q7599155", "itemLabel": "Stanisław Julian Ostroróg", "itemDescription": "Polish photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanis%C5%82aw_Julian_Ostror%C3%B3g", "wikipedia_page": {"main": "Count Stanisław Julian Ostroróg (1836– 31 May 1890) was an exiled Polish nobleman and Crimean War veteran. He later became known as an early professional portrait photographer who created photogravures, under the professional name of Walery, of many notable contemporaries, including Queen Alexandra of Denmark, Queen Victoria, Victor Hugo, and Sarah Bernhardt.\nAfter his death, his brand, \"Walery\", was continued by his eldest son, Stanisław Julian Ignacy Ostroróg in London and Paris, sometimes also as \"Lucien Walery\" and a range of other related pseudonyms.", "link_mentions": [{"page": "List of Polish people", "response": ["* Stanisław Julian Ostroróg, early portrait photographer, known as \"Walery\""]}, {"page": "Mogilev", "response": ["*Stanisław Julian Ostroróg, Polish count, Crimean War veteran, noted Victorian Photographic portraitist, naturalised British subject"]}, {"page": "Brompton Cemetery", "response": ["* Count Stanisław Julian Ostroróg – Crimean War veteran, photographer to the Queen"]}, {"page": "Stanislaw Julian Ostrorog", "response": ["#REDIRECT Stanisław Julian Ostroróg"]}, {"page": "Ostroróg (disambiguation)", "response": ["** Stanisław Julian Ostroróg (1830–1890), portrait photographer"]}, {"page": "Stanislaw Julian Ostroróg", "response": ["#REDIRECT Stanisław Julian Ostroróg"]}, {"page": "Poles in the United Kingdom", "response": ["During the November 1830 Uprising against the Russian Empire, British military equipment and armaments were sent to Poland, facilitated by the presence of Leon Łubieński studying at Edinburgh University at the time and the swift despatch to Britain of his uncle, Józef, to secure the shipment.Łubieński, Tomasz Wentworth. (1886). Henryk Łubieński i Jego Bracia - Wspomnienia Rodzinne odnoszące się do Historyi Królestwa Polskiego i Banku Polskiego. Kraków: Gebethner.  https://jbc.bj.uj.edu.pl/dlibra/doccontent?id=305507 His nephew's memoir of his brothers' and his role in the industrial and banking history of the Kingdom of Poland. (in Polish)Kalinowski, Zdzisław. (2013). The Marriage of Count Tomasz and Countess Konstancja Łubieński at their estate of Rejowiec.  http://kalinowski.weebly.com/uploads/4/9/1/6/4916495/malzenstwo_hrabiow_tomasza_andrzeja_adama_i_konstancji_marianny_apoloni_lubienskich_w_rejowcu.pdf See p. 21 for detail of Leon Łubieński. After the collapse of the rebellion in 1831, many Polish exiles sought sanctuary in Britain. One of them was the veteran and inventor, Edward Jełowicki, who took out a patent in London on his Steam turbine.The London Journal of Arts and Sciences, and Repertory of Patent Inventions, Volume 8. 1836  The fall of Warsaw and the arrival of the Polish on British shores prompted poet Thomas Campbell with others to create in 1832 a Literary Association of the Friends of Poland, with the aim of keeping British public opinion informed of Poland's plight. The Association had several regional centres; one of its meetings was addressed by the Polish statesman, Count Adam Jerzy Czartoryski.Żurawski vel Grajewski, Radosław. (1999) Działalność księcia Adama Jerzego Czartoryskiego w Wielkiej Brytanii (1831–1832), Warsaw: \"Semper\" (A Polish-language account of Adam Jerzy Czartoryski's 1831–32 activism in Great Britain). Czartoryski's permanent representative at the Court of St James's was General Count Władysław Stanisław Zamoyski, who later led a division in the Crimean War on the British side against Russia. Zamoyski's adjutant was another Polish exile, an officer in the 5th Sultan's Cossacks—a Polish cavalry division—Colonel Stanisław Julian Ostroróg.File on Władysław Zamoyski in the Bibliography of the history of Central and East Europe:Władysław Zamoyski – bibliografia osobowa w LitDok Bibliografia Historii Europy Środkowowschodniej, Herder-Institut (Marburg) in Polish, retrieved 1-1-2018 The last official Polish envoy to Britain was the statesman, writer, and futurologist, Julian Ursyn Niemcewicz (1758–1841).", "*Stanisław Julian Ostroróg (1834–90) – Photographer to the Queen. (He and his son, below, were both known as Walery.)  Sitters included Victor Hugo and Queen Victoria.Notable father and son portrait photographers working under the name \"Walery\" in London and later in Paris http://www.npg.org.uk/collections/search/person/mp14017/waleryThe NPG has 197 portraits, including of Queen Victoria and members of her family http://www.npg.org.uk/collections/search/person/mp14017/waleryThis Swiss photographic website gives the most extensive biography of the \"3\" persons who worked as the photographer Walery; Zygmunt Wielowiejski, however, believes that the latter 2 of the 3 Walery photographers are both Ostroróg, the son. See: Meyer, Jűrg. H. (2010) \"Wer war 'Walery'?\" https://www.fotointern.ch/archiv/2010/01/31/wer-war-«walery»/ in German, retrieved 12-31-2017"]}, {"page": "Sampson Low", "response": ["In 1848, Low and his eldest son Sampson Jr. opened a publishing office at the corner of Red Lion Court, Fleet Street. In 1852 they moved to 47 (and later to 14) Ludgate Hill, where, with the aid of David Bogue, an American department was opened. In 1856 Edward Marston became a partner, and Bogue retired. The firm removed in 1867 to 188 Fleet Street, in 1887 to St. Dunstan's House, Fetter Lane, and subsequently to Paternoster Row. The firm issued works by authors such as William Black, William Henry Boulton, ECR Lorac, Julius Mendes Price, Nikolay Przhevalsky, Henry Morton Stanley, and Jules Verne. It also published the photographic work of Polish Count Stanisław Julian Ostroróg, known professionally as Walery Ltd., as \"Celebrity Portraits\"   by Sampson Low & Co. in the late 1880s. The business continued to 1964. In 1968, Macdonald & Co. (Publishers) Ltd. co-located with Sampson Low at St Giles House, 49-50 Poland Street, and took over when Sampson Low finally ceased publishing in 1969."]}, {"page": "Ostroróg family", "response": ["* Stanisław Julian Ostroróg (1834–1890), Crimean War veteran, photographer under pseudonym, Walery"]}, {"page": "Adam Mickiewicz Museum, Istanbul", "response": ["* Stanisław Julian Ostroróg"]}, {"page": "List of Polish photographers", "response": ["*Stanisław Julian Ostroróg, ps Walery father"]}, {"page": "Walery (name)", "response": ["* Stanisław Julian Ostroróg (1830–1890), an expatriate Polish photographer who used \"Walery\" as a pseudonym"]}, {"page": "Stanislas Ostroróg", "response": ["Ostroróg was the grandson of the noted Victorian photographer, Count Stanisław Julian Ostroróg, through his third son, Count Leon, a jurist and Koranic law scholar.Aneta Ostroróg. (2005) http://bazhum.muzhp.pl/media//files/Pamietnik_Biblioteki_Kornickiej/Pamietnik_Biblioteki_Kornickiej-r2005-t27/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225.pdf (in Polish) Journal of the archives of Kornik Castle. accessed 2018.12.31. He was born in Turkey in 1897. He studied in France and returned to Kandilli on the Bosphorus after finishing school. He would meet the author Claude Farrère in Turkey. Ostroróg wanted to be an author and would later use his writing skills in his diplomatic career. As the First World War broke out, he returned to France to look for his father and brother. He would find his father in London instead. Travelling between Kandilli and France, he was pushed by his father to return to school.  He graduated from the École libre des sciences politiques (Free School of Political Science) and was admitted to the French foreign service by a stiff entrance exam in 1927. Meanwhile, his uncle, Stanisław under the pseudonym, Walery, had a brilliant photographic career in Paris, photographing the gaiety of the city, including Josephine Baker."]}, {"page": "Stanisław Julian Ignacy Ostroróg", "response": ["He was born on 12 September 1863 in London into a family of political emigrants of Polish noble descent. He was the eldest child of Count Stanisław Julian Ostroróg, a British subject and his Polish wife, Teodozja Waleria, née Gwozdecka. His father was born in the Russian Partition of what had once been the Polish–Lithuanian Commonwealth, not long after the November uprising of 1830 which led to severe repression of the insurgents, of which the family had been part. While Ostroróg senior served as an officer in the Imperial Guard in the Crimean War, he came into contact with a British General and decided to switch sides, but after a failed attempt to join the British forces, apparently on health grounds, he was directed to the Polish cavalry division of the Ottoman Army, headed by General Zamoyski, whose adjutant he became in the rank of colonel. After the war he settled in London and was granted citizenship in 1862 and married.  After the birth of Stanisław junior, the family headed to Marseille to set up a photographic studio. In 1866 the family were back in Warsaw, but the following year after the death of the second son, they left for Paris in time for the birth of the third son, Leon, and where Ostroróg senior resumed his successful photographic career until 1878 when his creditor's financial difficulties forced him to give up trading and the family moved back to London in 1880. He opened a Regent Street studio where Stanisław junior was eventually to join his father.Ostroróg, Aneta. (2005). \"Znany – nieznany – zapomniany. Nieco informacji o Stanisławie Julianie Ostrorogu\", Dagerotyp, nr 14, pp. 5–13. (\"Known – unknown – forgotten. Some information about Stanisław Julian Ostroróg\" in the Polish journal, Dagerotyp, .", "thumb|upright|Death certificate of Charles Auguste Varsavaux, photographer at 9bis rue de Londres in the 9th arrondissement of Paris, who died at the address on 20 April 1935, (Paris Archives). This address happens to be the original photographic studio of Count Stanisław Julian Ostroróg, senior (1830–1890) and later the studio of his son."]}, {"page": "Leon Walerian Ostroróg", "response": ["Ostroróg was the third son of Count Stanisław Julian Ostroróg, a British and France-based Polish emigrant of noble descent and his wife, Teodozja Waleria Gwozdecka. The family travelled frequently between the UK, France and Poland. The father was a noted Victorian photographer, who after working in Marseilles and Paris, eventually settled in London.Aneta Ostroróg. (2005) http://bazhum.muzhp.pl/media//files/Pamietnik_Biblioteki_Kornickiej/Pamietnik_Biblioteki_Kornickiej-r2005-t27/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225.pdf (in Polish) Journal of the archives of Kornik Castle. accessed 2018.12.31. Meanwhile, Ostroróg underwent schooling in France and attended the Sorbonne where he completed a doctorate, later specialising in Islamic Law."]}, {"page": "List of Kresy-born Poles", "response": ["* Stanisław Julian Ostroróg, Crimean war veteran, exile, London and Paris early portrait photographer born in Mogilev current BelarusOstroróg, Aneta. (2005). \"Zapomniany fotograf Stanisław Julian Ostroróg (1834-1890) Pamiętnik Biblioteki Kórnickiej 27, 217-225 (\"The forgotten Photographer Stanisław Julian Ostroróg (1834-1890) - Journal of the Kórnik Library) http://bazhum.muzhp.pl/media//files/Pamietnik_Biblioteki_Kornickiej/Pamietnik_Biblioteki_Kornickiej-r2005-t27/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225/Pamietnik_Biblioteki_Kornickiej-r2005-t27-s217-225.pdf  retrieved 1-2-2018."]}]}}