{"wiki_id": "http://www.wikidata.org/entity/Q7596620", "itemLabel": "Stafford Floyer-Acland", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Stafford_Floyer-Acland", "wikipedia_page": {"main": "Brigadier Stafford Nugent Floyer-Acland,  (23 December 1916 – 1994) was a British soldier. \nFloyer-Acland was the only child of Lieutenant General Arthur Nugent Floyer-Acland and his wife Evelyn Stafford Still, daughter of Stafford Francis Still. Floyer-Acland was educated at Marlborough College and the Royal Military College, Sandhurst. He was commissioned a second lieutenant in the Duke of Cornwall's Light Infantry in 1937 and, after the Second World War, became major in 1950.Floyer-Acland was transferred as lieutenant colonel to the King's Own Yorkshire Light Infantry in the end of 1959, and was promoted to colonel in 1964. Two years later, he became a brigadier, serving as deputy commander of the land forces in Borneo. Subsequently he was Brigadier of Administration and Quartering, Northern Command in 1967, for which he was appointed a Commander of the Order of the British Empire. He retired from active service in the following year and in 1972, he became deputy colonel of the Somerset and Cornwall Light Infantry, a post he held until 1977. He was appointed High Sheriff of Dorset in 1974, and became a Deputy Lieutenant for the same county in the year thereafter.On 14 April 1950, Floyer-Acland married Patricia Egidia Hastings Emmott, daughter of Lieutenant Colonel Richard St Barbe Emmott. They had three children, two sons and one daughter.", "link_mentions": [{"page": "Acland", "response": ["* Stafford Floyer-Acland (1916–1994), British soldier"]}, {"page": "Arthur Floyer-Acland", "response": ["On 6 December 1913, Floyer-Acland married Evelyn Stafford Still, daughter of Stafford Still. His wife died in 1973 and Floyer-Acland survived her until 1980. Their only son was Stafford Floyer-Acland."]}, {"page": "Stafford Nugent Floyer-Acland", "response": ["#REDIRECT Stafford Floyer-Acland"]}]}}