{"wiki_id": "http://www.wikidata.org/entity/Q7606587", "itemLabel": "Steff Gaulter", "itemDescription": "British meteorologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Steff_Gaulter", "wikipedia_page": {"main": "Steff Gaulter (born 1976 in Sway, Hampshire) is an English weather forecaster for Al Jazeera English.\nGaulter won a place at University of Cambridge in 1994 where she was awarded an MA in Physics, gaining the University's top marks for the final year presentation project.  While studying, she also broadcast on hospital radio, which forged her interest in weather broadcasting.\nOn graduation she taught GCSE and A-Level Physics and Maths - spending one summer teaching in Uganda.  She then became a trainer of Scientific Instruments at seminars and workshops throughout the UK, specialising in Ellipsometry - a non-destructive form of surface analysis.\nIn 1999 she joined the Met Office, qualifying as a fully trained forecaster, becoming the first person to be awarded a distinction in her final forecasting exam.  While at the Met Office she worked at BBC Bristol, presenting on regional radio covering Swindon Sound, Wiltshire Sound, and Somerset Sound; and on television on Points West and a week on BBC South.  She also used to host a weather slot on Monday and Friday for a friend at Bath FM.\nGaulter joined Sky News as a weather forecaster in November 2002, particularly enjoying external broadcasts from the Cheltenham Festival, the FA Cup Final from Cardiff and from the Glastonbury Festival.\nGaulter was subsequently recruited by Al Jazeera and has been presenting the weather on Al Jazeera English since the channel's launch in November 2006.\n\n", "link_mentions": [{"page": "New Forest", "response": ["*Steff Gaulter (born 1976), weather forecaster"]}, {"page": "Al Jazeera English", "response": ["Weather Team: Richard Angwin, Everton Fox, Steff Gaulter", "* Steff Gaulter (Sky News, UK Met Office) – weather-presenter: Doha"]}, {"page": "Sky News presenters and editorial team", "response": ["* Steff Gaulter (now at Al Jazeera English)"]}, {"page": "Steff", "response": ["*Steff Gaulter"]}, {"page": "List of Al Jazeera presenters", "response": ["*Steff Gaulter"]}]}}