{"wiki_id": "http://www.wikidata.org/entity/Q7608942", "itemLabel": "Stephen Cooke", "itemDescription": "English footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Cooke", "wikipedia_page": {"main": "Stephen Lee Cooke (born 15 February 1983) is a former professional footballer who is now retired. Once considered a bright prospect for the future of English football, Cooke's career was seriously affected by a number of injuries.", "link_mentions": [{"page": "Steve Cook (disambiguation)", "response": ["* Stephen Cooke (born 1982), English footballer"]}, {"page": "Smethwick Khalsa Football Federation F.C.", "response": ["For the 2017–18 season the club changed its name once more, this time to Smethwick to establish themselves as the number one club from the diverse area of Smethwick. They have also added Ahmed Ali a UEFA B Qualified coach and former Manchester United and England Schoolboy Stephen Cooke to the backroom staff. On 9 September 2017 Smethwick won their first ever game in the FA Vase beating Malvern Town 4–1, Joshua Small, Nathan Stone, Beni Kiembi and Stuart Hillman scoring the goals."]}, {"page": "Pelsall Villa F.C.", "response": ["* Stephen Cooke 2016–?"]}, {"page": "Brett Pitman", "response": ["Pitman made his professional debut on 24 August 2005 in the second round of the Football League Cup, as a 114th-minute substitute for Stephen Cooke in a goalless draw away to Torquay United. Bournemouth won 4–3 on penalties. Three days later, he played his first league game, replacing Dani Rodrigues for the final two minutes of a 2–1 away win over Bradford City in League One. On 18 October, he scored his first goal for the Cherries in the Football League Trophy, a penalty to open a 4–1 win over Aldershot Town at Dean Court, and his sole league goal of 19 games that season was scored on 18 February 2006, in the fourth minute of a 1–1 home draw with Blackpool."]}, {"page": "Aston Villa F.C. Under-23s and Academy", "response": ["Villa won the third HK Soccer Sevens tournament in 2002, defeating Arsenal in the final, they went on to defend their title in 2004 (as the 2003 competition was cancelled due to the SARS outbreak), inspired by Stephen Cooke and Steven Foley they clinched the trophy in the final against Manchester United. Striker Gabriel Agbonlahor captained Villa to the semi-final in 2006 - losing to the eventual winners Urawa Red Diamonds - and also received the 'Player of the Tournament' accolade. Villa won the competition again in May 2010, beating Central Coast Mariners of Australia in the final. The most recent HK Soccer Sevens tournament came in 2019. ", "|Stephen Cooke"]}, {"page": "Duane Darby", "response": ["On 3 August 2007, Halesowen Town confirmed that Darby had joined the club along with two other former league players, in the shape of Terry Fleming and Stephen Cooke."]}, {"page": "Bloxwich United A.F.C.", "response": ["In 2009, former Aston Villa midfielder Stephen Cooke signed for the club."]}, {"page": "Terry Fleming", "response": ["His next port of call was to sign for Kidderminster Harriers who had just been relegated out of the football league, after an average season, Fleming was released again and moved onto play for Moor Green (now known as Solihull Moors). Halesowen Town signed Fleming in 2007, along with two other former English Football League players in the form of Stephen Cooke (who also played in the Premier League for Aston Villa) and Duane Darby. After he was released by the Yeltz, Fleming had a spell at Grantham Town."]}, {"page": "Stephen Cook (disambiguation)", "response": ["*Stephen Cooke (born 1983), British footballer"]}, {"page": "HKFC Soccer Sevens", "response": ["|Stephen Cooke"]}, {"page": "2006–07 AFC Bournemouth season", "response": ["|align=\"left\"|7||align=\"left\"|MF||align=\"left\"| Stephen Cooke"]}, {"page": "Cooke, Stephen", "response": ["#redirectStephen Cooke"]}]}}