{"wiki_id": "http://www.wikidata.org/entity/Q7609398", "itemLabel": "Stephen Haggard", "itemDescription": "British actor, writer and poet (1911-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Haggard", "wikipedia_page": {"main": "Stephen Hubert Avenel Haggard (21 March 1911 – 25 February 1943) was a British actor, writer and poet.", "link_mentions": [{"page": "H. Rider Haggard", "response": ["Haggard died on 14 May 1925 in Marylebone, London, aged 68. His ashes were buried at St Mary's Church, Ditchingham. His papers are held at the Norfolk Record Office. His descendants include the writer Stephen Haggard (great-nephew), the director Piers Haggard (great-great-nephew), and the actress Daisy Haggard (great-great-great niece)."]}, {"page": "1936 in film", "response": ["*Whom the Gods Love, directed by Basil Dean, starring Stephen Haggard, Victoria Hopper – (GB)"]}, {"page": "Athene Seyler", "response": ["* with Stephen Haggard The Craft of Comedy (1944), reprinted by Routledge, 2012"]}, {"page": "Piers Haggard", "response": ["Haggard was born in London but grew up on a small farm in Clackmannanshire.  He is the great-great-nephew of Sir Henry Rider Haggard, and the son of Morna Gillespie and the actor, poet, and novelist Stephen Haggard, who died in 1943. Haggard is married to stained glass artist Anna Sklovsky, with whom he has two children, the actress Daisy Haggard, and William Haggard who is an architect. He has four children by his first marriage, Sarah, Claire, Rachel and Philip."]}, {"page": "Olivia Manning", "response": ["While some parts of the book were inventions, she also made use of real-life incidents. The opening chapter of The Danger Tree describes the accidental death of the young son of Sir Desmond and Lady Hooper. The incident was based on fact: Sir Walter and Lady Amy Smart's eight-year-old boy was killed when he picked up a stick bomb during a desert picnic in January 1943. Just as described in the novel, his grief-stricken parents had tried to feed the dead boy through a hole in his cheek. Manning had long been resentful at the Smarts' failure to include her and Smith in their artistic circle in Cairo. The scene was considered in poor taste even by Manning's friends, who were also outraged that the quiet and faithful Lady Smart was associated with Manning's very different Lady Hooper. Though both Sir Walter and his wife had died by the time of publication, Manning's publisher received a solicitor's letter written on behalf of the Smart family, objecting to the scene and requiring that there should be no further reference to the incident or to the couple in future volumes. Manning ignored both requests. She based the character of Aidan Pratt on the actor, writer, and poet Stephen Haggard, whom she had known in Jerusalem. Like Pratt, Haggard committed suicide on a train from Cairo to Palestine, but in Haggard's case it followed the end of a relationship with a beautiful Egyptian woman, rather than unrequited homosexual love. After years of complaints about her publisher Heinemann, Manning moved to Weidenfeld & Nicolson, and remained with them until the end of her life. The Danger Tree was a considerable critical success, and though Manning was disappointed yet again that her novel was not shortlisted for the Booker prize, The Yorkshire Post selected it as their Best Novel of 1977. This award followed her appointment as a Commander of the Order of the British Empire in the 1976 Birthday Honours."]}, {"page": "Poems of Today", "response": ["C. Colleer Abbott - John Arlott - W. H. Auden - George Barker - John Bayliss - Frances Bellerby - John Betjeman - Laurence Binyon - Edmund Blunden - Ronald Bottrall - Lilian Bowes Lyon - C. W. Brodribb - Gerald Bullett - Guy Butler - John Buxton - Roy Campbell - Demetrios Capetanakis - Joyce Cary - Richard Church - Alex Comfort - R. N. Currey - W. H. Davies - Walter De La Mare - Patric Dickinson - Keith Douglas - Adam Drinan - Clifford Dyment - T. S. Eliot - Arundell Esdaile - G. S. Fraser - Roy Fuller - Jill Furse - H. W. Garrod - Viola Garvin - David Gascoyne - Wilfrid Gibson - O. St. J. Gogarty - Helen Granville-Barker - Robert Graves - Geoffrey Grigson - Stephen Haggard - J. C. Hall - G. Rostrevor Hamilton - Christopher Hassall - John Heath-Stubbs - J. F. Hendry - Charles Hepburn - F. R. Higgins - Ralph Hodgson - Seán Jennett - Frank Kendon - Sidney Keyes - James Kirkup - Laurie Lee - John Lehmann - Alun Lewis - C. Day-Lewis - C. S. Lewis - Emanuel Litvinoff - Sylvia Lynd - Donagh MacDonagh - Louis MacNeice - John Masefield - E. H. W. Meyerstein - Francis Meynell - Edwin Muir - Norman Nicholson - Herbert Palmer - V. de Sola Pinto - Ruth Pitter - William Plomer - F. T. Prince - John Pudney - Kathleen Raine - Herbert Read - Henry Reed - Alexander Reid - Anne Ridler - W. R. Rodgers - Alan Rook - A. L. Rowse - V. Sackville-West - Siegfried Sassoon - E. J. Scovell - Ian Serraillier - John Short - Edith Sitwell - Osbert Sitwell - Martyn Skinner - Stevie Smith - Stanley Snaith - Helen Spalding - Stephen Spender - James Stephens - L. A. G. Strong - Hal Summers - A. S. J. Tessimond - Dylan Thomas - Terence Tiller - Henry Treece - R. C. Trevelyan - W. J. Turner - John Waller - Rex Warner - Vernon Watkins - Dorothy Wellesley - Laurence Whistler - W. B. Yeats - Andrew Young"]}, {"page": "Jamaica Inn (film)", "response": ["* Stephen Haggard as The Boy, Willie Penhale - Sir Humphrey's Gang "]}, {"page": "List of biographical films", "response": ["|Stephen Haggard"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Stephen Haggard (Acting Diploma 1933)"]}, {"page": "Daisy Haggard", "response": ["The daughter of film director Piers Haggard and his wife Anna Sklovsky, Haggard was raised and educated in Dulwich, South London, at the James Allen's Girls' School. Her grandfather was the actor Stephen Haggard, and her great-great-great-uncle was the author Sir Henry Rider Haggard."]}, {"page": "List of British films of 1936", "response": ["|Whom the Gods Love||Basil Dean||Stephen Haggard, Victoria Hopper, John Loder||Historical||"]}, {"page": "Wolfgang Amadeus Mozart in popular culture", "response": ["* Stephen Haggard portrays Mozart in the 1936 British film Whom the Gods Love."]}, {"page": "Gerard Corley Smith", "response": ["Corley Smith was predeceased by his wife, Joan Haggard, whom he married in August 1937. She was the daughter of diplomat Sir Godfrey Digby Napier Haggard and sister of actor Stephen Haggard. Upon his death in 1997, Corley Smith was survived by a son and three daughters."]}, {"page": "Haggard (surname)", "response": ["* Stephen Haggard (1911–1943), British actor, writer and poet"]}, {"page": "List of composers depicted on film", "response": ["| Stephen Haggard, Pat Fitzpatrick"]}, {"page": "Whom the Gods Love (1936 film)", "response": ["Whom the Gods Love, also known as Mozart, is a 1936 British biographical film directed by Basil Dean and starring Stephen Haggard, Victoria Hopper and John Loder. The film portrays the life of the Eighteenth Century Austrian composer Wolfgang Amadeus Mozart.", "* Stephen Haggard as Wolfgang Amadeus Mozart"]}, {"page": "2014 in public domain", "response": ["* Stephen Haggard, a British writer and poet."]}, {"page": "Heliopolis War Cemetery", "response": ["* Stephen Haggard"]}, {"page": "Haggard, Stephen", "response": ["#redirectStephen Haggard"]}, {"page": "Flowers of the Forest (play)", "response": ["Flowers of the Forest is a 1934 play by the British writer John Van Druten. It lasted for a brief West End run of fourteen performances at the Whitehall Theatre with a cast including Henry Oscar, Haddon Mason, Stephen Haggard, Barry K. Barnes and Lewis Casson.Wearing p.397 In New York it played for forty performances at the Broadway Martin Beck Theatre with a cast that included Hugh Williams and Burgess Meredith.Bordman p.117"]}]}}