{"wiki_id": "http://www.wikidata.org/entity/Q7608279", "itemLabel": "Stephanie Flanders", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephanie_Flanders", "wikipedia_page": {"main": "Stephanie Hope Flanders (born 5 August 1968) is a British economist and journalist, currently the head of Bloomberg News Economics. She previosuly was chief market strategist for Britain and Europe for J.P. Morgan Asset Management, and before that was the BBC News economics editor for five years. Flanders is the daughter of British actor and comic singer Michael Flanders and activist Claudia Cockburn.\n\n", "link_mentions": [{"page": "Nuffield College, Oxford", "response": ["Visiting fellows include Stephanie Flanders, former BBC economics editor, Tim Harford, author and economist, and George Soros, investor and philanthropist.", "File:Stephanie Flanders - Chatham House 2011.jpg|Stephanie Flanders, journalist"]}, {"page": "Henry Cockburn, Lord Cockburn", "response": ["The authors Alec Waugh and Evelyn Waugh, the journalist Claud Cockburn, Claudia Cockburn (wife of actor Michael Flanders) and author Sarah Caudwell were all descended from Cockburn, as are journalists Laura Flanders, Stephanie Flanders, Alexander Cockburn (husband of author Emma Tennant), Andrew Cockburn (husband of journalist Leslie Cockburn) and Patrick Cockburn (son-in-law of Bishop Hugh Montefiore) and actress Olivia Wilde (former wife of Tao Ruspoli).Monuments and Statues of Edinburgh, Michael T.R.B. Turnbull (Chambers) p. 54"]}, {"page": "Alexander Cockburn", "response": ["Alexander Cockburn was born on June 6, 1941, in Scotland and grew up in Youghal, County Cork, Ireland. He was the eldest son of the former Communist author and journalist, Claud Cockburn, by his third wife, Patricia Byron, née Arbuthnot (who also wrote an autobiography, Figure of Eight). His ancestral family included Sir George Cockburn, 10th Baronet, who was responsible for the burning of Washington in the War of 1812. His two younger brothers, Andrew Cockburn and Patrick Cockburn, are also journalists. His half-sister, the barrister and mystery writer Sarah Caudwell, died in 2000. In addition, journalists Laura Flanders and Stephanie Flanders are his half-nieces, daughters of his half-sister Claudia Cockburn and her husband Michael Flanders. Actress Olivia Wilde is his niece, daughter of his brother Andrew Cockburn."]}, {"page": "Patrick Cockburn", "response": [" His two brothers also became journalists, Alexander Cockburn, who died in 2012, and Andrew Cockburn, and a half-sister was mystery writer Sarah Caudwell. Journalists Laura Flanders and Stephanie Flanders are his nieces, daughters of his half-sister Claudia Flanders, and civil rights lawyer Chloe Cockburn and actress Olivia Wilde are his nieces, daughters of Andrew and Leslie Cockburn."]}, {"page": "Andrew Cockburn", "response": ["He has two brothers, Alexander Cockburn (1941–2012) and Patrick Cockburn, also journalists, and two half-sisters. One sister, Sarah, was best known as the mystery writer Sarah Caudwell. The other sister, Claudia, was a disability activist and married Michael Flanders, half of the well-known performance double-act Flanders and Swann; the two children of this marriage are the journalists Laura Flanders and Stephanie Flanders, his half-nieces."]}, {"page": "Claud Cockburn", "response": ["His granddaughters include RadioNation host Laura Flanders, ex-BBC Economics editor Stephanie Flanders, and actress Olivia Wilde.Charles Mosley, editor, Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes (Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003), volume 1, page 120"]}, {"page": "Institute for Fiscal Studies", "response": ["Notable former members of staff of the IFS include Evan Davis and Stephanie Flanders (BBC journalists), Chris Giles (Financial Times Economics Editor), Tom Clark (Guardian columnist), Steve Webb (Liberal Democrat Pensions Minister) and Rupert Harrison (Chief of Staff to former Chancellor George Osborne)."]}, {"page": "List of Balliol College, Oxford people", "response": ["* Stephanie Flanders"]}, {"page": "Laura Flanders", "response": ["Laura Flanders (born 5 December 1961) is an English broadcast journalist living in the United States who presents the weekly, long-form interview show The Laura Flanders Show. Flanders has described herself as a \"lefty person\". The brothers Alexander, Andrew and Patrick Cockburn—all journalists—are her half uncles. Author Lydia Davis is her half-aunt. Her sister is Stephanie Flanders, a former BBC journalist. Actress Olivia Wilde is her cousin."]}, {"page": "Bob Friend (newscaster)", "response": ["The University of Kent's Centre for Journalism has had for many years, since 2009, the Sky News Bob Friend Memorial Scholar. Several previous scholars now work from KM News, Daily Mail Newspaper and Sky News. The annual scholarship of 2013 was presented to Georgia Fry by Neil Dunwoodie, Executive Producer Sky News, at the 2013 Bob Friend Memorial Lecture (by Stephanie Flanders BBC Economics editor ) at the Pilkington Lecture Theatre at the University of Kent's Medway Campus in Chatham."]}, {"page": "St Paul's Girls' School", "response": ["* Stephanie Flanders – BBC Economics editor"]}, {"page": "The Andrew Marr Show", "response": ["Guest presenters included: Zeinab Badawi, Sophie Raworth, Fiona Bruce, Stephanie Flanders, Huw Edwards, Martha Kearney, Emily Maitlis, James Landale and Jeremy Vine."]}, {"page": "Robert Peston", "response": ["On 17 October 2013, Peston was appointed Economics Editor of BBC News, replacing Stephanie Flanders who was appointed as Chief Market Strategist at JP Morgan Asset Management. He continued as Business Editor, as well until his replacement Kamal Ahmed took over the post on 24 March 2014."]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Stephanie Flanders – joined the BBC in 2002 as a presenter and reporter on NewsnightNewsnight and Panorama, and also as an occasional relief newsreader on other main news bulletins. She became the Corporation's Economics Editor in 2008, remaining in this role until 2013. She is the daughter of the singer and performer Michael Flanders, of Flanders and Swann fame."]}, {"page": "Sarah Caudwell", "response": ["Caudwell's three half-brothers Alexander Cockburn, Andrew Cockburn, and Patrick Cockburn are journalists. She was the half-sister-in-law of Leslie Cockburn and Michael Flanders. Journalists Laura Flanders and Stephanie Flanders, and actress Olivia Wilde are her half-nieces."]}, {"page": "Category talk:British journalists", "response": ["Stephanie Flandersnot yet classified"]}, {"page": "Leslie Cockburn", "response": ["Cockburn had two brothers-in-law, the late Alexander Cockburn and Patrick Cockburn, and the mystery writer Sarah Caudwell was her half-sister in law. Her former son-in-law is Tao Ruspoli. Journalists Laura Flanders and Stephanie Flanders are her half-nieces by marriage, daughters of her half-brother in law Michael Flanders. Her parents-in-law were Claud and Patricia Cockburn. She has four grandchildren."]}, {"page": "Hugh Pym", "response": ["Pym began his career in radio at Viking Radio in Hull, and was a BBC Radio journalist from 1986 to 1987. He was the producer of Business Daily at Channel 4 from 1987 to 1988, a correspondent with ITN from 1988 to 1998, and a freelance broadcaster with Sky Television from 1999 to 2000. He rejoined the BBC in 2001 after a spell of work at Sky News. He was a BBC special correspondent covering economics until 2008, when he took on the role of acting economics editor during the maternity leave of Stephanie Flanders. Following her return, he became the BBC's chief economics correspondent, a newly created role. When she left the BBC in late 2013 he took over again as acting editor. In March 2014 he was appointed as health editor."]}, {"page": "Claudia Cockburn", "response": ["She died in London on 25 June 1998, aged 65. Her daughters are the journalists Laura and Stephanie Flanders."]}, {"page": "1968 in British television", "response": ["* 5 August – Stephanie Flanders, broadcast journalist"]}, {"page": "List of University of Oxford people with PPE degrees", "response": ["* Stephanie Flanders, BBC economics editor"]}, {"page": "2010 United Kingdom general election debates", "response": ["| Stephanie Flanders"]}, {"page": "2007 in British radio", "response": ["*30 June – Journalist Stephanie Flanders presents an edition of BBC Radio 4's Archive Hour about her father's career, titled Flanders on Flanders."]}, {"page": "List of honorary graduates of the University of Leeds", "response": ["* Stephanie Flanders (DLitt)"]}, {"page": "Society of Professional Economists", "response": ["Recent annual conferences have featured Ben Broadbent, Sir Charles Bean, Robert Chote, Gavyn Davies, Dame DeAnne Julius, Professor Diane Coyle, Evan Davies, Stephanie Flanders, Professor Philip Lane and Sir Dave Ramsden."]}, {"page": "Kennedy Scholarship", "response": ["*Stephanie Flanders – former Kennedy Scholar, head of Bloomberg Economics.", "*Stephanie Flanders – former Economics Editor, BBC"]}]}}