{"wiki_id": "http://www.wikidata.org/entity/Q7609156", "itemLabel": "Stephen Evans", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Evans_(diplomat)", "wikipedia_page": {"main": "Stephen Evans CMG OBE (born 29 June 1950) is a British diplomat who has been on secondment since 2011 as NATO Assistant Secretary General for Operations.\n\n", "link_mentions": [{"page": "Steve Evans", "response": ["Steve, Steven or Stephen Evans may refer to:", "* Stephen Evans (rower) (born 1962), Australian rower", "* Stephen Evans (footballer) (born 1980), Welsh footballer with Carmarthen Town", "* C. Stephen Evans (born 1948), American philosopher", "* Stephen Evans (scientist) (born before c.1950), British pharmacoepidemiologist and medical statistician", "* Stephen Evans (diplomat) (born 1950), British High Commissioner to Bangladesh", "* Stephen Evans (journalist) (born c. 1955), BBC correspondent", "* Stephen Evans (actor) (born 1970), British actor and writer"]}, {"page": "Directorate General of Forces Intelligence", "response": ["* According to several leading British newspapers, United Kingdom's Home Secretary Jacqui Smith, several high-level MI5 and MI6 officials flew to Dhaka for meeting with senior officials of Directorate General of Forces Intelligence. She urged that DGFI investigate a number of British nationals whom the British security agencies found to be suspicious. As a result, A number of British suspects were taken to DGFI's secret interrogation centre, known as the Task Force for Interrogation cell (TFI). The British High Commission, Dhaka has rejected the allegations, stating that our security cooperation with other countries is consistent with our laws and with our values. High Commissioner Stephen Evans acknowledged that British and Bangladeshi intelligence agencies cooperated in certain areas, which includes sharing of information which may be relevant to the security of either country."]}, {"page": "List of aviation accidents and incidents in the war in Afghanistan", "response": ["* 15px|RAF Roundel May 24: A Special Forces RAF Hercules, caught fire after setting down at a landing strip outside the town of Lashkar Gah in Helmand Province. The plane was carrying the new British ambassador, in Afghanistan, Stephen Evans. No casualties were reported."]}, {"page": "Anwar Choudhury", "response": ["Choudhury was promoted through the Ministry of Defence until 2000, when he was recruited by the Cabinet Office, before being headhunted for the position of High Commissioner to Bangladesh. He was succeeded in 2008 by Stephen Evans. When he was appointed as High Commissioner to Bangladesh in 2004, he became one of the first two British ambassadors from ethnic minority backgrounds to be appointed in modern times (the other being Alp Mehmet, who was appointed Ambassador to Iceland). He was sworn in as Governor of the Cayman Islands on 26 March 2018."]}, {"page": "List of people with surname Evans", "response": ["*C. Stephen Evans (born 1948), American historian and philosopher", "*Stephen Evans (disambiguation), multiple people", "**C. Stephen Evans (born 1948), American historian and philosopher", "**Stephen Evans (diplomat) (born 1950), British High Commissioner to Bangladesh", "**Stephen Evans (journalist), BBC correspondent in Berlin and Seoul", "**Stephen Evans (rower) (born 1962), who represented Australia at the 1984 Summer Olympics", "**Stephen Evans (actor) (born 1970), British actor and writer", "**Stephen Evans (footballer) (born 1980), Welsh footballer with Llanelli"]}, {"page": "List of accidents and incidents involving the Lockheed C-130 Hercules", "response": ["*May 24, 2006: Hercules C.1 XV206 of the RAF (47 Squadron Special Forces Flight) was carrying the new British ambassador in Afghanistan, Stephen Evans when it crash landed at a dirt landing strip outside the town of Lashkar Gar in Helmand Province, Afghanistan after hitting a landmine on roll-out which holed the port external fuel tank and set the number two (port inner) engine on fire. All nine crew and 26 passengers aboard safely evacuated, but the airframe burned out. It was later revealed that the Hercules was carrying a large number of SAS troops as well as a large amount of cash described as being one million dollars in some sources, and as \"more than one million pounds\" by others, while the MoD only admitted to a \"sizeable amount of cash\". The money was apparently destined for local warlords in exchange for their influence and intelligence."]}, {"page": "List of High Commissioners of the United Kingdom to Bangladesh", "response": ["*2008–2011: Stephen Evans"]}, {"page": "List of ambassadors of the United Kingdom to Afghanistan", "response": ["* 2001–2002: Stephen Evans (chargé d'affaires)Spotlight falls on Afghan expert, The Guardian, London, 20 November 2001", "* 2006–2007: Stephen Evans"]}, {"page": "Stephen Evans (UK ambassador)", "response": ["#REDIRECT Stephen Evans (diplomat)"]}, {"page": "List of High Commissioners of the United Kingdom to Sri Lanka", "response": ["* 2002–2006: Stephen Evans "]}]}}