{"wiki_id": "http://www.wikidata.org/entity/Q7609462", "itemLabel": "Stephen Hendrie", "itemDescription": "Scottish footballer (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Hendrie", "wikipedia_page": {"main": "Stephen Hendrie (born 8 January 1995) is a Scottish professional footballer who plays as a left back and central defender for Partick Thistle.\nHe began his career with Hamilton Academical, making over 100 appearances for the club before moving to West Ham United in July 2015. He moved on loan to Southend United in January 2016. After a loan spell with Blackburn Rovers during the 2016–17 season, Hendrie returned to Southend on a permanent basis in June 2017. He spent time on loan with Motherwell in 2018, and after his release from Southend he signed for Kilmarnock in September 2019. After a season with Morecambe, Hendrie signed for Partick Thistle in September 2021.\nHendrie is a Scotland youth international and has played at under-21 level.", "link_mentions": [{"page": "Hendrie", "response": ["*Stephen Hendrie (born 1995), Scottish footballer"]}, {"page": "1995 in the United Kingdom", "response": ["** Stephen Hendrie, footballer"]}, {"page": "List of Hamilton Academical F.C. players", "response": ["|Stephen Hendrie||||2011–2015||100||0||"]}, {"page": "2011–12 Hamilton Academical F.C. season", "response": ["||| DF|| Stephen Hendrie"]}, {"page": "Steven Hendrie", "response": ["#REDIRECT Stephen Hendrie"]}, {"page": "2012 Scottish Challenge Cup Final", "response": ["|DF||13|| Stephen Hendrie || || "]}, {"page": "2012–13 Hamilton Academical F.C. season", "response": ["||| DF|| Stephen Hendrie"]}, {"page": "2012–13 Bolton Wanderers F.C. season", "response": ["Bolton began their pre-season games at Ayr United where they drew 1–1, Marcos Alonso scoring midway through the second half before Mark Roberts equalised for the home side. Three days later, Bolton travelled to Hamilton Academical where, after a quiet first half, Hamilton won the game with two quick goals through Andy Ryan and Stephen Hendrie. Bolton completed their Scottish tour with a trip to Falkirk four days later. Falkirk striker Lyle Taylor scored after just fifteen seconds, lobbing Ádám Bogdán, with Chris Eagles equalising 14 minutes later. The game finished as a draw, meaning that Bolton finished their time in Scotland without a win."]}, {"page": "2014–15 Hamilton Academical F.C. season", "response": ["| 3|||| DF|| Stephen Hendrie"]}, {"page": "2015–16 West Ham United F.C. season", "response": ["* 30 January 2015: Stephen Hendrie of Hamilton Academical signs a pre-contract agreement to join West Ham on 1 July 2015.", "| Stephen Hendrie", "| 1 July 2015 || LB ||  || Stephen Hendrie || Hamilton Academical || Undisclosed ||"]}, {"page": "2015–16 Hamilton Academical F.C. season", "response": ["|  Stephen Hendrie"]}]}}