{"wiki_id": "http://www.wikidata.org/entity/Q7607427", "itemLabel": "William Herbert, 18th Earl of Pembroke", "itemDescription": "English peer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Herbert,_18th_Earl_of_Pembroke", "wikipedia_page": {"main": "William Alexander Sidney Herbert, 18th Earl of Pembroke, 15th Earl of Montgomery (born 18 May 1978) is an English peer. He became earl in 2003 following the death of his father, Henry Herbert, 17th Earl of Pembroke.", "link_mentions": [{"page": "Earl of Pembroke", "response": [", the current holder of the earldom is William Herbert, 18th Earl of Pembroke, which is the 10th creation of the title. For the past 400 years, his family's seat has been Wilton House, Wiltshire. The Earls of Pembroke also hold the title Earl of Montgomery, created for the younger son of Henry Herbert, 2nd Earl of Pembroke before he succeeded as the 4th Earl in 1630. The current Earls of Pembroke also carry the subsidiary titles: Baron Herbert of Cardiff, of Cardiff in the County of Glamorgan (1551), Baron Herbert of Shurland, of Shurland in the Isle of Sheppey in the County of Kent (1605), and Baron Herbert of Lea, of Lea in the County of Wilts (1861). All are in the Peerage of England except the Barony of Herbert of Lea, which is in the Peerage of the United Kingdom.", ", the current earl is William Herbert, 18th Earl of Pembroke, who became earl of Pembroke and 15th of Montgomery on the death of his father in 2003."]}, {"page": "Wilton House", "response": ["As of 2012, the current earl, William Herbert, 18th Earl of Pembroke, and his family live in the house.Herbert, William. \"Welcome to Wilton House\" , Wilton House, accessed 24 May 2012Blake, Morwenna. \"Baby girl for Lord and Lady Pembroke\", Salisbury Journal, 5 April 2011, accessed 24 May 2012 In 2006, Herbert told The New York Times Magazine that the Wilton estate has around 140 employees. Its 14,000 acres are divided into 14 farms, one of which is run by the estate (the others are rented to tenants) and more than 200 residential properties. Although the house is open to the public, Herbert and his wife occupy about a third of the house privately.Lewine, Edward. \"Lord of the Manor\", The New York Times Magazine, 19 November 2006 Salisbury Racecourse and South Wilts Golf Course are also on the 14,000 acre estate."]}, {"page": "List of earls in the peerages of Britain and Ireland", "response": ["|4.||The Earl of Pembroke||(1551)||25px||William Herbert, 18th Earl of Pembroke||Also Earl of Montgomery (E 1605) - see below"]}, {"page": "Earl of Carnarvon", "response": ["Until the birth of the Reginald Henry Michael, Lord Herbert to William Herbert, 18th Earl of Pembroke, on 21 October 2012, the 8th Earl of Carnarvon was the heir presumptive to the earldom of Pembroke and the earldom of Montgomery. The 8th Earl is third-in-line to those titles."]}, {"page": "Old Bryanstonians", "response": ["* William Herbert, 18th Earl of Pembroke politician and aristocrat"]}, {"page": "William Herbert", "response": ["*William Herbert, 18th Earl of Pembroke (born 1978)"]}]}}