{"wiki_id": "http://www.wikidata.org/entity/Q7609971", "itemLabel": "Stephen McNeff", "itemDescription": "Northern Irish composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_McNeff", "wikipedia_page": {"main": "Stephen McNeff (born 6 September 1951) is a British composer.", "link_mentions": [{"page": "Seattle Cascades Drum and Bugle Corps", "response": ["|2006 ||Redemption || Ghosts by Stephen McNeff / Second String Quartet by Béla Bartók / Dance Movement No. 1 by Russ Newbury / Lux Arumque by Eric Whitacre / Ra! by David Dzubay ||75.525 ||19th"]}, {"page": "Clockwork (novel)", "response": ["A version with music by Stephen McNeff and libretto by David Wood toured the United Kingdom before playing in the Linbury Studio Theatre at London's Royal Opera House in March 2004. The production's orchestra was formed from musicians from the Philharmonia Orchestra and Martin Music Scholarship Fund Award Scheme."]}, {"page": "Hotch Potch House", "response": ["* Stephen McNeff  "]}, {"page": "2007 in British music", "response": ["*Stage works – Stephen McNeff: Tarka the Otter"]}, {"page": "London Concert Choir", "response": ["Performances with the Counterpoint ensemble include Handel's Messiah, Bach's St Matthew Passion and Christmas Oratorio, Monteverdi's Vespers of 1610 and Schubert's rarely-heard Mass in E flat. Operas in concert performance have ranged from Gluck's Orfeo to the London premiere of The Chalk Legend by Stephen McNeff. LCC has also performed Ellington's Sacred Concert, Will Todd’s Mass in Blue and a concert to mark Leonard Bernstein’s centenary."]}, {"page": "Richard Williams (theatre director)", "response": ["His association with composer Stephen McNeff goes back to about 1978, when Williams directed Aucassin et Nicolette with McNeff's music for the latter's South-West Music Theatre;C. Causley and S. McNeff, The Ballad of Aucassin and Nicolette: A Play in Three Acts (Kestrel Books, 1981). See L. Green, All Cornwall Thunders at My Door: A Biography of Charles Causley (The Cornovia Press, Sheffield 2013), p. 163. during McNeff's residency at the Banff Centre in Canada Williams directed a production of Brecht's The Threepenny Opera there in 1981.'1981 opera programme', Banff Centre for Arts and Creativity. Williams's work as librettist includes texts for McNeff's community opera adaptation of Tarka the Otter (2007) and his opera-oratorio The Chalk Legend (2012).McNeff worklist in issuu website.", "He is currently (2020) Course Leader of the BA Acting at Drama Centre London,'Richard Williams', at Central Saint Martins website. and remains associated with Dartington.See short biographical notice in Dartington August 2018 blurb for Oh! What a Lovely War. Williams' recent work includes directing the British premiere of Vivaldi’s opera L'Olimpiade at the Bath International Music Festival,'Opening Night Gala Opera', Bath Abbey website. also presented at the Eilat Festival. His work with Nova Music Opera under George Vass includes stage direction of several contemporary operas, including Stephen McNeff's Prometheus Drown'd (2014, to Williams's libretto),P. Reed, 'Nova Music Opera double-bill,' Classical Source 29 July 2014. Charlotte Bray and Amy Rosenthal's Entanglement (2015),'UK Tour, 2015', Nova Music - Opera. and Joseph Phibbs and Laurie Slade's Juliana (2018).A. Clements, 'Juliana review - Miss Julie reworking makes for a convincing, effective new opera', The Guardian, 17 July 2018."]}, {"page": "Rocc (opera stage director)", "response": ["* 2020 Stephen McNeff: Beyond the Garden (world premiere), Slovenian Chamber Music Theatre, operapovera and Cankar Centre (Štih Hall)"]}, {"page": "McNeff, Stephen", "response": ["#redirectStephen McNeff"]}, {"page": "List of people with given name Stephen", "response": ["* Stephen McNeff (born 1951), British composer"]}]}}