{"wiki_id": "http://www.wikidata.org/entity/Q7609892", "itemLabel": "Stephen Marchant", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Marchant_(actor)", "wikipedia_page": {"main": "Stephen Marchant is an English actor known for being the first actor to play Terence Turner on ITV's Emmerdale in 1985. Nick Brimble took over the role in 2006. Stephen Marchant is an actor, known for The Tall Guy (1989),  The Bill (1984) and Emmerdale (1972, 1985).\nStephen attended Buckhurst Hill County High School (Boys Grammar School) in Essex 1971–1978 where he showed himself to be a keen and able actor, participating in many school plays.", "link_mentions": [{"page": "Marchant", "response": ["* Stephen Marchant (1912–2003), Australian geologist and amateur ornithologist", "* Stephen Marchant (actor), Irish actor"]}, {"page": "Stephen Marchant", "response": ["Stephen Marchant, AM (1912 – August 2003) was born in Staffordshire, studied geology at Gonville and Caius College, Cambridge, and worked in the oil exploration business in many countries, using the opportunities arising from his postings to study birdlife around the world. He wrote classic papers on the birds of the Red Sea, Nigeria, the Gold Coast, Indonesia, Borneo, Ecuador and Iraq. In 1963 he migrated to Australia where he joined the Bureau of Mineral Resources in Canberra.", "Marchant was born in Weston-under-Lizard, a village in the English county of Staffordshire.Davies, Stephen. (2004). Obituary: Stephen Marchant, 1912-2003. Emu 104: 89-90. In Australia, Marchant was immediately involved in organised ornithology through the Royal Australasian Ornithologists Union (RAOU) where he was a strong force for what he perceived to be necessary reform.  Here he was instrumental in founding the ACT Group of the RAOU, which later became the Canberra Ornithologists Group (COG).  He also initiated the RAOU Nest Record Scheme and was a founding member of the RAOU Field Investigations Committee.  As part of a reformist makeover of the RAOU, in order to strengthen its scientific rigor and ornithological credibility, in 1968 he became Editor of the RAOU's journal the Emu, which he transformed into an internationally respected scientific journal.", "For most of his later years from 1975, he lived at Moruya in the Eurobodalla Shire of the NSW South Coast. Here, he continued to be active in natural history, helping found the Eurobodalla Natural History Society in 1986, serving as its President as well as editor of its journal Nature in Eurobodalla. Stephen Marchant's earlier ornithological work resulted in the award of the British Ornithologists' Union Medal in 1971 and, later, his election as a Corresponding Fellow of the American Ornithologists' Union. Appreciation for his service to the RAOU led to him being elected a Fellow of the RAOU in 1975.  His contribution to Australian ornithology was recognised by his being made an Honorary Member in the General Division of the Order of Australia (AM) in 1994, and by being awarded the RAOU's John Hobbs Medal in 1997. Marchant died in August 2003, at a nursing home between the New South Wales towns of Moruya and Narooma.", "*Anon. (1975). RAOU Fellow: Citation. Stephen Marchant. Emu 75: 244.", "*Davies, Stephen. (2004). Obituary. Stephen Marchant, 1912–2003. Emu 104: 89–90.", "*Higgins, Peter. (1994). RAOU People. Stephen Marchant. Wingspan 16: 6–7."]}, {"page": "List of former Emmerdale characters", "response": ["|Stephen Marchant"]}]}}