{"wiki_id": "http://www.wikidata.org/entity/Q7608681", "itemLabel": "Stephen Bayley", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Bayley", "wikipedia_page": {"main": "Stephen Paul Bayley  (born 13 October 1951) is a British writer and critic, known particularly for his commentary on architecture and design. He was founding CEO of the Design Museum in London in 1989, and has been a regular architecture, art and design critic for newspapers such as The Listener, The Observer and The Spectator.", "link_mentions": [{"page": "October 13", "response": ["*1951 – Stephen Bayley, Welsh journalist, author, and critic"]}, {"page": "Millennium Dome", "response": ["*10 January 1998: Creative director Stephen Bayley quits the project. He is said to have been at \"loggerheads\" with Peter Mandelson as to who was in charge with the project.The Times, 10 January 1998"]}, {"page": "Liverpool Metropolitan Cathedral", "response": ["The present Cathedral was designed by Sir Frederick Gibberd (1908–84). Construction began in October 1962 and less than five years later, on the Feast of Pentecost 14 May 1967, the completed cathedral was consecrated. Soon after its opening, it began to exhibit architectural flaws. This led the cathedral authorities to sue Frederick Gibberd for £1.3 million on five counts, the two most serious being leaks in the aluminium roof and defects in the mosaic tiles, which had begun to come away from the concrete ribs. The design has been described by Stephen Bayley as \"a thin and brittle take on an Oscar Niemeyer original in Brasilia,\" though Pevsner notes that the resemblance is only superficial."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Stephen Bayley", "|Stephen Bayley"]}, {"page": "Liverpool Institute for Performing Arts", "response": ["*2002: Stephen Bayley; Anthony Field; Thelma Holt; Tony Wilson"]}, {"page": "Design Museum", "response": ["The museum was founded in 1989 by Sir Terence Conran, with Stephen Bayley was inaugural CEO, after the two men had collaboratively created the highly successful exhibition space known as The Boilerhouse at the Victoria and Albert Museum (V&A)."]}, {"page": "Quinlan Terry", "response": ["Conversely, Terry has been the subject of considerable criticism. A 2015 article in the Royal Institute of British Architects (RIBA) Journal quoted the late architectural historian Gavin Stamp, author of the Piloti column in the magazine Private Eye, in which Stamp derided Terry's work as \"stiff, pedantic and uninspiring, classical details stuck on to dull boxes\". The cultural critic Jonathan Meades, in a 2020 article in The Critic, repeated Stamp's strictures and dismissed Scruton's praise, \"[a man] who had no eye\", as \"embarrassingly silly\"; while Stephen Bayley is among those who have attacked the close relationship between Terry and the Prince of Wales. In a column in The Guardian in 2009, Bayley mocked the Prince's circle of architectural advisers as, \"a coterie of fogeyish misfits, dreamers, forelock-tugging courtiers, DIY specialists, greasy pole-climbers [and] short-sighted antiquarians\", reserving particular scorn for Terry, \"a specialist in architectural pastiche [whose] modesty and art are in inverse proportion\"."]}, {"page": "Calderstones School", "response": ["*Stephen Bayley, architecture writer and Chief executive of the Design Museum from 1986 to 1989"]}, {"page": "Piet Mondrian", "response": ["Mondrian's work had an enormous influence on 20th century art, influencing not only the course of abstract painting and numerous major styles and art movements (e.g. Color Field painting, Abstract Expressionism and Minimalism), but also fields outside the domain of painting, such as design, architecture and fashion. Design historian Stephen Bayley said: \"Mondrian has come to mean Modernism. His name and his work sum up the High Modernist ideal. I don't like the word 'iconic', so let's say that he's become totemic – a totem for everything Modernism set out to be.\""]}, {"page": "Pimlico Academy", "response": ["In the face of opposition from the Twentieth Century Society,C20 complains of conservation area exclusion for Pimlico School, Architects' Journal, 29 Nov, 2005 and that of prominent architects and critics including Richard Rogers, RIBA president Sunand Prasad, Stephen Bayley,Westminster council votes to demolish Pimlico School, by Will Hurst, Building, 14 Dec 2007 and John McAslan,McAslan in effort to save Pimlico School, Architects' Journal, 30 Nov, 2005  the last remaining part of the old building was demolished in summer 2010.Description of new building on school website "]}, {"page": "Ray-Ban Wayfarer", "response": ["Wayfarers were designed in 1952 by American optical designer Raymond Stegeman,Stegeman, Raymond F. E. Front for Spectacle Frames. US Patent #169,995. who worked for Bausch & Lomb, Ray-Ban's parent company at that time.Google patent search for Raymond Stegeman. 70 of 72 patents issued to Stegeman were assigned to Bausch and Lomb. The design was inspired by, \"a mid-century classic to rival Eames chairs and Cadillac tail fins.\"Bayley, Stephen. \"Notes & Theories: Through a Pair of Glasses Darkly.\" The Independent on Sunday (June 18, 2006). According to design critic Stephen Bayley, the \"distinctive trapezoidal frame spoke a non-verbal language that hinted at unstable dangerousness, but one nicely tempered by the sturdy arms which, according to the advertising, gave the frames a 'masculine look'.\" The sunglasses also featured a new plastic molding technology.Delap, Leanne. \"I wear my sunglasses at night\". The Globe and Mail (July 12, 2008)."]}, {"page": "List of Room 101 episodes", "response": ["|Ken Livingstone • Builders who make fun of her accent • BBC Radio 1 DJs • Stephen Bayley and other design gurus • Cockney culture"]}, {"page": "Bayley (surname)", "response": ["* Stephen Bayley (born 1951), British design critic, cultural critic, journalist and author."]}, {"page": "Category talk:British journalists", "response": ["Stephen Bayleynot yet classified"]}, {"page": "Erotic Review", "response": ["*Stephen Bayley"]}, {"page": "Wolff Olins", "response": ["Some of Wolff Olins' work has received controversial reception. Its piper design for BT in 1991 attracted a great deal of opposition. The company was also responsible for the short-lived $110m (£75m) re-branding of PwC Consulting to Monday in 2002. The launch of the London 2012 brand in 2007 was met with widespread public derision. Design critic Stephen Bayley condemned the London 2012 Olympic Games logo as \"a puerile mess, an artistic flop and a commercial scandal\".Olympic chiefs under fire for 'puerile' logo, The Telegraph, June 4, 2007."]}, {"page": "Bayley, Stephen", "response": ["#REDIRECT Stephen Bayley"]}, {"page": "London Film and Comic Con", "response": ["| 29–31 July 2016|| Olympia|| Carl Weathers, Dolph Lundgren, Elden Henson, Famke Janssen, Ian McDiarmid, Jack Gleeson, Michelle Gomez, Jeremy Renner, Mads Mikkelsen, Michael Emerson, Aaron Stanford, Adam Copeland, Alan Austen, Alan Tompkins, Amir Arison, Anton Lesser, Blake Foster, Bonnie Langford, Catherine Sutherland, Caroline Blakiston, Colin Baker, Colt Cabana, Daniel Portman, Dave Prowse, David Field, Dixie Arnold, Dominic Monaghan, Donald Sumpter, Ellie Kendrick, Faye Marsay, Frazer Diamond, Frazer Hines, Gail Kim, Gary Kurtz, Gemma Whelan, Jim Duggan, Harold Perrineau, Hattie Hayridge, Hardcore Holly, Jamie Harris, Jamie Kennedy, Jason David Frank, Jasper Jacob, Jeremy Bulloch, Joe Naufahu, John Galvin, Johnny Yong Bosch, Jon Heder, Judge Reinhold, Julian Sands, Kae Alexander, Keith David, Kenny Baker, Kim Coates, Kjell Nilsson, Kristian Nairn, Laurie Holden, Mike Havord, Mike Stevens, Millie Bobby Brown, Nakia Burrise, Natalia Tena, Neil Kaplan, Paul McGann, Peter Mayhew, Pip Torrens, Quentine Pierre, Rex Smith, Richard Brake, Roberta Tovey, Rob Van Dam, Rutger Hauer, Sam Coleman, Sean Maher, Stephen Bayley, Steven Berkoff, Sylvester McCoy, Ted DiBiase, Tobin Bell, Vic Armstrong, Warwick Diamond, Wendy Leech"]}, {"page": "Jennie Page", "response": ["Page was headhunted for the job by the then Heritage Secretary, Stephen Dorrell, according to The Observer. Page had previously worked for the London Docklands Development Corporation and had a reputation for a hardheaded style of management. Cracks developing behind the scenes began to show in January 1998 when Stephen Bayley, creative director of the project, resigned. He described Government Minister Peter Mandelson, whose project it had become, as a dictator reminiscent of: \"an East German Stalinist\"."]}, {"page": "David Sweetman", "response": ["He subsequently became a television documentary director and producer, collaborating with Roderick Gradidge for a series on architecture, with Stephen Bayley for a series on design, and with Anton Dolin and Wayne Sleep for a series on the ballet. Sweetman's documentary reports were also broadcast on Omnibus."]}, {"page": "Bob Bob Ricard", "response": ["Stephen Bayley, a British design critic and author, writing in The Observer in January 2009 has described Bob Bob Ricard's interior as \"foreign and weird\", \"fastidiously executed to the wrong plan\" and \"a bizarre combination of Norman Rockwell-style American diner with banquettes, plus terrazzo, perhaps from a Cannes fish restaurant, antiqued mirror ceiling, real as well as metaphorical brass\" destined for \"the trashcan of history\". In the same month Bob Bob Ricard was pronounced winner of Wallpaper 2009 Global Design Awards, while in September Time Out Magazine's Eating & Drinking Awards 2009 picked BBR as winner for Best New Design, citing that \"working within a loose theme of Orient Express meets American diner, (David) Collins has brought polish and professionalism to this Soho restaurant, with exquisite finishes, intimate booth seating, marble table tops, theatrical drapes, wooden panelling, brass rails and an inlaid floor\". In 2009 the Restaurant & Bar Design Awards awarded Bob Bob Ricard winner of the Identity category."]}, {"page": "The Society for Curious Thought", "response": ["The Society for Curious Thought was founded by the writer Simon Marriott who was also the director until his death on 12 June 2015. Notable contributors include Stephen Bayley, Steven Berkoff and Aung San Suu Kyi"]}, {"page": "Metaphor (designers)", "response": ["In 2007, Metaphor designed the Surreal Things exhibition at the V & A, experimenting with different modes of display and interpretation to create a powerful, theatrical experience. Stephen Bayley, writing for The Observer called it \"comprehensive, fascinating, engaging and instructive\".... Stephen Bayley, The Guardian, March 2007... [Rachel Campbell-Johnston], writing for [The Times], said 'the psychological mood starts to possess you'.... Rachel Campbell-Johnston, The Times, March 2007..."]}, {"page": "London Society (organisation)", "response": ["Society events include member visits to places of interest, keynote lectures (including the annual Banister Fletcher Lecture), debates and social events. These are intended to bring together those with a particular interest in the city, whatever their age or interests. Recent speakers have included Stephen Bayley, Rowan Moore and Robert Peston."]}, {"page": "Joel Kissin", "response": ["Stephen Bayley, the esteemed author, critic, columnist, consultant, broadcaster, debater and curator concludes his experience with \"there's nowhere in the area I would rather eat.”"]}]}}