{"wiki_id": "http://www.wikidata.org/entity/Q7608744", "itemLabel": "Stephen Botfield", "itemDescription": "tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Botfield", "wikipedia_page": {"main": "Stephen Botfield (born 10 April 1966) is a former professional tennis player from England who competed for Great Britain.", "link_mentions": [{"page": "Steven Botfield", "response": ["#REDIRECT Stephen Botfield"]}, {"page": "Mike Walker (tennis)", "response": ["Walker, who grew up in Colwyn Bay, was given a wild card into the 1986 Wimbledon Championships and lost his opening round match, which went five sets, to Swiss player Claudio Mezzadri.Daily Post, \"Ace Walker quits LTA for top job in N. Wales\", April 25, 2003ATP World Tour Profile He returned to Wimbledon the following year, this time competing in the men's doubles, partnering Stephen Botfield. The pair were beaten in the first round by Glenn Layendecker and Glenn Michibata. He was a member of the Great Britain Davis Cup squad in 1987, although he wasn't called on to play a match. In the 1988 Wimbledon Championships he played mixed doubles with Joy Tacon, but was again unable to reach the second round."]}, {"page": "James Turner (tennis)", "response": ["He however never failed to get past the first round of the men's doubles at Wimbledon, in his four appearances at the tournament. In the 1989 he partnered Stephen Botfield and the pair defeated sixth seeds Paul Annacone and Christo van Rensburg. He also teamed up with Botfield at the 1990 Wimbledon Championships, where they made the round of 16. Their two wins both came in five set matches but when they were knocked out of the draw by Stefan Kruger and Greg Van Emburgh, it was in straight sets."]}, {"page": "1988 ATP Challenger Series", "response": ["| rowspan=\"2\" | Okada Challenger Okada, NigeriaRegular series$50,000 – Hard – 32S/16D Singles Draw - Doubles Draw ||  Jean-Philippe Fleurian 6-3, 7-6 ||  Nduka Odizor || rowspan=\"2\" |  Stephen Botfield   Sadiq Abdullahi || rowspan=\"2\" |  Danny Sapsford   Chris Bailey  Ulli Nganga   Mark Petchey"]}, {"page": "1989 ATP Challenger Series", "response": ["| rowspan=\"2\" | Manchester Open Manchester, Great BritainRegular series$25,000 – Grass – 32S/16D Singles Draw - Doubles Draw ||  Patrick Baur 6-4, 6-7, 7-5 ||  Andrew Castle|| rowspan=\"2\" |  John Letts   Nick Fulwood || rowspan=\"2\" |  Piet Norval  Stephen Botfield  Scott Warner   Gianluca Pozzi"]}, {"page": "Botfield, Stephen", "response": ["#redirectStephen Botfield"]}, {"page": "1984 Wimbledon Championships – Boys' singles", "response": ["  Stephen Botfield (First round)"]}]}}