{"wiki_id": "http://www.wikidata.org/entity/Q7600036", "itemLabel": "Stanley Wells Kemp", "itemDescription": "British marine biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Wells_Kemp", "wikipedia_page": {"main": "Stanley Wells Kemp, FRS (14 June 1882 – 16 May 1945) was an English marine biologist.\nHe was born in London, the second of three sons of Stephen Kemp, a professor at the Royal Academy and Royal School of Music. As a boy he took an interest in animals, collecting water beetles and maintaining them in aquariums and was a member of the local natural history society. He studied at St Paul's School and later went to Trinity College in Dublin from where he graduated with a gold medal in 1903. He studied botany under H. H. Dixon.\nIn 1910 he joined the Zoological and Anthropological section of the Indian Museum and when the organization was converted in 1916 to the Zoological Survey of India, he became Superintendent and took up the study of crustaceans to continue work started by James Wood-Mason and Alfred William Alcock. He spent fourteen years in India during which he published seventeen papers on the decapods in the Indian Museum. In 1918 he made a trip to Baluchistan along with Thomas Nelson Annandale. Other expeditions were made to the Andaman Islands, the Abor Hills, the Garo Hills and Rameshwaram. In 1913 he married Agnes Green, daughter of Reverend William Spotswood Green who was the first to climb Mount Cook in New Zealand. In 1910 he became a Fellow of Calcutta University and a Fellow of the Asiatic Society. In 1924 he returned to Ireland to become the first director of research in the Discovery Investigations.He was Director of the Marine Biological Association from 1936 to 1945.\nAmong the discoveries he made were the first onychophoran from the Indian region which he named as Typhloperipatus williamsoni.He died in Plymouth, Devon in 1945. The National Marine Biological Library at the Marine Biological Association hold some of his scientific and personal papers in the MBA Archive Collection.\nFrogs Philautus kempii and Bufoides kempi are named after him; Philautus kempiae is named after his wife. In 2018, researchers from the Zoological Survey of India have named a new species of crab, Teretamon kempi, discovered from Namdapha, Arunachal Pradesh after him.", "link_mentions": [{"page": "RRS Discovery", "response": ["Stanley Wells Kemp was appointed the project's director of research while Joseph Stenhouse, veteran of the drift of the Aurora, was made captain of Discovery. The ship left Portsmouth in July 1925. The final aspects of the refit and trials had been rushed in order to reach the Southern Ocean before the start of the whaling season in November, which led to a number of faults developing in the ship as she sailed through the Bay of Biscay and she had to put into Dartmouth for repairs and modifications which took two months."]}, {"page": "Indian natural history", "response": ["Several museums were started in India including one at the Asiatic Society in Calcutta. There were also many who worked in the British Museum in London and received specimens collected from India. They made significant contributions by their publications. Edward Blyth (1810–1873) and Nelson Annandale (1876–1924) made great contributions working out of the Asiatic Society while Sir Norman Boyd Kinnear (1882–1957) worked at the BNHS. Other notable museum curators and workers include Alfred William Alcock (1859–1933), John Anderson (1833–1900), George Albert Boulenger (1858–1937), W. L. Distant (1845–1922), Frederic Henry Gravely (1885–?), John Gould (1804–1881), Albert C. L. G. Günther (1830–1914), Frank Finn (1868–1932), Charles McFarlane Inglis (1870–1954), Stanley Wells Kemp (1882–1945), James Wood-Mason (1846–1893), Reginald Innes Pocock (1863–1947), Richard Bowdler Sharpe (1847–1909), Malcolm A. Smith (1875–1958) and Nathaniel Wallich (1786–1854)."]}, {"page": "Plymouth Blitz", "response": ["The Laboratory of the Marine Biological Association on the Hoe was also severely damaged on the evening of 20 March 1941. The bombardment is described in the obituary of Stanley Wells Kemp who was the director of the Association at the time. The seminal work by Alan Lloyd Hodgkin and Andrew Fielding Huxley on the ionic basis of nerve conduction resumed there in June 1947."]}, {"page": "Bufoides kempi", "response": ["Bufoides kempi is a species of true toad, family Bufonidae. This poorly known species is endemic to Meghalaya, Northeast India. It is only known with certainty from its type series (two syntypes) collected \"above Tura\" at  in the Garo Hills no later than 1919; there is also a possible record collected at around 2009. Its common names are Kemp's Asian tree toad, Garo Hills toad, and Garo Hills tree toad. The specific name kempi honours Stanley Wells Kemp, an English zoologist and anthropologist."]}, {"page": "Victoria Medal (geography)", "response": ["*1936: Stanley Wells Kemp"]}, {"page": "Philautus kempii", "response": ["The specific name kempii honours Stanley Wells Kemp, an English zoologist and anthropologist. Common names Kemp's spadefoot toad, Kemp's horned toad, Kemp's bush frog, and Kemp's small treefrog have been coined for it (only the latter two accord with the current placement of this species in Rhacophoridae)."]}, {"page": "Philautus kempiae", "response": ["Philautus kempiae (Tura bubble-nest frog, Kemp's bush frog) is a species of frog in the family Rhacophoridae (not to be confused with Philautus kempii). Being only known from its type locality near Tura in the Garo Hills in Meghalaya, northeastern India, it is an Indian endemic. The specific name kempiae honours Agnes Kemp, wife of Stanley Wells Kemp, an English zoologist and anthropologist. It is known only from the type specimen, so very little is known about biology of this species. It is presumed to be a dweller of the undergrowth of moist evergreen forests."]}, {"page": "Clare Island Survey", "response": ["Nonpublishing participants John Adams (naturalist) (Marine algae); Edward Alexander Newell Arber (Geology); James Bayley Butler (Protozoa); Frederik Børgesen (Marine algae); George W. Chaster (Mollusca); Grenville Cole (Geology), George Fogerty (Archaeology); Thomas Greer (Lepidoptera); David Thomas Gwynne-Vaughan (botany); Arthur William Hill (Botany); John De Witt Hinch (Glacial geology); Stanley Wells Kemp (marine dredging); Matilda Cullen Knowles (lichens, flowering plants, peat deposits); David McArdle (Mosses and hepatics); James Napier Milne (insects); Charles Joseph Patten (birds); Eugène Penard (rhizopods); Walter Mead Rankin (Crustacea and Decapoda); Colin M. Selbie (marine dredging and Crustacea); Otto Stapf (botany); Isaac Swain (geology)"]}, {"page": "Typhloperipatus", "response": ["The species name was after Noel Williamson, a political officer at Sadiya who was murdered in 1911 along with Dr. J.D. Gregorson. The murders led to an expedition in the Abor region by the British government in India. Stanley Wells Kemp, then an assistant superintendent at the Indian Museum at Calcutta was a zoologist attached to this expedition. Three specimens were found on 29 December 1911 near the gorge of the Dihang River near Rotung. Although the nearest known velvet worm species, from Malaya, are typically found in dead wood, these were found mainly under large stones near the roots of trees. Subsequently some more specimens were found at the mouth of the Sireng stream and another specimen was found when the 32nd Sikkim Pioneers were working on the construction of a road between Upper Rotung and Rengin. It is the only South Asian species in the phylum."]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| Stanley Wells Kemp||7 May 1931||14 June 1882 – 16 May 1945"]}, {"page": "Stanley W. Kemp", "response": ["#REDIRECT Stanley Wells Kemp"]}, {"page": "List of fellows of the Royal Society elected in 1931", "response": ["*Stanley Wells Kemp"]}]}}