{"wiki_id": "http://www.wikidata.org/entity/Q7608647", "itemLabel": "Stephen Barber", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Barber_(writer)", "wikipedia_page": {"main": "Stephen Barber is a Professor at Kingston University and a writer on urban culture, experiment in film and Japanese culture. Barber has been a Professor at Kingston University since 2002, and is currently a Research Professor in the Visual and Material Culture Research Centre, Faculty of Art, Design & Architecture. He has previously worked at such institutions as the California Institute of the Arts, University of Tokyo, Berlin University of the Arts, and Sussex University. He has a PhD from the University of London, and has lived in Tokyo, Paris, Berlin, Los Angeles, Vienna and London. He has also collaborated with prominent digital artists, photographers and poets, such as Xavier Ribas and Jeremy Reed.\nBarber has been writing since 1990 and has published twenty books (sixteen non-fiction books and four novels), many of them translated into other languages. He has published a number of books with defunct Creation Books. He is also a frequent contributor to journals, especially 3:AM Magazine, Vertigo and Mute. He has received many awards and prizes for his books, from bodies such as the Rockefeller Foundation (Bellagio Program), Ford Foundation, DAAD, Japan Foundation and Henkel Foundation, He is currently engaged in a research project on the scrapbooks of the moving-image pioneer Eadweard Muybridge, funded by a Leverhulme Trust fellowship.", "link_mentions": [{"page": "3:AM Magazine", "response": ["Authors interviewed several times include Steve Almond, Will Ashon, Stephen Barber, Childish, Andrei Codrescu, Dennis Cooper, Richard Hell, Stewart Home, Tom Bradley, Wu Ming, Michael Moorcock, Dan Rhodes, Nicholas Royle, Iain Sinclair, Scarlett Thomas, Cathi Unsworth, John King, Helen Walsh, Jon Savage, and Simon Critchley. The magazine also interviewed figures in the underground press, such as Lisa Crystal Carver, Lydia Lunch, Mick Farren and Pleasant Gehman. It has carried poetry by Charles Bukowski and featured interviews by Bukowski acolyte Ben Pleasants, including with John Fante and Steve Richmond. Former Kenickie and Brian Jonestown Massacre keyboardist turned novelist Tony O'Neill was a regular contributor and interviewee.", "Tom McCarthy (whom it championed from the outset of his writing career) has written several pieces for 3:AM and appeared at a number of its events. 3:AM Editor Andrew Gallix runs the unofficial Tom McCarthy site 'Surplus Matter' It has reviewed, interviewed and run excerpts of avant-garde writers Lydia Lunch, Stephen Barber and Stewart Home."]}, {"page": "Stephen Barber", "response": ["Stephen Barber (born 1974) is a British political scientist, political economist and author.  He is  Professor of Global Affairs at Regent's University London. He is also a senior fellow at the Global Policy Institute. He has also worked in the European Research Forum and is a former director of MBA. He is a specialist in British public policy and party politics, political economy and having worked in the City of London, the globalisation of financial markets. He holds a BA in government, an MA in contemporary history and a PhD in political science, awarded by several London universities.  He is a Fellow of the Royal Historical Society and Member of the Securities & Investment Institute.  Following the Northern Rock and banking credit crisis in 2008, he outlined his concept of a regulatory cycle of economic behaviour."]}, {"page": "Jeremy Reed (writer)", "response": ["* Caligula: Divine Carnage (2000) (with Stephen Barber)"]}, {"page": "List of alumni of Queen Mary University of London", "response": ["* Stephen Barber – British writer"]}]}}