{"wiki_id": "http://www.wikidata.org/entity/Q7600012", "itemLabel": "Stanley Vickers", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Vickers_(MP)", "wikipedia_page": {"main": "Stanley Vickers (31 October 1837 – 24 February 1872) was an English distiller and  Conservative Party politician who sat in the House of Commons from 1868 to 1872.\nVickers was the son of  John Vickers of Hill House, Streatham Common, and Southwark. He was educated at King's College School. and became a distiller and merchant. He was managing partner and half proprietor of J. and J. Vickers and Co. distillery. He was captain commanding the 5th Kent Artillery Volunteers and was a member of the committee in favour of the Reduction of the Duty on Fire Insurance.At the 1868 general election Vickers was elected as the Member of Parliament (MP) for Wallingford. He held the seat until his death aged 34 in 1872.Vickers married Mary Ianthe Dunbar, daughter of  William Dunbar,  merchant of Aberdeen and London.", "link_mentions": [{"page": "Wallingford (UK Parliament constituency)", "response": ["|Stanley Vickers || Conservative"]}, {"page": "Stanley Vickers", "response": ["Stanley Vickers is the name of:", "*Stanley Vickers (MP) (1837–1872), British member of parliament for Wallingford 1868–1862"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Stanley Vickers; MP for Wallingford (1868–1872)"]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Stanley Vickers"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| Stanley Vickers"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1868 || Wallingford || Sir Charles Wentworth Dilke, Bt. || Stanley Vickers || Bribery, etc. || Duly elected || Seven voters living outside the town were invited to the house of Deacon, an agent of Vickers, who gave them food and drink and took them to vote in his carriage, but there was no corrupt intention. || 1 O'M & H 57; HCP 1869 120 p. 184-189"]}, {"page": "1872 Wallingford by-election", "response": ["The Wallingford by-election of 1872 was fought on 9 March 1872.  The byelection was fought due to the Death of the incumbent MP of the Conservative Party, Stanley Vickers.  It was won by the Conservative candidate Edward Wells, who was unopposed."]}, {"page": "Edward Wells (MP)", "response": ["Wells was elected at a by-election in March 1872 as the Member of Parliament (MP) for Wallingford, filling the vacancy caused the death of the Conservative MP Stanley Vickers.   The election took place in public, and the returning officer reminded voters that with a secret ballot about to be introduced, this was likely to be their last public election."]}]}}