{"wiki_id": "http://www.wikidata.org/entity/Q7609193", "itemLabel": "Stephen Finer", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Finer", "wikipedia_page": {"main": "Stephen Finer is a London-based artist, active since the 1980s.", "link_mentions": [{"page": "List of contemporary artists", "response": ["* Stephen Finer (born 1949), painter"]}, {"page": "Morris Finer", "response": ["Additional information about Finer appears in the Oxford Dictionary of National Biography.   A painting of him by Stephen Finer is in the collection of Pallant House Gallery, Chichester, Sussex."]}, {"page": "The Portrait Now", "response": ["The Portrait Now  was an exhibition of contemporary portraiture held in 1993 to 1994 at the National Portrait Gallery, London. Among many others it included portraits by Michael Andrews, Frank Auerbach,  Francis Bacon, Tony Bevan, Chuck Close, Jim Dine, Peter Edwards, Stephen Finer, Lucian Freud, Richard Hamilton, Howard Hodgkin, David Hockney, Panayiotis Kalorkoti, Jeff Koons, Leon Kossoff, Alice Neel, Nam June Paik,  David Salle, Julian Schnabel and Andy Warhol. It presented a decade of portraiture focusing on the forms of sculpture and painting, however it also included some video pieces."]}, {"page": "Finer", "response": ["* Stephen Finer, artist"]}, {"page": "Painting the Century: 101 Portrait Masterpieces 1900–2000", "response": ["The subjects included Anna Akhmatova by Kuzma Petrov-Vodkin, Charlie Chaplin by Fernand Léger, Edith Sitwell by Pavel Tchelitchew, Leigh Bowery by Lucian Freud, David Bowie and Iman by Stephen Finer, Vladimir Lenin by Isaak Brodsky, a self-portrait by Edvard Munch, Somerset Maugham by Graham Sutherland, Elvis Presley by Andy Warhol, Andy Warhol by Jean-Michel Basquiat, Boy/Girl – the artists children by Marty St. James."]}, {"page": "List of Old Alleynians", "response": ["*Stephen Finer, artist"]}, {"page": "Harry Diamond (photographer)", "response": ["Before becoming a photographer in the 1960s, Harry Diamond worked as a stagehand. He often drank in Soho and photographed many of the artists several times, including Frank Auerbach, Francis Bacon, and Lucian Freud, Stephen Finer, John Wonnacott and others, as well as the photographer John Deakin."]}, {"page": "Finer, Stephen", "response": ["#redirectStephen Finer"]}]}}