{"wiki_id": "http://www.wikidata.org/entity/Q7609077", "itemLabel": "Stephen Dodgson", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Dodgson", "wikipedia_page": {"main": "Stephen Cuthbert Vivian Dodgson (17 March 1924 – 13 April 2013) was a British composer and broadcaster. Dodgson's prolific musical output covered most genres, ranging from opera and large-scale orchestral music to chamber and instrumental music, as well as choral works and song. Three instruments to which he dedicated particular attention were the guitar, harpsichord and recorder. He wrote in a mainly tonal, although sometimes unconventional, idiom. Some of his works use unusual combinations of instruments.", "link_mentions": [{"page": "April 13", "response": ["*2013 – Stephen Dodgson, English composer and educator (b. 1924)"]}, {"page": "Clavichord", "response": ["Much of the musical repertoire written for harpsichord and organ from the period circa 1400–1800 can be played on the clavichord; however, it does not have enough (unamplified) volume to participate in chamber music, with the possible exception of providing accompaniment to a soft baroque flute, recorder, or single singer. J. S. Bach's son Carl Philipp Emanuel Bach was a great proponent of the instrument, and most of his German contemporaries regarded it as a central keyboard instrument, for performing, teaching, composing and practicing. The fretting of a clavichord provides new problems for some repertoire, but scholarship suggests that these problems are not insurmountable in Bach's Well-Tempered Clavier (). Among recent clavichord recordings, those by Christopher Hogwood (The Secret Bach, The Secret Handel, and The Secret Mozart), break new ground. In his liner notes, Hogwood pointed out that these composers would typically have played the clavichord in the privacy of their homes. In England, the composer Herbert Howells (1892–1983) wrote two significant collections of pieces for clavichord (Lambert's Clavichord and Howells' Clavichord), and Stephen Dodgson (1924–2013) wrote two clavichord suites."]}, {"page": "March 17", "response": ["*1924 – Stephen Dodgson, English composer and educator (d. 2013)"]}, {"page": "John Williams (guitarist)", "response": ["Williams' first professional performance was at the Wigmore Hall in London on 6 November 1958. Since then, he has been performing throughout the world and has made regular appearances on radio and TV. He has extended the repertoire by commissioning guitar concertos from composers such as Stephen Dodgson, André Previn, Patrick Gowers, Richard Harvey and Steve Gray. Williams has recorded albums of duets with fellow guitarists Julian Bream and Paco Peña."]}, {"page": "Berkhamsted School", "response": ["*Stephen Dodgson (1924–2013), composer and broadcaster"]}, {"page": "List of 21st-century classical composers", "response": ["|Stephen Dodgson || 1924 || 2013 || British ||  ||"]}, {"page": "Wilfrid Mellers", "response": ["The 2004 York Late Music Festival opened with a weekend tribute to Mellers. A 90th-birthday tribute concert was held in October 2004 at Downing College, featuring music by Mellers as well as new pieces written for the occasion by Stephen Dodgson, David Matthews and Howard Skempton, among others."]}, {"page": "List of compositions for horn", "response": ["*Stephen Dodgson"]}, {"page": "Promenade (disambiguation)", "response": ["*Promenade I, by Stephen Dodgson"]}, {"page": "List of composers for the classical guitar", "response": ["| data-sort-value=\"Dodgson, Stephen\"| Stephen Dodgson || align=center | 1924 || align=center | 2013 || align=center | United Kingdom || || "]}, {"page": "Charles Ramirez", "response": ["In 1971, Charles Ramirez entered the Royal College of Music as a student, where he studied guitar with Patrick Bashford and composition with Stephen Dodgson. Whilst at college, he won the Jack Morrison guitar prize.  He was the first ever guitar student at the Royal College of Music to be invited to play with the full orchestra and he gave his first performance of Rodrigo's Aranjuez Concerto in June 1973.  He became an Associate of the Royal College of Music (ARCM) in April 1974.  Whilst still a student of the college he gave his debut at the Purcell Room."]}, {"page": "Margaret Catchpole", "response": ["Cobbold's book was also adapted into a libretto by Ronald Fletcher which was set to music as the opera \"Margaret Catchpole: Two Worlds Apart\" by British composer Stephen Dodgson in 1979."]}, {"page": "Flute, viola and harp", "response": ["| Stephen Dodgson (1924–2013) || Solway Suite (1974) || Stephen Dodgson Charitable Trust"]}, {"page": "Dodgson", "response": ["*Stephen Dodgson (1924–2013), British composer"]}, {"page": "List of compositions for guitar", "response": ["*1963 Stephen Dodgson (1924-2013) Partita", "*1965 Stephen Dodgson (1924-2013) with Hector Quine 20 Studies", "*1969 Stephen Dodgson (1924-2013) Fantasy-Divisions", "*1976 Stephen Dodgson (1924-2013) Partita No. 2", "*1977 Stephen Dodgson (1924-2013) Legend", "*1978 Stephen Dodgson (1924-2013) Merlin", "*1981 Stephen Dodgson (1924-2013) Partita No. 3", "*1989 Stephen Dodgson (1924-2013) Partita No. 4"]}, {"page": "1988 in British music", "response": ["*Stephen Dodgson – Promenade I for two guitars"]}, {"page": "Wilfred Brown", "response": ["He was also a great friend of the guitarist John Williams and together they recorded an album of music by Benjamin Britten, Stephen Dodgson and John Dowland (released in 1969 on Columbia Odyssey), Songs for Voice and Guitar. and a collection of English folk songs.Belart 461 4892 released 1998 CD"]}, {"page": "World Record Club", "response": ["Once again the series mixed in-house and franchised recordings.Franchised recordings were identified by statements on the labels, e.g. 'A Westminster Recording', etc. See World Record Club 'Recorded Music Circle' (RMC) series publications. It included 'strong' material such as Ralph Kirkpatrick playing the Mozart K570 sonata (CM30); Rudolf Schwarz conducting Mahler's 5th Symphony (LSO - CM 39-40, Everest); Pierre Monteux conducting Berlioz's Romeo and Juliet (CM 57-58, Westminster); Robert Gerle (violin) and Robert Zeller with the Frederick Delius and Samuel Barber violin concerti (CM 59, Westminster), Hermann Scherchen's Mahler 7th Symphony (CM 63-64, Westminster), the Bruckner 8th of Hans Knappertsbusch (CM 71-72, Westminster), and the Richard Strauss memorial album with Clemens Krauss and Kurt List (CM 73-74, Amadeo).These examples are cited direct from World Record Club publications under the Catalogue numbers mentioned in the text above. This small but very interesting series had not reached 100 records by 1966. The pressings and presentation of this series was always good, usually with sleeve-notes by Malcolm Rayment, Stephen Dodgson or Peter GammondThese contributors are named in examples of WRC/RMC records cited direct as World Record Club publications. (now author of numerous musical books). One very famous recording that was released on WRC before any other label was the Finzi Dies natalis with Wilfred Brown."]}, {"page": "Valda Aveling", "response": ["Among the artists with whom she collaborated were Benjamin Britten, Dame Joan Sutherland, Richard Bonynge, Evelyn Rothwell, Luciano Pavarotti, Leontyne Price, Dame Kiri Te Kanawa and Renata Tebaldi.  She played Bach concertos for two, three or four keyboards, with players such as George Malcolm, Simon Preston, Eileen Joyce and Geoffrey Parsons, and conductors such as Yehudi Menuhin.  She gave a number of premieres, such as new works by Stephen Dodgson and Dame Elizabeth Maconchy."]}, {"page": "Evelyn Barbirolli", "response": ["He appointed Evelyn as first oboe in the orchestra. He arranged several works for oboe and orchestra for her, including a concerto by Handel. Several of these are on recordings they made. Ralph Vaughan Williams was particularly pleased with their recording of his Oboe Concerto. Several composers dedicated works to her, including Arnold Cooke, Stephen Dodgson, Arthur Benjamin, Gordon Jacob, Edmund Rubbra and Elizabeth Maconchy."]}, {"page": "Index of World War II articles (S)", "response": ["# Stephen Dodgson"]}, {"page": "Christopher Hyde-Smith", "response": ["Hyde-Smith has played the Cimarosa Concerto for Two Flutes with James Galway at the Royal Festival Hall and as concerto soloist he has frequently appeared with the London Mozart Players and also with the London Symphony Orchestra, Royal Philharmonic Orchestra, Royal Liverpool Philharmonic, BBC Concert Orchestra, Scottish and Welsh Orchestras, Philomusica and Northern Sinfonia. William Alwyn, Stephen Dodgson, Joseph Horowitz, William Mathias, John Metcalf and Alan Rawsthorne have written and dedicated works to him."]}, {"page": "Martin Yates", "response": ["Martin Yates has made over 100 recordings, including (for Dutton Epoch) the world premier recordings of the complete symphonies, ballets and concertos of Richard Arnell, John Joubert's Symphony 2; Symphonies 3 & 4, Sinfonietta 1 & Piano Concerto 2 by Stanley Bate, Thomas Dunhill (Symphony in A), Erik Chisholm (Symphony No. 2), Peter Crossley-Holland (Symphony in D), String Orchestra music by Arnold Bax, Stephen Dodgson and Richard Arnell, Orchestral Songs by John Ireland, Arnold Bax and others, also Piano Concertos (with pianist Victor Sangiorgio) by Stanley Bate, Benjamin Godard and Franz Reizenstein and with pianist Peter Donohoe piano concertos by Malcolm Arnold, Alan Bush and Cyril Scott and with pianist Martin Roscoe the complete piano and orchestra works by Charles-Marie Widor. He has also recorded five Cello Concertos with the celebrated cellist Raphael Wallfisch (Havergal Brian, York Bowen, Alan Bush, John Foulds and Lionel Sainsbury) and premier recordings of Violin Concertos by Richard Arnell and Guirne Creith and also William Walton in its original version and Arthur Bliss with Lorraine MacAslan. He has also made premier recordings of violin concertos by Widor, Charles Villiers Stanford, Sergei Bortkiewicz & Maximilian Steinberg with the Russian violinist Sergey Levitin. He has conducted several recordings of music by Ralph Vaughan Williams including Symphony 5, Concerto for Two Pianos, premier recordings of Serenade for small orchestra, Bucolic Suite, The Blue Bird & The Fat Knight, the entire score of Scott of the Antarctic and the first modern recording of A London Symphony in its second version (1920). During the 1990s he made many recordings of complete musicals for TER, including Brigadoon, The Phantom of the Opera, Jesus Christ Superstar, Sweet Charity, Stop the World I Want to Get Off, The Fantasticks and Seven Brides for Seven Brothers. He conducted the highly regarded Royal National Theatre production of Carousel in London's west end and made the London cast recording."]}, {"page": "Classical music written in collaboration", "response": ["* Stephen Dodgson and Hector Quine have jointly written a number of studies for solo guitar. Staffordguitar.com"]}, {"page": "New London Orchestra", "response": ["From the start of the 2011-12 concert season, the NLO became the first orchestra-in-residence at Stratford Circus, starting with a concert on 21 October titled 'Sounds of London' which programmed a variety of shorter pieces by composers with London associations, from Haydn, Ketèlbey and William Alwyn to Stephen Dodgson, Phyllis Tate, Eric Coates and Robert Farnon.See concert details at  The season continued with a showing of the film The Snowman accompanied by the NLO playing Howard Blake’s music live, alongside other Christmas music.See concert details at  A repeat of the live concert of The Snowman took place in 2012.See concert details at "]}, {"page": "Bath Bach Choir", "response": ["The choir spent the next ten years moving forward from the Bach Festival legacy and building on its reputation for exploring works in the choral canon. Stephen Dodgson's Te Deum was performed in October 1982 as a part of the last Bach Festival at which the choir sung. Beethoven's Missa Solemnis was performed in 1982, the last time this work was heard in Bath.  The choir continued to perform two major orchestral concerts each year as well as a ‘lighter’ summer concert and three seasonal performances of Carols by Candlelight. In April 1986 the choir gave the first performance of Denys Darlow's own Requiem, dedicated to the City of Bath Bach Choir itself.", "|J. S. Bach, Stephen Dodgson", "!colspan=\"3\"|As a part of the 8th Bath Bach Festival (Stephen Dodgson was composer in residence)"]}, {"page": "Stephen Stirling (musician)", "response": ["Gary Carpenter's Concerto (nominated for a British Composer Award) was written for Stephen Stirling and the BBC Philharmonic Orchestra, conducted by Baldur Brönnimann, and given its world and broadcast premiere in April 2005. Other world premieres have included solo works by Stephen Dodgson and Martin Butler – Hunding (2004); the latter was again performed by Stephen Stirling in the very first moments of the grand opening of Kings Place in London in 2008."]}, {"page": "Classical guitar repertoire", "response": ["*Stephen Dodgson (1924–2013)"]}, {"page": "List of compositions for viola: C to E", "response": ["* Stephen Dodgson (1924–2013)"]}, {"page": "1956 in British music", "response": ["*Stephen Dodgson – Concerto No. 1 for Guitar and OrchestraMusic Web International. Accessed 15 April 2013"]}, {"page": "2013 in the United Kingdom", "response": ["**Stephen Dodgson, 89, composer."]}, {"page": "2013 in classical music", "response": ["*April 13 – Stephen Dodgson, composer, 89Stephen Dodgson obituary"]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Stephen Dodgson, 1981"]}, {"page": "2013 in British music", "response": ["*13 April – Stephen Dodgson, composer, 89Stephen Dodgson obituary"]}, {"page": "Deaths in April 2013", "response": ["*Stephen Dodgson, 89, British composer.Stephen Dodgson obituary (The Guardian)"]}, {"page": "Raymond Raikes", "response": ["After the war, he joined the BBC drama department, initially working on the production of the soap opera The Robinson Family and then producing and directing the Dick Barton - Special Agent series which regularly obtained 20,000,000 listeners daily. He went on to become a producer and director for the BBC Third Programme, where his output included 17 Shakespeare plays, the Oresteia  trilogy  by Aeschylus; The Wasps and Lysistrata by Aristophanes; and The Bacchae, Medea and Hippolytus by Euripides. He also introduced British radio audiences to less frequently performed Elizabethan and Jacobean dramas, Restoration comedies, and works by 20th century authors such as Robert Graves and Jean Anouilh. For many of the plays he directed, he would adapt the archaic English for modern audiences and he also adapted existing English translations of foreign works. Many of the productions had incidental music written by the composer Stephen Dodgson, with whom he had a long and genial collaboration. At the 1965 Prix Italia, Raikes won the RAI Prize for literary or dramatic programmes with The Anger of Achilles by Robert Graves and the Prix Italia for stereophonic musical and dramatic programmes with A. R. Gurney's The Foundling (music by Humphrey Searle).RAI (2012). Prix Italia: Winners 1949-1998. Retrieved 29 April 2013."]}]}}