{"wiki_id": "http://www.wikidata.org/entity/Q7609672", "itemLabel": "Stephen Kennedy", "itemDescription": "Northern Irish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Kennedy", "wikipedia_page": {"main": "Stephen Kennedy (born 17 June 1970) is a Northern Irish actor from Co. Tyrone. He had a keen interest in hip hop culture and was a breakdancer with Kevin 'Fangs' McCosker and Mark Tinney. He was educated at St. Colman's High School, Strabane, where he was encouraged to pursue drama by his teacher, Leo McBride. He is perhaps best known for his role in the BBC Radio 4 series The Archers, as Ian Craig. He has appeared on stage in Tamburlaine (2005), The Birthday Party, (2006), The Agent (2007), Mother Courage and her Children at The National Theatre (2009). On television, he has appeared in Ballykissangel, Father Ted, A Touch of Frost, The Hanging Gale, Making Waves and, The Lion King. His film work includes a brief appearance in Notes on a Scandal (2006) and a lead role in the feature film adaptation of The Agent (2008).\nIn 2013 Stephen has been focussing on improving his movement skills with particular interest in Flamenco.", "link_mentions": [{"page": "The Archers", "response": ["! scope=\"row\" |Stephen Kennedy"]}, {"page": "1993 in film", "response": ["| The Snapper || Miramax Films || Stephen Frears (director); Roddy Doyle (screenplay); Colm Meaney, Tina Kellegher, Brendan Gleeson, Pat Laffan, Rynagh O'Grady, Stanley Townsend, Stuart Dunne, Barbara Bergin, Birdy Sweeney, Cathleen Delany, Cathy Belton, Tom Murphy, Stephen Kennedy, Roddy Doyle, Karen Woodley, Virginia Cole, Denis Menton, Peter Rowen, Eanna MacLiam, Colm O'Byrne, Joanne Gerrard, Ciara Duffy, Deirdre and Dierdre O'Brien, Aisling Conlan, Alannagh McMullen, Sheila Flitton, Jack Lynch, Ronan Wilmot || Comedy || Live action"]}, {"page": "The Barrytown Trilogy", "response": ["| Stephen Kennedy"]}, {"page": "Making Waves (TV series)", "response": ["The second episode introduces the new navigating officer Lieutenant Sam Quartermaine (played by Adam Rayner) and a subplot involving his relationship with LMA Anita Cook (played by Angel Coulby) runs through the series and is eventually discovered by Lieutenant James Maguire, the Principal Warfare Officer (played by Stephen Kennedy). Terry \"Buffer\" Duncan's (played by Geoff Bell) career is in jeopardy when an accusation of assault is thrown at him in the third episode, while Leading Regulator Liz Wilson (played by Diane Beck) develops an unreciprocated crush on Bowen. Leading Chef Art Francis (played by Lee Boardman) must successfully prepare dinner for the captain and crew before it is stolen or ruined by Steward Tim \"Scouse\" Phillips (played by Darren Morfitt).", "Stephen Kennedy was already known for his role as Ian Craig in the BBC Radio4 soap opera The Archers. He mentioned in an interview the differences between the two roles, before quipping that they were not that dissimilar. The crew of Grafton appeared as extras throughout the series and schoolchildren from St. Jude's School, Southsea appeared in the families day scenes in episode six."]}, {"page": "The Snapper (film)", "response": ["* Stephen Kennedy as the Supermarket Trainee Manager"]}, {"page": "The Hanging Gale", "response": ["*Stephen Kennedy – Martin"]}, {"page": "Private Peaceful (film)", "response": ["*Stephen Kennedy as James Peaceful"]}, {"page": "Kennedy, Stephen", "response": ["#redirectStephen Kennedy"]}, {"page": "List of gay characters in television", "response": ["|Ian Craig || Stephen Kennedy || The Archers || "]}]}}