{"wiki_id": "http://www.wikidata.org/entity/Q7614976", "itemLabel": "Steven Leslie", "itemDescription": "British footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Leslie_(footballer,_born_1987)", "wikipedia_page": {"main": "Steven William Leslie (born 5 November 1987) is a Scottish born footballer who plays for Bala Town in the Cymru Premier. He is predominantly a left-sided midfielder. He has had spells in the English lower leagues, playing for teams including Shrewsbury Town and Hereford United.", "link_mentions": [{"page": "Kieron St Aimie", "response": ["St Aimie scored his first goal three games into the season on 18 August 2012 against Braintree Town, scoring the 2nd goal of the game on 18 minutes, slotting home Steven Leslie's flick-on from Luke Hubbins' right wing cross, Telford went on to a 3–0 victory. On 25 August 2012 he scored a decisive goal four minutes before half time at Luton Town, Steven Leslie's perfectly placed free-kick for St Aimie to head home past Mark Tyler. Two days later he scored a 56th-minute equaliser against Stockport County, good work from Luke Hubbins playing a couple of one-two's with Steven Leslie to slide the ball across for St Aimie to sidefoot home from close range, the game finishing a 2–2 stalemate. On 1 September 2012, he scored the 3rd and final goal of the game, a powerful header in the 57th minute from Steven Leslie's right-wing corner, to make it 0–3 away at Southport."]}, {"page": "2010–11 Stoke City F.C. season", "response": ["Stoke were drawn at home to League Two side Shrewsbury Town in the second round of the League Cup. the \"Shrews\" had beaten Charlton Athletic 4–3 in the first round. Stoke fielded a fairly strong side with Carlo Nash making his first start since returning to the club. It was Shrewsbury who made the brighter start with Dutch striker Benjamin van den Broek shooting harmlessly at Nash. Stoke took the lead on 26 minutes with a diving header from Jonathan Walters who scored his first City goal, it was 2–0 ten minutes later when Tuncay headed past Chris Neal. It was a quite second half with Stoke looking for the third goal but were guilty of some missed opportunity. Shrewsbury gave themselves hope when Steven Leslie scored but the match finished 2–1 to Stoke."]}, {"page": "2010–11 Hereford United F.C. season", "response": ["|align=\"left\"| 26 ||align=\"left\"|MF||align=\"left\"| Steven Leslie"]}, {"page": "2010–11 Shrewsbury Town F.C. season", "response": ["|align=\"left\"|11||align=\"left\"|MID||align=\"left\"| Steven Leslie"]}, {"page": "2011–12 Shrewsbury Town F.C. season", "response": ["| Steven Leslie", "| Steven Leslie"]}, {"page": "2011–12 Hereford United F.C. season", "response": ["| Steven Leslie"]}, {"page": "Aaron Williams (footballer)", "response": ["On 3 December 2013, Williams scored against his former club AFC Telford United in an FA Trophy First Round Replay at the New Bucks Head. His goal was Worcester's third in a 3–0 victory. The second goal of the game was initially reported by Telford's website as an Aaron Williams goal, but Worcester later confirmed that it had been awarded to his teammate Ellis Deeney. Williams' first league goal of the season was Worcester's second in a 2–1 home victory against Colwyn Bay on 18 January 2014. Williams came off the bench to score the winning goal for Worcester on 1 March 2014, heading in a Steven Leslie cross with ten minutes remaining in a 2–1 home victory over Stalybridge Celtic. On 18 March 2014, manager Carl Heeley opted for a much-changed, youthful line-up against Williams' former club Redditch United in the Worcestershire Senior Cup. Williams was named as Worcester captain for the game, however he could not prevent a 2–0 Redditch victory."]}, {"page": "2008–09 Shrewsbury Town F.C. season", "response": ["!scope=row|Steven Leslie"]}]}}