{"wiki_id": "http://www.wikidata.org/entity/Q7612771", "itemLabel": "Steve Harper", "itemDescription": "Footballer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Harper_(footballer,_born_1969)", "wikipedia_page": {"main": "Steven James Harper (born 3 February 1969) is an English former footballer who scored 54 goals in 504 league games in a 15-year career in the Football League. He was a speedy winger, adept at dribbling the ball.\nHe began his professional career at Port Vale in June 1987, before he was sold to Preston North End for £35,000 in March 1989. He joined Burnley on a free transfer in July 1991, and helped the \"Clarets\" to win the Fourth Division title in 1991–92. He moved on to Doncaster Rovers in August 1993, before he was sold on to Mansfield Town for a £20,000 fee in September 1995. He took a free transfer to Hull City in July 1999, before joining Darlington in February 2001. He left the Football League in 2002, and moved into non-league football with Kidsgrove Athletic. He later became a coach.", "link_mentions": [{"page": "Stephen Harper (disambiguation)", "response": ["*Steve Harper (born 1975), English footballer", "*Steve Harper (footballer, born 1969), English footballer"]}, {"page": "John Rudge", "response": ["The 1988–89 season was highly successful, and Rudge signed a new two-year contract after Port Vale beat Bristol Rovers in the play-off Final. For the first time in thirty two years, Vale were in the Second Division. A new club record was set in January 1989, as Rudge purchased classy defender Dean Glover from Middlesbrough for £200,000. The next month he added Liverpool winger John Jeffers to the squad for £35,000, using the money he received from selling Steve Harper to Preston North End. To boost the side for the oncoming 1989–90 season, defender Neil Aspin was purchased from Leeds United for £150,000, Aspin would play over 300 games for Vale in the next ten years. £125,000 was splashed out on striker Nicky Cross, who would play around 150 games over the next five years. Vale fans were not used to such purchases, but compared to other teams in the division, the money spent was quite modest. Now on a par with rivals Stoke City, both league games ended as draws, though Stoke were relegated in bottom place."]}, {"page": "John Jeffers", "response": ["Jeffers turned professional at Kenny Dalglish's Liverpool in October 1986, but was never able to provide too much first-team competition for John Barnes, and never featured at Anfield. He was loaned out to Port Vale as cover for the injured Paul Atkinson in December 1988; he was recalled by the \"Reds\" in February 1989 but was brought back to Port Vale permanently the next month for a fee of £30,000. To fund the transfer Rudge sold Steve Harper to Preston North End for £35,000. He featured in 15 Third Division games in the 1988–89 season, and featured in all four play-off games, including both legs of the play-off final victory over Bristol Rovers. He scored his first league goal on 4 November 1989, in a 2–1 defeat to Oxford United at Vale Park. He played a total of 46 games in the 1989–90 season, as the \"Valiants\" posted a top-half finish in the Second Division. He scored twice in 36 games during the 1990–91 campaign, but started to become plagued by abdominal injuries from March onwards. He scored three goals in 38 appearances in the 1991–92 season, as the \"Valiants\" suffered relegation in last place. He scored twice in 34 games in the 1992–93 season, but did not feature at Wembley either in the League Trophy Final win over Stockport County or the play-off Final defeat to West Bromwich Albion. He did though help John Rudge's side to win promotion with a second-place finish in the 1993–94 campaign; they finished just one point behind champions Reading. He lost his first-team place in the 1994–95 season, as Vale posted a 17th-place finish in the second tier (known as the First Division due to the creation of the Premier League)."]}, {"page": "Steven James Harper", "response": ["#REDIRECT Steve Harper (footballer, born 1969)"]}, {"page": "List of footballers in England by number of league appearances", "response": ["!scope=row data-sort-value=\"Harper, Steve\"|Steve Harper"]}, {"page": "1987–88 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Steve Harper", "|12||MF||||Steve Harper||2||0||0||0||2"]}, {"page": "1988–89 Port Vale F.C. season", "response": ["The season opened with a 4–2 win over Preston North End on a plastic pitch at Deepdale. David Riley \"discussed a transfer\", but remained at the club despite being unhappy at starting the season from the bench. A weak defensive performance then cost them at home to Chester City, though Rudge was happy with the performance of Simon Mills, a midfielder who was learning a new position at right-back. A disciplined performance was enough to win a point away at Bury, with goalkeeper Mark Grew in impressive form. With Atkinson injured and Steve Harper out of form, Rudge tried unsuccessfully to bring in Liverpool's Steve Staunton and Bournemouth's Mark O'Connor on loan. The campaign though kicked into gear with \"a stunningly ruthless\" 6–1 thrashing of \"a by no means inadequate\" Cardiff City. They followed this up with a 5–0 mauling of a \"dreadful\" Chesterfield – Darren Beckford claiming a hat-trick – and moved to the top of the table. They ended September with a 1–0 win over Bristol City, as the Vale defence proved its effectiveness.", "A Futcher penalty opened March with a win over Blackpool, though Vale also had two goals disallowed. Preston then purchased young reserve winger Steve Harper, who wanted to \"prove himself\", for £35,000. Vale played a five-man defence against relegation candidates Aldershot, and came away from the Recreation Ground with a 2–2 draw as Rudge bemoaned \"two points thrown away\". They returned to winning ways against Brentford, but could only manage a draw at home to Preston. Rudge refused Reading's offer of £250,000 for Dean Glover, but placed Hazell on the transfer list. He did though sign Jeffers permanently for £30,000 after giving up hope of Atkinson returning to fitness. He also re-signed Ronnie Jepson from Nantwich Town, though attempts to loan in Jim Melrose from Shrewsbury Town were unsuccessful. On 25 March, Beckford hit a hat-trick as Vale claimed a 4–1 victory at Notts County to go ten games unbeaten. Two days later though, they fell to defeat at home to Mansfield.", "|align=\"left\"|MF||align=\"left\"| Steve Harper", "| March 1989 || MF ||  || Steve Harper || Preston North End || £35,000 || "]}, {"page": "Steve Harper (footballer born 1969)", "response": ["#REDIRECT Steve Harper (footballer, born 1969)"]}, {"page": "David McMahon (association footballer)", "response": ["In December 2000, McMahon joined Football League Third Division club Darlington on loan for the remainder of the season. He made his debut as a second-half substitute in a 1–0 defeat at Leyton Orient, and scored his first goal in the next match, heading home Martin Gray's cross to open the scoring in a 3–0 win at home to Lincoln City. Ahead of the Football League Trophy visit to York City in January 2001, McMahon agreed with manager Gary Bennett's suggestion that he had not been at his best; he responded by producing a run that forced a York defender to bring him down for a penalty kick, and then, collecting the ball from a throw-in with his back to goal on the edge of York's penalty area, he \"turned and sent a left-foot curler past the outstretched hand\" of the goalkeeper for Darlington's third goal. As the club brought in other forwards during the season, including David Brightwell, Steve Harper and Clint Marcelle, McMahon lost his place. His last of eleven appearances in all competitions was on 24 February as a substitute. When his Newcastle contract expired at the end of the season, the club released him on a free transfer."]}, {"page": "1997–98 Mansfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Steve Harper"]}, {"page": "1998–99 Mansfield Town F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Steve Harper"]}, {"page": "2000–01 Hull City A.F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Steve Harper"]}, {"page": "1995–96 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Harper"]}, {"page": "1996–97 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Harper"]}]}}