{"wiki_id": "http://www.wikidata.org/entity/Q7614770", "itemLabel": "Steven Gregory", "itemDescription": "British footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Gregory_(footballer)", "wikipedia_page": {"main": "Steven Michael Gregory (born 19 March 1987) is an English former footballer who played as a midfielder.", "link_mentions": [{"page": "2011–12 AFC Wimbledon season", "response": ["| align=\"center\" |  Steven Gregory"]}, {"page": "2011–12 AFC Bournemouth season", "response": ["|7 ||MF || ||15 ||Steven Gregory || 2 || 0 || 0 || 0 || 2", "| Steven Gregory", "| Steven Gregory"]}, {"page": "2012–13 Gillingham F.C. season", "response": ["|28||MF||Steven Gregory||1||0||0||0||0||0||0||0||1||0"]}, {"page": "2012–13 AFC Wimbledon season", "response": ["|28 || ||MF ||Steven Gregory || 2 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 3 || 0", "| align=\"center\" |  Steven Gregory"]}, {"page": "Jonathan Meades (footballer)", "response": ["Meades' initial two-month deal at AFC Wimbledon saw him joining then teammate Steven Gregory and former Cherries captain Warren Cummings and reunited him with Neal Ardley, who had left his post as Head of the Cardiff City Academy to become manager of AFC Wimbledon on 10 October 2012. Meades made his senior Football League debut for AFC Wimbledon on 6 November in a 2–0 loss to Exeter City. With Meades having established himself as a regular in the starting XI, it was announced on 8 January 2013 that Ardley had extended Meades' loan spell with AFC Wimbledon by a further month. On 31 January 2013, it was announced that AFC Wimbledon had once again extended Meades' loan from Bournemouth until the end of the 2012–13 season. On 20 April 2013, Meades scored his first Football League goal in a 2–2 draw with 2012–13 Football League Two Champions Gillingham. Meades capped the end of a successful loan spell on 27 April 2013, the final day of the 2012–13 Football League Two season, by helping AFC Wimbledon to avoid relegation from the Football League after a 2–1 victory over Fleetwood Town. The 21-year-old was subsequently awarded the Natalie Callow Memorial Trophy for AFC Wimbledon's Young Player of the Year, as voted for by the fans."]}, {"page": "2014–15 Gillingham F.C. season", "response": ["|16 May 2014||MF|| Steven Gregory||Released||Free||"]}]}}