{"wiki_id": "http://www.wikidata.org/entity/Q7614286", "itemLabel": "Steve White", "itemDescription": "English comic book writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_White_(comics)", "wikipedia_page": {"main": "Steve White is a British comic book writer, paleoartist, and occasional colourist who has mainly worked with 2000 AD.", "link_mentions": [{"page": "Family Guy", "response": ["A comic book based on the Family Guy universe was produced. Published by Titan Comics, edited by Steve White, and illustrated by Anthony Williams and S. L. Gallant, the writing and the illustrations was supervised by the show's producers. The first comic book was released on July 27, 2011."]}, {"page": "Rogue Trooper", "response": ["Fleischer was replaced with Steve White, who made the military aspect of the strip more up-to-date and tried to reconcile the two versions of the character. He also reintroduced Venus Bluegenes (Helm's treacherous girlfriend from an earlier story who gained a more prominent role during the Simon Geller run) who had her own short spin-off run. His run on the character was the 2000 AD debut of artist Henry Flint.", "Rogue also appeared in crossovers with the new \"Friday\" series (leading up to the deaths of Rogue and Bagman in #949), all written by Steve White:", "Venus Bluegenes appeared both in Rogue Trooper and in her own eponymous strip, with stories written by authors including Grant Morrison, Steve White and Dan Abnett."]}, {"page": "Marvel UK", "response": ["In 1988, Marvel UK letterer/designer Richard Starkings pushed for the company to publish its own US-format comics, beginning with Dragon's Claws and Death's Head (a spin-off character from Marvel UK's Transformers title). The Sleeze Brothers (1989–1990) was a creator-owned title by John Carnell and Andy Lanning. It was Steve White who launched the first critically acclaimed volume of Knights of Pendragon (1990–1991), written by Dan Abnett and John Tomlinson with art by Gary Erskine, which mixed superheroes and Arthurian myth. It also featured Captain Britain among many other Marvel Comics heroes, such as Iron Man."]}, {"page": "Chris Weston", "response": ["*** \"Hill 392\" (with Steve White, in Poster Prog #4, 1994)"]}, {"page": "Henry Flint", "response": ["*Rogue Trooper (Friday):  (with Steve White):", "*Venus Bluegenes: \"Stealth\" (with Steve White, in 2000 AD #980–982, 1996)", "*Vector 13: \"Case One: Devil in the Deep Blue Sea\" (with Steve White, in 2000 AD #1024, 1997)"]}, {"page": "Charlie Adlard", "response": ["*Rogue Trooper (Friday): \"Angels\" (with Steve White, in 2000 AD #950-52, 1995)"]}, {"page": "Steve Yeowell", "response": ["*Black Light: \"Pandora's Box\" (with  Dan Abnett/Steve White, in 2000 AD #1010–1013, 1996)"]}, {"page": "Transformers (comics)", "response": ["To coincide with the release of the 2007 movie, Titan Magazines produced a new UK monthly title called Transformers.  The first issue went on sale on July 27, 2007.  The book contains a ten-page original lead strip, and reprints six or seven pages per issue of IDW's movie prequels and Beast Wars: The Gathering.  It is edited by Steve White, who also worked for Marvel UK's Transformers title; the UK strips are written by Simon Furman. Artists have included Geoff Senior and Nick Roche, and are to include Andrew Wildman, Don Figueroa and Nick Roche, with Guido Guidi and Marcelo Matere confirmed on issues 5 and 6.TransFans.net | View topic – TF UK COMICTF UK Comic – New Details RevealedMore Information about the New UK Transformers ComicMySpace.com – Transformers Comic UK – 27 – Garçon – UK – www.myspace.com/transformerscomicuk"]}, {"page": "A1 (comics)", "response": ["* Wonderful Life, Steve White", "* Wonderful Life, Steve White", "* Pale Horses, Dan Abnett, Steve White and Gary Erskine"]}, {"page": "John M. Burns", "response": ["*Black Light: \"Survivor Syndrome\" (with Dan Abnett/Steve White, in 2000 AD #1001–1005, 1996)"]}, {"page": "Gary Erskine", "response": ["Erskine then expanded his work into 2000 AD, drawing a Judge Dredd story written by Garth Ennis. For 2000 AD, he also drew Flesh written by Dan Abnett and Steve White, and for 2000 AD's sister title Crisis he illustrated The Real Robin Hood, written by Michael Cook, in 1991. Working with writer John Tomlinson he drew the Lords of Misrule graphic novel for Tundra in 1993. The novel was based upon old British legends and urban myths and was well received.", "*Flesh: \"Chronocide\" (with Dan Abnett/Steve White, in 2000 AD #973–979, 1996)", "*HyperSonic (with Dan Abnett/Steve White, Dark Horse, 1997–1998)", "**The Empire Falls: Battle of Midway (with Steve White and Richard Elson, 48 pages, October 2006, )", "**Day of Infamy: Attack on Pearl Harbor (with Steve White and Jerrold Spahn, 48 pages, February 2007, )"]}, {"page": "United Kingdom Comic Art Convention", "response": ["| 30 Sept. – 1 Oct. 1995 || UCL Institute of Education / Royal National Hotel, London || Stan Lee, John Buscema, Richard Elson, Nigel Kitching, Lew Stringer, Steve White ||  ||", "| Sept. 1996 || London || Scott Lobdell, Jim Woodring, Richard Elson, Nigel Kitching, Lew Stringer, Steve White || Cover by Bryan Talbot featuring Doctor Strange; interior art by James Hodgkins, Craig Dixon, James Murphy, Lee Townsend, Richard Elson, Jon Haward, John Erasmus, Peter Doherty, Al Davison, Scott Lobdell, Jim Woodring, Mike Perkins, Robert Corona, Alan Davis/Mark Farmer, Nigel Kitching, and John McCrea ||"]}, {"page": "Vector 13", "response": ["** \"Case One: Devil in the Deep Blue Sea\" (by Steve White and Henry Flint, in 2000 AD #1024, 1997)", "** \"Case Four: Bad Moon Rising\" (by Steve White and Amanda Fletcher, in 2000 AD #1027, 1997)", "** \"Case Seven: Night of the Jaguar\" (by Steve White and Marc Wigmore, in 2000 AD #1068, 1997)"]}, {"page": "Flesh (comics)", "response": ["Flesh Book 1 ran for the first 19 issues of 2000 AD as well as the 1977 annual, and ending its run that year. While Flesh was popular, the series was not mentioned again until 1978 when Satanus, the son of Book 1's Tyrannosaurus antagonist Old One-Eye, appeared in the Judge Dredd story The Cursed Earth. The series was revived and returned with Flesh Book Two in issue 86, which was written by Kelvin Gosnell and primarily drawn by Massimo Belardinelli. The series gained popularity and ran until issue 99. Further books followed in issues 800–808 and 817–825, written by Mills and Tony Skinner with art by Carl Critchlow, and issues 973–979 written by Dan Abnett and Steve White with art by Gary Erskine and Simon Jacob.", "** \"Chronocide\" (by Steve White/Dan Abnett and Gary Erskine, in 2000 AD #973–979, 1996)"]}, {"page": "Friday (2000 AD)", "response": ["Friday is a comics character who appeared in the British anthology 2000 AD between 1989 and 1996. He was created by writer Dave Gibbons and artist Will Simpson. Subsequently Michael Fleisher and then Steve White took over as regular series writers. Friday was the lead character of the new Rogue Trooper series, which was a reboot of the original 1981 series, of which Gibbons had been the creator artist (with writer Gerry Finley-Day).", "After five stories Steve White was brought in to help address some problems. According to editor John Tomlinson \"Ever since \"War Machine\" in 1989, readers had been confused as hell about who is Friday and whether he was the original Rogue. I told Steve to figure that out and explain it.\"Bishop (2007) page 168 This led to a two-year-long run on the series for the writer, although there was a move to hand the series to Mark Millar which only resulted in a three-part story. During this period Friday met both Judge Dredd, in an issue-length story,Judge Dredd: \"Casualties Of War\" (by John Wagner and John Higgins, in 2000 AD #900, 1994) and later the original Rogue Trooper,\"Blue on Blue\" (by Steve White and Henry Flint, in 2000 AD #928-931, 1995) the latter being intended to settle the issue of their origins and connections. Unfortunately, according to Tomlinson \"Steve came up with a fairly watertight explanation, but it was enormously complicated and probably confused far more people than it enlightened.\"Bishop (2007) page 179 That story also brought in Venus Bluegenes, a G.I. Doll, who would appear in one more story\"Hot Metal\" (by Steve White and Steve Tappin, in 2000 AD #983-986, 1996) before her appearance in the final story to feature Friday. Dan Abnett, co-author for that story, was complimentary of White's work, \"Steve had such a great feel for military goings on,\" however, this couldn't overcome intrinsic problems with the story as \"he was absolutely hamstrung by the weight of continuity.\"Bishop (2007) page 188-189 In the final story in 1996, Friday and Venus disappeared into a black hole and have not reappeared since. Subsequent Rogue Trooper stories have all featured the original version of the character.", "** \"Some Mother's Son\" (by Steve White and Henry Flint, in 2000 AD Sci-Fi Special, 1994)", "** \"Hill 392\" (by Steve White and Chris Weston & Gina Hart, in Rogue Trooper Poster Prog #1, 1994)", "** \"Mercy Killing\" (by Steve White and Henry Flint, in 2000 AD #889-891, 1994)", "** \"Some Mother's Son\" (by Steve White and Henry Flint, in 2000AD Sci-Fi Special, 1994) ", "** \"Mercenary Attitudes\" (by Steve White and Henry Flint, in 2000 AD #896-899, 1994)", "** \"Danger Drop\" (by Steve White and Adrian Lutton, 2000AD Yearbook 1995, 1994)", "** \"Blue on Blue\" (by Steve White and Henry Flint, in 2000 AD #928-931, 1995)", "** \"Mind Bombs\" (by Steve White and Edmund Bagwell (credited as Edmund Perryman) & Nick Abadzis, in 2000 AD #937-939, 1995)", "** \"Ascent\" (by Steve White and Steve Tappin, in 2000 AD #946-949, 1995)", "** \"Angels\" (by Steve White and Charlie Adlard, in 2000 AD #950-952, 1995)", "** \"Descent\" (by Steve White and Steve Tappin, in 2000 AD #964-966, 1995)", "** \"Combat Rocks\" (by Steve White and Steve Tappin, in 2000 AD #967-970, 1995)", "** \"A Night Out with the Boys\" (by Steve White and Steve Tappin, in 2000AD Sci-Fi Special, 1995)", "** \"Hot Metal\" (by Steve White and Steve Tappin, in 2000 AD #983-986, 1996)", "** \"Street Fighting Man\" (by Steve White and Steve Tappin, in 2000 AD #987-989, 1996)", "** \"Gaia\" (by Steve White and Dougie Braithwaite, in Rogue Trooper Action Special, 1996)", "** \"Shakedown\" (by Steve White and Steve Tappin, in Rogue Trooper Action Special, 1996)", "** \"Collateral\" (by Steve White and Steve Tappin, in 2000 AD #1007-1009, 1996)", "** \"Rogue Alone\" (by Steve White and Calum Alexander Watt, in 2000 AD #1010-1013, 1996)", "** \"Rogue Troopers\" (by Dan Abnett & Steve White and Alex Ronald, in 2000 AD #1014-1022, 1996)"]}, {"page": "John Tomlinson (comics)", "response": ["** The Lords of Misrule (with co-authors Dan Abnett/Steve White and art by Peter Snejbjerg, black and white 6-issue limited series, Dark Horse Comics, 1997, black and white softcover, 200 pages, Dark Horse, 1999, )", "** \"Venus on the Frag Shell\" (with Dan Abnett, Steve White in 2000 AD #1297–1299, 1996)"]}, {"page": "Richard Elson", "response": ["**The Empire Falls: Battle of Midway (with Steve White, 48 pages, October 2006, )"]}, {"page": "Tundra Publishing", "response": ["* Pale Horses by Dan Abnett, Steve White and Gary Erskine — published in 1997 by Dark Horse Comics as Hypersonic"]}, {"page": "Steve White", "response": ["Steve White may refer to:", "*Steve White (footballer) (born 1959), former English footballer and manager", "*Steve White (American football) (born 1973), American football player ", "*Steve White (baseball) (1884–1975), Major League Baseball pitcher", "*Steve White (tennis), former tennis coach and player at Cal State Fullerton Titans", "*Steve White (sailor) Offshore Racer", "*Steve White (drummer) (born 1965), drummer for several British bands", "*Steve White (saxophonist) (1925–2005), Los Angeles based jazz saxophonist who flourished in the 1950s", "*Steve White (guitarist) (born 1965), guitarist for KMFDM and PIG", "*Steve White (actor) (born 1961), American actor and comedian", "*Steve White (author) (born 1948), American science fiction writer and former Navy officer", "*Steve White (comics) (born 1964), comic writer", "*Steve White (judge) (born 1949), judge and former Inspector General of the California Department of Corrections and Rehabilitation"]}, {"page": "Simon Coleby", "response": ["** \"Bitchin'!\" (with Steve White, in 2000AD Winter Special 1995)"]}, {"page": "Lee Sullivan (comics)", "response": ["*Black Light:  \"Lords of Creation\" (with Dan Abnett/Steve White, in 2000 AD #1006–1009, 1996)"]}, {"page": "Mick Austin", "response": ["*Urban Strike (with Steve White/Anthony Williams, in 2000 AD #950-955, 1995)"]}, {"page": "Nick Abadzis", "response": ["*Rogue Trooper (Friday): \"Mind Bombs\" (art, with Steve White and Edmund Perryman, in 2000 AD #937–939, 1995)"]}, {"page": "Doug Braithwaite", "response": ["* Rogue Trooper (Friday): \"Gaia\" (with Steve White, Rogue Trooper Action Special, 1996)"]}, {"page": "Radical Studios", "response": ["* The Lords of Misrule by John Tomlinson, Dan Abnett, Steve White, Gary Erskine and Peter Snejbjerg, recoloured by J. M. Ringuet  "]}, {"page": "Dan Abnett bibliography", "response": ["* Flesh: \"Chronocide\" (with Steve White and Gary Erskine, in 2000 AD #973–979, 1996)", "* Black Light (with co-writer Steve White):", "* Rogue Trooper: \"Rogue Troopers\" (with Steve White and Alex Ronald, in 2000 AD #1014–1022, 1996)", "* Lords of Misrule (with co-authors John Tomlinson and Steve White and art by Peter Snejbjerg and Gary Erskine, Dark Horse, softcover, 200 pages, 1997, tpb, Dark Horse, 1999, , Radical Comics, hardcover, 264 pages, June 2009, )", "* HyperSonic (with co-writer: Steve White; Art: Gary Erskine, for Dark Horse, 1997–1998)"]}, {"page": "Paleoart", "response": ["Although various authors are in agreement about the events that caused the beginning of the Dinosaur Renaissance, the transition to the modern age of paleoart has been more gradual, with differing attitudes about what typifies the demarcation. Gregory Paul's high-fidelity archosaur skeletal reconstructions provided a basis for ushering in the modern age of paleoart, which is perhaps best characterized by adding speculative flair to the rigorous, anatomically-conscious approach popularized by the Dinosaur Renaissance. Novel advances in paleontology, such as new feathered dinosaur discoveries and the various pigmentation studies of dinosaur integument that began around 2010, have become representative of paleoart after the turn of the millennium.Terakado (2017) Witton (2018) characterizes the modern movement with the rise of digital art, as well as the establishment of an internet community that would enabled paleoartists and enthusiasts to network, share digitized and open access scientific resources, and to build a global community that was unprecedented until the first decade of the twenty-first century. The continuum of work leading from the themes and advances that began in the Dinosaur Renaissance to the production of modern paleoart is showcased in several books that were published post-2010, such as Steve White's Dinosaur Art: The World's Greatest Paleoart (2012) and its \"sequel\", Dinosaur Art II: The Cutting Edge of Paleoart (2017).Witton (2018) p. 34.", "* Steve White 1990s-"]}, {"page": "Peter Snejbjerg", "response": ["** \"The Lords of Misrule\" (art and script (#121), with writers Steve White (#120) and John Tomlinson, in Dark Horse Presents #120-122, April–June 1997)", "** The Lords of Misrule (art, with co-authors Dan Abnett/John Tomlinson/Steve White, black and white 6-issue limited series, Dark Horse Comics, January–June 1997, black and white softcover, 200 pages, Dark Horse, 1999, )"]}, {"page": "Star Wars (UK comics)", "response": ["The final editor was Jon Chapple. Previous editors included Steve White, Andrew James, Mark McKenzie-Ray and John Freeman.", "Issue 15 of Titan's Totally... magazine was a one-off special coinciding with the February 2012 3D re-release of Star Wars: Episode I - The Phantom Menace. It featured an original comic strip titled 'Duel of the Fates', written by Steve White and pencilled by Will Sliney. The strip featured several panels which could be viewed in stereoscopic 3D with the use of 3D glasses given away free with the magazine."]}, {"page": "Black Light (2000 AD)", "response": ["Black Light is a science fiction thriller that ran in the British comic anthology 2000 AD in 1996. It was created by Dan Abnett, Steve White and John M. Burns."]}, {"page": "Family Guy (franchise)", "response": ["A comic book based on the Family Guy universe was produced. Published by Titan Comics, edited by Steve White and illustrated by Anthony Williams and S. L. Gallant. The writing and the illustrations will be supervised by the show's producers. The first comic book was released on July 27, 2011."]}, {"page": "Todd Marshall (artist)", "response": ["In interview with Steve White, Marshall describes his introduction to the art of dinosaur reconstruction through the 1966 film One Million Years B.C., which inspired his first attempt at paleoart (a Brontosaurus) at age four or five. Originally from Kansas, he moved to Los Angeles to pursue his dream of becoming a rock star, and later decided that it would be more lucrative and consistent with his talents to become an illustrator. He attended the Art Center College of Design in Pasadena, California, where he met \"Crash\" McCreery, who Marshall cites as a chief influence along with music stars such as Elvis Presley, special effects artists such as Ray Harryhausen, movie producers and directors including George Lucas and Steven Spielberg, and classic paleoartists such as Charles R. Knight. As a professional paleoartist, Marshall prefers to work in acrylic paints and particularly enjoys the use of airbrushes."]}]}}