{"wiki_id": "http://www.wikidata.org/entity/Q7614308", "itemLabel": "Steve Wilkinson", "itemDescription": "English footballer (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Wilkinson_(footballer)", "wikipedia_page": {"main": "Steve Wilkinson (born 1 September 1968) is an English former professional footballer who played as a striker for five different clubs in The Football League. He is now head of the football development centre at Loughborough College.Wilkinson began his career at Leicester City, where he climbed through the ranks and signed a professional contract in September 1986. He only played a handful of games for Leicester, and had a loan spell at Crewe Alexandra before he was sold to Mansfield Town in September 1989 for a £80,000 transfer fee – a club record at the time. He scored on his Mansfield debut on 3 October 1989 in a League Cup match against Luton Town, and finished the season as Mansfield's top scorer with 15 league goals.His arguably finest moment in a Mansfield shirt came on 3 April 1990, when Wilkinson scored all five goals in Mansfield's 5–2 victory against Birmingham City. The following season, Wilkinson's goals could not prevent Mansfield from being relegated from Division Three. However, largely thanks to the 40 league goals scored by Wilkinson and his strike partner Phil Stant, Mansfield bounced straight back up in 1991–92, only to be relegated the next season again.In 1994–95, Wilkinson had his most productive season, scoring 26 league goals, including a hat-trick against arch-rivals Chesterfield, as Mansfield reached the playoffs. However, the Stags missed out on promotion, losing 6–3 on aggregate against Chesterfield in the playoff semifinal. Later that summer, Wilkinson was sold to Preston North End for £100,000. Overall, in all competitions, Wilkinson scored 91 goals for Mansfield, which places him third on the club's all-time scoring list behind Harry Johnson and Ken Wagstaff.\nWilkinson spent two seasons at Preston, where he scored 18 goals and added a Division Three championship medal to his collection, before moving back to the East Midlands in July 1997, when he joined Chesterfield. He spent three seasons at Chesterfield, scoring 15 goals, before retiring from the game in 2000. He now lives in Loughborough and teaches in the sports department of Loughborough College", "link_mentions": [{"page": "History of Preston North End F.C.", "response": ["Andy Saville, a much-travelled striker, was signed from Birmingham City for £100,000, whilst Steve Wilkinson was acquired for £80,000 from Mansfield Town to partner him. Despite losing their first game of the 1995–96 season 2–1 at home to Lincoln City, North End then embarked on a 21-match unbeaten run, which included a 6–0 drubbing of Mansfield, in which Saville and Wilkinson each bagged a hat-trick."]}, {"page": "1994–95 Football League", "response": ["|align=center| =|| Steve Wilkinson || Mansfield Town ||align=center| 23"]}, {"page": "List of Mansfield Town F.C. players", "response": ["Goalkeeper Rod Arnold owns the club record for most games played for Mansfield Town. He made a total of 513 appearances for the club, 440 of those being in the league, between 1971 and 1984. Sandy Pate is second on Mansfield's all-time appearance list with 479 first-team games (413 in the league). Defenders Don Bradley, Kevin Bird and George Foster, the latter of whom also served as manager of the club, have also played more than 400 matches for Mansfield Town. Harry Johnson owns the club's all-time goalscoring record, with 114 goals. Incidentally, Johnson is also Sheffield United's all-time top goalscorer, having scored more than 200 goals for the Blades. Ken Wagstaff is second on the list with 106 goals, while Steve Wilkinson is third with 91 goals. The record for most goals in a single season belongs to Ted Harston, who scored 55 goals for Mansfield in the 1936–37 season, and was subsequently sold to Liverpool."]}, {"page": "1995 Football League Third Division play-off Final", "response": ["Chesterfield faced Mansfield Town in their semi-final and the first leg was played at Field Mill in Mansfield.  After a goalless first half, Phil Robinson gave Chesterfield the lead in the 64th minute after out-pacing the Mansfield Town defence and scoring past Darren Ward in goal. Stewart Hadley levelled the score eight minutes later when he struck from the edge of the Chesterfield penalty area after the defence failed to clear a free kick, and the match ended 1–1.  The second leg took place at Saltergate in Chesterfield three days later.  Paul Holland gave Mansfield the lead after three minutes with a header before Tony Lormor equalised midway through the first half.  Steve Wilkinson then restored Mansfield's lead with a goal on 32 minutes but Robinson equalised and regular time ended by the score at 2–2, and 3–3 on aggregate, sending the game into extra time.  Kevin Lampkin was sent off for Mansfield before Nicky Law scored from a penalty.  Mark Peters was then also dismissed, leaving Mansfield with nine players, and further strikes from Jonathan Howard and Robinson made the final score 5–2 with Chesterfield progressing to the final with a 6–3 aggregate victory."]}, {"page": "History of Mansfield Town F.C.", "response": ["The side lost many of its better players, with Paul Holland, Steve Wilkinson and Darren Ward, three of Mansfield's main players in the play-off season, all left in the summer. Mansfield, depleted with few signings, finished 19th. The following season, King was sacked after just three games. Captain Steve Parkin took over as manager, but his spell started just as badly, with Mansfield fifth from bottom at the New Year. Good results between New Year and Easter meant the Stags were two points off a play-off place with five games left, although they just missed out.", "| Kevin Bird  (1972–83)  463 || 3 || Steve Wilkinson  (1989–95)  92"]}, {"page": "1999–2000 Chesterfield F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "Steve Wilkinson", "response": ["Steve Wilkinson may refer to:", "* Steve Wilkinson (footballer) (born 1968), English footballer", "* Steve Wilkinson (cricketer) (born 1949), English cricketer", "* Steve Wilkinson (tennis) (1941–2015), American tennis player and tennis coach", "* Steve Wilkinson, member of the music trio, The Wilkinsons"]}, {"page": "Loughborough Foxes W.F.C.", "response": ["In January 2019, Loughborough Foxes player and junior team coach Molly Webb died aged 25, with Director of Football Steve Wilkinson describing her as \"a joy to spend time with; she was vibrant, enthusiastic, a motivator and someone you want in your team whatever the situation.\". The Foxes would end their first season back at the third tier of women's football in 7th place in the 2018–19 FA Women's National League Southern Division before being realigned to the Northern Division for the following season."]}, {"page": "1989–90 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "1990–91 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "1991–92 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "1992–93 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "1993–94 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}, {"page": "1994–95 Mansfield Town F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Wilkinson"]}]}}