{"wiki_id": "http://www.wikidata.org/entity/Q7613226", "itemLabel": "Steve Madge", "itemDescription": "British ornithologist (1948–2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Madge", "wikipedia_page": {"main": "Steve Madge (15 January 1948 – July 2020) was a birder, author, and bird tour leader, based in Cornwall, England.He was a member of the British Birds Rarities Committee and president of the Cornwall Birdwatching and Preservation Society.\nHe wrote three volumes in the Helm Identification Guides series - on Wildfowl, Crows and Jays and Pheasants, Partridges & Grouse, and co-authored The Handbook of Bird Identification with Mark Beaman.", "link_mentions": [{"page": "Eurasian jay", "response": ["Eight racial groups (33 subspecies in total) were recognised by Steve Madge & Hilary Burn in 1994: "]}, {"page": "Helm Identification Guides", "response": ["* Wildfowl - an identification guide to the ducks, geese and swans of the world by Steve Madge and Hilary Burn (1988) ", "* Crows and Jays - A Guide to the Crows, Jays and Magpies of the World by Steve Madge, illustrated by Hilary Burn (1994) ", "* Pheasants, Partridges and Grouse - a guide to the Pheasants, Partridges, Quails, Grouse, Guineafowl, Buttonquails and Sandgrouse of the World by Steve Madge and Phil MacGowan (2002) "]}, {"page": "S. C. Madge", "response": ["#REDIRECTSteve Madge"]}, {"page": "British Birds Rarities Committee", "response": ["* Steve Madge (1977–88)"]}, {"page": "Madge, Steve", "response": ["#REDIRECT Steve Madge"]}, {"page": "Madge (surname)", "response": ["* Steve Madge, birder, author, and bird tour leader"]}, {"page": "David Nurney", "response": ["Nurney illustrated birds from an early age. In 1981, he received his diploma in communication design (graphics and illustration) at the Epsom School of Art. Besides his work as a graphic designer, he produced identification articles and illustrations of birds which were published in  Birdwatching magazine from 1990 to 2013. From 1992 to 1994, he provided the line drawings to the volumes six to eight of the Handbook of the Birds of Europe, the Middle East and North Africa by Stanley Cramp (1913-1987) and Christopher M. Perrins, which were published in The Birds of the Western Palearctic (BWP) series. In 1993 he illustrated Woodpeckers of the world by Winkler and Christie which was awarded the British Birds Magazine Best Bird book of the year; In 1998 this was followed by Nightjars of the world with Nigel Cleere and  The pocket Guide to Birds of Britain and North West Europe with Chris Kightley and Steve Madge; He also contributed plates to the Birds of Armenia Project.  In 1999, he illustrated a color plate with nightjars in the fifth volume of the Handbook of the Birds of the World. The same year he began working on the Birds of the East Asia by Mark Brazil (2009). In 2000 he began a long collaboration with Les Beletsky on a series of Eco-travel Guides to Brazil, Thailand and others followed by a series of illustrated Bird song anthologies. In 2005 he provided line illustrations for Birds in England by Brown and Grice. Along with long time collaborator and field trip co-leader Dominic Couzens he published a set of ten identification cards in postcard size titled ID Insights Pocket Cards: British Birds, where 131 difficult to identify British bird species are depicted. This was based on articles from Birdwatching magazine which eventually became BIRDS-ID Insights a guide for birding beginners to difficult species- published 2013.", "*Pocket Guide to the Birds of Britain and north-west Europe by Chris Kightley and Steve Madge, 1998 "]}, {"page": "Deaths in July 2020", "response": ["*Steve Madge, 72, English birder and author.Steve Madge 1948 -2020"]}]}}