{"wiki_id": "http://www.wikidata.org/entity/Q7612728", "itemLabel": "Steve Guinan", "itemDescription": "British footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Guinan", "wikipedia_page": {"main": "Stephen Anthony Guinan (born 24 December 1975) is an English former footballer who played as a striker for Nottingham Forest, Greensboro Dynamo, Darlington, Burnley, Crewe Alexandra, Halifax Town, Plymouth Argyle, Scunthorpe United, Cambridge United, Shrewsbury Town, Hereford United, Cheltenham Town, Northampton Town, Forest Green Rovers and Kidderminster Harriers.", "link_mentions": [{"page": "2001–02 Plymouth Argyle F.C. season", "response": ["| 28 March 2002 || FW ||  Steve Guinan || Shrewsbury Town || Free"]}, {"page": "Hereford United F.C.", "response": ["2008–09 saw the club play in the third tier of English football for the first time since 1978.  They rarely placed outside the relegation zone throughout the season, and achieved only 17 points at the halfway point. A 5–0 home win over Oldham Athletic was a rare good result, with top scorer Steve Guinan scoring a hat-trick. Hereford's relegation was confirmed on 18 April 2009, after they recorded 1 win and 11 defeats in a 12 match spell.  Turner subsequently stepped down as manager, paving the way for John Trewick to become manager. However, Trewick did not last a full season after a disappointing campaign and was dismissed on 8 March 2010; and Turner once again took over first team duties on a temporary basis."]}, {"page": "Adam Stansfield", "response": ["On 14 June 2004, Stansfield returned to the Conference with Hereford United, signed by Graham Turner to replace their previous season's top scorer Steve Guinan, who had been sold to Cheltenham Town. He scored 20 goals across the season, including two on 25 March 2005 in a 6–0 win at Farnborough Town. In that match, he came on in the 77th minute for Daniel Carey-Bertram, who had also scored two. Hereford reached the promotion play-offs, where they lost in the semi-finals to Stevenage. In the following season they won promotion by the play-offs, with Stansfield starting in the final on 20 May 2006 at the Walkers Stadium in Leicester, a 3–2 extra-time victory over Halifax Town."]}, {"page": "Richard Keogh", "response": ["He was indeed an ever-present for the next six League and Cup matches, until he was sent off for the first time in his career, receiving a straight red card in a 1–0 defeat to Hereford United on 21 October. He elbowed Hereford striker Steve Guinan and was suspended for three matches. Carlisle were enduring a torrid run of form and manager John Ward feared that the club were being pulled into a relegation dogfight. After winning four of their first five league matches, they had then lost six of their last eight and went on to lose thrice more during Keogh's suspension. After the third loss, a 3–0 defeat at Stockport United, Ward left by mutual consent."]}, {"page": "List of Hereford United F.C. records and statistics", "response": ["* Most Conference goals – Steve Guinan (38)", "* Most Conference goals in a season – Steve Guinan (25 in 2003–04)", "|Steve Guinan"]}, {"page": "History of Hereford United F.C.", "response": ["2004–05 again ended in failure in the play-offs with the club having lost striker Steve Guinan, midfielder Ben Smith, full back Michael Rose and goalkeeper Matt Baker to Football League clubs. This time it was Stevenage Borough who disposed of the Conference runners-up although Hereford only moved into 2nd position on the final day of the season, eventually finishing on 74 points while Barnet were running away with the Conference title. The club did enjoy extended runs in the Football League Trophy and FA Trophy competitions. Another positive was the settling of the CVA in September 2004, the club finally turning the corner financially.", "Hereford's first season back in the Football League saw them beat five of the top eight finishing clubs, as well as higher graded opposition in the cup competitions. The surprise result of the season was a 4–1 win at Lincoln City with Steve Guinan, back on loan, scoring a hat-trick. This lifted the Bulls to 9th in League Two but their remaining thirteen fixtures saw them collect just seven more points, which meant they eventually finished in 16th position."]}, {"page": "List of Hereford United F.C. seasons", "response": ["|Steve Guinan", "|Steve Guinan", "|Steve Guinan"]}, {"page": "2002–03 Football Conference", "response": ["|= ||align=left| Steve Guinan ||align=left| Hereford United ||13||0||0||0||0||13"]}, {"page": "2003–04 Football Conference", "response": ["|2||align=left| Steve Guinan ||align=left| Hereford United || 25 || 0 || 3 || 1 || 0 || 29"]}, {"page": "2007–08 Hereford United F.C. season", "response": ["|align=\"left\"|9||align=\"left\"|FW||align=\"left\"| Steve Guinan", "|  Steve Guinan"]}, {"page": "2006–07 Hereford United F.C. season", "response": ["Two former players, Ben Smith and Steve Guinan, returned to the club in the January transfer window.", "|align=\"left\"|24||align=\"left\"|FW||align=\"left\"| Steve Guinan"]}, {"page": "2008–09 Hereford United F.C. season", "response": ["The top goalscorer of the season is Steve Guinan with 15 goals, all scored in the league. Guinan is the club's longest serving player with 68 goals in 176 appearances. In a cumulative four and a half season spell, he has featured for the club in the Football League, Conference, Play-offs, FA Cup, Football League Cup, Football League Trophy and FA Trophy during his three spells with the club – having been signed twice and loaned once.", "|align=\"left\"| 9 ||align=\"left\"|FW||align=\"left\"| Steve Guinan"]}, {"page": "Stephen Guinan", "response": ["#redirect Steve Guinan"]}, {"page": "2006 Football League Two play-off Final", "response": ["The match was refereed by Paul Taylor in front of 29,196 spectators.  The first half was goalless, during which both sides were forced to make a substitution after both Michael Reddy and Craig Armstrong were injured in an aerial challenge.  On 63 minutes, Cheltenham took the lead after Steve Guinan shot past several defenders.  Seven minutes later, Grant McCann was brought down in the Grimsby penalty area by Curtis Woodhouse and the referee awarded a penalty.  McCann took the spot kick himself, but it was saved by Steve Mildenhall.  The match ended 1–0 and Cheltenham secured promotion to League One.", "Cheltenham Town's opponents in their play-off semi-final were Wycombe Wanderers, with the first match of the two-legged tie taking place at Adams Park in High Wycombe on 13 May 2006.  The visitors took the lead two minutes before half-time when John Finnigan scored from Shane Duff's knockdown.  Steve Guinan doubled their lead in the 75th minute before a close-range volley from Wycombe's Tommy Mooney in the last minute of the match made the final score 2–1 to Cheltenham.  The second leg of the semi-final was held at Whaddon Road in Cheltenham five days later.  The game ended goalless, with Guinan shooting over the Wycombe crossbar from close range in the 70th minute.  Cheltenham progressed to the final with a 2–1 aggregate victory.", "|CF ||9||Steve Guinan || "]}, {"page": "2009–10 Football League Trophy", "response": ["|Steve Guinan"]}, {"page": "Guinan", "response": ["* Steve Guinan (born 1975), English footballer "]}, {"page": "2009–10 Northampton Town F.C. season", "response": ["| 9 || ST || style=\"text-align:left;\" |  Steve Guinan", "| 1 July 2009 || FW ||  || Steve Guinan || Hereford United || Free ||align=\"center\"| Striker Is First New Addition ntfc.co.uk. 26 May 2009. Retrieved 8 January 2010."]}, {"page": "All-time Carolina Dynamo roster", "response": ["*  Steve Guinan*"]}, {"page": "2000–01 Plymouth Argyle F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Steve Guinan                                         ||22||1 ||2||0||2||0||1||0||27||1"]}, {"page": "1996–97 Burnley F.C. season", "response": ["||FW|| Steve Guinan || Nottingham Forest || Loan || 27 March 1997"]}, {"page": "2010–11 Northampton Town F.C. season", "response": ["| 9 || ST || style=\"text-align:left;\" |  Steve Guinan", "| Steve Guinan", "| Steve Guinan"]}, {"page": "A49 derby", "response": ["* Steve Guinan"]}, {"page": "2011 HKFC International Soccer Sevens", "response": ["* Nottingham Forest Mobsters: John Fawcett, Steve Guinan, Darren Heyes, Jon Olav Hjelde, Nigel Jemson, Dean Locke, Des Lyttle, Justin Walker, Darren Wassall, Alan WrightHong Kong Soccer 7s - Nottingham Forest Mobsters squad"]}]}}