{"wiki_id": "http://www.wikidata.org/entity/Q7613699", "itemLabel": "Steve Ravenscroft", "itemDescription": "English rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Ravenscroft", "wikipedia_page": {"main": "Stephen Charles Wood Ravenscroft (born  (1970-11-02) 2 November 1970 in Bradford) is an English former rugby union footballer who played at centre for Saracens and London Welsh. He won two England caps in 1998.\nHe is now a solicitor and plays occasional rugby for the SpoonAAs, formerly Anti-Assassins team, the rugby team of the Wooden Spoon charity.", "link_mentions": [{"page": "Saracens F.C.", "response": ["Close season signings like Danny Grewcock, Roberto Grau, Gavin Johnson and Ryan Constable joined forces with the home grown talent of Tony Diprose, Richard Hill and Steve Ravenscroft to form a side that would prove a significant force during the season losing only three games during the season to finish second in the Premiership, missing out narrowly to Newcastle, another club that had embraced the changes that the professional game had brought. Newcastle haven't repeated this success since."]}, {"page": "Phil Vickery (rugby union)", "response": ["The tour had benefits for some players, bringing through future stars of the England side such as Vickery himself, Jonny Wilkinson, Danny Grewcock, Graham Rowntree, Austin Healey, Matt Dawson and Matt Perry, others effectively had their international careers ended.  Steve Ravenscroft, Rob Fidler, Jos Baxendell, Spencer Brown and Tom Beim each gained two caps on the tour – and have not played for England since.  Richard Pool-Jones, Scott Benton, Dominic Chapman and Stuart Potter only played once for England, on the Tour From Hell."]}, {"page": "Philippe Sella", "response": ["Sella was the linchpin in the midfield where he operated alongside stalwart Steve Ravenscroft. His experience, pace and vision helped Saracens to become a potent force in 1998 and his appetite for defence was amazing."]}, {"page": "Ravenscroft", "response": ["* Steve Ravenscroft (born 1970), rugby player"]}, {"page": "1998 England rugby union tour of Australasia and South Africa", "response": ["Stuart Potter (Leicester Tigers), Dominic Chapman (Richmond), Steve Ravenscroft (Saracens)"]}, {"page": "List of England national rugby union players", "response": ["|1198||Steve Ravenscroft||centre ||1998-06-06||v Australia at Brisbane"]}, {"page": "1997–98 Tetley's Bitter Cup", "response": ["| ||12|| Steve Ravenscroft"]}, {"page": "Ravenscroft, Steve", "response": ["#redirectSteve Ravenscroft"]}]}}