{"wiki_id": "http://www.wikidata.org/entity/Q7614327", "itemLabel": "Steve Wilson", "itemDescription": "British soccer commentator", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Wilson_(football_commentator)", "wikipedia_page": {"main": "Steve Wilson (born 1967) is a British television commentator for football matches who works on the BBC's Match of the Day programme and BT Sport.\n\n", "link_mentions": [{"page": "List of sports announcers", "response": ["* Steve Wilson – BBC Radio 5 Live 1998–2004, 2013–present, BBC Sport 2000–present, Eleven Sports 2018-present"]}, {"page": "Dion Dublin", "response": ["On 20 September 2006, Norwich City announced that Dublin had joined them until the end of the 2006–07 season. It marked a return, almost 20 years after leaving, for Dublin to the club where he began his career. He made his debut on 23 September 2006 when he came on as substitute against Plymouth Argyle. He scored his first competitive goal in Norwich City colours in a 3–3 draw against Queens Park Rangers on 14 October 2006 at Loftus Road. Steve Wilson cited Dublin as the main inspiration behind Norwich's 4–1 FA Cup 3rd Round win at Tamworth, in which the striker scored two goals and set up numerous chances for other teammates."]}, {"page": "Match of the Day", "response": ["Match of the Day uses a selection of BBC and freelance commentators, including: Guy Mowbray, Steve Wilson, Jonathan Pearce, Steve Bower, Simon Brotherton, Conor McNamara, Vicki Sparks, Alistair Mann, Martin Fisher, Mark Scott, John Roder, Chris Wise, Robyn Cowen, Steven Wyeth, and Ben Andrews."]}, {"page": "Steve Wilson", "response": ["* Steve Wilson (jazz musician) (born 1961), American jazz saxophonist and flautist", "* Steve Wilson (drummer), former drummer for Against All Will", "* Steve Wilson (born 1967), Scottish guitarist, member of the Scottish rock band Stiltskin", "* Steve Wilson (producer), Nashville based songwriter, musician and producer of More Beautiful You", "* Steve Wilson (Ohio politician), Ohio state senator", "* Steve Wilson (basketball) (born 1948), American basketball player", "* Steve Wilson (offensive lineman) (born 1954), American NFL player for the Tampa Bay Buccaneers", "* Steve Wilson (defensive back) (born 1957), American NFL player for the Denver Broncos", "* Steve Wilson (baseball) (born 1964), Canadian baseball player", "* Steve Wilson (football commentator) (born 1967), British Match of the Day commentator", "* Steve Wilson (footballer) (born 1974), English goalkeeper", "* Steve Wilson (director), American television director", "* Steve Wilson (presenter) (born 1974), English television presenter", "* Steve Wilson (reporter), American investigative reporter", "* Steve Wilson, character in Angels with Broken Wings"]}, {"page": "Mark Bright", "response": ["After retiring, Bright became a football correspondent on The Big Breakfast and co-presented The Wright Bright Show with former teammate Ian Wright on BBC Radio 5 Live. He also commentates on some international matches, often alongside Jonathan Pearce and Steve Wilson on Match of the Day. He has worked as a sports correspondent for the BBC on BBC London News, Football Focus, Fighting Talk, 5 live Sport, and on Final Score. He has also provided punditry for Match magazine and British Eurosport. In summer 2009, he joined the Crystal Palace academy set-up, along with his former teammate John Salako. He was inducted into the City of Stoke-on-Trent Hall of Fame in 2019. He published his autobiography, My Story - from foster care to footballer, in November 2019."]}, {"page": "BBC Sport", "response": ["The BBC shows highlights of the Premier League on Match of the Day which has been hosted by Gary Lineker since 1999. Match of the Day 2 and Match of the Day 2 Extra, are presented by Mark Chapman. Dan Walker hosts Football Focus every Saturday lunchtime before Jason Mohammad presents Final Score every Saturday afternoon. Pundits for Match of the Day as well as co-commentators include Alan Shearer, Robbie Savage, Chris Sutton, Don Hutchison, Mark Lawrenson, Danny Murphy, Kevin Kilbane, Jermaine Jenas, Martin Keown, Stephen Warnock, Rio Ferdinand, Matthew Upson, Alex Scott, Faye White, Sue Smith, Lucy Ward, Chris Waddle, Cese Fabregas and Ian Wright while commentators include Guy Mowbray, Steve Wilson, Jonathan Pearce, Simon Brotherton, Steve Bower, Dave Woods, Vicki Sparks, Jacqui Oatley, Alistair Mann, Conor McNamara, Dan O'Hagan, Mark Tompkins, Martin Fisher, Gary Bloom, John Roder, Mark Scott, Chris Wise, Robyn Cowen and Steven Wyeth."]}, {"page": "Football Focus", "response": ["As of 2021, presenter Alex Scott is usually joined by the BBC's main football pundits such as Mark Lawrenson, Jermaine Jenas, Martin Keown, Dion Dublin, and Micah Richards. Match of the Day commentators, including Steve Wilson, Guy Mowbray, Jonathan Pearce, and Simon Brotherton often check-in with game previews from the stadiums."]}, {"page": "Jonathan Pearce", "response": ["Pearce joined the BBC's Match of the Day team in 2004. He is one of the BBC's front-line commentators alongside number one commentator Guy Mowbray, Steve Wilson and Simon Brotherton. During his fifteen years with BBC Sport, Pearce has commentated on live games from the FA Cup, League Cup and Championship, as well as covering four World Cups (2006, 2010, 2014 and 2018), four European Championships (2008, 2012, 2016 and 2020) and two Women's World Cups (2015 and 2019)."]}, {"page": "Steve Banyard", "response": ["In 2010, he wrote and produced a football anthem for the England national football team called \"Let's Hear It England\" under the artist name 'Commentators United'. It was published by The Prince's Trust.Commentators United Official Website The song features lines from well-known commentators including Martin Tyler, Clive Tyldesley, Guy Mowbray, Ian Darke, Jon Champion, Rob Hawthorne, Steve Wilson, Peter Drury, Simon Brotherton and the late Peter Brackley. The singing was done by the Cotswold Male Voice Choir. Banyard himself was a member of the choir for 5 years."]}, {"page": "List of FIFA World Cup broadcasters", "response": ["|Guy MowbraySteve WilsonJonathan PearceSteve BowerSimon BrothertonVicki Sparks", "|Guy MowbraySteve WilsonJonathan PearceSimon BrothertonSteve Bower", "|Guy MowbraySteve WilsonJonathan PearceSimon BrothertonSteve Bower", "|John MotsonSteve WilsonSimon BrothertonJonathan PearceGuy Mowbray", "|John MotsonBarry DaviesTony GubbaSteve WilsonRob Maclean"]}, {"page": "Ian Crocker (commentator)", "response": ["Prior to his television career, Crocker commentated for Capital Gold in London, alongside Jonathan Pearce and Steve Wilson (who are both now BBC commentators).  He then spent several years with BRMB Radio in Birmingham commentating on Aston Villa and Birmingham City. During this period, Crocker began providing occasional commentaries for BSkyB. He covered some live Premier League matches during Sky's first season of coverage 1992/93, before joining permanently in 1997.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Steve Wilson (Football commentator)", "response": ["#REDIRECT Steve Wilson (football commentator) "]}, {"page": "List of people with surname Wilson", "response": ["***Steve Wilson (basketball) (born 1948), American basketball player", "***Steve Wilson (offensive lineman) (born 1954), American NFL player for the Tampa Bay Buccaneers", "***Steve Wilson (defensive back) (born 1957), American NFL player for the Denver Broncos", "***Steve Wilson (jazz musician) (born 1961), American jazz saxophonist & flautist", "***Steve Wilson (baseball) (born 1964), Canadian baseball player", "***Steve Wilson (football commentator) (born 1967), British Match of the Day commentator", "***Steve Wilson (footballer) (born 1974), English goalkeeper", "***Steve Wilson (presenter) (born 1974), English television presenter", "***Steve Wilson (director), American television director", "***Steve Wilson (reporter), American investigative reporter", "***Steve Wilson (drummer), drummer for Against All Will"]}, {"page": "List of FIFA Women's World Cup broadcasters", "response": ["|Jonathan PearceSteve Wilson", "|Mark TompkinsJohn RoderKevin KeatingsGary BloomSteve WilsonJacqui Oatley"]}, {"page": "EFL on Quest", "response": ["Commentary comes from the Pitch International world feed commentators, such as Paul Walker, Nigel Adderley, Kevin Keatings, Dan Mason, Jon Champion, Steve Wilson, Dan O'Hagan, John Roder, Chris Sharples, Dave Farrar, Joe Speight, James Fielden, Jon Driscoll, Martin Fisher and Sam Matterface. QUEST also uses their own commentators on certain games, such as Simon Watts, Jonathan Legard, Andy Clarke, and world feed regulars such as Paul Walker, Dan Mason, Chris Sharples and Dan O'Hagan."]}, {"page": "Premier League Productions", "response": ["* Steve Wilson"]}]}}