{"wiki_id": "http://www.wikidata.org/entity/Q7612884", "itemLabel": "Steve Housham", "itemDescription": "English association football player and manager (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Housham", "wikipedia_page": {"main": "Steven James Housham (born 24 February 1976) is an English football manager and former footballer. \nHousham played as a midfielder from 1993 to 2007, notably in the Football League for Scunthorpe United where he was part of the club that triumphed in the 1998/1999 Division Three Play-offs. He moved on to Barrow before finishing his playing career with Brigg Town. He moved into management with Brigg in 2007, before spells with Gainsborough Trinity, North Ferriby United and Lincoln United.", "link_mentions": [{"page": "Lincolnshire", "response": ["* Steve Housham (born 1976), footballer and manager"]}, {"page": "Gainsborough, Lincolnshire", "response": ["*Steve Housham (born 1976), footballer and manager"]}, {"page": "Brian Little", "response": ["On 28 August 2009, Little was appointed manager of Conference North side Gainsborough Trinity. The club had moved to appoint him following the recent dismissal of manager Steve Charles and the resignation of his coaching staff which included formerly appointed caretaker managers Dave Reeves and Steve Blatherwick. However, Little would not take charge of the club's away fixture the following day against Farsley Celtic after it was announced he would not take over from player/caretaker manager Adie Moses until 7 September. Little began building a squad of professionals at Trinity, picking up many players from the Football League and other ex-League players from the Conference National, but despite boasting a large squad of experienced players Trinity narrowly avoided relegation to the Northern Premier League during the 2010–11 season. On 22 August 2011 following one win and two defeats in the opening weeks of the 2011–12 season, Little was sacked as manager of Trinity with Steve Housham taking over as caretaker manager."]}, {"page": "Gainsborough Trinity F.C.", "response": ["|2011–2016||align=left| Steve Housham||||20 August 2011||8 March 2016||201||80||36||85"]}, {"page": "North Ferriby United A.F.C.", "response": ["On 6 June 2016 The Villagers appointed Steve Housham as Manager, Housham was tasked with keeping The Villagers in the National League.", "Steve Housham - \"I am delighted to be given the opportunity to manage in the National League with North Ferriby. My message to the fans is enjoy the ride and be proud that the club are playing at this level of football.\"", "On 22 November 2017 the ownership of the club was transferred from the Foster family to Jamie Waltham. The following day the incoming owner sacked Manager Steve Housham and assistant manager Darryn Stamp due to the previous relegation from the National League and the subsequent run of poor results that left The Villagers rock bottom of the National League North. Housham was replaced as Manager by former captain Chris Bolder."]}, {"page": "Craig Nelthorpe", "response": ["Nelthorpe signed with Conference North club Gainsborough Trinity on 20 June 2011. However, he was released by the club in November alongside defender Rory Coleman, with manager Steve Housham claiming \"they haven't lived up to expectations\". Later that month he turned out for Winterton Rangers of the Northern Counties East League Premier Division. He then signed for Matlock Town of the Northern Premier League Premier Division and made his debut on 3 December 2011 in a 2–2 draw away at Bradford Park Avenue, in which he was substituted after half an hour due to a hamstring injury. He then joined Conference North club Eastwood Town in early March 2012 but stayed less than a month, joining Northern Premier League Division One South club Brigg Town. He left soon after, re-signing for Frickley of the Northern Premier League Premier Division, a club he had played for earlier in his career, in late March 2012. His debut came on 24 March 2012 as a 72nd-minute substitute in a 1–0 defeat at home Marine, and was sent off after nine minutes for a needless challenge on Neil Harvey. Shortly after that appearance, he was released by the club on 3 April 2012."]}, {"page": "Nathan Jarman", "response": ["On 31 May 2019, Jarman was appointed player/assistant manager of Lincoln United, with Steve Housham as manager. The two left the club in March 2020.Steve Housham steps down as Lincoln United manager Lincolnshire Live, 9 March 2020"]}, {"page": "Darryn Stamp", "response": ["Stamp was appointed Steve Housham's assistant at Gainsborough, a role he later took to North Ferriby United before leaving in 2017."]}, {"page": "Matt Sparrow", "response": ["Sparrow made his 300th appearance for Scunthorpe in April 2009, and subsequently played in a testimonial match which took take place on 1 May. Former Scunthorpe striker Billy Sharp and veteran midfielder Peter Beagrie returned for the match. Also involved were Jack Cork, Alex Calvo Garcia, Jamie McCombe, Jamie Forrester, John Eyre, Lee Ridley, Paul Wilson, Steve Housham, Andy Butler, Mark Jackson, Martin Carruthers, Steve Torpey, Lee Hodges, Paul Harsley, Wayne Graves, Lee Turnbull, Tony Daws, Andy Crosby, Ian Baraclough, Cleveland Taylor, Chris Hope, Kevin Sharp, Kevin Pressman, Paul Musselwhite, Justin Walker, Ross Hyslop, Brian Quailey, Sam Beagrie, Des Comerford and Simon Elliott – plus managers Brian Laws and Nigel Adkins."]}, {"page": "Andy Pettinger", "response": ["In May 2011 he joined Brian Little's  Conference North side Gainsborough Trinity bringing him to the club as understudy to Phil Barnes several weeks after his former Brigg manager Steve Housham had been appointed as Trinity's new youth team manager. Pettinger served as the second choice keeper under Barnes during the 2011–12 season, and briefly replaced him until himself was sidelined with an injury that ruled him out for the remainder of the season. At the end of the 2011–12 season he left Trinity to concentrate on his part-time coaching work with Scunthorpe United youth academy. After one year out of the game, Pettinger returned to playing by signing for Brigg at the start of the 2013–14 season where he remained until the summer of 2015."]}, {"page": "Dominic Roma", "response": ["Following the sacking of Steve Housham by Gainsborough Trinity on 10 March 2016, it was announced that Roma would take on the role of interim manager until the end of the season. His first game in charge of Trinity was a 1–0 victory over Nuneaton Town on 12 March."]}, {"page": "Levi Reid", "response": ["On 3 January 2012, he joined Conference North side Gainsborough Trinity. Steve Housham's side qualified for the play-offs with a fourth-place finish in 2011–12, but lost 1–0 to Nuneaton Town in the final. Reid was not amongst those players retained at the end of the season and thus departed The Northolme. He joined up with Stafford Rangers, now of the Northern Premier League, for a third time in October 2012. The club finished 15th in 2012–13, before being relegated at the end of the 2013–14 season. Rangers ended the 2014–15 season outside the Division One South play-offs on goal difference. They won promotion as champions in the 2015–16 season, and Reid was voted Players' Player of the Year and Directors' Player of the Year. He made his 250th appearance for the club in January 2017. Rangers finished 13th in the Northern Premier League Premier Division in 2016–17 and then 14th in 2017–18."]}, {"page": "Matt Godden", "response": ["Several injuries kept Godden out of action for a number of months and he did not play for Scunthorpe during the first half of the 2011–12 season. In March 2012, having not played any football for over a year, Godden joined Conference North club Gainsborough Trinity on a one-month loan agreement. The move meant he joined up with manager Steve Housham, who had managed Godden during his brief loan spell at Brigg Town two-and-a-half years earlier. Godden made his Gainsborough debut a day after signing, on 10 March 2011, coming on as a 58th minute substitute and scoring two minutes later in a 3–2 victory against Nuneaton Town at The Northolme. Godden made eight appearances during the loan spell, scoring twice, his other goal coming as Gainsborough secured a 2–0 win over Eastwood Town on 24 March 2012. He returned to Scunthorpe upon the expiry of the loan deal on 9 April 2012, and made his first appearance for the club in a year-and-a-half when he came on as a late substitute in Scunthorpe's last game of the season, a 1–1 away draw with Tranmere Rovers on 5 May 2012."]}, {"page": "Dimitar Evtimov", "response": ["Evtimov signed for English club Nottingham Forest in April 2011.Varney, Alex (19 April 2011) Nottingham Forest agree deal to sign highly rated Bulgarian keeper. talkSPORT. Retrieved on 21 April 2014. He spent a brief time on loan at Ilkeston, before he joined Gainsborough Trinity in the Conference North on a one-month loan on 10 November 2011. He played three matches in the space of a week for Steve Housham's \"Holy Blues\", before losing his first-team place at The Northolme. He was named as the Championship Apprentice of the Year for the 2012–13 season. On 16 July 2013, he joined Conference Premier club Nuneaton Town on a three-month loan deal. He made four appearances during his stay at Liberty Way. He made his first-team debut for Forest on 21 April 2014, coming on as a late substitute for the injured Dorus de Vries in a 2–0 win at Leeds United.BBC Sport – Leeds United 0–2 Nottingham Forest. Bbc.co.uk (2 August 2013). Retrieved on 21 April 2014. He signed a new two-year contract with the club three months later after new manager Stuart Pearce was told by caretaker-manager Gary Brazil that he was a good prospect."]}, {"page": "Steven James Housham", "response": ["#REDIRECT Steve Housham"]}, {"page": "Housham, Steve", "response": ["#redirectSteve Housham"]}]}}