{"wiki_id": "http://www.wikidata.org/entity/Q7614224", "itemLabel": "Steve Walters", "itemDescription": "English footballer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Walters_(footballer)", "wikipedia_page": {"main": "Steve Walters (born 9 January 1972) is an English former footballer who played in the Football League for Crewe Alexandra and in the Football Conference for Northwich Victoria, Morecambe and Stevenage Borough. He was a midfielder.", "link_mentions": [{"page": "Crewe Alexandra F.C.", "response": ["Under Gradi, and despite some Crewe fans' initial reservations,Crisp, p.9 Crewe played attractive, technical football and gained a reputation for developing young talent. Steve Walters became Crewe's youngest player, aged just 16 years and 119 days when he played against Peterborough United on 7 May 1988.Crisp, p.119. In 1989, Crewe won their third promotion, a 1–1 draw at Tranmere Rovers enough to take both teams into the Third Division.Hornbrook, pp.47–48. Meanwhile, on 7 January 1989, Crewe had hosted Aston Villa—and Platt—at Gresty Road in the FA Cup third round, taking a 2–0 lead before the visitors rallied to secure a 3–2 win,Crisp, p.120.Hornbrook, pp.46. with Platt netting the winner but refusing to celebrate against his former club.Morris, p.233. A year later, on 6 January 1990, Crewe were again drawn away at Chelsea in the third round; Walters gave Crewe a first-half lead at Stamford Bridge before Chelsea equalised in the 82nd minute to force a replay which they won 2–0.Crisp, p.121.Hornbrook, pp.51–52. In March 1990, Crewe defender Paul Edwards was sold to Coventry City for £350,000; he was later named in the 1989-1990 Third Division PFA Team of the Year, Crewe's first player to feature in the awards.", "On 16 November 2016, former Crewe defender Andy Woodward revealed that he had been the victim of child sexual abuse by former football coach Barry Bennell (convicted as a paedophile in the US in 1994) at the club in the 1980s. By the time club chairman John Bowler responded to the revelations, on Monday 21 November, six other individuals had contacted the police, with Woodward's Crewe teammate Steve Walters alleging he was another of Bennell's victims. Woodward criticised Crewe for failing to apologise. On 27 November 2016, a third former Crewe player, Anthony Hughes, revealed that he too had been abused by Bennell, as did Crewe trainee, later Wimbledon and Northern Ireland international Mark Williams.", "Bennell was tried at Liverpool Crown Court in early 2018, and convicted of 50 offences of sexual abuse against 12 boys (and on 20 February 2018 was sentenced to 30 years in prison). After the guilty verdicts on 15 February, victims including Andy Woodward and Steve Walters read statements outside court. Crewe Alexandra expressed its \"deepest sympathies\" to Bennell's victims, saying it was not aware of any sexual abuse by Bennell nor had it received any complaint about sexual abuse by him before or during his employment with the club, though this has been disputed."]}, {"page": "Dario Gradi", "response": ["On 16 November 2016, former Crewe defender Andy Woodward revealed that he had been the victim of child sexual abuse by former football coach Barry Bennell (convicted in 1998) at the club in the 1980s. Subsequently, six other individuals contacted the police, and on 22 November, The Guardian reported that Crewe teammate Steve Walters had been another of Bennell's victims. As Gradi had been manager at the time of the abuse, and as one attack was reported to have taken place at Gradi's home but without his knowledge, Gradi was pressed to \"say more about what he knew and when.\" On 24 November, Gradi released a statement saying he knew nothing of Bennell's crimes:"]}, {"page": "Neil Lennon", "response": ["While a young player at Crewe, Lennon was a friend of Andy Woodward and Steve Walters, both of whom were victims of sexual abuse by coach Barry Bennell. After Bennell's 2018 conviction, Lennon spoke of his regret at not being aware of the abuse at the time."]}, {"page": "Reactive arthritis", "response": ["* Steve Walters, football player and victim of sexual abuse by football trainer Barry Bennell"]}, {"page": "Walters (surname)", "response": ["* Steve Walters (born 1965), Australian rugby league player", "* Steve Walters (footballer) (born 1972), English footballer"]}, {"page": "List of Crewe Alexandra F.C. records and statistics", "response": ["* Youngest first-team player - Steve Walters, 16 years 119 days (vs Peterborough United, 6 May 1988)"]}, {"page": "1993 Football League Third Division play-off Final", "response": ["Crewe Alexandra faced Walsall in the other semi-final with the first leg being held at Gresty Road in Crewe on 16 May 1993.  In the 19th minute, Tony Naylor opened the scoring with a right-footed strike into the top-left corner of the Walsall goal.  Seven minutes before half-time, a cross from Charlie Ntamark evaded Crewe defender Gus Wilson and was rolled into the Crewe goal by Mike Cecere to equalise for Walsall.  Within a minute, Crewe retook the lead when a cross-field pass from Rob Edwards found Naylor who hit the ball beyond Mark Gayle to make it 2–1.  Phil Clarkson extended Crewe's lead four minutes into the second half when he shot from close range after intercepting a Gareth Whalley backpass.  A minute later Ashley Ward passed to Edwards who scored to make it 4–1.  In the 84th minute, Naylor relayed Clarkson's pass to Ward who scored to make the final score 5–1.  The second leg was played three days later at the Bescot Stadium in Walsall.  Wayne Clarke gave the home side the lead in the 18th minute from their first corner but Crewe equalised in the 31st minute: Gayle saved an angled strike from Chris Marsh but the ball fell to Naylor who scored.  Three minutes before half-time, Naylor scored his second after running onto a pass from Steve Walters and shooting from around .  With thirteen minutes of the match remaining, Naylor's shot from the left touchline struck the Walsall crossbar and Ward converted to make it 3–1.  Martin O'Connor reduced the deficit the following minute with a  strike but Naylor scored his third in the 88th minute and the match ended 4–2 to Crewe who progressed to the final with a 9–3 aggregate victory.", "The match kicked off around 2:30p.m. on 29 May 1993 at Wembley Stadium in front of a crowd of 22,416.  Dave McKearney saw an early chance to score go wide of the York goal before Crewe goalkeeper Mark Smith held a shot from Jon McCarthy.  Steve Walters then struck a shot after interplay between Naylor and Ward, but Kiely caught the ball.  Mark Smith then caught a header from Ian Blackstone following a cross from Paul Atkin, before denying a cross-cum-shot from Barnes.   A mistake from Crewe's Neil Lennon allowed Tony Canham to shoot from the edge of the penalty area but the attempt went over the crossbar.  Swann then struck the ball over the Crewe goal before York's Wayne Hall prevented Ward from shooting.  Towards the end of the first half, Crewe's Shaun Smith's  strike went wide of the goal before Barnes struck an off-target shot.  The half ended 0–0.", "|RM ||10||Steve Walters || || "]}, {"page": "Crewe Alexandra F.C. Academy", "response": ["* Steve Walters"]}, {"page": "United Kingdom football sexual abuse scandal", "response": ["On 22 November, The Guardian alleged that Crewe teammate Steve Walters had been another of Bennell's victims, while Woodward criticised Crewe for failing to apologise. On 24 November, Dario Gradi, manager at Crewe during the early 1980s, released a statement saying he knew nothing of Bennell's crimes until Bennell was arrested in the United States in 1994.", "After the guilty verdicts, victims Andy Woodward, Micky Fallon, Chris Unsworth and Steve Walters read statements outside Liverpool Crown Court; another victim, Gary Cliffe (now a serving police officer investigating child abuse), waived his anonymity to speak about the abuse he had experienced, aged 11 to 15, from Bennell while at Manchester City. The club offered its \"heartfelt sympathy to all victims for the unimaginably traumatic experiences they have endured\", and said an internal review had identified serious allegations of child sex abuse in respect of a second man, John Broome (now dead), with \"potential historic connections to the club\". Crewe Alexandra expressed its \"deepest sympathies\" to Bennell's victims, saying it was not aware of any sexual abuse by Bennell nor had it received any complaint about sexual abuse by him before or during his employment with the club. This claim has been disputed: the Guardian alleged Bennell had to leave Crewe following a complaint against him, having been identified as a risk long before joining Crewe, amid a cover-up at Manchester City. Lord Carlile, the barrister who prosecuted Bennell in 1998, accused Crewe of 'brushing the scandal under the carpet'.", "On 25 February 2019, The Guardian reported on a nine-page statement from Crewe manager Dario Gradi about what he knew regarding Bennell. Gradi admitted to encouraging a close player-coach culture and to not making detailed background checks about Bennell because Crewe was trying to poach him from Manchester City \"on the quiet\". Club chairman John Bowler said Crewe had not appreciated the dangers of football being used as a means for a paedophile to prey on young boys (\"documented procedures that are now in place for the protection of minors were not in place at that time\"), while Gradi had not made detailed inquiries into Bennell's background (\"He did not have any specific coaching qualifications but none were required and at the time the FA did not publish any guidance on child protection”). However, former club secretary Gill Palin had been uncomfortable about Bennell. Three days later, Steve Walters accused Crewe of showing \"no humanity\" and \"victim blaming\" in a bid to avoid compensation payouts, and of claiming Walters had waited too long to report abuse. The club said Walters's claims included (unspecified) \"fundamental inaccuracies\". Walters and at least one other former Crewe player have each launched High Court damages claims of upwards of £200,000 against the club.", "Eight days after Woodward's initial revelations, the PFA said on 24 November 2016 that the number of players who had contacted it with similar stories had reached double figures, later (27 November) revising this to \"more than 20\" and adding Blackpool and Leeds United to the list of clubs implicated. In January 2017, it was reported that Steve Walters had been on a course of counselling at the Priory provided by the PFA.", "In Manchester on 5 December 2016, abuse victims Andy Woodward, Steve Walters, Chris Unsworth, Matthew Monaghan and Mark Williams launched a support organisation, the Offside Trust, to support player victims of abuse and their families (though it is unclear if this body is to become a registered charity). At the launch, the Trust's lawyer Ed Smethurst talked of alleged abusers still working \"in the senior echelons\" of football, of \"grave misgivings about the FA's independent inquiry\", and of new claims that clubs had paid 'hush money'. On 3 February 2017, it was announced that Woodward was stepping away from the Trust, having resigned as a director. On 20 August 2017, a celebrity football match was played at Curzon Ashton F.C. in Manchester to raise funds for the Trust."]}, {"page": "Steve Walters (disambiguation)", "response": ["Steve Walters (born 1965) is an Australian rugby league player.", "*Steve Walters (footballer) (born 1972), English footballer", "*Steve Walters (rugby league played 1988) (born 1967), Australian rugby league player associated with Newcastle Knights"]}, {"page": "Sexual abuse cases at Crewe Alexandra F.C.", "response": ["Club chairman John Bowler finally responded to the revelations on Monday 21 November, by which time it was reported that six other individuals had contacted the police, and that the Football Association was setting up a helpline. On 22 November, the Guardian reported that Crewe team mate Steve Walters had been another of Bennell's victims, while Woodward criticised Crewe for failing to apologise:", "Bennell was tried at Liverpool Crown Court in early 2018, and convicted of 50 offences of sexual abuse against 12 boys (and on 20 February 2018 was sentenced to 30 years in prison). After the guilty verdicts on 15 February, victims including Andy Woodward and Steve Walters read statements outside court. Crewe Alexandra expressed its \"deepest sympathies\" to Bennell's victims, saying it was not aware of any sexual abuse by Bennell nor had it received any complaint about sexual abuse by him before or during his employment with the club. This has been disputed: the Guardian said Bennell had to leave Crewe following a complaint against him, having been identified as a risk long before joining Crewe, amid a cover-up at Manchester City. Lord Carlile, the barrister who prosecuted Bennell in 1998, accused Crewe of 'brushing the scandal under the carpet'.", "On 25 February 2019, the Guardian reported on a nine-page statement from Gradi about what he knew regarding Bennell. Gradi admitted to encouraging a close player-coach culture and to not making detailed background checks about Bennell because Crewe was trying to poach him from Manchester City \"on the quiet\". Club chairman John Bowler said Crewe had not appreciated the dangers of football being used as a means for a paedophile to prey on young boys (\"documented procedures that are now in place for the protection of minors were not in place at that time\"), while Gradi had not made detailed inquiries into Bennell's background (\"He did not have any specific coaching qualifications but none were required and at the time the FA did not publish any guidance on child protection”). However, former club secretary Gill Palin had been uncomfortable about Bennell. Three days later, Steve Walters accused Crewe of showing \"no humanity\" and \"victim blaming\" in a bid to avoid compensation payouts, and of claiming Walters had waited too long to report abuse. The club said Walters's claims included (unspecified) \"fundamental inaccuracies\". Walters and at least one other former Crewe player have each launched High Court damages claims of upwards of £200,000 against the club.", "Following Bowler's resignation, on 29 March 2021 acting chairman Charles Grant said the club wanted to \"engage with survivors\" and learn from the \"very painful lessons\" of the scandal, saying \"I would like to learn, from the football club's point of view, what it is we can do with survivor groups, with individuals, to try and make reparations, in some small part.\" A number of victims (\"in 'double figures'\") subsequently met with Crewe Alexandra directors and staff; Steve Walters was the first to visit and was said have felt welcomed back to the club and \"not bitter any more\"."]}]}}