{"wiki_id": "http://www.wikidata.org/entity/Q7613485", "itemLabel": "Steve O'Connell", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_O%27Connell", "wikipedia_page": {"main": "Cllr Stephen O'Connell, AM (born 9 September 1956), known as Steve O'Connell, is a British Conservative politician. He was a member of the London Assembly for Croydon and Sutton from 2008 until 2021 and a councillor in Croydon for Kenley Ward from 2002 until 2021.\nO'Connell grew up in South London and attended Brockley County Grammar School. He qualified as a mortgage broker and financial advisor and worked in banking, including 28 years at Barclays Bank as well as at HSBC and NatWest. He was first elected to Croydon Council in 2002 for Kenley Ward. He served as Deputy Leader of the Conservative Group and when his party took control of the Council in 2006 he became Deputy Leader with responsibility for safety and cohesion. \nHe was elected to the London Assembly in May 2008. He kept his position in Croydon Council's cabinet but stepped down as Deputy Leader. He was a member of the Metropolitan Police Authority. After its abolition, he was appointed an adviser to Stephen Greenhalgh the Deputy Mayor for Policing and Crime, in the Mayor's Office for Policing and Crime.He retired from the London Assembly and stood down from Croydon Council in 2021.\n\n", "link_mentions": [{"page": "Crystal Palace, London", "response": ["| Steve O'Connell"]}, {"page": "London Borough of Sutton", "response": ["As the London Assembly has eleven London-wide members from all four main parties, the borough shares its geographical London Assembly member with neighbouring Croydon, in its elections which began in 2000 and take place with the election of the Mayor of London, a Conservative Assembly member has gained a large majority (in other words it is arguably a safe seat). The current Assembly Member is Steve O'Connell, then a local councillor from Croydon, who was elected with an increased share of the vote of 43% following fellow conservative Andrew Pelling's time representing the area. "]}, {"page": "List of London Assembly constituencies", "response": ["|rowspan=\"3\"| Steve O'Connell(Con)"]}, {"page": "Croydon and Sutton (London Assembly constituency)", "response": ["| Steve O'Connell"]}, {"page": "2008 London Assembly election", "response": ["* Steve O'Connell (Conservative Party, Croydon and Sutton)"]}, {"page": "Stephen O'Connell", "response": ["#REDIRECT Steve O'Connell"]}, {"page": "2010 Croydon London Borough Council election", "response": ["| style=\"background:#3333cc; color:white\" |Steve O'Connell (Con)"]}, {"page": "2012 London Assembly election", "response": ["| style=\"background:#aacfff\" |Steve O'Connell (I)(60,152, 1st)"]}, {"page": "2014 Croydon London Borough Council election", "response": ["| style=\"background:#3333cc; color:white\" |Steve O'Connell (Con)"]}, {"page": "2016 London Assembly election", "response": ["| style=\"background:#aacfff\"|Steve O'Connell (I)(70,156, 1st)"]}, {"page": "Erlam v Rahman", "response": ["In response to the Metropolitan Police decision not to bring charges against Lutfur Rahman, Chair of the London Assembly Police and Crime Committee Steve O'Connell made a formal request to Deputy Mayor for Policing and Crime Sophie Linden for an investigation by Her Majesty's Inspectorate of Constabulary on the Metropolitan Police activities surrounding the 2014 mayoral election, a request Linden granted. The Metropolitan Police subsequently announced a fresh investigation into alleged electoral fraud in the London Borough of Tower Hamlets."]}, {"page": "2021 London Assembly election", "response": ["* Steve O'Connell, Conservative Assembly Member for Croydon and Sutton constituency"]}, {"page": "O'Connell, Steve", "response": ["#redirectSteve O'Connell"]}, {"page": "List of American films of 2021", "response": ["| The Killing of Kenneth Chamberlain || Gravitas Ventures || David Midell (director/screenplay); Frankie Faison, Steve O'Connell, Enrico Natale, Ben Marten, LaRoyce Hawkins, Anika Noni Rose || "]}, {"page": "Endorsements in the 2019 Conservative Party leadership election", "response": ["*Steve O'Connell, Member of the London Assembly for Croydon and Sutton since 2008"]}, {"page": "The Killing of Kenneth Chamberlain", "response": ["*Steve O'Connell as Sergeant Parks"]}, {"page": "2022 Croydon London Borough Council election", "response": ["In October 2020, after it became clear that the council was facing financial difficulty, the council leader Tony Newman resigned. The Labour councillor Hamida Ali was chosen by the council's Labour group to replace him. Ali established a new cabinet without Newman, Newman's finance lead Simon Hall who had also resigned, and the sitting cabinet members Stuart Collins, Alison Butler and Paul Scott. In November 2020, Croydon council announced its \"de facto bankruptcy\" by issuing two section 114 notices. In February 2021, Newman and  Hall were suspended from the Labour party after a report was produced into their conduct in the lead-up to the effective bankruptcy of the council. In March, they both resigned from the council. A Labour councillor for South Norwood, Jane Avis, resigned for personal reasons in March 2021. A Conservative councillor for Kenley, Steve O'Connell, resigned in March 2021 ahead of the 2021 London Assembly election in which he was also standing down as an Assembly Member. A Conservative councillor for Park Hill & Whitgift, Vidhi Mohan, resigned at the same time \"due to increasing demands in [his] professional life\"."]}]}}