{"wiki_id": "http://www.wikidata.org/entity/Q7610900", "itemLabel": "Stephen Yates", "itemDescription": "English cricketer (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Yates", "wikipedia_page": {"main": "Stephen Colin Yates (born 30 August 1951) is a former English cricketer.  Yates was a right-handed batsman.  He was born in Manchester, Lancashire.\nYates made his debut for Cheshire in the 1983 Minor Counties Championship against Shropshire.  Yates played Minor counties cricket for Cheshire from 1983 to 1986, including 30 Minor Counties Championship matches and 10 MCCA Knockout Trophy matches.  In 1985, he made his List A debut against Yorkshire in the NatWest Trophy.  He a further List A match for Cheshire, against Surrey in 1986.  In his two List A matches, he scored 26 runs at a batting average of 13.00, with a high score of 20.", "link_mentions": [{"page": "Guiding Light (1980–1989)", "response": ["* Ben McFarren (Stephen Yates), written out in November 1982."]}, {"page": "Republicans Overseas", "response": ["* Stephen Yates - Idaho Republican Party chairman; past Deputy National Security Adviser to the Vice President; presidential campaign advisor; DC International Advisory CEO"]}, {"page": "Rita Stapleton", "response": ["Eventually, Ed got over his anger and he and Rita reconnected. He grew closer to Rita, during a period where she had to contend with an apparent stalker, who pushed Rita down a flight of stairs, tampered with her brakes and attempted to set her apartment on fire (trapping Rita's then blind sister Eve (Janet Grey) in the burning apartment). Ultimately, the stalker was revealed to be Georgene Granger (Delphi Harrington), Cyrus Granger's deranged daughter-in-law, who held Rita and Eve at gunpoint in their apartment building laundry room, during which time she confessed that it was in fact she who had murdered Cyrus (She was trying to prevent her father-in-law from changing his will to include Rita, unaware that he had in fact already done so), and that she was also indirectly responsible for the death of her husband Malcolm (she snuck into his room at Cedars and began berating him over her incorrect presumption that he and Rita had had an affair, causing him to have a fatal heart attack). By this time, Ed, along with Eve's fiance Ben McFerren (Stephen Yates) and Springfield Police Chief Larry Wyatt had pieced together that Georgene was the stalker, and were tipped off that she was holding Rita and Eve at gunpoint. Ed and Ben showed up at the laundry room just in time to rescue Rita and Eve, overhearing Georgene's confession. With Georgene arrested, Ed and Rita became engaged. However, before they were married, Roger appeared at Rita's apartment, angry over how providing an alibi for her during her murder trial had cost him his own marriage. Becoming increasingly enraged, he raped Rita. Afraid that no one would believe her, Rita remained silent. She and Ed married in November 1978. A few months later, Roger also raped Holly and Rita became overcome with guilt at having not come forward herself. Holly did press charges, and when it looked like Roger would be acquitted, Rita finally revealed that Roger had raped her too. However, at the same time this was happening, Holly was pointing a gun at Roger and, in a moment of post-traumatic stress, shot him. She was convicted of the murder (despite the extenuating circumstances) and Ed came to resent Rita for not telling him about the rape, causing a strain in their marriage."]}, {"page": "Steve Yates", "response": ["* Stephen Yates (born 1951), English cricketer"]}, {"page": "Yates, Stephen", "response": ["#redirectStephen Yates"]}, {"page": "List of Cheshire County Cricket Club List A players", "response": ["*Stephen Yates (1985–1986): SC Yates"]}]}}