{"wiki_id": "http://www.wikidata.org/entity/Q7611677", "itemLabel": "Steuart Bayley", "itemDescription": "British colonial governor", "wikipedia_url": "https://en.wikipedia.org/wiki/Steuart_Bayley", "wikipedia_page": {"main": "Sir Steuart Colvin Bayley  (26 November 1836 – 3 June 1925) was a British civil servant and Lieutenant-Governor of Bengal from 1887 to 1890.", "link_mentions": [{"page": "William Butterworth Bayley", "response": ["He was the father of Steuart Bayley.", "He was essentially an official, and a typical official of the school that Wellesley had trained to be not only able in emergencies, but steady and industrious in official work. That he received no distinction for his services was due to his own unassuming modesty, but he bequeathed the traditions of his ability in India to two able Indian administrators, his nephew, Sir Edward Clive Bayley, formerly a member of the supreme council, and his son, Sir Steuart Bayley, at one time chief commissioner of Assam. His grandson, Charles Stuart Bayley, son of Daniel Bayley, was born in March 1854. He was the Lieutenant governor of East Bengal and Assam from 1911 to 1912."]}, {"page": "List of rulers of Bengal", "response": ["* Steuart Bayley 1879–1882", "* Sir Steuart Bayley 1887–1890"]}, {"page": "Sir Steuart Bayley", "response": ["#REDIRECT Steuart Bayley"]}, {"page": "Patna Golf Club", "response": ["The Patna Golf Club was established on  21 March 1916. The land originally belonged to the government of Bihar and Orissa, and was leased to the South Bihar Gymkhana Club.  The club was formed by Steuart Bayley, among others, who later became the Governor of Bihar. It has hosted many national championships from 1916. The membership requires 2-3 lakhs rupee per head for lifetime."]}, {"page": "Steuart", "response": ["*Steuart Bayley (1836–1925), British civil servant and Lieutenant-Governor of Bengal  1879–1882"]}, {"page": "March 1916", "response": ["* British civil servant Steuart Bayley opened the  Patna Golf Club in Patna, India, becoming one of the venues for national golfing champions in India."]}, {"page": "Indian Association for the Cultivation of Science", "response": ["*Sir Steuart Bayley (1887-1890)"]}, {"page": "Charles Alfred Elliott", "response": ["This work completed, Elliott became for a few months census commissioner for the first decennial census for 1881 which followed the imperfect enumeration of 1872. In March 1881 he became chief commissioner of Assam, and in Feb. 1886 was entrusted with the unpopular task of presiding over a committee appointed to inquire into public expenditure throughout India, and report on economies. A falling exchange and a heavy bill for war operations compelled Lord Dufferin to apply the shears to provincial expenditure, and while the committee inevitably withdrew funds needed by the local governments, it was generally recognised that immense pains were taken by Elliott and his colleagues. Elliott, who had been made C.S.I. in 1878, was promoted K.C.S.I. in 1887, and from 6 January 1888 to 17 December 1890 he was a member successively of Lord Dufferin's and then of Lord Lansdowne's executive councils. On the retirement of Sir Steuart Bayley, Elliott, although he had never served in Bengal, became lieutenant-governor of that province, holding the post, save for a short leave in 1893, until 18 Dec. 1895. The greatest service which Elliott rendered to Bengal was the prosecution of the survey and the compilation of the record of rights in Bihar, carried out in spite of much opposition from the zemindars, opposition that received some support from Lord Randolph Churchill. Sir Antony MacDonnell's views as to the maintenance of the record were not in harmony with those of Elliott, but Lord Lansdowne intervened to reduce the controversy to its proper dimensions. Public opinion has finally endorsed the opinion expressed by Mr. C. E. Buckland in Bengal under the Lieutenant-Governors (1901), that \"there was not another man in India who could have done the settlement work he did in Bihar and Bengal, so much of it and so well.\" In his zeal for the public service Elliott courageously faced unpopularity. Economy as well as efficiency were his principles of government. Towards the native press he took a firm attitude, prosecuting the editor and manager of the Bangobasi for sedition in the teeth of hostile criticism. He was inclined to establish a press bureau, but Lord Lansdowne's government did not sanction his proposals. With the distressed Eurasian community he showed generous sympathy, and, always on the watch for the well-being of the masses he pushed on sanitary and medical measures, being largely instrumental in the widespread distribution of quinine as a remedy against fever. In foreign affairs he was impatient of Chinese delays in the delimitation of the frontiers of Tibet and Sikkim, and urged Lord Elgin to occupy the Chambi Valley (19 November 1895), and even to annex it."]}, {"page": "Stuart Colvin Bayley", "response": ["#REDIRECT Steuart Bayley"]}, {"page": "Jorehaut Provincial Railway", "response": ["In 1885, a narrow gauge train services Jorehaut Provincial Railway had come into operation and ultimately became instrumental in the rapid growth of the tea industry. The first railway junction in Assam was Makum Junction on the Dibru-Sadiya Railway (DSR) line, and the second junction was Cinnamara of the Jorehaut Provincial Railway (JPR). The former railway line had proven its practicability. The chief commissioner of Assam, Steuart Bayley, was so enthralled by the Darjeeling Himalayan Railway (DHR), that he authorized the construction of a railway line in Jorehat in 1882 at an estimated cost of 111,320 Indian Rupees. This cost was to be paid from the provincial revenues of Assam without obtaining the sanction of the Government of India."]}]}}