{"wiki_id": "http://www.wikidata.org/entity/Q7614130", "itemLabel": "Steve Thornber", "itemDescription": "English footballer (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Thornber", "wikipedia_page": {"main": "Stephen John Thornber (born 11 October 1965) is an English former professional footballer and current youth team manager of Bradford City.Thornber, a midfielder, began his career as a junior with Halifax Town in 1983. He remained with the Shaymen for five years, making 104 league appearances and scoring four goals.\nIn 1988, he moved to Swansea City in a £10,000 deal. In three years at the Welsh club he made 117 appearances, scoring six goals.\nHis next move, in 1992, was to Blackpool, then managed by Billy Ayre, a former teammate and manager of Thornber during his time at Halifax. After a year and just under a quarter-century of appearances at Bloomfield Road, he joined Scunthorpe United on a free transfer.", "link_mentions": [{"page": "Rotherham United F.C.", "response": ["|Steve Thornber (Caretaker)"]}, {"page": "History of Rotherham United F.C.", "response": ["It was announced that Mark Robins was in talks with the Millers' South Yorkshire neighbours Barnsley on 3 September. Following this announcement, Chairman Tony Stewart relieved Robins of his managerial duties, placing him on 'Gardening Leave'. Assistant manager John Breckin took charge of the team overseeing their 3–1 win over Chesterfield, moving the Millers to top of the league. However, that evening Barnsley FC requested to speak with Breckin, along with first-team coach Steve Taylor and fitness coach Nick Daws, with regards to following Mark Robins to Oakwell. All 3 accepted, and were subsequently placed on gardening leave along with Robins. An announcement was set to be made at 2.15pm on Monday 7 September to unveil Robins as the new manager of Barnsley, however talks stalled due to a disagreement over compensation. All is fair in love, war and appointing football managers? Mark finally left the millers on Wednesday 9 September, having signed a contract with Barnsley the previous evening, leaving Steve Thornber in temporary charge. The Millers drew their first two matches under Thornber's charge."]}, {"page": "Thornber, Steve", "response": ["#redirectSteve Thornber"]}, {"page": "Thornber", "response": ["*Steve Thornber (born 1965), British footballer"]}]}}