{"wiki_id": "http://www.wikidata.org/entity/Q7614619", "itemLabel": "Steven Dante", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Dante", "wikipedia_page": {"main": "Steven Dante (stage name of Steven Barrington Dennis) is a British soul singer and songwriter, who had several singles released in the 1980s on the Cooltempo label. His only solo album, Find Out, was released on Chrysalis in 1988.  It peaked at #87 in the UK Albums Chart in September 1988. He has also collaborated with several house producers, providing vocals for John \"Jellybean\" Benitez, D Mob and Lighthouse Family. \"The Real Thing\", released in 1987 with Jellybean, reached #13 on the UK Singles Chart, and was a US Billboard Hot Dance Club Play chart number-one single. It was included on Jellybean's album Just Visiting This Planet.\nDante also wrote songs for Total Contrast and By All Means, and sang backing vocals for Shara Nelson.", "link_mentions": [{"page": "John Benitez", "response": ["! scope=\"row\"| \"The Real Thing\" (featuring Steven Dante)"]}, {"page": "List of number-one dance singles of 1987 (U.S.)", "response": ["|Jellybean featuring Steven Dante"]}, {"page": "List of artists who reached number one on the U.S. Dance Club Songs chart", "response": ["* Steven Dante (1)"]}, {"page": "Monte Moir", "response": ["Monte Moir is the original and current keyboardist for The Time, as well as a songwriter and producer for Janet Jackson, Alexander O'Neal, Gladys Knight, as well as the duo Deja (Curt Jones & Starleana Young). He is also credited for working with Prince, Vanity 6, Deniece Williams, Thelma Houston, Steven Dante, Lolly Pop, Precious Wilson and various other artists.", "Some of his greatest writing successes were writing the first side of Alexander O'Neal's solo debut – including \"If You Were Here Tonight\" and \"The Pleasure Principle' by Janet Jackson. Patti Austin and Thelma Houston are other notable artists he wrote classics for as part of Jimmy Jam and Terry Lewis's 'The Secret'. Monte is something of a cult writing figure in the world of soulful music. \"In My Life\" by Ruby Turner as well as Steven Dante's \"It's Only Love\" are key examples of his songwriting."]}, {"page": "Little Problems", "response": ["* Steven Dante: Love Follows"]}, {"page": "Ocean Drive (album)", "response": ["*Steven Dante  – background vocals"]}, {"page": "List of performances on Top of the Pops", "response": ["* Jellybean ft. Steven Dante – \"The Real Thing\""]}, {"page": "The Real Thing (Jellybean song)", "response": ["\"The Real Thing\" is a 1987 hit single by music producer Jellybean, which features the vocals of Steven Dante. It is featured on Jellybean's album Just Visiting This Planet. The song was most successful in clubs at the time, reaching #1 in the US Hot Dance Club Play Chart for one week.  \"The Real Thing\" also peaked at #49 and #82 on the soul chart and Hot 100, respectively.  Overseas, the single was successful in the UK Singles Chart, reaching #13."]}, {"page": "Steven dante", "response": ["#REDIRECT Steven Dante "]}, {"page": "List of UK Dance Singles Chart number ones of 1987", "response": ["| 24 October || \"The Real Thing\" || Jellybean ft. Steven Dante || 1 week"]}, {"page": "Just Visiting This Planet", "response": ["*Steven Dante – lead vocals, rap"]}, {"page": "Dante, Steven", "response": ["#redirectSteven Dante"]}]}}