{"wiki_id": "http://www.wikidata.org/entity/Q7612692", "itemLabel": "Steve Gould", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Gould_(musician)", "wikipedia_page": {"main": "Steve Gould (born 25 March 1950 in Battersea, London, England) was the English lead singer and bassist (later, rhythm guitarist) of the late 1960s to mid 1970s London-based progressive rock band, Rare Bird. They had one hit single titled \"Sympathy\" which peaked at No. 27 in the UK Singles Chart.Gould went on to form the mainstream band Runner on Island Records in the late 1970s after Rare Bird broke up. The band's debut album charted in the Billboard 200.When Runner did not work out due to differences with the label, Gould joined the Alvin Lee band in 1980, with whom he played bass on different occasions during two decades. On albums such as  Free Fall (1980) and RX5 (1981) he played an active role as vocalist and co-composer.", "link_mentions": [{"page": "Alvin Lee", "response": ["The 1980s brought another change in Lee's direction, with two albums that were collaborations with Rare Bird's Steve Gould, and a tour for which the former John Mayall and Rolling Stones guitarist Mick Taylor joined his band."]}, {"page": "Born Yesterday (album)", "response": ["#\"That Uncertain Feeling\" (Steve Gould) 3:11"]}, {"page": "Alan Merrill", "response": ["In 1977, Merrill married fashion model Cathee Dahmen, and formed a new group, the album-oriented rock act Runner, with Steve Gould (Rare Bird), Mick Feat (Van Morrison band), and Dave Dowle (Whitesnake). The Runner album charted in the Billboard top 100 in the United States."]}, {"page": "Rare Bird", "response": ["*Steve Gould (b. Stephen Burt Gould, 25 March 1950, Battersea, South London) – lead vocals & bass, rhythm guitar", "The history of Rare Bird began when Graham Field placed an advertisement for a pianist in a musical periodical. He got thirty replies and formed a group called \"Lunch\". He met Dave Kaffinetti in November 1968, and together they formulated the basic ideas for Rare Bird. In August 1969, they finally found the ideal rhythm section in Steve Gould, Chris Randall and Mark Ashton. Field and Kaffinetti had originally envisaged that the band would be a four-piece and were looking for a singer/bass player. Gould and Randall, who had both previously been members of the Pop-Psych band \"Fruit Machine\", applied to the advert as vocals/guitar and bass respectively and were taken on. Lunch played a few gigs; one notable one was at the Tilbury Working Mens Club for the princely sum of five pounds. The band had no van and they managed to get amps, drums, guitars and Hammond organ into their cars. The gig was marred by Randall receiving a bad electric shock whilst on stage. It later turned out that the founders of the band were more interested in Steve Gould and convinced him to play bass. Randall was now high and dry and was kicked out of the band.", "* Steve Gould – bass guitar, lead vocals", "* Steve Gould – bass guitar, lead vocals", "#* Steve Gould – rhythm guitar, co-lead vocals", "#* Steve Gould – rhythm electric and acoustic guitars, lead and backing vocals", "#* Steve Gould – co-lead vocals", "#* Steve Gould – electric and acoustic guitars, lead and backing vocals", "#* Steve Gould – rhythm guitar, co-lead vocals, percussion", "#* Steve Gould – acoustic guitar, vocals", "#* Steve Gould – acoustic guitar, lead and backing vocals", "#* Steve Gould – rhythm guitar, lead and backing vocals", "#* Steve Gould – rhythm guitar, co-lead vocals, percussion", "*Steve Gould – lead vocals, guitar; bass (track 6)", "*Steve Gould – lead vocals, guitars, bass guitar; electric piano (track 10)"]}, {"page": "Runner (band)", "response": ["Runner were a short-lived British rock band, formed in 1978 out of a friendship between Steve Gould of the band Rare Bird and Alan Merrill of the band Arrows.", "Steve Gould had been touring with Merrill's live band Arrows after his band Rare Bird broke up in 1976. When the Arrows broke up in 1978 both singers were looking for new projects. They went into the studio to do a rough demo with bass player Mick Feat, who was playing with Van Morrison at the time, and drummer Dave Dowle who was playing with the band Whitesnake.", "After the band split, Mick Feat and Steve Gould went on to record with Alvin Lee, Dave Dowle with the Maggie Bell band Nightflyer, and Alan Merrill joined Rick Derringer's band Derringer."]}, {"page": "Acting Very Strange", "response": ["* Steve Gould – backing vocals"]}, {"page": "Nutbush City Limits", "response": ["* Alvin Lee and Steve Gould included a version of \"Nutbush City Limits\" on their 1981 collaboration, RX5."]}, {"page": "Danger Zone (Sammy Hagar album)", "response": ["# \"Run For Your Life\" (Steve Gould, John Pidgeon) – 4:22"]}, {"page": "Turn Up the Music!", "response": ["# \"Run For Your Life\" (Steve Gould/Pidgeon) - 4:22"]}, {"page": "Riff Raff (album)", "response": ["# \"Hang On\" (Steve Gould) – 3:24"]}, {"page": "List of songs produced by Jeff Lynne", "response": ["*\"Hang On\" (Steve Gould)"]}, {"page": "Steve Gould", "response": ["Steve Gould may refer to:", "*Steve Gould (musician) (born 1950), British musician with the bands Rare Bird and Runner", "*Steve Gould (curler) (born 1972), Canadian curler"]}, {"page": "Michael J. Mullins", "response": ["Along with Joe Brown, Vicky Brown, Steve Gould, Jeff Lynne, Keith Murrell, and Steve Winwood, Mullins provided backing vocals for George Harrison on the album Best of Dark Horse 1976-1989 (1989). Ringo Starr provided drums.Harrison, George, Discography, Discogs [accessed] 16 August 2013"]}, {"page": "List of songs recorded by the Everly Brothers", "response": ["| | Steve Gould"]}, {"page": "Free Fall (Alvin Lee Band album)", "response": ["All tracks composed by Alvin Lee and Steve Gould; except where noted", "# \"Stealin'\" (Steve Gould) – 3:28", "*Steve Gould - guitar, vocals"]}, {"page": "Cactus Choir", "response": ["* Steve Gould — lead and backing vocals (2, 6)"]}, {"page": "Nineteen Ninety-Four (album)", "response": ["*Steve Gould - Bass"]}, {"page": "RX5 (album)", "response": ["All tracks composed by Steve Gould; except where noted", "# \"Fool No More\" (Steve Gould, Mick Feat) – 5:10 ", "*Steve Gould - guitar, vocals"]}]}}