{"wiki_id": "http://www.wikidata.org/entity/Q7610401", "itemLabel": "Stephen Romer", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Romer", "wikipedia_page": {"main": "Stephen Romer, FRSL (born 1957) is an English poet, academic and literary critic.", "link_mentions": [{"page": "1986 in literature", "response": ["*Eric Gregory Award: Mick North, Lachlan Mackinnon, Oliver Reynolds, Stephen Romer"]}, {"page": "Royal Society of Literature", "response": ["| Stephen Romer"]}, {"page": "T. S. Eliot Prize", "response": ["*Stephen Romer, Yellow Studio."]}, {"page": "Eric Gregory Award", "response": ["*1986: Mick North, Lachlan Mackinnon, Oliver Reynolds, Stephen Romer"]}, {"page": "Glascock Prize", "response": ["*Stephen Romer"]}, {"page": "Jacques Réda", "response": ["* Into the Deep Street. Seven Modern French Poets. 1938–2008, Edited and translated by Jennie Feldman and Stephen Romer, Anvil, London 2009."]}, {"page": "1986 in poetry", "response": ["* Eric Gregory Award: Mick North, Lachlan Mackinnon, Oliver Reynolds, Stephen Romer"]}, {"page": "Jacques Dupin", "response": ["* Selected Poems, selected by Paul Auster, translated by Stephen Romer and David Shapiro, Bloodaxe Books, 1992"]}, {"page": "Geoffrey Faber Memorial Prize", "response": ["| 2010 || Kona Macphee || Perfect Blue|| Poetry || Kate Kellaway, Bernard O'Donoghue, Stephen Romer ||"]}, {"page": "Gabriel Levin", "response": ["*The Water's Edge: Meetings of Image And Word, Ed. Ardyn Halter, with poems by Jennie Feldman, Seamus Heaney, Geoffrey Hill, Gabriel Levin, Michael Longley, Jamie McKendrick, Paul Muldoon, Don Paterson, Robin Robertson, and Stephen Romer, Lund Humphries, Burlington 2006.", "*Stephen Romer's review of Poems from the Diwan"]}, {"page": "Tower Poetry", "response": ["| Stephen Romer and Michael Schmidt"]}, {"page": "Stephen Romer (poet)", "response": ["#REDIRECT Stephen Romer"]}, {"page": "Numbers (magazine)", "response": ["* Stephen Romer"]}, {"page": "Romer, Stephen", "response": ["#redirectStephen Romer"]}, {"page": "Jennie Feldman", "response": ["These include the anthology Into the Deep Street: Seven Modern French Poets, 1938-2008 (2009), co-edited  with Stephen Romer, which has been described as «the best parallel-text introduction to modern and contemporary French poetry available».Patrick McGuinness, A Dark Rush Under Rain, The Times Literary Supplement, May 28, 2010, p. 13. On Into the Deep Street see also John Taylor, Paths to Contemporary French Literature, Transaction Publishers, New Brunswick (U.S.A.) and London (U. K.) 2011, Vol. 3, pp. 16–18. It was awarded a special commendation by the judges of the 2011 Popescu European Poetry Translation Prize.", "* Into the Deep Street. Seven Modern French Poets. 1938–2008, Edited and translated by Jennie Feldman and Stephen Romer, Anvil Press Poetry/Carcanet, London 2009. ", "* Ardyn Halter, ed.,The Water's Edge. Meetings of Image and Word, poems by Jennie Feldman, Seamus Heaney, Geoffrey Hill, Gabriel Levin, Michael Longley, Jamie McKendrick, Paul Muldoon, Don Paterson, Robin Robertson, and Stephen Romer, Lund Humphries, Burlington 2006, pp. 96–97."]}]}}