{"wiki_id": "http://www.wikidata.org/entity/Q7610105", "itemLabel": "Stephen North", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_North", "wikipedia_page": {"main": "Stephen \"Steve\" North (born 20 January 1965) is an English actor. He had his first major role playing firefighter Colin Parrish in the ITV drama London's Burning between 1990 and 1993. He has since appeared in numerous shows on British television, including Doctor Who Christmas Special 2010, EastEnders, The Bill, The Day Britain Stopped, Murphy's Law, Holby City, Midsomer Murders, Doctors, Is Harry on the Boat?, EastEnders: E20  and Casualty. North also played one of the two lead roles in the award-winning stage play Meeting Joe Strummer along with Emmerdale actor Nick Miles. He was the solo performer in the original stage adaptation of Nick Hornby's Fever Pitch, which ran at the Arts Theatre London in 1995. He played the role of Ted Narracott in War Horse (play) at the New London Theatre from May 2013 to March 2014 and also in the National Theatre Live broadcast on 27 February 2014 and subsequent Encore screenings.\nHe co-wrote the film South West 9 and directed the award-winning short film Cregan for Screen South.North is a supporter of Brighton and Hove Albion FC, and has co-written two books about the club, Build a Bonfire (Mainstream Publishing 1997).  and \"We Want Falmer\" (Stripe Publishing 2011).", "link_mentions": [{"page": "London's Burning (TV series)", "response": ["* Colin Parrish (Stephen North; series 3–6) – Colin was the nephew of Red Watch Fireman Jaffa Parrish and joined the watch as Vaseline's replacement. His naïvety and inexperience often made him the butt of pranks and jokes by other members of the watch. He took a liking to Firewoman Kate Stevens and visited her at her house, but was warned by Hallam to stop bothering her. After Colin sent the pump to the wrong address on a 'shout' (which was fortunately a hoax), Hallam extended Colin's probationary period, much to the ire of Colin's mother. Colin became a hero for the first time soon after this, when he saved another firefighter from falling down a lift shaft at a hotel fire. He graduated to full status early in Series 5. He married Zoe, whom he met during a 'shout', (rescuing a bird from a cage), despite her walking out on him after he took her to a football match on their first date. Colin was invalided out of the Brigade after his legs were crushed in Series 6."]}, {"page": "King Alfred's Academy", "response": ["Alumni include: computer scientist Professor Dave Cliff; spy novelist John Gardner; actor/author Stephen North; jockey Lester Piggott; neuroscientist Professor Anil Seth; Anna Yearley OBE, Executive Director of human-rights nonprofit Reprieve; and Christopher Ricks literary critic and scholar."]}, {"page": "Steve North", "response": ["#REDIRECT Stephen North"]}, {"page": "North (surname)", "response": ["* Stephen North (born 1965), British actor"]}, {"page": "North, Stephen", "response": ["#redirectStephen North"]}]}}