{"wiki_id": "http://www.wikidata.org/entity/Q7613358", "itemLabel": "Steve Melton", "itemDescription": "English footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Melton", "wikipedia_page": {"main": "Stephen Melton (born 3 October 1978) is an English former footballer who played as a midfielder.\nHe played as a professional in the Football League from 1996 until 2006, featuring for Nottingham Forest, Stoke City, Brighton & Hove Albion, Hull City and Boston United. At Non-League level he has represented Tamworth and King's Lynn before re-joining Boston United and then moving on to Lincoln United, Lincoln Moorlands Railway and Grantham Town.", "link_mentions": [{"page": "MKM Stadium", "response": ["In spite of obstacles during the course of the project, including Hull City A.F.C.'s receivership in 2001 (just after the granting of planning permission), the stadium complex was completed on time (in fourteen months) and on budget (at approximately GB£44 million). The stadium opened its doors on 18 December 2002. Hull City beat Sunderland A.F.C. 1–0 in a friendly match to mark the occasion. Steve Melton scored the goal, the first at the KC Stadium."]}, {"page": "Matt O'Halloran", "response": ["O'Halloran signed for King's Lynn in March 2005 following becoming disillusioned with professional football and became an integral part of the team that challenged for the Southern Premier league title where he was joined by former Boston United teammate Dean West. He also played a prominent role scoring important goals in the clubs FA cup run in the 2006/2007 season, culminating in their 2nd-round game being televised live on Sky Sports against his former club Oldham Athletic eventually losing 2-0. . He re-signed for Boston in August 2007 but after a positive start injuries took their toll and he underwent a double hernia operation in the latter stages of the season . He was offered a new contract by manager Tommy Taylor but instead chose to sign for Corby Town where he scored on debut in the opening game of the season. Injuries again played their part and limited his appearances in the second half of the season but he was a member of the Southern Premier league title winning side that season. He left Corby at the end of the 2008–09 season and joined his home town club Lincoln United alongside former Boston and King's Lynn teammate Steve Melton becoming a regular on the scoresheet from midfield. In October 2010, he joined Lincoln Moorlands Railway but persistent concerns with an ongoing back injury resulting in ruptured discs continued and he was forced to retire from competitive football at the age of 28. O'Halloran came out of retirement at the start of the 2013–2014 season having rejoined Lincoln United but overcoming the injuries proved difficult and following a stint at Sleaford Town he officially retired in October 2014. "]}, {"page": "1999–2000 Stoke City F.C. season", "response": ["|align=\"left\"|38||align=\"left\"|DF||align=\"left\"| Steve Melton"]}, {"page": "2000 Football League Trophy Final", "response": ["|MF || 35 || Steve Melton"]}, {"page": "1999–2000 Football League Trophy", "response": ["|MF || 35 || Steve Melton"]}, {"page": "1998–99 Nottingham Forest F.C. season", "response": ["|align=\"left\"|26||align=\"left\"|DF||align=\"left\"| Steve Melton"]}, {"page": "Flyin' High (album)", "response": ["* Mixed by Steve Melton"]}, {"page": "Melton (surname)", "response": ["*Steve Melton (born 1978), English footballer", "*Steve Melton (businessman) (born 1962), English businessman"]}, {"page": "2002–03 Brighton & Hove Albion F.C. season", "response": ["|align=\"left\"|20||align=\"left\"|MF||align=\"left\"| Steve Melton"]}, {"page": "2002–03 Hull City A.F.C. season", "response": ["|align=\"left\"|17||align=\"left\"|MF||align=\"left\"| Steve Melton"]}, {"page": "2003–04 Hull City A.F.C. season", "response": ["|align=\"left\"|17||align=\"left\"|MF||align=\"left\"| Steve Melton"]}, {"page": "Nottingham Forest F.C. Under-23s, Under-18s and Academy", "response": ["* Steve Melton"]}, {"page": "Melton, Steve", "response": ["#redirectSteve Melton"]}, {"page": "Oh What a Feeling", "response": ["* Steve Melton - remix engineer (\"Tonight I Feel Like Dancing\")"]}]}}