{"wiki_id": "http://www.wikidata.org/entity/Q7613810", "itemLabel": "Steve Roud", "itemDescription": "British compiler of folk songs", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Roud", "wikipedia_page": {"main": "Steve Roud (; born 1949): At 3:45  is the creator of the Roud Folk Song Index and an expert on folklore and superstition. He was formerly Local Studies Librarian for the London Borough of Croydon and Honorary Librarian of the Folklore Society.", "link_mentions": [{"page": "Yule log", "response": ["* Simpson, Jacqueline and Steve Roud (2003). A Dictionary of English Folklore. Oxford University Press. "]}, {"page": "Father's Day", "response": ["In the United Kingdom, Father's Day is celebrated on the third Sunday of June. The day does not have a long tradition; Steve Roud, in The English Year (2006), states that it entered British popular culture \"sometime after the Second World War, not without opposition\"."]}, {"page": "Frumenty", "response": ["Steve Roud, librarian and folklorist, compiled a compendium of The English Year including three recipes for frumenty.Roud, Steve (2006) The English Year; p.536 They show considerable variation with place and time."]}, {"page": "Francis James Child", "response": ["All the earlier, printed sources known to Child, ('The Child Ballads'), are subsumed, and progressed upon in number and research by Steve Roud, in the Roud Folk Song Index."]}, {"page": "Lies, damned lies, and statistics", "response": ["that the advocate of national pensions relies…\" Later, in October 1891, as a query in Notes and Queries, the pseudonymous questioner, signing as \"St Swithin\", asked for the originator of the phrase, indicating common usage even at that date. The pseudonym has been attributed to Eliza Gutch.Jacqueline Simpson (Editor), Steve Roud (Editor) (2003). A Dictionary of English Folklore. Oxford University Press"]}, {"page": "Barbara Allen (song)", "response": ["The song began as a ballad in the seventeenth century or earlier, before quickly spreading (both orally and in print) throughout the British Isles and later North America.Arthur Gribben, ed., The Great Famine and the Irish Diaspora in America, University of Massachusetts Press (March 1, 1999), pg. 112. Ethnomusicologists Steve Roud and Julia Bishop described it as \"far and away the most widely collected song in the English language—equally popular in England, Scotland and Ireland, and with hundreds of versions collected over the years in North America.\"", "From this, Steve Roud and Julia Bishop have inferred the song was popular at that time, suggesting that it may have been written for stage performance, as Elizabeth Knepp was a professional actress, singer, and dancer. However, the folklorists Phillips Barry and Fannie Hardy Eckstorm were of the opinion that the song \"was not a stage song at all but a libel on Barbara Villiers and her relations with Charles II\". Charles Seeger points out that Pepys' delight at hearing a libelous song about the King's mistress was perfectly in character."]}, {"page": "Faxlore", "response": ["The first use of the term xeroxlore was in Michael J. Preston's essay \"Xerox-lore\", 1974. \"Photocopylore\" is perhaps the most frequently encountered name for the phenomenon now, because of trademark concerns involving the Xerox Corporation.  The first use of this term came in A Dictionary of English Folklore by Jacqueline Simpson and Steve Roud.Jacqueline Simpson and Steve Roud (2000). A Dictionary of English Folklore. Oxford University Press. ."]}, {"page": "Knocking on wood", "response": ["Another explanation links the practice to wooden crucifixes. A more modern theory from folklore researcher Steve Roud suggests it derives from a form of tag called \"Tiggy Touchwood\" in which players are safe from being tagged if they are touching wood."]}, {"page": "Silver Dagger (song)", "response": ["The song exists in a large number of variations under many different titles, and with lyrics that may show a mixture of different songs. Steve Roud observes on one version of the song titled \"O! Molly Dear Go Ask Your Mother\":"]}, {"page": "British Bulldog (game)", "response": ["* Steve Roud: British Bulldog and Other Chasing Games. In: The Lore of the Playground. Random House Books, London 2010, , pp. 37–42."]}, {"page": "Jacqueline Simpson", "response": ["Simpson studied English Literature and Medieval Icelandic at Bedford College, University of London. She has been, at various times, Editor, Secretary, and President of the Folklore Society. She was awarded the Society's Coote Lake Research Medal in 2008. In 2010 she was appointed Visiting Professor of Folklore at the Sussex Centre of Folklore, Fairy Tales and Fantasy at the University of Chichester, West Sussex. She has a particular interest in local legends (as opposed to international fairy tales), and has published collections of this genre from Iceland, Scandinavia in general, and England (the latter in collaboration with the late Jennifer Westwood). She has also written on the folklore of various English regions, and was co-author with Steve Roud of the Penguin Dictionary of English Folklore."]}, {"page": "Lady Isabel and the Elf Knight", "response": ["*Steve Roud and Julia Bishop, (eds), \"The New Penguin Book of English Folk Songs\", 2012, . pp 311–313, 490-491. (as \"The Outlandish Knight\")", "Steve Roud and Julia Bishop point out that this is one of about half a dozen Child ballads that have been most consistently popular, having been collected \"time and again all over the English-speaking world\"", "But Steve Roud points out that as the two earliest British versions are late 18th century and "]}, {"page": "Roud Folk Song Index", "response": ["The Roud Folk Song Index is a database of around 250,000 references to nearly 25,000 songs collected from oral tradition in the English language from all over the world. It is compiled by Steve Roud (born 1949), a former librarian in the London Borough of Croydon.English Folk Dance and Song Society. The EFDSS listed 187,800 records in the growing Folksong database in October 2012 (which includes all of the songs in the Broadside database with \"traditional\" origins). Roud's Index is a combination of the Broadside Index (printed sources before 1900) and a \"field-recording index\" compiled by Roud. It subsumes all the previous printed sources known to Francis James Child (the Child Ballads) and includes recordings from 1900 to 1975. Until early 2006, the index was available by a CD subscription; now it can be found online on the Vaughan Williams Memorial Library website, maintained by the English Folk Dance and Song Society (EFDSS). A partial list is also available at List of folk songs by Roud number.", "The index was compiled and is maintained by Steve Roud, formerly the Local Studies Librarian in the London Borough of Croydon. He was also Honorary Librarian of the Folklore Society."]}, {"page": "English Folk Dance and Song Society", "response": ["* 2009  Jack Brown; Beryl Marriott; Roger Nicholls; Steve Roud; Derek Schofield"]}, {"page": "Geordie (ballad)", "response": ["Steve Roud and Julia Bishop (New Penguin Book of English Folk Songs) comment that in Scottish versions Geordie tends to be released, while in English ones his lady \"has come too late\" and he is executed.Roud, S, and Bishop, J; The New Penguin Book of English Folk Songs; London, 2012 pp 499–500"]}, {"page": "Our Goodman", "response": ["The Roud Folk Song Index has over 400 versions of the song, with titles such as \"Merry Cuckold\", \"Old Witchet\", \"Three Nights Drunk\" and \"Seven Nights Drunk\". Steve Roud and Julia Bishop described it as \"an immensely widespread song, probably known all over the English-speaking world, with the wording varying considerably but the structure and basic story remaining the same.\"Roud, Steve & Julia Bishop (2012). The New Penguin Book of Folk Songs. Penguin. . p. 450 Bertrand Harris Bronson listed 58 versions for which tunes exist; he found considerable variety in the tunes, which he divided into eight groups. John E. Housman observed that \"There is much of Chaucer's indomitable gaiety in this ballad. The questions of the jealous husband and the evasions of his wife are treated here in a humorous vein\"."]}, {"page": "Lady Franklin's Lament", "response": ["\"Lady Franklin's Lament\" (also known as \"Lord Franklin\" and \"The Sailor's Dream\") is a traditional folk ballad indexed by George Malcolm Laws (Laws K09) and Steve Roud (Roud 487). The song recounts the story of a sailor who dreams about Lady Franklin speaking of the loss of her husband, Sir John Franklin, who disappeared in Baffin Bay during his 1845 expedition through the Arctic Ocean in search of the Northwest Passage sea route to the Pacific Ocean. The song first appeared as a Broadside ballad around 1850 and has since been recorded with the melody of the Irish traditional air \"Cailín Óg a Stór\" by numerous artists. It has been found in Ireland, in Scotland, and in some regions of Canada."]}, {"page": "List of folk song collections", "response": ["|Steve Roud"]}, {"page": "The Folklore Society", "response": ["It was founded in London in 1878 to study traditional vernacular culture, including traditional music, song, dance and drama, narrative, arts and crafts, customs and belief. The foundation was prompted by a suggestion made by Eliza Gutch in the pages of Notes and Queries.Jacqueline Simpson (Editor), Steve Roud (Editor) (2003). A Dictionary of English Folklore. Oxford University Press.", "* 2004: Steve Roud, The Penguin Guide to the Superstitions of Britain and Ireland (Penguin)"]}, {"page": "The Voice of the People", "response": ["A second series was issued in 2012 consisting of four volumes (7 CDs) compiled by Shirley Collins, Steve Roud and Rod Stradling.", "Selected by Steve Roud."]}, {"page": "Sam Richards (writer)", "response": [" From 1982 to at least 1989 he jointly produced with Steve Roud a quarterly newsletter titled \"Folk Song Research: A Newsletter for Researchers of Traditional Song\"."]}, {"page": "One potato, two potato", "response": ["There are many recorded variants of the rhyme, some of which prefer the plural \"One potato, two potatoes\",, and others which substitute \"spud\", \"tate\" or \"apple\" for \"potato\". One collected variant ends  \"[...] seven potato, raw\". Multiple continuations also exist, including \"[...] Eight potato, nine potato, ten potato all / One, two, three, four, five, six, seven, eight, nine, ten\" and \"One bad spud!\" (collected by Steve Roud).", "The popularity of particular counting-out rhyme wordings has varied over the years. In 1969 Iona and Peter Opie found \"One potato, two potato\" to be \"in constant use\" both in the UK and the USA during the 20th century but by 2010, although still very well known, Steve Roud found that it was no longer British children's first choice for counting out."]}, {"page": "Myth", "response": ["Myth is a folklore genre consisting of narratives that play a fundamental role in a society, such as foundational tales or origin myths. The main characters in myths are usually non-humans, such as gods, demigods, and other supernatural figures.Simpson, Jacqueline, and Steve Roud, eds. 2003. \"Myths.\" In A Dictionary of English Folklore. Oxford: Oxford University Press. . However, others also include humans, animals, or combinations in their classification of myth. Stories of everyday human beings, although often of leaders of some type, are usually contained in legends, as opposed to myths. Myths are sometimes distinguished from legends in that myths deal with gods, usually have no historical basis, and are set in a world of the remote past, very different from that of the present.", "*Simpson, Jacqueline, and Steve Roud, eds. 2003. \"Myths.\" In A Dictionary of English Folklore. Oxford: Oxford University Press. ."]}, {"page": "One Morning in May (folk song)", "response": ["\"The Souldier (sic) and His Knapsack\", registered with the Stationers Company in 1639 may be this song, but as Steve Roud and Julia Childs point out \"soldiers and knapsacks are a rather common pairing\".  The earliest known text is a Broadside ballad titled \"The nightingale's song: or The soldier's rare musick, and maid's recreation\" published between 1689 and 1709 by W Onley of London, in the Bodleian Ballad Collection.Bodleian Ballad Collection http://ballads.bodleian.ox.ac.uk/search/advanced/?q_RoudNumbers=140&q_TitleElements=&q_TextBodyElements=&q_Subjects=&q_Themes=&q_ImprintElements=&q_TuneNameElements=&q_Printers=&q_Authors=&q_Notes=&q_References=&searchany=on Retrieved 27/02/2017 This text has a pious moral at the end which both later publishers and traditional singers dispensed with.Bodleian Ballad Collection http://ballads.bodleian.ox.ac.uk/static/images/sheets/20000/15342.gif Retrieved 27/02/2017Bodleian Ballad Collection http://ballads.bodleian.ox.ac.uk/static/images/sheets/05000/01347.gif Retrieved 27/02/2017"]}, {"page": "List of folk songs by Roud number", "response": ["The index is a database of nearly 200,000 references to nearly 25,000 songs that have been collected from oral tradition in the English language from all over the world. It is compiled by Steve Roud, a former librarian in the London Borough of Croydon. The English Folk Dance and Song Society (EFDSS) listed 187,800 records in the growing Folksong database as at October 2012 (which total includes all of the songs in the Broadside database that have 'traditional' origins).library.efdss.org: Search the Roud Folksong Index (English Folk Dance and Song Society)"]}, {"page": "Roud (disambiguation)", "response": ["* Steve Roud, creator of the Roud Folk Song Index"]}, {"page": "London Lore", "response": ["London lore: the legends and traditions of the world's most vibrant city is a 2008 book about the folklore and history of London by Steve Roud. Another edition was published in 2010."]}]}}