{"wiki_id": "http://www.wikidata.org/entity/Q7615202", "itemLabel": "Steven Robertson", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Robertson", "wikipedia_page": {"main": "Steven Robertson (born 1 January 1977) is a Scottish actor who stars as Detective Sandy Wilson in the BBC One adaptation of Ann Cleeves's Shetland, filmed near where Robertson was born and brought up. He portrayed Michael Connelly, a young man with cerebral palsy, in Inside I'm Dancing, and played Dominic Rook in the popular BBC Three comedy-drama series Being Human. He has had roles in numerous television programs including Luther and The Bletchley Circle.", "link_mentions": [{"page": "Kingdom of Heaven (film)", "response": ["* Steven Robertson as Angelic Priest"]}, {"page": "Elizabeth: The Golden Age", "response": ["*Steven Robertson as Sir Francis Throckmorton"]}, {"page": "Romola Garai", "response": ["In 2012 she wrote and directed the short film Scrubber, casting Amanda Hale, Michelle Duncan, Honor Kneafsey and Steven Robertson. The film was shown at the Edinburgh film festival where it was nominated for Best British Short Film, at Sundance film festival where it was nominated for Best International Short Film, at London Short Film Festival where it won the Underwire Award for Best Female Character, and at Cannes where it screened in the Short Film Corner. The film was released as part of a short film collection, The Joy of Six, a Soda Pictures Release."]}, {"page": "Inside I'm Dancing", "response": ["Inside I'm Dancing, also released under the title Rory O'Shea Was Here, is an Irish 2004 comedy-drama film directed by Damien O'Donnell and starring James McAvoy, Steven Robertson, Romola Garai, and Brenda Fricker. The film revolves around two disabled young men who pursue physical and emotional independence in direct defiance of \"protective\" institutional living and their society's prevailing standards and attitudes, especially pity.", "* Steven Robertson as Michael Connolly, a 24-year-old long-term resident with cerebral palsy"]}, {"page": "Joyeux Noël", "response": ["* Steven Robertson as Jonathan"]}, {"page": "Straightheads", "response": ["*Steven Robertson as Bill"]}, {"page": "Vidlin", "response": ["Steven Robertson is a theatre and film actor who has appeared in a number of successful films. He was born in Vidlin and attended the local school."]}, {"page": "List of Irish films", "response": ["| Inside I'm Dancing || Damien O'Donnell || James McAvoy, Steven Robertson, Romola Garai and Brenda Fricker || Comedy ||"]}, {"page": "Sugarhouse (film)", "response": ["*Steven Robertson as Chris, the pinhead leader"]}, {"page": "List of American films of 2005", "response": ["| Kingdom of Heaven || 20th Century Fox / Scott Free Productions || Ridley Scott (director); William Monahan (screenplay); Orlando Bloom, Eva Green, Jeremy Irons, David Thewlis, Brendan Gleeson, Marton Csokas, Liam Neeson, Edward Norton, Michael Sheen, Kevin McKidd, Ulrich Thomsen, Nikolaj Coster-Waldau, Iain Glen, Alexander Siddig, Eriq Ebouaney, Bronson Webb, Velibor Topić, Ghassan Massoud, Khaled Nabawy, Jon Finch, Martin Hancock, Nathalie Cox, Jouko Ahola, Giannina Facio, Philip Glenister, Steven Robertson, Angus Wright || Drama ||"]}, {"page": "List of comedy films of the 2000s", "response": ["|Inside I'm Dancing||Damien O'Donnell||James McAvoy, Steven Robertson, Romola Garai ||United KingdomUnited StatesIreland||"]}, {"page": "List of Scottish actors", "response": ["*Steven Robertson (born 1980)"]}, {"page": "Being Human (British TV series)", "response": ["| Dominic Rook || Steven Robertson || colspan=\"3\"  ||  || "]}, {"page": "Tess of the D'Urbervilles (2008 TV serial)", "response": ["*Steven Robertson as Cuthbert Clare"]}, {"page": "Red Riding", "response": ["| Sgt Bob Fraser || Steven Robertson ||  || Steven Robertson"]}, {"page": "Ian Charleson Awards", "response": ["*Steven Robertson, for Konstantin in The Seagull (Royal Exchange Theatre, Manchester)"]}, {"page": "James McAvoy", "response": ["In 2004, he acted in the romantic comedy Wimbledon, also featuring Kirsten Dunst and Paul Bettany as leads. His next project was voicing a character named Hal in the 2004 English version of Strings, a mythic fantasy film. Another 2004 release for him was Inside I'm Dancing, an Irish production directed by Damien O'Donnell starring alongside fellow Scotsman Steven Robertson. In it, the actor was cast as one of the two principal characters: a maverick with duchenne muscular dystrophy. McAvoy ended 2004 by appearing in the first two seasons of Shameless as Steve McBride, the moral hero of the BAFTA-winning Channel 4 programme."]}, {"page": "True North (2006 film)", "response": ["True North  is a 2006 British drama film directed by Steve Hudson and starring Martin Compston, Peter Mullan, Gary Lewis and Steven Robertson as sailors aboard a Scottish fishing boat smuggling illegal immigrants from China into the United Kingdom.", "* Steven Robertson as The Cook"]}, {"page": "5 Days of War", "response": ["* Steven Robertson as Davit Kezerashvili, Georgian Defense Minister"]}, {"page": "List of Being Human (British TV series) characters", "response": ["| Dominic Rook  || Steven Robertson ||Dominic Rook is the leader of a British government department initially identified as \"the Men in Grey\" or as \"the clean-up team\". The official name of the department has been revealed as \"Department of Domestic Defence\" (DoDD), it has existed since the time of Oliver Cromwell and carries out an extensive cover-up of the existence of supernatural creatures. Rook has stated in dialogue that it is not run by supernatural creatures and that few such creatures even suspect its existence; and that it is perhaps best described as the \"domestic staff\" of the world, ensuring that the rest of the world's people \"sleep soundly.\" Rook has also suggested (or threatened) that people like him are \"magicians\", able to make people \"disappear in a puff of smoke.\" Rook is profoundly attached to his job, to the point at which he sees it as his entire life. He is ruthless in both carrying out his tasks and defending his profession."]}, {"page": "Robertson (surname)", "response": ["*Steven Robertson (born 1977), Scottish actor"]}, {"page": "Greg Hersov", "response": ["* The Seagull by Anton Chekhov with Emma Lowndes (MEN Award),Geraldine Alexander, Russell Dixon (MEN Award) and Steven Robertson (2003)"]}, {"page": "Neds (film)", "response": ["*Steven Robertson - Mr. Bonetti"]}, {"page": "Stephen Robertson", "response": ["*Steven Robertson (born 1970), Scottish actor"]}, {"page": "Parade's End (TV series)", "response": ["Parade's End is a five-part BBC/HBO/VRT television serial adapted from the tetralogy of eponymous novels (1924–1928) by Ford Madox Ford. It premiered on BBC Two on 24 August 2012 and on HBO on 26 February 2013.  The series was also screened at the 39th Ghent Film Festival on 11 October 2012. The miniseries was directed by Susanna White and written by Tom Stoppard. The cast was led by Benedict Cumberbatch and Rebecca Hall as Christopher and Sylvia Tietjens, along with Adelaide Clemens, Rupert Everett, Miranda Richardson, Anne-Marie Duff, Roger Allam, Janet McTeer, Freddie Fox, Jack Huston, and Steven Robertson.", "* Steven Robertson as Colonel Bill Williams"]}, {"page": "Steve Robertson", "response": ["*Steven Robertson (born 1970), Scottish actor"]}, {"page": "The Bletchley Circle", "response": ["* Steven Robertson as Malcolm Crowley, a disturbed veteran who worked with Cavendish on psychological warfare techniques during the war. "]}, {"page": "Utopia (British TV series)", "response": ["*Steven Robertson as Terrence Truman (series 2), another Network sleeper agent."]}, {"page": "Being Human (British series 5)", "response": ["* Steven Robertson as Dominic Rook"]}, {"page": "In the Flesh (TV series)", "response": ["* Steven Robertson as John Weston"]}, {"page": "Shetland (TV series)", "response": ["The series stars Douglas Henshall as Jimmy Pérez, a detective inspector working for the Scottish police, Alison O'Donnell as Detective Sergeant Alison \"Tosh\" Macintosh, and Steven Robertson as Detective Constable Sandy Wilson. Mark Bonnar, Lewis Howden, Erin Armstrong, Julie Graham, and Anne Kidd are also principal members of the cast.", "* Steven Robertson as Sandy Wilson, detective constable (series 1–)"]}, {"page": "Doctor Who (series 9)", "response": ["In January 2015, it was announced that actor Paul Kaye had a guest role in the first production block. It was later announced that other guest actors featuring in the first block include Arsher Ali, Morven Christie, Neil Fingleton, Colin McFarlane, and Steven Robertson."]}, {"page": "T2 Trainspotting", "response": ["* Steven Robertson as Stoddart"]}, {"page": "He Kills Coppers", "response": ["* Steven Robertson as Tony Meehan"]}, {"page": "Harlots (TV series)", "response": ["*Steven Robertson as Robert Oswald"]}, {"page": "Robertson, Steven", "response": ["#redirectSteven Robertson"]}]}}