{"wiki_id": "http://www.wikidata.org/entity/Q7614623", "itemLabel": "Steven Dean", "itemDescription": "cricketer (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Dean", "wikipedia_page": {"main": "Steven John Dean (born 16 November 1960) is a former English cricketer. Dean was a right-handed batsman. He was born in Cosford, Staffordshire.\nDean made his debut for Staffordshire against Lincolnshire in the 1982 Minor Counties Championship. Dean played Minor counties cricket for Staffordshire from 1982 to 2003, which included 161 Minor Counties Championship appearances and 47 MCCA Knockout Trophy matches. It was for Staffordshire that he made his debut in List A cricket for, against Glamorgan in the 1986 NatWest Trophy. Over the next 17 years, Dean would go on to make a further 16 limited-overs appearances for Staffordshire, in which he scored 302 runs at an average of 14.38. His highest score of 72 came for Staffordshire against Warwickshire in the 1987 NatWest Trophy.For a Minor counties cricketer, Dean would go on to make an unusually high number of List A appearances for a cricketer not attached to a first-class county. Playing for Staffordshire allowed Dean to represent the Minor Counties cricket team, who he made his limited-overs debut for in the 1992 Benson & Hedges Cup against Middlesex, with Dean playing an additional 26 List A matches for the team, with his final match coming in the 1998 Benson & Hedges Cup against Leicestershire. Dean was more successful with the bat for the Minor Counties, 583 runs at an average of 22.42, with a high score 56 which came against Yorkshire in 1997. It was for the Minor Counties that he made his first-class debut for against the touring South Africans in 1994, his only first-class appearance for the team. In the Minor Counties first-innings he scored 39 runs, before being caught by Hansie Cronje off the bowling of Pat Symcox. In their second-innings, Dean was caught once again by Cronje, this time off the bowling of Tim Shaw for 34 runs. The season prior to this match, Dean played a single List A match for Warwickshire against Nottinghamshire in the 1993 AXA Equity & Law League, scoring 17 runs. He did not feature again for Warwickshire, or for any other first-class county.\nContinuing to play for Staffordshire in Minor counties cricket and in the NatWest Trophy and Cheltenham & Gloucester Trophy, Dean played his final first-class match for the county in 2nd round of the 2003 Cheltenham & Gloucester Trophy against the Hampshire Cricket Board, which was played in 2002. Two years previously, he had played his second and final first-class match, this time for the Marylebone Cricket Club against New Zealand A. Opening the batting with Graham Gooch, Dean scored 12 runs before being dismissed by Daryl Tuffey. In the MCC second-innings he was absent hurt. His career with Staffordshire ended at the end of the 2003 season. Dean scored 10,163 runs in the Minor Counties Championship at an average of 38.21, making 51 half centuries and 19 centuries, with a high score of 173 not out. He holds the record for the highest batting average in a season for Staffordshire, averaging 96.42 in a 1992 season in which he scored 675 runs. Dean made a combined total of 49 List A appearances, in which he scored 902 runs at an average of 18.79, with a high score of 72, while in the field he took 19 catches.Still active in club cricket, Dean plays for Havant Cricket Club, based in Havant, Hampshire. He also currently teaches mathematics at the Portsmouth Grammar School, also based in southern Hampshire.Dean appeared in the Wisden Club Cricket Hall of Fame in February 2018.\nDean's daughter, Charlie, is an all-rounder playing for Hampshire and Southern Vipers. She is also a member of the England Women's Senior Academy.", "link_mentions": [{"page": "Birmingham and District Premier League", "response": ["| Steven Dean"]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Steven Dean, 1 match, 1993"]}, {"page": "List of Marylebone Cricket Club players (1978–)", "response": ["* Steven Dean (2000) : S. J. Dean (Staffordshire)\t"]}, {"page": "Dean, Steven", "response": ["#redirectSteven Dean"]}]}}