{"wiki_id": "http://www.wikidata.org/entity/Q762449", "itemLabel": "Mark Walters", "itemDescription": "association football player from England (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Walters", "wikipedia_page": {"main": "Mark Everton Walters (born 2 June 1964) is an English former professional footballer who made 600 league appearances between 1981 and 2002.\nA midfielder, Walters played top-flight football for Aston Villa, Liverpool and Southampton in England and for Rangers in Scotland, and played in the lower divisions of the Football League for Stoke City, Wolverhampton Wanderers, Swindon Town and Bristol Rovers. He was capped once by England.", "link_mentions": [{"page": "Jamie Redknapp", "response": ["Following Dalglish's departure, Redknapp was part of a transitional Liverpool team under Graeme Souness. He spent most of his first two-and-a-half years as a substitute or in the reserves, missing the 1992 FA Cup Final triumph and only becoming a regular first-team player in the 1993–94 season, at the expense of Mark Walters. At this time, Redknapp had also become one of the mass-marketed poster boy icons of the newly developing FA Premier League where, alongside other photogenic young players like Manchester United players Ryan Giggs and Lee Sharpe, he was used ceaselessly in commercials, advertising spots and for the league's promotional purposes in merchandising and sales, with the result being that football stars had become idols on par with rock stars and pop stars, by and around the mid to late 1990s."]}, {"page": "John Barnes", "response": ["Souness later stated in his autobiography that Barnes due to his injuries was now taking a \"less demanding\" central midfield playmaker's role as opposed to a goalscoring winger. Despite the effects of the injuries, Barnes was still regarded as one of club and country's best players and Souness noted that Barnes \"Retained his quality on the ball, using it well and rarely losing possession\". Mark Walters who had played for Souness at Glasgow Rangers had been purchased as cover/competition for Barnes but failed to displace him."]}, {"page": "FA Youth Cup", "response": ["| Mark Walters"]}, {"page": "Graeme Souness", "response": ["Souness took over at Anfield just before Liverpool surrendered their defence of the English league title to Arsenal. He made a major reorganisation of the squad in his first six months as manager, bringing in Dean Saunders for an English record of £2.9 million as well as defenders Mark Wright and Rob Jones and midfielder Mark Walters. He also gave a regular place in the team to 19-year-old midfielder Steve McManaman, whose debut had come under Dalglish in December 1990, and a debut to one of Dalglish's last signings, teenage midfielder Jamie Redknapp. And at the end of that campaign, he gave a professional contract to 17-year-old striker Robbie Fowler."]}, {"page": "Steve McManaman", "response": ["McManaman was born in Bootle, Lancashire. He grew up as an Everton supporter, with his boyhood heroes in football being the Everton players Bob Latchford and Duncan McKenzie. But when Everton offered the player a one-year contract (after McManaman had made a name for himself at tournaments for school and around Merseyside), McManaman's father rejected it in favour of a schoolboy contract and two-year apprenticeship offer from Liverpool (through scout Jim Aspinall and then manager Kenny Dalglish). McManaman signed as a 16-year-old apprentice upon leaving school in 1988. As an apprentice, McManaman was under the mentoring of John Barnes—one of the players McManaman was groomed to potentially replace in the long run. A natural athlete and cross country champion at school level, McManaman developed through the youth scheme at Liverpool and signed as a full professional on 19 February 1990 in what was to be Kenny Dalglish's final full season as manager. He made his Liverpool debut under Dalglish as a substitute for Peter Beardsley in the Football League First Division on 15 December 1990, in a 2–0 league win over Sheffield United at Anfield, and made his full debut the following season (by which time Graeme Souness had become the new manager) in a 2–1 win over Oldham Athletic; a game in which The Guardian newspaper reported that he \"ran his legs into the ground\" all day and assisted his mentor Barnes in scoring the late winner by flicking on Mark Walters' cross. He scored his first ever professional goal with a diving header four days later on 21 August 1991 in the 2–1 defeat to Manchester City at Maine Road."]}, {"page": "Davie Cooper", "response": ["Following the Souness Revolution at Ibrox and an influx of high-profile signings, Cooper's presence in the Rangers first team began to decrease. Broadcaster Tam Cowan stated: \"He (Souness) was bringing in guys like Mark Walters, exciting talent out on the wing from down south. But Davie, because he loved the game so much, just wanted to go somewhere where he could play first team football.\" Souness later admitted his mistake in allowing Cooper to leave for Motherwell, saying: \"I regret the fact I didn’t say no to him at that time. He went on to play brilliantly at the highest level for another three years.\"", "Cooper has been regarded by many as one of the greatest players in Scottish football history. A winger, he became a notoriously difficult opponent due to his creative and elegant playing style, with strength and manipulation of the ball allowing him to ease past opposition players. Former teammate Mark Walters said in an interview on Cooper: “He could just glide past players, drop a shoulder and go. He used to manipulate the ball. Watching him made me a better player.” Despite not being blessed with pace, his close ball control, strength and “dip of the shoulder” allowed him to create many assists and score goals throughout his career."]}, {"page": "England national football team records and statistics", "response": [": Rangers, 7The players in question were Terry Butcher, Chris Woods, Gary Stevens, Trevor Steven, Mark Walters, Mark Hateley and Paul Gascoigne."]}, {"page": "1992–93 in English football", "response": ["17 April 1993 – Midfielder Mark Walters scores a hat-trick as Liverpool beat Coventry City 4–0 in the Premier League at Anfield. Manchester United remain in pole position with a 3–0 home win over Chelsea, which puts the title mathematically beyond Blackburn's reach despite a 3–1 win at Sheffield United. Liverpool's improvement in form continues with a 4–0 home win over Coventry."]}, {"page": "History of Celtic F.C. (1887–1994)", "response": ["Season 1990–91 saw Celtic's league fortunes fall away fairly quickly, despite their centre-back Paul Elliott being voted Players' Player of the Year. They did reach the Skol Cup Final in October only to be beaten in extra time by Rangers.  In December 1990, Celtic appointed their first ever Chief Executive, Terry Cassidy.  Cassidy had an impressive background but his abrasive nature did not go down well in Scottish football.  On the pitch, Celtic gained a modicum of revenge over Rangers for their earlier Skol Cup Final defeat in a 1991 Scottish Cup quarter-final tie with their rivals, beating them 2–0 through Gerry Creaney and Dariusz Wdowczyk goals. It was a wild St. Patrick's Day encounter which saw three Rangers players (Terry Hurlock, Mark Walters and Mark Hateley) and one Celtic player (Peter Grant) get the red card. However, the joy was short-lived as Motherwell knocked them out of the semi-final 4–2."]}, {"page": "History of Rangers F.C.", "response": ["The following season Rangers could not build on the success of the previous. Despite the arrivals of Trevor Francis, Ray Wilkins, Mark Walters, Mark Falco, John Brown and Richard Gough, who became Scotland's first £1 million player. The title defence began badly, three points from the first ten, that added with injuries and suspensions meant the club finished third, twelve points behind champions Celtic.  The League Cup Final victory was the only bright spark that season, although there was a decent run the European Cup with Dynamo Kyiv and David White's foes Górnik Zabrze as scalps. A final against Aberdeen saw Rangers win 5–3 on penalties after drawing 3–3. The Scottish Cup ended in the fourth round at the hands of Dunfermline Athletic.", "In his first full season in charge, Smith began to make changes. He brought in Archie Knox from Manchester United, as his assistant and also altered the playing personnel. Smith moved on Trevor Steven for a fee of £5.58 million to Olympique Marseille. Amongst those who also left were Chris Woods, Mo Johnston, Mark Walters to Sheffield Wednesday, Everton and Liverpool respectively. Smith, with the financial backing of Chairman David Murray, signed Andy Goram, Alexei Mikhailichenko, Stuart McCall, David Robertson and the perhaps less successful pair of Dale Gordon and Paul Rideout."]}, {"page": "2005 Tour de Langkawi", "response": ["*  Mark Walters"]}, {"page": "2006 Tour de Langkawi", "response": ["*  Mark Walters"]}, {"page": "1987–88 in English football", "response": ["31 December 1987 – The year draws to a close with Liverpool holding a commanding ten-point lead over second-placed Nottingham Forest. Watford have slipped to the foot of the table, level on points with Charlton Athletic. Portsmouth occupy the final automatic relegation place. Graeme Souness signs Aston Villa midfielder Mark Walters for Rangers for £550,000 in the latest of several moves for English players. In the Second Division, Middlesbrough lead with a one-point margin over Bradford City. A four-point margin separates their nearest six challengers – Aston Villa, Crystal Palace, Millwall, Hull City, Manchester City and Ipswich Town.Aston Villa FC News – VillaMAD. Astonvilla-mad.co.uk (28 December 1987). Retrieved on 23 March 2011."]}, {"page": "1991–92 in English football", "response": ["13 August 1991 – Mark Walters follows his former Rangers manager Graeme Souness to Liverpool in a £1.25million deal. Don Howe's brief return to Wimbledon's coaching staff ends when he announces his decision to leave the club with immediate effect, in response to manager Ray Harford's decision to resign from the club within the next six months. West Ham United prepare for their First Division comeback by signing striker Mike Small from Brighton & Hove Albion for £400,000."]}, {"page": "1981–82 in English football", "response": ["28 April 1982: Mark Walters, 17-year-old midfielder, makes his debut for Aston Villa in their 4–1 home defeat by Leeds United in the league.Mark Walters – Aston Villa FC – Football-Heroes.net. Sporting-heroes.net. Retrieved on 2011-03-23."]}, {"page": "Simon Ford", "response": ["He is former Rangers and Liverpool winger Mark Walters's nephew."]}, {"page": "1987–88 in Scottish football", "response": ["Rangers, further strengthened with the signing of Englishmen Ray Wilkins and Mark Walters in midfield, had consolation for their failure to repeat title glory in the shape of a League Cup win. They could only finish third in the league, with Hearts finishing second – 10 points adrift of champions Celtic."]}, {"page": "1988–89 in Scottish football", "response": ["|Mark Walters"]}, {"page": "List of Bristol Rovers F.C. international players", "response": ["|align=\"left\"|Mark Walters||||1||1991||1999–2002"]}, {"page": "Racism in association football", "response": ["The book Race, Sport and British Society says there was racist abuse of Celtic player Paul Wilson by Rangers fans in the 1970s: \"Rangers fans repeatedly bayed 'Wilson's a Paki' when Celtic played Rangers.\"Ben Carrington and Ian McDonald  (p.40) There have been reports that some Rangers fans used to sing \"I'd rather be a darkie than a Tim\",Race, Sport and British Society by Ben Carrington and Ian McDonald, p. 40 with \"Tim\" referring to a Celtic fan. The book Sport and National Identity in the Post-War World states, \"black players in Scotland were greeted with bananas thrown from the crowd and a barrage of 'monkey grunts', notably Mark Walters of Rangers and Paul Elliott of Celtic.\" On 2 January 1988, Rangers winger Mark Walters made his debut in the Old Firm derby match at Celtic Park. Rangers lost 2–0 and Walters was subjected to racist abuse from opposing Celtic fans, who were caught on camera chanting like monkeys, throwing fruit (mostly bananas), onto the pitch and dressing in monkey costumes. It was reported that Rangers fans used \"implicit racism\" on the same day by singing \"I'd rather be a darkie than a Tim\". Although Celtic denounced the perpetrators, the Scottish Football Association (SFA) remained silent. According to Walters, he experienced worse racial abuse in Edinburgh against Hearts. Following racist abuse aimed at Walters, Rangers banned some of their own season ticket holders. Andrew Smith from The Scotsman newspaper stated, \"It is depressing to think that enforcement as much as enlightenment might account for Walters being the only black footballer in this country to have had bananas thrown at them.\"", "* Mark Walters debut"]}, {"page": "Holiday in Your Heart", "response": ["*Mark Walters as Carl"]}, {"page": "1995 Football League Cup Final", "response": ["|MF ||11|| Mark Walters"]}, {"page": "1992 FA Cup Final", "response": ["|MF ||14|| Mark Walters "]}, {"page": "List of Swindon Town F.C. players", "response": ["|Mark Walters ||||FW||1996–99 ||126||28"]}, {"page": "Mark Waters (disambiguation)", "response": ["* Mark Walters (born 1964), English footballer", "* Mark Walters (cyclist) (born 1976), Canadian former cyclist"]}, {"page": "List of Rangers F.C. international footballers", "response": ["| Mark Walters ||align=\"center\" colspan=\"2\"|  3 June 1991   ||align=\"center\"| 1"]}, {"page": "Johnny Hubbard", "response": ["He left Rangers in 1959 with 238 appearances and 106 goals for the club, moving to Bury for £6,000. After three years at Bury he returned to Scotland, spending two years with Ayr United before retiring from football to work as a physical education teacher and a community sports development officer. In 2007, he was named an honorary member of the Rangers Supporters Trust, along with Mark Walters and Billy Simpson."]}, {"page": "Walters (surname)", "response": ["* Mark Walters (born 1964), English football player"]}]}}