{"wiki_id": "http://www.wikidata.org/entity/Q7626359", "itemLabel": "Stuart Brightwell", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Brightwell", "wikipedia_page": {"main": "Stuart Brightwell (born 31 January 1979) is a former English football midfielder who spent one season in the USL First Division in the USA. He last played for Horden Colliery Welfare A.F.C. in the Northern League. Currently, he works as a coach at the i2i International Soccer Academy.\nBrightwell came up through the Manchester United youth system, before transferring to Hartlepool United in 1998. Brightwell played in 20 games for the Monkey Hangers. He then played for Bishop Auckland and Durham City. In November 2002, he transferred from Durham City to Spennymoor United. In the summer of 2004, he moved back to Durham City before transferring to Billingham Town on 12 October 2004.At Hetton Lyons CC, he scored a hattrick in the FA Sunday Cup Final.In May 2007, Brightwell signed with the Carolina RailHawks of the USL First Division. He played well, seeing extensive playing time, but was released by the team at the end of the season.", "link_mentions": [{"page": "Easington Academy", "response": ["The school's alumni include such professional footballers as Newcastle goalkeeper Steve Harper,Hartlepool fanzine , p36, article by Alan White, a former teacher at Easington Paul Kitson, Chris Brass, Paul Smith, John Hutton, Richard Ord, Stuart Brightwell, and Adam Johnson."]}, {"page": "1997–98 Manchester United F.C. season", "response": ["Leaving in the winter were Czech midfielder Karel Poborský, English forward Neil Mustoe, and English defender John O'Kane. Andy Duncan joined Cambridge United on 1 April, while on 12 June, Grant Brebner joined Reading. Robert Trees departed to Bristol Rovers on 14 June, while on 30 June, Stuart Brightwell, David Brown, Brian McClair, Ross Millard, Gavin Naylor, and Kevin Pilkington left.", "|  Stuart Brightwell"]}, {"page": "All-time North Carolina FC roster", "response": ["*  Stuart Brightwell"]}]}}