{"wiki_id": "http://www.wikidata.org/entity/Q7626763", "itemLabel": "Stuart Linnell", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Linnell", "wikipedia_page": {"main": "Stuart Linnell MBE is a semi-retired UK radio and television broadcaster, particularly well known in Coventry and Warwickshire, and in Northamptonshire. He is Chair of Healthwatch Coventry.\nAfter starting his career in his native Birmingham, he was part of the on-air team at the launch of Radio Hallam in Sheffield in 1974. He was also a front-line presenter at the launch of Coventry and Warwickshire’s first local radio station, Coventry based Mercia Sound, in 1980. He worked at Mercia for 15 years, becoming Programme Controller and Managing Director. \nLater, he spent ten years as a frontline presenter at BBC Radio Northampton until 29 March 2019, when he hosted his final regular daily radio show, having announced that he was then taking semi-retirement. He continued to broadcast in Coventry for BBC CWR,   and until the restrictions imposed as a consequence of the Covid-19 pandemic Linnell also hosted other occasional shows for BBC Radio Northampton. For the 2019/2020 football season, Linnell was the host of the Friday evening football phone-in on BBC CWR, where he had previously presented the Sky Blues match-day coverage, as well as other shows. In August 2021 he announced that he would no longer be part of BBC CWR’s football coverage. He continues to host a weekly programme for the online music station Serenade Radio (serenade-radio.com).\nDuring his career he also broadcast on national and regional television, and on national radio. He also hosted the breakfast shows on BBC WM and BBC CWR.", "link_mentions": [{"page": "BBC Radio Northampton", "response": ["* Stuart Linnell - veteran radio & TV presenter, former presenter of the breakfast and drivetime shows, also heard on BBC CWR."]}, {"page": "BBC Radio WM", "response": ["* Stuart Linnell "]}, {"page": "BBC CWR", "response": ["*Stuart Linnell"]}, {"page": "Northfield, Birmingham", "response": ["* Stuart Linnell - broadcaster."]}, {"page": "Radio Academy Awards", "response": ["|Stuart Linnell Breakfast Show"]}, {"page": "Midlands Today", "response": ["Former presenters have included Tom Coyne, Kay Alexander (the programme's longest serving presenter), Alan Towers, Alastair Yates, David Davies, Sue Beardsmore, Stuart Linnell, Matt Smith, Julian Worricker, Ashley Blake (who was sacked in August 2009 after a criminal court case), Suzanne Virdee and Jackie Kabler."]}, {"page": "Hallam FM", "response": ["* Stuart Linnell "]}, {"page": "Afternoon Delight", "response": ["\"Afternoon Delight\" charted well in New Zealand, peaking at #5. In Australia it was a #6 hit (Adelaide radio station 5KA was first to pick up the single, making it #1 in South Australia). In the UK, it reached #18 and was used as theme to a weekly show of the same title on London's Capital Radio, hosted by Duncan Johnson, and from 1980 on an afternoon show using the same title, broadcast every weekday at Mercia Sound in Coventry, presented by Stuart Linnell. It became a US #1 single on July 10, 1976 and earned a gold record. \"Afternoon Delight\" also reached #1 in Canada."]}, {"page": "Linnell", "response": ["*Stuart Linnell, British broadcaster"]}, {"page": "King's Norton Boys' School", "response": ["* Stuart Linnell, radio & TV presenter, Radio Hallam, Mercia Sound, BBC Local Radio, BBC West Midlands television, & former reporter for Sky Sports News"]}, {"page": "Kings Heath", "response": ["* Stuart Linnell MBE (born 1947 in Northfield, Birmingham), radio and TV presenter"]}, {"page": "Bob Brolly", "response": ["In 1994, and along with fellow broadcaster Stuart Linnell and the Coventry Telegraph, Brolly founded the Snowball charity to raise funds for good causes. This was followed in 1998 by the first Bob Brolly and Friends annual fundraising campaign. Brolly hosted his first charity fundraising ball in 1999, in aid of the Omagh Victim Support Fund and Leukemia Research, and featuring Irish artists and personalities such as Brendan Shine, Foster and Allen, Barry McGuigan and Majella O'Donnell. Brolly was awarded the MBE in the 2003 New Year Honours for his services to charity and broadcasting. He is also a past winner of the Irish World Radio Presenter of the Year Award, and the Irish Post Media Person of the Year Award."]}]}}