{"wiki_id": "http://www.wikidata.org/entity/Q7626878", "itemLabel": "Stuart Munro", "itemDescription": "Scottish footballer (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Munro", "wikipedia_page": {"main": "Stuart David Munro (born 15 September 1962 in Falkirk) is a Scottish former professional football player, who is best known for his time with Rangers.\nMunro was signed from Alloa Athletic and made his top team debut for the Rangers against Dundee on 25 February 1984, aged 21. The game ended in a 3–1 win. He played a further six seasons before with Rangers before being sold to Blackburn Rovers for £350,000.\nHe emigrated to Australia at the end of his career, appearing for Sydney United in the National Soccer League in what would be his final season of professional football.\nUpon retirement, he followed a coaching path, taking the reins at NSL clubs Gippsland Falcons, Carlton, Parramatta Power and South Melbourne.\nWith the end of that competition, Munro remained in Melbourne and was manager at Oakleigh Cannons from 2005 to 2008. Following the 2008 season he was appointed manager at Dandenong Thunder where he remained until 2011 when he was appointed assistant manager to his former Rangers teammate Ian Ferguson at Perth Glory. Munro spent 3 season as assistant at Perth Glory. He returned to the Thunder as manager in 2013 before taking on the role of technical director for the 2014 season. Munro once again took on the role as manager in 2015 but that season saw the club relegated from the Victorian top-flight. After leaving his role at Dandenong, Munro was appointed as the inaugural manager for newly founded Women's NPL Victoria club Southern United. At the end of the 2016 season Stuart was poached by Dandenong City for the 2017 NPL2 season. In 2019 he was appointed as head coach of Melbourne Knights ahead of the 2020 season", "link_mentions": [{"page": "South Melbourne FC", "response": ["Krnčević was replaced by former player Danny Wright for the 2002/03 season, but the club failed to reach the finals by a point. Stuart Munro took over as coach for the 2003/04 season, with the club finishing fifth, eventually being eliminated by a penalty deep into extra time against Adelaide United in what turned out to be South's final game in the NSL.", "*  Stuart Munro (2003–2004)"]}, {"page": "Sydney United 58 FC", "response": ["*Stuart Munro"]}, {"page": "Steve Laurie", "response": ["He returned to Australia after being lured back by former Rangers F.C. player and then coach Stuart Munro to play for National Soccer League powerhouse South Melbourne FC in the last season of the NSL.", "After returning to Victoria, Laurie played for South Melbourne once more as well as a season at Oakleigh Cannons. Then Steve Laurie moved to Altona Magic and was promoted to captain in 2009 and led the club to championship win over highly fancied Dandenong Thunder coached by Laurie's former coach at South Melbourne and then Oakleigh Cannons Stuart Munro. 2009 was a watershed season for Laurie as the giant defender had an injury free season and was able to show all football fans why he had been on West Ham's books as a youngster."]}, {"page": "History of Rangers F.C.", "response": ["On 10 November 1983, Jock Wallace was persuaded by the Rangers board to leave Motherwell and return to the club. His aim was to restore the glory years of the treble-winning sides of the late 1970s. Wallace's initial impact was positive, boosting morale and fitness. He made changes to the coaching staff, bringing in Alex Totten as first team coach with Tommy McLean, David Provan and Joe Mason leaving. Wallace also added to the squad during the season, Bobby Williamson arrived from Clydebank, Nicky Walker from old club Motherwell and Stuart Munro from Alloa Athletic."]}, {"page": "Tom Cowan", "response": ["Cowan was at Ibrox for another two years, both of which also ended in championship success, but was competing for a place with the experienced Stuart Munro and fellow youngster Chris Vinnicombe and had only a peripheral role. He did feature in the European Cup against Bayern Munich in Germany (the team having lost at home in the first leg), and in what proved to be his final appearance, took part in the title decider in 1991 when a depleted Rangers squad defeated Aberdeen 2–0; however he suffered a broken leg during the match (attempting to play on with the injury for several minutes before being substituted) and the club then signed the left back of the opposition on that day, David Robertson, to fill the position."]}, {"page": "Dandenong Thunder SC", "response": ["In 2015, Thunder slashed its budget in an attempt to reduce club debt, and replaced many higher earners with young and inexperienced but talented players. Then manager Dean Hennessey also departed, joining Hume City, and the club brought in Stuart Munro as the new head coach. The season didn't go to plan, though, with the team struggling to put together good performances. Relegation was confirmed in Round 25, when the side lost 3–0 to North Geelong Warriors.", "*2009– Victorian Premier League Coach of the Year: Stuart Munro"]}, {"page": "Jeff Hopkins", "response": ["Hopkins was named player-manager of the Gippsland Falcons in the lead-up to the 1999-2000 National Soccer League Season after the departure of Stuart Munro to rivals Carlton SC. Hopkins became full-time manager during the season and retired from playing. He departed when the club exited the National Soccer League at the end of the 2000-2001 National Soccer League Season."]}, {"page": "Dandenong City SC", "response": ["For the 2017 NPL2 East season, City announced that Stuart Munro had been appointed as the club's new senior head coach, with former Melbourne Victory midfielder Tom Pondeljak named as his assistant. Dandy started its 2017 recruitment in sensational fashion, securing the services of Adelaide United FC A-League championship winning winger Mate Dugandzic. The club also signed former A-League players Nick Kalmar and Ljubo Milicevic. City finished the regular season in second place, 11 points off league champions Thunder. Shaun Filipović took out the golden boot with 19 goals. After defeating Moreland Zebras in the promotion playoff, Dandenong City faced Melbourne Knights FC, with the winner taking a spot in the National Premier Leagues Victoria top flight for 2018. A Kym Harris hattrick saw Knights race out to a 3-0 lead. Two goals in the last five minutes gave City hope, but the match ultimately ended 3-2 and Knights kept its spot in the NPL."]}, {"page": "Munro (surname)", "response": ["* Stuart Munro (born 1962), Scottish football player"]}, {"page": "1991–92 Rangers F.C. season", "response": ["| Stuart Munro ||  Blackburn Rovers || £0.35m "]}, {"page": "1988–89 Rangers F.C. season", "response": ["|align=\"left\" | Stuart Munro"]}, {"page": "1987–88 Rangers F.C. season", "response": ["|align=\"left\" | Stuart Munro"]}, {"page": "1989 Scottish Cup Final", "response": ["|DF |||| Stuart Munro || || "]}, {"page": "1986–87 Rangers F.C. season", "response": ["|align=\"left\" | Stuart Munro"]}, {"page": "1985–86 Rangers F.C. season", "response": ["|align=\"left\" | Stuart Munro"]}, {"page": "1986 Scottish League Cup Final", "response": ["|LB ||||Stuart Munro"]}, {"page": "1989 Scottish League Cup Final", "response": ["|LB ||||Stuart Munro"]}, {"page": "1988 Scottish League Cup Final", "response": ["|DF ||||Stuart Munro"]}, {"page": "1987 Scottish League Cup Final", "response": ["|LB ||3|| Stuart Munro"]}, {"page": "1990 Scottish League Cup Final", "response": ["|LB ||||Stuart Munro"]}, {"page": "1984–85 Rangers F.C. season", "response": ["|align=\"left\" | Stuart Munro"]}, {"page": "1983–84 Rangers F.C. season", "response": ["Rangers were overseen by former midfielder Tommy McLean, who acted as caretaker, whilst attempts were made to find a new permanent manager. On 10 November 1983, Jock Wallace was persuaded by the Rangers board to leave Motherwell and return to the club. His aim was to restore the glory years of the treble-winning sides of the late 1970s. Wallace's initial impact was positive, boosting morale and fitness. He made changes to the coaching staff, bringing in Alex Totten as first team coach with Tommy McLean, David Provan and Joe Mason leaving. Wallace also added to the squad during the season; Bobby Williamson arrived from Clydebank, Nicky Walker from old club Motherwell and Stuart Munro from Alloa Athletic.", "|align=\"left\" | Stuart Munro"]}, {"page": "Stuart Kelly (footballer)", "response": ["In 2008 Kelly signed for Australian Club Oakleigh Cannons, playing under former Glasgow Rangers and Scotland player Stuart Munro."]}, {"page": "Dubai Champions Cup", "response": ["|DF |||| Stuart Munro"]}]}}