{"wiki_id": "http://www.wikidata.org/entity/Q7627257", "itemLabel": "Stuart Wolfenden", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Wolfenden", "wikipedia_page": {"main": "Stuart Wolfenden (born 7 February 1970) is an English actor. He has played three different roles in Coronation Street, first as paper boy Craig Russell, then as Mark Casey and later as Greig Hodge. More recently he joined the cast of Hollyoaks as Terry Hay, the father of regular character Ste Hay.", "link_mentions": [{"page": "North Chadderton School", "response": ["* Stuart Wolfenden, actor"]}, {"page": "Bruce Jones (actor)", "response": ["In 1995, Jones had a role as a prostitute's client in Band of Gold. In 1996 he appeared as Bob in the film Bob's Weekend, then went on a UK national tour of The Wonderful World of Pantomime produced by Broomstick Productions playing the part of the \"Good Robber\" alongside playwright Charlotte Jones and Stuart Wolfenden (Coronation Streets's Mark Casey) and directed by Gary Broomhead. In 1997, he had a small part in the film The Full Monty. He played one of the males who auditioned to be a stripper, and he received the Stage Actor's Guild Award, (SAG). He also appeared in the Shane Meadows film Twenty Four Seven with actor Bob Hoskins in 1997."]}, {"page": "Dead Man's Shoes (2004 film)", "response": ["Dead Man's Shoes is a 2004 British psychological thriller film directed by Shane Meadows and starring Paddy Considine, both of whom co-wrote the film with Paul Fraser. The film also stars Toby Kebbell, Gary Stretch and Stuart Wolfenden. It was released in the United Kingdom on 1 October 2004 and in the United States on 12 May 2006. Filming took place in the summer of 2003 over the course of three weeks.", "* Stuart Wolfenden as Herbie"]}, {"page": "List of former Coronation Street characters", "response": ["|Mark Casey || Stuart Wolfenden || 1989–1991", "|Greig Hodge || Stuart Wolfenden || 2015"]}, {"page": "Oranges and Sunshine", "response": ["* Stuart Wolfenden as Bill"]}, {"page": "List of British films of 2012", "response": ["|| Director: David Blair   Cast: Stephen Graham, Adewale Akinnuoye-Agbaje, Maxine Peake, Emma Stansfield, David O'Hara, Ryan Barr, Stuart Wolfenden, Sarah Parks, Peter Wight, Lee Ingleby"]}, {"page": "List of Coronation Street characters (2015)", "response": ["Jackson first appears when Faye and her parents, Anna Windass (Debbie Rush) and Owen Armstrong (Ian Puleston-Davies) sit next to him and his parents, Greig (Stuart Wolfenden) and Josie Hodge (Una McNulty). Jackson is confirmed as the father of Faye's baby Miley, after she gives birth in an abandoned flat in April 2015. However, Jackson denies that he is Miley's father, even though he is, when Anna calls Greig and Josie to her flat to inform them of this. When Anna takes Miley to Weatherfield High School to force Faye to take responsibility of her daughter, Jackson tells Greig and Josie the truth, with Josie taking Jackson to the Windasses' to apologise and bond with Miley. When Faye is unable to bond with Miley, Josie and Greig offer for Miley to live with them and Jackson and when the Hodges later decide to leave for Canada in June 2015, they take Miley with them, devastating the Windasses, except Faye, who believed that Miley would be better off there."]}, {"page": "The Pebble and the Boy", "response": ["After staying at a night at a Pub, and befriending some bikers (Stuart Wolfenden) and (Emma Stansfield ) Nicki decides to visit another Mod friend of John's dad, Ronnie(Ricci Harnett) and Sonia (Patsy Kensit ). They stay at the their house overnight, where after  telling JOhn about his father , they start drinking and taking drugs. Late in the night,  Ronnie inexplicable flips out in a jealous rage, talking about someone called Ali causing trouble with his wife. Ronnie tries to stop them for leaving, however he gives them money for their trip, but gives it to his son Logan, who accompanies them on his scooter.", "*Stuart Wolfenden as Geoff"]}]}}