{"wiki_id": "http://www.wikidata.org/entity/Q7626576", "itemLabel": "Stuart Gillies", "itemDescription": "British chef", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Gillies", "wikipedia_page": {"main": "Stuart Gillies is an English chef and former CEO of the Gordon Ramsay Group, appointed in 2016 after working as managing director for the group from 2011.After training in the UK, Gillies spent a year in Rome at the Lord Byron Hotel, and three years in Stockholm, Sweden. He then moved to Daniel's in New York City, working under the direction of Daniel Boulud. On returning to the UK, he worked at Le Caprice in London. He joined Angela Hartnett as head chef at The Connaught, before opening the Gordon Ramsay-owned Boxwood Café in May 2003. He was chef director at the reopened Savoy Hotel from October 2010, and at Plane Food.Gillies has appeared on television on GMTV, and as a guest on BBC1’s Saturday Kitchen. He was chosen to compete in the second series of the Great British Menu in Spring 2007, losing in the south-east England heat to Atul Kochhar. He lives in Chislehurst with his wife and four sons, where has recently opened The Bank House restaurant.", "link_mentions": [{"page": "Savoy Hotel", "response": ["The new design features a Thames Foyer with a winter garden gazebo under a stained-glass cupola with natural light, which is the venue for late-night dining and the hotel's famous afternoon tea. The glass dome had been covered since World War II.\"The Savoy Hotel: Bars, Restaurants, Afternoon Tea and the Ballroom\", Blogvisitlondon.com, 19 August 2010, accessed 13 September 2010 A new teashop and patisserie is called Savoy Tea, and a glass-enclosed fitness gallery with rooftop swimming pool, gym and spa are located above the Savoy Theatre. The new Beaufort Bar has an Art Deco interior of jet-black and gold and offers nightly cabaret.Kent, Pam. \"Savoy, London Landmark of Luxury, Reopens\". The New York Times, 10 October 2010 The River Restaurant (now renamed Kaspar's), facing the Thames, is also decorated in the Art Deco style, but the American Bar is nearly unchanged.Shalam, Sally. \"The Savoy, The Strand, London\", The Guardian, 6 May 2011, accessed 10 January 2012 The rooms are decorated in period styles harmonised with the adjacent hallways, and they retain built-in wardrobes and bedroom cabinets. The decor is Edwardian on the Thames river side and Art Deco on the Strand side.Dombek, Carl. \"London's Savoy Hotel: Stompin' to Resume in 2010\", travelpro, 6 November 2009\"Reopening date set for The Savoy\". The Independent, 18 June 2010, accessed 9 August 2010 Butler service was also reintroduced to the hotel.Block, Elinor. \"Behind the scenes at the brand-new Savoy hotel\". Conde Nast Traveller, 10 September 2010 Gordon Ramsay manages the Savoy Grill with Stuart Gillies as Chef Director and Andy Cook as Head Chef.Curtis, Nick and Jonathan Prynn. \"Will The Savoy ever regain its long lost glamour?\", London Evening Standard, 5 February 2010, accessed 13 October 2015 In a nod to the hotel's origins, six private dining rooms are named after Gilbert and Sullivan operas.\"The Savoy London Hotel: Meetings & Banquets\" . The Luxury Hotels & Resorts of the World website, accessed 8 July 2011\"The Savoy\", The Handbook,  accessed 7 March 2013  The hotel contains a small museum next to the American Bar, open to the public, with a revolving exhibition of items from the hotel's archives. A motor launch is available to take small parties from the Savoy Pier in front of the hotel for champagne river tours.Curtis, Nick. \"The host of London: the Savoy Hotel\", London Evening Standard, 13 August 2014", "Since Gordon Ramsay employed his former protégé Marcus Wareing in the less formal Savoy Grill, the restaurant earned its first Michelin star. The Grill was originally \"where people go to eat a modest luncheon or to dine on the way to the theatre without spending too much time or too much money\".The Times, 18 November 1904, p. 7 Since 2010, the chef patron has been Stuart Gillies. From 2015 to 2017, Kim Woodward, a former contestant on the TV show MasterChef: The Professionals, became the Grill's first female Head Chef.Mortimer, Caroline. \"Former MasterChef contestant Kim Woodward becomes first woman head chef at Savoy Grill restaurant\", The Independent, 25 April 2015; and Gerrard. Neil. \"D&D London appoints Kim Woodward as executive chef of Skylon\", TheCaterer.com, 9 February 2017 The Thames Foyer serves breakfast, morning coffee, light lunch and supper, as well as afternoon tea, accompanied by the hotel's resident pianist.\"Dining and Bars\", Savoy Hotel, Fairmont.com, accessed 13 May 2019 Also part of the hotel buildings is Simpson's-in-the-Strand, featuring classic British style cuisine. Its specialties are aged Scottish beef on the bone, potted shrimps, roast saddle of lamb and steak and kidney pie.\"Simpson's-in-the-Strand\", FRHI, accessed 12 May 2019"]}, {"page": "Great British Menu", "response": ["*Week 5 – 30 April to 4 May – Atul Kochhar (won heat) and Stuart Gillies represent the South East of England"]}, {"page": "Saturday Kitchen", "response": ["* Stuart Gillies"]}, {"page": "Gillies", "response": ["* Stuart Gillies (born 1986), Composer of \"The Longest Reign\" music written for Queen Elizabeth the second", "* Stuart Gillies (born before 1987), English chef"]}, {"page": "Johnny Douglas (conductor)", "response": ["Moira Anderson, Shirley Bassey, The Bachelors, John Boulter, June Bronhill, Dora Bryan, Max Bygraves, Stuart Gillies, Dulcie Gray, John Hanson, Dickie Henderson, Vince Hill, Frankie Howerd, Teddy Johnson, Denis Lotis, Vera Lynn, Janie Marden, Alfred Marks, Kenneth McKellar, Lita Roza, Mike Redway, Joan Regan, Malcolm Roberts, Patricia Routledge, Harry Secombe, Semprini, Anne Shelton, Jimmy Tarbuck, Bruce Trent, Dickie Valentine, Frankie Vaughan, David Whitfield, Rita Williams, Mark Wynter and Jimmy Young, Shirley Jones, Howard Keel, Al Martino, Barbra Streisand, Tex Ritter."]}]}}