{"wiki_id": "http://www.wikidata.org/entity/Q7626677", "itemLabel": "Stuart Hughes", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Hughes_(politician)", "wikipedia_page": {"main": "Stuart Hughes is an English politician representing voters at all three levels of local government in Devon, in the West of England. He represents Sidmouth Sidford as a councillor on East Devon District Council and on Devon County Council, where he is currently Cabinet member for Highways Management. He is also a Sidmouth town councillor.\nAfter twice standing unsuccessfully for the House of Commons as a Raving Loony, he was elected at the district and county level in Devon in 1991 and 1993 for the Raving Loony Green Giant Party, becoming the party's first successful candidate at a contested election of any kind. However, he defected to the Conservatives in 1997 and has been elected for them ever since.", "link_mentions": [{"page": "Official Monster Raving Loony Party", "response": ["The first party member to win a vote, rather than an uncontested election, was Stuart Hughes, taking the \"safe\" Conservative Party seat of Sidmouth Woolbrook on East Devon District Council in May 1991. He also took a seat on Sidmouth Town Council from the Conservatives the following day. His success was met with hostility from the local Tories. Hughes' reaction was to attempt to make their lives a misery for the next three years by refusing to pay his Community Charge (popularly known as the Poll Tax), then dumping scrap metal in the middle of the council chambers to the value of his unpaid tax when threatened with legal action. He also formed an alliance known as \"The Coastals\" (because of the seats they held) of Independents and the sole Green Party councillor, giving East Devon's ruling Conservatives the first true opposition they had faced for decades (the local Liberal Democrat and Labour parties being negligible).", "The Loonies generally field as many candidates as possible in United Kingdom general elections, some (but by no means all) standing under ridiculous names they have adopted via deed poll. Sutch himself stood against all three main party leaders (John Major, Neil Kinnock and Paddy Ashdown) in the 1992 general election. Parliamentary candidates have to pay their own deposit (which currently stands at £500) and cover all of their expenses. No OMRLP candidate has managed to get the required 5% of the popular vote needed to retain their deposit, but this does not stop people standing. Sutch came closest with 4.1% and over a thousand votes at the Rotherham by-election, whilst Stuart Hughes still holds the record for the largest number of votes for a Loony candidate at a Parliamentary election, with 1,442 at the 1992 general election in the Honiton seat in east Devon. The all-time highest vote achieved was by comedian Danny Blue, who secured 3,339 votes in the 1994 European elections under the pseudonym of \"John Major\". Bamford had also acted as an election agent for Lindi St Clair's rival Corrective Party, and was a former close associate of Stuart Hughes."]}, {"page": "Sidmouth", "response": ["* Stuart Hughes (politician)"]}, {"page": "Howling Laud Hope", "response": ["Hope is the only OMRLP candidate to have been elected to public office, although an ex-member, Stuart Hughes, won a seat on East Devon District Council for the Raving Loony Green Giant Party in 1991."]}, {"page": "Stuart Hughes (disambiguation)", "response": ["Stuart Hughes is a Canadian actor.", "Stuart Hughes is also the name of:", "* Stuart Hughes (politician), British politician in the Official Monster Raving Loony Party", "* H. Stuart Hughes, American academic"]}, {"page": "1990 Mid Staffordshire by-election", "response": ["When nominations closed on 8 March there were seven further candidates. Screaming Lord Sutch of the Official Monster Raving Loony Party, a frequent by-election candidate, was nominated under the name 'Lord David Sutch' after changing his name by deed-poll. He chose the description 'Monster Raving Loony Green Teeth' but was faced with a rival: Stuart Hughes, who was a member of a breakaway group, stood as a Raving Loony Green Giant Supercalifragilistic candidate with the assistance of election agent Danny Bamford. John Hill was the candidate of the National Front while David Black stood as 'Christian Patriotic Alliance Save Britain Campaign' and Nicholas Parker-Jervis stood as 'Against Immigration Conservative Green'.Nicholas Wood, \"Tories plead for minister to help them\", The Times, 9 March 1990"]}, {"page": "Raving Loony Green Giant Party", "response": ["The party was led by Stuart Hughes, who had formerly been an election agent for the Official Monster Raving Loony Party (OMRLP).  He fell out with the OMRLP party leadership following the 1989 European Parliament election, at which Hughes claimed to have become a Member of the European Parliament for 30 seconds after the returning officer incorrectly awarded him the Conservative Party candidate's votes.", "The party managed to stand a full slate of candidates for the Cannock Chase District Council elections in Staffordshire in 1990.Byron Criddle and Robert Waller, Almanac of British Politics  Leader Stuart Hughes was elected to East Devon District Council and to Sidmouth Town Council in 1991, along with another RLGGP candidate, Stuart Greenwood.  Hughes' first council meeting was recorded by a television crew from Australia and a reporter for The Observer newspaper, although he agreed with other council members that he would not wear his Loony campaigning outfit.  Also in 1991, David and June Beesley were elected in Ribble Valley. In 1993, Hughes was elected to Devon County Council, representing the Sidmouth Rural ward."]}]}}