{"wiki_id": "http://www.wikidata.org/entity/Q7626741", "itemLabel": "Stuart Lampitt", "itemDescription": "English cricketer (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Lampitt", "wikipedia_page": {"main": "Stuart Lampitt (born 29 July 1966, in Wolverhampton) is a former English cricketer. He was a right-handed batsman and a right-arm medium-pace bowler. He played for Worcestershire from 1985 to 2002. During his career he was victorious in the 1986 final of the William Younger Cup, and helped his team to the semi-finals of the Benson and Hedges Cup of 1995. He took 370 List A wickets in all for Worcestershire, a record for the county.\nLampitt played his last first-class matches in 2001, but continued for another season as a one-day specialist. He made one final List A appearance in 2003, for the recreational Worcestershire Cricket Board team against the professional Worcestershire side in the C&G Trophy, but had little success, bowling ten wicketless overs for 67 and scoring 26 not out.\nAfter retiring Lampitt took up a full-time position as Cricket Development Officer for the Worcestershire Cricket Board.\nIn November 2017 he became the administrator of the Worcestershire County Cricket League, the biggest cricket league in Worcestershire and a feeder to the Birmingham and District Premier League.", "link_mentions": [{"page": "July 29", "response": ["*  1966   – Stuart Lampitt, English cricketer"]}, {"page": "Worcestershire County Cricket Club", "response": [":1989: Stuart Lampitt", "*8th: 184 by Steve Rhodes and Stuart Lampitt v. Derbyshire, Kidderminster, 1991"]}, {"page": "Wall Heath", "response": ["The village has produced three professional cricketers; John (Jack) Alfred Flavell, Paul Pridgeon and Stuart Lampitt. All played for Worcestershire CCC, with Jack Flavell playing for the England national team."]}, {"page": "Worcestershire County Cricket League", "response": ["*Stuart Lampitt Rushwick"]}, {"page": "Adam Seymour (cricketer)", "response": ["He played regular first-team cricket for the first part of 1993, but made only one fifty in either form of the game, hitting an unbeaten 54 against the Australians at Worcester in early May. Seymour shared in a defiant unbroken stand of 121 with Stuart Lampitt after Worcestershire had been forced to follow on. He accompanied Worcestershire on their 1993–94 tour of Zimbabwe, scoring 30 against a Matabeleland Invitation XI at Bulawayo. In 1994 he was almost a one-day specialist for Worcestershire, turning out in nine List A matches but only three first-class games; these were the last first-class matches of his career. A minor one-day highlight was his solitary wicket at first-team level: that of Norfolk's Rodney Bunting, whom he trapped lbw in a first-round NatWest Trophy match at Lakenham in June."]}, {"page": "List of people from Wolverhampton", "response": ["* Stuart Lampitt (born 1966) – cricketer, right-handed batsman and a right-arm medium-pace bowler; took 370 List A wickets in all for Worcestershire, a record for the county"]}, {"page": "List of tied first-class cricket matches", "response": ["Stuart Lampitt 3/33"]}, {"page": "Warwickshire County Cricket Club in 1994", "response": ["Worcestershire chose to bowl first on a gloomy first day which saw 62 overs lost to the weather. Warwickshire lost three wickets on the opening day, openers Andy Moles and Roger Twose both scored 39 with Brian Lara making five. On the second day Warwickshire lost their last seven wickets for 87 in 44 overs, Stuart Lampitt was the pick of the bowlers taking three wickets to finish with figures of 4/32. Worcestershire openers Philip Weston and Tim Curtis had both scored unbeaten half-centuries before the close. The pair had shared 208 for the opening partnership when Weston fell six short of a first century of the season, Curtis went on to score 180 in over eight hours of batting. In the post-tea session David Leatherdale (71*) and Lampitt (56*) capitalised on poor bowling to boost the total by 133 in 25 overs. A declaration left Warwickshire with a deficit of 257 and 116 overs to play, in a 14 over spell on the third evening they lost two wickets. Nightwatchman Graeme Welch (66) and Moles (67) put on 135 for the third wicket and with further half-centuries from Trevor Penney and Lara (57) Warwickshire comfortably survived the final day to draw the match."]}, {"page": "Test and County Cricket Board Under-25s XI cricket team", "response": ["A Test and County Cricket Board Under-25s XI was a cricket team formed by the Test and County Cricket Board which was made up of players under 25 years of age. The players were considered to be on the fringes of selection for the England cricket team. The team played one match which was rated as first-class against the touring Indians in August 1990. Of the eleven that started the match, only John Stephenson and Nasser Hussain had played Test cricket prior to this match. The team included future Test cricketers Martin Bicknell, Richard Blakey, Richard Illingworth, Tim Munton, and Graham Thorpe. The remainder of the team consisting of Paul Johnson, Stuart Lampitt, Keith Medlycott and Nadeem Shahid would never play at international level. Of the Test cricketers, Hussain would be the most successful, making 96 Test appearances and captaining England in 45 Tests. The teams only first-class match against the Indians ended in a draw, with Indian batsman Sanjay Manjrekar and Navjot Sidhu both scoring centuries, a feat also achieved by the Under-25s XI captain John Stephenson."]}, {"page": "2001 Norwich Union League", "response": ["| align=\"left\"| Stuart Lampitt"]}, {"page": "List of Worcestershire Cricket Board List A players", "response": ["*Stuart Lampitt (2003): SR Lampitt"]}]}}