{"wiki_id": "http://www.wikidata.org/entity/Q7627167", "itemLabel": "Stuart Townend", "itemDescription": "Christian songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Townend_(musician)", "wikipedia_page": {"main": "Stuart Townend (born 1963) is an English Christian worship leader and writer of hymns and contemporary worship music. His songs include \"In Christ Alone\", (2001, co-written with Keith Getty, Townend's first collaboration with any other songwriter), \"How Deep The Father's Love For Us\", \"Beautiful Saviour\" and \"The King of Love\". As of 2008, Christian Copyright Licensing International (CCLI) lists \"In Christ Alone\" in its Top 25 CCLI Songs list.", "link_mentions": [{"page": "Hymnwriter", "response": ["Leading British hymn writers have included John Henry Newman (1801–1890), John Mason Neale (1818–1866), Timothy Dudley-Smith (born 1926), Michael Perry (1942–96), Michael Saward (1932–2015), Christopher Idle (born 1938), Fred Pratt Green (1903–2000), as well as James Quinn (1919–2010) and Brian Foley (1919–2000). More recent evangelical hymn/song writers have included Stuart Townend (born 1963), Keith Getty (born 1974) and his wife Kristyn Getty (born 1980)."]}, {"page": "All Souls Church, Langham Place", "response": ["Musical worship mixes contemporary and traditional styles, featuring either the church's worship band, orchestra, singing group or choir at all the main regular Sunday services, under the leadership of Michael Andrews. In 1972, the All Souls Orchestra was founded by former director of music and Emeritus Conductor, Noël Tredinnick, and has accompanied Sir Cliff Richard, Stuart Townend and other notable Christian artists. The orchestra and a massed choir perform annually at the Royal Albert Hall for the All Souls \"Prom Praise\" concert, which also tours across the UK and internationally. \"Prom Praise for Schools\" is sometimes held alongside Prom Praise, providing children from across the Diocese of London the chance to sing with the All Souls Orchestra. In 2012, the All Souls Orchestra celebrated its 40th anniversary, alongside special guests including Graham Kendrick, Keith & Kristyn Getty, and Jonathan Veira."]}, {"page": "Word Alive", "response": ["| align=\"center\"|2008|| align=\"center\" |7/4 – 11/4||Don Carson, John Piper, Terry Virgo||Stuart Townend, Phatfish, Lou Fellingham", "| align=\"center\"|2009|| align=\"center\" |30/3 – 4/4 (Wk1)4/4 – 9/4 (Wk2)||Vaughan Roberts (Wk1), Liam Goligher (Wk2);Don Carson, Terry Virgo, Krish Kandiah||Stuart Townend, Phatfish, Lou Fellingham (Wk1); Keith & Kristyn Getty (Wk2)", "| align=\"center\"|2010|| align=\"center\" |13/4 – 18/4||Hugh Palmer, Jerry Bridges, Wayne Grudem, Rebecca Manley-Pippert, Richard Coekin||Stuart Townend, Sam Parker", "| align=\"center\"|2012|| align=\"center\" |31/3 – 5/4||Jonathan Lamb, Paul David Tripp, Rebecca Manley-Pippert, Richard Pratt, John Wyatt, William Taylor||Stuart Townend, Lewis Green", "| align=\"center\"|2014|| align=\"center\" |7/4 – 12/4 (Wk1)||Don Carson||Stuart Townend", "| align=\"center\"|2015|| align=\"center\" |28/3 – 2/4 (Wk1)2/4 - 6/4 (Wk2)||David Cook||Stuart Townend"]}, {"page": "Terl Bryant", "response": ["Bryant's website boasts a career spanning more than four decades, with a 1000 plus recording sessions and more than 50 world tours working with an extensive list of well known artists including Peter Gabriel, Matt Redman, Roddy Frame, Faith Hill, Maddy Prior, Louise Redknapp, Lulu, tobyMac, Barbara Dickson, Eden's Bridge, Patti Boulaye, Jim Kerr, Arthur Brown, Adrian Edmondson, Stuart Townend and others.", "* Stuart Townend – The Journey (2011)"]}, {"page": "The Friendship and the Fear", "response": ["* Stuart Townend – keyboards "]}, {"page": "Passion for Your Name", "response": ["* Stuart Townend – additional keyboards"]}, {"page": "List of Christian worship music artists", "response": ["* Stuart Townend"]}, {"page": "Phatfish", "response": ["Phatfish (1994–2014) were a Christian rock, CCM and worship band. They lived in Brighton, England and spent twenty years writing and performing their own brand of worship-oriented rock, as well as leading worship both in the UK and across the world. They released a number of their own albums and played alongside many well-known worship leaders. They also appeared on many worship albums and on national television programmes such as BBC1's Songs of Praise. Their home church was Church of Christ The King, home of Stuart Townend and other prominent Christian figures.", "Phatfish's song \"Holy Holy\" has been played over 124,000 times on YouTube and the track \"In Christ Alone\", with Phatfish playing and Lou Fellingham leading alongside Stuart Townend, has been played over 5.7 million times.", "Three unplugged gigs in different parts of the UK were recorded for the 'Hope' album in January 2002. The gigs and subsequent album raised money for AIDS orphans in Africa through the charity Hope HIV. Special guests Stuart Townend, Kate Simmonds and Brian Houston joined Phatfish at the gigs. The 2006 DVD release There is a Day includes the Brighton unplugged gig.", "The band appeared several more times on the BBC's Songs of Praise. They also supported lead singer Lou and friend Stuart Townend on a Stu + Lou tour taking them to various locations around the UK.", "Since their formation, Phatfish were called upon as a worship band to lead and assist others at conferences and their local church CCK. The band often led worship alongside high-profile worship leaders like Matt Redman, Kate Simmonds and Stuart Townend at Christian conferences around the UK and abroad. Lou Fellingham either led herself or was a backing vocalist to the worship leader. In addition, they offered practical advice about Christian music and leading worship on their Working As A Band double-disc CD and have often taught this material at worship seminars and one-day events.", "The band featured on three albums which have won the coveted CBC Praise & Worship Album of the year award; two Stoneleigh albums Ruach and Beautiful Saviour, and Stuart Townend's Best of Stuart Townend Live."]}, {"page": "Revival (Petra album)", "response": ["# \"How Long\" (Words by Stuart Townend) – 4:06"]}, {"page": "Hymns Ancient and Modern", "response": ["In March 2013 Canterbury Press published Ancient and Modern, so reverting to the original title without the word \"Hymns\", but also subtitled Hymns and Songs for Refreshing Worship, a brand new edition designed for contemporary patterns of worship. It contains 847 items, including some items from Common Praise and Sing Praise, ranging from psalm settings to John L. Bell, Bernadette Farrell, Stuart Townend and others. In 2014 the British organist John Keys completed recordings of organ accompaniments of all the hymns in the book."]}, {"page": "Live from Atlanta", "response": ["#\"Beautiful Savior\" (Stuart Townend) – 5:59"]}, {"page": "Lou Fellingham", "response": ["Louise \"Lou\" Fellingham (née Hunt), (born 5 May 1974), is a Christian worship leader, singer and songwriter from Brighton in East Sussex, England. She is a founding member of the British band Phatfish and has also pursued a solo career. In 2008, she won a Christian Broadcasting Council (CBC) Award for her album Promised Land, in the category of Best Worship. She has worked alongside other Christian artists such as Matt Redman, Graham Kendrick, Tim Hughes and Stuart Townend. She regularly leads worship and performs at different venues around the world. A rendition of Fellingham leading the hymn \"In Christ Alone\" has had more than six million views on YouTube.", "The family attends the Church of Christ the King (CCK), where they are frequently involved in leading worship and musical projects. In particular, Fellingham serves the church by training and managing their 50-member church choir. Nathan's father, David Fellingham has served as one of the elders since 1979. The church is also home to Stuart Townend, Paul Oakley and other prominent Christian figures. The evangelical church is affiliated with the Newfrontiers neocharismatic church network and is located at the Clarendon Centre near Brighton railway station.", "In 2006 and early 2007, before work on the next Phatfish studio album started, Fellingham began performing songs from Treasure on a \"Stu and Lou\" Tour, with Stuart Townend, which took them to various locations around the UK. When Phatfish's Guaranteed was released in July 2007, it received positive reviews and high sales at Christian events. With the success of both Fellingham's Treasure, and Phatfish's Guaranteed, rather than embark on an official Guaranteed tour, Phatfish followed up with a series of one-night shows and a TV appearance on Premier TV, under the banner Phatfish and Lou Fellingham.", "In early 2008, the band performed two more Phatfish and Lou Fellingham concerts in connection with Hope 08. The first event was in Brighton, as part of \"Soul By The Sea\"; the second in Gloucester on 14 March. Lou Fellingham led worship at the Kingsway's Children's Ministry conference in January, and the band gigged and led worship at New Word Alive in Wales alongside Stuart Townend. There were five more concerts in 2008; Keswick, Crawley, NEWI, Danbury and Bognor Regis Bible Week.", ":So, we’re out sometimes as Phatfish, sometimes as Lou Fellingham, Lou Fellingham Band, whatever. Sometimes it’s Stuart Townend’s Worship Band—you know. All these different things—it’s all us. It’s all the same heart, just slightly different expressions of different songs.", "More recently, concerts have been titled Phatfish and Lou Fellingham, with songs from Lou Fellingham's set of works and Phatfish's works being played, in addition to older songs, as well. Phatfish and Lou Fellingham have also supported Stuart Townend in Cheltenham and Wrexham, with less dynamic lighting and a more acoustic sound.", "In addition to other musical projects, Fellingham continues to lead worship and head up the choir at her local church. She is still a faithful member of the band Phatfish and they have just released their latest full studio album, In Jesus. Recent appearances at Newday, Souled Out, The Cheltenham Bible Conference, Brighton, Wrexham, Soul By The Sea and Gloucester have been titled \"Phatfish and Lou Fellingham\". Phatfish and Lou Fellingham have also led worship at the Mission:Worship conference alongside Stuart Townend and Matt Redman in Eastbourne. Additionally, they participated on the Mission:Worship album released by Kingsway Music/Survivor Records titled A New Day Of Worship.", "Throughout 2008 and 2009, Fellingham has led worship and performed at events such as Keswick Ministries, New Word Alive, Kingsway Children's Conference, Radiant, Newfrontiers, Newday, and other artists such as Tim Hughes at Mission:Worship. She appeared at The Big Church Day Out and Pentecost Festival with Phatfish. There were also appearances and engagements leading worship with Matt Redman, Stuart Townend, Martyn Layzell and others. The Newfrontiers organised conferences, Together On A Mission and Newday, gathered crowds of up to 6,000 people. The largest crowds were at the Stoneleigh Bible Week, where in its final year, there was a record 26,000 persons in attendance.", "Stuart Townend has been present at some of the recordings, although Lou Fellingham performed his \"In Christ Alone\" in 2005 when it featured on the list of the \"10 most popular hymns in Britain\".", "* Stuart Townend", "Following the success of Treasure, Fellingham teamed up with Stuart Townend for a \"Stu and Lou\" tour with Phatfish. The tour took them to various places around the UK with Fellingham performing tracks from Treasure, while Stuart performed selected tracks from his album, Monument to Mercy.", "|  2006||Monument To Mercy by Stuart Townend|| ||", "|  2007||The Best Of Stuart Townend Live|| ||"]}, {"page": "Graham Kendrick", "response": ["\"Shine, Jesus, Shine\" is regularly highly placed in hymn popularity polls. Fellow songwriter and former Kendrick bandmember Stuart Townend has said, \"I have no doubt that in 100 years time the name of Kendrick will be alongside Watts and Wesley in the list of the UK's greatest hymnwriters\". Kendrick also has his critics, among them the journalist Quentin Letts, who has described him as \"king of the happy-clappy banalities\"."]}, {"page": "Kevan Frost", "response": ["As a musician, Frost is multi-skilled. He features as an acoustic and electric guitarist on the Phatfish album Guaranteed, a keyboardist on the album Don't Mind If I Do by Culture Club and a bassist on Stuart Townend's 2008 live CD and DVD release There Is A Hope, recorded in Ireland. He is also credited on new material released by Boy George."]}, {"page": "My Hope Is Built on Nothing Less", "response": ["Many times, both \"My Hope Is Built on Nothing Less\" and \"Solid Rock\" hymns are sung together as a medley. \"Solid Rock\" has also been sung as a medley with \"In Christ Alone\" written  by Keith Getty and Stuart Townend."]}, {"page": "New Irish Hymns", "response": ["#In Christ Alone\"In Christ Alone\" at Kingsway(words by Stuart Townend, music by Keith Getty)"]}, {"page": "Keith Getty", "response": ["Julian Keith Getty OBE (born 16 December 1974) is a Northern Irish Christian singer and songwriter, best known for writing the modern hymn \"In Christ Alone\" in 2001 with veteran English songwriter and worship leader Stuart Townend. Getty and his wife also release music under the musical duo Keith & Kristyn Getty, which have been nominated for many Dove Awards, and have albums that have charted on multiple Billboard charts.", "In 2001, Getty and Stuart Townend wrote the song \"In Christ Alone\" with the purpose of creating a modern hymn that would explain the life of Christ. They released it on the Kingsway album New Irish Hymns, featuring vocalists  Máire Brennan, Margaret Becker, and Joanne Hogg. The song gained popularity, and by 2005 it was named by a BBC Songs of Praise survey as the ninth best loved hymn of all time, and in their 2010 survey was named second best hymn of all time. It hit number one on the United Kingdom CCLI charts by 2006, and in January 2009, it was still number one in the UK, number two in Australia, number seven in Canada, and number 15 in the United States.Previously reported data from CCLI.com The British Hymn Society nominated \"In Christ Alone\" as one of the top five hymns of all time, and BBC One's \"Songs of Praise\" nominated \"In Christ Alone\" as a top 10 hymn in 2012.", "•           2008: Keswick Live with Keith Getty, Stuart Townend, and Steve James, recorded at the Keswick Convention"]}, {"page": "David Aldous (actor)", "response": ["David Aldous directed the Christian music video \"How Deep\", sung by Charlotte Lauren, music by Stuart Townend.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Kristyn Getty", "response": ["* 2008: Keswick Live with Keith Getty, Stuart Townend, and Steve James, recorded at the Keswick Convention"]}, {"page": "New Irish Hymns 2", "response": ["#\"See, What a Morning (Resurrection Hymn)\" (by Keith Getty and Stuart Townend)", "#\"My Heart is Filled\" (by Keith Getty and Stuart Townend)", "#\"Jesus is Lord\" (by Keith Getty and Stuart Townend)", "#\"Repentance\" (by Keith Getty and Stuart Townend)"]}, {"page": "New Irish Hymns 3", "response": ["#\"Joy Has Dawned Across the World\"(by Stuart Townend and Keith Getty)", "#\"Fullness of Grace\"(by Kristyn Getty, Keith Getty, and Stuart Townend)", "#\"When Love Came Down to Earth\"(by Stuart Townend)"]}, {"page": "List of songs recorded by Keith Getty", "response": ["| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Kristyn Getty, Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend", "| Stuart Townend"]}, {"page": "New Irish Hymns 4", "response": ["#The Power of the Cross (Hymn for Communion)(by Keith Getty and Stuart Townend)", "#Across the Lands (Hymn for World Missions)(by Keith Getty and Stuart Townend)", "#Speak, O Lord (Hymn for the Preaching of the Word)(by Keith Getty and Stuart Townend)", "#Every Promise (Hymn of Response to the Word)(by Keith Getty and Stuart Townend)", "#May the Peace of God (Hymn for Benediction)(by Keith Getty and Stuart Townend)"]}, {"page": "Avalon: The Greatest Hits", "response": ["| Stuart Townend, Keith Getty"]}, {"page": "An Evening in Prague", "response": ["#Jesus is Lord(by Keith Getty and Stuart Townend)", "#In Christ Alone(by Keith Getty and Stuart Townend)", "#Beautiful Savior(by Stuart Townend)", "#Joy Has Dawned(by Keith Getty and Stuart Townend)", "#How Deep the Father's Love(by Stuart Townend)"]}, {"page": "Apostles Creed (album)", "response": ["The Apostles Creed is an album of songs by Keith Getty and Stuart Townend, featuring many guest performers assembled by producer John Hartley. As its title suggests, the songs reflect various aspects of the Christian Apostles' Creed. All songs are by Getty and Townend, except \"Merciful God,\" which is also by Kristyn Getty."]}, {"page": "Trinity Academy Grammar", "response": ["*Stuart Townend - Musician, Hymn writer. Composer of \"In Christ Alone\""]}, {"page": "In Christ Alone", "response": ["\"In Christ Alone\" is a popular modern Christian song written by Keith Getty and Stuart Townend, both songwriters of Christian hymns and contemporary worship music in the United Kingdom. The song, with a strong Irish melody, is the first hymn they penned together. The music was by Getty and the original lyrics by Townend. It was composed in 2001.", "thumb|left|Stuart Townend", "The song was composed in 2001 and gained increased popularity first in Ireland and the UK and then in the United States and internationally. In 2002, Stuart Townend, the lyricist of the song, recorded it on his own album Lord of Every Heart By 2005, it had been named by a BBC Songs of Praise survey as the ninth best-loved hymn of all time in the UK; By 2006, it rose to the No. 1 position on the United Kingdom CCLI (Christian Copyright Licensing International) charts. \"In Christ Alone\" appeared on CCLI's \"Top 25 CCLI Songs\" American songs list for the first time in the February 2008 report although it had appeared in the CCLI chart for Canada, Australia and New Zealand prior to that."]}, {"page": "New Irish Hymns (album series)", "response": ["New Irish Hymns is a series of Christian-themed albums created and produced by Keith Getty, Stuart Townend. Each album is performed by different singers:"]}, {"page": "Reformed worship", "response": ["Sparked in 2001, with the publishing of In Christ Alone, the modern hymn movement has grown, primarily among Reformed Christians, as a response to the commercialism, false teaching, and arguably weaker theology found in much of the Contemporary Christian Music industry. The modern hymn movement seeks to elevate lyrical content over musical composition; rich theological truth over mindless, empty, or repetitive choruses. Including In Christ Alone by Keith Getty & Stuart Townend, other well known examples of modern hymns include Yet Not I But Through Christ in Me by CityAlight, His Mercy is More by Matt Papa & Matt Boswell, and How Deep the Father's Love for Us by Stuart Townend. Other artists that have and continue to contribute to this movement include Sovereign Grace Music, The Enfield Hymn Sessions, and Aaron Keyes. With these and other artists' compositions, modern hymns continue to be shared, adopted throughout Reformed churches as well as other Christian denominations and groups while continuing to be translated into multiple languages."]}, {"page": "Noël Tredinnick", "response": ["Tredinnick is well-known for his expansive, expressive and personal style of directing and coaxing, as well as for his persuasive eye-contact and personable manner. He has conducted the orchestra alongside several notable singers and songwriters including Cliff Richard, Keith and Kristyn Getty, and Stuart Townend. The orchestra performed alongside Richard on a BBC Songs of Praise episode entitled \"The Gospel According to Cliff\".YouTube video"]}, {"page": "Stuart Townend", "response": ["Stuart Townend may refer to:", "* Stuart Townend (headmaster) (1909–2002), British athlete, soldier and school headmaster", "* Stuart Townend (musician) (born 1963), English hymnwriter and worship leader"]}, {"page": "Stuart Townend (hymnwriter)", "response": ["#REDIRECT Stuart Townend (musician)"]}, {"page": "Lambeth Awards", "response": ["* Stuart Townend, \"for his outstanding contribution to contemporary worship music\""]}, {"page": "How Deep The Father's Love For Us", "response": ["#REDIRECT Stuart Townend (musician) "]}, {"page": "Keith & Kristyn Getty", "response": ["Keith & Kristyn Getty are a Northern Irish Christian duo, best known for writing many popular modern hymns with veteran English songwriter and worship leader Stuart Townend. Due to the success of \"In Christ Alone\", the duo has spearheaded the modern hymn genre. Other popular hymns include \"The Power of the Cross\", \"The Lord Is My Salvation\", \"By Faith\", and \"Speak O Lord\". The duo's hymns top CCLI rankings, national \"most-loved\" and \"most-sung\" lists, and are estimated to be sung by 100 million people in churches around the world each year.Keith Getty: Why the Irish Hymn-writing Tradition Inspires me  at CCIL for Churches; published 2015; retrieved 30 September 2015 Many hymnals include their modern hymns, and some of the Getty's songs songs have also been covered by musicians across the contemporary Christian, contemporary worship, and gospel genres, including Owl City, Newsboys, MercyMe, Natalie Grant, and Shane and Shane.Keith Getty on What Makes ‘In Christ Alone’ Accepted and Contested at The Gospel Coalition; by Collin Hansen; published 9 December 2013; retrieved 30 September 2015 The couple has also appeared on national television (CBS, PBS, BBC), most notably on Public Television in 2015 with their Christmas Music special, Joy—An Irish Christmas.'Joy: An Irish Christmas' With Keith And Kristyn Getty at PBA.org; published 2015; retrieved 2016 They have appeared at numerous events and tours internationally with the recurring Hymns for the Christian Life and Irish Christmas tours. They also have performed at venues as diverse as London's Royal Albert Hall, Ryman Auditorium, Carnegie Hall, and The John F. Kennedy Center for the Performing Arts.", "In 2001, Getty and Stuart Townend wrote the song \"In Christ Alone\" with the purpose of creating a modern hymn that would explain the life of Christ.\"Keith Getty\" (Artist Biography), worshiptogether.com, accessed 2004. They released it on the Kingsway album New Irish Hymns, featuring vocalists Máire Brennan, Margaret Becker, and Joanne Hogg. The song gained popularity, and by 2005 it was named by a BBC Songs of Praise survey as the 9th best loved hymn of all time, and in their 2010 survey was named 2nd best hymn of all time.BBC Songs of Praise data; article no longer accessible It hit number one on the United Kingdom CCLI charts by 2006, and in January 2009, it was still number one in the UK, number two in Australia, number seven in Canada, and number 15 in the United States.Previously reported data from CCLI.com The British Hymn Society nominated \"In Christ Alone\" as one of the top 5 hymns of all time, and BBC One's \"Songs of Praise\" nominated \"In Christ Alone\" as one of the top 10 hymns in 2012.", "The duo along with others toured the UK in 2012 during their The Northern Celtic Islands Tour.Gettys announce Celtic Islands tour at Christian Media Corporation; published 27 April 2012; retrieved 16 October 2015 Over the course of three weeks, they appeared in ten concert halls, including the Liverpool Philharmonic Hall, Waterfront Hall, and Glasgow SECC Arena. Several of the performances were sold out weeks prior to the concert. Guest performers included Stuart Townend, New Scottish Choir and Orchestra, Jonathan Rea, New Irish Arts, and Dr. Noël Tredinnick.", "The Gettys were featured as a cover story on CBS Sunday Morning for their Easter 2015 (5 April) broadcast. CBS released this statement, \"For the segment, which is titled In The Spirit, the Gettys were interviewed in their Nashville home by CBS News correspondent Tracy Smith and recorded while performing at the Grand Ole Opry in Nashville on St. Patrick's Day.\" CBS News reporter Tracy Smith focused on the backstory behind the popular hymn \"In Christ Alone\", which was originally written back in 2001 by Getty and Stuart Townend.In praise of hymns at CBS News; published 5 April 2015; retrieved 9 October 2015 In addition, Keith and Kristyn have made frequent appearances on BBC's Songs of Praise special.", "* Keswick Live (2008) with Kristyn Getty, Stuart Townend, and Steve James, recorded at the 2008 Keswick Convention."]}]}}