{"wiki_id": "http://www.wikidata.org/entity/Q7627160", "itemLabel": "Stuart Tomlinson", "itemDescription": "British professional wrestler and football player (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Tomlinson", "wikipedia_page": {"main": "Stuart Charles Tomlinson (born 22 May 1985) is an English former professional wrestler and professional footballer who played as a goalkeeper.\nAs a footballer, Tomlinson progressed from the Crewe Alexandra youth team to turn professional in 2003. He spent the next six years with the club, spending part of 2004 on loan at Stafford Rangers, and playing once on loan for Burton Albion in 2008. He spent the 2009–10 campaign at Conference club Barrow, where he shared goalkeeping responsibilities with Tim Deasy. He then signed with Port Vale, and was favoured ahead of Chris Martin for the 2010–11 and 2011–12 campaigns, before choosing to leave the club in July 2012. He signed with Burton Albion in September 2012, but retired through injury in July 2013.\nIn December 2013, Tomlinson began training as a professional wrestler on a developmental contract with WWE. In November 2014, he made his debut at a NXT live event, under the ring name Hugo Knox. In September 2016, he was released from his contract. In March 2017, Tomlinson briefly returned to football to play for Altrincham.", "link_mentions": [{"page": "Chester", "response": ["* Stuart Tomlinson (born 1985), former professional footballer, now professional wrestler at WWE"]}, {"page": "Kevin Poole", "response": ["Poole signed a new contract for the 2010–11 season, and made an appearance as a 47-year-old in a Football League Trophy match against Rotherham in October 2010. He signed a further one-year deal for 2011–12, and would turn 48 years old before the start of the new season. Having made no appearances during 2011–12, Poole announced on 26 April that he would retire from his 32-year playing career, aged 48, at the end of the season, he had been the oldest professional player in England at the time of his retirement However, because of injuries to Stuart Tomlinson and Ross Atkins, he re-registered as a player in October 2012 to provide cover for Dean Lyness and on-loan Mark Oxley, alongside his coaching role."]}, {"page": "Micky Adams", "response": ["In building for the 2010–11 season, Adams released nine players, and signed Sean Rigg, Stuart Tomlinson, Justin Richards, Ritchie Sutton and Gary Roberts. The season began similarly to the previous campaign, with a 3–1 win at Championship side Queens Park Rangers in the League Cup First Round, new signing Richards scoring twice. Five wins in five for September saw Adam's gifted the League Two Manager of the Month award, his team also boasting five clean sheets. He was also handed the award for November, after his team advanced into the Third Round of the FA Cup and rose to the top of the League Two table on the back of five clean sheets in seven games. Departing for his boyhood club at the end of December 2010, he left the club in second position in League Two."]}, {"page": "Tomlinson", "response": ["*Stuart Tomlinson (born 1985), English footballer"]}, {"page": "1985 in the United Kingdom", "response": ["* 22 May – Stuart Tomlinson, footballer and wrestler"]}, {"page": "Tim Deasy", "response": ["In Barrow's two seasons in the Conference, Tim was in and out of the team, competing first with Alan Martin and later with Stuart Tomlinson for the goalkeeping position. He played a vital role in preventing an onslaught against Sunderland on 3 January 2010, but they went on to lose the match 3–0. He was praised by Steve Bruce about keeping the score down. After failing to regularly gain first team football, Deasy chose to leave the club at the end of the 2009–10 season."]}, {"page": "Chris Martin (footballer, born 1990)", "response": ["Having come through the club's youth set-up, he turned professional at Port Vale in 2007 after spending time on loan at non-league Kidsgrove Athletic. He spent 2007–08 and 2008–09 as Joe Anyon's deputy, before he won the #1 jersey in summer 2010, having established himself as the club's first choice keeper in the 2009–10 campaign. However, he was released after he spent most of the 2010–11 and 2011–12 seasons on the bench behind new signing Stuart Tomlinson. In August 2012, he dropped down three tiers to join Ilkeston. The following year he dropped down another division to play for Mickleover Sports . He helped Mickleover to win the Northern Premier League Division One South title in 2014–15. He joined Leek Town in June 2015, and then Kidsgrove Athletic in December 2016. He was sworn in as a policeman in September 2017.", "After Joe Anyon broke his leg in March 2009, Martin was given his first run in the first team, playing the last ten games of the 2008–09 season. Anyon failed to recover for the start of the 2009–10 season. New manager Micky Adams looked to sign Stuart Tomlinson in order to have an experienced option in goal, but the cash-strapped club could not afford to offer Tomlinson a permanent deal. However Martin did not disappoint, an assured display against Rochdale was followed by a solid performance in the League Cup at Bramall Lane, where Vale defeated Championship side Sheffield United 2–1. Adams commented: \"We knew our keeper would have to have a great night, and what a night he's had.\" However, he was transfer listed in late September, along with the entire Port Vale squad, after Adams saw his team slip to a third consecutive defeat. He remained the first choice keeper however, his shot-stopping ability, overall competence and reliability making him the star player of the first half of the campaign. In January 2010 he kept three clean sheets in a row, the first time Vale had done so in over three years. His record of conceding just 25 goals in 26 League Two matches by February led the club to promise him a new contract, and led to public praise from teammate Adam Yates. After a run of 38 consecutive games he was rested in February 2010, as manager Adams wished to see Joe Anyon in competitive action. Martin regained his place the next month after Anyon made two costly errors in his seven games. The teenager picked up the Young Player of the Year award for his 47 appearances. He was offered a new contract by the club at the end of the season, whilst Anyon was released. Martin signed the two-year contract, which came with an increase in wages.", "In May 2010, Stuart Tomlinson was announced as his competition for the 2010–11 season. Tomlinson said he was looking forward to working with Martin and goalkeeping coach Mark Grew. Martin stated he hoped to be more communicative with his defenders throughout the season. Tomlinson received the nod from Adams, and Martin had to wait until February 2011 for first team football, at which point Tomlinson was out with a hip injury and Jim Gannon was manager. Martin was dropped after conceding a comical own goal in a 3–1 defeat to Stevenage, but won a recall the following match as Tomlinson left the field due to a recurrence of his hip injury. The pair continued to battle for a starting place, though Tomlinson supported Martin after he committed another blunder in a 2–1 loss at home to Oxford United on 12 March. Over the course of the season he was restricted to just fourteen league appearances by Tomlinson's consistency."]}, {"page": "2008–09 Oldham Athletic A.F.C. season", "response": ["To begin the final month of 2008, Oldham was at home to play Brighton & Hove Albion. Oldham started the match quickly when Adam Virgo brought down Chris Taylor in the penalty box, allowing Andy Liddell to convert a spot-kick for a 1–0 Latics advantage in the 9th minute. However, Steven Thomson slid a ball past the Oldham defence to Glenn Murray who fired a shot into the roof of the net, putting the Seagulls back level at 1–1. Adam Virgo, who received a yellow card for his tackle of Taylor, received a second in the 48th minute and was sent off. Despite having only ten men, the Brighton defence frustrated the Latics, holding on for a 1–1 draw. A week later, the Latics traveled to face Peterborough United at London Road Stadium. This game was again off to a quick start, however, it was the opposition who struck first. A shot from Aaron McLean in the 12th minute deflected off Latics defender Stefan Stam, giving Peterborough a 1–0 lead. Eight minutes before the halftime break, McLean extended the lead with another goal with a rebound from a spot-kick, shortly after having another spot-kick saved by Oldham goalkeeper Greg Fleming. After several comebacks throughout the season, Oldham again showed their intentions when Lee Hughes poked the ball into the opposition's net for a 2–1 halftime lead for Peterborough. Just before the hour mark, Hughes again scored when he put a loose ball into the net. With several more chances for both sides, the game ended with a 2–2 draw. After two consecutive draws, Oldham was set to face Leyton Orient. Despite early efforts from Danny Whitaker and Darren Byfield, Oldham was unable to net an early goal. A Leyton Orient goal looked possible when Adam Chambers got a rebound twelve yards out, but the midfielder sent the ball high over the net. After Byfield was pulled down in the penalty area by Tamika Mkandawire, Andy Liddell struck his 8th goal of the season via a penalty kick for a 1–0 halftime advantage. Near the midway point of the second half, Greg Fleming gave Orient a chance to get back on level terms when he fouled Ryan Jarvis in the box. Fleming saved the penalty, but Jason Demetriou scored from a rebound, earning Leyton Orient a 1–1 draw—Oldham's third consecutive. Oldham was away to face Crewe Alexandra under new manager Gudjon Thordarson on Boxing Day. Despite struggling with an illness just days before the match, Darren Byfield was named to the starting lineup. Just before the hour mark in the match, Byfield scored his first for the club from a through back from Kelvin Lomax. The win was secured when Lee Hughes curled a ball past Stuart Tomlinson, before Hughes grabbed another five minutes before the final whistle for a 3–0 win. Two days after the Boxing Day victory, Oldham faced off against Carlisle United for the final match of 2008. Terrific play from Carlisle goalkeeper Tim Krul kept Oldham out of goal, despite giving the Latics nineteen corners. Neither side had an attacking threat until 17 minutes in when a Reuben Hazell header forced Krul into a saved shot. With nineteen total shots for the Latics, manager John Sheridan was surprised when the game ended in a scoreless draw."]}, {"page": "Stuart Charles Tomlinson", "response": ["#REDIRECT Stuart Tomlinson"]}, {"page": "Ross Atkins", "response": ["At the end of the season, Atkins had a clause activated on his contract which extended his stay at Derby County until the end of the 2012–13 season. He then rejoined Burton on another season-long loan in July 2012. Atkins started the season as first choice, starting in Burton's opening seven games of season, however he was substituted at half time for Dean Lyness in the Football League Trophy game at Coventry City. After this games, Burton signed ex-Port Vale goalkeeper Stuart Tomlinson, with Burton manager Gary Rowett being dissatisfied with the performances of Atkins and Dean Lyness. After Tomlinson started ahead of Atkins in a 1–0 win over Rochdale at Spotland on 8 September 2012, Burton assistant manager Kevin Summerfield said that \"the biggest difference for me was that we were playing the game in their half and they were defending corners because he [Tomlinson] can kick the ball so far up the pitch\". Atkins slipped to third choice behind Tomlinson and Lyness and his loan was terminated early on 15 January 2013."]}, {"page": "2010 FA Trophy Final", "response": ["Barrow seemed to begin the game more brightly out of the two sides, with three shots in the first ten minutes. It was on the ten-minute mark where, in Borough's first attack of the game, Andy Drury lashed a strike straight into the top corner of Barrow keeper Stuart Tomlinson's goal. This goal seemed to change the feel of the game, with Stevenage applying more and more pressure until, on 28 minutes, Stevenage midfielder David Bridges was shown a straight red card for serious foul play on Barrow No. 7, Andy Bond. The game was evenly balanced from then until half-time.", "|GK ||21 || Stuart Tomlinson"]}, {"page": "Crewe Alexandra F.C. Academy", "response": ["* Stuart Tomlinson"]}, {"page": "2010–11 Port Vale F.C. season", "response": ["Before the start of the season there was speculation that manager Micky Adams would be approached by his former employers at Championship side Leicester City, having impressed in his position at Port Vale. Adams continued to make his mark at Vale though, releasing nine players, and signing Sean Rigg, Stuart Tomlinson, Justin Richards, Ritchie Sutton and Gary Roberts. Lewis Haldane was rushed into hospital after being bitten by an insect during a training session, forcing him to miss the first half of the season. Adams drafted in Reading winger Abdulai Bell-Baggie as a loan replacement for Haldane, and after an initial one-month period then replaced Bell-Baggie with Milton Keynes Dons loanee Jemal Johnson.", "|align=\"left\"|GK||12||align=\"left\"| Stuart Tomlinson", "|12||||GK||Stuart Tomlinson||3||1||0||0||0||0||0||0||3||1", "|||Stuart Tomlinson"]}, {"page": "2011–12 Port Vale F.C. season", "response": ["In addition to off-the-field troubles in January, Adams also had to deal with an injury crisis to his small squad; already missing Ryan Burge and Lewis Haldane with long-term injuries, the treatment room also welcomed Marc Richards, Rob Taylor, Gareth Owen, Tom Pope and Lee Collins. Vale suffered four consecutive defeats, before managing to turn things around by the end of the month with 1–0 wins over Rotherham United and Plymouth Argyle. On 14 February, midfielders Chris Shuker and Paul Marshall joined the club on non-contract terms. However the treatment room grew more busy, as Adam Yates and Tom Pope picked up injuries requiring several weeks of rest. The club expected to receive a boost when Trinidad and Tobago international Chris Birchall returned from the Los Angeles Galaxy to play for the club on a month-by-month basis; however the club were hit by a transfer embargo by the Football League on 25 February for failing to pay a bill. Nevertheless performances on the pitch were solid, and Vale entered the Crewe derby having won four and drawn one of their last five games. The derby finished honours even again at 1–1, with a late header from Byron Moore cancelling out the own goal scored by Crewe skipper David Artell. A 2–1 home defeat by Barnet on 10 March ended Vale's run of eight game unbeaten; combined with a ten-point deduction for entering administration, the club slipped from 9th to 14th in the space of 24 hours. Promising young defender Lee Collins was the first the leave the club post-administration, joining Championship side Barnsley on a loan deal worth £50,000 to the Vale on 15 March. The drama continued in the game against Shrewsbury Town on 27 March, as the match was abandoned after 64 minutes due to a fire caused by the failure of the floodlights at the New Meadow. With the season drawing to a close, Adams began developing his squad for the following season, and announced that he had 'reluctantly' released defender Charlie Raglan, without giving him his first team debut. He offered contracts to all but three players: Chris Martin, Phil Roe, and Paul Marshall; he also placed Burge on the transfer list. Aside from Lee Collins, the first player to reject a contract with Vale to move elsewhere was Anthony Griffith, who signed a two-year deal with League One side Leyton Orient. The first out-of-contract players to pledge their futures to Port Vale were Rob Taylor (two years), Lewis Haldane (six months), Ben Williamson (one year), and Sam Johnson (one year). Days later it was announced that Sean Rigg had signed with Oxford United, whilst Clayton McDonald confirmed that he would accept Vale's offer of a new one-year deal. However the biggest blow to fan's hopes of promotion came when it was announced that talismanic top-scorer Marc Richards had signed a two-year deal with relegated League One side Chesterfield. June began with John McCombe and Tom Pope both agreeing to sign new deals with the club. The only player to reject the club's offer of a new contract despite not signing a contract elsewhere was goalkeeper Stuart Tomlinson; he eventually ended up at Burton Albion.", "|align=\"left\"|GK||12||align=\"left\"| Stuart Tomlinson", "|12||||GK||Stuart Tomlinson||2||0||0||0||0||0||0||0||2||0", "|||Stuart Tomlinson"]}, {"page": "2012–13 Hull City A.F.C. season", "response": ["On 26 October 2012 Mark Oxley went out on loan to Burton Albion to cover for an injury to Stuart Tomlinson."]}, {"page": "2012–13 Burton Albion F.C. season", "response": ["* 7 September: Albion sign goalkeeper Stuart Tomlinson on a four-month deal from local rivals Port Vale.", "* 26 October: The Brewers sign goalkeeper Mark Oxley on a one-month loan deal from Hull City following injuries to regular keeper Stuart Tomlinson and deputy Ross Atkins. Also on this day striker Matt Paterson signs a six-month extension to his current deal to see him through to the end of the season.", "| Stuart Tomlinson", "6 Player/Goalkeeping coach. Oldest registered player in The Football League. Re-registered as player on 26 October 2012 due to injuries to Mark Oxley and Stuart Tomlinson.", "| 7 September 2012 || GK ||  Stuart Tomlinson ||  Port Vale || Free ||", "| 8 July 2012 || GK ||  Stuart Tomlinson || Retired ||  ||"]}, {"page": "Dean Lyness", "response": ["He made his Football League debut on 23 October 2012, again as a substitute, replacing the injured Stuart Tomlinson with 11 minutes plus stoppage time left in a 1–1 draw with Port Vale. On his first League start, against Dagenham & Redbridge, he conceded a first-half penalty, which he then saved by turning it onto the post, but was unable to stop the shot from the rebound; Burton won 3–2. He kept his place until mid-January, when a positional error left him unable to deal with a looped shot from Adebayo Akinfenwa that gave Northampton Town a win. Although Rowett was unwilling to blame Lyness, he selected Tomlinson for the next match, and Lyness regained a starting place only after a 7–1 defeat to Port Vale in April looked like derailing Burton's promotion chances. He played three matchestwo wins and one lossbefore Tomlinson came back in for the last match of the regular season and the playoff semi-final defeat to Bradford City."]}]}}