{"wiki_id": "http://www.wikidata.org/entity/Q7635787", "itemLabel": "Sukhbir Singh Kapoor", "itemDescription": "Indian writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sukhbir_Singh_Kapoor", "wikipedia_page": {"main": "Sukhbir Singh Kapoor OBE (Punjabi: ਸੁਖਬੀਰ ਸਿੰਘ ਕਪੂਰ) is a writer and educator. He has served as a professor and administrator at universities in several countries. Kapoor is currently vice chancellor of The International School of Sikh Studies and Khalsa College London. He has written 50 books, of which 44 are on various aspects of Sikhism, one is on economic theory, one deals with business administration, one is on accounting practice and three cover Panjabi poetry. His regular articles have appeared in many English and Panjabi magazines, and he has to his credit many hundred such articles. His academic work has brought him numerous awards, including the Punjabi Academy Award from the Government of Delhi. He has organized many symposia for drama and poetry and has directed many plays. Kapoor is the chief editor of the Sikh Courier International. Kapoor was appointed Officer of the Order of the British Empire (OBE) in the 2010 Birthday Honours.", "link_mentions": [{"page": "Sukhbir", "response": ["* Sukhbir Singh Kapoor, writer and educator"]}, {"page": "Guru Nanak Interfaith Prize", "response": ["The first such prize was presented to Tenzin Gyatso, 14th Dalai Lama on November 11, 2007 by a delegation from Hofstra who had traveled to India for the presentation.  The Dalai Lama was selected from a field of 75 nominees engaged in interfaith efforts throughout the world. Other notable individuals nominated included Arthur Schneier, Jagdish Gandhi, Sukhbir Singh Kapoor, Paul F. Knitter, and Frank Kaufmann. Notable organizations and groups nominated included Hartford Seminary and the Molloy College Institute for Christian/Jewish Dialogue."]}, {"page": "Dr. Sukhbir Singh Kapoor", "response": ["#REDIRECT Sukhbir Singh Kapoor"]}, {"page": "2010 Birthday Honours", "response": ["*Dr. Sukhbir Singh Kapoor, Vice-Chancellor, World Sikh University. For services to Community Relations."]}, {"page": "List of British Sikhs", "response": ["*Sukhbir Singh Kapoor – Vice Chancellor of The International School of Sikh Studies and Khalsa College London"]}, {"page": "List of British Punjabis", "response": ["* Sukhbir Singh Kapoor – vice chancellor of The International School of Sikh Studies and Khalsa College London"]}]}}