{"wiki_id": "http://www.wikidata.org/entity/Q7634047", "itemLabel": "Sue Cook", "itemDescription": "British television and radio presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Sue_Cook", "wikipedia_page": {"main": "Susan Cook (born Susan Lorraine Thomas, 30 March 1949, Ruislip, Middlesex) is an English television presenter and author. She is best known for co-presenting (with Nick Ross) the BBC One factual crime show Crimewatch from 1984 until 1995.", "link_mentions": [{"page": "John Williams (guitarist)", "response": ["Williams and his third wife, artist Kathy Panama (who married on New Year's Eve 2000), reside in London (Hampstead) and Cornwall. He has a daughter Kate Williams, now an established jazz pianist. He also has a son, Charlie, by his second wife, the television presenter Sue Cook."]}, {"page": "The News Quiz", "response": ["* Sue Cook"]}, {"page": "The Adventure Game", "response": ["Notable contestants included Keith Chegwin, Sue Cook, astronomer Heather Couper, John Craven, Paul Darrow, Noel Edmonds, Sarah Greene, Bonnie Langford, James Burke, Elizabeth Estensen, Janet Fielding and Richard Stilgoe.", "| 3 || 16 November 1981 || 11 June 1982 || 45 || David Singmaster, Sue Cook, Philip Sheppard"]}, {"page": "Edge of Darkness", "response": ["Several other faces familiar to British viewers appeared during the course of the episodes, including John Woodvine (as Craven's superior DCS Ross), Tim McInnerny (as Emma's boyfriend Terry Shields), Hugh Fraser (as IIF chief executive Robert Bennett), Zoë Wanamaker (as intelligence agent Clementine) and Blake's 7 cast members David Jackson (as Colonel Lawson) and Brian Croucher (as Northmoor security chief Connors). Playing themselves were television reporters Sue Cook and Kenneth Kendall, weatherman Bill Giles and Labour MP Michael Meacher. Allan Cuthbertson as Chilwell of the Investigation Committee. Long-standing BBC visual effects designer Mat Irvine, who contributed visual effects to the series, received a brief cameo as a police diver in \"Breakthrough\".", "Although Kennedy Martin's notion for the serial was influenced by real political events, he had for a long time railed against naturalism in television drama – most notably in a 1964 article for the theatre magazine Encore, titled \"Nats Go Home. First Statement of a New Drama for Television\", in which he sought \"to free the camera from photographing dialogue, to free the structure from natural time and to exploit the total and absolute objectivity of the television camera\".Cooke, British Television Drama: A History, p. 64 Edge of Darkness producer Michael Wearing has noted that \"there is a mystical dimension to Troy's imagination. His instincts are visual and non-naturalistic\".Lavender, Edge of Darkness (Troy Kennedy Martin), p. 104. Kennedy Martin, therefore, crafted a serial that on the one hand placed its events squarely within the real, present day world but on the other also placed itself within the realm of the mystical and the mythic.Lavender, Edge of Darkness (Troy Kennedy Martin), p. 112. Realism and authenticity was provided by the appearances of real life television presenter Sue Cook and Labour MP Michael Meacher. There was also use of contemporary stock footage, such as Robin Day's interview with Margaret Thatcher and references to real persons like Michael Heseltine and places such as Sellafield, alongside the references to fictitious characters and places contained in the plot. The mystical dimension is provided by Emma's ghost while the mythic is provided by Craven himself and by Jedburgh and Grogan. Kennedy Martin, influenced by John Darragh's The Real Camelot (Thames and Hudson, 1981) which examined the pagan origins of the Arthurian legend, saw Craven as a modern-day Green Man who would confront the threats to the Earth on behalf of Gaia. Jedburgh was conceived by Kennedy Martin as a Knight of the Marches, one of the Teutonic Knights who defended the borders of Eastern Europe, opposed to Grogan, who Kennedy Martin saw as a descendant of the Knights Templar who, according to legend, had guarded a special wisdom in the Temple of the Dome of the Rock in Jerusalem. These aspects would reach their apotheosis in the serial's conclusion in which Kennedy Martin envisaged that Craven, having found the plutonium stolen by Jedburgh, would be shot by a sniper and would be transformed into a tree."]}, {"page": "John Gray (philosopher)", "response": ["In 2002 Straw Dogs was named a book of the year by J. G. Ballard in The Daily Telegraph; by George Walden in The Sunday Telegraph; by Will Self, Joan Bakewell, Jason Cowley and David Marquand in the New Statesman; by Andrew Marr in The Observer; by Jim Crace in The Times; by Hugh Lawson Tancred in The Spectator; by Richard Holloway in the Glasgow Herald; and by Sue Cook in The Sunday Express."]}, {"page": "Children in Need", "response": ["*Sue Cook (1984–1995)", "| Sue CookJoanna Lumley", "| Sue CookJohn CravenJoanna Lumley", "| Sue CookJoanna Lumley", "| Sue Cook", "| Sue CookJoanna Lumley", "| Sue Cook", "| Sue CookDave Benson Phillips", "| rowspan=\"3\"| Sue CookAndi Peters", "| Sue CookGaby Roslin"]}, {"page": "Nick Ross", "response": ["*Crimewatch UK (with Sue Cook, Hodder & Stoughton, 1987) "]}, {"page": "Pebble Mill at One", "response": ["There were several Pebble Mill spin-offs, particularly in the 1970s, such as the late night chat show Saturday Night at the Mill which began in 1976. Kenny Ball and His Jazzmen were the regular house band, and they performed the signature tune. Until 1978, the spin-off was hosted by Bob Langley and Donny MacLeod, who was replaced by Tony Lewis, and who in turn was replaced in 1980 by Arianna Stassinopoulos, though she was dropped after just five editions. For the remainder of the season, Langley was joined by a different female co-host each week, which included Hayley Mills, Sue Cook, Liza Goddard, Maureen Lipman, Jill Townsend, Jackie Collins and Jenny Hanley, who became the permanent co-host to Langley for the final season broadcast in 1981. In its final year, an early evening version called Six Fifty-Five Special surfaced when Pebble Mill was on its summer break, presented by Sally James, Paul Coia, David Soul and Bob Langley. In 1986, The Clothes Show, presented by Jeff Banks and Selina Scott, was created from a strand produced by Roger Casstles, first shown on Pebble Mill at One."]}, {"page": "MasterChef (British TV series)", "response": ["* 2007: Nadia Sawalha, Midge Ure, Craig Revel Horwood, Jeremy Edwards, Chris Bisson, Martin Hancock, Sunetra Sarker, Gemma Atkinson, Sherrie Hewson, Pauline Quirke, Rani Price, Chris Hollins, Matthew Wright, Angela Rippon, Sue Cook, Lorne Spicer, Emma Forbes, Jeff Green, Darren Bennett, Sally Gunnell, Mark Foster, Matt James, Robbie Earle and Phil Tufnell."]}, {"page": "Garen Ewing", "response": ["As an aside, Ewing is a part-time researcher and writer on the Second Anglo-Afghan War (1878–80) and was interviewed by Sue Cook on BBC Radio 4's 'Making History' programme in this capacity in October 2004.Making History, \"The March to Kandahar, 1880\", BBC Radio 4, October 19, 2004"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Sue Cook – regular presenter on various current affairs programmes, including Nationwide and Breakfast Time, during the 1980s and 1990s. She has also presented a number of other programmes, including Children in Need, Pebble Mill at One and Crimewatch.  "]}, {"page": "List of Shooting Stars episodes", "response": ["|Sue Cook and David Hamilton"]}, {"page": "Ian Sharp", "response": ["He speaks fluent French and German and lives in Oxfordshire with his wife, the broadcaster and author Sue Cook, whom he married in 2004."]}, {"page": "Vyners School", "response": ["* Sue Cook, TV presenter"]}, {"page": "Collectors' Lot", "response": ["Presenters of Collectors' Lot included Sarah Greene, Sue Cook, Helen Atkinson-Wood and Debbie Thrower."]}, {"page": "1995 in British television", "response": ["**Jill Dando succeeds Sue Cook as co-presenter of Crimewatch alongside Nick Ross."]}, {"page": "1949 in British television", "response": ["* 30 March – Sue Cook, broadcaster and author"]}, {"page": "Crimewatch", "response": ["Crimewatch was first broadcast on 7 June 1984, and is based on the German TV show Aktenzeichen XY… ungelöst (which translates as File Reference XY … Unsolved). Nick Ross and Sue Cook presented the show for the first eleven years, until Cook's departure in June 1995. Cook was replaced by Jill Dando. After Dando was murdered in April 1999, Ross hosted Crimewatch alone until January 2000, when Fiona Bruce joined the show.", "| The main anchor and longest-serving presenter of the series since its inception. His catchphrase, \"Don't have nightmares, do sleep well\" (which closed out most episodes), became a household phrase and was often spoofed in numerous other TV shows. During his time on the show, he had three co-presenters: Sue Cook, Jill Dando and Fiona Bruce. From May 1999 until January 2000, Ross presented the show alone following the murder of Jill Dando. He left the programme in July 2007 to concentrate on other broadcasting projects.", "| Sue Cook", "| British broadcaster and newsreader. Second co-presenter of the series, appointed following Sue Cook's departure. The edition of Crimewatch broadcast on 20 April 1999 would be Dando's last; she was murdered six days later (26 April). Her murder was reconstructed on the May 1999 programme, where an appeal for witnesses was made. Calls made by viewers initially draw the police onto a new line of enquiry, in which they identified suspect Barry George, who was later convicted of the killing, but was acquitted in August 2008 following an appeal. No further appeals for information were ever made on the programme, and the murder remains unsolved to this day.", "| Co-presented episode broadcast in April 1988 as Sue Cook was unavailable.", "| 1 || 7 June 1984 || 20 December 1984 || 6 || rowspan=\"23\"|Nick Ross || rowspan=\"6\"|Sue CookDavid HatcherHelen Phelps (Absent for Episode 2 of Series 4)", "| 7 || 18 January 1990 || 6 December 1990 || 10 || Sue CookDavid Hatcher (Absent for Episode 4)Helen Phelps (Episodes ?–?)Jacqui Hames (Episodes 4–10)Colin Fry (Episode 4)", "| 8 || 17 January 1991 || 5 December 1991 || 10 || rowspan=\"4\"|Sue CookDavid HatcherJacqui Hames", "| 12 || 19 January 1995  || 13 December 1995 || 10 || Sue Cook (Episodes 1–6)Jill Dando (Episodes 7–10)  David Hatcher  Jacqui Hames", "First aired on 10 August 1988, Crimewatch File is an hour-long programme devoted to the reconstruction and investigation of a single case including cases that the programme has previously helped to solve. Presented by Nick Ross and Sue Cook concurrently (with Jill Dando taking over from Cook in 1996), more than thirty editions aired until April 2000, when the final edition, fronted by Ross, was broadcast. Following this, in latter years of the main Crimewatch programme, episodes would regularly feature segments and reports in a very similar vein to Crimewatch File.", "Crime Limited was the second spin-off from Crimewatch which took cameras behind the scenes of the crimes. The first series aired on BBC One over ten episodes in 1992 and was presented by Nick RossProgrammes. Nick Ross. Retrieved 16 September 2017. and Sue Cook. A second series ran in 1993 and a third series ran in 1994.Crime Limited, 1993. BBC Genome. Retrieved 16 September 2017.\"Choice\", Peter Waymark, The Times, 5 August 1993, p. 39. Retrieved 16 September 2017."]}, {"page": "Celebrity Ghost Stories", "response": ["#Toyah Willcox, Alex Ferns, Adele  and Sue Cook – June 23, 2011"]}, {"page": "John Cannan", "response": ["Only ten weeks after his release from prison, Cannan raped a woman at knifepoint in Reading, Berkshire, in October 1986, an attack he was linked to by DNA from semen. Cannan had come up to the woman's car asking for directions, then brandished a knife and raped her, and also buggered her. Cannan had been arrested for this offence earlier but he denied everything and gave an alibi that he was in Sutton Coldfield at the time of the attack, and the forensic evidence was not strong enough to charge him. An early DNA profile was inconclusive, but the Home Office and ICI both ran the test again in 1988 and demonstrated a match. Police also used evidence from Cannan's cashpoint card to prove that he had travelled from London to Bristol that day. Reading is on the railway line between these cities.Crimewatch File: The Shirley Banks Murder. 16 August 1989. BBC Television. Presented by Sue Cook."]}, {"page": "Jane Wenham-Jones", "response": ["Wenham-Jones was an interviewee of Sue Cook for The Write Lines in conjunction with Talking Bookshelf and National Short Story Week."]}, {"page": "The Society for Curious Thought", "response": ["This question was put to writers, ecologists, academics, humanitarians, film makers, artists and others in order to gather together ideas/ ideals/ mechanisms to improve civic institutions/ civil society, education and to advance knowledge of rights and responsibilities, to enable people in all societies to change their own lives and communities for the better.   Among the contributors were Amol Rajan, Sue Cook, Anton Gill and Errollyn Wallen."]}, {"page": "List of people from the London Borough of Hillingdon", "response": ["* Sue Cook, broadcaster, best known for presenting the BBC's Nationwide and Crimewatch, was born in Ruislip."]}, {"page": "Crime Limited", "response": ["Crime Limited was a BBC television series that was a spin-off from the BBC's Crimewatch. The first series aired on BBC One over ten episodes in 1992 and was presented by Nick RossProgrammes. Nick Ross. Retrieved 16 September 2017. and Sue Cook. A second series ran in 1993 and a third series ran in 1994.Crime Limited, 1993. BBC Genome. Retrieved 16 September 2017.\"Choice\", Peter Waymark, The Times, 5 August 1993, p. 39. Retrieved 16 September 2017.", "Presented by Nick Ross and Sue Cook, the series includes features and reports that Ross described as \"[being unable to] form part of our appeal for information\". Ross commented that, \"Crime Limited gives us the chance to go into these stories. Some are exciting, some are reassuring and some are frankly funny. Some, we hope, will help to limit crime.\" Cook left Crime Limited after the first series, leaving Ross as the sole presenter for two further series, which aired in 1993 and 1994. The producers were Linda Cleeve and John Fothergill and it was edited by Nikki Cheetham.Crime Limited, 1992. BBC Genome. Retrieved 16 September 2017. Its most infamous episode featured a prosecution-biased dramatization of the Florence Jackson murder case of 1992, whose outcome was later exposed as a miscarriage of justice.", "| 1 || 28 April 1992 || 30 June 1992 || 10 || rowspan=\"4\"|Nick Ross || Sue Cook"]}, {"page": "Crimewatch File", "response": ["Broadcast on BBC One, it was aired on an ad hoc basis and presented by Nick Ross and Sue Cook concurrently (with Jill Dando taking over from Cook in 1996 until her death), more than thirty editions aired until April 2000, when the final edition, fronted by Ross, was broadcast. Following the show's demise, in latter years of the main Crimewatch programme, episodes would regularly feature segments and reports on solved cases previously featured on the programme in a very similar vein to Crimewatch File."]}, {"page": "Straw Dogs (book)", "response": ["In 2002 Straw Dogs was named a book of the year by J. G. Ballard in The Daily Telegraph; by George Walden in The Sunday Telegraph; by Will Self, Joan Bakewell, Jason Cowley and David Marquand in the New Statesman; by Andrew Marr in The Observer; by Jim Crace in The Times; by Hugh Lawson Tancred in The Spectator; by Richard Holloway in the Glasgow Herald; and by Sue Cook in The Sunday Express."]}]}}