{"wiki_id": "http://www.wikidata.org/entity/Q763421", "itemLabel": "David Armstrong", "itemDescription": "English footballer (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Armstrong_(footballer,_born_1954)", "wikipedia_page": {"main": "David Armstrong (born 26 December 1954) is an English former footballer who played most of his career for Middlesbrough (from 1972 to 1981), before moving to Southampton in August 1981 where he played for a further six seasons. He finished his league career with AFC Bournemouth in 1987–88.", "link_mentions": [{"page": "Jack Charlton", "response": ["Charlton took advice from Celtic manager Jock Stein, who allowed him to sign right-sided midfielder Bobby Murdoch on a free transfer. Besides Murdoch the club already had ten players who Charlton moulded into a championship winning side: Jim Platt (goalkeeper), John Craggs (right-back), Stuart Boam and Willie Maddren (centre-backs), Frank Spraggon (left-back), David Armstrong (left midfield), Graeme Souness (central midfield), Alan Foggon (attacking midfield), John Hickton and David Mills (forwards). Some of these players were already settled at the club and in their positions, whilst Charlton had to work with some of the other players. He moved Souness from left midfield to central midfield to compensate for his lack of pace and coached him to play the ball forward rather than side to side as was his instinct. Foggon was played in a new role which Charlton created to break the offside trap set by opposition defenders, an extremely fast player he was instructed to run behind defenders and latch on to the long ball to find himself one-on-one with the goalkeeper."]}, {"page": "Middlesbrough F.C.", "response": ["* David Armstrong (431)", "|1980|| David Armstrong"]}, {"page": "Mark Wright (footballer, born 1963)", "response": ["Wright was only 18 when he arrived at the Dell and the Saints were flying high at the top of the table under manager Lawrie McMenemy. He made his debut for the club in a 3–1 win over Leeds United at Elland Road on 17 April 1982, a game which saw two Saints legends, Kevin Keegan and David Armstrong, score the goals. He featured in two of the Saints' remaining five league matches that season as Southampton eventually finished seventh in the league and qualified for the UEFA Cup."]}, {"page": "David Armstrong", "response": ["*David Armstrong (Wisconsin politician), Wisconsin state legislator", "*David Armstrong (bobsleigh) (born 1964), British Olympic bobsledder", "*David Armstrong (footballer, born 1954), English international footballer", "*David Armstrong (footballer, born 1987), Northern Irish footballer", "*David Armstrong (director), American theatre director", "*David Armstrong (photographer) (1954–2014), American art photographer", "*J. David Armstrong Jr., American academic and president of Broward College", "*David Armstrong, a fictional character from the 2001 video game Operation Flashpoint: Cold War Crisis", "*David Armstrong-Jones, 2nd Earl of Snowdon (born 1961), member of the British Royal Family, more commonly known as David Linley"]}, {"page": "Bobby Murdoch", "response": ["Murdoch left Celtic in 1973 and joined Middlesbrough on a free transfer as Jack Charlton's first signing.Obituary: Bobby Murdoch (The Guardian, 2001) He provided advice to the young Graeme Souness and the club was promoted to Division One in his first season there. He made 125 appearances for Middlesbrough before his playing retirement in 1976. Murdoch then took up the role of coaching Middlesbrough youth players. He had a brief, unsuccessful, spell as manager of Middlesbrough between 1981 and 1982. Murdoch left the club shortly after it was relegated to Division Two. His job at Middlesbrough had been made difficult by the fact that the club had sold star players such as Craig Johnston, David Armstrong and Mark ProctorMiddlesbrough FC manager profile - Bobby Murdoch"]}]}}