{"wiki_id": "http://www.wikidata.org/entity/Q7648032", "itemLabel": "Mary Jeune, Baroness St Helier", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Jeune,_Baroness_St_Helier", "wikipedia_page": {"main": "Susan Elizabeth Mary Jeune, Baroness St Helier,  (née Mackenzie, previously Stanley; 18 May 1845 – 25 January 1931) was a London County Council alderman and the wife of  Francis Jeune, 1st Baron St Helier.", "link_mentions": [{"page": "William Evans-Gordon", "response": ["Julia was the sister of James Stewart-Mackenzie, 1st Baron Seaforth, who fought with the 9th Lancers during the Second Anglo-Afghan War of 1878–1880 (later Colonel of the regiment), and was later military secretary to M. E. Grant Duff. He married the daughter of Edward Steinkopff, owner of the St James's Gazette and dedicatee of Evans-Gordon's  The Alien Immigrant. Julia and James had one further sibling, Mary Jeune, Baroness St Helier, society hostess and politician."]}, {"page": "James Alexander Stewart-Mackenzie", "response": ["Through his eldest son Keith, he was a grandfather of James Alexander Francis Humberston Mackenzie, who was created Baron Seaforth in 1921, and of Mary Jeune, Baroness St Helier, society hostess and politician."]}, {"page": "St Helier Hospital", "response": ["The hospital was commissioned in 1934 when Surrey County Council acquired a 999-year lease of 10 acres of land on the St Helier council estate which had been named in honour of Mary Jeune, Baroness St Helier, a prominent alderman on the London County Council. Queen Mary laid the foundation stone for the new hospital on 26 March 1938. It was designed by Saxon Snell & Phillips, who were chosen for their experience in hospital design, in the thirties modernist style. It received its first patients in February 1941 during Second World War."]}, {"page": "James Stewart-Mackenzie, 1st Baron Seaforth", "response": ["Stewart-Mackenzie was the son of Keith William Stewart-Mackenzie (a son of James Alexander Stewart-Mackenzie) and Hannah Charlotte (daughter of James Joseph Hope-Vere). His sister became a society hostess and politician, known as Mary Jeune, Baroness St Helier. His grandmother was Mary Elizabeth Frederica Mackenzie, daughter and heiress of Francis Mackenzie, 1st Baron Seaforth, whose title had become extinct when his four sons all predeceased him."]}, {"page": "Susan, Lady St Helier", "response": ["#REDIRECT Mary Jeune, Baroness St Helier"]}, {"page": "Augustus Henry Eden Allhusen", "response": ["In 1897 he married Mary Dorothy Osma, daughter of Lieut.-Col. John Constantine Stanley and his wife Susan Elizabeth Mary Stewart-Mackenzie, a hostess and politician better known under her later name as Mary Jeune, Baroness St Helier."]}, {"page": "Henrietta Stanley, Baroness Stanley of Alderley", "response": ["* Hon. John Constantine (1837–1878), husband of hostess and politician Mary Jeune, Baroness St Helier"]}, {"page": "Susan Jeune, Baroness St Helier", "response": ["#REDIRECT Mary Jeune, Baroness St Helier"]}, {"page": "Susan Mary Elizabeth Jeune", "response": ["#REDIRECT Mary Jeune, Baroness St Helier"]}]}}