{"wiki_id": "http://www.wikidata.org/entity/Q7648738", "itemLabel": "Susannah Waters", "itemDescription": "British writer and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Susannah_Waters", "wikipedia_page": {"main": "Susannah Waters is a British writer and director. Born in Kent, England, she attended both Bennington College in America and the Guildhall School of Music, in London, as well as the National Opera Studio.\nActor Mark Rylance is one of her brothers. For twelve years, she worked as an opera singer, performing principal roles in many of the world's leading opera houses, including the Royal Opera House, Glyndebourne Festival Opera, Welsh National Opera, Scottish Opera, New York City Opera, Santa Fe Opera Festival, LA Opera, Seattle Opera, Théâtre du Châtelet, and Royal Swedish Opera.\nIn 2002, she left singing to become a writer and stage director. Her first novel, Long Gone Anybody, was published by Black Swan in 2004, and short-listed for the Pendleton May Award and Geoffrey Faber Award.  Her second novel, Cold Comfort, published by Black Swan in 2006, featured on Radio 4’s Today programme as one of the first fictional novels dealing with the effects of climate change. She is currently completing her third. She was an Associate Tutor in Creative Writing at the University of Sussex, and has tutored for the Arvon Foundation as well as mentoring for The Literary Consultancy.\nHer first music theatre piece, the regina monologues, was commissioned by the Covent Garden Festival in 2001, and starred, in respective productions, Penelope Keith, Janet Suzman and Susannah York. Other commissions for theatre have included The One I Love, a music theatre piece on conscientious objection to war for New Kent Opera, It’s Your Funeral, Baby, for Brighton-based company Theatre and Beyond, and Red All Over, a site-specific play performed in six rooms of a hotel, commissioned by the Lewes Live Literature Festival. Her most recent play, Eat This, was produced in a disused brewery and revived in the autumn of 2011 with the addition of an accompanying piece, Drink That.\nIn 2004, she founded her own production company, The Paddock, and as the Artistic Director, devised and produced theatre, dance and opera projects, including the children’s theatre piece, Elsie Piddock Skips in Her Sleep, a new touring production of Daisy Ashford’s The Young Visiters, a one-day outdoor dance festival, Something to Dance About, involving seven newly commissioned dances, and The Shoe Nail Dance, a High Street dance involving 200 people. In 2007, she commissioned and directed The Finnish Prisoner, a new opera from the composer Orlando Gough and librettist Stephen Plaice. The Finnish Prisoner had its world première in a warehouse in Lewes in a co-production with Finnish National Opera and was nominated for a Royal Philharmonic Society award in three categories.\nIn 2005 and 2007, Waters worked with Sir Thomas Allen, leading a large-scale education project at the Sage Gateshead Music Centre on Mozart’s Così fan tutte (2005) and Don Giovanni (2007), and culminating in the creation and performance of youth versions of the two operas. In 2013, Waters directed a new main stage community opera for Glyndebourne Festival Opera, co-devised with the composer Orlando Gough, librettist Stephen Plaice, and designer Es Devlin. In November 2013, she directed Chabrier’s L’Etoile for New Sussex Opera, and in May 2014 she directed a new production of Harrison Birtwistle’s Down by the Greenwood Side for the Brighton Festival.", "link_mentions": [{"page": "Robinson Crusoé", "response": ["Opera della Luna's 1994 production of the work toured and was revived at the Iford Arts Festival in 2004.\"Theatre Week\", The Stage, 9 June 1994, p. 10 The work was again presented at Sadler's Wells in 1995: British Youth Opera was conducted by Timothy Dean.\"Sadler's Wells – Robinson Crusoe\", The Stage, 28 September 1995, p. 15 Ohio Light Opera produced the work in 1996.Clarke, Kevin. \"Offenbach and Opera Rara\" , Operetta Research Center, 19 March, 2018. Retrieved 14 March 2019 In London there have been productions by the students of two conservatoires: the Guildhall School of Music and Drama (1988), with Susannah Waters as Edwige,Forbes, Elizabeth. Student Performance – Robinson Crusoe; Guildhall School of Music and Drama. Opera, August 1988, Vol. 39, No. 8, pp. 1012-1013. and the Royal College of Music (2019)."]}, {"page": "List of Bennington College people", "response": ["|Susannah Waters"]}, {"page": "Opera in New Orleans", "response": ["Also based in New Orleans, though short-lived, The New Opera Theatre (1986–1990) presented two world premieres as well as experimental productions of standard repertory. Their staging of Dido and Æneas toured to New York (Symphony Space), where it was acclaimed. Featured singers with this ensemble included Cyril and Libbye Hellier, Tracey Mitchell, Natalia Rom, Thaïs St Julien, Phyllis Treigle, and Susannah Waters."]}, {"page": "Nancy Maultsby", "response": ["* Purcell: Dido and Aeneas Nancy Maultsby (Dido), Russell Braun (Aeneas), Susannah Waters (Belinda); Boston Baroque (ensemble), Martin Pearlman (conductor). Label: Telarc"]}, {"page": "Susannah (given name)", "response": ["*Susannah Waters, British soprano"]}, {"page": "Cendrillon (Viardot)", "response": ["*Cendrillon by Pauline Viardot. André Cognet (baritone) Pictordu; Sandrine Piau (soprano) Cendrillon; Jean Rigby (mezzo) Armelinde; Susannah Waters (soprano) Maguelonne; Elizabeth Vidal (coloratura) La Fée; Jean-Luc Viala (tenor) Prince Charmant; Paul Austin Kelly (tenor) Barigoule. With the Geoffrey Mitchell Choir and Nicholas Kok, pianist and conductor. Recorded at Rosslyn Hill Chapel, Hampstead, London in 2000. Opera Rara ORR 212."]}, {"page": "Dido and Aeneas discography", "response": ["|Nancy MaultsbySusannah WatersRussell BraunLaura Tucker"]}, {"page": "The New Opera Theatre", "response": ["This was followed later the same year by Hänsel und Gretel, with identical-twins Libbye and Cyril Hellier in the title roles.  In 1988, The NOT produced, in collaboration with I Cantori di New York, Dido and Æneas, with Thaïs St Julien as Dido and Susannah Waters as Belinda, with Bart Folse conducting.  The production was first seen at New York City's Symphony Space, then in New Orleans."]}, {"page": "Russian Memorial, Lewes", "response": ["A popular Finnish folk-song, Oolannin sota (Crimean War), evolved from the earlier Ålandin sota laulu (Åland war song) which tells of the prisoners' capture and imprisonment in Lewes and is thought to have been written by one of the Lewes prisoners during his captivity. Stephen Plaice used the story as the inspiration for the libretto of an opera, The Finnish Prisoner, set to music by Orlando Gough and incorporating the song Oolannin sota. The opera received its world premiere in Lewes in 2007 under the direction of Susannah Waters with a cast of professional singers including members of the Finnish National Opera, a locally recruited amateur chorus, and a chorus of children. The production was the subject of a Finnish television programme which included material related to the memorial."]}, {"page": "The Finnish Prisoner", "response": ["Pappenheim, Mark, \"The Finnish Prisoner\", review in Opera (London), September 2007, pp. 1130–31 on stephenplaice.co.uk The production was previewed in The Guardian and covered by television channels from three countries as well as by local press and media. It was directed by Susannah Waters with a cast of professional singers including members of the Finnish National Opera and locally recruited amateur choruses. The highlight of the premiere was what Mark Pappenheim's review in Opera called the \"hair-raisingly deep-toned rendition\" of Oolannin sota by the Finnish singers, whose style Waters had described in rehearsal as \"simple, open-throated singing free of operatic airs\".", "|colspan=\"2\"|Director||Susannah Waters"]}]}}