{"wiki_id": "http://www.wikidata.org/entity/Q7647788", "itemLabel": "Susan Elderkin", "itemDescription": "author", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Elderkin", "wikipedia_page": {"main": "Susan Elderkin (born 1968 in Crawley) is an English author of two critically acclaimed novels, her first, Sunset Over Chocolate Mountains won a Betty Trask Prize and was shortlisted for the Orange Prize for Fiction, her second, The Voices was shortlisted for the Ondaatje Prize and longlisted for the International Dublin Literary Award. She was one of Granta Magazine's 20 Best Young British Novelists in 2003 and won the 2007 Society of Authors Travel Award. She is the author, with Ella Berthoud, of The Novel Cure: An A-Z of Literary Remedies and The Story Cure: Books to Keep Kids Happy, Healthy and Wise.", "link_mentions": [{"page": "Bata Corporation", "response": ["* In Susan Elderkin's 2000 novel Sunset Over Chocolate Mountains one of the three narrative voices is Eva, a worker in a Bata factory in Partizánske, Slovakia."]}, {"page": "Granta", "response": ["*Susan Elderkin"]}, {"page": "UEA Creative Writing Course", "response": ["*Susan Elderkin (MA, 1994) 2000 Betty Trask Award winner for Sunset Over Chocolate Mountains"]}, {"page": "Betty Trask Award", "response": ["* Susan Elderkin for Sunset Over Chocolate Mountains - £4,000"]}, {"page": "The Mechanics' Institute Review", "response": [", Published in September 2008 Introduction by Susan Elderkin.Susan Elderkin"]}, {"page": "Voices", "response": ["*The Voices, a 2003 novel by Susan Elderkin"]}, {"page": "Elderkin", "response": ["* Susan Elderkin (born 1968), English author"]}, {"page": "Sunset Over Chocolate Mountains", "response": ["Sunset Over Chocolate Mountains is a novel by English author Susan Elderkin published by Fourth Estate, It won a Betty Trask Award in 2000.,Betty Trask Past Winners was shortlisted for the Orange Prize for fictionSusan Elderkin The Voices and has been published in nine countries (it is called Arizona Ice Cream in FranceArizona ice cream: Amazon.co.uk: Susan Elderkin, Catherine de Saint-Phalle: Books) She is currently working on adapting it for film.", "In an interview with amazon.co.uk she reveals she began writing about a fat man doing yoga in the desert whilst studying on the UEA Creative Writing Course and then spent time herself living in the Arizona desert near Tucson.An interview with Susan Elderkin In writing it Elderkin drew on her own experiences having worked as an ice-cream seller and taught English at the same shoe factory featuring in the novel.Susan Elderkin from HarperCollins Publishers Australia", "*Publishers Weekly writes \"British author Elderkin has crafted a complex, heartbreaking tale, entwining the lives of quirky characters in an improbable but compelling narrative illustrating the agonizing potential of love to cause more pain then pleasure. The reader occasionally feels distanced from the action, and an abrupt, unnerving ending falls short, but this is a promising debut.\"Fiction Review: Sunset Over Chocolate Mountains by Susan Elderkin, Author Atlantic Monthly Press", "*Daddy, where did I come from? Sticky love and harsh callousness: Susan Elderkin's first novel, Sunset Over Chocolate Mountains, is excellently written, but not exactly literature review by Anna Shapiro in The Guardian"]}, {"page": "Travelling Scholarship", "response": ["* Susan Elderkin"]}, {"page": "The Voices (Susan Elderkin novel)", "response": ["#REDIRECTSusan Elderkin", "The Voices is a 2003 novel by Susan Elderkin which was shortlisted for the Ondaatje Prize. The story, set in the western Australian outback, is about a boy who is found ten years after disappearing into the Outback following ghostly voices.The Guardian Review"]}]}}