{"wiki_id": "http://www.wikidata.org/entity/Q7649020", "itemLabel": "Susie Dent", "itemDescription": "English lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Susie_Dent", "wikipedia_page": {"main": "Susan Francesca Dent (born 19 November 1964) is an English lexicographer, etymologist, and media personality. She has appeared in \"Dictionary Corner\" on the Channel 4 game show Countdown since 1992. She also appears on 8 Out of 10 Cats Does Countdown, a post-watershed comedy version of the show presented by comedian Jimmy Carr. She has been honorary vice-president of the Chartered Institute of Editing and Proofreading (CIEP) since 2016.", "link_mentions": [{"page": "Bikini", "response": ["By making an analogy with words like bilingual and bilateral containing the Latin prefix \"bi-\" (meaning \"two\" in Latin), the word bikini was first back-derived as consisting of two parts, [bi + kini] by Rudi Gernreich, who introduced the monokini in 1964. Later swimsuit designs like the tankini and trikini further cemented this derivation. Over time the \"–kini family\" (as dubbed by author William SafireWilliam Safire, No Uncertain Terms, page 291, Simon & Schuster, 2003, ), including the \"–ini sisters\" (as dubbed by designer Anne ColeTrish Donnally, \"\"Inis\" Are In\", San Francisco Chronicle, May 18, 1999), expanded into a variety of swimwear including the monokini (also known as a numokini or unikini), seekini, tankini, camikini,  (also hipkini), minikini, face-kini, burkini, and microkini. The Language Report, compiled by lexicographer Susie Dent and published by the Oxford University Press (OUP) in 2003, considers lexicographic inventions like bandeaukini and camkini, two variants of the tankini, important to observe.\"The Language Report: The ultimate record of what we're saying and how we're saying it \", Science News (from Article Archive), August 7, 2004 Although \"bikini\" was originally a registered trademark of Réard, it has since become genericized."]}, {"page": "Philip Pullman", "response": ["In January 2020, Pullman called for literate people to boycott the newly minted Brexit 50p coin due to the omission of the Oxford comma in its slogan \"Peace, prosperity and friendship with all nations\".  The viewpoint was supported by some, while lexicographer Susie Dent indicated it was optional and Baroness Bakewell said she had been \"taught that it was wrong to use the comma in such circumstances\"."]}, {"page": "Somerville College, Oxford", "response": ["Somervillians include Prime Ministers Margaret Thatcher and Indira Gandhi, Nobel Prize winning scientist Dorothy Hodgkin, television personalities Esther Rantzen and Susie Dent, reformer Cornelia Sorabji, writers Marjorie Boulton, A. S. Byatt, Vera Brittain, Susan Cooper, Penelope Fitzgerald, Winifred Holtby, Nicole Krauss, Iris Murdoch and Dorothy L. Sayers, politicians Shirley Williams, Margaret Jay and Sam Gyimah, Princess Bamba Sutherland and her sister, biologist Marian Dawkins, philosophers G. E. M. Anscombe, Patricia Churchland, Philippa Foot and Mary Midgley, psychologist Anne Treisman, archaeologist Kathleen Kenyon, actress Moon Moon Sen, soprano Emma Kirkby, banker Baroness Vadera and numerous (women's rights) activists."]}, {"page": "Countdown (game show)", "response": ["Countdown is a British game show involving word and number tasks. It is broadcast on Channel 4 and currently presented by Anne Robinson, assisted by Rachel Riley, with resident lexicographer Susie Dent. It was the first programme to be aired on Channel 4, and 83 series have been broadcast since its debut on 2 November 1982. With over 7,000 episodes, Countdown is one of the longest-running game shows in the world, along with the original French version, Des chiffres et des lettres (Numbers & Letters), which has been running on French television continuously since 1965. Countdown was initially recorded at The Leeds Studios for 27 years, before moving to Manchester-based Granada Studios in 2009. Following the development of MediaCityUK, Countdown moved again in 2013 to the new purpose-built studios at Dock10, Greater Manchester.", "In the early years, the show had multiple assistant presenters, including Carol Vorderman, who was hired for the first series to check calculations in the numbers round. Vorderman's role expanded to include placing the number and letter tiles and being a co-host of the show. She left in 2008, at the same time as O'Connor, and was replaced by Rachel Riley. Susie Dent has been the permanent lexicographer since 2004, and appears in \"Dictionary Corner\" alongside a guest.", "!scope=row|Susie Dent", "Over time, the additional hostesses on the programme were dropped by production staff, who retained Vorderman and assigned her primarily to handle the selection of letter and number tiles, as well as verifying contestant calculations. Thus her role was expanded to that of a co-presenter alongside Whiteley.Independent.co.uk  on viewer dissatisfaction with Vorderman's expanded role—Retrieved 20 June 2006. The programme frequently rotated between various lexicographers, including Richard Samson and Alison Heard, for each series, until in 2004 the role was permanently given to Susie Dent, after her debut on Countdown in 1992.The Countdown Page on lexicographers.", "Since the change to 45-minute episodes, the game has been split into three sections, separated by advertising breaks. The first section contains two letters rounds and a numbers round, the second has two letters rounds and a numbers round followed by the anecdote from the Dictionary Corner guest and then a further two letters rounds and a numbers round, while the last section has two letters rounds, Susie Dent's \"Origins of Words\" item, two further letters rounds, a numbers round and a final \"Conundrum\" puzzle. With the exception of the Conundrum, the contestants swap control after every round so that each of them has control for five letters rounds and two numbers rounds.", "In September 2007, an \"Origin of Words\" feature was added to the show, in which Susie Dent explains the origin of a word or phrase she has been researching. This feature follows the eighth letters round, partway through the third section of each episode. The feature was omitted during the time that Dent was absent for maternity leave, and was reinstated upon her return.", "When the 15-round format was first introduced in September 2001, the composition of the rounds was different from that used by the programme today. The three sections each had five rounds, four letters rounds and one numbers round in each of the first two sections, with three letters rounds, one numbers round and the conundrum in the third section. This meant that there was a slight imbalance, whereby one contestant made the letters sections for six rounds, but had the choice of the numbers selection just once, whereas the other contestant chose letters five times and numbers twice. The Dictionary Corner guest's spot was immediately before the first advertising break, and Susie Dent's Origin of Words spot preceded the second numbers game shortly before the second break. The change to the present format was made on 25 March 2013, three weeks into the second section of Series 68, to comply with Channel 4's decision to increase the amount of adverts and alter the times when they occur during the programme, therefore reducing Countdown's actual show length from 36 to 35 minutes.", "Richard Whiteley and Carol Vorderman competed in another special episode on Christmas Day 1997. For this game, the presenter's chair was taken by William G. Stewart, the host of fellow Channel 4 game show Fifteen to One. Susie Dent took over Vorderman's duties, and Mark Nyman occupied Dictionary Corner, accompanied by Magnus Magnusson. The game was close-fought, and decided only by the crucial Countdown conundrum mistletoe which Vorderman solved in two seconds, after Whiteley had inadvertently buzzed after one second, because when he regularly hosted the show, he hit the button to reveal the conundrum and kept his old habit up.The Countdown Page recap of Whiteley vs. Vorderman Christmas special—Retrieved 25 June 2006."]}, {"page": "John Sergeant (journalist)", "response": ["Sergeant has appeared on television programmes such as Have I Got News for You. He is currently a reporter for The One Show. When the hosts Adrian Chiles and Christine Bleakley were on holiday Sergeant hosted the show alongside Myleene Klass for a week starting on 24 August 2009. Sergeant has been a guest in Countdowns Dictionary Corner with Susie Dent. In February 2009 he appeared on QI (series F, episode 10). In 2014 he became the narrator for the UK version of the interesting facts game programme, Duck Quacks Don't Echo, first series only."]}, {"page": "Alistair McGowan", "response": ["McGowan is a supporter of Leeds United, even claiming that he decided to study at Leeds partly because of its proximity to Elland Road, and Coventry City, the team closest to the area where he spent his late teens,the guardian 5 October 2017  and his interest in football forms the basis of his 2009 book A Matter of Life and Death. On 17 December 2012 edition of Countdown, Susie Dent revealed that McGowan neither owns a car nor drives."]}, {"page": "Carol Vorderman", "response": ["Vorderman recorded her last Countdown show on 13 November 2008 which was broadcast on 12 December 2008. Both of her children were in the audience, together with many of the previous guests from \"Dictionary Corner\". After the prizegiving at the end of the show, Des O'Connor was presented with a bouquet of flowers by the show's lexicographer Susie Dent, and Vorderman received one from Gyles Brandreth. She was too moved to complete her farewells. A special show, One Last Consonant, Please Carol, hosted by Brandreth and featuring Vorderman's highs and lows during the 26 years of the show, was also filmed and transmitted just before her final Countdown appearance. After leaving Countdown, Vorderman continued to contribute her column to the British magazine Reveal."]}, {"page": "Brewer's Dictionary of Phrase and Fable", "response": ["* 19th (2012): Susie Dent. ", "* 20th (2018): Susie Dent. "]}, {"page": "Pam Ayres", "response": ["Since 2002 Ayres has appeared a number of times on Channel 4 in Countdown's Dictionary Corner alongside Susie Dent."]}, {"page": "Gyles Brandreth", "response": ["In April 2019, Brandreth began co-hosting a podcast titled Something Rhymes With Purple alongside friend and colleague Susie Dent. The podcast discusses aspects of the English language such as historic or unusual words and their origins, as well as the origins of popular phrases and sayings."]}, {"page": "Jennie Bond", "response": ["In September 2012, Bond appeared alongside Susie Dent on the Channel 4 programme Countdown."]}, {"page": "List of lexicographers", "response": ["*Susie Dent (UK, born 1964) English"]}, {"page": "Wellington College, Berkshire", "response": ["In 2017, WTV produced a film called 'Planet Wellington', feeding off the success of the popular BBC series 'Planet Earth II', for the opening of the 2017 Speech Day. The 2016-17 year also saw the creation of the series 'Pink Pav Sessions' and 'Solo'. Similarly to 2017, WTV produced the opening film for Speech Day 2018, 'Speech Day Pitch', in which the Master pushed his vision for the 'Five I's' while the student team continued to bring exclusive coverage of the Pearson Festival of Education with headline interviews with Piers Morgan and Susie Dent. In December 2018, WTV's 2012 interview with humanitarian Peter Dalglish was used in an episode of Al Jazeera's 101 East, entitled 'Nepal's Children at Risk'."]}, {"page": "Chav", "response": ["By 2004, the word was used in national newspapers and common parlance in the UK. Susie Dent's Larpers and Shroomers: The Language Report, published by the Oxford University Press, designated it as the \"word of the year\" in 2004."]}, {"page": "Tankini", "response": ["According to author William Safire, \"The most recent evolution of the -kini family is the tankini, a cropped tank top supported by spaghetti-like strings.\"William Safire, No Uncertain Terms, page 291, Simon & Schuster, 2003,  The tankini is distinguished from the classic bikini by the difference in tops, the top of the tankini essentially being a tank top. The tankini top extends downward to somewhere between just above the navel and the top of the hips. The word is a portmanteau of the tank of tank top and the suffix of bikini. This go-between nature of tankini has rendered its name to things ranging from a lemonade-based martini (Tankini Martini)Cornelia Schinharl, Sebastian Dickhaut & Kelsey Lane, Party Basics: Everything You Need for the World's Best Party, page 98, Silverback Books, 2002,  to server architecture (Tankini HipThread).Don Jones & Mark D. Scott, Using Microsoft Commerce Server 2002, page 211, Que Publishing, 2002,  The Language Report, compiled by lexicographer Susie Dent and published by the Oxford University Press (OUP) in 2003, considers lexicographic inventions like bandeaukini and camkini, two variants of the tankini, important to observe.\"The Language Report: The ultimate record of what we're saying and how we're saying it \", Science News (from Article Archive), 2004-08-07"]}, {"page": "Sean Lock", "response": ["Those who paid tribute included fellow 8 Out of 10 Cats performers Jimmy Carr, Jon Richardson, Rachel Riley, and Susie Dent; many comedians, including Omid Djalili, Ricky Gervais, Lee Mack, Eddie Izzard, Alan Davies, David Mitchell, Rob Brydon, Dara Ó Briain, Vic Reeves, Jo Brand, Jonathan Ross, Stewart Lee and Stephen Fry; Chelsea F.C.; QI; and Channel 4. Harry Hill wrote a piece in The Guardian, describing him as \"the comedian's comedian\". On 19 August 2021, Channel 4 aired a tribute to Lock, showing his stand-up show Keep It Light along with an episode of 8 Out of 10 Cats Does Countdown. Chelsea Football Club paid tribute to Lock on 11 September during their fixture against Aston Villa with a one-minute applause during the 58th (the age at which he died) minute of the match."]}, {"page": "Wendi Peters", "response": ["In 2001, Peters played Pamela Jolly in the ITV series Bad Girls for two episodes. In 2009, Peters was a finalist on Celebrity Masterchef. Her love of baking and cooking has led her to appearances on many cookery programmes including Market Kitchen, Christmas Cooks, This Morning, and  The F Word in 2008 with chef Gordon Ramsay. In 2006, Peters appeared on BBC's Celebrity Mastermind where she finished runner up to Paul Ross. She also appeared on Celebrity Who Wants To Be A Millionaire? with Jamie Theakston. In December 2006, Peters spent a week with resident lexicographer, Susie Dent, in Dictionary Corner on Countdown."]}, {"page": "Word of the year", "response": ["Since 2004, Susie Dent, an English lexicographer has published a column, \"A Word a Year\", in which she chooses a single word from each of the last 101 years to represent preoccupations of the time. Susie Dent notes that the list is subjective.A Word a Year: 1906–2006A Word a Year: 1905–2005A Word a Year: 1904–2004 Each year, she gives a completely different set of words.", "Since Susie Dent works for the Oxford University Press, her words of choice are often incorrectly referred to as \"Oxford Dictionary's Word of the Year\"."]}, {"page": "8 Out of 10 Cats", "response": ["Joe Wilkinson guest starred as the Banker's assistant. The guests were Nicola Adams, Rob Beckett, Gemma Collins, Mia Cross, Corinne Davies, Susie Dent, Matt Forde, John Fothergill, Stephen Frost, Nick Helm, Elis James, Dave Johns, Tony Law, Alice Levine, Mark Olver, Rachel Riley, John Robins, Katherine Ryan, Nong Skett, Andy Smart and Holly Walsh."]}, {"page": "Trudie Goodwin", "response": ["She then appeared on a TV Goodies/Baddies episode of the game show The Weakest Link in March 2007, where she lost out to Alex Walkinshaw in the final round. From 27 July to 7 August 2007, she appeared on Countdown in Dictionary Corner with Susie Dent, hosted by Des O'Connor and Carol Vorderman. Goodwin has made two appearances on ITV daytime show Loose Women, the first being May 2009, and the other in April 2010. In 2010, she was also a guest on Bill Bailey's Birdwatching Bonanza. In July 2013, she appeared on All Star Mr & Mrs. In November 2021, she portrayed the role of Meg Clarke in an episode of the BBC soap opera Doctors."]}, {"page": "Never Mind the Full Stops", "response": ["| Susie Dent & Lemn Sissay"]}, {"page": "Eponymous hairstyle", "response": ["In more recent times the hair of footballers Kevin Keegan, who acquired a curly \"bubble perm\" while playing for Southampton in the early 1980s, and David Beckham gave rise to much copying, but a \"Beckham\" was whatever style (\"buzz-cut\", cornrows, Fauxhawk, even an Alice band) he happened to wear at a given time.See Susie Dent (2003) The Language Report"]}, {"page": "1964 in the United Kingdom", "response": ["** Susie Dent, lexicographer "]}, {"page": "WAGs", "response": ["In 2006 it was generally printed as \"WAGs\", but a singular, \"Wag\" or \"WAG\", quickly came into vogue; for example: \"any additional pounds she gained during Wag drinking sessions\";Metro, 4 July 2006 \"a property heiress, model and actress, appears a likely sports WAG\".Times, 3 July 2006 Susie Dent's annual Language Report for the Oxford University Press (2006) capitalised the entire acronym as \"WAG\" (\"wife and/or girlfriend\") .Susie Dent (2006) The like, Language Report for real", "Interest in such partnerships scaled new heights in the late 1990s and early 21st century with the marriage (in 1999) of David Beckham to singer Victoria Adams (\"Posh Spice\") of the Spice Girls. The couple were widely known as \"Posh and Becks\" and every aspect of their relationship and nuance of dress were subjected to scrutiny in the press and other media. Victoria Beckham was quoted as saying that she and her husband had \"so many wider interests ... fashion, make-up. I mean you think, yeah, football's great, and singing's great. But you've got to look at the bigger picture\".Susie Dent (2003) The Language Report"]}, {"page": "Yo, Blair", "response": ["\"Yo, Blair, what are you doing?\" was an informal greeting reportedly made by United States President George W. Bush to British Prime Minister Tony Blair during the summit of the Group of Eight industrialized nations (G8) in St Petersburg, Russia, on 17 July 2006.Susie Dent (2007) The Language Report: English on the move 2000-2007 The quote gained wide popularity across the media.", "\"Yo, Blair\" or \"Yo, [any surname]\" almost immediately became a catchphrase in Britain. In her annual Language Report (2007) for the Oxford University Press, the lexicographer Susie Dent devoted over half a page to the term, including some of the references below."]}, {"page": "Philip Franks", "response": ["He also made regular appearances alongside Susie Dent in the 'Dictionary Corner' on the British quiz show Countdown (having applied to be a contestant on the show before becoming better known) until 2006. From December 2012 Franks played The Narrator in the 40th anniversary UK touring production of Richard O'Brien's Rocky Horror Show."]}, {"page": "Knismesis and gargalesis", "response": ["The gargalesis type of tickle works on primates (which include humans), and possibly on other species. For example, ultrasonic vocalizations described as \"chirping\", which play into social behavior and even have therapeutic effects, are reported in rats in response to human tickling. However, adult female rats may find the tickling sensation adverse.  Because the nerves involved in transmitting \"light\" touch and itch differ from those nerves that transmit \"heavy\" touch, pressure and vibration, it is possible that the difference in sensations produced by the two types of tickle is due to the relative proportion of itch sensation versus touch sensation. While it is possible to trigger a knismesis response in oneself, it is usually impossible to produce gargalesthesia, the gargalesis tickle response, in oneself. Hypergargalesthesia is the condition of extreme sensitivity to tickling.  The words knismesis and gargalesis were both used by Susie Dent in an episode of the BBC game show, Would I Lie to You? (Season 11, episode 4)."]}, {"page": "1967 in the United Kingdom", "response": ["* 21 September – Susie Dent, British lexicographer (Countdown)"]}, {"page": "Jumping jack (toy)", "response": ["Oxford Reference cites the word \"quockerwodger\" as \"a wooden puppet which can be made to 'dance' by pulling its strings\".Oxford Reference. Quockerwodger. Retrieved 31 October 2018  By analogy, quockerwodger came to be used for a politician whose \"strings\" are pulled entirely by their own \"puppetmaster\".Susie Dent. Twitter. Retrieved 4 June 2020"]}, {"page": "Language Report", "response": ["The Language Report (or, strictly, the language report) was an account of the state and use of the English language published by the Oxford University Press (OUP) in 2003. It was compiled by lexicographer Susie Dent, best known for her regular appearances on the television word game Countdown, and was an annual publication until 2007."]}, {"page": "The Museum of Curiosity", "response": ["*Susie Dent"]}, {"page": "Nick Hewer", "response": ["Nicholas Radbourn Hewer (born 17 February 1944) is a retired English television presenter, company director (2010) and former public relations consultant. From 2005 to 2014, he appeared as Alan Sugar's adviser in the British television series The Apprentice. From 2012 to 2021, he presented the Channel 4 programme Countdown with Rachel Riley and Susie Dent."]}, {"page": "Facepalm", "response": ["Images of stockbrokers facepalming have been widely used in the media to convey the dismay associated with poor financial performance, and a wide variety of regrettable film, business, and political decisions have been described as “facepalms” or “facepalm moments”. According to Oxford University Press lexicographer Susie Dent, this versatility is one of the reasons that the word has been linguistically “successful”. It was added to the Oxford English Dictionary in August 2011.\"Facepalm\". Oxford English Dictionary, n.d. http://www.oxforddictionaries.com/us/definition/american_english/facepalm"]}]}}