{"wiki_id": "http://www.wikidata.org/entity/Q7647615", "itemLabel": "Susan Brown", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Brown_(English_actress)", "wikipedia_page": {"main": "Susan Elizabeth Brown (born 6 May 1946) is an English actress of stage and screen. She had roles in the film The Iron Lady (2011) and the first season of the television series Game of Thrones (2011).\nBrown has been nominated for a Tony Award for her performance in the 2018 revival of the play Angels in America and a Laurence Olivier Award for her performance in the 2018 play Home, I'm Darling.", "link_mentions": [{"page": "Angels in America", "response": ["In February 2018, the 2017 Royal National Theatre production transferred to Broadway for an 18-week engagement at the Neil Simon Theatre. The majority of the London cast returned, with Lee Pace replacing Tovey as Joe, and Beth Malone playing the Angel at certain performances. Previews began on February 23, 2018 with opening night on March 25. The production won for Best Revival of a Play at that year's Tony Awards, with Garfield and Lane winning for Best Performance by a Leading Actor in a Play and Best Performance by a Featured Actor in a Play respectively for their reprisal of their National Theatre performances, while Denise Gough and Susan Brown were nominated for Best Performance by a Featured Actress in a Play. The production was recorded as an audiobook by Random House Audio, with Malone as the Angel and Bobby Canavale and Edie Falco narrating.", "| Susan Brown"]}, {"page": "Torchwood", "response": ["Children of Earth featured a largely new supporting cast for the duration of the five-episode serial, such as Permanent Secretary John Frobisher (Peter Capaldi), Clem McDonald (Paul Copley), Frobisher's personal assistant Bridget Spears (Susan Brown), Prime Minister Brian Green (Nicholas Farrell), ruthless operative Agent Johnson (Liz May Brice), Jack's middle-aged daughter Alice (Lucy Cohu), her son Steven (Bear McCausland) and Ianto's sister Rhiannon (Katy Wix). Cush Jumbo was cast as Frobisher's personal assistant Lois Habiba; Habiba was written into the story after Agyeman was unavailable to return to portray Martha."]}, {"page": "Tony Award for Best Featured Actress in a Play", "response": ["*Susan Brown in Angels in America as Hannah Pitt, et al."]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner, Maisie Williams"]}, {"page": "Andy Capp (TV series)", "response": ["*Susan Brown - Ruby"]}, {"page": "List of Torchwood characters", "response": ["Bridget Spears, played by Susan Brown, appears in Children of Earth and is the personal assistant to Home Office Permanent Secretary John Frobisher and immensely devoted to him – having worked together for thirty years. She gives Lois Habiba her username and password, so Lois can assist with the overwhelming number of people calling in, but Lois uses it to find out about the Torchwood Institute and Jack Harkness. After Frobisher tells Bridget about the 456, he hands her a file of a blank piece of paper. Bridget understands what this means and types up the names of four people to be killed, one of whom is the immortal Jack Harkness. Unbeknownst to Bridget, Lois sees this email and questions her own loyalties. After Frobisher's troubling meeting with the Prime Minister, Frobisher directs Bridget to sign for \"Requisition 31\" and bring it to him; the metal box contains a sidearm and a loaded magazine.  At the same time, Bridget signs for the Torchwood contact lenses confiscated from Lois when the latter is arrested for working with Torchwood. Bridget pays Lois a visit in her police custody cell to tell her that John Frobisher was a good man and that this should be remembered in the aftermath of what is about to happen. Later, after the 456 are defeated and the Prime Minister is ready to blame the Americans for the whole incident, Bridget reveals that Lois had told her how the Torchwood contact lenses worked, and that she had recorded everything the Prime Minister had said. Disgusted by his assertion that they were lucky to have someone else to blame for the incident, Bridget informs the Prime Minister that she is ready to reveal his involvement to the public. It is implied that this will be used to force Green from office."]}, {"page": "The Brides in the Bath", "response": ["* Susan Brown as Mrs. Crossley"]}, {"page": "The Chairs", "response": ["Director/choreographer David Gordon and his wife, dancer/actress Valda Setterfield, appeared in a version of the play, somewhat adapted and re-written by Gordon to the extent allowed by the Ionesco estate, in 2004.  This version of The Chairs was presented in London, at the Barbican Center, in Seattle, Washington, and at the Brooklyn Academy of Music in New York.Demetre, Jim. \"A fresh arrangement of 'The Chairs'\" Seattle Post-Intelligencer (November 12, 2004)McCarter, Jeremy. \"Made in Japan (& America, & Japan...)\" New York Sun (December 3, 2004) The play was also revived at the Gate Theatre in Notting Hill, London, in November 2006.The Chairs The farewell production of departing artistic director Thea Sharrock, it starred Susan Brown and Nicholas Woodeson in the key roles."]}, {"page": "Dreamfall Chapters", "response": ["Many characters from the earlier The Longest Journey and Dreamfall were re-cast for the third game in the series, including both returning playable characters. Although Zoë Castillo's original voice actress, Ellie Conrad-Leigh, has expressed readiness to reprise this role, she was voiced by Charlotte Ritchie in Chapters instead. Likewise, Nicholas Boulton voiced Kian Alvane, taking over from Gavin O'Connor. Sarah Hamilton, the voice of April Ryan in the previous games, was announced to return in Chapters during the Kickstarter campaign, but is not credited in the final release. Returning actors included Roger Raines and Ralph Byers, with the former reprising his role as Crow, and the latter as both Brian Westhouse and Roper Klacks. The last playable character of Chapters, Saga, was voiced by Ava Khan, Eleanor Matsuura, and Susan Brown as a teenager, an adult, and an old woman (Lady Alvane), respectively."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*Susan Brown"]}, {"page": "100 (audio drama)", "response": ["*Midwife — Susan Brown", "*Mary — Susan Brown"]}, {"page": "Rose and Maloney", "response": ["Additional cast members include Nisha Nayar, Susan Brown, Anne Reid and David Westhead. Guest stars throughout the series run include Tara Fitzgerald, Danny Dyer, Tiana Benjamin, Andrew-Lee Potts and Neil Dudgeon. Three series of the programme were broadcast, beginning with a two-part pilot episode on 29 September 2002. Due to strong viewing figures, a second series of six episodes - again, all two-part stories, was commissioned for broadcast in 2004, followed by a third series in 2005, which saw a slight change to the format, with each episode being self-contained, and the length of each episode extended. ITV chose not to re-commission the show for a fourth series. The series has never been released on DVD; however all three series have been released, free-to-view, on YouTube, via the programme's production company, All3 Media.", "* Susan Brown as Wendy Sillery (Series 2)"]}, {"page": "Susan Brown", "response": ["* Susan Brown (mathematician) (1937–2017), British professor of mathematics", "* L. Susan Brown (born 1959), Canadian anarcha-feminist writer", "* Susan Brown (minister) (born 1958), Scottish minister", "* Susan Brown (English actress) (born 1946)", "* Susan Brown (American actress) (1932–2018)", "* Susan Brown (judge), judge of the Supreme Court of Queensland, Australia"]}, {"page": "List of former Coronation Street characters", "response": ["|rowspan=\"2\"|Connie Clayton || Susan Brown || 1985 </tr>", "|Maureen Tully || Susan Brown || 2006"]}, {"page": "The Hour We Knew Nothing of Each Other", "response": ["* Susan Brown"]}, {"page": "Laurence Olivier Award for Best Actress in a Supporting Role", "response": ["|Susan Brown"]}, {"page": "Harper Regan", "response": ["| Alison Woolley || Susan Brown"]}, {"page": "Torchwood: Children of Earth", "response": ["Children of Earth featured a largely new supporting cast for the duration of the five-episode serial. Further new characters included Clem McDonald (Paul Copley), senior Home Office official Bridget Spears (Susan Brown), Prime Minister Brian Green (Nicholas Farrell), and ruthless operative Agent Johnson (Liz May Brice). Katy Wix and Rhodri Lewis play Rhiannon and Johnny Davies, Ianto's sister and brother-in-law respectively. Lucy Cohu plays Captain Jack Harkness's daughter Alice. The voice of the 456 was provided by actor and voiceover artist Simon Poland.Simon Poland IMDb, accessed 31 August 2021."]}, {"page": "The Riff Raff Element", "response": ["*Susan Brown — Maggie Belcher"]}, {"page": "Plague of the Daleks", "response": ["*Mrs Withers/Mrs Sowerby/Computer Voice — Susan Brown"]}, {"page": "The Song of Megaptera", "response": ["*Chief Engineer/Chanel — Susan Brown"]}, {"page": "The Second Doctor Boxset", "response": ["*Babs – Susan Brown"]}, {"page": "List of Game of Thrones characters", "response": ["| Susan Brown || Septa Mordane ||  || colspan=7 ", "* Septa Mordane (season 1) portrayed by Susan Brown. Septa Mordane was a priestess of the Faith of the Seven Gods (of which Catelyn Stark is an observer) and governess to the young ladies of Winterfell. She was killed by the Lannisters after Eddard Stark's failed attempt to arrest King Joffrey and Queen Regent Cersei."]}, {"page": "Deimos and The Resurrection of Mars", "response": ["*Margaret – Susan Brown"]}, {"page": "The Iron Lady (film)", "response": ["*Susan Brown as June, Margaret's live-in carer"]}, {"page": "Game of Thrones (season 1)", "response": ["* Susan Brown as Septa Mordane", "|scope=\"row\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams"]}, {"page": "Now Is Good", "response": ["* Susan Brown as Shirley"]}, {"page": "18th Screen Actors Guild Awards", "response": ["** Game of Thrones (HBO) – Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams"]}, {"page": "List of awards and nominations received by Game of Thrones", "response": ["| data-sort-value=\"Acharia, Amrita\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner, and Maisie Williams", "| data-sort-value=\"Acharia, Amrita\"| Amrita Acharia, Mark Addy, Alfie Allen, Josef Altin, Sean Bean, Susan Brown, Emilia Clarke, Nikolaj Coster-Waldau, Peter Dinklage, Ron Donachie, Michelle Fairley, Jerome Flynn, Elyes Gabel, Aidan Gillen, Jack Gleeson, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead Wright, Conleth Hill, Richard Madden, Jason Momoa, Rory McCann, Ian McElhinney, Luke McEwan, Roxanne McKee, Dar Salim, Mark Stanley, Donald Sumpter, Sophie Turner and Maisie Williams"]}, {"page": "LittleBigPlanet 3", "response": ["LittleBigPlanet 3 is fully voice-acted, including cutscenes and gameplay, whereas previous games only featured voice acting during cutscenes. As in previous LittleBigPlanet games, Stephen Fry narrates. Other actors for the game include Hugh Laurie as Newton, the main antagonist of the game, Lewis MacLeod as Oleg and Captain Pud, Newton's father, Tara Strong as Coach Rock and Vera Oblonsky, Robbie Stevens as Larry Da Vinci, Peter Serafinowicz as Dr. Maxim, El Jeff, and Papal Mache, Lorelei King as Elena and Felica, John Guerrasio as Guard 1 and Guard 2, Martin T. Sherman as Gustavo, Glenn Wrage as Head Guard, Clare Corbett as Hildur, Lucy Newman-Williams as Irene, Nolan North as Marlon Random, Susan Brown as Nana Pud (Newton's mother), Alix Wilton Regan as Pinky Buflooms, Judith Sweeney as Victoria von Bathysphere, and Simon Greenall as Zom-Zom The Far-Out."]}, {"page": "Susan Brown (American actress)", "response": ["Susan Brown (May 4, 1932 – August 31, 2018) was an American television and film actress and interior designer. She was best known for her roles on daytime soap operas, particularly General Hospital; in 1979, she was nominated for a Daytime Emmy Award for her role on the show."]}, {"page": "Broadchurch (series 1)", "response": ["* Liz Roper (Susan Brown) – Beth's mother and Danny's grandmother. She is a devoutly religious woman who attempts to help Beth work through her grief."]}, {"page": "Holby City (series 19)", "response": ["The series features several recurring characters, and numerous guest stars. Louisa Clein first appears as Kim Whitfield, a love interest for Raf, in episode 1. Her son Parker Whitfield (Louis Savison) first appears in episode 2. Both characters depart in episode 10. Clein appears again in episodes 19 and 20, while Davison returns in episode 22. Clein reprises the role in episode 53 for one episode, which also serves as Davison's departure. Tessa Peake-Jones reprises her role as Imelda Cousins, the former acting CEO of the hospital who last appeared in the fifteenth series, in episode 3. Ahead of her return, Peake-Jones said that returning to Holby City was \"like returning home\". Mark Healy was revealed to be returning to his role as Robbie Medcalf, Serena's former partner, on 13 September 2016. He appears in episode 5. Nic Jackman reprises his role as Cameron Dunn, an F1 doctor and Bernie's son, in episode 8. He departs in episode 14, but reappears in episodes 31 and 64. Jamie Nichols reprises his role as Lee Cannon, Dominic's former partner, in episode 11. Serena's daughter, Elinor Campbell (Amy McCallum), is reintroduced for two episodes from episode 12. Mr T's mother, Birdie Thompson (Susan Brown), is introduced for one episode, in episode 13. The character is reintroduced for one episode, appearing in episode 30.", "*Susan Brown as Birdie Thompson"]}]}}