{"wiki_id": "http://www.wikidata.org/entity/Q7653571", "itemLabel": "Swanee", "itemDescription": "British-born Australian rock singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Swanee_(singer)", "wikipedia_page": {"main": "John Swan  (born 15 March 1952), better known as Swanee, is an Australian rock singer.\nHe was born John Archibold Dixon Swan in Glasgow, Scotland in 1952. He is the older brother of singer-songwriter Jimmy Barnes, and an uncle of stage performer David Campbell.\nIn 2015, Swan was announced as South Australia's Senior Australian of the Year. and in 2017, was appointed an Order of Australia Medal (OAM).", "link_mentions": [{"page": "List of one-word stage names", "response": ["* Swanee (born 1952), Scottish-born Australian singer"]}, {"page": "The Knobz", "response": ["The band toured New Zealand before leaving for Australia in 1980, where they played with other acts of the period such as Divinyls, Men at Work, Mi-Sex, Swanee and Moving Pictures. The Knobz dispersed at the end of 1981, with some of the members moving on to other projects; most notably, drummer Bob Reid went on to play for the powerhouse Sydney band The Sharks."]}, {"page": "Cowcaddens", "response": ["Jimmy Barnes and his elder brother John Swan (aka Swanee) spent their early childhood living in Cowcaddens before emigrating to Australia."]}, {"page": "Jimmy Barnes", "response": [" but he was raised Protestant. He called his childhood environment a \"slum\" of alcohol and violence, stating that his mother had him and his four siblings (John, Dorothy, Linda and Alan) before she was 21. His older brother, John, would also later become known as a singer under the name Swanee. John encouraged and taught Barnes how to sing, as he was not initially interested. He and his family arrived in Australia when he was five years old on 21 January 1962, originally in Adelaide, though they eventually settled in nearby Elizabeth.Jimmy Barnes, Working Class Boy, HarperCollins Publishers Australia Pty Limited, 2016, page 61 Another sister, Lisa, was born later that year.Jimmy Barnes, Working Class Boy, HarperCollins Publishers Australia Pty Limited, 2016, page 75 Shortly afterward, their parents divorced. Dorothy remarried to a clerk named Reg Barnes, who died on 3 September 2013. Jimmy adopted the name James Dixon Barnes, after his stepfather.", "Barnes took up an apprenticeship in a foundry with the South Australian Railways in 1973, but the love he and his brother had for music led him to join a band. In 1974 his brother Swanee was playing drums with Fraternity, which had just parted ways with singer Bon Scott. Barnes took over the role but his tenure with the band was brief and in December 1975 Barnes had joined a harder-edged band called Orange, featuring organist and songwriter Don Walker, guitarist Ian Moss, drummer Steve Prestwich and bassist Les Kaczmarek.McFarlane, 'Cold Chisel' entry. Archived from the original on 19 April 2004. Retrieved 8 May 2018.", "In 1974, Orange had changed its name to Cold Chisel and began to develop a strong presence on the local music scene. Barnes' relationship with the band was often volatile and he left several times, leaving Moss to handle vocal duties until he returned. After a temporary move to Armidale, New South Wales while Walker completed his engineering studies there, Cold Chisel moved to Melbourne in August 1976, and then three months later shifted base to Sydney. Progress was slow and Barnes announced he was leaving once again in May 1977 to join Swanee in a band called Feather. However, his farewell performance with Cold Chisel went so well that he changed his mind and decided to stay in the band, and a month later WEA signed the band."]}, {"page": "The Delinquents (1989 film)", "response": ["# \"Lucille\" – Swanee (Written by Richard Penniman/Al Collins) (2:24)"]}, {"page": "List of number-one singles in Australia during the 1980s", "response": ["Hits by Australasian artists included \"If I Were a Carpenter\" by Swanee, \"Bad Habits\" by Billy Field, \"Boys in Town\" by Divinyls and \"State of the Heart\" by Mondo Rock.", "Hits by Australasian artists included \"Forever Now\" by Cold Chisel, \"Body and Soul\" by Jo Kennedy, \"Solid Rock\" by Goanna, \"Great Southern Land\" by Icehouse, \"Dirty Creature\" by Split Enz, \"Down on the Border\" by Little River Band and \"Lady, What's Your Name\" by Swanee."]}, {"page": "Tommy Emmanuel", "response": ["In December 2007, he was diagnosed with heart problems  and was forced to take a break from his hectic touring schedule due to exhaustion but returned to full-time touring in early 2008. In 2009 he worked with fellow local artists, Ray Burgess, Marty Rhone, John St Peeters and John \"Swanee\" Swan to release a single, \"Legends of the Southern Land\"."]}, {"page": "Mark Evans (musician)", "response": ["Mark Whitmore Evans (born 2 March 1956) is an Australian musician, the current bass guitarist for rock band Rose Tattoo, and also a member of hard rock band AC/DC from March 1975 to June 1977. His playing featured on their albums T.N.T, High Voltage, Dirty Deeds Done Dirt Cheap, Let There Be Rock and '74 Jailbreak. Evans has played for numerous other groups, sometimes on lead guitar, including Finch (a.k.a. Contraband), Cheetah, Swanee, Heaven and The Party Boys. Evans' autobiography, Dirty Deeds: My Life Inside/Outside of AC/DC was released in December 2011.", "After his departure from AC/DC, Evans played in a number of bands including hard rockers, Finch (a.k.a. Contraband), from June 1977 to 1979. This was followed by short stints with Cheetah in 1980 and Swanee in 1982. Evans joined the heavy metal group Heaven briefly in September 1983 on guitar as a replacement for Mick Cocks (ex-Rose Tattoo) following the recording of their \"Where Angels Fear to Tread\" album, but he left by July 1984. Evans featured in promo videos for \"Rock School\" and \"Where Angels Fear to Tread\". The group had some high-profile support slots, including opening for Mötley Crüe on their 'Shout at the Devil' tour, Kiss on their 1983-84 'Lick It Up' tour, their first without make-up, as well as the Ian Gillan led Black Sabbath. Evans has performed with ex-Buffalo singer Dave Tice in various bands, Headhunter, Dave Tice Band and Tice & Evans. He was a member of The Party Boys in the early 1990s. Dave Tice and Mark Evans release their latest recording 'Brothers In Arms' through Lungata Records and MGM Distribution 27 October 2011."]}, {"page": "Euphoria (Australian band)", "response": ["Euphoria were founded in Sydney in 1991 by producer Andrew Klippel (son of sculptor, Robert Klippel) on keyboards and backing vocals with lead vocals and dancing by both Holly Garnett and Keren Minshull. Klippel and Minshull were bandmates from Electric Soul. Klippel had been in a number of local bands and formed a song writing and production duo, ESP, with Melbourne-based DJ, Ean Sugarman, in the early 1990s. Minshull had previously worked as a session vocalist for Swanee, Noni Hazlehurst, and Jade Hurley. Minshull provided co-lead vocals with Rick Price on \"Celebration of a Nation\" (1988)."]}, {"page": "Noiseworks", "response": ["New Zealand-born pop singer Jon Stevens had released a solo album and several hit singles (including a duet with Sharon O'Neill) before relocating to Sydney in 1981. Stevens recorded a self-titled album for the Big Time label, two singles were issued but neither was successful. In 1983, Stevens formed The Change with guitarist Stuart Fraser, who had played in 1970s hard rock act Blackfeather (later called Feather) and then with fellow member Swanee. Bass player Steve Balbi, who was a member of Kevin Borich Express and played with The Change on their 1984 single \"Forever Young\". The following year, Stevens and Fraser hired Balbi and drummer Kevin Nicol (ex-Dial X). United States-born Justin Stanley was Balbi's song writing partner and joined the group in 1986, the band was renamed as Noiseworks."]}, {"page": "Peter Wells (guitarist)", "response": ["His third solo album, No Hard Feelings, appeared in June 1993 and was recorded with De Soto, Bremond, De Marco and Leach. It was co-produced by Wells and De Soto for ATI Records and Mushroom Records. In August that year it was followed by a four-track EP, Hard Done by You, co-credited to Peter Wells, Dave Steel (ex-Weddings Parties Anything), Bob Armstrong. In late 1994 Wells and De Soto reactivated Pete Wells Band with Turner and were joined by Mark Evans on bass guitar (ex-AC/DC, Finch, Heaven) and Mick O'Shea on drums (ex-Swanee, Judge Mercy). In the next year the line-up with Wells and De Soto were Cocks, De Marco and Andy Cichon on bass guitar (ex-Rose Tattoo, James Reyne Band, Judge Mercy). Wells issued his fourth solo album, Orphans, in June that year, which was co-produced by Wells and De Soto."]}, {"page": "List of songs about Los Angeles", "response": ["* \"Hollywood Girls\" by Swanee"]}, {"page": "List of Scottish musicians", "response": ["*Swanee, elder brother of Jimmy Barnes"]}, {"page": "List of people from Adelaide", "response": ["*Swanee"]}, {"page": "Fraternity (band)", "response": ["Late in 1974, Fraternity reformed with Eyers, Freeman, and Howe joined by Mauri Berg (Headband) on guitar, Peter Bersee on violin and John Swan (Hard Time Killing Floor) on lead vocals. In mid-1975, Freeman left and Swan switched to drums with his younger brother, Jimmy Barnes (Cold Chisel) joining on lead vocals.  Late in 1975   Barnes returned to Cold Chisel and Fraternity disbanded. John Swan, under the name Swanee, had a solo career.  Some Fraternity former members created the bands Some Dream and Mickey Finn. Mickey Finn comprised Eyers, Berg, Howe and Freeman. By 1980, a second guitarist, Stan Koritni, was added. They cut a self-titled album in 1980 for the Eureka label."]}, {"page": "Matt Finish", "response": ["On 13 August 2003, Moffitt died suddenly in his sleep, aged 46. His funeral, on what would have been his 47th birthday, 20 August, was attended by hundreds of people including Rob Hirst (Midnight Oil), Don Walker (Cold Chisel), Doc Neeson (The Angels), Scott Johnston Rose Tattoo, Swanee (aka John Swan) and Grossman. The number-plate of Matt's hearse was MF-47. In 2004, ScreenSound (National Film & Sound Archives) released a compilation CD album called Running in the Shadows: Oz rock rarities 1983-1994 featuring Matt Finish. In May that year, \"Short Note\" was covered by Wendy Matthews and appeared on her album Café Naturale."]}, {"page": "List of bands from Glasgow", "response": ["*Swanee"]}, {"page": "Swanee", "response": ["Swanee may refer to:", "* Suwannee River, re-spelled \"Swanee\" by Stephen Foster to fit the rhythm in \"Old Folks at Home\", influencing subsequent uses of the word, such as:", "** \"Swanee\" (song), a song by George Gershwin and Irving Caesar, made popular by Al Jolson", "** Swanee, a soft drink made by the defunct Bob's-Cola company ", "* Swanee (singer), the stage name of John Swan, an Australian rock singer", "* Swanee River (disambiguation)"]}, {"page": "Cheetah (band)", "response": ["In mid-1980 Chrissie collapsed in a Melbourne recording studio, due to a \"kidney infection\", which had cleared up by August. When not recording or performing, Chrissie lived in Melbourne and Lyndsay in Sydney. Cheetah gained popularity in Europe, especially \"Germany where the girls had a big hit with 'Deeper Than Love'\", which sold 96,000 copies. During 1981, for live performances, in Cheetah the Hammond sisters were backed by Mark Evans on bass guitar (ex-AC/DC), Michael Evans on guitar, Martin Fisher on keyboards and saxophone (Swanee, Little Heroes)), and John Lalor on drums (Stevie Wright Band, Swanee)."]}, {"page": "Rabbit (band)", "response": ["Tinson and Screen left the band early in 1977; Barry Lytten joined as drummer and Tinson was not replaced. A cover version of Paul Revere & the Raiders' 1969 hit, \"Let Me\", was released by Rabbit as a single in July 1977. Evans left the group in October and soon after Rabbit disbanded. Porteus, Screen and Tinson formed a hard rock group, Heroes, back in Newcastle, which released their self-titled album in October 1980; they broke up in 1982. Hinds had joined a Sydney-based hard rock group, Finch in 1977. After Heroes had split Screen and Tinson both joined Swanee and then were members of the Tex Pistols. Evans was a member of numerous other bands: Dave Evans and the Line-Ups, Hot Cockerel, David Evans and Thunder Downunder, and Surprise Party. "]}]}}