{"wiki_id": "http://www.wikidata.org/entity/Q765673", "itemLabel": "Thomas Bodley", "itemDescription": "English diplomat and scholar (1545-1613)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Bodley", "wikipedia_page": {"main": "Sir Thomas Bodley (2 March 1545 – 28 January 1613) was an English diplomat and scholar who founded the Bodleian Library in Oxford.", "link_mentions": [{"page": "January 28", "response": ["*1613 – Thomas Bodley, English diplomat and scholar, founded the Bodleian Library (b. 1545)"]}, {"page": "March 2", "response": ["*1545 – Thomas Bodley, English diplomat and scholar, founded the Bodleian Library (d. 1613)"]}, {"page": "University of Oxford", "response": ["The buildings referred to as the university's main research library, The Bodleian, consist of the original Bodleian Library in the Old Schools Quadrangle, founded by Sir Thomas Bodley in 1598 and opened in 1602, the Radcliffe Camera, the Clarendon Building, and the Weston Library. A tunnel underneath Broad Street connects these buildings, with the Gladstone Link, which opened to readers in 2011, connecting the Old Bodleian and Radcliffe Camera."]}, {"page": "1613", "response": ["* January 28 – Thomas Bodley, English diplomat and library founder (b. 1545)"]}, {"page": "1545", "response": ["* March 2 – Thomas Bodley, English diplomat and scholar, founder of the Bodleian Library, Oxford (d. 1613)"]}, {"page": "Bodleian Library", "response": ["The Bodleian Library () is the main research library of the University of Oxford, and is one of the oldest libraries in Europe, and derives its name from its founder, Sir Thomas Bodley.  With over 13 million printed items, it is the second-largest library in Britain after the British Library. Under the Legal Deposit Libraries Act 2003 it is one of six legal deposit libraries for works published in the United Kingdom,Legal Deposit Libraries Act 2003 and under Irish law it is entitled to request a copy of each book published in the Republic of Ireland.S198(5) Copyright and Related Rights Act 2000 Known to Oxford scholars as \"Bodley\" or \"the Bod\", it operates principally as a reference library and, in general, documents may not be removed from the reading rooms.", "===Sir Thomas Bodley and the re-founding of the University Library===", "The library went through a period of decline in the late 16th century: the library's furniture was sold, and only three of the original books belonging to Duke Humphrey remained in the collection.  During the reign of Edward VI, there was a purge of \"superstitious\" (Catholic-related) manuscripts. It was not until 1598 that the library began to thrive once more,Philip, Ian (1983); p. 1 when Thomas Bodley (a former fellow of Merton College, who had recently married a wealthy widow) wrote to the Vice Chancellor of the University offering to support the development of the library: \"where there hath bin hertofore a publike library in Oxford: which you know is apparent by the rome it self remayning, and by your statute records I will take the charge and cost upon me, to reduce it again to his former use.\" Six of the Oxford University dons were tasked with helping Bodley in refitting the library in March 1598. Duke Humfrey's Library was refitted, and Bodley donated a number of his own books to furnish it. The library was formally re-opened on 8 November 1602 under the name \"Bodleian Library\" (officially Bodley's Library). There were around two thousand books in the library at this time, with an ornate Benefactor's Register displayed prominently, to encourage donations. Early benefactors were motivated by the recent memory of the Reformation to donate books in the hopes that they would be kept safe."]}, {"page": "Exeter Cathedral", "response": ["In 1566 the Dean and Chapter presented to Matthew Parker, Archbishop of Canterbury, a manuscript of the Anglo-Saxon Gospels which had been given by Leofric; in 1602, 81 manuscripts from the library were presented to Sir Thomas Bodley for the Bodleian Library at Oxford. In 1657 under the Commonwealth the Cathedral was deprived of several of its ancillary buildings, including the reading room of 1412–13. Some books were lost but a large part of them were saved due to the efforts of Dr Robert Vilvaine, who had them transferred to St John's Hospital. At a later date he provided funds to convert the Lady chapel into a library, and the books were brought back."]}, {"page": "Merton College, Oxford", "response": ["Founder of the Bodleian Library, Thomas Bodley, was admitted as fellow in 1564. Another significant figure, Henry Savile, was appointed Warden some years later in 1585 (held the position until 1621) and had great influence of the development of the college. William Harvey, who was the first to describe in detail the systemic circulation, was warden from 1645 to 1646. Lord Randolph Churchill, Chancellor of the Exchequer and Leader of the House of Commons (and father of Winston Churchill), matriculated in October 1867, while Max Beerbohm, an English essayist, parodist, and caricaturist studied at Merton in the 1890s and was Secretary of the Myrmidon Club.", "File:Thomas Bodley.jpg|Thomas Bodley, diplomat, scholar, founder of the Bodleian Library"]}, {"page": "Public library", "response": ["In the early years of the 17th century, many famous collegiate and town libraries were founded in England. Norwich City library was established in 1608 (six years after Thomas Bodley founded the Bodleian Library, which was open to the \"whole republic of the learned\") and Chetham's Library in Manchester, which claims to be the oldest public library in the English-speaking world, opened in 1653."]}, {"page": "16th century in literature", "response": ["**Thomas Bodley refounds the Bodleian Library at the University of Oxford."]}, {"page": "1613 in literature", "response": ["*January 28 – Sir Thomas Bodley, English founder of the Bodleian Library (born 1545)"]}, {"page": "1610 in literature", "response": ["*December 12 – Sir Thomas Bodley makes an agreement with the Stationers' Company of London to put a copy of every book registered with it into his new Bodleian Library in the University of Oxford."]}, {"page": "1598 in literature", "response": ["*February 23 – Thomas Bodley refounds the Bodleian Library at the University of Oxford."]}, {"page": "List of librarians", "response": ["*Thomas Bodley – founder of the Bodleian Library; English diplomat; 1545–1613"]}, {"page": "Librarian", "response": ["Another key figure of this time was Sir Thomas Bodley, who gave up his career as a diplomat and established Oxford's Bodleian library. He is credited as creating the first functional library of modern times. Subsequent librarians following Bodley were called Protobibliothecarius Bodleianus, Bodley's Librarian. They would earn £40 a year. The ideas formed with these librarians continued to develop into the 17th century. With the approach of Bibliotheca Universalis, libraries changed; the content of libraries became less selective, to include literature of entertainment as well as academic value. At this time, libraries also became fully open to the public, with access no longer restricted to a small circle of readers."]}, {"page": "Thomas James", "response": ["James became a fellow of New College in 1593, where he served until 1602. In that year, his wide knowledge of books, together with his skill in deciphering manuscripts and detecting literary forgeries, secured him the post of librarian to the library newly founded by Sir Thomas Bodley at Oxford.Encyclopædia Britannica, Eleventh edition, a publication now in the public domain, accessed September 2009", "His first attempts at authorship were translations from the Italian of Antonio Brucioli's 'Commentary upon the Canticle of Canticles,' which was licensed for the press in November 1597, and from the French of Guillaume du Vair The Moral Philosophy of the Stoicks, London, 1598. He next edited Richard de Bury's The Philobiblon, Oxford, 1599, which he dedicated to Sir Thomas Bodley. In this dedication, James praised Bodley and his colleagues for their efforts in reestablishing the Oxford library, though there was never any indication of his future role as librarian. As the result of his researches in college libraries he published 'Ecloga Oxonio-Cantabrigiensis, tributa in libros duos,' London, 1600, a work commended by Joseph Scaliger. It gives a list of the manuscripts in the college libraries at Oxford and Cambridge, and in the university library at Cambridge, besides critical notes on the text of Cyprian's 'De Unitate Ecclesiæ' and of Augustine of Hippo's De fide."]}, {"page": "Rothbury", "response": ["In Rothbury folklore Simonside Hills overlooking Rothbury has a mythical creature called a deaugar or duergar (Norse for 'dwarf'). It is said that the creature lures people at night by its lantern light towards bogs or cliffs in order to kill them.[] The deaugar has entered into Rothbury's popular culture: in 2021 local musician and poet James Tait wrote a debut children's book called The World of Lightness: A Story of the Duergar of Simonside; an annual 10-mile winter nighttime trail run in the Simonside Hills is called the Duergar Nightcrawler; and a Rothbury art gallery is named Red Deaugar Art Gallery, run by local artist Margaret Bodley Edwards, a descendant of Gothic Revival architect George Frederick Bodley (1827–1907), and of diplomat and founder of the Bodleian Library in Oxford, Sir Thomas Bodley (1545–1613)."]}, {"page": "List of companies named after people", "response": ["* The Bodley Head – in honour of Thomas Bodley, whose bust stood above the founders' shop"]}, {"page": "Sir Thomas Bodley", "response": ["#redirect Thomas Bodley "]}, {"page": "St Bartholomew-the-Less", "response": ["* Thomas Bodley, founder of Bodleian Library: buried 1613"]}, {"page": "Heavitree", "response": ["Heavitree is a historic village and parish situated formerly outside the walls of the City of Exeter in Devon, England, and is today an eastern suburb of that city. It was formerly the first significant village outside the city on the road to London. It was the birthplace of Thomas Bodley, and Richard Hooker, and until 1818 was a site for executions.", "*Sir Thomas Bodley, the founder of the Bodleian Library, was born in Heavitree."]}, {"page": "List of eponymous adjectives in English", "response": ["*Bodleian – Thomas Bodley (as in Bodleian Library)"]}, {"page": "Nicholas Hilliard", "response": ["He appears to have been attached at a young age to the household of the leading Exeter Protestant John Bodley, the father of Thomas Bodley who founded the Bodleian Library in Oxford.  John Bodley went into exile on the accession of the Catholic Queen Mary I of England, and on 8 May 1557 Hilliard, then ten years old, was recorded in Geneva as one of an eleven-strong Bodley family group at a Calvinist service presided over by John Knox.  Calvinism does not seem to have struck with Hilliard, but the fluent French he acquired abroad was later useful.Strong (1975), pp.3–4 Thomas Bodley, two years older, continued an intensive classical education under leading scholars in Geneva, but it is not clear to what extent Hilliard was given similar studies."]}, {"page": "John Cotton Dana", "response": ["*Dana, John Cotton, and Henry W. Kent, eds. Literature of Libraries in the Seventeenth and Eighteenth Centuries. Chicago: A. C. McClure, 1906–07; reissued Metuchen: The Scarecrow Reprint Corporation, 1967.No. 1: The duties & qualifications of a librarian: a discourse ... in the Sorbonne, 1780; by Jean-Baptiste Cotton des Houssayes.--No. 2: The reformed librarie-keeper ... concerning the place and office of a librarie-keeper; by John Dury (1596-1680).--No. 3: The life of Sir Thomas Bodley written by himself together with the first draft of the statutes of the public library at Oxon.--No. 4: Two tracts on the founding and maintaining of parochial libraries in Scotland; by James Kirkwood (d. 1708).--No. 5: A brief outline of the history of libraries; by Justus Lipsius; transl. from 2nd ed, 1607 ...--No. 6: News from France or a description of the library of Cardinal Mazarin preceded by The surrender of the library ... two tracts written by Gabriel Naude (1600-1653)."]}, {"page": "Jerónimo Osório", "response": ["Silva Lopes, Memorias para a Historia Ecclesiastica do Bispado do Algarve (Lisboa 1848), p. 369. In 1600 Essex gave some 200 volumes to the Bodleian Library (then in the care of Thomas Bodley) in Oxford, none of which bear the signature of Bishop Osório.K.M. Pogson, 'A Grand Inquisitor, and his Library' (together with 'A list of books presented by the Earl of Essex in 1600, still in the Bodleian'), The Bodleian Quarterly Record III (Oxford 1922), pp. 239–44. It is possible however that the early codex of Tomé Pires' Suma Oriental and the Book of the cartographer Francisco Rodrigues, among the French National Manuscript Collections, belonged to Osório.A. Cortesao (ed.), The Suma Oriental of Tomé Pires (etc), 2 vols (Hakluyt Society, London 1944),  (introduction p. xv, & note)."]}, {"page": "Merton College Library", "response": ["The Upper Library was improved in the 16th century under Warden Sir Henry Savile. Large dormer windows were added to the roof to allow more light in, and Thomas Bodley reorganized it in the new Continental style; the old book chests and lecterns were replaced by bookshelves — among the first to be used in England — with benches between them. The Upper Library still retains these 16th-century fittings."]}, {"page": "Cataloging (library science)", "response": ["While the organization of information has been going on since antiquity, bibliographic control as we know it today is a more recent invention. Ancient civilizations recorded lists of books onto tablets and libraries in the Middle Ages kept records of their holdings. With the invention of the printing press in the 15th century, multiple copies of a single book could be produced quickly. Johann Tritheim, a German librarian, was the first to create a bibliography in chronological order with an alphabetical author index. Konrad Gesner followed in his footsteps in the next century as he published an author bibliography and subject index. He added to his bibliography an alphabetical list of authors with inverted names, which was a new practice. He also included references to variant spellings of author's names, a precursor to authority control. Andrew Maunsell further revolutionized bibliographic control by suggesting that a book should be findable based on the author's last name, the subject of the book, and the translator. In the 17th century Sir Thomas Bodley was interested in a catalog arranged alphabetically by author's last name as well as subject entries. Sir Robert Cotton's library catalogued books with busts of famous Romans. The busts were organized by their name, i.e. N for Nero, and then came the shelf with its assigned letter, and then the roman numeral of the title's number. For example the cataloging for The Lindisfarne Gospels reads Nero D IV. Cotton's cataloging method is still in use for his collection in the British Library.  In 1697, Frederic Rostgaard called for subject arrangement that was subdivided by both chronology and by size (whereas in the past titles were arranged by their size only), as well as an index of subjects and authors by last name and for word order in titles to be preserved based on the title page.   "]}, {"page": "George Carew, 1st Earl of Totnes", "response": ["Carew had a considerable reputation as an antiquary and was a friend of William Camden, John Cotton, and Thomas Bodley. He gathered a large collection of materials relating to Irish history and pedigrees, which he left to his secretary, Sir Thomas Stafford (supposed to be his illegitimate son). A portion has disappeared, but 39 volumes that came into Laud's possession are now held in Lambeth Palace Library, and a further four at the Bodleian Library. A calendar of the former was published in six volumes between 1867 and 1873, edited by J. S. Brewer and W. Bullen, under the title Calendar of the Carew Manuscripts preserved in the Archiepiscopal Library at Lambeth. Carew's correspondence from Munster with Sir Robert Cecil was edited in 1864 by Sir John Maclean for the Camden Society, and his letters to Sir Thomas Roe (1615–1617) in 1860."]}, {"page": "William Hakewill", "response": ["Hakewill was also an early member of the Society of Antiquaries, a friend of Sir Robert Cotton, a kinsman and executor of Sir Thomas Bodley and the elder brother of the author and divine George Hakewill.  In 1617 he married Elizabeth Woodhouse, a daughter of Sir Henry Woodhouse of Waxham, Norfolk, by his second wife Cecily Gresham.  Her elder half-sister Ann was the third wife of Sir Julius Caesar, Master of the Rolls, to whom Hakewill addressed gratulatory Latin verses (now in the British Library)."]}, {"page": "Matthieu Brouard", "response": ["Matthieu Brouard was a French theologian, mathematician, philosopher and historian, who was born in Saint-Denis near Paris in 1520, and  died in Geneva on July 15, 1576.Biographie universelle, ancienne et moderne, tome 4, Michaud, Paris 1843. He is also known as Matthieu Brouart or Béroalde and (in Latin) as Mattheus Beroaldus.  He taught Greek to the young Thomas Bodley and was the father of François Béroalde de Verville."]}, {"page": "Decorative box", "response": ["A strong box is a receptacle for money, deeds and securities. Its place has been taken in modern life by the safe. Some have extremely elaborate locks, such as Sir Thomas Bodley's strong box in the Bodleian library, which has a locking mechanism in the under-side of the lid."]}, {"page": "Hythe (UK Parliament constituency)", "response": ["| 1584||Christopher Honywood|| Thomas Bodley, sat for Portsmouth  replaced by ?George Morton"]}, {"page": "William Peryam", "response": ["Peryam was born in Exeter, the eldest son of John Peryam, twice mayor of Exeter, and his wife Elizabeth, a daughter and co-heir of Robert Hone of Ottery. The year of Peryam's birth is known to history but, as was common in the 16th century, the day and month went unrecorded. Through his mother's sister, Joan Bodley née Hone, Peryam was cousin to Sir Thomas Bodley. Like the Bodleys, the Peryams were early adherents of Protestantism and were also threatened in the time of Marian persecutions. Under Queen Elizabeth however, the family thrived, with William eventually achieving eminence in law and his younger brother John Peryam (1541 – c. 1618), MP, elected to Parliament four times (Barnstaple 1584, Bossiney 1586, Exeter 1589 and 1593) and becoming Mayor of Exeter. The lawyer and politician William Hakewill and the clergyman and author George Hakewill were his nephews.Sons of his sister, Thomazin Peryam: Sheila Doyle, 'Hakewill, William (bap. 1574, d. 1655)’, Oxford Dictionary of National Biography, Oxford University Press, 2004."]}, {"page": "New World Tapestry", "response": ["|| Walter Raleigh, Lawrence Kemys, Anthony Ashley, John Donne, Thomas Howard, John Hartington, Robert Devereux, Francis Vere, Charles Howard, George Carew, Thomas Bodley"]}, {"page": "List of ambassadors of the United Kingdom to the Netherlands", "response": ["* 1588−1593: Thomas Bodley English Councillor on the Dutch Council of State; again 1594−1596"]}, {"page": "Christian library", "response": ["Additionally, some private collectors (John Leland, Matthew Parker, William Cecil, Robert Cotton, etc.) were able to save some of the monastic holdings from destruction.Clement, Renaissance Libraries, p. 551 It was in the spirit of such private generosity that efforts to overturn the Reformation's more destructive impulses that moved Thomas Bodley to help re-establish the library at Oxford."]}]}}