{"wiki_id": "http://www.wikidata.org/entity/Q7659903", "itemLabel": "Sydney Donkin", "itemDescription": "British civil engineer (1871-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Donkin", "wikipedia_page": {"main": "Sydney Bryan Donkin (24 June 1871 – 12 November 1952) was a British civil engineer. His parents were Bryan Donkin Junior and Georgina Dillon. Donkin was educated at University College, London before beginning work for Sulzer Brothers, mechanical engineers, later the Sulzer company.  Whilst based at this company's headquarters in Switzerland he became interested in Alpine climbing and spent much of his spare time climbing the nearby peaks.  He was a founding member of the Climbers' Club and served on their committee in 1908 and later as vice-president and president.\nHe later became an assistant to Alexander Kennedy, the electrical engineer, and worked on several large hydro-electric dams including the first Lower Aswan Dam and the Owen Falls Dam.  He also sat on the general board of the National Physical Laboratory, as chairman of the Association of Consulting Engineers, president of the Association of Supervisory Electrical Engineers, president of the Institution of Civil Engineers (ICE) and president of the Smeatonian Society of Civil Engineers.  He was a proponent of social housing and built the first houses for the ICE Benevolent fund at Haywards Heath.", "link_mentions": [{"page": "Alexander Kennedy", "response": ["Kennedy also acted as a consultant to several railway companies in the London area, particularly in regard to electrification and tram systems. He advised the London County Council with regard to their tram network and instigated their use of unusual underground conduits for their electricity supply. In 1896 he was appointed engineer to the Waterloo and City Railway and the electrical systems were designed to his specifications. He held consultancy contracts with the London and Home Counties Electricity Authority, London Power Company, Edinburgh Corporation and the Calcutta Electric Supply Corporation. Kennedy hired as his Assistant Engineer at the firm another climber, Sydney Donkin, who was made a partner in the business in 1908 and became senior partner in 1934 upon the retirement of the son of the founder. "]}, {"page": "Donkin (surname)", "response": ["* Sydney Donkin (1871–1952), British engineer"]}, {"page": "John Donkin", "response": ["John Donkin was the father of Bryan Donkin Junior and grandfather of Sydney Donkin.  He was first cousin of William Fishburn Donkin."]}, {"page": "Kirkcaldy Corporation Tramways", "response": ["Despite a report from Alexander Kennedy and Sydney Donkin which recommended upgrading the system, the corporation failed to act, and system reliability was affected. In 1928, a bus service provided direct competition with the tram service."]}, {"page": "Sydney B. Donkin", "response": ["#redirectSydney Donkin"]}, {"page": "Sydney Bryan Donkin", "response": ["#REDIRECT Sydney Donkin"]}, {"page": "S. B. Donkin", "response": ["#redirectSydney Donkin"]}]}}