{"wiki_id": "http://www.wikidata.org/entity/Q7659950", "itemLabel": "Sydney Granville", "itemDescription": "British opera singer and actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Granville", "wikipedia_page": {"main": "Sydney Granville (born Walter Dewhurst; 1880 – 27 December 1959) was an English singer and actor, best known for his performances in the Savoy Operas with the D'Oyly Carte Opera Company.\nAfter early theatrical work in musical comedy, straight plays and grand opera, he joined the D'Oyly Carte company, at first in the chorus, then in lyric baritone roles and finally in the comic bass-baritone parts of the Gilbert and Sullivan operas.  With brief breaks when he performed for other managements, Granville was with D'Oyly Carte from 1907 to 1942.", "link_mentions": [{"page": "The Pirates of Penzance", "response": ["|Sergeant||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Richard Walker"]}, {"page": "The Mikado", "response": ["|Pooh-Bah||Fred Billington||Leo Sheffield||Sydney Granville||Richard Walker||Richard Watson", "In 1939, Universal Pictures released a ninety-minute film adaptation of The Mikado. Made in Technicolor, the film stars Martyn Green as Ko-Ko, Sydney Granville as Pooh-Bah, the American singer Kenny Baker as Nanki-Poo and Jean Colin as Yum-Yum. Many of the other leads and choristers were or had been members of the D'Oyly Carte company. The music was conducted by Geoffrey Toye, a former D'Oyly Carte music director, who was also the producer and was credited with the adaptation, which involved a number of cuts, additions and re-ordered scenes. Victor Schertzinger directed, and William V. Skall received an Academy Award nomination for Best Cinematography.\"The Mikado , Cinegram No. 75, Pilot Press, London (souvenir programme), The Gilbert and Sullivan Archive, 1938, accessed 31 July 2016Shepherd, Marc. \"The Technicolor Mikado Film (1939)\" , The Gilbert and Sullivan Discography, 28 June 2009, accessed 31 July 2016 Art direction and costume designs were by Marcel Vertès.Galbraith IV, Stuart. \"The Mikado (Blu-ray)\", DVDTalk, 27 March 2011 There were some revisions – The Sun Whose Rays Are All Ablaze is performed twice, first by Nanki-Poo in a new early scene in which he serenades Yum-Yum at her window, and later in the traditional spot. A new prologue which showed Nanki-Poo fleeing in disguise was also added, and much of the Act II music was cut."]}, {"page": "Iolanthe", "response": ["|Private Willis||Leo Sheffield||Leo Sheffield||Sydney Granville||L. Radley Flynn||Richard Watson"]}, {"page": "Ruddigore", "response": ["|Sir Despard||Rutland Barrington||Fred Billington||Leo Sheffield||Sydney Granville||Sydney Granville"]}, {"page": "H.M.S. Pinafore", "response": ["In 1911, H. L. Mencken wrote: \"No other comic opera ever written – no other stage play, indeed, of any sort – was ever so popular. ... Pinafore ... has been given, and with great success, wherever there are theaters – from Moscow to Buenos Aires, from Cape Town to Shanghai; in Madrid, Ottawa and Melbourne; even in Paris, Rome, Vienna and Berlin.\"Mencken, H. L. \"Pinafore at 33\", Baltimore Evening Sun, 1911, reproduced at The Gilbert and Sullivan Archive, accessed 10 March 2009 After the deaths of Gilbert and Sullivan, the D'Oyly Carte Opera Company retained exclusive rights to perform their operas in Great Britain until 1962, touring throughout Britain for most of the year and, beginning in 1919, often performing in London for a season of about four months. The Times gave the company's 1920 London production an enthusiastic review, saying that the audience was \"enraptured\", and regretting that Pinafore would be played for only two weeks. It praised the cast, singling out Leo Sheffield as the Captain, Henry Lytton as Sir Joseph, Elsie Griffin as Josephine, James Hay as Ralph, Bertha Lewis as Little Buttercup and the \"splendid\" choral tone. It concluded that the opera made a \"rollicking climax to the season\".\"H.M.S. Pinafore. Revival at Princes Theatre\", The Times, 21 January 1920, p. 10 Two years later, it gave an even more glowing report of that season's performances, calling Derek Oldham an \"ideal hero\" as Ralph, noting that Sydney Granville \"fairly brought down the house\" with his song, that Darrell Fancourt's Deadeye was \"an admirably sustained piece of caricature\" and that it was a \"great pleasure\" to hear the returning principals.\"H.M.S. Pinafore. Sullivan Opera Season Nearing The End\", The Times, 3 January 1922, p. 8 A 1961 review of the company's Pinafore is much the same.\"Novelty and Tradition in Savoy Operettas\", The Times, 12 December 1961, p. 5"]}, {"page": "The Yeomen of the Guard", "response": ["|Lieutenant||Sydney Granville||Joseph Griffin||Leslie Rands||Leslie Rands||Donald Harris", "|Wilfred||Leo Sheffield||Sydney Granville||Sydney Granville||Richard Walker||Richard Watson"]}, {"page": "Princess Ida", "response": ["|Florian||Charles Ryley||Charles F. Long||Stuart Harold||Leicester Tunks||Sydney Granville", "|Arac||Richard Temple||W. Ainsley Scott||Joseph Fay||Sydney Granville||Frederick Hobbs", "|King Hildebrand||Joseph Griffin||Sydney Granville||Fisher Morgan||Kenneth Sandford||Kenneth Sandford"]}, {"page": "The Gondoliers", "response": ["|Luiz||Sydney Granville||John Dean||Richard Dunn||Herbert Garry||Henry Goodier", "|Don Alhambra||Leo Sheffield||Sydney Granville||Sydney Granville||Richard Walker||Richard Watson"]}, {"page": "Martyn Green", "response": ["Green returned to the D'Oyly Carte Opera Company in 1946 as principal comedian for another five years. During this time, he recorded most of the Gilbert and Sullivan patter roles in the earliest D'Oyly Carte LP recordings. For a generation of Gilbert & Sullivan fans, his performances in those recordings were considered definitive. Billboard wrote, during the company's 1948 US tour, that his performance of Jack Point \"is another triumph. ...  a G. and S. portrait to be cherished.\"Francis, Bob. \"Broadway Openings: Yeoman (sic) of the Guard, Billboard, vol. 60, no. 7, 14 February 1948, p. 44, accessed 20 December 2010 In this second stint with the company, Green became impatient with artistic and commercial decisions of the company, including the postponement of some recordings, which led to friction with the management. In 1949, soon after Bridget D'Oyly Carte inherited the company, she appointed Eleanor Evans (known in the company as \"Snookie\") as Stage Director and Director of Productions to replace Anna Bethell (Mrs. Sydney Granville).Joseph, p. 272 The choice of the temperamental Snookie, a former chorister with the company and wife of the company's longtime principal bass Darrell Fancourt, was a highly unpopular one and contributed to a wave of defections from the company, including Green's departure in 1951. He wrote:"]}, {"page": "D'Oyly Carte Opera Company", "response": ["From 1909 to 1934, the principal comedian was Henry Lytton, who had been playing a variety of roles with the company steadily since 1887. He received a knighthood for his performances during his long tenure with the company.Wilson and Lloyd, p. 125 Lytton's voice deteriorated during his later career, and when HMV embarked on a series of complete recordings of the operas after World War I, he was not invited to record most of his roles. Instead, the concert singer George Baker was brought in to substitute. Other performers from this period include the mezzo-soprano Nellie Briercliffe, bass-baritone Darrell Fancourt, who is estimated to have portrayed the Mikado of Japan more than 3,000 times, contralto Bertha Lewis, tenor Derek Oldham, soprano Elsie Griffin and baritones Leo Sheffield and Sydney Granville.Wilson and Lloyd, pp. 90–112"]}, {"page": "Isidore Godfrey", "response": ["Godfrey conducted most of the company's performances during his four decades as musical director, except for a few London seasons, when Malcolm Sargent was guest conductor, and brief periods in the summers of 1947 and 1948, when Boyd Neel was guest conductor. Godfrey's assistant musical directors included Alan E. Ward (1930–49), William Cox-Ife (1951–61) and James Walker (1961–68).Rollins and Witts, Appendix pp. II-VI During Godfrey's long reign as musical director, he conducted artists who had worked under the direction of W. S. Gilbert, such as Henry Lytton, Leo Sheffield and Sydney Granville, and those who were performing at the last night of the D'Oyly Carte Opera Company in 1982, such as John Reed and Kenneth Sandford.Rollins and Witts, pp. 152–53Wilson and Lloyd, p. 213 In his early years in charge, Godfrey, with Rupert D'Oyly Carte's backing, gradually cut down the number of encores routinely given at the company's performances.Joseph, p. 222 The stars and the audiences both resisted, but Godfrey eventually made progress, particularly after the outbreak of World War II, when it was important to keep running times down to a reasonable length.Joseph, p. 258"]}, {"page": "Henry Lytton", "response": ["Lytton wrote that greatly as he enjoyed, and profited from, his musical comedy roles, he found them shallow and superficial compared with the Savoy Operas, to which he was glad to return in 1907.Lytton (1922), p. 84 He appeared at the Savoy in Helen Carte's first London repertory season of Gilbert and Sullivan in June of that year, playing Strephon.Rollins and Witts, p. 21 When she presented a second London repertory season, from April 1908 to March 1909, he played in all five operas staged, as the Mikado; Dick Deadeye in H.M.S. Pinafore; Strephon; the Pirate King in The Pirates of Penzance; and Giuseppe in The Gondoliers.Rollins and Witts, p. 22 The patter roles were played by C.H.Workman, seconded from the year-round touring company. At the end of the season Workman left to pursue a career as an actor-manager; Lytton took over the patter roles in the touring company, in which his fellow principals included Fred Billington, Clara Dow, Sydney Granville, Louie René and Leicester Tunks.Rollins and Witts, p. 126"]}, {"page": "Richard Walker (baritone)", "response": ["During the 1930s and early 1940s, Walker played a variety of parts, both in his own right and as an occasional substitute. His own roles from 1932 were the Usher in Trial by Jury, Bobstay in H.M.S. Pinafore, Samuel in The Pirates of Penzance, Guron, and Antonio, which he performed in a BBC broadcast from the Savoy Theatre during the company's 1932–33 London season.\"Programmes: 'The Gondoliers'\", The Times, 9 December 1932, p. 19 From 1935 he shared the role of Bouncer in Cox and Box with Darrell Fancourt. In 1937 he added the role of the Notary in The Sorcerer. In 1940 he switched from Bouncer to Cox in Cox and Box, and from Usher to Counsel for the Plaintiff in Trial by Jury.  He also took on the small roles of Major Murgatroyd in Patience and Second Citizen, and the next year, Second Yeomen in The Yeomen of the Guard.  Roles in which he occasionally deputised for Fancourt or Sydney Granville were King Hildebrand in Princess Ida, the Pirate King in The Pirates of Penzance, Earl Mountararat and Private Willis in Iolanthe, Colonel Calverley in Patience, Sir Roderic Murgatroyd in Ruddigore, the title role and Pooh-Bah in The Mikado, Wilfred Shadbolt in The Yeomen of the Guard, and Don Alhambra in The Gondoliers.Rollins and Witts, pp. 156–66"]}, {"page": "L. Radley Flynn", "response": ["Radley Flynn was born in Rochdale, Lancashire. He joined the D'Oyly Carte Opera Company in 1928 and was initially assigned the small role of Giorgio in The Gondoliers.\"Radley Flynn and Ella Halman\", Memories of the D'Oyly Carte Opera Company, accessed 11 February 2014 The following year, he added the roles of Go-To in The Mikado, the Carpenter's Mate in H.M.S. Pinafore, and Scynthius in Princess Ida. In 1931,  Flynn added the role of Old Adam Goodheart in Ruddigore and had the opportunity to substitute for Sydney Granville as Private Willis in Iolanthe.Stone, David. \"Radley Flynn\", Who Was Who in the D'Oyly Carte, 24 August 2007, accessed 11 February 2014"]}, {"page": "J. C. Williamson", "response": ["In 1925 Sydney Granville, with a number of other D'Oyly Carte principals, sailed to Australia to join the J. C. Williamson Gilbert & Sullivan Opera Company for its 1926–28 tour of Australia and New Zealand, playing the \"heavy\" baritone G&S roles that he later played when he rejoined D'Oyly Carte in Britain.  The G&S operas played in Australasia during that tour were mostly re-costumed in accordance with the D'Oyly Carte designs supplied by Rupert D'Oyly Carte."]}, {"page": "A Welsh Sunset", "response": ["*John Lloyd – Sydney Granville"]}, {"page": "Geoffrey Toye", "response": ["Toye obtained the film rights to the Gilbert and Sullivan operas. In 1938, he adapted, produced and conducted The Mikado, starring Martyn Green, Sydney Granville and the American singers Kenny Baker and Jean Colin,Shepherd, Marc. The Mikado, 1938 film,  A Gilbert and Sullivan Discography but the onset of war prevented further screen adaptations. Toye composed and arranged the music for two other British films of the 1930s: Men Are Not Gods and Rembrandt, both for Alexander Korda in 1936.IMDB"]}, {"page": "Cultural influence of Gilbert and Sullivan", "response": ["Film adaptations of the operas have included a 1926 D'Oyly Carte Opera Company short promotional film of The Mikado that featured some of the most famous Savoyards, including Darrell Fancourt, Henry Lytton, Leo Sheffield, Elsie Griffin, and Bertha Lewis.Shepherd, Marc. 1926 Mikado  at A Gilbert and Sullivan Discography In 1939, Universal Pictures released a ninety-minute technicolor film adaptation of The Mikado. The film stars Martyn Green as Ko-Ko and Sydney Granville as Pooh-Bah.  The music was conducted by Geoffrey Toye, who was credited with the adaptation.  William V. Skall received an Academy Award nomination for Best Cinematography.  Similarly, in 1966, the D'Oyly Carte produced a film version of The Mikado, which showed much of their traditional staging at the time, although there are some minor cuts.  It stars John Reed (Ko-Ko), Kenneth Sandford (Pooh-Bah), Valerie Masterson (Yum-Yum), Donald Adams (the Mikado), Peggy Ann Jones (Pitti-Sing), and Philip Potter (Nanki-Poo).Sullivan, Dan. \"The Mikado (1967)\". The New York Times, 15 March 1967, accessed 22 March 2010"]}, {"page": "The Red Pen", "response": ["The performers for the second broadcast were Gladys Palmer, Vivienne Chatterton, John Buckley, Harold Kimberley, John Tanner, and Sydney Granville. The composer conducted the Wireless Orchestra."]}, {"page": "List of British films of 1939", "response": ["|The Mikado|| Victor Schertzinger || Kenny Baker, Martyn Green, Sydney Granville || Musical comedy || "]}, {"page": "Trial by Jury", "response": ["|Learned Judge||Charles H. Workman||Leo Sheffield||Leo Sheffield||Sydney Granville"]}, {"page": "Eleanor Evans", "response": ["Soon after Bridget D'Oyly Carte inherited the company, in 1949, she appointed Evans as Stage Director and Director of Productions to replace Anna Bethell (Mrs. Sydney Granville). The choice of the temperamental Snookie, the wife of a leading principal with the company, was a highly unpopular one and contributed to a wave of defections from the company culminating in 1951.  One of the most important stars to leave the company was principal comedian Martyn Green.  He wrote in his 1952 memoir: ", "I had heard there was some possibility of [the selection of Evans] happening and ... told Miss Carte that I thought she was making a great psychological error. During Anna Bethell's regime (Mrs. Sydney Granville), there had been growing signs of discontent and suggestions of favouritism being shown to some of the members of the chorus in respect to passing over existing understudies, selections for small parts, and so on....  But to appoint not only a woman who had for fifteen years worked in the chorus alongside several who were now principals, but the wife of one of the main principals, seemed to me to be a psychological error of the first magnitude.  I felt that ... she would, rightly or wrongly, be accused of that very same favouritism.  My views made no impression on Miss Carte, but time was to prove that I was right.  Discontent grew, changes were constantly taking place, and criticism became rampant.  Nor did it stop at the methods of production; it went so far as to suggest a complete lack of knowledge, evidenced ... by constant self-contradiction.  There were other accusations levelled against her, of a more serious nature....  [Those] in control ...  apparently assumed in the first place that the performers are little more than automatons and are completely devoid of brains or the ability to think for themselves.  Production is done to a plan that takes no consideration of the individual, his personality or his histrionic ability – a stereotyped plan that results in a clockwork performance devoid of spontaneity.Green, pp. 236–37"]}, {"page": "Anna Bethell", "response": ["Bethell was married to fellow D'Oyly Carte member Sydney Granville.", "She left the company in 1912 but returned the next year, touring in the same roles and also as Peep-Bo in The Mikado. From 1915, Bethell sang in the chorus, again playing Saphir from 1917. In 1918, she began to understudy the principal contralto roles, then played by Bertha Lewis, and began to play Mrs. Partlett in The Sorcerer and Inez in The Gondoliers. Between 1918 and 1924, she also toured, from time to time, in two plays by Stanley Houghton, Hindle Wakes (as Fanny Hawthorn) and The Younger Generation.The Manchester Guardian, 23 October 1918, p. 1; 7 May 1921, p. 1; and 24 July 1924, p. 1Oldham, Derek. \"Sydney Granville\", Memories of the D'Oyly Carte Opera Company website; accessed 8 November 2016 In 1921, she resumed the small part of Chloe, with D'Oyly Carte, and the next year also began again to play Kate.  In 1923, she sometimes played the role of Cousin Hebe in H.M.S. Pinafore, Melissa in Princess Ida, Pitti-Sing in The Mikado, and Tessa in The Gondoliers. After this, until 1925, she played the parts of Mrs. Partlett, Chloe and Inez.Stone, David. \"Anna Bethall\" (sic), Who Was Who in the D'Oyly Carte Opera Company, 2 December 2002; accessed 30 November 2009.", "At the end of 1925, Bethel and her husband, Sydney Granville, and other company members left the D'Oyly Carte to travel to Australia, performing in Gilbert and Sullivan roles with the J. C. Williamson Ltd. company. In 1929, she rejoined D'Oyly Carte as Mrs Partlett, playing the role until 1939. In 1931, she occasionally played Little Buttercup in Pinafore and Dame Hannah in Ruddigore. Bethell is heard as Mrs Partlett on the D'Oyly Carte's 1933 recording of excerpts from The Sorcerer.Shepherd, Marc. \"The 1933 HMV Sorcerer (abridged)\", A Gilbert and Sullivan Discography, 24 August 2008; accessed 30 November 2009.", "Bethell was engaged by the D'Oyly Carte Opera Company as Stage Director from 1947 to 1948.  In his 1952 memoir, the former principal comedian of the company, Martyn Green, wrote: \"During Anna Bethell's regime ... there had been growing signs of discontent and suggestions of favouritism being shown to some of the members of the chorus in respect to passing over existing understudies, selections for small parts, and so on.\"Green, p. 236  In 1949, she travelled to Australia to direct J. C. Williamson Ltd. productions of Gilbert and Sullivan.  That company then toured these productions throughout Australasia for the next three years.Morrison, Robert.  \"Sydney Granville's 1926 Australasian Tour\", A Gilbert and Sullivan Discography, ed. Marc Shepherd, 12 November 2001, accessed 30 November 2009"]}, {"page": "Frederick Hobbs (singer)", "response": ["Hobbs joined the D'Oyly Carte Opera Company in 1914, taking over many of the roles played by the departing Sydney Granville, including Colonel Calverley in Patience, Lord Mountararat in Iolanthe, Arac in Princess Ida, Pish-Tush in The Mikado, Richard Cholmondeley in The Yeomen of the Guard and Luiz in The Gondoliers.  He soon added to his repertory the parts of Counsel to the Plaintiff in Trial by Jury, the Boatswain in H.M.S. Pinafore, and Samuel in The Pirates of Penzance.  In 1916, he was given the role of Sir Marmaduke Pointdextre in the company's new production of The Sorcerer, giving up Luiz.  Later that year, he swapped some of his smaller roles for larger ones: the Boatswain for Dick Deadeye in Pinafore, Samuel for the Pirate King in Pirates and Cholmondeley for Sergeant Meryll in Yeomen. He also continued to play Colonel Calverley, Mountararat, Arac and Pish-Tush, while adding Giuseppe in The Gondoliers and relinquishing the Counsel.Taylor, Roy. \"Frederick Hobbs\", Memories of the D'Oyly Carte Opera Company, accessed 11 January 2009 His last new role, in 1918, was the title role in The Mikado.  When D'Oyly Carte returned to the West End in London for its 1919-20 season, after 10 years on tour, Hobbs played Sir Marmaduke, Dick Deadeye, the Pirate King, the Colonel, Mountararat, Arac, The Mikado, Sergeant Meryll and Giuseppe.Ayre, p. 160  The Times called his Pirate King \"terrific\".\"Two Gilbert-Sullivan Revivals. Brilliant Singing at Princes Theatre\", The Times, 7 January 1920, p. 10"]}, {"page": "Malcolm Sargent discography", "response": ["*** (abridged): George Baker, Webster Booth, Sydney Granville, Derek Oldham, Leslie Rands, Leonard Hubbard, Stuart Robertson, Essie Ackland, Nellie Walker, Alice Moxon, Muriel Dickson, Beatrice Elburn, Phyllis Evens, chorus and orchestra, HMV, 1931 ", "*** Henry Lytton, George Baker, Charles Goulding, Darrell Fancourt, Sydney Granville, Stuart Robertson, Elsie Griffin, Bertha Lewis, Nellie Briercliffe, chorus and orchestra, HMV, 1930", "*** George Baker, Darrell Fancourt, Derek Oldham, Sydney Granville, Leslie Rands, Bertha Lewis, Nellie Briercliffe, Alice Moxon, Nellie Walker, Winifred Lawson, Chorus and Light Opera Orchestra, chorus and orchestra, HMV, 1930", "*** (abridged): George Baker, Darrell Fancourt, Stuart Robertson, Derek Oldham, Sydney Granville, Muriel Dickson, Bertha Lewis, chorus and orchestra, HMV, 1931", "*** George Baker, Derek Oldham, Sydney Granville, Stuart Robertson, Muriel Dickson, Nellie Briercliffe, Dorothy Gill, Alice Moxon, Darrell Fancourt, chorus and orchestra, HMV, 1931", "*** (abridged) George Baker, Sydney Granville, Derek Oldham, Muriel Dickson, Beatrice Elburn, Nellie Walker, chorus and orchestra, HMV, 1931"]}, {"page": "Richard Watson (singer)", "response": ["In August 1932, Watson joined the D'Oyly Carte Opera Company, remaining with the company for two years. His roles were Private Willis in Iolanthe and King Hildebrand in Princess Ida, which he took over from the company's veteran bass-baritone Sydney Granville, and the Lieutenant of the Tower in The Yeomen of the Guard, previously played by Leslie Rands.Rollins and Witts, p. 157 In December 1932, when The Sorcerer was revived, he was also given the small role of the Notary; in June 1933 he took over the role of Old Adam in Ruddigore. During his two seasons, he also deputised occasionally for Darrell Fancourt as the Pirate King in The Pirates of Penzance and for Granville as Don Alhambra, the Grand Inquisitor, in The Gondoliers.Rollins and Witts, p. 158"]}, {"page": "The Mikado (1939 film)", "response": ["The Mikado is a 1939 British musical comedy film based on Gilbert and Sullivan's 1885 comic opera The Mikado. Shot in Technicolor, the film stars Martyn Green as Ko-Ko, Sydney Granville as Pooh-Bah, the American singer Kenny Baker as Nanki-Poo and Jean Colin as Yum-Yum. Many of the other leads and choristers were or had been members of the D'Oyly Carte Opera Company.Lejeune, C. A. \"Films of the Week: Gentlemen of Japan\", The Observer, 3 July 1938, p. 14. Barclay had played the title role in America, Stroud had been a D'Oyly Carte performer in Britain in 1926 and had extensive Gilbert and Sullivan experience in Australia, and Paynter had performed Pitti-Sing and other mezzo-soprano roles for five years with D'Oyly Carte under the name Elisabeth Nickel-Lean. Nearly all the chorus were current or former performers with D'Oyly Carte.", "* Sydney Granville as Pooh-Bah"]}, {"page": "1939 in British music", "response": ["*The Mikado, starring Martyn Green as Ko-Ko, Sydney Granville as Pooh-Bah, Kenny Baker as Nanki-Poo, and Jean Colin as Yum-Yum."]}, {"page": "Granville (name)", "response": ["*Sydney Granville (1880–1959), British singer and actor"]}]}}