{"wiki_id": "http://www.wikidata.org/entity/Q7650897", "itemLabel": "Suzanne Lappin", "itemDescription": "Scottish footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Suzanne_Lappin", "wikipedia_page": {"main": "Suzanne Lappin (born 13 October 1986) is a Scottish former international football midfielder who last played for Glasgow City in the Scottish Women's Premier League (SWPL) before retiring in 2015. She began her senior career with Glasgow City in 2003 before spending two seasons in the English FA WSL with Liverpool Ladies in 2011 and Chelsea Ladies in 2012; her time at Liverpool also included a loan spell at Celtic. Lappin re-signed with Glasgow City in 2012.Lappin has 11 caps and 3 goals for the Scotland women's national football team. At youth level, she captained the Scotland side that qualified for the UEFA Women's Under-19 Championship for the first time.", "link_mentions": [{"page": "Glasgow City F.C.", "response": ["During the 2014 season, Glasgow City suffered a first league defeat in over six years,SWPL: Glasgow City lose six-year unbeaten record against Spartans BBC Sport. 21-09-2014. Retrieved 01-11-2014. but still secured an eighth successive SWPL titleGlasgow City secure their eighth successive SWPL title BBC Sport. 02-10-2014. Retrieved 02-11-2014. and third successive treble.City win the Scottish Cup to complete a historic treble Glasgow City FC. 16-11-14. Retrieved 17-11-2014. After a superb 5–4 aggregate win against FC Zurich, City became the first Scottish team to reach the UEFA Women's Champions League quarter-finals in November 2014.Women's Champions League: Glasgow City 4-2 Zurich (5-4) BBC Sport. 12-11-2014. Retrieved 12-11-2014. After a 2–1 first leg defeat at FC Zurich,Women's Champions League: FC Zurich 2-1 Glasgow City BBC Sport 09-11-2014. Retrieved 12-11-2014. City were 1–0 down at half time, with their keeper substituted due a suspected broken collar bone, in the second leg. Despite City replying with two early second half goals, Zurich made it 2–2. An 81st minute Jo Love strike leveled the tie, but with City heading out of the competition on away goals, Suzanne Lappin powered home a header a few minutes from time to send them through. In the quarter-finals, Paris Saint-Germain proved too strong for City, with a 7–0 aggregate victory.", "* 2013 - Suzanne Lappin", "*2010 - Suzanne Lappin", "*2004 - Suzanne Lappin"]}, {"page": "Ruesha Littlejohn", "response": ["Along with Megan Sneddon and Suzanne Lappin, Littlejohn signed for Liverpool Ladies ahead of the 2011 FA WSL season. The Scottish trio made their Liverpool bow in a friendly win over Hibernian Ladies. On her competitive debut against Charlton Athletic in the FA Women's Cup, Littlejohn marked the occasion by scoring a hat-trick. She also fired a last-minute goal as Liverpool held rivals Everton 3–3 in the opening match of the WSL campaign. During the mid-season break Littlejohn and Lappin went back to Scotland, this time with Celtic, making their debuts against Rangers."]}, {"page": "2012 Scottish Women's Cup", "response": ["|MF|| 3|| Suzanne Lappin || "]}, {"page": "2012 Chelsea L.F.C. season", "response": ["|align=\"left\"|9||align=\"left\"|MF||align=\"left\"| Suzanne Lappin"]}, {"page": "2015 FIFA Women's World Cup qualification – UEFA Group 4", "response": ["* Suzanne Lappin"]}, {"page": "Scotland women's national football team results (2010–2019)", "response": ["|Suzanne Lappin, Leanne Ross", "|Rachel Corsie, Lisa Evans, Leanne Ross (2), Jane Ross, Suzanne Lappin, Suzanne Mulvey", "|Lisa Evans, Leanne Ross, Kim Little, Rachel Corsie, Jane Ross, Jen Beattie, Suzanne Lappin"]}]}}