{"wiki_id": "http://www.wikidata.org/entity/Q7650986", "itemLabel": "Suzanne Virdee", "itemDescription": "British television journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Suzanne_Virdee", "wikipedia_page": {"main": "Suzanne Nicole Virdee (born 16 October 1969 in Solihull, Warwickshire, now the West Midlands) is a British journalist and television presenter, working on a freelance basis with UK news organisation ITN.", "link_mentions": [{"page": "1971 in television", "response": ["| Suzanne Virdee"]}, {"page": "BBC Birmingham", "response": ["*Suzanne Virdee"]}, {"page": "Midlands Today", "response": ["Former presenters have included Tom Coyne, Kay Alexander (the programme's longest serving presenter), Alan Towers, Alastair Yates, David Davies, Sue Beardsmore, Stuart Linnell, Matt Smith, Julian Worricker, Ashley Blake (who was sacked in August 2009 after a criminal court case), Suzanne Virdee and Jackie Kabler."]}, {"page": "Feckenham", "response": ["* Suzanne Virdee (b. 1969), is a News reader for BBC Midlands Today."]}, {"page": "BBC Breakfast", "response": ["* Suzanne Virdee (relief newsreader 2004–2006)"]}, {"page": "ITV News London", "response": ["*Suzanne Virdee: Relief newsreader (2016–)"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Suzanne Virdee – main presenter on Midlands Today from 2001 to 2012 and an occasional relief presenter on BBC Breakfast. She had previously worked for Central News."]}, {"page": "1971 in the United Kingdom", "response": ["**Suzanne Virdee, BBC newsreader"]}, {"page": "Category talk:British journalists", "response": ["Suzanne Virdeenot yet classified"]}, {"page": "Mary Rhodes", "response": ["In 2011, she took over as presenter of BBC West Midlands show Inside Out after the programme went through several guest presenters following the sacking of previous presenter Ashley Blake. Rhodes also became a reporter on Midlands Today alongside her Inside Out duties and, in 2012, she became the main presenter of Midlands Today when Suzanne Virdee left the programme. She shares main presented duties with Nick Owen."]}, {"page": "BBC News Summary", "response": ["In May 2007 Natasha Kaplinsky and Suzanne Virdee presented a new peaktime summary during its initial pilot in the Midlands. The intention was originally to target the young, professional and working markets. It was broadcast on weeknights at 8:00pm on BBC One."]}, {"page": "1971 in British television", "response": ["* 1 January – Suzanne Virdee, British regional newscaster (Midlands Today)"]}, {"page": "1969 in British television", "response": ["* 16 October – Suzanne Virdee, British Newsreader-Midlands Today BBC ONE"]}, {"page": "List of ITV News on air staff", "response": ["*Suzanne Virdee"]}]}}