{"wiki_id": "http://www.wikidata.org/entity/Q7659923", "itemLabel": "Sydney Fairbrother", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Fairbrother", "wikipedia_page": {"main": "Sydney Fairbrother (31 July 1873 – 4 January 1941) was a British actress.Born Sydney Tapping on 31 July 1873 in London to actor and playwright Alfred B. Tapping and the actress Florence Cowell, she was educated at Blackpool and Bonn. She made her stage debut in Birmingham, UK in 1890 with the famous Kendall Company and a few years later toured America with them. She came to the screen in 1915 in a film called Iron Justice and chiefly appeared in comedy roles. She retired in 1938 and died on 4 January 1941 in London.", "link_mentions": [{"page": "1942", "response": ["** Sydney Fairbrother, British actress (b. 1872)"]}, {"page": "The Ghost Train (play)", "response": ["Changes to the cast during the run included Sydney Fairbrother (from June 1926) as Miss Bourne,\"The Theatres\", The Times, 3 June 1926, p. 14 succeeded in the role by Connie Ediss in November 1926.\"The Theatres\", The Times, 28 October 1926, p. 10"]}, {"page": "List of female movie actors by name: E–F", "response": ["*Sydney Fairbrother (1872–1941)"]}, {"page": "Chu Chin Chow", "response": ["|Sydney Fairbrother"]}, {"page": "Love, Life and Laughter (1923 film)", "response": ["*Sydney Fairbrother"]}, {"page": "King Solomon's Mines (1937 film)", "response": ["Kathy steals Quartermain's wagon to go after her father. When they catch up with her, she refuses to go back with them, so they and Umbopa accompany her across the desert and over the mountains, as shown on the map. During the arduous trek, Curtis and Kathy fall in love. On the other side of the mountains, they are surrounded by unfriendly natives and taken to the kraal of their chief, Twala (Robert Adams), to be questioned. Twala takes them to see the entrance of the mines, guarded by the feared witch doctor Gagool (an uncredited Sydney Fairbrother).", "* Sydney Fairbrother as Gagool (uncredited)"]}, {"page": "List of British films before 1920", "response": ["| Iron Justice || Sidney Morgan || Sydney Fairbrother, Julian Royce, Alfred Drayton || Crime ||"]}, {"page": "Harold Chapin", "response": ["In December 1915 Alice Chapin, Calypso Valetta, Gerald du Maurier and Sydney Fairbrother appeared in a London memorial performance of four of his plays: The Philosopher of Butterbiggins, Innocent and Annabel, The Dumb and the Blind and It's the Poor that 'Elps the Poor. The performance raised funds for a YMCA hut to accommodate soldiers at the front in France."]}, {"page": "List of British films of 1934", "response": ["|The Crucifix || G. B. Samuelson || Nancy Price, Sydney Fairbrother || Drama ||"]}, {"page": "List of British films of 1932", "response": ["|Lucky Ladies||John Rawlins||Sydney Fairbrother, Emily Fitzroy||Comedy||", "|The Temperance Fête||Graham Cutts||George Robey, Sydney Fairbrother||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|The Other Mrs. Phipps||Julius Hagen||Sydney Fairbrother, Richard Cooper, Jane Welsh||Comedy short||"]}, {"page": "Double Dealing (1932 film)", "response": ["Double Dealing is a 1932 British comedy film directed by Leslie S. Hiscott and starring Richard Cooper, Frank Pettingell and Sydney Fairbrother. It was made as a quota quickie at Twickenham Studios.Wood p.74", "* Sydney Fairbrother as Sarah Moon"]}, {"page": "Raising the Wind (1925 film)", "response": ["Raising the Wind is a 1925 British silent-era short comedy film directed by Leslie S. Hiscott and featuring Sydney Fairbrother and Irene Tripod."]}, {"page": "Billets (film)", "response": ["Billets is a 1925 silent-era British comedy film directed by Leslie S. Hiscott and featuring Sydney Fairbrother and Irene Tripod.https://www.imdb.com/title/tt0200487/http://www.bfi.org.uk/films-tv-people/529532d70faad", "*Sydney Fairbrother as Mrs. May"]}, {"page": "A Fowl Proceeding", "response": ["A Fowl Proceeding is a 1925 silent-era British short comedy film directed by Leslie S. Hiscott and featuring Sydney Fairbrother and Irene Tripod.http://www.bfi.org.uk/films-tv-people/5295364b4da2b", "*Sydney Fairbrother as Mrs. May"]}, {"page": "A Friend of Cupid", "response": ["A Friend of Cupid is a 1925 silent-era British comedy film directed by Leslie S. Hiscott and featuring Sydney Fairbrother and Irene Tripod.http://www.bfi.org.uk/films-tv-people/5295364ff2e7d", "*Sydney Fairbrother as Mrs. May"]}, {"page": "Cats (1925 film)", "response": ["Cats is a 1925 silent-era British comedy film directed by Leslie S. Hiscott and featuring Sydney Fairbrother, Frank Stanmore and Irene Tripod.http://www.bfi.org.uk/films-tv-people/529533da80fdc", "*Sydney Fairbrother as Mrs. May"]}, {"page": "The Return of Raffles", "response": ["* Sydney Fairbrother - Lady Truwode"]}, {"page": "Murder on the Second Floor", "response": ["Murder on the Second Floor is a 1932 British thriller film directed by William C. McGann and starring Pat Paterson, John Longden and Sydney Fairbrother. The screenplay concerns a novelist who imagines the murders of his fellow boarding-house tenants. It was based on a play of the same name by Frank Vosper. Warner Brothers later remade it in Hollywood as Shadows on the Stairs (1941).", "*Sydney Fairbrother as Miss Snell"]}, {"page": "Excess Baggage (1933 film)", "response": ["Excess Baggage is a 1933 British comedy film directed by Redd Davis and starring Claud Allister, Frank Pettingell, Sydney Fairbrother, Rene Ray, Gerald Rawlinson and Viola Compton.https://www.imdb.com/title/tt0023994/ Its plot concerns a British army Colonel mistakenly who thinks he has killed his superior officer while hunting down a ghost. It was made at Twickenham Studios in west London.", "* Sydney Fairbrother - Miss Toop"]}, {"page": "Richard Goolden", "response": ["Nigel Playfair had seen Goolden's performances at Stratford, on the strength of which he invited him to appear with his company at the Lyric, Hammersmith. He was in the Lyric's revue, Riverside Nights (1926) and played the professor of philosophy in Molière's The Would-Be Gentleman (1926) in a cast headed by Playfair and including Sydney Fairbrother, Miles Malleson and James Whale.\"The Lyric Theatre, Hammersmith\", The Times, 16 November 1926, p. 12"]}, {"page": "The Private Secretary (1935 film)", "response": ["* Sydney Fairbrother as Miss Ashford"]}, {"page": "The Silver Lining (1927 film)", "response": ["* Sydney Fairbrother - Mrs. Akers "]}, {"page": "Reveille (film)", "response": ["* Sydney Fairbrother as Sophie Fitch"]}, {"page": "All In (film)", "response": ["* Sydney Fairbrother as Genesta Slott "]}, {"page": "Louise Hampton", "response": ["Hampton was born in Stockport, Cheshire, the daughter of the actor Henry Hampton and his wife, Margaret, née Douglas. She made her stage debut at the age of four at the Queen's Theatre, Manchester as Henri, the child in Belphegor.Parker, Gaye and Herbert, pp. 1071–1072 In 1899 she married the actor Edward Thane (1873–1954). In 1911 she toured Australia under the management of George Marlow, in a repertory of melodramas. In November 1912, she played Wanda in The People's King, and in 1913 she toured in Egypt, playing leading parts in a repertory company. In 1914–15 she toured Britain in The Blindness of Virtue, The Second Mrs. Tanqueray (in the title role) and Outcast. Her first London appearance was at the Court Theatre in February 1917, where she appeared as Mrs Benson in Ruts, in a cast that included Hilda Trevelyan, Sydney Fairbrother, Lydia Bilbrooke and Nina Boucicault.\"Four New Plays\", The Times, 1 February 1917, p. 9 "]}, {"page": "The Beloved Vagabond (1923 film)", "response": ["* Sydney Fairbrother as Mrs. Smith "]}, {"page": "Down Our Street", "response": ["*Sydney Fairbrother as Maggie Anning"]}, {"page": "The Crucifix", "response": ["*Sydney Fairbrother as Lavinia Brooker"]}, {"page": "Dreaming Lips (1937 film)", "response": ["* Sydney Fairbrother as Mrs. Stanway  "]}, {"page": "Chu Chin Chow (1934 film)", "response": ["* Sydney Fairbrother - Mahbubah Baba"]}, {"page": "Nell Gwyn (1926 film)", "response": ["* Sydney Fairbrother – Mrs. Gwyn "]}, {"page": "Confetti (1927 film)", "response": ["Confetti is a 1927 British silent drama film directed by Graham Cutts and starring Jack Buchanan, Annette Benson and Sydney Fairbrother.BFI Database entry It had its trade show in December 1927.Low p.187 The film was shot at Gainsborough Pictures' Islington studios.", "* Sydney Fairbrother as Duchess Maxine"]}, {"page": "Paradise for Two", "response": ["* Sydney Fairbrother as Miss Clare"]}, {"page": "Make It Three", "response": ["* Sydney Fairbrother as Aunt Aggie"]}, {"page": "Lucky Ladies", "response": ["Lucky Ladies is a 1932 British comedy film directed by John Rawlins and starring Sydney Fairbrother, Emily Fitzroy and Tracy Holmes.BFI.org", "* Sydney Fairbrother - Angle Tuckett"]}, {"page": "Insult (film)", "response": ["* Sydney Fairbrother as Arabella "]}, {"page": "Sally Bishop (1924 film)", "response": ["* Sydney Fairbrother - Landlady "]}, {"page": "Me and Me Moke", "response": ["* Sydney Fairbrother as Mammy"]}, {"page": "Rose of Tralee (1937 film)", "response": ["* Sydney Fairbrother - Mrs. Thompson "]}, {"page": "The Rotters", "response": ["The Rotters is a 1921 British silent comedy film directed by A. V. Bramble and starring Joe Nightingale, Sydney Fairbrother and Sidney Paxton. It was based on a play by H. F. Maltby.", "* Sydney Fairbrother - Jemima Nivet "]}, {"page": "The Bachelor's Club", "response": ["* Sydney Fairbrother - Tabitha"]}, {"page": "The Gay Gordons (musical)", "response": ["*Charlotte Siddons – Sydney Fairbrother "]}, {"page": "Love and Hate (1924 film)", "response": ["*Sydney Fairbrother"]}, {"page": "Wanted, a Boy", "response": ["Wanted, a Boy is a 1924 British silent comedy film directed by Thomas Bentley and starring Sydney Fairbrother, Lionelle Howard and Pauline Johnson. It was made by British & Colonial Kinematograph Company at the company's Walthamstow Studios.", "* Sydney Fairbrother as The Aunt"]}, {"page": "The Golden Dawn (film)", "response": ["* Sydney Fairbrother as Mrs. Briggs "]}]}}