{"wiki_id": "http://www.wikidata.org/entity/Q765266", "itemLabel": "Willie Edouin", "itemDescription": "British comedian, actor and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Edouin", "wikipedia_page": {"main": "Willie Edouin (1 January 1846 – 14 April 1908) was an English comedian, actor, dancer, singer, writer, director and theatre manager.\nAfter performing as a child in England, Australia and elsewhere, Edouin moved to America, where he joined Lydia Thompson's burlesque troupe, performing with this company both in the US and Britain.  He returned to America in 1877, where, by 1880, he managed his own company.  For over a decade, starting in 1884, Edouin managed theatres in London, particularly the Strand Theatre, producing and starring in comedies, farces and burlesques.  From the 1890s, he appeared as the comic lead in several hit Edwardian musical comedies, including Florodora.\n\n", "link_mentions": [{"page": "Kensal Green Cemetery", "response": ["*Willie Edouin (1841–1908), comedian, actor and theatre manager"]}, {"page": "Florodora", "response": ["Upon opening in London on 11 November 1899 at the Lyric Theatre, the show starred Evie Greene, Willie Edouin and Ada Reeve. Its original run of 455 performances was unusually long for the time, and it closed in March 1901. The show would prove a training ground for numerous rising stars of the British theatre. After opening at the Casino Theatre on Broadway on 10 November 1900, it moved to the New York Theatre on 14 October 1901 and finally closed on 25 January 1902, a run of 552 performances – the first instance of a London production achieving such a Broadway run, and the third-longest run on Broadway of any theatre piece up to that time. The show was subsequently mounted in Australia in 1900 by J. C. Williamson, where it enjoyed another long run.Pendennis. Observer, The Lorgnette, Volume XX, Issue 1106, 10 March 1900, p. 16", "*Anthony Tweedlepunch – Willie Edouin (Detective disguised as a phrenologist, hypnotist & palmist)"]}, {"page": "May Whitty", "response": ["|1891-04-15||Our Daughters ||T.G. Warren & Willie Edouin||London||Royal Strand||Nellie Mayhew"]}, {"page": "Edmund Gwenn", "response": ["Gwenn was born in Wandsworth, London to John and Catherine (Oliver) Kellaway. His brother was the actor Arthur Chesney and his cousin, Cecil Kellaway. Gwenn was educated at St. Olave's School and later at King's College London.\"Mr Edmund Gwenn – Versatile Character Actor\", The Times, 8 September 1959, p. 13 He began his acting career in the theatre in 1895, and learnt his craft as a member of Willie Edouin's company, playing brash comic roles. In 1901 he married Minnie Terry, niece of the famous actress Ellen Terry. In the same year, he went to Australia and acted there for three years with the J. C. Williamson company. His wife accompanied him and when Gwenn was in a production of Ben Hur that was a disastrous failure, she restored the couple's fortunes by accepting an engagement from Williamson.\"Miss Minnie Terry\", Table Talk, 9 October 1902, p. 10 Later, the couple appeared on stage together in London in a farce called What the Butler Saw in 1905\"Wyndham's Theatre\", The Times, 3 August 1905, p. 8 and, in 1911, when Irene Vanbrugh made her debut in variety, she chose Terry and Gwenn to join her in a short play specially written by J. M. Barrie.\"The Theatres\",  The Times, 30 October 1911, p. 11"]}, {"page": "Widow Twankey", "response": ["*Willie Edouin 1888 Royal Strand Theatre"]}, {"page": "Edmond Audran", "response": ["Audran's music met with as much favour in England as in France, and all but a few of his works were given in English adaptations in London theatres. The most successful of Audran's many comic operas were: Le grand mogol (Marseille, 1877; Paris, 1884; London, as The Grand Mogul, 1884 with a libretto by Farnie, starring Florence St. John, Fred Leslie and Arthur Roberts;The Times, 19 November 1884, p. 6 New York as The Snake Charmer, 1881);\"Edmond Audran\". The Guide to Light Opera & Operetta, accessed 10 July 2010  La mascotte (Paris, 1880; New York, 1881;\"The Drama in America\", The Era, 25 June 1881, p. 4 London, as The Mascotte, 1881 with a libretto by Farnie, and cast including Lionel Brough and  Henry Bracy);\"Last Night's Theatricals\", Reynolds's Newspaper, 16 October 1881, p. 8 Gillette de Narbonne (Paris, 1882; London, as Gillette, 1883, libretto by H. Savile Clarke, with additional music by Walter Slaughter and Hamilton Clarke);\"Royalty Theatre\", The Daily News, 21 November 1883, p. 6 La cigale et la fourmi (the grasshopper and the ant) (Paris, 1886; London, as La Cigale, 1890; English version by F. C. Burnand, starring Geraldine Ulmar, Eric Lewis and Brough);\"Lyric Theatre\", The Times, 10 October 1890, p. 7 Miss Helyett (Paris, 1890; London, as Miss Decima, 1891, libretto by Burnand);\"The London Theatres\", The Era, 26 July 1891, p. 7 and La poupée (Paris, 1896; London, 1897, libretto by Arthur Sturgess, starring Courtice Pounds and Willie Edouin).The London Theatres, The Era, 27 February 1897, p. 9"]}, {"page": "Ben Webster (actor)", "response": ["Webster was born on 2 June 1864 in London.Casson, Lewis. \"Webster, Benjamin (1864–1947), actor\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 21 April 2021  His father, William Shakespeare Webster, was the son of the actor Benjamin Nottingham Webster. He was destined for the legal profession; after studying he became a practising barrister, but he appeared for a few performances with John Hare and W. H. Kendal in A Scrap of Paper and As You Like It, and was successful enough to be offered an engagement with them in 1887. He made his professional debut at the St James's Theatre on 3 March 1887, as Lord Woodstock in Clancarty, and subsequently toured as Octave in The Ironmaster. In 1888 he appeared under the managements of Willie Edouin in Katti, Run Wild, Charles Wyndham in Betsy, and Henry Irving as Malcolm in Macbeth.Parker, pp. 1523–1525"]}, {"page": "Les p'tites Michu", "response": ["The piece enjoyed a long run in London under the title The Little Michus. The English adaptation was by Henry Hamilton, with lyrics by Percy Greenbank, and was produced by George Edwardes at Daly's Theatre. The composer conducted the first night, on 29 April 1905,\"P.I.P. Playgoer\", The Penny Illustrated Paper, 6 May 1905, p. 283 and the piece ran for 400 performances. It starred Adrienne Augarde and Mabel Green, with Robert Evett, Willie Edouin, Huntley Wright, Amy Augarde, Willie Warde, Ambrose Manning, Louis Bradfield.Wearing, p. 230 A role was added during the run for the dancer Adeline Genée. A piece of comic business introduced during the run involved a fictional animal called the Gazeka, which became a London fad.\"P.I.P. Playgoer\", The Penny Illustrated Paper, 25 November 1905, p. 235"]}, {"page": "Victorian burlesque", "response": ["W. S. Gilbert wrote five opera burlesques early in his career, beginning with Dulcamara, or the Little Duck and the Great Quack (1866), the most successful of which was Robert the Devil (1868).Stedman, p. 62 In the 1870s, Lydia Thompson's burlesque troupe, with Willie Edouin, became famous for their burlesques, by such authors as H. B. Farnie and Robert Reece, both in Britain and the U.S.Lawrence, W. J., rev. J. Gilliland. \"Thompson, Lydia (1838–1908)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, January 2008 "]}, {"page": "The Girl from Kays", "response": ["*Max Hoggenheimer – Willie Edouin"]}, {"page": "La poupée", "response": ["The opera opened at the Théâtre de la Gaîté, Paris, on 21 October 1896. Along with Miss Helyett (1890), La poupée was one of Audran's late successes. It then played at the Prince of Wales Theatre in London, opening on 24 February 1897, with an English libretto in two acts by Arthur Sturgess, running for a very successful 576 performances. It starred Courtice Pounds and Willie Edouin, and Edna May later played in the piece."]}, {"page": "William Greet", "response": ["He worked first as a farmer and then began working in theatre management in the 1880s.William Greet at Rootsweb Between 1884 and 1890, Greet was successively business manager at Toole's Theatre under its licensee, J. L. Toole,The Observer, 28 December 1884, p. 4 the Novelty Theatre (licensee, Willie Edouin),The Times, 22 November 1885, p. 8 the Royalty Theatre (licensee, Kate Santley),British Library catalogues the Prince of Wales's Theatre (licensee, Horace Sedger),The Times, 23 January 1888, p. 8 and from 1890 to 1894 the Lyric Theatre, also for Sedger, with whom Greet's wife collaborated on a stage adaptation of the novel The Little Squire.The Times, 9 October 1890 and 6 April 1894"]}, {"page": "Toole's Theatre", "response": ["As the Charing Cross Theatre (1869–1876) the house became known for bills offering a mixture of drama, burlesque and operetta. Among the authors of its burlesques were W. S. Gilbert and H. B. Farnie. Its stars included Lydia Thompson, Lionel Brough and Willie Edouin. In 1876 Thompson and her husband, Alexander Henderson, became lessees of the theatre and renamed it the Folly Theatre. They continued the theatre's customary mix of operetta and burlesque. Their greatest successes were with English adaptations of French opéras bouffes and opéras comiques, most conspicuously Les cloches de Corneville, which began its record-breaking run (705 performances) at the Folly in 1878.", "In 1874 Lydia Thompson starred in H. B. Farnie's burlesque Blue Beard, in which she had played in the US nearly 500 times;\"Charing-Cross Theatre\", The Morning Post, 21 September 1874, p. 6 her co-stars were Lionel Brough and Willie Edouin. The following year the theatre featured Kate Santley in a series of comic operas, and later Virginie Déjazet in a French season. John Hollingshead then presented burlesque, and in 1876 Thompson and her husband, Alexander Henderson (1828–1886) returned from a \"farewell tour\" of the US and became proprietors of the theatre.", "There were new comedies as well as old favourites. Among them were Pinero's Girls and Boys (1882),\"Theatres\", The Graphic, 4 November 1882, p. 10 John Maddison Morton's final play, a three-act farcical comedy called Going It (1885),\"Death of Mr Maddison Morton\", The Era, 26 December 1891, p. 10 Herman Charles Merivale's The Butler (1886)\"New Plays of the Month\", The Era, 8 January 1887, p. 14 and The Don (1888),\"London Theatres\", The Era, 10 March 1888, p. 14 and Fred Horner's The Bungalow (1890), an English version of Eugène Medina's La Garçonnière.\"The London Theatres\", The Era, 12 October 1889, p. 14 Ibsen's Ghost (1891), a one-act lampoon of Henrik Ibsen's plays and disciples, starring Irene Vanbrugh and Toole, was J. M. Barrie's first London play.Jack, R. D. S. \"Barrie, Sir James Matthew, baronet (1860–1937), playwright and novelist\", Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 9 July 2020  In 1892 Toole directed the premiere of Barrie's Walker, London, which ran for 497 performances.Wearing, J. P. \"The London West End Theatre in the 1890s\", Educational Theatre Journal, October 1977, p. 320  In Toole's absence on tour other managements took temporary charge at his theatre, including William Terriss,\"Toole's Theatre\", The Morning Post, 19 June 1884, p. 3 Willie Edouin Augustin Daly with his New York company in 1884, and Violet Melnotte in 1890.\"Players of the Period\", The Era, 30 March 1895, p. 9"]}, {"page": "Lydia Thompson", "response": ["Thompson's troupe, called the \"British Blondes\", was the most popular entertainment in New York during the 1868–1869 theatrical season: \"The eccentricities of pantomime and burlesque – with their curious combination of comedy, parody, satire, improvisation, song and dance, variety acts, cross-dressing, extravagant stage effects, risqué jokes and saucy costumes – while familiar enough to British audiences, took New York by storm.\"\"Amusements. Theatrical. Wood's Museum.\" The New York Times, 1 October 1868 (review of Ixion). The six-month tour was extended to almost six years, and during two subsequent tours the British Blondes drew large crowds at leading theatres across the US. The troupe launched the careers of several actors, including Markham, Alice Burville, Lisa Weber and Rose Coghlan, and of comedian Willie Edouin. It also drew fierce criticism from those who felt it transgressed the boundaries of propriety. Burlesques, colloquially referred to as leg-shows, started off tame, clever and sophisticated, drawing in all types of people, especially women. Unfortunately, “the female audiences for burlesque did not last for long. In the summer of 1869 a wave of ‘anti-burlesque hysteria’ in the New York press frightened away the middle-class audiences that had initially been drawn to Ixion and sent the Thompson troupe prematurely packing for a national tour”.Dudden, Faye E. \"The Rise of the Leg Show\", Women in the American Theatre: Actresses and Audeiences, New Haven, Yale UP (1994) After this untimely closure, the hatred toward American burlesque continued to grow. Thompson's shows were described as a “disgraceful spectacle of padded legs jiggling and wriggling in the insensate follies and indecencies of the hour”.Moses, Marlie. \"Lydia Thompson and The ‘British Blondes’.\", Women in the American theatre, New York, Crown (1981) Times called their shows “an idiotic parody of masculinity”. Shakespeare scholar Richard Grant White, called burlesque “monstrously incongruous and unnatural”.Allen, Robert C.  \"Horrible Prettiness: A Cultural Analysis of ‘British Blondes’.\", Women in the American Theatre, New York, Crown (1981) The New York Times constantly expressed its disgust of burlesque, even headlining an article with the plea “Exit British Burlesque”."]}, {"page": "California Theatre (San Francisco)", "response": ["*Willie Edouin"]}, {"page": "The Blue Moon (musical)", "response": ["*Moolraj –Willie Edouin"]}, {"page": "Harold Pinter Theatre", "response": ["In 1893 J. Comyns Carr took over the management of the theatre. He remained in charge for three years, producing among other plays Sowing the Wind by Sydney Grundy (1893); The Professor's Love Story by J. M. Barrie (1894); The New Woman by Grundy (1894); and The Benefit of the Doubt by A. W. Pinero (1895). The resident stars of the house in this period were Cyril Maude and his wife Winifred Emery. Hawtrey resumed the management in a play of his own, Mr Martin, in which he co-starred with Lottie Venne.\"Comedy Theatre\", The Morning Post, 5 October 1896, p. 3 which he followed with a successful season of light comedies. William Greet took over the theatre in 1898 and presented Arthur Roberts and Ada Reeve in a musical comedy Milord Sir Smith with music by Edward Jakobowski.\"Milord Sir Smith\", The Era, 17 December 1898, p. 14 The major productions of 1899 were A Lady of Quality by Frances Hodgson Burnett, and  Great Caesar by George Grossmith Jr. and Paul Rubens, with Willie Edouin, Grossmith and Reeve.\"New Plays and Important Revivals\", The Era Almanack, 1900, p. 4"]}, {"page": "Sylvia Gerrish", "response": ["Gerrish began her career in San Francisco theatres in 1880 and commenced a long tour with Willie Edouin’s company the following year in a piece called Dreams.  She continued touring until 1883, and in 1884 she began to play roles on Broadway, especially at Bijou Opera House and the Casino Theatre, achieving considerable popularity.  She travelled to London in the early 1890s, where she attracted a large following, but soon after her return in 1893, her career ended.", "Gerrish joined the Willie Edouin’s Sparks company in September 1881 playing \"the fascinating contralto\" in Dreams, or Bink’s Photographic Gallery, a two-act musical written by Edouin and Nat Childs. She first appeared in the piece at Hooley's Theatre in Chicago and then toured with it well into the following year.\"The Drop-Curtain It Remained down This Week, or Rose to Scant Houses\", The Daily Inter Ocean (Chicago, Illinois), September 24, 1881, p. 13\"Willie Edouin's 'Sparks'\", Waterloo Courier (Waterloo, Iowa), May 3, 1882, p. 1 Gerrish supported Alexander Caufman in October 1882 at Atlanta’s DeGive's Opera House in Fred Marsden’s melodrama Called to AccountAtlanta Constitution (Atlanta, Georgia), October 20, 1882, p. 6 and in July 1883 she supported Henry E. Dixey in a burlesque of Gilbert and Sullivan's Patience at Boston’s Bijou Theatre.Music and the Drama, Boston Daily Advertiser, June 27, 1883, p. 4 Later in that month, at the same venue, Gerrish played Lady Magnolia in the Stephens and Solomon operatic extravaganza Virginia,Dramatic and Musical Notes, Boston Daily Advertiser, July 4, 1883, p. 4 and in September 1883, she played the same role to positive reviews at Philadelphia’s Arch Street Theatre.Dramatic and Musical, The North American (Philadelphia, Pennsylvania), September 18, 1883"]}, {"page": "Max Figman and Lolita Robertson", "response": ["Max made his stage debut at 17 in A Scrap of Paper (1883). He later joined the company of Willie Edouin in Fun in a Photographic Gallery. He later appeared in four plays with Mrs. Fiske: Miranda of the Balcony, A Doll's House, Hedda Gabler and Mary of Magdala. In 1905-06 he supported Florence Roberts in Ann La Mont and The Strength of the Weak. Break out as a star in the play version of The Man on the Box, filmed in 1914 by Cecil B. DeMille. From 1909-10 he toured in Mary Jane's Pa and in February 1912 was at Daly's Theatre New York in The Truth Wagon. Began his relationship with Lolita Robertson while in the play Fine Feathers first at the Cort Theatre Chicago Aug. 1912 and finally in New York at the Astor Theatre Jan. 1913.Who Was Who in the Theatre: 1912-1976 vol.2 D-H p.835, originally published annually by John Parker; 1976 edition by Gale Research Company"]}, {"page": "Annie Yeamans", "response": ["She visited the United States in 1865, and briefly in Yokohama in Japan, where she was joined by Willie Edouin in 1866.See , p9 Professional Entertainers Abroad and Theatrical Portraits in Hand, Aya Mihara, Old Photography Study, No.3, pp.45-54; 2009(4 March 1912). Annie Yeamans Dies; Acted for 66 Years, The New York Times In San Francisco in the late 1860's she became a widow, travelling to New York with her children, where she performed alongside G.L.Fox, playing Aunt Ophelia in 1877 in Uncle Tom's Cabin; being best noted for role as Cordelia in the Edward Harrigan play. Yeaman last acted in Vaudeville in 1907, noting of her retirement that 'as she is a woman of spirit and self-respect who, as she is capable of earning her way, prefers that independent course [of retirement.]'Gerald Bordman ; Thomas S. Hischak (2004) ‘Yeamans, Annie (1835–1912)’. Oxford University Press. P 674Harrison, Marie (1907) ‘Theater: Seen on the Stage’, Vogue (New York). New York: Condé Nast, 30(16), p. 528. During her time acting, she worked with Albert Marshman Palmer, Augustin Daly, Sydney Rosenfeld and Sadie Martinot in American productions.Harrison, Marie (1902) ‘Portrait: Mrs. Annie Yeamans’, Vogue (New York). New York: Condé Nast, 19(24), p. 664.Harrison, Marie (1907) ‘Theater: Seen on the Stage: Gossip’, Vogue (New York). New York: Condé Nast, 29(3), p. 77."]}, {"page": "Ada Blanche", "response": ["Outside the pantomime season, Blanche's West End seasons during the late 1890s and early 1900s were few. In 1898 she co-starred with Courtice Pounds and Lottie Venne in The Royal Star, which ran only briefly; the following year she joined George Grossmith Jr. and Willie Edouin in Great Caesar, as Cleopatra to Grossmith's Mark Antony.\"Comedy Theatre\", The Times, 1 May 1899, p. 14 In 1903 she was in another musical comedy, The Medal and the Maid, which ran for six months. She played in Robert Courteidge's pantomimes in 1903 to 1905 and toured in a farce, What the Butler Saw, from 1906 to 1908."]}, {"page": "Mark Melford", "response": ["During his twenties he joined a travelling portable theatre company, or booth, in the North Country of England. His adventures over the fifteen months he spent with the booth theatre are recounted in his book Life in a Booth and Something More.  Later he worked in the theatre with Charles Rice, Charles James Mathews, Mrs Rousby, Walter Speakman,Players of the Period. The Era - Saturday 19 August 1899 p. 11  © 2015 brightsolid Newspaper Archive Ltd Eloise Juno, Willie Edouin, Alice Atherton,The Era - Saturday 19 June 1886 p. 16 © 2015 brightsolid Newspaper Archive Ltd and Oswald Stoll, theatre manager, and the co-founder of the Stoll Moss Group theatre company. He advertised himself in his early career as an actor able to play the 'heavy lead' or villain, and burlesque, or 'character' parts.The Era - Sunday 27 January 1878 p.14 He was known affectionately in his hometown Portsmouth area, by the soubriquet \"Rhymeo\", and the Portsmouth Evening News noted his special rapport with the audience: \"a mutual good feeling appears to exist between the performer and the public from the moment Rhymeo's genial countenance smiles upon them.\"Portsmouth Evening News, Thursday 21 August 1879 p.2 © 2015 brightsolid Newspaper Archive Ltd In 1898 The Stage wrote \"It is well nigh impossible not to laugh when Mr. Mark Melford occupies the stage, his odd grimaces, quick and extraordinary gestures, quaint antics, and generally comic behaviour make him a most droll comedian.\"", "Around 1883 he became actor-manager of Mark Melford's Comedy Company, later known as Mark Melford and Company. The company performed his own plays, and he claimed that his tours with Kleptomania, Flying from Justice, Secrets of the Police, were all great financial successes. In 1886, he sold the rights to Turned Up to Willie Edouin for 25 pounds and a royalty of one pound per performance.Special Collections, University of Kent at Canterbury UKC/MEL/PLA/ASG/11 : 0600090 Turned Up was performed as far afield as Perth in Western AustraliaThe West Australian (Perth, WA : 1879 - 1954) Saturday 21 April 1906 p.13 at Trove and was later made into a film called Who's Your Father."]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* Willie Edouin (William Frederick Bryer) (1846–1908)"]}, {"page": "Harriet Vernon", "response": ["Her first professional engagement was as Harriet Vernon in January 1875 at The Star Music Hall in Bermondsey. On 28 February 1875 in Southwark in London, aged 16, she married William Thomas Gillett (1853–1933), an optician.England & Wales, Civil Registration Marriage Index, 1837–1915 for Harriet Maria Whitehouse Her children were Edward George Gillett (1876–1953), Ada Mary Ann Gillett (1879–), who followed her mother into burlesque as Ada Vernon, and William Whitehouse Gillett (1881–1933). In 1885 at the Prince's Theatre in Bristol and the Novelty Theatre in London, Vernon played Cammpi in The Japs; or, The Doomed Daimio, a burlesque by Harry Paulton and Mostyn Teddea, alongside Lionel Brough, Willie Edouin and Alice Atherton. "]}, {"page": "Alice Atherton", "response": ["==Atherton meets Willie Edouin==", "right|230px William Frederick Bryer  (1846-1908), who went by the stage name of Willie Edouin began a notable association with Lydia Thompson, playing with her burlesque troupe at Wood's Museum, New York, in October and November 1870. In the company was a sixteen-year-old Atherton. Three years later she married her English co-performer, Willie, on December 27, 1873 in St Louis. Together they became mainstays of the Coville burlesque companies. He organized the entertainment \"Dreams, or Fun in the Photograph Gallery,\" a piece that showed off her skill for impersonation and popularized the comic skit as a stage form.", "In 1885 she took to the stage at the Prince's Theatre in Bristol and the Novelty Theatre in London, alongside Harriet Vernon, Lionel Brough and of course Willie Edouin in The Japs; or, The Doomed Daimio, a burlesque by Harry Paulton and Mostyn Teddea."]}, {"page": "G. B. W. Lewis", "response": ["*William Frederick Bryer \"Willie Edouin\" (1 January 1846 – 1908) married Alice Atherton (1854–1899) c. 1873."]}]}}