{"wiki_id": "http://www.wikidata.org/entity/Q765918", "itemLabel": "Lucia Graves", "itemDescription": "British writer and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucia_Graves", "wikipedia_page": {"main": "Lucia Graves (born 21 July 1943) is a writer and translator.  Born in Devon, England, she is the daughter of writer Robert Graves, and his second wife, Beryl Pritchard (1915–2003).\n\n", "link_mentions": [{"page": "Robert Graves", "response": ["* Life of the Poet Gnaeus Robertulus Gravesa, ed. Beryl & Lucia Graves. Deià: The New Seizin Press, 1990", "* Complete Short Stories, ed. Lucia Graves, Manchester: Carcanet Press, 1995."]}, {"page": "International School of Geneva", "response": ["*Lucia GravesNovelist and translator; daughter of novelist, poet and scholar Robert Graves"]}, {"page": "Carlos Ruiz Zafón", "response": ["In 2001 he published his first adult novel La sombra del viento (The Shadow of the Wind, Lucia Graves' English translation published in 2004), a Gothic mystery that involves Daniel Sempere's quest to track down the man responsible for destroying every book written by author Julian Carax. The novel has sold millions of copies worldwide and more than a million copies in the UK alone. Since its publication, La sombra del viento has garnered critical acclaim around the world and has won many international awards.", "Ruiz Zafón's next novel, El juego del ángel, was published in April 2008. The English edition, The Angel's Game, was also translated by Lucia Graves. It is a prequel to The Shadow of the Wind, also set in Barcelona, but during the 1920s and 1930s. It follows (and is narrated by) David Martín, a young writer who is approached by a mysterious figure to write a book. Ruiz Zafón intended it to be included in a four-book series along with The Shadow of the Wind.", "The Labyrinth of Spirits (original title: El laberinto de los espíritus) is the fourth and final book in the Cemetery of Forgotten Books series. The novel was initially released on 17 November 2016 in Spain and Latin America by Spanish publisher Planeta. HarperCollins published the English translation by Lucia Graves, which was released on 18 September 2018."]}, {"page": "The Shadow of the Wind", "response": ["The Shadow of the Wind () is a 2001 novel by the Spanish writer Carlos Ruiz Zafón and a worldwide bestseller. The book was translated into English in 2004 by Lucia Graves and sold over a million copies in the UK after already achieving success on mainland Europe, topping the Spanish bestseller lists for weeks. It was published in the United States by Penguin Books and in Great Britain by Weidenfeld & Nicolson and Orion Books. It is believed to have sold 15 million copies worldwide, making it one of the best-selling books of all time."]}, {"page": "Graves (surname)", "response": ["* Lucia Graves, British novelist and translator"]}, {"page": "Paul O'Prey", "response": ["O'Prey's other books include Fleet, a collection of poems tracing the course of the lost River Fleet that flows beneath the streets of North London, published by The Melos Press in 2021,  and First World War: Poems from the Front, published in 2014 by the Imperial War Museum, to coincide with the centenary of the war. It takes a new approach in focusing on a small number of poets who saw active service on the Western Front, including three women. O'Prey translated with Lucia Graves the first English translation of the Spanish nineteenth century classic novel, Los Pazos de Ulloa by Emilia Pardo Bazan (Penguin Classics, 1991, reissued 2013). The book was later serialised by Channel 4."]}, {"page": "Marsh Award for Children's Literature in Translation", "response": ["*The Midnight Palace, by Carlos Ruiz Zafron, translated by Lucia Graves (Orion Children’s Books) - Spanish"]}]}}