{"wiki_id": "http://www.wikidata.org/entity/Q7659916", "itemLabel": "Sydney Evershed", "itemDescription": "English cricketer (1861-1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Evershed", "wikipedia_page": {"main": "Sir Sydney Herbert Evershed (13 January 1861 – 7 March 1937) was an English brewer and cricketer who played first-class cricket for Derbyshire from 1880 to 1901 and was a long-serving club captain from 1891 to 1898.\nEvershed was born in Stapenhill, the son of Sydney Evershed the brewer and MP for Burton. He was educated at Clifton College where he was in the School XI and XV. Evershed played cricket for Burton on Trent and for Staffordshire in 1878s.\nHis Derbyshire career began in 1880 and he appeared in a Gentlemen of Derbyshire team during the 1880 season, in which he made 85 in the first innings before being bowled. Three days later he made his first appearance for Derbyshire against Yorkshire, though he was out for a duck in his first innings. Evershed did not appear for Derbyshire during 1882, but returned to play two games in 1883. Against Marylebone Cricket Club (MCC), in a rare spell of bowling, he took 5 for 19. He played in five further games up to 1886. Derbyshire lost first-class status at the end of 1887, but Evershed continued to play, becoming captain in 1891.\nEvershed was still captain when Derbyshire regained first-class status in 1894, playing in Derbyshire's debut fixture in the County Championship, a draw against Warwickshire. Evershed was first-choice opener, along with Levi Wright. In Derbyshire's first season they finished at fifth in the Championship table. Evershed finished with Derbyshire's fifth-best average, ending the season with a best batting performance of 112. In the following 1896 season, Derbyshire played the Australians, the match finishing in a draw despite centuries from Test players Harry Trott, Harry Donnan and Clem Hill on the Australians' side. Derbyshire finished seventh in the 1896 County Championship. In the 1897 season, the team ended without a win in their last sixteen games and were bottom of the Championship table. Evershed remained a force in the Derbyshire opening order during the 1898 season, his last year as captain. In August Derbyshire recorded their highest score of 645 against Hampshire with centuries from Levi Wright, William Storer, William Chatterton and George Davidson. However the match ended in a draw and Derbyshire finished ninth in the Championship table. Evershed played very infrequently from the 1899 season onwards, appearing in six first-class matches between the end of the 1898 season and his final first-class game, against Hampshire in the 1901 County Championship.\nEvershed was a right-handed batsman and played 129 innings in 76 first-class matches with an average of 24.70 and a top score of 153. He made four centuries on the way to 3137 runs. He was a right-arm medium-pace bowler and took five first-class wickets all in one innings for a best performance of 5 for 19 and an average of 24.40.Evershed took charge of the family business Marston Thompson and Evershed on the death of his father in 1903. He became President of Derbyshire County Cricket Club in the first decade of the 20th century. He was a J. P. and Chairman of Burton Infirmary. He received a Knighthood in 1929 for services to Burton-on-Trent, where he died at the age of 76.\nEvershed's brothers, Edward, Wallis and Frank, and cousin Geoffrey Bell, were also first-class cricketers, while William Evershed also played first-class cricket in first half of the 19th century. His son Herbert became a noted flying pioneer.", "link_mentions": {}}}