{"wiki_id": "http://www.wikidata.org/entity/Q7668239", "itemLabel": "T. F. Thiselton-Dyer", "itemDescription": "British clergyman and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/T._F._Thiselton-Dyer", "wikipedia_page": {"main": "The Reverend Thomas Firminger Thiselton-Dyer, MA, Oxon (25 July 1848 – 14 July 1923) was a son of William George Thiselton-Dyer, physician and of Catherine Jane, née Firminger. He was educated at King's College School and at Pembroke College, Oxford. He was successively curate of St John's Church, Fitzroy Square, curate of Holy Trinity Church, Kilburn, vicar of St Paul's Church, Penzance, secretary of the South American Missionary Society and rector of Bayfield, Holt, Norfolk. He was an English writer of popular non-fiction books, including British Customs: Past and Present, The Folk-lore of Plants, and perhaps most famously, Strange Pages from Family Papers, which was considered a masterpiece of popular historical writing. He was particularly admired for his ability to couple in-depth research with the suspense and excitement normally associated with the nascent art of detective fiction.", "link_mentions": [{"page": "Owl", "response": ["T. F. Thiselton-Dyer, in his 1883 Folk-lore of Shakespeare, says that \"from the earliest period it has been considered a bird of ill-omen,\" and Pliny tells us how, on one occasion, even Rome itself underwent a lustration, because one of them strayed into the Capitol. He represents it also as a funereal bird, a monster of the night, the very abomination of human kind. Virgil describes its death-howl from the top of the temple by night, a circumstance introduced as a precursor of Dido's death. Ovid, too, constantly speaks of this bird's presence as an evil omen; and indeed the same notions respecting it may be found among the writings of most of the ancient poets.\"Thiselton-Dyer, T. F. (1883) Folk-lore of Shakespeare, sacred-texts.com A list of \"omens drear\" in John Keats' Hyperion includes the \"gloom-bird's hated screech.\"Keats, John. (1884) 49. Hyperion, in The Poetical Works of John Keats. Bartleby.com. Pliny the Elder reports that owl's eggs were commonly used as a hangover cure."]}, {"page": "Insufflation", "response": ["If it was either originally Christian (citation needed), Catholic or from the pagan practices, almost similar methods of healing have been reported, continuing until modern times: in Westphalia, the healing of a wound by triple signing and triple cruciform sufflation, or by exsufflation accompanied by a rhyming charm; and in Holland the alleviation of toothache by similar means.Dölger, 125. According to Drechsler, \"Illnesses were blown away by the breath. If a child had bumped himself, one would blow three times on the place and it would 'fly away.'\"Paul Drechsler, Sitte, Brauch, und Volksglaube im Schlesien, vol. 2 (Leipzig, 1906), 280. Cp. 298 and chapter 14, passim. Burns, and conditions that in some fashion resemble burns, such as fevers, boils, sore throats and rashes, are naturally the most common objects of blowing among modern folk-remedies,See HddA, i, s.v. \"Blasen,\" cols. 1357-58. See also from the Puckett collections nos. 6943, 8329, and 8401 (alleviation of a burn); 2750, 2889, 2890, 10566, and 2898 (thrush and sore mouth); and 9277 and 9279 (erysipelas): Popular Beliefs and Superstitions: A Compendium of American Folklore from the...Collection of Newbell Niles Puckett, ed. Wayland D. Hand, Anna Casetta, and Sondra B. Thiederman, 3 vols. (Boston, 1981). for example the Shetland cure that requires blowing on a burn three times while reciting the charm \"Here come I to cure a burnt sore. / If the dead knew what the living endure, / The burnt sore would burn no more.\"T. F. Thiselton-Dyer, English Folklore, 2nd rev. ed. (London, 1880), 170. But everything from jaundice, convulsions, and colic to bad luck and evil spells can apparently be alleviated by a bit of blowing.HddA, loc. cit.; cp. also the Puckett collection, nos. 23714, 23956, 23957, 9215, 25571, 19545, 9563, etc. Wolters points out that exorcistic blowing was still (in 1935) found in the custom of blowing over bread that is about to be eaten.Wolters cites Drechsler 2:15, a passage that describes how to avert the bad luck of biting into a piece of bread already bitten. Moreover,"]}, {"page": "Saint Lide", "response": ["According to Rev. T. F. Thiselton-Dyer's 1876 British Popular Customs, the first Friday in March is so called from Lide, Anglo-Saxon for March. This day is marked by a seriocomic custom of sending a young lad onto the highest mound or hillock of the work [i.e. tin mine], and allowing him to sleep there as long as he can, the length of his siesta being the measure of the afternoon nap for the tinners throughout the ensuing twelve months."]}, {"page": "Dyer (surname)", "response": ["* T. F. Thiselton-Dyer (1848–1923), British author"]}, {"page": "T F Thistleton-Dyer", "response": ["#REDIRECT T. F. Thiselton-Dyer "]}, {"page": "T.F. Thistleton-Dyer", "response": ["#REDIRECT T. F. Thiselton-Dyer "]}, {"page": "TF Thistleton-Dyer", "response": ["#REDIRECT T. F. Thiselton-Dyer "]}, {"page": "Thomas Firminger Thiselton Dyer", "response": ["#REDIRECT T. F. Thiselton-Dyer "]}, {"page": "Thiselton-Dyer", "response": ["* T. F. Thiselton-Dyer (1848–1923), British clergyman"]}, {"page": "T. F. Thistleton-Dyer", "response": ["#REDIRECT T. F. Thiselton-Dyer"]}, {"page": "Thomas Dyer (disambiguation)", "response": ["* T. F. Thiselton-Dyer (Thomas Firminger Thiselton-Dyer, 1848–1923), English writer of popular non-fiction books"]}]}}