{"wiki_id": "http://www.wikidata.org/entity/Q7660062", "itemLabel": "Sydney Nicholls", "itemDescription": "English rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sydney_Nicholls", "wikipedia_page": {"main": "Sydney 'Sid' Herbert Nicholls (29 May 1868 – 24 November 1946) was an English-born dual code rugby forward who played club rugby under the union code for Cardiff, and in his later years league rugby with Hull F.C. Nicholls won four caps for Wales, and was part of the Welsh team that beat the first touring Southern Hemisphere team the New Zealand Natives. He was the elder brother of Wales rugby legend Gwyn Nicholls, and his son Jack Nicholls was a Welsh international footballer.", "link_mentions": [{"page": "Nicholls (name)", "response": ["* Sydney Nicholls (1868–1946), British rugby player"]}, {"page": "1946 in Wales", "response": ["*24 November – Sydney Nicholls, Wales rugby international player, 78"]}, {"page": "1888–89 New Zealand Native football team", "response": ["Towers scored the first Welsh try, which was converted by Jim Webb. The Natives replied with a spirited run by Ellison, but he failed to break through the Welsh defence. The tourists trailed even further after George Thomas scored a breakaway try frrm the half-way line, which went some way to silence the heckles from the crowd. Webb, playing in out of position at full-back, missed the conversion and then failed at a long-distance goal from a mark. The Natives continued to push, with Elliot coming within five-yards of the try line, and when Ellison did manage to cross the line he was carried back into the 25-yard line before he could touch down. In the second half Wales continued to push their advantage when Alexander Bland dribbled the ball into the Natives' 25; this was collected by Sydney Nicholls, who managed to get the ball across the try line, allowing Jim Hannan to score. Warbrick for the Natives and Stadden for Wales both subsequently came close to scoring tries, but there were no further scores in the game.", "Wales: Jim Webb (Newport), George Thomas (Newport), Dickie Garrett (Penarth), Charlie Arthur (Cardiff), Norman Biggs (Cardiff), Charlie Thomas (Newport), William Stadden (Cardiff), Frank Hill (Cardiff) capt., Alexander Bland (Cardiff), Sydney Nicholls (Cardiff), Jim Hannan (Newport), Theo Harding (Newport), William Towers (Swansea), William Bowen (Swansea), Dan Griffiths, (Llanelli)"]}, {"page": "1868 in Wales", "response": ["*29 May – Sydney Nicholls, Wales rugby international player (d. 1946)"]}, {"page": "1889 Home Nations Championship", "response": ["Wales: Hugh Hughes (Cardiff), Dickie Garrett (Penarth), James Webb (Newport), Edward Bishop (Swansea), Martyn Jordan (London Welsh), Charlie Thomas (Newport), Rosser Evans (Cardiff), Sydney Nicholls (Cardiff), Frank Hill (Cardiff) capt., William Williams (Cardiff), David William Evans (Cardiff), Theo Harding (Newport), Jim Hannan (Newport), Rowley Thomas (London Welsh), William Bowen (Swansea)", "Wales: Ned Roberts (Llanelli), Abel Davies (London Welsh), Arthur Gould (Newport) capt., Tom Morgan (Llanelli), Norman Biggs (Cardiff), Charlie Thomas (Newport), Giotto Griffiths (Llanelli), William Bowen (Swansea), D Morgan (Swansea), Sydney Nicholls (Cardiff), David William Evans (Cardiff), Theo Harding (Newport), Jim Hannan (Newport), Rowley Thomas (London Welsh), Dan Griffiths (Llanelli)"]}, {"page": "1891 Home Nations Championship", "response": ["Wales: Billy Bancroft (Swansea), William McCutcheon (Swansea), Dickie Garrett (Penarth), David Gwynn (Swansea), George Thomas (Newport), Ralph Sweet-Escott (Cardiff), Hugh Ingledew (Cardiff), Percy Bennett (Cardiff Harlequins), Sydney Nicholls (Cardiff), Tom Graham (Newport), William Bowen (Swansea), Walter Rice Evans (Swansea), David Daniel (Llanelli), Rowley Thomas (London Welsh), Willie Thomas (Llanelli) capt."]}, {"page": "Alexander Bland", "response": ["The 1888 Championship was played without England, after the team withdrew when their union fell out with their Scottish counterpart. Bland played in both games, which saw Wales win their first match over Scotland thanks to a Thomas Pryce-Jenkins try, but in a reversal of fortunes the very next match saw the Welsh lose to Ireland; the first victory for the Irish over Wales. Towards the end of 1888, Bland was selected for the Welsh game to face the touring New Zealand Natives played at St. Helen's Ground, Swansea. The Welsh players experienced a hostile home crowd during the match due to the lack of Swansea players in the squad;Smith (1972), pg 17. but after trialing the four three-quarter system again, were able to beat the Māori opposition by a goal and two tries to nil. Bland played against the same touring Māori team, just seven days later, when his club team, Cardiff, hosted the New Zealanders at the Cardiff Arms Park. A goal from Norman Biggs and a rare joint try from Sydney Nicholls and W.T. MorganSmith (1972), pg 21. was enough to give Cardiff the win."]}, {"page": "Hugh Hughes (rugby union)", "response": ["Although overlooked for the 1888 Home Nations Championship, Hughes was part of the Cardiff team that on 29 December 1888, faced and beat the New Zealand Māori rugby union team.Billot (1972), pg 21. The Cardiff match was the last game of the Māori's tour of Wales which had been of mixed fortune for the tourists, though the team had beaten both Newport and Swansea over the last five days. Under the captaincy of Frank Hill, Cardiff were on top form, with a resurgent Norman Biggs scoring early on. Cardiff scored a second try later in the game, with a rare joint try from WT Morgan and Sydney Nicholls, which Hughes converted. Cardiff won by a goal to nil."]}, {"page": "Jack Nicholls (footballer)", "response": ["John Barry L. \"Jack\" Nicholls (14 February 1898 – 1970) was a Welsh professional footballer and Wales international. His father Sydney Nicholls and uncle Gwyn Nicholls were both Wales rugby union internationals."]}, {"page": "List of international rugby union families", "response": ["*Gwyn Nicholls, Sydney Nicholls, and Bert Winfield; brothers Gwyn and Sydney were brothers-in-law of Bert. Sydney's son Jack Nicholls represented Wales at football"]}, {"page": "History of Cardiff City F.C. (1899–1962)", "response": ["With the new ground in place, Cardiff were granted admission into the Southern Football League Second Division for the 1910–11 season. A board of directors was also elected to professionalise the club, with Sydney Nicholls named as the organisation's first chairman and Wilson continuing in his role as club secretary. The club also made its first professional signing the following year with the acquisition of outside-forward Jack Evans from fellow Welsh side Cwmparc, with Evans receiving a signing on fee of six shillings to cover his travel expenses."]}, {"page": "1922–23 Cardiff City F.C. season", "response": ["In the final, Cardiff met another Third Division South side, Aberdare Athletic at Swansea's Vetch Field. The match was described as \"hard-fought\" in local press coverage, and Aberdare took an early lead in front of the 8,000 spectators. Cardiff equalised soon after when an Aberdare defender accidentally gave the ball away allowing Grimshaw to score easily. In the second half, Gill gave Cardiff the lead before Len Davies added a third. Aberdare converted a penalty to pull a goal back but the match finished 3–2. Cardiff captain Blair received the trophy from Football Association of Wales (FAW) vice-president Sydney Nicholls. The match generated £450 in gate receipts."]}, {"page": "1924–25 Cardiff City F.C. season", "response": ["Although the side ultimately missed out on the league title, their second-placed finish saw ticket sales increase greatly ahead of the new season with both the Grange and Canton stands being sold out and the rest of the ground largely full. Manager Fred Stewart, who was entering his tenth competitive season in charge, made several changes to his playing squad with ten players being signed. Harry Beadles had arrived at the club from Liverpool immediately following the end of the previous season and had been part of the club's overseas tour. He had previously had a trial at the club after the First World War which had proved unsuccessful. Several players from local teams were also brought in, including forwards Jack Nicholls, son of Cardiff director Sydney Nicholls who was signed from Newport County, and Willie Davies, signed from Swansea Town for £2,500. The club also signed Joe Nicholson from Clapton Orient and Tom Sloan from Linfield, as well as James McLean from amateur side Barn Athletic, a player who was regarded as deaf and dumb although he never played for the first team."]}]}}