{"wiki_id": "http://www.wikidata.org/entity/Q7668578", "itemLabel": "T. P. Gill", "itemDescription": "Irish journalist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/T._P._Gill", "wikipedia_page": {"main": "Thomas Patrick (T. P.) Gill (25 Oct 1858 – 19 January 1931) was a prominent member of the Irish Parliamentary Party in the late 19th and early 20th century and a Member of Parliament in the British House of Commons representing the South Louth constituency unopposed from 1885 to 1892. His uncle Peter was an unsuccessful election candidate in 1868 in County Tipperary.", "link_mentions": [{"page": "The Picture of Dorian Gray", "response": ["In 1889, J. M. Stoddart, an editor for Lippincott's Monthly Magazine, was in London to solicit novellas to publish in the magazine. On 30 August 1889, Stoddart dined with Oscar Wilde, Sir Arthur Conan Doyle and T. P. Gill at the Langham Hotel, and commissioned novellas from each writer. Doyle promptly submitted The Sign of the Four, which was published in the February 1890 edition of Lippincott's, but Stoddart did not receive Wilde's manuscript for The Picture of Dorian Gray until 7 April 1890, seven months after having commissioned the novel from him."]}, {"page": "Nenagh", "response": ["* T. P. Gill MP of the Irish Parliamentary Party and agriculture pioneer"]}, {"page": "Tomás Mac Giolla", "response": ["He was born Thomas Gill in Nenagh, County Tipperary. His uncle T. P. Gill was a Member of Parliament (MP) and member of the Irish Parliamentary Party of Charles Stewart Parnell. Tomás's father Robert Paul Gill, an engineer and architect, also stood unsuccessfully for election on a number of occasions. His mother was Mary Hourigan."]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| T. P. Gill"]}, {"page": "Horace Plunkett", "response": ["The outcome of this proposal was the formation of the Recess Committee, with Plunkett as chairman and members of divergent views, such as the Earl of Mayo, John Redmond, The O'Conor Don, Thomas Sinclair, Thomas Spring Rice, Rev Dr Kane (Grand Master of the Belfast Orangemen),  Father Thomas A. Finlay, Mr John Ross, MP, Timothy Harrington MP, Sir John Arnott, Sir William Ewart, Sir Daniel Dixon (after Lord Mayor of Belfast),  Sir James Musgrave (Chairman of the Belfast Harbour Board), Thomas Andrews (Chairman of the Belfast and County Down Railway). T. P. Gill  acted as Honorary Secretary to the Committee.Ireland in the New Century, Chapt.8"]}, {"page": "Thomas Gill", "response": ["* T. P. Gill (1858–1931), Irish politician"]}, {"page": "Department of Agriculture, Food and the Marine", "response": ["The Department of Agriculture was created as a department of the Ministry of Dáil Éireann at one of the first meetings of Dáil Éireann in 1919 with Robert Barton as the first Minister for Agriculture, Horace Plunkett as the department's first Vice-President, and T. P. Gill as its first Secretary. In 1899, Plunkett had established the Department's forerunner, called the Department of Agriculture and Technical Instruction (DATI). It was given a statutory basis by the Ministers and Secretaries Act 1924. This act provided it with:"]}, {"page": "South Louth (UK Parliament constituency)", "response": ["|rowspan=2| T. P. Gill"]}, {"page": "Families in the Oireachtas", "response": ["*T. P. Gill (1858–1931): IPP/INF MP South Louth 1885–1892"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| T. P. Gill"]}, {"page": "Gill (name)", "response": ["* T. P. Gill (Thomas Patrick Gill, 1858–1931), Irish politician"]}, {"page": "T.P. Gill", "response": ["#REDIRECT T. P. Gill"]}, {"page": "T P Gill", "response": ["#REDIRECT T. P. Gill "]}, {"page": "TP Gill", "response": ["#REDIRECT T. P. Gill "]}, {"page": "Thomas Patrick Gill", "response": ["#REDIRECT T. P. Gill"]}, {"page": "Irish Homestead", "response": ["The aim of the paper was to publicise and propagate the objectives of the IAOS, which set up dairy co-operative societies and co-operative banks, and introduced co-operation among Irish farmers by proving the benefits obtainable through more economical and efficient management. Its headquarters were initially in the IAOS building in Dublin, 84 Merrion Square. The newspaper's first editor was Thomas A. Finlay, followed by T. P. Gill and H. F. Norman. In 1905, George William Russell became editor. A major contributor of articles and essays was Susan L. Mitchell, who became assistant editor."]}, {"page": "William George Stewart Adams", "response": ["From early 1917 he increasingly worked on the Irish Question and played a key role in arranging the Irish Convention that sat from July 1917 to April 1918 with Horace Plunkett as Chairman.Birmingham Daily Post, 12 June 1917; Turner, Lloyd George's Secretariat, p. 100; Brendan O’Leary, A Treatise on Northern Ireland, Volume 1: Colonialism (Oxford University Press, 2019), p. 330. Personal relationships with prominent figures in Irish public life enabled him both to explore and to influence opinion in a way conducive to the Convention’s progress.Turner notes (Lloyd George's Secretariat, p. 93) that T. P. Gill had been Adams’s colleague in the Department of Agriculture (the pair attended the International Agricultural Conference in Rome in December 1909). Other examples are his relationships with fellow delegates to the Convention such as George Russell, well-known to Adams on account of his service with Plunkett’s Irish Agricultural Organisation; Stephen Gwynn, a relative of Adams’s wife; and Bishop Denis Kelly of Ross, who had been a fellow member of the Primrose Committee. His correspondence with Plunkett became the principal line of communication between the United Kingdom Government and the Convention and, from December 1917 onwards, he orchestrated government policy in an attempt to avoid the Convention’s collapse.Turner, Lloyd George's Secretariat, pp. 85, 122. In October 1917 Plunkett suggested that Adams should be appointed Chief Secretary for Ireland in place of Henry Duke: Turner, Lloyd George's Secretariat, p.117. His was the principal hand in drafting the Government’s proposals accepted by a majority (but an inadequate majority) of the Convention in April 1918 and, after the Convention initiative was spent, he played a major part in preparation of a new Home Rule Bill.Turner, Lloyd George's Secretariat, pp. 116, 120."]}, {"page": "Evelyn Gleeson", "response": ["Gleeson was interested in Irish affairs, through her membership of the Gaelic League and the Irish Literary Society. She was also acquainted with the Yeats family and others in the Irish artistic circle in London, drawing inspiration from the romantic Irish revival in art and literature. She was a member of the suffrage movement and served as chairwoman of the London women's club, the Pioneer Club. In 1900 the opportunity arose to contribute to the Irish revival and suffrage for Irish women. On the advice of her friend Augustine Henry, Gleeson moved away from London smog to Ireland to improve her health, and offered her the finances to establish her own craft centre in the form of a loan of £500. She discussed these plans with the Yeats sisters, Elizabeth and Lily, who although they were talented craftswomen with a network of influential contacts, they could not contribute any money to the venture. Gleeson also consulted with W. B. Yeats, Jack Butler Yeats, and her cousin T. P. Gill."]}, {"page": "Thomas Sinclair (politician, 1838–1914)", "response": ["Despite numerous requests, Sinclair never stood for parliament, instead he served as Deputy lieutenant, Justice of the peace, president of the Ulster chamber of commerce in 1876 and 1902, and privy councillor in 1896. Having been a supporter of William Ewart Gladstone, Sinclair joined the Ulster Liberal Party in 1868, supporting the land acts of 1870 and 1881. Following the home rule bill of 1886, he convened a meeting in the Ulster Hall of liberals on 30 April 1886 which passed a resolution in condemnation of the bill. Forming the Ulster Liberal Unionist Association, of which he was chair, he organised the Ulster Convention in Belfast. Held on 17 June 1892, it saw 11,879 Ulster unionists meet to protest home rule. 9 months after the Convention, Sinclair was appointed to the executive committee of the new unionist clubs, which were founded to protect the union. The defeat of the British Liberal party in 1895 significantly decreased the threat of home rule, leading to the unionists clubs being suspended, and Sinclair returning to his activities in liberal reform. He was the leading Ulster member of the recess committee from 1895, which was founded by Horace Plunkett. He supported Plunkett's backing of T. P. Gill as secretary of the Irish Agricultural Organisation Society in 1899, in the face of strong protest by conservative unionists."]}, {"page": "Elizabeth O'Shea Dillon", "response": ["Elizabeth O'Shea Dillon was born in 1842 in Nenagh, County Tipperary. Her parents were John and Mary Anne O'Shea (née Gill) of Summerhill, Nenagh. Her father was a journalist with The Nenagh Guardian. Her mother was a sister of the editor-proprietor of the Tipperary Advocate, Peter E. Gill, and the aunt of T. P. Gill. Her older brother John Augustus was a soldier, journalist and novelist, and her sister Marion emigrated to the United States where she married Robert Roosevelt. Another sister, Margaret (Mrs Kelly) (1854–1927) was noted as being fluent in a number of languages, and translated French works, and her brother Robert Gabriel (1854?–1882) was the London political correspondent for the Freeman's Journal."]}, {"page": "Marion O'Shea Roosevelt", "response": ["Marion O'Shea Roosevelt was born in 1850 in Nenagh, County Tipperary. Her parents were John and Mary Anne O'Shea (née Gill) of Summerhill, Nenagh. Her father was a journalist with The Nenagh Guardian. Her mother was a sister of the editor-proprietor of the Tipperary Advocate, Peter E. Gill, and the aunt of T. P. Gill. Her older brother John Augustus was a soldier, journalist and novelist, and her sister Elizabeth was a writer who emigrated to India. Another sister, Margaret (Mrs Kelly) (1854–1927) was noted as being fluent in a number of languages, and translated French works, and her brother Robert Gabriel (1854?–1882) was the London political correspondent for the Freeman's Journal."]}]}}