{"wiki_id": "http://www.wikidata.org/entity/Q7660959", "itemLabel": "Sylvia Mason-James", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sylvia_Mason-James", "wikipedia_page": {"main": "Sylvia Mason-James (born 8 December 1958) is a British singer who has worked extensively as a backing vocalist and solo artist.", "link_mentions": [{"page": "The Crying Game", "response": ["# \"Live for Today\" (Orchestral) – Cicero and Sylvia Mason-James"]}, {"page": "Light Years (Kylie Minogue album)", "response": ["* Sylvia Mason-James – backing vocals "]}, {"page": "Chicane (musician)", "response": ["Following these releases, Bracegirdle's debut studio album Far from the Maddening Crowds was released in September 1997. Additional singles that followed were \"Lost You Somewhere\", the Benelux release \"Red Skies\", and the non-album single \"Strong in Love\", for which Bracegirdle used vocals by British singer Sylvia Mason-James (after discovering that she was the vocalist on the Paul Oakenfold and Steve Osborne remix of \"Lemon\" by U2) and first collaborated on production with Ray \"Madman\" Hedges (producer for B*Witched and Boyzone)."]}, {"page": "Chris Lowe", "response": ["In 1993 he wrote and produced the track \"Do the Right Thing\" for the footballer Ian Wright (Lowe is a passionate Arsenal F.C. fan). The song featured backing vocals by the long-time Pet Shop Boys' backing singer, Sylvia Mason-James, and the single featured remixes by Rollo."]}, {"page": "Very (Pet Shop Boys album)", "response": ["* Sylvia Mason-James – additional vocals on tracks 7, 11 and 12"]}, {"page": "Bilingual (album)", "response": ["* Sylvia Mason-James – vocals ", "* Sylvia Mason-James – additional vocals "]}, {"page": "Nightlife (Pet Shop Boys album)", "response": ["* Sylvia Mason-James – additional vocals "]}, {"page": "Alternative (album)", "response": ["*Sylvia Mason-James – additional vocals on disc 2: track 11"]}, {"page": "Aztec Camera", "response": ["* Sylvia Mason-James – vocals (1993)", "*Sylvia Mason-James – vocals"]}, {"page": "Sing When You're Winning", "response": ["* Sylvia Mason-James – backing vocals "]}, {"page": "Heaven's Open", "response": ["** Sylvia Mason-James"]}, {"page": "David Cicero", "response": ["On November 2, 1992, Cicero released a fifth single \"Live for Today\" with Sylvia Mason-James providing backing vocals. The single was taken from the Pet Shop Boys produced soundtrack to the film, The Crying Game, but it failed to chart. The following year, after the success of the title track, sung by Boy George, it was planned to re-release the single, but this never happened."]}, {"page": "Andy Bown", "response": ["His latest solo album Unfinished Business was released on 5 September 2011. The album was produced by Mike Paxman and recorded by Chris West, it features contributions from Henry Spinetti on drums, Mick Rogers on guitars, Trevor Bolder and Brad Lang on basses as well as vocalists Juliet Roberts and Sylvia Mason-James. It was recorded at State of the Ark Studios in Richmond, Surrey in 2010."]}, {"page": "Voyage (band)", "response": ["Voyage was a French disco and pop group, consisting of André \"Slim\" Pezin (guitar/vocals), Marc Chantereau (keyboards/vocals), Pierre-Alain Dahan (drums/vocals) and Sauveur Mallia (bass), together with British lead vocalist Sylvia Mason-James, who sang on the group's first two albums, Voyage (1977) and Fly Away (1978)."]}, {"page": "Fantastic (Wham! album)", "response": ["* Sylvia Mason-James – backing vocals (7)"]}, {"page": "Believe (Cher album)", "response": ["*Sylvia Mason-James – background vocals"]}, {"page": "James Last Orchestra", "response": [": english choir: Sue Glover, Sunny Leslie (1971–1980), Kay Garner (1971–1974), Lyn Cornell (1971–1980), Margot Newman (1971–1972), Jean Hawker (1971–1972, 1978), Russell Stone (1971–1995), Neil Lancaster (1971–1978), Peter Barnfather (1971–1972), Tony Burrows (1971–1980), Joanne Stone (1974–1978), David Martin (1977–1980), Stephanie De Sykes (1977), Lyn White (1978–1979), Madeline Bell (1976, 1980–1983, 2009), Irene Chanter (1979–1983, 1991), Simon Bell (1978–2015), Mac Kissoon (1981–2015), Katie Kissoon (1981–1997), Sonia Jones (1990–2015), Tracey Duncan (1999–2015), Ingrid Arthur (2002–2015), Anella Kissoon, George Chandler (1981–1983), Jimmy Helms (1987–1988), P.P. Arnold (1987), Ruby James (1978, 1987–1997), Sylvia Mason-James (1987–1991), Pearly Gates, Vicki Brown, Jimmy Chambers (1996–2002)"]}, {"page": "Freemasons (DJs)", "response": ["Freemasons were also the remixers on Faith Evans' 2005 #1 Hot Dance Club Play and #4 Hot Dance Airplay hit, \"Mesmerized\". The Freemason's follow-up, \"Watchin'\" was released in the United States in 2006 with Amanda Wilson as their lead vocalist for the track. \"Watchin'\" peaked at #1 on the Hot Dance Club Play and within the Top 20 of the Hot Dance Airplay chart. The third original single from the Freemasons, \"Rain Down Love\" reached the Top 20 of the Hot Dance Airplay chart. Their fourth single (released digitally), \"Nothing But a Heartache\" featuring vocals from Sylvia Mason-James was released in June 2007. The Freemasons also remixed Beyoncé's original song, \"Déjà Vu\" in 2006 (for which they were nominated for a Grammy Award). The Freemasons followed this up with further remixes of \"Ring the Alarm\", \"Beautiful Liar\" (duet with Shakira), and \"Green Light\". They also co-produced \"The One\" on Kylie Minogue's album X with Richard Stannard and remixed the song for single release in May 2008.", "| style=\"text-align:left;\"| \"Nothing but a Heartache\" (featuring Sylvia Mason-James)"]}, {"page": "Hallo Spaceboy", "response": ["In late 1995, Bowie performed this song together with Nine Inch Nails during Bowie's Outside Tour. In December 1995, Bowie performed the song twice at a concert in Birmingham, both of which appear on the live album No Trendy Réchauffé (Live Birmingham 95) (2020). Bowie performed the song live on Jools Holland's 'Later' (Series 6) in December 1995. In February 1996, Bowie performed the song with Pet Shop Boys at the 1996 Brit Awards. A version recorded in July 1996 at the Phoenix Festival in England was released on the various artist compilation Phoenix: The Album in 1997. A version performed during the Earthling Tour in July 1997 was released on the live album Look at the Moon! in 2021, and another version performed in November 1997 on the same tour appeared on the live album LiveAndWell.com in 2000 (re-released in 2021). The Pet Shop Boys performed their version of the song live with Sylvia Mason-James singing Bowie's parts, released on the DVD Somewhere – Live at the Savoy (1997). At Bowie's 50th Birthday Bash in New York January 1997, the song was performed together with Foo Fighters. This version featured Zachary Alford, William Goldsmith and Dave Grohl on three different drum sets and Nate Mendel and Gail Ann Dorsey on two bass guitars. Bowie's 25 June 2000 performance of the song at the Glastonbury Festival was released in 2018 on Glastonbury 2000. Bowie performed the song live at BBC Radio Theatre, London, on 27 June 2000, and a recording of this performance was included on the bonus disc accompanying the first releases of Bowie at the Beeb in 2000. A November 2003 live performance from the A Reality Tour is included on the A Reality Tour DVD, released in 2004, as well as the A Reality Tour album, released in 2010."]}, {"page": "Mason (surname)", "response": ["*Sylvia Mason-James (born 1958), British singer"]}, {"page": "Linda Lewis", "response": ["During the next decade, Lewis retreated from public life and moved to Los Angeles, although in 1984, she again appeared at the Glastonbury Festival, as well as recording for Electricity Records. In 1992, she worked on the Joan Armatrading album Square the Circle as a backing vocalist, along with her sister Shirley and Sylvia Mason-James. She then returned to record Second Nature (1995), which found success in the Japanese charts. Its success led to live performances, which were recorded and released as On the Stage – Live in Japan (1996). Three more albums followed. Warner Bros. Records released Reach for the Truth: The Best of the Reprise Years (2002), an anthology of her work during the previous thirty years. This was followed by BMG releasing The Best of Linda Lewis (2003), which included her hit singles. During 2003 she also appeared at the Glastonbury Festival, and was filmed by BBC Television whilst she appeared on the Jazz and World Stage."]}, {"page": "Go West (song)", "response": ["The accompanying music video for \"Go West\" was directed by British director Howard Greenhalgh and relies heavily on computer-generated imagery, like all of his videos for the Very singles. It begins with a red Statue of Liberty, and then depicts a grey city where the communist domination is evident on the basis of Soviet imagery such as red stars and red flags, the Yuri Gagarin Monument (a spaceman on a column) and the Monument to the Conquerors of Space (a rocket on a spire-like pedestal). Troops of identical Soviet men march up a staircase stretching into the clouds, seemingly toward a Western society, with the Statue of Liberty, now appearing as a black diva looming in the distance (played by backing-vocalist Sylvia Mason-James). Tennant and Lowe appear throughout; Tennant carries a blue-and-yellow striped arrow staff, and Lowe travels on a flying surfboard. Occasional live action shots of Soviet iconography appear; in one Tennant and Lowe appear in their costumes, walking across Red Square."]}, {"page": "Fresco (M People album)", "response": ["*Sylvia Mason-James – background vocals (track 3)"]}, {"page": "The Dark Side of the Moon Live", "response": ["A small personnel change was made due to two of the band members having already booked April and May 2008.Roger Waters 2008 mini-tour band - line-up change  — BrainDamage.co.uk Chester Kamen replaced Andy Fairweather-Low on guitars, bass and backing vocals. Chester toured with Waters in 2002 during the third year of the In The Flesh tour, back then replacing Doyle Bramhall II. Kamen is the brother of pop singer Nick Kamen. Sylvia Mason-James replaced Katie Kissoon on backing vocals. Mason-James also toured with the Pet Shop Boys. These Roger Waters concerts were the first without Fairweather-Low since 1984, when he replaced Tim Renwick, and the first ever without Kissoon (apart from Wall concert in Berlin in 1990, which utilized the male backing singers from the original tour.)", "*Sylvia Mason-James – Backing vocals, percussion (toured with the Pet Shop Boys)"]}, {"page": "Mac and Katie Kissoon", "response": ["In 2002, Katie Kissoon appeared on stage at the Concert for George. In 2006–2007, she was also part of the backing section for Roger Waters' The Dark Side of the Moon Live world tour. The tour continued for nine dates in 2008, but Katie was unable to perform and was replaced by Sylvia Mason-James. In 2006, Katie provided backing vocals on Andy Fairweather Low's album Sweet Soulful Music."]}, {"page": "Concrete (Pet Shop Boys album)", "response": ["* Sylvia Mason-James – backing vocals"]}, {"page": "Ain't No Doubt", "response": ["\"Ain't No Doubt\" is a 1992 song by English actor and singer-songwriter Jimmy Nail, released as the first single from his second album, Growing Up in Public (1992). Composed by Nail with Guy Pratt, Danny Schogger, and Charlie Dore, the song features additional vocals by Sylvia Mason-James. Six years after his debut album, Nail revived his singing career during the success of his television drama series Spender."]}, {"page": "Reputation (Dusty Springfield album)", "response": ["* Sylvia Mason-James – backing vocals track A4"]}, {"page": "Perfect Sense (song)", "response": ["* Sylvia Mason-James - backing vocals (2008 dates)"]}, {"page": "Dress for Excess", "response": ["*Sylvia Mason-James – backing vocals"]}, {"page": "Fabulous (album)", "response": ["* Sylvia Mason-James – backing vocals (3, 5, 6, 8)"]}, {"page": "Shaday", "response": ["* Sylvia Mason-James — backing vocals track 3"]}, {"page": "Conscience (The Beloved album)", "response": ["* Sylvia Mason-James – ad-lib vocals on #7, background vocals on #1, 2, 5, 6, 7, 10"]}, {"page": "Fly Away (Voyage album)", "response": ["* Lead Vocals – Sylvia Mason-James"]}, {"page": "Dreamland (Aztec Camera album)", "response": ["*Sylvia Mason-James"]}, {"page": "Growing Up in Public (Jimmy Nail album)", "response": ["* Sylvia Mason-James, Katie Kissoon, Sam Brown, Linda Taylor, Andy Caine – backing vocals"]}, {"page": "Unfinished Business (Andy Bown album)", "response": ["* Juliet Rogers and Sylvia Mason-James - backing vocals"]}]}}