{"wiki_id": "http://www.wikidata.org/entity/Q7678873", "itemLabel": "Talan Skeels-Piggins", "itemDescription": "Paralympic alpine skier", "wikipedia_url": "https://en.wikipedia.org/wiki/Talan_Skeels-Piggins", "wikipedia_page": {"main": "Talan Skeels-Piggins (born 10 September 1970 in Bristol, Somerset) is a Children’s Author, a double 600cc Motorcycle World Champion  (Paralysed category) and Winter Paralympian - as part of the British Team alpine skier. Skeels-Piggins used a sit-ski in alpine competitions.\nSkeels-Piggins is a former Royal Navy fighter controller and PE teacher at St Laurence School, Bradford On Avon. He was paralysed from the chest down following a motorcycle accident in March 2003, which shattered his spine and broke his neck. After his injury he was retained in the Armed Forces and serves as a lieutenant in the Royal Naval Reserves.He began skiing on a family holiday at the age of nine. Whilst in the Royal Navy, he was selected for the RN Ski Team and was captain of the Scotland, Northern England &\nNorthern Ireland Command Team. He was placed fourth overall in the 1995 Navy Ski Championships. After his accident he chose to start skiing using a sit-ski with the goal of competing at the Paralympics. He was selected to compete for the Great Britain team 14 months after sustaining his injuries and competes in the LW10/1 classification for athletes with paraplegia with no upper abdominal function and no functional sitting balance.By 2008 he had reached a world ranking of 5th in the downhill event. At the 2009 World Championships in Korea, he finished 31st in the Super-G and improved on that position with a 26th-placed finish at the 2009 World Cup in Whistler.In 2010 he won two bronze medals at the NorAm Cup in Kimberly, Canada to secure his qualification for the 2010 Winter Paralympics. He competed for Great Britain at the 2010 Winter Paralympics in the men's slalom, giant slalom and Super-G. His best finish was 15th in the giant slalom; he also finished 25th in the Super-G and 31st in the slalom.In 2011, together with Russell O'Neill and Halina Tomlinson, Talan founded 'The Bike Experience', a charity established to help motorcycle riders who are now paraplegic to ride again. Based at Castle Combe circuit in Wiltshire this is free experience for disabled bikers who would like to ride on a racing circuit:\nLevel 1 teaches the riders how to use the adapted machine, with slow speed work on a closed-off section of the circuit. This is normally followed by Level 2 after a short break.\nLevel 2 riders take part in track work and the session is spent working on learning the racing line around the circuit, ensuring correct gearing is selected and pressing on to a quick pace.\nLevel 3 is also a track session focusing on one-on-one tuition with the riders, concentrating on any issues they may have and working towards full confidence in taking part in track days.\n2011 Talan became the first paraplegic in the history of motor-racing to gain an ACU 'Hill-Climb and Sprint' Race Licence and compete against able bodied racers in solo motorcycles.\n2011 Talan was Awarded Honorary Masters (Education) from University of Chichester for Outstanding Sporting Achievement and continued Education Development in Schools, Colleges and Universities.\n2012 Talan became the first paraplegic in the history of motor-racing to gain an ACU Road Race licence and compete against able-bodies racers. Race held at Snetterton on 23/24 June 2012 with Club Thundersport, taking part in the Minitwin Class on a modified Suzuki SV650. Came 12th out of 38 in 2012 Minitwin Championship.\n2013 Silver Medal in IPC NorAm Adaptive SBX Competition. Becomes first Monoskier to win IPC medals in both Alpine and Adaptive SBX races.\n2015 World Champion 600cc (Paralysed category) at Bridgestone World Cup in Vallelunga, Italy. Also took 2nd place 600cc (all disabled categories). He competed again in the 2018 Disabled World Championship, with podiums at Le Mans and Magny Cours, he finished second overall in the 600cc class and took First for paralysed riders. \nSkeels-Piggins is a qualified teacher and formerly taught physical education at St Laurence, Bradford on Avon.In September 2020 his first book, The Little Person Inside, was published. The book is aimed at inspiring children and getting them to believe in their own ability.", "link_mentions": [{"page": "List of people from Bath", "response": ["*Talan Skeels-Piggins (born 1970) – Paralympic alpine skier"]}, {"page": "List of Cornish sportsmen and sportswomen", "response": ["*Talan Skeels-Piggins (born 1970), Paralympic alpine skierTruro School Reunited: Skeels-Piggins, Mr Talan, www.webalumnus.com (Registration required). Retrieved 15 May 2010."]}, {"page": "Great Britain at the 2010 Winter Paralympics", "response": ["Britain’s alpine skiing team consisted of four men, Russell Docker, Timothy Farr, Sean Rose and Talan Skeels-Piggins, and three women Jane Sowerby, Anna Turney and Kelly Gallagher, as well as Gallagher’s guide, Claire Robb. Docker was competing in his third Winter Paralympics, having previously taken part in Salt Lake City and Turin. The only other British skier with previous Games experience was Rose who had also raced in Turin.", "|rowspan=3|Talan Skeels-Piggins"]}, {"page": "Alpine skiing at the 2010 Winter Paralympics – Men's slalom", "response": ["| 31 || 43 ||  align=left| Talan Skeels-Piggins  || align=left|   || 1:13.66 || 38 || 1:16.0 || 29 || 2:29.65 || +48.02"]}, {"page": "Alpine skiing at the 2010 Winter Paralympics – Men's giant slalom", "response": ["| 15 || 28 || align=left| Talan Skeels-Piggins || align=left|  || 1:29.68 || 20 || 1:31.48 || 16 || 3:01.16 || +23.76"]}, {"page": "Alpine skiing at the 2010 Winter Paralympics – Men's Super-G", "response": ["| 25 || 33 || align=left| Talan Skeels-Piggins ||align=left|  || 1:37.62 || +17.64 "]}, {"page": "List of Old Truronians", "response": ["*Talan Skeels-Piggins (1982–1989), Paralympic alpine skier (Vancouver 2010)Truro School Reunited: Skeels-Piggins, Mr Talan, webalumnus.com (Registration required). Retrieved on 15 May 2010."]}, {"page": "Talan Skeels Piggins", "response": ["#REDIRECT Talan Skeels-Piggins"]}, {"page": "2011 IPC Alpine Skiing World Championships – Downhill", "response": ["Great Britain's Talan Skeels-Piggins did not compete in the Downhill race, as he had a crash in a training run the day before.Had huge crash, Talan Skeels-Piggins (talansp) on Twitter2011 IPC Alpine Skiing World Championships - Official Training Results , IPC Alpine Skiing"]}, {"page": "2011 IPC Alpine Skiing World Championships – Super-G", "response": ["| 20 || 72 || align=left| Talan Skeels-Piggins ||align=left|  || 1:29.14 || +11.47"]}, {"page": "LW10", "response": ["Skiers in this classification include British skier Talan Skeels-Piggins, United States skier Chris Waddell, and Japan's Kuniko Obinata."]}, {"page": "Skeels", "response": ["* Talan Skeels-Piggins (born 1970), a British alpine skier"]}, {"page": "Talan", "response": ["* Talan Skeels-Piggins (born 1970), British alpine skier"]}]}}