{"wiki_id": "http://www.wikidata.org/entity/Q7679435", "itemLabel": "Talfryn Thomas", "itemDescription": "British actor (1922-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Talfryn_Thomas", "wikipedia_page": {"main": "John Talfryn Thomas (31 October 1922 – 4 November 1982) was a Welsh character actor, best known for supporting roles on television in the 1970s, including those of Private Cheeseman in Dad's Army (1973–1974) and Tom Price in Survivors (1975), while Thomas also appeared with Jon Pertwee in two Doctor Who serials.\n\n", "link_mentions": [{"page": "List of Welsh people", "response": ["*Talfryn Thomas (1922–1982)"]}, {"page": "1982 in film", "response": ["| style=\"text-align:center;\"| 4 || Talfryn Thomas || style=\"text-align:center;\"| 60 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || Under Milk Wood"]}, {"page": "Survivors (1975 TV series)", "response": ["* Talfryn Thomas as Tom Price (eps. 1-3, 7-10)"]}, {"page": "Under Milk Wood", "response": ["|Mr Pugh||Roy Poole||John Huw Jones|| ||Raymond Llewellyn||Talfryn Thomas||Talfryn Thomas||Steffan Rhodri||Jonathan Pryce", "|Sinbad Sailors||Allen F. Collins||Aubrey Richards|| ||Talfryn Thomas|| Hubert Rees ||Michael Forrest||Steven Meo||Jon Tregenna"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, Jean Trend as Dr Fay Chantry, Joan Phillips as Mrs. Hetherington, Talfryn Thomas as Mr. Hetherington, Laurence Bulaitis as Laurence, John Quayle as Cavendish, Ursula Hirst as Mrs. Frank, Philip Bond as Inspector Drew, Gloria Connell as Policewoman, Ray Armstrong as Donovan, Patrick Godfrey as Grant, Roddy McMillan as Scobie, Kevin Brennan as Sir Billy Langly, Doreen Andrew as Mrs. Scobie, Tom Collister as Man in Lift.", "Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, John Barron as The Minister, Elizabeth Weaver as Dr Anne Tarrant, John Bown as Commander Neil Stafford, Joby Blanshard as Colin Bradley, Vivien Sherrard as Barbara Mason, Henry Knowles as Dr Richard Poole, Caroline Rogers as Julie, Michael Elwyn as Duncan, John Rake as Police Sergeant, Marcelle Samett and Julia Hand as Bystanders, John Berryman as Reporter, Eric Longworth as Prison Officer Clarke, Talfryn Thomas as Warren, Clifford Cox as Radio Operator, Jonathan Pryce and David Waterman as Police Constables, Frank Singuineau as Chemist."]}, {"page": "Theatre 625", "response": ["|Jeanne Moody,Ronald Hines,Sylvia Kay,Ronald Leigh-Hunt,Judi Dench,Arthur Pentelow,Fulton MacKay,Nicholas Pennell,Talfryn Thomas,Colin Jeavons,Tony Steedman"]}, {"page": "Seven of One", "response": ["In addition to Barker, Seven of One also featured Roy Castle, Bill Maynard, Talfryn Thomas, Prunella Scales, Glynn Edwards, Joan Sims, Keith Chegwin, Leslie Dwyer, Robin Parkinson, Sam Kelly, Christopher Biggins, Richard O'Callaghan, Yootha Joyce, David Jason, and Avis Bunnage in supporting roles. The series was released on BBC DVD in 2005."]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |Barrett, tipped off by a journalist contact, investigates a project in the Welsh countryside that is experimenting with freezing people at the point of death so that they can be revived once medical technology is advanced enough to help them.With Bernard Lee, Philip Locke, Ann Lynn, J. G. Devlin, Gregory Phillips, Christina Taylor, Fredric Abbott, Talfryn Thomas"]}, {"page": "King of the Castle (TV series)", "response": ["Philip Da Costa starred as Roland, while other prominent roles were played by Talfryn Thomas, Fulton Mackay, Milton Johns and Angela Richards."]}, {"page": "Edna, the Inebriate Woman", "response": ["* Talfryn Thomas as Tramp"]}, {"page": "My British Buddy", "response": ["* Talfryn Thomas as Mr Cheeseman", "#This episode was Talfryn Thomas' first appearance in Dad's Army."]}, {"page": "Private Walker", "response": ["Private Joe Walker is a fictional black market spiv (or Wholesales Supplier, as he politely puts it) and Home Guard platoon member, first portrayed by actor James Beck in the BBC television sitcom Dad's Army. Beck died suddenly in 1973. The character of Walker was one of the seven primary characters in the show. Following his character's departure (Walker was last mentioned in the episode \"The Recruit\", although he does not appear in this episode) the series attempted to replace him with a war reporter called Private Cheeseman (played by Talfryn Thomas), who had made a previous cameo appearance in the episode \"My British Buddy\"."]}, {"page": "List of people from Swansea", "response": ["*Talfryn Thomas"]}, {"page": "Turkey Dinner", "response": ["*Talfryn Thomas as Private Cheeseman"]}, {"page": "1982 in Wales", "response": ["*4 November – Talfryn Thomas, comedy actor, 60"]}, {"page": "The Captain's Car", "response": ["*Talfryn Thomas as Private Cheeseman"]}, {"page": "List of Dad's Army characters", "response": ["*Private Cheeseman (Talfryn Thomas) – a Welsh journalist who originally appeared in one episode in series six; after the death of James Beck he joined the platoon for series seven. Although Thomas was a capable actor, David Croft wrote that the character was \"irritating without being funny\", and as an exotic Celt he was too similar to Private Frazer (John Laurie was strongly against the character). The writers decided that Cheeseman should not return for series eight and nine, but they would make more use of the existing minor characters.David Croft, Dad's Army: The Complete Scripts, Orion 2003, p. 13 A character called Charlie Cheeseman (played by Jimmy Perry) appeared in the sixth episode of the first series, but he was unrelated. Cheeseman mentions a wife in Turkey Dinner, but Mrs Cheeseman is not mentioned again."]}, {"page": "Gorilla Warfare (Dad's Army)", "response": ["*Talfryn Thomas as Private Cheeseman"]}, {"page": "A Man of Action", "response": ["*Talfryn Thomas as Mr Cheeseman"]}, {"page": "The Godiva Affair", "response": ["*Talfryn Thomas as Private Cheeseman"]}, {"page": "The Ronnie Barker Playhouse", "response": ["**Also starring Dudley Jones, Richard O'Callaghan, Talfryn Thomas, Gwendolyn Watts."]}, {"page": "1922 in Wales", "response": ["*31 October – Talfryn Thomas, comedy actor (d. 1982)"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Talfryn Thomas"]}, {"page": "A Surfeit of H2O", "response": ["*Talfryn Thomas as Eli Barker"]}, {"page": "Sir Henry at Rawlinson End (film)", "response": ["*Talfryn Thomas as Teddy Tidy"]}, {"page": "Come Play with Me (1977 film)", "response": ["*Talfryn Thomas as Nosegay "]}, {"page": "Ghost Squad (TV series)", "response": ["* 48.  The Goldfish Bowl: Also features Gerald Sim and Talfryn Thomas."]}, {"page": "Treasure Island (1977 TV series)", "response": ["*Talfryn Thomas as Tom Morgan"]}, {"page": "Horace (television play)", "response": ["*Dick - Talfryn Thomas"]}, {"page": "Dad's Army", "response": ["* Private Cheeseman (Talfryn Thomas), a Welshman who works for the town newspaper. He joined the Walmington-on-Sea platoon during the seventh series after the sudden death of James Beck, who played Private Walker."]}, {"page": "Under Milk Wood (1972 film)", "response": ["* Talfryn Thomas as Mr. Pugh"]}, {"page": "1982 in British television", "response": ["|Talfryn Thomas"]}, {"page": "Betty Davies (radio)", "response": ["| Norman Wynne, Rachel Thomas, William Ingram, Aubrey Richards, Gareth Robinson, Talfryn Thomas,  Olwen Brookes, Haydn Jones, Basil Jones, Gordon Davies, John Dillon, Windsor Davies, Sian Davies, Aubrey Richards, John Dearth and Dorothea Phillips"]}, {"page": "The Incredible Mr Tanner", "response": ["Actors who appeared in episodes of the series include Patsy Rowlands, Talfryn Thomas, John Forgeham, Bryan Coleman, Willoughby Goddard, Jesse Birdsall, Lionel Murton and Ray Barron."]}, {"page": "Tottering Towers", "response": ["* Talfryn Thomas as Prayer-book Perce"]}]}}