{"wiki_id": "http://www.wikidata.org/entity/Q767794", "itemLabel": "Glen Little", "itemDescription": "British footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Glen_Little", "wikipedia_page": {"main": "Glen Matthew Little (born 15 October 1975) is an English footballer. Born in Wimbledon, London he also previously played for Burnley, Derry City, Glentoran, Crystal Palace, Sheffield United, Wrexham and Aldershot Town. He has also appeared in the Premier League for Bolton Wanderers, Reading and Portsmouth.", "link_mentions": [{"page": "October 15", "response": ["*  1975   – Glen Little, English footballer and manager"]}, {"page": "Glenn Roeder", "response": ["Roeder followed his tenure at Watford by taking a season away from the limelight, assuming a back seat role as Chris Waddle's assistant manager at Burnley. The partnership did not prove to be successful and the pair narrowly avoided steering Burnley into the bottom tier of English football. Only a home victory over Plymouth Argyle on the last day staved off relegation. Roeder proved to be both an unpopular and controversial figure to the Burnley fans, hitting a low point when he was reported to have said that star player Glen Little was \"not fit to lace the boots\" of manager Chris Waddle. Roeder left his role at Burnley alongside Waddle when the pair departed the club after only a single season in charge."]}, {"page": "Wingate & Finchley F.C.", "response": ["The club finished mid-table in its first season in the Premier Division, before surviving a relegation scare in 2012–13 with one match to spare. In 2013–14, the club were relegated on goal difference behind East Thurrock United despite a final day 5–0 victory. However the drama did not end there, as the resignation of Worksop Town from the Northern Premier League gave Wingate & Finchley a much welcomed reprieve from relegation. The club finished the 2015–16 season in 13th position on 60 points. On 8 October 2018, the club pulled a coup by employing Nicky Shorey and Glen Little as managers. This was short-lived, as Nicky left on 29 October 2018."]}, {"page": "Nicky Shorey", "response": ["On 8 October 2018, Shorey along with Glen Little, were appointed joint managers of Isthmian League Premier Division side, Wingate & Finchley. This was short lived as on 29 October he left his managerial role due to personal reasons."]}, {"page": "Dean Holdsworth", "response": ["In January 2011 he was announced as the new manager of League Two side Aldershot Town. Holdsworth wasted no time making his mark on the team, bringing in forwards Peter Vincenti, Tim Sills, and Alex Rodman – as well as defender Simon Grand on loan from Fleetwood – before the end of the month. There were also players leaving the club during this period of transition, with both Glen Little and Wesley Ngo Baheng being released, whilst Anthony Straker and Damian Spencer were sent out on loan. Holdsworth's first game in charge resulted in a creditable 1–1 draw away to high-flying Bury, and he also improved on Aldershot's poor home form; winning his first game at \"The Rec\" 1–0 against Bradford City, whilst a last-minute Luke Guttridge free-kick gave the \"Shots\" a second consecutive home win 3–2 against Crewe. He continued attempting to strengthen the squad throughout February, with loan signings Albert Jarrett and Luke Medley from Lincoln and Mansfield respectively, though neither had a large impact on the team with only a handful of appearances between them. Holdsworth also signed former \"Shots\" goalkeeper Mikhael Jaimez-Ruiz, who made 62 appearances in a previous spell at the club. On the pitch, Aldershot went on a run of five consecutive draws, the first away to league leaders Chesterfield who required a late equaliser to rescue a point."]}, {"page": "Kevin Dillon (English footballer)", "response": ["On 9 November 2009, Dillon was confirmed as the new manager of Aldershot Town, succeeding Wycombe Wanderers-bound Gary Waddock. His contract was to run until the end of the 2010–11 season. Against all odds he led the club to the 2009–10 playoffs with a game to spare after a run of just one defeat in ten games. The club's sixth-place finish is still their highest ever league finish to date. Despite such a successful campaign, Dillon made several changes to his squad for the start of the 2010–11 season. He brought in no fewer than ten new faces, including arguably the most eye catching deal of the summer in League Two when he completed the signing of Glen Little from Sheffield United. Despite all the transfer activity, The Shots made a solid start and lost just one of their opening nine league games, as well as progressing through to the second round of the Football League Trophy for the first time in the club's history. But on 10 January 2011, after a run of just two wins in the previous ten League games and with attendances declining, Dillon and assistant Gary Owers left the club by mutual agreement."]}, {"page": "List of Derry City F.C. players", "response": ["* Glen Little"]}, {"page": "Glenn Little", "response": ["#REDIRECT Glen Little"]}, {"page": "2005–06 Reading F.C. season", "response": ["Reading's first match in the Championship was a home game against Plymouth Argyle on 6 August and despite dominating the game Reading lost 1 – 2. Having gone one down Leroy Lita equalised with a goal on his debut but a late finish from Nick Chadwick was enough to give Plymouth all the points. On 9 August Reading faced Brighton in the first of two away games with goals in each half for Glen Little and Dave Kitson enough for a 2 – 0 victory. Reading then faced a trip north to Preston on 13 August and a came away with a comfortable 3 – 0 win thanks to a brace from Lita and a second goal in four days from Glen Little. Reading returned to the Madejski on 20 August to face Millwall in a game they won emphatically 5 – 0. Bobby Convey scored two and one each from James Harper, Kitson and Steve Sidwell completed the scoring.", "| Glen Little", "|7 ||FW || ||7 ||Glen Little || 5 || 0 || 0 || 5"]}, {"page": "2004–05 Reading F.C. season", "response": ["| Glen Little", "|7 || ||MF ||Glen Little || 4 || 0 || 0 || 0 || 0 || 0 || 4 || 0"]}, {"page": "Hal Robson-Kanu", "response": ["In 2010, he switched to Wales, for which he qualifies through his Caerphilly-born grandmother. The switch came about when Welsh coach Brian Flynn came to the Reading training ground to see Simon Church, and Glen Little jested that Robson-Kanu would be eligible for Wales through going on holiday there. Robson-Kanu told Flynn that the family went to Tenby via picking up his grandmother in Caerphilly, and Flynn asked whether she was born in Wales."]}, {"page": "2008–09 Reading F.C. season", "response": ["However, that was forgotten in midweek as they won 1–0 at Doncaster Rovers, thanks to a late Dave Kitson winner eight minutes from time. Kitson had returned to the club on loan, as did Glen Little.", "| Glen Little", "| Glen Little"]}, {"page": "2008–09 Portsmouth F.C. season", "response": ["|  Glen Little", "|  Glen Little", "|25||Glen Little||Right-sided Midfielder||15-10-1975|| England||4 (1)||0||2 (1)||0||0 (+1)||0 / 0"]}, {"page": "2009–10 Portsmouth F.C. season", "response": ["| Glen Little"]}, {"page": "2003–04 Bolton Wanderers F.C. season", "response": ["*  Glen Little -  Burnley, month loan, 1 September 2003", "| Glen Little"]}, {"page": "2009–10 Sheffield United F.C. season", "response": ["| Glen Little"]}, {"page": "2004–05 Burnley F.C. season", "response": ["|||MF|| Glen Little || Reading || Free || 30 June 2004"]}, {"page": "2003–04 Burnley F.C. season", "response": ["|7||MF|| Glen Little || Bolton Wanderers || Loan || 1 September 2003"]}, {"page": "2002–03 Burnley F.C. season", "response": ["|7||MF|| Glen Little || Reading || Loan || 1 April 2003"]}]}}