{"wiki_id": "http://www.wikidata.org/entity/Q7681566", "itemLabel": "Tammy Beaumont", "itemDescription": "England cricketer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tammy_Beaumont", "wikipedia_page": {"main": "Tamsin Tilley Beaumont  (born 11 March 1991 in Dover, Kent) is an English cricketer. She opens the batting for Kent and England, and has previously kept wicket. She has also played for other domestic teams in both England and Australia.", "link_mentions": [{"page": "Wisden Cricketers of the Year", "response": ["The earliest surviving recipient of the award is Sonny Ramadhin (1951), which he became in August 2015 with the death of Arthur Morris.  The longest that a recipient has lived after receiving the award is 77 years by Harry Calder (1918), who died in 1995.  Calder, however, uniquely for a male recipient, played no first-class cricket.  Among first-class players, the longest-lived after receipt of the award is 74 years by Wilfred Rhodes (1899). Seven women have been chosen: Claire Taylor (2009), Charlotte Edwards (2014), Heather Knight (2018), Natalie Sciver (2018), Anya Shrubsole (2018), Tammy Beaumont (2019) and Ellyse Perry (2020).", "|  Tammy Beaumont"]}, {"page": "ICC Awards", "response": ["|  Tammy Beaumont", "| Tammy Beaumont", "| Tammy Beaumont", "| Tammy Beaumont", "| Tammy Beaumont", "| Tammy Beaumont", "| Tammy Beaumont"]}, {"page": "Kent County Cricket Club", "response": ["Kent's most notable former players include Colin Cowdrey, the first man to play 100 Test matches, Frank Woolley, Derek Underwood and wicket-keepers Les Ames and Alan Knott. All five men played Test cricket for England, making at least 40 Test match appearances. They are the only players to have stands named after them at the St Lawrence Ground, Kent's home ground in Canterbury.Brenkley S (2015) Australia vs Kent day one match report: Shaun Marsh opens with century as Aussies underline their Ashes threat. The Independent, 2015-06-25. Retrieved 2016-03-01. A total of 30 Kent players have been named as one of the Wisden Cricketers of the Year, most recently Zak Crawley and Darren Stevens in 2021 and Tammy Beaumont in 2019.Crawley & Stevens named Wisden Cricketers of the Year, Kent County Cricket Club, 2021-04-14. Retrieved 2021-04-15.Collins A (2019) Wisden 2019 Cricketer of the Year: Tammy Beaumont - England's record-breaking runscorer, The Daily Telegraph, 2019-04-10. Retrieved 2019-04-10.Ben Stokes: Wisden name England all-rounder leading cricketer in world again, BBC Sport, 2021-04-14. Retrieved 2021-04-15.", "The side features a number of international players and is captained by England international Tammy Beaumont. They won the County Championship a record eight times during its existence, including the final tournament in 2019, and have won the Women's Twenty20 Cup three times, most recently in 2016. The team play the majority of their home matches at the County Cricket Ground, Beckenham. The Women's team is sponsored by Canterbury Christ Church University.", "Kent established an academy in 2003 with the aim of developing future first-class cricketers. The academy is based at the St Lawrence Ground in Canterbury and makes use of the Ames-Levett Sports Centre at the ground.Kent County Council to support Cricket Academy, CricInfo, 2003-02-19. Retrieved 2016-06-01. It has produced over 25 first-term players for the county, including current club captain Sam Northeast and senior England internationals Tammy Beaumont, Sam Billings, Joe Denly, Natasha Farrant, Lydia Greenway and Jo Watts.Kent coach Simon Willis appointed Sri Lanka high performance manager , Kent News, 2016-05-24. Retrieved 2016-06-01. The leading academy scholar is awarded the John Aitken Gray trophy each year. Past winners have included county First XI players Daniel Bell-Drummond, Alex BlakePyman T (2015) Trio honoured in Kent Cricket Academy Awards , Kent News, 2015-09-02. Retrieved 2016-06-01. and Ollie Robinson.Trio win Academy awards, Kent County Cricket Club 2017-08-28. Retrieved 2018-02-03."]}, {"page": "England women's cricket team", "response": ["| Tammy Beaumont ||  || Right-handed bat || — || Lightning || 5 || 77 || 91 || 12 || Central", "| 5 || Tammy Beaumont || 2009– || 82 || 74 || 2,890 || 44.46 || 168* || 13 || 8", "| 2 || Tammy Beaumont || 168* || 144 || 20 || 0 || 116.66 || Pakistan || 27 June 2016", "| 4 || Tammy Beaumont || 148 || 145 || 22 || 1 || 102.06 || South Africa || 5 July 2017", "| 3 || Tammy Beaumont || 2009– || 99", "| 4 || Tammy Beaumont || 2009– || 99 || 83 || 1,721 || 23.90 || 116 || 108.37 || 10 || 1 || 199 || 21", "| 2 || Tammy Beaumont || 116 || 52 || 18 || 4 || 223.07 || South Africa || 20 June 2018", "| 5 || Tammy Beaumont || 97 || 65 || 13 || 1 || 149.23 || New Zealand || 1 September 2021", "|rowspan=2| 9 || Tammy Beaumont || 82 || 53 || 10 || 2 || 154.71 || Pakistan || 3 July 2016"]}, {"page": "Grace Road", "response": ["| 5 || 114 || Tammy Beaumont ||  ||  115 ||  || 1 ||  || Lost"]}, {"page": "Bristol County Ground", "response": ["|Tammy Beaumont"]}, {"page": "Women's Cricket World Cup", "response": ["|2017|| Tammy Beaumont||410 Runs ", "| Tammy Beaumont & Sarah Taylor || "]}, {"page": "1991 in the United Kingdom", "response": ["** Tammy Beaumont, Professional Cricketer"]}, {"page": "Sir Roger Manwood's School", "response": ["* Tammy Beaumont, England international cricketer"]}, {"page": "Kinrara Academy Oval", "response": ["| 2 || 107 || Tammy Beaumont ||  || 141 || 1 ||  ||  || Won"]}, {"page": "Sarah Taylor (cricketer)", "response": ["In May 2016, Taylor announced she had been suffering from anxiety which she said had been adversely affecting her cricket performance. She announced a break from playing to 'prolong her career'. She resumed playing in April 2017 and in June she was selected for the 2017 Women's Cricket World Cup. In the tournament,  she and Tammy Beaumont set the record for the highest 2nd-wicket partnership in Women's Cricket World Cup history (275) in a 68-run victory over South Africa. Taylor's innings of 147 was her career best in ODIs. Taylor was a member of the winning women's team at the 2017 Women's Cricket World Cup held in England.Live commentary: Final, ICC Women's World Cup at London, Jul 23, ESPNcricinfo, 23 July 2017.World Cup Final, BBC Sport, 23 July 2017.England v India: Women's World Cup final – live!, The Guardian, 23 July 2017."]}, {"page": "List of people from Dover", "response": ["*Tammy Beaumont (born 1991), England cricketer"]}, {"page": "Tammy (given name)", "response": ["*Tammy Beaumont (born 1991), English cricketer"]}, {"page": "Alyssa Healy", "response": ["She holds the record for conceding the most number of byes as wicketkeeper in an innings of a WT20I (9), the joint most by any female wicketkeeper along with Tammy Beaumont."]}, {"page": "List of women's One Day International cricket records", "response": ["| align=\"center\"|74 || Tammy Beaumont ||  || 2009-2021"]}, {"page": "Kent Women cricket team", "response": ["The Kent Women cricket team is the women's representative cricket team for the English county of Kent. They play their home matches at County Cricket Ground, Beckenham, as well as the St Lawrence Ground and Polo Farm, both in Canterbury. They are captained by Tammy Beaumont and are coached by David Hathrill.Hathrill appointed Kent Women Head Coach, Kent County Cricket Club, 2019-11-20. Retrieved 2019-11-20. They are the most successful side in both the Women's County Championship and Women's Twenty20 Cup, with 8 and 3 titles respectively.Reid J (ed) (2016) 2016 Kent County Cricket Club Annual, Kent County Cricket Club, p.3. They are partnered with the regional side South East Stars. ", "In 1997, their first season in the County Championship, Kent finished 5th in Division One with just one win. Over the next few seasons, Kent were a consistently mid-table side, plus one season in Division Two, in 2002.  A steady improvement after their promotion, however, eventually led them to their first Championship title, in 2006. They retained their title in 2007, going unbeaten in both seasons. Key to their success was England captain Charlotte Edwards, who played for Kent from 2000 to 2016. This started an extremely successful era for Kent Women, winning the most titles in Championship history, eight, and only finishing outside the top 3 of Division 1 once, in 2017: the further times they won the Championship were in 2009, 2011, 2012, 2014, 2016 and 2019. In 2016, Kent bowlers Megan Belt, Tash Farrant and Charlotte Pape were the first, third and fourth leading wicket-takers respectively, whilst Tammy Beaumont was the leading run-scorer. Kent batters Fran Wilson, Tammy Beaumont and Maxine Blythin were all in the top ten leading run-scorers in 2019.", "|2 || Tammy Beaumont  ||  ||  || Right-handed || – || Captain ", "* Tammy Beaumont (2009)"]}, {"page": "English women's cricket team in the West Indies in 2009–10", "response": ["England's touring party was announced in September 2009, with first-choice wicket-keeper Sarah Taylor rested and batsman Claire Taylor choosing to miss the tour with work commitments. The Kent wicket-keeper Tammy Beaumont was called up to the national squad for the first time.", "*Tammy Beaumont (wicket-keeper)"]}]}}