{"wiki_id": "http://www.wikidata.org/entity/Q7694055", "itemLabel": "Teddy Morse", "itemDescription": "Footballer (1870-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Teddy_Morse", "wikipedia_page": {"main": "Edward Morse (born 1870; date of death unknown) was an English 19th-century footballer. He played 46 games (including 13 in the English Football League and 25 in the Midland League) for Burslem Port Vale in the late 1890s.", "link_mentions": [{"page": "1894–95 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Teddy Morse"]}, {"page": "1895–96 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Teddy Morse"]}, {"page": "1896–97 Burslem Port Vale F.C. season", "response": ["Supporters returned to the Athletic Ground and a crowd of 1,500 witnessed a 3–1 victory over Long Eaton Rangers on 6 March. Two away victories saw the club rise to fourth in the league, including a 1–0 win at Rushden in which Fred Belfield was \"advised to leave the field\" by the referee as the home crowd were threatening to rush the pitch in response to Belfield's repeated kicking of defender Minney. More crowd trouble also occurred in the 1–0 win at Doncaster Rovers, as Dick Evans was grabbed by the throat and Teddy Morse was \"hurled under the waggonette\". Morse was sent off in the following game, a 1–0 home defeat by Ilkeston Town, after Willett claimed he had bitten his nose. Vale went on to win their final two home fixtures, ending the campaign in seventh-place with 31 points from 28 matches, just one point away from third-place. Dick Evans finished as the club's top-scorer, claiming 12 league goals – though some of these might actually have been scored by namesake Ted Evans. The team's form in 1897 saw the club given a vote on whether they should be readmitted into the Football League at the league's annual meeting; however their 11 votes were two fewer than successful applicants Luton Town.", "|align=\"left\"|DF||align=\"left\"| Teddy Morse", "|align=\"left\"|DF||align=\"left\"| Teddy Morse", "|–||DF||||Teddy Morse||1||0||0||1"]}]}}