{"wiki_id": "http://www.wikidata.org/entity/Q7693505", "itemLabel": "Ted McDonald", "itemDescription": "Footballer (1876-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_McDonald_(footballer)", "wikipedia_page": {"main": "Edward McDonald (1876 – October 1938) was an English footballer who played at left half for Stoke, Burslem Port Vale, Notts County, and Portsmouth.", "link_mentions": [{"page": "Ted McDonald", "response": ["A very fast bowler with the ability to cause problems even on docile pitches, Ted McDonald was the unexpected bowling sensation of the 1921 Australian tour to England. He and Jack Gregory caused something approaching panic among the England batsmen: John Evans' knees were allegedly knocking together when he went out to bat, and Andy Ducat was bowled when part of his bat, broken by McDonald's pace, hit the wicket. Where Gregory was able to swing the ball both ways, McDonald imparted vicious movement off the wicket. Like later fast bowling pairs, they were devastating in combination, taking 46 wickets in the series.", "McDonald died at the age of 46, when his car collided with another near Bolton, England, on the morning of 22 July 1937.Great Bowler Passes: Tragic End of Ted McDonald, The Sporting Globe, (Wednesday, 28 July 1937), p.12.E.A. McDonald Dead: Australian Cricketer in Motor Accident: \"Awe-Inspiring Bowler\", The (Brisbane) Telegraph, (Friday. 23 July 1937), p.7.Shaw, E.A., \"One of the Greatest Fast Bowlers the Game Has Known\", The (Brisbane) Telegraph, (Friday. 23 July 1937), p.7.", "*Cricinfo Player Profile: Ted McDonald"]}, {"page": "Potteries derby", "response": ["| Ted McDonald"]}, {"page": "Edward McDonald", "response": ["*Ted McDonald (1891–1937), Australian cricketer", "*Ted McDonald (footballer) (1876–1938), English footballer "]}, {"page": "1896–97 Stoke F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Ted McDonald"]}, {"page": "1894–95 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Ted McDonald", "|–||MF||||Ted McDonald||1||0||0||1", "| July 1894 || MF ||  || Ted McDonald || Stoke || Free transfer || "]}, {"page": "1895–96 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Ted McDonald", "|–||MF||||Ted McDonald||2||0||0||2", "| August 1896 || MF ||  || Ted McDonald || Stoke || Free transfer || "]}, {"page": "1898–99 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Ted McDonald", "|5||MF||||Ted McDonald||4||0||3||7"]}, {"page": "1899–1900 Burslem Port Vale F.C. season", "response": ["Attendance figures made grim reading, and left-half Ted McDonald had to be sold to Notts County in November in order to raise cash. Goalkeeper Herbert Birchenough was sold to Glossop in January, with top scorer Howard Harvey also sold to Manchester City that same month. Their second to last match saw a mere 300 supporters turn up to watch. At the end of the season there were drastic budget cuts, even so much as to stop paying players wages over the summer period – the only club in the league to do so. Cheaper, local talent was recruited to fill the void left by departing stars. The club lost £73 over the course of the campaign, despite having trimmed ten times that figure from the playing budget.What If There Had Been No Port In The Vale?: Startling Port Vale Stories! (Witan Books, 2011, )", "|align=\"left\"|MF||align=\"left\"| Ted McDonald", "|–||FW||||Ted McDonald||0||0||1||1", "| November 1899 || MF ||  || Ted McDonald || Notts County || 'considerable' || "]}, {"page": "1897–98 Burslem Port Vale F.C. season", "response": ["Burslem Port Vale retained the entire first team of the 1896–97 campaign and strengthened the squad by signing four Stoke players: former England international right-back Tommy Clare, right-half Lucien Boullemier, left-winger Billy Heames and left-half Ted McDonald. They unveiled a new kit of red and white striped tops with blue kickers. The season opened with an \"exciting\" 2–2 draw with Burton Wanderers; the attendance at the Athletic Ground was a healthy 2,000, though Clare had trouble with his boots and played most of the match wearing just one of them. Two away defeats followed, and young reserve Frank Mitchell was then installed at centre-forward and proved an instant success, scoring a hat-trick in a 4–0 home win over Kettering. However four league defeats later the players and directors met to discuss what was going wrong; the 1–0 defeat by Barnsley St Peter's was a particular calamity as goalkeeper Tom Poole  punched the ball into his own net from an indirect free-kick.", "|align=\"left\"|MF||align=\"left\"| Ted McDonald", "|–||MF||||Ted McDonald||3||1||0||4", "| Summer 1897 || MF ||  || Ted McDonald || Stoke || Free transfer || "]}]}}