{"wiki_id": "http://www.wikidata.org/entity/Q7705627", "itemLabel": "Tessa Watts", "itemDescription": "English music video director", "wikipedia_url": "https://en.wikipedia.org/wiki/Tessa_Watts", "wikipedia_page": {"main": "Tessa Watts (born Stephanie Siddons; 25 October 1945 – 13 May 2014) was an English music video and music film producer. She worked with artists including Michael Jackson, Lionel Richie, Paul McCartney, Madonna, Phil Collins, Beyoncé, INXS, and George Michael. She is best known for her work at Virgin Records, and with MTV International.\nWatts' career started at Virgin Records, where she was one of the original members of the Virgin team. She has been credited as suggesting the company name Virgin – as all the company's members were \"virgins\" to business.As Press Officer at the record company for bands including the Sex Pistols, her work plunged Virgin into the mainstream of the punk rock era. Soon taking over all production at Virgin Records, she commissioned over 1,500 music videos, including Peter Gabriel's \"Sledgehammer\" video. \"Sledgehammer\" (1986) is the most awarded music video of all time, and won Best Video Awards in the UK, Europe (including at Cannes) and the USA. In 1999, it ranked at number four on MTV's 100 Greatest Music Videos Ever Made, and has also been declared to be MTV's number one animated video of all time. MTV later announced that it is the most played music video in the history of the station. The video was partly animated by Academy Award winner Nick Park (of Wallace and Gromit fame); the video was Park's first job at Aardman Animations.In 1986, Watts set up the programming department for the European launch of MTV. Three years later, she received a Grammy Nomination for producing Mike + The Mechanics' acclaimed music video for \"The Living Years\".In 1989, Watts was named managing director of Propaganda Films (Adaptation, Being John Malkovich) in London, working with directors including David Fincher and Michael Bay. In 2002, she began working with Sanctuary Records Group as the director of production. She was recruited by Metropolis Group in 2006 as an Executive Producer for the company's broadcast production division.", "link_mentions": [{"page": "Virgin Records", "response": ["After making the shop into a success, they turned their business into a fully fledged record label. The name Virgin, according to Branson (in his autobiography), arose from Tessa Watts, a colleague of his, when they were brainstorming business ideas. She suggested Virgin – as they were all new to business – like \"virgins\".Then Came Branson by Erik Larson at Inc Magazine Online, 1 November 1986, URL accessed 7 July 2011 The original Virgin logo (known to fans as the \"Gemini\" or \"Twins\" logo) was designed by English artist and illustrator Roger Dean: a young naked woman in mirror image with a large long-tailed lizard and the word \"Virgin\" in Dean's familiar script. A variation on the logo was used for the spin-off Caroline Records label.", "Although Virgin was initially one of the key labels of English and European progressive rock, the 1977 signing of the Sex Pistols (who had already been signed and then dropped by both EMI and A&M) reinvented the label PM in a new-wave outpost, a move that plunged the record company into the mainstream of the punk rock era. Under the guidance of Tessa Watts, Virgin's Head of Publicity (and later, also Director of Production), the Pistols rocketed the label to success.Nathan Joseph – Renaissance Man by Transatlantic Records at Transatlantic Records Online, accessed 2 June 2010. Shortly afterwards, the Nottingham record shop was raided by police for having a window display of the Sex Pistols' album Never Mind the Bollocks, Here's the Sex Pistols in the window. Afterwards they signed other new wave groups: Public Image Ltd, Boxer, Culture Club, Fingerprintz, Gillan, Holly and the Italians, Human League (whose \"Don't You Want Me\" was the label's first chart-topping single, in 1981), Magazine, Skids, the Motors, Penetration, the Ruts, Shooting Star, Simple Minds, and XTC."]}, {"page": "The History of Iron Maiden – Part 1: The Early Days", "response": ["*Tessa Watts – executive producer (The Early Days)"]}, {"page": "Death on the Road", "response": ["*Tessa Watts – producer (documentary)"]}, {"page": "Sledgehammer (Peter Gabriel song)", "response": ["The \"Sledgehammer\" video was commissioned by Tessa Watts at Virgin Records, directed by Stephen R. Johnson and produced by Adam Whittaker. Aardman Animations and the Brothers Quay provided claymation, pixilation, and stop motion animation that gave life to images in the song. Many of these techniques had been employed in earlier music videos, such as Talking Heads's 1985 hit \"Road to Nowhere\", also directed by Johnson. The style was later used in the video for \"Big Time\", another single from So."]}, {"page": "2014 in the United Kingdom", "response": ["**Tessa Watts, 68, music video producer."]}, {"page": "Deaths in May 2014", "response": ["*Tessa Watts, 68, British music video producer (\"Sledgehammer\"), pancreatic cancer.Tessa Watts obituary"]}, {"page": "Sophie Watts", "response": ["Watts was born in London, England, the daughter of music video and music film producer Tessa Watts - one of the pioneers of the music video industry at Virgin Records - and rock journalist and newspaper editor Michael Watts. She has publicly protested the publication of her relationship to the prominent Whitney family, of which she is a direct heir, including to the New York Times, citing misrepresentation and security issues. She grew up in London and Bedfordshire and attended Gonville and Caius College at the University of Cambridge. She graduated with First-Class Honours (summa cum laude) in Economic History (Master's), and was awarded recognition as a Senior Scholar of her college, where she wrote a thesis on the economic rise and might of Asia, notably in China and India."]}, {"page": "One Blue Voice", "response": ["* Tessa Watts - executive producer"]}]}}