{"wiki_id": "http://www.wikidata.org/entity/Q7704066", "itemLabel": "Terry Armstrong", "itemDescription": "British footballer (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Armstrong", "wikipedia_page": {"main": "Terence Armstrong (born 10 July 1958) is an English former footballer who played as a midfielder for Huddersfield Town and Port Vale in a nine-year career in the Football League. He helped Port Vale to win promotion out of the Fourth Division in 1982–83. He later played non-league football for Nuneaton Borough and Northwich Victoria.", "link_mentions": [{"page": "John McGrath (footballer, born 1938)", "response": ["McGrath spent the 1980–81 season attempting to whip his charges into shape, whilst Vale fans patiently awaited the true results of a manager they quickly built faith in. The only new signings he could afford to make were free signings John Allen from Leicester City and Trevor Brissett from Stoke City. Vale exited the FA Cup at the Third Round following a humiliating 3–0 defeat to non-league side Enfield. They initially struggled away from home, but built their league campaign on results at Vale Park. During the season, he handed Mark Chamberlain (brother of top-scorer Neville) his debut, and brought talented winger Johnny Miller to Burslem. He sold goalkeeper Trevor Dance to non-league Stafford Rangers for £10,000, as Harrison was in good form. At the way mid-way stage he brought in midfielder Terry Armstrong and big defender Andy Higgins. He solved the team's poor away form by installing a five-man defence."]}, {"page": "1978–79 Huddersfield Town A.F.C. season", "response": ["|Terry Armstrong||||FW||15 (2)||1||0||0||0||0||15 (2)||1"]}, {"page": "1977–78 Huddersfield Town A.F.C. season", "response": ["|Terry Armstrong||||FW||17 (2)||1||0||0||0||0||17 (2)||1"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Terry Armstrong||||1976–1981||36 (4)||2||0||0||0||0||0||0||0||0||36 (4)||2"]}, {"page": "Russell Bromage", "response": ["However he refused to sign a new contract for the 1983–84 season, as did teammates Geoff Hunter, Barry Siddall, and Terry Armstrong. He eventually walked out on the club, and played two Second Division games for Oldham Athletic in October. However he returned to Vale Park in November, and agreed to sign a new contract. He went on to finish the campaign with 42 appearances, scoring one goal against Wigan Athletic, as the club were relegated under new manager John Rudge."]}, {"page": "1980–81 Port Vale F.C. season", "response": ["In December, John Rudge was upgraded from coach to assistant manager. However, poor league form continued; on 27 December Vale lost 5–1 to Northampton Town at the County Ground, and Phil Sproson was sent off for swearing at teammate Russell Bromage. More away defeats came, with the Vale defence insistent on playing dangerous balls on the outside of their penalty area. On 24 January, they lost 5–0 at Field Mill to Mansfield Town, this left them at the foot of the league, four points adrift of safety. McGrath brought in two new signings: big defender Andy Higgins from Chesterfield and midfielder Terry Armstrong; Higgins was restricted mainly to away matches as there the team needed the added strength and height that he provided. He also signed keeper Brian Lloyd on loan from Chester City, and the former Wales international proved to be a revelation. McGrath then installed a five-man defence away from home, the tactic proved a success, as Vale avoided defeat in all but two of their final eight away games. McGrath later reflected that \"that Mansfield match was a dreadful experience, I simply could not wait any longer before taking some action; we had to get some better players.\" Vale went on a streak of seven games unbeaten, recording a 4–0 win over fellow strugglers Hereford United. On 26 April, the club started a club-record run of six consecutive draws, which would end on 12 September the next season. Their goalless draw with Crewe Alexandra at Gresty Road assured them of safety from re-election.", "|align=\"left\"|MF||align=\"left\"| Terry Armstrong", "|11||MF||||Terry Armstrong||2||0||0||2", "| February 1981 || MF ||  || Terry Armstrong || Huddersfield Town || Free transfer || "]}, {"page": "1981–82 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Terry Armstrong", "|–||MF||||Terry Armstrong||1||1||0||2"]}, {"page": "1982–83 Port Vale F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Terry Armstrong", "|3||MF||||Terry Armstrong||7||0||0||7"]}, {"page": "1983–84 Port Vale F.C. season", "response": ["The pre-season saw John McGrath pay Wigan Athletic £10,000 for Ireland international Eamonn O'Keefe. He also brought in three players on free transfers: Tommy Gore (Bury), Gary Pollard (Chesterfield), and Chris Pearce (Rochdale). The club reported record season ticket sales, however several players refused to sign new contracts. As a result, Barry Siddall, Russell Bromage, Geoff Hunter, and Terry Armstrong remained on weekly contracts.", "|align=\"left\"|MF||align=\"left\"| Terry Armstrong", "|–||MF||||Terry Armstrong||2||0||0||0||2"]}, {"page": "1984–85 Port Vale F.C. season", "response": ["On the financial side, a loss was made of £7,793 due to a 20% drop in attendance figures. The wage bill stood at £389,341, whilst gate receipts took in £128,954 and the lottery raised £191,000. The club's shirt sponsors were EDS. Five players left on free transfers, most significant were the departures of: Terry Armstrong and Derek Monaghan (retired); Colin Tartt (Shepshed Charterhouse); and Ian Griffiths (Wigan Athletic). Billy Kellock also refused terms, and so joined Halifax Town, whilst John Ridley joined Stafford Rangers as a player-coach. Vale received £700 following a tribunal claim, becoming the first Football League club to take a non-league club to a tribunal.", "|align=\"left\"|MF||align=\"left\"| Terry Armstrong", "| May 1985 || MF ||  || Terry Armstrong || Nuneaton Borough || Free transfer || "]}]}}