{"wiki_id": "http://www.wikidata.org/entity/Q7705620", "itemLabel": "Tessa Ross", "itemDescription": "An award winning English film producer.", "wikipedia_url": "https://en.wikipedia.org/wiki/Tessa_Ross", "wikipedia_page": {"main": "Tessa Sarah Ross CBE (born 1961) is an English film producer and executive. She was appointed Head of Film at Channel 4 in 2000 and ran Film4 and Film4 Productions from 2002 to 2014. Ross was appointed to the Board of the Royal National Theatre in 2011, and became Chief executive in 2014. She resigned in April 2015, citing concerns over the new leadership structure, but remained working with the National Theatre as a consultant. Ross received the BAFTA Award for Outstanding British Contribution to Cinema Award and was named as one of the 100 most powerful women in the United Kingdom by Woman's Hour in 2013. She is an honorary fellow of the National Film and Television School. In the 2010 New Year Honours, she was appointed a CBE for services to broadcasting.Ross has been the executive producer of a number of notable British films, including Billy Elliot (2000), The Last King of Scotland (2006), This Is England (2006), Happy-Go-Lucky (2008), Slumdog Millionaire (2008), Hunger (2008), Four Lions (2010), 127 Hours (2010), Shame (2011), 12 Years a Slave (2013), Under the Skin (2013), Ex Machina (2015), 45 Years (2015), Room (2015), and Carol (2015).", "link_mentions": [{"page": "List of people educated at Westminster School", "response": ["*Tessa Ross (born 1961), National Theatre director"]}, {"page": "Baillie Gifford Prize", "response": ["The longlist for the 2015 prize was announced on 22 September and the shortlist was announced on 11 October. The 2015 judging panel was chaired by Pulitzer prize-winning historian and journalist Anne Applebaum, together with Editor of Intelligent Life Emma Duncan, Editor of New Scientist Sumit Paul-Choudhury, Director of China Centre at Oxford University Professor Rana Mitter and former Controller of Film and Drama and Head of Film 4 Tessa Ross."]}, {"page": "National Film and Television School", "response": ["*Tessa Ross, CBE"]}, {"page": "Film4", "response": ["Also in the same year, Tessa Ross became the head of both FilmFour and Channel 4 drama. FilmFour World and Extreme were discontinued on 5 May 2003 and replaced by FilmFour Weekly, which screened four movies across the week at the same time each day to make it easier to catch at least once."]}, {"page": "Film4 Productions", "response": ["Tessa Ross was head of both Film4 and Channel 4 drama from 2002 to 2014."]}, {"page": "Edinburgh International Television Festival", "response": ["Over the years, the Festival has attracted industry figures including Kevin Spacey, Rupert Murdoch, Ted Turner, Ricky Gervais, Vince Gilligan, Tessa Ross, Jamie Oliver, Simon Cowell, Ted Sarandos and Elisabeth Murdoch, as well as people from related fields such as Al Gore and Germaine Greer."]}, {"page": "Tessa", "response": ["* Tessa Ross (born 1961), English film producer"]}, {"page": "The Lovely Bones (film)", "response": ["An international co-production between the United States, the United Kingdom, and New Zealand, the film was produced by Carolynne Cunningham, Walsh, Jackson, and Aimee Peyronnet, with Steven Spielberg, Tessa Ross, Ken Kamins, and James Wilson as executive producers. Principal photography began in October 2007 in New Zealand and Pennsylvania. The film's score was composed by Brian Eno."]}, {"page": "BFI London Film Festival", "response": ["*Best British Newcomer Award: Lenny Crooks, Christine Langan, Tessa Ross, Tanya Seghatchian, Michael Hayden, Sandra Hebron"]}, {"page": "London Film School", "response": ["*Tessa Ross"]}, {"page": "Christine Langan", "response": ["After graduating from Cambridge University in 1987, Langan spent three years working as a copywriter for an advertising company.Macnab, Geoffrey (12 November 2009). \"In the loop\" (subscription access). Screen International (Emap Media). Retrieved on 20 February 2010. She also contributed film reviews to BBC Radio 2's Cinema 2 programme. In 1990, Langan began her career in film production as an assistant developer for Tessa Ross at British Screen. The following year, she responded to an advertisement for a script editor at Granada Television's drama serials department, located in Manchester. She was hired by David Liddiment, and worked mainly on Granada's daytime soap operas."]}, {"page": "Primetime Emmy Award for Outstanding Television Movie", "response": ["| Juliette Howell, Tessa Ross and James Graham, executive producers; Lynn Horsford, producer"]}, {"page": "Christian de Boisredon", "response": ["Phyllida Lloyd, the director of The Iron Lady (starring Meryl Streep) and Mamma Mia! (the biggest hit ever made by a female director and 5th biggest hit of 2008) is attached to the project as well as David Thompson, former head of BBC Films and Tessa Ross, head of Film 4 and coproducer of Slumdog Millionnaire among other films.Hollywood reporter (may 14 2009)Variety (may 14 2009)"]}, {"page": "In a Land of Plenty", "response": ["In A Land Of Plenty is a 10-episode British television drama serial produced by Sterling Pictures and Talkback for BBC Two in the United Kingdom. Adapted for television by Kevin Hood and Neil Biswas from the novel by Tim Pears. It was first broadcast in the United Kingdom in 2001 and describes a sprawling family saga taking place from the 1950s to the 1990s in England. Through the lives, deaths, tragedies and loves of the Freeman family, the series charts how Britain was shaped after World War II. It was subsequently broadcast in the USA on BBC America. The show was co-financed between WGBH-TV and the BBC and was produced by Michael Riley and John Chapman. Executive Producers were Peter Fincham and Tessa Ross."]}, {"page": "David Abraham (television executive)", "response": ["Abraham increased funding for Film4 in 2010 and again in 2016 and the film division led by Tessa Ross and subsequently David Kosse. In 2016 Abraham appointed Daniel Battsek to lead Film 4 following the leaving of David Kosse to join STX."]}, {"page": "On the Road (2012 film)", "response": ["On the Road () is a 2012 adventure drama film directed by Walter Salles. It is an adaptation of Jack Kerouac's 1957 novel On the Road and stars an ensemble cast featuring Garrett Hedlund, Sam Riley, Kristen Stewart, Alice Braga, Amy Adams, Tom Sturridge, Danny Morgan, Elisabeth Moss, Kirsten Dunst, and Viggo Mortensen. The executive producers were  Francis Ford Coppola, Patrick Batteux, Jerry Leider, and Tessa Ross. Filming began on August 4, 2010, in Montreal, Quebec, with a $25 million budget. The story is based on the years Kerouac spent travelling the United States in the late 1940s with his friend Neal Cassady and several other Beat Generation figures who would go on to fame in their own right, including William S. Burroughs and Allen Ginsberg. On May 23, 2012, the film premiered in competition for the Palme d'Or at the 2012 Cannes Film Festival. The film received mixed early reviews after it premiered at the film festival. The film also premiered at the 2012 Toronto International Film Festival in September."]}, {"page": "66th British Academy Film Awards", "response": ["Stephen Fry hosted the ceremony, where Argo won Best Film and Best Director for Ben Affleck. Daniel Day-Lewis won Best Actor for Lincoln and Emmanuelle Riva won Best Actress for Amour. Christoph Waltz won Best Supporting Actor for Django Unchained and Anne Hathaway won Best Supporting Actress for Les Misérables. Skyfall, directed by Sam Mendes, was voted Outstanding British Film of 2012. Sir Alan Parker received the BAFTA Fellowship and Tessa Ross garnered the BAFTA Outstanding British Contribution to Cinema Award.", "* Tessa Ross"]}, {"page": "BAFTA Outstanding British Contribution to Cinema Award", "response": ["| Tessa Ross"]}, {"page": "List of British films of 2013", "response": ["* Tessa Ross (Outstanding British Contribution to Cinema)"]}, {"page": "Carol (film)", "response": ["Carol had been in development since 1997, when Nagy wrote the first draft of the screenplay. British company Film4 Productions and its then-chief executive Tessa Ross financed development. The film had a troubled development period, facing problems with financing, rights, scheduling conflicts, and accessibility. Number 9 Films came on board as a producer in 2011, when Elizabeth Karlsen secured the rights to the novel. The film is co-produced by New York-based Killer Films, which joined the project in 2013 after Haynes's collaborator Christine Vachon approached him to direct. Principal photography on the British-American production began in March 2014, in Cincinnati, Ohio, and lasted 34 days. Cinematographer Edward Lachman shot Carol on Super 16 mm film.", "While searching for investors, Nagy and Berwin learned that the characters' homosexuality was not as much of an obstacle as that they were women. \"Having two women leads was the issue\", Nagy noted. In 2015, Berwin said that, in those days, it was a risky idea to play the role of Carol. \"As a project it came together with Cate Blanchett. You needed to always start with her role\". Film4 Productions and Tessa Ross financed the development of the film and kept it alive through the years, as it \"underwent a decade-plus of revision under various directors and investors\"—including Hettie MacDonald, Kenneth Branagh, Kimberly Peirce, John Maybury, and Stephen Frears—until the project completely stalled. The long delay was a result of struggles with funding, rights, and trepidations about a film with a gay theme and two female leads. \"During its development, there was a very different kind of lesbian or gay movie that got financed\", Nagy said. \"They were very agenda or issue driven, and this was not. In fact it insists on not being that in order to make the point. I would talk about that with financiers, and I could see them glaze over.\"", "British producer Elizabeth Karlsen of Number 9 Films came across Nagy's script around 2004, when she was co-producing Mrs. Harris with Christine Vachon of New York-based Killer Films. Berwin's rights to The Price of Salt expired in 2010, and Karlsen thereafter acquired the script. Berwin remained an executive producer on the film. Karlsen managed to convince Highsmith's estate to sign over the rights, closing the deal with Tessa Ross in late 2011. She then persuaded a disillusioned and reluctant Nagy to come back on board. The producers hired a UK director, who then dropped out because of scheduling conflicts. They later recruited Irish director John Crowley, who was announced in May 2012 along with the lead cast, Cate Blanchett and Mia Wasikowska, and the involved producers, Karlsen and Stephen Woolley of Number 9 Films and Tessa Ross of Film4, who received executive producer credit. Carol was scheduled to commence filming in early 2013, until Crowley withdrew due to a scheduling conflict. Karlsen called Vachon to discuss losing another director, and Vachon told her that Haynes's new film was not going to happen because its star had also backed out. They then decided to approach Haynes. Vachon, Haynes's frequent collaborator, asked if he would be interested, and he received a copy of the screenplay. Two days later he committed to direct, and Vachon joined as a producer. Haynes was announced as director on May 22, 2013. Three days later, The Weinstein Company acquired U.S. distribution rights at the Cannes Film Festival from HanWay Films."]}, {"page": "List of honorary fellows of Somerville College, Oxford", "response": ["* Tessa Ross"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Tessa Ross CBE (1961), film producer and executive; received the BAFTA Outstanding British Contribution to Cinema Award and was named as one of the 100 most powerful women in the United Kingdom by Woman's Hour in 2013; executive producer of 12 Years a Slave, 127 Hours, Billy Elliot and Ex Machina"]}, {"page": "Sue Bruce-Smith", "response": ["Film4 director Tessa Ross personally called Bruce-Smith to entice her back to the \"recalibrated\" Film4, and she became head of commercial development and distribution. She was said to be swayed back to Film4 because it would involve work in public service filmmaking, \"which she was instinctively drawn to with its sense of remit and social purpose\". In 2008, she was one of the co-founders of film sales company Protagonist Pictures as part of a Film4-Ingenious Media-Vertigo Films venture, marking Film4's move back into international distribution, something that Ross' rebrand had ended in 2002. Rose Garnett wrote in her obituary for The Guardian that Bruce-Smith spent \"much of her long and influential tenure [at Film4 working] with Tessa Ross\". Interviewed in 2014, Ross said that Bruce-Smith \"comes to editorial meetings, she reads scripts early on, we talk about ideas, we often talk about directors and producers, and matching people up. She's very involved the minute we decide to move things into production – in conversations about scale and value, and how things should be built, she's unbelievably involved\". Ross left Film4 in 2014."]}, {"page": "Trigonometry (TV series)", "response": ["It was announced in October 2017 that Piers Wenger and Peter Hollands of the BBC had commissioned Trigonometry, an 8 30-minute episode drama produced by House Productions and written by Duncan Macmillan and Effie Woods. Executive producers included Tessa Ross and Juliette Howell of House and Tommy Bulfin of the BBC."]}]}}