{"wiki_id": "http://www.wikidata.org/entity/Q7704900", "itemLabel": "Terry Patchett", "itemDescription": "British politician (1940-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Patchett", "wikipedia_page": {"main": "Terry Patchett (11 July 1940 – 11 October 1996) was a politician in the United Kingdom.\nPatchett served as Member of Parliament for Barnsley East from 1983 until his death, and was a member of the Labour Party.", "link_mentions": [{"page": "Socialist Campaign Group", "response": ["* Terry Patchett (resigned 1991)"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Terry Patchett"]}, {"page": "James Clappison", "response": ["He contested the safe Labour parliamentary seat of Barnsley East at the 1987 general election where he came second, some 23,511 votes behind Terry Patchett. He also contested the Yorkshire South European Parliament seat at the Euro elections of 1989. He was selected to fight the May 1990 Bootle by-election following the death of Allan Roberts. He was defeated by Mike Carr by 23,517 votes. Carr served as the Labour MP for Bootle for just 57 days before he died of a heart attack on 20 July 1990. Clappison contested Bootle again at the November by-election where he was defeated heavily once more by the new Labour candidate Joe Benton to the tune of 19,465 votes. He was rewarded for his efforts by securing the nomination for the safe Conservative seat of Hertsmere, which became vacant on the retirement of Cecil Parkinson. James Clappison was safely elected at the 1992 general election with a majority of 18,735. He made his maiden speech on 19 May 1992, during which he spoke of the organised crimes and anti-Semitism against his Jewish constituents."]}, {"page": "Jeffrey Ennis", "response": ["Ennis was elected to the House of Commons at the 1996 Barnsley East by-election following the death of Terry Patchett. Jeff Ennis held the seat at the 12 December 1996 by-election with a majority of 13,181. He made his maiden speech on 14 January 1997. A few months after his election to Westminster he had to go back to his electorate at the 1997 general election for the newly drawn Barnsley East and Mexborough seat, following the redrawing of boundaries and the abolishment of the former Barnsley East. At the election he doubled his majority to 26,763."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Terry Patchett"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Terry Patchett"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Terry Patchett"]}, {"page": "List of United Kingdom MPs: P", "response": ["*Terry Patchett"]}, {"page": "Barnsley East (UK Parliament constituency)", "response": ["| Terry Patchett", "Following the death of Terry Patchett on 11 October 1996, a by-election was held on 12 December 1996. The replacement Labour candidate Jeff Ennis held the seat for the party despite a low voter turnout."]}, {"page": "1994 Labour Party leadership election", "response": ["| Terry Patchett || Prescott || Spoilt"]}, {"page": "1996 Barnsley East by-election", "response": ["The Barnsley East by-election was held on 12 December 1996, following the death of the Labour Party Member of Parliament Terry Patchett for Barnsley East, in South Yorkshire, England, on 11 October."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Terry Patchett, Barnsley East, 1983–96"]}, {"page": "1996 in the United Kingdom", "response": ["* 11 October – Terry Patchett, Labour Member of Parliament (born 1940)"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Terry Patchett || John Prescott || Spoilt"]}, {"page": "Patchett", "response": ["*Terry Patchett (1940–1996), politician in the United Kingdom"]}, {"page": "Deaths in October 1996", "response": ["*Terry Patchett, 56, British politician, cancer."]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Terry Patchett (in office)"]}]}}