{"wiki_id": "http://www.wikidata.org/entity/Q770183", "itemLabel": "Augustus Granville", "itemDescription": "Italian physician and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Augustus_Granville", "wikipedia_page": {"main": "Augustus Bozzi Granville MD, FRS (born Augusto Bozzi, 7 October 1783 – 3 March 1872) was a physician, writer, and Italian patriot.Born in Milan, he studied medicine before leaving to avoid being enlisted in Napoleon's army. After practicing medicine in Greece, Turkey, Spain, and Portugal, he joined the British Navy and sailed to the West Indies. There he learned English and married an Englishwoman. He later moved to London, where he practiced as a physician and writer. He is credited with carrying out the first medical autopsy on an Ancient Egyptian Mummy which he described to the Royal Society of London in 1825.", "link_mentions": [{"page": "Bournemouth", "response": ["Before it was founded in 1810 by Lewis Tregonwell, the area was a deserted heathland occasionally visited by fishermen and smugglers. Initially marketed as a health resort, the town received a boost when it appeared in Augustus Granville's 1841 book, The Spas of England. Bournemouth's growth accelerated with the arrival of the railway, and it became a town in 1870. Part of the historic county of Hampshire, Bournemouth joined Dorset for administrative purposes following the reorganisation of local government in 1974. Through local government changes in 1997, the town began to be administered by a unitary authority independent of Dorset County Council, although it remains part of that ceremonial county. Since April 2019 the unitary authority has been merged with that of Poole, as well as the non-metropolitan district of Christchurch to create the Bournemouth, Christchurch and Poole unitary authority.", "After the death of Tapps in 1835, his son Sir George William Tapps-Gervis inherited his father's estate. He hired the young local architect Benjamin Ferrey to develop the coastal area on the east side of the stream.Emery (p.16) Bournemouth's first hotel, later to become part of the Royal Bath Hotel, opened in 1838 and is one of the few buildings designed by Ferrey still standing and operating. Bournemouth grew at a faster rate as Tapps-Gervis began developing the area similarly to the south coast resorts of Weymouth and Brighton. Despite enormous investment, the town's share of the market remained modest. In 1841 Tapps-Gervis invited the physician and writer Augustus Granville to stay. Granville was the author of The Spas of England, which described health resorts around the country, and as a result of his visit, he included a chapter on Bournemouth in the second edition of his book. The publication of the book, and the increase in visitors seeking the medicinal use of seawater and the pine-scented air, helped the town to grow and establish itself as an early tourist destination.Edwards (pp.38–40)Ashley & Ashley (pp.10–11)"]}, {"page": "Adipocere", "response": ["In 1825, physician and lecturer Augustus Granville is believed to have (somewhat unwittingly) made candles from the adipocere of a mummy and used them to light the public lecture he gave to report on the mummy's dissection.  Granville apparently thought that the waxy material from which he made the candles had been used to preserve the mummy, rather than its being a product of the saponification of the mummified body."]}, {"page": "Charles Hindley (politician)", "response": ["Hindley died in Westminster 30 November 1857, reportedly of heart disease, aged 61. Augustus Granville, Hindley's doctor, later alleged that Hindley had been suffering from delirium, hallucination, and inflammation of the brain, but had been recovering thanks to the treatments ordered by Granville (mustard plasters, bleeding,  calomel, and antimony), which had been effective on four or five similar past episodes.  However, without consulting Granville, Hindley's son-in-law had called in Robert Bentley Todd, FRS, FRCS.  The Dictionary of National Biography entry for Todd notes \"Todd was the first to lay down definite principles for the treatment of specially serious cases of fever, such as influenza and rheumatic fever, besides inflammations associated with exhaustion in which life was in jeopardy. In these cases Todd proved from patient observation the desirability of a steady administering of alcoholic stimulants at short intervals, day and night, while the danger lasted. By this treatment not only was the strength maintained, but the period of convalescence was shortened.\" According to Granville, Todd had taken a less sanguine view of Hindley's case than Granville (\"the patient is slipping through your fingers from delirium tremens\") and insisted that Hindley should take an ounce of brandy every  half-hour, reducing this to half-an-ounce every half-hour on the representations of Granville, but soon reverting to the higher dosage. By the time Hindley died he had taken six pints of brandy in seventy-two hours;  Granville alleged that although Hindley's death certificate gave the cause of death as 'cerebral affectation', Todd had caused Hindley's death by 'an obstinate adherence to one of the most pernicious practices ever palmed upon an ignorant public', but Granville made no mention of this in the two years between Hindley's death and Todd's. "]}, {"page": "Augustus Bozzi Granville", "response": ["#REDIRECT Augustus Granville"]}, {"page": "Granville (name)", "response": ["*Augustus Granville (1783–1872), Italian physician, writer, and patriot"]}]}}