{"wiki_id": "http://www.wikidata.org/entity/Q7704087", "itemLabel": "Terry Barnes", "itemDescription": "English cricketer (born 1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Barnes", "wikipedia_page": {"main": "Terence Harold Barnes (born 22 October 1945) was a former English cricketer.  Barnes was a left-handed batsman who bowled left-arm medium pace.  He was born at Grantham, Lincolnshire.\nBarnes made his Minor Counties Championship debut for Lincolnshire in 1964 against the Nottinghamshire Second XI.  From 1964 to 1976, he represented the county in 36 Championship matches, the last of which came against Staffordshire. It was for Lincolnshire that he made his debut in List A cricket, against Northumberland in the 1st round of the 1971 Gillette Cup.  From 1971 to 1976, he represented the county in 5 List A matches, the last of which came against Derbyshire in the 1st round of the 1976 Gillette Cup.  While playing for Lincolnshire, Barnes was also selected to represent Minor Counties North in the 1974 Benson and Hedges Cup against Derbyshire.  During his time at Lincolnshire he took over 200 wickets.\nFollowing his 12-year spell with his home county, Barnes joined Norfolk, making his Minor Counties Championship debut for them against his former county, Lincolnshire.  From 1977 to 1982, he represented Norfolk in 50 Championship matches, the last of which came against Buckinghamshire.  He made just a single List A appearance for the county against Leicestershire in the 1st round of the 1982 NatWest Trophy.  Over the five years at Norfolk he again took over 200 wickets.\nAfter his spell with Norfolk, Barnes moved to Wiltshire for the 1983 season, making his Minor Counties Championship debut for the county against Cheshire.  From 1983 to 1984, he played 11 Championship matches for Wiltshire, the last of which came against Devon.  Barnes joined Wiltshire in the same season that the MCCA Knockout Trophy competition began.  He made his Trophy debut against Shropshire, and from 1983 to 1984, he represented Wiltshire in 4 Trophy matches, the last of which came against Dorset.  Barnes played his final List A matches for Wiltshire, representing them in two games against Northamptonshire in the 1st round of the 1983 NatWest Trophy and Leicestershire in the 1st round of the 1984 NatWest Trophy.Barnes played a total of nine List A matches for four different teams.  In those nine matches, he scored 14 runs at a batting average of 4.66 and a high score of 13.  With the ball he took 8 wickets at a bowling average of 50.00, with best figures of 2/95.\n\n", "link_mentions": [{"page": "Terry Barnes (cricketer, born 1945)", "response": ["#REDIRECT Terry Barnes"]}, {"page": "List of Minor Counties North List A players", "response": ["*Terry Barnes (1974): TH Barnes"]}, {"page": "List of Lincolnshire County Cricket Club List A players", "response": ["*Terry Barnes (1971–1976): TH Barnes"]}]}}