{"wiki_id": "http://www.wikidata.org/entity/Q7702520", "itemLabel": "Terl Bryant", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Terl_Bryant", "wikipedia_page": {"main": "Terl Bryant is an English musician. His early career saw him working with US singer/songwriter and filmmaker Steve Taylor and later was part of former Bauhaus singer, Peter Murphy's band. During the 90s he went on to join influential folk-themed progressive band Iona and in 1999 joined former Led Zeppelin bassist and multi-instrumentalist John Paul Jones as part of his trio with Chapman stick player Nick Beggs.", "link_mentions": [{"page": "John Paul Jones (musician)", "response": ["Zooma, his debut solo album, was released in September 1999 on Robert Fripp's DGM label and followed up in 2001 by The Thunderthief.  Both albums were accompanied by tours, in which he played with Nick Beggs (Chapman Stick) and Terl Bryant (drums)."]}, {"page": "Iona (band)", "response": ["By the time Iona released their first self-titled album in 1990, drummer Terl Bryant, bassist Nick Beggs (formerly the bassist of Kajagoogoo), Fiona Davidson on Celtic harp, Peter Whitfield on strings, Troy Donockley on Uilleann pipes and percussionist Frank van Essen had joined the band. The first album Iona concentrated mostly on the history of the island of Iona, from which the band got its name.", "Iona returned in 1992 with The Book of Kells, a concept album with several tracks based on pages from the eponymous book. Terl Bryant took over on drums and percussion for this album after the departure of Frank van Essen. Fitzgerald left the band that year to pursue a degree in music. Beyond These Shores, the band's third album, was released in 1993 and included guest musician Robert Fripp. The album was loosely based on the legendary voyage of St. Brendan to the Americas before Christopher Columbus, but the band did not intend for it to be viewed strictly as a \"concept album\".", "Two live albums followed in the late 1990s: the double-disc Heaven's Bright Sun and Woven Cord, which was performed with the All Souls Orchestra. Terl Bryant departed the band between these two albums, and Frank van Essen returned to fill the vacant spot, playing drums as well as violin, which could be heard on the band's 2000 album, Open Sky.", "* Terl Bryant – drums"]}, {"page": "Steeleye Span", "response": ["* Terl Bryant – drums, percussion ", "* Terl Bryant – drums, percussion", "   bar:Bryant       text:\"Terl Bryant\""]}, {"page": "Trilok Gurtu", "response": ["In 2010, Trilok Gurtu played on the album Piano Car, an opera of minimalist composer Stefano Ianne with Ricky Portera, Nick Beggs (Kajagoogoo), Mario Marzi, Terl Bryant (John Paul Jones/Led Zeppelin), John De Leo."]}, {"page": "Elizabeth McGovern", "response": ["McGovern is also a singer-songwriter and plays the guitar. In 2008 she began fronting the band Sadie and the Hotheads at The Castle pub venue in Portobello Road, London. The band released an album of songs she developed with The Nelson Brothers, who are now part of the band. The album, I Can Wait, also includes Ron Knights on bass and Rowan Oliver, borrowed from Goldfrapp, as drummer for the recording sessions. Michelle Dockery, who plays McGovern's eldest daughter in Downton Abbey, has occasionally sung with the band.The Times, interview with Michelle Dockery, 6 November 2010 Dockery was also a guest backing vocalist on the bands second album How Not To Lose Things, released in 2012.Independent, interview with Elizabeth McGovern, 1 December 2012 Terl Bryant also joined the band, taking over from Rowan Oliver as drummer and percussionist."]}, {"page": "Deep (Peter Murphy album)", "response": ["* Terl Bryant – drums, percussion"]}, {"page": "Love Hysteria", "response": ["*Terl Bryant - drums, percussion"]}, {"page": "The Thunderthief", "response": ["* Terl Bryant – drums, percussion, toforan"]}, {"page": "Heaven's Bright Sun", "response": ["*Terl Bryant - drums, percussion"]}, {"page": "Journey into the Morn", "response": ["* Terl Bryant - drums, percussion"]}, {"page": "Beyond These Shores", "response": ["* Terl Bryant - Drums, Percussion"]}, {"page": "The Book of Kells (album)", "response": ["* Terl Bryant - Drums, Percussion"]}, {"page": "Iona (album)", "response": ["* Terl Bryant – Drums, Percussion"]}, {"page": "The Unseen Stream", "response": ["This recording shows Troy as a multi-skilled wood player. His main instrument is the Uilleann Pipes adding also Low Whistles, Electric and Acoustic Guitars, Keys, Cittern and Mandolin, and he has composed most of the tracks. Although a solo recording he includes guests Irish fiddler Nollaig Casey, piano player Neil Drinkwater, his Iona colleagues Joanne Hogg (voice), Terl Bryant (percussion) and Tim Harries (bass), the Emperor String Quartet and Duncan Rayson on the Rochdale Town Hall Organ. The piece draws on Irish Orchestral works, folk, rock, jazz, Scandinavian symphonies and New Age stylistically.", "*Terl Bryant - Percussion (Cymbals, Gong, Bodhrans, Bells, Various Drums)"]}, {"page": "Timbrel (album)", "response": ["Timbrel is an album by Terl Bryant. Released in 1999.", "This is an album from ex Iona drummer Terl Bryant. The rhythms of praise flow through these psalms performed by Terl and a group including the talents of Joanne Hogg, Juliet Bryant, Charlie Groves, Ali Groves, Bruce Pont, Troy Donockley, Mike Haughton, Dave Bainbridge, Phil Parker.", "* Terl Bryant – Drums, Percussion, Bodhrans, Rainstick, Antique Snare Drums, Effect Cymbals, Spanner Chimes, Finger Cymbals, Zibel and Floor Toms, Key Chimes, Earth Plates, Burma Bell, Pin Chimes, Gong, Dholak, Tambourine, Bongos, Sally Army Bass Drum", "*Terl Bryant", "Category:Terl Bryant albums"]}, {"page": "Beauty...As Far as the Eye Can See", "response": ["Beauty...As Far as the Eye Can See is an album by Terl Bryant. Released in 1997.", "This is an album from ex-Iona drummer Terl Bryant.", "* Terl Bryant - drums, percussion", "Category:Terl Bryant albums"]}, {"page": "Psalm (Terl Bryant album)", "response": ["Psalm is an album by ex-Iona drummer Terl Bryant released in 1993.", "* Terl Bryant – drums, percussion", "* Produced by Terl Bryant ", "Category:Terl Bryant albums"]}, {"page": "Intimacy (Matt Redman album)", "response": ["* Terl Bryant – drums", "** Terl Bryant"]}, {"page": "Blessed Be Your Name: The Songs of Matt Redman Vol. 1", "response": ["* Terl Bryant – drums, percussion"]}, {"page": "Bryant (surname)", "response": ["* Terl Bryant, British drummer, member of the band Iona"]}]}}