{"wiki_id": "http://www.wikidata.org/entity/Q7704384", "itemLabel": "Terry Fleming", "itemDescription": "English footballer and manager (born 1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Fleming", "wikipedia_page": {"main": "Terence Maurice Fleming (born 5 January 1973) is an English football manager, coach and former professional footballer.\nHe played as a midfielder from 1991 to 2016, a career spanning 25 years. During his professional career he notably played for Lincoln City, Cambridge United having started his career at Coventry City, where he played in the very first season of the Premier League. He also had spells with Northampton Town, Preston North End, Plymouth Argyle, Grimsby Town and Kidderminster Harriers before going to play for Non-League side's Moor Green, Halesowen Town and Grantham Town. In 2008, he joined Lincoln United and went on to manage the club from 2011 and 2013. In August 2015 he signed for Boston Town, continuing his playing career beyond his 43rd birthday.", "link_mentions": [{"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Terry Fleming||||MF||2004–2005||43||2"]}, {"page": "Stephen Cooke", "response": ["On 3 August 2007, Halesowen Town confirmed that Cooke had joined the club along with two other former League players, in the shape of Terry Fleming and Duane Darby.Triple coup for ambitious Yeltz . Nonleaguedaily.com (1 January 2003)."]}, {"page": "Duane Darby", "response": ["On 3 August 2007, Halesowen Town confirmed that Darby had joined the club along with two other former league players, in the shape of Terry Fleming and Stephen Cooke."]}, {"page": "Gavin Gordon (footballer)", "response": ["In October 2012, he was appointed to act as coach to Kris Jones who had taken over the running of Sleaford Town's reserve team in the Lincolnshire Football League. He also made occasional appearances for the team, debuting in the 2–0 home defeat to Grimsby Borough Reserves on 13 October 2012 and making 3+4 league appearances in which he netted three times including a brace against Louth Town Reserves. In June 2013, with Kris Jones having been promoted to first team manager, Gordon stepped up to become first team coach at Sleaford Town with his one-time Lincoln City teammate Terry Fleming acting as assistant manager."]}, {"page": "2005–06 Grimsby Town F.C. season", "response": ["|15 ||  Terry Fleming || Kidderminster Harriers || 33 || Free Transfer"]}, {"page": "2004–05 Grimsby Town F.C. season", "response": ["|16 ||  Terry Fleming || Cambridge United || 32 || Free Transfer"]}, {"page": "2000–01 Plymouth Argyle F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Terry Fleming                                        ||17||0 ||2||0||2||0||2||0||23||0"]}, {"page": "2002 Football League Trophy Final", "response": ["|MF ||8 ||Terry Fleming"]}, {"page": "1993–94 Coventry City F.C. season", "response": ["* Terry Fleming - Northampton Town"]}, {"page": "2001–02 Football League Trophy", "response": ["|MF ||8||Terry Fleming"]}, {"page": "Lincolnshire derby", "response": ["! scope=\"row\" style=\"text-align:left;\"| Terry Fleming"]}, {"page": "Fleming (surname)", "response": ["*Terry Fleming (born 1973), British footballer"]}, {"page": "Jerell Sellars", "response": ["Jerell's step father is former footballer and coach Terry Fleming. "]}]}}