{"wiki_id": "http://www.wikidata.org/entity/Q7704774", "itemLabel": "Terry McDermott", "itemDescription": "Scottish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_McDermott_(singer)", "wikipedia_page": {"main": "Terry McDermott (born 6 August 1977) is a Scottish-born American recording artist. He has been part of a number of bands including Driveblind in the UK, and Lotus Crush in the US. In 2012, he came to prominence as the runner-up of the third season of the American version of The Voice.", "link_mentions": [{"page": "Blake Shelton", "response": ["Blake Shelton is a coach on the NBC show The Voice. In season 1, his finalist Dia Frampton came in second. Frampton recorded a track with Shelton titled \"I Will\" on her album Red, released December 6, 2011. Shelton returned for a second season of the show with his finalist Jermaine Paul as the champion. In season three of The Voice, Shelton's team member, Cassadee Pope, was declared the winner with other Team Blake contestant Terry McDermott finishing as runner-up.", "| Terry McDermott"]}, {"page": "List of Aberdonians", "response": ["*Terry McDermott, singer"]}, {"page": "Owen Paul", "response": ["He released a jam based on the chorus of My Favourite Waste of Time featuring Glen Matlock (Sex Pistols), Toyah, Carol Decker (T'pau), comedian Matt Lucas, Leee John (Imagination), Cheryl Baker (The Fizz), Celtic folk legends Phil Cunningham and John McCusker, session pros Gary Barnacle, Judd Lander and Matt Backer, Mick MacNeil from Simple Minds, Ezio, Bruce Watson from Big Country, members of The Alarm, Jake Burns from Stiff Little Fingers, Terry McDermott (The Voice runner up), and many many more."]}, {"page": "In Your Eyes", "response": ["* \"In Your Eyes\", by Terry McDermott"]}, {"page": "List of Scottish musicians", "response": ["*Terry McDermott, rock singer with Driveblind"]}, {"page": "Driveblind", "response": ["Driveblind formed in Aberdeen in Scotland in 2001. Originally a two-piece singer-songwriter partnership comprising Nick Tyler and Terry McDermott, they recorded a few songs on cassette, later recruiting other band members to complete the band.", "After Driveblind, Terry McDermott left to the United States where he resided and married continuing his musical career in the States. He went on to form Lotus Crush with Candlebox members Peter Klett and Scott Mercado and MIGGS member John Luzzi in 2009. Lotus Crush released its debut record Half Light Morning on 3 March 2011.", "On 1 August 2012, it was announced that Terry McDermott had auditioned for Season 3 of the NBC television show The Voice becoming part of Team Blake."]}, {"page": "Terry McDermott (disambiguation)", "response": ["Terry McDermott (born 1951) is an English ex-footballer, most notably with Liverpool F.C..", "Terry McDermott may also refer to:", "* Terry McDermott (actor) (1927-2018) Australian actor known for his role in the TV series Homicide", "* Terry McDermott (baseball) (born 1951), baseball player for the 1972 Los Angeles Dodgers", "* Terry McDermott (journalist), journalist and author of Perfect Soldiers, about the 9/11 hijackers", "* Terry McDermott (singer), member of Scottish band Driveblind, the US band Lotus Crush and runner-up in the third season of the American The Voice series", "* Terry McDermott (speed skater) (born 1940), American speed skater"]}, {"page": "Pitmedden", "response": ["*Terry McDermott"]}, {"page": "Picture (disambiguation)", "response": ["* \"Pictures\", a song by Terry McDermott"]}, {"page": "Blake Shelton discography", "response": ["! scope=\"row\"| \"Dude (Looks Like a Lady)\" (with Terry McDermott)"]}]}}