{"wiki_id": "http://www.wikidata.org/entity/Q7704171", "itemLabel": "Terry Burrows", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Burrows", "wikipedia_page": {"main": "Terence Ashley Burrows is an English author, multi-instrumental musician and producer based in London. Best known as a cult performer under the alias Yukio Yung, Burrows is also a prolific author of books relating to music history, theory, and tuition, technology, business, popular psychology and modern history. His works include The Art of Sound (Thames & Hudson), Mute: A Visual Document (co-authored with Daniel Miller) (Thames & Hudson), Guitars Illustrated (Billboard), 1001 Guitars... (Cassell), KISS Guide to Playing Guitar (Dorling Kindersley), Total Guitar Tutor (Barnes & Noble), and ITV Visual History of the 20th Century (Carlton). His books—now numbering close to one hundred titles—have been published in sixteen different countries and translated into a dozen different languages. As a writer, his pseudonyms include Terence Ashley, Harrison Franklin, Hans-Joachim Vollmer and Yukio Yung. He has also written for numerous periodicals in the UK, US, and Germany.\nBurrows was born in Ipswich, Suffolk, England and started studying classical piano at the age of five. (AllMusic describes him as \"A classically trained keyboardist with an advanced degree in computer engineering.\") When he was 12 he started to teach himself guitar, and later took up bass, drums, and saxophone. The anti-establishment attitudes of punk subculture appealed to him but his musical influences included Syd Barrett, Kraftwerk, the Who, Brian Eno, the Television Personalities, and the Canterbury progressive music scene. Still in his teens, Burrows founded indie label, Hamster Records, releasing albums by non-commercial acts such as Loch Ness Monster, Rimarimba, R. Stevie Moore and Attrition, and his own \"post-punk industrial funk\" under the guise of Jung Analysts. In 1986, Cordelia Records released Burrows' Tree Climbing Goats (And Other Analysing Shanties) LP, his first release under the pseudonym Yukio Yung, chosen because of an obsession at that time with Japanese culture.\nIn 1986, Burrows met Alan Jenkins, leader of The Deep Freeze Mice, and together they formed The Chrysanthemums, with Burrows as lead singer and keyboard. A psychedelic art pop band with a large cult following almost entirely outside of the UK, they released four albums and four EPs. In 2010, German music magazine MusikExpress placed them at number 23 in their list of the most under-rated bands of all time.At this time, Burrows also recorded a series of \"abstract industrial\" albums with celebrated \"Krautrock\" musician Asmus Tietchens, a former collaborator with Brian Eno and Cluster. The first volume, Watching The Burning Bride formed the soundtrack to the similarly named film, by Canadian director, Mark Mushet. He also produced a number of albums of instrumental prog-rock-tinged electronica as part of the duo Push-Button Pleasure.\nIn the early 1990s, Burrows flirted briefly with electronic dance music releasing a pair of 12-inch singles as YooKO on the Belgian ZZB label, one of which, \"Matrix\", reached the Top Ten in Germany's Network Dance Chart. Burrows later released further solo Yukio Yung material, commencing with 1993's LP Art Pop Stupidity and CD A Brainless Deconstruction of the Popular Song. Over the next four years he released a single and four EPs. In 1997, Burrows rejoined with his ex-Chrysanthemums bandmate Vladimir Zajkowiecz [Martin Howells] to form a new version of that group, renamed with the visual pun Chrys&themums to distinguish it from the original line-up.Musically, Burrows was uncharacteristically quiet between 1998 and 2004 – a combination of ill health and an increasingly demanding publishing schedule. By 2003, he'd had more than 50 books published, and was recognized as one of the world's biggest-selling authors of music tuition titles, with sales of well over 2 million books in the US alone. During this period he also embarked on an additional career as an occasional university lecturer.\nIn 2004, Burrows emerged again with a typically colorful selection of music projects, the most significant of which was the resumption of his collaboration with US home-recording pioneer R. Stevie Moore. The resulting album, compiled by Burrows on an Apple Macintosh computer, was released as Yung & Moore Versus The Whole Goddam Stinkin World. (The sleeve depicts the duo as cartoon superheroes about to demolish the planet – an intended visual metaphor for the antipathy the mainstream has shown both artists' music over the years.)2006 saw Burrows returning to the musical abstraction of his earlier career with Tonesucker, a prolific \"fundamentalist\" noise/drone project that has performed widely at festivals across Europe. Burrows has also performed on theremin and VCS3 at Britain's prestigious Aldeburgh Festival.", "link_mentions": [{"page": "Calcasieu Parish, Louisiana", "response": ["* Terry Burrows (Born 1968), former Major League Baseball pitcher and head baseball coach at McNeese State University."]}, {"page": "Music from Big Pink", "response": ["The laid-back feel of the album attracted the attention of other major artists. For example, Eric Clapton cites the album's roots rock style as what convinced him to quit Cream, and pursue the styles of Blind Faith, Delaney and Bonnie, Derek and the Dominos, and his debut album. George Harrison was also impressed by the album's musicianship and sense of camaraderie, and Roger Waters called it the second \"most influential record in the history of rock and roll\", after the Beatles' Sgt. Pepper's Lonely Hearts Club Band, and said that it \"affected Pink Floyd deeply, deeply, deeply\". According to Terry Burrows, the album spawned the Americana genre, while music academic Chris Smith said its songs laid the groundwork for roots rock music."]}, {"page": "Chapman Stick", "response": ["* Terry Burrows author and musician"]}, {"page": "Tak Matsumoto", "response": ["Matsumoto through his B'z fame is credited for the \"resurrection and reinvention of the Japanese guitar hero\", alongside and in comparison to X Japan guitarist hide, as a model of guitarist more interested in technique, technology and equipment, popularizing the electric guitar as a mass media product in Japan. Terry Burrows considered him the \"most highly regarded guitarist to emerge from Asia\". Matsumoto ranked first in a 2011 poll conducted by Japanese search engine goo on who the Japanese people thought was the best guitarist to represent Japan. In 2019, Matsumoto's song  was named the 51st best guitar instrumental by Young Guitar Magazine in 2019."]}, {"page": "Andy Ward (musician)", "response": ["Throughout the 1990s, Ward worked with Richard Sinclair's Caravan of Dreams and Going Going, with Sinclair, Hugh Hopper, Vince Clarke and Mark Hewins. In 1994, he joined Mirage – a progressive \"supergroup\" combining members from both Camel and Caravan. Other projects included the studio-only group the Chrysanthemums, led by singer-songwriter Yukio Yung (aka Terry Burrows), who received drum tracks through the post from Ward before building songs around them, playing all the other instruments himself. At this time Ward also became full-time drummer with the English rock band the Bevis Frond, with whom he recorded and toured extensively."]}, {"page": "Terence Ashley", "response": ["#REDIRECTTerry Burrows"]}, {"page": "Harrison Franklin", "response": ["#REDIRECTTerry Burrows"]}, {"page": "Hans-Joachim Vollmer", "response": ["#REDIRECTTerry Burrows"]}, {"page": "Yukio Yung", "response": ["#REDIRECTTerry Burrows"]}, {"page": "Yukio", "response": ["* Yukio Yung, a pseudonym of Terry Burrows, English writer and musician"]}, {"page": "List of drone artists", "response": ["*Terry Burrows"]}, {"page": "The Chrysanthemums (band)", "response": ["The Chrysanthemums are an English art-pop group. The project began as a collaboration between multi-instrumentalist Terry Burrows (known in the band as \"Yukio Yung\") and Alan Jenkins, the leader of The Deep Freeze Mice. The first releases were performed in the studio by Burrows and Jenkins alone. Other personnel were gradually added, including Vladimir Zajkowiecz on bass, Robyn Gibson (now lead singer with The Junipers) on drums and Jonathan Lemon on keyboards, enabling them to complete several tours of mainland Europe, where there was most interest in their work."]}, {"page": "Daniel Miller (music producer)", "response": ["In 2017, Miller co-authored Mute: A Visual Document (Thames & Hudson) with Terry Burrows. An illustrated hardback book that detailed the history of Mute Records, it was named Book of the Year by both Rough Trade and Electronic Sound magazine."]}, {"page": "Burrows (surname)", "response": ["* Terry Burrows, English author and musician", "* Terry Burrows (baseball) (b. 1968), American baseball player"]}, {"page": "Asmus Tietchens", "response": ["* 1986 Watching the Burning Bride with Terry Burrows", "* 1998 Burning the Watching Bride with Terry Burrows"]}, {"page": "Verve (R. Stevie Moore album)", "response": ["Verve is the fifth 12\" vinyl record album by DIY home recording pioneer and one-man band R. Stevie Moore. It was released by Terry Burrows' Hamster label in the UK late 1985. Never officially reissued on compact disc, the CD-R version (copied direct from the vinyl) is available by mail from the artist."]}, {"page": "Northgate High School, Ipswich", "response": ["* Terry Burrows, author/musician"]}, {"page": "Artistic Vice", "response": ["Two years after the album was released, Television Personalities released a cover of 'Honey I Sure Miss You'.A Tribute To Daniel Johnston Vol. 1 (Little Teddy Recordings, LiTe707, 1993) That same year, Terry Burrows, under the pseudonym of Yukio Yung, released a cover of 'I Feel So High'.Yukio Yung - A Brainless Deconstruction Of The Popular Song (Mermaid Records, JUNG 004, 1993)"]}, {"page": "Yung (surname)", "response": ["*Yukio Yung, stage name of Terry Burrows, English musician"]}, {"page": "Lo Fi Hi Fives", "response": ["The songs on this album are taken from 37 years of material. The album was compiled by R. Stevie along with Tim Burgess on Tim's label O Genesis Recordings - O Genesis already released a split single of him and the Vaccines and soon released a single of \"Pop Music\". The album features cameos by Irwin Chusid, Ariel Pink, Terry Burrows, Lane Steinberg, and friends/fellow Ethos bandmates Billy Anderson and Roger Ferguson."]}, {"page": "Jonathan Lemon", "response": ["Two years later, Lemon joined The Chrysanthemums along with Alan Jenkins, leader of The Deep Freeze Mice, and Terry Burrows.  A psychedelic art pop band with a large cult following almost entirely outside of the UK, they released four albums and four EPs.Stewart Mason, 'Yukio Yung', Allmusic (2006). Retrieved 25 September 2006. In 2010, German music magazine MusikExpress placed them at number 23 in their list of the most under-rated bands of all time."]}]}}