{"wiki_id": "http://www.wikidata.org/entity/Q7701988", "itemLabel": "Terence Patrick O'Sullivan", "itemDescription": "British engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Terence_Patrick_O%27Sullivan", "wikipedia_page": {"main": "Terence Patrick O'Sullivan (1913–1970) was a British civil engineer. He specialised initially in steel and reinforced concrete structures. Later he founded a firm of consulting engineers, T. P. O’Sullivan & Partners, which grew to have offices on four continents and made a reputation in the field of infrastructure development, particularly in the developing world.", "link_mentions": [{"page": "1913", "response": ["** Terence Patrick O'Sullivan, British civil engineer (d. 1970)"]}, {"page": "Long Ditton", "response": ["People buried in the churchyard include global businessman and civil structural engineer Terence Patrick O'Sullivan, aircraft design engineer Sir Sydney Camm, Indian Army General Sir Orfeur Cavenagh, and Austin Partner, a victim of the sinking of the Titanic.encyclopedia-titanica.org"]}, {"page": "O'Sullivan", "response": ["*Terence Patrick O'Sullivan (1913–1970), English civil engineer"]}, {"page": "Terence O'Sullivan", "response": ["*Terence Patrick O'Sullivan (1913–1970), British civil engineer"]}, {"page": "Telford Medal", "response": ["|C.B.H.Colquhoun, Terence Patrick O'Sullivan", "* 1955 Terence Patrick O'Sullivan \"The Strengthening of Steel Structures Under Load\" This paper was published in The Proceedings of the Institution of Civil Engineers, Jan 1953, Vol 2 Part 1, pp 76-95, as Paper No 5881. The award of the Telford Premium was reported in the same journal, vol 4, 1955."]}, {"page": "List of people educated at St Ignatius' College", "response": ["* Terence Patrick O'Sullivan, civil engineer"]}, {"page": "Terry Sullivan", "response": ["*Terence Patrick O'Sullivan (1913–1970), British civil engineer"]}, {"page": "September 1913 (month)", "response": ["* Born: Charles Helou, Lebanese state leader, 15th President of Lebanon, in Beirut (d. 2001); Terence Patrick O'Sullivan, British engineer, founder of T. P. O'Sullivan and Partners which were involved in many industrial projects for Asia and Africa as well as the modernization of the British railway system in 1955, in London (d. 1970); Josef Bican, Austrian-Czech association football player, striker for the Austria and Czechoslovakia national football teams from 1933 to 1949, second-highest goal scorer ever after Erwin Helmchen, in Vienna (d. 2001)"]}]}}