{"wiki_id": "http://www.wikidata.org/entity/Q7704666", "itemLabel": "Terry Leahy", "itemDescription": "English businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Leahy", "wikipedia_page": {"main": "Sir Terence Patrick \"Terry\" Leahy (born 28 February 1956) is a British businessman, previously the CEO of Tesco, the largest British retailer and the third-largest retailer in the world measured by revenues.\nHe now lives in Cuffley, Hertfordshire, with his wife, Alison and his three children.", "link_mentions": [{"page": "February 28", "response": ["*1956 – Terry Leahy, English businessman"]}, {"page": "University of Manchester Institute of Science and Technology", "response": ["UMIST, together with the Victoria University of Manchester ceased to exist on 1 October 2004, when they were combined in a new single University of Manchester. Terry Leahy, CEO of Tesco and alumnus was the last Chancellor of UMIST, and the Vice-Chancellor was a chemical engineer, John Garside."]}, {"page": "Tesco", "response": ["Tesco introduced a loyalty card, branded 'Clubcard' in 1995, and later an Internet shopping service. In 1996 the typeface of the logo was changed to the current version with stripe reflections underneath, whilst the corporate font used for shop signage was changed from the familiar \"typewriter\" font that had been used since the 1970s. Overseas operations were introduced the same year. Terry Leahy assumed the role of Chief Executive on 21 February 1997, the appointment having been announced on 21 November 1995.", "Beginning in 1997 when Terry Leahy took over as CEO, Tesco began marketing itself using the phrase \"The Tesco Way\" to describe the company's core purposes, values, principles, and goals This phrase became the standard marketing speak for Tesco as it expanded domestically and internationally under Leahy's leadership, implying a shift by the company to focus on people, both customers and employees."]}, {"page": "Anna Ford", "response": ["On 17 December 2001, Ford was installed as Chancellor of the Victoria University of Manchester. When the Victoria University of Manchester merged with the University of Manchester Institute of Science and Technology (UMIST) on 1 October 2004 to create the new University of Manchester, she became its Co-Chancellor along with Sir Terry Leahy (the former Chancellor of UMIST). She completed her term and Tom Bloxham succeeded her as sole Chancellor on 1 August 2008."]}, {"page": "West Derby", "response": ["West Derby is home to a number of schools that have produced famous pupils: West Derby School, one of whose alumni is actor Craig Charles. St. Edward's College produced Sir Terry Leahy, former England rugby union player Mike Slemen and actor Michael Williams. Cardinal Heenan Catholic High School includes Liverpool footballer Steven Gerrard, professional boxer David Price and musician Mike di Scala. Previously called Cardinal Allen Grammar School, it was attended by Everton footballer Colin Harvey, United States Eagles rugby player, Michael Caulder, who played in the first Rugby World Cup in 1987, and actor Paul McGann. Broughton Hall High School former pupils include singer Natasha Hamilton of Atomic Kitten, and actress Jennifer Ellison. Ellison later moved to St. Edward's College for sixth form."]}, {"page": "Justin King (businessman)", "response": ["In September 2005 in an interview with The Guardian King discussed the dominance of principal rival Tesco. While steering clear of calls for a Competition Commission inquiry into the No.1 UK supermarket, King did call for changes in planning laws to prevent Tesco from achieving a 40% market share. As of 2005 Tesco had more potential development projects than that of Sainsbury, Asda and Morrisons combined. King also criticised Tesco CEO Terry Leahy for questioning the accuracy of Taylor Nelson Sofres market data. Leahy has argued that TNS overestimates the size of his company's market share."]}, {"page": "Philip Green", "response": ["Green is involved with Everton Football Club due to his friendship with chairman Bill Kenwright, but states that has no intention of formally investing in the club. He arranged for another friend, Planet Hollywood's owner Robert Earl, to purchase shares from former director Paul Gregg during a struggle for control of Everton in 2004. He offers business advice to the club alongside Tesco CEO Terry Leahy and helps negotiate player transfer fees with agents."]}, {"page": "List of people from Merseyside", "response": ["* Terry Leahy: Businessman, credited with taking Tesco to market dominance."]}, {"page": "Ian MacLaurin, Baron MacLaurin of Knebworth", "response": ["By the time of his retirement in 1997 Tesco had overtaken Sainsbury's to become the largest UK retailer. MacLaurin led Tesco away from the \"pile it high, sell it cheap\" business philosophy of founder Jack Cohen. He has claimed his most important act was appointing the right successor, Terry Leahy."]}, {"page": "Cuffley", "response": ["Its most notable current resident is Sir Terry Leahy, former CEO of Tesco, although this did not prevent locals from objecting vehemently to plans to build a  \"Express\" store in the village replacing one of only two remaining village pubs.Daily Telegraph on-line 23 July 2007 Other famous residents include Premier League footballers Ledley King, Jermain Defoe, Niko Kranjcar, David Bentley, Kyle Walker and Armand Traoré; and also former Sugababes singer Keisha Buchanan and Myleene Klass."]}, {"page": "List of University of Pennsylvania people", "response": ["*Terry Leahy: CEO, Tesco"]}, {"page": "Fortune European Businessman of the Year", "response": ["! scope=\"row\" |Terry Leahy"]}, {"page": "Alliance Manchester Business School", "response": ["* Terry Leahy, former CEO of Tesco, the largest UK supermarket chain"]}, {"page": "Liverpool City Region", "response": ["Some definitions of the city region include a much wider area. The now-revoked North West of England Regional Spatial Strategy, while defining the city region for \"the purposes of articulating RSS policy\" as covering the six local authorities, also stated that it \"extends as far as Chester, Ellesmere Port and Neston and West Lancashire\".The North West of England Plan Regional Spatial Strategy to 2021, p.140   A 2011 report, Liverpool City Region - Building on its Strengths, by an independent working group led by Lord Heseltine and Terry Leahy, stated that \"what is now called Liverpool City Region has a population of around 1.5 million\", but also referred to \"an urban region that spreads from Wrexham and Flintshire to Chester, Warrington, West Lancashire and across to Southport\", with a population of 2.3 million. The European Union's ESPON calculated the Liverpool metropolitan area to be over 2.3 million people."]}, {"page": "Belle Vale, Liverpool", "response": ["Over one-thousand prefabricated homes were erected on land around the hamlet, named Belle Vale Estate Gateacre on the plans, between 1945-1947, to provide affordable rented accommodation for people whose homes were destroyed in bombing raids on the city during World War II, making it one of the largest Prefab communities in the country.Prefabs Its most famous former resident is Sir Terry Leahy, previously chief executive of Tesco, the UK's biggest supermarket chain. Leahy is also President of the Belle Vale Prefab Project.BVPP NewsletterBelle Vale Prefab Project. More Prefab Days (Belle Vale Remembers), 2008, pp. 102-103. From the mid-1960s the Prefab estate was cleared. It was replaced by new housing and a shopping centre by the mid-1970s. Our Lady's Roman Catholic church, initially built on the Prefab estate in 1949, relocated from across the road from the current location of Gateacre School playing field to Hedgefield Road in 1965."]}, {"page": "Tesco Clubcard", "response": ["In 1993, Terry Leahy asked the Tesco marketing team to investigate the potential of loyalty cards. In the past Tesco had run Green Shield Stamps as a promotional tool which rewarded people for visits and spend but gained no customer information. The initial team, led by Grant Harrison, researched programmes across the world and developed a proposal which showed that a loyalty card could be very effective. The key change since the days of Green Shield Stamps was the ability to track individual customer behaviour cost-effectively using a magnetic stripe card."]}, {"page": "The Kirkby Project", "response": ["The Kirkby option included a stadium designed loosely on that of FC Köln's stadium in Germany selected for the World Cup in 2006.  It was part of a development known as 'Destination Kirkby' which was backed by Terry Leahy the CEO of the supermarket chain Tesco and would include a Tesco supermarket, a hotel and a retail park with car parking."]}, {"page": "Fresh & Easy", "response": ["On February 9, 2006, Tesco announced that it planned to move into the United States by opening a chain of small format grocery stores in three Western states (Arizona, California and Nevada) in 2007 named Fresh & Easy. The initial planned capital expenditure was up to £250m ($436m) per year. After Tesco CEO Terry Leahy announced serious resources had been committed to developing a format that would be popular with American consumers, investors responded with some skepticism with a small drop in the company's share price. The markets were expected to be around —good-sized supermarkets in many countries, but about one-third the size of an average supermarket in the USBritain's Tesco to Open Its First U.S. Stores in Southland, Los Angeles Times May 20, 2006.  By January 2007, Tesco opened its U.S. headquarters in El Segundo, California,. The company initially expanded into Southern California, Phoenix, Arizona, and Las Vegas, Nevada."]}, {"page": "Faughs GAA Club", "response": ["The next great era was from 1939 to 1952, when eight championships were won, including two threes-in-a-row, 1939–1941 and 1944–1946. These teams included many prominent inter-county and inter-provincial players, including the gifted and stylish Harry Grey, Ned Wade, Phil Farrell, Mick Butler, Terry Leahy, Mick Gill, Jim Mullane, Martin Quinn, Dan Canniffe, Charlie Downes, Jim Egan, Johnny Callanan, Dan Devitt, Murt O'Brien, Jim Prior, Mick Williams, Tony Herbert, Liam Cashin, Tom Fahy, Jack Sheedy and Tommy Boland."]}]}}