{"wiki_id": "http://www.wikidata.org/entity/Q771698", "itemLabel": "E. F. Benson", "itemDescription": "novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/E._F._Benson", "wikipedia_page": {"main": "Edward Frederic Benson (24 July 1867 – 29 February 1940) was an English novelist, biographer, memoirist, archaeologist and short story writer.", "link_mentions": [{"page": "February 29", "response": ["*1940 – E. F. Benson, English archaeologist and author (b. 1867)"]}, {"page": "July 24", "response": ["*  1867   – E. F. Benson, English archaeologist and author (d. 1940)"]}, {"page": "Sheridan Le Fanu", "response": ["In addition to M. R. James, several other writers have expressed strong admiration for Le Fanu's fiction. E. F. Benson stated that Le Fanu's stories \"Green Tea\", \"The Familiar\", and \"Mr. Justice Harbottle\" \"are instinct with an awfulness which custom cannot stale, and this quality is due, as in The Turn of the Screw, to Le Fanu's admirably artistic methods in setting and narration\". Benson added, \"[Le Fanu's] best work is of the first rank, while as a 'flesh-creeper' he is unrivalled. No one else has so sure a touch in mixing the mysterious atmosphere in which horror darkly breeds\".E. F. Benson. \"Sheridan Le Fanu\". In Harold Bloom, Classic Horror Writers. New York: Chelsea House, 1994. pp. 48–49.  Jack Sullivan has asserted that Le Fanu is \"one of the most important and innovative figures in the development of the ghost story\" and that Le Fanu's work has had \"an incredible influence on the genre; [he is] regarded by M. R. James, E. F. Bleiler, and others as the most skilful writer of supernatural fiction in English.\""]}, {"page": "1940", "response": ["** E. F. Benson, English writer (b. 1867)"]}, {"page": "1867", "response": ["* July 24 – E. F. Benson, English writer (d. 1940)"]}, {"page": "M. R. James", "response": ["In 2013, the Fan Museum in London hosted two performances of The Laws of Shadows, a play by Adrian Drew about M. R. James. The play is set in James's rooms at Cambridge University and deals with his relationships with his colleague E. F. Benson and the young artist James McBryde.\"In Celebration 2013: The Laws of Shadows\". The Fan Museum, Greenwich, London. Retrieved 16 September 2013."]}, {"page": "P. G. Wodehouse", "response": ["The American literary analyst Robert F. Kiernan, defining \"camp\" as \"excessive stylization of whatever kind\", brackets Wodehouse as \"a master of the camp novel\", along with Thomas Love Peacock, Max Beerbohm, Ronald Firbank, E. F. Benson and Ivy Compton-Burnett.Leonardi, Susan J. \"Frivolity Unbound\" , MFS Modern Fiction Studies, Vol. 37, No. 2, Summer 1991, pp. 356–357, Project Muse  The literary critic and writer Cyril Connolly calls Wodehouse a \"politicians' author\"—one who does \"not like art to be exacting and difficult\".Connolly, p. 99 Two former British prime ministers, H. H. Asquith and Tony Blair, are on record as Wodehouse aficionados, and the latter became a patron of the Wodehouse Society. Seán O'Casey, a successful playwright of the 1920s, thought little of Wodehouse; he commented in 1941 that it was damaging to England's dignity that the public or \"the academic government of Oxford, dead from the chin up\" considered Wodehouse an important figure in English literature.O'Casey, Sean, quoted  in \"Sean O'Casey caustic on Wodehouse\", The Argus, Melbourne, 9 July 1941, p. 1 His jibe that Wodehouse was \"English literature's performing flea\" provided his target with the title of his collected letters, published in 1953. McCrum, writing in 2004, observes, \"Wodehouse is more popular today than on the day he died\", and \"his comic vision has an absolutely secure place in the English literary imagination.\"McCrum, p. 417"]}, {"page": "School and university in literature", "response": ["* E. F. Benson: David Blaize", "* E. F. Benson: The Babe B.A.", "* E. F. Benson: David of King's"]}, {"page": "E.F. Benson", "response": ["#REDIRECT E. F. Benson"]}, {"page": "King's College, Cambridge", "response": ["Under the provostship of Richard Okes, from 1850 until his death in 1888, the college began a period of reform.  On 1 May 1851 it was agreed to abolish the privilege of King's members to be granted a degree without passing the university examinations.  In 1861 the college statutes were amended so as to expand the college and, more radically, to allow for the election of non-Etonian King's members: the new statutes provided for forty-six Fellows, twenty-four scholarships reserved for boys from Eton, and twenty-four \"open\" scholarships for boys from any school.  At the same time all formal obligation to take Holy Orders – unenforced since the seventeenth century – was removed.  The statutes were again amended in 1882, this time ensuring fellowships were not always for life and were awarded on merit after submissions of original research.  In his 1930 memoir As We Were, A Victorian Peep Show, E. F. Benson, an alumnus of King's, recollected the peculiar behaviours of some of the surviving Life Fellows from his undergraduate years of 1887–1890 and before.   Of one he wrote, \"He then shuffled out on to the big lawn, with a stick in his hand, and he prodded with it at the worms in the grass, muttering to himself, 'Ah, damn ye: ye haven't got me yet.'\" The first non-Etonian students were admitted to study at King's in 1865, and the first non-Etonian scholars and the first non-Etonian fellow were elected in 1873.  These reforms continued over subsequent decades and there are now no special privileges for Etonians at King's."]}, {"page": "Twenty Two (The Twilight Zone)", "response": ["\"Twenty Two\" is episode 53 of the American television series The Twilight Zone. The story was adapted by Rod Serling from a short anecdote in the 1944 Bennett Cerf Random House anthology Famous Ghost Stories, which itself was an adaptation of \"The Bus-Conductor\", a short story by E. F. Benson published in The Pall Mall Magazine in 1906. The episode was one of six shot on videotape in a short-lived experiment aimed to cut costs."]}, {"page": "Prunella Scales", "response": ["Her career break came with the early 1960s sitcom Marriage Lines starring opposite Richard Briers. She played her most famous role, Sybil Fawlty in the sitcom Fawlty Towers, over two series in 1975 and 1979. In addition to this, she has had roles in BBC Radio 4 sitcoms, and comedy series including After Henry, Smelling of Roses and Ladies of Letters; on television she starred in the London Weekend Television/Channel 4 series Mapp & Lucia based on the novels by E. F. Benson. She played Queen Elizabeth II in Alan Bennett's A Question of Attribution."]}, {"page": "1915 in literature", "response": ["*E. F. Benson – The Oakleyites"]}, {"page": "1914 in literature", "response": ["*E. F. Benson – Arundel"]}, {"page": "1913 in literature", "response": ["*E. F. Benson "]}, {"page": "1912 in literature", "response": ["*E. F. Benson –  Mrs. Ames"]}, {"page": "1917 in literature", "response": ["*E. F. Benson"]}, {"page": "1920 in literature", "response": ["*E. F. Benson – Queen Lucia"]}, {"page": "1922 in literature", "response": ["*E. F. Benson – Miss Mapp"]}, {"page": "1931 in literature", "response": ["*E. F. Benson – Mapp and Lucia"]}, {"page": "1940 in literature", "response": ["*February 29 – E. F. Benson, English novelist, biographer, memoirist and short-story writer (born 1867)"]}, {"page": "1893 in literature", "response": ["*E. F. Benson – Dodo"]}, {"page": "Elizabeth Hawkins-Whitshed", "response": ["As Mrs Aubrey Le Blond she made at least ten films of alpine activities in the Engadine Valley of Switzerland, including ice hockey at St Moritz and tobogganing on the Cresta Run. She is probably among the world's first three female film-makers, after Alice Guy and contemporary with Laura Bayley. Her films were shown by James Williamson at Hove Town Hall in November 1900, being included in his catalogue in 1902, and were praised by the film pioneer Cecil Hepworth and the writer E. F. Benson."]}, {"page": "Joan Aiken", "response": ["Some of her books focus on spine-chilling or supernatural events, including The Windscreen Weepers (stories, 1969), The Shadow Guests (novel, 1980), A Whisper in the Night (stories, 1982), and A Creepy Company (stories, 1993, with variant contents in its US and UK editions). She set her adult supernatural novel The Haunting of Lamb House at Lamb House in Rye (now a National Trust property). This ghost story recounts in fictional form an alleged haunting experienced by two former residents of the house, Henry James and E. F. Benson, both of whom also wrote ghost stories."]}, {"page": "Marie Corelli", "response": ["Corelli is generally accepted to have been the inspiration for at least two of E. F. Benson's characters in his Lucia series of six novels and a short story. The main character, Emmeline \"Lucia\" Lucas, is a vain and snobbish woman of the upper middle class with an obsessive desire to be the leading light of her community, to associate with the nobility, and to see her name reported in the social columns, coupled with a comical pretension to education and musical talent, neither of which she possesses. She also pretends to be able to speak Italian, something Corelli was known to have done. Miss Susan Leg is a highly successful writer of pulp romances under the pseudonym Rudolph da Vinci. In E.F. Benson's \"Secret Lives\"  a famous novelist Susan Leg, writes a book in which the heroine is another writer - Serena Lomond. This character is meant to be very similar to Susan herself, but in fact Serena Lomond is the spit of Mavis Clare in Marie Corelli's \"The Sorrows of Satan\". The character makes her appearance in Benson's work a few years after Marie Corelli's death in 1924.", "A modern critic has written that Corelli was probably also the inspiration for \"Rita's\" (Eliza Humphreys's) main character in Diana of the Ephesians, which was published a year before E. F. Benson's first Lucia novel, and had been rejected by Hutchinson, which later published the \"Lucia\" Lucas novels.\"Rita\" The Forgotten Author. By Paul Jones L.R.P.S."]}, {"page": "Tom Holt", "response": ["*continuations of E. F. Benson's \"Lucia\" series set in Tilling"]}, {"page": "Ethel Smyth", "response": ["Ethel Smyth featured, under the name of Edith Staines, in E. F. Benson's Dodo books (1893–1921), decades before the quaint musical characters of his more famous Mapp and Lucia series. She \"gleefully acknowledged\" the portrait, according to Prunella Scales.Scales, introduction to Benson (1986)"]}, {"page": "Frederick Hamilton-Temple-Blackwood, 1st Marquess of Dufferin and Ava", "response": ["The story itself was retold by E. F. Benson in his short story The Bus-Conductor in 1906, and was adapted in a segment of the anthology film, Dead of Night. It was again retold by Bennett Cerf in his collection Famous ghost stories in 1944, which in turn was adapted in the episode Twenty Two of The Twilight Zone. It was again published in Scary Stories to Tell in the Dark.Room for One More | Snopes.com"]}, {"page": "Radclyffe Hall", "response": ["Hall lived with Troubridge in London and, during the 1930s, in the small town of Rye, East Sussex, noted for its many writers, including her contemporary the novelist E. F. Benson. Hall also was involved in affairs with other women throughout the years, including the actress Ethel Waters."]}, {"page": "Hutchinson (publisher)", "response": ["In the 1920s, Walter Hutchinson published many of the \"spook stories\" of E. F. Benson in Hutchinson's Magazine and then in collections in a number of books. The company also first published Arthur Conan Doyle's Professor Challenger novels, five novels by mystery writer Harry Stephen Keeler, and short stories by Eden Phillpotts. In 1929, Walter Hutchinson stopped publishing magazines to concentrate on books. In the 1930s, Hutchinson published H. G. Wells's The Bulpington of Blup as well as the first English translations of Vladimir Nabokov's Camera Obscura (translated by Winifred Roy with Nabokov credited as Vladimir Nabokoff-Sirin) in 1936 and Despair (translated by Nabokov himself) under its John Long marque of paperbacks. "]}, {"page": "Dead of Night", "response": ["(Directed by Basil Dearden; based on \"The Bus-Conductor\" by E. F. Benson, published in The Pall Mall Magazine in 1906)", "* \"The Bus-Conductor\", a short story by E. F. Benson published in The Pall Mall Magazine in 1906 which was the basis for the segment in Dead of Night"]}, {"page": "Broadway, Worcestershire", "response": ["Stripped of its role of staging post, Broadway became a backwater; a haven of peace and tranquillity. Victorian artists and writers were drawn to the village's calm and the famous Arts and Crafts movement made its home in the area. The artists and writers to whom Broadway became home included Elgar, John Singer Sargent, Edwin Austin Abbey, J. M. Barrie, Vaughan Williams, William Morris, Mary Anderson and American artist and writer, Francis Davis Millet. In 1912 Millet boarded the RMS Titanic in Cherbourg, France, as a first class passenger, heading to Washington via New York. He died in the sinking of the Titanic aged 65 and is commemorated by a memorial at St Eadburgha's Churchyard, Broadway. In 1932 Millet's son Jack donated £120 to St Eadburgha's Church for the construction of lychgates in his father's memory at the churchyard on Snowshill Road. Broadway is thought (by Sir Steven Runciman (1903–2000), a Cambridge historian who knew Benson well) to have been the model for a fictional Elizabethan village in the Cotswolds, Riseholme, the home of Lucia in the novels of E. F. Benson, before she moved to Tilling (based on Rye in East Sussex)."]}, {"page": "Robert Hugh Benson", "response": ["Benson was the youngest son of Edward White Benson, the Archbishop of Canterbury, and his wife, Mary; Benson was the younger brother of E. F. Benson, A. C. Benson, and Margaret Benson.", "File:A. C. Benson, R. H. Benson, and E. F. Benson, 1882.jpg|A. C. Benson, R. H. Benson and E. F. Benson, 1882. From the book Hugh, Memoirs of a Brother"]}, {"page": "L. P. Hartley", "response": ["In 1924, he met Constant Huntington of G. P. Putnam, who published his  first volume of short stories, Night Fears, in that year, as well as his novella Simonetta Perkins in 1925. Night Fears was relatively unsuccessful, earning him no money. Simonetta Perkins brought him only £12, though it was written about favourably. The Saturday Review called the young writer \"one of the most hopeful talents\", and The Calendar of Modern Letters said that Simonetta Perkins was a \"distinguished first novel\". Modern critics have called it his most dangerous novel, as Hartley explored infatuation and sexuality in a way not considered respectable at the time. In 1932, Hartley published The Killing Bottle, a collection of ghost stories. Cynthia Asquith included some of them in an anthology, which increased his popularity with the public. Critics thought of Hartley as the successor of the Gothic greats M. R. James and E. F. Benson."]}, {"page": "Jacques d'Adelswärd-Fersen", "response": ["After his marriage plans were foiled, d'Adelswärd remembered the island of Capri from his youth, and decided to build a house there. The island had already attracted other homosexual or bisexual visitors, such as Christian Wilhelm Allers, Somerset Maugham, E. F. Benson, Lord Alfred Douglas, Robert Ross, Oscar Wilde, Friedrich Alfred Krupp, Norman Douglas, and Compton and Faith Mackenzie; and attracted many others during d'Adelswärd's stay. He stayed originally at the Grand Hotel Quisisana and then bought land at the top of a hill in the northeast of the island, close to where the Roman emperor Tiberius had built his Villa Jovis two millennia earlier. He commissioned his friend Édouard Chimot to design a villa, initially called Gloriette, but was eventually christened Villa Lysis (later sometimes referred to as Villa Fersen) in reference to Plato's Socratic dialogue Lysis discussing friendship (or, according to modern notions, homosexual love). When the construction started, d'Adelswärd left Capri to visit the Far East. He mostly spent time on Ceylon, where he wrote Lord Lyllian. He returned to Capri in the autumn of 1904, visiting the United States on the way back."]}, {"page": "Dodo (disambiguation)", "response": ["* Dodo, an 1893 novel by E. F. Benson"]}, {"page": "Lucas Malet", "response": ["Her later novels, such as The Survivors (1923) are proto-modernist in their explorations of marginal consciousnesses. E. F. Benson acknowledged his debt to her critical advice in his memoir Our Family Affairs.P. L. Lundberg, An Inward Necessity (2003) p. 162 Despite her importance, Malet died in poverty in 1931. Her last novel, The Private Life of Mr. Justice Syme, was completed after the author's death by her companion Gabrielle Vallings, and published in August 1932. Biographer Patricia Lorimer Lundberg attributes Malet's swift decline in reputation to multiple factors including the author's confusing sexual and gender politics and an \"evolving modernist style\" that \"met with sloppy reviews that endeavored to push her back into Victorianism.\" Lundberg's book, An Inward Necessity: the Writer's Life of Lucas Malet, remains the only major biography of the author. Talia Schaffer notes that Lundberg's book re-constructs historical gaps in the author's life created both by critical neglect and Malet's own actions (she asked Vallings to burn her personal papers, for example.) The biography uses Malet's life and work to show \"how late Victorian conditions fostered an oeuvre as ambitious as Malet's and how the advent of modernism damaged her reputation.\""]}, {"page": "Social season (United Kingdom)", "response": ["* The 1927 novel Lucia in London by E. F. Benson is set during the London season in the 1920s."]}, {"page": "Edward Frederick Benson", "response": ["#REDIRECT E. F. Benson"]}, {"page": "Tudor Revival architecture", "response": ["More often it is in the Tudor style houses of the very early 20th century that a greater devotion to the Tudor period is found, with appropriate interior layout, albeit coupled with modern-day comforts. This can be seen in older upscale neighbourhoods where the lots are sufficiently large to allow the house to have an individual presence, despite variations in the style of neighboring houses. Whether of older or recent origin, the appearance of solid beams and half timbered exterior walls is only superficial. Artificially aged and blackened beams are constructed from light wood, bear no loads, and are attached to ceilings and walls purely for decoration, while artificial flames leap from wrought iron fire-dogs in an inglenook often a third of the size of the room in which they are situated. Occasionally, owners sought to replicate more closely the conditions of Tudor living; an example were the Moynes at Baliffscourt in West Sussex, a house which Clive Aslet describes as \"the most extreme - and most successful - of all Tudor taste country houses\". Lord Moyne's wife, Evelyn, a society hostess, employed the amateur architect Amyas Philips to create a house inspired by the medieval Baliffscourt Chapel which stood on the site. The cloister-like design required visitors to leave the house and access their bedrooms via external staircases. Chips Channon, the diarist and politician described the bedrooms themselves as \"decorated to resemble the cell of a rather 'pansy' monk\". The novelist E. F. Benson satirised the style in his book Queen Lucia; \"the famous smoking-parlour, with rushes on the floor, a dresser ranged with pewter tankards, and leaded lattice-windows of glass so antique that it was practically impossible to see out of them...sconces on the walls held dim iron lamps, so that only those of the most acute vision were able to read\"."]}, {"page": "Nicholas Woodeson", "response": ["In the two 2005–06 HBO/BBC TV series of Rome, he played Posca, the personal slave of Julius Caesar.  In 2007, he played Joseph Novak in 'Broken Souls', an episode of Foyle's War. In 2010, he appeared as Alexander Grozin, president of the fictional Eastern European state of Turgisia, in DR television production of Borgen. In 2013, he played William Corcoran, a proponent of Lamarckism, in the episode “Am I not Monstrous?” of Ripper Street.https://www.imdb.com/title/tt2782526/ IMDB – \"Ripper Street\" Am I Not Monstrous? He also appeared in Agatha Christie’s Poirot “Dead Man’s Folly” as Detective Sergeant Hoskins. In 2014, he appeared as Volkov in the American miniseries The Assets, and as Algernon Wyse in a BBC TV adaptation of E. F. Benson's Mapp and Lucia. In 2014, he played Yaakov in \"The Eichmann Show\" for the BBC.  In 2016, Woodeson played the role of Reverend Matthew Denning in the BBC TV series The Living and the Dead. He has also appeared in episodes of New Tricks, George Gently and Holby City.  Woodeson played the lawyer, Thoyt in the BBC One 2017 television drama series Taboo."]}]}}