{"wiki_id": "http://www.wikidata.org/entity/Q7731028", "itemLabel": "The Drill", "itemDescription": "Disc jockey, electro house/electroclash artist,", "wikipedia_url": "https://en.wikipedia.org/wiki/The_Drill_(band)", "wikipedia_page": {"main": "The Drill is an international chart topping house music record written produced and performed by electronic music pioneer and Israeli-born UK producer Matt Schwartz. He is also responsible for hits under his \"Dada\" and \"Deepest Blue\" and M'Black guises.\nPopular again in 2021 in Poland, due to an emerging meme \"Drill Alert\".", "link_mentions": [{"page": "Drill (disambiguation)", "response": ["* The Drill (band), an electro house band", "* The Drill (album), a 1991 album by Wire"]}, {"page": "Matt Schwartz", "response": ["Blackgold had 4 releases amongst them 'Dancing in the dark' by 4tune500 who was an outfit for Matt and Jo Mills which went on to sell 15,000 Vinyls. Destined is highly respected on the underground scene and had a few hits to date including The Drill, DADA and Deepest Blue, his composition of Shooting Star was the theme tune for Sky Sports for 3 years.", "As an Electronica producer and artist, Schwartz went on to top dance charts all over the world, his music and songs appearing on numerous TV programs and films (Including blockbusters such as Day of the jackal and The matrix, Sky sports, Fashion TV and most of the UK music TV channels), he cracked the top 10 in several countries and continents selling several million CD singles, Albums, Vinyl, downloads and compilations with a string of international hits under many different names such as M'black, DADA, The Drill, 4tune500 and Deepest Blue all starting their life on his Destined imprint, Matt usually plays all the instruments on his artist records.", "In 2005 Matt took his first step as a DJ performing at the Paris Techno parade to 400,000 people as The Drill.", "He has since played many international gigs under his 'The Drill sound system' and 'DADA sound system' and with his Deepest Blue Project.", "| The Drill", "| \"The Drill\"", "* 2005 'The Drill'  – \"The Drill\"", "* 2005 'The Drill'  – \"One More Night\"", "* 2008 'Piano Mano' – The Drill Ft. Firetruck and Antarctica – No 2 Buzz Charts, No 5 Cool Cuts No'1 Download charts"]}, {"page": "The Drill", "response": ["The Drill may refer to:", "* The Drill (Avatar: The Last Airbender), the 33rd episode of Avatar: The Last Airbender", "* The Drill (album) by Wire", "* Matt Schwartz (born 1971), United Kingdom DJ, also known as The Drill", "* The Drill (band), house music group of UK producer Matt Schwartz"]}, {"page": "The Drill (Artist)", "response": ["#REDIRECT The Drill (band)"]}, {"page": "Nima Nourizadeh", "response": ["| \"The Drill\" ", "| The Drill"]}, {"page": "List of Club 40 number-one hits", "response": ["|The Drill", "|\"The Drill\""]}, {"page": "THE DRILL (ARTIST)", "response": ["#REDIRECT The Drill (band)"]}]}}