{"wiki_id": "http://www.wikidata.org/entity/Q773923", "itemLabel": "Ian McCulloch", "itemDescription": "Scottish actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McCulloch_(actor)", "wikipedia_page": {"main": "Ian McCulloch (born 18 November 1939) is a Scottish actor of stage, film, and television.McCulloch is perhaps best known for his role as Greg Preston in the post-apocalyptic 1975–1977 TV series Survivors and for his work in European genre cinema.", "link_mentions": [{"page": "1981 in film", "response": ["| Zombi 2 || Variety Film / The Jerry Gross Organization || Lucio Fulci (director); Elisa Briganti, Dardano Sacchetti (screenplay); Tisa Farrow, Ian McCulloch, Richard Johnson, Al Cliver, Auretta Gay, Stefania D'Amario, Olga Karlatos || Zombie || Live action"]}, {"page": "1979 in film", "response": ["*Zombi 2, directed by Lucio Fulci, starring Tisa Farrow, Ian McCulloch, Richard Johnson – (Italy)"]}, {"page": "Survivors (1975 TV series)", "response": ["The series' main actors included Carolyn Seymour (Abby), Lucy Fleming (Jenny), Ian McCulloch (Greg), and Denis Lill (Charles). The child actor Stephen Dudley (John) was given his part by his father, the show's producer Terence Dudley; while the child actress Tanya Ronder (who in series 1 and 2 played Lizzie) is the daughter of Jack Ronder, who wrote eight episodes of Survivors. In addition, the few appearances of Greg and Jenny's baby son Paul on Survivors saw Lucy Fleming's real-life son Diggory appear as Paul, although uncredited. Notable guest stars in the series included Patrick Troughton, Peter Jeffrey, Brian Blessed, George Baker, Philip Madoc, Bryan Pringle, Iain Cuthbertson, and Peter Bowles. Appearing in the series before becoming famous were Kevin McNally (Pirates of the Caribbean), Robert Fyfe (Last of the Summer Wine), Denis Lawson (Star Wars), David Neilson (Coronation Street), Peter Duncan (Blue Peter), June Brown (EastEnders), David Troughton, and Roger Lloyd-Pack (Only Fools and Horses and The Vicar of Dibley).", "A BBC Four documentary, entitled The Cult of... Survivors, featuring interviews with actors Lucy Fleming, Ian McCulloch, and Carolyn Seymour, director Pennant Roberts, and scriptwriter Martin Worth, was broadcast on 5 December 2006, as part of the channel's Science Fiction Britannia series.  The Cult of... series also included documentaries on Blake's 7 (another series devised by Terry Nation) and Doomwatch (produced by Terence Dudley).", "* Ian McCulloch as Greg Preston (eps. 2-13)", "* Ian McCulloch as Greg Preston (eps. 1-8, 10-13)", "* Ian McCulloch as Greg Preston (eps. 2, 10)", "*Audio commentary on episode Law And Order recorded on 5 June 2003, with Ian McCulloch (Greg Preston) and Lucy Fleming (Jenny Richards). Moderator: Andy Priestner.", "*On-camera interviews with Pennant Roberts, Carolyn Seymour, Ian McCulloch, Lucy Fleming and Tanya Ronder (Lizzie Willoughby). All on-camera interviews recorded on 5 June 2003."]}, {"page": "Children's Ward", "response": ["|Ian McCulloch"]}, {"page": "Zombi 2", "response": ["Zombi 2 is a 1979 Italian zombie film directed by Lucio Fulci. It was adapted from an original screenplay by Dardano Sacchetti to serve as a sequel to George A. Romero's Dawn of the Dead (1978), which was released in Italy with the title Zombi. It stars Tisa Farrow, Ian McCulloch, and Richard Johnson, and features a score by frequent Fulci collaborator Fabio Frizzi. Frizzi's score has been released independently of the film, and he has performed it live on tour.", "An abandoned boat drifts into New York Harbor, and is boarded by two harbor patrolmen. A zombie kills one of the patrolmen, but is shot by the man’s partner and falls overboard; the dead patrolman's body is taken to the morgue. Anne Bowles (Tisa Farrow) is questioned by police, as the boat belonged to her father. She claims he is conducting research on Matul, a Caribbean island. British journalist Peter West (Ian McCulloch), is investigating the story; he and Bowles learn that Bowles' father is suffering from a strange illness on the island. They hire a boat and two guides—Brian Hull (Al Cliver) and his girlfriend Susan Barrett (Auretta Gay)—to reach Matul."]}, {"page": "Katsunosuke Hori", "response": ["*Zombi 2 (1982 TBS edition) (Peter West (Ian McCulloch))"]}, {"page": "Return of the Saint", "response": ["| 1–09 || 5 November 1978 || \"The Arrangement\" || Carolyn Seymour, Sarah Douglas, Michael Medwin, Ian McCulloch, Donald Pickering, Peter Burton, David Healy, Reg Lye, Sandra Dickinson, Edmund Pegge"]}, {"page": "Hammer House of Horror", "response": ["Film music composer David Winter (Jon Finch) lives with his actress wife Mary (Prunella Gee) in a secluded farmhouse. David is upset because he knows Mary is having an affair with someone, who happens to be David's own psychiatrist Dr Charles (Ian McCulloch). One night during a storm, when Mary is away, a young woman named Lucinda Jessop (Patricia Quinn) appears in the farmhouse stable. She tells David she is a witch from the 17th century and has used her powers to travel in time to the 20th century in order to escape from witch hunters who wanted to burn her at the stake at the very same farmhouse. David doesn't believe her and locks her in one of the bedrooms of the house. He calls Dr Charles who visits David but, when Lucinda has miraculously vanished from the locked room, he thinks David is simply hallucinating. After Charles leaves, Lucinda reappears and seduces David using witchcraft."]}, {"page": "Talfryn Thomas", "response": ["In 1975, Thomas appeared as Tom Price in seven episodes of the first series of the BBC TV series, Survivors, acting alongside main stars Carolyn Seymour, Ian McCulloch and Lucy Fleming, before the character of Tom was killed off in the tenth episode of the first series. In 1979, Thomas appeared on The Ken Dodd Laughter Show with Rita Webb and Pat Ashton (and he was a regular on Ken Dodd's BBC radio comedy show)."]}, {"page": "Cromwell (film)", "response": ["* Ian McCulloch as John Hampden: a leading parliamentarian and one of the five members whom the king attempted to arrest."]}, {"page": "McCulloch", "response": ["*Ian McCulloch (singer) (born 1959), English singer", "*Ian McCulloch (actor) (born 1939), Scottish actor", "*Ian McCulloch (snooker player) (born 1971), English snooker player"]}, {"page": "List of Dempsey and Makepeace episodes", "response": ["| Ian Thompson, Brian Croucher, Ian McCulloch, Maureen O'Farrell, Angus MacKay, Neville Jason, Steve Emerson, Michael Cashman, Christopher Saul, Mike Mungarvan"]}, {"page": "Ian McCulloch (Actor)", "response": ["#REDIRECT Ian McCulloch (actor) "]}, {"page": "Ian McCulloch", "response": ["Ian McCulloch may refer to:", "* Ian McCulloch (actor) (born 1939), British actor", "* Ian McCulloch (singer) (born 1959), English singer, notably of Echo and the Bunnymen", "* Ian McCulloch (snooker player) (born 1971), English snooker player", "* Ian McCulloch (footballer) (born 1948), Australian rules football player for Fitzroy and East Perth"]}, {"page": "Colditz (1972 TV series)", "response": ["*Lieutenant Page (Ian McCulloch) - Lieutenant Page is an antisocial and violent late addition to the British contingent, who appears to have little knowledge of the air force, despite claiming to be an air force officer. Page is not his real name but the identity of the Lysander pilot who was killed while inserting him into France. This character is a British Secret agent on his thirteenth mission and is known to, and being hunted by, the Gestapo. Suffering from Post Traumatic stress syndrome he sees his identity change as a chance to escape the war and hide out in Colditz, the last place the Gestapo would look for him. "]}, {"page": "Ian", "response": ["*Ian McCulloch (actor) (born 1939), actor", "*Ian McCulloch (singer), singer in the band Echo & the Bunnymen", "*Ian McCulloch (snooker player) (born 1971), snooker player"]}, {"page": "List of Bergerac episodes", "response": ["| Ian McCulloch, Bernard Archard, Nicolas Chagrin, Carole Ashby, Arthur Blake, Gilbert Wynne, Jon Croft, Patrick Duncan, Leonie Mellinger, Stephen Riddle"]}, {"page": "List of The Professionals episodes", "response": ["| Michael Coles, Ian McCulloch, Nickolas Grace, Walter Randall, Mark Wingett, Bill McGuirk, John Barrard, Paul Herzberg, Clifford Earl"]}, {"page": "Zombi (film series)", "response": ["*Zombie Holocaust (1980), a.k.a. Doctor Butcher, M.D., has also been released as Zombie 3 – the film  stars Ian McCulloch, who appeared in Zombi 2. "]}, {"page": "It! (1967 film)", "response": ["* Ian McCulloch as Detective Wayne"]}, {"page": "1939 in the United Kingdom", "response": ["**Ian McCulloch, actor"]}, {"page": "Contamination (film)", "response": ["Contamination (also known as Alien Contamination, Toxic Spawn or Larvae) is a 1980 science fiction-horror film directed by Luigi Cozzi and starring Ian McCulloch. The film is about an alien cyclops creature that uses human agents to place eggs all over Earth. The eggs release a gelatinous goo that causes people to explode when they come into physical contact with the substance.", "* Ian McCulloch as Commander Ian Hubbard", "The film's production offices were in the same building as those used by the makers of Zombi 2 and, impressed by the profits that film had made, Cozzi decided to try to hire the same cast members, although ultimately Ian McCulloch was the only actor to work on Contamination. Cozzi wanted to use Caroline Munro (who had been featured in Starcrash) as Colonel Holmes but once again the producer overruled him and hired Louise Marleau instead."]}, {"page": "List of Bergerac cast members", "response": ["*Ian McCulloch"]}, {"page": "Woolverstone Hall School", "response": ["* Ian McCulloch (actor and writer)"]}, {"page": "Festival of Fantastic Films", "response": ["The 20th Festival was held on the 16–18 October 2009 with Emily Booth, John Carson, Jenny Hanley, John Hough, Ian McCulloch, Derren Nesbitt and Peter Sasdy appearing. The winner of the best Independent Feature film at the 20th International Festival was Kirk, a community project film by the Strathendrick Film Society, directed by Michael Ferns and produced by Joan Macpherson."]}, {"page": "Abertoir", "response": ["* Ian McCulloch (2014)"]}, {"page": "Zombie Holocaust", "response": ["In New York City a hospital worker is found to have been devouring bodies in the morgue. Morgue assistant and anthropology expert Lori (Alexandra Delli Colli) discovers he was from the Asian Molucca islands where she grew up. Dr. Peter Chandler (Ian McCulloch) investigates, and he and Lori discover that similar corpse mutilations have occurred in other city hospitals, where immigrants from this region are working.", "* Ian McCulloch as Dr. Peter Chandler"]}, {"page": "The Ghoul (1975 film)", "response": ["The Ghoul is a 1975 British Tyburn Film Productions horror film directed by Freddie Francis and starring Peter Cushing, John Hurt, Alexandra Bastedo, Veronica Carlson, Gwen Watford, Don Henderson and  Ian McCulloch. In the United States, the film was released as Night Of The Ghoul and The Thing In The Attic.", "*  Ian McCulloch as Geoffrey  "]}, {"page": "List of science fiction films of the 1980s", "response": ["|Contamination||Luigi Cozzi||Ian McCulloch, Louise Marleau, Marino Masé||ItalyWest Germany||Horror"]}, {"page": "List of Scottish actors", "response": ["*Ian McCulloch (born 1939)"]}, {"page": "List of Italian films of 1979", "response": ["| Zombie Holocaust  || Marino Girolami|| Ian McCulloch||Horror||"]}, {"page": "List of Italian films of 1980", "response": ["| Contamination ||  || Ian McCulloch, Louise Marleau, Marino Masé ||Horror, science fiction ||Italian-West German co-production"]}, {"page": "Running Blind (Bagley novel)", "response": ["In 1979 the BBC aired a three part espionage thriller with the same title based on the novel, starring Stuart Wilson, Ragnheiður Steindórsdóttir,  George Sewell and Vladek Sheybal, and featured among others Ian McCulloch, Richard Hurndall, Ed Bishop, Joe Praml and Flosi Olafsson.  It was made by BBC Scotland and largely filmed on location in Iceland.Running Blind (1979) Internet Movie Database websiteBFI.org"]}, {"page": "Nile (TV series)", "response": ["*Ian McCulloch & Adrian Sandy as James Grant"]}, {"page": "Balmaclellan", "response": ["*Ian McCulloch, actor lives with his wife the artist Mary-Clare Cornwallis at Balmaclellan."]}, {"page": "Behind the Scenes of Total Hell: The Jamie Gunn Chronicles", "response": ["The film features a narration from Norman Lovett (best known for playing Holly in Red Dwarf) and Ian McCulloch, known for playing Peter West in Zombi 2."]}]}}