{"wiki_id": "http://www.wikidata.org/entity/Q773760", "itemLabel": "Frederick Taylor", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Taylor_(historian)", "wikipedia_page": {"main": "Frederick Taylor (born 28 December 1947 at Aylesbury, Buckinghamshire) is a British novelist and historian specialising in modern German history.\nHe was educated at Aylesbury Grammar School and read History and Modern Languages at Oxford University. He did postgraduate work at Sussex University on the rise of the extreme right in Germany in the early twentieth century. Before embarking on the series of historical monographs for which he is best known, he translated The Goebbels Diaries 1939–1941 into English and wrote novels set in Germany.", "link_mentions": [{"page": "Konrad Adenauer", "response": ["Adenauer ensured a generally free and democratic society, except the banning of the communist party and the BND spying on SPD on behalf of the CDU (see #Intelligence services and spying), and laid the groundwork for Germany to reenter the community of nations and to evolve as a dependable member of the Western world. It can be argued that because of Adenauer's policies, a later reunification of both German states was possible, and unified Germany has remained a solid partner in the European Union and NATO. The British historian Frederick Taylor argued that in many ways the Adenauer era was a transition period in values and viewpoints from the authoritarianism that characterized Germany in the first half of the 20th century to the more democratic values that characterized the western half Germany in the second half of the 20th century.Taylor, Frederick Exorcising Hitler, London: Bloomsbury Press, 2011 page 371."]}, {"page": "Luftwaffe", "response": ["British historian Frederick Taylor asserts that \"all sides bombed each other's cities during the war. Half a million  Soviet citizens, for example, died from German  bombing during the invasion and occupation of Russia. That's roughly equivalent to the number of German citizens who died from Allied raids.\""]}, {"page": "Ultra", "response": ["* Arthur \"Bomber\" Harris, officer commanding RAF Bomber Command, was not cleared for Ultra. After D-Day, with the resumption of the strategic bomber campaign over Germany, Harris remained wedded to area bombardment. Historian Frederick Taylor argues that, as Harris was not cleared for access to Ultra, he was given some information gleaned from Enigma but not the information's source. This affected his attitude about post-D-Day directives to target oil installations, since he did not know that senior Allied commanders were using high-level German sources to assess just how much this was hurting the German war effort; thus Harris tended to see the directives to bomb specific oil and munitions targets as a \"panacea\" (his word) and a distraction from the real task of making the rubble bounce."]}, {"page": "Winston Churchill", "response": ["British historian Frederick Taylor has pointed out that the number of Soviet citizens who died from German bombing was roughly equivalent to the number of German citizens who died from Allied raids. Jenkins asks if Churchill was moved more by foreboding than by regret but admits it is easy to criticise with the hindsight of victory. He adds that the area bombing campaign was no more reprehensible than President Truman's use of the second atomic bomb on Nagasaki six months later. Andrew Marr, quoting Max Hastings, says that Churchill's memorandum was a \"calculated political attempt..... to distance himself..... from the rising controversy surrounding the area offensive\"."]}, {"page": "Bombing of Dresden in World War II", "response": ["On 31 January, Bottomley sent Portal a message saying a heavy attack on Dresden and other cities \"will cause great confusion in civilian evacuation from the east and hamper movement of reinforcements from other fronts\". British historian Frederick Taylor mentions a further memo sent to the Chiefs of Staff Committee by Air Marshal Sir Douglas Evill on 1 February, in which Evill states interfering with mass civilian movements was a major, even key, factor in the decision to bomb the city centre. Attacks there, where main railway junctions, telephone systems, city administration and utilities were, would result in \"chaos\". Ostensibly, Britain had learned this after the Coventry Blitz, when loss of this crucial infrastructure had supposedly longer-lasting effects than attacks on war plants.", "Strafing of civilians has become a traditional part of the oral history of the raids, since a March 1945 article in the Nazi-run weekly newspaper Das Reich claimed this had occurred. Historian Götz Bergander, an eyewitness to the raids, found no reports on strafing for 13–15 February by any pilots or the German military and police. He asserted in Dresden im Luftkrieg (1977) that only a few tales of civilians being strafed were reliable in detail, and all were related to the daylight attack on 14 February. He concluded that some memory of eyewitnesses was real, but that it had misinterpreted the firing in a dogfight as deliberately aimed at people on the ground. In 2000, historian Helmut Schnatz found an explicit order to RAF pilots not to strafe civilians on the way back from Dresden. He also reconstructed timelines with the result that strafing would have been almost impossible due to lack of time and fuel.Helmut Schnatz, Tiefflieger über Dresden? Legenden und Wirklichkeit (Böhlau, 2000, ), pp. 96, 99 Frederick Taylor in Dresden (2004), basing most of his analysis on the work of Bergander and Schnatz, concludes that no strafing took place, although some stray bullets from aerial dogfights may have hit the ground and been mistaken for strafing by those in the vicinity. The official historical commission collected 103 detailed eyewitness accounts and let the local bomb disposal services search according to their assertions. They found no bullets or fragments that would have been used by planes of the Dresden raids.", "The sirens started sounding in Dresden at 21:51 (CET). Frederick Taylor writes that the Germans could see that a large enemy bomber formation—or what they called \"ein dicker Hund\" (lit: a fat dog, a \"major thing\")—was approaching somewhere in the east. At 21:39 the Reich Air Defence Leadership issued an enemy aircraft warning for Dresden, although at that point it was thought Leipzig might be the target. At 21:59 the Local Air Raid Leadership confirmed that the bombers were in the area of Dresden-Pirna. Taylor writes the city was largely undefended; a night fighter force of ten Messerschmitt Bf 110Gs at Klotzsche airfield was scrambled, but it took them half an hour to get into an attack position. At 22:03 the Local Air Raid Leadership issued the first definitive warning: \"Warning! Warning! Warning! The lead aircraft of the major enemy bomber forces have changed course and are now approaching the city area\". Some 10,000 fled to the great open space of the Grosse Garten, the magnificent royal park of Dresden, nearly one and a half square miles in all. Here they were caught by the second raid, which started without an air-raid warning, at 1:22 a.m.  At 11:30 a.m., the third wave of bombers, the two hundred eleven American Flying Fortresses, began their attack.", "On 25 February, a new leaflet with photographs of two burned children was released under the title \"Dresden—Massacre of Refugees\", stating that 200,000 had died. Since no official estimate had been developed, the numbers were speculative, but newspapers such as the Stockholm Svenska Morgonbladet used phrases such as \"privately from Berlin,\" to explain where they had obtained the figures. Frederick Taylor states that \"there is good reason to believe that later in March copies of—or extracts from—[an official police report] were leaked to the neutral press by Goebbels's Propaganda Ministry ... doctored with an extra zero to increase [the total dead from the raid] to 202,040\". On 4 March, Das Reich, a weekly newspaper founded by Goebbels, published a lengthy article emphasising the suffering and destruction of a cultural icon, without mentioning damage to the German war effort.Evans, Richard. Telling Lies about Hitler: The Holocaust, History and the David Irving Trial p. 165.", "The bombing of Dresden remains controversial and is subject to an ongoing debate by historians and scholars regarding the moral and military justifications surrounding the event.. British historian Frederick Taylor wrote of the attacks: \"The destruction of Dresden has an epically tragic quality to it. It was a wonderfully beautiful city and a symbol of baroque humanism and all that was best in Germany. It also contained all of the worst from Germany during the Nazi period. In that sense it is an absolutely exemplary tragedy for the horrors of 20th century warfare and a symbol of destruction\".Hawley, Charles. \"Dresden Bombing Is To Be Regretted Enormously\" , interview with Frederick Taylor, Spiegel Online, 11 February 2005.", "Frederick Taylor told Der Spiegel, \"I personally find the attack on Dresden horrific. It was overdone, it was excessive and is to be regretted enormously,\" but, \"A war crime is a very specific thing which international lawyers argue about all the time and I would not be prepared to commit myself nor do I see why I should. I'm a historian.\" Similarly, British philosopher A. C. Grayling has described RAF area bombardment as an \"immoral act\" and \"moral crime\" because \"destroying everything... contravenes every moral and humanitarian principle debated in connection with the just conduct of war\", though Grayling insisted that it \"is not strictly correct to describe area bombing as a 'war crime'.\""]}, {"page": "Spiegel affair", "response": ["The scandal temporarily halted Strauss' political career and was remembered by many when Strauss ran for Bundeskanzler in 1980, clearly losing against his SPD opponent (and incumbent) Helmut Schmidt. However, it is mostly remembered for altering the political culture of post-war West Germany and – with the first mass demonstrations and public protests – being a turning point from the old Obrigkeitsstaat (authoritarian state) to a modern democracy. The British historian Frederick Taylor argued that the Federal Republic under Adenauer retained many of the characteristics of the authoritarian \"deep state\" that existed under the Weimar Republic, and that the Spiegel affair marked an important turning point in German values as ordinary people rejected the old authoritarian outlook in favour of the more democratic values that came to be seen as the bedrock of the Federal Republic.."]}, {"page": "History of Germany (1945–1990)", "response": ["In October 1962, the weekly news magazine Der Spiegel published an analysis of the West German military defense. The conclusion was that there were several weaknesses in the system. Ten days after publication, the offices of Der Spiegel in Hamburg were raided by the police and quantities of documents were seized under the orders of the CSU Defense Minister Franz Josef Strauss. Chancellor Adenauer proclaimed in the Bundestag that the article was tantamount to high treason and that the authors would be prosecuted. The editor/owner of the magazine, Rudolf Augstein spent some time in jail before the public outcry over the breaking of laws on freedom of the press became too loud to be ignored. The FDP members of Adenauer's cabinet resigned from the government, demanding the resignation of Franz Josef Strauss, Defence Minister, who had decidedly overstepped his competence during the crisis by his heavy-handed attempt to silence Der Spiegel for essentially running a story that was unflattering to him (which incidentally was true). The British historian Frederick Taylor argued that the Federal Republic under Adenauer retained many of the characteristics of the authoritarian \"deep state\" that existed under the Weimar Republic, and that the Der Spiegel affair marked an important turning point in German values as ordinary people rejected the old authoritarian values in favor of the more democratic values that are today seen as the bedrock of the Federal Republic. Adenauer's own reputation was impaired by Spiegel affair and he announced that he would step down in the autumn of 1963. His successor was to be the Economics Minister Ludwig Erhard, who was the man widely credited as the father of the \"economic miracle\" of the 1950s and of whom great things were expected."]}, {"page": "Aylesbury Grammar School", "response": ["* Frederick Taylor, historian"]}, {"page": "Strategic bombing during World War II", "response": ["British historian Frederick Taylor asserts that \"all sides bombed each other's cities during the war. Half a million Soviet citizens, for example, died from German bombing during the invasion and occupation of Russia. That's roughly equivalent to the number of German citizens who died from Allied raids.\" The Luftwaffe destroyed numerous Soviet cities through bombing, including Minsk, Sevastopol, and Stalingrad. 20,528 tons of bombs were dropped on Sevastopol in June 1942 alone.Hayward 2001, p. 117. German bombing efforts on the Eastern Front dwarfed its commitments in the west. From 22 June 1941 to 30 April 1944, the Luftwaffe dropped 756,773 tonnes of bombs on the Eastern Front, a monthly average of 22,000 tonnes.Groehler O. Geschichte des Luftkriegs 1910 bis 1980. Berlin, 1981. p. 373."]}, {"page": "Fred Taylor", "response": ["* Frederick Taylor, known as Cyclone Taylor (1884–1979), Canadian ice hockey forward", "* Frederick Taylor (cricketer) (1916–1999), English cricketer", "* Frederick Taylor (colonist) (1810–1872), English colonial property manager, perpetrator of the Murdering Gully massacre", "* Frederick Taylor (historian) (born 1947), British historian", "* Frederick Taylor University, an institution in California, USA", "* Frederick Taylor International University, a defunct unaccredited institution"]}, {"page": "Coventry Blitz", "response": ["At the start of the Second World War, Coventry was an industrial city of around 238,000 people which, like much of the industrial West Midlands, contained metal and wood-working industries. In Coventry's case, these included cars, bicycles, aeroplane engines and, since 1900, munitions factories. In the words of the historian Frederick Taylor, \"Coventry was therefore, in terms of what little law existed on the subject, a legitimate target for aerial bombing\"."]}, {"page": "List of people with surname Taylor", "response": ["* Frederick Taylor (historian) (born 1947), British historian"]}, {"page": "German prisoners of war in the Soviet Union", "response": ["According to Richard Overy, Russian sources state that 356,000 out of 2,388,000 POWs died in Soviet captivity. Overy notes on p.364: \"I am very grateful to James Bacque for letting me see the official figures supplied to him for his work on his book, Crimes and Mercies (London, 1997). The figures are drawn from a report of the chief of the Prison Department of the USSR Ministry of Foreign Affairs on ‘war prisoners of the former European armies for the period 1941 ‐ 1945’, dated 28 April 1956. On contemporary estimates see D. Dallin and B. Nicolaevsky, Forced Labour in Soviet Russia (London, 1948), pp. 277 ‐ 8. On Japan, S. I. Kuznetsov, ‘The Situation of Japanese Prisoners of War in Soviet Camps’, journal of Slavic Military Studies 8 (1995). In his revised Russian language edition of Soviet Casualties and Combat Losses, Krivosheev put the number of German military POWs at 2,733,739 and dead at 381,067 (356,700 German nationals and 24,367 from other nations)G. I. Krivosheev Rossiia i SSSR v voinakh XX veka: Poteri vooruzhennykh sil; statisticheskoe issledovanie OLMA-Press, 2001  Table 198 However, Soviet era sources are disputed by historians in the West, who estimate 3.0 million German POWs were taken by the USSR and up to 1.0 million died in Soviet captivity.  Waitman Wade Beorn states that 35.8% of German POWs died in Soviet custody,Marching into Darkness, 2014, p.59 which is supported by other academic works.Frederick Taylor, Exorcising Hitler: The Occupation and Denazification of Germany, 2011, pp. 184-5Niall Ferguson, Prisoner Taking and Prisoner Killing in the Age of Total War: Towards a Political Economy of Military Defeat, 2004, p. 122"]}, {"page": "British war crimes", "response": ["When asked whether the bombing of Dresden was a war crime, British historian Frederick Taylor replied: \"I really don't know. From a practical point of view, rules of war are something of a grey area. It was pretty borderline stuff in terms of the extent of the raid and the amount of force used.\" Historian Donald Bloxham claims that \"the bombing of Dresden on 13–14 February 1945 was a war crime\". He further argues that there was a strong prima facie for trying Winston Churchill among others and that there is theoretical case that he could have been found guilty. \"This should be a sobering thought. If, however it is also a startling one, this is probably less the result of widespread understanding of the nuance of international law and more because in the popular mind 'war criminal', like 'paedophile' or 'terrorist', has developed into a moral rather than a legal categorisation.\"Addison, Paul & Crang, Jeremy A. (eds). Firestorm: The Bombing of Dresden. Pimlico, 2006; . Chapter 9, p. 180"]}, {"page": "Sir Arthur Harris, 1st Baronet", "response": ["After D-Day (6 June 1944), with the resumption of the strategic bomber campaign over Germany, Harris remained wedded to area bombardment. The historian Frederick Taylor argues that, because Harris lacked the necessary security clearance to know about Ultra, he had been given some information gleaned from Enigma but not informed of the source. According to Taylor, this directly affected Harris's attitude concerning the effectiveness of the post-D-Day 1944 directives (orders) to target oil installations, as Harris did not know the Allied High Command was using high-level German sources to assess exactly how much Allied operations were impairing the German war effort. Harris tended to see the directives to bomb specific oil and munitions targets as a high level command \"panacea\" (his word) and a distraction from the real task of making the rubble bounce in every large German city.Taylor 2004, p. 202. Harris was promoted to the substantive rank of air chief marshal on 16 August 1944."]}, {"page": "Exorcising Hitler", "response": ["Exorcising Hitler: The Occupation and Denazification of Germany is a 2011 book written by Frederick Taylor."]}, {"page": "Winston Churchill in the Second World War", "response": ["British historian Frederick Taylor has pointed out that the number of Soviet citizens who died from German bombing was roughly equivalent to the number of German citizens who died from Allied raids. Jenkins asks if Churchill was moved more by foreboding than by regret but admits it is easy to criticise with the hindsight of victory. He adds that the area bombing campaign was no more reprehensible than President Truman's use of the second atomic bomb on Nagasaki six months later. Andrew Marr, quoting Max Hastings, says that Churchill's memorandum was a \"calculated political attempt..... to distance himself..... from the rising controversy surrounding the area offensive\"."]}]}}