{"wiki_id": "http://www.wikidata.org/entity/Q775665", "itemLabel": "Ronald Ferguson", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Ferguson_(polo)", "wikipedia_page": {"main": "Major Ronald Ivor Ferguson (10 October 1931 – 16 March 2003) was a polo manager, initially to the Duke of Edinburgh and later, for many years, to the Prince of Wales. His daughter, Sarah, Duchess of York, is the former wife of the Duke of York. He was the maternal grandfather of princesses Beatrice and Eugenie.", "link_mentions": [{"page": "March 16", "response": ["*  2003   – Ronald Ferguson, English captain, polo player, and manager (b. 1931)"]}, {"page": "Susan Barrantes", "response": ["On 17 January 1956, Susan married Lieutenant Ronald Ferguson (1931–2003) at St Margaret's, Westminster. He rose to the rank of Major, played polo with the Duke of Edinburgh, and became the Prince of Wales's Polo Manager. Ronald and Susan had two daughters: Jane Louisa, born on 26 August 1957, and Sarah Margaret, later the Duchess of York, born on 15 October 1959."]}, {"page": "Sarah, Duchess of York", "response": ["Sarah Margaret Ferguson was born on 15 October 1959 at London Welbeck Hospital in London. She is the second daughter of Major Ronald Ferguson (1931–2003) and Susan Barrantes (née Wright; 1937–1998). After Ferguson's parents divorced in 1974, her mother married polo player Héctor Barrantes in 1975 and moved to Trenque Lauquen in the Argentine pampas. Sarah stayed at the  Dummer Down Farm at Dummer, Hampshire, her father's home since age 8. Major Ferguson married Susan Deptford in 1976 and had three more children: Andrew, Alice, and Elizabeth. Sarah later mentioned that at the age of 12, when her parents' marriage started to fall apart, she developed an eating disorder and \"turned to overeating for comfort\"."]}, {"page": "Ronald", "response": ["* Ronald Ferguson, father of Sarah, Duchess of York", "* Ronald Ferguson (economist), American researcher of the racial education achievement gap"]}, {"page": "Dummer, Hampshire", "response": ["To the south-west of Dummer village by about  is Dummer Down Farm. This is the site of the Dummer Cricket Centre which was founded by Major Ronald Ferguson, father of Sarah, Duchess of York. The current owner, Andrew Ferguson, was a local councillor on Dummer Parish Council.", "*Ronald Ferguson, father of Sarah, Duchess of York"]}, {"page": "Robert Fellowes, Baron Fellowes", "response": ["Robert Fellowes, Baron Fellowes,  (born 11 December 1941) is a British courtier who was Private Secretary to Queen Elizabeth II from 1990 to 1999, and is also known as a brother-in-law of Diana, Princess of Wales and maternal first cousin of Ronald Ferguson, the father of Sarah, Duchess of York."]}, {"page": "Galloping Major", "response": ["* nickname of Ronald Ferguson (polo), father of Sarah Ferguson, Duchess of York"]}, {"page": "Charles Palmer-Tomkinson", "response": ["Charles Palmer-Tomkinson owns the  Dummer Grange estate near Basingstoke, Hampshire.BBC in Depth: Newsmakers Friday, 30 August 2002, 15:32 GMT 16:32 UK. Retrieved 5 June 2007.\"Tara Palmer-Tomkinson: Still got It?\"The house, Dummer Grange Farm, is described in 1920 as being a 2 storeys and attic house, built of brick with an old tiled roof.  The front is E-shaped with flanking gables. It was built on the site of the 12th century Dummer Grange.  No date is given for the late 17th century house as of 1920. Dummer Grange Farm \"Dummer is located 8 kilometres to the south-west of Basingstoke, with the M3 motorway passing close to its north-eastern boundary.  The village lies within the gently undulating landscape of the central chalk downlands.\"  The village dates back to the 11th century at least, because it is mentioned in the Domesday Book. Dummer Grange was owned by a different family until 1864, and it is not known when Charles Palmer-Tomkinson or his ancestors acquired the estate.  The late Major Ronald Ferguson and his younger daughter Sarah, Duchess of York were close neighbours at the  estate Dummer Down Farm. As of 2006, Palmer-Tomkinson and his wife were living on their Dummer estate."]}, {"page": "Jimmy Maxwell (bandleader)", "response": ["He has performed with or for Rita Moreno, Joel Grey, The 5th Dimension, The Neville Brothers, Harry Connick Sr., Hanson, Peter Duchin, Rich Little, Lou Rawls, Reba McEntire, Al Hirt, The Drifters, Pete Fountain, Diane Schuur, The Vienna Boys' Choir, Alex Donner, Presidents Ronald Reagan, George H. W. Bush, and Bill Clinton, members of Great Britain’s Royal Family (Prince & Princess Michael of York; Princess Margaret, and Prince Andrew), Bill Gates, Major Ronald Ferguson, Henry Kissinger, Colin Powell, former Supreme Court Justice Sandra Day O'Connor, Anne Rice, two-time Heavyweight Boxing Champion George Foreman and the Chicago Bulls."]}, {"page": "Marian Montagu Douglas Scott", "response": ["* Ronald Ferguson (10 October 1931 – 16 March 2003)", "Her second son, Ronald, was the father of Sarah, Duchess of York, and the maternal grandfather of Princesses Beatrice and Eugenie of York. Ronald Ferguson died on 16 March 2003 from a heart attack, after a lengthy battle with skin and prostate cancers.", "Lady Elmhirst died on Wednesday, 11 December 1996, at Dummer, Hampshire, in her 88th year. She was predeceased by two husbands, Andrew Ferguson (4 August 1966) and Sir Thomas Elmhirst (6 November 1982), and her first-born son John Ferguson (d. 1939).  At the time of her death, she was survived by her son, Major Ronald Ferguson, five grandchildren, and five great-grandchildren."]}, {"page": "Richard Swinburn", "response": ["He was the son of Major-General Henry Robinson Swinburn (1897–1981) and Naomi Hull (1903–1992). His maternal grandfather was Major-General Sir Charles Hull and his uncle was Field Marshal Sir Richard Hull. In 1964 he married Jane Elise Brodie who died in 2001. In September 2012, it was announced that he was engaged to Susan Ferguson (née Deptford), the widow of Major Ronald Ferguson and the stepmother of Sarah, Duchess of York. They married in December 2012. Prince Andrew, Sarah, Duchess of York, and their two daughters attended Sir Richard and Lady Swinburn's wedding celebrations."]}, {"page": "Wedding of Prince Andrew and Sarah Ferguson", "response": ["Prince Andrew, the third child and second son of Queen Elizabeth II and Prince Philip, Duke of Edinburgh, and Sarah Ferguson, the daughter of Major Ronald Ferguson and his first wife Susan Wright, first met when they were children, but had not been romantically involved until they met again at a party at Floors Castle in 1985. They began their relationship that very same year, after a party held at Windsor Castle in honour of the Royal Ascot races. Diana, Princess of Wales, Andrew's sister-in-law, played a hand in matchmaking the couple, and the two women later formed a strong friendship."]}, {"page": "Héctor Barrantes", "response": ["His first wife died in a car crash. In 1974, he started an affair with Susan Ferguson, the mother of Sarah Ferguson, who divorced her husband Major Ronald Ferguson and left her two daughters in England.Andrew Morton, Duchess: an intimate portrait of Sarah, Duchess of York, Contemporary Books, 1989, p. 26  In 1975, they married in a civil ceremony in Argentina. They resided on a polo ranch in Guaminí, Argentina."]}, {"page": "List of people from Hampshire", "response": ["*Ronald Ferguson, polo player, was raised in Dummer"]}, {"page": "Deaths in March 2003", "response": ["*Major Ronald Ferguson, 71, father of UK royal divorcée Sarah, Duchess of York."]}, {"page": "Ronald Ferguson", "response": ["Ronald Ferguson or Ron Ferguson may refer to:", "* Ronald Ferguson (polo) (1931–2003), English polo manager", "* Ronald Ferguson (economist) (born 1950), American economist", "* Ronald Ferguson Thomson (1830–1888), British diplomat"]}]}}