{"wiki_id": "http://www.wikidata.org/entity/Q7777443", "itemLabel": "John Counsell", "itemDescription": "British actor and film director (1905-1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Counsell_(theatre_director)", "wikipedia_page": {"main": "John William Counsell  (24 April 1905 – 23 February 1987) was an English actor, director and theatre manager, who (with his wife Mary Kerridge) ran the Theatre Royal, Windsor and its in-house repertory company from the 1930s to the 1980s. His daughter is the actress Elizabeth Counsell, and he was uncle to the actress and painter Jean Miller. Born in Beckenham, to Claud Counsell and Evelyn Fleming, the bulk of Counsell's career was spent in Windsor repertory theatre and the West End stage.\n\n", "link_mentions": [{"page": "Patrick Cargill", "response": ["After the Second World War ended, Cargill returned to Britain to focus on a stage career, and joined Anthony Hawtrey's company at Buxton, Croydon and later the Embassy Theatre at Swiss Cottage in London. He became a supporting player in John Counsell's repertory at Windsor alongside Brenda Bruce and Beryl Reid and scored a huge hit in the revue The World's the Limit, which was seen by the Queen and 26 of her guests one evening. He made his first West End appearance in 1953 in Ian Carmichael's revue High Spirits at the London Hippodrome. He also co-wrote the stage play Ring for Catty, with Jack Beale. The second of the Carry On films, Carry On Nurse, produced in 1959, was based on this play as was the 1962 film Twice Round the Daffodils."]}, {"page": "The Ghost Train (play)", "response": ["* In 1937, another version was produced The Ghost Train, starring Clifford Benn, John Counsell, and Hugh Dempster.", "* On 28 December 1937, the BBC broadcast a forty-minute performance of the play directed by John Counsell.\"Broadcasting\", The Times, 28 December 1937, p. 19 The Times review of the broadcast stating: \"Once more it was very effective, the wind-machine working overtime from the start, doors opening spontaneously as on the best-ordered stages, bells tinkling ominously ... and an excellent train flying madly by beyond the waiting-room windows.\"\"Televised Drama\", The Times, 29 December 1937, p. 8"]}, {"page": "Theatre Royal, Windsor", "response": ["The arrival of talking pictures affected theatre attendance numbers severely and in about 1929 Jack Gladwin converted the Theatre Royal into a cinema. In 1930 John Counsell served as an apprentice at the Theatre Royal when it reopened as a theatre. In 1933 he took over managing the theatre; the venture lasted only a few months before it went bankrupt, but the future King George VI and Queen Elizabeth attended one of the last performances, coming from nearby Windsor Castle.Rowell, G, et al. The Repertory Movement: A History of Regional Theatre in Britain. Cambridge University Press, 1984   Counsell re-opened the theatre in 1938Douglas Mayo for Britishtheatre.com  22 December 2014 Weekly Rep Returns To Theatre Royal Windsor and was able to establish a viable company that ran without government subsidies.  He and his actress wife Mary Kerridge ran the theatre until his retirement in 1986, the year before his death.", "In 1965 the theatre received a major refurbishment and redecoration at a cost in excess of £75,000 undertaken by Carl Toms with the assistance of Sir Anthony Denny, who had been a member of Frank Verity's company, the original architect of the theatre in 1910. Under the management of John Counsell the theatre ran a weekly repertory schedule, changing to fortnightly in the late 1950s and with three-week productions becoming more prevalent in 1963-64. Today the theatre is usually a venue for touring productions, but in addition it produces summer repertory seasons that usually run for about three weeks. The theatre also features an annual pantomime performed in traditional style.", "The Theatre Royal in Windsor is a Grade II listed building and since 1997 has been managed by Bill Kenwright, who performed at the theatre as a young actor in the 1960s and 1970s under John Counsell. Under Kenwright's management the repertoire is wide, ranging from the classics and traditional pantomimes to first productions of new work. Many productions which first appear at the Theatre Royal subsequently transfer to the West End or go on national tour.Theatre Royal, Windsor on the Royal Borough of Windsor and Maidenhead website"]}, {"page": "Mary Kerridge", "response": ["Mary Kerridge (3 April 1914 – 22 July 1999) was an English actress and theatre director, who (with her husband, John Counsell) ran the Theatre Royal, Windsor and its in-house repertory company from the 1930s to the 1980s. Her daughter is the actress Elizabeth Counsell.", "Born in Islington to Ernest Kerridge and Antoinette Fick, she attended Highbury Hill School from 1924 to 1928. Her family later moved to Esher, Surrey and she attended Wimbledon High School from January 1929 to July 1932, having taken her London University Higher Certificate in English, French, Modern History and German in June 1932. At University College London, she studied for the (one year) Intermediate Arts BA. She worked as a secretary, model and receptionist before making her name as an actress. In the middle of 1939 she married John Counsell, the managing director of the Theatre Royal, Windsor. She gave birth to twin daughters in 1942, one of them the actress Elizabeth Counsell."]}, {"page": "Adolf Hitler: My Part in His Downfall", "response": ["Milligan also quotes the memoirs of noted theatre director John Counsell, his sometime deputy battery commander, who noted the laughter in the ranks when Milligan was around, and then after the war, at the height of the Goons' fame, queued with his daughter for autographs.  He received one that showed Milligan remembered him with respect and affection."]}, {"page": "Counsell", "response": ["* John Counsell (pastor) (born 1959), Canadian broadcaster and pastor", "* John Counsell (theatre director) (1905–1987), English actor, director and theatre manager"]}, {"page": "The Return of the Scarlet Pimpernel", "response": ["* John Counsell as Sir John Selton"]}, {"page": "Windsor theatre royal", "response": ["#REDIRECT John Counsell (theatre director)"]}, {"page": "Vanity (1935 film)", "response": ["Vanity is a 1935 British comedy film directed by Adrian Brunel and starring Jane Cain, Percy Marmont and John Counsell. The plot concerns a conceited actress, convinced of the general adoration in which she is held, faking her own death in order to gratify herself by observing the depth of grief caused by her demise. However the actual reactions to the \"news\" prove to be far from what she had expected.", "* John Counsell as Dick Broderick"]}, {"page": "Oliver Battcock", "response": ["As an actor, under the name Oliver Gordon, he made his West End debut in The Midshipmaid in August 1931. He subsequently played opposite such stage stars as Gerald du Maurier (in Diplomacy, 1933) and Seymour Hicks (in Vintage Wine, 1934),'Obituary: Oliver Gordon', The Stage, 1 October 1970, page 19. as well as appearing in several films. During World War II he ran the Theatre Royal, Windsor, inaugurating its longstanding tradition of lavish pantomimes. According to John Counsell, founder of the Windsor Repertory Company, he was able \"for five years to maintain, in spite of the strains and stresses of man and woman power shortage, of rationing and lack of materials, an astonishingly high level of production.\"Curtain Up [magazine programme of the Theatre Royal, Windsor], 12-31 October 1970, page 14. In later years he was closely associated as director-producer with both the Alexandra Theatre, Birmingham and Salisbury Playhouse; among his final credits, at Salisbury, was Widow Twankey in Aladdin (1969-70), which he also directed. "]}, {"page": "David Simeon", "response": ["Simeon  married the actress Elizabeth Counsell (daughter of John Counsell and Mary Kerridge), in 1978 and had a son in 1979."]}, {"page": "Elizabeth Counsell", "response": ["Counsell is the daughter of actress Mary Kerridge and stage director John Counsell, who together ran the Theatre Royal, Windsor. In the 1970s she married the actor David Simeon, and in 1979 gave birth to a son."]}, {"page": "Jean Miller", "response": ["Jean Miller (12 August 1929 – 10 January 2014) was an English actress and painter. She began her career at the Theatre Royal, Windsor which was then run by her aunt and uncle Mary Kerridge and John Counsell. There she met her husband, Michael Miller, with whom she had a son and two daughters. She performed on the West End, toured with Dame Flora Robson, and acted Shakespeare at the Festival of Britain. In later life she became a successful painter, with Sir Arnold Wesker (an avid collector) describing her as “a life-enhancer”, and the artist Cecily Sash calling her “a kind of Matisse on speed”. She died after an eight-year struggle with breast cancer in 2014."]}, {"page": "John Counsell", "response": ["John Counsell may refer to:", "* John Counsell (theatre director) (1905-1987), English actor, director and theatre manager.", "* John Counsell (pastor), Canadian pastor and broadcaster."]}, {"page": "Marcelle Maurette", "response": ["The peak of her career came in the 1950s as a result of writing Anastasia. This play quickly moved beyond France to six other European countries and to the USA.Anastasia by Marcelle-Maurette, Review by Lois Marie Sutton in Books Abroad, Vol. 31, No. 4 (Autumn, 1957), p. 384 An English translation/adaptation by Guy Bolton (1952) was staged in England by Mary Kerridge and John Counsell, then in 1953 shown on televisionBFI record where Vivien Leigh saw it and recommended it to her husband Laurence Olivier for a London production at the St. James's Theatre.'Film Of Anastasia', The Times, 23 Sep.1953, p2 It opened in New York on Broadway at the Lyceum in early 1955. In 1956 the play was presented at the Falmouth Playhouse in Massachusetts with the Mexican actress Dolores del Río and continued with a tour of seven other theaters throughout New England. Then, after bidding in competition with Warner and Metro-Goldwyn-Mayer, 20th Century Fox bought the rights for the 1956 film version of Anastasia with Ingrid Bergman and Yul Brynner, for \"more than £20,000\"."]}]}}