{"wiki_id": "http://www.wikidata.org/entity/Q7781698", "itemLabel": "Theodore Beck", "itemDescription": "British academic (1859-1899)", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Beck", "wikipedia_page": {"main": "Theodore Beck (4 July 1859 Stoke Newington – 2 September 1899, Shimla) was a Quaker and British educationalist working for the British Raj in India. From 1883 until his death in 1899 he was Principal of Muhammadan Anglo-Oriental College, which later became Aligarh Muslim University.", "link_mentions": [{"page": "Battle of Agincourt", "response": ["Henry's army landed in northern France on 13 August 1415, carried by a vast fleet. It was often reported to comprise 1,500 ships, but was probably far smaller. Theodore Beck also suggests that among Henry's army was \"the king's physician and a little band of surgeons\". Thomas Morstede, Henry V's royal surgeon, had previously been contracted by the king to supply a team of surgeons and makers of surgical instruments to take part in the Agincourt campaign. The army of about 12,000 men and up to 20,000 horses besieged the port of Harfleur.Guardian newspaper:French correction: Henry V's Agincourt fleet was half as big, historian claims, 28 July 2015 The siege took longer than expected. The town surrendered on 22 September, and the English army did not leave until 8 October. The campaign season was coming to an end, and the English army had suffered many casualties through disease. Rather than retire directly to England for the winter, with his costly expedition resulting in the capture of only one town, Henry decided to march most of his army (roughly 9,000) through Normandy to the port of Calais, the English stronghold in northern France, to demonstrate by his presence in the territory at the head of an army that his right to rule in the duchy was more than a mere abstract legal and historical claim. He also intended the manoeuvre as a deliberate provocation to battle aimed at the dauphin, who had failed to respond to Henry's personal challenge to combat at Harfleur."]}, {"page": "Syed Ahmad Khan", "response": ["By 1873, the committee under Sir Syed issued proposals for the construction of a college in Aligarh. Maulvi Samiullah Khan was appointed as the secretary of the sub-committee of the proposed school.Hasan 2006, p. 43 Members of the committee toured the country in order to raise funds for the school which was finally  established on 24 May 1875 in Aligarh as the Muhammadan Anglo-Oriental Collegiate School. Two years later, in 1877, the school was converted into the Muhammadan Anglo-Oriental College.Hasan 2006, p. 43, 44 He retired from his career as a jurist the following year, concentrating entirely on developing the college and on religious reform. Sir Syed's pioneering work received support from the British.Kidwai 2020, p. 48 Although intensely criticised by orthodox religious leaders hostile to modern influences, Sir Syed's new institution attracted a large student body, mainly drawn from the Muslim gentry and middle classes. However, MAO College was open to all communities, and had a sizeable number of Hindu students. The first graduate of the college was a Hindu.Kidwai 2020, p. 49 The curriculum at the college involved scientific and Western subjects, as well as Oriental subjects and religious education. The first chancellor was Sultan Shah Jahan Begum, a prominent Muslim noblewoman, and Sir Syed invited an Englishman, Theodore Beck, to serve as the first college principal. The college was originally affiliated with Calcutta University but was transferred to the Allahabad University in 1885. Near the turn of the 20th century, it began publishing its own magazine and established a law school. In 1920, the college was transformed into Aligarh Muslim University.Kidwai 2020, p. 49"]}, {"page": "Thomas Walker Arnold", "response": ["Thomas Walker Arnold was born in Devonport, Plymouth on 19 April 1864, and educated at the City of London School. From 1888 he worked as a teacher at the Muhammadan Anglo-Oriental College, Aligarh. In 1892 he married Celia Mary Hickson, a niece of Theodore Beck. In 1898, he accepted a post as Professor of Philosophy at the Government College, Lahore and later became Dean of the Oriental Faculty at Punjab University. From 1904 to 1909 he was on the staff of the India Office as Assistant Librarian. In 1909 he was appointed Educational Adviser to Indian students in Britain. From 1917 to 1920 he acted as Adviser to the Secretary of State for India. He was Professor of Arabic and Islamic Studies at the School of Oriental Studies, University of London, from 1921 to 1930."]}, {"page": "Beck (surname)", "response": ["* Theodore Beck, first principal of the MAO College at Aligarh, India"]}, {"page": "Syed Mahmood", "response": ["Shortly after returning to India after his studies in England in 1872, Syed Mahmood wrote a proposal for the establishment of a self-supporting Muslim college in India based on the model he had experienced at Cambridge University.Husain, Yusuf 1967, p. 222-237. He then assisted his father, Sir Syed, in founding the Muhammadan Anglo-Oriental College at Aligarh, and continued to play a vital role in its administration even while working as a lawyer and judge in Allahabad. In 1883, he returned to England to recruit Theodore Beck to serve as the school's principal. He took an active part in teaching English classes and establishing a law program at the school, donating a major portion of his own collection of legal texts to form a legal library.Guenther 2004, p. 101-103. In 1889, his father nominated Mahmood as Joint Secretary of the board of trustees for the school. After his father's death in 1898, he took up his responsibilities as Life Honorary Joint Secretary. The following year he was replaced in this position by Nawab Mohsin-ul-Mulk, and was elevated to the post of Honorary President instead."]}, {"page": "Aligarh Institute Gazette", "response": ["The Aligarh Institute Gazette () was the first multilingual journal of India, introduced, edited, and published in 1866 by Sir Syed Ahmed Khan which was read widely across the country. Theodore Beck later became its editor."]}, {"page": "Aligarh Movement", "response": ["* Theodore Beck, second Principal of MAO College"]}, {"page": "Henry George Impey Siddons", "response": ["The debating club Siddons Union Club at M. A. O. College was named after him. He was succeeded by Theodore Beck."]}, {"page": "Siddons Union Club", "response": ["The Siddons Union Club chaired by Theodore Beck had organised a debate on 15 November 1884 over the motion of 'Spread of Female Education in India is to be desired but by home tuition and not by schools and colleges'. The motion was defeated by 3 votes."]}, {"page": "Cricket Club, Aligarh Muslim University", "response": ["Cricket at Aligarh Muslim University started in 1878 when the mathematics professor, Rama Shankar Mishra, founded a cricket club, whose members were expected to wear a uniform of blue flannel coat, shirt, knickerbockers and cap. The club didn't at first thrive. It was not till Theodore Beck arrived in 1883 that real interest in cricket and sports began.", "The club toured Simla, Patiala and Bombay and performed very well. In 1884 Theodore Beck took the club on a tour round the Punjab including a match against Government College, Lahore."]}, {"page": "Muhammadan Anglo-Oriental College", "response": ["* Theodore Beck (1884–1899)"]}, {"page": "Hindu–Muslim unity", "response": ["In the Indian Rebellion of 1857, many Hindus and Muslims in India joined together as Indians to fight against the British East India Company. The British government became concerned about this rise in Indian nationalism therefore; according to some writers, they tried to stir up communalistic feelings among Hindus and Muslims so that they might not again unite to try and overthrow crown rule. For example, Theodore Beck, the principal of Muhammadan Anglo-Oriental College, had told Syed Ahmad Khan that Muslims should have no sympathy with the objectives of the Indian National Congress and \"that Anglo-Muslims unity was possible, but Hindu–Muslims unity was impossible\"."]}]}}