{"wiki_id": "http://www.wikidata.org/entity/Q7787918", "itemLabel": "Thomas Brodie", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Brodie", "wikipedia_page": {"main": "Major General Thomas Brodie, CB, CBE, DSO (20 November 1903 – 1 September 1993) was a British Army officer who saw service in World War II, Palestine and the Korean War. After retirement in 1955, he became involved with the British pressure group, the Economic League.\n\n", "link_mentions": [{"page": "1st Infantry Division (United Kingdom)", "response": ["* 1952–1955 Major-General Thomas Brodie"]}, {"page": "Understatement", "response": ["In April 1951, 650 British fighting men - soldiers and officers from the 1st Battalion, the Gloucestershire Regiment - were deployed on the most important crossing on the Imjin River to block the traditional invasion route to Seoul. The Chinese had sent an entire division - 10,000 men - to smash the isolated Glosters aside in a major offensive to take the whole Korean peninsula, and the small force was gradually surrounded and overwhelmed. After two days' fighting, an American, Major General Robert H Soule, asked the British brigadier, Thomas Brodie: \"How are the Glosters doing?\" The brigadier, schooled in Britain and thus British humour, replied: \"A bit sticky, things are pretty sticky down there.\" To American ears, this did not sound desperate, and so he ordered them to stand fast. Only 40 Glosters managed to escape."]}, {"page": "Cheshire Regiment", "response": ["*1955–1962: Maj-Gen. Thomas Brodie, CB, CBE, DS0"]}, {"page": "Gloucestershire Regiment", "response": ["The Glosters' stand had plugged a large gap in the 29th Brigade's front on Line Kansas which would otherwise have left the flanks of the ROK 1st and US 3rd Divisions vulnerable. Their presence also threatened the rear of the Chinese forces as they advanced and denied them the use of routes south for their artillery and mule trains. General James Van Fleet, commander of the US Eighth Army, described the stand as \"the most outstanding example of unit bravery in modern war\",Salmon p. 314 and in a letter to General Ridgeway, commander-in-chief of UN forces in Korea, he wrote that \"the loss of 622 officers and men saved many times that number\". The 29th Brigade commander, Brigadier Thomas Brodie, christened the regiment The Glorious Glosters, a sobriquet that was repeated in the headlines of the day, and Hill 235 became known as Gloster Hill, at the foot of which the Gloucester Valley Battle Monument was built in 1957.Salmon p. 307Daniell p. 375"]}, {"page": "Order of battle of the Chindits", "response": [":O.C. Brigadier Thomas Brodie: 59 HQ column"]}, {"page": "14th Infantry Brigade (United Kingdom)", "response": ["* Brig. Thomas Brodie (6 November 1943 – 31 October 1944)"]}, {"page": "14th Airlanding Brigade (United Kingdom)", "response": ["The 14th Airlanding Brigade was a formation of the British Indian Army and then the Pakistan Army. It was formed from the 14th British Infantry Brigade on 1 November 1944, and was initially part of the 44th Airborne Division. Initially the brigade included 4/6th Rajputana Rifles, 2nd Black Watch, 2nd King's Own Royal Regiment, and 6/16th Punjab Regiment. During the Second World War it was commanded by Brigadier Thomas Brodie and later Brigadier F.W. Gibb."]}, {"page": "Charles Harington (British Army officer, born 1910)", "response": ["Charles Harington was educated at Malvern College and later the Royal Military College, Sandhurst, and was commissioned as a second lieutenant into the Cheshire Regiment on 30 January 1930, being immediately posted to the regiment's 2nd Battalion.Liddell Hart Centre for Military Archives Promoted on 30 January 1933, he excelled at athletics, holding the British Army record for the 440 yard hurdles and competing for the Army against the other services. He was captain of the 2nd Battalion's athletics team, winning the Army Inter-Unit Team Athletic Championship in 1937, 1938 and 1939. He succeeded Thomas Brodie as the adjutant of the 2nd Battalion, then commanded by Lieutenant Colonel Eric Nares, from 1936 to 1939, and on 1 August 1938 he was promoted to captain. During this time the battalion was deployed to Palestine during the Arab revolt, where it remained trying to keep the peace between the Jews and the Arabs, until 1938 when it returned to Aldershot, Hampshire."]}, {"page": "Third Battle of Seoul", "response": ["| style=\"text-align: left;\" |Brigadier Thomas Brodie's order to the 29th Independent Infantry Brigade during the defense of Seoul", "On the left flank of the US 24th Infantry Division, the British 29th Infantry Brigade of US I Corps was involved in the hardest fighting of the entire battle. In the 29th Infantry Brigade's first action of the Korean War, the brigade was ordered to defend the areas east of Koyang on the Bridgehead Line. The 1st Battalion, Royal Ulster Rifles (1RUR) covered the brigade's left flank, while the 1st Battalion, Royal Northumberland Fusiliers (1RNF) was stationed on the brigade's right flank. The 1st Battalion, Gloucestershire Regiment and the 1st Battalion, 21st Royal Thai Regiment covered the brigade's rear with artillery support. At 04:00 on January 3, 1RUR first made contact with the 149th Division of the PVA 50th Corps. The PVA surprised and overran the Companies B and D of 1RUR, but a counterattack by Major C. A. H. B. Blake of 1RUR restored the battalion's position by the morning. While 1RUR was under attack, the PVA forces also infiltrated 1RNF's positions by exploiting the unguarded valleys between hilltops occupied by the British. The entire 1RNF soon came under sniper fire and the PVA made repeated attempts to capture Y Company of 1RNF. To restore 1RNF's position, Brigadier Thomas Brodie of the 29th Infantry Brigade sent W Company of 1RNF with four Churchill tanks as reinforcement. The reinforcement was met with machine gun and mortar fire, but the PVA resistance immediately crumbled under the Churchill tanks' devastating assaults. The surviving PVA troops fled under the bombardment from 4.2-inch mortars and 25 pounder field guns. In the aftermath of fighting, the 29th Infantry Brigade suffered at least 16 dead, 45 wounded and 3 missing, while 200 PVA dead were found within 1RNF's position."]}, {"page": "Thomas Brodie (disambiguation)", "response": ["Thomas Brodie (1903–1993) was a British Army soldier.", "Thomas Brodie or Tom Brodie may also refer to:", "*Thomas Brodie (Royal Navy officer) (1779–1811)", "*Thomas Brodie-Sangster (born 1990), English actor and musician"]}, {"page": "1954 New Year Honours", "response": ["*Major-General Thomas Brodie, CBE DSO (34236), late Infantry."]}, {"page": "English understatement", "response": ["Better documented is the cross-cultural miscommunication between British and American military personnel in the midst of the Korean War. In April 1951, 650 British fighting mensoldiers and officers from the 1st Battalion, the Gloucestershire Regimentwere deployed on the most important crossing on the Imjin River to block the traditional invasion route to Seoul. The Chinese had sent an entire division10,000 menagainst the isolated Glosters in a major offensive to take the whole Korean peninsula, and the small force was gradually surrounded and overwhelmed. After two days' fighting, an American, Major General Robert H. Soule, asked the British brigadier, Thomas Brodie: \"How are the Glosters doing?\" The brigadier, with English understatement, replied: \"A bit sticky, things are pretty sticky down there.\" To American ears, this did not sound desperate, and so he ordered them to stand fast. The surviving Glosters were rescued by a column of tanks; they escaped under fire, sitting on the decks of the tanks."]}, {"page": "Brodie, Thomas", "response": ["#redirectThomas Brodie"]}]}}