{"wiki_id": "http://www.wikidata.org/entity/Q7782287", "itemLabel": "Theophilus Carter", "itemDescription": "British inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Theophilus_Carter", "wikipedia_page": {"main": "Theophilus Carter (1824 – 21 December 1904) was an eccentric British furniture dealer who may have been an inspiration for the illustration by Sir John Tenniel of Lewis Carroll's characters the Mad Hatter in his 1865 novel Alice's Adventures in Wonderland and Hatta in the 1871 sequel Through the Looking-Glass.", "link_mentions": [{"page": "Wallace and Gromit", "response": ["Wallace is an inveterate inventor, creating elaborate contraptions that often do not work as intended. Their appearance is similar to the illustrations of W. Heath Robinson and Rube Goldberg, and Nick Park has said of Wallace that all his inventions are designed around the principle of using a \"sledgehammer to crack a nut\". Some of Wallace's contraptions are based on real-life inventions. For example, his method of waking up in the morning utilises a bed that tips over to wake up its owner, an invention that was exhibited at the Great Exhibition of 1851 by Theophilus Carter."]}, {"page": "Alice's Adventures in Wonderland", "response": ["Gardner has suggested that the Hatter is a reference to Theophilus Carter, an Oxford furniture dealer, and that Tenniel apparently drew the Hatter to resemble Carter, on a suggestion of Carroll's. The Dormouse tells a story about three little sisters named Elsie, Lacie, and Tillie. These are the Liddell sisters: Elsie is L.C. (Lorina Charlotte); Tillie is Edith (her family nickname is Matilda); and Lacie is an anagram of Alice."]}, {"page": "Hatter (Alice's Adventures in Wonderland)", "response": ["===Resemblance to Theophilus Carter===", "It has often been claimed that the Hatter's character may have been inspired by Theophilus Carter, an eccentric furniture dealer.Millikan, Lauren (5 March 2011). \"The Mad Hatter\". Carleton University. Retrieved 14 June 2015. Carter was supposedly at one time a servitor at Christ Church, one of the University of Oxford's colleges. This is not substantiated by university records. He later owned a furniture shop, and became known as the \"Mad Hatter\" from his habit of standing in the door of his shop wearing a top hat. Sir John Tenniel is reported to have come to Oxford especially to sketch him for his illustrations. There is no evidence for this claim, however, in either Carroll's letters or diaries.Maters, Kristin (27 January 2014). \"Who Really Inspired Lewis Carroll's 'Alice' Characters?\". Books Tell You Why. Retrieved 14 June 2015."]}, {"page": "Mercury poisoning", "response": ["* The phrase mad as a hatter is likely a reference to mercury poisoning among milliners (so-called \"mad hatter disease\"), as mercury-based compounds were once used in the manufacture of felt hats in the 18th and 19th century. (The Mad Hatter character of Alice in Wonderland was, it is presumed, inspired by an eccentric furniture dealer named Theophilus Carter. Carter was  not a victim of mad hatter disease although Lewis Carroll would have been familiar with the phenomenon of dementia that occurred among hatters.)"]}, {"page": "Theophilus", "response": ["* Theophilus Carter (1824–1904), British inventor and furniture dealer"]}, {"page": "Erethism", "response": ["Historically, this was common among old England felt-hatmakers who had long-term exposure to vapors from the mercury they used to stabilize the wool in a process called felting, where hair was cut from a pelt of an animal such as a rabbit. The industrial workers were exposed to the mercury vapors, giving rise to the expression \"mad as a hatter\". Some believe that the character the Mad Hatter in Lewis Carroll's Alice in Wonderland is an example of someone suffering from erethism, but the origin of this account is unclear. The character was almost certainly based on Theophilus Carter, an eccentric furniture dealer who was well known to Carroll.", "Lewis Carroll's iconic Mad Hatter character in Alice's Adventures in Wonderland displays markedly eccentric behavior, which includes taking a bite out of a teacup. Carroll would have been familiar with the phenomenon of dementia among hatters, but the literary character is thought to be directly inspired by Theophilus Carter, an eccentric furniture dealer who did not show signs of mercury poisoning."]}]}}