{"wiki_id": "http://www.wikidata.org/entity/Q7789808", "itemLabel": "Thomas Frederick Colby", "itemDescription": "Director of Ordnance Survey", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Frederick_Colby", "wikipedia_page": {"main": "Thomas Frederick Colby FRS FRSE FGS FRGS (1 September 1784 – 9 October 1852), was a British major-general and director of the Ordnance Survey (OS). \nA Fellow of the Royal Astronomical Society and Royal Society, Colby was one of the leading geographers of his time.\n\nAn officer in the Royal Engineers, Colby overcame the loss of one hand in a shooting accident to begin in 1802 a lifelong connection with the Ordnance Survey. His most important work was the Survey of Ireland. He began planning this enormous enterprise in 1824 and directed it until 1846, in which year the final maps made by the survey were almost ready for issue. He was the inventor of the \"Colby Bar\" (a compensation bar), an apparatus used in base-measurements.", "link_mentions": [{"page": "Charles Babbage", "response": ["Babbage studied the requirements to establish a modern postal system, with his friend Thomas Frederick Colby, concluding there should be a uniform rate that was put into effect with the introduction of the Uniform Fourpenny Post supplanted by the Uniform Penny Post in 1839 and 1840. Colby was another of the founding group of the Society. He was also in charge of the Survey of Ireland. Herschel and Babbage were present at a celebrated operation of that survey, the remeasuring of the Lough Foyle baseline."]}, {"page": "List of cartographers", "response": ["*Thomas Frederick Colby (England, 1784–1852)"]}, {"page": "George Everest", "response": ["Everest returned to India in 1821. He succeeded as superintendent of the GTS upon Lambton's death in 1823, and over the following years extended his predecessor's efforts on the arc up to Sironj, in present-day Madhya Pradesh. Everest suffered from poor health, however, and the effects of fever and rheumatism left him half paralysed. He left for England in 1825, where he spent the following five years recuperating. Everest was elected as a Fellow of the Royal Society in March 1827. Most of his free time was spent lobbying the East India Company for better equipment and studying the methods used by the Ordnance Survey; he frequently corresponded with Thomas Frederick Colby."]}, {"page": "Cilgerran", "response": ["* Geographer Thomas Frederick Colby was brought up at Rhosygilwen mansion between Cilgerran and Rhoshill."]}, {"page": "Translations (play)", "response": ["Five years prior to writing Translations, Friel mentioned a number of topics going through his mind: a play set sometime between the Act of Union and the Great Famine in the 19th century; a play about Daniel O'Connell and the Catholic Emancipation; a play about colonialism; and a play about the death of the Irish language, the acquisition of English and its profound effects. During this time, Friel had made a couple of accidental discoveries: that his great-great-grandfather was a hedge-schoolmaster, leading Friel to read about hedge-schools in Ireland; and that the first trigonometrical base set up by the Ordnance Survey in 1828 was next to his residence in Muff, leading him to read about the man in charge of the survey, Colonel Thomas Frederick Colby, who would later serve as inspiration for one of Translation's characters, Captain Lancey. Friel then discovered A Paper Landscape in 1976, which synthesized everything he had been thinking about into the perfect metaphor, map-making, serving as the foundation for his work.", "* The Englishmen in the play are a detachment of the Royal Engineers and function as part of the Ordnance Survey creating six inch maps of Ireland. The characters of Captain Lancey and Lieutenant Yolland are fictionalised representations of two real soldiers who took part in the survey: Thomas Frederick Colby and William Yolland, but Thomas Larcom has also been identified as a possible model for the lieutenant, with Owen based on his teacher, the Irish linguist John O'Donovan."]}, {"page": "Principal Triangulation of Great Britain", "response": ["The Principal Triangulation of Britain was the first high-precision triangulation survey of the whole of Great Britain (including Ireland), carried out between 1791 and 1853 under the auspices of the Board of Ordnance. The aim of the survey was to establish precise geographical coordinates of almost 300 significant landmarks which could be used as the fixed points of local topographic surveys from which maps could be drawn. In addition there was a purely scientific aim in providing precise data for geodetic calculations such as the determination of the length of meridian arcs and the figure of the Earth. Such a  survey had  been proposed by William Roy (1726–1790) on his completion of the Anglo-French Survey but it was only after his death that the  Board of Ordnance initiated the trigonometric survey, motivated by military considerations in a time of a threatened French invasion. Most of the work was carried out under the direction of Isaac Dalby,  William Mudge and Thomas Frederick Colby, but the final synthesis and report (1858) was the work of Alexander Ross Clarke. The survey stood the test of time for a century, until the Retriangulation of Great Britain between 1935 and 1962."]}, {"page": "Thomas F. Colby", "response": ["#redirect Thomas Frederick Colby"]}, {"page": "Thomas Colby", "response": ["*Thomas Frederick Colby (1784–1852), British major-general and director of the Ordnance Survey"]}, {"page": "Colby, Thomas", "response": ["#REDIRECT Thomas Frederick Colby"]}, {"page": "Alexander Ross Clarke", "response": ["and . was initiated by the Board of Ordnance in 1791 and carried out under the direction of William Mudge and Thomas Frederick Colby. The field work was completed in 1853, just as Clarke joined the Board. The methods of analysis had been planned in outline by William Yolland, his predecessor at the head of the Trigonometric Section, but it fell to Clarke to finalize the methods and carry them through to completion. This he achieved in the four years from 1854 to 1858: the report was published as  but it is entirely Clarke's work. The basic data was the collection of angle bearings taken from each of the 289 stations towards a number of other stations, typically from three to ten in number. The multiple observations were first subjected to a least squares error analysis to extract the most likely angles and then the triangles formed by the corrected bearings were adjusted simultaneously, again by least squares methods, to find the most likely geometry for the whole mesh. This was an immense undertaking which involved the solution of 920 equations without the aid of matrix methods or digital computers.The calculations were simplified by splitting the mesh into 21 small sub-meshes. The only available computers were the living personnel of the Trigonometric Section, twenty one of them. Once the triangles had been fixed it was then possible to calculate all the sides of the mesh in terms of the length of either of the bases, one by Lough Foyle in Ireland and the other on Salisbury plain. The accuracy of the survey was such that when the length of the Lough Foyle base was calculated through the triangulation mesh from the Salisbury base the error was only 5 inches when compared with its measured length (of 41,640.887 feet or about 8 miles). The final step was to use the distances and angles to work out the latitude and longitude of each triangulation point on the Airy ellipsoid."]}, {"page": "List of people from Kent", "response": ["*Thomas Frederick Colby (1784–1852) – director of the Ordnance Survey"]}, {"page": "List of fellows of the Royal Society A, B, C", "response": ["| Thomas Frederick Colby||13/04/1820||1 September 1784 – 9 October 1852"]}, {"page": "George Harvey (FRS)", "response": ["Harvey became a Fellow of the Royal Society of Edinburgh in 1824MacTutor, Fellows of the Royal Society of Edinburgh. his proposer being Thomas Frederick Colby. Next year he became Fellow of the Royal Society of London. He was also a Fellow of the Royal Astronomical Society, Geological Society and Linnaean Society."]}, {"page": "Directors of the Ordnance Survey", "response": ["| Major General Thomas Frederick Colby"]}, {"page": "Rhoshill, Pembrokeshire", "response": ["Rhosygilwen was owned by the Jones family until 1697, when it passed to the Colby family who owned it until the 20th century; Thomas Frederick Colby was raised there. His father Thomas Colby was High Sheriff of Pembrokeshire in 1771. The house was rebuilt in the 1830s. The main house, coach house and main gateway are Grade II listed buildings."]}, {"page": "List of fellows of the Royal Society elected in 1820", "response": ["# Thomas Frederick Colby (1784–1852)"]}, {"page": "George Augustus Bennett", "response": ["In 1832 Bennett was assigned to the Ordnance survey of Ireland under command of Lieutenant-Colonel Thomas Frederick Colby, RE, and Lieutenant Thomas Aiskew Larcom, RE, and advanced to rank of lieutenant on 10 December. By the end of 1834 he'd worked through producing survey memoirs for many county Antrim, Down and Armagh parishes—Glenavy, Aghaderg, Annaclone, Clonallan, Donacloney, Donaghmore, Dromara, Dromore, Drumballyroney, Drumgath, Garvaghy, Magherally, Magheralin, Newry, Seapatrick, Shankill, Tullylish, Warrenpoint, Ballymore, Drumcree, Kilmore, Montiaghs, Seagoe— and with Lieutenant Henry Tucker, RE, took charge of the operations in County Louth from about 1834. Then, as Captain Robert Kearsley Dawson, RE, moved on to England in connection with the Reform Commission in 1835, Bennett took over his hill drawing role, superintending the hill-sketchers."]}]}}