{"wiki_id": "http://www.wikidata.org/entity/Q7787338", "itemLabel": "Thomas Baldwin", "itemDescription": "English surveyor and architect in Bath", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Baldwin_(architect)", "wikipedia_page": {"main": "Thomas Baldwin (c.1750 – 7 March 1820) was an English architect in the city of Bath, who was responsible for designing some of Bath's principal Georgian buildings.\nIn 1775, he was appointed as the official Bath City Architect. In this role he designed Guildhall, Argyle Street, Laura Place, Great Pulteney Street and many others. In 1793, he was dismissed for financial irregularities, and as a result he was forced into bankruptcy and his reputation was ruined. Jane Root, biographer of Baldwin, writes; \"he had a history not merely of imprudence, but of deliberate dishonesty\".", "link_mentions": [{"page": "Bath, Somerset", "response": ["The heart of the Georgian city was the Pump Room, which, together with its associated Lower Assembly Rooms, was designed by Thomas Baldwin, a local builder responsible for many other buildings in the city, including the terraces in Argyle Street and the Guildhall. Baldwin rose rapidly, becoming a leader in Bath's architectural history."]}, {"page": "Roman Baths (Bath)", "response": ["The visitor entrance is via an 1897 concert hall by J. M. Brydon. It is an eastward continuation of the Grand Pump Room, with a glass-domed centre and single-storey radiused corner. The Grand Pump Room was begun in 1789 by Thomas Baldwin. He resigned in 1791 and John Palmer continued the scheme through to completion in 1799. The elevation on to Abbey Church Yard has a centre piece of four engaged Corinthian columns with entablatures and pediment. It has been designated by Historic England as a grade I listed building. The north colonnade was also designed by Thomas Baldwin. The south colonnade is similar but had an upper floor added in the late 19th century. The museum and Queen's Bath including the \"Bridge\" spanning York Street to the City Laundry were by Charles Edward Davis in 1889. It comprises a southward extension to the Grand Pump Room, within which some parts of the 17th-century Queen's Bath remain."]}, {"page": "1820 in architecture", "response": ["* March 7 – Thomas Baldwin, English surveyor and architect in Bath  (born c.1750)"]}, {"page": "1799 in architecture", "response": ["* Grand Pump Room, Bath, England, designed by Thomas Baldwin and John Palmer, is completed"]}, {"page": "1789 in architecture", "response": ["* The main block of the Grand Pump Room, Bath, England, is begun by Thomas Baldwin.", "* Cross Bath, in Bath, England, is rebuilt by Thomas Baldwin at about this date."]}, {"page": "Froxfield", "response": ["In 1813 or 1814 Charles Brudenell-Bruce, 1st Marquess of Ailesbury paid for the original chapel to be demolished and replaced by a new, presumably larger one built in its place, designed by the architect Thomas Baldwin of Bath. A new gateway to the hospital was added at the same time. The gateway and chapel are of ashlar masonry in a Georgian Gothick style."]}, {"page": "John Wood, the Elder", "response": ["Wood Street was built in 1778 an has been designated as a Grade I listed building. The street was designed by John Wood, the Elder and built by Thomas Baldwin in the same style as the adjacent Queen Square."]}, {"page": "John Wood, the Younger", "response": ["John Wood the Younger is a key figure, not only in the history of Bath, but also in the history of British 18th-century architecture.  When John Wood the Elder died, Queen Square and the Circus were isolated showpieces in Bath.  His son connected these buildings and went on to create and inspire a new city quarter filled with elegant Palladian and neo-classical structures. Wood's clean, neo-classical style inspired other Georgian and Regency era architects in Bath such as John Pinch the elder, John Pinch the younger and Thomas Baldwin.  The Royal Crescent is his greatest achievement and was one of the first designs of its type.  It was imitated in Bath and also in later English towns such as Buxton, Brighton, Bristol and London."]}, {"page": "Sir William Pulteney, 5th Baronet", "response": ["At that time Bath was expanding, but the Pulteneys' rural Bathwick estate was separated from the city by the River Avon, and with no bridge in place the only means of crossing the river was via a small ferry. They decided a bridge needed to be built, and Pulteney turned to his friend and fellow countryman, architect Robert Adam. Adam was influenced by his travels to Florence and Venice and proposed a bridge incorporating shops along both sides. This was completed in 1773, but the Pulteneys' original plans for Bath's expansion did not take effect until 1788 when Bath architect Thomas Baldwin started to create a new estate. As well as the bridge bearing their name, the Pulteneys' involvement is recalled by Great Pulteney Street in Bathwick, reputed to be the longest boulevard of its kind in Europe, while Henrietta Street was named after their daughter."]}, {"page": "Bath Assembly Rooms", "response": ["The heart of the Georgian city was Wood's Pump Room, which, together with its associated Lower Assembly Rooms, was designed by Thomas Baldwin, a local builder responsible for many other buildings in the city, including the terraces in Argyle Street and the Guildhall, The Lower Assembly Rooms consisted of two buildings. The first built in 1708 for Thomas Harrison overlooking Parade Gardens between North Parade and Bath Abbey. A large ballroom was added in 1720, with further enlargement in 1749 and 1810 when it became known as The Kingston Assembly Rooms. In 1728 another building, known as Lindsey's Assembly Rooms, was constructed, lasting until demolition around 1820 for the building of York Street. Harrison's Lower Assembly Rooms were devastated by a fire in December 1820 Taunton Courier 27 December 1820 and rebuilt, lasting until demolition in 1933 for road improvements on the site now known as \"Bog Island\"."]}, {"page": "Timsbury, Somerset", "response": ["Parish's House on the south eastern side of the village was an 1816 extension of a much earlier house. It is attributed to Thomas Baldwin of Bath for Captain Parish R.N., is fronted by an ornate balustrade, and includes a stable block from the same date."]}, {"page": "Thomas Baldwin", "response": ["Thomas Baldwin may refer to:", "* Thomas Baldwin (comptroller) (1568–1641), British architect and Comptroller of the King's Works", "* Thomas Baldwin (architect) ( 1750–1820), British architect, City Architect and Surveyor in Bath, Somerset", "* Thomas Baldwin (philosopher) (born 1947), British philosopher"]}, {"page": "John Pinch the Elder", "response": ["John Pinch was born at Callington, Cornwall where he was christened on 4 January 1769. He started as an architect and builder in the 1790s.  He was assistant to Thomas Baldwin as surveyor to the Pulteney estate and succeeded him as surveyor after Baldwin's bankruptcy in 1793; when the estate passed into the ownership of the Earl of Darlington he retained his position. John Pinch married Martha Cleave (1772 – 1830) on Christmas Eve, 1792 at St Mellion, Cornwall. Pinch died on 11 March 1827 in Bath and is buried at St Mary's Churchyard, Bathwick.", "Pinch's earliest identified work is Babington House in Babington, Somerset which was built in 1790. A few years later he completed Northampton Street in Bath which had been started by Thomas Baldwin, and was completed by George Phillips Manners."]}, {"page": "John Palmer (Bath architect)", "response": ["John Palmer (c. 1738 – 19 July 1817) was an English architect who worked on some of the notable buildings in the city of Bath, Somerset, UK.  He succeeded Thomas Baldwin as City Architect in 1792. He died in Bath.", "* Cross Bath remodelled by Palmer after work by Thomas Baldwin (1789)", "* Grand Pump Room, Bath, begun in 1789 by Thomas Baldwin who resigned in 1791; Palmer continued the scheme", "* Jane Root, \"Thomas Baldwin: His Public Career in Bath, 1775–1793\" (in, ed. Trevor Fawcett, Bath History, Volume V Bath: Millstream Books Publishing Limited, 1994), pages 80–103."]}, {"page": "Great Pulteney Street", "response": ["Commissioned by Sir William Pulteney, it was designed by the architect Thomas Baldwin and completed in 1789. The Corporation of Bath wanted to expand the boundaries of the City, and Sir William's estate was conveniently situated just over the other side of the River Avon.", "The planning and frontage of the entire street was done by the architect Thomas Baldwin but construction of individual buildings was done by a number of local contractors. This system of town planning was also used at the nearby Royal Crescent.https://www.flickr.com/photos/pkitt/14179575381 In all major dimensions there is considerable conformity, the width and height of buildings and the size and spacing of windows all adhere to a grid pattern.", "However, the scheme by Thomas Baldwin to create a whole new town south of the river was hit by financial panic as a result of the French Revolution and the collapse of many banks – including the one funding Baldwin’s grand plans.https://bathnewseum.com/2013/11/17/pavement-history/"]}, {"page": "Charles Harcourt Masters", "response": ["* Sydney Hotel, Bathwick, Bath (now Holburne Museum of Art) (1796–1797): modifying a design of Thomas Baldwin"]}, {"page": "Thomas Warr Attwood", "response": ["He was killed by the collapse of a derelict building which he was inspecting on the site of the proposed new Guildhall.  His assistant Thomas Baldwin was appointed City Architect and City Surveyor."]}, {"page": "List of people from Bath", "response": ["*Thomas Baldwin (c. 1750–1820) – architect of Great Pulteney Street and Bath Guildhall."]}, {"page": "List of Bath City Architects", "response": ["* Thomas Warr Attwood (unofficially) 1733–1775 \"Tomb of Thomas Warr Attwood (d.1775). By Thomas Baldwin. ... Attwood was a prosperous plumber and glazier, who served as architect to the Corporation: he was accidentally killed while surveying the old market. The tomb is designed by his clerk, Thomas Baldwin, who became one of the key architects of late C18 Bath. No 301 on the churchyard plan.\"", "* Thomas Baldwin 1780–1792"]}, {"page": "Bath City Surveyor", "response": ["* Thomas Baldwin 1776–1792"]}, {"page": "1793 in architecture", "response": ["** English architect Thomas Baldwin, having been appointed as the Bath City Architect in 1775, is dismissed as a result of his rivalry with John Palmer of Bath."]}, {"page": "1750 in architecture", "response": ["* probable – Thomas Baldwin, English surveyor and architect in Bath (died 1820)"]}, {"page": "Holburne Museum", "response": ["Since 1916 the Museum has been housed in the former Sydney Hotel at the end of Great Pulteney Street.  The original design for the Hotel, prepared by Thomas Baldwin in 1794, was a two-storey building which would serve the pleasure gardens, known as Sydney Gardens, laid out by Baldwin beyond.  The gardens remain the only remaining eighteenth-century pleasure gardens (or Vauxhall) in the country."]}, {"page": "List of British architects", "response": ["*Thomas Baldwin (c. 1750–1820)"]}, {"page": "Hafod Uchtryd", "response": ["A new mansion at Hafod was built in 1785 by Johnes, after the demolition of the Herbert structure, from the designs of Thomas Baldwin of Bath in the Gothic style. The library was a spacious, octagonal building within the mansion. Johnes collected many rare and noble books on natural history and manuscripts in Welsh, French and Latin, which also included many by Edward Lhuyd and many manuscripts and printed editions of the French chronicles of the later Middle Ages.  The library collection of the Marquis de Pesaro was purchased and housed at the estate. A sculpture by Thomas Banks, representing Thetis dipping Achilles in the river Styx stood in the library; The sculpture was commissioned by his cousin-wife Jane Johnes; the head of Achilles is that of their baby daughter, Mariamne (who lived 1781-1811).  This work is currently on display at the Victoria and Albert Museum.Thetis dipping Achilles into the River Styx 1790"]}, {"page": "Grade I listed buildings in Somerset", "response": ["Much of the development, and many of the buildings, were the vision of John Wood, the Elder. The Circus is seen as the pinnacle of Wood's work. It consists of three long, curved terraces that form a circular space or theatre intended for civic functions and games. The games give a clue to the design, the inspiration for which was the Colosseum in Rome. The best known of Bath's terraces is the Royal Crescent, built between 1767 and 1774 and designed by Wood's son, John Wood, the Younger.  Around 1770 the neoclassical architect Robert Adam designed Pulteney Bridge, a three-arched bridge spanning the Avon. He used as his prototype an original, but unused, design by Palladio for the Rialto Bridge in Venice. The heart of the Georgian city was the Pump Room, which together with its associated Lower Assembly Rooms was designed by Thomas Baldwin, a local builder responsible for many other buildings in the city, including the terraces in Argyle Street. Great Pulteney Street, where Baldwin eventually lived, is another of his works: this wide boulevard, constructed  and over  long and  wide, is lined on both sides by Georgian terraces."]}, {"page": "Thomas Johnes", "response": ["A new mansion at Hafod was built in 1785 by Johnes, after the demolition of the Herbert structure, from the designs of Thomas Baldwin of Bath in the Gothic style. Johnes collected many rare and noble books on natural history and manuscripts in Welsh, French and Latin, which also included many by Edward Lhuyd and many manuscripts and printed editions of the French chronicles of the later Middle Ages."]}, {"page": "Widcombe, Bath", "response": ["Widcombe Crescent is a terrace of 14 Georgian houses built in 1808 by Thomas Baldwin, and designated a Grade I listed building."]}, {"page": "Grade I listed buildings in Bath and North East Somerset", "response": ["Most of Bath's Grade I listed buildings are made from the local golden-coloured Bath Stone, and date from the 18th and 19th centuries. Their dominant architectural style is Georgian, which evolved from the Palladian revival style that became popular during the early 18th century. This led to the entire city's designation as a World Heritage Site. Much of the development, and many of the buildings, were the vision of John Wood, the Elder. The Circus is seen as the pinnacle of Wood's work: it consists of three long, curved terraces that form a circular space or theatre intended for civic functions and games. The games give a clue to the design, the inspiration for which was the Colosseum in Rome. The best known of Bath's terraces is the Royal Crescent, built between 1767 and 1774 and designed by Wood's son, John Wood, the Younger. Around 1770 the neoclassical architect Robert Adam designed Pulteney Bridge, a three-arched bridge spanning the Avon. He used as his prototype an original, but unused, design by Palladio for the Rialto Bridge in Venice. The heart of the Georgian city was the Pump Room, which together with its associated Lower Assembly Rooms was designed by Thomas Baldwin, a local builder responsible for many other buildings in the city, including the terraces in Argyle Street. Great Pulteney Street, where Baldwin eventually lived, is another of his works: this wide boulevard, constructed  and over  long and  wide, is lined on both sides by Georgian terraces."]}, {"page": "Grand Pump Room", "response": ["The present building replaced an earlier one on the same site, designed by John Harvey at the request of Beau Nash, Bath's master of ceremonies, in 1706, before the discovery of Roman remains nearby. The main block, built of Bath stone, was begun by Thomas Baldwin, and the foundations of a Roman temple precinct were discovered during preparatory excavations. The North Colonnade of nine bays, with unfluted Ionic columns, was built by Baldwin in 1786–1790."]}, {"page": "Guildhall, Bath", "response": ["The current Bath stone building, designed by Thomas Baldwin, was built between 1775 and 1778 and extended by John McKean Brydon in 1893. The central facade has four Ionic columns and the building is surmounted by the figure of Justice. The central dome and the north and south wings were added in 1893 and form a contiguous building with the Victoria Art Gallery, which was also built around the same time."]}, {"page": "Cross Bath", "response": ["The Cross Bath in Bath Street, Bath, Somerset, England is a historic pool for bathing. It was rebuilt, in the style of Robert Adam by Thomas Baldwin around 1789. It is recorded in the National Heritage List for England as a designated Grade I listed building, and was restored during the 1990s by Donald Insall Associates."]}, {"page": "Bath Street, Bath", "response": ["Bath Street in Bath, Somerset, England was built by Thomas Baldwin in 1791. Several of the buildings have been designated as Grade I listed buildings."]}, {"page": "Sydney Place, Bath", "response": ["Numbers 1 to 12 were planned by Thomas Baldwin around 1795. The 3 storey buildings have mansard roofs. Jane Austen lived in Number 4 from 1801 to 1805."]}, {"page": "Laura Place, Bath", "response": ["Laura Place Bathwick, Bath, Somerset, England, consists of four blocks of houses around an irregular quadrangle at the end of Pulteney Bridge.  It was built by Thomas Baldwin and John Eveleigh between 1788 and 1794."]}, {"page": "Bathwick Hill", "response": ["Number 10 is a 2-storey Neo-Grecian villa built in the early 19th century by Thomas Baldwin. The central projection has a curved portico with 4 fluted Ionic columns and Ionic pilasters which go through 2 floors. It is a Grade II* listed building."]}, {"page": "Cheap Street, Bath", "response": ["Number 15 to 19 were built as a block, including shop fronts divided by Doric columns, by Thomas Baldwin around 1789."]}, {"page": "Henrietta Street, Bath", "response": ["Henrietta Street in the Bathwick area of Bath, Somerset, England was built around 1785 by Thomas Baldwin."]}, {"page": "Johnstone Street, Bath", "response": ["Johnstone Street in the Bathwick area of Bath, Somerset, England was designed in 1788 by Thomas Baldwin, with some of the buildings being completed around 1805-1810 by John Pinch the elder."]}, {"page": "Widcombe Crescent, Bath", "response": ["Widcombe Crescent in Bath, Somerset, England is a terrace of 14 Georgian houses built in 1808 by Thomas Baldwin, and designated a Grade I listed building."]}, {"page": "Wood Street, Bath", "response": ["The street was designed by John Wood, the Elder and built by Thomas Baldwin in the same style as the adjacent Queen Square."]}, {"page": "List of city and town halls in England", "response": ["|Grade I listed ().Architect: Thomas Baldwin.", "|Grade II* listed ().Architect: Thomas Baldwin."]}, {"page": "Buildings and architecture of Bath", "response": ["The heart of the Georgian city were Wood's Assembly Rooms, and the Pump Room, which, together with its associated Lower Assembly Rooms, was designed by Thomas Baldwin, a local builder responsible for many other buildings in the city, including the terraces in Argyle Street, the Guildhall, The Cross Bath, Widcombe Crescent and Royal Baths Treatment Centre in Bath Street."]}]}}