{"wiki_id": "http://www.wikidata.org/entity/Q7788376", "itemLabel": "Thomas Cheesman", "itemDescription": "English cricketer (1816-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Cheesman", "wikipedia_page": {"main": "Thomas Cheesman (1816 – 15 August 1874) was an English amateur cricketer who played in one first-class cricket match for Kent County Cricket Club in 1854.\nCheesman was born in Luddesdown in Kent in 1816, one of seven children of William and Henrietta Cheesman. He worked as a solicitor in Gravesend and played most of his cricket in the town, including for Gravesend Cricket Club between 1840 and around 1863.  His only first-class appearance was at the town's Bat and Ball Ground in 1854 against a United England Eleven, one of fifteen players on the Kent team. Cheesman opened the batting for Kent and scored 14 runs in his first innings but was out for a duck in Kent's second innings. He is also known to have played in non-first-class matches for Gentlemen of Kent sides.Cheesman is not believed to have married. He died at Margate in 1874.", "link_mentions": [{"page": "Cheesman", "response": ["*Thomas Cheesman (1816–1874), English cricketer"]}, {"page": "Thomas Cheeseman (disambiguation)", "response": ["*Thomas Cheesman (1816–1874), English cricketer ", "*Thomas Cheesman (clergyman), see Aston Tirrold", "*Thomas Cheesman (engraver) (1760–1834), British engraver"]}, {"page": "Henry James Richter", "response": ["Throughout the 1790s Richter worked mainly as an illustrator, demonstrating skills as both draftsman and engraver; projects included editions of Samuel Richardson's Sir Charles Grandison and Clarissa Harlowe (with others, both 1793), Samuel Johnson's Lives of the English Poets (with others, 1797), and J.-H. Bernardin de Saint-Pierre's Paul and Virginia (1799). For a period of time, Richter lived at #26 Newman St. in London. This Street was also known as \"Artists Street\" because in the two block section were approximately 40 painters, sculptors, engravers and other in the arts including such notable individuals as Robert Cromek at #64, Benjamin West at #14, Thomas Stothard at #28, James Ward at #6, Henry Thomson at #15, Ozias Humphry at #25, George Arnald at #36, James Heath at #42, Thomas Cheesman at #71 and John Phillip \"Pope\" Davis at #76."]}, {"page": "Cheesman, Thomas", "response": ["#redirectThomas Cheesman"]}]}}