{"wiki_id": "http://www.wikidata.org/entity/Q7781765", "itemLabel": "Theodore Dyke Acland", "itemDescription": "English military physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Dyke_Acland", "wikipedia_page": {"main": "Theodore Dyke Acland FRCP FRCS (14 November 1851 – 16 April 1931) was an English medical doctor, surgeon and author and was the son-in-law of Sir William Gull, a leading London medical practitioner and one of the Physicians-in-Ordinary to Queen Victoria. For many years Acland was the Medical Adviser to the government of the Sudan.", "link_mentions": [{"page": "William Gull", "response": ["They had three children: Caroline Cameron Gull was born in 1851 at Guy's Hospital and died in 1929; she married Theodore Dyke Acland MD (Oxon.) FRCP, the son of Sir Henry Acland, 1st Baronet MD FRS. They had two children, a daughter (Aimee Sarah Agnes Dyke Acland) who died in infancy in 1889, and a son, Theodore Acland (1890–1960), who became headmaster of Norwich School.Theodore Dyke Acland at thepeerage.com. Retrieved 23 August 2008.", "Stowell was a junior colleague to Dr Theodore Dyke Acland, Gull's son-in-law. He alleges that one of Gull's patients was the Whitechapel murderer. He refers to the killer as \"S\" throughout the article without ever identifying him, but the identity of \"S\" is widely presumed to be Prince Albert Victor, Duke of Clarence and Avondale, Queen Victoria's grandson and heir presumptive to the throne. Stowell writes,"]}, {"page": "Jack the Ripper: The Final Solution", "response": ["In 1970, British surgeon Thomas E. A. Stowell published an article entitled \"Jack the Ripper – A Solution?\" in the November issue of The Criminologist. In the article, Stowell proposed that the Ripper was an aristocrat who had contracted syphilis during a visit to the West Indies, that it had driven him insane, and that in this state of mind he had perpetrated the five canonical Jack the Ripper murders. Although Stowell did not directly name his suspect in the article, he described in detail the suspect's family and his physical appearance and nicknames, all of which pointed to Queen Victoria's grandson, Prince Albert Victor, Duke of Clarence and Avondale.Rumbelow, pp. 209–213 Stowell wrote that following a double murder on 30 September 1888, his suspect was restrained by his own family in an institution in the south of England, but later escaped to commit a final murder on 9 November before ultimately dying of syphilis. To back up his theory, Stowell drew comparisons between the evisceration of the women and the disembowelment of deer shot by the aristocracy on their estates. Stowell said his information came from the private notes of Sir William Gull, a reputable physician who had treated members of the royal family.Stowell, T. E. A. (November 1970) \"Jack the Ripper – A Solution?\". The Criminologist vol. 5 pp. 40–51 quoted in Rumbelow, pp. 209–212 Stowell knew Gull's son-in-law, Theodore Dyke Acland, and was an executor of Acland's estate.Begg, pp. 288–289 and Knight, pp. 202–203"]}, {"page": "Richard Morant", "response": ["He played Maximilien Robespierre in The Scarlet Pimpernel (1982), and he later played Mervyn Bunter, the valet of Lord Peter Wimsey, in A Dorothy L. Sayers Mystery, the BBC's 1987 productions of Strong Poison, Have His Carcase and Gaudy Night (all based on Dorothy Sayers's original novels). In 1988 he played Theodore Dyke Acland in the serial Jack the Ripper."]}, {"page": "List of Old Wykehamists", "response": ["*  Theodore Dyke Acland, physician-in-ordinary to Queen VictoriaWainewright, 1907. p. 206"]}, {"page": "List of Leipzig University people", "response": ["* Theodore Dyke Acland, English "]}, {"page": "Henry Acland", "response": ["His son, Colonel Alfred Dyke Acland, married Hon. Beatrice Danvers Smith, daughter of Rt. Hon. W. H. Smith of the Newsagents dynasty on 30 July 1885 and gained the rank of Lieutenant-Colonel in 1910 in the service of the Royal 1st Devon Yeomanry (Territorial Army). Another son, Theodore Dyke Acland married the daughter of Sir William Gull, a leading London medical practitioner and one of the Physicians-in-Ordinary to HM Queen Victoria.", "* Theodore Dyke Acland (1851–1931), the father of Theodore Acland (1890–1960)"]}, {"page": "List of alumni of King's College London", "response": ["*Theodore Dyke Acland – surgeon and physician"]}, {"page": "Theodore Acland", "response": ["Acland was the son of Theodore Dyke Acland MD (Oxon.) FRCP and of his wife Caroline Cameron Gull. He was the grandson of Sir Henry Acland, 1st Baronet MD FRS and of Sir William Gull, 1st Baronet, MD FRS.'ACLAND, Rev. Theodore William Gull', in Who Was Who, A & C Black, 1920–2007; online edition by Oxford University Press, December 2007 ACLAND, Rev. Theodore William Gull (subscription required), retrieved 23 August 2008 His great-grandfather, Sir Thomas Dyke Acland, 10th Baronet (1787–1871), had been a member of parliament, one of the Devonshire Aclands, an old family. Acland had one sister, Aimee Sarah Agnes Dyke Acland, who died in infancy in 1889; otherwise, he was an only child.Theodore Dyke Acland at thepeerage.com, retrieved 23 August 2008"]}, {"page": "Sarah Acland", "response": ["* Theodore Dyke Acland (1851–1931), the father of Theodore Acland (1890–1960)"]}, {"page": "Jack the Ripper (miniseries)", "response": ["There is no shortage of suspects for Abberline and his partner, Sergeant George Godley. These suspects include the American actor Richard Mansfield (appearing in the play Strange Case of Dr Jekyll and Mr Hyde in London); police surgeon Dr Henry Llewellyn; socialist agitator George Lusk; Queen Victoria's clairvoyant Robert Lees; the Queen's grandson Prince Albert Victor; and Dr Theodore Dyke Acland, the son-in-law of Sir William Gull, Royal Surgeon to Queen Victoria and expert on diseases of the brain. The police and the authorities want the murders solved at any cost, but Abberline and Godley face huge obstacles as they search for the truth – and hindrance from their superiors when the killer is finally unmasked.", "* Richard Morant – Dr. Theodore Dyke Acland, son-in-law of Sir William Gull", "The series is constructed as a Whodunit in which viewers are led to suspect, at various points, that Prince Albert Victor, Richard Mansfield, George Lusk, Henry Llewellyn or Theodore Dyke Acland could be Jack the Ripper. Before Jack the Ripper was broadcast, director/co-writer David Wickes claimed that he had been allowed unprecedented access to the Scotland Yard files on the Ripper case and stated that his production would be revealing the 'true' identity of Jack the Ripper for the first time. After pressure from Ripperologist Melvin Harris and others, Wickes was forced to withdraw this claim. Nevertheless, the series begins with a disclaimer on behalf of the production staff, stating, \"Our story is based on extensive research, including a review of the official files by special permission of the Home Office and interviews with leading criminologists and Scotland Yard officials.\" The series' \"revelation\" that Sir William Gull was Jack the Ripper was not new: Stephen Knight's 1976 book alleged that Gull was the Ripper, and prior to that, the theory had been cited in the 1973 BBC TV series Jack the Ripper (two episodes of which were directed by David Wickes). Furthermore, the Ripper character in the film Murder by Decree, assigned the fictitious name \"Sir Thomas Spivey,\" was based on Sir William Gull.", "The series ends with Gull's son-in-law, Dr. Theodore Dyke Acland, theorising that Gull was using himself as a case-study of multiple personality disorder (giving free rein to his murderous impulses in an effort to understand his own multi-faceted mind). The series presents Gull acting of his own accord (with only coachman John Netley complicit in his crimes), and conspiracy only coming into play after Gull's arrest: according to the series, Gull's murders were covered up at the behest of police commissioner Sir Charles Warren to avoid a scandal, as Gull was Queen Victoria's physician. The series' denouement thus differs to Stephen Knight's claim that Warren was aware of the Ripper's identity as the crimes were being committed."]}, {"page": "Theodore Dyke Ackland", "response": ["#REDIRECTTheodore Dyke Acland"]}, {"page": "Theodore Dyke Acland MD, FRCP, FRCS", "response": ["#REDIRECT Theodore Dyke Acland"]}]}}