{"wiki_id": "http://www.wikidata.org/entity/Q7786959", "itemLabel": "Thomas Agar-Robartes", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Agar-Robartes", "wikipedia_page": {"main": "Thomas Charles Reginald Agar-Robartes (known as Tommy) (22 May 1880 – 30 September 1915) was a British Liberal politician.", "link_mentions": [{"page": "Bonar Law", "response": ["Despite the conflict and fierce resistance, the Bill continued its passage through Parliament. It moved to its second reading on 9 June, and the Committee stage on 11 June, where it became fraught in controversy after a young Liberal named Thomas Agar-Robartes proposed an amendment excluding four of the Ulster counties (Londonderry, Down, Antrim & Armagh) from the Irish Parliament.Adams (1999) p.111 This put Law in a delicate situation, since he had previously said that he would support a system allowing each county to remain \"outside the Irish Parliament\", at the same time saying that he would not support any amendment that didn't have Ulster's full co-operation. If he accepted the amendment, he would be seen as abandoning the Irish Unionists, but on the other hand if the amendment was carried it might disrupt the government by causing a split between the Liberals and Irish Nationalists, bringing down the government and thus forcing an election.Adams (1999) p. 112"]}, {"page": "List of United Kingdom MPs: A", "response": ["| rowspan=\"2\" |Thomas Agar-Robartes", "|Thomas Agar-Robartes,", "|Thomas Agar-Robartes"]}, {"page": "Lanhydrock House", "response": ["The Robartes family declined significantly during the First World War, including the heir Thomas Agar-Robartes MP, who was killed during the Battle of Loos in France, while trying to rescue a colleague from no-man's land. Only one descendant survives, living in a cottage on the estate."]}, {"page": "Viscount Clifden", "response": ["On his death the barony of Dover became extinct, while he was succeeded in the other titles by his kinsman the second Baron Robartes, who became the sixth Viscount. He was the son of Thomas James Agar-Robartes, who was created Baron Robartes in 1869 (see below), son of Hon. Charles Bagenal-Agar, youngest son of the first Viscount Clifden. The sixth Viscount had earlier represented Cornwall East in Parliament as a Liberal and also served as Lord Lieutenant of Cambridgeshire from 1906 to 1915. His eldest son Captain the Hon. Thomas Agar-Robartes sat as Liberal Member of Parliament for Bodmin and St Austell, but was killed in the First World War, predeceasing his father, unmarried.", "The title of Baron Robartes, of Lanhydrock, and of Truro in the County of Cornwall, was created in the Peerage of the United Kingdom in 1869 for Thomas Agar-Robartes, who had previously represented Cornwall East in Parliament. He was the son of Hon. Charles Bagenal-Agar, youngest son of James Agar, 1st Viscount Clifden (see above). His mother was Anna Maria Hunt, great-niece and heiress of Henry Robartes, 3rd Earl of Radnor (whose titles became extinct in 1757). On 30 March 1822, he assumed the additional surname and arms of Robartes by royal licence. Lord Robartes' son, the second Baron, succeeded his kinsman as sixth Viscount Clifden in 1899. For further history of the peerages, see the Viscount Clifden above."]}, {"page": "Bullingdon Club", "response": ["* Thomas Agar-Robartes (1880–1915), MP (1906, 1908–1915)"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Hon. Thomas Agar-Robartes"]}, {"page": "Bodmin (UK Parliament constituency)", "response": ["|| 1906 || Thomas Agar-Robartes || Liberal"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Thomas Agar-Robartes", "|Thomas Agar-Robartes", "|Hon Thomas Agar-Robartes"]}, {"page": "Template talk:Heraldry/traditions by country", "response": ["::Thank you for that Wilhelm. I wasn't originally claiming that Cornwall should be listed with all the countries. I originally put it under the United Kingdom in the brackets with England Scotland and Wales. What I would say though is that the definition given by Fram of what constitutes a country does allow for Cornwall to be included like Wales is. \"A country or territory is a geographical area, either in the sense of nation (a cultural entity) and/or state (a political entity).\" and \"Nation may refer to a community of people who share a common language, culture, ethnicity, descent, or history. However, it can also refer to people who share a common territory and government (for example the inhabitants of a sovereign state) irrespective of their ethnic make-up; that is, a nation state.\" Indeed Cornwall and the Cornish people were referred to as a nation or country during the 16th and 17th century. People who have explicitly referred to Cornwall in such a way include: Thomas Agar-Robartes MP, 1910; Peter Bessell MP and John Pardoe MP, 1967; Charles Lee (author) 1898; D. H. Lawrence; Ludovico Falier, Venetian ambassador, 1531; Girolamo Ruscelli, 1561; George Lily, 1546; Johannes Honter; Polydore Vergil, official historian of Henry VII and VIII; Sebastian Münster, 1538; Francis Bacon, 1622; Robert Louis Stevenson; John Betjeman; and A. L. Rowse. There are also the 83,966 who stated their national identity as Cornish in the United Kingdom Census 2011 and the 41% of school children registering their ethnic identity as Cornish in the same year. There are also several thousand people who speak the Cornish language. So there's definitely \"a community of people who share a common language, culture, ethnicity, descent, or history.\" which means that there's a \"nation (a cultural entity)\" which is one of the two definitions of Country that Wikipedia lists. Bodrugan (talk) 04:10, 9 November 2013 (UTC)"]}, {"page": "United Kingdom by-election records", "response": ["*1915 St Austell by-election: The Hon Thomas Agar-Robartes had died of wounds received in the Battle of Loos in France."]}, {"page": "United Kingdom general election records", "response": ["|Thomas Agar-Robartes"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|Captain||Thomas Agar-Robartes||1880||1915||Wounded in the Battle of Loos on 28 September and killed by a sniper||Liberal||St Austell Division||Eldest son and heir of Thomas Agar-Robartes, 6th Viscount Clifden so styled 'The Honourable'"]}, {"page": "St Austell (UK Parliament constituency)", "response": ["| Thomas Agar-Robartes", "*Liberal: Thomas Agar-Robartes"]}, {"page": "Francis Agar-Robartes, 7th Viscount Clifden", "response": ["Clifden was the second but eldest surviving son (his elder brother Captain the Hon. Thomas Agar-Robartes having been killed in the First World War) of Thomas Agar-Robartes, 6th Viscount Clifden, and his wife Mary (née Dickenson), and was educated at Eton and Christ Church, Oxford. In 1930 he succeeded his father in the viscountcy and to Lanhydrock House and took his seat on the Liberal benches in the House of Lords."]}, {"page": "Thomas Charles Reginald Agar-Robartes", "response": ["#REDIRECT Thomas Agar-Robartes"]}, {"page": "Thomas Agar-Robartes, 6th Viscount Clifden", "response": ["Thomas Charles Agar-Robartes, 6th Viscount Clifden (1 January 1844 – 19 July 1930), styled The Honourable Thomas Agar-Robartes between 1869 and 1882 and known as The Lord Robartes from 1882 to 1899, was a British landowner and Liberal politician.", "Agar-Robartes was born at Grosvenor Place, London, the son of Thomas Agar-Robartes, 1st Baron Robartes,thepeerage.com Thomas Charles Agar-Robartes, 6th Viscount Clifden of Gowran and Juliana Pole-Carew, daughter of Reginald Pole-Carew, of East Antony, Cornwall.cracroftspeerage.co.uk Clifden, Viscount (I, 1781 - 1974)  He was educated at Harrow and Christ Church, Oxford, and was called to the Bar at the Middle Temple in 1870.", "Lord Clifden married Mary Dickinson, daughter of Francis Henry Dickinson, of Kingweston House, Somerset, in 1878. They had ten children, of whom one died in infancy. Their eldest son the Honourable Thomas Agar-Robartes (had a twin sister) was also a Liberal politician, killed in World War I."]}, {"page": "1906 Bodmin by-election", "response": ["The by-election was triggered by the unseating of the town's Liberal Member of Parliament (MP) Thomas Agar-Robartes, as a result of an election petition alleging illegal payments to potential voters. The success of the petition was controversial, as the presiding Judge, Justice Grantham, himself a former Conservative MP, was already facing criticism for a decision on an election petition in the Great Yarmouth constituency which had been considered unduly favourable to the Conservatives. A censure motion was outstanding in Parliament at the time of the decision, but the Government decided not to proceed with it. Five years later, he was censured in Parliament by the then Prime Minister, H. H. Asquith, as a consequence of some comments to a jury in a case in Liverpool.J. B. Atlay, ‘Grantham, Sir William (1835–1911)’, rev. Robert Stevens, Oxford Dictionary of National Biography, Oxford University Press, 2004"]}, {"page": "Wimpole", "response": ["Its parish church of St Andrew (still in use within the Orwell Group of Parishes, holding services on the first and third Sundays of each month) is next-door to the Hall and was once part of the Hall's estate (whose east service wing nearly abutted it at one point). It contains the family tombs of some of its residents, such as the Earls of Hardwicke, and a stained glass window commemorating Thomas Agar-Robartes, eldest son of Thomas Charles, 6th Viscount Clifton and Mary, Viscountess Clifton of Lanhydrock, Bodmin, Cornwall. A medieval church on the site was demolished (except for most of the Chicheley Chantry or Chapel dating to 1390, which survived despite thus being open to the north side of the body of the nave during the 1749 construction work) in 1749 to build the present nave and chancel."]}, {"page": "List of Cornish soldiers, commanders and sailors", "response": ["* Captain Thomas Agar-Robartes, British Army officer and MP"]}, {"page": "June 1912", "response": ["* For the first time in the Parliament of the United Kingdom debates over Irish Home Rule movement, the proposal was made to treat northeast Ireland differently from the rest of the island. Member of parliament Thomas Agar-Robartes offered an amendment to exclude the mostly Protestant County Antrim, County Armagh, County Down and County Londonderry from Home Rule.Geoffrey Lewis, Carson: The Man Who Divided Ireland (Continuum International Publishing, 2006) p. 97"]}, {"page": "Oxford University Polo Club", "response": ["* Thomas Agar-Robartes, Christ Church (1880–1915)"]}, {"page": "1915 St Austell by-election", "response": ["The St Austell by-election of 1915 was held on 24 November 1915.  The by-election was held due to the incumbent Liberal MP, Thomas Agar-Robartes, dying of wounds sustained in the Battle of Loos in the First World War.  It was won by the Liberal candidate Sir Francis Layland-Barratt who was unopposed due to a War-time electoral pact."]}, {"page": "1908 St Austell by-election", "response": ["The St Austell by-election of 1908 was held on 5 February 1908.  The by-election was held due to the resignation of the incumbent Liberal MP, William Alexander McArthur.  It was won by the Liberal candidate Thomas Agar-Robartes, who was unopposed."]}, {"page": "Tommy Agar-Robartes", "response": ["#REDIRECT Thomas Agar-Robartes"]}, {"page": "Arthur Agar-Robartes, 8th Viscount Clifden", "response": ["Agar-Robartes was the youngest son of Thomas Agar-Robartes, 6th Viscount Clifden, and his wife Mary (née Dickenson). He was educated at Eton College, before attending Brasenose College, Oxford. He was a member of the Bullingdon Club during his time at Oxford. Agar-Robartes was a keen recreational cricketer, playing once for Cornwall in a Minor Counties Championship match in 1904, which was played at his Lanhydrock home.", "Agar-Robartes served in the First World War. He was first mentioned in dispatches in 1915, as a machine-gun officer in the 2nd Battalion Grenadier Guards. He was wounded three times during the course of the war: 8 October 1915, 14 September 1916 and 23 March 1918. He reached the rank of Major and was awarded the Military Cross. His brother, Thomas Agar-Robartes, was killed in action in 1915, being recommended posthumously for the Victoria Cross."]}, {"page": "Agar-Robartes, Thomas", "response": ["#redirectThomas Agar-Robartes"]}]}}