{"wiki_id": "http://www.wikidata.org/entity/Q7787030", "itemLabel": "Thomas Allibone", "itemDescription": "physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Allibone", "wikipedia_page": {"main": "Thomas Edward Allibone, CBE, FRS (11 November 1903 – 9 September 2003) was an English physicist. His work included important research into particle physics, X-rays, high voltage equipment, and electron microscopes.", "link_mentions": [{"page": "John Cockcroft", "response": ["In 1919, Rutherford had succeeded in disintegrating nitrogen atoms with alpha particles emitted from decaying radium atoms. This and subsequent experiments hinted at the structure of atomic nuclei. To explore it further, he needed an artificial means of creating particles with a velocity high enough to overcome the charge of the nucleus. This opened a new line of research at the Cavendish Laboratory. He assigned Cockcroft, Thomas Allibone and Ernest Walton to the problem. They built what became known as a Cockcroft–Walton accelerator. Mark Oliphant designed a proton source for them. A crucial moment came when Cockcroft read a paper by George Gamow on quantum tunnelling. Cockcroft realised that as a result of this phenomenon, the desired effect could be achieved with much lower voltages than first thought. In fact, he calculated that protons with energy of just 300,000 electronvolts would be able to penetrate a boron nucleus. Cockcroft and Walton worked on their accelerator for the next two years. Rutherford obtained a £1,000 grant from the University of Cambridge for them to buy a transformer and other equipment they needed."]}, {"page": "Aldermaston", "response": ["In 1953, Pole stepped down as Lord of the Manor and was succeeded by AEI's senior representative, Thomas Allibone. Allibone held the position for 32 years, until Blue Circle Industries acquired the estate in 1985. Allibone was succeeded by Tony Jackson, and the current Lord of the Manor is Andy Hall. Blue Circle could not gain planning permission in the grounds of the court, so the MERLIN reactor was demolished to make way for Portland House. With a full redevelopment of Aldermaston Manor, the £14 million office development became Blue Circle's international headquarters and the complex was opened by Prince Richard, Duke of Gloucester.", "* Thomas Allibone, Lord of the Manor (1953–1985)"]}, {"page": "Calutron", "response": ["While the process had been demonstrated to work, considerable effort was still required before a prototype could be tested in the field. Lawrence assembled a team of physicists to tackle the problems, including David Bohm, Edward Condon, Donald Cooksey, A. Theodore Forrester, Irving Langmuir, Kenneth Ross MacKenzie, Frank Oppenheimer, J. Robert Oppenheimer, William E. Parkins, Bernard Peters and Joseph Slepian. In November 1943 they were joined by a British Mission headed by Oliphant that included fellow Australian physicists Harrie Massey and Eric Burhop, and British physicists such as Joan Curran and Thomas Allibone."]}, {"page": "Royal Institution Christmas Lectures", "response": ["| Thomas Allibone"]}, {"page": "2003 in the United Kingdom", "response": ["** Thomas Allibone, physicist (born 1903)"]}, {"page": "1903 in the United Kingdom", "response": ["* 11 November – Thomas Allibone, physicist (died 2003)"]}, {"page": "Index of World War II articles (T)", "response": ["# Thomas Allibone"]}, {"page": "Sceptre (fusion reactor)", "response": ["At Aldermaston, the Imperial team was put under the direction of Thomas Allibone. Compared to the team at Harwell, the Aldermaston team decided to focus on faster pinch systems. Their power supply consisted of a large bank of capacitors with a total capacity of 66,000 Joules (when fully expanded) switched by spark gaps that could dump the stored power into the system at high speeds. Harwell's devices used slower rising pinch currents, and had to be larger to reach the same conditions.Thonemann, p. 34"]}, {"page": "John Samuel Forrest", "response": ["Following graduation Forrest took up his first appointment, as a physicist with the Central Electricity Board, Glasgow, followed the next year (1931) with that of physicist with the Central Electricity Board at London, working on the new National Electricity Grid. His first published paper on the Grid was submitted to the Institution of Electrical Engineers in June 1931, in which month he also attended the Conference Internationale des Grands Reseau Electrique at Paris, with Thomas Allibone."]}, {"page": "Bernard Price Memorial Lecture", "response": [":1959\tThomas Allibone"]}, {"page": "Index of physics articles (T)", "response": ["*Thomas Allibone"]}, {"page": "List of Freemasons (A–D)", "response": ["* Thomas Allibone (11 November 1903 – 9 September 2003), English physicist"]}, {"page": "Deaths in September 2003", "response": ["*Thomas Allibone, 99, English physicist, focused on high voltage phenomena, nuclear fusion and particle physics."]}, {"page": "List of alumni of Gonville and Caius College, Cambridge", "response": ["*Thomas Allibone – physicist"]}, {"page": "Allibone", "response": ["*Thomas Allibone (1903–2003), English physicist"]}, {"page": "Allibone, Thomas", "response": ["#redirectThomas Allibone"]}]}}