{"wiki_id": "http://www.wikidata.org/entity/Q7781950", "itemLabel": "Theodore Plucknett", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Plucknett", "wikipedia_page": {"main": "Theodore Frank Thomas Plucknett (2 January 1897 – 14 February 1965) was a British legal historian who was the first chair of legal history at the London School of Economics.\nPlucknett was born on 2 January 1897 in Bristol. Plucknett completed his early education at Alderman Newton's School in Leicester and then Bacup and Rawstenstall school in Newchurch, Lancashire. He completed his degree in History at London University and graduated with second class honours. He later completed his masters at University College London before his twenty-first birthday. He was also awarded the Alexander prize of the Royal Historical Society. For his masters Plucknett's speciality was the fifteenth-century council; he would later go on to write his PhD thesis on Statutes and their Interpretation in the First Half of the Fourteenth Century. He received his PhD from Emmanuel College, Cambridge and studied under the tutorship of H. D. Hazeltine.With Plucknett's PhD came an LLB degree, which helped him get into Harvard Law School. Whilst studying at Harvard he took no courses, and instead only studied. He arrived at the school as a student in 1920 and by 1923 was an instructor. By 1926 he had graduated to an assistant professor; a position he held until 1931.Plucknett then left Harvard for the London School of Economics after he received a recommendation from Harold Laski, who had been impressed by Plucknett's recent publication, Concise History of the Common Law. The book had been dictated and edited in a matter of weeks. When Plucknett arrived at the London School of Economics, he became the first ever holder of the school's chair of legal history. He was to remain in that position until his retirement in 1963. He succeeded William Holdsworth as Literary Director of the Selden Society and was followed by S. F. C. Milsom.\nThough Plucknett remained at the London School of Economics, he also held the presidency of the Royal Historical Society from 1948 to 1952, and the presidency of the Society of Public Teachers of Law from 1953 to 1954. In 1950 Plucknett was awarded a fellowship at University College London and in 1950 he was made an honorary fellow of Emmanuel College, Cambridge. He also received honorary degrees from both Glasgow University, Birmingham University and Cambridge.In later life colleagues would describe Plucknett as 'distant'. He maintained the history of law had nothing to do with its practical application and was quoted as saying that \"It is still too often said that English law can only be understood historically. Now English law may be bad, but is it really as bad as that?\"Plucknett officially retired from teaching in 1963 due to poor health and died at his home in Crescent Road, Wimbledon, London SW19 on 14 February 1965.", "link_mentions": {}}}