{"wiki_id": "http://www.wikidata.org/entity/Q7789844", "itemLabel": "Thomas Furlong", "itemDescription": "Irish poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Furlong_(poet)", "wikipedia_page": {"main": "Thomas Furlong (1794–1827) was an Irish poet.\nFurlong was the son of a farmer, born at Scarawalsh, situated between Ferns and Enniscorthy, County Wexford. He obtained an appointment in the counting-house of an extensive distillery at Dublin, where he continued until his death.\nHis first work was a poem, The Misanthrope (Lond. 1819), composed, he stated, with the object of reclaiming a friend who, owing to early disappointments, had retired from society. It was withdrawn by the author on account of numerous typographical errors. He issued a second edition at Dublin in 1821, with other poems. \nA poem entitled The Plagues of Ireland: an Epistle appeared at Dublin in 1824, with a view to promoting Catholic Emancipation. He described his work as \"a little sketch and hasty picturing\" of the more prominent evils and grievances which should be removed before that \"harassed land\" of Ireland could calculate on the enjoyment of tranquility. To The Plagues of Ireland Furlong appended a few \"occasional poems\". \nHe contributed largely to the New Monthly Magazine, as well as to other periodicals, and projected a literary journal at Dublin. Thomas Moore, Charles Maturin and Lady Morgan praised his work. At the instance of James Hardiman, author of the History of Galway, Furlong undertook to produce metrical versions in English of the compositions of Carolan and other native Irish poets. While engaged on this work, and on a poem entitled The Doom of Derenzie, Furlong died on 25 July 1827 at Dublin, and was interred in the churchyard of Drumcondra. \nOf The Doom of Derenzie but one sheet had been revised by the author. It appeared posthumously (London, 1829). The poem treated the superstitions of the peasantry of Wexford. \nSeveral of Furlong's metrical translations, and a portrait of him, appeared in Hardiman's work on Irish minstrelsy (London, 1831). One of his compositions was, in 1845, included in Duffy's Ballad Poetry of Ireland.\n\n", "link_mentions": {}}}