{"wiki_id": "http://www.wikidata.org/entity/Q7781813", "itemLabel": "Theodore Hardy", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Hardy", "wikipedia_page": {"main": "Theodore Bayley Hardy,  (20 October 1863 – 18 October 1918) was a British Army chaplain and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. In addition to the VC, Hardy had been awarded the Distinguished Service Order and Military Cross, making him one of the most decorated non-combatants of the First World War.", "link_mentions": [{"page": "Nottingham High School", "response": ["The Junior School's four houses are named after former pupils or staff who served with distinction in the First World War and were killed in action or died of their wounds.  Ball's House recalls Captain Albert Ball VC DSO MC, a fighter pilot in the RFC and pupil at the school in 1907–1909, Hardy's House Rev. Theodore Hardy VC DSO MC, an assistant master in 1891–1907 and a British Army chaplain in 1916–1918, Tonkin's House FC Tonkin DSO MC, a former pupil who served in the King's Royal Rifle Corps, and Trease's House Lt Reginald Trease DSO MC, a pupil at the school in 1898–1905. The houses compete annually for a General Efficiency Cup donated in 1927 by William Crane.", "*Theodore Hardy (1863–1918), NHS schoolmaster, non-combatant chaplain in the Great War, awarded the Victoria Cross"]}, {"page": "Royal Army Chaplains' Department", "response": ["Army chaplains, although they are all commissioned officers of the British Army and wear uniform, do not have executive authority. They are unique within the British Army in that they do not carry arms. At services on formal occasions, chaplains wear their medals and decorations on their clerical robes (many chaplains have been decorated for bravery in action, including four Victoria Crosses: James Adams, Noel Mellish, Theodore Hardy and William Addison).", "* Theodore Hardy VC DSO MC"]}, {"page": "Burton Joyce", "response": ["Other figures of note are the Oldham industrialist and philanthropist Samuel Milne (1828–1877) and author Ronald Acott Hall (1892–1966), a diplomat and unsuccessful Liberal Party parliamentary candidate for Ilford South. Rev. Theodore Hardy (1863–1918), recipient of a First World War Victoria Cross, had been licensed in 1899 as a curate to the village.N. T. A. Cave, "]}, {"page": "Theodore Bailey Hardy", "response": ["#REDIRECT Theodore Hardy"]}, {"page": "Theodore Bayley Hardy", "response": ["#REDIRECT Theodore Hardy"]}, {"page": "List of people from the London Borough of Harrow", "response": ["* Theodore Hardy, Army Chaplains' Department,  VC, educated in Hatch End"]}, {"page": "John Diggle", "response": ["In 1905, Diggle was appointed Bishop of Carlisle, the diocesan bishop of the Diocese of Carlisle.Images of Cumbria He was one of the most vociferous episcopal supporters of British involvement in the Great War.  He blamed Prussian militarism and was appalled at what he regarded as German cruelty to Belgian and French civilians who had been overrun in the German advance.  He regarded it as a spiritual war, the 'Good'of Britain and her allies facing the wickedness of Germany and, therefore, fighting for a choice between '...public law or military licence...freedom or absolutism, independence or servitude, truth or falsehood, purity or corruption, faith or force, love or hate, Christ or Beliel...'Carlisle Diocesan Gazette, July 1915. These monthly published gazettes had regular news and features about the War He was very proud of clergy and their families who were especially active in the War.  These included his own sons, Reginald, who won a MC as a chaplain, and Philip, who was a major in the Border Regiment;and Theodore Hardy, vicar of Hutton Roof, who was awarded the VC.  His assistant, the Bishop of Barrow-in-Furness, who volunteered as a Chaplain and served with the Church Army, and the Vicar of Ambleside, who worked in a munitions factory during the week and returned to his parish at weekends to take services, were praised.  Unlike most of his colleagues, he refused to forbid his clergy from joining the forces as combatants, writing 'If it is wrong for a clergyman to enlist, can he encourage others to enlist?  If we honour and praise the dead for a sacred cause how can it be wrong for clergy to enlist in so noble a cause?'.Carlisle Diocesan Chronicle, December, 1915  Diggle also refused to accept candidates for ordination if they were 'of military age and medically fit at this critical juncture in the nation's needs'.Op cit June 1916  One of Diggle's last tasks was to join President Wilson of the USA in the nonconformist chapel where Wilson's ancestors had worshipped, and was widely criticised since he was a CofE bishop.  Diggle was unmoved and wanted to welcome the President on his visit to the diocese.The Times obituary, 26.3.1920  Diggle continued as bishop until his death on 24 March 1920.National ArchivesObituary The Bishop Of Carlisle. A Liberal Prelate The Times Friday, Mar 26, 1920; p. 18; issue 42369; col B."]}, {"page": "List of works by Terence Cuneo", "response": ["|1966||Presentation of the Victoria Cross to the Reverend Theodore Bayley Hardy, VC, DSO, MC by HM King George V, oil on canvas ||view ||86 × 116  cm. (33.9 × 45.7 in.) ||Museum of Army Chaplaincy, Amport House, near Andover, Hampshire ||Scene: Theodore Hardy VC (1863–1918); George V (1865–1936)."]}]}}