{"wiki_id": "http://www.wikidata.org/entity/Q7787605", "itemLabel": "Thomas Bertie", "itemDescription": "Royal Navy officer during the American War of Independence, and the French Revolutionary and Napoleonic Wars.", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Bertie", "wikipedia_page": {"main": "Sir Thomas Bertie KSO (born Hoar, 3 July 1758 – 13 June 1825)  was an English officer of the Royal Navy who served during the American War of Independence and the French Revolutionary and Napoleonic Wars.His career began in the East Indies, where he served aboard the frigate HMS Seahorse with two fellow youths Horatio Nelson and Thomas Troubridge who he would remain in contact with as they each rose through the ranks in the navy. He eventually spent most of his youth serving in the West Indies and off the American coasts during the American War of Independence, seeing action in a number of battles with the French. He was a commander by the end of the war, but peace left him without a ship or promotion prospects. He married during the period of peace, taking the surname Bertie in accordance with his father-in-law's will, and also used his time ashore to carry out experiments that led to the introduction of lifebuoys to the navy. Returning to active service during the wars with revolutionary France, Bertie commanded a number of ships, often in the North Sea or the English Channel. His experience led to him being assigned to the expedition to the Baltic with Sir Hyde Parker and his old friend Horatio Nelson. Bertie was involved in the fierce fighting during the Battle of Copenhagen, and received Nelson's praise for his actions. This was the start of Bertie's long association with the Baltic, both as a captain, and after his promotion to rear-admiral. His good service led to a knighthood and an appointment to the Swedish Order of the Sword, but seriously weakened his health. He was obliged to resign his command in 1810, and went into retirement, dying in 1825.", "link_mentions": {}}}