{"wiki_id": "http://www.wikidata.org/entity/Q7789763", "itemLabel": "Thomas Francis", "itemDescription": "South African cricketer (1902-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Francis_(cricketer)", "wikipedia_page": {"main": "Thomas Egerton Seymour Francis (21 November 1902 – 24 February 1969) played first-class cricket for Somerset, Cambridge University and Eastern Province between 1921 and 1928. He also played four rugby union international matches for England in 1925/26. He was born at Uitenhage, Cape Province, South Africa and died at Bulawayo, Zimbabwe (then Rhodesia).\nEducated at Tonbridge School, Francis was a right-handed opening or middle-order batsman as a cricketer and a fly-half or centre three-quarter as a rugby player. He first played cricket for Somerset in 1921, the year he left school, making 36 in his third match against Leicestershire, but otherwise making little impact. He reappeared in two games in the 1922 season, with similar results.\nIn autumn 1922 Francis went to Pembroke College, Cambridge and won the first of four blues for rugby union that winter, playing in The Varsity Match against Oxford University as fly-half in partnership with the scrum-half Arthur Young; the partnership was maintained across the next two seasons and Francis won a fourth blue as a centre in 1925. Young was capped by England in 1924 and Francis joined him in the England team for four internationals in the 1925/26 season.Francis's cricket career was slower to develop at Cambridge. He was given seven first-class matches for the university side in the 1923 season, and made his highest first-class score of 79 in the match against the Army. He followed that with 71 against Essex three weeks later. But a further dozen innings produced only 61 further runs and he did not win a blue. In 1924, he played in only two matches, but in 1925 he returned to the Cambridge first team and, without exceeding the 79 he had made two years and despite missing matches through injury, he was awarded his blue, though he made only 15 in a run-heavy University Match against Oxford that ended in a dull draw. When the university cricket season was over, he went back to play for Somerset for the rest of 1925, though he was not successful, his highest score for the side being only 35.Francis returned to South Africa and later appeared in a single match for Eastern Province against the MCC team of 1927–28. He captained the Eastern Province team and made 11 and 14 himself in a curious match in which the MCC side was all out for 49 in its first innings, and then, set 186 to win in a low-scoring game, hit off the runs without losing a wicket. This was Francis's last first-class match and the only one he played in his native South Africa.", "link_mentions": {}}}