{"wiki_id": "http://www.wikidata.org/entity/Q7788724", "itemLabel": "Thomas Crosby", "itemDescription": "English Methodist missionary", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Crosby", "wikipedia_page": {"main": "Thomas Crosby (21 June 1840 – 13 January 1914) was an English Methodist missionary known for his work among the First Nations people of coastal British Columbia, Canada.\nThomas Crosby was born in 1840 in Pickering, Yorkshire, to (Wesleyan) Methodist parents.  His father was a farmer.  When he was sixteen, he emigrated with his parents to the vicinity of Woodstock, Ontario.  Economic circumstances forced him to go to work at a tannery.\nIn 1861 he answered a call in a Methodist newspaper for missionaries to go to British Columbia.  Soon after arriving in B.C. in 1863, he was sent to teach at the Native school in Nanaimo, B.C..  In 1866 he became an itinerant preacher, accompanying the Rev. Edward White on a preaching circuit covering Vancouver Island, the Gulf Islands, and the area around Vancouver.  In 1869 Crosby was appointed a stable position preaching and teaching in Chilliwack, B.C.  He was ordained in 1871 and began intensively missionizing throughout the province.\nIn 1873, at a revival meeting in Victoria, he converted Elizabeth Diex, a Tsimshian matriarch from Lax Kw'alaams (a.k.a. Port Simpson) on the northern coast of B.C., and later also converted her son Chief Alfred Dudoward and daughter-in-law Kate Dudoward.  At that time, Lax Kw'alaams was without a minister and oriented around a Hudson's Bay Company fort with its attendant social problems.  The Church of England had abandoned the community in 1862 when the local Anglican lay missionary, William Duncan (coincidentally, like Crosby, a former tanner from Yorkshire), had taken a portion of his Tsimshian flock to found the nearby utopian Christian community of Metlakatla, B.C.  Alfred and Kate Dudoward pressed the Methodist church to commit a missionary to their village, and in 1874 Crosby was sent there.  Initially, his arrival caused Duncan to intensify his efforts to convert Lax Kw'alaams people from his new home base at Metlakatla.\nThe Dudowards eventually drifted away from the strict Methodist opposition to Native traditions like potlatching.  Though he learned to speak the Tsimshian language, Crosby insisted on the abandonment of most Native traditions.  One of the keystones of Crosby's relationship with the Lax Kw'alaams Tsimshian was a convert named Victoria Young or \"Queen Victoria\", a chieftainess of the Giluts'aaw tribe.\nCrosby's wife, Emma Crosby, founded the Crosby Girls' Home in the community in the 1880s.  It became part of B.C.'s residential school system in 1893 and was closed in 1948.\nUnder Crosby's direction, the Methodist missionary presence in northern B.C. expanded from Lax Kw'alaams to include ten missions, and, using Lax Kw'alaams as a base, he supervised mission work among the Nisga'a, Haida, Gitxsan, and other groups in addition to the Tsimshian.\nIn 1892 Crosby developed asthma and began to tire of mission work.  In 1897 he was made chairman of the British Columbia Conference of the Methodist Church of Canada and left Lax Kw'alaams to take charge of the newly subdivided mission district covering Lowe Inlet, Bella Bella, and parts of Vancouver Island.\nLax Kw'alaams is still a strongly Methodist community, now under the rubric of the United Church of Canada, which incorporates the Methodist church.  A mission boat named the Thomas Crosby operated up and down B.C.'s Inside Passage for much of the twentieth century.\nCrosby published three volumes of memoirs about his work among B.C.'s First Nations, including David Sallosalton, named for an early protégé of Crosby's, a catechist from the Coast Salish people.  Up and down the North Pacific Coast by Canoe and Mission Ship describes his Lax Kw'alaams years.\n\n", "link_mentions": [{"page": "Kwakwakaʼwakw", "response": ["An account of experiences of two founders of early residential schools for Aboriginal children was published in 2006 by the University of British Columbia Press. Good Intentions Gone Awry – Emma Crosby and the Methodist Mission On the Northwest Coast by Jan Hare and Jean Barman contains the letters and account of the life of the wife of Thomas Crosby the first missionary in Lax Kw'alaams (Port Simpson). This covers the period from 1870 to the turn of the 20th century."]}, {"page": "Tsimshian", "response": ["* Thomas Crosby, Methodist"]}, {"page": "Lax Kw'alaams", "response": ["Lax Kw'alaams was without missionaries until 1874, when Rev. Thomas Crosby of the Methodist church arrived.  The community is still predominantly Methodist (i.e. United Church of Canada).  Crosby's wife, Emma Crosby, founded the Methodist-affiliated Crosby Girls' Home in the community in the 1880s. It became part of B.C.'s Indian residential school system in 1893 and operated until 1948.", "* Bolt, Clarence (1992) Thomas Crosby and the Tsimshian: Small Shoes for Feet Too Large.  Vancouver: UBC Press."]}, {"page": "Giluts'aaw", "response": ["In the late nineteenth century the chieftainship of the Giluts'aaw was held by Victoria Young, a key convert of Lax Kw'alaams's Methodist missionary Thomas Crosby.  She succeeded to the Giluts'aaw Gispwudwada (Killerwhale clan) name-title Niisłgümiik of the House of Niisłgümiik, Giluts'aaw's leading royal house, when no male heirs were available.  However, despite marrying a holder of the Gispaxlo'ots chieftainship Ligeex, she bore no children and after her death in 1898 the name Niisłgümiik was bequeathed to a brother's son of a different clan whom she had adopted into the Gispwudwada.  This person may be Herbert Swanson, whom the anthropologist Marius Barbeau described in 1950 as having been, in 1915, the holder of Niisłgümiik, living at Metlakatla, B.C.."]}, {"page": "William Henry Pierce (missionary)", "response": ["During a stay in Victoria, British Columbia, Pierce was converted to Christianity by the Methodist missionary the Rev. Thomas Crosby and later served as his interpreter when Crosby was assigned to Port Simpson.  This led to Pierce's own career as a missionary.  First informally and then formally after his ordination in 1886, Pierce worked to convert Natives and suppress indigenous customs (like the potlatch and secret societies) in B.C. coastal villages such as Alert Bay, Bella Bella, Port Essington, Greenville, and Klemtu, and even Wrangell, Alaska.  Pierce was missionary at Kispiox for fifteen years starting in 1895, and in 1910 was transferred to Port Essington, where he served until his retirement in 1933.  Thereafter he lived in Prince Rupert, B.C."]}, {"page": "Alfred Dudoward", "response": ["After returning home, Kate and Alfred organized religious instruction in Lax Kw'alaams and lobbied the Methodist church to establish a mission there, which they eventually did, in 1874 under the Rev. Thomas Crosby. In fact, it was the Dudowards who agitated for the Methodist church to establish a mission there.", "*Bolt, Clarence (1992) Thomas Crosby and the Tsimshian: Small Shoes for Feet Too Large.  Vancouver: UBC Press."]}, {"page": "Edward Marsden", "response": ["Marsden married Lucy Kinninook, the young woman whose job was to translate Marsden's English sermons into Tlingit. She was a Tlingit chief's daughter and had been partially raised by the missionary Thomas Crosby in the Tsimshian community of Lax Kw'alaams (a.k.a. Port Simpson), B.C. Duncan refused to perform their marriage on the grounds that she was a divorcée."]}, {"page": "Heber Clifton", "response": ["As a child he moved to William Duncan's mission at Metlakatla BC, but when many Tsimshian migrated to Metlakatla Alaska in 1887, he was one of a group of families who moved back to their traditional territories and founded the new community of Hartley Bay. He and his wife Lucy were married by Rev. Thomas Crosby in 1891. They had a large family of five sons and four daughters"]}, {"page": "Lax-kw'alaams First Nation", "response": ["In 1857 an Anglican lay missionary named William Duncan brought Christianity to Lax Kw'alaams, but, feeling that he was competing in vain with the dissipated fort atmosphere for Tsimshian souls, he relocated about 350 of his flock to Metlakatla, at Metlakatla Pass just to the south.  There was no further missionary presence at Lax Kw'alaams until the arrival of the Rev. Thomas Crosby of the Methodist church in 1874.  The community is still predominantly Methodist (i.e. United Church of Canada).  Crosby's wife, Emma Crosby, founded the Crosby Girls' Home in the community in the 1880s.  It became part of B.C.'s residential school system in 1893 and was closed in 1948."]}, {"page": "Crosby (surname)", "response": ["* Thomas Crosby (1840–1914), English missionary in Canada", "* Thomas Crosby (Baptist) (1683–1751), English writer"]}, {"page": "Thomas Crosby (disambiguation)", "response": ["Thomas Crosby (1840–1914) was an English missionary in Canada. ", "Thomas Crosby may also refer to:", "*Thomas Crosby (Baptist) (1683–1751), English writer", "*Thomas Crosby (Lord Mayor), Lord Mayor of London"]}, {"page": "Crosby, Thomas", "response": ["#redirectThomas Crosby"]}]}}