{"wiki_id": "http://www.wikidata.org/entity/Q7786967", "itemLabel": "Thomas Ainscough", "itemDescription": "cricketer (1865-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Ainscough", "wikipedia_page": {"main": "Thomas Ainscough (23 February 1865 – 20 November 1927) was a first-class cricketer.  He was born and died at Lancaster House, Parbold, Lancashire. \nA left-handed batsman, he played for Lancashire County Cricket Club in two matches, one each in 1894 and 1906. He also played first-class cricket for Liverpool and District between 1891 and 1894. He scored 2 first-class fifties, with a best of 61 not out against Yorkshire.", "link_mentions": [{"page": "Ainscough", "response": ["Evidence of origin from the International Genealogical Index (IGI) is mixed and inconclusive. The IGI itself is a valuable but flawed resource. The current online database - which I shall term \"IGI 2\" - contains records contributed by members of the Church of Jesus Christ of Latter-day Saints (LDS), many of which are questionable. The original pass through Britain's parish records by LDS members was free of personal contributions and was available on microfiches in such centres as the library of the Society of Genealogists. I shall term this database \"IGI 1\". This original database excluded many Catholic records, owing to the reluctance of Catholic priests to allow their records being transcribed by the LDS. It also failed to record some nonconformist register entries. Given these caveats, an examination of the 1,623 records of Ainscoughs in Lancashire in the original IGI 1 shows that the earliest recorded event was the christening of Thomas Ainscough - son of John - on 27 April 1549 in Chorley. The next was the marriage of Kateryn Aynscow to John Brindill (Katherine Ainscough & John Brindle) on 17 January 1550 in the parish of Chorley. In the same year, on 20 January and in the same parish, Richard Aynscow married \"Jone Leeds\". John, Katherine and Richard may have been siblings and quite possibly were born in the 1520s. The records in IGI 1 are drawn almost exclusively from Anglican records, but these three Ainscoughs may well have come from the Lincolnshire connection.", "thumb|left|Thomas Ainscough, Lancashire Cricketer, OCC Team Photo 1901. Permission: Mary Ainscough 2007", "*Thomas Ainscough (1865–1927) first class cricketer. Major team Lancashire. Batting style Left-hand bat. Born 23 February 1865, Lancaster House, Parbold. Died 20 November 1927 (aged 62 years 270 days) Captain of the Second Eleven and a member of the committee. Many times he appeared in big matches for Liverpool and District teams, and in games against Yorkshire made scores of 61 not out, 50 and 61. 7th child of Hugh AINSCOUGH (1816–1894) and Susan (FAIRCLOUGH) AINSCOUGH (1830–1923)."]}, {"page": "Ainscough, Thomas", "response": ["#redirectThomas Ainscough"]}]}}