{"wiki_id": "http://www.wikidata.org/entity/Q7786943", "itemLabel": "Thomas Adams", "itemDescription": "architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Adams_(architect)", "wikipedia_page": {"main": "Thomas Adams (10 September 1871 – 24 March 1940) was a pioneer of urban planning. Born on Meadowhouse farm near Edinburgh to parents James and Margaret Adams, he was educated at Daniels Stewart's College in Edinburgh and was a farmer in his early years, Adams moved to London where he worked as a journalist.  He served as secretary to the Garden City Association and was the first manager of Letchworth, England from 1903 to 1906.\nAdams became a designer of low-density residential developments that were commonly referred to as \"garden suburbs.\" In 1909–1914, Adams worked as Town Planning Adviser to the Local Government Board. In 1914, he was invited to Canada to work for the Commission of Conservation to provide better housing for the growing population of industrial cities. After the Halifax Explosion in 1917, Adams designed the Hydrostone section using Garden City principles. In the same year he published Rural planning and development: a study of rural conditions and problems in Canada, one of the earliest books to advocate the use of land use controls. He also designed a portion of Corner Brook, Newfoundland. He worked with Halifax architect Andrew R. Cobb on this project. On other projects in Quebec and Nova Scotia he partnered with Ross and Macdonald of Montreal.  He was later responsible for surveys and a plan for New York City. In 1923-1930 he held a position of a director of the Regional Plan of New York. The plan was published in 1929 and anticipated the region's basic transportation and infrastructure needs for the next 30 years.On returning to the United Kingdom, Thomas Adams became one of the early presidents of the Institute of Landscape Architects (ILA) which became the Landscape Institute. In 1932, he was asked by Massachusetts Institute of Technology architect William Emerson to design a city planning curriculum for the university. His son, Frederick Adams, was nominated by Emerson to be the first department head of City Planning at the MIT and was named a \"Pioneer Planner\" by the American Institute of Certified Planners. Towards the end of his life, Adams served as a visiting lecturer in his son's new department. He took an active role in creating planning institutions in Great Britain, Canada and the United States.\n\n", "link_mentions": [{"page": "1940", "response": ["* March 24 – Thomas Adams, British urban planner (b. 1871)"]}, {"page": "1871", "response": ["** Thomas Adams, British urban planner (d. 1940)"]}, {"page": "Urban design", "response": ["In 1910, Thomas Adams became the first Town Planning Inspector at the Local Government Board and began meeting with practitioners. In 1914, The Town Planning Institute was established. The first urban planning course in America wasn't established until 1924 at Harvard University. Professionals developed schemes for the development of land, transforming town planning into a new area of expertise."]}, {"page": "Andrew R. Cobb", "response": ["* Corner Brook, Newfoundland - the largest commission of his career, he designed worker housing for the Newfoundland Pulp and Paper Company, which was constructing what was, up to that time, the largest project ever undertaken in the history of paper making. Many of the structures were inspired by the Arts and Crafts Movement. Townsite, as the development was known, contained over 175 houses and was laid out by Thomas Adams."]}, {"page": "Halifax Explosion", "response": ["The North End Halifax neighbourhood of Richmond bore the brunt of the explosion. In 1917, Richmond was considered a working-class neighbourhood and had few paved roads. After the explosion, the Halifax Relief Commission approached the reconstruction of Richmond as an opportunity to improve and modernize the city's North End. English town planner Thomas Adams and Montreal architectural firm Ross and Macdonald were recruited to design a new housing plan for Richmond. Adams, inspired by the Victorian garden city movement, aimed to provide public access to green spaces and to create a low-rise, low-density and multifunctional urban neighbourhood. The planners designed 326 large homes that each faced a tree-lined, paved boulevard. They specified that the homes be built with a new and innovative fireproof material, blocks of compressed cement called Hydrostone. The first of these homes was occupied by March 1919. Once finished, the Hydrostone neighbourhood consisted of homes, businesses and parks, which helped create a new sense of community in the North End of Halifax. It has now become an upscale neighbourhood and shopping district. In contrast, the equally poor and underdeveloped area of Africville was not included in reconstruction efforts."]}, {"page": "List of urban planners", "response": ["* 1924 Andrew R. Cobb and Thomas Adams – Corner Brook, Newfoundland"]}, {"page": "1917 in Canada", "response": ["International planning consultant advises against special programs to set up returning soldiers in agricultureThomas Adams, \"Chapter VIII; Returned Soldiers and Land Settlement\" Rural Planning and Development (1917), pgs. 207-17 Accessed 6 December 2019"]}, {"page": "Corner Brook", "response": ["The area was originally four distinct communities, each with unique commercial activities: Curling, with its fishery; Corner Brook West (also known as Humber West or Westside) with its retail businesses; Corner Brook East (also known as Humbermouth and the Heights) with its railway and industrial operations; and Townsite (known as Corner Brook) to house employees of the pulp and paper mill, laid out in 1923 by Thomas Adams using Garden City principles.Richard Symonds (2001), Architecture and Planning of the Corner Brook Townsite 1923-1925, Heritage Foundation of Newfoundland and Labrador In 1956, these four communities were amalgamated to form the present-day City of Corner Brook."]}, {"page": "1940 in architecture", "response": ["* March 24 – Thomas Adams, British urban planner (born 1871)"]}, {"page": "1871 in architecture", "response": ["* September 10 – Thomas Adams, British urban planner (died 1940)"]}, {"page": "Abitibi-Témiscamingue", "response": ["Noranda was also built according to that scheme, however, the other great example of an industrial town is Témiscaming. The Témiscaming Garden City plan, designed by Scottish architect Thomas Adams (1871–1940) is a rare example in Quebec of a mono-industrial city where a company planned and endeavoured to grant comfort of its workers. There, the dwellings, and even the plan, which follows the shape of the hill, was not alone to grant this comfort, elements as Italian renaissance fountain, landscaping were also included into the cityscape."]}, {"page": "Thomas Adams", "response": ["Thomas Adams may refer to:", "*Thomas Adams (MP), Member of Parliament for Bedford", "*Sir Thomas Adams, 1st Baronet (1586–1667/68), Lord Mayor of London", "*Thomas Adams (politician) (1730–1788), Virginia delegate to the Continental Congress", "*Thomas Adams (sheriff) (1804–1869), sheriff of Norfolk County, Massachusetts", "*Thomas Adams (British Army officer) (c. 1730–1764), British Army major, noted for his defense of the British position in Bengal in 1763", "*Sir Thomas Adams, 6th Baronet (1738–1770), naval officer", "*Thomas Adams (organist, born 1785) (1785–1858), English organist and composer", "*Thomas Adams (organist, born 1857) (1857–1918), English organist and composer", "*Thomas Adams (priest) (1583–1652), English priest and religious writer", "*Thomas Adams (publisher) (died 1620), English bookseller and publisher", "*Thomas Adams (writer) (c. 1633–1670), English religious writer", "*Thomas Adams (classicist) (1884–1953), New Zealand professor of classical languages and cricketer", "*Thomas Adams (manufacturer and philanthropist) (1807–1873), English Nottingham lace manufacturer and philanthropist", "*Thomas Adams (chewing gum maker) (1818–1905), American businessman", "*Thomas Adams (architect) (1871–1940), Scottish-born English pioneer of urban planning", "*Thomas Adams (basketball) (born 1980), American basketball player"]}, {"page": "Tom Adams (illustrator)", "response": ["Adams was born into a family of town and urban planners. His grandfather, Thomas Adams (1871–1940), was an influential urban planner, who served as an advisor to Herbert Hoover and Franklin D. Roosevelt and went on to found the Civic Improvement League in 1915 and the Town Planning Institution of Canada in 1919. Indeed, it is not an exaggeration to suggest that Thomas Adams was one of the principal founders of urban planning as a discipline. His two sons went on to make their mark in American and English town and urban planning. The younger son, Frederick Johnstone Adams, was a member of the faculty of MIT from 1932 to 1964, who helped to establish the Department of Urban Studies and Planning, serving as its first Head of Department from 1944 to 1957. Tom Adams's father, James W. Renwick Adams OBE (1898–1969), worked as a planner for the English county council of Kent. "]}, {"page": "Royal Town Planning Institute", "response": ["Following the Housing, Town Planning, &c. Act 1909, surveyors, civil engineers, architects, lawyers and others began working together within local government in the UK to draw up schemes for the development of land.  The idea of town planning as a new and distinctive area of expertise began to be formed.  In 1910, Thomas Adams was appointed as the first Town Planning Inspector at the Local Government Board, and began having meetings with practitioners.  In November 1913, a meeting was convened of interested professionals to establish a new Institute, and Adams was elected as the group's President.  The Town Planning Institute (TPI) was launched with an inaugural dinner in January 1914, and it was formally established on 4 September 1914 when its Articles of Association were signed. The first three of the Articles of Association were: RTPI.org.uk, About the RTPI.  Retrieved 17 January 2013", "A full list of Presidents is set out below. The first President, in 1914, was Thomas Adams. The first female President, in 1974, was Sylvia Law.", "*1914 Thomas Adams"]}]}}