{"wiki_id": "http://www.wikidata.org/entity/Q7781676", "itemLabel": "Theodore Alois Buckley", "itemDescription": "English classicist and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Alois_Buckley", "wikipedia_page": {"main": "Theodore Alois William Buckley (1825–1856) was a translator of Homer and other classical works.\nIn 1852 Buckley published the book \"The great cities of the ancient world in their glory and their desolation\". This book depicts stories, descriptions and legends surrounding the great ancient cities. The book has had many revisions and new editions, two of which were in the first year of publishing, one of which included illustrations. The third edition was published in 1855 and new editions followed in 1858, 1864, 1878 and 1896.  \nIn 1851 his literal prose translation of Homer's Odyssey, with explanatory notes, was published in Bohn's Classical Library series.  In 1873 he published a literal prose translation of the complete text of The Iliad, in which he included explanatory notes. \nHe was the son of William Richard Buckley of Paddington, London, Great Britain and matriculated from Christ Church, Oxford in 1845 (BA 1849, MA 1853).", "link_mentions": [{"page": "The Bacchae", "response": ["* Theodore Alois Buckley, 1850: prose"]}, {"page": "Prometheus Bound", "response": ["*Theodore Alois Buckley, 1849 — prose: full text"]}, {"page": "Medea (play)", "response": ["* Theodore Alois Buckley, 1892 – prose: full text"]}, {"page": "Ajax (play)", "response": ["* Theodore Alois Buckley, 1849.Buckley (1849, 239-285)."]}, {"page": "Francesco Sforza Pallavicino", "response": ["* Theodore Alois Buckley, History of the Council of Trent (London 1852), Preface; "]}, {"page": "The Suppliants (Aeschylus)", "response": ["*Theodore Alois Buckley, 1849 - prose: full text"]}, {"page": "List of translators into English", "response": ["*Theodore Alois Buckley"]}, {"page": "Theodore Buckley", "response": ["#REDIRECT Theodore Alois Buckley"]}, {"page": "Kenneth R. H. Mackenzie", "response": ["In 1851, when Mackenzie was just 18, his short introductory biography of Homer, a translation of a text by Herodotus, appeared in Theodore Alois Buckley’s The Odyssey of Homer, with the Hymns, Epigrams, and Battles of the Frogs and Mice. Literally Translated, with Explanatory Notes (London: Henry Bohn). At the beginning of the book, Buckley thanked Mackenzie for his Life of Homer: Attributed to Herodotus, writing, For the translation of the Pseudo-Herodotean Life of Homer, the reader is indebted to the industry of Kenneth Mackenzie, Esq. It is the earliest memoir of the supposed author of the Iliad we possess. (\"Care and an excellent education seconding the happy talents with which nature had endowed him, [he] soon surpassed his school fellows in every attainment,\" Mackenzie wrote of the young Homer. \"[W]hen older, he... taught in the school of Phemius, where every one applauded him.\")"]}, {"page": "Iliad", "response": ["** The Iliad of Homer, by Theodore Alois Buckley, at Project Gutenberg"]}, {"page": "Francis William Blagdon", "response": ["The proposals of the Whig ministry of 1806 on Catholic emancipation induced Blagdon to publish an edition of Foxe's Book of Martyrs; it appeared as An Universal History of Christian Martyrdom . . . originally composed by John Fox . . . and now entirely rewritten ... by the Rev. J. Milner, M. A. (London, 1807). The use of the pseudonym \"the Rev. J. Milner\" travestied the Roman Catholic priest John Milner. Again on the topic of Catholic emancipation, in 1810, and again pseudononymous,\"Catholic Emancipation discussed and exploded! An historical and political view of the Catholic religion ... In a series of letters to ... Lord Grenville from Albion\".Worldcat: London : F.W. Blagdon, 1810. Subsequent editions of Blagdon's work appeared in 1817, 1837, 1848, 1863, 1871, and in 1881; and in 1892 was published a version by Theodore Alois Buckley, described as \"abridged from Milner's edition\"."]}]}}