{"wiki_id": "http://www.wikidata.org/entity/Q7789907", "itemLabel": "Thomas Gambier Parry", "itemDescription": "British artist (1816-1888)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Gambier_Parry", "wikipedia_page": {"main": "Thomas Gambier Parry, J.P., D.L., (22 February 1816 – 28 September 1888) was a British artist and art collector. He is best remembered for his development of the Gambier Parry process of fresco painting, and for forming the significant collection of early Italian paintings and objects that his heirs gave to the Courtauld Institute of Art in London, where many are displayed in the Courtauld Gallery.\nThomas Gambier Parry is the father of composer Hubert Parry.", "link_mentions": [{"page": "Sidney Herbert, 1st Baron Herbert of Lea", "response": ["#Elizabeth Maud (1851–1933), who m. 1872 the composer, Sir Charles Hubert Parry, 1st Baronet (son of Thomas Gambier Parry), of Highnam Court, near Gloucester."]}, {"page": "Gambier Parry process", "response": ["The Gambier Parry process is a development of the classical technique of fresco for painting murals, named for Thomas Gambier Parry."]}, {"page": "List of Old Etonians born in the 19th century", "response": ["* Thomas Gambier Parry (1816–1888), English artist and art collector"]}, {"page": "Ely Cathedral", "response": ["A timber boarded ceiling was installed in the nave and painted with scenes from the Old and New Testaments, first by Henry Styleman Le Strange and then, after Le Strange's death in 1862, completed by Thomas Gambier Parry, who also repainted the interior of the octagon."]}, {"page": "Tree of Jesse", "response": ["The nave ceiling of Ely Cathedral was painted with a scheme rather similar to Hildesheim by the gentleman artist Henry Styleman Le Strange, who began in 1858. After his death (leaving no detailed drawings for the remainder) in 1862, it was completed by another amateur artist, Thomas Gambier Parry using his special Gambier Parry process with lavender oil."]}, {"page": "Courtauld Gallery", "response": ["In 1966 Mark Gambier-Parry, son of Major Ernest Gambier-Parry, bequeathed the diverse collection of art formed by his grandfather, Thomas Gambier Parry, which ranged from Early Italian Renaissance painting to majolica, medieval enamel and ivory carvings, and other types of art (see section below).", "Thomas Gambier Parry (1816–1888) was a keen and versatile collector for most of his adult life. Many of his purchases were made on trips to the continent, especially Italy, but he also bought from dealers and auctions in England, and sometimes sold items. "]}, {"page": "1888 in art", "response": ["* September 28 – Thomas Gambier Parry, artist and art collector (born 1816)"]}, {"page": "1816 in art", "response": ["*February 22 – Thomas Gambier Parry, English artist and art collector (died 1888)"]}, {"page": "Highnam", "response": ["The wealthy artist and collector Thomas Gambier Parry purchased the Highnam Court estate in 1837. He remodelled the Court and laid out the Highnam Court gardens; he was one of the first to make a  pinetum.DNB Highnam Court gardens are now open to the public.http://www.highnamcourt.co.uk/  His son, the composer Hubert Parry, learnt to play the organ in the church.", "The church of the Holy Innocents, Highnam was constructed between 1849 and 1851 at the request of Thomas Gambier Parry in memory of his first wife and those of his children who died at an early age. The church was designed by Henry Woodyer in a Gothic style."]}, {"page": "1816 in the United Kingdom", "response": ["* 22 February – Thomas Gambier Parry, fresco painter and art collector (died 1888)"]}, {"page": "Thomas Gambier-Parry", "response": ["#REDIRECT Thomas Gambier Parry"]}, {"page": "Thomas Parry", "response": ["* Thomas Gambier Parry (1816–1888), English artist and art collector"]}, {"page": "Elizabeth Herbert, Baroness Herbert of Lea", "response": ["# Elizabeth Maud, b. 30 July 1851; m. 25 June 1872 the composer, Sir Charles Hubert Parry, 1st Baronet (son of Thomas Gambier Parry), of Highnam Court, near Gloucester; and d. 28 February. 1933."]}, {"page": "Harvey Goodwin", "response": ["Goodwin was offered the colonial bishopric of Grahamstown in 1853, which he refused. In November 1858 he was appointed by Edward Smith-Stanley, 14th Earl of Derby to the deanery of Ely.The Clergy List, Clerical Guide and Ecclesiastical Directory. London: Hamilton & Co., 1889  In 1859 received from his university the degree Doctor of Divinity (DD), and the public orator William George Clark spoke of his work. On 11 December 1880 he was elected honorary fellow of Gonville and Caius, and in 1885 was created honorary Doctor of Civil Law (hon. DCL) of Oxford University. As Dean of Ely, Goodwin continued the work of the restoration of Ely Cathedral begun by George Peacock, under Robert Willis's guidance, and he saw completed the painting of the nave roof, which was executed in part by Henry L'Estrange Styleman Le Strange of Hunstanton, and, after his death in 1862, completed by his friend Thomas Gambier Parry. The lantern also was rebuilt, the nave pavement relaid, the Galilee entrance restored, and a warming apparatus placed for the first time in the cathedral. While at Ely he served on two royal commissions, those on clerical subscription and ritual."]}, {"page": "List of painters by name beginning with \"G\"", "response": ["*Thomas Gambier Parry (1816–1888), English painter and art collector"]}, {"page": "Charles Harford Lloyd", "response": ["A friend of his boyhood was Lady Jenkinson, who had been a pupil of Sigismond Thalberg.\"The Thalberg Scholarship\" (16 Aug 1873) The Musical Standard, Vol. 5, No. 472, p. 101, Reeves & Turner, London Lloyd met Frederick Ouseley and Thomas Gambier Parry at her house. The latter invited him to visit Highnam Court, where Lloyd first met his \"attached friend of after years\", Hubert Parry. They both stayed up till the small hours making music in the drawing room."]}, {"page": "Michael Gambier-Parry", "response": ["The Gambier-Parrys of Highnam Court, Gloucestershire were an artistic and military family (see Thomas Gambier Parry and the latter's son, eminent composer Sir Hubert Parry). His uncle Ernest Gambier-Parry was a major in the army sent to Egypt to avenge the death of General Gordon and wrote a book (Suakin, 1885) about his experiences.The Times, OBIT. 17 April 1936 Michael's father was architect Sidney Gambier-Parry."]}, {"page": "Henry Joy Fynes-Clinton", "response": ["Fynes-Clinton and his siblings were the children of Chares Henry Fynes-Clinton (1835–1915), Rector of Blandford Forum in Dorset (following an initial career as a civil engineer in London),See 1861 census return for 39 Bedford Square, London. C.H. Fynes-Clinton's engineering experience was deployed at Blandford Forum Parish Church, a Georgian building that was built with a small apse, but no proper chancel. In 1895, by the use of jacks and rollers, the apse was ingeniously moved from its original position to one some 30 feet further East on new foundations to provide space for the present chancel. See Blandford Forum Parish Church. and of Thomasina Gordon Shaw of Ballyoran, County Down (died 1929).  He was the grandson of Charles John Fynes-Clinton (1799–1872), Rector of Cromwell in Nottinghamshire.Uncharitably described as \"a narrow Evangelical fanatic\" by Charles Smyth (see reference below). See St Giles’ Church Cromwell, Fellows of the Royal Geographical Society and Subscribers to the Protestant Association His great grandfather was Charles Fynes-Clinton (1748–1827),Church and Parish - Studies in Church Problems, illustrated from the Parochial History of St Margaret's Westminster, Smyth, C., p. 128: SPCK, 1955.  This publication provides a full account of the riot that ensued at St Margaret's Westminster in December 1820, reported in The Times of 11 December 1820, when Fynes-Clinton banned an Evangelical lecturer from the pulpit.  The subsequent legal case, Clinton v Hatchard (1822), which Fynes-Clinton won, became a leading case in English ecclesiastical law; as was the case taken by his great grandson: Rector and Churchwardens of St Magnus the Martyr v. All having interest (1925).  Moreover, his obituary speaks of the affection in which he was generally held: \"The charity and goodwill of that religion, of which he was a minister, were not to be mistaken.  The poor of Westminster will remember the hand that liberally ministered to their wants; and the love of peace and harmony, which guided his actions and threw their grace upon his demeanour, will not soon be forgotten.\" (The Gentleman's magazine, Volume 142 Part II, 1827, p.570) \"a 'high and dry' divine of the old school\" - after whom Fynes Street in Westminster was named - Old and new London : a narrative of its history, its people, and its places by Walter Thornbury, 1873 who was Canon and Sub Dean of Westminster and Rector of St Margaret's Westminster and of Cromwell, and a descendant of Sir Henry Clinton (1587–1641), the son of the 2nd Earl of Lincoln by his second wife.Blazon (description) of the family's arms, as used by Fynes-Clinton on his bookplate: argent, six crosses crosslet fitchée sable; on a chief azure, two mullets pierced or; a mullet pierced or for difference H.J. Fynes-Clinton was therefore a cousin of Henry Pelham-Clinton, 7th Duke of Newcastle-under-Lyne (1864–1928), another staunch Anglo-Catholic, and of the Duke's sister, Lady Emily Augusta Mary Pelham-Clinton (1863–1919; wife of the Prince Alfonso Doria Pamphilj of the Palazzo Doria Pamphilj, which now houses the Anglican Centre in Rome). His grandfather's two brothers served as Members of Parliament for Aldborough, a seat under the control of the Duke of Newcastle-under-Lyne.See Politics of the 4th Duke of Newcastle One was the classical scholar and chronologist Henry Fynes-Clinton (1781–1852).See History of Parliament, Literary Remains and Lives of the Founders of the British Museum by Edward Edwards, p.533-4, 1870 British Museum for different aspects of his career.  He was son-in-law of Bishop Henry Majendie and father-in-law of Thomas Gambier Parry (a Tractarian and prominent member of the Cambridge Camden Society) and grandfather of Sir Hubert Parry The other was Clinton James Fynes-Clinton (later Fiennes-Clinton; 1792–1833), a barrister and prominent Ultra-Tory,See History of Parliament and Second Reading of the Reform Bill - 4 July 1831. \"Mr Fynes Clinton's speech in favour of the amendment was, take it as a whole, the best delivered on his side of the question.\" (The New Parliament - The Reform Bill in The New Monthly Magazine and Literary Journal, 1831, Part II, p.120, London). Commenting on the Oxford University by election of 1829 at which Inglis defeated Peel, Greville commented (22 February 1829) that \"Inglis's committee ... is composed of men not much better than old women, except Fynes Clinton, the chairman\"."]}, {"page": "List of works by Lewis Vulliamy on large houses", "response": ["|A house dating from the 17th century, altered for Thomas Gambier Parry."]}, {"page": "Berkeley Guise", "response": ["He died unmarried in 1834. He was succeeded by his younger brother, General Sir John Wright Guise, 3rd Baronet (1777–1865), GCB. Highnam Court was sold to Thomas Gambier Parry."]}, {"page": "Ernest Gambier-Parry", "response": ["Major Ernest Gambier-Parry  (25 October 1853 – 15 April 1936) was a British military officer who participated in an expedition to the Sudan to avenge the grisly death of a renowned general in 1885. However, the wounds he sustained in that campaign ended his military career. Gambier-Parry was also known for his work as an author, musician, and artist. He succeeded to the manor at Highnam Court following the death of his half-brother Sir Hubert Parry. In addition, he preserved and archived the art collection that had been amassed by his father Thomas Gambier Parry; the masterpieces were eventually bequeathed to the Courtauld Institute of Art."]}, {"page": "Parry (surname)", "response": ["*Thomas Gambier Parry (1816–1888), British artist and art collector"]}, {"page": "Quy Hall", "response": ["In the 1870s the house was completely remodelled by William White and what is believed to be decorator Thomas Gambier Parry, who decorated and painted the drawing room, dining room and library. Gambier Parry was staying in the vicinity during his work on Ely Cathedral. 18th century doors remain on the dining room. Both of the staircases and fireplaces were designed by White."]}, {"page": "Gomionica Monastery", "response": ["After the war, Gomionica became a female monastery. In 1953, it was designated as a cultural monument of Yugoslavia, and in 2006, it was proclaimed a National Monument of Bosnia and Herzegovina. The treasury of Gomionica contains icons created in the 16th to 19th centuries, as well as manuscripts and printed books created in the 14th to 17th centuries. A silver-gilt cross formerly owned by the monastery, made in 1640, is now in the collection of the University of London, which acquired it from the private collection of Thomas Gambier Parry."]}, {"page": "Longford, Gloucestershire", "response": ["In 1866 a free hospital for children of the poor was begun next to St. Lucy's Home of Charity on the site of the current Gambier Parry Gardens. The home, a converted villa east of the Tewkesbury Road, was occupied by the sisters of St. Lucy, an Anglican community founded in 1864 by Thomas Gambier Parry of Highnam to train nurses and tend the sick in their homes. By 1866 the sisters, who were sent to many parts of the country, nursed some patients in the home. Gambier Parry also conceived the idea for the children's hospital in connection with the home and paid much of the building costs. The hospital, a brick building designed by William Jacques, opened in 1867 with 22 beds. Children of the poor from any distance were admitted and out-patients were treated at a house in Bell Lane. The hospital was supported by subscriptions and donations. In 1872 the sisters of St. John the Baptist from Clewer, Berkshire, took over the work of the sisters of St. Lucy. In 1876, Gambier Parry moved the home to a large house at the corner of Hare Lane and Pitt Street."]}, {"page": "All Saints' Church, Oakleigh Park", "response": ["The church was built in around 1883 to an Early English Gothic Revival design by the architect Joseph Clarke.  The body of the church consists of a nave with north and south aisles and an apsidal chancel, and there is a tower with a spire at the  north-west corner. The building is faced in flint with ashlar dressings. The interior  has murals by Thomas Gambier Parry."]}, {"page": "Henry L'Estrange Styleman Le Strange", "response": ["In 1860 Styleman le Strange was invited to co-operate with William Butterfield the architect, in the decoration of St Alban's Church, Holborn, and took two years over the design work. After his death, the roof in Ely Cathedral was completed by Thomas Gambier Parry, and the designs for St Alban's were carried out by Frederick Preedy, a cousin."]}, {"page": "William Christmas Codman", "response": ["Codman was born in Norfolk, England, where he studied painting and drawing. He began his career at Ely Cathedral, working under Thomas Gambier Parry during the cathedral’s restoration from 1858-1862. He then worked as a designer for abbeys and cathedrals, probably for Sir Gilbert Scott, in the Gothic Revival style. His church designs included communion plate for the See of Liverpool and the Memorial Chapel in Delhi, India; candelabra for St. Paul's in London; and lighting fixtures for the Notre-Dame Cathedral, Luxembourg. He subsequently worked for the Birmingham firm of Elkington & Co., and the London silversmithing company Cox and Son, then from 1884-1887 supervised the construction of furniture designed by the English painter Sir Lawrence Alma-Tadema for Messrs. Johnstone, Norman & Company of London. Codman married Emma Rolle in 1865; they had six children."]}]}}