{"wiki_id": "http://www.wikidata.org/entity/Q7787039", "itemLabel": "Thomas Allsop", "itemDescription": "English author", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Allsop", "wikipedia_page": {"main": "Thomas Allsop (10 April 1795 – 12 April 1880) was an English stockbroker and author. Allsop is commonly described as the favourite disciple of Samuel Taylor Coleridge. He also took part in violent radical politics.", "link_mentions": [{"page": "Walter Scott", "response": ["Scott is fascinated by striking moments of transition between stages in societies. Coleridge, in a discussion of his early novels, found that they derive their \"long-sustained interest\" from \"the contest between the two great moving Principles of social Humanity – religious adherence to the Past and the Ancient, the Desire & the admiration of Permanence, on the one hand; and the Passion for increase of Knowledge, for Truth as the offspring of Reason, in short, the mighty Instincts of Progression and Free-agency, on the other.\"Collected Letters of Samuel Taylor Coleridge, ed. Earl Leslie Griggs, 6 vols (Oxford, 1956‒71), 5.34‒35: Coleridge to Thomas Allsop, 8 April 1820. This is clear, for example, in Waverley, as the hero is captivated by the romantic allure of the Jacobite cause embodied in Bonnie Prince Charlie and his followers before accepting that the time for such enthusiasms has passed and accepting the more rational, humdrum reality of Hanoverian Britain. Another example appears in 15th-century Europe in the yielding of the old chivalric world view of Charles Duke of Burgundy to the Machiavellian pragmatism of Louis XI. Scott is intrigued by the way different stages of societal development can exist side by side in one country. When Waverley has his first experience of Highland ways after a raid on his Lowland host's cattle, it \"seemed like a dream... that these deeds of violence should be familiar to men's minds, and currently talked of, as falling with the common order of things, and happening daily in the immediate neighbourhood, without his having crossed the seas, and while he was yet in the otherwise well-ordered island of Great Britain.\"Walter Scott, 2007. Waverley, ed. P. D. Garside. Edinburgh University Press. Ch. 16, p. 78.  A more complex version of this comes in Scott's second novel, Guy Mannering (1815), which \"set in 1781‒2, offers no simple opposition: the Scotland represented in the novel is at once backward and advanced, traditional and modern – it is a country in varied stages of progression in which there are many social subsets, each with its own laws and customs.\""]}, {"page": "Alsop", "response": ["*Thomas Allsop (1795–1880), English stockbroker and author", "*Thomas Allsopp (1880–1919), English cricketer and footballer"]}, {"page": "Charles Augustus Tulk", "response": ["Tulk corresponded with Johann Caspar Spurzheim. His interest in phrenology led him to act as President for the London Phrenological Society in the 1820s and 1830s.Roger Cooter, The Cultural Meaning of Popular Science: phrenology and the organization of consent in nineteenth-century Britain (1984), p. 315 note 7. He also associated with Samuel Taylor Coleridge, whom he met at Littlehampton in 1817;Richard Holmes, Coleridge: Darker Reflections (1998), p. 459.Stephen McNeilly (editor), In Search of the Absolute: essays on Swedenborg and literature (2004), p. 1; Google Books. Tulk was one of the recognised group of close disciples, with Thomas Allsop, Henry Francis Cary, John Hookham Frere and Joseph Henry Green.Holmes, p. 488. Coleridge's letters to Tulk are a source for his developed thoughts on a system of nature.Trevor H. Levere, Poetry Realized in Nature: Samuel Taylor Coleridge and Early Nineteenth-Century Science (2002), p. 98; Google Books. In 1818 Tulk involved Coleridge in his political agitation, leading up to the Cotton Mills, etc. Act 1819; Tulk offered funding for a pamphlet, and Coleridge wrote several.Holmes, pp. 474–7."]}, {"page": "Orsini affair", "response": ["Orsini's plot involved other radicals. He learned about the chemistry of explosives from William Mattieu Williams, whom he met in 1857. More centrally involved were Thomas Allsop and George Jacob Holyoake. Thomas Durell Powell Hodge, a disciple of Orsini to whom he entrusted the care of one of his children, was also implicated, as was Simon François Bernard, an expatriate French surgeon and socialist."]}, {"page": "Letters of Charles Lamb", "response": ["Lamb's main correspondents were the poets William Wordsworth, Samuel Taylor Coleridge, Robert Southey, Thomas Hood, Bernard Barton, Mary Matilda Betham and Bryan Procter; the philosopher and novelist William Godwin; the music critic William Ayrton; the publishers Edward Moxon, William Hone, Charles Ollier, Charles Cowden Clarke and J. A. Hessey; the statistician John Rickman; the actress Fanny Kelly; the political agitator Thomas Allsop; the Sinologist Thomas Manning; the lawyer Henry Crabb Robinson; also John Bates Dibdin, member of a theatrical family, and Robert Lloyd from a literary Quaker family. The surviving letters extend over a period of nearly 40 years, beginning in May 1796 and ending only a few days before his death in December 1834. In the first sequence of 30 letters written to Coleridge he minutely criticises his friend's poems, advising him to abandon conventional poetic diction and \"cultivate simplicity\". The influence he exercised on his friend is seen as crucial in preparing Coleridge for the Romantic revolution that he and Wordsworth launched two years later in their Lyrical Ballads. Almost from the beginning the letters show Lamb's sense of duty to his family and friends, but after a few years, without abandoning his moral convictions, Lamb found a lighter means of expression. In an 1801 letter he wrote, \"I have had a time of seriousness, and I have known the importance and reality of a religious belief. Latterly, I acknowledge, much of my seriousness has gone off…but I still retain at bottom a conviction of the truth, and a certainty of the usefulness of religion.\" In the later letters it is often possible to see Lamb forming and developing the ideas that he later presented in fully matured form in the Essays of Elia and other magazine pieces, and in this way they proved to be essential to his career as a published writer."]}, {"page": "Allsop, Thomas", "response": ["#redirectThomas Allsop"]}]}}