{"wiki_id": "http://www.wikidata.org/entity/Q7790561", "itemLabel": "Thomas Hedderwick", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Hedderwick", "wikipedia_page": {"main": "Thomas Charles Hunter Hedderwick (1850 –  6 February 1918) was a Liberal Party politician in Scotland who served as the Member of Parliament (MP) for Wick Burghs from 1896 to 1900.", "link_mentions": [{"page": "Imperial Federation", "response": ["In 1900, Thomas Hedderwick, a Scottish Liberal Party MP, raised the issue in the British House of Commons. Recalling to the House the contributions of Dadabhai Naoroji and Mancherjee Bhownagree, Indian MPs serving in the House of Commons, Hedderwick mooted the possibility that an autonomous India might one day be represented in an Imperial Parliament.Smith, 1921."]}, {"page": "Frederick Coleridge Mackarness", "response": ["In 1909, Mackarness told his constituency Liberal Association that “for private reasons” he did not intend to fight the next election.The Times, 3 July 1909 p12 The seat reverted to the Conservatives by a wide margin, William Arthur Mount recording a majority of 2,358 over the new Liberal candidate, Thomas Hedderwick the former MP for Wick Burghs.F W S Craig, British Parliamentary Election Results 1885–1918;Macmillan, 1974 p521"]}, {"page": "Wick Burghs (UK Parliament constituency)", "response": ["| Thomas Hedderwick"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["* 2 June: Wick Burghs - Thomas Hedderwick, Liberal, replacing Sir John Pender"]}, {"page": "Arthur Bignold", "response": ["Bignold was educated at Trinity College, Cambridge. In 1873 he was a founding member of The Kennel Club. He won his seat in the House of Commons at the 1900 general election, when he defeated the sitting Liberal Party MP Thomas Hedderwick. Bignold was re-elected in 1906, but lost his seat at the January 1910 general election. He stood again in December 1910, but lost again."]}, {"page": "Thomas Charles Hunter Hedderwick", "response": ["#REDIRECT Thomas Hedderwick "]}, {"page": "John Lawson Walton", "response": ["In 1882 at Glasgow Cathedral he married Joanna Hedderwick,The Times, 25 August 1882 p. 1 the daughter of Robert Hedderwick who founded the newspaper the Glasgow Citizen who was the son of Thomas Hedderwick, Liberal MP for Wick Burghs from 1896–1900. They had three sons and two daughters."]}, {"page": "Hedderwick, Thomas", "response": ["#redirectThomas Hedderwick"]}, {"page": "Hedderwick", "response": ["* Thomas Hedderwick (1850–1918), Scottish politician"]}]}}