{"wiki_id": "http://www.wikidata.org/entity/Q7794439", "itemLabel": "Thomas Thompson", "itemDescription": "English cricketer (born 1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Thompson_(cricketer)", "wikipedia_page": {"main": "Thomas Thompson (born 24 February 1938) is a former English cricketer. Thompson was a right-handed batsman who bowled right-arm off break. He was born at Workington, Cumberland.\nThompson made his debut for Cumberland in the 1955 Minor Counties Championship against Durham. Between 1955 and 1961, he made 32 Minor Counties Championship appearances for Cumberland. He joined Leicestershire for the 1963 season, making his first-class debut against Derbyshire at Grace Road in the 1963 County Championship. He made a further first-class appearance in that season against Nottinghamshire, before making seven further appearances in the 1964 County Championship, the last of which came against Essex. A bowler, Thompson took 17 wickets in his nine first-class matches for Leicestershire, which came at an average of 29.23, with best figures of 3/53. A tailend batsman, he scored 43 runs at a batting average of 4.77, with a high score of 12. He returned to playing minor counties cricket for Cumberland in 1967, making a further 46 Minor Counties Championship appearances, the last of which came against the Lancashire Second XI.", "link_mentions": [{"page": "Thomas Thompson", "response": ["* Thomas Thompson (1754–1828), Hull banker, British MP for Midhurst, Weslyan, father of Thomas Perronet Thompson", "* Thomas Thompson (New Zealand politician) (1832–1919), New Zealand politician", "* Thomas Thompson (Australian politician) (1867–1947), Australian politician", "* Thomas Thompson (footballer) (1879–1939), English footballer for Small Heath", "* Thomas Thompson (cricketer) (born 1934), English cricketer", "* Thomas Thompson (Master of Christ's College, Cambridge) (died 1540), Master of Christ's 1508–1517", "* Thomas Thompson (herald) (died 1641), Rouge Dragon Pursuivant in the reign of James VI and I", "* Sir Thomas Thompson, 1st Baronet (1766–1828), Royal Navy admiral", "* Thomas Thompson (songwriter) (1773–1816), Tyneside poet", "* Thomas Thompson (businessman) (1797-1869), American businessman and art collector", "* Thomas Thompson (writer) (1880-1951), Lancashire author and broadcaster (1880-1951)", "* Thomas Thompson (American author) (1933–1982), American journalist and author"]}]}}