{"wiki_id": "http://www.wikidata.org/entity/Q7795699", "itemLabel": "Thompson Capper", "itemDescription": "British First World War general", "wikipedia_url": "https://en.wikipedia.org/wiki/Thompson_Capper", "wikipedia_page": {"main": "Major General Sir Thompson Capper,  (20 October 1863 – 27 September 1915) was a highly decorated and senior British Army officer who served with distinction in the Second Boer War and was a divisional commander during the First World War. At the Battle of Loos in 1915, Capper was shot by a sniper as he reconnoitred the front line during an assault by his division on German positions. He died the next day in a casualty clearing station from wounds to both lungs; his grave is in the nearby Lillers Communal Cemetery.\nCapper was an active and vigorous soldier who had been wounded just six months before his death in an accidental grenade detonation. Shortly before this wound he had been knighted by King George V for his service in command of his division during the First Battle of Ypres. Field Marshal Sir John French commented upon his death that \"he was a most distinguished and capable leader and his death will be severely felt.\" He was also a keen military historian and his collected papers are currently stored at the Liddell Hart Centre for Military Archives at King's College London.", "link_mentions": [{"page": "7th Infantry Division (United Kingdom)", "response": ["The 7th Division fought in most of the major battles on the Western Front through to 1917 before being sent to the Italian Front for the remainder of the war. At the battle of Loos in late 1915, the division’s General Officer Commanding (GOC), Major-General Thompson Capper, was killed in action at the height of the fighting. Unlike the first six regular divisions of the British Expeditionary Force (BEF), a third of whose strength was made up of regular reservists, the 7th Division was originally composed entirely of serving regular soldiers, which gave rise to the division's nickname, ‘The Immortal Seventh’.", "* 1914–1915 Major-General Thompson Capper", "* Jul 1915 – Sep 1915 Major-General Sir Thompson Capper"]}, {"page": "Hubert Gough", "response": ["Gough was appointed an Instructor at Staff College on 1 January 1904 and served until 1906. He served under Henry Rawlinson as commandant, while the other instructors included his future colleagues Richard Haking, John du Cane, Thompson Capper and Launcelot Kiggell. At Staff College he was the first instructor to win the College point-to-point.Farrar-Hockley 1974, p. 74", "Gough was appointed GOC of the 7th Division on 18 April 1915, after its previous commander, Thompson Capper, had been wounded.Beckett & Corvi 2006, pp. 76, 77 The division was part of Rawlinson's IV Corps, itself part of Haig's First Army; on giving him his new appointment, Haig informed him (Haig diary 18 April 1915) about how Rawlinson had attempted to have Joey Davies sacked from command of 8th Division after Neuve Chapelle and how Davies and his staff did not trust Rawlinson.Sheffield 2005, p. 116 Gough may have been appointed as a counterbalance to Rawlinson, with whom Haig had a wary relationship.Sheffield & Todman 2004, p. 77 Gough and his division were in reserve at Second Ypres (22 April).Farrar-Hockley 1974, p. 153"]}, {"page": "Capper", "response": ["*Thompson Capper (1863–1915), senior British Army officer"]}, {"page": "13th Infantry Brigade (United Kingdom)", "response": ["* Brigadier-General Thompson Capper: February 1911-February 1914"]}, {"page": "John Capper", "response": ["As a brigadier-general, Capper was first made deputy inspector of the lines of communication before being given the post of Chief Engineer to the Third Corps. In July 1915 he was promoted to major-general and made chief engineer of the British Third Army. In October, following the deaths of several senior officers at the Battle of Loos, including Capper's younger brother Major-General Sir Thompson Capper, he was promoted to overall command of the 24th Division. Capper remained in command of the division for the next 18 months, including periods of heavy fighting at the Battle of the Somme, in which his son John was killed in action serving with the Royal Artillery. The division also spent extensive periods of time in other sections of the line and gained extensive battle experience at the cost of high casualties. As a reward for his service in command of the division, he was presented with the Commander's Cross of the Légion d'honneur by the French government."]}, {"page": "Frederick Wing", "response": ["Later in 1915, Wing took overall command of the newly raised New Army 12th (Eastern) Division. In the September 1915 Battle of Loos, generals George Thesiger and Thompson Capper were killed, and less than a week later, on 2 October 1915, a shell exploded in the road outside the 12th Division's forward report centre at Mazingarbe and killed Wing and his aide-de-camp Lieutenant Tower outright at 3:45pm. Both were buried in the nearby Noeux-les-Mines Communal Cemetery which is now maintained by the Commonwealth War Graves Commission.Wing, Frederick Drummond Vincent, Commonwealth War Graves Commission, Retrieved 5 July 2008"]}, {"page": "First Battle of Ypres order of battle", "response": ["7th Division (Thompson Capper)"]}, {"page": "William Capper", "response": ["He had three brothers all who served in the Army, one was Major-General Sir Thompson Capper KCMG, CB, DSO who was killed in World War I,Godden Green War Memorial and another was Major-General Sir John Edward Capper.Sir John Edward Capper, Oxford Dictionary of National Biography, retrieved 11 August 2007 (subscription needed)"]}, {"page": "Herbert Watts", "response": ["Shortly after Watts' retirement, the outbreak of the First World War meant that he returned almost immediately to the Army. He was given command of 21st Brigade in 7th Division;Kennedy, p. 11 the division was composed of regular battalions recalled from overseas service on the outbreak of war and formed into a new division in England. Watts remained with the brigade until the Battle of Loos in September 1915, when Major-General Thompson Capper, commanding the division, was killed in action and Watts took over command. With the brief exception of a few days in July 1916 as General Officer Commanding 38th (Welsh) Division - under Watts, the division took its objective, Mametz Wood, though with severe losses - Watts would remain with the division for the next year and a half. He later became General Officer Commanding the XIX Corps.Farr, p. 106"]}, {"page": "September 1915", "response": ["* Died: Thompson Capper, British army officer, commander of the 7th Infantry Division during World War I, recipient of the Distinguished Service Order, Order of the Bath, and Order of St Michael and St George (died from wounds sustained during the Battle of Loos) (b. 1863); Richard Garnons Williams, Welsh army officer and rugby player, member of the first Welsh national rugby team in 1881, commanding officer of the Royal Fusiliers in 1885 and 1914 (killed in the Battle of Loos) (b. 1856); Harry Minto, Superintendent of the Oregon State Penitentiary (shot by escaped inmate) (b. 1864); George Thesiger, British army officer, recipient of the Order of St Michael and St George and the Order of the Bath, killed at the Battle of Loos (b. 1868)"]}, {"page": "1910 Birthday Honours", "response": ["*Colonel (temporary Brigadier-General) Thompson Capper, D.S.O., Commandant, Staff College, India."]}, {"page": "Reginald Hoskins", "response": ["After passing out of Camberley in 1905 he served as a staff officer in Egypt and at the Staff College. In August 1913 he returned to East Africa as inspector of the Kings African Rifles. In September 1914 Hoskins was recalled from East Africa and was appointed assistant adjutant and quartermaster general of the 8th Division, engaged at the time on the Western Front. On 12 November 1914 he became chief of staff to Major-General Sir Thompson Capper. On 25 March 1915 Hoskins was promoted brigadier-general and given command of the 8th Brigade. In early 1916 he was transferred to the East African Campaign as commander of the 1st East African Division. In the 1916 Birthday Honours Hoskins was made a Companion of the Order of St Michael and St George."]}, {"page": "List of people educated at Haileybury and Imperial Service College", "response": ["* Major General Sir Thompson Capper"]}]}}