{"wiki_id": "http://www.wikidata.org/entity/Q7791869", "itemLabel": "Thomas Lipson", "itemDescription": "British Royal Navy officer (1784-1863)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Lipson", "wikipedia_page": {"main": "Captain Thomas Lipson (ca.1784 – 25 October 1863) was an officer in the Royal Navy, who, after a successful if unspectacular career in the Royal Navy, was appointed by the Admiralty as the first Harbour Master at South Australia, arriving there with the pioneer settlers. Serving from 1836 to 1855, based at Port Adelaide, Lipson also superintended many of the initial maritime surveys of that new colony.\nHe was born in Dartmouth, England. In 1793, at the age of 9 or 10, joined the Royal Navy as a first-class volunteer on Windsor Castle under Captain Sir Thomas Byard. In 1797, he served under Byard on Bedford, at the Battle of Camperdown.", "link_mentions": [{"page": "Port Lincoln", "response": ["After assessing a number of other potential locations, Light was ordered by England to consider Port Lincoln as a possible site for the capital.  While Thomas Lipson had arrived in Port Lincoln earlier and approved of its 'beautiful harbour' and 'fertile land', Light was unconvinced from the beginning as he faced fierce westerly gales, ill-placed islands and rocky reefs on arrival."]}, {"page": "Charles Kingston", "response": ["Kingston's mother died in 1851 at the age of 27, after which he and his siblings were probably raised by servants as their father was heavily involved in business and political activities. In 1856 he married Emma Berry, the widowed daughter of harbourmaster Thomas Lipson, but had no further children. Kingston formed a close bond with his older brother Strickland. At an early age he was sent to the Adelaide Educational Institution run by John Lorenzo Young, where he regularly won awards and had a talent for mathematics. His schoolmate Joseph Verco later recalled him as \"distinctly rough in manner and rather disposed to bully those younger and smaller than himself [...] very disposed to mischief, practical and horse-play\". He left the school at the end of 1867 and decided to study law, beginning his articles of clerkship in March 1868 with future attorney-general Samuel Way."]}, {"page": "Port River", "response": ["The river was officially \"discovered\" in 1834 by Captain John Jones, after an 1831 sighting by Captain Collet Barker. The initial landing place in Adelaide, chosen by Colonel William Light in late November 1836, was south of the current port and is now part of West Lakes. It  had such poor conditions that for many years it was also known as \"Port Misery\", later becoming known as the Old Port. In 1837 a harbour was declared when harbourmaster Captain Thomas Lipson took up residence on the shore of the then named port creek with the first migrants landing in the same year, onto the river bank lined with mangroves, until a canal was cut through them to a higher location in the sand dunes. A wharf was built at what is now is now the corner of the Old Port Road and Frederick Road, at Royal Park/Queenstown."]}, {"page": "Port Adelaide", "response": ["The effective foundation day of Port Adelaide was 6 January 1837. On this day the first harbourmaster, Captain Thomas Lipson (Royal Navy), took up residence with his family on the edge of Port Creek. The new port was used for shipping later that month, and passengers began disembarking the next. At this point the site was known as The Port Creek Settlement.Parsons (1997), pp.11–13."]}, {"page": "George Strickland Kingston", "response": ["Kingston married three times, being widowed in his first two marriages. He married his first wife Henrietta Ann McDonough in 1829; she died ten years later and their only child died soon after childbirth. Six children were born to his second wife, Ludovina Catherina da Silva Cameron (daughter of soldier Charles Cameron (1779–1827)), after their marriage on 10 April 1841. She died ten years later and Kingston married widow Emma Lipson (1816–1876), daughter of Thomas Lipson R.N., South Australia's first harbourmaster, on 4 December 1856 (no children resulted from this marriage)."]}, {"page": "Arthur Blyth", "response": ["*(John) James Neville Blyth (20 November 1850 – ), married Elizabeth Emma Hawker (daughter of James Collins Hawker and granddaughter of Thomas Lipson) on 11 June 1873. In 1885 he was jailed for a year for passing valueless cheques. The couple divorced in 1908."]}, {"page": "Lipson (disambiguation)", "response": ["* Thomas Lipson (ca.1784-1863), Royal Navy officer and South Australian government official"]}, {"page": "George Charles Hawker", "response": ["*Thomas Lipson Hawker (1863 – 21 October 1933) married Isabella Male ( – 1956)"]}, {"page": "Lipson, South Australia", "response": ["The township was named after Thomas Lipson, a naval officer born in 1783, who came to South Australia in 1836 and was appointed collector of customs and harbour master at Port Adelaide. Lipson was once a well established town, having a number of facilities including a post office, church, shop and a school. The school opened in 1881 as Yaranyacka school and closed in 1950."]}, {"page": "Thomas Gilbert (pioneer)", "response": ["Thomas Gilbert retired as Colonial Storekeeper on 31 December 1854. He was replaced by John Vidal James (1820–97), son-in-law of Sir James Hurtle Fisher. Along with Thomas Lipson, the government granted him a lifetime pension."]}, {"page": "John Barton Hack", "response": ["Hack was born in Chichester, England to Stephen Hack, a banker, and the educational writer Maria Hack (née Barton), sister of the poet Bernard Barton. He was educated at Southgate, Middlesex before going into the leather trade, building up a business in Sussex. On 9 July 1827, Hack married Bridget Watson (born 27 September 1806), daughter of William Watson of Hardshaw, Lancashire. After an illness which affected his lungs, he was advised to move to a warmer climate. While in Portsmouth he met Captain Thomas Lipson, who was fitting out the \"Buffalo\" for its pioneering voyage to South Australia. This new colony captured his imagination. He read Robert Torrens's book The Colonization of South Australia and met with Edward Gibbon Wakefield and some members of the South Australian Company and was so convinced of the colony's future that he sold up his considerable business interests and purchased three 134-acre sections with their three accompanying town acres. In September 1836 he embarked with his wife, six children and younger brother Stephen (who was to become an explorer of some noteMr. Hack's Exploring Expedition South Australian Register 27 October 1857 p.3 accessed 7 September 2011 and father of Wilton Hack), on the Isabella, commanded by Captain Hart for the owner Griffiths of Launceston, Van Diemen's Land. A surprise last-minute addition to the passenger list was Sir John Jeffcott, who had been appointed Chief Justice of South Australia, and was \"slipping away\" surreptitiously to avoid creditors. The Isabella's first stop in Australia was Launceston, where he spent a month purchasing livestock and equipment, which were loaded on the Isabella for shipping to South Australia.Street Corner History: Barton Terrace Register News-Pictorial 19 September 1929 p.5 accessed 7 September 2011 His purchases included nearly 400 sheep, six cows and a bull, ten bullocks, a large wagon and a dray, three horses and a Timor pony. Another livestock importer from Launceston aboard the Isabella was Henry Jones (1799-1889), son of a prosperous London oil merchant, and, like Hack, an influential colonist.Yelland, E.M., Henry Jones, Esq., J.P. (1799-1889), South Australian pastoralist and pioneer, Pioneers Assoc. of S.A. pamphlet, 1969."]}, {"page": "Henry Inman (police officer)", "response": ["On 19 January 1839 Henry Inman married Mary Fooks Lipson (1820–1898) at Holy Trinity Church, Adelaide. Mary was the daughter of Captain Thomas Lipson RN (1783–1863) and Elizabeth Emma Fooks (1790–1880), and was born at Rennes, Ille-et-Vilaine, Bretagne (Brittany), France, on 27 March 1820, while her father was on half-pay from the British Royal Navy. Her father had previously been commander of the Revenue cutter HMS Lapwing stationed at Mill Bay, Plymouth, Devon. In South Australia Thomas Lipson was prominently associated with the foundation of the marine affairs as first Harbourmaster and Collector of Customs.  Through the marriage of other Lipson sisters, Inman later became brother in law to John Allan, George Strickland Kingston, and James Collins Hawker, though he had close association with Allan and Hawker only. Allan was brother in law to John Baker (Australian politician)."]}, {"page": "Frank Potts (winemaker)", "response": ["Frank joined the Navy at the age of 9, serving on  for three years,  for six years. He then worked as a carpenter and ship's chandler until deciding to emigrate to South Australia. He was one of the original settlers of South Australia, arriving with Governor Hindmarsh on  in 1836. He had carpentry skills and a set of tools, so was much in demand constructing the first houses. He next worked under Thomas Lipson, the first harbourmaster, as one of five crewing the pilot boat Mary Ann under Hugh Quinn. He bought land at nearby Albert Town and built a cottage there, which also became his father's last residence. On the property transfer document Frank described his occupation as \"carpenter\" so that may have been his trade in the Navy."]}, {"page": "Lipson Cove", "response": ["The name Lipson Cove was given in 1840 by Governor George Gawler after Thomas Lipson R.N., who was South Australia's first harbor master and collector of customs."]}, {"page": "Cape Hardy", "response": ["The first land-based exploration by Europeans was in April 1840, at which time the cape was named after Alfred Hardy, then being the aide-de-camp to Governor George Gawler. Gawler was leading an expedition along this coast accompanied by explorer John Hill and Deputy Surveyor General Thomas Burr. The vice-regal party was supported at sea by the brig Porter and the government cutter , both under the command of Thomas Lipson. "]}, {"page": "Williams Island (South Australia)", "response": ["The island was first sighted by Europeans on 20 February 1802 from HMS Investigator whilst under the command of Matthew Flinders and was named on that day after seaman Robert Williams. Williams subsequently lost his life, presumably drowned, along with seven other members of the crew on 21 February 1802 when one of HMS Investigators cutters capsized near Cape Catastrophe.  The island was surveyed by Thomas Lipson, RN in 1840 as part of an ongoing South Australian Government program to map the colony’s waters, identify shipping hazards and assess the suitability of the coastline for settlement."]}, {"page": "Cape St Albans", "response": ["The cape is described as lying \"about  N(orth) of Cape Willoughby and extends in a N[ortherly] direction as a narrow neck of land.\"  The cape serves both as the east headland of Antechamber Bay and as the west headland of Moncrieff Bay.  It was named after the town of St Albans in Hertfordshire by Thomas Lipson on 21 March 1850.  The cape is the site of a navigation aid which was initially a temporary fixed light installed during early 1908 and which was subsequently replaced by a lighthouse that was first lit in November 1908."]}, {"page": "Thomas Burr", "response": ["In January 1846 Burr accompanied Governor Robe and Thomas Lipson in the Lapwing to Guichen Bay to examine that coast with a view to establishing a port, leading to the foundation of Robe.Geelong Advertiser, 18 April 1846, p. 1."]}, {"page": "T. Lipson", "response": ["#REDIRECT Thomas Lipson"]}, {"page": "James Collins Hawker", "response": ["Hawker sailed to South Australia in 1838 with George Gawler, who was an old friend of his father, and who was to succeed Captain Hindmarsh, R.N., the first viceregal representative in the colony. Gawler had made an offer to Hawker's father to take one of his sons to South Australia with him when he took up his new post. They arrived in Port Adelaide, described as a \"wretched mudhole\", in October. There he met harbormaster (and his future father-in-law) Capt. Thomas Lipson, R.N., accompanied the new Governor on his official entry into the city, and witnessed the swearing-in at the viceregal residence."]}, {"page": "Hansford Ward", "response": ["He settled at Glenelg, and gained employment under Thomas Lipson as a crew member for John Anthony's boat, associated with the Glenelg custom house.", "In April 1840, Ward was among the party that accompanied Governor Gawler to explore and chart the Spencer Gulf coast of Eyre Peninsula from Port Lincoln to Franklin Harbor.  Also in that party were Thomas Lipson, John Hill, Thomas Burr, and Alfred Hardy."]}, {"page": "Lipson, Thomas", "response": ["#redirectThomas Lipson"]}, {"page": "Margaret Brock Reef", "response": ["Margaret Brock Reef was seen by the Baudin expedition in April 1802.  In 1826, Sesostris, a ship carrying convicts to the colony of New South Wales and under the command of a Captain Drake sighted the reef on the way to Sydney.  The barque Margaret Brock was wrecked on the reef on 23 November 1852.  A chart prepared by Thomas Lipson, the South Australian Government harbor master, showing the location of the reefs to the west of Cape Jaffa including Margaret Brock Reef as well as the location of the wreck of Margaret Brock was published in The South Australian Government Gazette on 7 April 1853."]}]}}