{"wiki_id": "http://www.wikidata.org/entity/Q7796756", "itemLabel": "Thorsten Kaye", "itemDescription": "German-British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Thorsten_Kaye", "wikipedia_page": {"main": "Thorsten Kaye (born Thorsten Ernst Kieselbach on 22 February 1966 in Frankfurt, Federal Republic of Germany) is a German-British actor. His best known roles include Patrick Thornhart on One Life to Live, Dr. Ian Thornhart on Port Charles, Zach Slater on All My Children and Ridge Forrester on The Bold and the Beautiful.", "link_mentions": [{"page": "February 22", "response": ["*  1966   – Thorsten Kaye, German-English actor"]}, {"page": "All My Children", "response": ["On April 25, Cady McClain (ex-Dixie Cooney Martin) announced that she would be returning to All My Children but could not report what her storyline would be. Other former cast members announced to be returning to the series are Ray MacDonnell (Dr. Joe Martin), Lee Meriwether (Ruth Martin), David Canary (Adam Chandler), Julia Barr (Brooke English), Thorsten Kaye (Zach Slater), Eva La Rue (Maria Santos), Jennifer Bassey (Marian Colby), Kate Collins (Janet Dillon), Esta TerBlanche (Gillian Andrassy-Lavery), Josh Duhamel (Leo du Pres), Melissa Claire Egan (Annie Lavery), Leven Rambin (Lily Montgomery), Carol Burnett (Verla Grubbs), Jason Kincaid (Sam Brady), and Sarah Michelle Gellar playing a young woman who claims to see vampires (an allusion to the Buffy the Vampire Slayer story Normal Again).", "Within the weeks following the reports, Lindsay Hartley, Vincent Irizarry, Debbi Morgan, Darnell Williams, Jordi Vilasuso, Jill Larson, Thorsten Kaye, Cady McClain, David Canary, Julia Barr, and Ray MacDonnell were reported and/or confirmed to be returning to the show's revival, while Susan Lucci would reportedly return for one episode, Eden Riegel would return for a guest-arc, Cameron Mathison might return to the revival in the future, and Alicia Minshew would return for one episode with the possibility of returning in the future."]}, {"page": "Erica Kane", "response": ["In a topical 1973 storyline, Erica aborts the baby she conceives with her first husband, Jeff Martin (Charles Frank). This is the first legal abortion aired on American television since the landmark Supreme Court Roe v. Wade ruling. However, Maude Findlay had an abortion on Maude the year before, after New York legalized the practice. Erica was chosen for this storyline as a way to prevent controversy. Since she was a bad girl and not one of the heroines, her choice would not be viewed as something the show supported. The show also protected themselves from controversy by writing Erica as mentally blocking out the abortion and, for a time, believing she miscarried. Viewers loved the story and Erica became a symbol of free choice.Siegel, p. 58-9. Erica develops a potentially fatal infection after having the abortion. \"Erica's abortion was simply because she didn't want to have a child, and I think if you do that now, you would perhaps hurt your character,\" said former All My Children head writer Megan McTavish. McTavish later rewrote the story so the doctor, Greg Madden (Ian Buchanan), transplants the aborted fetus into his infertile wife. They raise the child, Josh Madden (Colin Egglesfield), as their son without Erica's knowledge. Inkling Magazine pointed out how unrealistic this storyline was because \"the techniques by which abortion is performed don't exactly lend themselves to excising an embryo viable enough to survive in another woman's womb.\" The magazine said more likelihood existed in the possibility that Madden harvested Erica's eggs during the procedure, though an invasive surgery like that going unnoticed appeared unlikely as well. Egglesfield gained different information on the probability of the story. In an interview with Soap Opera Digest, he said, \"Actually, my father is an obstetrician/gynecologist and my brother is a doctor, as is one of my best friends, and their collective opinion is that this is possible; it is possible to take a fetus out of one woman and place it into the womb of another woman, but it's only possible within the first week of pregnancy, before the fetus actually starts attaching itself to the uterine lining.\" In the storyline, Greg harbors an obsession with Erica, which motivates him to choose her for the transplant in the first place. Greg and Josh make their first appearances in 2005. Greg's wife recently died and he moves to Pine Valley for closer proximity to Erica under the guise of opening a clinic. Josh follows him soon afterward and, not knowing Erica is his mother, attempts to destroy Erica in order to steal her fame for himself. Erica discovers the truth and is eventually able to form a relationship with him. In 2009, All My Children let Egglesfield go and killed off Josh. Zach Slater (Thorsten Kaye) shoots him and Erica is then forced to decide whether or not to donate Josh's heart to a seriously ill Kendall. \"The first thought that came to my mind when I was told the storyline and read the script was Sophie's Choice,\" said Lucci. Erica reluctantly agrees to the transplant. Lucci said she believed this decision would \"haunt\" Erica because, if Kendall's life was not in the balance, she would have put more effort into saving Josh.Soap Opera Digest. January 27, 2009."]}, {"page": "Tad Martin", "response": ["Dixie and Zach Slater (Thorsten Kaye) go to trial for Greg's murder. On the witness stand, Tad tries to incriminate Dixie. In front of their sons, he berates their mother for abandoning them. Dixie is shocked to see Tad's true feelings come out. Her attorney is able to discredit his testimony, and the jury acquits them both. Tad reveals to Dixie it was his ploy to stop the investigation into Greg's murder because he had committed the crime. Dixie and Tad finally begin to make peace, and he forgives her for all she has done. The family reunites at Christmas, and Tad and Dixie finally have a wonderful holiday with their sons. Tad realizes how much he still loves his ex-wife, and Dixie clearly loves Tad. They begin to plan a future together once again, but a tragic turn of events occur. In January 2007, Dixie eats a plate of poisoned pancakes meant for her daughter-in-law Babe, and she begins to have pains in her heart. She immediately collapses of a massive heart attack. Despite prompt medical attention, she dies in the emergency room, with Tad at her side. Her last words were to Tad: together forever."]}, {"page": "Todd Manning", "response": ["Todd survives and hides at Llanfair, where he befriends two children, C. J. and Sarah Roberts. He is arrested when he jealously confronts new couple Rebecca and Powell. His prison van gets into an accident with another vehicle, and he rescues Marty, C. J. and Jessica (Erin Torpey) from the car. This results in an early parole for Todd, but he continues to seek counseling. He is later accused of rape by several women. Marty reluctantly provides him with an alibi for one of the attacks. A deranged Powell, believing Todd is in his head, is later revealed as the serial rapist and kidnaps Rebecca. When Todd confronts him, making it so that Rebecca can escape, he kidnaps Todd and makes Todd feel the way Marty felt when they raped her. Todd proceeds to overpower Powell. After Powell is caught and arrested, Todd apologizes to Marty for all the pain he caused her, recognizing that he \"was a monster.\" He begins falling in love with Blair Cramer (Kassie DePaiva) after meeting her in a bar. In December 1994, Peter Manning dies and Todd learns he is adopted. Conman David Vickers (Tuc Watkins) discovers Todd's biological parents, Victor Lord and Irene Manning. With help from Todd's scheming biological sister, Tina, David claims to be the lost Lord heir, but Todd's true parentage is ultimately revealed, leaving Todd $27.8 million richer. He purchases a tabloid paper from Dorian Lord (Robin Strasser) and relaunches it as The Sun, a direct rival to his new-found family's newspaper The Banner. In 1995, Blair tricks Todd into marriage by faking a pregnancy. She later learns that she really is pregnant, but, after being mugged, she miscarries. Todd discovers she initially lied about her pregnancy and has the marriage annulled. When Blair becomes pregnant again, they remarry in November 1995. Although they are happy, Blair dislikes Todd's consistent concern for Marty. He goes to Ireland to give Marty a flight back to Llanview. Her friend, Patrick Thornhart (Thorsten Kaye), is being hunted by Irish terrorists. Todd poses as Patrick, is shot, and presumed dead. Blair blames Marty. Todd returns to Llanview in 1996, to find Blair in bed with Patrick. His sister, Victoria \"Viki\" Lord (Erika Slezak), introduces him to his daughter, Starr (Kristen Alderson). Todd eventually resumes his life with Blair. They have many difficulties in their marriage, and Starr being diagnosed with aplastic anemia strains the marriage further. "]}, {"page": "Katherine Kelly Lang", "response": ["In 1987, Lang was offered the role of blue-collar Brooke Logan on the CBS soap opera The Bold and the Beautiful for the CBS Daytime programming block, and has been an integral part of the program ever since. Her love affair with Ridge Forrester (originally played by Ronn Moss, and since 2013 by Thorsten Kaye) has been a key story arc for more than 30 years, and a love triangle among Brooke, Ridge and Taylor (Hunter Tylo) stretched across an entire decade. The show's 5,000th episode included only the four core characters: Brooke, Ridge, Stephanie and Eric. As of February 2015, Lang is one of only two actors to be on The Bold and the Beautiful throughout the series. The other is John McCook, who portrays Eric Forrester."]}, {"page": "Susan Haskell", "response": ["Haskell also appeared on Port Charles in 2001 as Granya Thornhart, opposite her former One Life to Live love interest (and real-life husband), Thorsten Kaye, with whom she has two daughters McKenna (born February 2003) and Marlowe Marann (born January 28, 2007)."]}, {"page": "Alicia Minshew", "response": ["In October 2008, Minshew married Richie Herschenfeld, a New York City restaurant owner who is also the best friend of actor Thorsten Kaye, her long time on-screen husband.SoapZone: All My Children News & Gossip She is close friends with co-star Rebecca Budig.SoapZone: All My Children News & Gossip  Minshew and her husband welcomed the birth of their daughter Willow Lenora Herschenfeld on November 4, 2009 "]}, {"page": "30th Daytime Emmy Awards", "response": ["*Thorsten Kaye (Ian Thornhart, Port Charles)"]}, {"page": "William J. Bell", "response": ["*Ridge Forrester (The Bold and the Beautiful) - 1987–2012, 2013–present (currently played by Thorsten Kaye)"]}, {"page": "31st Daytime Emmy Awards", "response": ["*Thorsten Kaye (Ian Thornhart, Port Charles)"]}, {"page": "ABC Super Soap Weekend", "response": ["* Thorsten Kaye (2004–2008)", "* Thorsten Kaye (1996)"]}, {"page": "Felicia Forrester", "response": ["Felicia is known as the black sheep of the Forrester family. The youngest daughter of Stephanie (Susan Flannery) and Eric Forrester (John McCook), Felicia has one brother, Thorne (Winsor Harmon), and one sister, Kristen Forrester (Terri Ann Linn, Tracy Melchior). She had another sister, Angela who is deceased. She also has three half-siblings: Ridge (Thorsten Kaye), Rick (Jacob Young), and Bridget (Ashley Jones). She is affectionately known as Fifi, a name bestowed on her by her mother's friend, Sally Spectra (Darlene Conley)."]}, {"page": "List of All My Children characters", "response": ["*Thorsten Kaye (2004–11, 2013)"]}, {"page": "Blair Cramer", "response": ["By November 1995, Todd and Blair reunite and marry again. Todd travels to the Irish island of Inishcrag to make amends with Marty Saybrooke (Susan Haskell), the woman he had raped years before. Todd helps Marty's love, Patrick Thornhart (Thorsten Kaye), evade a terrorist group, but is mistaken for Patrick, shot, and presumed dead."]}, {"page": "33rd Daytime Emmy Awards", "response": ["*Thorsten Kaye (Zach Slater, All My Children)"]}, {"page": "List of One Life to Live characters", "response": ["| Patrick Thornhart || Thorsten Kaye || 1995–97"]}, {"page": "List of The Bold and the Beautiful cast members", "response": ["! scope=\"row\"| Thorsten Kaye"]}, {"page": "Zach Slater", "response": ["Zach Slater is a fictional character from the American drama, All My Children. He was portrayed by actor Thorsten Kaye from May 20, 2004 to November 19, 2010; Thorsten returned to the role on August 5, 2011 to September 23, 2011. In 2006, the character was reported by newspaper Chicago Sun-Times as one of the male television character romantically desired by their female readers, and is considered one of television's anti-heroes. On April 30, 2013, Kaye reprised the role of Zach for the continuation of All My Children. In October 2013, Kaye announced he would not be returning for the second season of the series, instead taking on the role of Ridge Forrester on The Bold and the Beautiful."]}, {"page": "List of The Bold and the Beautiful characters", "response": [":Thorsten Kaye (2013–)"]}, {"page": "Thomas Forrester", "response": ["Thomas is the son of supercouple Ridge Forrester (Ronn Moss, later Thorsten Kaye) and Taylor Hayes (Hunter Tylo, later Krista Allen). He has two sisters, Phoebe (MacKenzie Mauzy) and Steffy (Jacqueline MacInnes Wood) and a half-brother, R. J. Forrester (Anthony Turpel) from his father's marriage to Brooke Logan (Katherine Kelly Lang)."]}, {"page": "Sheila Carter", "response": ["Sheila (Brown) returns to Los Angeles in June 2017. When she attempts to leave Katie Logan (Heather Tom)'s home without being noticed, Quinn Forrester (Rena Sofer) hears her leaving, immediately asking who she is. Introducing herself as a friend of the Logan family, Sheila reveals herself to Katie, asking for her assistance in making amends with those she had wronged in Los Angeles. Startled by her arrival, Katie immediately alerts Eric of Sheila's re-appearance; arriving at Katie's and believing that Sheila is the one who shot at Quinn, Eric escorts Sheila to the police station, and has her arrested for violating an order of protection he had previously filed years prior.  When it is revealed that Deacon Sharpe (Sean Kanan) is the one who was targeting Quinn, Eric extends an olive branch to Sheila, welcoming her back to the Forrester estate, much to the disapproval of Quinn and Ridge (Thorsten Kaye). Sheila immediately begins to dig into the life of Eric, rooting herself into his marriage with Quinn. After scheming with Forrester security officer, Charlie Webber, Sheila exposes Quinn's kiss with Ridge.  As Sheila comforts and supports an emotionally hurt Eric, she is confronted by Steffy Forrester (Jacqueline MacInnes Wood), who — believing Sheila to be armed — shoots her in Eric's hotel room, but she survives, only sustaining a flesh wound.  Sheila continues to insinuate herself into Eric's life, faking a concussion after a catfight with Quinn to manipulate Eric into letting her stay in the Forrester mansion.  Sheila blackmails her ex-husband, James Warwick, into lying about the severity of her condition, but slips up when Quinn catches her walking around normally.  Sheila gets a waitressing job in town to eavesdrop on the residents of Los Angeles, and later offers Eric's estate manager Mateo money to seduce Quinn, but her plan is foiled when Mateo tells Quinn the truth.  Sheila is thrilled when Eric invites her to the Forrester mansion with the intention of replacing Quinn's portrait with Sheila's, but this turns out to be a ruse.  As Eric and Quinn again demand that Sheila leave, Sheila smiles to herself outside the closed mansion door."]}, {"page": "Linsey Godfrey", "response": ["| Couple of the Year — \"Caroline and Ridge\"  (shared with Thorsten Kaye) "]}, {"page": "CBS Daytime", "response": ["* Cast: Krista Allen, Matthew Atkinson, Kimberlin Brown, Darin Brooks, Scott Clifton, Delon de Metz, Don Diamont, Sean Kanan, Thorsten Kaye, Katherine Kelly Lang, John McCook, Annika Noelle, Tanner Novlan, Lawrence Saint-Victor, Rena Sofer, Heather Tom, Diamond White, Jacqueline MacInnes Wood"]}, {"page": "One Life to Live storylines (1990–1999)", "response": ["An extremely controversial character, Todd is, however, allowed to mend fences with his old enemy Marty, form a sibling bond with Viki, and even reconcile and remarry Blair (who is again pregnant by him) before being presumed dead and written out. Meanwhile, Marty finds herself in the middle of a love triangle. She marrys Dylan, but her heart truly belongs to Irish poet Patrick Thornhart (Thorsten Kaye). Blair blames Marty for Todd’s supposedly tragic accident. She gives birth to daughter Starr Manning, then chases after Patrick, for no better reason than to irritate Marty.", "Several actors left the show taking their characters out of Llanview:  Nathan Fillion (Joey), Tonja Walker (Alex), Jon Loprieno (Cord), and Stephanie Williams (Sheila) all left the show in 1996.  Kamar De Los Reyes and Wendee Pratt, who played popular supercouple Antonio and Andy, left in 1997. Susan Haskell and Thorsten Kaye (Marty and Patrick) also departed that year."]}, {"page": "Zach Slater and Kendall Hart", "response": ["Zach Slater and Kendall Hart Slater are fictional characters and a supercouple from the American daytime drama All My Children. Zach is portrayed by Thorsten Kaye, and Kendall is portrayed by Alicia Minshew. The couple is often referred to by the portmanteau \"Zendall\" (for Zach and Kendall) on Internet message boards. Originally scripted by former All My Children head writer Megan McTavish, the couple was never intended to be a serious romance; notable viewer response to the pairing led All My Children writers to reconsider and script them as true loves.", "Zach and Kendall's romance intrigued newspaper Chicago Sun-Times in 2006. In their October 30, 2006 issue, the newspaper revealed that a significant portion of their female readers wanted to \"literally trade places\" with Kendall so that they could have Zach. The article was dedicated to which guys on television \"make their readers swoon\" — and inspires them to go through perplexing lengths in order to catch them on television. Thorsten Kaye, Zach's portrayer, was their #1 vote getter, and beat out runner-ups such as \"McDreamy\" Patrick Dempsey."]}, {"page": "Steffy Forrester", "response": ["Steffy Forrester is a fictional character from the American CBS soap opera The Bold and the Beautiful. Introduced by Bradley Bell, she is currently portrayed by Jacqueline MacInnes Wood. Steffy and her twin sister Phoebe (MacKenzie Mauzy) were born onscreen as the daughters of supercouple Ridge Forrester (Ronn Moss, later Thorsten Kaye) and Taylor Hayes (Hunter Tylo, later Krista Allen) during the episode airing on September 21, 1999. For the character's first five-year period, she appeared as a minor. In 2005, Steffy was rapidly aged to a teenager, and in 2008 she appeared as an adult when Wood took over the role. Wood portrayed the role continuously until 2013, when she decided to leave her regular capacity with the series; following a series of guest appearances, Wood returned as a series regular in 2015."]}, {"page": "Daytime Emmy Award for Outstanding Lead Actor in a Drama Series", "response": ["|Thorsten Kaye", "|Thorsten Kaye", "|Thorsten Kaye", "|Thorsten Kaye", "| Thorsten Kaye", "| Thorsten Kaye", "| Thorsten Kaye"]}, {"page": "List of All My Children cast members", "response": ["| Thorsten Kaye || Zach Slater || 2004–11, 2013"]}, {"page": "List of Port Charles characters", "response": [":(Thorsten Kaye, 2000–03)"]}, {"page": "JR Chandler and Babe Carey", "response": ["It is later revealed that although Babe was attacked by the Satin Slayer, she did not die. Josh has saved her, with the help of Zach Slater (Thorsten Kaye), Kendall, Jackson Montgomery (Walt Willey), Joe Martin (Ray MacDonnell) and Jeff Martin (John James). It was Zach's idea to fake Babe's death, and Jeff and Joe who saved her life by implanting a pacemaker within her heart to regulate it. Josh gets most of the credit due to his constant vigil at her bedside. To fake Babe's death, they slowed down her heart-rate, causing her to go into a coma and then they moved her to Zach's casino. Josh pretends to skip town out of his \"heart-breaking loss\" of Babe. JR mourns, and the serial killer is soon discovered to be Alexander Cambias Sr. (Ronald Guttman), Zach's biological father. Babe stays at Zach's casino where, through Josh's lies, she is led to believe that she is in a real hospital and that JR does not care about her."]}, {"page": "List of Port Charles cast members", "response": ["| Thorsten Kaye || Ian Thornhart || 2000–03"]}, {"page": "Kaye (surname)", "response": ["* Thorsten Kaye, German actor"]}, {"page": "List of One Life to Live cast members", "response": ["|Thorsten Kaye || Patrick Thornhart || 1995–97"]}, {"page": "Bianca Montgomery and Maggie Stone", "response": ["When Bianca returns for a Christmas visit to Pine Valley, she tells everyone that she and Maggie are an official couple in Paris, advising Zach Slater (Thorsten Kaye) to be happy with Kendall, because she is very happy with Maggie. Despite this, when she returns again near Thanksgiving in 2006, bringing her daughter with her, she informs everyone that Maggie had an affair with a woman named Cecelia. Bianca says that she would still take Maggie back. During a phone call, though, it is clear that Maggie does not want that. Bianca is left further devastated, but still voices to wanting Maggie. However, when Maggie shows up in early 2007 on Bianca's doorstep wanting to renew their romance, Bianca does not, and Maggie later has a confrontation with Zoe (Jeffrey Carlson), someone else who wants a romance with Bianca. Zoe is a transgender rockstar, biologically male but identifying herself as a lesbian woman. Zoe asks Maggie how could she cheat on Bianca, and Maggie angers. Harsh words are exchanged between the two. Before the confrontation is over, Maggie warns Zoe not to hurt Bianca, but notes that Zoe will never be Bianca's type, regardless."]}, {"page": "Forrester family", "response": ["*Ridge Forrester (Thorsten Kaye)The eldest and favorite son of Eric and Stephanie Douglas, later found to be the biological son of Massimo Marone.  He is currently co-owner and CEO of Forrester Creations. He has four children: Thomas, Phoebe, Steffy and Ridge Forrester Jr."]}, {"page": "List of Wayne State University people", "response": ["* Thorsten Kaye, actor, All My Children, One Life to Live, Port Charles"]}, {"page": "Cassandra Foster", "response": ["Jesse hints about a surprise he has for Angie, it is then revealed that Jesse had paid for Cassandra's (Sal Stowers) plane ticket to visit Pine Valley. Jesse tries to contact Cassandra, but she is not responding to his calls on April 30, 2013. It is shown that someone has destroyed her phone. Cassandra makes her first appearance as she is being handcuffed to a bed by Vlad Koslov (Alfredo Diaz). It is revealed she was taken by an imposter driver, Vlad. Later on, it is revealed that Cassandra has been captured by a human trafficking ring. Yuri Koslov (Martin Harvey) finds that Vlad has been keeping Cassandra in a separate room for his own benefits, he then demands that Cassandra be with the other girls of the ring, he then visits her and gives her an oxycodone pill to take, she does so. On May 9, 2013, Vlad forces two other girls of the ring into Cassandra's room, the girls are in worse shape than Cassandra, later on Vlad takes Cassandra away. Jesse and Zach Slater  (Thorsten Kaye) are investigating into Cassandra's disappearance and find she is part of a human trafficking ring, although they rescue another girl who was found in a garbage dump. When Cassandra's captors find out (from another captive girl) that Cassandra is related to the chief of police, they initially panic but decide to turn the situation to their advantage. They contact Jesse and threaten to kill Cassandra unless he cooperates with them. Jesse insists on speaking with Cassandra to verify that they have her and that she's alive, so Yuri removes her gag long enough to allow her to scream to Jesse for help and to hear him reply that he will find her. Jesse then makes a secret deal with the traffickers in which they promise to release Cassandra in exchange for Jesse's cooperation in faking the death of Yuri Koslov. A body is found; testing reveals the teeth of the corpse match dental records for Yuri Koslov (fake dental records planted by Jesse as part of the scheme). Cassandra is dumped unconscious in the Hubbard home, where she is found by David Hayward, whose quick and skilled response saves her life. In the hospital, Cassandra says that her phone conversation with Jesse during her captivity had enabled her to believe that everything would be okay. Because Yuri had made it clear to Jesse that to reveal the secret of his faked death would mean terrible retribution against the whole family, Jesse is forced to deny that he ever spoke with Cassandra during her captivity, claiming that Cassandra must have been hallucinating—but Lea starts trying to put the pieces together. On July 1, 2013, Dr. Anders reveals that Cassandra's tests are negative to all STDs they have tested for, but he reveals to Angie and Jesse that she is pregnant."]}, {"page": "Téa Delgado", "response": ["Todd and Téa's marriage is at first nothing more than a business deal; Todd offers Téa to be his wife and lawyer for $5 million to ensure custody of his daughter (Starr).  He is out for revenge against ex-wife Blair, feeling she ruined his chances at happiness when he returned to town after being presumed dead and discovered her having sex with Patrick Thornhart (Thorsten Kaye) on the floor of the penthouse he once shared with her. It is after this Todd shuts down emotionally, almost completely. He subsequently only shows kindness to his daughter and his sister (Victoria Lord), and occasionally to children. Soaps In Depth stated, \"Téa being Todd's wife often put her in conflict with wife No. 1 and No. 2 — Blair.\" During one heated confrontation, the women's argument becomes physical. Lozano said \"I'll never forget the time I crashed out the window. Kassie DePaiva (Blair) had to push me, and she was so nervous about really hurting me that I actually had to calm her down.\""]}, {"page": "Gotham Screen Film Festival & Screenplay Contest", "response": ["Dir. Henry S. Miller, written by John Brett, with Van Hansis, Cody Horn, Thorsten Kaye, Steve Routman, Amy Wilson"]}, {"page": "36th Daytime Emmy Awards", "response": ["*Thorsten Kaye (Zach Slater, All My Children)"]}, {"page": "Thorsten", "response": ["*Thorsten Kaye (born 1966), American-based actor"]}, {"page": "Ridge Forrester", "response": ["Ridge Forrester is a fictional character from the CBS Daytime soap opera, The Bold and the Beautiful. The character was introduced in the series premiere on March 23, 1987 and has been a regular fixture ever since. Ronn Moss played the role since the beginning, and was one of four remaining original cast members for 25 years, along with Susan Flannery, John McCook and Katherine Kelly Lang. During a leave of absence in 1992, Moss was briefly replaced by Lane Davies. The character's fate was uncertain when Moss departed the role in 2012, although head-writer Bradley Bell confirmed in an interview with Michael Logan of TV Guide that he had plans for a recast should Moss choose not to return to the series. In October 2013, TV Guide's Michael Logan reported that the role of Ridge was recast with former All My Children actor, Thorsten Kaye. Kaye made his first appearance as Ridge on December 13, 2013. Due to the COVID-19 pandemic, Denise Richards' husband Aaron Phypers has appeared as Ridge in love scenes with Shauna in 2020. ", "Bell later announced he would recast the role, should Moss choose not to return, and had several high-profile actors in mind. On October 15, 2013, it was announced that former All My Children star Thorsten Kaye was recast in the role of Ridge. He made his on-screen debut on December 13, 2013. Bradley Bell explained that Kaye was at the top of his list for a Ridge recast and even considered bringing him to the series prior to the recast. He said, \"I've had Thorsten on a list of several possible Ridges for a long time. Some of the actors on that list came from daytime, others had never done daytime before.\"", "Ridge (Thorsten Kaye) returns to L.A. in December 2013 and reconnects with Brooke, but breaks things off when he learns of her affair with Bill Spencer, Jr. Katie, Brooke's youngest sister, thought she was going to die, but was going through postpartum psychosis. She wanted Brooke to take care of Bill and Will, so arranged circumstances for Brooke and Bill to fall in love and raise Baby Will together. Everyone blames Brooke's affair with Bill on Ridge leaving Brooke on their honeymoon and spending one year away in Paris. Brooke and Ridge decide to remarry, but Katie and Ridge have connected and have feelings for each other. Katie fakes a fainting spell at the wedding.  Ridge begins dating Brooke's sister Katie Logan, which angers a jealous Brooke and Eric, who wants Ridge and Brooke together. Eric tells Ridge that if he breaks up with Katie and gets together with Brooke he will appoint Ridge CEO of Forrester Creations. Eric makes Brooke and Ridge co-vice presidents with Rick still serving as president. Katie and Ridge become engaged and Bill seizes the opportunity for another chance with Brooke. Bill and Brooke travel to Abu Dhabi for their marriage, which is stopped by Ridge when he learns of Bill's one night stand with Quinn Fuller. An enraged Bill orders his right hand man Justin Barber, who was secretly piloting the helicopter Ridge and Brooke were on, to dump Ridge into the Persian Gulf. After an extensive search Brooke finds Ridge on the beach but he has suffered memory loss and has lost the ability to draw. Ridge blames Bill for his loss of drawing but finds that he is learning to draw again by working with Rick's wife and Bill's niece Caroline Spencer. Eric says he will step down as CEO to travel more with his brother John and will decide on a successor between Ridge and Rick. As Caroline and Ridge work together alone on the new couture line they share a few kisses and declare their attraction for each other. Katie becomes jealous of Caroline's ability to understand Ridge and help him draw again but tells Ridge not to use Caroline to attain the CEO position. Eric chooses Ridge as the new CEO but changes his mind when he learns about Ridge and Caroline kissing.  During a business meeting, Maya told everyone that Ridge and Caroline were having an affair.  Though Caroline is crying and begging for Rick's forgiveness, Ridge stands quietly. Rick is angered and hurt and begins an affair with the greedy and opportunistic Maya Avant, who convinces Rick to accept the CEO position. Rick uses his new role as CEO to enact revenge on Ridge and Caroline. Ridge and Katie's relationship is strained and a vengeful Katie tells Bill, who gets into a fight with Ridge. Caroline wants to have a relationship with Ridge but he tells her to work things out with Rick. Eric orders Rick to end his affair with Maya or he will fire him as CEO. Rick devises a scheme where it appears he has returned to Caroline until he is secure in his position at Forrester Creations. However, Rick continues his affair with Maya until he was able to gain irrevocable control of the company from Eric. Once he achieves this, he leaves Caroline and moves Maya into the Forrester Mansion, and replaces Stephanie's portrait above the fireplace with one of Maya. Rick finds Ridge and Caroline making out with each other in the design office and shoots at them with a gun that he stole from Eric. Eric, finally realizes Rick is dangerous and unstable, uses the morality clause in Rick's contract to fire Rick and make Ridge CEO. Katie then breaks off her engagement with Ridge as his relationship with Caroline progresses."]}]}}