{"wiki_id": "http://www.wikidata.org/entity/Q7794599", "itemLabel": "Thomas Turner", "itemDescription": "English diarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Turner_(diarist)", "wikipedia_page": {"main": "Thomas Turner (9 June 1729 [OS] – 6 February 1793) was a shopkeeper in East Hoathly, Sussex, England. He is now most widely known for his diary.", "link_mentions": [{"page": "East Hoathly with Halland", "response": ["The origin of the village name is said to be from the family name of De Hodleigh, landowners in the 12th century. The village was the home of Thomas Turner (1729–1793), a local diarist, in the 18th century. In more modern times it was the birthplace of founding member/keyboard player of the progressive rock band Genesis, Tony Banks.", "* Thomas Turner (9 June 1729 [OS] – 6 February 1793) was a shopkeeper in East Hoathly. He is now most widely known for his diary, which is seen as an important document recording village life in Sussex during the 18th century."]}, {"page": "Peter Chrisp", "response": ["http://www.sevendialsartists.co.uk/2007/house13/6_clifton_street.htmIn 2014, his portraits of the Magna Carta barons were displayed in an exhibition in St Edmunsbury Cathedral, and 'were very popular with visiting families and schools'. '800th Centenary Celebrations of the sealing of the Magna Carta', Bury St Edmunds Town Council website The illustrations were later displayed as a trail on bollards around the town.Magna Carta Barons' Prize Trail, Ourburystedmunds website In 2017, his Christmas tableaux photographs, with Lisa Wolfe, were featured in The Observer,'Merry little Christmases: one couple's tableau tradition – in pictures', The Observer, 26 November 2017 Der Spiegel,'Grußkarten aus 31 Jahren: Frohe Weihnachten wünschen Lisa und Peter', Der Spiegel online, 22 December 2017 the New Zealand Stuff.co.nz news website,Anabela Rea, 'British couple's kooky Christmas cards are the best around', Stuff, 27 November 2017 and Brighton's Viva magazine.Lizzie Lower, 'Lisa Wolfe and Peter Chrisp: Christmas Crackers', Viva Magazine, December 2017 In 2019, his illustrations of the diary of Thomas Turner began appearing in a monthly column, edited by Mathew Clayton, in Caught by the River.'The World of Thomas Turner', Caught by the River, 27 March 2019"]}, {"page": "Thomas Turner", "response": ["*Thomas Turner (15th century MP) for Rochester", "*Thomas Turner (fl.1559), MP for Reading", "*Thomas Turner (died c. 1586), MP for Bath", "* Thomas Turner (mayor of Georgetown), in modern Washington DC (1795-96).", "*Thomas Turner (Congressman) (1821–1900), U.S. Congressman from Kentucky, 1877–1881", "*Thomas Turner (cricketer) (1865–1936), Australian cricketer", "*Thomas Turner (footballer) (fl. 1884), Scottish international footballer", "*Thomas Turner (sport shooter) (born 1972), Australian sport shooter", "*Thomas Turner (Dean of Canterbury) (1591–1672), Anglican dean", "*Thomas Turner (diarist) (1729–1793), 18th century English diarist", "*Thomas Turner (metallurgist) (1861–1951), University of Birmingham", "*Thomas Turner (president) (1645–1714), Anglican clergyman and academic", "*Thomas Turner (potter) (1749–1809), English potter", "*Thomas Turner (surgeon) (1793–1873), English founder of a medical school in Manchester", "*Thomas Turner (microbiologist) (1902–2002), Dean of Johns Hopkins Medical School, 1957–1968"]}, {"page": "1729 in Great Britain", "response": ["* 9 June – Thomas Turner, diarist (passed 1793)"]}, {"page": "1793 in Great Britain", "response": ["* 6 February – Thomas Turner, diarist (born 1729)"]}, {"page": "Thomas Turner (diarist and shopkeeper)", "response": ["#REDIRECT Thomas Turner (diarist)"]}, {"page": "History of Christianity in Sussex", "response": ["The number of dissenters fell from 4,300 in 1676 to around 3,300 in 1724.  In the 18th century, the Sussex grocer, Thomas Turner left a diary which suggests a high level of theological literacy amongst laypeople.  At this time, the Sussex Weald and bordering towns such as Lewes were home to a number of fundamentalist sects.  Cade Street Chapel in Heathfield was founded in 1769 for the followers of George Gilbert, who was popularly styled as 'The Apostle of Sussex'.  Gilbert also preached in surrounding villages, often with great hardship and difficulty: at Ticehurst he was pelted with stones when the bells rang; at Bexhill he was plastered from head to toe in filth, and a large drum was played to drown out the sound of his voice until a woman put a knife into the drum."]}, {"page": "Cricket in Sussex", "response": ["The diaries of Marchant and Thomas Turner, another Sussex diarist, from East Hoathly, show that in the 18th century cricket was commonplace in the Sussex Weald. In 1702, the Duke of Richmond's XI defeated an Arundel XI in Sussex. The source for this game is a receipt sent by one Saul Bradley to the Duke on 14 December 1702. The receipt was in respect of one shilling and six pence paid by the Duke \"for brandy when your Grace plaid at Cricket with Arundel men\". It is thought the brandy was bought to celebrate a victory.McCann, paragraph 1."]}]}}