{"wiki_id": "http://www.wikidata.org/entity/Q7795188", "itemLabel": "Thomas Williams", "itemDescription": "Royal Navy officer (c. 1762-1841)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Williams_(Royal_Navy_officer)", "wikipedia_page": {"main": "Admiral Sir Thomas Williams GCB (c. 1761/62 – 8 October 1841) was a senior British Royal Navy officer of the late eighteenth and early nineteenth centuries, who served in numerous theatres during the American Revolutionary War, French Revolutionary Wars and Napoleonic Wars. As a young officer he fought at a number of battles in the Caribbean and as a frigate captain he was knighted for his actions at the action of 8 June 1796 in which two French frigates were captured without a single man killed or wounded on Williams' ship HMS Unicorn. Later in his career, Williams commanded squadrons blockading the European coast and assisting the supply of the British Army during the Peninsula War.", "link_mentions": [{"page": "HMS Vanguard (1787)", "response": ["In 1801, under the command of Captain Sir Thomas Williams. Vanguard sailed from Portsmouth on 20 April to join the Baltic fleet. The fleet, under Vice Admiral Pole, returned on 10 August. Vanguard, , , , , , and  sailed again on 19 August to cruise off Cádiz. The first four were victualled and provisioned for five months at Gibraltar and sailed for Jamaica in December.  followed them as soon as she had watered at Tetuan."]}, {"page": "Battle of Camperdown", "response": ["In contrast to the British difficulties, the survivors of the Dutch fleet had few problems returning to the Texel, with the exception of Brutus. Admiral Bloys van Treslong had sailed for the coast off Hinder with two brigs, and there on 13 October the 40-gun British frigate  under Captain Sir Thomas Williams found him. At 16:30, Endymion closed with the larger, but damaged, Dutch ship and opened fire, Brutus responding with a broadside of its own. Williams successfully raked his opponent twice, but the complicated tides of the Dutch coast dragged his ship out of range at 17:30 before he could press his attack any further. Firing rockets in the hope of attracting attention from any of Duncan's ships, Williams was rewarded at 22:30 by the arrival of Beaulieu. On 14 October the frigates hunted for their opponents, and found the Dutch ships off the Goeree channel at 05:00. The frigates closed, and Bloys van Treslong withdrew, passing deeper into Dutch waters and reaching safety at Maese by 07:00. The British frigates, their quarry having escaped, returned to Duncan's struggling fleet.James, p. 78"]}, {"page": "HMS Neptune (1797)", "response": ["Drury commanded Neptune for the next two years, until his promotion to rear-admiral in 1804. He departed the ship on 13 May 1804, and the following day Captain Sir Thomas Williams took over. Neptune spent the rest of 1804 deployed with the Channel Fleet, blockading the French Atlantic ports. During this time Captain Williams' health progressively worsened, and he was invalided back to Britain on 7 May 1805. He was replaced by Captain Thomas Fremantle on 8 May, and was sent to join Robert Calder's force blockading Ferrol, after the Franco-Spanish fleet had arrived there after the Battle of Cape Finisterre. Calder decided that his eight ships were not sufficient to resist Villeneuve's fleet were it to come out of harbour, and instead went north to join Admiral William Cornwallis's fleet off Brest. Shortly afterwards Nelson's fleet returned from the West Indies, bringing 12 more ships, and Calder was given 18 ships, including Neptune, and sent back to Ferrol to search for Villeneuve. By now Villeneuve had put into Cadiz and Calder's force was ordered to join the hastily assembled British fleet under Vice-Admiral Cuthbert Collingwood, that was blockading the Franco-Spanish fleet at Cadiz. As the British fleet settled in for a long blockade Fremantle commented on Neptunes sailing qualities. She had the reputation of being slow, and Fremantle complained that he did not like being in 'a large ship that don't sail and must continually be late in action.' During the battle however, Midshipman William Baddock commented that 'The old Neptune, which never was a good sailer, took it into her head that morning to sail better than I ever remember to have seen her do before.' Neptune  went into the battle 18 men short of her complement.", "After undergoing some repairs at Gibraltar Neptune sailed to Britain, arriving at Portsmouth on 6 December 1805, where she was paid off. She was moved to Spithead in 1806, but was back in Portsmouth on 23 November, and was moved into a dock on 24 March 1807 to undergo a refit. The refit lasted until November 1807 and involved having her copper sheathing removed and her hull refitted. She was then recoppered, having had a sum of £29,053 expended on her. She was recommissioned on 18 August 1807 under her old commander, Captain Sir Thomas Williams, and was relaunched three days later on 21 August to complete her refit. She was initially assigned to serve in the English Channel, but was moved to the West Indies in 1808. On 9 November Williams was superseded by Captain Thomas Pinto, who only spent six weeks in command before being succeeded by Captain Charles Dilkes on 20 December."]}, {"page": "Commander-in-Chief, The Nore", "response": ["* Vice-Admiral Sir Thomas Williams (1811–1814)"]}, {"page": "Thomas Williams", "response": ["Thomas Williams may refer to:", "*Thomas Williams, Gresham Professor of Astronomy", "*Thomas Williams, Assistant Dean, Sandra Day O'Connor College of Law", "*Thomas Williams (cartoonist) (1940–2002), English cartoonist", "*Thomas Williams (Christadelphian) (1847–1913), editor of the Christadelphian Advocate magazine", "*Thomas Williams (writer) (1926–1990), American novelist", "*Ras Shiloh (born 1975), stage name for reggae artist Thomas Williams", "*Thomas Williams (Australian Army officer) (1884–1950), Australian major general", "*Thomas Williams (Union general) (1815–1862), Union general during the American Civil War", "*Thomas Williams (Royal Navy officer) (1761/62-1841), British admiral", "*Thomas Williams (RAF officer) (1899–1956), British air marshal", "*Thomas Williams (priest and translator) (1658–1726), Welsh Anglican priest", "*Thomas Williams (Vicar Apostolic of the Northern District) (1661–1740), Roman Catholic bishop", "*Thomas Williams (Congregational minister) (1725–1770), Congregational minister", "*Thomas Williams (1755–1839), author of the Cottage Bible", "*Thomas Williams (1779–1876), Congregational minister", "*Thomas Williams (dean of Bangor) (1870–1941), Welsh Anglican priest", "*Thomas Williams (Archdeacon of Craven) (1889–1956), Anglican priest", "*Thomas Williams (cardinal) (born 1930), Roman Catholic bishop", "*Thomas Williams (dean of Llandaff) (died 1877), Welsh Anglican priest", "*Thomas Williams (South Australian politician) (c. 1794–1881), politician in the colony of South Australia", "*Thomas Williams (Australian politician) (1897–1992), Australian politician", "*Thomas Williams (New South Wales politician) (1862–1953), Australian politician", "*Thomas Williams (by 1518-79/90), MP for Oxford", "*Thomas Williams (speaker) (1513/4–1566), Speaker of the House of Commons", "*Thomas Williams (Warrington MP) (1915–1986), British Labour Co-operative politician", "*Thomas Williams of Llanidan (1737–1802), Welsh lawyer and businessman known as the “Copper King of Parys Mountain”, MP for Marlow 1790–1802", "*Thomas Williams, 1st Baron Williams (1892–1966), British life peer and Labour Party member", "*Thomas Peers Williams (1795–1875), MP for Marlow 1820–1868, Father of the House, 1867–1868; grandson of Thomas Williams of Llanidan", "*Thomas Williams (Kennington MP) (1877–1927), British Member of Parliament for Kennington, 1923–1924", "*Sir Thomas Williams, 1st Baronet (c. 1621–1712), English medical doctor and Member of Parliament for Weobley", "*Thomas Williams of Edwinsford (died 1762), Custos Rotulorum of Carmarthenshire from 1745 to 1762", "*Thomas Williams (Alabama politician) (1825–1903), US representative", "*Thomas Williams (Pennsylvania politician) (1806–1872), US representative", "*Thomas Williams (American football) (born 1984), American football player", "*Thomas Williams (cricketer, born 1884) (1884–1954), Welsh cricketer", "*Thomas Williams (Irish cricketer) (1908–1982), Irish cricketer", "*Thomas Williams (figure skater) (born 1991), Canadian ice dancer", "*Thomas Williams (rugby league), rugby league footballer of the 1910s for Wales, and Oldham", "*Thomas Williams (soccer) (born 2004), American soccer player", "*Thomas Williams Jr. (born 1987), American boxer", "*Thomas Williams (manufacturer) (1846–?), New Zealand ironfounder and businessman", "*Thomas Williams (Mayflower), signatory of the Mayflower Compact", "*Thomas Williams (pioneer) (died 1785), early settler to Detroit, Michigan and grandfather of general Thomas Williams", "*Thomas Williams (died 1831), murderer, one of the London Burkers", "*Thomas Williams (Northern Rhodesian speaker) (1893–1967), Speaker of the Legislative Council of Northern Rhodesia"]}, {"page": "HMS Endymion (1797)", "response": ["In April 1797, Captain Thomas Williams commissioned Endymion for the Channel and Irish station. In October Endymion joined the North Sea fleet with orders to pursue the scattered Dutch ships in the aftermath of the Battle of Camperdown. Within hours, Endymion encountered the ship of the line  close inshore, but the protected anchorage prevented Williams from successfully attacking the Dutch ship and she was able to escape.", "* 1797 Captain Sir Thomas Williams"]}, {"page": "Royal Naval School", "response": ["At the same time as the boys' school was founded, in 1840, The Royal Female School for the Daughters of Naval and Marine Officers was founded 'in a candle-lit, rented house on Richmond Green' which later changed its name to The Royal Naval School or RNS - as it is still known today by its old girls. RNS was due to the inspiration of Admiral Sir Thomas Williams, a Royal Navy officer of the late eighteenth and early nineteenth centuries, who had served with distinction in numerous theatres during the American Revolutionary War, French Revolutionary Wars and Napoleonic Wars. As stated on the dust jacket of the history of the school published in 1975, Williams"]}, {"page": "HMS Hannibal (1810)", "response": ["Between 1810 and 1811 Hannibal served as flagship to Rear-Admiral Sir Thomas Williams and then Rear-Admiral Philip Durham. On 26 March 1814 Hannibal, , and  encountered the French frigates Sultane and Etoile, which were returning from the Cape Verde Islands and a cruise of commerce raiding. Hannibal set off after Sultane and sent Hebrus and Sparrow after Etoile. Both French vessels were captured the next day.  captured Sultane without a fight.  captured Étoile, but only after severe fighting at the ensuing Battle of Jobourg."]}, {"page": "French expedition to Ireland (1796)", "response": ["On 7 January, the British frigates  under Captain Sir Thomas Williams,  under Captain Charles Jones and  under Captain Richard King, captured the transport , Druid escorting the prize back to Cork. The following day Unicorn and Doris encountered some of the force that had attempted to land at the Shannon. Outnumbered, the frigates retreated westwards and encountered the battered Révolution and Fraternité, which withdrew before them. This prevented Morard de Galles and Hoche from belatedly joining their squadron and took them away from the route back to France. When Unicorn and Doris reappeared the following morning, they were operating as scouts for Bridport's fleet, which had finally left port at the start of the new year and had encountered the frigates during the night. Escaping pursuit in a fog, Révolution and Fraternité sailed directly for France and arrived at Rochefort on 13 January."]}, {"page": "Charles Austen", "response": ["Austen spent the next five years serving on the North American Station, before his promotion to captain on 10 May 1810 when he was given command of the 74-gun , which was then the flagship of Sir John Borlase Warren. Austen moved again the following September, joining . Between November 1811 and September 1814 Austen served as captain of , based at the Nore and flying the flag of Sir Thomas Williams. He was then given command of the 36-gun frigate  and after the outbreak of hostilities with France Austen was dispatched in command of a squadron with  and  to hunt a Neapolitan squadron suspected to be at large in the Adriatic. After Naples had surrendered Austen was active in the blockade of Brindisi. Lord Exmouth then sent him on to search of a French squadron, but with the end of the war with France in the intervening period he briefly turned his attention to suppressing piracy in the region. He successfully captured two pirate vessels in the port of Pavos, but disaster struck when the Phoenix was wrecked off Smyrna on 20 February 1816, through the ignorance of her pilots."]}, {"page": "HMS Unicorn (1794)", "response": ["Unicorn entered service in 1794 under the command of Captain William Cayley, who was followed in 1795 by Captain Thomas Williams. Under Williams, Unicorn served in the Western Approaches, operating from Cork. On 31 May, Unicorn,  and  shared in the capture of the Dutch schooner Mary, Captain Pierce, master."]}, {"page": "HMS Daedalus (1780)", "response": ["Captain Charles Henry Knowles recommissioned the Daedalus in March 1793, and sailed her to the Halifax station. Knowles was replaced by Captain Thomas Williams in September 1794, during which time Daedalus was part of Admiral Adam Duncan's fleet. In September 1795, Captain George Countess took over, and Daedalus sailed to the West African coast and then on to Jamaica. In January 1797, Daedalus was deployed against the French Expédition d'Irlande and on 8 January she was involved in the capture of the troopship Suffren and burnt her to avoid weakening the crew by dispersing them in the prize."]}, {"page": "Commander-in-Chief, Portsmouth", "response": ["The Commander-in-Chief, Portsmouth was a senior commander of the Royal Navy for hundreds of years. Portsmouth Command was a name given to the units, establishments, and staff operating under the post. The commanders-in-chief were based at premises in High Street, Portsmouth from the 1790s until the end of Sir Thomas Williams's tenure, his successor, Sir Philip Durham, being the first to move into Admiralty House at the Royal Navy Dockyard, where subsequent holders of the office were based until 1969. Prior to World War I the officer holder was sometimes referred to in official dispatches as the Commander-in-Chief, Spithead.", "* Admiral Sir Thomas Williams: 1833–1836"]}, {"page": "Admiral Williams", "response": ["*Thomas Williams (Royal Navy officer) (1761/1762–1841), British Admiral"]}, {"page": "Charles Inglis (Royal Navy officer, died 1833)", "response": ["Inglis was promoted to commander after this event, and was given command of the sloop  in October 1800, which was then lying at Rhodes. She went on to take part in operations against the French forces in Egypt. He was given command of the 10-gun cutter  in February 1801, and continued in the Mediterranean. He received the temporary captaincy of the 74-gun  in November 1801, during the brief absence of her captain, Sir Thomas Williams, and commanded her in the Baltic Sea. Inglis was promoted to post-captain on 29 April 1802 and commissioned the 32-gun  in June 1802."]}, {"page": "HMS Lizard (1757)", "response": ["In preparation for war, the frigate spent eight months as a receiving ship for sailors seized by a press gang for compulsory naval service. On returning to Spithead in June 1791 she was joined to a squadron of six ships of the line under the overall command of Admiral Hood, which was sailing for Jamaica with two regiments of the Coldstream Guards. The voyage proceeded without incident, and Lizard returned to Britain in September 1791 via the Scottish port of Leith, where her crew were discharged. Refitted at Portsmouth Dockyard, she was returned to sea in December 1792 for service during the War of the First Coalition against France. Under Captain Thomas Williams, the frigate was assigned to privateer hunting in the North Sea. In March 1793 she secured three successive victories, capturing the French privateers Les Trois Amis, Las Vaillant Custine and the 8-gun Le Sans-Cullotte, each of which was sent back to British ports as prize vessels. Despite these successes, the forty-year-old vessel was reaching the end of her seagoing career; after one final year in the North Sea she was returned to Portsmouth in May 1794 and permanently removed from active military roles."]}, {"page": "HMS Cambrian (1797)", "response": ["She was first commissioned in April 1797 under Captain Thomas Williams on the Irish station. Then under Captain Arthur Legge she served in the Channel, where she captured a number of French privateers."]}, {"page": "John Bligh (Royal Navy officer)", "response": ["Crown was chosen by Commodore William Cornwallis to fly his broad pennant in his new post in the East Indies, and Bligh sailed with her to this post. He spent several years on this station, being finally commissioned lieutenant on 25 June 1791 and appointed to the 32-gun  under Captain Thomas Troubridge. He returned to Britain aboard her in December 1791. He then joined the 28-gun  in 1792, under the command of Captain Sir Thomas Williams."]}, {"page": "Atlantic raid of June 1796", "response": ["At 02:00 in the morning of 8 June, the remaining ships of the French squadron were sailing approximately  southeast of the Scilly Isles when sails were sighted  distant. This was a small British frigate squadron from Kingsmill's command comprising the 36-gun HMS Unicorn under Captain Thomas Williams and HMS Santa Margarita under Captain Thomas Byam Martin, sent to patrol the area in search of French raiders. The British frigates had just seized a Swedish merchant ship carrying Dutch contraband from Surinam, which they sent to Cork under a prize crew and immediately set sail to intercept the French, who turned away, sailing in line ahead. Tribune led the line, a much faster ship than either of her consorts, holding back for mutual support, but as the morning passed and the British ships drew closer and closer Légėre fell out of the line to windward. Both British frigates passed the corvette at distance, although the smaller vessel remained in sight for sometime, eventually departing to attack a merchant sloop sailing nearby."]}, {"page": "French ship Sophie (1790)", "response": ["When Endymion captured Sophie, Sophie had been out 82 days, but had taken nothing. She was armed with 22 guns and had a crew of 130 men. Captain Thomas Williams, of Endymion, described Sophie as: ... a very fine Ship, quite new, and well adapted for His Majesty's Service, being an extraordinary fast Sailer; she having been chased Eight different Times during her last Cruize by our Ships of War, and each time escaped by superior Sailing."]}, {"page": "Chapman (1777 ship)", "response": ["1n 1798 Chapmans captain was Commander Robert Keen. On 21 June, Chapman joined a squadron of frigates under Sir Thomas Williams assisting troops under General Lake fighting Irish rebels near Wexford. The harbour was too shallow for Chapman to enter so Williams directed her to anchor close in shore to cover the squadron's boats blockading the harbour to prevent the rebels escaping. Williams then ordered Keen to land and with three gun-boats to occupy a fort at Roslare. He did so, driving 200 rebels out of the fort and capturing three cannons. The boats then pushed up the harbour and captured the vessels the rebels had gathered. In the meantime, Lake had occupied Wexford."]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["| Sir Thomas Williams GCB "]}, {"page": "Brooklands, Sarisbury", "response": ["The house was designed by John Nash in the Georigan style and built for Admiral Sir Thomas Williams of the Royal Navy. It was constructed around 1800, with a service wing was added to the north west of the house in 1807. The front was remodelled in the Italianate style in 1858 by the Isle of Wight architect Langdon. The entrance lobby and top floor was added in 1854. The interior features a double-flight stone staircase with cast-iron balustrades. Edwin Lutyens extended the house to the south east in 1916. The house is made from red brick and is partly rendered in stucco. The drawing room was lined with limed oak by Basil Ionides. Ionides also created a pair of bathrooms in the house, one of which has yellow tiles decorated with the signs of the zodiac. A bedroom on the second floor features decorated handmade tiles of fish designed by Hugh Casson. The first floor has six bedrooms, five of which are en-suite.  An additional four bedrooms are on the second floor."]}]}}