{"wiki_id": "http://www.wikidata.org/entity/Q7794308", "itemLabel": "Thomas Sydney Beckwith", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Sydney_Beckwith", "wikipedia_page": {"main": "Lieutenant-General Sir Thomas Sydney Beckwith  (17 February 1770 – 15 January 1831) was an English officer of the British Army who served as quartermaster general of the British forces in Canada during the War of 1812, and a commander-in-chief of the Bombay Army during the British Raj. He is most notable for his distinguished service during the Peninsular War and for his contributions to the development and command of the 95th Rifles.", "link_mentions": [{"page": "Battle of Plattsburgh", "response": ["There was some tension within the force between the brigade and regimental commanders who were veterans of the Peninsular War or of earlier fighting in Upper Canada, and Prévost and his staff. Prévost had not endeared himself by complaining about the standards of dress of the troops from the Peninsular Army, where the Duke of Wellington had emphasized musketry and efficiency above turnout. Furthermore, neither Prévost, nor de Rottenburg, nor Prévost's Adjutant General (Major General Edward Baynes) had the extensive experience of battle gained by their brigade commanders, and had already gained a reputation for caution and hesitancy.Hitsman, p.255 Prévost's Quartermaster General, Major General Thomas Sydney Beckwith, was a veteran of the early part of the Peninsular campaign and of operations in Chesapeake Bay in 1813, but even he was to be criticized, mainly for failures in intelligence."]}, {"page": "Charles James Napier", "response": ["Napier subsequently served in Bermuda, where the 102 Regiment was posted in 1812 to the Bermuda Garrison, stationed at St. George's Garrison. Bermuda, part of British North America, was the main base in winter of the North America station of the Royal Navy, and his brother Henry Napier, at the time a naval lieutenant serving on a frigate that belonged to the station, was frequently in Bermuda. The American War of 1812 commenced with a declaration of war by the United States as the regiment was leaving England. In 1813, Lieutenant-Colonel, Sir Thomas Sydney Beckwith arrived in Bermuda to command a force tasked with raiding the Atlantic Seaboard of the United States, specifically in the region of Chesapeake Bay, with Napier as his Second-in-Command. Beckwith split the force into two brigades, one, composed of the 102nd Regiment, Royal Marines, and a unit recruited from French prisoners-of-war, was under Napier's command, and the other under Lieutenant-Colonel Williams of the Royal Marines. They took part in the Battle of Craney Island on the 22 June, 1813. The 102nd Regiment was in Maine at the cessation of hostilities (the Treaty of Ghent was signed on 24 December 1814 by the negotiators, ratified by the Prince Regent on 27 December, and by the United States President on 17 February, ending the war)."]}, {"page": "New South Wales Corps", "response": ["Most of the regiment embarked for England in May 1810. In England, most of the returnees went to Veteran or Garrison battalions, most officers ending up in the 8th Royal Veteran Battalion. The regiment was reconstituted with new recruits after it arrived at its new base in Horsham in October 1810. It was sent to Guernsey in July 1811. The regiment was posted to the Bermuda Garrison (stationed at St. George's Garrison) in 1812 (this being part of the Nova Scotia Command), co-inciding with the start of the American War of 1812, and transferred to Nova Scotia in 1813. In the war the regiment took part in seaborne raids along the US Atlantic coast. In 1813, Lieutenant-Colonel, Sir Thomas Sydney Beckwith arrived in Bermuda to command a force tasked with raiding the Atlantic Seaboard of the United States, specifically in the region of Chesapeake Bay, with the 102nd Regiment's Commanding Officer, Lieutenant-Colonel Charles Napier, as his Second-in-Command. Beckwith split the force into two brigades, one, composed of the 102nd Regiment, Royal Marines, and a unit recruited from French prisoners-of-war, was under Napier's command, and the other under Lieutenant-Colonel Williams of the Royal Marines. They took part in the Battle of Craney Island on 22 June 1813. Detachments of the regiment remained on both sides of the border between the British colony of New Brunswick and the US State of Maine after the war's end in December 1814 (the Treaty of Ghent was signed on 24 December 1814 by the negotiators, ratified by the Prince Regent on 27 December, and by the United States President on 17 February, ending the war) at Moose Island, modern day Eastport, Maine, United States."]}, {"page": "Rifle Brigade (The Prince Consort's Own)", "response": ["* Thomas Sydney Beckwith – Officer in the 95th, served in the Peninsular War."]}, {"page": "Beckwith", "response": ["* Thomas Sydney Beckwith (1775–1831), British army officer"]}, {"page": "Recruitment in the British Army", "response": ["From 1798 onwards, structural, training and logistical reforms implemented or authorised by the Duke of York (as commander-in-chief of the army)  slowly improved the lot of the ordinary soldier. York oversaw a crackdown on corruptionThe Oxford History of the British Army, p.143 and removed the threat of corporal punishment for a large number of petty offences (while it was still retained for serious derelictions of duty). He also stamped down on the abuse of buying officer commissions, making it necessary for officers to serve two full years before either promotion or purchase to captain and six years before becoming a majorHolmes, R. (2002) Redcoat: The British Soldier in the Age of Horse and Musket pg 158 The establishment of the Royal Military Academy for officers was instigated due to York's influence,The Oxford History of the British Army, p.147 while regular recruits to the army were allowed to join under contract for limited periods, rather than for life. Men such as Sir John Moore, Thomas Sydney Beckwith and Rowland Hill characterised the new breed of officers who sought to improve the relationship between officers and men, motivating troops through mutual respect, reward and promotion rather than by relying on punishment. The Shorncliffe System for light infantry was established, being devised by Lt-Col Kenneth Mackenzie, and trained soldiers to think for themselves and act on initiative while the light infantry officers drilled alongside the men fostering comradeship. In addition, the introduction of new tactical and organisational flexibility contributed a great deal to the successes of the Peninsula and Waterloo."]}, {"page": "Light Division (United Kingdom)", "response": ["The Battle of Sabugal (3 April 1811), Craufurd had taken ill and was home in England so the Division was under the command of Major-General William Erskine, the plan was for the Light Division and two brigades of cavalry to circle behind the French open left flank while the other four divisions attacked the front. On the day of the battle there was a heavy fog, the other commanders decided to wait until visibility improved. Undeterred, Erskine ordered Lieut-Colonel Thomas Sydney Beckwith's 1st Brigade forward. Instead of crossing the Côa beyond the French, the brigade drifted to the left in the fog, crossed at the wrong location and struck the French left flank. "]}, {"page": "Thomas Plunket", "response": ["In 1817, Plunket was discharged from the 95th after recovering from the head wound he received at the Battle of Waterloo. Awarded a pension of 6d a day, he soon enlisted back into the army in a line regiment, 41st Foot. The regiment was being inspected by his former commanding officer, General Sir Thomas Sydney Beckwith when the general recognised Plunket and inquired into what had happened to him. He was invited to the officers mess that night and the next day was promoted to corporal, and soon also had his pension raised to one shilling a day with Beckwith's influence.Holmes, Richard (2001). Redcoat: The British Soldier in the Age of Horse and Musket Page 416, Harper and Collins He later renounced his pension in exchange for four years' pay and land in Canada, but he returned to England after a year, considering the land unsuitable."]}, {"page": "Battle of Sabugal", "response": ["Major-General William Erskine commanded the Light Division during the battle. Wellington planned to have the Light Division and two brigades of cavalry circle behind Reynier's open left flank while the other four divisions attacked in front. When the day dawned with heavy fog, the other commanders decided to wait until visibility improved. Undeterred, Erskine peremptorily ordered Lieut-Colonel Thomas Sydney Beckwith's 1st Brigade forward. Instead of crossing the Côa beyond Reynier's flank, the brigade drifted to the left in the fog, crossed at the wrong location and struck the French left flank."]}, {"page": "Thomas Sidney Beckwith", "response": ["#Redirect Thomas Sydney Beckwith"]}, {"page": "George Beckwith (British Army officer)", "response": ["His father was Major General John Beckwith, who commanded the 20th Regiment of Foot. His brothers were Captain John Beckwith, Thomas Sydney Beckwith and Brigadier General Ferdinand Beckwith. He was also the uncle of Major-General John Charles Beckwith."]}, {"page": "John Charles Beckwith (British Army officer)", "response": ["John Charles Beckwith, known as Charles Beckwith, was born in Halifax, Nova Scotia and was the eldest of ten children. He was the grandson of Major-general John Beckwith and nephew of the generals, Sir George Beckwith and Sir Thomas Sydney Beckwith. He attended the Halifax Grammar School with Captain Herbert Clifford."]}, {"page": "Bermuda Garrison", "response": ["The wars with France that had begun with the Revolution would drag on from 1793 to 1815. Meanwhile, the Royal Navy, British Army, Royal Marines, and Colonial Marines forces based in Bermuda did in fact carry out amphibious operations against the Atlantic coast of the United States during the 1812 to 1815 American War of 1812. In 1813, Lieutenant-Colonel, Sir Thomas Sydney Beckwith arrived in Bermuda to command a military force tasked with working with the Royal Navy in raiding the Atlantic Seaboard of the United States (where the Royal Navy was also blockading American ports), specifically in the region of Chesapeake Bay. The force, which was split into two brigades, was composed of the infantry regiment then on garrison duty in Bermuda, the 102nd Regiment of Foot, Royal Marines from the naval squadron, and a unit recruited from French prisoners-of-war. It took part in the Battle of Craney Island on the 22 June, 1813. A much larger naval and military force, 2,500 soldiers under Major-General Robert Ross aboard , three frigates, three sloops and ten other vessels, was sent to Bermuda in 1814, following British victory in the Peninsular War."]}, {"page": "Battle of Fuentes de Oñoro order of battle", "response": ["    Lt Col Thomas Sydney Beckwith"]}, {"page": "Sidney Beckwith", "response": ["#REDIRECT Thomas Sydney Beckwith"]}, {"page": "Governor Beckwith", "response": ["*Thomas Sydney Beckwith (1770–1831), Governor of Bombay from 1830 to 1831"]}, {"page": "St. George's Garrison, Bermuda", "response": ["The naval and military forces based in Bermuda also carried out amphibious operations against targets on or near to the Atlantic coast of the United States during the war. In 1813, Lieutenant-Colonel, Sir Thomas Sydney Beckwith arrived in Bermuda to command a military force tasked with working with the Royal Navy in raiding the Atlantic Seaboard of the United States, particularly in the region of Chesapeake Bay, with the aim of drawing American forces away from the border of the Canadas. The force, which was split into two brigades, was composed of the infantry regiment then on garrison duty in Bermuda, the 102nd Regiment of Foot, Royal Marines from the ships of the naval squadron, and a unit recruited from French prisoners-of-war. It took part in the Battle of Craney Island on the 22 June, 1813. "]}]}}