{"wiki_id": "http://www.wikidata.org/entity/Q7790834", "itemLabel": "Thomas Houldsworth", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Houldsworth", "wikipedia_page": {"main": "Thomas Houldsworth (13 September 1771 – 1 September 1852) was a Tory, and then Conservative Party, politician in England.  He was a Member of Parliament (MP) for 34 years, from 1818 to 1852.\nHouldsworth MP for Pontefract from 1818 to 1830, and then for the rotten borough of Newton in Lancashire from 1830 until the borough was disenfranchised at 1832 general election.  He was then elected for the Northern division of Nottinghamshire, and held that seat until he stepped down from the House of Commons at the general election in July 1852. He died two months later, aged 80.", "link_mentions": [{"page": "1000 Guineas Stakes", "response": ["| Thomas Houldsworth"]}, {"page": "Clay Cross", "response": ["Colliery owner Thomas Houldsworth, also a churchwarden for 25 years, built Alma House which stood in extensive parklands. The house was surrounded by railings and flat roof of indeterminate date. He was responsible developer of Clay Cross pits until 1850, and then the Alma Colliery in North Wingfield, after the Crimean War."]}, {"page": "Newton (UK Parliament constituency)", "response": ["| Thomas Houldsworth"]}, {"page": "Pontefract (UK Parliament constituency)", "response": ["|rowspan=\"2\" | Thomas Houldsworth||rowspan=\"2\" | Tory"]}, {"page": "Wishaw and Coltness Railway", "response": ["In 1836 Thomas Houldsworth, a Manchester entrepreneur, purchased the Coltness Estate, with its extensive mineral rights. At this time the Railway Company had run out of money to complete the building of their line. \"In order to allow the development of his minerals, Houldsworth agreed that if the company extended their line to Coltness, for which they would require to borrow £20,000 and to get an Act allowing an extension of time for construction, he would personally guarantee the interest on the loan, and pay £300 towards the Act. He also agree to give the necessary land on the Coltness Estate free (apart from compensation to tenants) and to send all his goods by the railway, if the Company charged him the prevailing rate.\" He also agreed to pay half of the payment to the Drysdale estate to buy out the prohibition on locomotives."]}, {"page": "North Nottinghamshire (UK Parliament constituency)", "response": ["|rowspan=\"4\"| Thomas Houldsworth"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Thomas Houldsworth; MP for North Nottinghamshire (1834–1852)"]}, {"page": "Houldsworth", "response": ["*Thomas Houldsworth, English politician"]}, {"page": "Destiny (horse)", "response": ["Destiny was a chestnut mare bred by Thomas Houldsworth of Farnsfield in Nottinghamshire. She was the fifth foal produced by Houldsworth's mare Fanny Davies, a winner of the Gold Cup at Pontefract. Fanny Davies was the grand-daughter of an unnamed mare by Hyacinthus who is regarded as the foundation mare of Thoroughbred family 2-f."]}, {"page": "Velocipede (horse)", "response": ["As a yearling, Velocipede was bought for £120 by William Scott on behalf of William Armitage. Scott had previously tried to offer the horse to Thomas Houldsworth but the colt was rejected as lacking strength and substance, with Houldsworth reportedly saying that he \"would not give sixpence for such a slight-legged one\". The horse was trained by Scott and his brother John at the Whitewall stables near Malton, North Yorkshire."]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|Thomas Houldsworth||"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Thomas Houldsworth||"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|rowspan=\"2\"|Pontefract(two members)||Thomas Houldsworth||"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|rowspan=\"2\"|Pontefract(two members)||Thomas Houldsworth||"]}, {"page": "Houldsworth, Thomas", "response": ["#redirectThomas Houldsworth"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| Thomas Houldsworth"]}]}}