{"wiki_id": "http://www.wikidata.org/entity/Q7793673", "itemLabel": "Thomas Rudolphus Dallmeyer", "itemDescription": "British optician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Rudolphus_Dallmeyer", "wikipedia_page": {"main": "Thomas Rudolphus Dallmeyer (16 May 1859 – 25 December 1906), English optician, was the son of John Henry Dallmeyer who ran an optics business. His maternal grandfather, Andrew Ross, was himself the first English photographic optician.", "link_mentions": [{"page": "F-number", "response": ["J. H. Dallmeyer's son, Thomas Rudolphus Dallmeyer, inventor of the telephoto lens, followed the intensity ratio terminology in 1899.Thomas R. Dallmeyer, Telephotography: An elementary treatise on the construction and application of the telephotographic lens, London: Heinemann, 1899."]}, {"page": "Telephoto lens", "response": ["Histories of photography usually credit Thomas Rudolphus Dallmeyer with the invention of the photographic telephoto lens in 1891, though it was independently invented by others about the same time; some credit his father John Henry Dallmeyer in 1860."]}, {"page": "John Henry Dallmeyer", "response": ["His second son, Thomas Rudolphus Dallmeyer assumed control of the business on the failure of his father's health."]}, {"page": "History of the single-lens reflex camera", "response": ["The photographic single-lens reflex camera (SLR) was invented in 1861 by Thomas Sutton, a photography author and camera inventor who ran a photography related company together with Louis Désiré Blanquart-Evrard on Jersey. Only a few of his SLRs were made. The first production SLR with a brand name was Calvin Rae Smith's Monocular Duplex (USA, 1884). Other early SLR cameras were constructed, for example, by Louis van Neck (Belgium, 1889), Thomas Rudolphus Dallmeyer (England, 1894) and Max Steckelmann (Germany, 1896), and Graflex of the United States and Konishi in Japan produced SLR cameras as early as 1898 and 1907 respectively. These first SLRs were large format cameras.Rudolf Kingslake: The Photographic Manufacturing Companies of Rochester, New York, p. 21Konishi: Sakura Reflex Prano; source The Japanese Historical Camera, p. 5 While SLR cameras were not very popular at the time, they proved useful for some work. These cameras were used at waist level; the ground glass screen was viewed directly, using a large hood to keep out extraneous light. In most cases, the mirror had to be raised manually as a separate operation before the shutter could be operated."]}, {"page": "Royal Photographic Society", "response": ["*1896 –  Thomas Rudolphus Dallmeyer"]}, {"page": "T. R. Dallmeyer", "response": ["#REDIRECT  Thomas Rudolphus Dallmeyer"]}, {"page": "Alan Dennis Clark", "response": ["After his university education, Alan Dennis Clark worked in the field of industrial optics initially as a designer, later as Marketing Director and MD of J.H. Dallmeyer Ltd., London (founded by John Henry Dallmeyer in 1860, later continued by Thomas Rudolphus Dallmeyer). He later founded his own company MSE GmbH in Bonn, Germany working as an optical designer and marketing consultant offering a range of services to various high tech companies. From 1992-2016: Co-founder & MD of Clark & Fischer-Clark GmbH, Neunkirchen, Germany."]}, {"page": "Dallmeyer", "response": ["** His son Thomas Rudolphus Dallmeyer (1859–1906), English optician"]}]}}