{"wiki_id": "http://www.wikidata.org/entity/Q7793440", "itemLabel": "Thomas Read Kemp", "itemDescription": "English property developer and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Read_Kemp", "wikipedia_page": {"main": "Thomas Read Kemp (23 December 1782 – 20 December 1844) was an English property developer and politician.", "link_mentions": [{"page": "Kemp Town", "response": ["Kemp Town is a 19th-century residential estate in the east of Brighton in East Sussex, England, UK. Conceived and financed by Thomas Read Kemp, it has given its name to the larger Kemptown region of Brighton. The majority of the original estate is now demarcated by the modern Kemp Town Conservation Area as defined by the local authority, Brighton and Hove City Council.Kemp Town Conservation Area"]}, {"page": "Brighton", "response": ["Brighton Town Hall occupies a large site in The Lanes. Medieval Brighthelmston had a town hall, although it was called the Townhouse and functioned more like a market hall. A later building (1727) known as the Town Hall was principally used as a workhouse. Work on the first purpose-built town hall began in 1830; Thomas Read Kemp laid the first stone, and Thomas Cooper designed it on behalf of the Brighton Town Commissioners (of which he was a member). Brighton Corporation spent £40,000 to extend it in 1897–99 to the Classical design of Brighton Borough Surveyor Francis May. Despite this, the building was too small for municipal requirements by the mid-20th century, and extra council buildings were built in locations throughout Brighton Borough Council's existence: the most recent, Bartholomew House and Priory House next to the town hall, were finished in 1987. The town hall ceased to be responsible solely for Brighton's affairs when Brighton and Hove were united in 1997, but it is still used by Brighton & Hove City Council—particularly for weddings and civil ceremonies."]}, {"page": "List of United Kingdom MPs: K", "response": ["*Thomas Read Kemp"]}, {"page": "Herstmonceux Castle", "response": ["*1807 - Purchased by Thomas Read Kemp."]}, {"page": "Kemptown, Brighton", "response": ["The area takes its name from Thomas Read Kemp's Kemp Town residential estate of the early 19th Century, but the one-word name now refers to an area larger than the original development and is more correctly King's Cliff. Much of the housing is slightly later but still of the Regency style, although there is also Victorian architecture and some more modern buildings. Conversions of grand Regency buildings into flats and bars has provided Kemptown with some distinctive properties; one club is housed within the Sassoon Mausoleum, the former burial chamber of Edward Sassoon."]}, {"page": "Sir Francis Baring, 1st Baronet", "response": ["*Frances (1783-8 Mar 1825), she married Thomas Read Kemp MP for Lewes. They had four sons, and six daughters."]}, {"page": "Lewes (UK Parliament constituency)", "response": ["|rowspan=\"2\"|Thomas Read Kemp", "|rowspan=\"2\"|Thomas Read Kemp"]}, {"page": "John George Dodson, 1st Baron Monk Bretton", "response": ["Lord Monk Bretton married Caroline-Florence, second daughter of William John Campion of Danny, Hurstpierpoint, Sussex, by Harriet Kemp (daughter of Thomas Read Kemp) in 1856. They had one son and three daughters. They lived at 6, Seamore Place in Mayfair, and at Conyboro', near Lewes, Sussex. In 1878 Edward Walford described Seamore Place as follows: \"Seamore Place is the name of a row of handsome but somewhat old-fashioned mansions, which occupy a sort of cul de sac at the western end of Curzon Street. They are only nine in number, and their chief fronts look westward over Hyde Park\". Lord Monk Bretton died in May 1897, aged 71, and was succeeded in the barony by his only son John William Dodson."]}, {"page": "Arundel (UK Parliament constituency)", "response": ["| 1823 || Thomas Read Kemp || Whig"]}, {"page": "Charles Eamer Kempe", "response": ["Charles Kempe was born at Ovingdean Hall, near Brighton, East Sussex in 1837. He was the youngest son of Nathaniel Kemp (1759–1843), a cousin of Thomas Read Kemp, a politician and property developer responsible for the Kemptown area of BrightonKempe added the 'e' to his name in adult life and the maternal grandson of Sir John Eamer, who served as Lord Mayor of London in 1801. The fact that Kempe's father was almost eighty when he was born coloured his life and attitudes.Books by Barlow."]}, {"page": "Brunswick, Hove", "response": ["Originally, the area had been part of Wick Farm. Then in the late 18th and early 19th centuries, nearby Brighton had become very fashionable, especially amongst the top tier of British society. The Kemp Town estate there had been a success, and so in 1824 architect Charles Busby entered into an agreement to build houses on land lying at the extreme east of Hove, adjacent to Brighton — land which belonged to Thomas Read Kemp, creator of Kemp Town.Brunswick Town, by Judy Middleton, 2001. The name \"Brunswick\" was presumably taken from House of Brunswick, a term sometimes used for the House of Hanover, the name of the British royal family at the time."]}, {"page": "List of places of worship in Brighton and Hove", "response": ["|Thomas Read Kemp laid out the Kemp Town estate on the cliffs east of Brighton in the 1820s.  In 1824 he enlisted Charles Busby to build a church; construction cost £11,000 and took two years.", "|Amon Wilds built a Greek Doric-style chapel in 1817 for an independent Christian sect founded by prominent local resident Thomas Read Kemp.  It was reconsecrated as an Anglican church in 1829.  Rev. Frederick W. Robertson achieved national fame for his radical, unorthodox sermons in the mid-19th century, and the church was popular with Brighton's high society.  It was rebuilt in the 1880s in the Gothic Revival style with a tall octagonal tower and knapped flint walls.  The church closed in 1984 and is now an art gallery."]}, {"page": "St Nicholas Church, Brighton", "response": ["Between 1878 and 1887, a number of stained glass windows were designed and installed. The noted designer Charles Eamer Kempe, a cousin of Thomas Read Kemp, the developer of Brighton's Kemp Town estate, was responsible for many of these; another was donated by Somers Clarke in memory of Rev. Wagner, who had died in 1870. Also during this period, the east window installed by Carpenter was replaced with a Perpendicular-style window. The original window was taken to the relatively new Church of the Annunciation in the Hanover area of the town."]}, {"page": "John Dodson, 2nd Baron Monk Bretton", "response": ["| align=\"center\"| Maternal Great-grandfather:Thomas Read Kemp (1782–1844), of Kemptown, Brighthelmston (Brighton)."]}, {"page": "St John the Baptist's Church, Hove", "response": ["The land on which the Brunswick estate was built was originally a farming estate known as Wick Farm.  It was sold to Thomas Read Kemp, who had been responsible for the Kemp Town residential development in neighbouring Brighton, in 1825.  Some houses had been built the previous year, and Read Kemp is believed to have planned to create a similar exclusive development on this land; but little happened until after it had been sold to the Jewish baronet Sir Isaac Lyon Goldsmid in 1830.  Even then, it took another 20 years for the scheme to be altered and started properly."]}, {"page": "St George's Church, Brighton", "response": ["St George's Church is an Anglican church in the Kemptown area of Brighton, in the English city of Brighton and Hove.  It was built at the request of Thomas Read Kemp, who had created and financed the Kemp Town estate on the cliffs east of Brighton in the early 19th century, and is now regarded as the parish church of the wider Kemptown area. It is a Grade II listed building.", "Thomas Read Kemp, born in 1782 in Lewes, East Sussex, returned to the Church of England in 1823, seven years after founding his own independent sect.  Turning his attention to architecture and town planning, he decided to create a residential estate on land beyond the existing eastern boundary of Brighton, with large houses for affluent people.  Designed by Charles Busby and Amon Wilds and built by Thomas Cubitt, this estate became Kemp Town, although Kemp had fled the country to escape debts by the time construction finished."]}, {"page": "Index of World War II articles (T)", "response": ["# Thomas Read Kemp"]}, {"page": "All Saints Church, Patcham", "response": ["Elsewhere in the church, three generations of the Paine family are commemorated by tablets in the chancel; John Paine of the second generation rebuilt Patcham Place in 1764.  He was the uncle by marriage of Thomas Read Kemp, who developed Brighton's high-class Kemp Town estate in the 19th century.  The Roe family and its descendants of Withdean are also represented.  William Roe and his son William Thomas Roe were closely involved with the former Board of Customs (now Her Majesty's Customs and Excise); William Roe was its chairman for 14 years.  William Thomas Roe also served on The Board of Admiralty.  His son, his daughter's husband and their son also have their own memorials.  The manor of Withdean Cayliffe, one of the manors within the parish of Patcham, passed through the family after William Roe acquired it in 1794."]}, {"page": "Ovingdean Hall School", "response": ["In 1788, Nathaniel Kemp – at the age of 27 – bought a plot of land of  in the centre of Ovingdean village. He built Ovingdean House there during 1792 at the cost of £2653-10s-0d (approx). The house was later home of stained glass artist Charles Eamer Kempe (1837–1907) and Thomas Read Kemp (1783–1844), the founder of Kemp Town in Brighton."]}, {"page": "Fife House", "response": ["Fife House was originally built in 1828 by Thomas Cubitt, as part of the Kemp Town estate planned by Thomas Read Kemp, and designed by Charles Busby and Amon Wilds. It was bought in 1829 by the William Cavendish, 6th Duke of Devonshire. He had the property, situated at 1, Lewes Crescent, joined internally by Thomas Cubitt, using workmen from Chatsworth, to an adjacent property he also owned at 14, Chichester Terrace.Daily Telegraph Oh my lord! 10 July 2006  The Duke had the property redecorated by John Gregory Crace in 1848, and lived there until his death in 1858."]}, {"page": "Holy Trinity Church, Brighton", "response": ["The former Holy Trinity Church is a closed Anglican church in the centre of Brighton, part of the English city of Brighton and Hove.  Established in the early 19th century by Thomas Read Kemp, an important figure in Brighton's early political and religious life, it was originally an independent Nonconformist chapel but became an Anglican chapel of ease when Kemp returned to the Church of England.  The church closed in 1984, but was converted into a museum and later an art gallery.  Reflecting its architectural and historical importance, it has been listed at Grade II since 1981.", "Thomas Read Kemp, born in nearby Lewes in 1782, was heavily involved in Brighton's development in the first decades of the 19th century, until he left the country in 1837 to escape his debts.  He became the Member of Parliament for Lewes in 1811, but left both the position and the Church of England in 1816 to found an independent Christian sect in Brighton.  He moved to the town in 1819, became a major landowner, magistrate, town official and the developer of the high-class Kemp Town estate which still bears his name.", "The original building of 1817 was in the Doric style and featured a square tower and a portico with four Doric columns.  When Rev. Robert Anderson bought the church from Thomas Read Kemp in 1825, he removed this feature and extended the building northwards.  There were more alterations in 1855, and the widening of Duke Street (which runs along the south side of the church) made the southern face visible for the first time.  This has a series of round-headed, blank-faced arches.  Also at this time, the chancel was built to replace the vestry.  Its three round-arched lancet windows are prominent on the eastern façade."]}, {"page": "Grade I listed buildings in Brighton and Hove", "response": ["|Thomas Read Kemp, who conceived and financed Kemp Town, lived at Number 22 for 10 years from 1827.  All but two of the houses in the U-shaped terrace have three-window façades; Numbers 25 and 26 span a nine-window range between them.  On the east and west sides, six houses jut forwards and feature Composite pilasters of the giant order."]}, {"page": "Holland Road Baptist Church", "response": ["The Wick estate was a large area of land north of the ancient village of Hove.  Sir Isaac Lyon Goldsmid, part of the Goldsmid banking dynasty, bought most of the land for development in 1830.  The estate was  in size and consisted of farmland, pastures and woodland, all centred on Wick Farm.  Its boundaries were the parish of Brighton, the road along the seafront, the Stanford estate (a similar landholding, owned by Sir William Stanford) and Dyke Road at the boundary of the parish of Preston.  The Wick estate was first described in print in 1247, and it passed through many owners in the next six centuries; Anthony Stapley, one of the regicides of King Charles I, held it for nearly 50 years.  In 1830, Thomas Scutt and Thomas Read Kemp owned the land, and a portion on the south side was used to build the Brunswick estate.  They sold the remaining  to Goldsmid for £55,525 (£ as of )."]}, {"page": "Amon Wilds", "response": ["In 1815, both men moved to Brighton, where their partnership grew and took on more work.  They continued to work in both towns until 1820, after which they concentrated exclusively on Brighton. By this time, Wilds senior had completed two buildings on behalf of Thomas Read Kemp, who later proposed and funded the Kemp Town estate.  He was a wealthy Brighton resident who had been Member of Parliament for Lewes until 1816, when he resigned, left the Church of England and found a Nonconformist sect.  He commissioned Wilds senior to build a chapel for him; although it was later reconsecrated as an Anglican church (under the name Holy Trinity Church) and has been altered externally, it still exists (as an art gallery) and is Grade II-listed.  Wilds senior's design was Greek Revival, featuring a four-column portico of the Doric order and a large square tower. In 1819, Kemp decided to move from Herstmonceux to Brighton, and asked Wilds senior to design a house for him on land he owned in what later became the Montpelier suburb.  As its dimensions matched those of Solomon's Temple, it was called \"The Temple\".  Square and two-storeyed, with five bays on each side and a recessed upper storey, it became a school in 1828 and is now the Brighton and Hove High School.  It is listed at Grade II."]}, {"page": "Bristol Road Methodist Church", "response": ["Brighton's first Methodist church opened in 1808 in Dorset Gardens off St James's Street, a recently developed road east of the Old Steine and the Royal Pavilion.  By the 1870s, housing had spread much further east, and the area between Thomas Read Kemp's high-class Kemp Town estate and the earlier development around St James's Street had been filled in with high-density housing.  The area became known as Kemptown .  In 1872, Reverend J. Martin, a Methodist minister, proposed the construction of a new church to serve this area.  Architect Thomas Lainson, who also designed several buildings (including a Congregational church) in Hove and the Middle Street Synagogue in Brighton, was commissioned to draw up a design.  He submitted this on 1 March 1872.  A builder named John Fielder was responsible for construction, which continued through 1873.  A stone tablet (now partly illegible) at the base of the tower, dated 7 October 1873, names Lainson, Fielder and Reverend Martin, and bears the inscription ."]}, {"page": "St Mark's Church, Brighton", "response": ["Brighton's rapid growth in the early decades of the 19th century resulted in residential development filling in the gap on the cliffs between Thomas Read Kemp's high-class Kemp Town estate and the longer-established area around the Royal Pavilion and Old Steine, the centre of high society activity in the late 18th century.  Roads such as Eastern Road and Bristol Road ran from west to east towards Kemp Town, and high-density housing branched off on roads to the north and south.  This area became known as Kemptown .  Kemp owned much of the land in the area, but in the 1820s he sold about  to Frederick Hervey, 1st Marquess of Bristol.  He had succeeded to the Earldom of Bristol when his father, the 4th Earl of Bristol (known as the Earl-Bishop), died in 1803.  The Marquess, who assumed that title in 1826, was interested in church-building and works of charity.  Soon after buying the land, he gave a portion to Reverend Henry Venn Elliott to allow him to build St Mary's Hall School.  In 1837, Reverend Elliott began to plan for an Anglican church to serve the area, and the Marquess gave more land next to the school to allow one to be built there.  Construction started in 1838, and the Marquess spent about £2,000 (£ in ) to ensure a rapid completion.  However, disagreements soon arose over these plans: the Diocese of Chichester had not approved the proposal to open the church to the public, and had only given permission for the building to be a private chapel for the school; and the Vicar of Brighton, Reverend Henry Michell Wagner, disapproved of its location—it was considered to be too close to St George's Church.  Correspondence and debate carried on for several years between the men involved, and an independent party—the Commissioners for Building New Churches—eventually had to take charge of the project."]}, {"page": "Grade II listed buildings in Brighton and Hove: A–B", "response": ["| [A]||Kemptown||100px||Thomas Cubitt built the square on land given to him by Thomas Read Kemp as payment in kind for Cubitt's work on the Kemp Town estate two decades earlier.  These four houses are stuccoed with three storeys, dormers and basements.  The ground floors are treated with rusticated decoration.  There is a split cast-iron balcony and Ionic columns.||", "| ||Montpelier||100px||Attributed to Amon Wilds, this was built in 1819 as Thomas Read Kemp's house.  The dimensions were based on those of Solomon's Temple.  It became a boys' academy in the 1830s and a girls' school in 1880.  Major alterations began in 1911, but Egyptian-style touches remain on the exterior.||"]}, {"page": "Park Crescent, Brighton", "response": ["Major changes happened in 1822 after the Prince Regent—the most enthusiastic player and supporter of cricket among Brighton's high society—became king and retired from the sport.  The Prince of Wales Ground fell into disuse at this time. Meanwhile, The Level was granted to the town by its landowners, who included influential local clergyman, politician, property speculator and Lord of the Manor Thomas Read Kemp.  Union Road was built from east to west connecting the London and Lewes Roads, and the  area to its south was landscaped by Amon Henry Wilds and landscape gardener Henry Phillips.  The  part to the north was bought by a speculator, James Ireland, who built the Royal Gardens—a multi-purpose pleasure garden with a new cricket ground (the Royal New Ground).  The gardens opened on 1 May 1823."]}, {"page": "Grade II listed buildings in Brighton and Hove: C–D", "response": ["| ||Round Hill||100px||Thomas Read Kemp donated land off the Ditchling Road to Brighton's Jewish community in 1826.  They established a cemetery there, and commissioned Thomas Lainson to build an octagonal brick chapel in 1893.  It has a tiled roof, a pedimented entrance and corbelled brick piers at each corner, and is reminiscent of the Queen Anne style.  The chapel and cemetery are now closed and derelict.||", "| [A]||Kemp Town||100px||Thomas Cubitt built these four houses in about 1845 on land given to him by Thomas Read Kemp in lieu of payment for the work he undertook on the Kemp Town estate.  They are treated as two pairs and have different designs, although the cornice is continuous across the whole terrace.  Numbers 23 and 25 have three storeys with three windows each and a large segmental bay front.  Their doors are set in Tuscan-pilastered porches.  There are cast iron balconies to the first floor.  Numbers 27 and 29 have a two-window range.||"]}, {"page": "Buildings and architecture of Brighton and Hove", "response": ["Brighton, Hove, Brunswick Town and Portslade have each had a town hall, but only those at Hove and Brighton are still in use and Hove's was rebuilt after a fire.  Medieval Brighthelmston used a building (called the Townhouse) which was more of a market hall, and a later building (1727) known as the Town Hall was principally used as a workhouse. Work on the first purpose-built town hall began in 1830; Thomas Read Kemp laid the first stone, and Thomas Cooper designed it on behalf of the Brighton Town Commissioners (of which he was a member).  Brighton Corporation spent £40,000 to extend it in 1897–99, to the design of Francis May.  Its severe Classical design, with huge Ionic columns and wide staircases, was criticised in the 19th century, and May's infilling of the cruciform building's wings affected the composition's symmetry.  Nevertheless, English Heritage has awarded it Grade II listed status."]}, {"page": "George Faithfull", "response": ["Faithfull was a solicitor and partner in G & H Faithfull & Co., one of the three largest law firms in Brighton.National Archives He became involved in the public life of the rapidly expanding town as solicitor to Thomas Read Kemp, developer of the Kemp Town Estate. He was subsequently a member of the Brighton Improvement Commissioners. Kemp had established his own non-conformist sect, and Faithfull was a regular preacher in the chapel in Ship Street, Brighton. When Kemp returned to the Church of England in 1823, Faithfull became minister of the Ship Street Chapel (later called Holy Trinity Church, in 1827 replacing it with a new building in Church Street."]}, {"page": "Grade II listed buildings in Brighton and Hove: E–H", "response": ["| [A]||Kemptown||100px||Thomas Read Kemp's development of the Kemp Town overstretched his finances, and he conveyed a large area of land west of it to builder Thomas Cubitt in lieu of payment for his work.  Cubitt built Eaton Place, a terrace running north from the seafront, on this land between 1846 and 1855.  The houses on the west side have three storeys and an attic floor, bow fronts, cast iron balconies, sash windows and rusticated decoration.||", "| ||The Lanes||100px||The core of this redundant church dates from 1817, but its external appearance is based on Clarke and Micklethwaite's 1885–87 overhaul, which changed the originally Classical-style preaching house into a Perpendicular/Decorated Gothic Revival landmark.  Its knapped flint and stone façade (facing east) contrasts with the stucco surviving on the south-facing side wall.  Thomas Read Kemp founded the chapel for a short-lived Nonconformist sect he led; after he returned to the Church of England, the building was reconsecrated for that denomination.  It closed in 1984 and became the Fabrica art gallery.||"]}, {"page": "Pelham Institute", "response": ["Thomas Read Kemp's Kemp Town estate, \"arguably the most famous district in Brighton\", was developed as a carefully planned estate of about 100 grand houses for the rich people who were increasingly attracted to the fashionable resort.  Kemp Town was isolated from the rest of the town, about  away, and an old trackway running west–east along the inland side of the East Cliff developed into an important route—Eastern Road."]}, {"page": "List of conservation areas in Brighton and Hove", "response": ["The city has existed in its present form only since 2000, when Queen Elizabeth II granted city status to the unitary authority of Brighton and Hove, which was in turn created in 1997 by the amalgamation of Brighton and Hove Borough Councils. Before 1997, the two councils were separately responsible for creating and administering conservation areas.  Hove Borough Council designated the first two, in 1969: Charles Busby's expansive self-contained Brunswick Town estate, with a twin-terrace centrepiece \"as grand as anything in St Petersburg\", and the rapidly developed mid-19th-century suburb of Cliftonville, characterised by Italianate villas and large Tudorbethan houses. The following year, Brighton Borough Council set up conservation areas to preserve and improve the historic centres of five ancient downland villages—Ovingdean, Patcham, Preston, Rottingdean and Stanmer—which became part of the urban area in 1928 and 1952 because of boundary changes.  Brighton's own architectural set-piece, Thomas Read Kemp's \"striking, [...] graceful and imposing\" Kemp Town estate of the mid-1820s, by Busby and Amon Wilds, was designated at the same time."]}]}}