{"wiki_id": "http://www.wikidata.org/entity/Q7794530", "itemLabel": "Thomas Traill", "itemDescription": "Royal Air Force officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Traill", "wikipedia_page": {"main": "Air Vice Marshal Thomas Cathcart Traill,  (6 August 1899 – 1 October 1973) was a senior Royal Air Force officer. He began his military career as a midshipman in the Royal Navy, transferred to the Royal Flying Corps in 1917 and rose to the rank of captain during the First World War, becoming a flying ace credited with eight aerial victories. He remained in the newly formed Royal Air Force after the war; by the time he retired in 1954, he had risen to the rank of air vice marshal.", "link_mentions": [{"page": "No. 20 Squadron RAF", "response": ["*Air Vice-Marshal Thomas Traill, "]}, {"page": "Supreme Allied Commander Atlantic", "response": ["*Air Commander North-East Atlantic Sub-Area : Air Vice Marshal Thomas Traill, CB, OBE, DFC, Royal Air Force (AOC No. 19 Group RAF)"]}, {"page": "Traill (surname)", "response": ["* Thomas Traill (1899–1973), British World War I flying ace "]}, {"page": "Heveningham", "response": ["*Air Vice Marshal Thomas Traill (1899–1973) and the actor Stratford Johns ended their lives in the village."]}, {"page": "List of World War I aces credited with 8 victories", "response": ["| Thomas Traill"]}, {"page": "Leslie William Burbidge", "response": ["On 21 February 1918, Burbidge was transferred to Home Establishment. He rejoined 20 Squadron in September. He was flying with Thomas Traill when they destroyed a Fokker D.VII north of Saint Quentin on 29 September 1918. He was also flying with Traill when they collided with another \"Brisfit\", losing part of a wing; Burbidge climbed out onto the opposite wings, which stabilized their broken plane enough for Traill to be able to crash-land. Burbidge was slightly injured, breaking his nose and biting through his tongue.Franks et.al. (1997)"]}, {"page": "Alexander Beck (RAF officer)", "response": ["*Thomas Traill"]}, {"page": "List of World War I flying aces from Argentina", "response": ["* Lieutenant Thomas Traill, 8 victories scored piloting Bristol F.2 Fighters in the RAF."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Thomas Traill"]}, {"page": "Thomas Cathcart Traill", "response": ["#REDIRECT Thomas Traill"]}, {"page": "No. 19 Group RAF", "response": ["In 1953, initial NATO documents instructing Admiral Creasey, newly appointed Commander-in-Chief, Eastern Atlantic Area (CINCEASTLANT), wrote that Air Vice Marshal Thomas Traill, CB, OBE, DFC, Royal Air Force, Air Officer Commanding No. 19 Group RAF, had been appointed as Air Commander North-East Atlantic Sub-Area.http://archives.nato.int/uploads/r/null/1/2/123871/SGM-1204-53_ENG_PDP.pdf"]}, {"page": "Church of St Margaret, Heveningham", "response": ["* Air Vice-Marshal Thomas Traill, senior RAF officer, is buried in the churchyard."]}, {"page": "Traill, Thomas", "response": ["#redirectThomas Traill"]}]}}