{"wiki_id": "http://www.wikidata.org/entity/Q7791579", "itemLabel": "Thomas Knowles", "itemDescription": "English businessman and Conservative politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Knowles", "wikipedia_page": {"main": "Thomas Knowles (30 May 1824 – 3 December 1883) was an English businessman and Conservative politician who sat in the House of Commons from 1874 to 1883.\nKnowles was born at Ince-in-Makerfield, the son of a colliery underlooker. According to his obituary, he began work at the age of nine, working up to fifteen hours a day for wages of half-a-crown a week, from which his father allowed him threepence a week pocket money. He spent two of the three pence on night school fees and rose through the ranks; collier, then underlooker, then (in 1847) colliery manager at Ince Colliery. In 1854, he became a partner in the colliery (then employing 200); when in 1873 the colliery (together with an associated ironworks at Warrington) became a limited liability company, Knowles became its chairman.Knowles was in business in Lancashire with interests in coal mining, cotton spinning and bleaching. He was chairman of Pearson and Knowles Coal and Iron Company and served for two years as chairman of the Mining Association of Great Britain.  He was also a director of the London and North Western Railway, and of the Manchester and Liverpool District Banking Company.  He was a J.P. for Lancashire and Cheshire. In 1864 and 1865, he was Mayor of Wigan.At the 1874 general election Knowles was elected Member of Parliament for Wigan. He held the seat until his death at the age of 59 in 1883.Knowles married firstly Mary Foster in 1846 and secondly Mary Longworth in 1866, daughter of William Longworth of Little Bolton, Lancashire.  The brothers Thomas Fielden and Edward Brocklehurst Fielden, both themselves Members of Parliament, were sons-in-law", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["***Edward Brocklehurst Fielden (1857–1942, brother of Thomas), Conservative MP for Middleton 1900–06 and Manchester Exchange 1924–35; married Mary Ellen, daughter of Thomas Knowles (1824–83), MP for Wigan 1874–83"]}, {"page": "List of United Kingdom MPs: K", "response": ["*Thomas Knowles "]}, {"page": "Wigan (UK Parliament constituency)", "response": ["|rowspan=\"4\"| Thomas Knowles"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Thomas Knowles"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| Thomas Knowles"]}, {"page": "Mary Morris Knowles", "response": ["In 1767, at the age 34, Mary Morris married Thomas Knowles, a Quaker apothecary from Yorkshire, but she resolved not to become ‘a poor passive machine ... a mere smiling Wife.’ Despite her earlier resistance to marriage, she wed happily. By April 1768 she was six months pregnant. She experienced a difficult childbirth, and recorded her fears and sufferings through letters and heroic poems. In July 1768 Mary almost died delivering her son, Morris, who lived for one day. After her recovery from the childbirth, Mary and Thomas moved to Birmingham, which was closer to her mother as well as offering an expanding array of economic, social, and cultural opportunities. It is here that she changed their lives through her artistic accomplishment, despite the deaths of her younger sister and mother.", "After Thomas Knowles finished his study in Edinburgh, both he and Mary continued on to the Leyden University so he could take his degree. After submitting his thesis in Latin he obtained his degree and the couple toured Europe before settling in London, where he became a successful physician, and she became a sought-after participant in the dynamic cultural life of the capital. On 5 March 1773, at the age of 40, Mary gave birth to a baby boy, named George in honor of the King.Public Record Office, RG 6, 329, \"Births of the People of God called Quakers in and about the City of London and Westminster, the County of Middlesex and the Borough of Southwark,\" vol. 3, 1773. In the same year Thomas became a member of the newly established Medical Society.Thomas Hunt ed., The Medical Society of London, 1773-1973 (London, 1972), pp. 1-6. In the following year he became a Licentiate of the Royal College of Physicians, thus entering into the highest ranks of the English medical profession.Sir George Clark, A History of the Royal College of Physicians of London (3 vols, Oxford, 1966), vol. 2, pp. 443-72. With the Knowles' move to the capital, Mary expanded her connections to include influential men, such as the Dilly brothers and a religious scholar, Dr. John Calder. Through influential friendships and social interactions, Mary entered into the cultural transformations that were changing public life in late Eighteenth Century London.", "====Lombard Street, abolition, and the death of Thomas Knowles====", "On 16 November 1786, Thomas Knowles died at the age of 52 from a fever that he caught from one of his patients.Records and Recollections of James Jenkins p. 202 leaving behind Mary at the age of 53 and their son George, age 13. He left behind his medical practice, his home and his position in the Eastern Dispensary in Alie Street, Whitechapel; which was known for treating poor patients."]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|Thomas Knowles"]}, {"page": "Birkenhead Park FC", "response": ["* Thomas Knowles (1930)"]}, {"page": "Thomas Fielden (politician)", "response": ["In 1878 he married Martha, daughter of Thomas Knowles of Darn Hall, Cheshire, who was Member of Parliament for Wigan"]}, {"page": "Edward Fielden (politician)", "response": ["Fielden was twice married. He married firstly, in 1884, Mary Ellen Knowles, a daughter of Thomas Knowles of Darn Hall, Cheshire, who was MP for Wigan, by whom he had three sons and one daughter. She died in London on 31 May 1902. He married secondly, in 1906, Mysie, daughter of William Theed. The latter predeceased her husband by three weeks in 1942."]}, {"page": "Joshua Fielden (politician)", "response": ["* Thomas Fielden (1854–1897) was MP for Middleton, which included the Lancashire portion of Todmorden, from 1886 to 1892, and 1895 and 1897.  He married Martha Knowles, daughter of Thomas Knowles (MP for Wigan), in 1878.", "* Edward Brocklehurst Fielden (1857–1942) was MP for Middleton from 1900 to 1906, and for Manchester Exchange from 1924 to 1935. He married Mary Ellen Knowles, another daughter of Thomas Knowles, in 1884."]}, {"page": "Nathaniel Eckersley", "response": ["He was elected as one of the two Members of Parliament (MPs) for Wigan at a by-election in March 1866, following the resignation of the Conservative MP Hon. James Lindsay. Nominations for the contest took place in the moot hall in Wigan, supervised by the Mayor Thomas Knowles. The candidates then addressed the voters in the town hall. Eckersley offered himself as a \"free and independent candidate\", and said that until then he had never considered himself to be a politician. The Mayor called for a show of hands, which he found to be in favour of Eckersley, but a poll was demanded and Eckersley won 411 votes to the 349 cast for his Liberal opponent John Lancaster.", "Following the death in December 1883 of Wigan's other Conservative MP Thomas Knowles, Eckersley was returned unopposed at the resulting by-election on 21 December 1883. He held the seat until when Wigan's parliamentary representation was reduced from two seats to one by the Redistribution of Seats Act 1885, and did not contest the 1885 general election."]}, {"page": "Knowles, Thomas", "response": ["#redirectThomas Knowles"]}]}}