{"wiki_id": "http://www.wikidata.org/entity/Q7793544", "itemLabel": "Thomas Rider", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Rider_(MP_for_Kent)", "wikipedia_page": {"main": "Thomas Rider (20 August 1785 – 6 August 1847) was a British Whig politician who held a seat in the House of Commons from 1831 to 1835. He was the eldest son of Ingram Rider of Leeds, Yorkshire and educated at Charterhouse School (1776) and University College, Oxford (1783).", "link_mentions": [{"page": "List of Old Carthusians", "response": ["*Thomas Rider (1785–1847), MP for Kent (1831–1832) and West Kent (1832–1835)"]}, {"page": "West Kent (UK Parliament constituency)", "response": ["| Thomas Rider"]}, {"page": "High Sheriff of Kent", "response": ["| Sir Thomas Rider, Kt., of Boughton Moun Chelsea"]}, {"page": "Kent (UK Parliament constituency)", "response": ["| Thomas Rider"]}, {"page": "Thomas Rider", "response": ["Thomas Rider  may refer to:", "* Thomas Rider (MP for Kent) (1785–1847)", "*Thomas Rider (MP for Windsor), 16th century MP for Windsor", "*Thomas Rider (MP for Maidstone) (c. 1648 - by Sep 1704), MP for Maidstone"]}, {"page": "Boughton Monchelsea Place", "response": ["Boughton Monchelsea Place, previously Boughton Court, is a 16th-century country house in Boughton Monchelsea, Kent, England. The first part of the house was built by Robert Rudston circa 1567–75 on the site of an earlier manor house. It has been modified a number of times during its history achieving its present form in 1819. It has been a home to a number of members of parliament for Maidstone or for Kent, including Sir Francis Barnham (owner 1613–46), Sir Robert Barnham (1646–85) Sir Barnham Rider (1698–1728) and Thomas Rider (1805–47).", "Rudston's son Isaac next owned the house. On his death without a son, he left the house to his brother Belknap Rudston, who, on his death in 1613, left it to Sir Francis Barnham, several times member of parliament for Maidstone. Sir Francis's son Sir Robert Barnham next occupied the house, taking the manor's name as his territorial designation when created a baronet in 1663. Sir Robert served as MP for Maidstone in the Convention Parliament of 1660 and in the Cavalier Parliament from 1661 to 1679. His son Francis predeceased him and, on his death around 1685, the estate was inherited by his daughter Philadelphia Barnham, wife of Thomas Rider. ", "Thomas Rider was MP for Maidstone in 1690 and from 1696 to 1698. He carried out a number of alterations to the house and its grounds between 1685 and 1690. Following his death in 1698, the estate was inherited by his son Sir Barnham Rider, MP for Maidstone from 1722 to 1727, and then his son, Thomas Rider. The second Thomas Rider left the house to his cousin Ingram Rider in 1786. In 1805, Ingram Rider left it to his son Thomas Rider, MP for Kent and West Kent from 1831 to 1835. The third Thomas Rider rebuilt parts of the house and extended and re-landscaped the park. On his death in 1847, he left the house to his nephew, also Thomas Rider, who let the house to a series of tenants. From 1903 to 1998, the house was occupied by the Winch family, firstly as leaseholders then, from 1960, as freeholders. The Winches sold the house in 1998; it remains in private ownership and belongs to the Kendrick family.", "The house is the remainder of a former courtyard house built for Robert Rudston circa 1567–75 as an extension to an earlier, pre-16th-century house. It is built of Kentish ragstone, roughly coursed on the north half of the east range and more regularly coursed on the south half of the east range and on the south range. The centre of the east range features a two-storey porch with galleted stonework on the upper level. The roof is of plain clay tiles, stone gabled at the north end of the east range but otherwise hipped, with four stone gabled dormers on the east façade and five smaller ones on the south façade. A frieze band with cornice and moulded stone base runs above the first floor windows on the east façade but is not repeated on the south, where only a moulded string course appears. Battlements were added to the eaves on both façades in 1819 as part of the third Thomas Rider's works. ", "The house sits in grounds of approximately  on a south-facing escarpment giving views south and east across the Weald. The formal entrance is north-west of the house, which is approached through woodland along a drive of approximately . Immediately to the east and south of the house are open lawns. To the north of the house are three enclosed gardens, two of which are arranged as kitchen gardens. These are remnants of a 16th-century formal garden scheme which was removed and replaced by informal landscaping during the third Thomas Rider's tenure. The steeply sloping ground to the south and south-east of the house is maintained as a deer park with a lake about  south-east of the house."]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|rowspan=\"2\"|Kent(two members)||Thomas Rider||Whig"]}]}}