{"wiki_id": "http://www.wikidata.org/entity/Q7791618", "itemLabel": "Thomas Kwok", "itemDescription": "Hong Kong businessman (born 1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Kwok", "wikipedia_page": {"main": "Thomas Kwok Ping-kwong (Chinese: 郭炳江; pinyin: Guō Bǐngjiāng; Cantonese Yale: Gwok Bínggōng; born October 6, 1951) is a Hong Kong billionaire, and the former joint chairman and managing director (with his brother Raymond Kwok) of Sun Hung Kai Properties, the largest property developer in Hong Kong. He received a five-year prison sentence for bribery in 2014.", "link_mentions": [{"page": "Gini coefficient", "response": ["Billionaire Thomas Kwok claims income Gini coefficient for Hong Kong has been high (0.434 in 2010), in part because of structural changes in its population. Over recent decades, Hong Kong has witnessed increasing numbers of small households, elderly households and elderly living alone. The combined income is now split into more households. Many old people are living separately from their children in Hong Kong. These social changes have caused substantial changes in household income distribution. The income Gini coefficient, claims Kwok, does not discern these structural changes in its society. Household money income distribution for the United States, summarized in Table C of this section, confirms that this issue is not limited to just Hong Kong. According to the US Census Bureau, between 1979 and 2010, the population of the United States experienced structural changes in overall households, the income for all income brackets increased in inflation-adjusted terms, household income distributions shifted into higher income brackets over time, while the income Gini coefficient increased.Congressional Budget Office: Trends in the Distribution of Household Income Between 1979 and 2007. October 2011. see pp. i–x, with definitions on ii–iii"]}, {"page": "London Business School", "response": ["*Thomas Kwok – Vice Chairman and Managing Director, Sun Hung Kai Properties"]}, {"page": "Walter Kwok", "response": ["In 2012, Kwok's younger brothers Thomas and Raymond, as well as Rafael Hui, previously the second-highest ranking government official in Hong Kong, were arrested by the city's anti-corruption agency on suspicion of bribery. Thomas Kwok and Rafael Hui were sentenced to prison terms while Raymond Kwok was acquitted. It has been suggested that Walter Kwok, who was not arrested, was the one who passed information to the authorities, supposedly in revenge for his ouster from Sun Hung Kai Properties a few years earlier."]}, {"page": "Sun Hung Kai Properties", "response": ["In December 2014, the jury convicted Thomas Kwok and Rafael Hui of the  bribery, and Hui was convicted of four more charges relating to misconduct in public office. The jury acquitted Raymond Kwok from all changes.\"Former chief secretary Rafael Hui found guilty.\" RTHK English News. 19 December 2014. Retrieved 19 December 2014.Lee Yimou; Ko, Lizzie (19 December 2014). \"Hong Kong former official, property tycoon guilty in graft case.\" Reuters. Retrieved 19 December 2014.", "# Raymond Kwok and Thomas Kwok (2011–2014); joint chairmen, younger sons of Kwok Tak-seng"]}, {"page": "Raymond Kwok", "response": ["Raymond Kwok Ping-luen JP (, born in 1952 in Hong Kong with family roots in Zhongshan, Guangdong) is the chairman and managing director of Sun Hung Kai Properties, the largest property developer in Hong Kong. He is the chairman of SUNeVision Holdings Ltd. and SmarTone Telecommunications Holdings Limited. He is the youngest son of Kwok Tak Seng, and the youngest brother of Walter Kwok, and Thomas Kwok.", "In March 2012, Raymond Kwok and Thomas Kwok were arrested on bribery charges. In March 2013, Thomas and Raymond Kwok pleaded not guilty to corruption charges involving payments and loans to Hong Kong's former No. 2 official Rafael Hui. In December 2014, Raymond Kwok was cleared of all charges, while his brother Thomas was convicted of \"conspiracy to commit misconduct in public office.\"Reuters"]}, {"page": "List of Hong Kong people", "response": ["*Thomas Kwok (), former joint-chairman of Sun Hung Kai Properties"]}, {"page": "2008 Summer Olympics torch relay route", "response": ["Thomas Kwok Ping-kwong – managing director of Sun Hung Kai group", "Image:HK Olympic Torch Relay Shatin B1.jpg|Relayer #38: Thomas Kwok (郭炳江)"]}, {"page": "Kwok Tak-seng", "response": ["Thomas Kwok, and Raymond Kwok."]}, {"page": "Thomas Kwok Ping Kwong", "response": ["#redirect Thomas Kwok"]}, {"page": "Kwok Ping Kwong", "response": ["#redirect Thomas Kwok"]}, {"page": "Kwok Ping-kwong", "response": ["#REDIRECT Thomas Kwok"]}, {"page": "List of Hong Kong people by net worth", "response": ["|align=\"center\"|||Thomas Kwok||align=\"center\"|$2.2 billion ||Sun Hung Kai Properties"]}, {"page": "2012 Hong Kong Chief Executive election", "response": ["Henry Tang was the second to submit his nomination; he did so earlier than planned on 20 February after having secured 379 nominations, days after his implication in an illegal structure scandal and on the day the press published allegations of yet another of his extra-marital liaisons.\"New scandal as Tang submits nominations\". RTHK 20 February 2012. Archived from the original on 20 February 2012. Tang's nominees included most of the major local property magnates: Li Ka-shing, Lee Shau-kee of Henderson Land Development, New World Development's Henry Cheng and Sun Hung Kai Properties' Raymond and Thomas Kwok, Chinese Estates Holdings chairman Joseph Lau,Siu, Phila; Luk, Eddie (21 February 2012) \"Count me in\". The Standard Robert Ng of Sino Group, Hopewell Holdings chairman Gordon Wu;Siu, Phila; Luk, Eddie (22 February 2012) \"Popularity of Tang tumbles after scandal\". The Standard Tang is also endorsed by Heung Yee Kuk chairman Lau Wong-fat and film director Stephen Chow."]}, {"page": "Second Tsang government", "response": ["In February 2012, Tsang was discovered to have received favours and hospitality from business tycoons on various occasions; there were also allegations of preferential allocation of a luxury apartment to Tsang in exchange for granting of a broadcasting licence.Luk, Eddie (27 February 2012). \"Tsang denies license link to penthouse deal\" . The Standard The Hong Kong media exposed Tsang's plan to live his retirement life in a 6,500 sq ft apartment in the nearby city of Shenzhen. The luxurious apartment is owned by the developer Wong Cho-bau, who has ties with the Chinese government and runs multiple businesses in both China and Hong Kong. It was reported that Tsang was set to rent the flat at a substantially discounted rate while renovation works, provided by the developer, were tailored to the demands of Tsang's wife. Tsang argued that declaration was not necessary and that his lease did not affect the government's decision on granting the broadcasting licence to DBC; he also argued that the lease was at market value.  The rental arrangement was widely considered politically insensitive and Tsang eventually dropped the plan in April. He was later summoned to answer questions from an open inquiry by the Hong Kong Legislative Council. This unprecedented revelations and move to impeach him launched by a pro-establishment legislator shook the confidence in integrity of the city's officials.Luk, Eddie (29 February 2012). \"Impeachment pressure grows\" . The Standard. Within weeks, two property magnates and the former chief secretary in his administration were arrested under allegations of bribery and corruption. The case resulted in the conviction of Rafael Hui, Thomas Kwok, and several executives of Sun Hung Kai Properties who acted as middlemen.\"Former chief secretary Rafael Hui found guilty.\" RTHK English News. 19 December 2014.Lee, Yimou; Ko, Lizzie (19 December 2014). \"Hong Kong former official, property tycoon guilty in graft case\". Reuters. 19 December 2014."]}, {"page": "Noah's Ark (Hong Kong)", "response": ["In 2012, the two Kwok brothers were charged with bribing Rafael Hui, the former Chief Secretary for Administration of Hong Kong from 2005 to 2007 who was in charge of the Ma Wan Park project (which included Noah's Ark) at the time of its construction, to be their \"eyes and ears in government\" in a case said to highlight \"the cozy relationship between the city's powerful developers and government.\" Revealed in the court case was a memo by Thomas Kwok in which he wrote \"We all know this park is only an excuse for village relocation, and our main target is only on the residential development plus the village relocation.\" The bribes from Thomas Kwok to Rafael Hui amounted to a total of HKD$8.5 million. The two brothers were arrested by the Independent Commission Against Corruption In December 2014, Thomas Kwok was convicted by the Court of Final Appeal of \"conspiracy to commit misconduct in public office,\" while his brother Raymond Kwok was cleared of all charges. Thomas Kwok was sentenced to five years in prison and a fine of $500,000. Rafael Hui, Sun Hung Kai executive Thomas Chan and businessman Francis Kwan were also jailed."]}, {"page": "Property developers in Hong Kong", "response": [" Four of the richest people in Hong Kong (with Raymond and Thomas Kwok of Sun Hung Kai counting as one) according to Forbes – Li Ka-shing (Cheung Kong), the Kwok brothers, Lee Shau-kee (Henderson Land Development), and Cheng Yu-tung (New World Development) – are vice chairmen.", "In December 2014, the jury convicted Thomas Kwok and Rafael Hui of the  bribery, and Hui was convicted of four more charges relating to misconduct in public office. The jury acquitted Raymond Kwok from all changes.\"Former chief secretary Rafael Hui found guilty.\" RTHK English News. 19 December 2014. Retrieved 19 December 2014.Lee Yimou; Ko, Lizzie (19 December 2014). \"Hong Kong former official, property tycoon guilty in graft case.\" Reuters. Retrieved 19 December 2014."]}, {"page": "List of wealthiest families", "response": ["| Thomas Kwok, Raymond Kwok, Kwok Tak-Seng, Kwong Siu-hing, "]}, {"page": "Thomas Kwok Ping-kwong", "response": ["#REDIRECT Thomas Kwok"]}, {"page": "Kwok, Thomas", "response": ["#redirectThomas Kwok"]}, {"page": "Andrew Macrae (judge)", "response": ["In 2014, Macrae sat as an additional Judge of the Court of First Instance and presided over the criminal trial of the former Chief Secretary for Administration, Rafael Hui, and property magnate Thomas Kwok."]}, {"page": "Kwok Tak-seng Family", "response": ["** Thomas Kwok (b. 1951); former joint chairman and chief executive of SHKP"]}]}}