{"wiki_id": "http://www.wikidata.org/entity/Q7793280", "itemLabel": "Thomas Price Turner", "itemDescription": "British musician (1790-1868)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Price_Turner", "wikipedia_page": {"main": "Thomas Price Turner (bapt. 17 January 1790 – 18 February 1868) was an English classical musician, and was one of the artist J. M. W. Turner's first cousins. Following the artist's death in 1851, Thomas Price Turner was one of a group of interested parties who contested J. M. W. Turner's will. The first cousins were awarded part of Turner's legacy in 1856.\nTurner was a professor of music in his native Exeter and was a secondary at Exeter Cathedral from 1820 until 1857. He had his own band. He sang in the 1834 Handel Commemoration in London, as J. M. W. Turner noted on looking at the programme.  Two years later Turner's daughter Maria Harriet married a London builder and surveyor, whom she later deserted for another husband.\nTurner married Maria Pridham in 1865, some time after retiring from the Cathedral and only a few years before his death in 1868. Maria had several children (Andrew, Charles, Maria) between 1847 and 1851 and is also recorded as being with Thomas in the UK Census Archives, though their exact relationship is unclear. Maria's children undoubtedly used the Turner name after the marriage between Thomas and Maria. It is unclear whether Turner was their natural father or their stepfather.  Selby Whittingham (in The Turners of Devon) believed that he was the father.", "link_mentions": [{"page": "J. M. W. Turner", "response": ["Turner left a small fortune which he hoped would be used to support what he called \"decayed artists\". He planned an almshouse at Twickenham with a gallery for some of his works. His will was contested and in 1856, after a court battle, his first cousins, including Thomas Price Turner, received part of his fortune. Another portion went to the Royal Academy of Arts, which occasionally awards students the Turner Medal. His finished paintings were bequeathed to the British nation, and he intended that a special gallery would be built to house them. This did not happen due to disagreement over the final site. Twenty-two years after his death, the British Parliament passed an act allowing his paintings to be lent to museums outside London, and so began the process of scattering the pictures which Turner had wanted to be kept together."]}, {"page": "Thomas Turner", "response": ["*Thomas Price Turner (c. 1790–1868), professor of music at Exeter Cathedral, first cousin of J. M. W. Turner and one of his heirs"]}]}}