{"wiki_id": "http://www.wikidata.org/entity/Q7792317", "itemLabel": "Thomas McKay", "itemDescription": "Canadian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_McKay", "wikipedia_page": {"main": "Thomas McKay (1 September 1792 – 9 October 1855) was a Canadian businessman who was one of the founders of the city of  Ottawa, Ontario.", "link_mentions": [{"page": "Rideau Canal", "response": ["The construction of the canal was supervised by Lieutenant-Colonel John By of the Royal Engineers. Private contractors such as future sugar refining entrepreneur John Redpath, Thomas McKay, Robert Drummond, Thomas Phillips, Andrew WhiteHistory of the Rideau Canal, Rideau-info.com. Retrieved 2008-01-14. and others were responsible for much of the construction, and the majority of the actual work was done by thousands of Irish,  Scottish, French-Canadian labourers. Colonel John By decided to create a slackwater canal system instead of constructing new channels. This was a better approach as it required fewer workers, was more cost effective, and would have been easier to build."]}, {"page": "Rideau Hall", "response": ["The name Rideau Hall was chosen by Thomas McKay for his villa, drawing inspiration from the Rideau Canal which he had helped construct, though the house was also known colloquially as McKay's Castle. Once the house became the official residence of the governor general, it was termed formally as Government House. But, Rideau Hall stuck as the informal name and the existence of two names for the building led to some issue: in 1889 the viceregal consort, the Lady Stanley of Preston, was rebuked by Queen Victoria for calling the house Rideau Hall; it was to be Government House, as in all other Empire capitals. Today, however, Rideau Hall is the commonly accepted term for the house, with Government House remaining only in use for very formal or legal affairs; for example, royal proclamations will finish with the phrase: \"At Our Government House, in Our City of Ottawa...\"", "The site of Rideau Hall and the original structure were chosen and built by stonemason Thomas McKay, who immigrated from Perth, Scotland, to Montreal, Lower Canada, in 1817 and later became the main contractor involved in the construction of the Rideau Canal. Following the completion of the canal, McKay built mills at Rideau Falls, making him the founder of New Edinburgh, the original settlement of Ottawa. With his newly acquired wealth, McKay purchased the 100 acre site overlooking both the Ottawa and Rideau Rivers and built a stone villa where he and his family lived until 1855 and which became the root of the present day Rideau Hall. Locals referred to the structure as McKay's Castle.", "The original 1838 structure was relatively small; only two storeys tall with a full-height, central, curved bay, and an accordingly curved pediment on top, the villa was designed by Thomas McKay (who had also designed and built Earnscliffe) in a Regency style, inspired by the work of architect Sir John Soane, who had himself designed a never realised government house for the then capital of Upper Canada, York, in 1818. Unlike the present arrangement, the rooms of the McKay villa for entertaining, sleeping, and service were dispersed throughout the two floors of the structure, with the main parlour located on the second level, in an oval room behind the curved, south bay, which National Capital Commission Chief Architect David Scarlett said in 2014 was made in such a shape so as to display the advanced abilities of McKay's stonemasons. The main entrance to the house was on the west side and opened into a hall with stairs to the upper floor directly ahead. Along the south front were a library, a dining room, and a boudoir, all with French doors opening onto a narrow balcony; the dining room was served by three of these doors, one of which now opens into the Tent Room's antechamber, one into the Long Gallery, and one that still opens to the outside. The French door originally opening from the boudoir is today the window of the Pauline Vanier Room."]}, {"page": "Lachine Canal", "response": ["After more than 130 years of failure, a consortium that included the young Scottish immigrant John Redpath was successful. John Richardson was Chairman of the Committee of Management of the canal project and its chief engineer was Thomas Brunett. The contractors were Thomas McKay and John Redpath, plus the firms of Thomas Phillips & Andrew White and Abner Bagg & Oliver Wait."]}, {"page": "Bytown", "response": ["Some early buildings that still stand had been erected in Bytown.  In 1826, Thomas McKay was contracted to build the commissariat building, now the Bytown Museum.  McKay also built Rideau Hall (which has since been expanded), and parts of the Union Bridge connecting LeBreton Flats to Hull. Notre-Dame Cathedral Basilica was also built early on in the developing town.  The University of Ottawa had its 1846 origins as a college, and it received its present location in 1856.", "*There is a Bytown Museum in Ottawa in the oldest stone building in the city, built by Thomas McKay, containing artifacts dating back to the Bytown era."]}, {"page": "Sussex Drive", "response": ["and by Thomas McKay (1792–1855), whom built the locks where the Rideau Canal meets the Ottawa River. McKay gradually purchased over  of land and established New Edinburgh in 1832."]}, {"page": "Timeline of architecture", "response": ["*1838 – Rideau Hall is built by Scottish architect Thomas McKay."]}, {"page": "1838 in architecture", "response": ["* Rideau Hall, Ottawa, Canada, built by Scottish architect Thomas McKay."]}, {"page": "New Edinburgh", "response": ["New Edinburgh was founded by Thomas McKay, one of the builders of the Rideau Canal lock system. He bought the land at the junction of the Ottawa and Rideau Rivers in 1829 and created a village named for Edinburgh in his native Scotland. "]}, {"page": "St. Andrew's Presbyterian Church (Ottawa)", "response": ["The church was founded for, and built by, the Scottish and Irish labourers who were constructing the Rideau Canal for Montreal's John Redpath and their own Thomas McKay. The location on Wellington Street was purchased for 200 pounds sterling and the church was built during lulls in the construction of the canal."]}, {"page": "John Redpath", "response": ["John Redpath's success in building the Lachine Canal led to further major projects including his partnering with Thomas McKay, to construct the locks at Jones Falls, Ontario on the giant Rideau Canal project between 1827 and 1828. In addition, Redpath built the Notre-Dame Basilica and some of the first buildings at McGill University."]}, {"page": "St. Bartholomew's Anglican Church (Ottawa)", "response": ["With the motivational and financial backing of Governor General the Viscount Monck, the parish was founded on 14 August (St. Bartholomew's Day) 1867. Land was donated from the estate of Thomas McKay (the former owner of Rideau Hall) and the St. Lawrence Railway and the building, completed in 1868, was designed by Thomas Seaton Scott, who was the architect of a number of other prominent Ottawa structures. Monck laid the corner stone on 9 May 1868 and the first service was held on Christmas Day, though the interiors remained unfinished. The furnishings were later augmented by the Marchioness of Dufferin and Ava."]}, {"page": "MacKay United Church", "response": ["The church was founded in 1875 on land donated by William MacKinnon, grandson of Thomas McKay, and the founder of New Edinburgh and namesake of the church. The Romanesque Revival style building was constructed from 1909-1910.Heritage Trust"]}, {"page": "List of people from Ottawa", "response": ["| Thomas McKay"]}, {"page": "Bytown and Prescott Railway", "response": ["Initial purchases of stock were slow, far too small to pay for construction. Thomas McKay offered to buy a considerable share of the shares in exchange for moving the northern terminus to industrial land he owned in New Edinburgh, further down the Ottawa River. This location was not nearly as practical for logging, as it required logs to be formed into booms to transit a timber slide at the Chaudière Falls, moved only a few kilometres, and then un-boomed and hoisted up to the top of the hills near where the French embassy stands today."]}, {"page": "Russell (Ontario electoral district)", "response": ["#Thomas McKay (1834–1840)"]}, {"page": "Apostolic Nunciature to Canada", "response": ["The first home on the property, built by Duncan Reynier MacNab in 1838–39, was named \"Rockcliff House\" for its location. This name neighbourhood became known as Rockcliffe Park. In 1868 the property was purchased by Thomas Coltrin Keefer, son-in-law of Thomas McKay, after he had sold Rideau Hall to the government to house the Governor General. Keefer rebuilt and extensively enlarged the house. It remained in the Keefer family 1929 when it was purchased by Cairine Wilson, the first Canadian woman to be named to Senator and her husband Norman. In 1929 the building was renovated in the style of Directoire Manor Houses of France."]}, {"page": "James Maclaren", "response": ["In 1853, he leased a sawmill in New Edinburgh from Thomas McKay with partners including Moss Kent Dickinson and Joseph Merrill Currier. By 1861, he was able to buy out his partners and, in 1866, he purchased the mills after McKay's death. In 1864, again with partners, he bought sawmills at Buckingham, later buying out his partners."]}, {"page": "Earnscliffe", "response": ["The manor was built by Thomas McKay's company for his son-in-law, John McKinnon, from 1855 to 1857. McKinnon died suddenly in 1866 and the house was purchased by another of McKay's sons-in-law, Thomas Keefer. Two years later, he sold it to Thomas Reynolds, a railroad developer. Reynolds resided there for several years, and it was during this period that the house got the name \"Earnscliffe\", an archaic term for \"eagle's cliff\"."]}, {"page": "12th Parliament of Upper Canada", "response": ["|Thomas McKay"]}, {"page": "4th Canadian Parliament", "response": ["|Thomas McKay"]}, {"page": "13th Parliament of Upper Canada", "response": ["|Thomas McKay"]}, {"page": "Chaudière Bridge", "response": ["  While the main span was a wooden arch, masonry arches were also used for the smaller spans.  Thomas McKay had been given contracts to construct two of its stone arches.."]}, {"page": "Ottawa Horticultural Society", "response": ["The roots of the OHS reach back to the time just before the city of Ottawa was incorporated. The first OHS was organized during a meeting held on March 9, 1854, and chaired by Mayor Friel at the town hall. Thomas McKay (1792–1855) was nominated as the first President. (He declined.) The Society was primarily involved in holding shows and it did so from its founding until 1859, when it appears that a declining number of exhibitors and volunteers to work on the shows led to the society becoming dormant."]}, {"page": "Legislative Council of the Province of Canada", "response": ["|Thomas McKay"]}, {"page": "Scott Valley", "response": ["Drained by the federally designated Wild & Scenic Scott River, Scott Valley is steeped in history. At the time of the first contact with Europeans in the 1830s, the valley was occupied by the Scott Valley branch of the Shasta tribe of Native Americans. Scott Valley was first entered by Stephen Meek, Thomas McKay, George Adolphus Duzel and 16 other Hudson's Bay trappers in 1836. Meek reportedly trapped 1,800 beaver from the valley in the year 1850 alone. Meek, who had hunted all over the West, declared the Beaver Valley, soon to be renamed Scott Valley, one of the best places he had ever seen to trap beaver and hunt game, and returned to retire there at the Josiah Doll ranch from 1871 until his death in 1889 at the age of 90."]}, {"page": "Frederick Preston Rubidge", "response": ["Rubidge first qualified as a provincial surveyor in 1831 and completed important surveys over the next few years. In 1841, the Board of Works of the Province of Canada (Public Works after 1846) was formed and he was among the initial employees. Much of his work involved design for public buildings. He held the title of assistant engineer but became known as architect for the department. He had various roles associated with the parliament and department buildings in Ottawa. One of the more intriguing projects concerned Rideau Hall, the former home of Thomas McKay, and its conversion to the official residence of the governor general of Canada."]}, {"page": "Charles Keefer", "response": ["Charles was the son of well-known Canadian civil engineer, Thomas Keefer.  Charles was born in Rideau Hall in Ottawa when it was the property of his grandfather, Thomas McKay, before it became the official residence of the Governor General of Canada. Although not formally educated, Keefer spent his early years employed as a surveyor on some of Canada's most important railway works including the Canada Central Railway (Ottawa to Carleton Place), the Chaudière branch of the St. Lawrence and Ottawa Railway, the Canadian Pacific Railway (Yellowhead Pass), and the Canada Atlantic Railway."]}, {"page": "Gladstone Avenue", "response": ["When laid out in the 1800s, the street was named Ann Street, after the wife of Thomas McKay.Column: Gladstone Avenue is changing From 1896 until 1907, the Ottawa Hockey Club, commonly known as the Silver Seven, Stanley Cup winner, played its games at the Dey's Skating Rink at Bay Street and Gladstone."]}, {"page": "Thomas McKay (disambiguation)", "response": ["Thomas McKay (1792–1855) was a Scottish-born Canadian businessman and co-founder of Ottawa, Ontario.", "*Thomas McKay (fur trader) (1796–1849), Canadian fur trader and early settler of Oregon", "*Thomas McKay (Canadian politician) (1839–1912), Canadian member of Parliament and senator", "*Thomas McKay (Northwest Territories politician) (1849–1924), Canadian Anglo-Métis politician and first mayor of Prince Albert, Saskatchewan", "*Thomas McKay (Australian politician) (1909–2004), golfer and politician in New South Wales", "*Thomas McKay (Alaska politician), American politician", "*Thomas McKay (gunner) (died 2005), known as \"Tam the Gun\", gunner at Edinburgh Castle's One O'Clock Gun"]}, {"page": "List of oldest buildings in Canada", "response": ["| Stone House currently the Bytown Museum || 3 || 1827 || Ottawa || Thomas McKay || 100px"]}, {"page": "Donald McLean (fur trader)", "response": ["He joined the Hudson's Bay Company in 1833 as an apprentice clerk in the company's Western Department. In 1835 he was with expeditions to the Snake River country west of the Rockies led by Thomas McKay and John McLeod.  He was assigned to Fort Colville, under Chief Trader Archibald McDonald in 1839, and in 1840 was transferred to Flathead Post. Two years later, he was sent to the New Caledonia Fur District in now north-central British Columbia, and was, at different times, in charge of Forts Chilcotin, Babine, and McLeod. He also worked at Fort Alexandria under Donald Manson."]}, {"page": "William H. Hutchison", "response": ["Born in New Edinburgh, Hutchison was the son of Robert Hutchison, a Scottish immigrant who worked as a foreman for Thomas McKay, and Mary McKay, McKay's niece.A cyclopædia of Canadian biography : brief biographies of persons ... (1919) Charlesworth, Hector W. pp. 241-2 He worked in flour mills in the United States before returning to Ottawa and going into business with his great-uncle. In 1874, Hutchison married Electa Blanche Willett. Hutchison served on Ottawa city council from 1885 to 1891 and was also chairman of the Board of Works for the city. He was a director of the Chaudiere Electric Light Company, the Ottawa City Passenger Railway Company, the Ottawa Electric Railway Company and the Ottawa Land Association. Hutchison also served as president of the Central Canada Exhibition.The Canadian parliamentary companion, 1897 AJ Gemmill He died in Ottawa at the age of 76."]}, {"page": "Beechwood Cemetery", "response": ["* Thomas McKay (1792–1855), businessman, a founder of the city of Ottawa"]}, {"page": "Bytown Mechanics' Institute", "response": ["The Bytown Mechanics' Institute differed from the newsrooms in that the founding fathers were not clerks or members of the working class; they were employers and professionals. The social leaders of Bytown formed the BMI: Hon. Thomas McKay, George W. Baker, Horatio Blasdell, John Scott, William P. Lett, John Bower Lewis and all resident clergymen.", "*• tweeds from Thomas McKay's factory"]}, {"page": "History of Ottawa", "response": ["The first European survey of the Rideau Route, part of an indigenous canoe route that connected the Ottawa River to the St. Lawrence River at Gananoque, was conducted by Lt. Gershom French in 1783.  On October 2, 1783, his survey party camped on the shores of the Rideau River at the head of the portage from the Ottawa River that led around Rideau Falls.  He described the area as \"the soil everywhere good and deep, timbered with Maple, Elm and Butternut\". The War of 1812 made evident the need for a safe military supply route from Montreal to Kingston so the Rideau Route was surveyed for the purposes of a canal, in 1816 by Royal Engineer Joshua Jebb and in 1823-24 by civil surveyor Samuel Clowes. In 1826, Lieutenant-Colonel John By was appointed to oversee its construction and he hired contractors that included Philemon Wright, who supplied much of the stone, mortar and labour, Thomas McKay, a mason, and staff such as John MacTaggart and Thomas Burrowes, surveyor,  (Burrowes' created many paintings of early Bytown.)  The Governor General George Ramsay, the Earl of Dalhousie took a great interest in the construction of the canal, as well as in establishing a settlement in the area.  On September 26, 1826, Colonel By and Dalhousie had agreed that the canal's entrance was to be at Entrance Bay (its current location), and along with a letter authorizing Colonel By to divide the town into lots, marked the origins of what was to become the town of Bytown."]}, {"page": "Ottawa River timber trade", "response": ["The industry began in Bytown with St. Louis, who in 1830 used the bywash (a section, that no longer exists, of the early Rideau Canal which drained into the Rideau River) near Cumberland and York.  In 2001 he moved to Rideau Falls. Thomas McKay acquired the mill in 1837.", "Thomas McKay (1792-1855), sometimes considered as one of the founding fathers of Ottawa for his work in building, as well as politics, built a sawmill at New Edinburgh.  He was also known for building Rideau Hall, locks of the Rideau Canal, and the Bytown Museum.  McKay also was on the Legislative Council of the Province of Canada.", "James Maclaren (1818-1892) who once established industry Wakefield, Quebec, in 1853, he leased a sawmill in New Edinburgh from Thomas McKay with partners and in 1861, he bought out his partners and, in 1866, he purchased the mills after McKay's death. In 1864, again with partners, he bought sawmills at Buckingham, Quebec, later buying out his partners."]}, {"page": "Ottawa Electric Railway", "response": ["The O.C.P.R. was financed largely by the estate of Thomas McKay (an early founder of Ottawa).  In 1868, Thomas Reynolds bought control of the company intending to use it to transport lumber at night from the Chaudiere mills to McTaggart Street, the terminal of the St. Lawrence and Ottawa Railway.  In 1871, Reynolds sold his streetcar company interest to Thomas Keifer."]}, {"page": "By-elections to the 4th Canadian Parliament", "response": ["|Thomas McKay"]}, {"page": "Pierre-Chrysologue Pambrun", "response": ["Reaching the station in May, Pambrun found Métis men speaking \"violent threats against the Colony\" and soon departed with 22 HBC staff under master and trader James Sutherland.https://www.gov.mb.ca/chc/archives/hbca/biographical/s/sutherland_james_3rd_1778-1844.pdf The party was bound for the Red River Colony to resupply the settlement. On 9 May, they were attacked by Cuthbert Grant and 49 NWC, including a future coworker of Pambrun's, Thomas McKay, son of Alexander MacKay and Marguerite Wadin and stepson of John McLoughlin. The HBC men were then taken prisoner and held at Qu'Appelle, although after five days all the captives except Pambrun were released. Late in May, Pambrun witnessed an oration at The Forks by a NWC officer requesting Native recruits. While Pambrun did not witness the attack on Brandon House, he was in the area and promptly was taken to see the victorious NWC men looting the station property. Sixty miles outside the Red River colony, a small fortified position was made to store the seized HBC goods. Pambrun was held at this position as the NWC force marched on the colony, where the Battle of Seven Oaks then occurred."]}]}}