{"wiki_id": "http://www.wikidata.org/entity/Q7795049", "itemLabel": "Thomas White", "itemDescription": "bishop of Peterborough", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_White_(bishop)", "wikipedia_page": {"main": "Thomas White (1628–1698) was Bishop of Peterborough from 1685 to 1690.", "link_mentions": [{"page": "Lords Spiritual", "response": ["Despite their failure to be tried as temporal peers in the House of Lords, it remained unclear whether the Lords Spiritual were indeed peers. In 1688, the issue arose during the trial of the Seven Bishops—William Sancroft, Archbishop of Canterbury; Sir Jonathan Trelawny, 3rd Baronet, Bishop of Winchester; Thomas Ken, Bishop of Bath and Wells; John Lake, Bishop of Chester; William Lloyd, Bishop of Worcester; Francis Turner, Bishop of Ely and Thomas White, Bishop of Peterborough—by a common jury. The charge was that a petition sent by the Bishops constituted seditious libel; the Bishops argued that they had the right to petition the Sovereign at any time, while the prosecution charged that such a right was only permissible when Parliament was in session (which, at the time of the delivery of the petition, it was not). If the bishops were only Lords of Parliament, and not peers, their right to petition would be vitiated while Parliament was dissolved. Peers, however, were and still are counsellors of the Sovereign whether Parliament is in session or not; therefore, if the bishops were indeed peers, they would be free to send petitions.  Since there was no doubt that the petition was actually sent, while the Court still ruled the bishops not guilty, it appears that it was taken for granted that the bishops were counsellors of the Crown."]}, {"page": "Seven Bishops", "response": ["In a series of meetings, the London clergy overwhelmingly voted against compliance. On 13 May, William Sancroft, Archbishop of Canterbury and seven other bishops, including Henry Compton, Francis Turner, Thomas White, Thomas Ken, John Lake, Jonathan Trelawny and William Lloyd resolved to defy James's order. While not present, the Bishop of Winchester, Gloucester and Norwich were said to have approved this course of action. Compton had already been suspended for refusing to ban John Sharp from preaching after he gave an anti-Catholic sermon. The other seven signed a petition requesting they be excused, referencing the Parliamentary decisions of 1663 and 1673.", "File:Bp Thomas White.jpg|Thomas White, Bishop of Peterborough"]}, {"page": "Thomas White", "response": ["* Thomas White (musician) (born 1984), British musician", "* Thomas White (patriot) (1739–1820), American soldier in General Washington's army", "* Thomas White (MP for Rochester), Member of Parliament (MP) for Rochester, 1378–1388", "* Thomas White (MP for Leominster), MP for Leominster, 1399", "* Thomas White (MP for Lewes), MP for Lewes, 1420–1435", "* Thomas White (died 1542), MP for Bristol", "* Thomas White (died 1558) (1532/4–1558), MP for Downton", "* Thomas White (died 1566) (1507–1566), MP for Hampshire ", "* Thomas White (died 1590), MP for Poole", "* Thomas White of Tuxford (died 1580), English state official", "* Thomas White (died 1670) (c. 1630–1670), Member of Parliament for Wells", "* Thomas White (1667–1732), Member of Parliament for East Retford", "* Sir Thomas White, 2nd Baronet (1801–1882)", "* Thomas White, 3rd and 5th of the White baronets", "* Thomas White (California politician), mayor of San Jose, California from 1851 to 1854", "* Thomas White Jr. (1939–2010), New York politician", "* Thomas White (Michigan politician) (died 1868), Michigan state representative", "* Thomas White (Canadian politician) (1830–1888), Canadian politician", "* Thomas White (Australian politician) (1888–1957), Australian politician", "* Thomas White (benefactor) (1550–1624), clergyman and founder of Sion College", "* Thomas White (scholar) (1593–1676), Catholic philosopher", "* Thomas White (bishop) (1628–1698), Bishop of Peterborough (1685–1690)", "* Thomas White (footballer), English footballer", "* Thomas White (cricketer, born c. 1740) (1740–1831), English cricketer for Surrey and Kent", "* Thomas White (Sussex cricketer) (1892–1979), English cricketer", "* Thomas White (speed skater) (born 1915), Canadian speed skater", "* Thomas White (merchant) (1492–1567), founder of St. John's College, Oxford", "* Thomas White (pirate) (died 1708), English pirate active in the Indian Ocean", "* Thomas White (architect) (died 1738), British architect of St Mary and St Margaret's Church, Castle Bromwich"]}, {"page": "White Kennett", "response": ["White Kennett was born in the parish of St Mary, Dover, on 10 August 1660, the son of Basil Kennett, M.A., rector of Dimchurch and vicar of Postling, Kent, by his wife Mary, eldest daughter of Thomas White, a wealthy magistrate and master-shipwright of Dover. After receiving a preliminary education at Elham and Wye, he was placed at Westminster 'above the curtain,' or in the upper school; but as he was suffering from smallpox at the period of the election of scholars on the foundation, his father recalled him home. After his recovery he spent a year at Beaksbourne, in the family of Mr. Tolson, whose three sons he taught 'with great content and success.' He was the older brother of Basil Kennett, whose life and career he was considerably to influence."]}, {"page": "Bishop of Peterborough", "response": ["| 60px Thomas White"]}, {"page": "Archdeacon of Nottingham", "response": ["*13 August 1683 – 1685 (res.): Thomas White"]}, {"page": "Francis Turner (bishop)", "response": ["On 24 February 1693 he joined the nonjuring bishops, William Lloyd and Thomas White, in consecrating George Hickes and Thomas Wagstaffe as suffragans of Thetford and Ipswich, the object being to continue a succession in the Jacobite interest. Henry Hyde, 2nd Earl of Clarendon, was present at the ceremony, which took place at White's lodging. In 1694 it was proposed that Turner, who was in easy circumstances, should be invited to St Germains in attendance on James, a proposal which James approved but did not carry out."]}, {"page": "Church of St Mary Magdalene, Newark-on-Trent", "response": ["*1660 Thomas White, afterwards Bishop of Peterborough"]}]}}