{"wiki_id": "http://www.wikidata.org/entity/Q7794629", "itemLabel": "Thomas Underwood", "itemDescription": "Canadian building developer and mayor of Calgary", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Underwood", "wikipedia_page": {"main": "Thomas Underwood (May 6, 1863 – May 10, 1948) was a building developer and the 13th mayor of Calgary, Alberta.\nBorn in Asfordby, Leicestershire, England in 1863, Underwood emigrated to Canada when he was 20.  A carpenter by trade, he arrived in Winnipeg, Manitoba in 1883.  At first, he worked as a farm hand.  Two years later, he joined a Canadian Pacific Railway construction gang and was working in Craigellachie, British Columbia at the time of the last spike was driven to complete the transcontinental railroad.  After the railroad was completed, he settled in Calgary.\nUnderwood spent the first two and a half years working for Jarrett-Cushing Lumber Company.  Then he went into business for himself as a builder and contractor.  Underwood was involved in the construction of many of the larger buildings in early Calgary.  This includes the Bank of Montreal building and Burns Manor for Senator Pat Burns.\nUnderwood was elected to the Calgary City Council in 1894.  He spent eight years on City Council including two years as mayor from 1902-1904.\nIn 1887, Underwood married Catherine Graves.  Together they had nine children, three of whom died in infancy.  He was deacon of First Baptist Church for over 30 years, director of the YMCA for 25 years, and a member of the board of directors of Brandon College for ten years.  His wife died in 1934 and he died on May 10, 1948, both in Calgary.", "link_mentions": [{"page": "List of mayors of Calgary", "response": ["|13 ||Thomas Underwood || January 6, 1902 || January 5, 1904 || "]}, {"page": "Underwood (surname)", "response": ["* John Thomas Underwood (1857–1937), founder of the Underwood Typewriter Company", "* Thomas Underwood (1863–1948), Canadian politician"]}, {"page": "Burns Manor", "response": ["Pat Burns commissioned the house to be built in 1900. He hired his friend, Francis Rattenbury of Victoria, British Columbia to design the building. Burns was familiar with Rattenbury as they were close friends and business associates.Cornerstones: Patrick Burns (Manor House)  Thomas Underwood, who would go on to serve as Mayor of Calgary, was contracted out for construction."]}, {"page": "List of Calgary municipal elections", "response": ["| 18 || 1901 || December 9 || January 5, 1903 || Thomas Underwood ||  ||  ||  || ", "| 19 || 1902 || December 8 || January 5, 1904 || Thomas Underwood ||  ||  ||  || "]}, {"page": "Underwood, Thomas", "response": ["#redirectThomas Underwood"]}, {"page": "1892 Calgary municipal election", "response": ["*Thomas Underwood - 69 votes"]}, {"page": "January 1894 Calgary municipal election", "response": ["*Howard Douglas acclaimed on February 28, 1894 after Thomas Underwood failed to be sworn in within one month of the January 1894 election due to inability to return from England in time."]}, {"page": "1899 Calgary municipal election", "response": ["*Thomas Underwood"]}, {"page": "1896 Calgary municipal election", "response": ["*Thomas Underwood"]}, {"page": "1900 Calgary municipal election", "response": ["*Thomas Underwood - 91 votes"]}, {"page": "1901 Calgary municipal election", "response": ["*Thomas Underwood"]}]}}