{"wiki_id": "http://www.wikidata.org/entity/Q7793148", "itemLabel": "Thomas Phillips", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Phillips_(mayor)", "wikipedia_page": {"main": "Sir Thomas Phillips (1801–  26 May 1867) was a Welsh lawyer, politician and businessman, who was Mayor of Newport in Monmouthshire at the time of the Newport Rising in 1839. He was also a prominent defender of Welsh language and education.\n\n", "link_mentions": [{"page": "Richard Dadd", "response": ["In July 1842, Sir Thomas Phillips, the former mayor of Newport, chose Dadd to accompany him as his draughtsman on an expedition through Europe to Greece, Turkey, Southern Syria and finally Egypt. In November of that year they spent a gruelling two weeks in Southern Syria, passing from Jerusalem to Jordan and returning across the Engaddi wilderness. Toward the end of December, while travelling up the Nile by boat, Dadd underwent a dramatic personality change, becoming delusional, increasingly violent, and believing himself to be under the influence of the Egyptian god Osiris. His condition was initially thought to be sunstroke.Allderidge 1974, Richard Dadd, p. 22."]}, {"page": "1849 in literature", "response": ["*Thomas Phillips – Wales, the Language, Social Condition, Moral Character, and Religious Opinions of the People, considered in their relation to Education..."]}, {"page": "Llanelly", "response": ["*Thomas Phillips (1801–1867), Mayor of Newport during the Newport Rising"]}, {"page": "Newport Rising", "response": ["Rumours of a possible Chartist rising and alleged violence elsewhere, following the earlier arrest of Chartist leader Henry Vincent and his imprisonment at the gaol in Monmouth, meant that the authorities expected there might be a riot. The sheer scale of the rising, however was not fully appreciated until 3 November, the day before the rising. The authorities quickly prepared. The Mayor of Newport Thomas Phillips had sworn in 500 Special Constables and asked for more troops to be sent. There were about 60 soldiers stationed in Newport already, and he gathered 32 soldiers of the 45th (Nottinghamshire) Regiment of Foot in the Westgate Hotel where the Chartist prisoners were held.", "Amongst the “defenders” of the hotel, Mayor Thomas Phillips was badly wounded and one soldier was seriously hurt, along with two of the special constables. As the chartists fled they abandoned many of their weapons, a selection of which can still be seen in Newport Museum.", "Meanwhile, the Establishment and middle classes became convinced that the rising meant all Chartists were dangerously violent. Newport Mayor Thomas Phillips was proclaimed a national hero for his part in crushing the rising and was knighted by Queen Victoria barely six weeks later."]}, {"page": "Thomas Phillips (disambiguation)", "response": ["Thomas Phillips (1770–1845) was an English painter.", "* Thomas Phillips (Irish adventurer) (1560–1633), founder of Limavady, governor of the county of Coleraine, first license to distil whiskey", "* Thomas Phillips (mayor) (1801–1867), Welsh lawyer, politician and businessman", "* Thomas Phillips (MP for Hastings) (died 1626), MP for Hastings", "* Sir Thomas Phelipps, 1st Baronet or Thomas Phillips, MP for Winchester", "* Thomas Phillips (rower), American rower who won gold medal at the 1979 World Rowing Championships", "* Thomas Phillips (engineer) (died 1693), English military engineer", "* Thomas Phillips (priest) (1708–1774), English Jesuit biographer", "* Thomas Phillips (educational benefactor) (1760–1851), founder of Llandovery College in Wales"]}, {"page": "Treachery of the Blue Books", "response": ["Saunders Lewis, in his The Fate of the Language (Tynged yr Iaith) BBC address, maintained that the Blue Books were for Welsh history \"the most important nineteenth-century historical documents we possess\" as their effect was to turn Wales into a more bilingual country, through the requirement to learn English as a second language. Such a judgement also reflects the fact that the publication of the reports, and the controversy that followed, was the catalyst for a much greater level of nonconformist involvement in the politics of Wales than hitherto. Critics such as Evan Jones (Ieuan Gwynedd), William Rees (Gwilym Hiraethog), Henry Richard, Thomas Price and Sir Thomas Phillips gained wide publicity for their trenchant criticisms of the reports. Over time these criticisms evolved into an organised political action, which culminated at the general election of 1868."]}, {"page": "1839 in the United Kingdom", "response": ["* 4 November – Newport Rising: between 5,000 and 10,000 Chartist sympathisers led by John Frost, many of them coal miners, march on Newport, Monmouthshire, to liberate Chartist prisoners; around 22 are killed when troops, directed by Thomas Phillips, the mayor, fire on the crowd. This is the last large-scale armed civil rebellion against authority in mainland Britain and sees the most deaths."]}, {"page": "Mayor of Newport", "response": ["One of the most famous mayors of Newport was the  Chartist John Frost in 1836, who less than four years later was condemned to death for treason for his involvement in the Newport Rising (appointed mayor in 1838, Thomas Phillips was knighted for his efforts in quelling the Rising). Frost's sentence was later commuted to transportation for life to Australia. In 1856 John Frost was given a full pardon, returned to the UK and lived in Bristol. "]}, {"page": "1839 in Wales", "response": ["*4 November – Newport Rising: between 5,000 and 10,000 Chartist sympathisers led by John Frost, many of them coal miners, march on the Westgate Hotel in Newport, Monmouthshire, to liberate Chartist prisoners; around 22 are killed when troops, directed by Thomas Phillips, the mayor, fire on the crowd. This is the last large-scale armed civil rebellion against authority in mainland Britain and sees the most deaths."]}, {"page": "Llanellen", "response": ["The church of St Helen possibly dates back to the 13th century, though the church was largely re-built in Perpendicular style in the mid-19th century by architect John Prichard. In the churchyard is the grave of Sir Thomas Phillips, Mayor of Newport at the time of the Newport Rising in 1839, and a prominent defender of Welsh language and education, who lived in nearby Llanellen House."]}, {"page": "1801 in Wales", "response": ["*date unknown - Thomas Phillips, lawyer, politician and businessman, mayor of Newport (d.1867)"]}, {"page": "John Frost School", "response": ["In August 2019, in the BBC TV series Who Do You Think You Are?, the school was visited by TV producer Michael Whitehall and his son, actor and comedian Jack Whitehall, who were revealed to be descendants of Thomas Phillips, mayor of Newport at the time of the Rising."]}, {"page": "List of people from Newport", "response": ["* Thomas Phillips Mayor of Newport during the Chartist Uprisng"]}, {"page": "Jack Whitehall", "response": ["Jack Peter Benedict Whitehall was born at Portland Hospital in London's West End on 7 July 1988, the son of actress Hilary Amanda Jane Whitehall (née Isbister; stage name Hilary Gish) and television producer Michael John Whitehall. His father was also an agent for Judi Dench, Colin Firth, and Richard Griffiths. Whitehall is a descendant of Welsh lawyer Thomas Phillips, who was a major opponent of the Newport Rising of 1839. He had two godfathers: actors Nigel Havers and Richard Griffiths. He attended Tower House School in London's East Sheen area, where he was a classmate of actor Robert Pattinson. He has often joked that he resented Pattinson for taking all the best acting roles in the school plays. Whitehall auditioned for the role of Harry Potter in Harry Potter and the Philosopher's Stone (2001), but the casting director was unimpressed with him because he had not read the book. His parents sent him to boarding school at the age of eight. He attended the Dragon School in Oxford and then Marlborough College. He took a gap year in which he decided to pursue a career in stand-up comedy. He attended the University of Manchester to study History of Art, dropping out after two terms."]}, {"page": "Thomas Prothero", "response": ["The younger Thomas Prothero began life in the same directions as his father. He set up in business in Newport, Monmouthshire; and he became town clerk of Newport in 1807. He was later joined in his law firm by Thomas Phillips, who became another influential local figure; they were in partnership from 1824 to 1840. Prothero and his law firm were drawn into the electoral politics of the two local constituencies, Monmouthshire and Monmouth Boroughs."]}, {"page": "William Robert Hay", "response": ["Hay died on 10 December 1839, at Ackworth rectory. His obituary in the Gentleman's Magazine compared Hay's role at Peterloo with that of Sir Thomas Phillips in the recent Newport Rising. He was succeeded at Rochdale by John Edward Nassau Molesworth; and at Arkworth by Edmund Goodenough Bayly."]}]}}