{"wiki_id": "http://www.wikidata.org/entity/Q7793530", "itemLabel": "Thomas Richmond", "itemDescription": "British artist (1802-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Richmond", "wikipedia_page": {"main": "Thomas Richmond (1802–1874) was a British portrait painter, known for his idealised pictures in the so-called keepsake style. He was the son of Thomas Richmond (1771–1837), the miniature painter, and the brother of George Richmond.Richmond initially practiced in Sheffield, and later moved to London. His main clientele was among the hunting fraternity. Between 1833 and 1860 he exhibited fifty one portraits in London. \nHe exhibited forty-five portraits at the Royal Academy and six at the Suffolk Street gallery. Richmond's paintings are close in style to his father's work, but distinguished by the characteristic use of dark stippling in the background. His paintings were criticised for their overly idealised and sugary presentations of subjects, especially women. When John Ruskin's father commissioned Richmond to paint his daughter-in-law Effie Gray, Effie wrote of the finished work to her mother:\n\n'...it is the most lovely piece of oil painting but much prettier than me. I look like a graceful Doll but John and his father are delighted with it'.Richmond and his brother George had met Ruskin during his trip to Rome in 1840-1. He accompanied him on his visits to galleries. Ruskin's father was not as delighted with the portrait of Effie as she believed. He wrote to his son that Thomas was inferior as an artist to his brother: \"Tom I regret to say cannot hold a candle to George - It is second rate or lower\".Richmond died in 1874 at Windermere, where he had purchased an estate, but was buried in Brompton cemetery, London.", "link_mentions": [{"page": "George Richmond (painter)", "response": ["He was the son of Thomas Richmond, miniature-painter, and was the father of the painter William Blake Richmond as well as the grandfather of the naval historian, Admiral Sir Herbert Richmond.", "George was born at Brompton, then a country village, on 28 March 1809. His mother, Ann Richmond, came of an Essex family named Oram, and was a woman of great beauty and force of character. His brother Thomas Richmond was also a portrait artist."]}, {"page": "Tom Richmond", "response": ["*Thomas Richmond (1802–1874), British portrait painter", "*Thomas Richmond (miniature-painter) (1771–1837), English miniature-painter"]}, {"page": "Sir Samuel Barnardiston, 2nd Baronet", "response": ["He succeeded to the title of 2nd Baronet Barnardiston, of Brightwell Hall, Suffolk on 8 November 1707, on the death of his uncle, Sir Samuel Barnardiston, 1st Baronet.Arthur Collins, The English Baronetage: Containing a Genealogical and Historical Account of All the English Baronets, Now Existing (Tho. Wotton, 1741), p. 400. He married Martha Richmond, daughter of Thomas Richmond, on 13 August 1709, with a portion of £6,000."]}, {"page": "Thomas Richmond (miniature-painter)", "response": ["thumb|The grave of Thomas Richmond, St Marys Gardens, Paddington", "Thomas Richmond  (1771–1837) was an English miniature-painter.", "He was son of Thomas Richmond, originally of Bawtry, and of an old Yorkshire family. His father was 'groom of the stables' to the Duke of Gloucester, and afterwards the proprietor of the Coach and Horses at Kew, where the artist was born in 1771. His mother, Ann Bone, was a cousin of George Engleheart, 'miniature-painter to the king.'", "His eldest son, also named Thomas Richmond, was  born in 1802. His younger son, George Richmond, inherited many of his works. Both of his children also became noted artists."]}, {"page": "Thomas Richmond II", "response": ["#REDIRECT Thomas Richmond"]}, {"page": "Benjamin Godwin", "response": ["Godwin had now achieved his ambition. In 1830 Godwin launched himself on what he, and his wife, believed was their next challenge and that was to oppose slavery. After consulting the leading abolitionist James Stephen, he gave a series of well-attended talks at the newly built Bradford Exchange buildings. The lectures were given with an entrance fee of a shilling, but these were more than just a series of four plain lectures. Godwin had not only prepared transparencies he had also hired an artist to prepare large paintings that could illustrate the results of slavery. The young artist was called Thomas Richmond (and he may be this one). Godwin believed that the truth would make its own argument and he just needed to make sure that the information was presented and that it was accessible. Godwin wanted minds to be persuaded so he had Thomas Richmond prepare a second series of panels that illustrated the benefits of an egalitarian and multi-racial world that result from the abolition of slavery.Historical Perspectives on the Transatlantic Slave Trade in Bradford, Yorkshire Abolitionist Activity 1787-1865, James Gregory, Plymouth University, History & Art History, Academia.edu, retrieved 30 July 2014 "]}, {"page": "Richmond, Thomas", "response": ["#redirectThomas Richmond"]}]}}