{"wiki_id": "http://www.wikidata.org/entity/Q7793683", "itemLabel": "Thomas Russell", "itemDescription": "English cricketer (1863-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Russell_(cricketer)", "wikipedia_page": {"main": "Thomas Russell (6 July 1863 – 28 February 1927), birth registered as Thomas Marychurch Freeman, was an English cricketer. He was a right-handed batsman and wicket-keeper who played for Essex and Marylebone Cricket Club. He was born in Lewisham and died in Leyton.\nRussell played his first two matches for Essex in miscellaneous fixtures against Leicestershire during the 1893 season, featuring in a game against a team of touring Australians just six weeks later, a match in which one-time Test cricketer and Wisden Cricketer of the Year Walter Mead picked up seventeen wickets, the most valuable haul ever made in a first-class cricket match by an Essex player.\nRussell's debut first-class match came in 1894, when Essex played in eight miscellaneous first-class fixtures against county-representative teams who, the following year, would convene to set up the brand new County Championship, running its first full season in 1895. Russell performed well, scoring two half-centuries, and making twenty-seven catches and six stumpings as a wicket-keeper. His debut century would follow in a game against Surrey which the team would win by an innings margin.\nThe final match of Russell's 1896 season saw him score a pair, though confidence was restored when Russell made two stumpings in the first game of 1897. Essex performed well throughout this season, finishing third in the County Championship with seven wins under their belt from a sixteen-match campaign. 1898 was Russell's second-highest scoring season, despite him playing six more first-class matches than in his highest, two years previously. This season also saw him score his second of three first-class centuries, scoring his highest career score thus-far of 122 not out against Hampshire, a score which would only be improved upon once, in a game against Derbyshire, against whom he made an innings of 139 in 1900.\nWhile the opening few years of the 20th century proved a goldmine for Russell, a consistent batsman amongst a number of inconsistent players, he would not reach the dizzy heights of his three century innings in the second half of his career that he did in the first, making a top score in his final five seasons of just 54 and moving, towards the end of his career, back to the tailend of the Essex batting line-up where he spent occasional matches in his early years at the club. Essex finished second-bottom of the County Championship table during the 1904 season.\nRussell's final season as an Essex player was a benefit season, in which he played one match, a heavy defeat at the hands of Surrey. Russell later joined a growing list of first-class cricketing umpires, taking charge of 150 matches between 1912 and 1925.\nRussell's extended family of cricket-playing relatives included brother Edward Russell, cousins Tich, Edward and John, great-nephew Douglas Freeman, son Jack Russell and uncle Edward.", "link_mentions": {}}}