{"wiki_id": "http://www.wikidata.org/entity/Q7791910", "itemLabel": "Thomas Logie MacDonald", "itemDescription": "British politician (1901-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Logie_MacDonald", "wikipedia_page": {"main": "Thomas Logie MacDonald FRSE FRAS (1901–1973) was a Scottish astronomer and politician, and eponym of lunar crater McDonald.\nHe was a graduate of Glasgow University, and became secretary and chairman of the West of Scotland branch of the British Astronomical Association. From 1929 to 1931 he served as President of the West of Scotland Branch of the British Astronomical Association.He was elected a fellow of the Royal Society of Edinburgh on 5 March 1928. His proposers were Hector Copland Macpherson, Ralph Allan Sampson, Ludwig Becker and Edward Taylor Jones. He resigned from the Society in 1961.\nFrom 1938 he served as Director of the Lunar Section of the British Astronomical Association, serving throughout the Second World War until 1946. At this time he lived at 9 Colebrooke Terrace in Glasgow.MacDonald was a Labour councillor and Mayor of Carlisle from May 1961 to 1962. \nThe Carlisle/Flensburg (Germany) town twinning relationship was established during his mayoral term.", "link_mentions": [{"page": "Logie", "response": ["*Thomas Logie MacDonald (1901–1973), Scottish astronomer and politician and eponym of lunar crater McDonald"]}, {"page": "McDonald (crater)", "response": ["McDonald is a small lunar impact crater located in the central Mare Imbrium. It was named after American benefactor William Johnson McDonald and Scottish selenographer Thomas Logie MacDonald. This crater is a cup-shaped feature with a circular rim, and has not been significantly eroded. It lies to the southeast of the slightly larger crater Carlini, in an isolated part of the mare."]}, {"page": "Thomas Logie McDonald", "response": ["#Redirect Thomas Logie MacDonald"]}, {"page": "Clan Macdonald of Clanranald", "response": ["* Thomas Logie MacDonald (1901–1973), Scottish astronomer"]}, {"page": "Thomas MacDonald", "response": ["* Thomas Logie MacDonald (1901–1973), Scottish astronomer"]}, {"page": "List of people from Carlisle", "response": ["*Thomas Logie MacDonald, ex-Mayor and astronomer who had a lunar crater named after him"]}, {"page": "List of mayors of Carlisle", "response": ["*1961-62: Thomas Logie MacDonald, astronomer"]}]}}