{"wiki_id": "http://www.wikidata.org/entity/Q7793450", "itemLabel": "Thomas Rees", "itemDescription": "Welsh Unitarian minister and scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Rees_(Unitarian)", "wikipedia_page": {"main": "Thomas Rees (1777 – 1 August 1864), Welsh Nonconformist divine, was a Unitarian minister and scholar.\nRees was educated at the Presbyterian College, Carmarthen.  He entered the Unitarian ministry in 1807 at the Newington Green Unitarian Church, London. He went to Southwark in 1813, earned the degree of LL.D. of Glasgow in 1819, and went to Stamford Street, Blackfriars, in 1823.\nHe had great knowledge of the history of anti-trinitarian opinion, especially of the 16th century. He published papers, chiefly in the Monthly Repository between 1818 and 1822, on such subjects as Faustus Socinus and Francis David, including The Italian Reformation, Memoirs of the Socini. Financial troubles drove him to Spain in 1853, and he died in obscurity in Brighton.", "link_mentions": [{"page": "Thomas Rees", "response": ["Thomas Rees may refer to:", "* Thomas Rees (Congregational minister) (1815–1885), Welsh Congregationalist minister", "* Thomas Rees (theologian) (1869–1926), Welsh theologian and editor, principal of Bala-Bangor Independent College, see 1926 in Wales", "* Thomas Rees (Unitarian) (1777–1864), Welsh Unitarian minister and scholar", "* Thomas Rees (Twm Carnabwth) (1806–1876), Welsh leader of the Rebecca Riots, also known as Twm Carnabwth", "* Thomas Rees (mayor) (1844–1921), master builder and mayor of Brisbane, Queensland, Australia"]}, {"page": "Racovian Catechism", "response": ["A revised Latin edition of the Racovian catechism appeared in 1680 in Amsterdam, revised by Sozzini's grandson Andrzej Wiszowaty Sr. and great-grandson Benedykt Wiszowaty. This was the base of Thomas Rees' 1818 English translation.The Racovian Catechism, with Notes and Illustrations Rees Thomas 1818 \"Wissowatius revised the text, and introduced into it most of the emendations suggested by ... Besides these, several other notes from the pen of his learned nephew Benedict Wissowatius are likewise inserted here,\"", "The Racovian Catechism makes muted reference to the devil in seven places\"attributed to the devil\" p.7, \"destroy hell and death, and the devil who held the empire of death\" 162, \"principally the devil, the author and active promoter of temptations\" 188, quoting Paul 193, \"those who detain him are sin, the world, the devil, and death\" 314, \"gave them up to the power of Satan\" 346, quoting Paul \"not a novice, lest he fall under the temptation of the devil\" 374, in 1818 edition) which prompts the 1818 translator Thomas Rees, to footnote references to the works of Hugh Farmer (1761) and John Simpson (1804). Yet these references are in keeping with the somewhat subdued handling of the devil in the Biblioteca Fratrum Polonorum.e.g. Walter Scott in The existence of evil spirits proved: and their agency argued that even Socinus and Crellius did not suspect otherwise, but can only marshall (p.23) little more than an example of Crell quoting Paul The Collegia Vicentina at Vicenza (1546) had questioned not only the existence of the devil but even of angels.", "* 1818 English: The Racovian Catechism of 1605 A Sketch of the History of Unitarianism in Poland and the adjacent countries. Thomas Rees, F.S.A. London: Printed for Longman"]}, {"page": "Unitarian Meeting House, Ipswich", "response": ["|Thomas Rees"]}, {"page": "1777 in Wales", "response": ["**Thomas Rees, Unitarian minister (died 1864)"]}, {"page": "Thomas Rees (Unitarian minister)", "response": ["#REDIRECT Thomas Rees (Unitarian)"]}, {"page": "Gellionnen Chapel", "response": ["Josiah Rees was succeeded by his son, Dr Thomas Rees (1805–06). Thomas Rees wrote a history of Unitarianism and translated the Racovian Catechism and was an important Unitarian minister in London. His brother, Owen Rees, was a co-founder of Longman's publishing firm.", "After Thomas Rees' departure David Oliver, a General Baptist from Aberdare, minister from 1806 to 1814. His ministry was relatively conservative and there was unrest among the congregation. During this period, Independents led by the minister from Mynyddbach Chapel, attempted to seize control of Gellionnen. The power struggle between the Independents and the Arminian/Unitarians was settled \"after a battle of words and fists\" outside the chapel, with the Arminian/Unitarian faction victorious.", "* Thomas Rees (1805–06)"]}]}}