{"wiki_id": "http://www.wikidata.org/entity/Q780860", "itemLabel": "Leslie Henson", "itemDescription": "English actor, producer and comedian (1891-1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Henson", "wikipedia_page": {"main": "Leslie Lincoln Henson (3 August 1891 – 2 December 1957) was an English comedian, actor, producer for films and theatre, and film director.  He initially worked in silent films and Edwardian musical comedy and became a popular music hall comedian who enjoyed a long stage career. He was famous for his bulging eyes, malleable face and raspy voice and helped to form the Entertainments National Service Association (ENSA) during the Second World War.\nBorn in Notting Hill, London, Henson became interested in the theatre from an early age, writing and producing theatrical pieces while at school.  He studied with \"the Cairns–James School of Musical and Dramatic Art as a child, making his professional stage début at the age of 19. His first West End role was in Nicely, Thanks! (1912) and he later starred in several hit West End Edwardian musical comedies, including To-Night's the Night (1915) and Yes, Uncle! (1917). After briefly serving with the Royal Flying Corps, he was released from active service by the British government to help run a concert party called \"The Gaieties\", which provided entertainment for the troops during World War I.  After the war, he returned to the West End, playing in Kissing Time (1919) and a series of musical comedies and farces throughout the 1920s and 1930s.\nAt the start of World War II, together with Basil Dean, he helped to form ENSA, with which he entertained British troops abroad.  Henson's postwar stage success continued in revues, musicals and plays, including a West End adaptation of The Diary of a Nobody in 1955.  Henson's film career was intermittent, and he made 14 films from 1916 to 1956. The most notable of these was Tons of Money in 1924, which introduced the popular Aldwych farces to British cinema audiences. In 1956, Henson's friend Bobby Hullett died in circumstances that struck him as suspicious. Henson anonymously notified the police that her doctor, John Bodkin Adams, should be investigated. Adams was subsequently tried for a different murder but acquitted.", "link_mentions": [{"page": "It's That Man Again", "response": ["|Vera Lennox (1903–1984) was a comedienne, singer and dancer. She appeared in many musical comedies and light non-musical plays in the 1920s and 30s, often with Leslie Henson, mostly in the West End, but also on Broadway. The Times praised her \"spirited charm\"."]}, {"page": "Stanley Holloway", "response": ["In 1913 Holloway was recruited by the comedian Leslie Henson to feature as a support in Henson's more prestigious concert party called Nicely, Thanks. In later life, Holloway often spoke of his admiration for Henson, citing him as a great influence on his career. The two became firm friends and often consulted each other before taking jobs. In his 1967 autobiography, Holloway dedicated a whole chapter to Henson,Holloway and Richards, p. 289 whom he described as \"the greatest friend, inspiration and mentor a performer could have had\". Later in 1913, Holloway decided to train as an operatic baritone, and so he went to Italy to take singing lessons from Ferdinando Guarino in Milan. However, a yearning to start a career in light entertainment and a contract to re-appear in Bert Graham and Will Bentley's concert party at the West Cliff Theatre caused him to return home after six months.Holloway and Richards, pp. 54–55", "Holloway spent much of his time in the later part of the war organising shows to boost army morale in France.Holloway and Richards, pp. 60 and 76 One such revue, Wear That Ribbon, was performed in honour of O'Leary winning the VC. He, Henson and his newly established Star Attractions concert party, entertained the British troops in Wimereux.Holloway and Richards, p. 19 The party included such performers as Jack Buchanan, Eric Blore, Binnie Hale, and Phyllis Dare, as well as the performers who would later form The Co-Optimists.Holloway and Richards, p. 20 Upon his return from France, Holloway was stationed in Hartlepool,Holloway and Richards, p. 76 and immediately after the war ended he starred in The Disorderly Room with Leslie Henson, which Eric Blore had written while serving in the South Wales Borderers. The production toured theatres on England's coast, including Walton-on-the-Naze and Clacton-on-Sea.", "thumb|left|200px|alt=stage shot of two actors in mid scene dressed in historic war costumes|Holloway as Sam Small in Fine and Dandy with Leslie Henson", "Holloway, Violet and Julian lived mainly in the tiny village of Penn, Buckinghamshire.Holloway and Richards, p. 322 Holloway also owned other properties including a flat in St John's Wood in North West London,Holloway's Flat in St. John's Wood (1933). Hulton Archive, GettyImages.co.uk, accessed 30 November 2011 which he used when working in the capital,Holloway and Richards, p. 172 and a flat in Manhattan during the My Fair Lady Broadway years. The final years of his life were spent in Angmering, West Sussex, with Violet. Holloway forged close friendships with fellow performers including Leslie Henson, Gracie Fields, Maurice Chevalier, Laurence OlivierHolloway and Richards, p. 227 and Arthur Askey, who said of him, \"He was the nicest man I ever knew. He never had a wrong word to say about anyone. He was a great actor, a super mimic and a one-man walking comic show.\"\"Stanley Holloway dies, 91\", The Sunday Express, 31 January 1982 While working in the US, Holloway numbered among his friends Frank Sinatra, Dean Martin, Burgess Meredith and Groucho Marx.Holloway and Richards, p. 333"]}, {"page": "John Le Mesurier", "response": ["In July 1934, the studio staged their annual public revue in which both Le Mesurier and Guinness took part; among the judges for the event were John Gielgud, Leslie Henson, Alfred Hitchcock and Ivor Novello. Le Mesurier received a Certificate of Fellowship, while Guinness won the Fay Compton prize. After the revue, rather than remain at the studio for further tuition, Le Mesurier took an opportunity to join the Edinburgh-based Millicent Ward Repertory Players at a salary of £3.10s (£3.50) a week."]}, {"page": "Lytham St Annes", "response": ["Northwards along the coast from Lytham, within the Clifton estates, were mostly sand dunes. The only habitations were the tiny hamlet of Heyhouses and the rural Trawl Boat Inn (a name resurrected in recent times for a public house in Wood Street in St Annes, opened by Wetherspoons). In 1873 the Cliftons built a Chapel of Ease dedicated to St Anne in this area, to encourage better religious observance, as most inhabitants found the long journey to St Cuthbert's in Lytham too onerous. This became the parish church of St. Anne's. At the time it was built the church had no tower. On 14 October 1874 the St Anne's-on-the-Sea Land and Building Company Ltd was registered, mainly at the instigation of Elijah Hargreaves, a wealthy Lancashire mill owner from Rawtenstall whose intention was to develop the area as a resort. The land of St Annes was leased from the Clifton estate for 999 years, although the lease still gave the Cliftons the right to kill game on the land for this period. Building rapidly commenced with the St Anne's Hotel (built in 1875, since demolished), the Hydro Terrace, which later became St Annes Square, and the railway station being among the first buildings. A separate company was formed to finance the construction of the pier, which was opened on 15 June 1885. At that time the main channel of the River Ribble ran by the end of the pier, and boats would bring people in from Lytham and Southport. The Ribble Navigation Act of 1883, which came into force in 1889, was intended to stabilise the often silted River Ribble to allow a steady trade into Preston docks. However, this work moved the main channel much further out and left St Annes Pier on flat sandbanks, where no ships could dock. In June 1910 the Floral Hall was opened at the end of the pier. It was a popular attraction and stars including Gracie Fields, Leslie Henson and Claude Hulbert all performed there. Lytham and St Annes were consolidated in 1922. In 1974 a major fire seriously damaged the hall. It was restored to some extent, it ended up being used as a skatepark (skateboards) before another fire in July 1982 destroyed it. About half the pier was then demolished to make the beach safe to use.Harrison (1971)"]}, {"page": "List of show business families", "response": ["* Comedian Leslie Henson was the father of actor Nicky Henson and farmer and T.V presenter Joseph Henson. Nicky was married to actress Una Stubbs; their sons were composers Christian Henson, best known as the composer of the themes to Top Gear and Two pints of lager and a packet of crisps and Joe Henson. Their cousin is Adam Henson, whose father was Joseph Henson."]}, {"page": "Guy Bolton", "response": ["During the 1920s and 30s \"Bolton worked at a tremendous rate on shows … beautifully constructed, and full of fun and excruciating puns.\" When the Gershwins began to take a more serious tone, with Of Thee I Sing, Bolton persisted with his \"frothy confections\" for other composers. He moved to London, where he wrote (or co-wrote, generally with Thompson and sometimes also with Douglas Furber) the book for \"a series of highly successful romps\" starring London's leading music comedy performers such as Jack Buchanan, Leslie Henson, Bobby Howes, Evelyn Laye and Elsie Randolph, in shows including Song of the Drum (1931), Seeing Stars (1935), At the Silver Swan (1936), This'll Make You Whistle (1935; film version 1936), Swing Along (1936), Going Places (1936), Going Greek (1937), Hide and Seek (1937), The Fleet's Lit Up (1938), Running Riot (1938), Bobby Get Your Gun (1938) and Magyar Melody (1939)."]}, {"page": "Eric Blore", "response": ["Blore wrote several sketches for revue and variety, including \"Violet and Pink\" (1913); \"A Burlington Arcadian\" (1914); \"The Admirable Fleming\" (1917); \"Yes, Papa\" (1921); \"French Beans\" (1921) and his most enduring sketch, \"The Disorderly Room\", written while he was in the army, and first given in London by Stanley Holloway, Tom Walls, Leslie Henson, Jack Buchanan and the author. It was taken up by Tommy Handley who starred in it in music halls around the country and on BBC radio in the 1920s and 30s.Holloway and Richards, pp. 23, 60 and 190\"Eric Blore\", British Film Institute. Retrieved 13 June 2020"]}, {"page": "Sally (musical)", "response": ["The musical enjoyed a successful production in 1921 in London at the Winter Garden Theatre, starring British musical comedy veterans George Grossmith Jr. and Leslie Henson, which ran for 387 performances."]}, {"page": "John Bodkin Adams", "response": ["Adams' career was very successful; the journalist Rodney Hallworth later claimed that, by 1956, he was reputed to be the wealthiest doctor in England, although without citing any evidence. A similar, and similarly unsourced, claim that \"he was probably the wealthiest GP in England\" was made by Cullen. He attended some famous and influential people in the region, including MP and Olympic medal winner Lord Burghley, society painter Oswald Birley, Admiral Robert Prendergast, industrialist Sir Alexander Maguire, the 10th Duke of Devonshire, Eastbourne's Chief Constable Richard Walker and many businessmen. After years of rumours, and Adams having been mentioned in at least 132 wills of his patients, on 23 July 1956 Eastbourne police received an anonymous call about a death. It was from Leslie Henson, the music hall performer, whose friend Gertrude Hullett had died unexpectedly while being treated by Adams."]}, {"page": "Entertainments National Service Association", "response": ["The Entertainments National Service Association (ENSA) was an organisation established in 1939 by Basil Dean and Leslie Henson to provide entertainment for British armed forces personnel during World War II. ENSA operated as part of the Navy, Army and Air Force Institutes. It was superseded by Combined Services Entertainment (CSE) which now operates as part of the Services Sound and Vision Corporation (SSVC).Myers, Rollo. 'Music in Battle-dress', in Music Since 1939 (1947), pp. 9-30"]}, {"page": "Shaftesbury Theatre", "response": ["In September 1919, the Theatre had considerable success with a season of Gilbert and Sullivan operas, presented by the D'Oyly Carte Opera Company. The success of these revivals led to a number of similar seasons over the next few decades, with the Theatre selling out every time. Other productions during this time included The Return of Sherlock Holmes starring Eille Norwood and a season of classical plays, including Medea and Macbeth, starring Sybil Thorndike. In 1928, Fred and Adele Astaire starred in Funny Face with Leslie Henson. The musical was a great success, but was cut short by a gas explosion on High Holborn outside the Theatre."]}, {"page": "Gillian Lynne Theatre", "response": ["Grossmith then partnered with George Edwardes's former associate, Pat Malone, to produce a series of mostly adaptations of imported shows at the Winter Garden between 1920 and 1926: Sally (1921), The Cabaret Girl (1922, with book by Wodehouse and music by Jerome Kern), The Beauty Prize (1923, with Wodehouse and Kern), a revival of Tonight's the Night (1923), Primrose (1924, with music by George Gershwin), Tell Me More (1925, with words by Thompson and music by George Gershwin)Tell Me More review in The Times, 27 May 1925 p. 14 and Kid Boots (1926 with music by Harry Tierney),Kid Boots review in The Times 3 February 1926, p. 12 many of them featuring Leslie Henson. Grossmith co-wrote some of the Winter Garden pieces, directed many of his own productions and starred in several, notably as Otis in Sally. Several of the later productions lost money, and Grossmith and Malone ended the partnership."]}, {"page": "Harvey (play)", "response": ["The play also had a production in 1949 at London's Prince of Wales Theatre starring Sid Field and Athene Seyler then, after Field's death, Leslie Henson."]}, {"page": "Henson (name)", "response": ["* Leslie Henson (1891–1957), British actor", "* Nicky Henson (1945–2019), British actor, son of Leslie Henson"]}, {"page": "The Disorderly Room", "response": ["The Disorderly Room is a musical comedy sketch written by the actor and writer Eric Blore during the First World War. It was first performed at the Victoria Palace Theatre, London, in 1919 and starred Blore, Stanley Holloway, Tom Walls, Leslie Henson and Jack Buchanan.Holloway and Richards, p. 23 The sketch consists of supposed military disciplinary proceedings put to the tunes of popular songs of the day."]}, {"page": "Binnie Hale", "response": ["She finally starred in the title role of a hit musical, No, No, Nanette, in 1925 at the Palace Theatre. She also played the title role in the London production of Sunny (1926).  She began her film career in 1927 in the short film On with the Dance, with Leslie Henson and her brother. She was Jill in the long-running British musical Mr. Cinders (1929).Kenrick, John. \"Who's Who in Musicals: Hale–Harris\", Musicals101.com, 2007, accessed 6 February 2015 Her recording of the song \"Spread a Little Happiness\" from that musical is possibly her best remembered recording. Mr. Cinders was the first of three shows in which she appeared with Bobby Howes. Next, she starred in the title role of Nippy (1930); in Bow Bells, together with her father (1932); and The Dubarry as Jeanne (1932 UK tour)."]}, {"page": "Graham Payn", "response": ["In 1941 and 1942, he appeared in Up and Doing, a revue, with Leslie Henson, Binnie Hale, Cyril Ritchard and Stanley Holloway,The Times. 21 August 1941. p. 6. and its successor Fine and Dandy, with the cast unchanged except for Dorothy Dickson replacing Binnie Hale.The Times. 23 April 1942; and 19 October 1942. p. 8. In the latter show Payn and Patricia Burke sang Rodgers and Hart's \"This Can't Be Love\" and later, Coward's \"London Pride\". One night, Coward came backstage after the performance. Payn later wrote,  \"I remember being very nervous, not having seen him for the best part of 10 years, though I was pleased as punch to be recognised in my own right.\" Coward's verdict was, \"Very good. Splendid.\"Payn, p. 26.", "In Magic Carpet, Payn appeared with Sydney Howard and then, after The Lilac Domino (1944),Shorter, Eric; Hoare, Philip (9 November 2005). \"Graham Payn\". The Guardian. Retrieved 27 September 2013. he played Lewis Carroll, the Mock Turtle and Tweedledum in Clemence Dane and Richard Addinsell's musical version of Alice in Wonderland (1944). In the Leslie Henson show Gaieties (1945) Payn and Walter Crisham sang and danced \"White Tie and Tails\". Coward came backstage after a performance and offered Payn a leading part in his forthcoming show, Sigh No More, which, Payn wrote in his memoirs, \"marked the beginning of a personal and professional relationship between Noël and myself that would last until his death.\"Payn, p. 31."]}, {"page": "It's a Boy", "response": ["* It's a Boy!, a 1930 British stage show co-produced by and starring Leslie Henson", "* It's a Boy (film), a 1933 British film starring Leslie Henson and directed by Tim Whelan"]}, {"page": "Nicky Henson", "response": ["Nicholas Victor Leslie Henson (12 May 1945 – 15 December 2019) was a British actor.", "Henson was born in London, the son of Harriet Martha (Collins) and comedian Leslie Henson. Adam Henson, a farmer and regular presenter on BBC TV's Countryfile, is the son of Nicky's brother, Joe Henson."]}, {"page": "George Robey", "response": ["In December 1954, a memorial service for Robey was held at St Paul's Cathedral. The diverse congregation consisted of royalty, actors, hospital workers, stage personnel, students and taxi drivers, among others. The Bishop of Stepney, Joost de Blank, said: \"We have lost a great English music hall artist, one of the greatest this country has known in the late nineteenth and twentieth centuries.\"Cotes, p. 3. Performers gave readings at the service, including the comedian Leslie Henson, who called Robey \"that great obstinate bullock of variety\". In his lifetime, Robey helped to earn more than £2,000,000 for charitable causes, with £500,000 of that figure being raised during the First World War.\"Sir George Robey: The Prime Minister of Mirth\", it's-behind-you.com, accessed 8 December 2013. In recognition of his efforts, the Merchant Seaman's Convalescent Home in Limpsfield, Surrey, named a ward after him, and managerial staff at the Royal Sussex Hospital later bought a new dialysis machine in his memory.Cotes, p. 7."]}, {"page": "Basil Dean", "response": ["Together with Leslie Henson, Dean set up and ran the Entertainments National Service Association, or ENSA, in 1939 to provide a wide range of entertainment for British armed forces personnel during the Second World War. After the war he resumed his West End career successfully but without regaining his pre-war dominance.", "As the Second World War loomed, Dean published his suggestions on how the entertainments industry could help to sustain the morale of the civilian public and members of the armed forces when war came. For this he was derided by some colleagues, such as George Black of the London Palladium, who were convinced there would be no war.Merriman, p. 2 Dean ignored his critics and formed an alliance with the comedian and theatre owner Leslie Henson, who had been a leading figure in entertainments for the troops in the First World War."]}, {"page": "Walter Passmore", "response": ["Next Passmore toured in Merrie England again in 1911. He appeared as Nikola in Baron Trenck at the Strand Theatre (1911),Wearing, p. 197 as Alphonse Bouchotte in Oh! Oh! Delphine in 1913 at the Shaftesbury Theatre,  and as Jericho Mardyke in Our Nell in 1924 at the Gaiety Theatre.  He also appeared in Madame Pompadour (1924). A late Gilbert and Sullivan performance was in Trial by Jury at a benefit matinée for Courtice Pounds in 1927, when Passmore was joined by stars including Leslie Henson and Derek Oldham.The Times, 13 December 1927, p. 18 After this long career, his last role was Count Theodore Volney in 1933 in The Damask Rose."]}, {"page": "George Grossmith Jr.", "response": ["Grossmith established himself as a major producer, together with Edward Laurillard, of such hits as Tonight's the Night (1914), Theodore & Co (1916) and Yes, Uncle! (1917). He wrote the long-running revue series that began with The Bing Boys Are Here (1916), scheduling these projects around his naval service in World War I. He then produced Eastward Ho! (1919) and produced, co-wrote, directed and sometimes starred in, Kissing Time (1919), A Night Out (1920), Sally (1921), The Cabaret Girl (1922), The Beauty Prize (1923) and Primrose (1924), many of these featuring Leslie Henson. He also continued to appear in other producers' shows, including The Naughty Princess (1920) and No, No, Nanette (1925).", "Grossmith and Laurillard built their own theatre, the Winter Garden, on the site of an old music hall in Drury Lane. They opened the theatre in 1919 with Grossmith and Leslie Henson starring in Kissing Time (1919, with a star-studded cast, a book by P.G. Wodehouse and Guy Bolton and music by Ivan Caryll), followed by A Night Out (1920). Grossmith and Laurillard also became managers of the Apollo Theatre in 1920 (they had produced The Only Girl there in 1916 and Tilly of Bloomsbury there in 1919).Apollo Theatre . Click History tab for information about Grossmith's management of the theatre. Retrieved 15 April 2010 But expanding their operation caused Grossmith and Laurillard to end their partnership, with Grossmith retaining control of the Winter Garden.", "Grossmith partnered with Edwardes's former associate, J. A. E. Malone, to produce a series of mostly adaptations of imported shows at the Winter Garden from 1921 to 1926: Sally (1921), The Cabaret Girl (1922, with book by Wodehouse and music by Jerome Kern), The Beauty Prize (1923, with Wodehouse and Kern), a revival of Tonight's the Night (1923), Primrose (1924, with music by George Gershwin), Tell Me More (1925, with words by Thompson and music by George Gershwin)Tell Me More review in The Times, 27 May 1925, p. 14 and Kid Boots (1926 with music by Harry Tierney),Kid Boots review in The Times 3 February 1926, p. 12 many of them featuring Leslie Henson. Grossmith co-wrote some of the Winter Garden pieces, directed many of his own productions and starred in several, notably as Otis in Sally. Several of the later productions lost money, and Grossmith and Malone ended the partnership."]}, {"page": "Tom Walls", "response": ["Walls spent his early years as an actor, from 1905, mostly in musical comedy, touring the British provinces, North America and Australia and in the West End. He specialised in comic character roles, typically flirtatious middle aged men. In 1922 he went into management in partnership with the comic actor Leslie Henson. They had an early success in the West End with a long-running farce, Tons of Money, after which Walls commissioned and staged a series of farces at the Aldwych Theatre that ran almost continuously over the next decade. He and his co-star Ralph Lynn were among the most popular British actors of their time.", "Back in London, Walls had substantial roles in The Sunshine Girl (1912); The Marriage Market (1913) and A Country Girl (1915). Later in 1915 he played Coquenard in a revival of Messager's Veronique; between then and 1921 he appeared in nine other musical comedies and a pantomime. His best known show of these years was probably Kissing Time (1919), in which he played Colonel Bolinger opposite Leslie Henson.Findon, B. H., \"Kissing Time\", The Play Pictorial, May 1919, p. 82. His biographer, Sean Fielding, writes, \"His forte was the portrayal of amiable philanderers or eccentric older gentlemen, usually with a forceful, even hectoring manner.\"", "Walls went into partnership with Henson and became managing director of Tom Walls and Leslie Henson, Ltd, controlling several touring companies.  In 1922 the partnership presented the farce Tons of Money at the Shaftesbury Theatre. It was a great popular success, running for nearly two years. Walls played a supporting role in the piece and cast Ralph Lynn in the leading part, propelling Lynn to stardom. Walls took a lease of the Aldwych Theatre, where he and Henson presented another farce, It Pays to Advertise, which ran for nearly 600 performances.\"Mr. Ralph Lynn\", The Times, 10 August 1962, p. 11 To replace the piece, Walls acquired the rights to another farce, A Cuckoo in the Nest by Ben Travers."]}, {"page": "The Demi-Paradise", "response": ["* Leslie Henson as himself"]}, {"page": "Theodore & Co", "response": ["Theodore & Co is an English musical comedy in two acts with a book by H. M. Harwood and George Grossmith Jr. based on the French comedy Théodore et Cie by Paul Armont and Nicolas Nancey, with music by Ivor Novello and Jerome Kern and lyrics by Adrian Ross and Clifford Grey.  It was produced by Grossmith and Edward Laurillard and directed by Austen Hurgon, opening at the Gaiety Theatre on 19 September 1916 and running for 503 performances.  It starred Grossmith, Fred Leslie and Leslie Henson.", "*Pony Twitchen (of the \"Crimson Comics\") – Leslie Henson"]}, {"page": "Yes, Uncle!", "response": ["Yes, Uncle! is a musical comedy by Austen Hurgon and George Arthurs, with music by Nat D. Ayer and lyrics by Clifford Grey (who also wrote The Bing Boys are Here and the following series of highly successful reviews).  The story is based on the farce Le truc du Brésilien by Nicolas Nancey and Paul Armont, and the musical takes its title from the catch-phrase used by Bobby Summers and Mabel Mannering, addressing Uncle Brabazon Hollybone.  It was produced by George Grossmith, Jr. and Edward Laurillard and opened at the Prince of Wales Theatre in London on 16 December 1917 and ran for a very successful 626 performances.  The piece starred Fred Leslie as G.B. Stark, Margaret Bannerman as Joan and Leslie Henson as Bobby Summers.  Later, Madge Elliott and Cyril Ritchard starred in the musical.", "*Bobby Summers – Leslie Henson"]}, {"page": "To-Night's the Night (musical)", "response": ["The musical was produced by George Grossmith, Jr. and Edward Laurillard and directed by Austen Hurgon. It opened at the Shubert Theatre in New York on December 24, 1914. It then was produced at the Gaiety Theatre in London, opening on April 18, 1915 and running for a very successful 460 performances. Grossmith starred in the piece with Leslie Henson. Grossmith told The New York Times that the musical was the first Gaiety Theatre Company production presented in New York before opening in London.", "*Henry (His Nephew) – Leslie Henson "]}, {"page": "Death of Gertrude Hullett", "response": ["Gertrude Hullett, 50, became depressed after Jack's death, and Adams prescribed sodium barbitone and sodium phenobarbitone for her. Several of her friends and her household staff later told the police that she appeared to be drugged, and claimed that they had urged her to leave Eastbourne and Adams' care.Robins, p.20. Cullen reports that, over a period of 80 days, 1,512 grains of the former and 6¼ grains of the latter were prescribed, and she called this a large dose.Cullen, p. 158 However, Adams told the Coroner's inquest that it was his practice to give Mrs Hullett two 7½ grain sleeping tablets daily at first, which experts later confirmed was a normal dose, and that he later reduced this to two 6 grain, then to two 5 grain, tablets.Devlin, pp. 12-13 16. In the months immediately after her husband's death in March 1956, Mrs Hullett had told Adams of her wish to commit suicide, and letters found after her death show that she had seriously contemplated suicide in April 1956.Devlin, p. 12. Her friends who saw her in the days before her death described her mental state then as being more cheerful and natural than before, one likening her to \"a person who has come to a decision about something\".Robins, p.22. Mrs Hullett's daughter, a close friend and two servants later stated to the police that they believed that Mrs Hullett had taken her own life, the friend that had found the letters in which she had contemplated suicide calling it a \"planned suicide\".Robins, p.56. Leslie Henson, who anonymously contacted the police about the death, was working in Dublin around the time of Mrs Hullett's death.Robins, p.55.", "The next morning, at 8:30 a.m., Adams called the coroner to make an appointment for a private post-mortem. The coroner asked when the patient had died and Adams said she had not yet. Dr Harris visited again that day and Adams still made no mention of potential barbiturate poisoning. When Harris left, Adams administered a single injection of 10 cc of the Megimide. Mrs Hullett developed broncho-pneumonia and on the 23rd at 6:00 a.m., Adams gave Mrs Hullett oxygen.Cullen, p. 153 She died at 7:23 a.m. on the 23rd. The results of a urine sample taken on the 21st were received after Mrs Hullett's death, on the 24th. It showed she had 115 grains of sodium barbitone in her body, twice the fatal dose.Cullen, p. 161 Hullett's friend, actor Leslie Henson, knew that Mrs Hullett's husband had died four months earlier and that the two both saw Adams as their doctor. He telephoned the Eastbourne police anonymously to warn them of the fears he and his wife had, which was one of the reasons that an investigation was started.Cullen, p. 276 Henson, who was in Dublin when Mrs Hullett died, claimed that she was turning into a drug addict, and that the pills she had been prescribed had changed her personality and caused her death.Robbins, pp. 19-20. However, the coroner who had, in that official capacity, called the Eastbourne Chief Constable earlier was the more immediate cause of the police investigation.Robbins, p. 19."]}, {"page": "Death of Edith Alice Morrell", "response": ["The Eastbourne police had received an anonymous call, later discovered to be from the music hall performer Leslie Henson who had been working in Dublin at the time,Robins, p. 55. about the unexpected death of his friend Gertrude Hullett on 23 July 1956, while being treated by Adams.Cullen, pp. 15–17 Mrs Hullet had been depressed since the death of her husband four months earlier and had been prescribed sodium barbitone and also sodium phenobarbitone to help her to sleep.Cullen, p. 158 In the months immediately after her husband's death in March 1956, Mrs Hullett had told Adams of her wish to commit suicide. Her daughter, a close friend (who was also her executor) and her two servants later told the police that they believed that she had taken her own life, and the friend added that he had found the letters in which she had contemplated suicide in April 1956, calling her death a \"planned suicide\".Robins, p.56.Devlin, p. 12."]}, {"page": "Heather Thatcher", "response": ["She continued her London stage work, performing with June Clyde in Lucky Break. Premiering at the Strand Theatre in September 1934, the theatrical presentation was a production of Leslie Henson. In 1937, Thatcher went to America in Full House. The previous season, she was paired with Ivor Novello in the English rendition. Jack Buchanan, Austin Trevor and Coral Browne teamed with Thatcher in Canaries Sometimes Sing (1947). Produced by Firth Shephard, the theatrical presentation opened in Blackpool and moved to London a month later. Thatcher participated in a Salute To Ivor Novello at the London Coliseum in September 1951. The production raised funds to run his old home, Redroofs. It had been purchased by the Actors' Benevolent Fund."]}, {"page": "List of British films before 1920", "response": ["| The Lifeguardsman || Frank G. Bayley || Frederick Kerr, A.E. Matthews, Leslie Henson || Adventure ||"]}, {"page": "Funny Face (musical)", "response": ["The London production opened at Princes Theatre on November 8, 1928, and ran there until January 29, 1929. After a short tour of the UK provinces, the musical re-opened at the Winter Garden Theatre in London on March 11, 1929, where it ran until June 1929,Theatre Programme:  \"Funny Face\" Winter Gardens Theatre, London, dated \"June 17\" and \"last weeks\". chalking up a total of 263 performances. Leslie Henson shared top billing with Fred and Adele Astaire."]}, {"page": "Primrose (musical)", "response": ["Primrose was produced by Grossmith and J. A. E. Malone, who wanted to follow up on their earlier successes composed by Jerome Kern. It opened at the Winter Garden Theatre in London on 11 September 1924 only two months before the Gershwins’ Lady, Be Good! debuted on Broadway. The cast featured comedian Leslie Henson and also included Claude Hulbert, Heather Thatcher and opera baritone Percy Heming. The director was Charles A. Maynard, and the choreographer was Laddie Cliff.The Times 12 September 1924, p. 8Primrose, Gershwin.com, accessed July 10, 2017 Extensive excerpts from the score were recorded with original 1924 cast members conducted by Ansell, and have been re-released on CD. P. G. Wodehouse rewrote the lyric of 'When Toby is out of Town' as 'The Twenties are Here to Stay', interpolated into a 1960 revival of Gershwin's Oh, Kay!", "*Toby Mopham – Leslie Henson"]}, {"page": "List of British films of 1935", "response": ["|Oh, Daddy!||Graham Cutts, Austin Melford ||Leslie Henson, Robertson Hare||Comedy||"]}]}}