{"wiki_id": "http://www.wikidata.org/entity/Q7803521", "itemLabel": "Tim Foster", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Foster", "wikipedia_page": {"main": "Timothy James Carrington Foster, MBE (born 19 January 1970) is an English rower who won a gold medal at the 2000 Summer Olympics in Sydney, Australia.", "link_mentions": [{"page": "University of Oxford", "response": ["Rowers from Oxford who have won gold at the Olympics or World Championships include Michael Blomquist, Ed Coode, Chris Davidge, Hugh Edwards, Jason Flickinger, Tim Foster, Luka Grubor, Christopher Liwski, Matthew Pinsent, Pete Reed, Jonny Searle, Andrew Triggs Hodge, Jake Wetzel, Michael Wherley, and Barney Williams. Many Oxford graduates have also risen to the highest echelon in cricket: Harry Altham, Bernard Bosanquet (inventor of the googly), Colin Cowdrey, Gerry Crutchley, Jamie Dalrymple, Martin Donnelly, R. E. Foster (the only man to captain England at both cricket and football), C. B. Fry, George Harris (also served in the House of Lords), Douglas Jardine, Malcolm Jardine, Imran Khan (later served as the Prime Minister of Pakistan), Sophie Le Marchand, Alan Melville, Iftikhar Ali Khan Pataudi, Mansoor Ali Khan Pataudi, M. J. K. Smith, and Pelham Warner."]}, {"page": "1970", "response": ["** Tim Foster, British rower"]}, {"page": "Bedford", "response": ["Rowing is also a major part of the sports scene with a number of regatta events hosted throughout the year from February to October; the most significant of these being Bedford Regatta, which in terms of numbers of crews participating is the second largest in the country. It was on Bedford's River Great Ouse that Olympic rower, Tim Foster, honed his skills as a student of Bedford Modern and member of star club; indeed the borough has produced many other champions of sport past and present including Stephanie Cook, Gail Emms, Liz Yelling and Paula Radcliffe who is Life Vice-President of Bedford & County Athletic Club"]}, {"page": "Chiswick", "response": ["The Chiswick reach of the Thames is heavily used for competitive and recreational rowing. Championship Course from Mortlake to Putney runs past Chiswick Eyot and Duke's Meadows. The Boat Race is contested on the Championship Course on a flood tide (in other words from Putney to Mortlake) with Duke's Meadows a popular view-point for the closing stages of the race. The finishing post is just downstream of Chiswick Bridge.  Other important races such as the Head of the River Race race the reverse course, on an ebb tide. Chiswick is home to several clubs. The University of London Boat Club is based in its boathouse off Hartington Road, which also houses the clubs of many London colleges and teaching hospitals; recent members include Tim Foster, Gold medallist at the Sydney Olympics and Frances Houghton, World Champion in 2005, 2006 and 2007. Quintin Boat Club lies between Chiswick Quay Marina and Chiswick Bridge. Tideway Scullers School is just downriver of Chiswick Bridge; its members include single sculling World Champion Mahé Drysdale and Great Britain single sculler Alan Campbell."]}, {"page": "St Cross College, Oxford", "response": ["* Tim Foster, Olympic rowing gold medalist"]}, {"page": "Steve Redgrave", "response": ["* 2000 – Gold, Coxless Four (with Matthew Pinsent, Tim Foster, James Cracknell)", "* 1998 – Gold, Coxless Four (with James Cracknell, Tim Foster, Matthew Pinsent)", "* 1997 – Gold, Coxless Four (with James Cracknell, Tim Foster, Matthew Pinsent)"]}, {"page": "Matthew Pinsent", "response": ["Matthew Pinsent attended Aysgarth School in North Yorkshire before he began rowing at Eton College. He began his international career at the World Rowing Junior Championships in 1987. He raced again in 1988, winning the junior coxless pairs with Tim Foster.", "In 2000 he won Olympic gold again as part of a coxless four with Redgrave, James Cracknell and Tim Foster. He also carried the flag for Team GB at the opening ceremony. In August 2000, the month prior to winning gold in Sydney, he took part in a three-part BBC documentary entitled Gold Fever. This followed the coxless four team in the years leading up to the Olympics, including video diaries recording the highs and lows in the quest for what would be Pinsent's third consecutive gold.", "* 2000 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)", "* 1998 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)", "* 1997 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)", "* 1988 – Gold, Coxless Pair (with Tim Foster)"]}, {"page": "The Boat Race", "response": ["Many notable individuals have participated in the Boat Race, including those of an Olympic standard.  Four-time Olympic gold medallist Sir Matthew Pinsent, rowed for Oxford in 1990, 1991, and 1993. Olympic gold medallists from 2000 – James Cracknell (Cambridge 2019), Tim Foster (Oxford 1997), Luka Grubor (Oxford 1997), Andrew Lindsay (Oxford 1997, 1998, 1999) and Kieran West (Cambridge 1999, 2001, 2006, 2007), 2004 – Ed Coode (Oxford 1998), and 2008 – Jake Wetzel (Oxford 2006) and Malcolm Howard (Oxford 2013, 2014) have also rowed for their university."]}, {"page": "Rowing at the 2000 Summer Olympics", "response": ["|nowrap|James CracknellSteve RedgraveTim FosterMatthew Pinsent"]}, {"page": "Leander Club", "response": ["* Tim Foster"]}, {"page": "Bedford Modern School", "response": ["* Olympians: Charles Foulkes (field hockey bronze), John Yallop (rowing silver), Tim Foster (rowing gold), Thomas Hammond (track and field), Sir Sidney Abrahams (long jump), Hamilton Milton (swimming), Peter Knapp (rowing), John Yallop (rowing), Neil Keron (rowing), Rod Chisholm (rowing)", "* Boat Race oarsmen: Sir Archibald Dennis Flower, William Poole, Sir George Godber, David Leadley, Joseph Dominic Kinsella, JD Hughes, Tim Foster, David Gillard, Kenelm Richardson (Cambridge cox)"]}, {"page": "Ed Coode", "response": ["Coode won his first World Championship in 1999, as a substitute in the British men's coxless four, rowing with Steve Redgrave, Matthew Pinsent and James Cracknell. When Tim Foster returned to the four, Coode was put into the coxless pair with Greg Searle. They finished fourth at the 2000 Sydney Olympics having led for most of the race and being overtaken by three crews in the last 600 m, finishing 12/100th of a second (about 2 feet) out of third place."]}, {"page": "James Cracknell", "response": ["Cracknell began rowing whilst attending the independent Kingston Grammar School and rowed at the Junior World Championships in 1989 and 1990, winning a gold medal in 1990. He graduated from the University of Reading as a Bachelor of Science (BSc) in Human Geography in 1993, followed by a PGCE at the Institute of Education and a Master of Science (MSc) from Brunel University in 1999.‘CRACKNELL, James Edward’, Who's Who 2014, A & C Black, an imprint of Bloomsbury Publishing plc, 2014 Moving into the senior squad, Cracknell made numerous appearances in the World Rowing Championships; however, he did not win any medals prior to the 1996 Summer Olympics. He qualified in the double scull for the 1996 Games, but fell ill with tonsillitis and was unable to race. In 1997, he won a seat in the men's coxless fours, with Steve Redgrave, Matthew Pinsent and Tim Foster. With this crew, he won the World Rowing Championships in 1997, 1998 and 1999 (with Ed Coode replacing the injured Foster), and finally the gold medal at the 2000 Summer Olympics. In August 2000, the month prior to winning gold in Sydney, he took part in a 3-part BBC documentary entitled Gold Fever. This followed the coxless four team in the years leading up to the Olympics, including video diaries recording the highs and lows in their quest for gold.", "* 2000 – Gold, Coxless Four (with Matthew Pinsent, Tim Foster, Steve Redgrave)", "* 1998 – Gold, Coxless Four (with Matthew Pinsent, Tim Foster, Steve Redgrave)", "* 1997 – Gold, Coxless Four (with Matthew Pinsent, Tim Foster, Steve Redgrave)"]}, {"page": "Jürgen Gröbler", "response": ["*James Cracknell, Tim Foster, Steve Redgrave and  Matthew Pinsent in 2000 in the four"]}, {"page": "Saïd Business School", "response": ["* Tim Foster (EMBA) – British Olympic rower"]}, {"page": "Great Britain at the 2000 Summer Olympics", "response": ["| Tim FosterMatthew PinsentSteve Redgrave || Rowing", "|align=left|James CracknellTim FosterMatthew PinsentSteve Redgrave"]}, {"page": "Great Britain at the 1992 Summer Olympics", "response": ["*Martin Cross, Jim Walker, Ben Hunt-Davis, Jonny Singfield, Rupert Obholzer, Richard Phelps, Stephen Turner, Tim Foster, Adrian Ellison"]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["*Tim Foster, Rupert Obholzer, Greg Searle, and Jonny Searle – Rowing, Men's Coxless Four", "|align=left|Tim FosterRupert ObholzerGreg SearleJonny Searle"]}, {"page": "Rowing at the 1996 Summer Olympics", "response": ["| Gregory SearleJonathan William SearleRupert John ObholzerTim Foster"]}, {"page": "Foster (surname)", "response": ["*Tim Foster (soccer), American soccer player", "*Tim Foster, British rower"]}, {"page": "List of Olympic medalists in rowing (men)", "response": ["|Greg SearleJonny SearleRupert ObholzerTim Foster", "|James CracknellSteve RedgraveTim FosterMatthew Pinsent"]}, {"page": "Geoff Stewart", "response": ["In 1998 Australia's Oarsome Foursome were in their first year of a post-Olympic comeback and they raced in various coxed combinations at the 1998 World Rowing Championships in Cologne. This enabled the Stewart brothers with Bo Hanson and Ben Dodwell to boat as the coxless four. They contested two World Rowing Cups that year in Europe and at the World Championships came up against the gun British crew of James Cracknell, Tim Foster, Matthew Pinsent and Steve Redgrave. The Australian four fared admirably to finish in fourth place in the final, 0.19 seconds behind the French silver medallists."]}, {"page": "James Stewart (rower)", "response": ["In 1998, Australia's Oarsome Foursome were in their first year of a post-Olympic comeback and they raced in various coxed combinations at the 1998 World Rowing Championships in Cologne. This enabled the Stewart brothers with Bo Hanson and Ben Dodwell to boat as the coxless four. They contested two World Rowing Cups that year in Europe and at the World Championships came up against the gun British crew of James Cracknell, Tim Foster, Matthew Pinsent and Steve Redgrave. The Australian four fared admirably to finish in fourth place in the final, 0.19 seconds behind the French silver medallists."]}, {"page": "1970 in the United Kingdom", "response": ["* 19 January – Tim Foster, rower"]}, {"page": "Gold Fever (documentary)", "response": ["Gold Fever is a BBC documentary, shown in August 2000, which follows Steve Redgrave and his British rowing coxless four teammates Matthew Pinsent, Tim Foster and James Cracknell in the years leading up to the Sydney Olympics, where Redgrave was looking to win his fifth consecutive gold medal. The three-part series includes video diaries recording the highs and lows in the quest for gold. Among these were Redgrave being diagnosed with diabetes, and Foster possibly losing his spot on the team after injuring his hand punching a window at a party, and later undergoing back surgery that required additional months of recovery time. Coach Jurgen Grobler is also featured in the programme."]}]}}