{"wiki_id": "http://www.wikidata.org/entity/Q7804148", "itemLabel": "Tim Rawlings", "itemDescription": "Footballer (1932-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Rawlings", "wikipedia_page": {"main": "Charles John \"Tim\" Rawlings (4 November 1932 – 28 September 2014) was an English footballer. A half-back, he made 231 league appearances in a 15-year career in the Football League. He made the bulk of these appearances for Walsall in between 1956 and 1963, but also had six years without a game at West Bromwich Albion, and also spent two years at Port Vale. He helped Walsall to win two consecutive promotions from the Fourth Division to the Second Division in 1959–60 and 1960–61.", "link_mentions": [{"page": "September 28", "response": ["*  2014   – Tim Rawlings, English footballer and manager (b. 1932)"]}, {"page": "2014 in association football", "response": ["* 28 September: Tim Rawlings, English footballer (born 1932)"]}, {"page": "Freddie Steele (footballer)", "response": ["Steele returned to Vale Park when he replaced Norman Low as manager in October 1962. He sold Bert Llewellyn to Northampton Town for £7,000 and Arthur Longbottom to Millwall for £2,000; before boosting his strike-force with Tony Richards from Walsall for £9,000. They finished 1962–63 third in the Third Division, four points shy of promotion. He spent big for the 1963–64 campaign, bringing in Northern Ireland international Billy Bingham from Everton for £15,000; Albert Cheesebrough from Leicester City for another £15,000; as well as Walsall's Tim Rawlings for £4,000 and winger Ron Smith from Crewe Alexandra for £6,500. In mid-season he further splashed out £12,000 for both ex-Scotland striker Jackie Mudie and left-back Ron Wilson, both from Stoke City. His team finished a disappointing 13th, though in the FA Cup they beat top-flight Birmingham City and held Liverpool to a goalless draw."]}, {"page": "History of Port Vale F.C.", "response": ["Determined to win promotion in 1963–64, the club spent £15,000 a piece on Northern Ireland international Billy Bingham and Englishman Albert Cheesebrough. Tim Rawlings was also bought for £4,000 from nearby Walsall. Soon into the season winger Ron Smith was also purchased from Crewe for £6,500. Scotsmen Jackie Mudie and Ron Wilson were transferred from Stoke City for around £12,000. The club did well in the FA Cup, taking Liverpool to a fourth round replay, however the season was a disaster in the league. It was 'the season that misfired', having spent a massive amount of money (nearly £50,000 alone in transfer fees) they finished a whole ten places lower than the previous season. The club made a net loss of £42,650, even with the regular donation from the Supporters Association of close to £20,000.", "The club flopped completely in 1964–65. Goalkeeper Ken Hancock was sold to Ipswich Town at Christmas time, raising £10,000. Freddie Steele departed in February, as Jackie Mudie was appointed caretaker manager. Mudie created 'a punchier attack and a far more stable defence' as the club managed four home wins in a row. However the club were relegated in 22nd place, five points away from safety. No club in the Football League had scored less than Vale's tally of 41, with top scorer Cheesebrough managing just seven strikes. To slash the wage bill, Stan Steele, Ron Smith, Ron Andrew, Tim Rawlings and Stan Trafford all left on free transfers. The season saw a financial loss of around £15,000, the home attendance being an average of around 5,500."]}, {"page": "Charles John Rawlings", "response": ["#REDIRECT Tim Rawlings"]}, {"page": "Charles Rawlings", "response": ["#REDIRECT Tim Rawlings"]}, {"page": "1963–64 Port Vale F.C. season", "response": ["The pre-season saw manager Freddie Steele spend unprecedented sums of money – though Vale's spending was insignificant to the standard of many of their rivals. Steele brought in Northern Ireland international Billy Bingham from Everton for £15,000; Albert Cheesebrough from Leicester City for another £15,000; as well as Walsall's Tim Rawlings for £4,000. Chairman Tom Talbot approved of these signings despite the club's financial problems. The club also took a tour of Northern Ireland, though a friendly with Benfica (arranged to match rivals Stoke City's match with Real Madrid) was cancelled due to fixture congestion.", "|align=\"left\"|MF||align=\"left\"| Tim Rawlings", "|–||FW||||Tim Rawlings||1||0||0||1", "| June 1963 || MF ||  || Tim Rawlings || Walsall || £4,000 || "]}, {"page": "1964–65 Port Vale F.C. season", "response": ["On the financial side, a £15,497 was recorded despite a donation of £16,320 from the Sportsmen's Association, the Development Fund, and the social club. The average home attendance was a mere 5,508, almost half that of the previous season. Gate receipts had plummeted to just £24,117, compared to a wage bill of £41,092; meanwhile a £6,250 profit was made on transfers. A clear-out of players could not be avoided, as twelve were handed free transfers, including: Billy Bingham (retired); Stan Steele (left the country); Ron Smith (Southport); Ron Andrew (retired); Tim Rawlings (Nuneaton Borough); Stan Trafford (retired); and Albert Cheesebrough (joined Mansfield Town for free, although Vale had wanted £5,000 for him).", "|align=\"left\"|MF||align=\"left\"| Tim Rawlings", "|–||MF||||Tim Rawlings||1||0||0||1", "| April 1965 || MF ||  || Tim Rawlings || Nuneaton Borough || Free transfer || "]}, {"page": "2014 in the United Kingdom", "response": ["**Tim Rawlings, 81, footballer."]}, {"page": "2014–15 in English football", "response": ["* 28 September 2014: Tim Rawlings, 81, former Walsall and Port Vale half-back."]}, {"page": "Deaths in September 2014", "response": ["*Tim Rawlings, 81, English footballer (West Bromwich Albion, Walsall).Former player Tim Rawlings has passed away"]}]}}