{"wiki_id": "http://www.wikidata.org/entity/Q7804072", "itemLabel": "Tim O'Shea", "itemDescription": "Football player and manager (born 1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_O%27Shea_(footballer)", "wikipedia_page": {"main": "Timothy James O'Shea (born 12 November 1966 in Pimlico) is a former professional football player and manager.\nHe represented the Republic of Ireland at the 1985 FIFA World Youth Championship.His clubs included Tottenham Hotspur, Leyton Orient and Gillingham, where he made over 100 Football League appearances.While playing for Instant-Dict in the Hong Kong league, he played three matches for the Hong Kong League team in the Dynasty Cup. As the Hong Kong team consisted of top players in the local league, including foreigners such as O'Shea, it was not an official match of the Hong Kong FA.On 21 February 2008, Grays Athletic appointed O'Shea as a senior coach to assist Micky Woodward and Gary Phillips with fitness and tactics. On 15 September 2008, he was appointed as manager after chairman Micky Woodward stepped down, but held the post only until the arrival of Wayne Burnett as manager two weeks later.He moved from Grays to take the position at Croydon Athletic. Under O'Shea, the Rams were promoted to the Isthmian League Premier Division. O'Shea resigned from Croydon on 4 September 2010, after the team's owner Mazhar Majeed was alleged to have been involved in spot fixing in Pakistan cricket matches, resulting in HM Revenue and Customs officials investigating the club. On 25 October 2010, O'Shea was appointed first-team manager of Lewes. He left at the end of the 2010–11 season after Lewes were relegated.", "link_mentions": [{"page": "1994 Guangdong–Hong Kong Cup", "response": ["*  Tim O'Shea 奧沙"]}, {"page": "Ishmael Welsh", "response": ["In January 2011, Welsh signed up with his old manager, Tim O'Shea at Lewes in the Conference South.Welsh signs for the Rooks "]}, {"page": "Neil Smith (footballer)", "response": ["Smith joined Grays Athletic as part of their coaching staff on 21 February 2008.New Coach At Grays , graysathletic.co.uk He then joined Tim O'Shea, with whom he worked with at Grays, at Croydon Athletic as a coach and again followed O'Shea to Lewes as his assistant. Following Lewes's relegation he re-joined Bromley at the start of 2011–12 as part of the coaching staff. Following the departure of Mark Goldberg in February 2016, Smith took over the role on an interim basis. On 4 April, after a successful run of games, Smith signed a two-year contract to become the club's new first team manager."]}, {"page": "List of Hong Kong Top Footballers", "response": ["|Tim O'Shea", "|Tim O'Shea", "|Tim O'Shea", "|Tim O'Shea"]}]}}