{"wiki_id": "http://www.wikidata.org/entity/Q7804517", "itemLabel": "Tim Woolgar", "itemDescription": "British chess boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Woolgar", "wikipedia_page": {"main": "Tim Woolgar is a British chess boxer and event organiser who established Great Britain Chess Boxing Organisation and the London Chessboxing Club the first United Kingdom chessboxing institution. He is a former holder of the title, British Heavyweight Chess Boxing Champion. He also promotes chess boxing events.\nLondon Chessboxing promotes regular chessboxing events in the United Kingdom. Early events were held at Bethnal Green Working Men's Institute, subsequent events have been staged at the larger capacity Boston Dome in North London and SCALA, Central London.\nOn 10 September 2011 London Chessboxing staged its first event at the SCALA in King's Cross, central London.  Two subsequent events have been staged at this venue on 16 March 2012 (\"TwoTribes\") and 29 September 2012 (\"PrizeFightKnight\").  During the Summer Olympics of 2012 planned a planned two-day chessboxing tournament at the London Pleasure Gardens had to be cancelled due to crowd-control and infrastructure problems at the host site.  On 10 October 2012 London Chessboxing staged a sell-out event (\"Battle Royale\") in the Royal Albert Hall loading bay. This unusual subterranean arena was opened to the public for the occasion for the first and only time since the Royal Albert Hall was completed in 1871.\nWoolgar has fought 12 times in Chessboxing with a record of 4-7-1. \nThe Chessboxing Organisation is registered as a charity in England and Wales (reg no.1131672) and is dedicated to bringing free chessboxing coaching to young people in London. The Organisation provides subsidised chess and boxing coaching to youth residents of Islington, North London.\nWoolgar formerly worked in the media as one of the UK's first video-journalists being one of the original recruits to Associated Media's TV news service Channel One London. Woolgar also worked as a video-journalist at the BBC's Science and Features department, an executive producer at ITV and as head of interactive programming at Endemol UK.", "link_mentions": [{"page": "Chess boxing", "response": ["The World Chessboxing Association (WCBA) is a legally recognized umbrella organization for chessboxing. It was founded in 2013 and is based in London, England. English heavyweight chessboxing champion Tim Woolgar is its current president. The WCBA originated from the London Chessboxing Club after having separated from the WCBO. It was founded by Woolgar in 2013 to accelerate the development of chessboxing. WCBO champions are also managed and recognized by the WCBA.", "The first-ever chessboxing event hosted in the UK under the brand was at Bethnal Green Working Men's club in Hackney by Tim Woolgar on 15 August 2008. Other notable venues include Chelsea Old Town Hall, The Grange Hotel in St Pauls, and the Royal Albert Hall. Their events are hosted at Scala, King's Cross, York Hall, and The Dome, in Tuffnell Park. The events are also broadcast on the livestreaming service Twitch."]}, {"page": "Woolgar", "response": ["*Tim Woolgar, British chess boxer"]}, {"page": "List of Chess boxing champions", "response": ["|align=left |Tim Woolgar"]}, {"page": "World Chessboxing Association", "response": ["The World Chessboxing Association (WCBA) is the governing body of chess boxing.  The WCBA was founded in 2013 and has its headquarters in London, England. Its current president is Tim Woolgar who was the chess boxing UK champion at heavyweight.", "The World Chessboxing Association split from World Chess Boxing Organization(WCBO) and it was established in 2013 by Tim Woolgar to accelerate developing chess boxing industry. The champions of WBCO are also sanctioned as the champions by WCBA."]}, {"page": "Matthew Read", "response": ["*Matthew Read (chess boxer), opponent of Tim Woolgar"]}]}}