{"wiki_id": "http://www.wikidata.org/entity/Q7804092", "itemLabel": "Tim Palmer", "itemDescription": "British record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Palmer", "wikipedia_page": {"main": "Timothy J. Palmer (born 4 October 1962, in North Shields) is an English record producer, audio engineer, guitarist and songwriter of rock and alternative music. He mixed Pearl Jam's debut album Ten (1991) and tracks on U2's album All That You Can't Leave Behind (2000). Palmer has produced for over four decades and has worked with artists such as U2, Robert Plant, Ozzy Osbourne, Tears For Fears, The Mission, Mighty Lemon Drops, Gene Loves Jezebel, Pearl Jam, David Bowie’s Tin Machine, HIM, Blue October, Jason Mraz, The Polyphonic Spree, The House of Love, Texas, Tarja Turunen, The Cure, Cutting Crew, Porcupine Tree, Faith Hill, Goo Goo Dolls, LIVE, Kandace Springs, Sweet Water, Lang Lang, Switchfoot, Lizz Wright, Billy Childs, Goldfinger, J.D. Souther, Steve Grand, Pitty and Orlando Draven.", "link_mentions": [{"page": "Catherine Wheel (band)", "response": ["|style=\"background:#FBFBEF\"| Tim Palmer remix"]}, {"page": "Wild Mood Swings", "response": ["* Tim Palmer – mixing"]}, {"page": "44th Annual Grammy Awards", "response": ["** Brian Eno & Daniel Lanois, producers; Brian Eno, Steve Fitzmaurice, Julian Gallagher, Mike Hedges, Daniel Lanois, Steve Lillywhite, Tim Palmer, Richard Rainey & Richard Stannard, engineer/mixers"]}, {"page": "Dredg", "response": ["When the band began writing material for the new album, they secluded themselves in the deserts around Palm Desert. The majority of the album was recorded at Skywalker Ranch. The band used three producers, Ron Saint Germain, Tim Palmer and Jim Scott, on the record, adding another layer of diversity to the album. Completed in May 2002, the album was widely available on the internet before being released on October 8, 2002. Dredg made music videos for two of the album's tracks, \"Same Ol' Road\" and \"Of The Room\"."]}, {"page": "El Cielo (album)", "response": ["The album was recorded at George Lucas' Skywalker Ranch in Nicasio, CA, and at Long View Farm in North Brookfield, MA. Producers included Ron St. Germain, Tim Palmer, and Michael Rosen."]}, {"page": "Grammy Award for Album of the Year", "response": ["| Brian Eno & Daniel Lanois, producers; Brian Eno, Steve Fitzmaurice, Julian Gallagher, Mike Hedges, Daniel Lanois, Steve Lillywhite, Tim Palmer, Richard Rainey & Richard Stannard, engineers/mixers"]}, {"page": "Ten (Pearl Jam album)", "response": ["The recording sessions for Ten were completed in May 1991. Krusen left the band once the sessions were completed, checking himself into rehab. According to Krusen, he was suffering from personal problems at the time. Krusen said, \"It was a great experience. I felt from the beginning of that band that it was something special,\" and added, \"They had to let me go. I couldn't stop drinking, and it was causing problems. They gave me many chances, but I couldn't get it together.\"Acrylic, Kim. \"Interview with Dave Krusen of The Kings Royal\" . Punk Globe. January 2009. In June, the band joined Tim Palmer in England for mixing. Palmer decided to mix the album at Ridge Farm Studios in Dorking, a converted farm that according to Palmer was \"about as far away from an L.A. or New York studio as you can get.\" Palmer made a few additions to the already-recorded songs, including having McCready finish up the guitar solo on \"Alive\" and tweaking the intro to \"Black\". Palmer overdubbed a pepper shaker and a fire extinguisher as percussion on \"Oceans\".", "*Tim Palmer – fire extinguisher and pepper shaker on \"Oceans\", mixing"]}, {"page": "Tears for Fears", "response": ["In 1993, Orzabal (still under the name Tears for Fears) released the album Elemental together with longtime collaborator Alan Griffiths. Co-produced by Tim Palmer, it yielded the international hit \"Break It Down Again\" (top 20 in the UK, Canada, France, and Italy) and was supported with another successful world tour, including a college tour of the US where \"Break It Down Again\" reached no. 25. Although it charted considerably lower in the US than the previous two studio albums (no. 45), it still earned a Gold disc there for sales of over half a million copies."]}, {"page": "Porcupine Tree", "response": ["In February 2002, Porcupine Tree's first line-up change occurred when drummer Chris Maitland was dismissed after eight years with the band. The band welcomed drummer and longtime acquaintance Gavin Harrison as his replacement. In March 2002, a box set of the band's early work was released, Stars Die: The Delerium Years 1991–1997, and the band commenced recording their first major label album, drawing from a pool of 30 new songs written by Wilson in the previous two years. Recording sessions took place at Avatar Studios in New York and London, with veteran audio engineer Paul Northfield and string arranger Dave Gregory also playing major roles in the making of the record. The album was mixed in Los Angeles in May with Tim Palmer."]}, {"page": "All That You Can't Leave Behind", "response": ["*Mixing – Richard Rainey, Tim Palmer, Mike Hedges, Richard Stannard and Julian Gallagher, Brian Eno, Daniel Lanois, Steve Fitzmaurice", "*Additional engineering – Tim Palmer, Stephen Harris, Ger McDonnell, Mark Howard, Alex Haas"]}, {"page": "Indus Creed", "response": ["Indus Creed released Evolve, their first album in 17 years, on 21 April 2012, with Universal Music. Featuring eight songs, the album has been produced by Indus Creed, mixed by Grammy-nominated mixing engineer Tim Palmer (Pearl Jam, Robert Plant, Ozzy Osbourne, U2, Tears for Fears, Porcupine Tree) and mastered by veteran mastering engineer Andy VanDette (Rush, Beastie Boys and Porcupine Tree). Indus Creed were featured on the cover of a number of magazines, including Rolling Stone India's February 2012 issue."]}, {"page": "HIM (Finnish band)", "response": ["On 17 January 2005, HIM performed at the Yhteinen ASIA benefit concert for victims of the 2004 Indian Ocean earthquake and tsunami, along with The Rasmus, The 69 Eyes, Apocalyptica and Negative. In March, the band relocated to Los Angeles to begin work on its fifth studio album with producer Tim Palmer. That same month, Himmeetä valoa, a documentary about the group, premiered on Yle TV2. The following May, HIM released Love Metal Archives Vol. I, a collection of music videos, live performances and other bonus material. It debuted at number one in Finland and at number two in Germany. Within a few weeks, the collection had gone gold in Finland. On 26 September 2005, HIM released its fifth studio album Dark Light, which became the group's most successful album to date. It charted in sixteen countries, being certified platinum in Finland, as well as gold in Germany, the UK, and the US. Four singles were released, with \"Wings of a Butterfly\" and \"Killing Loneliness\" reaching number one and two, respectively, on the Finnish Singles Chart. The former also cracked the top ten in the UK. Dark Light received mixed reviews from critics. The New York Times described the material as \"sturdier than ever\", while Q Magazine called the album \"a collection of irresistible pop-rock anthems\". NME, meanwhile, described the record as \"wimpy\", while AllMusic branded it as \"glossy and user-friendly\". At the 2005 Emma Gala, Dark Light was named Rock Album of the Year, while \"Wings of a Butterfly\" received the award for Song of the Year.", "In February 2007, HIM began recording its sixth album at Finnvox Studios with producers Hiili Hiilesmaa and Tim Palmer. The making-of the album was plagued with problems in Ville Valo's personal life. His alcohol abuse had worsened, which resulted in him vomiting and defecating blood at one point. Things came to a head when Valo suffered a nervous breakdown during the recording process. While he did manage to recover momentarily, he began drinking again during the mixing process. Eventually Valo was admitted to the Promises Rehabilitation Clinic in Malibu by the band's manager Seppo Vesterinen. The album's release date was also pushed back from July to September 2007. In April, HIM released Uneasy Listening Vol. 2, which peaked at number twelve in Finland. From 25 July to 3 September 2007, HIM toured the US with Linkin Park on the Projekt Revolution Tour, which also included My Chemical Romance, Taking Back Sunday and Placebo. Prior to the tour, HIM held a contest for fans to win a trip to meet them at the trek's opening date in Seattle. The winners of the contest would also be featured on a forthcoming live DVD. In July, HIM played a number of concerts opening for Metallica, including a show at Wembley Stadium in London, England.", "In February 2013, HIM announced that its forthcoming album would be released through Razor & Tie in North America, Double Cross in the UK and Ireland, and Universal Music in Europe. On 26 April 2013, the band released its eight studio album Tears on Tape, which was once again produced by Hiili Hiilesmaa and mixed by Tim Palmer. The record charted in nine countries, peaking at number two in Finland and Germany. In the US, the album reached number fifteen on the Billboard 200. Three singles were released, with \"Into the Night\" winning the Video of the Year award at the inaugural Noisecreep Creepies Awards. Tears on Tape received mostly positive reviews, with Classic Rock calling it \"a glorious return to form for one of the world's most peculiarly successful bands\". This was echoed by Alternative Press, who stated that \"within HIM's impressive canon, it's among their best.\" Kerrang! gave a less-favorable review, stating: \"Tears On Tape isn't bad [...] it's just not as seductive as HIM can be.\""]}, {"page": "Rotting Piñata", "response": ["* Tim Palmer - mixing"]}, {"page": "Wax Ecstatic", "response": ["* Tim Palmer – mixing, additional production on \"Silence Is Their Drug\""]}, {"page": "Ten Years and Running", "response": ["Ten Years and Running is a compilation album by American punk rock band MxPx. Released on Tooth and Nail Records, the album consists of nineteen songs spanning MxPx's career, mostly from Tooth and Nail releases but including a song each from the A&M releases Slowly Going the Way of the Buffalo, The Ever Passing Moment, The Broken Bones, and Fat Wreck Chords' The Renaissance EP.  The band self-produced a re-recording of \"Punk Rawk Show\" and two new songs, \"My Mistake\" and \"Running Away,\" for the compilation.  A music video was made for \"My Mistake.\" Tim Palmer either mixed or remixed all of the songs except \"My Life Story\" and \"The Broken Bones.\"", "* Mixed by Tim Palmer"]}, {"page": "The Sounds", "response": ["The Sounds released their third studio album Crossing the Rubicon, on 2 June 2009, via Original Signal Recordings (US and Canada) and Arnioki Records, their independent label. They collaborated with Mark Saunders as well as James Iha and Adam Schlesinger on the album. The album was mixed by Tim Palmer (Bowie, Pearl Jam, HIM, Cure) at his '62 Studios. (They performed the song \"No One Sleeps When I'm Awake\" on Last Call with Carson Daly on February 12, 2009, which was the first single from the album.  The song was also included in CW's new show The Vampire Diaries in the \"Haunted\" episode.  The title of the third album was inspired by the Julius Caesar quote and refers to the band's separation from their previous record label and became independent. Their second single, \"Beatbox\", was featured on American Idol. \"Dorchester Hotel\" was released as a third single in Germany only."]}, {"page": "Love Metal", "response": ["After nearly breaking up following an exhausting supporting tour for their previous album Deep Shadows and Brilliant Highlights, HIM took a two-month break in early 2002. While other members of the band flew on vacation, vocalist Ville Valo stayed behind in Helsinki and began writing new material.Juho K. Juntunen (2002). HIM – Synnin viemää p.249. WSOY When HIM regrouped at the turn of February and March 2002, the band felt re-energized, as well as excited about the new songs Valo had written. The group soon began recording demos in the spring of 2002, with producer Hiili Hiilesmaa, who had previously produced the band's 1997 debut album.Juho K. Juntunen (2002). HIM – Synnin viemää p.257. WSOY HIM continued to work on new material for approximately six months, before entering Finnvox Studios in September 2002 to record their fourth studio album with Hiilesmaa acting as producer. The recording process lasted two months, after which the band flew to Los Angeles for two weeks to mix the album at Studio Scream with Tim Palmer, who had previously worked with Pearl Jam and U2 among others. Additional mixing for the tracks \"Buried Alive by Love\" and \"Sweet Pandemonium\" was done at Sphere Studios in London, while the album was mastered at Sterling Sound in New York by George Marino.Love Metal album sleeve notes.", "*Tim Palmer − mixing"]}, {"page": "And Love Said No: The Greatest Hits 1997–2004", "response": ["And Love Said No: The Greatest Hits 1997–2004 is a greatest hits compilation by Finnish band HIM. It contains two new Tim Palmer produced songs: \"And Love Said No\" and \"Solitary Man\", the latter of which is a Neil Diamond cover. The British version also has a re-recorded version of \"It's All Tears (Drown In This Love)\". The digipak version of this album comes with a DVD with six songs live at Semifinal Club in Helsinki.", "Category:Albums produced by Tim Palmer"]}, {"page": "Chinese Democracy", "response": ["According to Bumblefoot, the band and producer Caram Costanzo (who joined in 2003) spent 14 hours a day working on the album. Producers who worked on the album include Bob Ezrin, Eric Caudieux, Sean Beavan, and Tim Palmer. Rose and Caram Costanzo are the producers credited on the finished album, with Baker, Caudieux, Beaven and keyboardist Chris Pitman credited with additional production. The band used 15 studios during production, including Capitol Studios, Cherokee Studios, Electric Lady Studios, Sunset Sound Recorders, and The Village."]}, {"page": "Everybody Loves a Happy Ending", "response": ["*Mixing: Tim Palmer"]}, {"page": "Tarja Turunen", "response": ["Tarja announced she is to release a new album in the summer of 2016. She explains that \"she has been working hard once again with Tim Palmer to create the heaviest sound so far of her career for her fourth rock album\". She also explained that the album will follow in the same footsteps as her other albums but with a new soul and growth. A teaser with a snippet of two songs was then released on her official YouTube channel. On 17 February 2016, Tarja also revealed the first letter of the album name to be T. On March 14, 2016, Tarja made public title and cover of her new album, The Shadow Self."]}, {"page": "Pitty", "response": ["In 2014 Pitty announced that her main band is back, with shows already confirmed by the band's production. So it was announced by the British producer Tim Palmer in social networks, revealing the end of the mix of singles of the new album, which was released on June 2014 in (CD and vinyl). The set includes 10 songs, all unpublished and authored by singer Pitty. \"SETEVIDAS\" features the production of Rafael Ramos and the mix of Tim Palmer who has produced singles by Pearl Jam, Ozzy Osbourne, The Cure, David Bowie and U2."]}, {"page": "Cutting Crew", "response": ["Their first album, Broadcast, was released on Virgin Records in 1986. The song \"(I Just) Died in Your Arms\" was mixed in London at Utopia Studios by Tim Palmer. Although Virgin Records was already a major label in the UK, their debut song, \"(I Just) Died in Your Arms\", provided the first US hit for Virgin as a full-fledged label. This song release quickly helped the band gain popularity. Virgin flew the band to New York City for initial recordings of the album, then to Australia to shoot music videos. The unknown band shot to No. 1 in the major US market, as well as smaller markets such as Canada and Norway, with their debut single. Their most popular single, it was a multiformat success in the US, where it also reached number four on the Hot Mainstream Rock Tracks chart, No. 24 on the Hot Adult Contemporary Tracks chart and—in an extended remix version—No. 37 on the Hot Dance/Club Play chart.  The song peaked at No. 4 in another major market, the UK Singles Chart, as well as becoming a hit in the smaller Switzerland and South Africa markets. It went to No. 2 in Sweden and Ireland, and No. 9 in Austria."]}, {"page": "Elemental (Tears for Fears album)", "response": ["Elemental was the first new Tears for Fears album in four years, following 1989's The Seeds of Love. However, despite being released under the Tears for Fears moniker, it is essentially a solo effort by Roland Orzabal, as Curt Smith had left the band in 1991. For much of the writing and recording, Orzabal was assisted by Alan Griffiths, who had been a session musician for Tears for Fears' world tour in 1985. The album was recorded at Orzabal's newly built home studio, Neptune's Kitchen, and was co-produced by Orzabal, Griffiths and Tim Palmer.", "*Tim Palmer – producer, instruments", "Category:Albums produced by Tim Palmer"]}, {"page": "Rearviewmirror (Greatest Hits 1991–2003)", "response": ["*Tim Palmer – mixing"]}, {"page": "For Never & Ever", "response": ["For Never & Ever is Kill Hannah's major label debut album, released October 14, 2003. It features the single, \"Kennedy\". The album was mixed by Tim Palmer"]}, {"page": "Sophisticated Boom Boom", "response": ["* Tim Palmer – engineer, mixer"]}, {"page": "Stomping Ground", "response": ["Stomping Ground is Goldfinger's third official album that was released on March 28, 2000. The song \"The End of the Day\" contains a brief sample from the Dead Kennedys song \"Nazi Punks Fuck Off.\" The album was produced by Tim Palmer and John Feldmann and mixed by Tim Palmer.", "Category:Albums produced by Tim Palmer"]}, {"page": "Thank You (Duran Duran album)", "response": ["*Tim Palmer – mixing"]}, {"page": "Down to Earth (Ozzy Osbourne album)", "response": ["Excluding his contributions to re-recordings of Ozzy's earlier material, Down to Earth is the only Osbourne studio album to feature bassist Robert Trujillo, who left to join Metallica in 2003. It was the first Osbourne album to feature drummer Mike Bordin, previously of Faith No More, though he had played live with Osbourne since 1996. Though he plays on the album, guitarist Zakk Wylde did not contribute as a songwriter for the first time since joining Osbourne's band in 1988, because many of the songs were written before Wylde rejoined the band. Osbourne's previous guitarist Joe Holmes was involved in the writing and Osbourne chose to use outside songwriters such as producer Tim Palmer and Aerosmith collaborator Marti Frederiksen.", "*Tim Palmer – rhythm guitar, acoustic guitar, keyboards, military drums, backing vocals, production, mixing", "Category:Albums produced by Tim Palmer"]}, {"page": "Before the Robots", "response": ["* Tim Palmer - Mixing"]}, {"page": "Jean-Pierre Melville", "response": ["*Tim Palmer \"An Amateur of Quality: Postwar Cinema and Jean-Pierre Melville's LE SILENCE DE LA MER,\" Journal of Film and Video, 59:4, Fall 2006, pp. 3–19", "*Tim Palmer \"Jean-Pierre Melville's LE SAMOURAI\", in Phil Powrie (ed.) The Cinema of France, 2006, Wallflower", "*Tim Palmer \"Jean-Pierre Melville and 1970s French Film Style,\" Studies in French Cinema, 2:3, Spring 2003"]}, {"page": "Michael Hutchence (album)", "response": ["*Tim Palmer – mixing on \"Flesh and Blood\" and \"Slide Away\""]}, {"page": "In Absentia", "response": ["After the recording process was complete, Steven Wilson then took the album to Larrabee Studios in Los Angeles to work with Tim Palmer and his engineer Mark O'donoughue mixing the record on the J-Series SSL console.", "*Mixed by Tim Palmer and Mark O'Donoughue"]}, {"page": "Apple (Mother Love Bone album)", "response": ["*Tim Palmer – mixing"]}, {"page": "Alive (Pearl Jam song)", "response": ["The band, then called Mookie Blaylock, recorded \"Alive\" during a demo session at London Bridge studio in January 1991. The version recorded during this session would later appear on the group's debut album, Ten, and on the promotional \"Alive\" EP. During album mixing sessions in England in June 1991, mixer Tim Palmer had McCready add to the song's outro solo. McCready recorded a number of attempts at the solo, and Palmer edited them into a composite version. The guitarist was unsatisfied with the result, so he made another attempt at the solo. \"He had another go at it\", Palmer recalled, \"and got it right away. There was no piecing together to do; it was one take.\""]}, {"page": "Closer (Better Than Ezra album)", "response": ["* Tim Palmer - Mixing"]}, {"page": "Blue October", "response": ["On June 1, 2010 the band announced they were beginning pre-production on their next studio album to be produced by Tim Palmer. In late 2010 and early 2011, they headed back to the studio to finish recording the album and debuted it August 16, 2011. The title of the new album is Any Man in America.", "On February 13, 2015, the band announced that they were starting work on their eighth studio album via their official Twitter feed. The band entered the recording studio in August 2015 and finished recording the album in early November. The band recorded eleven songs for the new album, making this their shortest album to date. An acoustic version of one of the songs, entitled \"Home\", was played live in Las Vegas on September 19. The album, also titled Home, was released April 22, 2016. The title track and first single \"Home\" made its radio premiere December 16, 2015. The official video for \"Home\" was premiered on Billboard on April 13, 2016. Tim Palmer, who worked on the albums Any Man in America and Sway, co-produced and mixed the album. The song \"Home\" reached the top 30 of the US Adult Pop Songs chart."]}, {"page": "Tin Machine (album)", "response": ["Tin Machine is the debut studio album by Anglo-American hard rock band Tin Machine, released on 22 May 1989 by EMI America Records. The band consisted of English singer-songwriter David Bowie, American guitarist Reeves Gabrels and brothers Tony Fox and Hunt Sales on bass and drums, respectively, while Englishman Kevin Armstrong acted as an additional guitarist. The project was spearheaded by Bowie, who felt disconnected in his career by 1987 and looked to reinvent himself. After meeting Gabrels through his Glass Spider Tour, the two agreed to work together and would collaborate frequently for the next decade. Bowie hired the Sales brothers, neither of whom he had worked with since the 1970s, after a meeting in Los Angeles, while English producer Tim Palmer was hired to co-produce.", "During a launch party for a Glass Spider Tour video in Los Angeles, Bowie ran into bassist Tony Fox Sales, whom he hadn't worked with since the recording of Iggy Pop's Lust for Life in 1977. The two reconnected, leading Tony to invite his brother, drummer Hunt Sales, to a jam session with himself and Bowie. According to Gabrels, the Sales brothers were chosen as the rhythm section so they didn't have \"checkbook musicians\", specifically wanting former members of a band. Bowie insisted the four form a band, with each member providing equal input. Meanwhile, the positive reaction of the \"Look Back in Anger\" remix led Bowie to hire producer Tim Palmer—at the recommendation of the Cult's Billy Duffy—for his next project. Palmer recalled that he was a big fan of Bowie's, particularly \"the classic albums, but not so much of the later material\". He also enjoyed Bowie's working methods, including the encouragement of ideas from all parties involved. Nevertheless, Palmer told Buckley that when he signed on for the project, he assumed it would be \"a David Bowie record, not a Tin Machine record\". Spitz similarly states that Gabrels and the Sales brothers assumed they would be assisting Bowie in creating a follow-up for Never Let Me Down rather than forming a band.", "Upon hearing of Tin Machine and the album, Bowie's label EMI America Records were perplexed. Tim Palmer told Buckley that the label were eager for another Let's Dance best-seller and confused regarding Bowie's new direction. The label were unsure of how to market the album, so they attached stickers to the cover informing potential buyers that it was Bowie's new project. Nevertheless, EMI America released Tin Machine on 22 May 1989, issuing different LP and CD formats, with the catalogue numbers MTLS 1044 and CDP 7919902, respectively. At the time of release, the album sold well initially, peaking at number three on the UK Albums Chart, three places higher than Never Let Me Down, and number 28 on the US Billboard Top Pop Albums chart. It also reached the top-ten in Norway and Sweden, although sales decreased quickly. According to Dave Thompson, it spent a total of nine weeks on the UK chart. Short-term sales of Tin Machine were estimated to have been between 200,000 and 1,000,000 copies within a few years.", "* Tim Palmer – producer, mixing", "Category:Albums produced by Tim Palmer"]}, {"page": "Tin Machine II", "response": ["Tin Machine II is the second and final studio album by Anglo-American rock group Tin Machine, released on 2 September 1991 by Victory Music in association with London Records. The band, composed of English singer-songwriter David Bowie, Reeves Gabrels on guitar and brothers Tony Fox and Hunt Sales on bass and drums, respectively, recorded it in Sydney, Australia in late 1989 at the conclusion of the Tin Machine Tour. After Bowie completed his solo Sound+Vision Tour in late 1990, recording resumed in Los Angeles, California until March 1991. The production was handled by Tin Machine and Tim Palmer, who produced their eponymous debut studio album (1989), with additional production by Hugh Padgham on \"One Shot\". While the album musically retains a hard rock sound, the songs are more melodic compared to its predecessor, with lyrics focusing on love.", "Tin Machine was formed in 1988 by David Bowie, who was at an artistic low point and looking to revitalise his career. The completed lineup included American guitarist Reeves Gabrels and brothers Tony Fox and Hunt Sales on bass and drums, respectively; Kevin Armstrong acted as an additional guitarist. The band recorded their eponymous debut album in late 1988 with producer Tim Palmer. Despite a clash in personalities between the Sales brothers and Gabrels, the sessions were extremely productive, with over 35 songs recorded in six weeks. The album's tracks were recorded raw and live with few overdubs to capture the energy of Tin Machine, resulting in a hard rock sound with lyrics discussing world issues and love.", "In March 1991, Tin Machine signed with Victory Music, a newly formed record label created by the JVC corporation, with worldwide distribution by London Records and PolyGram. The same month, the band reconvened at A&M Studios in Los Angeles to record three new tracks. The label requested a radio-friendly hit so Hugh Padgham, Bowie's co-producer for Tonight (1984), was hired to oversee work on the song \"One Shot\". Padgham told biographer David Buckley that he was not a fan of Tin Machine's prior work, stating it \"sounded like a mad bunch of people\". Upon working with them, he praised Gabrels' guitar contributions but called the Sales brothers \"basically mad\". Tim Palmer, who produced their debut album, was brought back to produce and mix Tin Machine II.", "*Tim Palmer – producer, mixing, additional piano and percussion", "Category:Albums produced by Tim Palmer"]}, {"page": "Bruno Dumont", "response": ["His often polarizing work has been connected to a recent French cinéma du corps/body of cinema, encompassing contemporary films by Claire Denis, Marina de Van, Gaspar Noé, Diane Bertrand, and François Ozon, among others. According to Tim Palmer, this trajectory includes a focus on states of corporeality in and of themselves, independent of narrative exposition or character psychology.Palmer, Tim (2011). Brutal Intimacy: Analyzing Contemporary French Cinema, Wesleyan University Press, Middleton CT. . In a more pejorative vein, James Quandt has also talked of some of this group of filmmakers, as the so-called New French Extremity.Quandt, James, \"Flesh & Blood: Sex and violence in recent French cinema\", ArtForum, February 2004  Access date: 10 July 2008."]}, {"page": "Black (Pearl Jam song)", "response": ["The song originated as an instrumental demo under the name \"E Ballad\" that was written by guitarist Stone Gossard in 1990. It was one of five songs compiled onto a tape called Stone Gossard Demos '91 that was circulated in the hopes of finding a singer and drummer for Pearl Jam.Pearlman, Nina. \"Black Days\". Guitar World. December 2002. The tape made its way into the hands of vocalist Eddie Vedder, who was working as a San Diego gas station attendant at the time. Vedder recorded vocals for three of the songs on the demo tape (\"Alive\", \"Once\", and \"Footsteps\"), and mailed the tape back to Seattle. Upon hearing the tape, the band invited Vedder to come to Seattle. On his way to Seattle, Vedder wrote lyrics for \"E Ballad\", which he called \"Black\". The song was recorded during the Ten album recording sessions at London Bridge Studios with Rick Parashar at the helm as Producer. The song was finally mixed and completed at Ridge Farm Studios in Surrey, England with Tim Palmer"]}, {"page": "Why Do They Rock So Hard?", "response": ["Aaron Barrett has said in two interviews that this was his favorite album until the release of Our Live Album Is Better than Your Live Album. The album was mixed at Scream Studios by Tim Palmer.", "*Tim Palmer - Mixing"]}, {"page": "Now and Zen", "response": ["Now and Zen is the fourth solo album by Robert Plant, released 29 February 1988 by Es Paranza Records. The album made the top 10 in the US (No. 6) and UK (No. 10). The album was certified triple platinum by the RIAA on 7 September 2001. The album was produced by Tim Palmer, Robert Plant and Phil Johnstone.", "* Tim Palmer – producer", "Category:Albums produced by Tim Palmer"]}, {"page": "Mother Love Bone (album)", "response": ["* Tim Palmer – mixing"]}, {"page": "Identity (Zee album)", "response": ["*Engineered and co-produced by Tim Palmer", "Category:Albums produced by Tim Palmer"]}, {"page": "Welcome the Night", "response": ["*Tim Palmer - Mixing"]}]}}