{"wiki_id": "http://www.wikidata.org/entity/Q7803537", "itemLabel": "Tim Gane", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Gane", "wikipedia_page": {"main": "Timothy John Gane (born 12 July 1964) is an English songwriter and guitarist who co-founded Stereolab with his then-partner Lætitia Sadier.", "link_mentions": [{"page": "Stereolab", "response": ["Stereolab are an Anglo-French avant-pop band formed in London in 1990. Led by the songwriting team of Tim Gane and Lætitia Sadier, the group's music combines influences from krautrock, lounge and 1960s pop music, often incorporating a repetitive motorik beat with heavy use of vintage electronic keyboards and female vocals sung in English and French. Their lyrics have political and philosophical themes influenced by the Surrealist and Situationist movements. On stage, they play in a more feedback-driven and guitar-oriented style. The band also draw from funk, jazz and Brazilian music, and were one of the first artists to be dubbed \"post-rock\". They are regarded among the most innovative and influential groups of the 1990s.", "In 1985, Tim Gane formed McCarthy, a band from Essex, England, known for their left-wing politics. Gane met Lætitia Sadier, born in France, at a 1988 McCarthy concert in Paris and the two quickly fell in love. The musically-inclined Sadier was disillusioned with the rock scene in France and soon moved to London to be with Gane and pursue her career. In 1990, after three albums, McCarthy broke up and Gane immediately formed Stereolab with Sadier (who had also contributed vocals to McCarthy's final album), ex-Chills bassist Martin Kean and Gina Morris on backing vocals. Stereolab's name was taken from a division of Vanguard Records demonstrating hi-fi effects.", "The group released six limited-edition singles in 2005 and 2006, which were anthologised in the 2006 compilation Fab Four Suture, and contained material which Mark Jenkins thought continued the brisker sound of the band's post-Hansen work. By June 2007, Stereolab's line-up comprised Tim Gane, Lætitia Sadier, Andy Ramsay, Simon Johns, Dominic Jeffrey, Joseph Watson, and Joseph Walters. In 2008, the band issued their next album under the label 4AD titled, Chemical Chords, which \"[downplays] their arsenal of analog synths in favor of live instrumentation\". The release was followed by an autumn tour in Europe, the United States and Canada. ", "Their records have been heavily influenced by the \"motorik\" technique of 1970s krautrock groups such as Neu! and Faust. Tim Gane has supported the comparison: \"Neu! did minimalism and drones, but in a very pop way.\" Dave Heaton of PopMatters said that their music also had \"echoes of bubblegum, of exotica, of Beach Boys and bossa nova\", with their earlier work \"bearing strong Velvet Underground overtones\". Funk, jazz, and Brazilian music were additional inspirations for the band. Stephan Davet of French newspaper Le Monde said that Emperor Tomato Ketchup (1996) had musical influences such as Burt Bacharach, and Françoise Hardy. The sounds influenced by minimalist composers Philip Glass and Steve Reich can be found on the 1999 album Cobra and Phases Group Play Voltage in the Milky Night. Stereolab's style also incorporates easy-listening music of the 1950s and '60s. Joshua Klein in Washington Post said that, \"Years before everyone else caught on, Stereolab [were] referencing the 1970s German bands Can and Neu!, the Mexican lounge music master Esquivel and the decidedly unhip Burt Bacharach.\" Regarding their later work such as Instant 0 in the Universe (2003) and Margerine Eclipse (2004), critics have compared the releases to the band's earlier guitar-driven style.", "Stereolab alumni have also founded bands of their own. Guitarist Tim Gane founded the side project Cavern of Anti-Matter and also formed Turn on alongside band member Sean O'Hagan, who formed his own band the High Llamas. Katharine Gifford formed Snowpony with former My Bloody Valentine bassist Debbie Googe. Sadier has released three albums with her four-piece side-project Monade, whose sound Mark Jenkins called a \"little more Parisian\" than Stereolab's. Backing vocalist Mary Hansen formed a band named Schema with members of Hovercraft and released their eponymous EP in 2000.", "As of August 1999, US album sales stood at 300,000 copies sold. Despite receiving critical acclaim and a sizeable fanbase, commercial success eluded the group. Early in their career, their 1993 EP Jenny Ondioline entered the UK Singles Chart, but financial issues prevented the band from printing enough records to satisfy demand. According to Sadier, however, the band \"[avoided] going overground\" like PJ Harvey, Pulp and the Cranberries, all of whom quickly rose from obscurity to fame, adding: \"This kind of notoriety is not a particularly good thing, [and] you don't enjoy it anymore.\" When Elektra Records was closed down by Warner Bros. Records in 2004, Stereolab was dropped along with many other artists, reportedly because of poor sales. Tim Gane said in retrospect that the group \"signed to Elektra because we thought we would be on there for an album or two and then we'd get ejected. We were surprised when we got to our first album!\" Since then, Stereolab's self-owned label Duophonic has inked a worldwide distribution deal with independent label Too Pure. Through Duophonic, the band both licenses their music and releases it directly (depending on geographic market). Gane said, \"... we license our recordings and just give them to people, then we don't have to ask for permission if we want to use it. We just want to be in control of our own music.\"", "*Tim Gane - guitar, keyboards "]}, {"page": "Mary Hansen", "response": ["By 1988, Hansen had moved to London and worked in various jobs. She soon became a backing singer with the Essex-based indie band the Wolfhounds. She met guitarist Tim Gane when the Wolfhounds performed alongside his indie pop band, McCarthy. Gane formed Stereolab, in 1990 with Lætitia Sadier (ex-McCarthy). Hansen joined Stereolab as second vocalist and guitarist in 1992. She also contributed percussion, keyboards, and occasional lead vocals. As a member of that band, Hansen recorded six studio albums from Transient Random-Noise Bursts with Announcements (August 1993) to Sound-Dust (August 2001)."]}, {"page": "Shoegaze", "response": ["Bands lumped into the 'scene' by the press included several of the bands that were branded with the shoegazing label, such as Chapterhouse, Lush, Moose and other (mainly indie) bands such as Blur (prior to the release of their single \"Popscene\"), Thousand Yard Stare, See See Rider and Stereolab. A prime example were Moose, who often swapped members with other bands on a given night. Moose's Russell Yates and Stereolab guitarist Tim Gane would often trade places, while \"Moose\" McKillop often played with See See Rider. Gane and his Stereolab colleague Lætitia Sadier even played on the 1991 session by Moose for John Peel's BBC Radio 1 show.\"Peel Sessions: 16 April 1991 - Moose \", Keeping It Peel, BBC"]}, {"page": "The Adam and Joe Show", "response": ["Dressed as policemen, Adam and Joe would raid rock stars' homes, then examine their record collections for embarrassing or surprising items. The star would then be forced to dance to the shameful discoveries. Victims included Frank Black, Gary Numan, Alexis Arquette, Tim Gane and Lætitia Sadier, Symposium, Dave Navarro, Cerys Matthews, Nick Heyward, Thomas Dolby, Ray Manzarek of The Doors and Mark E. Smith of The Fall. In 2009, Adam revealed on their BBC 6 Music show that some of the stars' 'homes' were not actually their own."]}, {"page": "Sean O'Hagan", "response": ["In 1996, he collaborated with Tim Gane as Turn On, releasing an album of the same name on Drag City Records. They also worked together on the soundtrack to the film La Vie d'Artiste.", "* La Vie d'artiste (2007) (with Tim Gane)", "*  Copacabana (2010) (with Tim Gane)"]}, {"page": "One Chord to Another", "response": ["#\"On the Road Again/Transona Five\" (Tim Gane/Floyd Jones/Lætitia Sadier/Alan Wilson) – 4:42", "#\"On the Road Again/Transona Five\" (Tim Gane/Floyd Jones/Lætitia Sadier/Alan Wilson) – 4:42 (originally performed by Canned Heat and Stereolab, respectively)"]}, {"page": "Dots and Loops", "response": ["Dots and Loops opens with \"Brakhage\", which in its first seconds \"sputter[s] to life like it's being tuned in from outer space on a vintage receiver\", and is afterwards anchored by a two-chord keyboard line and \"skittering drum and vibraphone loops\". \"Miss Modular\" is built on a two-chord pattern augmented by brass arranged by Sean O'Hagan, and finds Tim Gane using the guitar \"as a percussive element\" to complement Andy Ramsay's drumming. The following track, \"The Flower Called Nowhere\", is a \"waltz\" that \"weds a John Barry harpsichord riff with a cosmic MOR melody.\" Gane said that the song took inspiration from composer Krzysztof Komeda and incorporates a choral chant from Komeda's score for the 1967 film The Fearless Vampire Killers. \"Diagonals\" pairs a marimba loop with a \"mutant-funk jazz drum loop\" sampled from Amon Düül II's \"I Can't Wait\". \"Prisoner of Mars\", the album's fifth track, has been described as \"an Astrud Gilberto-style dreamy drift of a ditty which sporadically yanks up its swooshing skirt of sumptuous melody to reveal ultra-spartan techno-rhumba undercarriage.\"", "* Tim Gane, Lætitia Sadier, Mary Hansen, Richard Harrison, Morgane Lhote, and Andy Ramsay – vocals, Farfisa organ, analogue synthesizers \"and other electronic devices (for sound generating and filtering)\", Rhodes piano, piano, clavinet, electric guitar, nylon string acoustic guitar, bass, drums, percussion, drum machines (\"beatbox\" and \"electronic percussion\")"]}, {"page": "Fender Jaguar", "response": ["*Tim Gane"]}, {"page": "Switched On", "response": ["*Tim Gane - guitar, Moog synthesizer, Farfisa organ"]}, {"page": "Peng!", "response": ["* Tim Gane – guitar, Farfisa organ, Moog synthesizer"]}, {"page": "Duophonic Records", "response": ["Duophonic is managed by Martin Pike, and is owned by Tim Gane (34%), Laetitia Sadier (34%), and Pike (32%). Although founded in 1991, the label did not become a limited company until 25 August 1993, when Pike relocated from Horsham, West Sussex, to East Dulwich in the London Borough of Southwark. From there, Pike also runs Associated London Management [2008] Ltd, a company dedicated to the management of bands such as Stereolab, Broadcast, Deerhunter, Atlas Sound, and the High Llamas.", "DS45-18 Turn On - Turn On (CD, MiniAlbum) Features Tim Gane, Sean O'Hagan and Andrew Ramsay"]}, {"page": "Lætitia Sadier", "response": ["Sadier was working as a nanny when she met McCarthy guitarist Tim Gane at one of the band's Paris gigs during the late 1980s. She was disillusioned with the rock scene in France, and soon moved to London to be with Gane and to pursue her career. She contributed vocals to McCarthy's final albums, and when McCarthy broke up in 1990, she and Gane immediately formed Stereolab.", "Sadier has contributed vocals to various groups and projects, at times along with the late Stereolab member Mary Hansen. She and Hansen had contributed vocals to various recordings of The High Llamas and to the Tim Gane/Sean O'Hagan side project Turn On, and has contributed backing vocals to the track \"Go Round\" on The Hair and Skin Trading Company's 1993 album Over Valence. Sadier added French backing vocals on the 1994 song \"To the End,\" from Blur's Parklife album. In 1995, she recorded the Serge Gainsbourg/Brigitte Bardot song \"Bonnie and Clyde\" with Luna. Throughout the years, Sadier has occasionally collaborated with German electronica group Mouse on Mars. In 1997, Sadier sang on \"Schnick Schnack Meltmade\" on Mouse on Mars' Autoditacker LP, and she and Mary Hansen contributed vocals to the Cache Cœur Naif EP. In turn, Mouse on Mars produced tracks on Stereolab's Dots and Loops LP.", "Sadier and Tim Gane were a couple when they formed Stereolab in the late 1980s. They ended the relationship in 2002. Together, they have a son named Alex who was born in 1998."]}, {"page": "Swell Maps", "response": ["Swell Maps have been cited as an influence by bands including Dinosaur Jr., R.E.M., Nirvana and Pavement. Thurston Moore from Sonic Youth acknowledged the influence of the Swell Maps in 1981, writing \"As soon as that Nikki Sudden guitar comes slicing slabbing and all out fuzzifying off that crackling vinyl groove you know you're gonna rock. It's the best of both whirls: fist-in-the-heart guitar burnin’ rock and ahead-of-its-time songsmith awareness ... The Swell Maps had a lot to do with my upbringing\". Scott Kannberg of Pavement said \"Swell Maps was a big influence on our early records ... they had these songs they fucked up somehow to make sound really dirty and low frequency, but they had these great songs underneath all this mess\". Tim Gane of Stereolab said that when he first bought A Trip to Marineville, \"I must have played it a hundred times or more, just to listen to every single second of it\". Other notable bands to name them an influence include Cornershop, The Pastels,Freeman, John. \"Stephen McRobbie Of The Pastels' Favourite Albums\". The Quietus, 3 June 2013. Retrieved 11 October 2020 and Deerhunter."]}, {"page": "Bowlie Weekender", "response": ["*Tim Gane"]}, {"page": "List of guitarists", "response": ["*Tim Gane (Stereolab)"]}, {"page": "Mars Audiac Quintet", "response": ["* Tim Gane – guitar, Farfisa and Vox organs, Moog synthesizer, bass"]}, {"page": "Emperor Tomato Ketchup (album)", "response": ["** Tim Gane"]}, {"page": "Cobra and Phases Group Play Voltage in the Milky Night", "response": ["Stereolab produced Cobra and Phases Group Play Voltage in the Milky Night with John McEntire, who had co-produced the band's previous two studio albums Emperor Tomato Ketchup (1996) and Dots and Loops (1997), and Jim O'Rourke. Assisted by McEntire and O'Rourke, Stereolab recorded the bulk of Cobra and Phases Group between November 1998 and February 1999, at Wolf Studios in London. As band members Tim Gane and Lætitia Sadier were occupied with raising their infant son at the time, Stereolab opted to record in London instead of Chicago, where McEntire and O'Rourke were typically based. The only material on the album that does not date to these sessions is one section of the song \"Italian Shoes Continuum\"; this section was produced by Stereolab and Fulton Dingley and recorded in February 1998 at Blackwing Studios in London. ", "In a retrospective review for AllMusic, Tim Sendra stated that while \"difficult at times, Cobra is Stereolab at their near best\", effectively balancing the band's experimental and pop sensibilities. Reviewing the album in 2019 for Uncut, Louis Pattison commented that in hindsight, \"its charms are more evident\". The same year, Tim Gane cited Cobra and Phases Group and its follow-up Sound-Dust (2001) as his favourite Stereolab albums in an interview with The Guardian: \"I like things that are sprawling and not identified really easily, not easy to digest but there's a lot of possibilities in them.\"", "** Tim Gane"]}, {"page": "Sound-Dust", "response": ["* Tim Gane – acoustic and electric guitars, piano, Pianet, Rhodes, Rock-Si-Chord, and Wurlitzer pianos, clavinet, electric harpsichord, Farfisa organ, celesta, electronics, tape echo and delay"]}, {"page": "Margerine Eclipse", "response": ["In December 2002, Stereolab member Mary Hansen was killed in a cycling accident. The band subsequently dedicated Margerine Eclipse to Hansen, with the lyrics of the song \"Feel and Triple\" making specific reference to her. Shortly before work commenced on the album, band members Tim Gane and Lætitia Sadier ended their romantic relationship. Their breakup is alluded to in Sadier's lyrics for the song \"Hillbilly Motobike\".", "* Tim Gane – electric guitar, electronics, organ"]}, {"page": "The First of the Microbe Hunters", "response": ["** Tim Gane"]}, {"page": "I Am a Wallet", "response": ["*Tim Gane – Lead guitar"]}, {"page": "Anarchy (Busta Rhymes album)", "response": ["*\"Show Me What You Got\" contains a sample from \"Come and Play in the Milky Night\", written by Lætitia Sadier and Tim Gane, performed by Stereolab."]}, {"page": "Captain Easychord", "response": ["All tracks by Tim Gane and Laetitia Sadier"]}, {"page": "Barking Abbey School", "response": ["* Tim Gane, member of McCarthy and Stereolab"]}, {"page": "Electric Circus (album)", "response": ["Common (in the center), (from top-left to bottom-right) Prince, Leroy Matthais, Simon Johns, Chad Hugo, Larenz Tate, Stic.man, Pharrell, Mattie Turner, Kenyetta Snyder, Big Daddy Kane, Vinia Mojica, Erykah Badu, Rahsaan Abraham, James Poyser, Tim Gane, DJ Dumi, Questlove, Black Thought, Grandma Gipson, Marie Daulne, Richard Pryor, Marlon Everett, Jay Dee (J Dilla), Mary Campbell, Steef Van De Gevel, M-1, Don \"Babatunde\" Eaton, Tye Tribbett, Pino Palladino, Abiodun Oyewole, Andrew Dosunmu, Umar Bin Hassan, Louis Farrakhan, Joseph Sharrieff, Steve Mandel, Jimi The Cat, Dartanian Donaldson, Mary Hansen, Steve Hess, Morgane Lhote, Kimberly Jones, Aunt Stella, Q-Tip, Marc Baptiste, Grandma Mable Lynn, Derek Dudley, Uncle Charles, Uncle Steve, John Hancock, Bob Power, Koryan Wright, Ashaka Givens, Dwayne Lyle, Eevin Wright, Russ Elevado, Marcus Murray, Barbara Sims, Rachelle, Cee-Lo Green, Jill Scott, Bayatae Abraham, Charlie Malone, Jeff Lee Johnson, Assata Shakur, Leslie Sims, Angela Murray, Kolleen \"Queenie\" Wright, Lætitia Sadier, Cousin Bianca, Omoye Lynn, Mary J. Blige, Grandma Elva Brown, Millie Malone, Chris Webber, Bilal, Lonnie \"Pops\" Lynn, Jimi Hendrix, George Daniels, Fred Hampton Jr., Fred Hampton, Omar, Seven, Karriem Riggins, Ma, and Ralph."]}, {"page": "The High Llamas", "response": ["After attending a Stereolab concert in the early 1990s, O'Hagan met the band's founders Tim Gane and Lætitia Sadier. He became their keyboardist, initially as a temporary replacement, but O'Hagan was \"allowed to make suggestions and the fun started.\" His first record appearance was on the EP Space Age Bachelor Pad Music (1993), and he remained a full-time member of the band until Mars Audiac Quintet (1994). Influenced by his time with Gane, O'Hagan decided to revamp his creative aspirations for the High Llamas. In a 1997 article, O'Hagan spoke of the Beach Boys' 1966 album Pet Sounds as \"the beginning of the great pop experiment, [before] rock and roll got hold of the whole thing and stopped it,\" and intended his new band to carry on in a similar tradition. He continued to make guest appearances on later Stereolab releases. Visser departed the group and was replaced by guitarist John Bennett."]}, {"page": "Recorded Live at a Sloan Party", "response": ["#\"On the Road Again/Transona Five\" (Tim Gane/Floyd Jones/Lætitia Sadier/Alan Wilson) – 4:42 (originally performed by Canned Heat and Stereolab, respectively)"]}, {"page": "McCarthy (band)", "response": ["McCarthy were a British indie pop band, formed in Barking, Greater London, England in 1984 by schoolmates Malcolm Eden (voice and guitar) and Tim Gane (lead guitar) with John Williamson (bass guitar) and Gary Baker (drums). Lætitia Sadier later joined the band on vocals for their final studio album.Sutton, Michael, [ \"McCarthy Biography\"], Allmusic, retrieved 27 March 2008", "Malcolm Eden, Tim Gane and John Williamson met at Barking Abbey Comprehensive School. Gane was originally a drummer, but was initially taught to play guitar by Eden, who also taught Williamson to play bass. Eden and Gane were fans of punk groups such as the Sex Pistols, The Clash, and Buzzcocks, and they covered their songs in small gigs as teenagers. Baker joined in 1984, and with the new line-up deciding on the name McCarthy (a reference to American politician Joe McCarthy), they released a self-financed first single, \"In Purgatory\" in 1985. The band were signed by the Pink Label, releasing two further singles \"Red Sleeping Beauty\" and \"Frans Hals\". The band had a track included on the NME C86 album (\"Celestial City\")."]}, {"page": "Crumb Duck", "response": ["Stereolab guitarist Tim Gane detailed the circumstances surrounding this collaboration to The Wire in 1997 (issue 164) whilst undertaking the magazine's \"Invisible Jukebox\" feature (alongside Lætitia Sadier). Gane stated that he had invited sole permanent NWW member Steven Stapleton to produce Stereolab's debut album (later released as Peng!). However, Gane stated that Stapleton had refused on the grounds that the group were \"too rock\" but had agreed to undertake a remix for the group instead. Stapleton surprised Gane by producing a letter he had written to NWW some years previously, which he had marked as the 15th piece of correspondence he had received regarding his group (also The Wire, issue 164). According to a newsletter issued by Stereolab's Duophonic Records, part of the agreement was that Stereolab would not get to hear the finished results until after the record had been pressed and released.", "# \"Animal or Vegetable (A Wonderful Wooden Reason ......)\" (Tim Gane, Laetitia Sadier, Steve Stapleton) – 13:34", "* Tim Gane – Guitar, Farfisa Organ, Group Member"]}, {"page": "Chance Meeting on a Dissecting Table of a Sewing Machine and an Umbrella", "response": ["The album contains 3 lengthy tracks and Stapleton has stated that these were edited from improvisations with some overdubbing.  Stapleton designed the sleeve using an old pornographic magazine. Some copies came in a brown paper bag as a handful of stores were not prepared to have the cover on display; however, both Rough Trade and Virgin took copies without censorship. The original hand-numbered 500 copy pressing was cleared within weeks. Amongst those who bought the album were Tim Gane, later of Stereolab, and William Bennett of Whitehouse, both of whom would later work with Stapleton."]}, {"page": "Live from a Shark Cage", "response": ["The album was released on both CD and 180-gram vinyl. As specified in the brief liner notes, \"Roadrunner\" was recorded in San Francisco by Nat Gleason, \"Drunken Spree\" was recorded in Chicago by Steve Albini (who produced Pajo's previous band Slint's first album, Tweez), \"I Am Not Lonely With Cricket\" was recorded in London by Stereolab's Tim Gane, and all other tracks were recorded at Velvetone Music Studio in Louisville, KY, pre-mastered by Konrad Strauss at Chicago Recording Company, and mastered by Nick Webb at Abbey Road Studios."]}, {"page": "Cybele's Reverie", "response": ["All tracks by Tim Gane, Laetitia Sadier"]}]}}