{"wiki_id": "http://www.wikidata.org/entity/Q7804182", "itemLabel": "Tim Robinson", "itemDescription": "English Test and County cricketer, umpire (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Robinson_(English_cricketer)", "wikipedia_page": {"main": "Robert Timothy Robinson (born 21 November 1958) is a former English cricketer, and current cricket umpire who played in 29 Test matches and 26 One Day Internationals for England from 1984 to 1989.Born in Sutton-in-Ashfield, Nottinghamshire, Robinson played for Nottinghamshire from 1978 to 1999, receiving his first team cap in 1983. Robinson was club captain between 1988 and 1995, and was made one of the Wisden Cricketers of the Year in 1986. Robinson was educated at High Pavement Grammar School in Nottingham.", "link_mentions": [{"page": "The Ashes", "response": ["In 1985, David Gower's England team was strengthened by the return of Gooch and Emburey as well as the emergence at international level of Tim Robinson and Mike Gatting. Australia, now captained by Allan Border, had itself been weakened by a rebel South African tour, the loss of Terry Alderman being a particular factor. England won 3–1.", "The Australian team of 1989 was comparable to the great Australian teams of the past, and resoundingly defeated England 4–0.Harte, pp. 679–682. Well led by Allan Border, the team included the young cricketers Mark Taylor, Merv Hughes, David Boon, Ian Healy and Steve Waugh, who were all to prove long-serving and successful Ashes competitors. England, now led once again by David Gower, suffered from injuries and poor form. During the Fourth Test news broke that prominent England players had agreed to take part in a \"rebel tour\" of South Africa the following winter; three of them (Tim Robinson, Neil Foster and John Emburey) were playing in the match, and were subsequently dropped from the England side."]}, {"page": "Ian Botham", "response": ["In 1985, Botham played in all six Tests against a poor Australian team as England, themselves a second-rate team based on their recent performances, comfortably regained the Ashes and he was the leading wicket-taker, but the series was dominated by England's specialist batsmen, especially Mike Gatting and David Gower. Botham, who by this time had adopted a dyed blonde mullet haircut as a trademark, contributed relatively little with the bat, compared with the massive totals amassed by Gower, Gatting, Graham Gooch and Tim Robinson. He scored 250 runs at 31.25 with a highest of 85. He did take the most wickets (31 at 27.58 with a best of five for 109) but he was rarely impressive and he was bowling to a weak batting side, Allan Border apart. England's best bowler was Richard Ellison who played only twice and took 17 wickets at only 10.88 with a best of six for 77 and one 10wM."]}, {"page": "David Gower", "response": ["Following his 173* in the last Test against Pakistan, Gower suffered another drop in form, managing only three fifties in the next 18 Test innings against the West Indies, Sri Lanka and India. In 1985, however, after low scores at Leeds, Gower enjoyed a \"golden season\" in the 1985 Ashes. He scored 86 and 22 at Lord's against Australia, and 166 at Trent Bridge. Following this, he scored 47 at Old Trafford, and then at Edgbaston on 15 August, scored 215 from 314 balls, his career best score, and immediately followed this with 157 at The Oval. In addition, he forged two partnerships over 300 runs, with 331 scored with Tim Robinson (148) during Gower's own double-century, and 351 with Gooch's 196 at The Oval. He ended the series with 732 runs at 81.33, leading England to a 3–1 victory."]}, {"page": "1987 Cricket World Cup", "response": ["In the English reply, opener Tim Robinson was out LBW for a first ball duck. Bill Athey (58 from 103 balls, 2 fours) top-scored, and England were almost on target, when captain Mike Gatting (41 from 45 balls, 3 fours, 1 six) handed back the initiative with the loss of his wicket, going for a reverse sweep which ended a growing partnership of 69 runs in 13 overs between him and Athey. Allan Lamb (45 from 55 balls, 4 fours) also posted a great innings, but it was in vain as the required run-rate for England began to rise. When England failed to score the last 17 runs from the final over, the cup went to Australia."]}, {"page": "University of Sheffield", "response": ["Writers who attended the university include two-times Booker Prize winner Hilary Mantel, Lee Child, Andrew Grant, Brooke Magnanti (Belle de Jour), Lindsay Ashford and Katie B. Edwards. Actors and actress Brian Glover, Ian Hallard, Rachel Shelley and Eddie Izzard were students at the university. Notable Sheffield alumni in religion includes Dean of Westminster Abbey Wesley Carr, Dean of Christ Church of Oxford Martyn Percy, General Secretary of Action of Churches Together in Scotland Stephen Smyth, and Archbishop of Sydney Glenn Davies. Many pioneers were students at the university, including first British astronaut Helen Sharman, Polar explorer Roy Koerner, and the first female pilot to fly solo from London to Australia Amy Johnson. Sheffield students have also excelled in sports. Jessica Ennis-Hill and Hollie Webb are Olympic gold medalists. Bryony Page and Nick Beighton have won medals at the Olympics and Paralympics respectively. Notable alumni in sports also include Herbert Chapman, Zara Dampney, Catherine Faux, Tim Robinson and David Wetherill."]}, {"page": "Geoffrey Boycott", "response": ["This led to Boycott being dropped from the side and forced to return to England, despite apologising via a note to the England dressing room.McKinstry, p. 230. He claimed in his autobiography, however, that he went to the golf course following medical advice to get fresh air.McKinstry, p. 229 Later in 1982 he was instrumental in organising, in defiance of a United Nations and a TCCB ban, a rebel tour of apartheid South Africa by 13 current and former England Test cricketers, who were almost all nearing the end of their careers. All the players were banned from international cricket for three years as a result.McKinstry, pp. 231–35 By the mid-1980s, with Boycott in good county form and physical shape, there was speculation that he might return to the England side. David Gower, England captain of the time, stated, however, that \"Geoffrey's been a marvellous servant for England but we have to look to the future and, in view of his age, it wouldn't make an awful lot of sense to pick him again.\" This was confirmed by the return of Graham Gooch and Tim Robinson's 175 against Australia at Leeds, which prompted Botham, who had once remarked that Boycott was \"totally, almost insanely, selfish\",Hopps, p. 18. to sing ’Bye-bye Boycott’ from the England balcony.McKinstry, pp. 254–255."]}, {"page": "Wisden Cricketers of the Year", "response": ["|  Tim Robinson"]}, {"page": "Nottinghamshire County Cricket Club", "response": ["Nottinghamshire enjoyed one of their strongest teams in the late seventies and early eighties when the New Zealand all-rounder Richard Hadlee, South African captain Clive Rice and England batsman Derek Randall led the team to the County Championship in 1981. The club's most successful season came in 1987, as Rice and Hadlee marked their departure with the double of County Championship and NatWest Trophy. Chris Broad and Tim Robinson continued the club's long tradition of batting excellence into the England team but for some years the club struggled to repeat those achievements, although they did claim a Benson & Hedges Cup in 1989 and a Sunday League title in 1991 under Robinson's captaincy. Former Warwickshire off spinner Eddie Hemmings made a significant contribution while local seam bowler Kevin Cooper was a consistent wicket taker.", "* Tim Robinson 742 (1978-99)", "|Tim Robinson|| 24,439"]}, {"page": "English cricket team in Australia in 1986–87", "response": ["The England squad that flew out to Australia on 9 October 1986 had a number of significant absentees from the previous series win; Graham Gooch was absent for personal reasons, while Tim Robinson and Richard Ellison had been dropped following poor performances against West Indies. More than half the players in the squad, including the appointed captain Mike Gatting, were on their first tour of Australia."]}, {"page": "Bill Athey", "response": ["He was a middle order batsman by inclination, but found greatest success at Test level as an opener.  Selected for the 1986/87 tour of Australia as middle order cover, he ended up opening in all five Tests with Chris Broad.  His top score was 96 in Perth.  In the 1987 summer, he was initially meant to revert to the middle order, but an injury to Broad meant that he opened in the first Test with Tim Robinson. However, in the second Test he reverted to number three, and made his only Test hundred at Lord's."]}, {"page": "Martyn Moxon", "response": ["Moxon earned 10 caps through his Test career that was delayed by injury. He was due to play against the West Indies in 1984, but a broken arm meant that his debut was delayed until the 1986 series against New Zealand.  In the intervening time, Moxon was chosen for the 1984/5 tour of India and Sri Lanka, but the premature death of his father forced him to miss early matches, by which time, Tim Robinson had cemented his place as Graeme Fowler's opening partner.  Moxon did make his ODI debut later in the tour.", "The winter touring party for the trip to Australia in 1986/7 was far from settled in advance.  Chris Broad was recalled after a two-year absence, Wilf Slack brought back having missed all but one Test during the summer, and Bill Athey was included as an 'auxiliary' batsman.  The choice of two left-handers at the top of England's order highlighted the fact that Australia's big threat came from the battery of left arm seamers available to them, led by Bruce Reid.  In the event, Slack, out of form, played  no International cricket on the tour while Athey and Broad flourished as an opening pair, Broad going on to be named as the International Cricketer of the Season. Moxon had to wait until the last Test of 1987 for a recall. Such were England's selection uncertainties that Tim Robinson had been recalled again in the intervening time."]}, {"page": "South African rebel tours", "response": ["In 1990, the final tour was led by former England captain Mike Gatting. The team included former and contemporary England players such as batsmen Tim Robinson, Bill Athey and Chris Broad, wicketkeeper Bruce French, and the fast bowlers Paul Jarvis, Graham Dilley and Neil Foster.", "*Squad: Mike Gatting (captain), Bill Athey, Kim Barnett, Chris Broad, Chris Cowdrey, Graham Dilley, Richard Ellison, John Emburey, Neil Foster, Bruce French, Paul Jarvis, Matthew Maynard, Tim Robinson, Greg Thomas, Alan Wells, David Graveney (player/manager)."]}, {"page": "World Championship of Cricket", "response": ["David Gower (captain), Jonathan Agnew, Norman Cowans, Chris Cowdrey, Paul Downton, Phil Edmonds, Richard Ellison, Neil Foster, Graeme Fowler, Mike Gatting, Allan Lamb, Vic Marks, Martyn Moxon, Tim Robinson."]}, {"page": "Nottingham College", "response": ["*Tim Robinson, cricket umpire and former Nottinghamshire cricket captain"]}, {"page": "1985 English cricket season", "response": ["*Wisden - Phil Bainbridge, Richard Ellison, Craig McDermott, Neal Radford, Tim Robinson", "England won the Ashes thanks to the batting of Mike Gatting, Tim Robinson and David Gower; and some excellent seam bowling by Richard Ellison. As in 1981, this was another disappointing Australian team, but their recovery was complete by the time of their next visit in 1989."]}]}}