{"wiki_id": "http://www.wikidata.org/entity/Q7803554", "itemLabel": "Tim Goldsworthy", "itemDescription": "British DJ, record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Goldsworthy", "wikipedia_page": {"main": "Tim Goldsworthy is a British record producer, DJ and recording artist. He has been living and working in New York City since 1999.\n\n", "link_mentions": [{"page": "Radio 4 (band)", "response": ["The band subsequently became a five-piece, comprising Roman, Collins, David Milone (Vocals/Guitar) (who replaced original guitarist/singer Tommy Williams in 2005), Gerard Garone (Keyboards), and P.J. O'Connor (Percussion), and teamed up with James Murphy and Tim Goldsworthy's DFA Productions to produce their second album. This collaboration signalled a new direction for the band, merging the guitar punk of their first album with electronic and dance music influences to create a dance-punk sound similar to other DFA-affiliated artists such as The Rapture.  Gotham! was released in 2002 on Gern Blandsten, described as \"half dance party, half political rally\", leading the band to mainstream recognition and international success."]}, {"page": "Thom Yorke", "response": ["In 2002, Yorke performed at the Bridge School Benefit, a charity concert organised by Neil Young; his set included a cover of Young's 1970 song \"After the Gold Rush\", performed on the piano Young wrote it on. In September 2004, Yorke was a key speaker at a Campaign for Nuclear Disarmament rally outside the Fylingdales air base in Yorkshire, protesting Tony Blair's support of the Bush administration's plans for the \"Star Wars\" missile defence system. In 2011, alongside Robert Del Naja of Massive Attack and Tim Goldsworthy of Unkle, Yorke played a secret DJ set for a group of Occupy activists in the abandoned offices of investment bank UBS."]}, {"page": "Cherwell School", "response": ["*Tim Goldsworthy, Record Producer, DJ and co-founder of Mo'Wax record label."]}, {"page": "Unkle", "response": ["* Tim Goldsworthy  - production (1992–1996)"]}, {"page": "Jon Spencer Blues Explosion", "response": ["The Acme outtakes and remixes were issued as Acme + (UK), Xtra Acme USA (US) and Extra Acme (CD) / Ura Acme (LP) / Extra Acme (Promo Only LP) (Japan), all of which had slightly different track listings. Like Acme the album features different production, mixing, remixing credits and guest appearances including Steve Albini, Nick Sansano, Jack Dangers, David Holmes, Tim Goldsworthy, Calvin Johnson, Moby, Andre Williams, Jill Cunniff, Cody Dickinson, Luther Dickinson and Jim Dickinson."]}, {"page": "Dunes (album)", "response": ["Dunes is the second studio album by American rock band Gardens & Villa. Produced by Tim Goldsworthy it was released on February 4, 2014 on Secretly Canadian.http://consequenceofsound.net/2013/11/gardens-villa-announce-dunes-stream-new-song-bullet-train/\"Secret Canadian press-release\" Andrew Rose, 'Gardens & Villa’s ‘Dunes’ Out Now, Secret Canadian, February 4th, 2014"]}, {"page": "Delphic (band)", "response": ["In an April 2012 interview with NME, Boardman said the band had been working on material for their second album over the course of 18 months and had been working with producers Ben Allen (Bombay Bicycle Club) and DFA Records co-founder Tim Goldsworthy. In the article, he noted their and Goldsworthy's shared affinity for contemporary R&B, which suggests a possible shift in direction on the new album."]}, {"page": "Cut Copy", "response": ["For much of 2006, Whitford had been working on the second album using the three-piece template that had been touring the world. Towards the end of September, he had much of the album complete in demo form. These recordings were sent to Tim Goldsworthy who agreed to produce the new record. In early 2007 the band travelled to New York where the new album was completed in a six-week period. Whitford commented on Goldsworthy's contribution that \"he was almost like an extra member of the band and gave us feedback on things that were working and things that he thought we could change. On top of that he has an incredible wealth of experience with what he's done with other records and brought some of those recording techniques to our music\". After some mixing in Los Angeles, the album was finalised at the band's homebase in Melbourne."]}, {"page": "DFA Records", "response": ["DFA Records is an American independent record label founded in 2001 by Mo' Wax co-founder Tim Goldsworthy, musician James Murphy, and manager Jonathan Galkin. They previously had a production team called The DFA, consisting of Goldsworthy and Murphy.", "James Murphy and Tim Goldsworthy met while working in New York on the David Holmes album Let's Get Killed.  After the recording was completed, Goldsworthy stayed in New York, and the two began to throw parties in the Lower East Side.  They created the production duo, The DFA, but wished to grow The DFA into more than what it was. It was not until they met Jonathan Galkin, who subsequently quit his event-production job to work with James and Tim, that they turned DFA into a label.", "As a production team, the DFA have produced and remixed artists including Radio 4, Le Tigre, N.E.R.D., Soulwax, Blues Explosion, Nine Inch Nails, Automato, Gorillaz, UNKLE, The Chemical Brothers and M.I.A.. The DFA remix of M.I.A.'s \"Paper Planes\" appeared on A. R. Rahman's Academy Award-winning Slumdog Millionaire soundtrack. They spent an afternoon writing a song with Britney Spears, and were also approached by Janet Jackson to collaborate. The production duo effectively came to an end when Tim Goldsworthy left New York and moved back to his native UK.  The label was primarily run by Jonathan Galkin and Kris Petersen."]}, {"page": "LCD Soundsystem (album)", "response": ["*Tim Goldsworthy – other sounds"]}, {"page": "Disco Infiltrator", "response": ["\"Disco Infiltrator\" is a song from the eponymous debut album by LCD Soundsystem. It was released on 6 June 2005 as the debut's sixth single. The song was written by LCD Soundsystem's frontman James Murphy and produced by Murphy and Tim Goldsworthy as The DFA. It contains a sample from Kraftwerk's \"Home Computer\"."]}, {"page": "The Boxer (The Chemical Brothers song)", "response": ["The DFA version, mixed by British DJ Tim Goldsworthy and LCD Soundsystems member, American musician James Murphy, was later added to their remix album The DFA Remixes: Chapter One (2006). This remix received much praise from critics, with Billboards Kerri Mason singling it out as \"the soundtrack to a 20-something hipster walking the downtown streets, iPod in pocket\" that also \"sounds like a Paradise Garage-era Peter Brown record\". Tim Finney from Pitchfork highly praised the \"Pearsonesque remix\" as the \"synth-laden Balearic house number that shimmers with unabashed gorgeousness\". Along with another lengthy song on the album, the remix for Hot Chips \"(Just Like We) Breakdown\", both were said in a review by Zeth Lundy of PopMatters to \"unfold with a delicate subtext manufactured by the slow-building minimalism—they're patient dedications to the mutability of the groove, never boring and always fascinating to experience\". musicOMHs Tom Woods said that \"a wealth of percussive techniques\" keeps things \"fresh and interesting\", but criticised its length which made the song become a \"stretch\". He added that, \"vocal use is less dominant here, which gives Murphy a chance to demonstrate a clear talent for sculpting dynamic synth-led beats\"."]}, {"page": "Echoes (The Rapture album)", "response": ["The Rapture moved from San Francisco to New York in 1999 and wrote \"House of Jealous Lovers\" the following year. They met James Murphy and Tim Goldsworthy of DFA Records at one of their first performances in New York. Murphy and Goldworthy took a long time to persuade the band to work together because of a concern that making a dance song would alienate their fans. With the help of the DFA production team, the band released \"House of Jealous Lovers\" in 2002 and eventually released their first full-length album Echoes. The album secured two Top 40 singles in the UK and also was met with critical acclaim, being awarded Album of the Year by pitchforkmedia.com and runner up in NME only to the White Stripes.", "* Tim Goldsworthy – programming, multi instruments, engineering, mixing"]}, {"page": "Strictly Turntablized", "response": ["* Tim Goldsworthy – assistance"]}, {"page": "James Murphy (electronic musician)", "response": ["Starting in 1993, Murphy used the name Death from Above when DJing, a nickname that was given to his signature PA setup while he was the sound setup for Six Finger Satellite. Murphy engineered Northern Irish DJ David Holmes’ album Bow Down to the Exit Sign and was introduced to the record’s co-producer, Tim Goldsworthy (formerly of UNKLE).  Goldsworthy and Murphy would DJ together on the Lower East Side, doing so with diverse genres of music.  They went on to found DFA Records with Jonathan Galkin in 2001.  The name \"Death from Above\" led to a dispute with a two-man Canadian band also using the same name. In response to a legal threat, the Canadian group changed their name to Death from Above 1979."]}, {"page": "Simply Mortified", "response": ["*Tim Goldsworthy – mixing"]}, {"page": "Maserati (band)", "response": ["In 2005, the band reconvened with Jerry Fuchs (Turing Machine, The Juan MacLean, !!!) stepping in on drums and Cherry re-joining on guitar. Fuchs' influence pushed the band towards a heavier, more psychedelic and space rock-influenced sound. Maserati toured the US and Europe throughout 2006 and 2007, playing with bands such as !!!, Battles, and Black Moth Super Rainbow.  The band signed with Temporary Residence in 2007, releasing their third album Inventions for the New Season later that year followed by the Inventions Remixes 12\" featuring remixes by Tim Goldsworthy and Justin Van Der Volgen.  In 2008 Scarborough left the group and was replaced by bassist Chris McNeal (Some Soviet Station, Vincas). In early 2009 Temporary Residence released the Maserati/Zombi split LP, followed by the rarities collection Passages later that year.  Throughout 2008 and 2009 the band wrote and recorded material for a new full-length between various tours supporting both MONO and STS9.  "]}, {"page": "James Lavelle", "response": ["Lavelle and Tim Goldsworthy co-founded Mo'Wax in 1992."]}, {"page": "The Warning (Hot Chip album)", "response": ["The production of The Warning was handled by vocalists Alexis Taylor and Joe Goddard, who produced and recorded the album in the band's Putney home. NME commented that the \"normality of [their] surroundings\" works well for them. Tim Goldsworthy and James Murphy of DFA Records were involved in the production of one song. Though the song \"worked out well as a record\", Taylor stated it wasn't \"an enjoyable experience in terms of feeling involved\". Taylor said that he and Goddard work best as a duo, the success of which he attributes to the years they have been acquainted."]}, {"page": "Alexis Taylor", "response": ["In February 2018, Taylor announced his new album, Beautiful Thing. The album was produced by Tim Goldsworthy, co-founder of DFA Records."]}, {"page": "Creature Comforts (album)", "response": ["The album was preceded by the Miles of Smiles EP in March of the same year. Most tracks were recorded at the Water Music, Rare Book Room and DFA's Plantain studios in New York City. \"Live Loop\" is a live-recording from the 2001 Summer Tour 2001. Both James Murphy and Tim Goldsworthy assisted with the recording while Steve Revitte mixed the album. Creature Comforts is Black Dice's last album to feature longtime drummer Hisham Bharoocha. The song \"Skeleton\" was described as the centerpiece of the album.", "Tim Goldsworthy - engineer"]}, {"page": "Out of the Races and Onto the Tracks", "response": ["Out of the Races and Onto the Tracks is the debut EP by American rock band The Rapture. It was released on May 21, 2001, through Sub Pop, and produced by Tim Goldsworthy and James Murphy. The title track was featured in the film The Rules of Attraction."]}, {"page": "DFA Compilation, Vol. 2", "response": ["DFA Compilation, Vol. 2 is a three disc box set released by the dance-punk label DFA Records. It contains tracks and remixes of various artists signed to DFA Records as well as other artists with a close affinity to the label. The first two discs are a collection of recording previously only available on 12-inch vinyl. The third disc is a mix CD of tracks featured on the compilation, and some others, mixed by Tim Goldsworthy and Tim Sweeny.  The compilation was released on November 2, 2004."]}, {"page": "Heligoland (album)", "response": ["The record features drumming from the late Jerry Fuchs and regular session and touring drummer Damon Reece. Dan Brown and Stew Jackson (Robot Club) co-wrote \"Paradise Circus\", played guitar on and co-wrote \"Saturday Come Slow\", and part-programmed and engineered those tracks. Tim Goldsworthy contributed additional production (specific tracks unstated). Most tracks were mixed with Mark \"Spike\" Stent and then all were mastered with Tim Young at Metropolis Studios, as with previous records. Unlike previous records, there are no personal acknowledgements on the inlay. Neil Davidge co-produced all tracks with Robert Del Naja only (except tracks 3, 7 and 9 where Grant Marshall was also involved), though Marshall has a co-write credit on every track. The album is dedicated to the memory of Blue Lines co-producer, Jonny Dollar.", "Subsequently, Massive Attack announced plans for the limited vinyl release of 1,000 units and digital release of an Atlas Air EP on 1 November 2010, in aid of Warchild. The EP would feature an edit of the titular song; a Tim Goldsworthy remix; a Guy Garvey-penned and previously unfinished Heligoland leftover track, \"Redlight\", featuring Guy Garvey on vocals; and its respective remix by Warp artist, Clark.", "* Tim Goldsworthy – keyboards, programming", "* Tim Goldsworthy – additional production"]}, {"page": "Let's Get Killed", "response": ["*Tim Goldsworthy – remixing on \"Radio 7\"."]}, {"page": "Gotham!", "response": ["* Tim Goldsworthy – production, sound engineering"]}, {"page": "Hercules and Love Affair", "response": ["In 2007, after Anohni had won the Mercury Prize for her work with Antony and the Johnsons, Butler approached her with the \"Blind\" demo, and they agreed to release it. Butler decided to do so under the name of Hercules and Love Affair because it reflected his interest in Greco-Roman mythology; it referenced Hercules and his \"love affair\" with Hylas. According to Butler, \"[Hercules] stayed on the island, looking for his boyfriend. I just thought this was super-beautiful: the strongest man on earth looking for his lost love, at his most vulnerable. Strong men can have strong feelings. And they can experience those feelings and experience pain and express pain — and be gay.\" DFA Records agreed to release the song, with DFA founder Tim Goldsworthy stating that \"We had slight reservations that 'Blind' would be a one-hit wonder. But then he played us some bits he had been playing around with at home.\" The single was first released in the United Kingdom in March 2007, where it made the Top 40. It was awarded Best Song of 2008 by Pitchfork Media and came in at sixth place in Resident Advisor's Top 30 tracks of that year, while Entertainment Weekly called it the second best song of the year."]}, {"page": "In Ghost Colours", "response": ["The album was produced in New York by Tim Goldsworthy, although the band's US label Interscope initially suggested they work with Timbaland. As of June 2008, the album had sold 24,000 copies in the United States, according to Nielsen SoundScan.", "* Tim Goldsworthy – production, mixing"]}, {"page": "Hercules and Love Affair (album)", "response": ["Hercules and Love Affair is the debut studio album by American electronic music band Hercules and Love Affair, released on March 10, 2008 by DFA Records. The album was produced by Andrew Butler and Tim Goldsworthy. Andrew Raposo (of fellow DFA band Automato) and Tyler Pope (of !!!) contributed bass to the album, while Anohni co-wrote and performed vocals on select songs.", "* Tim Goldsworthy – drum programming ; production "]}, {"page": "The DFA Remixes", "response": ["The DFA Remixes is a series of two remix compilations by influential dance-punk production duo The DFA (James Murphy and Tim Goldsworthy). Unlike previous DFA releases, these are remixes of other artists' work."]}, {"page": "Always Like This", "response": ["\"Always Like This\" is the second single from Bombay Bicycle Club, and the first from their debut album I Had the Blues But I Shook Them Loose. The single was released on 13 April 2009 and is available on 7\" vinyl, 12\" vinyl and download. The single was produced by Jim Abbiss, and the limited 12\" includes remixes by Tim Goldsworthy and James Rutledge. It reached #97 on the UK Singles Chart on 25 April 2009, becoming the group's first single to reach the British pop chart.Official Charts Company info OfficialCharts.com. Retrieved 1 August 2009.", "#\"Always Like This (Thee Loving Hand Remix by Tim Goldsworthy)\""]}, {"page": "Lights & Music", "response": ["* Tim Goldsworthy – additional programming, production"]}, {"page": "Hearts on Fire (Cut Copy song)", "response": ["\"Hearts on Fire\" is a song by Australian electronic music band Cut Copy, released in 2007 as the lead single from their second studio album, In Ghost Colours (2008). The song's chorus contains a small vocal sample from Jennifer Lopez's \"Waiting for Tonight\". A re-edited version of the song, produced by Tim Goldsworthy, was released on 5 July 2008 and served as the album version. Pitchfork Media named \"Hearts on Fire\" the seventh best track of 2008.", "* Tim Goldsworthy – production "]}]}}