{"wiki_id": "http://www.wikidata.org/entity/Q7804156", "itemLabel": "Tim Reeves", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Reeves", "wikipedia_page": {"main": "Tim Reeves (born 28 August 1972) is an English sidecar racer from Tenterden, Kent. He is an eight times Superside FIM World Sidecar Champion, twice with his younger brother Tristan (2005, 2006), once with Patrick Farrance (2007) and once with Ashley Hawes (2012) as passenger.In 2014 he won the Superside World Championship and the World F2 Sidecar Trophy in the Motorsport Arena Oschersleben with French passenger Gregory Cluze.\nIn 2008 Reeves and Farrance entered in their first Isle of Man Sidecar TT finishing an outstanding third place in race one and sixth in race two. In 2013 Reeves, with passenger Dan Sayle finally got to the top step of the TT podium in Sidecar TT Race 1.In the 2008 Sidecar World Championship Reeves and Farrance placed second behind Pekka Päivärinta and Timo Karttiala (LCR-Suzuki GSX-R 1000).\n.In 2017, Reeves featured heavily in the film 3 Wheeling, an observational documentary filmed during TT period of 2016. The film premiered on 7 May 2017, followed by a limited theatrical release of 61 screenings in cinema's in Northern Ireland and the Isle of Man.\n\n", "link_mentions": [{"page": "Sidecar World Championship", "response": ["In 2014, for the first time a Kawasaki-powered machine won the title with Tim Reeves and Gregory Cluze ending an 11-year consecutive Suzuki run. In 2016 Kirsi Kainulainen became the first woman motorcycle world champion, as passenger to Pekka Päivärinta.Historic world championship title for BMW sidecar Duo Pekka Päivärinta/Kirsi Kainulainen BMW Group, 19 September 2017. Retrieved 17 December 2017", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "|  Tim Reeves", "* Tim Reeves and Mark Wilkes won the first race of the season in France (Le Mans) using a German-made Adolf RS-Yamaha sidecar, thus ended LCR's winning every single race for the last 15 seasons dating back to 2003, the longest winning streak in the history of the championship by a single constructor."]}, {"page": "List of Grand Prix motorcycle racers: R", "response": ["|align=\"left\"| Tim Reeves"]}, {"page": "Sidecar TT", "response": ["| Steve Abbott, Georg Auerbacher, Florian Camathias,  Freddie Dixon, M. Hamblin, Roy Hanks, Conrad Harrison, Helmut Fath, Heinz Luthringshauser, George O'Dell, Eric Oliver*, Les Parker, C. Prichard, Tim Reeves, Nigel Rollason, Fritz Scheidegger, George H. Tucker, Chris Vincent, Terry Vinicombe || 1"]}, {"page": "Dave Molyneux", "response": ["He is also a builder of road racing sidecars under the name DMR, Dave Molyneux Racing, and has supplied sidecars to many other TT winners including 10-time winner Rob Fisher, 2006 double winner Nick Crowe and 6x FIM World Champion Tim Reeves."]}, {"page": "2008 Isle of Man TT", "response": ["At Glen Helen on lap 2, the lead for John Holden/Andrew Winkle was now reduced to 0.19 seconds. Due to the increasing race speed of Nick Crowe/Mark Crowe and problems experienced by John Holden/Andrew Winkle with a failing rear shock absorber they slipped 4.19 seconds behind the new leaders of Crowe/Cox at Ramsey Hairpin on lap 2. The Yamaha sidecar of Steve Norbury/Rick Long retired at Handley's Corner on lap 2 allowing Simon Neary/Jamie Winn to claim 3rd place and to lead the 600cc LCR Suzuki of Tim Reeves/Patrick Farrance by just 0.23 seconds in 4th place. A lap of 19 minutes, 40.43 seconds an average race speed of 115.066 mph on lap 2 by Nick Crowe/Mark Cox was the fastest of the race and now led John Holden/Andrew Winkle by 9.8 seconds. This lead increased to 12 seconds by Glen Helen on lap 3 for Crowe/Cox and the Yamaha sidecar of Simon Neary/Jamie Winn retired at Union Mills allowing TT newcomer Tim Reeves/Patrick Farrance into 3rd place. On the final climb of the Mountain Section, Nick Crowe/Mark Cox extended their lead to 16.49 seconds to win Sidecar TT Race 'A' in 59 minutes and 22.80 seconds at an average race speed of 114.372 mph from John Holden/Andrew Winkle in 2nd place at an average race speed of 113.751 mph and the former World Sidecar Champion Tim Reeves/Patrick Farrance in 3rd place at an average race speed of 111.096 mph. Despite the fast race pace, Nick Crowe commented that;- \"The bike did not feel very fast today....It wouldn't pull top gear properly. I may have overgeared it, but perhaps it was the heat.\".TT News 2008 Issue 2 p19 dated 1 June 2008 Isle of Man Newspaper  The 3rd place for Tim Reeves was the first podium place for a sidecar driver as a TT newcomer since Rolf Biland and Ken Williams finished 2nd in the 1977 Sidecar Race 'B.' In respect to his decision to enter the Isle of Man TT Races, Tim Reeves had some harsh comments;- \"I had some many doubters. So many said I wouldn't cut it here so this has just pi**ed in their Corn Flakes.\"", "||  Tim Reeves/Patrick Farrance  LCR Suzuki 600cc", "|| Tim Reeves/Patrick Farrance", "|| Tim Reeves/Patrick Farrance"]}, {"page": "List of 2007 motorcycling champions", "response": ["*::Tim Reeves  & Patrick Farrance "]}, {"page": "2009 Isle of Man TT", "response": ["Practice at the 2009 Isle of Man TT races continued on Monday 1 June 2009 with a 40-minute delay to reorganise TT Marshals on the Mountain Section of the Snaefell Mountain Course. The German TT newcomer, Rico Penzofer and triple 2008 Manx Grand Prix winner Dan Kneen completed their control-lap before the start of main evening practice session. The winner of the 2007 Supersport TT Race, Ian Hutchinson pulled in at Ballacraine on the first lap of Monday practice and John McGuinness recorded a lap of 124.35 mph after a broken gear-lever on the high speed Crosby section left his Honda motorcycle jammed in 6th gear.Isle of Man Courier p56 dated 4 June 2009 Isle of Man Newspapers The 2009 Sidecar TT winner Nick Crowe/Mark Cox again failed to record a time on Monday practice after continuing problems with the engine ignition system. The evening practice for Tuesday 2 June 2009 was held in slightly cooler weather conditions and the problems for the first two sessions of glaring sun and flies were reduced for competitors. It was again McGuinness that dominated practice in the Superbike class with a lap of 17 minutes 27.56 seconds an average speed of 129.661 mph. The sidecar TT class was led by Nick Crowe/Mark Cox with a lap of 19 minutes 39.43 seconds an average speed of 114.697 mph. The Suzuki sidecar outfit of Tim Reeves/Patrick Farrance stopped at Keppel Gate on Monday evening practice with a blocked fuel lift pump and then stopped again on Tuesday evening practice at Sulby crossroads with a snapped throttle cable, although completing the lap after borrowing a new cable from a local lawnmower dealer. The American Isle of Man TT newcomer James Vanderhaar slipped-off at Sulby Bridge and Roger Maher hit the bales at Glen Helen. The 600 cc LCR Honda sidecar outfit of David Wallis/Sally Wilson crashed at the 13th Milestone and the crew evacuated by the Medical Helicopter to Nobles Hospital.", "The pole time for the 2009 Sidecar TT Race 'A' was set by the 600 cc LCR Honda outfit of Nick Crowe/Mark Cox at an average speed of 116.063 mph during the Wednesday evening practice session.  On lap 1 the race was led at Ballacraine by the Honda of Nick Crowe/Mark Cox from the 600 cc DMR Suzuki sidecar of Dave Molyneux/Dan Sayle by 1.39 seconds with John Holden/Andy Winkle in third place.  This was followed in fourth place by the former World Sidecar Champion outfit of Klaus Klaffenbock/Darren Hope.  At the official timing point at Ballaugh Bridge on lap 1 the lead was reduced by Molyneux/Sayle to less than one second, drifting back to 2.25 seconds at the Ramsey Hairpin and Holden/Winkle a further 5.1 seconds adrift.  The 600 cc Suzuki sidecar of Simon Neary/Stuart Bond moved into fourth place at the Ramsey Hairpin on lap 1 and Tim Reeves/Patrick Farrance into 5th place.", "||  Tim Reeves/Patrick Farrance 600 cc LCR", "|| Tim Reeves/Patrick Farrance"]}, {"page": "2010 Isle of Man TT", "response": ["|  Tim Reeves/ Dipash Chauhan 600 cc Honda", "| Tim Reeves/ Dipash Chauhan"]}, {"page": "2011 Isle of Man TT", "response": ["|| Tim Reeves/ Gregory Cluze  Honda 600 cc", "|| Tim Reeves/ Gregory Cluze", "|| Tim Reeves/ Gregory Cluze"]}, {"page": "2013 Isle of Man TT", "response": ["The Blue Riband event of race meeting the Senior TT race was won by John McGuinness and raising his tally of victories to 20 Isle of Man TT wins and also breaking the outright course record in the Superbike TT with a lap at an average speed of 131.671.Isle of Man Examiner – Brialtagh Ellan Vannin pages 62-63 MCGUINNESS WINS 20TH TT Isle of Man Newspapers Ltd (2013) Johnston Press Publishing – Sheffield Web Monday 10 June 2013  The event was dominated by Michael Dunlop winning the Superbike TT race,Sunday Express page 67 MICHAEL DUNLOP fired a warning to his Honda TT Legends teammate John McGuinness 3 June 2013 Northern and Shell Ltd (2013) Trinity Mirror plc Supersport TT Races 1 & 2, the Superstock TT2013 - Edition #3 TT News page 12 & 13 HATRICK HERO Isle of Man Newspapers Ltd (2013) Bridson & Horrox Ltd \"Man of the moment, Michael Dunlop, reaffirmed the dawning of a new era when he became the first rider to win three TT's in the space of 24 hours on Monday.\" and the Joey Dunlop TT Championship with 120 points from John McGuinness and Bruce Anstey in third place.  The Sidecar TT race produced a maiden Isle of Man TT wins for the two former Sidecar World Champions with Tim Reeves / Dan Sayle winning Sidecar TT Race 1 and Ben Birchall / Tim Birchall winning Sidecar TT Race 2.  The Lightweight TT for 650cc twin-cylinder motor-cycles produced another maiden win for James Hillier and Michael Rutter scored a hattrick or wins in the TT Zero class for electric powered motor-cycles after winning for the third consecutive year.TT2014 ISLAND RACER 2014 pages 44-47 IT HAPPENED THERE: STORY OF TT 2013 Mortons Motorcycle Media Ltd (2014) Mortons Media Group Ltd", "||  Tim Reeves/ Daniel Sayle LCR 600cc", "||  Tim Reeves/ Daniel Sayle", "Fastest Lap: Tim Reeves/Daniel Sayle – 114.608 mph (19' 45.158 ) on lap 2. Sidecar 1 - Result Sheet  page 1 Gary Thompson, Clerk of the Course. ACU Events Ltd (2013) Isle of Man TT Press Office. Isle of Man Department of Economic Development.", "File:2013 Isle of Man TT 6.jpg|2013 Isle of Man TT Sidecar Race 1 — Lap 3 Tim Reeves/Dan Sayle (3) & Dave Molyneux/Patrick Farrance (1) Parliament Square, Ramsey 1 June 2013."]}, {"page": "2014 Isle of Man TT", "response": ["||  Tim Reeves/ Gregory Cluze", "||  Tim Reeves/ Gregory Cluze"]}, {"page": "Le Mans race results", "response": ["| R1:  Bennie Streuer  R1:  Emmanuelle Clément R2:  Tim Reeves  R2:   Kévin Rousseau", "|  Tim Reeves ", "|  Tim Reeves ", "|  Tim Reeves ", "|  Tim Reeves ", "|  Tim Reeves ", "|  Tim Reeves", "| R1 :  Tim Reeves R2 :  Markus Schlosser"]}, {"page": "3 Wheeling", "response": ["3 Wheeling is a Manx observational documentary film charting the sidecar class at the 2016 Isle of Man TT. The film used hidden cameras and lavalier microphones to capture an insight into the sport's highest-profile competitors, Dave Molyneux and Tim Reeves.", "The Department of Economic Development (Isle of Man) provided support in allowing the production company access to restricted zones at the TT Grandstand, and principal photography took place during racing period of 2016 with Dave Molyneux, Tim Reeves and Klaus Klaffenböck attached to star."]}, {"page": "Ben and Tom Birchall", "response": ["In 2015, the Birchalls withdrew from F1 World Championship after the opening round at Donington Park, citing a host of reasons but mainly the dangerous driving of Tim Reeves in causing a collision that disabled the Birchalls outfit, for which he was disqualified from the race result. A lengthy public statement was issued.Furious Birchalls withdraw from World Sidecar Championship Chad, Mansfield local newspaper, 31 August 2016, Retrieved 19 December 2017"]}, {"page": "2021 Sidecar World Championship", "response": ["Tim Reeves and Mark Wilkes entered the season as the reigning Driver and Passenger Sidecar World Champions respectively having won the championship in 2019. The 2020 Sidecar World Championship was cancelled due to the COVID-19 pandemic", "| Tim Reeves", "Superbike World Championship team, Bonovo Action by MGM Racing, will be making its Sidecar World Championship debut in 2021, fielding three bikes run by eight times World Champion Tim Reeves with passenger Kevin Rousseau; 2015 World Champion Bennie Streuer with new passenger, Emmanuel Clement and former Internationalen Deutschen Motorradmeisterschaft/Interessengemeinschaft Gespannrennen (IDM/IGG) Sidecar champion Josef Sattler with passenger Luca Schmidt.", "| Tim Reeves /", "| Tim Reeves /", "| Tim Reeves /", "| Tim Reeves /", "| Tim Reeves /", "| Tim Reeves /", "|rowspan=\"3\" | Tim Reeves /", "| Tim Reeves /", "| Tim Reeves /", "| align=\"left\" |  Tim Reeves"]}]}}