{"wiki_id": "http://www.wikidata.org/entity/Q7804427", "itemLabel": "Tim Vine", "itemDescription": "English comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Vine", "wikipedia_page": {"main": "Timothy Mark Vine (born 4 March 1967) is an English comedian, actor, writer and presenter, known for his one-liner jokes, and his role on Not Going Out from 2006 to 2014. He has released a number of DVDs of his stand-up comedy and has written several joke books. In 2010 and 2014, Vine won the award for best joke at the Edinburgh Festival Fringe. His winning jokes were: \"I've just been on a once-in-a-lifetime holiday. I'll tell you what, never again\" and \"I decided to sell my Hoover ... well it was just collecting dust.\" He was the runner up in 2011, 2012 and 2013.", "link_mentions": [{"page": "List of comedians", "response": ["* Tim Vine (born 1967)"]}, {"page": "March 4", "response": ["*  1967   – Tim Vine, English comedian, actor, and author"]}, {"page": "1967", "response": ["** Tim Vine, English comedian and actor"]}, {"page": "List of British comedians", "response": ["*Tim Vine (born 1967)"]}, {"page": "Joanna Lumley", "response": ["In 2011, Lumley appeared in Uptown Downstairs Abbey, the Comic Relief parody of the critically acclaimed historical television dramas Downton Abbey and Upstairs Downstairs. Playing herself and the character of Mrs. Danvers, she starred alongside others including Jennifer Saunders, Kim Cattrall, Victoria Wood, Harry Enfield, Patrick Barlow, Dale Winton, Olivia Colman and Tim Vine."]}, {"page": "Jennifer Saunders", "response": ["In 2011, Saunders wrote and appeared in \"Uptown Downstairs Abbey\", the Comic Relief parody of the critically acclaimed historical television dramas Downton Abbey and Upstairs Downstairs. Playing the Dowager Countess, she starred alongside Lumley, Kim Cattrall, Victoria Wood, Harry Enfield, Patrick Barlow, Dale Winton, Olivia Colman, Tim Vine, Simon Callow, Michael Gambon, and Harry Hill."]}, {"page": "Cheam", "response": ["* Jeremy Vine (born 1965) (presenter) and his brother Tim Vine (born 1967) (comedian) were born in Cheam"]}, {"page": "London Borough of Sutton", "response": ["In 2014, because of local council budget cuts, the venue was, along with its sister theatre, the Charles Cryer Theatre in Carshalton, identified by the Theatre Trust as one of 33 theatres in the country for inclusion on its \"At Risk\" register. The risk of closure spurred celebrity intervention in favour of the two theatres: writer, actor, comedian and BBC presenter Tim Vine, called on Sutton Council to reconsider its proposals. On 10 November 2014 the local council announced that four organisations submitting outline bids to take over the two theatres had been invited to submit full business cases by 12 December. The council worked with the Theatres Trust and Sutton Centre for Voluntary Services to help bidders through the bidding process. On 15 January 2015 the bid by the new \"Sutton Theatres Trust\" (STT) was given approval by the council's environment and neighbourhood committee to take over the theatres, thus saving them from closure. In August 2016 the Trust went into administration and the theatre closed permanently.", "thumb|Tim Vine", "* Tim Vine, actor and comedian"]}, {"page": "Chris Tarrant", "response": ["Tarrant hosted Everybody's Equal in 1989, although the programme came to an end in 1990 (the format was revived in 1997 by Channel 5 as Whittle, with Tim Vine as host). In 1991 he hosted the second series of Cluedo which was part panel quiz and part murder drama, based on the board game of the same name. On 1 January 1993, after Thames Television lost its ITV franchise had been replaced by Carlton Television, Tarrant hosted the first programme of the new contractor, A Carlton New Year. Also in 1993, Tarrant hosted Lose A Million, in which contestants started off with a (fictional) million pounds and were required to lose it by aiming to answer a set of questions incorrectly. Tarrant would later host Who Wants To Be A Millionaire?, in which the objective of the game is to do the opposite. From 1996 to 1999 Tarrant hosted the UK edition of Man O Man."]}, {"page": "Bob Monkhouse", "response": ["In a piece written several years after Monkhouse's death, critic and satirist Michael Deacon suggested that although Monkhouse had feared that his legacy as a comedian would be limited, as many people knew him only from his decades of work as a game-show host, his style of writing and performing could be seen as influencing many contemporary British comedians, such as Jimmy Carr (whose book on comedy The Naked Jape quoted several Monkhouse jokes), Michael McIntyre, Peter Kay, John Bishop, Lee Mack and Tim Vine."]}, {"page": "Comedian", "response": ["There are many established formats for jokes. One example is the pun or double-entendre, where similar words are interchanged. The Two Ronnies often used puns and double-entendre. Stewart Francis and Tim Vine are examples of current comedians who deploy numerous puns. Jokes based on puns tend to be very quick and easy to digest, which sometimes leads to other joke forms being overlooked, for example in the Funniest Joke of the Fringe awards. Other jokes may rely on confounding an audience's expectations through a misleading setup (known as a 'pull back and reveal' in the UK and a 'leadaway' in the US). Ed Byrne is an example of a comedian who has used this technique. Some jokes are based on ad absurdum extrapolations, for example much of Richard Herring and Ross Noble's standup.Archived at Ghostarchive and the Wayback Machine:  In ironic humour there is an intentional mismatch between a message and the form in which it is conveyed (for example the work of Danielle Ward). Other joke forms include observation (Michael McIntyre), whimsy (David O'Doherty), self-deprecation (Robin Williams) and parody (Diane Morgan)."]}, {"page": "Emma Bunton", "response": ["| Tim Vine Travels in Time"]}, {"page": "Kim Cattrall", "response": ["Cattrall played Cleopatra in a production of Antony and Cleopatra, directed by Janet Suzman, opposite Jeffery Kissoon as Anthony, in Liverpool at the Playhouse in October 2010, with a subsequent revival at Chichester Festival Theatre (with Michael Pennington as Anthony) in September 2012. In 2010, Cattrall was named an Honorary Fellow of Liverpool John Moores University in recognition of her contributions to the dramatic arts. In 2011, Cattrall reprised her role as Amanda in a production of Noël Coward's Private Lives opposite Canadian actor Paul Gross in Toronto and on Broadway.   The New York Times theatre critic raved about Cattrall's performance and she received a Drama League Award nomination.  That year, Cattrall also appeared in Uptown Downstairs Abbey, the Comic Relief parody of the critically acclaimed historical television dramas Downton Abbey and Upstairs, Downstairs. Playing Lady Grantham, she starred alongside Jennifer Saunders, Joanna Lumley, Victoria Wood, Harry Enfield, Patrick Barlow, Dale Winton, Olivia Colman, Tim Vine, Simon Callow, Michael Gambon and Harry Hill."]}, {"page": "List of game show hosts", "response": ["| Tim Vine || United Kingdom || Housemates (1995), Whittle (1997–98), Fluke (1997), Don't Blow the Inheritance (2012)"]}, {"page": "One-line joke", "response": ["A one-liner is a joke that is delivered in a single line. A good one-liner is said to be pithy –  concise and meaningful. Comedians and actors use this comedic method as part of their act, e.g. Jimmy Carr, Tommy Cooper, Rodney Dangerfield, Norm Macdonald, Ken Dodd, Stewart Francis, Zach Galifianakis, Mitch Hedberg, Anthony Jeselnik, Milton Jones, Shappi Khorsandi, Jay London, Mark Linn-Baker, Demetri Martin, Groucho Marx, Gary Delaney, Emo Philips, Tim Vine, Steven Wright, Gilbert Gottfried and Henny Youngman.", "* \"Crime in multi-story car parks is wrong on so many different levels.\" (Tim Vine)"]}, {"page": "Mark Williams (actor)", "response": ["Since 2013, he has appeared as the lead role in the BBC costume drama Father Brown. Williams also featured in the first series of Blandings, the BBC TV adaptation of the P. G. Wodehouse Blandings Castle stories, broadcast in 2013, in which he played Beach, the Emsworths' tipsy butler; he did not return for the show's second series, for which he was replaced by Tim Vine."]}, {"page": "Sally Phillips", "response": ["In 2017, she competed in series 5 of Taskmaster against Bob Mortimer, Aisling Bea, Nish Kumar and Mark Watson finishing runner-up to the eventual winner Mortimer. She appeared in All Star Musicals and Tim Vine Travels in Time in December 2017.", "| Tim Vine Travels in Time"]}, {"page": "Boothby Graffoe (comedian)", "response": ["During 2020, he began a series of online concerts via the Zoom platform, with performances from himself and invited guests such as Robyn Hitchcock and Tim Vine."]}, {"page": "The Sketch Show", "response": ["The original line-up of the cast was Lee Mack, Jim Tavaré, Tim Vine, Karen Taylor and Ronni Ancona."]}, {"page": "Raynes Park", "response": ["Raynes Park has a Non-League football club Raynes Park Vale F.C. who play at Prince George's Fields. Other leisure facilities in the area include the Raynes Park Residents Lawn Tennis Club, and the Malden Golf Club. The Malden Golf Club was founded in 1893 and the parkland course is set over an area of 120 acres. Wimbledon United CC have fielded a number of Sunday cricket teams with great success at their home ground at Cottenham Park for the past 90 years. Cannon Hill Common is popular for walking, cycling, recreational fishing and angling, dog walking, bird watching and represents a small piece of countryside within the city of London. Since 2010 the MyRaynesPark Festival has taken place annually for a week during the summer, providing arts and cultural events for the local community, with previous guest speakers including Yasmin Alibhai-Brown and Tim Vine."]}, {"page": "Sebastian Beach", "response": ["* In the 2013–2014 BBC series Blandings, he was played by Mark Williams in the first series and Tim Vine in the second series."]}, {"page": "Blandings Castle and Elsewhere", "response": ["In 2013 and 2014, BBC television aired a series titled Blandings starring Timothy Spall as Clarence, Jennifer Saunders as Connie, and Jack Farthing as Freddie. Beach was played by Mark Williams (2013) and Tim Vine (2014)."]}, {"page": "Spicks and Specks (TV series)", "response": ["| Casey Bennetto & Tim Vine"]}, {"page": "Epsom College", "response": ["* Tim Vine (b 1967) (H 1980–1985), record breaking comedian, brother of Jeremy"]}, {"page": "Fort Boyard (game show)", "response": ["Celebrity editions were also broadcast during the 2003 series by Challenge. It featured Doug Williams, Nikita (now stars in TNA), Paul Burchill, James Tighe, and Sweet Saraya, all of whom were wrestling stars from British promotion FWA. Doug Williams captained the team. Other celebrities appearing in series 5 included Tim Vine and Craig Phillips, Big Brother 2000 winner. The team won £1,860 for charity, which was topped up by a further £5,000 because Tim Vine accepted a challenge to tell 10 jokes in one minute.", "Broadcast in October 2004 by Challenge, Fort Boyard: Takes On The World was a ten-part documentary which introduced British viewers to various different versions of the show from around the world. Comedian and former contestant Tim Vine provided the voiceover. The show was split into sections including \"The Good, The Bad and The Ugly\", \"Heroes and Zeroes\" and \"The A-Z of Fort Boyard\". There were also interviews with various characters of the Fort (with the humour provided by the fact that Tim cannot speak French and the characters cannot speak English)."]}, {"page": "Believe Nothing", "response": ["| style=\"background:gainsboro\"| Tim Vine"]}, {"page": "Buttons (pantomime)", "response": ["*Tim Vine 2018 New Wimbledon Theatre"]}, {"page": "Banstead", "response": ["*Tim Vine, comedian"]}, {"page": "Jammin' (radio programme)", "response": ["*Tim Vine"]}, {"page": "Kitty Flanagan", "response": ["Flanagan has donated her time and talent to perform at charity and fundraising events such as Comedians Unite for the Premier's Disaster Relief Appeal to help victims of Queensland's 2011 floods, and she donated half of the profits from her 2013 Bundaberg show to the Queensland Red Cross Flood Appeal. In 2009, Flanagan performed in Sydney at the Jerry Lewis 'Laugh For Life' Charity Concert to support Muscular Dystrophy Foundation Australia (MDFA) in their fund raising and awareness efforts to fight the devastating muscle wasting disease. Flanagan appeared alongside fellow Australian comedians Julia Morris, Paul McDermott, Mikey Robins, Peter Berner, Fiona O'Loughlin, and Tom Gleeson in the fundraising gig at Sydney's Enmore Theatre. In 2003 while Flanagan was living and working in the UK, she joined some of the UK's top comedians for a charity fundraiser hosted by fellow comedian Steve Coogan. Flanagan appeared alongside Ross Noble, Johnny Vegas, Simon Pegg, Tim Vine, Lee Mack, Matt Lucas, Rob Brydon and Mark Williams in Coogan's 'Drugathon 2' to raise funds for the Chemical Dependency Centre (now named Action on Addiction) and RAPt (The Rehabilitation of Prisoners Trust)."]}, {"page": "Deborah Grant", "response": ["Deborah Grant (born Deborah Jane Snelling; 22 February 1947) is an English actress. Between 1981 and 1991, she played Deborah Bergerac in the BBC television detective series Bergerac. Since 2007, she has appeared in the sitcom Not Going Out as Wendy Adams, the mother of Tim (Tim Vine) and Lucy (Sally Bretton)."]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|Tim Vine – The Tim Vine Fiasco"]}, {"page": "Chain Reaction (radio programme)", "response": ["* Harry Hill interviewing Tim Vine", "* Tim Vine interviewing Sir Ken Dodd"]}, {"page": "Lee Mack", "response": ["His first sitcom Not Going Out for BBC One with Tim Vine (in which he plays Lee, the leading man) premiered on 6 October 2006. The show has since returned for ten more series, the most recent airing in 2021. The show has won a Rose d'Or and RTS Award.", "Mack is a darts fan, and regularly plays with his friend Tim Vine. Both men appeared on the debut series of Let's Play Darts, facing each other in the final, with Mack and his partner Martin Adams beating Vine and his partner Darryl Fitton. Mack held two Guinness World Records titles relating to darts. The first was for the most darts number twos in one minute, which stood until 19 November 2020 when Ricky Evans broke the record with a total of 25. Mack had also, on the same day of the first record, broken the record for the most darts in inner and outer bullseyes in one minute; that title was held for a year and two months before it was broken on 23 September 2016 by professional darts player James Wade."]}, {"page": "Jim Tavaré", "response": ["Tavaré co-wrote and appeared in the BAFTA-winning ITV series The Sketch Show, alongside Lee Mack, Tim Vine, Ronni Ancona, Karen Taylor, and Kitty Flanagan. In 2004, Tavaré appeared in Harry Potter and the Prisoner of Azkaban as Tom the Innkeeper. In 2008, he finished in fourth place on the American show Last Comic Standing 6, having been the only overseas act ever to have reached the final show. He performed a 63-date national tour with the other four Last Comic Standing finalists throughout the US. He appeared in the fifth series of the David Duchovny comedy-drama Californication as an English butler to a hip-hop mogul played by Wu-Tang Clan frontman RZA. He made a guest-star appearance in season 5 of the comedy and spy drama Chuck, the TV show Jimmy Kimmel Live!, and on Comedy Central's Tosh.0. In September 2013, he began filming the role of The Dog Catcher in Syco Entertainment's feature film Pudsey: The Movie alongside David Walliams, Jessica Hynes, and John Sessions.  In 2017, Tavaré was in an intensive care unit after being injured in a collision with a car. After suffering catastrophic injuries (over 30 broken bones, including 14 broken ribs, collapsed lungs, multiple fractures, broken neck and a hand that detached from the wrist) Tavare returned to the stage with a new show about his experiences entitled “From deadpan to bedpan”. http://www.jimtavare.org/"]}, {"page": "New Wimbledon Theatre", "response": ["In November 2005, the theatre saw the launch of a new UK pantomime company, First Family Entertainment with their flagship production being Cinderella starring Susan Hampshire, Richard Wilson, John Barrowman, Naomi Wilkinson, Peter Duncan, and Tim Vine. In 2006, the theatre welcomed its first Hollywood star in the shape of Happy Days' Henry Winkler. Subsequent Christmases have seen global stars including Pamela Anderson, Warwick Davis, Edna Everage, Linda Gray, David Hasselhoff, Priscilla Presley, Jerry Springer, and Ruby Wax, alongside British household names including Brian Blessed, Jo Brand, Bobby Davro, Anita Dobson, Gareth Gates, Ross Kemp, Alistair McGowan, Paul O'Grady, Joanna Page, Wayne Sleep, Louie Spence, Claire Sweeney, and Tim Vine."]}, {"page": "Richmond Theatre", "response": ["January 2013 saw Richmond Theatre extend access in the community when Suzanne Shaw and Tim Vine starred in the pantomime Aladdin, by offering its first relaxed performance as part of a pilot scheme initiated by ATG."]}, {"page": "Plymouth Pavilions", "response": ["| My Chemical Romance, Bloc Party, P!nk, Kings of Leon, Kanye West, Billy Connolly, Ricky Gervais, The Darkness, Tim Vine, Bowling For Soup, The Feeling, Heaven & Hell, Lamb of God, Enter Shikari, Lemar || 2007"]}, {"page": "Terry Alderton", "response": ["On 3 September 2016, Alderton teamed up with Tim Vine for Pointless Celebrities, returning with Jack Carroll on 10 February 2018 and Joe Pasquale on 10 Nov 2018. On 11 January 2019, he appeared on Celebrity Mastermind."]}, {"page": "Nina Conti", "response": ["Conti has appeared on Pointless Celebrities twice: 10 November 2018 with Sally Phillips and 30 October 2021 partnering Tim Vine."]}, {"page": "Jam & Jerusalem", "response": ["|Tim Vine || Tim, the local MP || Series Three: 2"]}, {"page": "Greg Cruttwell", "response": ["In 2018 Cruttwell co-devised football based TV Quiz show, Football Genius, a Hat Trick production, which was shown on ITV, with Tim Vine as host and Sam Quek and Paul Sinha as team captains."]}, {"page": "Live at the Apollo (TV series)", "response": ["|Chris Addison and Tim Vine"]}, {"page": "Comedic genres", "response": ["|One-line joke || A joke that is delivered in a single line. A good one-liner is said to be pithy - concise and meaningful || Tommy Cooper, Rodney Dangerfield, Ken Dodd, Stewart Francis, Milton Jones, Tim Vine, Henny Youngman, Mitch Hedberg,  Sean  Hegarty,  Jimmy Carr, Steven Wright, Demetri Martin, Anthony Jeselnik, Doug Benson, Jim Gaffigan, Zach Galifianakis, Shappi Khorsandi, Dan Mintz, Groucho Marx, Jay London", "|Wit/Word play || More intellectual forms based on clever, often subtle manipulation of language (though puns can be crude and farcical) || Groucho Marx, William Shakespeare, Harry Hill, Jay Jason, Oscar Wilde, Woody Allen, George Carlin, Tim Vine, Stephen Fry, Demetri Martin, Bo Burnham, Firesign Theatre, Myq Kaplan, Crazy Mohan, Coen brothers, Ronnie Barker, Stanley Unwin"]}, {"page": "List of Room 101 episodes", "response": ["|Ronni AnconaLen GoodmanTim Vine"]}]}}