{"wiki_id": "http://www.wikidata.org/entity/Q7803404", "itemLabel": "Tim Dantay", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Dantay", "wikipedia_page": {"main": "Tim Dantay (born 1963) is a British actor who was born in Southern Rhodesia (now Zimbabwe) and brought up in the Lake District.", "link_mentions": [{"page": "Murphy's Law (British TV series)", "response": ["* D.S. Mitch Kershaw - Tim Dantay (Series 5)"]}, {"page": "Making Out (TV series)", "response": ["*Ray (Tim Dantay), Jill's husband who eventually leaves her and their kids for another woman, a dimwitted hairdresser called Rosie (Jane Hazlegrove)."]}, {"page": "List of former EastEnders characters", "response": ["| DI Stephan Franklin || Tim Dantay || 2015, 2018", "|Keith Steer || Tim Dantay || 1992"]}, {"page": "Les Battersby", "response": ["Toyah began to receive English tuition from Ken Barlow (William Roache), as she wanted to become a writer. Les thought middle-aged Ken was making a move on Toyah and headbutted him. Toyah, sickened by Les and Janice, ran away to London to find who she thought was her real father Ronnie, Neil Flynn (Tim Dantay), who tied her up in his flat. Janice and Les pursued her to the big city and found her after she'd run away from Flynn. Les continued to alienate Toyah, as he beat up her boyfriend Spider and Toyah left home. Les continued to be a problem until Spider, who had begun working for the DSS, discovered Les was claiming benefits whilst working on the canal. Les was forced to leave Toyah and Spider alone. The DSS ultimately discovered Les' duplicity without Spider's help and Les was sentenced to 150 days community service scrubbing graffiti. He teased Tyrone Dobbs (Alan Halsall) for being illiterate, so Tyrone got revenge by spraying more graffiti each time Les cleaned a wall, and when Les helped out at a local park, Tyrone removed his rowing boat so that Les was marooned on an island overnight."]}, {"page": "Bleak House (2005 TV serial)", "response": ["* Tim Dantay – Mr. Rouncewell, her son, whose own son wishes to marry Rosa"]}, {"page": "List of former Hollyoaks characters", "response": ["|Vinnie Williams|| Tim Dantay || 1996"]}, {"page": "Playing the Field", "response": ["*Tim Dantay ... Dave Powell"]}, {"page": "Police 2020", "response": ["* Tim Dantay as DI Brian Sagar"]}, {"page": "Hiroshi Naka", "response": ["*Everest (John Taske (Tim Dantay))"]}, {"page": "Murder City (TV series)", "response": ["* Tim Dantay – DC Bruce Simner (Series 1)", "DC Frank Craven is more of a \"get up and let's 'ave him\" kind of cop, not afraid to push himself amongst the action and get involved when he is required to. Frank is regularly partnered with Stone, and the pair seem to have a good working relationship. Craven was initially designed to feature in a minor role, assisting Stone with the mathematical equations in \"The Critical Path\". However, after Tim Dantay left the series, Craven's role was heavily increased, with scenes for \"The Critical Path\" re-filmed and the scripts for the remaining three episodes re-written to replace Simner with Craven. Craven does not appear in \"Happy Families\" or \"Mr. Right\", despite these being midway through the first series, however this was due to the episodes being broadcast out of initial production order."]}, {"page": "Four Nights in Knaresborough", "response": ["*Cast: Nick Moran, Robert Cavanah, Tim Dantay, Joseph Millson, Joy Brook"]}, {"page": "List of EastEnders characters (1992)", "response": ["| Tim Dantay"]}, {"page": "Fast Track: No Limits", "response": ["*Tim Dantay as Neubeck"]}, {"page": "Casualty (series 18)", "response": ["*Tim Dantay as Adam Hughes (episodes 11−32)"]}, {"page": "List of Coronation Street characters (1998)", "response": ["Neil Flynn, played by Tim Dantay, made his first screen appearance on 31 August 1998.", "Ronnie Clegg is the biological father of Toyah Battersby (Georgia Taylor). Toyah's mother, Janice (Vicky Entwistle), threw him out in 1984 when Toyah was only two years old, calling him \"Ronnie Clegg, useless dreg\". He ended up in London, spending time in Wormwood Scrubs and sharing a cell with Neil Flynn (Tim Dantay). After his spell in prison he settled down and married a woman named Paula from whom he kept both his prison record and daughter a secret."]}, {"page": "List of All Creatures Great and Small (1978–1990 TV series) characters", "response": ["*Phil — Tim Dantay"]}, {"page": "List of LGBT-related films of 2010", "response": ["| Nightswimming ||  || United States || Short, romance || Linzey Cocker, Tim Dantay and Harry Eden ||14 minutes long,"]}, {"page": "Toyah Battersby", "response": ["Toyah and her family move into 5 Coronation Street and soon upset the neighbours with their bad behaviour, most notably Curly Watts (Kevin Kennedy). Toyah and her stepsister, Leanne (Jane Danson), steal from the local newsagent and indulge in under-age drinking. Toyah develops a crush on Spider Nugent (Martin Hancock) and turns vegetarian to impress him. She also asks him to help save a turkey from being slaughtered for Christmas. After arguing with her mother, Janice (Vicky Entwistle), and stepfather, Les (Bruce Jones), Toyah runs away to London to find her biological father, Ronnie Clegg (Dean Williamson). However, Toyah comes across Neil Flynn (Tim Dantay), who pretends to be her father and then abducts her. Neil takes Toyah to some woods, but while he is distracted, she escapes and is found by Janice and Les.", "Following an argument with Janice and Les, Toyah runs away to London to find her real father, Ronnie. However, she was \"led on\" by Neil Flynn (Tim Dantay), a stranger pretending to be Ronnie, and was later abducted by him. Taylor said the storyline was one of the hardest she had to film: \"In the story, I come down to London to track down my real father and things go badly wrong. Toyah hitchhikes all the way and just leaves herself so wide open. She is so naive and trusting and open to being used and abused.\" The storyline was filmed on location in the city of London in early August. An hour long episode focusing on Janice and Les' search for Toyah was broadcast a month later."]}, {"page": "This Is Personal: The Hunt for the Yorkshire Ripper", "response": ["* Tim Dantay as DC John Cleasby"]}, {"page": "Suspicion (2003 TV series)", "response": ["* Tim Dantay as DC David Rice"]}, {"page": "Thin Ice (2000 film)", "response": ["* Tim Dantay as DI Grover"]}, {"page": "Jamie Johnson (TV series)", "response": ["| Tim Dantay"]}, {"page": "Brassic (TV series)", "response": ["* Tim Dantay as Vinnie's Dad:"]}]}}