{"wiki_id": "http://www.wikidata.org/entity/Q780557", "itemLabel": "Sid Bevan", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Sid_Bevan", "wikipedia_page": {"main": "Thomas Sidney \"Sid\" Bevan (2 May 1877 – 17 October 1933) was a Welsh rugby union player who represented Wales and the British Lions. Bevan played club rugby for Swansea, joining the club in 1897.", "link_mentions": [{"page": "Swansea RFC", "response": ["In the early twentieth century Swansea RFC was an extremely successful club. For four consecutive seasons Swansea were the unofficial Welsh champions from the 1898–99 season through to 1901/02, coinciding with the heyday of Swansea's first star player Billy Bancroft. Under the captaincy of Frank Gordon the team would later go on a 22-month unbeaten run, from December 1903 through to October 1905. During this period Swansea appeared to be under-represented at international level. Gordon himself went uncapped throughout his entire career, and apart from Billy Trew, Dick Jones and Dicky Owen, the only other internationals in the senior team were forward Sid Bevan (1 cap),Smith (1980), pg 463. wing Jowett (1 cap)Smith (1980), pg 468. and outside-half Phil Hopkins (4 caps).Smith (1980), pg 134. Trew (29 caps) was an outstanding centre who was accepted as one of the most important players in the evolution of Welsh rugby,The Welsh Academy Encyclopaedia of Wales, John Davies, Nigel Jenkins, Menna Baines and Peredur Lynch (2008) pp782  while Dicky Owen (35 caps), although only 5-foot 4 inches tall, was an incredible tactician.Smith (1980), pg 132.", "*  Sid Bevan 1904"]}, {"page": "1933 in Wales", "response": ["*17 October – Sid Bevan, Wales international rugby union player, 56"]}, {"page": "Bevan", "response": ["*Sid Bevan (1877–1933), Wales and British Lion rugby union player"]}, {"page": "1877 in Wales", "response": ["*2 May – Sid Bevan, Welsh international rugby union player (died 1933)"]}, {"page": "1904 Home Nations Championship", "response": ["Wales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Cliff Pritchard (Newport), Rhys Gabe (Llanelli), Willie Llewellyn (Newport) capt., Dicky Owen (Swansea), Dick Jones (Swansea), Sid Bevan (Swansea), Howell Jones (Neath), Billy O'Neill (Cardiff), Arthur Harding (London Welsh), Alfred Brice (Aberavon), Harry Vaughan Watkins (Llanelli), Edwin Thomas Maynard (Newport), Charlie Pritchard (Newport)"]}, {"page": "1904 British Lions tour to Australia and New Zealand", "response": ["*Sid Bevan (Swansea)", "British Isles: AB O'Brien, PF McEvedy, Willie Llewellyn, Rhys Gabe, T Morgan (c), P Bush, Tommy Vile, RJ Rogers, DH Trail, Denys Dobson, Sid Bevan, RW Edwards, SN Crowther, Blair Swannell, Arthur Harding"]}, {"page": "Howell Jones", "response": ["Jones first played rugby for his local school before joining Glynneath. Like many successful players from the area, once Jones had been noticed as a rugby talent, he progressed to Neath RFC, the most notable club in the region. In the 1903-04 season, Neath made Jones the captain of the Neath senior XV. As captain of Neath, Jones was selected for his one and only international appearance, playing for Wales in the country's final game of the 1904 Home Nations Championship. Wales had already played England and Scotland, registering a draw and a win, meaning a win over Ireland would give Wales the possibility of winning the Championship. The Welsh selectors had brought in new capped players throughout the campaign and the final game was no exception. Jones was one of three players who were representing Wales for the first time during the Irish game and the tenth of the tournament. All three new caps were in the forward positions, and Jones was joined by Newport's Charlie Pritchard and Sid Bevan from Swansea. The game ended controversially, with the match referee blames for allowing Ireland a try from an illegal forward pass, and then denying Welsh wing Dick Jones a winning try. Wales finished the 1904 Championship in second and Jones was never selected to play for Wales again."]}]}}