{"wiki_id": "http://www.wikidata.org/entity/Q7807592", "itemLabel": "Timothy Walker", "itemDescription": "botanist", "wikipedia_url": "https://en.wikipedia.org/wiki/Timothy_Walker_(botanist)", "wikipedia_page": {"main": "Timothy Walker is a British botanist. He was the Horti Praefectus (Director) of the University of Oxford Botanic Garden and Harcourt Arboretum.From 1977 to 1980, Walker studied for a BA degree in Botany at University College, Oxford. From 1980 to 1982, he was a trainee gardener at the Oxford Botanic Garden. He studied for a National Certificate in Horticulture at Askham Bryan College in North Yorkshire during 1982–83. Then during 1983–84 he was a trainee gardener at the Savill Garden in Windsor Great Park. He was a diploma student at Kew Gardens during 1984–85. From 1986 to 1988 he was General Foreman at the Oxford Botanic Garden then from 1988 to 2014 he was Horti Praefectus of the Garden. He also holds a lectureship in Plant Conservation at Somerville College, Oxford and is a lecturer in Biological Sciences at the Department of Plant Sciences, University of Oxford. He has won four gold medals at the Chelsea Flower Show in London.\nIn June 2011, Walker presented Botany – A Blooming History, a series of three television programmes broadcast on BBC Four, covering the history of botany.", "link_mentions": [{"page": "Somerville College, Oxford", "response": ["In the Main or Library Quad has a cedar planted by Harold Macmillan in 1976, after an earlier cedar fell victim to a winter storm. Another tree, a Picea likiangensis (var. rubescens), was planted in 2007 on the chapel lawn, providing Somerville with an outdoor Christmas tree. The library border of lavender and Agapanthus references the bluestocking reputation of Somerville. The tory blue Ceratostigma willmottianum stands outside the Margaret Thatcher Centre. The garden outside the Thatcher Centre, now dedicated to Lisa Minoprio, was originally designed by the former director of the Oxford Botanic Garden and Lecturer in Plant Sciences Timothy Walker, and retains yellow and blue as its theme colours.", "Notable fellows of Somerville College (excluding alumni) include philosopher G. E. M. Anscombe, biochemist Louise Johnson, classical archaeologist Margarete Bieber, Egyptologist Käthe Bosse-Griffiths, classicists Edith Hall and Lotte Labowsky, author Alan Hollinghurst, astronomer Chris Lintott, International Federation of University Women founder Rose Sidgwick, botanist Timothy Walker and philologist Anna Morpurgo Davies."]}, {"page": "Julius von Sachs", "response": ["Most important are his experiments, developing the concept of photosynthesis, that the starch-grains, found in leaf chloroplasts, depend on sunlight. A leaf that has been in sunlight, then bleached white and stained with iodine turns black, proving its starch content, whereas a leaf from the same plant that has been out of the sun will remain white.  A demonstration of this experiment is shown in the second episode of BBC Four's \"Botany: A Blooming History\" presented by Timothy Walker."]}, {"page": "Melvin Calvin", "response": ["In his 2011 television history of Botany for the BBC, Timothy Walker, Director of the University of Oxford Botanic Garden, criticised Calvin's treatment of Andrew Benson, claiming that Calvin had got the credit for Benson's work after firing him, and had failed to mention Benson's role when writing his autobiography decades later. Benson himself has also mentioned being fired by Calvin, and has complained about not being mentioned in his autobiography."]}, {"page": "Very Short Introductions", "response": ["| 312 || Plants || Timothy Walker ||  || || biology"]}, {"page": "University of Oxford Botanic Garden", "response": ["Simon Hiscock became Horti Praefectus in 2015.\"Simon Hiscock\". worc.ox..ac.uk. Retrieved 31 August 2018. His predecessor, Timothy Walker, served from 1988 to 2014.\"Timothy Walker\". bristol..ac.uk. Retrieved 31 August 2018."]}, {"page": "Andrew Benson", "response": ["Benson is a major figure (at Calvin's expense) in episode 2, dealing with photosynthesis, of the history of botany presented in 2011 on BBC Four.  The series is presented by Timothy Walker and is entitled Botany—A Blooming History."]}, {"page": "BBC Natural History Unit filmography", "response": ["| Botany: A Blooming History || 2011 || A series which tells the story of how people came to understand the natural order of the plant world, and how the quest to discover how plants grow uncovered the secret to life on the planet. || Timothy Walker (presenter) || No || No"]}, {"page": "Botany: A Blooming History", "response": ["#REDIRECT Timothy Walker (botanist) "]}, {"page": "Horti Praefectus", "response": ["#REDIRECT Timothy Walker (botanist) "]}, {"page": "Timothy Walker", "response": ["* Timothy Walker (actor) (born 1972), British television and film actor", "* Timothy Walker (civil servant) (born 1945), British civil servant", "* Timothy Walker (botanist), British botanist", "* Timothy Walker (judge) (1806–1856), American lawyer"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Timothy Walker (1958), botanist, Horti Praefectus (Director) of the University of Oxford Botanic Garden and Harcourt Arboretum"]}]}}