{"wiki_id": "http://www.wikidata.org/entity/Q7815437", "itemLabel": "Tom Cowan", "itemDescription": "Scottish footballer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Cowan", "wikipedia_page": {"main": "Thomas Cowan (born 28 August 1969) is a Scottish former footballer who played as a defender.\nDuring his career he played for Clyde, Rangers, Sheffield United, Stoke City, Huddersfield Town, Burnley, Cambridge United, Peterborough United, York City, Dundee, Carlisle United, Barrow, Workington, Hucknall Town, Stalybridge Celtic, Hyde United and Retford United.", "link_mentions": [{"page": "Huddersfield Town A.F.C.", "response": ["|1996|| Tom Cowan", "|1997|| Tom Cowan"]}, {"page": "Neil Warnock", "response": ["Warnock was quick to inject new blood into the Terriers' side, snapping up goalkeeper Steve Francis, Darren Bullock, Ronnie Jepson, Tom Cowan and Pat Scully during his first season, all of whom would go on to become mainstays in the 1994–95 promotion season. He also showed faith in Centre of Excellence products such as Chris Billy, Simon Baldry and Andy Booth – a player then struggling to make the breakthrough who would go on to become a club legend in modern times. Despite these acquisitions, Town struggled for most of the 1993–94 season, their last at Leeds Road, and Warnock was quick to offload fan favourites Iwan Roberts, Iffy Onoura and Chris Marsden while introducing a more direct style of play. The run to the 1994 Football League Trophy Final (lost on penalties to Swansea City) coincided with an upturn in league form and a mass optimism further bolstered by the move to the new Alfred McAlpine Stadium for the 1994–95 season. Warnock's side won the Yorkshire Electricity Cup in late 1994. Warnock's side were genuine contenders for automatic promotion until falling away in the final few games to finish 5th (the final play-off spot that season owing to league re-structuring). They triumphed on penalties over second-placed Brentford after two thrilling ties and went on to beat Bristol Rovers at Wembley Stadium. He quit Huddersfield just days after their promotion, but made a swift and surprising return to management at Plymouth Argyle, who had just been relegated to Division Three."]}, {"page": "Bellshill", "response": ["*Tom Cowan, footballer"]}, {"page": "1993–94 in English football", "response": ["24 March 1994 – Manchester City sign Everton winger Peter Beagrie for £1.1million. He is succeeded at Goodison Park by Arsenal's Anders Limpar for £1.6million. Tottenham Hotspur's quest to sign a new striker in an attempt to stave off relegation ends in failure when West Ham's Clive Allen signs for Division One promotion chasers Millwall for £75,000, ending talk his return to Tottenham, who also fail to lure Frenchman Jean-Pierre Papin from Bayern Munich. Steve Morrow is reportedly set for a new Arsenal contract after a proposed move to a Swindon Town side heading for relegation is called off. Another player going nowhere is QPR striker Les Ferdinand, who has been subject to transfer speculation for months. Joining Anders Limpar at Goodison Park is 20-year-old AFC Bournemouth midfielder Joe Parkinson, a hot prospect costing £250,000. Leicester City boost their promotion challenge with a £360,000 move for Portsmouth midfielder Mark Blake. Wimbledon sign Brentford striker Marcus Gayle for £250,000. Loan moves include Jeroen Boere (West Ham United to Portsmouth), Ian Kilford (Nottingham Forest to Wigan Athletic), Tom Cowan (Sheffield United to Huddersfield Town), Scott Marshall and Jimmy Carter (both Arsenal to Oxford United) and Paul Dickov (Arsenal to Brighton & Hove Albion)."]}, {"page": "Holytown", "response": ["Tom Cowan was from Holytown, and played in the Holytown Colts side that won the 1981 Under-13 Scottish Cup against Celtic Boys Club. He went on to play in the senior professional game for a number of clubs as a defender including most notably Rangers, Sheffield United and Stoke City, but spent the bulk of his time at Huddersfield Town, Cambridge United and Carlisle United. He was player of the year twice at Huddersfield."]}, {"page": "Thomas Cowan", "response": ["*Tom Cowan (born 1969), Scottish footballer", "*Tom Cowan (director) (born 1942), Australian filmmaker"]}, {"page": "2005 Conference National play-off Final", "response": ["At the other end, Holmes flicked on a long ball for Glenn Murray who controlled the ball on his chest and shot in one movement from 14 yards out, but Julian again saved well. Carlisle then took the lead in the 23rd minute after Tom Cowan's cross was headed into the bottom corner by Peter Murphy. Stevenage pressed forward looking for the equalising goal with Jon Brady finding Darryn Stamp at the back post with a good cross, whose header was deflected over. At the other end, Goodliffe cleared a header off the line to keep Stevenage in the match.", "|DF ||3 ||Tom Cowan"]}]}}