{"wiki_id": "http://www.wikidata.org/entity/Q7814862", "itemLabel": "Tom Barcroft", "itemDescription": "English football manager (1870-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Barcroft", "wikipedia_page": {"main": "Thomas A. Barcroft (1870 – 26 September 1946) was the secretary-manager of Blackpool between 1903 and 1909. He was the Seasiders' first recognised manager, but his role was not full-time.\nA 33-year-old Barcroft was in charge for the first game of the 1903–04 season. Under his leadership, Blackpool won eleven and drew five of their 34 League games. They finished fourth from bottom.\nThe following campaign, 1904–05, saw an identical finishing position.\nThey finished 14th in 1905–06, 13th in 1906–07, before another 15th-placed finish in 1907–08.\nIn his final season at the helm, Blackpool finished bottom and had to apply for re-election to the Football League.\nBarcroft remained as secretary at Bloomfield Road for the next quarter-century. On 3 July 1934, he received an illuminated manuscript in recognition of his 31 years of service to the club. He had even deputised in goal during the 1901–02 season, after Joe Dorrington missed the train from Blackpool to Leicester.\nHe died on 26 September 1946 at his home in Blackpool, he was 75.", "link_mentions": [{"page": "Blackpool F.C.", "response": ["|Tom Barcroft (secretary-manager)||1903||1909||220||61||55||104||27.73||"]}, {"page": "Barcroft", "response": ["* Tom Barcroft (1870after 1909), English football secretary-manager"]}, {"page": "1909–10 Blackpool F.C. season", "response": ["Jack Cox took on the role of player-manager for the first time, succeeding club secretary Tom Barcroft."]}, {"page": "Harry Hancock", "response": ["Born in Levenshulme, Hancock began his career with Cheshire club Melrose, followed by a stint with Port Sunlight. After a spell with Stockport County, he joined Blackpool, then under the managership of club secretary Tom Barcroft. In his one season with \"the Seasiders\", in 1905–06, he was the club's joint-top scorer in the League, alongside Jimmy Connor and an E. Francis, with six goals. Blackpool never lost when Hancock scored. He also scored three goals in that season's FA Cup, as Blackpool made it to the Third Round, to become the outright top scorer."]}]}}