{"wiki_id": "http://www.wikidata.org/entity/Q7815030", "itemLabel": "Tom Bradby", "itemDescription": "British journalist and novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Bradby", "wikipedia_page": {"main": "Thomas Matthew Bradby (born 13 January 1967) is a British journalist and novelist who currently presents the ITV News at Ten. He was previously political editor for ITV News from 2005 to 2015, and presented The Agenda with Tom Bradby, a political discussion series, from 2012 to 2016.", "link_mentions": [{"page": "Jimmy Walker", "response": ["The political and criminal activity surrounding Walker's 1929 campaign features heavily in Tom Bradby's 2009 novel Blood Money."]}, {"page": "Prince William, Duke of Cambridge", "response": ["On 13 November 2005, an article appeared in the News of the World written by royal editor Clive Goodman, that claimed that Prince William was in the process of borrowing a portable editing suite from ITV royal correspondent Tom Bradby. Prince William noted that another equally improbable leak had recently taken place regarding an appointment he had made with a knee surgeon. After some discussion, the Prince and Bradby concluded it was likely that their voicemails were being accessed. An investigation under Deputy Assistant Commissioner Peter Clarke concluded that the compromised voice mail accounts belonged to Prince William's aides, including Jamie Lowther-Pinkerton, and not the Prince himself. However, Clive Goodman later stated that he had hacked William's phone on 35 occasions."]}, {"page": "ITN", "response": ["The rebranded programme again saw new titles, this time featuring people walking over the face of Big Ben and has lately followed a more \"sensationalist\" approach to its main headlines. When ITV executive chairman Michael Grade joined ITV, he made it clear that he saw news as the key in defining any channel. On 14 January 2008, the News at Ten returned, presented by Julie Etchingham and McDonald returned to his duties again. Mark Austin joined Etchingham as co-presenter in 2009. As of October 2015, Tom Bradby has been the main presenter on the programme."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Tom Bradby"]}, {"page": "Sherborne School", "response": ["Old Shirburnians in the media include TV journalist and ITV News political editor Tom Bradby, TV journalist and Sky News defence correspondent Alistair Bunkall, journalist Nigel Dempster, TV journalist and BBC News presenter Simon McCoy, BBC producer and creator of panel games including Just a Minute, Many a Slip. and Twenty Questions Ian Messiter, journalist (Times, The Observer), writer (The New France, Germany and the Germans) and broadcaster, John Ardagh, journalist and film critic for The New Yorker magazine Anthony Lane, and TV, radio and print journalist, and BBC News Central Europe Correspondent Nick Thorpe."]}, {"page": "The Student (newspaper)", "response": ["* Tom Bradby (Former Political Editor, ITV News)"]}, {"page": "Nick Robinson (journalist)", "response": ["Robinson left the BBC in 2002 to join Independent Television News (ITN) as the political editor of ITV News. Tom Bradby, who later succeeded him in the role, described the appointment as \"bold, imaginative and instantly successful\". Robinson stayed with ITN for three years, and caused a major stir early in the 2005 general election campaign, when a Labour Party poster was unveiled. The poster claimed the Conservative Party would initiate cuts of £35 billion to public services if elected; Robinson challenged Prime Minister Tony Blair, claiming the poster was misleading, which forced Blair to admit the £35 billion figure was \"disingenuous\"."]}, {"page": "ITV News", "response": ["The US presidential election of November 2008 was covered by ITN on the ITV network between 23:15 and 06:00 in a programme titled Election Night Live: America Decides, which saw ITN team up with fellow news organisation NBC News; Alastair Stewart hosted from the studio in London, supported by MORI-founder Bob Worcester and a team of studio guests throughout the evening. Julie Etchingham, James Mates, Bill Neely and John Irvine provided the all-important presenting and reporting duties from the United States. Stewart also presented ITN coverage of the European elections of 2009, an intimate affair with the newscaster and ITV News election analyst Colin Rallings in the studio. Political Editor Tom Bradby and Senior Political Correspondent Chris Ship provided regular updates, and a team of reporters gave results as they were counted around the country.", "The 2015 UK general election was held on Thursday 7 May 2015. Tom Bradby and Julie Etchingham anchored ITV's coverage of the results from the main ITV News studio at ITN from 21:55 on Thursday 7 May and continued through the night until 06:00 on Friday 8 May 2015. They were joined in the studio by election analysts Professor Colin Rallings and Professor Jane Green. Nina Hossain presented live from the \"Opinion Room\" at ITN where journalists, bloggers, politicians and experts gave their view on the results of the election. From the \"Opinion Room\", viewers could contact the programme via Facebook and Twitter to give their views and opinions. UTV in Northern Ireland and STV in Scotland provided their own overnight coverage of the election results in their region from their main studios in Belfast and Glasgow, dipping in and out of the ITV news coverage during the night. The rest of the UK had regular regional news opt outs from their own local ITV News programmes during the overnight coverage on ITV.", "At 06:00 on Friday 8 May 2015, ITV's breakfast programme Good Morning Britain aired their first election coverage special on ITV, Good Morning Britain having only launched in the spring of 2014. Hosts Susanna Reid and Ben Shephard were joined by Tom Bradby for breakfast coverage of the results. At 09:25 ITV News resumed with their own coverage of the results with Alastair Stewart and Julie Etchingham at their anchor desks until late afternoon on ITV. During the course of the day there were regular regional news opt outs, with UTV and STV providing more extensive coverage of the election results in their own region.", "The then Prime Minister Theresa May called a snap general election for Thursday 8 June 2017.  ITV News once again had Tom Bradby at the helm from 9:55pm on ITV, using the same set design from the 2015 general election. He was joined by Professors Jane Green and Colin Rallings, along with Robert Peston and Nina Hossain. Bradby was joined through the night by former chancellor George Osborne and former shadow chancellor Ed Balls. Coverage handed over to Good Morning Britain with Piers Morgan and Susanna Reid from 6:00am, with the ITV News coverage resuming at 9:25am, and airing through the rest of the day on ITV with Julie Etchingham anchoring the coverage through Friday.", "The 2019 general election happened on Thursday 12 December 2019. ITV News once again had Tom Bradby as the main anchor in the studio, using once again a similar set design used in 2015 and 2017, however some updates to the background were made. ITV News also used the large space of the atrium at ITN headquarters in London, using it as the election results headquarters, with Robert Peston-based there. Coverage started at 9:55pm and aired through the night, handing over once again to Good Morning Britain at 6.00m, and resuming coverage from 9:25am with Julie Etchingham anchoring the coverage through Friday."]}, {"page": "ITV News at Ten", "response": ["When the bulletin was axed in 1999 in order for primetime entertainment programming to air uninterrupted, there was a public outcry. ITV reluctantly brought the programme back – under the name ITV News at Ten – in 2001, airing it at 10pm for a minimum of three nights per week, but eventually replaced it with the ITV News at 10.30 in 2004. It was not until January 2008 that News at Ten was reinstated to the ITV schedule. The programme's current main anchor is Tom Bradby.", "As part of a move to enhance the reputation of ITV's news and current affairs output, News at Ten was restructured and redeveloped across a number of months: the new format launched in October 2015, placing more emphasis on analysis, context and a more \"conversational\" presentation style under new presenter Tom Bradby, former ITV News political editor; then the appointments of former BBC News journalists Robert Peston (as political editor) and Allegra Stratton (as national editor), who both reiterated in the press ITV's newfound intention to challenge the dominance of BBC News; and a refreshed set and opening title sequence in January 2016.", "*Tom Bradby: Lead newscaster (2015–)"]}, {"page": "Tonight (1999 TV programme)", "response": ["* Tom Bradby (2016; 1 episode)"]}, {"page": "Mark Austin (journalist)", "response": ["On 6 December 2013, following the death of Nelson Mandela the previous day, Austin fronted a tribute programme Nelson Mandela: His Life and Legacy. In October 2015, Mark was replaced by Tom Bradby on ITV News at Ten. He then moved back to the ITV Evening News, presenting alongside Mary Nightingale."]}, {"page": "Political editor", "response": ["| Tom Bradby || 2005–2015 || Now an ITV News at Ten presenter"]}, {"page": "Robert Peston", "response": ["On 4 October 2015, it was announced that Peston would leave the BBC to join ITV News as their Political Editor, replacing Tom Bradby who became the main presenter of News at Ten. Peston made his last appearance on BBC News on 25 November 2015, and his first appearance on ITV's News at Ten on 11 January 2016. He had a significant scoop in April 2016, when Prime Minister David Cameron stated in an interview he had profited from his father's offshore Blairmore Holdings trust, after information about the trust had been disclosed in the Panama Papers release.", "|The Agenda with Tom Bradby"]}, {"page": "Category talk:British journalists", "response": ["Tom Bradbynot yet classified"]}, {"page": "Westbourne House School", "response": ["* Tom Bradby, journalist and author"]}, {"page": "CWA Ian Fleming Steel Dagger", "response": ["** Tom Bradby, The Master of Rain"]}, {"page": "List of fiction set in Shanghai", "response": ["*The Master of Rain by Tom Bradby"]}, {"page": "Clive Anderson's Chat Room", "response": ["| David Quantick, Steve Bell, Ronni Ancona, Tom Bradby"]}, {"page": "Julie Etchingham", "response": ["In March 2015 it was announced that Etchingham would chair a televised leaders debate for ITV ahead of the 2015 general election, the only leaders debate featuring Prime Minister David Cameron to be held that year. The programme was called The ITV Leaders' Debate. The debate took place on 2 April. Andrew Pettie of The Telegraph described Etchingham's presenting style as \"composure itself\", adding that it was \"a bit robotic but this was no bad thing: it was refreshing to see a TV interviewer resolutely refusing to hog the limelight.\" She later co-presented the ITV coverage of the general election with Tom Bradby.", "In October 2015, News at Ten relaunched and returned to the single newscaster format, with former political editor Tom Bradby becoming the programme's new main presenter. Etchingham continues on the programme as Deputy Anchor, sharing the role with Rageh Omaar. Etchingham also files special reports for the programme.", "On 17 April 2021, Etchingham co-presented ITV's coverage of the funeral of Prince Philip, Duke of Edinburgh with Tom Bradby.https://www.itv.com/hub/prince-philip-a-royal-funeral/10a1507", "| Alongside Tom Bradby", "| Alongside Tom Bradby"]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Tom Bradby – ITV News political editor, July 2005 – October 2015; joined ITN as an editorial trainee in 1990 and subsequently became producer for Michael Brunson, ITN's political editor, in 1992; Ireland correspondent 1993–1996; Asia correspondent 1999–2001; then Royal correspondent for ITV News; subsequently became UK editor before taking up the post of political editor; gave up his position as political editor in October 2015 to become sole anchor of ITV News at Ten", "* Robert Peston – ITV News' Political Editor since January 2016, replacing Tom Bradby; formerly BBC News' Business and Economics Editor."]}, {"page": "Boris Johnson", "response": ["In 2015, Johnson criticised then-presidential candidate Donald Trump's false comments that there were no-go zones in London governed by shariah and inaccessible for non-Muslims. Johnson said Trump was \"betraying a quite stupefying ignorance that makes him, frankly, unfit to hold the office of president of the United States\", becoming the first senior politician in the UK to declare Trump unfit for office (but rejecting calls for him to be banned from the country). Johnson added that he \"would invite [Trump] to come and see the whole of London and take him round the city – except I wouldn't want to expose Londoners to any unnecessary risk of meeting Donald Trump\". He later called Trump's comments \"ill informed\" and \"complete and utter nonsense\", adding that \"the only reason I wouldn't go to some parts of New York is the real risk of meeting Donald Trump\". In 2016, he said he was \"genuinely worried that he could become president\", telling ITV's Tom Bradby of one moment where he was mistaken for Trump in New York as \"one of the worst moments\" of his life."]}, {"page": "List of news presenters", "response": ["* Tom Bradby, ITN ITV News at Ten"]}, {"page": "The Sun Military Awards", "response": ["| 2015 || Tom Bradby || rowspan=\"5\" |Forces TV || rowspan=\"2\" |Guildhall", "The 2015 awards took place at Guildhall, London and were presented by Tom Bradby."]}, {"page": "List of ITV News on air staff", "response": ["*Tom Bradby"]}, {"page": "News International phone hacking scandal", "response": ["On 14 November 2005, the News of the World published an article written by royal editor Clive Goodman, claiming that Prince William was in the process of borrowing a portable editing suite from ITV correspondent Tom Bradby. Following the publication, the Prince and Bradby met to try to figure out how the details of their arrangement had been leaked, as only two other people were aware of it. Prince William noted that another equally improbable leak had recently taken place regarding an appointment he had made with a knee surgeon.The Daily Telegraph The Prince and Bradby concluded it was likely that their voicemails were being accessed."]}, {"page": "Wedding of Prince William and Catherine Middleton", "response": ["Following the announcement, the couple gave an exclusive interview to ITV News political editor Tom Bradby and hosted a photocall at St James's Palace. On 12 December 2010, Buckingham Palace issued the official engagement photographs; these were taken on 25 November, in the state apartments at St. James's Palace, by photographer Mario Testino."]}, {"page": "List of wedding guests of Prince William and Catherine Middleton", "response": ["*Tom Bradby (ITN political editor) and Claudia Bradby (a jewellery designer who worked with Middleton at Jigsaw)"]}, {"page": "News of the World royal phone hacking scandal", "response": ["On 13 November 2005, an article appeared in the News of the World written by royal editor Clive Goodman, that claimed that Prince William was in the process of borrowing a portable editing suite from ITV royal correspondent Tom Bradby."]}, {"page": "List of British films of 2012", "response": ["|| Paramount Pictures   Based on Shadow Dancer by Tom Bradby"]}, {"page": "Shadow Dancer (film)", "response": ["Shadow Dancer is a 2012 British-Irish drama film directed by James Marsh and scripted by Tom Bradby, based on his 1998 novel of the same name. The film premiered at the 2012 Sundance Film Festival, and it was screened out of competition at the 62nd Berlin International Film Festival in February 2012."]}, {"page": "The Agenda with Tom Bradby", "response": ["The Agenda is a political discussion programme on British television network ITV, broadcast on Monday evenings from 10.45pm. The programme was presented by ITV News anchor Tom Bradby and was first broadcast on 27 February 2012."]}, {"page": "List of Old Shirburnians", "response": ["* Tom Bradby, TV journalist and ITV News Political Editor"]}, {"page": "2016 United Kingdom European Union membership referendum", "response": ["The BBC, ITV and Sky News all provided live coverage of the counts and the reaction to the result. The BBC's coverage, presented by David Dimbleby, Laura Kuenssberg and John Curtice, was simulcast domestically on BBC One and the BBC News Channel, and internationally on BBC World News. ITV's coverage was presented by Tom Bradby, Robert Peston and Allegra Stratton.", "| Tom Bradby, Robert Peston & Allegra Stratton", "| Tom Bradby, Robert Peston & Allegra Stratton"]}, {"page": "Good Morning Britain (2014 TV programme)", "response": ["| Tom Bradby"]}, {"page": "The Great Fire (TV series)", "response": ["The Great Fire is a four-part television drama first shown on ITV from 16 October to 6 November 2014. It is set during the Great Fire of London in England in 1666. It was written by Tom Bradby and produced by Ecosse Films. Each hour-long (including commercial breaks) episode is set in one day of the fire."]}, {"page": "2015 in British television", "response": ["|The BBC, ITV, Channel 4 and Sky News provide coverage of the results of the 2015 general election, which sees the Conservatives secure a slim majority. Overnight viewing figures indicate the BBC's coverage, which saw David Dimbleby presenting his last election programme, to have been watched by 6.35 million. Channel 4's Alternative Election Night was seen by 1.9 million, while ITV's coverage, presented by Tom Bradby and Julie Etchingham, was watched by 1.45 million viewers. An audience of 356,000 tuned into Sky News in the first hour to watch coverage presented by Adam Boulton. The BBC's election coverage sees Dimbleby apparently losing his patience when, at 4:01am, he is heard to utter \"for God's sake\" as the programme returns to the studio following a short break.", "|ITV News political editor Tom Bradby is appointed as the main anchor for News at Ten, replacing Mark Austin who will move back to the ITV Evening News. News at Ten is returning to its single-presenter format from the autumn, with Julie Etchingham and Rageh Omaar presenting in Bradby's absence.", "|ITV News at Ten is relaunched with Tom Bradby as its main anchor. The first edition attracts an audience of 1.3 million, compared to 4.1 million who tune in to the BBC Ten O'Clock News.", "|ITV executives have accused their BBC rivals of \"arrogance\" after BBC Ten O'Clock News anchor Huw Edwards posted a comment on Facebook mocking the revamped ITV News at Ten and its presenter, Tom Bradby for losing viewers. In a subsequent Sunday Times article responding to Edwards' comments Bradby accuses the BBC of behaving like Imperial Rome and wanting to put their commercial rivals out of business. ", "|An edition of ITV News aired at 10:55pm shows Tom Bradby interviewing patrons of a Paris café when rumours of a fresh terrorist attack spark a stampede. The edition is seen by 4.3 million viewers."]}, {"page": "2017 in British television", "response": ["|BBC One and ITV provide live coverage of the inauguration of Donald Trump as the 45th President of the United States; BBC coverage of the event is presented by BBC World's Katty Kay, with ITV's coverage presented by Tom Bradby. Also, BBC News announces that Kay would co-present 100 Days covering Trump's first 100 days, however in the end the programme carries on indfefinley apart from a summer break in August."]}, {"page": "White Russia", "response": ["* The White Russian, a 2003 novel by Tom Bradby"]}]}}