{"wiki_id": "http://www.wikidata.org/entity/Q7816462", "itemLabel": "Tom Killin", "itemDescription": "Scottish and British paralympic sportsman, fencer, wheelchair curler", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Killin", "wikipedia_page": {"main": "Tom Killin (born 30 March 1950) is a British multi-sport Paralympian. Killin was paralysed following a traffic accident at the age of 17.Killin was born in Edinburgh. He won two medals in fencing at the 1970 Commonwealth Games. He also represented Scotland and Britain in disability table tennis and basketball for 12 years, including winning a World Championship silver medal in singles table tennis.\nKillin made his first Paralympic appearance as a wheelchair fencer at the 1980 Summer Games where he won two silver medals, and also competed in the 1984 Summer Paralympics.He first joined the Braehead Curling Club in 2003. In 2005 he represented Scotland at the World Championships in a team that also contained Frank Duffy, Ken Dickson, Angie Malone and Michael McCreadie. They won the gold medal and all five athletes were selected to compete for Britain in the first Paralympic wheelchair curling event held at the 2006 Winter Paralympics in Turin, Italy.During the Paralympic tournament Britain won their group games against the teams from Denmark, Sweden, Italy and the United States, and lost the matches against Switzerland, Norway and Canada. Their record of four wins and three losses meant they finished the group stage in second place and advanced to the medal rounds. They beat Sweden in the semifinal and went on to face Canada in the final. Trailing 6–3 in the final, end skip Frank Duffy had an opportunity with the last stone of the tournament for an open hit of a Canadian stone that would have scored four for Britain and won them the gold medal. He threw too hard and the shot tracked an inch wide allowing Canada to score one and win 7–4 leaving Killin and the rest of the British team as silver medalists.In 2010 Killin was again part of Great Britain's Paralympic wheelchair curling team. The team, which also featured Michael McCreadie as skip, Angela Malone, Aileen Neilson and James Sellar, had finished fifth at the 2009 World Championships. Britain won three of their nine group games, beating teams from Switzerland, Germany, and Japan. They finished in sixth position, which meant that they did not advance to the medal matches.", "link_mentions": [{"page": "Wheelchair curling at the 2006 Winter Paralympics", "response": ["| Frank DuffyMichael McCreadieTom KillinAngie MaloneKen Dickson", "The British team, competing as Scotland and made up of Frank Duffy, Ken Dickson, Tom Killin, Angie Malone and Michael McCreadie had won the gold medal at the World Championships in January 2005 in Glasgow; Denmark and Switzerland won the silver and bronze medals. Britain had also won the 2004 World Championships, and were considered favourites for a medal.", "| ||Frank Duffy||Michael McCreadie||Tom Killin||Angie Malone||Ken Dickson||Tom Pendreigh"]}, {"page": "Great Britain at the 2006 Winter Paralympics", "response": ["The British wheelchair curling team was made up of Frank Duffy the skip, Ken Dickson, Tom Killin, Angie Malone and Michael McCreadie. This was the same team that had won the World Championships in January 2005 in Glasgow, all but Killin had also won the 2004 World Championships, and many considered them strong contenders for a medal. Although this was the first time wheelchair curling had been included as a Paralympic sport the team did have previous Games experience. Michael McCreadie, who made his first Paralympics appearance in 1972, was competing in his sixth Paralympics and had previously won two bronze medals for Lawn Bowls in the 1976 Summer Paralympics. Tom Killin was a previous silver medallist in wheelchair fencing at the 1980 Summer Games. The team received the same preparation as Great Britain's Olympic Curlers; funding came from the National Lottery as well as the Scottish Institute of Sport. The team's coach, Tom Pendreigh, was also personal coach of the men's Olympic skip David Murdoch.", "Frank DuffyKen DicksonTom KillinAngela MaloneMichael McCreadie"]}, {"page": "Wheelchair fencing at the 1984 Summer Paralympics", "response": ["|valign=top|   Kevin Davies  Brian Dickinson  Tom Killin  Terry Willett"]}, {"page": "Wheelchair fencing at the 1980 Summer Paralympics", "response": ["|valign=top|   Mike Kelly  Tom Killin  Howard Wardle  Terry Willett"]}, {"page": "Wheelchair curling at the 2010 Winter Paralympics", "response": ["| Michael McCreadie || Aileen Neilson || Tom Killin || Angie Malone || Jim Sellar || Tom Pendreigh"]}, {"page": "Great Britain at the 1984 Summer Paralympics", "response": ["|  || Kevin Davies Brian Dickinson Tom Killin Terry Willett || Wheelchair fencing || Men's sabre team"]}, {"page": "Great Britain at the 2010 Winter Paralympics", "response": ["Britain’s wheelchair curling team consisted of Michael McCreadie, Angela Malone, Tom Killin, Aileen Neilson and James Sellar. These five athletes, representing Scotland, had finished fifth at the 2009 World Championships. Three of the team, McCreadie, Malone and Killin, were also in the GB team which won the silver medal in the event at the 2006 Turin Games. McCreadie, who was competing in his seventh Paralympics, won two bronze medals for Lawn Bowls in the 1976 Summer Paralympics and Killin was a previous silver medalist in wheelchair fencing at the 1980 Summer Games.", "Michael McCreadieAngela MaloneTom KillinAileen NeilsonJames Sellar"]}, {"page": "World Wheelchair Curling Championship", "response": ["| Frank Duffy Michael McCreadie Tom Killin Angie Malone Ken Dickson", "| Aileen Neilson Tom Killin Gregor Ewan Angie Malone Michael McKenzie"]}, {"page": "Wheelchair curling at the Winter Paralympics", "response": ["| Frank DuffyMichael McCreadieTom KillinAngie MaloneKen Dickson"]}, {"page": "List of 2006 Winter Paralympics medal winners", "response": ["| Frank DuffyMichael McCreadieTom KillinAngie MaloneKen Dickson"]}, {"page": "List of Paralympic medalists in wheelchair curling", "response": ["| Frank DuffyMichael McCreadieTom KillinAngie MaloneKen Dickson"]}, {"page": "2011 World Wheelchair Curling Championship", "response": ["Third: Tom Killin"]}, {"page": "2012 World Wheelchair Curling Championship", "response": ["Third: Tom Killin"]}, {"page": "2009 World Wheelchair Curling Championship", "response": ["Second: Tom Killin"]}, {"page": "2013 World Wheelchair Curling Championship", "response": ["Lead: Tom Killin"]}, {"page": "2008 World Wheelchair Curling Championship", "response": ["Second: Tom Killin"]}, {"page": "2005 World Wheelchair Curling Championship", "response": ["Second:  Tom Killin"]}, {"page": "Angie Malone", "response": ["All five athletes of the 2005 World Championship team (Angie Malone, Frank Duffy, Ken Dickson, Tom Killin and Michael McCreadie) were selected to compete for Britain in the first Paralympic wheelchair curling event, held at the 2006 Winter Paralympics in Turin, Italy, an event in which the GB team coached by Tom Pendreigh won Silver.", "In 2010, Malone was again part of Great Britain's Paralympic wheelchair curling team that competed and finished 6th at the Winter Paralympic Games in Vancouver, Canada. The team, also featured Aileen Neilson, Michael McCreadie, Tom Killin and Jim Sellar and was coached by Tom Pendreigh.", "In 2011, Malone was again selected as lead player for Scotland at the World Wheelchair Curling Championship in Prague, Czech Republic. The Scotland team coached by Sheila Swan composed of Aileen Neilson, Tom Killin, Gregor Ewan, Angie Malone and Micheal McKenzie reached the final and won silver."]}, {"page": "Great Britain at the 2014 Winter Paralympics", "response": ["Tom Killin was initially named in the squad, but had to be replaced by Jim Gault just before the start of the competition, as an illness meant doctors advised him not to travel."]}, {"page": "Jim Gault", "response": ["Jim Gault (born 24 April 1954) is a wheelchair curler who competed for Great Britain at the 2014 Winter Paralympics after being called up as a replacement for Tom Killin who pulled out due to illness. This will be his Paralympic debut."]}, {"page": "Ken Dickson", "response": ["| Frank Duffy || Michael McCreadie || Tom Killin || Angie Malone || Ken Dickson || Jane Sanderson ||   ()", "| Frank Duffy || Michael McCreadie || Tom Killin || Angie Malone || Ken Dickson || Tom Pendreigh || WPG 2006  ()"]}, {"page": "Scottish Disability Sports Hall of Fame", "response": ["| Tom Killin"]}, {"page": "James Sellar (curler)", "response": ["| Michael McCreadie || Aileen Neilson ||Tom Killin || James Sellar || Rosemary Lenton || Tom Pendreigh ||  (7th)", "| Michael McCreadie || Aileen Neilson || Tom Killin || James Sellar || Rosemary Lenton || Tom Pendreigh,Sheila Swan|| (5th)", "| Aileen Neilson || Michael McCreadie || Tom Killin || Jim Sellar || Angie Malone ||  || SWhCC 2010 ", "| Gregor Ewan || Jim Gault || Tom Killin || Jim Sellar || || || SWhCC 2015 ", "| Jim Gault || Tom Killin || Gregor Ewan || Jim Sellar || || || SWhCC 2016 ", "| Jim Gault || Tom Killin ||Debbie McKenna || Jim Sellar || || || SWhCC 2017 ", "| Jim Gault || Gregor Ewan || Tom Killin || Jim Sellar || Debbie McKenna ||  || SWhCC 2018 ", "| Michael McCreadie || Aileen Neilson || Tom Killin || Angie Malone || Jim Sellar || Tom Pendreigh ||WPG 2010 (6th)"]}, {"page": "Scottish Wheelchair Curling Championship", "response": ["| 2007 || Tom Killin, Aileen Neilson, Jim Elliott, Rosemary Lenton", "| 2010 || Aileen Neilson, Michael McCreadie, Tom Killin, Jim Sellar, Angie Malone", "| 2011 || Aileen Neilson, Tom Killin, Ian Donaldson, Michael McCreadie", "| 2015 || Gregor Ewan, Jim Gault, Tom Killin, Jim Sellar", "| 2016 || Jim Gault, Tom Killin, Gregor Ewan, Jim Sellar", "| 20172017 Scottish Curling Wheelchair Championship - Scottish Curling || Jim Gault, Tom Killin, Debbie McKenna, Jim Sellar", "| 2018 || Jim Gault, Gregor Ewan, Tom Killin, Jim Sellar, Debbie McKenna"]}, {"page": "James Elliott (curler)", "response": ["| Tom Killin || Aileen Neilson || Jim Elliott || Rosemary Lenton || || || SWhCC 2007 "]}, {"page": "Michael McKenzie (curler)", "response": ["| Aileen Neilson || Tom Killin || Gregor Ewan || Angie Malone || Michael McKenzie || Sheila Swan ||  "]}]}}