{"wiki_id": "http://www.wikidata.org/entity/Q7817262", "itemLabel": "Tom Pope", "itemDescription": "English association football player (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Pope", "wikipedia_page": {"main": "Thomas John Pope (born 27 August 1985) is an English professional footballer who plays as a centre forward for North West Counties League Premier Division side Congleton Town.\nA Crewe Alexandra Academy graduate, he turned professional with the club in 2005 after impressing at non-league side Biddulph Victoria in 2004–05. He was loaned out to Conference North sides Lancaster City and Stafford Rangers in 2005–06, before he spent 2006–07 on loan at Barrow, also of the Conference North. He established himself in the Crewe first team picture in 2007–08, before becoming the club's top scorer in 2008–09 with ten League One goals. He became Rotherham United's joint-record signing when he made a £150,000 move to the Yorkshire club in June 2009. He scored five goals in the 2009–10 campaign, before he was loaned out to Port Vale in January 2011. \nThe loan was made permanent in time for the start of the 2011–12 season. He scored 33 goals and was voted League Two Player of the Year as he helped the club to secure promotion out of League Two in 2012–13. He was voted Port Vale's Player of the Year in 2013 and 2014. He signed with Bury in June 2015, and remained with the club for two seasons before rejoining Port Vale. He claimed the club's Player of the Year award for a record third time in 2018 and the following year he became the second highest goalscorer in the club's history. He scored 115 goals in 343 league and cup appearances before leaving the club in May 2021. He was released at the end of the 2020–21 season and went on to play for Congleton Town.", "link_mentions": [{"page": "Port Vale F.C.", "response": ["Genuine hopes of promotion in 2011–12 were brought to an end after the club was issued with a winding up petition by HM Revenue and Customs on 29 February 2012; the club were by this time unable to pay tax bills, creditors, or staff wages. The club entered administration on 9 March. The club finally exited administration on 20 November 2012, and Tom Pope scored 33 goals to fire Vale to promotion back to League One with a third-place finish. They stabilised in the division under new boss Rob Page, before chairman Norman Smurthwaite orchestrated the departure of Page and his squad in favour of the club's first foreign manager, Bruno Ribeiro, in June 2016. The result was relegation back into League Two at the end of the 2016–17 season, after which Smurthwaite resigned as chairman. He returned to the role the following season and threatened to put the club into administration if a buyer was not found by May 2019, a fate which was avoided when Carol and Kevin Shanahan completed their takeover.", "The record for the most appearances for Port Vale is held by Roy Sproson, who played 842 matches in all competitions. Sproson also holds the record for the most league appearances for the club, with 760. His nephew, Phil Sproson, made 500 appearances in all competitions. Wilf Kirkham is the club's top goalscorer with 164 goals in all competitions, which includes 153 in the league and 11 in the FA Cup. Kirkham's tally of 41 goals in the 1926–27 season is also a club record. Tom Pope and Martin Foyle have also scored more than 100 goals for the club. The first player to be capped at international level while playing for Vale was Teddy Peers, when he made his debut for Wales. The most capped player is Chris Birchall, who earned 27 caps for Trinidad and Tobago while at the club. The first Vale player to score in an international match was Sammy Morgan, who scored for Northern Ireland against Spain on 16 February 1972."]}, {"page": "Pope (disambiguation)", "response": ["*Tom Pope, English association footballer"]}, {"page": "Mat Sadler", "response": ["Sadler joined League Two club Shrewsbury Town on 7 July 2010 on loan for six months. According to manager Graham Turner, the player seemed reluctant initially to play in the fourth tier of English football but was won over by the club's ambition. Sadler made his Shrewsbury Town debut in the opening game of the season, in a 3 – 1 win over Bradford City. In the next game, Sadler played a role for the club when he provided assist for Matt Harrold to score the only goal in the game in a 1–0 win over Macclesfield Town. Since then, Sadler made an impressive display at Shrewsbury Town, having established himself in the first team and expressed interests of extending his loan spell at the club for the remainder of the season. On 6 January 2011 saw Sadler's loan spell at Shrewsbury Town extended until the end of the season. During the match against Port Vale on 8 March 2011, Sadler controversially fouled Tom Pope in a penalty box, leading to a penalty kick converted successfully, which resulted a 2–2 draw. Despite this, Sadler went on to be an ever-present player in the League Two season to play every minute of every game for his club. Sadler played in two matches in the play–offs against Torquay United, but lost 2–0 in the first leg and drew 0–0 in the second leg."]}, {"page": "Martin Foyle", "response": ["During his time at Port Vale, Foyle scored 108 goals, which made him the club's record post-war goalscorer until Tom Pope overtook this tally in 2020. Some of his important goals include a late equaliser in a League Cup tie at Liverpool in 1991, two at Brighton which sealed promotion in 1994, and one in a game at Huddersfield Town in 1998 which saved the club from relegation. In May 2019, he was voted into the \"Ultimate Port Vale XI\" by members of the OneValeFan supporter website."]}, {"page": "Chris Eagles", "response": ["Eagles was a winger, though could also play as an attacking midfielder. Writing for The Guardian in December 2008, Steve Claridge reported that Eagles \"is a natural footballer who makes the difficult things look easy\", boasting natural ability and composure, as well as good distribution skills; he did however criticize his tactical discipline and defensive work-rate. Former Bury teammate Tom Pope said that: his \"technique was frighteningly good – that was his ability on the ball, dribbling and his awareness of players around him\"."]}, {"page": "Lee Hughes", "response": ["Hughes joined Port Vale the day after securing his exit from Notts County, as the BBC reported that \"promotion-chasing boss Micky Adams wants to bring him in to add impetus to a Vale attack who have occasionally misfired this term\". He signed a contract to keep him at Vale Park until the end of the 2012–13 season, at which point his contract would be extended by 12 months if the \"Valiants\" were promoted. However Hughes later revealed that Adams was against the transfer but had been overruled by chairman Norman Smurthwaite. He marked his debut against the \"Gills\" with the winning goal that sent Vale to the top of the table. Being partnered with the country's leading goalscorer Tom Pope allowed Hughes space in front of goal vacated by opposition defenders attempting to double up on Pope. Hughes scored his first hat-trick for the \"Valiants\" in a 7–1 home victory over Burton Albion on 5 April, with two of his goals coming from the penalty spot as he took over from Jennison Myrie-Williams as the club's penalty taker. This performance won him a place on the League Two team of the week. Vale were promoted at the end of the season, with Hughes scoring ten goals in his 18 games, ensuring his contract was extended until summer 2014."]}, {"page": "Steve Guppy", "response": ["Port Vale player and lifelong fan Tom Pope described Guppy as \"a very tricky winger, one who could go on the inside or the outside\", and a player with good crossing ability. In May 2019, he was voted into the \"Ultimate Port Vale XI\" by members of the OneValeFan supporter website."]}, {"page": "Jim Gannon", "response": ["In January 2011, Gannon was one of three candidates reported to have impressed in interviews for the vacant Port Vale job, making him one of the favourites for the position. However, Paul Simpson's dismissal at Stockport County led to hopes of a return to the club for some County fans. Therefore, he was installed as the bookies favourite to become the next Port Vale manager, and also the bookie's favourite for the Stockport job. Gannon was confirmed as the manager of Port Vale on 6 January 2011, succeeding Micky Adams at the helm of the promotion chasing club, signing a contract that lasted until summer 2012. Saying that finishing outside of the top seven would be a failure, the Cheshire-based manager's first task after 'burying the hatchet' with Gareth Owen was to look for a new striker. Two weeks into his reign club captain Tommy Fraser left the club by mutual consent, as signs of what would be an unhappy relationship between club and manager quickly came to the surface. Gannon then brought in Romaine Sawyers and Kayleden Brown on loan from West Bromwich Albion, Jay O'Shea on loan from Birmingham City, Exodus Geohaghon on loan from Peterborough United, and striker Tom Pope on loan from Rotherham United.", "Results continued to go against the Vale though, as on 19 March they lost 3–0 at Accrington Stanley, and as a result dropped out of the play-off zone for the first time in the season. Ugly post-match scenes at the Crown Ground saw Geohaghon confront fans who singled him out for abuse, whilst Gannon was ushered quietly out of the back door. Roberts told the media \"I don't think the manager likes me and, to be honest, I don't like him\". Rumours circulated that Gannon would soon be on his way out. These rumours were proved accurate two days later, as Gannon's departure was confirmed by the club. Hugely unpopular with Vale supporters, his sacking was \"quick and with little emotion\", whilst his poor man-management skills helped to earn him the dubious honour of having the shortest reign in the club's history. Despite this he did receive credit for spotting the potential talent in a teenage Sam Morsy, and for bringing Tom Pope to the club. Gannon himself made a statement on his website declaring his disappointment in the club's decision to terminate his contract after such a short period of time, and also bemoaned that he \"wasn't able to add many new players [to the squad]\". The \"Valiants\" continued to struggle under caretaker manager Mark Grew, winning just two of their remaining ten games, and finishing 2010–11 in eleventh place."]}, {"page": "Micky Adams", "response": ["After losing his job at Bramall Lane, he was immediately offered a three-year contract at former club Port Vale. He signed the contract within days, saying it was time to \"finish the job I started\". Upon hearing the news, star defender Gareth Owen reversed his decision to leave the club, and promptly signed a two-year deal as player-coach. In a shock move Adams announced that he intended to take up a directorship at the club as the club's constitution stipulated that a minimum of four directors were needed before any playing contracts could be completed. His first signings of the season were former Glenn Hoddle Academy youngsters Ryan Burge and Ben Williamson. He followed this by tying Gary Roberts to the club for another season, and signing Walsall centre-half Clayton McDonald, left-back Mike Green, and Sheffield United teenagers Kingsley James and Phil Roe. Days before the start of the season he let Justin Richards leave on a free transfer to Burton Albion, and replaced him with Rotherham United striker Tom Pope, also a free transfer signing. After his team started the campaign with a glut of goals – both scoring and conceding – Adams decided to give his players \"a kick up the backside\" by signing experienced defenders Liam Chilvers (on loan) and Rob Kozluk. He stepped down as a director on 5 November, the day of his 100th game in charge at Port Vale, after former director Stan Meigh withdrew the £50,000 sponsorship he had provided to keep Adams on the board of directors.", "With the club still unable to sign new players due to administration in May 2012, Adams offered contracts to 16 of his players for the 2012–13 campaign. However, he lost four of his best players in Lee Collins, Anthony Griffith, Sean Rigg, and captain and top-scorer Marc Richards; all of whom signed big money contracts elsewhere, leaving Adams needing to rebuild the team largely from scratch. He duly signed midfielder Darren Murphy and winger Jennison Myrie-Williams from Stevenage, Colchester United attacker Ashley Vincent, Shrewsbury Town goalkeeper Chris Neal, Crewe Alexandra centre-back David Artell, and former Wales international Richard Duffy. He was named as Manager of the Month in September 2012, after his side beat Tranmere Rovers in the League Trophy and claimed 13 of a possible 18 points in the league to take the administration-hit club to second in the league. New owners took the club out of administration and allowed Adams to strengthen his squad in January by signing four experienced players: striker Lee Hughes, midfielder Chris Birchall, and centre-back Darren Purse. Other signings included left-back Daniel Jones, centre-back Liam Chilvers, striker Calvin Andrew, and midfielder Sean McAllister. However Vale slipped to five defeats in seven games, and Adams claimed that \"idiots\" in a \"certain section of the crowd\" were giving him \"personal\" abuse following the run of bad results and his decision to drop fan favourite Ryan Burge for disciplinary reasons. Vale managed to turn their form around and secure automatic promotion, finishing as the division's top-scorers as wingers Jennison Myrie-Williams and Ashley Vincent provided quality service to prolific striker Tom Pope throughout the campaign."]}, {"page": "Michael Brown (footballer, born 1977)", "response": ["Despite being relegated, Brown was confirmed as the club's permanent manager in May 2017. He released 13 players at the end of the 2016–17 season. His first summer signing was former two-time Player of the Year Tom Pope on a free transfer after he managed to secure his release from Bury. He went on to sign ten more players during the window: goalkeepers Rob Lainton and Sam Hornby, defenders Joe Davis, Antony Kay, Gavin Gunning, Lawrie Wilson and Graham Kelly, midfielders Michael Tonge, Cristian Montaño, David Worrall and Harry Middleton, and striker Tyrone Barnett; he also signed youngsters Rekeil Pyke, Marcus Harness, Tyler Denton, Ben Whitfield, Jack Stobbs and Tom Anderson on loan. However Vale suffered their worst start to a season in 50 years at the beginning of the 2017–18 season, going a club record six games without scoring a goal as they sat bottom of the table in September following six consecutive league defeats. He was sacked on 16 September following a 1–1 home draw with second-from-bottom Forest Green Rovers. Speaking after his sacking, Brown said that it had been difficult for him to recruit quality players on \"a very tight budget... I think it was arguably £1m under from when they had got promoted from that league the time previously\". Supporter website OneValeFan described this as \"a somewhat unlikely claim\" as the club had only exited administration in November 2012."]}, {"page": "Danny Pugh", "response": ["On 18 September 2018, Pugh took on extra coaching duties at Port Vale following the departure of coach Gary Brabin. Neil Aspin resigned on 30 January 2019, and Pugh stepped in to serve as caretaker-manager. John Askey was appointed as manager on 4 February, before Pugh had the chance to take charge of any first-team games. Pugh became a full-time coach upon the expiry of his playing contract at the end of the season, though did take the #14 shirt and sat on the bench following a midfield injury crisis in September 2019. Pugh again became caretaker-manager following Askey's departure on 4 January 2021. Five days later he oversaw a 3–0 home win over Grimsby Town in his first game in management. On 18 January, he began self-isolating after testing positive for COVID-19. Club chairperson Carol Shanahan said that Pugh had been unlucky during his time in charge, missing Tom Pope and Devante Rodney to injury and having to self-isolate at home for two games, and she confirmed that Pugh had not applied for the role on a permanent basis. He returned to the touchline in time to oversee a 5–1 victory over bottom-club Southend United. He reverted to his original coaching role once Darrell Clarke was appointed manager on 15 February. On 10 May 2021, Port Vale announced Pugh had left the club. "]}, {"page": "Carl Dickinson", "response": ["He was appointed as club captain in August 2014, taking the armband from the departed Doug Loft. He scored his first goal for the \"Valiants\" and only his fourth career goal in a 3–1 victory at Doncaster Rovers on 16 August, earning himself a mention on the Football League team of the week in the process. However, he was dropped from the starting line-up two months later after admitting \"I haven't been good enough for the standards I set myself every day\". After returning to the first team he stated that a talk with manager Rob Page helped him to calm down as he had put \"a bit too much pressure\" on himself after taking over the captaincy. He remained in poor form however, but said the criticism from the fans did not affect him after providing the assist for Tom Pope in the win against nearby rivals Walsall on 14 February."]}, {"page": "Michael O'Connor (footballer, born 1987)", "response": ["Speaking in July 2014, Crewe Alexandra and Port Vale teammate Tom Pope described O'Connor as \"[having] everything. He's got the range of passing, he sits in there and gets the ball moving and he gets stuck in. He whips a great ball in, has great free kicks and a lot of quality.\" He describes himself as a \"passionate\" player, though this has resulted in a number of yellow cards for dissent. Port Vale assistant manager Paul Bodin also praised O'Connor's set piece delivery and energy levels."]}, {"page": "Theo Robinson", "response": ["On 24 August 2020, Robinson rejoined Port Vale on a two-year deal, where he faced competition from Tom Pope, Mark Cullen and Devante Rodney for a place in the starting eleven. He stated that \"when I was here before it wasn’t really a good time personally but now I am here to put things right\". It was reported that Grimsby manager Ian Holloway had tried to sign him but lost out due to his club insisting on a clause to reduce pay if the league was postponed or cancelled again due to a second wave of Coronavirus disease 2019 cases; Vale reportedly had no such clause in their contract offer. On 5 September, he scored on his second debut for the Vale, coming on as a substitute to score a late winner in a 2–1 victory over Scunthorpe United in the first round of the EFL Cup, manager John Askey said that \"It's nice when you have someone like Theo who can come on and has goals in him\". Robinson set a personal target of 10 goals for the campaign but said the main aim was promotion. Having started the 2020–21 season on the bench, he claimed a place in the starting eleven by mid-October after becoming the club's leading scorer. He soon dropped out of the starting eleven however and was transfer-listed in December. Caretaker-manager Danny Pugh deregistered Robinson from the club's 22-man squad the following month in order to make room for new signing Kurtis Guthrie. He was re-registered at the end of the January transfer window and went on to earn praise for his work-rate from new manager Darrell Clarke but was still transfer-listed in May 2021. He left the club by mutual consent on 31 August 2021."]}, {"page": "Neil Aspin", "response": ["On 4 October 2017, Aspin was appointed as manager of former club Port Vale, who were 22nd in League Two after a poor start to the 2017–18 season; his former manager John Rudge also returned to the club in an advisory role. Aspin said that his new squad was too big with 33 senior professionals at the club, and added that he would try to find a formation to suit the players at his disposal and that he wanted the team to push further forward to support target-man striker Tom Pope. He picked up his first win as Vale manager on 14 October, with Pope scoring a brace in a 3–1 home win over Cheltenham Town. Seven days later, Aspin was named as manager of the week after his side won 1–0 away at Exeter City. He went on to be nominated for the League Two Manager of the Month award after three wins in five games and five goals in the month of October. He signed a new two-and-a-half year contract with the club in December 2017. He was also nominated for that month's Manager of the Month award after collecting 13 points from Vale's five matches, including a 4–0 victory over league leaders Luton Town and a 1–0 win over promotion chasing Coventry City; however the award instead went to Danny Cowley at Lincoln City."]}, {"page": "Gavin Tomlin", "response": ["He signed with newly promoted League One club Port Vale in June 2013. Upon joining the club he stated that he was expecting to play as a striker, rather than as a utility forward, though he admitted he faced a challenge in dislodging either of free-scoring duo Tom Pope and Lee Hughes. He was dropped from the starting line-up after failing to find the net in his first few games, and then spent a month out injured with ankle, hamstring and toe troubles. He returned to action in December, and scored in four consecutive games. He finished the 2013–14 campaign with six goals in only 27 appearances; in the summer Southend United manager Phil Brown confirmed that he was attempting to re-sign Tomlin. Tomlin decided to move back to his native London, and determined on a move South from the Midlands."]}, {"page": "Louis Dodds", "response": ["Desperate to play as a striker in the 2012–13 season, he got his wish as he was played as a deep-lying striker in partnership with Tom Pope. Combined with wingers Jennison Myrie-Williams and Ashley Vincent, the four-man strike force fired Vale into second place in the league over the first quarter of the campaign. On 18 September, he converted a \"stunning strike with the outside of his foot\" in a 5–2 victory over Fleetwood Town at Highbury Stadium – later this was voted the club's goal of the season. However, he lost his first team place, before \"a heart-to-heart with boss Micky Adams... got him back on track\", and on 15 December he marked his first start for a month with his first goal in three months – it proved to be a crucial goal against promotion rivals Cheltenham Town in a 1–1 draw at Whaddon Road. Vale secured promotion with a third-place finish at the end of the season, with Dodds finishing on seven goals in 36 games. He agreed to sign a new two-year contract in the summer."]}, {"page": "Marc Richards", "response": ["An accomplished set piece taker, he is also a goalscorer from open play and can also hold the ball up well for his teammates. In five years at Port Vale he scored 15 of his 20 penalties, a success rate of 75%. Former Port Vale teammate Tom Pope described him as a \"natural goalscorer\"."]}]}}