{"wiki_id": "http://www.wikidata.org/entity/Q7818001", "itemLabel": "Tom Watson", "itemDescription": "English footballer (1870–1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Watson_(footballer,_born_1870)", "wikipedia_page": {"main": "Thomas Watson (1870 – April 1902) was an English footballer who played in the Football League for Small Heath as a goalkeeper.Watson was born in the Yardley Wood district of Birmingham. He grew up to be an all-round athlete, and was actively involved in organising local athletics meetings. He played for Small Heath as an amateur, making two appearances in the First Division in the 1894–95 season. Watson's debut came on 2 March 1895, deputising for regular goalkeeper Charles Partridge in a home game against Blackburn Rovers which finished as a 1–1 draw. In the next, and his last, game Small Heath conceded five goals to Derby County.Watson joined Birmingham City Police in 1895, rising to the rank of sergeant, played for their football team, and often used to police Small Heath's matches. He died in Birmingham in 1902.", "link_mentions": [{"page": "Thomas Watson", "response": ["*Tom Watson (journalist) (born 1962), journalist and author", "*Tom Watson (golfer) (born 1949), American golfer", "*Tom Watson (footballer, born 1870) (1870–1902), English football goalkeeper for Small Heath", "*Tom Watson (footballer, born 1904), footballer for Rochdale", "*Tom Watson (footballer, born 1900) (1900–1978), Ireland international football player", "*Tom Watson (football manager) (1859–1915), English football manager", "*Tom Watson (Australian footballer) (1874–1920), Australian rules footballer", "*Tom Watson (fighter) (born 1982), mixed martial artist", "*Tom Watson (Labour politician) (born 1967), British politician; former Deputy Leader of the Labour Party; and former MP for West Bromwich East", "*Tom Watson (actor) (1932–2001), Scottish-born stage, television and film actor", "* Tom Watson (musician) (born 1962), American guitarist"]}, {"page": "1894–95 Small Heath F.C. season", "response": ["Reserve Tom Watson replaced Partridge in goal and Hallam returned to the forward line for the second round of the Birmingham Cup, at home to Wolverhampton Wanderers. Wheldon scored with two minutes left to take the lead, but the Wanderers still had time to tie the scores at 3–3. After consulting both captains, the referee ordered half-an-hour's extra time, but Wanderers, whose players had already returned to the dressing-rooms, refused to play, so Jenkyns claimed the game for Small Heath."]}, {"page": "Tom Watson (footballer born 1870)", "response": ["#REDIRECT Tom Watson (footballer, born 1870)"]}]}}