{"wiki_id": "http://www.wikidata.org/entity/Q7816905", "itemLabel": "Tom Mitchell", "itemDescription": "English association football player and manager (1899-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Mitchell_(English_footballer)", "wikipedia_page": {"main": "Thomas Morris Mitchell (30 September 1899 – 22 November 1984) was an English professional footballer and manager.", "link_mentions": [{"page": "York City F.C.", "response": ["Bootham Crescent was renovated over the summer of 1932; the Main and Popular Stands were built and terraces were banked up behind the goals. The ground was officially opened on 31 August 1932, for York's 2–2 draw with Stockport County in the Third Division North. It was played before 8,106 supporters, and York's Tom Mitchell scored the first goal at the ground. There were teething problems in Bootham Crescent's early years: attendances were not higher than at Fulfordgate in its first four seasons, and there were questions over the quality of the pitch. In March 1938 the ground's record attendance was set when 28,123 people watched York play Huddersfield Town in the FA Cup. The ground endured slight damage during the Second World War, when bombs were dropped on houses along the Shipton Street End. Improvements were made shortly after the war ended, including the concreting of the banking at the Grosvenor Road End being completed."]}, {"page": "Bootham Crescent", "response": ["The ground was officially opened on 31 August 1932, when York played Stockport County in a Third Division North match. The club president, Sir John Hunt, marked the occasion by cutting a ribbon of the club's colours of chocolate and cream. In attendance were the Lord Mayor of York, the Sheriff of York, the vice-president of the Football League, the treasurer of the Football Association (FA) and the local Member of Parliament. York player Tom Mitchell scored the first goal at the ground in a 2–2 draw, played before 8,106 supporters. In the first four seasons at Bootham Crescent, attendances were not higher, and were sometimes lower than at Fulfordgate. There were problems with the ground in its early years; the quality of the pitch was questioned, and the Lincolnshire Echo remarked in April 1937 that the pitch was \"almost a morass, with extensive pools of water in front of the goals\". There was an incident in March 1934 where the referee and linesmen were found unconscious in their dressing room, due to fumes from a faulty heater."]}, {"page": "Thomas Mitchell", "response": ["Thomas or Tom Mitchell may refer to:", "* Tom Mitchell (Australian politician) (1906–1984), Australian politician, author and skier", "* Tom Mitchell (Irish politician) (1931–2020), Irish republican", "* Tom Mitchell (English footballer) (1899–1984), English footballer and manager", "* Tom Mitchell (American football) (1944–2017), American football player", "* Tom Mitchell (rugby union, born 1989), English rugby union player, captain of England national rugby sevens team", "* Tom Mitchell (rugby union, born 1958), Fijian rugby union player", "* Tom Mitchell (Australian footballer) (born 1993), Australian rules football player"]}, {"page": "List of York City F.C. managers", "response": ["York City went without an official manager from their formation in May 1922 until the appointment of Jock Collier in July 1928. Collier initially joined as player-manager, but was forced to retire from playing due to a broken ankle after two matches. He was in charge for York's last season in the Midland League before their election to the Football League in June 1929. Collier oversaw the club's successful transition from non-League football to the Third Division North, but left the club in May 1930 to become a publican. Billy Sherrington combined his duties as club secretary with that of manager for the next three years, before Collier was reappointed manager in May 1933. With results at a low ebb, he helped York establish themselves in the Football League, and led them to the fourth round of the 1936–37 FA Cup. In March 1937, Collier retired from football to go into business with his brother. Former player Tom Mitchell was appointed, and in his first full season led York to the quarter-final of the 1937–38 FA Cup."]}, {"page": "List of York City F.C. records and statistics", "response": ["*Longest serving manager by time: Tom Mitchell managed the club for 12 years and 11 months, which included 270 matches, from March 1937 to February 1950."]}, {"page": "History of York City F.C. (1908–1980)", "response": ["York's first match in the Football League was against Wigan Borough at Springfield Park on 31 August 1929 and finished with a 2–0 victory for the visitors. Reg Stockill, the scorer of the first goal, became the youngest player to represent the club in a competitive match at the age of 15 years and 281 days. The 1929–30 season brought two meetings with First Division team Newcastle United in the FA Cup third round, and a sixth-place finish in York's debut Football League season. Collier resigned as manager in May 1930 and Billy Sherrington took over for the following three years, combining this with his role as club secretary. Sherrington's first season in charge saw York rank 12th in the league, and they again faced First Division opposition in the FA Cup third round, taking Sheffield United to a replay. Despite an improved league position of ninth in 1931–32, York were eliminated from the FA Cup in the first round. This, combined with disappointing average home crowds, resulted in a deficit of £1,539 over the season. In August 1932, York moved to a new ground at Bootham Crescent, which was closer than Fulfordgate to the club's centre of support and the railway station. The ground was officially opened for a match with Stockport County on 31 August 1932; it ended a 2–2 draw, and the first goalscorer at the ground was Tom Mitchell. York's worst performance in the Football League to date came in 1932–33, finishing in 20th place. The club only avoided having to seek re-election after winning the last match of the season.", "Collier was re-appointed manager in May 1933, and York enjoyed a better season in 1933–34, finishing 12th in the Third Division North. The club finished in 15th place in 1934–35, and Bootham Crescent staged its first match against First Division opposition when Derby County defeated York 1–0 in the FA Cup third round. In 1935–36, York ranked in 16th place, and by the end of the season the club's debt was £7,048. The annual report stated that \"increased support must be forthcoming if the club was to retain its Football League status\". The team reached the FA Cup fourth round for the first time in 1936–37, being eliminated by Second Division team Swansea Town in a replay. Collier retired from football in March 1937 to go into business with his brother, and was replaced by Tom Mitchell. The team finished an inconsistent season in 12th place. The 1937–38 season saw York placed \"firmly on the football map\", as the team eliminated First Division teams West Bromwich Albion and Middlesbrough from the FA Cup, before meeting Huddersfield Town in the sixth round. This match saw York draw 0–0 at home before a crowd of 28,123, the club's record highest attendance. York lost the replay 2–1 at Leeds Road, a match that attracted 58,066 spectators. By the end of that season's FA Cup run, York were on the fringe of the promotion race, but faltered in the closing weeks and finished in 11th place. The club avoided having to apply for re-election with a win in the penultimate match of 1938–39, ranking 20th in the table. W. H. Sessions was appointed chairman to succeed Brown in 1939."]}, {"page": "Tom Mitchell (football manager)", "response": ["#REDIRECT Tom Mitchell (English footballer)"]}, {"page": "List of York City F.C. players (1–24 appearances)", "response": ["As of the date specified above, more than 500 players had completed their York career before reaching the 25-match milestone. Many of these players spent only a short period of their careers at York before seeking opportunities in other teams. Players who have gone on to experience football in the English top tier include Chris Iwelumo, when playing for Wolverhampton Wanderers, and Neil Warnock, when managing Notts County, Sheffield United, Queens Park Rangers and Crystal Palace. At international level, Iwelumo went on to represent Scotland and Leo Bertos became the first former York player to represent his country at a FIFA World Cup when appearing for New Zealand at the 2010 tournament. Four players with under 25 appearances went on to manage the club; these were Jock Collier, Tom Mitchell, Viv Busby and Steve Torpey.", "As of the date above, 12 players have left the club with 24 career appearances; Bobby Warrender, Fred Marlow, Brad Halliday, Bradley Fewster, Tom Mitchell, John Hammerton, Liam George, Jamie Price, Nick Pope, Richard Tindale, Phil Taylor and Byron Webster. The list includes 14 players who are still contracted to the club, and so can add to their totals."]}]}}