{"wiki_id": "http://www.wikidata.org/entity/Q7815550", "itemLabel": "Tom De La Hunty", "itemDescription": "British bobsledder", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_De_La_Hunty", "wikipedia_page": {"main": "Thomas De La Hunty (born 4 July 1956) is a British former bobsledder and bobsleigh coach.\nDe La Hunty started bobsledding after joining the Royal Air Force in 1978. He started his bobsledding career in 1980, going on to be RAF Champion for 13 years and competing for the British national team from 1980 to 1991. He also competed in the 1984 and 1988 Winter Olympics, earning his best finish of 12th in the two-man event at Calgary in 1988.\nAfter retiring from competition in 1991, he became a coach, initially for the British bobsleigh team, serving as Assistant Ice Coach in the 1992, 1994 and 1998 Winter Olympics and as Head Coach at the 2006 Games in Turin. De La Hunty was also coach of the Dutch team at the 2002 Winter Olympics in Salt Lake City and the 2010 Winter Olympics in Vancouver. In June 2010, De La Hunty was named as coach of the Canadian bobsleigh team, a position which he held until 2016. During that time he guided Kaillie Humphries to her second Olympic gold at the 2014 Games in Sochi, two consecutive World Championships in 2012 and 2013 and three overall Bobsleigh World Cup titles in 2012-13, 2013-14 and 2015-16. In July 2017 he was announced as the head coach of the Dutch Bobsleigh Federation.", "link_mentions": [{"page": "Great Britain at the 1984 Winter Olympics", "response": ["|Tom De La HuntyPeter Lund"]}, {"page": "Great Britain at the 1988 Winter Olympics", "response": ["|Tom De La HuntyAlec Leonce", "|Tom De La HuntyColin RattiganGeorge RobertsonAlec Leonce"]}, {"page": "Delahunty", "response": ["* Tom De La Hunty (born 1956), British bobsledder"]}, {"page": "Bobsleigh at the 1984 Winter Olympics – Two-man", "response": ["| 21 || align=\"left\"|  || align=\"left\"| Tom De La Hunty  Peter Lund|| 53.17 || 53.34 || 53.53 || 53.09 || 3:33.13"]}, {"page": "Bobsleigh at the 1988 Winter Olympics – Two-man", "response": ["| 12 ||align=left|  || align=left|  Tom De La Hunty  Alec Leonce || 57.83 || 59.77 || 60.91 || 59.50 || 3:58.01"]}, {"page": "Bobsleigh at the 1988 Winter Olympics – Four-man", "response": ["| 17 ||align=left|  || align=left|  Tom De La Hunty  Colin Rattigan  George Robertson  Alec Leonce || 57.81 || 58.13 || 56.74 || 58.59 || 3:51.27"]}]}}