{"wiki_id": "http://www.wikidata.org/entity/Q7811795", "itemLabel": "Toby Garbett", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Toby_Garbett", "wikipedia_page": {"main": "Toby Garbett (born 14 November 1976 in Chertsey) is a British rower.", "link_mentions": [{"page": "Ed Coode", "response": ["In 2001, he won a second World Championship in the men's coxless four with Steve Williams, Rick Dunn and Toby Garbett. In 2002, he missed the World Championships due to injury, Josh West taking his place in the coxless four, and was in the men's eight in 2003 that won the bronze at that year's world championships.", "*2001 – Gold, Coxless four (with Steve Williams, Rick Dunn, Toby Garbett)"]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Rick DunnToby Garbett"]}, {"page": "Steve Williams (rower)", "response": ["* 2003 – Silver, Coxless Four (with Josh West, Rick Dunn and Toby Garbett)", "* 2002 – Silver, Coxless Four (with Josh West, Rick Dunn and Toby Garbett)", "* 2001 – Gold, Coxless Four (with Ed Coode, Rick Dunn and Toby Garbett)", "* 2000 – Gold, Coxed Four (with Alistair Potts, Rick Dunn, Toby Garbett and Graham Smith)"]}, {"page": "Rowing at the 2004 Summer Olympics – Men's coxless pair", "response": ["#: Toby Garbett, Rick Dunn, 6:58.95 -> SF", "#20px| Great Britain (Toby Garbett, Rick Dunn) 6:25.06 FB", "#20px| Great Britain (Toby Garbett, Rick Dunn) 6:22.04"]}, {"page": "Toby", "response": ["* Toby Garbett (born 1976), British rower"]}, {"page": "Garbett", "response": ["*Toby Garbett (born 1976), British rower"]}, {"page": "Alistair Potts", "response": ["Potts won a silver medal at the 1999 World Championships at St. Catharines, Canada in the coxed four with Jonny Searle, Jonny Singfield, Rick Dunn and Graham Smith. Gold came in 2000 at Zagreb in the same boat class with Dunn, Smith and Toby Garbett and Steve Williams. This was the first time Great Britain had won the coxed four at the World Rowing Championships since its inception. That same crew also won the Prince Philip Challenge Cup at Henley.", "*2000 – Gold, Coxed Four (with Steve Williams, Rick Dunn, Toby Garbett, Graham Smith)"]}, {"page": "2003 World Rowing Championships", "response": ["|   Steve Williams Josh West Toby Garbett  Rick Dunn  || 5:53.54"]}]}}