{"wiki_id": "http://www.wikidata.org/entity/Q7819263", "itemLabel": "Tommy Bruce", "itemDescription": "British singer (1937-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Bruce", "wikipedia_page": {"main": "Tommy Bruce (16 July 1937 – 10 July 2006) was an English rock and roll singer who had most of his success in the early 1960s. His cover version of \"Ain't Misbehavin'\" was a number 3 hit in the UK Singles Chart in 1960.", "link_mentions": [{"page": "Lavender's Blue", "response": ["\"Lavender's Blue\" continued to be recorded by pop artists throughout the rest of the 20th century. Jazz pianist Jack Pleis recorded Lavender's Blue for his 1955 album Music from Disneyland. Tommy Bruce made a single of it in 1963, and The Fleetwoods recorded a version in 1965. In 1975, the song was interpreted by Leon Russell and Mary Russell for their Wedding Album, and the next year the British early music revival group The City Waites recorded the original 17th-century bawdy broadside version of \"Lavender's Green, Lavender's Blue\" on their album Pills to Purge Melancholy.Discogs In 1988, Broadway singer Barbara Cook recorded a version for her release The Disney Album. In 1991, The Wiggles included this song on their albums The Wiggles and Pop Go The Wiggles."]}, {"page": "Barry Mason", "response": ["Mason credits his start in songwriting to his first hit in 1960 as a producer. \"I met this boy called Tommy Bruce and I spent my last few pounds making a demo of him singing an old Fats Waller song, Ain't Misbehavin' – and he had a hit (No.3, UK, 1960). Suddenly, I was his manager, not knowing anything about the business. But the important thing was, I was in the business.\" Mason and Reed wrote a song for Kathy Kirby, \"I'll Try Not to Cry\", as part of A Song for Europe 1965, the BBC's contest to choose the United Kingdom entry for that year's Eurovision Song Contest in Naples. The song was beaten by \"I Belong\". \"The Last Waltz\" became a million-selling UK number one for  Humperdinck in September 1967. In 1968, the duo scored another UK number 1 hit with Des O'Connor's recording of \"I Pretend\". Mason and Reed also wrote \"Who's Doctor Who\", a novelty song recorded by Doctor Who star Frazer Hines in 1967, but it failed to chart. They also wrote \"Marching on Together\" (aka \"Leeds! Leeds! Leeds!\"), the anthem of Leeds United F.C.. His last chart topping song was \"Love Grows (Where My Rosemary Goes), for session group,  Edison Lighthouse, in January 1970."]}, {"page": "Deaths in July 2006", "response": ["*Tommy Bruce, 68, British singer (\"Ain't Misbehavin'\")."]}, {"page": "2006 in the United Kingdom", "response": ["* 10 July – Tommy Bruce, singer (\"Ain't Misbehavin'\") (born 1937)"]}, {"page": "Larry Parnes", "response": ["After Steele's success, Parnes looked to find other young men who he could groom to become pop stars. At Bart's suggestion, he next signed Reg Patterson (né Smith), whom he re-christened Marty Wilde, and who also rose to pop stardom in the UK.  Parnes developed a network of contacts within the British recording industry and entertainment business, with leading British songwriters providing songs for his growing stable of talent, and many of his protégés achieving success in the UK Singles Chart.  A flamboyant gay man, Parnes' approach was to select, and then groom, handsome young men who would be attractive to a teenage audience. He also gave them new stage names, which were rumoured to reflect what he considered to be their sexual characteristics.  Among those he managed with at least some degree of success were Billy Fury (originally Ron Wycherley), Vince Eager (Roy Taylor), Dickie Pride (Richard Knellar), Lance Fortune (Chris Morris), Duffy Power (Ray Howard), Johnny Gentle (John Askew), Terry Dene (Terence Williams), Nelson Keene (Malcolm Holland), and Georgie Fame (Clive Powell).  He also managed Tommy Bruce, as well as Joe Brown, who he unsuccessfully tried to persuade to change his name to Elmer Twitch."]}, {"page": "1937 in the United Kingdom", "response": ["**Tommy Bruce, singer (died 2006)"]}, {"page": "Daniel Boone (singer)", "response": ["Peter Green (later to become Peter Lee Stirling) started his career as the guitarist and vocalist with a band called the Beachcombers that played gigs in the Birmingham area during the period from 1958 to 1962. Their fortunes changed when they encountered Tommy Bruce, who had a number 3 hit in 1960 with \"Ain't Misbehavin'\". This, and some subsequent releases, had been attributed to 'Tommy Bruce and the Bruisers', despite the fact that the instrumental backings were provided by session musicians at EMI. Bruce's account of the meeting was as follows:", "\"I met them up in Birmingham. They were working at the Plaza club. I was gigging there. They were great. Vocal, backing, the lot. Especially Pete (Peter Green) on lead guitar. He was magnificent. I said ‘how would you like to become The Bruisers?’ They jumped in and loved it. Peter “Mac” McGinty was on bass (born Peter Julian McGinty, 16 August 1941, Birmingham, Warwickshire), Donald McGinty was on drums (born 23 June 1946, Birmingham, Warwickshire), Bobby Coral, (born John Ship, 1 September 1940, Birmingham, Warwickshire), was on backing vocals with Pete Green\".Sleeve notes by Kieron Tyler for the retrospective album That's Rock 'n' Roll by Tommy Bruce and the Bruisers RPM 241 2002", "\"The first person I wrote with was Peter Lee Stirling, who later became Daniel Boone and was originally Peter Green. He was with a group called The Beachcombers, who became The Bruisers, who backed Tommy Bruce! And my first chart thing ever was a thing called \"Blue Girl\" for The Bruisers, which I wrote with Peter\"."]}, {"page": "Ain't Misbehavin' (song)", "response": ["In 1960, Tommy Bruce and the Bruisers had a number 3 hit in the UK Singles Chart with their cover version of the song. "]}, {"page": "The Echoes (English group)", "response": ["In January 1962, the Echoes undertook a two-day concert tour with The Temperance Seven, Shane Fenton and the Fentones, Vince Eager, Michael Cox, Johnny Gentle, and Nero & the Gladiators. Another concert followed in February with Johnny Kidd & the Pirates. In April, a national concert tour started with The Temperance Seven, Chas McDevitt and Shirley Douglas and Bert Weedon, and this led to a concert tour starting on 29 April with Jerry Lee Lewis, Johnny Kidd & the Pirates, The Viscounts, Vince Eager, Mark Eden, Danny Storm, Buddy Britten and Dave Reid. Before the final show at the Tower Ballroom, New Brighton, Laurie Jay announced his departure. A drummer was needed that night, and they recruited Ringo Starr, who had just returned from Hamburg after playing for Rory Storm and The Hurricanes. Jay went into management, later becoming the manager for Billy Ocean and Shirley Bassey. On returning to London, Tommy Frost became The Echoes' new drummer. After this tour Hines also left for Hamburg again, and was replaced by Ray Murray on keyboards. By May 1962, the Echoes line up became Dave Burns (guitar), Tommy Frost (drums), Ray Murray (keyboards), and Douggie Reece (bass). The Echoes performed a summer season in Douglas, Isle of Man in the \"Star Parade of 1962\", a rock and roll concert at The Crescent Pavilion. During the day they were required to play at The Palace Ballroom, playing relief for Ronnie Aldrich and The Squadronaires during the band's breaks. With the completion of the summer season, the Echoes returned to London and a meeting had been arranged with Mike Collier, who had just returned to England, after several years working in the music industry in America. He wanted to put together a team for his company, Micol Productions, and wanted the Echoes to be the rhythm section for his productions. Together with the arranger, Al Saxon, they began their association with Micol Productions. This led to the release on their first of four singles \"Sounds Like Winter\" in November 1961 on the Fontana. Other records for Micol Productions were released on Decca, Columbia and Fontana. The Echoes had already played at The Cavern Club in Liverpool, but on 3 September, they performed on the same bill as The Beatles. The year ended with a tour this time with B. Bumble and the Stingers, Bert Weedon, Johnny Kidd & the Pirates, Tommy Bruce, Michael Cox and Vince Eager. Other concerts to see out the year were with Adam Faith, Gene Vincent, Joe Brown and The Tornados."]}, {"page": "Saturday Club (BBC Radio)", "response": ["By August 1959 Saturday Club had a regular audience of five million listeners, including many children, as the programme immediately followed Children's Favourites. It soon began featuring performances from touring American artists including Eddie Cochran, Gene Vincent, Duane Eddy and Bobby Darin, after a Musicians' Union ban on performances by non-British musicians ended. Other American performers followed, including the Everly Brothers, Jerry Lee Lewis, Bo Diddley, Chris Montez and Tommy Roe. In 1960, an LP, Saturday Club, was issued, on the Parlophone label, featuring 13 performers including Tommy Bruce, Ricky Valance, Keith Kelly, Bert Weedon and the King Brothers."]}, {"page": "Two Left Feet (film)", "response": ["Tommy Bruce sang \"Two Left Feet\" to the opening credits of the film. It also featured the song \"Where Were You When I Needed You?\" by Susan Maughan."]}, {"page": "List of UK top-ten singles in 1960", "response": ["|Tommy Bruce and the Bruisers", "|align=\"left\"|Tommy Bruce and the Bruisers"]}, {"page": "Stars and Garters", "response": ["Stars and Garters was a British television variety show produced by ATV from 1963 until 1965, set in a fictional public house. Hosted by comedian Ray Martine, regulars included singers Kathy Kirby, Vince Hill, Tommy Bruce, Al Saxon, Clinton Ford and Julie Rayne. Readers of Weekend magazine voted the show the Best TV Series of 1963."]}, {"page": "The Reason Why (disambiguation)", "response": ["* \"The Reason Why\", a song by Tommy Bruce 1969"]}, {"page": "Daniel Boone discography", "response": ["This article is the discography of English pop musician Daniel Boone. It includes his releases as Peter Lee Stirling, but excludes his work with bands such as Hungry Wolf and Rumplestiltskin and his work with David Garrick as The Warlord, The Intergalactic Orchestra and Technique. For his work with Tommy Bruce and the Bruisers, see there."]}]}}