{"wiki_id": "http://www.wikidata.org/entity/Q7817146", "itemLabel": "Tom Paddock", "itemDescription": "English boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Paddock", "wikipedia_page": {"main": "Tom Paddock, born Thomas Paddock (c. 1822, Redditch – 30 June 1863) also known as the Redditch Needlepointer was a champion English bare-knuckle boxer in the early Victorian era.Tom was baptised on 25 August 1822 in Redditch, Worcestershire, England, the son of George Paddock and Elizabeth (née Morris). Brought up on a farm, he was noted to have developed a size and endurance that served him well in his career as a boxer.His professional career in boxing started in 1844; at the time he was just under six feet tall and weighed twelve stone. Between then and 1850 he was largely undefeated in the boxing ring, and gained a reputation not only for his courage but for his foul tactics and uncontrollable temper. It was William Thompson of Nottingham who spoilt his clean record in 1850 in Mildenhall, Suffolk.In 1851 a fight against Harry Poulson in Belper ended in a riot when both men were jailed.  Both served ten months hard labour.Three years later Paddock challenged both Harry Broome and Bill Perry to a Heavyweight Championship of England bout but both turned it down.  Paddock then claimed himself as the Heavyweight Champion of England by default, though this was not generally recognised until 1856 following fifty-one rounds in the ring against Harry Broome in Manningtree. However, his victory was short-lived; he lost the title later the same year to Bill Perry. He twice attempted to regain the title, but was unsuccessful.Paddock's last fight took place in 1860 against Sam Hurst, for the championship of England. He died of heart disease on 30 June 1863 in Marylebone.", "link_mentions": [{"page": "1854 in sports", "response": ["* 14 February — Tom Paddock defeats Harry Poulson at Mildenhall in 102 rounds; this is the third and effectively deciding bout between the two.Cyber Boxing Zone – Tom Paddock.  Retrieved on 8 November 2009.", "* 27 August — Tom Paddock issues challenges to English Champion Harry Broome and to former champion William Perry but both refuse.  Paddock responds by claiming the Championship of England, but he is not recognised at this time."]}, {"page": "1856 in sports", "response": ["* 19 May — Harry Broome finally defends the Championship of England against Tom Paddock at Manningtree.  Paddock wins in the 51st round and takes the title.  Broome announces his retirement.Cyber Boxing Zone – Tom Paddock.  Retrieved on 8 November 2009."]}, {"page": "1857 in sports", "response": ["* 10 February — Tom Sayers defeats Aaron Jones in the 85th round at Medway, Kent.  Having beaten Harry Poulson the previous year, Sayers is now the main contender for the Championship of England title disputed by William Perry and Tom Paddock.Cyber Boxing Zone – Tom Sayers.  Retrieved on 8 November 2009. "]}, {"page": "1858 in sports", "response": ["* 5 January — Tom Sayers defeats Bill Benjamin in only three rounds at the Isle of Grain and now challenges Tom Paddock for the undisputed Championship of England.Cyber Boxing Zone – Tom Sayers.  Retrieved on 8 November 2009."]}, {"page": "1860 in sports", "response": ["* 5 November — Tom Paddock fights Sam Hurst for the vacant Heavyweight Championship of England at a venue in Berkshire.  Hurst wins in only five rounds and is awarded the championship belt by Tom Sayers.  This is Paddock's final fight.Cyber Boxing Zone – Sam Hurst.  Retrieved on 8 November 2009."]}, {"page": "Bare-knuckle boxing", "response": ["* Tom Paddock 1856-1858"]}, {"page": "1851 in sports", "response": ["* 16 December — future champion Tom Paddock fights Harry Poulson at Belper in Derbyshire. Paddock wins in the 86th round but the fight ends in a riot.  Paddock and Poulson are both jailed and sentenced to ten months hard labour.Cyber Boxing Zone – Tom Paddock.  Retrieved on 8 November 2009."]}, {"page": "1855 in sports", "response": ["* 20 February and 12 March — English Champion Harry Broome twice fails to honour scheduled bouts against Tom Paddock but continues to be recognised as the champion.Cyber Boxing Zone – Harry Broome.  Retrieved on 8 November 2009.", "* 26 June — Paddock keeps up the pressure on Broome by winning a return bout with Aaron Jones in 61 rounds at Mildenhall.Cyber Boxing Zone – Tom Paddock.  Retrieved on 8 November 2009."]}, {"page": "Redditch", "response": ["*Tom Paddock (1822–1863) was born in Redditch, and known as the \"Redditch Needlepointer\", champion heavyweight bare-knuckle boxer of England in 1856Oxford Dictionary of National Biography"]}, {"page": "William Perry (boxer)", "response": ["), known as \"The Tipton Slasher\" after his native town of Tipton, was a British heavyweight prize fighter of the 19th century and claimed the championship of England, with some dispute, for two periods between 1850 and 1857.Save St John's Church : GRAVEYARD INFO His fighting career began in London in 1835 and after fighting a number of highly rated championship contenders, he first claimed the English heavyweight championship by defeating Tom Paddock in twenty-seven rounds on 17 December 1850.", "Perry's next bout was with Tom Paddock on 17 December 1850 at Woking Common. Articles for the fight were signed on 1 October 1850 at the Castle Tavern, Holborn for a \"fair stand-up fight, for £100 a-side\". Perry won the contest, which lasted 27 rounds. It was after this fight that William Perry claimed the Championship of England. The Slasher now requested that the fighter Bendigo hand over the Championship belt, still in his possession, or make a match with him. He also made a general challenge for anyone to fight him for between £200 to £500 a side. Bendigo offered to fight for £500 but would not hazard the belt, which he claimed to be his private property. However, when Perry sent £50 to the editor of Bell's Life in London, in order to make the match, Bendigo backed out of the challenge.", "In early 1855, fight supporters commissioned a new championship belt, the previous one \"having gone astray\". The subscription raised £100 and a Bond Street jeweller was asked to make the new belt. At this date there were thought to be 5 possible contenders for the Championship: Perry, Harry Broome, Harry Orme, Tom Paddock and Aaron Jones.", "Perry attempted to set up fights with Aaron Jones and Tom Paddock in 1856, but both forfeited to him rather than fight.", "| Tom Paddock"]}, {"page": "William Thompson (boxer)", "response": ["====Last title bout with Tom Paddock, 1850====", "Although enjoying his quiet life, Thompson accepted a challenge from young Tom Paddock from Redditch and, on 5 June 1850, the 39-year-old William Abednego Thompson began his last fight. In two minds as to whether to accept the challenge or not, his 82-year-old mother encouraged him by saying \"I tell you this Bendy, if you don't take up the fight you're a coward. And I tell you more. If you don't fight him, I'll take up the challenge myself.\"", "On 6 June 1850, immediately after his fight with Tom Paddock, he was arrested for drunkenness on Chandler Street in Nottingham and released after paying a 5 shilling fee.The Nottingham Guardian, Nottingham, England, pg. 3, 6 June 1850 He eventually moved to Beeston to try to curb his drinking with his friends in Nottingham, but could not stop his habit for long, having only a few sober moments fishing by the Trent. Once, at the age of 59, he dived into the river to save three people who appeared to be drowning. When a woman he had rescued offered him a reward, he rejected her offer with scorn, reminding her that he was the champion of England."]}, {"page": "Tom Sayers", "response": ["In early 1855, fight supporters commissioned a new championship belt, the previous one \"having gone astray\". The subscription raised £100 and a Bond Street jeweller was asked to make the new belt. At this date there were thought to be 5 possible contenders for the Championship: William Perry, Harry Broome, Harry Orme, Tom Paddock and Aaron Jones.", "William Perry claimed the title for himself and attempted to set up fights with Aaron Jones and Tom Paddock in 1856, however both forfeited to him rather than fight, which gave the opportunity for Sayers to fight for the championship.", "On 16 June 1858, Sayers took on and beat the experienced fighter Tom Paddock on Canvey Island. In the 21st round, Sayers, noting that exhausted Paddock could hardly see and was incapable of defending himself, shook his opponent by the hand and led him back to his corner, prompting Paddock's seconds to \"throw up the sponge\".", "| Tom Paddock"]}, {"page": "1850 in sports", "response": ["* 5 June — William \"Bendigo\" Thompson defends his English Championship against Tom Paddock at Mildenhall.  After winning the bout on the disqualification of Paddock after 49 rounds, Thompson announces his retirement from the ring.Cyber Boxing Zone – Bendigo.  Retrieved on 7 November 2009.", "* 17 December — Tom Paddock fights William Perry at Woking Common.  After 27 rounds, Paddock is disqualified after striking Perry on the neck while Perry was walking to his corner. Perry claims the vacant English Championship.Cyber Boxing Zone – William Perry.  Retrieved on 7 November 2009."]}, {"page": "Redditch Needlepointer", "response": ["#REDIRECT Tom Paddock"]}, {"page": "Thomas Paddock", "response": ["#REDIRECT Tom Paddock"]}, {"page": "Sam Hurst", "response": ["Hurst won the English championship in his first bare-knuckle fight by defeating Tom Paddock at Aldermaston on 6 November 1861, in a contest that lasted five rounds. Paddock was suffering from the effects of a knife wound, and was unable to continue after being knocked down by a punch that broke three of his ribs. Hurst's prize money of £400 is equivalent to about £29,000 as of 2010. His next fight was against Jem Mace at Medway Island on 18 June 1861. At  Hurst was five inches taller than his opponent, and correspondingly heavier, but he was not a skillful boxer and was no match for Mace's speed and agility. Hurst's seconds withdrew him from the fight in the eighth round, and he never fought again except in exhibition matches."]}, {"page": "Paddock (surname)", "response": ["*Tom Paddock (c. 1822–1863), British boxing champion"]}, {"page": "Harry Broome", "response": ["Henry Alfred Broome (1826 – 2 November 1865) was a boxer from the bare-knuckle fighting era who became heavyweight champion of England in September, 1851 when he defeated fellow Englishman William Perry in Mildenhall, England.  He lost the title in May, 1856 to Tom Paddock in Suffolk.", "right|thumb|upright|Tom Paddock", "Broome had two fights scheduled with Tom Paddock in February and March of 1855, but Paddock failed to show for either bout.", "| Tom Paddock"]}]}}