{"wiki_id": "http://www.wikidata.org/entity/Q7819393", "itemLabel": "Tommy Elphick", "itemDescription": "English footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Elphick", "wikipedia_page": {"main": "Tommy Elphick (born 7 September 1987) is a former English professional footballer who retired on 19 August 2021. He played as a centre-back for Brighton & Hove Albion, AFC Bournemouth, Aston Villa, Reading, Hull City and Huddersfield Town.\nElphick was a product of the Brighton & Hove Albion academy and progressed through the ranks to be named captain, leading the side to promotion to the Football League Championship in 2011. Having moved to AFC Bournemouth, he was again named captain and led the club to promotion to both the Championship and again to the Premier League.", "link_mentions": [{"page": "September 7", "response": ["*1987 – Tommy Elphick, English footballer"]}, {"page": "Steven Fletcher (footballer)", "response": ["Following his release from Sunderland, Fletcher joined Sheffield Wednesday on a free transfer on 1 July 2016, signing a four-year contract. He made his EFL Championship debut on 7 August, starting in a 1–0 home victory against Aston Villa, in which he was substituted in the first half due to a head injury from a collision with Tommy Elphick. On 10 September, he scored his first goal for the Owls to open a 2–1 win over Wigan at Hillsborough."]}, {"page": "Gary Elphick", "response": ["His younger brother, Tommy Elphick, currently plays for Huddersfield Town."]}, {"page": "Miles Addison", "response": ["At the start of the 2012–13 season, Addison captained the side in number of matches following the departure of Adam Barrett. His captaincy lasted halfway through between the start of the season and November. He also formed a central–defence partnership with Tommy Elphick. Addison continued to captain the side until he suffered a foot injury in the beginning of December. Initially out for three–four weeks, he was eventually sidelined for the rest of the 2012–13 season. Despite this, Addison was involved in the squad that saw Bournemoiuth promoted to the Championship for next season, as he made twenty–two appearances in all competitions."]}, {"page": "2008–09 Brighton & Hove Albion F.C. season", "response": ["| Tommy Elphick"]}]}}