{"wiki_id": "http://www.wikidata.org/entity/Q7817282", "itemLabel": "Tom Priestley", "itemDescription": "British film and sound editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Priestley", "wikipedia_page": {"main": "Tom Priestley (born 22 April 1932 in London) is a British film and sound editor, whose career spans from 1961 to 1990.", "link_mentions": [{"page": "Academy Award for Best Documentary Feature", "response": ["|Steve Singer and Tom Priestley"]}, {"page": "Academy Award for Best Film Editing", "response": ["| Tom Priestley"]}, {"page": "J. B. Priestley", "response": ["In September 1926 Priestley married Jane Wyndham-Lewis (ex-wife of the one-time 'Beachcomber' columnist D. B. Wyndham-Lewis, no relation to the artist Wyndham Lewis); they had two daughters (including music therapist Mary Priestley, conceived while Jane was still married to D. B. Wyndham-Lewis) and one son, the film editor Tom Priestley. During the Second World War Jane ran several residential nurseries for evacuated mothers and their children, many of whom had come from poor districts.Women's Group on Public Welfare. The Neglected Child and His Family. Oxford University Press: London, 1948, p. x. For much of their married life they lived in Highgate at 3 The Grove, formerly the home of the poet Samuel Taylor Coleridge."]}, {"page": "Deliverance", "response": ["* Academy Award for Best Film Editing — Tom Priestley"]}, {"page": "Exorcist II: The Heretic", "response": ["Exorcist II was beset by numerous problems during production. Boorman himself contracted a case of San Joaquin Valley Fever (a respiratory fungal infection), which cancelled production for over a month (a costly delay). Other problems included footage being oversaturated and necessitating reshoots; the rapid deaths of locusts imported from England for the film's climactic scenes (2500 locusts were shipped in and died at a rate of 100 a day); original film editor John Merritt quitting the production (he was replaced by Tom Priestley); and stars Kitty Winn and Louise Fletcher both suffering from gall bladder infections.Bob McCabe, The Exorcist: Out of the Shadows (Omnibus Press, 1999), pp. 160–163"]}, {"page": "45th Academy Awards", "response": ["** Deliverance – Tom Priestley"]}, {"page": "52nd Academy Awards", "response": ["**The Killing Ground – Steve Singer and Tom Priestley"]}, {"page": "BAFTA Award for Best Editing", "response": ["| Deliverance || Tom Priestley"]}, {"page": "Priestley", "response": ["* Tom Priestley (born 1932), sound and film editor"]}, {"page": "26th British Academy Film Awards", "response": ["* Deliverance – Tom Priestley"]}, {"page": "20th British Academy Film Awards", "response": ["Morgan – A Suitable Case for Treatment – Tom Priestley"]}, {"page": "The Exorcist (franchise)", "response": ["| Tom Priestley"]}, {"page": "Thomas Priestley", "response": ["*Tom Priestley, English film editor"]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Tom Priestley"]}, {"page": "The Hillman Prize", "response": ["| 1979 ||Broadcast ||Steve Singer, Tom Priestley ||The Killing Ground ||ABC-TV News Closeup ||||"]}, {"page": "Primetime Emmy Award for Outstanding Cinematography for a Single-Camera Series (One Hour)", "response": ["| Tom Priestley"]}, {"page": "Charles Orme", "response": ["In 1971, Orme began working as associate producer on Deliverance (adapted from James Dickey's novel), directed by John Boorman, edited by Tom Priestley and starring Jon Voight, Burt Reynolds, Ned Beatty and Ronny Cox. Deliverance was a box office success in the United States, becoming the fifth highest-grossing film of 1972 after grossing a domestic total of over $46 million with only a $2 million budget. Deliverance was nominated for three Oscars, including Best Picture, Best Director and Best Film Editing. Deliverance was an inductee to the 2008 National Film Registry list;https://www.loc.gov/programs/national-film-preservation-board/film-registry/complete-national-film-registry-listing/ | accessed 3/18/2018. commenting, \"With dazzling visual flair, director John Boorman and cinematographer Vilmos Zsigmond infuse James Dickey's novel with scenes of genuine terror and frantic struggles for survival battling river rapids — and in the process create a work rich with fascinating ambiguities about \"civilized\" values, urban-versus-backwoods culture, nature, and man's supposed taming of the environment.\"https://www.loc.gov/programs/national-film-preservation-board/film-registry/descriptions-and-essays/ | accessed 3/18/2018.", "In the same year, Orme worked as associate producer on John Boorman's Exorcist II: The Heretic, edited by Tom Priestley, photographed by cinematographer William A. Fraker and starring Linda Blair, Louise Fletcher and Richard Burton. The film's music was composed by another of the greatest film composers of all time, Ennio Morricone."]}]}}