{"wiki_id": "http://www.wikidata.org/entity/Q7819637", "itemLabel": "Tommy Lonsdale", "itemDescription": "Footballer (1892-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Lonsdale", "wikipedia_page": {"main": "Thomas Stewart Lonsdale (21 September 1882 – 17 March 1973) was a football goalkeeper and centre half.", "link_mentions": [{"page": "Joe Schofield", "response": ["He prepared for 1923–24 by bringing in Stalybridge Celtic goalkeeper Tommy Lonsdale; Macclesfield Town 'penalty king' right-back Jack Maddock; Leeds United tough-tackling half-back Alf Dark; Bolton Wanderers winger Jack Lowe; Clyde's reliable forward Fred Howard; and Exeter City goal machine Harold Crockford. He later bought Ireland international Louis Bookman for £250 from Luton Town. Tom Butler died of lockjaw on 11 November, eight days after sustaining a broken arm in a draw at Clapton Orient. Schofield brought winger Arthur Bridgett out of retirement despite the fact that he had not played a league game since 1912. He also played Tom Holford on 5 April 1924 at the age of 46. The club finished the season in 16th place, five points ahead of relegated Nelson."]}, {"page": "Thomas Stewart Lonsdale", "response": ["#REDIRECT Tommy Lonsdale"]}, {"page": "Thomas Lonsdale", "response": ["#REDIRECT Tommy Lonsdale"]}, {"page": "Sidney Brown (footballer)", "response": ["Brown joined Port Vale in November 1923, making his debut in a 5–1 FA Cup qualifier defeat to Wrexham at the Racecourse Ground on 1 December. He went on to play eight Second Division games in the 1923–24 season, but remained as Tommy Lonsdale's understudy. New signing Tom Fern then took the number one jersey at The Old Recreation Ground, and Brown was limited to four games in the 1924–25 and 1925–26 campaigns, before he was released at the end of the 1926–27 season. He moved on to Gillingham, West Bromwich Albion, Congleton Town and Dudley Town."]}, {"page": "Robert Radford (footballer)", "response": ["Baden played for Brereton Social, before joining Port Vale as an amateur in July 1923 and signing as a professional the next month. He made his first team debut in a Potteries derby match at The Old Recreation Ground on 13 October, which Vale lost 3–2. The following two Second Division games were both against Leeds United, which were lost 1–0 at home and 3–0 at Elland Road. Tommy Lonsdale returned between the sticks after this and Radford was released at the end of the season and returned to Brereton Social."]}, {"page": "1923–24 Port Vale F.C. season", "response": ["To strengthen the side, pre-season signings included: Stalybridge Celtic goalkeeper Tommy Lonsdale; Macclesfield Town 'penalty king' right-back Jack Maddock; Leeds United tough-tackling half-back Alf Dark; Bolton Wanderers winger Jack Lowe; Clyde's reliable forward Fred Howard; and Exeter City goal machine Harold Crockford. The kit for the season was picked – red jerseys with white shorts.", "Briscoe, Page, Kirkham, and Bridgett were the major goalscorers. Full-back Len Birks was an ever-present, and Tommy Lonsdale, Jack Hampson, and Jack Lowe were also key first team players. As well as the debut of Kirkham, Roger Jones also made his debut, starting his fourteen-year association with the club. At the end of the season the club let Peter Pursell leave for Wigan Borough, whereas Lonsdale and Hampson both retired due to injury.", "|align=\"left\"|GK||align=\"left\"| Tommy Lonsdale", "| June 1923 || GK ||  || Tommy Lonsdale || Stalybridge Celtic || Free transfer || ", "| Summer 1924 || GK ||  || Tommy Lonsdale || || Released || "]}, {"page": "Lonsdale (surname)", "response": ["*Tommy Lonsdale (1882–1973), English footballer"]}]}}