{"wiki_id": "http://www.wikidata.org/entity/Q7819120", "itemLabel": "Tommie Connor", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommie_Connor", "wikipedia_page": {"main": "Thomas Patrick Connor (16 November 1904 – 28 November 1993) was an English lyricist and songwriter, credited with several hit songs over his long career.  He wrote several of the most popular non-religious Christmas songs, including \"The Little Boy that Santa Claus Forgot\", \"I'm Sending a Letter to Santa Claus\", and \"I Saw Mommy Kissing Santa Claus\", as well as the lyrics for such popular songs as \"Lili Marlene\" and \"The Biggest Aspidistra in the World\".", "link_mentions": [{"page": "Mistletoe", "response": ["One of the earliest references to mistletoe traditions in popular music is the 1952 hit \"I Saw Mommy Kissing Santa Claus\", which was originally sung by Jimmy Boyd and has been covered by many singers. The song was written by British songwriter Tommie Connor and recorded in the US. The 1958 US hit \"Rockin' Around The Christmas Tree\" refers to couples wanting to stop beneath the mistletoe. \"Ring Out, Solstice Bells\" from the album Songs from the Wood (1977) by British rock group Jethro Tull refers to the Druid Ritual of Oak and Mistletoe. In 1988, the British singer Cliff Richard released a popular Christmas song called \"Mistletoe and Wine\". More recent Christmas songs referring to mistletoe traditions include \"Merry Christmas Everyone\" by Shakin' Stevens (1991), \"All I Want For Christmas Is You\" written and performed by Mariah Carey (1994) and \"Mistletoe\" by Justin Bieber (2011)."]}, {"page": "Christmas music", "response": ["\"I've Got My Love to Keep Me Warm\", introduced in the musical film On the Avenue by Dick Powell and Alice Faye in 1937, was written by Irving Berlin. \"The Little Boy that Santa Claus Forgot\" – written by Michael Carr, Tommie Connor, and Jimmy Leach in 1937 – was notably performed by Vera Lynn and Nat King Cole. \"I'll Be Home for Christmas\", by lyricist Kim Gannon and composer Walter Kent, was recorded by Bing Crosby in 1943. \"Merry Christmas Baby\" is credited to Lou Baxter and Johnny Moore, whose group originally recorded it in 1947, featuring singer and pianist Charles Brown. Kay Thompson introduced her \"The Holiday Season\" in 1945, which later became part of a medley by Andy Williams. \"A Marshmallow World\" (sometimes called \"It's a Marshmallow World\") was written in 1949 by Carl Sigman (lyrics) and Peter DeRose (music).", "* \"I Saw Mommy Kissing Santa Claus\" with music and lyrics by British songwriter Tommie Connor was first recorded by 13-year-old Jimmy Boyd in 1952, reaching No. 1 on the Billboard pop singles chart in December of that year. The Jackson 5 recorded a popular cover in 1970 with a young Michael Jackson singing lead."]}, {"page": "1952 in music", "response": ["* \"I Saw Mommy Kissing Santa Claus\"   w.m. Tommie Connor"]}, {"page": "1949 in music", "response": ["* \"The Wedding Of Lili Marlene\" w.m. Tommie Connor & Johnny Reine"]}, {"page": "1948 in music", "response": ["* \"Hang On The Bell, Nellie\" w.m. Tommie Connor, Clive Erard & Ross Parker"]}, {"page": "1939 in music", "response": ["* \"Lili Marlene\" w. (Ger) Hans Leip (Eng) Tommie Connor m. Norbert Schultze", "* \"Till The Lights Of London Shine Again\" w.m. Tommie Connor, Eddie Pola", "* \"Who's Taking You Home Tonight?\" w.m. Manning Sherwin & Tommie Connor from the revue Shephard's Pie"]}, {"page": "Lili Marleen", "response": ["Songwriter Tommie Connor also wrote English lyrics with the title \"Lily of the Lamplight\" in 1944. Another English translation was done by Dr. Theodore Stephanides during World War II and published in his memoir Climax in Crete in 1946.Theodore Stephanides, Climax in Crete, London: Faber and Faber, 1946, pp. 47–48.", "Category:Songs written by Tommie Connor"]}, {"page": "List of songs recorded by Frank Sinatra", "response": ["|The Wedding of Lili Marlene||1949||Tommie Connor, Johnny Reine"]}, {"page": "I Saw Mommy Kissing Santa Claus", "response": ["\"I Saw Mommy Kissing Santa Claus\" is a Christmas song with music and lyrics by British songwriter Tommie Connor and first recorded by Jimmy Boyd in 1952. The song has since been covered by many artists, with one of the most famous covers being attributed to The Ronettes in 1963.", "Category:Songs written by Tommie Connor"]}, {"page": "List of songs recorded by Perry Como", "response": ["|German: Hans LeipEnglish: Tommie Connor"]}, {"page": "Manning Sherwin", "response": ["His most enduring composition is the music for \"A Nightingale Sang in Berkeley Square\", lyrics by Eric Maschwitz, written for New Faces in 1940.  Another wartime success, published in 1939, was \"Who's Taking You Home Tonight?\", with lyrics by Tommie Connor."]}, {"page": "Memphis Belle (film)", "response": ["\"The Chestnut Tree\", performed by Glenn Miller And His Orchestra and written by Tommie Connor, Jimmy Kennedy and Hamilton Kennedy is featured in the film playing over the Memphis Belle's radio, but isn't on the soundtrack album. The upbeat version of \"Danny Boy\" performed by Connick at the party is not found on the soundtrack album; a slower version performed by Mark Williamson appears instead.\"Memphis Belle Soundtrack.\" soundtrackcollector.com . Retrieved: 11 October 2010. The film score, by George Fenton, was nominated for a BAFTA award for Best Original Film Score in 1991."]}, {"page": "I Love to Sing", "response": ["#\"I Love to Sing\" (Paul Misraki, Michael Carr, Tommie Connor)"]}, {"page": "Back to Mono (1958–1969)", "response": ["| 7. || I Saw Mommy Kissing Santa Claus || Tommie Connor || The Ronettes || 2:37"]}, {"page": "Mel and George \"Do\" World War II", "response": ["# \"Lili Marlene\" (Tommie Connor, Hans Leip, Norbert Schultze) – 6:18"]}, {"page": "The Story of a Soldier", "response": ["\"The Story of a Soldier\" (\"La storia di un soldato\" in Italian) is a song from Sergio Leone's 1966 Western The Good, the Bad and the Ugly. Like the rest of the film's score, it was composed by Ennio Morricone, and it is the only song in the score accompanied by lyrics written by Tommie Connor. The song is played by a band of Confederate prisoners of war while the character Tuco is tortured for information. It is an example of Diegetic music. ", "Category:Songs written by Tommie Connor"]}, {"page": "Bob's your uncle", "response": ["In 1954, the song \"Bob's Yer Uncle! (an' Fanny's yer aunt)\" was a hit on the British sheet music sales charts, reaching No. 22 on 12 June that year. Composed by Tommie Connor and Eddie Lisbona, the first recording released in Britain was by American singer Guy Mitchell in May 1954. The following month, two covers by British artists were released: one by actor John Slater, and another by Billy Cotton and his Band, with vocals by Alan Breeze and The Bandits. The Mitchell version was not released in his native America."]}, {"page": "Hey Santa!", "response": ["#\"I Saw Mommy Kissing Santa Claus\" (Tommie Connor)  -1:14"]}, {"page": "A Very Special Christmas (album)", "response": ["| 6. || \"I Saw Mommy Kissing Santa Claus\" || Tommie Connor || John Cougar Mellencamp || 2:39"]}, {"page": "List of popular Christmas singles in the United States", "response": ["| Reached No. 1 on both the Billboard Pop chart and Best Selling Children's chart in 1952. Written by Tommie Connor. Other hit versions were recorded by Spike Jones and his City Slickers (1952), Molly Bee (1953), The Ronettes (1963), The Four Seasons (1964), The Jackson 5 (1970), John Mellencamp (1987), Reba McEntire (1999), and Jessica Simpson."]}, {"page": "Never Trust a Pretty Face", "response": ["# \"Lili Marleen\" (Norbert Schultze, Hans Leip, Tommie Connor) – 4:40", "# \"Lili Marleen\" (Norbert Schultze, Hans Leip, Tommie Connor) – 4:40", "# \"Lili Marleen\" (Norbert Schultze, Hans Leip, Tommie Connor) – 4:40"]}, {"page": "Edward Pola", "response": ["* \"Till The Lights Of London Shine Again\" (co-written with Tommie Connor)"]}, {"page": "Cadavrexquis", "response": ["# \"Lili Marlène\" (Norbert Schultze, Hans Leip, Tommie Connor) – 4:28"]}, {"page": "Heart (Amanda Lear album)", "response": ["# \"Lili Marleen\" (Norbert Schultze, Tommie Connor) – 3:47", "# \"Lili Marlene\" (Norbert Schultze, Tommie Connor) – 3:49"]}, {"page": "The Sphinx – Das Beste aus den Jahren 1976–1983", "response": ["#\"Lili Marleen\" (Norbert Schultze, Hans Leip, Tommie Connor) – 4:40"]}, {"page": "Sings Evergreens", "response": ["#\"Lili Marlene\" (Norbert Schultze, Tommie Connor) – 3:48"]}, {"page": "Tendance", "response": ["# \"Lili Marleen\" (Norbert Schultze, Tommie Connor) – 3:47", "# \"Lili Marleen\" (Norbert Schultze, Tommie Connor) – 3:48"]}, {"page": "Path of Most Resistance", "response": ["Path of Most Resistance is a compilation album of music by Secret Chiefs 3, released in 2007 by Mimicry Records. The album features original compositions from Trey Spruance as well as covers of compositions by Ernest Gold, Ananda Shankar, RD Burman, Tommie Connor, Brian Wilson and Van Dyke Parks. The last three songs had not been released on any other Secret Chiefs 3 album."]}, {"page": "Louis Levy", "response": ["* My Heart is Calling (with Tommie Connor and Harry S. Pepper, 1935)"]}, {"page": "The Village Blacksmith", "response": ["In 1938, songwriters Tommie Connor, Jimmy Kennedy, and Hamilton Kennedy created a comical song and dance routine inspired by the poem; Glenn Miller's recording of the song was featured in the 1990 film Memphis Belle.Kennedy, J. J. The Man Who Wrote the Teddy Bears' Picnic. AuthorHouse, 2011: 134–137. "]}, {"page": "Michael Carr (composer)", "response": ["He returned to Dublin in 1930, and began writing tunes. A local bandleader suggested that he move to London, and enabled his introduction to lyricist Jimmy Kennedy. In 1934 he settled in London, where he worked for a music company. Initially he wrote cowboy songs such as \"Ole Faithful\", drawing on his experiences in the US, and then, usually with Kennedy, wrote and co-wrote several songs for such performers as Gracie Fields. His successful songs included \"The Girl with the Dreamy Eyes\" (1935, written with Eddie Pola), \"Dinner For One Please, James\" (1935), and \"The Little Boy that Santa Claus Forgot\" (1937, written with Tommie Connor and Jimmy Leach). One of his best-known songs, written with Kennedy, was \"We're Going to Hang out the Washing on the Siegfried Line\" (1939). During the Second World War he served in the army. In 1942 he composed \"Freedom Concerto\".", "* \"The Little Boy that Santa Claus Forgot\" (1937) (with Tommie Connor & Jimmy Leach)", "* \"I Love To Sing\" (1943) (with Paul Misrake & Tommie Connor)", "* \"When You Talk About Old Ireland\" (1951) (with Tommie Connor)"]}, {"page": "Christmas in the United States (1946–1964)", "response": ["\"I Saw Mommy Kissing Santa Claus\" was written and composed by Tommie Connor in 1952 and originally recorded by thirteen-year-old Jimmy Boyd. The song reached #1 on the Billboard charts in 1952, and on the Cash Box Magazine chart at the beginning of the following year. Boyd's record was condemned by the Roman Catholic Church in Boston on the grounds it mixed sex with Christmas. Boyd was widely photographed meeting with the Archdiocese to explain the song."]}]}}