{"wiki_id": "http://www.wikidata.org/entity/Q7816566", "itemLabel": "Tom Leonard", "itemDescription": "Scottish poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Leonard_(poet)", "wikipedia_page": {"main": "Tom Leonard (22 August 1944 – 21 December 2018) was a Scottish poet, writer and critic. He was best known for his poems written in Glaswegian dialect, particularly his Six Glasgow Poems and The Six O'Clock News. His work frequently dealt with the relationship between language, class and culture.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Tom Leonard (1944–2018, S)"]}, {"page": "University of Glasgow", "response": ["In more recent times, the university was the focus of the \"Glasgow Group\" of poets and literary critics, including Philip Hobsbaum, Tom Leonard and Alasdair Gray. The university boasts one of Europe's largest collections of life scientists, as well as having been the training ground of numerous politicians including former Prime Ministers Bonar Law and Sir Henry Campbell-Bannerman, former First Minister Donald Dewar, former leader of the Liberal Democrats and former Rector Charles Kennedy, Defence Secretaries Liam Fox and Des Browne, the founder of the UK Independence Party Alan Sked, former Labour Party leader John Smith, Business Secretary Vince Cable, former leader of the Liberal Democrats Sir Menzies Campbell, and current First Minister Nicola Sturgeon. Other notable alumni include banker Fred Goodwin, actor Gerard Butler, Rangers and Scottish footballer Neil Murray, actor, writer, television and radio broadcaster Colin Lamont (aka Scottie McClue), novelist Robin Jenkins, founder of the world's largest non-governmental development organisation BRAC Fazle Hasan Abed, television writers Armando Iannucci and Steven Moffat, comedian Greg Hemphill, television presenter Neil Oliver, journalists Andrew Neil and Raman Bhardwaj, and musicians Emeli Sandé and Simon Neil."]}, {"page": "1944 in literature", "response": ["*August 22 – Tom Leonard, Scottish dialect poet"]}, {"page": "Scottish literature", "response": ["From the 1980s Scottish literature enjoyed another major revival, particularly associated with a group of Glasgow writers focused around meetings in the house of critic, poet and teacher Philip Hobsbaum. Also important in the movement was Peter Kravitz, editor of Polygon Books. Members of the group that would come to prominence as writers included James Kelman, Alasdair Gray, Liz Lochhead, Tom Leonard and Aonghas MacNeacail. In the 1990s major, prize winning, Scottish novels that emerged from this movement included Irvine Welsh's Trainspotting (1993), Warner's Morvern Callar (1995), Gray's Poor Things (1992) and Kelman's How Late It Was, How Late (1994). These works were linked by a sometimes overtly political reaction to Thatcherism that explored marginal areas of experience and used vivid vernacular language (including expletives and Scots). Scottish crime fiction has been a major area of growth with the success of novelists including Val McDermid, Frederic Lindsay, Christopher Brookmyre, Quintin Jardine, Denise Mina and particularly the success of Edinburgh's Ian Rankin and his Inspector Rebus novels. Scottish play writing became increasingly internationalised, with Scottish writers such as Liz Lochhead and Edwin Morgan adapting classic texts, while Jo Clifford and David Greig investigated European themes.J. MacDonald, \"Theatre in Scotland\" in B. Kershaw and P. Thomson, The Cambridge History of British Theatre: Volume 3 (Cambridge: Cambridge University Press, 2004), , p. 223. This period also saw the emergence of a new generation of Scottish poets that became leading figures on the UK stage, including Don Paterson, Kathleen Jamie, Douglas Dunn, Robert Crawford, and Carol Ann Duffy. Glasgow-born Duffy was named as Poet Laureate in May 2009, the first woman, the first Scot and the first openly gay poet to take the post."]}, {"page": "British Poetry Revival", "response": ["In Scotland, Edwin Morgan, Ian Hamilton Finlay and Tom Leonard emerged as key individual poets during this time, each interested in, among other forms, sound and visual poetry. The viability of a wider, deeper experimental infrastructure in poetry was helped by the gallery, performance space and bookshop at the Third Eye Centre in Glasgow (later renamed the Centre for Contemporary Arts). Magazines such as Scottish International, \"Chapman\", and Duncan Glen's magazine Akros maintained links with the modernist legacy of the inter-war and post-war years while publishing contemporary poets; often, however, by mixing the avant-garde with aesthetically conservative texts."]}, {"page": "Bill Griffiths (poet)", "response": ["Griffiths' books of poetry from other publishers include A Tract Against The Giants (Coach House Press, Toronto, 1984), Rousseau and the Wicked (Invisible Books, London, 1996), Etruscan Reader 5 (with Tom Raworth and Tom Leonard) (Etruscan Books, Buckfastleigh, 1997), Nomad Sense (Talus Editions, London, 1998), A Book of Spilt Cities (Etruscan Books, 1999), Ushabtis (Talus, 2001) and Durham and other sequences (West House Books, 2002). A substantial collection of his work was also published in Future Exiles (Paladin 1992). In 2010, Reality Street released Collected Earlier Poems (1966 – 80)."]}, {"page": "Tom Leonard", "response": ["*Tom Leonard (Irish politician) (1924–2004), Fianna Fáil politician from Dublin, Ireland", "*Tom Leonard (poet) (1944–2018), Scottish poet", "*Tom Leonard (tennis) (born 1948), American former tennis player", "*Tom Leonard (Michigan politician) (born 1981), member of the Michigan House of Representatives"]}, {"page": "Other: British and Irish Poetry since 1970", "response": ["John Agard - Tony Baker - Anthony Barnett  - Richard Caddel - Cris Cheek - Thomas A. Clark - Bob Cobbing- Brian Coffey - Kelvin Corcoran - Andrew Crozier - Fred D'Aguiar - Ken Edwards - Peter Finch - Allen Fisher - Roy Fisher - Veronica Forrest-Thomson - Ulli Freer - Harry Gilonis - Jonathan Griffin - Bill Griffiths - Alan Halsey - Lee Harwood - Michael Haslam - Randolph Healy - John James - Amryl Johnson - Linton Kwesi Johnson - Tom Leonard - Tony Lopez - Rob MacKenzie - Barry MacSweeney - Billy Mills - Geraldine Monk - Eric Mottram - Wendy Mulford - Grace Nichols -Douglas Oliver - Maggie O'Sullivan - Tom Pickard - Elaine Randell - Tom Raworth - Carlyle Reedy - Denise Riley - John Riley - Peter Riley - Maurice Scully - John Seed - Gavin Selerie - Robert Sheppard - Colin Simms - Iain Sinclair - Chris Torrance - Gael Turnbull - Catherine Walsh - Benjamin Zephaniah"]}, {"page": "Anthology of Twentieth-Century British and Irish Poetry", "response": ["* Tom Leonard"]}, {"page": "List of people from Glasgow", "response": ["*Tom Leonard – poet"]}, {"page": "List of University of Glasgow people", "response": ["* Tom Leonard, poet and essayist"]}, {"page": "Philip Hobsbaum", "response": ["In Glasgow, Hobsbaum became once again the nucleus of a group of new and distinctive authors, including Alasdair Gray, Liz Lochhead, James Kelman, Tom Leonard, Aonghas MacNeacail and Jeff Torrington.  This group continued to meet until 1975, and unlike the previous groups developed a more pronounced focus on prose than on poetry.  As an encore, Hobsbaum was instrumental in setting up, in 1995, the successful MLitt in Creative Writing at the University of Glasgow."]}, {"page": "Liz Lochhead", "response": ["It is often claimed that at this time Lochhead was part of a Philip Hobsbaum writers' group, a crucible of creative activity – with other members including Alasdair Gray, James Kelman, Tom Leonard, Aonghas MacNeacail and Jeff Torrington,Peter Childs and Michael Storry (eds), The Encyclopedia of Contemporary British Culture. Routledge: 2009, p.311. Liz Lochhead has repeatedly claimed this to be an invention. She has however recalled the support and inspiration she drew from the Scottish poetry scene of the early 1970s and  meetings with the elder generation - Norman MacCaig, Edwin Morgan, Robert Garioch - and with contemporaries such as Leonard, Kelman and Gray. Lochhead went on to produce revue shows with Leonard and Gray, including Tickly Mince, and The Pie of Damocles. Other the following years Lochhead published further collections Islands (1978) and The Grimm Sisters (1979) and moved first to Toronto as part of the first Scottish/Canadian writers exchange and later made her home in New York. In 1986 she returned permanently to Glasgow.", "Lochhead's success in poetry was rivalled by her writing for the theatre. Her plays include Blood and Ice (1982), Mary Queen of Scots Got Her Head Chopped Off (1987), Perfect Days (2000) and a highly acclaimed adaptation into Scots of Molière's Tartuffe (1985). She adapted the medieval texts of the York Mystery Plays, performed by a largely amateur cast at York Theatre Royal in 1992 and 1996.  Her adaptation of Euripides' Medea won the Saltire Society Scottish Book of the Year Award in 2001. Her plays have been performed on BBC Radio 4: Blood and Ice (11 June 1990), The Perfect Days (16 May 1999), Mary Queen of Scots Got Her Head Chopped Off (11 February 2001) and The Stanley Baxter Playhouse: Mortal Memories (26 June 2006). Her adaptation of Helen Simpson's short story Burns and the Bankers was broadcast on BBC Radio 4 on Burns Night, 25 January 2012.BBC – Afternoon Drama –  Burns and the Bankers  Her plays Educating Agnes and Thebans premiered in the early 2000s, and in 2011 as part of the Glasgay Festival, Liz Lochhead's play Edwin Morgan's Dreams and Other Nightmares premiered at the Tron and it was revived three years later as part of the cultural celebrations for the commonwealth games. She has produced many new works for the Oran Mor in Glasgow, including Mortal Memories (2012) and Between the Thinks Bubble and the Speech Balloon (2014) with Tom Leonard, William Letford, Grace Cleary, and Henry Bell."]}, {"page": "James Kelman", "response": ["During the 1970s he published a first collection of short stories. He became involved in Philip Hobsbaum's creative writing group in Glasgow along with Tom Leonard, Alasdair Gray, Liz Lochhead, Aonghas MacNeacail and Jeff Torrington and his short stories began to appear in magazines. These stories introduced a distinctive style, expressing first-person internal monologues in a pared-down prose using Glaswegian speech patterns, though avoiding for the most part the quasi-phonetic rendition of Tom Leonard. Kelman's developing style has been influential on the succeeding generation of Scottish novelists, including Irvine Welsh, Alan Warner and Janice Galloway. In 1998, Kelman received the Stakis Prize for \"Scottish Writer of the Year\" for his collection of short stories The Good Times, one of several books of his stories that have been published. In 2012, a film was made based on the short story \"Greyhound For Breakfast\".", "* Three Glasgow Writers (1976, with Alex Hamilton and Tom Leonard)"]}, {"page": "Alan Bissett", "response": ["Bissett used to lecture in creative writing at Bretton Hall College, now part of the University of Leeds, and tutored the creative writing MLitt at the University of Glasgow alongside Janice Galloway and Tom Leonard. He became a full-time writer in December 2007. In March 2012, he became a \"Cultural Ambassador\" for National Collective, a creative organisation which supports Scottish independence."]}, {"page": "Jeff Torrington", "response": ["Torrington's first published stories appeared in newspapers. He later attended a Paisley writers' group set up by James Kelman and a creative writing group in Glasgow associated with Philip Hobsbaum, which also included Kelman, Tom Leonard, Liz Lochhead, Alasdair Gray and Aonghas MacNeacail."]}, {"page": "AQA Anthology", "response": ["*Tom Leonard: \"Unrelated Incidents\"", "*Tom Leonard: \"Unrelated Incidents\""]}, {"page": "Unrelated Incidents", "response": ["Unrelated Incidents is a series of poems by Tom Leonard. Written in 1976, One of the better-known of this series is \"The Six o'clock News\".", "* Tom Leonard's website with \"The Six o'clock News\"."]}, {"page": "1969 in poetry", "response": ["* Tom Leonard, Scottish dialect poet, Six Glasgow Poems"]}, {"page": "1944 in poetry", "response": ["* August 22 – Tom Leonard (died 2018), Scottish"]}, {"page": "Aonghas MacNeacail", "response": ["MacNeacail was born in Uig on the Isle of Skye on 7 June 1942. He was raised in Idrigil, speaking Gaelic as a child. He was registered at birth as Angus Nicolson, but later changed his official name to \"Aonghas MacNeacail,\" the Scottish Gaelic version of his name. He attended Uig Primary School and Portree High School, and from 1968 the University of Glasgow where he was one of a group of young writers who gathered around Philip Hobsbaum which also included James Kelman, Tom Leonard, Alasdair Gray, Liz Lochhead and Jeff Torrington."]}, {"page": "Leonard", "response": ["* Tom Leonard (Irish politician)", "* Tom Leonard (poet) (born 1944), Scottish poet"]}, {"page": "Saltire Society Literary Awards", "response": ["| | Intimate Voices: Selected Works || Tom Leonard ||"]}, {"page": "Alasdair Gray", "response": ["Gray's first plays were broadcast on radio (Quiet People) and television (The Fall of Kelvin Walker) in 1968. Between 1972 and 1974 he took part in a writing group organised by Philip Hobsbaum, which included James Kelman, Tom Leonard, Liz Lochhead, Aonghas MacNeacail and Jeff Torrington. In 1973, with the support of Edwin Morgan, he received a grant from the Scottish Arts Council to allow him to continue with Lanark. From 1977 to 1979 he was writer-in-residence at the University of Glasgow. "]}]}}