{"wiki_id": "http://www.wikidata.org/entity/Q7819465", "itemLabel": "Tommy Green", "itemDescription": "English footballer (1863-1923)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Green_(footballer,_born_1863)", "wikipedia_page": {"main": "Thomas Walter Green (August 1863 – 2 October 1923) was an English footballer, known for scoring Aston Villa's first goal in the Football League.", "link_mentions": [{"page": "Tom Green (disambiguation)", "response": ["Tom Green or Tommy Green may also refer to:", "* Tommy Green (footballer, born 1863) (1863–1923), West Bromwich Albion and Aston Villa footballer", "* Tommy Green (footballer, born 1873) (1873–1921), West Bromwich Albion and Small Heath footballer", "* Tommy Green (athlete) (1894–1975), British race walker", "* Tommy Green (footballer, born 1913) (1913–1997), West Bromwich Albion, West Ham United and Coventry City footballer"]}, {"page": "Tom Widdowson", "response": ["Villa forward Archie Goodall restored Villa' lead. Goodall latched onto a shot by fellow forward, Tommy Green and swept the ball past Widdowson. County rallied again after falling behind and scored a second equalizer by debut man Fred Weightman. County did have a chance to take the lead but after County equalized it was all Villa. Tommy Green restored Villa' lead and Archie Goodall made sure of the two points with his second goal in the match. Full Time score Notts County 2-4 Aston Villa."]}, {"page": "Tommy Green (footballer born 1863)", "response": ["#REDIRECT Tommy Green (footballer, born 1863)"]}, {"page": "Thomas Cooke (English footballer)", "response": ["Villa forward Archie Goodall restored Villa’ lead. Goodall latched onto a shot by fellow forward, Tommy Green and swept the ball past Widdowson. County rallied again after falling behind and scored a second equalizer by debut man Fred Weightman. County did have a chance to take the lead and Cooke was well placed to put County ahead. However, he shot wide. After Cooke’ miss it was all Villa. Tommy Green restored Villa’ lead and Archie Goodall made sure of the two points with his second goal in the match. Full Time score Notts County 2-4 Aston Villa."]}]}}