{"wiki_id": "http://www.wikidata.org/entity/Q7816461", "itemLabel": "Tom Killick", "itemDescription": "English cricketer (1907-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Killick", "wikipedia_page": {"main": "Edgar Thomas Killick (9 May 1907 in Fulham, London – 18 May 1953 in Northampton) was an English cricketer who played in two Tests in 1929. He became an ordained priest in his later life.\nTom Killick was a right-handed batsman who generally either opened the innings or went in at the fall of the first wicket. Educated at St Paul's School, he played a few matches for Middlesex as a 19-year-old in 1926. He then went up to Jesus College, Cambridge, but was unimpressive in the freshmen's trial match in 1927. However, he was picked for Middlesex against the University team and scored 94 and an unbeaten 42: he was then chosen for the next few university matches but, apart from an 80 that drew comment from Wisden Cricketers' Almanack for slow scoring, did little and failed to win a Blue. He played regularly for Middlesex in the second half of the season.\nThe following season, 1928, he failed again in two early games for Cambridge and again turned to Middlesex, scoring 82 in his second match for the county. Given a further trial at Cambridge, he scored 100 against Surrey and 161 against Sussex, finishing top of the university averages and winning a Blue. In the 1928 season as a whole, he scored 1231 runs, at an average of 38.\nIn 1929, Killick had his most successful season and his only taste of Test cricket. England's selectors experimented with young players in the first two matches of the 1929 series against South Africa, and Killick was picked to partner Herbert Sutcliffe as an opener. In the first match, at Edgbaston, he scored 31 and 23 in a game that ended as a rather more even draw than England had expected. At Lord's, he scored just 3 and 24 as the match was again drawn and he was dropped as England ended the experiment with youth and brought back Frank Woolley and Ted Bowley, a move that helped bring success in two of the remaining three Tests.\nKillick scored 1384 runs at an average of 44 runs per innings in 1929, but played only one first-class match – Gentlemen v Players at Lord's – after the end of the Cambridge season. The next year, 1930, he again played through the Cambridge season, making 903 runs at an average of 47, but then did not appear again.\nAcross the 1930s, as he first studied for the Anglican priesthood and then worked for the Church, he played infrequent first-class cricket, not appearing at all between 1934 and 1938. He reappeared in one match for Free Foresters in 1946, but that was his last first-class game.\nAs an ordained Anglican priest, he was a chaplain at Harrow School and later a vicar near Letchworth. He served in West Africa as an army chaplain in the Second World War and then became vicar of Bishop's Stortford. He died from a heart attack, while playing in an inter-diocesan cricket match between clergy from the St Albans and Coventry dioceses, aged 46.\n\n", "link_mentions": {}}}