{"wiki_id": "http://www.wikidata.org/entity/Q7811817", "itemLabel": "Toby Jepson", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Toby_Jepson", "wikipedia_page": {"main": "Toby Matthew Jepson (born 9 October 1967 in Lincoln, England) is a singer and songwriter, and was lead vocalist and guitarist in the British rock band Little Angels between 1984 and 1994. Between 2008 and 2015, he was the lead singer with Scottish rock band Gun.", "link_mentions": [{"page": "Dio (band)", "response": ["*Toby Jepson – vocals (2011–2012)"]}, {"page": "Download Festival", "response": ["Toby Jepson", "Toby Jepson "]}, {"page": "Gun (band)", "response": ["Fronted by Mark Rankin for their first four albums, the band disbanded in 1997, but reformed in 2008 with Little Angels singer Toby Jepson taking over lead vocals. After recording a new EP in 2009, Jepson left the band the following year, and Dante Gizzi moved from bass to become Gun's new lead singer. With this new lineup, Gun released three more albums in the 2010s: Break the Silence (2012), Frantic (2015) and Favourite Pleasures (2017), which became their first top-20 album since 1994.", "The band split in 1997 and aside from a few one-off reunion gigs in 1998 (Paradise Garage, Lisbon, Portugal) and 1999 (Scotland Rocks for Kosovo charity event), had not been active as a unit before reforming, with Toby Jepson as guest vocalist, for a Rockradio charity gig in January 2008. Two Gun CDs were released (The Collection and The River Sessions – a two-CD set featuring various live performances including some acoustic tracks and  a 3-song set of cover songs from Bowie, Rage Against The Machine, and T-Rex) during their hiatus, and all the previous individual members went on to other projects within the music industry. An official fan site  was set up, in agreement with the band, with previous and current members of the band participating in live web chats and contributing to the forums from time to time.", "===Reformation and Toby Jepson era===", "Toby Jepson previously fronted Little Angels and had a brief spell fronting Fastway as well as releasing solo material and touring as a solo artist. He now fronts rock band Wayward Sons, whose debut release is due out on Frontiers records in September."]}, {"page": "Little Angels", "response": ["Little Angels formed in Scarborough, England in May 1984, under the name of Zeus and then to Mr Thrud in September 1985, settling on Little Angels during recording of the Too Posh to Mosh mini-album at Fairview Studios, Willerby, Hull in 1987. The founding members were Toby Jepson (vocalist), Mark Plunkett (bassist), Dave Hopper (drummer) and the brothers Bruce John and Jimmy Dickinson (guitarist and keyboardist respectively). Michael Lee joined the band to replace Hopper on 16 August 1988.", "Toby Jepson left GUN in June 2010 due to increased responsibility in other aspects of his musical involvement.", "*Official Toby Jepson site"]}, {"page": "Fastway (band)", "response": ["On 25 May 2007, Toby Jepson, former lead singer with Little Angels, announced he had accepted an approach from Fastway to perform lead vocal duties during the year's festival appearances. An updated line-up played the Sweden Rock Festival, Japanese Hard Rock Hell, and the Download Festival at Castle Donington. Besides guitarist Clarke and Jepson, the new band featured drummer Steve Strange (not to be confused with Visage singer Steve Strange) and John McManus (Mama's Boys).", "In an interview with Komodo Rock at the Hard Rock Hell Festival in November 2007, Eddie Clark confirmed that he and Toby Jepson would be working on new material. He said \"Toby and I are going to sit down and maybe do a few tunes over the winter. See if we can write some tunes.\" In 2008, Toby Jepson announced he would go on to front Scottish hard rockers Gun full-time.", "In late 2010, \"Fast\" Eddie Clarke returned to the recording studio to record a new album with Toby Jepson, titled Eat Dog Eat. The album was released on 14 November 2011, by SPV/Steamhammer, and it is the first album of entirely new material from Fastway in over twenty years.", "* Toby Jepson - rhythm guitar(2007-2010)"]}, {"page": "FM (British band)", "response": ["In June 2013 FM played at HiRock, a two-day festival held in Germany at Freilichtbühne Loreley and the Max Aicher Arena in Inzell.  Other artists performing at HiRock included Toto, Rick Springfield, Whitesnake, Journey and Black Star Riders.   Due to adverse weather conditions and extensive flooding in the surrounding area the second day of the festival at Inzell did not take place.  On 27 July 2013 the band were Special Guests at Planet Rock's Steelhouse Festival in Wales followed the next day by a headline show at The River Rooms in Stourbridge with Toby Jepson performing an acoustic set as Special Guest.  During June and July 2013 the band's single \"Story Of My Life\" from Rockville spent several weeks on the BBC Radio 2 playlist.  In December Toby Jepson returned as Special Guest for FM's final headline appearance of the year at a sold-out The Box in Crewe and the band ended the year with a set on the main stage at Planet Rock's Planet Rockstock festival. Their single \"Better Late Than Never\" was added to the BBC Radio 2 playlist on 26 December 2013.", "The second half of 2014 featured FM's 30th Anniversary celebrations.  They headlined Cambridge Rock Festival on Saturday 9 August 2014 with Bernie Marsden joining FM onstage during the encore for a rendition of \"Here I Go Again\". Bernie Marsden joined FM again for the encore at The River Rooms in Stourbridge during their 30th Anniversary Tour in November. The tour also took in shows at Southampton, Cardiff, Bingley, Southend and Holmfirth with special guests including Toby Jepson, Hand Of Dimes and Three Lions. A late cancellation by Vandenberg's Moonkings and a call from the Planet Rock festival organisers resulted in FM rounding off 2014 with a surprise appearance on the main stage at Planet Rockstock on Sunday 7 December.", "FM's eleventh studio album Atomic Generation was released on 30 March 2018 via Frontiers Records (14 March 2018 in Japan). In addition to shows across the UK throughout 2018 - including dates with Dare and Toby Jepson - FM appeared at Frontiers Rock Festival in Milan on 29 April and played the USA for the first time when they headlined at Melodic Rock Fest 5 in Chicago on 6 May, following this with a headline set at the sister festival Melodic Rock Fest Scandinavia in Malmö on 1 June. "]}, {"page": "Toby jepson", "response": ["#REDIRECT Toby Jepson "]}, {"page": "Scarborough Sixth Form College", "response": ["In 2012 the college opened a new study space called \"The Hub\"; it was opened by former students, Howard Wilson and Toby Jepson.", "*Toby Jepson, singer and songwriter"]}, {"page": "Dean Howard (musician)", "response": ["Dean Howard (born 7 May 1961, Greenwich, London) is a guitarist who was part of Ian Gillan's backing band on the Deep Purple frontman's U.S. solo tour in August and September 2006. Dean was working with Toby Jepson (ex Little Angels), and is now with Air Race.", "His post-T'Pau work includes the 2004 album, Volume One, which was written and recorded in two weeks at Rogue Studios, co-written by David Domminney (guitar/vocals), Andres Luengo (drums) and Russell Kennedy (bass) also featured guest vocals from Ian Gillan, Danny Bowes and Toby Jepson.", "*Toby Jepson"]}, {"page": "You're the Voice", "response": ["In November 2019, a single in support of the mental health charity MIND was curated by Planet Rock DJ Wyatt Wendels in conjunction with a 2000-mile charity cycle ride The Road to Rockstock. The limited release CD was then made available from the ride's support vehicle, during late November/early December. The CD features three versions, the main version featuring many well-known rock artists including Alice Cooper, Joe Elliott, Lzzy Hale, Justin Hawkins, Doug Aldrich, Phil Campbell, Bruce Dickinson and Dan Reed. The other versions include the original backing track with Toby Jepson on vocals, and a version with vocals by Joe Elliott. The song will be available as a digital download on 6 December 2019."]}, {"page": "Planet Rock (radio station)", "response": ["Presenters include Def Leppard singer Joe Elliott, who has presented a weekly Saturday evening show at 6pm since June 2010; Thunder singer Danny Bowes presents a weekly show every Sunday from 10am - 12pm and former Little Angels and current Wayward Sons frontman Toby Jepson on Sunday afternoons from 4 - 6pm."]}, {"page": "Tokyo Dragons", "response": ["They split up a year later, playing their final show at the 100 Club in Oxford Street, London on 4 September 2008, in support to Girlschool. Lomax and Bruk then formed a new group, The Sabretooth Tiger Band, with Tom Shotton and Adam Mallett from the defunct band Do Me Bad Things. They played their debut gig on 5 December 2008 at The George Tavern in Whitechapel, London. Lomax subsequently formed The Sweat, who released their debut album, Heavy Sweatin, via Bandcamp.  Martini became the drummer for The Quireboys, whom Tokyo Dragons had supported in 2005, recorded albums in 2010/11 for The Union, a band formed by Luke Morley and Peter Shoulder, then performed and recorded with a number of bands including I Am I, Spear Of Destiny, Joe Elliott's Down 'n' Outz, Alluri and Jim Jones and The Righteous Mind, before joining Wayward Sons, featuring lead singer Toby Jepson, whilst recording albums with Down 'n' Outz and Spear Of Destiny."]}, {"page": "Michael Lee (musician)", "response": ["Lee was found dead in his flat on 24 November 2008, having suffered a fatal epileptic seizure. His funeral took place the following week in his hometown of Darlington, and was attended by former bandmates Toby Jepson and Jimmy Page."]}, {"page": "Guitar, Bass and Drums", "response": ["\"Guitar, Bass and Drums\" is a series of three EPs by the British rock singer, Toby Jepson. Formerly a member of the British rock band, Little Angels, Jepson returned to the music industry in 2007."]}, {"page": "Wayward Son (disambiguation)", "response": ["* Wayward Sons, a band with musician Toby Jepson"]}, {"page": "Ebor Academy Filey", "response": ["* Toby Jepson - founding member of, and vocalist in, hard rock band Little Angels"]}, {"page": "William Rogue", "response": ["In the autumn of 2003 The Blimp were asked to support the Sensational Alex Harvey Band at renowned Glasgow venue, King Tut's Wah Wah Hut.  They would support the band again on their nationwide tour in 2005.  The Blimp supported many other acts including Misty's Big Adventure, Ten Benson and Toby Jepson, and were themselves supported by acts who went on to become more widely known, including The Law and Glasvegas.Scottish Music Centre. Retrieved on 1 August 2008. In the winter of 2007 The Blimp began work on what would be their last studio album, Easy Listening with the High Commissioner.  Released in the summer of the same year, the album's closing number, \"Plastic Fuck Machine\", was deemed unplayable by radio stations, due in part to the song's title but mostly because of George Berry's effect laden drum solo that dominates the track.  The Blimp made their final live appearance at Nice N Sleazy in Glasgow on 14 July 2007."]}, {"page": "Jam (album)", "response": ["* Toby Jepson – vocals, guitar"]}, {"page": "Call to Arms (Saxon album)", "response": ["* Toby Jepson - producer"]}, {"page": "Eat Dog Eat", "response": ["Eat Dog Eat is the seventh and final studio album by British hard rock band, Fastway. Released 21 years after their previous album, Bad Bad Girls, Eat Dog Eat features a new band line-up including vocalist Toby Jepson, previously of Little Angels and Gun. Leave The Light On was released as a single on 19 March 2012. This turned out to be the band's final studio album as frontman and guitarist \"Fast\" Eddie Clarke died six years later, aged just 67 from Pneumonia, on 10 January 2018.", "All tracks composed by Fast Eddie Clarke and Toby Jepson", "*Toby Jepson – Lead vocals, Bass guitar, Acoustic guitar"]}, {"page": "The Virginmarys", "response": ["The band formed as a trio in Macclesfield in 2009. The band spent much of their early years touring extensively; they first played the Download Festival in 2010, and have toured as support act to Slash, Shinedown, Terrorvision, Skunk Anansie, Eagles of Death Metal, The View, Ash, Feeder, Queens Of The Stone Age and We Are Scientists, as well as playing their own headline gigs throughout UK, Europe, US and Japan.  The band released a series of self-financed E.P.s during this period, and recorded their first mini-album, Cast the First Stone, in 2010, produced by Toby Jepson and mixed by Mike Fraser.", "In late 2011 the band, started work on their debut full-length album, again with Toby Jepson as producer (Chris Sheldon mixed the album), and continued to tour. They wanted the freedom to make their own album and in 2012 they announced record deals with both Double Cross / Cooking Vinyl (in Europe), Wind Up Records (United States) and Hydrant Music (Japan). The debut album, titled King of Conflict, was released on 4 February 2013. On 14 November 2013 they were named Best Breakthrough act at the 2013 Classic Rock Awards."]}, {"page": "King of Conflict", "response": ["* Toby Jepson – producer"]}, {"page": "New Horizon (The Answer album)", "response": ["New Horizon is the fourth studio album by Northern Ireland rock band The Answer. The album, which was released on 30 September 2013, was produced by Little Angels frontman Toby Jepson and features artwork from the legendary designer Storm Thorgerson, who was working on the cover shortly before his death in April 2013. New Horizon is the band's first album with Napalm Records, with whom they signed the previous year.", "* Toby Jepson — production"]}, {"page": "Raising My Own Hell", "response": ["Raising My Own Hell is an EP released by British recording artist Toby Jepson on 2 December 2013.  The tracks were all recorded in Scarborough at Jepson's home studio and feature Jepson on vocals and guitars, Dave Kemp on saxophone and accordion, Matt E on drums and Roger Davies on bass."]}, {"page": "Jepson (surname)", "response": ["* Toby Jepson (born 1967), English musician and actor"]}]}}