{"wiki_id": "http://www.wikidata.org/entity/Q7811866", "itemLabel": "Toby Philpott", "itemDescription": "British entertainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Toby_Philpott", "wikipedia_page": {"main": "Toby Philpott (born 14 February 1946) is an English puppeteer best known for his work in motion picture animatronics during the 1980s in such films as The Dark Crystal and Return of the Jedi. Born into a family of entertainers, Philpott dropped out of school and traveled the world during the 1960s, squatting in various locations and surviving off money he earned from his work as a street performer, which included juggling, fire eating, magic shows, clowning and acrobatics. He began his film career after Jim Henson personally selected Philpott to work on the 1982 fantasy film The Dark Crystal, in which he worked side-by-side with Henson.\nThe next year, Philpott was approached to serve as one of the puppeteers controlling Jabba the Hutt in Return of the Jedi. Philpott controlled the left arm, head, tongue and body of the giant Hutt puppet. Philpott would lend his puppetry skills to other such movies as The Company of Wolves (1984), Labyrinth (1986), Little Shop of Horrors (1986) and Who Framed Roger Rabbit (1988) before leaving the film industry. Reflecting upon his movie career, Philpott describes himself as a \"street juggler that got lucky\".", "link_mentions": [{"page": "Return of the Jedi", "response": ["Jabba the Hutt was operated by Toby Philpott, David Barclay and Mike Edmonds (who also portrays the Ewok Logray) operated the tail. Larry Ward portrays the Huttese language voice with Quinn, among other roles, controlling the eyes. Barclay, Quinn, and David Greenaway assisted Frank Oz in performing Yoda."]}, {"page": "Who Framed Roger Rabbit", "response": ["* Toby Philpott"]}, {"page": "1986 in film", "response": ["| Labyrinth || TriStar Pictures / The Jim Henson Company / Lucasfilm || Jim Henson (director); Terry Jones (screenplay); David Bowie, Jennifer Connelly, Toby Froud, Christopher Malcolm, Shelley Thompson, Natalie Finland, Michael Moschen, Brian Henson, Ron Mueck, Dave Goelz, David Barclay, David Shaughnessy, Karen Prell, Timothy Bateson, Frank Oz, Michael Hordern, Denise Bryer, Steve Whitmire, Anthony Jackson, Kevin Clash, Douglas Blackwell, Anthony Asbury, David Healy, Robert Beatty, Toby Philpott, Charles Augins, Cheryl Henson, Danny John-Jules, Richard Bodkin, Percy Edwards, Don Austen, Ronnie Le Drew, Kathryn Mullen, Nigel Plaskitt, Michael Quinn, David Rudman, Robin Stevens, Mak Wilson, Francis Wright, Sean Barrett, John Bluthal, Steve Nallon, Jan Ravens, Enn Reitel, Kerry Shale, Kenny Baker, Warwick Davis, Malcolm Dixon || Adventure, Fantasy, Musical || Live action / Puppetry", "| Little Shop of Horrors || Warner Bros. Pictures / The Geffen Film Company || Frank Oz (director); Howard Ashman (screenplay); Rick Moranis, Ellen Greene, Vincent Gardenia, Steve Martin, Jim Belushi, John Candy, Christopher Guest, Bill Murray, Tichina Arnold, Michelle Weeks, Tisha Campbell, Levi Stubbs, Miriam Margoyles, Stanley Jones, Mak Wilson, Danny John-Jules, Heather Henson, Vincent Wong, Kerry Shale, Anthony Asbury, Brian Henson, Mak Wilson, David Barclay, Marcus Clarke, Toby Philpott, Don Austen, William Todd-Jones, Michael Quinn, James Barton, Ronnie Le Drew, Danny Cunningham, Gary Palmer, Paul Swaby, Robert Tygner, Sue Dacre, Paul Springer, David Greenaway, Michael Bayliss, Michael Barclay, Chris Leith, Terry Lee, Ian Tregonning, John Alexander, James Barton, Graham Fletcher || Musical, Horror, Black Comedy || Live action / Puppetry"]}, {"page": "1982 in film", "response": ["| The Dark Crystal || Universal Pictures / Associated Film Distribution / Henson Associates / ITC Entertainment || Jim Henson, Frank Oz (directors); David Odell (screenplay); Stephen Garlick, Lisa Maxwell, Billie Whitelaw, Percy Edwards, Barry Dennen, Michael Kilgarriff, Jerry Nelson, Steve Whitmire, Thick Nelson, Brian Muehl, John Baddeley, David Buck, Charles Collingwood, Sean Barrett, Toby Philpott, Joseph O'Conor, David Greenaway, Jean Pierre Amiel, Hugh Spight, Robbie Barnett, Swee Lim, Simon Williamson, Hus Levant, Miki Iveria, Patrick Monckton, Sue Weatherby || Adventure, Family, Fantasy || Live action "]}, {"page": "Labyrinth (1986 film)", "response": ["|with David Barclay & Toby Philpott"]}, {"page": "List of Star Wars characters", "response": ["| Mike Edmonds, Dave Barclay, Toby Philpott and John Coppinger  (Return of the Jedi)Voice: Larry Ward (Return of the Jedi), Scott Schumann (The Phantom Menace), Kevin Michael Richardson (The Clone Wars)"]}, {"page": "The Dark Crystal", "response": ["* Toby Philpott as urTih/The Alchemist: The Mystic counterpart of skekTek."]}, {"page": "Little Shop of Horrors (film)", "response": ["** Anthony Asbury, Brian Henson, Mak Wilson, Robert Tygner, Sue Dacre, David Barclay, Marcus Clarke, Paul Springer, David Greenaway, Toby Philpott, Michael Bayliss, Michael Barclay, Don Austen, Chris Leith, William Todd-Jones, Terry Lee, Ian Tregonning, John Alexander, Michael Quinn, James Barton and Graham Fletcher were all principal puppeteers for Audrey II."]}, {"page": "List of Star Wars cast members", "response": ["| David BarclayToby PhilpottMike Edmonds"]}, {"page": "A. R. Philpott", "response": ["Panto's son Toby Philpott from his first marriage (to the actress and voice teacher Sheila Moriarty) worked with Jim Henson as an animatronic puppet operator, on The Dark Crystal and Labyrinth, and formed part of the team inside the original Jabba the Hutt (before CGI took over)."]}, {"page": "Characters and races of The Dark Crystal", "response": ["* urTih the Alchemist (performed by Toby Philpott) - He was described as a manipulator of states of matter. urTih spontaneously combusts when his Skeksis counterpart skekTek falls to his death in a fiery pit."]}, {"page": "Jabba the Hutt", "response": ["In Return of the Jedi, Jabba is portrayed by a one-ton puppet that took three months and half a million dollars to construct. While filming the movie, the puppet had its own makeup artist. The puppet required three puppeteers to operate, making it one of the largest ever used in a motion picture. Stuart Freeborn designed the puppet, while John Coppinger sculpted its latex, clay, and foam pieces. Puppeteers included David Alan Barclay, Toby Philpott, and Mike Edmonds, who were members of Jim Henson's Muppet group. Barclay operated the right arm and mouth and read the character's English dialogue, while Philpott controlled the left arm, head, and tongue. The tongue was a light beige color and came out of Jabba’s mouth several times. When he encountered Leia Organa for the first time and enslaved her, he extended his tongue and licked at her face. The reason Leia reacted with such disgust upon seeing the tongue, was because in one take, Philpott moved the tongue closer than Carrie Fisher was comfortable with, and it licked her unintentionally. Edmonds, the shortest of the three men (he also played the Ewok Logray in later scenes) was responsible for the movement of Jabba's tail. Tony Cox, who also played an Ewok, would assist as well. The eyes and facial expressions were operated by radio control.", "Jabba the Hutt was played by Declan Mulholland in scenes cut from the 1977 release of Star Wars. In Mulholland's scenes as Jabba, Jabba is represented as a rotund human dressed in a shaggy fur coat. George Lucas has stated his intention was to use an alien creature for Jabba, but the special effects technology of the time was not up to the task of replacing Mulholland. In 1997, the \"Special Edition\" re-releases restored and altered the original scene to include a computer generated portrayal of Jabba. In Return of the Jedi, he was played by puppeteers Mike Edmonds, Toby Philpott, David Alan Barclay and voiced by Larry Ward. Jabba was voiced by Scott Schumann in post-1997 editions of Star Wars and in The Phantom Menace. In The Phantom Menace end credits, Jabba was jokingly credited as playing himself. His puppeteers have appeared in the documentaries From Star Wars to Jedi: The Making of a Saga and Classic Creatures: Return of the Jedi. David Alan Barclay, who was one of the puppeteers for Jabba in the film, voiced Jabba in the Super NES video game adaptation of Return of the Jedi. In the radio drama adaption of the original trilogy, Jabba is played by Ed Asner. In the film Star Wars: The Clone Wars and the following television series, Jabba is portrayed by Kevin Michael Richardson. All other video game appearances of Jabba were played by Clint Bajakian. Jabba was supposed to appear in Star Wars: The Force Unleashed, but was left out due to time constraints. A cutscene was produced featuring a conversation between Jabba and Juno Eclipse (voiced by Nathalie Cox), which was scrapped from the game. He appears in the Ultimate Sith Edition."]}, {"page": "Philpott", "response": ["* Toby Philpott (born 1946), English puppeteer, son of A. R. Philpott"]}, {"page": "List of Star Wars film actors", "response": ["| David BarclayToby PhilpottMike EdmondsLarry Ward"]}, {"page": "For the Love of Sci-Fi", "response": ["| 4–6 December 2015 || Bowlers Exhibition Centre, Manchester || Dave Prowse, Garrick Hagon, Toby Philpott, Michael Carter, Simon Williamson, Femi Taylor, Alan Ruscoe, Pam Rose, John Simpkin, Michael Henbury, Barrie Holland, Anthony Forrest, Chris Bunn, Laurie Goode, Nick Joseph, Chris Muncke, Peter Roy, Alan Flyng, Paul Markham, Ted Western, Stephanie English, Brian Muir, Shaun Harrison"]}]}}