{"wiki_id": "http://www.wikidata.org/entity/Q7822578", "itemLabel": "Tony Hirst", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Hirst", "wikipedia_page": {"main": "Anthony Hirst (born 21 January 1967) is an English actor, theatre director and narrator best known for playing Mike Barnes on the soap opera Hollyoaks and in Coronation Street as Paul Kershaw, the love interest of Eileen Grimshaw. Hirst also narrates the UK version of How It's Made, shown on Quest and the Discovery channels, and various programmes for Channel 4.\n\n", "link_mentions": [{"page": "Daz (detergent)", "response": ["Other episodes have a character who do not use Daz which causes them problems, which are solved by a character who uses Daz. Cleaner Close is a parody of Coronation Street, Brookside or EastEnders. Most of the adverts feature ex-soap stars, sometimes portrayed as a similar character to the one they played in their original soap, and are narrated by Tony Hirst; who would later star in both Hollyoaks and Coronation Street. Soap stars or ex-soap stars to have appeared in Cleaner Close include: Michelle Collins (Cindy Beale in EastEnders, Stella Price in Coronation Street), Alison King (Carla Connor in Coronation Street), Chris O'Dowd (Brendan Davenport in The Clinic), Jennifer Ellison (Emily Shadwick in Brookside) and Julie Goodyear (Bet Lynch in Coronation Street)."]}, {"page": "Rovers Return Inn", "response": ["On 18 March 2013, Karl Munro (John Michie) set fire to the pub's cellar to frame Jason Grimshaw (Ryan Thomas) but was caught by Sunita Alahan (Shobna Gulati) who was knocked unconscious by Karl when he fled to the Bistro to do his \"Full Monty\" act. Norris Cole (Malcolm Hebden) and Emily Bishop (Eileen Derbyshire) came into the restaurant to tell everyone about the fire, and Karl discovered Stella was upstairs in one of the pub's bedrooms so he went back in to save her.  As he got to her, the stairs collapsed, trapping them. Luckily Paul Kershaw (Tony Hirst) managed to get to them and got Stella out while his friend and fellow-firefighter Toni Griffiths (Tara Moran) got Karl out before the roof collapsed on top of her and killed her. Shortly afterwards the fire brigade arrived, put out the fire and were able to get Sunita out. The fire caused significant damage and caused financial problems for Stella meaning that she could not afford to hire Owen Armstrong (Ian Puleston-Davies) to do the refurb but after a failed attempt of offering Owen half the pub in exchange for the refurb, Stella's mother Gloria (Sue Johnston) paid him the £80,000 required to complete the work. Sunita was in a coma for a while and was killed by Karl when she began to recover. The Rovers re-opened on 26 May 2013."]}, {"page": "Eileen Grimshaw", "response": ["Eileen Grimshaw (also Phelan) is a fictional character from the British ITV soap opera Coronation Street. Portrayed by Sue Cleaver, the character first appeared on-screen during the episode airing on 3 May 2000. Her storylines have often included her relationships with Dennis Stringer (Charles Dale), Ed Jackson (Chris Walker), Pat Stanaway (Sean Hughes), Jerry Morton (Michael Starke), Jesse Chadwick (John Thomson), Paul Kershaw (Tony Hirst), Adrian Mortimer (Mark Moraghan) and Michael Rodwell (Les Dennis), as well as her marriage to serial criminal mastermind Pat Phelan (Connor McIntyre).", "Eileen meets Paul Kershaw (Tony Hirst), a fireman, when her head is caught in the railings on her birthday on Underworld's roof. They start dating, but Marcus sees Paul with another woman in Freshco's, making Eileen angry so she visits Paul to demand answers and Paul's wife, Lesley (Judy Holt), answers the door. Eileen shouts at Lesley but she is confused. Paul comes to the door and tells Lesley to go inside, explaining to Eileen that Lesley has Alzheimer's disease, which explained why she didn't understand Eileen's question. Eileen and Paul stay friends and Paul helps Eileen when Eileen told Sunita that she would get somebody for the local school's safety day. Eileen invites Paul and Lesley to her house for Christmas dinner but they pull out after Lesley has a fall. Eileen goes on a speed dating night at Nick Tilsley's (Ben Price) Bistro and meets a man called Hank. They soon argue which ends up in Eileen pushing Hank into the fire alarm. Paul comes to the scene expecting a fire but Eileen asks him for a drink. One day, Paul asks Eileen if she would take care of Lesley while he is at work. Eileen does so, but she later regrets it when Lesley beats her up and physically throws her out of her own home. Jason takes Eileen to the café to calm down, but while she is at the café, Lesley dies after being electrocuted by the toaster. After Lesley's funeral, Paul and Eileen become a proper couple. Eileen becomes suspicious that Paul is having an affair with his work colleague Toni, but he is actually planning a romantic proposal. Paul walks out and goes to The Rovers soon followed by Eileen who asks for forgiveness. Paul gets down on one knee and asks her to marry him."]}, {"page": "Fiz Brown", "response": ["Fiz's trial begins and she provides her evidence before the jury leave to consider their verdicts. Fiz is found not guilty of the murders of Joy and Charlotte Hoyle (Becky Hindley), but the jury find her guilty of Colin's murder. Fiz later learns that John has returned, but is in a critical condition in hospital after his car accident. Fiz goes to the hospital and tells John that she forgives him for everything he has done. John gives the police his statement and he then dies from his injuries. Fiz then breaks down in tears and whispers to him that he will always be \"her John\". Unfortunately, John was too late. Fiz is sentenced to life imprisonment, with a minimum term of 15 years. Fiz and Chesney are devastated. Fiz asks Chesney to organise John's funeral. He initially refuses, but after his girlfriend, Katy Armstrong (Georgia May Foote), convinces him to, he agrees. Chesney later receives a phone call from Fiz saying that she has been granted bail before her review. Fiz later begins a feud with Kirsty Soames (Natalie Gumede) after she nearly slices Fiz's fingers off at work using a sewing machine. When Kirsty later attacks Fiz in her own home, Fiz realises that Kirsty is beating up her fiancé Tyrone. Fiz helps Tyrone through his dilemma with Kirsty but ends up developing feelings for him and they begin an affair. When Kirsty beats up Tyrone again, Fiz advises Tyrone to marry Kirsty so he can gain custody of his daughter Ruby. Kirsty accepts Tyrone's proposal but discovers Fiz and Tyrone's affair the day before the wedding. She humiliates the pair at the church, as many of the residents watch as Kirsty reveals Fiz is Tyrone's mystery lover. During an argument at the top of the stairs, Kirsty attempts to hit Tyrone again but ends up falling down the stairs. Fiz, Tommy Duckworth (Chris Fountain), Eileen Grimshaw (Sue Cleaver), Sean Tully (Antony Cotton) and Paul Kershaw (Tony Hirst) race round to the house to see what has happened, and Kirsty tells the police that Tyrone has been abusing her for months. Tyrone is arrested, which devastates Fiz. Tyrone's court hearing arrives, and Kirsty's mother Alison (Dawn Hope) tries to persuade Kirsty to tell the truth, but she refuses. After Kirsty assaults Julie, Kirsty confesses to the jury that she has been beating Tyrone. Tyrone is freed and Kirsty is sent to prison."]}, {"page": "How It's Made", "response": ["In the United Kingdom, the rest of Europe, and in some cases in Southeast Asia, the series is narrated by Tony Hirst."]}, {"page": "List of former Hollyoaks characters", "response": ["|Mike Barnes || Tony Hirst || 2006–2010, 2016–2017"]}, {"page": "Jack Osborne", "response": ["Jack provides a home for the Dean family after their eviction from their home. After first being sceptical, he soon warms to the family. Jack then begins a relationship with Frankie Dean (Helen Pearson) after the collapse of her marriage to her husband Johnno (Colin Wells), and the couple later marry, after five years being a widower following the death of his wife, Jill. Frankie's three children Jake, Debbie and Craig accepted him as a new father, however Steph will never accepted him as her new father and refused to be close with him, causing Frankie and Steph's siblings angry at her, but, they understand that she remain close to her father Johnno.  The nadir was when the Dog was destroyed in an explosion Jack and Frankie were out for a meal when the Dog exploded and Jack and Frankie nearly lost Darren, Steph, Craig, and Jake as they were trapped inside the pub when it exploded and caught fire. While they used insurance money to rebuild the pub, they stayed at a grimy bed and breakfast where the owner constantly treated them poorly. They were kicked out, and briefly lived with the McQueen family until finally Frankie could take no more and forced Jack to use the insurance money he had been pocketing to pay for a nice hotel until they could go back to their apartment. Jack and Frankie decide to start fostering disadvantaged adolescents. They first foster Barry \"Newt\" Newton (Nico Mirallegro). Darren (now played by Ashley Taylor Dawson) sells Frankie's jewellery to a pawn shop, and blames it on Newt. After Jack threatens to send him back into care, Darren is finally caught out. Darren develops a gambling addiction. During a game of poker with Mike Barnes (Tony Hirst), Tony Hutchinson (Nick Pickard) and Warren Fox (Jamie Lomas), he bets his half of The Dog, which Warren wins. After finding this out, Jack suffers a heart attack and Darren is told to leave the house. Warren then signs his half of The Dog over to Jack again for a low price. Despite this low price, Jack goes through money worries, and begins to water down drinks. An inspector finds this out and declares he is to take him to court. Seeing no other way, Jack decides to commit suicide so his family can claim his life insurance money. However, Darren stops him. They then discover the body of Eamon Fisher (Derek Halligan). Darren tells Jack that they could fake his death, claiming Jack is the deceased body. Jack goes along with this and his family are horrified at his apparent death. Frankie discovers Jack is alive and the pair agree to flee to Spain. Niall Rafferty, the secret son of Myra McQueen, finds out Jack is still alive and hiding in the attic of The Dog. Niall's father Martin was arrested and sent to prison by Jack. He later died. Niall attacks Jack, holding him responsible for it. He then confesses he is Myra's son and that he is going to kill his family. Jack then alerts Darren as the pair rush to find them. Tony and Dominic Reilly (John Pickard), who are also trying to find the McQueens, who are shocked, and angry, to see Jack. The four head to an abandoned church. Jack bursts in and tells Niall it is over, however Niall detonates explosives, which eventually kills Tina Reilly (Leah Hackett). Jack is then arrested and Darren admits he knew of the fake death. They are both imprisoned. During his time in prison, the Osbornes are forced to sell The Dog to the Ashworth family."]}, {"page": "Josh Ashworth", "response": ["The following week Amy missed school and had her baby which she called Leah, while Josh was off sick because of the flu. When he recovered he and Fletch set up a party. Josh wanted to invite Amy, but could not find her. He did, however manage to invite Amy's best mate, Michaela. Amy tried texting him but he didn't receive any of her messages. Fletch gave Josh a condom and told him to get lucky with some other girls but Josh only wanted Amy. Amy later arrived with Michaela and started drinking heavily because of her problems with Leah. Josh went up to talk to her and Amy asked him why he did not answer her texts. She then asked him to go upstairs with her to his room and forced herself on him, but Josh did not want to take advantage of her in the drunken state she was in. Just then Michaela burst into his room and assumed Josh had tried to have sex with Amy while she was drunk. She took Amy home, leaving a confused Josh behind. The following day he tried to text and phone Amy to see if she was all right but she was busy dealing with a health visitor. Amy and Josh made up with each other, and started spending more time together, after reading Amy's diary her father Mike Barnes (Tony Hirst) came to school and dragged Amy home, mistakenly believing that Josh was the father of baby Leah. He then dragged her to get the pill, despite Amy protests that she and Josh hadn't slept together and then banned them from seeing each other. Meanwhile, at school Sarah had a talk with Josh and believed him when he told her he hadn't slept with Amy. The following day at school Amy told Josh what had happened and they noticed Mike walking around school. They then decided to cut classes and Amy sold her bracelet and Josh his guitar so they could go on an expensive date together. Then they went to a party at Il Gnosh where Mike confronted Amy infont of everyone and dragged her home. The next day Josh went round to the Barnes' house, where the pair found Mike's home brew, and stole some, getting drunk as it was much stronger than they had believed it to be."]}, {"page": "The Price Is Right (British game show)", "response": ["On 30 December 2017, the revival was a one-off pilot filmed at Dock10 studios that aired as a Christmas special on Channel 4 hosted by Alan Carr and was announced by Tony Hirst. According to a press release by FremantleMedia, Carr said \"I'm so excited to be the new host of The Price is Right. It's proper bucket list territory for me as I loved it when I was growing up and now for me to be at the helm of such a legendary show is a dream come true. It just leaves me with one thing to say … COME ON DOWN!\". Viewers had praised Carr's hosting ability as they took it to Twitter by demanding it to become a full series. However, it has been declined since then.", "*Tony Hirst"]}, {"page": "Lloyd Mullaney", "response": ["In July 2013, Lloyd and his family enter the pub and overhear Paul Kershaw (Tony Hirst) make a possibly racist comment whilst playing darts. This causes a rift between Lloyd's family and Paul but Paul's partner, Eileen Grimshaw, is trapped between the two as Lloyd is her colleague and one of her best friends. The argument between the two sides continue, with Eileen determined to end the feud. Sophie, who is involved with Jenna, contacts the fire service where Paul works and makes a formal complaint about his racist remark. Paul finds this out via his manager and believes Lloyd made the complaint as an act of revenge, trying to get him sacked from his job. He subsequently finds Lloyd near the pub, pins him up against the wall and hits him. Jenna is walking across the street and noticed and she subsequently tells Paul that it was Sophie who made the complaint. However, the police are present as they had been called by Nick Tilsley (Ben Price) to investigate problems at his bar. Nick's wife, Leanne, tells the police they are not needed, so they divert their attention to Paul and Lloyd and they take Paul down to the station for questioning due to his violent behaviour. Finally, Paul gives in and apologises to Lloyd, but there is still tension between the two. Mandy and Lloyd's relationship is almost as shaken by Eileen and Paul's. Events escalate and Lloyd and Mandy split."]}, {"page": "Hollie-Jay Bowes", "response": ["Bowes' parents changed her name from Billie Jean to Hollie Jean as her father thought she would get bullied at school and be called 'Billie Bowes', and at 13, she changed her name to Hollie-Jay. In 2009, Bowes stated in an interview with Inside Soap that she is a distant relation to Hollyoaks co-star Tony Hirst, who plays Mike Barnes.Inside Soap, 28 July 2009"]}, {"page": "Myra McQueen", "response": ["Myra's niece, Theresa moves in with her. She then develops an unwelcome crush on Mike Barnes (Tony Hirst) and later sleeps with Archie Carpenter (Stephen Beard). When her sister Kathleen McQueen (Alison Burrows) arrives comes to see Theresa, Myra lets her stay for Theresa's sake. Kathleen uses Tina's old credit cards for money, when Myra finds out she forces Theresa to choose between her mum and relatives, Theresa chooses her relatives. Theresa shoots Calvin dead. The rest of the family keep it a secret from Myra, when she eventually discovers the truth she is hurt that no one told her. Myra's cousin Victor agrees to let his son Bart live with Myra, after his wife dies. Myra saves the life of Alistair Longford (Terence Harvey), a rich pensioner. He assumes Cindy Cunningham (Stephanie Waring) has saved him and gives her money. Cindy becomes engaged to him, so Myra and Jacqui blackmail her for money and the role of her wedding planners. The money is later stolen and Jacqui accuses Bart. Myra defends him and Jacqui tells Myra she will move out if she doesn't believe her. She sides with Bart and loses Jacqui."]}, {"page": "Kathy Barnes", "response": ["Kathy met Mike Barnes (Tony Hirst) at a young age and fell in love. Kathy discovered she was pregnant with Sarah (Loui Batley). She and Mike pondered whether to put Sarah up for adoption, but decided to keep her. The pair then married. Kathy was born in 1973; however, in 2006, she celebrated her 40th birthday. This was due to SORAS."]}, {"page": "Mike Barnes (Hollyoaks)", "response": ["Mike Barnes is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Tony Hirst. He first appeared on 9 January 2006. In 2010, soap opera magazine Inside Soap reported that the character would leave in late January with love interest Zoe Carpenter (Zoë Lister).Moon, Katy (5 January 2010). \"Who's in? Who's out?\". Inside Soap, Issue 1: 9–15 January 2010. Retrieved 2010-01-05. This was later confirmed. The character briefly returned in August 2016 and again in March 2017, where his youngest daughter Amy Barnes (Ashley Slanina-Davies) was killed off in a \"whodunit\" storyline. He returned again in September 2017 giving evidence against Ste Hay (Kieron Richardson) during Amy's murder trial."]}, {"page": "Sarah Barnes", "response": ["Sarah's parents Mike (Tony Hirst) and Kathy Barnes (Sarah Jane Buckley) struggled to cope with Kathy got pregnant with Sarah, as the two were still teenagers at the time. They discussed putting her up for adoption, but Mike became attached to Sarah after her birth and the couple decided to keep her. They later had another daughter named Amy."]}, {"page": "Amy Barnes", "response": ["In January 2017, it was announced that the show planned to kill Amy off. Kilkelly from Digital Spy reported that Amy's partner Ryan would return home and find her dead in a \"devastating\" and \"dark\" storyline. He added that the storyline would create dramatic scenes involving Amy's relatives. Slanina-Davies made her final appearance as Amy on 29 March 2017, where her body was discovered by Ryan and her father Mike Barnes (Tony Hirst).", "Amy first appears being dragged to her sister Sarah Barnes' (Loui Batley) swimming training, where she is bored and jealous of Sarah's success. Amy befriends Michaela McQueen (Hollie-Jay Bowes), Jamie \"Fletch\" Fletcher (Sam Darbyshire) and Josh Ashworth (Sonny Flood) and begins a relationship with Ste Hay (Kieron Richardson). Ste manipulates Amy into sleeping with him, resulting in their eventual break-up. On her 15th birthday, Amy meets a boy called Billy, who she has a one-night stand. Michaela supports Amy upon Amy discovering her pregnancy. Amy and Ste reunite and he takes her joyriding, which leads to a crash, culminating in Ste fleeing and Amy is partially injured. Amy dumps Ste to date Josh despite her father Mike Barnes (Tony Hirst) disapproving of them. They decide to flee Hollyoaks together however, after weeks, the couple decide to return home. Josh attacks Mike with a house brick, which ends Josh's relationship with Amy. She develops labour and delivers her daughter, Leah Barnes (Ela-May Demircan) on her kitchen floor, to the surprise of Sarah and Mike. Amy's mother Kathy Barnes (Sarah Jane Buckley) decides to raise Leah as her own child, ashamed of her daughter's underage pregnancy. However, Amy grows close to Leah and decides she wants to be her mother. Kathy kidnaps Leah and is eventually sectioned."]}, {"page": "Michaela McQueen", "response": ["Michaela begins a friendship with Amy's father, Mike Barnes (Tony Hirst). Michaela eventually develops a crush on him, and is jealous when he begins a relationship with Zoe Carpenter (Zoë Lister). Michaela throws herself at Mike, and is turned down. That night, Myra finds a note supposedly from Michaela saying she is going to London on a journalism course, unaware she has actually been kidnapped by Niall. Myra soon discovers notes from all her children, and finds them tied up by Niall in a church. Niall makes Myra choose two children to live, and tells her he will kill the rest. Myra chooses Michaela and Tina Reilly (Leah Hackett). However, Niall detonates explosives and Tina is eventually killed."]}, {"page": "Warren Fox", "response": ["Following a poker game with Tony Hutchinson (Nick Pickard), Mike Barnes (Tony Hirst) and Darren Osborne (Ashley Taylor Dawson), Warren ends up winning Darren's half of The Dog. Warren tells Louise he has bought her The Dog for Christmas. When they inform Jack (Jimmy McKenna) and Frankie Osborne (Helen Pearson) that they now own a half of The Dog, Jack suffers a heart attack. As Jack recovers, Frankie goes through the unpleasantness of having to share The Dog with Warren and Louise. Warren's old friends appear at The Dog and hold everyone hostage, which ends with Darren getting shot. Louise feels she cannot trust Warren anymore, but forgives him when he signs back his half of The Dog to the Osbornes. Newt (Nico Mirallegro) and Lauren Valentine (Dominique Jackson) find Sean's body, and Warren confesses to Louise that he killed him. Louise is furious, but becomes more angry when she finds out Katy knew. Louise then exposes Katy and Zak Ramsey's (Kent Riley) affair to Warren. Katy is angry when Louise agrees to become an alibi for Warren on the night of Sean's death as she does not want him to go to prison. Katy tells Warren to admit to the murder but he refuses. Katy decides to leave, but is dragged from a taxi by Louise and Warren. After Warren attempts to convince Katy to stay, she leaves. Louise is later arrested for Sean's murder. Warren and Darren persuade mentally unstable Jake Dean (Kevin Sacre) to confess to Sean's murder, to which he does. Louise is then released."]}, {"page": "Gilly Roach", "response": ["Whilst at a boot camp trip with Steph and Fernando, Steph believes Gilly has feelings for Sarah, and is unaware his feelings are for her. During the trip, after Steph, Fernando and Gilly leave, Sarah is killed in a tragic parachute jump. Gilly writes a poem for Steph, and in it, offends Fernando. When Steph reads it she is angry at Gilly, who tells her it is Rhys who has the feelings for her. Fernando punches Rhys as Gilly convinces Steph he had nothing to do with the poem. In order to make Steph jealous, Gilly kisses Cheryl Brady (Bronagh Waugh), who is trying to make Calvin jealous. Despite using him, Cheryl develops true feelings for Gilly. Frankie Osborne (Helen Pearson) works out that Gilly is in love with Steph. However, Gilly denies it, saying that he loves Cheryl. Cheryl catches Gilly looking at an engagement ring, which Fernando has bought for Steph. She assumes the ring is for her and tells everyone in The Dog in the Pond that she and Gilly are getting married. Gilly reluctantly goes along, not wanting to hurt her feelings. Cheryl notices the growing closeness between Gilly and Steph and confronts him. On discovering he is in love with Steph, she breaks off their engagement, at the same time Steph and Fernando break up. Gilly goes travelling with Zoe Carpenter (Zoë Lister) and Mike Barnes (Tony Hirst). Steph, after being told about Gilly's feelings for her, rushes after him to admit her love just as Gilly leaves. Gilly returns on 5 March with his girlfriend, Jem Costello (Helen Russell-Clark). Steph is upset when he proposes to Jem. Steph admits her feelings to Gilly, but he decides to stay with Jem. Rhys tells Jem that Gilly still loves Steph causing them to split up. Gilly and Steph finally confess their true feelings to each other and begin a relationship."]}, {"page": "Zoe Carpenter", "response": ["The culmination of the plot saw Lydia stab Zoe. The storyline was described as a \"brutal attack\" and at the time producers refused to reveal if Zoe would survive. Describing the terror Lydia causes for Zoe, a spokesperson for the serial stated: \"Zoe can’t believe it when Lydia admits the parachute was meant for her. As soon as she realises Lydia wanted her dead she tries to run. That’s when Lydia pulls out a knife and stabs her.\" This led to a fight between Lydia and Charlotte who arrives with Dave Colburn (Elliot James Langridge). They both fight to grab the knife while an unconscious Zoe bleeds, ultimately leading to the arrest of Lydia when the police arrive. She is later charged with the murder of Sarah and the attempted murder of Zoe. Several weeks after the character was stabbed, she was seen feeling as if no one wanted to be in her company. After three of her longtime friends snubbed her ideas to make a fresh start elsewhere, ultimately she was she went travelling with her former boyfriend Mike Barnes (Tony Hirst) and Gilly Roach (Anthony Quinlan).", "Sarah Barnes (Loui Batley) invites Zoe to move in with her, however her father Mike Barnes (Tony Hirst) is angry to find Zoe using Sarah's sister Amy's (Ashley Slanina-Davies) bedroom. When Mike's wife, Kathy (Sarah Jane Buckley), begins to suspect an affair between Zoe and Mike, and throws all Zoe's clothes out into the street. Mike then asks Kathy to move out. He and Zoe sleep together, unknowingly recorded by Amy's boyfriend Ste Hay (Kieron Richardson), who exposes them. Sarah lashes out at Mike and Zoe. She flaunts her older boyfriend Roger Kiddle (Quentin Tibble) in Mike's face, which backfires when Roger makes a pass at Zoe and they become an official couple. Sarah is able to forgive Zoe, and comforts her when she has a pregnancy scare. Mike is very upset about the idea of Zoe being pregnant.", "In 2008, Lister's role as Zoe saw her nominated for the \"Sexiest Female\" award at The British Soap Awards, however she lost to co-star Roxanne McKee. Lister was asked in an interview if she was disappointed to not win the award. She replied: \"Not at all! It was lovely to be nominated, and also a bit hilarious, but beyond that, I wasn't desperate to win. I really wasn't bothered! I was more than happy that Roxanne [McKee] won it — and I guessed she might do anyway.\" When Zoe's affair with Mike Barnes (Tony Hirst) began, there was some controversy over the storyline, due to the age gap between the pair. However, Hirst stated: \"I think the controversy has subsided somewhat. It's not an illicit affair, it's known about now. It was shocking to some people at the beginning but it wasn't by any means illegal. There were some complications but they are both grown-ups!\" The parachute stunt won 'Spectacular Scene Of The Year' at the 2010 British Soap Awards. At the 2010 Inside Soap Awards the storyline gained nominations in the category of \"Best Stunt\". Kris Green of Digital Spy described the skydive as one of the best stunts he had seen in a long time, commenting that Zoe's reaction to Sarah's death made him shed a tear, and that the episode on a whole was \"amazing\". The parachute stunt won 'Spectacular Scene Of The Year' at the 2010 British Soap Awards. Asian News International included Sarah and Zoe second on their top ten \"girl-on-girl kisses on TV\" list."]}, {"page": "Ste Hay", "response": ["Returning, later in 2007, Ste and Amy eventually got back together. The pair moved into their own flat, to the dismay of Amy's father Mike Barnes (Tony Hirst). Despite this, Ste became increasingly violent and started to hit Amy, on one occasion even cutting off her ponytail. Slanina-Davis raised money from hair cut during the scene in aid the cancer charity CLIC Sargant. At this time, Amy became pregnant, but was unsure whether to keep the baby. Speaking about 2008 as a whole for Ste and Amy, producer Bryan Kirkwood said he was proud of the way Richardson had portrayed Ste in a sympathetic manner so viewers could understand - but not condone his behaviour. He thought he and Slanina-Davies delivered brilliant performances portraying the \"reality of so many 16-17-year-olds\", struggling to make a life for themselves. He felt some of their scenes were \"downright shocking\". Eventually, Amy decides to accept the help of her friends and family and leaves Ste for abusing her."]}, {"page": "Hirst (surname)", "response": ["* Tony Hirst (born 1967), British actor and stage director", "* Tony Hirst, British academic and blogger"]}, {"page": "Smash Lab", "response": ["The show started broadcasting in the UK on 3 March 2014 on Discovery Turbo and 7 April on Community Channel with Tony Hirst as the narrator. Discovery Turbo only aired 10 episodes, whereas Community Channel showed all 20 episodes."]}, {"page": "List of former Coronation Street characters", "response": ["|Paul Kershaw || Tony Hirst || 2010–2013"]}, {"page": "List of Hollyoaks characters (2006)", "response": ["Mike Barnes is a fictional character from the soap opera Hollyoaks, played by famous Coronation Street actor, Tony Hirst."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["In February 2007, she gives birth to Leah on the kitchen floor, with her shocked father Mike Barnes (Tony Hirst) and sister Sarah Barnes (Loui Batley) delivering Leah. Amy refuses to go near Leah, leading her mother Kathy Barnes (Sarah Jane Buckley) to claim she is Leah's mother. This ruse continues for several months, but finally Michaela sells the story to a tabloid. By this time, Amy has formed a bond with Leah, and claims Leah as her own. However, Kathy has become obsessed with Leah and, after failing to make Amy look incapable of being a mother, she kidnaps Leah. She is eventually sectioned and leaves the village a few months later."]}, {"page": "List of Hollyoaks characters (2009)", "response": ["Lucas Hay is the son of Ste Hay (Kieron Richardson) and Amy Barnes (Ashley Slanina-Davies), and the brother of Leah Barnes (Ela-May Demircan) and Hannah Hay-O'Connor and was played by a child actor William Hall since 2013. He was born on 3 April 2009 and was delivered by Ste and his friend Daniel Raven's (Chris Hargreaves) wife, Abi Raven (Elaine Glover). His name was chosen by Ste. After his birth, Josh Ashworth (Sonny Flood) tried to stop Ste seeing Lucas, but Amy's sister Sarah Barnes (Loui Batley) blackmails Josh into handing Lucas over to Ste and Lucas moves in with Ste. In July, Amy and Sarah's father, Mike (Tony Hirst) found Ste asleep whilst caring for Lucas. As a result, Mike took Lucas and decided to look after him. Ste found Mike and taunted him about his family, Mike then hit him. The next day, Mike approached Abi about her interests in Ste and Lucas. Ste then told Mike that he would no longer be seeing Lucas and he was going to a solicitor. In August 2009, after weeks of drugging Ste, Daniel went behind Abi's back and interviewed a couple who hoped to adopt Lucas. Ste was pushed to the limit and almost shook Lucas, Daniel used this as an excuse to give him to the adopters. Sarah and Mike's ex-girlfriend Zoe Carpenter (Zoë Lister) help Ste as Abi took Lucas. Abi then made the decision to hand Lucas back to Ste. When a fire is set in Il Gnosh while Lucas and Leah are being looked after by Amy in the flat above, Steph Cunningham (Carley Stenson) saves them after the fire spreads. In 2012, Amy moves away from the village and takes Lucas and Leah to live with her. Lucas and Leah return to the village in December 2012 to stay with Ste, while Amy goes abroad with her new fiancée. Amy returns to the village in February 2013 after discovering Ste's relationship with Brendan Brady (Emmett J. Scanlan) she then leaves once more with Leah and Lucas, leaving Ste upset. Ste begins a relationship with John Paul McQueen (James Sutton) and they later get married in December 2014. They later separated and Ste later begins a relationship with Harry Thompson (Parry Glasspool). In August 2016, Amy returns with her fiancé Ryan Knight (Duncan James) and they begin battling custody of Leah and Lucas with Ste and Harry. In December 2016, Amy and Ryan won full custody and they keep Leah and Lucas away from Ste when they tell them not to see Ste. In March 2017, Amy and Ryan get married. The next day, Amy gets murdered by an unknown person and Ste gets arrested for Amy's murder. After Mike returned, he tells Leah and Lucas that Amy has died. In August 2017, when being looked after by Tegan, Lucas tells her that he saw Ryan with Kyle Kelly (Adam Rickitt), and Ryan lies to Lucas that he wasn't with Kyle. In September 2017, Amy's mother, Kathy Barnes (Sarah Jane Buckley), decides to take Leah and Lucas but they stay with Ryan, which leads to Kathy leaving the village. In November 2017, Ryan and Ste's half-sister Tegan Lomax (Jessica Ellis) tell Leah and Lucas that they are in a relationship and Leah and Lucas are worried when Tegan is going to replace Amy. Although the character has not been written out the programme, he has not appeared since December 30, 2019. He will appear again in August 2021."]}, {"page": "1967 in British television", "response": ["* 21 January – Tony Hirst, actor"]}, {"page": "Hollyoaks Later (series 2)", "response": ["| Tony Hirst"]}, {"page": "Lydia Hart", "response": ["After Zoe is released from prison and is found not guilty of Sarah's murder, it is believed that Sarah committed suicide after her diary, found by Mike Barnes (Tony Hirst) is used as evidence in court. Soon Lydia starts to befriend Zoe and she ends up moving in with the Barnes family where Lydia now lives and soon Zoe plans too uncover Lydia's murderous ways as she does not want to be known as a killer. In an interview with entertainment website Digital Spy, Lister said of the storyline, \"It all gets really messy from here! Because Lydia's really deranged, Lydia starts thinking that because she loved Sarah and Sarah loved Zoe, if she gets with Zoe, that'll be the final piece in the puzzle and it'll all work out.\" "]}, {"page": "List of Coronation Street characters (2010)", "response": ["Paul Kershaw, played by Tony Hirst, made his first screen appearance on 8 December 2010. Paul is a fireman and is part of the emergency crew deployed to the Coronation Street when an explosion from The Joinery Bar, causes a tram to derail and fall onto the street. One of the trapped people is resident Molly Dobbs (Vicky Binns), pinned underneath the wreckage of the Corner Shop with her baby son, Jack. Paul is the first fireman to make his way through the rubble to Molly and Jack where he comforts her and rescues the baby, promising to be back with more men and equipment. He does return, telling her that they need specialist lifting equipment but he is obviously perturbed at the sight of the blood seeping from her body. He takes charge of cutting away the rubble from around Molly in an effort to get her out and save her life but all their efforts prove to be in vain as she bleeds to death."]}, {"page": "Jem Costello", "response": ["Gilly Roach (Anthony Quinlan) decides to go travelling around the world with Zoe Carpenter (Zoë Lister) and Mike Barnes (Tony Hirst) after he gives up on his love for Steph. Gilly returns to the village with Jem whom he met in Thailand after he saved her from a shark attack. Jem is excited when Gilly proposes to her after he declares his love, much to the disappointment of Steph who runs off. Jem makes friends with Steph and another ex-girlfriend of Gilly, Cheryl and both of them try to make Jem and Gilly split up however they realised Jem was too nice for them to do anything else. Jem moves in with Gilly and the Ashworth family and formed a bond with Josh Ashworth (Sonny Flood) because of problems with his family. During her time with the family, Jem works in The Dog in the Pond and starts running a martial arts class teaching a lovestruck Duncan Button (Dean Aspen). Duncan tried to kiss Jem, but she retaliated using the exercise she taught him. Jem realised that Gilly was still in love with Steph, and called off their engagement, even after making an effort to befriend Steph."]}, {"page": "Matt Carter (Coronation Street)", "response": ["Eileen Grimshaw (Sue Cleaver) enlists the help of Matt, along with several other male residents, to perform in a charity strip routine at the Bistro. The performance is cut short by the announcement of a fire at The Rovers. Matt later discusses Paul Kershaw's (Tony Hirst) state of mind with Eileen when he goes to book a taxi at StreetCars. Matt later runs into Eileen and tells her that he is going to have a chat with Paul. Matt offers to give Paul a sick note, but Paul is defensive and forces Matt to leave. A few days later, Rita Tanner (Barbara Knox), Dennis Tanner (Philip Lowrie), Sylvia Goodwin (Stephanie Cole) and Roy Cropper (David Neilson) come to Matt to talk about cannabis. Roy and Rita want Matt to educate Dennis and Sylvia and Matt explains that there could be long-term side effects to using the drug. He then tells Sylvia and Dennis to come along to his pain clinic later in the week."]}, {"page": "History of Hollyoaks", "response": ["Leila Roy was written out after Kaur decided she wanted to work elsewhere from serial drama. Mike Barnes left after Tony Hirst decided he wanted to try producing plays. It was announced on 15 January 2010 that Paul Marquess would succeed Lucy Allan as the series producer. His first episode was broadcast on 5 July 2010. Marquess then announced he wanted to take the serial back to its roots and change the way its stories are told. In February 2010 he axed three characters, Josh Ashworth (Sonny Flood), Suzanne Ashworth (Suzanne Hall) and Neville Ashworth (Jim Millea) as well as replacing three of the soap's leading producers including, Henry Swindell, Caroline Roby and Rachel Hall who were replaced by Trina Fraser and Claire Fryer. In the same month it was announced that former Emmerdale actress Sheree Murphy would join the cast as Eva Strong, the biological mother of Anita Roy (Saira Choudhry). This was his first signing since becoming series producer. Stephanie Waring (who plays Cindy Hutchinson) then revealed that all remaining cast members feared their character would be axed. In March, Marquess axed further characters, including Sasha Valentine (Nathalie Emmanuel), Lauren Valentine (Dominique Jackson), Leo Valentine (Brian Bovell), Zak Ramsey (Kent Riley), Spencer Gray (Darren John Langford), Archie Carpenter (Stephen Beard), Jake Dean (Kevin Sacre), Dave Colburn (Elliot James Langridge) and Des Townsend (Kris Deedigan). Nico Mirallegro who plays Barry Newton and Gerard McCarthy who plays Kris Fisher, both quit to pursue other roles. Marquess decided to write Loretta Jones out after he felt there was nowhere left to take her as a result of her child murder plot being rewritten. It was also revealed that Marquess would introduce a new family to the soap. In the same month it was announced Marquess would reintroduce Lee Hunter (Alex Carter). It was also announced that Footballers Wives actress Phina Oruche would join the cast as the mother of the soap's new four-member mixed race family."]}, {"page": "Coronation Street Live (2010 episode)", "response": ["* Tony Hirst as Paul KershawHirst was credited as Fire officer Paul."]}, {"page": "List of Coronation Street characters (2011)", "response": ["June saw a new family take over the running of the Rovers Return for the first time as former EastEnders actress Michelle Collins and Taggart actor John Michie took on the roles of Stella Price and Karl Munro respectively. The couple were also joined by Stella's daughter Eva (Catherine Tyldesley). A potential new love interest for Steve McDonald (Simon Gregson), Beth Tinker (Lisa George), and her son Craig (Colson Smith) arrived in August and Frank's parents, Anne (Gwen Taylor) and Sam Foster (Paul Clayton), made their first appearances in September, along with Kirsty Soames (Natalie Gumede), a new love interest for Tyrone Dobbs (Alan Halsall). Paul Kershaw's (Tony Hirst) Alzheimer's-suffering wife, Lesley Kershaw (Judy Holt), followed in October and Jeremy Sheffield began appearing as Danny Stratton, a new love interest for Becky McDonald (Katherine Kelly), in December. That same month saw the birth of Chesney Brown (Sam Aston) and Katy Armstrong's (Georgia May Foote) newborn son Joseph Brown, the only child to be born that year.", "Lesley Kershaw, played by Judy Holt, made her first screen appearance during the episode broadcast on 17 October 2011. Lesley is married to Paul Kershaw (Tony Hirst). She made her last appearance on 11 May 2012."]}, {"page": "List of Coronation Street characters (2012)", "response": ["Gloria returns to Weatherfield with her new fiancé Eric Babbage (Timothy West) in February 2013. Eric hears Stella cast Gloria as a \"gold digger\", making him have second thoughts about their wedding. He tells Gloria's youngest granddaughter Eva that he is calling off his engagement with Gloria and would much prefer it if Eva came with him on an upcoming cruise. Stella tells Gloria what Eric has been up to, but shortly afterwards, Eric dies, leaving Gloria and Eva devastated. Gloria sells her engagement ring and Eva sells the necklace that he gave her, so that they could both give Eric a good send off. Gloria is shocked to learn that Stella is dating Jason Grimshaw (Ryan Thomas) and she remains friends with Karl but feuds with his current girlfriend Sunita Alahan (Shobna Gulati). When Stella tells her that Karl made a pass at her and tried to kidnap her, Gloria is horrified. She tells Jason, Lloyd Mullaney (Craig Charles) and Steve McDonald (Simon Gregson) in front of Karl, leading to Karl and Jason coming to blows in the pub. Stella accuses Gloria of being too nosey. Gloria is horrified when the pub is set on fire and Stella is trapped inside. Karl tries to save Stella but they both become trapped and Paul Kershaw (Tony Hirst) rescues them. At the hospital, Gloria tells Stella that she is the only good thing that she has done in her life. Jason comes under suspicion when people start questioning how the fire started, as he had been working on the pub's electrics. Jason tries to point the finger at Karl, which angers Gloria. The police inform Stella, Gloria and Karl that the fire was no accident and that the person who started it used a spare set of keys to gain access to the pub. They start to suspect Sunita, who was also trapped in the pub and in a critical condition. Sunita dies and Stella gets angry with Gloria when she insults Sunita. Gloria, Stella, Eva and Karl move into 13 Coronation Street after Stella and Karl reunite."]}, {"page": "Stella Price", "response": ["In March 2013, Dev decides to give Sunita a second chance, but Stella advises against it so Dev dumps Sunita again. Later, Sunita throws a drink over Stella while in the Bistro, so she decides to go home and have a bath. While Stella is enjoying a nice, warm bath, Karl sneaks into the pub cellar and sets fire to The Rovers. He is stunned when he finds Sunita watching him, so he pushes her down the stairs of the cellar, leaving her unconscious. Stella and Sunita then have to fight for their lives as the pub explodes with flames. Sunita manages to make it into the back room, but collapses and slips into unconsciousness a second time. Karl dashes into the pub to save Stella, but they both become trapped. Paul Kershaw (Tony Hirst) and Toni Griffiths (Tara Moran) manage to rescue Karl and Stella, but Toni is the unfortunate one as the roof collapses on her. She subsequently dies from her injuries. Stella, Sunita and Karl are all rushed to hospital, with Stella and Sunita both in a critical condition, but Stella later makes a full recovery. Sunita, however, remains unconscious. When Sally Webster (Sally Dynevor) reveals that her ex-husband Kevin (Michael Le Vell) has emigrated to Germany to look after his ill father Bill (Peter Armitage), she lets Stella and her family move into his house. Karl also moves in when he is hailed as \"the hero\"."]}]}}