{"wiki_id": "http://www.wikidata.org/entity/Q7823610", "itemLabel": "Tony Van Bridge", "itemDescription": "British actor (1917-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Van_Bridge", "wikipedia_page": {"main": "Valentine Anthony Neil \"Tony Van\" Bridge CM (28 May 1917 – 20 December 2004) was a British television and theatre actor and director.", "link_mentions": [{"page": "Shaw Festival", "response": ["With the addition of actor and director Barry Morse as Artistic Director in 1966, the Festival gained huge international publicity and its productions garnered sold-out performances.  Morse also joined the company as actor during this season.  Paxton Whitehead took over management of the company with the 1967 season and under his leadership the Festival gained new heights.  He served for twelve seasons as Artistic Director of the Shaw Festival; during his tenure, he was able to push through a plan of building the purpose-built 869-seat state-of-the-art Festival Theatre to expand considerably the capacity for audiences at Niagara-on-the-Lake.  Queen Elizabeth II, Indira Gandhi, and Pierre Elliot Trudeau were among those who attended performances at the Shaw Festival Theatre during its inaugural season in 1973. Tony Van Bridge was interim artistic director for the 1974–75 season."]}, {"page": "You Never Can Tell (play)", "response": ["The CBC broadcast a production in 1973 with Frances Hyland as Mrs. Clandon, Tony Van Bridge as Mr. Crampton, Chris Wiggins as William the Waiter, Maureen Fitzgerald as Gloria, Drew Russell as Valentine and William Osler as Mr. Bohun."]}, {"page": "Heartbreak House", "response": ["The play has been performed several times at the Shaw Festival in Niagara-on-the-Lake, Ontario, Canada: most notably in 1968 directed by Val Gielgud and with Jessica Tandy, Paxton Whitehead, Tony Van Bridge and Frances Hyland (this production was recorded and released by Caedmon Records [Caedmon TRS-335]); then in summer 2011 directed by Christopher Newton with Michael Ball as Captain Shotover, Blair Williams as Hector, Patrick McManus as Mazzini, Laurie Paton as Ariadne, Benedict Campbell as Mangan and Robin Evans Willis as Ellie. It also formed part of Chichester Festival Theatre's 50th Anniversary Season in 2012 and cast Derek Jacobi as Captain Shotover. The Denver Center Theatre Company staged it for a run 30 March to 29 April 2012."]}, {"page": "Michael Morpurgo", "response": ["Morpurgo was born in 1943 in St Albans, Hertfordshire, as Michael Andrew Bridge, the second child of actor Tony Van Bridge and actress Kippe Cammaerts (born Catherine Noel Kippe Cammaerts, daughter of writer and poet Émile Cammaerts). Both RADA graduates, his parents had met when they were acting in the same repertory company in 1938. His father came from a working-class family, while Kippe came from a family of actors, an opera singer, writers and poets. They were married in 1941 while Van Bridge, having been called up in 1939 and by then stationed in Scotland, was on leave from the army. Morpurgo's brother Pieter was born in 1942. When Morpurgo was born the following year, his father was stationed in Baghdad. While Van Bridge was away at war, Kippe Cammaerts met Jack Morpurgo (subsequently professor of American Literature at the University of Leeds from 1969 to 1982The Daily Telegraph, Obituary, Published 16 October 2000). When Van Bridge returned to England in 1946, he and Cammaerts obtained a divorce and Cammaerts married Jack Morpurgo the same year. Although they were not formally adopted, Morpurgo and his brother took on their step-father's name. Morpurgo's older brother, Pieter Morpurgo, later became a BBC television producer and director. He has two younger siblings, Mark and Kay. Morpurgo's mother was frail, having suffered a breakdown when she was 19, and grieving the loss of her brother Pieter, who was killed in the war in 1941, for the rest of her life. Towards the end of her life she was an alcoholic."]}, {"page": "Mervyn Blake", "response": ["In the mid 1950s, he and his wife Christine Bennett moved their family to Canada, following British acting colleagues Tony Van Bridge and Powys Thomas. He joined the acting company at the Stratford Festival of Canada in 1957, where he stayed to perform in 111 productions over 42 consecutive seasons. In 1988, he performed in The Two Gentlemen of Verona, making him the first company member to perform in the entire canon of Shakespeare's plays."]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Tony Van Bridge, Ann Tirard"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Tony Van Bridge (Acting)"]}, {"page": "The Last of the Tsars", "response": ["The Last of the Tsars opened at the Avon Theatre, Stratford Festival on July 12, 1966. It was directed by Stratford's artistic director Michael Langham, and designed by Leslie Hurry, with music by Louis Applebaum, and featured many of the leading actors of the Festival Company. Grand Duke Michael was played by William Hutt; the Tsar by Joel Kenyon; the Tsarina by Amelia Hall; Rasputin by Powys Thomas; and Samoilov, the revolutionary who fights Grand Duke Michael for control of the play, by Tony Van Bridge. Michael's wife Natalie Sergeevna was played by Kim Yaroshevskaya, and his manservant Johnson was played by Barry MacGregor. The production received generally very favourable notices, and ran for 22 performances."]}, {"page": "Shaw Festival production history", "response": ["*G.K.C. The Wit and Wisdom of Gilbert Keith Chesterton – compiled, arranged and performed by Tony Van Bridge"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Tony Van Bridge"]}, {"page": "First Person (1960 TV series)", "response": ["* The Trouble With Pyecraft (Eric Till producer, H. G. Wells writer; Douglas Cleverdon adaptation), a comedy starring Tony Van Bridge (Pyecraft) and Gillie Fenwick (Formalyn)"]}, {"page": "Encore (TV series)", "response": ["# Love Story 1910 (Basil Coleman producer; Leslie MacFarlane writer), starring Eric House, Frances Hyland, Barry Morse and Tony Van Bridge", "# The Giaconda Smile (Eric Till producer; Aldous Huxley writer; Rita Greer Allen adaptation), starring Pamela Brown, Dawn Greenhalgh, Barry Morse and Tony Van Bridge"]}, {"page": "Coenraad Bloemendal", "response": ["Still in his teens, Bloemendal started touring with a professional chamber ensemble in the Netherlands and Germany. At 19, he joined a group of cellists from the Concertgebouw Orchestra of Amsterdam for a tour of the Netherlands and Belgium. In 1971 Bloemendal moved to Canada and joined Camerata (chamber ensemble), which consisted of the classically trained musicians: Elyakim Taussig and Kathryn Root (pianists), Suzanne Shulman (flute), James Campbell (clarinet), and Adele Armin (violin). On occasion, they were joined by Mary Lou Fallis (soprano). They were joined by well-known artists from various disciplines, including Maureen Forrester, Moe Koffman, Don Thompson and Doug Riley, Glenn Gould, The National Ballet of Canada, and actor Tony Van Bridge. Camerata Canada accompanied Prime Minister Pierre Trudeau to inaugurate cultural relations with Mexico, Venezuela and Cuba, and performed at the Prime Minister's residence.\"Hamiltonian recalls soiree with Castro and the Trudeaus\". November 27, 2016 by Leonard Turnevicius, Hamilton Spectator. In the late seventies Camerata embarked on several European tours. The group disbanded in 1982.\"Camerata\". The Canadian Encyclopedia"]}, {"page": "Playdate (Canadian TV series)", "response": ["|Tony Van Bridge, Ivor Barry, Gillie Fenwick", "|Tony Van Bridge", "|Betty Leighton, Gillie Fenwick, Tony Van Bridge, Diana Maddox"]}, {"page": "Oedipus Rex (1957 film)", "response": ["*Tony Van Bridge as Man From Corinth"]}, {"page": "The Italian Straw Hat (play)", "response": ["An American adaptation, titled The Straw Hat was given in New York by the American Laboratory Theatre company in 1926. The Parisian setting was retained, but the characters were given pseudo-French names like \"Baroness Crème de la Crème\" and \"Gillette Rapide\".\"The Straw Hat\", Internet Broadway Database. Retrieved 7 September 2018 A later American adaptation, Horse Eats Hat by Edwin Denby and Orson Welles, was presented at Maxine Elliott's Theatre in 1936, with Joseph Cotten in the lead role. The Parisian setting was dropped, and the characters had English names such as \"Entwistle\" and \"Mugglethorpe\".\"Horse Eats Hat\", Internet Broadway Database. Retrieved 7 September 2018 The Stratford Festival staged a production in 1971 starring Robin Gammell, Tony Van Bridge and Dinah Christie. It ran for 36 performances during the Festival's summer season.\"An Italian Straw Hat (1971) production credits\", Stratford Festival Archives. Retrieved 22 June 2019"]}]}}