{"wiki_id": "http://www.wikidata.org/entity/Q7822041", "itemLabel": "Tony Castro", "itemDescription": "Yacht designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Castro", "wikipedia_page": {"main": "Tony Castro (full name Antonio Maria de Lancastre de Mello e Castro, Conde das Antas, Conde da Lousa, Visconde de Pernes, born 1952, is a yacht designer, known for numerous winning designs. Born in Lisbon, Portugal, he has been designing sailing and motor yachts since about 1980, with more than 10,000 boats launched, ranging from custom boats and one-design production models to superyachts. His design firm is based in Hamble-le-Rice, England.\n\n", "link_mentions": [{"page": "Waco, Texas", "response": ["* Tony Castro, bestselling author of several books and syndicated columnist, was born in Waco. He graduated from Baylor University and was a Nieman Fellow at Harvard."]}, {"page": "List of sailing boat types", "response": ["| CS 30  || 1984 || Tony Castro || CS Yachts || || ", "| CS 34 || 1989 || Tony Castro || CS Yachts || || ", "| CS 36 Merlin || 1986 || Tony Castro || CS Yachts || || ", "| CS 40 || 1987 || Tony Castro || CS Yachts || || ", "| CS 44 || 1985 || Tony Castro || CS Yachts || || ", "| MG 335 || 1986 || Tony Castro || CS Yachts || || "]}, {"page": "Jubilee Sailing Trust", "response": ["In early pilot schemes including voyages in the square-rigged vessels the Marques, TS Royalist and (between 1982 and 1985) Søren Larsen, it was established that square-riggers were suitable for fulfilling the Trust's aims. Subsequently the Trust commissioned the building of the Lord Nelson (designed by Colin Mudie), which sailed on her maiden voyage from Southampton to Cherbourg on 17 October 1986, and the Tenacious (to a design by Tony Castro), which made her maiden voyage on 1 September 2000, also from Southampton.Our History: The pioneering early days jst.org.uk, accessed 7 January 2019"]}, {"page": "One Ton Cup", "response": ["| 1981 Crosshaven ||  || 27,5 ft. IOR Rating || Harold Cudmore || Tony Castro"]}, {"page": "List of sailboat designers and manufacturers", "response": ["*Tony Castro"]}, {"page": "Tony Castro (Yacht Designer)", "response": ["#REDIRECT Tony Castro "]}, {"page": "Tony Castro (yacht designer)", "response": ["#REDIRECT Tony Castro"]}, {"page": "Jongert", "response": ["The shipyard was established by Jan Jongert, Sr., in Medemblik in 1953 and produced sailing yachts between  and  in length. Between 1970 and 1994 the yard exported cumulatively in excess of half a billion guilders worth of yachts. Most of the later vessels were designed by Tony Castro and built from steel or aluminium."]}, {"page": "CS Yachts", "response": ["The initial designer was John Butler, who designed the CS 22. Raymond Wall, formerly the chief designer for Camper and Nicholsons was head designer at CS from 1977 to 1983, when he designed the CS 27, CS 36 and the CS 33. In 1983 Tony Castro became head designer and produced the CS 36 Merlin, the CS 30, CS 44, CS 40 and the CS 34. The 1979 CS 395 and 1987 CS 50 were designed by Germán Frers. Other designs were produced at C&C Yachts."]}, {"page": "CS 30", "response": ["The CS 30 is a Canadian sailboat, that was designed by Tony Castro and first built in 1984. The design is out of production."]}, {"page": "CS 36", "response": ["It was replaced in the production line after nearly a year overlap in production by the CS 36 Merlin designed by Tony Castro. After the introduction of the CS 36 Merlin the CS 36 was referred to as the CS 36 Traditional."]}, {"page": "CS 36 Merlin", "response": ["The CS 36 Merlin is a Canadian sailboat, that was designed by Tony Castro and first built in 1986. The design is out of production."]}, {"page": "CS 44", "response": ["The CS 44 is a Canadian sailboat, that was designed by Tony Castro. Only one example was completed and it was built by CS Yachts in Canada, in 1985."]}, {"page": "CS 40", "response": ["The CS 40 is a Canadian sailboat, that was designed by Tony Castro and first built in 1987. The design is out of production.<"]}, {"page": "CS 34", "response": ["The CS 34 is a Canadian sailboat, that was designed by Tony Castro and first built in 1989. The design is out of production."]}, {"page": "MG 335", "response": ["The MG 335 is a British sailboat, that was designed by Tony Castro and first built in 1986. The design is out of production."]}, {"page": "Anthony Castro", "response": ["* Tony Castro, yacht designer"]}]}}