{"wiki_id": "http://www.wikidata.org/entity/Q7822623", "itemLabel": "Tony Ingham", "itemDescription": "footballer (1925-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Ingham", "wikipedia_page": {"main": "Anthony Ingham (18 February 1925 – 21 April 2010) was an English professional footballer who played more than 500 games in the Football League as a defender for Leeds United and Queens Park Rangers. He holds the appearance record for QPR, having played 548 first-team games in senior competitions.", "link_mentions": [{"page": "Queens Park Rangers F.C.", "response": ["The club were promoted as champions of Division 3 South in the 1947–48 season. Dave Mangnall was the manager as the club participated in four seasons of the Second Division, being relegated in 1951–52. Tony Ingham was signed from Leeds United and went on to make the most ever league appearances for QPR (519). Arguably the club's greatest ever manager,Alec Stock Obituary  at QueensParkRangersFC.com Alec Stock, arrived prior to the start of the 1959–60 season. The 1960–61 season saw QPR achieve their biggest win to date: 9–2 vs Tranmere Rovers in a Division 3 match. In time, Stock, together with Jim Gregory who arrived as chairman in the mid-1960s, helped to achieve a total transformation of the club and its surroundings.", "*Most league appearances: Tony Ingham, 519, 1950–63"]}, {"page": "2010 in association football", "response": ["* 21 April - Tony Ingham, English footballer (85)"]}, {"page": "List of Queens Park Rangers F.C. records and statistics", "response": ["Record appearances: Tony Ingham (548, 1950–1963)"]}, {"page": "History of Queens Park Rangers F.C.", "response": ["The club were promoted as champions of Division 3 South in the 1947–48 season. Dave Mangnall was the manager as Rangers enjoyed four seasons in the Second division, being relegated in 1951–52. Tony Ingham was signed from Leeds United and went on to make most ever league appearances for QPR (519)."]}, {"page": "2009–10 in English football", "response": ["*21 April 2010 – Tony Ingham, 85, former full-back who spent most of his career at Queens Park Rangers, where he made a club-record 514 league appearances between 1950 and 1963, and later spent many years as QPR's commercial director after retiring as a player. Began his career at Leeds United.Tony Ingham obituary , Queens Park Rangers FC official site. Retrieved 27 April 2010."]}, {"page": "Deaths in April 2010", "response": ["*Tony Ingham, 85, English footballer, after short illness.Tony Ingham - R.I.P "]}, {"page": "List of Queens Park Rangers F.C. players", "response": ["Queens Park Rangers' record appearance-maker is Tony Ingham, who made 555 appearances in his QPR career between 1950 and 1963. Nine other players have made more than 400 appearances, the most recent being Kevin Gallen, who has made the ninth-highest number of appearances with 414 matches, scoring 104 goals in the process. George Goddard is the club's top goalscorer with 186 goals in his seven years with the club. Other than Goddard and Gallen, only Brian Bedford, Rodney Marsh and Don Givens have scored more than 100 goals for the club. As of 11 August 2017, 180 players have appeared 100 times or more for QPR, 34 have played 250 or more and 10 players 400 or more games."]}]}}