{"wiki_id": "http://www.wikidata.org/entity/Q7820014", "itemLabel": "Tommy Wilson", "itemDescription": "British association football player (1930-1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Wilson_(footballer,_born_1930)", "wikipedia_page": {"main": "Thomas Wilson  (15 September 1930 – 21 April 1992) was an English professional footballer who played for Nottingham Forest and Walsall.\nSigned for Nottingham Forest from local club Cinderhill Colliery in 1951, originally played as a winger; switched to centre forward in 1956 and scored 14 goals in the 1956–57 season in which Forest were promoted to the First Division. Had his most prolific season in 1958-59 when he scored 21 League and 6 FA Cup goals, including the second goal in the 1959 FA Cup final.Transferred to Walsall in 1960-61 and whilst with them they gained promotion from the old Third to the Second Division. Tommy left League football in 1962. He joined Cambridge City in the Southern League and whilst with them they won the League Championship. On leaving Cambridge City he joined Chelmsford City as team captain, during which time they were runners-up in the Southern League Championship.\nIn the summer of 1965 Tommy joined the newly formed semi professional team Brentwood Town FC as Team Manager. Brentwood Town had just been admitted to the Metropolitan League.", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["Johnny Quigley's solitary 1958–59 FA Cup semi-final goal beat Aston Villa. Billy Walker's Forest beat Luton Town 2–1 in the 1959 FA Cup Final. Like in 1898 Forest had lost heavily to their opponents only weeks earlier in the league. Stewart Imlach crossed for a 10th-minute opener by Roy Dwight (the cousin of Reg Dwight better known as Elton John). Tommy Wilson had Forest 2–0 up after 14 minutes. The game had an unusually large number of stoppages due to injury, particularly to Forest players. This was put down to the lush nature of the Wembley turf. The most notable of these stoppages was Dwight breaking his leg in a 33rd minute tackle with Brendan McNally. Forest had been on top until that point. Luton though gradually took control of the match with Dave Pacey scoring midway through the second half. Forest were reduced to nine fit men with ten minutes remaining when Bill Whare crippled with cramp became little more than a spectator. Despite late Allan Brown and Billy Bingham chances Chick Thomson conceded no further goals for Forest to beat the Wembley 1950s 'hoodoo' (where one team was hampered by losing a player through injury). Club record appearance holder Bobby McKinlay played in the final winning team captained by Jack Burkitt."]}, {"page": "Thomas Wilson", "response": ["Thomas Wilson, Tom Wilson or Tommy Wilson may refer to:", "*Tommy Wilson (footballer, born 1877) (1877–1940), English footballer", "*Tommy Wilson (footballer, born 1930) (1930–1992), Nottingham Forest and Walsall footballer", "*Tommy Wilson (footballer, born 1961), head coach of Scotland U-19 national team, as of 2006", "*Tommy Wilson (shortstop), American baseball player", "*Tommy Wilson (umpire) (born 1937), former English cricket umpire", "*Tommy Wilson (American football) (1932–2006), former National Football League running back", "*Tommy Wilson (gymnast) (born 1953), British Olympic gymnast"]}, {"page": "1959 FA Cup Final", "response": ["The 1959 FA Cup Final was contested by Nottingham Forest and Luton Town at Wembley. Forest won 2–1, with goals from Roy Dwight and Tommy Wilson just four minutes apart. Dave Pacey scored Luton's consolation goal. Forest were playing in only their second FA Cup final, while Luton were playing in their first, and to date only, final in their history.", "| ||9 || Tommy Wilson"]}, {"page": "History of Nottingham Forest F.C.", "response": ["After Johnny Quigley's solitary 1958–59 FA Cup semi final goal beat Aston Villa, Billy Walker's Forest then defeated Luton Town 2–1 in the 1959 FA Cup Final. Like in 1898 Forest had lost heavily to their opponents only weeks earlier in the league. Stewart Imlach crossed for a 10th-minute opener by Roy Dwight (the cousin of Reg Dwight better known as Elton John). Tommy Wilson had Forest 2–0 up after 14 minutes. The game had an unusually large number of stoppages due to injury, particularly to Forest players. This was put down to the lush nature of the Wembley turf. The most notable of these stoppages was Dwight breaking his leg in a 33rd minute tackle with Brendan McNally. Forest had been on top until that point, but with the reds down to ten men(no substitutes were allowed at this time) Luton gradually took control of the match with Dave Pacey scoring midway through the second half. Forest were reduced to nine fit men with ten minutes remaining when Bill Whare crippled with cramp became little more than a spectator. Despite late Allan Brown and Billy Bingham chances Chick Thomson conceded no further goals for Forest to beat the Wembley 1950s 'hoodoo' (where one team was hampered by losing a player through injury). Club record appearance holder Bobby McKinlay played in the final winning team captained by Jack Burkitt."]}, {"page": "List of people with surname Wilson", "response": ["*Tom and Tommy Wilson (disambiguation), multiple people", "***Tommy Wilson (footballer, born 1877) (1877–1940), English footballer", "***Tommy Wilson (footballer, born 1930) (1930–1992), Nottingham Forest and Walsall footballer", "***Tommy Wilson (American football) (1932–2006), National Football League running back", "***Tommy Wilson (umpire) (born 1937), English cricket umpire", "***Tommy Wilson (footballer, born 1961), head coach of Scotland U-19 national team, as of 2006"]}, {"page": "1959 FA Charity Shield", "response": ["| ||9 || Tommy Wilson || "]}, {"page": "Billy Gray (footballer)", "response": ["At age 30, Gray transferred to top-flight club Nottingham Forest for a £4,500 fee in June 1957. In 1958, manager Billy Walker moved Gray from outside to inside forward and he became the team's playmaker and penalty taker, scoring three penalties in Forest's run to the 1959 FA Cup Final and setting up Tommy Wilson's winning goal in the 2–1 victory in the final over Luton Town. Over time, Gray was moved to left back and proved effective in the position, before departing the City Ground at age 36 in November 1963. In six seasons with Forest, Gray made 228 appearances and scored 35 goals. He moved to Third Division strugglers Millwall as player-manager in November 1963 and after the club's relegation to the Fourth Division at the end of the 1963–64 season, he played a bit-part role as a player in the Lions' immediate return to the Third Division at the first attempt. Gray retired at the end of the 1964–65 season. He made a brief comeback for Brentford Reserves in early 1967."]}, {"page": "List of Nottingham Forest F.C. seasons", "response": ["|Tommy Wilson", "|Tommy Wilson", "|Tommy Wilson"]}, {"page": "Tommy Wilson (footballer born 1930)", "response": ["#REDIRECT Tommy Wilson (footballer, born 1930)"]}]}}