{"wiki_id": "http://www.wikidata.org/entity/Q7822776", "itemLabel": "Tony Lee", "itemDescription": "British comic and novel writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Lee", "wikipedia_page": {"main": "Tony Lee is a British comics writer, screenwriter, audio playwright, and novelist.", "link_mentions": [{"page": "Starship Troopers", "response": ["From October to December 1988, Sunrise and Bandai Visual produced a six-episode Japanese original video animation locally titled Uchū no Senshi with mobile infantry power armor designs by Kazutaka Miyatake, based on Starship Troopers. Dark Horse Comics, Mongoose Publishing and Markosia hold the license to produce comic books based on Starship Troopers, written by authors including Warren Ellis, Gordon Rennie and Tony Lee. Avalon Hill published Robert Heinlein's Starship Troopers in 1976, a map-and-counter board wargame featuring a number of scenarios as written in the novel. In 1998, Mythic Entertainment released Starship Troopers: Battlespace. The web-based interactive game, in which players battled each other in overhead space combat, allowed players to assume either Klendathu or Federation roles, was developed alongside the film adaptation. Starship Troopers: The Miniatures Game was released by Mongoose Publishing in 2005, a miniature wargame which used material from the novel, film, and animated TV series. Spectre Media released Starship Troopers: Invasion Mobile Infantry, a game for PCs, in 2012."]}, {"page": "Hayes, Hillingdon", "response": ["* Screenwriter, Audio Playwright and Graphic Novelist Tony Lee (1970-), whose work including Pride and Prejudice and Zombies, Doctor Who and Star Trek have topped the New York Times Best Seller list, was born in Hayes, attending Hayes Manor Secondary School."]}, {"page": "Jerry Cornelius", "response": ["* \"Midnight Kiss\" (Cornelius is a main character throughout the five part story), written by Tony Lee and illustrated by Ryan Stegman.", "In comics, various writers have used elements of the character, including Bryan Talbot's character Luther Arkwright. Image publishes Matt Fraction's Casanova series which also pays homage to Cornelius. Tony Lee's Midnight Kiss features Cornelius with Michael Moorcock's blessing. (Moorcock wrote the introduction for the collected trade paperback). Grant Morrison created an Oscar Wilde-inspired steampunk version of Jerry Cornelius in Sebastian O, the original Vertigo mini-series. Another Morrison character, Gideon Stargrave of The Invisibles, is one of the few interpretations of the character that Moorcock has issues with, as he considers the character little more than a straight lift of Cornelius."]}, {"page": "Artful Dodger", "response": ["In Tony Lee's 2011 novel Dodge & Twist, set twelve years after the events of Oliver Twist, Dodger has returned to England a changed man from his time in Australia, and is planning a heist. However he cannot escape the 'ghost' of Fagin, who still guides his actions, even past the grave."]}, {"page": "Baker Street Irregulars", "response": ["* A series of four graphic novels released in 2011, titled Sherlock Holmes: The Baker Street Irregulars, features the Baker Street Irregulars. The series was written by Tony Lee and illustrated by Dan Boultwood. It was adapted into a play, also titled Sherlock Holmes: The Baker Street Irregulars, by Eric Coble."]}, {"page": "Doctor Who Magazine", "response": ["| Story Tony Lee; pencils Mike Collins; ink David A. Roach; colours James Offredi"]}, {"page": "Week Ending", "response": ["Script contributors included Andy Hamilton, Mark Burton, John O'Farrell, Terence Dackombe, Guy Jenkin, Bridget Leathley, Iain Pattinson, Ged Parsons, Simon Bullivant, Mark Brisenden, Andy Riley, Kevin Cecil, Clive Coleman, Richard Herring, D.A. Barham, Peter Baynham, Julian Dutton, Harry Hill, Al Murray, Ben Moor, Tony Lee, Rich Johnston, Lee Barnett, David Baddiel, Rob Newman, Graeme Sutherland, Kim Morrissey, Barry Pilton, Paddy Murray, Mark Griffiths, Ivan Shakespeare, Alan Stafford, Barry Atkins, Stewart Lee, Martin Smith, Will Adams, Colin Bostock-Smith, Peter Hickey, Craig Robins, John Random, Brendan Martin and Martin Curtis, Bob and Barbara Boulton, Nick R. Thomas, Chris Stratford and Dave Morley, Andrew Whelan, Mark Perkins, Gill Perkins and John Handley."]}, {"page": "Your Sinclair", "response": ["*Tony Lee, Joystick Juggler in the late eighties is now a #1 New York Times Best Selling List writer of audio dramas, comics and graphic novels, most recently known as the writer of the ongoing Doctor Who comic for IDW."]}, {"page": "Doctor Who spin-offs", "response": ["At the 2007 San Diego Comic-Con International, IDW Publishing announced their intention to publish a new series of Doctor Who comics, which would follow the adventures of the Tenth Doctor and Martha Jones. The series was scripted by Gary Russell, with art by Nick Roche, and was slated to launch later that year. IDW published this title alongside Doctor Who Classics, republishing Doctor Who Weekly and Monthly stories drawn by Dave Gibbons with new coloring. Subsequently, this was split into two publications titled Doctor Who, a six-issue mini-series, and Doctor Who Classics respectively.  A second mini-series, Doctor Who: The Forgotten, by Tony Lee and Pia Guerra, began its release in August 2008 and deals with the Tenth Doctor recalling previous Doctors' adventures as an aid to fight off forced amnesia.The Timeline Of A Time Lord: Lee talks \"Doctor Who\", Comic Book Resources, June 26, 2008Tony Lee and The Doctors in the House, Newsarama, July 14, 2008 Married writing team John Reppion and Leah Moore, together with artist Ben Templesmith, scripted  one-shot The Whispering Gallery, which was released in February 2009.Moore & Reppion on “Doctor Who: Whispering Gallery”, Comic Book Resources, December 17, 2008 This initiated a series of one-shots which included The Time Machination, by Tony Lee and Paul Grist, in May 2009, and Autopia, by John Ostrander and Kelly Yates, in June.", "It was announced Tony Lee on February 2009 at New York Comic Con that Tony Leewould  write an ongoing series.NYCC '09 - IDW - Dr Who Monthly and More, Newsarama, February 7, 2009"]}, {"page": "IDW Publishing", "response": ["Beginning in 2008, the company licensed the Doctor Who series from the BBC, launching two concurrent titles: Doctor Who Classics, which reprints colorized comic strips featuring the past Doctors such as the Fourth Doctor and Fifth Doctor originally published in the late 1970s-early 1980s by Doctor Who Magazine, and Doctor Who: Agent Provocateur, an original six-part limited series featuring the Tenth Doctor and overseen and written by TV series script editor Gary Russell. An additional six-part limited series titled Doctor Who: The Forgotten started in mid-2008 by Tony Lee and Pia Guerra,The Timeline Of A Time Lord: Lee talks \"Doctor Who\". Comic Book Resources. June 26, 2008Tony Lee and The Doctors in the House, Newsarama. July 14, 2008 as well as a series of monthly one-shot, self-contained stories. July 2009 saw the beginning of Doctor Who, an ongoing series featuring the Tenth Doctor, written by Tony Lee and illustrated by a rotating art team.\"Tony Lee on the Doctor Who Ongoing Series\". Newsarama. July 10, 2009"]}, {"page": "Motherhead Bug", "response": ["Motherhead Bug was an American rock music group founded in 1989 in New York City by singer and trombone player David Ouimet and bass guitarist Tony Lee."]}, {"page": "Adric", "response": ["In the IDW Publishing comic Doctor Who: The Forgotten by Tony Lee, a manifestation of Adric appears in the TARDIS Matrix, saving the Tenth Doctor's life and, in the process, dying a second time. This time, however, Adric is aware of his sacrifice, stating that \"it's not a pointless death\"."]}, {"page": "Mina Harker", "response": ["*In From the Pages of Bram Stoker's Dracula: Harker (2009), written by Tony Lee and endorsed by Dacre Stoker and Ian Holt, Mina becomes bound to Dracula's spirit as his remaining allies attempt to use her unborn child as his new body."]}, {"page": "Valeyard", "response": ["The IDW Doctor Who comic series The Forgotten written by Tony Lee featured another individual calling himself \"The Valeyard\", who claimed to be the Meta-Crisis Doctor, but this was revealed to be a disguise taken by a cranial parasite while it and the Tenth Doctor were trapped in the TARDIS' matrix."]}, {"page": "Quincey Morris", "response": ["*In the graphic novel by Tony Lee, From The Pages Of Bram Stoker's Dracula: Harker, a sequel to Dracula set six months later, Quincey appears to Jonathan Harker as a ghost and, in the final battle fights the spirit form of Dracula himself, sacrificing his own soul to save Mina's child."]}, {"page": "Dom Reardon", "response": ["*Raven's Gate (adapted by Tony Lee, from the novel by Anthony Horowitz, 160 page graphic novel, Walker Books,  August 2010, )"]}, {"page": "Vince Locke", "response": ["** \"The Incredible Teatime Torture Show\" (with Tony Lee, in Judge Dredd Megazine #284, May 2009)"]}, {"page": "Comics International", "response": ["* It's Only a Comic, a humorous column from the creator's side by Tony Lee"]}, {"page": "G. P. Taylor", "response": ["In October 2006, Taylor released The Tizzle Sisters & Erik through Markosia. A mixture of prose and graphic novel that he deemed an 'illustronovella', Taylor was joined on the book by collaborators Tony Lee, Dan Boultwood, and Harry Potter artist Cliff Wright."]}, {"page": "Mark Hazzard: Merc", "response": ["* Tony Lee - Mark Hazzard: Merc Amazing Fantasy #18 (February 2006)"]}, {"page": "Raven's Gate", "response": ["A graphic novel adaptation written for Walker Books by UK writer Tony Lee and drawn by artists Dom Reardon and Lee O'Connor was released on 3 August 2010. It was then re-issued with a new cover to coincide with then upcoming releases of the graphic novel adaptations for Evil Star and Nightrise on 6 June 2013. "]}, {"page": "Lee O'Connor (comics)", "response": ["*Evil Star (adapted by Tony Lee from the book by Anthony Horowitz, 160 page graphic novel, 2010)"]}, {"page": "Evil Star (novel)", "response": ["A graphic novel adaptation written for Walker Books by UK writer Tony Lee and drawn by artist Lee O'Connor was released on 2 January 2014."]}, {"page": "Pia Guerra", "response": ["In 2005, Guerra worked as a penciller on Marvel's Spider-Man: Unlimited. In the late 2000s, Guerra contributed to a Doctor Who comic entitled Doctor Who: The Forgotten (published by IDW Publishing and written by UK writer Tony Lee),Minnick, Remy (August 22, 2008). Pia Guerra talks \"Doctor Who: The Forgotten\". CBR.com. and to a Torchwood series (for Torchwood Magazine) written by Gareth David-Lloyd. She has co-written two issues of Simpsons Comics for Bongo Comics with Ian Boothby.", "*Penciller and Inker: Doctor Who: The Forgotten (Tony Lee, IDW Publishing, 2008–)"]}, {"page": "Tony Lee (disambiguation)", "response": ["Tony Lee (born 1970) is a British comics writer.", "Tony Lee may also refer to:", "*Tony Lee (actor), American actor", "*Tony Lee (pianist) (1934–2004), British jazz musician", "*Tony Lee (footballer, born 1937) (born 1937), English footballer with Southport in the 1950s", "*Tony Lee (footballer, born 1947) (born 1947), English footballer with Bradford City and Darlington in the 1960s, later a non-league football manager", "*Tony Lee (basketball) (born 1986), American basketball player", "*Tony Lee Bettenhausen, Champ Car owner and driver", "*Tony Harris (basketball, born 1970) (Tony Lee Harris, 1970–2007), American basketball player", "*Tony Lee Moral, documentary writer and film maker"]}, {"page": "Mike Collins (comics)", "response": ["** \"F.A.Q.\" (with Tony Lee, in Doctor Who Magazine #369–371)"]}, {"page": "Nightrise", "response": ["A graphic novel adaptation written for Walker Books by UK writer Tony Lee and drawn by artist Nigel Dobbyn was released on 6 November 2014."]}, {"page": "Ben Lai", "response": ["*X-Men Unlimited #1, (with writer Tony Lee, Marvel Comics, 2004)"]}, {"page": "Markosia", "response": ["*Brothers - The Fall of Lucifer (by Tony Lee and Wendy Alec/Sam Hart)", "*Midnight Kiss (by Tony Lee and Ryan Stegman/Kieran Oats, 5-issue mini-series)", "*Shadowmancer (by Tony Lee and G.P. Taylor/Pedro Delgado, 10-issue adaptation)", "**Blaze of Glory (by Tony Lee and Sam Hart, previously published through Mongoose Publishing)", "**Dead Man's Hand (by Tony Lee and Neil Edwards)", "**Damaged Justice (by Tony Lee and Shanth Enjeti)", "**Starship Troopers: Ongoing Series  #1-4 Marooned (by Tony Lee and Chris DiBari)", "**Starship Troopers: Ongoing Series  #9-10 Triple Threat (by Cy Dethan, Tony Lee, Christian Beranek - stories and Scott James, Jim Boswell, Neil Edwards - art)", "*The Tizzle Sisters (by Tony Lee and G.P. Taylor, Dan Boultwood, graphic novel/prose hybrid, October 2006)", "*Hope Falls (by Tony Lee and Dan Boultwood, 5-issue mini-series)"]}, {"page": "Beck Theatre", "response": ["from June 1998 until July 1999 New York Times #1 bestseller Tony Lee worked at the theatre as their Marketing Manager."]}, {"page": "Comics Bulletin", "response": ["*Tony Lee: \"He’s Only a Writer… and It’s More than Just a Comic\""]}]}}