{"wiki_id": "http://www.wikidata.org/entity/Q7823726", "itemLabel": "Tony Zemaitis", "itemDescription": "British luthier", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Zemaitis", "wikipedia_page": {"main": "Tony Zemaitis (1935 – 17 August 2002) was a British luthier from London. He is mostly known for his \"metal top\" electric guitars, which were used by some notable rock musicians of that era.\nUnder the leadership of his son Tony Zemaitis, Jr., Zemaitis Guitars company continued this guitar-making style after the luthier's death in 2002.", "link_mentions": [{"page": "Keith Richards", "response": ["|Custom-made in 1974 by British luthier Tony Zemaitis, the guitar nicknamed both \"Macabre\" and \"the Pirate Zemaitis\" was decorated with skulls, a pistol, and a dagger. Richards used it as his main open-G guitar from 1975 to 1978, when it was destroyed in a fire at his rented Los Angeles home. Richards used a Japanese-made replica on the 2005–2006 tour."]}, {"page": "Acoustic bass guitar", "response": ["Folk bass player Ashley Hutchings used the acoustic bass guitar with his Etchingham Steam Band in 1974 and 1975. An early user of the acoustic bass guitar in rock was English multi-instrumentalist and composer Mike Oldfield, who had one custom-built for him by luthier Tony Zemaitis in the mid-1970s and used the bass on a number of his recordings from that time onwards, a prominent example being his 1975 album Ommadawn."]}, {"page": "2002 in British music", "response": ["* 17 August – Tony Zemaitis, guitar maker, 67"]}, {"page": "2002 in the United Kingdom", "response": ["*17 August – Tony Zemaitis, guitar maker (born 1935)"]}, {"page": "Teye", "response": ["When Teye showed a self-build guitar to his then manager Evert Wilbrink in Nashville, Wilbrink arranged an introduction to Les Paul, who deemed Teye's proto-type 'the closest to the ideal guitar I have in my head'. Wilbrink and Teye then established Teye Guitars as builder of electric guitars in 2006. Teye's love for adorned guitars stems from being a longtime Rolling Stone and Small Faces fan. They played guitars built by Tony Zemaitis, who built two guitars for Teye and subsequently Tony and he became friends. The La India and La Mora model got praised by magazines all over the world. His Electric Gypsy La Llama was praised by Guitar Player as a \"dazzling piece of guitar artistry.\" An unusual feature on some of Teye's guitars is a \"mood\" knob, which to a Guitar Player reviewer sounded as a mid-cut control, and \"exponentially\" increased the number of tones available. Later in 2015 Teye introduced an even more versatile circuitry, the Mojo(TM). Summer 2016 Teye Guitars moved its operation to Nashville, TN. Players include Andy Summers of the Police; Cliff Williams of AC/DC; Zac Brown; Cade Foehner (American Idol); Bibi McGill (Beyoce, Pink); Ge Carlsberg and David Hollestelle (Wild Romance); Eric Saylors (Steepwater); Ben Thomas (Adele, Sam Smith); Johnny Depp; Joan Jett; Micki Free; Sasha Krivtsov (The Voice) and Unni Wilhelsen."]}, {"page": "1935 in the United Kingdom", "response": ["* 10 April – Tony Zemaitis, guitar maker (died 2002)"]}, {"page": "Zemaitis", "response": ["*Tony Zemaitis (1935–2002), British guitar maker"]}, {"page": "Zemaitis Guitars", "response": ["Zemaitis's guitars are based on designs by British luthier Tony Zemaitis, who died in 2002. In the United States, Zemaitis is distributed by the \"Zemaitis Guitar Company\" based out of Paso Robles, California. Current products by Zemaitis include electric and acoustic guitars.", "Born Antanus Casimere Zemaitis, of Lithuanian descent, Tony Zemaitis (as he is known to his friends), began a five-year apprenticeship as a cabinetmaker in 1951. He repaired his first guitar in 1952 and built his first instrument –a classical nylon-string guitar in 1955.Tony Z and the Cult of the Zemaitis Guitar by Adrian Ingram on Vintage Guitar magazine, August 1997 Zemaitis started to build guitars for his friends, selling them the instruments at lower prices. After doing the military service, Zemaitis improved his methods to manufacture guitars. His instruments became popular in blues and folk music musicians of London, gaining good reputation among them. During the 1960s, Zemaitis made 12-string guitars for notable musicians including Ralph McTell, Spencer Davis, Eric Clapton and Jimi Hendrix.A.C. Zemaitis guitars history on Zemaitis.de", "Although Tony Zemaitis died in 2002, the demand for his guitars continued increasing, as well as their prices. The \"Zemaitis\" licensed guitars started to be manufactured in Japan, while many guitar makers worldwide copying Tony Zemaitis' designs to their own products."]}, {"page": "John Birch (luthier)", "response": ["John Birch Guitars continues to make fine guitars under the direction of Birch's business partner, John Carling. Their new line includes J1s, J2s, Strats, Les Pauls, and SGs. They also make a new version of the SG Special based on the original as played by Tony Iommi, complete with cross inlays and Magnum 2 pickups. This guitar is available with several options on inlays, finish and a vibrato version as well. It has been a global success with customers around the world. There is a range of basses as well, in SG and Rickenbacker 4000 styles. The Eaton range of guitars was started after John Birch died and was designed, in John Carling's words, to \"offer a wider range of products and retain the JB Professional line.\" There is also a metal-front Eaton range, much like Tony Zemaitis' guitars, that include Les Paul and Telecaster styles. These are now discontinued."]}, {"page": "Žemaitis", "response": ["*Tony Zemaitis, guitar maker from England"]}, {"page": "Chris Eccleshall", "response": ["Eccleshall originally trained as a violin maker with W. E. Hill and Sons of Bond Street, London, who at the time were the number one violin company in the world.() He was also an engineer in the Fleet Air Arm. Later he moved to Ealing Strings on Ealing Common, London.() During this time Eccleshall still found time to make and repair guitars, eventually becoming so busy, especially with work on multiple instruments owned by Rory Gallagher, that he set up his own workshop and went into making guitars full-time. British guitar makers were virtually unheard of at the time, but Eccleshall was one of the first to win recognition, along with Tony Zemaitis and John Birch. Week after week the three were involved in a competition to get their outlandish guitar designs onto Top of the Pops during the heyday of British glam rock. Although his name is better known to insiders than to the general public, Eccleshall became well established as one of the world's leading guitar makers."]}, {"page": "Deaths in August 2002", "response": ["*Tony Zemaitis, 67, British guitar maker."]}]}}