{"wiki_id": "http://www.wikidata.org/entity/Q7823019", "itemLabel": "Tony Morris", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Morris", "wikipedia_page": {"main": "Tony Morris (30 September 1962 – 1 August 2020) was a British newsreader for Granada Reports, produced by ITV Granada. He previously worked as a reporter and bulletin presenter for BBC North West Tonight and for a brief period was a reporter for the BBC national news.", "link_mentions": [{"page": "1962 in television", "response": ["| Tony Morris"]}, {"page": "Puddle Lane", "response": ["A series of 54 books (plus two standalone volumes) was produced for Puddle Lane, published by Ladybird Books. The texts, based on the animated stories, were written by Sheila McCullagh. Illustrations for the books were provided by several different artists (Tony Morris, Gavin Rowe and others). There were five sets of books (with a different cover colour for each set), the first set (Stage 1) being the easiest to read and the last set (Stage 5) being the hardest. Since they were intended for children who are learning to read, the books with lower reading stages would present the text in two versions: the left page contained the full version, to be read aloud by the parent, while the right page contained a simplified version for the child. The books are currently out of print."]}, {"page": "Capital London", "response": ["*Tony Morris"]}, {"page": "BBC North West Tonight", "response": ["* Tony Morris"]}, {"page": "Granada Reports", "response": ["On 27 September 2012, it was announced technical staff had been invited to volunteer for redundancy as part of national job losses affecting ITV News services. The timing coincided with production moving from Granada Studios to MediaCityUK.Redundancies at Granada Reports Manchester Evening News, 27 September 2012 The first bulletin from Salford Quays, presented by Tony Morris, aired on Sunday 24 March 2013.", "*Tony Morris"]}, {"page": "Anthony Morris", "response": ["* Tony Morris (1962–2020), British newsreader for ITV Granada Reports"]}, {"page": "List of former BBC newsreaders and journalists", "response": ["* Tony Morris – former reporter and presenter on BBC North West Tonight. He was later a main presenter on Granada Reports, from 2003 onwards. He died in 2020."]}, {"page": "1962 in the United Kingdom", "response": ["*30 September – Tony Morris, newsreader (d. 2020) "]}, {"page": "Lucy Meacock", "response": ["On 3 August 2020, Meacock presented a special edition of Granada Reports following the death of her co-presenter of 17 years, Tony Morris."]}, {"page": "List of ITV journalists and newsreaders", "response": ["* Tony Morris – presenter of Granada Reports for more than 10 years from 2003. He died in 2020."]}, {"page": "1979–80 League of Ireland", "response": ["|Tony Morris"]}, {"page": "1982–83 League of Ireland", "response": ["|Tony Morris"]}, {"page": "Blouse and Skirt", "response": ["* Tony Morris - Host "]}, {"page": "2020 in the United Kingdom", "response": ["**Tony Morris, 57, newsreader (ITV Granada), kidney cancer."]}, {"page": "2020 in British television", "response": ["|Tony Morris"]}, {"page": "Deaths in August 2020", "response": ["*Tony Morris, 57, British newsreader (ITV Granada), kidney cancer.Tributes to ITV Granada Reports presenter Tony Morris, who has died aged 57"]}, {"page": "2021 British Academy Television Awards", "response": ["*Tony Morris"]}]}}