{"wiki_id": "http://www.wikidata.org/entity/Q7823630", "itemLabel": "Tony Waddington", "itemDescription": "English film producer, songwriter, record producer, and music industry executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Waddington_(songwriter)", "wikipedia_page": {"main": "Anthony Brandon Joseph Waddington (born 1 January 1943) is an English singer-songwriter, record producer, film producer, screenplay writer, and creative media executive.  He became well known, with Wayne Bickerton, as writer and producer of a series of UK chart hits in the 1970s for The Rubettes. He also received an Ivor Novello Award as \"Songwriter of the Year\".", "link_mentions": [{"page": "Pete Best", "response": ["Best later moved to the United States along with songwriters Wayne Bickerton and Tony Waddington. As the Pete Best Four, and later as the Pete Best Combo (a quintet), they toured the United States with a combination of 1950s songs and original tunes, recording for small labels, but they had little success.After The Beatles, petebest.com. Retrieved 4 December 2007.  They ultimately released an album on Savage Records, Best of the Beatles; a play on Best's name, leading to disappointment for record buyers who neglected to read the song titles on the front cover and expected a Beatles compilation. The group disbanded shortly afterwards. Bickerton and Waddington were to find greater success as songwriters in the 1960s and 1970s, writing a series of hits for the American female group the Flirtations and the British group the Rubettes.The Rubettes feat. Alan Williams at therubettes.de In 2000, the record label Cherry Red reissued the Pete Best Combo's recordings as a compact disc compilation. Richie Unterberger, reviewing the CD, stated that the music's \"energy level is reasonably high,\" that Bickerton and Waddington's songwriting is \"kind of catchy,\" and that Best's drumming is \"ordinary.\""]}, {"page": "The Rubettes", "response": ["The Rubettes were an English pop band put together by musician John Richardson in 1974 after the release of \"Sugar Baby Love\", a recording assembled of studio session musiciansThey can be heard as Barry Blue's studio recordings backing band on his first two singles: \"Dancing On a Saturday Night\" and \"Do You Wanna Dance\". in 1973 by the songwriting team of Wayne Bickerton, the then head of A&R at Polydor Records, and his co-songwriter, Tony Waddington, after their doo-wop and 1950s American pop-influenced songs had been rejected by a number of existing acts. Waddington paired the group with manager John Morris, the husband of singer Clodagh Rodgers and under his guidance, the band duly emerged at the tail end of the glam rock movement, wearing trademark white suits and cloth caps on stage. Their first release, \"Sugar Baby Love\" was an instant hit remaining at number one in the United Kingdom for four weeks in May 1974, while reaching number 37 on the US chart that August, and remains their best-known record. Subsequent releases were to be less successful, but the band continued to tour well into the 2000s with two line-ups in existence."]}, {"page": "United Kingdom in the Eurovision Song Contest 1976", "response": ["| align=\"left\" | Wayne Bickerton & Tony Waddington"]}, {"page": "United Kingdom in the Eurovision Song Contest 1978", "response": ["| align=\"left\" | Wayne Bickerton & Tony Waddington", "| align=\"left\" | Wayne Bickerton & Tony Waddington"]}, {"page": "Carl Wayne", "response": ["He went solo and made several singles and record albums, some including songs written and produced by Roy Wood.  Among his singles were \"Way Back in the Fifties\",A song at first recorded by the Rubettes for their 1974 album \"Wear It's 'At\", written and for both artists, produced by Wayne Bickerton and Tony Waddington. \"Hi Summer\" backed with \"My Girl And Me\", both written and produced by Lynsey de Paul, the theme song to an ITV variety series he co-hosted, \"Maybe God's Got Something Up His Sleeve\", the John Lennon song \"Imagine\", plus a cover version of the Cliff Richard hit \"Miss You Nights\", and Wood's \"Aerial Pictures\". He was originally offered the chance to record \"Sugar Baby Love\" but rejected it as \"rubbish\"; it was promptly given to a new band, the Rubettes, and it launched their career with a number one hit. As well as \"Hi Summer\", his work on TV included singing the theme songs to the talent show New Faces, one of which, \"You're a Star!\", was a minor hit for him in 1973. In 1977, Wayne took part in the Song for Europe contest, hoping to represent the UK in the Eurovision Song Contest. His song, \"A Little Give, A Little Take\" finished in 11th place out of 12 songs."]}, {"page": "The Flirtations (R&B musical group)", "response": ["In late 1968 the trio signed with Deram Records and released what would become their signature recording, \"Nothing But A Heartache\" — a dense, dynamic, earth-shattering melodrama produced by Englishman Wayne Bickerton and written by Bickerton with Tony Waddington.  The B-side was a Christmas song, \"Christmastime Is Here Again\".  \"Nothing But a Heartache\" rose to first place on the \"Bubbling Under\" list in December 1968 and gave the Flirtations a second Top 40 hit in the Netherlands, reaching No. 36 in early 1969."]}, {"page": "Tony Waddington", "response": ["* Stoke City legends: Tony Waddington"]}, {"page": "List of members of bands featuring members of the Beatles", "response": ["* Tony Waddington – rhythm guitar", "* Tony Waddington – lead guitar, vocals"]}, {"page": "Sugar Baby Love", "response": ["\"Sugar Baby Love\", recorded in autumn 1973 and released in January 1974, is a bubblegum pop song, and the debut single of The Rubettes.  Written by Wayne Bickerton and Tony Waddington and produced by Bickerton, engineered by John Mackswith at Lansdowne Recording Studios, and with lead vocals by Paul Da Vinci, \"Sugar Baby Love\" was the band's one and only number one single in the UK Singles Chart, spending four weeks at the top of the chart in May 1974.", "Category:Songs written by Tony Waddington (songwriter)"]}, {"page": "Nothing but a Heartache", "response": ["\"Nothing but a Heartache\" is a Pop and Northern Soul hit originally released on the Deram Records label in November 1968 by South Carolina trio The Flirtations. Produced by Wayne Bickerton and co-written by Bickerton and Tony Waddington — the British songwriting/producing duo later responsible for the 1970s successes of The Rubettes — \"Nothing But a Heartache\" just missed the UK Top 50, peaking at #51. However the track reached the Top 40 in both the Netherlands (#36) and in the US, where it spent two weeks at #34 in late May 1969 during what was then considered a lengthy 14-week run on Billboard's Hot 100 – especially for a hit that did not reach the top 30.”Billboard Hot 100 Charts – The Sixties”, Record Research Inc, 1990  The single did, however, reach #31 on Cash Box and #25 on Record World.", "Category:Songs written by Tony Waddington (songwriter)"]}, {"page": "United We Stand (Brotherhood of Man album)", "response": ["#\"For Old Times Sake\" (Tony Waddington, Wayne Bickerton) – 3:00"]}, {"page": "We're the Brotherhood of Man", "response": ["#\"Can't Stop Loving You\" (Tony Waddington / Wayne Bickerton)"]}, {"page": "Tight Fit (album)", "response": ["# \"Hearts of Stone Break Hearts of Glass\" (Tony Waddington) – 3:58"]}, {"page": "Paul Da Vinci", "response": ["In late 1973, he sang on a demo recording of \"Sugar Baby Love\", written and produced by Wayne Bickerton and Tony Waddington and initially offered to Showaddywaddy, who turned the song down.[  Bruce Eder, Biography of Wayne Bickerton, AllMusic.com]. Retrieved 11 November 2009  Bickerton and Waddington then offered it to the demo musicians, provided that they became an actual group, the Rubettes. Although the other musicians agreed, Da Vinci turned down the opportunity to perform with the group as, by the time of its release in 1974, he had signed a solo contract with Penny Farthing Records.  After \"Sugar Baby Love\" – featuring Da Vinci's striking falsetto (he also sang all of the low vocal plus the two part harmony on the record) but with Alan Williams, who sang backing vocals on the record, miming to the whole vocal on Top of the Pops – became a UK no.1 hit in 1974 (also reaching number 37 on the US pop chart), he also sang the lead vocal on the B-side of the record \"You could Have Told Me\".  He issued his first solo single.  The song, \"Your Baby Ain't Your Baby Anymore\", was co-written and co-produced by Da Vinci with Edward Seago, reached number 19 on the UK singles chart, and was a hit in several  other European countries, Number 1 in Holland.  However, its follow-up, \"If You Get Hurt\", was less successful.  He moved to Epic Records in 1977 and released two singles, but again without chart success.Paul Da Vinci discography, 45cat.com. Retrieved 25 August 2014"]}, {"page": "Wayne Bickerton", "response": ["Wayne Bickerton (born Arthur Ronald Bickerton; Wayne Bickerton at discogs.com. Retrieved 11 November 2009 11 July 1941 – 29 November 2015) was a British musician, songwriter, record producer and music business executive.  He became well known, with Tony Waddington, as writer and producer of a series of UK chart hits in the 1970s for The Rubettes, and as a leading figure in SESAC – one of the three major American performing rights organisations.", "Born in Rhyl, Denbighshire, Wales, and named after his father, Bickerton grew up in Kirkdale, Liverpool.Curley, Mallory. Beatle Pete, Time Traveller (2005), p. 32 He first came to prominence in 1963 when, after spells with the Bobby Bell Rockers (featuring Det Pete), Steve & the Syndicate, Lee Curtis and the All-Stars and the Remo Four, he became bassist and singer with the Pete Best Four (later the Pete Best Combo), at the same time as childhood friend Tony Waddington became the group's guitarist.[  Biography by Bruce Eder at AllMusic]. Retrieved 11 November 2009 As well as sharing most of the singing, Bickerton and Waddington became songwriters for the group, which toured mainly in Germany and the US, before they left in 1966. The Pete Best Combo . Retrieved 11 November 2009", "During this period, he and Waddington also came up with the idea for a rock 'n' roll musical. They co-wrote and produced a demonstration recording of a song, \"Sugar Baby Love\", originally intending to submit it for the Eurovision Song Contest but instead offering it to Showaddywaddy, who turned it down. Bickerton and Waddington then offered it to the demo musicians, provided that they would become an actual group. The musicians agreed, became The Rubettes, and \"Sugar Baby Love\" became a UK #1 hit in 1974, also reaching No. 37 in the US charts and No. 25 in Canada.  They wrote and produced all of the Rubettes' subsequent UK hits – nine Top 50 hits in all between 1974 and 1977 – winning an Ivor Novello Award as Songwriters of the Year, Rubettes website:songs . Retrieved 16 November 2009 and also reached the UK Top 10 with \"Sugar Candy Kisses\" by Mac and Katie Kissoon. They set up their own record label, State Records, which diversified in 1979 into owning Odyssey Studios and a new office building at Marble Arch in central London, later sold to the radio station Jazz FM.Tony Waddington website . Retrieved 13 November 2009"]}, {"page": "Run the Length of Your Wildness", "response": ["# \"Tears in My Eyes\" (Tony Waddington, Wayne Bickerton) – 3:04"]}, {"page": "Lee Curtis and the All-Stars", "response": ["In mid 1962 they recruited band members from other local groups.  Original members were Frank Bowen (lead guitar), Tony Waddington (rhythm guitar), Wayne Bickerton (bass), and Bernie Rogers (drums).  However, when Pete Best was sacked by the Beatles, the Flannery brothers - apparently encouraged by the Beatles' manager Brian Epstein - decided to dispense with Rogers and install Best as the group's drummer. Biography by Bruce Eder, AllMusic They also occasionally performed with singer Beryl Marsden.  By the end of 1962, the group were one of the most successful in the area, and placed second in the Mersey Beat annual poll, behind the Beatles but ahead of Gerry and the Pacemakers, the Searchers, and other groups who later became nationally and internationally renowned.  Lee Curtis and the All-Stars were signed by Decca Records, and released two singles in early 1963, \"Little Girl\" and \"Let's Stomp\".  However, neither made the charts, and in mid 1963 the rest of the band decided to split from Curtis to form The Original All-Stars.  That group later became the Pete Best Four, and several years later Bickerton and Waddington moved on to become the writers and producers behind The Rubettes."]}, {"page": "State Records", "response": ["State Records is a British independent record label, established by Wayne Bickerton, Tony Waddington  and John Fruin in 1975. The label released hits by many successful artists including The Rubettes, Mac & Katie Kissoon and Delegation."]}, {"page": "Odyssey Studios", "response": ["Odyssey Studios was a recording studio based near Marble Arch in London and opened in 1979. It was set up by Wayne Bickerton as an extension of State Records, the label he had set up with Tony Waddington and John Fruin in 1975. The studio closed in 1989 and the building was subsequently sold to Jazz FM."]}, {"page": "We Can Do It (album)", "response": ["#\"I Can Do It\" (Wayne Bickerton, Tony Waddington) – 3:21", "#\"The Sha-Na-Na-Na Song\" (Wayne Bickerton, Tony Waddington) – 2:59", "#\"It's Just Make Believe\" (Wayne Bickerton, Tony Waddington) – 3:17", "#\"Juke Box Jive\" (Wayne Bickerton, Tony Waddington) – 3:00", "#\"Don't Do It Baby\" (Wayne Bickerton, Tony Waddington) – 3:44", "#\"At The High School Hop Tonight\" (Wayne Bickerton, Tony Waddington) – 2:42", "*Produced by Wayne Bickerton and Tony Waddington"]}, {"page": "Wear It's 'At", "response": ["Wear It's 'At is the debut album by English pop band The Rubettes assembled in 1973 by the songwriting team of Wayne Bickerton, then the head of A&R at Polydor Records, and his co-songwriter, Tony Waddington, after their doo-wop and 1950s American pop-influenced songs had been rejected by a number of existing acts. Tracks from this album also exhibited the doo-wop style. The album title was a reference to the group's wearing trademark white suits and white cloth caps on stage, a white cap being shown on the album front cover.", "#\"Way Back in the Fifties\" (Wayne Bickerton, Tony Waddington) – 3:37", "#\"Rock is Dead\" (Wayne Bickerton, Tony Waddington) – 3:09", "#\"Tonight\" (Wayne Bickerton, Tony Waddington) – 3:42", "#\"Sugar Baby Love\" (Wayne Bickerton, Tony Waddington) – 3:31", "#\"When You’re Sixteen\" (Wayne Bickerton, Tony Waddington) – 2:46", "#\"Saturday Night\" (Wayne Bickerton, Tony Waddington) – 2:18Original album sleeve notes"]}, {"page": "Rubettes (album)", "response": ["Rubettes is the third studio album by the English pop band The Rubettes, released on the State Records label in November 1975, their third studio album release within 12 months. It was the last Rubettes album produced by Wayne Bickerton and Tony Waddington.The album contained two UK top 40 hits - Foe Dee O Dee and Little Darling.", "#\"Judy Run Run\" (Wayne Bickerton, Tony Waddington) - 3:04", "#\"Little Darling\" (Wayne Bickerton, Tony Waddington) - 3:20", "#\"Put A Back Beat To That Music\" (Wayne Bickerton, Tony Waddington) - 3:39", "#\"Foe-Dee-O-Dee\" (Wayne Bickerton, Tony Waddington) - 3:01", "#\"I'm Just Dreaming\" (Wayne Bickerton, Tony Waddington) - 3:06", "#\"Dark Side Of The World\" (Wayne Bickerton, Tony Waddington) - 4:03Original album sleeve notes", "*Produced by Wayne Bickerton and Tony Waddington"]}, {"page": "Tonight (Rubettes song)", "response": ["\"Tonight\" was the second single released by The Rubettes from their debut album Wear It's 'At.  Written by Wayne Bickerton and Tony Waddington and produced by Bickerton, the single reached number 12 in the UK charts.", "Category:Songs written by Tony Waddington (songwriter)"]}, {"page": "Juke Box Jive", "response": ["\"Juke Box Jive\", by English band The Rubettes, was the lead single from their second album We Can Do It.  As with their two previous singles, it was written by the songwriting team of Wayne Bickerton and Tony Waddington and produced by Bickerton. The single reached number 3 in the UK charts.", "Category:Songs written by Tony Waddington (songwriter)"]}, {"page": "I Can Do It", "response": ["\"I Can Do It\" was the fourth single released by the English band The Rubettes and the second single from their album We can do it.  The song was written and produced by Wayne Bickerton and Tony Waddington. It reached number 7 in the UK charts, making it the band's third top 10 UK hit from four single releases.", "Category:Songs written by Tony Waddington (songwriter)"]}, {"page": "Sign of the Times (Rubettes album)", "response": ["Sign of the Times is the fourth studio album by the English band The Rubettes. It was released on the State Records label in June 1976. The album represented a significant change in direction for the band, as it was the first not produced by Wayne Bickerton and Tony Waddington – instead the Rubettes took on production responsibilities themselves, with Alan Blakley (formerly of the Tremeloes) as co-producer. The band made the decision due to the disappointing sales of their previous two Bickerton/Waddington singles and the desire to forge new musical directions.Liner notes from CD box set Rubettes – The Albums 1974–77"]}]}}