{"wiki_id": "http://www.wikidata.org/entity/Q7822021", "itemLabel": "Tony Capstick", "itemDescription": "British actor (1944-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Capstick", "wikipedia_page": {"main": "Joseph Anthony Capstick (27 July 1944 – 23 October 2003) was an English comedian, actor, musician and broadcaster.", "link_mentions": [{"page": "October 23", "response": ["*2003 – Tony Capstick, English actor and singer (b. 1944)"]}, {"page": "2003 in music", "response": ["*October 23 – Tony Capstick (59), comedian, actor and musician"]}, {"page": "Ewan MacColl", "response": ["Seeger and MacColl recorded several albums of searing political commentary songs. MacColl himself wrote over 300 songs, some of which have been recorded by artists (in addition to those mentioned above) such as Planxty, the Dubliners, Dick Gaughan, Phil Ochs, the Clancy Brothers, Elvis Presley, Weddings Parties Anything and Johnny Cash. In 2001, The Essential Ewan MacColl Songbook was published, which includes the words and music to 200 of his songs. Dick Gaughan, Dave Burland and Tony Capstick collaborated in The Songs of Ewan MacColl (1978; 1985)."]}, {"page": "Glossary of British terms not widely used in the United States", "response": ["; wazzock : an idiot, popularised (at least in Southern England) by the 1981 song \"Capstick Comes Home\" by Tony Capstick, originated and historically more common in Northern England"]}, {"page": "English folk music", "response": ["The difficulty of gaining regular appearances on television in England has long meant that radio has remained the major popular medium for increasing awareness of the genre. The EFDSS sponsored the BBC Home Service radio program, As I Roved Out, based on field recordings made by Peter Kennedy and Séamus Ennis from 1952 to 1958, which probably did more than any other single factor to introduce the general population to British folk music in the period.B. Sweers, Electric Folk: The Changing Face of English Traditional Music (Oxford: Oxford University Press, 2005), p. 119. Also important were occasional radio shows, such as Lomax's Ballads and Blues (1951),Lifton, Sarah (1983) The Listener's Guide to Folk Music. Poole: Blandford Press; p. 9 MacColl's Radio-ballads (1958–64) and The Song Carriers (1968). John Peel frequently included folk music of his Top Gear show on Radio One from 1968, but dropped it when punk arrived in the 1970s. The most consistent source of folk music on radio, has been BBC Radio 2. In 1967 \"My Kind of folk\" was broadcast on Wednesdays. In 1970 \"Folk on Friday\" began, presented by Jim Lloyd. In 1972 it became \"Folk on Sunday\".S. Street, A Concise History of British Radio, 1922–2002 (Tiverton: Kelly Publications, 2002), p. 129. \"Folkweave\" was presented by Tony Capstick 1975–8. \"Folk on Two\" (Wednesdays) began in 1980. In 1998 Jim Lloyd retired from the programme and was replaced by Mike Harding. In 2007 it was renamed \"The Mike Harding Folk Show\". In October 2012 it was announced that Mike Harding would be leaving the programme to be replaced by Mark Radcliffe.BBC Press release http://www.bbc.co.uk/mediacentre/latestnews/2012/mark-radcliffe-adds-folk-to-radio-2-roster.html, retrieved 18/10/2012. Ian A. Anderson, editor of \"fRoots\", also presented the occasional series for Radio Two. He hosted a World music programme on \"Jazz FM\" and then spent 10 years broadcasting on the BBC World Service. He currently hosts \"fRoots Radio\" on the web.fRoots radio, http://www.frootsmag.com/radio/ fRoots radio, retrieved 17/02/09. For over twenty years, until 2006, Charlie Gillett presented World music on BBC London."]}, {"page": "BBC Radio Sheffield", "response": ["*Tony Capstick"]}, {"page": "Dick Gaughan", "response": ["Gaughan resumed his solo career and on his next album, Kist O Gold (recorded in 1975), he sang mainly traditional songs, using only his guitar as accompaniment. In that year he also recorded two tracks with The High Level Ranters on their album The Bonnie Pit Laddie. He was, however, becoming frustrated with the folk club scene and keen to work with other musicians, so he joined the Celtic rock band Five Hand Reel. Between 1976 and 1978 the pace of Gaughan's life was hectic. He recorded four albums with Five Hand Reel (three under their own name and one in collaboration with the Danish folksinger Alan Klitgaard), as well as two solo ones: the all-instrumental Coppers and Brass (1975), and Gaughan (1978), on which he played both acoustic and electric guitars. He also collaborated with Tony Capstick and Dave Burland in an album of songs by Ewan MacColl.", "*Songs of Ewan MacColl (Rubber, 1978) (with Dave Burland and Tony Capstick)"]}, {"page": "Mike Harding", "response": ["* There Was This Bloke (1974 Rubber Records RUB 010) with Tony Capstick, Derek Brimstone and Bill Barclay"]}, {"page": "List of people from Sheffield", "response": ["*Tony Capstick, comedian, actor, musician and broadcaster"]}, {"page": "Carlton Main Frickley Colliery Band", "response": ["The band has appeared on TV (Top of the Pops) and radio. On TV in 1981 they accompanied Tony Capstick, with The Sheffield Grinder; Capstick comes home; a partnership which saw them rise to number three in the hit parade."]}, {"page": "Willie o Winsbury", "response": ["| Tony Capstick (with Hedgehog Pie)"]}, {"page": "Toby Foster", "response": ["He started on the afternoon show from 2 until 5pm, taking over from Tony Capstick on 2 April 2002. He then worked with Antonia Brickell on a joint breakfast show in September 2004."]}, {"page": "List of Last of the Summer Wine characters", "response": ["| colspan=\"1\" | Tony Capstick", "| colspan=\"7\" | Tony Capstick", "| colspan=\"5\" | Tony Capstick", "(Tony Capstick; 1987, 1990–2004) Capstick made his first appearance in the 1987 special 'Big Day at Dream Acres', before becoming a semi-regular alongside Kitson from series 12 in 1990, up to his death in late 2003.  His last appearance was the episode 'Yours Truly – If You're Not Careful'. Capstick's character was spacey and less intelligent even than the often-oblivious Cooper.", "(Louis Emerick; 1988-89, 2004–10, 2014) Emerick first appeared alongside Kitson in 'Downhill Racer'.  He made one more appearance in the next series, in the episode 'Three Men and a Mangle', and later reappeared in 2004 to partner Kitson after Tony Capstick's death.  In series 29 he was finally given the name PC Walsh. Walsh is more level-headed than Cooper and enjoys \"taking the mickey\", but he tends to be a little more "]}, {"page": "2003 in the United Kingdom", "response": ["** Tony Capstick, actor (born 1944)"]}, {"page": "1944 in the United Kingdom", "response": ["* 27 July – Tony Capstick, English comedian, actor and musician (died 2003)"]}, {"page": "List of Peel sessions", "response": ["* Tony Capstick: (4 sessions, 1972–74)"]}, {"page": "Dave Rayner (cyclist)", "response": ["The Dave Rayner Fund was set up in his memory on 12 January 1995, to help riders make a career from racing on the continent. A  plaque and seat in his memory were unveiled at Gargrave, North Yorkshire on 9 July the same year. The first Rayners Ride around the Yorkshire Dales was held on 10 September and the first Dave Rayner dinner was held at Norfolk Gardens, Bradford on 4 November. Guests at the dinner were the comedian Tony Capstick, journalist John Morgan and Keith Audas. This dinner has become an annual event with guests such as Miguel Indurain, Bradley Wiggins, Mark Cavendish, and Eddy Merckx attending."]}, {"page": "List of former Coronation Street characters", "response": ["|Harvey Nuttall || Tony Capstick || 1995–1997, 1999"]}, {"page": "Walter Fairbairn", "response": ["Fairbairn has recorded with Tony Capstick, The Buskers, Mike Harding, Guy Manning, Tom Robinson, Tony Wilson, Ewan Carruthers, Paul Buckley, Gordon Tyrall, Alan Taylor, Scarlet Heights, Aiken's Drum and the Mighty Doonans."]}, {"page": "Last of the Summer Wine (series 9)", "response": ["*First appearance of Tony Capstick as a policeman"]}, {"page": "Last of the Summer Wine (series 13)", "response": ["*Guest Appearance Tony Capstick (1st P.C.)"]}, {"page": "Last of the Summer Wine (series 25)", "response": ["Louis Emerick takes over from Tony Capstick as the 2nd Policeman following the latter's death a year before. The former previously played the role twice in the late 1980s.", "*This episode marks the final appearance of Tony Capstick as the policeman due to his death six months before. Louis Emerick, would take over his role from the 2004 Christmas special until the show's end."]}, {"page": "Last of the Summer Wine (series 26)", "response": ["*Louis Emerick returns as PC Walsh after an absence of 15 years following the death of Tony Capstick.", "*Tony Capstick's character, 2nd policeman, is referred to as having been transferred to Huddersfield."]}, {"page": "Hedgehog Pie", "response": ["The origins of Hedgehog Pie were in a loose collection of folk musicians in Newcastle-upon-Tyne from 1969. It started in Hebburn when brothers Mick and Kevin Doonan and brothers Phil and Jim Murray started playing together in local pubs and clubs. By 1971 it had solidified into two members of the Doonan Family Band, Mick Doonan (flute) and Phil Murray (bass), together with Jed Grimes (guitar) and Andy Seagroat (fiddle).C. Dolmetsch, 'The Wonderful Legend of Hedgehog Pie', Porthole, 2 (1996), , retrieved 4 February 2009. This line-up acted as a backing group to Tony Capstick on his album His Round. In 1972 they added another Doonan Family Band member Stu Luckley (guitar and bass), plus his wife Margi Luckley (vocals) and Ian 'Walter' Fairburn (fiddle). Fairburn and Murray soon departed to join local band Jack the Lad, formed out of the split in Lindisfarne, and the group replaced them with Martin Jenkins (violin) from Dando Shaft. It seems to have been at this point that they adopted electric instruments. The reputation of Doonan and Jenkins probably helped them to secure them a contract with local label Rubber Records and it was this line-up that recorded the first album.", "*His Round with Tony Capstick (Rubber, 1971)"]}, {"page": "Bantam Cock", "response": ["The song \"Bantam Cock\" has been covered by Fred Wedlock, The Corries, Alex Beaton and Jasper Carrott. \"Sister Josephine\" has been covered by The Clancy Brothers, The Barron Knights, Colcannon and Robbie O'Connell. \"Old Molly Metcalfe\" has been covered by Tony Capstick and The Witches of Elswick. \"Brother Gorilla\" is Thackray's English translation/adaptation of the French song \"Le gorille\" by Georges Brassens."]}, {"page": "2003 in British television", "response": ["|Tony Capstick"]}, {"page": "1944 in British television", "response": ["* 27 July – Tony Capstick, English comedian, actor and musician (died 2003)"]}, {"page": "Geoff Heslop", "response": ["* His Round (Tony Capstick and Hedgehog Pie)", "*Punch and Judy Man (Tony Capstick)", "*There Was This Bloke (Mike Harding, Tony Capstick, Bill Barclay and Derek Brimstone)", "*Tony Capstick Does A Turn (Tony Capstick)", "*Songs of Ewan MacColl (Dick Gaughan, Dave Burland and Tony Capstick)"]}, {"page": "Capstick Comes Home", "response": ["#REDIRECT Tony Capstick"]}, {"page": "List of All Creatures Great and Small (1978–1990 TV series) characters", "response": ["*Allan, Fred — Tony Capstick", "*Hudson, Clem — Tony Capstick", "*Tony Capstick: Fred Allan in \"In Whom We Trust\" and Clem Hudson in the 1985 Christmas Special"]}, {"page": "List of television performers who died during production", "response": ["| Tony Capstick"]}, {"page": "Laurel Academy", "response": ["* Tony Capstick, comedian and broadcaster"]}, {"page": "Capstick (surname)", "response": ["*Tony Capstick (1944–2003), British comedian, actor, musician and broadcaster"]}, {"page": "Deaths in October 2003", "response": ["*Tony Capstick, 59, British actor, comedian, musician and broadcaster."]}, {"page": "List of UK top-ten singles in 1981", "response": ["|Tony Capstick", "| align=\"left\"|Tony Capstick and the Carlton Main Frickley Colliery Band"]}]}}