{"wiki_id": "http://www.wikidata.org/entity/Q7821851", "itemLabel": "Tony Barwick", "itemDescription": "British television scriptwriter (1934-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Barwick", "wikipedia_page": {"main": "Anthony Clive \"Tony\" Barwick (10 July 1934 – 18 August 1993) was a British television scriptwriter who worked extensively on series created and produced by Gerry Anderson.", "link_mentions": [{"page": "Captain Scarlet and the Mysterons", "response": ["With Gerry Anderson serving primarily as executive producer, most of the writing was done by Tony Barwick, who had previously written for Thunderbirds.Bentley 2001, p. 31. Originally Captain Scarlet's script editor, Barwick went on to pen 18 of its 32 episodes himself, besides making substantial revisions to other writers' work. Discussing his approach to scriptwriting in a 1986 interview, Barwick compared the premise and characters of Captain Scarlet to those of Thunderbirds – for example, likening Spectrum to the heroic International Rescue and the character of Captain Black to recurring villain the Hood.", "The series has been criticised for its camerawork, which some view as too static due to the crew's inability to move the puppets convincingly. Criticism has also been directed at the characterisation and writing. Sangster and Condon consider the plots uncomplicated and the characters perhaps \"even more simplistic\" than those of Stingray. Some have blamed the return to 25-minute episodes, coming after Thunderbirds 50-minute format, for a lack of subplots and perceived drop in the quality of the storytelling. In a 1986 interview, script editor Tony Barwick described Captain Scarlet as \"hard-nosed stuff\" that lacked humour, adding: \"It was all for the American market and to that extent there was no deep characterisation. [The characters] all balanced one against the other.\" Sylvia Anderson likened the presentation to that of a \"comic strip\", arguing that the action format came at the expense of the character development.Sellers, pp. 104–105. In contrast, Jeff Evans believes the characters to be \"more detailed\" than before, arguing that Captain Scarlet was the first Anderson production to give them \"private lives and real identities\". Paul Cornell, Martin Day and Keith Topping praise the writing, judging it \"neither as silly as previous Anderson efforts, nor as po-faced as later ones\"."]}, {"page": "Moonraker (novel)", "response": ["The novel was not one of Fleming's stories acquired by Eon Productions in 1961; in 1969 the company acquired the rights and commissioned Gerry Anderson to produce and co-write a screenplay. Anderson and Tony Barwick prepared a 70-page treatment that was never filmed, but some elements were similar to the final screenplay of The Spy Who Loved Me."]}, {"page": "Joe 90", "response": ["The series was commissioned by Lew Grade in the autumn of 1967. Pre-production was completed in October while the last episodes of Captain Scarlet were being filmed.La Rivière, p. 179. Principal photography ran from 13 November 1967 to mid-August 1968 on the two puppet stages at Century 21's studios on the Slough Trading Estate in Berkshire.Archer and Hearn, p. 168.La Rivière, p. 184.Bentley: Captain Scarlet, p. 114.Slough Trading Estate:  (principal photography and editing) Each episode took an average of two weeks to film. The script for the first episode, \"The Most Special Agent\", was written by Anderson and his wife Sylvia as had been the case on earlier series created by the couple. Before WIN was devised, Joe was to have become the \"Most Special Agent\" of the CIA. Most of the episodes were written by Tony Barwick, with Shane Rimmer contributing six scripts. Rimmer was hired while co-authoring a book with Barwick, who initially offered him a two-script contract (these were filmed as the episodes \"Splashdown\" and \"Big Fish\")."]}, {"page": "Shane Rimmer", "response": ["Rimmer had a long-running association with TV producer Gerry Anderson, including the series Thunderbirds (1964–1966). He was the voice actor behind the character of Scott Tracy. He drafted the story for the series' penultimate episode, \"Ricochet\" (1966), from which writer Tony Barwick penned a script. Rimmer thought the studio rates for voices in those days were \"absolutely deplorable\". Years after working on Thunderbirds, Rimmer, along with fellow Anderson associate Matt Zimmerman, retained a solicitor. They informed him of the sort of money they received, and the solicitor then gained Rimmer and Zimmerman an immense raise in the residuals.Thunderbirds: A Complete Guide to the Classic Series He also appeared in an episode of Danger Man."]}, {"page": "Captain Black (Captain Scarlet)", "response": ["In a 1986 interview in which he discussed his approach to writing for the series, Captain Scarlet script editor Tony Barwick drew parallels between the premise and characters of Captain Scarlet and those of Thunderbirds – suggesting, for example, that the Spectrum Organisation could be compared to International Rescue and that Black was similar to The Hood, the main recurring villain in Thunderbirds.Bentley 2001, p. 31."]}, {"page": "Terrahawks", "response": ["The series' most prolific contributor, Tony Barwick, constantly used tongue-in-cheek aliases whenever he wrote a different episode, calling himself, for instance, \"Anne Teakstein,\" and \"Felix Catstein.\" (He was not alone in this; Donald James wrote the episodes \"From Here To Infinity\" and \"The Sporilla\" under the names \"Katz Stein\" and \"Leo Pardstein\" respectively.) The only episodes of the series not credited to pseudonyms ending in \"-stein\" are \"The Midas Touch,\" scripted by Trevor Lansdowne and Tony Barwick, the latter billed under his real name for the only time on the series, and the two-part opener \"Expect The Unexpected,\" written by Gerry Anderson.", "A fourth season would have developed the characters of Stew Dapples (\"Stewed Apples\") and Kate Kestrel further. This was explained in a documentary on the special features disc of the series, in the Gerry Anderson book Supermarionation and the Terrahawks DVDs. Two of the scripts were called \"101 Seed\" (a parody of the title \"Number One Seed\"), written by Anderson himself (as \"Gerry Anderstein\"), and \"Attempted MOIDer\" by Tony Barwick (alias in this case D.I. Skeistein)."]}, {"page": "Donald James", "response": ["He was the author of the best-selling novels Vadim, Monstrum, The Fortune Teller and The Fall of the Russian Empire, as well as non-fiction books such as The Penguin Dictionary of the Third Reich. He wrote under a number of pseudonyms, notably Thomas Dresden and James Barwick (originally in collaboration with fellow writer Tony Barwick, another long-term contributor to the various television productions of Gerry and Sylvia Anderson and their company, AP Films/Century 21)."]}, {"page": "The AB Chrysalis", "response": ["\"The AB Chrysalis\" is the twelfth episode of the second series of Space: 1999 (and the thirty-sixth overall episode of the programme).  The screenplay was written by Tony Barwick; the director was Val Guest."]}, {"page": "One Moment of Humanity", "response": ["\"One Moment of Humanity\" is the third episode of the second series of Space: 1999 (and the twenty-seventh overall episode of the programme).  The screenplay was written by Tony Barwick; the director was Charles Crichton.  The original title was \"One Second of Humanity\".  The final shooting script is dated 12 February 1976.  Live-action filming took place Thursday 4 March 1976 through Wednesday 17 March 1976.Destination: Moonbase Alpha, Telos Publications, 2010.", "* The shooting script, written by former UFO script editor Tony Barwick, contains an epilogue cut for time from the final edit.  The viewer would have seen a restored Alpha dispatching a recovery Eagle, and Alan Carter arriving on Vega with cold-weather gear for Koenig and company.  With the Vegan city powered down, the Alphans discuss the future with the Numbers, who are looking forward to re-learning the basics of survival in their world's harsh environment.  Helena and Koenig then exchange banter regarding Zarl; though the android was a good-looking and masculine Iago, Helena states she much prefers her Othello.  The script's status-report date is stated as 415 days by Helena and was changed in post-production.\"One Moment of Humanity\" final shooting script dated 12 February 1976"]}, {"page": "List of The Professionals episodes", "response": ["| Tony Barwick", "| Tony Barwick"]}, {"page": "The Mysterons", "response": ["\"The Mysterons\" was written by the husband-and-wife team of Gerry and Sylvia Anderson, assisted by series script editor Tony Barwick.La Rivière 2009, p. 147. The Andersons devised the formats and characters of each Supermarionation series and usually wrote the first episode, which was often referred to as the \"pilot\". The appearance of the Zero-X Martian Exploration Vehicle, first seen in Thunderbirds Are Go (1966), was intended to mark the transition from APF's previous series, Thunderbirds, which is set in the same fictional world as Captain Scarlet.Bentley 2001, p. 59."]}, {"page": "Sun Probe", "response": ["Originally filmed as a 25-minute episode in late 1964, \"Sun Probe\" was lengthened to 50 minutes in January 1965 to satisfy APF's sponsor Lew Grade, who had been impressed with the pilot episode and ordered that all episodes of Thunderbirds be extended to fill a one-hour timeslot. Anderson, Alan Pattillo and Tony Barwick expanded Alan Fennell's original storyline by adding the subplot of Thunderbird 2s mission to Mount Arkan and the plot twists involving the failure of Thunderbird 3s retro-rockets and Virgil and Brains' discovery that they have taken Braman with them. The newly-written material also included a scene in which Brains and Braman play chess on Tracy Island and another that sees Harris, Asher and Camp preparing for blast-off at Cape Kennedy."]}, {"page": "The Inquisition (Captain Scarlet and the Mysterons)", "response": ["\"The Inquisition\" is the 32nd and final episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Ken Turner, it was first broadcast on 12 May 1968 on ATV London."]}, {"page": "Lunarville 7", "response": ["\"Lunarville 7\" is the 15th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and produced by their company Century 21 Productions. Written by Tony Barwick and directed by Robert Lynn, it was first broadcast on 15 December 1967 on ATV Midlands."]}, {"page": "Attack on Cloudbase", "response": ["\"Attack on Cloudbase\" is the 31st episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions for ITC Entertainment. The series' penultimate episode, it was written by Tony Barwick and first broadcast on 5 May 1968 on ATV London.", "In a DVD audio commentary that he recorded for the episode, Anderson stated that although \"Attack on Cloudbase\" was intended to be humorous, he believed that the finished episode was more of a \"black comedy\". He praised the script, noting Blue's feelings for Symphony and his conflict with White as examples of Tony Barwick's \"humanisation\" of the puppet characters. He also described Captain Magenta's comical commentary on the attack, which ends only with the character's death, as another \"wonderful example of 'Barwickism'\". Though acknowledging that dream sequences might seem clichéd, he defended the episode's use of a nightmare plot mechanism for its power to frighten, and then re-assure, the audience. He argued that the dark tone is lightened by the closing scene, which he said was written as there had to be \"a sequence where everyone was happy together, and clearly no one had come to any grief\", thus forming the \"inevitable happy ending\" to a tragic story."]}, {"page": "Winged Assassin", "response": ["\"Winged Assassin\" is the second episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by David Lane, it was first broadcast on 6 October 1967 on ATV Midlands.", "In Tony Barwick's script, the DT-19 co-pilot is called Johnson. Dialogue in the episode indicates that it is set on 10 July, the same day as the events of \"Treble Cross\" and the closing scene of \"Flight to Atlantica\".Bentley 2008, p. 134. Barwick was fond of inserting references to 10 July as that was his birthday.Bentley 2001, p. 78. The scale model of the entrance to London International Airport was designed by special effects assistant Mike Trim.Bentley 2017, p. 84."]}, {"page": "Big Ben Strikes Again", "response": ["\"Big Ben Strikes Again\" is the third episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson. Written by Tony Barwick and directed by Brian Burgess, it was first broadcast on 13 October 1967 on ATV Midlands."]}, {"page": "Spectrum Strikes Back", "response": ["\"Spectrum Strikes Back\" is the tenth episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Ken Turner, it was first broadcast on 24 November 1967 on ATV Midlands."]}, {"page": "Traitor (Captain Scarlet and the Mysterons)", "response": ["\"Traitor\" is the 17th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by series script editor Tony Barwick and directed by Alan Perry, it was first broadcast on 14 January 1968 on ATV London."]}, {"page": "Crater 101", "response": ["\"Crater 101\" is the 21st episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Ken Turner, it was first broadcast on 26 January 1968 on ATV Midlands.", "\"Crater 101\" is one of several Captain Scarlet scripts by Tony Barwick to include a mention of 10 July (the inscription on Nolan's charm states that the CB29 probe reached Neptune on 10 July 2058). Barwick liked to insert references to this date as it was his birthday.Bentley 2001, p. 79. The script indicated that Lunarville 6 is smaller than Lunarville 7, which was destroyed in the episode of the same name. However, the two colonies are introduced with the same establishing shot, which was duplicated from the earlier episode for its appearance in \"Crater 101\"."]}, {"page": "Shadow of Fear", "response": ["\"Shadow of Fear\" is the 12th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Robert Lynn, it was first broadcast on 2 February 1968 on ATV Midlands."]}, {"page": "The Most Special Agent", "response": ["In the earliest version of the script, written in the autumn of 1967, Joe was to have joined the CIA.Pixley 2002, p. 53. Shane Weston was originally written as the Deputy Director of the CIA, with the meeting between the characters taking place at the Embassy of the United States in London. The agency's name and Weston's position were changed when Shane Rimmer and script editor Tony Barwick composed the bible for the series.Pixley 2002, p. 54. The original script included a short scene, absent from the finished episode, in which a London police officer pauses in amazement at the sight of the Jet-Air Car parked in the street. It also featured an extended version of the McClaines' flight to Moscow, with Mac telling Joe that Russia is letting foreigners view the MiG-242 because it wants the world to see the aircraft as a \"purely defensive weapon\". In the finished episode, this is reduced to a single shot of Mac and Joe without dialogue."]}, {"page": "Dangerous Rendezvous", "response": ["\"Dangerous Rendezvous\" is the 22nd episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Brian Burgess, it was first broadcast on 9 February 1968 on ATV Midlands.", "By the time script editor Tony Barwick wrote \"Dangerous Rendezvous\" and \"Traitor\", filming on Captain Scarlet was several weeks behind schedule. To remedy this, Barwick wrote a flashback to the first episode into each script to reduce the amount of new footage that would need to be shot, enabling the two episodes to be filmed in a combined 15 days instead of 20. Although the script for \"Dangerous Rendezvous\" allotted four minutes of the 25-minute running time for this old material, the flashback in the finished episode – in which Colonel White recalls humanity's disastrous first contact with the Mysterons – runs for about two minutes.Bentley 2017, p. 151.", "Media historian Nicholas J. Cull suggests that the premise was inspired by contemporary events, writing that the possibility of peace between Earth and Mars reflects \"shifting attitudes\" in the Cold War. Comparing \"Dangerous Rendezvous\" to other Tony Barwick scripts, Cull observes that Barwick's work often \"reflected a yearning for détente and an alternative to the divided world.\""]}, {"page": "Treble Cross", "response": ["\"Treble Cross\" is the 24th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and produced by their company Century 21 Productions. Written by Tony Barwick and directed by Alan Perry, it was first broadcast on 23 February 1968 on ATV Midlands.", "\"Treble Cross\" is one of several Captain Scarlet scripts by Tony Barwick that include a mention of 10 July. Barwick liked to insert references to this date as it was his birthday.Bentley 2001, p. 78. The episode was filmed over two weeks in September 1967, during which time Century 21 began pre-production of its next Supermarionation series, Joe 90.", "Media historian Nicholas J. Cull regards \"Treble Cross\" as one of several Captain Scarlet episodes that highlight scriptwriter Tony Barwick's interest in the dangers of nuclear technology. He regards the plot involving the attempted theft of a nuclear warhead as an example of Barwick re-using his \"favourite [plot] device\"."]}, {"page": "The Trap (Captain Scarlet and the Mysterons)", "response": ["Script editor Tony Barwick asked Alan Pattillo to write for Captain Scarlet because Pattillo had been a regular writer on Thunderbirds.Drake and Bassett, p. 264. However, commitments to other projects meant that Pattillo was able to submit only one script for the new series. The castle setting was influenced by Gerry Anderson, who according to Pattillo \"always liked to have a Scottish subject in his series.\"Drake and Bassett, p. 265. Pattillo's script called for technically-complex puppet scenes in which all ten marionettes playing conference delegates appear in the same shot.Drake and Bassett, p. 266. Due to the large number of guest characters the wardrobe department was required to make several new military uniforms."]}, {"page": "Ricochet (Thunderbirds)", "response": ["\"Ricochet\" is an episode of Thunderbirds, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company AP Films (APF; later Century 21 Productions). Written by Tony Barwick and directed by Brian Burgess, it was the penultimate episode to be produced and was first broadcast on 6 November 1966 on ATV London and Anglia Television as the fifth episode of Series Two."]}, {"page": "Manhunt (Captain Scarlet and the Mysterons)", "response": ["\"Manhunt\" is the fourth episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and produced by their company Century 21 Productions. Written by Tony Barwick and directed by Alan Perry, it was first broadcast on 20 October 1967 on ATV Midlands."]}, {"page": "List of Terrahawks episodes", "response": ["! Written byMost of the episodes were written by Tony Barwick under various pseudonyms. The only exceptions were the two-part first episode, \"Expect the Unexpected\" (which was written by Gerry Anderson), \"From Here To Infinity\" and \"The Sporilla\" (which were written by Donald James under pseudonyms), and \"The Midas Touch\" (which Barwick co-wrote with Trevor Lansdown)."]}, {"page": "Inferno (Captain Scarlet and the Mysterons)", "response": ["\"Inferno\" is the 25th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and Shane Rimmer and directed by Alan Perry, it was first broadcast on 16 April 1968 on ATV Midlands."]}, {"page": "Flight to Atlantica", "response": ["\"Flight to Atlantica\" is the 20th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Leo Eaton, it was first broadcast on 24 March 1968 on ATV London.", "\"Flight to Atlantica\" is one of two Captain Scarlet episodes (the other being \"Attack on Cloudbase\") to feature all of the regular puppet characters, although not all of them have speaking parts. It is also one of several scripts by Tony Barwick to include a mention of 10 July – a date that Barwick liked to reference in his work, since that was his birthday."]}, {"page": "Special Assignment (Captain Scarlet and the Mysterons)", "response": ["\"Special Assignment\" is the fourteenth episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Robert Lynn, it was first broadcast on 1 December 1967 on ATV Midlands.", "Writer Fred McNamara criticises the episode's \"clumsy, scrambling premise\" and \"bizarre\" structure, commenting: \"So much of it is stitched together so loosely. Everything in its set-up feels like it's in the wrong order, or that there's entire chunks of plot missing.\" He questions the logic of the Mysterons' methods, noting that while the purpose of the reconstructed Kramer and Steele seems to be to recruit the disgraced Scarlet, the aliens murder the original conmen before Scarlet is dismissed from Spectrum (\"They had no way of knowing Captain Scarlet would fall right into their hands, so had Spectrum kept their plan hush-hush for a later date, what exactly would the Mysterons' plan have entailed?\") Despite this, McNamara also considers the episode to be \"full of visual strengths\" and engaging \"human aspects\", praising the \"harrowing sight\" of the SPV being targeted by the Angel squadron as well as Ed Bishop and Francis Matthews's \"crisp, stirring\" voice acting during the scenes of the concerned Captain Blue's search for his friend Scarlet. He also admires scriptwriter Tony Barwick's skill in \"playfully twisting Cold War motifs\" as Spectrum and the Mysterons try to outwit each other and Scarlet seemingly defects to the Mysterons. McNamara concludes that \"[s]ometimes it's best to just let go of the madness and embrace the episode for what is – a lovely bit of Cold War-inspired trickery.\""]}, {"page": "The Heart of New York (Captain Scarlet and the Mysterons)", "response": ["\"The Heart of New York\" is the 16th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Alan Perry, it was first broadcast on 8 December 1967 on ATV Midlands."]}, {"page": "Avalanche (Captain Scarlet and the Mysterons)", "response": ["Actor Shane Rimmer had a prior association with Century 21, having voiced the character Scott Tracy in Thunderbirds and narrated the series' alternative two-part episode format. Impressed by his work, the Andersons asked him to write an episode of Captain Scarlet. Rimmer immediately agreed and was soon telephoned by series script editor Tony Barwick, who had an outline for an episode titled \"Avalanche\" and told Rimmer that a courier would \"'[drop] the storyline over to you in about an hour. Take today and tomorrow and see how you'd go about filling it in.'\" Resigning from his part-time job at a sheet metal factory to focus on this task, Rimmer put together a draft treatment over the next 24 hours; he found the characters and plot elements a \"heavy mix to juggle with\" but managed to incorporate \"one or two workable story developments that avoided stepping on the toes of the series concept or any of the main characters.\" Rimmer and Barwick revised the draft two days after. After the script for \"Avalanche\" was completed, Rimmer started work on treatments for the episodes \"Expo 2068\" and \"Inferno\" – jobs that, in his words, \"more or less took care of '67\". He later wrote scripts for Joe 90, The Secret Service and The Protectors.Bentley 2017, p. 29."]}, {"page": "Captain Blue (Captain Scarlet)", "response": ["Captain Blue was among the first characters to be conceived by series creator Gerry Anderson who, having determined that \"Scarlet\" would make for an unusual codename for the series' protagonist, resolved that his mission partner could be codenamed \"Blue\". Audio commentary for \"Attack on Cloudbase\". Script editor Tony Barwick, who commented on what he perceived as the series' \"quite formalised writing\", wrote Blue as \"the foil, the nice guy\" of Captain Scarlet.Bentley 2001, p. 31."]}, {"page": "Flight 104", "response": ["\"Flight 104\" is the 26th episode of Captain Scarlet and the Mysterons, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 Productions. Written by Tony Barwick and directed by Robert Lynn, it was first broadcast on 1 March 1968 on ATV Midlands."]}, {"page": "Noose of Ice", "response": ["The closing credits incorrectly state that the episode was written by Tony Barwick. \"Noose of Ice\" follows on directly from Barwick's episode \"Flight 104\", in which the nature of Earth's return to Mars has yet to be decided. Although \"Noose of Ice\" was filmed and originally broadcast after \"Flight 104\", the running order published by distributor ITC Entertainment places it before that episode, disrupting the series continuity.Bentley 2017, p. 171."]}, {"page": "The Unorthodox Shepherd", "response": ["\"The Unorthodox Shepherd\" is the eighth episode of Joe 90, a British Supermarionation television series created by Gerry and Sylvia Anderson and filmed by their production company Century 21 for ITC Entertainment. Written by Tony Barwick and directed by Ken Turner, it was first broadcast on 22 December 1968 on Anglia, Associated and Ulster Television.Pixley 2019, pp. 104-105."]}]}}