{"wiki_id": "http://www.wikidata.org/entity/Q7823371", "itemLabel": "Tony Scoggo", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Scoggo", "wikipedia_page": {"main": "Tony Scoggo (born Anthony Scoggins on 6 May 1936) is a British actor best known for his role in the television soap opera Brookside. He played Matty Nolan in the series from 1982 to 1992.\nOther TV roles include: Boys from the Blackstuff and Doctor Who (in the serial Terror of the Vervoids).", "link_mentions": [{"page": "Brookside (TV series)", "response": ["The introduction of Brookside Parade saw Ron Dixon open a convenience store called Dixon's Trading Post, Barry Grant opened a bar/nightclub initially called La Luz, and Terry Sullivan opened Pizza Parade, where Matty Nolan (Tony Scoggo) and Owen Daniels worked for a while. Other businesses opened soon afterwards, including a salon run by Angela Lambert (Hilary Welles), a florist run by DD Dixon, a petrol station, and eventually a health club complete with swimming pool. These businesses meant that the main focus of Brookside shifted away from the houses and families of Brookside Close to this new, modern set – and many storylines went with it. To launch Brookside Parade in 1991, and coinciding with the soap's 1000th episode, the writers (now led by senior producer Mal Young)20 Years of Brookside by Graham Kibble-White. Page 75 developed the controversial storyline of the double-murder of pregnant Sue Sullivan and baby Danny. The two were pushed off scaffolding, crashing through a glass canopy to their deaths, supposedly by lawyer Graeme Curtis (David Banks) in a grim 'whodunnit' plotline which saw ratings soar.Brookside: The First Ten Years. The Authorised History. Boxtree. Pages 20 and 21"]}, {"page": "List of Brookside characters", "response": ["|Matty Nolan || Tony Scoggo || 1982–1992"]}, {"page": "Sheila Grant", "response": ["Sheila Corkhill (also Grant) is a fictional character from British soap opera, Brookside played by Sue Johnston.  Sheila appeared in Brookside from the first episode in 1982 until the character's departure in 1990. Her most famous storyline was in 1986, when the character was attacked, raped and beaten by an unknown assailant. Everyone was a suspect, including family friend Matty Nolan (Tony Scoggo), and most residents of Brookside Close found themselves accused. It was later revealed that the taxi driver raped Sheila.", "After Bobby had spent his first months of Brookside Close fighting to save his job and 200 others at Fairbanks Engineering, Sheila is the one made redundant in 1983.  In an attempt to occupy herself she joined Annabelle Collins' (Doreen Sloane) Ratepayers Association and forged an unlikely friendship with her.  The two however disagree when Sheila nominated Roger Huntingdon (Rob Spendlove) as chairman instead of Annabelle and when they clash over what type of group it should be with Annabelle wanting it to be an apolitical group bringing issues such as hedges and refuse collection to the attention of the council while Sheila wanted to use it to campaign about the poor standard of schooling in the area and the lack of jobs for their children. Later, in an attempt to make a living, Sheila establishes a non-registered employment agency. This has the unfortunate result of having friend Matty Nolan (Tony Scoggo) prosecuted for benefit fraud."]}, {"page": "Out of Order (1987 film)", "response": ["* Tony Scoggo ...  Man in Pub"]}]}}