{"wiki_id": "http://www.wikidata.org/entity/Q7823086", "itemLabel": "Tony O'Malley", "itemDescription": "Irish artist (1913-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_O%27Malley", "wikipedia_page": {"main": "Tony O'Malley (25 September 1913 – 20 January 2003) was an Irish artist. He was born in Callan, County Kilkenny, Ireland. O'Malley was a self-taught artist, having drawn and painted for pleasure from childhood. He worked as a bank officìal until contracting tuberculosis in the 1940s. He began painting in earnest while convalescing and, though he did at first return to bank work, he continued to paint and in 1951 he began exhibiting his work.", "link_mentions": [{"page": "Camille Souter", "response": ["Souter has won many awards including the Tony O'Malley award in 1998, and the Irish Museum of Modern Art's Distinguished Career Award in 2000. In 2015, Trinity College Dublin awarded her with an honorary doctorate."]}, {"page": "List of Irish artists", "response": ["*Tony O'Malley (1913–2003) – self-taught painter"]}, {"page": "2003 in Ireland", "response": [":21 January – Tony O'Malley, painter (born 1913)."]}, {"page": "1913 in Ireland", "response": ["*25 September – Tony O'Malley, painter (died 2003)."]}, {"page": "Irish art", "response": ["Irish Modernism began with Mainie Jellett, with later participants being The White Stag group, The Exhibition of Living Art, Norah McGuinness, Louis le Brocquy, Patrick Scott, Patrick Swift, and John Kingerlee.  Abstract expressionists included Tony O'Malley, Nano Reid and Patrick Collins.Irish Arts Review Spring 2009: \"Patrick Collins: A Modern Celt\", Brian Fallon "]}, {"page": "Callan, County Kilkenny", "response": ["* Tony O'Malley, Irish painter"]}, {"page": "2003 in art", "response": ["*21 January – Tony O'Malley, Irish painter (b.1913)."]}, {"page": "Padraic Fallon", "response": ["Fallon was born and raised in Athenry, County Galway; his upbringing and his early impressions of the town and the surrounding landscape are intimately described in his poetry. After passing the civil service exams in 1923 he moved to  Dublin to work in the Customs House. In Dublin he became part of the circle of George William Russell (Æ) who encouraged his literary ambitions and arranged for the publication of his early poetry. He formed close friendships with Seumas O'Sullivan, editor of The Dublin Magazine, the poets Austin Clarke, Robert Farren, F.R. Higgins and Patrick McDonagh, and later the novelist James Plunkett. In 1939, Fallon left Dublin to serve as a Customs official in County Wexford, living in Prospect House, near Wexford Town with his wife, Dorothea (née Maher) and his six sons. During this time he became a close friend of the painter Tony O'Malley. Fallon retired from the Civil Service in 1963, returning to Dublin before moving to Cornwall in 1967 to live with his son, the sculptor Conor Fallon and his daughter-in-law, the artist Nancy Wynne-Jones. He and his wife returned to Ireland in 1971. He spent his last years in Kinsale. He was visiting his son Ivan Fallon in Kent at the time of his death.A Look in the Mirror and Other Poems, pp. 141–143."]}, {"page": "List of Kilkenny people", "response": ["*Tony O'Malley (1913–2003)"]}, {"page": "1913 in art", "response": ["* September 25 – Tony O'Malley, Irish painter (died 2003)"]}, {"page": "Gordon Haskell", "response": ["His next album reached Number 14 in the Polish album charts.  Called The Lady Wants To Know, it contained eleven tracks, was produced by Hamish Stuart and featured Tony O'Malley and Robbie McIntosh. A DVD, \"The Road To Harry's Bar\", was released in 2005 and Haskell also published his autobiography under the same title, with the foreword written by David Nobbs, creator of The Fall and Rise of Reginald Perrin."]}, {"page": "Butler Gallery", "response": ["Butler Gallery is a contemporary art gallery and museum in Kilkenny, Ireland. It presents a collection of works by Irish and international artists from the 18th century to the present day. A wing has been devoted to the work of the Callan artist Tony O'Malley and his wife Jane."]}, {"page": "O'Malley (surname)", "response": ["* Tony O'Malley (1913–2003), Irish painter"]}, {"page": "Universal Links on Human Rights", "response": ["Universal Links on Human Rights is a memorial sculpture located in Dublin, Ireland, on the traffic island at the junction of Amiens Street, Beresford Place, and Memorial Road, close to Busáras and The Customs House. It is a sphere of welded interlinked chains and bars, 260 cm in diameter, housing an eternal flame in its center, powered by natural gas from the Kinsale Head gas field. It was commissioned by Amnesty International in 1995 and designed by Tony O'Malley. It represents the jails holding prisoners of conscience.  "]}, {"page": "Brian Fallon (critic)", "response": ["*Tony O'Malley, by Enrique Juncosa (Author), Caoimhin Mac Giolla Leith (Author), Catherine Marshall (Author), Brian Fallon (Author), Irish Museum of Modern Art (17 Nov 2005)."]}, {"page": "Coláiste Éamann Rís", "response": ["The extension and rebuilding of three classrooms was completed in early May 2011. The present art room was refurbished during the 2006-2007 school year and this room was dedicated to past pupil and famous Irish artist, Tony O'Malley.", "* Tony O'Malley, artist."]}, {"page": "Ramie Leahy", "response": ["Ramie Leahy is an Irish artist  and a co-founder of Ireland's first international arts festival, Kilkenny Arts Festival. One of the group of Kilkenny Colourists, a group he founded with his peers Francis Tansey and Tony O'Malley, he has variously been described as an impressionist and a surrealist, whose works range from landscapes to political satire and natural history studies."]}, {"page": "Max Meazza", "response": ["In 2009, he played live with the Australian guitar Rock/Blues musician Rob Tognoni, recording the album Race Against Destiny, featuring the cover of the song Down and Dirty written by Bad Company and Tognoni on guitar. Other guests included jazz guitarist Gigi Cifarelli on the song Solid Air written by John Martyn. Another CD came out in 2013, entitled In Cold Blood under the name Max Meazza & Pueblo, featuring Tony O'Malley on vocals and keyboards."]}, {"page": "List of Irish painters", "response": ["* Tony O'Malley (1913–2003)"]}, {"page": "David Quinn (visual artist)", "response": ["Quinn studied Visual Communications at Dublin Institute of Technology (DIT) from 1989 to 1993. Quinn has been exhibiting regularly with the Taylor Galleries, Dublin since 2004. His work is included in the collections of Electric Ireland, Bank of Ireland, Office of Public Works, Eaton Corporation, AIB Corporate Banking and the Morrison Hotel, Dublin.  In 2015 he was the recipient of the Tony O'Malley Studio Residency Award."]}, {"page": "Deaths in January 2003", "response": ["*Tony O'Malley, 89, Irish artist and painter."]}, {"page": "List of members of Aosdána", "response": ["|\tTony O'Malley\t"]}, {"page": "Nancy Wynne-Jones", "response": ["In 1962 Wynne-Jones bought Trevaylor House near Penzance and provided accommodation for other artists including renowned Irish painter Tony O'Malley, sculptor Conor Fallon and English poet and writer W. S. 'Sydney' Graham. In the 1970s she exhibited in Ireland; at the Project Arts Centre, Dublin (1970) and at the Emmet Gallery, Dublin (1975 and 1977). During the 1980s Wynne-Jones exhibited at the Lincoln and Hendricks galleries in Dublin; before joining the Taylor Gallery, run by John and Patrick Taylor. She was elected honorary member of the RHA in 1994 and became a member of Aosdána in 1996. Originally an abstract artist, her contact with the Irish countryside slowly transformed her work to that of a landscape artist, albeit with an influence of abstraction attached to it. She became well known in Irish art circles as an eminent Irish landscape artist."]}, {"page": "Conor Fallon", "response": ["Conor Hubert Fallon was born in Dublin to Padraic Fallon the Irish poet and playwright and Dorothea Maher. The family moved to Clonard, County Wexford where Fallon grew up. He had three surviving brothers, Brian, Ivan and Padraic who have all had journalism careers, though he was the third of six sons. Fallon was educated in  St. Peter's College, Wexford. Fallon began painting in 1957 in Trinity College Dublin where he was studying natural science however there he was advised to pay more attention to his art. As a compromise with his father who didn't see his talent he also studied accountancy at night. Friends with Tony O'Malley Fallon spent time in St Ives, Cornwall where he met his wife Nancy Wynne-Jones. Fallon married Wynne-Jones in 1966. They adopted 2 children in 1970, siblings John and Bridget, and moved to Kinsale in 1972. In 1987 the family moved again to Rathdrum, County Wicklow. Fallon died of cancer in 2007 a year after his wife."]}, {"page": "Beresford Place", "response": ["In 1996 a statue of James Connolly by Éamonn O'Doherty was erected on the street just west of the Custom House, facing onto Liberty Hall. At the other end of the street, at the junction of Beresford Place, Amiens Street, and Memorial Road is the sculpture Universal Links on Human Rights by Tony O'Malley, erected in 1995."]}]}}