{"wiki_id": "http://www.wikidata.org/entity/Q7823378", "itemLabel": "Tony Scullion", "itemDescription": "Irish hurler and Gaelic footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Scullion", "wikipedia_page": {"main": "Tony \"The Tiger\" Scullion (born 6 February 1962) is a former dual player of Gaelic games who played Gaelic football and hurling with Derry in the 1980s and 1990s. He is chiefly known as a footballer and was part of Derry's 1993 All-Ireland Championship winning side, also winning Ulster Senior Football Championships in 1987 and 1993. With Derry footballers he usually played in the full-back line and is regarded as one of the best full-backs of his generation. Scullion played club football and hurling with St Colm's GAC Ballinascreen.\nScullion is among the few players who won four All Stars over the course of their career and was named full back on the Irish News Team of the Decade in 2004. The public voted him onto the All-Time Derry Football Team via an online poll in 2007. He has recently applied for the vacant Derry Senior football manager's job. Previous clubs he has managed include Ballinascreen, Kildress and Eglish. He was Ulster assistant manager to Joe Kernan for the 2008 Railway Cup.", "link_mentions": [{"page": "Scullion", "response": ["*Tony Scullion, Irish Gaelic footballer"]}, {"page": "List of All Stars Awards winners (football)", "response": ["| LCB || 20px|border Tony Scullion ||Derry || 1", "| LCB || 20px|border Tony Scullion || Derry || 2", "| LCB || 20px|border Tony Scullion || Derry || 3", "| RCB || 20px|border Tony Scullion || Derry || 4"]}, {"page": "Moneyneany", "response": ["Tony Scullion, Gaelic Football and Hurling player for Ballinascreen and Derry, and receiver of four football GAA All Stars Awards, was born in Moneyneena.All Stars  GAA website Retrieved 29 June 2010"]}, {"page": "Ballinascreen GAC", "response": ["*Tony Scullion - 1 1993 All-Ireland Championship, 2 Ulster Senior Football Championships, 3 National Football Leagues, 7 Railway cups, 4 All-stars."]}, {"page": "1962 in Northern Ireland", "response": ["*6 February – Tony Scullion, Derry GAA hurler and Gaelic footballer."]}, {"page": "Kildress Wolfe Tones GAC", "response": ["| 2021 || Roger Keenan; Tony Scullion || Intermediate", "| 2020 || Roger Keenan; Tony Scullion || Junior", "| 2001 || Tony Scullion; Cathal Corey || Senior", "| 2000 || Tony Scullion; Cathal Corey || Senior", "| 1999 || Tony Scullion; Cathal Corey || Senior", "| 1998 || Tony Scullion; Cathal Corey || Intermediate"]}]}}