{"wiki_id": "http://www.wikidata.org/entity/Q7828198", "itemLabel": "Totally Enormous Extinct Dinosaurs", "itemDescription": "British musician, producer, and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Totally_Enormous_Extinct_Dinosaurs", "wikipedia_page": {"main": "Orlando Tobias Edward Higginbottom (born 7 March 1986), known professionally as Totally Enormous Extinct Dinosaurs (or TEED), is a British electronic music producer, DJ and singer-songwriter based in the United States.", "link_mentions": [{"page": "Damon Albarn", "response": ["Albarn collaborated with producers Dan the Automator, XL Recordings, Richard Russell & Rodaidh McDonald, Jneiro Jarel, DJ Darren Cunningham aka Actress, Marc Antoine, Alwest, Remi Kabaka Jr., Totally Enormous Extinct Dinosaurs and Kwes, Albarn went to Kinshasa, Democratic Republic of the Congo for one week to record an album, Kinshasa One Two, released in 2011. All proceeds benefit Oxfam's work in the DRC."]}, {"page": "Cherwell School", "response": ["*Orlando Higginbottom, also known as Totally Enormous Extinct Dinosaurs, Electro Producer and DJ."]}, {"page": "Grammy Award for Best Dance/Electronic Recording", "response": ["* Bonobo & Totally Enormous Extinct Dinosaurs - \"Heartbreak\""]}, {"page": "Falls Festival", "response": ["*Totally Enormous Extinct Dinosaurs (cancelled)", "*Totally Enormous Extinct Dinosaurs"]}, {"page": "Festival Internacional de Benicàssim", "response": ["* Totally Enormous Extinct Dinosaurs"]}, {"page": "Bonobo (musician)", "response": ["* \"Heartbreak\" (with Totally Enormous Extinct Dinosaurs) (2020)", "* \"6000 Ft.\" (with Totally Enormous Extinct Dinosaurs) (2020)"]}, {"page": "Exit (festival)", "response": ["|Gossip, Hercules & Love Affair, Richie Hawtin, Skream ft. Sgt. Pokes, Sub Focus & ID, The Toy Dolls, Miss Kittin, Laurent Garnier, Skindred, Sneaky Sound System, Azari & III, Knife Party, Felix Da Housecat, Netsky ft. Dynamite MC, Claude Von Stroke, Little Dragon, MistaJam, Suicidal Tendencies, Buraka Som Sistema, Totally Enormous Extinct Dinosaurs, Thieves Like Us, Hatebreed, Goldie ft. SP:MC, Jacques Lu Cont, Kenny Larkin, Borgore, Brodinski, Drumsound & Bassline Smith ft. Dynamite MC, Benoit & Sergio, Maceo Plex, When Saints Go Machine, Partibrejkers, Eats Everything, Citizens!, Seun Kuti & Egypt 80, D.R.I., Jimmy Edgar, Sodom, Eyesburn, Goblini, Obojeni program, Električni Orgazam, Street Dogs, George FitzGerald, Edo Maajka, Teengirl Fantasy, Detachments, Nikonn, Goribor, Block Out, Pompeya, Mike Mago, DAT Politics"]}, {"page": "Sasquatch! Music Festival", "response": ["*Totally Enormous Extinct Dinosaurs"]}, {"page": "Pitchfork Music Festival", "response": ["Saturday: Isaac Delusion, Cloud Nothings, Purity Ring, Twin Shadow, Liars, Death Grips, Breton, Grizzly Bear, Disclosure, Totally Enormous Extinct Dinosaurs, Rustie, Simian Mobile Disco, Julio Bashmore"]}, {"page": "List of Polydor Records artists", "response": ["* Totally Enormous Extinct Dinosaurs"]}, {"page": "Blank & Jones", "response": ["Piet Blank is also the host of the Club Mix that is aired on international flights by Lufthansa, where he hosts a two-hour radio show that shows different artists such as Totally Enormous Extinct Dinosaurs and Fritz Kalkbrenner. The show is hosted in German as well as in English."]}, {"page": "List of music artists and bands from England", "response": ["**Totally Enormous Extinct Dinosaurs"]}, {"page": "Moshi Moshi Records", "response": ["Moshi Moshi has also hosted a stage at Iceland Airwaves festival for the last 6 years and has taken bands like Fuck Buttons, Factory Floor, the Drums, Florence and the Machine, Friendly Fires, the Dirty Projectors, Metronomy, Au Revoir Simone, Hot Chip, Architecture in Helsinki, Totally Enormous Extinct Dinosaurs, Kwes and more over to Reykjavik"]}, {"page": "Evolution Festival", "response": ["*Totally Enormous Extinct Dinosaurs (Live)"]}, {"page": "Wakarusa Music and Camping Festival", "response": ["Artists included headliners: Widespread Panic, Dispatch, STS9. The Black Crowes, Amon Tobin, Snoop Lion. Other performing artists included: Umphrey's McGee, Yonder Mountain String Band, Gogol Bordello, Zeds Dead, Of Monsters and Men, GROUPLOVE, SOJA, The Bright Light Social Hour, Rebelution, Quixotic, Galactic, Shpongle presents The Masquerade, Tipper, MUTEMATH, Son Volt, Ozomatli, EOTO, SAVOY, RJD2, Totally Enormous Extinct Dinosaurs, Gramatik, Los Amigos Invisibles, Calexico, Karl Denson's Tiny Universe, Del The Funky Homosapien, Bombino, Allen Stone, Figure, Emancipator, GRiZ, Icona Pop, Felix Cartal, Baauer, The Polish Ambassador, Minnesota, The Green, BoomBox, Papadosio, Wallpaper., Red Baraat, Milo Greene, The Floozies, Anuheal, Zion I, ZOOGMA and more."]}, {"page": "Theo Keating", "response": ["|Totally Enormous Extinct Dinosaurs"]}, {"page": "Mat Maitland", "response": ["* Totally Enormous Extinct Dinosaurs - Trouble (2012)"]}, {"page": "New College School", "response": ["*Orlando Higginbottom: musician better known as  Totally Enormous Extinct Dinosaurs"]}, {"page": "Way Out West (festival)", "response": ["*Totally Enormous Extinct Dinosaurs"]}, {"page": "Jneiro Jarel", "response": ["In 2011 Jneiro was handpicked by Damon Albarn to be a part of the, newly established, musical collective DRC Music (Democratic Republic of the Congo Music) group. Working in conjunction with Oxfam, the project's intention was to bring awareness to Oxfam's relief work in Congo, as well as give exposure to over fifty local Congolese musicians. Albarn assembled a team of ten producers, composed of Jarel, Dan the Automator, XL Recordings managers Richard Russell and Rodaidh McDonald, Kwes, Actress, Totally Enormous Extinct Dinosaurs, Marc Antoine, Alwest, and Remi Kabaka Jr. to work alongside local musicians in Kinshasa. The result was Kinshasa One Two; an album recorded in five days, with all of its proceeds going towards Oxfam. It was released on Warp Records October 3, 2011."]}, {"page": "Dot to Dot Festival", "response": ["Acts announced to play the festival were: Hurts, Darwin Deez (Manchester Exclusive), Ed Sheeran, We Are Scientists, Guillemots, The Naked and Famous, The Joy Formidable, SBTRKT, Dananananaykroyd, Wolf Gang, Totally Enormous Extinct Dinosaurs, Benjamin Francis Leftwich, Braids, Cults, Hyetal and many more."]}, {"page": "Glastonbury Festival 2009", "response": ["Totally Enormous Extinct Dinosaurs"]}, {"page": "Immergut Festival", "response": ["*2012: Alle Farben, Blood Red Shoes, Die Höchste Eisenbahn, Die Vögel, Einar Stray, Francis International Airport, Friska Viljor, Hauschka, Heinz Strunk, Hundreds, Immanu El, Kakkmaddafakka, Leif Randt, Me And My Drummer, New Build, Pupkulies & Rebecca, Sandro Perri, Sin Fang, Slagsmalsklubben, Sóley, Tall Ships, The Hidden Cameras, The Hundred in the Hands, The Mouse Folk, Tiere Streicheln Menschen, Totally Enormous Extinct Dinosaurs, Vierkanttretlager, WhoMadeWho"]}, {"page": "List of Essential Mix episodes", "response": ["| 17 October || Bonobo & Totally Enormous Extinct Dinosaurs ||", "| 18 August || Totally Enormous Extinct Dinosaurs ||"]}, {"page": "Field Day (Sydney festival)", "response": ["* Totally Enormous Extinct Dinosaurs", "*Totally Enormous Extinct Dinosaurs (UK)", "*Totally Enormous Extinct Dinosaurs (UK)"]}, {"page": "List of dance-pop artists", "response": ["*Totally Enormous Extinct Dinosaurs"]}, {"page": "Grum", "response": ["*Amtrac featuring Totally Enormous Extinct Dinosaurs — \"Radical\" (Grum Remix)"]}, {"page": "Treasure Fingers", "response": ["Totally Enormous Extinct Dinosaurs 'Without You' (Treasure Fingers Remix)"]}, {"page": "One (Sky Ferreira song)", "response": ["#\"One\" (Totally Enormous Extinct Dinosaurs Remix) – 4:32"]}, {"page": "Zeds Dead", "response": ["* Totally Enormous Extinct Dinosaurs – \"Household Goods\" (Zeds Dead Remix) "]}, {"page": "Doctor P", "response": ["* Dillon Francis featuring Totally Enormous Extinct Dinosaurs - \"Without You\" (Doctor P & Flux Pavilion Remix)"]}, {"page": "Porter Robinson", "response": ["On March 17, 2021, a deluxe version of Nurture was detailed to be releasing exclusively in Japan, featuring a bonus song with the Japanese band Wednesday Campanella. On April 22, 2021, one day before the release of Nurture, Robinson released the sixth and final single from the album, Unfold with Totally Enormous Extinct Dinosaurs. On April 23, 2021, Nurture was released. The album would be placed on year-end lists such as Billboards \"Best Albums of 2021\". On April 24, 2021, during his own virtual music festival Secret Sky, Robinson premiered the Nurture live show. On May 10, 2021, Robinson announced the tour for the Nurture live show, supporting Nurture."]}, {"page": "Snowball Music Festival", "response": ["• Totally Enormous Extinct Dinosaurs"]}, {"page": "The General Assembly (directors)", "response": ["The General Assembly were a music video and commercial directing duo based in Los Angeles, CA. They directed music videos for such artists as A.C. Newman, Grum, The Wombats, Totally Enormous Extinct Dinosaurs, Jason Lytle, Fruit Bats (band) and Radar Bros. They also directed commercials for Jameson Irish Whiskey, O2 (UK), George Dickel, BT Group, Jeremiah Weed, Blinkbox, Diageo and BBC Radio 1.", "| Totally Enormous Extinct Dinosaurs", "| Totally Enormous Extinct Dinosaurs"]}, {"page": "Governors Ball Music Festival", "response": ["*Totally Enormous Extinct Dinosaurs"]}, {"page": "Kinshasa One Two", "response": ["Recorded in Kinshasa, Congo, within five out of nine days spent there during July 2011, the album was intended to shine a light on contemporary Congolese musicians, featuring more than 50 local performers, notably Nelly Liyemge, Jupiter Bokondji & Okwess International and Bokatola System. DRC Music is composed of producers Damon Albarn, Dan the Automator, XL Recordings managers Richard Russell & Rodaidh McDonald, Jneiro Jarel, DJ Darren Cunningham aka Actress, Marc Antoine, Alwest, Remi Kabaka Jr., Totally Enormous Extinct Dinosaurs and Kwes.", "* Totally Enormous Extinct Dinosaurs – producer"]}, {"page": "Flux Pavilion discography", "response": ["| Dillon Francis featuring Totally Enormous Extinct Dinosaurs"]}, {"page": "Garden (Totally Enormous Extinct Dinosaurs song)", "response": ["\"Garden\" is a song by English electronic music producer and DJ Totally Enormous Extinct Dinosaurs, featuring vocals by Luisa Gerstein. The track was released in the United Kingdom on 14 October 2011 as the second single from his debut studio album, Trouble (2012). The song was written by Higginbottom and Gerstein and produced by Higginbottom.", "Category:Totally Enormous Extinct Dinosaurs songs", "Category:Songs written by Totally Enormous Extinct Dinosaurs"]}]}}