{"wiki_id": "http://www.wikidata.org/entity/Q7823286", "itemLabel": "Tony Robinson", "itemDescription": "Bishop of Wakefield; Bishop of Pontefract; British Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Robinson_(bishop)", "wikipedia_page": {"main": "Anthony William Robinson  (born 25 April 1956) is a British Anglican bishop. Since 2015, he has been the area Bishop of Wakefield in the Diocese of Leeds. From 2002 to 2015, he served as Bishop of Pontefract in the Diocese of Wakefield.", "link_mentions": [{"page": "Forward in Faith", "response": ["* Tony Robinson (2014 to 2018)"]}, {"page": "Bishop of Wakefield", "response": ["The area bishop's residence is Pontefract House, Wakefield.Tony Robinson. leeds.anglican.org. Retrieved on 13 July 2016. The current area Bishop of Wakefield is Tony Robinson, who has previously been the suffragan Bishop of Pontefract until that see was translated (renamed) to Wakefield in 2015.Bishop Tony Robinson Biography. leeds.anglican.org. Retrieved on 13 July 2016.", "Tony Robinson continues in the same See, becoming the area Bishop of Wakefield.", "|align=\"center\"| 2002 ||align=\"center\"| 2015 || Tony Robinson || Area bishop for Wakefield and interim area bishop for Huddersfield since 20 April 2014; See translated to Wakefield, 19 March 2015", "|Tony Robinson"]}, {"page": "Provincial episcopal visitor", "response": ["*Leeds: the area Bishop of Wakefield (Tony Robinson)"]}, {"page": "Tony Robinson (disambiguation)", "response": ["Tony Robinson is a TV presenter and actor.", "Tony Robinson may also refer to:", "*Tony Robinson (American football) (born 1964), former American football quarterback", "*Tony Robinson (bishop) (born 1956), Bishop of Pontefract", "*Tony Robinson (politician) (born 1962), Australian politician", "*Tony Robinson (shooting victim) (born c. 1996), killed by police in Madison, Wisconsin in 2015", "*Tony Robinson (speech recognition), British pioneer of recurrent neural networks"]}, {"page": "St Thomas's Church, Huddersfield", "response": ["St Thomas's stands in the Modern Catholic tradition of the Church of England. As the parish rejects the ordination of women, it receives alternative episcopal oversight from the Bishop of Wakefield (currently Tony Robinson)."]}, {"page": "Anthony William Robinson", "response": ["#REDIRECT Tony Robinson (bishop)"]}, {"page": "St Peter and St Leonard's Church, Horbury", "response": ["The parish stands in the Anglo-Catholic tradition of the Church of England. As it rejects the ordination of women, the parish receives Alternative Episcopal Oversight from the Bishop of Wakefield (currently Tony Robinson)."]}, {"page": "The Society (Church of England)", "response": ["* Tony Robinson, Bishop of Wakefield, chairman of the council of bishops"]}]}}