{"wiki_id": "http://www.wikidata.org/entity/Q7822089", "itemLabel": "Tony Collins", "itemDescription": "English football manager (1926-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Collins_(footballer)", "wikipedia_page": {"main": "Anthony Norman Collins (19 March 1926 – 8 February 2021) was an English football player, manager and scout, who played as a left winger. He managed Rochdale between 1960 and 1967, becoming the first black manager in the Football League and leading them to the 1962 Football League Cup Final, their only major final appearance.\nCollins played professionally for Sheffield Wednesday, York City, Watford (in two spells), Norwich City, Torquay United and Crystal Palace (where he was the club's first mixed-race player), before ending his playing career at Rochdale. Apart from a spell as assistant manager (and briefly caretaker manager) at Bristol City, he latterly worked mainly in scouting for a number of clubs, including Leeds United and Manchester United, as well as for the England national team.", "link_mentions": [{"page": "Rochdale A.F.C.", "response": ["The club reached the League Cup Final in 1962 led by Tony Collins. This was the first time a club from the bottom league division had reached the final of a major competition – where they lost to Norwich City 4–0 on aggregate. Rochdale had beaten Southampton, Doncaster Rovers, Charlton Athletic, York City, and Blackburn Rovers on their route to the final."]}, {"page": "Collins (surname)", "response": ["*Tony Collins (disambiguation), multiple people, one of several people including:", "**Tony Collins (footballer) (born 1926), first black manager in the English Football League", "**Tony Collins (American football) (born 1959), American football player", "**Tony Collins (historian), British social historian"]}, {"page": "1926 in the United Kingdom", "response": ["* 19 March – Tony Collins, English football player and manager (died 2021)  "]}, {"page": "1962 Football League Cup Final", "response": ["Rochdale's manager Tony Collins became the first BAME manager to lead a team in a major English cup final.", "| colspan=\"4\"|  Tony Collins", "| colspan=\"4\"|  Tony Collins"]}, {"page": "Tony Collins (football manager)", "response": ["#REDIRECT Tony Collins (footballer)"]}, {"page": "Tony Collins", "response": ["Tony Collins may refer to:", "* Tony Collins (American football) (born 1959), American football player with the New England Patriots and Miami Dolphins", "* Tony Collins (footballer) (1926–2021), English football player, manager and scout", "* Tony Collins (historian) (born 1961), British social historian"]}]}}