{"wiki_id": "http://www.wikidata.org/entity/Q7839454", "itemLabel": "Trevor Tanner", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Tanner", "wikipedia_page": {"main": "Trevor Tanner  is a British musician and composer, best known as the singer and guitarist of post-punk/gothic rock band the Bolshoi during the 1980s. He now has a solo career via Emperor Penguin Recordings.", "link_mentions": [{"page": "The Bolshoi", "response": ["The band formed in 1984 in Trowbridge, Wiltshire, England. The original lineup consisted of singer/guitarist Trevor Tanner, drummer Jan Kalicki, and bassist Graham Cox.  Tanner and Kalicki had previously played together in the short-lived punk band Moskow, where Trevor performed as Trevor Flynn (his mother's maiden name). Early gigs supported the likes of the Cult, the March Violets and the Lords of the New Church. After eight gigs bass player Graham Cox was replaced by Nick Chown. In 1985, the band released their debut single, \"Sob Story\", followed by the mini-album, Giants, and their hit song \"Happy Boy\". Word of mouth was such that the Bolshoi were able to sell out many of their early headlining performances.", "In December 2018, the Bolshoi's official Facebook page announced that Bolshoi frontman, Trevor Tanner, and Bolshoi keyboardist, Paul Clark, were developing a new project, tentatively titled, The Bolshoi Brothers."]}, {"page": "Seven Nations (band)", "response": ["Watson left the band in 1997 and was replaced by Ashton Geoghagan. Anderson left the band in 1998, and in 1999 Dan Stacey (fiddle, Canadian step dancing) and Scott Long (highland bagpipes) joined Seven Nations's lineup. Geoghagan left in August 2001 to pursue other interests; he is currently a Paramedic/Captain with Jacksonville Fire Rescue. Geoghagan was replaced by Angelo Christian Miceli in 2001 and remains the drummer today. Watson and Anderson currently play together with former The Bolshoi frontman Trevor Tanner in a new Celtic rock group called Rathkeltair which has done extensive touring up and down the east Coast of the US. Dan Stacey left in December 2007 to pursue a solo career and was replaced by Victor Gagnon. Scott Long left the band shortly after to pursue a career opportunity and was replaced by multi instrumentalist Will MacMorran. In 2005, the original members of Clan Na Gael reunited  to produce an album where, in addition to tracks from earlier albums Rain and Thunder, Old Ground and Big Dog, there are six new tracks and two completely original songs recorded in December, 2004. \"Clan Na Gael: 10 Years On\".They also played four shows live in New York, Pennsylvania, and South Carolina."]}, {"page": "Edgar Allan Poe and music", "response": ["* Trevor Tanner, via Emperor Penguin Recordings, released an Apple iTunes, Digital 45, entitled \"The Ballad Of Edgar Allan Poe\" on July 13, 2011."]}, {"page": "New York Mining Disaster 1941", "response": ["* In 2008, singer-songwriter Trevor Tanner released a version titled Mr. Jones on his album Eaten By The Sea."]}]}}