{"wiki_id": "http://www.wikidata.org/entity/Q7831699", "itemLabel": "Tracy Brabin", "itemDescription": "British politician and former actress (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tracy_Brabin", "wikipedia_page": {"main": "Tracy Lynn Brabin (born 9 May 1961) is a British politician who has served as the first Mayor of West Yorkshire since the office was established on 10 May 2021. She previously was the Member of Parliament (MP) for Batley and Spen from 2016 to 2021 under the Labour and Co-operative banner.Born in Batley, Brabin was an actress and television writer prior to entering politics, appearing in several British soap operas including Coronation Street, EastEnders, Casualty and Emmerdale. She was elected for Batley and Spen in an October 2016 by-election after the murder of previous incumbent Jo Cox. She was appointed as Shadow Secretary of State for Digital, Culture, Media and Sport by Jeremy Corbyn in January 2020, succeeding former Deputy Labour Leader Tom Watson. In April 2020, new Labour Leader Keir Starmer removed Brabin from the Shadow Cabinet and appointed her Shadow Minister for Cultural Industries. She resigned as an MP after winning the 2021 West Yorkshire mayoral election. Her resignation triggered a by-election, which Labour's Kim Leadbeater won. She is the first ever woman to serve as a metro-mayor.", "link_mentions": [{"page": "West Yorkshire", "response": ["Since 1 April 2014, West Yorkshire has been a combined authority area, with the local authorities pooling together some functions over transport and regeneration as the West Yorkshire Combined Authority. The first Mayor of West Yorkshire, Tracy Brabin, was elected on 6 May 2021, following a devolution deal announced by the government in the March 2020 budget."]}, {"page": "Batley", "response": ["*Tracy Brabin (born 1961), politician and first Mayor of West Yorkshire  born in Batley, served as Labour MP for Batley & Spen from 2016 to 2021."]}, {"page": "Cleckheaton", "response": ["In 1885, Cleckheaton and the three neighbouring townships, Gomersal, Heckmondwike and Liversedge, were grouped to form the Parliamentary county constituency of Spen Valley and remained in that constituency until 1950. The seat was held at various times by the Liberal, National Liberal and Labour parties. From 1950 to 1983, Cleckheaton was included in the borough constituency of Brighouse and Spenborough. It was a marginal seat, changing hands between the Conservative and Labour parties on six occasions. Cleckheaton is now in the Batley and Spen borough constituency,The Parliamentary Constituencies (England) Order 2007, Office of Public Sector Information, accessed 1 April 2008 created in 1983. It was represented by a Conservative Member of Parliament (MP) from 1983 to 1997, then by Labour MP Mike Wood until 2015, when Wood retired and was succeeded by Jo Cox (Labour). After Jo Cox was murdered in 2016, she was replaced in a by-election (which was uncontested by the other major parties) by Tracy Brabin, who retained the seat in 2017 and 2019. When she became Mayor of West Yorkshire in 2021, there was another by-election which was won by Kim Leadbeater, from the Labour Party."]}, {"page": "Kirklees", "response": ["The constituencies were first used at the 1997 general election, when the Labour Party came to power in a landslide, gaining all the seats in the borough. The party held the seats at the subsequent elections of 2001 and 2005. The incumbent MP for Batley and Spen, Jo Cox, was murdered on 16 June 2016. A constituency by-election took place on 20 October 2016 and Tracy Brabin was elected. A further by-election will be held in the constituency on 1 July 2021, after Brabin's resignation, following her election as Mayor of West Yorkshire.", "||Tracy Brabin"]}, {"page": "Co-operative Party", "response": ["|Tracy Brabin || West Yorkshire"]}, {"page": "English Democrats", "response": ["In the 2016 Batley and Spen by-election, the English Democrats received 4.8% of the votes, coming second to Labour's Tracy Brabin, when all of the other major parties did not stand out of respect for the murdered MP, Jo Cox."]}, {"page": "List of actor-politicians", "response": ["|data-sort-value=\"Brabin, Tracy\"| Tracy Brabin || Actress and television writer || Labour || MP for Batley and Spen (2016-2021)"]}, {"page": "Liz Dawn", "response": ["Dawn died on 25 September 2017, at her home in Whitefield, Greater Manchester, after a long battle with COPD. Tributes came from many Coronation Street actors, celebrity fans, and the Labour MP Tracy Brabin, a former Coronation Street actress, who told BBC News, \"She was a legend and an icon, an incredible person to work with. Deeply authentic, a natural comedian and a heart as big as Manchester.\" Her funeral took place at Salford Cathedral on 6 October 2017."]}, {"page": "The Wright Stuff", "response": ["* Tracy Brabin (2018)"]}, {"page": "Batley and Spen (UK Parliament constituency)", "response": ["Another by-election occurred in 2021 following the resignation of Tracy Brabin MP, who was elected Mayor of West Yorkshire on 10 May. The 2021 by-election received considerable media attention because of expectations of a Labour loss following the earlier Hartlepool by-election and a high-profile and divisive campaign by George Galloway for the Workers Party of Britain. The by-election was won by Jo Cox's sister, Kim Leadbeater, with a reduced majority.", "| Tracy Brabin", "A by-election was held on 1 July 2021 following the resignation of MP Tracy Brabin to become Mayor of West Yorkshire."]}, {"page": "Jack Duckworth", "response": ["Terry causes trouble for Jack and Vera through his various relationships with women. He dates neighbour Andrea Clayton (Caroline O'Neill) in 1985 and she becomes pregnant, sparking a feud between the Claytons and the Duckworths. At Ivy's engagement party to George Wardle in The Rovers, Jack asks Andrea's father Harry Clayton (Johnny Leeze) if they are sure Terry is the father and Harry punches him. The Claytons later move away. In 1992, Terry is released from prison to marry his pregnant girlfriend Lisa Horton (Caroline Milmoe) and uses the ceremony to escape. Lisa moves to Weatherfield from her home town of Blackpool and begins a relationship with local bookie Des Barnes (Philip Middlemiss) and moves in with him, a decision which infuriates Vera. While Jack is more sympathetic towards Lisa, knowing Terry will never stand by his wife and child, he nonetheless feels he has to side with his wife. Lisa gives birth to a baby boy whom she names Tommy and five months later, Lisa is killed after being run over by a car, and Jack and Vera are delighted when Tommy comes to live with them. Jack and Vera find it hard to cope financially, but Terry takes Tommy off of them and sells him to Lisa's parents Jeff and Doreen Horton and he goes to live with them in Blackpool. Jack and Vera are devastated and a furious argument with Terry follows, resulting in Jack punching Terry and disowning him. Jack and Vera were blessed with another grandson, Brad, after Terry's fling with Tricia Armstrong (Tracy Brabin). Jack also develops a paternal relationship with Tricia's son from her first marriage, Jamie (Joseph Gilgun)."]}, {"page": "Roy Cropper", "response": ["In 1995, Deirdre Barlow (Anne Kirkbride) moves into a new flat and meets fellow tenant, Roy Cropper, who seems over-helpful. Jamie Armstrong catches Roy reading a postcard Tracy Barlow (Dawn Acton) sent to Deirdre and calls him pathetic, thinking that Roy is stalking Deirdre. The tank bursts in 5 Crimea Street, making the Armstrongs and Roy panic, but Deirdre is unnerved by the way Roy takes advantage of the leak to try to get close to her. She is stunned when he tells her that he's sorry about her bereavement and tells Mike Baldwin (Johnny Briggs) of her discomfort. Roy pesters Deirdre late at night, inviting her for a drink. Mike tells Roy to leave Deirdre alone and he makes plans to move out. Tricia Armstrong (Tracy Brabin) overhears Roy apologising to Mike for stepping in on his lady-friend. Roy asks Tricia if she's the same as Deirdre; one of Mike's women and she tells him to get lost. Roy worries that Deirdre is brooding too much and fears that she may have a breakdown but he just annoys her as she sees Roy's concern as him pestering her. Roy alerts Mike to the fact that Deirdre is shutting herself away."]}, {"page": "Zoe Slater", "response": ["While away, Zoe contacts Little Mo – the only other member of the family who did not know about Zoe's parentage – who persuades Zoe to come home, but after another argument with Kat, Zoe leaves again. She ends up living on the streets where she is discovered sick and penniless by Roxy Drake (Tracy Brabin), a pimp determined to recruit Zoe. Roxy provides Zoe with meals and cigarettes, finds her a flat and forces her to prostitute herself. Roxy and fellow prostitute Kelly Taylor (Brooke Kinsella) dress and make-up Zoe, but she gets drunk and vomits on her client. Kat arrives the next day to take Zoe home, but Roxy tries to prevent her taking Zoe, so Kat headbutts her."]}, {"page": "Batley railway station", "response": ["In June 2018, a protest was held by Batley and Spen MP Tracy Brabin following weeks of disruption to its services after  Northern announced the roll out of a new timetable. The Labour MP argued people who live in the north of the country are fed up of being at the bottom of the pile when it comes to transport investment."]}, {"page": "List of former EastEnders characters", "response": ["|Roxy Drake || Tracy Brabin || 2001"]}, {"page": "Kelly Taylor (EastEnders)", "response": ["Kelly first appears on screen in December 2001. She is a young prostitute who is being pimped by the malicious Roxy Drake (Tracy Brabin). She had been thrown out by her family when she was a young girl and Roxy had taken her in off the streets. Kelly felt that she owed her and she had soon been persuaded to act as an underage prostitute for Roxy's clientele. Zoe Slater (Michelle Ryan), another runaway, has also been taken under Roxy's wing and she gives her a place to stay. Here, she meets and befriends Kelly, and on Roxy's instruction, Kelly sets about trying to convince Zoe to prostitute herself too. Zoe refuses to oblige, after which a furious Roxy starts demanding money from her in exchange for her hospitality. On Christmas Day that year, Kelly helps Zoe escape Roxy's evil clutches and Zoe returns to Albert Square, leaving Kelly to face up to a fuming Roxy.", "The character Kelly Taylor was introduced in December 2001 by the executive producer of EastEnders, John Yorke. Kelly was introduced on a short-term basis as part of a storyline that saw the regular character, Zoe Slater (Michelle Ryan), living rough on the streets of London and being taken in by a madam of a prostitution organisation, Roxy Drake (Tracy Brabin). Kelly was one of the young girls already working as a prostitute for Roxy."]}, {"page": "Nick Tilsley", "response": ["In July 1996, Nick stayed at home while the rest of the family went away on holiday, but, tired of his maternal grandmother Audrey Roberts' (Sue Nicholls) fussing, he ran away and was reported missing. Upon his return, he claimed to have been living rough in London and working in a cafe. Nick's stories cause Jamie Armstrong (Joseph Gilgun) to want to run away to London; when confronted by Jamie's mother, Tricia (Tracy Brabin), Nick admits that he only lasted two hours in London and spent the rest of his time in Torquay. Gail allowed Nick to go and live with her half-brother, Stephen Reid (Todd Boyce) in Canada, hoping that it would improve his behaviour and his education."]}, {"page": "Terry Duckworth", "response": ["Terry is paroled in December 1993, serving half his sentence for good behaviour and promptly surrenders custody of Tommy to Lisa's parents for £2,000 a year, stressing that Jack and Vera are unable to look after Tommy properly. Having effectively sold Tommy to the Hortons in Blackpool, he leaves after his father disowns him. Terry returns again in June 1996 and has a one-night stand with Tricia Armstrong (Tracy Brabin), who falls pregnant. He brings Tommy to visit Jack and Vera after the Hortons do not pay him the money that they had agreed. Terry sees a chance for some easy cash when he learns his parents are the new owners of The Rovers Return and plays the model son, but his plans to make a quick buck were scuppered when the pub was absorbing most of its profits, leaving Jack and Vera with little spare. Terry obtains £10,000 in exchange for a contract giving the Hortons full custody of Tommy until he turns eighteen years old. Subsequently, Vera is devastated that Terry has sold his son again and orders his photograph to be thrown in the bin. Vera then writes him out of her will, leaving everything to Tommy while Jack completely disavows their son's existence."]}, {"page": "West Yorkshire Police", "response": ["In 2021, his role was abolished when Tracy Brabin was elected Mayor of West Yorkshire and assumed responsibility for the force."]}, {"page": "Corners (TV series)", "response": ["Corners is a BBC children's television series of the 1980s. Produced by Alison Stewart, the format of the programme was that viewers would submit questions and queries (usually general knowledge, but sometimes metaphysical or scientific), and the two hosts, Tracy BrabinBFI (later Sophie Aldred and then Diane-Louise Jordan) and Simon Davies, would try to answer the questions, aided by an anthopomorphised animal puppet, Jo Corner, who was performed and puppeteered by Robin Stevens (who later performed as Tom on Ragdoll's Tots TV). Being children's programming, the explanations used humour to convey information and frequently involved demonstrations which degenerated into slapstick humour.  Songs were also used.  A show with a similar format, \"Dear Mr. Barker\", aired on CBBC in the mid-1990s, but did not last long."]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Tracy Brabin, Batley and Spen, 2016–present"]}, {"page": "Heckmondwike Grammar School", "response": ["* Tracy Brabin, actress, television writer and Labour Party MP for Batley and Spen 2016–2021  First mayor for West Yorkshire since May 2021."]}, {"page": "List of Labour Co-operative MPs", "response": ["* Tracy Brabin, Batley and Spen, 2016–2021"]}, {"page": "Official Opposition frontbench", "response": ["| colspan=\"2\" |Tracy Brabin", "Shadow Cultural Industries Minister Tracy Brabin announced she would be stepping down to focus on her candidacy for Mayor of West Yorkshire on 16 December. Shadow Sport Minister Alison McGovern was given the Cultural Industries brief, becoming Shadow Minister for Cultural Industries and Sport."]}, {"page": "A Bit of a Do", "response": ["* Sandra Pickersgill (later Simcock) (Tracy Brabin) – A good-hearted but notoriously clumsy waitress who begins a relationship with Ted, despite an age gap of over twenty years. She's down-to-earth and doesn't share Ted's desire to impress socially. She's devastated when Ted ends things with her to marry Corinna; however, she eventually forgives him and becomes his second wife in the final episode."]}, {"page": "Love + Hate (2005 film)", "response": ["*Tracy Brabin – Gaynor"]}, {"page": "Council for Arab-British Understanding", "response": ["Since the General Election on 8 June 2017, Caabu has taken two parliamentary delegations to the West Bank. The delegations have included former Labour Minister for Education and Minister for the Arts, Baroness Tessa Blackstone, Labour's Shadow Minister for Early Years, Tracy Brabin, and former Secretary of State for Scotland, former Government Deputy Chief Whip and Liberal Democrat MP for Orkney and Shetland, Alistair Carmichael."]}, {"page": "The Ghost Hunter (TV series)", "response": ["*Mr Oliver & Mrs Oliver, played by John McAndrew and Tracy Brabin - Roddy and Tessa's parents"]}, {"page": "List of EastEnders characters (2001)", "response": ["Patrick Trueman (Rudolph Walker), the former husband of Audrey and replacement parental figure for Paul and Anthony, was introduced in September. Belinda Peacock (Leanne Lakey), Charlie's daughter, and Viv Slater, Charlie's deceased wife, appear for guest stints in October. November saw the only baby being introduced, Louise Mitchell (Rachel Cox), the daughter of Phil and Lisa Fowler (Lucy Benjamin). Also, November saw the first appearances of: Nathan Williams (Doug Allen), the illegitimate son of Roy Evans (Tony Caunter), Nita Mistry (Bindya Solanki), a love interest for Robbie, Jane Williams (Ann Mitchell), Nathan's mother, and Derek Harkinson, the childhood friend of Pauline Fowler (Wendy Richard). Roxy Drake (Tracy Brabin), a pimp who grooms Zoe Slater (Michelle Ryan), Kelly Taylor (Brooke Kinsella), a prostitute groomed by Roxy, and Tom Stuart (Shaun Dooley), a vicar, were introduced in December.", "Roxy Drake, played by Tracy Brabin, is a pimp who is first seen on 10 December 2001. She grooms Zoe Slater (Michelle Ryan), who has run away from home and is living on the streets. Roxy finds Zoe a flat to live in. However, Roxy forces her to prostitute herself. Roxy and fellow prostitute Kelly Taylor (Brooke Kinsella) dress and make-up Zoe, but Zoe gets drunk on whiskey and vomits on her first client, much to the anger of Roxy. Some days later, Zoe's mother, Kat Slater (Jessie Wallace) comes looking for Zoe along with Anthony Trueman (Nicholas Bailey). They find her and try to take Zoe home, but Roxy tries to prevent Kat taking Zoe. This leads to Kat headbutting Roxy in the face. A humiliated Roxy then gets in her car and drives away, and has not been seen since."]}, {"page": "List of former Emmerdale characters", "response": ["| Carole || Tracy Brabin || 2014"]}, {"page": "List of former Coronation Street characters", "response": ["|Tricia Armstrong || Tracy Brabin || 1994–1997"]}, {"page": "Keir Starmer", "response": ["Starmer led the Labour Party into the 2021 local elections. On 11 March, Starmer launched Labour's local election campaign, with deputy leader Angela Rayner, Mayor of London Sadiq Khan, First Minister of Wales Mark Drakeford, Scottish Labour leader Anas Sarwar and West Yorkshire metro-mayor candidate Tracy Brabin as speakers. The party focused its election priorities on giving nurses a pay rise. Going into the short campaign period, the Conservative Party started to develop a 6–7% poll lead on the Labour Party."]}, {"page": "Tracey Brabin", "response": ["#REDIRECT Tracy Brabin"]}, {"page": "List of CBBC presenters", "response": ["| Tracy Brabin || 1987 || Presented the But First This school holiday slot"]}, {"page": "List of Question Time episodes", "response": ["|Damian Green, Tracy Brabin, Camilla Cavendish, Miatta Fahnbulleh, Simon Jordan"]}]}}