{"wiki_id": "http://www.wikidata.org/entity/Q7839390", "itemLabel": "Trevor Ray", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Ray", "wikipedia_page": {"main": "Trevor Ray (died 24 December 2019) was a British actor, writer and script editor. As an actor he gained credits in many television series. As a writer and script editor he worked on series such as Doctor Who, Paul Temple and Children of the Stones. He died in December 2019.", "link_mentions": [{"page": "David Whitaker (screenwriter)", "response": ["*The Ambassadors of Death (with uncredited re-writes by Terrance Dicks, Trevor Ray and Malcolm Hulke)"]}, {"page": "Glengarry Glen Ross", "response": ["* Trevor Ray – Dave Moss"]}, {"page": "Children of the Stones", "response": ["Children of the Stones is a British television fantasy drama serial for children, produced by HTV in 1976 and broadcast on the United Kingdom's ITV network in January and February 1977. The serial was produced by Peter Graham Scott, with Patrick Dromgoole as executive producer. A novelisation by the serial's writers, Jeremy Burnham and Trevor Ray, also appeared in 1977. In the United States, it was broadcast on the Nickelodeon television channel in the early 1980s as part of the series The Third Eye.Tripod - The Third Eye", "* Written by: Jeremy Burnham and Trevor Ray", "The serial was novelised by series writers Jeremy Burnham and Trevor Ray and released by Carousel Books in 1977. It was released in the US two years later. The novelisation was released in audiobook format by Fantom Films in August 2014, read by Gareth Thomas.", "A sequel, Return to the Stones by Jeremy Burnham and Trevor Ray, was published as a Kindle e-book in November 2012 followed by the hardback edition on 8 July 2013. There is also an audio book, narrated by Gareth Thomas."]}, {"page": "Doctor Who and the Silurians", "response": ["After the previous story, producers Derrick Sherwin and Peter Bryant (who was originally to have the producer's credit on this story) were transferred to the television series Paul Temple, and the BBC intended for Barry Letts to become producer. However, Letts was committed to another production, and could not be released until after the location work on Silurians was completed. Script editor Terrance Dicks and his assistant Trevor Ray shared the production responsibilities for the location work."]}, {"page": "Malcolm Hulke", "response": ["*The Ambassadors of Death (with David Whitaker, Terrance Dicks and Trevor Ray, 1970)"]}, {"page": "List of Dempsey and Makepeace episodes", "response": ["| Christopher Strauli, Peter Cleall, Greg Powell, Trevor Ray"]}, {"page": "The Ambassadors of Death", "response": ["The Ambassadors of Death is the third serial of the seventh season of the British science fiction television series Doctor Who, which was first broadcast in seven weekly parts on BBC1 from 21 March to 2 May 1970. Written by Trevor Ray, Terrance Dicks and Malcolm Hulke (though solely credited to David Whitaker), the serial was directed by Michael Ferguson.", "This story was initially developed to feature the Second Doctor and his last companions, Jamie McCrimmon and Zoe Heriot. As such, it was set well into the future, and did not include UNIT. When all three actors left the programme at the end of the sixth season, it was rewritten to fit the consequential revamp. Original script editor David Whitaker proved incapable of writing for the incoming new format and cast, requiring the contributions of Trevor Ray, Terrance Dicks and Malcolm Hulke. All concerned parties agreed to leave sole credit to Whitaker and this was the last Doctor Who serial with his name on it. In an interview years later, Terrance Dicks recounted the experience of rewriting Whitaker's story:", "In 2009, a commentary for the future DVD release was recorded, including Caroline John, Nicholas Courtney, Michael Ferguson, Peter Halliday, Derek Ware and Terrance Dicks. The January 2011 edition of Wired UK magazine, published in December 2010 carried a full-page article on the recolourisation of the story. It was stated in the article that the Restoration Team expected to deliver a fully restored colour version of the story to the BBC \"within weeks\".Burton, Charlie (2010). 'Time Travel TV' WIRED UK, January 2011, p74. In issue 430 of Doctor Who Magazine the DVD was announced but later set back due to restoration difficulties. The release was delayed until 2012 when Doctor Who Magazine issue 449 confirmed that the full-colour version would soon be out on DVD.Doctor Who Magazine, Panini UK Limited issue 449 published 28 June 2012, p9 It was later announced that the story would be released on DVD on 1 October 2012. Among the special features on the DVD is a documentary entitled Mars Probe 7: Making The Ambassadors of Death. Although David Whitaker is the sole credited writer on the actual episodes, the DVD sleeve credits The Ambassadors of Death as being written by David Whitaker, Malcolm Hulke and Trevor Ray."]}, {"page": "Sky (TV serial)", "response": ["* Trevor Ray (Rex)"]}, {"page": "List of Doctor Who writers", "response": ["| Whitaker was the programme's first script/story editor.  Aside from the authors of The Three Doctors and The Five Doctors, he and Brian Hayles are the only people to be credited with writing at least one story featuring each of the first three Doctors.  The writing of his final adventure, The Ambassadors of Death, was particularly precarious.  Both Malcolm Hulke and Trevor Ray were required, uncredited, to get a final set of scripts completed."]}, {"page": "Buddy (TV series)", "response": ["| Trevor Ray || Mr King"]}, {"page": "List of Heartbeat cast members", "response": ["*Trevor Ray as William Barraclough (2 episodes, 2003–2004)."]}, {"page": "Jeremy Burnham", "response": ["In the mid-1970s he retired from acting and concentrated on screenwriting. With Trevor Ray, he co-authored the fondly-remembered children's science fiction horror serial Children of the Stones (1977). A novelization followed, also in 1977. A sequel novel, Return to the Stones appeared in 2012 as an e-book and in 2015 as a physical book. Ray and Burnham collaborated on a less well-known children's five episode serial entitled Raven (1977). They also wrote the novelization (1977)."]}, {"page": "Laugh a Little Louder Please", "response": ["*Trevor Ray - The Hon. Tommy Spenton"]}, {"page": "List of unmade Doctor Who serials and films", "response": ["Written by Trevor Ray, this story would have been set underwater."]}, {"page": "List of former Emmerdale characters", "response": ["|Robin Parr || Trevor Ray || 1986", "|Bart Ansett || Trevor Ray || 1972–1973"]}, {"page": "Lock Up Your Daughters (1969 film)", "response": ["* Trevor Ray as Quill"]}, {"page": "The Flipside of Dominick Hide", "response": ["*Trevor Ray – Alaric"]}, {"page": "Shadow of the Noose", "response": ["* Trevor Ray as Harry Bishop "]}]}}