{"wiki_id": "http://www.wikidata.org/entity/Q7839055", "itemLabel": "Trevor Beattie", "itemDescription": "English advertising executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Beattie", "wikipedia_page": {"main": "Trevor Beattie (born 24 December 1959) is a British advertising executive. He is a founding partner, chairman and creative director of Beattie McGuinness Bungay (BMB), and was formerly the chairman and creative director of TBWA London. Considered one of the leading figures in advertising in Britain, Beattie has been responsible for a number of high-profile and sometimes controversial advertising campaigns, most notably the \"fcuk\" campaign for French Connection and the 1994 Playtex Wonderbra campaign featuring Eva Herzigová. He has managed campaigns for the Labour Party, being a friend of Peter Mandelson and a supporter of New Labour. Beattie masterminded the ad campaigns for the Labour party in the 2001 and 2005 general elections.", "link_mentions": [{"page": "Eva Herzigová", "response": ["After arriving in Paris, her popularity increased. Her first important appearance was as the model for the first Wonderbra campaign. In 1994, advertising executive Trevor Beattie, working for TBWA/London, developed an ad for Sara Lee's \"Hello Boys\" Wonderbra campaign. It featured a close-up image of Herzigová wearing a black Wonderbra. The ad used only two words: \"Hello boys.\" The influential poster was featured in an exhibition at the Victoria and Albert Museum in London and it was voted in at number 10 in a \"Poster of the Century\" contest. The Canada-based lingerie fashion label wanted the ad campaign to motivate women to see the Wonderbra \"as a cosmetic and as a beauty enhancer rather than a functional garment\". The billboard was voted in 2011 as the most iconic outdoor ad during the past five decades by the Outdoor Media Centre. She was also featured in Guess? jeans campaigns, the Victoria's Secret catalog and Sports Illustrated. Herzigová has featured in a variety of international fashion magazines, gracing the covers of Vogue (France, Britain, Spain, Germany, Japan, Australia, Mexico, Poland, Turkey, Thailand), Harper's Bazaar (Britain, Spain, Ukraine, Italy, Australia) as well as Elle, Marie Claire, Numéro and Allure. She has also walked for designers including Louis Vuitton, Benedetta Dubini, Giles Deacon, Emilio Pucci and Versace."]}, {"page": "University of Wolverhampton", "response": ["Other notable alumni include: Sir Terence Beckett, former director-general of the Confederation of British Industry; Sir Charles Wheeler, sculptor and President of the Royal Academy; Suzi Perry, television presenter and journalist; Maggie Gee, novelist; Trevor Beattie, advertising executive; Peter Bebb, special effect artist;\"Graduate hopes for Oscar win\", University of Wolverhampton, 22 February 2011. Vernie Bennett, singer, formerly of Eternal; Scott Boswell, former professional cricketer; David Carruthers, Professor Paul Gough, Vice-Chancellor, Arts University Bournemouth, and Chair of UKADIA,; Major Peter Cottrell, soldier, author and military historian; academic, artist and disability rights activist Paul Darke; Matt Hayes, television angler; Tanwir Ikram, Deputy Senior District Judge; Mil Millington, director & filmmaker; Michael Cumming, author; Magnus Mills, author; Mark O'Shea, zoologist and television presenter; Cornelia Parker, artist/sculptor; Julian Peedle-Calloo, television presenter; Robert Priseman, artist; Anne Schwegmann-Fielding, artist; Michael Salu, graphic artist and creative director; Ged Simmons, television actor; Gillian Small, University Dean for Research, City University of New York; Clare Teal, jazz singer and broadcaster; Andrew White, writer and TV presenter; Andy Thompson, footballer; Patrick Trollope, editor of UK's first online-only regional newspaper; Annemarie Wright, artist; Adesua Etomi, actress;  and Tim Dutton, actor."]}, {"page": "The Moseley School of Art, Balsall Heath", "response": ["* Trevor Beattie, advertising"]}, {"page": "David Abbott (advertising)", "response": ["In response to this letter Trevor Beattie, the man behind the campaign, hit back at Abbott during the Cannes Lions International Festival of Creativity accusing him of boring the pants off the audience with a lengthy diatribe.Beattie hits back at Abbott"]}, {"page": "Una White", "response": ["Her name was suggested for use in the artwork by her daughter Carol, after a public appeal for people to nominate a friend or family member who deserved to have their name in lights. Una was selected from a number of entries, by a panel comprising advertising mogul Trevor Beattie, broadcaster Mark Lawson, celebrity agent Jonathan Shalit, fashion designer Jemima French, and This Morning presenter Alison Hammond."]}, {"page": "Beattie McGuinness Bungay", "response": ["#REDIRECT Trevor Beattie"]}, {"page": "Channel 5 (British TV channel)", "response": ["On 16 September 2002, Channel 5 re-branded to Five, in a multimillion-pound project directed by Trevor Beattie. The channel's director of marketing at the time, David Pullen, said: "]}, {"page": "French Connection (clothing)", "response": ["French Connection began using the branding \"fcuk\" (usually written in lowercase) in advertising after 1991 when Marks regained control. Reportedly, the first use of the initialism was on faxes sent between Hong Kong and London offices, headed \"FCHK to FCUK\". Marks said in a subsequent interview that the faxes were not intended to be rude. The advertising campaign came about after he was so impressed by a bra advert featuring Eva Herzigová that he contacted the advertising executive behind it, Trevor Beattie, even though the company did not have a budget for an advertising campaign at the time. It was Beattie who spotted the marketing potential of the initialism and a campaign was launched around it."]}, {"page": "List of University of Wolverhampton people", "response": ["* Trevor Beattie (advertising executive)"]}, {"page": "Endorsements in the 2015 United Kingdom general election", "response": ["*Trevor Beattie, advertising executive"]}, {"page": "Midas Man", "response": ["Midas Man is a biographical film about Brian Epstein based on a story by Brigit Grant and screenplay by Jonathan Wakeham. It is a British co-production between StudioPow and Trevor Beattie Films. It is also produced by Er Dong Pictures, who will distribute the film in China. In July 2020, Jonas Åkerlund was announced to direct. In an interview with The Guardian, Åkerlund said he had been researching Epstein for almost two years. He also said he had talked with people who knew Epstein, including Gerry Marsden of Gerry and the Pacemakers: \"He told me stories that haven't been printed yet and that we'll introduce into our film.\" In April 2021, Jacob Fortune-Lloyd was cast in the lead role as Brian Epstein. In July, the film's distribution rights in the U.K. and Ireland were sold to Signature Entertainment. In the following months, Emily Watson, Eddie Marsan and Omari Douglas were cast in September, and Rosie Day, Lukas Gage, Charley Palmer Rothwell and Bill Milner were cast in October."]}]}}