{"wiki_id": "http://www.wikidata.org/entity/Q7839434", "itemLabel": "Trevor Smith", "itemDescription": "England international footballer (1936-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Smith_(footballer,_born_1936)", "wikipedia_page": {"main": "Trevor Smith (13 April 1936 – 9 August 2003) was an English footballer who played as a centre half for Birmingham City, Walsall and the England national team.", "link_mentions": [{"page": "Brierley Hill", "response": ["* Trevor Smith (1936-2003), former professional footballer for Birmingham City & Walsall F.C."]}, {"page": "1956 FA Cup Final", "response": ["Manager Arthur Turner called on his team to match their Third Division opponents Torquay United for fighting spirit and to produce a \"90-minute performance\". The players complied; leading 4–0 at half-time, they finished as comfortable 7–1 winners. In the fourth round, Leyton Orient, who had beaten Birmingham at the same stage four years earlier, posed more of a potential problem. In reality the win was equally comfortable: Eddy Brown added two goals to his hat-trick at Torquay. A tight local derby game followed on a snow-covered frozen pitch at The Hawthorns. In the first half, goalkeeper Gil Merrick and his defence did well to keep West Bromwich Albion out; Trevor Smith had to clear a Ronnie Allen header from under the crossbar. In the second half, Birmingham wasted several chances before a one-two with Brown allowed Peter Murphy to score from the edge of the penalty area.", "Now Sunderland found out how hard it is to score against this terrific defence of ours. Not for nothing have we scored 18 goals against two (both of them freaks) conceded in five ties all away from home. What can I say to do justice to that brilliant goalkeeper Gil Merrick, to wonderful young Trevor Smith and to the matchless Jeff Hall and Ken Green? Once again they mixed the old cement and constructed that brilliant wall of a defence. Sunderland would have needed to call in a firm of demolition contractors to destroy it.", "|Half back ||5||Trevor Smith"]}, {"page": "Jeff Hall (footballer)", "response": ["Hall was born in Scunthorpe, Lincolnshire, and brought up in Wilsden, West Riding of Yorkshire. He had an older sister, Joan. After leaving school in 1945 he played for various junior clubs in the area before joining his local Football League club, Bradford Park Avenue, then in the Second Division, where he remained an amateur and never made a first-team appearance. It was while playing at right half for the Royal Electrical and Mechanical Engineers during his National Service that he was spotted by Birmingham City chief scout Walter Taylor, whose other successes included Gil Merrick, Trevor Smith and Ken Green. Hall signed on professional forms in May 1950.Matthews, p. 24."]}, {"page": "Trevor Smith", "response": ["Trevor Smith may refer to:", "*Trevor Smith (cricketer) (born 1977), English cricketer", "*Trevor Smith (equestrian) (born 1959), Irish Olympic equestrian", "*Trevor Smith (field hockey) (born 1949), Australian Olympic field hockey player", "*Trevor Smith (fighter) (born 1981), American mixed martial artist", "*Trevor Smith (footballer, born 1910) (1910–1997), Charlton Athletic, Fulham, Crystal Palace and Watford footballer", "*Trevor Smith (footballer, born 1936) (1936–2003), Birmingham City and England footballer", "*Trevor Smith (footballer, born 1965), Scottish footballer ", "*Trevor Smith (ice hockey) (born 1985), Canadian ice hockey player", "*Trevor Smith (actor) (born 1970), Canadian actor and media personality", "*Trevor Smith (EastEnders), minor character in TV soap opera EastEnders", "*Trevor Smith, Baron Smith of Clifton (1937–2021), British Liberal Democrat politician"]}, {"page": "1963 Football League Cup Final", "response": ["The second leg four days later at Villa Park was goalless. With former England centre half Trevor Smith marking Thomson out of the game and Birmingham's defensive tactics including regularly kicking the ball out for throw-ins, Aston Villa were unable to break their opponents down.", "|5 ||  Trevor Smith (c)", "|5 ||  Trevor Smith (c)"]}, {"page": "Bobby Thomson (footballer, born 1937)", "response": ["He transferred to Aston Villa, newly relegated to the Second Division, in 1959 for a fee of £8,000. Here, he made an immediate impact, scoring 22 goals in his first season, which made him the club's top scorer and helped them win the 1959–60 Second Division championship. He followed this up with 18 goals the next season and another 18 in 1962–63. He played in the final of the inaugural League Cup competition in 1960–61 in which Aston Villa beat Rotherham United. Two years later he scored in the first leg of the 1963 League Cup Final against Birmingham City, but in the second leg he was marked out of the game by former England centre-half Trevor Smith, a significant factor in Birmingham retaining their 3–1 lead."]}, {"page": "History of Birmingham City F.C. (1875–1965)", "response": ["Bob Brocklebank succeeded Storer as manager in 1950. Though unable to prevent them being relegated, he and chief scout Walter Taylor laid the foundations for the club's successes of the 1950s. Brocklebank was responsible for introducing future England internationals Trevor Smith and Jeff Hall to the side, and for bringing in several mainstays of Birmingham's teams through the 1950s.Matthews, Complete Record, p. 61. Arthur Turner took over as manager in November 1954 with the club mid-table in the Second Division. By the end of the season they had scored 92 goals, with all five first-choice forwards reaching double figures,Matthews, Complete Record, pp. 25–27. beaten Liverpool 9–1, a result which remains that club's record defeat, and were confirmed champions with a 5–1 win in the last game of the season away to Doncaster Rovers.", "Gil Merrick joined the club in 1939 and kept goal during and after the war through the 1940s and much of the 1950s. He won 23 caps for England, and set a club record of 551 appearances in all senior competitions, as well as coaching the reserves. After Birmingham finished 19th in 1959–60, having been in or just above the relegation places throughout the season, Merrick was appointed first-team manager. He was unable to improve the team's league performance, but did lead them to the first major trophy in the club's history. Entry to the new League Cup competition, introduced in 1960–61, was optional; several top-flight clubs chose not to enter, but Birmingham did so from the first year.Matthews, Complete Record, pp. 29–31. In 1962–63, while avoiding relegation only by winning two of their last three matches, they showed their best form in reaching the League Cup final, which was played over two legs on the grounds of the competing clubs. Opponents Aston Villa were pre-match favourites, having beaten Birmingham 4–0 in their most recent league meeting. But in the home leg Birmingham \"served up a treat of attacking football ... controlling the game with such assurance that their supporters must have wondered why the team had performed so badly in the First Division\", and came out comfortable 3–1 winners, with two goals from Ken Leek and one from Jimmy Bloomfield. Under the captaincy of Trevor Smith, a solid defensive performance in a goalless draw saw Birmingham lift the trophy at the home of their local rivals. After the fourth consecutive bottom-six finish – they won the last two matches of 1963–64 to escape relegation – the board felt a \"complete reorganisation\" of the club was necessary, and asked Merrick to resign. He complied, but thought he had been ill-treated, and had nothing more to do with the club for more than thirty years. In 1964–65, Birmingham finished seven points away from safety and returned to the Second Division."]}, {"page": "Graham Sissons", "response": ["John Graham Sissons (born 20 May 1934) is an English former footballer who played as a defender. He made more than 250 appearances in the Football League for Birmingham City, Peterborough United and Walsall, and played in both legs of the 1961 Inter-Cities Fairs Cup Final, which Birmingham lost to Roma. For Birmingham, he was used as Trevor Smith's deputy at centre half, and later replaced George Allen at left back."]}, {"page": "Winston Foster", "response": ["Born in South Yardley, Birmingham, Foster joined Birmingham City as a junior, making his first-team debut at the age of 19 as a full back. For the next three seasons he played occasionally for the first team either at full back or as Trevor Smith's deputy at centre-half, most notably in the first leg of the 1961 Inter-Cities Fairs Cup Final against A.S. Roma. When Smith sustained the injury that resulted in him leaving the club, Foster took over at centre half and kept his place for another couple of seasons. He was used less frequently in his last two years at the club, and spent three months on loan at Crewe Alexandra before making a permanent move to Plymouth Argyle where he ended his Football League career. He went on to play for Chelmsford City and Bromsgrove Rovers, and spent one season as Bromsgrove's assistant manager."]}, {"page": "Thorns Collegiate Academy", "response": ["Famous alumni include the footballer Trevor Smith and footballer Danny Batth, Captain of the Wolverhampton Wanders 2017-2018 Championship winning team."]}, {"page": "Jimmy Cochrane (footballer, born 1935)", "response": ["Cochrane was born in Kingswinford, which was then in Staffordshire, and attended Brierley Hill Secondary School.Includes a lengthy extract from the match programme of the E.S.F.A. Trophy Final second leg, 23 May 1951. He made his name in schools football, as inside right and playmaker in the Brierley Hill, Sedgley & District Schools team that reached the final of the English Schools' Football Association Trophy in 1951. Cochrane, together with his schools' team captain and future England international Trevor Smith,Matthews, p. 125. joined Birmingham City in the summer of 1951, and signed professional forms when he turned 17."]}, {"page": "1960 Inter-Cities Fairs Cup Final", "response": ["At home in the first leg against a Zagreb XI full of players with international experience, Birmingham were without Trevor Smith, away with the England under-23 team. They won one-nil, Larkin scoring a first-half header, and goalkeeper Johnny Schofield producing several good saves to maintain the lead. They prepared for the visit to Zagreb with three friendly matches in Switzerland, in one of which Larkin was sent off and received a 14-day suspension from the Football Association (the FA). A lively game in Zagreb finished 3–3, with goals from Larkin (2) and Hooper, giving Birmingham a 4–3 aggregate win, but Smith and Zagreb forward Dionizije Dvornic were sent off late in the game. As one of four players sent off that summer while playing abroad, Smith was severely censured by the FA, who issued a warning that \"misconduct on the field of play of the nature reported brings English football into disrepute and may lead to future applications by the clubs concerned to make foreign tours being refused\".", "Before the game, Trevor Smith had told the Daily Mirror that his team intended not to commit themselves to tackling their opponents, but rather to \"funnel back\" in defence, forcing the visitors to shoot from distance. That was indeed how they played, and the tactic was successful. The Mirror's Bill Holden wrote that \"for a team struggling against relegation and up against the greatest collection of international stars by any European club, they did a wonderful job\". At a time when televised football in Britain was still generally restricted to the FA Cup Final and England international matches, the second half of the match was covered live on the BBC, with commentary by Kenneth Wolstenholme.", "|CH||5|| Trevor Smith (c)", "The Birmingham party – fifteen players, trainer, manager, doctor and six officials – arrived by air the afternoon before the match. Manager Pat Beasley told the press that his team had recovered from their slump in the league and were in great form, that although Barcelona were a great side, and would want to finish their opponents off in style in front of their fans, particularly after their disappointment in the European Cup, Birmingham's players were quicker and stronger than in the first leg and could spring a surprise. Trevor Smith hoped to put a brake on Barcelona as had been done in the first leg, and, while unwilling to make an explicit prediction, could envisage his team winning. The Daily Telegraph's David Miller confirmed that Birmingham were on top form, and reported that he expected at least 100 fans to make the journey from England to support their club.", "|CH||5|| Trevor Smith (c)"]}, {"page": "1961 Inter-Cities Fairs Cup Final", "response": ["Going into this match, Birmingham were bottom of the table with only one win in ten games. The previous week, forward Robin Stubbs had dislocated his shoulder, and during a Football League Cup replay unhelpfully scheduled for the Monday night, 48 hours before the Roma match, England international Trevor Smith had to leave the field with a thigh strain as Birmingham lost to Third Division side Swindon Town. The 19-year-old Winston Foster, who had previously been used only at right-back, took Smith's place at centre-half, alongside Hennessey and Malcolm Beard in a half-back line composed entirely of teenagers. The players were intended to enjoy a relaxing visit to Warwick Castle the day before the game, but the weather was so wet that the trip was cancelled.", "The trophy was presented to Losi, the Roma captain, by Sir Stanley Rous, newly elected president of FIFA. Stampa Sera described Roma as deserving of their win, as the technically superior side who had had more possession, but accepted that the two goals that made the difference were both fortuitous. They were not surprised that Birmingham were bottom of the league, and rated only Trevor Smith and the 18-year-old Mike Hellawell as good players. Merrick agreed \"that Roma were the better footballing side and deserved to win. But they did not show any sportsmanship.\" Media both English and Italian singled out Lojacono as \"the outstanding performer\" who \"outgeneralled\" his opponents, but whose \"fiery temper ...continually spoiled a superb performance\"; who provoked his opponents, started fights and man-handled the referee but was instrumental in the move that forced Farmer's own goal and was involved in the late winner.", "|CH||5|| Trevor Smith"]}, {"page": "1962–63 Birmingham City F.C. season", "response": ["The first leg of the final, against Birmingham's near neighbours Aston Villa, was played on 23 May at St Andrew's. Birmingham took the lead when Jimmy Harris fed Bertie Auld who crossed for Ken Leek's powerful shot, but Aston Villa equalised via Bobby Thomson. Seven minutes into the second half, the same combination of players made it 2–1, and after 66 minutes Jimmy Bloomfield \"ended an excellent run by scoring from a narrow angle, earning even the applause of Villa players\" to give Birmingham a 3–1 lead.Matthews (1995), p. 33. The second leg, four days later at Villa Park, was goalless. Former England centre half Trevor Smith marked Thomson out of the game, Birmingham's defensive tactics included repeatedly kicking the ball out for throw-ins, and Aston Villa were unable to break their opponents down."]}, {"page": "1959–60 Birmingham City F.C. season", "response": ["Twenty-two players made at least one appearance in senior first-team competition, and there were fifteen different goalscorers. Half backs Trevor Smith and Johnny Watts played in 46 of the 47 first-team matches over the season, and Johnny Gordon finished as leading goalscorer with 19 goals in all competitions, of which 16 were scored in the league."]}, {"page": "1954–55 Birmingham City F.C. season", "response": ["Bob Brocklebank and chief scout Walter Taylor laid the foundations for the club's successes of the 1950s, introducing future England internationals Trevor Smith and Jeff Hall to the side, and bringing in the likes of Peter Murphy, Eddy Brown, Roy Warhurst and Alex Govan.Matthews, Complete Record, p. 61."]}]}}