{"wiki_id": "http://www.wikidata.org/entity/Q7831761", "itemLabel": "Tracy Ifeachor", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Tracy_Ifeachor", "wikipedia_page": {"main": "Tracy Ifeachor is a British television and theatre actress best known for playing the role of Aya Al-Rashid in The CW vampire series The Originals and Abigail Naismith in both parts of the Doctor Who Christmas special, \"The End of Time\".", "link_mentions": [{"page": "Show Boat", "response": ["* In 2011, a two-part version was broadcast on BBC Radio 4 in the Classic Serial spot. Solely based on the novel by Edna Ferber, it was dramatized by Moya O'Shea, and was produced and directed by Tracey Neale. It starred Samantha Spiro as Magnolia, Ryan McCluskey as Ravenal, Nonso Anozie as Joe, Tracy Ifeachor as Queenie, Laurel Lefkow as Parthy Ann, Morgan Deare as Cap'n Andy and Lysette Anthony as Kim. Original music was by Neil Brand.\"'Show Boat', Episode 1 of 2, 20 Feb 2011 and 26 Feb 2011\" bbc.co.uk. Retrieved February 21, 2011."]}, {"page": "List of pirate films and television series", "response": ["|John Malkovich, Richard Coyle, Claire Foy, Yasmine Al Masri, David Hoflin, Chris Perfetti, Tracy Ifeachor"]}, {"page": "Igbo Americans", "response": ["* Tracy Ifeachor"]}, {"page": "List of Igbo people", "response": ["* Tracy Ifeachor, known for roles in Blooded, Billionaire Ransom, Casualty, Doctor Who, Strike Back, Jo, Crossbones, Hawaii Five-0, Ina Paha, The Originals, Quantico"]}, {"page": "List of British actors", "response": ["* Tracy Ifeachor (born 1985) (Nigerian-British)"]}, {"page": "Ian Charleson Awards", "response": ["*Tracy Ifeachor, for Rosalind in As You Like It (Curve Theatre) "]}, {"page": "Welcome to Thebes", "response": ["* Ismene – Tracy Ifeachor"]}, {"page": "A Raisin in the Sun", "response": ["*Tracy Ifeachor – Beneatha Younger"]}, {"page": "Blooded (film)", "response": ["Filming was completed in 2009, shot in a mockumentary style, using interviews and internet footage. The plot involves a group of five young deer hunters on a hunt in Scotland.  Eve Jourdan (Tracy Ifeachor) bags a deer and is \"blooded\", a hunting ritual where the blood of a first kill is smeared on a hunter's face.  The following morning, an extremist animal rights action group calling themselves the \"Real Animal League\", kidnaps the five, strips them to their underwear, and leaves each alone in different locations across the hills, setting them as prey of other hunters.  The league films the events in first person style as the five become the \"game\" in a hunt, with the intention of using the footage as a warning to other hunters. It is their \"documentary\" footage that is the basis of the film."]}, {"page": "List of British films of 2011", "response": ["|| Director: Edward Boase   Cast: Nick Ashdon, Oliver Boot, Sharon Duncan Brewster, Tracy Ifeachor, Joseph Kloska, Jay Taylor, Cicely Tennant"]}, {"page": "Crossbones (TV series)", "response": ["* Tracy Ifeachor as Nenna Ajanlekoko"]}, {"page": "List of Arrowverse cast members", "response": ["| Tracy Ifeachor"]}, {"page": "Vixen (web series)", "response": ["Guggenheim stated that if the series was successful, a live-action series centered on the character could be possible. Echikunwoke appeared as the character on Arrow during the fourth-season episode \"Taken,\" in which Mari aided Oliver Queen and his team in rescuing his kidnapped son. After Vixen's appearance on Arrow, Pedowitz reiterated again that it would be possible for the character to spin out to her own live-action series, or potentially join the characters on Legends of Tomorrow. It was originally intended for Echikunwoke to reprise her role in the second season of Legends of Tomorrow, but she was unable to do so due to previous commitments. Maisie Richardson-Sellers was ultimately cast to portray Amaya Jiwe, the grandmother of McCabe who also operated as Vixen. Kuasa appears throughout the third season of Legends of Tomorrow, portrayed by Tracy Ifeachor, while Chuck McCabe appears in the episode \"I, Ava\" and is portrayed by Eli Gabay. The events of the season end up retroactively changing the continuity of Vixen, resulting in an altered timeline where Zambesi was never destroyed, and Mari shares the Vixen mantle with Kuasa."]}, {"page": "Quantico (TV series)", "response": ["Following the season one finale, Safran confirmed that all series regulars would return for the second season, except for Acosta, Ellington and Hopkins, whose characters were killed off. Safran also expressed interest in bringing back Cross' Claire Haas after it was revealed that she was involved in the bombing plot. Safran discussed the return of Henry Czerny, who played CIA director Matthew Keyes in the season one finale, since the character was important to the storyline. In July 2016, Czerny joined the cast in the recurring role. The series added three regulars to the cast: Russell Tovey as Harry Doyle, Blair Underwood as CIA officer Owen Hall and Pearl Thusi as type-A attorney Dayana Mampasi. In July 2016, Aarón Díaz joined the series in a recurring role as photojournalist León Velez, and it was reported that Tracy Ifeachor and David Lim were cast in recurring roles as Lydia Hall and Sebastian Chen. In early 2017, Hunter Parrish and Krysta Rodriguez were cast in the recurring roles of Clay Haas and Maxine Griffin."]}, {"page": "The Originals (season 3)", "response": ["* Tracy Ifeachor as Aya Al-Rashid"]}, {"page": "Alex Parrish", "response": ["In the second season, Parrish, who appears to have been fired from the FBI, is working a desk job as an analyst at the CIA while living with Shelby and continuing her relationship with Ryan, who later becomes her fiancé. Flashbacks reveal that she is working undercover for the FBI as a CIA recruit. She is tasked with uncovering a rogue faction of the CIA called the AIC. At The Farm, she is joined with other recruits, including Harry Doyle (Russell Tovey), Dayana Mampasi (Pearl Thusi), Sebastian Chen (David Lim), León Velez (Aarón Díaz), Leigh Davis (Heléne Yorke), and Jeremy Miller (David Call). Ryan later joins the other recruits at the site, much to Alex's surprise. Some time after her recruitment, Alex has a meeting with Matthew Keyes and Miranda Shaw. It is revealed that she was recruited by the CIA as part of a covert mission to establish any potential threats within the agency. Ryan is also recruited by the agency for the same mission. Owen Hall (Blair Underwood) is confirmed to be the primary CIA instructor for the training site at TheFarm. In addition, Lydia Hall (Tracy Ifeachor) is later revealed to be another trainer on-site. Alex and the other recruits undergo a series of training assessments in order to become future case officers. After being kicked out of TheFarm by Lydia, Alex goes back to working as an analyst. In addition, she breaks off her engagement with Ryan some time before the 2018 G-20 hostage crisis in New York."]}, {"page": "List of continuity announcers in the United Kingdom", "response": ["* Tracy Ifeachor"]}, {"page": "List of Legends of Tomorrow characters", "response": ["The third season sees the Legends repairing anachronisms across the timestream. In addition, they also face opposition from Rip's Time Bureau and a demonic entity called Mallus (John Noble), whose disciple, Nora Darhk (Courtney Ford), has resurrected her father Damien and Amaya's future granddaughter Kuasa (Tracy Ifeachor). Though the team loses Stein and Jackson, they gain new allies in computer hacker Zari Tomaz (Tala Ashe), speedster Wally West / Kid Flash (Keiynan Lonsdale), and Time Bureau agents Ava Sharpe (Jes Macallan) and Gary Green (Adam Tsekhman). In the end, Rip dies fighting Mallus while Amaya and Wally depart following the demon's defeat. In the fourth season, the Legends must capture a group of mythical creatures that were released when they freed Mallus. Along the way, they must also stop the demon Neron from unleashing Hell on Earth. The team is joined by occult detective John Constantine (Matt Ryan), shapeshifting fugitive Charlie (Maisie Richardson-Sellers), Kaupe Mona Wu (Ramona Young), and a reformed Nora. After changing the timeline while defeating Neron, Zari is erased from the team and replaced by her brother, Behrad Tarazi (Shayan Sobhian).", "| Tracy Ifeachor", "Kuasa (portrayed by Tracy Ifeachor) is the granddaughter of Amaya Jiwe, the sister of Mari McCabe and a follower of Mallus who once wielded the water totem of Zambezi which gave her the ability to control water. The water totem is eventually infused with Kuasa, allowing her to change her body into water for various purposes. Anika Noni Rose previously voiced Kuasa on the Vixen animated series."]}, {"page": "List of The Originals characters", "response": ["| Tracy Ifeachor"]}, {"page": "Quantico (season 2)", "response": ["* Tracy Ifeachor as Lydia Hall", "Following Díaz's casting, it was reported that Tracy Ifeachor and David Lim were cast in recurring roles as Lydia Hall and Sebastian Chen, respectively. In late July 2016, Henry Czerny, who played the CIA director Matthew Keyes in the season 1 finale, joined the cast in a recurring role. Safran revealed he was important for the second season storyline. The casting of Hunter Parrish and Krysta Rodriguez in the recurring roles of Clay Haas and Maxine Griffin, respectively, was announced in early 2017. In March 2017, it was announced that Spanish supermodel Jon Kortajarena would be joining the cast as Felix Cordova, a political operative."]}, {"page": "List of Quantico characters", "response": ["Lydia Hall (portrayed by Tracy Ifeachor) is a CIA case officer and co-instructor at The Farm. Originally posing as just another recruit with the surname Bates, she and Owen Hall revealed her true role as a lesson to the others. As co-instructor, she's pushed Alex Parrish really hard during the training exercises. Towards the end of the 2018 Hostage Crisis, it was revealed that she uploaded contents of a hard drive containing top secret classified information of the United States. As a result of her actions, she was incarcerated in a federal prison."]}, {"page": "The Originalist", "response": ["From July 19 to August 19, 2018, the play was performed at the 59E59 Theaters in New York City, with Gero continuing in the lead role and Tracy Ifeachor as the fictional law clerk. Following the performance of July 29, 2018, Justice Ruth Bader Ginsburg participated in a conversation on stage with the play's director, Molly Smith."]}, {"page": "Legends of Tomorrow (season 3)", "response": ["* Tracy Ifeachor as Kuasa", "Arthur Darvill, who played Rip Hunter as a main cast member in the first two seasons, was demoted to a recurring cast member for the third season. Numerous actors returned in their roles from other Arrowvverse series in recurring capacity, such as Neal McDonough as Damien Darhk, David Sobolov as the voice of Grodd, Christina Brucato as Lily Stein, and Matt Ryan as John Constantine. Tracy Ifeachor was cast as Jiwe's granddaughter Kuasa, replacing Anika Noni Rose who voiced the character in the animated web series Vixen, and Courtney Ford was cast as Darhk's daughter Nora, previously played by Tuesday Hoffman on Arrow. Sellers' mother Joy Richardson recurred as Jiwe's vision quest ancestor. Wentworth Miller, who played Leonard Snart / Captain Cold as a regular in season 1 and recurred in season 2, returned to play the character's Earth-X doppelganger Leo Snart. John Noble voices Mallus, the season's main antagonist, but the character's true form is not revealed until the season's penultimate episode \"Guest Starring John Noble\", where Noble also portrays himself in a guest appearance. Jes Macallan, Adam Tsekhman and Hiro Kanagawa recurred as the Time Bureau agents Ava Sharpe, Gary Green and Wilbur Bennett, respectively."]}, {"page": "Treadstone", "response": ["* Tracy Ifeachor as Tara Coleman", "On November 8, 2018, it was announced that Jeremy Irvine and Brian J. Smith had been cast in lead roles. On January 14, 2019, it was reported Omar Metwally, Tracy Ifeachor, Han Hyo-joo, Gabrielle Scharnitzky, and Emilia Schüle had joined the main cast. Michelle Forbes, Michael Gaston and Shruti Haasan were added to the cast, with Patrick Fugit and Tess Haubrich also appearing in a recurring capacity."]}, {"page": "Wonka (film)", "response": ["* Tracy Ifeachor"]}, {"page": "Showtrial (TV series)", "response": ["Showtrial is a British television legal drama created by Ben Richards and starring Tracy Ifeachor and Céline Buckens. The five-part series commenced on BBC One in October 2021.", "* Tracy Ifeachor as Cleo Roberts"]}]}}