{"wiki_id": "http://www.wikidata.org/entity/Q7839453", "itemLabel": "Trevor Tainton", "itemDescription": "Footballer (born 1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Tainton", "wikipedia_page": {"main": "Trevor Keith Tainton (born 8 June 1948) is a former footballer who played as a midfielder in the Football League between the 1960s and 1980s  for Bristol City.He was born in Bristol and first appeared in the league for Bristol City in the 1967–68 season and he went on to play 486 League games for the Ashton Gate side. He was a member of the successful promotion side of 1976, and went on to play for City in the First Division. He is third on City’s all-time appearances list, playing in 581 matches.During the 1981/82 season Tainton joined Torquay United, scoring one goal in 19 league appearances that season before moving to Trowbridge Town.\nHe is a member of Bristol City's Hall of Fame.After retiring from football he worked as a security officer at the Oldbury Nuclear Power Station.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["City's second stint in the top flight was less successful than the club's first, with thirteenth position in 1979 being their highest finish during this era. Stars of this era included Peter Cormack, Geoff Merrick, Tom Ritchie, Clive Whitehead, Gerry Gow, Trevor Tainton and Jimmy Mann.", "In 1980, the City team went back to the Second Division in the first of three relegations, their debt mounted and their financial losses increased, with two successive relegations following. Thus, in 1982, they fell into the Fourth Division, and were declared bankrupt. A new club was formed and BCFC (1982) Ltd acquired the club's player contracts. The highly paid senior players Julian Marshall, Chris Garland, Jimmy Mann, Peter Aitken, Geoff Merrick, David Rodgers, Gerry Sweeney and Trevor Tainton, who became known as the 'Ashton Gate Eight', each accepted termination of his contract for half the amount due. The club's previous owners had failed to pay its debts to many local businesses. The resulting ill will towards the club made it difficult for the new owners to obtain credit.", "|align=\"left\"| Trevor Tainton"]}, {"page": "Trowbridge Town F.C.", "response": ["*Trevor Tainton"]}, {"page": "Chris Garland", "response": ["He rarely featured under Houghton, and when new manager Roy Hodgson arrived he informed Garland and seven teammates (Julian Marshall, Jimmy Mann, Geoff Merrick, Peter Aitken, David Rodgers, Trevor Tainton and Gerry Sweeney), known as the \"Ashton Gate Eight\", that would have to take voluntary redundancy as part of a last-ditch plan to save the club, which was on the verge of folding; Garland agreed and lost £3,750. He and Merrick then spent six months playing in Hong Kong for Caroline Hill. City suffered a third successive relegation in 1981–82 after dropping out of the Third Division. After relegation to the Fourth Division,  Garland would go on to be re-employed by Bristol City manager Terry Cooper for the 1982–83 season, playing as a non-contract player until February 1983, when he retired."]}, {"page": "Peter Aitken", "response": ["Aitken began his career as an apprentice with Bristol Rovers, making his debut in the 1972–73 season. He joined local rivals Bristol City in 1980, and two years later, with the club in danger of folding, Aitken was one of the \"Ashton Gate Eight\", eight players who agreed to terminate their contracts to save the club. The others were Dave Rodger, Geoff Merrick, Julian Marshall, Chris Garland, Jimmy Mann, Trevor Tainton, and Gerry Sweeney. While with Rovers he was the club captain, and after joining City he became the only player to captain both Bristol Clubs."]}, {"page": "Severnside derby", "response": ["|Trevor Tainton  Gerry Sweeney "]}, {"page": "Tainton", "response": ["* Trevor Tainton (born 1948), English footballer"]}, {"page": "Coventry City 2–2 Bristol City (1977)", "response": ["Coventry began the match in attacking style, seeking to secure the win which for them was the only way to be certain of survival. Committing several players to attack left Coventry vulnerable, and Bristol City twice found themselves with the ball behind Coventry's defence. The two chances fell to Chris Garland and Jimmy Mann, but neither was able to beat Coventry goalkeeper Les Sealey. Two minutes after Mann's miss, Coventry took the lead. A free kick by Mick Coop was parried weakly by Bristol City goalkeeper John Shaw and fell to Tommy Hutchison, who scored his second goal of the season with a powerful shot. Bristol City had several chances to equalise just before half-time – first through a goal-line clearance by McDonald, then through  Trevor Tainton, whose 20-yard shot was saved by Sealey. The final Bristol City chance of the half resulted from a Coventry defensive mix-up; Yorath allowed a pass from Donnie Gillies through to Sealey, but the goalkeeper was not expecting it and the ball only narrowly missed the Coventry goal. The score remained  to Coventry at half-time.", "|7 || Trevor Tainton"]}]}}