{"wiki_id": "http://www.wikidata.org/entity/Q7846829", "itemLabel": "Troy Glasgow", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Troy_Glasgow", "wikipedia_page": {"main": "Troy Glasgow (born 11 September 1984) is a British actor.", "link_mentions": [{"page": "Jeffery Kissoon", "response": ["In 1985, Kissoon played Karna in Peter Brook's nine-hour stage adaptation of The Mahabharata.Frank Rich, New York Times, October 1987. The three-year project opened at the Festival d'Avignon in France and completed a world tour, ultimately leading to a film adaptation running to six hours. It also resulted in a lasting professional association between Kissoon and Brook, which witnessed Kissoon play two roles in the director's production of Shakespeare's Hamlet.Michael Billington in The Guardian, 20 December 2000. Kissoon is a veteran cast member of both RSC and Royal National Theatre productions, regularly collaborating with director Sir Peter Hall.Michael Coveney, \"Alan Howard was not immune to the curse of Thebes. He fell off the stage and broke his wrist\" , The Observer, 8 September 1996. In 2002, he participated in a rehearsed reading of Wrong Place at the Soho Theatre,BBC London.  continuing his association with playwright Mark Norfolk whose play ″Knock Down Ginger″ he later directed at the Warehouse Theatre the following year. The play starred former Eastenders actors Judith Jacob, Sylvester Williams  and marked the stage debut of Troy Glasgow."]}, {"page": "List of American films of 2008", "response": ["| Adulthood ‡ || Lionsgate || Noel Clarke (director/screenplay); Noel Clarke, Adam Deacon, Scarlett Alice Johnson, Femi Oyeniran, Red Madrell, Jacob Anderson, Ben Drew, Wil Johnson, Nathan Constance, Adjoa Andoh, Madeleine Fairley, Danny Dyer, Lindsey Jordan, Kiera Booth, Arnold Oceng, Don Klass, Troy Glasgow, David Ajala, Pierre Mascolo, Shanika Warren-Markland || Drama"]}, {"page": "Adulthood (film)", "response": ["*Troy Glasgow as Jahvon"]}, {"page": "Harper Regan", "response": ["| Tobias Rich || Troy Glasgow"]}, {"page": "The Day of the Triffids (2009 TV series)", "response": ["Finding the head during a daring break into an abandoned plantation, the new Triffid proves to be a success but at the same time Coker drops some papers off at the house, which explains the details of a new colony on the Isle of Wight, where the last of the Triffids were exterminated. Dennis' examination of his wife's Triffid recordings from Zaire causes the growing Triffid to react, attacking him with its stinger. Bill hears Dennis' cry for help and attempts to free his father, firing at the Triffid through its head. With Dennis dead and the subject destroyed, the group has no option but to leave for the Isle of Wight. Before they can leave, Torrence turns up at the house with a group of men, looking for the solution to the Triffids but Bill refuses to tell him the plan. Torrence threatens to kill him, Jo and the girls if he doesn't find a new plan by the next morning. Bill plans an escape, using the same recordings that killed his father earlier to draw in more Triffids to cause a distraction. Their plans are nearly thwarted by one of the soldiers, a rookie cadet named Troy (Troy Glasgow), who defects to them by faking their deaths to Torrence. The inactive fence is destroyed by the Triffid swarm, trapping everybody in the house and grounds but one of the girls picks up an old folk mask from Bill's old things, causing him to remember something from 30 years previous. He was told on that day by a man that the mask would help him to see by being temporarily blinded by Triffid poison. Realising that this is the solution they've been looking for, he administers the treatment to himself, Jo, Troy, Susan and Imogen. It allows them to pass through the Triffids unharmed but Torrence and his remaining forces are eventually overwhelmed by them and killed.", "In November 2008, it was announced that the BBC was to film a new version of the story; the drama was screened on 28 and 29 December 2009, starring Dougray Scott as Bill Masen, Joely Richardson as Jo Playton, Brian Cox as Dennis Masen, Vanessa Redgrave as Durrant, Eddie Izzard as Torrence, Jason Priestley as Coker, Jenn Murray as Susan, Ewen Bremner as Walter Strange, Shane Taylor as Osman, Troy Glasgow as Troy, Adam Sinclair as Ashdown, Lizzie Hopley as Hilda and Julia Joyce as Imogen."]}, {"page": "Mark Norfolk", "response": ["Norfolk's play, Knock Down Ginger was produced at the Warehouse Theatre after being selected for its International Playwriting Festival in June 2002. The play was nominated for the Arts Council's Eclipse Award For Combating Racism Through Theatre and was shortlisted for the Verity Bargate playwriting award,The Guardian, 6 October 2003,http://www.guardian.co.uk/stage/2003/oct/06/theatre.race later the same year it was staged in Urbino, Italy, opening the Premio Candoni Festival of New Writing and won a Croydon Guardian Culture Award.Premio Candoni Festival Catalogue. http://www.unfilmperlapace.it/catalog08.pdf The play, directed by Jeffery Kissoon, starred Judith Jacob, Sylvester Williams and marked the stage debut for Troy Glasgow."]}, {"page": "Toby Swift", "response": ["| Jeffery Kissoon, Jimmy Akingbola, Sheri-An Davis and Troy Glasgow"]}, {"page": "The Anniversary, Part Two", "response": ["* Ashley Morgan (Troy Glasgow)"]}, {"page": "London's Burning (film)", "response": ["* Troy Glasgow as Lee"]}]}}