{"wiki_id": "http://www.wikidata.org/entity/Q78494", "itemLabel": "Arthur Koestler", "itemDescription": "Hungarian-British author and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Koestler", "wikipedia_page": {"main": "Arthur Koestler,  (UK: , US: ; German: [ˈkœstlɐ]; Hungarian: Kösztler Artúr; 5 September 1905 – 1 March 1983) was a Hungarian British Jewish author and journalist. Koestler was born in Budapest and, apart from his early school years, was educated in Austria. In 1931, Koestler joined the Communist Party of Germany, but he resigned in 1938 because Stalinism disillusioned him.\nHaving moved to Britain, in 1940 he published his novel Darkness at Noon, an anti-totalitarian work that gained him international fame. Over the next 43 years, Koestler espoused many political causes and wrote novels, memoirs, biographies, and numerous essays. In 1949, Koestler began secretly working with a British Cold War anti-communist propaganda department known as the Information Research Department (IRD), which would republish and distribute many of his works, and also fund his activities. In 1968, he was awarded the Sonning Prize \"for [his] outstanding contribution to European culture\". In 1972 he was made a Commander of the Order of the British Empire (CBE).\nIn 1976, he was diagnosed with Parkinson's disease and in 1979 with terminal leukaemia. In 1983, he and his wife Cynthia committed suicide together at their home in London.", "link_mentions": [{"page": "ArthurKoestler", "response": ["#REDIRECT Arthur Koestler"]}, {"page": "Animal Farm", "response": ["George Orwell wrote the manuscript between November 1943 and February 1944 after his experiences during the Spanish Civil War, which he described in Homage to Catalonia (1938). In the preface of a 1947 Ukrainian edition of Animal Farm, he explained how escaping the communist purges in Spain taught him \"how easily totalitarian propaganda can control the opinion of enlightened people in democratic countries.\" This motivated Orwell to expose and strongly condemn what he saw as the Stalinist corruption of the original socialist ideals. Homage to Catalonia sold poorly; after seeing Arthur Koestler's best-selling, Darkness at Noon, about the Moscow Trials, Orwell decided that fiction was the best way to describe totalitarianism.", "Peter Edgerly Firchow and Peter Davison contend that the Battle of the Windmill, specifically referencing the Battle of Stalingrad and the Battle of Moscow,  represents World War II. During the battle, Orwell first wrote, \"All the animals, including Napoleon\" took cover. Orwell had the publisher alter this to \"All the animals except Napoleon\" in recognition of Stalin's decision to remain in Moscow during the German advance. Orwell requested the change after he met Józef Czapski in Paris in March 1945. Czapski, a survivor of the Katyn Massacre and an opponent of the Soviet regime, told Orwell, as Orwell wrote to Arthur Koestler, that it had been \"the character [and] greatness of Stalin\" that saved Russia from the German invasion."]}, {"page": "Albert Camus", "response": ["He was sharply critical of the proliferation of nuclear weapons and the bombings of Hiroshima and Nagasaki. In the 1950s, Camus devoted his efforts to human rights. In 1952, he resigned from his work for UNESCO when the UN accepted Spain, under the leadership of the caudillo General Francisco Franco, as a member. Camus maintained his pacifism and resisted capital punishment anywhere in the world. He wrote an essay against capital punishment in collaboration with Arthur Koestler, the writer, intellectual, and founder of the League Against Capital Punishment entitled Réflexions sur la peine capitale (Reflections on capital punishment), published by Calmann-Levy in 1957."]}, {"page": "Circle", "response": ["Early science, particularly geometry and astrology and astronomy, was connected to the divine for most medieval scholars, and many believed that there was something intrinsically \"divine\" or \"perfect\" that could be found in circles.Arthur Koestler, The Sleepwalkers: A History of Man's Changing Vision of the Universe (1959)Proclus, The Six Books of Proclus, the Platonic Successor, on the Theology of Plato  Tr. Thomas Taylor (1816) Vol. 2, Ch. 2, \"Of Plato\""]}, {"page": "Dalton Trumbo", "response": ["In a 1946 article titled \"The Russian Menace\" published in Rob Wagner's Script Magazine, Trumbo wrote from the perspective of a post-World War II Russian citizen. He argued that Russians were likely fearful of the mass of U.S. military power that surrounded them, at a time when any sympathetic view toward Communist countries was viewed with suspicion. He ended the article by stating, \"If I were a Russian ... I would be alarmed, and I would petition my government to take measures at once against what would seem an almost certain blow aimed at my existence. This is how it must appear in Russia today\". He argued that the U.S. was a \"menace\" to Russia, rather than the more popular American view of Russia as the \"red menace\". According to anti-Communist author Kenneth Billingsley, Trumbo had written in The Daily Worker that Communist influence in Hollywood had prevented films from being made from anti-Communist books, such as Arthur Koestler's Darkness at Noon and The Yogi and the Commissar."]}, {"page": "George Orwell", "response": ["In the year following Eileen's death he published around 130 articles and a selection of his Critical Essays, while remaining active in various political lobbying campaigns. He employed a housekeeper, Susan Watson, to look after his adopted son at the Islington flat, which visitors now described as \"bleak\". In September he spent a fortnight on the island of Jura in the Inner Hebrides and saw it as a place to escape from the hassle of London literary life. David Astor was instrumental in arranging a place for Orwell on Jura. Astor's family owned Scottish estates in the area and a fellow Old Etonian, Robin Fletcher, had a property on the island. In late 1945 and early 1946 Orwell made several hopeless and unwelcome marriage proposals to younger women, including Celia Kirwan (who later became Arthur Koestler's sister-in-law); Ann Popham who happened to live in the same block of flats; and Sonia Brownell, one of Connolly's coterie at the Horizon office. Orwell suffered a tubercular haemorrhage in February 1946 but disguised his illness. In 1945 or early 1946, while still living at Canonbury Square, Orwell wrote an article on \"British Cookery\", complete with recipes, commissioned by the British Council. Given the post-war shortages, both parties agreed not to publish it. His sister Marjorie died of kidney disease in May, and soon afterwards, on 22 May 1946, Orwell set off to live on the Isle of Jura at a house known as Barnhill. is located at  (British national grid reference system NR705970)", "Orwell was an admirer of Arthur Koestler and became a close friend during the three years that Koestler and his wife Mamain spent at the cottage of Bwlch Ocyn, a secluded farmhouse that belonged to Clough Williams-Ellis, in the Vale of Ffestiniog. Orwell reviewed Koestler's Darkness at Noon for the New Statesman in 1941, saying:", "Arthur Koestler said that Orwell's \"uncompromising intellectual honesty made him appear almost inhuman at times\". Ben Wattenberg stated: \"Orwell's writing pierced intellectual hypocrisy wherever he found it\". According to historian Piers Brendon, \"Orwell was the saint of common decency who would in earlier days, said his BBC boss Rushbrook Williams, 'have been either canonised—or burnt at the stake'\". Raymond Williams in Politics and Letters: Interviews with New Left Review describes Orwell as a \"successful impersonation of a plain man who bumps into experience in an unmediated way and tells the truth about it\".Raymond Williams Politics and Letters 1979 Christopher Norris declared that Orwell's \"homespun empiricist outlook—his assumption that the truth was just there to be told in a straightforward common-sense way—now seems not merely naïve but culpably self-deluding\".Christopher Norris Language, Truth and Ideology: Orwell and the Post War Left in Inside the Myth: Orwell views from the Left Lawrence and Whishart 1984 The American scholar Scott Lucas has described Orwell as an enemy of the Left.Lucas, Scott (2003). Orwell. Haus Publishing.  John Newsinger has argued that Lucas could only do this by portraying \"all of Orwell's attacks on Stalinism [–] as if they were attacks on socialism, despite Orwell's continued insistence that they were not\"."]}, {"page": "Hungary", "response": ["The older classics of Hungarian literature and Hungarian poetry have remained almost totally unknown outside Hungary. János Arany, a famous 19th-century Hungarian poet, is still much loved in Hungary (especially his collection of Ballads), among several other \"true classics\" like Sándor Petőfi, the poet of the Revolution of 1848, Endre Ady, Mihály Babits, Dezső Kosztolányi, Attila József, Miklós Radnóti and János Pilinszky. Other well-known Hungarian authors are Mór Jókai. Frigyes Karinthy, László Krasznahorkai, Ferenc Móra, Géza Gárdonyi, Zsigmond Móricz, Ephraim Kishon, Géza Gárdonyi, Arthur Koestler, Ferenc Molnár, Elie Wiesel, Kálmán Mikszáth, Gyula Illyés, Miklós Szentkuthy, Magda Szabó and Stephen Vizinczey."]}, {"page": "Johannes Kepler", "response": ["Kepler has acquired a popular image as an icon of scientific modernity and a man before his time; science popularizer Carl Sagan described him as \"the first astrophysicist and the last scientific astrologer\".Quote from Carl Sagan, Cosmos: A Personal Voyage, episode III: \"The Harmony of the Worlds\". The debate over Kepler's place in the Scientific Revolution has produced a wide variety of philosophical and popular treatments. One of the most influential is Arthur Koestler's 1959 The Sleepwalkers, in which Kepler is unambiguously the hero (morally and theologically as well as intellectually) of the revolution.Stephen Toulmin, Review of The Sleepwalkers in The Journal of Philosophy, Vol. 59, no. 18 (1962), pp. 500–503"]}, {"page": "John Milton", "response": ["Titles of a number of other well-known literary works are also derived from Milton's writings.  Examples include Thomas Wolfe's Look Homeward, Angel, Aldous Huxley's Eyeless in Gaza, Arthur Koestler's Darkness at Noon, and William Golding's Darkness Visible.Rosen, J. \"Return to Paradise\". The New Yorker, 2 June 2008, pp. 72–6."]}, {"page": "Khazars", "response": ["The Khazar-Ashkenazi hypothesis came to the attention of a much wider public with the publication of Arthur Koestler's The Thirteenth Tribe in 1976, which was both positively reviewed and dismissed as a fantasy, and a somewhat dangerous one. Israeli historian Zvi Ankori argued that Koestler had allowed his literary imagination to espouse Poliak's thesis, which most historians dismissed as speculative. Israel's ambassador to Britain branded it \"an anti-Semitic action financed by the Palestinians\", while Bernard Lewis claimed that the idea was not supported by any evidence whatsoever, and had been abandoned by all serious scholars. Raphael Patai, however, registered some support for the idea that Khazar remnants had played a role in the growth of Eastern European Jewish communities, and several amateur researchers, such as Boris Altschüler (1994), kept the thesis in the public eye. The theory has been occasionally manipulated to deny Jewish nationhood. Recently, a variety of approaches, from linguistics (Paul Wexler) to historiography (Shlomo Sand) and population genetics (Eran Elhaik, a geneticist from the University of Sheffield) have emerged to keep the theory alive. In a broad academic perspective, both the idea that the Khazars converted en masse to Judaism and the suggestion they emigrated to form the core population of Ashkenazi Jewry, remain highly polemical issues."]}, {"page": "Knut Hamsun", "response": ["Thomas Mann described him as a \"descendant of Fyodor Dostoyevsky and Friedrich Nietzsche.\" Arthur Koestler was a fan of his love stories. H. G. Wells praised Markens Grøde (1917) for which  Hamsun was awarded the Nobel Prize in Literature. Isaac Bashevis Singer was a fan of his modern subjectivism, use of flashbacks, his use of fragmentation, and his lyricism. A character in Charles Bukowski's book Women referred to him as the greatest writer who has ever lived.Charles Bukowski, WOMEN, New York: Ecco Books, 2002. p.67"]}, {"page": "Lysergic acid diethylamide", "response": ["In 1963, the Sandoz patents expired on LSD. Several figures, including Aldous Huxley, Timothy Leary, and Al Hubbard, began to advocate the consumption of LSD. LSD became central to the counterculture of the 1960s. In the early 1960s the use of LSD and other hallucinogens was advocated by new proponents of consciousness expansion such as Leary, Huxley, Alan Watts and Arthur Koestler, and according to L. R. Veysey they profoundly influenced the thinking of the new generation of youth."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Arthur Koestler"]}, {"page": "March 1", "response": ["*1983 – Arthur Koestler, Hungarian-English journalist and author (b. 1905)"]}, {"page": "Marshall Plan", "response": ["The Central Intelligence Agency received 5% of the Marshall Plan funds (about $685 million spread over six years), which it used to finance secret operations abroad. Through the Office of Policy Coordination money was directed toward support for labor unions, newspapers, student groups, artists and intellectuals, who were countering the anti-American counterparts subsidized by the communists. The largest sum went to the Congress for Cultural Freedom. There were no agents working among the Soviets or their satellite states. The founding conference of the Congress for Cultural Freedom was held in Berlin in June 1950. Among the leading intellectuals from the US and Western Europe were writers, philosophers, critics and historians: Franz Borkenau, Karl Jaspers, John Dewey, Ignazio Silone, James Burnham, Hugh Trevor-Roper, Arthur Schlesinger Jr., Bertrand Russell, Ernst Reuter, Raymond Aron, Alfred Ayer, Benedetto Croce, Arthur Koestler, Richard Löwenthal, Melvin J. Lasky, Tennessee Williams, Irving Brown, and Sidney Hook. There were conservatives among the participants, but non-communist (or former communist) leftists were more numerous."]}, {"page": "Memetics", "response": ["*Velikovsky (2013) proposed the \"holon\" as the structure of the meme, synthesizing the major theories on memes of Richard Dawkins, Mihaly Csikszentmihalyi, E. O. Wilson, Frederick Turner (poet) and Arthur Koestler."]}, {"page": "Nikolai Bukharin", "response": ["Even more than earlier Moscow show trials, Bukharin's trial horrified many previously sympathetic observers as they watched allegations become more absurd than ever and the purge expand to include almost every living Old Bolshevik leader except Stalin. For some prominent Communists such as Bertram Wolfe, Jay Lovestone, Arthur Koestler, and Heinrich Brandler, the Bukharin trial marked their final break with Communism and even turned the first three into passionate anti-Communists eventually.Bertram David Wolfe, \"Breaking with Communism\", p. 10; Arthur Koestler, Darkness at Noon, p. 258."]}, {"page": "Playboy", "response": ["From 1966 to 1976, Robie Macauley was the Fiction Editor at Playboy. During this period the magazine published fiction by Saul Bellow, Seán Ó Faoláin, John Updike, James Dickey, John Cheever, Doris Lessing, Joyce Carol Oates, Vladimir Nabokov, Michael Crichton, John le Carré, Irwin Shaw, Jean Shepherd, Arthur Koestler, Isaac Bashevis Singer, Bernard Malamud, John Irving, Anne Sexton, Nadine Gordimer, Kurt Vonnegut and J. P. Donleavy, as well as poetry by Yevgeny Yevtushenko."]}]}}