{"wiki_id": "http://www.wikidata.org/entity/Q7859966", "itemLabel": "Tyler Butterworth", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tyler_Butterworth", "wikipedia_page": {"main": "Tyler Butterworth (born 6 February 1959, Redhill, Surrey) is an English actor.", "link_mentions": [{"page": "BBC Television Shakespeare", "response": ["Prior to the screening of the first episode, UK publicity for the series was extensive, with virtually every department at the BBC involved. Once the series had begun, a major aspect of the publicity campaign involved previews of each episode for the press prior to its public broadcast, so reviews could appear before the episode aired; the idea being that good reviews might get people to watch who otherwise would not. Other publicity 'events' included a party to celebrate the commencement of the third season, at The George Inn, Southwark, near the site of the Globe Theatre, and a similar party at the start of the sixth season, in Glamis Castle, which was attended by Ian Hogg, Alan Howard, Joss Ackland, Tyler Butterworth, Wendy Hiller, Patrick Ryecart and Cyril Cusack, all of whom were on hand for interviews by the many invited journalists.Willis, p. 35."]}, {"page": "The Two Gentlemen of Verona", "response": ["In 1983, the play was adapted for the BBC Television Shakespeare series, as the fourth episode of the sixth season. Directed by Don Taylor, it starred Tyler Butterworth as Proteus, John Hudson as Valentine, Tessa Peake-Jones as Julia and Joanne Pearce as Silvia. For the most part, the adaptation is taken verbatim from the First Folio, with some very minor differences. For example, omitted lines include the Duke's \"Knowing that tender youth is soon suggested\" (3.1.34), and Julia's \"Her eyes are grey as glass, and so are mine\" (4.4.189). Other differences include a slightly different opening scene to that indicated in the text. Whereas the play seems to open with Valentine and Proteus in mid-conversation, the adaptation begins with Mercatio and Eglamour attempting to formally woo Julia; Mercatio by showing her a coffer overflowing with gold coins, Eglamour by displaying a parchment detailing his ancestry. Neither Eglamour nor Mercatio appear in the text. However, there is no dialogue in this scene, and the first words spoken are the same as in the text (\"Cease to persuade my loving Proteus\"). Eglamour is also present in the final scene, albeit once again without any dialogue, and, additionally, the capture of Silvia and the flight of Eglamour is seen, as opposed to merely being described. The music for the episode was created by Anthony Rooley, who wrote new arrangements of works from Shakespeare's own time, such as John Dowland's \"Lachrimae\". Performed by The Consort of Musicke, other musicians whose music was used include William Byrd, Thomas Campion, Anthony Holborne, John Johnson, Thomas Morley and Orazio Vecchi."]}, {"page": "List of show business families", "response": ["* Actor and comedian Peter Butterworth was married to the actress and impressionist Janet Brown. Peter and Janet were the parents of actor Tyler Butterworth; Tyler is married to actress Janet Dibley."]}, {"page": "The Darling Buds of May (TV series)", "response": ["* Tyler Butterworth as Reverend John Candy, the local vicar (4 episodes)"]}, {"page": "Peter Butterworth", "response": ["Butterworth was introduced to actress and impressionist Janet Brown by Rothwell and the two married in 1946 at St Mary's, Bryanston Square, Marylebone.Brown, p. 72 Brown later became known for her television impersonations of Margaret Thatcher during the 1970s and 1980s. They had two children: Their son, Tyler Butterworth, also became an actor and is married to the actress Janet Dibley.obituaries The Independent, p. 56 Their daughter, Emma, was born in 1962. She died in 1996 aged 34."]}, {"page": "What the Butler Saw (play)", "response": ["* Tyler Butterworth – Nicholas Beckett"]}, {"page": "London (TV series)", "response": ["*Tyler Butterworth .... Merry Andrew"]}, {"page": "List of Bergerac episodes", "response": ["| Ronald Pickup, Vivian Pickles, James Cossins, Tyler Butterworth, Tenniel Evans, David Gooderson, Graham Weston, William Maxwell"]}, {"page": "The Mrs Bradley Mysteries", "response": ["John Alderton as Alastair Bing; Emma Fielding as Eleanor Bing, aka 'Mouse'; Tristan Gemmill as Garde Bing; Lynda Baron as Mrs. MacNamara; Tom Butcher as Bertie Philipson; Eleanor Tremain as Dorothy Manners; Sue Devaney as Mabel Jones; Simeon Andrews as Family Doctor; Tyler Butterworth as Ferdinand Bradley; Emma Davies as Hermione Bradley;  John Conroy as Henry Baxter;  Andrew Hallett as Constable; Roger Grainger as Funeral Vicar; Alec Linstead as Wedding Vicar; Carmela Marner as Pamela Storbin."]}, {"page": "Consuming Passions", "response": ["* Tyler Butterworth as Ian Littleton  "]}, {"page": "Janet Brown", "response": ["The couple had two children, a son, actor Tyler Butterworth (born 1959), and a daughter, Emma, who died in 1996, aged 34."]}, {"page": "Mike and Angelo", "response": ["The shows initially centred on Mike King (played by Matt Wright), and his mother Rita moving to London from the United States after she divorces Mike's father. In their new house, and feeling lonely in his new surroundings, Mike discovers a mysterious wardrobe. It bursts open containing Angelo (Tyler Butterworth), an alien who came from another world; the portal being the wardrobe. Angelo has no knowledge of life on Earth or of his own - so relies on the help of Mike to understand the world he has crashed on. At the same time, Mike is in turn helped by Angelo to integrate into life in London.", "Series 3 would feature the first of the show's many cast changes, with Tim Whitnall replacing Tyler Butterworth as Angelo. In the first episode of the series, Angelo falls ill and eventually \"regenerates\" (borrowing a concept first used in Doctor Who). Tim Whitnall would remain as the character for the rest of the programme's run. At around this point, the comedy-drama tone of the first two series began to be shifted towards the more fantastical and farcical, with Angelo creating many inventions which typically run out of control, and occasionally summoning up historical figures from the past.", "*Angelo - Tyler Butterworth (1989–1990) & Tim Whitnall (1990–2000): Angelo is a goofy but kind-hearted alien from the planet of Ptarg. He has the ability to make crazy inventions for his friends and among other things, is able to walk on the ceiling."]}, {"page": "Tim Whitnall", "response": ["In 1990, he succeeded Tyler Butterworth in the role of alien Angelo in Children's sci-fi sitcom Mike and Angelo. He portrayed the character for ten series, until the show's end in 2000."]}, {"page": "Harry and the Wrinklies (TV series)", "response": ["*Piggy Priestly - Tyler Butterworth (Series 3)"]}, {"page": "Janet Dibley", "response": ["Dibley married the actor Tyler Butterworth in 1998;\"Janet Dibley, at home in Eastbourne\" Sussex Life (online), accessed 5 August 2014. the couple have two sons.\"Janet Dibley reflects on her role in the play Kindertransport\", Jewish News (online), accessed 5 August 2014."]}, {"page": "Whizziwig", "response": ["* Tyler Butterworth - Mr. Archer"]}, {"page": "Last of the Summer Wine (series 29)", "response": ["*Guest Appearance of Tyler Butterworth, son of 'Carry On' actor Peter Butterworth and actress/impersonator Janet Brown."]}, {"page": "The Magnificent Two", "response": ["* Tyler Butterworth as Miguel - President's Younger Son"]}, {"page": "1990 in British television", "response": ["*14 November – Tim Whitnall succeeds Tyler Butterworth as alien Angelo in long-running ITV children's sitcom Mike and Angelo."]}, {"page": "Butterworth (surname)", "response": ["*Tyler Butterworth (born 1959), English actor"]}, {"page": "Fiddlers Three (TV series)", "response": ["Fiddlers Three is a short-lived British sitcom series produced by Yorkshire Television for ITV, and it ran for 14 episodes from 19 February to 21 May 1991. Written by Eric Chappell and directed by Graham Wetherell, it stars Peter Davison as Ralph West, Paula Wilcox as Ros West, Charles Kay as J.J. Morley, Peter Blake as Harvey, Tyler Butterworth as Osborne and Cindy Marshall-Day as Norma.", "*Tyler Butterworth as Osborne"]}]}}