{"wiki_id": "http://www.wikidata.org/entity/Q7858401", "itemLabel": "Twinnie Lee Moore", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Twinnie-Lee_Moore", "wikipedia_page": {"main": "Twinnie-Lee Moore (born 18 August 1987), known professionally as Twinnie, is an English singer-songwriter and actress, known for playing Porsche McQueen in Channel 4 soap opera Hollyoaks.", "link_mentions": [{"page": "Hollyoaks", "response": ["In November 2012, Hollyoaks aired \"Enjoy the Ride\", in which four regular characters were killed: Rhys Ashworth (Andrew Moss), and three sixth form students, Maddie Morrison (Scarlett Bowman), Neil Cooper (Tosin Cole) and Jono (Dylan Llewellyn). In October 2013, as part of the celebration of the soap opera turning 18, the show aired Hollyoaks — The Blast from 15 October until the end of the week. The storyline saw a cast massacre with five main characters being killed off through the week, and two were also killed off in the annual Hollyoaks Later. In November 2014, the show aired Hollyoaks  – End of The Line from 17–21 November. The storyline saw newcomers Porshe McQueen (Twinnie Lee Moore) and Lockie Campbell (Nick Rhys) celebrate their wedding reception on a party train, and Sienna Blake (Anna Passey)'s car becomes stuck on the tracks after a car chase with her father Patrick Blake (Jeremy Sheffield), causing the train to smash into it and derail. Long-running character Carmel McQueen (Gemma Merna) was killed when the wreckage exploded after saving her cousin Theresa McQueen (Jorgie Porter) from \"villainous\" Sonny Valentine (Aaron Fontaine), who also died in the explosion, who wanted revenge on her for killing Calvin in 2010. Long-running character Mercedes McQueen (Jennifer Metcalfe) also \"died\" in November 2014, just a week after her sister Carmel, in a plot that saw her brutally murdered in the McQueen house by Grace Black. As of December 2014, only two original McQueen family members remain on screen, Myra McQueen (Nicole Barbara Lane) and John Paul McQueen (James Sutton). Mercedes returned in February 2015. In June of that year, Phoebe died after Lindsey Butterfield (Sophie Austin) injects her with potassium chloride. Cleo moves into the house in late January 2015."]}, {"page": "The British Soap Awards", "response": ["| \"Best Newcomer\"Presented by Collabro|| Jessica Regan (Niamh Donoghue in Doctors) || Sean Ward (Callum Logan in Coronation Street)Davood Ghadami (Kush Kazemi in EastEnders)Ryan Hawley (Robert Sugden in Emmerdale)Twinnie Lee Moore (Porsche McQueen in Hollyoaks)"]}, {"page": "Myra McQueen", "response": ["The McQueens discover that Carmel is planning to abduct Kathleen Angel with Sonny whilst attending Myra's niece Porsche McQueen's (Twinnie Lee Moore) wedding to newcomer Lockie Campbell (Nick Rhys). They disown her, and Myra is disgusted in her daughter. Sonny sneaks aboard the train and attacks Phoebe and Theresa, before Sienna Blake's (Anna Passey) car on the tracks causes it to derail. Carmel frees Theresa from Sonny's clutches in the wreckage just before it explodes, and Myra and the rest of the McQueens are devastated when Carmel dies due to injuries sustained in the explosion. Myra clashes with Mercedes in the aftermath of Carmel's death, due to Mercedes believing Theresa ruined Carmel's life and Myra disagreeing. Myra picks Theresa over Mercedes, and Mercedes is left out on the streets whilst the rest of the family grieve for Carmel. Mercedes shows up drunk at Carmel's funeral and starts bringing up incidents from the past where the family hurt Carmel, when Mercedes starts to insult Carmel Myra tells Mercedes that she's done nothing but bring shame on the family and that it should be her in Carmel's coffin, Mercedes storms out in distress. Later that night, Mercedes is supposedly \"murdered\" by an unknown assailant. The next day, Phoebe calls the police concerned about Mercedes whereabouts and when the police detective notices blood on the kitchen floor the house is turns into a crime scene and a murder investigation is launched. Myra starts to fall into a depression after the death of Carmel and apparent death of Mercedes. She was later shocked that John Paul was engagement with Ste, which makes her angry and never wanted him to get married with him, and afraid that it will be like Mercedes late husband Paul Browning. Several weeks later, she decides to go to Alicante to see Jacqui and attempt to work through her pain and weeks later is joined by Nana."]}, {"page": "John Paul McQueen", "response": ["Finn is later imprisoned for raping John Paul. Carmel is killed by a train accident during the wedding of their cousin Porsche after saving their cousin Theresa from Sonny. His relationship with Ste begins to recover and they agree to get married. But he begins taking drugs and drinking. John Paul tries to support Ste through his addiction but later decides to end their relationship. The pair reconcile and they marry. Their happiness was cut short, when he discovers that not only did Ste impregnate Sinead, he also has HIV. John Paul worries that Ste has passed the virus onto him but his test comes back clear. He tries to stand by Ste but their relationship eventually ends. He begins an affair with his cousin Porsche McQueen's (Twinnie Lee Moore) husband Lockie Campbell (Nick Rhys), but is shocked to learn that he is also sleeping with Mercedes. Porsche soon discovers her husband's infidelity and she orders John Paul, Lockie and Mercedes to leave the family home. John Paul supports Mercedes when her son Gabriel is stillborn. He tries to reconcile with Ste but he reveals he has moved on with Harry Thompson (Parry Glasspool). John Paul decides to focus on his career working alongside new head teacher Sally St. Claire (Annie Wallace). He discovers that she is a transgender woman and they form a friendship. John Paul incorrectly assumes Sally has developed romantic feelings for him when she tries to spend more time with him. Myra goes to confront Sally, but is shocked to learn that she had a relationship with her before she had gender reassignment. Sally reveals that she fathered John Paul and wants to reconnect with him but Myra asks her to keep it a secret.", "John Paul along with Sally, Nathan Nightingale (Jared Garfield) and Holly, discover that his cousin Cleo McQueen (Nadine Rose Mulkerrin) is running away with Pete Buchanan (Kai Owen) who sexually abused her and her half-sister Porsche McQueen (Twinnie Lee Moore) when they were younger and psychologically abused Celine McQueen (Sarah George). They rescue Cleo from Pete and when Pete is behind him, John Paul punches him. Pete then violently assaults him. While Pete assaults him, Sally accidentally reveals to John Paul that she is his father. After the discovery, he is angry at Sally and Myra for keeping it a secret all these years. After when John Paul angrily tells Sally to leave, he disowns Myra and kicks her out. John Paul's boyfriend Scott Drinkwell (Ross Adams) admits to John Paul that he knew that Sally was his father for over a week and promised her that he'd keep it a secret from him. John Paul breaks up with Scott and sleeps with James Nightingale (Gregory Finnegan)."]}, {"page": "Sonny Valentine", "response": ["Sonny is revealed to have escaped drowning a few weeks later, and is revealed to be working with Phoebe to sabotage Theresa. Phoebe is being paid by Sonny to set up a reunion between him, Carmel and Kathleen-Angel, but Phoebe refuses last minute and reveals what has been going on to Carmel. Sonny later confronts Carmel and drags a child out of her car, believing it to be Kathleen-Angel, but he discovers a doll instead. Carmel then knocks Sonny out and rushes through the woods, just as the McQueens arrive. However, Sonny finds Carmel and kidnaps her. Whilst he holds her hostage, the pair reconcile their love and decide to make a plan to fool the McQueens and abduct Kathleen-Angel, which involves Carmel returning to her family and abducting her. When Carmel fails to do so at Porsche McQueen's (Twinnie Lee Moore) wedding reception on a party train, Sonny lashes out and verbally abuses her. Carmel leaves Sonny in the woods and returns to the wedding reception, but Sonny finds Carmel's invitation and gains entry. He attacks Phoebe with a metal bar and locks her in the toilet, before attacking Theresa and attempting to throw her off the train. However, the train derails when it crashes into Sienna Blake's (Anna Passey) car, leaving Sonny unconscious. Sonny regains consciousness and fights with Theresa, preventing her from escaping the wreckage. In the scuffle, tanks containing propane gas are opened. Carmel then enters the wreckage and saves Theresa. Sonny and Carmel fight, as flames react with the leaking gas, causing a huge explosion which instantly kills Sonny. Carmel dies shortly after from her injuries, surrounded by her family. Sonny's corpse is seen being retrieved from the wreckage by paramedics."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["Nana has three daughters to three different fathers. She was once married to a man named Reggie but the marriage ended after Nana struggled to stay faithful. Although Nana cared for Reggie she said her true love was a man named Billy Bickerstaff who worked in a local chip shop. She has also mentioned having romances with men such as Willy Trotter, Ernie Partridge and Len Murphy. She was in an abusive relationship with a man named Derek Clough (Bruce Montague), Derek abused Marlena physically for years, he broke her jaw and put her in hospital more than once. He also raped her youngest daughter Reenie (Zöe Lucker), getting her pregnant aged 15 with daughter Porsche (Twinnie Lee Moore). After Derek dies of heart attack, Reenie tells Nana that Porsche can never learn the truth about her father's identity; Nana agrees to keep the secret."]}, {"page": "Diane O'Connor", "response": ["When Diane nearly catches Sinead and Tony kissing, Sinead suggests to Tony they go away for a weekend. Tony lies to Diane and tells her he's going to a food conference and goes to a hotel with Sinead. Diane is worried when the flat alarm goes off and Tony is away and not available to fix it, and the alarm persists in annoying the whole village. Trevor suggests Diane look at Tony's credit card details to find out where he is staying and she tracks him down to a hotel. However, Tony is there and promises to come home, leaving Sinead behind. Diane shows up to question the hotel on who Tony was staying with, however the receptionist refuses to give any information other than Tony was with another woman. Tony is forced to admit that he is having an affair and Sinead says she went to the hotel to confront him about it. Diane is devastated, but forgives Tony and puts their wedding back on. On her hen night, Diane discovers Sinead is pregnant and confronts her about the father. Sinead informs her that it was her fling, Daryl (Rhys Howells) who fathered her child, so Diane invites him to her wedding to Tony. However, when Diane learns from Daryl that he and Sinead never slept together, she realises that Tony and Sinead are having an affair when she spots them looking at each other in the church. Diane publicly embarrasses them both and changes the locks on the flat and The Hutch, seeking support from Lockie Campbell (Nick Rhys). Diane refuses to forgive Sinead when Sinead tells her the affair was in revenge for Diane not believing her about baby Katy's death, but later rushes to apologise to Sinead afterwards. She finds Sinead and Tony in an embrace and so storms off and has sex with Lockie. Diane soon regrets what she has done and apologises to Lockie. After her affair, Lockie's wife Porsche McQueen (Twinnie Lee Moore) discovers that she had slept with Lockie whilst decorating Diane's room. The pair fight and Diane slips on wallpaper and falls out of the window. Diane regains consciousness in the hospital and Dr. Charles S'avage (Andrew Greenough) informs her that she has broken her ribs. Tegan Lomax (Jessica Ellis) injects her with morphine to take away the pain and she tells her that she had seen Tegan on a video informing Dee Dee that she is her real mother. During the night, the Gloved Hand Killer (who is Lindsey Butterfield) gains entry to Diane's ward and injects her with potassium chloride, the same chemical the assailant used to kill Rick Spencer (Victor Gardener) and Will Savage (James Atherton). Diane's heart monitor drops to 0 and the unknown assailant leaves the ward and leaves Diane for dead. Diane is rushed into resuscitation and soon makes a full recovery, after suffering a heart attack from the potassium chloride."]}, {"page": "List of LGBT characters in soap operas", "response": ["*Lockie Campbell, portrayed by Nick Rhys, appeared in the series between 2014 and 2016. Lockie is bisexual and despite marrying Porsche McQueen (Twinnie Lee Moore), has sex with her cousin John Paul McQueen (James Sutton)."]}, {"page": "Phoebe McQueen", "response": ["Phoebe becomes close to Robbie and they begin an on/off relationship. Porsche McQueen (Twinnie Lee Moore) and Lockie Campbell's (Nick Rhys) wedding is a disaster when the party train hits a car causing an almighty accident, which kills Carmel McQueen (Gemma Merna). While trapped in the wreckage, Phoebe phones Robbie and tells him she loves him and when she returns home Robbie greets her and they kiss and she tells him she's ready and she leads him up the stairs. A week later, Mercedes McQueen (Jennifer Metcalfe) was murdered by Freddie Roscoe (Charlie Clapham) and Phoebe attended her memorial. It is later revealed that Mercedes is, in fact, still alive, and in an attempt to frame Porsche to get Freddie released, Lindsey Butterfield (Sophie Austin) accidentally planted some of Phoebe's hair on the murder weapon. As a consequence, Phoebe is arrested and charged with Mercedes' murder. Phoebe is refused bail and is remanded in custody. She is later released, when there is little evidence to suggest that she killed Mercedes. In May 2015, Phoebe saves Porsche, Lockie and Nana McQueen (Diane Langton) from a fire at the McQueen household. She later catches Mercedes in the garage after she is smuggled back into the country by Trevor Royle (Greg Wood). After Phoebe gives Mercedes some home truths and forces the McQueens to choose between her and Mercedes, she disowns Phoebe."]}]}}