{"wiki_id": "http://www.wikidata.org/entity/Q7853600", "itemLabel": "Tuppy Owens", "itemDescription": "British sex therapist and campaigner", "wikipedia_url": "https://en.wikipedia.org/wiki/Tuppy_Owens", "wikipedia_page": {"main": "Rosalind Mary Owens (born 12 November 1944), known as Tuppy Owens, is an English sex therapist, consultant, campaigner, writer and former adult model.", "link_mentions": [{"page": "Rockbitch", "response": ["Members lent their voices to female and sexual issues, were winners of the yearly prize at the Sex Maniacs Ball (now Night of the Senses) founded by Tuppy Owens, openly voiced their admiration for sexual politics icons such as Annie Sprinkle and Betty Dodson, and generally advocated for open female sexuality as a healthy part of human nature. In an extension of the 1970s feminist statement that ‘the personal is the political’, they stated that no feminist movement was complete without female sexuality being re-examined, redefined and expressed in whatever shape it took by women themselves. They saw rock music as the perfect medium to do so, as it had been the arena for the expression of masculine sexuality for so long, whereas women's bodies were often a marketing spice to add interest to a product rather than a source of personal empowerment."]}, {"page": "Real Sex", "response": ["| || || \"The Royal Sex Maniacs' Ball\" || Tuppy Owens creates the anything goes Sex Maniacs Ball to raise funds for disabled people. It includes an early view of virtual reality sex."]}, {"page": "Erotic Review", "response": ["The relaunch edition, Edition 69, featured burlesque performer Miss Lily White on the cover and a book review by famous comedian and raconteur Barry Humphries.  Timon emphasised not only the need for a younger fresher audience without having to 'dumb down' but also vigorously supported sexual freedom campaigners such as Tuppy Owens and the Erotic Awards arguing that with the privilege of titillation came the responsibility to educate and to defend all people's right to feel erotic and engage in their sexuality, regardless of class, income, or physical ability. Timon's campaign for new editorial assistance received attention from the Financial Times Clay Harris, in the Mudlark media column for seeking staff who \"must embody pure sunshine\" Clay Harris \"Bring Me Sunshine, The Financial Times, 10 March 2006. 22 April 2012\" Over the next two years the ER readership steadily grew, while Forums stagnated, until the then publisher of Attitude magazine, Trojan, purchased the titles and took on the entire staff of Q3.  He requested to be released from his obligations under Forum magazine to concentrate on Erotic Review.", "*Tuppy Owens"]}, {"page": "List of University of Exeter people", "response": ["* Tuppy Owens - sexuality campaigner"]}, {"page": "Erich von Götha", "response": ["He studied drawing and painting for four years at St Martins art school in London and enjoyed a career in London advertising agencies as designer and copywriter. He took time off for three years to teach graphic design at Ealing School of Art. A chance meeting with the English sex therapist, consultant, campaigner, writer, and former adult model Tuppy Owens led to the \"Sex Maniac's Diary\", a remarkable and successful publication which amazingly sold mainly to women. Their publisher suggested to him creating an erotic comic \"Torrid\" which appeared irregularly during the 1980s. \"Torrid\" was little more than a hobby and he enjoyed total freedom at a time when Swinging London was in its first flush, a fact which influenced all of his stories. He ceased when he discovered the publishers were selling the strips that appeared in the first 16 issues of Torrid and were published later in the French magazines YES and Bédé Adult without his knowledge. This publisher, Lionel Roc, then took up the task of vigorously promoting his work. He became famous as an artist with the works Conte à Rebours (for YES), a sci-fi story which was rendered curiously incomprehensible by the circumstances of the translation, and Crimes et Délits (the last work succeeding Georges Lévis) for which he illustrated the section on Rasputin."]}, {"page": "Sensations (film)", "response": ["Sensations is a 1975 pornographic film written by Veronique Monet, directed by Lasse Braun, and starring the writer and Brigitte Maier. It also features an appearance by Tuppy Owens. Exhibited at the Cannes Film Festival, it became the first European pornographic film to be distributed in the United States. According to RV, “it’s done right.”", "* Tuppy Owens as Lady Pamela"]}, {"page": "Sexual Freedom Awards", "response": ["Founded in 1994 by campaigner Tuppy Owens, the awards were first called the \"Erotic Oscars\", until the name had to be changed for legal reasons. They were called the \"Erotic Awards\" from 2002 until 2013 when they become what is now known as the Sexual Freedom Awards.  The awards ceremony is an annual event in London with a semi-finals event and the finals held at the \"Sex Maniacs Ball\" but now is a fully fledged award night in its own right. The Leydig Trust organise these events which raise funds for the \"Outsiders Club\", a charity that supports disabled people to find partners."]}, {"page": "Sexuality and disability", "response": ["A survey conducted by the Disability Now magazine in 2005 found that 19% of female participants would see trained sex workers, compared with 63% of the male respondents. Tuppy Owens, sex therapist and disability professional, explained in 2013 that disabled women \"don't trust male sex workers to be honourable\"."]}, {"page": "MediaWiki talk:Spam-whitelist/Archives/2014/01", "response": ["* Tuppy Owens", "* Since this organization seems very closely related to Tuppy Owens and is an integral part of her bio, I see no harm.", ":However, the page is about Tuppy Owens, not about the the Outsiders (outsiders.org should be on that page).  Same goes for a couple of other links on that page - They are 'indirect' (see WP:ELNO).  --Dirk Beetstra T C 15:19, 11 January 2014 (UTC)", "::Oh I see. outsiders.org redirects to apps.mobilemmogames.com so that's why it was blacklisted. outsiders.org.uk is completely different. So the reason was not a user adding more than 2 domains, all residing on the same server. However, I was misled into thinking that might have been it because Tuppy Owens' page has external links to several different domains:", "::* drpetra.co.uk Website of Dr Petra Boynton, interview with Dr Tuppy Owens", "::We just have an article on Tuppy Owens, not on any of the organizations she founded, so there is really no other place to put the links. We can't put them on a dab page. The appropriate dab for Outsiders is actually Outsiders (disambiguation), where under other uses there is a link", "::* Outsiders Club, a nationwide club in Britain for single people with disabilities, founded by Tuppy Owens", "::Do we allow all these external links on the Tuppy Owens page, or expect her to put them all on her \"Official site\" at afterglowart.com – Wbm1058 (talk) 16:58, 11 January 2014 (UTC)"]}, {"page": "Outsiders Club", "response": ["#REDIRECT Tuppy Owens"]}, {"page": "Sexual Health and Disability Alliance", "response": ["#REDIRECT Tuppy Owens"]}, {"page": "List of books banned in New Zealand", "response": ["| Tuppy Owens", "| Tuppy Owens", "| Tuppy Owens"]}, {"page": "Tuppy", "response": ["* Tuppy Owens, English sex therapist"]}]}}