{"wiki_id": "http://www.wikidata.org/entity/Q7861645", "itemLabel": "Tyrone Thompson", "itemDescription": "Professional footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tyrone_Thompson", "wikipedia_page": {"main": "Tyrone I'Yungo Thompson (born 8 May 1982) is an English football coach and former professional footballer.\nAs a player he was a midfielder from 2000 to 2014. He played for Sheffield United, Lincoln City, Doncaster Rovers, Huddersfield Town, Scarborough, Halifax Town, Crawley Town, Torquay United, Mansfield Town, Grimsby Town, F.C. Halifax Town, Sheffield, Gainsborough Trinity and Goole.", "link_mentions": [{"page": "Guy Madjo", "response": ["Madjo joined Crawley Town on 28 June 2007, signing alongside Jon-Paul Pittman and Tyrone Thompson. He scored twice on his debut in Crawley's first game of the 2007–08 season, a 2–1 home win against Stevenage. The following week, Madjo scored again, this time in a 4–1 away loss at Salisbury City. In September 2007, Madjo scored in five consecutive fixtures, including a brace in a 5–3 home win against Woking. He also scored twice within the space of a week in October 2007, scoring in away fixtures against Kidderminster Harriers and Weymouth respectively. Madjo had scored 11 goals in 18 games, which prompted speculation regarding a move into the Football League. Madjo said \"It is nice to have people say good things about you but at the moment I'm not thinking about other clubs. All I think about is doing my job and doing my best for Crawley\". On 21 November 2007, four days after earning a call up to the Cameroon squad, Madjo joined League One side Cheltenham Town on a one-month loan, with a view to a permanent move. On Madjo's departure, Crawley Town manager Steve Evans said \"As a manager, I'm extremely disappointed. As a club, we always knew this day would come. He's an exceptional talent and a model professional\". Madjo made his Cheltenham debut on 25 November 2007, coming on as a 77th-minute substitute in Cheltenham's \"shock\" 1–0 home victory over Leeds United. He started his first game three weeks later, a 1–0 win against Luton Town. During his one-month loan spell, Madjo made five appearances for Cheltenham. Despite impressing Cheltenham manager Keith Downing, the club opted against buying the player on a permanent basis as a result of Downing having more funds at his disposal – \"Madjo had done nothing but impress all those at Cheltenham, but thanks to the extra money made available to Keith Downing, Cheltenham have set their requirements higher\"."]}, {"page": "List of Old Edwardians (Sheffield)", "response": ["* Tyrone Thompson (born 1981) – footballer with Torquay United"]}, {"page": "2006 Conference National play-off Final", "response": ["The second half saw more of the same with both sides having the upper hand at different stages. In the 57th minute Purdie made a run into the Halifax penalty area, and was brought down by Tyrone Thompson. This time the referee had a better view, but again did not give what seemed to be a penalty. It was not until after Halifax brought on John Grant that the deadlock was broken. After a spell of Hereford pressure, with Stansfield in particular having a couple of good chances, Killeen went on a surging run into the Hereford area before crossing to Grant who flicked the ball into the net.", "|MF ||18||Tyrone Thompson"]}, {"page": "2003–04 Huddersfield Town A.F.C. season", "response": ["|7||Tyrone Thompson||||MF||1 (1)||0||0||0||0||0||0||0||0||0||1 (1)||0"]}, {"page": "Stuart Elliott (footballer, born 1977)", "response": ["He signed for Northern Premier League Premier Division club Gateshead on 9 April 2005, making his debut a week later as a substitute in a 1–0 defeat away to Farsley Celtic. Elliott finished 2004–05 with five appearances and one goal for Gateshead before joining newly relegated Conference North club Northwich Victoria in June 2005. During a 2–1 win over Woking, Elliott scored the first goal, a victory which ensured a lucrative FA Cup tie with Premier League club Sunderland. The 2005–06 season saw him finally complete an entire season with one team, in which he made 46 appearances and scored three goals. Elliott was appointed club captain for 2006–07, after assisting the club in their instant return to the Conference National as Conference North champions. He was charged in December 2006 of using racially aggravated abusive language towards Halifax Town midfielder Tyrone Thompson in a match on 4 November, which he was later cleared of in April 2007. Following the completion of 2006–07, he was not named on the club's retained list, in which he made 32 appearances and scored two goals."]}, {"page": "Thompson (surname)", "response": ["*Tyrone Thompson (born 1982), English footballer", "*Tyrone Thompson (politician) (1967–2019), American politician"]}, {"page": "2007–08 Torquay United F.C. season", "response": ["* 20 May: Tyrone Thompson joins from Crawley Town on a two-year contract"]}, {"page": "2008–09 Torquay United F.C. season", "response": ["|align=\"left\"| Tyrone Thompson ", "|align=\"left\"|12||align=\"left\"|MF||align=\"left\"| Tyrone Thompson"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Tyrone Thompson||||2003–2004||1 (1)||0||0||0||0||0||0||0||0||0||1 (1)||0"]}, {"page": "2009 Conference Premier play-off Final", "response": ["|MF ||12 ||Tyrone Thompson || || "]}, {"page": "2009–10 Torquay United F.C. season", "response": ["|12 ||  || MF || Tyrone Thompson || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 0", "|Tyrone Thompson"]}, {"page": "2011 FA Trophy Final", "response": ["|MF ||8|| Tyrone Thompson"]}, {"page": "Curtis Thompson (footballer)", "response": ["*. Note that this has incorrect data for Thompson's career with Lincoln City. The seven appearances from 29 November 2011 – 1 January 2012 should be attributed to Tyrone Thompson."]}, {"page": "Lincolnshire derby", "response": ["! scope=\"row\" style=\"text-align:left;\"| Tyrone Thompson"]}, {"page": "Diversity in the Nevada Legislature", "response": ["| Tyrone Thompson || |Democratic || District No. 1 || 2013-2019 || - || "]}]}}