{"wiki_id": "http://www.wikidata.org/entity/Q7881262", "itemLabel": "Arthur Weasley", "itemDescription": "fictional character in the Harry Potter universe", "wikipedia_url": "https://en.wikipedia.org/wiki/Arthur_Weasley", "wikipedia_page": {"main": "The Order of the Phoenix is a secret organisation in the Harry Potter series of fiction books written by J. K. Rowling. Founded by Albus Dumbledore to fight Lord Voldemort and his followers, the Death Eaters, the Order lends its name to the fifth book of the series, Harry Potter and the Order of the Phoenix.", "link_mentions": [{"page": "Hogwarts", "response": ["According to the school caretaker, Argus Filch, detention meant subjection to various forms of corporal punishment until recently. Arthur Weasley claimed still to bear physical scars inflicted by Apollyon Pringle, Filch's predecessor. In present times, however, detention usually involves assisting staff or faculty with tedious tasks. Examples of detention include the one imposed on Harry by Umbridge in Order of the Phoenix. In this case, Harry was forced to write, \"I must not tell lies\" repeatedly using a magical quill which then carves what is written into the back of the writer's hand. However, most teachers at the school never use this cruel punishment. In another case, when Snape caught Harry using the Sectumsempra curse on Draco, he was forced to go through over a thousand boxes of files describing wrongdoers at Hogwarts and their punishments. Harry was supposed to order them in alphabetical order, and rewrite the cards whose words were hard to see or otherwise damaged. The Weasley twins Fred and George had a whole drawer of these cards."]}, {"page": "Harry Potter and the Order of the Phoenix", "response": ["One night, Harry has a vision of Voldemort's snake Nagini viciously attacking Arthur Weasley. Harry informs Professor McGonagall and Dumbledore, and Arthur is rescued. Dumbledore arranges for Professor Snape, another Order member, to teach Harry Occlumency to protect his mind against Voldemort's invasions. Umbridge is eventually tipped-off about Dumbledore's Army; to prevent Harry's expulsion, Dumbledore takes responsibility for the group, then goes into hiding. Umbridge becomes headmistress, though she is unable to access Dumbledore's old office."]}, {"page": "Death Eater", "response": ["Lucius knows the diary is cleverly enchanted, but is not aware that it is a horcrux containing a part of Voldemort's soul. He is careless with it and punished by Voldemort himself. Lucius intends to use the opening of the Chamber of Secrets by Ginny to discredit her father, Arthur Weasley, and Dumbledore. Lucius' plans are ultimately thwarted with the help of the Malfoys' house-elf Dobby, and Harry, but not before the Chamber is opened and Lucius uses the ensuing terror (and threats to attack their families) to influence the school's Board of Governors to discredit and dismiss Dumbledore as Headmaster."]}, {"page": "Red telephone box", "response": ["The red telephone box has appeared in British pop culture. In music it has featured in Adele's video \"Hello\", the front cover of One Direction's album Take Me Home, and the back cover of David Bowie's album The Rise and Fall of Ziggy Stardust and the Spiders from Mars.\"Dial T for telephone: an A-Z of phones on film\". BFI. Retrieved 21 June 2017 It was the subject of the 1980 single \"Red Frame/White Light\" by Orchestral Manoeuvres in the Dark. In film it features in a prominent scene in the 1955 black comedy The Ladykillers where a motley gang of crooks led by Professor Marcus (Alec Guinness) cram into one, and a red telephone box near Scotland Yard appears in Harry Potter and the Order of the Phoenix (2007) as Harry Potter and Arthur Weasley enter the Ministry of Magic."]}, {"page": "Order of the Phoenix (fictional organisation)", "response": ["| Arthur Weasley", "However, early in Deathly Hallows, Tonks announces that she has recently married Remus Lupin. Tonks accompanies twelve Order members to take Harry from the Dursleys' home to The Burrow. She flies with Ron, who impersonates Harry using Polyjuice Potion to throw the Death Eaters off the real Harry's trail. During the aerial battle, Tonks fights Bellatrix again and injures Bellatrix's husband, Rodolphus. Later in the book, Remus reveals Tonks is pregnant. He leaves her for a brief period, believing that he, through their marriage, has caused her to become an outcast and their unborn child would be better off without him, but changes his mind and returns to her side after a heated argument with Harry. In April of the seventh book, Tonks gives birth to Teddy Remus Lupin, named after her father and husband. Towards the end of the book, Tonks and Lupin join the Battle of Hogwarts. During the battle, Tonks is killed by Bellatrix, and Lupin is killed by Antonin Dolohov, leaving Teddy an orphan to be raised by his maternal grandmother, Andromeda. In an interview shortly after the release of Deathly Hallows, Rowling confessed that she had originally intended for Tonks and Lupin to survive the series ending, but felt that she had to kill them after she spared Arthur Weasley in Order of the Phoenix.", "===Arthur Weasley===", "Arthur Weasley is the patriarch of the Weasleys, a family of wizards who are considered \"blood traitors\" by Death Eaters for their interest in the Muggle world. He is married to Molly Weasley, with whom he has seven children, including Ron, Harry's best friend. During his time at Hogwarts, Arthur belonged to the house of Gryffindor. Arthur is described as being tall and thin, and as having a receding hairline and horn-rimmed glasses. An affable, light-hearted man, he tends not to be the authority figure in the family; his wife Molly handles that area. Arthur works for the Ministry of Magic, initially in the Misuse of Muggle Artefacts Office. He is obsessed with learning about Muggle customs and inventions and owns a large collection of mostly Muggle used items. His department lacks funding, and his salary is only just able to provide for a vast family, leaving his family finances precarious.", "Arthur Weasley appears in every film except the first and is portrayed by Mark Williams.", "Molly Weasley (née Prewett) is the wife of Arthur Weasley and the matriarch of the Weasley family. She is the mother of seven children, including Ron Weasley, who becomes Harry Potter's best friend. Molly is born into the pure-blood Prewett family, being the sister of Gideon and Fabian Prewett. The character is first introduced in Harry Potter and the Philosopher's Stone, when she kindly tells Harry how to cross the barrier through to Platform Nine and Three-Quarters. In Harry Potter and the Chamber of Secrets, she is furious with Fred, George, and Ron after she discovers that they flew their parents' enchanted car to rescue Harry from his aunt and uncle who had imprisoned him in his room. At the beginning of the school year, Molly sends Ron a Howler, screaming at him in anger that he and Harry flew the family car again, this time to Hogwarts. In Harry Potter and the Prisoner of Azkaban, the Weasleys win the Daily Prophet draw and use the gold on a trip to Egypt to visit Bill. They return to Britain and stay at The Leaky Cauldron with Harry and Hermione. Harry overhears Mr and Mrs Weasley arguing one night about telling Harry the truth about the supposed connection between Sirius Black and Harry; Arthur feels Harry should know the truth but Molly, feeling the truth would terrify him, assures him Harry will be perfectly safe at Hogwarts with Dumbledore's protection, and orders Percy Weasley to keep an eye on Harry at the school."]}, {"page": "Ministry of Magic", "response": ["Other offices include the Magical Law Enforcement Squad, which pursues day-to-day law offences; the Misuse of Muggle Artefacts Office, headed by Perkins, and the job in which the reader first sees Arthur Weasley; and the Detection and Confiscation of Counterfeit Defensive Spells and Protective Objects Office, created by Rufus Scrimgeour in Harry Potter and the Half-Blood Prince, into which Mr Weasley is promoted, to be its head.", "The following characters are notable Ministry of Magic officials. Arthur Weasley, Kingsley Shacklebolt and Nymphadora Tonks are listed under Order of the Phoenix. Yaxley is listed under Death Eaters.", "|While his allegiance is never made explicit, it is implied that he is a supporter of the Death Eaters. In a discussion with Arthur Weasley, he is revealed to have discovered the falsified genealogy for Dirk Cresswell. Harry uses some of his hair to impersonate him to enter into the Ministry to steal Slytherin's locket. In Harry Potter and the Deathly Hallows – Part 1, he is played by David O'Hara."]}, {"page": "Bromsgrove", "response": ["* Mark Williams (born 1959), actor, famous for portraying Arthur Weasley in the Harry Potter film franchise, along with the title character in the BBC's Father Brown television series based on the books by G.K. Chesterton."]}, {"page": "Harry Potter and the Chamber of Secrets (film)", "response": ["Christian Coulson appears as Tom Marvolo Riddle, a manifestation of young Lord Voldemort, before Coulson was cast Eddie Redmayne and Joseph Morgan auditioned for the role. Mark Williams portrays Arthur Weasley, Ron's father. Shirley Henderson plays Moaning Myrtle, a Hogwarts ghost. Miriam Margolyes appears as Pomona Sprout, Hogwarts' Herbology professor and head of Hufflepuff. Hugh Mitchell portrays Colin Creevey, a first year student that is a fan of Harry's. Robert Hardy appears as Cornelius Fudge, the Minister for Magic. Toby Jones voices Dobby, a House-elf, while Julian Glover voices Aragog, an acromantula.", "Production designer Stuart Craig returned for the sequel to design new elements previously not seen in the first film. He designed the Burrow based on Arthur Weasley's interest in Muggles, built vertically out of architectural salvage. Mr. Weasley's flying car was created from a 1962 Ford Anglia 105E. The Chamber of Secrets, measuring over  long and  wide, was the biggest set created for the saga. Dumbledore's office, which houses the Sorting Hat and the Sword of Gryffindor, was also built for the film."]}, {"page": "Harry Potter and the Prisoner of Azkaban (film)", "response": ["Several actors from the previous film reprise their roles in Prisoner of Azkaban. Harry Melling appears as Dudley Dursley, Harry's cousin. James and Oliver Phelps play Fred and George Weasley, Ron's twin brothers; Chris Rankin appears as Percy Weasley, Ron's other brother and a Hogwarts head boy; and Bonnie Wright portrays their sister Ginny, while Mark Williams plays their father, Arthur Weasley. Tom Felton portrays Draco Malfoy, Harry's rival in Slytherin, while Jamie Waylett and Josh Herdman appear as Crabbe and Goyle, Draco's minions. Matthew Lewis and Devon Murray play Neville Longbottom and Seamus Finnigan respectively, two Gryffindor students in Harry's year. David Bradley appears as Argus Filch, Hogwarts' caretaker, while Robert Hardy portrays Cornelius Fudge, the Minister for Magic."]}, {"page": "Harry Potter and the Goblet of Fire (film)", "response": ["Several actors from the previous film reprise their roles in Goblet of Fire. James and Oliver Phelps play Fred and George Weasley, Ron's twin brothers,  and Bonnie Wright portrays their sister Ginny, while Mark Williams plays their father, Arthur Weasley. Tom Felton portrays Lucius Malfoy's son Draco, Harry's rival in Slytherin, while Jamie Waylett and Joshua Herdman appear as Crabbe and Goyle, Draco's minions. Matthew Lewis,  Devon Murray and Alfred Enoch play Neville Longbottom, Seamus Finnigan and Dean Thomas respectively, three Gryffindor students in Harry's year. David Bradley appears as Argus Filch, Hogwarts' caretaker, and Warwick Davis returns as Professor Filius Flitwick, now using the look used when Davis portrayed the conductor of the Hogwarts Choir in the previous film. Shirley Henderson reprises her role as Moaning Myrtle, a Hogwarts ghost, and Robert Hardy returns as Cornelius Fudge, the Minister for Magic."]}, {"page": "List of Harry Potter characters", "response": ["*Arthur Weasley – Muggle-obsessed Ministry of Magic employee, and member of the Order of the Phoenix. Husband of Molly Weasley, father of Bill, Charlie, Percy, Fred, George, Ron, and Ginny Weasley.", "*Molly Weasley – Wife of Arthur Weasley and mother of Bill, Charlie, Percy, Fred, George, Ron, and Ginny. Member of the Order of the Phoenix."]}, {"page": "Places in Harry Potter", "response": ["The Weasleys' home, known as the Burrow, is located outside the village of Ottery St Catchpole which is situated alongside the River Otter in Devon, England, also near the home of the Lovegoods, the Diggorys and the Fawcetts. The Burrow was used as the Order of the Phoenix's headquarters, due to the compromised Fidelius Charm placed on 12 Grimmauld Place, in Harry Potter and the Deathly Hallows until it lost its given protection. The Weasley house has seven floors. It is also quite dilapidated, managing to remain standing only by magic. Despite the house's rundown appearance, Harry remarks on his first visit that it was the best house he had ever been in and it becomes his second favourite place in the world (after Hogwarts). The well-hidden orchard nearby doubles as a Quidditch pitch for the Weasley boys and Ginny Weasley.  A multitude of garden gnomes infests the garden of the Burrow.  There is also a small hangar located there that Arthur Weasley uses as a workshop to tinker with muggle items that he brings home (much to Mrs. Weasley's chagrin). In 1997, The Burrow became the headquarters of the Order of Phoenix after the death of the Hogwarts Headmaster, Albus Dumbledore.", "In Harry Potter and the Chamber of Secrets, the Burrow was described as a pig-sty that had extra rooms added to it. When a new child was born, Molly and Arthur Weasley just added an extra room onto the house. Outside the front door were a jumble of Wellington boots and a rusty old cauldron.", "As well as many shops, Diagon Alley also contains small stalls, which sell a wide variety of magical objects, sweets, and trinkets. In Half-Blood Prince, many witches and wizards try to take advantage of the fear created by Voldemort's return. They set up stalls selling amulets and other objects, which supposedly protect you against werewolves, Dementors and Inferi. These \"dark magic protection\" stalls, however, are illegal, and likely scams. Arthur Weasley is the one in charge of arresting their owners.", "St Mungo's Hospital for Magical Maladies and Injuries is a hospital within the Harry Potter universe. Medics at the hospital are not called doctors, but are known as Healers and wear lime-green robes. Founded by famous wizard Healer Mungo Bonham, St Mungo's is located in London. It was established to treat magical maladies, injuries or illnesses endemic to the Wizarding World. To enter the premises, one has to step through the window of what appears to be a derelict department store called Purge & Dowse Ltd. The exteriors of the hospital are red-bricked and dirty, which is the complete opposite of the interiors. Inside, everything is very neat and looks exactly as a hospital should. There are six floors. The emblem of St Mungo's is a magic wand crossed with a bone. This is the hospital where Arthur Weasley is sent after he was attacked by Voldemort's snake, Nagini, in the Ministry of Magic and Minerva McGonagall is hospitalised from severe stunning when Hagrid is forced out of Hogwarts. During one visit, Harry and company happen across Neville Longbottom, who has come with his grandmother Augusta Longbottom to visit his parents in the long-term care ward. They also find former professor Gilderoy Lockhart there, still suffering from the effects of a backfired Memory Charm."]}, {"page": "Harry Potter and the Order of the Phoenix (film)", "response": ["One night, Harry envisions Arthur Weasley being attacked at the Ministry, seeing it from the attacker's perspective. Concerned that Voldemort will exploit this connection to Harry, Dumbledore has Severus Snape teach Harry Occlumency to defend his mind from Voldemort's influence. During a lesson, Harry sees Snape's memories of how his father, James, bullied and tormented Snape in school. The connection between Harry and Voldemort further isolates Harry from his friends. Meanwhile, Bellatrix Lestrange, Sirius' deranged Death Eater cousin, escapes Azkaban prison along with nine other Death Eaters. At Hogwarts, Umbridge and her Inquisitorial Squad expose Dumbledore's Army. Dumbledore, falsely accused of forming it, escapes as Fudge orders his arrest. Harry believes Cho betrayed Dumbledore's Army to Umbridge, ending their budding relationship. Umbridge becomes the new Headmistress. ", "Locations in England included the River Thames, for the flight of the Order of the Phoenix to Number Twelve, Grimmauld Place, and the flight of Dumbledore's Army to the Ministry of Magic. This sequence also includes such landmarks as the London Eye, Canary Wharf, Big Ben, Buckingham Palace, and . Filming at Platform 9¾ took place at King's Cross Station, as it has in the past. A red telephone booth near Scotland Yard was used as Harry and Arthur Weasley enter the Ministry, while the crew closed the Westminster tube station on 22 October 2006 to allow for filming of Arthur Weasley accompanying Harry to his trial at the Ministry of Magic. Other scenes were filmed in and around Oxford, specifically at nearby Blenheim Palace in Woodstock."]}, {"page": "Magical objects in Harry Potter", "response": ["Before Voldemort's downfall, he entrusted the Horcrux to Lucius Malfoy.While aware of its corrupting magical properties, Malfoy did not know the diary was a Horcrux from Voldemort, Voldemort having informed him of its value as a weapon but believing that he would be in a position to coordinate Malfoy's use of it. In an attempt to discredit Arthur Weasley as well as dispose of an incriminating Dark object, Malfoy hid the diary in Ginny Weasley's cauldron amongst her other books. Tom Riddle's soul-fragment possessed Ginny and, through her, reopened the Chamber of Secrets, eventually starting to draw her life from her. At the end of book two, Harry saved Ginny and destroyed the diary by stabbing it with the venomous fang of a Basilisk, making it the first Horcrux to be destroyed. His reports of the diary's behavior to Dumbledore were the latter's first inkling that Voldemort might have created not just one Horcrux, but several: \"What intrigued and alarmed me most was that the diary had been intended as a weapon as much as a safeguard\",Rowling, Half-Blood Prince (Arthur A. Levine Books edition), pp.500 implying that Voldemort must have had backups of some sort. It is mentioned that Lucius was meant to wait for Voldemort's authorization before allowing the diary to be smuggled into Hogwarts, and that he never received it before Voldemort's first defeat. Voldemort did not learn of the diary's destruction until he forced the truth out of Lucius.", "===Arthur Weasley's flying Ford Anglia===", "Arthur Weasley owned a 1960 Ford Anglia 105E that he subsequently enchanted; consequently, the vehicle can fly, become invisible, and carry the entire Weasley family in spite of its formerly non-enchanted interior dimensions (also the Undetectable Extension Charm), among other abilities. The enchantment placed on the car also made it semi-sentient. In Harry Potter and the Chamber of Secrets, the car is borrowed by Fred, George and Ron, who use it to rescue Harry from the Dursleys' house. Ron and Harry later steal the car in order to return to Hogwarts after the gate to Platform 9¾ is sealed by Dobby. After they arrive at school, landing in the Whomping Willow, the car ejects Harry, Ron, and their luggage, then flees into the Forbidden Forest, ignoring Ron's pleas for it to come back. Mr Weasley soon faces an inquiry at the Ministry of Magic, as seven Muggles saw the car flying across areas of Central London and the British countryside, and is forced to pay a large fine.", "Portkeys are first introduced in Goblet of Fire by Arthur Weasley. They are an alternative to Apparation but can also be used to transport a group of people at once. Created by using the Portus spell, a Portkey can be set to transport anybody who touches it to a designated location or to become active at a predetermined time and transport itself and anyone touching to its set destination. It may be created for one-way, one-time use or to transport the holder to and from a particular place in a round trip; in addition, it may be set to activate at a particular time or automatically transport the first person who touches it. The creation of Portkeys is highly restricted and controlled by the Ministry through the Department of Magical Transport's Portkey office. Cornelius Fudge objects to Dumbledore spontaneously creating one, stating that Dumbledore hasn't got authorisation; and at one point in chapter 3, Lupin says, \"... it's more than our life's worth to set up an unauthorised Portkey.\", \"The Advance Guard\", p. 51"]}, {"page": "Harry Potter and the Half-Blood Prince (film)", "response": ["Harry discovers that his used Potions textbook is filled with helpful notes and spells added by the \"Half-Blood Prince\". Using it, Harry excels in class, annoying Hermione and impressing Slughorn, who awards him a Liquid Luck potion. Ron makes the Gryffindor Quidditch team as Keeper and begins dating Lavender Brown, upsetting Hermione. Harry consoles Hermione while acknowledging his own feelings for Ginny Weasley. Harry spends the Christmas holidays with the Weasleys. His suspicions about Draco are dismissed by the Order, but Arthur Weasley reveals that the Malfoys may be interested in a Vanishing Cabinet at Borgin & Burke's. Bellatrix and Greyback attack and destroy the Burrow."]}, {"page": "Magical creatures in Harry Potter", "response": ["Remus Lupin is the only known exception to this. There are only three known werewolves in the Harry Potter series: Lupin, Fenrir Greyback and an unnamed wizard who was in the same ward as Arthur Weasley in St Mungo's Hospital for Magical Maladies and Injuries. While Bill Weasley gets attacked by Greyback during the Battle of the Astronomy Tower in Half-Blood Prince, he is not a werewolf. Although Bill suffered a number of side-effects from the attack, including a scarred face and a new love of very rare steak, he does not become a werewolf as Greyback was in human form at the time of the bite. The condition of Lycanthropy can be hereditary, but (as seen in the case of Teddy Lupin), it is not necessarily so.", "Dobby is the Malfoy family's house-elf. He first appears in Harry Potter and the Chamber of Secrets to discourage Harry from returning to Hogwarts. Dobby later tries to keep Harry away from Hogwarts by magically sealing off the hidden entrance to Platform 9¾, only to be foiled when the protagonists pilot Arthur Weasley's flying Ford Anglia to school. During a Quidditch match, Dobby enchants a Bludger to chase Harry, hoping to cause him enough injury to be sent home; but the Bludger only manages to break Harry's arm. Dobby discloses that when an enslaved house-elf is presented with an article of clothing by his or her master, that house-elf is subsequently set free; and when Harry (after returning from the Chamber of Secrets) discovers that Dobby's master is Lucius Malfoy, he tricks Malfoy into setting Dobby free, a feat that secures him the house-elf's undying loyalty. He was now willing to save Harry Potter no matter if it would mean risking his life, because after all, \"Harry Potter set Dobby free!\"", "Voldemort is able to communicate with Nagini due to his ability to speak Parseltongue, the language of snakes. Nagini is first sighted when the snake alerts Voldemort to the presence of an eavesdropping Frank Bryce, an old gardener who had worked for the Riddle family. During the fourth year Harry spends at Hogwarts, Voldemort's temporary body is sustained by Nagini's venom, harvested by Peter Pettigrew. In Harry Potter and the Order of the Phoenix, Harry assumes Nagini's viewpoint during her attack on Arthur Weasley in one of his dreams; Albus Dumbledore believes this an effect of Harry's special connection to Voldemort, with Harry's witnessing the attack by virtue that Voldemort's mind \"happened to be\" in Nagini at the time. This is the first indication of Nagini and Voldemort's deeper connection, having the ability to share thoughts and connect with Harry."]}, {"page": "Hogwarts staff", "response": ["In Order of the Phoenix, Harry comes across Lockhart in St Mungo's while visiting Arthur Weasley at Christmas. Lockhart has not recovered any of his memories, but is childishly proud of being able to write in \"joined-up letters\". He still enjoys signing autographs and continues to receive fan mail, although he has no idea why. For his part, Harry feels a slight twinge of guilt for Lockhart's amnesia, but he consoles himself with the fact that it was Lockhart's own fault. Lockhart never fully recovers, despite all efforts to cure him, and remains in a long-term care ward of St. Mungo's."]}, {"page": "Mark Williams (actor)", "response": ["Mark Williams (born 22 August 1959) is an English actor, presenter and screenwriter. He first achieved widespread recognition as one of the central performers in the popular BBC sketch show The Fast Show. His film roles include Horace in the 1996 adaptation of 101 Dalmatians and Arthur Weasley in seven of the Harry Potter films. He made recurring appearances as Brian Williams in the BBC television series Doctor Who and as Olaf Petersen in Red Dwarf. Since 2013, Williams has portrayed the title character in the long-running BBC series loosely based on the Father Brown short stories by G. K. Chesterton.", "His most famous cinema role is as Arthur Weasley in the Harry Potter film series, which began in 2002. Other high-profile appearances include the film adaptation of Neil Gaiman's Stardust alongside Michelle Pfeiffer, Robert De Niro and Claire Danes in 2007 and a 2012 role in Doctor Who as Brian Williams, father of the Doctor's companion, Rory.", "| Arthur Weasley", "|rowspan=2| Arthur Weasley", "|rowspan=3| Arthur Weasley", "| Arthur Weasley", "| Arthur Weasley (voice)", "| Arthur Weasley", "* Lego Dimensions - Arthur Weasley "]}, {"page": "Hideyuki Umezu", "response": ["* Harry Potter movies – Arthur Weasley (Mark Williams)"]}, {"page": "Fictional universe of Harry Potter", "response": ["However, a large number of technologically complex devices do exist, and most of these devices exist in the Muggle world. From a certain perspective, it can be seen that Magic and electricity are the equivalents of each other in their respective worlds, but electronic equipment doesn't work around magic-filled areas, such as Hogwarts, and Muggle devices used by wizards (such as cameras and radios) can be made to function using magic instead of electricity. Such examples are rare, however; wizards rarely make use of Muggle technology, nor do they have much interest in doing so, even when such technology might make their lives much easier. Pure-blood Wizards are baffled by how Muggle technology works and most have no interest in understanding it (with occasional exceptions, such as Muggle aficionado Arthur Weasley, whose dearest ambition is \"to find out how an aeroplane stays up\"). \"Muggle Studies\" classes are offered at Hogwarts for those students with an interest. On several occasions, Harry Potter is tasked with having to explain the workings of commonplace Muggle technology, such as introducing the telephone to Mr Weasley in Chamber of Secrets; at the beginning of Prisoner of Azkaban, Ron Weasley makes his first telephone call – with disastrous results for Harry.", "The Muggles remain, for the most part, oblivious to the wizarding world. This situation is considered preferable to the alternative by wizards; official coexistence, conflict, or wizard supremacy (advocated by some pure-blood supremacists). Most things of magical nature are hidden or otherwise obscured from Muggles; others, such as Dementors, are invisible to them, although they experience the same depression and sense of manifest darkness and despair while near a Dementor. It is commented that Muggles generally dismiss anything they cannot explain.  Likewise, too many magical people, many functional aspects of the Muggle world are rarely glimpsed and mysterious. Wizards and witches' attempts to disguise themselves as Muggles, as when they have to venture out onto \"normal\" streets, often have humorous results. When magic is seen in the muggle world, the Ministry of Magic is often tasked with clean-up. The mispronunciation of common Muggle terms like \"telephone\", \"escalator\", \"plumber\", \"firearms\" or \"policeman\", as \"fellytone\", \"escapator\", \"pumble\", \"firelegs\", and \"please-men\", respectively, is a running gag in the series. Arthur Weasley is known for being fascinated with the muggle world and has a vast collection of muggle objects.", "A Patronus is primarily used to repel Dementors. They can also be used for communication by accomplished witches and wizards.  Albus Dumbledore devised a method of using Patronuses to deliver vocal messages, putting this to the exclusive use of the Order of the Phoenix. Dumbledore, Minerva McGonagall, Kingsley Shacklebolt, and Arthur Weasley all deliver messages via Patronus in the course of the series. McGonagall is also the only character in the series to have shown the ability to project multiple Patronuses to send multiple messages.Rowling, J.K. Harry Potter and the Deathly Hallows (New York: Scholastic Press), 2007. Page 596. Patronuses are also the only known way of repelling Lethifolds.", "Apart from the fake Galleons enchanted by Hermione for Dumbledore's Army, there are a few other methods of closed-channel communications used in the books and films. Subjects painted into wizarding portraits are frequently used to carry messages between locations where their portraits hang. Phineas Nigellus (former Hogwarts headmaster and member of the Black Family) is used to send messages between Dumbledore's office and his other portrait in Grimmauld Place. Hermione takes Phineas from Grimmauld Place during Harry Potter and the Deathly Hallows and uses Phineas to obtain information about events at Hogwarts. Dumbledore also uses two other former headmasters in a similar fashion when Arthur Weasley is attacked by Nagini in the Ministry of Magic. A portrait is also seen carrying messages between the Minister for Magic and the Muggle Prime Minister in the opening of Harry Potter and the Half-Blood Prince.", "Flying paper aeroplanes (referred to as \"interdepartmental memos\") are used within the Ministry of Magic. In Harry Potter and the Order of the Phoenix when Arthur Weasley takes Harry to the Ministry of Magic, Mr. Weasley explains that these took the place of the owls to minimise the mess. They are pale violet with MINISTRY OF MAGIC stamped along the edges of the wings. A variation on this method of communication is shown in the film version of Harry Potter and the Prizoner of Azkaban, when Draco Malfoy sends Harry a note in class in the form of a flying paper crane.", "Characters in the series make use of several magical devices and artefacts to transport themselves within the Wizarding World and to the Muggle world. Among the most common of these objects are broomsticks, the Floo Network (a network of fireplaces magically connected to one another), the Knight Bus, and the Hogwarts Express. Some characters have been known to enchant Muggle vehicles to have magical features, such as Arthur Weasley's Ford Anglia or Sirius Black's Flying Motorbike. In Harry Potter and the Goblet of Fire, a discussion is held around the politics of importing flying carpets."]}, {"page": "David Brett", "response": ["Brett is the first of two actors from the Mikron Theatre Company to appear in a Harry Potter film, the other being Mark Williams who appears as Arthur Weasley."]}, {"page": "List of supporting Harry Potter characters", "response": ["In Harry Potter and the Philosopher's Stone, Dudley is given a pig's tail by Rubeus Hagrid which has to be removed at a private hospital in London. In Goblet of Fire, the Smeltings school nurse advises the Dursleys to put him on a strict diet. During the summer when this diet is enforced, the Weasleys arrive at Number 4, Privet Drive to pick Harry up for the Quidditch World Cup, and Fred Weasley \"accidentally\" drops a Ton-Tongue Toffee, which enlarges Dudley's tongue to four feet long before his hysterical mother reluctantly allows Arthur Weasley to shrink it. By the start of Order of the Phoenix, Dudley has been on his diet for a year, taken up boxing, and become a regional inter-school champion.", "In Order of the Phoenix, Neville discloses that his grandmother fully supports Harry and Dumbledore's proclamations that Voldemort had returned, even going so far as to cancel her subscription to the Daily Prophet, because they keep toeing the Ministry of Magic line that Harry was lying. Later, Harry and his friends are visiting Arthur Weasley in St Mungo's Hospital for Magical Maladies and Injuries and meet Augusta and Neville who are visiting Frank and Alice (Neville's parents); Augusta explains to Harry's friends how Neville's parents got into that state. She reprimands Neville for failing to have already told his friends what happened to his parents, saying he should be \"proud\" to be their son for their bravery."]}, {"page": "Lego Harry Potter", "response": ["Arthur Weasley, Molly Weasley, Ginny Weasley, Harry Potter, Fenrir Greyback, Bellatrix Lestrange, Errol", "Harry Potter, Ron Weasley, Ginny Weasley, Molly Weasley, Arthur Weasley, Nymphadora Tonks, Bellatrix Lestrange and Fenrir Greyback"]}, {"page": "Arthur", "response": ["*Arthur Weasley, a character of the Harry Potter book series"]}, {"page": "Harry Potter (film series)", "response": ["Aside from the three lead actors, other notable cast members include Robbie Coltrane as Rubeus Hagrid, Tom Felton as Draco Malfoy, Alan Rickman as Severus Snape, and Dame Maggie Smith as Minerva McGonagall. Richard Harris, who played the role of Professor Albus Dumbledore, died on 25 October 2002 causing the role to be re-cast for the third instalment, Harry Potter and the Prisoner of Azkaban. David Heyman and director Alfonso Cuarón chose Michael Gambon to portray the character of Dumbledore, which he did for all succeeding films. Notable recurring cast members include Helena Bonham Carter as Bellatrix Lestrange, Warwick Davis as Filius Flitwick, Ralph Fiennes as Lord Voldemort, Brendan Gleeson as Alastor Moody, Richard Griffiths as Vernon Dursley, Jason Isaacs as Lucius Malfoy, Gary Oldman as Sirius Black, Fiona Shaw as Petunia Dursley, Timothy Spall as Peter Pettigrew, David Thewlis as Remus Lupin, Emma Thompson as Sybill Trelawney, Mark Williams as Arthur Weasley, and Julie Walters as Molly Weasley."]}, {"page": "Hopkins Architects", "response": ["On 22 October 2006 the practice's Westminster Underground Station was closed for the day to allow filming for Harry Potter and the Order of the Phoenix to take place for a scene where Harry takes the tube with Arthur Weasley to go to a disciplinary hearing at the Ministry of Magic.BBC News: Harry Potter rides on London Tube 22 October 2006"]}, {"page": "Harry Potter and the Deathly Hallows – Part 1", "response": ["* Mark Williams as Arthur Weasley: Ron Weasley's father, an Auror at the Ministry of Magic."]}]}}