{"wiki_id": "http://www.wikidata.org/entity/Q7884832", "itemLabel": "Ernest Eldridge", "itemDescription": "British driver who broke the world land speed record in 1924", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Eldridge", "wikipedia_page": {"main": "Ernest Arthur Douglas Eldridge (18 July 1897 – 27 October 1937) was a British racing car driver who broke the world land speed record in 1924. His was the last land speed record set on an open road.", "link_mentions": [{"page": "July 18", "response": ["*1897 – Ernest Eldridge, English race car driver and engineer (d. 1935)"]}, {"page": "October 27", "response": ["*1935 – Ernest Eldridge, English race car driver (b. 1897)"]}, {"page": "Brooklands", "response": ["*Ernest Eldridge (racing driver)"]}, {"page": "Land speed record", "response": ["|July 12, 1924|| Arpajon, France|| Ernest Eldridge||FIAT Mephistopheles||Internal combustion: inline-6 FIAT A.12 aero engine"]}, {"page": "Eldridge", "response": ["* Ernest Eldridge (1897–1937), British world land speed record holder"]}, {"page": "List of Old Harrovians", "response": ["*Ernest Eldridge (1897–1937), British racing car driver"]}, {"page": "E. A. D. Eldridge", "response": ["#REDIRECT Ernest Eldridge "]}, {"page": "1925 Grand Prix season", "response": ["|  Ernest Eldridge", "There were also several specials entered in Grand Prix. Albert Guyot had been a regular driver for Rolland-Pilain who had also raced at the Indianapolis race since before the war. He took three of the Rolland-Pilain cars, adding a Cozette supercharger to a new Burt-McCollum sleeve-valve engine. English driver Ernest Eldridge took an Amilcar GS and fitted a 1.5-litre supercharged Anzani side-valve engine that got up to 185 km/h.", "The Grand Prix d’Ouverture heralded the official opening for racing at the completed Autodrome de Linas-Montlhéry outside of Paris. Held on the oval circuit, it was restricted to voiturettes up to 1.5-litres with 150000 francs in prizes. A big field was therefore expected but this waned when the works teams from Bugatti and Chiribiri withdrew. This left the Talbot team as the overwhelming favourites, with Henry Segrave, George Duller and Conte Caberto Conelli. They were joined by racing specials from J. G. Parry-Thomas and Ernest Eldridge. Against them were teams from some of the many small French manufacturers springing up: La Perle, Bucciali, Jean Gras and Salmson. A pedestrian race ended in rain with the expected 1-2-3 result for the Talbots led by Duller, 20 laps ahead of Eldridge. Conelli had been racing hard to catch Duller and as the latter eased off to take the flag Conelli clipped his car, rolled and skated past the line– perhaps the only driver to get a podium after finishing a race upside down. Georgano 1971, p.196", "The Organisers also had a separate trophy for 1.5-litre Voiturette cars. The Bugatti works team entered its new 1.5-litre Type 37 and supercharged Type 39, in anticipation of the change in GP formula coming up in 1926. Their competition was from two Chiribiris and Ernest Eldridge’s special.  After the accident at Montlhéry, the Lesmo corners were modified putting a 60cm strip of sand to even out the inside of the bends. A banked wall was also put on the final, fastest, corner of the oval."]}, {"page": "1926 Grand Prix season", "response": ["|  Ernest Eldridge", "The opening race of the championship was the Indianapolis 500. Defending champions, Duesenberg had five cars entered. Last year's winner Peter DePaolo ran its new supercharged 1.5-litre model along with Ralph Mulford and Bob McDonogh while rookie Ben Jones had a 2-stroke special. Their biggest rivals, once again, was from Harry Miller and his own new supercharged 91 cubic inch car. After a strong run in 1925, Miller persisted with his front-wheel drive model for Dave Lewis and Earl Cooper. Bennett Hill raced a regular 122 as a third works car. The regular customer team run by Harry Hartz had three cars for Hartz, Fred Comer and Tony Gulotta while another dozen drivers also ran their own Millers. This year, Cliff Durant's Junior-8 team ran three Fengler cars with Locomobile engines for himself, Leon Duray and Harlan Fengler. Englishman Ernest Eldridge also arrived with two of his home-made specials raced by himself and Douglas Hawkes.", "The next round, three weeks later, was the San Sebastián Grand Prix. Another promising entry list of 21 was once again stymied by non-appearances, this time also including OM, Jean Gras and the privateers Albert Guyot and Ernest Eldridge. Delage did arrive with their new cars and team drivers Robert Benoist, Edmond Bourlier and André Morel, with Louis Wagner as a reserve. The Bugatti team had three cars, with Ferdinando Minoia back for De Vizcaya. During practice in the hot Spanish sun,  the Delage drivers soon found the exhaust and engine heat unbearably hot. The mechanics drilled holes in the engine covers, but it proved unsuccessful. On a sweltering 44 °C race-day, all three drivers were overcome by the heat and had to pit. Benoist had led the first six laps until he had to stop to change spark plus, as Minoia had a lap earlier. Morel took over the lead and pitted to refuel on lap 10. Overcome by heat exhaustion he was taken to hospital, while Wagner took over his car, but he only lasted five laps. Benoist pitted on lap 12, also totally exhausted. Sometime-Bugatti driver, Robert Sénéchal was in the crowd at the race and offered his assistance to Louis Delâge. Gratefully accepted, he took over Benoist's car, rejoining two laps down having never driven a Delage before. Bourlier, meanwhile, had been duelling with Goux for the lead, until he too pitted – his legs badly burned. Sénéchal had soon pitted to rest after only a few laps, so took Bourlier's car out next. While the Delages were faster, the stops to relieve the drivers lost them that time. Meanwhile, the Bugattis kept running. Although Sénéchal was able to pass Costantini when the latter stopped to change tyres, he could not catch Goux, who took his second victory of the season.Cimarosti 1997, p.75 After the race the Delages were disqualified for using an unregistered driver, however this was overturned by the AIACR three months later as Ettore Bugatti had agreed to it during the race."]}, {"page": "Ernest A. D. Eldridge", "response": ["#REDIRECT Ernest Eldridge"]}, {"page": "E A D Eldridge", "response": ["#REDIRECT Ernest Eldridge "]}, {"page": "E.A.D. Eldridge", "response": ["#REDIRECT Ernest Eldridge "]}, {"page": "EAD Eldridge", "response": ["#REDIRECT Ernest Eldridge "]}, {"page": "Ernest Eldridge and the Fiat Mefistofele", "response": ["#REDIRECT Ernest Eldridge"]}, {"page": "Magic Midget", "response": ["In 1929, MG were attempting to develop their M-type Midget for racing. The rear axle leaf springs were mounted in sliding trunnions at the rear end, rather than the more usual shackles. The improved axle location encouraged good handling, which compensated when racing for the 750cc engine's low power output. Captain George Eyston and Ernest Eldridge saw this chassis under development and decided that it could form the basis for a speed record breaker. Fitted with larger brakes from a Mark II, a four speed gearbox and streamlined bodywork, it became the EX120. On 30 December 1930 at Montlhéry, EX120 set its first records, beating the Austin Sevens."]}, {"page": "1925 Italian Grand Prix", "response": ["|  Ernest Eldridge"]}, {"page": "1925 French Grand Prix", "response": ["|  Ernest Eldridge"]}, {"page": "Electric motorsport", "response": ["|July 12, 1924||France|| Ernest Eldridge||FIAT Mephistopheles||Internal combustion||n/a||n/a||145.89||234.98"]}]}}