{"wiki_id": "http://www.wikidata.org/entity/Q7911244", "itemLabel": "Valerie Bloom", "itemDescription": "Jamaican writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Valerie_Bloom", "wikipedia_page": {"main": "Valerie Bloom MBE (born 1956) is a Jamaican-born poet and a novelist based in the UK.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Valerie Bloom (born 1956, J/E)"]}, {"page": "Stephanie Bolster", "response": ["*Global Poetry Anthology, edited by Valerie Bloom, Stephanie Bolster, Frank M. Chipasula, Fred D'Aguiar, Michael Harris, John Kinsella, Sinéad Morrissey, Odia Ofeimun, Eric Ormsby, and Anand Thakore. Montreal: Signal Editions/Véhicule Press, 2012."]}, {"page": "Nestlé Smarties Book Prize", "response": ["::* 0–5 years: Fruits by Valerie Bloom, illus. David Axtell (Macmillan)"]}, {"page": "Children's poetry", "response": ["*Valerie Bloom  (b.1956) is a Jamaican-born poet and a novelist based in the UK."]}, {"page": "2004 in poetry", "response": ["** Overheard on a Saltmarsh: Poets' Favourite Poems (editor) (30 contemporary poets selected their favourite children's poem to appear alongside one of their own poems; including contemporary poems by Sophie Hannah, Jackie Kay, Valerie Bloom, and Wendy Cope, as well as classic poets such as Robert Burns, John Betjeman and Edward Lear) Macmillan"]}, {"page": "List of University of Kent people", "response": ["*Valerie Bloom - poet"]}, {"page": "Fruits (book)", "response": ["Fruits: A Caribbean Counting Poem () is a children's picture book written by Valerie Bloom and illustrated by David Axtell. In 1997 it won the Nestlé Smarties Book Prize Bronze Award.Nestlé Children's Book Prize "]}, {"page": "2008 New Year Honours", "response": ["*Valerie Bloom. For services to Poetry."]}, {"page": "List of Jamaican British people", "response": ["* Valerie Bloom (born 1956), author and poet"]}, {"page": "Johny Pitts", "response": ["Pitts has written for Blues & Soul magazine, Straight No Chaser and The Observer, and won the Decibel Penguin Prize for new writers, with his short story \"Audience\" appearing in the anthology The Map of Me published by Penguin Books. He studied poetry under Debjani Chatterjee and has performed solo and alongside renowned poets John Agard and Valerie Bloom at venues such as the Albany Theatre, the Jazz Café, the Big Chill Festival, Notting Hill Arts Club and the Soho Theatre."]}, {"page": "Anand Thakore", "response": ["Anand Thakore was judge and a co-editor for the first Montreal International Poetry Prize (2011) with Valerie Bloom, Fred D'Aguiar, John Kinsella and Stephanie Bolster, amongst others.Editorial board of Montreal International Poetry Prize 2011"]}, {"page": "Lauretta Ngcobo", "response": ["In addition Ngcobo was the editor of Let It be Told: Essays by Black Women Writers in Britain (Pluto Press, 1987), which included contributions from Amryl Johnson, Maud Sulter, Agnes Sam, Valerie Bloom, Grace Nichols, Marsha Prescod, Beverley Bryan, Stella Dadzie and Suzanne Scafe.\"Let It Be Told: Essays by Black Women in Britain\", Goodreads. Ngcobo also wrote a children's book, Fikile Learns to Like Other People (1994), and in 2012 edited an anthology of stories of South African women in exile, entitled Prodigal Daughters, which was chosen as a Book of the Year by Neelika Jayawardane of Africa is a Country.Tom Devriendt, \"Our Favorite Books of 2012\", Africa is a Country, 31 December 2012."]}, {"page": "Daughters of Africa", "response": ["* Valerie Bloom"]}, {"page": "Bogle-L'Ouverture Publications", "response": ["Among other notable titles on the BLP list are Linton Kwesi Johnson's Dread Beat and Blood, Beryl Gilroy's Black Teacher, several books by Andrew Salkey (a director and long-time supporter of BLP),\"Bogle-L’Ouverture: A story in Black publishing\", Guyana Chronicle, 8 January 2012. (Extract from an interview with Rickford Benjamin-Huntley, Georgetown, Guyana, December 2011.) Journey to an Illusion: The West Indian in Britain by Donald Hinds, and poetry collections by Valerie Bloom, Sam Greenlee, Lemn Sissay,Lemn Sissay has said: \"Holding that first book in my young hands – I was 21 – was one of the most life affirming experiences of my existence to date. It was a gift bestowed by two incredible people, Jessica and Eric Huntley, at a small important publishing house in Ealing West London called Bogle-L'Ouverture.\" \"Meet the 2014 Authors – Lemn Sissay\", Emirates Airline Festival of Literature, 9 February 2014. Lucinda Roy, Imruh Bakari and John Lyons.\"Selected Bogle-L'Ouverture Publications\", in Andrews (2014), pp. 179–181. "]}, {"page": "International Book Fair of Radical Black and Third World Books", "response": ["Those who attended the Book Fair came from the Caribbean, Africa, Asia, Central America, the US, as well as the UK and other parts of Europe, not only to exhibit, order and distribute books but to take part in the accompanying programme of events that, alongside political discussion, showcased different cultural presentations including poetry and prose readings, drama, music and film. The many notable participants over the years included John Agard, Ama Ata Aidoo, Tariq Ali, May Ayim, Imruh Bakari, Biyi Bandele, Amiri Baraka, James Berry, Valerie Bloom, Jean Binta Breeze, Yvonne Brewster, Dennis Brutus, Robert Chrisman, Merle Collins, Carolyn Cooper, Fred D'Aguiar, Melvin Edwards, Nuruddin Farah, Edouard Glissant, Lorna Goodison, Roy A. K. Heath, Tim Hector, bell hooks, Gus John, Linton Kwesi Johnson, June Jordan, Jackie Kay, Shake Keane, James Kelman, Talib Kibwe, Errol Lloyd, Earl Lovelace, Jack Mapanje, E. A. Markham, Paule Marshall, Pauline Melville, Louise Meriwether, Adrian Mitchell, Nancy Morejon, Lionel Ngakane, Pitika Ntuli, Odia Ofeimun, Olu Oguibe, Ben Okri, Kole Omotoso, Oku Onuora, Horace Ové, Alex Pascall, Okot p'Bitek, Caryl Phillips, John Pilger, Cecil Rajendra, Sonia Sanchez, Lawrence Scott, Mongane Wally Serote, Janice Shinebourne, Lemn Sissay, Mikey Smith, Pearl Springer, Wangui wa Goro, and Randy Weston.White, Harris & Beezmohun (eds), A Meeting of the Continents: The International Book Fair of Radical Black and Third World Books – Revisited, 2005."]}, {"page": "The Children's Bookshow", "response": ["Established in 2003, The Children's Bookshow is directed by Siân Williams, and includes theatre performances by children's writers, workshops in schools, and competitions. The 2016 Children's Bookshow consisted of sixteen separate events, with authors from the UK and overseas, including Michael Rosen, Valerie Bloom and Fabio Geda.http://www.thechildrensbookshow.com/dates.html"]}, {"page": "Jessica Huntley", "response": ["In 1969 Huntley co-founded, with her husband Eric Huntley, the London-based publishing company Bogle-L'Ouverture Publications (BLP), which was named in honour of two heroes of the Caribbean resistance, Toussaint L'Ouverture and Paul Bogle. Beginning with The Groundings With My Brothers, by Guyanese historian and scholar Walter Rodney,Petamber Persaud, \"Preserving Our Literary Heritage\", Guyana Chronicle, 2 August 2014.\"Bogle-L'Ouverture\", George Padmore Institute. BLP went on to publish books by an expanding range of authors, including Andrew Salkey, Linton Kwesi Johnson, Lemn Sissay and Valerie Bloom."]}, {"page": "List of black British writers", "response": ["* Valerie Bloom (born 1956)"]}]}}