{"wiki_id": "http://www.wikidata.org/entity/Q7917313", "itemLabel": "Vaughan Roberts", "itemDescription": "British Evangelical writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Vaughan_Roberts", "wikipedia_page": {"main": "Vaughan Edward Roberts (born 17 March 1965) is a Church of England clergyman. Since 1998, he has been the rector of St Ebbe's, Oxford. In 2009, he became Director of the Proclamation Trust.", "link_mentions": [{"page": "Wycliffe Hall, Oxford", "response": ["* Vaughan Roberts (1989–1991) – Rector of St Ebbe's Church, Oxford and President of the Proclamation Trust "]}, {"page": "Biblical theology", "response": ["The work of Gregory Beale, Kevin Vanhoozer, Geerhardus Vos (Biblical Theology: Old and New Testaments), Herman Nicolaas Ridderbos (The Coming of the Kingdom), Meredith Kline (Kingdom Prologue),  Graeme Goldsworthy (According to Plan, Gospel and Kingdom), Vaughan Roberts (God's Big Picture), James Hamilton (God's Glory in Salvation through Judgment), and Peter Gentry and Stephen Wellum (Kingdom through Covenant: A Biblical-Theological Understanding of the Covenants) have helped popularize this approach to the Bible.Gaffin, Richard B. J. \"Introduction\". In Redemptive history and biblical interpretation: The shorter writings of Geerhardus Vos. Edited by Gaffin, Richard B. J. Presbyterian and Reformed Pub. Co, 1980, p. xiii. Especially important for bringing this field of study into the confessional tradition was Old Princeton theologian, Geerhardus Vos (Biblical Theology: Old and New Testaments). They summarize the message of the Bible as being about \"God's people in God's place under God's rule and blessing\" (in Graeme Goldsworthy, Gospel and Kingdom, Paternoster, 1981)."]}, {"page": "Diocese of Oxford", "response": ["* Rector: Vaughan Roberts"]}, {"page": "Cambridge Inter-Collegiate Christian Union", "response": ["CICCU is led by Christian students from a wide variety of backgrounds, united in a common desire to \"make Jesus Christ known to students in Cambridge.\" Past CICCU members have included Josh Moody, Basil Atkinson, Helen Roseveare, John W. Wenham, John Stott and Vaughan Roberts. The leadership operates on two levels – university wide and within colleges. A committee of eight students, known as the Exec organise CICCU. Two reps in each college lead college events and meetings."]}, {"page": "Keswick Convention", "response": ["| align=\"center\"|2003||From Base Camp To Summit||Joseph Stowell||Charles Price||Vaughan Roberts", "| align=\"center\"|2006||The Church in the Power of the Spirit||Chris Wright||Ajith Fernando||Vaughan Roberts", "| align=\"center\"|2009||Faith that Works||Dale Ralph Davies||Jonathan Lamb||Vaughan Roberts", "| align=\"center\"|2014||Really?  Searching for reality in a confusing world||Vaughan Roberts||Jonathan Lamb||Chris Sinkinson", "| align=\"center\"|2019||Longing  ...||John Risbridger||Vaughan Roberts||Ray Ortlund"]}, {"page": "Word Alive", "response": ["| align=\"center\"|2009|| align=\"center\" |30/3 – 4/4 (Wk1)4/4 – 9/4 (Wk2)||Vaughan Roberts (Wk1), Liam Goligher (Wk2);Don Carson, Terry Virgo, Krish Kandiah||Stuart Townend, Phatfish, Lou Fellingham (Wk1); Keith & Kristyn Getty (Wk2)", "| align=\"center\"|2016|| align=\"center\" |2/4 - 7/4||Vaughan Roberts||Devon Kauflin, Christ Church Mayfair (led by Ben Slee)"]}, {"page": "St Ebbe's Church, Oxford", "response": ["St Ebbe's is a Church of England parish church in central Oxford. The church is within the conservative evangelical tradition and participates in the Anglican Reform movement. It has members from many nations, many of whom are students at Oxford University. The rector is Vaughan Roberts who is also an author and conference speaker.", "* 1998–present: Vaughan Roberts", "* 1991-1998: Vaughan Roberts, later Rector"]}, {"page": "The Good Book Company", "response": ["TGBC publishes works by a number of prominent evangelical leaders in the UK, the USA and Australia, including Tim Keller (pastor), Albert Mohler, Alistair Begg, Matt Chandler (pastor), Vaughan Roberts,  John Lennox and Phillip Jensen."]}, {"page": "Peter Adam (minister)", "response": ["Adam is the vice president of the Australian Fellowship of Evangelical Students. He has written a number of books, including Speaking God's Words: A Practical Theology of Preaching (), which is used as a text in many seminaries. In 2011, a Festschrift was published in his honour - Serving God's Words: Windows on preaching and ministry (), which included contributions from Don Carson, Gerald Bray, Peter Jensen, Vaughan Roberts, David Jackman and Michael Raiter."]}, {"page": "Template talk:Crockford", "response": ["*Vaughan Roberts "]}, {"page": "Vaughan (given name)", "response": ["* Vaughan Roberts (born 1965), English Anglican priest"]}, {"page": "Nashville Statement", "response": ["* Vaughan Roberts, Rector of St Ebbe's Church, Oxford, and Director of the Proclamation Trust"]}]}}