{"wiki_id": "http://www.wikidata.org/entity/Q7910695", "itemLabel": "Valene Kane", "itemDescription": "Northern Irish actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Valene_Kane", "wikipedia_page": {"main": "Valene Kane is a Northern Irish actress. She is perhaps best known for her performances in all three series of BBC Two's BAFTA-nominated The Fall, in which she played Jamie Dornan's first lover, Rose Stagg.", "link_mentions": [{"page": "List of Irish people", "response": ["* Valene Kane – actress, The Fading Light"]}, {"page": "List of Star Wars characters", "response": ["| Valene Kane (Rogue One)"]}, {"page": "Newry", "response": ["*Valene Kane, actress"]}, {"page": "Sacred Heart Grammar School", "response": ["* Valene Kane, actress (The Fall, Rogue One)"]}, {"page": "List of Star Wars cast members", "response": ["| Valene Kane"]}, {"page": "20 Cigarettes (play)", "response": ["* Valene Kane"]}, {"page": "London Film and Comic Con", "response": ["| 28–30 July 2017|| Olympia|| Benedict Cumberbatch, Natalie Dormer, Kevin Smith, Mads Mikkelsen, Pamela Anderson, Nicola Bryant, Sylvester McCoy, Richard Franklin, Matthew Waterhouse, Tom Wilson, Richard Dean Anderson, Wil Wheaton, Terence Stamp, David Labrava, Kenny Johnson, Emily Kinney, Adam Copeland, Alan Tudyk, Alexis Denisof, Alicia Witt, Alistair Petrie, Anthony Forrest, Andy de la Tour, Andrew Gray, Andrew Robinson, Alyson Hannigan, Benedict Wong, Bernard Cribbins, Carol Cleveland, Chris Durand, Christopher Judge, Christopher Lloyd, Christien Anholt, Colin Hunt, Conleth Hill, Daniel Portman, Danielle Tabor, David Bradley, David Labrava, David Morrissey, Dave Prowse, Deep Roy, Dean Cain, Dickey Beer, Emily Kinney, Finn Jones, Gemma Whelan, Ian McDiarmid, James Dodd, James & Oliver Phelps, Jeremy Bulloch, Jessica Henwick, Jimmy Vee, Joe Dinicol, John Carroll Lynch, John Cleese, John Leeson, Julian Glover, Kevin Kleinberg, Kristen Renton, Kristian Nairn, Lalla Ward, Louise Jameson, Mark Austin, Mark Boone Jr, Mark Strickson, Mark Sheppard, Martin Gordon, Michael Copon, Michelle Harrison, Michael Rosenbaum, Michael Madsen, Missi Pyle, Phil LaMarr, Peter Mayhew, Pilou Asbaek, Richard Cunningham, Robbi Morgan, Sacha Dhawan, Sarah Douglas, Selwyn Ward, Sean Biggerstaff, Steven Yeung, Lisa Varon, Tom Morga, Tom Skerritt, Tommy Flanagan, Tricia Helfer, Valene Kane, Veronica Cartwright, Wai Ching Hoo, Warwick Diamond, William Regal, Zoe Wanamaker, Marv Wolfman", "| 19-21 November 2021. Returns after a 2-year hiatus due to the Covid-19 Pandemic || Olympia || Christopher Eccleston, George Takei,  Robert Englund, Karen Allen, Mark Pellegrino, Ming-Na Wen, Brian Blessed, Julian Kostov, Julius LeFlore, Valene Kane, Beau Gadsdon, Dolly Gadsdon, Daniel Naprous, Mark Rolston, Jemma Redgrave, Jo Martin, Amanda Abbington, Sean Biggerstaff, Andrew Robinson, Rose Reynolds, Hannah Murray, Nick Frost, Ben Browder, Natalia Tena, Tom Skerrit, Riz Ahmed, Sacha Dhawan, Georgia Hirst, Kim Coates, Ray Hassett, Bernard Cribbins, Elizabeth Mitchell, Simon Palsey-Day, Jason O'Mara, Guy Henry, Simon McBurney, Ahsley Walters, Veronica Cartwright, John Wesley Shipp, Jessie T. Usher, Janet Fielding, Suzanne Bertish, Angus Wright, Milton Johns, Andrew Gower, Liam Garrigan, Anji Mohindra, Mark Boone Jr., Quentin Piere, Harry Manfredi, Lee Cornes, Clare Kramer, David Learner, Danielle Nicolet, Joe Gibson, Mat Fraser, Julian Holloway, Sam Humphrey, Mandeep Dhillon, Matthew Devitt, Emmy Raver-Lampman, Steven R. McQueen, Barry Bostwick, Ronn Millkie, Anna-Louise Plowman, Staz Nair, Marc Blucas, PJ Black, Cinta de Oro, Jack McKenzie, Syd Wragg, Richard Brake, Jim Dowdall, Robert Patrick, Emily Kinney, Nick Blood, Maryam d'Abo, Bonnie Langford, Lance Henriksen, Tommy Knight, Lee Stringer, Jonathan Watson, Bernard Hill, Jimmy Vee, Tommy Flanagan, Jenna Coleman, Marina Sirtis, Kristanna Loken, Tim Dry, Sean Crawford, Joey Cramer, Andy Secombe, Sam Spruell, Rochenda Sandall"]}, {"page": "D. J. Kane", "response": ["He is the uncle of Irish actress Valene Kane."]}, {"page": "Andrew Harwood Mills", "response": ["In 2011 Andrew starred in War Games: At the End of the Day directed by award winning Italian director Cosimo Alemà. It was released in Italian cinemas by Bolero and by Universal Pictures in the UK. The film premiered at the Raindance Film Festival where it competed for Best International Feature. The film also stars Sam Cohan (Oliviero Rising), Valene Kane (Rogue One: A Star Wars Story, The Fall (TV series)) and Daniel Vivian (The Young Pope, X-Men (film))."]}, {"page": "Valene kane", "response": ["#REDIRECT Valene Kane"]}, {"page": "The Fading Light", "response": ["The cast includes Valene Kane, Emma Eliza Regan, Bibi Larrson and Patrick O’Donnell who won the Best Actor gong from the Dublin Film Critics Circle for his performance in the film"]}, {"page": "List of Norwegian films of the 2010s", "response": ["|Sonja || Anne Sewitsky || Ine Marie Wilmann, Valene Kane, Eldar Skar || Biography, drama, history || 25 December 2018"]}, {"page": "List of British films of 2012", "response": ["|| Director: Kieron J. Walsh   Cast: Nichola Burley, Martin McCann, Charlene McKenna, Ciarán McMenamin, Valene Kane"]}, {"page": "War Games: At the End of the Day", "response": ["War Games: At the End of the Day is a 2011 independent thriller film directed by Cosimo Alemà, who co-wrote it with Daniele Persica and Romana Meggiolaro. Luca Legnani is credited as executive producer. The film is distributed by Universal Pictures. It stars Stephanie Chapman Baker, Neil Linpow, Michael Lutz, Sam Cohan, Valene Kane, Andrew Harwood Mills, Tom Stanley, Monika Mirga, Daniel Vivian and Michael Schermi."]}, {"page": "The Fall (TV series)", "response": ["* Valene Kane as Rose Veronica Stagg (née McGill)"]}, {"page": "'71 (film)", "response": ["* Valene Kane as Orla Spitting Girl"]}, {"page": "Jump (2012 film)", "response": ["* Valene Kane as Dara"]}, {"page": "Rogue One", "response": ["Additionally, Alistair Petrie plays General Davits Draven, Ben Daniels plays General Antoc Merrick, and Valene Kane plays Lyra Erso, Jyn's mother. Jonathan Aris, Fares Fares, and Sharon Duncan-Brewster appear as Senators Nower Jebel, Vasp Vaspar, and Tynnra Pamlo, respectively. Simon Farnaby plays a member of Blue Squadron. Jordan Stephens appears as Rebel Alliance member Corporal Tonc. Nick Kellington plays Bistan, the door gunner on a U-wing during the battle on Scarif. Ian Whyte plays Moroff, a member of Saw Gerrera's Partisans. Daniel Mays appears as Tivik. Rian Johnson and Ram Bergman, director and producer of Star Wars: The Last Jedi, respectively, cameo as two Death Star technicians."]}, {"page": "Thirteen (TV series)", "response": ["*Valene Kane as D.S. Lisa Merchant"]}, {"page": "List of The Fall episodes", "response": ["Gillian Anderson stars in the second series of The Fall, alongside Jamie Dornan, Bronagh Waugh, Niamh McGrady, John Lynch, Archie Panjabi, Stuart Graham, Aisling Franciosi, Valene Kane, Emmett J. Scanlan, Jonjo O'Neill, Colin Morgan, Bronagh Taggart, Karen Hassan, Nick Lee, Sean McGinley, Brian Milligan, and Séainín Brennan. It started broadcast in Ireland (RTÉ) on 9 November 2014, followed by the UK broadcast (BBC) on 13 November.", "Gillian Anderson stars in the third series of The Fall, alongside Jamie Dornan, Bronagh Waugh, John Lynch, Aisling Franciosi, Valene Kane, Jonjo O'Neill, Colin Morgan, Aisling Bea, Richard Coyle, Barry Ward, Richard Clements, Ruth Bradley, Genevieve O'Reilly, Aidan McArdle, Denise Gough, Conor MacNeill, Luke Whoriskey and Krister Henriksson. It started broadcast in Ireland (RTÉ) on 25 September 2016, followed by the UK broadcast (BBC) on 29 September."]}, {"page": "List of The Fall characters", "response": ["| Valene Kane || Rose Stagg || colspan=\"3\"  || style=\"background:#ffe4e1; text-align:center;\"| ||  || colspan=3\" style=\"background:#e0ffff; text-align:center;\"| ||  || colspan=6\" style=\"background:#e0ffff; text-align:center;\"| ||  || style=\"background:#ffe4e1; text-align:center;\"| || align=\"center\"|11", "Rose Veronica Stagg (née McGill) (Valene Kane), a woman who had a sexual relationship with Paul whilst at university. During a night of passion, Paul tried to strangle her to death. As the Belfast Strangler comes to the attention of the public, Stagg notices the similarities and contacts her close friend Reed Smith. Her husband was unaware the attack had taken place. She is later kidnapped and held captive by Spector. She is later found unconscious in a car trunk. During series three, Stagg reveals that her sexual relationship with Paul was entirely consensual, and that, during sex, he strangled her so aggressively she had to be revived."]}, {"page": "Jyn Erso", "response": ["Rogue One was released in December 2016, with Felicity Jones in the role of Jyn. In the film, scientist Galen Erso (Mads Mikkelsen) is pressed into the service of the Empire against his will. When he is captured and his wife Lyra (Valene Kane) is killed, their young daughter Jyn escapes and hides in the bunker. She is later rescued by a Rebel extremist named Saw Gerrera (Forest Whitaker) who cared for her after Galen's capture."]}, {"page": "The Other Guy (TV series)", "response": ["*Valene Kane as Olivia Collins"]}, {"page": "Profile (2018 film)", "response": ["Profile is a 2018 Screenlife thriller film directed by Timur Bekmambetov, from a screenplay by Bekmambetov, Britt Poulton, and Olga Kharina, based upon the non-fiction book In The Skin of a Jihadist by Anna Erelle. It stars Valene Kane, Shazad Latif, Christine Adams, Amir Rahimzadeh and Morgan Watkins.", "* Valene Kane as Amy Whittaker"]}, {"page": "List of British films of 2018", "response": ["|| Director: Timur Bekmambetov  Cast: Valene Kane, Shazad Latif, Christine Adams, Morgan Watkins"]}, {"page": "List of Star Wars film actors", "response": ["| Valene Kane"]}, {"page": "Death and Nightingales (TV series)", "response": ["* Valene Kane as Catherine Winters, Beth's mother"]}, {"page": "Gangs of London (TV series)", "response": ["*Valene Kane as Jacqueline Robinson, daughter of Finn Wallace and an emergency doctor who is estranged from her family for the safety of her unborn child."]}, {"page": "Valene", "response": ["* Valene Kane, Northern Irish actress"]}, {"page": "Nowhere Special", "response": ["* Valene Kane as Celia"]}, {"page": "German Comic Con", "response": ["| Alexis Denisof, Alyson Hannigan, Amber Rose Revah, Billy Boyd, Bruce Langley, Carl Weathers, Christopher Judge, Christopher Lambert, Daniel Naprous, Devon Murray, Ellie Kendrick, Finn Wolfhard, Indigo, Iyari Limon, Jaleel White, James Marsters, Kristian Nairn, Mark Williams, Peter Facinelli, Peter Weller, Ricky Whittle, Robert Englund, Ross Mullan, Samantha Smith, Sarah Hagan, Sean Biggerstaff, Staz Nair, Tamara Taylor, TJ Thyne, Valene Kane, Vladimir Furdik, Wentworth Miller", "| Aimee Garcia, Candice King, Ghadah Al-Akel, Ingo Albrecht, Jeremy Bulloch, Jerome Flynn, Kate Dickie, Manuel Straube, Mark Boone Junior, Michael Biehn, Robert Patrick, Rutger Hauer, Sean Gunn, Theo Rossi, Thomas Müller, Tobias Müller, Valene Kane"]}]}}