{"wiki_id": "http://www.wikidata.org/entity/Q7911326", "itemLabel": "Valerie Randle", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Valerie_Randle", "wikipedia_page": {"main": "Valerie Randle is a materials engineer who specialised in electron backscatter diffraction, grain boundary engineering, and has written a number of text books on the subject  She was Welsh Woman of the Year in 1998 and in the same year was awarded the Rosenhain Award for achievements in Materials Science  by the Institute of Materials, Minerals and Mining.\nIn 2004 she was invited as a guest of HM the Queen to a luncheon at Buckingham Palace for the 'top 180 female achievers in the country'. From 2008 she has been included in Who's Who. as part of increasing public recognition of scientists.  She has made significant contributions in the field of materials engineering with over 150 indexed publications in the field.", "link_mentions": [{"page": "Swansea University", "response": ["* Valerie Randle, Professor in Metallurgy"]}, {"page": "Electron backscatter diffraction", "response": ["There are two leading methods of indexing performed by most commercial EBSD software: triplet voting; and minimising the 'fit' between the experimental pattern and a computationally determined orientation. A best practice guide for reliable data acquisition has been written by Professor Valerie Randle"]}, {"page": "Welsh Woman of the Year", "response": [":1998 - Professor Valerie Randle"]}, {"page": "Randle", "response": ["* Valerie Randle, Welsh materials engineer and professor at Swansea University"]}, {"page": "Stephen G. R. Brown", "response": ["Brown is a specialist in computational materials whose work has centred on writing code in finite element, finite difference, cellular automata, Monte Carlo method and data analysis techniques. He has had research collaborations with industry including relationships with Rolls-Royce and Airbus. In 2010 he took over the role as the head of the Materials Research Centre, which was previously held buy Professor Valerie Randle."]}]}}