{"wiki_id": "http://www.wikidata.org/entity/Q7926347", "itemLabel": "Victor Sloan", "itemDescription": "Irish artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Sloan", "wikipedia_page": {"main": "Victor Sloan MBE  (born 1945) is a Northern Irish photographer and artist.", "link_mentions": [{"page": "1945", "response": ["** Victor Sloan, Irish artist"]}, {"page": "County Tyrone", "response": ["* Victor Sloan MBE, visual artist"]}, {"page": "List of photographers", "response": ["* Victor Sloan (born 1945)"]}, {"page": "Portadown", "response": ["*Victor Sloan MBE (born 1945) is a photographer and artist who lives and works in Portadown. Employing primarily the medium of photography, he manipulates his negatives and reworks his prints with paints, inks, toners and dyes. In addition to photography, he also uses video, and printmaking techniques."]}, {"page": "Dublin City University", "response": ["An Arts CommitteeArts Committee  was established in 1983 and has since acquired more than 300 works of art, including paintings, tapestries and sculptures, for the university. The collection includes works by artists such as Louis le Brocquy, Cecil King, Patrick Scott, Michael Warren, Stephen Lawlor, Brian Bourke, Victor Sloan, Barrie Cooke and William Crozier."]}, {"page": "Ulster University", "response": ["Ulster has a large body of notable alumni, including MPs Kate Hoey, Gregory Campbell, Michelle Gildernew, Roberta Blackman-Woods and former deputy First Minister of Northern Ireland Mark Durkan, MLAs Alban Maginness, Basil McCrea and Seán Neeson, writers and authors including Anne Devlin, Dinah Jefferies, Colin Duriez, Calum Neill and Aodán Mac Póilin, poets including Gerald Dawe and Brendan Hamill, and artists including Jack Coulter, Colin Davidson, Oliver Jeffers, Freddie Freeburn, Victor Sloan, Andre Stitt, John Luke and John Kindness. Other alumni include composer Brian Irvine, musician David Lyttle, comedian Omid Djalili, former hostage and writer Brian Keenan, historian Simon Kitson, biomedical scientist and former Vice-Chancellor Gerry McKenna, visual artist Willie Doherty, photographer Mary Fitzpatrick, film producer Michael Riley, rugby player Brian Robinson, radio and television personality Gerry Anderson, nursing academic Alison Kitson, CEO of Cognizant Brian Humphries and senior police officer Barbara Gray."]}, {"page": "Dungannon", "response": ["* Victor Sloan (born 1945) - artist"]}, {"page": "List of Irish artists", "response": ["*Victor Sloan (born 1945) – photographer and artist"]}, {"page": "Irish art", "response": ["*Kevin Abosch, Gerard Byrne, Dorothy Cross, James Coleman, Amanda Coogan, Colin Davidson, Joe Dunne, Ross Eccles, Fergus Feehily, Gary Farrelly, Ronan Goti, James Hanley, Gottfried Helnwein, Sean Hillen, Mary Fitzgerald, Stephen Lawlor, John Long, Paul McCloskey, Mick O'Dea, Nick Miller, Michael Mulcahy, Rasher, Peter Richards, Anne Rigney, Victor Sloan, Paul Seawright,  Samuel Walsh, Conor Walton."]}, {"page": "Leeds Arts University", "response": ["* Victor Sloan, visual artist"]}, {"page": "Culture of Northern Ireland", "response": ["* Victor Sloan, MBE, Photographer"]}, {"page": "Ormeau Baths Gallery", "response": ["The Ormeau Baths  in Belfast, Northern Ireland, now a home to tech and digital businesses in a modern contemporary building, was one of Ireland's premier contemporary art spaces. It curated exhibitions by prominent international artists including; Yoko Ono, Gilbert & George, Victor Sloan, Bill Viola, Hans Peter Kuhn, Stan Douglas, David Byrne, Willie Doherty and Alastair MacLennan."]}, {"page": "Hugh Mulholland", "response": ["Mulholland was the founder and director of Context Gallery in Derry. In 1997 he was appointed director of the Ormeau Baths Gallery, Belfast. During his tenure at the gallery he curated major exhibitions by prominent International artists including, Barbara Freeman, Jack Pakenham, Yoko Ono, David Byrne, Hans Peter Kuhn, Stan Douglas, Willie Doherty, Victor Sloan and Alistair MacLennan."]}, {"page": "1945 in art", "response": ["* July 16 – Victor Sloan, Irish visual artist"]}, {"page": "Royal School Dungannon", "response": ["*Victor Sloan, (born 1945), artist."]}, {"page": "List of artists from Northern Ireland", "response": ["*Victor Sloan MBE (1945– )"]}, {"page": "July 1945", "response": ["*Born: Victor Sloan, photographer and artist, in Dungannon, Northern Ireland"]}, {"page": "Royal Ulster Academy", "response": ["Presidents of the Academy have included Sir John Lavery R.A, Morris Harding, William Conor, Mercy Hunter, T.P. Flanagan, Joe McWilliams and Rita Duffy. The present president is Betty Brown PRUA. Academicians include Basil Blackshaw, Victor Sloan, TP Flanagan, Graham Gingles, Jean Duncan, Neil Shawcross and Jack Pakenham."]}, {"page": "Victor (name)", "response": ["*Victor Sloan (born 1945), Irish artist"]}, {"page": "Source (photography magazine)", "response": ["Victor Sloan,"]}, {"page": "List of people from Northern Ireland", "response": ["* Victor Sloan photographer and artist"]}, {"page": "Aidan Dunne", "response": ["Aidan Dunne has written regularly for The Irish Times for decades.  He was art critic of In Dublin magazine, Sunday Press and the Sunday Tribune.  Dunne has written extensively on Irish art, with essays on Michael Mulcahy, Victor Sloan, Patrick Scott, Hughie O'Donoghue, Patrick Swift, and Jennifer Trouton.http://www.libertiespress.com/cartage.html?main_page=product_book_i nfo&products_id=56&zenid=pqdbv4khe9dj8hgssr4bbutgl5&cartage_alias=cartage  He has also written an essay on Russian photographer and artist Alexey Titarenko.Aidan Dunne. \"Camera in a City of Shadows\", The Irish Times, Dublin, 5 May 2007."]}, {"page": "Peter Richards (artist)", "response": ["When Richards began his professional career in Belfast in the mid-1990s he was working both as an artist and as a curator. He was based at Catalyst Arts, Northern Ireland's pioneering contemporary visual arts, artist-run organisation (est 1994) between 1996 and 1998. Since his time at Catalyst Arts Richards has worked as a guest curator at the Context Gallery in Derry and at the Old Museum Arts Centre in Belfast. His curatorial contribution to contemporary art in Northern Ireland is best known for his work at the Golden Thread Gallery, where he has worked since 2001, to profile established contemporary Northern Irish artists, such as: Lisa Byrne, Ian Charlesworth, Colin Darke, Willie Doherty, Susan MacWilliam, Mary McIntyre, Locky Morris, Philip Napier, Aisling O'Beirn, Paul Seawright, Dan Shipsides, Victor Sloan. He has also worked with their peers internationally, such as William Kentridge, Destiny Deacon, Marjectica Potrc, Azorro Group, Zbigniew Libera, Shane Cullen, Delcy Morelos, Gerald Byrne. Richards has worked closely with a number of younger artists creating a platform for them to develop their practice."]}, {"page": "List of Ulster University people", "response": ["*Victor Sloan MBE, artist"]}, {"page": "Homer Sykes", "response": ["*\"Picturing Derry\". 2013 Derry∼Londonderry City of Culture. The City Factory (Derry), 31 May – 7 July 2013. With Gilles Caron, Brian Gill, Clive Limpkin, Willie Carson, Larry Doherty, Barney McMonagle, A. W. Martin, Eamon Melaugh, Seán Hillen, Willie Doherty and Victor Sloan.\"Picturing Derry\", cityofculture2013.com. Accessed 10 September 2015."]}, {"page": "Café Royal Books", "response": ["The first six publications were collaborative group books. Since then most have included the work of an individual photographer or artist. Café Royal Books specialises in collaborating with a photographer. It has published work by John Benton-Harris, John Bulmer, David Carol,\"About David Carol\", LensCulture. Accessed 11 July 2014.\"Where's the Monkey?\", LensCulture. Accessed 11 July 2014. John Claridge, Douglas Corrance, John Deakin, Peter Dench, Henrik Drescher, Alejandro Guijarro, Ken Grant, David Hurn, Chris Killip, Stephen McLaren, Daniel Meadows, Tish Murtha, Jim Mortram, Martin Parr, Simon Roberts, Victor Sloan, Brian David Stevens,\"If Only I'd Known: Photographer Brian David Stevens \", IdeasTap. Accessed 11 July 2014. Homer Sykes, Ed Templeton, Arthur Tress,\"Bookshop News: Discoveries at Photobook Bristol \", Photographers' Gallery. Accessed 17 August 2014. Patrick Ward, Janine Wiedel, and Document Scotland photographers among others. Café Royal has worked with some photographers to produce numerous different books of their work. Some of the books are of Atkinson's own work."]}, {"page": "Sloan (surname)", "response": ["* Victor Sloan (born 1945), Irish visual artist"]}, {"page": "Sloan, Victor", "response": ["#redirectVictor Sloan"]}, {"page": "Mike Abrahams", "response": ["In 1992, Abrahams published a collection of six black and white prints entitled British Suburban Cowboys featuring British fans of Country and Western music. His photography was featured in Revealing Views: Images From Ireland (1999) by Joanne Bernstein and Mark Sealy, published in London by Royal Festival Hall, alongside work by Seán Hillen, Mary McIntyre, Pádraig Murphy, Steve Pyke, Paul Seawright, and Victor Sloan."]}]}}