{"wiki_id": "http://www.wikidata.org/entity/Q7926891", "itemLabel": "Victoria Newton", "itemDescription": "English journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Newton", "wikipedia_page": {"main": "Victoria Newton (born 9 March 1972 in Liverpool, England) is the editor of The Sun. She formerly ran its \"Bizarre\" showbiz column and then became deputy editor of the paper, before becoming senior editor in February 2020.", "link_mentions": [{"page": "News of the World", "response": ["* Victoria Newton – final deputy editor"]}, {"page": "British Press Awards 2006", "response": ["* Victoria Newton (The Sun)"]}, {"page": "U Sure Do", "response": ["Alan Jones from Music Week wrote, \"A powerful house track propelled by its Donna Allen sample, it's now in new mixes, but it's the original that brings home the bacon.\" James Hamilton from the magazine's RM Dance Update called it a \"useful if somewhat sparse Madonna pastiche featuring plaintive Victoria Newton in 'let's do it' prodded\" tune and a \"disco bounder\". "]}, {"page": "Britain's Next Top Model (series 3)", "response": ["The girls are woken up with a grueling morning workout from Celebrity Personal Trainer, Nicki Waterman. Some girls struggled in workout especially Sherece. This activity was followed by a fake grilling and interview from The Sun journalist Victoria Newton who taught them how to deal with reporters.", "*Special guests: Nicki Waterman, Victoria Newton, Joan Rivers, Mark Evans, Max Clifford, Debbie Rix, Guy Burnet, Stuart Manning, Shelley Perkins"]}, {"page": "Tony Gallagher (editor)", "response": ["He was appointed as the deputy editor of The Times effective 10 February 2020, as Victoria Newton succeeded him as The Suns editor."]}, {"page": "Gordon Smart", "response": ["Unable to find work in newspapers Smart turned to football earning a living coaching for Dutch company Coerver between 2001–02. After a second serious football injury he returned to Scotland to work for Deadline Press and Picture Agency, covering news in the east of Scotland. During the MTV Europe Music Awards held in Edinburgh in 2003, Smart got his big break after a former colleague from DC Thomson introduced him to Victoria Newton, then editor of the Bizarre showbiz column of The Sun newspaper. The introduction resulted in shifts in London which then paved the way for a move to the News of the World on a three-month contract.", "Smart joined Bizarre at The Sun full-time in 2004 as Victoria Newton's deputy; when Newton was promoted to head of entertainment in November 2007, he became the column editor. In his opening column for the paper, he formed a 'cabinet' around himself comprising Pete Samson (\"Office of the minister of music\"), Danielle Lawler and other deputies. Lawler left to join The Daily Mirror as a 3am Girl soon after, while Samson now holds the US Editor position at The Sun."]}, {"page": "Rushcliffe School", "response": ["* Victoria Newton - former deputy editor of The Sun, current editor of The Sun on Sunday – her father Don was deputy headmaster."]}, {"page": "The Sun (United Kingdom)", "response": ["* Victoria Newton (2020–present)"]}]}}