{"wiki_id": "http://www.wikidata.org/entity/Q7925975", "itemLabel": "Victor Hanbury", "itemDescription": "British film director and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Hanbury", "wikipedia_page": {"main": "For the blacklisted director who used the name as a pseudonym, see Joseph Losey.Victor Hanbury or W. Victor Hanbury (1897 – 14 December 1954) was a British film director and producer.\nEntering the film industry in 1919 after service in the First World War, he became a director and producer in the early 1930s. His last film as a director was Hotel Reserve (which he also co-produced) in 1944. He continued to produce into the 1950s. He was initially credit as both producer and director of The Sleeping Tiger, but the film was actually directed by Joseph Losey. He was born in and died in London, England.", "link_mentions": [{"page": "1933 in film", "response": ["*Dick Turpin, directed by Victor Hanbury, starring Victor McLaglen (GB)"]}, {"page": "List of film and television directors", "response": ["*Victor Hanbury"]}, {"page": "Alfred Grünwald (librettist)", "response": ["*Ball at Savoy, directed by Victor Hanbury (UK, 1936)"]}, {"page": "Lewis Gilbert", "response": ["As a child actor in films in the 1920s and 1930s, he was the breadwinner for his family, his mother was a film extra, and he had an erratic formal education. In 1933, at the age of 13, he had a role in Victor Hanbury and John Stafford's Dick Turpin, and at age 17 a small uncredited role in The Divorce of Lady X (1938) opposite Laurence Olivier. Alexander Korda offered to send him to RADA, but Gilbert chose to study direction instead, assisting Alfred Hitchcock's Jamaica Inn (1939)."]}, {"page": "Jill Esmond", "response": ["Esmond and Olivier starred together in one film, No Funny Business (1933), a British comedy film directed by Victor Hanbury."]}, {"page": "William Alwyn", "response": ["| align=center|1943 || Escape to Danger ||   Victor Hanbury || "]}, {"page": "Rudolf Lothar", "response": ["*Return of a Stranger, directed by Victor Hanbury (English, 1937, based on a play)"]}, {"page": "Fritz Löhner-Beda", "response": ["* Ball at Savoy, directed by Victor Hanbury (UK, 1936, based on the operetta of the same name)"]}, {"page": "Frank Vosper", "response": ["His screenplays included co-writing the comedy No Funny Business with Victor Hanbury (1933). He also co-wrote the adaptation of G.B. Stern's novel Debonair with the novelist which opened at the Lyric 23 April 1930.  Dundee Evening Telegraph Saturday 06 March 1937 "]}, {"page": "Richard Genée", "response": ["*The Beggar Student, directed by Victor Hanbury and John Harvel (UK, 1931, based on the operetta Der Bettelstudent)"]}, {"page": "List of adventure films of the 1930s", "response": ["|Dick Turpin||Victor Hanbury, John Stafford || Victor McLaglen ||||"]}, {"page": "Ball im Savoy", "response": ["* Ball at Savoy, a 1936 British film adaptation directed by Victor Hanbury"]}, {"page": "List of British films of 1943", "response": ["|Escape to Danger||Lance Comfort, Victor Hanbury||Eric Portman, Ann Dvorak||Thriller||"]}, {"page": "List of British films of 1944", "response": ["|Hotel Reserve||Lance Comfort, Mutz Greenbaum, Victor Hanbury||James Mason, Lucie Mannheim||Espionage||"]}, {"page": "List of British films of 1935", "response": ["|Admirals All||Victor Hanbury ||Wynne Gibson, Gordon Harker ||Comedy ||", "|The Crouching Beast||Victor Hanbury||Fritz Kortner, Wynne Gibson||Drama||"]}, {"page": "List of British films of 1934", "response": ["|Spring in the Air || Victor Hanbury, Norman Lee  || Edmund Gwenn, Zelma O'Neal || Comedy ||", "|There Goes Susie || Victor Hanbury, John Stafford || Gene Gerrard, Wendy Barrie || Comedy ||"]}, {"page": "List of British films of 1933", "response": ["|Dick Turpin||Victor Hanbury, John Stafford ||Victor McLaglen, Jane Carr ||  Historical/drama||", "|No Funny Business||Victor Hanbury ||Laurence Olivier, Gertrude Lawrence ||  Comedy||"]}, {"page": "List of British films of 1931", "response": ["|The Beggar Student||John Harvel, Victor Hanbury||Margaret Halstan, Shirley Duke, Frederick Lloyd||Musical||"]}, {"page": "List of British films of 1937", "response": ["|Return of a Stranger||Victor Hanbury ||Griffith Jones, Rosalyn Boulter, Athole Stewart||Drama||"]}, {"page": "List of British films of 1936", "response": ["| The Avenging Hand || Victor Hanbury, Frank Richardson || Noah Beery, Kathleen Kelly || Crime ||", "|Ball at Savoy||Victor Hanbury||Conrad Nagel, Marta Labarr ||Musical||", "|Beloved Imposter||Victor Hanbury||René Ray, Fred Conyngham||Musical||", "|Second Bureau||Victor Hanbury||Marta Labarr, Charles Oliver||Spy|| "]}, {"page": "The Sleeping Tiger", "response": ["The Sleeping Tiger is a 1954 film noir starring Alexis Smith and Dirk Bogarde. It was Joseph Losey's first British feature, which he directed under the pseudonym of Victor Hanbury due to being blacklisted in the McCarthy Era..", "Due to his alleged ties with the US Communist Party, the blacklisted Joseph Losey moved to London and began work on The Sleeping Tiger, his first British feature film. Despite being in England, he faced more problems. The British director Victor Hanbury, who had not directed a film since Hotel Reserve in 1944, allowed Losey to use Hanbury's name as an alias. The American stars, Alexis Smith and Alexander Knox, were fearful of how appearing in Losey's film would affect their Hollywood careers.Caute, David, Joseph Losey: A Revenge on Life, 1994, p. 121"]}, {"page": "Hotel Reserve", "response": ["Hotel Reserve is a 1944 spy film starring James Mason as an innocent man caught up in pre-Second World War espionage. It was based on Eric Ambler's 1938 novel Epitaph for a Spy. Unusually, it was both directed and produced by a trio: Lance Comfort, Mutz Greenbaum (credited as Max Greene) and Victor Hanbury."]}, {"page": "No Funny Business", "response": ["No Funny Business is a 1933 British comedy film directed by Victor Hanbury and starring Laurence Olivier, Gertrude Lawrence, Jill Esmond and Edmund Breon. The film is a comedy of errors set in a divorce case. It was made at Ealing Studios.Munn p.44 The film's sets were designed by the art director Duncan Sutherland. Olivier had returned to Britain after his career, following an initial move to Hollywood, had faltered.Munn p.43-44", "Category:Films directed by Victor Hanbury"]}, {"page": "Dick Turpin (1933 film)", "response": ["Dick Turpin is a 1933 British historical drama film directed by Victor Hanbury and John Stafford it starred Victor McLaglen, Jane Carr, Frank Vosper, James Finlayson and Cecil Humphreys. The film depicts the adventures of the eighteenth century highwayman Dick Turpin and his legendary ride to York.BFI.org It is based on a historical novel by Harrison Ainsworth.", "Category:Films directed by Victor Hanbury"]}, {"page": "The Crouching Beast", "response": ["The Crouching Beast is a 1935 British war thriller film directed by Victor Hanbury and starring Fritz Kortner, Wynne Gibson and Richard Bird. It was shot at Welwyn Studios with sets designed by the art director Duncan Sutherland.Wood p.85 Based on the novel Clubfoot by Valentine Williams, the film was distributed by the Hollywood studio RKO Pictures in order to fulfil its British quota. However it was considerably more expensive than many of the quota quickies produced by American companies during the era.", "Category:Films directed by Victor Hanbury"]}, {"page": "Return of a Stranger (1937 film)", "response": ["Return of a Stranger is a 1937 British drama film directed by Victor Hanbury and starring Griffith Jones, Rosalyn Boulter, Ellis Jeffries and Athole Stewart.BFI.org The film was made at Shepperton Studios as a Quota quickie, and was distributed by RKO Pictures to meet the company's annual requirement under the Quota.", "Category:Films directed by Victor Hanbury"]}, {"page": "Admirals All", "response": ["Admirals All is a 1935 British comedy film directed by Victor Hanbury and starring Wynne Gibson, Gordon Harker, Anthony Bushell and George Curzon. It was based on the 1934 play of the same title by Ian Hay and Stephen King-Hall.BFI Database entry", "Category:Films directed by Victor Hanbury"]}, {"page": "Escape to Danger", "response": ["Escape to Danger is a 1943 British thriller film directed by Lance Comfort and Victor Hanbury and starring Eric Portman, Ann Dvorak and Karel Stepanek.", "Category:Films directed by Victor Hanbury"]}, {"page": "The Avenging Hand", "response": ["The Avenging Hand is a 1936 British crime film directed by Victor Hanbury and Frank Richardson and starring Noah Beery, Louis Borel and Kathleen Kelly.Wood p.93"]}, {"page": "Camillo Walzel", "response": ["*The Beggar Student, directed by Victor Hanbury and John Harvel (UK, 1931, based on the operetta Der Bettelstudent)"]}, {"page": "There Goes Susie", "response": ["There Goes Susie is a 1934 British comedy film directed by Victor Hanbury and John Stafford and starring Gene Gerrard, Wendy Barrie, and Zelma O'Neal.BFI Database entry Based on a story by Charlie Roellinghoff and Hans Jacoby, it was made by British International Pictures at Elstree Studios.Wood p.84 It is a remake of the 1933 German film Marion, That's Not Nice. A separate Italian version Model Wanted was also made.", "Category:Films directed by Victor Hanbury"]}, {"page": "List of Elstree Studios productions", "response": ["| Where Is This Lady? || Musical || Victor Hanbury, Ladislao Vajda || Mártha Eggerth, Owen Nares, Wendy Barrie", "| No Funny Business || || Victor Hanbury, John Stafford || Laurence Olivier, Gertrude Lawrence, Jill Esmond", "| Spring in the Air || rowspan=\"2\" | Comedy || Victor Hanbury, Norman Lee || Edmund Gwenn, Zelma O'Neal, Theo Shall", "| Ball at Savoy || Operetta || Victor Hanbury || Conrad Nagel, Marta Labarr, Fred Conyngham, Aubrey Mather"]}, {"page": "Victor Hanbury Productions", "response": ["#REDIRECTVictor Hanbury"]}, {"page": "Beloved Imposter", "response": ["Beloved Imposter is a 1936 British musical film directed by Victor Hanbury and starring Rene Ray, Fred Conyngham and Germaine Aussey. It was made at Welwyn Studios and released as a quota film by RKO Pictures.Chibnall p.287 It was based on the novel Dancing Boy by Ethel Mannin.", "Category:Films directed by Victor Hanbury"]}, {"page": "Ball at Savoy (1936 film)", "response": ["Ball at Savoy (sometimes known as Ball at the Savoy) is a 1936 British operetta film directed by Victor Hanbury and starring Conrad Nagel, Marta Labarr and Fred Conyngham. The film is based on the 1932 operetta Ball im Savoy by Paul Abraham, which had been turned into an Austrian film in 1935. It was made at Elstree Studios.Wood p.85", "Category:Films directed by Victor Hanbury"]}, {"page": "Second Bureau (1936 film)", "response": ["Second Bureau is a 1936 British spy romance film directed by Victor Hanbury and starring Marta Labarr, Charles Oliver and Arthur Wontner. It was made at Shepperton StudiosWood p.92 and based on a novel Second Bureau by Charles Robert-Dumas. It was a remake of a 1935 French film of the same name.", "Category:Films directed by Victor Hanbury"]}, {"page": "Second Bureau (1935 film)", "response": ["Second Bureau (French: Deuxième bureau) is a 1935 French spy romance film directed by Pierre Billon and starring Jean Murat, Véra Korène and Janine Crispin. It is based on the novel Second Bureau by Charles Robert-Dumas. The following year it was remade as a British film by Victor Hanbury.Low382 p. The book was one of a spy series Ceux du S. R. published in France by Librarie Arthème Fayard in 1934.https://www.worldcat.org/title/ceux-du-sr-2e-bureau/oclc/458035009?referer=br&ht=edition The film's sets were designed by the art director Aimé Bazin."]}, {"page": "1936 in British music", "response": ["* Ball at Savoy, directed by Victor Hanbury, starring Conrad Nagel and Marta Labarr"]}, {"page": "It Happened to One Man", "response": ["It Happened to One Man is a 1940 British drama film directed by Paul L. Stein and starring Wilfrid Lawson, Nora Swinburne and Marta Labarr. The screenplay was scripted by Paul Merzbach and Nina Jarcis, based on the play of the same name by John Hastings Turner and Roland Pertwee. Produced by Victor Hanbury's British Eagle Productions,"]}, {"page": "List of Stoll Pictures films", "response": ["| Dick Turpin || November 1933 ||Victor Hanbury, John Stafford|| "]}, {"page": "Spring in the Air", "response": ["Spring in the Air is a 1934 British comedy film directed by Victor Hanbury and Norman Lee and starring Edmund Gwenn, Zelma O'Neal and Theo Shall.Wood p.64 It was made at Elstree Studios.", "Category:Films directed by Victor Hanbury"]}]}}