{"wiki_id": "http://www.wikidata.org/entity/Q7926269", "itemLabel": "Victor Ransom", "itemDescription": "cricketer (1917-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Ransom", "wikipedia_page": {"main": "Victor Joseph Ransom (17 May 1917 – 23 September 1998) was an English first-class cricketer. Ransom was a right-handed batsman who bowled right-arm fast-medium.\nRansom made his first-class debut for Hampshire against Sussex in the 1947 County Championship. On debut Ransom took four wickets in both of Sussex's innings. Ransom's debut season was his most successful, claiming 54 wickets at a bowling average of 28.50. All of Ransom's three five wicket hauls came in the 1947 season.\nRansom represented Hampshire in 34 matches. In Ransom's 34 matches for the club he scored 419 runs at an average of 9.97, with a high score of 58 which came against Gloucestershire in 1949. With the ball Ransom took 88 wickets at a bowling average of 34.89, with best figures of 5-50, which was one of Ransom's three fifties. In addition Ransom took 18 catches. Ransom's final first-class match for Hampshire came against Cambridge University in 1950.\nIn 1949 Ransom made his debut for the Marylebone Cricket Club against his future club, Surrey. In 1950 Ransom played for the Marylebone Cricket Club against a Minor Counties first-class team. Ransom's final first-class match for the Marylebone Cricket Club came against Cambridge University in 1951.\nAdditionally in 1949, Ransom represented the South against the North in a single first-class match. 1949 was also the year Ransom was awarded his Hampshire cap.\nRansom joined Surrey in 1950, making his debut for the county against Cambridge University. He made only one more first-class appearance for the county, when he played his final first-class game five years later, in 1955, once more against Cambridge University.  However, from 1950 to 1958, Ransom represented the Surrey Second XI in 56 Minor Counties Championship matches, mainly as team captain, having been given the task of developing promising young players for the county's First XI, which at the time was having its longest run of success in the County Championship.  He made his final Second XI appearance in 1958 against Warwickshire Second XI. \nIn his overall first-class career Ransom scored 455 runs at an average of 9.68, with one half century which yielded his highest first-class score of 58. With the ball Ransom took 98 wickets at a bowling average of 35.39, with best figures of 5-50. Overall Ransom took 21 catches.\nRansom played cricket as an amateur, and for many years ran a business as a butcher in New Malden, Surrey.  He died at Esher, Surrey on 23 September 1998.\n\n", "link_mentions": {}}}