{"wiki_id": "http://www.wikidata.org/entity/Q7927032", "itemLabel": "Victoria Sellers", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Sellers", "wikipedia_page": {"main": "Victoria Sellers (born 20 January 1965) is a British-American model, actress, comedian, and jewellery designer.", "link_mentions": [{"page": "Heidi Fleiss", "response": ["Fleiss and reality-TV personality Victoria Sellers hosted and produced an instructional DVD titled Sex Tips with Heidi Fleiss and Victoria Sellers in 2001."]}, {"page": "List of show business families", "response": ["* Actors Britt Ekland and Peter Sellers are the parents of actress Victoria Sellers."]}, {"page": "Lynne Frederick", "response": ["Frederick's relationship with her former stepchildren (Michael Sellers, Sarah Sellers, and Victoria Sellers) was, like Peter's relationship with them, distant and often strained. When Lynne began her relationship with Peter, she made efforts to establish a friendly connection with them. Sarah recalled of Lynne, \"she seemed quite nice to begin with. I actually told dad that I thought she was a bit stupid. But she came across as very bubbly, friendly, warm and interested. But once they got married things definitely changed\". Michael Sellers wrote of Frederick in his exposé memoir, \"my first impression of Lynne didn't do much to alter my views. She was not exactly my idea of sweetness and light. It didn't concern me that she lacked the good looks of dad's past wives and girlfriends, but those innocent eyes, certainly her strongest feature, didn't deceive me\". Michael Sellers also bluntly acknowledged his intentional hostility and lack of respect towards Lynne when they first met: \"I'm afraid we weren't very kind in our judgement of Lynne. Sarah thought she wasn't too bright. But our views didn't really count for much. Because whatever our opinions, they would be of purely academic interest\". Months after Frederick's death in 1994, Victoria remarked \"I feel now that she's in hell - I don't know but that makes me feel better.\""]}, {"page": "List of people in Playboy 1980–1989", "response": ["| April || Shannon Tweed || Teri Weigel || Jeffrey MacDonald || || Victoria Sellers (daughter of Peter Sellers), Alexandrea Mosca"]}, {"page": "Heidi Fleiss: Hollywood Madam", "response": ["Broomfield then tries to find out more about Fleiss by visiting her old hangouts (The Roxbury, Tattoo and The Monkey Bar in Pasadena) as well as trying to get information from some sex workers, none of whom are either willing or able to give much information. At a motel, Broomfield meets adult entertainment superstar and now director Ron Jeremy who has just finished filming Bobbit Uncut. Jeremy puts Broomfield in touch with \"professional Heidi girl\" Gabby who is making a living doing interviews about Fleiss, who in turn puts him in touch with another one of Heidi's former employees- Heather. Heather recounts that Fleiss' clients would often pay the girls to sit around and watch them take drugs. Heather helps Broomfield to meet Fleiss' former teenage friend and confidante Victoria Sellers, then recently released from jail on a narcotics charge and residing in a small house off Melrose. Sellers explains that Fleiss' started to change as she became more involved in the prostitution business- \"she could be so sweet and giving but overnight became a mean, ice-cold bitch\"."]}, {"page": "Sellers (surname)", "response": ["* Victoria Sellers, Actress, designer and model - daughter of Peter Sellers"]}, {"page": "Sellers, Victoria", "response": ["#redirectVictoria Sellers"]}]}}