{"wiki_id": "http://www.wikidata.org/entity/Q7926730", "itemLabel": "Victoria Gillick", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Gillick", "wikipedia_page": {"main": "Victoria D. M. Gillick (née Gudgeon; born 1946, Hendon) is a British activist and campaigner best known for the eponymous 1985 UK House of Lords ruling that considered whether contraception could be prescribed to under-16s without parental consent or knowledge. The ruling established the term \"Gillick competence\" to describe whether a young person below the age of 16 is able to consent to his or her own medical treatment, without the need for parental permission or knowledge.\nA Roman Catholic mother of 10 children (five sons, five daughters), Gillick began her campaign in 1980 in response to a DHSS circular issuing guidance on contraceptive stating a minor could consent to treatment, and that in these circumstances a parent had no power to veto treatment.In 2000, Gillick lost a libel action against the Brook Advisory Centres, which she claimed accused her of being \"morally responsible\" for a rise in teenage pregnancies. Costs of £4,298.15 were awarded against her. In 2002, however, she won an apology and damages amounting to £5,000 and costs.Living in Wisbech, she is married to Cambridgeshire County Councillor and former UKIP councillor Gordon Gillick. One of their sons is the painter James Gillick.\n\n", "link_mentions": [{"page": "Wisbech", "response": ["*Victoria Gillick (born 1946 Hendon), activist and campaigner."]}, {"page": "Peter Tatchell", "response": ["In 1987 Tatchell appeared on the second programme of the first series of After Dark, a discussion on press ethics with, among others, Tony Blackburn, Victoria Gillick, Johnny Edgecombe and a Private Eye journalist. "]}, {"page": "Gillick competence", "response": ["Gillick's case involved a health departmental circular advising doctors on the contraception of minors (for this purpose, under 16s). The circular stated that the prescription of contraception was a matter for the doctor's discretion and that they could be prescribed to under-16s without parental consent. This matter was litigated because an activist, Victoria Gillick, ran an active campaign against the policy. Gillick sought a declaration that prescribing contraception was illegal because the doctor would commit an offence of encouraging sex with a minor and that it would be treatment without consent as consent vested in the parent; she was unsuccessful before the High Court of Justice, but succeeded in the Court of Appeal.", "A persistent rumour arose that Victoria Gillick disliked having her name associated with the assessment of children's capacity, but an editorial in the BMJ from 2006 claimed that Gillick said that she \"has never suggested to anyone, publicly or privately, that [she] disliked being associated with the term 'Gillick competent."]}, {"page": "Gillick", "response": ["*Victoria Gillick, a Catholic family campaigner"]}, {"page": "Liam Gillick", "response": ["Gillick is cousin to British artists James and Theodore Gillick. He was married to artist Sarah Morris, in 1998 at a ceremony in Miami. They divorced in 2012. Other relatives include sculptor Ernest Gillick, medallionist Mary Gillick, and anti-abortion activist Victoria Gillick."]}, {"page": "After Dark (TV programme)", "response": ["The second programme of the first series – transmitted on 8 May 1987 – centred on press ethics and featured, among others, Tony Blackburn, Peter Tatchell, Victoria Gillick, Johnny Edgecombe and a Private Eye journalist. A week later After Dark broadcast the following correction in relation to the British Member of Parliament Simon Hughes: \"Mr Hughes has asked us to say that he is not a homosexual, has never been a homosexual and has no intention of becoming a homosexual in the future.\" He has, however, since declared that he is bisexual."]}, {"page": "1983 in the United Kingdom", "response": ["* 26 July – A Catholic mother of ten, Victoria Gillick, loses a case in the High Court of Justice against the DHSS. Her application sought to prevent the distribution of contraceptives to children under the age of 16 without parental consent. The case goes to the House of Lords in 1985 when it is decided that it is legal for doctors to prescribe contraceptives to under-16s without parental consent in exceptional circumstances (\"Gillick competence\")."]}, {"page": "John Marks (doctor)", "response": ["His six-year term is unique – at the time he was leading the Association and the profession in a campaign against Kenneth Clarke's reforms of the NHS based on the untried concept of an internal market. He played a major role in defending the Abortion Act 1967 in the face of attacks by \"pro-lifers\" including Victoria Gillick and the MPs David Alton and Sir Russell Brain. In 1970 he successfully led the campaign against the BMA Council's decision to recommend an annual registration fee to the GMC without prior reform of its constitution. He also played a major role in campaigns in favour of restricting smacking, the wearing of seat belts, and respecting the confidentiality of sufferers from AIDS."]}, {"page": "Michael Fox (judge)", "response": ["He was promoted to the Court of Appeal in 1981, and as is customary was sworn of the Privy Council.  In 1984, he upheld the appeal by Victoria Gillick, that children should not be given contraceptives without their parents' consent, except in an emergency or with the permission of the court, [1985] 1 All ER 533.  This judgment was narrowly overturned by a 3–2 majority on appeal to the House of Lords, [1986] AC 112.  Also in 1984, he granted an injunction to stop The Daily Mirror from publishing information from bugged telephone conversations of National Hunt jockey John Francome, [1984] 2 All ER 408."]}, {"page": "British Housewives' League", "response": ["The British Housewives' League still existed in 2000Encyclopedia of British & Irish Politic Organisations, Peter Barberis, John McHugh, Mike Tyldesley, Continuum Imprint, London 2000,  and attempted to show that excessive control by the state is not in the interest of a free and happy home-life, or the development of personality in accordance with Christian tradition. Associates included Victoria Gillick, prominent in the 'pro-life' movement and opponent of sex education in schools.Wilson 1980; Campbell, B. 1987Encyclopedia of British & Irish Politic Organisations, Peter Barberis, John McHugh, Mike Tyldesley, Continuum Imprint, London 2000, "]}, {"page": "James Gillick", "response": ["Gillick gained a degree in Landscape Architecture from Cheltenham and Gloucester College in 1993. He is the son of activist Victoria Gillick\"Catholic Artist shows new work\", The Catholic Herald, 10 April 2009. and theatre set designer and former UKIP county councillor Gordon Gillick.\"UKIP councillor Gordon Gillick: 'Poor, badly educated people are fat because they like it'\", independent.co.uk, 24 July 2014."]}, {"page": "Johnny Edgecombe", "response": ["On his release, Edgecombe became a jazz promoter, running a club called Edges, and worked as a film and television extra. In 1987 he made an extended appearance on an edition of the live television discussion programme After Dark alongside Tony Blackburn, Peter Tatchell, Victoria Gillick and others. Edgecombe also appeared briefly in the 1989 TV documentary The Scandal Story where he reenacted the shooting incident outside the Marylebone house."]}, {"page": "John Ashton (public health director)", "response": ["Ashton believes the Victoria Gillick affair and attempts to restrict sex education in schools played a part and that a \"political desire ..to control people's behaviour... worked against a genuine public health interest\". Despite advice from religious leaders that it was entirely their responsibility, the DHSS and DES insisted the programme contain a strict moral message. Later in 1986, fear of AIDS led to a change of attitude towards sex education."]}, {"page": "Adolescent sexuality in the United Kingdom", "response": ["In 1984, a high court ruling in favour of Victoria Gillick, it was deemed illegal for health professionals to advise or give girls under 16 contraceptives without parental consent except in exceptional circumstances;\"FPA Under 16s Consent & Confidentiality Factsheet \". the number of girls under 16 visiting family planning clinics each year dropped to twelve thousand in response. When the House of Lords overturned the high court ruling in 1985 and confidential contraceptive advice to young people was restored, the number rose again to sixteen thousand per year.\"NHS Contraceptive Services Statistics\""]}, {"page": "Open to Question", "response": ["*1 Oct 1985: Mrs. Victoria Gillick."]}, {"page": "Gillick, Victoria", "response": ["#redirectVictoria Gillick"]}]}}