{"wiki_id": "http://www.wikidata.org/entity/Q7927636", "itemLabel": "Vida Hope", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Vida_Hope", "wikipedia_page": {"main": "Vida Hope (16 December 1910 – 23 December 1963) was a British stage and film actress, who also directed stage productions.\n\n", "link_mentions": [{"page": "Julie Andrews", "response": ["On 30 September 1954, the eve of her 19th birthday, Andrews made her Broadway debut as Polly Browne in the London musical The Boy Friend. Andrews was recommended to director Vida Hope for the part by actress Hattie Jacques, whom Andrews regards as a \"catalyst\" for her career. Eve Benda recognized her special talent and predicted her stardom.  Andrews was anxious about moving to New York; at the time, she was both breadwinner and caretaker for her family, and took the part upon her father's encouragement. She stated that at the time, she had \"no idea\" how to research a role or study a script, and cites Cy Feuer's direction as being \"phenomenal\". The Boy Friend became a hit, with Andrews receiving praise; critics called her the stand-out of the show.Spindle, pp. 4–5."]}, {"page": "The Man in the White Suit", "response": ["*Vida Hope as Bertha"]}, {"page": "Vida", "response": ["* Vida Hope (1918–1963), British film actress"]}, {"page": "Alfie Bass", "response": ["His stage career included plays by Shakespeare and Shaw. During the 1950s, he continued to direct shows at Unity, and on one occasion appeared in court (along with Vida Hope), charged with putting on a play without a licence.Colin Chambers The Story of Unity Theatre, London (1990) His stage work also included an adaptation of Gogol's short story The Bespoke Overcoat, transposed to the East End of London, which was filmed by Jack Clayton in 1956, and won the Oscar for Best Short. In addition, Bass took over from Chaim Topol in the role of Tevye in Fiddler on the Roof on the West End stage.Green, Stanley, Encyclopedia Of The Musical Theatre, Da Capo Press 1980, p. 121"]}, {"page": "They Made Me a Fugitive", "response": ["* Vida Hope as Mrs. Fenshaw"]}, {"page": "List of female movie actors by name: H–I", "response": ["*Vida Hope (1918–1962)"]}, {"page": "The Long Memory", "response": ["* Vida Hope as Alice Gedge"]}, {"page": "Angels One Five", "response": ["* Vida Hope as W.A.A.F. "]}, {"page": "It Always Rains on Sunday", "response": ["*Vida Hope as Mrs Wallis"]}, {"page": "Unity Theatre, London", "response": ["The company was notable for pioneering new dramatic forms, such as company-devised documentary pieces, 'Living Newspapers' and satirical pantomimes, including Babes in the Wood (whose cast included Bill Owen, Mark Cheney, Vida Hope, Alfie Bass and Una Brandon-Jones). Ann Davies appeared as Robin Hood (the Principal Boy) in a political version of the pantomime Babes in the Wood which lampooned Neville Chamberlain's appeasement policy and had her as saviour in a Russian uniform. The production ran for seven months and Montagu Slater credited the play with making real political change. ", "Notable actors associated with Unity Theatre have included Lionel Bart, Alfie Bass, Una Brandon-Jones, Michael Gambon, Julian Glover, Jack Grossman, Harry Landis, Michael Redgrave, Herbert Lom, Vida Hope, Bob Hoskins, David Kossoff, Warren Mitchell, Bill Owen, who was then known as Bill Rowbotham, Eric Paice, Ted Willis and Roger Woddis. Bart's earliest contributions were lyrics for the revue Turn It Up. Bart also wrote the lyrics for an agitprop version of Cinderella and also wrote a revue called Peacemeal and a play called Wally Pone for the group. During the war, Ann Davies became the theatre's first woman president."]}, {"page": "Emergency Call (1952 film)", "response": ["* Vida Hope as Brenda"]}, {"page": "Paper Orchid", "response": ["* Vida Hope as Jonquil Jones"]}, {"page": "School for Secrets", "response": ["* Vida Hope as \tWAAF Flight Sergeant"]}, {"page": "Double Confession", "response": ["* Vida Hope as Madam Zilia"]}, {"page": "Women of Twilight", "response": ["The Spectator, October 1951: \"Miss Rayman has written her first play around a revolting character who makes a comfortable income by taking unmarried mothers and their infants into her Hampstead home ... Virtue triumphs on the Embassy stage but it does not always triumph outside the theatre, and one is left wondering just what does happen to such girls who have neither friends nor relatives to turn to and who escape the welfare of the State for some reason. The piece is very well acted by Barbara Couper, Vida Hope, Rene Ray and the rest of a company entirely of women.\"Iain Hamilton in The Spectator, 18 October 1951", "Completing production in the second week of June 1952, the film version was made at the Gate Studios, Borehamwood and retained Rene Ray, Vida Hope and Betty Henderson from the original West End production. Freda Jackson and Joan Dowling were cast in key roles reminiscent of the parts they had played in the 1945 play No Room at the Inn and its 1948 film version.", "*Jess - Vida Hope [later: Phyllis Montefiore]", "* Jess Smithson - Vida Hope"]}, {"page": "George Orwell bibliography", "response": ["In addition to the pamphlets British Pamphleteers Volume 1: From the 16th Century the 18th Century and Talking to India, by E. M. Forster, Richie Calder, Cedric Dover, Hsiao Ch'ien and Others: A Selection of English Language Broadcasts to India, Orwell edited two newspapers during his Eton years—College Days/The Colleger (1917) and Election Times (1917–1921). While working for the BBC, he collected six editions of a poetry magazine named Voice which were broadcast by Orwell, Mulk Raj Anand, John Atkins, Edmund Blunden, Venu Chitale, William Empson, Vida Hope, Godfrey Kenton, Una Marson, Herbert Read, and Stephen Spender. The magazine was published and distributed to the readers before being broadcast by the BBC. Issue five has not been recovered and was consequently excluded from W. J. West's collection of BBC transcripts.", "|The initial issue of Orwell's poetry magazine with readings by Mulk Raj Anand, John Atkins, William Empson, Vida Hope, and Herbert Read.", "|Readings by Venu Chitale, John Atkins, Vida Hope, Edmund Blunden, Godfrey Kenton, Mulk Raj Anand, William Empson, Una Marson, Herbert Read, and Stephen Spender."]}, {"page": "The Woman in Question", "response": ["* Vida Hope – Shirley Jones"]}, {"page": "The Broken Horseshoe (film)", "response": ["* Vida Hope as Jackie Leroy "]}, {"page": "Donald Henderson (writer)", "response": ["From early youth he had written novels and plays under various pseudonyms. He first used his own name on the 1943 psychological thriller Mr Bowling Buys a Newspaper,Published by Constable & Co Ltd, 1943 which got considerable critical attention in wartime Britain. In 1946, it was dramatised for the stage under the same title with a cast headed by Anthony Hawtery and Jean Forbes-Robertson. In 1948, film actor Gene Raymond obtained the screen rights to it, according to the New York Daily News. In 1950, Anthony Hawtrey and Vida Hope starred in teleplay of the novel on British television. In the immediate aftermath of World War II Henderson published a second novel in the same genre, the 1946 Goodbye to Murder.Published by Constable & Co Ltd, 1946, re-issued by Pan Books in 1947. A Spanish translation entitled \"Adiós al crimen\" published by Emecé, Buenos Aires, 1950"]}, {"page": "Fast and Loose (1954 film)", "response": ["* Vida Hope as Gladys"]}, {"page": "For Them That Trespass", "response": ["* Vida Hope as Olive Mockson"]}, {"page": "Lease of Life", "response": ["* Vida Hope as Mrs. Sproatley"]}, {"page": "Derek Twist", "response": ["He was married to actress and stage director Vida Hope until her death in a road accident in December 1963."]}, {"page": "Players' Theatre", "response": ["Appearing at the Players' Theatre were Leonard Sachs (who was often the chairman), Patricia Hayes, Hattie Jacques, James Robertson Justice, Peter Ustinov, Clive Dunn, Ian Carmichael, Joan Sterndale-Bennett, Vida Hope,Some of the Company – Vida Hope. In : Late Joys at The Players' Theatre. T V Boardman & Co Ltd, London, New York, 1943., p. 83 and Denis Martin, who eventually became Director of Production."]}, {"page": "Marilyn (1953 film)", "response": ["* Vida Hope as Rosie"]}, {"page": "In the Doghouse (film)", "response": ["* Vida Hope as Mrs. Crabtree"]}, {"page": "Cheer the Brave", "response": ["* Vida Hope "]}, {"page": "Rx Murder", "response": ["Rx Murder is a 1958 American crime film directed by Derek Twist and written by John W. Gossage and Derek Twist. It is based on the 1955 novel The Deeds of Dr. Deadcert by Joan Fleming. The film stars Rick Jason, Lisa Gastoni, Marius Goring, Sandu Scott, Mary Merrall and Vida Hope. The film was released on February 18, 1958, by 20th Century Fox.", "*Vida Hope as Louise"]}, {"page": "Valmouth (musical)", "response": ["The production was directed by Vida Hope. It made a star of Fenella Fielding as Lady Parvula de Panzoust. "]}, {"page": "Joan Gadsdon", "response": ["The subsequent opening night was a huge success and in her speech from the stage at the end, the director, Vida Hope, congratulated Gadsdon. \"Joan Gadsdon walked into this theatre yesterday morning, knowing nothing of the production, and tonight has given a faultless performance.\" The audience gave a \"tremendous roar of approval\", reported Sandy Wilson."]}, {"page": "Mr Bowling Buys a Newspaper", "response": ["*In 1950, Anthony Hawtrey (as Mr Bowling) and Vida Hope (as Alice) starred in teleplay of the novel on British television. "]}]}}