{"wiki_id": "http://www.wikidata.org/entity/Q7924815", "itemLabel": "Vic Halom", "itemDescription": "English footballer and manager (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vic_Halom", "wikipedia_page": {"main": "Victor Lewis \"Vic\" Halom (born 3 October 1948 in Burton upon Trent, Staffordshire, England) is a former footballer", "link_mentions": [{"page": "Burton upon Trent", "response": ["* Vic Halom (born 1948) a former footballer, played 452 pro games and stood for Parliament in Sunderland North in 1992SoccerBase Database retrieved 24 August 2018"]}, {"page": "Burton Albion F.C.", "response": ["|align=left|Vic Halom"]}, {"page": "Barrow A.F.C.", "response": ["To gain access to the Northern Premier League, the club had to promise to remove the speedway track from Holker StreetHolker Street Newsletter 1674  2 March 2006. Retrieved 3 May 2011. (although it remained until 1974). Barrow struggled in the league, with limited financial resources.Yelland, Phil Chapter 5: Fighting For Survival  A Brief History of Barrow AFC. The club were invited to join the new Alliance Premier League in 1979, the first national division in non-league football. Barrow won the Lancashire FA Challenge Trophy in 1981 (their first success as a non-league club since winning the Lancashire Combination in 1921), but were relegated two years later.Yelland, Phil Chapter 6: Making Progress  A Brief History of Barrow AFC They won the Northern Premier League title the following season under manager Vic Halom, but were relegated again by 1986. The club hired Ray Wilkie as a manager just before relegation, and Wilkie led Barrow to their most successful period to date in non-league football.Yelland, Phil Chapter 7: The Wilkie Years  A Brief History of Barrow AFC", "|align=left|Vic Halom"]}, {"page": "1973 FA Cup Final", "response": ["After 32 minutes Sunderland took the lead when Vic Halom chested down a corner from Billy Hughes. Assisted by Dave Watson between two defenders, the deflected high ball was controlled by Ian Porterfield who shot home from 12 yards. Leeds, shocked, battled back with predictable determination. Sunderland's goalkeeper Jimmy Montgomery was outstanding, defying Leeds with a string of fine saves and preserving his team's lead.", "|ST ||9 || Vic Halom"]}]}}