{"wiki_id": "http://www.wikidata.org/entity/Q7920843", "itemLabel": "Vera Woodhouse, Lady Terrington", "itemDescription": "British politician (1889-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vera_Woodhouse,_Lady_Terrington", "wikipedia_page": {"main": "Vera Florence Annie Woodhouse, Lady Terrington (née Bousher; 11 January 1889 – 19 May 1973) was a British Liberal Party politician, and one of the first women Members of Parliament (MP).", "link_mentions": [{"page": "Baron Terrington", "response": ["Baron Terrington, of Huddersfield in the County of York, is a title in the Peerage of the United Kingdom. It was created in 1918 for the former Liberal Member of Parliament for Huddersfield, Sir James Woodhouse, Kt. He was succeeded by his eldest son, the second Baron. His wife Vera Woodhouse, Lady Terrington, was one of the first female Members of Parliament. She represented Wycombe as a Liberal from 1923 to 1924. On the second Baron's death the titles passed to his younger brother, the third Baron. He notably served as a Deputy Speaker and Deputy Chairman of Committees in the House of Lords. His son, the fourth Baron, was also Deputy Chairman of Committees in the House of Lords. He had no sons and was succeeded by his younger brother, the fifth Baron. Known as Monty Woodhouse, he was a Conservative politician and an expert on Greek affairs.  the titles are held by his eldest son, the sixth Baron, who succeeded in 2001. He is a urologist."]}, {"page": "Vera Florence Annie Woodhouse", "response": ["#REDIRECT Vera Woodhouse, Lady Terrington"]}, {"page": "Lady Terrington", "response": ["#REDIRECT Vera Woodhouse, Lady Terrington"]}, {"page": "Vera Woodhouse", "response": ["#REDIRECT Vera Woodhouse, Lady Terrington"]}, {"page": "Vera Florence Annie Woodhouse, Lady Terrington", "response": ["#REDIRECT Vera Woodhouse, Lady Terrington"]}, {"page": "Vera Bousher", "response": ["#REDIRECT Vera Woodhouse, Lady Terrington"]}, {"page": "Vera (given name)", "response": ["* Vera Woodhouse, Lady Terrington (1889–1973), British Liberal Party politician"]}, {"page": "Woodhouse (surname)", "response": ["* Vera Woodhouse, Lady Terrington (1889–1956), British politician"]}]}}