{"wiki_id": "http://www.wikidata.org/entity/Q7926241", "itemLabel": "Victor Pike", "itemDescription": "Anglican Bishop of Sherborne", "wikipedia_url": "https://en.wikipedia.org/wiki/Victor_Pike", "wikipedia_page": {"main": "Victor Joseph Pike, CB, CBE (born 1 July 1907 and died 25 February 1986) was the Anglican Bishop of Sherborne in the third quarter of the 20th century. Pike was also an international rugby union player and represented Ireland in thirteen matches.", "link_mentions": [{"page": "Royal Army Chaplains' Department", "response": ["| 6 November 1951||1960 ||Victor Pike || Resigned"]}, {"page": "Bishop of Sherborne", "response": ["|Victor Pike "]}, {"page": "Pike (surname)", "response": ["*Victor Pike (1907–1986), Bishop of Sherborne and international rugby union player"]}, {"page": "Army Rugby Union", "response": ["*  Victor Pike"]}, {"page": "List of Ireland national rugby union players", "response": ["|Victor Pike"]}, {"page": "1931–32 South Africa rugby union tour of Britain and Ireland", "response": ["Ireland: Major Egan, Edward Lightfoot, Eugene Davy, Morgan Crowe, Joxer Arigho, Laurence McMahon, Paul Murray, Hal Withers, Victor Pike, Jimmy Farrell, Jack Russell, Jack Siggins, Noel Murphy, George Beamish (c), Jamie Clinch"]}, {"page": "Victor Joseph Pike", "response": ["#REDIRECT Victor Pike"]}, {"page": "Dunkirk Memorial", "response": ["The memorial panels were veiled with Union Flags, with a roll of drums accompanying the unveiling of each panel. The \"Last Post\" was played, as well as \"Lochaber No More\" (played on bagpipes). The religious service included a dedication of the memorial by the Chaplain-General to the Forces Victor Pike, prayers by the Principal Roman Catholic Chaplain, Monsignor Bernard Navin, and the singing of \"Land of Hope and Glory\". The guards of honour were provided by the Grenadier Guards and the French 33rd Infantry Regiment. Naval tribute was paid with a gun salute from the ships offshore, and the Royal Air Force salute was given by a flypast from a Hawker Hurricane fighter aircraft."]}, {"page": "Pike, Victor", "response": ["#redirectVictor Pike"]}, {"page": "St Aldhelm's Church, Radipole", "response": ["St Aldhelm's was dedicated by the Bishop of Sherborne, the Right Rev. Harold Rodgers, on 15 March 1941. The Bishop performed the ceremony on behalf of the Bishop of Salisbury, who was unable to attend due to illness. With further fundraising throughout the 1950s, a church hall of Reema construction was built behind the church and dedicated in 1961. It provided a number of community uses, including as a Sunday school and also contained a badminton court. In 1969, the Bishop of Sherborne, the Right Rev. Victor Pike, dedicated a new porch, and clergy and choir vestries, which were all built at the front of the church."]}]}}