{"wiki_id": "http://www.wikidata.org/entity/Q7933284", "itemLabel": "Violet Tillard", "itemDescription": "British suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Violet_Tillard", "wikipedia_page": {"main": "Violet Tillard (1874 – 19 February 1922) was a suffragette, nurse, pacifist, supporter of conscientious objectors, international famine relief worker and devout Quaker.", "link_mentions": [{"page": "List of suffragists and suffragettes", "response": ["* Violet Tillard (1874–1922) – nurse, pacifist, supporter of conscientious objectors, relief worker"]}, {"page": "Women's Freedom League", "response": ["The League's main objective was to criticise, oppose and reform the government. The League held protests that advocated pacifism during the First World War. Not only did the League oppose the war, but they also used peaceful forms of protest only such as refusing to complete census forms and not paying taxes. For example, in 1908 and 1909 the members chained themselves to various objects in Parliament in order to protest against the Government. On 28 October 1908, three members of the Women's Freedom League, Muriel Matters, Violet Tillard, and Helen Fox, released a banner at the House of Commons. The women also chained themselves to the grille above a window. Law enforcement had to remove the grille while they were still attached until they could file off the locks that held them connected to the window. This protest became known as the Grille Incident."]}, {"page": "Violet (given name)", "response": ["* Violet Tillard (1874-1922), suffragette, nurse, pacifist, conscientious objector supporter, famine relief worker, and Quaker"]}, {"page": "Muriel Matters", "response": ["In early May through to mid-October 1908, Matters was \"Organiser in Charge\" of the first \"Votes for Women\" caravan that toured the south east counties of England.Women's Freedom League 1908, Report for the Year 1908, London, p 13, held in the Suffragette Fellowship Collection, Museum of London. The caravan tour began in Oxshott and passed through Surrey, Sussex, East Anglia and Kent. The purpose of the tour was to speak about women's enfranchisement and establish new WFL branches in the region. Despite the occasional heckler, Matters and the others involved, such as Charlotte Despard and Amy Hicks, were successful in achieving these aims and established several branches. On this tour Matters met a young Quaker named Violet Tillard in Tunbridge Wells who remained a close acquaintance until Tillard's death in 1922, which was due to typhus contracted while helping people in famine-ravaged Russia. ", "Meanwhile, Violet Tillard lowered a proclamation to the politicians below using pieces of string and a man from the Stranger's Gallery threw handbills onto the floor of Parliament. The police soon seized all the people involved but could not separate Matters and Fox from the grille. Eventually the grille was removed completely with the women attached and, once escorted to a nearby committee room, a blacksmith was fetched to detach the women from the ironwork. Not charged over the incident, Matters and the other women involved were soon released near St Stephen's Entrance where they rejoined other members of the WFL who were still protesting. It was here that Matters was arrested on a \"trumped-up charge of obstruction\" trying to rush the Parliament's lobby.Mrs. Leonard W. Matters 1913, Australasians Who Count in London and Who Counts in Western Australia, Jas. Truscott & Son, Ltd., London, p. 164. The following day, 14 women (including Matters) and one man were tried at the Westminster Police Court. Matters was found guilty of wilfully obstructing London Police and was sentenced to one months imprisonment to be served at Holloway Gaol.\"Woman Suffrage – The Disorder at Westminster\", The Times, 30 October 1908, p. 9.", "Before sailing to Australia, Matters and fellow suffragette Violet Tillard, helped the Women's Freedom League campaign in Liverpool from January to April 1910, and she spoke with Amy Sanderson and Emma Sproson at a mass gathering in Trafalgar Square in April. From May to July 1910, Matters gave lectures focused on her experiences in Britain agitating for change. In the four-month tour, she spoke in Perth (Literary Hall), Adelaide (Town Hall), Melbourne (Princess Theatre) and Sydney (King's Hall). Giving three talks in each city she advocated for prison reform, equal pay for equal work and for the vote to be granted to the women of Great Britain.\"Address by Miss Muriel Matters\", The Advertiser, 1 August 1910, p. 9. Accompanied by Violet Tillard on the tour, Matters presented the audience with illustrations related to the movement and donned a facsimile of her prison dress. From the newspaper reports surrounding her visit it is evident that she played to sizeable audiences and that her performances were littered with laughter and applause.\"Through Women's Eyes\", The Register, 13 June 1910, p. 10."]}, {"page": "Tillard", "response": ["*Violet Tillard (1874−1922), English suffragette, nurse and pacifist"]}]}}