{"wiki_id": "http://www.wikidata.org/entity/Q7933044", "itemLabel": "Viola Tree", "itemDescription": "British actor-singer (1884-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Viola_Tree", "wikipedia_page": {"main": "Viola Tree (17 July 1884 – 15 November 1938) was an English actress, singer, playwright and author.  Daughter of the actor Herbert Beerbohm Tree, she made many of her early appearances with his company at His Majesty's Theatre.  Later she appeared in opera, variety, straight theatre and film.", "link_mentions": [{"page": "Herbert Beerbohm Tree", "response": ["Tree married actress Helen Maud Holt (1863–1937) in 1882; she often played opposite him and assisted him with management of the theatres.  Her charm also assisted the couple's entry into prominent social and élite artistic and intellectual circles.  Their daughters were actresses Viola Tree (who married theatre critic Alan Parsons) and Felicity Tree (who married Sir Geoffrey Cory-Wright, third baronet) and poet Iris Tree (who married Curtis Moffat, becoming Countess Ledebur). Tree also fathered several illegitimate children (six with Beatrice May Pinney), including film director Carol Reed and Peter Reed, father of the British actor Oliver Reed.Portrait of the Actor Herbert Beerbohm Tree, the Cyranos film website. Retrieved 23 September 2009 He was also the grandfather of Hollywood screenwriter and producer Ivan Moffat.\"Ivan Moffat\", obituary in The Telegraph, 3 August 2002. Retrieved 18 April 2012Ivan Moffat on the 'Genealogy of the Moffat Family' website"]}, {"page": "Savoy Theatre", "response": ["The Savoy Theatre closed in 1903, and was reopened under the management of John Leigh and Edward Laurillard from February 1904 (beginning with a musical, The Love Birds) to December 1906. The D'Oyly Carte Opera Company returned to the Savoy for repertory seasons between 1906 and 1909, in which year C. H. Workman took over the management of the theatre. He produced, among other works, Gilbert's final opera, with music by German, Fallen Fairies in 1909–10, which ran for only 51 performances.Rollins and Witts, p. 22 He also produced Two Merry Monarchs and Orpheus and Eurydice in 1910, the latter of which starred Marie Brema and Viola Tree in the title roles.Wearing, vol. 1, p. 24 The D'Oyly Carte Opera Company did not play in the theatre from 1909 until 1929,Rollins and Witts, pp. 22–154. instead touring throughout Britain and playing London seasons in other theatres; other works held the stage of the Savoy. George Augustus Richardson managed the theatre from November 1911 to February 1915. The Mikado's record as the Savoy's longest-running production was broken by the comedy Paddy the Next Best Thing by Gertrude Page, which played for 867 performances from April 1920.Gaye, p. 1536"]}, {"page": "Arthur Bliss", "response": ["In 1919, he arranged incidental music from Elizabethan sources for As You Like It at Stratford-on-Avon, and conducted a series of Sunday concerts at Lyric Theatre, Hammersmith, where he also conducted Pergolesi's opera La serva padrona. Viola Tree's production of The Tempest at the Aldwych Theatre in 1921, interspersed incidental music by Thomas Arne and Arthur Sullivan, with new music by Bliss for an ensemble of male voices, piano, trumpet, trombone, gongs and five percussionists dispersed through the theatre.Evans, Edwin. \"Arthur Bliss\". The Musical Times, February 1923, pp. 95–99, accessed 21 March 2011 "]}, {"page": "Christopher R. W. Nevinson", "response": ["Nevinson's boasting and exaggerated claims concerning his war experiences, together with his depressive and temperamental personality, made him many enemies in both the US and Britain. Roger Fry of the Bloomsbury Group was a particularly virulent critic. In 1920, the critic Charles Lewis Hind observed in his catalogue introduction to an exhibition of Nevinson's recent work: 'It is something, at the age of thirty one, to be among the most discussed, most successful, most promising, most admired and most hated British artists.' In September 1920, Nevinson designed a poster for a production, by Viola Tree, of The Unknown by Somerset Maughan which showed bombs exploding around a crucifix. The image was deemed to be offensive and was banned from display on the London Underground. Nevinson distributed the poster outside the theatre and gained a great deal of press coverage in the process."]}, {"page": "Iris Tree", "response": ["Tree's parents were actors Sir Herbert Beerbohm Tree and Helen Maud, Lady Tree. Her sisters were actresses Felicity and Viola Tree. An aunt was author Constance Beerbohm, and her uncles were explorer and author Julius Beerbohm and caricaturist and parodist Max Beerbohm."]}, {"page": "Hermione Gingold", "response": ["Gingold's professional début was in 1908 when she had just turned 11. She played the herald in Herbert Beerbohm Tree's production of Pinkie and the Fairies by W. Graham Robertson, in a cast including Ellen Terry, Frederick Volpe, Marie Löhr and Viola Tree.\"At the Play: His Majesty's Pinkie and the Fairies\", The Observer 20 December 1908, p. 7 She was promoted to the leading role of Pinkie for a provincial tour.Sherrin, Ned, \"Gingold, Hermione Ferdinanda (1897–1987)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 3 October 2013  Tree cast her as Falstaff's page, Robin, in The Merry Wives of Windsor. She attended Rosina Filippi's stage school in London. In 1911, she was cast in the original production of Where the Rainbow EndsNew York Times obituaries Hermione Gingold  which opened to very good reviews on 21 December 1911."]}, {"page": "A Woman of No Importance", "response": ["A production toured the British provinces in the latter part of 1893, with a cast headed by Lewis Waller as Lord Illingworth.\"'A Woman of No Importance' On Tour\", The Sketch, 6 September 1893, p. 8 After the first London run, the play was next seen in the West End when Tree staged a revival at His Majesty's Theatre. The production ran for 45 performances from 22 May 1907; Tree again played Illingworth, Marion Terry played Mrs Arbuthnot, and the cast included Kate Cutler, Viola Tree, Charles Quartermaine and Ellis Jeffreys.Wearing (1981), p. 562 The Liverpool Playhouse company presented the play during a London season in 1915.\"Kingsway Theatre\", Westminster Gazette 11 May 1915, p. 3 A revival at the Savoy Theatre in 1953 was, in the view of the critic J. C. Trewin, marred by cuts and inauthentic additions to Wilde's text; Clive Brook was Illingworth and the cast included Athene Seyler, Jean Cadell, Isabel Jeans and William Mervyn.Trewin, J. C. \"At the Theatre\", The Sketch, 25 February 1953, p. 148 There were revivals at the Vaudeville Theatre, London (1967), the Chichester Festival (1978), the Abbey Theatre, Dublin (1996), the Barbican, London (1991) and the Haymarket (2003).Billington, Michael. \"Oscar Wilde at his weakest\", The Times, 29 November 1967, p. 11; \"Chichester's A Woman of No Importance\", The Times, 3 May 1978, p. 5; Clancy, Luke. \"Flat champagne\", The Times, 17 June 1996, p. 18; and Nightingale, Benedict. \"A lifeless lesson in pretty wit\", The Times, 17 September 2003, p. 19 A revival at the Vaudeville in 2017, starring Dominic Rowan and Eve Best, ran from October to December.\"A Woman of No Importance\", This is Theatre. Retrieved 15 April 2021"]}, {"page": "Gerald du Maurier", "response": ["* The Dancers by Viola Tree (1923)"]}, {"page": "List of caricatures at Sardi's", "response": ["* Lady Viola Tree"]}, {"page": "Violet Bonham Carter", "response": ["Mrs. Raymond Asquith [...] was the leading spirit of the coterie of \"Young Souls\" which comprised as its members Lady Marjorie and Lady Violet Manners, Miss Cicely Horner, Miss Violet Asquith, and Miss Viola Tree."]}, {"page": "Madge Kendal", "response": ["Shaw judged that \"her finish of execution, her individuality and charm of style, her appetisingly witty conception of her effects, her mastery of her art and of herself [make] her still supreme among English actresses in high comedy\". The biographer Richard Foulkes writes that the supremacy of which Shaw wrote was put to the test when Tree invited Kendal and Ellen Terry to appear together in The Merry Wives of Windsor, as Mistress Ford and Mistress Page respectively, at His Majesty's Theatre in 1902. This was the first time Kendal appeared in a production without W. H. Kendal since their marriage, and Foulkes speculates that her \"unwonted exuberance and apparent spontaneity\" may have been attributable to that fact. The Kendals continued to appear in popular plays without interruption until 1908, when they both retired, though she briefly emerged from retirement to reprise her Mistress Ford at the coronation gala of 1911 at His Majesty's. In 1924 she made her first radio broadcast, opposite Viola Tree, in Granny's Juliet, and she later took the title part of her ancestor, Sarah Siddons, in a comedy, A Lesson from Mrs Siddons, together with other descendants of Mrs. Siddons, in a radio broadcast on 28 November 1931 to mark the centenary of Siddons' death\"Mirror of the B.B.C.\", Popular Wireless, 28 November 1931, pp. 764 and 766; and \"Broadcasting\", Western Morning News, 28 November 1931, p. 8 on the day that Tree took over her role."]}, {"page": "Broadhurst Theatre", "response": ["*1923: The Dancers by Gerald du Maurier and Viola Tree, starring Richard Bennett"]}, {"page": "The White Devil", "response": ["In 1925 the Renaissance Theatre mounted a heavily cut version featuring Viola Tree and Cedric Hardwicke. The production was not well reviewed, perhaps mainly because of a failure to understand the special requirements of Renaissance dramaturgy. Webster scholar F. L. Lucas asked in the New Statesman, \"Who can hope to speak passionate verse lying on one elbow on the floor?\"New Statesman, 17 October 1925"]}, {"page": "Pygmalion (1938 film)", "response": ["* Viola Tree as Perfide, Social Reporter "]}, {"page": "F. Matthias Alexander", "response": ["Actress Viola Tree (1885–1938, daughter of Herbert Beerbohm Tree), autographed a full-length photo \"To Matthias Alexander with many thanks from Viola Tree 1909\"."]}, {"page": "David Tree", "response": ["Tree was born in Welwyn Garden City, Hertfordshire, the son of theatre critic Alan Parsons and actress Viola Tree, the daughter of renowned Victorian actor-manager Sir Herbert Beerbohm Tree. The young performer's first exposure to the stage came at the age of six, when he played a bear in his mother's 1921 revival of The Tempest at the Aldwych Theatre in London and continued through his childhood years, as exemplified by his portrayal, at eleven-and-a-half, of Lieutenant Spicer in a January 1927 juvenile production of Quality Street."]}, {"page": "Hugo Rumbold", "response": ["Rumbold was commissioned by Rupert D'Oyly Carte to dress a 1918 revival of Gilbert and Sullivan's Patience, in succession to W. S. Gilbert, who designed the original costumes, and Percy Anderson, who dressed the 1907 revival. Some of Rumbold's costumes (for the \"everyday young girls\") were retained by the D'Oyly Carte Opera Company until Peter Goffin's new designs were introduced in 1957.Rollins and Witts, Appendix, pp. vii and viii For Sir Thomas Beecham, Rumbold designed revivals of La fille de Madame Angot, by Lecocq, and Mozart's Le Nozze di Figaro staged at the Theatre Royal, Drury Lane in 1919.The Times, 30 June 1919, p. 10 In the same year he designed the first British production of Ravel's L'heure espagnole for Covent Garden.\"Hugo Rumbold\", The Daily Mail, 21 November 1932, p. 10 Rumbold designed a revival of Bernard Shaw's Arms and the Man at the Duke of York's Theatre in 1919,The Times, 12 December 1919, p. 12 and The Tempest for Viola Tree's company at the Aldwych Theatre in 1921.The Times, 2 February 1921, p. 8"]}, {"page": "List of British people with German ancestry", "response": ["* Viola Tree, actress; daughter of Herbert Beerbohm Tree"]}, {"page": "Heart's Desire (1935 film)", "response": ["* Viola Tree as Lady Bennington"]}, {"page": "Felicity Tree", "response": ["Born in Chelsea, London, in 1894,Felicity Tree, England & Wales, Free BMD Birth Index, 1837–1915, Ancestry.com (pay to view) Tree was the middle daughter of the actor Sir Herbert Beerbohm Tree and his wife, the actress Helen Maud Holt. She was the sister of Viola Tree and Iris Tree, and the niece of the author Constance Beerbohm, the caricaturist and parodist Max Beerbohm, and the engineer and explorer Julius Beerbohm. Her grandson is Richard Cory-Wright, 4th Baronet Cory-Wright.Charles Mosley, editor, Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes (Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003), Vol. 1, pp. 906–907"]}, {"page": "Beerbohm family", "response": ["::::* Viola Tree (1884–1938) married drama critic, Alan Leonard Romaine Parsons (1889–1933). Their children were:"]}, {"page": "Bright young things", "response": ["|Viola Tree (1884–1938)"]}, {"page": "Philip Tonge", "response": ["In September 1908 Tonge was cast as Freddy in The Sway Boat at the Kingsway Theatre, London, and in December of the same year he had the important role of Tommy in Tree's Christmas family play, Pinkie and the Fairies. The cast was headed by Ellen Terry, and included Frederick Volpe, Marie Löhr, Viola Tree and the young Hermione Gingold.\"At the Play: His Majesty's – Pinkie and the Fairies\", The Observer 20 December 1908, p. 7 The following year he was in A Boy's Proposal, a curtain-raiser for Galsworthy's Strife at the Adelphi. The reviewer in The Times called Tonge \"a remarkable boy\" and commented, \"Nothing more natural and more accompllshed than this youngster in an Eton jacket could be imagined, and the piece is well worth seeing for his amusing performance alone.\"\"Adelphi Theatre\", The Times, 30 May 1909, p. 13  In 1911 Tonge and Mary Glynne had the principal children's roles in a comic opera, The Love Mills at the Globe.\"Globe Theatre\", The Times, 4 October 1911, p. 6"]}, {"page": "The Gay Lord Quex (play)", "response": ["The play has had several West End revivals. The first was at the Duke of York's Theatre in 1902,Parker, p. 1104 followed by productions at Wyndham's Theatre in 1905Parker, p. 344 and the Garrick in 1908, Sir John Hare's farewell production of the piece, in which he played Quex to the Sophy of Nancy Price.Parker, p. 755 A production at His Majesty's in 1923 was directed by Basil Dean and starred George Grossmith Jr. as Quex, Irene Browne as Sophy and Viola Tree as the Duchess.Parker, p. lviii In 1975 Sir John Gielgud directed a production at the Albery Theatre, with Daniel Massey in the title role, Judi Dench as Sophy and Siân Phillips as the Duchess.Kingston, Jeremy. \"The Gay Lord Quex\", The Times, 17 June 1975, p. 11 An American production in 1917 was presented at the Thirty-Ninth Street Theatre, New York, with John Drew Jr. as Quex and Margaret Illington as Sophy.Parker, pp. 274 and 478"]}, {"page": "Ellis Jeffreys", "response": ["On her return to England Jeffreys appeared at His Majesty's Theatre, in May 1907, as Mrs Allonby in A Woman of No Importance in a cast that also contained Herbert Beerbohm Tree, Marion Terry, Kate Cutler and Viola Tree.\"At the Play\", The Observer, 19 May 1907, p. 4 In October 1907 Jeffreys appeared in the opening production of the Queen's Theatre in Madeleine Lucette Ryley's comedy The Sugar Bowl, under her husband's management. Also with Sleath's company she toured in Edwin Milton Royle's A White Man. At His Majesty's in 1909 Jeffreys played a part some way removed from her usual agreeable and attractive characters, appearing as the vicious Lady Sneerwell in Tree's production of The School for Scandal. Reviews were good,\"The School for Scandal\", The Daily News, 8 April 1909, p. 6; and \"Sheridan at His Majesty's\", The Era, 10 April 1909, p. 17 and although The Athenaeum thought Jeffreys adopted \"perhaps rather too gentle a manner to suggest the widow's acidity of temper\",\"His Majesty's\", The Athenaeum, 17 April 1909, pp. 474–475 The Morning Post found her \"agreeably disagreeable\".\"His Majesty's Theatre\", The Morning Post, 8 April 1909, p. 6", "Later roles included Mrs Quesnel in The Case of Rebellious Susan and Madge Bolt in Is Matrimony a Failure? at the Criterion (1911), Comtesse Zicka in a revival of Diplomacy at Wyndham's (1913) and Mrs Cameron in The Flag Lieutenant at the Haymarket (1914). At the Globe, Jeffreys played the Countess Olga in Fedora in 1920 and Emily Ladew in Her Husband's Wife in 1921. The following year she was seen at Drury Lane as the Lady Violante in Decameron Nights. Other roles included Lady Frinton in The Last of Mrs Cheyney at the St James's in 1925, Lady Trench in Frederick Lonsdale's Never Come Back with Allan Aynesworth, Viola Tree and the young Raymond Massey at the Phoenix Theatre in 1932 and Lady Mary Crabb in Fresh Fields at the Criterion in 1933.\"Obituary: Ellis Jeffreys\", The Stage, 28 January 1943, p. 5"]}, {"page": "Frederick Volpe", "response": ["Between the turn of the century and the First World War, Volpe's roles included Pecksniff in Tom Pinch, based on Martin Chuzzlewit (1903), Lord Amersteth in a play based on the Raffles stories (1906), Paul Bultitude in a stage version of Vice Versa, and Alexis in The Girl in the Taxi (1913). Among his post-war roles were Chancellor Teppich in The Prisoner of Zenda (1923), Mr Cattermole in The Private Secretary (1923)Parker, pp. 951–952 and Sir Joshua Grimshaw in The Truth Game in a starry cast including Lily Elsie, Ivor Novello, Lilian Braithwaite, Viola Tree and Glen Byam Shaw (1928).\"Globe Theatre\", The Times, 6 October 1920, p. 10"]}, {"page": "Helen Maud Holt", "response": ["Helen Maud Holt (5 October 1863The Who's Who entry for \"Lady Tree\", and the obituary notice in The Observer give the year as 1864; the obituaries in The Times, The Manchester Guardian and the Oxford Dictionary of National Biography give her year of birth as 1863. FreeBMD gives the year as 1858 – 7 August 1937), professionally known as Mrs Beerbohm Tree and later Lady Tree, was an English actress. She was the wife of the actor Sir Herbert Beerbohm Tree and the mother of Viola Tree, Felicity Tree and Iris Tree."]}, {"page": "The Dancers (1930 film)", "response": ["The Dancers is a 1930 American pre-Code melodrama, produced and distributed by Fox Film Corporation, and directed by Chandler Sprague.The Dancers Detail View, AFI.com; accessed August 9, 2015. It is based on a 1923 West End play of the same title by Viola Tree and Gerald du Maurier.The Dancers details, ibdb.com; accessed August 9, 2015. The film marks the feature sound film debut of actress Mrs. Patrick Campbell. The setting was shifted from the play's South America to Canada."]}, {"page": "1938 in British music", "response": ["*15 November – Viola Tree, actress, singer and playwright, 54 (pleurisy)The Times, obituary, 16 November 1938, p. 9."]}]}}