{"wiki_id": "http://www.wikidata.org/entity/Q793617", "itemLabel": "Bernard Longley", "itemDescription": "Catholic archbishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Longley", "wikipedia_page": {"main": "Bernard Longley  (born 5 April 1955) is an English prelate of the Roman Catholic Church. He was named the Archbishop of Birmingham on 1 October 2009, and installed by Bishop David McGough and presented with his crozier by Archbishop Vincent Nichols, his predecessor, in St Chad's Cathedral at a Solemn Mass on 8 December 2009, the Feast of the Immaculate Conception, attended by 600 people. Previously he was an Auxiliary Bishop of Westminster.", "link_mentions": [{"page": "April 5", "response": ["*  1955   – Bernard Longley, English prelate"]}, {"page": "Staffordshire", "response": ["Staffordshire is part of the Roman Catholic Archdiocese of Birmingham. The current archbishop is Bernard Longley."]}, {"page": "Monks Kirby", "response": ["The nineteenth century convent buildings in the village of Monks Kirby have now been converted to housing but a new church, St Joseph's Church, was built in the 1990s to a design by the architect John Holmes. This church was consecrated by the Archbishop of Birmingham, Bernard Longley, on 11 July 2012, the feast of St Benedict.  St Joseph's continues to be a worshipping community today, with a large congregation gathering on Sundays from the parish which spreads beyond the small village of Monks Kirby. There is also a daily Mass in the parish. Planning permission has been granted for a small church hall, to be built on land to the rear of the Church."]}, {"page": "Archbishop of Birmingham", "response": ["The current archbishop is The Most Reverend Bernard Longley, who was appointed the ninth archbishop of Birmingham on 1 October 2009 and installed at the Metropolitan Cathedral and Basilica of Saint Chad on 8 December 2009, the Solemnity of the Immaculate Conception and one of the patronal feasts of the archdiocese, St Chad being the other.", "| Bernard Longley"]}, {"page": "Xaverian College", "response": ["* Bernard Longley: Roman Catholic Archbishop of Birmingham from 2009"]}, {"page": "Roman Catholic Diocese of Westminster", "response": ["*Bernard Longley (2003–2009), appointed Archbishop of Birmingham"]}, {"page": "Roman Catholic Diocese of Arundel and Brighton", "response": ["*Bernard Longley, appointed auxiliary bishop of Westminster in 2003"]}, {"page": "Roman Catholic Archdiocese of Birmingham", "response": ["The Archbishop is Bernard Longley, who was named the ninth Archbishop of Birmingham on 1 October 2009. He succeeds the Archbishop of Westminster, Cardinal Vincent Nichols (2000–09). Bishop Longley was installed as Archbishop of Birmingham at the Metropolitan Cathedral and Basilica of Saint Chad on 8 December 2009, the Solemnity of the Immaculate Conception and one of the patronal feasts of the Archdiocese, St Chad being the other.", "The Archbishop of Birmingham, the Most Reverend Bernard Longley, has overall episcopal oversight of the diocese that is divided into three pastoral areas, each of which is headed by an auxiliary bishop and contains a number of deaneries:", "* Bernard Longley (2009–present)"]}, {"page": "Anglican–Roman Catholic International Commission", "response": ["* Most Rev Bernard Longley, Archbishop of Birmingham (Roman Catholic)"]}, {"page": "Maryvale Institute", "response": ["The Institute is part of the Archdiocese of Birmingham, its president being the Most Reverend Bernard Longley, Archbishop of Birmingham.  Its Doctoral (PhD) programme is accredited by Liverpool Hope University. Its Bachelor of Arts and Master's programmes are accredited by the Open University. The validator of the Bachelor of Divinity and Licence in Catechetics programmes is the Faculté-Notre Dame, at the École Cathédrale de Paris. Maynooth Pontifical University, which it was affiliated to accredited a number of programmes in Maryvale.Other Canonical Degrees Statues of the Pontifical University, Maynooth College, October 1, 1998. As well as Maynooth and the Open University,'Catholics in England 1950-2000: Historical and Sociological Perspectives' edited by Michael Hornsby-Smith, page 15, A & C Black, 1999 the institute was also an associated college of Hull University.'British Qualifications: A Complete Guide to Educational, Technical, Professional and Academic Qualifications in Britain, 34th Edition' Kogan Page Publishers, 2004 In 2011 Maryvale under new guidelines from the Vatican became the first Higher Institute of Religious Sciences in English-speaking world, and became associated with Notre Dame ecclesiastic faculty.Vatican names Maryvale first Higher Institute of Religious Sciences in English-speaking world Independent Catholic News, Jun 16th, 2011."]}, {"page": "St Chad's Cathedral, Birmingham", "response": ["The Metropolitan Cathedral Church and Basilica of Saint Chad is the mother church of the Archdiocese of Birmingham and province of the Catholic Church in Great Britain and is dedicated to Saint Chad of Mercia. Designed by Augustus Welby Pugin and substantially complete by 1841, St Chad's is one of the first four Catholic churches that were constructed after the English Reformation and raised to cathedral status in 1852.Decree of the Sacred Congregation for the Propagation of the Faith, 21 April 1852. The other churches raised to cathedrals by this decree were St George's, Southwark, St Barnabas, Nottingham and St John's, Salford: Decreta Quatuor Conciliorum Provincialium Westmonasteriensium, (2nd Edn, London: Burns & Oates), p.56; translation in: Robert Guy OSB, The Synods in English (Stratford-on-Avon: St Gregory Press, 1886) p.101. It is one of only four minor basilicas in England (the others being Downside Abbey, the National Shrine of Our Lady at Walsingham and Corpus Christi Priory, this last now disused). St Chad's is a Grade II* listed building. The cathedral is located in a public greenspace near St Chad's Queensway, in central Birmingham. The current archbishop is Bernard Longley, and the dean is Monsignor Timothy Menezes.", "In 1941 St Chad's was declared a Minor Basilica by Pope Pius XII as a church of important historical connections: only one of two such in England. On formal occasions, the , a golden lattice bell tower and , which is a small red and gold striped umbrella, are displayed at the altar steps as the official symbols of a basilica. The last Archbishop was Vincent Nichols, who served from 2000–09, and then became Archbishop of Westminster.  the Archdiocese of Birmingham was led by Bernard Longley, titular bishop of Zanda, who was named as the Archbishop on 1 October 2009, and was installed in his cathedral by Bishop David McGough (Auxiliary Bishop of Birmingham incharge of the North Staffordshire region of the Archdiocese), and presented with his crozier by his predecessor Archbishop Nichols on the Feast of the Immaculate Conception, 8 December 2009."]}, {"page": "Newman University, Birmingham", "response": ["In 2018, the university started a year of celebrations to mark the fiftieth anniversary of its foundation. On 13 February 2018, the university vice chancellor, Professor Scott Davidson, opened the year of events with a drinks reception at the Bartley Green campus. Davidson told visitorsIt’s incredible to look back over our evolution since we first opened our doors in 1968 as a teacher training college. Whilst we still have a strong reputation within that field, I’m proud that we are now able to offer a range of undergraduate, postgraduate and foundation degree courses and welcome students and staff of all religions.In attendance were local business leaders, former students and the Archbishop of Birmingham, Bernard Longley. The university called on its former students to share their memories in an online campaign. As part of the celebrations, the university hosted the Cathedrals Group Choirs Festival. Rehearsals took place in the university chapel while the final performance was held in Birmingham Symphony Hall."]}, {"page": "Clive Dytor", "response": ["He was ordained deacon at Oscott on 9 December 2019 by Bishop Mark Davies.https://www.facebook.com/pg/oscottcollege/posts/ and ordained priest at St Chad's Cathedral, Birmingham on 12 September 2020 by Archbishop Bernard Longley, 30 years after entering the Anglican ministry."]}, {"page": "Alan Hopes", "response": ["On 4 January 2003, at the age of 58, he was appointed an auxiliary bishop of Westminster, making him one of the most senior members of Catholic clergy to have converted in the 1990s. On 24 January 2003 he received episcopal consecration, along with the now Archbishop Bernard Longley, in Westminster Cathedral from Cardinal Cormac Murphy-O'Connor. The principal co-consecrating bishops were Bishop Arthur Roche of Leeds and Bishop Kieran Conry of Arundel and Brighton."]}]}}