{"wiki_id": "http://www.wikidata.org/entity/Q7931569", "itemLabel": "Vince O'Keefe", "itemDescription": "English footballer (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vince_O%27Keefe", "wikipedia_page": {"main": "James Vincent O'Keefe (born 2 April 1957) is an English former professional footballer. He played as a goalkeeper for a number of Football League clubs between 1974 and 1993, making over 400 appearances.", "link_mentions": [{"page": "Derek Bellotti", "response": ["He only stayed at the Vetch Field for one season, playing 19 times in the league, before moving back into non-league football with Maidstone United, spending two months on loan at Margate from January 1978. He subsequently moved to Cornish non-league side St Blazey from where he signed for Torquay United in September 1981 as cover for Vince O'Keefe. In 1982, he left without making a league appearance, joining Falmouth Town. He subsequently played for Bideford, Saltash United, Newquay, and Torrington."]}, {"page": "Barry Siddall", "response": ["In 1986, Siddall returned to Blackpool, this time on a permanent basis. Sam Ellis was still in charge of the Bloomfield Road club, now a division higher, and Siddall went on to make 37 appearances during the 1986–87 season, as the club finished ninth in the Third Division. He was also first-choice during 1987–88, making 38 appearances, but in 1988–89 he was dropped a couple of times in favour of his deputies, Gary Kelly and Vince O'Keefe. He still made 35 starts in the league, however, but was sold at the end of the season to Stockport County."]}, {"page": "Wrexham A.F.C. 2–1 Arsenal F.C.", "response": ["Arsenal got the game underway and won the first corner of the match. Taken by Paul Merson, the ball was flicked on at the near post by O'Leary and reached Alan Smith. The forward's header was obstructed by a Wrexham player, who proceeded to clear it out. It did not take long for Arsenal to create another chance; Nigel Winterburn played the ball down the left side of the pitch, finding Merson who ran in towards the penalty area and produced a cross. The ball was cleared, but reached Carter whose effort near the penalty spot went wide of the right-side post. Wrexham managed to get into the opposition's area and create half-chances, but then Arsenal broke forward again with Kevin Campbell having a shot on target. Gareth Owen nearly scored the opener, when he controlled the ball from a flick on and instinctively took a shot that whistled past the post. Two minutes before the interval, Arsenal took the lead. Merson surged forward into the penalty area and his cross was met Smith who slid the ball past goalkeeper Vince O'Keefe. Wrexham almost equalised immediately from the restart, but David Seaman denied Steve Watkin by rushing towards the midfielder and obstructing him.", "|GK ||1 || Vince O'Keefe"]}]}}