{"wiki_id": "http://www.wikidata.org/entity/Q7944059", "itemLabel": "Vyvyan Holt", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Vyvyan_Holt", "wikipedia_page": {"main": "Captain Sir Vyvyan Holt   (1896 – 2 July 1960) was a British soldier, diplomat, and Oriental scholar, who was held captive by North Korea for nearly three years during the Korean War.", "link_mentions": [{"page": "Royal Society for Asian Affairs", "response": ["* Vyvyan Holt (1887–1960), diplomat and Oriental scholar, who was captured during the Korean War"]}, {"page": "George Blake", "response": ["After he reached Britain, Blake joined the Royal Navy as a sub-lieutenant before being recruited by the Secret Intelligence Service (MI6) in 1944. For the rest of the war, Blake was employed in the Dutch Section. He intended to marry an MI6 secretary, Iris Peake, but her family prevented the marriage because of Blake's Jewish background and the relationship ended. In 1946, he was posted to Hamburg and put in charge of the interrogation of German U-boat captains. In 1947, the Navy sent Blake to study languages, including Russian, at Downing College, Cambridge, where his fellow students included the future foreign policy analyst Michael MccGwire.Phillip Knightley, \"Double agent sentenced to 42 years for doing untold damage in the Cold War\" , The Daily Telegraph (27 September 2006). Retrieved 3 October 2018. He was posted thereafter to the British legation in Seoul, South Korea, under Vyvyan Holt, arriving on 6 November 1948. Under cover as a vice-consul, Blake's mission was to gather intelligence on Communist North Korea, Communist China, and the Soviet Far East."]}, {"page": "Stewart Perowne", "response": ["Perowne later served in Malta, Aden, Iraq, Barbados, Libya and Israel.Perowne's obituary in The New York Times 16 May 1989 He was awarded the Coronation Medal in 1937. In 1938 Perowne worked for the BBC, preparing talks and features for transmission by the overseas Arabic service. In the same year he deposited a collection of potsherds with the British Museum, most of which are of Bronze Age type and probably derive from the ancient site of Subr. In 1939 he was appointed Public Information Officer in Aden, where he developed a passion for archaeology, and where he discovered the seventh century BC sites of Imadiya and Beihan.Perowne, Stewart 'Im'adiya and Beihan, Aden Protectorate', Antiquity No. 13 (1939), pp. 133–37) In 1941 Perowne was appointed Public Relations Officer to the British embassy in Baghdad. In 1944 he succeeded the scholar Vyvyan Holt as oriental counsellor."]}, {"page": "Vivian (personal name)", "response": ["* Vyvyan Holt (1896–1960), British soldier, diplomat, and Oriental scholar"]}, {"page": "List of ambassadors of the United Kingdom to South Korea", "response": ["*1949–1954: Captain Vyvyan Holt (consul-general from 1948)."]}, {"page": "List of ambassadors of the United Kingdom to El Salvador", "response": ["*1954–1956: Vyvyan Holt"]}, {"page": "1956 Birthday Honours", "response": ["* Vyvyan Holt, CMG, MVO, lately Her Majesty's Minister at San Salvador."]}, {"page": "1939 Birthday Honours", "response": ["* Captain Vyvyan Holt, , Oriental Secretary at His Majesty's Embassy at Baghdad."]}, {"page": "List of people from Norwich", "response": ["*Sir Vyvyan Holt (1896–1960), diplomat, orientalist and British minister, captured during the Korean War"]}]}}