{"wiki_id": "http://www.wikidata.org/entity/Q7940855", "itemLabel": "William Adolphus Knell", "itemDescription": "English marine painter, 1802-1875", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Adolphus_Knell", "wikipedia_page": {"main": "William Adolphus Knell (1801–1875) was a successful British maritime painter of the 19th century.", "link_mentions": [{"page": "William Knell", "response": ["* William Adolphus Knell (1801–1875), British maritime painter"]}, {"page": "William Calcott Knell", "response": ["He was the son of William Adolphus Knell (1801-1875),\"England Marriages, 1538–1973\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:N6X8-W8L : accessed 2 April 2016 who also worked as a marine painter. The influence of his father is evident in the composition and execution of his motifs. However, Knell was also inspired by other contemporaries. He painted mainly coastal scenes with boats. With great skill, Knell managed to capture the changing ambiances of the day and render his impressions of nature. Between 1848 and 1865 Knell showed his works at the Royal Academy, the Society of British Artists, and the British Institution.http://auctionata.com/o/62944/wc-knell-1830-1876-fishing-boats-off-portsmouth-19th-c?cat=shop/paintings"]}, {"page": "Knell", "response": ["* William Adolphus Knell (1801–1875), British maritime painter"]}, {"page": "John Luard", "response": ["Some of Luard's sketches were used to illustrate Wanderings of a Pilgrim in Search of the Picturesque (1850) by Fanny Parkes (Fanny Parlby), who had commissioned him as a watercolour artist. In 1851 at the Asiatic Gallery, Baker Street Bazaar, Portman Square, London, the \"Grand Moving Diorama of Hindostan\" comprised 60 drawings arranged by Luard. The artists creating the diorama included Louis Haghe, who did the \"figures and animals\", and William Adolphus Knell the \"shipping\"; the panoramic setting was by Philip Phillips. Luard based the material on his own sketches, and on those of Parkes, and eight others were credited."]}, {"page": "Parliamentary Art Collection", "response": ["File:Cape St Vincent1797 300.jpg|Battle off Cape St Vincent, 1797, by William Adolphus Knell (1846)"]}]}}