{"wiki_id": "http://www.wikidata.org/entity/Q7945401", "itemLabel": "W. C. Sellar", "itemDescription": "British humorist (1898-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/W._C._Sellar", "wikipedia_page": {"main": "Walter Carruthers Sellar (27 December 1898 – 11 June 1951) was a Scottish humourist who wrote for Punch. He is best known for the 1930 book 1066 and All That, a tongue-in-cheek guide to \"all the history you can remember,\" which he wrote together with R. J. Yeatman.", "link_mentions": [{"page": "1066 and All That", "response": ["1066 and All That: A Memorable History of England, Comprising All the Parts You Can Remember, Including 103 Good Things, 5 Bad Kings and 2 Genuine Dates is a tongue-in-cheek reworking of the history of England. Written by W. C. Sellar and R. J. Yeatman and illustrated by John Reynolds, it first appeared serially in Punch magazine, and was published in book form by Methuen & Co. Ltd. in 1930."]}, {"page": "List of historians", "response": ["*W. C. Sellar (1898–1951), co-author of 1066 and All That"]}, {"page": "1898 in literature", "response": ["*December 27 – W. C. Sellar, English humorous writer (died 1951)"]}, {"page": "1930 in literature", "response": ["*W. C. Sellar and R. J. Yeatman – 1066 and All That"]}, {"page": "1951 in literature", "response": ["*June 11 – W. C. Sellar, Scottish humorist (born 1898)"]}, {"page": "R. J. Yeatman", "response": ["Robert Julian Yeatman (15 July 1897 – 13 July 1968) was a British humorist who wrote for Punch. He is best known for the book 1066 and All That, a tongue-in-cheek guide to \"all the history you can remember\", which he wrote with W. C. Sellar.", "All of the following books were co-authored with W. C. Sellar:"]}, {"page": "Walter C. Sellar", "response": ["#REDIRECT W. C. Sellar"]}, {"page": "W.C. Sellar", "response": ["#REDIRECTW. C. Sellar"]}, {"page": "Will Cuppy", "response": ["** (1937) Garden Rubbish and Other Country Bumps by W. C. Sellar and R. J. Yeatman; with footnotes by Will Cuppy. New York: Farrar & Rinehart."]}, {"page": "Beverley Nichols", "response": ["Nichols is best remembered for his books about his homes and gardens, the first of which, Down the Garden Path (1932), was illustrated by Rex Whistler, as were its two sequels. It went through 32 editions and has remained in print almost continuously. The trilogy chronicled the difficulties and delights of maintaining a Tudor thatched cottage in Glatton, Cambridgeshire, the village he fictionalised as Allways. The books are written in a poetic, richly creative style, evoking emotional and sensual responses, leavened with humour and irony.Down the Garden Path (1932)  The three books were so popular that they led to  humorous imitations, including Mon Repos (1934) by \"Nicholas Bevel\" (a parody by Muriel Hine) and Garden Rubbish (1936) by W. C. Sellar and R. J. Yeatman, a satire on garden writers, which included a Nichols-like figure named \"Knatchbull Twee.\""]}, {"page": "Richard Armour", "response": ["Armour's books are typically written in a style parodying dull academic tomes, with many footnotes (funny in themselves), fake bibliographies, quiz sections, and glossaries. This style was pioneered by the British humorists W. C. Sellar and R. J. Yeatman with their parody of British history 1066 and All That in the 1930s."]}, {"page": "List of Oriel College, Oxford, people", "response": ["*W. C. Sellar & R. J. Yeatman – Undergraduates 1919 to 1922: Humorists, authors of 1066 and All That."]}, {"page": "1951 in the United Kingdom", "response": ["* 11 June – W. C. Sellar, humourist (born 1898)"]}, {"page": "1898 in the United Kingdom", "response": ["* 27 December – W. C. Sellar, humorist (died 1951)"]}, {"page": "1930 in the United Kingdom", "response": ["* W. C. Sellar and R. J. Yeatman's parodic history book 1066 and All That."]}, {"page": "W C Sellar", "response": ["#REDIRECT W. C. Sellar "]}, {"page": "WC Sellar", "response": ["#REDIRECT W. C. Sellar "]}, {"page": "Walter Carruthers Sellar", "response": ["#REDIRECT W. C. Sellar"]}, {"page": "How They Brought the Good News from Ghent to Aix", "response": ["W. C. Sellar and R. J. Yeatman parodied Browning's poem in their book Horse Nonsense as \"How I Brought the Good News from Aix to Ghent (or Vice Versa)\".Sherrin, Ned. Introduction. 1066 and All That: A Memorable History of England. By W. C. Sellar and R. J. Yeatman. 2nd ed. Avon: The Bath Press, 1940."]}, {"page": "Sellar", "response": ["* W. C. Sellar (1898-1951), Scottish humourist "]}, {"page": "List of people educated at Fettes College", "response": ["* W. C. Sellar, co-author of 1066 and All That, Head of School 1917 and taught at the school."]}, {"page": "1898 in Scotland", "response": ["* 27 December – W. C. Sellar, humourist (died 1951 in England)"]}]}}