{"wiki_id": "http://www.wikidata.org/entity/Q7945784", "itemLabel": "W. L. Warren", "itemDescription": "British medievalist", "wikipedia_url": "https://en.wikipedia.org/wiki/W._L._Warren", "wikipedia_page": {"main": "Wilfred Lewis Warren (24 August 1929 – 19 July 1994) was an historian of medieval England. Educated at Exeter College, Oxford, he worked as a professor of modern (post-classical) history and Dean of theology at the Queen's University, Belfast. His field of interest was Norman and Angevin England, on which he published several major works.\nIn 1956 he received a doctorate in 14th-century English church history. He was fascinated by and well versed in Ulster politics.", "link_mentions": [{"page": "Magna Carta", "response": ["Magna Carta carries little legal weight in modern Britain, as most of its clauses have been repealed and relevant rights ensured by other statutes, but the historian James Holt remarks that the survival of the 1215 charter in national life is a \"reflexion of the continuous development of English law and administration\" and symbolic of the many struggles between authority and the law over the centuries. The historian W. L. Warren has observed that \"many who knew little and cared less about the content of the Charter have, in nearly all ages, invoked its name, and with good cause, for it meant more than it said\"."]}, {"page": "Jury", "response": ["The modern jury trial evolved out of this custom in the mid-12th century during the reign of Henry II.W. L. Warren, Henry II, University of California Press, 1973  Juries, usually 6 or 12 men, were an \"ancient institution\" even then in some parts of England, at the same time as Members consisted of representatives of the basic units of local government—hundreds (an administrative sub-division of the shire, embracing several vills) and villages. Called juries of presentment, these men testified under oath to crimes committed in their neighbourhood.  The Assize of Clarendon in 1166 caused these juries to be adopted systematically throughout the country.  The jury in this period was \"self-informing,\" meaning it heard very little evidence or testimony in court. Instead, jurors were recruited from the locality of the dispute and were expected to know the facts before coming to court.  The source of juror knowledge could include first-hand knowledge, investigation, and less reliable sources such as rumour and hearsay.Daniel Klerman, \"Was the Jury Every Self-Informing\"  Southern California Law Review 77: (2003), 123."]}, {"page": "Henry the Young King", "response": ["Henry did not appear to have been very interested in the day-to-day business of government, which distinguished him from his father and younger brothers. His father, however, is reputed to have failed to delegate authority to his son, retaining power in England. The majority opinion amongst historians is that of W. L. Warren: \"The Young Henry was the only member of the family who was popular in his own day....also the only one who gave no evidence of political sagacity, military skill, or even ordinary intelligence...\", and elaborated in a later book, \"He was gracious, benign, affable, courteous, the soul of liberality and generosity. Unfortunately he was also shallow, vain, careless, empty-headed, incompetent, improvident, and irresponsible.\"Warren, W.L, Henry II, (London: Eyre Methuen, 1973), pg.580.", "Young Henry and Margaret were formally married on 27 August 1172 at Winchester Cathedral, when Henry, aged seventeen, was crowned King of England a second time, this time together with Margaret, by Rotrou, the Archbishop of Rouen.W. L. Warren, Henry II (Univ. of California Press, 1973) p. 111, note 3", "* W. L. Warren, Henry II (London, 1973) "]}, {"page": "Hubert Walter", "response": ["According to the Life of William Marshal, which dates to soon after 1219, when word reached William Marshal, one of the richest and most influential barons, that Richard was dead, he consulted with Walter and discussed whom to support as the next king. Marshal's choice was John, but Walter initially leaned towards John's young nephew Arthur of Brittany. When Marshall was insistent on John, who was an adult, the author of the Life has Walter say in reply \" 'So be it then,' said the archbishop, 'but mark my words, Marshal, you will never regret anything in your life as much as this.'\"Quoted in Warren King John p. 49 This is almost certainly a retrospective comment that has been inserted into the biography, however, based on John's later behaviour. Once John knew he had the support of Walter and William Marshal, he sent Walter ahead to England to request all free men to pledge fealty to the new king.Bartlett England Under the Norman and Angevin Kings p. 124 On 27 May 1199 Walter crowned John, supposedly making a speech that promulgated, for the last time, the theory of a king's election by the people. This story is only contained in the writings of Matthew Paris, however, and although it seems certain that Walter made a speech, it is not certain what the exact contents were.Petit-Dutaillis Feudal Monarchy pp. 117–118 On his coronation day, John appointed Walter Lord Chancellor. W. L. Warren, historian and author of a biography of John, says of Walter that \"No one living had a firmer grasp of the intricacies of royal government, yet even in old age his mind was adaptable and fecund with suggestions for coping with new problems.\"Warren King John pp. 134–135", "W. L. Warren advances the theory that either Walter or Geoffrey Fitz Peter, instead of Ranulf Glanvill, was the author of Tractatus de legibus et consuetudinibus regni Angliae, a legal treatise on the laws and constitutions of the English.Warren King John p. 127 Chrimes agrees that Glanvill was probably not the author, and feels that Walter likely was, although he could not be certain.Chrimes Introduction p. 40 If he was the author, he composed what Chrimes called a \"great literary memorial of Henry II's government\".Chrimes Introduction p. 52 Neither of Walter's two modern biographers, however, feel that he was the author of the Tractatus, and the historian Ralph Turner agrees.Turner \"Who Was the Author of Glanvill?\" Law and History Review pp. 113–114 The historian Michael Clanchy says of Walter \"The proliferation of documents was a European and a continuing phenomenon, yet if it were to be associated in England with one man, he would be Hubert Walter.\"Clanchy From Memory to Written Record p. 73"]}, {"page": "House of Plantagenet", "response": ["* Count Geoffrey died in 1151 before finalizing the division of his realm between Henry and Henry's younger brother Geoffrey, who would have inherited Anjou. According to William of Newburgh, who wrote in the 1190s, Count Geoffrey decided that Henry would receive England and Anjou for as long as he needed the resources for the conflict against Stephen. Count Geoffrey instructed that his body should not be buried until Henry swore an oath that the young Geoffrey would receive Anjou when England and Normandy were secured. W. L. Warren cast doubt on this account on the grounds that it was written later based on a single contemporary source, it would be questionable that either Geoffrey or Henry would consider such an oath binding and it would break the inheritance practice of the time. The young Geoffrey died in 1158, before receiving Anjou, but he had become count of Nantes when the citizens of Nantes rebelled against their ruler. Henry had supported the rebellion."]}]}}