{"wiki_id": "http://www.wikidata.org/entity/Q7945482", "itemLabel": "W. E. Cule", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/W._E._Cule", "wikipedia_page": {"main": "William Edward Cule (5 December 1870 – 13 July 1944) was a British author of children's books and several books for adults on Christian themes. In all, he wrote some thirty books encompassing a number of popular genres – public school stories, adventure yarns, fairy tales, novels and Christian allegories and fable. His best children's books show an imaginative faculty of a high order and are soundly crafted, befitting his profession as a magazine and book editor. Cule's most popular Christian works are  The Man at the Gate of the World and Sir Knight of the Splendid Way, the latter recently reprinted by Lamplighter Publishing in the United States.", "link_mentions": [{"page": "List of Baptists", "response": ["*W. E. Cule (1870–1944, W), children's author and editor of Baptist Missionary Society publications"]}, {"page": "William Edward Cule", "response": ["#REDIRECT W. E. Cule"]}, {"page": "W E Cule", "response": ["#REDIRECT W. E. Cule"]}, {"page": "The Boy's Own Paper", "response": ["Many prominent authors and personalities contributed to the paper.  W.G. Grace wrote for several issues, as did Sir Arthur Conan Doyle, Jules Verne and R.M. Ballantyne. Robert Baden-Powell, founder of the Scout Movement, was a regular columnist and urged readers \"to live clean, manly and Christian lives\". Less well-known writers included William Gordon Stables, W. E. Cule, Sid G. Hedges and Hugh Pembroke Vowles. Edward Whymper contributed engravings (including the masthead). Gilbert Davey, who went on to publish Fun with Radio introduced many youngsters to a career in Radio and Electronics."]}, {"page": "Young England (magazine)", "response": ["Among its contributors were Fenton Ash, Harold Avery, R. M. Ballantyne, T. C. Bridges, Frank T. Bullen, W. E. Cule, C. J. Cutcliffe Hyne, Henty Frith, Ross Harvey, G. A. Henty,  Ascott R. Hope, W. H. G. Kingston, David Ker, J. P. Lamb, Robert Leighton,  Percy Longhurst, George Manville Fenn, Rosa Mulholland, F. St. Mars, Dr William Gordon Stables, Percy F. Westerman and  Fred Whishaw."]}, {"page": "George Morrow (illustrator)", "response": ["*The House of the Ogress (1921), by W. E. Cule"]}, {"page": "W.E. Cule", "response": ["#REDIRECT W. E. Cule "]}, {"page": "WE Cule", "response": ["#REDIRECT W. E. Cule "]}, {"page": "Amelia Bauerle", "response": ["* W. E. Cule, Sir Constant: Knight of the Great King. Andrew Melrose, London, 1899."]}, {"page": "Will G. Mein", "response": ["Mein was born in Kelso, Roxburgh, Scotland. His painting On the Tweed Near Berwick was exhibited by the Royal Scottish Academy in 1898 but he is known primarily for his illustrations.The Exhibition of the Royal Scottish Academy of Painting, Sculpture, and Architecture, Issue 72, The Royal Scottish Academy, 1898   His drawings were published in The Dome periodical, with contemporary artists Laurence Housman and Frank Mura. He was engaged by publisher Andrew Melrose to illustrate W. E. Cule's fairy tale Mabel's Prince Wonderful (1899) - his first major book illustration commission.Publishers' Circular and Booksellers' Record of British and Foreign Literature, Volume 71, Sampson Low, Marston & Co., 1899   Around the same time, the Decadent publisher Leonard Smithers commissioned him to illustrate Nigel Tourneur's Hidden Witchery.", "*W. E. Cule. Mabel's Prince Wonderful: or, A Trip to Storyland,  E. W. & R. Chambers, Edinburgh & London,1899."]}, {"page": "Charles Robinson (illustrator)", "response": ["The first full book he illustrated was Robert Louis Stevenson's A Child's Garden of Verses (1895) which includes over 100 pen and ink drawings. It was extremely popular, going through many reprints, and generated numerous commissions. He illustrated many fairy tales and children's books throughout his career, including Eugene Field's Lullaby Land (1897), W. E. Cule's Child Voices (1899),  Friedrich de la Motte Fouqué's Sintram and His Companions (1900), Alice's Adventures in Wonderland (1907), Grimm's Fairy Tales (1910), Frances Hodgson Burnett's The Secret Garden (1911), and books written by Walter Copeland Jerrold and himself."]}, {"page": "Watson Charlton", "response": ["*W. E. Cule.  Mr Crusoe's Island London: Sunday School Union (1914)"]}, {"page": "Cule (surname)", "response": ["* W. E. Cule (1870–1944), British author"]}]}}