{"wiki_id": "http://www.wikidata.org/entity/Q794036", "itemLabel": "McKeeva Bush", "itemDescription": "Caymanian politician (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/McKeeva_Bush", "wikipedia_page": {"main": "William McKeeva Bush, OBE JP (born 20 January 1955) is a Caymanian politician, Speaker of the Parliament of the Cayman Islands and former Premier of the Cayman Islands. Bush, the former leader of the Cayman Democratic Party, is the elected member for the constituency of West Bay West. He is the territory's longest ever serving political figure with service spanning over 35 years, previously serving his tenth term in the Parliament of the Cayman Islands.\n\n", "link_mentions": [{"page": "History of the Cayman Islands", "response": ["Damage on Grand Cayman has been extensive. I include with this letter, for your reference, a detailed briefing about the damage and the recovery effort, and some photographs[5]of the devastation. 95% of our housing stock has sustained damage, with around 25% destroyed or damaged beyond repair. We currently have 6,000 homes that are uninhabitable-these are homes that house teachers, nurses, manual and other workers. Thankfully, loss of life in Cayman has been limited, relative to the impact of the storm.\"- Honourable McKeeva Bush, OBE, JP."]}, {"page": "January 20", "response": ["*1955 – McKeeva Bush, Caymanian politician, Premier of the Cayman Islands"]}, {"page": "List of state leaders in 2003", "response": ["**Head of Government – McKeeva Bush, Leader of Government Business of the Cayman Islands (2001–2005)"]}, {"page": "List of state leaders in 2004", "response": ["**Head of Government – McKeeva Bush, Leader of Government Business of the Cayman Islands (2001–2005)"]}, {"page": "List of state leaders in 2002", "response": ["**Head of Government – McKeeva Bush, Leader of Government Business of the Cayman Islands (2001–2005)"]}, {"page": "List of state leaders in 2001", "response": ["**#McKeeva Bush, Leader of Government Business of the Cayman Islands (2001–2005)"]}, {"page": "List of ministers of the environment", "response": ["|William McKeeva Bush"]}, {"page": "Cayman Democratic Party", "response": ["In the elections of 8 November 2000, with a turnout of 80%, only non-partisans were elected. After the election members of parliament formed the United Democratic Party, currently headed by McKeeva Bush.", "Before the 2021 election, in December 2020, Democratic leader McKeeva Bush received a two-month suspended jail sentence for assaulting a woman in February 2020 leading to a no-confidence motion against him. Premier McLaughlin asked Governor Martyn Roper to dissolve Parliament on 14 February, triggering early elections instead of having the vote on the motion. In the lead-up to the election, the Democratic Party was described as \"[appearing] to be defunct\" as figures previously of the party (including Bush) instead contested as independents.", "* McKeeva Bush: (November 2001 – February 2021)", "| rowspan=\"4\" |McKeeva Bush"]}, {"page": "Hurricane Ivan", "response": ["In the Cayman Islands, Governor Bruce Dinwiddy described damage as \"very, very severe and widespread.\" Despite strict building codes which made the islands' buildings well able to withstand even major hurricanes, Ivan's winds and storm surge were so strong that a quarter or more of the buildings on the islands were reported to be uninhabitable, with 85% damaged to some extent. Much of Grand Cayman still remained without power, water, or sewer services for several months later. After five months, barely half the pre-Ivan hotel rooms were usable. Two people were killed on Grand Cayman, one from drowning and the other from flying debris. Damage across the territory was catastrophic, with losses amounting to $2.86 billion (equivalent to $ in ) or 183 percent of its gross domestic product. The Letter from the Cayman Islands Government Office in the United Kingdom, 8 October 2004 by McKeeva Bush, Leader of Government Business details the intensity, extent of damage, and recovery process during the months that followed."]}, {"page": "Premier of the Cayman Islands", "response": ["| McKeeva Bush", "| McKeeva Bush", "| McKeeva Bush", "| McKeeva Bush"]}, {"page": "List of state leaders in 2005", "response": ["**#McKeeva Bush, Leader of Government Business of the Cayman Islands (2001–2005)"]}, {"page": "Geoffrey Cox (British politician)", "response": ["In 2014, Cox successfully defended the former Premier (and current  Speaker of the Legislative Assembly) of the Cayman Islands, McKeeva Bush, on charges of corruption and misuse of office. In March 2015, Cox successfully defended the deputy Editor of The Sun, Geoff Webster, in a trial of four journalists resulting from Operation Elveden. The jury had to decide at what point the behaviour of those on trial could be considered a criminal rather than a serious disciplinary matter; even the lawyers found this difficult to define. Cox subsequently publicly criticised the vagueness of the law, and its disproportionate use that had led to the prosecution."]}, {"page": "Kurt Tibbetts", "response": ["On November 8, 2001 legislators led by McKeeva Bush voted to oust Tibbetts as Leader of Government Business saying he has not done enough to counter a slowing economy. Nine of the 15 elected legislators voted to remove Tibbetts as Leader of Government Business. Five voted against the motion, and one (Tibbetts) abstained. The vote came after 10 of the 15 elected legislators formed a new party that same day, The legislators, who had been independents, formed the new United Democratic Party, with Mckeeva Bush as their leader. As part of the changes to the Assembly's Executive Council, legislators also removed Tibbetts supporter Edna Moyle as minister of community development and women's affairs. Tibbetts said during debate on the motion that he had no choice but to accept the result of the vote, but said the islands should restructure the system so that the leadership cannot be so easily removed."]}, {"page": "James C. Miller III", "response": ["On November 9, 2009, it was announced that Miller was picked by the then Premier of the Cayman Islands William McKeeva Bush to lead an independent task force to examine new revenue options for the Cayman Islands Government. The Cayman Islands has no direct taxation although that may change as a result of an agreement with the United Kingdom Foreign and Commonwealth Office. The UK FCO allowed the Cayman Islands Government to borrow additional funds to meet capital and operational expenses as long as the Government agreed to look at ways in which to increase and stabilize its revenue base—direct taxation being the preferred solution."]}, {"page": "Parliament of the Cayman Islands", "response": ["|Hon. McKeeva Bush"]}, {"page": "Alden McLaughlin", "response": ["McLaughlin was first elected to the Legislative Assembly in 2000 and is a founding member of the People's Progressive Movement. He served as General Secretary of People's Progressive Movement from 2002 to 2006. In early 2021, McLaughlin decided to push the Cayman Islands General Election from May to April 14th in order to protect the speaker of the house, McKeeva Bush, who pleaded guilty to assaulting a woman. Alden McLaughlin and his unity government are also responsible for Cayman Islands being placed on the FATF Greylist and the EU Blacklist."]}, {"page": "West Bay, Cayman Islands", "response": ["The Cayman Islands Former Premier, McKeeva Bush, was elected from the West Bay district."]}, {"page": "List of state leaders in 2009", "response": ["**#McKeeva Bush, Premier of the Cayman Islands (2009–2012)"]}, {"page": "List of speakers of the Legislative Assembly of the Cayman Islands", "response": ["| McKeeva Bush ", "| rowspan=2|  McKeeva Bush "]}, {"page": "William McKeeva Bush", "response": ["#REDIRECT McKeeva Bush"]}, {"page": "List of state leaders in 2010", "response": ["**Premier – McKeeva Bush, Premier of the Cayman Islands (2009–2012)"]}]}}