{"wiki_id": "http://www.wikidata.org/entity/Q7959393", "itemLabel": "Waen Shepherd", "itemDescription": "Comedy song writer, electronic music composer, character comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Waen_Shepherd", "wikipedia_page": {"main": "Waen Origen Shepherd (born 23 October 1971) is an English composer, actor and comedian. Originally from Yorkshire, England, he now lives in London.", "link_mentions": [{"page": "List of comedians", "response": ["* Waen Shepherd (born 1971)"]}, {"page": "List of British comedians", "response": ["*Gary Le Strange, aka Waen Shepherd (born 1971)"]}, {"page": "Hyperdrive (British TV series)", "response": ["* Waen Shepherd as Gareth Stannis, the actor who plays the title part in the television drama Captain Helix, watched obsessively by Captain Henderson in the privacy of his cabin as a source of emotional comfort. Captain Helix — who resembles a somewhat camper version of Doctor Who — may also not be quite what he seems."]}, {"page": "Gary Le Strange", "response": ["Gary Le Strange is a character created by comedian Waen Shepherd. Le Strange is played as an eccentric English cult-rock composer, songwriter and performer, who believes his surreal and abstract performances to be groundbreaking."]}, {"page": "The Sitcom Trials", "response": ["Performers who have appeared in The Sitcom Trials over the years include Miranda Hart, Neil Mullarkey, Richard Vranch, Suki Webster, Tony Robinson (Baldrick), Wanda Opalinska, Gerard Foster, Charity Trimm, Dominic Frisby, Waen Shepherd, Laura Solon, James Holmes, Justin Lee Collins, Russell Howard, Mark Olver, Aaron Barschak, Emily Lloyd, Danny Robins, Dan Tetsell, The Scottish Falsetto Sock Puppet Theatre, Rosie Holt, Lucy Porter, Nick Ewans, Louisa Gummer, Anne-Marie Draycott, Dan March, Rich Johnston, Anna Bennetts, Simon Treves, Steve McNeil and Sam Pamphilon."]}, {"page": "Underbelly (venue)", "response": ["*Waen Shepherd"]}, {"page": "Underbelly (events promoter)", "response": ["*Waen Shepherd"]}, {"page": "The Oxford Revue", "response": ["*Waen Shepherd"]}, {"page": "Chortle Awards", "response": ["* Best newcomer: Waen Shepherd as Gary Le Strange (nominees: Stuart Hudson, Tom Wrigglesworth)"]}, {"page": "Canal Cafe Theatre", "response": ["Other notable performances have been given by The Mighty Boosh, The League of Gentlemen, Waen Shepherd, The Consultants, Rhod Gilbert, Paul Chowdhry, Shappi Khorsandi, Pippa Evans, Sarah Lark, and Frisky and Mannish."]}, {"page": "List of The Inbetweeners characters", "response": ["* Played by Waen Shepherd"]}, {"page": "Karaoke Circus", "response": ["* Waen Shepherd"]}, {"page": "The Alternative Comedy Memorial Society", "response": ["* Waen Shepherd"]}, {"page": "Tom Meeten", "response": ["Tom has worked with double act partner Steve Oram and created three shows at the Edinburgh Festival, performed a monthly London live show Oram and Meeten's Club Fantastico with Waen Shepherd, Tony Way and Alice Lowe and wrote and starred in Matthew and Tone: Tales of Friendship and Innocence for Channel 4.Mullaney, Martin. \"Tom Meeten\" \"Comedy CV\" Retrieved on 17 February 2012."]}, {"page": "Aaaaaaaah!", "response": ["In the park Denise meets up with her streetwise cousin Helen (Holli Dempsey) and they drink vodka together. Helen has itchy VD and Denise suggests she pour vodka down her crotch which she does. They go shoplifting and are caught by a shop assistant, Carl (Noel Fielding). The shop manager (Waen Shepherd) interrogates them in the basement and masturbates in front of them before falling asleep on his desk. Carl then gets Helen to give him a blow job, but Helen bites his penis off. The girls flee with some money from the cash box.", "* Waen Shepherd as Manager"]}]}}