{"wiki_id": "http://www.wikidata.org/entity/Q795276", "itemLabel": "Jim Baxter", "itemDescription": "Scottish footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Baxter", "wikipedia_page": {"main": "James Curran Baxter (29 September 1939 – 14 April 2001) was a Scottish professional footballer who played as a left half. He is generally regarded as one of the country's greatest ever players. He was born, educated and started his career in Fife, but his peak playing years were in the early 1960s with the Glasgow club Rangers, whom he helped to win ten trophies between 1960 and 1965, and where he became known as \"Slim Jim\". However, he started drinking heavily during a four-month layoff caused by a leg fracture in December 1964, his fitness suffered, and he was transferred to Sunderland in summer 1965. In two and a half years at Sunderland he played 98 games and scored 12 goals, becoming known for drinking himself unconscious the night before a match and playing well the next day. At the end of 1967 Sunderland transferred him to Nottingham Forest, who gave him a free transfer back to Rangers in 1969 after 50 games. After a further year with Rangers Baxter retired from football in 1970, at the age of 31.\nFrom 1960 to 1967, he was a leading member of a strong Scottish international team that lost only once to England, in 1966, shortly after he recovered from the leg fracture. He thought his best international performance was a 2–1 win against England in 1963, when he scored both goals after Scotland were reduced to 10 players. In the 1967 match against England, who had won the 1966 World Cup, he taunted the opposition by ball juggling while waiting for his teammates to find good positions. Although he was given most of the credit for the 3–2 win, some commentators wished he had made an effort to run up a bigger score.\nIn his prime, Baxter was known for his ability to raise a team's morale, his good tactical vision, precise passing and ability to send opponents the wrong way – and for being a joker on the pitch. He also broke with Glasgow tradition by becoming friendly with several members of their major Glasgow rivals, Celtic.\nAlthough he gained a reputation as a womaniser when he moved to Glasgow, he married in 1965 and had two sons. The marriage broke up in 1981, and in 1983 he formed another relationship that lasted the rest of his life. After retiring from football he became manager of a pub, and his continued heavy drinking damaged his liver so badly that he needed two transplants at the age of 55, after which he swore off alcohol. Baxter was also addicted to gambling, and is estimated to have lost between £250,000 and £500,000. After he died of pancreatic cancer in 2001, his funeral was held in Glasgow Cathedral and his ashes were buried at Rangers' Ibrox Stadium. In 2003, a statue was erected in his honour at his hometown, Hill of Beath.", "link_mentions": [{"page": "April 14", "response": ["*2001 – Jim Baxter, Scottish footballer (b. 1939)"]}, {"page": "List of Scots", "response": ["* Jim Baxter (1939–2001), footballer"]}, {"page": "September 29", "response": ["*  1939   – Jim Baxter, Scottish footballer (d. 2001)"]}, {"page": "Rangers F.C.", "response": ["Scot Symon continued Struth's success, winning six league championships, five Scottish Cups and four League Cups, becoming the second manager to win the domestic treble in 1963–64 season, the era of 'Slim' Jim Baxter, one of the club's greatest players. Rangers also lost by their biggest Old Firm margin of 7–1.", "*  Jim Baxter – voted Rangers' third greatest-ever player", "*  Jim Baxter – 2004 Inaugural Inductee", "*  Jim Baxter – 2002 Inductee"]}, {"page": "Fife", "response": ["* Jim Baxter, footballer"]}, {"page": "Keepie uppie", "response": ["One of the more famous displays of keepie-uppie was in the 1967 Scotland–England football match, where Scottish midfielder Jim Baxter juggled the ball for some time in front of the English defence, taunting them by keeping possession. This allowed Scotland to keep possession and use up the remaining few minutes, leading to a 3–2 victory for Scotland over the world champions. \"That's a defining moment for almost every football fan in Scotland irrespective of where their club allegiance lies,\" said football historian Bob Crampsey."]}, {"page": "Black Watch", "response": ["* Jim Baxter, Scottish footballer"]}, {"page": "Baxter (name)", "response": ["* Jim Baxter, Scottish footballer"]}, {"page": "Cowdenbeath", "response": ["*thumb|right|Jim Baxter statue Hill Of BeathJames Curran Baxter, or \"Slim Jim\" Baxter, was another noteworthy student of Beath High. He was one of Scotland's most prolific football players. A statue commemorating Jim Baxter can be found in adjacent Hill of Beath, his home village, outside the working men's club."]}, {"page": "Scotland national football team", "response": ["The Scottish Football Association operates a roll of honour for every player who has made more than 50 appearances for Scotland.  there are 33 members of this roll, with Andy Robertson the most recent addition to the list. The qualifying mark of 50 appearances means that many notable Scotland players including Jim Baxter, Hughie Gallacher, John Greig, Jimmy Johnstone, Billy McNeill, Bobby Murdoch, Archie Gemmill and Lawrie Reilly are not on the roll of honour."]}, {"page": "Jimmy Johnstone", "response": ["He made his international debut for the full Scottish international side on 3 October 1964 in a British Home Championship match against Wales, in place of Rangers winger Willie Henderson. He was involved in the move that led to Scotland's second goal, though the match ended in a 3–2 win for the Welsh. Johnstone's next cap came that same month in a World Cup qualifier at Hampden Park against Finland. Scotland won 3–1, but Johnstone's performance was unimpressive, with his passing described as \"lacking accuracy.\" Johnstone did not play for Scotland again until 2 April 1966, when he scored his first two international goals in a 4–3 defeat against England at Hampden Park. The first goal came with Scotland trailing 4–1, when he latched on to a pass from Denis Law and used his pace and power to run past the English defence and beat goalkeeper Gordon Banks from close range. He pulled back another goal for Scotland when he chased a floated ball towards goal from a Jim Baxter free kick and, from close range, scored with a powerful shot off the underside of the bar. Johnstone, along with Denis Law, was reported as one of Scotland's best performers, and his play resulted in England's Nobby Stiles being booked for a crushing tackle on him. Johnstone continued to play sporadically for Scotland, and he didn't score his next international goal until 22 October 1969 in a World Cup qualifier away against West Germany, Scotland losing 3–2."]}, {"page": "John Greig", "response": ["A determined, forceful player, recognised for his great leadership qualities, Greig made 755 official appearances for Rangers (498 in the domestic league, 72 in the Scottish Cup, a club record 121 in the League Cup and 64 in European tournaments). He scored 120 goals for the club and won three domestic trebles. Greig actually started his career with Rangers as a forward, prior to being moved back to midfield—playing initially alongside another Rangers legend in Jim Baxter—and finally to left back. It was therefore in those initial years that he scored the majority of his goals for the club."]}, {"page": "Craig Brown (footballer, born 1940)", "response": ["Educated at the former Hamilton Academy, Brown played for the school in Scottish schools competitionsHamilton Advertiser, 21 May 2009'Every picture tells a story: Craig Brown, Part 1', Evening Times, 15 April 2004'The rise and rise of a well honoured manager', The Herald, 12 July 1999 and in youth international teams, before joining Rangers in 1957, being considered a top prospect; he was initially farmed out to Coltness United to gain experience, and was selected for the Scotland Junior squad. He failed to find a regular first team place at Rangers, with his progress halted by a knee injury and the arrival of Jim Baxter who played in the same position, and moved to Dundee on loan in October 1960."]}]}}