{"wiki_id": "http://www.wikidata.org/entity/Q7966388", "itemLabel": "Walter Weaver", "itemDescription": "English footballer (1898-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Weaver_(footballer)", "wikipedia_page": {"main": "Walter Weaver (9 November 1898 – 1965) was an English professional association footballer who played as a winger.", "link_mentions": [{"page": "Walter Weaver", "response": ["Walter Weaver may refer to:", "* Walter Weaver (footballer) (1898–1965), English footballer"]}, {"page": "1920–21 Burnley F.C. season", "response": ["Burnley's first match outside the league in the 1920–21 season was a friendly on 22 September 1920 against a Blackburn Rovers XI to mark the opening of Accrington Stanley's new stadium at Peel Park. Burnley won the game 10–1 with seven goals from Joe Anderson in addition to strikes from James Lindsay, Walter Weaver and Thomas Jackson. Burnley's opening game in the FA Cup was an away tie at Leicester City on 8 January 1921. Bob Kelly scored for the fourth game in succession and Joe Anderson scored four goals as Burnley won the match 7–3, the first time the team had scored seven goals in a competitive match away from home. After the match, the Athletic News described Burnley as the best team in the country.", "|align=\"left\"|Walter Weaver", "Burnley's 30-game unbeaten streak during the 1920–21 season stood as a Football League record for 83 years until it was surpassed by Arsenal, who completed the entire season without losing in the 2003–04 campaign. After the defeat to Bradford City on 28 August 1920, Burnley did not lose another match at Turf Moor until 11 February 1922, when they were beaten 1–2 by Blackburn Rovers.Simpson (2007), p. 154 In the same match, the halfback line of Tommy Boyle, George Halley and Billy Watson—used in 25 first-team games during 1920–21—was seen for the final time, having played together for the first time in September 1913.Simpson (2007), p. 133 The majority of the championship-winning team remained intact going into the 1921–22 season, although players such as David Taylor and Walter Weaver found themselves less involved in first-team matches.Simpson (2007), p. 157"]}]}}