{"wiki_id": "http://www.wikidata.org/entity/Q7965420", "itemLabel": "Walter Langton", "itemDescription": "English footballer (1867-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Langton_(footballer)", "wikipedia_page": {"main": "Walter \"Warhorse\" Langton (6 February 1867−1952) was an English footballer who played as a left back and centre forward for 18 seasons with Doncaster Rovers, holding the record for being their longest serving player.\nHailing from Greenhill Lane near Alfreton, Derbyshire, he was the son of Fanny and Samuel Langton. He followed his father, working as a coalminer. After some time playing for Mexborough, he moved to play for Doncaster Rovers in 1887 at around the age of 19 where, being an amateur, he worked as a slotting machinist at the GWR railworks. Langton started off in the left back position, moving to centre forward in the 1890−91 season, then latterly returning to left back.He scored at least 55 goals in his career at Doncaster - in his early days many goals weren't accredited to a player in the records. The first recorded goals were a brace on 9 February 1889 in a 2−2 draw against Newark. In his next season Langton scored at least 14 out of the 34 matches that the team played, including 5 against Newark in an 8−0 victory on 1 February 1890. In 1890−91 it was 11 goals out of the 19 games Rovers played.On 5 November 1898, he scored against Huddersfield in the Yorkshire League in the still standing joint record 14−0 Doncaster win.Langton was the only recorded scorer of penalties for Rovers up till 1898. The first one recorded was in a 3−3 draw against Sheffield Strollers in front of a crowd of 6,000 in the Sheffield and Hallamshire Challenge Cup on 18 February 1893 at the Olive Grove, Sheffield. In all he is listed as having scored 8 goals from the spot.After the 1904−05 season with Doncaster, Langton retired from playing the game.", "link_mentions": [{"page": "Walter Langton", "response": ["Walter Langton (died 1321) of Castle Ashby'Parishes: Castle Ashby', in A History of the County of Northampton: Volume 4, ed. L F Salzman (London, 1937), pp. 230-236.  in Northamptonshire, was Bishop of Coventry and Lichfield and Treasurer of England. The life of Langton was strongly influenced by his uncle William Langton (d. 1279), Archbishop of York-elect, by Robert Burnell, Lord Chancellor of England and then by the years in which he served King Edward I. Lichfield Cathedral was improved and enriched at his expense.", "His origins were long unclear but following recent research (Hughes, 1992) it is now apparent that he was the eldest son of Simon PeverelJill Hughes, Episcopate of Walter Langton, Bishop of Coventry & Lichfield, 1296–1321 (Ph.D. thesis 1992)[Vol. 1: http://eprints.nottingham.ac.uk/11108/1/315105_vol1.pdf][Vol. 2: http://eprints.nottingham.ac.uk/11108/2/315105_VOL2.pdf] \"Langton's register clarifies the bishop's connections with the Peverel family of Leicestershire and Northamptonshire and shows that he was a Peverel by birth. Copies of charters preserved in his register, by which Langton granted land and the advowson of the church of Adlingfleet, Yorks., to Selby abbey, clearly state his paternity; Langton names himself as the son and heir of Simon Peverel (Reference: Bishop Langton's Register, nos. 1291, 1292, 1293)...\"(Bishop] Langton's mother, Amicia Peverel, was buried at Langton (Leicestershire)\" Quoted in \"C.P. Addition: Parentage of Sir Robert Peverel (living 1312) and his brother Bishop Walter de Langton (died 1321) \" of \"Langton\" in Leicestershire,EB,1911 the exact location of which estate is uncertain (see below). He thus adopted the surname \"de Langton\" in lieu of his patronymic. His brother (it is now established) was Robert Peverel (d. 1317) of Brington and Ashby David in Northamptonshire,Jill Hughes;  Complete Peerage, 5 (1926): 76 (sub Engaine); Called \"brother\" in his inquisition post mortem  an ancestor of Joan de la Pole, suo jure 4th Baroness Cobham (d. 1434) \"of Kent\", whose prominent descendants the Brooke family, Barons Cobham, are known to have quartered the arms of Peverel of Langton (Gules, a fess between nine cross-crosslets or).See monument in Cobham Church, Kent:File:Arms WilliamBrooke 10thBaronCobham (1527-1597) CobhamChurch Kent.xcf; see:   The Bishop, however, eschewed his paternal arms as well as surname, as his arms are said to have been Or, a fess chequy gules and azure.Or, a fess chequy gules and azure as tricked (or=or, b=blue/azure, g=gules) in a drawing by William Dugdale of a stained-glass image of the Bishop formerly in Lichfield Cathedral, see :File:WalterDeLangton Died1321 BishopOfCoventry&Lichfield AfterDugdale.png. The arms (apparently based on Dugdale's drawing) are blazoned slightly differently as Or, a fess compony azure and gules in Bedford, Blazons of Episcopacy, 1858, p.57  Langton appears to have been no relation of his contemporary, John Langton, Bishop of Chichester.", "Though Lord Chancellor, Bishop Robert Burnell of Bath and Wells was also Archdeacon of York. It may be supposed through his duties in York he became a friend of William Langton and through the two men, Walter Langton was introduced to the King. The King must have liked the young man, for he selected him for his service and in later years Langton became \"unquestionably Edwards's first minister and almost his only real confidant\".", "Having become unpopular, the barons in 1301 vainly asked Edward to dismiss Langton; about the same time he was accused of murder, adultery and simony. Suspended from his office, he went to Rome to be tried before Pope Boniface VIII, who referred the case to Winchelsea, archbishop of Canterbury; the archbishop, although Langton's lifelong enemy, found him innocent, and this sentence was confirmed by Pope Boniface in 1303. Little is said about the nature of the charges of witchcraft against Bishop Walter Langton.See  Julien Théry-Astruc, \"'Excès' et 'affaires d’enquête'. Les procédures criminelles de la papauté contre les prélats, de la mi-XIIe à la mi-XIVe siècle. Première approche\", in La pathologie du pouvoir : vices, crimes et délits des gouvernants, ed. by Patrick Gilli, Leyde : Brill, 2016, p. 164-236, at p. 183, 197, 204, 217. By inference Pope Boniface VIII was charged, about the same time with Invocation, consultation of diviners, and other offenses, by officials of King Philip IV of France, about which more information is available.See  Jean Coste, Boniface VIII en procès. Articles d'accusation et dépositions des témoins (1303–1311), Rome, \"L'Erma\" di Bretschneider, 1995.", "*Jill Hughes: Walter Langton and his family. In: Nottingham Medieval Studies, 35 (1991), S. 70–76", "*Alice Beardwood: The trial of Walter Langton, Bishop of Lichfield, 1307–1312. American Philosophical Society, Philadelphia 1964", "* More information is provided in a paper Walter Langton, bishop of Coventry and Lichfield 1296-1321: his family background by Dr Jill Hughes, published in the Nottingham Medieval Studies XXXV (1991). There is some interest in Bishop Walter Langton, due to his trial before the Vatican on charges of witchcraft."]}, {"page": "Alick Jeffrey", "response": ["The road around the Doncaster Rovers stadium opened in 2006 was named Alick Jeffrey Way, whilst five apartment blocks built on the site of the former Doncaster Rovers ground at Belle Vue were named after five of the Rovers' greatest ever players - Alick Jeffrey, Walter Langton, Tom Keetley, Syd Bycroft and James Coppinger."]}, {"page": "List of Doncaster Rovers F.C. players (1879–1918)", "response": ["*Full back: Walter Langton"]}, {"page": "Walter Langton (footballer born 1868)", "response": ["#REDIRECT Walter Langton (footballer)"]}, {"page": "Walter Langton (footballer born 1867)", "response": ["#REDIRECT Walter Langton (footballer)"]}, {"page": "List of Doncaster Rovers F.C. records and statistics", "response": ["* Longest serving: Walter Langton, 18 seasons"]}]}}