{"wiki_id": "http://www.wikidata.org/entity/Q7969776", "itemLabel": "Warner Westenra, 2nd Baron Rossmore", "itemDescription": "Irish Baron", "wikipedia_url": "https://en.wikipedia.org/wiki/Warner_Westenra,_2nd_Baron_Rossmore", "wikipedia_page": {"main": "Warner William Westenra, 2nd Baron Rossmore (14 October 1765 – 10 August 1842), was an Anglo-Irish landowner and politician.", "link_mentions": [{"page": "Monaghan", "response": ["In 1801, Monaghan town, along with the rest of the Rossmore Estate, became the property of the Westenra family. The Rossmore Estate was inherited in August of that year by Warner Westenra, 2nd Baron Rossmore from his uncle. The Westenra family remained as the principal landlords of Monaghan town up into the early twentieth-century. Their 'ancestral seat' was established at Rossmore Castle (also known as Rossmore Park), a large country house mainly built in stages during the nineteenth-century on the south-western edge of Monaghan Town. The castle was mainly built in the neo-Jacobean style of architecture."]}, {"page": "Lord Lieutenant of Monaghan", "response": ["* Warner Westenra, 2nd Baron Rossmore: –1831The Royal Kalendar for 1831, p. 389."]}, {"page": "Westenra", "response": ["*Warner Westenra, 2nd Baron Rossmore (1765–1842), Irish landowner and politician"]}, {"page": "Alexander Cairnes", "response": ["Mary Cairnes (died 28 August 1790) married Baron Blayney, and at the time of Cairnes's death, she was a childless widow. She subsequently remarried, in 1734, to Col. John Murray, who was Member of Parliament for Monaghan County in the early 1740s. Murray died on 29 June 1743 leaving his wife with several daughters. One of the daughters, Elizabeth, married Robert Cuninghame, 1st Baron Rossmore, and another, Harriet, was the mother of Warner Westenra, 2nd Baron Rossmore, who succeeded to his maternal aunt's husband's barony by special remainder."]}, {"page": "Henry Westenra, 3rd Baron Rossmore", "response": ["The eldest  son of Warner Westenra, 2nd Baron Rossmore (1765–1842) by his first marriage to Mary Ann Walsh, Henry Robert Westenra was born on 24 August 1792 at his mother's family seat, Walsh Park in County Tipperary. He was educated at Westminster School and Trinity College, Dublin, where he matriculated on 4 July 1810.Charles Mosley, ed., Burke's Peerage, Baronetage & Knightage, 107th edition in 3 volumes, vol. 3 (Burke's Peerage Ltd, 2003), p. 3408G. E. Cokayne et al., eds., The Complete Peerage of England, Scotland, Ireland, Great Britain and the United Kingdom, Extant, Extinct or Dormant, vol. XI, p. 182 His portrait was painted the same year by John Ferneley (1782–1860), showing him with his dogs and carrying a shotgun."]}, {"page": "Warner William Westenra, 2nd Baron Rossmore", "response": ["#REDIRECT Warner Westenra, 2nd Baron Rossmore"]}, {"page": "Warner William Westenra", "response": ["#REDIRECT Warner Westenra, 2nd Baron Rossmore"]}, {"page": "Warner Westenra", "response": ["*Warner Westenra, 2nd Baron Rossmore (1765–1842), Irish landowner and politician, grandson of the above"]}, {"page": "Custos Rotulorum of County Monaghan", "response": ["*1805–1842 Warner Westenra, 2nd Baron Rossmore"]}, {"page": "John Westenra", "response": ["Born in Walsh Park, County Tipperary, Ireland, he was the son of Warner Westenra, 2nd Baron Rossmore and Mary Ann Walsh, and the brother of Henry Westenra, 3rd Baron Rossmore. He first married Eleanor Mary East née Jolliffe, daughter of William Jolliffe, in 1834. After she died in 1838, he then married Ann Daubuz, daughter of Lewis Charles Daubuz, in 1842, and they had at least one /child: Mary Anne Wilmot Westenra (died 1894)."]}, {"page": "Warner (given name)", "response": ["*Warner Westenra, 2nd Baron Rossmore (1765 – 1842), Irish politician"]}]}}