{"wiki_id": "http://www.wikidata.org/entity/Q7965869", "itemLabel": "Walter Preston", "itemDescription": "British Conservative Member of Parliament (1875-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Preston_(British_politician)", "wikipedia_page": {"main": "Sir Walter Reuben Preston (20 September 1875 – 6 July 1946) was a Conservative Party politician in the United Kingdom.\nAt the 1918 general election, he was elected as Member of Parliament (MP) for the Mile End constituency in the East End of London.  He lost the seat at the 1923 general election to the Labour Party candidate John Scurr.\nHe returned to Parliament at a by-election in September 1928 for the Cheltenham constituency, and held the seat until he resigned from the House of Commons in 1937.", "link_mentions": [{"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|Walter Preston"]}, {"page": "List of United Kingdom by-elections (1931–1950)", "response": ["|Walter Preston"]}, {"page": "Walter Reuben Preston", "response": ["#REDIRECT Walter Preston (British politician)"]}, {"page": "Walter Preston", "response": ["Walter Preston may refer to:", "* Sir Walter Preston (British politician) (1875–1946), Conservative Member of Parliament 1918–1923 and 1928–1937", "* Walter Preston (American politician) representative from Virginia at the First Confederate Congress"]}, {"page": "Sir Walter Preston", "response": ["#REDIRECT Walter Preston (British politician)"]}, {"page": "Sir Walter Reuben Preston", "response": ["#REDIRECT Walter Preston (British politician)"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Walter Preston; MP for Mile End (1918–1923) and Cheltenham (1928–1937)"]}, {"page": "Walter Preston (UK politician)", "response": ["#REDIRECT Walter Preston (British politician)"]}, {"page": "List of people educated at Bedford School", "response": ["*Sir Walter Preston (1875–1946), Conservative MP for Mile End, 1918–1923, Conservative MP for Cheltenham, 1928–1937"]}, {"page": "HMS Lorna", "response": ["At the outbreak of war in August 1914, the yacht was requisitioned and hired by the Admiralty as an armed patrol vessel. Equipped with two 6-pounder guns and depth charges. Lorna probably operated as the Group Leader of a unit of the Auxiliary Patrol, both in home waters and in the Mediterranean. On the evening of 26 May 1918, Lorna was escorting a convoy off Portland Bill at the eastern end of Lyme Bay. Sighting a submarine's periscope only thirty yards away, Lorna was able to approach to ten yards before the U-boat spotted her and began to dive. Passing directly over where the periscope had been, (some accounts state that Lorna struck the periscope) Lorna dropped two depth charges resulting in a large patch of turbulence with some debris in it. Returning to recross the area, it was realised that some items in the water were actually four survivors from the U-boat, their calls for help being heard too late to prevent a third charge from being dropped. Three of the men in the water were killed instantly, the fourth was still alive when recovered but died within three hours, although not before revealing that the destroyed submarine had been the SM UB-74. Lorna was returned to her owner in February 1919, she was then sold on to Walter Preston, an engineer and Member of Parliament."]}]}}