{"wiki_id": "http://www.wikidata.org/entity/Q796264", "itemLabel": "Charles Stirling", "itemDescription": "vice-admiral, Royal Navy (1760-1833)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Stirling", "wikipedia_page": {"main": "Sir Charles Stirling (28 April 1760 – 7 November 1833) was a vice-admiral in the Royal Navy.\n\n", "link_mentions": [{"page": "Montevideo", "response": ["On 3 February 1807, British troops under the command of General Samuel Auchmuty and Admiral Charles Stirling occupied the city during the Battle of Montevideo (1807), but it was recaptured by the Spanish in the same year on 2 September when John Whitelocke was forced to surrender to troops formed by forces of the Banda Oriental—roughly the same area as modern Uruguay—and of Buenos Aires. After this conflict, the governor of Montevideo Francisco Javier de Elío opposed the new viceroy Santiago de Liniers, and created a government Junta when the Peninsular War started in Spain, in defiance of Liniers. Elío disestablished the Junta when Liniers was replaced by Baltasar Hidalgo de Cisneros."]}, {"page": "James Stirling (Royal Navy officer)", "response": ["The Stirling family was well-known and celebrated in the naval annals of the 18th century.  His maternal grandfather was Admiral Sir Walter Stirling and his uncle was Admiral Sir Charles Stirling. With such a family background, it was natural for James to enter the Royal Navy.  His education at Westminster SchoolThe Record of Old Westminsters, by G.F. Barker and A.H. Russell Stenning, Chiswick Press 1928 was interleaved with periods of training on board British warships, and on 14 January 1804, at the age of 12, he entered the navy as a First-Class Volunteer,Admiralty Service Oof James Stirling, ADM 107/41 embarking on the storeship HMS Camel for the West Indies. Thus he began a distinguished career.", "Stirling trained for midshipman on board  and also served for a period on  under the flag of Admiral Sir John Duckworth, Commander-in-Chief, Jamaica Squadron. He passed his midshipman tests on 20 January 1805 and shortly afterwards was posted to , but on 27 June, at the request of his uncle, Rear-Admiral Charles Stirling, he joined his uncle's flagship, the 98-gun ."]}, {"page": "British invasions of the River Plate", "response": ["On 3 February 1807 Montevideo, defended by approximately 5,000 men, was besieged at 2:00am by a 15,000 strong British force in a joint military and naval operation under General Sir Samuel Auchmuty and a naval squadron under Admiral Sir Charles Stirling. Reinforcements for the defenders came en route from Buenos Aires, so that the rapid success of the operation was essential."]}, {"page": "James Lucas Yeo", "response": ["In 1811 Yeo was given command of the frigate . The frigate was ordered to Jamaica where it joined the fleet of Vice Admiral Charles Stirling. In 1812, he was stationed in the Bahamas. There he captured the privateer Heureuse Réunion, a brig and a corvette in the action of 3 February 1812, and the American brig  in November 1812. However, shortly afterwards Southampton and Vixen were wrecked in the Crooked Island passage, although no lives were lost. As was customary in the case of the loss of a ship from any cause, Yeo was court martialled, but the court accepted that the reef on which he was wrecked was not charted, nor were the local currents documented, and Yeo was exonerated."]}, {"page": "Battle of Cape Finisterre (1805)", "response": ["| (98), Flagship of Rear-Adm. Sir Charles Stirling, Capt. Samuel Warren"]}, {"page": "Robert Calder", "response": ["On its becoming known that Napoleon intended to break the blockade of Ferrol as a prelude to his invasion, the Admiralty ordered Rear-Admiral Charles Stirling to join Calder and intercept the Franco-Spanish fleet on their passage to Brest. The approach of the enemy was concealed by fog. Finally, on 22 July 1805, the fleets came into sight. The allies outnumbered the British, but Calder ordered his fleet into action. In the ensuing Battle of Cape Finisterre, fifteen British ships engaged twenty French and Spanish ships and captured two. The British losses were 39 officers and men killed and 159 wounded; the allies lost 158 dead and 320 wounded. After four hours, as night fell, Calder gave orders to discontinue the action. Over the following two days, the fleets remained close to one another, but did not re-engage. Calder focused on protecting his newly won prizes, while the French Admiral Villeneuve declined to force another engagement.\"Trial of Vice-Admiral Robert Calder\", The Naval Chronicle 1806, p. 79. Villeneuve left on 24 July, sailing to Ferrol, and eventually Cádiz, instead of resuming his course to Brest. Villeneuve had failed in all his objectives: he had landed no troops in Ireland, and the plan of linking with the fleet at Brest, driving off the British Channel squadrons, and supporting Napoleon's invasion of Britain came to nothing: the Armée d'Angleterre waited uselessly at Boulogne as before. "]}, {"page": "Addlestone", "response": ["* 1816 Vice Admiral Charles Stirling, listed in deeds as Admiral Stirling but Vice-Admiral"]}, {"page": "Philip Southcote", "response": ["* 1816              Vice Admiral Charles Stirling, listed in deeds as Admiral Stirling but Vice-Admiral"]}, {"page": "HMS Glory (1788)", "response": ["Glory served as the flagship of Rear-Admiral Sir Charles Stirling at the Battle of Cape Finisterre in 1805, commanded by Captain Samuel Warren."]}, {"page": "HMS Ardent (1796)", "response": ["By September 1804 Ardent was part of the Dungeness squadron of Rear-Admiral Thomas Louis watching Boulogne.Michael Phillips.Ardent (64) (1796). Michael Phillips' Ships of the Old Navy. Retrieved 28 March 2021. In February 1805 Ardent served again as a temporary flagship, this time of Admiral Lord Keith in the North Sea. In January–February 1807, Ardent formed part of the flotilla operating on the River Plate that supported British troops during the Battle of Montevideo. Rear-Admiral Charles Stirling's ships provided seamen to assist in transporting the siege train to Montevideo, and Ardent lost one seaman killed, and a midshipman and four seamen wounded.Michael Phillips.Ardent (64) (1796). Michael Phillips' Ships of the Old Navy. Retrieved 28 March 2021. In 1808 she was assigned to convoy duty, escorting British merchantmen between The Nore and Gothenburg."]}, {"page": "HMS Pompee (1793)", "response": ["Under Captain Charles Stirling, she fought at the Battle of Algeciras Bay in 1801. In 1807 the ship, under the command of Captain Richard Dacres served in the Mediterranean squadron under Rear-Admiral Sir Sydney Smith,pp.15-20, Howard as part of the Vice-Admiral Duckworth's Dardanelles Operation and later the Alexandria expedition of 1807."]}, {"page": "Commander-in-Chief, Africa (Royal Navy)", "response": ["*Rear Admiral Charles Stirling, (1807–08) "]}, {"page": "HMS Mermaid (1784)", "response": ["While patrolling off the Penmarks on 29 June 1798 Mermaid, , and  came across the French frigate , which was bound for Lorient.James (1837), Vol. 2, p. 219. At the action of 30 June 1798, The British squadron manoeuvred to cut Seine off from land, but Mermaid soon lost contact, leaving Pique, under Captain Milne, and Jason under Captain Charles Stirling, to chase down the Frenchman."]}, {"page": "HMS Forester (1806)", "response": ["In 1812 Commander Alexander Kennedy replaced Watt. On 23 March 1813 Forester sailed to Jamaica to replace , which had recently returned to Spithead. Foresters orders were to accompany  as escort to a convoy and there to place herself under the orders of Admiral Charles Stirling."]}, {"page": "HMS Druid (1783)", "response": ["On 1 May 1806 Druid chased the French brig corvette Pandour, bound for France from Senegal, 160 miles into Rear Admiral Charles Stirling's squadron where she was brought to; Druid had to share the prize money with Stirling's entire squadron and so earned relatively little for the long chase. Pandour was under the command of M. Malingre and had a crew of 114 men. She had been armed with eighteen 6-pounder guns, but her crew had thrown two of the guns overboard during the chase. Stirling instructed Broke to bring her into Plymouth, where they arrived on 9 May."]}, {"page": "HMS Jason (1794)", "response": ["Jason initially served in the English Channel, at first under Douglas, and then by 1795 under Captain Charles Stirling. Stirling remained the Jasons commander for the rest of her career. In a highly active career against French shipping he took at least six French vessels, including two that later became part of the Royal Navy."]}, {"page": "Trafalgar campaign", "response": ["Nelson had sent despatches back to the Admiralty aboard the brig . While sailing across the Atlantic Curieux had, on 19 June, spotted the combined Franco-Spanish fleet, sailing northwards from Antigua. Curieux shadowed them, and determined that they were not heading for the Straits as Nelson had predicted, but were instead likely to arrive in the Bay of Biscay. The despatches and news of the latest sighting were rushed to Lord Barham at the Admiralty, who instructed a reinforced fleet under Vice-Admiral Robert Calder to attempt to intercept the combined fleet as it arrived off Cape Finisterre. Calder duly received an extra five ships of the line under Rear-Admiral Charles Stirling and on 22 July the enemy fleet was sighted heading westwards towards Ferrol."]}, {"page": "HMS Pique (1795)", "response": ["While patrolling off the Penmarks on 29 June 1798 she and her consorts  and  came across the French frigate Seine. Seine had crossed the Atlantic from the West Indies and was bound for a French port. The British squadron manoeuvred to cut her off from land, but the Mermaid, under Captain James Newman-Newman, soon lost contact, leaving Pique under Milne and Jason under Captain Charles Stirling, to chase down the Frenchman."]}, {"page": "Allemand's expedition of 1805", "response": ["Allemand sailed from Rochefort on 16 July while the blockade squadron under Rear-Admiral Charles Stirling was out of position, rapidly escaping the coast into the Atlantic. On 17 July, the squadron outran and captured the British corvette or sloop-of-war , rated as 16 guns but actually carrying 24. Ranger's crew had observed the approaching French squadron from some distance, and Commander Charles Coote had ordered that once their capture was inevitable, the crew were to cause as much damage as possible to their vessel to deny its use to the French. So successful were these efforts that Allemand was forced to burn Ranger once her crew had been removed as prisoners of war. Allemand subsequently reached his first station, off The Lizard, the day after capturing Ranger. There he waited in vain for the fleet under Ganteaume, which had never departed Brest. Following his instructions, Allemand then sailed for the Bay of Biscay, where he was to meet the fleet under Villeneuve that had been ordered north to join with Ganteaume. He passed southwards during July and was in the region of Cape Finisterre on 22 July: later records show that he was close enough to the site of the Battle of Cape Finisterre to have participated in the engagement if he had been aware that it was under way.Clowes, p. 118 News of Allemand's presence reached Villeneuve early in August and on 5 August he despatched the frigate  in search of the Rochefort squadron. Didon was followed on 9 August by the main fleet, including 29 ships of the line and associated frigates and corvettes. Villeneuve passed up the Spanish coast, anchoring off the village of Zerez, near Ferrol, on 10 August and departing the following day in a west by northwest direction. On 13 August the fleet was spotted by the frigates  under Captain Edward Brace and  under Captain Thomas Dundas, who were forced to flee a French detachment sent in pursuit, losing sight of the enemy on 14 August as Villeneuve's main force continued to the northwest.James, Vol. 4, p. 17"]}, {"page": "Order of battle in the Algeciras campaign", "response": ["| align= left | Captain Charles Stirling"]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|Charles Stirling||19/06/1806||28 April 1760 – 7 November 1833", "|Edward Charles Stirling||01/06/1893||8 September 1848 – 20 March 1919"]}, {"page": "Algeciras campaign", "response": ["At 07:00, Saumarez ordered his squadron to advance into the bay without delay and engage the French directly, the attack to be led by Captain Samuel Hood in HMS Venerable. Hood was delayed by light winds however, and the first ship into action was HMS Pompée under Captain Charles Stirling, which attacked the anchored French ships in succession before anchoring close to Formidable.James, p. 115 Pompée was followed by HMS Audacious, Saumarez's flagship HMS Caesar and HMS Hannibal, with Venerable and  HMS Spencer participating at a greater distance due to the unreliable wind.Clowes, p. 461 By 10:00 both squadrons were fully engaged except for Pompée at the head of the British line which had been caught by a current and swung so that the ship's bow was facing Formidable's broadside, allowing Linois to rake the British ship.James, p. 116 Seeing the danger Stirling was in, Saumarez ordered Captain Solomon Ferris to take Hannibal around the head of the French line and rake Formidable. In the light wind, Ferris took almost an hour to reach the head of the lines, but as he turned inshore, Hannibal grounded on a shoal directly under the guns of the Spanish fort at Torre de Almirante.Clowes, p. 463"]}, {"page": "First Battle of Algeciras", "response": ["Delayed during 5 July by contrary winds, Saumarez's squadron did not reach Algeciras until 07:00 on 6 July, the British admiral deciding to immediately descend on the French squadron and issuing orders for his ships to launch their small boats \"in readiness to act when required\".Clowes, p. 461 Thousands of spectators lined both the Spanish and Gibraltan shoreline in anticipation of the battle to come.Mostert, p. 407 Orders had been given for HMS Venerable under Captain Samuel Hood to lead the attack as the officer with most experience in these waters, and his vessel was the first to enter the bay around Cabrita Point. Once in the bay however, the wind dropped and Hood was left becalmed. As a result, the first shots of the engagement were fired from a battery on Cabrita Point at HMS Pompee under Captain Charles Stirling, which entered the bay at 07:50, followed closely by HMS Audacious under Captain Shuldham Peard. On sighting the British squadron, Linois gave orders for the French ships to warp into the shallower waters along the shoreline, and many sailors and soldiers aboard were despatched to assist the Spanish gun batteries around the bay.Mostert, p. 404 The French ships joined the fire as Pompee and Audacious came within range, first Muiron and then the ships of the line attacking the approaching British vessels.Musteen, p. 35"]}, {"page": "Charles Inglis (Royal Navy officer, died 1833)", "response": ["Inglis was born the son of Captain Charles Inglis, a distinguished officer who had served in the navy since 1745, and who rose to the rank of rear-admiral before his death in 1791. He followed his father in embarking on a career in the navy, and was serving off the French coast as first lieutenant of the 32-gun frigate  in 1798. While patrolling off the Penmarks on 29 June 1798 she and her consorts  and  came across the French frigate Seine. The Seine had crossed the Atlantic from the West Indies and was bound for a French port. The British squadron manoeuvred to cut her off from land, but the Mermaid, under Captain James Newman-Newman, soon lost contact, leaving the Pique under Captain David Milne and the Jason under Captain Charles Stirling, to chase down the Frenchman. After a chase lasting the entire day, all three ships ran aground on the French coast, but continued to bring their guns to fire upon each other, until HMS Mermaid returned to the scene, forcing the French to surrender. Seine was brought into the navy as HMS Seine. Stirling had been wounded early in the engagement and was forced to go below to seek treatment, leaving Inglis in command. Inglis acquitted himself well, prompting Stirling to write in his official report to Lord Bridport that 'no man could have filled my place with more credit to himself, and benefit to the state, than my First Lieutenant, Mr. Charles Inglis, whom I beg leave to recommend in the strongest manner for his bravery, skill and great exertions.'"]}, {"page": "Capture of HMS Savage", "response": ["By 1781 the smaller British vessels blockading Chesapeake Bay were raiding the American coast by means of boat expeditions. One commander involved in the operations was Captain Charles Stirling of the sloop Savage, armed with sixteen 6-pounders. Stirling was noted for having plundered Mount Vernon, the Virginia estate of General George Washington, who was commander in chief of the Continental Army and later the first American president."]}, {"page": "Samuel Warren (Royal Navy officer)", "response": ["Left without a ship during the peace, the outbreak of the Napoleonic Wars provided further opportunities for Warren. He was asked by Rear-Admiral William Domett to be his flag captain, and commissioned the 98-gun . Domett was unable to raise his flag due to ill-health, and instead Glory became the flagship of Rear-Admiral Sir Charles Stirling. Stirling retained Warren as his flag-captain, and Glory sailed in July 1805 to join the fleet amassing off Cape Finisterre under Vice-Admiral Robert Calder, with orders to intercept a Franco-Spanish fleet under Vice-Admiral Pierre-Charles Villeneuve. Calder successfully made the interception and Warren commanded Glory at the Battle of Cape Finisterre on 22 July 1805."]}, {"page": "Order of battle in the Croisière de Bruix", "response": ["| align= left | Captain Charles Stirling"]}, {"page": "Stirling (surname)", "response": ["*Sir Charles Stirling (1760–1833), vice-admiral in the Royal Navy", "*Sir Edward Charles Stirling (1848–1919), South Australian anthropologist"]}, {"page": "Battle of the Raz de Sein", "response": ["These sails belonged to three ships of Bridport's fleet. At 11:00 on 21 April the British fleet had been cruising in the Iroise Passage when two sails were sighted approximately  to the east. Bridport ordered his three most easterly ships to detach and investigate the sails: the 74-gun ships of the line HMS Mars under Captain Alexander Hood, HMS Ramillies under Captain Henry Inman and the 38-gun frigate HMS Jason under Captain Charles Stirling.Clowes, p. 336 The strong winds favoured the large ships of the line as they pursued the strange sails,Woodman, p. 101 which were identified as French, until at 14:00 they were pulling abreast of them when a third sail was sighted about  to the southeast, sailing close to the shore.James, p. 107"]}, {"page": "Action of 30 June 1798", "response": ["In the early years of the French Revolutionary Wars, although the French Navy had sought to oppose the Royal Navy at sea from their main base at Brest in Brittany, the Royal Navy had achieved victories at the Glorious First of June and Battle of Groix. The losses inflicted on the French Atlantic fleet in these battles were compounded by large numbers of ships wrecked in storms during the disastrous Croisière du Grand Hiver and Expédition d'Irlande operations.Gardiner, Fleet Battle and Blockade, p.16 By 1798 the Royal Navy was unopposed in its control of the Atlantic, enforcing its supremacy by a strategy of close blockade, maintaining a battle fleet at sea off Brittany and an inshore squadron of frigates watching the approaches to Brest.Woodman, p.100 In June 1798 the inshore squadron included a detachment comprising the 38-gun HMS Jason under Captain Charles Stirling, the 36-gun HMS Pique under Captain David Milne and 32-gun HMS Mermaid under Captain James Newman-Newman.James, Vol.2 p.219", "| align= left | Captain Charles Stirling"]}, {"page": "William Cunningham Dalyell", "response": ["On 29 June, Pique was part of an inshore squadron comprising the 38-gun HMS Jason under Captain Charles Stirling, and 32-gun HMS Mermaid under Captain James Newman-Newman, which along with the Channel Fleet, maintained a tight blockade on the French port of Brest.James (p.219) The 40-gun French frigate Seine was returning home from Port Louis with 280 troops aboard when at 07:00 she was spotted by the British squadron in the Bay of Biscay, heading north towards the Penmarch Rocks off the south coast of Finistère. She was quickly headed off by Mermaid, forcing her to go-about. This sudden tacking put Mermaid out of the chase but Pique and Jason remained in pursuit. The latter was able to prevent Seine seeking refuge in Lorient and by 21:00 Pique came within range and opened up with her bow chasers."]}, {"page": "French brig Pandour (1804)", "response": ["British records report that on 1 May , Captain Philip Broke, chased Pandour, bound for France from Senegal, 160 miles into Rear Admiral Charles Stirling's squadron where she was brought to; Druid had to share the prize money with Stirling's entire squadron and so earned relatively little for the long chase. Pandour was under the command of M. Malingre and had a crew of 114 men. She had been armed with eighteen 6-pounder guns, but her crew had thrown two of the guns overboard during the chase. Stirling instructed Broke to bring her into Plymouth, where they arrived on 9 May."]}, {"page": "Jamaica Station (Royal Navy)", "response": ["* Vice-Admiral Charles Stirling (1811–12)"]}, {"page": "Muiravonside Country Park", "response": ["left|thumb|Charles Stirling died at Muiravonside in 1867", "In 1835, the estate was sold to Charles Stirling whose sixteen children included General Sir William Stirling K.C.B. This was a time of agricultural improvement in Scotland and Sir Charles Stirling aimed to make the estate as self-sufficient as possible. He built the lime kilns, that can still be seen on the estate, and his own clay drain works. He turned an old grain mill into a sawmill and oversaw the Muiravonside Coalfield, which had been operating since the 18th century. Charles was not the first to marry his cousin and Charles married Charlotte Dorothea Stirling who was the daughter of the late Vice-Admiral Sir Charles Stirling in 1835. They had four sons and three daughters. When Charles died in 1867 at Muiravonside, the estate went to his eldest son Andrew who was a lawyer.", "During World War I, 11 British soldiers were billeted in the house, which was, by then, partially let out. Thomas Willing Stirling, last of the Stirlings to be buried in the family burial ground on the estate died in 1930, the estate went to his eldest son Sir Arthur Charles Stirling, who remained there until his death on 21 February 1967. It was his intention, having no male heir, the estate should go to his sister. However Stirling's cousin, Sir Norman Charles Stirling objected on the grounds of entail, which resulted in long and protracted court proceedings. Ten years later the case, Stirling TRS vs Stirling, was settled in favour of Sir Arthur Charles will, by then the house was ruined. A considerable amount of money would be needed to make the estate again viable. The new owner being of considerable age and with no intimate concern for the estate, sold part of the estate to what was then Falkirk District Council in 1977. The once grand house was deemed unsafe and it was demolished as part of the estate's restoration as Falkirk's first country park in the 1970s."]}]}}