{"wiki_id": "http://www.wikidata.org/entity/Q7964200", "itemLabel": "Walter Ayles", "itemDescription": "British politician (1879-1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Ayles", "wikipedia_page": {"main": "Walter Henry Ayles (24 March 1879 – 6 July 1953) was a British Labour Party politician who served as a Member of Parliament (MP) for 11 years between 1923 and 1953.", "link_mentions": [{"page": "List of United Kingdom MPs: A", "response": ["* Walter Ayles (1923–1924, 1929–1931, 1945–1953)"]}, {"page": "List of MPs elected in the 1945 United Kingdom general election", "response": ["|Walter Ayles"]}, {"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|Walter Ayles"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|Walter Ayles"]}, {"page": "Hayes and Harlington (UK Parliament constituency)", "response": ["| Walter Ayles"]}, {"page": "Bristol East (UK Parliament constituency)", "response": ["*Independent Labour Party: Walter Ayles"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Walter Ayles"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Walter Ayles"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Walter Ayles"]}, {"page": "Southall (UK Parliament constituency)", "response": ["| Walter Ayles"]}, {"page": "No More War Movement", "response": ["After Brockway resigned in 1929, and secretaries Walter Ayles and Lucy Cox left in 1932, the group foundered. Reginald Reynolds, a Quaker influenced by Gandhi, became general secretary, but he could not stop a drift of members to the communist British Anti-War Movement and the New Commonwealth Society. Anarchists became increasingly prominent, but most left after the Movement, in accordance with its pacifist principles, refused to support the fighting of either side in the Spanish Civil War. In 1937 the organisation formally merged with the Peace Pledge Union, although the Midlands Council of the NMWM retained an independent existence for a year or so."]}, {"page": "Walter Henry Ayles", "response": ["#REDIRECT Walter Ayles"]}, {"page": "Robert Bernays", "response": ["He stood unsuccessfully for Parliament as a Liberal at Rugby in the 1929 general election (losing, after the campaign was interrupted and polling delayed for six weeks by the Labour candidate's death, to the incumbent Conservative, the future Chief Whip David Margesson);In 1938, during a dinner-party conversation with Bernays, Margesson admitted that he might have lost the election but for this \"miracle\": see Nick Smart, ed. The Diaries and Letters of Robert Bernays, 1932–1939: An Insider's Account of the House of Commons (Lewiston/Queenston/Lampeter: The Edwin Mellen Press, 1996), p. 377 but, following the positive reception afforded Naked Fakir, he was adopted as Liberal candidate for Bristol North – a seat once held by the distinguished Liberal Cabinet Minister Augustine Birrell – at the 1931 general election.  He was elected with a majority of 13,214 over the incumbent, Labour MP Walter Ayles, who had twice won the seat, in 1923 and 1929, when the non-Labour vote was split between two other candidates. That there was no Conservative candidate, in an election that saw the Conservatives win 55% of the national vote, does much to explain the size of Bernays's majority; and this fact, coupled with Ayles's record of winning when he had two opponents rather than one – he lost to a single Liberal rival in both 1922 and 1924, while beating a Liberal and a Conservative in 1923 and a Liberal and an independent in 1929 – likewise explains why, throughout the period 1931–1935, one of Bernays's chief preoccupations was to ensure that the Conservatives should hold him in sufficiently high esteem to refrain from opposing him at the next election. (Writing to his married sister Lucy Brereton in July 1935, he commented that \"my problem is not to capture the Liberal vote but to hold the Conservatives\".)Diaries and Letters, p. 210"]}, {"page": "United Kingdom general election records", "response": ["*Walter Ayles, George Isaacs, Somerville Hastings, Jennie Lee, Leah Manning and Lucy Noel-Buxton, 1945: 14 years after their defeat"]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":Walter Ayles: Bristol North1; Southall 4; Hayes and Harlington 3", ":Walter Ayles: 1929, 1945"]}, {"page": "List of eponymous roads in London", "response": ["| Clement Attlee, Walter Ayles, Ernest Bevin, Margaret Bondfield, Keir Hardie, Herbert Morrison, Sidney Webb and Beatrice Webb"]}, {"page": "1911 Bristol East by-election", "response": ["*Independent Labour Party: Walter Ayles"]}, {"page": "1953 Hayes and Harlington by-election", "response": ["The 1953 Hayes and Harlington by-election was held on 1 April 1953 after the resignation of the Labour MP Walter Ayles.  It was won by the Labour candidate Arthur Skeffington."]}, {"page": "Women's Labour League", "response": ["*Bertha Aylesappears in the 1911 census at 12 Station Road, Ashley Down, Bristol no occupation shown aged 34 living with her husband Walter Ayles."]}, {"page": "Bristol Trades Council", "response": ["The new unionism of the 1890s was supported by the trades council, and many new unions affiliated during the 1890s, taking total membership to around 10,000.  During this period, it supported a wide variety of industrial action, and convinced the city council to pay its workers at union rates.  It affiliated to the Labour Representation Committee, and became the body organising Labour Party activity in Bristol until 1918.  It suffered divisions during World War I, with Walter Ayles leading opposition to the war, while Frank Sheppard and William Whitefield led support for it.  After extended debates, it decided to oppose conscription."]}, {"page": "National Administrative Council", "response": ["|rowspan=13| Walter Ayles"]}, {"page": "Ayles", "response": ["* Walter Ayles (1879–1953), British Labour Party politician"]}]}}