{"wiki_id": "http://www.wikidata.org/entity/Q7965084", "itemLabel": "Walter Harrison", "itemDescription": "British politician (1921-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Harrison_(politician)", "wikipedia_page": {"main": "Walter Harrison PC (2 January 1921 – 19 October 2012) was a British Labour politician.", "link_mentions": [{"page": "Treasurer of the Household", "response": ["*Walter Harrison 1974–1979"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Walter Harrison"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Walter Harrison"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Walter Harrison"]}, {"page": "Bernard Weatherill", "response": ["In 1979, Weatherill played a critical role in the defeat of the Labour government in a vote of confidence. As the vote loomed, Labour's deputy Chief Whip, Walter Harrison, approached Weatherill to enforce the convention and gentleman's agreement (otherwise known as pairing) that if a sick MP from the Government could not vote, an MP from the Opposition would abstain to compensate. Labour MP Alfred Broughton was on his deathbed and could not vote, meaning the Government would probably lose by one vote. Weatherill said that the convention had never been intended for such a critical vote that meant the life or death of the Government and it would be impossible to find a Conservative MP who would agree to abstain. However, after a moment's reflection, he offered that he would abstain, because he felt it would be dishonourable to break his word to Harrison. Harrison was so impressed by Weatherill's offer (which would have effectively ended his political career) that he released Weatherill from his obligation, and the Government fell by one vote."]}, {"page": "List of MPs elected in the February 1974 United Kingdom general election", "response": ["|Walter Harrison"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Walter Harrison (1921–2012)"]}, {"page": "1921 in the United Kingdom", "response": ["** Walter Harrison, politician (died 2012)"]}, {"page": "Wakefield (UK Parliament constituency)", "response": ["| Walter Harrison"]}, {"page": "Pair (parliamentary convention)", "response": ["In 1979, the government of James Callaghan fell by one vote, partially due to Labour deputy whip Walter Harrison suspending the unspoken obligation of his Conservative counterpart Bernard Weatherill to pair for the terminally ill Labour backbencher Sir Alfred Broughton."]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| Walter Harrison"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| Walter Harrison"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| Walter Harrison"]}, {"page": "Labour government, 1964–1970", "response": ["|Walter Harrison||29 October 1968 – 19 June 1970|| "]}, {"page": "Labour government, 1974–1979", "response": ["|Treasurer of the Household||Walter Harrison||4 March 1974|| "]}, {"page": "Gene Hunt", "response": ["Philip Glenister was introduced to David Cameron, then UK Conservative leader, at the 2009 Police Bravery Awards. Glenister later quipped \"Six months later, he's [Cameron] on Radio 5 Live saying exactly what I've just said. B*****d nicked my line!\"  Glenister appeared in the 2012 stage play This House playing Labour Chief Whip from the 1970s, the late Walter Harrison."]}, {"page": "Steffan Rhodri", "response": ["* Walter Harrison in This House by James Graham; Garrick Theatre; 2016–2017 "]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Walter Harrison", "**Walter Harrison"]}, {"page": "Kirklees College", "response": ["* Walter Harrison, Labour MP from 1964–87 for Wakefield"]}, {"page": "1979 vote of no confidence in the Callaghan ministry", "response": ["=== Walter Harrison and Bernard Weatherill ===", "In the BBC documentary \"A Parliamentary Coup\" it was revealed that Bernard Weatherill played a critical role in the defeat of the government in the vote of confidence. As the vote loomed, Labour's deputy chief whip, Walter Harrison, approached Weatherill to enforce the pairing convention that if a sick MP from the government could not vote, an MP from the opposition would abstain to compensate. Weatherill said that pairing had never been intended for votes on matters of confidence that meant the life or death of the government and it would be impossible to find a Conservative MP who would agree to abstain. However, after a moment's reflection, he offered that he himself would abstain, because he felt it would be dishonourable to break his word with Harrison. Harrison was so impressed by Weatherill's offer – which would have effectively ended his political career – that he released Weatherill from his obligation and so the government fell by one vote on the agreement of gentlemen.The Night the Government Fell, BBC archive on the 1979 vote of confidence, audio interview of Weatherill and Harrison"]}, {"page": "Chantry Chapel of St Mary the Virgin, Wakefield", "response": ["Renewal to the external stonework cost £30,000 in a project by William Anelay Ltd. Six new carved stone heads were made for the south side of the building. At the suggestion of architect David Greenwood, the Bishop of Wakefield, the Lady St Oswald of Nostell Priory, the Rt Hon Walter Harrison and Canon Bryan Ellis allowed their features to be sculpted by stonemason John Schofield. The fifth head is that of a founder of the Friends, Ray Perraudin, and the sixth one of Anelay's workmen. The friends have conserved the internal stone heads whose age is unknown."]}, {"page": "2012 in the United Kingdom", "response": ["**Walter Harrison, 91, politician, MP for Wakefield (1964–1987), Government Deputy Chief Whip (1974–1979)."]}, {"page": "Deaths in October 2012", "response": ["*Walter Harrison, 91, British politician, MP for Wakefield (1964–1987), Government Deputy Chief Whip (1974–1979)."]}, {"page": "This House (play)", "response": ["!Walter Harrison, Labour deputy chief whip"]}]}}