{"wiki_id": "http://www.wikidata.org/entity/Q7964166", "itemLabel": "Walter Andrews", "itemDescription": "cricketer (1865-1908)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Andrews_(cricketer)", "wikipedia_page": {"main": "Walter Herman Andrews (17 April 1865 – 26 November 1908) was an English first-class cricketer who played for Sussex County Cricket Club.  His highest score of 67 came when playing for Sussex against Gloucestershire County Cricket Club.He also played three non first-class games for Sussex against Hampshire.", "link_mentions": [{"page": "Walter Andrews", "response": ["Walter Andrews may refer to:", "* Walter Andrews (cricketer) (1865–1908), English cricketer", "* Walter Andrews (cyclist) (1881–1954), Canadian Olympic cyclist", "* Walter Andrews (bishop) (1852–1932), Anglican bishop in Japan"]}, {"page": "Henry Andrews (cricketer)", "response": ["Andrews lived at Blackheath Park in KentList of subscribers of £2,000 and upwards to the railway subscription, 14th Volume - Railways, Accounts and Papers of the House of Commons, Volume 38, p.8. House of Commons: 1846. Retrieved 2018-09-22. and was a member of the London Stock Exchange. He married Harriet Terrey, the couple having 11 sons one of whom, Walter, played first-class cricket for Sussex between 1888 and 1892.Walter Andrews, CricketArchive. Retrieved 2018-09-22. "]}, {"page": "Tom Buckland", "response": ["Buckland made two first-class appearances for Nottinghamshire in 1888, against Sussex and Surrey, with both matches played at Trent Bridge.  In his first match, Sussex won the toss and elected to bat, making 97 all out in their first-innings, with Buckland taking the wickets of Walter Andrews and Walter Humphreys to finish with figures of 2/13 from thirteen overs.  Nottinghamshire responded in their first-innings by making 240 all out, with Buckland ending the innings not out on 9.  Sussex were then dismissed for just 69 in their second-innings, with Buckland once again taking two wickets, those of Willie Quaife and Andrews, taking figures of 2/20 from fourteen overs.  Nottinghamshire won by an innings and 74 runs.  In his second match, Nottinghamshire won the toss and elected to bat first, making 187 all out, with Buckland scoring 12 runs before he was dismissed by Thomas Bowley.  Surrey responded to that by making 237 all out in their first-innings, during which he bowled seventeen wicketless overs, conceding 25 runs.  In their second-innings, Nottinghamshire made 131 all out, with Buckland run out for 2, to set Surrey 82 for victory.  Surrey reached that target in their second-innings with just one wicket lost, with Buckland bowling eight wicketless overs in it."]}]}}