{"wiki_id": "http://www.wikidata.org/entity/Q7963129", "itemLabel": "Wallis Clark", "itemDescription": "British actor (1882-1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wallis_Clark", "wikipedia_page": {"main": "Wallis Hensman Clark (2 March 1882 – 14 February 1961) was an English stage and film actor.", "link_mentions": [{"page": "It Happened One Night", "response": ["* Wallis Clark as Lovington"]}, {"page": "Lady for a Day", "response": ["* Wallis Clark as Police Commissioner [uncredited]"]}, {"page": "Yankee Doodle Dandy", "response": ["* Wallis Clark as President Theodore Roosevelt", "* Uncredited cast members include Eddie Acuff, Murray Alper, Ward Bond, Walter Brooke, Georgia Carroll, Glen Cavender, Spencer Charters, Wallis Clark, William B. Davidson, Ann Doran, Tom Dugan, Bill Edwards, Frank Faylen, Pat Flaherty, James Flavin, William Forrest, William Gillespie, Joe Gray, Creighton Hale, John Hamilton, Harry Hayden, Stuart Holmes, William Hopper, Eddie Kane, Fred Kelsey, Vera Lewis, Audrey Long, Hank Mann, Frank Mayo, Lon McCallister, Edward McWade, George Meeker, Dolores Moran, Charles Morton, Jack Mower, Paul Panzer, Francis Pierlot, Clinton Rosemond, Syd Saylor, Frank Sully, Dick Wessel, Leo White, Mickey Daniels and Dave Willock."]}, {"page": "Since You Went Away", "response": ["* Wallis Clark as Man at Cocktail Lounge (uncredited)"]}, {"page": "Penny Serenade", "response": ["* Wallis Clark as Judge"]}, {"page": "Mrs. Parkington", "response": ["* Wallis Clark as Capt. McTavish (uncredited)"]}, {"page": "Clark", "response": ["* Wallis Clark (1882–1961), English actor"]}, {"page": "Romeo and Juliet (1936 film)", "response": ["Uncredited cast includes Wallis Clark, Katherine DeMille, Fred Graham, Dorothy Granger, Ronald Howard, Lon McCallister, and Ian Wolfe.Full cast and credits at Internet Movie Database"]}, {"page": "List of actors who played the president of the United States", "response": ["|rowspan=2| Wallis Clark || Yankee Doodle Dandy || 1942"]}, {"page": "Tombstone, the Town Too Tough to Die", "response": ["* Wallis Clark as Ed Schieffelin"]}, {"page": "Mutiny on the Bounty (1935 film)", "response": ["* Wallis Clark as Morrison"]}, {"page": "The World Gone Mad", "response": ["* Wallis Clark as Dist. Atty. Avery Henderson"]}, {"page": "Jack London (film)", "response": ["* Wallis Clark as Theodore Roosevelt (uncredited)"]}, {"page": "Follow the Boys", "response": ["* And Molly Lamont, Doris Lloyd, Nelson Leigh, Lane Chandler, Cyril Ring, Emmett Vogan, Addison Richards, Stanley Andrews, Frank Jenks, Ralph Dunn, Billy Benedict, Howard C. Hickman, Edwin Stanley, Wallis Clark, Richard Crane, Frank Wilcox, Clyde Cook, Bobby Barber, Walter Tetley, Anthony Warde, William Forrest, Dennis Moore, Duke York, Carlyle Blackwell, Edwin Stanley, Charles King Introduction by Arthur Knight"]}, {"page": "List of actors who have appeared in multiple Best Picture Academy Award winners", "response": ["* Most Appearances in Best Picture Nominees -  Actors who appeared in the most Best Picture nominees are: Bess Flowers (23 films - all uncredited), Ward Bond (13 films, 4 uncredited), Robert De Niro (11 films, 1 uncredited), Franklyn Farnum (11 films - all uncredited), Jack Nicholson (10 films), Leonardo DiCaprio (9 films), William Holden (9 films), Spencer Tracy (9 films), Elizabeth Taylor (9 films, 2 uncredited), Gary Cooper (9 films), Tom Hanks (9 films), Al Pacino (8 films), Lionel Barrymore (8 films), Olivia de Havilland (8 films), Daniel Day-Lewis (8 films), Robert Duvall (8 films, 1 uncredited), Henry Fonda (8 films), Harrison Ford (8 films), John Gielgud (8 films), Dustin Hoffman (8 films), Burt Lancaster (8 films), Reginald Owen (8 films), Gregory Peck (8 films), Claude Rains (8 films), Tom Wilkinson (8 films), Brad Pitt (8 films), Cate Blanchett (7 films), Beulah Bondi (7 films), Marlon Brando (7 films), John Carradine (7 films), Wallis Clark (7 films, 6 uncredited), Gladys Cooper (7 films), Finlay Currie (7 films), Katharine Hepburn (7 films), Harvey Keitel (7 films, 1 uncredited), Deborah Kerr (7 films), Elsa Lanchester (7 films), Fredric March (7 films), Laurence Olivier (7 films, 1 uncredited), James Stewart (7 films), Bette Davis (7 films), Meryl Streep (7 films), and Michael Stuhlbarg (7 films).", "* Most Appearances in Best Picture Winners -  Actors who appeared in the most Best Picture winners are: Franklyn Farnum (7 films), Wallis Clark (5 films), and Bess Flowers (5 films).", "* Most Consecutive Appearances -  Actors who appeared in three consecutive Best Picture winners are: Wallis Clark (1934 through 1936) and Harry Davenport (1937 through 1939)."]}, {"page": "Allegheny Uprising", "response": ["* Wallis Clark as Sgt. McGlashan"]}, {"page": "Hell's House", "response": ["* Wallis Clark as Judge Robinson"]}, {"page": "The Last of Mrs. Cheyney (1937 film)", "response": ["* Wallis Clark as George"]}, {"page": "Big City Blues (1932 film)", "response": ["*Wallis Clark as Chief of Police"]}, {"page": "Double Harness", "response": ["Joan prods her husband into taking an interest in his family business. To his surprise, he finds that he enjoys it. As the new Postmaster General (Wallis Clark) is a good friend of her father's, Joan invites him to dinner, hoping to land a government contract for John's company.", "* Wallis Clark as Postmaster General Oliver Lane"]}, {"page": "They Just Had to Get Married", "response": ["*Wallis Clark as Fairchilds"]}, {"page": "First Yank into Tokyo", "response": ["* Wallis Clark as Dr. Langley"]}, {"page": "The Unguarded Hour", "response": ["*Wallis Clark as Inspector Grainger"]}, {"page": "Shopworn", "response": ["*Wallis Clark as Mr. Dean "]}, {"page": "Ever in My Heart", "response": ["* Wallis Clark as Enoch Sewell (uncredited) "]}, {"page": "Escape by Night (1937 film)", "response": ["*Wallis Clark as District Attorney Baldwin"]}, {"page": "Star Reporter", "response": ["Star Reporter, John Randolph (Warren Hull), with his fiancée, Barbara Burnette, (Marsha Hunt), has faith in her father, D.A. William Burnette (Wallis Clark), and throws the full weight of his newspaper behind him, in hopes of tracking down his own father's killer.", "*Wallis Clark as District Attorney William Burnette"]}, {"page": "Murder by Invitation", "response": ["*Wallis Clark as Judge Moore"]}, {"page": "She Had to Choose", "response": ["*Wallis Clark as District Attorney"]}, {"page": "Postal Inspector", "response": ["*Wallis Clark as Inspector Gil Pottle"]}, {"page": "Blondie Meets the Boss", "response": ["* Wallis Clark as Henry W. Philpot "]}, {"page": "Attorney for the Defense", "response": ["* Wallis Clark as District Attorney James A. Crowell"]}, {"page": "Transatlantic Merry-Go-Round", "response": ["* Wallis Clark as Ship's Captain (uncredited)"]}, {"page": "The Remarkable Andrew", "response": ["*Wallis Clark as City Treasurer R. R. McCall"]}, {"page": "Missing Girls", "response": ["*Wallis Clark as Senator Benson"]}, {"page": "The Big Guy", "response": ["* Wallis Clark as District Attorney"]}, {"page": "Washington Merry-Go-Round (film)", "response": ["*Wallis Clark as Carl Tilden (uncredited) "]}, {"page": "Luxury Liner (1933 film)", "response": ["*Wallis Clark as Dr. Veith "]}, {"page": "The Captain from Köpenick (1945 film)", "response": ["* Wallis Clark as Friedrich Hoprecht"]}, {"page": "The Meanest Gal in Town", "response": ["*Wallis Clark as Mr. Bowen - Barbershop Customer (uncredited)"]}, {"page": "Come Closer, Folks", "response": ["* Wallis Clark as Mr. Houston"]}]}}