{"wiki_id": "http://www.wikidata.org/entity/Q7966426", "itemLabel": "Walter William Skeat", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_William_Skeat_(anthropologist)", "wikipedia_page": {"main": "Walter William Skeat ( 14 October 1866 – 24 July 1953) was an English anthropologist. He made a name for himself mainly with his pioneering investigations into, and writings on, the ethnography of the Malay Peninsula.", "link_mentions": [{"page": "Gelert", "response": ["In Malaysian folklore, a similar story involves a tame bear, kept by a Malay hunter as the guardian of his young daughter. As in the story of Gelert, the hunter returns home from an expedition, and finds his daughter gone and the bear covered in blood. Hastily thinking the bear has devoured his daughter, the hunter kills it with his spear, but later finds the body of a tiger, killed by the bear in defence of the hunter's daughter, who shortly emerges from the jungle, from where she took refuge.Malay magic: an introduction to the folklore and popular religion of the Malay Peninsular, by Walter William Skeat, Charles Otto Blagden, edition: illustrated, published by Routledge, 1965, , , 685 pages"]}, {"page": "Walter William Skeat", "response": ["thumb|Walter William Skeat", "Walter William Skeat, FBA (21 November 18356 October 1912) was the pre-eminent British philologist of his time. He was instrumental in developing the English language as a higher education subject in the United Kingdom.", "Skeat's wife, Bertha Clara, born 6 February 1840, died 15 July 1924, is buried with him, as is a daughter Bertha Marian Skeat who was a writer and headmistress.Kenneth Sisam, \"Skeat, Walter William (1835–1912)\", rev. Charlotte Brewer, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2008 accessed 23 Feb 2017 His son was the anthropologist Walter William Skeat. His grandsons include the noted palaeographer T. C. Skeat and the stained glass painter Francis Skeat."]}, {"page": "Skeat", "response": ["* Walter William Skeat (1835–1912), philologist and etymologist", "* Walter William Skeat (anthropologist) (1866–1953), anthropologist"]}, {"page": "Kenaboi language", "response": ["In Walter William Skeat and Charles Otto Blagden's 1906 work \"Pagan Races of the Malay Peninsula\", the contents of three previously unpublished wordlists appear, two of which were collected by D.F.A. Hervey, a former government official in Malacca. There is no indication as to when these word lists were collected; however, there is a possibility that these wordlists were collected around the 1870s to 1890s."]}, {"page": "Langsuyar", "response": ["In his book Malay Magic, Walter William Skeat, an English anthropologist, recorded the origins of the langsuyar myth, as told by Malays in Selangor:"]}, {"page": "Charles Otto Blagden", "response": ["* 1906. With Walter William Skeat. Pagan races of the Malay Peninsula. London, Macmillan and Co."]}, {"page": "Ethel Skeat", "response": ["Ethel Gertrude Skeat was born on 14 May 1865, one of five children of Bertha (Jones) Skeat and Walter William Skeat, a professor of Anglo-Saxon at Cambridge University. Her brother Walter was an anthropologist."]}, {"page": "Bertha Marian Skeat", "response": ["Skeat was born in East Dereham in 1861. She was the first child of Bertha Clara and Walter William Skeat. She had five siblings including the anthropologist Walter William Skeat. Her father was a philologist. She was a student at Newnham College in Cambridge from 1882 to 1886 where she achieved a first-class examination result in medieval and modern languages. "]}, {"page": "Richard Henry Yapp", "response": ["Yapp was appointed botanist to Cambridge University's 1899–1900 expedition to the North-Eastern  Malay States, led by Walter William Skeat. Specimens he collected on the expedition went to the Cambridge University Herbarium, with some in the National Collection at Kew. The expedition also resulted in his paper, \"Two Malayan Myrmecophilous Ferns\"."]}]}}