{"wiki_id": "http://www.wikidata.org/entity/Q7964608", "itemLabel": "Walter Cox", "itemDescription": "English footballer and manager for Stoke (1849-1925)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Cox_(footballer,_born_1849)", "wikipedia_page": {"main": "Walter Cox (1849 – 1925) was an English footballer and manager for Stoke.", "link_mentions": [{"page": "Stoke City F.C.", "response": ["|  Walter Cox"]}, {"page": "Harry Lockett", "response": ["Lockett was born in Stoke-upon-Trent and was appointed manager-secretary of Stoke in 1884 replacing Walter Cox. He was Stoke manager when professionalism was introduced in August 1885, agreeing to pay his players, half-a-crown (13p) a week. However following a threat of strike action amongst the players when the club wished to introduce different pay levels, it was increased to five shillings (25p)."]}, {"page": "Walter Cox", "response": ["Walter Cox may refer to:", "*Walter Cox (footballer, born 1849) (1849–1945), English football player and manager with Stoke City", "*Walter Cox (footballer, born 1863) (1863–?), Scottish football goalkeeper with Hibernian, Burnley and Everton", "*Walter Cox (footballer, born 1872) (1872–1930), English football goalkeeper with Southampton and Manchester City", "*Walter Cox (baseball) (died 2006), head coach of Clemson Tigers from 1948 to 1951 and president of Clemson University"]}, {"page": "Jack Yates (footballer, born 1860)", "response": ["Yates played for Stone Miners Welfare before joining Stoke in 1883. He played in the club's first competitive match in the FA Cup against Manchester in a 2–1 defeat. He was released at the end of the 1883–84 season by manager Walter Cox. He later played for Sandbach Rangers."]}, {"page": "List of Stoke City F.C. managers", "response": ["Stoke's first secretary-manager was Thomas Slaney he also played for the club during his time in charge. He left in 1883 to set up the Staffordshire Football Association. Another ex-player, Walter Cox took over however his reign was a short one lasting just a year in that time he took Stoke into their first FA Cup match. Harry Lockett led Stoke into the Football League in 1888 but after two seasons of finishing last Stoke failed to gain re-election and Lockett left to work for The FA. Joseph Bradshaw took over from Lockett and has a successful first season winning the club's first league title, the Football Alliance and gained re-election to the Football League. Stoke struggled again in the League and Bradshaw was replaced by Arthur Reeves midway through the season. Reeves brought in a number of new players which had a good impact on the club but unfortunately Stoke's fortunes wavered and he was replaced by ex goalkeeper Bill Rowley."]}]}}