{"wiki_id": "http://www.wikidata.org/entity/Q7965358", "itemLabel": "Walter Kirke", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Kirke", "wikipedia_page": {"main": "General Sir Walter Mervyn St George Kirke,  (19 January 1877 – 2 September 1949) was the Commander in Chief of the British Home Forces during the Second World War.", "link_mentions": [{"page": "Jan Smuts", "response": ["By mid-January 1918, Lloyd George was toying with the idea of appointing Smuts Commander-in-Chief of all land and sea forces facing the Ottoman Empire, reporting directly to the War Cabinet rather than to Robertson.Woodward (1998), p. 164 Early in 1918, Smuts was sent to Egypt to confer with Allenby and Marshall, and prepare for major efforts in that theatre. Before his departure, alienated by Robertson's exaggerated estimates of the required reinforcements, he urged Robertson's removal. Allenby told Smuts of Robertson's private instructions (sent by hand of Walter Kirke, appointed by Robertson as Smuts' adviser) that there was no merit in any further advance. He worked with Smuts to draw up plans, using three reinforcement divisions from Mesopotamia, to reach Haifa by June and Damascus by the autumn, the speed of the advance limited by the need to lay fresh rail track. This was the foundation of Allenby's successful offensive later in the year.Woodward (1998), pp. 165–8"]}, {"page": "Edmund Allenby, 1st Viscount Allenby", "response": ["Smuts was sent to Egypt to confer with Allenby and Marshall (C-in-C Mesopotamia), with Robertson's clash with the government now moving to its final stages, and the new Supreme War Council at Versailles drawing up plans for more efforts in the Middle East. Allenby told Smuts of Robertson's private instructions (sent by hand of Walter Kirke, appointed by Robertson as Smuts' adviser) that there was no merit in any further advance. Allenby worked with Smuts to draw up plans to reach Haifa by June and Damascus by the autumn, reinforced by 3 divisions from Mesopotamia. The speed of the advance was limited by the need to lay fresh rail track. This met with War Cabinet approval (6 March 1918).Woodward, 1998, pp165-8"]}, {"page": "Home Guard (United Kingdom)", "response": ["When Britain declared war on Germany on 3 September 1939, debates began in official circles about the possible ways in which the German military might invade Britain. In the first week of the conflict, numerous diplomatic and intelligence reports seemed to indicate that there was the possibility of an imminent German amphibious assault.MacKenzie, S.P. (1995). The Home Guard: A Military and Political History. Oxford: Oxford University Press. 18-33. . Many government ministers and senior army officials, including the Commander in Chief Home Forces, General Walter Kirke, believed that the threat of invasion was greatly exaggerated and were sceptical, but others were not, including Winston Churchill, the new First Lord of the Admiralty."]}, {"page": "Kirke", "response": ["*Walter Kirke, English general"]}, {"page": "15th (Scottish) Infantry Division", "response": ["In October 1939, the Commander-in-Chief, Home Forces, General Walter Kirke, was tasked with drawing up a plan, codenamed Julius Caesar, to defend the United Kingdom from a potential German invasion. The division's role in this was largely to defend the Edinburgh and Forth areas. It was not until December that the division moved to undertake this role, with the 44th Brigade positioned astride the Firth of Forth. The rest of the division was based around Glasgow, on either side of the Firth of Clyde. On paper, an infantry division was to have seventy-two modern 25-pounder field guns. By November, the divisional artillery comprised just eight First World War-vintage  howitzers. By January, this had increased to sixteen  howitzers, in addition to eight First World War-era 18-pounder field guns."]}, {"page": "5th Infantry Division (United Kingdom)", "response": ["* 1929–1931 Lieutenant-General Walter Kirke"]}, {"page": "Edmund Ironside, 1st Baron Ironside", "response": ["His appointment as Commander-in-Chief, Home Forces was announced to the public on 27 May, succeeding Sir Walter Kirke. Ironside was succeeded as CIGS by his deputy, Sir John Dill.Ironside (1962), p. 335 In his new command, Ironside commanded a force which amounted – on paper – to Fifteen Territorial Infantry Divisions, a single armoured division, fifty-seven home-defence battalions, and the Local Defence Volunteers (later the Home Guard). However, all of these were deficient in training and organisation, as the operational units had already been sent to France. They were also lacking in equipment; the force as a whole had almost no modern artillery or anti-tank guns, and the armoured division had just a small number of light tanks.Ironside (1962), p. 340"]}, {"page": "Dorothy Lawrence", "response": ["In her later book, Lawrence writes that Dunn found her work as a sapper with the 179 Tunnelling Company, 51st Division, Royal Engineers, a specialist mine-laying company that operated within  of the front line. Lawrence writes that she was involved in the digging of tunnels. But later evidence and correspondence from the time after her discovery by British Army authorities, including from the files of Sir Walter Kirke of the BEF's secret service, suggest that she did not undertake this highly skilled digging work, but was at liberty and working within the trenches.", "In 2003, Richard Bennett, the grandson of Richard Samson Bennett who was one of the soldiers who had helped Lawrence in France, found note of her within the correspondence files of Royal Engineers Museum in Chatham, Kent. On further investigation, East Sussex historian Raphael Stipic found a letter written by Sir Walter Kirke about Lawrence. Military historian Simon Jones then found a copy of Lawrence's book at the REM and started collecting notes to write a biography."]}, {"page": "55th (West Lancashire) Infantry Division", "response": ["The war deployment plan for the TA envisioned its divisions being sent overseas, as equipment became available, to reinforce the British Expeditionary Force (BEF) that had already been dispatched to Europe. The TA would join regular army divisions in waves as its divisions completed their training, the final divisions deploying a year after the war began. In October 1939, the Commander-in-Chief, Home Forces, General Walter Kirke, was tasked with drawing up a plan, codenamed Julius Caesar, to defend the United Kingdom from a potential German invasion. As part of this plan, the division was assigned to Home Forces' reserve. It was transferred to Northern Command and moved to Charnwood Forest in Leicestershire. Here the division furthered its training, while also having to be ready to act as a counter-attack force for Julius Caesar in case of a German invasion between the Humber and The Wash. Other duties included the protection of RAF Finningley."]}, {"page": "Aide-de-camp general", "response": ["| General Sir Walter Kirke || 12 October 1937 || 1 July 1940 ||"]}, {"page": "9th (Highland) Infantry Division", "response": ["In October 1939, Commander-in-Chief, Home Forces Walter Kirke was tasked with drawing up a defensive plan to defend the United Kingdom from a German invasion, which was codenamed Julius Caesar. In November 1939, the division was assigned a role in this initial defensive plan, which it retained until 1940. The plan envisioned troops in the affected area immediately locating and defeating German parachutists, or cordoning off and thereby immobilising any German forces until the division could be relieved. On 6 March, Lindsay returned to retirement. He was replaced by Major-General Edward Beck, who had been the Director of Personal Services at the War Office. Following the German invasion of Norway, the Admiralty grew concerned at the capability of German airborne forces and the threat they posed to Scapa Flow, or of a large-scale attack against eastern Scotland. Kirke dismissed the feasibility of such an attack, and believed that East Anglia or the south coast were the areas in imminent danger of invasion as a result of the German operations on mainland Europe. Because of the anticipated threat to the south, the 9th (Highland) was left as the sole division in Scotland. It was envisioned that the TA divisions each be deployed intact to reinforce the regular army formations in France as equipment became available, with all 26 TA divisions deployed by the end of the first year of the war. As a result of the tempo of the Battle of France and the Dunkirk evacuation, the division did not leave Britain. On 26 June 1940, Beck was replaced by Major-General Alan Cunningham who had previously commanded the 5th Anti-Aircraft Division and the short-lived 66th Infantry Division."]}, {"page": "66th Infantry Division (United Kingdom)", "response": ["In October 1939, Commander-in-Chief, Home Forces, General Walter Kirke, was tasked with drawing up a defensive plan to defend the United Kingdom from a German invasion, which was codenamed Julius Caesar. The divisions assigned to this defensive plan were constantly changing, and, by May 1940, included the 66th Division. The division replaced the 49th (West Riding) Infantry Division in Northern Command's part of this plan, and as a result moved from positions around Manchester into Yorkshire. The division's role was to launch an immediate attack on German parachutists, or failing that, to cordon off and immobilise any German invasion effort, until relieved by forces capable of launching a counter-attack to defeat the Germans. On 9 April, following the German invasion of Norway, the second-line infantry divisions in the United Kingdom were requested to each form an independent infantry company consisting of 289 volunteers, who would be deployed to Norway. The 66th Division formed No. 10 Independent Company. However, the company was not deployed to Norway. Following the conclusion of the campaign, No. 10 Independent Company was based in Scotland and did not return to the division. In May 1940, the divisional artillery was equipped with only seven First World War  howitzers against a war establishment of seventy-two modern 25-pounder field guns. Historian David John Newbold described all forces under Kirke's command in May, including the 66th, as having \"been severely weakened by departures overseas\", \"spread very thinly\" and \"largely semi-trained, relatively immobile and lacking in all types of heavy equipment, especially artillery and anti-tank guns.\" In particular, the division relied heavily on civilian transport. It had, prior to moving to Yorkshire, conducted little training. The move, it was hoped, would rectify this situation. Shortly after transferring, the division began platoon and company size training exercises."]}, {"page": "British anti-invasion preparations of the Second World War", "response": ["However, the British War Cabinet became concerned about exaggerated intelligence reports, aided by German disinformation, of large airborne forces which could be launched against Britain. At the insistence of Winston Churchill, then the First Lord of the Admiralty, a request was made that the Commander-in-Chief, Home Forces, General Sir Walter Kirke, should prepare a plan to repel a large-scale invasion. Kirke presented his plan on 15 November 1939, known as \"Plan Julius Caeser\" or \"Plan J-C\" because of the code word \"Julius\" which would be used for a likely invasion and \"Caeser\" for an imminent invasion. Kirke, whose main responsibility was to reinforce the BEF in France, had very limited resources available, with six poorly trained and equipped Territorial  Army divisions in England, two in Scotland and three more in reserve. With France still a powerful ally, Kirke believed that the eastern coasts of England and Scotland were the most vulnerable, with ports and airfields given priority."]}, {"page": "45th Infantry Division (United Kingdom)", "response": ["It was envisioned that the TA divisions each be deployed intact to reinforce the British Expeditionary Force (BEF) in France as equipment became available, with all 26 TA divisions deployed by the end of the first year of the war. The deployment timetable called for waves being sent to France in the fourth, fifth, sixth, ninth, and twelfth months of the war. By February 1940, the 45th Division had been earmarked for the fourth contingent of TA divisions to be deployed. To do so, the division was to be concentrated to complete its training; a process that had thus far been complicated by having 2,600 of the division's troops assigned to guarding vulnerable points. In May 1940, due to the swift nature of the German operations on mainland Europe, Commander-in-Chief, Home Forces General Walter Kirke grew concerned over the threat posed by the Germans to South East England. As a result, the division was assigned to Eastern Command and deployed to Sussex to defend the coast. As a consequence of the German victory in the Battle of France and the return of the BEF following the Dunkirk evacuation, the division was not deployed overseas."]}, {"page": "47th (London) Infantry Division", "response": ["It was planned that the TA divisions would be deployed intact to reinforce the British Expeditionary Force (BEF) in France as equipment became available, and that all 26 TA divisions would be deployed by the end of the first year of the war. Instead, the division was dispersed around London to protect strategically important locations, known as vulnerable points, including the London Docks. C. Northcote Parkinson, author of the Royal Fusiliers history of the Second World War, wrote that the 11th Battalion fired \"some of the first shots of the war\", a \"hair-triggered\" reaction to intruders near the Waltham Abbey explosives factory, which it was assigned to guard. At the end of the year, the division moved to Hertfordshire to conduct training exercises. In May 1940, the majority of the division's men were relocated to Cambridgeshire, leaving two battalions to defend London. In Cambridgeshire, the division was made Eastern Command's reserve formation, which was to be used as a counterattack force against any German airborne landings. Commander-in-Chief of Home Forces, General Walter Kirke, believing the East of England was under threat of invasion as a result of the German operations in mainland Europe, transferred several divisions to defend the coast. Part of this effort involved temporarily splitting the division into two brigade groups. One moved to the Suffolk coastline, to supplement the 55th (West Lancashire) Motor Division on the east coast. The other remained in Cambridgeshire, with troops assigned to varying duties that included the protection of vulnerable points, construction of defensive positions, and defending Royal Air Force (RAF) airfields. On paper, an infantry division was to have seventy-two 25-pounder field guns. On 31 May, the division had eight-such modern guns, four First World War-vintage 18-pounder field guns, and eight  howitzers of similar vintage. The division lacked the motor vehicles it needed to fulfil its motor division role and had to rely heavily on commandeered civilian transport."]}, {"page": "Women in World War I", "response": ["But later evidence and correspondence from the time after her discovery by British Army authorities, including from the files of Sir Walter Kirke of the BEF's secret service, suggest she actually was at liberty and working within the trenches. The toll of the job, and of hiding her true identity, soon gave her constant chills and rheumatism, and latterly fainting fits. Concerned that if she needed medical attention her true gender would be discovered and the men who had befriended her would be in danger, after 10 days of service she presented herself to the commanding sergeant, who promptly placed her under military arrest. She was sent home under a strict agreement not to publish her experiences. https://web.archive.org/web/20191012192555/http://writingwomenshistory.blogspot.co.uk/2012/07/dorothy-lawrence-woman-who-fought-at.html?m=1"]}, {"page": "Maurice Debate", "response": ["On 18 April a Liberal backbencher asked whether Lloyd George's figures included non-combatants (e.g. labourers, many of them Indian, Chinese or black South Africans, who built roads and railways and helped to move heavy equipment). Ian Macpherson, Under-Secretary at the War Office, replied using figures from the Adjutant-General's Department, sent by Colonel Walter Kirke, Deputy DMO (Maurice was still technically DMO until 20 April).Grigg 2002, pp. 491–2", "Lloyd George attacked Maurice, pointing out that his letter constituted a breach of King's Regulations.Roy Douglas, Liberals: The History of the Liberal and Liberal Democrat Parties; Hambledon & London, 2005 p. 179 Lloyd George pointed out that the figures which the Government had presented to the House on 18 April, showing an increase in the number of BEF \"combatants\" between 1 January 1918 and 1 January 1917, had technically come from Maurice's department. He admitted, in response to an interruption, that Maurice had not actually seen the 18 April figures (he had been away at the time) but they had been initialled by a deputy (Colonel Walter Kirke).Grigg 2002, pp. 497, 509 The figure of three \"white\" divisions in Egypt/Palestine had been given at a Cabinet meeting at which Maurice had been in attendance. Furthermore, he argued that Maurice's statement that he had been at Versailles where the extension of the British line had been agreed was misleading – Maurice had been in Versailles but not at the Supreme War Council, and the issue had not been discussed there but had already been agreed between Haig and Pétain.Grigg 2002, p. 497"]}, {"page": "Western Command (United Kingdom)", "response": ["*1933 – 1936 Lieutenant General Sir Walter Kirke"]}, {"page": "Walter Mervyn St George Kirke", "response": ["#REDIRECT Walter Kirke"]}, {"page": "List of British Army full generals", "response": ["|||Sir Walter Kirke||1877||1949||"]}, {"page": "12th (Eastern) Infantry Division", "response": ["The war deployment plan for the TA envisioned its divisions being sent overseas, as equipment became available, to reinforce the British Expeditionary Force (BEF) that had already been dispatched to Europe. The TA would join regular army divisions in waves as its divisions completed their training, the final divisions deploying one year after the war had begun. In October 1939, Commander-in-Chief, Home Forces, General Walter Kirke, was tasked with drawing up a plan, code named \"Julius Caesar\", to defend the United Kingdom from a potential German invasion. As part of this plan, the division was assigned to defend northern Kent. In addition, its forces were dispersed to guard strategically important locations known to be vulnerable points."]}, {"page": "Commander-in-Chief, Home Forces", "response": ["The post of Commander-in-Chief, Home Forces was resurrected for Sir Walter Kirke on 3 September 1939.Newbold, 1988, p. 16 He devised the first anti-invasion plan of the war in October, known as Operation Julius Caesar.Newbold, 1988, p. 35 His successor, Sir Edmund Ironside was retired when his anti-invasion planning fell out of favour with the prime minister, Winston Churchill. Ironside was replaced by Sir Alan Brooke in July 1940. The headquarters was established at Kneller Hall in late 1939 but moved out to St Paul's School in July 1940.Newbold, 1988, p. 245", "* General Sir Walter Kirke – September 1939 to May 1940"]}, {"page": "Inspector-General of the Forces", "response": ["* 1 July 1939: Sir Walter Kirke"]}, {"page": "The Himalayan Club", "response": ["* Major General Walter Kirke, acting Chief of the General Staff"]}, {"page": "3rd West Lancashire Artillery", "response": ["* Gen Sir Walter Kirke, appointed 28 April 1934"]}, {"page": "General Kirk", "response": ["*Walter Kirke (1877–1949), British Army general"]}]}}