{"wiki_id": "http://www.wikidata.org/entity/Q7962851", "itemLabel": "Wallace McIntosh", "itemDescription": "World War II artillery officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Wallace_McIntosh", "wikipedia_page": {"main": "Flight Lieutenant Wallace McIntosh DFC & Bar, DFM (27 March 1920 – 4 June 2007) flew 55 bombing missions with the RAF during the Second World War as a rear gunner in Lancaster bombers. McIntosh was regarded as the most successful air gunner in Bomber Command during the Second World War, and was credited with shooting down eight enemy aircraft. \nSeven of McIntosh's claims were shared with a fellow crew member, mid-upper gunner C. B. \"Larry\" Sutherland (RCAF). McIntosh also claimed two \"probables\" and one \"damaged\" (which was also shared with Sutherland). In a single operation on 7/8 June 1944, McIntosh and Sutherland claimed three German night fighters.", "link_mentions": [{"page": "Flying ace", "response": ["In World War II, United States Army Air Forces B-17 tail gunner S/Sgt. Michael Arooth (379th Bomb Group) was credited with 19 kills,\"Hall of Valor: Michael Arooth.\" Military Times. Retrieved: October 10, 2014. the B-24 gunner Arthur J. Benko (374th Bomb Squadron) with 16 kills. The Royal Air Force's leading bomber gunner, Wallace McIntosh, was credited with eight kills, including three on one mission. Flight Sergeant F. J. Barker contributed to 12 victories while flying as a gunner in a Boulton Paul Defiant turret fighter piloted by Flight Sergeant E. R. Thorne.\"The Airmen's Stories: Sgt. F J Barker.\"  Battle of Britain London Monument. Retrieved: April 17, 2014.Thomas 2012, p. 55. On side of the Luftwaffe Erwin Hentschel, rear gunner of the Stuka ace Hans-Ulrich Rudel, had 7 confirmed kills. The crew of the bomber pilot Otto Köhnke from Kampf-Geschwader 3 is credited with the destruction of 11 enemy fighters (6 French, 1 British, 4 Soviet)."]}, {"page": "Tail gunner", "response": ["* Wallace McIntosh"]}, {"page": "Deaths in June 2007", "response": ["* Wallace McIntosh, 87, British World War II air gunner."]}, {"page": "Index of World War II articles (W)", "response": ["# Wallace McIntosh"]}]}}