{"wiki_id": "http://www.wikidata.org/entity/Q7964447", "itemLabel": "Walter Butler Cheadle", "itemDescription": "English paediatrician", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Butler_Cheadle", "wikipedia_page": {"main": "Walter Butler Cheadle (October 1836, Colne, Lancashire – 22 March 1910, London) was an English paediatrician.\nCheadle was educated at Caius College, Cambridge, graduating M.B. in 1861 and then studied medicine at St George's Hospital Medical School in London. He interrupted his studies in 1861 to join Lord Milton on an expedition to explore Western Canada (1862–1864), and then on to China. \nTogether with William Fitzwilliam (Viscount Milton), Cheadle travelled up the Athabasca River and in 1863 they became the first \"tourists\" to travel through the Yellowhead Pass.\nArriving in Quebec City in July 1862, they travelled across the continent, wintering near Fort Carlton. After a challenging and at times humorous summer they reached Victoria, BC.\nOn returning home, with Milton, he co-authored a book on their adventures, The North-West Passage by Land (London, 1865), which described their expedition in considerable detail, which gained a lot of attention.\nHe continued his medical studies and received his doctorate in 1865, became assistant at the St Mary's Hospital (London) in 1866 and from 1869 he was, for 23 years, at the Hospital for Sick Children, Great Ormond Street, where he was dean of the medical faculty from 1869 to 1873. At the time of his death he was consulting physician at the St. Mary's Hospital. He was an ardent advocate of women in the study of medicine.\nCheadle published the first observation on acute rachitis after J. O. L. Möller, calling the disease infantile scurvy. He distinguished scurvy from rickets in 1878.\nCheadle practised medicine in London and served as dean of St. Mary's Hospital Medical School in the University of London from 1869 to 1873.\nMount Cheadle, which is located in the Monashee Range of British Columbia, on the east flank of the North Thompson River, 25 km north of Blue River, is named after Cheadle. A small sub-urban town of Cheadle, located in Southern Alberta 20 km east of Calgary, was also named after Dr. Cheadle. The town was named by the Canadian Pacific Railway and established in 1902.", "link_mentions": [{"page": "Cheadle", "response": ["*Walter Butler Cheadle (1836–1910), English paediatrician"]}, {"page": "St George's, University of London", "response": ["* Walter Butler Cheadle (1836–1910), English paediatrician"]}, {"page": "List of eponymous diseases", "response": ["* Cheadle disease – Walter Butler Cheadle"]}, {"page": "List of University of Cambridge people", "response": ["*Walter Butler Cheadle (Caius), explorer of Western Canada, namesake of Cheadle, Alberta"]}, {"page": "Sydenham's chorea", "response": ["Sydenham's chorea, a frequent cause of paediatric acute chorea, is a major manifestation of rheumatic fever. The association of chorea with rheumatism was first reported in 1802, and confirmed in the following decades by several French and English authors. The inclusion of chorea under the rheumatic umbrella helped discriminate Sydenham's chorea from other \"choreic\" syndromes. The incidence of acute rheumatic fever and rheumatic heart disease is not declining. Recent figures quote the incidence of Acute Rheumatic Fever as 0.6–0.7/1,000 population in the United States and Japan compared with 15–21/1,000 population in Asia and Africa. The prevalence of Acute Rheumatic Fever and Sydenham's Chorea has declined progressively in developed countries over the last decades. Physicians working in early children's hospitals recognised new clinical syndromes through the definition of \"typical clinical cases\". Complex multi-systemic diseases, such as rheumatic fever, were categorised only after the observation of large, hospital based series. Therefore, paediatric hospitals gradually became an important setting for the application of a modern \"statistical averaging\" technique to paediatric syndromes. Historical authorities in paediatrics, such as Walter Butler Cheadle and Octavius Sturges, worked at London's Hospital for Sick Children, and their clinical notes help elucidate how the typical case of Sydenham's chorea was defined."]}, {"page": "Walter Butler", "response": ["* Walter Butler Cheadle (1836–1910), English paediatrician"]}, {"page": "National Liberal Club", "response": ["*Walter Butler Cheadle, paediatrician."]}, {"page": "William Wentworth-Fitzwilliam, Viscount Milton", "response": ["Arriving in Quebec City in July 1862, Milton and Dr Walter Butler Cheadle traveled across the North American continent, wintering near Fort Carlton. After a challenging and at times humorous summer they reached Victoria, BC. Together with Butler Cheadle, he traveled up the Athabasca River and in 1863 they became the first \"tourists\" to travel through the Yellowhead Pass.", "*Dr Walter Butler Cheadle"]}, {"page": "Walter Cheadle", "response": ["#REDIRECT Walter Butler Cheadle"]}, {"page": "Dr. Walter Butler Cheadle", "response": ["#REDIRECT Walter Butler Cheadle"]}, {"page": "Mount O'Beirne", "response": ["Mount O'Beirne is a mountain in the Continental Ranges on the border of Alberta and British Columbia. It is Alberta's 59th most prominent mountain. It was named in 1918 by Arthur Oliver Wheeler after Eugene Francis O'Beirne, a \"sponger and general pest\" who in 1864 had attached himself to William Wentworth-FitzWilliam, Viscount Milton and Walter Butler Cheadle's expedition over the Yellowhead Pass."]}, {"page": "W. B. Cheadle", "response": ["#REDIRECT Walter Butler Cheadle"]}, {"page": "List of alumni of Gonville and Caius College, Cambridge", "response": ["*Walter Butler Cheadle – paediatrician"]}]}}