{"wiki_id": "http://www.wikidata.org/entity/Q7964556", "itemLabel": "Walter Churchill", "itemDescription": "Royal Air Force pilot", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Churchill", "wikipedia_page": {"main": "Group captain Walter Myers Churchill,  (24 November 1907 – 27 August 1942) was a Royal Air Force pilot and flying ace during World War II.\nChurchill was the elder brother of Peter Churchill and Oliver Churchill, both of whom were Special Operations Executive officers during the Second World War.", "link_mentions": [{"page": "Peter Churchill", "response": ["Churchill's father was William Algernon Churchill (1865–1947), a British Consul who served in Mozambique, Amsterdam, Pará in Brazil, Stockholm, Milan, Palermo, and Algiers. His father was also an art connoisseur, and author of what is still the standard reference work on early European paper and papermaking, Watermarks in Paper,.Watermarks in Paper His mother was Violet (née Myers). He was a brother of Walter Churchill, a Royal Air Force pilot during the war, and Oliver Churchill, who was also an SOE officer."]}, {"page": "Group captain", "response": ["* Walter Churchill World War II ace fighter pilot, who also evaluated various makes of fighter aircraft for the RAF, and played a key role in getting Spitfire aircraft to the defence of Malta"]}, {"page": "List of SOE agents", "response": ["| Oliver Churchill ||  Italy ||  British || 1914–1997 || DSO, MC, Italian Partisan Medal || Brother of Group Captain Walter Churchill and Captain Peter Churchill ", "| Peter Churchill||  France ||  British || 1909–1972 || DSO, CdeG || Brother of Group Captain Walter Churchill and Major Oliver Churchill"]}, {"page": "Archie McKellar", "response": ["On 7 September 1940, No. 605 moved on rotation to Croydon Aerodrome under the command of Squadron Leader Walter Churchill. McKellar scored a further four victories in a single mission on 9 September. McKellar attacked with the sun at his back with his Squadron, save for one Section which was left to provide top cover against Bf 109s. The attack was made head-on to break up the German bomber formation which consisted of a large mass of He 111s. He destroyed three He 111s with a single, 12–second burst. The first He 111 exploded. It damaged a second which rolled over and dived down into the ground. McKellar then moved his fire to a third. Its port wing snapped off. He then destroyed a Bf 109 in the afternoon giving him a fourth success."]}, {"page": "Oliver Churchill", "response": ["He was the younger brother of Walter Churchill and Peter Churchill."]}, {"page": "Walter Myers Churchill", "response": ["#REDIRECT Walter Churchill"]}, {"page": "Cuthbert Orde", "response": ["File:Walter Churchill portrait by Cuthbert Orde.jpg|Walter Churchill, c1941"]}]}}