{"wiki_id": "http://www.wikidata.org/entity/Q7964994", "itemLabel": "Walter Greatorex", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Greatorex", "wikipedia_page": {"main": "Walter Greatorex (30 March 1877 – 29 December 1949) was an English composer and musician. He is probably best remembered for his hymn tune Woodlands which has been used with hymns such as  Henry Montagu Butler's Lift Up Your Hearts!, Far round the world thy children sing their song by Basil Joseph Mathews and Timothy Dudley-Smith's Tell Out, My Soul.", "link_mentions": [{"page": "Abide with Me", "response": ["* \"Woodlands\", Walter Greatorex, 1916"]}, {"page": "Gresham's School", "response": ["The tune called Woodlands, the setting for the hymns Lift Up Your Hearts! and Tell Out My Soul, Timothy Dudley-Smith's versification of the Magnificat, was composed for the school in 1916 by Walter Greatorex, a Gresham's master, who succeeded another composer, Geoffrey Shaw, as the school's Director of Music."]}, {"page": "Greatorex", "response": ["*Walter Greatorex (1877–1949), English composer"]}, {"page": "Derby School", "response": ["The school hymn, Lift Up Your Hearts!, was given a musical setting in 1916 by Walter Greatorex, an old boy of the school.Words and music of Lift Up Your Hearts! at The Ames Collection "]}, {"page": "List of Old Greshamians", "response": ["*Walter Greatorex – composer"]}, {"page": "Lift Up Your Hearts!", "response": ["In the Church of England, Lift up your hearts! is usually sung to Woodlands, a musical setting composed by Walter Greatorex for Gresham's School (where he was Director of Music) in 1916. Woodlands is the name of a house at the school.", "The hymn became the school song of Walter Greatorex's old school, Derby (a tradition continued by Derby Grammar School), Haileybury and Imperial Service College, Hertford, and also of Poundswick Grammar School, Wythenshawe, Manchester.  It is also the school hymn of Melbourne's Haileybury College, Benenden School, Hilton College, Cranbrook, County Grammar School for Boys, Woking, Surrey and Queen Mary's High School for Girls, Walsall and Mayfield Preparatory School, also part of the Queen Mary's foundation. It was also the school song of Thoresby High School for Girls in the centre of Leeds until this school combined to become co-ed with Central Grammar School for Boys in 1972.  It was also the school hymn for Stoke Damerel High School for Girls in Plymouth (1926 - 1986 closure)."]}, {"page": "List of masters of Gresham's School", "response": ["*Walter Greatorex (director of music, 1911–1949), composerThe History and Register of Gresham's School, 1555–1954 (Ipswich, 1955)"]}, {"page": "Tell Out, My Soul", "response": ["\"Tell Out, My Soul\" is a Christian hymn paraphrasing the Magnificat, which was written by Timothy Dudley-Smith in 1962. It is popularly sung to the hymn tune  composed by Walter Greatorex in 1916.", "\"Tell Out, My Soul\" fits the metre 10.10.10.10, and it was originally published in 1965 in The Anglican Hymn Book, set to the tune  by William Llewellyn. In 1966, the hymn was included in the Evangelical Anglican hymnal Youth Praise, set to a tune by Michael Baughen, . The text was later paired with the existing hymn tune , which had been composed by Walter Greatorex in 1916 for Henry Montagu Butler's 1881 hymn \"Lift Up Your Hearts!\". \"Tell Out, My Soul\" is now most popularly sung to Greatorex's melody."]}, {"page": "List of Old Derbeians", "response": ["*Walter Greatorex (1877–1949), composer"]}, {"page": "Geoffrey Turton Shaw", "response": ["From 1902 to 1910, Shaw was a music master and Director of Music at Gresham's School, Holt, a role in which he was succeeded by his fellow Old Derbeian, Walter Greatorex.Benson, Steve, I Will Plant Me a Tree: an Illustrated History of Gresham's School (London: James & James, 2002), pp. 52 & 68 Benson's History of Gresham's School notes that — "]}, {"page": "Far round the world", "response": ["* Woodlands composed by Walter Greatorex (1877 – 1949) for Gresham's School (where he was Director of Music) in 1916. Woodlands is the name of a house at the school."]}]}}