{"wiki_id": "http://www.wikidata.org/entity/Q7963469", "itemLabel": "Wally Radford", "itemDescription": "English footballer (1886-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wally_Radford", "wikipedia_page": {"main": "Walter Robert Radford (July 1886 – 1943) was an English footballer, who played as an inside-forward in the 1900s with Southampton and Wolverhampton Wanderers, with whom he won the FA Cup in 1908.", "link_mentions": [{"page": "1908 FA Cup Final", "response": ["| || ||Wally Radford"]}, {"page": "List of Wolverhampton Wanderers F.C. seasons", "response": ["|align=left|Wally Radford"]}, {"page": "Frank Costello (footballer)", "response": ["He also played in all six FA Cup matches as Saints reached the semi-finals, losing to Wolverhampton Wanderers who went on to take the cup in the final. In the round four (quarter final) replay against Everton at The Dell on 11 March 1908 he played his best game for the \"Saints\". In the first half he hooked a John Johnston cross past the Everton goalkeeper Billy Scott. With the score 2–1 to Southampton at half-time, the second half \"belonged to Frank Costello\". He was involved in most of Southampton's attacks and when John Bainbridge swung over a deep cross from the right it appeared to have been over hit and going out of play. Suddenly, \"out of nowhere\", Costello arrived and met the ball with his head, sending it back over the goalkeeper into the far corner of the net. According to Duncan Holley in \"Match of the Millennium\", \"a contortionist would have had problems attaining a position ... to reach the ball.\" The Saints won the match 3–2, but lost to Wolverhampton Wanderers in the semi-final with goals from former Southampton players Wally Radford and George Hedley."]}, {"page": "Jack Eastham", "response": ["In 1907–08, Eastham settled into the right-back role, although he missed two long periods through injury (when the versatile John Robertson took over) making 22 appearances in all as the \"Saints\" finished eleventh in the league. In the FA Cup, Eastham played in all six matches as the Saints made it through to the semi-final, after a replay in round 4, when they defeated the previous season's runners-up Everton 3–2 (including two goals from Frank Costello). In the semi-final itself, played at Stamford Bridge on 28 March 1908, the Saints were defeated by Wolverhampton Wanderers, with goals from former Southampton players Wally Radford and George Hedley."]}, {"page": "Walter Radford", "response": ["#REDIRECT Wally Radford"]}, {"page": "Radford (surname)", "response": ["*Wally Radford (1886–1943), English athlete in football"]}, {"page": "Frank Everist", "response": ["He was recommended to Southampton of the Southern League by a Kent-based supporter and signed for the club in May 1906. As a former sprinter, he was able to use his speed to great effect in the reserves, earning him a call-up to the first team on 29 September 1909, replacing Wally Radford at outside-right for one match, a 2–1 defeat at Brentford. For the next match, manager Ernest Arnfield tried Joe Blake on the left before Frank Jefferis became the established left-winger."]}, {"page": "Bert Dyer", "response": ["He spent most of his career at The Dell in the reserves and made his solitary first-team appearance at Northampton Town on 6 April 1907 when Sam Jepp was taken ill shortly before kick-off. Dyer played at inside-right with Frank Jefferis moving to the left and Wally Radford moving into the centre-forward position. The match finished 4–2 to Southampton, with two goals from Radford and one each from Patten and Mouncher."]}]}}