{"wiki_id": "http://www.wikidata.org/entity/Q7965549", "itemLabel": "Walter Marsden", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Marsden", "wikipedia_page": {"main": "Walter Marsden  (1882–1969) was an English sculptor born in Lancashire. He saw active service in the First World War and was  awarded the Military Cross.   After the war, like many other sculptors who were also ex-servicemen, he carried out sculptural work on war memorials. Most of these were erected in Lancashire.\nMarsden also spoke at speaking engagements about a wide variety of art-related topics. In 1944 he became an instructor at Saint Martin's School of Art and continued teaching until about 1952.", "link_mentions": [{"page": "Heywood, Greater Manchester", "response": ["Heywood War Memorial lies in Memorial Gardens opposite the Parish Church of St Luke the Evangelist, and was originally erected \"to the men of Heywood who gave their lives\" during the First World War, but later, the Second World War. It is a grey granite cenotaph decorated with wreaths and crosses. At the front is a bronze female figure holding a laurel wreath to symbolise peace. It was sculpted by Walter Marsden. Heywood War Memorial was commissioned by the Heywood War Memorial Committee and unveiled on 22 August 1925 by Hewlett Johnson, the Dean of Manchester. The roll of honour was not engraved on the memorial at the time of its unveiling owing to a lack of funds. Lobbying by the Heywood branch of the Royal British Legion secured a grant from Rochdale Metropolitan Borough Council to cover the £5,000 required; names from both world wars were engraved in 1986."]}, {"page": "Tottington, Greater Manchester", "response": ["Tottington Cenotaph was dedicated to victims of the First World War in 1930. Built of Portland stone as is the Cenotaph in London; it bears the inscription \"We owe more tears to those dead men than time shall see us pay\"; a line taken from Shakespeare's play Julius Caesar. It was designed by Lancastrian sculptor Walter Marsden and features two bronze wreath badges; one featuring a peace dove and the other the rising sun.Tottington Cenotaph Imperial War MuseumTottington Cenotaph"]}, {"page": "Édouard Lantéri", "response": ["* Walter Marsden"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Walter Marsden"]}]}}