{"wiki_id": "http://www.wikidata.org/entity/Q7964877", "itemLabel": "Walter Frederick Campbell", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Frederick_Campbell", "wikipedia_page": {"main": "Walter Frederick Campbell of Shawfield (sometimes given \"of Islay\")  (1798–1855), was a Scottish politician. He served as the MP for Argyllshire, 1822–1832 and 1835–1841.", "link_mentions": [{"page": "Granville Leveson-Gower, 2nd Earl Granville", "response": ["He married, as his second wife, Castila Rosalind Campbell (or Castalia), daughter of Walter Frederick Campbell, on 26 September 1865; their children were:"]}, {"page": "Port Ellen", "response": ["Port Ellen () is a small town on the island of Islay, in Argyll, Scotland. The town is named after the wife of its founder, Walter Frederick Campbell. Its previous name, Leòdamas, is derived from Old Norse meaning \"Leòd's Harbour\"."]}, {"page": "John Francis Campbell", "response": ["John Francis Campbell was born on Islay on 29 December 1821 to Lady Eleanor Charteris (1796–1832), eldest daughter of Francis Wemyss Charteris Douglas, and Walter Frederick Campbell of Islay (1798–1855), MP for Argyll. Campbell was a descendant (great-great-great-grandson) of Daniel Campbell of Shawfield who had bought Islay from the Campells of Cawdor, for £12,000 in 1726. "]}, {"page": "Argyllshire (UK Parliament constituency)", "response": ["|Walter Frederick Campbell", "| Walter Frederick Campbell"]}, {"page": "Port Charlotte, Islay", "response": ["Port Charlotte was named after Lady Charlotte Campbell Bury, the mother of its founder Walter Frederick Campbell; and it was set up mainly to provide housing facilities for the Lochindaal Distillery work force. Parts of the former distillery buildings are now in use as Youth Hostel and Wildlife Centre. Others are currently used by a garage nearby. The remaining warehouses are currently owned and used by Bruichladdich distillery to mature their Port Charlotte heavily peated spirit, named in tribute to the village and original distillery."]}, {"page": "Francis Wemyss-Charteris, 9th Earl of Wemyss", "response": ["Wemyss-Charteris was born 14 August 1795, the son of Francis Douglas, 8th Earl of Wemyss and the former Margaret Campbell. Among his siblings was Lady Eleanor Charteris (wife of Walter Frederick Campbell), and Lady Katherine Charteris Wemyss (who married their first cousin, George Grey, 8th Baron Grey of Groby)."]}, {"page": "Francis Douglas, 8th Earl of Wemyss", "response": ["*Lady Eleanor Charteris (1796–1832), married her cousin Walter Frederick Campbell of Shawfield"]}, {"page": "Walter Campbell of Shawfield", "response": ["Through his son John, he was a grandfather of Walter Frederick Campbell, an MP for Argyllshire who inherited Islay in 1816 upon his grandfather's death. He was also the grandfather of John George Campbell (who married Ellen, a daughter of Sir Fitzwilliam Barrington, 10th Baronet), Eliza Maria Campbell (wife of Sir William Gordon-Cumming, 2nd Baronet) Eleanora Campbell (wife of Henry Paget, 2nd Marquess of Anglesey), Harriet Charlotte Campbell (wife of Charles Bury, 2nd Earl of Charleville), Emma Campbell (wife of William Russell, youngest son of Lord William Russell), Adelaide Campbell (wife of Lord Arthur Lennox), and Julia Campbell (wife of Peter Langford-Brooke, of Mere Hall).", "Through his daughter Margaret, he was a grandfather of eight, including Lady Eleanor Charteris (who married her cousin, Walter Frederick Campbell), Francis Wemyss-Charteris, 9th Earl of Wemyss, and Lady Katherine Charteris Wemyss (who married George Grey, 8th Baron Grey of Groby)."]}, {"page": "Henry Wyndham West", "response": ["West married Violet Katherine Campbell, daughter of Walter Frederick Campbell, in 1870. West's nickname in early life was \"Zephyr,\".  The winter nuptials were celebrated by an epigram written by George Webbe Dasent.Popular tales from the Norse"]}, {"page": "Walter Campbell", "response": ["*Walter Frederick Campbell (1798–1855), Scottish politician"]}, {"page": "William Bromley-Davenport (1821–1884)", "response": ["Bromley-Davenport married Augusta Elizabeth Campbell, daughter of Walter Frederick Campbell of Islay in 1858. Their son William was a soldier and politician."]}, {"page": "Charles Bury, 2nd Earl of Charleville", "response": ["In 1821 in Florence, Lord Charleville married Harriet Charlotte Beaujolais Campbell, daughter of Colonel John Campbell of Shawfield and Islay and Lady Charlotte Bury, and sister of Walter Frederick Campbell. They had three sons and a daughter. Lady Charleville was a minor author. She died in Naples in February 1848, aged 46. Lord Charleville died in July 1851, aged 50, and was succeeded by his eldest son, Charles."]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|14 March 1822||Argyllshire||u*||Lord John Campbell||Walter Frederick Campbell||Resignation"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|Argyllshire|||Walter Frederick Campbell||Whig"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|Argyllshire|||Walter Frederick Campbell||Whig"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|Argyllshire|||Walter Frederick Campbell||Whig"]}, {"page": "John Campbell (1770–1809)", "response": ["In 1796, he married Lady Charlotte Susan Maria Campbell, daughter of the 5th Duke of Argyll. They had at least two sons and six daughters,Henry (op cit) reports the couple as having 2 sons and 6 daughters, but the ODNB entry for Lady Charlotte says she had 9 children with John but only two of the daughters survived their parents. On the death of Walter Campbell in 1816, John's son Walter Frederick Campbell inherited the 240 square mile island of Islay in the Inner Hebrides."]}, {"page": "Sir Kenneth Mackenzie, 6th Baronet", "response": ["Mackenzie married, in 1860, Eila Frederica Campbell, daughter of Walter Frederick Campbell, of Islay. Their son Kenneth Mackenzie succeeded to the baronetcy."]}, {"page": "John Murdoch (editor)", "response": ["In his youth in Islay he associated with the family of the laird, Walter Frederick Campbell, including the folklorist and Gaelic scholar, John Francis Campbell (Iain Òg Ile)(1822–85). His commitment to the Gaelic language and his hostility to landlordism appears to date from his Islay days."]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["| 14 March 1822 || Argyllshire||Lord John Campbell||Whig||Walter Frederick Campbell||Whig || Campbell resigned seat"]}, {"page": "Walter Douglas Somerset Campbell", "response": ["Walter Douglas Somerset Campbell was born on 16 June 1840, the son of Walter Frederick Campbell (1798–1855), of Islay and Woodhall, Lanark, MP, JP, DL, and his second wife Catherine, daughter of Stephen Thomas Cole and his wife, Lady Elizabeth Stanley.Melville Henry Massue, The Plantagenet Roll of the Blood Royal, Essex Volume (1911), p. 231. The Campbells were noted and well-connected land-owners in the Scottish highlands; the elder Walter Campbell inherited the lairdship of Islay from his grandfather in 1816 and sat as a Member of Parliament for Argyll; his first wife, Lady Eleanor Charteris (1796–1832), was the daughter of the 7th Earl of Wemyss and their son, John Francis, is remembered as a noted folklorist. Walter Frederick Campbell was nonetheless forced to sell Islay in 1847 to pay off enormous debts accrued during improvements to the island.James A. Pratt, \"Campbell, John Francis, of Islay (1821?–1885)\", Oxford Dictionary of National Biography (Oxford: Oxford University Press, online edition May 2006). Retrieved 6 June 2017."]}, {"page": "Edward Langtry", "response": ["Islay was owned by Walter Frederick Campbell, but he became bankrupt and the management of the island was placed in the hands of John Ramsay, who was a distiller, merchant and politician.  A buyer for the island was eventually found in 1853, who was wealthy businessman James Morrison.  He had an agreement with Ramsay that he would sell a section of Islay to him including the cottage and land where the Langtry family were living.  Some years later Ramsey made Ardimersey Cottage his home.      "]}, {"page": "Islay House", "response": ["Originally known as Kilarrow House, it was built for Sir Hugh Campbell of Cawdor, Nairnshire around 1677. It was sold in 1726 along with most of Islay and Jura to Daniel Campbell of Shawfield and Woodhall who added the wings around 1737. The stair towers were added by Daniel Campbell, his successor around 1760 when it was renamed Islay House. It was extended again for Walter Frederick Campbell. The Campbells became bankrupt in 1847."]}]}}