{"wiki_id": "http://www.wikidata.org/entity/Q7964417", "itemLabel": "Walter Buller", "itemDescription": "British bridge player and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Buller_(bridge)", "wikipedia_page": {"main": "Lt. Col. Walter Buller (10 December 1886 – 21 May 1938) was a British auction and contract bridge organiser, player and writer, the leading British bridge personality at the start of the 1930s. Buller was from London.", "link_mentions": [{"page": "Walter Buller", "response": ["Buller was appointed Companion of the Most Distinguished Order of St Michael and St George in 1875. In November 1886, he was promoted to Knight Commander. Buller helped establish the scientific display in the New Zealand Court at the World's Fair in Paris and was decorated with the Officer of the Legion of Honour by the President of France in November 1889.Brewer, M., 'New Zealand and the Legion d'honneur: Officiers, Commandeurs and Dignites', The Volunteers: The Journal of the New Zealand Military Historical Society, 35(3), March 2010, p.136.'Death of Sir Walter Buller, A noted Ornithologist', Evening Post, 20 July 1906, p.6.", "Species named after Walter Buller include Thalassarche bulleri (Buller's albatross) and Puffinus bulleri (Buller's shearwater)."]}, {"page": "Terence Reese", "response": ["Reese's mother Anne ran a hotel near Guildford, and with it a bridge club, so Reese played in the earliest duplicate matches, circa 1930. Whilst at Oxford he met some serious bridge players, amongst whom were Lt.-Col. Walter Buller, Iain Macleod and Maurice Harrison-Gray, the strongest player in the country at that time. Within a year of graduating and after a brief stint at Harrod's, Reese started working for Hubert Phillips's magazine and co-wrote his first book with him in 1937.Phillips, Hubert, and Terence Reese (1937). The Elements of Contract. London: British Bridge World. 271 pages. Phillips acknowledges that although the book is published jointly under their names, \"Terence is the real author of the book\",Phillips and Reese (1937), Introduction by Phillips, p. vii. receiving only assistance in planning contents and editing from Phillips. From that point on, Reese's profession was that of a champion contract bridge player and prolific writer on the game."]}, {"page": "Ely Culbertson", "response": ["Culbertson was a brilliant publicist; he played several famous challenge matches and won them all. Two were played in the U.S., against s led by Sidney Lenz in 1931–32 (the so-called \"Bridge Battle of the Century\") and by P. Hal Sims in 1935, the latter between the married couples Culbertson and Sims. Four  matches were played in England, against Walter Buller's team in 1930, against \"Pops\" Beasley's team in 1930 and 1933, and against Col. George Walshe's team in 1934. These matches were typically accompanied by noteworthy publicity in newspapers, on radio and on cinema newsreels, and the hands became the subject of intense discussion on bidding methods.Clay (1985).", "Lt. Col. Walter Buller promoted a bidding system that he called \"British Bridge\", which used direct methods and avoided approach forcing bids as had been incorporated in the Culbertson System. His challenge was accepted by Culbertson, and a teams of four match took place in London in 1930. The Culbertson team won by 4,845 total points over 200 deals. Culbertson partnered his wife, Josephine, and his other pair comprised Lightner and von Zedtwitz. Later in the match Culbertson played with Lightner, and his wife played with von Zedwitz: this was the more successful line-up. The other three members of Buller's team were Alice Evers, Cedric Kehoe and Nelson Wood-Hill.Francis et al (1994), pp. 584, 816."]}, {"page": "Buller", "response": ["* Walter Buller (1838–1906), New Zealand ornithologist", "* Lt. Col. Walter Buller (bridge) (1887–1938), British bridge player"]}, {"page": "List of contract bridge people", "response": ["* Walter Buller"]}, {"page": "List of contract bridge books", "response": ["* Walter Buller"]}]}}