{"wiki_id": "http://www.wikidata.org/entity/Q7970302", "itemLabel": "Warren James", "itemDescription": "Miners leader", "wikipedia_url": "https://en.wikipedia.org/wiki/Warren_James", "wikipedia_page": {"main": "Warren James (1792–1841) was a rebel leader in the Forest of Dean, England.\nAs the Industrial Revolution began to take hold in the Forest of Dean, the Crown resolved to dilute the Foresters’ freemining rights and introduce free-market forces to the area. Then, in 1808, Parliament directed that large areas of the Forest be enclosed, in order to satisfy an increased demand for naval timber.\nUnable to compete with the outside industrialists, and denied their ancient rights to collect timber or graze animals in the enclosed areas, many Foresters descended into abject poverty. Unrest grew and Warren James emerged as a populist leader. In 1831 he led a group of up to 3000 Foresters in open revolt against the Crown, tearing down around 60 miles of fencing in an attempt to retake possession of the enclosures. Warren James was tried and sentenced to death, though this was commuted to transportation to Tasmania. He was pardoned five years later, but unable to return home, he died in Hobart in 1841. His actions have inspired many other campaigns over the years and he remains one of the most significant figures in Forest of Dean history.", "link_mentions": [{"page": "Mural", "response": ["File:Warren James.jpg|Stylised mural of the miners' leader Warren James, at a public house in Parkend, Gloucestershire"]}, {"page": "Forest of Dean", "response": ["As unrest grew, a populist leader named Warren James emerged in the riots against the enclosures. Attempts to peaceably resolve the matter failed, and on 8 June 1831, James, leading more than 100 Foresters, demolished the enclosure at Park Hill, between Parkend and Bream. Around 50 unarmed Crown Officers were powerless to intervene. On the Friday, a party of 50 soldiers arrived from Monmouth, but by now the number of Foresters had grown to around 2,000 and the soldiers returned to barracks. Over the next few days more troops arrved from around the country. The Foresters' resistance crumbled and most of those arrested elected to rebuild the enclosures, rather than be charged with rioting. James was sentenced to death but his sentence was later commuted to transportation. He was sent to Van Diemen's Land (Tasmania) in October 1831, only to be pardoned five years later, although he never returned home.", "* Warren James (1792–1841), a miners' leader who led the Free Miners to action against the Crown, was born on the edge of Parkend."]}, {"page": "Parkend", "response": ["*Warren James (1792–1841) - Miners' leader who led the Foresters to action against the Crown, in 1831. Born on the southern edge of Parkend.", "File:Warren James.jpg|Stylised mural of the miners' leader Warren James, in the Fountain Inn."]}, {"page": "1831 in the United Kingdom", "response": ["* 8 June – Freeminers in the Forest of Dean, led by Warren James, break down enclosures in the Forest."]}, {"page": "Bream, Gloucestershire", "response": ["*Warren James (1792–1841) - Miners' leader who led the Foresters to action against the Crown, in 1831. Lived in Bream."]}, {"page": "St Briavels Castle", "response": ["In 1831 there were extensive riots in the Forest of Dean, led by Warren James.Nicholls 1858, p. 122. After the intervention of the military, the rioters were dispersed and order restored, but a range of complaints were levied about the enforcement of the local laws on miners and metal-workers.Nicholls 1858, p. 112. There had been attacks against St Briavels Castle by discontented locals before during the 1780s, but the degree of violence in this case was much greater.Fisher, 13. An act of Parliament followed, establishing a number of commissioners who investigated local practices and recent events at the Castle."]}, {"page": "Warren james", "response": ["#REDIRECT Warren James "]}, {"page": "James Warren", "response": ["* Warren James (1792–1841), English miners' leader"]}, {"page": "Warren James Jewellers", "response": ["Warren James Jewellers is a British jeweller"]}]}}