{"wiki_id": "http://www.wikidata.org/entity/Q7970073", "itemLabel": "Warren Bradley", "itemDescription": "former British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Warren_Bradley_(politician)", "wikipedia_page": {"main": "Warren Bradley is a former firefighter and Liberal Democrat politician. He was an Independent councillor for the Wavertree ward, as well as the former Leader of Liverpool City Council.\nHe was suspended from the Liberal Democrats in 2011, and subsequently expelled, in connection with allegations of an electoral offence. He later pleaded guilty to perjury.", "link_mentions": [{"page": "Liverpool City Council", "response": ["*2005 Cllr Storey was replaced as leader by Warren Bradley. Sir David Henshaw retired and was replaced as chief executive by Colin Hilton.", "| Warren Bradley"]}, {"page": "2010 United Kingdom general election", "response": ["In Chester there were reports that 600 registered voters were unable to vote because the electoral roll had not been updated, while in Hackney, Islington, Leeds, Lewisham, Manchester, Newcastle and Sheffield long queues led to many voters being turned away and unable to vote as the  deadline arrived. Some dissatisfied voters staged sit-ins to protest against what some of them had called \"disenfranchisement\". In Liverpool, higher-than-expected turnout meant several polling stations ran out of ballot papers, with defeated council leader Warren Bradley stating that some residents were unable to cast their votes. In Wyre and Preston North, a 14-year-old boy cast a vote after being sent a polling card."]}, {"page": "Superlambanana", "response": ["Since the sculpture's conception it was intended to move around the city and not remain in one location. It was originally located on the Strand near Liverpool's famous Liver Building and has since been located in several places including Williamson Square, Spike Island in Widnes, Cheshire, and on Wapping, close to the Albert Dock. Council leader Warren Bradley also suggested that the sculpture could be moved to Garston in the south of the city in the near future."]}, {"page": "Central (Liverpool ward)", "response": ["The 2011 vote was effected by the controversy involving the Liberal Democrat candidate, Daniel Bradley the son of former Liverpool City Council Leader Warren Bradley, when Daniel disclosed that he had not signed the candidate paper, which his father had witnessed."]}, {"page": "Warren Bradley", "response": ["Warren Bradley may refer to:", "* Warren Bradley (footballer) (1933–2007), English footballer", "* Warren Bradley (politician), former leader of Liverpool City Council"]}, {"page": "The Kirkby Project", "response": ["The ground share idea was reintroduced in 2008 when Liverpool City Council leader Warren Bradley told the local press that he had been working on it behind the scenes. Former CEOs at both clubs (Liverpool's Rick Parry and Everton's Keith Wyness) dismissed the idea as a non-starter.", "Liverpool Council Leader, Liberal Democrat Warren Bradley, was in attendance and stated that the City Council have a strong desire to keep Everton Football Club within the city. He and Joe Anderson, leader of the opposition Labour group, later accused the previous council of 'shame' in not doing enough to keep Everton within the city boundaries.", "A number of local authorities objected to the scheme, including Liverpool City Council, Sefton Council, West Lancashire Council and St Helens Council as they felt that the accompanying retail park would have a detrimental effect to towns in their area. The Liverpool City Council leader Warren Bradley referred to the Everton's proposed stadium in Kirkby as \"a cow shed in a small town\". The objections led to more controversy as Knowsley councillor Eddie Connor publicly stated that Liverpool political party leaders Warren Bradley and Joe Anderson should not have been able to address their planning committee's due to their footballing allegiances to Everton."]}, {"page": "One Park West", "response": ["One Park West was launched at Tate Liverpool on Thursday 22 February 2007. Developer the Grosvenor Group celebrated One Park West's construction reaching its highest point with a topping-out ceremony on Thursday 7 February 2008. Members of the project team and the leader of Liverpool City Council, Councillor Warren Bradley, were offered an item to be placed in a time capsule which was embedded into the building. The objects placed inside the capsule included a first sketch of the building, a copy of the Liverpool Daily Post from the day of the ceremony, a programme for Liverpool’s year as European Capital of Culture in 2008 and a DVD about One Park West. The ceremony included four significant elements being added to the final concrete mix; Cains beer, oil, water from the River Mersey and a yew branch to promote fertility, liberty, and wisdom, and to ward off evil spirits. "]}, {"page": "Edge Lane", "response": ["Former Leader of Liverpool City Council, Warren Bradley, suggested that the scheme to regenerate the Edge Lane area had the overwhelming support of residents. In the lead up to European Capital of Culture 2008, the properties were given a fresher look by being covered in colourful decorated boarding showing images culturally important to the city. The second High Court challenge was dismissed in March 2009, allowing the compulsory purchase of remaining properties and for the scheme to go ahead."]}, {"page": "Everton F.C. supporters", "response": ["* Warren Bradley, former Liberal Democrats councillor"]}, {"page": "Wavertree (ward)", "response": ["|bgcolor=\"#B6D7A8\"| Warren Bradley (LD)", "| Warren Bradley (LD)", "| Warren Bradley (LD)", "|bgcolor=\"#99CCFF\"| Warren Bradley (LD)", "| Warren Bradley (LD)", "|bgcolor=\"#C0C0C0\"| Warren Bradley (Ind.)", "| Warren Bradley (Ind.)", "Warren Bradley was suspended and eventually expelled from the Liberal Democrats following allegations of electoral fraud which he later admitted in Court, he contested the 2012 elections as an Independent."]}, {"page": "St Michael's (Liverpool ward)", "response": ["All three seats in the ward are held by the Green Party.  The ward has returned seven Councillors since it was formed 2004. John Coyne defected to the Green Party from the Liberal Democrats in 2006 and was re-elected with the Green Party twice: in 2007 and 2011.  Cllr Sharon Green resigned from the Liberal Democrat whip to sit as an Independent on 6 May 2011 following the suspension of former leader Warren Bradley from the party."]}]}}