{"wiki_id": "http://www.wikidata.org/entity/Q7976737", "itemLabel": "Wayne Tunnicliffe", "itemDescription": "British radio DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Tunnicliffe", "wikipedia_page": {"main": "Wayne Tunnicliffe / Wayne Bond (known as Wayne Allen) is a British nightclub DJ and a radio presenter.", "link_mentions": [{"page": "Nicole Owen", "response": ["In a fury born of abject ignorance, Nicole's peers turned on her because of Sam's crimes. Her groceries were smashed on her way home; a dead rat was stuffed into her school locker. After Ste Hay (Kieron Richardson) and Wayne Tunnicliffe (Joe Marsden) got her drunk with the intent to sleep with her, Nicole decided that enough was enough, and promptly left Hollyoaks with her parents. When her friends Nancy, Sarah and Hannah, who had avoided her after the pub explosion, asked her if she would stay in contact with them, Nicole answered simply 'No'. Nicole returned in December 2006 for Becca Dean's (Ali Bastian) trial where she gave evidence against Becca-much to the annoyance of her supposed friend Nancy. She claimed Justin's stepbrother Ali Taylor (Luti Fagbenle) had told her in 2005 (when Justin was 15) that Becca and Justin were involved. This was hearsay, but still played crucial to the prosecution's case. Becca was ultimately found guilty and sentenced to prison, where she was later killed by another prisoner."]}, {"page": "Wayne Tunncliffe (Wayne)", "response": ["#REDIRECT Wayne Tunnicliffe"]}, {"page": "Tunnicliffe", "response": ["*Wayne Tunnicliffe (fl. 1990s-present), British radio personality (known as Wayne Allen) "]}, {"page": "Wayne Tunncliffe (Wayne or Wayne Allen)", "response": ["#REDIRECT Wayne Tunnicliffe"]}, {"page": "Wayne Tunncliffe", "response": ["#REDIRECT Wayne Tunnicliffe"]}, {"page": "TFM (radio station)", "response": ["The TFM studios in Thornaby were closed and remaining staff were moved to Newcastle. Most on-air staff were made redundant,Former DJ 'Goffy' hits out at TFM Radio and Metro Radio's merger Chronicle Live, 7 April 2013 including breakfast presenters Wayne Tunnicliffe and Amy McConnell, who were replaced by Metro Radio counterparts Steve Furnell and Karen Wight.,Backlash from listeners as Bauer moves TFM out of Teesside Prolific North, 8 April 2013 although two journalists continued to be based locally for news-gathering in the TFM area. Despite the merger, RAJAR reported an increase in weekly listener reach for TFM during the second quarter of 2013.Around the stations for RAJAR Q2, 2013 Radio Today, 1 August 2013"]}]}}