{"wiki_id": "http://www.wikidata.org/entity/Q797835", "itemLabel": "Chris Humphrey", "itemDescription": "Professional footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Humphrey", "wikipedia_page": {"main": "Christopher Charles Humphrey (born 19 September 1987 in Saint Catherine) is a Jamaican professional footballer and coach. He is currently the manager of Northern Premier League club Kendal Town.\nHumphrey has played for several clubs in the United Kingdom, including English clubs Shrewsbury Town, Preston North End and Bury, and Scottish clubs Motherwell and Hibernian. He also played for  the Jamaica national team in 12 matches, having made his full international debut in 2012. Humphrey announced his retirement from football in October 2018, due to ongoing injury problems before returning to the game with East Kilbride. Humphrey took over as player/manager of Lowland League side Gretna 2008 but was sacked in November 2019.", "link_mentions": [{"page": "Simon Grayson", "response": ["On 6 July 2019, the day after Terry McPhillips announced his resignation, Grayson was appointed Blackpool manager on a two-year contract. He was sacked on 12 February 2020, after a spell of four points from a possible 27 brought them from 4th place to 15th in League One. He managed Kendal Town for one game in October 2020, covering for the self-isolating Chris Humphrey.BBC Cumbria Sport – Twitter, 27 October 2020"]}, {"page": "Stuart McCall", "response": ["At the start of the 2013–14 season, key players Darren Randolph, Nicky Law, Chris Humphrey, Michael Higdon and Henrik Ojamaa all left the club. McCall replaced them by signing Paul Lawson, Iain Vigurs, John Sutton, Fraser Kerr, Gunnar Nielsen and Stephen McManus. He also managed to persuade James McFadden to stay at the club. Motherwell enjoyed another successful season, finishing second in the 2013–14 Scottish Premiership. The position was achieved by winning on the final day against nearest rivals Aberdeen. After a bad start to the 2014–15 season left Motherwell second from bottom, McCall resigned as manager on 2 November."]}, {"page": "Humphrey", "response": ["*Chris Humphrey (born 1987), footballer"]}, {"page": "Marlon King", "response": ["King made his first appearance for Jamaica since 2009 as a second-half substitute in a 1–0 friendly defeat to Panama on 27 May 2012, and played in the next game, again as a substitute. He and Chris Humphrey were then suspended from the next two World Cup qualifiers for breaking curfew. He was not selected again after the suspension, and announced his retirement from international football in November 2012. He scored 12 goals from 22 senior international appearances. After the resignation of Theodore Whitmore, new coach Winfried Schäfer recalled King to the team for the World Cup qualifiers in September 2013."]}, {"page": "2009 Football League Two play-off Final", "response": ["Gillingham manager Stimson selected the same eleven players in his starting line-up as had started the second leg of the semi-final against Rochdale.  Adam Miller, who had missed both legs of the semi-final due to injury, was fit again, but Stimson named him as one of the substitutes.  Four of Gillingham's players had played at Wembley two years earlier for Stevenage Borough in the 2005 FA Trophy Final.  Veteran Nicky Southall, the only member of the Gillingham squad to have played in the club's appearances at the old Wembley in 1999 and 2000, was not included in the starting line-up or among the substitutes.  Shrewsbury manager Simpson made two changes from the team which had started the second leg of the semi-final against Bury, replacing David Worrall and Omer Riza with Chris Humphrey and Nick Chadwick; both Worrall and Riza dropped to the substitutes' bench.  Steve Leslie was not available for selection as he was serving a suspension after being sent off against Bury and both Mike Jackson and David Hibbert had failed to recover from injuries sustained earlier in the season.  Prior to the match, Jackson was Gillingham's top goalscorer with 20 goals; Shrewsbury's Grant Holt was the season's leading scorer among all League Two players with 28 goals: 20 in the league, 1 in the Football League Cup, and 7 in the Football League Trophy.", "|RM ||17||Chris Humphrey|| || "]}, {"page": "2007 Football League Two play-off Final", "response": ["|MF ||22 ||Chris Humphrey || || "]}, {"page": "2009–10 Motherwell F.C. season", "response": ["|  Chris Humphrey", "||| MF|| 7 ||Chris Humphrey"]}, {"page": "2010–11 Motherwell F.C. season", "response": ["|Chris Humphrey", "||| MF|| 7 ||Chris Humphrey"]}, {"page": "List of foreign EFL Championship players", "response": ["*Chris Humphrey – Preston North End 2015–17"]}, {"page": "Motherwell F.C. 6–6 Hibernian F.C.", "response": ["|MF ||7  || Chris Humphrey || "]}, {"page": "2011 Scottish Cup Final", "response": ["Motherwell entered the competition in the fourth round. They began their campaign against Dundee at Dens Park and won 4–0 thanks to goals from John Sutton (2), Steve Jennings and Jamie Murphy.Dundee 0–4 Motherwell Motherwell then took on Stranraer at Stair Park winning 2–0 thanks to goals from Steve Jones and John Sutton,Stranraer 0–2 Motherwell In the quarter-final Motherwell took the journey back to Dundee to take on Dundee United at Tannadice Park, the match ended in a 2–2 draw, with both of Motherwell's goals coming from Sutton.Dundee Utd 2–2 Motherwell Motherwell were then comfortable 3–0 winners in the replay back at Fir Park with goals from Murphy, Chris Humphrey and Francis Jeffers.Motherwell 3–0 Dundee Utd In the semi-final, Motherwell took on St Johnstone at Hampden Park again coming out 3–0 winners with goals from Stephen Craigan, Murphy and Sutton.", "|MF ||7 || Chris Humphrey"]}, {"page": "2011–12 Dunfermline Athletic F.C. season", "response": ["Both teams went into this match after an excellent start to the season, both surpassing expectations. From the start the visitors looked like they would get goals with Dunfermline's defence being torn apart, especially by a lively Chris Humphrey. The breakthrough finally came when Keith Lasley and Michael Higdon combined with Higdon curling in from the edge of the area. Tom Hateley nearly made it two a few minutes later with a free-kick hitting the post. But it was only a short respite for Dunfermline as Motherwell scored again, Jamie Murphy strolled past Gary Mason and was given time to hit a 20-yard shot which heavily deflected off Alex Keddie and into the net. In the second half things hadn't changed with Motherwell dominating and when Chris Humphrey was allowed to cut inside into the box his shot clipped the post and into the net. Dunfermline then started to attack, pushing Motherwell back, and were rewarded when David Graham's 25-yard shot flicked off Joe Cardle and into the net, with Cardle claiming the goal. Cardle then bagged another as he cut into the box and his shot deflected off Stephen Craigan and past the helpless keeper. With two minutes to go Dunfermline pushed forward, but were counter-attacked and Higdon's late finish from a cross by Nicky Law finished the game. Final Score:2–4</"]}, {"page": "2011–12 Motherwell F.C. season", "response": ["|Chris Humphrey", "||| MF|| 7 ||Chris Humphrey"]}, {"page": "List of Motherwell F.C. records and statistics", "response": ["* Last goal scored in Scottish Premier League: Chris Humphrey vs Ross County (12 May 2013)"]}, {"page": "List of Motherwell F.C. players", "response": ["|style=\"background:#FF9900;\"|Chris Humphrey||style=\"background:#FF9900;\"|||style=\"background:#FF9900;\"|2009–2013||style=\"background:#FF9900;\"|132||style=\"background:#FF9900;\"|8||style=\"background:#FF9900;\"|"]}, {"page": "2012–13 Scottish Premier League", "response": ["|align=\"left\"| Chris Humphrey"]}]}}