{"wiki_id": "http://www.wikidata.org/entity/Q7976480", "itemLabel": "Wayne Mills", "itemDescription": "British Army soldier", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Mills_(British_Army_soldier)", "wikipedia_page": {"main": "Wayne Kevin Mills CGC is a former British Army soldier. He was the first gazetted recipient of the Conspicuous Gallantry Cross for his actions during active operations in Bosnia in 1994.\nWhile serving with the 1st Battalion The Duke of Wellington's Regiment (West Riding) on United Nations service in Bosnia on 29 April 1994, a patrol led by Corporal Mills came under heavy small-arms fire from a group of Bosnian Serbs. The patrol returned fire, killing two of the attackers. The patrol moved away back towards their base and soon reached an open clearing, where it was obvious they would be highly vulnerable to fire from the attackers. Mills then performed his feat of bravery. Turning around, back into the wood, he engaged the attacking group, delaying them long enough to allow the rest of his patrol to cross the clearing. Mills shot the leader of the group, causing the rest to scatter. He returned to his patrol safely.", "link_mentions": [{"page": "Mills (surname)", "response": ["*Wayne Mills, British soldier", "*Wayne Mills (1969–2013), American country musician"]}, {"page": "Duke of Wellington's Regiment", "response": ["Nine soldiers from the regiment have been awarded the Victoria Cross, and Corporal Wayne Mills of the 1st Battalion became the first recipient of the Conspicuous Gallantry Cross in 1994, whilst serving with the United Nations Mission in Bosnia and Herzegovina.", "thumb|right|'C/Sgt Wayne Mills", "Corporal Wayne Mills of the 1st Battalion became the first recipient of the Conspicuous Gallantry Cross, second only to the Victoria Cross. On (29 April 1994), a patrol led by Corporal Mills came under heavy small-arms fire from a group of Bosnian-Serbs. The patrol returned fire, killing two of the attackers. The patrol then withdrew, but the attackers persisted in firing on the patrol. The patrol soon reached an open clearing, where it was obvious they would be highly vulnerable to fire from the attackers. Corporal Mills then performed an astonishing feat of bravery. He turned back and engaged the group in a fire-fight, delaying the attackers long enough to allow the rest of his patrol to cross the clearing. While doing this brave act, Corporal Mills shot the leader of the group, with the rest scattering into the woods. Due to that action he returned to his patrol safely, who were giving covering fire."]}, {"page": "Wayne Kevin Mills", "response": ["#REDIRECT Wayne Mills (British Army soldier)"]}, {"page": "Wayne Mills", "response": ["Wayne Mills may refer to:", "* Wayne Mills (British Army soldier) (20th century), British Army Corporal in the Bosnian War", "* Wayne Mills (singer) (1969–2013), American country musician", "* Wayne Mills (guitarist) (1972-"]}]}}