{"wiki_id": "http://www.wikidata.org/entity/Q7976083", "itemLabel": "Wayne Carlisle", "itemDescription": "British footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Carlisle", "wikipedia_page": {"main": "Wayne Thomas Carlisle (born 9 September 1979 in Lisburn, Northern Ireland) is a former professional footballer who last played for Football League Two side Torquay United.\nCarlisle was a midfielder during his playing career, primarily right-sided, but able to play in a wide range of positions. He has been capped by Northern Ireland at youth, under-21 level and B international.Carlisle is currently assistant manager at Exeter City F.C. having been appointed in 2019.", "link_mentions": [{"page": "September 9", "response": ["*1979 – Wayne Carlisle, Northern Irish footballer and coach"]}, {"page": "Torquay United F.C.", "response": ["After finishing 3rd in the Conference Premier, Torquay had to play their fiercest rivals Exeter City to determine who would reach the play-off final to play either Cambridge United or Burton Albion. Torquay had to play Exeter City away first with the return leg at Plainmoor. Torquay started the first leg poorly and were fortunate when Tim Sills scored just before half-time but Exeter City levelled when Wayne Carlisle equalised. Just when the game looked like a draw Chris Zebroski pounced on a poor clearance by Paul Jones to make the final score 2–1 to United. Torquay knew going into the second leg that if they scored one goal Exeter City would need two goals to force extra time, and when Kevin Hill scored in the second half in his record-equalling appearance, the match seemed all over. However, Exeter City scored four goals in the space of 18 minutes, dumping Torquay out of the play-offs and ensuring they would have to spend another season in non-league football."]}, {"page": "Exeter City F.C.", "response": ["|  Wayne Carlisle"]}, {"page": "Northern Ireland national football B team", "response": ["*Wayne Carlisle "]}, {"page": "Ivybridge Community College", "response": ["* Wayne Carlisle, Director of Football since 2011"]}, {"page": "2007 Conference National play-off Final", "response": ["|MF ||29||Wayne Carlisle || || "]}, {"page": "2008 Conference Premier play-off Final", "response": ["|MF ||10 ||Wayne Carlisle"]}, {"page": "Stephen Evans (footballer)", "response": ["He missed most of the 2000–01 season through injury, returning for the final game of the season as a late substitute for Wayne Carlisle in a 4–2 win away to Portsmouth. Evans joined Swansea City on loan in November 2001, playing six times in the league and twice in the FA Cup. He returned to Crystal Palace, but was allowed to join Brentford on a free transfer in March 2002. He was released by Brentford in May 2004."]}, {"page": "2008–09 Torquay United F.C. season", "response": ["Cambridge had been defeated in the previous year's play-off final by Torquay's arch-rivals Exeter City (who had also knocked the Gulls out in the same year's semi final).  As such, they were eager to make it second time lucky, although, having experienced defeat themselves in the previous year's FA Trophy Final at Wembley, the Gulls were also keen not to repeat the disappointment of the previous season.  Although Cambridge began the brighter of the two sides, it was Torquay (wearing their white and blue away strip) who took the lead through captain Chris Hargreaves after 35 minutes.  Cambridge had more chances in the second half, but their cause was hindered when defender Phil Bolland was sent off after a second yellow card for a tackle on Elliot Benyon in the 70th minute.  Striker Tim Sills effectively sealed the victory five minutes later after he headed home a pin-point cross from winger Wayne Carlisle.", "|align=\"left\"| Wayne Carlisle ", "|align=\"left\"|15||align=\"left\"|MF||align=\"left\"| Wayne Carlisle"]}, {"page": "2009 Conference Premier play-off Final", "response": ["|RM ||15||Wayne Carlisle || || "]}, {"page": "2009–10 Torquay United F.C. season", "response": ["|10 || MF ||  || 15 || Wayne Carlisle || 2 || 0 || 0 || 0 || 2", "|15 ||  || MF || Wayne Carlisle || 4 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 4 || 0"]}, {"page": "Shane Hobbs", "response": ["Hobbs was a product of the youth system at Bristol Rovers, and was promoted to their professional squad at the beginning of the 2003–04 season. He made his debut on 18 October 2003, when he came on as a 70th-minute substitute for Wayne Carlisle in a Football League Two match against Cambridge United, and was used as a sub again in the same competition on 28 December 2003 when he replaced Junior Agogo in a game against Kidderminster Harriers. While with the club he was sent out on loan to Clevedon Town, where he played 32 times and scored twelve goals in the Southern League."]}, {"page": "2010–11 Torquay United F.C. season", "response": ["Of the trialists on show during these games, midfielder Damon Lathrope (formerly of Norwich City) caught the eye of manager Paul Buckle and was offered a two-year deal.  Meanwhile, a familiar face returned to Plainmoor in the form of striker Martin Gritton, who had enjoyed a successful spell with the Gulls between 2002 and 2004.  Although still under contract to League Two rivals Chesterfield, Gritton was allowed to join Torquay on loan until January 2011.  Another (more recent) fan favourite, Guy Branston also re-joined the Gulls, with the combative defender agreeing a permanent one-year deal having been on loan from Burton Albion for the latter half of the 2009–10 season.  However, another Plainmoor hero, Wayne Carlisle, was deemed a free agent after the winger failed to agree a new contract due, in part, to his ongoing struggle with injury.", "With the news that Wayne Carlisle had agreed to rejoin the Gulls, Torquay went into their Carling Cup First Round fixture against Reading full of confidence.  The Torquay defence proved as resilient against the Championship side as it had been against every other team it had encountered since the beginning of April, and it was not until the very last minute of extra time that Royals striker Grzegorz Rasiak finally found a way past keeper Scott Bevan.  A similar problem was encountered by Bournemouth in their Johnstone Paints Trophy First Round clash with the Gulls.  However, this time, with the match going straight to penalties with a 0–0 stalemate after 90 minutes, the Cherries still could not find a way past Bevan and Torquay went on to win the tie 3–0 in the penalty shoot out.", "Off the field, December saw the departure of two players.  Danny Senda left the Gulls after making only three appearances since joining in September, while Wayne Carlisle was released after making 76 appearances for Torquay and being a key member of the squad which gained promotion from the Conference.  Of the recent loan signings, Romone Rose was allowed to return to QPR while Ashley Hemmings had his loan deal from Wolves extended until the end of the season.", "|Wayne Carlisle"]}, {"page": "History of Exeter City F.C.", "response": ["On 26 June 2006, former loanee Paul Tisdale was named as the new manager of Exeter City on a 12-month rolling contract. On 3 July, Tisdale handed former City defender Jon Richardson, Jefferson Louis and Patrick Ada one week trials. Richardson eventually signed on an initial six-month contract on 24 July, and was joined by fellow trialist Ada. Tisdale also brought in the experienced Rob Edwards in August and former winger Wayne Carlisle returned in November following his release in the summer. Tisdale would later take advantage of Weymouth's financial difficulties to bring in Steve Tully, Richard Logan and Lee Elam, who would go on to score a hat-trick against Weymouth on his debut."]}, {"page": "2019–20 Exeter City F.C. season", "response": ["The Grecians' prospects for the season were further hit by the departures of Christy Pym and Hiram Boateng on free transfers to Peterborough United and MK Dons respectively. Goalkeepers James Hamon and Felix Norman; defenders Troy Brown, Luke Croll and Jimmy Oates; and midfielder Max Smallcombe  also departed following the expiration of their contracts. Goalkeeping coach Chris Weale, who had also been named on the subs bench during the previous season, also left the club, as did assistant manager Eric Kinder, strength and conditioning coach Andrew Wiseman, physiotherapist Adey Saunderson and sports rehabilitator Jess Preece. Former Exeter City midfielder Wayne Carlisle was promoted to the role of assistant manager, Steve Hale was brought in as goalkeeping coach, Connor Durbridge became the club's new strength and conditioning coach, and Gareth Law and Dan Feasey joined as club physiotherapists."]}, {"page": "Northern Ireland national under-21 football team records and statistics", "response": ["|align=center| Wayne Carlisle"]}]}}