{"wiki_id": "http://www.wikidata.org/entity/Q7982745", "itemLabel": "Wendy Padbury", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Wendy_Padbury", "wikipedia_page": {"main": "Wendy Padbury (born 7 December 1947) is a British actress.  She has appeared in television series since 1966, including as Zoe Heriot, a companion to Patrick Troughton's Doctor in Doctor Who, from 1968 to 1969.", "link_mentions": [{"page": "1947", "response": ["** Wendy Padbury, British actress"]}, {"page": "The Seeds of Death", "response": ["The serial is set in London and on the Moon in the 21st century. In the serial, the time traveller the Second Doctor (Patrick Troughton) and his travelling companions Jamie McCrimmon (Frazer Hines) and Zoe Heriot (Wendy Padbury), along with the technicians Gia Kelly (Louise Pajo) and Phipps (Christopher Coll), try to prevent the Ice Warriors' plot to make the Earth's atmosphere inhospitable to humans but viable for the Ice Warriors to invade."]}, {"page": "The War Games", "response": ["In the serial, an unnamed alien race led by the War Lord (Philip Madoc) kidnap and brainwash soldiers from wars throughout Earth's history to fight in war games on another planet as part of the aliens' plot to conquer the galaxy. The time traveller the Second Doctor (Patrick Troughton) and his travelling companions Jamie McCrimmon (Frazer Hines) and Zoe Heriot (Wendy Padbury) form a resistance army to stop this plot and to return the kidnapped soldiers home."]}, {"page": "Doctor Who spin-offs", "response": ["* Films that have no connection to Doctor Who besides the actors: The Airzone Solution (Colin Baker, Nicola Bryant, Peter Davison, Sylvester McCoy, Jon Pertwee), Souls' Ark (Colin Baker, Wendy Padbury, Carole Ann Ford)", "The Daleks also play a major role in the first produced stageplay to feature the Doctor. Doctor Who and the Daleks in the Seven Keys to Doomsday was written by Terrance Dicks and directed by Mick Hughes and ran at London's Adelphi Theatre over the 1974-75 Christmas season and was expected to tour England until April 1975. However the tour was cancelled at the 11th hour. Trevor Martin played an alternate version of the Fourth Doctor in this play, which takes place immediately after the Third Doctor's regeneration in Planet of the Spiders (the play was staged before Tom Baker's official debut as the Fourth Doctor in early 1975 although Baker had appeared at the close of Planet of the Spiders). The play co-starred former Doctor Who companion Wendy Padbury (playing a different character named Jenny). Also in the cast was Simon Jones as the \"Master of Karn\", several years before he worked with Doctor Who writer Douglas Adams on The Hitchhiker's Guide to the Galaxy. The play was not well-attended by audiences as it debuted during an upswing of IRA violence in London.Peel, John and Terry Nation: (1988). The Official Doctor Who & the Daleks Book. New York: St. Martin's Press. , pp. 102-105."]}, {"page": "The Five Doctors", "response": ["In early drafts of the script, some of the Doctor and companion combinations were different. Originally, the Fourth Doctor would have been paired with Sarah Jane Smith, the Third Doctor with Brigadier Lethbridge-Stewart and the Second Doctor with Jamie McCrimmon.Briggs, Nick, \"Last Orders\", Doctor Who Magazine, #229, 30 August 1995, Marvel Comics UK Ltd., p.36, quote of Nicholas Courtney (who did not specify a companion for Troughton). When Frazer Hines, Jamie's actor, proved unavailable for more than a cameo appearance the script had to be altered, pairing the Second Doctor with Victoria Waterfield. This was revised again when Deborah Watling, Victoria's actress, became unavailable and Baker decided not to appear, resulting in the pairings as they were screened. Instead of meeting phantoms of Jamie and Zoe (Wendy Padbury), the Second Doctor and the Brigadier were originally scripted to meet Zoe and Victoria. The Doctor would have realised the truth about them when Victoria called Lethbridge-Stewart \"Brigadier\", when she only knew him as a Colonel (in The Web of Fear). Deborah Watling was unable to make the recording dates but Frazer Hines was able to free himself up for a day's shooting, so Jamie was written in instead."]}, {"page": "Wendy", "response": ["* Wendy Padbury (born 1947), English actress"]}, {"page": "Zoe Heriot", "response": ["Zoe Heriot (sometimes spelled Zoe Herriot) is a fictional character played by Wendy Padbury in the long-running British science fiction television series Doctor Who. A young astrophysicist who lived on a space wheel in the 21st century, she was a companion of the Second Doctor and a regular in the programme from 1968 to 1969.", "Wendy Padbury returned to Doctor Who as an illusory image of Zoe in the 20th anniversary episode, The Five Doctors."]}, {"page": "The Dominators", "response": ["In the serial, the Second Doctor (Patrick Troughton) and his travelling companions Jamie McCrimmon (Frazer Hines) and Zoe Heriot (Wendy Padbury) work with the Dulcians of the planet Dulkis to prevent the alien Dominators from blowing up Dulkis and using its irradiated remains as spaceship fuel."]}, {"page": "Ice Warrior", "response": ["They returned in the 1969 serial The Seeds of Death, which takes place in the mid-21st century. In this story, the world has grown dependent on the matter transmission system T-Mat, which an Ice Warrior strike forces intends to exploit to conquer Earth. After seizing the T-Mat relay on the Moon, they use it to send seeds that are intended to reduce the atmosphere's oxygen, resembling the Martian atmosphere and making the Earth hospitable for Martian life. This plan is foiled by the Second Doctor and his companions Jamie (Frazer Hines) and Zoe (Wendy Padbury), and the invading Martian fleet is sent into an orbit around the Sun."]}, {"page": "List of Doctor Who audio plays by Big Finish", "response": ["Nearly all of the companions from the original series have appeared, voiced by their original actors. They include Susan (Carole Ann Ford), Ian Chesterton (William Russell), Vicki (Maureen O'Brien), Steven Taylor (Peter Purves), Sara Kingdom (Jean Marsh), Polly (Anneke Wills), Jamie McCrimmon (Frazer Hines), Victoria Waterfield (Deborah Watling), Zoe Heriot (Wendy Padbury), Jo Grant (Katy Manning), Brigadier Lethbridge-Stewart (Nicholas Courtney), Sergeant Benton (John Levene), Mike Yates (Richard Franklin), Leela (Louise Jameson), K9 (John Leeson), Romana I (Mary Tamm), Romana II (Lalla Ward), Adric (Matthew Waterhouse), Nyssa (Sarah Sutton), Tegan Jovanka (Janet Fielding), Vislor Turlough (Mark Strickson), Peri Brown (Nicola Bryant), Melanie Bush (Bonnie Langford) and Ace (Sophie Aldred). Adventures featuring revival series companions Rose Tyler (Billie Piper) and Donna Noble (Catherine Tate) have also been released."]}, {"page": "Frazer Hines", "response": ["Hines and his fellow lead actors Patrick Troughton and Wendy Padbury (who played the Doctor's other companion Zoe Heriot) decided collectively that the workload of Doctor Who was exhausting them. Frazer was the first of the three to announce his intention to leave. Troughton asked him to stay a few more months, to the end of the sixth series, as this was when Troughton planned to relinquish his role. The three actors remained with the show until the conclusion of the final Season 6 serial The War Games (1969). In a documentary about Patrick Troughton, Hines reported that they all left with smiles on their faces, feeling that their job was done and that it was well done. Frazer attested that he remained in contact with Troughton afterward."]}, {"page": "SuperTed", "response": ["*Blotch - Spotty's sister, voiced by Sheila Steafel in the original Welsh-language version of the show and Wendy Padbury voiced Blotch in Super Safe with SuperTed."]}, {"page": "Michael Craze", "response": ["Craze died of a heart attack on 8 December 1998. He had fallen down some steps the previous day while picking up his neighbour's paper for her and, owing to a heart condition, was unable to be operated on. Craze's funeral was attended by hundreds of Doctor Who fans, who had become devoted to him through his regular appearances at Doctor Who conventions, as well as series stars including Anneke Wills, Deborah Watling and Wendy Padbury. The Doctor Who theme music accompanied his coffin at the funeral. Craze was cremated and his ashes were scattered on the river Thames."]}, {"page": "Doctor Who missing episodes", "response": ["Beginning in 1999, the BBC started releasing all the serials with missing episodes on CD audiobook, with linking narration provided by former actors on the serials, such as William Russell, Peter Purves, Frazer Hines, Anneke Wills, Wendy Padbury and Carole Ann Ford, although Colin Baker's 1992 cassette link narration was reused for the 2000 CD release of The Macra Terror, which left much more to the listener's imagination compared to all other CD releases of Doctor Who TV soundtrack audiobooks from 1999 to 2012. In 2012, The Macra Terror was re-released as part of the Collections 4 boxset, and included new more detailed linking narration by Anneke Wills. By February 2006, the soundtracks for all of the then 108 missing episodes had been released, albeit with a copyright-uncleared music replacement of Paperback Writer by The Beatles with Hold Tight by Dave Dee, Dozy, Beaky, Mick & Tich in the second coffee bar scene during Episode 1 of The Evil of the Daleks. On the CDs, there are also some slight pauses and slightly rejigged sequences for reasons of clarity, and with overdubbed linking narration."]}, {"page": "Second Doctor", "response": ["Troughton's Doctor was an outwardly scruffy, light hearted and bumbling tramp nicknamed the Cosmic Hobo, who hid a more firm and slightly darker side he would often use to manipulate his enemies and allies alike for the greater good. His original \"swinging sixties\" companions were the sophisticated socialite Polly (Anneke Wills) and working class sailor Ben Jackson (Michael Craze), who travelled with his previous incarnation. They were later joined by 18th century Jacobite Jamie McCrimmon (Frazer Hines), who would become the Second Doctor's most loyal and trusted companion. Following Ben and Polly's departures, the Doctor and Jamie were joined by the Victorian orphan Victoria Waterfield (Deborah Watling) and 21st century astrophysicist Zoe Heriot (Wendy Padbury). Jamie and Zoe stayed with the Second Doctor until the Time Lords sent them back to their own times, with their memories of all but their first encounter with him wiped. "]}, {"page": "The Krotons", "response": ["In the serial, the time traveller the Second Doctor (Patrick Troughton) and his travelling companions Jamie McCrimmon (Frazer Hines) and Zoe Heriot (Wendy Padbury) battle alongside the Gond race against the crystalline aliens the Krotons, who enslaved the Gonds in their city for thousands of years."]}, {"page": "The Invasion (Doctor Who)", "response": ["Wendy Padbury does not appear in episode 3, as she was on holiday. Frazer Hines was on a scheduled break during the last episode but did appear in a pre-recorded film insert at the conclusion."]}, {"page": "The Space Pirates", "response": ["Patrick Troughton, Frazer Hines and Wendy Padbury were all away on location filming The War Games during the production of episode six and appear only in pre-filmed inserts. Thus, this is one of only two 1960s episodes to have none of the regular cast present for a studio recording, the other being the 1965 story \"Mission to the Unknown\"."]}, {"page": "The Wheel in Space", "response": ["In this serial, the Doctor (Patrick Troughton) and his travelling companion Jamie McCrimmon (Frazer Hines) become stranded on a seemingly abandoned spaceship called Silver Carrier. They make contact with and board another wheel-shaped space station known as W3, only to discover that a small group of Cybermen have followed and plan on using the wheel's radio link to Earth as a beacon for their invasion fleet. This serial is notable for the first appearance of Wendy Padbury as companion Zoe Heriot.", "In July 1992 Episodes 3 and 6 were released on VHS as part of the Cybermen: The Early Years collection. They were later released on DVD in November 2004 in the three-disc Lost in Time set: the censor clips from Episodes 4 and 5 were also included. All six episodes' original audio tracks were released on CD with narration by Wendy Padbury in May 2004."]}, {"page": "Davros (audio drama)", "response": ["*Lorraine Baynes — Wendy Padbury", "*Wendy Padbury played former companion Zoe Heriot alongside Patrick Troughton's Second Doctor from The Wheel in Space to The War Games.", "*Wendy Padbury reunites with Colin Baker in Legend of the Cybermen, this time playing Zoe, and accompanied by Frazer Hines as Jamie McCrimmon."]}, {"page": "Score with the Scaffold", "response": ["It was a quiz programme, although interspersed with various material including musical numbers and sketches. It ran for two series, and the format was revised between the first and second series.  In the first series The Scaffold co-presented the programme with Wendy Padbury and they asked questions which the audience were supposed to answer.  In the second series they brought they were joined by Annabel Scase, and it was a contest between two teams of children each representing a different BBC local radio station."]}, {"page": "Melvyn Hayes", "response": ["Hayes first married actress Rosalind Allan, with whom he has two daughters and one son. He has two daughters with his second wife, former actress and theatrical agent Wendy Padbury; their daughter, Charlie Hayes, also became an actress. He is now married to Jayne Male and lives in Ryde on the Isle of Wight. Hayes has one child with Male."]}, {"page": "Doctor Who audio productions", "response": ["In 1998, the Doctor Who Appreciation Society produced a collection of audio adventures entitled Cosmic Fugue 2 in aid of charity. The stories were read by Doctor Who actors Colin Baker, Elisabeth Sladen, Caroline John, Wendy Padbury and Louise Jameson and the writers included Barry Letts and Gary Russell, the latter of whom went on to produce Doctor Who audio dramas for Big Finish Productions. The BBC released a collection of audio versions of short stories featured in the book Short Trips, along with an original story, all read by Sophie Aldred and Nicholas Courtney. Following this, another two collections of audio versions of stories featured in Short Trips and More Short Trips, along with an original story on each, were released - Earth and Beyond read by Paul McGann and Out of the Darkness read by Colin Baker and Nicola Bryant."]}, {"page": "List of companions in Doctor Who spin-offs", "response": ["Jenny was one of the Doctor's companions in the stage play Doctor Who and the Daleks in the Seven Keys to Doomsday. She was played by Wendy Padbury, who had previously played Zoe Heriot. Not to be confused with Jenny from the 2008 episode \"The Doctor's Daughter.\"", "In the Big Finish audio adaptation, she was played by Wendy Padbury's daughter Charlie Hayes."]}, {"page": "Freewheelers", "response": ["Ronald Leigh-Hunt, as the British secret service agent Colonel Buchan, was the most regular cast member, appearing in series 1–4 and series 6. In 1971, he had a major part in the feature film Le Mans and when production of that overran by two months, he was unavailable for series 5; the absence of his character from the series was explained as him being on an overseas mission. The teenagers, almost invariably referred to as \"the kids\", varied over the years. The original line-up consisted of Tom Owen, Mary Maude and Gregory Phillips. Chris Chittell featured in series 2 and 3 and Adrian Wright played Mike Hobbs in series 4–7. Former Doctor Who companion Wendy Padbury joined the cast in series 5 as art student Sue Craig. Her youthful looks enabled her to portray a character several years her junior, although by the final series, with the actress in her mid-twenties and then married to actor Melvyn Hayes, careful camera angles were required to conceal an advancing pregnancy. Padbury was the only regular actor to appear in the eighth series, which was a single 13-part serial. She was teamed with co-star Martin Neil, who played Sue's boyfriend Dave."]}, {"page": "Doctor Who and the Daleks in the Seven Keys to Doomsday", "response": ["Appearing as the Doctor's companions were Wendy Padbury as Jenny, and James Matthews as Jimmy. Padbury had previously played the Doctor's companion Zoe Herriot in the television series. Future The Hitchhiker's Guide to the Galaxy star Simon Jones appeared as the Master of Karn as well as Dalek extra.", "*Wendy Padbury as Jenny", "* Charlie Hayes as JennyCharlie Hayes is also the daughter of Wendy Padbury, who played Jenny in the original stage production."]}, {"page": "Galaxy (British TV channel)", "response": ["Between the stories, there were also many editions of BSB's own programme, 31 Who, presented by Debbie Flint, Shyama Perera and John Nathan-Turner, and featuring interviews with Sylvester McCoy, Carole Ann Ford, Elisabeth Sladen, Peter Purves, Wendy Padbury, Terrance Dicks, Bob Baker & Dave Martin, Nicholas Courtney, William Russell, Jon Pertwee, Frazer Hines, Deborah Watling and many more. "]}, {"page": "Charlie Bubbles", "response": ["* Wendy Padbury as Woman in Cafe"]}, {"page": "Doctor Who Appreciation Society", "response": ["| Zoe Does It || Crispin Brigham || Wendy Padbury ||  || Zoe Herriot"]}, {"page": "Companion (Doctor Who)", "response": ["| Wendy Padbury"]}, {"page": "Fear of the Daleks", "response": ["*Wendy Padbury — Zoe"]}, {"page": "You and Me (British TV series)", "response": ["*Wendy Padbury (1976 - \"Shapes\" unit)"]}, {"page": "List of Doctor Who cast members", "response": ["William Hartnell, Carole Ann Ford, William Russell and Jacqueline Hill first appeared as the Doctor, Susan Foreman, Ian Chesterton and Barbara Wright respectively in the show's debut serial; An Unearthly Child. Ford departed in The Dalek Invasion of Earth in 1964 and was replaced by Maureen O'Brien playing a character called Vicki. Russell and Hill departed together the following year in The Chase and were subsequently replaced by Peter Purves as Steven Taylor. Adrienne Hill took over from O'Brien for a short period of time as Katarina. Jean Marsh subsequently played the character of Sara Kingdom also for a short period of time before being replaced by Jackie Lane as Dodo Chaplet in The Ark in 1966. Purves and Lane stepped down from their roles at around the same time and were replaced by Anneke Wills and Michael Craze who played Polly and Ben Jackson. Patrick Troughton took over from Hartnell in the fourth season as the Second Doctor and starred alongside Wills and Craze and, after they stepped down, Deborah Watling, Frazer Hines and Wendy Padbury who respectively played Victoria Waterfield, Jamie McCrimmon and Zoe Heriot. At the end of The War Games, Troughton was replaced by Jon Pertwee who began his run as the Third Doctor alongside Caroline John as Liz Shaw in the 1970 serial; Spearhead from Space. John departed after Inferno and Katy Manning as Jo Grant, her replacement, appeared in the following serial Terror of the Autons. Throughout Pertwee's run, Nicholas Courtney, Richard Franklin and John Levene made regular appearances as The Brigadier, Mike Yates and Sergeant Benton respectively.", "| Wendy Padbury || colspan=\"2\" | Zoe Heriot || colspan=\"4\"  || colspan=\"2\"  || colspan=\"4\" ", "For The Five Doctors – the show's 20th anniversary special – Carole Ann Ford, Nicholas Courtney, Elisabeth Sladen, Lalla Ward, Wendy Padbury, Caroline John, Richard Franklin, John Leeson and Frazer Hines reprised their roles as, respectively, Susan Foreman, Brigadier Lethbridge-Stewart, Sarah Jane Smith, Romana, Zoe Heriot, Liz Shaw, Mike Yates, K-9 and Jamie McCrimmon. The special was broadcast between the twentieth and twenty-first seasons."]}, {"page": "Alcester Grammar School", "response": ["* Wendy Padbury, actress, known from 1968-69 for her Zoe Heriot companion to the second Doctor Who Patrick Troughton "]}, {"page": "Visions (convention)", "response": ["| Peter Davison, Colin Baker, Carole Ann Ford, William Russell, John Levene, Elisabeth Sladen, John Leeson, Anthony Ainley, Nicola Bryant, Sophie Aldred, Jan Chappell, Wendy Padbury, Jacqueline Pearce, Mark Ryan, John Abineri, Jeremy Bulloch, Danny John-Jules, Bill Baggs, Christopher Barry, Jeremy Bentham, Jean-Marc Lofficier, Randy Lofficier, John Nathan-Turner, John Peel, Gary Downie"]}, {"page": "Jamie Robertson", "response": ["* Doctor Who The Rosemariners (with Frazer Hines Wendy Padbury", "* Doctor Who The Rosemariners (with Frazer Hines Wendy Padbury"]}, {"page": "List of former Emmerdale characters", "response": ["|Rosemary Roberts || Wendy Padbury || 1987"]}]}}