{"wiki_id": "http://www.wikidata.org/entity/Q7982588", "itemLabel": "Wendy Austin", "itemDescription": "BBC journalist/broadcaster/BBC Northern Ireland/presenter:BBC Radio Ulster’s  Talkback program", "wikipedia_url": "https://en.wikipedia.org/wiki/Wendy_Austin", "wikipedia_page": {"main": "Dr Wendy Elizabeth Austin Hewitt, Wendy Austin  is a former BBC journalist and broadcaster in BBC Northern Ireland, and former presenter of BBC Radio Ulster’s current affairs programme Talkback.\nAustin began her career in journalism at The Belfast Telegraph, leaving in 1976 to join the fledgling Downtown Radio, and later that year moving to the BBC where she was a television reporter before moving into radio presentation.\nFrom 1981 she was involved in the breakfast time Good Morning Ulster reporting and presenting, before moving to the newly created Breakfast Time on BBC TV. Other radio shows followed - Morning Extra and Wendy After Lunch, before a move to BBCR4 in London, presenting PM Woman's Hour and The Exchange. She returned to present GMU in the early 1990s. On one occasion on Good Morning Ulster while interviewing former Ulster Unionist Party deputy leader John Taylor she objected to what she perceived as his patronising style and stated \"I am not your dear girl.\" In 2009 she began to present the lunchtime Talk Back on Radio Ulster, then in 2015 launched BBC R Ulster's Inside Business.\nIn 2005 Wendy Austin was awarded an Honorary Degree of Doctor of Letters (DLitt), University of Ulster, \"for her contribution to broadcasting\". She was named the Northern Ireland Radio Broadcaster of the year in the CIPR Awards 2006. Austin was Chairperson of the Arts and Business NI Advisory Committee and a UK Trustee of the charity.\nWendy was awarded an MBE in the 2012 Queen's Birthday Honours list.", "link_mentions": [{"page": "BBC Radio Ulster", "response": ["*Wendy Austin"]}, {"page": "Austin (surname)", "response": ["* Wendy Austin, British journalist"]}, {"page": "Crimewatch", "response": ["In October 2017, the BBC announced that the main Crimewatch series had been cancelled, citing declining viewership. The daytime spin-off series Crimewatch Roadshow (now Crimewatch Live) would continue to air, but will also air more episodes per year. Crime NI, a similar live monthly programme in partnership with Crimestoppers UK, began airing on 13 September 2021 on BBC One Northern Ireland and is presented by Wendy Austin and Dearbhail McDonald."]}]}}