{"wiki_id": "http://www.wikidata.org/entity/Q8003505", "itemLabel": "Willard Wigan", "itemDescription": "English sculptor", "wikipedia_url": "https://en.wikipedia.org/wiki/Willard_Wigan", "wikipedia_page": {"main": "Willard Wigan,  (born June 1957) is a British sculptor from Ashmore Park Estate, Wednesfield, England, the son of Jamaican immigrants, who makes microscopic art. His sculptures are typically placed in the eye of a needle or on the head of a pin. A single sculpture can be as small as 0.005 mm (0.0002 in).", "link_mentions": [{"page": "List of people with dyslexia", "response": ["*Willard Wigan, English sculptor"]}, {"page": "An Eye on X", "response": ["An Eye On X (Daybreak), 1995, is a short film produced and directed by Pogus Caesar, about the Birmingham micro sculptor Willard Wigan."]}, {"page": "List of British artists", "response": ["* Willard Wigan (born 1957)"]}, {"page": "David Lloyd (tennis)", "response": ["In May 2007, Lloyd bought the collection of artist Willard Wigan, estimated to be valued at £11.2 million."]}, {"page": "Miniature art", "response": ["* Willard Wigan (UK)"]}, {"page": "Marilyn Monroe in popular culture", "response": ["* Willard Wigan: Marilyn Monroe on a Diamond (2007–2008)\"The Wee Works of Willard Wigan\" The Orlando Sentinel October 15, 2013"]}, {"page": "Willard Wigen", "response": ["#REDIRECT Willard Wigan"]}, {"page": "List of people from Wolverhampton", "response": ["* Willard Wigan (born 1957) – sculptor, creates microscopic sculptures"]}, {"page": "Cultural depictions of Henry VIII", "response": ["*Willard Wigan: The Six Wives of Henry VIII"]}, {"page": "Greubel Forsey", "response": ["Art Piece 1is a collaboration between Greubel Forsey and British micro-sculptor Willard Wigan. Art Piece 1Art Piece 1 by Worldtempus Art Piece 1 features integrated magnifying optics on the side of the case to enable the Willard Wigan micro-sculpture to be viewed."]}, {"page": "Willard (name)", "response": ["* Willard Wigan (born 1957), British sculptor"]}, {"page": "Is It Possible?", "response": ["The first episode aired on March 24, 2010, and included a contortionist, a blind man who uses echolocation, microscopic art by Willard Wigan, the fish Macropinna microstoma, a lyrebird, a man who roller skated on a roller coaster, and several other subjects."]}, {"page": "Chosen Hill, Gloucestershire", "response": ["In 2010, the BBC reported that Willard Wigan, famed for his microscopic art, had sculpted a model of Chosen Hill's  St Bartholomew's church on a grain of sand that he had taken from its churchyard. He had done so in response to a challenge from his girlfriend, who described the result as \"absolutely fantastic\". The church's vicar, the Reverend Jonathan Perkin, called the model beautiful, but Wigan expressed his own dissatisfaction with the work, saying \"As small as what you've seen, it's not the best of me yet, I'm taking it even smaller because I'm not satisfied with my work right now, it's too big.\""]}, {"page": "Micro miniature", "response": ["* Willard Wigan"]}, {"page": "List of Black British artists", "response": ["* Willard Wigan (born 1957)"]}, {"page": "Wigan (surname)", "response": ["* Willard Wigan (born 1957), English sculptor of microscopic art"]}]}}