{"wiki_id": "http://www.wikidata.org/entity/Q8006732", "itemLabel": "William Charles Osman Hill", "itemDescription": "British anthropologist and anatomist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Charles_Osman_Hill", "wikipedia_page": {"main": "Dr William Charles Osman Hill FRSE FZS FLS FRAI (13 July 1901 – 25 January 1975) was a British anatomist, primatologist, and a leading authority on primate anatomy during the 20th century.  He is best known for his nearly completed eight-volume series, Primates: Comparative Anatomy and Taxonomy, which covered all living and extinct primates known at the time in full detail and contained illustrations created by his wife, Yvonne.  Schooled at King Edward VI Camp Hill School for Boys in Birmingham and University of Birmingham, he went on to publish 248 works and accumulated a vast collection of primate specimens that are now stored at the Royal College of Surgeons of England.", "link_mentions": [{"page": "Bigfoot", "response": ["Ivan T. Sanderson and Bernard Heuvelmans, founders of the subculture and pseudoscience of cryptozoology, have spent parts of their career searching for Bigfoot. Later scientists who researched the topic included Jason Jarvis, Carleton S. Coon, George Allen Agogino and William Charles Osman Hill, although they came to no definite conclusions and later stopped their research."]}, {"page": "List of biologists", "response": ["*William Charles Osman Hill (1901–1975), British anatomist, primatologist and expert on primate anatomy"]}, {"page": "Strepsirrhini", "response": ["English comparative anatomist William Henry Flower created the suborder Lemuroidea in 1883 to distinguish these primates from the simians, which were grouped under English biologist St. George Jackson Mivart's suborder Anthropoidea (=Simiiformes). According to Flower, the suborder Lemuroidea contained the families Lemuridae (lemurs, lorises, and galagos), Chiromyidae (aye-aye), and Tarsiidae (tarsiers). Lemuroidea was later replaced by Illiger's suborder Prosimii. Many years earlier, in 1812, É. Geoffroy first named the suborder Strepsirrhini, in which he included the tarsiers. This taxonomy went unnoticed until 1918, when Pocock compared the structure of the nose and reinstated the use of the suborder Strepsirrhini, while also moving the tarsiers and the simians into a new suborder, Haplorhini. It was not until 1953, when British anatomist William Charles Osman Hill wrote an entire volume on strepsirrhine anatomy, that Pocock's taxonomic suggestion became noticed and more widely used. Since then, primate taxonomy has shifted between Strepsirrhini-Haplorhini and Prosimii-Anthropoidea multiple times."]}, {"page": "Pangboche Hand", "response": ["London University primatologist William Charles Osman Hill conducted a physical examination of the pieces that Byrne supplied. His first findings were that it was hominid in nature, and later in 1960 he decided that the Pangboche fragments were a closer match with a Neanderthal."]}, {"page": "Slow loris", "response": ["Several more species were named around 1900, including Nycticebus menagensis (originally Lemur menagensis) by Richard Lydekker in 1893 and Nycticebus pygmaeus by John James Lewis Bonhote in 1907. However, in 1939 Reginald Innes Pocock consolidated all slow lorises into a single species, N. coucang, and in his influential 1953 book Primates: Comparative Anatomy and Taxonomy, primatologist William Charles Osman Hill also followed this course. In 1971 Colin Groves recognized the pygmy slow loris (N. pygmaeus) as a separate species, and divided N. coucang into four subspecies, while in 2001 Groves opined there were three species (N. coucang, N. pygmaeus, and N. bengalensis), and that N. coucang had three subspecies (Nycticebus coucang coucang, N. c. menagensis, and N. c. javanicus)."]}, {"page": "Giant mouse lemur", "response": ["In 1870, the British zoologist John Edward Gray placed Coquerel's giant mouse lemur into its own genus, Mirza. This classification was widely ignored and later rejected in the early 1930s by zoologists Ernst Schwarz, Guillaume Grandidier, and others, who felt that its longer fur and bushy tail did not merit a separate genus and instead placed it in Microcebus. British anatomist William Charles Osman Hill also favored this view in 1953, noting that despite its larger size (comparable to Cheirogaleus), its first upper premolar was proportionally small as in Microcebus. In 1977, French zoologist Jean-Jacques Petter also favored the Microcebus classification, despite the threefold size difference between Coquerel's giant mouse lemur and the other members of the genus."]}, {"page": "Harold Stranger", "response": ["Stranger was born in IslingtonFree Births, Deaths and Marriages a son of Innes Thomas Stranger(2007, December 01). Stranger, Innes Harold, (1879–28 July 1936), KC 1933; Recorder of Sunderland since 1936. WHO'S WHO & WHO WAS WHO. Retrieved 26 Dec. 2020, from https://www.ukwhoswho.com/view/10.1093/ww/9780199540891.001.0001/ww-9780199540884-e-217743. of Worthing.The Liberal Year Book for 1929 He was educated privately and read law. In 1907 he married Milly Norah Tunbridge, daughter of J.B. Tunbridge JP of Hythe, in Elham, Kent.Free Births, Deaths and Marriages In 1909 he was called to the Bar by the Middle Temple. His daughter, Yvonne Stranger, also a Barrister (called 1933), married William Charles Osman Hill in 1947."]}, {"page": "Sunda slow loris", "response": ["Between 1800 and 1907, several other slow loris species were described, but in 1953 the primatologist William Charles Osman Hill, in his influential book, Primates: Comparative Anatomy and Taxonomy, consolidated all the slow lorises into a single species, N. coucang. In 1971 Colin Groves recognized the pygmy slow loris (N. pygmaeus) as a separate species, and divided N. coucang into four subspecies.  In 2001 Groves opined that there were three species (N. coucang, N. pygmaeus, and N. bengalensis), and that N. coucang itself had three subspecies (Nycticebus coucang coucang, N. c. menagensis, and N. c. javanicus).  These three subspecies were promoted in 2010 to species status—the Sunda slow loris, the Javan slow loris (N. javanicus) and Bornean slow loris (N. menagensis).  Species differentiation was based largely on differences in morphology, such as size, fur color, and head markings.  (At the end of 2012, the Bornean slow loris was itself divided into four distinct species.)"]}, {"page": "William Hill", "response": ["*William Charles Osman Hill (1901–1975), British anatomist and primatologist"]}, {"page": "Pygmy slow loris", "response": ["In an influential 1953 publication, primatologist William Charles Osman Hill also consolidated all the slow lorises in one species, Nycticebus coucang, and considered other forms distinct at the subspecies level. Osman Hill thus listed Nycticebus coucang pygmaeus, while acknowledging that \"it may be deemed necessary to accede this form specific rank.\" In 1960, Dao Van Tien reported a species from Hòa Bình Province, Vietnam, that he called N. intermedius, but it turned out that his specimens were merely adults of the pygmy slow loris, which had originally been described on the basis of a juvenile. After studying slow lorises from Indochina, primatologist Colin Groves proposed that the pygmy slow loris was morphologically unique enough to be considered a distinct species. The validity of this opinion was later corroborated by studies of chromosomal structure, genetic distance determined by protein variation at polymorphic loci, and mitochondrial DNA restriction enzyme analysis."]}, {"page": "Gray slender loris", "response": ["Together with the red slender loris (Loris tardigradus), the grey slender loris (Loris lydekkerianus) is a type of slender loris (genus Loris) in the strepsirrhine primate family Lorisidae. In 1908 Spanish zoologist Ángel Cabrera first described the Mysore slender loris (Loris tardigradus lydekkerianus) in Chennai, India, which he named for the English naturalist Richard Lydekker. This subspecies was further described by William Charles Osman Hill in his seminal primate book Primates: Comparative Anatomy and Taxonomy (1953). Hill believed there was one species of slender loris which was further split into six subspecies, two in India and four in Sri Lanka. In 1998 biological anthropologist Colin Groves recognised two species, L. tardigradus and L. lydekkerianus, which have been widely accepted by the scientific community. Loris lydekkerianus now includes four geographically separated subspecies, L. l. lydekkerianus (previously L. t. lydekkerianus) and L. l. malabaricus in India and L. l. nordicus and L. l. grandis in Sri Lanka."]}, {"page": "Outline of human anatomy", "response": ["* William Charles Osman Hill"]}, {"page": "Osman Hill's mangabey", "response": ["Osman Hill's mangabey was named after William Charles Osman Hill, a primatologist, anthropologist, and anatomist from the 20th century."]}, {"page": "Pachylemur", "response": ["Pachylemur was similar to but significantly larger and more robust than living ruffed lemurs (genus Varecia).  In addition to their general morphology, studies of their teeth (dental anatomy) also suggest a close relation.  In 1953, William Charles Osman Hill noted that the skull of both P. insignis and P. jullyi (then called Lemur insignis and L. jullyi) resembled that of ruffed lemurs more so than the rest of the lemurs classified in the genus Lemur at that time."]}, {"page": "Philippine slow loris", "response": ["In his influential 1953 book Primates: Comparative Anatomy and Taxonomy, the primatologist William Charles Osman Hill placed all the slow lorises in one species, N. coucang. In 1971, however, Colin Groves recognized the pygmy slow loris (N. pygmaeus) as a separate species, and divided N. coucang into four subspecies, including Nycticebus coucang menagensis.  Nycticebus menagensis was elevated to the species level in 2006 when molecular analysis of DNA sequences of the D-loop and the cytochrome b gene demonstrated it to be genetically distinct from N. coucang. The genetic evidence was corroborated by both a previous study (1998) on morphology (based on craniodental measurements) that indicated distinct differences between the subspecies that were consistent with separation at the species level, and a later study (2010) of facial markings."]}, {"page": "List of British scientists", "response": ["* William Charles Osman Hill (1901–1975), anatomist and primatologist"]}]}}