{"wiki_id": "http://www.wikidata.org/entity/Q8006657", "itemLabel": "William Cecil, 3rd Marquess of Exeter", "itemDescription": "British politician (1825-1895)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cecil,_3rd_Marquess_of_Exeter", "wikipedia_page": {"main": "William Alleyne Cecil, 3rd Marquess of Exeter PC (30 April 1825 – 14 July 1895), styled Lord Burghley between 1825 and 1867, was a British peer and Conservative politician. He served as Treasurer of the Household between 1866 and 1867 and as Captain of the Honourable Corps of Gentlemen-at-Arms between 1867 and 1868.\n\n", "link_mentions": [{"page": "William Cecil", "response": ["* William Cecil, 3rd Marquess of Exeter (1825–1895), member of the Privy Council of the United Kingdom"]}, {"page": "Baron Amherst of Hackney", "response": ["Baron Amherst of Hackney (), in the County of London, is a title in the Peerage of the United Kingdom. It was created on 26 August 1892 for the former Conservative Member of Parliament William Tyssen-Amherst, with remainder, in default of male issue, to his eldest daughter Mary and her issue male. Tyssen-Amherst had previously represented West Norfolk and South West Norfolk in the House of Commons. He was succeeded according to the special remainder by his daughter Mary. She was the wife of Colonel Lord William Cecil, third son of William Cecil, 3rd Marquess of Exeter.  the title is held by their great-great-grandson, the fifth Baron, who succeeded his father in 2009. As a male-line descendant of the third Marquess of Exeter he is also in remainder to this peerage and its subsidiary titles the earldom of Exeter and barony of Burghley."]}, {"page": "William Alleyne Cecil, 3rd Marquess of Exeter", "response": ["#REDIRECT William Cecil, 3rd Marquess of Exeter"]}, {"page": "University Pitt Club", "response": ["*William Cecil, 3rd Marquess of Exeter (1825–1895), British peer and politician."]}, {"page": "Lord William Cecil (courtier)", "response": ["Lord William was born on 2 November 1854, a younger son of William Cecil, 3rd Marquess of Exeter (1825–1895) and Lady Georgina Sophia Pakenham (died 1909), daughter of Thomas Pakenham, 2nd Earl of Longford (1774–1835). His paternal grandparents were Brownlow Cecil, 2nd Marquess of Exeter (1795–1867), and Isabella Poyntz, daughter of William Stephen Poyntz (1770–1840), an English Whig and Liberal politician who sat in the House of Commons variously between 1800 and 1837."]}, {"page": "Brownlow Cecil, 4th Marquess of Exeter", "response": ["Exeter was the eldest son of William Cecil, 3rd Marquess of Exeter, and Lady Georgiana Sophia, daughter of Thomas Pakenham, 2nd Earl of Longford. Lord William Cecil and Lord John Joicey-Cecil were his younger brothers."]}, {"page": "William Cunliffe Brooks", "response": ["Brooks married Jane Elizabeth Orrell, daughter of Ralph Orrell in 1842. They had no sons but two daughters (other children died in infancy).His infant son and daughter have a grave in Chorlton-cum-Hardy old graveyard Their elder daughter, Amy, married Charles Gordon, 11th Marquis of Huntly. Their second daughter, Edith, married Lord Francis Horace Pierrepont Cecil, second son of William Cecil, 3rd Marquess of Exeter. They have many descendants in both England and America, including Sir James Cockburn, Lady Ethel Cecil, Diana Lewis and Isabella Overington."]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*William Cecil, 3rd Marquess of Exeter"]}, {"page": "Lord John Joicey-Cecil", "response": ["Joicey-Cecil was the fourth son of William Cecil, 3rd Marquess of Exeter, and his wife Lady Georgina Sophia, daughter of Thomas Pakenham, 2nd Earl of Longford. Brownlow Cecil, 4th Marquess of Exeter and  Lord William Cecil  were his elder brothers."]}, {"page": "WA Cecil", "response": ["#REDIRECT William Cecil, 3rd Marquess of Exeter"]}, {"page": "Eric Kennington", "response": ["In 1922, Kennington married Edith Cecil, daughter of Lord Francis Horace Pierrepont Cecil (who was second son of William Cecil, 3rd Marquess of Exeter), with whom he had a son and a daughter. Edith, who was already married to William Hanbury-Tracy (5th Baron Sudeley), fell in love with Kennington while he was painting her husband's picture. They both remained good friends with Edith's ex-husband."]}, {"page": "Robert Myddelton Biddulph (1805–1872)", "response": ["His grandchildren included Agnes Mary Myddelton Biddulph (d. 1920), Catherine Myddelton Biddulph (d. 1889), Colonel Robert Edward Myddelton (1866-1949), and Algernon Hugh Myddelton Biddulph (1872-1906). Agnes married Hedworth Trelawny Barclay, son of Alexander Charles Barclay, and was the mother of Vera Agnes Barclay who married Captain Honourable Thomas James Amherst Cecil (1887–1955), son of Lord William Cecil, the younger son of William Cecil, 3rd Marquess of Exeter."]}]}}