{"wiki_id": "http://www.wikidata.org/entity/Q8008491", "itemLabel": "William Edwin Pease", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Edwin_Pease", "wikipedia_page": {"main": "William Edwin Pease (3 June 1865 – 23 January 1926) was an  English businessman and Conservative Party politician from County Durham. Pease was educated at Clifton College and Trinity College, Cambridge.He was born into the wealthy Pease family of Darlington, Quakers who had prospered through a variety of enterprises including railways, coal mines, woolen manufacturing and a family bank which collapsed in 1902. His father Edwin Lucas Pease (died 1899) was the grandson of Joseph Pease (1772–1846), an abolitionist and founder of the Peace Society. He became Chairman of the Cleveland Bridge and Engineering Company some times after his father's death in 1889, and was also a director of the Consett Iron Works.He was elected as Member of Parliament (MP) for Darlington at a by-election in February 1923. He replaced his cousin Herbert Pike Pease, who had been ennobled as Baron Daryngton (and who had been elected to succeed his father Arthur). William Pease held the seat until his death in 1926.", "link_mentions": [{"page": "List of political families in the United Kingdom", "response": ["***William Edwin Pease (1865–1926), industrialist, Conservative MP for Darlington, 1923–1926"]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|William Edwin Pease"]}, {"page": "Mowden, County Durham", "response": ["John Beaumont Pease bought the farmland in the 1840s on which Mowden Hall stands and demolished it in 1862. He tried to ensure it was a private site by diverting an ancient footpath to High Coniscliffe out of his sight. After his death, his son Edwin Lucas Pease continued to block the footpath, angering the locals. He had promised to unblock the path but did not and even diverted another footpath. In 1875, a protest was held at the Mechanics Institute, which resulted in councillors, mayors, solicitors and ramblers forming the Darlington Footpaths Preservation Society. This resulted in a protracted court battle, which went all the way to the Queen's Bench in London, between Edwin Pease and the Society over the legality of his actions. The court ruled in favour of Pease, who used the monetary award to extend Mowden Hall to the present-day mansion. The Pease family owned the property until the 1920s. Edwin's son William Edwin Pease never married and Mowden Hall was inherited by a cousin Ernest Pease, who sold it in 1927 and moved south to the Isle of Wight due to ill health."]}, {"page": "Darlington (UK Parliament constituency)", "response": ["| William Edwin Pease"]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|William Edwin Pease", "|William Edwin Pease"]}, {"page": "Pease family", "response": ["***William Edwin Pease (3 June 1865 – 23 January 1926) - MP for Darlington and chairman of Cleveland Bridge and Engineering Company"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|William Edwin Pease"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*William Edwin Pease"]}, {"page": "William E. Pease", "response": ["#REDIRECT William Edwin Pease"]}]}}