{"wiki_id": "http://www.wikidata.org/entity/Q8007343", "itemLabel": "William Cubitt", "itemDescription": "British civil engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cubitt", "wikipedia_page": {"main": "Sir William Cubitt FRS (bapt. 9 October 1785 – 13 October 1861) was an eminent English civil engineer and millwright. Born in Norfolk, England, he was employed in many of the great engineering undertakings of his time. He invented a type of windmill sail and the prison treadwheel, and was employed as chief engineer, at Ransomes of Ipswich, before moving to London. He worked on canals, docks, and railways, including the South Eastern Railway and the Great Northern Railway. He was the chief engineer of Crystal Palace erected at Hyde Park in 1851.\nHe was president of the Institution of Civil Engineers between 1850 and 1851.", "link_mentions": [{"page": "Peterborough", "response": ["The River Nene, made navigable from the port at Wisbech to Northampton by 1761,Under the Nene Navigation Acts 1714 (12 Anne c.7), 1725 (11 Geo. I c.19), 1756 (29 Geo. II c.69) and 1794 (34 Geo. III c.85). passes through the city centre. The Nene Viaduct carries the railway over the river. It was built in 1847 by Sir William and Joseph Cubitt.Gordon Bibble, Britanic's History Railway Buildings. An Oxford Gazetteer of Structures and Sites, (p.195), Oxford University Press, Oxford, 2003  William Cubitt was the chief engineer of Crystal Palace erected at Hyde Park in 1851. Apart from some minor repairs in 1910 and 1914 (the steel bands and cross braces around the fluted legs) the bridge remains as Cubitts built it. Now a Grade II* listed structure, it is the oldest surviving cast iron railway bridge in the UK.Labrum, Edward A. Civil Engineering Heritage: Eastern and Central England  (pp.78–79) Thomas Telford, London, 1994. See also Cossey, F. \"Cast Iron Railway Bridge at Peterborough\" in Hudson, Kenneth (ed.) Industrial Archaeology vol. 4 (pp.138–147) David & Charles, Newton Abbot, 1967. By the Town Bridge, the Customs House, built in the early eighteenth century, is a visible reminder of the city's past function as an inland port.Brandon, David and Knight, John Peterborough Past: The City and The Soke (p.54) Phillimore & Co., Chichester, 2001. The Environment Agency navigation starts at the junction with the Northampton arm of the Grand Union Canal and extends for 91 miles (147 km) ending at Bevis Hall just upstream of Wisbech. The tidal limit used to be Woodston Wharf until the Dog-in-a-Doublet lock was built five miles (8 km) downstream in 1937.Navigations in the Anglian Region  Public Relations Department, National Rivers Authority, Anglian Region (NRA Anglian 88) 1994."]}, {"page": "Windmill", "response": ["In all cases, the mill needs to be stopped to adjust the sails. Inventions in Great Britain in the late eighteenth and nineteenth centuries led to sails that automatically adjust to the wind speed without the need for the miller to intervene, culminating in patent sails invented by William Cubitt in 1807. In these sails, the cloth is replaced by a mechanism of connected shutters."]}, {"page": "The Crystal Palace", "response": ["The commission in charge of mounting the Great Exhibition was established in January 1850, and it was decided at the outset that the entire project would be funded by public subscription. An executive Building Committee was quickly formed to oversee the design and construction of the exhibition building, comprising accomplished engineers Isambard Kingdom Brunel and Robert Stephenson, renowned architects Charles Barry and Thomas Leverton Donaldson, the Duke of Buccleuch and the Earl of Ellesmere, and chaired by William Cubitt. By 15 March 1850 they were ready to invite submissions, which had to conform to several key specifications: the building had to be temporary, simple, as cheap as possible, and economical to build within the short time remaining before the Exhibition opening, which had already been scheduled for 1 May 1851.Kate Colquhoun, A Thing in Disguise: The Visionary Life of Joseph Paxton (HarperCollins, 2004), Ch. 16", "Paxton was acclaimed worldwide for his achievement, and was knighted by Queen Victoria in recognition of his work. The project was engineered by Sir William Cubitt; Paxton's construction partner was the ironwork contractor Sir Charles Fox's Fox and Henderson, whose director Charles Fox was also knighted for his contribution. The 900,000 square feet (84,000 m2) of glass was provided by the Chance Brothers glassworks in Smethwick. This was the only glassworks capable of fulfilling such a large order; it had to bring in labour from France to fulfil the order in time. The final dimensions were  long by  wide. The building was  high, with  on the ground floor alone.Hunt, Lynn, Thomas R. Martin, and Barbara H. Rosenwein, The Making of the West: Peoples and Cultures. Boston/New York: Bedford/St. Martin's, 2009. P 685."]}, {"page": "London King's Cross railway station", "response": ["Plans for the station were made in December 1848 under the direction of George Turnbull, resident engineer for constructing the first  of the Great Northern Railway out of London.Diaries of George Turnbull (Chief Engineer, East Indian Railway Company) held at the Centre of South Asian Studies at Cambridge University, England.Page 87 of George Turnbull, C.E. 437-page memoirs published privately 1893, scanned copy held in the British Library, London on compact disk since 2007. The station's detailed design was by Lewis Cubitt, the brother of Thomas Cubitt (the architect of Bloomsbury, Belgravia and Osborne House), and Sir William Cubitt (who was chief engineer of the Crystal Palace built in 1851, and consulting engineer to the Great Northern and South Eastern Railways). The design comprised two great arched train sheds, with a brick structure at the south end designed to reflect the arches behind. Its main feature was a  high clock tower that held treble, tenor and bass bells, the last of these weighing 1 ton 9 cwt (1.47 tonnes). In size, it was inspired by the  long Moscow Riding Academy of 1825, leading to its built length of ."]}, {"page": "Joseph Paxton", "response": ["Its novelty was its revolutionary modular, prefabricated design, and use of glass. Glazing was carried out from special trolleys, and was fast: one man managed to fix 108 panes in a single day. The Palace was  long,  wide and  high. It required 4,500 tons of iron,  of timber and needed over 293,000 panes of glass. Yet it took 2,000 men just eight months to build, and cost just £79,800. Quite unlike any other building, it was itself a demonstration of British technology in iron and glass. In its construction, Paxton was assisted by Charles Fox, also of Derby for the iron framework, and William Cubitt, Chairman of the Building Committee. All three were knighted. After the exhibition they were employed by the Crystal Palace Company to move it to Sydenham where it remained until it was destroyed by fire in 1936."]}, {"page": "North Walsham & Dilham Canal", "response": ["The canal served six mills, located along its banks, including the two bone mills at Antingham. There has been a mill at Bacton Wood since the time of the Domesday Book in 1086, and much of the present building dates from 1747. It was the home of Sir William Cubitt, who invented the self-regulating windmill sail and the prison treadmill. Since the millpond at Ebridge has been cleared and rewatered by volunteers, there has been a significant increase in the types of wildlife observed at the location. The area through which the canal flows is at risk of flooding, and this is mitigated by the actions of the Broads Internal Drainage Board, who manage drains and ditches in the upper regions, and have two pumping stations which pump water into the canal at its lower end.", "There has been a mill at Bacton Wood since the Domesday Book was produced in 1086. The present building was reconstructed in 1747, and extensively modified in 1825, in anticipation of the canal opening, and the increase in trade that that might bring. It was made of white rendered brick, with a roof of slates, although the adjoining mill house had a pantiled roof, but was subsequently reroofed in slate. The cast iron waterwheel was  in diameter and  wide, providing enough power to turn three sets of stones. The water supply was not always adequate in the summer, and a Dodman steam plant was installed in the late nineteenth century. Its boiler exploded around 1910, and an  hot bulb engine manufactured by Richard Hornsby & Sons replaced it. The mill was last used commercially in 1944, by which time it was powered by a diesel engine. It was sold for conversion to a house in 1967. The Hornsby engine was sold to enthusiasts when the mill was restored in 1984, and the mill was bought by Laurence Ashton in 1994, who is hoping to run it using water power once his Old Canal Company has rewatered the canal. There are four sets of stones on the milling floor. Sir William Cubitt, who invented the self-regulating windmill sail in 1807 and the prison treadmill in 1818, lived in the mill house during his childhood."]}, {"page": "Haddiscoe Cut", "response": ["Prior to the 1820s, Norwich was served by vessels using the River Yare, which flows through Breydon Water before joining the River Bure and then the North Sea near Great Yarmouth. Breydon Water is a wide expanse of shallow water, and therefore required cargo arriving at Yarmouth to be trans-shipped into smaller vessels which could then reach Norwich. There was discontent among the merchants of Norwich at the cost of trans-shipment, and allegations of systematic theft of cargo, which resulted in a court case in 1820, when 18 men were convicted of taking the goods and another of receiving it. Against this background, William Cubitt was asked to investigate possible solutions in 1814."]}, {"page": "River Yare", "response": ["The size of vessels that could reach Norwich was limited by the shallow channel crossing Breydon Water, and so all goods arriving from the North Sea had to be trans-shipped to smaller vessels at Yarmouth. In order to improve the situation the merchants of Norwich asked William Cubitt to look for a solution in 1814. His proposal consisted of dredging a new channel to the south side of Breydon Water and making various improvements to the river. This was costed at £35,000, but the plan was opposed by Yarmouth Corporation when it was made public in 1818. John Rennie, acting for the Corporation, concluded that the plan might result in silting of the harbour, and so Cubitt proposed an alternative, which would link the Yare to Lowestoft. This was also opposed by Yarmouth Corporation, but despite the cost begin more than double, and assurances from Thomas Telford and James Walker that improved navigation to Norwich would not harm Yarmouth, this was the plan that was laid before Parliament in 1826."]}, {"page": "River Gipping", "response": ["During 1791, when the Trustees were negotiating with John Rennie, they had asked him to assess an extension of the navigation from Stowmarket to the River Lark at Bury St Edmunds, but this was not pursued. With the navigation thriving, there were two proposals for canals from Ipswich to Eye, Suffolk in 1819. A meeting was held in January at Eye, which was chaired by Charles Cornwallis, 2nd Marquess Cornwallis. It considered two reports, one proposed by the civil engineer William Cubitt, which involved a tunnel through the hills at Mendlesham, with the estimated cost exceeding £100,000, and another, for a canal over the hills, costing £80,000. Both were thought to be too expensive to implement, but a third proposal emerged, for an extension from the River Gipping at Needham Market, which would follow the valley of a tributary through Creeting St Mary to Earl Stonham, where a basin would be built beside the turnpike road (now the A140 road). This would enable waggons to make a round trip from Eye in a single day, rather than the two days that a trip to Ipswich took. The scheme was estimated to cost £12,000, and shares in it were offered at the meeting. Although many were taken up, the scheme did not advance any further."]}, {"page": "River Ouse, Sussex", "response": ["From 1783, John Ellman, better known for his agricultural achievements, became the Expenditor for the Lewes and Laughton Levels, and as well as carrying out the tradition role of collecting the water scot tax and spending it, he worked tirelessly to organise and supervise work on the Glynde Reach and the lower Ouse, which enabled a 120-ton ship named Kitty to unload stone at Lewes Bridge in the late 1820s. He retired in 1828, and the following year the river flooded, but the results of the improvements were seen when the meadows drained in just 48 hours. Tapsfield's Shallow, near to Lewes Bridge, was finally removed by the engineer William Cubitt in 1838. Work on the west breakwater, a huge construction to protect the mouth of the river and enable ships to access the port of Newhaven at all states of the tide, began after a tramway link was constructed in 1866. It was completed in 1889, and the tramway was subsequently used to maintain the breakwater, until the tracks were lifted in 1963. For many years the locomotive used on the tramway was No. 72 Fenchurch, now preserved on the Bluebell Railway, which runs from  on the upper river to ."]}, {"page": "Mersey Ferry", "response": ["In 1847, the first floating landing stage, which rose and fell with the tide so that boats could dock at any time, was opened at Liverpool. The first portion, known as the Georges' landing stage, was designed by William Cubitt and was 500 feet long. It was rebuilt and extended in 1874."]}, {"page": "London Necropolis Company", "response": ["Broun's scheme had envisaged the cemetery running along both sides of the LSWR main line and divided by religion, with separate private railway halts on the main line, each incorporating a chapel, to serve each religion's section. The new consulting engineer to the company, William Cubitt, rejected this idea and recommended a single site to the south of the railway line, served by a private branch line through the cemetery. The company also considered Broun's plan for dedicated coffin trains unrealistic, arguing that relatives would not want the coffins to be shipped separately from the deceased's family.", "In September 1853 a Committee of Enquiry into the mismanagement of the company recommended the expulsion of the four remaining trustees and the reform of the company under a new board of directors. This was unanimously approved by the shareholders, and work finally began on the scheme. A  tract of land stretching from Woking to Brookwood was purchased from Lord Onslow. The westernmost , at the Brookwood end, were designated the initial cemetery site, and a branch railway line was built from the LSWR main line into this section. A plot of land between Westminster Bridge Road and York Street (now Leake Street) was chosen as the site for the London railway terminus. Architect William Tite and engineer William Cubitt drew up a design for a station, which was approved in June 1854, and completed in October 1854. In July 1854 work began on the drainage of the marshlands designated as the initial cemetery site, and on the construction of the embankment carrying the railway branch into the cemetery.", "As the Brookwood site had been intentionally chosen for its distance from London, at the time of its opening the only practical way to reach the cemetery was by railway. William Cubitt decided the terrain of the initial cemetery site was best suited to a railway branch from the LSWR at the west of the cemetery, and work began on the earthworks and rails for the new branch in early September 1854. The single-track branch was completed in time for the opening two months later. The junction with the LSWR, known as Necropolis Junction, was west-facing, meaning that trains to and from London were obliged to reverse in and out of the branch to the two stations in the cemetery. The poor quality gravel soil, which had been the initial reason for the site's cheapness and its selection as the site for the cemetery, was poorly suited as a railway trackbed. The rails, and in particular the sleepers, deteriorated rapidly and needed constantly to be replaced.", "A site for the London terminus near Waterloo had been suggested by Richard Broun. Its proximity to the Thames meant that bodies could be cheaply transported to the terminus by water from much of London, while being situated near three major Thames bridges the area was easily accessed from both north and south of the river. The arches of the huge brick viaduct carrying the LSWR into Waterloo Bridge station (now London Waterloo station) were easily converted into mortuaries. Broun also felt that the journey out of London from Waterloo Bridge would be less distressing for mourners; while most of the rail routes out of London ran through tunnels and deep cuttings or through densely populated areas, at this time the urban development of what is now south London had not taken place and the LSWR route ran almost entirely through parkland and countryside. In March 1854 the LNC purchased a plot of land between Westminster Bridge Road and York Street (now Leake Street). Architect William Tite and engineer William Cubitt drew up a design for a station, which was approved in June 1854 and completed in October of that year.", "The two stations in the cemetery were very similar in design. North station served the Nonconformist section of the cemetery, and South station served the Anglican section. On William Cubitt's advice the two stations in the cemetery were built as temporary structures, in the expectation that they would need to be rebuilt once the railway was operational and the issues with operating a railway of this unique nature became clearer. Other than brick platform faces, chimneys and foundations, the stations were built entirely of wood. Each station held first class and ordinary reception rooms for mourners, a first class and an ordinary refreshment room, and a set of apartments for LNC staff. To provide an attractive first view of the cemetery for visitors arriving at the stations, the areas around the stations and their associated chapels were planted with groves of bay, Cedar of Lebanon, rhododendron and Portuguese laurel."]}, {"page": "River Rother, East Sussex", "response": ["The Rother Levels Acts were two Acts of Parliament which were obtained in 1826 and 1830. The Commissioners of the Rother Levels were obliged by the acts to ensure that navigation between Scots Float and Bodiam Bridge was possible, and that all bridges provided at least  of headroom. They also enshrined the principle that it was a free river, and no tolls were to be collected for its use. The Rennie brothers, John and George, who had taken over from their father on his death in 1821, produced two reports on the river in 1830, as it was difficult to navigate and prone to flooding. They were critical of the way in which tidal water was allowed to enter the river through Scots Float Sluice, and thought that the river channel was too circuitous, which resulted in shoals forming. The Rennie brothers also criticised the angles at which bridges crossed the channel. William Cubitt and James Elliott rebuilt Scots Float Sluice in 1844."]}, {"page": "Stockton and Darlington Railway", "response": ["By this time Port Darlington had become overwhelmed by the volume of imports and exports and work started in 1839 on Middlesbrough Dock, which had been laid out by William Cubitt, capable of holding 150 ships, and built by resident civil engineer George Turnbull. The suspension bridge across the Tees was replaced by a cast iron bridge on masonry piers in 1841. After three years and an expenditure of £122,000 (equivalent to £9.65m at 2011 prices), the formal opening of the new dock took place on 12 May 1842. The S&DR provided most of the finance, and the dock was absorbed by the company in 1849."]}, {"page": "Middlesbrough", "response": ["The success of the port meant it soon became overwhelmed by the volume of imports and exports, and in 1839 work started on Middlesbrough Dock. Laid out by Sir William Cubitt, the whole infrastructure was built by resident civil engineer George Turnbull. After three years and an expenditure of £122,000 (equivalent to £9.65 million at 2011 prices), first water was let in on 19 March 1842, and the formal opening took place on 12 May 1842. On completion, the docks were bought by the S&DR."]}, {"page": "Belvide Reservoir", "response": ["Owned by the Canal & River Trust, the reservoir was constructed around 1833 to feed the Birmingham and Liverpool Junction Canal, which became part of the Shropshire Union Canal in 1846. Work began on it in 1832, and the canal opened in early 1835. Traffic levels were high, and the company had to buy 2,000 lockfulls of water in the first year, for which they paid £800 to the Wyrley and Essington Canal. In 1836, there was still pressure on the water supply, and the engineer William Cubitt was instructed to enlarge the reservoir in May. In order to finance the improvements, the Commissioners agreed that they would not be paid until £20,000 had been spent on the improvements. The enlarged reservoir was completed in 1842. The valve gear which controls the flow of water from the reservoir to the canal is believed to be original. It is housed in a circular gear house which stands in front of a concave brick retaining wall. Both were designed by Thomas Telford, and are Grade II* listed structures. The structure has a cast iron dome, and is a rare example of an original valve house. The reservoir covers an area of  when water levels are at their highest, but levels fluctuate as water is used for the canal, and the surface area is around half of this figure when the water level is  lower. The reservoir is fed by a tributary of the River Penk."]}, {"page": "Peter W. Barlow", "response": ["From 1836, Peter Barlow was the resident civil engineer under Sir William Cubitt on parts of the South Eastern Railway, London to Dover line, before taking responsibility for the whole line in 1840, and later becoming Engineer-in-Chief. He was elected a Fellow of the Royal Society in November 1845 as someone who was \"Distinguished for his acquaintance with the science of Mathematics as applied to Engineering Subjects\". From the 1850s to the 1870s, Barlow was engineer-in-chief to the Newtown and Oswestry, Londonderry and Enniskillen and Londonderry and Coleraine railways; in the mid-1860s he was also consultant engineer to the Finn Valley Railway."]}, {"page": "1807 in science", "response": ["* William Cubitt patents self-regulating sails for windmills."]}, {"page": "Institution of Civil Engineers", "response": ["After Telford's death in 1834, the organisation moved into premises in Great George Street in the heart of Westminster in 1839, and began to publish learned papers on engineering topics. Its members, notably William Cubitt, were also prominent in the organisation of the Great Exhibition of 1851."]}, {"page": "Robert Stevenson (civil engineer)", "response": ["Engineering skills were in high demand after the Battle of Waterloo, which marked the end of the continental wars, because the focus turned toward improving the country’s infrastructure. So Stevenson was kept busy. In addition to his work for the Northern Lighthouse Board, he served as a consulting engineer on many projects, collaborating with other engineers such as John Rennie, Alexander Nimmo, Thomas Telford, William Walker, Archibald Elliot, and William Cubitt. These projects included the construction of roads, bridges, harbours, canals, railways, and aids to river navigation. He designed and oversaw the construction in Glasgow of the Hutcheson Bridge, and in Edinburgh of the Regent Bridge and approaches to it from the east. He also produced a number of designs for canals and railways which were not built, and new and improved designs for bridges, some of which were later implemented by his successors. He invented the movable jib and the balance crane as necessary aids to lighthouse construction, and, as George Stephenson noted, he led the trend toward using malleable rather than cast-iron rails in the construction of railways.Letter from George Stephenson 28 June 1821 quoted in "]}, {"page": "Edwin Chadwick", "response": ["He employed John Roe, the surveyor for the district of Holborn and Finsbury who had invented the egg-shaped sewer, to conduct experiments on the most efficient ways to construct drains, the results of which were incorporated into the report, and the summary included eight points, including the absolute necessity of better water supplies and of a drainage system to remove waste, as ways to diminish premature mortality. Evidence given by Dr Dyce Guthrie convinced Chadwick that every house should have a permanent water supply, rather than the intermittent supplies from standpipes that were often provided. The report caught the public imagination, and the government had to set up a Royal Commission on the Health of Towns to consider the issues and recommend legislation. Its chairman was the Duke of Baccleuch, and there were thirteen members, including the engineers Robert Stephenson and William Cubitt. Chadwick acted as secretary in an unofficial capacity, and seems to have dominated the proceedings."]}, {"page": "Limehouse Cut", "response": ["At the northern end of the Cut was a conflict with a property called Four Mills: in fact, a group of five tidal water wheels.The Four Mills were about half a mile downstream the still-surviving Three Mills: }  Nathaniel Beardmore, the Lee trustees' engineer, described the conflict as it was in early Victorian times: At an 1850 inquiry by William Cubitt it was explained that because the Cut was unnavigable for four or five days at neap tides, barges had no way out to the Thames except via Bow Creek (which was toll free).  Hence the tolls were lost."]}, {"page": "1861 in architecture", "response": ["* October 13 – Sir William Cubitt, English civil engineer (born 1785)"]}, {"page": "Treadmill", "response": ["Treadmills for punishment were introduced in 1818 by an English engineer named Sir William Cubitt, who was the son of a miller. Noting idle prisoners at Bury St Edmunds gaol, he proposed using their muscle power to both cure their idleness and produce useful work."]}, {"page": "Clare, Suffolk", "response": ["Crossing the Stour en route to Ashen is a three span cast iron bridge, built when Clare was on a main highway between London and Bury St Edmunds.  It was Sir William Cubitt's second design for a bridge.  The date of completion 1813 can be seen above the central arch.Ken Rickwood op. cit. The iron was almost certainly cast at Ransomes of Ipswich, a foundry mostly known for agricultural machinery for whom Cubitt worked.  Later they supplied the new railways across East Anglia. In good condition, the bridge is Suffolk's oldest iron bridge still in use."]}, {"page": "Atmospheric railway", "response": ["As this was the first commercially operating atmospheric railway, it attracted the attention of many eminent engineers of the day, including Isambard Kingdom Brunel, Robert Stephenson, and Sir William Cubitt.Industrial Heritage of Ireland website (archived)", "When the lines opened in 1839, it was found that congestion arose due to the frequent stopping services on the local Croydon line; this was particularly a problem on the 1 in 100 ascent from New Cross to Dartmouth Arms. The L&CR engineer, William Cubitt proposed a solution to the problem: a third track would be laid on the east side of the existing double track main line, and all the local trains in both directions would use it. The faster Brighton trains would be freed of the delay following a stopping train. Cubitt had been impressed during his visit to the Dalkey line, and the new L&CR third track would use atmospheric power. The local line would also be extended to Epsom, also as a single track atmospheric line. These arrangements were adopted and Parliamentary powers obtained on 4 July 1843, also authorising a line to a terminal at Bricklayers Arms. Arrangements were also made with the L&GR for them to add an extra track on the common section of their route. On 1 May 1844, the Bricklayers Arms terminus opened, and a frequent service was run from it, additional to the London Bridge trains.Charles Howard Turner, The London Brighton and South Coast Railway, volume 1, Batsford Books, London, 1977, , pages 239–256"]}, {"page": "Tyntesfield", "response": ["Rebuilding work did not begin in earnest until 1863, when William Gibbs had the property substantially remodelled in a Gothic Revival style. William Cubitt & Co. were the builders and John Norton was the architect. Norton's design enveloped the original house. He added an extra floor, two new wings and towers. Norton emphasised the importance of architectural continuity in restoration and rebuilding relating to several historical periods. As a result, while some walls remained plain, others were adorned with Gothic and naturalistic carvings to fit in with the previous architectural styles."]}, {"page": "Grand Junction Canal", "response": ["There were also ambitious proposals for new canals. In 1827 there was a proposal for a London and Birmingham Junction Canal from the Stratford-upon-Avon Canal to Braunston. In 1832, William Cubitt proposed a Central Union Canal from the Worcester and Birmingham Canal near Worcester Bar via Solihull to the Oxford at Ansty, while in 1833 there were proposals for a London and Birmingham Canal, from Stratford direct to the Regent's Canal, which would bypass the Grand Junction Canal entirely. This, together with the railway threats, spurred the Grand Junction into making improvements."]}, {"page": "Montgomery Canal", "response": ["The prospect of railway competition arrived in the 1840s and in 1845 the company was approached by the proposed Shrewsbury to Newtown Railway to work out a deal. The company responded by setting up a subcommittee in January 1845 to consider how best to protect themselves from such competition. Meanwhile, the London and Birmingham Railway were negotiating with the Ellesmere and Chester Canal who were planning to convert some of their canals into railways. They asked William Cubitt to investigate whether their own canal could also be converted but that plan was dropped soon afterwards as the Ellesmere and Chester offered to buy the canal for £110 per share and the offer was accepted. The Ellesmere and Chester Canal obtained an Act of Parliament to enable them to become the Shropshire Union Railways and Canal Company and to take over several canals including both the Eastern and Western Branches of the Montgomeryshire Canal. The Eastern Branch was formally transferred to become part of the Shropshire Union on 1 January 1847 with the company receiving £78,210 of which £7,920 was in shares in the new company and the rest was in cash. The Western Branch remained under Pugh's control for three more years but was bought for £42,000 on 5 February 1850 although some £7,000 of this cannot be traced from the accounts."]}, {"page": "South Eastern Railway (England)", "response": ["The engineer of the new line, William Cubitt, was also engineer of the London and Croydon Railway (L&CR), which planned to use L&GR lines as far as Corbett's Lane in Bermondsey before turning south towards Croydon. A new connection on this line near to Norwood could provide access to a southerly route to Dover via Tonbridge, Ashford and Folkestone. This was less direct than the northerly route but passed through easier country. It involved one significant  tunnel through the Shakespeare Cliff near Dover. This was the route first chosen by the SER at its inauguration."]}, {"page": "Great North of Scotland Railway", "response": ["In the aftermath of the railway mania railway companies became an unpopular investment and the necessary finance could not be raised. The company suggested at a meeting in November 1849 that whereas £650,000 was needed for a double-track railway from Aberdeen to Inverness, only £375,000 would be needed for a single-track railway from Kittybrewster,  from Aberdeen, to Keith, half way to Inverness. The meeting recommended that the bridges and works be built wide enough for a second track when this was needed. Construction eventually began in November 1852, albeit to Huntly,  short of Keith, with William Cubitt as engineer. The severe winter the following year delayed work. Between Inverurie and Aberdeen the line took over the Aberdeenshire Canal, the purchase of which delayed construction as it was necessary to settle the claims of each shareholder individually."]}, {"page": "London and Croydon Railway", "response": ["The consultant engineer was William Cubitt. The line proved to be expensive to build, costing £615,000 rather than the estimated £180,000, due to large cuttings at New Cross and Forest Hill.Dendy Marshall (1963) p.38. The only severe gradient was 1:100 (1%) for  from New Cross to Forest Hill. In addition to the viaduct where it joined the L&GR, there were 18 bridges, and three level road crossings, each attended by a \"policeman\"."]}, {"page": "London Necropolis railway station", "response": ["Architect William Tite and engineer William Cubitt drew up a design for a station, which was approved in June 1854. The station was completed in October 1854, at a total construction cost of £23,231 14s 4d (about £ in terms of  spending power). On 13 November 1854 the first train left London for the new London Necropolis."]}, {"page": "Royal Commission for the Exhibition of 1851", "response": ["The Royal Commission for the Exhibition of 1851 is an institution founded in 1850 to administer the international exhibition of 1851, officially called the Great Exhibition of the Works of Industry of all Nations. The Great Exhibition was held in The Crystal Palace in Hyde Park London, England. The enormous building was designed by Joseph Paxton for the Exhibition and construction was supervised by William Cubitt using a cast iron space frame for the glass panes, with wooden beams for flooring."]}, {"page": "1861 in rail transport", "response": ["* October 13 – Sir William Cubitt, civil engineer on the South Eastern and Great Northern Railways of England (d. 1861)."]}, {"page": "Thomas Brassey", "response": ["A contract for the Great Northern Railway was agreed in 1847, with William Cubitt as engineer-in-chief, although much of the work was done by William's son Joseph, who was the resident engineer. Brassey was the sole contractor for the line of . A particular problem was met in the marshy country of The Fens in providing a firm foundation for the railway and associated structures. Brassey was assisted in solving the problem by one of his agents, Stephen Ballard. Rafts or platforms were made of layers of faggot-wood and peat sods. As these sank, they dispersed the water and so a firm foundation was made.,  This line is still in use and forms part of the East Coast Main Line.  Also in 1847 Brassey began to build the North Staffordshire Railway.  By this time the \"railway mania\" was coming to an end and contracts in Britain were becoming increasingly more difficult to find. By the end of the \"railway mania\", Brassey had built one-third of all the railways in Britain."]}, {"page": "Ransomes, Sims & Jefferies", "response": ["In 1809 Robert Ransome, now aged 56, was looking for someone younger to take the business forwards. His eldest son James returned from Great Yarmouth to become his father's partner, bringing with him several of his skilled craftsmen. Now called Ransome and Son, the business prospered, with output doubling over the next six years. Another period of social unrest followed, with agricultural depression and the introduction of the Corn Laws in 1815. Robert had employed William Cubitt in 1812 as the company engineer, and they diversified so they were not solely dependent on the sale of agricultural products. They cast the components for Stoke Bridge, Ipswich, which was swept away in a flood in 1818. Cubitt was responsible for the new design, and the bridge lasted for over 100 years. Cubitt's designs for wind-regulating vanes for windmills and a treadmill for grinding corn in prisons were also manufactured, and he then supervised the installation of gas lighting in Ipswich, which included the construction of a gasometer near to the foundry. Cubbitt became a partner in the firm in 1821, but continued to carry out consultancy work in his own right. He was in such demand that he moved on in 1826, to pursue his civil engineering career, for which he was later knighted."]}, {"page": "South Eastern Main Line", "response": ["Leaving the Brighton line, a beeline was made for Folkestone, plans to serve Maidstone having been abandoned. A branch line was to be built from Maidstone Road instead. The line was almost direct between the two points, not varying by more than  in either direction between Redhill and Ashford. The engineer was Sir William Cubitt. To facilitate fast running, , Maidstone Road and Ashford stations were built with through roads.  station was to be rebuilt on a similar plan in 1924. Construction began in November 1837 from Reigate Junction eastwards, and in both directions from Tunbridge. The line from London Bridge to Tunbridge opened on 26 May 1842. The line between Tonbridge and Ashford opened on 1 December 1842."]}, {"page": "Drilling and blasting", "response": ["An early major use of blasting to remove rock occurred in 1843 when the British civil engineer William Cubitt used 18,000 lbs of gunpowder to remove a 400-foot-high chalk cliff near Dover as part of the construction of the South Eastern Railway. About 400,000 cubic yards of chalk was displaced in an exercise that it was estimated saved the company six months time and £7,000 in expense."]}, {"page": "Thornaby railway station", "response": ["The station lies on the original Stockton & Darlington Railway (S&DR) extension to Port Darlington, developed from 1828 under the instructions of influential Quaker banker, coal mine owner and S&DR shareholder Joseph Pease, who had sailed up the River Tees to find a suitable new site down river of Stockton on which to place new coal staithes. As a result, in 1829 he and a group of Quaker businessmen bought  of land described as \"a dismal swamp\", and established the Middlesbrough Estate Company. Through the company, the investors intended to develop both a new port, and a suitable town to supply its labour. On 27 December 1830, the S&DR opened an extension across the river to a station at Newport, almost directly north of the current Middlesbrough station. The S&DR quickly later renamed this new station and associated six-coal staithe dock facility as Port Darlington, hoping to market the facility further. So successful was the port, a year after opening the population of Port Darlington had reached 2,350. However, with Port Darlington overwhelmed by the volume of imports and exports, in 1839 work started on Middlesbrough Dock. Laid out by Sir William Cubitt, the whole infrastructure was built by resident civil engineer George Turnbull. After three years and an expenditure of £122,000 (equivalent to £9.65 million at 2011 prices), the formal opening occurred on 12 May 1842. On completion, the docks were bought by the S&DR."]}, {"page": "James Meadows Rendel (engineer)", "response": ["Rendel was much occupied in the improvement of rivers. In 1852, in conjunction with Sir William Cubitt and Richard John Griffith, he examined and reported to the treasury upon the arterial drainage works in Ireland, and in 1855 he completed the suspension bridge across the Ness at Inverness for the Commissioners of Highland Roads and Bridges. His aid was also sought by foreign countries. In 1852–53 he designed docks for Genoa; in 1853–55 he reported on the harbour of Rio de Janeiro; in 1854 he reported to the Prussian government on a naval establishment at Heppens on the river Jade; and in 1854–55, by direction of the Hamburg senate, he inspected the Elbe from Hamburg to Cuxhaven. For the Spanish, he devised a system of railways between Madrid and Oviedo, as well as improvements of the river Ebro."]}, {"page": "Camden Lock", "response": ["Camden Goods Depot was the London freight terminus of the London and Birmingham Railway, the first inter-city railway to reach London. Robert Stephenson was the engineer in charge of the project, and he picked the site for the goods depot so that direct interchange with the Regent's Canal was available, from where freight could reach the London docks. A  site on the north bank of the canal was obtained from Lord Southampton in January 1837, and the goods depot was completed in 1839. Major features were a stationary winding engine house, which was used to pull trains up the incline from  to Camden, a shed for stabling of locomotives, 18 coke ovens which were used to make smokeless fuel, two goods sheds, stables for 50 horses, a wagon repair shop, and various ancillary buildings. Much of the site was supported on brick vaults. Pickfords, the public carrier, built a warehouse on the south bank of the canal in 1841. It was designed by William Cubitt, was extended in 1846, and was the first rail, road and canal interchange building in Britain, being linked to the goods depot by a wooden railway bridge over the canal."]}, {"page": "Rothwell, Hick and Rothwell", "response": ["In 1832, Benjamin Hick left to set up his own business, B. Hick and Sons, to be replaced by Benjamin Cubitt, (younger brother of William Cubitt) from Fenton, Murray and Jackson. The firm then became Rothwell and Company. A further order for America was fulfilled in 1833, then for a couple of years the firm was occupied with pumps and stationary engines."]}, {"page": "Folkestone Harbour railway station", "response": ["Construction began in 1843, with the line intended mainly for freight. The route left the main line at Folkestone Junction and was double tracked, running at a gradient of 1 in 32. It reached the harbour on a  viaduct designed by SER chief engineer William Cubitt. A swing bridge was added to the viaduct in 1847, which allowed trains to cross the harbour and reach the southern pier."]}, {"page": "Digswell Viaduct", "response": ["The viaduct is around  long and comprises forty arches of  span, and it is  high from ground level to trackbed.The Railway Viaduct. Digswell. Hertfordshire Genealogy. It is built of red brick fired from clay quarried on site during construction, and took two years to build, including the construction of embankments at both ends which required the movement of around one million tons of earth by human and horse power. It was designed by William Cubitt and styled after a Roman aqueduct."]}]}}