{"wiki_id": "http://www.wikidata.org/entity/Q8005532", "itemLabel": "William Bidlake", "itemDescription": "English Architect", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Bidlake", "wikipedia_page": {"main": "William Henry Bidlake MA, FRIBA (12 May 1861 – 6 April 1938) was a British architect, a leading figure of the Arts and Crafts movement in Birmingham and Director of the School of Architecture at Birmingham School of Art from 1919 until 1924.\nSeveral of Bidlake's houses in the Birmingham area were featured in Hermann Muthesius's book Das englische Haus (\"The English House\"), which was to prove influential on the early Modern Movement in Germany.", "link_mentions": [{"page": "Wadhurst", "response": ["* William Bidlake, (1861–1938), architect, moved to Wadhurst in 1924 and practised there until his death."]}, {"page": "Wylde Green", "response": ["Wylde Green is served by Wylde Green library, a one-storey building that, until recently, was run by volunteers. It is located to the rear of The Lanes Shopping Centre which, along with the rest of the street, hosts the main shopping area for Wylde Green. Wylde Green Library has been cut, and Birmingham City Council blames lack of funding from the Central government.Four Birmingham libraries facing closure because of budget cuts Opposite the library is Emmanuel Parish Church, a Grade II* listed building, designed by William Bidlake. The organ was produced in 1932 by Willis Organs.Willis Organs: 1932 Willis III Organ for Emmanuel Parish Church, Wylde Green, Sutton Coldfield The church is home to one of the few remaining boys choirs and also has a well-established girls choir. Adjacent to the library is Wylde Green Primary School, opened in 1840. Another church in Wylde Green is the Wylde Green United Reformed Church, established in 1897.Wylde Green URC: 100th Anniversary booklet"]}, {"page": "Frederick Gibberd", "response": ["Gibberd was born in Coventry, the eldest of the five children of a local tailor, and was educated at the city's King Henry VIII School. In 1925 he was articled to a firm of architects in Birmingham and studied architecture under William Bidlake at the Birmingham School of Art, where his roommate was F. R. S. Yorke."]}, {"page": "Architecture of Birmingham", "response": ["Notable commercial buildings in Arts and Crafts styles included Lethaby's 122-124 Colmore Row of 1900 – a building of European importance in its break with revivalism – and Arthur Dixon's 1898 Birmingham Guild of Handicraft in Great Charles Street, whose \"virtually styleless\" design reflected his radical socialist views by using round arched windows in an explicit rejection of the Gothic Revival. The most important church architecture of the movement was that of William Bidlake, culminating in his St Agatha's, Sparkbrook of 1899, whose inventive but restrained design had a national influence, maintaining the close relationship between function and decoration that was important to the Gothic revival, while moving away from the straightforwardly historicist imitation of medieval precedent.", "The Arts and Crafts Movement marked a golden age of Birmingham architecture, placing the city at the forefront of English architecture at a time when English architecture was leading the world. Its influence was international: Lethaby was the most important architectural theorist of the whole movement, and built over half of his work in Birmingham or for Birmingham clients, while the buildings of Birmingham architects such as William Bidlake and William Alexander Harvey were to feature prominently in Herman Muthesius's 1905 book The English House, which was to be revolutionary in its introduction of the Arts and Crafts philosophy into Germany, and a pivotal influence on the later birth of the modern movement.", "File:Garth House, Edgbaston, Birmingham - William Bidlake.jpg|Garth House, Edgbaston, by William Henry Bidlake, 1901"]}, {"page": "Listed buildings in Birmingham", "response": ["|William Bidlake"]}, {"page": "List of tallest buildings and structures in the Birmingham Metropolitan Area, West Midlands", "response": ["| British Arts and Crafts movement (incl. British Queen Anne Revival) || c.1870 – c.1940 || style=\"background-color:#B9D9EB | Birmingham || St Agatha's Church || Place of worship || 170px || 37 || 120 || 1901 || Designed by the noted Birmingham architect, William Bidlake, St Agatha’s church is an expression of the Arts & Crafts approach to Gothic architecture at the end of the 19th century, combining red and blue brick with decorative stone features. It is a Grade I listed building. || "]}, {"page": "Hermann Muthesius", "response": ["In 1896 Muthesius was offered a position as cultural attaché at the German Embassy in London. Muthesius married Anna Trippenbach who was a fashion designer and singer. This gave him the opportunity to study the ways of the British. He focused the next six years investigating residential  architecture and domestic lifestyle and  design, ending with a three-volume report published in 1904 and 1905 as   (\"The English House\"), his most famous work.Woodham (1997), 18 Although his subjects were wide-ranging, he was particularly interested in the philosophy and practices of the English Arts and Crafts movement, whose emphasis on function, modesty, understatement, individuality and honesty to materials he saw as alternatives to the ostentatious historicism and obsession with ornament in German nineteenth century architecture, and whose efforts to bring a sense of craftsmanship to industrial design he saw as a significant national economic benefit. He visited Glasgow to investigate the innovative work of the Glasgow School exemplified by the designs of Charles Rennie Mackintosh, and wrote about houses in Birmingham by William Bidlake."]}, {"page": "Madresfield Court", "response": ["The chapel was decorated in the Arts and Crafts style by Birmingham Group artists including Henry Payne, William Bidlake and Charles March Gere. The decoration was a 1902 wedding present from Lady Lettice Grosvenor to her bridegroom the 7th Earl, although work on it continued until 1923. Murals on the chapel's walls incorporate images of the couple, as well as their seven children, in scenes rife with Christian symbolism. The critic Jonathan Meades, in the BBC TV series Travels with Pevsner, contrasted the \"inviting prose\" used by Waugh to describe the chapel at Brideshead with the \"prosaic list\" written by Nikolaus Pevsner to describe Madresfield's chapel."]}, {"page": "William Henry Bidlake", "response": ["#REDIRECTWilliam Bidlake"]}, {"page": "W. H. Bidlake", "response": ["#REDIRECTWilliam Bidlake"]}, {"page": "W.H. Bidlake", "response": ["#REDIRECT William Bidlake"]}, {"page": "Tettenhall College", "response": ["*William Bidlake - Arts & Crafts architect (1861-1938)"]}, {"page": "Henry Payne (artist)", "response": ["In common with most of the Birmingham Group he worked across a wide variety of media, producing book illustrations for the Birmingham Guild of Handicraft and interior decoration for the Bromsgrove Guild of Applied Arts. Although most prolific in stained glass, Payne's most notable achievements were arguably in the field of decorative painting. Between 1902 and 1923 he worked on the wall paintings of the chapel at Madresfield Court near Malvern in Worcestershire. Painted as fresco in tempera and sitting alongside work by other figures of the Birmingham Arts and Crafts movement such as William Bidlake, Georgie Gaskin and Charles March Gere, Madresfield Court is \"not only Payne's most important scheme of decorative painting, but probably the most famous of all such Arts and Crafts schemes.\""]}, {"page": "List of people from Wolverhampton", "response": ["* William Bidlake (1861–1938) – architect; a leading figure of the Arts and Crafts movement in Birmingham; Director of the School of Architecture at Birmingham School of Art"]}, {"page": "Robert van 't Hoff", "response": ["In 1906, on the advice of an architect friend of his father's, van 't Hoff travelled to England to study architecture at the Birmingham School of Art, which had been a major centre of the Arts and Crafts Movement since its reorganisation by Edward R. Taylor in the 1880s. Studying under William Bidlake, he came under the influence of the theories of William Lethaby and the work of the Glasgow School, and worked in the progressive architectural practice of Herbert Tudor Buckland."]}, {"page": "List of Birmingham City University people", "response": ["*William Bidlake"]}, {"page": "St Thomas' Church, Stourbridge", "response": ["The church dates from 1726. The chancel was added in 1890 by William Bidlake.", "Category:William Bidlake buildings"]}, {"page": "Emmanuel Church, Wylde Green", "response": ["The church was built between 1909 and 1926 to designs by the architect William Bidlake. The nave and aisles were complete before the First World War. Completion of the chancel was delayed until after the war, and was finished around 1926. ", "Category:William Bidlake buildings"]}, {"page": "St Mary's Church, Wythall", "response": ["The church was built in 1862 by Frederick Preedy. The landmark tower was added in 1908 by William Bidlake, the gift of the Misses Mynors in memory of their parents. The font was installed in the 1960s from Immanuel Church, Birmingham when this church was demolished.", "Category:William Bidlake buildings"]}, {"page": "Joseph Lancaster Ball", "response": ["In 1899 Ball collaborated with William Lethaby on 122–124 Colmore Row in central Birmingham, whose break with revivalism makes it a building of European importance. In 1904 he completed Winterbourne House in Edgbaston, his most important individual commission and one of the finest houses of its period in the Birmingham area, comparable to contemporary work by other notable Birmingham Arts and Crafts architects such as William Bidlake, Charles Bateman and Herbert Tudor Buckland."]}, {"page": "Bishop Latimer Memorial Church, Winson Green", "response": ["The funding for the church was anonymous. It was designed by the architect William Bidlake in the Gothic style and consecrated in 1904.", "Category:William Bidlake buildings"]}, {"page": "Mortuary Chapel, Handsworth Cemetery", "response": ["It was designed by the architect William Bidlake in the Arts and Crafts style. Work started in 1909 and it was consecrated in 1910.", "Category:William Bidlake buildings"]}, {"page": "St Andrew's Church, Handsworth", "response": ["The church originated as the mission church of the Good Shepherd. It opened in a temporary building in 1894 as a mission church of St. Mary's, Handsworth. The current building was designed by the architect William Bidlake in the Arts and Crafts style. Work started in 1907 and the building was completed in 1908. The church was dedicated in 1910 and it was consecrated in 1914 when a parish was assigned from St Mary's and St James'.", "Category:William Bidlake buildings"]}, {"page": "All Saints' Church, Gravelly Hill", "response": ["The church was built between 1900 and 1901 to designs by the architect V.S. Peel, as a chapel of ease to St Barnabas' Church, Erdington. It was enlarged in 1918 by William Bidlake."]}, {"page": "Emmanuel Church, Sparkbrook", "response": ["The foundation stone was laid on 24 September 1900.Birmingham Daily Post. Tuesday 25 September 1900. p.7. The Church Congress The church was designed by William Bidlake and opened in 1901, and was extended in 1927. It was a chapel of ease for Christ Church, Sparkbrook until 1928 when it acquired its own parish."]}, {"page": "St Oswald's Church, Small Heath", "response": ["The church was designed by the architect William Bidlake and built between 1892 and 1893. It was consecrated on 27 September 1893.", "Category:William Bidlake buildings"]}, {"page": "St Stephen the Martyr's Church, Newtown Row", "response": ["A major restoration was undertaken in 1896, and the church was rebuilt in 1910 by William Bidlake."]}, {"page": "St Chrysostom's Church, Hockley", "response": ["The church was built to the designs of the architect John Cotton of Temple Row, Birmingham, and opened on 10 April 1888. It comprised a nave with low aisles, double transepts, a baptistery and the foundations for a tower in the north west corner. A parish was assigned out of All Saints' Church, Hockley. Pevsner records that the church is said to have been renovated in 1891 by William Bidlake."]}, {"page": "Bidlake, William", "response": ["#redirectWilliam Bidlake"]}]}}