{"wiki_id": "http://www.wikidata.org/entity/Q8007132", "itemLabel": "William Cornwallis Harris", "itemDescription": "English military engineer and artist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cornwallis_Harris", "wikipedia_page": {"main": "Major Sir William Cornwallis Harris (baptised 2 April 1807 – died 9 October 1848) was an English military engineer, artist and hunter.", "link_mentions": [{"page": "Quagga", "response": ["Little is known about the behaviour of quaggas in the wild, and it is sometimes unclear what exact species of zebra is referred to in old reports. The only source that unequivocally describes the quagga in the Free State is that of the British military engineer and hunter William Cornwallis Harris. His 1840 account reads as follows:"]}, {"page": "Safari", "response": ["In 1836, William Cornwallis Harris led an expedition purely to observe and record wildlife and landscapes. Harris established the safari style of journey, starting with a not too strenuous rising at first light, an energetic day walking, an afternoon rest then concluding with a formal dinner and telling stories in the evening over drinks and tobacco.pp.6–7 Balfour, Daryl & Balfour, Sharna Simply Safari Struik, 2001 The hunting aspect traditionally associated with the safari is said to have its origins in the early 17th century in the region of Évora, Alentejo, where villagers got together to hunt wild boar and reclaim land for farming."]}, {"page": "Mzilikazi", "response": ["While Mzilikazi was generally friendly to European travellers, he remained mindful of the danger that they posed to his kingdom. In later years he refused some visitors access to his realm. The Europeans who met Mzilikazi include  Henry Hartley, hunter and explorer; Robert Moffat, missionary; John Mackenzie, missionary; David Hume, explorer and trader; Andrew Smith, medical doctor, ethnologist and zoologist; William Cornwallis Harris, hunter; and the missionary explorer David Livingstone."]}, {"page": "Common tsessebe", "response": ["The first known person in the Western world to record this antelope was the English painter Samuel Daniell, who painted it in \"Boosh-wana\", and recorded it as the 'sassayby'. The painting of the animal was first published posthumously in 1820 by his brother. William Cornwallis Harris, in his 1840 book about big game hunting, was quite familiar with the species in the Cashan Mountains and Kurrichane Hills, and renders the name as \"sassaybe\". Sassaby had thus become the common name for this antelope in Southern Africa by the end of the 19th century. The English later recorded the Tswana name for the antelope as tsessĕbe, by 1895 it was thought that this was the origin for the anglicised word. Other names for the antelope which were recorded by Frederick Selous around this time were inkweko in the language of the Masubians of the Caprivi Strip (related to Lozi), incolomo and incomazan in the isiNdebele of \"Matebele\", unchuru was the Sekuba name given by the Makuba of northern Botswana, inyundo by the Makalaka, and luchu or lechu by the Masaras. The antelope was recorded as called myanzi in isiZulu and the bastaard hartebeest by the Afrikaners, indeed it looks somewhat like a cross between a hartebeest and a horse. The new vernacular name 'common tsessebe' was invented by Peter Grubb in 2005 to refer to Damaliscus lunatus lunatus to distinguish it from the new Bangweulu taxon."]}, {"page": "Ankober", "response": ["The first Europeans to record their visit to Ankober were the Evangelical missionaries Carl Wilhelm Isenberg and Johann Ludwig Krapf in 1839.Published as Journals of the Rev. Messrs. Isenberg and Krapf... However, at the time there was a small colony of Greeks, who made their living as craftsmen and tradesmen. In the following years, a steady stream of travellers visited Ankober, including Captain William Cornwallis Harris. Following the death of Meridazmach Sahle Selassie in 1847, the Abichu Oromo rebelled and attacked Ankober; only the firearms Sahle Selassie had collected there saved the capital. The Shewans burned the town in 1856 in reaction to the invasion, and eventual conquest, of Emperor Tewodros II."]}, {"page": "William Harris", "response": ["*William Cornwallis Harris (1807–1848), English military engineer, artist and hunter"]}, {"page": "Tadjoura", "response": ["  During the Middle Ages, Tadjoura was ruled by the Ifat Sultanate and then the Adal Sultanate. Tadjoura was the capital of one of the four Afar Sultanates (Tadjoura, Raheita, Awsa and Goba'ad) that emerged from the Adal Sultanate, and as a port and transshipment point for goods from Shewa and Awsa (Ethiopia). The trade with the Afar Depression was mainly carried out by women who brought their goods to Tadjoura on camels, while the men stayed at home, as tribal feuds were not uncommon. According to Mordechai Abir, Tadjoura originally was the seat of the Afar Ad-Ali Abli Sultanate as well as a port. This ruler, known as the Dardar, \"claimed authority over all of the northern Adoimara Afar to the borders of Showa. However, although it was true that some sub-clans of the Ad-Ali and Abli Adoimara roamed as far as the borders of Yifat, even the staunchest supporters of the Sultan agreed that his actual authority did not stretch beyond Lake Assal, a short distance from Tadjoura.\"Mordechai Abir, Ethiopia: The Era of the Princes; The Challenge of Islam and the Re-unification of the Christian Empire (1769-1855) (London: Longmans, 1968), p. 20 The Richard Pankhurst notes that it differed from neighboring ports by handling almost entirely the trade of Shewa and Aussa, \"rather than that of Harar or the Ogaden.\" He quotes William Cornwallis Harris' description of an annual bazaar that started each September, when \"for two months the beach is piled with merchandise, and the suburbs are crowded with camels, mules and donkeys.\" Pankhurst also cites C.T. Beke that the trade with the inhabitants of the Afar Depression was handled entirely by women, \"who loaded the camels, bought and sold while the men kept away altogether 'to avoid bloodshed, this country being the scene of constant feuds among the different tribes.'\"Richard K.P. Pankhurst, Economic History of Ethiopia (Addis Ababa: Haile Selassie University Press, 1968), pp. 429. While Abir observes that the port is not mentioned in all of the material about the Red Sea in the eighteenth or early nineteenth centuries, by the mid-19th century Tadjoura was thriving, \"while all the other so-called Afar sultanates along the coast were described ... as small decaying villages of no political or commercial importance.\"Abir, Era of the Princes, pp. 20f Tadjoura owed this success to possessing a major slave market; Pankhurst suggests that a rough estimate of 6,000 people a year left Ethiopia through Tadjoura and Zeila.Pankhurst, p. 83. The other important commodity sold in Tadjoura in the 19th century was ivory, brought by caravans from Aliyu Amba.Pankhurst, p. 249. Other goods exported included wheat, durra, honey, gold, ostrich feathers, senna, madder, and civetone. The value of trade in 1880-1 was estimated at the time as 29,656 rupees in exports and 18,513 rupees in imports."]}, {"page": "Charles Tilstone Beke", "response": ["Between 1837 and 1838, Beke held the post of acting British consul in Saxony. From that time until his death, his attention was largely given to geographical studies, chiefly of the Nile valley. Aided by private friends, he visited Ethiopia in connection with the mission to Shewa sent by the Indian government under the leadership of Major (afterwards Sir) William Cornwallis Harris, and explored Gojjam and more southern regions up to that time unknown to Europeans. Among other achievements, Beke was the first to determine, with any approach to scientific accuracy, the course of the Abay River (Blue Nile). The valuable results of this journey, which occupied him from 1840 to 1843, he gave to the world in a number of papers in scientific publications, chiefly in the Journal of the Royal Geographical Society."]}, {"page": "Sahle Selassie", "response": ["\"Despite his understanding of the value of foreign technology and the need for craftsmen from abroad Sahla Sellase had no desire for foreign missionaries,\" Pankhurst notes,Pankhurst, p. 5. and although the arrival of two Protestant missionaries in 1837 led to a diplomatic mission from Britain by William Cornwallis Harris, both men were gently but firmly expelled in 1842."]}, {"page": "Menz", "response": ["Menz or Manz (, romanticized: Mänz) is a former province of Ethiopia, located inside the boundaries of the modern Semien Shewa Zone of the Amhara Region. William Cornwallis Harris described Menz as lying \"westward\" of Gedem but between that former province and Marra Biete.Cited in \"Local History in Ethiopia\" (pdf) The Nordic Africa Institute website (accessed 3 June 2008)"]}, {"page": "Wittersham", "response": ["*James Harris - father of Major Sir William Cornwallis Harris, military engineer, artist and hunter"]}, {"page": "Mount Fentale", "response": ["The date of these eruptions is fixed by the investigations of the early 19th century explorer William Cornwallis Harris, whom David Buxton states first encountered this volcano and its lava beds in 1842. By questioning the natives, Harris concluded that the most recent eruptions had taken place 30 years before his arrival.David Buxton, Travels in Ethiopia, second edition (London: Benn, 1957), p. 131"]}, {"page": "William Cornwallis-Harris", "response": ["#REDIRECT William Cornwallis Harris"]}, {"page": "Addiscombe Military Seminary", "response": ["* William Cornwallis Harris"]}, {"page": "Johann Martin Bernatz", "response": ["In 1829 he went to Munich, where he was commissioned to make drawings of various ancient buildings for King Ludwig I. In 1836 he joined  Gotthilf Heinrich von Schubert's expedition to Egypt, travelling from Istanbul through Asia Minor,  Palestine, and the Sinai peninsula. Forty pictures he made on the journey were published as Bilder aus dem heiligen Lande, nach der Natur gezeichnet (\"Pictures from the Holy Land, Drawn from Nature\") in 1839. This led to an invitation to accompany Johannes Roth  on an expedition to India. Bernatz made the voyage to Calcutta, but various obstacles prevented the expedition from taking place. In 1842 he visited Africa, the British authorities in India having decided to employ him as an official artist to an embassy, led by Captain William Cornwallis Harris to Sahela Selassie, the king of Shoa.  A set of lithographs of his drawings from this journey were published in London in 1852 as Scenes of Ethiopia. German editions followed."]}, {"page": "Inoculation", "response": ["Early travellers to Ethiopia report that variolation was practiced by the Amhara and Tigray peoples. The first European to report this was Nathaniel Pearce, who noted in 1831 that it was performed by a debtera who would collect \"a quantity of matter\" from a person with the most sores from smallpox, then \"cuts a small cross with a razor in the arm\" of his subject and puts \"a little of the matter\" into the cut which was afterwards bound up with a bandage. Subsequent visitors who described this practice included the British traveller William Cornwallis Harris and Dr. Petit of the French scientific mission of 1839–1841.Richard Pankhurst, An Introduction to the Medical History of Ethiopia (Trenton: Red Sea Press, 1999), pp. 26ff"]}, {"page": "List of big-game hunters", "response": ["===Sir William Cornwallis Harris===", "Major Sir William Cornwallis Harris (1807–1848) was an English military engineer, artist, naturalist and hunter. Joining the Honourable East India Company in 1825, whilst in India he hunted tigers and blackbuck from elephant back and attempted to hunt lion in Gujarat. In 1836, following health issues, Harris was ordered to southern Africa to rehabilitate, where he went on a five-month safari from the Cape Colony to Matabeleland. During that trip Harris shot elephant, quagga, giraffe, hippopotamus, wildebeest, hartebeast, impala, rhinoceros, waterbuck and giraffe, the ivory from the elephant he shot funded the entire expedition. A naturalist, when not hunting Harris spent part of each day skillfully drawing animals and native Africans, he also collected two complete skulls of every quadruped found in southern Africa, along with a complete skeleton and skin of the sable antelope, which became known as the \"Harris buck\", these remains were later displayed in the British Museum. In 1838 Harris published an account of his time in southern Africa, The wild sports in southern Africa and in 1840 he published a folio volume of lithographs, Portraits of the game animals of southern Africa."]}]}}