{"wiki_id": "http://www.wikidata.org/entity/Q8008696", "itemLabel": "William Evans", "itemDescription": "British politician, (1788-1856)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Evans_(1788%E2%80%931856)", "wikipedia_page": {"main": "William Evans (17 January 1788  – 8 April 1856) was a Whig politician who  sat in the House of Commons in three periods between 1818 and 1852.\nEvans was the son of William Evans of Darley and Elizabeth Strutt who was the daughter of Jedediah Strutt of Belper. The Evans family  had made a fortune from lead mines at Bonsall, and an iron slitting and rolling mill in Derby and a cotton mill at Darley Abbey. They also owned the Evans Bank in Derby. \n\nEvans was Member of Parliament (MP) for East Retford from 1818 to 1820, and in 1826 unsuccessfully contested Leicester at a cost of between £20,000 and £30,000. In 1830 a compromise was reached and Evans was returned for Leicester without a poll, the same happening in 1831 when Evans was a reformist. Evans was re-elected in the 1832 Reformed parliament, but lost his seat in 1835. He was then elected for North Derbyshire in 1837 and held the seat until 1853, when he resigned by taking the Chiltern Hundreds.\nEvans became High Sheriff of Derbyshire in 1829 and was also a Deputy Lieutenant of Derbyshire and J. P.. He lived at Allestree Hall and was philanthropic in his support of schools and churches.\nEvans married Mary Gisborne, daughter of Rev. Thomas Gisborne of Yoxall Lodge in July 1820. In 1850 he bought Pickford's House in Derby from William Pickford. He left this house to his son Sir Thomas William Evans, 1st Baronet who also became a Member of Parliament.", "link_mentions": [{"page": "Pickford's House Museum", "response": ["When Pickford died he left the house to Reverend Joseph Pickford who had the house extended and divided into two properties.. He left the house to his cousin William Pickford in his will in 1844. William promptly mortgaged the house and by 1850 it was sold to William Evans (1788–1856) of Allestree Hall. His son Sir Thomas William Evans 1st Bt, who was also a politician, sold it in 1879 to Frederick Ward who sold it to  William Curgenven, the first of a number of surgeons to own it. In 1977 it was upgraded from Grade II to Grade I. It was purchased in 1982 by Derby City Council. The council did not pay enough attention to its Grade I status and they removed chimneys, floors and walls without applying for permission. "]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|William Evans||Liberal"]}, {"page": "North Derbyshire (UK Parliament constituency)", "response": ["|William Evans || Whig"]}, {"page": "List of people with surname Evans", "response": ["***David William Evans (1866–1926), Welsh lawyer, public servant and rugby international", "**John William Evans (geologist) (1857–1930), British geologist", "**John William Evans (rugby player) (1875–1947), Welsh rugby union forward", "***Thomas William Evans (1821–1892), High Sheriff of Derbyshire and MP", "***William Evans (divine) (died c. 1720), Welsh Presbyterian divine", "***William Evans (British Army officer), British Army officer during the War of Spanish Succession", "***William Evans (lexicographer) (died 1776), Welsh minister and lexicographer", "***William Evans (1788–1856), British MP for North Derbyshire", "***William Evans (watercolourist) (1798–1877), William Evans of Eton, English artist", "***William Evans (priest) (1801–1869), divine and naturalist", "***William Evans (landscape painter) (1811–1858), William Evans of Bristol, English artist", "***Sir William Evans, 1st Baronet (1821–1892), British Liberal politician and benefactor", "***William Evans (judge) (1846/7–1918), Welsh judge and legal author", "***William Evans (Medal of Honor) (1851–1881), American Indian Wars soldier", "***William Evans (footballer) (1853–1919), Wales international footballer", "***William Evans (Australian politician) (1856–1914), Australian union leader and politician", "***William Evans (Australian sportsman) (1876–1964), Queensland cricketer and rugby union player", "***William Evans (English cricketer) (1883–1913), South African-born English all-round cricketer", "***William Evans (rugby player born 1883) (1883–1946), Welsh international rugby player", "***William Evans (Wil Ifan) (1883–1968), Welsh poet and Archdruid", "***William Evans (cardiologist) (1895–1988), Welsh cardiologist and publisher", "*** William Evans (1920–2013), American musician a.k.a. Yusef Lateef", "***William Evans (basketball) (born 1932), Olympic basketball player"]}, {"page": "William Evans", "response": ["William Evans or Will Evans may refer to:", "*William Evans (watercolourist) (1798–1877), English watercolour painter born in Eton", "*William Evans (landscape painter) (1809–1858), William Evans of Bristol", "*William Evans (Wil Ifan) (1883–1968), Welsh poet and Archdruid", "*Yusef Lateef (1920–2013), a.k.a. William Evans, American musician", "*Dave Evans (bluegrass) (William Evans, 1950–2017), bluegrass musician", "*William Evans (1788–1856), British MP for North Derbyshire", "*Sir William Evans, 1st Baronet (1821–1892), British Liberal politician and benefactor", "*William Evans (judge) (1846/7–1918), Welsh judge and legal author", "*William Evans (Australian politician) (1856–1914), Australian union leader and politician", "*William Evans (Medal of Honor) (1853–1893), American Indian Wars soldier", "*William Evans (British Army officer), British Army officer during the War of Spanish Succession", "*William Evans (trade unionist) (1899–1983), British trade union leader", "*William Evans (divine) (died 1720), Welsh Presbyterian divine", "*William Evans (lexicographer) (died 1776), Welsh minister and lexicographer", "*William Evans (priest) (1801–1869), English divine and naturalist", "*William Evans (ornithologist) (1851–1922), Scottish naturalist, ornithologist and actuary", "*William Evans (cardiologist) (1895–1988), Welsh cardiologist and publisher", "*William Evans, Baron Energlyn (1912–1985), Welsh geologist and life peer", "*William Evans (baseball), Negro league baseball player", "*William Evans (basketball player) (1932–2020), American Olympic basketball player", "*William Evans (cricketer, born 1883) (1883–1913), South African-born English all-round cricketer", "*William Evans (cricketer, born 1897) (1897–1966), English first-class cricketer and civil servant", "*William Evans (footballer) (1853–1919), Welsh international footballer", "*William Evans (Australian sportsman) (1876–1964), Queensland cricketer and rugby union player", "*William Evans (rugby union, born 1883) (1883–1946), Welsh international rugby union player", "*William Evans (rugby union, born 1892) (1892–1979), Welsh rugby union player", "* William Evans (19802021), United States Capitol Police officer killed in vehicular assault on Capitol", "* William Evans, a character in the 2007 film 3:10 to Yuma, played by Logan Lerman"]}, {"page": "Leicester (UK Parliament constituency)", "response": ["|rowspan=\"2\"| William Evans"]}, {"page": "East Retford (UK Parliament constituency)", "response": ["| William Evans"]}, {"page": "Holbrook, Derbyshire", "response": ["In 1863, Holbrook (or Holbrooke) was created as a separate parish from that of Duffield. St Michael's Church, Holbrook is a simple construction in stone built in 1761 by Rev. S. Bradshaw. It was rebuilt and enlarged in 1841 by the MP William Evans.Holbrooke , Kelly's Directory of the Counties of Derby, Notts, Leicester and Rutland, London (May, 1891) - pp.230-231"]}, {"page": "Sir William Evans, 1st Baronet", "response": ["Sir (Thomas) William Evans, 1st Baronet (15 April 1821 – 4 October 1892) was an English Liberal politician who represented the constituency of South Derbyshire.", "Evans was the son of William Evans of Allestree, Derby, who was an MP and High Sheriff, and his wife Mary Gisborne.Burke Landed Gentry The Evans family  had made a fortune from lead mines at Bonsall, and an iron slitting and rolling mill in Derby and a cotton mill at Darley Abbey.Derbyshire County Council They also owned the Evans Bank in Derby. However it was Evans' uncle, Samuel Evans, who ran the business. His own father, William Evans, had opted to take up the life of the landed gentleman at Allestree Hall.The Evans dynasty, Derwent Valley Mills, accessed 19 August 2015 Evans was educated at Trinity College, Cambridge. Evans' father died in 1856 leaving him property including Pickford's House in Derby."]}, {"page": "Parwich", "response": ["Parwich was part of the ancient Crown lands and after the Conquest was granted to the Ferrers, Earls of Derby. Robert de Ferrers took a prominent part in the Montford Rebellion against the king, and Edward I seized his lands. The king gave the manor to Edmund Crouchback, Earl of Lancaster, and it became part of the Duchy of Lancaster held by the Cokayne family of Ashbourne Hall. In 1603 it was sold to Thomas Levinge and remained in his family until 1814 when it was sold to William Evans. The Levinge family built Parwich Hall in 1747 but were frequently absent. After 1892, the estate was split between the Carrs and the Gisbornes. After World War One, the estate was sold to the Inglefields who sold it in the 1970s.", "The school and St Peter's Church, Parwich were erected by Sir Thomas William Evans in 1861 and 1873, although elements of the rebuilt church date back to Norman times and the church tympanum is thought to have pre-Norman origins.", "Evans owned Parwich Hall, possibly as a summer retreat from his home in Derby. It was bought in 1814 by William Evans, Thomas's father, who was a Derbyshire MP, but was in use as a vicarage by 1841."]}, {"page": "Allestree Hall", "response": ["The Mundy family owned the Manor of Allestree from 1516 until Francis Noel Clarke Mundy sold it to Thomas Evans in 1781. It was later the home of William Evans and of his son Sir Thomas William Evans, 1st Baronet. On his death in 1892 the latter bequeathed the estate to his brother in law William Gisborne.", "John Charles Girardot was born in 1771 into a French Huguenot family. His father was Andrew Girardot and his grandfather was Paul Girardot de Charcourt. He became his grandmother's heir in 1784 and was also an heir of his uncle.Huguenot Society of Great Britain and Ireland, 2007 “Huguenot Wills and Administrations in England and Ireland, 1617-1849” Part 1, p. 186-88. He lived at Allestree Hall for about 20 years and sold it to William Evans in 1824.", "==William Evans==", "William Evans was one of the longest residents of Allestree Hall. He lived there for about thirty years between 1824 until his death in 1856.", "He was born in 1788 in Derbyshire. His father, also called William Evans, was a very wealthy man. When he died William inherited Evans inherited a share in the Derby Bank, Darley cotton and paper mills, Derby waterworks and Bonsall lead smelting business.History of Parliament website. Online reference http://www.historyofparliamentonline.org/volume/1820-1832/member/evans-william-1788-1856 He was also lord of the manors of Brailsford, Alkmonton, Parwich and Newton Grange.Obituary of William Evans, The Gentleman's Magazine: and historical review, May 1856, p. 526", "William became a politician and was a known associate of William Wilberforce. He joined him in his fight against slavery. He and Wilberforce were both prominent members of the Anti-Slavery Society (1823–1838). A letter exists from William Evans to his sister which mentions that he has recently received correspondence from Wilberforce.", "William died at Allestree Hall in 1856 at the age of 68 and his only child Thomas William Evans inherited the property.", "==Sir Thomas William Evans==", "right|thumb|120px|Sir Thomas William Evans.", "Thomas William Evans was born in 1821 at Allestree Hall. He was educated at Trinity College, Cambridge. After he graduated with a Master of Arts in 1846 he married his first cousin Mary Gisborne, the daughter of Thomas John Gisborne of Holme Hall near Bakewell. The couple had no children."]}, {"page": "Parwich Hall", "response": ["The Levinge family seat was moved to Westmeath in Ireland and the house was let out and in 1814 was sold to William Evans of Allestree Hall. During part of the time of Evans' ownership the house was occupied by the vicar Rev Carr, a relative of Evans. After the death of Sir Thomas Evans in 1892, another clerical descendant, Rev Claud Lewis, had the use of the house."]}, {"page": "William Evans (1788-1856)", "response": ["#REDIRECT William Evans (1788–1856)"]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|William Evans"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|William Evans||Whig"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|William Evans||Whig"]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|rowspan=\"2\"|East Retford(two members)||William Evans||"]}, {"page": "Derby Baptist Chapel", "response": ["To accommodate a growing congregation which had reached 500, the St Mary's Gate chapel was converted from the former mansion dating from ca. 1750 of the Osbornes. It was purchased from William Evans MP for £4,000 in 1841 ()."]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| William Evans"]}]}}