{"wiki_id": "http://www.wikidata.org/entity/Q8008997", "itemLabel": "William Fergusson", "itemDescription": "Scottish physician, inspector-general of military hospitals, and medical writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Fergusson_(physician)", "wikipedia_page": {"main": "Dr William Fergusson FRSE (1773–1846) was a Scottish inspector-general of military hospitals, and medical writer.", "link_mentions": [{"page": "List of Scots", "response": ["* William Fergusson (1773–1846), inspector-general of military hospitals; medical writer"]}, {"page": "Battle of Copenhagen (1801)", "response": ["Of the Danish ships engaged in the battle, two had sunk, one had exploded, and twelve had been captured. The British could not spare men for manning prizes as they suspected that further battles were to come. They burned eleven of the captured ships, and only one, Holsteen, was sailed to England with the wounded under surgeon William Fergusson.Clarke and McArthur, p. 611 Holsteen was then taken into service with the Royal Navy and renamed  (later ).."]}, {"page": "James Fergusson (architect)", "response": ["Fergusson was born in Ayr, the son of William Fergusson (1773–1846) an army surgeon. After being educated first at the Royal High School, Edinburgh, and then at a private school in Hounslow, he went to India to work as a trader at his family's mercantile house of Fairlie, Fergusson & Co. of Calcutta. Here he became interested in the remains of the ancient architecture of India, little known or understood at that time.  The successful conduct of an indigo factory, as he states in his own account, enabled him to retire from business after about ten years and settle in London."]}, {"page": "Sir William Fergusson, 1st Baronet", "response": ["thumb|right|Sir William Fergusson, 1st Baronet", "Sir William Fergusson, 1st Baronet FRCS FRS FRSE (20 March 180810 February 1877) was a Scottish surgeon.", "William Fergusson son of James Fergusson of Lochmaben, Dumfriesshire, was born at Prestonpans, East Lothian on 20 March 1808, and was educated first at Lochmaben and afterwards at the high school and University of Edinburgh. At the age of fifteen he was placed by his own desire in a lawyer's office, but the work proved uncongenial, and at seventeen he exchanged law for medicine, in accordance with his father's original wishes. He became an assiduous pupil of Dr. Robert Knox the anatomist, who was much pleased with a piece of mechanism which Fergusson constructed, and appointed him at the age of twenty demonstrator to his class of four hundred pupils.", "thumb|Burial vault of William Fergusson in St. Andrews Kirkyard at West Linton", "* William Fergusson's Letters upon cholera morbus, with observations upon contagion, quarantine, and disinfecting fumigations (London, 1832)"]}, {"page": "William Ferguson", "response": ["* William Fergusson (politician) (?-?), NSW, Australia politician (1880–1887)", "* Sir William Fergusson, 1st Baronet (1808–1877), Scottish surgeon", "* William Fergusson (physician) (1773–1846), Scottish inspector-general of military hospitals and medical writer"]}, {"page": "William Fergusson (1773-1846)", "response": ["#REDIRECT William Fergusson (physician)"]}]}}