{"wiki_id": "http://www.wikidata.org/entity/Q8009333", "itemLabel": "William Frank Calderon", "itemDescription": "British artist (1865-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Frank_Calderon", "wikipedia_page": {"main": "William Frank Calderon aka W. Frank Calderon (London 1865 – 21 April 1943), was a British painter of portraits, landscapes, figure subjects and sporting pictures. He was the third son of the painter and Keeper of the Royal Academy in London, Philip Hermogenes Calderon and was married (in 1892) to Ethel Wells Armstead (b. 1864), third daughter of the noted sculptor Henry Hugh Armstead, RA.\nWhen fourteen, Calderon was awarded the Trevelyan Goodall Scholarship and later a scholarship to the Slade School under Professor Alphonse Legros. He and Charles Edward Johnson, a landscape artist, started the School of Animal Painting at 54 Baker Street, London in April 1895; Calderon acted as principal until 1916. Some of their students were Cecil Aldin, Lionel Edwards, Alfred Munnings, Lady Helena Gleichen, Frederic Whiting and George E. Studdy. He exhibited at the Royal Academy from 1881–1921, and had his first Royal Academy painting bought by Queen Victoria. His 1936 book Animal Painting and Anatomy is still considered a useful reference source. He illustrated numerous books such as \"The Most Delectable History of Reynard The Fox\" edited by Joseph Jacobs and published by Macmillan in 1895. The cover, designed by A. A. Turbayne, was gold-blocked in art nouveau style and inspired designers to create work using \"asymmetrical designs, sinuous curves, and simplified shapes with minimal shading.\"", "link_mentions": [{"page": "Cecil Aldin", "response": ["Born in Slough, Aldin was educated at Eastbourne College and Solihull Grammar School. Cecil Aldin's father, a builder, was a keen amateur artist so Cecil started drawing at a very young age. He studied art at the studio of Albert Joseph Moore in Kensington but, unhappy with the teaching methods Aldin left after a month to study animal anatomy at the National Art Training School in South Kensington. After this he attended a summer school run by the animal painter and teacher, William Frank Calderon at Midhurst, Sussex. Aldin left when he developed rheumatic fever but shortly afterwards he sold his first drawing, which appeared in The Building News of 12 September 1890. This was followed by a dog show picture purchased by The Graphic in 1891. He rented a studio in Chelsea and in 1892 he began a long association with The Illustrated London News. Whilst at Chelsea he would often draw in the London Zoological Gardens and an early work on a tiger in the zoo which was drawn from life was found to be a copyright of a photograph by Gambier Bolton. He also did some work for Cadbury's advertising. Aldin was commissioned by The Pall Mall Budget in 1894 to illustrate the serialisation of stories from Rudyard Kipling's The Second Jungle Book. "]}, {"page": "Mildred Anne Butler", "response": ["Butler's father Henry may have encouraged her to paint in her youth but her artistic training began in London in the late 1880s with the watercolourist Paul Jacob Naftel, whom she credited for her understanding of watercolours. Butler like her friend Rose Barton, who also studied under Naftel, did not follow his choice of landscape, instead she devoted herself to cattle, birds, and flower gardens. She continued her studies at Westminster School of Art under William Frank Calderon who specialised in animal painting and later opened a school of animal painting.  At Frank Calderon's School she studied the subject of cows, and it was that work for which she was elected to the Old Society, the Royal Academy.()"]}, {"page": "W. Frank Calderon", "response": ["#REDIRECT William Frank Calderon"]}, {"page": "Kathleen Pelham-Clinton, Duchess of Newcastle", "response": ["Upon her death in 1955, the Duchess bequeathed a variety of cups and paintings to The Kennel Club, including an oil on canvas painting of a Borzoi by William Frank Calderon. She left her show dogs to her kennel man and her house dogs to her maid."]}, {"page": "Flora Scales", "response": ["In 1908 Scales left New Zealand to study painting in England with animal painter William Frank Calderon. In 1911 her Cattle mustering in New Zealand was exhibited at the Royal Academy of Arts."]}, {"page": "Mabel Dawson", "response": ["Dawson was born in Edinburgh and studied at the Edinburgh College of Art before continuing her artistic training in London at the school of animal painting run by William Frank Calderon in Kensington. She returned to Edinburgh, where she lived for the majority of her life and maintained a studio, first at 130 George Street and then, from 1943 at Palmerston Place. Dawson became known for her paintings of animals, flowers and birds but also painted landscapes of the fishing villages on the Scottish east coast and historical scenes.  Dawson was also considered skilled at embroidery and undertook decorative work. During the 1930s she produced designs for the Scottish Society for the Protection of Wild Birds."]}, {"page": "Violet Whiteman", "response": ["Whiteman was born in Guildford, Surrey, England, in 1873. She studied art at Herkomer School in Bushey; she also studied anatomy at the London Veterinary College and took lessons from animal painters William Frank Calderon and Stanhope Forbes. "]}, {"page": "Doris Lindner", "response": ["Lindner was born at Llanyre in mid-Wales, and spent her childhood in Winchester. Her mother was Welsh and her father was English and the family had sufficent income to employ several servants. Lindner studied at the school of animal painting run by William Frank Calderon in London and then at Saint Martin's School of Art in central London before completing her studies at the British School in Rome. "]}, {"page": "Felicity Askew", "response": ["Askew was born at Chelsea in London to John Bertram Askew and Frederick Louisa née Dallas. She studied under William Frank Calderon, Max Kruse and Ernesto Bazzaro. Askew established herself as a painter and sculptor, in bronze, of equestrian and sporting subjects and exhibited works in London, at the Walker Art Gallery in Liverpool and in Paris, including at the Salon des Artistes Francais in 1926. She also exhibited works in Germany, Italy and the United States. Her best known work is Companions of Labour, a bronze group of horses dating from 1926. For many years Askew lived at Newmarket in Suffolk and later, in the 1920s, at Berwick upon Tweed. From Berwick, she exhibited at a number of galleries in the north-east of England and Scotland but appears to have given up her artistic career to take up acting in the 1950s."]}, {"page": "Frank Calderon", "response": ["#REDIRECT William Frank Calderon"]}]}}