{"wiki_id": "http://www.wikidata.org/entity/Q8007167", "itemLabel": "William Courtenay, 10th Earl of Devon", "itemDescription": "English politician (1777-1859)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Courtenay,_10th_Earl_of_Devon", "wikipedia_page": {"main": "William Courtenay, 10th Earl of Devon (19 June 1777 – 19 March 1859) was a 19th-century British aristocrat and politician, who sat in the Commons before entering the House of Lords after succeeding to the title of Earl of Devon in 1835.", "link_mentions": [{"page": "Earl of Devon", "response": ["*William Courtenay, 10th Earl of Devon (1777–1859), his second cousin: elder son of Rt. Rev. Henry Reginald Courtenay, Bishop of Exeter, who was the second son of Henry Reginald Courtenay, MP, who was the second son of Sir William Courtenay, 2nd Baronet"]}, {"page": "Powderham Castle", "response": ["William Courtenay, 11th Earl of Devon (d. 1888) installed a heraldic chimneypiece in the Dining Hall in memory of his grandfather Reginald Courtenay (1741–1803), Bishop of Exeter from 1797 to 1803, and of his parents. The Dining Hall was built by his father William Courtenay, 10th Earl of Devon (d. 1859) between 1847 and his death in 1859, and the 11th Earl completed the internal decorations in 1860, including the linen fold panelling containing several dozen ancestral heraldic shields.Powderham Castle guidebook, 2011, p. 10. It is copied from the mediaeval chimneypiece in the Bishop's Palace, Exeter, installed c. 1485 by Peter Courtenay (d. 1492) Bishop of Exeter, a younger son of Sir Philip Courtenay (1404–1463) of Powderham.Pevsner, N. Buildings of England: Devon. (see also mention in article ) The armorials on the lowest row are from left to right:", "*Arms of William Courtenay, 10th Earl of Devon (d. 1859), impaling the arms of his wife Hariet Leslie Pepys: Quarterly 1st & 4th: Sable, on a bend or between two nag's heads erased argent three fleurs-de-lis of the fieldDebrett's Peerage, 1968, p. 287, Pepys, Earls of Cottenham. (Pepys, Baronets of Juniper Hill); 2nd & 3rd: Argent, on a bend azure three buckles orDebrett's Peerage, 1968, p. 958. (Leslie, Earls of Rothes). (Parents of 11th Earl of Devon). The supporters are two of the Bohun swans, which bird was used by that family, from which came the wife of Hugh Courtenay, 2nd Earl of Devon (d. 1377), heiress of Powderham, as a heraldic badge. In the spandrels are two dolphins, a badge of the Courtenays. These arms can be seen on a brass plate on their monument in Powderham Church, itself a copy of the 15th-century Courtenay monument in Colyton Church, Devon."]}, {"page": "William Courtenay, 11th Earl of Devon", "response": ["Devon was the eldest son of William Courtenay, 10th Earl of Devon and his first wife Harriet Leslie Pepys, daughter of Sir Lucas Pepys, 1st Baronet. He was educated at Westminster School and at Christ Church, Oxford, and was called to the Bar, Lincoln's Inn, in 1832.", "*Arms of William Courtenay, 10th Earl of Devon (d.1859), impaling the arms of his wife Hariet Leslie: Quarterly 1st & 4th: Pepys, Baronets of Juniper Hill; 2nd & 3rd: Leslie, Earls of Rothes. (Parents of 11th Earl of Devon). The supporters are two of the Bohun swans, which bird was used by that family, from which came the wife of Hugh Courtenay, 2nd Earl of Devon (d.1377), heiress of Powderham,  as a heraldic badge. In the spandrels are two dolphins, a badge of the Courtenays. These arms can be seen on a brass plate on their monument in Powderham Church, itself a copy of the 15th-century Courtenay monument in Colyton Church."]}, {"page": "High Steward (academia)", "response": ["*William Courtenay, 10th Earl of Devon 1838 (died 1859)"]}, {"page": "William Courtenay (disambiguation)", "response": ["*William Courtenay, 10th Earl of Devon (1777–1859), British aristocrat and politician"]}, {"page": "Thomas Courtenay (British politician)", "response": ["Courtenay was the second son of the Right Reverend Henry Reginald Courtenay (d.1803), Bishop of Exeter, and his wife Lady Elizabeth Howard, daughter of Thomas Howard, 2nd Earl of Effingham. His paternal grandmother Lady Catherine was the daughter of Allen Bathurst, 1st Earl Bathurst.  His elder brother was William Courtenay, 10th Earl of Devon (1777–1859).Vivian, Lt.Col. J.L., (Ed.) The Visitations of the County of Devon: Comprising the Heralds' Visitations of 1531, 1564 & 1620, Exeter, 1895, pp.249-50, pedigree of Courtenay"]}, {"page": "Reginald Courtenay (bishop of Exeter)", "response": ["*Arms of William Courtenay, 10th Earl of Devon (d.1859), impaling the arms of his wife Hariet Leslie: Quarterly 1st & 4th: Pepys, Baronets of Juniper Hill; 2nd & 3rd: Leslie, Earls of Rothes. (Parents of 11th Earl of Devon)"]}, {"page": "List of English cricketers (1787–1825)", "response": ["|William Courtenay, 10th Earl of Devon"]}, {"page": "Forde House", "response": ["In 1820History of Parliament biography  Forde House was let to Ayshford WisePer inscription on 1835 engraving of Ford House by J. Henshall (1786-1847), JP, DL and MP for Totnes 1812-1818, descended from the ancient Devon family of Wise of Sydenham House.Vivian, Lt.Col. J.L., (Ed.) The Visitations of the County of Devon: Comprising the Heralds' Visitations of 1531, 1564 & 1620, Exeter, 1895, pp.791-2, pedigree of Wise of Sidenham His co-member for Totnes was Thomas Courtenay (d.1841), younger brother of William Courtenay, 10th Earl of Devon (1777–1859),Vivian, p.250 of Powderham.  The Wise family were lord of the manor of Little Totnes, and his father John Wise (1751-1807) of Wonwell was Recorder of Totnes from 1779 until his death and a partner in the \"Totnes Bank\", founded in about 1800 as Wise, Baker & Co. In 1817 the bank opened a new branch in Newton Abbot and in 1820 Ayshford Wise sold Wonwell and rented Forde House to be near his new premises. Later in the 1820s he sold his ancestral lands in Totnes to  Edward Adolphus St Maur, 11th Duke of Somerset (1775–1855), of Stover House,Pevsner, Nikolaus & Cherry, Bridget, The Buildings of England: Devon, London, 2004, p. 768 who owned a great estate in and around Totnes the caput of which was Berry Pomeroy Castle. The bank failed in 1841."]}, {"page": "Lucas Pepys", "response": ["Pepys married, on 30 October 1772, Jane Elizabeth Leslie, 12th Countess of Rothes in her own right,   and widow of George Evelyn of St Clere, Kent, and had by her two sons, Charles and Henry,  and a daughter, Harriet, who married William Courtenay, 10th Earl of Devon. He married again, on 29 June 1813, Deborah, daughter of Dr. Anthony Askew and his second wife Elizabeth Holford, who survived him. Each of his sons, who took their mother's family name, succeeded to the baronetcy  in turn."]}, {"page": "Manor of Powderham", "response": ["====William Courtenay, 10th Earl of Devon (1777–1859)====", "William Courtenay, 10th Earl of Devon (1777–1859) (second cousin)"]}, {"page": "Cofton", "response": ["The parish church, dedicated to St Mary,  was rebuilt in 1838-9 by William Courtenay, 10th Earl of Devon (1777–1859), of Powderham Castle, a leader of the High Church revivalPevsner, Nikolaus & Cherry, Bridget, The Buildings of England: Devon, London, 2004, p.273 and eldest son of Rt. Rev. Henry Reginald Courtenay, Bishop of Exeter. The architect was Charles Fowler."]}, {"page": "Charles Leslie Courtenay", "response": ["He was the fourth son of William Courtenay, 10th Earl of Devon."]}, {"page": "Glenquin Castle", "response": ["It was restored by William Courtenay, 10th Earl of Devon in 1840."]}]}}