{"wiki_id": "http://www.wikidata.org/entity/Q8001776", "itemLabel": "Wilfred Dolby Fuller", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/Wilfred_Dolby_Fuller", "wikipedia_page": {"main": "Wilfred Dolby Fuller VC (28 July 1893 – 22 November 1947) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nFuller was born in Greasley, Nottinghamshire. At the age of 18 (1911) he joined the First Battalion Grenadier Guards.  Serving initially in a military police role at Chelsea barracks, Wilfred, a keen sportsman volunteered for and was accepted into the battalion's 'Bomber' section.  These men would advance in front of the other guards armed only with a bag of the newly invented grenades. In 1915 the battalion was deployed to France and saw action at the Battle of Neuve Chapelle. As a lance-corporal Wilfred was in charge of a small section of bombers who on the second day of the battle (12 March 1915) advanced onto the German trench lines.\nLance-Corporal Fuller saw a party of the enemy trying to escape along a communication trench. He ran towards them and killed the leading man with a bomb; the remainder (nearly 50) seeing no means of evading his bombs, all surrendered to him. Lance-Corporal Fuller was quite alone at the time.He received his Victoria Cross from King George V at Buckingham Palace on 4 June 1915. In September of the same year, at the express wish of the Tsar of Russia, he was also decorated by the King at Sheffield with the Russian Cross of the Order of Saint George, 3rd Class.", "link_mentions": [{"page": "Frome", "response": ["* Wilfred Dolby Fuller (1893–1947), English recipient of the Victoria Cross, worked as a local policeman and died in Frome."]}, {"page": "List of English Victoria Cross recipients", "response": ["|Wilfred Dolby Fuller || British Army || 1915 || First World War || Neuve-Chapelle"]}, {"page": "Wilfred Fuller", "response": ["#REDIRECT Wilfred Dolby Fuller"]}, {"page": "Battle of Neuve Chapelle", "response": ["* Lance Corporal Wilfred Dolby Fuller, 1st Battalion, The Grenadier Guards."]}, {"page": "List of people from Nottingham", "response": ["*(1893–1947) Wilfred Dolby Fuller, awarded the Victoria Cross for valour in the Battle of Neuve Chapelle in the First World War in 1915, was born in Greasley."]}, {"page": "List of people from Mansfield", "response": ["*Wilfred Dolby Fuller (born 28 July 1893) won the Victoria Cross for his bravery on 12 March 1915 at Neuve Chapelle, France."]}]}}