{"wiki_id": "http://www.wikidata.org/entity/Q8001754", "itemLabel": "Wilfred Brown, Baron Brown", "itemDescription": "British peer", "wikipedia_url": "https://en.wikipedia.org/wiki/Wilfred_Brown,_Baron_Brown", "wikipedia_page": {"main": "Wilfred Banks Duncan Brown, Baron Brown PC MBE (29 November 1908 – 7 March 1985), was the chairman and the managing director of Glacier Metal Company (1939–1965), author of several books and articles on management and labour issues, university administrator, and United Kingdom's Minister of State at the Board of Trade (1965–1970).\nBrown is perhaps best known for his collaboration with the organizational theorist Elliott Jaques on the Glacier Project, which Peter Drucker called \"the most extensive study of actual worker behavior in large-scale industry\". Sponsored by Glacier Metal Company and its Works Council during Brown's leadership, the project ran from 1948 to 1965, resulting in the development or discovery of felt-fair pay, stratified systems theory, timespan of discretion, levels of work, product pricing analysis and career progression trajectories. These ideas were described in the various books and articles written by Brown and Jaques. (See Bibliography.) Brown later attempted to use these processes in governmental affairs as a member of the House of Lords.\nAn advocate of practical learning for managers, Brown created the Glacier Institute of Management. He served as the first Chairman of Acton Technical College's Governing Body, Chairman of Brunel University from 1949 to 1965, and Pro-Chancellor of Brunel from 1965 to 1980. Although he never attended university, Brown received honorary degrees from Brunel University (DTech, 1966), Southern Illinois University (Doctor of Laws, 1967) and Cranfield University (DSc, 1972).\nHe was appointed a Member of the Order of the British Empire (MBE) in the 1943 Birthday Honours and made a life peer as Baron Brown, of Machrihanish, in the County of Argyll, on 22 December 1964.\n\n", "link_mentions": [{"page": "List of business theorists", "response": ["* Wilfred Brown, Baron Brown"]}, {"page": "Lord Browne", "response": ["* Wilfred Brown, Baron Brown (1908–1985), metals company executive"]}, {"page": "Lord Brown", "response": ["*Wilfred Brown, Baron Brown (1908–1985), author"]}, {"page": "Wilfred Banks Duncan Brown, Baron of Machrihanish", "response": ["#REDIRECT Wilfred Brown, Baron Brown"]}, {"page": "Wilfred Banks Duncan Brown", "response": ["#REDIRECT Wilfred Brown, Baron Brown"]}, {"page": "Wilfred Banks Duncan Brown, Baron Brown", "response": ["#REDIRECT Wilfred Brown, Baron Brown"]}, {"page": "Baron Brown", "response": ["#REDIRECT Wilfred Brown, Baron Brown"]}, {"page": "Wilfred Brown", "response": ["* Wilfred Brown, Baron Brown (1908–1985), British businessman and politician"]}]}}