{"wiki_id": "http://www.wikidata.org/entity/Q8008115", "itemLabel": "William Duncombe, 2nd Baron Feversham", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Duncombe,_2nd_Baron_Feversham", "wikipedia_page": {"main": "William Duncombe, 2nd Baron Feversham (14 January 1798 – 11 February 1867), was a British peer with a large estate in the North Riding of Yorkshire. He was prominent in the affairs of the Royal Agricultural Society and owner of a prize-winning herd of short-horn cattle.  He served as a Tory Member of Parliament (MP) for the Riding from 1832 to 1841, after which  he sat in the House of Lords, having succeeded to the title on the death of his father. From 1826 to 1831 he had sat as an Ultra-Tory MP. He was the first MP to support Richard Oastler's campaign for Factory Reform, and gave it unwavering support for the rest of his life; in 1847 he seconded the Second Reading in the Lords of the Factory Act of that year (the 'Ten-Hour Act').", "link_mentions": [{"page": "Baron Feversham", "response": ["*William Duncombe, 2nd Baron Feversham (1798–1867)"]}, {"page": "Ernest Beckett, 2nd Baron Grimthorpe", "response": ["Beckett was the eldest son of William Beckett, younger son of Sir Edmund Beckett, 4th Baronet and Hon. Helen Duncombe, daughter of William Duncombe, 2nd Baron Feversham. Beckett was the nephew of Edmund Beckett, 1st Baron Grimthorpe and great nephew of Sir John Beckett, 2nd Baronet."]}, {"page": "Helmsley", "response": ["The settlement grew around its position at a road junction and river crossing point. Helmsley is a compact town, retaining its medieval layout around its market place with more recent development to the north and south of its main thoroughfare, Bondgate. It is a historic town of considerable architectural character whose centre has been designated as a conservation area. The town is associated with the Earls of Feversham, whose ancestral home Duncombe Park was built overlooking Helmsley Castle. A statue of William Duncombe, 2nd Baron Feversham stands in the town's square."]}, {"page": "Sir Edmund Beckett, 4th Baronet", "response": ["* William Beckett (1826–1890), who married the Hon. Helen Duncombe, daughter of William Duncombe, 2nd Baron Feversham."]}, {"page": "Charles Duncombe, 1st Baron Feversham", "response": ["* William Duncombe, 2nd Baron Feversham (born 14 January 1798, died 11 February 1867)"]}, {"page": "William Duncombe, 1st Earl of Feversham", "response": ["Duncombe was the son of William Duncombe, 2nd Baron Feversham, and his wife Lady Louisa Stewart. He was elected to the House of Commons for East Retford in 1852, a seat he held until 1857, and then represented the North Riding of Yorkshire between 1859 and 1867. The latter year he succeeded his father in the barony and entered the House of Lords. In 1868 he was created Viscount Helmsley, of Helmsley in the North Riding of the County of York, and Earl of Feversham, of Ryedale in the North Riding of the County of York."]}, {"page": "Montagu Curzon", "response": ["Curzon married in London on 19 October 1886 Esmé FitzRoy (1859–1939), the fourth daughter of Francis Horatio FitzRoy (son of Admiral Lord William FitzRoy) and his wife, the Hon. Gertrude Duncombe (second daughter of William Duncombe, 2nd Baron Feversham). They had one son and one daughter:"]}, {"page": "George Stewart, 8th Earl of Galloway", "response": ["# Lady Louisa Stewart (1804–1889), m. William Duncombe, 2nd Baron Feversham."]}, {"page": "Frederick Milner", "response": ["In 1880, he married Adeline Gertrude Denison (1859-1902), second daughter of William Beckett-Denison, by his wife Hon. Helen Duncombe, daughter of William Duncombe, 2nd Baron Feversham. They had one son, William Frederick Victor Mordaunt Milner, who succeeded to the baronetcy on his father's death. Lady Milner died on 7 July 1902, at the age of 43, predeceasing her husband by 29 years. Frederick Milner died in June 1931 at the age of 81."]}, {"page": "William Beckett-Denison", "response": ["Beckett married the Hon. Helen Duncombe, third daughter of William Duncombe, 2nd Baron Feversham and Lady Louisa Stewart (daughter of George Stewart, 8th Earl of Galloway), in 1855. They lived at Meanwood Park in Leeds and at Nun Appleton, Yorkshire, and were the parents of at least seven children, including:"]}, {"page": "William Duncombe (disambiguation)", "response": ["*William Duncombe, 2nd Baron Feversham"]}, {"page": "Lord William FitzRoy", "response": ["*Francis Horatio FitzRoy (6 June 1823 – 20 Mach 1900), who married in 1849 Honourable Gertrude Duncombe (1827–1916), daughter of William Duncombe, 2nd Baron Feversham, and left three daughters and two sons. Sir Almeric William FitzRoy (1851–1935) was their son."]}, {"page": "Randolph Stewart, 9th Earl of Galloway", "response": ["He was born on 16 September 1800.History of Parliament on-line He was the eldest son of eight children born to George Stewart, 8th Earl of Galloway and his wife Lady Jane Paget. Among his siblings was sisters, Lady Jane Stewart, who married George Spencer-Churchill, 6th Duke of Marlborough, and Lady Louisa Stewart, who married William Duncombe, 2nd Baron Feversham.  His younger brother, Vice Admiral Hon. Keith Stewart, was married to Mary FitzRoy, daughter of Charles Augustus FitzRoy."]}, {"page": "Jane Stewart, Countess of Galloway", "response": ["*Lady Louisa Stewart (1804–1889), who married William Duncombe, 2nd Baron Feversham, and had children"]}]}}