{"wiki_id": "http://www.wikidata.org/entity/Q8006883", "itemLabel": "William Cleghorn", "itemDescription": "English eccentric", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cleghorn_(Newcastle_eccentric)", "wikipedia_page": {"main": "Mr. William Cleghorn  (1777–1860), better known locally as \"Billy Conolly\" was the last of the old eccentrics of Newcastle.", "link_mentions": [{"page": "William Cleghorn", "response": ["William Cleghorn (1718 – August 1754) was a British philosopher. He was born to a successful Scottish brewer, Hugh Cleghorn, and Jean Hamilton, and died in 1754, aged 36.Nobbs, Douglas. 1965. 'The Political Ideas of William Cleghorn, Hume's Academic Rival'. Journal of the History of Ideas, Vol. 26, No. 4: 575–86 William Cleghorn held the Chair of Pneumatics and Moral Philosophy at the University of Edinburgh from 1745 until his death in 1754.' Some Notes on the History of the Philosophy Department', University of Edinburgh website (accessed 9 Sept 2007.) Four volumes of notes on Cleghorn's lectures on moral philosophy from 1746–47 are stored at the University of Edinburgh library.' Lectures of Professor William Cleghorn', Edinburgh University Library, Special Collections Division.", "Cleghorn was a friend, and probably also teacher, of Adam Ferguson. It is thought that one of the characters in Ferguson's philosophical work Dialogue on a Highland Jaunt is based on Cleghorn.Mossner, Ernest Campbell. 1963. 'Adam Ferguson's \"Dialogue on a Highland Jaunt\" with Robert Adam, William Cleghorn, David Hume, and William Wilkie'. In Carroll Camden (ed.), Restoration and Eighteenth-Century Literature. Chicago: University of Chicago Press: 297–308 It has also been claimed that Cleghorn recommended, shortly before his death, that Ferguson be given the Chair of Pneumatics and Moral Philosophy once he had died. Ferguson was not given the Chair at this time, although he was given it later.", "*Cleghorn, William. 1746–1747. ' Lectures of Professor William Cleghorn'. University of Edinburgh Library, Special Collections Division.", "*Grote, Simon.  2005.  'The Moral Philosophy of William Cleghorn'.  MPhil Dissertation.  Faculty of History, Cambridge University.", "*Mossner, Ernest Campbell. 1963. 'Adam Ferguson's \"Dialogue on a Highland Jaunt\" with Robert Adam, William Cleghorn, David Hume, and William Wilkie'. In Carroll Camden (ed.), Restoration and Eighteenth-Century Literature. Chicago: University of Chicago Press: 297–308.", "*Nobbs, Douglas. 1965. 'The Political Ideas of William Cleghorn, Hume's Academic Rival'. Journal of the History of Ideas, Vol. 26, No. 4: 575–86."]}, {"page": "Cleghorn", "response": ["* William Cleghorn (1718–1754), British philosopher", "* William Cleghorn (Newcastle eccentric) (1777–1860), last of the old eccentrics of Newcastle upon Tyne"]}, {"page": "The Newcastle Eccentrics of the 19th century", "response": ["**  Billy Conolly - an alias of William Cleghorn - see William Cleghorn", "**  Cleghorn, William - see William Cleghorn", "**  Conolly, Billy - an alias of William Cleghorn - see William Cleghorn", "**  William Cleghorn", "See separate entry for William Cleghorn"]}]}}