{"wiki_id": "http://www.wikidata.org/entity/Q8005953", "itemLabel": "William Broadhead", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Broadhead", "wikipedia_page": {"main": "William Broadhead (September 1815 – 15 March 1879) was a British trade unionist and saw grinder.\nBorn in Whirlow, Sheffield, Broadhead worked as a saw grinder from childhood, later becoming the landlord of a public house in Owlerton.  He used his income from this business to support saw grinders who found themselves in difficulties, and as a result, was elected General Secretary of the Saw Grinders Union in 1848.  Under his leadership, the union grew in power, raising large sums of money for their members, and disrupting the work of non-union members.\nThis disruption took several forms, including damaging equipment, sending threatening letters, and even bombings and shootings.  Broadhead never became personally involved in this intimidation, and was able to occupy a prominent position in trade union politics, being elected to an office in the first Sheffield Association of Organised Trades in 1858, and then made Treasurer of the United Kingdom Alliance of Organised Trades in 1866.\nAs the union's struggle against unorganised labour came to national attention, its actions became known as the \"Sheffield Outrages\".  Broadhead denied all knowledge, and offered a reward for information.  In November 1866, the Sheffield Association and the London Trades Council asked Parliament to investigate.  Most union members, including Broadhead, were given certificates of immunity, so although Broadhead ultimately confessed to ordering a murder and various other crimes to be committed, he was not convicted of any.  He remained with the union, but was refused his publican's licence.  To avoid public attention, he emigrated to the United States in 1869, but returned the following year to start a new career as a grocer.", "link_mentions": [{"page": "Sheffield Outrages", "response": ["This led to a Special Commission of Enquiry into these occurrences in May 1867.The Sheffield Outrages: Report presented to the Trades Unions Commissioners in 1867, reprinted with an introduction by Sidney Pollard, Augustus Kelly, New York, 1971 Immunity was offered to all who gave evidence and, as a result a number of people were encouraged to testify. Among these was William Broadhead, the Secretary of the Sawgrinders' Union at that time, who described how he had paid two workmen £5 to murder a man called Linley who had taken on too many apprentices, which was, in practice, a method of acquiring cheap labour."]}, {"page": "Richard Congreve", "response": ["* Mr. Broadhead and the Anonymous Press, London, 1867. On William Broadhead."]}, {"page": "List of people from Sheffield", "response": ["*William Broadhead, early trade unionist"]}, {"page": "United Kingdom Alliance of Organised Trades", "response": ["The prospects for the organisation were essentially finished by the Sheffield Outrages.  Although it condemned them, it soon emerged that William Broadhead, Treasurer of the Association, was their ringleader."]}, {"page": "Sheffield Trades and Labour Council", "response": ["In September, the compositors' leader William Dronfield was elected as the trades council's first Secretary, a post he held until 1867;A. E. Musson, Trade Union and Social History Charles Bagshaw became the first President, and William Broadhead the Treasurer.  Robert Applegarth, George Austin and Joseph Rolley were also elected to the Executive. The new organisation declared itself dedicated to \"the establishment and perpetuation of a more intimate relation between all branches of the operative classes, and giving increased efficiency to the operation of trade societies.\"George Isaac Howard Lloyd, The Cutlery Trade In the first instance, it saw itself as an impartial arbiter of industrial relations, and where arbitration failed, as a supporter of its branches.  The arbitration saw successes in various trades, in Sheffield, Rotherham and Hathersage."]}, {"page": "Broadhead (surname)", "response": ["*William Broadhead (1815–1879), British trade unionist"]}, {"page": "Broadhead, William", "response": ["#redirectWilliam Broadhead"]}]}}