{"wiki_id": "http://www.wikidata.org/entity/Q8008480", "itemLabel": "William Edwards", "itemDescription": "British politician (1938-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Edwards_(British_politician)", "wikipedia_page": {"main": "William Henry Edwards (6 January 1938 – 16 August 2007), also known as \"Will Edwards\", was a British Labour politician.\nEdwards was born in Amlwch, Anglesey.  His father Henry.O.Edwards was a tenant farmer and his mother was a seamstress.  He was educated at the local Grammar School and at Sir Thomas Jones' Comprehensive School.  He read Law at Liverpool University and studied at London College of Law.  He became a solicitor in Bala and a visiting lecturer at Liverpool College of Commerce.  He married Eleri Rogers in 1962.\nEdwards contested West Flintshire in the 1964 general election. He became Member of Parliament for Merioneth at the 1966 general election, and became Parliamentary Private Secretary to the Secretary of State for Wales, Cledwyn Hughes.  He increased his majority in 1970 despite a strong challenge by future Plaid Cymru leader Dafydd Wigley.  He became a front-bench spokesman on Welsh affairs, in a team headed by George Thomas, but was sacked in 1972 over his support for entry into the European Economic Community.  He lost his seat in the February 1974 general election to Plaid Cymru's Dafydd Elis Thomas, and was unable to regain the seat in the general election that quickly followed that October.  He was then appointed to lead Labour's campaign in Wales for a \"yes\" vote in the referendum to remain in the EEC.  In 1981, he was selected to fight Ynys Môn, but withdrew in March 1983, shortly before the 1983 general election, in protest at Labour's policies of withdrawal from the EEC, unilateral nuclear disarmament,  and closure of US military bases in the UK.\nHe was a member of the Historic Buildings Council for Wales from 1971 to 1976, and began to edit The Solicitor's Diary for Waterlow's in 1973.  In 1987, a Law Society tribunal struck him off the roll of solicitors infringing the solicitors' accounts rules, and improper use of clients' funds.\nIn later life, he suffered from diabetes and heart disease.  He died in the Wrexham Maelor Hospital. He was survived by his wife and their son and three daughters.", "link_mentions": [{"page": "February 1974 United Kingdom general election", "response": ["*William Edwards (Merionethshire)"]}, {"page": "Amlwch", "response": ["* William Edwards, Labour politician, born in Amlwch (1938–2007)"]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| William Edwards"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| William Edwards"]}, {"page": "William Edwards", "response": ["William Edwards may refer to:", "*William Edwards (17th century MP), Member of Parliament for the City of Chester", "*William Edwards (architect) (1719–1789), minister and architect of the Pontypridd bridge in south Wales", "*William Edwards (inventor) (1770–1851), American inventor, grandson of Jonathan Edwards", "*William Edwards (United States Navy officer) (c. 1790–1813), officer in the United States Navy", "*William Edwards (1831–1898), American businessman and horseman", "*William Edwards (school inspector) (1851–1940), Welsh school inspector", "*William Edwards (Wisconsin politician) (1861–1944), member of the Wisconsin State Assembly and the Wisconsin State Senate", "*William Edwards (Cornwall cricketer) (born 1938), English cricketer", "*William Edwards (Kent cricketer) (1859–1947), English cricketer", "*William Edwards (British politician) (1938–2007), British Labour Party politician, MP for Merionethshire, 1966–1974", "*William Edwards (rugby union) (born 1995), English rugby union and rugby sevens player"]}, {"page": "1938 in Wales", "response": ["*6 January – William Edwards, politician (d. 2007)"]}, {"page": "List of United Kingdom MPs who died in the 2000s", "response": ["|William Edwards"]}]}}