{"wiki_id": "http://www.wikidata.org/entity/Q8006833", "itemLabel": "William Clark", "itemDescription": "English civil engineer and inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Clark_(inventor)", "wikipedia_page": {"main": "William Clark (17 March 1821 – 22 January 1880) was an English civil engineer and inventor.", "link_mentions": [{"page": "Steamroller", "response": ["An early steamroller was demonstrated by Louis Lemoine in France in 1860  and in Britain in 1863 by William Clark and partner W.F. Batho."]}, {"page": "William Clark (disambiguation)", "response": ["William Clark (1770–1838) was an American soldier and explorer; governor of Missouri Territory.", "William Clark may also refer to:", "* William Clark (stockbroker), Australian financier and racehorse owner in London", "* William Clark (artist) (1803–1883), Scottish marine painter", "* William Clark (merchant) (1670–1742), merchant and town official in Boston, Massachusetts", "* William Clark (congressman) (1774–1851), US Congressman from Pennsylvania and U.S. Treasurer", "* William Clark Jr. (1798–1871), American politician and signatory to the Texas Declaration of Independence", "* William Clark (Montgomery County, NY) (1811–1885), New York politician", "* William Clark Jr. (diplomat) (1930–2008), former United States Ambassador to India", "* William Clark, Baron Clark of Kempston (1917–2004), British politician", "* William Clark (priest) (died 1603), English Roman Catholic priest and conspirator", "* William Clark (bishop) (died 1925), Canadian Anglican bishop", "* William Clark (Anglican), Massachusetts cleric", "* William Clark (football manager), Scottish football manager", "* William Clarke (footballer, fl. 1897–1900), football player for Lincoln City and Aberdeen F.C.", "* Willie Clarke (footballer) (1878–1940), born William Clark, Scottish football player for Aston Villa, Bradford and Bristol Rovers", "* William Clark (archer) (1842–1913), American Olympic archer", "* William Clark (boxer) (1899–1988), American boxer who competed in the 1920 Summer Olympics", "* William Clark (skier) (1910–1975), Canadian skier and Olympic competitor", "* William Clark (anatomist) (1788–1869), Professor of Anatomy at Cambridge University", "* William Clark (inventor) (1821–1880), British civil engineer and inventor", "* William Clark (judge) (1891–1957), American federal judge", "* William Clarke (disambiguation)", "* William Clark Jr. (disambiguation)"]}, {"page": "List of people associated with the University of London", "response": ["* William Clark (KCL)"]}, {"page": "List of alumni of King's College London", "response": ["*William Clark – civil engineer and inventor"]}, {"page": "Walka Water Works", "response": ["The Newcastle Borough Council established a Water Committee to try to improve water supply to residents of the inner city area in February 1875 after a very dry period. In 1876, George Lloyd, the local representative in the Parliament of New South Wales raised the matter of government help to finance the construction of a water supply for Newcastle. To the surprise of many, other parliamentarians supported the motion. In 1877 Sir Henry Parkes sent noted British hydraulic engineer William Clark to advise on possible water sources for the Lower Hunter towns. Clark had been brought to NSW to advise on Sydney's water supply and drainage problems. Clark's report recommended Walka as the site for a water works which would supply 37 000 people at the estimated cost of 170 000 pounds.", "The design for the complex was undertaken by notable English engineer Sir William Clark and was a major engineering project for the area at the time. Water was pumped from the Hunter River to a reservoir along a brick tunnel approximately  in diameter and  below ground. At full operation, it had three pumping engines (150 hp each and with a flywheel weighing 36 tonnes), two horizontal compound pumps and a triple expansion surface condensing pump engine. Water would be pumped from the river at Oakhampton up to the Walka reservoir (still visible as the Walka lake today), then pumped onwards to another reservoir  away at Buttai; where it was \"gravitationally distributed\".", "William Clark, a prominent hydraulics engineer and a number of other noteworthy individuals were closely associated with the complexes design, construction and expansion.Godden & Assoc 1986: 30-31"]}]}}