{"wiki_id": "http://www.wikidata.org/entity/Q8006209", "itemLabel": "William Busfield", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Busfield", "wikipedia_page": {"main": "William Busfield (1773 – 1851) was an English politician, Whig Member of Parliament for Bradford from 1837 to his death.\nHe was the son of Johnson Atkinson M.D. and Elizabeth Busfield, his father having taken the name Johnson Atkinson Busfield after marriage, in order to pass an estate down to his heirs. Like his father, he was a justice of the peace in the West Riding of Yorkshire.\nHe was admitted to Queens' College, Cambridge in 1790, matriculating in 1791. Two brothers who also went to Cambridge were Johnson Atkinson and Currer Fothergill, who was the father of William Busfeild Ferrand (therefore William Busfield's nephew).In 1837 he was elected for Bradford and in 1840 he and his fellow Bradford M.P. Ellis Cunliffe Lister attended the World Anti-Slavery Convention in London.Busfield stood and was elected with Perronet Thompson in 1847. This was despite a lack of enthusiasm for his positions from the nonconformist vote.He married Caroline Wood, daughter of Charles Lindley Wood, 1st Viscount Halifax.", "link_mentions": [{"page": "Bradford (UK Parliament constituency)", "response": ["| William Busfield || Whig", "|rowspan=\"2\" | William Busfield || rowspan=\"2\" | Whig"]}, {"page": "Ellis Cunliffe Lister", "response": ["By 1837 Lister had erected Manningham Mill  at Manningham, Bradford for his two sons,The 1904 Bradford Art & Industrial Exhibition John and Samuel., and he took up residence there himself. In 1840 he and his fellow Bradford M.P. William Busfield attended the World Anti-Slavery Convention in London.BFASS Convention 1840, List of delegates, Retrieved 27 August 2015 In 1842 he changed his name again, this time to the triple-barrelled Ellis Cunliffe-Lister-Kay, under the will of his second wife's father, William Kay."]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|William Busfield"]}, {"page": "World Anti-Slavery Convention", "response": ["| Busfield WillWilliam BusfieldBFASS Convention 1840, List of delegates, Retrieved 27 August 2015|| UK || No || Member of Parliament "]}, {"page": "Busfield, William", "response": ["#redirectWilliam Busfield"]}, {"page": "Busfield", "response": ["*William Busfield (1773–1851), English politician"]}]}}