{"wiki_id": "http://www.wikidata.org/entity/Q8006799", "itemLabel": "William Christian Sellé", "itemDescription": "English composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Christian_Sell%C3%A9", "wikipedia_page": {"main": "William Christian Sellé (also known as Wilhelm Kristian Sellé) was a Victorian doctor of music, composer and for forty years Musician in Ordinary to Queen Victoria.", "link_mentions": [{"page": "Benhall", "response": ["*William Christian Sellé, Victorian doctor of music, composer and Musician in Ordinary (tutor) to Queen Victoria"]}, {"page": "Harry Buxton Forman", "response": ["Buxton Forman became interested in the philosophy of free thinking as expounded in the works of Auguste Comte (1798–1857) and he met his wife Laura Sellé, the daughter of the musician Dr William Christian Sellé at a positivist lecture also attended by George Eliot with whom he became acquainted. Many positivists looked to Shelley and Keats as examples of free thinking and in 1876 Buxton Forman published an edition of the Poetical Works of Shelley, followed in 1880 by Shelley's Prose Works. In 1878 he edited the Letters of John Keats to Fanny Brawne, and in 1883 the Poetical Works and Other Writings of John Keats which ran to five volumes. He proved a gifted textual editor although the criticism he printed included much that is trivial.Dictionary of National Biography, Harry Buxton Forman (1842–1917) He also contributed to the study of Shelley with an uncompleted Shelley Library that included a number of first editions and rare writings (as well as a number of his own passed-off forgeries). Other Shelley-related material included an Essay in Bibliography in 1886, the Letters of Edward John Trelawny (1910), and Thomas Medwin's Life of Shelley, the latter work being scrupulously re-edited to remove many of Medwin's inexactitudes."]}, {"page": "List of people from the London Borough of Richmond upon Thames", "response": ["|William Christian Sellé ||1813–1898|| Doctor of music and Musician in Ordinary to Queen Victoria for 44 years|| He lived at Old Palace Terrace, Richmond.||"]}, {"page": "William Christian Selle", "response": ["#REDIRECT William Christian Sellé "]}, {"page": "Selle", "response": ["* William Christian Sellé (1813–1898), Victorian doctor of music and composer"]}, {"page": "Sellé", "response": ["#REDIRECT William Christian Sellé"]}]}}