{"wiki_id": "http://www.wikidata.org/entity/Q8004898", "itemLabel": "William Babtie", "itemDescription": "Army medical officer, recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Babtie", "wikipedia_page": {"main": "Lieutenant General Sir William Babtie,  (7 May 1859 – 11 September 1920) was a Scottish recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth armed forces. His Victoria Cross is displayed at the Army Medical Services Museum in Aldershot.\nBabtie graduated from the University of Glasgow with an M.B. and also received the LRCP and LRCS from the University of Edinburgh Medical School in 1880.", "link_mentions": [{"page": "Godalming", "response": ["Sir William Babtie, recipient of the Victoria Cross, lived at Ockford House, Godalming."]}, {"page": "List of Scottish Victoria Cross recipients", "response": ["*William Babtie – 1899; Battle of Colenso, South Africa"]}, {"page": "Walter Norris Congreve", "response": ["On 15 December 1899 at the Battle of Colenso, Captain Congreve with several others, tried to save the guns of the 14th and 66th Batteries, Royal Field Artillery, when the detachments serving the guns had all become casualties or been driven from their guns. Some of the horses and drivers were sheltering in a donga (gully) about 500 yards behind the guns and the intervening space was swept with shell and rifle fire. Captain Congreve, with two other officers (The Hon. Frederick Hugh Sherston Roberts and Harry Norton Schofield), and Corporal George Edward Nurse retrieved two of the guns. All four received the VC for this action. (F.S.H. Roberts was the son in one of the two other father and son pairs of VC winners.) Then, although wounded himself, seeing one of the officers fall, Congreve went out with Major William Babtie, RAMC, who also received the VC for this action, and brought in the wounded man. His citation read:"]}, {"page": "Colenso, KwaZulu-Natal", "response": ["Buller's first attempt at crossing the river was the Battle of Colenso. From the British point of view, the battle was a fiasco.  On the western flank the British forces suffered considerable losses when the Irish Brigade were trapped in a loop in the river  upstream for Colenso.  In the centre they lost six guns while on the eastern flank, Buller ordered his men to retreat after the Boers had abandoned Hlangwane hill. Victoria Crosses were awarded to William Babtie, Walter Norris Congreve (whose son also won a VC), George Ravenhill (VC later forfeited), Hamilton Lyster Reed, Freddy Roberts, son of Lord Roberts VC (posthumous) and Harry Norton Schofield for gallantry during the battle.  Many of the British dead from the Battle of Colenso are now interred in the Ambleside Cemetery close to the point where the Irish Brigade were trapped."]}, {"page": "Special Commissions (Dardanelles and Mesopotamia) Act 1916", "response": ["*William Babtie, responsible for medical provision on the Mesopotamia front, was heavily criticised."]}, {"page": "1912 Birthday Honours", "response": ["* Surgeon-General William Babtie, , Deputy Director-General, Army Medical Service."]}, {"page": "1919 Birthday Honours", "response": ["*Maj.-Gen. Sir William Babtie "]}, {"page": "Babtie, William", "response": ["#redirectWilliam Babtie"]}]}}