{"wiki_id": "http://www.wikidata.org/entity/Q8007760", "itemLabel": "William Denison", "itemDescription": "English cricketer (1801-1856)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Denison_(cricketer)", "wikipedia_page": {"main": "William Denison (13 January 1801 – 9 March 1856) was involved with English cricket in the mid-19th century as a journalist, writer, administrator, and player.\nA \"distinguished rower\" in his youth, Denison was a member of Marylebone Cricket Club (MCC), for which he appeared in several important matches. However, although his career spanned the years 1832 to 1847, he was only an occasional player who took part in just 8 games. As a batsman, Denison scored a mere 34 runs, with a high score of 12 and average of 3.77. He was more successful as a bowler, taking 30 wickets at an average of 12.41, with best figures of 6-72. He was apparently the first player brave enough to bowl slow roundarm deliveries in important matches, for which he acquired the nickname \"Stick 'em up\" Denison.Denison is best known for being the first Honorary Secretary of Surrey County Cricket Club when it was founded in 1845, remaining in the position until 1848. He made one first-class appearance for the county, in their inaugural match, against MCC on 25–26 May 1846.He was a cricket reporter for nearly 25 years, and a regular columnist for The Era newspaper in London. He wrote for The Times in the 1840s and was also on the staff of The Sporting Magazine. Between 1844 and 1847 he produced an annual publication called The Cricketer's Companion, which provided a summary of the previous season's play. He also wrote the book, Cricket: Sketches of the Players (1846), reflecting his involvement with the All-England Eleven team.Denison died near Blackheath in London on 9 December 1856, it being noted in the press that he would be \"[r]emembered in life for his many amiable and excellent qualities, which endeared him to a large circle of friends\".", "link_mentions": {}}}