{"wiki_id": "http://www.wikidata.org/entity/Q8007267", "itemLabel": "William Crawford", "itemDescription": "British Liberal Party politician (1780-1843)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Crawford_(London_MP)", "wikipedia_page": {"main": "Wiliam Crawford (5 May 1780 – 27 April 1843) was a British Liberal Party politician who represented the City of London in the 19th century.\nCrawford was born in London to Andrew Crawford (1745–1800), formerly of Dunfermline, and his wife Mary, one of 21 daughters of the Spink family living near Northallerton, Yorkshire. The family lived at Brighton from 1783, where Andrew Crawford was Postmaster of Brighton (then \"Brighthelmston\").William Crawford spent his early career with the Honourable East India Company and made a fortune in India. He returned to England in around 1812, and was a partner in the East India Mercantile House (i.e. trading company) of Crawford, Colvin and Company. (See the Colvin family for more on the Anglo-Indian links.) He bought the estate of Pippbrook, near Dorking, Surrey in 1817 and made it his country home. From 1824 until his death, Crawford was a director of the Australian Agricultural Company. In 1827 he was High Sheriff of Surrey.\nHe had a house at Eaton Square, in the fashionable West End of London. He was a director of the Alliance Assurance Company and an alderman of the City of London in the Spectacle Makers' Company. In 1832 he stood unsuccessfully for parliament at Brighton at the general election in 1832, the first after the Reform Act. He was returned as Member of Parliament for the City of London in August 1833, and sat until he lost the seat in the Tory swing of June 1841. He was in favour of the abolition of the window tax and opposed the Corn Laws and short parliaments.  He died at Woodmansterne, Surrey and was buried in St Peter's Church there.\nCrawford married Dorothy Elizabeth Rees at Bombay on 11 January 1802. Five children were born in Bombay, and three in England. His son Robert Wigram Crawford was also MP for the City of London. His daughter Jane married Henry Ray Freshfield, and as Jane Freshfield wrote travelogues about mountaineering in the Swiss Alps.", "link_mentions": [{"page": "Dorking", "response": ["Nevertheless, Dorking was beginning to attract more affluent residents, many of whom had accumulated their wealth as businessmen in London. Charles Barclay (a Southwark brewery owner) and the bankers Joseph Denison and Thomas Hope (none of whom had any previous connection with the area) purchased the estates at Bury Hill, Denbies and Deepdene respectively. Higher-status individuals living closer to the town centre included William Crawford, the City of London MP, and Jane Leslie, the Dowager Countess of Rothes. Although the incoming landowners played little part in local commerce, they appear to have been the driving force behind schemes to pave streets and to provide gas lighting (both paid for by public subscription)."]}, {"page": "William Crawford", "response": ["William Crawford may refer to:", "* William Crawford (knight), character in epic poem about Scottish knight William Wallace", "* William Crawford (soldier) (1732–1782), soldier in American Revolution, burnt at the stake by Native Americans", "* William Crawford (Royal Navy officer) (1907–2003), British admiral", "* William Crawford (Pennsylvania politician) (1760–1823), American Representative from Pennsylvania", "* William Crawford (Virginia politician) (died 1762), politician in Virginia House of Burgesses, founder of Portsmouth, Virginia", "* William Crawford (London MP) (1780–1843), British MP for the City of London, 1833–1841", "* William Crawford (trade unionist) (1833–1890), British MP for Mid Durham, 1885–1890", "* William Crawford (Canadian politician) (1847–1897), Canadian surveyor and politician in Manitoba", "* William Crawford (judge) (1784–1849), United States federal judge", "* William Crawford (artist) (1822–1869), Scottish painter", "* William Crawford & Sons, former British biscuit company"]}, {"page": "Douglas Freshfield", "response": ["Born in London, Freshfield was the only son of Henry Ray Freshfield and his wife Jane Quinton Crawford. His father was a notable lawyer and member of the family firm of Freshfields. His mother was the daughter of William Crawford, MP for the City of London (1833–1841), who had made a fortune in the East India Company. She was an author and her publications included \"Alpine Byways\" and \"A Tour of the Grisons\" (the Swiss Alps now known as Graubünden)."]}, {"page": "City of London (UK Parliament constituency)", "response": ["| rowspan=\"2\" | William Crawford"]}, {"page": "Henry Ray Freshfield", "response": ["Freshfield married Jane Quinton Crawford on 1 October 1840. She was the daughter of William Crawford, MP for the City of London (1822-1841), who had made a fortune in the British East India Company. She was an author and her publications included \"Alpine Byways\" and \"A Tour of the Grisons\" (the Swiss Alps now known as Graubünden). Their son Douglas William Freshfield became a mountaineer and travel writer."]}, {"page": "HMS Eclair (1801)", "response": ["In May 1809 the Admiralty renamed her Pickle, the famous schooner  having been recently lost, and the Cruizer-class brig-sloop  having been launched and commissioned in 1807, and commissioned her under Lieutenant Goodwin. However, by June she was under the perhaps temporary command of Lieutenant J.G.(?) Evelyn, who on 11 June sailed for Portugal. Lieutenant Andrew Crawford was appointed to succeed Goodwin, who would die in late 1809 or early 1810 in the Royal Hospital, Plymouth.Naval Chronicle, Vol. 23, p.88. Crawford took command of Pickle in August 1809. While she was under his command, she was chiefly employed in the waters off Cadiz, Lisbon, and Guernsey.Royal Navy Service Record of Lieutenant Andrew Crawford RN. Available at The National Archives Item reference ADM 9/7/2421.Lieutenant Andrew Crawford (1782 - 1821) was the younger brother of William Crawford and the uncle of Robert Wigram Crawford (who were both East India merchantmen and London MPs)."]}, {"page": "Robert Wigram Crawford", "response": ["Crawford was the son of William Crawford, M.P. for London 1833–41, and his wife Dorothy Elizabeth Rees.  He lived in Bombay for several years, where he was a partner in the firm of Remington & Co. He then headed the firm of Crawford, Colvin, and Co., East India Merchants of London. (See the Colvin family for more on these connections.) He was chairman of the East Indian and the Mexican Railway Companies. In 1869, he became a Governor of the Bank of England, having earlier served as its Deputy Governor Black Friday (1869) occurred during Crawford's tenure as Governor. He was also a Commissioner of Lieutenancy for London, and a Fellow of the Royal Geographical Society.Debretts House of Commons and the Judicial Bench 1870"]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|William Crawford"]}, {"page": "Jane Freshfield", "response": ["Jane Quentin Crawford was born 5 July 1814. She was the daughter of William Crawford, MP for the City of London (1822-1841), who had made a fortune in the British East India Company. Her brother was Robert Wigram Crawford, also an MP."]}]}}