{"wiki_id": "http://www.wikidata.org/entity/Q8006660", "itemLabel": "William Cecil Slingsby", "itemDescription": "British mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cecil_Slingsby", "wikipedia_page": {"main": "William Cecil Slingsby (1849–1929) was an English mountain climber and alpine explorer from Carleton, North Yorkshire. Born in Bell Busk, near Gargrave, Yorkshire, Slingsby first visited Norway in 1872 and fell in love with the country. He has been called the discoverer of the Norwegian mountains, and the father of Norwegian mountaineering (insofar as he seems to be the first who actively pursued climbing in Norway and was the first person on several mountains). Together with Norway's early skilled mountain climber Kristian Bing (1862-1935), he is considered to have been a pioneer explorer of Jostedalsbreen, the largest glacier in continental Europe.Slingsby is perhaps most famous for being the first on \"Storen\", or Store Skagastølstind (7,890 feet (2,405 m) in 1876, the third highest mountain in Norway. It was considered impossible to climb then, but Slingsby defied popular notion and climbed the mountain, for the last part alone. Slingsby also attempted to climb the 1392metres tall and highly steep Stetind in Narvik, but his attempt ended up as a failure, as he never made it to the peak of the mountain. Slingsby would later describe this mountain as the ugliest one he had ever seen. \nHis crossing of the 5,800-foot (1,800 m) Keiser Pass, Norway, on skis in 1880 also helped inspire the sport of ski mountaineering. \nHe also spoke and wrote strongly about several other mountains for example Slogen. His classic book on climbing in Norway, Norway: the Northern Playground, was first published in 1904 and republished in 1941. A new edition was released in 2003. The latest edition was published in March 2014.\nSlingsby was an honorary member of Norsk Tindeklub and of the Norwegian Trekking Association. He had five children; the youngest, Eleanor Winthrop Young, was herself a climber and a co-founder of the Pinnacle Club, a women's climbing association.Cecil died  on 23 August 1929 in a nursing home at Hurstpierpoint, in East Sussex. He is buried in the churchyard at Carleton-in-Craven.", "link_mentions": [{"page": "List of climbers and mountaineers", "response": ["* William Cecil Slingsby (1849–1929) UK, first ascent Store Skagastølstind (1876), pioneer of Norwegian mountaineering"]}, {"page": "William Cecil", "response": ["* William Cecil Slingsby (1849–1929), English mountain climber and alpine explorer"]}, {"page": "J. Norman Collie", "response": ["Collie's professional career was spent as a scientist but his avocation was mountaineering. Among mountaineers, he is perhaps best remembered for his pioneering climbs on the Cuillin in the Isle of Skye, but he also climbed in the English Lake District and in the Alps with William Cecil Slingsby, Geoffrey Hastings and Albert F. Mummery."]}, {"page": "Western Norway", "response": ["Western Norway is highly mountainous; in less than 10 kilometers from the Sognefjord, there are peaks that are over 2000 meters in height. The highest point is Store Skagastølstind (also known as Storen), which is 2,405 meters high. It is situated on the border between the municipality of Luster and Årdal and is part of the Hurrungane range. The summit is a destination for mountaineers but is fairly difficult. First ascent by William Cecil Slingsby on 21 July 1876. There are a number of different routes, the most common being Heftye's renne (Heftye's couloir). Another route of ascent is via Andrew's renne (Andrew's couloir), first ascent A. W. Andrews and party in 1899. Store Skagastølstind and the mountaineering of the late 19th century in Norway is traditionally linked to the historical hotel Turtagrø."]}, {"page": "Romsdalen", "response": ["Tourism and angling in the Rauma river became an important business during the 19th century, wealthy Englishmen were the most important visitors. General William Bromley-Davenport purchased Fiva farm in 1849 and the 12 best kilometers of the river. Norway's first golf course was laid out in 1905 at Hølgenes hotel (later named Park hotel) by the English owner. The Romsdalen valley and the Romsdalen Alps are one of the most important climbing venues in Norway and Northern Europe. The steep and demanding Trollveggen is a classic in Norwegian rock face climbing. William Cecil Slingsby visited Romsdalen in 1875 and later. Arne Randers Heen was a local climber with several first ascents."]}, {"page": "Slogen", "response": ["Legend has it that Slogen was first climbed in 1870 by Jon Klokk. Later on that year it was climbed by the famous climber and alpine explorer William Cecil Slingsby. The latter wrote about the view from Slogen as \"one of the proudest in Europe\"."]}, {"page": "Albert F. Mummery", "response": ["Mummery is best remembered for his pioneering efforts in mountaineering. Initially, he climbed with mountain guides, but with his companions William Cecil Slingsby, Geoffrey Hastings and J. Norman Collie he was part of the movement which revolutionized alpinism by the practice of guideless climbing. He invented the Mummery tent, a type of tent used in the early days of mountaineering."]}, {"page": "Store Skagastølstind", "response": ["The summit is a popular destination for mountaineers, but it is fairly difficult to climb. The first ascent was made by William Cecil Slingsby on 21 July 1876. There are a number of different routes, the most popular being Heftyes renne (Heftye's couloir).  Another popular route of ascent is via Andrews renne (Andrew's couloir), used in the first ascent of A. W. Andrews and party in 1899. Store Skagastølstind and the mountaineering of the late 19th century in Norway is traditionally linked to the historical hotel Turtagrø."]}, {"page": "Lyngen Alps", "response": ["The Lyngen Alps () are a mountain range in northeastern Troms og Finnmark county in Norway, east of the city of Tromsø. The mountain range runs through the municipalities of Lyngen, Balsfjord, and Storfjord. The mountains follow the western shore of the Lyngen fjord in a north-south direction. The length of the range is at least  (depending on definition—there are mountains all the way south to the border with Sweden) and the width is . The mountains dominate the Lyngen Peninsula, which is bordered by the Lyngen fjord to the east, and the Ullsfjorden to the west. The British climber William Cecil Slingsby was the first to climb many of the peaks."]}, {"page": "List of first ascents", "response": ["|  || Store Skagastølstind || 2405 || Scandinavian Mts ||  || William Cecil Slingsby ||  || "]}, {"page": "Torfinnstindene", "response": ["The Eastern summit was reached for the first time in 1876 by Emmanuel Mohn, William Cecil Slingsby and Knut Lykken. The two first being mountaineers from Christiania and Great Britain, and the third the local expert. In 1894 the middle summit was climbed by, Andreas Saxegaard, Therese Bertheau, Antonette Kamstrup and Tostein Røine, the last one being the local expert. The western summit, which is the easiest to climb, was visited for the first time in 1912 by Rolv Ødegaard"]}, {"page": "Stetind", "response": ["Neither group succeeded, but Carl Hall built a cairn on the lower summit about  southeast of the main summit. That cairn is now called Halls fortopp (elevation ). In 1904, William Cecil Slingsby also failed to reach the summit."]}, {"page": "Store Venjetinden", "response": ["The first ascent was via the northeast ridge in 1881 by William Cecil Slingsby and Johannes Vigdal.  The first ascent via the western ridge was in 1930 by Erik Heen and Karl Oshaug."]}, {"page": "Jervvasstind", "response": ["The first recorded ascent was by William Cecil Slingsby and Emanuel Mohn in 1876. The first winter ascent was by Arne Randers Heen and Ernst Bakke in 1953."]}, {"page": "Store Knutsholstinden", "response": ["William Cecil Slingsby did the first ascent of the taller Store Skagastølstind in 1876 which was hailed as a major achievement, and Heftye soon felt it eclipsed his own first ascent of Store Knutsholstinden the year before. He set out to ascend Store Skagastølstind in 1880 and successfully used the popular route that is now named after him to reach the summit. His main claim was that Store Knutsholstind was at least as difficult as Storen, thus, must be regarded a first grade mountain."]}, {"page": "Therese Bertheau", "response": ["She was an active mountaineer 1884 to 1910  and climbed over 30 peaks. She achieved many first ascents, as well as being the first woman on Store Skagastølstind (2405m) in 1894. In 1900 she was again  on Store Skagastølstind accompanied by English mountain climber William Cecil Slingsby (1849-1929). In 1904 she took the first known ascent of the walls at Kolsås with Norwegian mountain climber Henning Tønsberg (1907–1987). In 1902 she was elected as the first woman in the Norwegian Tourist Association Board, and in 1909 she was invited member of the Norwegian Alpine Club, which previously had not been open to women.  "]}, {"page": "Emanuel Mohn", "response": ["He enrolled in higher education during 1864 at the University of  Christiania and graduated with the cand.mag. degree in 1869. He worked as a school teacher in Bergen, Stavanger, Christiania and Aalesund before holding his final job at Bergen Cathedral School from 1884 to 1889. He is best known as a contributor to the popularity of outdoors life in Norway, specifically mountaineering. He wrote in the yearbook of the Norwegian Trekking Association between 1871 and his death, and was also an illustrator. He ascended several mountains, but one of the downpoints came when he, trekking together with William Cecil Slingsby, did not manage to first ascend the Store Skagastølstind. He does hold co-credit for the first ascent of other mountains, such as Torfinnstindene."]}, {"page": "Aiguille du Grépon", "response": ["* 4 August 1893: Lily Bristow is the first woman to climb the Grépon, traversing it with Mummery and William Cecil Slingsby, while taking pictures on the way"]}, {"page": "Harry Fox (sportsman)", "response": ["Fox was also a keen mountaineer; having started mountain climbing in 1884, he joined the Alpine Club the following year. He received training initially from William Woodman Graham and then William Cecil Slingsby. According to an article in The Times, he was well regarded by his peers as \"a climber of great skill and daring\". He was a very experienced alpine climber, and often climbed without guides, ascending Aiguille du Dru, Fletschhorn, Ober Gabelhorn amongst others in this fashion. With guides, he climbed some of the toughest mountains in the Alps, such as the Matterhorn and the Eiger."]}, {"page": "Strupbreen", "response": ["The glacier and its associated ice-dammed lake were investigated by the University of Leicester Arctic Norway Expedition in 1969. Publications arising from this include work on the size and retreat of Strupbreen and on the drainage of the lake Strupvatnet. The ice dammed lake, Strupvatnet, was first explored by the English climbers William Cecil Slingsby and Geoffrey Hastings and the Norwegian Elias Hogrenning in 1898."]}, {"page": "Turtagrø", "response": ["The first hotel at Turtagrø was built in 1888 by mountain guide Ola Berge. Later the same year a second hotel was built by Ole Øiene, only 100 metres apart. Turtagrø was a central meeting place for the pioneers of mountaineering in Jotunheimen from the late 1800s, and among the early visitors were William Cecil Slingsby, Howard Priestman and Carl Hall. The two hotels merged in 1911, when Berge bought the other hotel from Øiene. After Berge's death in 1928, his daughter Kari Berge was running the hotel.Thommessen; Skogheim; Kuyper 1995, p. 59-60 The road Sognefjellsvegen, which passes Turtagrø, was finished in 1938. In 1938 the climbing association Norsk Tindeklub also built their own cabin in Skagadalen, and these events eventually contributed to a change in Turtagrø's role and the type of visitors.Lauritzen 1997, p. 68-69"]}, {"page": "William Slingsby (disambiguation)", "response": ["*William Cecil Slingsby"]}, {"page": "Slingsby (surname)", "response": ["*William Cecil Slingsby (1849–1929), English mountain climber and alpine explorer"]}, {"page": "Eleanor Winthrop Young", "response": ["Eleanor Slingsby was born in 1895 in Carleton-in-Craven, West Riding of Yorkshire. She was the youngest of five children born to William Cecil Slingsby (1849–1920), a mill owner and climber with extensive experience in Norway who became known as \"the father of Norwegian mountaineering\". Slingsby introduced each of his children to climbing at a young age around their local village."]}, {"page": "Nikka Vonen", "response": ["Vonen's first folklore tales were printed anonymously in 1865–66, and she had 24 tales printed in Dølen in 1868–69, under the headers \"Æventyr fraa Sunnfjord\" and \"Segner fraa Sunnfjord, fortalde av gamle Synnve\". She wrote using Danish language herself, but supported the Nynorsk movement, and was the first female member of the Nynorsk language society . She attended several \"girls' schools\" over the years, and graduated as teacher from Nissen's Girls' School in the late 1860s. She co-founded a school for girls in Dale in 1869, , and chaired the school from 1871 to 1907. Vonen made hiking trips in Jotunheimen along with mountain pioneers such as Emanuel Mohn, Ernst Sars and William Cecil Slingsby, and she was among the first women to ascend Galdhøpiggen. She contributed to the women's magazine Urd, and supported the movement for women's rights."]}, {"page": "Bell Busk", "response": ["*William Cecil Slingsby - noted mountaineer, was born in the village"]}, {"page": "Geoffrey Hastings", "response": ["* Text of William Cecil Slingsby's Norway, the Northern Playground"]}]}}