{"wiki_id": "http://www.wikidata.org/entity/Q8004573", "itemLabel": "William Arthur", "itemDescription": "King's botanist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Arthur_(botanist)", "wikipedia_page": {"main": "William Arthur (1680 - 1716) was a Scottish doctor who served as Regius Keeper of the Royal Botanic Garden and King's Botanist at Edinburgh. Shortly afterwards he was deeply implicated in the Jacobite rising of 1715. He fled to Italy, where he died the following year \"from a surfeit of figs.\"", "link_mentions": [{"page": "Her Majesty's Botanist", "response": ["* 1715: Dr William Arthur"]}, {"page": "William Arthur", "response": ["William Arthur may refer to:", "* William Arthur (botanist) (fl. 1715), Scottish botanist", "*William Arthur (clergyman) (1796-1875),  Irish-born American Baptist minister and father of President Chester A. Arthur", "* William Arthur (minister) (1819–1901), Wesleyan Methodist minister and author", "* William Arthur (mathematician) (1894–1979), British mathematician", "* William Arthur (Royal Navy) (1830–1886), British naval officer"]}, {"page": "Sir John Clerk, 1st Baronet", "response": ["He married twice. With his first wife, Elizabeth, daughter of Henry Henderson, of Elrington, he had three sons and three daughters including Barbara. His son-in-law, Barbara's second husband, Dr. William Arthur, became embroiled in the Jacobite Rising of 1715. With his second wife, Christian, daughter of the Reverend James Kilpatrick, he had four sons and four daughters. He died in 1722, and was succeeded by his eldest son Sir John Clerk, 2nd Baronet."]}, {"page": "Jacobite rising of 1715", "response": ["In northern Scotland, the Jacobites were successful. They took Inverness, Gordon Castle, Aberdeen and further south, Dundee, although they were unable to capture Fort William.Michael, p. 158. In Edinburgh Castle, the government stored arms for up to 10,000 men and £100,000 paid to Scotland when she entered the Union with England. Lord Drummond, with 80 Jacobites, tried under the cover of night to take the Castle, but the authorities in Edinburgh learned of their plans and successfully defended it. It was subsequently alleged that this plot was organised by Dr. William Arthur, the King's Botanist and brother-in-law of prominent Scottish Whig, Unionist and Hanoverian Sir John Clerk, Baron Clerk."]}, {"page": "Regius Keeper of the Royal Botanic Garden Edinburgh", "response": ["*William Arthur (1715)"]}]}}