{"wiki_id": "http://www.wikidata.org/entity/Q8007712", "itemLabel": "William Dean", "itemDescription": "British cricketer (1928-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Dean_(Somerset_cricketer)", "wikipedia_page": {"main": "William Frederick \"Bill\" Dean (3 January 1926 – 18 September 1994) was a cricketer who played one first-class match for Somerset in 1952 and whose identity remained mysterious for many years until the publication of a book in 2018. Earlier publications and cricket websites had equated Dean with another Yorkshireman, a William Henry Dean, born in Leeds on 25 November 1928 with no known date of death.Dean was a right-handed batsman and a right-arm fast-medium bowler. Along with fellow Yorkshireman Malcolm Walker, he was picked by Somerset for the match against the touring Indian side at the County Ground, Taunton from 28 May 1952. Somerset batted first and reached 193 for eight wickets when Dean batted at No 10, joining all-rounder Johnny Lawrence, who had recommended him to the county. The pair put on 133 for the ninth wicket, only 13 short of the county side's then ninth wicket record, and Lawrence made an unbeaten 103, his first century after six years of county cricket. Dean made 21 before being bowled by Vijay Hazare.\nWhen the Indians batted, Dean opened the bowling, but spin bowlers took the wickets. In Somerset's second innings, Dean came in just before the declaration and was unbeaten without scoring. He again failed to take wickets in India's second innings, bowling four overs for just four runs.\nThis match proved to be Dean's only taste of first-class cricket. Somerset had scope to offer only one special registration contract, and it went to Walker, whose batting had failed but who had taken three wickets; Dean departed the county and never played first-class cricket again.", "link_mentions": [{"page": "List of Somerset County Cricket Club players", "response": ["* William Dean (1952) 1 match CA"]}, {"page": "Johnny Lawrence", "response": ["In 1951, he scored 1,000 runs in a season for the first time, reaching 1067 at an average of less than 21. The following year, 1952, his average rose to 25 on the back of a lot of not-out innings, and he missed the 1,000 runs. But in this season he scored the first two centuries of his career. His first was an unbeaten 103 against the Indians at Taunton, when he batted at No 9 and shared a ninth-wicket partnership of 133 with William Dean, whose only first-class match this was. It was the 306th innings of Lawrence's first-class career, and two months later, again batting at No 9, he followed it with a second century, 111, made against Essex at Taunton. He was Somerset's leading wicket-taker too in 1952, but his 78 wickets cost 30.45 runs each."]}, {"page": "William Dean", "response": ["* William Dean Howells (1837–1920), American novelist and playwright", "* William Dean (Hampshire cricketer) (c. 1882–?), Australian cricketer", "* Dixie Dean (William Dean, 1907–1980), English footballer", "* William Dean (Somerset cricketer) (1926–1994), English cricketer", "* William Dean (priest) (died 1588), English priest and martyr", "* William Dean (engineer) (1840–1905), British railway engineer", "* William Dean Chocolates, American confectioner", "* William Deane (born 1931), Governor-General of Australia from 1996 to 2001"]}, {"page": "William Dean (cricketer, born 1928)", "response": ["#REDIRECT William Dean (Somerset cricketer)"]}]}}