{"wiki_id": "http://www.wikidata.org/entity/Q8007288", "itemLabel": "William Creswick", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Creswick", "wikipedia_page": {"main": "William Creswick (27 December 1813 – 17 June 1888) was an English actor.  A popular tragedian on the London stage, he appeared with many leading actors of his day, including William Charles Macready, Edwin Booth and Fanny Kemble and was well known for his Shakespearean and melodrama roles in Britain, the U.S. and Australia.", "link_mentions": [{"page": "John Courtney (playwright)", "response": ["Life's Seasons or Hearts and Homes co-written by William Creswick", "Off to the Diggings  co-written by William Creswick and R Shepherd", "Uncle Tom's Cabin  co-written by William Creswick and William Bodham Donne", "The Students or Sorry adapted from the French play \"The Students of D’Orilly\".William Creswick played Roger D’Orilly"]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* William Creswick (1813–1888)"]}, {"page": "Creswick (disambiguation)", "response": ["* William Creswick (1813–1888), English actor"]}, {"page": "Creswick, William", "response": ["#redirectWilliam Creswick"]}, {"page": "Royal Victoria Theatre, Sydney", "response": ["Operas, dramas, burlesques, pantomimes and other amusements were held. George Coppin made his Australian debut in the theatre in 1843. Other performers seen during the theatre's history included Lola Montez, Gustavus Vaughan Brooke, Anna Bishop, George Darrell and William Creswick. The first opera written, composed and produced in Australia, Don John of Austria, premiered there in May 1847.Program notes, Sydney Symphony Orchestra, October 2007"]}, {"page": "Charles Cartwright", "response": ["Arriving back in London in 1881, Cartwright joined William Creswick's company at the Surrey Theatre for a Shakespearean revival season, before joining Edwin Booth’s 1882 tour in the north of England. In Liverpool, he appeared as Troy in J Commyns Carr’s adaptation of Far From the Madding Crowd. The popular adaptation, in which Thomas Hardy was personally involved, premiered on 27 February 1882, before going on a provincial tour and then transferring to London."]}, {"page": "Frederick William Robinson", "response": ["Among his later works of fiction are Anne Judge, Spinster (1867), No Man's Friend (1867) and The Courting of Mary Smith (1886). Poor Humanity (1868) was dramatised by the author and played with some success at the Surrey Theatre with William Creswick in the chief role, a returned convict."]}, {"page": "W. J. Holloway", "response": ["Holloway leased the Theatre Royal (Hobart) and assembled a \"Star Dramatic Company\" in 1878–9 to support William Creswick and Helen Ashton, playing Sheridan Knowles' Virginius and The Hunchback and several Shakespeare classics. Its members included his brother Charles Holloway."]}, {"page": "H. H. Vincent (actor)", "response": ["In 1878 Vincent worked in Australia for the first time, and after appearing in Melbourne, he went to New Zealand, touring in a wide range of mostly Shakespearean roles with William Creswick's company, for which in addition to acting, he was stage manager.\"Theatre Royal\", Lyttelton Times, 22 March 1879, p. 1 When the theatrical firm Williamson, Garner and Musgrove was formed in 1882 Vincent was its first general manager, presiding over the firm's theatres in Melbourne and Sydney and four or five touring companies until 1890.\"Obituary\", The Stage, 29 October 1913, p. 29"]}, {"page": "G. B. W. Lewis", "response": ["One of Lewis's coups was securing the veteran actor William Creswick, who played at the Academy from August 1877 to 11 December with plays such as Sheridan Knowles' Virginius and William Tell to Shakespearean dramas and the comedy The Jealous Wife to full houses. In preparation for his return, Lewis in July 1878 also took the lease of the Opera House, making considerable improvements. The Creswick season, from 7 September to 23 November, mostly Shakespeare tragedies but also favorites such as A New Way to Pay Old Debts. and Robertson's Ours."]}]}}