{"wiki_id": "http://www.wikidata.org/entity/Q8018264", "itemLabel": "William Selby Lowndes", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Selby_Lowndes", "wikipedia_page": {"main": "William Selby Lowndes (c. 1767 – 18 May 1840) was a United Kingdom Member of Parliament.\nThe Lowndes family were conservative Anglican landowners in the English county of Buckinghamshire. This gentry family was prominent in the county during the eighteenth and nineteenth centuries. Richard Lowndes had represented Buckinghamshire in Parliament between 1741 and 1774.", "link_mentions": [{"page": "Robert Carrington, 2nd Baron Carrington", "response": ["He was then elected MP for Buckinghamshire, succeeding William Selby Lowndes, and serving with the Marquess of Chandos. He was succeeded by John Smith, another uncle, in 1831."]}, {"page": "Buckinghamshire (UK Parliament constituency)", "response": ["|rowspan=\"3\"|William Selby Lowndes || rowspan=\"3\"| Whig"]}, {"page": "William Lowndes", "response": ["* William Selby Lowndes (c. 1767–1840), British Member of Parliament"]}, {"page": "Henry Guy (politician)", "response": ["His first appointment about the court was to the post of cupbearer to the queen, but he was soon admitted among the boon companions of Charles II. On the resignation in 1675 of Colonel Silas Titus, he became Groom of the Bedchamber, but sold his office by November 1679 to Thomas Neale. In March 1679 he was appointed secretary to the Treasury, and the payments from the public funds passed through his hands until Christmas 1688. John Yonge Akerman edited, from a manuscript in the possession of William Selby Lowndes, for the Camden Society in 1851, as vol. lii. of their publications, details of secret service funds of Charles II and James II from 30 March 1679 to 25 December 1688; it was an account rendered by Guy some time after the accession of William III. In the Correspondence of Henry, Earl of Clarendon (ed. 1828) are particulars of sums paid to him for secret service money for one year, to 7 March 1688."]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|3 January 1810||Buckinghamshire||u*||Marquess of Titchfield||William Selby Lowndes||Succeeded to a peerage"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Marquess of Titchfield –  succeeded to a peerage Replaced by William Selby Lowndes  1810"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["|     William Selby Lowndes   "]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| William Selby Lowndes   "]}]}}