{"wiki_id": "http://www.wikidata.org/entity/Q8015746", "itemLabel": "William Monteith", "itemDescription": "British soldier, diplomatist and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Monteith", "wikipedia_page": {"main": "William Monteith, R.A., K.L.S., F.R.S., F.R.G.S. (22 June 1790 – 18 April 1864) was a British soldier, diplomatist and historian, associated with the East India Company.", "link_mentions": [{"page": "Anglo-Russian War (1807–1812)", "response": ["During the Russo-Persian War (1804–1813), several British officers, part of Sir John Malcolm's 1809 embassy to Persia, remained in that country, providing training to the reforming Persian army. One of the British officers, William Monteith, accompanied Abbas Mirza on his unsuccessful campaign in Georgia and then commanded a frontier force and the garrison of Erivan."]}, {"page": "Prince Alexander of Georgia", "response": ["In September 1812, Alexander crossed into Kakheti with some 100 followers to invigorate an anti-Russian movement in the region. His force of Georgian rebels and Dagestani auxiliaries fought a series of engagements with the Russian troops until its final defeat at the hands of General Dimitri Orbeliani in November 1812. In the meantime, in October 1812, General Pyotr Kotlyarevsky decisively defeated Abbas Mirza's attempt to advance towards Georgia in the battle of Aslanduz. According to the British officer William Monteith, who knew Alexander personally and accompanied him during his raid into Georgia, the rebellious prince, finding it impossible to raise the means of paying his Lezgian auxiliaries, had to consent to their carrying of Georgian slaves. As a result, Alexander's army was disbanded and he fled to the Khevsur highlanders. The Russians under General Stahl proceeded with ravaging the Khevsur villages, putting Alexander into flight to the Avars and other mountainous tribes of the Caucasus. The Russian authorities vainly pressured the mountaineers into surrendering the fugitive prince; they evinced toward him, in the words of Monteith, \"a fidelity equal to that of the Highlanders towards Charles Edward under similar circumstances after the battle of Culloden.\"", "Sir Robert Ker Porter, who saw Alexander in Tabriz in 1819 and noted his \"bold independence of spirit\" and irreconcilability to the Russian possession of Georgia, compared the refuge prince to \"the royal lion hunted from his hereditary waste, yet still returning to hover near, and roar in proud loneliness of his ceaseless threatening to the human strangers who had disturbed his reign\". William Monteith recalled that Alexander \"never showed any pride of birth, nor did he gave way to useless regrets for the loss of his fortune and princely dignity, though he had no hesitation in talking of his adventures, or giving any information that was asked for concerning them.\""]}, {"page": "Monteith", "response": ["* William Monteith (1790–1864), British soldier and historian"]}, {"page": "Meghri", "response": ["In 1810, young British army officer William Monteith visited the region as part of his service with the British embassy to Persia. His 1856 memoirs paint a vivid picture of the Meghri valley which he describes as a romantic glen that he rates as one of the most beautiful in Persia, or indeed in any country. He notes that in former times [it] has evidently been densely peopled for churches, abandoned but still perfect, are thickly scattered on the slopes of the mountains, which here rise to a height on the western side of 8000 to 10,000 feet, covered with forests. The trees are of no great size, and much interspersed with apple, pear, and walnut, probably the remains of former gardens, or produced by seeds carried by the birds and wind into the once cultivated land."]}, {"page": "List of fellows of the Royal Society M, N, O", "response": ["| William Monteith||13/02/1845||22 June 1790 – 18 April 1864"]}, {"page": "Prince Levan of Georgia", "response": ["The loss of his favorite son was a blow to the aging King Heraclius and the regular army which Levan had commanded gradually crumbled after his death. The 19th-century British historian and Indian Army officer William Monteith, who met Heraclius's son, Alexander, in Iran in the 1820s, wrote of Levan: \"He appeared to be endowed with most of the better qualities and much of the talent of his father, who might have hoped to find in him a successor capable of governing his distracted country; but he was assassinated at Telav by a Georgian, and with him perished the last hopes of Heraklius.\""]}, {"page": "Monteith, William", "response": ["#redirectWilliam Monteith"]}, {"page": "Charles Christie (officer)", "response": ["Christie was ordered with training the Iranian infantry (sarbaz) and became the commander of the Shaqaqi Regiment, one of the twelve new regiments (Nezam-e Jadid) in the province of Azerbaijan. Christie fought on the Iranian side against the Russians during the Russo-Persian War of 1804–1813. However, in 1812, Britain and Russia had reconciled, which meant that Britain was withdrawing its support from Iran. Christie, two other British officers (Henry Lindsay and William Monteith) and thirteen sergeants were allowed to remain in the Iranian service at the request of Crown Prince Abbas Mirza, commander of the Iranian army. Christie and Lindsay both participated in the Battle of Sultanabad (13 February 1812), in which the Iranian army achieved a victory. During the battle, Christie and Lindsay reportedly threw themselves into the thick of it, thereby gaining the admiration of the Iranians and proving that they would not refrain from attacking fellow Christians."]}]}}