{"wiki_id": "http://www.wikidata.org/entity/Q8017103", "itemLabel": "William Proby, Lord Proby", "itemDescription": "Royal Navy officer and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Proby,_Lord_Proby", "wikipedia_page": {"main": "William Allen Proby, Lord Proby (19 June 1779 – 6 August 1804) was a British Royal Navy officer and Whig politician.", "link_mentions": [{"page": "Earl of Carysfort", "response": ["Earl of Carysfort was a title in the Peerage of Ireland. It was created in 1789 for John Proby, 2nd Baron Carysfort. The Proby family descended from Sir Peter Proby, Lord Mayor of London in 1622. His great-great-grandson John Proby represented Huntingdonshire and Stamford in the House of Commons. His son and namesake John Proby was a Whig politician and notably served as a (civilian) Lord of the Admiralty. In 1752 he was raised to the Peerage of Ireland as Baron Carysfort, of Carysfort in the County of Wicklow. He was succeeded by his son, the second Baron. He was also a politician and was created Earl of Carysfort in the Peerage of Ireland in 1789. In 1801 he was further honoured when he was made Baron Carysfort, of the Hundred of Norman Cross in the County of Huntingdon, in the Peerage of the United Kingdom, which gave him a seat in the British House of Lords. His eldest son and heir apparent, William Proby, Lord Proby, predeceased him."]}, {"page": "List of Old Rugbeians", "response": ["* William Proby, Lord Proby, a British Royal Navy officer and Whig politician"]}, {"page": "Records of members of parliament of the United Kingdom", "response": ["|Captain||William Proby, Lord Proby||1779||1804||Died of yellow fever at Suriname during Napoleonic Wars||Whig||Buckingham (1802-death)||Eldest son of John Proby, 1st Earl of Carysfort hence Lord Proby."]}, {"page": "Thomas Staines", "response": ["Peterels next captain was Commander William Proby, Lord Proby, who took over in March 1797. In June 1797, Wodehouse authorised Staines to take 20 men in two of the ship's boats to cut out a French privateer that had been preying on merchant vessels off the coast of Tuscany. After a skirmish in which the British had five men wounded and the French lost several dead and wounded, the British took the privateer, which had a crew of 45 men and was armed with two long guns and several swivels."]}, {"page": "HMS Carysfort (R25)", "response": ["Her name was changed to conform with the initials \"Ca\" to her seven sister ships. She is named after John Proby, a politician who was also a Lord of the Admiralty in 1750. In 1752 he was created Baron Carysfort. His son, William Proby, Lord Proby, and his grandson, Granville Proby, 3rd Earl of Carysfort, were both naval officers, the latter eventually became an Admiral. She was the fifth Royal Navy warship to carry the name Carysfort. She was built and engined by J. Samuel White & Co. The keel was to be laid down on 4 May 1943 but was delayed until 12 May 1943 because of German bombing raids. She was launched on 25 July 1944 and completed on 20 February 1945. Her original pennant number was R25 changing to D25 after the Second World War."]}, {"page": "Proby", "response": ["*William Proby, Lord Proby (1779–1804), British Royal Navy captain and politician"]}, {"page": "Lancelot Holland (British Army officer)", "response": ["In 1799 Holland accompanied Robert Craufurd who had been sent as military attaché on a mission in continental Europe, part of William Pitt's Grand Design for the War of the Second Coalition. Craufurd's other aide on this journey was William Proby, Lord Proby. That year Holland was promoted to captain. Craufurd married Holland's sister Mary Frances, in 1800."]}]}}