{"wiki_id": "http://www.wikidata.org/entity/Q8014327", "itemLabel": "William Lascelles", "itemDescription": "British politician (1798-1851)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lascelles", "wikipedia_page": {"main": "William Saunders Sebright Lascelles PC (29 October 1798 – 2 July 1851) was a British Whig politician. He served as Comptroller of the Household from 1847 to 1851.", "link_mentions": [{"page": "Victor Cavendish, 9th Duke of Devonshire", "response": ["Cavendish was born in the Marylebone area of London, England, the eldest son of Lord Edward Cavendish, himself the third son of the 7th Duke of Devonshire, and Emma Lascelles, both the daughter of William Lascelles and Lord Edward's cousin. Cavendish's younger brother was Lord Richard Cavendish and his uncles were Spencer Cavendish, Marquess of Hartington (later the eighth Duke of Devonshire) and Lord Frederick Cavendish."]}, {"page": "George Howard, 6th Earl of Carlisle", "response": ["# Lady Caroline Georgiana Howard (1803–1881), who married William Lascelles, Comptroller of the Household."]}, {"page": "Earl of Harewood", "response": ["Several other members of the family have also gained distinction. Francis Lascelles was a Commissioner in the High Court of Justice for the trial of King Charles I although did not sign the death warrant, whilst Francis' brother was Thomas Lascelles, who served in the Parliamentarian Army. Daniel Lascelles, son of the aforementioned Francis Lascelles, was member of parliament for Northallerton. Henry Lascelles, second son of the aforementioned Daniel Lascelles, was Member of Parliament for Northallerton and a Director of the Honourable East India Company. He was the father of 1) the first Baron of the 1790 creation, and 2) Daniel Lascelles, represented Northallerton in Parliament. The Honourable William Lascelles, third son of the second Earl, was a Whig politician. His third son Sir Frank Lascelles, was British Ambassador to Russia and to Germany. Sir Francis William Lascelles, son of Henry Arthur Lascelles, fourth son of the aforementioned William Lascelles, was Clerk of the Parliaments between 1953 and 1958. Edwin Lascelles, fourth son of the second Earl, sat as member of parliament for Ripon. Sir Alan Lascelles, son of the Honourable Frederick Canning Lascelles, second son of the fourth Earl, was Private Secretary to both George VI and Elizabeth II. Sir Daniel Lascelles, son of the Honourable William Horace Lascelles, eighth son of the fourth Earl, was a diplomat.  "]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Hon. William Lascelles (1798–1851)"]}, {"page": "Comptroller of the Household", "response": ["* 1847–1851: Hon. William Lascelles"]}, {"page": "Rt. Hon. William Saunders Sebright Lascelles", "response": ["#REDIRECT William Lascelles"]}, {"page": "Wakefield (UK Parliament constituency)", "response": ["| William Lascelles", "| William Lascelles"]}, {"page": "First Russell ministry", "response": ["|William Lascelles||23 July 1847"]}, {"page": "Henry Lascelles, 3rd Earl of Harewood", "response": ["*Hon. Egremont William Lascelles (1825–1892), married Jessie Malcolm and had issue."]}, {"page": "Lord Richard Cavendish (1871–1946)", "response": ["A prominent figure from the Cavendish family, he was a younger son of Lord Edward Cavendish, third son of the 7th Duke of Devonshire. The 8th Duke of Devonshire was his uncle and the 9th Duke of Devonshire his elder brother. His mother was Emma Elizabeth, daughter of the Hon. William Lascelles. He was educated at Eton and Trinity College, Cambridge, where he was a member of the Pitt Club."]}, {"page": "East Looe (UK Parliament constituency)", "response": ["|rowspan=\"2\"|William Lascelles|| rowspan=\"2\"|Tory"]}, {"page": "Charles Cavendish, 3rd Baron Chesham", "response": ["A member of the Cavendish family headed by the Duke of Devonshire, Chesham was the eldest son of William Cavendish, 2nd Baron Chesham and his wife Henrietta Frances Lascelles, daughter of William Lascelles. He was educated at Eton College."]}, {"page": "William Cavendish, 2nd Baron Chesham", "response": ["On 24 July 1849, Lord Chesham married Henrietta Frances Lascelles (1830–1884) at Kensington Church in London. She was a daughter of Comptroller of the Household Right Hon. William Lascelles (third son of Henry Lascelles, 2nd Earl of Harewood) and his wife Lady Caroline Georgiana Howard (a daughter of George Howard, 6th Earl of Carlisle). Together, they were the parents of:"]}, {"page": "Northallerton (UK Parliament constituency)", "response": ["|rowspan=\"2\" |William Lascelles", "|William Lascelles|| Tory"]}, {"page": "Knaresborough (UK Parliament constituency)", "response": ["| William Lascelles"]}, {"page": "List of sportsperson-politicians", "response": ["|data-sort-value=\"Lascelles,William\"| William Lascelles || Cricket (first-class) || MP for East Looe (1826–1830), Northallerton (1831–1832), Wakefield (1837–1841; 1842–1847), and Knaresborough (1847–1851)"]}, {"page": "William Saunders Lascelles", "response": ["#REDIRECT William Lascelles"]}, {"page": "Frank Lascelles (diplomat)", "response": ["Lascelles was born in London, the fifth son of William Lascelles, himself the third son of Henry Lascelles, 2nd Earl of Harewood. His mother was Lady Caroline Howard, daughter of George Howard, 6th Earl of Carlisle. He was educated at Harrow and joined the Diplomatic Service in 1861."]}, {"page": "William Saunders Sebright Lascelles", "response": ["#REDIRECT William Lascelles"]}, {"page": "Records of members of parliament of the United Kingdom", "response": [":William Lascelles: 1831, 1837, 1842 b"]}, {"page": "Lascelles", "response": ["*Francis William Lascelles (1890–1979), Clerk of the Parliaments 1953-1959", "*William Lascelles (1798–1851), British politician and son of Henry Lascelles, 2nd Earl of Harewood"]}, {"page": "Thomas Collins (British politician)", "response": ["He was elected as Member of Parliament (MP) for Knaresborough at a by-election in 1851 following the death of William Lascelles, but was defeated at the 1852 general election. He regained the seat at the 1857 general election and held it in 1859, but was defeated again at the 1865 general election."]}, {"page": "Charles Grenfell (1823–1861)", "response": ["Grenfell married Georgiana Caroline, daughter of William Lascelles, in 1852. They had three sons and two daughters. His eldest son William Grenfell was also a politician and was raised to the peerage as Baron Desborough in 1905. The family lived at Taplow Court, Taplow, Buckinghamshire. Grenfell died in May 1861, aged 38. Georgiana remained a widow until her death in February 1911."]}, {"page": "Daniel Gaskell", "response": ["He held the seat until his defeat at the 1837 general election by the Conservative Party candidate William Lascelles."]}, {"page": "Francis William Lascelles", "response": ["Sir Francis William Lascelles KCB, MC (23 March 1890 – 16 May 1979)Who Was Who. was a British public servant and Clerk of the Parliaments from 1953 to 1958.", "A member of the Lascelles family headed by the Earl of Harewood, Lascelles was the son of Lieutenant-Colonel Henry Arthur Lascelles, son of William Lascelles. His mother was Caroline Maria Gore, daughter of the Honourable Charles Alexander Gore, Commissioner of Woods and Forests. He was educated at Winchester College and Christ Church, Oxford."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|William Lascelles"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["||William Lascelles||Tory"]}, {"page": "List of English cricketers (1787–1825)", "response": ["|William Lascelles"]}, {"page": "Georgiana Howard, Countess of Carlisle", "response": ["#Lady Caroline Georgiana Howard (24 June 1803 – 27 November 1881) she married William Lascelles on 14 May 1823. They have nine children.  "]}, {"page": "Lascelles, William", "response": ["#redirectWilliam Lascelles"]}, {"page": "Joseph Holdsworth", "response": ["Holdsworth was elected a Whig Member of Parliament for Wakefield at the 1841 general election but, as he was also the returning officer at that election, he was unseated the next year in favour of his Conservative opponent, William Lascelles."]}, {"page": "Lady Caroline Lascelles", "response": ["#REDIRECT William Lascelles"]}]}}