{"wiki_id": "http://www.wikidata.org/entity/Q8016388", "itemLabel": "William Oscroft", "itemDescription": "English cricketer (1843-1905)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Oscroft", "wikipedia_page": {"main": "William Oscroft (16 December 1843 at Arnold, Nottinghamshire – 10 October 1905 at Nottingham) was an English professional cricketer who played first-class cricket from 1864 to 1882.  He was mainly associated with Nottinghamshire County Cricket Club and made 244 known appearances in first-class matches.Oscroft was a right-handed batsman (RHB) and a right-arm fast roundarm bowler who occasionally played as a wicket-keeper.  Among the representative teams he played for were the North (1864–1879), the All-England Eleven (1865–1878), the Players (1871–1880) and the United North of England Eleven (1872–1879).", "link_mentions": [{"page": "Fred Grace", "response": ["The English cricket team in Australia in 1873–74 is sometimes called W. G. Grace's XI. The Melbourne Club had invited WG to form a team for the tour. There were several refusals but eventually a team including Fred Grace, Walter Gilbert, Harry Jupp, James Lillywhite, William Oscroft and James Southerton boarded the P&O steamer Mirzapore at Southampton and sailed to Melbourne where they received a rapturous welcome. Then it all turned sour.Major, p. 223."]}, {"page": "1865 English cricket season", "response": ["|William Oscroft || Nottinghamshire|| 9 || 13 || 1 || 518 || 107 || 43.16 || 1 || 4"]}, {"page": "1873 English cricket season", "response": ["|William Oscroft || Nottinghamshire|| 17 || 30 || 1 || 758 || 96 || 26.13 || 0 || 5"]}, {"page": "1879 English cricket season", "response": ["|William Oscroft || Nottinghamshire || 19 || 31 || 2 || 763 || 140 || 26.31 || 1 || 3"]}, {"page": "United North of England Eleven", "response": ["The UNEE's rivalry with the USEE was renewed in 1872 when four matches were arranged although the last one at Leeds in September was cancelled.CricketArchive – match scorecard.  Retrieved on 4 December 2008. The first match at Bishop's Stortford in June was drawn.  Robert Carpenter, William Oscroft, John Hicks and James Shaw made first appearances for the UNEE.  In August, the UNEE won by 8 wickets at Hunslet, Arnold Rylott making his first appearance.CricketArchive – match scorecard.  Retrieved on 4 December 2008. In September, the tide turned and the USEE recorded its first win over the UNEE by 8 wickets despite the addition of Thomas Hayward and Richard Daft to the UNEE team.CricketArchive – match scorecard.  Retrieved on 4 December 2008.", "There were no matches in 1875 and then the UNEE reasserted itself in 1876 with a win and a draw from two matches against the USEE.  The first at Fartown Ground, Huddersfield was won by 7 wickets after Andrew Greenwood scored 111.CricketArchive – match scorecard.  Retrieved on 4 December 2008. George Ulyett was playing for the UNEE by now and the team at Huddersfield included three newcomers in David Eastwood, Joseph Blackburn and Robert Clayton.  In the second match at the Town Cricket Club Ground in Hull, the UNEE was saved by an innings of 108 not out by Ephraim Lockwood but the highlight of the match was W G Grace's innings of 126 in a USEE total of only 159.CricketArchive – match scorecard.  Retrieved on 4 December 2008. William Oscroft and Arthur Shrewsbury made their UNEE debuts and, with Alfred Shaw and Fred Morley returning, there was a strong Nottinghamshire contingent.  Robert Butler and John Tye also made first appearances.", "* George Pinder (captain; wicket-keeper), George Ulyett, Ephraim Lockwood, William Oscroft, John Selby, Arthur Shrewsbury, Billy Bates, Tom Emmett, Andrew Greenwood, Tom Armitage, Allen Hill."]}, {"page": "English cricket team in Australia in 1873–74", "response": ["The team was captained by W. G. Grace (Gloucestershire) who was joined by Fred Grace, James Bush (both Gloucestershire); William Oscroft, Martin McIntyre (both Nottinghamshire); Harry Jupp, James Southerton, Richard Humphrey, Farrington Boult (all Surrey); Andrew Greenwood (Yorkshire); James Lillywhite (Sussex); W. R. Gilbert (Middlesex). The party consisted of five amateurs and seven professionals.Rae, p.147."]}, {"page": "W. G. Grace's cricket career (1872 to 1873)", "response": ["Grace made 20 first-class appearances in 1873, scoring 2,139 runs at 71.30 including 7 centuries with a highest score of 192 not out and taking 29 catches.  He took 106 wickets at 12.92 including 10 instances of 5 wickets in an innings, with a best analysis of 10–92, and 3 instances of 10 wickets in a match.  No other batsman came near his runs or average, the best of the rest being Jupp, Fred Grace, William Oscroft and Isaac Walker.  Grace's 106 wickets was 4th best behind Southerton, Alfred Shaw and James Lillywhite with Allen Hill in fifth place.  William McIntyre again had the best average with 8.38."]}, {"page": "List of Nottinghamshire County Cricket Club players", "response": ["* William Oscroft (1863–1882) : W. Oscroft"]}, {"page": "List of Players cricketers (1841–1962)", "response": ["* William Oscroft (1871–1880)"]}, {"page": "John Oscroft (cricketer, born 1846)", "response": ["John Thomas Oscroft (24 March 1846 – 15 June 1885) was an English cricketer who played first-class cricket for Nottinghamshire between 1867 and 1874. He was the brother of William Oscroft, who later captained Nottinghamshire from 1881 to 1882.", "Oscroft was born on 24 March 1846, in Arnold, Nottinghamshire, England. He was the brother of William Oscroft, who later captained Nottingamshire. Aside from cricket, he owned a pub in Arnold. He died on 15 June 1885 of liver cirrhosis."]}, {"page": "Oscroft, William", "response": ["#redirectWilliam Oscroft"]}, {"page": "Oscroft", "response": ["* William Oscroft (1843-1905), English cricketer"]}]}}