{"wiki_id": "http://www.wikidata.org/entity/Q8014079", "itemLabel": "William Knibb", "itemDescription": "British missionary", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Knibb", "wikipedia_page": {"main": "William Knibb, OM (7 September 1803 – 15 November 1845) was an English Baptist minister and missionary to Jamaica. He is chiefly known today for his work to free slaves.\nOn the 150th anniversary of the abolition of slavery in the British Empire, Knibb was posthumously awarded the Jamaican Order of Merit. He was the first white male to receive the country's highest civil honour.\nKnibb's elder brother Thomas was a missionary-schoolmaster in Jamaica. When Thomas died at 24, William volunteered to replace him. A dedication service was held in Bristol on 7 October 1824, two days after he had married Mary Watkins (or Watkis). The newly-weds sailed to Jamaica on 5 November 1824, when William was aged only 21.\nKnibb found six English Baptist missionaries, African-Caribbean Baptist deacons, and thriving congregations already in Jamaica when he arrived. Together they were following the pioneering work of the African preacher George Lisle, a former slave from Virginia who had arrived in 1782 and founded a Baptist church in Kingston. Knibb began work as the schoolmaster of the Baptist mission school in Kingston and worked closely with fellow missionaries Thomas Burchell and James Phillippo, who formed a trio. In 1828 he moved to Savanna-la-Mar. In 1830 he became the minister responsible for the Baptist church at Falmouth, which had regular congregations of 600 when he arrived. He remained there as minister until he died.: 8–15 ", "link_mentions": [{"page": "Baptists", "response": ["Elsewhere in the Americas, in the Caribbean in particular, Baptist missionaries and members took an active role in the anti-slavery movement. In Jamaica, for example, William Knibb, a prominent British Baptist missionary, worked toward the emancipation of slaves in the British West Indies (which took place in full in 1838). Knibb also supported the creation of \"Free Villages\" and sought funding from English Baptists to buy land for freedmen to cultivate; the Free Villages were envisioned as rural communities to be centred around a Baptist church where emancipated slaves could farm their own land. Thomas Burchell, missionary minister in Montego Bay, also was active in this movement, gaining funds from Baptists in England to buy land for what became known as Burchell Free Village."]}, {"page": "November 15", "response": ["*1845 – William Knibb, English Baptist minister and Jamaican missionary (b. 1803)"]}, {"page": "September 7", "response": ["*1803 – William Knibb, English Baptist minister and Jamaican missionary (d.1845)"]}, {"page": "Kettering", "response": ["William Carey, born in 1761 at Paulerspury, spent his early life in Kettering before leaving for India as a missionary in 1793. Carey Mission House and Carey Street were named after him. Andrew Fuller helped Carey found the Baptist Missionary Society and he is remembered in the Fuller Church and Fuller Street. In 1803 William Knibb was born in Market Street and became a missionary and emancipator of slaves; he is commemorated by the Knibb Centre and Knibb Street. Toller Chapel and Toller Place take their names from two ministers, father and son, who preached in Kettering for a total of 100 years. The chapel was built in 1723 for those who since 1662 had been worshipping in secret."]}, {"page": "Baptist War", "response": ["The planters suspected many missionaries of having encouraged the rebellion. Some, such as William Knibb and Bleby, were arrested, tarred and feathered, but later released. Groups of white colonials destroyed chapels that housed black congregations.Masters, P., 2006: Missionary triumph over slavery. Wakeman Trust, London. . pp. 17–23"]}, {"page": "Christian views on slavery", "response": ["William Knibb was an active campaigner against slavery in Jamaica, who suffered persecution, including the burning of his chapel at Falmouth, at the hands of agents of the colonial powers."]}, {"page": "Order of Merit (Jamaica)", "response": ["*The Cardinal William Knibb (1845) "]}, {"page": "Michael Green (sprinter)", "response": ["Michael Green (born 7 November 1970 in Trelawny) is a retired Jamaican sprinter who specialized in the 100 metres. Michael Green attended William Knibb Memorial High and graduated in May 1989 where he dominated the 100m. Green's nickname at William Knibb was 'Roach'. After graduating from William Knibb as the fastest male in 1989, Green was awarded a scholarship to attend Clemson University. Michael Green and 100m World Record setting sprinter Usain Bolt are former students at William Knibb Memorial High School.", "His personal best time is 10.02 seconds, achieved in April 1997 in Knoxville, TN. With 6.49 over the 60 metres during the 1997 indoor season he was the world top performer that year, together with Ato Boldon and Randall Evans. Green still holds the fastest first 40m split ever recorded during a 100m race- albeit by just 0.01s- ahead of none other than Usain Bolt's famous 9.58s world record performance at Berlin in 2009. Thus William Knibb High can boast the 2 fastest 40m performers ever among its alumni."]}, {"page": "Usain Bolt", "response": ["Upon his entry to  William Knibb Memorial High School, Bolt continued to focus on other sports, but his cricket coach noticed Bolt's speed on the pitch and urged him to try track and field events. Pablo McNeil, a former Olympic sprint athlete, and Dwayne Jarrett coached Bolt, encouraging him to focus his energy on improving his athletic abilities. The school had a history of success in athletics with past students, including sprinter Michael Green. Bolt won his first annual high school championships medal in 2001; he took the silver medal in the 200 metres with a time of 22.04 seconds. McNeil soon became his primary coach, and the two enjoyed a positive partnership, although McNeil was occasionally frustrated by Bolt's lack of dedication to his training and his penchant for practical jokes.", "As part of his sponsorship deal with Puma, the manufacturer sends sporting equipment to his alma mater, William Knibb Memorial High School, every year. At Bolt's insistence, advertisements featuring him are filmed in Jamaica, by a Jamaican production crew, in an attempt to boost local enterprise and gain exposure for the country. In 2017, Bolt had the third highest earning social media income for sponsors among sportspeople (behind Cristiano Ronaldo and Neymar), and he was the only non-footballer in the top seven."]}, {"page": "William Knibb", "response": ["William Knibb, OM (7 September 1803 – 15 November 1845) was an English Baptist minister and missionary to Jamaica. He is chiefly known today for his work to free slaves.", "Knibb's elder brother Thomas was a missionary-schoolmaster in Jamaica. When Thomas died at 24,Thomas was born on 11 October 1799. Hinton incorrectly gives 1823 as his death year though later quotes a letter dated 18 April 1825 written by William saying Thomas had preached there exactly a year ago on Sabbath evening. The gravestone confirms 1824. ACJ. William volunteered to replace him. A dedication service was held in Bristol on 7 October 1824, two days after he had married Mary Watkins (or Watkis). The newly-weds sailed to Jamaica on 5 November 1824, when William was aged only 21.Kettering Borough Council, 2005: William Knibb, Missionary and Emancipator. Available from KBC.", "thumb|Portrait and signature of William Knibb, 1845", "The Baptists in Jamaica were founded by freed slaves, notably George Lisle, who sought support and finance for schools and chapels from nonconformists abroad, particularly from the English Baptist movement, which William Knibb contributed to. Jamaica had become a major sugar exporter, relying on slavery. Knibb sided with the slaves and the cause of emancipation.", "*J. H. Hinton, Memoir of William Knibb, Missionary in Jamaica, 1847, accessed April 2009.", "*The classic biography, by a contemporary and published within two years of the subject's death, is J. H. Hinton's Life of William Knibb, London, 1847. The work by Peter Masters (Masters, P., 2006: Missionary triumph Over Slavery: William Knibb and Jamaican Emancipation, Wakeman Trust, London. ) is mostly an abridged and updated version of Hinton.", "*Morrison, Doreen. 2014. Slavery's Heroes: George Liele and the Ethiopian Baptists of Jamaica 1783 - 1865. CreateSpace. . A section of the book tells of how William Knibb as a part of the Baptist Missionary Society took over the reins of leadership of Baptists in Jamaica, and his increasing sympathy for their cause (Emancipation) following the death and execution of African Baptist  leaders prior to and following the Baptist War 1831 - 1832."]}, {"page": "Samuel Oughton", "response": ["The Rev. Samuel Oughton (1803 – December 1881), Baptist missionary to Jamaica 1836–1866, and colleague of William Knibb, was an abolitionist who became an outspoken advocate of black labour rights in Jamaica during the gradual abolition of slavery in the late 1830s and thereafter.  He was briefly imprisoned in Jamaica during 1840. Originally associated with James Sherman's Independent Congregational Surrey Chapel, and from time to time invited back by Sherman, he was closely associated with the Baptists in Jamaica, who were largely organised along Congregational lines and among the predominantly African-Caribbean population, following their founding by George Lisle, a former slave from America.", "* Oughton, Samuel (1845). The Church's Lamentation over Departed Greatness: A sermon, preached at East Queen Street Chapel, Kingston, Jamaica, on occasion of the death of the Rev. William Knibb, who departed this life, Nov. 15, 1845."]}, {"page": "Nathaniel Rogers (physician)", "response": ["Rogers was, by faith, a Baptist, supporting their meetings and involvement in the non-denominational London Missionary Society. As missionaries, the Baptists were particularly strong in Jamaica. Shortly after the death of William Knibb he was invited to chair a meeting of the Malton Sunday School Baptists, when his support for Knibb and his Anti-slavery work became plain: We sympathise especially with our sable brethren in Jamaica; for great has been the loss in losing Knibb. To say that he was perfect would be to flatter humanity at the expense of truth... for perfection belongs not on earth but in heaven."]}, {"page": "George Liele", "response": ["Ryland's first missionary was funded by the Baptists rather than the London Missionary Society.  His achievements were limited since he died early. Later, in the early 19th century, a trio of Baptist missionaries from Britain, Thomas Burchell, James Phillippo and William Knibb, and slightly later still others such as Samuel Oughton were more successful in supporting local African Baptist congregations and helping them develop their international links.  They met fierce resistance from the White Jamaican planter class and slave owners who had great influence in the House of Assembly of Jamaica and had provided adequately for their own spiritual needs with the Anglican Church.  They opposed both education and the congregational governance ideas of the Baptists from being introduced among their slaves."]}, {"page": "Thomas Burchell", "response": ["Thomas Burchell (1799–1846) was a leading Baptist missionary and slavery abolitionist in Montego Bay, Jamaica in the early nineteenth century. He was among an early group of missionaries who went out from London in response to a request from African Baptists on the island. He established churches and schools to aid the slaves. Burchell is credited with the concept of Free Villages and encouraging their development by Baptist colleagues such as William Knibb, as well as by other denominations. Anticipating abolition of slavery, he helped raise funds in Great Britain to acquire land for freedmen after they were emancipated, and to develop Free Villages.", "Starting in the 1830s, in anticipation of the emancipation under discussion in Parliament, the Jamaican Baptist congregations, deacons, and ministers proposed the Caribbean concept of \"free villages\": to grant freedpeople plots of land for their own to cultivate as the basis of independent villages, to be organized around a Baptist church. Burchell developed this idea especially with fellow English Baptist missionaries William Knibb and James Phillippo."]}, {"page": "Calabar High School", "response": ["In 1839, William Knibb, Thomas Burchell and James Phillippo, the three leading English Baptist missionaries working in Jamaica, worked to create a college to train native Baptist ministers. Out of this effort, Calabar Theological College was founded in 1843, sited in the village of Calabar, near Rio Bueno in Trelawny Parish. The Spanish named Calabar after a slave port in Nigeria of the same name."]}, {"page": "List of abolitionists", "response": ["* William Knibb (British)"]}, {"page": "Monarchy of Jamaica", "response": ["Prince Harry toured Jamaica between 5 and 8 March 2012, participating in various events marking the Queen's Diamond Jubilee. Jamaica concurrently celebrated its 50 years of independence. During the tour, the Prince partook in military exercises with the Jamaica Defence Force, visited Bustamante Hospital for Children and, in Trelawny Parish, visited Water Square, Falmouth Pier, and the William Knibb Baptist Church, where he paid respect at the William Knibb memorial. The Prince attended an event for the charity Rise Life, ran with Usain Bolt at the latter's training ground at the University of the West Indies, Mona. There, he was also named an Honorary Fellow of the university. A Jamaica Night reception was held at the Royal Caribbean Hotel in Montego Bay and Governor-General of Jamaica Sir Patrick Allen hosted a dinner at King's House, as a combined celebration of the Diamond Jubilee and Jamaica's 50th anniversary of independence. The Prime Minister, Portia Simpson Miller, stated the tour was intended to \"highlight the country's tourism developments on the North Coast and the important work being done in the area of youth and children\"."]}, {"page": "John Howard Hinton", "response": ["*Memoir of William Knibb, Missionary in Jamaica, 1847, accessed April 2009"]}, {"page": "Free Villages", "response": ["*Granville (named after the abolitionist Englishman Granville Sharp), in Trelawny, arranged through Rev. William Knibb's Baptist chapel.", "*Kettering, (named after the birthplace of William Knibb)."]}, {"page": "William Knibb (Kettering BC Ward)", "response": ["!colspan=2 align=center bgcolor=\"#ff9999\"|William Knibb Ward (Kettering Borough Council)", "!colspan=2 alignn=center|200px|William KnibbWilliam Knibb within Kettering Borough", "William Knibb is a 2-member ward within Kettering Borough Council, created by boundary changes that took effect in 2007, having been carved out of part of the former St. Mary's ward in Kettering town. The ward was named after William Knibb, Baptist missionary in Jamaica, and covers the town centre as well as the area around Mill Road just east of the centre. It was fought at Borough Council level on Thursday 3 May 2007, at which both seats were won by Labour."]}, {"page": "Kettering, Jamaica", "response": ["Kettering was a Free Village in Trelawny, Jamaica. It is now part of Duncans. It was named after Kettering in England, the birthplace of William Knibb, its founder."]}, {"page": "James Losh", "response": ["Losh spoke at meetings that supported the Anti-Slavery Society's petitions of the mid 1820s, with John Ralph Fenwick M.D. (1761–1855). On 29 January 1833 he was introduced to William Knibb, by the Quaker William Beaumont;Diary, vol. 2 p. 147 their speeches at a meeting the following day, for the abolition of slavery in the British colonies, at the Brunswick Place Chapel in Newcastle, were published together."]}]}}