{"wiki_id": "http://www.wikidata.org/entity/Q8018517", "itemLabel": "William Smart", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Smart_(economist)", "wikipedia_page": {"main": "William Smart (10 April 1853 – 19 March 1915) was a Scottish economist. Originally a conveyor of the thought of the Austrian School, Smart was increasingly won-over to the neoclassicalism of Alfred Marshall.\nSmart, eldest son of Alexander Smart and grandson of Reverend William Smart, was born in Barrhead, Scotland.\n\n", "link_mentions": [{"page": "John Ruskin", "response": ["Ruskin was an inspiration for many Christian socialists, and his ideas informed the work of economists such as William Smart and J. A. Hobson, and the positivist Frederic Harrison.Gill Cockram, Ruskin and Social Reform: Ethics and Economics in the Victorian Age (Tauris, 2007)  Ruskin was discussed in university extension classes, and in reading circles and societies formed in his name. He helped to inspire the settlement movement in Britain and the United States. Resident workers at Toynbee Hall such as the future civil servants Hubert Llewellyn Smith and William Beveridge (author of the Report ... on Social Insurance and Allied Services), and the future Prime Minister Clement Attlee acknowledged their debt to Ruskin as they helped to found the British welfare state. More of the British Labour Party's earliest MPs acknowledged Ruskin's influence than mentioned Karl Marx or the Bible.Stuart Eagles, After Ruskin: The social and political legacies of a Victorian prophet, 1870–1920 (Oxford University Press, 2011) and Dinah Birch (ed.), Ruskin and the Dawn of the Modern (Oxford University Press, 1999). More recently, Ruskin's works have also influenced Phillip Blond and the Red Tory movement."]}, {"page": "Eugen von Böhm-Bawerk", "response": ["Böhm-Bawerk's Positive Theorie des Capitales (Universitätsverlag Wagner, 1889) (translated by William Smart as Positive Theory of Capital (1892)), offered as the second volume of Capital and Interest, elaborated on the economy's time-consuming production processes and the interest payments they entail. Further Essays on Capital and Interest (1921) was the third volume, which originated with appendices to the second volume. Book III (part of the second volume), Value and Price, develops Menger's ideas of marginal utility outlined in his Principles of Economics, to argue that the idea of subjective value is related to marginalism, in that things only have value insofar as people want such goods. To illustrate the principle, Böhm-Bawerk used the practical example of a farmer who is left with five sacks of corn after harvest to provide for his needs until the next harvest:Böhm-Bawerk, Eugen v. The Positive Theory of Capital. William A. Smart, trans. London: Macmillan and Co. 1891."]}, {"page": "Marginalism", "response": ["Although the Marginal Revolution flowed from the work of Jevons, Menger, and Walras, their work might have failed to enter the mainstream were it not for a second generation of economists.  In England, the second generation were exemplified by Philip Wicksteed, by William Smart, and by Alfred Marshall; in Austria by Eugen Böhm von Bawerk and by Friedrich von Wieser; in Switzerland by Vilfredo Pareto; and in America by Herbert Joseph Davenport and by Frank A. Fetter.", "There were significant, distinguishing features amongst the approaches of Jevons, Menger, and Walras, but the second generation did not maintain distinctions along national or linguistic lines.  The work of von Wieser was heavily influenced by that of Walras.  Wicksteed was heavily influenced by Menger. Fetter referred to himself and Davenport as part of \"the American Psychological School\", named in imitation of the Austrian \"Psychological School\". Clark's work from this period onward similarly shows heavy influence by Menger. William Smart began as a conveyor of Austrian School theory to English-language readers, though he fell increasingly under the influence of Marshall.Salerno, Joseph T. 1999; \"The Place of Mises's Human Action in the Development of Modern Economic Thought\". Quarterly Journal of Economic Thought v. 2 (1)."]}, {"page": "Paradox of thrift", "response": ["which has found occasional use as an epigram in underconsumptionist writings.English, Irish and Subversives Among the Dismal Scientists, Noel Thompson, Nigel Allington, 2010, p. 122: \"A suggestion that a more equal distribution of income might be a remedy for general stagnation – and that excess saving can be harmful – is implicit in the quotation from the Old Testament on the Reply to Mr. Say [by John Cazenove (1788–1879)].\"A Reply to Mr. Say’s Letters to Mr. Malthus, by John Cazenove, uses the verse as an epigram.Studies in economics, William Smart, 1895, p. 249"]}, {"page": "High School of Glasgow", "response": ["* William Smart, economist"]}, {"page": "Adam Smith Professor of Political Economy", "response": ["The first occupant of the chair was William Smart. He had previously been lecturer in Political Economy at Queen Margaret College and the university's first official lecturer in Political Economy. He remained in the chair until his death in 1915, and was succeeded the same year by William Scott. Scott, originally from Northern Ireland, was a political economy lecturer at the University of St Andrews when appointed, and an authority on Adam Smith. He served as president of the Royal Philosophical Society of Glasgow from 1931 to 1934 and of the Royal Economic Society from 1935 to 1937. Scott also remained in the chair until his death, in 1940. He was succeeded by Alec Macfie in 1945. He had a distinguished career, retiring in 1958, and was dean of Faculties from 1974 to 1978. In 1990, the James Bonar Chair of Political Economy was renamed the Bonar-Macfie Chair.", "*1896-1915: William Smart"]}, {"page": "Marginal utility", "response": ["Although the Marginal Revolution flowed from the work of Jevons, Menger, and Walras, their work might have failed to enter the mainstream were it not for a second generation of economists.  In England, the second generation were exemplified by Philip Henry Wicksteed, by William Smart, and by Alfred Marshall; in Austria by Eugen von Böhm-Bawerk and by Friedrich von Wieser; in Switzerland by Vilfredo Pareto; and in America by Herbert Joseph Davenport and by Frank A. Fetter.", "There were significant, distinguishing features amongst the approaches of Jevons, Menger, and Walras, but the second generation did not maintain distinctions along national or linguistic lines.  The work of von Wieser was heavily influenced by that of Walras.  Wicksteed was heavily influenced by Menger.  Fetter referred to himself and Davenport as part of \"the American Psychological School\", named in imitation of the Austrian \"Psychological School\". (And Clark's work from this period onward similarly shows heavy influence by Menger.)  William Smart began as a conveyor of Austrian School theory to English-language readers, though he fell increasingly under the influence of Marshall.Salerno, Joseph T. 1999; \"The Place of Mises's Human Action in the Development of Modern Economic Thought.\" Quarterly Journal of Economic Thought v. 2 (1)."]}, {"page": "Michèle Pujol", "response": ["Writing on \"The feminist economic thought of Harriet Taylor (1807–58)\" in 1995, Pujol established the \"materialist analysis that distinguishes Taylor from Mill's idealist and male-centred position.\" As Pujol stated, \"there cannot be any doubt that Taylor stands on her own as an original and insightful feminist thinker and as an economist and political theorist.\" Pujol also extended the canon of past economic thought, reviving (and rescuing from what E. P. Thompson called \"the crushing condescension of posterity,\") feminist analytical contributions on economic inequality by Harriet Hardy Taylor (later Harriet Taylor Mill), Barbara Leigh Smith Bodichon, Millicent Garrett Fawcett, Eleanor Rathbone, and William Smart."]}, {"page": "William Smart", "response": ["William Smart may refer to:", "*William Smart (economist) (1853–1915), Scottish economist", "*William Smarte (c. 1530 – 1599), MP for Ipswich", "* William Smarte"]}]}}