{"wiki_id": "http://www.wikidata.org/entity/Q8018289", "itemLabel": "William Sewell", "itemDescription": "English divine and author", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Sewell_(author)", "wikipedia_page": {"main": "William Henry Sewell (23 January 1804 – 14 November 1874), English divine and author, helped to found two public schools along high church Anglican lines. A devout churchman, learned scholar and reforming schoolmaster, he was strongly influenced by the Tractarians.", "link_mentions": [{"page": "James Anthony Froude", "response": ["Nevertheless, Froude was ordained deacon in 1845, initially intending to help reform the church from within. However, he soon found his situation untenable; although he never lost his faith in God or Christianity, he could no longer submit to the doctrines of the Church. He began publicly airing his religious doubts through his semi-autobiographical works Shadows of the Clouds, published in 1847 under the pseudonym \"Zeta\", and The Nemesis of Faith, published under his own name in 1849. The Nemesis of Faith in particular raised a storm of controversy, being publicly burned at Exeter College by William Sewell and deemed \"a manual of infidelity\" by the Morning Herald. Froude was forced to resign his fellowship, and officials at University College London withdrew the offer of a mastership at  Hobart Town, Australia where Froude had hoped to work while reconsidering his situation. Froude took refuge from the popular outcry by residing with his friend Charles Kingsley at Ilfracombe."]}, {"page": "1849 in literature", "response": ["**J. A. Froude's semi-autobiographical, epistolary philosophical novel of religious doubt The Nemesis of Faith is published by John Chapman in London. A copy is burned by William Sewell, Dean of Exeter College, Oxford, himself a novelist."]}, {"page": "1845 in literature", "response": ["*William Sewell – Hawkstone: a tale of and for England"]}, {"page": "Radley College", "response": ["Radley was founded in 1847 by William Sewell (1804–79) and Robert Corbet Singleton (1810–81). The first pupil was Samuel Reynolds, who in 1897 wrote his reminiscences of school life."]}, {"page": "Radley", "response": ["Abingdon Abbey held the manor of Radley until the dissolution of the monasteries in 1538. In the reign of Queen Elizabeth I, George Stonehouse built a house in Radley Park, but in 1727 the Stonehouse family replaced this with a new mansion, Radley Hall. Early in the 19th century the house was leased for a time as a Nonconformist school, and from 1847 it was leased to William Sewell who founded Saint Peter's College, Radley. The school is now generally referred to as Radley College."]}, {"page": "Henry Sewell", "response": ["*William Sewell, brother, Church of England clergyman and author"]}, {"page": "James Edwards Sewell", "response": ["His brother, Henry Sewell became the first premier of New Zealand. Another brother, William Sewell, was a writer, as was sister Elizabeth Missing Sewell. His brother Richard Clarke Sewell was a barrister and later reader in law to the University of Melbourne and author of a large number of legal works."]}, {"page": "White's Professor of Moral Philosophy", "response": ["*1836\t\tWilliam Sewell, MA, Fellow of Exeter College"]}, {"page": "St Columba's College, Dublin", "response": ["St Columba's College is a co-educational independent day and boarding school founded in 1843 located in Whitechurch, County Dublin, Ireland. Among the founders of the college were Viscount Adare (who later became The 3rd Earl of Dunraven and Mount-Earl in 1850), William Monsell (who was later created The 1st Baron Emly in 1874), Dr William Sewell and James Henthorn Todd."]}, {"page": "List of founders of English schools and colleges", "response": ["|William Sewell"]}, {"page": "1845 in the United Kingdom", "response": ["* William Sewell's religious novel Hawkstone: a tale of and for England."]}, {"page": "List of Old Wykehamists", "response": ["*  William Sewell, divine and author"]}, {"page": "Richard Clarke Sewell", "response": ["Sewell, eldest son of Thomas Sewell of Newport, Isle of Wight, brother of James Edwards Sewell, warden of New College, Oxford, Henry Sewell, premier of New Zealand, and of William Sewell, a Church of England clergyman, and the novelist Elizabeth Missing Sewell."]}, {"page": "The Nemesis of Faith", "response": ["The novel consists primarily of protagonist Markham Sutherland's account of the development of his religious ideas and doubts, followed by a brief narrative in which Sutherland's lack of faith leads him and his lover to tragic ends. The novel was condemned by English religious figures and publicly burned by William Sewell; this led to Froude's resignation of his fellowship at Oxford University.", "The Nemesis of Faith raised a scandal at its first release, being referred to as \"a manual of infidelity\" in the Morning Herald.Ashton 76 It was publicly burned by William Sewell in his class at Exeter College.Willey 131 Soon after, Froude resigned his fellowship at Oxford."]}, {"page": "Elizabeth Missing Sewell", "response": ["Elizabeth Missing Sewell was born at High Street, Newport, Isle of Wight, on 19 February 1815, was third daughter in a family of seven sons and five daughters of Thomas Sewell (1775–1842), solicitor, of Newport, and his wife Jane Edwards (1773–1848). She was sister of Henry Sewell, the first premier of New Zealand, of James Edwards Sewell, warden of New College, Oxford, of Richard Clarke Sewell, reader in law to the University of Melbourne and the author of a large number of legal works, and of William Sewell, clergyman and author. Elizabeth was educated first at Miss Crooke's school at Newport, and afterwards at the Misses Aldridge's school, Bath. At the age of fifteen she went home, and joined her sister Ellen, two years her senior, in teaching her younger sisters.."]}, {"page": "R. B. Seymour Sewell", "response": ["Sewell was born in 1880 in Leamington, Warwickshire. His father was the reverend Arthur Sewell, and his mother was Mary Lee (née Waring). His grandfather was Robert Burleigh Sewell (1810–1872), who had a number of notable siblings, including Richard Clarke Sewell (1803–1864), William Sewell (1804–1874), Henry Sewell (1807–1879), James Edwards Sewell (1810–1903), and Elizabeth Missing Sewell (1815–1906). He studied at Cambridge (Christ's College) and St Bartholomew's Hospital, London. He received a B.A. (Hons) from Cambridge in 1902 and qualified M.C.R.S. & L.R.C.P. in 1907."]}, {"page": "Edwin George Monk", "response": ["In going to Dublin in 1844, Monk commenced an association with William Sewell and Robert Singleton at the newly established (1843) High Church Anglican St Columba's College, Rathfarnham. It was an association which continued when the three men jointly were involved in founding St Peter's College, Radley, in Oxfordshire three years later. Monk's position at St Columba's was as organist, Precentor and Master of Music, and he was made a Fellow of the college."]}, {"page": "Robert Corbet Singleton", "response": ["Singleton was a teacher of mathematics, but he loved music and Latin. On the best of terms with William Sewell, he was instrumental in setting up St Columba's College, Stackallan, near Dublin, and became its first Warden when the college opened in 1843, although owing to a subsequent dispute were never recognised as founders.White, A History of St Columba's. Also on the staff, soon afterwards, at St Columba's, was music master Edwin Monk, with whom Singleton was subsequently to work also at Radley; the two of them still later collaborating in the making of a hymnal at York more than two decades later.About Robert Singleton – Victorian educational reformer accessed 24 Nov 2012", "Singleton moved to Oxford where he was admitted in 1847 to Trinity College. With William Sewell, who had supported him at St Columba’s, he was to become co-founder of St Peter’s College, Radley, being appointed the first Warden of Radley on 9 June 1847."]}, {"page": "The Englishman's Library", "response": ["|William Sewell"]}, {"page": "Godfrey Faussett", "response": ["Faussett was Bampton Lecturer, publishing The Claims of the Established Church to exclusive attachment and support, and the Dangers which menace her from Schism and Indifference, considered (1820). He took the conservative side of the religious issues in the university, opposing the 1834 bill of George William Wood to allow dissenters to enter (on a committee with Edward Burton, John Henry Newman, Edward Pusey and William Sewell), and defending subscription to the Thirty Nine Articles in 1835 with Vaughan Thomas and Newman."]}, {"page": "William Sewell", "response": ["William Sewell may refer to:", "* William Sewell (author) (1804–1874), English divine and author", "* William Sewell (cricketer) (died 1862), English cricketer", "* William Sewell (poet) (1951–2003), New Zealand poet", "* William Sewell (trade unionist) (1852–1948), British trade unionist", "* William Sewell (veterinary surgeon) (1781–1853), principal of the London Veterinary College"]}, {"page": "Timeline of Oxford", "response": ["** William Sewell, Dean of Exeter College and novelist, burns a copy of J. A. Froude's novel of religious doubt The Nemesis of Faith."]}]}}