{"wiki_id": "http://www.wikidata.org/entity/Q8012257", "itemLabel": "William Herbert Wallace", "itemDescription": "British person acquitted of murder", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Herbert_Wallace", "wikipedia_page": {"main": "William Herbert Wallace (29 August 1878 – 26 February 1933) was an Englishman convicted in 1931 of the murder of his wife, Julia, in their home in Wolverton Street in Liverpool's Anfield district. Wallace's conviction was later overturned by the Court of Criminal Appeal, the first instance in British legal history where an appeal had been allowed after re-examination of evidence.\nThe case, with its strange background, has long been the subject of speculation and has generated many books, being regarded internationally as a classic murder mystery.", "link_mentions": [{"page": "The Black Museum", "response": ["* William Herbert Wallace – \"The Raincoat\""]}, {"page": "St George's Hall, Liverpool", "response": ["Until 1984 the Liverpool Assizes (later the Crown Court) were held in the courtroom at the southern end of St George's Hall. Notable cases heard include those of Florence Maybrick in 1889 and William Herbert Wallace in 1931. The court now often doubles for the Old Bailey in film and TV dramas."]}, {"page": "Miscarriage of justice", "response": ["English law has no official means of correcting a \"perverse\" verdict (conviction of a defendant on the basis of insufficient evidence). Appeals are based exclusively on new evidence or errors by the judge or prosecution (but not the defence), or jury irregularities. A reversal occurred, however, in the 1930s when William Herbert Wallace was exonerated of the murder of his wife. There is no right to a trial without jury (except during the troubles in Northern Ireland or in the case where there is a significant risk of jury-tampering, such as organised crime cases, when a judge or judges presided without a jury)."]}, {"page": "Anfield Cemetery", "response": ["Buried in the cemetery are the artist William G. Herdman (1805–82), the boxer Jem Mace (died 1910), and T. J. Hughes, founder of a chain of shops bearing his name.  Also buried in the cemetery are four recipients of the Victoria Cross: Patrick Mylott (1820–78) and John Kirk (1827–65), both of whom served in the Indian Mutiny, Joseph Prosser (1828–67) who served in the Crimean War, and Donald Dickson Farmer (1877–1956) who served in the Second Boer War. Other notable burials or cremations include the cotton merchant James Maybrick (1838–89), the footballer Joe Fagan (1921–2001), the singer Michael Holliday (1924–63), and the musician Rory Storm (1938–72). In the cemetery are the graves of the newspaper proprietor Michael James Whitty (1793–1873), and William Herbert Wallace (1878–1933), who was convicted, then acquitted, of murdering his wife. "]}, {"page": "William Wallace (disambiguation)", "response": ["*William Herbert Wallace (1878–1933), English convicted 'murderer', later found to be innocent on appeal"]}, {"page": "Gordon Hewart, 1st Viscount Hewart", "response": ["He has been described as \"one of the most vigorous and vociferous believers in the impeccability of the English jury system of this or any other century\".The Killing of Julia Wallace, by Jonathan Goodman (Headline, London, 1987), p.251 However, in 1931, Hewart made legal history, when (sitting with Mr Justice Branson and Mr Justice Hawke) he quashed the conviction for murder of William Herbert Wallace, on the grounds that the conviction was not supported by the weight of the evidence. In other words, the jury was wrong."]}, {"page": "Florence Maybrick", "response": ["* William Herbert Wallace"]}, {"page": "List of fictitious people", "response": ["* R. M. Qualtrough, a key figure in the murder trial of William Herbert Wallace"]}, {"page": "Scholefield Allen", "response": ["Practising in criminal law, his most famous brief was the sensational 1931 Liverpool murder case, acting as junior counsel for William Herbert Wallace, assisting Roland Oliver KC, who led for the Defence. Wallace was initially convicted of the bizarre murder of his wife Julia, and sentenced to death, but in a unique legal decision the verdict was quashed on Appeal, because the weight of the evidence did not support it, and Wallace was freed. Scholefield Allen was appointed a King's Counsel in June 1945. He served as Recorder of Blackburn between 1947 and 1970."]}, {"page": "Wallace (surname)", "response": ["*William Herbert Wallace (1878–1933), English convicted 'murderer', later found to be innocent on appeal"]}, {"page": "R. M. Qualtrough", "response": ["#REDIRECT William Herbert Wallace"]}, {"page": "Julia Wallace (murder victim)", "response": ["#REDIRECT William Herbert Wallace"]}, {"page": "R v Wallace", "response": ["William Herbert Wallace, a 52-year-old insurance agent, had been convicted at the Liverpool Assizes in 1931 of the brutal murder of his wife, Julia Wallace, and sentenced to death.", "Mr. Justice Wright, after pointedly omitting the customary thanks to the jury, passed the mandatory sentence of death on William Herbert Wallace.", "*The Trial of William Herbert Wallace (1933) by W. F. Wyndham-Brown, online copy at The Internet Archive"]}, {"page": "Richard Gordon Parry", "response": ["#REDIRECT William Herbert Wallace"]}, {"page": "List of miscarriage of justice cases", "response": ["|rowspan=\"2\" |William Herbert Wallace", "|colspan=5|William Herbert Wallace was convicted of murdering his wife, but the conviction was overturned by the Court of Criminal Appeal in 1931, the first such instance of a capital conviction being quashed."]}]}}