{"wiki_id": "http://www.wikidata.org/entity/Q8017727", "itemLabel": "William Rogue", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Rogue", "wikipedia_page": {"main": "Stewart William Allan (born 13 November 1973), more familiar by his stage name, William Rogue, is a Scottish musician and actor. He is the principal songwriter, lead guitarist, and lead vocalist of rock band The Blimp.\n\n", "link_mentions": [{"page": "Shawlands Academy", "response": ["* William Rogue (a.k.a. Stewart William Allan) – Rock musician"]}, {"page": "The Blimp", "response": ["The Blimp were a rock band formed in Glasgow, Scotland in 1998.  The group comprised William Rogue (vocals, lead guitar, harmonica), Ray Alexander (Hammond organ), George Berry (vocals, drums, percussion), Gary Craig (bass guitar) and JD Allan (vocals, rhythm guitar).  The Blimp released two studio albums, one live album and three singles before disbanding in July 2007.", "The original line up of the band that would become The Blimp came together for the first time in late 1998.  Brothers William Rogue and JD Allan, who had been in several bands together since the early 1990s, first recruited keyboard player Ray Alexander.  Alexander was an old school friend and had been in the brother's previous band, the Caffeine Cake Orchestra.  Drummer Mark Brown, was next on board.  Brown had attended college with Rogue and was a former member of the brother's first band, The Bodies.  Bass player Gary Craig, joined at the invitation of Brown soon after.  Finally, saxophonist Carol McBay, completed the line up.", "  bar:Guitarist1 text:William Rogue", "*William Rogue’s official site"]}, {"page": "JD Allan", "response": ["David John Allan (born 16 August 1972), or as he is more commonly known, JD Allan, is a Scottish musician, singer-songwriter, animator, web developer and writer.STV (TV network). Retrieved on 2012-02-18.GoNorth. Retrieved on 2012-03-31.TechCrunch. Retrieved on 2010-09-06.BBC Radio 4 Extra. Retrieved on 2012-09-24.The Herald. Retrieved on 2016-02-03.Scottish Book Trust. Retrieved on 2019-05-17.Product Magazine. Retrieved on 2019-12-19. Allan is the older brother of musician and actor, William Rogue, and a former member of Scottish rock band The Blimp.BBC Music. Retrieved on 2013-03-14.Whitelaw, Paul (24 July 2001). Metro.The Guardian. Retrieved on 2018-08-23."]}, {"page": "Rogue, William", "response": ["#redirectWilliam Rogue"]}]}}