{"wiki_id": "http://www.wikidata.org/entity/Q8015729", "itemLabel": "William Molyneux, 2nd Earl of Sefton", "itemDescription": "Irish Earl (1772-1838)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Molyneux,_2nd_Earl_of_Sefton", "wikipedia_page": {"main": "William Philip Molyneux, 2nd Earl of Sefton (18 September 1772 – 20 November 1838), also known as Lord Dashalong, was a sportsman, gambler and a friend of the Prince Regent.", "link_mentions": [{"page": "North West England", "response": ["The Liverpool and Manchester Railway was the world's first passenger inter-city railway in 1830. Manchester Liverpool Road railway station is the world's oldest surviving railway station, having opened on 15 September 1830; the Stockton and Darlington Railway had opened in 1825. Chat Moss was a problem to constructing the railway, with Edge Hill Tunnel and Sankey Viaduct; the line was bitterly opposed by William Molyneux, 2nd Earl of Sefton. The Bridgewater Canal was the first recognised canal of the modern era. Francis Egerton, 3rd Duke of Bridgewater had visited France and noted their canals. John Gilbert had the innovative idea to use water pumped out of his coal mines to fill a canal from the Duke's Worsley mines to Manchester. It was designed by James Brindley and built in 1761."]}, {"page": "Grand National", "response": ["The Grand National was founded by William Lynn, a syndicate head and proprietor of the Waterloo Hotel, on land he leased in Aintree from William Molyneux, 2nd Earl of Sefton.Grand National History . Tbheritage.com. Retrieved on 11 March 2011.The history of the Grand National . Grand-national-world.co.uk. Retrieved on 11 March 2011. Lynn set out a course, built a grandstand, and Lord Sefton laid the foundation stone on 7 February 1829. There is much debate regarding the first official Grand National; most leading published historians, including John Pinfold, now prefer the idea that the first running was in 1836 and was won by The Duke. This same horse won again in 1837, while Sir William was the winner in 1838.Grand National History 1839 – 1836 . The-grand-national.co.uk. Retrieved on 11 March 2011. These races have long been disregarded because of the belief that they took place at Maghull and not Aintree. However, some historians have unearthed evidence in recent years that suggests those three races were run over the same course at Aintree and were regarded as having been Grand Nationals up until the mid-1860s. Contemporary newspaper reports place all the 1836–38 races at Aintree although the 1839 race is the first described as \"national\".The Grand National Anomaly 1836–1838 . www.skittishlibrary.co.uk. 28 March 2015. To date, though, calls for the Nationals of 1836–1838 to be restored to the record books have been unsuccessful. The Duke was ridden by Martin Becher. The fence Becher's Brook is named after him and is where he fell in the next year's race.History of Victorian Liverpool historyofliverpool.com"]}, {"page": "William Lascelles", "response": ["*Georgiana Caroline Lascelles (1826-1911), married Charles William Grenfell, a grandson of William Molyneux, 2nd Earl of Sefton and had issue."]}, {"page": "Almack's", "response": ["* Maria Molyneux, Countess of Sefton, wife of William Molyneux, 2nd Earl of Sefton"]}, {"page": "Montagu Bertie, 7th Earl of Abingdon", "response": ["On 10 July 1858 he married Caroline Theresa Towneley (1838–1873) at the Roman Catholic Royal Bavarian Chapel in London. She was the daughter and co-heiress of Colonel Charles Towneley, a Member of Parliament for Sligo, and Lady Caroline Molyneux (daughter of William Molyneux, 2nd Earl of Sefton). They lived at Wytham Abbey in Berkshire (now Oxfordshire) and had four children together:"]}, {"page": "William Philip Molyneux, 2nd Earl of Sefton", "response": ["#REDIRECT William Molyneux, 2nd Earl of Sefton"]}, {"page": "William Craven, 6th Baron Craven", "response": ["* Maria Margaret, married William Molyneux, 2nd Earl of Sefton; she was one of the leaders of London society for many years "]}, {"page": "Elizabeth Craven", "response": ["* Maria Margaret, married William Molyneux, 2nd Earl of Sefton"]}, {"page": "List of nicknames of European royalty and nobility: W–Z", "response": ["*William Molyneux, 2nd Earl of Sefton "]}, {"page": "William Craven, 1st Earl of Craven (1770–1825)", "response": ["Craven was the eldest son of William Craven, 6th Baron Craven, and his wife Lady Elizabeth Berkeley.  Among his siblings was Maria Craven (wife of William Molyneux, 2nd Earl of Sefton) and Arabella Craven (wife of General the Hon. Frederick St John). In 1780, after thirteen years of marriage, and reported affairs on both sides, his parents parted permanently. After the death of his father in 1791, his mother married Charles Alexander, Margrave of Brandenburg-Ansbach. Charles' wife, Princess Frederica Caroline of Saxe-Coburg-Saalfeld, also died earlier in 1791."]}]}}