{"wiki_id": "http://www.wikidata.org/entity/Q8019736", "itemLabel": "William Vincent", "itemDescription": "English scholar and Dean of Westminster (1739–1815)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Vincent_(priest)", "wikipedia_page": {"main": "William Vincent (2 November 1739 – 21 December 1815) was Dean of Westminster from 1802 to 1815.", "link_mentions": [{"page": "Muscat", "response": ["Ptolemy's Map of Arabia identifies the territories of Cryptus PortusForster (1844), p.231. and Moscha Portus.Forster (1844), p.241. Scholars are divided in opinion on which of the two is related to the city of Muscat. Similarly, Arrianus references Omana and Moscha in Voyage of Nearchus. Interpretations of Arrianus' work by William Vincent and Jean Baptiste Bourguignon d'Anville conclude that Omana was a reference to Oman, while Moscha referred to Muscat.Forster (1844), p.173. Similarly, other scholars identify Pliny the Elder's reference to Amithoscuta to be Muscat."]}, {"page": "Arrian", "response": ["The voyage of Nearchus and Periplus of the Erythrean Sea were translated from the Greek by the then Dean of Westminster, William Vincent, and published in 1809. Vincent published a commentary in 1797 on The voyage of Nearchus.  The work was also translated into French by M. Billecocq, under the auspices of the government (cf. p. 321).The British Critic: A New Review, Volume 34 F. and C. Rivington, 1810 [Retrieved 2015-04-02]"]}, {"page": "Westminster School", "response": ["Since 1810, when the Head Master, William Vincent, fenced off and ordered the ploughing of the waste marshlands known as Tothill Fields for use by the school, which were being threatened by London's urban sprawl, the school's main sports ground has been nearby at Vincent Square, with football and cricket on the main area and tennis and netball on the courts; it also hosts a playground for Westminster Under School. At 13 acres, it is the largest private, open green space in Central London, despite this, it is not large enough for all pupils doing these sports to use simultaneously the three football pitches and typically one smaller practise pitch become one main cricket square and several smaller practise squares for the cricket season. So the school hires and owns other sporting facilities near the school. These include the oldest boating club in the world, an astroturf ground in Battersea, and the Queen Mother Sports Centre, home to a variety of sports. \"Green\" (Dean's Yard) is also used, as are the two school gyms, one in the Abbey Cloisters and one in the Weston Building, and the three Eton Fives courts in Ashburnham Garden, the garden behind Ashburnham House."]}, {"page": "St John's, Smith Square", "response": ["*1803–1807 William Vincent (as Dean of Westminster)"]}, {"page": "Poets' Corner", "response": ["| William Vincent"]}, {"page": "Jacob Bryant", "response": ["In his books on Troy, Bryant endeavoured to show that the existence of Troy and the Greek expedition were purely mythological, with no basis in real history. In 1791, Andrew Dalzel translated a work of Jean Baptiste LeChevalier as Description of the Plain of Troy. It provoked Bryant's Observations upon a Treatise ... (on) the Plain of Troy (1795) and A Dissertation concerning the War of Troy (1796?). A fierce controversy resulted, with Bryant attacked by Thomas Falconer, John Morritt, William Vincent, and Gilbert Wakefield."]}, {"page": "Sion College", "response": ["*1798. William Vincent, D.D. Rector of Allhallows, Thames Street."]}, {"page": "Islip, Oxfordshire", "response": ["Edward the Confessor (born circa 1004, died 1066) was born in Islip and tradition holds that he was baptised in a church here. Parts of the present church date from about 1200. The chancel was rebuilt in 1780 and the church was restored in 1861. The church is Islip's only Grade I Listed Building. The belltower has a ring of eight bells. Since 1987 the Church of England parish has been part of the Ray Valley Benefice.  A chapel associated with Edward the Confessor existed north of the church. The chapel was damaged in April 1645 in a military engagement in the English Civil War, and in the 1780s it was demolished.  The former rectory was built in 1689 for Robert South and enlarged in 1807 for William Vincent. It is one of several Grade II* Listed Buildings in Islip."]}, {"page": "Vincent Square", "response": ["It was appropriated in the 18th century on land originally known as Tothill Fields, by William Vincent, a former Dean of Westminster and headmaster of Westminster School who simply paid a man with a horse and plough to enclose the square with a mound and ditch. Previous uses include a death camp and cemetery for 1,200 Scottish prisoners starved to death after the Battle of Worcester in 1651, a large burial pit for victims of the Great Plague of London in 1665/6, a jail named Tothill Fields Bridewell, and a well-known bear-baiting den recorded in the reign of Queen Anne. The space, facing buildings and certain others surrounding form the Vincent Square Conservation Area."]}, {"page": "Dean of Westminster", "response": ["|William Vincent"]}, {"page": "William Vincent (Dean)", "response": ["#REDIRECT William Vincent (priest)"]}, {"page": "Public school (United Kingdom)", "response": ["In 1801 William Vincent, headmaster of Westminster published A Defence of Public Education. It contains the text \"...comprize under the expression of Public Schools? Are we to understand only Winchester, Eton and Westminster? or are we to extend our notion, as we ought to do, to the other three great schools in the Metropolis; to Harrow, Rugby, Manchester, Wakefield and many more of equal magnitude in the North?\""]}]}}