{"wiki_id": "http://www.wikidata.org/entity/Q8012369", "itemLabel": "William Hobbs", "itemDescription": "British choreographer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hobbs_(choreographer)", "wikipedia_page": {"main": "William Hobbs (29 January 1939 – 10 July 2018) was a choreographer of stage combat.Born in Hampstead, London, he arranged some of the most notable scenes of cinematic fencing from the 1960s to the 2000s as well as working in theatre productions.", "link_mentions": [{"page": "Rapier", "response": ["* Despite the rapier's common usage in the 16th–17th centuries, many films set in these periods (many starring Errol Flynn) have the swordsmen using épées or foils. Actual rapier combat was hardly the lightning thrust and parry depicted. Director Richard Lester and fight choreographer William Hobbs attempted to more closely match traditional rapier technique in The Three Musketeers and The Four Musketeers. Since then, many newer movies, like The Princess Bride and La Reine Margot have used rapiers rather than later weapons, although the fight choreography has not always accurately portrayed historical fencing techniques. Rapiers are also often featured in various video games, in particular role-playing games set in medieval- and Renaissance-inspired worlds."]}, {"page": "1977 in film", "response": ["| The Duellists || Paramount Pictures / Enigma Productions / National Film Finance Consortium || Ridley Scott (director); Gerald Vaughan-Hughes (screenplay); Keith Carradine, Harvey Keitel, Albert Finney, Tom Conti, Edward Fox, Cristina Raines, Robert Stephens, John McEnery, Arthur Dignam, Diana Quick, Alun Armstrong, Maurice Colbourne, Gay Hamilton, Meg Wynn Owen, Jenny Runacre, Alan Webb, Matthew Guinness, Dave Hill, William Hobbs, W. Morgan Sheppard, Liz Smith, Hugh Fraser, Michael Irving, Tony Matthews, Pete Postlethwaite, Stacy Keach || Historical, Drama || Live Action"]}, {"page": "Swashbuckler", "response": ["Consequently, when movie theaters mushroomed, ambitious actors took the chance to present their accordant skills on the screen. Since silent movies were no proper medium for long dialogues, the classic stories about heroes who would defend their honour with sword in hand were simplified and sheer action would gain priority. This was the birth of a new kind of film hero: the swashbuckler. For Hollywood actors to depict these skilled sword fighters, they needed advanced sword training. Four of the most famous instructors for swashbuckling swordplay are William Hobbs, Anthony De Longis, Bob Anderson and Peter Diamond."]}, {"page": "Macbeth (1971 film)", "response": ["The production was troubled by poor weather, and the cast complaining of Polanski's \"petulance\". Fight director William Hobbs likened the long rehearsals in the rain to \"training for the decathlon\"."]}, {"page": "Rob Roy (1995 film)", "response": ["William Hobbs choreographed the swordfights, with Robert G. Goodwin consulting."]}, {"page": "The Duellists", "response": ["* William Hobbs as Swordsman", "The film is lauded for its historically authentic portrayal of Napoleonic uniforms and military conduct, as well as its generally accurate early-19th-century fencing techniques as recreated by fight choreographer William Hobbs.. "]}, {"page": "The Karnstein Trilogy", "response": ["| William Hobbs"]}, {"page": "The Three Musketeers (1973 live-action film)", "response": ["The film adheres closely to the novel, and also injects a fair amount of humor. It was shot by David Watkin, with an eye for period detail. The fight scenes were choreographed by master swordsman William Hobbs."]}, {"page": "Captain Kronos – Vampire Hunter", "response": ["Carla seeks refuge at Durward Manor to distract the household while Kronos sneaks inside.  The \"bedridden\" Lady Durward reveals herself as the newly-youthful vampire, and she hypnotises Carla and the Durward siblings. Lady Durward has raised her husband Hagen (William Hobbs) from the grave. She offers the mesmerised Carla to her husband, but Kronos erupts from hiding. Kronos uses the new sword's mirrored blade to turn Lady Durward's hypnotic gaze against her. He kills Lord Durward in a duel, and then destroys Lady Durward.", "* William Hobbs as Hagen"]}, {"page": "Combat in film", "response": ["Also notable in the early period were Ramon Novarro, Rudolph Valentino, and John Barrymore. Fencing masters (fight arrangers) from the time include Henry Uttenhove, Fred Cavens, Ralph Faulkner, Jean Heremans, Bob Anderson, William Hobbs, and Claude Carliez.", "Renewed interest in swashbuckling films arose in the 1970s, in the wake of The Three Musketeers (1973). Directors at this stage aimed for a certain amount of historical accuracy, although, as the 2007 Encyclopædia Britannica puts it, \"movie fencing remains a poor representation of actual fencing technique\". A notable fight arranger of this period is William Hobbs.", "Films such as The Duellists, fight directed by William Hobbs, Once Were Warriors, fight directed by Robert Bruce and Troy, fight directed by Richard Ryan are widely famed for including gritty, realistic combat scenes."]}, {"page": "William Hobbs", "response": ["William Hobbs or Bill Hobbs may refer to:", "*William Hobbs (politician) (1822–1890), doctor and politician in colonial Queensland", "*William Hobbs (choreographer) (1939–2018), choreographer of staged fights"]}, {"page": "David L. Boushey", "response": ["Boushey was born in 1942 in the city of Everett, Washington where he spent his first 15 years. At age 16 he moved with his family to Seattle where he graduated in the first graduating class from Ingraham High School in 1961. Boushey graduated from Central Washington University in 1969. After two years as an account executive with the Seattle Post Intelligencer he decided to fulfil his dream of becoming an actor. Boushey went to England where he trained at the prestigious East 15 Acting School founded by the legendary  Joan Littlewood (A Taste of Honey, and Oh What a Lovely War). It was at EAST 15 where he met fight master Ian McKay who introduced him to the art of stage combat. After two and a half years working with the likes of William Hobbs (The Three/Four Musketeers...1974) he returned home to Seattle where he founded the Society of American Fight Directors in 1977. In 1985 he founded the United Stuntmen's Association and in 1991 he founded the International Stunt School."]}, {"page": "2018 in the United Kingdom", "response": ["**William Hobbs, 79, British fencer and fight choreographer (Willow, Flash Gordon, Rob Roy), dementia."]}, {"page": "Deaths in July 2018", "response": ["*William Hobbs, 79, British fencer and fight choreographer (Willow, Flash Gordon, Rob Roy), dementia.William Hobbs, Fight Director on Swashbuckling Classics 'The Duellists' and 'Rob Roy,' Dies at 79"]}]}}