{"wiki_id": "http://www.wikidata.org/entity/Q8018425", "itemLabel": "William Sidebottom", "itemDescription": "British politician (1841-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Sidebottom_(politician)", "wikipedia_page": {"main": "William Sidebottom (1841 – 3 January 1933) was an English  Conservative politician who represented High Peak.\nSidebottom was born at Hollingworth, then in Cheshire, the son of William and Agnes Sidebottom, and came from a  family that was associated with cotton mills. He had a military background and attained the rank of Colonel.\nAround 1870, William Sidebottom and his sister Lucy took over Harewood Lodge,  one of the old family homes at Broadbottom and became leading figures in the village. He was a Town Councillor, Justice of the Peace and Captain of the Local Volunteers. He was elected Member of Parliament for High Peak in 1885, and held the seat until 1900. Sidebottom was deputy chairman of Cammell Laird.\n\n", "link_mentions": [{"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| William Sidebottom"]}, {"page": "High Peak (UK Parliament constituency)", "response": ["| William Sidebottom"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| William Sidebottom"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| William Sidebottom"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| William Sidebottom"]}, {"page": "John Frederick Cheetham", "response": ["Sometime in the 1870s he took over control of the family business, which at that time employed 1,400 in the two mills. He contested several elections before being returned as MP for North Derbyshire at the 1880 general election. He held that seat for five years, until the constituency was abolished at the 1885 general election, when he stood unsuccessfully in the new High Peak constituency, losing to the Conservative Party candidate William Sidebottom by only 9 votes (0.2% of the total)."]}, {"page": "Sidebottom", "response": ["*William Sidebottom (cricketer) (1862-1948), Australian cricketer", "*William Sidebottom (politician) (1841-1933), English Conservative politician who represented High Peak", "*William Sidebottom (RAF officer) DFC (1893-1920), British World War I flying ace credited with fourteen aerial victories"]}, {"page": "William Sidebottom", "response": ["William Sidebottom may refer to:", "* William Sidebottom (politician) (1841–1933), English Conservative politician", "* William Sidebottom (RAF officer) (1893–1920), British World War I flying ace", "* William Sidebottom (cricketer) (1862–1948), Australian cricketer"]}]}}