{"wiki_id": "http://www.wikidata.org/entity/Q8013432", "itemLabel": "William James Blacklock", "itemDescription": "British landscape artist (1816-1858)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_James_Blacklock", "wikipedia_page": {"main": "William James Blacklock (3 March 1816 – 12 March 1858) was an English landscape painter, painting scenery in Cumbria, the Lake District and the Scottish Borders.", "link_mentions": [{"page": "March 3", "response": ["*1816 – William James Blacklock, English-Scottish painter (d. 1858)"]}, {"page": "Shoreditch", "response": ["*William James Blacklock, British landscape artist, was born in Shoreditch in 1816"]}, {"page": "List of British artists", "response": ["* William James Blacklock (1816–1858) – English landscape artist, painting scenery in Cumbria, the Lake District and the Scottish Borders"]}, {"page": "List of Cumbria-related topics", "response": ["* William James Blacklock – 19th century landscape artist"]}, {"page": "Cumwhitton", "response": ["===William James Blacklock===", "The landscape artist and lithographer William James Blacklock lived in Cumwhitton from 1818 to 1836 and from 1850 to 1854. He painted scenery in Cumbria, the Lake District, and the Scottish Borders. In 1818 Blacklock moved from London to Cumwhitton.William Blacklock's Biography, Retrieved 26/04/2012 He is believed to have lived in Cumwhitton House with his family. Blacklock moved back to London in 1836; but in 1850 his health deteriorated and he moved back to Cumwhitton. William James Blacklock died on 12 March 1858, and was buried on 16 March 1858 in Cumwhitton. Thirty-three pieces of Blacklock's work are on display at the Tullie House Museum and Art Gallery, Carlisle.Tullie House Museum and Art Gallery , Retrieved 26/04/2012"]}, {"page": "The Crichton", "response": ["Psychotherapist Ursula Fleming was educated at the hospital and Kate Fraser an early Scottish woman psychiatrist was a junior resident at the hospital. Among the people to have been treated there are artist Charles Altamont Doyle (father of Sir Arthur Conan Doyle), William James Blacklock, Lydia Miller (widow of Hugh Miller), and feminist writer Dora Marsden. An unidentified female patient of Dr James Gilchrist featured as an illustration (Figure 19) in Charles Darwin's The Expression of the Emotions in Man and Animals (1872)."]}, {"page": "Blacklock", "response": ["*William James Blacklock (1816–1858), English landscape painter, painting scenery in Cumbria and the Scottish Borders"]}, {"page": "List of people from Carlisle", "response": ["*William James Blacklock, 19th-century landscape artist, studied in Carlisle and later had a studio in Stanwix"]}, {"page": "William Blacklock", "response": ["*William James Blacklock (1816–1858), English landscape painter"]}]}}