{"wiki_id": "http://www.wikidata.org/entity/Q8013914", "itemLabel": "William Kendall", "itemDescription": "British actor (1903-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Kendall_(actor)", "wikipedia_page": {"main": "William Kendall (born 26 August 1903 in London, England – died 1 April 1984 aged 80) was a British film, stage and television actor. He appeared in the West End in several musicals starring Jack Buchanan including Mr. Whittington and This'll Make You Whistle. He starred in the 1953 play Four Winds by Alex Atkinson.\n\n", "link_mentions": [{"page": "Randall and Hopkirk (Deceased)", "response": ["*William Kendall"]}, {"page": "Debt of Honour", "response": ["* William Kendall as Paul Martin"]}, {"page": "The Wednesday Play", "response": ["| Lally BowersWilliam KendallFrederick JaegerJames VilliersGerald CrossMichael CrazeGábor Baraker"]}, {"page": "Theatre 625", "response": ["|Lally Bowers,William Kendall,Frederick Jaeger,James Villiers", "|Leonard Rossiter,Alison Leggatt,Barrie Ingham,William Kendall"]}, {"page": "The Great St Trinian's Train Robbery", "response": ["*William Kendall as Mr Parker"]}, {"page": "The Rag Trade", "response": ["| This episode no longer existsGuest Stars: Charlie Bird, William Kendall, Frank Peters and Harry Landis"]}, {"page": "The Two Faces of Dr. Jekyll", "response": ["*William Kendall as Clubman (uncredited)"]}, {"page": "The House on Haunted Hill", "response": ["*William Kendall as Col. Jarrett"]}, {"page": "William Kendall", "response": ["William Kendall may refer to:", "*William Kendall (actor) (1903–1984), British actor, appeared in The Two Faces of Dr. Jekyll", "*William Kendall (cricketer) (born 1973), English cricketer", "*William Kendall (swimmer) (1916–2004), Australian swimmer", "*William Kendall (burgess 1657) (1621–1686), Virginia colonial politician, Speaker of the Virginia House of Burgesses", "*William Kendall (burgess 1688) (1659–1696), his son, Virginia colonial politician, Member of the Virginia House of Burgesses", "*William Kendall, character in The $5,000,000 Counterfeiting Plot"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* William Kendall"]}, {"page": "The Other Man (1964 TV programme)", "response": ["* William Kendall as Major Norriss "]}, {"page": "List of British films of 1959", "response": ["|Strictly Confidential ||Charles Saunders || Richard Murdoch, William Kendall || Comedy ||"]}, {"page": "List of British films of 1933", "response": ["|The King's Cup||Herbert Wilcox, Alan Cobham ||Chili Bouchier, William Kendall ||Drama||"]}, {"page": "List of British films of 1936", "response": ["|This'll Make You Whistle||Herbert Wilcox||Jack Buchanan, Elsie Randolph, William Kendall ||Musical comedy ||"]}, {"page": "Persuasion (1971 TV series)", "response": ["* William Kendall as Mr. Musgrove"]}, {"page": "Dance, Little Lady", "response": ["* William Kendall as Mr. Matthews  "]}, {"page": "Idol on Parade", "response": ["* William Kendall as Commanding Officer"]}, {"page": "A Touch of Larceny", "response": ["* William Kendall as Tom"]}, {"page": "Twelve Angry Men (Hancock's Half Hour)", "response": ["*William Kendall\t...\tJuror"]}, {"page": "Goodnight, Vienna", "response": ["* William Kendall - Ernst"]}, {"page": "Left Right and Centre", "response": ["* William Kendall - Pottle"]}, {"page": "Jumping for Joy", "response": ["* William Kendall as Blenkinsop"]}, {"page": "Strictly Confidential (film)", "response": ["Strictly Confidential is a 1959 British comedy film directed by Charles Saunders and starring Richard Murdoch, William Kendall, Maya Koumani and Neil Hallett. Two con-men, recently released from prison, are enlisted by a widow to help her recover control of her late husband's business which has been taken from her.BFI.org", "Released from prison, two genteel con-men, former Commander Binham-Ryley (Richard Murdoch) and former Major Rory McQuarry (William Kendall), target a beautiful and wealthy young widow (Maya Koumani) who hires them to run her factory. What the crooks fail to realise is that Maxine Millard has devious schemes of her own in mind.", "* William Kendall as Major Rory McQuarry"]}, {"page": "The King's Cup", "response": ["The King's Cup is a 1933 British drama film directed by Alan Cobham, Donald Macardle, Herbert Wilcox and Robert Cullen and starring Chili Bouchier, Harry Milton and William Kendall.BFI | Film & TV Database | The KING'S CUP (1933). Ftvdb.bfi.org.uk (16 April 2009). The film is named after the King's Cup Air Race, established by King George V in 1922 as an endurance race across Britain, to encourage development in engine design and the sport of aviation. Stars Chili Bouchier and Harry Milton were married at the time the film was made.", "* William Kendall – Captain Richards"]}, {"page": "This'll Make You Whistle", "response": ["This'll Make You Whistle is a 1936 British musical comedy film directed by Herbert Wilcox and starring Jack Buchanan, Elsie Randolph and William Kendall. The film was based on the stage musical of the same title which Buchanan had starred in.", "* William Kendall as Reggie Benson"]}, {"page": "Doctor's Orders (film)", "response": ["* William Kendall as Jackson"]}, {"page": "The Sky's the Limit (1938 film)", "response": ["The Sky's the Limit  is a 1938 British musical comedy film directed by Jack Buchanan and Lee Garmes and starring Buchanan, Mara Losseff and William Kendall.BFI.org"]}, {"page": "Blind Folly", "response": ["* William Kendall as Raine"]}, {"page": "List of Elstree Studios productions", "response": ["| The King's Cup || Donald Macardle, Herbert Wilcox, Robert Cullen || Chili Bouchier, Harry Milton, William Kendall", "| This'll Make You Whistle || Musical comedy || Herbert Wilcox || Jack Buchanan, Elsie Randolph, William Kendall"]}, {"page": "That's a Good Girl", "response": ["* William Kendall as Timothy  "]}, {"page": "Sweet Devil", "response": ["Sweet Devil is a 1938 British musical comedy film directed by René Guissart and starring Bobby Howes, Jean Gillie and William Kendall. It was made at Pinewood Studios.Wood p.97", "* William Kendall as Edward Bane  "]}, {"page": "Live Now, Pay Later", "response": ["* William Kendall as Major Simpkins"]}, {"page": "Further Adventures of Lucky Jim", "response": ["Other actors who appeared in the series include Suzy Kendall, Nerys Hughes, John Le Mesurier, Francis Matthews, Eunice Gayson, John Junkin, Donald Hewlett, William Kendall, Robert Raglan, Felix Bowness, Janina Faye, Patrick Newell, Diana King and Michael Balfour."]}, {"page": "This'll Make You Whistle (musical)", "response": ["The show was created as a vehicle for the entertainer Jack Buchanan. The original London cast also included Jean Gillie, Elsie Randolph, William Kendall, David Hutcheson and Gordon Craig. Buchanan produced the show himself, in conjunction with C.B. Cochran. The sets were designed by the art director Clifford Pember.Wearing p.545"]}, {"page": "Mr. Whittington", "response": ["After premiering at the Alhambra Theatre, Glasgow in November 1933, it then transferred to London's West End where it ran for 300 performances between 1 February and 20 October 1934 initially at the London Hippodrome before transferring to the Adelphi Theatre. As well as Buchanan the original cast also included Elsie Randolph, Alfred Drayton, Fred Emney, William Kendall, Laurence Naismith and Kathleen Gibson.Wearing p.338"]}, {"page": "Charlesworth at Large", "response": ["* William Kendall as Stanley"]}, {"page": "Deadline Midnight (TV series)", "response": ["A large number of other actors appeared in episodes of the show including Michael Caine, Derek Farr, Harry H. Corbett, Sarah Miles, Nanette Newman, Sydney Tafler, Valerie White, Alethea Charlton, Nyree Dawn Porter, Jane Merrow, George Coulouris, Claire Gordon, Kenneth Cope, Richard Pearson, Dilys Laye, Ronald Lacey, Larry Martyn, Warren Mitchell, Frank Pettingell, Esmond Knight, John Welsh, Michael Robbins, Pamela Brown, Meredith Edwards, Billy Milton, Reginald Marsh, George Woodbridge, Peter Illing, John Ringham, William Kendall, Stratford Johns, John Barrie, Richard Vernon, John Barron, Anthony Sharp, Wensley Pithey, Bernard Archard, Patricia Burke, Bernard Kay, Derek Newark, Timothy West, Frederick Jaeger, Charles Lloyd Pack, Rita Webb, John Arnatt, Neil Hallett, Derek Francis, Arthur Brough, Elsie Wagstaff, Tenniel Evans, Carmen Silvera, Patrick Newell, Desmond Llewelyn, Jennifer Hilary, Allan Cuthbertson, Lloyd Lamble, David Hemmings and James Beck."]}, {"page": "Four Winds (play)", "response": ["It premiered at the Theatre Royal, Brighton before transferring to the Phoenix Theatre in London's West where it ran for 38 performances between 29 September and 31 October 1953. The original cast included William Kendall, Frank Lawton, Raymond Francis, Peggy Evans, Betty Ann Davies and Patricia Cutts.Wearing p.257 It then went on tour."]}]}}