{"wiki_id": "http://www.wikidata.org/entity/Q8017359", "itemLabel": "William Randell", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Randell", "wikipedia_page": {"main": "William Richard Randell \"Captain Randell\" (2 May 1824 – 4 March 1911), was an Australian politician and pioneer born in Devon, England, who emigrated to the newly founded colony of South Australia in 1837 with his family. He was a pioneer of the riverboat industry on the River Murray and represented the Electoral district of Gumeracha in the South Australian House of Assembly from 1893 to 1899.\nCaptain Randell can also refer to his son (Richard) Murray Randell (2 February 1863 – 6 March 1952), who took over management of his father's small fleet of River Murray paddle steamers.", "link_mentions": [{"page": "Murray River", "response": ["Shipping cannot enter the Murray from the sea because it does not have an estuary. However, in the 19th century the river supported a substantial commercial trade using shallow-draft paddle steamers, the first trips being made by two boats from South Australia on the spring flood of 1853. The Lady Augusta, captained by Francis Cadell, reached Swan Hill while another, Mary Ann, captained by William Randell, reached Moama (near Echuca). In 1855 a steamer carrying gold-mining supplies reached Albury but Echuca was the usual turn-around point, though small boats continued to link with up-river ports such as Tocumwal, Wahgunya and Albury.Railways and Riverboats Rowland, E.C. Australian Railway Historical Society Bulletin, January 1976 pp1-16"]}, {"page": "Timeline of Australian history", "response": ["| rowspan=\"2\" style=\"vertical-align:top;\"| 1853 || || First paddle steamers on Murray River on the spring flood. From South Australia, the Lady Augusta captained by Francis Cadell, reached Swan Hill while Mary Ann captained by William Randell, made it as far as Moama (near Echuca)."]}, {"page": "Francis Cadell (explorer)", "response": ["Cadell's claim on being the pioneer of inland navigation on the Murray is contested. J. G. and William Randell had constructed an earlier steamer which had traded on the Murray as early as March 1853, and at the time of the Cadell's first voyage upstream on Lady Augusta, Randell's Mary-Ann had progressed further up the river and at a greater speed. Neither of the first two paddle steamers to grace the waters of the Murray River were eligible for the bonus offered by the government. A. T. Saunders was a perennial critic, calling Cadell an \"overrated braggart\"."]}, {"page": "Willandra Lakes Region", "response": ["The great boon to the pastoral occupation of the Darling and the back blocks was the navigation of the Murray and its tributaries from South Australia. Francis Cadell and William Randell pioneered river navigation during 1853 and within six months of their maiden voyages on the Darling the value of river properties had doubled."]}, {"page": "Swan Hill", "response": ["In 1853 Francis Cadell navigated the Murray river from its mouth in South Australia to Swan Hill in his paddle steamer, Lady Augusta. He arrived on 17 September 1853, narrowly beating William Randell of Mannum, who arrived 4 hours later in the PS Mary Ann. This demonstrated the feasibility of river traffic, which flourished until the introduction of the railway."]}, {"page": "History of South Australia", "response": ["South Australians were keen to establish trade links with Victoria and New South Wales, but overland transport was too slow. A £4,000 prize was offered in 1850 by the South Australian government for the first two people to navigate the River Murray in an iron steamboat as far as its junction with the Darling River. In 1853 William Randell of Mannum and Francis Cadell of Adelaide, unintentionally making the attempt at the same time, raced each other to Swan Hill with Cadell coming in first."]}, {"page": "Brewarrina", "response": ["In 1859 a riverboat called Gemini, skippered by William Randell, reached the town. This opened the possibility of developing the town as a port, and by the early 1860s Brewarrina was recognised as the furthest navigable point on the Darling River. Brewarrina became a port for shipping wool to Adelaide via the Darling and Murray rivers. The town was formally surveyed and laid out in 1861 and proclaimed on 28 April 1863."]}, {"page": "John Hart (South Australian colonist)", "response": ["*William Randell"]}, {"page": "1911 in Australia", "response": ["* 4 March – William Randell, South Australian politician and pioneer (born in the United Kingdom) (b. 1824)"]}, {"page": "William Randall", "response": ["* William Randell (1824–1911), South Australian pioneer and riverboat captain"]}, {"page": "Randell", "response": ["*William Randell (1824–1911), Australian riverboat pioneer and politician"]}, {"page": "Mannum", "response": ["The first European settlement in the area was in 1840. The first ship (a side-wheel paddle steamer) built on the Murray River was launched at Mannum by William Randell in 1852. A shipbuilding industry continued in Mannum until into the 20th century. William Randell is memorialised by the preservation of the rectangular boiler from the paddle wheeler Mary Ann in the town's recreation park. His dry dock held the Marion, an 1897 built paddle wheeler; managed by the National Trust of South Australia as a museum. The Marion left active service in 1950 and spent until 1963 as a boarding house.Larkins & Parish 1982, p.186 The Marion was recommissioned in 1994 and currently operates as a daytrip and overnight cruising vessel along the Murray.", "* Randell Street: William Randell's Dry Dock"]}, {"page": "Captain Randell", "response": ["#REDIRECT William Randell"]}, {"page": "William Beavis Randell", "response": ["#REDIRECT William Randell"]}, {"page": "George Ritchie (politician)", "response": ["Ritchie was the third son of Captain James Ritchie (1832 – 23 April 1881) and his wife Alison (12 August 1829 – 20 February 1913). This article has much additional material on James and Alison Ritchie. Captain James Ritchie, and five others left Scotland for Australia in the early 1850s sailing the Lioness, a 75-ton River Mersey steamer for Captain Cadell, then became a shipowner trading on the River Murray and Murrumbidgee, when his name was as familiar as those of William Randell and Cadell. One of his feats was to captain the Gundagai, a river boat of 129 feet length, to New Zealand with gold to finance the Maori war. Ritchie was born at Goolwa in 1864, was educated at the Echuca Grammar School, and after four years' apprenticeship with a draper, joined his father on the river. In 1884, two years after his father's death, he entered into partnership with his two brothers as a steamboat owner on the Murray. Their first ship was the Pioneer. He bought his brothers out a few years later, and in the course of his 40 years of active trading on the river, he owned about a dozen boats. When the districts of Encounter Bay, Mount Barker and Noarlunga were amalgamated to form the district of Alexandra, Ritchie was elected to the House of Assembly as one of its members."]}, {"page": "Political families of South Australia", "response": ["*William Randell \"Captain Randell\" (1824–1911) MHA for Gumeracha 1893–1899."]}, {"page": "John Darling and Son", "response": ["*William Randell"]}, {"page": "John Dunn (miller)", "response": ["For a time he managed the South Australian Company's first steam mill in Adelaide, which had been set up by William Randell.", "*William Randell"]}, {"page": "William Richard Randell", "response": ["#REDIRECT William Randell"]}, {"page": "W. B. Randell", "response": ["#REDIRECT William Randell#Early years"]}, {"page": "A. T. Saunders", "response": ["Saunders had a very jaundiced view of the personality and achievements of Francis Cadell, comparing him unfavourably with Charles Sturt and William Randell and accusing him of \"childish vanity\" and called his pioneering paddle-steamer Lady Augusta (or Lady Agusta as he delighted in referring to the spelling by which she was registered) a \"two-funnelled monstrosity\". \"Cadell\", said Saunders, \"had plenty of political, financial, and Adelaide Government House pull . . . and Government money was poured into his pockets. His father, relatives, friends, and clique kept him well before the public and in the press. Lieutenant-Governor Young and Governor MacDonnell omitted from despatches that the Randells had the Mary Ann on the Murray months before Cadell had the Lady Augusta; yet Cadell failed, and whined that he had been ruined by competition . . .  he did not stick to his Murray River business, but was running round seeking for notoriety and the limelight, and asking for concessions. Randell had not powerful moneyed friends, such as Cadell had; yet, undismayed by bad luck, Randell plugged on, stuck to the river, and succeeded. The Randells personally, and not by proxy, made a success of river navigation, and in so doing showed boldness, courage, and originality.\""]}, {"page": "Thomas Goode (merchant)", "response": ["Goolwa was at the entrance through the Murray Mouth through which Captain Cadell's steamer the Lady Augusta made its first trip up the river as far as Swan Hill with Governor Young and party, and from where William Randell in Mary Ann made the same trip with little fanfare. The River Murray Steam Navigation Company followed, the tramway to Port Elliot was constructed, and the famous attempt at a breakwater there, later abandoned. It became a major transport hub before the construction of the road network, particularly of wool and wheat."]}, {"page": "W. R. Randell", "response": ["#REDIRECT William Randell"]}, {"page": "William James Magarey", "response": ["*William Randell"]}, {"page": "Murray–Darling steamboat people", "response": ["| George Knight ||  ||  ||  || William Randell 1935 ||  || "]}, {"page": "Members of the South Australian House of Assembly, 1893–1896", "response": ["|| William Randell || NDL || Gumeracha || 1893–1896, 1896-1899"]}, {"page": "Hugh Craine Kelly", "response": ["*Edward Kelly (1858 – 30 March 1931) married Mary Ann \"May\" Randell (28 January 1860 – 17 February 1931) of Gumeracha on 20 July 1882, and farmed at \"Sulby Glen\", Cudlee Creek. Mary Ann was a daughter of William Randell, the riverboat pioneer; his paddle-steamer Mary Ann was named for her."]}, {"page": "Randell, William", "response": ["#redirectWilliam Randell"]}, {"page": "Pirie Street Brewery", "response": ["*William Polhill Wicksteed (1853 – 26 September 1913) was born in North Adelaide, son of Frederic Wicksteed and Emma Wicksteed, née Kell, and educated at Whinham College and St. Peter's College. He was involved in the Commercial Travellers' Association. A daughter married a son of William Randell."]}, {"page": "Hay Post Office", "response": ["The locality where Hay township developed was originally known as Lang's Crossing-place (named after three brothers named Lang who were leaseholders of runs on the southern side of the river). It was the crossing on the Murrumbidgee River of a well-travelled stock-route (known as 'the Great North Road') leading to the markets of Victoria. In 1856-7 Captain Francis Cadell, pioneer of steam-navigation on the Murray River, placed a manager at Lang's Crossing-place with the task of establishing a store (initially in a tent). In August 1858 steamers owned by rival owners, Francis Cadell and William Randell, successfully travelled up the Murrumbidgee as far as Lang's Crossing-place (with Cadell's steamer Albury continuing up-river to Gundagai). By October 1859 \"Hay\" had been chosen as the name for the township [after John Hay (later Sir John), a wealthy squatter from the Upper Murray, member of the NSW New South Wales Legislative Assembly and former Secretary of Lands and Works]. Hay, situated on the Murrumbidgee, was gazetted as a town in 1859. In the late nineteenth century, several grand buildings representing Hay's aspirations to become the capital of the Riverina were built. However inter-colonial disputes over trade thwarted these aspirations and instead of booming Hay remained small and isolated, but importantly connected to Sydney via a rail line."]}, {"page": "Bishops Lodge", "response": ["The locality where Hay township developed was originally known as Lang's Crossing-place (named after three brothers named Lang who were leaseholders of runs on the southern side of the river). It was the crossing on the Murrumbidgee River of a well-travelled stock-route (known as 'the Great North Road') leading to the markets of Victoria. In 1856-7 Captain Francis Cadell, pioneer of steam-navigation on the Murray River, placed a manager at Lang's Crossing-place with the task of establishing a store (initially in a tent). In August 1858 steamers owned by rival owners, Francis Cadell and William Randell, successfully travelled up the Murrumbidgee as far as Lang's Crossing-place (with Cadell's steamer Albury continuing up-river to Gundagai). By October 1859 \"Hay\" had been chosen as the name for the township [after John Hay (later Sir John), a wealthy squatter from the Upper Murray, member of the New South Wales Legislative Assembly and former Secretary of Lands and Works]. Hay, situated on the Murrumbidgee, was gazetted as a town in 1859.DUAP et al, Regional Histories, pp194 In the late nineteenth century, several grand buildings representing Hay's aspirations to become the capital of the Riverina were built. However inter-colonial disputes over trade thwarted these aspirations and instead of booming Hay remained small and isolated, but importantly connected to Sydney via a rail line.Hay Council SHI nomination 2006"]}]}}