{"wiki_id": "http://www.wikidata.org/entity/Q8015892", "itemLabel": "William Mount", "itemDescription": "British Tory politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Mount_(Isle_of_Wight_MP)", "wikipedia_page": {"main": "William Mount DL of Wasing Place, Berkshire (21 November 1787 – 10 April 1869) was a British Tory politician.\nHe was the son of William Mount (3 January 1753 – 15 June 1815) and his wife (m. 4 October 1781) Jenny (? – 11 October 1843), daughter of Thomas Page. His paternal grandfather, John Mount (? – 1786; son of William Mount and Jane Huckell), High Sheriff of Berkshire in 1770, built Wasing Place. The Mount family were in business as stationers at Tower Hill, London from the late seventeenth century.He is the great-great-grandfather of Ferdinand Mount and the great-great-great-grandfather of Prime Minister of the United Kingdom David Cameron. He was educated at Eton College (1802–05) and Oriel College, Oxford (1805).William Mount was the Member of Parliament (MP) for Yarmouth from 1818 to 1819 and for Newport, Isle of Wight from 1831 to 1832. He was appointed High Sheriff of Berkshire for 1826–27.He married, on 27 June 1818, Charlotte (d. 17 January 1879), the daughter and coheiress of George Talbot of Temple Guiting, Gloucestershire. They had 2 sons, including William George Mount, and 2 daughters.His wife was the daughter of George Talbot (1763–1836) and wife (m. 4 January 1789) Charlotte Elizabeth Drake (? – 1817), paternal granddaughter of The Hon. Rev. George Talbot (a son of the 1st Baron Talbot), of Guiting, Gloucester (d. 1765 or 19 November 1782) and wife (m. 3 January 1761) The Hon. Anne de Bouverie (1729 – 31 December 1813) (a daughter of the 1st Viscount Folkestone), and maternal granddaughter of The Rev. Thomas Drake and wife.", "link_mentions": [{"page": "William Mount", "response": ["William Mount may refer to:", "* William Mount (Isle of Wight MP) (1787–1869), Member of Parliament for Yarmouth and Newport, Isle of Wight", "* Sir William Mount, 1st Baronet (1866–1930), MP for Newbury", "* Sir William Mount, 2nd Baronet (1904–1993), British Army officer"]}, {"page": "William George Mount", "response": ["The son of William Mount, of Wasing Place, Berkshire, he became a Magistrate in 1851, and High Sheriff in 1877. He was narrowly elected in the general election of 1885, beating his Liberal opponent by 202 votes. He was chairman of Quarter Sessions from 1887 to 1902, and was the first Chairman of Berkshire County Council from 1889 to 1906.", "He was the father of Sir William Mount, 1st Baronet, brother-in-law of Richard Fellowes Benyon, MP, of Englefield and great-great grandfather to David Cameron, who was Prime Minister of the United Kingdom from 2010 to 2016."]}, {"page": "Newport (Isle of Wight) (UK Parliament constituency)", "response": ["|William Mount"]}, {"page": "Wasing", "response": ["Wasing Place, Wasing Park, and the Wasing Estate, including woodland, are largely owned and managed by Joshua Dugdale, who inherited them from his mother, Lady Cecilia Dugdale.Pitcher, Claire Joshua Dugdale on restoration projects at Wasing Estate and his love for filmmaking, Berkshire Life, 14 September 2015 Its manor is centred on a manor house which was purchased in 1759 by the London nautical publisher John Mount. He built the mansion Wasing Place, completed in 1770, which became the home of his descendants the MPs, William Mount, William George Mount and Sir William Mount. The house was partially rebuilt in 1954 after a fire in 1945."]}, {"page": "Yarmouth (Isle of Wight) (UK Parliament constituency)", "response": ["| William Mount"]}, {"page": "Joshua Dugdale", "response": ["Dugdale took over management of Wasing Place, Wasing Park, and the Wasing estate in Berkshire from his grandparents in 2008.York, Melissa Canvas & Stone: We ask five entrepreneurs who inherited country estates how they managed to turn their crumbling piles into profitable businesses, City AM, 25 June 2016Pitcher, Claire Joshua Dugdale on restoration projects at Wasing Estate and his love for filmmaking, Berkshire Life, 14 September 2015 Its manor is centred on a manor house which was purchased in 1759 by the London nautical publisher John Mount, a maternal ancestor of Dugdale's. Mount built the mansion Wasing Place, completed in 1770, which became the home of his descendants the MPs, William Mount, William George Mount and Sir William Mount. The house was rebuilt after a fire in 1945.", "Dugdale is the son of former Aston Villa chairman Sir William Dugdale, 2nd Baronet of Blyth Hall, a descendant of the Noble House of Stratford, and his wife, Cecilia (Cylla) Mary, daughter of Sir William Mount, 2nd Baronet of Wasing Place in Berkshire. Dugdale is also a cousin of former Conservative Party leader and Prime Minister of the United Kingdom, David Cameron.The Daily Telegraph Times Obituaries, Cylla, Lady Dugdale obituary, The Times, 21 January 2019"]}, {"page": "Francis Mount", "response": ["His father, William Mount,  brother, William George Mount and nephew Sir William Mount, 1st Baronet were all MPs."]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|u||William Mount||John Wilson Croker||Resignation"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|rowspan=\"2\"|Newport (IoW)(two members)||William Mount||Tory"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["|  William Mount      – resigned Replaced by John Wilson Croker 1819"]}, {"page": "Sandleford Priory (country house)", "response": ["*Richard Durnford, Bishop of Chichester, his mother Louisa (born 1781) was a daughter of John Mount (1725–1786) of Wasing was born at Sandleford.ODNB John Mount was also a grandfather of William Mount, (1787–1869), MP. "]}]}}