{"wiki_id": "http://www.wikidata.org/entity/Q8015535", "itemLabel": "William Meggitt", "itemDescription": "Welsh flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Meggitt", "wikipedia_page": {"main": "Flight Lieutenant William Geoffrey Meggitt  (1894 – 28 January 1927) was a British World War I flying ace credited with six aerial victories.", "link_mentions": [{"page": "No. 22 Squadron RAF", "response": ["The squadron moved to Spich, near Cologne in Germany as part of the British Army of Occupation in March 1919, leaving for home at the end of August that year. After a period as a cadre unit (without aircraft) at RAF Ford, the squadron formally disbanded on 31 December 1919.Halley 1973, pp. 13, 26. By the time it was demobilised, it had had 27 flying aces within its ranks, both pilots and observers, including William Meggitt, Samuel Frederick Henry Thompson, Alfred Atkey, John Everard Gurdon, William Frederick James Harvey, Ernest Elton, Frank Weare, Carleton Main Clement, Frank George Gibbons, Edwin C. Bromley, Chester Thompson, Hiram Frank Davison, Sydney A. Oades, George William Bulmer, George S. L. Hayward, Stanley Wallage, Frederick Stanton, James Bush, Rothesay Stuart Wortley, William Lewis Wells, Chester Stairs Duffus, John Howard Umney, Josiah Lewis Morgan, and Dennis Waight."]}, {"page": "List of World War I aces credited with 6 victories", "response": ["| William Meggitt"]}, {"page": "William Drummond Matheson", "response": ["| Observer: William Meggitt"]}, {"page": "Lancelot Richardson", "response": ["Richardson was promoted to Temporary Captain on 1 January 1917,Supplement to the London Gazette, 6 February 1917, Retrieved on 5 August 2010. and returned to combat duty in early 1917 as a flight leader in the same squadron. With William Meggitt manning the guns, Richardson drove a German two-seater out of control on 15 February 1917. On 17 March 1917, he capped his career as an ace by sharing in the destruction of an Albatros D.II. On 11 May 1917, he was awarded the Military Cross.Supplement to the London Gazette, 11 May 1917, Retrieved on 5 August 2010. On 13 April 1917, Richardson fell to his death under the guns of Hans Klein of Jasta 4."]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* William Meggitt"]}, {"page": "Arch Whitehouse", "response": ["*10 October 1917-a Albatross DV {Destroyed over Moorslede, Belgium} with Pilot William Meggitt, M.C."]}, {"page": "Meggitt, William", "response": ["#redirectWilliam Meggitt"]}, {"page": "Meggitt (disambiguation)", "response": ["* William Meggitt (1894–1927), a British World War I flying ace"]}, {"page": "Margaret Sara Meggitt", "response": ["Her son, William Meggitt, won the Military Cross while serving with the RAF during World War I."]}]}}