{"wiki_id": "http://www.wikidata.org/entity/Q8012814", "itemLabel": "William Inglis", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Inglis_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant General Sir William Inglis, KCB (1764 – 29 November 1835) was a British officer of the French Revolutionary and Napoleonic Wars.\nInglis served at several of the heaviest engagements of the Peninsula War, was wounded numerous times and earned national fame through his exhortation \"Die hard 57th, die hard!\" to his regiment as he lay seriously wounded behind their ranks at the height of the Battle of Albuera.\nThe regiment held and the battle was won and although his wounds nearly proved fatal, Inglis returned to action again two years later to see the war out as a brigadier. Post-war, Inglis was knighted and served in several military governorships including a spell as Governor of Cork, in which position he died in 1835.", "link_mentions": [{"page": "Middlesex", "response": ["During the battle, Lieutenant-Colonel William Inglis, despite his injuries, refused to retire from the battle but remained with the regimental colours, encouraging his men with the words \"Die hard 57th, die hard!\" as they came under intense pressure from a French attack. The regiment held and the battle was won. The 'Die Hards' subsequently became the West Middlesex's regimental nickname and the phrase Die Hard entered the language. In 2003, an early day motion in the House of Commons noted the celebration of 16 May, the anniversary of Albuhera, as Middlesex Day.Randall J., Early Day Motion 13 May 2003. Retrieved on 12 June 2019"]}, {"page": "Battle of Albuera", "response": ["Ordinarily in a duel between Allied line and French column, the greater volume of fire laid down by the line (where every single weapon could be brought to bear on the front and flanks of the narrower column) could be expected to be the decisive factor. In this case however, the French were well supported by artillery. More than compensating for the firepower disadvantage of his infantry formation, Girard brought guns up to just 275 metres (300 yd) from Hoghton's line—close enough to enfilade it with a crossfire of grape and canister.. Early in this engagement Colonel William Inglis of the 57th Foot was wounded by grapeshot from the French artillery. He refused to be carried to the rear and lay with the Colours; throughout the battle his voice could be heard calmly repeating \"Die hard 57th, die hard!\". In following his exhortations, the 57th earned their nickname: the \"Die-Hards\"."]}, {"page": "Ickleton", "response": ["The Dean and Canons leased the rectory and hence the tithe income. Lesees included the Dean of Arches, William Bird from 1615 to 1624 and Sir William Acton, 1st Baronet from 1630. Lessees after the inclosure of 1814 included Lieutenant-General William Inglis in 1861–62. In 1867 the Dean and Canons' estates were vested in the Ecclesiastical Commissioners. The Commissioners sold the estate in 1920."]}, {"page": "List of nicknames of British Army regiments", "response": ["*The Diehards – 57th (West Middlesex) Regiment of Foot later 1st Battalion Middlesex Regiment (from the Battle of Albuera during the Peninsular War, when Colonel William Inglis is said to have urged the decimated regiment to \"die hard\")"]}, {"page": "Die hard (phrase)", "response": ["Die hard is a phrase coined by Lieutenant-Colonel William Inglis of the 57th (West Middlesex) Regiment of Foot during the Battle of Albuera. Its original literal meaning has evolved to describe any person who will not be swayed from a belief. It is often applied to right wing politics.", "The phrase die  hard was first used during the Battle of Albuera (1811) in the Peninsular War. During the battle, Lieutenant-Colonel William Inglis of the 57th (West Middlesex) Regiment of Foot was wounded by canister shot. Despite his injuries, Inglis refused to retire from the battle but remained with the regimental colours, encouraging his men with the words \"Die hard 57th, die hard!\" as they came under intense pressure from a French attack. The 'Die Hards' subsequently became the West Middlesex's regimental nickname."]}, {"page": "57th (West Middlesex) Regiment of Foot", "response": ["The battalion earned the regiment its nickname of \"the Die Hards\" after their participation in the Battle of Albuera, (order of battle) one of the bloodiest battles of the war, in May 1811.Warre, p. 53 The commanding officer of the battalion, Colonel William Inglis, was struck down by a charge of canister shot which hit him in the neck and left breast. He refused to be carried to the rear for treatment, but lay in front of his men calling on them to hold their position and when the fight reached its fiercest cried, \"Die hard the 57th, die hard!\". The casualties of the battalion were 422 out of the 570 men in the ranks and 20 out of the 30 officers. The Allied commander of the Anglo-Portuguese force General William Beresford wrote in his dispatch, \"our dead, particularly the 57th Regiment, were lying as they fought in the ranks, every wound in front\".Gurwood, p. 576", "*1830–1835 Lt-Gen. Sir William Inglis"]}, {"page": "Eloi Charlemagne Taupin", "response": ["In the Battle of San Marcial on 31 August, Clausel's divisions crossed the Bidassoa River at dawn, covered by fog. After the mist cleared, the divisions of Taupin and Jean Barthélemy Darmagnac began pressing back William Inglis' British brigade and a Portuguese brigade. At 3:00 pm Clausel received Soult's order to withdraw just as a very heavy rainstorm began. By the time the retreating divisions reached the Bidassoa, the river was rising dangerously. The first brigades of both Taupin and Darmagnac got across but the second brigades became stranded on the far bank with Edmé-Martin Vandermaesen's division. Vandermaesen marched upstream to the bridge at Bera (Vera) and at 2:00 am on 1 September began making desperate attacks against the 100 British riflemen defending the span. The French finally dislodged the defenders and escaped, though Vandermaesen and many others were killed."]}, {"page": "Battle of Bussaco order of battle", "response": ["    Col William Inglis"]}, {"page": "William Spring (British Army officer)", "response": ["Spring saw further service in the West Indies with the 57th Foot, and was present at the Battle of Morne Fortune on 24 May 1796. After a period of inactive service in Trinidad he returned to England in 1803. In 1811, he joined the 1st Battalion of the regiment in the Peninsula Campaign. He fought with distinction and was injured at the Battle of Albuera on 16 May 1811, alongside his commanding officer, William Inglis. Following the engagement, in which the 57th suffered high casualties, Spring was awarded the Army Gold Medal. He commanded the 2nd battalion from 1811 to 1814. Spring was promoted to lieutenant-colonel on 4 June 1813, and took command of the 57th Foot's 1st Battalion in 1815. Following the victory of the Allied armies at the Battle of Waterloo, Spring's battalion was part of the 16th British Brigade of Wellington's army of occupation in France. Spring retired from the army in 1819 and was appointed Deputy Lieutenant of Kerry."]}, {"page": "Inglis Barracks", "response": ["The barracks became the Regimental Depot for the Middlesex Regiment (Duke of Cambridge's Own) when they moved from the Hounslow Barracks following the opening of the barracks. Twenty-five years later, the barracks were renamed after Lieutenant General Sir William Inglis, who had commanded the 57th (West Middlesex) Regiment of Foot during the Battle of Albuera, one of the bloodiest battles of the Peninsular War (1809–14), fought on 16 May 1811. "]}, {"page": "William Inglis", "response": ["William Inglis may refer to:", "* William Inglis (auctioneer) (1832–1896), Australian auctioneer", "** William Inglis and Sons, Australian bloodstock auction company", "* William Inglis (British Army officer) (1764–1835), British officer and Governor of Cork", "* William Inglis (knight), Scottish knight", "* William Inglis (ferry), a 1935 Toronto Island ferry", "* William Inglis (surgeon) (1713–1792), Scottish surgeon"]}, {"page": "Governor of Cork", "response": ["*1829–1835: Sir William Inglis"]}, {"page": "Governor of Kinsale", "response": ["*1827–1829: Sir William Inglis"]}, {"page": "Orthez 1814 order of battle", "response": ["| ROWSPAN=4 | Major GeneralWilliam Inglis"]}, {"page": "General Inglis", "response": ["*William Inglis (British Army officer) (1764–1835), British Army lieutenant general"]}]}}