{"wiki_id": "http://www.wikidata.org/entity/Q8017632", "itemLabel": "William Robert Mends", "itemDescription": "British Royal Navy admiral (1812-1897)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Robert_Mends", "wikipedia_page": {"main": "Sir William Robert Mends,  (27 February 1812 – 26 June 1897), was a British admiral of the Royal Navy, eldest son of Admiral William Bowen Mends and nephew of Captain Robert Mends.\nWilliam Mends was born at Plymouth into a naval family. He married Melita, third daughter of Dr Joseph Stilon M.D. R.N. on 6 January 1839. The doctor was born Giueseppe Maria Joseph Stilon, a native of Calabria and a Royal Naval surgeon in Malta.", "link_mentions": [{"page": "George Tryon", "response": ["Wellesley returned to Chatham in June 1851. After leave, Tryon was posted to HMS Vengeance, captained by Lord Edward Russell. Vengeance sailed for the Mediterranean in August 1851.  The ship was second fastest of the battleships and frigates (after Phaeton), lending considerable prestige to her crew at a time when sailing ability and speed were still considered all important. Admiral William Robert Mends later said of Tryon, 'He served with me, when I was commander of the Vengeance, for two years as a midshipman, and a better young officer never existed; ever full of energy and zeal. As a boat midshipman and signal midshipman he was unrivalled.'Fitzgerald p.33 The ship stopped at Alexandria, and Tryon was given ten days leave to visit Cairo, where the party were received as guests of the Pasha. The party were obliged to stay on as guests, missing the sailing of their ship. The consul advised Captain Russell who then joined the party, which had now transformed into a diplomatic mission promoting British plans for a railway from Alexandria to Cairo. Tryon wrote home, explaining the British desire to create a land route to India, and the continuous vying for power in the region between Britain and France. On a trip to Gibraltar, Tryon and others from the ship joined the local foxhunt in a group of around forty (some in red), riding across the rugged and precipitous terrain on local ponies. Vengeance returned to England in 1852, reaching Spithead on Christmas Day.Fitzgerald pp. 30–38"]}, {"page": "HMS Vengeance (1824)", "response": ["Having returned to Britain, in August 1851 Vengeance, commanded by Captain Lord Edward Russell, left Portsmouth for the Mediterranean. After stops at Lisbon and Gibraltar, she arrived at Malta on 2 October.  Vengeances commander during 1851 and 1852 was William Robert Mends.Fitzgerald p.30- On 13 March 1852, she ran aground in Gibraltar Bay and the end of a voyage from Malta to Gibraltar. She was refloated and found to be leaky. Vengeance returned to England at Christmas 1852, before returning to the Mediterranean with a new second in command, Commander George Le Geyt Bowyear (1818–1903), in the spring. By June she had rejoined the fleet at Malta, and then accompanied the whole Mediterranean fleet under Vice-Admiral James Dundas to Bashika Bay outside the Dardanelles as political tension increased before the Crimean War. In October the fleet moved through the Dardanelles to the Bosphorus and moored at Beikos Bay.Fitzgerald p. 41 In January she visited Sinope, where the Battle of Sinop had been fought the previous November between a Turkish squadron and the Russian fleet, resulting in a Turkish defeat. Vengeance moved to Varna in March, and then took part in the bombardment of Odessa on 22 April. The ship assisted with the transportation of the army across the Black Sea to the Crimea before attending at the Battle of Alma on 20 September.Fitzgerald p.43-45"]}, {"page": "HMS Bombay (1805)", "response": ["From July 1838 to 1842 she was under the command of William Robert Mends. From March 1843 she was the flagship for Sir Lucius Curtis. Then in April 1846, Thomas Graves assumed command. In 1847 H.N.J. Chesshyre replaced Graves. Admiral Edward Harvey raised his flag in Ceylon in March 1848.  Joseph Sparkhall RundleFor more on Joseph Sparkhall Rundle see:  became captain from April 1850. His replacement, in December 1854 was C.G. Robinson. From 1853 to 1855 she was the flagship of the Admiral superintendent at Malta (Rear-Admiral Montagu Stopford and Admiral Houston StewartBiography of Houston Stewart R.N during this period)."]}, {"page": "Robert Mends", "response": ["Mends' eldest son died three months later on the same commission at Sierra Leone. Mends had married in 1802 and had two other sons, Captain James Augustus Mends, who died in 1875 and Vice-Admiral George Clarke Mends who died in 1885. His younger brother, William Bowen Mends, also joined the Navy and died as a full admiral  in 1864, while his nephew Admiral Sir William Robert Mends died in 1897."]}, {"page": "HMS Royal Albert (1854)", "response": ["From commissioning at Sheerness she was first commanded by Commander Alexander Little between June and October 1854. From October to November 1854 by Captain Thomas Sabine Pasley while still at Sheerness.  From 14 February 1855 to April 1857 she was commanded by Captain William Robert Mends as flagship to Rear-Admiral Edmund Lyons commanding the Mediterranean fleet, then chiefly concerned with the Crimean War. In late December 1855, she sprang a leak whilst on a voyage from the Crimea to Malta and was beached at San Nicholas, Kea, Greece. She was subsequently refloated and taken in to Malta for repairs. From April 1857 to 20 August 1858 she was commanded by Captain Francis Egerton."]}, {"page": "HMS Arethusa (1849)", "response": ["Arethusa saw service during the Crimean War, On 29 October 1853, she ran aground in the Dardanelles. She was refloated the next day after her guns had been removed to lighten her. Arethusa took part in battles at Odessa and Sevastopol. At the time of the battle in 1854 she was captained by William Robert Mends and was the last major ship of the Royal Navy to enter an engagement under sail power alone.The Oxford Illustrated History of the Royal Navy, p. 174, Ranft, Bryan, Oxford University Press, 2002"]}, {"page": "Bombardment of Odessa", "response": ["On 22 April the Anglo-French fleet arrived off Odessa, and lay offshore. At 5 a.m. the first division (Descartes, Sampson, Tiger and Vauban) sailed in, and opened fire on the Russian positions from a range of about , though with little effect. Vauban was hit by a red-hot shot that started a fire aboard and was obliged to temporarily withdraw. She soon returned, bringing the screw corvette Caton with her. The second division (Furious, Terrible, Retribution and Mogador) then joined the attack, while Arethusa, Highflyer and Sans Pareil remained further offshore as a reserve. The attacking ships now anchored closer in, and it was not long before a shot from Terrible hit a magazine on the Imperial Mole, which exploded causing great damage. About 24 Russian ships in the military port were set on fire, and several British and French merchant ships detained there took advantage of the confusion to escape. Meanwhile, the rocket-boats set fire to the dockyard storehouses. Late in the action the Arethusa, under the command of Captain William Robert Mends, engaged batteries on the south side of the Quarantine Mole, until recalled. As numerous fires were now threatening the town, the attack was ended at 5.30 p.m., and the squadron withdrew.", "* HMS Arethusa (50 guns), Captain William Robert Mends."]}, {"page": "1871 Birthday Honours", "response": ["*Rear-Admiral William Robert Mends "]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["|Sir William Robert Mends, GCB"]}, {"page": "Mends", "response": ["*William Robert Mends (1812–1897), British admiral of the Royal Navy"]}, {"page": "George Pechell Mends", "response": ["George Pechell Mends was baptized on 10 May 1815 at St Budeaux, Plymouth, Devon, England. He was born into a notable Pembrokeshire naval family. His father was Vice Admiral William Bowen Mends, whose brother, George's uncle, was Commodore Sir Robert Mends (c. 1767–1823). His own elder brother was Admiral Sir William Robert Mends  (27 February 1812 – 26 June 1897), and a younger brother was to become a captain in the Royal Navy. He was the first child to go to sea. Mends grew up in Haverfordwest. He formally entered the Navy on 9 February 1824 as a volunteer on his father's ship ."]}]}}