{"wiki_id": "http://www.wikidata.org/entity/Q8014290", "itemLabel": "William Lane-Mitchell", "itemDescription": "Scottish politician and businessman (1861-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lane-Mitchell", "wikipedia_page": {"main": "Sir William Lane-Mitchell  (born Mitchell; 24 January 1861 – 20 June 1940) was a Scottish Conservative Party politician and businessman in London. He was elected as the Member of Parliament (MP) for Streatham in 1918, and held the seat until his resignation in 1939 by becoming Steward of the Manor of Northstead. He was also a two-term Mayor of Camberwell between 1906 and 1908 and a magistrate.Sir William was born William Mitchell in the parish of Chapel of Garioch, Aberdeenshire, Scotland, to William Mitchell and Mary Diack. He made his career in the frozen produce industry in the early days of refrigeration, joining the Cold Storage and Ice Association in 1907. He came to London to manage Messrs. R. and W. Davidson, importer of frozen meat. He joined John Layton and Co., importers of Chinese produce, before starting Lane Mitchell, Ltd.In 1884, he married Jane, daughter of William Lane of Aberdeen, and adopted her name. Lane-Mitchell was knighted in 1921, working as a produce broker until 1923. He attained fame and fortune in the frozen food industry, especially for importing frozen rabbits. In 1919, he signed a 21-year lease on Ryecotes Mead, a large house with extensive grounds on the Dulwich Estate and famous for its previous wealthy businessmen occupants. He and Jane had three sons and four daughters, Jane dying in 1925. In 1926, he married Sarah, ex-wife of Sir Edmund Vestey and daughter of Joseph Barker of Formby, Lancashire. The couple lived in Sir Edmund's former house, Shirley, in Pampisford Road, South Croydon, until aircraft noise motivated them to move to a flat in London.\nLane-Mitchell died in Herne Hill a year after his wife had moved into a nursing home, his death preceding hers by only a few days.Two portraits of Lane-Mitchell are held by the National Portrait Gallery.", "link_mentions": {}}}