{"wiki_id": "http://www.wikidata.org/entity/Q8012349", "itemLabel": "William Hillyer", "itemDescription": "English cricketer (1813-1861)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hillyer", "wikipedia_page": {"main": "William Richard Hillyer (5 March 1813 – 8 January 1861), was a prominent 19th century English professional cricketer for Kent County Cricket Club, Marylebone Cricket Club (MCC) and many other sides in the days before county and international cricket was organised into regular competitions. He was born at Leybourne in Kent in 1813, the son of an innkeeper.Hillyer first played for Kent in 1834 and was the \"principal bowler\" for the county teams until 1853. He took at least 514 wickets for Kent teams in 89 matches - a figure which is not precise as bowling figures were frequently not recorded accurately. At the time, scores were generally low due to the roughness of pitches, which were kept short by sheep and rolled if at all only with a light roller. Playing in an era when round-arm bowling had taken over from underarm but before overarm bowling was legalised, Hillyer bowled a little above medium pace from a \"shuffling run\" with a beautifully simple delivery, and was tremendously difficult to score off of due to his gain of pace off the pitch, ability to make the ball come with his arm (from leg to off) and constant shooters which bowled many batsmen. He recorded at least 149 five-wicket hauls and took 10 wickets in a match at least 54 times, and 13 in at least 14 matches.By the tail end of the 1830s he was already established as one of the leading bowlers in English cricket. During the 1840s he was statistically unmatched. Until the days of James Southerton no bowler ever took so many wickets in a season as Hillyer's 174 in 1845 - his nearest rival, Jemmy Dean, had taken 100. He took most first-class wickets in English cricket in each season from 1842 to 1849. As a batsman Hillyer was more modest and he only reached 40 three times. Nonetheless, in by far his highest innings, Hillyer became the first player to accomplish the still-treasured feat of a \"match double\", scoring 26 and 83 and taking 13 wickets for Marylebone Cricket Club (MCC) against Oxford University in 1847.He had first played for the Town Malling club and was employed as a professional by Marylebone Cricket Club (MCC) at Lord's between 1838 and 1851, playing regularly in Gentlemen v Players matches during the period.From 1850 onwards, Hillyer began to decline badly, suffering from rheumatism and, beginning in 1852, he began to umpire as was normal practice with professional players of the day. He fell and broke his thumb in 1855 which forced his retirement as a cricketer. He died at Maidstone in Kent in 1861, aged 47.", "link_mentions": [{"page": "1842 in sports", "response": ["* Most wickets – William Hillyer 127 @ 13.42 (BB 8–?)"]}, {"page": "1845 in sports", "response": ["* Most wickets – William Hillyer 174 @ 12.30 (BB 8–30)"]}, {"page": "1846 in sports", "response": ["* Most wickets – William Hillyer 152 @ 6.83 (BB 7–?)"]}, {"page": "1849 in sports", "response": ["* Most wickets – William Hillyer 141 @ 13.20 (BB 8–?)"]}, {"page": "1848 in sports", "response": ["* Most wickets – William Hillyer 85 @ 7.28 (BB 8–26)"]}, {"page": "Kent County Cricket Club", "response": ["By the 1830s Kent sides began to dominate English cricket, winning 98 matches during the period and being declared the leading county side for six seasons out of the seven between 1837 and 1843.Ellis C, Pennell M (2010) Trophies and Tribulations, p. 7. London: Greenwich Publishing. . During this period the formation of county sides was initially focussed on Town Malling Cricket Club, backed by lawyers Thomas Selby and Silas Norton alongside William Harris, 2nd Baron Harris.Silas Norton, Famous Local People, The Larkfield Society. Retrieved 2017-12-13.Birley, op. cit., pp.79–82. Selby and Norton recruited \"the best batsman in England\",Birley, op. cit., p.79. Fuller Pilch from Norfolk, to play at Town Malling, maintain the cricket ground and run the connected public house.Denison W (1846) Fuller Pilch, Cricket: Sketches of the Players, pp. 64–69. London: Simpkin, Marshall & Co. (Available online. Retrieved 2017-12-13). Alongside other players such as Alfred Mynn, Nicholas Felix, Ned Wenman and William Hillyer, Kent teams selected by Selby played eleven matches at Town Malling between 1836 and 1841. The expense of running county games meant that Town Malling proved too small to support a county club, despite the large attendances that games attracted, and in 1842 Pilch moved to the Beverley club at Canterbury."]}, {"page": "1847 in sports", "response": ["* Most wickets – William Hillyer 134 @ 16.15 (BB 8–?)"]}, {"page": "1844 in sports", "response": ["* Most wickets – William Hillyer 142 @ 11.98 (BB 7–41)"]}, {"page": "1843 in sports", "response": ["* Most wickets – William Hillyer 133 @ 8.66 (BB 7–?)"]}, {"page": "1837 in sports", "response": ["* Kent is the most successful team and this marks the beginning of a great period in the county's history till1849.  Mainstays of the Kent team in these years include Alfred Mynn, Fuller Pilch, Nicholas Felix, Ned Wenman and William Hillyer."]}, {"page": "History of English cricket (1816–1863)", "response": ["This season saw the beginning of Kent's dominance of English cricket which lasted through the 1840s. Mainstays of the Kent team in those years included Alfred Mynn, Fuller Pilch, Nicholas Felix, Ned Wenman and William Hillyer. The team claimed a total of eight Champion County titles between 1837 and 1849.", "24 first-class matches were recorded in 1842. The leading run-scorer was Nicholas Felix with 406 and the leading wicket-taker was William Hillyer with 127.", "27 first-class matches were recorded in 1843. The leading run-scorer was Charles Taylor with 372 and the leading wicket-taker was William Hillyer with 133.", "27 first-class matches were recorded in 1844. The leading run-scorer was Fuller Pilch with 517 and the leading wicket-taker was William Hillyer with 142.", "30 first-class matches were recorded in 1845. The leading run-scorer was Fuller Pilch with 569 and the leading wicket-taker was William Hillyer with 174.", "28 first-class matches were recorded in 1846. The leading run-scorer was Thomas Box with 413 and the leading wicket-taker was William Hillyer with 152.", "The earliest first-class match at The Oval was Surrey Club v. MCC on 25 & 26 May. Only 194 runs were scored in the match with a top score of 13. William Hillyer took 14 wickets to help MCC win by 48 runs.", "Social conditions, including the railways, were a key factor in the creation of the travelling All-England Eleven (AEE). The team was founded in Nottingham by William Clarke. The first AEE match was at Sheffield in September and they played others in Manchester and Leeds. The original AEE team was: William Clarke, Jemmy Dean, William Dorrinton, Fuller Pilch, Alfred Mynn, Joe Guy, Will Martingell, Tom Sewell, G Butler, VC Smith and William Hillyer. Other players who represented the AEE in its early days included George Parr, William Lillywhite, Nicholas Felix, William Denison, Thomas Box and OC Pell.", "26 first-class matches were recorded in 1847. The leading run-scorer was Nicholas Felix with 591 and the leading wicket-taker was William Hillyer with 134.", "1847 was the 61st season of cricket in England since the foundation of Marylebone Cricket Club (MCC). Kent had a strong team including Nicholas Felix, William Hillyer, Alfred Mynn and Fuller Pilch. A noted highlight was the first recorded \"match double\" in an important match.", "27 to 29 May: In the game between MCC and Oxford University, William Hillyer completes the first recorded \"match double\" of 100 runs and ten wickets in a first-class game,Frindall, Bill (editor); The Wisden Book of Cricket Records (Fourth Edition); pp. 317–320.  scoring 26 and 83 and taking thirteen wickets.Oxford University v Marylebone Cricket Club in 1847 The feat was not accomplished again until 1859 when Edward Walker achieved it, but since then has been accomplished numerous times, most frequently by W. G. Grace.", "28 first-class matches were recorded in 1848. The leading run-scorer was George Parr with 339 and the leading wicket-taker was William Hillyer with 85.", "29 first-class matches were recorded in 1849. The leading run-scorer was George Parr with 529 and the leading wicket-taker was William Hillyer with 141."]}, {"page": "Non-international England cricket teams", "response": ["The name \"All-England\" took on a specific meaning in 1846 when William Clarke's All-England Eleven, commonly known as the AEE, was founded as a touring team of leading players, its purpose being to take advantage of the new railway network and play matches at city venues, mainly in the North of England. Clarke's team was indeed a top-class side worthy of its title as, in 1846, it consisted of himself, Joe Guy (cricketer), George Parr (all of Nottinghamshire), William Lillywhite, Jemmy Dean (both Sussex), William Denison, Will Martingell (both Surrey), Fuller Pilch, Alfred Mynn, Nicholas Wanostrocht (aka \"Felix\") and William Hillyer (all Kent). Their matches in Sheffield, Manchester and Leeds were a huge success and very profitable, especially for Clarke himself who was careful to pay his players more than Marylebone Cricket Club (MCC) did (from £4 to £6 per week) and so keep them interested. He kept the surplus for himself."]}, {"page": "Nicholas Felix", "response": ["Felix was a specialist left-handed batsman, although he did occasionally bowl underarm slow left-arm orthodox. He was a mainstay of the great Kent team of the mid-19th century alongside such players as Alfred Mynn, Fuller Pilch, William Hillyer and Ned Wenman. In the words of the famous elegy, best loved of Bernard Darwin,"]}, {"page": "Kent county cricket teams", "response": ["By the 1830s Kent sides began to dominate English cricket, winning 98 matches during the period and being declared the leading county side for six seasons out of the seven between 1837 and 1843.Ellis C, Pennell M (2010) Trophies and Tribulations, p.7. London: Greenwich Publishing. . During this period the formation of county sides was initially focussed on Town Malling Cricket Club, backed by lawyers Thomas Selby and Silas Norton alongside William Harris, 2nd Baron Harris.Silas Norton, Famous Local People, The Larkfield Society. Retrieved 2017-12-13.Birley, op. cit., pp.79–82. Selby and Norton recruited \"the best batsman in England\",Birley, op. cit., p.79. Fuller Pilch from Norfolk, to play at Town Malling, maintain the cricket ground and run the connected public house.Denison W (1846) Fuller Pilch, Cricket: Sketches of the Players, pp.64–69. London: Simpkin, Marshall & Co. (Available online. Retrieved 2017-12-13). Alongside other players such as Alfred Mynn, Nicholas Felix, Ned Wenman and William Hillyer, Kent teams selected by Selby played eleven matches at Town Malling between 1836 and 1841. The expense of running county games meant that Town Malling proved too small to support a county club, despite the large attendances that games attracted, and in 1842 Pilch moved to the Beverley club at Canterbury.", "Kent struggled against the prominence of Sussex in the early roundarm years but then enjoyed a glorious period in the middle of the century. Rowland Bowen has recorded that a Maidstone newspaper in 1837 described a match between Kent and Nottinghamshire as for the County Championship.Bowen, p. 95. This is the earliest known use of the term although the concept of a Champion County was much older. Kent was duly proclaimed \"Champion County\" in 1837 and through most of the 1840s. Mainstays of the Kent team in those years included Alfred Mynn, Fuller Pilch, Nicholas Wanostrocht aka \"Felix\", Ned Wenman and William Hillyer."]}, {"page": "Ned Wenman", "response": ["Edward Gower \"Ned\" Wenman (18 August 1803 – 28 December 1879) was an English first-class cricketer whose career spanned the 1825 to 1854 seasons. A specialist wicket-keeper, he was a prominent member of the great Kent team of the 1840s which also featured Nicholas Felix, William Hillyer, Alfred Mynn and Fuller Pilch. Wenman is generally remembered as one of the greatest wicketkeepers of the 19th century. He came from a cricketing family, other first-class players being his cousins George and John, his son William and his brother Charles. In his first-class career, Wenman made 146 appearances, totalling 3,204 runs with a highest score of 73 not out and taking 45 wickets bowling occasionally with a slow underarm style. He held 118 catches and completed 87 stumpings."]}, {"page": "North v South", "response": ["* 2 – Alfred Mynn, Bartholomew Good, Charles Creswell, Francis Fenner, George Rothera, Jem Broadbridge, Richard Mills, Tom Adams, William Hillyer"]}, {"page": "John Cocker", "response": ["Cocker was born at Thurnham near Maidstone in Kent in 1815, the son of Thomas and Mary Cocker. His father was a farmer and John played cricket for sides such as Leeds, Bearsted and Yalding, where he played alongside players such as Alfred Mynn and William Hillyer and Ned Wenman, all of whom were key players in the great Kent sides of the day.Carlaw D Kent County Cricketers A to Z. Part One: 1806–1914, pp.91–92. (Available online at the Association of Cricket Statisticians and Historians. Retrieved 2020-07-23.)"]}, {"page": "Antelope Ground", "response": ["During the period when the ground was under the supervision of Daniel Day the ground was known as \"Day's Ground\" rather than the Antelope. Five first-class matches were played there between 1842 and 1845. The first was in September 1842, when Hampshire played England. This was a low-scoring match with Hampshire being bowled out for 67 in the first innings; England replied with a total of 99, but Hampshire only managed 27 in their second innings and England thus won by an innings and 5 runs. England's best bowler was William Hillyer who took 15 wickets in the match."]}, {"page": "John Bulbeck", "response": ["Likely born at Havant, Hampshire, Bulbeck made a single first-class appearance for Hampshire against England in 1842 at Day's Ground, Southampton. In a match which England won by an innings and 5 runs, Bulbeck batted twice opening the innings, being dismissed for a duck in each innings by William Hillyer."]}, {"page": "John Brown (cricketer, born 1820)", "response": ["Brown represented Hampshire in a single first-class match in 1849 against an All-England Eleven. In this match he scored a single run in the Hampshire first-innings, before being dismissed by William Hillyer. In Hampshire's second-innings he scored 8 runs, before being dismissed by the same bowler."]}, {"page": "George Deane (cricketer)", "response": ["Deane's batting style is unknown. He made a single first-class appearance for Hampshire against an All-England Eleven in 1848 at Day's (Itchen) Ground.  Deane was dismissed twice for a duck in this match, by William Hillyer in Hampshire's first-innings, and by John Wisden in their second-innings.  The match ended as a draw. This was his only major appearance for Hampshire."]}, {"page": "Mortimer Ewen", "response": ["Ewen made his first-class debut for Sussex against Kent in 1839.  He made five further first-class appearances for the county, the last of which came against the Marylebone Cricket Club in 1843.  In his six first-class matches for Sussex, he scored 61 runs at an average of 6.77, with a high score of 23.  With the ball, he took 3 wickets, though his bowling average and best figures are unknown due to incomplete records.  He also made a single first-class appearance for Petworth in 1844 against the Marylebone Cricket Club at Petworth Park New Ground.  He ended Petworth's first-innings unbeaten on 13, while in their second-innings he was dismissed for 7 runs by William Hillyer.  Petworth won this low scoring match by 3 wickets."]}, {"page": "George Kirwan", "response": ["Kirwan made his first-class debut for England against the Marylebone Cricket Club in July 1853 at Lord's.  In England's first-innings he was run out for a single run, while in their second-innings he was dismissed for 3 runs by William Hillyer.  The Marylebone Cricket Club won by 80 runs.  He made his only first-class appearance for Sussex in September 1853 against Nottinghamshire at the Royal Brunswick Ground, Hove.  In Sussex's first-innings, Kirwan scored 11 runs before being dismissed by William Clarke, while in their second-innings he was dismissed for 6 runs by James Grundy.  Nottinghamshire won the match by an innings and 8 runs.  He made his final first-class appearance in September 1853 for the Gentlemen of England against a United England Eleven at the Royal Brunswick Ground.  In the Gentlemen's first-innings, Kirwan scored 4 runs before being dismissed by John Hyde, while in their second-innings he finished not out on 18.  The United England Eleven won the match by 7 wickets."]}, {"page": "John Peto (cricketer)", "response": ["Peto made a single first-class appearance for Surrey against the Marylebone Cricket Club at The Oval in 1847.  He was dismissed in Surrey's first-innings total of 197 for 7 runs by William Hillyer, with the Marylebone Cricket Club making 91 all out in response to that total.  Forced to follow-on, the Marylebone Cricket Club made 216, with Peto taking his only stumping of the match when he stumped Samuel Dakin off the bowling of Nicholas Felix.  Chasing 110 for victory, Surrey were dismissed nine runs short of their target, with Peto ending the innings not out on 5."]}, {"page": "Hillyer", "response": ["*William Hillyer (1813–1861), English cricketer"]}, {"page": "Newman (Petworth cricketer)", "response": ["Newman made a single first-class appearance for Petworth against the Marylebone Cricket Club in 1845 at Lord's. Petworth were dismissed for 88 in their first-innings, with Newman being dismissed for a duck by William Lillywhite. The Marylebone Cricket Club responded to this by making 89 in their first-innings, while Petworth made 69 in their second-innings, during which Newman was dismissed for 2 runs by William Hillyer. The Marylebone Cricket Club reached 70/6 in their second-innings to win the match by 4 wickets. This was his only major appearance."]}, {"page": "Hamilton Hoare", "response": ["Hoare was the son of the cleric William Henry Hoare, of Oakfield, Crawley, Sussex, and his wife Araminta Anne Hamilton (died 1888), daughter of Sir John Hamilton, 1st Baronet, of Woodbrook. He was educated at Eton College, where he captained the college cricket team in 1853. He made two first-class appearances for Sussex, the first came against England at Lord's in 1853, while the second came against the Marylebone Cricket Club at E Tredcroft's Ground, Horsham. In his first match, England batted first and were dismissed for 128. In response, Sussex were dismissed for 80, with Hoare ending the innings not out on a single run. England then made 227 all out in their second-innings, leaving Sussex with a target of 276 for victory, however they were dismissed for just 78 in their second-innings, with Hoare being dismissed for 2 runs by William Hillyer. England won the match by 197 runs. In his second match, Sussex won the toss and elected to bat first, making 165 all out, with Hoare ending the innings not out on 5. The Marylebone Cricket Club were then dismissed for 129 in their first-innings, to which Sussex responded in their second-innings with just 64 all out, with Hoare ending the innings not out without scoring. Set 101 for victory, the Marylebone Cricket Club chased down their target to win by 6 wickets."]}, {"page": "List of English cricketers (1826–1840)", "response": ["|William Hillyer"]}, {"page": "List of English cricketers (1841–1850)", "response": ["|William Hillyer"]}, {"page": "Thomas Lewis (English cricketer)", "response": ["Lewis made his first-class debut for the Gentlemen in the Gentlemen v Players fixture of 1837 at Lord's, where he batted last in the Gentlemen's first-innings and was dismissed for a duck by Sam Redgate, while in their second-innings he was absent hurt. Lewis later made a second first-class appearance nearly a decade later in 1846 for the Surrey Club against the Marylebone Cricket Club at The Oval. Opening the batting with J. Spenceley in the Surrey Club's first-innings, he was dismissed for 4 runs, stumped by William Nicholson off the bowling of William Hillyer. He followed this up in the Marylebone Cricket Club's first-innings by taking four wickets, the most by any Surrey Club bowler in that innings. Batting at number eight in their second-innings, Lewis was dismissed for a duck by Hillyer."]}, {"page": "List of Cambridge Town Club and Cambridgeshire cricketers", "response": ["* William Hillyer (1846) : W. R. Hillyer"]}, {"page": "William Attfield", "response": ["Born at Bath, Somerset, and educated at Rugby School, Attfield played club cricket for Lansdown Cricket Club, then considered the premier cricket team in Somerset. In 1845, he was selected to play a first-class match for the West of England against the Marylebone Cricket Club at Cricket Down. In a match which the West won by an innings and 94 runs, Attfield batted once, being dismissed for a duck by William Hillyer."]}, {"page": "Alfred Smith (cricketer, born 1812)", "response": ["Smith would face the MCC once more that year, in August at Brighton, before waiting a whole year for his next first-class match. He played, again for Sussex, on 29 August 1842 against an England XI where he was dismissed by William Hillyer for ten. Smith's activities for the next two years are unrecorded, and he does not feature on a cricket scorecard until June 1844, where he played three matches against East sussex and the Gentlemen of Hampshire. He joined Henfield Cricket Club and featured for them against Brighton that year also. In May 1845 he played for Petworth Cricket Club against the MCC, followed by Hampshire and then the MCC once more - all first-class games. He played a Gentlemen v Players game in September 1845, an early County cricket matches in 1851 between Sussex and Kent, and faced the All England XI in 1852 followed by two more outings against Kent. He then played a dozen more games against various Gentlemen's XIs including his final match in 1866. He died in 1892 in Wantley."]}]}}