{"wiki_id": "http://www.wikidata.org/entity/Q8013787", "itemLabel": "William Josiah Irons", "itemDescription": "British theologian", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Josiah_Irons", "wikipedia_page": {"main": "William Josiah Irons (1812–1883) was a priest in the Church of England and a theological writer.", "link_mentions": [{"page": "Dies irae", "response": ["The Latin text below is taken from the Requiem Mass in the 1962 Roman Missal. The first English version below, translated by William Josiah Irons in 1849, albeit from a slightly different Latin text, replicates the rhyme and metre of the original. This translation, edited for more conformance to the official Latin, is approved by the Catholic Church for use as the funeral Mass sequence in the liturgy of the Anglican ordinariate. The second English version is a more formal equivalence translation."]}, {"page": "Hoddesdon", "response": ["*William Josiah Irons (1812–1883), Church of England clergyman and theological writer. Born in Hoddesdon 12 September 1812."]}, {"page": "St Mary Woolnoth", "response": ["* William Josiah Irons the theologian was rector here from 1872."]}, {"page": "Bampton Lectures", "response": ["* 1870 – William Josiah Irons Christianity as Taught by St. Paul"]}, {"page": "William Irons", "response": ["*William Josiah Irons (1812–1883), Church of England priest and theological writer"]}, {"page": "William J. Irons", "response": ["#REDIRECT William Josiah Irons"]}, {"page": "Irons", "response": ["* William Josiah Irons (1812–1883), an English priest"]}, {"page": "List of members of the London School Board", "response": ["| Rev. Prebendary William Josiah Irons"]}, {"page": "John Fuller Russell", "response": ["He was co-editor with Walter Farquhar Hook of the Voice of the Church (2 vols. 1840), and with William Josiah Irons of Tracts of the Anglican Fathers (1841). He was also editor of Hierurgia Anglicana, or Documents and Extracts illustrative of the Church of England after the Reformation (1848)."]}, {"page": "Music for the Requiem Mass", "response": ["A sequence is a liturgical poem sung, when used, after the Tract (or Alleluia, if present).  The sequence employed in the Requiem, Dies irae, attributed to Thomas of Celano (c. 1200 – c. 1260–1270), has been called \"the greatest of hymns\", worthy of \"supreme admiration\".  The Latin text is included in the Requiem Mass in the 1962 Roman Missal. An early English version was translated by William Josiah Irons in 1849."]}, {"page": "William Alphonsus Gunn", "response": ["Moving to London, Gunn was lecturer at St Mary Somerset with St Mary Mounthaw, from 1793. He came into the orbit of John Newton, a significant influence, at St Mary Woolnoth. Newton tried in 1795 to bring him to St Helen's Bishopsgate, but failed, because of local resistance. In 1796 Gunn became Newton's curate at St Mary Woolnoth. Newton found Gunn both popular with his congregation and humble; but noted that Gunn was even more unpopular with the wider clergy than evangelicals generally were. Joseph Irons, father of William Josiah Irons, who became an itinerant preacher, was converted by Gunn's preaching, around 1803. Another impressed by Gunn was Jacob Kirkman Foster, who became a Cheshunt College tutor. An opponent took the chance to criticise Gunn for his use of snuff."]}]}}