{"wiki_id": "http://www.wikidata.org/entity/Q8015244", "itemLabel": "William Maturin", "itemDescription": "Australian public servant and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Maturin", "wikipedia_page": {"main": "William Henry Maturin,  (1814 – 5 March 1889) was a senior public servant in the early days of the colony of South Australia and had a further career in Great Britain.\nHe and his brother Augustus arrived in Adelaide on the brig Elizabeth Buckham on 22 June 1843, and took the place of W. C. Darling in the Commissariat Department under administrator Sir Henry E. Fox Young, acting as his private secretary and holding the position of Deputy Assistant Commissary General and Auditor General, was promoted to Assistant Director in 1847, then Private Secretary to the Lieutenant Governor in May 1849, and at the same time appointed to the Legislative Council, but almost immediately relinquishing both when he was made acting Colonial Treasurer, reverting to Private Secretary in 1851.\nIn 1850 his assistant William Edward Beddome was convicted of embezzling £4,000, which could only have happened because of lax security on Maturin's part.In 1857 the Commissariat Department was abolished, and on 1 June 1857 Maturin was relieved by Mr. Deputy Commissioner Monk, and retired on half-pay. He returned to England and was appointed to the Commissariat Department, also to a seat on the London directorate of the Bank of South Australia.\nIn November 1857 he was appointed Chief Commissioner of the newly formed Adelaide Waterworks Commission. He successfully stood for Light in the South Australian House of Assembly and in July 1858 he resigned his Commission, to be replaced by G. M. Waterhouse. Before he could take his seat however, he was appointed Land Titles Commissioner and resigned from Parliament, taking effect in September 1858. David Shannon won the ensuing by-election.\nHe accepted a position in London as Deputy Commissary General with a seat on the London board of the Bank of South Australia and left the State in February 1859. In 1863 he was transferred to Hong Kong, then Aldershot in 1865.\nHe was appointed head of the Control Department in Ireland then in 1871 Director of Supplies and Transports in the War Department following the retirement of Sir William Tyrone Powers KCB. (1819– )\nHe was appointed Companion of the Order of the Bath sometime around 1870.", "link_mentions": [{"page": "Maturin", "response": ["* William Maturin (1814–1889), senior public servant in Australia and Great Britain"]}, {"page": "Members of the South Australian House of Assembly, 1857–1860", "response": ["| William Maturin won the resulting by-election on 8 February 1858.", "| William Maturin resigned on 1 July 1858."]}, {"page": "List of South Australian House of Assembly by-elections", "response": ["|William Maturin", "|William Maturin"]}, {"page": "Treasurer of South Australia", "response": ["| William Maturin || May 1849  || 1849"]}, {"page": "W. H. Maturin", "response": ["#REDIRECT William Maturin"]}, {"page": "William Henry Maturin", "response": ["#REDIRECT William Maturin"]}, {"page": "William H. Maturin", "response": ["#REDIRECT William Maturin"]}, {"page": "Maturin, William", "response": ["#redirectWilliam Maturin"]}]}}