{"wiki_id": "http://www.wikidata.org/entity/Q8015058", "itemLabel": "William Makins", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Makins", "wikipedia_page": {"main": "Sir William Thomas Makins, 1st Baronet  (16 March 1840 – 2 February 1906) was a barrister and Conservative politician.\nMakins was the eldest son of Charles Makins of St. Mark's, Woodhouse, Leeds. He was educated at Harrow School, and at Trinity College, Cambridge. He was called to the bar at Middle Temple in 1862 and went on the Midland Circuit. His directorships included the Great Eastern Railway, and the Gas Light and Coke Company. He was appointed Lieutenant-Colonel of the 3rd (Stratford) Essex Artillery Volunteer Corps in 1869 and was Honorary Colonel of the unit and its successors from 23 April 1874. He was also a J.P. for Oxfordshire and Essex, and a Deputy Lieutenant  for Essex and the City of London'Makins  stood unsuccessfully for parliament at Kidderminster in 1868. In 1874 he was elected Member of Parliament for South Essex. He held the seat until the Redistribution of Seats Act 1885 when he was elected for South East Essex. In 1886, he was elected instead at Walthamstow  and held the seat until 1892. He was created baronet of Rotherfield Court,  Henley-on-Thames in 1902, as part of King Edward VII's Birthday Honours.Makins died at the age of 65.\nMakins married Elizabeth Simpson in 1861. Their daughter Mary married Sir Eugene Clauson, and their third son Paul succeeded to the baronetcy and became Lord Lieutenant of Oxfordshire.", "link_mentions": [{"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| William Makins"]}, {"page": "Walthamstow (UK Parliament constituency)", "response": ["| William Makins"]}, {"page": "List of Old Harrovians", "response": ["*Sir William Makins, 1st Baronet (1840–1906), Conservative MP for South Essex (1874–1885), South East Essex (1885–1886) and Walthamstow (1886–1892)"]}, {"page": "South Essex (UK Parliament constituency)", "response": ["| William Makins"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| William Makins"]}, {"page": "South East Essex (UK Parliament constituency)", "response": ["| William Makins"]}, {"page": "Makins baronets", "response": ["The Makins Baronetcy, of Rotherfield Court in Henley-on-Thames in the County of Oxford, was a title in the Baronetage of the United Kingdom. It was created on 9 January 1903 for William Makins, Member of Parliament for South Essex, South East Essex and Walthamstow. The title became extinct on the death of the fourth Baronet in 1999.", "Another member of the Makins family was Roger Makins, 1st Baron Sherfield. He was the grandson of Henry Francis Makins, younger brother of Sir William Makins, 1st Baronet."]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| William Makins"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| William Makins"]}, {"page": "William Thomas Makins", "response": ["#REDIRECT William Makins"]}, {"page": "Sir William Makins, 1st Baronet", "response": ["#REDIRECT William Makins"]}, {"page": "Makins", "response": ["*William Makins (1840–1906), English barrister and politician"]}, {"page": "1st Essex Artillery Volunteers", "response": ["* 3rd (Stratford) Essex AVC – initially to 5th Essex (Plaistow and Victoria Docks) Rifle Volunteer Corps; from March 1863 to 10th (Royal Arsenal) Kent AVC at Woolwich; later independent with its own Lieutenant-Colonel (William Makins) and Honorary Colonel appointed in 1869", "* Sir William Makins, 1st Baronet, MP,VD, former CO, appointed to 3rd Essex AVC 23 April 1874"]}, {"page": "Makins, William", "response": ["#redirectWilliam Makins"]}]}}