{"wiki_id": "http://www.wikidata.org/entity/Q8012381", "itemLabel": "William Hodgson Barrow", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hodgson_Barrow", "wikipedia_page": {"main": "William Hodgson Barrow (1 September 1784 – 29 January 1876) was an English Conservative politician who sat in the House of Commons from 1851 to 1874.\nBarrow was the son of the Rev. Richard Barrow, of Southwell and his wife Mary Hodgkinson, daughter of George Hodgkinson. His uncle was William Barrow archdeacon of Nottingham. He was educated at the Collegiate School at Southwell, and practised as an attorney from 1806 to 1833. He was a Fellow of the Royal Agricultural Society, the Royal Botanic Society, and the Archaeological Society. He was a Deputy Lieutenant and J.P. for Nottinghamshire and was High Sheriff of Nottinghamshire in 1845.In 1851 Barrow was elected at a by-election as a Member of Parliament (MP) for South Nottinghamshire. He was returned unopposed at the five succeeding general elections and held the seat until 1874,\nwhen at 89 he retired.\nBarrow died unmarried at the age of 91.", "link_mentions": [{"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|rowspan=\"2\"|Nottinghamshire South(two members)||William Hodgson Barrow||Conservative"]}, {"page": "South Nottinghamshire (UK Parliament constituency)", "response": ["|rowspan=\"4\"| William Hodgson Barrow"]}, {"page": "The Minster School, Southwell", "response": ["* William Hodgson Barrow, Member of Parliament (MP) for South Nottinghamshire 1851–1874."]}, {"page": "William Barrow", "response": ["* William Hodgson Barrow (1784–1876), English Conservative politician who sat in the House of Commons from 1851 to 1874"]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| William Hodgson Barrow"]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|rowspan=\"2\"|Nottinghamshire South(two members)||William Hodgson Barrow||Conservative"]}, {"page": "William Barrow (priest)", "response": ["Barrow married Mrs. E. A. Williams, who died childless in 1823. He died 19 April 1836, aged 82. There is a tablet to his memory in the nave of Southwell Minster. His nephew William Hodgson Barrow was for many years M.P. for South Nottinghamshire."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|William Hodgson Barrow"]}, {"page": "William Barrow (MP)", "response": ["#REDIRECT William Hodgson Barrow"]}]}}