{"wiki_id": "http://www.wikidata.org/entity/Q8018277", "itemLabel": "William Senior", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Senior_(politician)", "wikipedia_page": {"main": "William Senior (9 February 1850 – 22 November 1926) was an English-born Australian politician. He was an Australian Labor Party member of the South Australian House of Assembly from 1904 to 1912. He was then a member of the Australian Senate from 1913 to 1922; he was first elected as a Labor Senator but left the party in the 1916 Labor split over conscription and thereafter represented the Nationalist Party.\nSenior was born in Holmfirth in Yorkshire, England. His family migrated to South Australia when he was five years old, settling in Willunga before relocating to Mount Gambier in 1858. He was a storekeeper's assistant before entering the Primitive Methodist ministry and serving as minister from 1873 until 1883, with circuits at Moonta Mines, Two Wells, Woodside, Kapunda and Naracoorte. In 1883 he left the ministry and worked as a storekeeper at Mount Gambier, although he remained a lay Methodist preacher for the rest of his life. He was described as a Past Grand of the Independent Order of Oddfellows and was a founder of their Orroroo lodge in 1880. Later, at Mount Gambier, he was involved in local debating societies in Mount Gambier and was president of the Democratic Society there. In 1902, he moved to Coonawarra, where he became a fruitgrower.He won a 1904 by-election for the South Australian House of Assembly seat of Victoria and Albert following the death of Andrew Dods Handyside. He held the seat until his defeat at the 1912 state election.In 1913, he was elected to the Australian Senate as an Australian Labor Party Senator for South Australia. He left the Labor Party in the wake of the 1916 split over conscription, joining the Nationalist Party. He vigorously supported conscription but denied that he had been disloyal to the Labor Party in doing so. Defeated in 1922, Senior died in 1926.\n\n", "link_mentions": {}}}