{"wiki_id": "http://www.wikidata.org/entity/Q8019168", "itemLabel": "William Tallon", "itemDescription": "Queen Elizabeth The Queen Mother's Steward and Page of the Backstairs", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Tallon", "wikipedia_page": {"main": "William John Stephenson Tallon RVM (12 November 1935 – 23 November 2007), also known as Billy Tallon or Backstairs Billy, was a steward and member of the Queen Mother's staff at Clarence House.", "link_mentions": [{"page": "Kennington", "response": ["* William Tallon, Steward and Page of the Backstairs in the household of Queen Elizabeth the Queen Mother, typically referred to by newspapers as \"Backstairs Billy\", moved from Clarence House in 2002 to a Duchy of Cornwall flat in Kennington. He died in 2007."]}, {"page": "Tallon", "response": ["* William Tallon (1935–2007), English steward"]}, {"page": "1935 in the United Kingdom", "response": ["* 12 November – William Tallon, Steward and Page of the Backstairs; servant of 50 years to the British Royal family (died 2007)"]}, {"page": "Deaths in November 2007", "response": ["*William Tallon, 72, British servant to HM Queen Elizabeth, the Queen Mother."]}, {"page": "Backstairs Billy", "response": ["#REDIRECT William Tallon "]}, {"page": "Billy Tallon", "response": ["#REDIRECT William Tallon"]}, {"page": "Roy Petley", "response": ["Following a chance encounter with the Duchess of Kent, a member of the late Queen Mother's household staff came to look at his works. Soon after William Tallon, the late Queen Mother's steward, returned to her with Petley's portrait study of Prince Charles, Petley was summoned to the Palace.  Thus began the artist's long-standing friendship with the British Royals, which includes the Prince of Wales, the Duke of Edinburgh and the Duchess of Norfolk as his supporters. Exhibitions ensued in London and Dublin, and in places as far away as Dallas, Texas and the island of Barbados.", "* Roy Petley and his friendship with William Tallon by the Independent"]}, {"page": "Death and funeral of Queen Elizabeth The Queen Mother", "response": ["* William Tallon, The Queen Mother's Steward and Page of the Backstairs"]}, {"page": "List of people on the postage stamps of the Falkland Islands", "response": ["*William Tallon, butler – 1999"]}, {"page": "November 1935", "response": ["*Born: William Tallon, servant of the British Royal Family, in Birtley, England (d. 2007)"]}, {"page": "British Theatre Playhouse", "response": ["In October 2017, the British Theatre Playhouse in association with The British Club of Singapore produced Tea with the Old Queen. Tea with the Old Queen is a comical, witty and poignant theatrical comedy revolving around the imaginary funny eccentricities of the British monarchy, as recorded in the fictional secret diaries of William Tallon, an actual person who for more than 40 years worked as a Stewart and Page at Clarence House where Queen Elizabeth the Queen Mother lived, due to which he also came to be known as Backstairs Billy. The play was first written as well as directed and produced by the award-winning writer Graham Woolnough. Its current protagonist and the one in Singapore too is Ian Stark, as this is a one-man theatrical comedy."]}, {"page": "Tallon, William", "response": ["#redirectWilliam Tallon"]}, {"page": "Page of the Backstairs", "response": ["William Tallon held the position in the Household of Queen Elizabeth The Queen Mother."]}]}}