{"wiki_id": "http://www.wikidata.org/entity/Q8015942", "itemLabel": "William Mure", "itemDescription": "British politician (1799-1860)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Mure_(scholar)", "wikipedia_page": {"main": "William Mure (10 July 1799 – 1 April 1860) was a Scottish scholar and  Conservative politician. He sat in the Parliament of the United Kingdom from 1846 to 1855 as the Member of Parliament (MP) for Renfrewshire and was Laird of Caldwell in Ayrshire.", "link_mentions": [{"page": "List of people educated at Westminster School", "response": ["*William Mure (1799–1860), scholar and politician"]}, {"page": "William Markham (bishop)", "response": ["His granddaughter, Laura Markham, the second daughter of his son William, married William Mure, the Scottish scholar and politician who sat in the Parliament of the United Kingdom from 1846–55 as the Conservative MP for Renfrewshire and was Laird of Caldwell in Ayrshire.William Mure. Glasgow University (multi-tab page) Their daughter, Emma Mure, (1833–1911) married Thomas Lister, 3rd Baron Ribblesdale (1828–1876) and had Thomas Lister, 4th Baron Ribblesdale."]}, {"page": "Rector of the University of Glasgow", "response": ["|1753–1755 || William Mure of Caldwell ||  ||", "|1764–1767 || William Mure of Caldwell ||  ||", "|1793–1795 || William Mure of Caldwell ||  ||", "|1847–1848 || William Mure of Caldwell ||  || classical scholar, parliamentarian"]}, {"page": "Colonel Mure", "response": ["#REDIRECT William Mure (scholar)"]}, {"page": "Neilston", "response": ["A chapel at Neilston was first recorded in 1163 in a charter of Paisley Abbey. It was commissioned by Sir Robert Croc, as part of a feudal requirement by the High Steward of Scotland, Walter fitz Alan. The original Neilston Kirk was one storey high, and was rebuilt in 1762 to accommodate the growing population of the parish. The only remaining parts of the original building are a Gothic window in a back wall and the burial vault of the Mure family of Caldwell, including the tomb of Laird, scholar and MP for Renfrewshire, William Mure (1799–1860). Between 1796 and 1798 the roof was taken off the church and an additional storey constructed, making space for a gallery to accommodate the growing population of Neilston. The structure has a spire, a clock, and 940 sittings. The old graveyard is centuries old and has a headstone dating from the 15th century. The church is part of the Church of Scotland, and has a Category B listing from Historic Environment Scotland."]}, {"page": "Phigalia", "response": ["Phigalia was surrounded by mountains, of which Pausanias mentions two by name, Cotylium or Cotilium (τὸ Κωτίλιον) and Elaeum (τὸ Ἐλάϊομ), the former to the left of the city, at the distance of 30 stadia, and the latter to the right at the distance of 30 stadia. As Cotilium lies to the northeast of Phigalia, and Pausanias in this description seems to have looked towards the east, Mt. Elaeum should probably be placed on the opposite side of Phigalia, and consequently to the south of the Neda, in which case it would correspond to the lofty mountain of Kúvela. Mt. Elaeum contained a cavern sacred to the Black Demeter, situated in a grove of oaks. Of the position of Mt. Cotilium there is no doubt. On it was situated the temple of Apollo Epicurius, which was built in the Peloponnesian War by Ictinus, the architect of the Parthenon at Athens. It was erected by the Phigaleans in consequence of the relief afforded by Apollo during the plague in the Peloponnesian War, whence he received the surname of Epicurius. The temple stood in a place called Bassae, and according to Pausanias excelled all the temples of Peloponnesus, except that of Athena Alea at Tegea, in the beauty of the stone and the accuracy of its masonry. He particularly mentions that the roof was of stone as well as the rest of the building.Pausanias, Description of Greece, 8.41.7-8. This temple still remains almost entire, and is next to the Theseum at Athens the best preserved of the temples of Greece. It stands in a glen (whence the name Βᾶσσαι, Doric for Βήσση, Βῆσσαι) near the summit of Mt. Cotilium, in the midst of a wilderness of rocks, studded with old knotty oaks. Nineteenth-century British scholar William Mure who visited the site wrote that “there is certainly no remnant of the architectural splendour of Greece more calculated to fascinate the imagination than this temple; whether by its own size and beauty, by the contrast it offers to the wild desolation of the surrounding scenery, or the extent and variety of the prospect from its site.”William Mure, Journal of a Tour in Greece and the Ionian Islands (1842, Edinburgh), vol. ii. p. 270. A spring rises about ten minutes walk southwest of the temple, and soon afterwards loses itself in the ground, as Pausanias has described. North of the temple was the highest summit of the mountain, which one reaches in ten minutes' time by a broad road constructed by the Greeks. This summit was called Cotilum (Κώτιλον), whence the whole mountain derived the name of Cotilian; here was a sanctuary of Aphrodite, of which there are still some traces. The grandeur of the ruins of the temple have given to the whole of the surrounding district the name of the Columns (στοὺς στύλους or κολόνναις). The temple is at least two and a half hours walk from the ruins of the city, and consequently more than the 40 stadia, which Pausanias mentions as the distance from Phigalia to Cotilium; but this distance perhaps applies to the nearest part of the mountain from the city."]}, {"page": "Renfrewshire (UK Parliament constituency)", "response": ["| William Mure", "| William Mure", "| William Mure"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Renfrewshire||William Mure||Conservative"]}, {"page": "Sir James Hunter Blair, 1st Baronet", "response": ["* Anne Hunter Blair (d. 1854), who married William Mure of Caldwell (d. 1831), son of William Mure (1718–1776), and father of William Mure (1799–1860)"]}, {"page": "Thomas Lister, 4th Baron Ribblesdale", "response": ["Thomas Lister was born on 29 October 1854 in Fontainebleau, France, the eldest son of Thomas Lister, 3rd Baron Ribblesdale (1828–1876), and his wife Emma (née Mure) (1833–1911), daughter of William Mure.L. G. Pine, The New Extinct Peerage 1884-1971: Containing Extinct, Abeyant, Dormant and Suspended Peerages With Genealogies and Arms (London, U.K.: Heraldry Today, 1972), page 230. He succeeded his father in the barony in 1876."]}, {"page": "William Mure", "response": ["William Mure may refer to:", "* William Mure (writer) (1594–1657)", "*William Mure (1718–1776), lawyer and politician", "*William Mure (died 1831), soldier, son of the lawyer, Rector of the University of Glasgow", "* William Mure (scholar) (1799–1860), British Member of Parliament (MP) for Renfrewshire 1846–1855", "* William Mure (1830–1880), British Member of Parliament for Renfrewshire 1874–1880"]}, {"page": "William Mure (1830–1880)", "response": ["William Mure, of Caldwell (9 May 1830 – 9 November 1880) was a British soldier and Liberal Party politician.", "He was the son of Laura Markham and William Mure (1799–1860), also a former MP for Renfrewshire. Mure was the nephew of David Mure.  His mother was the second daughter of William Markham of Becca Hall, Yorkshire, and the granddaughter of William Markham (1719–1807) the Archbishop of York from 1776 to 1807.", "* Lt.-Col. William Mure of Caldwell (d. 1912), who married Lady Georgiana Theresa Montgomerie (d. 1938), daughter of George Montgomerie, 15th Earl of Eglinton, in 1895."]}, {"page": "David Mure, Lord Mure", "response": ["He was the third son of William Mure of Caldwell, Rector of the University of Glasgow 1793–1795; grandson of William Mure, MP for Renfrewshire 1742-1761 and Rector of Glasgow 1764–1765; younger brother of William Mure, MP for Renfrewshire 1846-1855 and Rector of Glasgow 1847–1848, and uncle of William Mure, MP for Renfrewshire 1874–1880."]}, {"page": "William Mure (1718–1776)", "response": ["William  Mure (December 1718 – 25 March 1776), known as others of his family as William Mure of Caldwell, was a Scottish lawyer and politician. He became a baron of the Scots exchequer, and was a friend of Prime Minister Lord Bute and David Hume.William  Mure. Glasgow University (multi-tab page)", "Mure was born late in 1718, the eldest son and successor to William Mure of Caldwell in Ayr and Renfrewshire, by his wife Anne Stewart, daughter of Sir James Stewart (1635–1713), Lord Advocate, and widow of James Maxwell of Blawarthill. His mother's brother was James Stewart, 1st Baronet (1681–1727).H. Pirie-Gordon, editor, Burke's Genealogical and Heraldic History of the Landed Gentry, 15th edition, (London, England: Burke's Peerage Ltd, 1937), page 1651. Hereinafter cited as Burke's Landed Gentry, 15th ed.  The Mure line of Caldwell is distantly related to William Mure (1594–1657), the writer, and a descendant of the Mure/Muir line of Rowallan.  He had one sister, Agnes Mure (d. 1758), who married Rev. Patrick Boyle (1717–1798), son of John Boyle, 2nd Earl of Glasgow.", "*William Mure (d. 1831), colonel of the Renfrew militia who also served as Lord Rector of Glasgow University (from 1793 to 1794), who married Anne Blair (d. 1854), daughter of Sir James Hunter Blair, 1st Baronet (1741–1787) of Dunskey, Wigtownshire.", "His granddaughter, Catherine Rannie (1790–1821), who married John Campbell Swinton of Kimmerghame (1777–1867) in 1809,BP2003 volume 3, page 3842 was the mother of Archibald Campbell Swinton (1812–1890), the author and politician, and James Rannie Swinton (1816–1888), the portrait artist.  His grandsons included William Mure (1799–1860), an MP for Renfrewshire from 1846 to 1855, and David Mure, Lord Mure (1810–1891), an MP for Buteshire from 1859 to 1865.  His great-grandson, William Mure (1830–1880), was also an MP for Renfrewshire, from 1874 to 1880.  Through his great-granddaughter, Emma Mure (1833–1911), who married Thomas Lister, 3rd Baron Ribblesdale (1828–1876), he was the great-great grandfather of Thomas Lister, 4th Baron Ribblesdale (1854–1925), who married the American heiress, Ava Lowle Willing (1868–1958), the former wife of John Jacob Astor IV (1864–1912)."]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|William Mure"]}, {"page": "List of United Kingdom by-elections (1832–1847)", "response": ["|William Mure"]}, {"page": "1860 in Scotland", "response": ["* 1 April – William Mure, scholar and politician (born 1799)"]}, {"page": "Phare (Laconia)", "response": ["Pharis has been rightly placed at the deserted village of Vaphio, which lies south of the site of Amyclae, and contains an ancient \"Treasury,\" like those of Mycenae and Orchomenus, which is in accordance with Pharis having been one of the old Achaean cities before the Dorian conquest. Its site was described by William Mure: \"it is, like that of Mycenae, a tumulus, with an interior vault, entered by a door on one side, the access to which was pierced horizontally through the slope of the hill. Its situation, on the summit of a knoll, itself of rather conical form, while it increases the apparent size of the tumulus, adds much to its general loftiness and grandeur of effect. The roof of the vault, with the greater part of its material, is now gone, its shape being represented by a round cavity or crater on the summit of the tumulus. The doorway is still entire. It is 6 feet wide at its upper and narrower part. The stone lintel is 15 feet in length. The vault itself was probably between 30 and 40 feet in diameter.\" Mure adds: \"Menelaus is said to have been buried at Amyclae. This may, therefore, have been the royal vault of the Spartan branch, as the Mycenaean monument was of the Argive branch of the Atridan family.\" But even if we suppose the monument to have been a sepulchre, and not a treasury, it stood at the distance of 4 or 5 miles (6 to 8 km) from Amyclae. In addition to this, Menelaus, according to other accounts, was buried at Therapne.Mure, Tour in Greece, vol. ii. p. 246; Leake, Morea, vol. iii. p. 3, Peloponnesiaca, p. 354; Curtius, Peloponnesos, eine historisch-geographische Beschreibung der Halbinsel (1851), vol. ii. p. 248."]}]}}