{"wiki_id": "http://www.wikidata.org/entity/Q8019815", "itemLabel": "William W. Murdoch", "itemDescription": "American ecologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_W._Murdoch", "wikipedia_page": {"main": "William W. Murdoch (born 1939) is a Charles A. Storke II professor of population ecology at the University of California, Santa Barbara. Over the years, his research has focused primarily on the subjects of population regulation, predator–prey dynamics, and biological control. He has also contributed extensively to understanding the scientific and socioeconomic ramifications caused by human overpopulation and environmental degradation.  He was the recipient of the 1990 Robert H. MacArthur Award granted by the Ecological Society of America. He is a member of the National Academy of Sciences (NAS), the American Association for the Advancement of Science (AAAS), and the Ecological Society of America (ESA).\n\n", "link_mentions": [{"page": "University of California, Santa Barbara", "response": ["*William W. Murdoch, Charles A. Storke II professor of population ecology, recipient of the 1990 Robert H. MacArthur Award, and AAAS Fellow known for his research in population regulation, biological control, and predator-prey relationships"]}, {"page": "William Murdoch (disambiguation)", "response": ["* William W. Murdoch (born 1939), professor of population ecology at the University of California, Santa Barbara"]}, {"page": "List of ecologists", "response": ["* William W. Murdoch (USA)"]}, {"page": "List of Guggenheim Fellowships awarded in 1977", "response": ["| William W. Murdoch||||Organismic Biology & Ecology", "*William W. Murdoch, population ecologist"]}, {"page": "National Center for Ecological Analysis and Synthesis", "response": ["William W. Murdoch initially served as the NCEAS director, followed by O.J. Reichman who directed the center from 1997 to 2007. Murdoch then returned to NCEAS as interim director until the arrival of  Ed McCauley on January 1, 2010."]}, {"page": "List of members of the National Academy of Sciences (Environmental sciences and ecology)", "response": ["|William W. Murdoch"]}, {"page": "Robert H. MacArthur Award", "response": ["*1990 William W. Murdoch, United States "]}, {"page": "William w. murdoch", "response": ["#REDIRECT William W. Murdoch "]}, {"page": "List of University of California, Santa Barbara faculty", "response": ["*William W. Murdoch, population ecologist known for his research in population regulation and predator-prey relationships"]}, {"page": "Elizabeth Borer", "response": ["Born in Pennsylvania, Borer graduated from Oberlin College in 1991, spent several years working outside academia, then returned to earn her Ph.D. in Ecology, Evolution, and Marine Biology at the University of California, Santa Barbara in 2002 (advised by William W. Murdoch and Allan Stewart-Oaten). She went on to do postdoctoral training in the Integrative Biology Department at University of California, Berkeley with Cheryl Briggs, then a second postdoc at the National Center for Ecological Analysis and Synthesis. She was an Assistant Professor in the Zoology Department at Oregon State University (2004-2009) and an Associate and Full Professor at the University of Minnesota (2010–present)."]}, {"page": "List of American Academy of Arts and Sciences members (1994–2005)", "response": ["* William W. Murdoch"]}]}}