{"wiki_id": "http://www.wikidata.org/entity/Q8015404", "itemLabel": "William McFee", "itemDescription": "American writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_McFee", "wikipedia_page": {"main": "William Morley Punshon McFee (15 June 1881 – 2 July 1966) was an English writer of sea stories. Both of his parents were Canadian.", "link_mentions": [{"page": "List of American novelists", "response": ["* William McFee (1881–1966), Casuals of the Sea"]}, {"page": "Save Me the Waltz", "response": ["Zelda was distressed and bewildered by the overwhelmingly negative reviews. However, she acknowledged to Maxwell Perkins that a review from William McFee, writing in The New York Sun, was at least accurate in its criticisms. McFee wrote: "]}, {"page": "SS Morro Castle (1930)", "response": ["William McFee, a well-known writer of sea stories who had served as an engineer on oil-fired steamers, wrote in 1949 that \"if the burners were neglected... [the] long uptakes which lead from the furnaces to the funnel would become dangerously overheated\", as he once found on another ship, whose \"funnel was glowing red-hot just above the uptakes\". The Morro Castles funnel was clad in flammable material where it passed through the passenger quarters, and several people had noticed smoke as early as midnight. The ship was making 19 knots against a 20-knot headwind and simply overheated, according to McFee, but the high loss of life was caused by the crew's incompetent handling of the emergency."]}, {"page": "Culford School", "response": ["*William McFee (Anglo-American novelist, especially of sea-tales, and essayist (d.1966))"]}, {"page": "McFee", "response": ["*William McFee (1881–1966), writer of sea stories"]}, {"page": "McFee, William", "response": ["#redirectWilliam McFee"]}, {"page": "List of Armed Services Editions", "response": ["|  178  ||  F-178  || William McFee || Casuals of the Sea ||  F (Feb. 1944)  ||  ", "|  765  ||  765  || William McFee, ed. || World's Great Tales of the Sea ||  W (Jul. 1945)  ||  "]}, {"page": "The New York Times Fiction Best Sellers of 1932", "response": ["| January 11  || rowspan=2|The Harbourmaster || rowspan=2| William McFee"]}]}}