{"wiki_id": "http://www.wikidata.org/entity/Q8014788", "itemLabel": "William Lumley", "itemDescription": "British Napoleonic Wars general", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Lumley", "wikipedia_page": {"main": "General Sir William Lumley,  (28 August 1769 – 15 December 1850) was a British Army officer and courtier during the late eighteenth and early nineteenth centuries. The son of the Earl of Scarborough, Lumley enjoyed a rapid rise through the ranks aided by a reputation for bravery and professionalism established on campaign in Ireland, Egypt, South Africa, South America, Italy, Portugal and Spain. Following his retirement from the army due to ill health in 1811, Lumley served as Governor of Bermuda and later gained a position as a courtier to the Royal Household. Lumley is especially noted for his actions at the Battle of Antrim where he saved the lives of several magistrates and was seriously wounded fighting hand-to-hand with United Irish rebels in the Irish Rebellion of 1798.", "link_mentions": [{"page": "Battle of Albuera", "response": ["By 15 May it was clear to Beresford that Soult was taking the central route to Badajoz, which ran through Santa Marta and the village of Albuera. He made further adjustments to his deployment, moving the 2nd Division and Hamilton's Portuguese to defend the village, where they were joined by Alten's KGL brigade and a further Portuguese brigade composed of garrison and light troops temporarily formed for the campaign.. Soult's movements became even clearer when his Chasseurs à cheval and hussars engaged Long's cavalry at Santa Marta—once again Long retreated in what Beresford considered to be unreasonable haste.. Major General William Lumley took over from Long as the Allied cavalry commander.  Accounts differ as to the reason for this, some claiming it was because of Long's incompetence, and , citing a letter from Benjamin d'Urban, and . and others stating that it was simply down to Lumley's seniority., citing d'Urban,  and  (citing Fortescue). The immediate reason for Beresford's decision seems to have been that Long himself suggested that the appointment of Lumley would resolve questions of seniority that had arisen between Long and the commanders of the Spanish cavalry. The actual change of command did not take place until the morning of the 16th because Lumley did not arrive at the battlefield until then."]}, {"page": "Venusians", "response": ["* In William Lumley and H. P. Lovecraft's \"The Diary of Alonzo Typer\" (written in 1935 and published in 1938), part of the Cthulhu Mythos, there are mentions of the \"Lords of Venus\", and conflicting indications that the Serpent People originated there. The story was followed by \"In the Walls of Eryx,\" co-written by Lovecraft and Kenneth J. Sterling, in which a prospector is trapped in a maze on Venus, apparently constructed by lizardmen."]}, {"page": "Governor of Bermuda", "response": ["# 1819–1822: Lieutenant-General Sir William Lumley", "# 1823–1825: Lieutenant-General Sir William Lumley"]}, {"page": "Battle of Antrim", "response": ["The town was garrisoned by a small force of about 200 yeomen, cavalry under Lt-Col William Lumley and armed volunteers but they also had four artillery pieces and the delay in the rebel attack had allowed them to send requests for assistance to Belfast and Lisburn from where reinforcements were already on the way. The garrison formed themselves at the base of the demesne wall of Antrim Castle, with artillery to the front and cavalry to the rear with their flanks anchored by the Market House and Presbyterian Meeting House. A part of the Scottish Quarter in the town was also burned by the garrison as it was perceived to be a stronghold of rebel sympathisers."]}, {"page": "13th Hussars", "response": ["The regiment formed part of Beresford's Allied-Spanish Army at the Battle of Albuera on 16 May 1811.Cannon, p. 49 The French army, commanded by Marshal Jean-de-Dieu Soult, Duc de Dalmatie, was attempting to relieve the French garrison of the border fortress of Badajoz. Only after bloody and fierce fighting, and the steadfastness of the British infantry, did the allies carry the day. The regiment, which was unbrigaded, formed part of the cavalry force commanded initially by Brigadier Robert Ballard Long and, later in the battle, by Major General Sir William Lumley.Cannon, p. 50"]}, {"page": "List of historical acts of tax resistance", "response": ["When residents of St. George parish refused to pay their church tithes, William Lumley, governor of Bermuda, put several in military jail. Lumley's acts were later ruled illegal (Basham v. Lumley, 1829), the court ruling that although the governor of the Bermuda colony had also been granted ecclesiastical authority by the crown, he was not authorized to use his civil authority to imprison people who refused his ecclesiastical orders; at most he could excommunicate them."]}, {"page": "1st King's Dragoon Guards", "response": ["*1840–1851: Gen. Hon. Sir William Lumley, GCB"]}, {"page": "Groom of the Chamber", "response": ["|10 Mar 1812 || rowspan=8| Hon. William Keppel || rowspan=3| Gen. Thomas Slaughter Stanwix  || rowspan=8| Gen. Edmund Stevens || rowspan=6| Wilson Braddyll || rowspan=8| Hon. William Lumley || rowspan=8| Charles Nassau Thomas || rowspan=8| Hon. Henry Fitzroy Stanhope || rowspan=3|Gen. Charles Leigh ", "|Jan 1820 || rowspan=9| Hon. Edward Finch || rowspan=9| Hon. William Keppel || rowspan=4| Edmund Stevens || rowspan=9| Hon. William Lumley || Charles Nassau Thomas || rowspan=6| Hon. Henry Fitzroy Stanhope || rowspan=9| Hon. Augustus Cavendish-Bradshaw || rowspan=9| Tomkyns Hilgrove Turner || rowspan=3| Hon. Sir Edward Paget || rowspan=2| Sir George Campbell || rowspan=7| Hon. Henry King || rowspan=9| Joseph Whatley || rowspan=8| Sir Edmund Nagle", "|June 1830 || rowspan=9| Hon. Edward Finch || Hon. William Keppel || rowspan=9| Hon. William Lumley || rowspan=7| Hon. Augustus Cavendish-Bradshaw || rowspan=9| Tomkyns Hilgrove Turner || rowspan=9| Joseph Whatley || rowspan=9| Hon. Sir Charles Paget || rowspan=9| Sir William Houston || rowspan=9| Thomas Armstrong || rowspan=5| Hon. John Robert Townshend || rowspan=6| Hon. George Cecil Weld-Forester || rowspan=3| Henry Thomas Hope"]}, {"page": "6th (Inniskilling) Dragoons", "response": ["* 1827 Gen. William Lumley app. 3 November 1827"]}, {"page": "Battle of Albuera order of battle", "response": ["    Maj-Gen William Lumley"]}, {"page": "Robert Ballard Long", "response": ["In 1810 Long returned to active service joining Wellington's army in the Peninsula. He took command of the cavalry (one British brigade, one Portuguese brigade and an unbrigaded British regiment) of the army of Sir William Beresford during the operations surrounding the first Allied siege of Badajoz. Long took command of the cavalry on 21 March 1811, a mere four days before they were to see action. The cavalry clash at Campo Mayor on 25 March 1811, was to become a very controversial action. Beresford considered that Long had lost control of his light cavalry, which had pursued fleeing French cavalry for up to seven miles until they came within range of the fortress guns of Badajoz. The historian Charles Oman later sided with Beresford in calling the Campo Mayor action reckless, though without naming Long.Oman, Charles. Wellington's Army, 1809-1814. London: Greenhill, (1913) 1993. , p. 105. Beresford also claimed that his taking personal command of the heavy dragoons had prevented Long from ordering them to attempt a suicidal charge against French infantry squares . However, the army as whole felt differently and sided with the 13th Light Dragoons who had pursued the French. The pursuit took place after the 13th had made an epic charge causing no less than six enemy squadrons to rout, having only two and a half squadrons themselves. In contrast to Oman's opinion, the historian Sir John Fortescue wrote, \"Of the performance of Thirteenth, who did not exceed two hundred men, in defeating twice or thrice their numbers single-handed, it is difficult to speak too highly.\"Fletcher, p. 140. Long was of the opinion, and was subsequently supported in this by the historian Sir William Napier, that if Beresford had released the British brigade of heavy dragoons he would have been able to force the whole French column to surrender.McGuffie, T.H (Ed). Peninsular Cavalry General (1811-1813): The Correspondence of Lieutenant-General Robert Ballard Long, London (1951). Letter to C.B. Long, St. Vicente, near Elvas, 28 March 1811, pp. 73-81. This was the start of the abrasive and acrimonious relationship between Beresford and Long. At the subsequent clash at Los Santos (16 April 1811) Long managed to retain the heavy dragoons under his command and inflicted a reverse on the French cavalry, the French 2nd Hussars suffering considerable losses. On two subsequent occasions, Long was ordered to withdraw from action without engaging whilst still delaying the French through manoeuvre, though Long maintained that he was given orders merely to fall back to a certain position, with no mention being made about delaying the French advance. On each occasion Long withdrew too quickly and gave the French time to respond, apparent failures which frustrated Beresford enough to take advantage of Long's junior rank in relation to allied Spanish cavalry generals to relieve Long of his command, on the day of the Battle of Albuera, and replace him with the more senior general William Lumley.Fletcher (p. 149 - referencing Fortesque) directly attributes the precipitate withdrawal of Long's men back over to the Albuera town side of the river, in the opening stages of the Battle of Albuera, to mistakes made by Beresford's staff officers, two of whom gave conflicting orders to Long. The decision to replace Long, a brigadier, with Lumley, who was a major general, seems to have been made with Long's acquiescence.  However, Beresford's timing for this replacement to be made active, during the opening stages of the Battle of Albuera, was taken as a mortal insult by Long. Long subsequently took an honourable part in the battle, though under Lumley's command. Long also served under Lumley at the Battle of Usagre on 25 May 1811, when the British cavalry neatly trapped two regiments of French dragoons at a bridge, inflicting severe casualties."]}, {"page": "Battle of Usagre", "response": ["In the Battle of Usagre on 25 May 1811, Anglo-Allied cavalry commanded by Major-General William Lumley routed a French cavalry force led by Major-General Marie Victor Latour-Maubourg at the village of Usagre in the Peninsular War."]}, {"page": "Fantasy Fan", "response": ["The Fantasy Fan was assisted by the generosity of its contributing authors. who included Robert E. Howard, David H. Keller, J. Harvey Haggard, Eando Binder, and a number of Lovecraft's correspondents including August Derleth, R.H. Barlow, William Lumley, F.Lee Baldwin, Duane Rimel, Emil Petaja and Robert Bloch. Bloch had only one piece in the zine, \"The Laughter of a Young Ghoul\", in Issue 16 (Dec 1934).  "]}, {"page": "Groom in Waiting", "response": ["|17 July 1837 || rowspan=7| General The Hon. Sir William Lumley || rowspan=9| Admiral Sir Robert Otway, Bart. || rowspan=3| Colonel Thomas Armstrong || rowspan=2| The Hon. Charles Augustus Murray || rowspan=6| The Hon. William Cowper MP || rowspan=4| Henry Rich, Esq. MP || rowspan=25| Sir Henry Seton, Bart. ", "*7 November 1842–15 December 1850 General The Hon. Sir William Lumley"]}, {"page": "List of British Army full generals", "response": ["| Sir William Lumley|| 1769|| 1850|| "]}, {"page": "Second siege of Badajoz (1811)", "response": ["The siege began on 22 April 1811. Philippon's 4,000 defenders included the 1st Battalions of the 12th Light, 34th Line, and 88th Line Infantry Regiments and the 3rd Battalions of the 40th and 100th Line Infantry Regiments. To oppose the French, Beresford had 10,500 British and 10,200 Portuguese troops available. In case Soult tried to relieve Badajoz, Wellington arranged for as many as 15,000 Spanish troops to be ready to help. On 5 May Dickson reported that the siege train was finally ready. The next day, Beresford invested Badajoz south of the Guadiana with Alten's brigade, Major General William Lumley's British brigade, and Brigadier General Luiz Fonseca's Portuguese brigade. On the 7th Lieutenant Colonel James Kemmis's brigade and the 17th Portuguese Regiment took post on the north side opposite San Cristobal. Four more brigades were stationed in support between Badajoz and La Albuera. Meanwhile, Colborne conducted a successful campaign in the Sierra Morena with 2,000 men, causing Latour-Maubourg to fall back even farther."]}, {"page": "Granby Thomas Calcraft", "response": ["Calcraft, who had been promoted colonel for his services on 25 July 1810, was engaged at the head of his regiment at the Battle of Campo Maior, at the Battle of Albuera, and in William Lumley's charge at Los Santos on 16 April 1811. In January 1812 the Heavy Brigade, which was again temporarily under the command of Calcraft, assisted in covering the siege of Ciudad Rodrigo, and when Wellington formed the Siege of Badajoz, it was left with General Graham's division to watch Auguste Marmont."]}, {"page": "List of governors of dependent territories in the 19th century", "response": ["::*William Lumley, Governor (1819–1822)", "::*William Lumley, Governor (1823–1825)"]}, {"page": "Lumley, William", "response": ["#redirectWilliam Lumley"]}, {"page": "Battle of the Retiro", "response": ["The combats took place on July 5, 1807, in the Plaza de Toros del Retiro, current Plaza San Martín (Buenos Aires). The Spanish forces had fighters belonging to the Spanish Navy, commanded by the Captain Juan Gutiérrez de la Concha, and the Lt. Juan Ángel Michelena. It also counted on the participation of Creole militias, among them the Regiment of Patricians, and Grenadier Corps of the Third of Galicia, commanding Jacobo Adrián Varela. The British troops were in command of the Generals Samuel Auchmuty and William Lumley, who advanced towards the Plaza de Toros on July 4, 1807. "]}, {"page": "Governor Lumley", "response": ["*William Lumley (1769–1850), Governor of Bermuda from 1819 to 1822 and from 1823 to 1825"]}]}}