{"wiki_id": "http://www.wikidata.org/entity/Q8010091", "itemLabel": "William Grainge", "itemDescription": "British antiquarian", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Grainge", "wikipedia_page": {"main": "William Grainge (25 January 1818 – 29 September 1895) was an English antiquarian and poet, and a historian of Yorkshire. He was born into a farming family in Dishforth and grew up on Castiles Farm near Kirkby Malzeard in the North Riding of Yorkshire, where he studied the archaeological site beneath the farm buildings, now known as Cast Hills settlement. Although he left school at age 12, he educated himself well enough to become a clerk to a solicitors' firm in Boroughbridge. He later established a bookshop in Harrogate and published numerous books on local history and topography, besides publishing a number of anonymous poems and discourses about local natural history.\nGrainge befriended the young John Farrah, and taught him botany and other natural history. Farrah was a grocer and an amateur botanist, who went on to become a Fellow of The Linnean Society and chairman of Yorkshire Naturalists' Union. After Grainge died, Farrah gave a lecture about Grainge's life and works, and later wrote a tribute to him. Most of what we know about Grainge's life comes from Farrah.", "link_mentions": [{"page": "1895 in literature", "response": ["*September 29 – William Grainge, English local historian (born 1818)"]}, {"page": "Edward Fairfax", "response": ["He was the natural son of Sir Thomas Fairfax the elder, of Denton in Yorkshire, and a half-brother of Thomas Fairfax,1st Lord Fairfax of Cameron (1560–1640). Fairfax lived at New Hall, Fewston,The History and Topology of Harrogate and Knaresbourough Forest by William Grainge near Harrogate, Yorkshire, England."]}, {"page": "Brimham Rocks", "response": ["In his Guide to Brimham Rocks published in 1863, local historian William Grainge wrote \"These names are frequently changed by the innovating, garrulous guide, who has changed the Baboon's Head to the Gorilla's, and the Yoke of Oxen to the Bulls of Babylon, which unsettling of nomenclature he calls keeping pace with the times. Unique as the rocks are amongst the freaks of nature, there is nearly as much originality about the guide but infinitely less grandeur.\""]}, {"page": "Weeton, North Yorkshire", "response": ["The village church is called St Barnabas and was built at the cost of the Earl of Harewood. The foundation stone was laid in 1851 by the Bishop of Ripon and construction was completed in 1852. The nearby parsonage was built in 1853. The first three vicars were the Rev. James Palmes, the Rev. T.H. Fearon and, from 1867, the Rev. Christopher Wybergh.The History and Topology of Harrogate and Knaresborough Forest by William Grainge"]}, {"page": "Swinsty Reservoir", "response": ["The hall was owned by a succession of Robinsons right up until 1772. At this point, the male Robinson line came to an end and the hall and estate passed to Robert Bramley, husband of Mary Robinson, and later his son John Bramley, and in 1853 John Bramley's son, also named John.Harrogate and the Forest of Knaresborough by William Grainge (published 1871, reprinted 1988) Stone for the construction of Fewston Reservoir was purchased from the Swinsty Hall quarry in 1874, from a Mr Bramley."]}, {"page": "Fewston", "response": ["The poet Edward Fairfax lived at nearby New Hall, now submerged under the waters of Fewston Reservoir, as did Ferdinando Fairfax, 2nd Lord Fairfax of Cameron. Edward's daughters Elizabeth and Anne were baptised in the village church in 1606 and 1621 respectively, while Ferdinando's daughter Mary and son Charles were baptised there in 1606 and 1615.The History and Topology of Harrogate and Knaresborough Forest by William Grainge, 1871, reprinted 1988 by M.T.D. Rigg, Guiseley."]}, {"page": "Kirkby Malzeard", "response": ["The writer and historian William Grainge was born to a farming family at Dishforth, and grew up at Castiles Farm, near Kirkby Malzeard. He attended Kirkby Malzeard village school, the only formal education that he received; he was otherwise self-educated."]}, {"page": "St Robert's Church, Pannal", "response": ["The nave was rebuilt in the Georgian era, and the visual evidence of this is the \"rusticated quoins and the rusticated surround of a former blind north doorway.\" The two-light windows in perpendicular style were added in 1929, the south-east one having been shortened when the chapter house was added. The chancel is in decorated style. It has four windows, its east window having three lights and reticulated tracery, plus an ogee-headed priest's doorway on the south side. One of the chancel's stained glass windows is from Knaresborough Priory.Mentioned in William Grainge, Harrogate and the Forest of Knaresborough, 1871 It is a small window in the point of an arch, showing a coat of arms with two oaks above a red and blue Trinitarian cross. The oaks may commemorate the fact that \"in August 1255 the king gave three oaks to the friars of the Holy Trinity for the fabric of the church of St Robert,\". Pannal historian Anne Smith suggests that the object between the oaks is the gateway to the Priory."]}, {"page": "Grainge, William", "response": ["#redirectWilliam Grainge"]}, {"page": "Grainge", "response": ["*William Grainge (1818–1895), British antiquarian, poet and local historian"]}, {"page": "John Farrah", "response": ["John Farrah, F.L.S., F.R.Met.S (28 May 1849 – 13 November 1907) was a British grocer, confectioner, biologist and meteorologist from Harrogate, North Riding of Yorkshire, England. In the late 19th century he developed the business strategy for Farrah's toffee shop which he inherited from his family in Harrogate. He was made a fellow of the Meteorological Society in 1894. He was president of the botanical section of the Yorkshire Naturalists' Union, working with Thomas Sheppard, George Edward Massee, William Eagle Clarke and Charles Crossland, and in 1903 discovered the mycological species Entoloma farrahi, which was named after him, although there has been some question as to its identity since then. He was a close friend of Harrogate historian William Grainge and for some years they were \"constant companions\", supporting each other in their work. The American mycologist George Francis Atkinson described him as a \"great Yorkshire character\". Farrah married three times, and had three children.", "Farrah lived at a house named Jefferies Coate on the York Road, Harrogate, from at least 1894. He retired on 26 March 1900, so in 1901 the census finds Farrah as a retired baker, grocer and widower at Jefferies Coate in York Road, Harrogate, with his children. After he retired, his health was poor. In the two years before he died, he bought two farms at Felliscliffe, but they required his time and money, and took him away from his botanical work. Farrah is buried at Grove Road Cemetery, Harrogate. He left £26,254 () in his will. Nine years after Farrah died, his son Joseph presented eight marble busts by William John Seward Webber, besides Thomas Holroyd's portrait of Farrah's friend William Grainge and some \"rare manuscripts\" to Harrogate Library.", "===Friendship with William Grainge===", "According to Thomas Sheppard, M.Sc. (1876–1945), Farrah was a \"good antiquary, and had a thorough knowledge of the past and present history of the Harrogate district. For several years he was the constant companion of the late William Grainge, whose History of the Forest of Knaresborough is well known. In connection with this work Mr. Farrah helped a good deal.\""]}]}}