{"wiki_id": "http://www.wikidata.org/entity/Q8018864", "itemLabel": "William Stoddart", "itemDescription": "Scottish physician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Stoddart", "wikipedia_page": {"main": "William Stoddart (born 25 June 1925, in Carstairs) is a Scottish physician, author and \"spiritual traveller\", who has written several books on the Perennial Philosophy and on comparative religion.He has been called a “master of synthesis”  and is one of the important Perennialist writers in the present day. For many years he was assistant editor of the British journal Studies in Comparative Religion. He has translated into English, from the original French or German, several of the books of the perennialist masters Frithjof Schuon (1907–1998) and Titus Burckhardt (1908–1984).", "link_mentions": [{"page": "1925", "response": ["** William Stoddart, Scottish physician and author"]}, {"page": "Seyyed Hossein Nasr", "response": ["* Religion of the Heart: Essays Presented to Frithjof Schuon on his Eightieth Birthday, edited with William Stoddart (1991)"]}, {"page": "Perennial philosophy", "response": ["* William Stoddart", "* Frithjof Schuon and the Perennial Philosophy, Authors Harry Oldmeadow and William Stoddart, Contributor\tWilliam Stoddart, Publisher World Wisdom, Inc, (2010) "]}, {"page": "Ananda Coomaraswamy", "response": ["After the couple divorced in 1930, they remained friends. Shortly thereafter, on 18 November 1930, Coomaraswamy married Argentine Luisa Runstein, 28 years younger, who was working as a society photographer under the professional name Xlata Llamas. They had a son, Coomaraswamy's third child, Rama Ponnambalam (1929-2006), who became a physician and convert at age 22 to the Roman Catholic Church. Following Vatican II, Rama became a critic of the reforms and author of Catholic Traditionalist works.\"Rama P.Coomaraswamy (1929-2006)\" by William Stoddart and Mateus Soares de Azevedo (3 pdfs) He was also ordained a Traditionalist Roman Catholic priest, despite the fact that he was married and had a living wife.\"On the Validity of My Ordination\" by Dr. Rama P. Coomaraswamy Rama Coomaraswamy studied in England and then in India, learning Hindi and Sanskrit. Became a psychiatrist in the United States, he was an opponent of Pope John Paul II and remain a wider correspondent of mother Teresa of Calcutta, whose first healing attribution was recognized by Wojtyła in 2002.", "*William Stoddart"]}, {"page": "Index of philosophy articles (R–Z)", "response": ["* William Stoddart"]}, {"page": "Frithjof Schuon", "response": ["The traditionalist or perennialist spiritual perspective was initially enunciated in the 1920s by René Guénon and in the 1930s by Frithjof Schuon. The metaphysicians and art specialists Ananda Coomaraswamy and Titus Burckhardt also became prominent advocates of this intellectual current.Harry Oldmeadow, Frithjof Schuon and the Perennial Philosophy, World Wisdom, 2010, p. xiii According to the perennialist writer William Stoddart, \"the central idea of the perennial philosophy is that Divine Truth is one, timeless and universal, and that the different religions are but different languages expressing that one Truth\" – hence the title given by Schuon to his first book in French, De l'unité transcendante des religions.William Stoddart, Remembering in a World of Forgetting, World Wisdom, 2008, pp. 51-52 For Patrick Laude, a perennialist author is “one who claims the universality and primordiality of fundamental metaphysical principles and the perennity of the wisdom that actualizes these principles in man, as expressed in all great revelations and major teachings of sages and saints throughout the ages”.Patrick Laude, Frithjof Schuon: Life and Teachings, SUNY, 2002, p. 79", "As did Plato in ancient Greece, Adi Shankara in Hinduism, Meister Eckhardt and St Gregory Palamas in Christianity and Ibn Arabī in Islam – to name some examples –, Schuon attests that the essential discernment in metaphysics is that between the Real and the non-real (the illusory), Ātmā and Māyā.William Stoddart, \"Lossky’s Palamitism in the Light of Schuon\" in Sacred Web Journal, Vol. 6, 2000, pp. 23-24 He emphasizes that the Real, or Beyond Being, which is absolute and infinite, is also the essence of all good (the Sovereign Good).Patrick Laude, Keys to the Beyond, Frithjof Schuon’s Cross-Traditional Language of Transcendence, SUNY, 2020, pp. 162-163 As St Augustine reminds us, it is in the nature of the Good (Agathôn) to radiate, hence the projection of Māyā,Frithjof Schuon, Form and Substance in the Religions, World Wisdom, 2002, pp. 40-41 which is simultaneously divine (Īshvara), celestial (Buddhi and Svarga) and \"earthly\", the latter including the domain of transmigration (samsâra).Frithjof Schuon, Survey of Metaphysics and Esoterism, World Wisdom, 1986, p. 67 Every good offered by the world comes from the radiation of the Sovereign Good, every evil comes from Its remoteness.Frithjof Schuon, Survey of Metaphysics and Esoterism, World Wisdom, 1986, p. 65 Mâyâ both veils and reveals God, the Absolute.Harry Oldmeadow, Frithjof Schuon and the Perennial Philosophy, World Wisdom, 2010, p. 62", "Every religion comprises two main aspects, \"exoterism\" and \"esoterism\".Seyyed Hossein Nasr, \"Introduction\" in The Essential Frithjof Schuon, World Wisdom, 2005, p. 15 This religious esoterism is qualified as \"relative\" by Schuon, to differentiate it from \"absolute\"Frithjof Schuon, \"Lettre à Jean-Pierre Laurant\" in Dossiers H : Frithjof Schuon, L’Âge d’Homme, 1984, p. 424 or \"quintessential\"Patrick Laude, Keys to the Beyond, Frithjof Schuon’s Cross-Traditional Language of Transcendence, SUNY, 2020, p. 97 esoterism, which is neither limited nor totally expressed by a particular religious form.William Stoddart, Remembering in a World of Forgetting, World Wisdom, 2008, p. 103", "* Adastra & Stella Maris, foreword by William Stoddart, bilingual, World Wisdom, 2003", "* Songs Without Names, Vol. I-VI, introduction by William Stoddart, foreword by Annemarie Schimmel, World Wisdom, 2006", "* Songs Without Names, Vol. VII-XII, introduction by William Stoddart, foreword by Annemarie Schimmel, World Wisdom, 2006", "* World Wheel, Vol. I-III, introduction by William Stoddart, foreword by Annemarie Schimmel, World Wisdom, 2006", "* World Wheel, Vol. IV-VII, introduction by William Stoddart, foreword by Annemarie Schimmel, World Wisdom, 2006", "* Religion of the Heart: Essays presented to Frithjof Schuon on his eightieth birthday, ed. Seyyed Hossein Nasr & William Stoddart, Washington D.C.: Foundation for Traditional Studies (1991). Seyyed Hossein Nasr, Biography of Frithjof Schuon ♦ Bernard P. Kelly, Notes on the Light of the Eastern Religions, with Special Reference to the Writings of Ananda Coomaraswamy, René Guénon, and Frithjof Schuon ♦ et al.", "* Vol. 6 (2000). Harry Oldmeadow, “Signposts to the suprasensible”: Notes on Frithjof Schuon’s understanding of “Nature”  ♦ William Stoddart, Lossky’s Palamitism in the Light of Schuon ", "* Vol. 4, N° 2 (1998) In Memory: Frithjof Schuon. Seyyed Hossein Nasr, In Memoriam: Frithjof Schuon - A Prelude ♦ Martin Lings, Frithjof Schuon: An Autobiographical Approach ♦ Huston Smith, Providence Perceived: In Memory of Frithjof Schuon ♦ Tage Lindbom, Frithjof Schuon and Our Times  ♦ Harry Oldmeadow, A Sage for the Times: The Role and the Oeuvre of Frithjof Schuon  ♦ Reza Shah-Kazemi, Frithjof Schuon and Prayer  ♦ Michael O. Fitzgerald, Frithjof Schuon's Role in Preserving the Red Indian Spirit  ♦ William Stoddart, The German Poems of Frithjof Schuon  ♦ Brian Keeble, Some Thoughts on Reading Frithjof Schuon's Writings on Art "]}, {"page": "Traditionalist School (perennialism)", "response": ["The principal authors of this school of thought are René Guénon, Ananda Coomaraswamy and Frithjof Schuon. Other important members include Titus Burckhardt, Martin Lings, Seyyed Hossein Nasr, William Stoddart, Jean-Louis Michon, Marco Pallis, Huston Smith, and Julius Evola.", "The ideas of the Traditionalist School are considered to begin with René Guénon. Other members of that school of thought include Ananda Coomaraswamy, Frithjof Schuon, Titus Burckhardt, Martin Lings, Hossein Nasr, William Stoddart, Jean-Louis Michon, Marco Pallis, and Huston Smith.", "* William Stoddart"]}, {"page": "Mateus Soares de Azevedo", "response": ["He lived a year in London, England, in the 1980s, where he experienced the intellectual impact of the work of French metaphysician René Guénon, which expounds a profound critique of modern materialism and relativism from a purely metaphysical perspective. In the 1990s, he lived a season in Washington, DC, and  studied under William Stoddart, Rama Coomaraswamy, and Seyyed Hossein Nasr. There he deepened the study of the Perennial Philosophy and experienced the spiritual impact of the teachings of the German metaphysician and esoterist Frithjof Schuon. For Azevedo,See in this respect his \"Men of a Single Book\" (World Wisdom Books, 2010), especially the introduction and chapter one. the Perennial Philosophy casts a unique and contemporary light on the spiritual heritage of the peoples and updates the message of the traditional religions, especially Christianity, Islam, and Buddhism, giving to twenty-first century man a practical alternative to modern skepticism and intellectual confusion.", "Azevedo absorbed elements both from Guénon and Schuon, as well as from William Stoddart,  in his works, such as Men of a Single Book and Iniciación al Islam y al Sufism.\"Iniciación al Islam y al Sufism\", Barcelona, 2004. He is the editor of two anthologies published in the United States. The first is Ye Shall Know The Truth: Christianity And The Perennial Philosophy,Ye Shall Know The Truth: Christianity and The Perennial Philosophy catalog information at the publisher's website. featuring works by Frithjof Schuon, René Guénon, Titus Burckhardt and other perennialists. The second is Remembering in a World of Forgetting: Thoughts on Tradition and Postmodernism, a collection of the most important essays by the British perennialist author William Stoddart.Remembering in a World of Forgetting: Thoughts on Tradition and Postmodernism at the publisher's website.", "*Remembering in a World of Forgetting (by William Stoddart. World Wisdom, 2008) ", "*Outline of Buddhism (by William Stoddart. Rio de Janeiro, 2004)", "*Islam today: between Tradition, fundamentalism, and political extremism (with William Stoddart)  ", "*Other Islams (with William Stoddart)", "*Biography of William Stoddart", "*William Stoddart"]}, {"page": "Martin Lings", "response": ["*William Stoddart"]}, {"page": "Titus Burckhardt", "response": ["In 1952, Burckhardt and his wife moved to Lausanne, where he founded the French-Swiss branch of Urs Graf and created the collection Stätten des Geistes (\"Cities of the Spirit\") for which he wrote and illustrated three volumes: Siena, City of the Virgin, Fez, City of Islam, and Chartres and the Birth of the Cathedral. These completed the collection, which already included volumes on Mount Athos, Mount Sinai, Celtic Ireland, Constantinople and Kyoto. In 1951, 1958 and 1960 other publishing houses brought out the original editions of Burckhardt's Introduction to Sufi Doctrine, Sacred Art in East and West and Alchemy, Science of the Cosmos, Science of the Soul.  Following Guénon, Coomaraswamy and Schuon, Burckhardt became identified as one of the great 20th century spokesmen of the philosophia perennis, \"that 'uncreated wisdom' expressed in Platonism, the Vedanta, Sufism, Taoism and other authentic esoteric and sapiential teachings\". According to the philosopher William Stoddart, Burckhardt — historian and philosopher of art, esoterist initiated in a Sufi path, metaphysician and artist — devoted his work as a writer to expounding \"the different aspects of Wisdom and Tradition.\"", "*Mirror of the Intellect: Essays on Traditional Science and Sacred Art (translated by William Stoddart). Cambridge, England: Quinta Essentia, 1987; Albany/NY: SUNY, 1987.", "*Fez, City of Islam (translated from the German by William Stoddart). Cambridge, England: Islamic Texts Society, 1992.", "*Chartres and the Birth of the Cathedral, (translated by William Stoddart). Ipswich, England: Golgonooza Press, 1995; Bloomington, Indiana: World Wisdom Books, 1995. ", "*Moorish Culture in Spain (new edition, translated from the German by Alisa Jaffa and William Stoddart). Louisville/KY: Fons Vitae, 1999.", "*Alchemy, Science of the Cosmos, Science of the Soul (translated from the German by William Stoddart). London: Stuart and Watkins, 1967; Baltimore/MD: Penguin Books, 1972; Longmead, Shaftesbury, Dorset: Element Books, 1986; Louisville/KY: Fons Vitae, 2001."]}, {"page": "World Wisdom", "response": ["World Wisdom is an independent American publishing company established in 1980 in Bloomington, Indiana. World Wisdom publishes religious and philosophical texts, including the work of authors such as Frithjof Schuon, Seyyed Hossein Nasr, Titus Burckhardt, Ananda K. Coomaraswamy, Joseph Epes Brown, Paul Goble, Swami Ramdas, Samdhong Rinpoche, William Stoddart, and Martin Lings."]}, {"page": "Tage Lindbom", "response": ["* \"Lucifer\" (transl. of chapter from Bortom teologin), Every Branch in Me: Essays on the Meaning of Man, ed.  Barry McDonald, World Wisdom, Bloomington, 2002.  / 978-0941532396. Also published in Religion of the Heart: Essays Presented to Frithjof Schuon on His Eightieth Birthday, eds. Seyyed Hossein Nasr and William Stoddart, Washington D.C., 1991.", "* William Stoddart"]}, {"page": "Kurt Almqvist", "response": ["* The Sun in the Tree, with Some Reflections on \"Faith and Works\", Religion of the Heart: Essays Presented to Frithjof Schuon on His Eightieth Birthday, eds. Seyyed Hossein Nasr and William Stoddart, Washington D.C., 1991.articles in English"]}, {"page": "Stoddart", "response": ["*William Stoddart (born 1925), British philosopher"]}, {"page": "Studies in Comparative Religion", "response": ["The journal was established in 1963 by Francis Clive-Ross, who also served as editor-in-chief and publisher. From 1963 to 1967 the journal was published under the name Tomorrow. Perennialist author William Stoddart also served as an assistant editor for many years. Jacob Needleman, editor of The Penguin Metaphysical Library, published a collection of essays from Studies in Comparative Religion under the title \"The Sword of Gnosis\". The journal ceased publication in 1987 and the articles were unavailable until 2007, when World Wisdom launched a free on-line archive."]}, {"page": "Angus Macnab", "response": ["Macnab's studies of the history of Moorish Spain resulted in two books: Spain under the Crescent Moon, and Toledo, Sacred and Profane, as well as a number of articles published in the London journal Studies of Comparative Religion from 1965 to 1968. He also wrote Bulls of Iberia, which was described by the English critic Kenneth Tynan as \"awesomely good\". In an article in the British journal New Blackfriars,New Blackfriars, Vol. 76, No. 1, October 1995, pp. 461–462. William Stoddart paid tribute to Macnab as a leading Catholic intellectual who was the author of a fascinating study of the Spanish Middle Ages. "]}, {"page": "Bernard Philip Kelly", "response": ["*William Stoddart", "*William Stoddart, A Scholastic Universalist: The Writings and Thought of Bernard Kelly (1907–1958), New Blackfriars, Volume 76 Issue 897, pp. 455–462 Online text (PDF)"]}, {"page": "Whitall Perry", "response": ["*William Stoddart"]}, {"page": "William Lee Stoddart", "response": ["On July 19, 1923, at Asheville, North Carolina, William Stoddart remarried. His second wife was Mrs. Sabra (Wheless) Ballinger who died in 1934."]}, {"page": "List of British philosophers", "response": ["* William Stoddart"]}, {"page": "Michael O. Fitzgerald", "response": ["*William Stoddart"]}, {"page": "The Matheson Trust", "response": ["Matheson Trust associates have included, among others, Martin Lings, Charles Le Gai Eaton, William Stoddart and Reza Shah-Kazemi.", "*William Stoddart"]}, {"page": "Stoddart, William", "response": ["#redirectWilliam Stoddart"]}, {"page": "A. K. Saran", "response": ["* William Stoddart"]}]}}