{"wiki_id": "http://www.wikidata.org/entity/Q8013393", "itemLabel": "William Jackson", "itemDescription": "Scottish harpist and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Jackson_(Scottish_composer)", "wikipedia_page": {"main": "William Jackson (born 14 September 1955) is a Scottish harpist and composer.\nWilliam Jackson was born in Cambuslang, near Glasgow.  As his grandparents came from County Donegal, he visited Ireland many times, throughout his childhood, and still has a home there. He trained as a music therapist at the Guildhall School of Music in 1992/93, and from 1998 - 2009 he headed the Music therapy department at Mission Children's Hospital in Asheville, North Carolina. In 1969 he formed the Scottish folk group Contraband, who released an album in 1974, then disbanded in 1975. Jackson's brother George (died 1998) was also a member. He became a founding member of Ossian in 1976. He has lived in Ireland since 2009 and works as a music therapist there, while also continuing his concert and teaching work in the US for part of the year.\nOssian disbanded in about 1989, and he continued as a solo artist both as a performer and composer. He became one of the first to compose using both traditional and classical musicians, and his \"Wellpark Suite\" in 1985 was generally acclaimed as a milestone in Scottish music. From 1989 William Jackson released a series of albums on his own label Mill Records, sometimes using ancient texts, and on one occasion a poem by Kahlil Gibran. In 1996, A Scottish Island was commissioned by the Scottish Chamber Orchestra. In 1999 he wrote Land of Light and won the Song for Scotland competition with this song. It was performed at Edinburgh Castle on 27 July 2000, and was featured at the 2000 Edinburgh Tattoo. He arranged and performed the music for Battle of the Clans, a documentary on The History Channel. As a producer, he has worked with several singers on the anthology Celtic Woman. Duan Àlbanach was recorded with the Scottish Festival Orchestra, recorded live in 2002, but not released until 2003.\n\n", "link_mentions": [{"page": "September 14", "response": ["*  1955   – William Jackson, Scottish harp player and composer"]}, {"page": "Tony McManus (musician)", "response": ["* 1996 Inchcolm, William Jackson ", "* 1998 Celtic Experience, William Jackson ", "* 2001 Notes from a Hebridean Island, William Jackson"]}, {"page": "Catherine-Ann MacPhee", "response": ["Ian Green from Greentrax Records heard her at a festival in Dingwall and offered a recording contract. Like her subsequent albums, all of the songs on \"Cànan Nan Gaidheal\" (The Language of the Gael) (1987) are in Gaelic, and most are traditional. One of the songs is by the Gaelic-speaking folk-rock group Runrig. The backing musicians include Tony Cuffe and William Jackson, both from the group Ossian. Her second album, which is called Chi mi 'n Geamhradh after the first song, written by Calum and Rory MacDonald of Runrig, contains mostly traditional songs, though it has been described as \"containing a bewildering range [in whose opinion?] of pop and New Age influences including drum machine, harp and bass guitar\". It was probably the first time that \"waulking songs\" (work songs for women finishing tweed cloth) were treated this way. The Mrs Ackyroyd Band is a loose association of singers who record perform comic parodies of folk music. In 1987 they undertook their only non-comic project, a song-cycle called \"The Stones of Callanish\". MacPhee sang two of the songs on it."]}, {"page": "Ossian (band)", "response": ["Their first two LPs were Ossian (1977) and St. Kilda Wedding (1978).  Billy Ross left the band in 1980, and was replaced by Tony Cuffe as lead vocalist, also playing guitar and whistle.  In 1981, Iain MacDonald joined, playing highland pipes, flute, and whistle.  They broke up in 1989 when Tony Cuffe and William Jackson moved to the U.S. "]}, {"page": "Jackson (name)", "response": ["*William Jackson (Scottish composer) (born 1955)", "*William Jackson (Victoria Cross) (1897–1959), Australian Army, recipient of the Victoria Cross", "*Sir William Jackson (British Army officer) (1917–1999), British Army officer and Governor of Gibraltar", "*William Jackson, 1st Baron Allerton (1840–1917), British politician", "*William Jackson (secretary) (1759–1828), secretary to the U.S. Constitutional Convention", "*William Jackson (Massachusetts) (1783–1855), U.S. Representative from Massachusetts", "*Sidney William Jackson (1873–1946), Australian ornithologist", "*William Jackson III (born 1992), American football player", "*William Jackson (curler) (1871–1955), Scottish curler", "*William Jackson (Canadian administrator)", "*William Jackson (gangster) (1920–1961), American mobster", "*William Jackson (pirate) (), English pirate"]}, {"page": "Calum Malcolm", "response": ["His working credits also include The Boys of the Lough, Brian McNeill, It's Immaterial, Josef K, Mike Lindup, Stéphane Grappelli, The Happy Family, Tom Anderson, Tommy Smith, William Jackson and on Black's 2015 album, Blind Faith."]}, {"page": "William Jackson", "response": ["William Jackson may refer to:", "*William Jackson (organist born 1730) (1730–1803), referred to as Jackson of Exeter, English organist and composer", "*William Jackson of Masham (1815–1866), English organist and composer", "*William Jackson (Scottish composer) (born 1955), Scottish composer", "*William Jackson (pirate) (fl. 1639–1645), British pirate", "*William Jackson (Australian soldier) (1897–1959), Australian recipient of the Victoria Cross", "*Sir William Jackson (British Army officer) (1917–1999), British general, Governor of Gibraltar, military historian, and author", "*William Jackson (fl. 1601–1604), MP for Guildford and Haslemere", "*Sir William Jackson, 1st Baronet (1805–1876), British MP for Newcastle under Lyme and Derbyshire North", "*William Jackson, 1st Baron Allerton (1840–1917), English politician, Member of Parliament for Leeds", "*William Jackson, 1st Baron Jackson (1893–1954), Member of Parliament for Brecon and Radnorshire, 1939–1945", "*William Jackson (secretary) (1759–1828), Secretary to the Philadelphia Convention and member of the U.S. Continental Army", "*William Jackson (Massachusetts politician, born 1783) (1783–1855), US Congressman from Massachusetts", "*William Jackson (Saugus, Massachusetts), English-American pottery manufacturer and politician of the 1820s", "*William Jackson (New Zealand politician) (1832–1889), New Zealand politician", "*William Jackson (Canadian politician) (1858–1938), Canadian Member of Parliament", "*William Jackson (Canadian administrator)", "*William Jackson (journalist) (1737–1795), Irish preacher, journalist, playwright, radical, and spy", "*William Jackson (bishop) (1751–1815), bishop of Oxford", "*William Jackson (Archdeacon of Carlisle) (1792–1873), priest and academic", "*William Jackson (Dean of Killala) (died 1885), Anglican priest in Ireland", "*William Jackson (Archdeacon of Killala) (died 1903)", "*William Jackson (priest) (1838–1931), Rector of Exeter College, Oxford", "*William Jackson (engineer) (1848–1910), Boston, Massachusetts city engineer, 1885–1910", "*William Jackson (inventor) (1849–1915), Scottish mechanical engineer", "*William Jackson (curler) (1871–1955), Scottish winner of the first Olympic gold medal in curling, Chamonix, 1924", "*William Jackson (footballer) (1876–1954), Newton Heath F.C., Burnley F.C. and Wales international footballer", "*William Jackson (pitcher) (fl. 1890–1906), pitcher and outfielder for early minor leagues and Negro leagues", "*William Jackson III (born 1992), American football player", "*William Jackson (Boston loyalist) (1731–1810), American Revolutionary era loyalist", "*William Jackson (gangster) (1901–1961), loan shark, enforcer and murder victim", "*William Jackson Food Group, a food manufacturer in the United Kingdom"]}, {"page": "1955 in British music", "response": ["*14 September – William Jackson, harpist and composer"]}, {"page": "Iona Records", "response": ["* Billy/William Jackson", "| IR010 || William Jackson || Heart Music || Calum Malcolm || Castle Sound Studios, Pencaitland, East Lothian ||  || vinyl || 1987 ||"]}]}}