{"wiki_id": "http://www.wikidata.org/entity/Q8018124", "itemLabel": "William Sargant", "itemDescription": "British psychiatrist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Sargant", "wikipedia_page": {"main": "William Walters Sargant (24 April 1907 – 27 August 1988) was a British psychiatrist who is remembered for the evangelical zeal with which he promoted treatments such as psychosurgery, deep sleep treatment, electroconvulsive therapy and insulin shock therapy.\nSargant studied medicine at St John's College, Cambridge, and qualified as a doctor at St Mary's Hospital, London. His ambition to be a physician was thwarted by a disastrous piece of research and a nervous breakdown, after which he turned his attention to psychiatry. Having trained under Edward Mapother at the Maudsley Hospital, he worked at the Sutton Emergency Medical Service during the Second World War. In 1948 he was appointed director of the department of psychological medicine at St Thomas' Hospital, London, and remained there until (and after) his retirement in 1972, also treating patients at other hospitals, building up a lucrative private practice in Harley Street, and working as a media psychiatrist.\nSargant co-authored a textbook on physical treatment in psychiatry that ran to 5 editions. He wrote numerous articles in the medical and lay press, an autobiography, The Unquiet Mind, and a book titled Battle for the Mind in which he discusses the nature of the process by which our minds are subject to influence by others. Although remembered as a major force in British psychiatry in the post-war years, his enthusiasm for discredited treatments such as insulin shock therapy and deep sleep treatment, his distaste for all forms of psychotherapy, and his reliance on dogma rather than clinical evidence have confirmed his reputation as a controversial figure whose work is seldom cited in modern psychiatric texts.", "link_mentions": [{"page": "Dianetics", "response": ["Hubbard initially described Dianetics as a branch of psychology.Lewis, Jim R., and Olav Hammer, eds. Handbook of Religion and the Authority of Science. Brill, 2010., pg 757Hubbard, L. R. Scientology: the fundamentals of thought. E.E. Manney, (1956), chapter oneStearns, Frederick R. (March 1951). \"Dianetics\". Clinical Medicine. Jon Atack writes that the original Dianetic techniques can be derived almost entirely from Sigmund Freud's lectures.Atack, J. (1990). A Piece of Blue Sky. New York. pg 121 Hubbard created the \"Freudian Foundation of America\" and offered graduate auditors certificates which included that of \"Freudian Psychoanalyst\".Technical Bulletins of Dianetics & Scientology vol.2, p.32; St Petersburg Times, \"Scientology\", p.17JCA-35 Hubbard was influenced in creating Dianetics by many psychologists such as William Sargant's work on abreaction therapy,  Carl Jung, Roy Grinker and John Spiegel's writing on hypnosis and hypnoanalysis, Nandor Fodor, Otto Rank, and others.Genter, R. (2017). Constructing a Plan for Survival: Scientology as Cold War Psychology. Religion and American Culture, 27(2), 159-190.Wallis, R. (1978). The road to total freedom: A sociological analysis of ScientologyMcconahay, J. B. (1977). The road to total freedom: A sociological analysis of Scientology. Psyccritiques, 22(10), 784-785.Atack, J. (1990). A Piece of Blue Sky. New York. pg 402 Alfred Korzybski's general semantics was also cited by Hubbard as an influence.Hubbard, \"Terra Incognita: The Mind\". . The Explorers Journal, winter 1949 / spring 1950 (on the bridge between cybernetics and general semantics)"]}, {"page": "The Doors of Perception", "response": ["William Sargant, the controversial British psychiatrist, reviewed the book for The British Medical Journal and particularly focused on Huxley's reflections on schizophrenia. He wrote that the book brought to life the mental suffering of schizophrenics, which should make psychiatrists uneasy about their failure to relieve this. Also, he hoped that the book would encourage the investigation of the physiological, rather than psychological, aspects of psychiatry.Sargant, William \"Chemical Mysticism\", British Medical Journal, Vol. 1, No. 4869 (1 May 1954), p. 1024 Other medical researchers questioned the validity of Huxley's account. According to Roland Fisher, the book contained \"99 percent Aldous Huxley and only one half gram mescaline\".Roland Fisher, quoted in Louis Cholden, ed. Lysergic Acid Diethylamide and Mescaline in Experimental Psychiatry, p. 67, Grune and Stratton, 1956 Joost A.M. Meerloo found Huxley's reactions \"not necessarily the same as... other people's experiences.\"Meerloo, Joost A.M. Medication into Submission: The Danger of Therapeutic Coercion, Journal of Nervous and Mental Diseases, 1955, 122: 353–360"]}, {"page": "1907", "response": ["* April 24 – William Sargant, British psychiatrist (d. 1988)"]}, {"page": "Project MKUltra", "response": ["His work was inspired and paralleled by the British psychiatrist William Sargant at St Thomas' Hospital, London, and Belmont Hospital, Sutton, who was also involved in the Secret Intelligence Service and who experimented on his patients without their consent, causing similar long-term damage."]}, {"page": "Idries Shah", "response": ["Nasruddin was featured in Shah's television documentary Dreamwalkers, which aired on the BBC in 1970. Segments included Richard Williams being interviewed about his unfinished animated film about Nasruddin, and scientist John Kermisch discussing the use of Nasruddin stories at the Rand Corporation Think Tank. Other guests included the British psychiatrist William Sargant discussing the hampering effects of brainwashing and social conditioning on creativity and problem-solving, and the comedian Marty Feldman talking with Shah about the role of humour and ritual in human life. The program ended with Shah asserting that humanity could further its own evolution by \"breaking psychological limitations\" but that there was a \"constant accretion of pessimism which effectively prevents evolution in this form from going ahead... Man is asleep – must he die before he wakes up?\""]}, {"page": "David Owen", "response": ["In 1960, Owen joined the Vauxhall branch of the Labour Party and the Fabian Society. He qualified as a doctor in 1962 and began work at St Thomas's Hospital. In 1964, he contested the Torrington seat as the Labour candidate against the Conservative Party incumbent, losing in what was a traditional Conservative-Liberal marginal. He was neurology and psychiatric registrar at St Thomas's Hospital for two years, as assistant to Dr. William Sargant, then Research Fellow on the Medical Unit doing research into Parkinsonian trauma and neuropharmacology."]}, {"page": "Frank Olson", "response": ["Wormwood episode 2 Journalist Gordon Thomas claims that Olson subsequently visited William Sargant, a British psychiatrist with high level security clearances. According to Thomas, Sargant reported that Olson had become a security threat and his access to military facilities should be limited."]}, {"page": "Historical Jesus", "response": ["*It has been suggested by psychiatrists Oskar Panizza, George de Loosten, William Hirsch, William Sargant, Anthony Storr, Raj Persaud, psychologist Charles Binet-Sanglé and others that Jesus had a mental disorder or psychiatric condition. based on the fact that the Gospel of Mark (Mark 3:21) reports that When his family heard this they went out to restrain him, for they said, ″He is out of his mind.″New English Translation Psychologist Władysław Witwicki states that Jesus had difficulties communicating with the outside world and suffered from multiple personality disorder, which made him a schizothymic or even schizophrenic type.Karina Jarzyńska (racjonalista.pl), \"Jezus jako egocentryczny schizotymik\" (Polish) In 1998–2000 Polish author Leszek Nowak (born 1962) from Poznań authored a study in which, based on his own history of delusions of mission and overvalued ideas, and information communicated in the Gospels, made an attempt at reconstructing Jesus’ psycheLeszek Nowak, Prywatna Witryna Internetowa Leszka Nowaka at Internet Archive (Polish) with the view of the apocalyptic prophet.Analysis of fragments of the New Testament books for Jesus as apocalyptic prophet: Leszek Nowak, \"A great mistake and disappointment of early Christianity\" at Internet Archive (Polish)"]}, {"page": "Jungle juice", "response": ["Some of the boys make their own brew, commonly known as Jungle juice. Its’ [sic] a mixture of coconut juice, paw-paw juice and a handful of raisins (that is if they ever get a parcel from home with raisins in it) and various other tropical fruit juices, too numerous to name. Let it stand for three days until even the flies shun it, then it is declared okay. And is it potent? I tried it once but never again and I thought I could drink.The term had also been applied to a specific treatment for war neurosis being practiced during the Second World War. Dr. William Sargant began to treat afflicted soldiers with large doses of a sedative called sodium amytal. The sedative would induce a deep sleep lasting up to three weeks. Patients would only be woken for an hour each day to be fed and to be bathed. The idea behind this sleep narcosis treatment was to break the cycle of exhaustion and anxiety caused by combat stress reaction. Additionally, insulin was given to patients to help restore lost weight due to inactivity. The insulin, however, could induce a coma by lowering the blood sugar. If the blood sugar level dropped too low, it could result in irreversible brain damage or even death. Soldiers began to refer to the sedative treatment as being given \"Jungle Juice\".https://www.youtube.com/watch?v=OUumA6VZh8Q Shell Shock: Battle for the Mind (6mins 40sec)"]}, {"page": "Celia Imrie", "response": ["When she was 14, she was admitted to the Royal Waterloo Hospital suffering from anorexia nervosa. Under the care of controversial psychiatrist William Sargant, she was given electroshock and large doses of the anti-psychotic drug Largactil."]}, {"page": "Donald Ewen Cameron", "response": ["Cameron had been hoping to correct schizophrenia by \"erasing\" existing memories and \"reprogramming\" the psyche. He commuted from Lake Placid, New York to Montreal every week to work at McGill's Allan Memorial Institute and was paid $69,000 from 1957 to 1964 to carry out MKUltra experiments there, known as the Montreal experiments. In addition to LSD, he experimented with various paralytic drugs such as curare and electroconvulsive therapy at thirty to forty times the normal power.\"Inside Montreal's House Of Horrors\" Montreal Gazette. January 21, 1984  His \"psychic driving\" experiments consisted of putting a subject into a drug-induced coma for weeks at a time (up to three months in one case) while playing tape loops of noise or simple statements.  These experiments were typically carried out on patients who had entered the Institute for minor problems such as anxiety disorders and postnatal depression; many suffered permanent debilitation after these treatments. Such consequences included incontinence, amnesia, forgetting how to talk, forgetting their parents, and thinking their interrogators were their parents.  His work was inspired and paralleled by the psychiatrist William Sargant, who was also involved with the intelligence services and experimented extensively on his patients without their consent, causing similar long-term damage."]}, {"page": "Psychic driving", "response": ["*William Sargant"]}, {"page": "Allan Memorial Institute", "response": ["* William Sargant"]}, {"page": "Institute of Psychiatry, Psychology and Neuroscience", "response": ["*William Sargant"]}, {"page": "Maudsley Hospital", "response": ["In the interwar period the Maudsley Hospital engaged in widespread experimentation with animal hormones, both in small doses to rectify supposed deficits and in overdoses as a shock therapy. Numerous psychoactive drugs and procedures were tried out, in what has been described as 'unconstrained experimentation'. One of those involved, as a trainee and then junior doctor, was the controversial William Sargant. The hospital's nursing staff comprised a matron, assistant matron, six sisters and 19 staff nurses with at least three years general hospital training, supported by 23 probationers and 12 male nurses. It had a good reputation for training nurses and some applicants even travelled overseas to train there. A report (held at Bethlem's Archives & Museum) from a nurse who trained at the Maudsley shows some of the work of a new trainee: \"Apart from observation and simple treatment, nurses are trained in special investigations and therapy. They carry out many of the routine psychometric tests, help as technicians in the ward laboratories, and are instructors in occupational therapy\"."]}, {"page": "Brian Inglis", "response": ["Inglis's book Revolution in Medicine (1958) is a criticism of modern medicine and its materialistic viewpoints and a defense of psychosomatic medicine and psychotherapy. William Sargant in the British Medical Journal wrote the book was a case of special pleading and some of the information that Inglis cited was misleading. Sargant wrote although Inglis had criticized medicine for its preoccupation with physical treatment and psychotherapy should not be neglected it is only the \"new empirical and mechanistic physical treatments\" that have provided effective relief for suffering of many patients.William Sargant. (1959). Physic And Metaphysic. The British Medical Journal. Vol. 2, No. 5145. 15 Aug. p. 177."]}, {"page": "Deep sleep therapy", "response": ["Deep sleep therapy was popularised in the 1920s by Swiss psychiatrist Jakob Klaesi, using a combination of two barbiturates marketed as Somnifen by the pharmaceutical company Roche.Windholz G. \"Sleep as a cure for schizophrenia: a historical episode\", History of Psychiatry 4.13, March 1993, pp. 83–93, doi 10.1177/0957154X9300401304.Shorter, Edward. A History of Psychiatry: From the Era of the Asylum to the Age of Prozac, New York: Wiley, 1997,   Most of the patients that were treated had schizophrenia.Bangen, Hans: Geschichte der medikamentösen Therapie der Schizophrenie. Berlin 1992, p. 38-42  The method became widely known and was used in some mental hospitals in the 1930s and 1940s.Sargant, William; Slater, Eliot; assisted by Kelly, Desmond. An introduction to physical methods of treatment in psychiatry (Edinburgh: Churchill Livingstone, 1972) It was adopted and promoted by some leading psychiatrists in the 1950s and 1960s, such as William Sargant in the United Kingdom and by Donald Ewen Cameron, a North American psychiatrist of Scottish origin practising in Canada, some of whose research was funded by the Central Intelligence Agency (CIA) as part of their Project MKULTRA."]}, {"page": "William Sergeant", "response": ["#redirect William Sargant "]}, {"page": "Harry Bailey", "response": ["From December 1954, he spent fifteen months on a World Health Organization fellowship in North America and Europe, where  he  observed the sedation techniques, psychosurgery and electroconvulsive therapy methods of Ewan Cameron in Canada, William Sargant in the UK and Lars Leksell in Sweden."]}, {"page": "1988 in the United Kingdom", "response": ["* 27 August – William Sargant, psychiatrist (born 1907)"]}, {"page": "Transmarginal inhibition", "response": ["Additional research on these phases was done by William Sargant in his work on shell-shocked servicemen."]}, {"page": "Man, Myth & Magic (encyclopedia)", "response": ["* William Sargant, past Physician in Charge of the Department of Psychological Medicine, St. Thomas' Hospital."]}, {"page": "List of psychiatrists", "response": ["|William Sargant "]}, {"page": "Eliot Slater", "response": ["With the outbreak of war in 1939 the Maudsley was evacuated, and Slater became clinical director of the Sutton Emergency Hospital, where he had responsibility for the treatment of some 20,000 psychiatric casualties.  This experience led to the influential book An Introduction to Physical Methods of Treatment in Psychiatry (with William Sargant, 1944).", "Slater, along with his close associate William Sargant, was an \"evangelical\" proponent of the crude brain surgery known as the lobotomy, even into the 1970s.Treatment Without Consent: Law, Psychiatry and the Treatment of Mentally Disordered People Since 1845Women and Psychiatric Modernism They long advocated for a range of other 'physical' treatments, including insulin coma therapy, even well after clinical trials cast doubt on its efficacy."]}, {"page": "1907 in the United Kingdom", "response": ["* 24 April – William Sargant, psychiatrist (died 1988)"]}, {"page": "History of psychosurgery in the United Kingdom", "response": [" In 1889 Thomas Claye Shaw reported mental improvement in a case of General Paralysis of the Insane after a neurosurgical intervention. This led to a lively debate in the British Medical Journal on the usefulness of neurosurgery for the treatment of insanity.Berrios G E (1997) The Origins of Psychosurgery: Shaw, Burckhardt and Moniz. History of Psychiatry 8: 61–81. In the 1930s the Portuguese neurologist Egas Moniz developed a surgical technique for the treatment of mental illness and called it \"leucotomy\" or \"psychosurgery\".Z Kotowicz 2005 Gottlieb Burckhardt and Egas Moniz – Two Beginnings of Psychosurgery. Gesnerus 62: 77–101. Moniz' technique was adapted and promoted by American neurologist Walter Freeman and his neurosurgeon colleague James W. Watts. They called their operation, where burr holes are drilled in the side of the skull and the white matter is sliced through in order to sever the connections between the frontal lobes and deeper structures in the brain, lobotomy. In the United Kingdom it became known as the standard Freeman-Watts prefrontal leucotomy. British psychiatrist William Sargant met Freeman on a visit to the United States and on his return to England encouraged doctors at the Burden Neurological Institute in Bristol to instigate a programme of psychosurgery.P Fennell 1996 Treatment without consent: law, psychiatry and the treatment of mentally disordered people since 1845. Routledge: 144-5.", "The first leucotomies in the UK were carried out at the Burden Neurological Institute in Bristol and were a collaboration between Frederick Golla, director of the Burden Neurological Institute, Effie Hutton, clinical director of the Burden Neurological Institute, surgeon F. Wilfred Willway, and the medical superintendents of Barnwood House in Gloucester and Brislington House in Bristol, who volunteered their patients as guinea pigs. Frederick Golla was persuaded to undertake the surgery by psychiatrist William Sargant who had seen three of Freeman's patients in the US and tried to introduce leucotomy at the Belmont Hospital in London, only to be refused permission by London County Council."]}, {"page": "Evan Hause", "response": ["Man: Biology of a Fall is a similar glimpse into unknowable events surrounding the last week of life of Frank Olson, a biochemist who is believed to have been murdered in 1953 by defenestration. The backdrop of this opera is Fort Detrick, the CIA's MK-ULTRA mind control program, Greenwich Village, and the Statler Hotel in New York City. Other characters drawn from real persons include Sidney Gottlieb, William Sargant, and George Hunter White."]}, {"page": "List of historical opera characters", "response": ["William Sargant, British psychiatrist"]}, {"page": "Elizabeth Tylden", "response": ["According to The Daily Telegraph, she first became interested in mental trauma when she worked as a registrar in London during the Second World War under the psychiatrist William Sargant. She worked with soldiers who were suffering from what was then known as \"battle exhaustion,\" and people affected by The Blitz, the bombing of British cities by the German airforce. From the 1980s onwards, she worked with former members of cults, including the Children of God and the International Church of Christ. She was often called as an expert witnesses in cases involving cults, and their exercise of what lawyers call \"undue influence\" over the membership using mind-control techniques. Some of these techniques sought to exercise what Tylden called totalitarian control over the members, leading to mental illness which sometimes involved delusions and hallucinations that led to a diagnosis of schizophrenia. Tylden argued that these patients were not psychotic, but were engaged in normal \"survival reactions\" to trauma. Psychologists now call such a response complex post-traumatic stress disorder (C-PTSD). Tylden argued that psychoanalysis and conventional psychotherapy, which seek causes in childhood, were inappropriate as treatment in such cases, and that relaxation therapy or hypnotic regression might return the patients to the mental state they were in the cult, with its group singing, meditation, or other \"group thought-reform patterns of behaviour,\" as the Telegraph puts it.Betty Tylden, The Daily Telegraph, 25 February 2009."]}, {"page": "Sargant", "response": ["*William Sargant (1907–1988), British psychiatrist"]}]}}