{"wiki_id": "http://www.wikidata.org/entity/Q8012559", "itemLabel": "William Howard, 8th Earl of Wicklow", "itemDescription": "Irish Earl", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Howard,_8th_Earl_of_Wicklow", "wikipedia_page": {"main": "William Cecil James Philip John Paul Howard, 8th Earl of Wicklow (30 October 1902 – 8 February 1978), styled Lord Clonmore until 1946, was an Anglo-Irish peer.\nHe was the only child of Ralph Howard, 7th Earl of Wicklow and the Countess of Wicklow, formerly Lady Gladys Mary Hamilton. His maternal grandparents were the 2nd Duke of Abercorn and Lady Mary Anna Curzon-Howe.\nHe was known as Lord Clonmore until succeeding to the Earldom in 1946.\nHe was first educated at Wixenford, from where he passed the examination to enter the Royal Naval College, Osborne, in May 1916. However, in the event he proceeded to Eton College, and in 1921 he matriculated at Merton College, Oxford. He was then ordained a deacon and priest of the Church of England. Among his Oxford associates were Glyn Simon, Evelyn Waugh, and John Betjeman. He was part of the Hypocrites' Club. He worked for the Magdalen Mission at St Mary's Church in Somers Town. Having been a zealous Anglo-Catholic, he converted to Roman Catholicism in 1932, and thereafter lived as a layman. He was disinherited by his father and banished from the family seat in Ireland on Sundays because he was thought to be an embarrassment on account of his attending Mass with the servants, who were also Roman Catholics. During the Second World War he was commissioned into the Royal Fusiliers and rose to the rank of Captain.\nIn 1946 he succeeded his father as Earl of Wicklow. In the 1950s he wrote on religious subjects and was also active as a translator. On 2 September 1959 he married Eleanor Butler, an architect who had been a member of the Seanad Éireann between 1948 and 1951. They had no children. When he died in 1978 the titles passed to his first cousin, Cecil Aylmar Howard, the ninth earl. When the ninth earl died in 1983, the titles became extinct..", "link_mentions": [{"page": "Catholic unionist", "response": ["*William Howard, 8th Earl of Wicklow"]}, {"page": "William Howard", "response": ["* William Howard, 8th Earl of Wicklow (1902–1978), British nobleman"]}, {"page": "William Cecil James Philip John Paul Howard, 8th Earl of Wicklow", "response": ["#REDIRECT William Howard, 8th Earl of Wicklow"]}, {"page": "List of University of Oxford people in British public life", "response": ["| William Howard, 8th Earl of Wicklow"]}, {"page": "Eleanor Butler, Lady Wicklow", "response": ["She became a Labour member of Dublin Corporation, and was chosen by the party in 1945 to visit Britain to investigate modern British housing. She ran as a labour candidate for the Dáil in 1948, before she was nominated by the Taoiseach to Seanad Éireann in April 1948, where she served until 1951.  On 2 September 1959 she married William Howard, 8th Earl of Wicklow, cementing a thirteen year long courtship."]}, {"page": "Shelton Abbey Prison", "response": ["Shelton Abbey was the ancestral seat of the Earls of Wicklow until 1951 when financial difficulties forced William Howard, 8th Earl of Wicklow to sell the estate to the Irish State. "]}, {"page": "Wixenford School", "response": ["*William Howard, 8th Earl of Wicklow (1902–1978), clergyman, writer and translator'Osborne Passing-In List' in The Times, issue 41129 dated 31 March 1916, p. 5"]}, {"page": "Mark Ogilvie-Grant", "response": ["He attended Eton College where he met his long-lasting friends Brian Howard and Robert Byron.M.J. Lancaster, Brian Howard, Portrait of a Failure, 1968, p. 212 With them he was an early member of the Bright Young Things. He then moved to Trinity College, Oxford, where he was part of a group including Harold Acton, Robert Byron, Henry Vincent Yorke, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Brian Howard, John Sutro, Hugh Lygon, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross. At Oxford Ogilvie-Grant was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, and John Drury-Lowe. Together with Harold Acton, William Howard, 8th Earl of Wicklow, Hugh Lygon, and Robert Byron, Ogilvie-Grant was part of the \"Oxford Set\" that attended the Hypocrites' Club. He was a member of the \"Georgeoisie\" with Alan Pryce-Jones, a group of students who dined every night at the George restaurant. He graduated in 1929 with a Bachelor of Arts (B.A.)"]}, {"page": "Hypocrites' Club", "response": ["William Lygon, 8th Earl Beauchamp was the president of the club and Waugh was the secretary. Members included: Hugh Lygon; William Howard, 8th Earl of Wicklow; Anthony Powell; Graham Pollard; Harold Acton; Robert Byron; Alfred Duggan; Mark Ogilvie-Grant; Arden Hilliard; Gavin Henderson, 2nd Baron Faringdon; David Plunket Greene; Terence Lucy Greenidge; Raoul Loveday; Alastair Hugh Graham; E. E. Evans-Pritchard; Roger Hollis; Claud Cockburn; Anthony Bushell; Brian Howard; Tom Driberg; Christopher Hollis; H. D. Ziman.", "The club's mischief began to be noticed by the Oxford authorities when William Howard, 8th Earl of Wicklow, gave a supper party on the roof of a church. In March 1924, Robert Byron and Harold Acton were forbidden by the university authorities to enact an 1840 Exhibition event. The Victorian fancy dress party was hosted at the club as a protest. The club was finally closed down in May 1925 by the dean of Balliol College, Oxford, \"Sligger\" Urquhart after a party where members dressed as nuns and choirboys and painted their lips vermillion. It's interesting to notice that another source states that Robert Byron and The Widow Lloyd gave a Victorian party where men dressed in feminine apparel and Arden Hilliard masqueraded as a nun. That night Hilliard went through the gate of Balliol in his nun costume. Hilliard was promptly dismissed by Balliol. Translation: For example, another of my friends, Arden Hilliard, made a provocatorial act crossing the imposing portal of Balliol disguised as a nun to go to the costume ball of the club of Hypocrites. He was promptly dismissed.", "File:William Cecil James Philip John Paul Howard Clonmore, 8th Earl of Wicklow.jpg|William Howard, 8th Earl of Wicklow"]}]}}