{"wiki_id": "http://www.wikidata.org/entity/Q8013522", "itemLabel": "William Jay Bolton", "itemDescription": "American designer of stained glass", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Jay_Bolton", "wikipedia_page": {"main": "William Jay Bolton (31 August 1816 – 28 May 1884) was the first artist in the United States to design and manufacture figural stained glass windows.", "link_mentions": [{"page": "Briarcliff Manor, New York", "response": ["Saint Mary's Episcopal Church, founded in 1839 by William Creighton as Saint Mary's Church, Beechwood, is Briarcliff Manor's oldest church; it was reincorporated in 1945 as Saint Mary's Church of Scarborough. The granite church was built by local stonemasons and paid for by Creighton's wealthy neighbors, including Commodore Matthew Perry, James Watson Webb, William Aspinwall, and Ambrose Kingsland. The church is in near-original condition, with a design based on the 14th-century Gothic St. Mary's parish church in Scarborough, England and the only church with a complete set of William Jay Bolton stained-glass windows. The church, built in 1851, is a contributing property to the National Register-listed Scarborough Historic District. The  Sleepy Hollow Country Club surrounds the church grounds on three sides. Notable parishioners included Commodore Matthew C. Perry and Washington Irving. Irving, author of \"Rip Van Winkle\" and \"The Legend of Sleepy Hollow\", brought the ivy surrounding the church from Abbotsford (home of Walter Scott). On July 5, 2015, Saint Mary's Episcopal Church closed after 175 years in operation; the Church of South India's Congregation of the Hudson Valley moved in that November."]}, {"page": "Chelsea, Manhattan", "response": ["The Church of the Holy ApostlesChurch of the Holy Apostles website was built in 1845–1848 to a design by Minard Lefever, with additions by Lefever in 1853–1854, and transepts by Charles Babcock added in 1858, this Italianate church was designated a New York City landmark in 1966 and is listed on the National Register of Historic Places. It is Lefever's only surviving building in Manhattan.  The building, which featured an octagonal spire,\"Church of the Holy Apostle\" on New York Architecture was burned in a serious fire in 1990, but stained glass windows by William Jay Bolton survived, and the church reopened in April 1994 after a major restoration. The Episcopal parish is notable for hosting the city's largest program to feed the poor, and is the second and larger home of the LGBT-oriented synagogue, Congregation Beth Simchat Torah.\"Congregation Beth Simchat Torah\" on LGBT Religious Archives Network"]}, {"page": "Adoration of the Magi", "response": ["The usefulness of the subject to the Church and the technical challenges involved in representing it have made the Adoration of the Magi a favorite subject of Christian art: chiefly painting, but also sculpture and even music (as in Gian-Carlo Menotti's opera Amahl and the Night Visitors).  The subject matter is also found in stained glass.  The first figural stained glass window made in the United States is the \"Adoration of the Magi\" window located at Christ Church, Pelham, New York and designed in 1843 by the founder and first rector's son, William Jay Bolton."]}, {"page": "John Bolton (disambiguation)", "response": ["*John Bolton, brother and co-worker of William Jay Bolton (1816–1884), American glassworker"]}, {"page": "National Academy of Design", "response": ["* William Jay Bolton"]}, {"page": "William Jay (minister)", "response": ["William Jay's eldest daughter, Anne, married Robert Bolton and, among their thirteen children was William Jay Bolton, who became an early artisan of stained glass in America."]}, {"page": "William Bolton", "response": ["*William Jay Bolton (1816–1884), American designer of stained glass "]}, {"page": "St. Ann & the Holy Trinity Church", "response": ["The building was built as Church of the Holy Trinity, and opened in 1847.  Following years of controversy, the parish was closed in 1957, and the building stood mostly empty for the next 12 years.  The present name of the parish reflects the fact that St. Ann's, the oldest Episcopal parish in Brooklyn, moved into the then empty Holy Trinity building in 1969. The church possesses some of the earliest figural stained-glass windows made in the United States, crafted by William Jay Bolton. The church was declared a National Historic Landmark in 1987.", "The designer for Holy Trinity was prominent 19th century American architect Minard Lafever, with stained glass by William Jay Bolton and John Bolton. In 1859 English architect Gervase Wheeler was hired to enlarge and make improvements in the chancel such as modifications to the reading desk and adding pews; Wheeler was directed to follow the original plan in his work.Tribert, Elizabeth Rose. \"Gervase Wheeler: Mid-Nineteenth Century British Architect in America\" (thesis) Graduate Program of Historic Preservation, University of Pennsylvania, 1988; pg 114", "The windows of St. Ann & the Holy Trinity Church were created by William Jay Bolton with the assistance of his brother, John Bolton, between 1845 and 1848. Though preceded by a figural window Bolton made for Christ Church Priory in Pelham, NY, these windows are the first complete canon, or set, of figural stained glass windows made in North America. The Bolton windows consist of six distinct sets totaling 55 glass installations, of which 54 remain."]}, {"page": "St. Ann's Warehouse", "response": ["The original home of Arts at St. Ann's (now St. Ann's Warehouse) was the National Historic Landmark Church of St. Ann and the Holy Trinity on Montague Street in Brooklyn Heights. For 21 years, St. Ann's presented a broad array of concert and theater performances in the church's Gothic Revival sanctuary. In addition, the organization raised approximately $4 million for the building's restoration, including its historic stained glass windows by William Jay Bolton, which were the first made in America."]}, {"page": "Church of the Holy Apostles (Manhattan)", "response": ["The Church of the Holy Apostles is an Episcopal parish located at 296 Ninth Avenue at 28th Street in the Chelsea neighborhood of Manhattan, New York City. Its historic church building  was built from 1845 to 1848,, p.72 and was designed by the noted New York architect Minard Lafever.The tower is Plate 7 in Lafever's book, Complete Architectural Instructor.  The geometric stained-glass windows were designed by William Jay Bolton. The church faces Chelsea Park across 9th Avenue. "]}, {"page": "Church of the Holy Innocents (Albany, New York)", "response": ["A small garden surrounding the church and chapel gives it the feel of an English country parish church despite its urban surroundings. Its interior has several stained glass windows designed by John Bolton, brother of William Jay Bolton. A century after its construction the Episcopal congregation moved to a newer church and sold it to a Russian Orthodox church, which renamed it and added an onion dome. They have subsequently moved out and the building remains vacant."]}, {"page": "Scarborough Historic District", "response": ["The granite church was built in 1850 by local stonemasons and paid for primarily by Creighton and Meade, but also by Creighton's wealthy neighbors, including US Navy Commodore Matthew C. Perry, James Watson Webb, William Aspinwall, and Ambrose Kingsland. The first services there were held on September 21, 1851. The church is in near-original condition, with a design based on the 14th-century Gothic St. Mary's parish church in Scarborough, England and is the only church with a complete set of John Bolton (brother of William Jay Bolton) stained-glass windows."]}, {"page": "Stratford Martyrs Memorial", "response": ["The monument was paid for by public subscription; the chairman of the appeal committee was Rev. William Jay Bolton, the Vicar of Stratford. It was inaugurated in a ceremony on 2 August 1879, presided over by the Earl of Shaftesbury, who made a strongly anti-Catholic speech. The opinion of The Graphic, a national weekly newspaper, was that \"Language of this sort is better calculated to wound the feelings of many good people than to break down barriers that already too effectually divide the different denominations.\"The Graphic: August 9, 1879 (p.139) – MARTYRS' MEMORIAL"]}]}}