{"wiki_id": "http://www.wikidata.org/entity/Q8019340", "itemLabel": "William Thomas Rickard", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Rickard", "wikipedia_page": {"main": "William Thomas Rickard,  (10 February 1828 – 21 February 1905) was a British sailor and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "link_mentions": [{"page": "List of English Victoria Cross recipients", "response": ["|William Thomas Rickard || Royal Navy || 1855 || Crimean War || Sea of Azov"]}, {"page": "John Edmund Commerell", "response": ["Admiral of the Fleet Sir John Edmund Commerell,  (13 January 1829 – 21 May 1901) was a Royal Navy officer. As a junior officer, he was present at the Battle of Vuelta de Obligado in November 1845 during the Uruguayan Civil War. He also took part in operations in Sea of Azov during the Crimean War and went ashore with the quartermaster and a seaman, to destroy large quantities of enemy forage on the shore. After a difficult and dangerous journey they reached their objective – a magazine of corn – and managed to ignite the stacks, but the guards were alerted and immediately opened fire and gave chase. The men had difficulty in escaping, but they finally reached their ship and the lookouts later reported that the forage store had burned to the ground. He and his colleague, Quartermaster William Thomas Rickard, were awarded the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "Commerell joined the frigate HMS Vulture in February 1854 and saw action in the Baltic Sea during the Crimean War. He became commanding officer of the gun vessel HMS Weser in February 1855; however the ship caught fire near Constantinople and was beached before being towed off and joining the bombardment of Sevastopol in June 1855. He then took part in operations in Sea of Azov and, having been promoted to commander on 29 September 1855, went ashore with the quartermaster and a seaman, to destroy large quantities of enemy forage on the shore. After a difficult and dangerous journey they reached their objective – a magazine of corn – and managed to ignite the stacks, but the guards were alerted and immediately opened fire and gave chase. The men had difficulty in escaping, but they finally reached their ship and the lookouts later reported that the forage store had burned to the ground. He and his colleague, Quartermaster William Thomas Rickard, were awarded the Victoria Cross. His citation reads:"]}, {"page": "List of Légion d'honneur recipients by name (R)", "response": ["| William Thomas Rickard"]}, {"page": "William T. Rickard", "response": ["#REDIRECT William Thomas Rickard"]}, {"page": "William Rickard", "response": ["#REDIRECT William Thomas Rickard"]}, {"page": "Rickard", "response": ["*William Thomas Rickard, (1828–1905), English recipient of the Victoria Cross"]}, {"page": "SMS Nix", "response": ["The Royal Navy renamed the ship Weser and sent her to the Devonport shipyard for an overhaul, after which she was sent to the Mediterranean Sea in March. Her commander at that time was John Edmund Commerell; while operating in the Black Sea, Weser once again caught fire while steaming off Constantinople and Commerell ran the ship aground. After the fire was suppressed, the ship was towed off and later joined the siege of Sevastopol in June. Weser later entered the Sea of Azov and on 11 October, Commerell, William Thomas Rickard (the ship's quartermaster), and a seaman went ashore to burn Russian stores. Commerell and Rickard were both awarded the Victoria Cross for their actions. She joined the fleet that attacked Kinburn on 17 October that resulted in the Battle of Kinburn. After the war, Weser was stationed in Malta, and in early 1859, she returned to Britain for a major overhaul at the Woolwich Arsenal, carried out between 1 May 1859 and May 1861. She thereafter returned to the Mediterranean before being decommissioned at Malta in 1865. She was employed there as a harbor ship until 1873, when she was sold for scrap on 29 October and subsequently broken up."]}, {"page": "Nix-class aviso", "response": ["Nix and Salamander were renamed Weser and Recruit, respectively, and both were sent to the Mediterranean Sea after a brief refit. Weser saw action against Russian forces during the Crimean War later that year; on 11 October, John Edmund Commerell and William Thomas Rickard—her commander and quartermaster—staged a raid in the Sea of Azov that earned them the Victoria Cross. The ship took part in the Battle of Kinburn on 17 October. Neither ship saw significant activity with the British fleet afterward, with both being kept idle at Valletta, Malta, for the next several years. Weser was refitted in 1859–1861, but saw no significant service before being decommissioned in 1865 and then sold to ship breakers in 1873. Recruit, meanwhile, was laid up in 1861. The ship was sold for merchant service in 1870 and by 1878 was a powder magazine at Cape Town."]}]}}