{"wiki_id": "http://www.wikidata.org/entity/Q8016742", "itemLabel": "William Penfro Rowlands", "itemDescription": "Welsh school teacher and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Penfro_Rowlands", "wikipedia_page": {"main": "William \"Penfro\" Rowlands (19 April 1860 – 22 October 1937) was a Welsh schoolteacher and composer.Rowlands was born at Llys y Frân, Maenclochog, Pembrokeshire (Sir Benfro in the Welsh language, hence his middle name).  Probably his best-known composition is the hymn-tune \"Blaenwern\", composed in 1905 and often used as the setting for Love Divine, All Loves Excelling. As well as being a church musician, Rowlands taught in several schools and was conductor of the Morriston United Choral Society.He died in Swansea and is buried in Morriston Cemetery, Swansea, plot B11. A memorial stone to the composer was unveiled in March 1998, close to his birthplace.", "link_mentions": [{"page": "1915 in music", "response": ["*William Penfro Rowlands's hymn tune \"Blaenwern\" is first published in Henry H. Jones' Cân a Moliant."]}, {"page": "Love Divine, All Loves Excelling", "response": ["\"Blaenwern\" by William Penfro Rowlands (1860–1937);Grace Hymns (London : Grace Publications Trust, 1977); Hymns and Psalms (London: Methodist Publishing House, 1983); Songs of Fellowship, vol. 1 (Eastbourne : Kingsway, 1991); Peter Horrobin and Greg Leaver, ed., Complete Mission Praise (London : Marshall Pickering, 1999). and \"Moriah\"The English Hymnal (London: Oxford University Press, 1906?; rev. ed. 1933); Percy Dearmer, ed.,  Songs of Praise, enlarged ed. (London : Oxford University Press, 1931).—the latter two especially in Great Britain."]}, {"page": "Blaenwern", "response": ["Blaenwern is a Welsh Christian hymn tune composed by William Penfro Rowlands (1860–1937), during the Welsh revival of 1904–1905. It was first published in Henry H. Jones' Cân a Moliant (1915)."]}, {"page": "1937 in Wales", "response": ["*22 October – William Penfro Rowlands, hymn-writer, 77"]}, {"page": "Rowlands", "response": ["* William Penfro Rowlands, composer of the hymn tune Blaenwern"]}, {"page": "1915 in Wales", "response": ["*William Penfro Rowlands - \"Blaenwern\" (hymn tune),  in Henry H. Jones' Cân a Moliant"]}, {"page": "1905 in Wales", "response": ["*William Penfro Rowlands – \"Blaenwern\" (hymn tune)"]}, {"page": "1860 in Wales", "response": ["*19 April – William Penfro Rowlands, composer (died 1937)"]}, {"page": "Wedding of Prince William and Catherine Middleton", "response": ["* \"Love Divine, All Loves Excelling\". The words were written by Charles Wesley and its tune – Blaenwern – was composed by William Penfro Rowlands, during the 1904–1905 Welsh Revival. This hymn was sung at the Prince of Wales's 2005 marriage to the Duchess of Cornwall. "]}, {"page": "2011 in Wales", "response": ["* 29 April – The wedding of Prince William of Wales to Kate Middleton is conducted by Dr Rowan Williams. Welsh guests include Richard Meade and Martyn Williams; First Minister Carwyn Jones and the Assembly's Presiding Officer Dafydd Elis-Thomas are also present. The music played at the service includes Ubi Caritas et Amor, a choral arrangement specially commissioned for the occasion by the Welsh composer Paul Mealor, and the hymn \"Love Divine, All Loves Excelling, sung to the tune \"Blaenwern\" by William Penfro Rowlands."]}, {"page": "Llys y Fran", "response": ["The teacher and composer William Penfro Rowlands (1860-1937) was born at Llys y Fran."]}, {"page": "Tufton, Pembrokeshire", "response": ["The hymn tune Blaenwern is named after a farm near Tufton where the composer, William Penfro Rowlands, was either sent as a boy, or sent his son, to recuperate from an illness in the early 20th century."]}, {"page": "1915 in British music", "response": ["**William Penfro Rowlands's hymn tune \"Blaenwern\" is first published in Henry H. Jones' Cân a Moliant."]}, {"page": "William Rowlands", "response": ["* William Penfro Rowlands (1860–1937), Welsh schoolteacher and composer"]}]}}