{"wiki_id": "http://www.wikidata.org/entity/Q8017497", "itemLabel": "William Reynolds", "itemDescription": "Scottish recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Reynolds_(VC)", "wikipedia_page": {"main": "William Reynolds VC (1827 – 20 October 1869) was a Scottish recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces. Reynolds was the first private to receive the award.", "link_mentions": [{"page": "History of the Scots Guards (1805–1913)", "response": ["A British unit, known as the Light Division, made its advance, making steady progress on the Great Redoubt, and took it with very heavy casualties; however chaos soon set in, after a confusing order from an unknown officer during a Russian counter-attack was soon contradicted by other officers, and the British duly fell back. The Scots Fusilier Guards, in the center of the Guards Brigade, part of the 1st Division, were supporting the Light Division, though had only just crossed the River Alma by the time the Great Redoubt was taken. One brave group of Royal Welch Fusiliers had held their ground and were firing into the Russians until confronted by a mass of Russian soldiers, forcing them to retreat rapidly, and in the process, smashed straight into the formation of the advancing Scots Fusiliers Guards, causing immense chaos. The Russians seized their opportunity to strike, launching a large-scale bayonet charge on the regiment, resulting in brutal carnage, eventually forcing the regiment to reluctantly withdraw, suffering over 150 casualties. During this chaos, the Colour party of the regiment, whose Colours had been shot through, held its ground against the overwhelming Russian force, and safeguarded the Colours from the Russians, as well as helping to rally the regiment. The Russians attempted to exploit the chaos when a large Russian force advanced on the Brigade of Guards, but the Guards poured a withering and accurate fire into the Russians, causing very heavy casualties. The British, including men of the battered Scots Fusilier Guards, subsequently advancing, causing the Russians to flee which allowed the British to re-take the Great Redoubt. Further heroics occurred on the right, with the Highland Brigade, just two lines deep, firing, while advancing, on the Russians who soon fled from the spirited Highland Brigade. The Battle had been bloody, with the British losing more than 2,000 casualties while the Russians suffered 6,000. For their actions at Alma, the Scots Fusilier Guards won a battle honour and four men of the regiment would later win the Victoria Cross, an award created in 1856 to become the highest award for valour in the face of the enemy. These men were Captain Robert James Lindsay, Sergeants John Knox and James McKechnie, as well as Private William Reynolds."]}, {"page": "List of Scottish Victoria Cross recipients", "response": ["*William Reynolds (VC) – 1854; Battle of the Alma, Crimea"]}, {"page": "William Reynolds", "response": ["Billy, Bill, Will or William Reynolds may refer to:", "*William Reynolds (film editor) (1910–1997), American winner of two Academy Awards", "*William Reynolds (actor) (born 1931), American film and TV second lead", "*William Reynolds (industrialist) (1758–1803), English ironmaster, built Ketley Canal", "*William Reynolds (naval officer) (1815–1879), Union Navy admiral in American Civil War", "*William Reynolds (VC) (1827–1869), Scottish private who received Victoria Cross", "*William Reynolds (New Zealand politician) (1822–1899), New Zealand politician and businessman", "*William Reynolds (theologian) (1544–1594), English Catholic biblical translator and scholar a/k/a Reginaldus", "*William Reynolds (footballer, born 1870) (1870–after 1893), English left back", "*William Reynolds (footballer, born 1879) (1879–1973), English forward"]}, {"page": "List of people buried in Brookwood Cemetery", "response": ["*William Reynolds (VC)"]}]}}