{"wiki_id": "http://www.wikidata.org/entity/Q8019303", "itemLabel": "William Thomas Charley", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Charley", "wikipedia_page": {"main": "Sir William Thomas Charley (5 March 1833 – 8 July 1904) was a British judge and Conservative Party politician.", "link_mentions": [{"page": "Salford (UK Parliament constituency)", "response": ["|rowspan=\"2\"| William Thomas Charley"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| William Thomas Charley"]}, {"page": "Common Serjeant of London", "response": ["* Sir William Thomas Charley (1878–1892)", "Image:W T Charley.jpg|William Thomas Charley, Common Serjeant of London in 1878"]}, {"page": "Independent Age", "response": ["The charity began when six people set up a voluntary society, The United Kingdom Beneficent Association (UKBA), to aid the newly poor in 1863. Their goal was to prevent destitution by providing those in poverty with a small, regular income for life. Applicants were required to be over 40, living on less than £25 a year and from the 'upper and middle classes' (who were thought to have been 'sadly overlooked in the desire... to better the condition of the lower orders'). These original founders were Sir William Thomas Charley and his brother-in-law, Captain William Mackenzie, Captain James Story, Reverend William Cardall, Reverend Walter Howse, and Reverend William Windle."]}, {"page": "List of MPs elected in the 1868 United Kingdom general election", "response": ["| William Thomas Charley"]}, {"page": "List of UK Parliamentary election petitions", "response": ["| 1868 || Salford || Roderick Anderson; Jesse Bryant; and Edward Charlton Harding || Charles Edward Cawley and William Thomas Charley || Bribery, etc.; hiring cabs to convey voters to the poll || Duly elected || The cabs were to convey canvassers to workplaces. The respondents hired a gang of roughs after hearing rumours about Irish interference, which the Judges criticised. 2s. 6d. of bribery by an agent was proved in isolated acts, but this did not upset the election. || 1 O'M & H 133; HCP 1869 120 p. 138-144"]}, {"page": "G. Phillips Bevan", "response": ["|Wool, and its Applications by Thomas Croxen ArcherFlax and Linen by William Thomas CharleyCotton by Isaac WattsSilk by B. F. Cobb"]}, {"page": "1883 Ipswich by-election", "response": ["The 1883 by-election for Ipswich was held when the sitting Conservative MP Thomas Clement Cobbold died.  It was won by the Liberal candidate Henry Wyndham West.  The unsuccessful conservative candidate was William Thomas Charley."]}, {"page": "Charley (name)", "response": ["*William Thomas Charley (1833 – 1904), British judge and politician"]}]}}