{"wiki_id": "http://www.wikidata.org/entity/Q8019951", "itemLabel": "William Walmsley", "itemDescription": "British automobile designer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Walmsley", "wikipedia_page": {"main": "William Walmsley (1892-1961) was with William Lyons a co-founder of the Swallow Sidecar Company, which later became the Jaguar car company.", "link_mentions": [{"page": "Jaguar Cars", "response": ["The Swallow Sidecar Company was founded in 1922 by two motorcycle enthusiasts, William Lyons and William Walmsley. In 1934 Walmsley elected to sell-out and in order to buy the Swallow business (but not the company which was liquidated) Lyons formed S.S. Cars Limited, finding new capital by issuing shares to the public."]}, {"page": "William Lyons", "response": ["Sir William Lyons\"Sir William Lyons - The Official Biography\" by Philip Porter & Paul Skilleter, Haynes Publishing  (4 September 1901 – 8 February 1985), known as \"Mr. Jaguar\", was with fellow motorcycle enthusiast William Walmsley, the co-founder in 1922 of the Swallow Sidecar Company, which became Jaguar Cars Limited after the Second World War.", "In 1921, Lyons met William Walmsley who was converting army-surplus motorcycles for civilian use and making sidecars. Lyons admired the sidecars and bought one. Lyons and Walmsley obtained from their fathers a substantial £500 bank guarantee to go into business.  Their plans were delayed as Lyons was under the legal age, but on his 21st birthday he formed a partnership with Walmsley. It was called Swallow Sidecars and had a staff of \"three men and a boy\".  The company manufactured stylish sidecars, but after 1927 made increasing numbers of low cost coach-built cars, especially the Austin Seven Swallow which the Blackpool factory produced at the rate of 12 per week.  Following several moves to larger premises in Blackpool, in 1928 Lyons moved the company (and his family) to Coventry. His family home was Woodside, Gibbet Hill, on the fringe of the city. Production increased to 50 cars each week. In 1931, they began selling the SS1, and in 1933 the company name was changed to SS Cars Ltd. The following year, William Walmsley left the company."]}, {"page": "Swallow Sidecar Company", "response": ["The business was founded by two friends, William Walmsley (aged 30) and William Lyons (aged 20).At that time, as a minor until he was 21 (later 18), Lyons was unable to enter a proper binding business contract without specific court approval under a law for the protection of young people. Their partnership became official on Lyons's 21st birthday, 4 September 1922. Both families lived on the same street in Blackpool, England. Walmsley had previously been making sidecars and bolting them onto reconditioned motorcycles. Lyons had served his apprenticeship at Crossley Motors in Manchester before moving to a Blackpool Sunbeam dealer, Brown & Mallalieu, as a junior salesman.", "The success of the new range brought about a number of changes. William Walmsley wished to leave this business and it was decided to replace Walmsley's capital by bringing new outside shareholders into a brand-new incorporation, S. S. Cars Limited. The new company technically commenced business on 1 February 1934 following its incorporation 26 October 1933. Subsequently, S. S. Cars Limited bought the shares of Swallow Coachbuilding Limited as of 31 July 1934 and Swallow was liquidated (wound up) before S. S. issued shares to the public in January 1935."]}, {"page": "SS Cars", "response": ["By then its business, founded in 1922, was run by and largely owned by William Lyons. Lyons had been partner with 1922 co-founder William Walmsley until Walmsley sold his shareholding in January 1935.", "The Swallow Sidecar Company, trading name for the company Walmsley & Lyons co-founded by William Lyons and William Walmsley, progressively developed into a coachbuilder from its 1922 start, first making stylish sidecars for motorcycles. In May 1927, Swallow advertised that it would make 2-seater bodies on Austin and Morris chassis and running gear supplied through any authorised dealer. Their first full page advertisement appeared in the Autocar magazine in October 1927 to fit with the Olympia Motor Show. The next year Swallow relocated to the heart of the British motor industry. In the winter of 1928-1929 they moved bit by bit from Cocker Street Blackpool to a disused munitions factory on a rutted track, the future Swallow Road, off Holbrook Lane, Foleshill, Coventry. They returned to Blackpool each year for the Works Day Out."]}, {"page": "Walmsley, William", "response": ["#redirectWilliam Walmsley"]}]}}