{"wiki_id": "http://www.wikidata.org/entity/Q8018133", "itemLabel": "William Saunders", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Saunders_(photographer)", "wikipedia_page": {"main": "William Thomas Saunders (1832–1892) was a British-born photographer who settled in China and became the leading photographer in Shanghai during the late Qing dynasty. He was the first photographer known to produce hand-coloured photographs in China.", "link_mentions": [{"page": "List of photographers", "response": ["* William Saunders (1832–1892)"]}, {"page": "Photography in China", "response": ["* William Saunders (photographer)"]}, {"page": "Saunders", "response": ["**Thomas William Saunders (1814–1890), British metropolitan police magistrate", "* William Saunders (disambiguation): ", "** William Saunders (botanist) (1822–1900), American botanist and architect", "** William Saunders (builder) (1767–1861), American architect", "** William Saunders (died 1570), MP for Gatton and Surrey", "** William Saunders (footballer) (fl. 1900), football goalkeeper for Burslem Port Vale", "** William Saunders (Liberal politician) (1823–1895), British newspaper publisher", "^* William Saunders (photographer) (1832–1892), British photographer", "** William Saunders (physician) (1743–1817), Scottish physician", "** William Saunders (poet) (1806–1851), Welsh poet writing in Welsh", "** William Saunders (scientist) (1836–1914), Canadian pharmacist, entomologist, and plant breeder"]}, {"page": "The Far East (periodical)", "response": ["The in-house photographer for The Far East was the Austrian, Michael Moser, but Black, an amateur photographer himself, supplemented Moser's images with his own.Moser worked for the newspaper until 1873. Bennett, PiJ, 147. Significant photographers whose work also appeared in the newspaper included Uchida Kuichi, the elder Suzuki Shin'ichi,Bennett, OJP, 93. and William Saunders.Bennett, OJP, 95."]}, {"page": "J. R. Black", "response": ["The Far East provided articles on the history, arts, and manners and customs of Japan and was remarkable in that it was illustrated with pasted-in, original photographs, at a time when photomechanical reproduction was still in its infancy. The newspaper's in-house photographer was the Austrian, Michael Moser, but Black, an amateur photographer himself, supplemented Moser's images with his own.Moser worked for the newspaper until 1873. Bennett, PiJ, 147. Significant photographers whose work also appeared in the newspaper included Uchida Kuichi, the elder Suzuki Shin'ichi,Bennett, OJP, 93. and William Saunders.Bennett, OJP, 95. Black noted some of the early difficulties of publishing The Far East: the deleterious effects of the local weather on photographs, the inferiority and rarity of proper photographic chemicals and paper, and the poor quality (in his eyes) of the images produced by Japanese photographers. Until 1873, Black was unable or unwilling to pay the going rate for photographs, which must have particularly discouraged Western photographers from contributing. However, from 1873 on he began to pay an \"honorarium\" for the photographs he published.Bennett, PiJ, 147–148. From July 1874, The Far East was published in Shanghai. Accordingly, the photographic subjects appearing in the newspaper were now predominantly Chinese.Bennett, OJP, 94. There is no evidence of further publication of The Far East after December 1878.Bennett, PiJ, 149."]}, {"page": "William Saunders", "response": ["* William Saunders (physician) (1743–1817), Scottish physician, first president of Royal Medical and Chirurgical Society", "* William Saunders (botanist) (1822–1900), American botanist and architect", "* William Saunders (scientist) (1836–1914), Canadian pharmacist, entomologist, and plant breeder", "* William Saunders (footballer) (fl. 1900), football goalkeeper for Burslem Port Vale", "* William Saunders (died 1570), MP for Gatton and Surrey", "* William Saunders (builder) (1767–1861), American architect", "* William Saunders (poet) (1806–1851), Welsh poet writing in Welsh", "* William Saunders (Liberal politician) (1823–1895), British newspaper publisher and Liberal Party politician", "* William Saunders (photographer) (1832–1892), British photographer"]}, {"page": "Stephan Loewentheil", "response": ["The collection, numbering more than 21,000 photographs, includes work from both international and Chinese photographers, among them Italian-born Felice Beato; British expatriates Thomas Child and William Saunders; Scottish traveling photographer John Thomson; and native Chinese photographers Pun Lun, Lai Afong and Tung Hing, among many others."]}, {"page": "Thomas Child (photographer)", "response": ["Child's original albumen print photographs are scarce, and rarely come up for sale. A group of 31 of Child's original albumen prints, from the collection of scholar Colin Osman, were auctioned at Sotheby's in 2006, one of the first notable contemporary auction results for Child. Child's albumen prints have also been discovered in albums alongside the work of other Chinese and international photographers of the region such as Lai Afong, Felice Beato and William Saunders. Child's photographs are held in the permanent collections of museums such as the Metropolitan Museum of Art in New York, NY; the George Eastman Museum in Rochester, NY; the Peabody Essex Museum in Salem, Mass.; and the Getty Museum in Los Angeles, CA."]}]}}