{"wiki_id": "http://www.wikidata.org/entity/Q8021848", "itemLabel": "Willie Thornton", "itemDescription": "Scottish footballer (1920-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Thornton", "wikipedia_page": {"main": "William Thornton MM (3 March 1920 – 26 August 1991) was a Scottish footballer and manager. Thornton's entire senior playing career was spent with Rangers, and Thornton is considered to be one of the greatest players in the club's history.", "link_mentions": [{"page": "Partick Thistle F.C.", "response": ["|Willie Thornton"]}, {"page": "Auchinleck Talbot F.C.", "response": ["Winger Robertson was signed by Willie Thornton for Dundee from Talbot in 1957 at the age of 17 while working as a miner at Barony Colliery. He was a member of the Dark Blues League title winning side in 1961–62 managed by Bob Shankly and their subsequent European campaigns including an 8–1 rout of FC Cologne at Dens Park. Robertson was capped once for Scotland in a November 1961 World Cup qualification play-off against Czechoslovakia, setting up both Scotland goals for Ian St John in a 4–2 defeat. Shankly himself played for Talbot for a season in 1929 before joining his own local club, the famous Glenbuck Cherrypickers."]}, {"page": "Dundee F.C.", "response": ["| Willie Thornton || 1954–1959"]}, {"page": "Military Medal", "response": ["* Willie Thornton, Rangers and Scotland footballer."]}, {"page": "Davie Cooper", "response": ["For his performances, it was clear that Rangers were ready to offer Cooper a contract. The Govan side initially offered Clydebank £50,000, the sum increasing numerous times, eventually reaching an agreement on £100,000 to secure Cooper as a Rangers player. He travelled with his father and elder brother to a meeting with Rangers executives including Wallace, Willie Waddell and Willie Thornton. The fee and a salary of £10,000 were agreed, of which Cooper received £3,500 after tax."]}, {"page": "1951–52 in Scottish football", "response": ["|Willie Thornton, Lawrie Reilly "]}]}}