{"wiki_id": "http://www.wikidata.org/entity/Q8020105", "itemLabel": "William Wayland", "itemDescription": "English politician (1869-1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wayland", "wikipedia_page": {"main": "Lieutenant-Colonel Sir William Abraham Edward Wayland (1 September 1869 – 15 July 1950) was an English Conservative Party politician and farmer. He sat in the House of Commons from 1927 to 1945.\nWayland was educated at Marlowes College. He served as Mayor of Deptford from 1914 to 1920, for which he was knighted in the 1920 New Year Honours. He was elected as the Member of Parliament (MP) for Canterbury at a by-election in November 1927, holding the seat until he retired in 1945 because of a wish expressed by party leaders that no candidate should be aged over 70.\nIn 1931, the Conservative whip was withdrawn from him when he supported Sir Ernest Petter, standing as an Independent Conservative against the official Conservative candidate, in the Westminster St George's by-election, but it was restored before the general election later that year.\nWayland served as chairman of the Empire Day Movement from 1927 to 1948.", "link_mentions": [{"page": "Wayland", "response": ["* William Wayland (1869–1950), English Conservative Party politician"]}, {"page": "Canterbury (UK Parliament constituency)", "response": ["| Sir William Wayland"]}, {"page": "List of MPs elected in the 1931 United Kingdom general election", "response": ["|Sir William Wayland"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|Sir William Wayland"]}, {"page": "List of United Kingdom by-elections (1918–1931)", "response": ["|William Wayland"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Sir William Wayland"]}, {"page": "William Abraham Wayland", "response": ["#REDIRECT William Wayland"]}, {"page": "1927 Canterbury by-election", "response": ["*On 7 November 1927 The Canterbury Unionist Association chose 58-year-old Sir William Wayland as their candidate to defend the seat. He served as Mayor of Deptford from 1914 to 1920, for which he was knighted in the 1920 New Year Honours. "]}, {"page": "Wayland, William", "response": ["#redirectWilliam Wayland"]}, {"page": "39th (Deptford) Divisional Artillery", "response": ["The Metropolitan Borough of Deptford set up a recruiting committee in December 1914, and the Mayor, Councillor William Wayland, announced at a council meeting on 18 May 1915 that he had been approached by Kitchener with a proposal for recruiting an infantry battalion or artillery brigade, which the council endorsed. Next day the official War Office (WO) authorisation was issued to the Mayor and Borough of Deptford to raise a brigade of the Royal Field Artillery (RFA), to be numbered CLXXIV (174th). A recruiting office was set up in Deptford Town Hall and the local response was extremely good: 200 men had enlisted by 27 May. By August the borough had raised the whole artillery for an infantry division, including three more RFA brigades (CLXXIX (179th Bde), CLXXXIV (184th), and CLXXVII Howitzer (186th (H) Bde)), the 137th Heavy Battery of the Royal Garrison Artillery, and the Divisional Ammunition Column (DAC), with a total of 2500 men recruited from Deptford, Lee Green, Brockley, New Cross and neighbouring Greenwich.Frederick, pp. 552–3.Frederick, pp. 699–701.WO Instructions September 1915, Appendix VII.Wiebekin, pp. 1–7.Wiebkin, Appendix A.Farndale, p. 133.Recruiting at Lewisham in the First World War.Wayland at Lewisham in the First World War.", "A parish Roll of Honour on oak boards was installed in St Luke's Church, Deptford, in October 1917, when it was unveiled by Mayor William Wayland.IWM WMR ref 73090.", "A large wooden memorial board was placed in Deptford Town Hall in March 1921; the first panel was in memory of the men from Deptford who died in World War I, the second panel read: 'This panel commemorates the raising of the 174th, 179th, 184th, and 186th Brigades of the Royal Field Artillery, the 137th Battery of the Royal Garrison Artillery, and the 39th Divisional Ammunition Column, a total of 4700 men, by the Mayor, Sir William Wayland, for service in the Great War'.IWM WMR ref 86892."]}]}}