{"wiki_id": "http://www.wikidata.org/entity/Q8020065", "itemLabel": "William Watkinson", "itemDescription": "English footballer (1922-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Watkinson", "wikipedia_page": {"main": "William Wainwright \"Billy\" Watkinson (16 March 1922 – February 2001) was an English footballer who played as a half back in the Football League. Playing for Liverpool, he made several appearances during their title-winning 1946/47 season. He also played for Accrington Stanley and Halifax Town A.F.C. He was born in Prescot, Lancashire (now in Merseyside) in 1922, and started his career at local side Prescot Cables F.C.\nBeginning at Prescot Cables in 1939, he transferred to Liverpool in February 1946 for free. He made his debut for the club on 11 March against Bolton Wanderers in a 3–1 victory in the Second Round of the Lancashire Cup. In his time at Liverpool, he contributed to the club's win of the English First Division title in the 1946/47 season- the first since the end of the Second World War. In January 1951, he transferred to Accrington Stanley for £3,000- a record fee for the club. He scored 45 goals in 105 League games for Stanley over the course of three years, before transferring to Halifax Town in 1954. At Halifax, he scored 24 goals in 60 appearances, before returning to Prescot Cables in 1956 to play until his retirement in 1958.He died in February 2001 in Knowsley, Merseyside at the age of 78.", "link_mentions": [{"page": "Watkinson", "response": ["*William Watkinson \"Billy\" (1922–2001), English footballer", "*William Watkinson (jockey) \"Willie\" (1886–1926), Tasmanian jockey, winning rider of Jack Horner at the 1926 Grand National"]}, {"page": "List of Liverpool F.C. players (1–24 appearances)", "response": ["352 players have played fewer than 25 competitive matches for the club. Six former players – John Miller, John Curran, William Watkinson, Avi Cohen, Torben Piechnik and Sebastián Coates – each made 24 appearances during their spell at Liverpool."]}, {"page": "Watkinson, William", "response": ["#redirectWilliam Watkinson"]}]}}