{"wiki_id": "http://www.wikidata.org/entity/Q8021402", "itemLabel": "Willie Brown", "itemDescription": "Scottish footballer (born 1950)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Brown_(footballer,_born_1950)", "wikipedia_page": {"main": "William Brown (born 5 February 1950 in Falkirk) is a Scottish former professional footballer, who played as a centre forward.\nWillie Brown began his career as a junior at Burnley, turning professional in February 1967. His only league appearance for the Clarets came as a substitute for Dave Thomas in the 2–3 defeat away at West Bromwich Albion on 24 August 1968. In July 1969, he moved to Carlisle United on a free transfer, but was sent on loan to Barrow in September 1969, scoring once in 6 league games. He returned to Carlisle, scoring 8 goals in 19 league games that season, before leaving for Newport County in August 1970 for a fee of £1,500.\nHe fitted into the Newport side and became a regular goalscorer, scoring 50 goals in 168 league appearances. Towards the end of the 1973–74 season, Brown found himself out of favour at Newport, joining Hereford United on loan in March 1974, scoring 6 goals in only 9 league games for the Bulls.\nIn November 1974 he joined Brentford for a fee of £4,000, and although he scored 9 times in 16 league games he failed to settle in London and joined Torquay United in March 1975 for a fee of £5,000. His regular goalscoring soon made him a crowd favourite at Plainmoor, Brown scoring 47 goals in 139 league games before leaving league football in 1978. He was later commercial manager at Western League side Minehead, and owned a newsagents in Minehead.", "link_mentions": [{"page": "Torquay United F.C.", "response": ["O'Farrell made a return to Plainmoor in 1976 when Malcolm Musgrove lost his job after a disappointing FA Cup defeat against non-league outfit Hillingdon Borough. He soon moved upstairs into the position of consultant manager, and ex-Plymouth Argyle promotion-winning captain Mike Green was brought in to control first team matters. The end of the 1977–78 season saw the Gulls finish in ninth place, with Willie Brown finishing up as top goalscorer with 12 goals."]}, {"page": "Willie Brown", "response": ["Willie Brown may refer to:", "*Willie Brown (footballer, born 1900) (1896/1900–1977), Scottish footballer (Rochdale AFC, Torquay United)", "*Willie Brown (footballer, born 1922) (1922–1978), Scottish football player (Preston North End, Grimsby Town) and manager (Barrow AFC)", "*Willie Brown (footballer, born 1928) (1928–2017), Scottish footballer (Forfar Athletic, Accrington Stanley)", "*Willie Brown (footballer, born 1938), Scottish footballer (Accrington Stanley, Chester City, Greenock Morton)", "*Willie Brown (footballer, born 1950), Scottish footballer (Newport County, Torquay United)", "*Willie Brown (American football) (1940–2019), American football Hall-of-Fame cornerback", "*Willie Brown (American football, born 1942) (1942–2018), Tampa Bay Buccaneers coach", "*Willie Brown (golfer) (c. 1858–?), 19th century Scottish golfer", "*Willie Brown (rugby league), former Sydney Roosters rugby league player", "*Willie Brown (musician) (1900–1952), American delta blues guitarist and singer", "*Willie Brown (politician) (born 1934), mayor of San Francisco, 1996–2004, Speaker of the California State Assembly, 1980–1995", "*Miss Willie Brown, an American country music duo", "*Willie Browne (1936–2004), Irish soccer player"]}, {"page": "1970–71 Football League", "response": ["|29||align=left|  Willie Brown ||align=left| Newport County ||13||0||2||15"]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Willie Brown"]}, {"page": "Willie Brown (footballer born 1950)", "response": ["#REDIRECT Willie Brown (footballer, born 1950)"]}, {"page": "1974–75 Brentford F.C. season", "response": ["Brentford began the season poorly and after eight league matches were just two points above the Fourth Division re-election zone, though one early season highlight was a League Cup second round tie versus First Division giants Liverpool at Anfield, where Roger Cross scored the opener in a 2–1 defeat. The Liverpool match was also notable for it being the final appearance made by centre half Peter Gelson, then the club's second-highest appearance-maker, who had his contract cancelled and departed the club shortly afterwards. Under recently appointed chairman Dan Tana, manager Mike Everitt was given a vote of confidence in November 1974 and strengthened the team by signing forward Willie Brown on loan from Newport County (and later permanently for £4,000) and midfielder Terry Johnson from Southend United for £15,000.", "|Willie Brown", "| style=\"text-align:left;\" |Willie Brown", "| style=\"text-align:left;\" |Willie Brown", "| Willie Brown", "| Willie Brown", "| Willie Brown"]}]}}