{"wiki_id": "http://www.wikidata.org/entity/Q8021587", "itemLabel": "Willie Irvine", "itemDescription": "Scottish footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Irvine_(footballer,_born_1956)", "wikipedia_page": {"main": "Willie Irvine (born 26 May 1956) is a Scottish former professional footballer. Irvine, a direct, left-sided forward, started his senior career with Celtic, but failed to break into the first team. After playing in junior football for a spell, he signed for Alloa Athletic. His play for Alloa quickly attracted the attention of Motherwell, who paid £25,000 to Alloa for his services in 1979.Irvine had a successful spell with Motherwell, as he was their top scorer with 21 goals during their promotion season of 1981–82. Like his manager Davie Hay, Irvine left Motherwell soon after that success, choosing to join Hibs. Irvine was also initially successful with the Edinburgh club, forming a strike partnership with Bobby Thomson that led to him being the second top goalscorer in the Scottish Premier Division in 1983–84. After this, however, Irvine enjoyed less success, and he was loaned out to Falkirk before joining Ayr United.", "link_mentions": [{"page": "William Irvine", "response": ["*Willie Irvine (born 1943), footballer from Northern Ireland, played for Burnley, Preston, Brighton & Hove Albion and Northern Ireland", "*Willie Irvine (footballer, born 1956), Scottish footballer, played for Alloa, Motherwell and Hibernian", "*Willie Irvine (footballer, born 1963), Scottish footballer, played for Hibernian, Airdrie, Dunfermline, Alloa and Stenhousemuir "]}, {"page": "Willie Irvine (footballer born 1956)", "response": ["#REDIRECT Willie Irvine (footballer, born 1956)"]}, {"page": "1986–87 Hibernian F.C. season", "response": ["During the 1986 close season, Hibs sold Gordon Durie to Chelsea for £400,000, and brought in Billy Kirkwood, Stuart Beedie, Willie Irvine, Mark Caughey and George McCluskey. They played pre-season friendlies against Chelsea, as part of the deal for Durie, and Sevilla. Before the season started, Hibs manager John Blackley hoped to qualify for European competition and to have extended runs in the cup competitions."]}]}}