{"wiki_id": "http://www.wikidata.org/entity/Q8022239", "itemLabel": "Willoughby Weiss", "itemDescription": "English operatic bass", "wikipedia_url": "https://en.wikipedia.org/wiki/Willoughby_Weiss", "wikipedia_page": {"main": "Willoughby Hunter Weiss (2 April 1820, Liverpool - 24 October 1867, London) was an English oratorio and opera singer and composer. He became one of the most celebrated bass singers of the 19th century, and sang in the premieres of many English works.", "link_mentions": [{"page": "John Liptrot Hatton", "response": ["Hatton's third opera, Rose, or Love's Ransom (text by Henry Sutherland Edwards), was presented at the Royal English Opera, Covent Garden in 1864. It had the advantage of Helen Lemmens-Sherrington and Mr and Mrs Willoughby Weiss, George Perren, Henry Corri, and Aynsley Cook,H. Sutherland Edwards and J.L. Hatton, Rose, or Love's Ransom (Boosey & Co., London 1864). but it met with little success. It was in that year that the Ballad Concerts at St James's Hall, London, commenced, for which Hatton held the post of accompanist for the first nine seasons. Hatton developed a fondness for the seaside town of Aldeburgh, in Suffolk, where he lived for some time, and was certainly staying there in October 1865.This date is shown by a Letter from J.L. Hatton to Jas. Couper, 1865, in the Collections of the Royal Academy of Music, Accession 2006.237. In this connection he wrote a four-part Aldeburgh Te Deum in commemoration of the place he loved.Augener, 1868. See Fuller Maitland, 'Hatton, John Liptrot', Old D.N.B. p. 166 col. 2."]}, {"page": "George Thomas Smart", "response": ["Smart was born in London, his father being a music-seller. He was a choir-boy at the Chapel Royal, and was educated in music, becoming an expert violinist, organist, teacher of singing and conductor. He taught for many years at the Royal Academy of Music where his notable pupils included Elizabeth Greenfield, John Orlando Parry, Mary Shaw, and Willoughby Weiss. In 1811 he was knighted by the Lord Lieutenant of Ireland, having conducted a number of successful concerts in Dublin. On 1 April 1822 he was appointed organist at the Chapel Royal."]}, {"page": "Willoughby Hunter Weiss", "response": ["#REDIRECT Willoughby Weiss"]}, {"page": "W H Weiss", "response": ["#REDIRECT Willoughby Weiss "]}, {"page": "W.H. Weiss", "response": ["#REDIRECT Willoughby Weiss "]}, {"page": "WH Weiss", "response": ["#REDIRECT Willoughby Weiss "]}, {"page": "W. H. Weiss", "response": ["#REDIRECT Willoughby Weiss"]}, {"page": "St James's Hall", "response": ["The first performance at the hall was The Hymn of Praise, sung by the Vocal Association, under Julius Benedict.C. Pearce, Sims Reeves - Fifty Years of Music in England (Stanley Paul, London 1924), pp. 205-07.  Sims Reeves sang Beethoven's 'Adelaide' there (the first of many successes), accompanied by Arabella Goddard, in a concert at the end of May 1858.  According to Reeves' biographer, 'The hall itself met with general approval, but the arrangements for chorus and orchestra were severely condemned.'  In the same year, one of the first complete performances of J.S. Bach's St Matthew Passion to be heard in England was given there under William Sterndale Bennett, with Sims Reeves, Helen Lemmens-Sherrington, Charlotte Sainton-Dolby and Willoughby Weiss.Reeves, Sims.  My Jubilee: or, Fifty Years of Artistic Life (Simpkin, Marshall, London 1889), pp. 178-79. cf W. Sterndale Bennett (Ed.), Grosse Passions-Musik composed by John Sebastian Bach (Lamborn Cock, Hutchings, London 1862)."]}, {"page": "The Desert Flower", "response": ["|Casgan || bass or bass-baritone || Willoughby Weiss"]}, {"page": "Sims Reeves", "response": ["He returned to London in 1847, appearing in May at a benefit concert for William Vincent Wallace, and in June at one of the 'Antient Concerts'.  In September 1847 he sang in Edinburgh with Jenny Lind. His first principal role on the English operatic stage was with Louis-Antoine Jullien's English Opera company at Drury Lane Theatre in December 1847 in Lucia, in English text, with Mme Doras Gras (Lucia) and Willoughby Weiss, winning immediate and near-universal acclaim, not least from Hector Berlioz, who conducted the performance. (Berlioz mistook him for an Irishman.)Reeves 1888, pp. 60–65. In the same season, in Balfe's The Maid of Honour (based on the subject of Flotow's Martha), he created the part of Lyonnel.Reeves 1888, pp. 65–68. In May 1848 he joined Benjamin Lumley's company at Her Majesty's Theatre and sang Linda di Chamounix with Eugenia Tadolini, but he severed the connection when Italo Gardoni was brought in to sing Edgardo in Lucia opposite Jenny Lind.Pearce 1924, pp. 117–23. But that autumn in Manchester he sang in Lucia and La sonnambula, days after Lind appeared in the same works there, and Reeves obtained the better houses.Pearce 1924, pp. 128–29. Reeves sang La sonnambula and Lucia at Covent Garden in October.", "Reeves scored his greatest triumphs in oratorio at the Handel Festivals at The Crystal Palace.  At the inaugural festival of June 1857 he delivered Messiah, Israel in Egypt and Judas Maccabaeus, and these were repeated at the Handel centennial festival of 1859, when he was in company with Willoughby Weiss, Clara Novello, Mme Sainton-Dolby and Giovanni Belletti.  In Sound an Alarm during that festival, Reeves created a sensation, and the audience stood to applaud him.  Yet the Musical World considered that his \"The Enemy Said\" from Israel in Egypt surpassed even that, and was the vocal feat of the festival.Reeves 1888, pp. 229–31.", "In May 1862 at St James's Hall, Reeves took part in what he believed was the first complete performance in England of the St Matthew Passion of J. S. Bach. This was under William Sterndale Bennett, with Mme Sainton-Dolby, and Willoughby Weiss. Of this performance Reeves (who usually respected a composer's scoring absolutely) wrote:"]}, {"page": "Stanley Kirkby", "response": ["Kirkby started to record as early as 1903 for G&T, but some of these very early tracks were not issued; one of the earliest with a catalogue number was \"The Village Blacksmith\" (by Willoughby Weiss) recorded on 27 April 1904. He recorded ballads and songs typical of the Edwardian era. A selection of these recorded for Zonophone is given below with the year of recording and any pseudonym used:"]}, {"page": "The Rose of Castille", "response": ["|Willoughby Weiss"]}, {"page": "Matilda of Hungary", "response": ["|Mathias, an innkeeper || bass || Willoughby Weiss"]}]}}