{"wiki_id": "http://www.wikidata.org/entity/Q8023156", "itemLabel": "Wilson Noble", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Wilson_Noble", "wikipedia_page": {"main": "Wilson Noble (21 November 1854 – 1 November 1917) was a barrister and Conservative Party politician in England who served from 1886 to 1895 as Member of Parliament (MP) for Hastings in East Sussex.", "link_mentions": [{"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Wilson Noble"]}, {"page": "List of MPs elected in the 1886 United Kingdom general election", "response": ["| Wilson Noble"]}, {"page": "Hastings (UK Parliament constituency)", "response": ["| Wilson Noble"]}, {"page": "William Parsons Winchester Dana", "response": ["* Marian Caroline Dana (b. 1857), who married Wilson Noble (1854–1917), an MP for Hastings. Their daughter, Lilian Georgette, was mother of the 1952 Summer Olympics shooting sport participant Ingram Capper."]}, {"page": "Ingram Capper", "response": ["Capper was the elder son (there being also two daughters) of Captain Robert Harcourt Ord Capper, Prince of Wales's North Staffordshire Regiment, of The Northgate, Herefordshire, by his wife Lilian Georgette, eldest daughter of Conservative politician Wilson Noble, of Park Place, Henley-on-Thames, Berkshire. Lilian Capper was a granddaughter of the American painter William Parsons Winchester Dana.Walford's County Families of the United Kingdom, 53rd edition, Spottiswoode & Co., 1913, p. 195The Dana Family in America, Elizabeth Ellery Dana, Wright & Potter, 1956, pp. 391-392 The Capper family, mainly lawyers and clergymen, were landed gentry, of Lyston Court, Ross, Herefordshire.A Genealogical and Heraldic History of the Landed Gentry of Great Britain and Ireland, fifth edition, Sir Bernard Burke, Harrison, 1875, p. 204 He was noted, as a member of the Bromyard and District Local History Society, to be a descendant of Christopher Capper, of Bromyard, Herefordshire, bailiff of that place, a grazier, and owner of the White Horse Inn on Cruxwell Street.Bromyard: A Local History, Joseph Gordon Hillaby, Bromyard and District Local History Society, 1970, pp. 47, 50"]}]}}