{"wiki_id": "http://www.wikidata.org/entity/Q8020195", "itemLabel": "William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam", "itemDescription": "British politician (1815-1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wentworth-Fitzwilliam,_6th_Earl_Fitzwilliam", "wikipedia_page": {"main": "William Thomas Spencer Wentworth-FitzWilliam, 6th Earl FitzWilliam,  (12 October 1815 – 20 February 1902), styled Hon. William Wentworth-Fitzwilliam 1815–1835, and Viscount Milton 1835–1857, was a British peer, nobleman, and Liberal Party politician.", "link_mentions": [{"page": "List of knights and ladies of the Garter", "response": ["| William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam"]}, {"page": "William FitzWilliam", "response": ["*William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam (1815–1902), British peer and Liberal politician"]}, {"page": "Henry Lascelles, 4th Earl of Harewood", "response": ["*Lady Mary Diana Lascelles (24 May 1877 – 23 July 1930), married Robert Doyne, grandson of William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam, and had issue."]}, {"page": "Millhouses Park", "response": ["In the late eighteenth century land at Millhouses, known as the Grange Ville Estate, was purchased by Peter Wigfall. He died in 1828 and the land passed to Thomas Whitehead under the terms of a will dated 1812. In 1837 William Speck filed a court case claiming that the will of 1812 was a forgery, and that he, as the closest living relative of Peter Wigfall should inherit the land. This case was dismissed, but in 1855 Joseph Oldale also claimed ownership of the land and took forcible possession of property at Millhouses, a siege ensued and eventually Oldale was removed. Legal proceedings followed, and in 1858 Oldale was charged with having fraudulently altered the parish records to bolster his claims. Whitehead sold the property to William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam, but in 1875 Oldale's son William reasserted the family's claim to the land and forcibly took possession of property in Millhouses, including farmland that was leased by the miller of the corn mill and the inn keeper at the Waggon and Horses Inn (the future site of Millhouses Park). Once again the claim was unsuccessful and the land returned to Earl Fitzwilliam."]}, {"page": "List of sportsperson-politicians", "response": ["|data-sort-value=\"Fitzwilliam,Lord\"| William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam || Cricket (Sheffield Cricket Club) || MP for Malton (1837–1841; 1846–1847) and Wicklow (1847–1857)Member of the House of Lords"]}, {"page": "George Osborne, 9th Duke of Leeds", "response": ["* Lady Ada Charlotte Godolphin Osborne  (30 May 1870 – 9 Apr 1944). She was married, firstly, on 18 Oct 1901 to Hon. William Hugh Spencer Wentworth FitzWilliam (10 Jan 1860 – 28 Mar 1917), son of William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam and Lady Frances Harriet Douglas. She was married, secondly, on 14 Dec 1922 to Sir Harry Robert Boyd, son of Robert Boyd."]}, {"page": "William Wentworth-Fitzwilliam, 7th Earl Fitzwilliam", "response": ["He sat in the House of Commons for Wakefield from 1895 until 1902, when he inherited the title Earl Fitzwilliam on the death of his grandfather William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam. His father William Wentworth-Fitzwilliam, Viscount Milton had pre-deceased him."]}, {"page": "William Thomas Spencer Wentworth-FitzWilliam, 6th Earl FitzWilliam", "response": ["#REDIRECT William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam"]}, {"page": "Queen's Own Yorkshire Dragoons", "response": ["* Col William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam, KG, appointed 25 December 1886"]}, {"page": "William FitzWilliam, 6th Earl FitzWilliam", "response": ["#REDIRECT William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam"]}, {"page": "William Wentworth-FitzWilliam, 6th Earl FitzWilliam", "response": ["#REDIRECT William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam "]}, {"page": "William Jeffcock", "response": ["In 1846 he was made a Justice of the Peace.National Archives Oaths of Justices of the Peace  On 14 August 1833 he was made a captain in the South West Yorkshire Yeomanry Cavalry which in 1844 become the First West Yorkshire Yeomanry Cavalry. Military History of Doncaster @ Doncasterhistory.co.uk Thirty two years later on 14 April 1865 he was made a Major in the 1st West York, under the command of William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam K.G. who was the colonel for some 40 years, until 1886. The Army List of 1867, Original from Oxford University digitised in Oct 2007The Sheffield and Rotherham Independent 27 November 1871 \"The Death of W. Jeffcock, Esq.\""]}, {"page": "William Wentworth-Fitzwilliam", "response": ["* William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam (1815–1902), British peer and Liberal politician"]}, {"page": "Holy Trinity Church, Wentworth", "response": ["The church was built by William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam in memory of his parents. Construction started in 1872 and the building was designed by John Loughborough Pearson. It was completed in 1876 and consecrated on 31 July 1877 by the Archbishop of York. On opening, Old Holy Trinity Church, Wentworth was closed."]}, {"page": "Eric Spencer Wentworth-Fitzwilliam, 9th Earl Fitzwilliam", "response": ["Eric Wentworth-Fitzwilliam was the son of Captain the Hon. Sir William Charles Wentworth-Fitzwilliam, fourth son of William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam, and Constance Anne Brocklehurst.Dod's Peerage, Baronetage and Knightage of Great Britain and Ireland (1952), p. 90"]}, {"page": "Evelyn Boscawen, 6th Viscount Falmouth", "response": ["# Hon Hugh le Despenser (28 February 1849 – 8 April 1908), married Lady Mary FitzWilliam daughter of the William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam"]}, {"page": "Frances Wentworth-Fitzwilliam, Countess Fitzwilliam", "response": ["#REDIRECT William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam"]}, {"page": "Mount Fitzwilliam", "response": ["The mountain was named on July 8, 1863 by Walter Cheadle after Viscount Milton (1839–1877) whose father was William Wentworth-Fitzwilliam, 6th Earl Fitzwilliam.  Milton and his personal physician Dr. Walter Cheadle were traveling together up the Athabasca River and may be the first \"tourists\" to travel through Yellowhead Pass. They later co-authored \"The North-West Passage by Land\"The North-West Passage by Land,  William Fitzwilliam Milton, Viscount;  Walter B Cheadle, OCLC 4999700 London, Cassell, Petter, and Galpin, 1865 and \" Voyage de l'Atlantique au Pacifique, à travers le Canada\",Voyage de l'Atlantique au Pacifique, à travers le Canada, les montagnes Rocheuses et la Colombie anglaise, William Fitzwilliam Milton, Viscount;  Walter B Cheadle,   Paris : Hachette, 1879 which described their expedition in considerable detail."]}]}}