{"wiki_id": "http://www.wikidata.org/entity/Q8021409", "itemLabel": "Willie Callaghan", "itemDescription": "Scottish footballer (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Callaghan", "wikipedia_page": {"main": "William Thomas Callaghan (born 12 February 1943 in Cowdenbeath) is a Scottish former professional footballer, who played for Dunfermline Athletic, Berwick Rangers, Cowdenbeath and Scotland. Callaghan played for Dunfermline for most of his club career, playing in two Scottish Cup Finals, losing 3–2 to Celtic in 1965 and winning 3–1 against Hearts in 1968. In all he made 426 appearances for the Pars, including 34 in European competition, a club record. Willie's brother Tommy Callaghan also played for Dunfermline, and they are the last pair of brothers to have played the full 90 minutes together in the same Scottish Cup-winning side as of 2009,-   In 2008, Callaghan was inducted into Dunfermline Athletic's hall of fame.Callaghan represented the full Scotland national team six times between 1967 and 1970. He first played for Scotland during an overseas tour in 1967, when several players were unavailable due to their clubs being involved in European competition. The Scottish Football Association decided in October 2021 to reclassify some of these games as full internationals, which increased his cap tally from two to six. Callaghan's appearance against Wales in 1970 was the last time that a Dunfermline Athletic player represented Scotland until Barry Nicholson and Stevie Crawford were selected for a match against Poland in 2001.Willie's son, also named Willie, was a footballer who played for several league clubs in the 1980s and 1990s. His brother, Tommy Callaghan, played for Dunfermline and Celtic. His grandson, Liam Callaghan, had a trial spell with Birmingham City in November 2011.", "link_mentions": [{"page": "1964–65 Scottish Cup", "response": ["|RB |||| Willie Callaghan "]}, {"page": "Tommy Callaghan", "response": ["His brother Willie played for Dunfermline and Scotland, and his father William, maternal uncles Patrick Flannigan and David Flannigan, son Tommy Callaghan JrCallaghan, Tommy 1998-2001, Partick Thistle History Archive nephew Willie Callaghan Jr, and grand-nephew Liam CallaghanMontrose FC duo appear in court in Dublin charged with assault and obstructing police, Stefan Morkis, The Courier, 13 December 2019 all played football to some extent.Cowdenbeath's Liam Callaghan given Birmingham trial, BBC Sport, 18 November 2011Four generations with the Cowden, David Allan, Central Fife Times, 28 November 2011"]}, {"page": "William Callaghan (disambiguation)", "response": ["* Willie Callaghan (born 1943), Scottish footballer", "* Willie Callaghan (footballer, born 1941), Scottish footballer (Aberdeen FC)", "* Willie Callaghan (footballer, born 1967), Scottish footballer (Dunfermline Athletic, Walsall FC, Montrose FC, Livingston FC)"]}, {"page": "Willie Callaghan (footballer, born 1967)", "response": ["Willie Callaghan (born 23 March 1967) is a Scottish former professional association football player, who played for Dunfermline Athletic, Walsall, Cowdenbeath, Clyde, Albion Rovers, Montrose, Meadowbank Thistle, Livingston and Partick Thistle in the Scottish and English leagues. He also played for Scottish Highland Football League Club, Inverness Thistle, and for three Scottish Junior Clubs respectively, Halbeath, Kelty Hearts and Glenafton Athletic."]}, {"page": "1968 Scottish Cup Final", "response": ["|DF |||| Willie Callaghan"]}]}}