{"wiki_id": "http://www.wikidata.org/entity/Q8020370", "itemLabel": "William Wilkinson", "itemDescription": "British consul in Bucharest and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wilkinson_(diplomat)", "wikipedia_page": {"main": "William Wilkinson (died 1836) was British Consul to the principalities of Wallachia and Moldavia, appointed to Bucharest by the Levant Company in 1813; he was recalled in 1816. He wrote a book An Account of the Principalities of Wallachia and Moldavia: With Various Political Observations Relating to Them (1820). It was one of the books on which Bram Stoker took notes before writing Dracula, and the Romanian name Dracula was taken from it.Wilkinson was later posted to Syros, in 1829, by the Levant Company. He died in Paris on 23 August 1836.", "link_mentions": [{"page": "Vlad the Impaler", "response": ["The stories about Vlad made him the best-known medieval ruler of the Romanian lands in Europe. However, Bram Stoker's Dracula, which was published in 1897, was the first book to make a connection between Dracula and vampirism. Stoker had his attention drawn to the blood-sucking vampires of Romanian folklore by Emily Gerard's article about Transylvanian superstitions (published in 1885). His limited knowledge about the medieval history of Wallachia came from William Wilkinson's book entitled Account of the Principalities of Wallachia and Moldavia with Political Observations Relative to Them, published in 1820."]}, {"page": "Bucur (legendary shepherd)", "response": ["The earliest reference to Bucur was written by the Franciscan friar Blasius Kleiner, who claimed that Bucur was both a shepherd and a haiduc. Another early reference is found in An Account of the Principalities of Wallachia and Moldavia, an 1820 book published in London by the English consul in Bucharest, William Wilkinson. The earliest reference to Bucur's Church is from a geography manual written by Iosif Gentilie in 1835."]}, {"page": "Count Dracula", "response": ["While having a conversation with Jonathan Harker in Chapter 3, Dracula refers to his own background, and these speeches show elements which Stoker directly copied from An Account of the Principalities of Wallachia and Moldavia: With Various Political Observations Relating to Them by William Wilkinson. Stoker mentions the Voivode of the Dracula race who fought against the Turks after the defeat in the Battle of Kosovo, and was later betrayed by his brother, historical facts which unequivocally point to Vlad III, described as \"Voïvode Dracula\" by Wilkinson:"]}, {"page": "Slavery in Romania", "response": ["However, Djuvara, who bases his argument on a number of contemporary sources, also notes that the slaves were exceptionally cheap by any standard: in 1832, a contract involving the dowry of a boyaress shows that thirty Roma slaves were exchanged for one carriage, while the British diplomat William Wilkinson noted that the slave trade was a semi-clandestine matter, and that vătraşi slaves could fetch the modest sum of five or six hundred piastres.Djuvara, p.270 According to Djuvara's estimate, lăieşi could be worth only half the sum attested by Wilkinson."]}, {"page": "William Wilkinson", "response": ["*William Wilkinson (diplomat) (died 1836), British Consul to Wallachia and Moldavia", "*William Wilkinson (architect) (1819–1901), Gothic Revival architect who practised in Oxford", "*William Wilkinson (New South Wales politician) (1858–1946), Australian politician and doctor", "*William Wilkinson (cricketer, born 1857) (1857–1946), Australian-born physician and cricketer who played in England", "*William Wilkinson (cricketer, born 1859) (1859–1940), English cricketer", "*William Wilkinson (cricketer, born 1881) (1881–1961), English cricketer and footballer", "*William Wilkinson (Australian cricketer) (1899–1974), Australian cricketer", "*William Wilkinson (footballer), goalkeeper active in England in the 1890s", "*William Wilkinson (priest) (1897–?), Anglican priest"]}]}}