{"wiki_id": "http://www.wikidata.org/entity/Q8025423", "itemLabel": "Winifred Shotter", "itemDescription": "British actress (1904-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Winifred_Shotter", "wikipedia_page": {"main": "Winifred Florence Shotter (5 November 1904 – 4 April 1996) was an English actress best known for her appearances in the Aldwych farces of the 1920s and early 1930s.\nInitially a singer and dancer in the ensembles of musical comedies, Shotter was spotted by the comedian and producer Leslie Henson. He recommended her to his colleague Tom Walls, who was in search of a leading lady to succeed Yvonne Arnaud in his series of farces at the Aldwych Theatre, London. From 1926 to 1932, Shotter played in eight of the farces, in a regular company headed by Walls and Ralph Lynn. She appeared in several films during the 1930s, including adaptations of four of the Aldwych plays.\nAfter the Aldwych series ended, Shotter appeared in numerous West End shows, worked briefly in Hollywood, and continued to appear in British films. During the Second World War she joined the Entertainments National Service Association (ENSA), performing for troops in Europe and Asia.  An example is French Leave, a play by Reginald Berkeley, sub-titled: A Normandy Story, where she appeared with Lawrence O'Madden. After the war she joined the BBC as an announcer on the relaunched television service. During the 1950s she gradually withdrew from performing and retired to Switzerland with her second husband.", "link_mentions": [{"page": "Ben Travers", "response": ["With Travers's agreement, Grossmith sold the rights to A Cuckoo in the Nest to Walls, and the play opened at the Aldwych in July 1925.\"Aldwych Theatre\", The Times, 23 July 1925, p. 12 The leading lady was Yvonne Arnaud, and the two leading men were Walls and Ralph Lynn. They were supported by a team of players who became part of a regular company at the Aldwych for the rest of the 1920s and into the 1930s: Robertson Hare, Mary Brough and Gordon James, joined in subsequent productions by Winifred Shotter (in place of Arnaud) and Ethel Coleridge.\"Mr. Ralph Lynn\", The Times, 10 August 1962, p. 11 The play was an immediate success and ran for 376 performances."]}, {"page": "Aldwych Theatre", "response": ["From 1923 to 1933, the theatre was the home of the series of twelve farces, known as the Aldwych farces, most of which were written by Ben Travers. Members of the regular company for these farces included Ralph Lynn, Tom Walls, Ethel Coleridge, Gordon James, Mary Brough, Winifred Shotter and Robertson Hare.\"Mr Ralph Lynn\", The Times, 10 August 1962, p. 11 In 1933, Richard Tauber presented and starred in a new version of Das Dreimäderlhaus at the Aldwych under the title Lilac Time.  From the mid-1930s until about 1960, the theatre was owned by the Abrahams family.Theatre Postcard site. Retrieved 19 March 2007"]}, {"page": "Charles Taylor (Conservative politician)", "response": ["Taylor married actress Constance Ada Shotter, daughter of Frederick E Shotter and sister of Winifred Shotter, on 20 May 1936. They had three sons and a daughter and lived at Ratton Wood, Willingdon, Eastbourne, Sussex."]}, {"page": "Phonofilm", "response": ["# Peace and Quiet (1929) with Ralph Lynn and Winifred Shotter, directed by Sinclair Hill, play by Ronald Jeans"]}, {"page": "Tom Walls", "response": ["There were twelve Aldwych farces under Walls's management. The first eight averaged runs of 369 performances. The last four did less well, averaging under 150 performances.  Walls gathered a regular troupe of supporting actors, including Robertson Hare, Mary Brough and Winifred Shotter. Travers wrote for these players, drawing on their strengths, his plays populated by:"]}, {"page": "List of British films of 1935", "response": ["|D'Ye Ken John Peel? || Henry Edwards || John Garrick, Winifred Shotter || Adventure ||", "|The Rocks of Valpre||Henry Edwards ||John Garrick, Winifred Shotter ||Crime||"]}, {"page": "List of British films of 1934", "response": ["|Lilies of the Field||Norman Walker ||Winifred Shotter, Ellis Jeffreys ||Romance/comedy||"]}, {"page": "List of British films of 1933", "response": ["|Just My Luck||Jack Raymond ||Ralph Lynn, Winifred Shotter||Comedy||", "|Summer Lightning||Maclean Rogers ||Ralph Lynn, Winifred Shotter ||Comedy||", "|Up to the Neck || Jack Raymond || Ralph Lynn, Winifred Shotter || Comedy ||"]}, {"page": "List of British films of 1932", "response": ["|The Love Contract||Herbert Selpin||Winifred Shotter, Owen Nares||Musical||", "|A Night Like This||Tom Walls||Ralph Lynn, Winifred Shotter||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|Plunder||Tom Walls||Ralph Lynn, Winifred Shotter||Comedy||"]}, {"page": "List of British films of 1938", "response": ["|His Lordship Regrets||Maclean Rogers ||Claude Hulbert, Winifred Shotter ||Comedy||"]}, {"page": "John and Julie", "response": ["* Winifred Shotter as Mrs. Swayne, his wife"]}, {"page": "On Approval (play)", "response": ["* On Approval, a 1930 British comedy film directed by and starring Tom Walls, also featuring Yvonne Arnaud, Winifred Shotter and Robertson Hare.BFI.org"]}, {"page": "Jack's the Boy", "response": ["* Winifred Shotter – Ivy"]}, {"page": "Candles at Nine", "response": ["* Winifred Shotter as Brenda Tempest, Cecil's Wife  "]}, {"page": "The Beauty Prize", "response": ["*Marconi Boy – Winifred Shotter"]}, {"page": "Just My Luck (1933 film)", "response": ["Just My Luck is a 1933 British comedy film directed by Jack Raymond and starring Ralph Lynn, Winifred Shotter, Davy Burnaby and Robertson Hare. The screenplay was written by Ben Travers based on a 1932 Aldwych farce by H.F. Maltby, Fifty-Fifty, adapted from the French play Azaïs by Louis Verneuil and Georges Berr.", "* Winifred Shotter - Peggy Croft", "In 1933, the Melbourne Argus wrote, \"one has become accustomed to seeing Ralph Lvnn as Ralph Lynn in every part which he plays. His appearances in the opening sequences of Just My Luck (at the Majestic) as a music teacher who expects everyone to kick him down the back stairs raises hopes that at last one is to see him subordinate himself to a character. The hopes are refreshing but fragile, like a glass of iced lager in the tropics - not that it matters much. Ralph Lynn as Ralph Lynn is as diverting a spectacle as the British screen can offer. The attitude to life of Mr. Blake, the music master, Is expounded in a single phrase. \"I wonder why that didn't hit me,\" he ponders when a loose slate slides from a rooftop and shatters at his feet. Poor Mr. Blake has had 35 years of bad luck...Mr. Lynn contrives to leaven his foolery with touches of genuine pathos, but when his luck changes to prove the comforting theory that a man has as much good as bad fortune in his life, he fairly romps in his Rookery Nook style, through broader and yet broader farce. It is all very good fun, though. Mr. Lynn is supported by an able cast, which includes Winifred Shotter and Robertson Hare.\""]}, {"page": "His Lordship Regrets", "response": ["His Lordship Regrets is a 1938 British comedy film directed by Maclean Rogers and starring Claude Hulbert, Winifred Shotter, Gina Malo and Aubrey Mallalieu. Impoverished Lord Cavender pursues wealthy Mabel van Morgan only to discover himself in love with the apparently penniless Mary."]}, {"page": "Summer Lightning (film)", "response": ["Summer Lightning is a 1933 British comedy film directed by Maclean Rogers and starring Ralph Lynn, Winifred Shotter, Chili Bouchier and Horace Hodges. It is based on the 1929 novel Summer Lightning by P.G. Wodehouse.", "* Winifred Shotter – Millicent Keeble"]}, {"page": "Lilies of the Field (1934 film)", "response": ["Lilies of the Field is a 1934 British romantic comedy film directed by Norman Walker and starring Winifred Shotter, Ellis Jeffreys, Anthony Bushell and Claude Hulbert.BFI.org It was made at Elstree Studios.Wood p.81", "* Winifred Shotter as Betty Beverley"]}, {"page": "The Rocks of Valpre (1935 film)", "response": ["The Rocks of Valpre is a 1935 British crime film directed by Henry Edwards and starring John Garrick, Winifred Shotter and Leslie Perrins. The film was made at Twickenham Studios. It was based on the 1913 novel of the same name by Ethel M. Dell, and was released in the U.S. as High Treason. The film is set in the mid-nineteenth century with plot elements resembling the later Dreyfus Case.", "* Winifred Shotter as Christine Wyndham"]}, {"page": "Plunder (1931 film)", "response": ["Plunder is a 1931 British comedy film directed by and starring Tom Walls. It also features Ralph Lynn, Winifred Shotter and Robertson Hare.BFI Database entry It was based on the original stage farce of the same title, and was the second in a series of film adaptations of Aldwych farces by Ben Travers, adapted in this case by W. P. Lipscomb, and was a major critical and commercial success helping to cement Walls's position as one of the leading stars of British cinema.McFarlane p.21-22", "* Winifred Shotter as Joan Hewlett"]}, {"page": "On Approval (1930 film)", "response": ["On Approval is a 1930 British comedy film directed by and starring Tom Walls and also featuring Yvonne Arnaud, Winifred Shotter and Robertson Hare, the same artistes responsible for the Aldwych farces. It was based on the play On Approval by Frederick Lonsdale,BFI.org as was the 1944 film On Approval.", "* Winifred Shotter as Helen Hayle"]}, {"page": "Rookery Nook (play)", "response": ["The actor-manager Tom Walls, initially together with Leslie Henson, produced the series of Aldwych farces, nearly all written by Ben Travers, starring Walls and his co-star Ralph Lynn, who specialised in playing \"silly ass\" characters. Walls assembled a regular company of actors to fill the supporting roles. For the first few productions, the company included Robertson Hare, as a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority, Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Rhoda Marley – Winifred Shotter "]}, {"page": "The Chance of a Night Time", "response": ["The Chance of a Night Time is a 1931 British comedy film directed by Herbert Wilcox and starring Ralph Lynn, Winifred Shotter and Kenneth Kove.BFI.org The screenplay was written by Ben Travers based on his play The Dippers, and the cast included cast members from Travers's Aldwych Farces.", "* Winifred Shotter - Pauline Gay", "The New York Times wrote, \"Its chief distinction is really the characterization offered by Mr. Ralph Lynn in the rôle of a diffident lawyer...Miss Winifred Shotter, who is a favorite member of the \"Aldwych school,\" is effective as Pauline, the danseuse, as she plays up well to Mr. Lynn, who, with an experience gained in Hollywood, has won what some judges hold to be the foremost place among English screen comedians. Here and there comparisons with the much more elaborate settings which Hollywood would have devised for a picture of this kind are unavoidable, but on the whole the genuine atmosphere and environment of an English country house has been retained; and there is compensation in verisimilitude for what the eye loses in the way of spectacle...Though there is no gainsaying the fact that this picture is full of robustious humor, is pat in dialogue and quick in action for an English offering, there are still times when the onlooker is inclined to suggest \"getting on with it\";https://www.nytimes.com/movie/review?res=9E07E0DE173DEE32A25754C0A9609C946094D6CF while more recently, Allmovie wrote, \" It's Ralph Lynn's show all the way, and he makes the most of every comic opportunity. It would be nice to say that the film's production values were on the same level as the star's performance -- nice, and untrue.\""]}, {"page": "The Body Said No!", "response": ["* Winifred Shotter - TV Announcer"]}, {"page": "Night of the Garter", "response": ["Night of the Garter is a 1933 British comedy film directed by Jack Raymond and starring Sydney Howard, Winifred Shotter and Elsie Randolph.", "* Winifred Shotter as Gwen Darling"]}, {"page": "Constance Shotter", "response": ["Shotter was born in London, the daughter of Frederick Ernest and Harriet Payne Shotter.the Peerage.com  She was the sister of actress Winifred Shotter. By 1926 she was a chorus dancer, appearing in The Midnight Follies a Dinner, Dancing and Review by A. P. Herbert, choreographed by Penelope Spencer.Penelope Spencer - Dancerand choreographer: A Chronicle Like her sister she moved from the chorus line and appeared in a series of British films in the 1930s. Internet Movie Database"]}, {"page": "Tons of Money (play)", "response": ["The play was adapted for the cinema on two occasions. A 1924 silent film Tons of Money was directed by Frank Hall Crane and starred Leslie Henson.Tons of Money, Walls and Henson films, The British Film Institute, accessed 13 November 2011 A 1930 sound version Tons of Money directed by Tom Walls starred many of the Aldwych regulars. The BBC has broadcast two adaptations of the play for television. In 1947 Winifred Shotter and Desmond Walter-Ellis starred as the Allingtons. Eleanor Summerfield and Frankie Howerd were the leads in a 1954 television version.\"Tons of Money\", BBC Genome. Retrieved 6 August 2021"]}, {"page": "List of Elstree Studios productions", "response": ["| On Approval || rowspan=\"3\" | Film || Comedy || Tom Walls || Tom Walls, Yvonne Arnaud, Winifred Shotter, Robertson Hare", "| Rookery Nook || rowspan=\"5\" | Film || Farce || Tom Walls || Tom Walls, Ralph Lynn, Winifred Shotter, Mary Brough", "| The Chance of a Night Time || Comedy || Herbert Wilcox || Ralph Lynn, Winifred Shotter, Kenneth Kove", "| Mischief || Comedy || Jack Raymond || Ralph Lynn, Winifred Shotter, Jeanne Stuart", "| Plunder || Tom Walls || Tom Walls, Ralph Lynn, Winifred Shotter, Robertson Hare", "| The Love Contract || Musical || Herbert Selpin || Winifred Shotter, Owen Nares, Sunday Wilshin", "| A Night Like This || Tom Walls || Tom Walls, Ralph Lynn, Winifred Shotter", "| Just My Luck || Jack Raymond || Ralph Lynn, Winifred Shotter, Davy Burnaby, Robertson Hare", "| Night of the Garter || Jack Raymond || Sydney Howard, Winifred Shotter, Elsie Randolph", "| Summer Lightning || Comedy || Maclean Rogers || Ralph Lynn, Winifred Shotter, Chili Bouchier", "| Up to the Neck || Comedy || Jack Raymond || Ralph Lynn, Winifred Shotter, Francis Lister", "| Lilies of the Field || Romantic comedy || Norman Walker || Winifred Shotter, Ellis Jeffreys, Anthony Bushell, Claude Hulbert", "| Sorrell and Son || Drama || Jack Raymond || H. B. Warner, Margot Grahame, Peter Penrose, Hugh Williams, Winifred Shotter"]}, {"page": "Turkey Time (play)", "response": ["Like its predecessors, the play was directed by Tom Walls, who co-starred with Ralph Lynn, a specialist in playing \"silly ass\" characters.  The regular company of supporting actors included Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278Travers, p. vi This was the last of the Aldwych farces in which Walls appeared on stage. He produced, but did not play in, the last three.\"Aldwych Theatre\", The Times, 8 March 1932, p. 12; \"Aldwych Theatre\", The Times, 6 September 1932, p. 10; and \"Aldwych Theatre\", The Times, 31 January 1933, p. 8", "*Rose Adair – Winifred Shotter"]}, {"page": "The Love Contract", "response": ["The Love Contract is a 1932 British musical film directed by Herbert Selpin and starring Winifred Shotter, Owen Nares and Sunday Wilshin. The screenplay concerns a young woman who becomes the driver of a wealthy stockbroker who lost her family's savings. It was based on a play by Jean de Letraz, Suzette Desty and Roger Blum. It was produced by Herbert Wilcox's company British & Dominions Film Corporation.Sutton p.263 Alternate language versions were made in French () and in German (), both of which were also directed by Selpin.", "* Winifred Shotter as Antoinette "]}, {"page": "Aldwych farce", "response": ["The Aldwych farces were a series of twelve stage farces presented at the Aldwych Theatre, London, nearly continuously from 1923 to 1933. All but three of them were written by Ben Travers. They incorporate and develop British low comedy styles, combined with clever word-play. The plays were presented by the actor-manager Tom Walls and starred Walls and Ralph Lynn, supported by a regular company that included Robertson Hare, Mary Brough, Winifred Shotter, Ethel Coleridge, and Gordon James. ", "The Aldwych farces also featured a regular team of supporting actors: Robertson Hare as a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; the saturnine Gordon James as the \"heavy\"; and first Yvonne Arnaud, then Winifred Shotter, as the sprightly young female lead.Trussler, p. 278 The plays generally revolved around a series of preposterous incidents involving a misunderstanding, borrowed clothes and lost trousers, involving the worldly Walls character, the innocent yet cheeky Lynn, the hapless Hare, the beefy, domineering Brough, the lean, domineering Coleridge, and the pretty and slightly spicy Shotter, all played with earnest seriousness. The scripts incorporated and developed British low comedy styles, particularly \"silly-asses, henpecked husbands, battleaxe mothers-in-law and lots of innocent misunderstandings.\"Archive: \"Tom Walls (1883 – 1949)\" , British Pictures.com, accessed 2 June 2012 "]}, {"page": "Thark (play)", "response": ["The actor-manager Tom Walls produced the series of Aldwych farces, nearly all written by Ben Travers, and starring himself and Ralph Lynn, who specialised in playing \"silly ass\" characters.  Walls assembled a regular company of actors to fill the supporting roles, including Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Kitty Stratton – Winifred Shotter"]}, {"page": "Plunder (play)", "response": ["The actor-manager Tom Walls produced the series of Aldwych farces, nearly all written by Ben Travers, starring Walls and his co-star Ralph Lynn, who specialised in playing \"silly ass\" characters. Walls assembled a regular company of actors to fill the supporting roles, including Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Joan Hewlett – Winifred Shotter", "The Times thought the piece \"a very entertaining piece of nonsense … Miss Mary Brough bounces through it all with hearty accomplishment; Miss Winifred Shotter decorates it prettily; Mr. Gordon James and Mr. Robertson Hare contribute the farce of solemnity … Mr. Walls and Mr. Lynn at Scotland Yard are delightful\".\"Aldwych Theatre\", The Times, 27 June 1928, p. 4 The Observer critic wrote of his \"grateful laughter\", found the entire cast \"in tip-top form\" and predicted \"A year's hard labour\" for them all.\"Plunder\", The Observer, 1 July 1928, p. 15 The Manchester Guardian called the piece, \"an exquisitely involved, briskly moving and thoroughly funny show.\"\"Third Degree: A Ben Travers Farce at the Aldwych\", The Manchester Guardian, 27 June 1928, p. 14 The Illustrated London News declared it \"London's funniest play\".\"Crook Farce at the Aldwych: London's Funniest Play\", The Illustrated London News, 25 August 1928, p. 339"]}, {"page": "A Cup of Kindness (play)", "response": ["The actor-manager Tom Walls produced the series of Aldwych farces, nearly all written by Ben Travers, starring Walls and his co-star Ralph Lynn, who specialised in playing \"silly ass\" characters. Walls assembled a regular company of actors to fill the supporting roles, including Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Betty Ramsbotham – Winifred Shotter"]}, {"page": "Rookery Nook (film)", "response": ["*Rhoda Marley  – Winifred Shotter*"]}, {"page": "A Night Like This (play)", "response": ["Like its predecessors, the play was produced and directed by Tom Walls, who co-starred with Ralph Lynn, a specialist in playing \"silly ass\" characters.  The regular company of supporting actors included Robertson Hare, who played a figure of put-upon respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278", "*Cora Mellish – Winifred Shotter"]}, {"page": "Housemaster (play)", "response": ["In a 1954 revival, Jack Hulbert played Donkin, with Winifred Shotter as Barbara Fane and Donald Hewlett as Beamish.\"St. Martin's Theatre\", The Times, 20 January 1954, p. 2 A film of the play was made in 1938, with Kynaston Reeves reprising his role as Ovington, and Otto Kruger as Donkin.\"Film Releases: Ian Hay Comedy\", The Observer, 31 July 1938, p. 7"]}, {"page": "A Night Like This (film)", "response": ["A Night Like This is a 1932 comedy film directed by Tom Walls and starring Walls, Ralph Lynn and Winifred Shotter. Ben Travers wrote the screenplay, adapting his own play, the original 1930 Aldwych farce of the same title.", "*Cora Mellish  –  Winifred Shotter*"]}, {"page": "Fifty-Fifty (play)", "response": ["Three of the familiar favourites in the Aldwych team took roles in the new production alongside Lynn: Robertson Hare, a figure of harassed respectability, Mary Brough, famous for her eccentric old ladies, and Winifred Shotter, the leading lady. The public had grown used to farces written specially for the company by Ben Travers, and critics noted that the parts in the new piece were not tailor-made for Hare and Brough as Travers's characters always were. The play had already been seen in London in Maltby's translation, in a production at the Strand Theatre in 1929. On that occasion it was given under the title Azaïs and was less anglicised than the version presented at the Aldwych.\"Repertory Players\", The Times, 30 September 1929, p. 9 One member of the Strand cast was recruited for the Aldwych production, Clive Morton, who reprised his character, the Viscount de Langeais, though renamed La Coste.", "*Peggy Croft – Winifred Shotter"]}, {"page": "Marry the Girl (play)", "response": ["Like its predecessors, the play was directed by Tom Walls, who co-starred with Ralph Lynn, a specialist in playing \"silly ass\" characters.  The regular company of supporting actors included Robertson Hare, who played a figure of harassed respectability; Mary Brough in eccentric old lady roles; Ethel Coleridge as the severe voice of authority; Winifred Shotter as the sprightly young female lead; and the saturnine Gordon James.Trussler, p. 278Travers, p. vi", "*Doris Chattaway – Winifred Shotter", "The play was filmed in 1935. Marry the Girl was unlike the nine earlier film versions of the Aldwych series in several respects:  it was made by a different company (British Lion Films rather than British & Dominions Film Corporation and Gaumont British);\"Tom Walls\" British Film Institute, accessed 3 March 2013 it was not directed by Walls, who had directed eight of the first nine;Walls directed all except Just My Luck (1933), which was directed by Jack Raymond and neither Walls, Lynn nor Hare featured in it: the only member of the original stage cast who appeared was Winifred Shotter, reprising her stage role as Doris.\"Marry the Girl\", British Film Institute, accessed 3 March 2013"]}]}}