{"wiki_id": "http://www.wikidata.org/entity/Q8020045", "itemLabel": "William Warwick Buckland", "itemDescription": "British scholar of Roman law (1859–1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Warwick_Buckland", "wikipedia_page": {"main": "William Warwick Buckland, FBA (11 June 1859 – 16 January 1946) was a scholar of Roman law, Regius Professor of Civil Law at the University of Cambridge from 1914 to 1945.", "link_mentions": [{"page": "Regius Professor of Civil Law (Cambridge)", "response": ["* William Warwick Buckland (1914)"]}, {"page": "Ascension Parish Burial Ground", "response": ["* William Warwick Buckland, Professor of Law, President of Gonville and Caius College, Regius Professor of Civil Law."]}, {"page": "David Daube", "response": ["Daube's teachers include Otto Lenel, who \"encouraged\" him to take up the study of legal history in the first place, according to Daube's notes in his first published book, Studies in Biblical Law. Daube goes on to thank Professors Johannes Hempel and Wolfgang Kunkel of Göttingen, who trained Daube in rigorous scholarly methods. The influence of C.H. Dodd, whom Daube first met at Cambridge, guided Daube all his life; also at Cambridge, F.S. Marsh and Stanley A. Cook were important influences on Daube. And, finally, Professor William Warwick Buckland: \"to him, in love,\" Daube dedicates his first book."]}, {"page": "Salvius Julianus", "response": ["\"[S]ome modern authorities would regard [Iulianus] as the greatest of all the Roman jurists, not excluding even Papinian.\"H. F. Jolowicz and Barry Nicholas, Historical Introduction to the Study of Roman Law (Cambridge University 1932, by Jolowicz; 3d ed. 1972, by Nicholas) at 385. \"With Iulianus, the Roman jurisprudence reached its apogee.\" Professor William Warwick Buckland and Professor Peter Stein take stock of Iulianus, his rôle and style, and compare him to a great jurist who flourished during the 18th century:The work of Lord Mansfield, who was learned in the civil law derived from the Roman, helped to modernize the commercial law of England, despite his being somewhat 'heritical'. W. S. Holdsworth, Sources and Literature of English Law (Oxford University 1925, 1952) at 218–221. The analogy of Mansfield to Justinian pertains to their leadership rôle."]}, {"page": "William Buckland (disambiguation)", "response": ["*William Warwick Buckland (1859–1946), Roman Law scholar "]}, {"page": "Old Johnians (Hurstpierpoint College)", "response": ["* William Warwick Buckland, jurist"]}, {"page": "Crystal Palace School", "response": ["* William Warwick Buckland"]}, {"page": "Buckland (surname)", "response": ["*William Warwick Buckland (1859–1946), Roman Law scholar"]}, {"page": "List of alumni of Gonville and Caius College, Cambridge", "response": ["*William Warwick Buckland – scholar of Roman Law, Regius Professor of Civil Law (1914–1945)"]}]}}