{"wiki_id": "http://www.wikidata.org/entity/Q8030146", "itemLabel": "Wolfgang Wüster", "itemDescription": "UK-based German herpetologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Wolfgang_W%C3%BCster", "wikipedia_page": {"main": "Wolfgang Wüster (born 1964) is a herpetologist and Reader in zoology at Bangor University, UK.\nWüster attained his bachelor's degree at the University of Cambridge in 1985 and his doctorate at the University of Aberdeen in 1990. His primary areas of research are the systematics and ecology of venomous snakes and the evolution of their venoms. He has  authored approximately 150 scientific papers on varying herpetological subjects. Recent contributions have included descriptions of new species, especially of cobras, several studies into how natural selection drives the evolution of snake venoms, and demonstrating the likely vulnerability of Madagascar's native fauna to the skin toxins of the invasive Asian toad Duttaphrynus melanostictus. He was the scientific editor for The Herpetological Journal (2002–2009), the scientific publication of the British Herpetological Society.\nHe has participated in the description of the following taxa:\n\nNaja mandalayensis Slowinski & Wüster 2000.\nDrymarchon caudomaculatus Wüster, Yrausquin & Mijares-Urrutia 2001.\nLycodon cardamomensis Daltry & Wüster 2002.\nNaja nubiae Wüster & Broadley 2003.\nNaja ashei Wüster & Broadley 2007.\nNaja senegalensis Trape, Chirio & Wüster 2009.\nSubgenus Afronaja Wallach, Wüster & Broadley 2009.\nAcanthophis cryptamydros Maddock, Ellis, Doughty, Smith & Wüster 2015.\nNaja guineensis Broadley, Trape, Chirio, Ineich & Wüster 2018.\nNaja savannula Broadley, Trape, Chirio & Wüster 2018.", "link_mentions": [{"page": "Aspidites", "response": ["Wüster W, Bush B, Keogh JS, O'Shea M, Shine R. 2001. Taxonomic contributions in the \"amateur\" literature: comments on recent descriptions of new genera and species by Raymond Hoser. Litteratura Serpentium 21: 67-91. PDF  at Wolfgang Wüster . Accessed 10 September 2007."]}, {"page": "Gloydius", "response": ["*Taxonomy comparison by Dr. Wolfgang Wüster at Dr. Brian Grieg Fry's Int'l Venom & Toxin Database. Accessed 25 July 2007."]}, {"page": "Crotalus viridis", "response": ["The taxonomic history of this species is convoluted. Previously, seven other C. viridis subspecies were also recognized, including C. v. abyssus, C. v. caliginis, C. v. cerberus, C. v. concolor, C. v. helleri, C. v. lutosus and C. v. oreganus. However, in 2001 Ashton and de Queiroz described their analysis of the variation of mitochondrial DNA across the range of this species. Their results agreed broadly with those obtained by Pook et al. (2000). Two main clades were identified, east and west of the Rocky Mountains, which they argued were actually two different species: on the one hand C. viridis, including the conventional subspecies C. v. viridis and C. v. nuntius, and on the other C. oreganus, including all the other traditional subspecies of C. viridis. The authors retained the names of the traditional subspecies, but emphasized the need for more work to be done on the systematics of C. oreganus.Viperidae - Crotalinae - 2001 Publications. The Arizona subspecies was further split into its own species, Crotalus cerberus.  at Wolfgang Wüster , School of Biological Sciences, Bangor University. Accessed 7 April 2008.Pook CE, Wüster W, Thorpe RS. 2000. \"Historical biogeography of the western rattlesnake (Serpentes: Viperidae: Crotalus viridis), inferred from mitochondrial DNA sequence information\". Molecular Phylogenetics and Evolution 15: 269-282. PDF  at Wolfgang Wüster, School of Biological Sciences, Bangor University. Accessed 11 July 2016."]}, {"page": "Wolfgang Wuster", "response": ["#redirect Wolfgang Wüster"]}, {"page": "Naja ashei", "response": ["The generic name, Naja, is a Latinisation of the Sanskrit word  (), meaning \"cobra\". The specific epithet, ashei, honors the late James Ashe, who founded the Bio-Ken Snake Farm and was one of the first experts to suggest N. ashei was a new species.Beolens, Bo; Watkins, Michael; Grayson, Michael (2011). The Eponym Dictionary of Reptiles. Baltimore: Johns Hopkins University Press. xiii + 296 pp. . (Naja ashei, p. 12). Differences from other spitting  cobras were realized in the 1960s, but N. ashei was initially regarded by most as merely a brown-coloured form of the black-necked spitting cobra (N. nigricollis). Thus, N. ashei was only classified as a distinct species in 2007, by Wolfgang Wüster (Bangor University, Wales) and Donald Broadley (Biodiversity Foundation for Africa). Royjan Taylor (Director of the Bio-Ken Snake Farm in Watamu, Kenya) was instrumental in providing specimens, among them the holotype."]}, {"page": "Wolfgang Wuester", "response": ["#REDIRECT Wolfgang Wüster "]}, {"page": "Black-necked spitting cobra", "response": ["Naja nigricollis previously included two subspecies – Naja nigricollis nigricincta and Naja nigricollis woodi. But genetic studies in 2007 by Wolfgang Wüster etal. have concluded that these subspecies should be treated under a separate species, Naja nigricincta.Wüster, W., S. Crookes, I. Ineich, Y. Mane, C.E. Pook, J.-F. Trape & D.G. Broadley (2007) \"The phylogeny of cobras inferred from mitochondrial DNA sequences: evolution of venom spitting and the phylogeography of the African spitting cobras (Serpentes: Elapidae: Naja nigricollis complex)\". Molecular Phylogenetics and Evolution, 45: 437–453."]}, {"page": "Coastal taipan", "response": ["Analysis of mitochondrial DNA by German herpetologist Wolfgang Wüster and colleagues in 2005 found the Papuan and nominate subspecies to be very similar genetically; however, their distinct coloration and limited sampling led Wüster to refrain from lumping the subspecies into a single taxon."]}, {"page": "Mandalay spitting cobra", "response": ["Naja mandalayensis was first described by herpetologists Wolfgang Wüster and Joseph Bruno Slowinski in 2000. The generic name naja is a Latinisation of the Sanskrit word  () meaning \"cobra\". The specific epithet mandalayensis is Latin and refers to the city of Mandalay, which is a major city within the range of Naja mandalayensis."]}]}}