{"wiki_id": "http://www.wikidata.org/entity/Q8042873", "itemLabel": "Xan Tyler", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Xan_Tyler", "wikipedia_page": {"main": "Xan Tyler is a British pop singer.", "link_mentions": [{"page": "Dubstar", "response": ["In 2002, Blackwood was recruited by ex-Frazier Chorus member Kate Holmes to join her duo Technique, replacing singer Xan Tyler for a European tour with Depeche Mode. Shortly afterwards, Holmes and Blackwood decided to write together and formed a new pseudononymous electropop act, Client (stylised CLIEИT). The duo would not have their faces photographed in promotional photos, with Holmes and Blackwood being referred to Client A and Client B.  Client would chart three singles in the UK, with their biggest, \"Pornography\", getting to number 22 in 2005."]}, {"page": "Client (band)", "response": ["It was confirmed in December 2010 that Blackwood had left the band and a new member was being recruited to front the band. In July 2011, Holmes announced that Xan Tyler—with whom Holmes formed the synthpop duo Technique in the mid-1990s—would take over live lead vocals for the band, replacing Blackwood. However, this never came to fruition."]}, {"page": "Kramer (musician)", "response": ["Joyful Noise Recordings also named Kramer its 2020 Artist-in-Residence, and simultaneously announced a new partnership with Kramer for the rebirth of his Shimmy-Disc label. The first releases by the label are three singles by Kramer's recording project with U.K. vocalist Xan Tyler. Their debut LP performing as Let It Come Down, titled \"Songs We Sang in Our Dreams\", was released on June 12, 2020. The A.I.R. series culminated in a five-LP box set of Kramer projects."]}, {"page": "Technique (band)", "response": ["Technique was a British synthpop band from the mid-1990s featuring Kate Holmes of Frazier Chorus and singer Xan Tyler. The band was named after New Order's 1989 album of the same name, and they were signed to Creation Records, the record label owned by Holmes's husband - Alan McGee."]}, {"page": "Elliott School, Putney", "response": ["* Xan Tyler – pop singer"]}, {"page": "List of vocal trance artists", "response": ["*Xan Tyler"]}, {"page": "Sarah Blackwood", "response": ["Blackwood joined the band Technique to replace Xan Tyler as singer for a European tour with Depeche Mode in 2002. Shortly afterwards, Kate Holmes, the other member of the band, and Blackwood decided to write together and formed the new group Client. She used the stage name Client B since the band preferred not to highlight the names of its members, rather identifying each as \"Client\" plus a letter from the alphabet."]}, {"page": "Authority (album)", "response": ["In July 2011, Holmes introduced Xan Tyler as the new live singer of Client. Both musicians had collaborated before, forming synthpop group Technique in the late 1990s. However, since Client didn't release another album any time soon after the announcement and thus didn't go on tour, the collaboration never happened."]}, {"page": "Let It Come Down (band)", "response": ["Let It Come Down is an American avant-garde art rock band composed of Kramer (founder of Shimmy-Disc) and Xan Tyler on the newly relaunched Shimmy-Disc label, in partnership with Joyful Noise Recordings.", "On April 29 2020, Joyful Noise Recordings named Kramer their 2020 Artist-In-Residence, simultaneously announcing a new partnership with Kramer for the rebirth of his Shimmy-Disc label. The first releases by the newly revived label were to be 3 singles recorded with Xan Tyler under project-name Let It Come Down. The release of this triptych was shortly followed by the duo's debut LP, entitled Songs We Sang In Our Dreams."]}]}}