{"wiki_id": "http://www.wikidata.org/entity/Q8062388", "itemLabel": "Yvie Burnett", "itemDescription": "Scottish operatic mezzo-soprano", "wikipedia_url": "https://en.wikipedia.org/wiki/Yvie_Burnett", "wikipedia_page": {"main": "Yvie Burnett (born 8 August 1963), is a Scottish mezzo-soprano and vocal coach, best known for her work with Simon Cowell on television shows The X Factor and Britain's Got Talent,  The Big Reunion The Voice UK and BBC's Let It Shine\n\n", "link_mentions": [{"page": "August 8", "response": ["*1968 – Yvie Burnett, Scottish soprano"]}, {"page": "List of Aberdonians", "response": ["*Yvie Burnett (born 1963), opera singer, vocal coach and TV personality"]}, {"page": "The X Factor (British series 2)", "response": ["Simon Cowell, Sharon Osbourne and Louis Walsh returned as judges, quashing rumours that Osbourne and Walsh might not return for financial reasons. Kate Thornton also returned as presenter of the main show on ITV and Ben Shephard returned as presenter of spin-off show The Xtra Factor on ITV2. Yvie Burnett joined the show as vocal coach."]}, {"page": "List of Scottish musicians", "response": ["*Yvie Burnett, mezzo-soprano singer and vocal coach"]}, {"page": "Ellon Academy", "response": ["* Yvie Burnett (born 1968) vocal coach The X-Factor Britain's Got Talent"]}, {"page": "Faryl Smith", "response": ["While Smith was competing in Britain's Got Talent, Cowell arranged for her to receive singing lessons from the leading vocal coach Yvie Burnett, who had previously coached Paul Potts, an earlier winner of Britain's Got Talent, as well as Leona Lewis, a winner of The X Factor. The story was broken by The Sunday Mirror; writing for the paper, Lara Gould characterised the lessons as \"secret\". During her participation in the competition, Smith was offered record deals, but she and her family turned them down. Her father, Tony Smith, said \"We have had offers from people interested in Faryl. But when Simon Cowell, the big man, says your daughter is special, you listen.\" Cowell described Smith's potential career during the show, saying \"I know she says Katherine [Jenkins] is her idol but she is far better than her. She is by far the most talented youngster I've ever heard. When she opens her mouth her voice is just incredible.\""]}, {"page": "The X Factor (British series 5)", "response": ["Dermot O'Leary returned to present the main ITV show, choosing to leave other projects, including his ongoing role as the host of Big Brother's Little Brother, to concentrate on The X Factor. The Xtra Factor presenter Fearne Cotton left after series 4, having presented for only one series, to be replaced by Holly Willoughby. Brian Friedman returned as choreographer and performance coach (billed as \"Creative Director\"), along with Yvie Burnett as vocal coach."]}, {"page": "One Voice (Andrew Johnston album)", "response": ["The album was recorded immediately after Johnston finished the Britain's Got Talent live tour over a six-week period in London. The track listing, which contained both religious and popular songs, was chosen by Cowell; Johnston said \"I hadn't sung many of the tracks before. But I knew them all and, anyway, I like a challenge.\" Johnston described recording the album as \"great\", and said \"All I’ve ever wanted to do is go into a studio and record an album and it was everything I’ve ever dreamed of.\" Johnson recorded \"Walking in the Air\" as a duet with fellow Britain's Got Talent contestant Faryl Smith. The recording was finished by September 2008, after which Johnston began to make appearances to publicise the release, including appearances on GMTV, Channel 5 News, BBC Breakfast, This Morning and Radio 2's Friday Night Is Music Night.  Johnston received vocal training from Yvie Burnett, and with whom Smith trained during Britain's Got Talent. The album was produced by Nigel Wright.", "*Yvie Burnette – Vocal production and coaching"]}, {"page": "The X Factor (British series 6)", "response": ["Dermot O'Leary returned to present the main show on ITV, while Holly Willoughby returned as presenter on The Xtra Factor on ITV2. Brian Friedman returned to the show as creative director and Yvie Burnett returned as vocal coach."]}, {"page": "Faryl", "response": ["Smith rose to fame when she, aged 12, competed in the second series of ITV talent show Britain's Got Talent. During the series, she performed \"Ave Maria\" and a cover of Sarah McLachlan's \"Angel\". After her initial performance, she received singing lessons from Yvie Burnett, a move criticised by the press. Although she was at one point the favourite to win, she finished outside the top three in the live final. During the competition, Smith rejected offers of a record deal."]}, {"page": "Jackie Evancho", "response": ["Later in 2010, Evancho performed in 10 cities with the America's Got Talent: Live Tour,Fera, Jessica. \"Jackie Evancho Featured on Oprah Winfrey Show\", WPXI, October 21, 2010, accessed October 12, 2011\"Jackie Evancho's AGT Tour Dates Limited to 10 Cities\", WPXI, September 30, 2010, accessed July 24, 2016 signed a record deal with SYCO music and Columbia Records, and performed in Las Vegas with David Foster.Leach, Robin. \"Exclusive photos: Jackie Evancho rehearses for David Foster & Friends\" , Vegas Deluxe, October 16, 2010, accessed March 12, 2013 From June 2010 until mid-2011, Evancho coached with Yvie Burnett, who has worked with other singers appearing on AGT.The liner notes to Dream With Me, released June 14, 2011, Columbia Records/Syco Music, credit Burnett as vocal coach."]}, {"page": "The X Factor (British series 7)", "response": ["Dermot O'Leary returned for his fourth series as presenter of the main show on ITV, but Holly Willoughby did not return for her third series as presenter on The Xtra Factor on ITV2 and was replaced by Konnie Huq. Brian Friedman returned as creative director, while Ali Tennant and Savan Kotecha were hired as vocal coaches. However, Tennant's contract was ended before the live shows and was replaced by Yvie Burnett, who worked as vocal coach from series 2–6. Richard \"Biff\" Stannard began working as show song producer for Minogue's contestant, and Grace Woodward began working on the show as fashion director."]}, {"page": "The X Factor (British series 9)", "response": ["Dermot O'Leary returned to present the main show on ITV for his sixth series, while Caroline Flack and Olly Murs returned to co-present companion show The Xtra Factor on ITV2, but Murs was absent for the auditions, bootcamp and judges' houses as he was on tour with One Direction in America. In Murs' absence, Flack was joined by guest presenters such as Jedward, JLS and Westlife. Brian Burke returned as creative director, but Elizabeth Honan did not. Brian Friedman, who left as creative director on the show after series 7 in 2010, returned this year, but left after the third live show to work on the live shows of the 2012 series of the American show. Also, Natalya Nair, head of make-up, did not have her contract renewed. Yvie Burnett and Annabel Williams gave vocal coaching during the live shows. This was the final series for Tulisa as a main judge; she left after this series, but reappeared in 2014 to assist Walsh in choosing his groups during judges' houses in series 11, then once more as a guest judge during the final."]}, {"page": "Superstar (British TV series)", "response": ["|Vocal Coach || Yvie Burnett"]}, {"page": "The Big Reunion", "response": ["The show was narrated by former Live & Kicking presenter Andi Peters. During rehearsals for the comeback performance and arena tour, Paul Domaine acted as the bands' choreographer, while Yvie Burnett, who formerly worked on The X Factor and currently works on The Voice UK, acted as their vocal coach."]}, {"page": "The X Factor (British series 10)", "response": ["Dermot O'Leary returned to present the main show on ITV for his seventh series, whilst Caroline Flack came back to present spin-off show The Xtra Factor on ITV2. Olly Murs, Flack's co-presenter for series 8 and 9, wanted to focus on his music career and therefore did not come back. On 29 May, it was announced that comedian Matt Richardson would co-present The Xtra Factor with Flack, after reports that Nick Grimshaw, Dave Berry or Rylan Clark may replace Murs. Flack also presented backstage on the main X Factor programme, during the live shows on Saturdays. Yvie Burnett returned as vocal coach. Brian Burke left as creative director and was replaced by Jerry Reeve and Mark \"Swany\" Hart."]}, {"page": "Opera in Scotland", "response": ["* Yvie Burnett"]}, {"page": "List of vocal coaches", "response": ["* Yvie Burnett"]}, {"page": "Your Face Sounds Familiar (British TV series)", "response": ["The show challenged celebrities to perform as different iconic music artists every week, which were chosen by the show's \"Randomiser\". They were then judged by the panel of celebrity judges including Emma Bunton and Julian Clary. Each week, one celebrity guest judge joined Bunton and Clary to make up the complete judging panel. During the series, the celebrities were trained by vocal coach Yvie Burnett."]}, {"page": "Susan Boyle: An Unlikely Superstar", "response": ["The documentary starts with Susan Boyle preparing for a performance at the Shanghai Grand Stadium as a guest star on China's Got Talent, in front of a live audience of 58,000 people and a television audience of 560 million.  The narrator notes that \"In 2009 the biggest selling album in the world was not by Beyonce or Lady Gaga ...  It was by an unknown, unemployed, lonely woman from Scotland.\"  Many of the songs from her 3rd album \"Someone To Watch Over Me\" play in the background during the documentary, and scenes from the recording studio are included, as she works on the album with her producer and prepares the music with her vocal coach, Yvie Burnett."]}, {"page": "The Big Reunion (series 1)", "response": ["During rehearsals for the comeback performance and arena tour, Paul Domaine acted as the bands' choreographer, while Yvie Burnett, who formerly worked on The X Factor and currently works on The Voice UK, acted as their vocal coach."]}, {"page": "United Kingdom in the Eurovision Song Contest 2015", "response": ["* Yvie Burnettsinger, mezzo-soprano, vocal coach"]}, {"page": "List of Eurovision Song Contest 2015 jurors", "response": ["| Yvie Burnett"]}]}}