{"wiki_id": "http://www.wikidata.org/entity/Q8066776", "itemLabel": "Zarif", "itemDescription": "English singer songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Zarif_(singer)", "wikipedia_page": {"main": "Zarif Davidson, known professionally as Zarif or Mona Lisa Veto, is an English singer-songwriter of Anglo-Scottish-Iranian descent whose music incorporates soul, funk, and pop. She performs with a nine-piece band and sometimes plays keyboard and guitar.", "link_mentions": [{"page": "List of one-word stage names", "response": ["* Zarif, British singer-songwriter"]}, {"page": "V Festival", "response": ["* Zarif"]}, {"page": "List of people associated with University College London", "response": ["* Zarif Davidson, known professionally as Zarif"]}, {"page": "Wireless Festival", "response": ["* Sunday, 5 July: Kanye West, Noisettes, Alesha Dixon, Calvin Harris, N-Dubz, Tinchy Stryder, Q-Tip, Flo Rida, Kid Cudi, Daniel Merriweather, Lady Sovereign, Young Jeezy, Mr Hudson, Chipmunk, Ironik, Example, Florence Rawlings, Zarif, Steve Appleton, The Black and White Years, Diversity, Ratatat"]}, {"page": "The Nextmen", "response": ["In June 2007, The Nextmen released their third studio album This Was Supposed To Be The Future on Antidote Records. It featured vocalists include LSK (faithless) Dynamite MC, Zarif, Alice Russell, Sway, Bridgitte Amofah and Kidz in the Hall. The first single was \"Let It Roll\", featuring Alice Russell. At their album launch, The Nextmen performed as a full 10 piece band, with members of the Part Time Heroes.", "* \"Something Got You\" feat. Zarif (2007, Antidote / Sanctuary)"]}, {"page": "Scarlet's Well", "response": ["They originally started as a studio project, the first four albums featuring a total of ten lead vocalists, including Bid (the only male voice), Zarif and Alice Healey, the latter being the only member other than Bid who has appeared on all albums.", "Previous members included Martin White (The Mystery Fax Machine Orchestra, solo music & comedy), Dickon Edwards (Orlando, Spearmint and Fosca), Kate Dornan (Fosca and The Mystery Fax Machine Orchestra), Toby Robinson and Zarif."]}, {"page": "Danny Byrd", "response": ["*2009 – \"California\" (with Zarif)"]}, {"page": "List of British Iranians", "response": ["* Zarif musician"]}, {"page": "List of Scottish Jews", "response": ["* Zarif, singertheguardian.co.uk New Band of the Day 448: Zarif "]}, {"page": "I Am... World Tour", "response": ["*Zarif (England and Ireland)"]}, {"page": "Let Me Back", "response": ["\"Let Me Back\" is the debut single by UK singer-songwriter Zarif. It was released on 5 April 2009.The Guardian ' You're at the mercy of the audience' It is the first single taken from her debut album Box of Secrets.", "\"Let Me Back\" is written by Zarif, produced by Utters, with additional production by Tommy D who has worked with Kanye West and Corinne Bailey-Rae.RCA: Zarif  It features a sample from the song \"I´m Sorry Babe\" by Kokomo.", "Before the official release date, Zarif gave out free copies of Let Me Back on limited edition pink cassette at her gigs.Zarif's Comic Blog Episode 2  There are official remixes of the song by Toddla T, Paul Jackson, Bobby & Klein, Love to Infinity, Afroganic and Sticky. There is also an acoustic version of the song which was released free, as a download, on Zarif's website.", "The music video for \"Let Me Back\" was released in March 2009 and was directed by Rebel Alliance.Zarif - \"Let Me Back\" Video)", ";UK Digital downloadLet Me Back: Zarif: Amazon.co.uk: MP3 Downloads", "Category:Zarif (singer) songs"]}, {"page": "Box of Secrets (song)", "response": ["\"Box of Secrets\" is the second single by singer/songwriter Zarif and the second single taken from her debut album Box of Secrets. The song contains samples from the song \"Sing, Sing, Sing\" by Louis Prima and the commercial single version contains a rap from Mz Bratt.", "\"Box of Secrets\" originally featured on an advert for Sky1 in 2009 and later was released as a free download for a limited time period. In 2010, it was released as the second single from Zarif's debut album, also titled Box of Secrets on 16 August 2010, following her departure from RCA / Sony BMG. It will be released on her own label, Bright Pink Records. The single and video version of the song features a new rap by British MC Mz Bratt.", "Zarif performed \"Box of Secrets\" on GMTV in 2009.Zarif - Box of Secrets - Live On GMTV", "The music video for \"Box of Secrets\" premiered on 2 June 2010 on Zarif's YouTube account.Zarif - Box Of Secrets Official Video feat. Mz Bratt The video was directed by Andy Hylton and Mz Bratt features in the video.  The video features Zarif walking into a photo booth, which transports her to several 1920s Jazz age scapes.", ";Digital downloadBox of Secrets: Zarif: Amazon.co.uk: MP3 Downloads", "* Zarif on RCA Records' website", "Category:Zarif (singer) songs"]}, {"page": "This Was Supposed to Be the Future", "response": ["This Was Supposed to Be the Future is the third studio album by The Nextmen. It was released in June 2007 on Antidote Records. It was a change in their sound; a prevalence of songs over rap tracks. Ten different vocalists appear on the album. Zarif appears the most, with three tracks, and LSK and Dynamite MC both appear twice. The first single was \"Let It Roll\", featuring Alice Russell. The second single was \"Something Got You\", featuring singer-songwriter Zarif. At their album launch, The Nextmen performed as a full 10 piece band, with members of the Part Time Heroes."]}, {"page": "Something Got You", "response": ["\"Something Got You\" is the second single from the album, This Was Supposed to Be the Future by The Nextmen. The song features singer/songwriter Zarif.", "\"Something Got You\" is one of three songs that Zarif recorded with The Nextmen in 2007, making her the vocalist featured most on the album. The music video was directed by Ricky Tart and was Zarif's first ever video shoot. \"Something Got You\" is track 6 on This Was Supposed to Be the Future.", "Category:Zarif (singer) songs"]}, {"page": "Box of Secrets (Zarif album)", "response": [" Box of Secrets is the debut album by singer-songwriter Zarif. It was released on 30 August 2010.", "Other tracks that feature on the album include \"California\", \"Words\" and \"Summer in your Eyes\", \"Breakout\", \"Silence Room\", \"Seen It All Before\" and \"Can't Do Nothing\". It features production by Tommy D (Corinne Bailey Rae, Kanye West, Jay-Z), Blair Makichan (Lily Allen), Full Phatt (The Rolling Stones, Christina Milian) and Fraser T Smith (Kano, James Morrison).music-house.co.uk: Zarif", "Although Zarif released \"Let Me Back\" on Sony BMG / RCA and recorded the album under that label, Zarif released Box of Secrets on her own imprint, Bright Pink Records.", "* \"Let Me Back\" was released as Zarif's debut single on 5 April 2009. The song features a video directed by Rebel Alliance.", "The track listing for Box of Secrets is as follows:Zarif - Box Of Secrets - CDs at Play.com (UK)", "Category:Zarif (singer) albums"]}, {"page": "Foundation (Breakage album)", "response": ["#\"Over (featuring Zarif)\" – 4:22"]}, {"page": "Redlight (musician)", "response": ["| Zarif"]}, {"page": "Matt Fishel", "response": ["Fishel's sophomore studio album M/F was released internationally by Young Lust Records on 6 July 2018, on limited edition Vinyl, CD, digital download and streaming services. The album was co-produced by Fishel and UK rock producer Lee Batiuk (Deaf Havana) and mastered by Ted Jensen at Sterling Sound, New York. It features a range of guest musicians including Batiuk, London's The Killer Horns, British singer Zarif, Polish singer Ola Bienkowska, and a cheerleading squad. In terms of lyrical inspiration and themes, Fishel told Out magazine that M/F contains songs \"about life from my perspective as an out, proud and happy gay man...politically passionate; in a beautiful, happy relationship; embracing and exploring many aspects of LGBT life whilst on my journey and curiously questioning the world around me and how I fit into it.\" The overall tone is \"positive, upbeat and celebratory, with a little touch of melancholy thrown into the mix every now and then.\" Some of the songs are \"tongue-in-cheek\", others explore \"many of the joys and complexities that can accompany life as a gay man in the modern world, as well as tributes to different elements of LGBTQ culture, past and present.\""]}, {"page": "Zarif", "response": ["Zarif (, ) is a surname and may refer to:", "* Mohammad Javad Zarif (born 1960), Iranian former foreign minister", "* Houshang Zarif (1938–2020), Iranian master musician and renowned tar player", "* Farhad Zarif (born 1983), Iranian volleyball player", "* Munawar Zarif (1940–1976), Pakistani comedian and film actor", "* Farid Zarif (born 1951), United Nations Secretary-General Ban Ki-moon’s Special Representative", "* Omar Zarif (born 1978), Argentine football midfielder", "* Jorge Zarif (born 1992), Brazilian sailor", "* Hajji Muhammad Arif Zarif (1942–2007), Afghan politician"]}, {"page": "Wilkinson (musician)", "response": ["| Zarif"]}, {"page": "Royal Blood (band)", "response": ["* Zarif Davidson – backing vocals, electronic drums (2020–present)"]}, {"page": "Sarah Nagourney", "response": ["| Zarif || \"Silence Room\" || Box of Secrets || Bright Pink Records"]}, {"page": "List of stage names beginning with Z", "response": ["|Zarifa Mgoyan", "|Zarif", "|Zarif Davidson"]}]}}