{"wiki_id": "http://www.wikidata.org/entity/Q8066246", "itemLabel": "Zanny Minton Beddoes", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Zanny_Minton_Beddoes", "wikipedia_page": {"main": "Susan Jean Elisabeth \"Zanny\" Minton Beddoes (born July 1967) is a British journalist. She is the editor-in-chief of The Economist, the first woman to hold the position. She began working for the newspaper in 1994 as its emerging markets correspondent.", "link_mentions": [{"page": "The Economist", "response": ["*Zanny Minton Beddoes: 2015–present", "Letters published in the paper are typically between 150 and 200 words long and had the now-discontinued salutation 'Sir' from 1843 to 2015. In the latter year, upon the appointment of Zanny Minton Beddoes, the first female editor, the salutation was dismissed; letters have since had no salutation. Previous to a change in procedure, all responses to online articles were usually published in \"The Inbox\"."]}, {"page": "List of newspapers in the United Kingdom", "response": ["|Zanny Minton Beddoes"]}, {"page": "St Hilda's College, Oxford", "response": ["Zanny Minton Beddoes World Economic Forum 2013 cropped.jpg| Zanny Minton Beddoes, editor of The Economist", "* Zanny Minton Beddoes, editor of The Economist"]}, {"page": "The Economist Group", "response": ["The current members of the board of directors of The Economist Group are: Rupert Pennant-Rea (Chairman), Zanny Minton Beddoes (editor-in-chief of The Economist), Lady Suzanne Heywood, Brent Hoberman,  David Bell, John Elkann, Alex Karp, Sir Simon Robertson, Lady Lynn Forester de Rothschild, Chris Stibbs and Baroness Jowell."]}, {"page": "List of Bilderberg participants", "response": ["* Zanny Minton Beddoes (2016), Editor-in-Chief, The Economist"]}, {"page": "1967 in the United Kingdom", "response": ["* Zanny Minton Beddoes, financial journalist"]}, {"page": "Tom Standage", "response": ["Tom Standage (born 1969)STANDAGE, Thomas William, Who's Who 2015, A & C Black, 2015; online edn, Oxford University Press, 2014 is a British journalist, author, and editorial executive currently serving as the Deputy Editor of The Economist newspaper under editor-in-chief, Zanny Minton Beddoes. As head of the newspaper's digital strategy, Standage is the editor-in-chief of The Economist's website, applications, and digital platform. He first joined the paper in 1998 as a science correspondent from where he was successively appointed technology editor, business editor, and finally, digital editor."]}, {"page": "Beddoes", "response": ["* Zanny Minton Beddoes (born 1967), British journalist"]}, {"page": "List of Question Time episodes", "response": ["|Jeremy Hunt, Tristram Hunt, Nigel Farage, Zanny Minton Beddoes, Brian May", "|Sajid Javid, Lisa Nandy, Zanny Minton Beddoes, Charlie Wolf, Huey Morgan3 November 2016: Businessman and UKIP donor Arron Banks was originally scheduled to be on the panel, but was replaced by Charlie Wolf.", "|Liam Fox, Stella Creasy, Zanny Minton Beddoes, Kerry-Anne Mendoza, Nick Ferrari", "|James Cleverly, Keir Starmer, Zanny Minton Beddoes, Michael Dobbs, Nish Kumar", "|Brandon Lewis, Andy McDonald, Caroline Lucas, Zanny Minton Beddoes, Lionel Shriver"]}, {"page": "List of University of Oxford people with PPE degrees", "response": ["* Zanny Minton Beddoes, Editor-in-chief of The Economist magazine"]}]}}