{"wiki_id": "http://www.wikidata.org/entity/Q80712", "itemLabel": "Michael Keane", "itemDescription": "English association football player, born 1993", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Keane_(footballer,_born_1993)", "wikipedia_page": {"main": "Michael Vincent Keane (born 11 January 1993) is an English professional footballer who plays as a centre-back for Premier League club Everton and the England national team.\nKeane began his career at Manchester United and was named as their Reserves Player of the Year in 2012, but was loaned out several times, latterly to Burnley who signed him on a permanent basis in January 2015. He was part of their team which won the 2015–16 Football League Championship prior to his transfer to Everton in 2017.\nKeane has represented the Republic of Ireland at under-17 and under-19 levels and England at under-19, under-20, under-21 and senior levels.", "link_mentions": [{"page": "January 11", "response": ["*1993 – Michael Keane, English footballer"]}, {"page": "Burnley F.C.", "response": ["The club's highest home attendance is 54,775, for an FA Cup third round match against Huddersfield Town on 23 February 1924; Burnley's record home attendance in the league is 52,869, for a First Division game against Blackpool on 11 October 1947. The highest transfer fees received are the £25 million from Everton and Newcastle United for defender Michael Keane in 2017 and forward Chris Wood in 2022, respectively. The highest transfer fee paid by the club was both for Wood from Leeds United in 2017 and for defender Ben Gibson from Middlesbrough in 2018. The pair were bought for a fee of £15 million each. Bob Kelly broke the world transfer record in 1925, when he moved from Burnley to Sunderland for £6,500 (equivalent to £ in )."]}, {"page": "FA Youth Cup", "response": ["| Michael Keane"]}, {"page": "List of Everton F.C. players", "response": ["|align=\"left\"|Michael Keane||||DF||2017–||132||8||"]}, {"page": "St Bede's College, Manchester", "response": ["* Michael Keane – Everton and England footballer"]}, {"page": "Phil Jagielka", "response": ["After finding himself on the periphery of the Everton first team for most of the 2018–19 season, an illness to Michael Keane in the warm-up before a match against Arsenal on 7 April 2019 saw Jagielka replace him in the starting line-up. Jagielka went on to score the only goal in the 10th minute which was his first Everton goal for two years. In doing so, and at the age of 36 years and 233 days, he became the second-oldest player to score for Everton in the Premier League era, behind Richard Gough."]}, {"page": "Merseyside derby", "response": ["Current scorers: Current players with multiple derby goals include Liverpool's Divock Origi (5), Sadio Mané and Mohamed Salah (4 each), and Everton's Michael Keane, Richarlison and Gylfi Sigurðsson (2 each). "]}, {"page": "1993 in the United Kingdom", "response": ["* 11 January – Michael Keane, footballer"]}, {"page": "List of Everton F.C. records and statistics", "response": ["|align=\"left\"| Michael Keane||align=\"left\"| Burnley||£25M||2017"]}, {"page": "List of sportspeople who competed for more than one nation", "response": ["|Michael Keane"]}, {"page": "Manchester United F.C. Reserves and Academy", "response": ["* Michael Keane", "|2011–12 || Mats Møller Dæhli || Michael Keane"]}, {"page": "Keane (surname)", "response": ["*Michael Keane (footballer, born 1982), a former Irish footballer", "*Michael Keane (footballer, born 1993), an English footballer who plays for Everton", "*Michael Keane (economist) (born 1961), Nuffield Professor of Economics at University of Oxford"]}, {"page": "List of people from Stockport", "response": ["*Michael Keane, professional football player playing for Everton F.C., twin brother of Will"]}, {"page": "Gylfi Sigurðsson", "response": ["Gylfi started the 2018–19 season with Everton with an assist to Michael Keane in a friendly match against Valencia, while losing the match 2–3. On 29 September 2018, he scored his first brace with the club in a 3–0 victory against Fulham. On 26 December 2018, he assisted and scored a penalty in a 5–1 victory against Burnley."]}, {"page": "List of Burnley F.C. records and statistics", "response": ["The record for most games played for the club is held by Jerry Dawson, who made 569 appearances between 1907 and 1928. George Beel scored 188 goals during his Burnley career, and is the club's record goalscorer. Jimmy McIlroy made 51 appearances for Northern Ireland and so is the player who has gained the most caps while with the club. The highest transfer fees paid by the club are the £15 million paid to Leeds United and Middlesbrough for Chris Wood and Ben Gibson in 2017 and 2018 respectively. The highest fees received are the £25 million paid by Everton and Newcastle United for Michael Keane and Wood in 2017 and 2022 respectively. The highest attendance recorded at Turf Moor was 54,775 for the visit of Huddersfield Town in a third round FA Cup match in 1924."]}, {"page": "James Tarkowski", "response": ["On 1 February 2016, Tarkowski signed a three-and-a-half-year contract with Championship club Burnley for an undisclosed fee. Tarkowski made his club debut on 20 February against Rotherham United, entering as a substitute in the first half for Michael Keane, who was forced off with a head injury. Tarkowski deputised for Keane for the next two games, with Burnley victorious against Nottingham Forest and Bolton Wanderers. However, Keane was preferred by manager Sean Dyche at right centre-back upon his return to fitness as Tarkowski was limited to one substitution appearance the rest of the season. In third position in the table at the time of Tarkowski's signing, Burnley went unbeaten the rest of the season as they won their third ever second-tier title and direct promotion to the Premier League on their first attempt.", "During the summer transfer window, teammate Michael Keane departed for Everton, allowing Tarkowski to line up with Mee in the center of Burnley's defence on a full-time basis. Assigned the shirt number 26 initially, Tarkowski assumed the number 5 shirt vacated by Keane ahead of the season. Tarkowski's performance against Crystal Palace on 10 September was deemed Man of the Match worthy by Sky Sports, as Tarkowski held Benteke and Palace without a goal. His 17 clearances in the match were the most by anyone in the Premier League that season, besting a mark previously held by himself in Burnley's surprise opening day victory over Chelsea."]}, {"page": "Derby County F.C.–Leicester City F.C. rivalry", "response": ["* Michael Keane – loaned to Leicester City, and later Derby County, from Manchester United"]}]}}