{"wiki_id": "http://www.wikidata.org/entity/Q809100", "itemLabel": "Barry Stokes", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Stokes_(actor)", "wikipedia_page": {"main": "Barry Stokes is a British actor.His film credits include: Juan Antonio Bardem's The Corruption of Chris Miller, The Ups and Downs of a Handyman, Prey, Outer Touch, Hawk the Slayer, Rendezvous in Paris and Enemy Mine.Television appearances include: \nTom Brown's Schooldays (as Brooke), Dixon of Dock Green, Z-Cars, UFO, Space: 1999, Survivors, The Professionals and Reilly, Ace of Spies. The Prince and the Pauper 1976 (TV Series).", "link_mentions": [{"page": "Survivors (1975 TV series)", "response": ["* Barry Stokes as Tom Walter (ep. 12)"]}, {"page": "Godspell", "response": ["Godspell opened at the Roundhouse Theatre in Chalk Farm, London on November 17, 1971. This London production featured Jacquie-Ann Carr, Julie Covington, David Essex, Neil Fitzwiliam, Jeremy Irons, Verity-Anne Meldrum, Deryk Parkin, Tom Saffery, Gay Soper, and Marti Webb. After a successful run at the Roundhouse Theatre, the production transferred to the Wyndham's Theatre, also in London, on January 26, 1972.with Barry Stokes \"'Godspell'\", Thebeautifulchanges.co.uk. with Barry Stokes."]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, John Nolan as Geoff Hardcastle, Jean Trend as Dr Fay Chantry, Vivien Sherrard as Barbara Mason, Bernard Hepton as Oscar Franklin, Patsy Byrne as Mary Franklin, Martin Howells as Jenkins, Barry Stokes as Stephen Franklin, David Janson as MacPherson, Robert Yetzes as Painton, Olaf Pooley as Ensor, Colin Jeavons as Botting, David Jarrett as Avery, Sally Thomsett as Judy Franklin, Julie May as Woman Shopper, Paula Smith as Ground Hostess, Patrick Milner as Airport Policeman."]}, {"page": "Waldo de los Ríos", "response": ["*The Corruption of Chris Miller (1973), with Jean Seberg, Barry Stokes"]}, {"page": "Voyager's Return", "response": ["* Jim Haines - Barry Stokes"]}, {"page": "List of The Professionals episodes", "response": ["| David Collings, Pamela Stephenson, Barry Jackson, Tony Osoba, Ronald Leigh-Hunt, Brian Hawksley, Barry Stokes, Trevor Adams"]}, {"page": "Gay Soper", "response": ["Soper's film roles include appearances in the British sex comedies Love Is a Splendid Illusion (1970) and The Ups and Downs of a Handyman (1975), opposite her then-husband Barry Stokes. She also featured in the 2004 film version of A Christmas Carol with Kelsey Grammer."]}, {"page": "Lady Oscar (film)", "response": ["Catriona MacColl stars as the eponymous Oscar François de Jarjayes, with Barry Stokes as her lover André Grandier, alongside Jonas Bergström, Christine Böhm, Mark Kingston, Georges Wilson, Sue Lloyd, Martin Potter, and Anouska Hempel. A young Lambert Wilson appears in a minor role."]}, {"page": "Stokes (surname)", "response": ["*Barry Stokes (born 1973), American football offensive lineman", "*Barry Stokes, British actor"]}, {"page": "List of science fiction films of the 1970s", "response": ["|Prey||Norman J. Warren||Barry Stokes, Sally Faulkner, Glory Annen Clibbery||United Kingdom||", "|Outer Touch||Norman J. Warren||Barry Stokes, Tony Maiden, Glory Annen Clibbery||United Kingdom||"]}, {"page": "List of British films of 1975", "response": ["|The Ups and Downs of a Handyman||John Sealey||Barry Stokes, Penny Meredith||Sex comedy||"]}, {"page": "List of British films of 1977", "response": ["|Prey|| Norman J. Warren || Barry Stokes, Glory Annen || Science fiction ||"]}, {"page": "List of French films of 1979", "response": ["|Lady Oscar||||Catriona MacColl, Barry Stokes, Christina Böhm|| ||Japanese-French co-production"]}, {"page": "List of Japanese films of 1979", "response": ["|Lady Oscar||||Catriona MacColl, Barry Stokes, Christina Böhm|| ||Japanese-French co-production"]}, {"page": "The Last Days of Pompeii (miniseries)", "response": ["| Barry Stokes"]}, {"page": "List of German films of the 1980s", "response": ["| Rendezvous in Paris ||  || Claude Jade, , Barry Stokes || Thriller || French-West German co-production"]}, {"page": "Fanny Hill (1983 film)", "response": ["* Barry Stokes - Charles (as Jonathan York)"]}, {"page": "Rendezvous in Paris", "response": ["Rendezvous in Paris is a 1982 Franco-German film directed by Gabi Kubach and starring Claude Jade, Harald Kuhlmann and Barry Stokes. It is based on a 1935 novel by Vicki Baum.", "In Berlin in 1930, sensitive Evelyne Droste (Claude Jade) leads a sheltered life married to respectable lawyer Kurt (Harald Kuhlmann). The children are cared for by a governess and a nanny, and she feels somehow superfluous and unfulfilled on a personal level. But when she meets the American Frank Davies (Barry Stokes) at a party, her passion and vitality return. Evelyn finally agrees to Frank's invitation for a weekend in Paris. But while Evelyn puts her middle-class life on the line, for Frank it is perhaps only an adventure ...", "* Barry Stokes - Frank Davis"]}, {"page": "Romance on the Orient Express", "response": ["*Barry Stokes as Flavio"]}, {"page": "The Ups and Downs of a Handyman", "response": ["The Ups and Downs of a Handyman is a 1976 British comedy film directed by John Sealey and starring Barry Stokes, Sue Lloyd and Bob Todd.Fvdb.bfi.or.uk Its alternative titles at various times have been Confessions of a Handyman, Confessions of an Odd-Job Man and The Happy Housewives.", "* Barry Stokes as Bob", "The Radio Times noted \"another cheap-and-cheerful sex comedy in the vein of Timothy Lea's naughty bestsellers. Barry Stokes brings a certain cheeky charm to the title role, while Gay Soper, Sue Lloyd and Valerie Leon find him plenty to do around the house. What little comedy there is comes from Benny Hill stalwart Bob Todd, as the local magistrate, and Chic Murray, as a harassed bobby. Derrick Slater's script is one long smutty gag, while John Sealey's direction is perfunctory at best.\""]}, {"page": "Barry Stokes", "response": ["Barry Stokes may refer to:", "* Barry Stokes (American football) (born 1973), American football offensive lineman ", "* Barry Stokes (actor), British actor"]}, {"page": "List of horror films of 1977", "response": ["| Barry Stokes, Glory Annen, Sally Faulkner"]}, {"page": "Outer Touch", "response": ["Outer Touch (also known as Spaced Out, Outer Reach or Outer Spaced) is a 1979 British science fiction sex comedy film directed by Norman J. Warren. It stars Glory Annen, Barry Stokes and Ava Cadell.", "*Barry Stokes as Oliver", "Production began on 22 January 1979 and ran for four weeks. The film was largely shot at Twickenham Studios and Bray Studios with the outdoor opening scenes being filmed on location in Marble Hill Park, Twickenham. The section of spaceship that appears in the park scenes was created with scaffolding covered with plastic sheets. The way in which these scenes were lit was meant as a pastiche of Close Encounters of the Third Kind. The scale model shots of the ship in flight were taken from the TV series Space: 1999. Due to the variety of shots used the appearance of the ship changes over the course of the film. Warren said that Barry Stokes, whom he had first directed in Prey (1977), based his performance partly on Christopher Reeve's portrayal of Clark Kent in Superman (1978)."]}, {"page": "Prey (1977 film)", "response": ["Prey (known as Alien Prey in some markets) is a 1977 British independent science fiction horror film produced by Terry Marcel and directed by Norman J. Warren. The plot concerns a carnivorous alien (Barry Stokes) landing on Earth and befriending a lesbian couple (Glory Annen and Sally Faulkner) as part of his mission to evaluate humans as a source of food. It was filmed in under two weeks on a budget of less than £60,000 (approximately £ in ) in various locations near Shepperton Studios in Surrey. It had a limited distribution on release.", "*Barry Stokes as Kator and Anderson", "Warren agreed to shoot the film in ten days starting on 23 May, giving him just three weeks for pre-production. He remembers that during this time \"everyone was working flat out – there wasn't any sitting around waiting.\" The cast were supplied by a single talent agency, which also invested in the film: CCA Management, founded by Howard Pays. Prey was the film debut of Glory Annen, who had graduated from drama school the year before. She and Barry Stokes later appeared in Outer Touch (1979), also directed by Warren. Not all of the cast were professional actors: Sandy Chinney was the girlfriend of the second assistant director, while the two girls who appear in the final scene were played by Marcel's daughters. Due to budget constraints, some of the cast, including Annen, supplied their own wardrobe."]}, {"page": "The Rose of Versailles", "response": ["Lady Oscar, a live-action film adaptation of The Rose of Versailles, was released in Japan on March 3, 1979. The film was directed by Jacques Demy, and stars Catriona MacColl as Oscar and Barry Stokes as André."]}, {"page": "The Corruption of Chris Miller", "response": ["The Corruption of Chris Miller (Spanish: La corrupción de Chris Miller, also released as Behind the Shutters) is a 1973 Spanish thriller film directed by Juan Antonio Bardem and starring Jean Seberg, Marisol and Barry Stokes.Bentley p.162", "* Barry Stokes as Barney Webster  "]}, {"page": "The Guns and the Fury", "response": ["*Barry Stokes - Paul Halders "]}, {"page": "Destruction (UFO)", "response": ["* Barry Stokes — Sky Diver engineer\t"]}]}}