{"wiki_id": "http://www.wikidata.org/entity/Q809094", "itemLabel": "Barry Ryan", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Ryan_(singer)", "wikipedia_page": {"main": "Barry Ryan (born Barry Sapherson; 24 October 1948 – 28 September 2021), and also known as  Barry Davison, was a British pop singer and photographer. He achieved his initial success in the mid 1960s in a duo with his twin brother Paul. After Paul ceased performing to concentrate solely on songwriting, Barry became a solo artist. Barry's most successful hit, \"Eloise\", reached number 2 on the UK Singles Chart in 1968.\nIn the mid-1970s, Barry began his 40-year career as a fashion and portrait photographer. He worked for magazines such as such as Italian Vogue and David Bailey’s Ritz; he sold six photographs to the National Portrait Gallery; and he made portraits of celebrities such as Ronald Reagan, Margaret Thatcher, Stephen Hawking, Sting, Paul McCartney, and Björk.\n\n", "link_mentions": [{"page": "The Damned (band)", "response": ["In January 1986, the non-album single \"Eloise\", a cover of a 1968 hit by Barry Ryan, was a No. 3 chart success in the UK, the group's highest chart placing to date."]}, {"page": "1968 in music", "response": ["*\"Eloise\" – Barry Ryan"]}, {"page": "Dana Rosemary Scallon", "response": ["Scallon's debut album All Kinds of Everything, recorded at Decca Studios in West Hampstead, London, on the weekend of 25 April 1970, was released in June and included four tracks co-written by the singer, as well as a new recording of the album's title track. Her follow-up single was issued in September, but Jerry Lordan's \"I Will Follow You\" failed to chart. The song that put an end to her one-hit wonder status was found on the album Barry Ryan 3. \"Who Put the Lights Out\", written by Paul Ryan for his twin brother, was offered to her by their stepfather Harold Davison, the business partner of her agent Dick Katz. Her version, cut with Barry Ryan's producer Bill Landis, proved a strong comeback vehicle reaching #5 in Ireland. In the UK it became a #14 hit on 13 March 1971. There then followed three years of unsuccessful singles broken only by the Irish chart showing of \"Sunday Monday Tuesday\", a #4 hit in December 1973. This lack of success caused her agent to recommend she join the former head of Bell Records Dick Leahy on his new label, GTO Records."]}, {"page": "Today", "response": ["* \"Today\", by Barry Ryan"]}, {"page": "Max Clifford", "response": ["After Gillingham left EMI, he asked Clifford to join him at Chris Hutchins's PR agency. Among the artists they represented were Paul and Barry Ryan, who introduced Clifford to their stepfather, impresario Harold Davidson, who handled the UK affairs of Frank Sinatra and Judy Garland.", "In 1970, aged 27, and after Gillingham retired, Clifford left Hutchins and started his own agency, Max Clifford Associates. Based in the offices of Joe Cocker's manager, he started off by representing Sinatra, Cocker, Paul and Barry Ryan, Don Partridge, and Marvin Gaye. He later also represented Muhammad Ali and Marlon Brando."]}, {"page": "List of twins", "response": ["* Paul (1948–1992) and Barry Ryan (1948–), formed the group Paul and Barry Ryan"]}, {"page": "The Hollies", "response": ["In mid-February 1967, Bobby Elliott collapsed on stage due to an inflamed appendix. The Hollies were forced to continue their touring commitments without him, using Tony Mansfield, Dougie Wright and Tony Newman as stand-ins for further live dates, and Wright, Mitch Mitchell and Clem Cattini when they began recording for their next album, Evolution, which was released on 1 June 1967, the same day as the Beatles' Sgt Pepper's Lonely Hearts Club Band. It was also their first album for their new US label Epic, and reached No. 13 in the UK and No. 43 in the US. The US version included the single \"Carrie Anne\". In addition, The Searchers and Paul & Barry Ryan each had a minor UK chart hit covering the Evolution song \"Have You Ever Loved Somebody\" in 1967."]}, {"page": "Ibrahim of Johor", "response": ["# Marcella Mendl (1915–1982), daughter of Edgar Mendl from Romania and cousin of British diplomat Sir Charles Mendl.Time Magazine Upon converting to Islam, she took the name Fawzia binti 'Abdu'llah and was known as Lady Marcella Ibrahim (1940–1955) and Her Highness Sultana Fawzia binti 'Abdu'llah (1955–1982). Married in 1940, they had one daughter, Tunku Miriam binti al-Marhum Sultan Sir Ibrahim (born 18 September 1950)Magazine (married, 1976–1980, to British rock star Barry Sapherson, aka Barry Ryan) Besides Malay, she was fluent in several European languages such as German, French, and English.Feir 2014 Google.com."]}, {"page": "Chris Curtis", "response": ["At the same time Curtis produced recordings of Paul and Barry Ryan for their stepfather, Harold Davidson. Graham Nash had given him the song \"Have You Ever Loved Somebody?\" and he got them to sing it backed by Ten Feet, a Welsh group whom he was also producing. Pye Records asked Curtis to delay the release of the Ryans' version so that the Searchers could release it. Curtis did not want to help his old band, however, and with the help of Harold Davidson the Ryans released the single in the week of 12 September 1966 and played it on 'Ready, Steady, Go' on 7 October. Curtis also wrote \"Night Time\" for the Ryans with his friend Sharon Sheeley and they collaborated on several other songs."]}, {"page": "Sharon Sheeley", "response": ["Following the accident she returned to the US, where she collaborated with musician-songwriter Jackie DeShannon on a string of hits, including Brenda Lee's \"Dum Dum\" and \"Heart in Hand\", The Fleetwoods' \"He's the Great Imposter\" and Irma Thomas's \"Breakaway\". She also co-wrote songs with Chris Curtis of The Searchers, including \"Night Time\" recorded by Paul and Barry Ryan."]}, {"page": "Paul Ryan (singer)", "response": ["Born in Leeds, West Riding of Yorkshire, England, Paul and his twin brother Barry were the sons of singer Marion Ryan, and had some success as a singing duo during the 1960s, known simply as \"Paul & Barry Ryan\".  However, the stress of public attention caused Paul to retreat into the background,  while Barry went solo. Paul Ryan wrote Barry's 1968 hit \"Eloise\", the 1971 hit \"Who Put the Lights Out?\" for Dana and another of his songs, \"I Will Drink the Wine\", was a UK hit single for Frank Sinatra.", "*\"Eloise\" - Barry Ryan"]}, {"page": "Little Anthony and the Imperials", "response": ["*  \"Better Use Your Head\", the Imperials' 1966 transatlantic hit, has been covered by Barry Ryan, Robin Wilson, Dennis D'ell, and Marion Ryan."]}, {"page": "Phantasmagoria (The Damned album)", "response": ["After much wrangling, the Damned received a new contract with MCA Records in October 1984 on the strength of the song \"Grimly Fiendish\",\"Smashing It Up: A Decade of Chaos with the Damned by Kieron Tyler issued as a single the following March. They recorded the album in Eel Pie Studios between March and June 1985. It reached No. 11 in the charts, and was the band's highest charting album ever, until the release of Evil Spirits in 2018, which cracked the top-ten at No. 7. The non-album single \"Eloise,\" (a Barry Ryan cover), released six months later, became a huge UK hit, reaching No. 3."]}, {"page": "Junior Campbell", "response": ["He then went on to study orchestration and composition with Eric Gilder and Max Saunders at the Royal College of Music and became an arranger and record producer for many artists as diverse as Miller Anderson, (Bright City, 1971), Matthews Southern Comfort, Barry Ryan, The Tremeloes, Freddie Starr and Barbara Dickson, arranging and producing her first hit single and album, \"Answer Me\". He also arranged and conducted Dickson's performances in her first-season run on the BBC Television series The Two Ronnies in 1976."]}, {"page": "Goodbye", "response": ["* \"Goodbye\", by Barry Ryan, 1968"]}, {"page": "Two Yanks in England", "response": ["*\"Have You Ever Loved Somebody?\" (1967, Evolution album track, also released by The Searchers and Paul and Barry Ryan in 1966) "]}, {"page": "List of Decca Records artists", "response": ["* Paul & Barry Ryan"]}, {"page": "Howard Kaylan", "response": ["In 2006, Kaylan released a solo album, Dust Bunnies, described as songs \"hand-picked by Kaylan from years of seldom-heard B-sides and album cuts recorded by many of his favorite artists and supplemented by new arrangements of more familiar pieces and a rock original or two.\" It includes covers of The Honeycombs' \"Have I the Right?\", Barry Ryan's \"Eloise\", and The Left Banke's \"Love Songs in the Night\" and \"Two by Two\"."]}, {"page": "Eloise (Paul Ryan song)", "response": ["\"Eloise\" is a song first released in 1968 on the MGM label. It was sung by Barry Ryan, and written by his twin brother Paul Ryan. Running for over five minutes, it featured strong orchestration, melodramatic vocals, and a brief slow interlude. It sold three million copies worldwide, and reached No. 2 in the UK Singles Chart as published by Record Retailer, but hit No. 1 in the NME and Melody Maker charts. It topped the chart in 17 countries, including Italy, the Netherlands50 Jaar Nummmer 1 Hits, Johan van Slooten, 2006 and Australia.", "The single was released as \"Barry Ryan with the Majority\". The Majority were a pop band, who for a period, were the backing band for Ryan and who, after renaming to Majority One, had some success in Europe. Ryan also released an Italian-language version of the song, \"Eloise (Versione Italiana)\", in 1968.", "According to Barry Ryan, the record influenced Freddie Mercury of Queen.  He said in a 2017 interview: \"I remember reading Freddie’s memoirs. He was influenced by it. He really, really liked it and also he used it as an argument to release 'Bohemian Rhapsody' because his record company didn’t want to release it but he said “That Barry Ryan had a big five and half minute hit. Why can’t we do it too?”\" Jason Barnard, \"Barry Ryan Interview\", The Strange Brew, 2017. Retrieved 30 september 2021", "At the same time, a version of \"Eloise\" by Far Corporation singer Robin McAuley was released. McAuley said that the Damned's version had \"got absolutely no chance of making it in the charts\". Of the two competing versions at the time, Barry Ryan said that \"I like the Damned's version best, it's even better than mine\"."]}, {"page": "List of songs about Los Angeles", "response": ["* \"L.A. Woman\" by Barry Ryan"]}, {"page": "Wild World (song)", "response": ["* 1971: Barry Ryan"]}, {"page": "Clem Cattini", "response": ["In 1965 he became a session musician, drumming on tracks by the Kinks, Herman's Hermits, Dusty Springfield, the Merseys, Bee Gees, Lulu, Marianne Faithfull, Tom Jones, P. J. Proby, the Hollies, Paul and Barry Ryan, Gene Pitney, Donovan, Love Affair, Jeff Beck, Engelbert Humperdinck, Nirvana, the Ivy League, Edison Lighthouse, the Yardbirds, the Family Dogg, Marc Bolan, Clodagh Rodgers, Keith West, the Flower Pot Men, Georgie Fame, Roy Harper, Ralph McTell, Harmony Grass, Joe Cocker, Graham Gouldman and Brian Auger. In the 1970s, he played on recordings by Marvin, Welch & Farrar, Lou Reed, Cliff Richard, Justin Hayward, Phil Everly, Julie Covington, Claire Hamill, Alvin Stardust, Bay City Rollers, Kenny, the Wombles, Brotherhood of Man, Carl Douglas, Christie, Tim Rose, Demis Roussos, the Goodies, Stephanie de Sykes, John Betjeman, Malcolm and Alwyn, John Schroeder, Paul McCartney, Hank Marvin, Mike Batt, Chris Spedding, Bob Downes, Dave Kelly, Sweet Dreams, Christopher Neil, Evelyn Thomas, Barbara Pennington, Slapp Happy, Apollo 100, Mike Berry and Grace Kennedy, and prog rock bands including Beggars Opera, Amazing Blondel and Edwards Hand."]}, {"page": "Evolution (Hollies album)", "response": ["The song \"Have You Ever Loved Somebody?\" was released earlier (in September 1966) both by the Searchers and Paul and Barry Ryan as single a-sides. It was first released by the Everly Brothers on their Two Yanks in England album."]}, {"page": "Les Reed (songwriter)", "response": ["| Paul and Barry Ryan", "| Paul and Barry Ryan", "| Paul and Barry Ryan"]}, {"page": "List of people from Leeds", "response": ["* Paul & Barry Ryan - pop singing duo; Barry had a solo career after Paul withdrew to songwriting"]}, {"page": "Orange Bicycle", "response": ["Orange Bicycle was an English psychedelic pop band, which existed between 1967 and 1971. The band played a style influenced by The Beach Boys, The Beatles, The Rolling Stones and the hippie counter culture. Previously, they acted as support, and backing band for the duo Paul and Barry Ryan as well as completing sessions for other vocalists, recording over 100 BBC Radio One sessions and appearing on UK TV."]}, {"page": "List of NME covers", "response": ["*20/09/69 Dusty Springfield (advert for \"Am I the Same Girl\"), and Barry Ryan (advert for \"The Hunt\")", "*31/01/70 Barry Ryan"]}, {"page": "Star Parade", "response": ["|Roy Black, Manuela, Barry Ryan", "|Cindy & Bert, Joe Dassin, Karel Gott, Dagmar Koller, Manuela, Edina Pop, Barry Ryan, Paul Ryan, Ambros Seelos"]}, {"page": "Night of the Proms", "response": ["* Barry Ryan (1993)"]}, {"page": "List of number-one singles in Australia during the 1960s", "response": ["|align=\"center\" rowspan=3|Barry Ryan"]}, {"page": "John Pantry", "response": ["Pantry released one solo disc in the early 1970s (which has not been reissued as of this date) before delving into the world of Christian music. Prior to that, he had been a studio engineer for IBC Studios (working with Eddie Tre-Vett), engineering for Southern Comfort, The Small Faces, The Bee Gees, Manfred Mann's Earth Band, Shindig, The New Seekers, Pentangle and Barry Ryan. He was also a member of Peter & The Wolves, an accomplished mid 1960s pop group from Leigh-on-Sea/Southend and had a major hand with many other IBC studio projects of the time: the Factory, Sounds Around, Wolfe, The Bunch and Norman Conquest."]}, {"page": "Barry Ryan", "response": ["Barry Ryan may refer to:", "*Barry Ryan (singer) (1948-2021), English pop singer and photographer", "*Barry Ryan (footballer) (born 1978), Irish footballer", "*Barry Ryan (Catholic priest) (born 1948)"]}, {"page": "Sixties Power Ballads", "response": ["#Barry Ryan - \"Eloise\" (1968)"]}, {"page": "List of number-one hits of 1969 (Germany)", "response": ["|  18 January  || rowspan=\"6\" | \"Eloise\" || rowspan=\"6\" |  Barry Ryan"]}, {"page": "List of number-one singles from 1968 to 1979 (Switzerland)", "response": ["| 17 December || bgcolor=#FFFF99 | \"Eloise\"Swiss Music Chart Year-End (1969) (1969) || Barry Ryan || 6"]}, {"page": "How the Web Was Woven", "response": ["Like other ballads selected for Presley over this period, \"How the Web Was Woven\" is a love song with a dark theme.Simpson, pp. 144–45. It was also typical of the material sourced from Carlin's songwriters in terms of its European pop style, dramatic mood and dense musical arrangement.Guralnick, p. 379. Most told Record Mirror magazine that it was the third song he had written, after \"Goodbye\" and \"Le Blon\", recorded by Barry Ryan and Anita Harris, respectively. He also said that Percy Sledge was the singer he \"had in mind\" when writing the song.\"Making It Most\", Record Mirror, 2 January 1971, p. 6."]}, {"page": "List of top 25 singles for 1969 in Australia", "response": ["| 12. || \"Eloise\" || Barry Ryan || 1 || 3"]}, {"page": "Australian pop music awards", "response": ["| Barry Ryan || Cilla Black || Cream"]}, {"page": "I Love How You Love Me", "response": ["*In the UK, the Paris Sisters' version was overlooked in 1961, in favour of a cover by Jimmy Crawford whose version reached No. 18 in the UK Singles Chart. \"I Love How You Love Me\" was also a UK chart hit for Maureen Evans in 1964 reaching No. 34, and for Paul and Barry Ryan in 1966 at No. 21."]}]}}