{"wiki_id": "http://www.wikidata.org/entity/Q81491", "itemLabel": "Joseph Arch", "itemDescription": "British politician (1826-1919)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Arch", "wikipedia_page": {"main": "Joseph Arch (10 November 1826 – 12 February 1919) was an English trade unionist and politician, born in Barford, Warwickshire who  played a key role in unionising agricultural workers and in championing their welfare. Following their enfranchisement, he became a Member of Parliament.", "link_mentions": [{"page": "List of United Kingdom MPs: A", "response": ["|Joseph Arch"]}, {"page": "Auberon Herbert", "response": ["For the Elementary Education Act 1870 he supported the principle that all provided schools should be secular or strictly unsectarian. His support for this Act (state provided schools) is in contradiction to his later political position. In 1872 he seconded Sir Charles Dilke's motion for an inquiry into the expenses of the civil list, and followed Sir Charles's example by declaring himself a republican. This led to a scene of great disorder, and the latter part of his speech was inaudible. He took a leading part in the passing of the Protection of Wild Birds Act 1872. He was an ardent supporter of Joseph Arch and spoke at the mass meeting at Leamington on Good Friday 1872, when the National Agricultural Labourers' Union was formed. On account of his objection to taking life he became a vegetarian."]}, {"page": "List of MPs elected in the 1885 United Kingdom general election", "response": ["| Joseph Arch"]}, {"page": "Wellesbourne", "response": ["Perhaps the most significant event in Wellesbourne's history was the founding in 1872 of the National Agricultural Labourers Union by Joseph Arch – an event once celebrated by an annual parade, which it was hoped to be revived in 2010. There was little interest from the Trade Unions which once featured quite prominently, but the Wellesbourne Action Group still organises a walk from Barford to Wellesbourne around 9 June each year along the Joseph Arch Way. There is a somewhat unusual memorial in the form of a plaque in the village bus shelter dating from 1952."]}, {"page": "North West Norfolk (UK Parliament constituency)", "response": ["| Joseph Arch", "| Joseph Arch"]}, {"page": "Barford, Warwickshire", "response": ["* Joseph Arch (1826–1919), first president of the National Agricultural Labourers Union and Liberal MP. One of the two pubs in Barford is named after him."]}, {"page": "Liberal-Labour (UK)", "response": ["|Joseph Arch", "|Joseph Arch"]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["| Joseph Arch"]}, {"page": "List of MPs elected in the 1892 United Kingdom general election", "response": ["| Joseph Arch "]}, {"page": "National Union of Agricultural and Allied Workers", "response": ["The first three branches of the union were in Norfolk at St Faith's (former stronghold of Joseph Arch's old National Agricultural Labourers Union) and Kenninghall and Shipham."]}, {"page": "Jesse Collings", "response": ["Collings' background in Devon gave him an appreciation of the problems of the agricultural worker and small-scale farmer rare in a major industrial city like Birmingham. He was a friend of Joseph Arch, the founder of the National Agricultural Labourers Union, who lived in Barford, Warwickshire, near Birmingham. Collings believed that education was essential to improving the conditions of agricultural workers and that it needed to be free. The National Agricultural Workers Union joined the National Education League. Collings ensured that Chamberlain, Mayor of Birmingham and a millionaire industrialist, chaired the meeting in Birmingham to support the Agricultural Workers' first strike. When Chamberlain became President of the Board of Trade, Collings acted as his unofficial advisor on agricultural matters affecting peasants in Britain and Ireland.", "The concern of Liberal Unionists was that what they perceived as the need for important reforms was being subordinated to a preoccupation with Ireland. The land reform movement was split. Joseph Arch remained a Gladstonian Liberal and ensured that Collings was deposed from the Allotments Extension Association. Collings later set up the Rural Labourers' League, which supported land reform and advocated tariffs on imported food to support the rural economy. Collings proposed a system of vocational education through free schools in rural areas. Erroneously or not, Collings along with Chamberlain and others believed that land reform in Ireland would give the peasants a stake in the country and reduce poverty, but convinced neither the Liberals nor the Conservatives to attempt it."]}, {"page": "United Kingdom general election records", "response": ["*Joseph Arch was 65 when he returned after 6 years absence in 1892 as member for North West Norfolk, for which he previously sat in 1885-86."]}, {"page": "Sir Charles Mordaunt, 10th Baronet", "response": ["Mordaunt was an active campaigner against the Warwickshire Agricultural Labourers Union formed by Joseph Arch. He was quick to throw any labourers who joined the union out of their cottages. On 30 March 1872, the Leamington and Warwickshire Chronicle reported that \"Sir Charles Mordaunt ....has served notices upon all his union tenants to give up possession of their cottages\". Mordaunt was also behind a meeting where 100 farmers agreed to discharge any labourers that so much as joined the union, reported on 13 April 1872 in the Leamington and Warwickshire Chronicle."]}, {"page": "John Bedford Leno", "response": ["John Bedford Leno also strove hard for the abolition of liability of the goods of poor tenants for rent, for limited liability with regard to investments, for the spread of education, for the abolition of drunkenness, although he was not an abstainer, and rushed to the assistance of Joseph Arch in his support for the agricultural labourer in 1872."]}, {"page": "Lord Henry Cavendish-Bentinck", "response": ["He entered Parliament for Norfolk North-West in 1886, defeating Joseph Arch, a seat he lost in 1892, when Arch reclaimed the seat. He returned to the House of Commons in 1895 when he was elected for Nottingham South, a seat he held until 1906 and again from 1910 to 1929."]}, {"page": "Joseph Ashby", "response": ["Elizabeth brought up Joseph as an Anglican; in his teens and against her wishes he joined the Methodists. Joseph attended one of the meetings of the farm workers union leader Joseph Arch. Although only a boy, he decided to join the union when he could. Also at this time, he came into contact with the third great influence of his life, the friendly society movement which gave him a belief in self-help."]}, {"page": "Haughley", "response": ["William James Palmer purchased the business in 1869 (the Palmer family is descended from the family of Roger Palmer, 1st Earl of Castlemaine and husband of Barbara Villiers, mistress of Charles II).History of Haughley - a countryside parish  page 56 He was a staunch Liberal, Atheist, Republican and follower of Thomas Paine and of the National Secular Society. Working with his father, William Hollingsworth Palmer, he campaigned nationally for the rights of agricultural workers through the foundation of the National Agricultural Labourers Union. He was a friend of Sir Joseph Arch and a friend and advocate of Charles Bradlaugh. At his death in 1915 he was described by Bradlaugh's daughter and campaigner as \"never a truer, loyal friend and advocate of my father and his beliefs through the persecution and personal loss he suffered\"; his wife and daughter had died in 1885 of a smallpox virus they contracted on his return from a London campaign. Palmer named one of his sons Charles Bradlaugh Palmer.Bury Free Press, March 3, 1915 He was succeeded by his son, William Edwart Gladstone Palmer, who began the milling, pig merchants and farm side of the business as well as the Elmswell bacon factory and E Rand & Son of Wetherden. He married Mable Woods, dying in 1968. William Ewart Gladstone Palmer's son Roy Palmer succeeded and founded the Village & Bakery Museum. He married Margaret Burns from Ulster and died in 1989. The family had milling, arable and pig farming interests in the village and district together with three windmills, but these closed in the 1980s with the family retaining the farm business of just over 1000 acres of mainly arable farm and the property arm of just over 200 mixed commercial and residential properties in Haughley and in Northern Ireland."]}, {"page": "Augustus Jessopp", "response": ["The Nineteenth Century was under the direction of James Knowles, and Jessopp's success may be due to this circumstance. His work certainly was what the editor wanted, and he wrote well, in a forcible, colloquial style, with earnestness, full of knowledge of his subjects, and helped by boisterous illustrations. Joseph Arch loomed large in the public eye; people wanted to hear what a county parson had to say about the agricultural labourer. He was firmly convinced that things were not going well in the rural parishes, and he was righteously indignant at the condition of the labourer's cottage, and the growing tendency to deprive him of all chance of rising to a higher level, an evil aggravated by the abolition of small farms. He realised also, the dullness of village life, the grinding monotony, and the impossibility of escape, though perhaps he was too prone to assume that these burdens would be as heavy to his neighbours as to himself."]}, {"page": "Ascott Martyrs", "response": ["The National Union of Agricultural Workers was founded in Warwickshire in 1872, led by the Primitive Methodist preacher Joseph Arch. Support spread to other parts of the country, and in 1873 the men of Ascott-under-Wychwood formed a branch of the new union."]}, {"page": "Howard Evans (journalist)", "response": ["Joseph Arch has claimed that Evans \"was the real author of the\" Allotments Extension Act 1882.Joseph Arch, From Ploughtail to Parliament. An Autobiography (The Cresset Library, 1986), p. 346. Evans travelled the country for the National Agricultural Labourers' Union and believed that something must be done. He got a Bill drawn up and Sir Charles Dilke offered to introduce it into the House of Commons. However the Charity Commissioners did not like the Act, as Evans wrote: \"The tricks resorted to by some of the trustees are simply infamous. In some cases they have let the land on a long lease so as to evade the Act; in others they have, contrary to law, charged exorbitant rents; in others they have, contrary to law, refused to let except to farm labourers, and sometimes only to farm labourers who are householders; in others they have ignored the Act altogether; in others they have illegally demanded half a year's rent in advance\".Arch, p. 347. Arch claimed that \"I must say that Evans worked like a slave over this Act, and he wrote on it in our paper, and gave extracts from the Charity Digest\".Arch, p. 347."]}, {"page": "Edward Jenkins (MP)", "response": ["He wrote at least two other satires, Lord Bantam (1871) and Barney Geoghegan, M.P (1872). The review of Lord Bantam in The Times newspaper in 1872 describes a political novel telling the story of a young nobleman of radical politics who enters Parliament supporting a redistribution of land and power, but who promptly abandons his radicalism when he inherits his father's peerage and large estates. The reviewer denounces the book as a vehicle for \"Red Republican opinions\", and remarks that the author wants the reader to conclude that \"the working classes need never expect to derive any permanent advancement from the Radical professions of young lords who have such a stake in the existing institutions of the country\". Jenkins supported the campaigns of the Warwickshire agricultural trade unionist Joseph Arch, and his novel Little Hodge (1873) dealt with the plight of landless labourers in England."]}, {"page": "Arthur Clayden", "response": ["Clayden early identified himself with the agricultural labourers' movement, becoming a member of the consultative committee of the National Agricultural Labourers' Union, under the presidency of Joseph Arch. In 1873 he accompanied Arch to Canada for the purpose of investigating that colony as a field of emigration, contributing letters to the Daily News on the subject. In 1879 he went out to New Zealand, and while there acted as correspondent for the Daily News. He returned to England in 1890. Clayden delivered lectures on \"New Zealand as an Emigration Field\"; and in 1885 read a paper before the Royal Colonial Institute on \"New Zealand in 1884.\" Some of his letters and lectures have been published in pamphlet form."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1885–1889)", "response": ["|1886-06-26||Mr Joseph Arch MP||the agricultural labourer||Spy||S 491||25px"]}, {"page": "Labour Electoral Association", "response": ["In 1890, James MacDonald argued that the association should only support candidates who favoured nationalisation, but this policy was rejected by the TUC congress.  However, the organisation's candidates were not particularly successful at the 1892 general election – although eight of nine parliamentary seats were held, and Joseph Arch and Sam Woods gained seats, the majority were not elected.  By 1893, the socialists who favoured independent candidatures had gained strength, and Ben Tillett and John Hodge successfully proposed that the TUC would set up a new fund to support independent labour candidates.  Although they claimed that this would complement the LEA, it was generally seen as being an attempt to undermine its continued support for Lib-Lab candidates."]}, {"page": "Dunbar's local songs and recitations 1874", "response": ["|12||Joseph Arch||The Marble Arch||Joseph Arch was the president of the newly founded National Agricultural Labourers' Union||"]}, {"page": "William Dunbar (songwriter)", "response": ["*  Joseph Arch, sung to the tune of “The Marble Arch”. It is a  song about Joseph Arch, on the president of the newly founded National Agricultural Labourers' Union"]}, {"page": "February 1919", "response": ["* Died: Joseph Arch, British politician, architect of the Representation of the People Act (b. 1826); Harold Gilman, British painter, founding member of the Camden Town Group (b. 1876)"]}, {"page": "Charles Kegan Paul", "response": ["thumb|St Mary's Church, Sturminster Marshall where Paul was vicar for 12 yearsHe left teaching in Eton in 1862 and was appointed vicar to Sturminster Marshall, Dorset, a living in the gift of Eton. It was not a large living, being worth less than £300 a year. He served there for twelve years. He associated with Joseph Arch's movement on behalf of agricultural labourers in Dorset. Finding himself more and more out of sympathy with the teachings of the Church of England he abandoned his living and went to London. While he was at Sturminster Marshall he completed the requirements for his M.A. degree, and was awarded the degree in 1868."]}, {"page": "Land Tenure Reform Association", "response": ["In July 1870 The Economist argued that the LTRA's emphasis on freeing up trade in land in fact would work against the expansion of peasant proprietors, since the wealthy would pay high prices for land.F. M. L. Thompson, \"Land and Politics in England in the Nineteenth Century\", Transactions of the Royal Historical Society, Vol. 15 (1965), pp. 23–44, at p. 40. Published by: Cambridge University Press on behalf of the Royal Historical Society. . . Agricultural labour's interests were represented at meetings of the LTRA by Joseph Arch.Humphrey Southall, \"Agitate! Agitate! Organize! Political Travellers and the Construction of a National Politics, 1839–1880\", Transactions of the Institute of British Geographers Vol. 21, No. 1 (1996), pp. 177–193, at p. 184. Published by: Royal Geographical Society (with the Institute of British Geographers). . ."]}, {"page": "Arch (name)", "response": ["* Joseph Arch (1826–1919), English politician"]}, {"page": "Parliamentary Committee of the Trades Union Congress", "response": ["| Joseph ArchAgricultural", "| Joseph ArchAgricultural"]}, {"page": "Evesham Custom", "response": ["Although definite records of the Evesham Custom first appear in the early-mid 19th century, some commentators in the past have assumed that the rights originated from \"some earlier epoch\".Martin, J. M. \"The Social and Economic Origins of the Vale of Evesham Market Gardening Industry\", The Agricultural History Review, v.33 (1985), 46 The ruralist writer H. J. Massingham, who was familiar with the operation of the Custom, expressed a belief that the tenant rights of Evesham were a direct descendant of those of the \"small masters\" who from the early mediaeval period practised cultivation in open fields owned by the Abbey.Massingham, H. J. \"Cottagers\" in Distributist Perspectives, vII, 2008 Massingham commented that after the 1874 agricultural depression, the area's large landlords split their farms up and let smaller parcels of land to labourers who were protected by the survival of ancient customary rights and by the local influence of Joseph Arch.  J. M. Martin has noted that an \"archaic\" form of life leasehold was practised in Pershore by the estates of the Duke of Westminster, where wills of the 18th century spoke of a \"tenant right of renewing\", and that a similarly archaic form of copyhold tenure was found in Shipston-on-Stour on land belonging to the Dean and Chapter of Worcester. Both had survived in areas where large estates had to manage many small tenancies, as in Evesham, and it is possible that a similar local tradition was the source of the rights enjoyed by the Vale of Evesham's market gardeners. Another view states that the Custom originated on a single small estate at the end of the Napoleonic Wars, and subsequently spread throughout the district.Robinson, Agricultural Change, 1988, p.108"]}, {"page": "National Agricultural Labourers' Union", "response": ["The union's origins lay in a meeting at Wellesbourne in Warwickshire, held in February 1872.  Joseph Arch, a well-known labourer and Methodist preacher, addressed a meeting which was to have been held in the Stags Head pub.  However, rather than the thirty or so labourers he had expected to attend, around 2,000 workers from across south Warwickshire turned up.  The meeting was held outside, Arch speaking under a chestnut tree.Joseph Arch, The story of his life told by himself"]}, {"page": "All Jolly Fellows that Follow the Plough", "response": ["An adaptation titled \"Come all you bold fellows that follow the plough\" was used as a recruiting song for Joseph Arch's National Agricultural Labourers' Union. Places named in the song are in Somerset.Palmer, Roy; 'The Painful Plough'; Cambridge University Press; 1972"]}, {"page": "Walter Pardon", "response": ["Walter Pardon is said to have known at least 182 songs. Some of these, for example \"A Ship to Old England Came\" (Roud 1424) are rare, and have not been recorded from other traditional singers. As well as ballads such as \"The Trees they do Grow High\" (Roud 31, Laws O35) and Lord Lovel (Roud 48, Child 75), he sang music hall songs such as \"Old Brown's Daughter\" (Roud 1426).  Among his more unusual songs were anthems of the nineteenth century National Agricultural Labourers' Union led by Joseph Arch, such as \"We Meet Today in Freedom's Cause\" (Roud "]}, {"page": "Charles Henry Newmarch", "response": ["Newmarch matriculated at Corpus Christi College, Cambridge, in 1851, graduating B.A. in 1855. He was ordained deacon in 1854, priest in 1855, and served as curate at Brockworth. He was from 1856 to 1893 rector of Wardley-cum-Belton, Rutland; and was rural dean of the district from 1857 to 1867. He was interested in agricultural matters, contributing to Bell's Life in London on the subject; he championed the cause of the village labourers, who took his part against Joseph Arch, when Arch visited Belton in his tour of the village districts in 1872. He took an active part in church building in Rutland, and restored the chancel of his parish church."]}, {"page": "George Mitchell (trade unionist)", "response": ["Mitchell served as a trustee of the union and donated huge amounts of his own money to it, totaling around £20,000, leading to his bankruptcy.  By 1884, he was concerned that he was unable to obtain information on how the union was spending its funds, and as result, he refused to allow any of the union's £6,000 reserved to be spent.  This upset the union's president, Joseph Arch, who ensured that Mitchell was voted out as a trustee."]}]}}