{"wiki_id": "http://www.wikidata.org/entity/Q816486", "itemLabel": "Ben English", "itemDescription": "British pornographic film actor & director", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Hay", "wikipedia_page": {"main": "Derek Andrew Hay (born 12 August 1964), also known by his stage name Ben English, is a British pornographic actor and the founder and owner of the adult talent agencies LA Direct Models and Miamp Direct Models. He semi-retired from performing in the late 2000s after appearing in nearly 800 movies. However, he has since then appeared in several movies. He appeared most recently in Digital Playground's Trading Mothers for Daughters, released on 10 August 2014.Before founding LA Direct Models in 2000, Hay worked as a stage manager in London for acts including The Rolling Stones, Queen, and Metallica.As of 2020, several accounts of sexual abuse, trafficking, and employment standards violations have been lobbied against the LA Direct Models agency and Hay.\nHay, along with Dwight Cunningham and Karine Michmichian of The Luxury Companion, has also been formally charged by the California Department of Justice for an alleged participation in an illegal prostitution scheme. The complaint alleges that Hay would introduce clients of LA Direct Models to Michmichian and Cunningham for the purpose of prostitution. The complaint further alleges that Hay pressured a female client into prostitution by using the exclusivity provisions in one of his contracts to limit her access to work in pornography.", "link_mentions": [{"page": "AVN Awards", "response": ["|Ben English", "|Ben English Pirates II: Stagnetti's Revenge"]}, {"page": "English (surname)", "response": ["*Derek Hay (born 1964), British porn actor known as Ben English"]}, {"page": "22nd AVN Awards", "response": ["** Ben English", "**Nadia Styles, Marco Duato, Ben English, Double Teamed"]}, {"page": "21st AVN Awards", "response": ["** Brooke Ballentyne, Ben English, Steve Holmes, 2 Dicks in 1 Chick 2", "** Kara, Ben English, Steve Hooper, Sex with Young Girls", "* Best Male Newcomer: Ben English"]}, {"page": "AVN Award for Male Performer of the Year", "response": ["* Ben English"]}, {"page": "AVN Award for Best Supporting Actor", "response": ["! Ben English"]}]}}