{"wiki_id": "http://www.wikidata.org/entity/Q816609", "itemLabel": "Ben Swain", "itemDescription": "British diver", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Swain", "wikipedia_page": {"main": "Benjamin William Oliver Swain (March 31, 1986) from Welwyn Garden City is a British synchronized diver. During the Beijing 2008 Summer Olympics, Swain took part in the Men's 3m Springboard Synchronized event with Nicholas Robinson-Baker. Swain and Robinson-Baker were placed seventh at 2008 Summer Olympics in the synchronised 3m springboard event. He won gold in 2009 in the 3m synchro with Robinson-Baker in the World Series leg in Mexico.  He suffered an injury to his anterior cruciate ligament in December 2009 and had an ACL reconstruction in February 2010, ending his season, after which Robinson-Baker partnered with Chris Mears that year.  Swain returned to diving in 2011 but did not make the Olympic team in 2012.Ben Swain retired in 2012 an became a sport and remedial massage therapist until 2015. Ben married in 2013 in Scotland and in 2015, changed career, successfully training to became a emergency medical technician, working for the NHS ambulance service until moving to Australia in November 2017.\nSwain has a Diploma  Sport and Exercise Science from Manchester Metropolitan University  and a degree in Paramedic Science from Flinders University (Adelaide).", "link_mentions": [{"page": "England at the 2006 Commonwealth Games", "response": ["|align=\"center\"|Ben Swain", "* 1 m: Ben Swain, Peter Waterfield", "* 3 m: Ben Swain, Tony Ally"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Ben Swain", "|align=left|Nick Robinson-BakerBen Swain"]}, {"page": "Diving at the 2008 Summer Olympics – Men's synchronized 3 metre springboard", "response": ["|Nick Robinson-BakerBen Swain"]}, {"page": "Nicholas Robinson-Baker", "response": ["Robinson-Baker became interested in diving when he attended a boxing camp near Crystal Palace and used the pool there.  He participated in the 2008 Summer Olympics, where he was placed 7th overall in the synchronised 3m springboard event with his diving partner Ben Swain. He has won gold, silver and bronze medals on the World Series tour, with a gold in 2009 in 3m synchro with Ben Swain at the World Series leg in Mexico.  At the 2012 Summer Olympics, he partnered with Chris Mears in the synchronised 3 metre springboard event and came fifth. They have also won a number of gold medals at National Cup and National Championships as well as a silver at the World Series in Mexico.  At the 2014 Commonwealth Games he won bronze in the 3m springboard synchro with Freddie Woodward."]}, {"page": "Diving at the 2009 World Aquatics Championships – Men's synchronized 3 metre springboard", "response": ["| 7 ||align=left| Nick Robinson-BakerBen Swain ||align=left||| 408.84 || 3 || 413.46 || 7"]}, {"page": "Diving at the 2009 World Aquatics Championships – Men's 3 metre springboard", "response": ["| 30  ||align=left| Ben Swain ||align=left||| 356.05 || 30  ||   ||   ||   || "]}, {"page": "List of fictional British politicians", "response": ["* Minister for Immigration (DoSAC) Ben Swain MP (Justin Edwards), The Thick of It"]}, {"page": "British Diving Championships - springboard diving winners", "response": ["|Ben Swain", "| Ben Swain", "|Ben Swain", "|Ben Swain", "|Ben Swain & Nicholas Robinson-Baker", "|Ben Swain & Nicholas Robinson-Baker"]}]}}