{"wiki_id": "http://www.wikidata.org/entity/Q816544", "itemLabel": "Ben Lewis", "itemDescription": "British art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Lewis_(filmmaker)", "wikipedia_page": {"main": "Ben Lewis (born 1966) is a British art critic, historian and documentary filmmaker.", "link_mentions": [{"page": "East German jokes", "response": ["East German jokes, jibes popular in the former German Democratic Republic (GDR, also known as East Germany), reflected the concerns of East German citizens and residents between 1949 and 1990. Jokes frequently targeted political figures, such as Socialist Party General Secretary Erich Honecker or State Security Minister Erich Mielke, who headed the Stasi secret police.Ben Lewis, Hammer and Tickle: A Cultural History of Communism, London: Pegasus, 2010 Elements of daily life, such as economic scarcity, relations between the GDR and the Soviet Union or Cold War rival, the United States, were also common.Ben Lewis, \"Hammer & tickle,\" Prospect Magazine, May 2006 There were also ethnic jokes, highlighting differences of language or culture between Saxony and Central Germany.", "*Ben Lewis, Hammer and Tickle: A Cultural History of Communism, London: Pegasus, 2010", "*Ben Lewis, \"Hammer & tickle,\" Prospect Magazine, May 2006"]}, {"page": "Soviet phraseology", "response": ["Ben Lewis wrote in his essay,\"Hammer & tickle\", Prospect Magazine, May 2006, essay by Ben Lewis on jokes in Communist countries", " book,Ben Lewis (2008) \"Hammer and Tickle\",  (a review online) and film (all titled Hammer & Tickle) that \"Communism was a humour-producing machine. Its economic theories and system of repression created inherently funny situations. There were jokes under fascism and the Nazis too, but those systems did not create an absurd, laugh-a-minute reality like communism.\""]}, {"page": "Russian political jokes", "response": ["Ben Lewis claims that the political conditions in the Soviet Union were responsible for the unique humour produced there;\"Hammer & tickle\", Prospect Magazine, May 2006, essay by Ben Lewis on jokes in Communist countries,", "Ben Lewis (2008) \"Hammer and Tickle\",  (a review online) according to him, \"Communism was a humour-producing machine. Its economic theories and system of repression created inherently amusing situations. There were jokes under fascism and the Nazis too, but those systems did not create an absurd, laugh-a-minute reality like communism.\"", ":A: Put up a sign saying \"collective farm\". Then half the mice will starve, and the rest will run away.A review of the Ben Lewis book, economist.com"]}, {"page": "Ben Lewis", "response": ["Ben Lewis may refer to:", "*Ben Lewis (Australian actor) (born 1979), English-born Australian musical theatre actor", "*Ben Lewis (writer), British writer for theatre, radio and television; theatre director; actor and performer", "*Ben Lewis (filmmaker), (born 1966) British filmmaker and art critic", "*Ben Lewis (footballer) (born 1977), English footballer", "*Ben Lewis (rugby union) (born 1986), Welsh rugby player", "*Ben Lewis (Canadian actor) (born 1985), Canadian film and television actor"]}, {"page": "Salvator Mundi (Leonardo)", "response": ["The art critic Ben Lewis, who disputes a full attribution to Leonardo, admits that his authorship of the work is possible, owing to the originality of the face, which has \"something modern about it\". Kemp says:"]}, {"page": "Hammer & Tickle", "response": ["Lewis published an essay (in Prospect Magazine, 2006)\"Hammer & tickle\", Prospect Magazine, May 2006, essay by Ben Lewis", " and book (Weidenfeld & Nicolson, 2008)Ben Lewis (2008) \"Hammer and Tickle\",  (a review online) with the same title."]}, {"page": "Google and the World Brain", "response": ["Google and the World Brain is a 2013 documentary movie about the Google Books Library Project directed by Ben Lewis, produced by BBC, Polar Star Films and Arte. The main focus in the plot is on copyright controversy caused by the project that resulted in Google Book Search Settlement Agreement. It features interviews with many figures concerned, which include German chancellor Angela Merkel and Creative Commons founder Lawrence Lessig."]}, {"page": "Hammer and Tickle", "response": ["*Hammer & Tickle: The Communist Joke Book,  a 2006 documentary about Russian political jokes by Ben Lewis (filmmaker)", "*Hammer & Tickle. The Communist Joke Book, a 2008 book by Ben Lewis"]}]}}