{"wiki_id": "http://www.wikidata.org/entity/Q816879", "itemLabel": "Benedict Kiely", "itemDescription": "Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Benedict_Kiely", "wikipedia_page": {"main": "Benedict \"Ben\" Kiely (15 August 1919 – 9 February 2007) was an Irish writer and broadcaster from Omagh, County Tyrone.\n\n", "link_mentions": [{"page": "August 15", "response": ["*  1919   – Benedict Kiely, Irish journalist and author (d. 2007)"]}, {"page": "Donnybrook, Dublin", "response": [":* Benedict Kiely"]}, {"page": "County Tyrone", "response": ["* Benedict Kiely (1919–2007), writer and broadcaster"]}, {"page": "List of novelists by nationality", "response": ["*Benedict Kiely (1919–2007)"]}, {"page": "List of Irish people", "response": ["* Benedict Kiely – Saoi of Aosdána"]}, {"page": "Omagh", "response": ["*Benedict Kiely (1919–2007) – author (Land Without Stars)"]}, {"page": "Brian Friel", "response": ["On 22 February 2006, President Mary McAleese presented Friel with a gold torc in recognition of his election to the position of Saoi by his fellow members of Aosdána. On acceptance of the gold Torc, Friel quipped: \"I knew that being made a Saoi, really getting this award, is extreme unction; it is a final anointment—Aosdana's last rites.\" Only five members of Aosdána could hold this honour at the time, and Friel joined fellow Saoithe Louis le Brocquy, Benedict Kiely, Seamus Heaney and Anthony Cronin. In August 2006, Heaney (also a friend of the Friels) who had been in attendance at the 75th birthday of Friel's wife in County Donegal, suffered a stroke on the morning after the celebration."]}, {"page": "List of Irish short story writers", "response": ["* Benedict Kiely (born 1919)"]}, {"page": "1919 in Ireland", "response": ["*15 August – Benedict Kiely, writer, broadcaster and journalist (died 2007)"]}, {"page": "Alice Milligan", "response": ["Alice Milligan died in Trichur, County Tyrone, on 13 April 1953, aged 87. She had ended her life in poverty. Her Unionist relatives, she explained to Bigger, were disinclined to give her a helping hand \"as they find that my political activities are constrained by financial embarrassment\". Visiting her in the late 1940s, the Irish writer and broadcaster Benedict Kiely was saddened \"to think that to be poor, lonely and smoke-dried should be the lot of a poet at the end of it all\".Kiely, Benedict (1970), \"The Whores on the Half-Doors; or, An Image of the Irish Writer,\" in Conor Cruise O'Brien Introduces Ireland, ed. Owen Dudley Edwards. New York: McGraw Hill, pp. 150-151"]}, {"page": "The Red and the Green", "response": ["Murdoch's biographer Peter J. Conradi notes that the Irish reviews were \"generally good\", including one by Seán Ó Faoláin in the Irish Times. Benedict Kiely recommended it to American readers as a guidebook to \"the English and the Irish\" characters and praised Murdoch's ability to discriminate, \"with scholastic precision ... between English rain and Irish rain\"."]}, {"page": "The Irish Press", "response": ["Seán Lemass was an early managing director. Major Vivion de Valera, son of the founder, subsequently became managing director. De Valera was noted for courtesy amongst those running the business, which was considered well run. Shareholders came from both Ireland and the United States. It was many years before a dividend was paid. Douglas Gageby worked on each of the press titles, The Irish Press, Evening Press (as first editor) and The Sunday Press.  Tim Pat Coogan, who started working for the Evening Press, became editor of The Irish Press from 1968 until 1987. Derry-born James Patrick (Jim) McGuinness, who was editor from 1953 until 1957, brought in journalists such as Benedict Kiely, Seán J. White, and also Brendan Behan as a columnist.Des Fisher, \"Jim McGuinness (1920-2008) Obituary\", Irish Independent, Sunday, 31 August 2008."]}, {"page": "Desmond Hogan", "response": ["Another Irish writer Colum McCann, claims that Hogan, along with Benedict Kiely, is one of two Irish writers who have influenced him greatly."]}, {"page": "Drumquin", "response": ["The works of the noted Irish writer Benedict Kiely contain many references to the Drumquin district, with which he had family connections on his mother's side. In 1802, the countryside around Drumquin was described as one continuous scene of dreary mountains. However, the traveler did point out that forty years before that a rich coalmine had been opened at Drumquin and a canal opened to transport the coal. Drum quin has been in existence since 1211."]}, {"page": "Partition of Ireland", "response": ["* Benedict Kiely, Counties of Contention: a study of the origins and implications of the partition of Ireland. Cork: Mercier Press, 2004. "]}, {"page": "Patrick Augustine Sheehan", "response": ["* Benedict Kiely: Canon Sheehan: The Reluctant Novelist.  In Irish Writing, no. 37, Autumn 1957, pp. 35–45.", "* Benedict Kiely: A Raid into Dark Corners: and other Essays:  Cork: Cork University Press 1999."]}, {"page": "List of writers from Northern Ireland", "response": ["*Benedict Kiely (1919-2007)"]}, {"page": "Peadar O'Donnell", "response": ["After the 1940s, O'Donnell devoted more of his time to writing and culture and less to politics, from which he withdrew more or less completely. He published his first novel, Storm, in 1925. This was followed by Islanders (1928), which received national and international acclaim,Donal Ó Drisceoil, Peadar O'Donnell (Cork, 2001), p. 54 The New York Times describing it as a novel of \"quiet brilliance and power\", conservative London magazine The Spectator \"an intensely beautiful picture of peasant life.\" The writer Benedict Kiely recalled meeting a Chicago man in Iowa in 1968 who had never been to Ireland but could describe the landscape of west Donegal, and the ways of its people, in minute detail despite being blind. When Kiely asked him how he knew so much he revealed he had read Islanders in Braille. Adrigoole, published in 1929, was swiftly followed by The Knife (1930) and On the Edge of the Stream (1934). O'Donnell also went to Spain and later published Salud! An Irishman in Spain (1937). Adrigoole was set in Donegal, but based on the real-life story of the O'Sullivans, a Cork family who had all died of starvation in 1927, and is 'by far the gloomiest and most pessimistic of his books'."]}, {"page": "2007 in Ireland", "response": [":* 8 February – Benedict Kiely, writer, broadcaster and journalist (born 1919)."]}, {"page": "Killeter", "response": ["The writer Benedict Kiely has stated that he based the fictional village of Carmincross, in his novel Nothing Happens in Carmincross, on Killeter.Afterword to Proxopera: A Tale of Modern Ireland (Godine, 1989)"]}, {"page": "Censorship of Publications Board (Ireland)", "response": ["Many important works of literature continued to be banned by the Board, including East of Eden by John Steinbeck, The Heart of the Matter by Graham Greene and The African Queen by C. S. Forester. Other authors banned included Theodore Dreiser, F. Scott Fitzgerald, Robert Graves, Ernest Hemingway, D. H. Lawrence, Wyndham Lewis, Thomas Mann, John Cowper Powys, Somerset Maugham and Evelyn Waugh. Irish writers who were censored included Austin Clarke, Benedict Kiely, Edna O'Brien, Kate O'Brien, Frank O'Connor and Seán Ó Faoláin. In 1950, Robert Graves described the Irish censorship laws as 'the fiercest literary censorship this side of the Iron Curtain.'"]}, {"page": "On Raglan Road", "response": ["The poem was put to music when the poet met Luke Kelly of the well-known Irish band The Dubliners in a pub in Dublin called The Bailey. It was set to the music of the traditional song \"The Dawning of the Day\" (). An Irish-language song with this name () was published by Edward Walsh (1805–1850) in 1847 in Irish Popular Songs, and later translated into English as The Dawning of the Day, published by Patrick Weston Joyce in 1873. Given the similarity in themes and the use of the phrase \"dawning of the day\" in both On Raglan Road and the traditional tune, it is quite likely that Kavanagh from the beginning imagined the pairing of verse and tune. Indeed, there is a broadcast recording of Kavanagh singing On Raglan Road to the tune on Irish television and in 1974 Benedict Kiely recalled in an interview for RTÉ Kavanagh trying out the paired verse and tune for him soon after its writing. Kelly himself acknowledges that song was gifted to him that evening at The Bailey."]}, {"page": "Category talk:British journalists", "response": ["Benedict Kielynot yet classified"]}, {"page": "List of fairy tales", "response": ["|Benedict Kiely"]}, {"page": "Tread Softly in This Place", "response": ["In his review of Tread Softly in this Place, noted man of letters, Benedict Kiely, highlighted the author's key strengths:"]}, {"page": "2007 in Northern Ireland", "response": ["*8 February - Writer, broadcaster and journalist, Benedict Kiely, dies.", "*8 February - Benedict Kiely, writer, broadcaster and journalist (born 1919)."]}, {"page": "Deaths in February 2007", "response": ["*Benedict Kiely, 87, Irish writer and broadcaster."]}, {"page": "2007 in radio", "response": ["*9 February: Benedict Kiely, 87, Irish writer and broadcaster"]}, {"page": "List of Irish writers", "response": ["*Benedict Kiely (1919–2007)"]}, {"page": "Radio Éireann Players", "response": ["Plays were written by writers such as Michael Farrell, Padraic Fallon, Benedict Kiely, Frank O'Connor and Seán Ó Faoláin.  This was a convenient income for these writers during the hard economic times of the 1940s and 1950s and also provided them a large audience. Another contributor was Brendan Behan, who made his debut with two plays for radio. Between plays, the players acted in radio variety programmes and read pieces on the radio as necessary."]}, {"page": "Irish short story", "response": ["Important writers have continued writing stories, from the 1960s on, including Cónal Creedon, Benedict Kiely, Mary Lavin, John McGahern, and Michael McLaverty. An important editorial influence on the short story from the sixties onwards was David Marcus through his New Irish Writing column in the now defunct Irish Press newspaper and of numerous anthologies of Irish fiction and poetry, including the Phoenix Irish Short Stories collections."]}, {"page": "Irish Writers' Union", "response": ["Former and current 'honorary life members' of the IWU include Michael D Higgins, William Trevor, Robert Greacen, Liam Mac Uistin, Benedict KielyIrish Times, 14 February 2007 and Sam McAughtry."]}, {"page": "Capuchin Annual", "response": ["*Benedict Kiely on Donegal, in 1944"]}, {"page": "Catholic Standard (Ireland)", "response": ["Peter O'Curry became editor in 1938. He claimed to have raised the readership from 8,000 to 80,000 a week. During his tenure, writers such as Francis MacManus, Patrick Kavanagh, Benedict Kiely and Gabriel Fallon contributed to the paper. James White (later director of the National Gallery) was arts critic.   "]}, {"page": "Benedict (given name)", "response": ["*Benedict Kiely (1919–2007), Irish writer and broadcaster"]}, {"page": "Book censorship in the Republic of Ireland", "response": ["Among the first 13 books to be banned (announced in the Iris Oifigiúil, in May 1930) were Point Counter Point by Aldous Huxley, The Well of Loneliness by Radclyffe Hall and several books on sex and marriage by Margaret Sanger and Marie Stopes. From 1930 onwards, many books of undoubted literary merit, as well as serious books on reproductive issues and sexual health, were banned. Banned books were listed in the Government publication Iris Oifigiúil, and the list, or a selection, was usually published in the Irish Times. Among Irish books or authors whose book(s) were banned were Liam O'Flaherty (1930), Seán Ó Faoláin (1932), Francis Stuart (1939), Oliver St. John Gogarty (1942), The Tailor and Ansty by Eric Cross (1942), The Gadfly by Ethel Lilian Voynich (1947), Maura Laverty (1948), Walter Macken (1948), Frank O'Connor (1951), Sam Hanna Bell (1952), Brian Cleeve (1952), Benedict Kiely (1954)."]}]}}