{"wiki_id": "http://www.wikidata.org/entity/Q816554", "itemLabel": "Ben Maher", "itemDescription": "equestrian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Maher", "wikipedia_page": {"main": "Benjamin Richard Maher MBE (born 30 January 1983 in Enfield) is a British show jumper. He represented Britain at the 2008 Beijing Olympics, 2009 European Championships in Windsor, 2012 London Olympics, 2016 Rio Olympics and the 2020 Tokyo Olympics. He won the team jumping gold at the London Olympics with Team GB, their first team jumping gold medal for 60 years, and an individual gold for Great Britain at the 2020 Tokyo Olympics. He also won bronze at the 2011 Europeans Championships in Madrid, Spain.\nHe has won many international Grand Prix, including the Olympia Grand Prix, the King George V Gold Cup at Hickstead and an FEI World Cup Qualifier Grand Prix at Wellington with various rides.\nMaher was selected as part of the 2016 British Olympic Show Jumping Team with Tic TacMaher began riding at the age of eight. He was educated at Saffron Walden County High School, and after finishing school, he trained with Liz Edgar before travelling to Switzerland to further his education with Beat Mandli.He had success as a young rider, winning Team Gold with the British Young Riders Team at the European Championships in 2004. He is now a regular member for the British team, and has been ranked as high as 5th on the Longines World Rankings.", "link_mentions": [{"page": "List of people on the postage stamps of the United Kingdom", "response": ["*Ben Maher (2012)"]}, {"page": "List of British postage stamps", "response": ["**Scott Brash, Peter Charles, Ben Maher and Nick Skelton – Team jumping"]}, {"page": "Helmet camera", "response": ["In 2011, Ben Maher won the Martin Collins Eraser Stakes at London Olympia horse show while wearing a helmet camera."]}, {"page": "List of Olympic medalists in equestrian", "response": ["|Scott Brash  on Hello SanctosPeter Charles  on VindicatBen Maher  on Tripple XNick Skelton  on Big Star"]}, {"page": "Nick Skelton", "response": ["Skelton won team gold at his home Olympics in London 2012 with his horse Big Star, alongside Ben Maher, Peter Charles and Scott Brash."]}, {"page": "Show Jumping World Cup", "response": ["*7. Ben Maher  – Robin Hood W, 18 "]}, {"page": "Saffron Walden County High School", "response": ["* Ben Maher, show jumper"]}, {"page": "European Show Jumping Championships", "response": ["| 2013 ||  Herning ||  Roger-Yves Bost on Myrtille Paulois ||  Ben Maher on Cella ||  Scott Brash on Sanctos", "| 2019 ||  Rotterdam ||  Martin Fuchs on Clooney ||  Ben Maher on Explosion W ||  Jos Verlooy on Igor", "*3. GBR  – (Nick Skelton, Guy Williams, Ben Maher, John Whitaker) – 22.46", "*1. GBR  – (Ben Maher, Michael Whitaker, William Funnell, Scott Brash) – 12.18 penalties", "*3. GBR  - (Ben Maher, Holly Smith, Amanda Derbyshire, Scott Brash) - 21.41"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Ben Maher", "|align=left|Ben MaherNick SkeltonTim StockdaleJohn Whitaker"]}]}}