{"wiki_id": "http://www.wikidata.org/entity/Q818069", "itemLabel": "Benny Peiser", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Benny_Peiser", "wikipedia_page": {"main": "Benny Josef Peiser (born 1957) is a social anthropologist specialising in the environmental and socio-economic impact of physical activity on health. He was a senior lecturer in the School of Sport and Exercise Sciences at Liverpool John Moores University (LJMU) and is a visiting fellow at the University of Buckingham.Peiser established the Cambridge Conference Network in 1997. Peiser acknowledges that he is \"not a climate scientist\" and has \"never claimed to be one\". His interest as a social anthropologist, is in \"how climate change is portrayed as a potential disaster and how we respond to that\".As an outspoken climate change denier, Peiser became director of the newly established UK lobbying group Global Warming Policy Foundation in 2009. He serves as co-editor of the journal, Energy & Environment and is a regular contributor to Canada's National Post.", "link_mentions": [{"page": "Attribution of recent climate change", "response": ["Than (2007) pointed to the view of Benny Peiser, a social anthropologist at Liverpool John Moores University in the UK. In his newsletter, Peiser had cited a blog that had commented on warming observed on several planetary bodies in the Solar System. These included Neptune's moon Triton,See also:  Jupiter,See also:  PlutoSee also:  and Mars. In an e-mail interview with Than (2007), Peiser stated that:\"I think it is an intriguing coincidence that warming trends have been observed on a number of very diverse planetary bodies in our solar system, (...) Perhaps this is just a fluke.\"Than (2007) provided alternative explanations of why warming had occurred on Triton, Pluto, Jupiter and Mars."]}, {"page": "Easter Island", "response": ["Benny Peiser noted evidence of self-sufficiency when Europeans first arrived. The island still had smaller trees, mainly toromiro, which became extinct in the wild in the 20th century probably because of slow growth and changes in the island's ecosystem. Cornelis Bouman, Jakob Roggeveen's captain, stated in his logbook, \"... of yams, bananas and small coconut palms we saw little and no other trees or crops.\" According to Carl Friedrich Behrens, Roggeveen's officer, \"The natives presented palm branches as peace offerings.\" According to ethnographer Alfred Mètraux, the most common type of house was called \"hare paenga\" (and is known today as \"boathouse\") because the roof resembled an overturned boat. The foundations of the houses were made of buried basalt slabs with holes for wooden beams to connect with each other throughout the width of the house. These were then covered with a layer of totora reed, followed by a layer of woven sugarcane leaves, and lastly a layer of woven grass."]}, {"page": "Cambridge Conference Network", "response": ["#REDIRECT Benny Peiser#Cambridge Conference Network"]}, {"page": "John Houghton (physicist)", "response": ["In a November 2006 article in Australia's The Daily Telegraph, journalist Piers Akerman quoted Houghton as saying \"Unless we announce disasters, no one will listen\", attributing the quotation to his 1994 book Global Warming, The Complete Briefing.  This has since been quoted by many sceptics, including Benny Peiser and Christopher Monckton, and is listed at the top of the front page of Christopher Booker's The Real Global Warming Disaster.  However, the quotation does not appear in any edition of Houghton's book. Houghton never said any such thing and believed the opposite."]}, {"page": "Neil deGrasse Tyson", "response": ["Tyson recounted the heated online debate on the Cambridge Conference Network (CCNet), a \"widely read, UK-based Internet chat group\", following Benny Peiser's renewed call for reclassification of Pluto's status. Peiser's entry, in which he posted articles from the AP and The Boston Globe, spawned from The New York Timess article entitled \"Pluto's Not a Planet? Only in New York\"."]}, {"page": "Benny Peiser", "response": ["The National Post, former media magnate Conrad Black's national flagship title was established to provide a voice for Canadian conservatives and to compete with Canada's The Globe and Mail, the establishment newspaper with a liberal bias in Canadian newspapers . Outside Toronto, the National Post was built on the printing and distribution infrastructure of Black's national newspaper chain, formerly called Southam Newspapers, that included papers such as the Ottawa Citizen, Montreal Gazette, Edmonton Journal, Calgary Herald, and Vancouver Sun and Benny Peiser continues to participate in stories with these newspapers as well.", "American astrophysicist and science communicator, Neil deGrasse Tyson described (2008) the Cambridge Conference Network (CCNet) as a \"widely read, UK-based Internet chat group\" \"moderated\" by Benny Peiser with a primary interest in \"open discussion of asteroids, comets, and their risk to life on Earth\" but open to many other news subjects.", "In 11–13 July 1997, Benny Peiser and co-editors introduced the Second Society for Interdisciplinary Studies Cambridge Conference held at Fitzwilliam College, by outlining the background of neo-catastrophism by examining the astronomical and meteoritic background for catastrophic thinking, for example near-earth objects, cometary catastrophes and ecological disasters. The presentations by historians, classicists -researchers in areas such as Chinese studies, mythology, art, religion, literature and ancient civilisations – met with geologists, astrophysics, and a science correspondent for London's Sunday Telegraph, were later compiled in a publication entitled Natural Catastrophes during Bronze Age Civilisations.", "Physicist Laurence I. Gould from the University of Hartford, in his editorial entitled 'Global Warming from a Critical Perspective' (2007) included Benny Peiser's argument in favour of the Oxford Union debate proposition entitled \"This House believes that alarmism has replaced science in the global warming debate.\"", "In May 2013 Benny Peiser spoke to a group of 200 at the 10th annual Calgary, Alberta Friends of Science, a Canadian non-profit advocacy organisation who dispute the value of the Kyoto Protocol and believe \"the Sun is the main direct and indirect driver of climate change\", rather than human activity. Peiser compared the apocalyptic statements surrounding the Keystone XL pipeline and oil sands climate change debate, to centuries of catastrophic, apocalyptic cult thinking in the Bronze Age for example.", "Benny Peiser is director of global warming denialist think-tank The Global Warming Policy Foundation.", "Media Watch wrote \"So how many of the 34 articles does Benny Peiser stand by? How many really \"reject or doubt\" the scientific consensus for man-made global warming? Well when we first contacted him two weeks ago he told us...\""]}, {"page": "Peiser", "response": ["#REDIRECT Benny Peiser"]}, {"page": "Category talk:Scientific skepticism", "response": ["Benny PeiserStub"]}, {"page": "Climatic Research Unit email controversy", "response": ["* \"The disclosure of climate data from the Climatic Research Unit at the University of East Anglia\". Video of House of Commons Select Committee oral evidence session, held on Monday 1 March 2010 at 3 pm. Witnesses are: (1) Rt Hon Lord Lawson of Blaby, Chairman, and Dr Benny Peiser, Director, Global Warming Policy Foundation; (2) Richard Thomas CBE; (3) Professor Edward Acton, Vice-Chancellor, University of East Anglia, and Professor Phil Jones, Director of the Climatic Research Unit; (4) Sir Muir Russell KCB, Head of the Independent Climate Change emails Review; (5) Professor John Beddington, Government Chief Scientific Adviser, Professor Julia Slingo OBE, Chief Scientist, Met Office, and Professor Bob Watson, Chief Scientist, Department for Environment, Food and Rural Affairs."]}, {"page": "Global Warming Policy Foundation", "response": ["The foundation was established in November 2009, a week after the start of the Climatic Research Unit email controversy, with its headquarters in a room of the Institute of Materials, Minerals and Mining at 1 Carlton House Terrace, London, and subsequently moved to 55 Tufton Street, London SW1P 3QL. Its director is Benny Peiser, an expert on the social and economic aspects of physical exercise, and it is chaired by Terence Mordaunt, co-owner of the cargo handling business Bristol Port Company. It was previously chaired by the former Chancellor of the Exchequer Nigel Lawson. GWPF states that it is \"deeply concerned about the costs and other implications of many of the policies currently being advocated\" to address climate change and that it aims to \"bring reason, integrity and balance to a debate that has become seriously unbalanced, irrationally alarmist, and all too often depressingly intolerant\".", "Lawson suggested that the e-mails from the University of East Anglia \"called into question\" the integrity of the scientific evidence. Subsequent investigations did not support this view. GWPF Director Benny Peiser said that the organisation did not doubt the science and was not going to discuss it, but want an open, frank debate about what policies should be adopted.", "The group rebranded as Net Zero Watch in 2021. Website DeSmog reports that the Net Zero Watch website says that it was set up and is managed by the Global Warming Policy Forum and had called for the COP26 UN climate summit to be cancelled. The rebrand was criticised by climate change experts from the Grantham Research Institute on Climate Change and the Environment at the London School of Economics, the Energy and Climate Intelligence Unit and Greenpeace and came at the same time as Craig Mackinlay MP and Steve Baker MP launched a similarly named group within Parliament, the Net Zero Scrutiny Group, which also plans to campaign against the cost of moving to green energy. Board member Benny Peiser told Politico that \"dozens\" of MPs had inquired about the Net Zero Watch campaign.", "In May 2014, the GWPF listed Benny Peiser, a social anthropologist, as the director, and a board of trustees consisting of Lord Lawson (Chairman), Lord Donoughue, Lord Fellowes, Peter R. Forster (the Bishop of Chester), Martin Jacomb, Baroness Nicholson, Sir James Spooner and Lord Turnbull."]}, {"page": "Benny Josef Peiser", "response": ["#REDIRECT Benny Peiser"]}]}}