{"wiki_id": "http://www.wikidata.org/entity/Q82052", "itemLabel": "Edith Tolkien", "itemDescription": "J. R. R. Tolkien's wife and muse (1889-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edith_Tolkien", "wikipedia_page": {"main": "Edith Mary Tolkien (née Bratt; 21 January 1889 – 29 November 1971) was an Englishwoman, known as the wife and muse of the novelist J. R. R. Tolkien, and the inspiration for his fictional Middle-earth characters Lúthien Tinúviel and Arwen Undómiel.", "link_mentions": [{"page": "Túrin Turambar", "response": ["Epic literature often remains silent about the details of women's lives, but as an exception to the pattern Tolkien gives Niënor a voice. Literature scholar Victoria Holtz-Wodzak calls Niënor a \"study of the lives of women during wartime. She is, for all practical purposes, a war orphan\". She sees the war-time fate of the women in Tolkien's life as well as his own experiences as inspiration for the character and its sympathetic treatment by the author. His wife Edith Tolkien, like Níniel, had to let her husband go to an uncertain fate in combat while pregnant and in precarious circumstances. J. R. R. Tolkien himself, like Níniel, was unable to take part in combat himself for most of World War I due to illness. Holtz-Wodzak also compares his situation to that of Brandír, who as a non-combatant loses the struggle with Turambar for both the respect of his people and the love of Níniel. The scholar even sees an echo of Tolkien's sentiments about not being able to be active in World War II due to age in \"Niennor's desperate wish either to keep the man she loves from danger or to die with him\"."]}, {"page": "Hornsea", "response": ["*Edith Tolkien (1889–1971), wife of J. R. R. Tolkien, lodged at 1 Bank Terrace, Hornsea, while her husband was stationed at Thirtle Bridge"]}, {"page": "List of converts to Catholicism", "response": ["* Edith Tolkien: Englishwoman, known as the wife and muse of novelist J. R. R. Tolkien. Converted in 1913 in order to marry her husband"]}, {"page": "Great Haywood", "response": ["The village was home to the newly married Edith Tolkien, wife of famous author J. R. R. Tolkien, from March 1916 to February 1917.Great War 2003, pg 134 & 231 She moved to the village to be close to his camp on Cannock Chase.BBC Staffordshire - JRR Tolkien in Staffordshire  J. R. R. Tolkien himself lived in Great Haywood in the winter of 1916-17.Christopher Tolkien (1983), The History of Middle-earth, The Book of Lost Tales, p.25; "]}, {"page": "Tolkien family", "response": ["===Edith Tolkien===", "Christopher John Reuel Tolkien (21 November 1924 – 16 January 2020) was the youngest son of J. R. R. and Edith Tolkien. He is best known as his father's literary executor; he is the editor of much of his father's posthumously published work. The Fall of Gondolin was published on 30 August 2018."]}, {"page": "Tolkien (disambiguation)", "response": ["*Edith Tolkien (1889–1971), J. R. R. Tolkien's wife"]}, {"page": "Edith Bratt", "response": ["#REDIRECT Edith Tolkien"]}, {"page": "Little Haywood", "response": ["The village was home to the newly married Edith Tolkien, wife of author J. R. R. Tolkien, from March 1916 to February 1917.(Great War 2003, pg 134 & 231) Tolkien stayed with his wife in Cottage 1, Gipsy Green, on the Teddesley Park Estate, near the village during the winter of 1916, whilst recuperating from trench fever.(Great War 2003, pg 207) The surrounding landscape of Cannock Chase was said to be an inspiration for his early literary works about Middle-earth.. At the cottage he began work on what would become The Silmarillion. The village of Norbury lies about  away and may relate to the \"Norbury of the Kings\" that appears in The Lord of the Rings."]}, {"page": "List of biographical films", "response": ["||Edith Tolkien"]}, {"page": "Joan Turville-Petre", "response": ["On 7 January 1943, Joan Turville-Petre married Gabriel Turville-Petre, a fellow Oxford academic working in the same field. There were no guests at their wedding, but their friends J. R. R. and Edith Tolkien were there as witnesses.Christina Scull and Wayne G. Hammond, The J.R.R. Tolkien Companion & Guide: Chronology, 2006, 1065 They had three sons: Thorlac Francis Samuel (born 6 January 1944), Merlin Oswald (born 2 July 1946) and Brendan Arthur Auberon (16 September 1948 – 6 December 1981)."]}, {"page": "Lily Collins", "response": ["In 2019, Collins co-starred with Zac Efron in the drama Extremely Wicked, Shockingly Evil and Vile, directed by Joe Berlinger. She plays Elizabeth Kendall, Ted Bundy's long-time girlfriend, who struggles to accept that her boyfriend is a serial killer. The film had its world premiere at the Sundance Film Festival on 26 January. Also that year, Collins co-starred as Edith Tolkien, the wife of author J. R. R. Tolkien, in the biopic Tolkien, with Nicholas Hoult in the title role. Filming began in October 2017 and wrapped in December, and Tolkien was released on 10 May 2019."]}, {"page": "January 21", "response": ["*  1889   – Edith Tolkien, wife and muse of J. R. R. Tolkien (d. 1971)"]}, {"page": "November 1971", "response": ["**Edith Tolkien, 82, wife of J. R. R. Tolkien"]}]}}