{"wiki_id": "http://www.wikidata.org/entity/Q8215244", "itemLabel": "David N. Livingstone", "itemDescription": "British academic", "wikipedia_url": "https://en.wikipedia.org/wiki/David_N._Livingstone", "wikipedia_page": {"main": "David Noel Livingstone  (born 15 March 1953) is a Northern Ireland-born geographer, historian, and academic. He is Professor of Geography and Intellectual History at Queen's University Belfast.\n\n", "link_mentions": [{"page": "Gifford Lectures", "response": ["*2014  David N. Livingstone  Dealing with Darwin:  Place, Politics and Rhetoric in Religious Engagements with Evolution, "]}, {"page": "B. B. Warfield", "response": ["Warfield's views on evolution have been a source of dispute.  Scholars David N. Livingstone and Mark A. Noll highlighted Warfield's statements on evolution to demonstrate his acceptance of the theory in their article A Biblical Inerrantist as Evolutionist.  Theologian Fred G. Zaspel argues that these statements have led Livingstone and Noll to assume too much about Warfield's views on the subject.  Zaspel writes \"That Warfield actually committed himself to a doctrine of evolution seems impossible to affirm simply because although there are some indications that he entertained the idea, he never admits to accepting it.\""]}, {"page": "History of creationism", "response": ["In 1878, American Presbyterians held the first annual Niagara Bible Conference, founding the Christian fundamentalist movement, which took its name from the \"Five Fundamentals\" of 1910, and came to be concerned about the implications of evolution for the accuracy of the Bible. But by no means all orthodox Presbyterians were opposed to evolution as a possible method of the Divine procedure. Dr Charles Hodge of Princeton Seminary objected in 1874 to the atheism he considered inplied in the naturalistic explanation but both he and Dr B. B. WarfieldBenjamin Breckinridge Warfield Evolution, Science & Scripture (Baker 2000) ed. Mark Noll & David N. Livingstone were open to its possibility/probability within limits, and most churchmen sought to reconcile Darwinism with Christianity."]}, {"page": "Livingstone (name)", "response": ["*David N. Livingstone (born 1953), Professor of Geography and Intellectual History at Queen's University Belfast"]}, {"page": "Charles W. J. Withers", "response": ["*Geography and revolution, edited with David N. Livingstone (University of Chicago Press, 2005).", "*Geography and Enlightenment edited with David N. Livingstone (University of Chicago Press, 1999)."]}, {"page": "John A. Agnew", "response": ["* Human Geography: An Essential Anthology (ed) (1996, Wiley-Blackwell), co-edited with David N. Livingstone and Alisdair Rogers "]}, {"page": "William Whitla", "response": ["As a biblical scholar he contributed an introductory study of the nature and the cause of unbelief, of miracles, and prophecy to an edition of Sir Isaac Newton's Daniel and the ApocalypseDavid N. Livingstone. \"Science, Religion and the Geography of Reading: Sir William Whitla and the Editorial Staging of Isaac Newton's Writings on Biblical Prophecy\". The British Journal for the History of Science. Vol. 36, No. 1. Mar. 2003. pp. 27–42. published by John Murray in 1922. As the decade progressed his public appearances were fewer, and after a stroke in 1929 he was confined to his room. Lady Whitla died in 1932; he died at Lennoxvale on 11 December 1933, and was given a civic funeral two days later; he was buried at Belfast City Cemetery."]}, {"page": "Michael Foster (philosopher)", "response": ["*Edward B. Davis. \"Christianity and Early Modern Science: The Foster thesis Reconsidered\" (Chapter 3, pp. 75–95). Evangelicals and Science in Historical Perspective. Edited by David N. Livingstone, D. G. Hart, and Mark A. Noll. Oxford University Press, 1999."]}, {"page": "David Livingstone (disambiguation)", "response": ["*David N. Livingstone (born 1953), British historian"]}, {"page": "Scriptural geologist", "response": ["Professor of intellectual history David N. Livingstone states that scriptural geologists \"were not, as it turns out, geologists at all\", concluding that \"while it may be proper to speak of Scriptural Geology, it is not really accurate to speak of Scriptural Geologists.\" L. Piccardi and W. Bruce Masse state that \"[a]part from George Young, none of these scriptural geologists had any geological competence\". David Clifford states that they were \"not themselves geologists\" but rather \"keen but biased amateurs\" and that one of them, James Mellor Brown, \"felt that no scientific expertise was required when examining scientific matters.\" Taking a more positive view, Milton Millhauser states that the leaders of the party were \"by no means ignorant of the science [they] assailed.\""]}, {"page": "David Vumlallian Zou", "response": ["A fully funded PhD scholarship by the Academic Planning Grant (Northern Ireland) enabled him to pursue his PhD at Queen's University Belfast where he worked under M. Satish Kumar  and David N. Livingstone on print culture and identity formation in colonial north-east India."]}, {"page": "Bertram Windle", "response": ["During his medical training days, Windle was an atheist. He later converted to Catholicism.Bowler, Peter J. (2001). Reconciling Science and Religion: The Debate in Early-Twentieth-Century Britain. University of Chicago Press. p. 41.  He was a critic of Darwinism and took influence from St. George Jackson Mivart.Engels, Eve-Marie. (2008). The Reception of Charles Darwin in Europe: Volume 1. Continuum. pp. 74-75.  Historian David N. Livingstone has noted that Windle favoured a Catholic version of neo-Lamarckism.Livingstone, David N. (2009). Evolution and Religion. In Michael Ruse; Joseph Travis. Evolution: The First Four Billion Years. Harvard University Press. p. 355.  "]}, {"page": "Fellow of the Academy of Social Sciences", "response": ["* David N. Livingstone"]}]}}