{"wiki_id": "http://www.wikidata.org/entity/Q82278", "itemLabel": "George Jellicoe, 2nd Earl Jellicoe", "itemDescription": "British army officer, politician and businessman (1918-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Jellicoe,_2nd_Earl_Jellicoe", "wikipedia_page": {"main": "George Patrick John Rushworth Jellicoe, 2nd Earl Jellicoe, Baron Jellicoe of Southampton,  (4 April 1918 – 22 February 2007), was a British politician, diplomat and businessman.Lord Jellicoe was the only son but sixth and youngest child of John Jellicoe, 1st Earl Jellicoe, who was a First World War naval commander, commander at the Battle of Jutland, and Admiral of the Fleet; and his wife Florence Gwendoline (died 1964), who was the second daughter of Sir Charles Cayzer, 1st Bt., of Gartmore, Perthshire. He inherited the title Earl Jellicoe at the age of 17, on the death of his father. As well as commanding the Special Boat Service in the Second World War, George Jellicoe was a long-serving parliamentarian, being a member of the House of Lords for 68 years (1939–2007).", "link_mentions": [{"page": "February 22", "response": ["*2007 – George Jellicoe, 2nd Earl Jellicoe, English politician, Leader of the House of Lords (b. 1918)"]}, {"page": "John Jellicoe, 1st Earl Jellicoe", "response": ["Jellicoe married, at Holy Trinity Church, Sloane Street, on 1 July 1902, Florence Gwendoline Cayzer, daughter of the shipping magnate Sir Charles Cayzer. His brother, Rev. Frederick Jellicoe (1858–1927), conducted the service. Lord and Lady Jellicoe had a son and five daughters. His son George Jellicoe, 2nd Earl Jellicoe, had an illustrious military career during the Second World War, followed by prominent careers as parliamentarian and businessman."]}, {"page": "Conservative Monday Club", "response": ["*George Jellicoe, 2nd Earl JellicoeCopping, Robert, The Monday Club—Crisis and After May 1975, page 50, published by the Current Affairs Information Service, Ilford, Essex, (P/B)."]}]}}