{"wiki_id": "http://www.wikidata.org/entity/Q8237", "itemLabel": "Richard Holmes", "itemDescription": "author and literary critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Holmes_(biographer)", "wikipedia_page": {"main": "Richard Gordon Heath Holmes, OBE, FRSL, FBA (born 5 November 1945) is a British author and academic best known for his biographical studies of major figures of British and French Romanticism.", "link_mentions": [{"page": "Museum of Jurassic Technology", "response": ["The museum contains an unusual collection of exhibits and objects with varying and uncertain degrees of authenticity. The New York Times critic Edward Rothstein described it as a \"museum about museums\", \"where the persistent question is: what kind of place is this?\"  Smithsonian magazine called it \"a witty, self-conscious homage to private museums of yore . . . when natural history was only barely charted by science, and museums were closer to Renaissance cabinets of curiosity.\" In a similar vein, The Economist said the museum \"captures a time chronicled in Richard Holmes's recent book The Age of Wonder, when science mingled with poetry in its pursuit of answers to life's mysterious questions.\"\"A cabinet of wonder: A Los Angeles museum filled with curio and mystery\", The Economist, September 10, 2009."]}, {"page": "Voltaire", "response": ["Richard Holmes and \"Voltaire's Grin\" in New York Review of Books, 30 November 1995, pp. 49–55 supports the anagrammatic derivation of the name, but adds that a writer such as Voltaire would have intended it to also convey connotations of speed and daring. These come from associations with words such as  (acrobatics on a trapeze or horse), volte-face (a spinning about to face one's enemies), and volatile (originally, any winged creature). \"Arouet\" was not a noble name fit for his growing reputation, especially given that name's resonance with  (\"to be beaten up\") and  (a débauché)."]}, {"page": "List of biographers", "response": ["*Richard Holmes (England, born 1945) – Mary Shelley, Coleridge, The Age of Wonder"]}, {"page": "1993 in literature", "response": ["*James Tait Black Memorial Prize for biography: Richard Holmes, Dr Johnson and Mr Savage"]}, {"page": "1989 in literature", "response": ["*Whitbread Best Book Award: Richard Holmes, Coleridge: Early Visions"]}, {"page": "1945 in literature", "response": ["*November 5 – Richard Holmes, English literary biographer"]}, {"page": "Caroline Herschel", "response": ["When William married a rich widow, Mary Pitt (née Baldwin) in 1788, the union caused tension in the brother-sister relationship. Caroline has been referred to as a bitter, jealous woman who worshipped her brother and resented those who invaded their domestic lives. In his book The Age of Wonder, Richard Holmes is more sympathetic to Caroline's position, noting that the change was in many respects negative for Caroline. With the arrival of William's wife, Caroline lost her managerial and social responsibilities in the household and accompanying status. She also moved from the house to external lodgings, returning daily to work with her brother. She no longer held the keys to the observatory and workroom, where she had done much of her own work. Because she destroyed her journals from 1788 to 1798, her feelings about the period are not entirely known. In August 1799, Caroline was independently recognized for her work, when she spent a week in Greenwich as a guest of the royal family.", "William's marriage likely led to Caroline becoming more independent of her brother and more a figure in her own right.The Age of Wonder by Richard Holmes pp. 182–196 Caroline made many discoveries independently of William and continued to work solo on many of the astronomical projects which contributed to her rise to fame."]}, {"page": "Germaine de Staël", "response": ["*The Great de Staël by Richard Holmes from The New York Review of Books"]}, {"page": "Richard Holmes", "response": ["Richard Holmes may refer to:", "* Richard Holmes (biographer) (born 1946), British biographer", "* Richard Holmes (organist) (1931–1991), American jazz organist known as Richard \"Groove\" Holmes", "* Richard Holmes (actor) (born 1963), American actor", "* Richard Holmes (producer) (born 1963), independent film producer", "* Richard Holmes (cricketer) (born 1952), English cricketer", "* Richard Holmes (Canadian football) (born 1952), former Canadian Football League running back", "* Richard Holmes (footballer) (born 1980), former footballer for Notts County", "* Richard Holmes (Connecticut settler) (1633–1704), founding settler of Norwalk, Connecticut", "* Richard Holmes (military historian) (1946–2011), British soldier and military historian"]}, {"page": "National Book Critics Circle Award", "response": ["|2009 || Richard Holmes || The Age of Wonder: How the Romantic Generation Discovered the Beauty and Terror of Science", "* Richard Holmes, The Age of Wonder: How the Romantic Generation Discovered the Beauty and Terror of Science (Pantheon)"]}, {"page": "Duff Cooper Prize", "response": ["*1998 – Richard Holmes, Coleridge: Darker Reflections"]}, {"page": "Baillie Gifford Prize", "response": ["* Richard Holmes, The Age of Wonder: How the Romantic Generation Discovered the Beauty and Terror of Science", "* Richard Holmes, Coleridge: Darker Reflections (about Samuel Taylor Coleridge)"]}, {"page": "Letitia Elizabeth Landon", "response": ["* Richard Holmes, \"A New Kind of Heroine\" (review of Lucasta Miller, L.E.L.:  The Lost Life and Scandalous Death of Letitia Elizabeth Landon, the Celebrated \"Female Byron\", Knopf and Jonathan Cape, 2019, 401 pp.), The New York Review of Books, vol. LXVI, no. 10 (6 June 2019), pp. 16–19.  \"Landon remains a biographical enigma to the last, and 'resists a final, single definition, just like her poetry.'  But thanks to Lucasta Miller's fierce and enthralling book, a complex kind of justice has been rendered to L.E.L. for the first time.\"  (p. 19.)"]}, {"page": "Richard Holmes (military historian)", "response": ["Edward Richard Holmes, CBE, TD, JP, VR (29 March 1946 – 30 April 2011), known as Richard Holmes, was a British military historian, known for his many television appearances. He was co-director of Cranfield University's Security and Resilience Group from 1989 to 2009 and became Professor of Military and Security Studies at Cranfield in 1995."]}, {"page": "Royal Society of Literature", "response": ["| Richard Holmes OBE FBA"]}, {"page": "Claire Clairmont", "response": ["*Richard Holmes. Shelley: The Pursuit. 1974. London: Harper Perennial, 2003. ."]}, {"page": "Royal Society Prizes for Science Books", "response": ["* The Age of Wonder by Richard Holmes\"Prize for wonder of science past\", \"BBC\", 15 September 2009. Retrieved on 22 June 2016."]}, {"page": "1989 Whitbread Awards", "response": [":Richard Holmes, Coleridge: Early Visions", "*Richard Holmes, Coleridge: Early Visions"]}, {"page": "Somerset Maugham Award", "response": ["* Richard Holmes for Shelley: The Pursuit"]}, {"page": "Timeline of aviation – 19th century", "response": ["** 6 July – Sophie Blanchard launches fireworks from her balloon in flight during an exhibition at the Tivoli Gardens in Paris. The fireworks ignite the gas in the balloon, which crashes on the roof of a house. She falls to her death, becoming the first woman to die in an aviation accident.Shtashower, Daniel, \"Book review: ‘Falling Upwards: How We Took to the Air’ by Richard Holmes,\" washingtonpost.com, December 13, 2013."]}, {"page": "Rose Tremain", "response": ["She married Jon Tremain in 1971 and they had one daughter, Eleanor, born in 1972, who became an actress. The marriage lasted about five years. Her second marriage, to theatre director Jonathan Dudley, in 1982, lasted about nine years; and she has been with Richard Holmes since 1992. She lives in Norfolk.Author Notes from 2002 Vintage edition of Sacred County."]}, {"page": "Isabelle de Charrière", "response": ["* Geoffrey Scott. The portrait of Zélide. London, Constable, 1925. xiii, 215 p.He has won the James Tait Black Memorial Prize 1925 for this biography. Scott on Zélide : the portrait of Zélide. Introduction by Richard Holmes. London, Flamingo, 2002. Reprint by Turtle Point Press, New York, 2010. 256 p. with an introduction by Shirley Hazzard, afterword by Richard Dunn."]}, {"page": "American Book Awards", "response": ["* Richard Holmes, The Age of Wonder"]}, {"page": "James Tait Black Memorial Prize", "response": ["| 1993 || Caryl Phillips, Crossing the River || Richard Holmes, Dr Johnson and Mr Savage (Samuel Johnson, Richard Savage) || "]}, {"page": "Songs of Innocence and of Experience", "response": ["The Huntington Library and Art Gallery in San Marino, California, published a small facsimile edition in 1975 that included sixteen plates reproduced from two copies of Songs of Innocence and of Experience in their collection, with an introduction by James Thorpe. The songs reproduced were Introduction, Infant Joy, The Lamb, Laughing Song and Nurse's Song from Songs of Innocence, and Introduction, The Clod & the Pebble, The Tyger, The Sick Rose, Nurses Song and Infant Sorrow from Songs of Experience.  Tate Publishing, in collaboration with The William Blake Trust, produced a folio edition containing all of the songs of Innocence and Experience in 2006. A colour plate of each poem is accompanied by a literal transcription, and the volume is introduced by critic and historian Richard Holmes."]}, {"page": "The Masque of Anarchy", "response": ["Political authors and campaigners such as Richard Holmes and Paul Foot, among others, describe it as \"the greatest political poem ever written in English\". In his book An Encyclopedia of Pacifism, Aldous Huxley noted the poem's exhortation to the English to resist assault without fighting back, stating \"The Method of resistance inculcated by Shelley in The Mask of Anarchy is the method of non-violence\"."]}, {"page": "Travels with a Donkey in the Cévennes", "response": ["Several writers, such as the Scottish novelist Christopher Rush,To Travel Hopefully (2005),  have written of their own efforts to retrace Stevenson's steps. Accounts include a bicycle trip 25 years after Stevenson's hikeJohn Alexander Hammerton. In the track of R. L. Stevenson and elsewhere in old France. Bristol, J. W. Arrowsmith; etc., 1907. From Internet Archive and a comic adventure on the part of two British women.Hillary Macaskill and Molly Wood (2006). Downhill All The Way: Walking with donkeys on the Stevenson Trail A section of Richard Holmes' Footsteps: Adventures of a Romantic Biographer chronicles the author's retracing of Stevenson's journey as well."]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|Richard HolmesColeridge: Early Visions "]}, {"page": "Brian Cox (physicist)", "response": ["Cox gave the Royal Television Society's 2010 Huw Wheldon Memorial Lecture on \"Science, a Challenge to TV Orthodoxy\", in which he examined problems in media coverage of science and news about science. It was subsequently broadcast on BBC Two. On 4 March, a talk entitled \"Frankenstein's Science\" at the National Theatre featured Cox in discussion with biographer Richard Holmes on Mary Shelley's exploration of humanity's desire to bring life to an inanimate object and whether the notion is possible, in both the 19th century and today."]}, {"page": "Omai", "response": ["During his two-year stay in England, Omai became much admired within London high society.  Renowned for his charm, quick wit and exotic good looks, he quickly became a favourite of the aristocratic elite.Holmes, R. (2009) The Age of Wonder: How the Romantic Generation Discovered the Beauty and Terror of Science (London: Harper Press) p. 50  Banks regularly invited Omai to dine with the Royal Society and arranged meetings with notable celebrities, including Lord Sandwich, Dr Samuel Johnson, Frances Burney, and Anna Seward, among others.  Richard Holmes remarks that Omai's idiosyncratic behaviour and distinctive bow were widely celebrated.  Indeed, during one famed meeting with King George III at Kew, Omai is said to have delivered his bow then grasped the King's hand, declaring, \"How do, King Tosh!\"O'Brian, P. (1987) Joseph Banks (Harvill Press) p. 181"]}, {"page": "The New York Times Book Review", "response": ["* Richard Holmes, Coleridge: Darker Reflections, 1804-1834", "* Richard Holmes, The Age of Wonder: How the Romantic Generation Discovered the Beauty and Terror of Science"]}, {"page": "William Frend (reformer)", "response": ["The proceedings attracted wide attention. One of Frend's supporters was Samuel Taylor Coleridge, then an undergraduate. Henry Gunning, in his Reminiscences (i. 280–309), reprints an account of the trial, and, while condemning the tone of the pamphlet, describes the proceedings as a party move and vindicates the tract from the accusation of sedition. He adds that the vice-chancellor was biased against the accused, and that the undergraduates, among whom Coleridge was conspicuous, were unanimous in his favour. Augustus De Morgan wrote that chalked graffiti \"Frend for ever\" appeared; bishop-to-be Herbert Marsh was apprehended, while two other future establishment pillars, John Singleton Copley and William Rough escaped. Milner later wrote identifying Frend and his \"party\" in the university as \"Jacobinical\", and commenting that the trial had been a turning point for them.Richard Holmes, Coleridge: Early Visions (1990), p. 47."]}, {"page": "List of Old Gregorians", "response": ["*Richard Holmes – biographer"]}, {"page": "Nicholas Boyle", "response": ["Boyle's biography of Goethe currently runs to two volumes and he is writing the third. George Steiner has called him a 'critic of vivacious perspicacity' and compares the scope of his work to \"Lord Bullock's double portraits of Hitler and Stalin, Richard Holmes's Coleridge, David Cairns's Berlioz, Michael Holroyd's Shaw, Richardson's Picasso\", whilst The New York Times Book Review describes his biography as a 'remarkable achievement', adding that 'there is nothing comparable to this study in any language'. The biography has been translated into German by Holger Fliessbach. The Goethe Institut awarded Boyle their Goethe Medal in 2000. The second volume was shortlisted for the British Academy Book Prize in 2001."]}, {"page": "Mononymous person", "response": ["In the 18th century, François-Marie Arouet adopted the mononym Voltaire, for both literary and personal use, in 1718 after his imprisonment in Paris' Bastille, to mark a break with his past. The new name combined several features. It was an anagram for a Latinized version of his family surname, \"Arouet, l[e] j[eune]\"; it reversed the syllables of the name of a family château, Airvault; and it has implications of speed and daring through similarity to French expressions such as \"voltige\", \"volte-face\" and \"volatile\". \"Arouet\" would not have served the purpose, given that name's associations with \"roué\" and with an expression that meant \"for thrashing\".Richard Holmes, Sidetracks, pp. 345–66; and \"Voltaire's Grin\", The New York Review of Books, November 30, 1955, pp. 49–55.", "*Richard Holmes, \"Voltaire's Grin\", New York Review of Books, November 30, 1995, pp. 49–55.", "*Richard Holmes, Sidetracks:  Explorations of a Romantic Biographer, New York, HarperCollins, 2000."]}]}}