{"wiki_id": "http://www.wikidata.org/entity/Q8262098", "itemLabel": "John Nathan-Turner", "itemDescription": "English television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Nathan-Turner", "wikipedia_page": {"main": "John Nathan-Turner (12 August 1947 – 1 May 2002), born John Turner, was the ninth producer of the long-running BBC science fiction series Doctor Who. He was also the final producer of the series' first run on television (from 1980 until it was cancelled in 1989). He finished the role having become the longest-serving Doctor Who producer and cast Peter Davison, Colin Baker and Sylvester McCoy as the Fifth, Sixth and Seventh Doctors, respectively.", "link_mentions": [{"page": "August 12", "response": ["*1947 – John Nathan-Turner, English author and television director, producer, and writer (d. 2002)"]}, {"page": "Doctor Who", "response": ["During Jon Pertwee's second season as the Doctor, in the serial Terror of the Autons (1971), images of murderous plastic dolls, daffodils killing unsuspecting victims, and blank-featured policemen marked the apex of the show's ability to frighten children. Other notable moments in that decade include a disembodied brain falling to the floor in The Brain of Morbius and the Doctor apparently being drowned by a villain in The Deadly Assassin (both 1976). Mary Whitehouse's complaint about the latter incident prompted a change in BBC policy towards the series, with much tighter controls imposed on the production team, and the series' next producer, Graham Williams, was under a directive to take out \"anything graphic in the depiction of violence\". John Nathan-Turner produced the series during the 1980s and said in the documentary More Than Thirty Years in the TARDIS that he looked forward to Whitehouse's comments because the show's ratings would increase soon after she had made them. Nevertheless, Nathan-Turner also got into trouble with BBC executives over the violence he allowed to be depicted for season 22 of the series in 1985, which was publicly criticised by controller Michael Grade and given as one of his reasons for suspending the series for 18 months.", "Doctor Who originally ran for 26 seasons on BBC One, from 23 November 1963 until 6 December 1989. During the original run, each weekly episode formed part of a story (or \"serial\")—usually of four to six parts in earlier years and three to four in later years. Some notable exceptions were: The Daleks' Master Plan, which aired twelve episodes (plus an earlier one-episode teaser,The Daleks' Master Plan. Writers Terry Nation and Dennis Spooner, Director Douglas Camfield, Producer John Wiles. Doctor Who. BBC. BBC One, London. 13 November 1965 – 29 January 1966. \"Mission to the Unknown\", featuring none of the regular cast); almost an entire season of seven-episode serials (season 7); the ten-episode serial The War Games;The War Games. Writers Malcolm Hulke and Terrance Dicks, Director David Maloney, Producer Derrick Sherwin. Doctor Who. BBC. BBC One, London. 19 April 1969 – 21 June 1969. and The Trial of a Time Lord, which ran for fourteen episodes (albeit divided into three production codes and four narrative segments) during season 23.The Trial of a Time Lord. Writers Robert Holmes, Philip Martin and Pip and Jane Baker, Directors Nicholas Mallett, Ron Jones and Chris Clough, Producer John Nathan-Turner. Doctor Who. BBC. BBC One, London. 6 September 1986 – 6 December 1986. Occasionally serials were loosely connected by a story-line, such as season 8 focusing on the Doctor battling a rogue Time Lord called the Master, season 16's quest for the Key to Time, season 18's journey through E-Space and the theme of entropy, and season 20's Black Guardian trilogy.", "However, science fiction stories came to dominate the programme, and the history-orientated episodes, which were not popular with the production team, were dropped after The Highlanders (1967). While the show continued to use historical settings, they were generally used as a backdrop for science fiction tales, with one exception: Black Orchid (1982), set in 1920s England.Black Orchid. Writer Terence Dudley, Director Ron Jones, Producer John Nathan-Turner. Doctor Who. BBC. BBC One, London. 1 March 1982 – 2 March 1982."]}, {"page": "Dalek", "response": ["Daleks are extremely aggressive, and seem driven by an instinct to attack. This instinct is so strong that Daleks have been depicted fighting the urge to kill or even attacking when unarmed.Death to the Daleks. Writer Terry Nation, Director Michael E. Briant, Producer Barry Letts. Doctor Who. BBC1, London. 23 February–16 March 1974. The Fifth Doctor characterises this impulse by saying, \"However you respond [to Daleks] is seen as an act of provocation.\" The fundamental feature of Dalek culture and psychology is an unquestioned belief in the superiority of the Dalek race, and their default directive is to destroy all non-Dalek life-forms. Other species are either to be exterminated immediately or enslaved and then exterminated once they are no longer useful.Resurrection of the Daleks. Writer Eric Saward, Director Matthew Robinson, Producer John Nathan-Turner. Doctor Who. BBC1, London. 8–15 February 1984.", "The Dalek obsession with their own superiority is illustrated by the schism between the Renegade and Imperial Daleks seen in Revelation of the Daleks and Remembrance of the Daleks: the two factions each consider the other to be a perversion despite the relatively minor differences between them.Remembrance of the Daleks. Writer Ben Aaronovitch, Director Andrew Morgan, Producer John Nathan-Turner. Doctor Who. BBC1, London. 5–26 October 1988. This intolerance of any \"contamination\" within themselves is also shown in \"Dalek\", The Evil of the Daleks and in the Big Finish Productions audio play The Mutant Phase.The Mutant Phase. Writer and Director Nicholas Briggs. Producers Gary Russell and Jason Haigh-Ellery. Big Finish Productions, 2000. This superiority complex is the basis of the Daleks' ruthlessness and lack of compassion. This is shown in extreme in \"Victory of the Daleks\", where the new, pure Daleks destroy their creators, impure Daleks, with the latters' consent. It is nearly impossible to negotiate or reason with a Dalek, a single-mindedness that makes them dangerous and not to be underestimated. The Eleventh Doctor (Matt Smith) is later puzzled in the \"Asylum of the Daleks\" as to why the Daleks don't just kill the sequestered ones that have \"gone wrong\". Although the Asylum is subsequently obliterated, the Prime Minister of the Daleks explains that \"it is offensive to us to destroy such divine hatred\", and the Doctor is sickened at the revelation that hatred is actually considered beautiful by the Daleks.", "Although the Daleks are not known for their regard for due process, they have taken at least two enemies back to Skaro for a \"trial\", rather than killing them immediately. The first was their creator, Davros, in Revelation of the Daleks,Revelation of the Daleks. Writer Eric Saward, Director Graeme Harper, Producer John Nathan-Turner. Doctor Who. BBC1, London. 23–30 March 1985. and the second was the renegade Time Lord known as the Master in the 1996 television movie.Doctor Who. Writer Matthew Jacobs, Director Geoffrey Sax, Executive Producer Philip Segal. 1996. DVD. BBC Video, 2001. The reasons for the Master's trial, and why the Doctor would be allowed to retrieve the Master's remains, have never been explained on screen. The Doctor Who Annual 2006 implies that the trial may have been due to a treaty signed between the Time Lords and the Daleks.Davies, Russell T. \"Meet the Doctor.\" Doctor Who Annual 2006. Ed. Clayton Hickman. Tunbridge Wells: Panini, 2005. pp. 20–21. The framing device for the I, Davros audio plays is a Dalek trial to determine if Davros should be the Daleks' leader once more.I, Davros: Innocence. Writer Gary Hopkins, Director Gary Russell. Producers Gary Russell and Jason Haigh-Ellery. Big Finish Productions, 2006."]}, {"page": "Sonic screwdriver", "response": ["It featured regularly in season 16 during the Key to Time saga. The Doctor's Time Lady companion Romana constructed a sonic screwdriver of her own similar to the Doctor's. It is depicted as being smaller and sleeker than the Doctor's, and he was sufficiently impressed with her design that he attempted to swap screwdrivers with her in The Horns of Nimon (1979–80). By season 18, both script editor Christopher H Bidmead and producer John Nathan-Turner were eager to downplay the device as much as possible.", "The sonic screwdriver was written out of the series late in season 19, in the Fifth Doctor serial The Visitation (1982). It is destroyed by a Terileptil to prevent the Doctor from escaping a holding cell; in response, the Doctor sorrowfully remarked, \"I feel as if you've just killed an old friend.\" Eric Saward later explained in a 2005 DVD interviewCommentary on DVD of The Visitation that this was done on the instructions of producer John Nathan-Turner. Saward had written out the sonic screwdriver, believing that the Doctor had \"a cupboard full of them\" in the TARDIS. On the basis that a device that could help in any situation was very limiting for the script, Nathan-Turner decided that it would not return.Commentary on DVD of Castrovalva The Tenth Doctor joked about the Fifth Doctor's lack of sonic screwdriver in the mini-episode \"Time Crash\" (2007), commenting that he \"went hands-free\" and could \"save the universe using a kettle and some string.\" The device did not appear again for the remainder of the original series."]}, {"page": "Sontaran", "response": ["Most of the Sontarans depicted in the television series have had short names, many beginning with an initial 'st' sound. Examples include Styre (The Sontaran Experiment), Stor (The Invasion of Time), Stike (The Two Doctors), Staal (\"The Sontaran Stratagem\" / \"The Poison Sky\"), Stark (\"The Pandorica Opens\"), Strax and Stenck (\"The Vanquishers\"); others are Skorr (\"The Sontaran Stratagem\" / \"The Poison Sky\"), Ritskaw and Kragar (\"The Halloween Apocalypse\"), Skaak (\"War of the Sontarans\"), Linx (The Time Warrior), Varl (The Two Doctors), Jask (\"The End of Time\") and Kaagh (The Sarah Jane Adventures)). Elements of the Sontaran military structure mentioned in the series include the \"Sontaran G3 Military Assessment Survey\" and the \"Grand Strategic Council\",The Sontaran Experiment, Writers Bob Baker and Dave Martin, Director Rodney Bennett, Producer Philip Hinchcliffe. Doctor Who. BBC One, London. 22 February – 1 March 1975. the Ninth Sontaran Battle Group,The Two Doctors, Writer Robert Holmes, Director Peter Moffatt, Producer John Nathan-Turner. Doctor Who. BBC One, London. 16 February – 2 March 1985. the \"Fifth Army Space Fleet of the Sontaran Army Space Corps\",The Time Warrior, Writer Robert Holmes, Director Alan Bromly, Producer Barry Letts. Doctor Who. BBC One, London. 15 December 1973 – 5 January 1974. and the \"Tenth Sontaran Battle Fleet\".\"The Sontaran Stratagem\", Writer Helen Raynor, Director Douglas Mackinnon, Producer Susie Liggat, Executive Producers Russell T Davies, Julie Gardner, Phil Collinson. Doctor Who. BBC One, Cardiff. 26 April 2008. Military titles include Commander, Group Marshal, Field Major, and General. Agnomens include \"the Undefeated\", \"the Bloodbringer\", \"the Avenger\", and \"the Slayer\"."]}, {"page": "Patrick Troughton", "response": ["Troughton returned to Doctor Who three times after formally leaving the programme, returning to the character more than any other actor who portrayed the Doctor after ending his regular connection with the series. The first of these occasions was in The Three Doctors, the 1972–73 serial opening the programme's 10th season. In 1983, Troughton overcame some reluctance to reprise his role and agreed to appear in the 20th anniversary special The Five Doctors at the request of series producer John Nathan-Turner. He also agreed to attend Doctor Who conventions including the show's 20th anniversary celebrations at Longleat in 1983. He also appeared around the world with Nathan-Turner. Troughton enjoyed the return to the programme so much that he readily agreed to appear one more time as the Second Doctor, with Colin Baker's Sixth Doctor in The Two Doctors (1985). Reportedly, he also advised the Fifth Doctor, actor Peter Davison, to limit his time in the role to three seasons to avoid typecasting and the younger actor followed this advice."]}, {"page": "Shada (Doctor Who)", "response": ["Following the departure of Williams from the role of producer, attempts were made by new producer John Nathan-Turner to remount the story; for various reasons, however, this never transpired. Consequently, in June 1980, the production was formally dropped. It is estimated that only 50% of the story was filmed.", "A decade after the serial's abandonment, John Nathan-Turner set out to complete the story, in a fashion, by commissioning new effects shots and a score, and having Tom Baker record linking material to cover the missing scenes. The resulting shortened episodes (of between 14 and 22 minutes each) received a 111-minute VHS release in 1992. In its UK edition, the VHS was accompanied by a facsimile of a version of Douglas Adams's script. The release was discontinued in the UK in 1996."]}, {"page": "City of Death", "response": ["Writer David Fisher had contributed two scripts to Doctor Whos sixteenth season – The Stones of Blood and The Androids of Tara – and was asked by producer Graham Williams for further story ideas. Fisher submitted two proposals; the first of these became The Creature from the Pit while the other, The Gamble with Time, concerned a plot to rig the casinos in Las Vegas to finance time travel experiments.Pixley, Archive Feature. City of Death, p. 26 Williams asked Fisher to rework The Gamble With Time as a spoof of Bulldog Drummond, a fictional adventurer from the 1920s. Fisher's draft script centered around Scarlioni, a member of the Sephiroth race, who had become fractured in time in an accident. The script was mainly set in the year 1928 with the Doctor and Romana, aided by Drummond-esque detective \"Pug\" Farquharson, on the trail of the stolen Mona Lisa, pursuing Scarlioni from Paris to Monte Carlo where his partner, the Baroness Heidi, is using time travel technology to cheat at roulette at the casino to fund Scarlioni's time travel experiments. Other settings included Paris in 1979, Leonardo da Vinci's studio in the year 1508 and prehistoric Earth.Strading & Morris, Paris in the Springtime. At this point, production unit manager John Nathan-Turner had worked out that the production team could afford to film on location in Paris with a stripped-down crew.Pixley, Archive Feature. City of Death, p. 27 This necessitated a rewrite to Fisher's scripts to move the action to Paris and, for cost reasons, to drop the 1920s setting. The Doctor's robotic dog companion K9 also had to be removed from the script as the cost of bringing the robot dog and his operators to Paris was prohibitive.Howe et al., The Handbook, p. 471."]}, {"page": "Romana (Doctor Who)", "response": ["Although Tamm had left the show on relatively good terms and was willing to film a regeneration sequence for the start of Season 17, she was not invited to do so.\"There's Something About Mary\" DVD featurette There was a rumour, purportedly started by former producer John Nathan-Turner,Mary Tamm ('Doctor Who') – Doctor Who Interview – Cult – Digital Spy that the real reason Tamm left was that she was pregnant. Tamm has denied this repeatedly over the years."]}, {"page": "Tom Baker", "response": ["Baker played the Doctor for seven consecutive seasons, making him the longest-serving actor in the part, and his incarnation is often regarded as the most popular of the Doctors. According to BBC News in 2006, in polls conducted by Doctor Who Magazine, Baker had only lost the \"Best Doctor\" category to Sylvester McCoy in 1990 and to David Tennant in 2006. In a 2010 interview, Baker said that he had not watched Tennant's performance as the Doctor but thought his Hamlet was excellent. Many of the stories from his early period are considered to be classics of the series, including The Ark in Space (1975), Genesis of the Daleks (1975), The Brain of Morbius (1976), The Deadly Assassin (1976) and The Robots of Death (1977). However, the violent tone of the stories produced by Philip Hinchcliffe saw the series come under heavy criticism from morality campaigner Mary Whitehouse. Concerns over violence during this early period led to a lightening of the tone and an \"erratic decline\" in both the popularity and quality of the series. In a 2014 interview, Baker described Hinchcliffe as \"amazing\" and identified that as his favourite period of his time on the series. He described Hinchcliffe's successor, Graham Williams, as \"absolutely devoted\" but lacking his predecessor's flair and \"let me get away with murder\". He acknowledged that his final producer on the series, John Nathan-Turner, made changes he did not agree with and they \"did not see eye-to-eye really about very much\"; however, according to Baker, the two became good friends afterwards and forgot their disagreements. Baker additionally criticised season 18, his last on the show and Nathan-Turner's first as producer, for an increase in the regular cast, which resulted in what Baker saw as stories that were excessively reliant on the Doctor (rather than other principal characters) to drive the plot forward. Baker ultimately suggested that he may have stayed in the role for one series too many, stating in hindsight that he felt it would have been better for him to have left with Williams and let Nathan-Turner recast the role of the Doctor for season 18."]}, {"page": "Colin Baker", "response": ["Baker made his first appearance in Doctor Who as Commander Maxil in the Peter Davison-era story Arc of Infinity (1983). He then became the second of three actors to be cast as the Doctor by producer John Nathan-Turner. Baker's first appearance in the starring role occurred in the final moments of The Caves of Androzani (1984), where he delivered his first few lines. He then made his full story debut the following week in The Twin Dilemma. The serial, and Baker's portrayal of the Doctor, caused immediate controversy, with one scene in which the Doctor attempts to strangle his companion, Peri Brown. According to PopMatters, \"Colin Baker's first appearance was just out-and-out dislikable, showcasing a hubris and harshness that was heretofore unseen in the Doctor's emotional canon.\"", "Doctor Who returned to television for its 23rd season in September 1986. The season featured a reduction in episodes, was made entirely on video for location scenes and was produced as a 14-episode-long serial called The Trial of a Time Lord. This serial was a meta-textual reference to the fact that the series itself was \"on trial\" at this time.DVD Commentary: Trial of a Time Lord, Discs 1–4 Region 1 Edition In 1986 Baker told an interviewer: \"Tom Baker did it for seven years. ... There's a part of me which likes to have a tilt at records. I would like to think that maybe I'd still be doing it in eight years' time.\" However, later that year Michael Grade agreed to commission another series on the condition that Baker was replaced. The BBC's Head of Series, Jonathan Powell, later said that the BBC was looking for \"one last chance saloon, for an actor who would take off with the public.\"Trials and Tribulations – documentary on Colin Baker's era of Doctor Who (2008 2entertain DVD release). However, Peter Davison argued in 2018 that the decision was more to do with the executives wanting to get rid of John Nathan-Turner, saying: \"I was upset about what happened, really – because, first of all, it wasn't to do with Colin, I know that. It was to do with other issues. The power structure in the BBC had changed and they didn't want John Nathan-Turner around is the truth of it.\""]}, {"page": "Michael Grade", "response": ["In the autumn of 1986, Grade decided that season 24 of Doctor Who could only happen on the condition that Colin Baker was removed from the title role. Years later Grade stated that he thought Baker's portrayal of the Doctor was \"utterly unlikeable; absolutely God-awful in fact\". However, his immediate predecessor in the role, Peter Davison, argued in 2018 that the decision to dismiss Baker was more to do with the executives wanting to get rid of the series' producer, John Nathan-Turner, saying: \"I was upset about what happened, really – because, first of all, it wasn't to do with Colin, I know that. It was to do with other issues. The power structure in the BBC had changed and they didn't want John Nathan-Turner around is the truth of it.\""]}, {"page": "Time and the Rani", "response": ["Newly appointed script editor Andrew Cartmel said there were many things he disliked about the script, which he felt lacked depth: \"This was a story which wasn't about anything—and, frustratingly, it was Sylvester McCoy's debut.\" Cartmel also stated that the Bakers’ scripts were also disliked by other members of the cast and crew including producer John Nathan-Turner."]}, {"page": "Paradise Towers", "response": ["The music was originally meant to be provided by a member of the BBC Radiophonic Workshop, but producer John Nathan-Turner had decided that the incidental music no longer needed to be produced in-house. Instead, freelance composer David Snell was hired to provide the score, but Nathan-Turner terminated the commission very late in the production as he was unsatisfied with the way the score was done. Snell's original score was kept, albeit in lower quality, and is available on the DVD release of the story as an alternative soundtrack. Keff McCulloch provided the final score at short notice. Originally only booked to score Time and the Rani and Delta and the Bannermen for Season 24, he composed the replacement score to Paradise Towers in a week.Horror on the High Rise (DVD Documentary)", "Richard Briers' performance has attracted considerable criticism. In the DVD special features, it is mentioned that both John Nathan-Turner and Andrew Cartmel were unhappy with his performance during the recording, and Briers admits he ignored directions to tone it down. Patrick Mulkern, writing for Radio Times, described Briers' performance as a \"career low\", stating Briers is \"shockingly bad in this story...there’s no escaping the fact that the Chief Caretaker, the key baddie in Paradise Towers, is just Richard Briers in a silly cap, silly moustache, putting on a silly voice. Mugging for England. Sending up Doctor Who in a horribly misjudged, self-indulgent performance, especially after the Caretaker has been 'zombified' by the Great Architect. Briers growls and clomps about like an embarrassing dad playing the Bogeyman. It plunges an already teetering production into the abyss.\""]}, {"page": "Remembrance of the Daleks", "response": ["Producer John Nathan-Turner wanted to start Doctor Who twenty-fifth anniversary season \"with a bang\" by doing a story with the Doctor's most famous adversaries, the Daleks. Nathan-Turner and script editor Andrew Cartmel hired Ben Aaronovitch to write the story; Aaronovitch, who had not written for television before, was ecstatic. Aaronovitch was 25 years old at the time, and had been recommended to Cartmel by fellow BBC script editor Caroline Oulton. He initially developed a story idea which later became Battlefield (1989), before Cartmel then commissioned Aaronovitch to write the Dalek story, originally titled Nemesis of the Doctor. According to deals made with Terry Nation, the creator of the Daleks, the script for a Dalek story had to be approved by Nation if he was not writing it. Despite initial concerns, the storyline was approved. One of Cartmel's goals with the story was to have the Doctor be a commanding centre, rather than being \"pushed and pulled\" by the story as he felt had been happening recently. As such, Aaronovitch wanted there to be a spirit of the Doctor just wanting to tackle the Daleks. Two of the first things Aaronovitch thought of when creating the story was the 1963 setting and a Dalek climbing up stairs. He decided to reveal the Daleks in the middle of the first episode instead of as its cliffhanger, and then have the latter be a Dalek levitating up stairs to surprise viewers. The inability of Daleks to climb stairs was an urban myth and a joke, with the Doctor even joking about it in Destiny of the Daleks (1979). Remembrance was intended to put it to rest, though Cartmel noted that the joke was still prevalent. The Dalek civil war seen in Remembrance was intended to be an outcome of the previous Dalek story, Revelation of the Daleks (1985). Aaronovitch felt that destroying Skaro at the end seemed like a logical conclusion, but he noted that it might not be the best decision in the long run."]}, {"page": "Doctor Who Magazine", "response": ["*\"John Nathan-Turner and Colin Baker: The Producer and the Doctor\"", "*\"The Man Behind Doctor Who\" (on John Nathan-Turner)", "*\"John Nathan-Turner\" (Producer)"]}, {"page": "Dimensions in Time", "response": ["*The Dimensions of Time and 3-Dimensions of Time were the working titles for this story. David Roden managed to convince producer John Nathan-Turner not to use either title, and instead settled on Dimensions in Time.", "Category:Television episodes written by John Nathan-Turner"]}, {"page": "K-9 and Company", "response": ["The programme has its roots firmly in the desire of Doctor Who producer John Nathan-Turner to get Elisabeth Sladen back into the TARDIS. He wanted her to have the contract eventually awarded to Janet Fielding in late 1980. John Nathan-Turner's preferred plan for the transition from Baker to Davison was to have Sarah Jane be along for the ride from Logopolis to the second story of series 19. However, Sladen had no interest in returning simply to reprise a role and function identical to the one she had left years before.", "The viewing figures for the pilot were strong, achieving a viewership of about 8.4 million Britons on its première. This meant that it attracted more viewers than the average episode of Doctor Who during John Nathan-Turner's era as producer. It was even more popular than the other seasonal special of the era, The Five Doctors, which posted a rating of 7.7. Only when one looks narrowly at Season 19 – the one which immediately followed the broadcast of K-9 and Company – can one find a period where sustained ratings in the parent show were higher than the ratings for this spin-off pilot.", "Category:Television series created by John Nathan-Turner"]}, {"page": "Brigadier Lethbridge-Stewart", "response": ["As one of the most popular recurring supporting characters in the television series, the Brigadier is often listed among the Doctor's companions. He is listed as such by the BBC and is included in a book by John Nathan-Turner's (a former producer of Doctor Who) discussing all the Doctor's companions."]}, {"page": "Robert Holmes (scriptwriter)", "response": ["In 1983, the then-current Doctor Who production team of producer John Nathan-Turner and script editor Eric Saward contacted Holmes about returning to script the planned twentieth anniversary special, due for broadcast that November. Holmes agreed and began writing the script. However, he found it increasingly difficult to include the many elements from the show's past that Nathan-Turner had insisted on. After the rejection of his first outline, he eventually gave up on the assignment (the special was eventually scripted by Terrance Dicks). The ordeal did lead to a friendship between Saward and Holmes that would eventually lead to Holmes return to the series for the following season.", "John Nathan-Turner wanted to shoot a story abroad for season 22, similar to previous seasons. The show's then US distributor Lionheart initially offered to co-fund filming in America. Holmes was commissioned to write the story which was originally set in New Orleans. However, Lionheart suddenly backed out, and a number of other locations were considered. The production team settled on shooting in Seville. Holmes found The Two Doctors a difficult story, as Nathan-Turner had insisted that the Sontarans appear in it.  Like much of season 22, the story came under fire for violence and disturbing content. Holmes was a vegetarian, so many themes in the story were deliberately intended to represent his views about eating meat and slaughtering animals for consumption. "]}, {"page": "Richard Hurndall", "response": ["In 1983, to celebrate the 20th anniversary of the BBC science fiction television series Doctor Who, producer John Nathan-Turner planned a special event, The Five Doctors, a 90-minute episode to feature four of the five actors who had at that point played the role of the Doctor. William Hartnell, the actor who originated the role, had died in 1975. Hurndall eventually won the role of the First Doctor, playing him as \"acerbic and temperamental but in some ways wiser than his successors.\" His casting in the role was approved by Hartnell's widow, Heather. When Tom Baker, who played the Fourth Doctor, declined to appear in the programme, Hurndall's role was expanded slightly to have the First Doctor take a greater part in the action."]}, {"page": "The Mysterious Planet", "response": ["From this serial until the end of the show in 1989, all location work would be recorded on Outside Broadcast (OB) tape instead of the usual 16mm film. The only footage shot on film for this episode was the opening special effects shot of the TARDIS. The BBC had been encouraging the replacement of film cameras with OB cameras since the early 1980s on the grounds that they were cheaper, and mixed with studio-shot material better. John Nathan-Turner had actually wanted to switch to OB shooting as early as Peter Davison's first season in 1982, but met with resistance from the directors working on the show at the time, so was overruled.", "Dominic Glynn was hired to score the incidental music for The Mysterious Planet, then John Nathan-Turner offered him the chance to rearrange the opening title music. His new score for the opening theme was the shortest-lived, lasting for this season alone (not counting the unused 1973 version by Delia Derbyshire and Paddy Kingsland)."]}, {"page": "Mindwarp", "response": ["Initially it was intended that the BBC Radiophonic Workshop would provide music scores for both this and the following segment of The Trial of a Time Lord; both were assigned to Malcolm Clarke to begin with, although Terror of the Vervoids was reassigned to Elizabeth Parker shortly afterwards. However, fellow Radiophonic Workshop composer Jonathan Gibbs left early in 1986 and was not replaced until the following year, leaving the other composers backlogged and with no one free to do the incidental music for Mindwarp. It was suggested that Dick Mills could provide both the music and sound effects, but John Nathan-Turner rejected this idea and instead hired film composer Richard Hartley to create the incidental music for this segment. It would be the only time that Hartley worked on the series. The original recordings of Hartley's score no longer exist in the BBC archives with the result that there was no isolated score included on the DVD release of this story. For the Blu-Ray release of Season 23, Richard Hartley, along with Mark Ayres re-recorded the entire score in order to present the serial in a new 5.1 mix."]}, {"page": "Terror of the Vervoids", "response": ["This story segment of Trial went through a number of commissions with writers including David Halliwell & Jack Trevor Story (working on separate but linked episodes), Christopher H. Bidmead and Peter J. Hammond, the creator of the cult science-fiction fantasy series Sapphire & Steel. Hammond's story outline, titled Paradise Five, was liked by script editor Eric Saward but disliked by producer John Nathan-Turner, who rejected it and commissioned Pip and Jane Baker to do the segment instead. Nathan-Turner also was displeased with the appearance of the Vervoids, likening them to labia. Hammond later wrote two episodes of the Doctor Who spin-off drama, Torchwood."]}, {"page": "Christopher Priest (novelist)", "response": ["Priest was approached to write stories for the 18th and 19th seasons of Doctor Who. The first, \"Sealed Orders\", was a political thriller based on Gallifrey commissioned by script editor Douglas Adams; it was eventually abandoned due to script problems and replaced with \"Warriors' Gate\". The second, \"The Enemy Within\", was also eventually abandoned due to script problems and what Priest perceived as insulting treatment after he was asked to modify the script to include the death of Adric. It was replaced by \"Earthshock\". Priest received payment while Doctor Who producer John Nathan-Turner and script editor Eric Saward were forced to pen a letter of apology for the treatment of the writer. This falling-out soured the attitude of the production office to the use of established literary authors, and no more were commissioned until Neil Gaiman authored the episode \"The Doctor's Wife\" in 2011."]}, {"page": "Anthony Ainley", "response": ["Reportedly, it was his performance as Rev. Emilius (in The Pallisers) that led to him being offered the role of the Master by John Nathan-Turner, who had worked on The Pallisers seven years before becoming producer of Doctor Who. Ainley first portrayed the Master in the 1981 serial The Keeper of Traken and appeared in almost every season up until the cancellation of the original series in 1989, including its final serial, Survival."]}, {"page": "The Ultimate Foe", "response": ["Robert Holmes was originally commissioned to write the two episodes. However, he died from a chronic liver ailment after completing a draft of the first and left nothing beyond a plot outline of the second. The series script editor Eric Saward resigned around this time due to disagreements with the producer, John Nathan-Turner, but agreed to write the final episode based on Holmes' outline, and also rewrite Holmes' draft to tie the two together, for which he was credited as Script Editor. Much of Holmes's original draft, involving as it did a reenactment of one of the Whitechapel Murders ascribed to Jack the Ripper, was felt to be unsuitable, and most of the material set in the Matrix in the episode credited to Holmes is in fact Saward's work. The original ending to the segment as a whole (and, indeed, the whole Trial story and possibly the series) would have seen the Doctor and the Valeyard in an inconclusive cliffhanger, both (seemingly) plunging into a void to their deaths as an extra \"hook\". However, Nathan-Turner felt this was too downbeat and believed that it was important that the season did not end on an inconclusive note to demonstrate the series was back in business and avoid providing an excuse for BBC management to cancel the series altogether. Saward refused to change the ending and withdrew permission to use his script very late in the day, by which point the production team had been assembled and the segment was entering rehearsals.", "John Nathan-Turner commissioned Pip and Jane Baker to write a replacement final episode. For copyright reasons they could not be told anything of the content of Saward's script (and there were lawyers observing all the commissioning meetings). The only similarity between the two is the announcement that the High Council of the Time Lords have resigned, which was a natural development of the earlier scripts. The new script ended on an optimistic note, with the Doctor departing for new adventures. In keeping with this more optimistic stance, Nathan-Turner decided to amend the script at the last minute to show how Peri had not died as shown in Mindwarp but had in fact survived and became Yrcanos's warrior queen. Her apparent death was a part of the Valeyard's tampering with the Matrix. A shot from the earlier story was used to show this. Nicola Bryant was absolutely disappointed to learn how the fate of her character had been changed.\"Trials and Tribulations\", The Ultimate Foe DVD featurette. The working title of this story was Time Incorporated. This title did not appear in the final scripts or on-screen."]}, {"page": "The Caves of Androzani", "response": ["Christopher Gable, who played Sharaz Jek, was a well-known actor and formerly a leading ballet dancer. Gable was not the only contender to play Jek; John Nathan-Turner, who always favoured attracting big stars to the series in guest roles, had offered the role to actor Tim Curry, as well as rock stars Mick Jagger and David Bowie. Bowie's management declined on his behalf as the dates clashed with his Serious Moonlight Tour according to Bowie biographer Nicholas Pegg.  Ultimately, Christopher Gable was cast, the preferred choice of director Graeme Harper (Harper claimed on the DVD commentary that Bowie was the only other contender he thought of but he believed Gable ended up being right for it). Robert Glenister and Peter Davison had previously played brothers Brian and Steve Webber in the BBC sitcom Sink or Swim (1980–82). Glenister later played Aboresh in the audio play Absolution and Thomas Edison in \"Nikola Tesla's Night of Terror\". John Normington guest stars as Morgus; he returned to the series as Trevor Sigma in the Seventh Doctor story The Happiness Patrol (1988). He also appeared in \"Ghost Machine\" (2006), an episode of the Doctor Who spin-off Torchwood."]}, {"page": "Jonathan Powell (producer)", "response": ["In late 1983, he was made Head of Drama Series and Serials at BBC Television. He oversaw a period of change in BBC drama, with more original programmes being produced as well as classic adaptations, and more programmes being made on film rather than in the BBC TV studios on videotape. While Powell was heading BBC drama series, the soap operas EastEnders and Howards' Way were launched (both in 1985) and the medical drama Casualty (1986). In 1985, he and BBC1 controller Michael Grade attempted to cancel Doctor Who. In common with Grade, Powell had a low opinion of the series and especially despised its producer, John Nathan-Turner, who he later said he wanted to \"fuck off... or die, really\".Matthew Sweet \"JN-T: The Life and Scandalous Times of John Nathan-Turner by Richard Marson – review\", The Guardian (website), 22 March 2013 After an outcry from the series' fans and a tabloid campaign, this decision became an 18-month hiatus instead."]}, {"page": "Mawdryn Undead", "response": ["David Collings, who played Mawdryn, also appeared in the Fourth Doctor serials Revenge of the Cybermen (1975) as Vorus and The Robots of Death (1977) as Poul, and would himself play an alternate Doctor in Big Finish Productions' Doctor Who Unbound audio play, Full Fathom Five. Angus MacKay previously played Borusa in The Deadly Assassin (1976). John Nathan-Turner felt that Mark Strickson's blond hair didn't stand out well enough from Peter Davison's blond hair. He initially asked Strickson to shave his head, but when Strickson declined, Turner decided that Strickson's hair should be dyed red."]}, {"page": "Enlightenment (Doctor Who)", "response": ["After penning a number of radio and TV scripts, including episodes of Crossroads and Waggoner's Walk, Barbara Clegg submitted a story idea to Doctor Who script editor Eric Saward, an acquaintance from the BBC drama department. Interested in writing for the series, Clegg had been inspired when distant relatives had stayed with her and demanded constant entertainment during their visit, basing the character of the Eternals upon them. Initially titled The Enlighteners, her submission involved ships racing through space that, with the addition of the Black Guardian sub-plot, eventually evolved into the story as screened. Saward and series producer John Nathan-Turner liked Clegg's ideas, and they commissioned the script in September 1981. ", "The interior sets of the boats were not built specifically for the programme, but were pulled together from stock items from various prop warehouses. Cumming had originally hoped to simulate the rocking of the ships by mounting the sets on rollers but the idea was dropped due to costs, with the effect achieved by moving the cameras instead. The photo of Tegan's Aunt Vanessa, one of the items created by Marriner from the contents of her mind, was shot specifically for the filming, requiring Dolore Whiteman (who had played the character in Logopolis) to be contracted for a one-day photoshoot. The models of the boats, used in the racing sequences, were props sourced by visual effects designer Mike Kelt following extensive research at the National Maritime Museum. The ships were mounted on rods for filming, while the oars were battery operated. The model of Davey's ship remained intact, with its explosion being a filmed effect that was edited into the sequence. Kelt was shocked by the dilapidated state of the TARDIS console prop, and was worried about damaging it while filming the explosion from Part One, and asked producer John Nathan-Turner if he could replace it but was told there was no money available."]}, {"page": "Andrew Cartmel", "response": ["In late 1986, when he was in his late twenties, Cartmel was hired as the script editor for the twenty-fourth season of the science-fiction programme Doctor Who, having been recommended to the producer John Nathan-Turner by the producer's agent, who had seen some unproduced scripts Cartmel had written. Cartmel worked on the programme for the next three years, overseeing the final three seasons of its original run on BBC One. He brought in several young, new writers and despite declining ratings, tried to take the series in a new creative direction."]}, {"page": "Television producer", "response": ["* John Nathan-Turner: Doctor Who (1980–1989)"]}, {"page": "The Five Doctors", "response": ["In the various publicity photos of the five Doctors from this story, a waxwork model of Tom Baker from a 1980 Doctor Who Exhibition in Madame Tussauds was used. According to producer John Nathan-Turner, Baker had agreed to do the photocall for the 20th anniversary but, suspecting that he might not turn up, Nathan-Turner arranged for the waxwork to be on location."]}, {"page": "Survival (Doctor Who)", "response": ["Having already surmised that episode three of Survival was likely to at least be the last episode of Doctor Who for some time, and possibly the last ever, the programme's producer John Nathan-Turner decided close to transmission that a more suitable conclusion should be given to the final episode. To this end, script editor Andrew Cartmel wrote a short, melancholic closing monologue for actor Sylvester McCoy, which McCoy recorded on 23 November 1989, the day after Episode 1 was broadcast, and also by coincidence, the show's twenty-sixth anniversary:"]}, {"page": "Dreamwatch", "response": ["The publication began life in July 1983 as an amateur fanzine dedicated to the popular science-fiction television series Doctor Who, and was published under the title Doctor Who Bulletin. In this form, it became well known for taking a generally critical tone towards the later seasons of the programme, particularly the work of producer John Nathan-Turner, who was subjected to several personal attacks in its pages. However, it became popular with some fans due to its frequent reporting of news concerning the show before it was released through official sources, and as an alternative viewpoint to the officially sanctioned Doctor Who Magazine or Celestial Toyroom, the newsletter of the Doctor Who Appreciation Society. There were, however, occasional embarrassing errors, such as the printing of an obituary for actor Kevin Stoney in 1986, who was still alive and after the article's appearance would happily sign copies for fans at conventions. The fanzine also gained a reputation for being sometimes too willing to report rumour as fact."]}, {"page": "The Doctor (Doctor Who)", "response": ["In voiceovers on Peter Davison's DVDs, the matter of physical affection is discussed. According to Davison and Matthew Waterhouse (Adric), producer John Nathan-Turner had very strict rules laid down about how the companions were allowed to physically interact with the Doctor, and Adric was allowed more physical contact with the Doctor than the female companions to downplay potential romantic and/or sexual connotations."]}]}}