{"wiki_id": "http://www.wikidata.org/entity/Q827188", "itemLabel": "John Hoyland", "itemDescription": "British painter and printmaker (1934-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hoyland", "wikipedia_page": {"main": "John Hoyland RA (12 October 1934 – 31 July 2011) was a London-based British artist. He was one of the country's leading abstract painters.", "link_mentions": [{"page": "History of painting", "response": ["Color Field painting sought to rid art of superfluous rhetoric. Artists like Clyfford Still, Mark Rothko, Hans Hofmann, Morris Louis, Jules Olitski, Kenneth Noland, Helen Frankenthaler, John Hoyland, Larry Zox, and others often used greatly reduced references to nature, and they painted with a highly articulated and psychological use of color. In general these artists eliminated recognizable imagery. Certain artists quoted references to past or present art, but in general color field painting presents abstraction as an end in itself. In pursuing this direction of modern art, artists wanted to present each painting as one unified, cohesive, monolithic image.", "During the 1960s and 1970s artists such as Robert Motherwell, Adolph Gottlieb, Phillip Guston, Lee Krasner, Cy Twombly, Robert Rauschenberg, Jasper Johns, Richard Diebenkorn, Josef Albers, Elmer Bischoff, Agnes Martin, Al Held, Sam Francis, Ellsworth Kelly, Morris Louis, Helen Frankenthaler, Gene Davis, Frank Stella, Kenneth Noland, Joan Mitchell, Friedel Dzubas, and younger artists like Brice Marden, Robert Mangold, Sam Gilliam, John Hoyland, Sean Scully, Pat Steir, Elizabeth Murray, Larry Poons, Walter Darby Bannard, Larry Zox, Ronnie Landfield, Ronald Davis, Dan Christensen, Joan Snyder, Ross Bleckner, Archie Rand, Susan Crile, and dozens of others produced a wide variety of paintings."]}, {"page": "Kingston upon Thames", "response": ["Fine art is also a prominent feature in the history of Kingston. Both John Hoyland and Jeremy Moon worked from permanent studios in Kingston and many prominent artists and designers have studied at the university including Fiona Banner, John Bratby, David Nash and Jasper Morrison."]}, {"page": "Playing card", "response": ["In 1976, the JPL Gallery in London commissioned a card deck from a variety of contemporary British artists including Maggie Hambling, Patrick Heron, David Hockney, Howard Hodgkin, John Hoyland, and Allen Jones called \"The Deck of Cards\". Forty years later in 2016, the British Council commissioned a similar deck called \"Taash ke Patte\" featuring Indian artists such as Bhuri Bai, Shilpa Gupta, Krishen Khanna, Ram Rahman, Gulam Mohammed Sheikh, Arpita Singh, and Thukral & Tagra."]}, {"page": "Expressionism", "response": ["*United Kingdom: Francis Bacon, Frank Auerbach, Leon Kossoff, Lucian Freud, Patrick Heron, John Hoyland, Howard Hodgkin, John Walker"]}, {"page": "Abstract expressionism", "response": ["* John Hoyland (1934–2011)"]}, {"page": "Howard Hodgkin", "response": ["In 1980, Hodgkin was invited by John Hoyland to exhibit work as part of the Hayward Annual at the Hayward Gallery along with Gillian Ayres, Basil Beattie, Terry Setch, Anthony Caro, Patrick Caulfield, Ben Nicholson and others.", "In September 2010, Hodgkin and five other British artists, John Hoyland, John Walker, Ian Stephenson, Patrick Caulfield and R.B. Kitaj, were in an exhibition entitled The Independent Eye: Contemporary British Art From the Collection of Samuel and Gabrielle Lurie, at the Yale Center for British Art.Wilkin, Karen, \"Channeling American Abstraction\", The Wall Street Journal, 28 September 2010. Retrieved 7 October 2010.Schwendener, Martha, \"Echoes From a Distant Contemporary Past\" (exhibition review), The New York Times, 10 December 2010.Retrieved 15 December 2010"]}, {"page": "John Walker (painter)", "response": ["In September 2010, Walker and five other British artists including Howard Hodgkin, John Hoyland, Ian Stephenson, Patrick Caulfield and R.B. Kitaj were included in an exhibition entitled The Independent Eye: Contemporary British Art From the Collection of Samuel and Gabrielle Lurie, at the Yale Center for British Art.Channeling American Abstraction, Karen Wilkin, Wall Street Journal. Retrieved 7 October 2010NY Times, exhibition review. Retrieved 15 December 2010"]}, {"page": "Patrick Caulfield", "response": ["Patrick Caulfield studied at Chelsea School of Art from 1956 to 1960, and during this time he won two prizes which funded a trip he made to Greece and Crete upon graduation. The visit to the island proved important, with Caulfield finding inspiration in the Minoan frescoes and the bright, hard colours on Crete. One of his greatest friends was the abstract painter John Hoyland, whom he first met at the Young Contemporaries exhibition in 1959.  Progressing to the Royal College of Art from 1960 to 1963,Caulfield 1992, p. 81. his contemporaries included David Hockney and Allen Jones.Burn 2006. He taught at Chelsea School of Art from 1963–71. In 1964, he exhibited at the New Generation show at London's Whitechapel Gallery, which resulted in him being associated with the pop art movement. This was a label Caulfield was opposed to throughout his career, seeing himself rather as \"a 'formal' artist\".", "On 24 May 2004, a fire in a storage warehouse destroyed many works from the Saatchi collection, including three by Caulfield. In September 2010 Caulfield and five other British artists, Howard Hodgkin, John Walker, Ian Stephenson, John Hoyland, and R.B. Kitaj were included in an exhibition entitled The Independent Eye: Contemporary British Art From the Collection of Samuel and Gabrielle Lurie, at the Yale Center for British Art.Channeling American Abstraction, Karen Wilkin, Wall Street Journal Retrieved 7 October 2010NY Times, exhibition review Retrieved 15 December 2010"]}, {"page": "List of British painters", "response": ["*John Hoyland (1934–2011)"]}, {"page": "Damien Hirst", "response": ["In November 2006, Hirst was curator of In the darkest hour there may be light, shown at the Serpentine Gallery, London, the first public exhibition of (a small part of) his own collection.Spears-Meers, Emily. 'High Art Lite in the Darkest Hour', Oxonian Review, 1 March 2007. Retrieved 29 December 2010. Now known as the 'murderme collection', this significant accumulation of works spans several generations of international artists, from well-known figures such as Francis Bacon, Jeff Koons, Tracey Emin, Richard Prince, Banksy and Andy Warhol, to British painters such as John Bellany, John Hoyland, and Gary Hume, and artists in earlier stages of their careers Rachel Howard, David Choe, Ross Minoru Laing, Nicholas Lumb, Tom Ormond, and Dan Baldwin."]}, {"page": "Timeline of art", "response": ["* 2011 in art - Death of B. H. Friedman, Ellen Stewart, Dennis Oppenheim, Françoise Cachin, Charles O. Perry, Roy Gussow, Alan Uglow, Suze Rotolo, Gabriel Laderman, Leo Steinberg, George Tooker, Stephen De Staebler, Hedda Sterne, John McCracken, Leonora Carrington, Claudio Bravo, M. F. Husain, Jack Smith, Thomas N. Armstrong III, Robert Miller, Cy Twombly, Lucian Freud, John Hoyland, Budd Hopkins, Jeanette Ingberman, Richard Hamilton, Stephen Mueller, Pat Passlof, Gerald Laing, John Chamberlain, Helen Frankenthaler"]}, {"page": "List of modern artists", "response": ["* John Hoyland"]}, {"page": "Anthony Caro", "response": ["His first solo exhibition was at the Galleria del Naviglio in Milan in 1956, and his first solo show in London was at the Gimpel Fils Gallery the next year. Another solo show was at the Whitechapel Art Gallery in 1963. In 1967 Caro began exhibiting regularly with Kasmin in London, and in 1969, he began showing with André Emmerich in New York. In the same year he showed at the São Paulo Biennale with John Hoyland. In 2004, to honour his 80th birthday, Tate Britain and other galleries held exhibitions of his work."]}, {"page": "R. B. Kitaj", "response": ["In September 2010, Kitaj and five British artists including Howard Hodgkin, John Walker, Ian Stephenson, Patrick Caulfield and John Hoyland were included in an exhibition entitled The Independent Eye: Contemporary British Art From the Collection of Samuel and Gabrielle Lurie, at the Yale Center for British Art.Channeling American Abstraction, Karen Wilkin, Wall Street Journal Retrieved October 7, 2010NY Times, exhibition review Retrieved December 15, 2010"]}, {"page": "Color field", "response": ["The artists associated with the color field movement during the 1960s were moving away from gesture and angst in favor of clear surfaces and gestalt. During the early to mid-1960s color field painting was the term for the work of artists like Anne Truitt, John McLaughlin, Sam Francis, Sam Gilliam, Thomas Downing, Ellsworth Kelly, Paul Feeley, Friedel Dzubas, Jack Bush, Howard Mehring, Gene Davis, Mary Pinchot Meyer, Jules Olitski, Kenneth Noland, Helen Frankenthaler, Robert Goodnough, Ray Parker, Al Held, Emerson Woelffer, David Simpson, and others whose works were formerly related to second generation abstract expressionism; and also to younger artists like Larry Poons, Ronald Davis, Larry Zox, John Hoyland, Walter Darby Bannard and Frank Stella. All were moving in a new direction away from the violence and anxiety of action painting toward a new and seemingly calmer language of color.", "During the late 1960s Larry Poons whose earlier Dot paintings were associated with Op Art began to produce looser and more free formed paintings that were referred to as his Lozenge Ellipse paintings of 1967–1968. Along with John Hoyland, Walter Darby Bannard, Larry Zox, Ronald Davis, Ronnie Landfield, John Seery, Pat Lipsky, Dan Christensen  retrieved June 2, 2010 and several other young painters a new movement that related to color field painting began to form; eventually called lyrical abstraction.Ashton, Dore. \"Young Abstract Painters: Right On!\". Arts vol. 44, no. 4, February, 1970. 31–35Aldrich, Larry. Young Lyrical Painters. Art in America, vol. 57, no. 6, November–December 1969. 104–113Color Fields, Deutsche Guggenheim  Retrieved November 26, 2010 The late 1960s saw painters turning to surface inflection, deep space depiction, and painterly touch and paint handling merging with the language of color. Among a new generation of abstract painters who emerged combining color field painting with expressionism, the older generation also began infusing new elements of complex space and surface into their works. By the 1970s Poons created thick-skinned, cracked and heavy paintings referred to as Elephant Skin paintings; while Christensen sprayed loops, colored webs of lines and calligraphy, across multi-colored fields of delicate grounds; Ronnie Landfield's stained band paintings are reflections of both Chinese landscape painting and the color field idiom, and John Seery's stained painting as exemplified by East, 1973, from the National Gallery of Australia. Poons, Christensen, Davis, Landfield, Seery, Lipsky, Zox and several others created paintings that bridge color field painting with lyrical abstraction and underscore a re-emphasis on landscape, gesture and touch.Peter Schjeldahl ] comment on John Seery]Exhibition Catalogue, Ronnie Landfield: Paintings From Five Decades. The Butler Institute of American Art, Seeking the Miraculous. 5–6. Ratcliff, Carter. The New Informalists, Art News, v. 68, n. 8, December 1969, p.72.", "* John Hoyland (1934–2011)"]}, {"page": "Whitechapel Gallery", "response": ["The gallery played an important part in the history of post-war British art. Several important exhibitions were held at the Whitechapel Gallery including This is Tomorrow in 1956, the first UK exhibition by Mark Rothko in 1961, and in 1964 The New Generation show which featured John Hoyland, Bridget Riley, David Hockney and Patrick Caulfield among others.The Daily Telegraph ", "*1964 – The New Generation – Painting – showcasing the work of John Hoyland, Patrick Caulfield, David Hockney, Paul Huxley, Alan Jones and Bridget Riley"]}, {"page": "Art of the United Kingdom", "response": ["In the 1960s, Sir Anthony Caro became a leading figure of British sculptureAnthony Caro Exhibition 2005, Tate Britain Retrieved 9 December 2010 along with a younger generation of abstract artists including Isaac Witkin,May 2006, Sunday Times obituary Retrieved 9 December 2010 Phillip King and William G. Tucker.ISC Lifetime Achievements Award in Sculpture Retrieved 9 December 2010 John Hoyland,tate.org.uk  Retrieved 9 December 2010 Howard Hodgkin, John Walker, Ian Stephenson,Ian Stephenson Biography New Art Centre Retrieved 9 December 2010Ian Stephenson 1934 - 2000 Tate website Retrieved 9 December 2010 Robyn Denny, John PlumbTate Collection Retrieved 9 December 2010 and William TillyerWilliam Tillyer Retrieved 15 January 2018] were British painters who emerged at that time and who reflected the new international style of Color Field painting. During the 1960s another group of British artists offered a radical alternative to more conventional artmaking and they included Bruce McLean, Barry Flanagan, Richard Long and Gilbert and George. British pop art painters David Hockney, Patrick Caulfield, Derek Boshier, Peter Phillips, Peter Blake (best known for the cover-art for Sgt. Pepper's Lonely Hearts Club Band), Gerald Laing, the sculptor Allen Jones were part of the sixties art scene as was the British-based American painter R. B. Kitaj. Photorealism in the hands of Malcolm Morley (who was awarded the first Turner Prize in 1984) emerged in the 1960s as well as the op-art of Bridget Riley.Tate Biography Retrieved December 2010 Michael Craig-Martin was an influential teacher of some of the Young British Artists and is known for the conceptual work, An Oak Tree (1973).Irish Museum of Modern Art Website  Retrieved 9 December 2010"]}, {"page": "List of British artists", "response": ["* John Hoyland (1934–2011)"]}, {"page": "Brian Sewell", "response": ["In 1994 thirty-five figures from the art world signed a letter to the Evening Standard attacking Sewell for \"homophobia\", \"misogyny\", \"demagogy\", \"hypocrisy\", \"artistic prejudice\", \"formulaic insults\" and \"predictable scurrility\". Signatories included Karsten Schubert, Maureen Paley, Michael Craig-Martin, Christopher Frayling, John Hoyland, Sarah Kent, Nicholas Logsdail, George Melly, Sandy Nairne, Eduardo Paolozzi, Bridget Riley, Richard Shone, Marina Warner, Natalie Wheen and Rachel Whiteread."]}, {"page": "Hans Hofmann", "response": ["Posthumous retrospectives of Hofmann's work include shows at the Hirshhorn Museum (1976), Whitney Museum (1990), and London's Tate Gallery (\"Hans Hofmann: Late Paintings,\" 1988), which was curated by the British painter John Hoyland. Hoyland first encountered Hofmann's work during his first visit to New York in 1964, in the company of Clement Greenberg, and had been immediately impressed.Lambirth, Andrew (2009). John Hoyland: Scatter the Devils. Unicorn Press, p. 74."]}, {"page": "Tehran Museum of Contemporary Art", "response": ["* John Hoyland"]}, {"page": "1982 in art", "response": ["* John Moores Painting Prize - John Hoyland for \"Broken Bride 13.6.82\" "]}, {"page": "Stephen Snoddy", "response": ["In 1996, he moved to become Director of Southampton City Art Gallery, where he and later Henry Moore Foundation director Godfrey Worsdale organised the 1998 Chris Ofili solo exhibition, which helped secure Ofili the 1998 Turner Prize, and an exchange of collections with the Bilbao Museum of Fine Art, to coincide with the opening of the new Frank Gehry-designed Guggenheim Museum Bilbao. He made acquisitions for the collection included works by John Hoyland, Fiona Rae, Chris Ofili, Douglas Gordon and Julian Opie."]}, {"page": "Bryan Robertson", "response": ["Robertson became Director of the Whitechapel Art Gallery in April 1952. As curator, he created an influential programme that gave major presentations of works by Jackson Pollock, Mark Rothko and Robert Rauschenberg and the 1956 exhibition This Is Tomorrow.\"Bryan Robertson – Obituary\",   The Times, 19 November 2002 The Pollock exhibition created 'an absolute furore' (Robertson's own words), and police were summoned to control the crowds queuing to get in. The same happened with the Rauschenberg exhibition in 1964.Lambirth, Andrew (2009). John Hoyland: Scatter the Devils. Unicorn Press, p. 17 He also revived interest in the work of Barbara Hepworth and organised exhibitions of Turner (the first solo show of Turner since his death in 1851) and Stubbs.McNay, Michael. \"Obituary: Bryan Robertson: Distinguished director who turned London's Whitechapel art gallery into a beacon of new work\",  The Guardian, 19 November 2002", "Robertson was key in promoting the careers of many emerging British artists; Anthony Caro, David Hockney, John Hoyland,Lambirth, Andrew (2009). John Hoyland: Scatter the Devils. Unicorn Press, p. 17. Bridget Riley, William G. Tucker, and Phillip King. Robertson placed public education at the heart of the Whitechapel programme giving space to exhibitions of work from schools."]}, {"page": "Nigel Osborne", "response": ["In the 1980s, Osborne composed a series of \"classic works\" for choreographer Richard Alston and Ballet Rambert.'Richard Alston Choreochronicle'. Richard Alston. He has been Master of Music at the Shakespeare's Globe (1999-2000),‘THE TEMPEST (2000)’. Shakespeare's Globe. (London, UK). and is currently \"house composer\" for Ulysses Theatre, Istria (2000-). He has collaborated with notable directors Lenka Udovicki, Peter Sellars, David Pountney, Michael McCarthy and David Freeman, with notable writers Samuel Beckett, Craig Raine, Eve Ensler, Jo Shapcott, Howard Barker, Ariel Dorfman, Tena Stivicic and Goran Simić, with notable actors Vanessa Redgrave, Annette Bening, Lynn Redgrave, Amanda Plummer, Rade Serbedzija, Simon Callow, Ian McDiarmid and Janet Henfrey, and with notable artists and designers John Hoyland, Dick Smith, George Tsypin, David Roger, Bjanka Adzic Ursulov and Peter Mumford. Singers and soloists include pioneers of contemporary music, such as Jane Manning, Linda Hirst, Liz Lawrence and Omar Ebrahim, and long-standing collaborations with artists Florian Kitt, Ernst Kovacic and the Hebrides Ensemble. His film documentary credits'Nigel Osborne, Composer'. IMDb include BAFTA-winning and -nominated collaborations with Director Samir Mehanović, an EMMY-winning collaboration with the BBC, and multi-award- winning films with Helen Doyle and InformAction, Montreal. He has a special interest in Arabic, Indian and Chinese music.Colwyn Trevarthen, Maya Gratier, Nigel Osborne. 'The human nature of culture and education'. Wiley Online Library."]}, {"page": "Psalter Lane", "response": ["* John Hoyland RA"]}, {"page": "Ivan Tyrrell", "response": ["Tyrrell left Wallington County Grammar School to study art as an apprentice at F.G. Marshal in 1959. In 1962 he began a fine arts course at Croydon Art College and was taught painting by Bridget Riley, Barry Fantoni and John Hoyland among others. He left college disillusioned with the art world and worked in London advertising studios before setting up a graphic design company in 1971 on the South Coast in Sussex.Carver Tyrrell Ltd. Company number 1105253. Registered address: 97 Church St, Brighton E Sussex BN1 1UJ. Information from Companies House, UK."]}, {"page": "Lyrical abstraction", "response": ["In the 1960s, English painter John Hoyland's Color field paintings were characterised by simple rectangular shapes, high-key color and a flat picture surface. In the 1970s his paintings became more textured. During the 1960s and 1970s, he showed his paintings in New York City with the Robert Elkon Gallery and the André Emmerich Gallery. His paintings were closely aligned with Post-Painterly Abstraction, Color Field painting and Lyrical Abstraction.", "*John Hoyland (and abstract expressionism and color field painting) (1934-2011)tate.org.uk "]}, {"page": "Patrick Procktor", "response": ["In 1962 he became a professional artist and had his first show at the Redfern Gallery in London's Cork Street in 1963 – a great commercial success that helped confirm his reputation among a wider artistic circle including the theatre and music (he won numerous commissions for pop record sleeves). A year later, Procktor was featured in Bryan Robertson's New Generation exhibition at the Whitechapel Gallery – a show that also raised the profile of fellow artists David Hockney, Bridget Riley and John Hoyland."]}, {"page": "Paul Huxley", "response": ["His first solo exhibition was in 1963 at the Rowan Gallery, London, where he continued to exhibit regularly for two decades. Huxley has taken part in group exhibitions since 1959, when he exhibited in ‘Young Contemporaries’, London. In 1964 he participated in ‘The New Generation’ exhibition at the Whitechapel Art Gallery with Patrick Caulfield, David Hockney, John Hoyland and Bridget Riley. More recently he has been part of group exhibitions at the Barbican (1993), the Gulbenkian Centre for Modern Art, Lisbon (1997), and Kettle's Yard, Cambridge and Leicester City Art Gallery (both 1999)."]}, {"page": "John Moores Painting Prize", "response": ["* 1982 John Hoyland - \"Broken Bride 13.6.82\""]}, {"page": "Western painting", "response": ["Josef Albers, Hans Hofmann, Ilya Bolotowsky, Burgoyne Diller, Victor Vasarely, Bridget Riley, Richard Anuszkiewicz, Frank Stella, Morris Louis, Kenneth Noland,Terry Fenton, online essay about Kenneth Noland, and acrylic paint, Sharecom.ca, accessed 30 April 2007 Ellsworth Kelly, John McLaughlin, Barnett Newman, Larry Poons, Ronald Davis, John Hoyland, Larry Zox, Al Held, Mino Argento are artists closely associated with Geometric abstraction, Op art, Color Field painting, and in the case of Hofmann and Newman Abstract expressionism as well. Agnes Martin, Robert Mangold, Brice Marden, Jo Baer, Robert Ryman, Richard Tuttle, Neil Williams, David Novros, Paul Mogenson, are examples of artists associated with Minimalism and (exceptions of Martin, Baer and Marden) the use of the shaped canvas also during the period beginning in the early 1960s. Many Geometric abstract artists, minimalists, and Hard-edge painters elected to use the edges of the image to define the shape of the painting rather than accepting the rectangular format. In fact, the use of the shaped canvas is primarily associated with paintings of the 1960s and 1970s that are coolly abstract, formalistic, geometrical, objective, rationalistic, clean-lined, brashly sharp-edged, or minimalist in character. The Bykert Gallery, and the Park Place Gallery were important showcases for Minimalism and shaped canvas painting in New York City during the 1960s."]}, {"page": "Late modernism", "response": ["During the 1960s and 1970s artists as powerful and influential as Robert Motherwell, Adolph Gottlieb, Phillip Guston, Lee Krasner, Cy Twombly, Robert Rauschenberg, Jasper Johns, Richard Diebenkorn, Josef Albers, Elmer Bischoff, Agnes Martin, Al Held, Sam Francis, Ellsworth Kelly, Morris Louis, Helen Frankenthaler, Gene Davis, Frank Stella, Kenneth Noland, Joan Mitchell, Friedel Dzubas, and younger artists like Brice Marden, Robert Mangold, Sam Gilliam, John Hoyland, Sean Scully, Elizabeth Murray, Larry Poons, Walter Darby Bannard, Larry Zox, Ronnie Landfield, Ronald Davis, Dan Christensen, Joan Snyder, Ross Bleckner, Archie Rand, Susan Crile, Mino Argento\"Shade acrylic canvases in which geometric shapes are juxtaposed\". Betty Parsons Gallery. The New Yorker. Oct. 3, 1977 p.8 and dozens of others continued to produce vital and influential paintings."]}, {"page": "Jeremy Moon (artist)", "response": ["Moon also married Elizabeth Bryant and started teaching part-time at St Martin's School of Art and Chelsea School of Art within the same year. In 1964 they moved to a 2-bedroom flat in Swiss Cottage and Moon used one room as a studio. Son Robert was born that year. In 1966 they bought a house in Kingston upon Thames, Surrey and during the following year Moon built a large studio in the back garden, taking a lead from John Hoyland who had moved to Kingston and built a studio shortly beforehand. (Painters Bernard Cohen and John Edwards also followed suit). Second son Benedick was born at home in 1966. The first works completed in the new Kingston studio in 1967 were the Y-shaped paintings. Daughter Georgina was born at home in 1970.", "Jeremy Moon became a leading figure in British art during the 1960s and 1970s. His work was abstract and geometric in form. His early paintings until 1964 used oil on canvas, switching then to the new acrylic paints. He generally applied paint in a flat and unmodulated way using masking tape to delineate clear areas of colour. He was an early exponent of the shaped canvas and also produced a small number of 3D and relief works. Reoccurring motifs and elements within his paintings included grid-like forms composed of vertical, horizontal or diagonal lines. Drawing was a central part of his practice and he used pencil, pen and pastels incessantly on A4 letter-writing paper to develop ideas for works. His peers included John Hoyland, Bridget Riley, Ian Stephenson, Bernard Cohen, Patrick Caulfield, Phillip King and Anthony Caro."]}, {"page": "20th-century Western painting", "response": ["Josef Albers, Hans Hofmann, Ilya Bolotowsky, Burgoyne Diller, Victor Vasarely, Bridget Riley, Richard Anuszkiewicz, Frank Stella, Morris Louis, Kenneth Noland, Ellsworth Kelly, Barnett Newman, Larry Poons, Ronald Davis, John Hoyland, Larry Zox, and Al Held are artists closely associated with Geometric abstraction, Op art, Color Field painting, and in the case of Hofmann and Newman Abstract expressionism as well. Agnes Martin, Robert Mangold, Brice Marden, Jo Baer, Robert Ryman, Richard Tuttle, Neil Williams, David Novros, Paul Mogenson, are examples of artists associated with Minimalism and (exceptions of Martin, Baer and Marden) the use of the shaped canvas also during the period beginning in the early 1960s. Many Geometric abstract artists, minimalists, and Hard-edge painters elected to use the edges of the image to define the shape of the painting rather than accepting the rectangular format. In fact, the use of the shaped canvas is primarily associated with paintings of the 1960s and 1970s that are coolly abstract, formalistic, geometrical, objective, rationalistic, clean-lined, brashly sharp-edged, or minimalist in character. The Bykert Gallery, and the Park Place Gallery were important showcases for Minimalism and shaped canvas painting in New York City during the 1960s.", "During the 1960s and 1970s artists as powerful and influential as Robert Motherwell, Adolph Gottlieb, Philip Guston, Lee Krasner, Cy Twombly, Robert Rauschenberg, Jasper Johns, Richard Diebenkorn, Josef Albers, Elmer Bischoff, Agnes Martin, Al Held, Sam Francis, Ellsworth Kelly, Morris Louis, Helen Frankenthaler, Gene Davis, Frank Stella, Kenneth Noland, Joan Mitchell, Friedel Dzubas, and younger artists like Brice Marden, Robert Mangold, Sam Gilliam, John Hoyland, Sean Scully, Blinky Palermo, Pat Steir, Elizabeth Murray, Larry Poons, Walter Darby Bannard, Larry Zox, Ronnie Landfield, Ronald Davis, Dan Christensen, Joan Snyder, Richard Tuttle, Ross Bleckner, Archie Rand, Susan Crile, Mino Argento and dozens of others produced vital and influential paintings."]}, {"page": "Drip painting", "response": ["Contemporary artists who have used drip painting include Lynda Benglis, Norman Bluhm, Dan Christensen, Ian Davenport, Ronald Davis, Rodney Graham, John Hoyland, Ronnie Landfield, Zane Lewis, Joan Mitchell, Roxy Paine, Larry Poons, Pat Steir, Andre Thomkins, and Zevs."]}, {"page": "Ian Stephenson", "response": ["In September 2010, Stephenson and five other British artists including Howard Hodgkin, John Walker, John Hoyland, Patrick Caulfield and R.B. Kitaj were included in an exhibition entitled The Independent Eye: Contemporary British Art From the Collection of Samuel and Gabrielle Lurie, at the Yale Center for British Art.Channeling American Abstraction, Karen Wilkin, Wall Street Journal. Retrieved October 7, 2010.NY Times, exhibition review. Retrieved December 15, 2010."]}, {"page": "Swindon Museum and Art Gallery", "response": ["Swindon Museum and Art Gallery's collection focuses on major artists and movements of 20th and 21st century British art, with several works presented by the Art Fund and the Contemporary Art Society. Artists in the collection include Simon Carter, Amanda Ansell, Ben Nicholson, Henry Moore, Lucian Freud, Graham Sutherland, L S Lowry, Paul Nash, Steven Pippin, Terry Frost, Roger Hilton, Howard Hodgkin, John Hoyland, Richard Hamilton, Gwen John, Augustus John, Maggi Hambling, John Bellany, Tony Bevan, Ivon Hitchens, John Piper, Christopher le Brun, Dennis Creffield, Lisa Milroy, Julie Umerle, David Leach, Lucie Rie, Hans Coper, Gillian Ayres, Linda Ingham, Robert Priseman, Sheila Fell, Eileen Cooper, Grayson Perry and William Turnbull.  The media include paintings, photography and studio pottery."]}]}}