{"wiki_id": "http://www.wikidata.org/entity/Q8273340", "itemLabel": "John Whittaker", "itemDescription": "British politician (born 1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Whittaker_(UKIP_politician)", "wikipedia_page": {"main": "John Whittaker (born 7 June 1945) is a former UK Independence Party politician.  He was a Member of the European Parliament (MEP) for the North West England  region from 2004 to 2009.\nWhittaker was born in Oldham, Lancashire. He was educated at Queen Mary University of London (BSc Physics, 1966) and the University of Cape Town (PhD Physics, 1980; BA Economics, 1982).  He is a senior lecturer in economics at Lancaster University.  His main research and teaching interests are in monetary policy and macroeconomics, and recently he has taken a particular interest in the problems associated with the single currency.He stood for UKIP in the Littleborough and Saddleworth by-election in 1995 where he came 5th out of 10 candidates behind the Official Monster Raving Loony Party.\nWhittaker was the UKIP's lead candidate in the North West for the European Parliament elections in 1999. Though UKIP gained 6.5% of the vote in the region, he fell short of being elected by about 0.5 per cent. However, in 2004 he was more successful, being one of 12 UKIP candidates to win a European seat in the big UKIP breakthrough of that year.\nHe contested the 2005 general election for the constituencies of Ashton under Lyne, Crosby, Heywood and Middleton, Hyndburn, Manchester Central, Rochdale, Stalybridge and Hyde and Wigan.\nIn 2005, Whittaker became UKIP's official spokesman on Economic and Monetary Affairs. In September 2006, following the election of Nigel Farage as leader of UKIP, Whittaker was appointed party chairman.", "link_mentions": [{"page": "UK Independence Party", "response": ["|John Whittaker||2006–08 ||"]}, {"page": "List of members of the European Parliament (2004–2009)", "response": ["|John Whittaker||United Kingdom||North West England||UKIP||IND/DEM"]}, {"page": "Independence/Democracy", "response": ["* John Whittaker"]}, {"page": "North West England (European Parliament constituency)", "response": ["| colspan = 3 | John WhittakerUKIP"]}, {"page": "2009 European Parliament election in the United Kingdom", "response": ["*John Whittaker (North West England)"]}, {"page": "John Whittaker", "response": ["John Whittaker may refer to:", "*John Whittaker (UKIP politician) (born 1945), British MEP", "*John Whittaker (businessman) (born 1942), British billionaire", "*John Whittaker (rugby league) (1950–2020), New Zealand rugby league player"]}]}}