{"wiki_id": "http://www.wikidata.org/entity/Q828205", "itemLabel": "Bertie Peacock", "itemDescription": "Northern Irish association football player and manager (1928-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bertie_Peacock", "wikipedia_page": {"main": "John Robert 'Bertie' Peacock MBE (29 September 1928 – 22 July 2004) was a Northern Ireland international footballer and manager who played for Celtic.", "link_mentions": [{"page": "Celtic F.C.", "response": ["| Bertie Peacock || 1957–1961"]}, {"page": "SuperCupNI", "response": ["The Northern Ireland Youth Soccer Tournament began in 1983 with sixteen teams participating at an Under 16 (Premier) level. Motherwell from Scotland were the first winners. It was founded by Jim Weir, Victor Leonard, George Logan and Bertie Peacock, one of the most famous football players from the region."]}, {"page": "Northern Ireland national football team", "response": ["|Bertie Peacock", "|Bertie Peacock", "|Bertie Peacock, Billy BinghamBertie Peacock managed for the first three qualifying matches. Billy Bingham managed the remainder of the qualification campaign."]}, {"page": "Coleraine", "response": ["* Bertie Peacock – footballer"]}, {"page": "Coronation Cup (football)", "response": ["|IL ||||Bertie Peacock"]}, {"page": "Coleraine F.C.", "response": ["In 1961, chairman Jack Doherty persuaded Bertie Peacock to sign for Coleraine after he left Celtic. It would prove to be one of the most important transfers in the club's history. In 1965, Coleraine won the Irish Cup for the first time, defeating Glenavon 2–1 at Windsor Park, with goals from Shaun Dunlop and Derek Irwin. Coleraine thus gained its first experience of European football, against Soviet outfit Dynamo Kiev. Coleraine also won the first two Blaxnit all-Ireland cups in 1969 and 1970. Coleraine faced Kilmarnock in the 1970 Fairs Cup, and after a 1–1 draw in the first leg, the Bannsiders pulled off an historic 3–2 victory thanks to a Des Dickson hat-trick.", "In 1972, the Irish Cup was won again, this time by beating Portadown 2–1, with goals from Des Dickson and Ivan Murray. The Holy Grail of the Gibson Cup was finally captured in 1974. Under the management of Bertie Peacock, the squad consisting of the likes of Des Dickson, Johnny McCurdy, Ivan Murray, Michael Guy and Vince Magee clinched the title ahead of Portadown. Bertie Peacock resigned in 1974 and Ivan Murray and Johnny McCurdy took over the reins. Murray continued as manager until 1978 and during his spell in charge the Irish Cup was won twice more – both times against Linfield. In 1975, it took three games before a goal from Jim \"Chang\" Smith in the second replay proved decisive. The 1977 victory was more emphatic with Liam Beckett, Des Dickson, Frankie Moffatt and Michael Guy scoring to give Coleraine a 4–1 victory. It was to be the club's last major trophy for 26 years.", "* Bertie Peacock (1961-1974)"]}, {"page": "United Kingdom national football team", "response": [":Jack Kelsey (Wales), Peter Sillett (England), Joe McDonald (Scotland), Danny Blanchflower (Northern Ireland), John Charles (Wales), Bertie Peacock (Northern Ireland), Stanley Matthews (England), Bobby Johnstone (Scotland), Roy Bentley (England), Jimmy McIlroy (Northern Ireland), Billy Liddell (Scotland)."]}, {"page": "Jimmy McGrory", "response": ["Matters improved in the 1950s, with Bobby Evans, Bertie Peacock, Bobby Collins, along with Tully, making a positive impact on the team. In April 1951, a John McPhail goal saw Celtic defeat Motherwell 1–0 in the Scottish Cup Final for the club's first major trophy since the war. Two years later, Celtic defeated Arsenal, Manchester United and Hibernian to win the Coronation Cup, a one-off tournament held in May 1953 to commemorate the coronation of Elizabeth II."]}, {"page": "Derek Dougan", "response": ["Dougan represented Northern Ireland at schoolboy, youth, amateur and 'B' level as a wing-half and centre-defender. He made his senior international debut under Peter Doherty in 1–0 win over Czechoslovakia during the 1958 FIFA World Cup on 8 June 1958. He had won nine caps before he joined Peterborough in 1962, when the drop to Third Division football left him out of international contention for the next three years. Bertie Peacock returned him to the team following his transfer to First Division Leicester City in 1965, and he missed just three of the next 37 internationals. He was named as captain when Terry Neill succeeded Billy Bingham as manager in 1971. He made his final appearance for Northern Ireland on 14 February 1973 in a 1974 FIFA World Cup qualifier against Cyprus. He won a total of 43 senior caps and scored eight goals in a 15-year international career, but despite playing alongside George Best for nine of these years Northern Ireland did not qualify for a major tournament after the 1958 FIFA World Cup."]}, {"page": "History of Celtic F.C. (1887–1994)", "response": ["The 1950s saw several players emerge as mainstays in the Celtic side, Bobby Evans, Bertie Peacock, Bobby Collins and perhaps most memorably, Charlie Tully.  Tully was a charismatic performer who combined audacious dribbling with outright showboating and razor sharp wit.  In a Scottish Cup tie in 1953 at Falkirk, Tully scored direct from a corner.  The 'goal' was disallowed by the referee as the ball had been placed slightly outwith the arc.  Tully re-took the corner and swung the ball directly into the net again.  Tully became hugely popular with the Celtic support, and 'Tullymania' resulted in Glasgow cafes selling 'Tully ice cream', bars serving 'Tully cocktails' and drapers producing 'Tully ties'."]}, {"page": "2004 in association football", "response": ["* 23 July – Bertie Peacock (75), Northern Irish footballer"]}, {"page": "Saint Mungo Cup", "response": ["|IL ||||Bertie Peacock"]}, {"page": "Michael O'Neill (footballer)", "response": ["O'Neill was brought in to Coleraine by former Northern Ireland internationals Bertie Peacock and Jim Platt, making his debut in the Irish League at the age of 15 and was a regular in the side by the age of 18. After playing against Dundee United in a UEFA Cup tie in 1987 O'Neill came close to joining the Scottish club."]}, {"page": "Terry Cochrane", "response": ["Cochrane started out as a youngster with Derry City and had been rejected after a months trial with Everton, then managed by Billy Bingham, for \"not having the right build\" to play in midfield. Cochrane returned to the Irish League to play for Linfield, and then Coleraine, thinking his dream of playing English football was over. At Coleraine, under the tutelage of former Northern Ireland boss, Bertie Peacock, Cochrane developed into a fine winger and was capped by his country for the first time in October 1975 against Norway."]}, {"page": "2004 in Northern Ireland", "response": ["*22 July - Bertie Peacock, footballer and football manager."]}, {"page": "1953–54 British Home Championship", "response": ["* MF - Bertie Peacock", "| MF ||align=\"left\"| Bertie Peacock || 29 September 1928 || 1 || 0 || 90 || 0 || 0 || - || - ||bgcolor=red| 90 ||align=\"left\"|  Celtic F.C."]}, {"page": "1954–55 Scottish Cup", "response": ["|LH || Bertie Peacock", "|LH || Bertie Peacock"]}, {"page": "1953–54 Scottish Cup", "response": ["|LH |||| Bertie Peacock"]}, {"page": "1950–51 Scottish Cup", "response": ["|IL || Bertie Peacock"]}, {"page": "Robert Peacock", "response": ["#REDIRECT Bertie Peacock"]}, {"page": "1957 Scottish League Cup Final", "response": ["|LH ||7 ||Bertie Peacock"]}]}}