{"wiki_id": "http://www.wikidata.org/entity/Q83493", "itemLabel": "Susan Boyle", "itemDescription": "British singer (b. 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Susan_Boyle", "wikipedia_page": {"main": "Susan Magdalane Boyle (born 1 April 1961) is a Scottish singer. She rose to fame in 2009 after appearing as a contestant on the third series of Britain's Got Talent, singing \"I Dreamed a Dream\" from Les Misérables.\nBoyle's debut studio album, I Dreamed a Dream,  was released in November 2009 and became the UK's best-selling debut album of all time, beating the previous record held by Spirit by Leona Lewis. I Dreamed a Dream set a record for biggest first week sales by a debut album, according to the Official Charts Company. In her first year of fame, Boyle made £5 million (£6.9 million today) with the release of I Dreamed a Dream and its lead-off singles, \"I Dreamed a Dream\" and \"Wild Horses\". The success was continued with her second studio album, The Gift (2010), where she became only the third act ever to top both the UK and US album charts twice in the same year, and was followed by Boyle's third studio album, Someone to Watch Over Me (2011). She subsequently released the studio albums Standing Ovation: The Greatest Songs from the Stage (2012), Home for Christmas (2013), Hope (2014), A Wonderful World (2016), and Ten (2019).On 12 May 2012, Boyle returned to Britain's Got Talent to perform as a guest in the final, singing \"You'll See\". The following day, she performed at Windsor Castle for the Queen's Diamond Jubilee Pageant singing \"Mull of Kintyre\".  Having performed \"I Know Him So Well\" in a duet with one of her idols Elaine Paige in London in December 2009, Boyle performed with her other musical idol Donny Osmond in Las Vegas in November 2012, singing \"This is the Moment\", a duet from her fourth album. She is known for supporting various charitable causes, and has appeared on the UK charity telethons BBC Children in Need and Comic Relief. As of 2013, Boyle had sold over 19 million albums worldwide and received two Grammy Awards nominations. On 23 July, 2014 she performed \"Mull of Kintyre\" at the Opening Ceremony of the 2014 Commonwealth Games in front of the Queen.As of 2021, Boyle has sold 19 million records.", "link_mentions": [{"page": "April 1", "response": ["*1961 – Susan Boyle, Scottish singer "]}, {"page": "Scotland", "response": ["Scottish music is a significant aspect of the nation's culture, with both traditional and modern influences. A famous traditional Scottish instrument is the Great Highland bagpipe, a wind instrument consisting of three drones and a melody pipe (called the chanter), which are fed continuously by a reservoir of air in a bag. Bagpipe bands, featuring bagpipes and various types of drums, and showcasing Scottish music styles while creating new ones, have spread throughout the world. The clàrsach (harp), fiddle and accordion are also traditional Scottish instruments, the latter two heavily featured in Scottish country dance bands. There are many successful Scottish bands and individual artists in varying styles including Annie Lennox, Amy Macdonald, Runrig, Belle and Sebastian, Boards of Canada, Camera Obscura, Cocteau Twins, Deacon Blue, Franz Ferdinand, Susan Boyle, Emeli Sandé, Texas, The View, The Fratellis, Twin Atlantic, Bay City Rollers and Biffy Clyro. Other Scottish musicians include Shirley Manson, Paolo Nutini, Andy Stewart and Calvin Harris, all of whom have achieved considerable commercial success in international music markets Shirley Manson performed at the 1999 opening of the Scottish Parliament concert at Princes Street Gardens with her band Garbage."]}, {"page": "1961", "response": ["** Susan Boyle, Scottish singer"]}, {"page": "Comic Relief", "response": ["| The WantedSusan Boyle & Peter Kay (as Geraldine McQueen)"]}, {"page": "West Lothian", "response": ["Actors, musicians and entertainers include Susan Boyle (from Blackburn, a singer who achieved fame on the TV series Britain's Got Talent),\"Singing Talent of Susan Boyle Stuns Simon Cowell\", Times of London  Lewis Capaldi (a singer/songwriter from Whitburn and Bathgate), Ian Colquhoun (from Livingston, author and actor), Leon Jackson (from Whitburn, winner of The X Factor in 2007) and David Tennant (from Bathgate, actor)"]}, {"page": "Madame Tussauds", "response": ["| Tom Jones ||  || Keith Lemon || Susan Boyle"]}, {"page": "1961 in music", "response": ["**Susan Boyle, Scottish singer"]}, {"page": "Michael Crawford", "response": ["* Standing Ovation: The Greatest Songs from the Stage (2012) – \"The Music of the Night\" (with Susan Boyle)"]}, {"page": "Timeline of musical events", "response": ["**Susan Boyle's I Dreamed a Dream"]}, {"page": "The Early Show", "response": ["On April 16, The Early Show scored a coup with the broadcast of a live musical performance by Susan Boyle. The Early Show enjoyed a relatively successful May sweeps, racking up a 5% increase in total viewership year-to-year while remaining flat in the 25-to-54-year-old demographic, at a time when both Today and Good Morning America were shedding viewers to the tune of 3 and 4% respectively."]}]}}