{"wiki_id": "http://www.wikidata.org/entity/Q83802", "itemLabel": "George Moberly", "itemDescription": "English divine (1803-1885)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Moberly", "wikipedia_page": {"main": "George Moberly (10 October 1803 – 6 July 1885) was an English cleric who was headmaster of Winchester College, and then served as Bishop of Salisbury from 1869 until his death.", "link_mentions": [{"page": "Richard William Church", "response": ["From 1844 to 1845, Church was junior proctor, and in that capacity and in concert with his senior colleague, vetoed a proposal to censure Tracts publicly. In 1846, with others, he started The Guardian newspaper and he was an early contributor to The Saturday Review. In 1850 he became engaged to H. F. Bennett, of a Somersetshire family, a niece of George Moberly, Bishop of Salisbury. After again holding the tutorship of Oriel, he accepted in 1858 the small living of Whatley in Somerset near Frome and was married the following year. He was said to be a diligent parish priest and a serious student, who contributed largely to current literature."]}, {"page": "Francis Grant (artist)", "response": ["Between 1834 and 1879 Grant contributed 253 works, many of which were full-length portraits, to the exhibitions of the Royal Academy. Among those were equestrian portraits of Queen Victoria and Albert, Prince Consort, painted for Christ's Hospital; the Prince of Wales; an equestrian group of the Duke and Duchess of Beaufort; Sidney Herbert, afterwards Lord Herbert of Lea; Lord John Russell, afterwards Earl Russell; Benjamin Disraeli, afterwards Earl of Beaconsfield; John Hick, afterwards MP for Bolton and Mrs Hick; General Sir James Hope Grant; Sir George Grey; Edward, earl of Derby, first lord of the treasury; Lord Clyde; Viscount Palmerston, painted for Harrow School; Viscount Gough; Lord Truro, lord high chancellor; Sir Frederick Pollock, lord chief baron; Sir William Erle, lord chief justice of the common pleas; John Sumner, archbishop of Canterbury; George Moberly, bishop of Salisbury; and John Gibson Lockhart. "]}, {"page": "Bampton Lectures", "response": ["* 1868 – George Moberly The Administration of the Holy Spirit in the Body of Christ"]}, {"page": "Robert Moberly (priest)", "response": ["He was the son of George Moberly, Bishop of Salisbury, and faithfully maintained the traditions of his father's teaching. His sister was the writer Charlotte Anne Moberly.  Educated at Twyford School, Winchester and New College, Oxford, he was appointed senior student of Christ Church in 1867 and tutor in 1869. In 1876 he went out with Bishop Copleston to Ceylon for six months."]}, {"page": "Moberly", "response": ["*George Moberly (1803–1885), English divine"]}, {"page": "William Keble Martin", "response": ["Keble Martin was the grandson of Dr George Moberly, headmaster of Winchester and later Bishop of Salisbury. He was brother to architect Arthur Campbell Martin CVO FRIBA (1875–1963) and was also connected to John Keble of the Oxford Movement. His father was appointed as the Rector of Dartington, near Totnes, when William was 14 years old."]}, {"page": "George Ridding", "response": ["He was educated at Winchester College and at Balliol College, Oxford. He became a fellow of Exeter College and was a tutor from 1853 to 1863. In 1853 he married Mary Louisa Moberly, who died within a year of her marriage. Ordained Priest by Bishop of Oxford 20 September 1856 in St John Baptist Church, Oxford.Oxford University & City Herald, 27/09/1856 He was appointed second master of Winchester College in 1863, and on the retirement of his father-in-law, George Moberly, he succeeded to the headmastership. The gate between College Meads and Lavender Meads bears his name."]}, {"page": "Charles Frederic Moberly Bell", "response": ["Charles Frederic Moberly Bell was born in Alexandria. At this period, Egypt was ruled by Muhammad Ali, and its second city was a major Mediterranean trading port, dealing in commodities such as Egyptian cotton. His father was a merchant, and first cousin to George Moberly, Headmaster of Winchester College and later bishop of Salisbury. This made Charles Frederic second cousin to Charlotte Anne Moberly, a pioneering educationalist best known for the Moberly-Jourdain incident."]}, {"page": "Horatio Potter", "response": ["On January 3, 1845, Potter's bishop, Benjamin T. Onderdonk was sentenced to suspension from “the exercise of his ministry and of his office as bishop.” This gave Potter the additional task of overseeing the missions in upstate New York. Later in 1845, a voyage to England was offered made to Potter. On May 26, 1845, the Vestry of St. Peter's \"resolved unanimously” that their Rector should take the voyage and expressed “their high estimate of his services and character.\" Potter was accompanied by his wife. In England, being of the high church persuasion, he met with “several of the leaders of the Oxford Movement,” such as John Keble, Isaac Williams, Edward Bouverie Pusey, George Moberly, and William Skinner, Bishop of Aberdeen. Potter returned to Albany in the autumn of 1845 “in greatly improved health and spirits.”Hooper (1900), 283-284, 286-287."]}, {"page": "Walter Hamilton Moberly", "response": ["The son of the Rev. Robert Campbell Moberly and the grandson of George Moberly,His brother was also a bishop. he was educated at Winchester and New College, Oxford. Moberly was later a lecturer in political science at the University of Aberdeen from 1905 to 1906. He was a Fellow of Merton College, Oxford from 1904 to 1907. While Fellow and Lecturer in philosophy at Lincoln College, Oxford he contributed essays on \"The Atonement\" and \"God and the Absolute\" to the symposium Foundations: A Statement of Christian Belief in Terms of Modern Thought, published in 1912.Streeter, B. H. et al. (1912). Foundations: A Statement of Christian Belief in Terms of Modern Thought: By Seven Oxford Men. London: Macmillan. pp. 265–335, 423–524. He served in World War I with the Oxfordshire and Buckinghamshire Light Infantry, being twice mentioned in despatches."]}, {"page": "Bishop of Salisbury", "response": ["| 60px George Moberly"]}]}}