{"wiki_id": "http://www.wikidata.org/entity/Q838073", "itemLabel": "Joseph Edkins", "itemDescription": "British linguist", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Edkins", "wikipedia_page": {"main": "Joseph Edkins (19 December 1823 – 23 April 1905) was a British Protestant missionary who spent 57 years in China, 30 of them in Beijing. As a Sinologue, he specialised in Chinese religions. He was also a linguist, a translator, and a philologist. Writing prolifically, he penned many books about the Chinese language and the Chinese religions especially Buddhism. In his China's Place in Philology (1871), he tries to show that the languages of Europe and Asia have a common origin by comparing the Chinese and Indo-European vocabulary.", "link_mentions": [{"page": "Li Bai", "response": ["Joseph Edkins read a paper, \"On Li Tai-po\", to the Peking Oriental Society in 1888, which was subsequently published in that society's journal.Obata,  p. v. The early sinologist Herbert Allen Giles included translations of Li Bai in his 1898 publication Chinese Poetry in English Verse, and again in his History of Chinese Literature (1901).Obata, v–vi The third early translator into English was L. Cranmer-Byng (1872–1945). His Lute of Jade: Being Selections from the Classical Poets of China (1909) and A Feast of Lanterns (1916) both featured Li's poetry."]}, {"page": "Ming dynasty", "response": ["After the flourishing of science and technology in the Song dynasty, the Ming dynasty perhaps saw fewer advancements in science and technology compared to the pace of discovery in the Western world. In fact, key advances in Chinese science in the late Ming were spurred by contact with Europe. In 1626 Johann Adam Schall von Bell wrote the first Chinese treatise on the telescope, the Yuanjingshuo (Far Seeing Optic Glass); in 1634 the Chongzhen Emperor acquired the telescope of the late Johann Schreck (1576–1630). The heliocentric model of the solar system was rejected by the Catholic missionaries in China, but Johannes Kepler and Galileo Galilei's ideas slowly trickled into China starting with the Polish Jesuit Michael Boym (1612–1659) in 1627, Adam Schall von Bell's treatise in 1640, and finally Joseph Edkins, Alex Wylie, and John Fryer in the 19th century. Catholic Jesuits in China would promote Copernican theory at court, yet at the same time embrace the Ptolemaic system in their writing; it was not until 1865 that Catholic missionaries in China sponsored the heliocentric model as their Protestant peers did. Although Shen Kuo (1031–1095) and Guo Shoujing (1231–1316) had laid the basis for trigonometry in China, another important work in Chinese trigonometry would not be published again until 1607 with the efforts of Xu Guangqi and Matteo Ricci. Ironically, some inventions which had their origins in ancient China were reintroduced to China from Europe during the late Ming; for example, the field mill."]}, {"page": "James Legge", "response": ["He took a long trip to North China, beginning 2 April 1873 in Shanghai, arriving at Tianjin by boat, then travelling by mule cart and arriving in Peking on 16 April 1873, where he stayed at the London Missionary Society headquarters. He visited the Great Wall, Ming Tombs and the Temple of Heaven, where he felt compelled to take off his shoes with holy awe. He left Peking, accompanied by Joseph Edkins, and headed for Shandong by mule cart to visit Jinan, Taishan, where they ascended the sacred Mount Tai, carried by four men on chairs. Leaving Mount Tai on 15 May, they visited Confucius Temple and the Forest of Confucius at Qufu, where he climbed to the top of Confucius' burial mound. Legge returned to Shanghai by way of the Grand Canal, and thence to England via Japan and the USA in 1873."]}, {"page": "Wu Chinese", "response": ["Another source from this period is from the work of the missionary Joseph Edkins, who gathered large amounts of data and published several educational works on Shanghainese as well as a bible in Shanghainese and a few other major Wu varieties."]}, {"page": "Shanghainese", "response": ["Chinese characters are used to write Shanghainese. Romanization of Shanghainese was first developed by Protestant English and American Christian missionaries in the 19th century, including Joseph Edkins. Usage of this romanization system was mainly confined to translated Bibles for use by native Shanghainese, or English-Shanghainese dictionaries, some of which also contained characters, for foreign missionaries to learn Shanghainese. A system of phonetic symbols similar to Chinese characters called \"New Phonetic Character\" were also developed by in the 19th century by American missionary Tarleton Perry Crawford."]}, {"page": "Nailsworth", "response": ["*Joseph Edkins (1823–1905), translator and missionary to China, was born here."]}, {"page": "Walter Henry Medhurst", "response": ["When peace was concluded with China in 1842, he moved to Shanghai where he founded the London Missionary Society Press () together with William Muirhead and Dr William Lockhart.  They were later joined by Joseph Edkins, and William Charles Milne. He continued in Shanghai until 1856, laying the foundations of a successful mission."]}, {"page": "Chinese astronomy", "response": ["While in Edo Japan, the Dutch aided the Japanese with the first modern observatory of Japan in 1725, headed by Nakane Genkei, whose observatory of astronomers wholly accepted the Copernican view.Needham, Volume 3, p.447 In contrast, the Copernican view was not accepted in mainstream China until the early nineteenth century, with the Protestant missionaries such as Joseph Edkins, Alex Wylie, and John Fryer."]}, {"page": "Chinese mathematics", "response": ["In 1840, the First Opium War forced China to open its door and look at the outside world, which also led to an influx of western mathematical studies at a rate unrivaled in the previous centuries. In 1852, the Chinese mathematician Li Shanlan and the British missionary Alexander Wylie co-translated the later nine volumes of Elements and 13 volumes on Algebra.Carlyle, Edward Irving (1900). \"Wylie, Alexander\". In Lee, Sidney. Dictionary of National Biography. 63. London: Smith, Elder & Co.\"Li Shanlan's Summation Formulae\". A History of Chinese Mathematics: 341–351. . With the assistance of Joseph Edkins, more works on astronomy and calculus soon followed. Chinese scholars were initially unsure whether to approach the new works: was study of Western knowledge a form of submission to foreign invaders? But by the end of the century, it became clear that China could only begin to recover its sovereignty by incorporating Western works. Chinese scholars, taught in Western missionary schools, from (translated) Western texts, rapidly lost touch with the indigenous tradition. As Martzloff notes, \"from 1911 onwards, solely Western mathematics has been practised in China.\"."]}, {"page": "Four Great Inventions", "response": ["Western writers and scholars from the 19th century onwards commonly attributed these inventions to China. The missionary and sinologist Joseph Edkins (1823–1905), comparing China with Japan, noted that for all of Japan's virtues, it did not make inventions as significant as paper-making, printing, the compass and gunpowder. Edkins' notes on these inventions were mentioned in an 1859 review in the journal Athenaeum, comparing the contemporary science and technology in China and Japan. Other examples include, in Johnson's New Universal Cyclopædia: A Scientific and Popular Treasury of Useful Knowledge in 1880, The Chautauquan in 1887, and by the sinologist, Berthold Laufer in 1915.\"Some Fundamental Ideas of Chinese Culture,  None of these, however, referred to four inventions or called them \"great.\""]}, {"page": "Young John Allen", "response": ["The Review attracted a wide and influential Chinese readership throughout its thirty-nine year run. One of the ways in which the Review appealed to a broad, scholarly audience was through its discussion of current events and economics. During the First Sino-Japanese War period of 1894–1895, essay titles included: \"International Intercourse, by a descendent of Confucius,\" \"How to Enrich a Nation, by Dr. Joseph Edkins,\" \"The Prime Benefits of Christianity, by the Rev. Timothy Richard,\" and \"On the Suppression of Doubt and the Acceptance of Christ, by Sung Yuh-kwei.\" The articles attributed practical applications to the Christian faith and portrayed Christianity as a useful concept for the Chinese, one that Allen and his contributors intended to portray on an equal level to concepts such as market economics and international law. The Qing reformer Kang Youwei once said of the publication: \"I owe my conversion to reform chiefly on the writings of two missionaries, the Rev. Timothy Richard and the Rev. Dr. Young J. Allen.\" Rev. Richard was Allen's colleague and a contributor to the Review."]}, {"page": "List of Protestant missionaries in China", "response": ["| Joseph Edkins"]}, {"page": "Li Shanlan", "response": ["A native of Haining, Zhejiang, he was fascinated by mathematics since childhood, beginning with the Nine Chapters on the Mathematical Art. He eked out a living by being a private tutor for some years before fleeing to Shanghai in 1852 to evade the Taiping Rebellion. There he collaborated with Alexander Wylie, Joseph Edkins and others to translate many Western mathematical works into Chinese, including Elements of Analytical Geometry and of the Differential and Integral Calculus by Elias Loomis, Augustus De Morgan's Elements of Algebra, and the last nine volumes of Euclid's Elements (from Henry Billingsley's edition), the first six volumes of which having been rendered into Chinese by Matteo Ricci and Xu Guangqi in 1607. "]}, {"page": "Bible translations into Chinese", "response": ["In 1865 a committee was appointed in the capital to translate the New Testament into Beijing Mandarin. The members of the committee were John Shaw Burdon, of the Church Missionary Society; Joseph Edkins, of the London Missionary Society;  Samuel Isaac Joseph Schereschewsky, of the American Episcopal Church; William Alexander Parsons Martin, of the American Presbyterian Mission ; and Henry Blodget, of the American Board of Foreign Missions. Their task took six years. Schereschewsky, the Episcopal bishop of Shanghai, had the benefit of training in Hebrew as a Jewish youth in Europe before his conversion and American seminary study. His explanations for the translations of controversial terms influenced later versions.Irene Eber. The Jewish Bishop and the Chinese Bible: S.I.J. Schereschewsky, (1831-1906).(Leiden; Boston: Brill,  1999). pp. 108-114."]}, {"page": "Timothy Richard", "response": ["In China, Timothy Richard became a contributor to the monthly Wan Guo Gong Bao, or Review of the Times, which Young John Allen founded and edited from 1868 to 1907. This paper was \"saidby whom?...to have done more for reform than any other single agency in China.\" The Review attracted a wide and influential Chinese readership throughout its thirty-nine year run. One of the ways in which the Review appealed to a broad, scholarly audience was through its discussion of current events and economics. During the First Sino-Japanese War period of 1894–1895, essay titles included: “International Intercourse, by a descendant of Confucius,” “How to Enrich a Nation, by Dr. Joseph Edkins”, “The Prime Benefits of Christianity, by the Rev. Timothy Richard,” and “On the Suppression of Doubt and the Acceptance of Christ, by Sung Yuh-kwei.” The articles attributed practical applications to the Christian faith and portrayed Christianity as a useful concept for the Chinese, one that Allen and his contributors intended to portray on an equal level to concepts such as market economics and international law. The Qing reformer Kang Youwei once said of the publication: \"I owe my conversion to reform chiefly on the writings of two missionaries, the Rev. Timothy Richard and the Rev. Dr. Young J. Allen.\""]}, {"page": "James Gilmour (missionary)", "response": ["During the summer of 1872 Gilmour, in company with Joseph Edkins, visited the sacred city of Wutai Shan, a famous place of Mongol pilgrimage. These people tried the zealous missionary greatly. Drunkenness, hopeless indebtedness, and a desire to borrow were characteristics that greatly disturbed him. Debts never distressed them, but rather their inability to borrow more. Amidst these discouragements he comforted himself as he once wrote, \"All our good work will be found, there is no doubt of that. All I am afraid of is that our good work will amount to little when it is found!\" He was concerned that in the judgment no heathen can be justified in \"pitching into us for not pitching into them more savagely, for not, in fact, taking them by the cuff of the neck and dragging them into the kingdom.\" He endured many hardships here. He would walk to save the expense of a camel. His tent was dwelling, chapel, and dispensary. Gilmour followed the example of Jesus in healing the sick as far as he was able; and the few simple remedies he found a very great help to him in his work. Yet at the end of 1874, after four years of labor, he could not report one convert, not even one who could be classed as interested in Christianity. The people did not have even a sense of need of what the Gospel was."]}, {"page": "List of Chinese hymn books", "response": ["* Hymn Book. Beijing. By Rev. Joseph Edkins, B.A. A collection of 81 hymns. "]}, {"page": "Hong (rainbow-dragon)", "response": ["Using \"etymology\" in the usual Western sense of historical linguistics, Joseph Edkins first proposed Chinese hong  \"rainbow\" was \"doubtless a variant\" of gung  \"bow\" and compared it with \"Siamese\" lung \"rainbow\"."]}, {"page": "Christianity in Shanghai", "response": ["*Joseph Edkins"]}, {"page": "Mandarin (late imperial lingua franca)", "response": ["Although Beijing had become the capital in 1420, its speech did not rival the prestige of the Nanjing-based standard until the middle of the Qing dynasty. As late as 1815, Robert Morrison based the first English–Chinese dictionary on the lower Yangtze koiné as the standard of the time, though he conceded that the Beijing dialect was gaining in influence. By the middle of the 19th century, the Beijing dialect had become dominant and was essential for any business with the imperial court. The new standard was described in grammars produced by Joseph Edkins (1864), Thomas Wade (1867) and Herbert Giles (1873)."]}, {"page": "Heber R. Bishop", "response": ["Many specialists contributed to the book, including: Dr. George Frederick Kunz, Dr. Stephen Wootton Bushell, Dr. William Hallock, Dr. Samuel Lewis Penfield, Dr. Harry Ward Foote, Dr. Joseph Paxton Iddings, Professor Frank Wigglesworth Clarke, Mr. Ira Harvey Woolson, Mr. Logan Waller Page, Dr. Charles Palache, Luis Valentin Pirsson, Dr. Henry Stephens Washington, Dr. Henry Talbot Walden, Professor L. von Jaczewski, Dr. A. B. Meyer, Dr Joseph Edkins, Dr. Ludwig Leiner, Mrs. Zelia Nuttall, Miss Eliza Ruhamah Scidmore, Dr. Franz Berwerth, Ernst Weinschenk, and Tadamasa Hayashi.\"Introduction.\" Bishop Collection, by Heber R. Bishop, George Frederick Kunz, Stephen W. Bushell, Robert Lilley, and Tadamasa Hayashi. The Bishop Collection. Investigations and Studies in Jade. New York: Priv. Print. [The De Vinne Press], 1906."]}, {"page": "Edkins", "response": ["*Joseph Edkins (1823–1905), British Protestant missionary, linguist, translator, and philologist"]}, {"page": "By-paths of Bible Knowledge", "response": ["* by Joseph Edkins"]}, {"page": "Coward College", "response": ["*Joseph Edkins"]}, {"page": "Edkins, Joseph", "response": ["#redirectJoseph Edkins"]}]}}