{"wiki_id": "http://www.wikidata.org/entity/Q843737", "itemLabel": "Keith Hackett", "itemDescription": "Football referee", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Hackett", "wikipedia_page": {"main": "Keith Stuart Hackett (born 22 June 1944) is an English former football referee, who began refereeing in local leagues in the Sheffield, South Yorkshire area in 1960. He is counted amongst the top 100 referees of all time in a list maintained by the International Federation of Football History and Statistics (IFFHS).Keith is currently the president of non-league club Penistone Church FC.[1]", "link_mentions": [{"page": "Alex Ferguson", "response": ["On 16 February 2008, United beat Arsenal 4–0 in an FA Cup fifth round match at Old Trafford, but were knocked out by eventual winners Portsmouth in the quarter-final on 8 March, losing 1–0 at home. United having had a penalty claim turned down, Ferguson alleged after the game that Keith Hackett, general manager of the Professional Game Match Officials Board, was \"not doing his job properly\". Ferguson was subsequently charged by The FA with improper conduct, which he decided to contest. This was the second charge Ferguson faced in the season, following his complaints against the referee after United lost 1–0 at Bolton Wanderers – a charge he decided not to contest."]}, {"page": "Francis Lee (footballer)", "response": ["In the 1971–72 season, Lee set a British record for the number of penalties scored in a season, with 15 of his 35 goals scored from the penalty spot. Many of the penalties resulted from fouls on Lee, earning him the nickname Lee One Pen. Some journalists, holding the opinion that Lee gained a number of penalties by diving, used the name Lee Won Pen instead. Lee's name is often cited in debates about diving in football; referees' chief Keith Hackett described him as a player who \"had a reputation of falling down easily\"."]}, {"page": "UEFA Euro 1988", "response": ["| Keith Hackett"]}, {"page": "Rafael Benítez", "response": ["On 9 January 2009, Benítez delivered a controversial appraisal of certain aspects of Sir Alex Ferguson's tenure, accusing Ferguson and Manchester United of being nervous because Liverpool were at the top of the league, then accused the Manchester United manager of not being punished for breaking FA rules, suggesting he was \"the only manager in the league that cannot be punished for these things\", referring to Ferguson not being punished following an FA charge for comments he made about officials Martin Atkinson and Keith Hackett following an FA Cup tie with Portsmouth. In his 2013 autobiography, Ferguson said that \"Benitez bought badly and made the feud personal\"."]}, {"page": "Andrew Johnson (footballer, born 1981)", "response": ["Everton manager David Moyes took the unusual step of contacting the Professional Game Match Officials Board in order to counter these accusations. The board's general manager Keith Hackett agreed that Johnson was being treated harshly and had been denied several clear penalties."]}, {"page": "Rob Styles", "response": ["In August 2007 Styles refereed the Premier League game between Liverpool and Chelsea where he wrongly awarded a penalty to Chelsea and then caused confusion by showing two yellow cards for a single incident.Liverpool 1–1 Chelsea: report from the BBC.co.uk website. As a result of his decision to award the penalty and the confusion regarding the yellow cards, it was announced by Keith Hackett, general manager of Professional Game Match Officials Limited (PGMOL), that Styles would be \"dropped\" for one round of matches."]}, {"page": "Uriah Rennie", "response": ["Rennie began refereeing in 1979 in local leagues, then operated in the Northern Premier League until 1994, at which time he was appointed to the Football League List of referees. He was given his first Premiership appointment on 23 August 1997, a game between Leeds United and Crystal Palace at Elland Road.First ever Premiership match, soccerbase.com website. Retrieved 10 March 2007. Rennie became a FIFA referee in 2000,Career, details: Premier League Official website. Retrieved 10 March 2007. and joined the Select Group of professional referees the following year. Keith Hackett, head of the Professional Game Match Officials Board has described him as \"the fittest referee we have ever seen on the national and world scene.\" At the end of 2004, he retired from the FIFA list, after reaching the compulsory age of 45 but made a return to active refereeing in November 2007. In September 2010, Rennie became president of Hallam FC which was celebrating its 150th anniversary season."]}, {"page": "List of people from Sheffield", "response": ["*Keith Hackett, football referee"]}, {"page": "Hackett (surname)", "response": ["* Keith Hackett, former FIFA, European and English football referee"]}, {"page": "Football at the 1988 Summer Olympics", "response": ["*  Keith Hackett"]}, {"page": "Mike Riley (referee)", "response": ["Mike Riley was appointed manager of the Professional Game Match Officials Board (PGMOB) in June 2009, replacing Keith Hackett. This effectively ended his career in refereeing matches."]}, {"page": "Howard Webb", "response": ["The match was seen as a very difficult one to referee. The Dutch were criticised for their rough play, and some thought Webb was generous for not showing any red cards to the Dutch players until ten minutes before the end of extra time. Webb later conceded that had he had a better viewing angle of a high challenge from Nigel de Jong he would have sent him off, and De Jong later admitted he was \"lucky\" to only receive a yellow card. FIFA president Sepp Blatter defended Webb, noting that it was \"not easy\" to control such a match. Former Premier League referee Jeff Winter said Webb \"had a superb game\" while Scotland's Alan Hansen condemned the Dutch, saying that, \"Webb tried to make the game flow but on this occasion he was left with no choice.\" The British Referees' Association said \"it would be almost impossible to disagree with any of the bookings he issued\", while former FA Cup final referee Keith Hackett noted that \"anyone who criticises the officials lacks the knowledge and experience of someone who has refereed\" and called on FIFA to punish the Dutch players who castigated Webb to the press."]}, {"page": "Martin Atkinson", "response": ["With no English officials going to the 2018 World Cup for the first time since 1938, Atkinson refereed his last international match in March 2018, a friendly between Argentina and Italy at the Etihad Stadium in Manchester. Atkinson would referee the Manchester Derby at the same stadium less than a month later, a performance that was criticised by former Premier League referee Keith Hackett who stated \"if you want proof of why no English referee will be represented at this summer’s World Cup finals in Russia, look no further than Martin Atkinson’s performance at the Etihad on Saturday.\""]}, {"page": "FA Cup Final referees", "response": ["|1979||Ron Challis||Keith HackettH. Dempsey||W. Harvey", "|1981||Keith Hackett||A. JonesD. Hutchinson||J. Penrose"]}, {"page": "Marouane Fellaini", "response": ["During his debut season he was booked 10 times in his first 17 games and avoided a lengthy suspension by attending a personal hearing with England's chief referee, Keith Hackett, where he vowed to improve his behaviour. He picked up three further bookings in 16 games following the meeting, his total the highest of all Premier League players that season."]}, {"page": "George Courtney", "response": ["Courtney was a frequent figure in UEFA competitions and handled finals such as the 1989 Cup Winners Cup Final. He was England's representative at the 1984 European Championships, followed by the FIFA World Cups of 1986 and 1990. His appointment for the third place play-off in 1986 was the furthest any English referee had reached at the World Cup since Jack Taylor controlled the Final in 1974, until Howard Webb officiated the 2010 World Cup Final. The only competition he missed was the 1988 European Championships when Keith Hackett was selected."]}, {"page": "East Anglian derby", "response": ["Former referee Keith Hackett said of the East Anglian derby: "]}, {"page": "Philip Don", "response": ["He moved into a referee assessing role and later became head of refereeing at the Football Association towards the end of the 1990s. He favoured a hardline, \"by the book\" style of refereeing in the Premier League and ushered in the new Select List of professional referees in 2001. This though led to tensions, particularly with David Elleray who preferred to maintain his teaching career at Harrow School rather than turn professional. Other tensions appeared and he was later replaced by Keith Hackett."]}]}}