{"wiki_id": "http://www.wikidata.org/entity/Q850419", "itemLabel": "Betty Uber", "itemDescription": "badminton player", "wikipedia_url": "https://en.wikipedia.org/wiki/Betty_Uber", "wikipedia_page": {"main": "Elizabeth Uber (2 June 1906 – 30 April 1983, born Elizabeth Corbin) was an English badminton and tennis player. In 1925 she married Herbert Uber.", "link_mentions": [{"page": "Betty", "response": ["* Betty Uber (1906–1983), English badminton and tennis player"]}, {"page": "Uber Cup", "response": ["The Uber Cup, sometimes called the World Team Championships for Women, is a major international badminton competition contested by women's national badminton teams. First held in 1956–1957 and contested at three year intervals, it has been contested every two years since 1984 when its scheduled times and venues were merged with those of Thomas Cup, the world men's team championship. In 2007, the Badminton World Federation decided to have Thomas and Uber Cup finals separated again but the proposal was ultimately abandoned. The Uber Cup is named after a former British women's badminton player, Betty Uber, who in 1950 had the idea of hosting a women's event similar to the men's. She also made the draw for the 1956–1957 inaugural tournament, which took place at Lytham St. Annes in Lancashire, England."]}, {"page": "All England Open Badminton Championships", "response": ["|rowspan=\"3\"| Herbert Uber Betty Uber", "| Marian Horsley Betty Uber", "|rowspan=\"4\"| Donald C. Hume Betty Uber", "| Betty Uber", "|rowspan=\"2\"| Betty Uber Diana Doveton", "| Raymond M. White Betty Uber", "| Betty Uber Queenie Allen", "| Betty Uber|| || 1 || || 4 || 8 ||13"]}, {"page": "1957 Uber Cup", "response": ["The 1957 Uber Cup was the inaugural Uber Cup; a women's international team badminton championship promoted by Betty Uber. Eleven nations took part competing first (as in Thomas Cup competition) within zones to qualify for interzone matches. The final round was held in Lytham St Annes, Lancashire, England on 18 March 1957.tangkis.tripod.com. Accessed 22 May 2006Team Announcement Badminton Australia - pdf  Uber Cup. Accessed 22 May 2006 The United States won the event, defeating Denmark."]}, {"page": "French Open (badminton)", "response": ["|  Betty Uber", "|  Betty Uber Diana Doveton"]}]}}