{"wiki_id": "http://www.wikidata.org/entity/Q853594", "itemLabel": "Corry Evans", "itemDescription": "Northern Irish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Corry_Evans", "wikipedia_page": {"main": "Corry John Evans (born 30 July 1990) is a Northern Irish professional footballer who plays as a midfielder or centre-back for League One side Sunderland. A Northern Ireland under-21 and senior international, he came through the Manchester United youth academy, like his older brother, Leicester City centre-back Jonny Evans. Corry Evans is capable of operating in defence or the centre of midfield. He has been used mainly as a midfielder for Blackburn Rovers.", "link_mentions": [{"page": "Belfast", "response": ["* Corry Evans, football player"]}, {"page": "Danny Graham (footballer)", "response": ["On 23 June 2016, Graham signed a two-year permanent deal with Blackburn reserving the option to extend for a third year. In August, he scored his first goal for the club in a 2–1 defeat against Cardiff City, which also saw Shane Duffy scoring two own goals. In November, he scored a brace in a 3–2 victory over Brentford. He scored his first goal in the 15th minute which equalised Scott Hogan's first-minute goal. He scored again five minutes later from the penalty spot which was awarded to Rovers following a foul on Corry Evans. He ended the season scoring 13 goals in the league although the club was relegated to League One. In August 2017, it was reported by the media that Queens Park Rangers were interested in signing him."]}, {"page": "Danny Guthrie", "response": ["Guthrie signed a two-year deal with Blackburn Rovers following a successful trial on 5 August 2015. He made his debut six days later in a 1–2 home defeat to Shrewsbury Town in the first round of the League Cup as a 65th-minute replacement for Corry Evans. He scored his first goal for Blackburn in a 3–1 win over Brentford on 7 May 2017, after which despite the result Blackburn were relegated."]}, {"page": "List of people with surname Evans", "response": ["*Corry Evans (born 1990), Northern Irish footballer"]}, {"page": "Aaron McLean", "response": ["On 7 December 2011 against Birmingham City at the KC Stadium, a Birmingham attack was broken up and Corry Evans played the ball to Robert Koren in the centre circle. Koren waited patiently before sliding a perfect ball inside the Birmingham left back for McLean, who advanced to the edge of the box before beating Boaz Myhill with a low shot inside the near post."]}, {"page": "Northern Ireland national football B team", "response": ["*Corry Evans (Manchester United)"]}, {"page": "Manchester United F.C. Reserves and Academy", "response": ["* Corry Evans"]}, {"page": "Craig Cathcart", "response": ["Cathcart was called up to the Northern Ireland squad in May 2009, along with nine other uncapped players for the international friendly against Italy on 6 June. Cathcart made his full international debut in Northern Ireland's 1–0 win against Slovenia in Maribor on 3 September 2010. Playing out of position at left-back, due to an injury to Jonny Evans, Cathcart put in a strong performance and set up the winning goal for Corry Evans."]}, {"page": "Northern Ireland national under-21 football team", "response": ["|Corry Evans"]}, {"page": "2008–09 Manchester United F.C. season", "response": ["|align=\"left\"|45||align=\"left\"|MF||align=\"left\"| Corry Evans"]}, {"page": "List of professional sports families", "response": ["|Jonny Evans, Corry Evans"]}, {"page": "2011 Nations Cup", "response": ["|CB ||6 ||Corry Evans"]}, {"page": "2009–10 Manchester United F.C. season", "response": ["|align=\"left\"|31||align=\"left\"|MF||align=\"left\"| Corry Evans"]}, {"page": "Tom Cleverley", "response": ["Towards the end of the season, along with James Chester and Corry Evans, Cleverley was nominated by Manchester United reserve team manager Ole Gunnar Solskjær for the Denzil Haroun Reserve Player of the Year award."]}, {"page": "James Chester", "response": ["On 2 February 2009, Chester joined League One club Peterborough United – managed by Alex Ferguson's son, Darren – on a one-month loan. He made five appearances for the Posh before returning to Manchester United on 2 March. Towards the end of the season, along with Tom Cleverley and Corry Evans, Chester was nominated by reserve team manager Ole Gunnar Solskjær for the Denzil Haroun Reserve Team Player of the Year award."]}]}}