{"wiki_id": "http://www.wikidata.org/entity/Q860011", "itemLabel": "William Montagu, 5th Duke of Manchester", "itemDescription": "British colonial administrator (1771-1843)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Montagu,_5th_Duke_of_Manchester", "wikipedia_page": {"main": "Colonel William Montagu, 5th Duke of Manchester (21 October 1771 – 18 March 1843), styled Viscount Mandeville until 1788, was a British peer, soldier, colonial administrator and politician. He was Governor of Jamaica from 1808 to 1827, and Manchester Parish was named after him.", "link_mentions": [{"page": "Postmaster General of the United Kingdom", "response": ["| 1827–1830||William Montagu, 5th Duke of Manchester"]}, {"page": "Spanish Town", "response": ["The historic architecture and street names mark the colonial history, such as Red Church and White Church streets, symbolic of the Spanish chapels of the red and white cross, as well as Monk Street, in reference to the monastery that once stood nearby. Nugent and Manchester streets were named for the British Colonial Governors, George Nugent and William Montagu, 5th Duke of Manchester. King Street runs past the King's House, the governor's residence, and Constitution Street, near to the Square, refers to the island's former administrative centre. Regency buildings in the town centre include the Rodney Memorial flanked by two guns from the French ship Ville de Paris (1764), and the façade of the Old King's House, which was the residence of the governor until 1872."]}, {"page": "List of colonial governors in 1816", "response": ["*Jamaica – William Montagu, 5th Duke of Manchester, Governor of Jamaica (1813–1821)"]}, {"page": "Lord Lieutenant of Huntingdonshire", "response": ["*William Montagu, 5th Duke of Manchester 14 March 1793 – 25 September 1841"]}, {"page": "Alexander Gordon, 4th Duke of Gordon", "response": ["*Lady Susan Gordon (Gordon Castle, 2 February 1774 – Bedfont Lodge, 26 August 1828); married 7 October 1793 in Edinburgh, William Montagu, 5th Duke of Manchester, and had issue. Elizabeth Grant of Rothiemurchas in her Memoirs of a Highland Lady noted in 1812 that \"the Duchess [of Manchester] had left home years before with one of her footmen\", while Lady Jerningham wrote in September 1813 that \"The Duchess of Manchester is finally parted from her husband, her conduct being most notoriously bad\"."]}, {"page": "Manchester Parish", "response": ["Manchester was formed in 1814, by an Act of the House of Assembly, making it one of the newest parishes of Jamaica. It was formed as a result of the amalgamation of portions of the parishes St. Elizabeth, Clarendon and the entirety of Vere. The amalgamation was done in response to a petition from the inhabitants of Mile Gully, May Pen and Carpenters Mountain who complained that they were too far away from an administrative centre. Manchester was named in honour of the William Montagu, 5th Duke of Manchester, the then Governor of Jamaica. He was governor for 19 years, setting the record as the longest-serving governor of the island. The capital town, Mandeville, established in 1816, was named after his eldest son, Lord Mandeville."]}, {"page": "George Montagu, 4th Duke of Manchester", "response": ["* William Montagu, 5th Duke of Manchester (1771–1843), who married Lady Susan Gordon, the third daughter of Alexander Gordon, 4th Duke of Gordon. Lady Susan was the co-heiress of her brother, George Gordon, 5th Duke of Gordon."]}, {"page": "George Montagu, 6th Duke of Manchester", "response": ["George Montagu was born at Kimbolton Castle, Huntingdonshire, on 9 July 1799. He was the eldest son of William Montagu, 5th Duke of Manchester and Lady Susan Gordon (1774–1828). Among his siblings were Lady Susan Montagu (wife of George Hay, 8th Marquess of Tweeddale) and Lady Caroline Montagu (wife of John Hales Calcraft MP for Wareham)."]}, {"page": "List of Old Harrovians", "response": ["*William Montagu, 5th Duke of Manchester (1771–1843), Governor of Jamaica (1808–1827) and Postmaster General (1827–1830)"]}, {"page": "Lord John Hay (Royal Navy officer, born 1827)", "response": ["Born in Geneva, Switzerland,Heathcote, p. 110 the fourth son of George Hay, 8th Marquess of Tweeddale and Lady Susan Montagu (daughter of the William Montagu, 5th Duke of Manchester), Hay joined the Royal Navy in 1840. He was posted to the sixth-rate HMS Vestal on the China Station in 1842 and saw action during the First Opium War. Promoted to lieutenant on 19 December 1846, he joined the steam frigate HMS Spiteful at Woolwich that month before transferring to the second-rate HMS Powerful in the Mediterranean Fleet in April 1848.Heathcote, p. 111 He was promoted to commander on 28 August 1851 and given command of the sloop HMS Wasp in the Mediterranean Fleet in August 1852; he went ashore with the Naval Brigade and took part in the defence of Eupatoria in November 1854 and the Siege of Sevastopol in Spring 1855 during the Crimean War. He was wounded in the latter engagement and was appointed to the French Legion of Honour, 5th Class and the Turkish Order of the Medjidie, 4th class for his services in the Crimea."]}, {"page": "Granville Waldegrave, 3rd Baron Radstock", "response": ["He became the 3rd Baron Radstock on the death of his father Granville George Waldegrave in 1857. Radstock married Susan Calcraft (1833–1892) on 16 July 1858 in Trinity Church, Marylebone. She was the youngest daughter of John Hales Calcraft, MP for Wareham, and Lady Caroline Montagu, daughter of William Montagu, 5th Duke of Manchester. In 1889, they acquired the Mayfield estate in Weston, Southampton.Southampton City Council"]}, {"page": "William Montagu", "response": ["*William Montagu, 5th Duke of Manchester (1771–1843), British peer, soldier, colonial administrator and politician"]}, {"page": "Lord Frederick Montagu", "response": ["Montagu was a younger son of George Montagu, 4th Duke of Manchester, and Elizabeth, daughter of Sir James Dashwood, 2nd Baronet. William Montagu, 5th Duke of Manchester, was his elder brother. He was educated at Harrow School."]}, {"page": "Jane Gordon, Duchess of Gordon", "response": ["Susan (1774–1828), the third daughter, was married on 7 October 1793 in Edinburgh to William Montagu, 5th Duke of Manchester, and Madeleine (1772–1847), the second daughter, married firstly on 2 April 1789 in London to Sir Robert Sinclair, 7th Baronet. On 25 November 1805 she married secondly at Kimbolton Castle to Charles Fysche Palmer."]}, {"page": "William Manchester (disambiguation)", "response": ["*William Montagu, 5th Duke of Manchester"]}, {"page": "William Hay, 10th Marquess of Tweeddale", "response": ["His paternal grandfather was George Hay, 7th Marquess of Tweeddale and Lady Hannah Charlotte Maitland (a daughter of James Maitland, 7th Earl of Lauderdale).  His maternal grandparents were William Montagu, 5th Duke of Manchester and Lady Susan Gordon (third daughter of Alexander Gordon, 4th Duke of Gordon)."]}]}}