{"wiki_id": "http://www.wikidata.org/entity/Q861129", "itemLabel": "Chris Blackwell", "itemDescription": "English businessman and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Blackwell", "wikipedia_page": {"main": "Christopher Percy Gordon Blackwell (born 22 June 1937) is an English businessman and former record producer, and the founder of Island Records, which has been called \"one of Britain's great independent labels\". According to the Rock and Roll Hall of Fame, to which Blackwell was inducted in 2001, he is \"the single person most responsible for turning the world on to reggae music.\"Forming Island Records in Jamaica on 22 May 1959, aged 22, Blackwell was among the first to record the Jamaican popular music that eventually became known as ska. Returning to Britain in 1962, he sold records from the back of his car to the Jamaican community.Backed by Stanley Borden from RKO, Blackwell's business and reach grew substantially, and he went on to forge the careers of Bob Marley, Grace Jones and U2 among many other diverse high-profile acts. He has produced many seminal albums, including Marley's Catch A Fire and Uprising, and The B-52's' self-titled debut album in 1979.", "link_mentions": [{"page": "Jamaica", "response": ["There is also a significant Portuguese Jamaican population that is predominantly of Sephardic Jewish heritage. The first Jews arrived as explorers from Spain in the 15th century after being forced to convert to Christianity or face death. A small number of them became slave owners and even famous pirates. Judaism eventually became very influential in Jamaica and can be seen today with many Jewish cemeteries around the country. During the Holocaust Jamaica became a refuge for Jews fleeing persecution in Europe. Famous Jewish descendants include the dancehall artist Sean Paul, former record producer and founder of Island Records Chris Blackwell, and Jacob De Cordova who was the founder of the Daily Gleaner newspaper."]}, {"page": "History of Jamaica", "response": ["Jamaica's film industry was born in 1972 with the release of The Harder They Come, the first feature-length film made by Jamaicans. It starred reggae singer Jimmy Cliff, was directed by Perry Henzell, and was produced by Island Records founder Chris Blackwell.Kenner, Rob (2009) \"Trevor Rhone, a Writer of ‘The Harder They Come,’ Dies at 69\", The New York Times, 21 September 2009, retrieved 11 November 2012 The film is famous for its reggae soundtrack that is said to have \"brought reggae to the world\". Jamaica's other popular films include 1976's Smile Orange, 1982's Countryman, 1991's The Lunatic, 1997's Dancehall Queen, and 1999's Third World Cop. Major figures in the Jamaican film industry include actors Paul Campbell and Carl Bradshaw, actress Audrey Reid, and producer Chris Blackwell."]}, {"page": "June 22", "response": ["*1937 – Chris Blackwell, English record producer, co-founded Island Records"]}, {"page": "John Martyn", "response": ["Mentored by Hamish Imlach, Martyn began his professional musical career when he was 17, playing a fusion of blues and folk resulting in a distinctive style which made him a key figure in the British folk scene during the mid-1960s. He signed to Chris Blackwell's Island Records in 1967 and released his first album, London Conversation, the same year. Released in 1968, his second album, The Tumbler, was moving towards jazz.", "Martyn's marriage broke down at the end of the 1970s and \"John hit the self destruct button\" (although other biographers, including The Times obituary writer, attribute the break-up of his marriage to his already being addicted to drink and drugs). In her autobiography, Beverley also alleges protracted domestic violence.Beverley Martyn, Jacki Dacosta, Sweet Honesty – The Beverley Martyn Story; , Grosvenor, 2011  Out of this period, described by Martyn as \"a very dark period in my life\", came the album Grace and Danger. Released in October 1980, the album had been held up for a year by Chris Blackwell. He was a close friend of John and Beverley, and found the album too openly disturbing to release. Only after intense and sustained pressure from Martyn did Blackwell agree to release the album. Commenting on that period, Martyn said, \"I was in a dreadful emotional state over that record. I was hardly in control of my own actions. The reason they finally released it was because I freaked: Please get it out! I don't give a damn about how sad it makes you feel—it's what I'm about: the direct communication of emotion. Grace and Danger was very cathartic, and it really hurt.\""]}, {"page": "Nirvana (British band)", "response": ["In October 1967, they released their first album: a concept album produced by Chris Blackwell titled The Story of Simon Simopath.Jim Irvin, Phil Alexander Mojo collection: the ultimate music companion 2007 Page 115 \"Nirvana The Story of Simon Simonpath Sumptuous soft-psych classic from the original UK Nirvana. The brainchild of songwriters Patrick Campbell-Lyons and Alex Spyropoulos and Ray Singer, Nirvana was originally conceived as a group but devolved into a ...\" The album was one of the first narrative concept albums ever released, predating story-driven concept albums such as The Pretty Things' S.F. Sorrow (December 1968), The Who's Tommy (April 1969) and The Kinks' Arthur (September 1969), and the Moody Blues album Days of Future Passed (November 1967) by a month.", "*Chris Blackwell, Island Records' founder who produced the band before hitting his production stride in the 1970s with Bob Marley"]}, {"page": "Peter Cook", "response": ["Later, the more risqué humour of Pete and Dud went further on such LPs as \"Derek and Clive\". The first recording was initiated by Cook to alleviate boredom during the Broadway run of Good Evening and used material conceived years before for the two characters but considered too outrageous. One of these audio recordings was also filmed and therein tensions between the duo are seen to rise. Chris Blackwell circulated bootleg copies to friends in the music business. The popularity of the recording convinced Cook to release it commercially, although Moore was initially reluctant, fearing that his rising fame as a Hollywood star would be undermined. Two further Derek and Clive albums were released, the last accompanied by a film."]}, {"page": "Reggae", "response": ["Notable Jamaican producers influential in the development of ska into rocksteady and reggae include: Coxsone Dodd, Lee \"Scratch\" Perry, Leslie Kong, Duke Reid, Joe Gibbs and King Tubby. Chris Blackwell, who founded Island Records in Jamaica in 1960,Sexton, Paul. \"A Legend in His Own Time.\" Billboard – The International Newsweekly of Music, Video and Home Entertainment 113.39 (29 Sep 2001): p. C-8. relocated to England in 1962, where he continued to promote Jamaican music. He formed a partnership with Lee Gopthal's Trojan Records in 1968, which released reggae in the UK until bought by Saga records in 1974."]}, {"page": "Roxy Music", "response": ["  With this team, EG Management financed the recording of the tracks for their first album, Roxy Music, recorded in March–April 1972 and produced by King Crimson lyricist Peter Sinfield. Both the album and its famous cover artwork by photographer Karl Stoecker were apparently completed before the group signed with Island Records. A&R staffer Tim Clark records that although he argued strongly that Island should contract them, company boss Chris Blackwell at first seemed unimpressed and Clark assumed he was not interested. A few days later however, Clark and Enthoven were standing in the hallway of the Island offices examining cover images for the album when Blackwell walked past, glanced at the artwork and said \"Looks great! Have we got them signed yet?\"Michael Bracewell, Roxy: The band that invented an era (Faber & Faber, 2007, ) p.385–86 The band signed with Island Records a few days later. The LP was released in June to good reviews and became a major success, reaching No. 10 on the UK album chart in September 1972.", "Later, with more sombre and carefully sculpted soundscapes, the band's eighth—and final—studio album, Avalon (1982), recorded at Chris Blackwell's Compass Point Studios, was a major commercial success and restored the group's critical reputation(Rolling Stone: \"Avalon takes a long time to kick in, but it finally does, and it's a good one.\") and contained the successful single \"More Than This\". The album also included several Roxy Music classics, such as \"Avalon\", \"The Main Thing\", \"The Space Between\", \"True to Life\", and \"To Turn You On\". The trio (augmented by session players) toured extensively until 1983, when Bryan Ferry dissolved the band, and band members devoted themselves full-time to solo careers."]}, {"page": "Tom Waits", "response": ["Chris Blackwell of Island Records learned of Waits's dissatisfaction and approached him, offering to release Swordfishtrombones; Island had a reputation for signing more experimental acts, such as King Crimson, Roxy Music, and Sparks. Waits did not tour to promote the album, partly because Brennan was pregnant. Although not enthusiastic regarding the new trend for music videos, he appeared in one for the song \"In the Neighborhood\", co-directed by Haskell Wexler and Michael A. Russ. Russ also designed the Swordfishtrombones album cover, featuring an image of Waits with Lee Kolima, a circus strongman, and Angelo Rossito, a dwarf. According to David Smay, Swordfishtrombones was \"the record where Tom Waits radically reinvented himself and reshaped the musical landscape.\" The album was critically well received; the New Musical Express named it album of the year."]}, {"page": "The Buggles", "response": ["In 1977, Horn, Downes and Woolley got together and began recording a selection of demos in a small room above a stonemason shop in Wimbledon, southwest London, including \"Video Killed the Radio Star\", \"Clean, Clean\" and \"On TV\". Though unsure about what they wished to do with the demos, Downes remembered that \"we knew even then ... there was some distant goal that had to be reached\", and proceeded to re-record the songs at a 16-track recording studio in north London. Initial searches for the right record label to record and release an album failed,\"'The Buggles' by Geoffrey Downes\" (liner notes). The Age of Plastic 1999 reissue. but Horn, having begun a relationship with Jill Sinclair, a co-founder of Sarm East Studios, managed to secure plans for a potential deal. However, the demo version of \"Video Killed the Radio Star\" caught the attention of producer Chris Blackwell of Island Records and, on the day on which Horn and Downes were due to sign with Sarm East, Blackwell offered them a more lucrative deal, which they accepted. Downes claimed Island rejected them three times before a final deal was agreed upon.Alan Thompson meets 'Buggles' star Geoff Downes . BBC Radio Wales. 7 December 2012. Retrieved 15 August 2013."]}, {"page": "Dudley Moore", "response": ["It was during the Broadway run of Good Evening that Cook persuaded Moore to take the humour of Pete and Dud further on long-playing records as Derek and Clive. Chris Blackwell circulated bootleg copies to friends in the music business and the popularity of the recording convinced Cook to release it commercially as Derek and Clive (Live) (1976). Two further \"Derek and Clive\" albums, Derek and Clive Come Again (1977) and Derek and Clive Ad Nauseam (1978), were later released. The latter was also filmed for a documentary, Derek and Clive Get the Horn. In the film it is clear tensions between the two men were at a breaking point, with Moore at one point walking out of the recording room singing, 'Breaking up is so easy to do.' In 2009, it came to light that, at the time, three separate British police forces had wanted them to be prosecuted under obscenity laws for their \"Derek and Clive\" comedy recordings."]}, {"page": "Genesis (band)", "response": ["In late 1969, Genesis retreated to a cottage owned by Macphail's parents, in Wotton, Surrey, to write, rehearse, and develop their stage performance. They took their work seriously, playing together for as much as eleven hours a day. Their first live gig as Genesis followed in September 1969 at a teenager's birthday. It was the start of a series of live shows in small venues across the UK, which included a radio performance broadcast on the BBC's Night Ride show, on 22 February 1970, and a spot at the Atomic Sunrise Festival held at the Roundhouse in Chalk Farm a month later. During this time the band met with various record labels regarding contract offers. Initial discussions with Chris Blackwell of Island and Chris Wright of Chrysalis were unsuccessful. In March 1970, during the band's six-week Tuesday night residency at Ronnie Scott's Jazz Club in Soho, members of Rare Bird, whom Genesis had previously supported live, recommended the band to producer and A&R man John Anthony of Charisma Records. Anthony attended one of their shows and enjoyed them enough to convince his boss, label owner Tony Stratton-Smith, to watch their next appearance. Stratton-Smith recalled, \"Their potential was immediately apparent ... the material was good and their performance was good ... It was a long shot, because they needed time to find their strength ... but I was prepared to make that commitment\". He agreed to a record and management deal within two weeks, paying Genesis an initial sum of £10 a week (equivalent to £ in )."]}, {"page": "U2", "response": ["U2 feared that following the overt rock of the War album and tour, they were in danger of becoming another \"shrill\", \"sloganeering arena-rock band\". They were confident that fans would embrace them as successors to groups like the Who and Led Zeppelin, but according to Bono: \"something just didn't feel right. We felt we had more dimension than just the next big anything, we had something unique to offer.\"McCormick (2006), p. 147 Thus, they sought experimentation for their fourth studio album, The Unforgettable Fire.Graham (2004), p. 21 Clayton said, \"We were looking for something that was a bit more serious, more arty.\" The Edge admired the ambient and \"weird works\" of Brian Eno, who, along with his engineer Daniel Lanois, eventually agreed to produce the record. Their hiring contravened the initial recommendation of Island Records founder Chris Blackwell, who believed that just when the band were about to achieve the highest levels of success, Eno would \"bury them under a layer of avant-garde nonsense\"."]}, {"page": "Ian Fleming", "response": ["After Ann Charteris's first husband died in the war, she expected to marry Fleming, but he decided to remain a bachelor. On 28 June 1945, she married the second Viscount Rothermere. Nevertheless, Charteris continued her affair with Fleming, travelling to Jamaica to see him under the pretext of visiting his friend and neighbour Noël Coward. In 1948 she gave birth to Fleming's daughter, Mary, who was stillborn. Rothermere divorced Charteris in 1951 because of her relationship with Fleming, and the couple married on 24 March 1952 in Jamaica, a few months before their son Caspar was born in August. Both Fleming and Ann had affairs during their marriage, she with Hugh Gaitskell, the Leader of the Labour Party and Leader of the Opposition. Fleming had a long-term affair in Jamaica with one of his neighbours, Blanche Blackwell, the mother of Chris Blackwell of Island Records."]}, {"page": "Cat Stevens", "response": ["Upon regaining his health at home after his release from the hospital, Stevens recorded some of his newly written songs on his tape recorder and played his changing sound for a few new record executives. After hiring agent Barry Krost, who had arranged for an audition with Chris Blackwell of Island Records, Blackwell offered him a \"chance to record [his songs] whenever and with whomever he liked and, more importantly to Cat, however he liked\". With Krost's recommendation, Stevens signed with Paul Samwell-Smith, previously the bassist of the Yardbirds, to be his new producer.", "Mona Bone Jakon was the precursor for Stevens' international breakthrough album, Tea for the Tillerman, which became a Top 10 Billboard hit. Within six months of its release, it had sold over 500,000 copies, attaining gold record status in the United Kingdom and the United States. The combination of Stevens' new folk rock style and accessible lyrics which spoke of everyday situations and problems, mixed with the beginning of spiritual questions about life, remained in his music from then on. The album features the Top 20 single \"Wild World\"; a parting song after D'Arbanville moved on. \"Wild World\" has been credited as the song that gave Tea for the Tillerman 'enough kick' to get it played on FM radio; and the head of Island Records, Chris Blackwell, was quoted as calling it \"the best album we've ever released\". Other album tracks include \"Hard-Headed Woman\", and \"Father and Son\", a song sung both in baritone and tenor, about the struggle between fathers and their sons who are faced with their own personal choices in life. In 2001, this album was certified by the RIAA as a Multi-Platinum record, having sold 3 million copies in the United States at that time. It is ranked at No. 206 in the 2003 list of \"Rolling Stone's 500 Greatest Albums of All Time\"."]}, {"page": "Nick Drake", "response": ["Drake delivered the tapes of Pink Moon to Chris Blackwell at Island Records, contrary to a popular legend which claims that he dropped them off at the receptionist's desk without saying a word.Dann (2006), p. 170. An advertisement for the album in Melody Maker in February opened with \"Pink Moon—Nick Drake's latest album: the first we heard of it was when it was finished.\"Sandison, Dave. \"Pink Moon\" , UK Press Release (1971); retrieved 14 November 2006. Pink Moon sold fewer copies than its predecessors, although it received some favourable reviews. In Zigzag, Connor McKnight wrote: \"Nick Drake is an artist who never fakes. The album makes no concession to the theory that music should be escapist. It's simply one musician's view of life at the time, and you can't ask for more than that.\"McKnight, Connor, \"In search of Nick Drake\", Zigzag Magazine, #42, 1974."]}, {"page": "Parlophone", "response": ["On 28 September 2012, regulators approved Universal Music Group's planned acquisition of Parlophone's parent group EMI for £1.2 billion, subject to conditions imposed by the European Commission requiring that UMG sell off a number of labels, including Parlophone itself (aside from the Beatles' catalogue, which was kept by UMG and moved to Universal's newly formed Calderstone Productions), Chrysalis (aside from Robbie Williams' catalogue), Ensign, Virgin Classics, EMI Classics, worldwide rights to Roulette Records (and its sublabels), and EMI's operations in Portugal, Spain, France, Belgium, Denmark, Norway, Sweden, Czech Republic, Slovakia, and Poland. These labels and catalogues were operated independently from Universal as Parlophone Label Group until a buyer was found. UMG received several offers for PLG, including those from Island founder Chris Blackwell, Simon Fuller, a Sony/BMG consortium, Warner Music Group, and MacAndrews & Forbes."]}, {"page": "Joe Cocker", "response": ["In 1979, Cocker joined the \"Woodstock in Europe\" tour, which featured musicians like Arlo Guthrie and Richie Havens who had played at the 1969 Woodstock Festival. He also performed in New York's Central Park to an audience of 20,000 people. The concert was recorded and released as the live album, Live in New York. Cocker also toured Europe and appeared on the German television recording amphitheatre Rockpalast, the first of many performances on the show. In 1982, Cocker recorded two songs with the jazz group the Crusaders on their album Standing Tall. One song, \"I'm So Glad I'm Standing Here Today\", was nominated for a Grammy Award and Cocker performed it with the Crusaders at the awards ceremony. The Crusaders wrote this song with Cocker in mind to sing it. Cocker then released a new reggae-influenced album, Sheffield Steel, recorded with the Compass Point All Stars, produced by Chris Blackwell and Alex Sadkin."]}, {"page": "Island Records", "response": ["Island Records is a multinational record label owned by Universal Music Group. It was founded in 1959 by Chris Blackwell, Graeme Goodall, and Leslie Kong in Jamaica, and was eventually sold to PolyGram in 1989. Island and A&M Records, another label recently acquired by PolyGram, were both at the time the largest independent record labels in history, with Island  having exerted a major influence on the progressive music scene in the United Kingdom in the early 1970s.", "Island Records was founded in Jamaica on 4 July 1959 by Chris Blackwell, Graeme Goodall and Leslie Kong, and partially financed by Stanley Borden from RKO. Its name was inspired by the Harry Belafonte song \"Island in the Sun\". Blackwell explained in 2009: \"I loved music so much, I just wanted to get into it, or be as close to it as I could.\"", "Tom Hayes, the label's sales manager between 1965 and 1967, referred to the early period of the label in the UK as \"organized chaos\". \"My Boy Lollipop\", sung by Millie Small, was the label's first success in the UK and led to a world tour that also involved Blackwell. Blackwell explained in a 50th anniversary documentary that he was only interested in building long-term careers at that stage in time, rather than short-term projects. Suzette Newman has been a close colleague of Chris Blackwell's since working together in the early days of Island Records, and while there she ran the Mango world music label.Pride, Dominic. \"Islandlife Promotes Three U.K. Execs\". Billboard magazine. Published by Nielsen Business Media, Inc. 31 October 1998, p. 8. Retrieved 17 December 2016. Suzette Newman and Chris Salewicz were the editors for the book The Story of Island Records: Keep On Running.", "For Toots and the Maytals, the group that introduced the term \"reggae\" in song with their 1968 single \"Do the Reggay\", Chris Blackwell was the one who decided on the line-up of the group before introducing them to an international audience. Blackwell had signed Bob Marley, and now Toots and the Maytals. In November 2016, Jackie Jackson described the formation of the group in a radio interview for Kool 97 FM Jamaica.T interview with Jackie Jackson, Paul Douglas, and Radcliffe \"Dougie\" Bryan. Kool 97 FM.  27 November 2016. Retrieved 27 November 2016. Accompanied by Paul Douglas and Radcliffe \"Dougie\" Bryan in studio, Jackson explained:", "We're all original members of Toots and the Maytals band. First it was Toots and the Maytals, three guys: Toots, Raleigh, and Jerry. ... And then they were signed to Island Records, Chris Blackwell. And we were their recording band. One day we were summoned to Chris' house. And he says, \"Alright gentleman, I think it's time. This Toots and the Maytals looks like it's going to be a big thing\". By this time he had already signed Bob (Marley). So in his camp, Island Records, there was Toots and the Maytals]/ the late Bob Marley; we were talking about reggae is going international now.  We kept on meeting and he (Blackwell) decided that the backing band that back all of the songs, the recording band, should be the Maytals band.  So everything came under Toots and the Maytals. So we became Maytals also. And then we hit the road in 1975 ... we were the opening act for the Eagles, Linda Ronstadt, and Jackson Browne. We were the opening act for The Who for about two weeks.", "The first Toots and the Maytals album released and distributed by Chris Blackwell's Island Records was Funky Kingston. The Maytals had recently added a full-time backing band that included drummer Paul Douglas and bassist Jackie Jackson, and Chris Blackwell joined the group in the studio as a co-producer for the album.Thompson, Dave. Reggae & Caribbean Music, Backbeat Books, 2002, p. 179. Print. Retrieved 19 November 2016. Music critic Lester Bangs described the album in Stereo Review as \"perfection, the most exciting and diversified set of reggae tunes by a single artist yet released.\"\"Toots and the Maytals\", Contemporary Musicians. Encyclopedia.com. 6 October 2016. As Blackwell says, \"The Maytals were unlike anything else ... sensational, raw and dynamic.\"\"Toots and the Maytals: Reggae Got Soul\", BBC Four (documentary). Directed by George Scott. UK. 2011. 59 min. Retrieved 15 December 2016. Blackwell had a strong commitment to Toots and the Maytals, saying: \"I've known Toots longer than anybody – much longer than Bob (Bob Marley). Toots is one of the purest human beings I've met in my life, pure almost to a fault.\"Katz, David, \"Toots and the Maytals' Live: From Stage to Wax in 24 Hours\", Red Bull Music Academy, 19 June 2013. Retrieved 18 September 2016.", "I eventually grew to appreciate how Chris Blackwell, and therefore Island Records, was not about one thing, or one style, or one system, or one way of doing things ... [I began] reflecting how the world functions and reinvents itself precisely because it is a fluid, sometimes dangerous, always exhilarating union of systems and beliefs and the best way of allowing the world to progress is to mix up and place in glorious conflict these various systems and beliefs.", "In 2009, Island Records marked the 50th anniversary of its foundation in Jamaica by Chris Blackwell with a series of live concerts and an exhibition under the Island 50 banner. The events were a celebration of the street-cool, independent outlook and striking visual imagery at the label's creative core. These festivities centred around a week-long run of shows at Shepherd's Bush Empire and Bush Hall in London. The concerts featured performances tracing the label's history from its reggae and jazz roots to the modern era. Among the artists who appeared were Sly & Robbie, Ernest Ranglin, Paul Weller, The Compass Point All Stars, The I Threes, Aswad, Kid Creole & the Coconuts, Grace Jones, Steel Pulse, Keane, Tom Tom Club, Toots & The Maytals, The Mighty Diamonds, Yusuf Islam/ Cat Stevens, Bombay Bicycle Club, Baaba Maal and U2. Another Island 50 tribute event was held over four nights at the Montreux Jazz Festival in Switzerland, with Marianne Faithfull, Grace Jones and Sly & Robbie all appearing, and Chris Blackwell holding a Question & Answer session.", "* Manga Entertainment (1991–1997, moved to Chris Blackwell's Palm Pictures, then was sold to Starz Media)"]}, {"page": "Among the Living", "response": ["The band recorded the new songs in about six weeks at Quadradial Studios in Miami, Florida. It was difficult at the time to record the sound of down-tuned guitars, typical of thrash metal bands such as Anthrax, and manage to distinguish it from the bass guitar and the bass drum. As Kramer recalled: \"I’d never recorded anything quite like it. I wasn’t sure of what they were looking for initially. And it was a challenge to figure out ways to record heavy guitars with heavy drums – it was just a different process.\" Kramer set up the recording sessions as group live performances and the band members were enthusiastic regarding the atmosphere and the sound produced. \"We always felt like when we were in a room rehearsing, we were at our best,\" Ian said. \"We were killing it and we had all the confidence in the world.\" The production then moved for retouching and mixing of the tracks to Compass Point Studios in Nassau, Bahamas, a facility owned by Chris Blackwell, the president of Anthrax's record label Island Records. Ian had suggested that recording studio only because Iron Maiden had been working there since 1983."]}, {"page": "River Phoenix", "response": ["While working on A Night in the Life of Jimmy Reardon in 1986, Phoenix had written and recorded a song, \"Heart to Get\", specifically for the end credits of the movie. 20th Century Fox cut it from the completed film, but director William Richert put it back into place for his director's cut some years later. It was during filming that Phoenix met Chris Blackwell of Island Records; this meeting would later secure Phoenix a two-year development deal with the label. Phoenix disliked the idea of being a solo artist and relished collaboration; therefore he focused on putting together a band. Aleka's Attic were formed in 1987 and the lineup included his sister Rain."]}, {"page": "1996 in music", "response": ["** Jamaican authorities open fire on Jimmy Buffett's seaplane, Hemisphere Dancer, mistaking it for a drug trafficker's plane. U2 singer Bono and Island Records executive, Chris Blackwell, are also on the plane; no-one is injured."]}, {"page": "Jimmy Buffett", "response": ["In 1993, he launched Margaritaville Records, with distribution through MCA Records. His MCA record deal ended with the release of 1996's Christmas Island and he took Margaritaville Records over to Chris Blackwell's Island Records for a two-record deal, 1998's Don't Stop The Carnival and 1999's Beach House on the Moon. In the fall of 1999, he started Mailboat Records to release live albums. He entered into a partnership with RCA Records for distribution in 2005 and 2006 for the two studio albums License To Chill and Take The Weather With You.", "In January 1996, Buffett's Grumman HU-16 airplane named Hemisphere Dancer was shot at by Jamaican police, who believed the craft to be smuggling marijuana. The aircraft sustained minimal damage. The plane was carrying Buffett, as well as U2's Bono, his wife and 2 children, and Island Records producer Chris Blackwell, and co-pilot Bill Dindy. The Jamaican government acknowledged the mistake and apologized to Buffett, who penned the song \"Jamaica Mistaica\" for his Banana Wind album based on the experience. The plane from the incident is now on display at Margaritaville Orlando, located at Universal Studio."]}, {"page": "Traffic (band)", "response": ["Traffic signed to Chris Blackwell's Island Records label (where Winwood's elder brother Muff, also a member of the Spencer Davis Group, later became a record producer and executive), and their debut single \"Paper Sun\" became a UK hit in mid-1967 (#4 Canada). Their second single, Mason's psych-pop \"Hole in My Shoe\", was an even bigger hit (#4 Canada), and it became one of their best-known tracks. The band's third single, \"Here We Go Round the Mulberry Bush\", was made for the soundtrack of the 1967 British feature film of the same name. Their debut album was Mr. Fantasy, produced by Jimmy Miller, and like the singles, was a hit in the UK but not as big elsewhere, although it did reach number 88 in the US.Traffic – Billboard , Allmusic. Retrieved 11 August 2011."]}, {"page": "Trevor Horn", "response": ["In 1982, Horn and his wife formed a music publishing company, Perfect Songs. This coincided with their then recent acquisition of Basing Street Studios, which also housed the fledgling publishing company. Perfect Songs was able to harness and develop the up-and-coming young artists working in the recording studio. The first to be signed were Frankie Goes to Hollywood, followed by Art of Noise and Propaganda. These first few signings to the company were instrumental in establishing the company ethos of \"innovation and artiste development, taking risks and signing acts far into the left field\". In 1983, Horn and his wife purchased Basing Street Studios in west London from Chris Blackwell and renamed it SARM West Studios. The deal included the rights for them to operate a record label through Island Record's distribution which led to the formation of ZTT Records with NME writer Paul Morley. It is named after the sound poem of the same name by Italian futurist Filippo Tommaso Marinetti."]}, {"page": "The B-52's", "response": ["In 1979, The B-52's signed contracts as they flew over to Compass Point Studios in Nassau, Bahamas, to record their debut studio album, with Island founder Chris Blackwell producing. The band was surprised by Blackwell's recording methods; he wanted to keep the sound as close as possible to its live sound, so he used almost no overdubs or additional effects.With the Wild Crowd! Live in Athens, GA"]}, {"page": "Procol Harum", "response": ["The Paramounts were signed to EMI UK for their releases; until one day before Procol Harum linked with EMI UK again, they were called The Pinewoods. A last-minute offer from Chris Blackwell's fledgling Island Records label was rejected by Brooker and band."]}, {"page": "David Bailey", "response": ["Bailey was hired in 1970 by Island Records' Chris Blackwell to shoot publicity photos of Cat Stevens for his upcoming album Tea for the Tillerman. Stevens, who is now known as Yusuf Islam maintains that he disliked having his photo on the cover of his albums, as had previously been the case, although he allowed Bailey's photographs to be placed on the inner sleeve of the album."]}, {"page": "Blind Faith", "response": ["Clapton and Winwood's respective managers, Robert Stigwood and Chris Blackwell, said they would be happy to manage the new band. This created immediate tension; Stigwood wanted a quick money-making formula while the band wanted time to write songs and develop as a unit. Winwood later said, \"they wanted a supergroup and we didn't\"."]}, {"page": "Steve Winwood", "response": ["In 1964, they signed their first recording contract with Island Records. Producer and founder Chris Blackwell later said of Winwood, \"He was really the cornerstone of Island Records. He's a musical genius and because he was with Island all the other talent really wanted to be with Island.\" The group's first record, a single, was released 10 days after Winwood's 16th birthday. The group had their first number one single at the end of 1965, with \"Keep on Running\"; the money from this success allowed Winwood to buy his own Hammond organ. Winwood co-wrote and recorded the chart-topping hits \"Gimme Some Lovin'\" and \"I'm a Man\" before leaving the Spencer Davis Group in 1967."]}, {"page": "Harrow School", "response": ["Other alumni include writers Lord Byron, Anthony Trollope, Sir Terence Rattigan, Simon Sebag-Montefiore, and Richard Curtis, the 6th Duke of Westminster and prominent reformist Lord Shaftesbury, military commanders such as Earl Alexander of Tunis and Sir Peter de la Billiere, and business people (including DeBeers chairman Nicky Oppenheimer, Pret a Manger founder Julian Metcalfe) and the big game hunter and artist General Douglas Hamilton, as well as Island Records founder Chris Blackwell. In sports, the school produced the first two Wimbledon champions (Spencer Gore and Frank Hadow) as well as FA Cup founder C.W. Alcock and current England rugby international players Billy Vunipola and Maro Itoje. Alumni in the arts and media industry include actors Benedict Cumberbatch and Cary Elwes, photographer Count Nikolai von Bismarck, singer James Blunt, pianist James Rhodes, and horse racing pundit John McCririck. Margaret Thatcher sent her son, Mark, to Harrow."]}, {"page": "Natty Dread", "response": ["* Chris Blackwell – producer", "Category:Albums produced by Chris Blackwell"]}, {"page": "Uprising (Bob Marley and the Wailers album)", "response": ["*Chris Blackwell – Executive producer", "Category:Albums produced by Chris Blackwell"]}, {"page": "The B-52's (album)", "response": ["Category:Albums produced by Chris Blackwell"]}, {"page": "Blind Faith (Blind Faith album)", "response": ["* Chris Blackwell, Robert Stigwood – executive producers"]}, {"page": "Burnin' (Bob Marley and the Wailers album)", "response": ["Burnin' is the sixth album by Jamaican reggae band Bob Marley and the Wailers, released in October 1973. It was written mostly by Bob Marley and recorded and produced by Bob Marley and the Wailers in Jamaica, and then mixed and overdubbed by Chris Blackwell in London. It contains the song \"I Shot The Sheriff\", which was later covered by Eric Clapton. It was the last album before Peter Tosh and Bunny Wailer departed for solo careers.  A commercial and critical success in the United States, Burnin was certified Gold and later added to the National Recording Registry, with the Library of Congress deeming it historically and culturally significant.", "The album was recorded at Harry J's studio in Kingston, Jamaica, with Bob Marley and the Wailers produccing.  It was mixed and overdubbed by Chris Blackwell at Island Records’ Basing Street Studios in London during the spring of 1973 while the band were touring in support of their previous album, Catch a Fire.", "* Chris Blackwell – producer", "Category:Albums produced by Chris Blackwell"]}]}}