{"wiki_id": "http://www.wikidata.org/entity/Q862313", "itemLabel": "Bill McLaren", "itemDescription": "Scottish rugby union player (1923-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_McLaren", "wikipedia_page": {"main": "William Pollock McLaren  (16 October 1923 – 19 January 2010) was a Scottish rugby union commentator, teacher, journalist and one time rugby player. Known as 'the voice of rugby', he retired from commentating in 2002. Renowned throughout the sport, his enthusiasm and memorable turn of phrase endeared him to many.", "link_mentions": [{"page": "Hawick", "response": ["Hawick balls or baws, also known as Hills Balls or taffy rock bools, are a peppermint-flavoured boiled sweet that originated in the town. They are particularly associated with rugby commentator Bill McLaren who was known to offer them from a bag that he always carried. They are now produced in Greenock.", "The Borders Abbeys Way passes through Hawick. A statue of Bill McLaren, the late popular rugby commentator, is in Wilton Lodge Park, to the west of the town centre.", "*Bill McLaren (1923–2010), sports journalist"]}, {"page": "January 19", "response": ["*2010 – Bill McLaren, Scottish rugby player and sportscaster (b. 1923)"]}, {"page": "October 16", "response": ["*  1923   – Bill McLaren, Scottish rugby player and sportscaster (d. 2010)"]}, {"page": "Hong Kong Sevens", "response": ["Bill McLaren, in his autobiography Talking of Rugby writes at length about his Hong Kong Sevens experiences:"]}, {"page": "List of sports announcers", "response": ["* Bill McLaren – BBC Radio 1953–1959, BBC Sport 1959–2002"]}, {"page": "The New Saints F.C.", "response": ["On the Sky Sports football show Soccer Saturday, TNS's name was gently mocked by the programme's main presenter, Jeff Stelling. At the end of the day's classified check, if TNS had won at home, Stelling invariably used his catchphrase \"They'll be dancing in the streets of Total Network Solutions tonight!\", since updated to \"dancing in the streets of the New Saints\". Stelling's joke was also occasionally aimed at fellow Welsh side, Airbus UK in 2005–06. Stelling's joke may ultimately derive from the accidental 'they'll be dancing in the streets of Raith', claimed to have been said by football commentator Sam Leitch in the 1960s during a match played by the Kirkcaldy-based Raith Rovers, though the phrase is better known as a stock phrase of rugby commentator Bill McLaren, often stating \"they'll be dancing in the streets of ...\" and inserting in the name of the winning team."]}, {"page": "Doddie Weir", "response": ["He was once described by commentator Bill McLaren as being \"On the charge like a mad giraffe\"."]}, {"page": "Scottish rugby commentators and journalists", "response": ["The most famous of TV commentators until recently was Bill McLaren, a Scotsman from Hawick and one of world rugby's best-loved personalities. He retired in 2002 and died in 2010.", "Bill Johnstone, nephew of Bill McLaren, leads the BBC Radio Scotland rugby commentary team on the Sportsound programme. He retired in 2017. John Beattie also does commentary and interviews such people as Sean Lineen and Andy Irvine. Other commentators include John Jeffrey and Gary Parker.", "*Bill McLaren - his life"]}, {"page": "Ieuan Evans", "response": ["While at Llanelli, Evans gained a call-up to the Welsh National Side and made his first international appearance as a right-wing for Wales against France in Paris in 1987. He went on to win 72 caps for Wales, 28 of which as a captain, and scored 33 tries – at that time a record for Wales – and was dubbed \"Merlin\" by TV commentator Bill McLaren. In March 1994, he captained Wales when the team won the Five Nations Championship."]}, {"page": "Hawick RFC", "response": ["The famous rugby commentator Bill McLaren also played for Hawick."]}, {"page": "Ayr RFC", "response": ["The 2012–13 season proved very fruitful for Ayr. Their first silverware came in November through the Bill McLaren Shield, a new trophy for winning at home, taking possession of the shield when they beat Edinburgh Accies at Raeburn Place, and then becoming the first team to have their name engraved on it, having defended it four times after beating GHA in a West Regional Shield tie. Ayr were still in possession of the trophy at the end of the season having not been beaten at home in any competition all year. Ayr continued their success by winning the RBS West Cup with a 15–10 victory over Glasgow Hawks."]}, {"page": "International Rugby Hall of Fame", "response": ["|Bill McLaren, commentator "]}, {"page": "Roger Baird", "response": ["He played for the full Kelso sevens team while still at Merchiston, collecting a Melrose winner's medal at 17. Bill McLaren considered him an exceptional sevens player."]}, {"page": "Tom Elliot", "response": ["Elliot was born into a farming family in the Scottish Borders. He was educated at St. Mary's School, Melrose and at Loretto School, Musselburgh. After school he joined Gala RFC and played for the 2XV at lock. He soon moved to loose-head prop and over the next fifteen years made the position his own. Early in his career he gained a reputation for rumbustious play. Bill McLaren described him as \"a tough rugged son of the soil\"."]}, {"page": "Jonah Lomu Rugby", "response": ["Commentary for the game was supplied by Bill McLaren and Bill Beaumont."]}, {"page": "Simon Geoghegan", "response": ["Geoghegan is perhaps best known for his try in the 1994 Five Nations match against England at Twickenham, that was instrumental in a famous 13–12 win. Another key contribution during the match was a  kick, chase and tackle on England fly-half Rob Andrew which led to a crucial kickable penalty to Ireland. An adept side stepper, he was once described by the commentator Bill McLaren as being \"Like a mad trout up a burn\"."]}, {"page": "IRB Chairman's Award", "response": ["|align=left| Bill McLarenGeorge Pippos (posthumously)"]}, {"page": "McLaren (surname)", "response": ["*Bill McLaren (1923–2010), Scottish sports broadcaster"]}, {"page": "Rugby Special", "response": ["Rugby Special was the main rugby union programme on the BBC in the UK. The show ran from 1966 and past presenters included David Vine, Keith Macklin, Cliff Morgan, Chris Rea, Nigel Starmer-Smith, Bill Beaumont and John Inverdale. The main commentators were Bill McLaren, Cliff Morgan, Nigel Starmer-Smith, David Parry-Jones, Martyn Williams, Lynn Davies, Jim Neilly and Eddie Butler In the early seventies, the theme tune was \"Spinball\" by Paddy Kingsland but this was later replaced by \"Holy Mackerel\" by The Shadows' drummer, Brian Bennett which was replaced for one season 1988–89 by the Kenny G version of \"What Does It Take (To Win Your Love)\" from the 1986 Duotones album replaced from 1989–90 to 1993–94 by a specially commissioned theme. From 1994 to 1995 the programme was contracted out to an independent production company Chrysalis after 28 years as an in-house BBC production. The programme ended its original run in 1997 after losing the rights to cover English domestic games, the Heineken Cup and England home tests to SKY and Welsh domestic matches to HTV/S4C the S4C involvement was controversial as BBC Wales was providing much of S4C's Welsh Language sports coverage under the BBC Cymru brand and was along with Ski Sunday merged into Sunday Grandstand in November 1997 when Sunday Grandstand became a year-round programme the first edition of the all year round Sunday Grandstand on 16 November 1997 featured live coverage of Wales v Tonga. Though in 1992 and 1993 the programme was integrated into special editions of Sunday Grandstand featuring the Formula 1 South African Grand Prix and European Grand Prix at Donington Park. The programme returned on late Thursday nights in 2002 but was discontinued in 2005, when it was a highlights programme of Autumn internationals and Six Nations with studio guests and an audience of fans from the Six Nations. But when the Premiership highlights rights were regained from the 2001–02 season highlights were shown on Sunday Grandstand. Also from the 1999-2000-2002-2003 seasons the Heineken Cup was regained though it was covered by the BBC in the 1996–97 season which was the only season in the original 1966–97 run that the BBC covered the competition", "From the 1986–87 season BBC2 Wales along with BBC2 Scotland and BBC Two Northern Ireland started their own regional versions to cover their own matches to go out at the same time as the main version broadcast in England from London the main BBC2 England version would often show one or two of these games mostly club games from Wales and Scotland as a second and third match. While the Scottish opt-out went out under the Sportscene banner as Sportscene Rugby Special the presenter was Jill Douglas the commentator was Bill McLaren. In Wales Rugby Union highlights until 1986 went out on BBC1 Wales on Sunday Afternoons under the Sports Line-Up title later on as Weekend Rugby Union with David Parry-Jones as presenter and commentator but later he would carry on as presenter but Martyn Williams would take over the commentator role with Phil Bennett as co-commentator but from the 1986–87 season the Rugby Union highlights would move to BBC2 Wales and become Rugby Special Wales with David Parry-Jones and Martyn Williams continuing in the roles in the first season while from 1987 to 1988 Alan Wilkins became the presenter though he would also deputise as a commentator when Martyn Williams wasn't available with Martyn Williams as the main commentator and Phil Bennett in the commentary box until the end of the 1988–89 season Lynn Davies taking over as commentator from 1989 to 1990 and carried on until 1995 again with Phil Bennett as co-commentator when it would become Scrum V where he would continue as commentator until 1998 when Huw Llywelyn Davies would take over the English Language commentator role for a short time before returning to his Welsh Language commentator role on S4C. In Northern Ireland, the Northern Ireland version though mostly covering matches involving Ulster Rugby was a co-production with RTE due to the fact that Rugby Union in Ireland is governed on a United Ireland basis under the Irish Rugby Football Union banner and the commentators were Jim Neilly and Fergus Slattery"]}, {"page": "Bill Dickinson", "response": ["He was also coach of Jordanhill, where he worked with Ian McLauchlan, and Bill McLaren considered that McLauchlan's success was partly down to Dickinson:McLaren"]}, {"page": "World Rugby Hall of Fame", "response": ["|Bill McLaren"]}, {"page": "Rugby World", "response": ["* Bill McLaren"]}, {"page": "Colin Deans", "response": ["He was born in Hawick in the Scottish borders. He played for Hawick Trades and then Hawick.Bath, p133 His nickname was Beano. Deans attended the primary school in Hawick where Bill McLaren taught."]}, {"page": "Rory Lawson", "response": ["A grandson of commentator Bill McLaren and son of Scottish international scrum-half Alan Lawson, Lawson comes from a sporting family. His brother Gregor played for Scotland 7's and fullback for London Scottish FC, and after retiring founded Morphsuits, a fancy dress company.  His cousin, Jim Thompson, is a fullback/centre with Edinburgh Rugby."]}, {"page": "Rugby union in Austria", "response": ["The post-war period has seen a revival in Austrian rugby, partly due to the large number of foreign military personnel who came to be based there. In 1946, matches were being played by the BTA (British Troops Austria) XV at Vienna and elsewhere. One of their \"home\" matches in Vienna was against a British combined services Central Mediterranean Forces XV, which featured not only the future television rugby commentator and Hawick RFC player Bill McLaren, but also a Colonel Stan Adkins, who would later play for Coventry RFC and England.McLaren, Bill Talking of Rugby (1991, Stanley Paul, London ), pp 34,35"]}, {"page": "Danie Gerber", "response": ["Gerber has been described as one of the greatest ever rugby centres. He has been named South Africa's greatest ever centre, and Naas Botha has said he is one of the greatest ever South African rugby players. Martin Johnson named him in his International Rugby Hall of Fame member's XV, and Bill McLaren's named him in his 'all time' XV.XV refers to the fifteen players on a rugby team."]}]}}