{"wiki_id": "http://www.wikidata.org/entity/Q864709", "itemLabel": "William Brewster", "itemDescription": "religious leader and emigrant to Plymouth Colony, North America (1566-1644)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Brewster_(Mayflower_passenger)", "wikipedia_page": {"main": "William Brewster (1568 – 10 April 1644) was an English official and Mayflower passenger in 1620. In Plymouth Colony, by virtue of his education and existing stature with those immigrating from the Netherlands, Brewster, a Brownist (or Puritan Separatist), became senior elder and the leader of the community.", "link_mentions": [{"page": "April 10", "response": ["*1644 – William Brewster, English official and pilgrim leader (b. 1566)"]}, {"page": "1644", "response": ["* April 10 – Reverend William Brewster, English Pilgrim leader (b. 1567)"]}, {"page": "Pilgrims (Plymouth Colony)", "response": ["William Brewster was a former diplomatic assistant to the Netherlands. He was living in the Scrooby manor house while serving as postmaster for the village and bailiff to the Archbishop of York. He had been impressed by Clyfton's services and had begun participating in services led by John Smyth in Gainsborough, Lincolnshire. After a time, he arranged for a congregation to meet privately at the Scrooby manor house. Services were held beginning in 1606 with Clyfton as pastor, John Robinson as teacher, and Brewster as the presiding elder. Shortly after, Smyth and members of the Gainsborough group moved on to Amsterdam. Brewster was fined £20 (about £ today) in absentia for his non-compliance with the church. This followed his September 1607 resignation from the postmaster position, about the time that the congregation had decided to follow the Smyth party to Amsterdam.", "thumb|Title page of a pamphlet published by William Brewster in Leiden", "William Brewster had been teaching English at the university, and Robinson enrolled in 1615 to pursue his doctorate. There he participated in a series of debates, particularly regarding the contentious issue of Calvinism versus Arminianism (siding with the Calvinists against the Remonstrants).See the Synod of Dort.", "Amid these negotiations, William Brewster found himself involved with religious unrest emerging in Scotland. In 1618, King James had promulgated the Five Articles of Perth which were seen in Scotland as an attempt to encroach on their Presbyterian tradition. Brewster published several pamphlets that were critical of this law, and they were smuggled into Scotland by April 1619. These pamphlets were traced back to Leiden, and the English authorities unsuccessfully attempted to arrest Brewster. English ambassador Dudley Carleton became aware of the situation and began pressuring the Dutch government to extradite Brewster, and the Dutch responded by arresting Thomas Brewer the financier in September. Brewster's whereabouts remain unknown between then and the colonists' departure, but the Dutch authorities did seize the typesetting materials which he had used to print his pamphlets. Meanwhile, Brewer was sent to England for questioning, where he stonewalled government officials until well into 1620. He was ultimately convicted in England for his continued religious publication activities and sentenced in 1626 to a 14-year prison term.", "The Mayflower passengers sighted land on November 9, 1620 after enduring miserable conditions for about 65 days, and William Brewster led them in reading Psalm 100 as a prayer of thanksgiving. They confirmed that the area was Cape Cod within the New England territory recommended by Weston. They attempted to sail the ship around the cape towards the Hudson River, also within the New England grant area, but they encountered shoals and difficult currents around Cape Malabar (the old French name for Monomoy Island). They decided to turn around, and the ship was anchored in Provincetown Harbor by November 11/21."]}, {"page": "Leiden", "response": ["* William Brewster (1568–1644) pilgrim, Mayflower passenger in 1620  "]}, {"page": "Henry Wadsworth Longfellow", "response": ["Longfellow was descended from English colonists who settled in New England in the early 1600s.Farnham, Russell Clare and Dorthy Evelyn Crawford. A Longfellow Genealogy: Comprising the English Ancestry and Descendants of the Immigrant William Longfellow of Newbury, Massachusetts, and Henry Wadsworth Longfellow. Walrus Publishers, 2002. They included Mayflower Pilgrims Richard Warren, William Brewster, and John and Priscilla Alden through their daughter Elizabeth Pabodie, the first child born in Plymouth Colony."]}, {"page": "Chevy Chase", "response": ["Chase was named for his adoptive grandfather, Cornelius, while the nickname \"Chevy\" was bestowed by his grandmother from the medieval English ballad \"The Ballad of Chevy Chase\". As a descendant of the Scottish Clan Douglas, she thought the name appropriate. He is a 14th-generation New Yorker, and was listed in the Social Register at an early age. His mother's ancestors arrived in Manhattan starting in 1624—among his ancestors are New York City mayors Stephanus Van Cortlandt and John Johnstone; the Dutch Schuyler family, through his ancestor Gertrude Schuyler, the wife of Stephanus Van Cortlandt; John Morin Scott, General of the New York Militia during the American Revolution; Anne Hutchinson, dissident Puritan preacher and healer; and Mayflower passengers and signers of the Mayflower Compact from England, John Howland,Cornelius Crane \"Chevy\" Chase, Edward Tinsley \"Ned\" Chase, Edward Leigh Chase, Charles Dennison Chase, Henry Seymour Chase, Jarvis Brown Chase, Paul Chase m. Betty Kinnicutt, John Kinnicutt m. Hannah Gorham, Jabez Gorham, Jr., Jabez Gorham, Sr., John Gorham m. Desire Howland, daughter of John Howland & Elizabeth Tilley. and the Pilgrim colonist leader and spiritual elder of the Plymouth Colony, William Brewster. According to his step-brother John:"]}, {"page": "Brewster, Nebraska", "response": ["The town was laid out in 1884 by George Washington Brewster who had homesteaded the land there.  It was named for one of his ancestors, William Brewster, who had arrived in America on the Mayflower.  The community was named the county seat in 1887 after George Washington Brewster offered to build the required buildings.  According to town lore, Brewster had expected the state capitol to be located in the community because of its central location.Schipporeit, Al.  \"Brewster--Blaine County\".  Nebraska... Our Towns.   Retrieved 2013-07-27."]}, {"page": "Anthony Perkins", "response": ["Perkins was a descendant of a Mayflower passengers John Howland, Myles Standish and William Brewster as well as Roger Conant. Through an entirely paternal line he is descended from John Perkins, who arrived in Boston from England in 1630 as part of the Puritan migration to New England. He attended Brooks School and Browne & Nichols School, having moved to Boston in 1942, and then Columbia University and Rollins College.Notable Kin: An Anthology of Columns First Published in the NEHGS Nexus, 1986-1995, Volume 2 - New England Historic Genealogical Society, Boston, Massachusetts, by Carl Boyer, 3rd, 1998 pg. 118"]}, {"page": "Richard Crenna", "response": ["| William Brewster"]}, {"page": "Matthew C. Perry", "response": ["His mother was born in County Down, Ireland and was a descendant of an uncle of William Wallace, the Scottish knight and landowner.Skaggs, David Curtis. \"Oliver Hazard Perry: Honor, Courage, and Patriotism in the Early U.S. Navy\". US Naval Institute Press, 2006. P. 4 His paternal grandparents were James Freeman Perry, a surgeon, and Mercy Hazard, a descendant of Governor Thomas Prence, a co-founder of Eastham, Massachusetts, who was a political leader in both the Plymouth and Massachusetts Bay colonies, and governor of Plymouth; and a descendant of Mayflower passengers, both of whom were signers of the Mayflower Compact, Elder William Brewster, the Pilgrim colonist leader and spiritual elder of the Plymouth Colony, and George Soule, through Susannah Barber Perry."]}, {"page": "Plymouth Colony", "response": [":* Duxbury, founded by Myles Standish, it was incorporated in 1637. Other notable residents of Duxbury included John Alden, William Brewster, and Governor Thomas Prence."]}, {"page": "William Bradford (governor)", "response": ["When Bradford was 12 years old, a friend invited him to hear the Rev. Richard Clyfton preach 10 miles away in All Saints' Church, Babworth in Nottinghamshire. Clyfton believed that the Church of England ought to eliminate all vestiges of Roman Catholic practices, and that this would result in a purer Christian church. Bradford was inspired by his preaching and continued to attend his sermons, even though he was forbidden by his uncles.Schmidt, 8 During one meeting, Bradford met William Brewster, a bailiff and postmasterSchmidt, 9. who lived at Scrooby manor, four miles from Austerfield. During frequent visits, Bradford borrowed books from him, and Brewster regaled him with stories of the efforts toward church reform taking place throughout England."]}, {"page": "Brewster, Massachusetts", "response": ["Brewster was first settled in 1656 as a northeastern parish of the town of Harwich. The town separated from Harwich as the northern, more wealthy parish in 1693, and was officially incorporated as its own town in 1803 when the less wealthy citizens of Harwich were upset that the town's institutions were all on Brewster's main street (now Route 6A), including the town hall and churches. Brewster was named in honor of Elder William Brewster, the first religious leader of the Pilgrims at Plymouth Colony. The town's history grew around Stony Brook, where the first water-powered grist and woolen mill in the country was founded in the late 17th century. There were many rich sea captains in the town, who built many of the mansions and stately homes which now constitute the town's inns and bed-and-breakfasts.Cape Cod, Martha's Vineyard and Nantucket Street Atlas. South Easton, MA: Arrow Maps Inc., 2004, p 32. Most notable of these are the Brewster Historical Society Capt. Elijah Cobb House on Lower Road, Crosby Mansion on Crosby Lane by Crosby Beach, and the Captain Freeman Inn on Breakwater Road.", "In a 2011 episode of Who Do You Think You Are?, Ashley Judd traced her direct lineage back to William Brewster, the town's namesake."]}, {"page": "Seth MacFarlane", "response": ["MacFarlane was born and raised in Kent, Connecticut. His parents, Ronald Milton MacFarlane and Ann Perry (née Sager), were born in Newburyport, Massachusetts. MacFarlane's younger sister Rachael is also a voice actress. He has roots in New England going back to the 1600s, and is a descendant of Mayflower passenger William Brewster. MacFarlane's parents met in 1970, when they both lived and worked in Boston, Massachusetts, and married later that year. The couple moved to Kent in 1972, where Ann began working in the Admissions Office at South Kent School. She later worked in the College Guidance and Admissions Offices at the Kent School, a selective college preparatory school, where Ronald was a teacher."]}, {"page": "Mayflower Society", "response": ["* William Brewster"]}, {"page": "John Carver (Plymouth Colony governor)", "response": ["Carver and Robert Cushman began negotiations with officials of the Virginia Company in London in 1617 for land in the Colony of Virginia where they could live and be self-governing. They came in contact with Sir Edwin Sandys, an acquaintance of church elder William Brewster and a leading member of the Virginia Company. They had to put together seven articles for the Council for Virginia, signed by all the senior Puritan church members, which acknowledged the supremacy of the king and the Church of England.Nathaniel Philbrick, Mayflower: A Story of Courage, Community and War (New York: Viking, 2006), p. 19"]}, {"page": "William Brewster", "response": ["William Brewster may refer to:", "*William Brewster (Mayflower passenger) (1560–1644), English official and Mayflower passenger in 1620", "*William Brewster (ornithologist) (1851–1919), American ornithologist", "*William Brewster (priest) (died 1465), Canon of Windsor"]}, {"page": "Elisabeth Shue", "response": ["Shue was born in Wilmington, Delaware, the daughter of Anne Brewster (née Wells), and James William Shue,Obituary for James Shue  retrieved 2/20/2015 a one-time congressional candidate, lawyer, and real estate developer, who was president of the International Food and Beverage Corporation. Her mother was a vice president in the private banking division of the Chemical Banking Corporation.Elisabeth Shue Biography (1963-), Film Reference Shue grew up in South Orange, New Jersey. Her parents divorced when she was nine.Bandler, Michael J. \"The Will to Win; Elisabeth Shue and her brother Andrew had a dream to honor their brother's memory with a film about family and soccer. They didn't trust Hollywood to get it right, so they financed and filmed it here at home.\", New Jersey Monthly, December 20, 2007. Accessed December 23, 2013.Actress in `Babysitting' takes charge of her life, Author: Bob Strauss, Date: July 12, 1987 Publication: Chicago Sun-Times Shue's mother is a descendant of Pilgrim leader William Brewster, while her father's family emigrated from Germany to Pennsylvania in the early 19th century. Shue was raised with her three brothers (William, Andrew and John) and was very close to them. Her younger brother, Andrew, is also an actor, best known for his role as Billy Campbell in the Fox series Melrose Place. Shue graduated from Columbia High School, in 1981 in Maplewood, New Jersey, where she and Andrew were inducted into the school's Hall of Fame in 1994. She has two half-siblings from her father's remarriage, Jenna and Harvey Shue."]}, {"page": "John Cotton (minister)", "response": ["Cotton served as teacher and authority on scripture for both his parishioners and his fellow ministers.  For example, he maintained a lengthy correspondence with Concord minister Peter Bulkley from 1635 to 1650.  In his letters to Cotton, Bulkley requested help for doctrinal difficulties as well as for challenging situations emanating from his congregation.  Plymouth minister John Reynes and his ruling elder William Brewster also sought Cotton's professional advice.  In addition, Cotton continued an extensive correspondence with ministers and laymen across the Atlantic, viewing this work as supporting Christian unity similar to what the Apostle Paul had done in biblical times."]}, {"page": "Sydney Biddle Barrows", "response": ["Barrows comes from the Biddle family of Philadelphia, Pennsylvania and is descended directly from Mayflower passengers William Brewster, John Howland, Elizabeth Tilley, and Thomas Rogers. Her father is Donald Byers Barrows, Jr. (born 1926) of Rumson, N.J, and her mother is Jeannette Ballantine, who is now married to Felix Molzer, a musician and director of the Monmouth Arts Center in New Jersey."]}, {"page": "Scrooby", "response": ["The Manor House belonged to the Archbishops of York and so was sometimes referred to as a palace. (A nearby former farmhouse is still called Palace Farm.) At the end of the sixteenth century, the house was occupied by William Brewster, the Archbishop's bailiff, who was also postmaster. His son, also named William, took that post in the 1590s after a job as an assistant to the Secretary of State under Queen Elizabeth I. The junior William became dissatisfied with the Anglican Church as it was developing at the time, acquired Brownist beliefs and attempted to leave for the Netherlands in 1607. After an unsuccessful first attempt, Brewster succeeded in 1608.  He eventually went to New England in 1620 on the Mayflower, as one of the people later called Pilgrim Fathers.  The Manor House was demolished early in the 19th century, though the levelled area where it stood can still be made out, as can the twin sets of steps (now just grassy banks) that led down to the ornamental ponds.   All that remain are a cottage (perhaps intended for a resident official and not open to the public, though it has commemorative plaques), a substantial brick dovecote and the fishponds. Notice boards direct visitors to the best places to view the historic sites which today are private property."]}, {"page": "Jacob Dolson Cox", "response": ["Jacob Dolson Cox was born in Montreal (then located in the British colonial Province of Lower Canada) on October 27, 1828.  His father and mother respectively were Jacob Dolson Cox and Thedia Redelia (Kenyon) Cox, both Americans and residents of New York. His father Jacob was of Dutch origin, descended from Hanoverian emigrant Michael Cox (Koch) who arrived in New York in 1702. His mother Thedia was descended from Revolutionary War Connecticut soldier Payne Kenyon who was there when British General John Burgoyne surrendered at Saratoga in 1777. Thedia also was descended from Revolutionary War Connecticut soldier Freeman Allyn, who fought against Benedict Arnold at Groton. The Allyns were the early settlers of Salem and Manchester, Massachusetts. Thedia was additionally descended from the Elder William Brewster who emigrated to the Plymouth Colony on the Mayflower in 1620."]}, {"page": "Edward Winslow", "response": ["In 1617 Edward Winslow traveled to Leiden Holland to join the English exile Separatist church and help Elder William Brewster with his underground (illicit) printing activities. Brewster and young Edward Winslow in 1618 were responsible for a religious tract, Perth Assembly, critical of the English king and his church bishops which caused an angry King James to order Brewster's arrest, sending English government agents to Holland to try to find and seize him. The Pilgrims had bad fortune in this, as Elder Brewster was forced to hide, first in Holland, then in England, from the agents just when the Pilgrims needed his leadership in preparation for their departure for America."]}, {"page": "Benjamin H. Brewster", "response": ["Benjamin's father was Francis Enoch Brewster, a descendant of William Brewster, a passenger on the Mayflower.  The elder Brewster was a successful and well-known attorney in Philadelphia who had abandoned Benjamin's mother, Maria Hampton, for her companion Isabella Anderson, by whom he had two children out of wedlock.  His step-brothers were Frederick Carroll Brewster (1825–1898), who became Attorney General of Pennsylvania, and Enoch Carroll Brewster (1828–1863)."]}, {"page": "List of Mayflower passengers", "response": ["*More, Richard, (Shipton, Shropshire), age 6, indentured to William Brewster. He is buried in the Charter Street Burial Ground in Salem, Massachusetts. He is the only Mayflower passenger to have his gravestone still where it was originally placed sometime in the mid-1690s. Also buried nearby in the same cemetery were his wives Christian Hunter More and Jane (Crumpton) More.Memorial for The More children   ", "*More, Mary*, (Shipton, Shropshire), age 4, assigned as a servant of William Brewster. She died sometime in the winter of 1620/1621. She and her sister Ellen are recognized on the Pilgrim Memorial Tomb in Plymouth."]}, {"page": "Jordana Brewster", "response": ["Jordana Brewster was born in Panama City, Panama, on April 26, 1980, the older of two daughters. Her mother, Maria João ( Leal de Sousa), is a former swimsuit model from Brazil who appeared on the 1978 cover of Sports Illustrated, and her father, Alden Brewster, is an American investment banker. Her paternal grandfather, Kingman Brewster Jr., was president of Yale University (1963–77) and the United States Ambassador to the United Kingdom (1977–81). Brewster is a direct descendant of Mayflower passengers William Brewster and Edward Doty. She left Brazil at the age of 10, settling in Manhattan, New York City, where she studied at the Convent of the Sacred Heart and graduated from the Professional Children's School. Brewster graduated from Yale University with a B. A. in English Literature in 2003."]}, {"page": "Boston Guildhall", "response": ["In autumn 1607 a group of Puritans led by William Brewster, now known to as the Pilgrim Fathers, were brought before the magistrates in the guildhall, accused of seeking to travel to Holland without the King's permission. They were discharged by the magistrates and lived in Boston for several months before reaching Holland the following year by another route; they later sailed from Plymouth in the Mayflower for the New World in 1620."]}, {"page": "List of chairs", "response": ["* Brewster Chair, a style of upright, turned, wooden armchair made in the mid-17th century in New England named after Pilgrim and colonial leader William Brewster of Plymouth, Massachusetts"]}, {"page": "Christopher Raymond Perry", "response": ["Perry's mother was also a descendant of Governor Thomas Prence (1599–1673), a co-founder of Eastham, Massachusetts, who was a political leader in both the Plymouth and Massachusetts Bay colonies, and governor of Plymouth; and a descendant of Mayflower passengers, both of whom were signers of the Mayflower Compact, Elder William Brewster (c. 1567–1644), the Pilgrim colonist leader and spiritual elder of the Plymouth Colony, and George Soule (1593–1679), through his grandmother Susannah Barber Perry (1697–1755)."]}, {"page": "Daniel Brewster", "response": ["He was a great-grandson of Benjamin H. Brewster, an attorney and politician from New Jersey who served as United States Attorney General from 1881 to 1885 and was himself a descendant of Mayflower passenger William Brewster."]}, {"page": "List of San Francisco placename etymologies", "response": ["| Brewster Street || William Brewster || Brewster Street is one of two streets in Bernal Heights named for Pilgrim Fathers; the other is Bradford Street."]}, {"page": "William Davison (diplomat)", "response": ["In 1582–3, he was sent to Scotland by Elizabeth on missions to communicate with Mary, Queen of Scots, to escort the ambassador of King Henri III of France, and to secure an audience with King James. Tactful and helpful, Davison worked closely with the Queen's agent, Robert Bowes until September 1584. The death of the Anglophile William the Silent, Prince of Orange, necessitated yet another mission to the Netherlands for Davison, already an experienced diplomat. He was assisted by William Brewster, who was later a passenger on the Mayflower."]}, {"page": "Robert Cushman", "response": ["Beginning in September 1617, Cushman spent much of his time in England, working on preparations for the voyage to the new colonyPilgrim Village Families Sketch: Robert Cushman (a collaboration between American Ancestors and New England Historic Genealogical Society)    He, along with John Carver, became an agent of the Leiden (Leyden) Holland congregation for doing business in England.Robert E. Cushman and Franklin P. Cole, Robert Cushman of Kent (1577–1625) : Chief Agent of the Plymouth Pilgrims (1617–1625) (General Society of Mayflower Descendants: 2005), 2nd Ed. edited by Judith Swan p. 71 With Elder William Brewster in hiding, being searched for by men of James VI and I for Brewster's distribution of religious tracts criticising the king and his bishops, the Separatists looked to John Carver and Robert Cushman to carry on negotiations with officials in London regarding a voyage to America.Nathaniel Philbrick, Mayflower: A story of Courage, Community and War (New York: Viking, 2006), pp. 18–19 By June 1619 Carver and Cushman had secured a patent from the Virginia Company for the Separatists. In 1620 they were in Aldgate, London, staying at Heneage House, Duke's Place, from where they negotiated with Thomas Weston for financial backing from a group of merchants.Charles Edward Banks, 'The English Ancestry and Homes of the Pilgrim Fathers'(2006).  Carver and Cushman quarrelled with Weston, and each other, over finances, contractual terms, shipping and provisions for the journey, to the point where Carver despaired of the whole venture. ‘We have begun to build’, he said, ‘and shall not be able to make an end.’ Cushman talked of 'a flat schism' between them. After Weston had hired the Mayflower ship, Cushman and Carver, as purchasing agents for the Leiden congregation, began to secure supplies and provisions in London and Canterbury.Nathaniel Philbrick, Mayflower: A story of Courage, Community and War (New York: Viking 2006), pp. 19, 22, 42"]}]}}