{"wiki_id": "http://www.wikidata.org/entity/Q878167", "itemLabel": "John Harvey", "itemDescription": "British Army officer and lieutenant governor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Harvey_(British_Army_officer)", "wikipedia_page": {"main": "Lieutenant-General Sir John Harvey,  (23 April 1778 – 22 March 1852) was a British Army officer and a lieutenant governor.\nHe was commissioned into the 80th Foot in 1794 and served in several different locations, including France, Egypt, and India. He came to Canada in 1813 and served as a lieutenant colonel in the War of 1812, taking part in the British victories at the Battle of Stoney Creek and the Battle of Crysler's Farm in Ontario.\n\nFrom 1836 to 1837, he was the Lieutenant Governor of Prince Edward Island. From 1837 to 1841, he was the Lieutenant Governor of New Brunswick. From 1841 to 1846, he was the Civil Governor of Newfoundland. From 1846 to 1852, he was the Lieutenant Governor of Nova Scotia.", "link_mentions": [{"page": "Hannibal Hamlin", "response": ["Hamlin's political career began in 1835, when he was elected to the Maine House of Representatives. Appointed a Major on the staff of Governor John Fairfield, he served with the militia in the bloodless Aroostook War of 1839. He facilitated negotiations between Fairfield and Lieutenant Governor John Harvey of New Brunswick, which helped reduce tensions and make possible the Webster–Ashburton Treaty, which ended the war."]}, {"page": "1778", "response": ["* April 23 – John Harvey, British Army general (d. 1852)"]}, {"page": "Winfield Scott", "response": ["In late 1837, the so-called \"Patriot War\" broke out along the Canadian border as some Americans sought to support the Rebellions of 1837–1838 in Canada. Tensions further escalated due to an incident known as the Caroline affair, in which Canadian forces burned a steamboat that had been used to deliver supplies to rebel forces. President Van Buren dispatched Scott to Western New York to prevent unauthorized border crossings and prevent the outbreak of a war between the United States and the United Kingdom. Still popular in the area due to his service in the War of 1812, Scott issued public appeals, asking Americans to refrain from supporting the Canadian rebels. In late 1838, a new crisis known as the Aroostook War broke out over a dispute regarding the border between Maine and Canada, which had not been conclusively settled in previous treaties between Britain and the United States. Scott was tasked with preventing the conflict from escalating into a war. After winning the support of Governor John Fairfield and other Maine leaders, Scott negotiated a truce with John Harvey, who commanded British forces in the area."]}, {"page": "Aroostook War", "response": ["In 1835 the British rescinded their acceptance of the Dutch compromise and offered another boundary, which the Americans rejected. The United States offered to ask Maine to accept the Saint John River as the boundary, which the British rejected. In 1836 Maine took a special census. Penobscot County Census Representative Ebenezer Greeley thus began a census of the upper Aroostook River territory. Governor John Harvey of New Brunswick had Greeley arrested. Letters from New Brunswick accused the Governor of Maine of bribery and threatened military action if Maine continued to exercise jurisdiction in the basins of the Aroostook river and its tributaries. In response, Governor Robert Dunlap of Maine issued a general order announcing that a foreign power had invaded Maine. In March 1838 the state demanded a survey based on the American claim and that the federal government enforce the claim. Washington refused, but did authorize a survey for possible fortifications. The state legislature authorized $800,000 for military defense, and Congress gave the President authority to raise the militia with a $10,000,000 budget. Meanwhile, Nova Scotia voted $100,000 in funds to defend New Brunswick.", "Terming the Americans \"political prisoners,\" Sir John Harvey sent correspondence to Washington, DC, that he lacked the authority to act on the arrests without instructions from London, which he awaited. He added that he intended meanwhile to exercise his responsibilities to ensure British jurisdiction over the Aroostook, and he demanded removal from the region of all Maine forces. He then sent his military commander to the T10 R5 campsite and ordered the Maine militia to leave. Captain Rines and the others refused, stating they were following orders and doing their duty. The Maine side then took the New Brunswick military commander himself into custody.", "On 15 February 1839, the Maine Legislature authorized militia Major General Isaac Hodsdon to lead 1,000 additional volunteers to augment the posse then on the upper Aroostook River. Additional correspondence from governor Sir John Harvey of New Brunswick, reports of British Army troops arriving from the West Indies, reports of the Mohawk nation offering their services to Quebec, and reports of New Brunswick forces gathering on the Saint John River resulted in the issuance of General Order No 7 on 19 February 1839, calling for a general draft of Maine militia. Maine militia companies mustered in Bangor and traveled to the Upper Aroostook until 26 February 1839, when the early construction of Fort Fairfield, which the earlier posse built on the Aroostook River from seized stolen timber, allowed for camping troops on the eastern boundary.", "Sir John Harvey had supervised Winfield Scott during his time as prisoner of war during the War of 1812, and the President and his advisers saw that relationship as a point of mutual respect. Pursuant to the terms of the truce for administration within the disputed area, the Maine Legislature on 6 April 1839 created an armed civil posse. On advice of Brigadier General Scott, Maine issued General Orders to recall the militia in May and June 1839 and to replace the militiamen with the armed civil posse. The office of the Maine state land agent led the armed civil posse with Deputy Land Agent William Parrott at Fort Fairfield and Captain Stover Rines at Camp Jarvis on the Fish River (later Fort Kent, Maine). The United States Army began the permanent structure of Fort Fairfield in April 1839 and that of Fort Kent in October 1839.Journal and Letterbook of William Parrott Major R. M. Kirby commanded of Hancock Barracks post near Houlton, Maine, with three companies of the United States 1st Artillery Regiment. Four companies of the British 11th Regiment marched to the area from Quebec City to represent Canada with the intent to build a suitable barracks across the Saint John River from Fort Kent. New Brunswick meanwhile armed every tributary of the Saint John River that flowed from the Aroostook Territory with regular and militia soldiers."]}, {"page": "Battle of Crysler's Farm", "response": ["Boyd could not bring all his six guns into action until his infantry were already falling back. When they did open fire from the road along the river bank, they were quite effective. Morrison's second-in-command, Lieutenant Colonel John Harvey, ordered the 49th to capture them. The 49th made a charge in awkward echelon formation, suffering heavy casualties from the American guns as they struggled across several rail fences. The United States Dragoons (under Wilkinson's Adjutant General, Colonel John Walbach) now intervened, charging the exposed right flank of the 49th. The 49th halted their own advance, reformed line from echelon formation and wheeled back their right. Under heavy fire from the 49th, Pearson's detachment and Jackson's two guns, the dragoons renewed their charge twice but eventually fell back, leaving 18 killed and 12 wounded (out of 130). They had bought time for all but one of the American guns to be removed. Barnes's companies of the 2/89th overtook the 49th and captured the one gun which had become bogged down and been abandoned.Hitsman, p.191"]}, {"page": "Peterborough County", "response": ["|Harvey||||1821||Named after Sir John Harvey, Deputy Adjutant General in Canada during the War of 1812. Was part of Smith township until 1866.  First settler were retired officers who come in 1832, but did not succeed."]}, {"page": "List of lieutenant governors of Nova Scotia", "response": ["| Sir John Harvey ", "| Sir John Harvey  (continued)"]}, {"page": "List of lieutenant governors of New Brunswick", "response": ["| Sir John Harvey "]}, {"page": "1846 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1841 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1842 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1843 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1844 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1845 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1847 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1848 in Canada", "response": ["*Civil Governor of Newfoundland: John Harvey"]}, {"page": "1849 in Canada", "response": ["*Governor of Nova Scotia — Sir John Harvey"]}, {"page": "1850 in Canada", "response": ["*Governor of Nova Scotia — John Harvey"]}, {"page": "1851 in Canada", "response": ["*Governor of Nova Scotia — John Harvey"]}, {"page": "1852 in Canada", "response": ["*Governor of Nova Scotia — John Harvey"]}, {"page": "List of governors of Newfoundland and Labrador", "response": ["| Sir John Harvey "]}, {"page": "List of lieutenant governors of Prince Edward Island", "response": ["| Sir John Harvey "]}, {"page": "8th (The King's) Regiment of Foot", "response": ["While garrisoning Fort George, at Newark (present day Niagara-on-the-Lake), in May 1813 with companies of the Glengarries and Runchey's Company of Coloured Men, the 8th Foot attempted to disrupt an amphibious landing by the Americans. Although numerically inferior, the British delayed the invasion and retreated without disorder.Cannon (1844), p. 88 In June 1813, the 8th and 49th regiments assaulted an American encampment at Stoney Creek. Five companies from the two British regiments engaged more than 4,000 Americans in a nocturnal battle. Although the Americans had two brigadiers captured and suffered losses, the British commander, Colonel John Harvey, considered the possibility of his opponents realising their numerical advantage too compelling to ignore and withdrew.Cannon (1844), p. 91"]}]}}