{"wiki_id": "http://www.wikidata.org/entity/Q887927", "itemLabel": "Bob Foster", "itemDescription": "British motorcycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Foster_(motorcyclist)", "wikipedia_page": {"main": "Alfred Robert \"Bob\" Foster (16 March 1911 – 22 March 1982) was a British professional motorcycle racer. He competed professionally from 1935 to 1951 and won the 1950 FIM 350cc Grand Prix world championship.", "link_mentions": [{"page": "North West 200", "response": ["! 350 cc Bob Foster"]}, {"page": "Dutch TT", "response": ["|  Bob Foster"]}, {"page": "1949 Grand Prix motorcycle racing season", "response": ["|align=\"left\"|  Bob Foster", "|  Bob Foster"]}, {"page": "1950 Grand Prix motorcycle racing season", "response": ["|  Bob Foster", "|  Bob Foster", "|  Bob Foster", "|align=\"left\"|  Bob Foster", "|  Bob Foster"]}, {"page": "1951 Grand Prix motorcycle racing season", "response": ["|  Bob Foster"]}, {"page": "1950 Isle of Man TT", "response": ["After his win in the 1949 Isle of Man Clubman event, Geoff Duke entered the 1950 Isle of Man TT only to find himself racing against formidable opposition in his first Senior TT, not only from his experienced Norton team mates, Artie Bell, Harold Daniell and Johnny Lockett, but also Les Graham on an AJS Porcupine, Reg Armstrong and Bob Foster on Velocettes. Geoff was wearing a new set of one-piece leathers and he beat them all, breaking both lap and race records in the Senior, and finishing second in the Junior TT.  It was the beginning of a spectacular racing career for Geoff Duke. IOMTT.com Geoff Duke Isle of Man career database (retrieved 5 November 2006)"]}, {"page": "Ulster Grand Prix", "response": ["|  Bob Foster"]}, {"page": "1949 Isle of Man TT", "response": ["Fastest Lap and New Lap Record: Bob Foster Moto Guzzi – 89.75 mph (25 minutes 14 seconds) on lap 2.  Retired lap 5 at Sulby with failed clutch."]}, {"page": "New Imperial Motors", "response": ["Bob Foster won the 1936 Lightweight TT handsomely on a unit-construction model. This was the last time that Great Britain won a Lightweight TT. Despite the advanced engineering, and the spectacular TT win by Foster, sales did not improve."]}, {"page": "Blandford Camp", "response": ["On 25 July 1948, the  perimeter road around the camp was used to form the UK's first post-war road racing circuit. Around 10,000 spectators attended the first event, a motorcycle race, and the lap record was set by Bob Foster at just over .", "The next motorcycle event at the track, was billed as the Auto-Cycle Union's \"first international road race meeting on the British mainland\". Over 40,000 spectators attended, and the event on 29 April 1950 saw the debut of the latest version of the \"works\" AJS Porcupine as well as the first appearance of the Norton featherbed frame. The international nature of the event was somewhat diminished by a clash of dates with other meetings on the continent, and the only non-British competitors were two Belgians. However, top riders like Geoff Duke and Bob Foster did take part, and Duke raised the lap record to just under . Again, the event saw fatalities, with two riders killed on the very fast Engineer's Corner."]}, {"page": "1948 Isle of Man TT", "response": ["|| Bob Foster"]}, {"page": "1947 Isle of Man TT", "response": ["|| Bob Foster"]}, {"page": "1939 Isle of Man TT", "response": ["* On lap 1 of the 1939 Junior TT Race, Bob Foster riding an AJS stops at the Quarterbridge to fix broken goggles. Also, Bill Beevers and H.B.Myers both riding Velocette motor-cycles crash at the Quarterbridge on the same lap.TT Special 1939 edited by G.S.Davison TODAY’S JUNIOR page 4 Monday 12 June 1939"]}, {"page": "1936 Isle of Man TT", "response": ["The 1936 Isle of Man Tourist Trophy saw Norton rider Jimmie Guthrie win the Senior, and come fifth in the Junior. The Junior was won by Freddie Frith in his first year on the Norton team, and the Lightweight was won by Bob Foster on a New Imperial.", "The 1936 Lightweight TT Race was held after being delayed for a day because of mist and fog on the Mountain Course. The 1936 Lightweight Race proved to be closely contested by Bob Foster riding for New Imperial and Stanley Woods riding the 3 cylinder supercharged 250 cc DKW who retired on lap 7 after stopping to change a spark-plug. The 1936 Lightweight Race was won by Bob Foster at an average race speed of  from Tyrell Smith riding for Excelsior in 2nd place and A.Geiss in 3rd place riding a DKW motor-cycle.", "| 1 ||  Bob Foster || New Imperial ||  || 3.33.22.0"]}, {"page": "Levis (motorcycle)", "response": ["Levis two strokes, ridden by Geoff Davison, R. O. Clark, Phil Pike and others, won many races including the 1922 Lightweight TT, while the four strokes excelled off-road. Percy Hunt rode a 346 cc model successfully in races, and just before World War II, Bob Foster gained many wins on a Levis ohv 598 cc bike in trials and moto cross."]}, {"page": "Junior TT", "response": ["|  Bob Foster"]}, {"page": "List of Grand Prix motorcycle racers: F", "response": ["*  Bob Foster"]}, {"page": "Lightweight TT", "response": ["|  Bob Foster"]}, {"page": "1951 Isle of Man TT", "response": ["||  Bob Foster"]}, {"page": "List of people from Cheltenham", "response": ["*Bob Foster (1911–1982), professional motorcycle racer known as the Cheltenham Flyer, won the 1950 350cc world championship."]}, {"page": "Bob Foster", "response": ["Bob Foster may refer to:", "* Bob Foster (American football) (1886–1947), American football player", "* Bob Foster (American football, born 1941), American football coach", "* Bob Foster (boxer) (1938–2015), American boxer", "* Bob Foster (footballer) (born 1911), English football goalkeeper", "* Bob Foster (motorcyclist) (1911–1982), British motorcycle racer", "* Bob Foster (politician) (born 1947), former mayor of Long Beach, California"]}, {"page": "1949 Dutch TT", "response": ["|  Bob Foster"]}, {"page": "Belgian motorcycle Grand Prix", "response": ["|  Bob Foster", "|  Bob Foster"]}, {"page": "New Imperial Model 76", "response": ["In the mid-1920s New Imperial were producing 300 machines a month and continuing to expand the Great Depression of the early 1930s.  Like many manufacturers of the time, New Imperial found it very difficult to maintain sales through the 1930s and even Bob Foster’s win on a unit-construction model in the 1936 Isle of Man TT (the last time that Great Britain won a Lightweight TT) failed to lead to the much needed sales. "]}, {"page": "List of 1950 motorsport champions", "response": ["|  Bob Foster"]}, {"page": "1949 Belgian motorcycle Grand Prix", "response": ["|  Bob Foster"]}, {"page": "List of Grand Prix motorcycle racing World Riders' Champions by year", "response": ["|  Bob Foster (Velocette)"]}, {"page": "David Whitworth", "response": ["In the first post-war TT in 1947, Whitworth finished second to his teammate, Bob Foster, in the Junior TT, the best TT result of his career. He retired from the Senior TT race. In , Whitworth took part in the newly created World Championship. At both the Dutch TT and the Belgian Grand Prix, Whitworth finished fourth in the 350 cc class resulting in sixth place in the overall championship standings. Outside of the championship, Whitworth won the 350 cc race at the French Grand Prix in Saint-Gaudens."]}]}}