{"wiki_id": "http://www.wikidata.org/entity/Q887951", "itemLabel": "Bob Glendenning", "itemDescription": "English footballer and manager (1888-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Glendenning", "wikipedia_page": {"main": "Robert Glendenning (6 June 1888 – 19 November 1940) was an English professional footballer, who played as a wing half for several English clubs prior to and just after the First World War. He later went on to coach in the Netherlands, including coaching the Dutch national side.", "link_mentions": [{"page": "Dick Advocaat", "response": ["After failing to qualify to the World Cup, Advocaat stepped down following the November friendlies against Scotland and Romania. With victories in both matches, he became the most successful Netherlands manager in terms of winning, with a total number of 37 victories, a record previously held by Bob Glendenning for 77 years."]}, {"page": "1934 FIFA World Cup squads", "response": ["Head coach:  Bob Glendenning"]}, {"page": "1938 FIFA World Cup squads", "response": ["Head coach:  Bob Glendenning"]}, {"page": "Puck van Heel", "response": ["Van Heel played in the 19341934 FIFA World Cup squads and 19381938 FIFA World Cup squads FIFA World Cups under English manager Bob Glendenning."]}, {"page": "1910 FA Cup Final", "response": ["|HB || || Bob Glendenning", "|HB || || Bob Glendenning"]}, {"page": "1912 FA Cup Final", "response": ["|HB || || Bob Glendenning", "|HB || || Bob Glendenning"]}, {"page": "Netherlands national football team", "response": ["There has been thirty-five different managers who have taken the role as manager of the Netherlands national football team with their first manager being Cees van Hasselt in the first match against Belgium back in 1905. Bob Glendenning holds the record for being the longest in charge with sixteen years in charge of the national team between 1925 and 1940. He has also managed the Netherlands team the most times in history with 87 matches, twenty five more than second placed manager Dick Advocaat. Advocaat has the most wins as manager, with 37 to Glendenning's 36.", "*  Bob Glendenning 1923, 1925–1940"]}]}}