{"wiki_id": "http://www.wikidata.org/entity/Q888695", "itemLabel": "Bobby Tambling", "itemDescription": "English footballer and manager (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bobby_Tambling", "wikipedia_page": {"main": "Robert Victor Tambling (born 18 September 1941) is an English former professional footballer, who played as a forward, most notably for Chelsea, Crystal Palace and England. He was Chelsea's all-time top scorer for 47 years, with 202 goals in all competitions until Frank Lampard surpassed this total on 11 May 2013. Tambling remains Chelsea's all-time top scorer in league competition with 164 goals. After enjoying a successful career in the Football League during the 1960s and early 1970s, Tambling moved to Ireland. He subsequently played for several clubs in the League of Ireland and also represented the League of Ireland XI. After retiring as a player he continued to live in Ireland, residing in Crosshaven, County Cork.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["Lampard is Chelsea's all-time top goalscorer, having scored 211 goals in 648 games (2001–2014); he passed Bobby Tambling's longstanding record of 202 in May 2013. Eight other players have also scored over 100 goals for Chelsea: George Hilsdon (1906–1912), George Mills (1929–1939), Roy Bentley (1948–1956), Jimmy Greaves (1957–1961), Peter Osgood (1964–1974 and 1978–1979), Kerry Dixon (1983–1992), Didier Drogba (2004–2012 and 2014–2015), and Eden Hazard (2012–2019). Greaves holds the club record for the most goals scored in one season (43 in 1960–61). While a Chelsea player, Greaves also became the youngest ever player to score 100 goals in the English top-flight, at 20 years and 290 days."]}, {"page": "Peter Bonetti", "response": ["Chelsea were relegated in Bonetti's second full season, which saw the appointment of Tommy Docherty as manager. Bonetti emerged as a key figure in a talented young team which included Bobby Tambling, Terry Venables, John Hollins and Barry Bridges. The team went into the penultimate match of the season needing to beat promotion rivals Sunderland to have a chance of going up. Chelsea won 1–0, with Bonetti making a brilliant last minute save to deny George Mulhall and maintain his team's promotion chances; a 7–0 win over Portsmouth secured instant promotion back to the First Division."]}, {"page": "Crosshaven", "response": ["Notable residents have included the father of Bob Geldof, who was manager of the local Grand Hotel for a time, and Chelsea FC's all-time 2nd greatest scorer, Bobby Tambling."]}, {"page": "Football records and statistics in England", "response": ["|  Bobby Tambling"]}, {"page": "FA Youth Cup", "response": ["| Bobby Tambling"]}, {"page": "Stamford Bridge (stadium)", "response": ["* Tambling Suite (Bobby Tambling)"]}, {"page": "Frank Lampard", "response": ["In the third round of the FA Cup, Lampard entered in the second half and scored a penalty in Chelsea's victory over Southampton. On 6 January 2013, Lampard's agent Steve Kutner announced that Lampard would not be offered a new contract with Chelsea and would leave when his contract expired in June 2013.  On 12 January 2013, Lampard scored a penalty in the 4–0 win over Stoke City at the Britannia Stadium. This goal made Lampard Chelsea's second-highest goalscorer of all-time with 194 goals and moved him clear of Kerry Dixon and putting him eight goals behind Bobby Tambling in first. He scored his 199th goal for Chelsea in a 4–0 FA Cup victory over Brentford on 17 February, becoming Chelsea's all-time leading FA Cup goalscorer with 26 goals. Lampard's 200th Chelsea goal came against his former club West Ham on 17 March 2013, heading home an Eden Hazard cross.", "Lampard equalled Bobby Tambling's record with a long-range goal into the top left corner from just outside the box in the 61st minute in a league match against Aston Villa on 11 May. Then, later on in the 88th minute, he scored a second goal, breaking the record and securing a 2–1 victory for Chelsea. In the UEFA Europa League final on 15 May, Lampard captained the London club to a 2–1 victory over Benfica, securing the 11th major trophy of the Roman Abramovich era."]}, {"page": "Terry Venables", "response": ["Venables was signed by Tottenham Hotspur for a fee of £80,000, and made his debut for the club in a 1-0 win at Blackburn Rovers on May 9, 1966. He soon made his presence felt when he punched club legend Dave Mackay during training, though no long-term rift developed because of the incident. Spurs went on to have a good 1966–67 season though, finishing third in the league and beating Millwall (after a replay), Portsmouth, Bristol City, Birmingham City (after a replay) and Nottingham Forest to reach the 1967 FA Cup Final to face his former club Chelsea at Wembley Stadium. Spurs won the cup with a 2–1 victory, Jimmy Robertson and Frank Saul providing the goals before Bobby Tambling scored a late consolation goal for Chelsea. Ironically, earlier in the season Venables had bet £25 on Chelsea to win the cup at odds of 25/1, which would have paid out £500 if Spurs had lost the game, exactly the same figure as the £500 cup bonus he would receive for winning the match; in fact after tax deductions, Venables would have been better off financially if Chelsea had won."]}, {"page": "1984 in Ireland", "response": ["*Cork City F.C. founded and elected to the League of Ireland Premier Division. Former Chelsea and Cork Celtic hero Bobby Tambling was the first manager appointed."]}, {"page": "Tommy Docherty", "response": ["During his first year in charge he sold many of the club's older players and brought in new ones such as Terry Venables, Bobby Tambling, Peter Bonetti and Barry Bridges. He also changed the club's home colours, switching from white shorts to blue shorts, the combination that remains as of 2022. The team, nicknamed \"Docherty's Diamonds\", achieved promotion back to Division One in their first attempt and finished fifth the following year. In 1964–65, Chelsea won the League Cup in April with an aggregate win over Leicester City, but in the FA Cup were beaten 2–0 in the semi-final by eventual winners Liverpool."]}, {"page": "Cork City F.C.", "response": ["Following the bankruptcy of Cork United in 1982, senior football returned to the city with the formation of a new Cork City FC in 1984. Founded by officials from several Cork clubs (including Cork United and Avondale United), the new club was elected to the League of Ireland. Bobby Tambling was the first manager appointed to the club, but he was replaced by Tony 'Tucker' Allen after only 13 games.", "  from:1984 till:1984 shift:($dx) text:Bobby Tambling", "| style=\"width:70%;\"|  Bobby Tambling"]}, {"page": "Waterford F.C.", "response": ["*  Bobby Tambling", "*  Bobby Tambling"]}, {"page": "Ted Drake", "response": ["Within three years, in the 1954–55 season, Drake had led Chelsea to their first league championship triumph. In doing so, he became the first person to win the league title both as player and manager. However, Drake never came close to repeating the success. The championship-winning side was gradually broken up, to be replaced by the crop of youngsters emerging from the club's youth team, such as Jimmy Greaves, Peter Brabrook and Bobby Tambling, for whom Drake was an aloof figure. Thereafter performances and results were very erratic, leaving the club stranded in mid-table; an FA Cup loss to Fourth Division side Crewe Alexandra weakened his position at the club and a few months later, Drake was sacked early into the 1961–62 season."]}, {"page": "Ron Harris (English footballer)", "response": ["Harris was a member of the Chelsea side which won the FA Youth Cup in 1961 and made his senior club debut in February 1962 in a 1–0 win against Sheffield Wednesday. Within a year, he had established himself as a regular in the side, a position he would hold for the next eighteen years. He formed an important part of new Chelsea manager Tommy Docherty's youth-oriented re-building of the club after relegation from the First Division alongside the likes of Peter Bonetti, Peter Osgood and Bobby Tambling."]}, {"page": "Cork Celtic F.C.", "response": ["As Celtic in the 1960s they enjoyed a local rivalry with Cork Hibernians. Attendances reaches record highs in the late 1960s, with players such as Carl Davenport, the Dav, drawing crowds of up to 18,000. In 1974 with a team that included Alfie Hale and Bobby Tambling, Celtic won their only League of Ireland title under manager and former player Paul O'Donovan. Tambling, a former Chelsea player and England international had initially moved to Ireland to work as a Jehovah's Witness missionary. He scored 7 league goals in his first season as he helped Celtic win the title.", "* Bobby Tambling", "* Bobby Tambling"]}, {"page": "Kerry Dixon", "response": ["With 193 goals in total to his name, Dixon is Chelsea's third highest goal scorer of all time, behind only Bobby Tambling and Frank Lampard. He is also tenth in the club's all-time appearances list. His only honours with the club, however, were the two Second Division championship medals and the Full Members Cup."]}, {"page": "Roy Bentley", "response": ["Having scored 150 goals in 367 appearances, Bentley was Chelsea's top goalscorer and, at the time of his death in 2018, was fifth in Chelsea's all-time goalscorers list behind Bobby Tambling, Frank Lampard, Kerry Dixon and Didier Drogba."]}]}}