{"wiki_id": "http://www.wikidata.org/entity/Q888471", "itemLabel": "Bobby Brown", "itemDescription": "Scottish footballer (1923-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bobby_Brown_(footballer,_born_1923)", "wikipedia_page": {"main": "Robert Brown (19 March 1923 – 15 January 2020) was a Scottish international football player and manager. He played as a goalkeeper for Queen's Park, Rangers and Falkirk and made five international appearances for Scotland. He managed St Johnstone at club level and the Scottish national team from 1967 to 1971. Brown was inducted into the Scottish Football Hall of Fame in 2015.", "link_mentions": [{"page": "Rangers F.C.", "response": ["*  Bobby Brown – 2015 Inductee"]}, {"page": "St Johnstone F.C.", "response": ["Jimmy Crapnell became the team manager for the 1947–48 season and was succeeded by Johnny Pattillo for 1953–54. The Saints remained in the Second Division throughout the tenures of these two managers. Bobby Brown took over in the summer of 1958 and, in his second season 1959–60, the club finally won promotion again. Brown and his successor Willie Ormond both managed Scotland after leaving St Johnstone. In 1970–71, under Ormond, Saints finished third in the league and qualified for the 1971–72 UEFA Cup.", "St Johnstone has had 25 full-time managers in its history. The longest-serving manager was David Rutherford (11 years), although his tenure was interrupted by the Second World War. The club has, on average, appointed a new manager every four years. Willie Ormond and Bobby Brown both left \"Saints\" to manage the Scotland national team.", "* Bobby Brown (1958–67)"]}, {"page": "Queen's Park F.C.", "response": ["thumb|right|350px|Chart of yearly table positions of Queen's Park in the League.World War II helped Queen's stay in the top league a little longer as at the end of 1938–39 season, the club were relegated. Six seasons in the Southern League followed, and it gave youth and many new players a chance to develop at Hampden as the players of before left to serve their country. Bobby Brown was one such player who started at Queen's in 1939 but left in 1941 to serve as a pilot. When he returned at the end of the War, he found his goalkeeping position occupied by a teenage Ronnie Simpson who had made his debut at the age of 14. Although obviously a bleak time for everyone, this period gave many footballers at Queen's Park an opportunity to play at the highest level under little pressure."]}, {"page": "Scotland national football team", "response": ["Under the management of Ian McColl, Scotland enjoyed consecutive British Home Championship successes in 1962 and 1963. Jock Stein, John Prentice and Malky MacDonald all had brief spells as manager before Bobby Brown was appointed in 1967. Brown's first match as manager was against the newly crowned world champions England at Wembley Stadium. Despite being underdogs, Scotland won 3–2 thanks to goals from Denis Law, Bobby Lennox and Jim McCalliog. Having defeated the world champions on their own turf, the Scotland fans hailed their team as the \"unofficial world champions\". Despite this famous win, the Scots failed to qualify for any major competitions during the 1960s."]}]}}