{"wiki_id": "http://www.wikidata.org/entity/Q888597", "itemLabel": "Joni Fuller", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Joni_Fuller", "wikipedia_page": {"main": "Joni Amelia Fuller is an English singer/songwriter, pianist, violinist and composer from Lancashire. She is the founder of Your Strings Attached.Her debut album, Voices, recorded in October 2006, contained 12 of her original songs.\nFuller scored two successive wins in the UK's national Make it Break it Songwriting Contest (2008 and 2009) with her songs \"America\" and \"Change Girl\".", "link_mentions": [{"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" | The Polyphonic Spree, The Unthanks, Duke Special, Under the Dark Cloth, Shlomo, Kiran Ahluwalia, Zara McFarlane, Josephine Scott Matthews, King Porter Stomp, Pascuala Ilabaca y Fauna, Martyn Joseph, Grace Petrie, Marcus Bonfanti, This Is The Kit, Bert Miller and the Animal Folk, Ciaran Lavery, Tom Butler, Worry Dolls, Burning Codes, Gaz Brookfield, CoCo and the Butterfields, Digitonal, King Kool The Revolutionary Army of the Infant Jesus, Marc O'Reilly, Sam Brookes, Thea Hopkins, Folk On, Beth Goudie, Boat To Row, Ella and the Blisters, New Portals, Miriam Jones, Matt Sellors, Andrew Howie, Homegrown Collective, Rosalind Peters, Adesuwa Bullen, Danni Nicholls, Fran Smith, The Fruitful Earth, Paul Bell, Speak Brother, Steph Macleod, The Coopers, Joni Fuller, Garth Hewitt, Paul Bell, Sophronie, Oldtime Nursery, Iain Archer, Project Jam Sandwich, LewRey, KARI, Sam Lee & Friends, Broken Brass Ensemble, Pearl Fish, 7PM Soundsystem, Double-0-Denim, Heather Wall, Kimarne Henry, DJ LUMA, Moon passion Flamenco Band"]}, {"page": "Junior Eurovision Song Contest 2005", "response": ["| Joni Fuller"]}, {"page": "United Kingdom in the Junior Eurovision Song Contest", "response": ["The United Kingdom are one of the sixteen countries to have made their debut at the inaugural Junior Eurovision Song Contest 2003, which took place on 15 November 2003 at the Forum in Copenhagen, Denmark. Child-singer, Tom Morley, was the first participant to represent the United Kingdom with the song \"My Song For The World\", which finished in third place out of sixteen participating entries, achieving a score of one hundred and eighteen points. Morley and Cory Spedding () sang both for the peace in the world and Joni Fuller () described her feelings. The country's best result at the contest was placing second in 2004 with the song \"The Best is Yet to Come\". The remaining British entrant finished in fourteenth position in 2005.", "|Joni Fuller"]}, {"page": "Fuller (surname)", "response": ["*Joni Fuller, British musician"]}, {"page": "List of music artists and bands from England", "response": ["**Joni Fuller"]}, {"page": "Lytham St Annes High School", "response": ["* Joni Fuller – Singer-songwriter; awarded 'Best Female Artist' at the Exposure Music Awards 2010 and later featured as 'one to watch' by PRS for Music"]}, {"page": "Run for Cover", "response": ["*\"Run for Cover\", a 2009 EP and title song by Joni Fuller"]}, {"page": "The Gregson Centre", "response": ["* Joni Fuller"]}, {"page": "United Kingdom in the Junior Eurovision Song Contest 2005", "response": ["The United Kingdom competed at the Junior Eurovision Song Contest 2005, where they were represented by Joni Fuller with the song \"How Does It Feel\".", "| align=\"left\" |Joni Fuller", "On the night of the contest, held in Hasselt, Belgium, Joni Fuller performed 5th in the running order of the contest, following Romania and preceding Sweden. At the close of the voting Joni has received 28 points, placing 14th of the 16 competing entries, giving the United Kingdom their worst entry at the contest."]}, {"page": "Montrose Music Festival", "response": ["On Saturday and Sunday, the music moved into pubs and hotels with over 60 free-entry gigs over the two days. The event included musical acts of varying genres, performing for thousands of attendees. Among these acts were harmonica player Fraser Speirs, Scottish folk band Malinky, English Singer/songwriter Joni Fuller and Oxford-based alt-rock band Lights Action."]}, {"page": "Bollington Festival", "response": ["The music programme was aimed at all tastes: a concert version of Gershwin’s opera Porgy and Bess and two performances of Jonathan Doves’s opera Tobias and the Angel; a symphony concert; jazz with the Big Chris Barber Band, the Royal Northern College of Music Jazz Collective and Dave Mott; and folk with the New Rope String Band. The Upbeat Beatles sang with the Festival Orchestra and 17-year-old singer-songwriter Joni Fuller had a solo.", "* Joni Fuller "]}, {"page": "Søren (band)", "response": ["Stargazing and Bedtime Rituals, Søren's first two albums, are very collaborative works with more than ten musicians across the world working on them coming from different backgrounds and musical genres, from the singer-songwriter world of Joni Fuller and Mike Wyatt to the punk attitude of guitarist Matt LeFevers and the metal background of drummer Siros Vaziri.", "* Joni Fuller – violin, viola, cello (2013–2020)"]}, {"page": "Stargazing (Søren album)", "response": ["*Joni Fuller - violin, strings, percussions"]}, {"page": "List of Junior Eurovision Song Contest entries", "response": ["|align=left|Joni Fuller"]}]}}