{"wiki_id": "http://www.wikidata.org/entity/Q89188", "itemLabel": "Slobodan Jovanović", "itemDescription": "Serbian jurist, historian, sociologist, journalist, and literary critic (1869-1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Slobodan_Jovanovi%C4%87", "wikipedia_page": {"main": "Slobodan Jovanović (Serbian Cyrillic: Слободан Јовановић; 3 December 1869 – 12 December 1958) was a Serbian and Yugoslav writer, historian, lawyer, philosopher, literary critic, diplomat and politician, and one of the most prominent intellectuals of his time. He was the professor at the University of Belgrade Faculty of Law (1897—1940), Rector of the University of Belgrade (1913–14 and 1920–21), and the President of the Serbian Royal Academy (1928–1931). He took part at the Paris Peace Conference (1919) as an expert for the Yugoslav Government.Jovanović was the Deputy Prime Minister (March 1941 - June 1942) and the Prime Minister of the Royal Yugoslav government-in-exile in London between January 1942 and June 1943. After World War II, the new Communist authorities of Yugoslavia sentenced him in absentia to 20 years' imprisonment. Jovanović remained at liberty for the rest of his life in London.", "link_mentions": [{"page": "1958", "response": ["** Slobodan Jovanović, Serbian intellectual and politician (born 1869)"]}, {"page": "Šabac", "response": ["* Slobodan Jovanović, historian, lawyer, literary critic and politician"]}, {"page": "Peter II of Yugoslavia", "response": ["Simović as Prime Minister had an authoritarian manner and a disdain for politicians and was soon feuding with the rest of his cabinet, who started writing letters to Peter asking him to dismiss his overbearing prime minister. The leader of the anti-Simović group was the historian Slobodan Jovanović who served as deputy prime minister, who was widely respected as an distinguished scholar, a liberal and a Serb opposed to the more chauvinistic Serb nationalists, giving him a degree of credibility with the non-Serb ministers. Peter's own relations with Simović became strained as he found Simović to be too dominating and resented being \"lectured\" by his prime minister, who felt he had a duty to \"tutor\" the teenage king in the ways of statecraft and politics.", "The instructions given by the prime minister Slobodan Jovanović to Mihailović in January 1942 were to protect the prečani Serbs from the massacres being waged by the Ustashe, but otherwise he was not to engage in any actions that would bring down reprisals against civilians unless absolutely necessary while at the same time he was to build up his forces to engage in a general uprising when the Allies landed in the Balkans. In October 1941, Mihailović had already decided upon a policy of limiting the Chetniks to sabotage attacks and of building up his forces for an uprising when the Allies returned to the Balkans. The German policy that for every German soldier killed, 100 Serb civilians would be shot in reprisal and for every wounded German soldier, 50 Serb civilians would be shot in reprisal worked to deter Chetniks from attacking the Wehrmacht after October 1941 as Mihailović concluded that guerrilla attacks were not worth the reprisals.", "After signing the accord, King Peter and King George II of Greece spoke to the British press at a luncheon where the two kings spoke of the \"Balkan Union\" as being open to all of the states of the Balkans. On 11 January 1942, Peter dismissed his prime minister, General Dušan Simović, who proved himself to be an inept politician who was unable to get along with his cabinet, which had been threatening to all jointly resign since late 1941 if General Simović continued as prime minister. The new prime minister was Slobodan Jovanović, a widely respected historian. ", "The cabinet in a rare show of unity had all objected to Peter's plans for a wedding in wartime when the issue was first discussed in April 1942, and the issue was not raised again until April 1943. Again, when the matter was discussed in early 1943 the Serb ministers had objected while from Serbia itself General Mihailović reported that public opinion strongly disapproved. The Prime Minister, Slobodan Jovanović, was opposed to announcing the engagement while Yugoslavia was still occupied, predicting the news would discredit the monarchy in Serbia, and rather than postpone the engagement, which was announced in July 1943, Peter dismissed Jovanović on 26 June 1943."]}, {"page": "Kingdom of Yugoslavia", "response": ["* 1942–1943 – Slobodan Jovanović"]}, {"page": "List of people from Serbia", "response": ["*Slobodan Jovanović", "*Slobodan Jovanović"]}, {"page": "List of jurists", "response": ["* Slobodan Jovanović"]}, {"page": "Draža Mihailović", "response": ["Mihailović did not resume radio transmissions with the Allies before January 1942. In early 1942, the Yugoslav government-in-exile reorganized and appointed Slobodan Jovanović as prime minister, and the cabinet declared the strengthening of Mihailović's position as one of its primary goals. It also unsuccessfully sought to obtain support from both the Americans and the British. On 11 January, Mihailović was named \"Minister of the Army, Navy and Air Forces\" by the government-in-exile. The British had suspended support in late 1941 following Hudson's reports of the conflict between the Chetniks and Partisans. Mihailović, infuriated by Hudson's recommendations, denied Hudson radio access and had no contact with him through the first months of 1942. Although Mihailović was in hiding, by March the Nedić government located him, and a meeting sanctioned by the German occupation took place between him and Aćimović. According to historian Jozo Tomasevich, following this meeting, General Bader was informed that Mihailović was willing to put himself at the disposal of the Nedić government in the fight against the communists, but Bader refused his offer. In April 1942, Mihailović, still hiding in Serbia, resumed contact with British envoy Hudson, who was also able to resume his radio transmission to Allied headquarters in Cairo, using Mihailović's transmitter. In May, the British resumed sending assistance to the Chetniks, although only to a small extent, with a single airdrop on 30 March. Mihailović subsequently left for Montenegro, arriving there on 1 June. He established his headquarters there and on 10 June was formally appointed as Chief-of-Staff of the Supreme Command of the Yugoslav Army in the Fatherland. A week later he was promoted to the rank of General of the Army. The Partisans, in the meantime, insisted to the Soviets that Mihailović was a traitor and a collaborator, and should be condemned as such. The Soviets initially saw no need for it, and their propaganda kept supporting Mihailović. Eventually, on 6 July 1942, the station Radio Free Yugoslavia, located in the Comintern building in Moscow, broadcast a resolution from Yugoslav \"patriots\" in Montenegro and Bosnia labelling Mihailović a collaborator.", "The trial of Draža Mihailović opened on 10 June 1946. His co-defendants were other prominent figures of the Chetnik movement as well as members of the Yugoslav government-in-exile, such as Slobodan Jovanović, who were tried in absentia, but also members of ZBOR and of the Nedić regime. The main prosecutor was Miloš Minić, later Minister of Foreign Affairs in the Yugoslav government. The Allied airmen he had rescued in 1944 were not allowed to testify in his favour. Mihailović evaded several questions by accusing some of his subordinates of incompetence and disregard of his orders. The trial shows, according to Jozo Tomasevich, that he never had firm and full control over his local commanders. A Committee for the Fair Trial of General Mihailović was set up in the United States, but to no avail. Mihailović is quoted as saying, in his final statement, \"I wanted much; I began much; but the gale of the world carried away me and my work.\""]}, {"page": "Serbian dinar", "response": ["|Slobodan Jovanović (1869 – 1958), jurist, historian and politician"]}, {"page": "Milan I of Serbia", "response": ["Several months later, on 6 October, Prince Milan was involved in another incident, this time during a visit to Smederevo. At some point, he went to an outhouse to relieve himself and while above the pit toilet, the wooden floor caved in under his weight and he fell into the pit. As he was armed at the time, the prince began shooting from his pistol in order get the attention of his entourage who rescued him. Historical accounts of the nature of this event differ. Historian Slobodan Jovanović thinks the occurrence was \"likely coincidental\".Kralj umalo doživeo bizaran kraj;Blic, 31 October 2010 On the other hand, historian Leontije Pavlović in his book Smederevo u XIX veku (Smederevo in the Nineteenth Century) states the conspirators doused the wooden floor with nitric acid that ate away at the planks. However, these claims couldn't be confirmed as he based them on an item from the historical archives that has since disappeared. The entire episode is known as the  (double meaning: The Smederevo Furniture or the Smederevo Setup)."]}, {"page": "Anti-Fascist Council for the National Liberation of Yugoslavia", "response": ["The government-in-exile was split along an ethnic line separating the HSS from a bloc of Serb ministers drawn from several disunited parties. The divisions deepened as the HSS ministers displayed reluctance to publicly discuss and condemn Ustaše atrocities against Serbs in autumn of 1941. In January 1942, Simović was replaced by Slobodan Jovanović and his decision to support the Chetniks widened the rift with the HSS ministers. Jovanović saw Chetniks as a guerrilla force promising restoration of the monarchy after the war. In combination with fear of communism, this led him to ignore information about Chetnik collaboration with the Axis powers, and appoint their leader Draža Mihailović the Minister of the Army, Navy and Air Forces. At the same time, the government promoted Mihailović to the rank of Army General and formally renamed the Chetniks the \"Yugoslav Army in the Homeland\". In June 1943, Jovanović resigned unable to reunite the ministers, and his replacement Miloš Trifunović also resigned after less than two months of failing to resolve the same problem. In August, Božidar Purić was appointed the prime minister of a largely administrative government mostly composed of civil servants, although Mihailović retained his ministerial position."]}]}}