{"wiki_id": "http://www.wikidata.org/entity/Q893781", "itemLabel": "Boris Starling", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Boris_Starling", "wikipedia_page": {"main": "Boris Starling (born 1969) is a British novelist, screenwriter and newspaper columnist.", "link_mentions": [{"page": "Highgate Cemetery", "response": ["* Herbert Smith is shadowed through Highgate Cemetery in Visibility, a murder/espionage/thriller by Boris Starling."]}, {"page": "Great Smog of London", "response": ["The Boris Starling novel Visibility is set in the 1952 smog event.Boris Starling, London, 2007 ISBN 978-0-525-94996-1"]}, {"page": "Ernest Starling", "response": ["Two of his great-grandchildren, Boris Starling (born 1969) and Belinda Starling (1972–2006) are writers."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Boris Starling (born 1969), novelist"]}, {"page": "Messiah (British TV series)", "response": ["Messiah is a British television drama series, broadcast on the BBC One network and produced in-house by BBC Northern Ireland, although the series itself is set in England. Made up of a series of occasional serials, the first, with two parts subtitled The First Killings & The Reckoning, was broadcast in 2001. It has been followed by Messiah 2: Vengeance is Mine (2003),  Messiah III: The Promise (2004), Messiah IV: The Harrowing (2005) and most recently Messiah V: The Rapture (2008). The original production was based on a novel by Boris Starling: the subsequent instalments have been written directly for television. Starling has a cameo as a murder victim's corpse in the first serial."]}, {"page": "Department of Journalism, City University", "response": ["* Boris Starling – novelist and screenwriter"]}, {"page": "Messiah (Starling novel)", "response": ["Messiah is a thriller novel by British writer Boris Starling, published in 1999. Following the success of the novel, a sequel, Storm (2000), was also released.", "Category:Novels by Boris Starling"]}, {"page": "Frances Grey (actress)", "response": ["Frances Grey (born 1970, in Edinburgh) is a Scottish actress, perhaps most well known for her portrayal of D.S. Kate Beauchamp in the BBC television series Messiah (2001). The original production was based on a novel by Boris Starling.  Grey also starred in the subsequent installments Messiah 2: Vengeance is Mine (2003) and Messiah 3: the Promise (2004) which were written directly for television."]}, {"page": "The Escapist (2008 film)", "response": ["Much of The Escapist was shot in Dublin's Kilmainham Gaol. A scene near the end is shot in the bascule chamber beneath Tower Bridge in London; it is exactly the same location where Wyatt's brother-in-law Boris Starling set the climax of his 2006 novel Visibility. The Kingsway tramway subway also features in the film."]}, {"page": "List of people from the London Borough of Lewisham", "response": ["*Boris Starling, novelist, born and brought up in Blackheath."]}, {"page": "Starling (name)", "response": ["*Boris Starling (born 1969), English writer"]}, {"page": "Daniel Blake", "response": ["*Boris Starling (born 1969), British novelist, screenwriter and newspaper columnist"]}, {"page": "Bluffer's Guides", "response": ["*Boris Starling, author of The Bluffer's Guide to Brexit."]}, {"page": "List of people with given name Boris", "response": ["* Boris Starling, British novelist and screenwriter"]}]}}