{"wiki_id": "http://www.wikidata.org/entity/Q8944720", "itemLabel": "Mark Strickson", "itemDescription": "British actor and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Strickson", "wikipedia_page": {"main": "Mark Strickson (born 6 April 1959) is a British TV producer and actor best known for his acting role as the character of Vislor Turlough, a companion of the Fifth Doctor, on the television series Doctor Who.", "link_mentions": [{"page": "Stratford-upon-Avon", "response": ["* Mark Strickson, actor famous for playing alien Vislor Turlough on Doctor Who"]}, {"page": "1984 in film", "response": ["| A Christmas Carol || CBS / 20th Television / Entertainment Partners Ltd. || Clive Donner (director); Roger O. Hirson (screenplay); George C. Scott, Frank Finlay, David Warner, Susannah York, Edward Woodward, Roger Rees, Angela Pleasence, Michael Carter, Anthony Walters, Caroline Langrishe, Lucy Gutteridge, Nigel Davenport, Joanne Whalley, Timothy Bateson, Michael Gough, John Quarmby, Peter Woodthorpe, Liz Smith, John Sharp, Derek Francis, Brian Pettifer, Cathryn Harrison, Mark Strickson, Danny Davies, Catherine Hall || Family, Fantasy, Drama || Live action"]}, {"page": "Silurian (Doctor Who)", "response": ["In \"The Sea Devils\" (1972), an amphibious variety of Silurians are awakened from their hibernation by a renegade Time Lord known as the Master (Roger Delgado), who persuades them to reclaim the planet from the human race. Despite the Third Doctor's efforts to convince them otherwise, the Sea Devils eventually decide to go to war, forcing the Doctor to destroy their base. It is revealed, however, that there were many colonies still in hibernation around the world. The land-based Silurians and the \"Sea Devils\" next appeared, together, in \"Warriors of the Deep\" (1984), where they attempt again to reclaim Earth from the humans. Set in the year 2084 during a prolonged \"cold war\" between factions of humanity, the serial describes the Sea Devils as being elite warriors; they sport bulletproof samurai-style armour. The Fifth Doctor (Peter Davison) tries in vain to prevent any bloodshed against either species; he tells companions Tegan Jovanka (Janet Fielding) and Vislor Turlough (Mark Strickson) to give the Silurians oxygen to keep them safe from the hexachromite gas he released into the base's atmosphere. The last surviving Silurian in the episode, however, is killed by Turlough, leaving the Doctor despondent."]}, {"page": "Paradise Towers", "response": ["Julie Brennon, who played Fire Escape, was married at the time to Mark Strickson, who had been the Fifth Doctor's companion Vislor Turlough. Richard Briers – The Chief Caretaker – later appears in the Torchwood episode \"A Day in the Death\" as Henry Parker. See also Celebrity appearances in Doctor Who. Clive Merrison previously played Jim Callum in The Tomb of the Cybermen."]}, {"page": "Terminus (Doctor Who)", "response": ["Terminus is the second of three loosely connected serials where the Black Guardian (Valentine Dyall) attempts to compel the alien Vislor Turlough (Mark Strickson) to kill the Doctor. It marks the final regular appearance of Sarah Sutton as companion Nyssa."]}, {"page": "The Caves of Androzani", "response": ["While he is in his office, the character of Morgus frequently breaks the fourth wall by talking directly to camera. This arose through actor John Normington misunderstanding a stage direction.Doctor Who Magazine #279, 30 June 1999, Archive: The Caves Of Androzani by Andrew Pixley, Marvel Comics UK Ltd. Harper felt the asides effectively ramped up the dramatic tension, and decided to keep them.The Caves Of Androzani, DVD commentary The Fifth Doctor's regeneration, like the Fourth Doctor's, features a flashback of that incarnation's companions. However, for this regeneration, it was decided that special recordings of the Davison-era companions would be used instead of stock footage. This required Matthew Waterhouse, Sarah Sutton, Janet Fielding, Mark Strickson, Gerald Flood and Anthony Ainley to return in cameos for the regeneration sequence. Fielding, Strickson, Flood and Ainley were already under contract to appear in the stories of Season 21. However, special contracts had to be made for Waterhouse, who left the series in Season 19, and Sutton, who left in Season 20. Johnny Byrne, who created the character of Nyssa (in his 1981 story The Keeper of Traken) had to be paid royalties for the use of the character in the regeneration scene."]}, {"page": "Mawdryn Undead", "response": ["Mawdryn Undead is the first of three loosely connected serials where the Black Guardian (Valentine Dyall) attempts to compel the alien Vislor Turlough (Mark Strickson) to kill the Doctor, and introduces Turlough as a regular character. Nicholas Courtney is reintroduced as Brigadier Lethbridge-Stewart, who was last seen in the series in the 1975 serial Terror of the Zygons.", "David Collings, who played Mawdryn, also appeared in the Fourth Doctor serials Revenge of the Cybermen (1975) as Vorus and The Robots of Death (1977) as Poul, and would himself play an alternate Doctor in Big Finish Productions' Doctor Who Unbound audio play, Full Fathom Five. Angus MacKay previously played Borusa in The Deadly Assassin (1976). John Nathan-Turner felt that Mark Strickson's blond hair didn't stand out well enough from Peter Davison's blond hair. He initially asked Strickson to shave his head, but when Strickson declined, Turner decided that Strickson's hair should be dyed red.", "Mawdryn Undead was released on VHS in November 1992. It was released on DVD as part of the Black Guardian Trilogy on 10 August 2009 (Region 2), with a commentary by Peter Davison, Mark Strickson, Nicholas Courtney and Eric Saward and an option to view the story with new CGI effects. The serial was also released in issue 50 of the Doctor Who DVD Files, published 1 December 2010."]}, {"page": "Enlightenment (Doctor Who)", "response": ["In the serial, the alien time traveller the Fifth Doctor (Peter Davison) and his companions Tegan Jovanka (Janet Fielding) and Vislor Turlough (Mark Strickson) encounter a group of god-like immortals who are racing historical sailing vessels from Earth through space, crewed by humans they had plucked out of time, in an attempt to win the prize of enlightenment. Turlough is under the control of the Black Guardian (Valentine Dyall), but struggles with the Guardian's orders to kill the Doctor. Enlightenment is the third of three loosely connected serials where the Black Guardian attempts to compel Turlough to kill the Doctor.", "The serial began principal filming in early November 1982, with filming divided into two main blocks. The first block was shot on film at Ealing Studios between 3–5 November and consisted of the deck scenes and a number of model shots. Actor Mark Strickson was injured while filming the scene of Turlough throwing himself overboard, when the Kirby wire he was suspended from broke, leaving him only able to walk with difficulty for several weeks. The studio work was scheduled to run from 6 November until mid December and consisted of all the interior scenes and those in the TARDIS. By mid-November however the electricians union the EEPTU, had begun strike action which disrupted the filming of a number of BBC productions including Enlightenment and potentially meaning the final three serials of the season would have to be abandoned. The electricians dispute was settled by December, but it had badly affected the series recording schedule. The crew were able to shoot the following serial The King's Demons on schedule, meaning that there was only one recording block left for the part-completed Enlightenment and Eric Saward's season finale; The Return.  With some filming already completed, and its importance in concluding the Black Guardian story-arc, it was decided that Enlightenment should take precedence and so it had its second production block moved to January 1983, while The Return was abandoned.  Due to the delays, the serial only finished filming around a month before its transmission date, meaning that composer Malcolm Clarke only received the first episode for scoring a week before broadcast, having to rely on musical cues he had recorded weeks earlier without having seen any footage.", "Enlightenment was released on VHS in February 1993. It was subsequently released on DVD as part of the Black Guardian Trilogy, along with preceding stories Mawdryn Undead and Terminus on 10 August 2009. The second disc of the DVD includes a \"Special Edition\" version of the story; a movie-style edit featuring new CGI graphics throughout, with a newly recorded introduction by director Fiona Cumming.  Doctor Who Magazine was not enthusiastic about the new edit suggesting, that \"...what is special about it is up for debate.\" The reviewer disparaged the new special effects, stating that \"...this is ironic as there are few Doctor Who stories less in need of replacement effects than Enlightenment. The original model work is gorgeous, while this substitute material is crude and unsophisticated in comparison.\" Alongside the special edition, the DVD contained a number of extra features, including a Making of... documentary and extended interviews with director Fiona Cumming, writer Barbara Clegg and actor Mark Strickson, a documentary on the Guardians plus an excerpt from the Russell Harty Christmas Party TV special featuring Peter Davison. This serial was also released as part of the Doctor Who DVD Files in issue 57 on 9 March 2011."]}, {"page": "Doctor Who spin-offs", "response": ["After years of only novelisations being published, the first full-length original Doctor Who-related novels appeared in 1986 when Target launched a series of books titled The Companions of Doctor Who which were original works focusing on the Doctor's former assistants. The first two books were Turlough and the Earthlink Dilemma by Tony Attwood, published in July 1986 based upon the character played by Mark Strickson in the early 1980s and Harry Sullivan's War written by Ian Marter, who had actually played Harry Sullivan on the series a decade earlier, published in October 1986. These books sold well, but after a third attempt (a 1987 novelisation of the 1981 Doctor Who spin-off, K-9 and Company) the series ended due to rights disputes between the publishers and the BBC. Other novels would have featured Tegan, the Brigadier, Victoria and Mike Yates. Victoria eventually was the focus of the novel (and subsequent video) Downtime by Marc Platt. Yates would have appeared in The Killing Stone by actor Richard Franklin, but the novel was never published, although an abridged recording by Franklin based on the book appeared in 2002."]}, {"page": "Reeltime Pictures", "response": ["*Lust in Space (1998) – a film in which features fictionalised versions of Katy Manning, Sophie Aldred and Nicholas Briggs and asks the question \"Is Doctor Who sexist?\". It also features Nicholas Courtney and Mark Strickson as Time Judges and interviews with previous companions."]}, {"page": "Vislor Turlough", "response": ["Vislor Turlough is a fictional character played by Mark Strickson in the long-running British science fiction television series Doctor Who. He was a companion of the Fifth Doctor, being a regular in the programme from 1983 to 1984. Turlough appeared in 10 stories (33 episodes)."]}, {"page": "Wendy Padbury", "response": ["Padbury is now retired and lives in France, having previously worked as a theatrical agent. Nicholas Courtney, Colin Baker and Mark Strickson, all former Doctor Who actors, were among her clients. She discovered Matt Smith at the National Youth Theatre."]}, {"page": "List of Doctor Who audio plays by Big Finish", "response": ["Nearly all of the companions from the original series have appeared, voiced by their original actors. They include Susan (Carole Ann Ford), Ian Chesterton (William Russell), Vicki (Maureen O'Brien), Steven Taylor (Peter Purves), Sara Kingdom (Jean Marsh), Polly (Anneke Wills), Jamie McCrimmon (Frazer Hines), Victoria Waterfield (Deborah Watling), Zoe Heriot (Wendy Padbury), Jo Grant (Katy Manning), Brigadier Lethbridge-Stewart (Nicholas Courtney), Sergeant Benton (John Levene), Mike Yates (Richard Franklin), Leela (Louise Jameson), K9 (John Leeson), Romana I (Mary Tamm), Romana II (Lalla Ward), Adric (Matthew Waterhouse), Nyssa (Sarah Sutton), Tegan Jovanka (Janet Fielding), Vislor Turlough (Mark Strickson), Peri Brown (Nicola Bryant), Melanie Bush (Bonnie Langford) and Ace (Sophie Aldred). Adventures featuring revival series companions Rose Tyler (Billie Piper) and Donna Noble (Catherine Tate) have also been released."]}, {"page": "Phantasmagoria (audio drama)", "response": ["Phantasmagoria is a Big Finish Productions audio drama based on the long-running British science fiction television series Doctor Who. The story was written by Mark Gatiss and stars Peter Davison and Mark Strickson. It was recorded between 26–27 June 1999.", "*Turlough — Mark Strickson"]}, {"page": "Loups-Garoux", "response": ["*Turlough — Mark Strickson"]}, {"page": "Planet of Fire", "response": ["Peter Davison's penultimate serial as the Doctor, it marks the departure of Mark Strickson as Vislor Turlough (who makes a brief reappearance in a dream sequence at the end of Davison's final story) and introduces Nicola Bryant as Peri Brown. It is also the second and final appearance of the shapeshifting robot Kamelion, who is played at various points throughout the serial by Gerald Flood, Dallas Adams, and Ainley.", "Mark Strickson has also reprised the role of Turlough in the audio plays by Big Finish Productions and penned the introduction to the spin-off novel Turlough and the Earthlink Dilemma (1986). Promotional photographs taken during production include a shot of Peter Davison wearing a tuxedo and holding a gun, with Nicola Bryant standing next to him in a bikini, in the style of James Bond. Eleanor Bron was originally considered for the role of Sorasta.", "Planet of Fire was released on VHS in September 1998. The DVD was released in June 2010, with commentary by Peter Davison, Nicola Bryant, Mark Strickson and Fiona Cumming, as part of the box set Kamelion Tales along with The King's Demons.  It also contained a Special Edition edit of the story overseen by director Fiona Cumming. The special edition edit also included a specially filmed prequel before the opening titles. At a mere 66 minutes it is the shortest and the most edited of the special editions."]}, {"page": "Fifth Doctor", "response": ["Davison portrays the Fifth Doctor as having a vulnerable side and a tendency towards indecisiveness, dressed as a boyish Edwardian cricketer. He travelled with a host of companions, including boy genius Adric (Matthew Waterhouse), alien aristocrat Nyssa (Sarah Sutton) and Australian flight attendant Tegan Jovanka (Janet Fielding), whom he had travelled alongside in his previous incarnation. He also shared later adventures alongside devious schoolboy Vislor Turlough (Mark Strickson) and American college student Peri Brown (Nicola Bryant)."]}, {"page": "The Awakening (Doctor Who)", "response": ["The story featured extensive location shooting and studio work. Two villages are used to portray Little Hodcombe: Shapwick in Dorset and Martin in Hampshire.The Awakening, www.doctorwholocations.net Saward wanted to add a TARDIS sequence with Tegan and Kamelion, utilising the robot prop and played in chameleonic form by Peter Davison and Mark Strickson. However, this scene was cut from the transmitted episode for timing reasons. The recovery of an early edit of episode one on video (in the personal archive of late producer John Nathan-Turner) means that this element, previously thought lost, was included on the DVD release of the serial. A small part of the scene has appeared in the documentary Kamelion: Metal Man which featured on the DVD release of The King's Demons."]}, {"page": "Zagreus (audio drama)", "response": ["*Mark Strickson as Captain Neil MacDonell"]}, {"page": "A Christmas Carol (1984 film)", "response": ["* Mark Strickson – Young Ebenezer Scrooge"]}, {"page": "Singularity (audio drama)", "response": ["*Turlough — Mark Strickson"]}, {"page": "Nature documentary", "response": ["* Mark Strickson"]}, {"page": "Mark (given name)", "response": ["*Mark Strickson, English actor"]}, {"page": "List of Bergerac episodes", "response": ["| Beryl Reid, Mark Strickson, Jerome Willis, Benjamin Whitrow, Lois Baxter, Martin Fisk"]}, {"page": "List of Doctor Who novelisations", "response": ["The first two books were Turlough and the Earthlink Dilemma by Tony Attwood, based upon the character played by Mark Strickson in the early 1980s, and Harry Sullivan's War, written by Ian Marter, who had actually played Harry Sullivan on the series a decade earlier. These books sold well, but after a third attempt (a novelisation of the 1981 Doctor Who spin-off, K-9 and Company) the series ended due to rights disputes between the publishers and the BBC. Other novels would have featured Tegan, the Brigadier, Victoria and Mike Yates."]}, {"page": "New Zealand National Science Fiction Convention", "response": ["| Jon Pertwee, Mark Strickson", "| Mark Strickson, Phillip Mann, The Wizard of Christchurch"]}, {"page": "Armageddon (convention)", "response": ["*Peter Davison (Doctor Who), Michael Hurst (Hercules), Kevin Sorbo (Hercules/Andromeda/Meet the Spartans), Michael Winslow (Police Academy), Mark Strickson, (Doctor Who – Turlough), Jonny Fairplay (Survivor/Fear Factor/TNA), Sam J. Jones (Flash Gordon), Michelle Deighton (America's Next Top Model), ", "*TV movies Peter Davison (Doctor Who), Michael Hurst (Hercules), Kevin Sorbo (Hercules/Andromeda/Meet the Spartans), Michael Winslow (Police Academy), Mark Strickson, (Doctor Who – Turlough), Jonny Fairplay (Survivor/Fear Factor/TNA), Sam J. Jones (Flash Gordon), Michelle Deighton (America's Next Top Model), ", "*Acting Guests: Colin Baker, Nicola Bryant, Mark Strickson, Mark Hadlow, John Callen.", "Guests included, Animation Guest: Steve Blum. Acting Guests: Colin Baker, Nicola Bryant, Mark Strickson, Mark Hadlow, John Callen."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Mark Strickson (Acting Diploma 1979)"]}, {"page": "Doctor Who in Australia", "response": ["More visibly, many Australians – or Britons with some connection to Australia – have appeared on-screen in Doctor Who. The 1963 serial The Daleks featured several Australian actors: John Lee played Alydon, while Robert Jewell and Kevin Manser made their first contributions as Dalek operators, roles they revisited numerous times throughout the 1960s.  Ilona Rodgers played Carol in the 1964 serial The Sensorites - Rodgers relocated to Australia in the late-1970s, then to New Zealand in the mid-1980s. Australian actor Ray Barrett played Bennett/Koquillion in the 1965 serial The Rescue. Australian actor David Nettheim and the South African-born Australian actor Bill Kerr both portrayed Australian characters in the 1967 serial The Enemy of the World. New Zealand-born actress Louise Pajo played Gia Kelly in the 1969 serial \"The Seeds of Death\" - Pajo completed her training in the UK before relocating to Australia during the 1970s. Katy Manning played companion Jo Grant 1971–73 and later lived in Australia for many years, becoming an Australian citizen and the patron of the Doctor Who Club of Australia. Australian actor Kevin Lindsay played Cho-Je in Planet of the Spiders, as well as various Sontarans in both The Time Warrior and The Sontaran Experiment. Australian actress Janet Fielding played companion Tegan 1981–84, while Fielding's contemporary Mark Strickson played companion Turlough 1983–84 - Strickson lived in Australia for many years before settling in New Zealand. British actress Liza Goddard played Kari in the 1983 serial Terminus - Goddard moved to Australia with her family in 1965 after her father's appointment as the ABC's Head of Drama and later starred in the first two seasons of Skippy the Bush Kangaroo, before returning to the UK in 1969. Australian singer and actress Kylie Minogue played Astrid Peth in the 2007 Christmas special Voyage of the Damned and Australian actor Peter O'Brien played Ed Gold in the 2009 special The Waters of Mars.", "From 1979, there were \"parties\" held multiple times most years, but conventions were seen as too expensive to risk until 1988's \"Console 88\" event, featuring Katy Manning, Mark Strickson, Julie Brennan and other guests who could be sourced locally, then in 1990, when Nicholas Courtney best known for his role as the Brigadier was flown out to be the main guest at the first \"Whovention\"."]}, {"page": "Steve Irwin", "response": ["In 1998, Irwin continued his television career, working with director Mark Strickson to present The Ten Deadliest Snakes in the World.\"The Ten Deadliest Snakes in the World with Steve Irwin (1998)\" , Wild Film History. Retrieved 5 February 2011. He appeared on several episodes of The Tonight Show with Jay Leno.\"Steve Irwin, Wildlife Master, Is Killed by a Stingray at 44\" by Glenn Collins , The New York Times, 5 September 2006: \"... he was an ebullient staple of American talk shows ranging from The Tonight Show With Jay Leno to Live With Regis and Kelly.\"\"Steve Irwin, Bob Irwin, Murray the Crocodile, & The Snake Faux Pas\", Diana L. Guerrero, Ark Animals. Retrieved 5 February 2011: \"I met Steve Irwin and Terri Irwin on the set of the Tonight Show with Jay Leno.\" A 2000 FedEx commercial with Irwin lightheartedly dealt with the possibility of occupational death from snakebite and the fanciful notion that FedEx would have saved him, if only FedEx were used."]}, {"page": "Companion (Doctor Who)", "response": ["| Mark Strickson "]}, {"page": "List of Doctor Who cast members", "response": ["Peter Davison starred as the Fifth Doctor starting in the nineteenth season alongside Matthew Waterhouse, Sarah Sutton and Janet Fielding, before Waterhouse departed when Adric was dramatically killed off in Earthshock. In Mawdryn Undead, a new companion called Vislor Turlough was introduced, played by Mark Strickson. Sutton stepped down from the role of Nyssa in Terminus and Kamelion, an unusual robotic character voiced by Gerald Flood, was introduced in The King's Demons.", "| Mark Strickson || colspan=\"2\" | Vislor Turlough ||  || colspan=\"3\"  || colspan=\"6\"  "]}, {"page": "List of Bergerac cast members", "response": ["*Mark Strickson"]}, {"page": "Creation Entertainment", "response": ["From 1984–1986, Creation produced regular conventions dedicated to Doctor Who and other science fiction shows and movies. in 1984, Creation produced Doctor Who-focused conventions in Philadelphia (February 11–12, June 9–10, and Nov. 3–4), Rochester (May 26–28), San Francisco (June 2–3 and Oct. 6–7), Washington, D.C., (June 16–17), Boston (June 22–23, July 14–15, and Oct. 6–7), Detroit (June 30–July 1), Denver (July 7–8), Chicago (July 21–22 and Sept. 29–30), New Orleans (Sept. 22–23), Atlanta (Oct. 13–14), and St. Louis (Oct. 20–21). In 1985, Creation held Doctor Who-themed conventions in Boston (Jan. 12–13 and Aug. 24–25), San Francisco (Jan. 26–27, June 8–9, and Oct. 26–27), Philadelphia (Feb. 9–10, August 10–11, and November 9–10), New York City (March 16–17 and July 27–28), Rochester (March 23–24), Chicago (April 27–28 and Sept. 7–8), Los Angeles (May 25–27), and Tampa (June 29–30). In 1986, Creation held Doctor Who-themed shows in Chicago (Jan. 11–12), Washington (Jan. 18–19), Boston (Jan. 25–26 and July 12–13), San Francisco (Feb. 1–2), New York City (February 22–23 and May 10–11), Oakland (March 8–9), Orlando (March 22–23), and Trenton (March 23). Frequent guests of the Creation Entertainment Doctor Who conventions included Patrick Troughton, Nicholas Courtney, Mark Strickson, Matthew Waterhouse, Mary Tamm, Elisabeth Sladen, and Terrance Dicks."]}, {"page": "Visions (convention)", "response": ["| Tom Baker, David Banks, Jeremy Bentham, Richard Carpenter, Robin Curtis, Paul Darrow, John Freeman, Mike Grell, David Jackson, Sally Knyvette, John Levene, Steven Pacey, John Peel, Frederik Pohl, Mark Ryan, Mark Strickson, Mary Tamm, Deborah Watling, Timothy Zahn", "| Geoffrey Beevers, Nigel Bennett, Nicholas Brendon, Robin Atkin Downes, Erin Gray, Anthony Stewart Head,Did not appear.  Louise Jameson, Caroline John, Sylvester McCoy, Tracy Scoggins, Kent McCord, Mark Strickson, John Platt, Beth Falcone, Dennison Love, Paul Simpson"]}, {"page": "Advanced Warriors", "response": ["*Mark Strickson as Guardian Force"]}]}}