{"wiki_id": "http://www.wikidata.org/entity/Q895929", "itemLabel": "Boyd Neel", "itemDescription": "British conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Boyd_Neel", "wikipedia_page": {"main": "Louis Boyd Neel O.C. (19 July 1905 – 30 September 1981) was an English, and later Canadian conductor and academic.  He was Dean of the Royal Conservatory of Music at the University of Toronto. Neel founded and conducted chamber orchestras, and contributed to the revival of interest in baroque music and in the 19th and 20th Century string orchestra repertoire.", "link_mentions": [{"page": "Benjamin Britten", "response": ["In May 1943 Britten made his debut in the Decca studios, accompanying Sophie Wyss in five of his arrangements of French folk songs. The following January he and Pears recorded together, in Britten's arrangements of British folk songs, and the following day, in duet with Curzon he recorded his Introduction and Rondo alla burlesca and Mazurka elegiaca. In May 1944 he conducted the Boyd Neel string orchestra, Dennis Brain and Pears in the first recording of the Serenade for Tenor, Horn and Strings, which has frequently been reissued, most recently on CD."]}, {"page": "Gabriel Fauré", "response": ["By the 1940s there were a few more Fauré works in the catalogues. A survey by John Culshaw in December 1945 singled out recordings of piano works played by Kathleen Long (including the Nocturne No. 6, Barcarolle No. 2, the Thème et Variations, Op. 73, and the Ballade Op. 19 in its orchestral version conducted by Boyd Neel), the Requiem conducted by Ernest Bourmauck, and seven songs sung by Maggie Teyte.Culshaw, John. \"The Return of Fauré\", The Gramophone, December 1945, p. 15 Fauré's music began to appear more frequently in the record companies' releases in the 1950s. The Record Guide, 1955, listed the Piano Quartet No. 1, Piano Quintet No. 2, the String Quartet, both Violin Sonatas, the Cello Sonata No. 2, two new recordings of the Requiem, and the complete song cycles La bonne chanson and La chanson d'Ève.Sackville-West, pp. 265–268"]}, {"page": "Peter Pears", "response": ["In early 1943 Pears joined Sadler's Wells Opera Company. His roles included Tamino in The Magic Flute, Rodolfo in La bohème, the Duke in Rigoletto, Alfredo in La traviata, Almaviva in The Barber of Seville, Ferrando in Così fan tutte and Vašek in The Bartered Bride.Headington, p. 124 His growing operatic experience and expertise affected the composition of Britten's opera Peter Grimes. The composer had envisaged the central figure, based on Crabbe's brutal fisherman, as a villainous baritone, but he began to rethink the character as \"neither a hero nor a villain\" and not a baritone but a tenor, written to fit Pears's voice. In January 1944 Britten and Pears began a long association with the Decca Record Company, recording four of Britten's folk song arrangements. In May of the same year, with Dennis Brain and the Boyd Neel Orchestra, they recorded the Serenade."]}, {"page": "Decca Records", "response": ["In classical music, Decca had a long way to go from its modest beginnings to catch up with the established HMV and Columbia labels (later merged as EMI). The pre-war classical repertoire on Decca was not extensive, but was select. The 3-disc 1929 recording of Delius's Sea Drift, arising from the Delius Festival that year, suffered by being crammed onto six sides, being indifferently recorded and expensive; following issue in July they were already withdrawn by October the same year.Decca monthly record supplements However, it won Decca the loyalty of the baritone Roy Henderson, who went on to record for them the first complete Dido and Aeneas of Purcell with Nancy Evans and the Boyd Neel ensemble (Purcell Club, 14 sides, issued February 1936); and Henderson's famous pupil Kathleen Ferrier was recorded and issued by Decca through the period of transition from 78 to LP (1946–1952). Heinrich Schlusnus made important pre-war lieder recordings for Decca."]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["By 1944, the wartime orchestra numbered only 62 musicians, all of whom were part-time and most of whom were employees of local munitions factories. Weekly concerts took place after only a single rehearsal and different players often performed from concert to concert. In an attempt to provide some stability the committee introduced permanent year-round contracts for musicians from May 1944, funded by the city council's education committee in return for 50 days of educational work from the orchestra per year. Boyd Neel was initially favoured to replace Heward as Principal Conductor after 12 different applicants were given trial concerts over the summer of 1943, but the orchestra eventually announced the appointment on a one-year contract of George Weldon, the conductor of the City of Birmingham Choir. Weldon was flamboyant and charismatic with a love of fast cars and he cut a glamorous figure on the podium. Initial critical and public reaction was very positive and in June 1944 he was confirmed as Music Director. He broadened the orchestra's reach by introducing modestly-priced summer seasons of promenade concerts from 1945, and from 1950 introduced industrial concerts aimed at the city's manufacturing workforce, alongside annual seasons in Wolverhampton, Nottingham and Sheffield. In January 1948 the orchestra was officially renamed the City of Birmingham Symphony Orchestra at Weldon's personal request."]}, {"page": "1951 in music", "response": ["| Sainton, Philip || Serenade Fantastique for oboe and strings || 1951-07-08 ||  Cheltenham (Festival) || Goosens / Boyd Neel Orchestra – NeelPaul Hamburger, \"Cheltenham Festival\". The Music Review 12 (1951): 317–19. Citation on 317 and 319.Anon., \"Cheltenham Festival: Three Serenades\", Times (9 July 1951): 2.", "| Stevens, Bernard || Sinfonietta || 1951-07-06 ||  Cheltenham (Festival) || [unknown oboist] / Boyd Neel Orchestra – Barbirolli"]}, {"page": "1937 in music", "response": ["| Britten, Benjamin || Variations on a Theme by Frank Bridge || 1937-08-27 ||  Salzburg (Festival) || Boyd Neel Orchestra – NeelIRCAM"]}, {"page": "1940 in music", "response": ["*January 30 – Soprano Sophie Wyss gives the first complete performance of Benjamin Britten's Les Illuminations, with Boyd Neel conducting his Orchestra at the Wigmore Hall, London.Mitchell, Donald (ed) (1991). Letters From A Life: Selected Letters of Benjamin Britten, Vol. 2 1939–45. London: Faber and Faber. . pp. 628, 657"]}, {"page": "Roy Henderson (baritone)", "response": ["He recorded the first complete Purcell Dido and Aeneas with Nancy Evans and the Boyd Neel ensemble conducted by Clarence Raybould before 1936.Also with Mary Hamlin, Mary Jarred and Dr Sydney Northcote, with Bernhard Ord (continuo), Charles Kennedy Scott's A Capella singers, and directed by Hubert J. Foss, Decca, for the Purcell Club by subscription, X 101-107 (14 sides)). cf. Darrell 1936, 371. In 1938, Henderson was one of the original 16 soloists in Vaughan Williams's Serenade to Music (his is the solo line to the words 'Nor is not moved with concord of sweet sounds'). In March 1940, he was involved in the Glyndebourne Company revival of The Beggar's Opera, directed by John Gielgud, at the Haymarket Theatre in London.", "Henderson became a Professor at the Royal Academy of Music in 1940. He first met Kathleen Ferrier when both sang in a performance of Elijah at Runcorn on 23 December 1942.Henderson 1954. A few weeks later, she came to him at the Royal Academy asking for lessons. (Dr Hutchinson of Newcastle upon Tyne had previously taught her.) Their relationship as pupil and teacher lasted for seven years. He began her coaching in Bach, Handel and Brahms, and steered her away from Verdi. He prepared her for her first The Dream of Gerontius in Leeds in November 1944 (insisting that she sing it from memory), and in that year they had also studied the Four Serious Songs of Brahms. He sent her to Professor Carl Ebert (producer of the pre-war Glyndebourne Mozart), on his return to Glyndebourne after the war, and to Hans Oppenheim when she was preparing lieder recitals with Bruno Walter. Walter thoroughly introduced her to the work of Mahler. Henderson is the conductor of the recording of the Pergolesi Stabat Mater with Ferrier and Joan Taylor, the Nottingham Oriana Choir and the Boyd Neel String Orchestra (Decca AK 1517–1521). He wrote an account of his teaching of Kathleen Ferrier in the memoir edited by Neville Cardus. He was also the teacher of Hervey Alan, Jennifer Vyvyan, Norma Procter and Rae Woodland."]}, {"page": "Gareth Morris", "response": ["Gareth Charles Walter Morris (13 May 192014 February 2007) was a British flautist.  He was the principal flautist of a number of London orchestras including the Boyd Neel Orchestra before joining the Philharmonia Orchestra.  He was the principal flautist of this orchestra for 24 years and Professor of the Flute at the Royal Academy of Music from 1945 to 1985. Morris was known for using a wooden flute, at a time when most other players had switched to using metal flutes."]}, {"page": "Aeolian Quartet", "response": ["Emanuel Hurwitz (leader) won a scholarship to the Royal Academy of Music in a contest adjudicated by Bronislaw Huberman. In 1937 he was a member of the Scottish National Orchestra under Georg Szell, and in 1938 joined the London Philharmonic under Thomas Beecham. After the war he formed the Hurwitz string quartet, and led the small orchestra in the Glyndebourne premiere of Britten's The Rape of Lucretia. He was sub-leader of the Boyd Neel orchestra under Maurice Clare, and during the 1950s and 1960s leader of the Melos Ensemble and of the English Chamber Orchestra, which he led to international recognition. In 1965 he won the Worshipful Company of Musicians' Gold Medal for services to chamber music. He was guest leader for two seasons of the New Philharmonia Orchestra working with Carlo Maria Giulini and Otto Klemperer. He became leader of the Aeolian Quartet in 1970.Argo HDNV 82-84 insert 1977, p. 5.", "Raymond Keenlyside (the father of the baritone Simon Keenlyside) was also a leader of the Boyd Neel and English Chamber Orchestras. He studied at the Trinity College of Music, London, and later taught and became a professor there. he was professionally associated with string quartet playing from his college days. Margaret Major studied at the Royal College of Music and won the Lionel Tertis Viola Competition there.See Editorial, The Gramophone Magazine 1973, monthly issue coinciding with 75th anniversary of The Gramophone Company, announcing commencement of Aeolian Haydn Decca issue.: Margaret Major, after winning the Lionel Tertis Competition at the RCM, was principal violin of the Netherlands Chamber Orchestra... She then won the IMA concert award, leading to concerts in London, Paris and Geneva. From 1956-1960 she was principal viola for the Netherlands Chamber Orchestra, and then returned as principal viola of the Philo-musica of London. She was a noted soloist, and became the third wife of the cellist Derek Simpson. She became Professor at the Royal College of Music. Derek Simpson was first holder of the Suggia Scholarship at the Royal Academy of Music, and continued his studies in Paris. Returning to England he won the Queen's Prize and the Moulton-Meyer Award and soon afterwards made his debut in London recital. He was Professor at the Royal Academy of Music.Argo HDNV 82-84 insert 1977."]}, {"page": "Glyndebourne", "response": ["After extensive rehearsals, the first six-week season opened on 28 May 1934 with a performance of Le nozze di Figaro followed by Così fan tutte.  Boyd Neel had conducted the first music heard in the renovated Glyndebourne opera house in 1934, in private performances, at John Christie's invitation.The Gramophone, July 1972, p. 178"]}, {"page": "Neville Marriner", "response": ["Marriner was briefly a music teacher at Eton College. In 1948, he became a professor of the Royal College of Music. In 1948 or 1949, he took up the position of second violinist of the Martin String Quartet, continuing to play with the quartet for 13 years. He had met the harpsichordist Thurston Dart while recuperating from kidney damage during the war, and they formed a duo together, which expanded to the Virtuoso String Trio with Peter Gibbs. These were the precursors to Dart's Jacobean Ensemble, in which Marriner played from 1951. He played the violin in two London orchestras: the Philharmonia Orchestra in the early 1950s, and the London Symphony Orchestra (LSO) as principal second violin (1954–69). He also played with the chamber orchestras of Reginald Jacques and Boyd Neel, as well as the London Mozart Players."]}, {"page": "Salzburg Festival", "response": ["During the years from 1934 to 1937 famed conductors such as Arturo Toscanini and Bruno Walter conducted many performances. In 1936, the festival featured a performance by the Trapp Family Singers, whose story was later dramatized as the musical and film The Sound of Music (featuring a scene of the Trapp Family singing at the Felsenreitschule, but inaccurately set in 1938). In 1937, Boyd Neel and his orchestra premiered Benjamin Britten’s Variations on a Theme of Frank Bridge at the festival.The Gramophone, June 1972, p. 178"]}, {"page": "The Royal Conservatory of Music", "response": ["*Boyd Neel, dean of the conservatory, 1953–1971"]}, {"page": "Dies Natalis (cantata)", "response": ["The first recording of Dies Natalis, sponsored by the British Council, was one of only two recordings of Finzi's music made in his lifetime. Two of the three sessions took place in October 1946, and the third on 29 January 1947.McVeagh, Diana. Gerald Finzi: His Life and Music. Boydell Press, 2005: p. 150 For Finzi it was an unfortunate experience: the soprano soloist was Joan Cross, whom he disliked for being an opera singer, and for her close connection to Benjamin Britten, whose work he disliked.Finzi confessed he was \"allergic\" to Britten's works, which he found \"derelict & dead\": see Diana McVeagh. Gerald Finzi: His Life and Music. Boydell Press, 2005: p. 145 The conductor Boyd Neel was ill for one of the three sessions, and Finzi had to take over. His biographer, Diana McVeagh, suggests it may have been for the \"Rhapsody\", which was recorded on a particularly cold day - the coldest day in 50 years - and Joan Cross said afterwards, \"I don't think I did justice to that piece, alas!\".", "* Decca AK 1645-7 (rec. 1946-47): Joan Cross; Boyd Neel Orchestra; Boyd Neel, conductor"]}, {"page": "Neel", "response": ["* Boyd Neel (1905–1981), English conductor and academic"]}, {"page": "Fantasia on a Theme by Thomas Tallis", "response": ["Although the BBC first broadcast the Fantasia in 1926, and again over the following decade, conducted by the composer and Arturo Toscanini,\"Vaughan Williams Fantasia Thomas Tallis\", BBC Genome. Retrieved 24 December 2020 it was not until 1936 that the work was recorded for the gramophone. The fledgling Decca company recorded it with Boyd Neel conducting his orchestra under the supervision of the composer in January 1936,Stuart, Philip. Decca Classical, 1929–2009, AHRC Research Centre for the History and Analysis of Recorded Music. Retrieved 5 September 2014 a set described by The Gramophone as one of the outstanding records of the year.\"Some records of the year\", The Gramophone, December 1936, p. 279 Since then there have been more than fifty recordings by orchestras and conductors from various countries.", "| Boyd Neel Orchestra", "| Boyd Neel"]}, {"page": "Gordon Jacob", "response": ["In the 1930s Jacob, along with several other young composers, wrote for the Sadler's Wells Ballet Company (now The Royal Ballet). His one original ballet (other than a student work, The Jew in the Bush (1928)),\"Royal College of Music\", The Times, 13 March 1928, p. 14 was Uncle Remus (1934), written for them. During the Second World War, Jacob wrote music for several propaganda films, and after the war he provided the score for the feature film Esther Waters (1948).\"Gordon Jacob\", British Film Institute. Retrieved 2 November 2018 A more personal take on the war is evident in the austere Symphony for Strings (1943), written for the Boyd Neel Orchestra.'British Music for Strings, Volume 1', CPO 555 382-2 (2020), reviewed by MusicWeb International"]}, {"page": "List of Decca Records artists", "response": ["* Boyd Neel", "* Boyd Neel String Orchestra"]}, {"page": "D'Oyly Carte Opera Company", "response": ["The Savoy also hosted London seasons for the company in 1930–31, 1933, 1941, 1951, 1954, 1961, 1963–64, and 1975. London seasons at other theatres, mostly Sadler's Wells, included summer seasons from 1935 to 1939, 1942, 1947 to 1950, 1953, 1971, 1975, 1977 and 1980; and winter seasons in 1956–57, 1958–59, 1960–61, 1963–64, 1965–66, 1967–68, and then every winter between 1969–70 and 1981–82.In addition to the Savoy and Sadler's Wells, London seasons were at the Prince's Theatre (1956–57, 1958–59, and 1960–61); the Saville Theatre (1963–64, 1965–66 and 1967–68); the Royal Festival Hall (1971 and 1975); and the Adelphi Theatre, 1981–82). See Rollins and Witts, pp. 180–186 and supplements. The company continued to tour the British provinces and abroad when it was not in London, and these tours also often included London suburbs.Rollins and Witts, pp. 154–182 The company's musical director from 1929 (having been assistant musical director from 1925) was Isidore Godfrey, who retained the position until 1968 and guest conducted the company in 1975, as part of the centenary season at the Savoy Theatre. Guest conductors during Godfrey's tenure were Sargent and Boyd Neel. Henry Lytton retired in 1934 after a quarter century as the principal comedian, and the company made a highly successful eight-month North American tour with its new principal comedian, Martyn Green. In 1938 many company members participated in the Technicolor film of The Mikado produced and conducted by Geoffrey Toye.Wilson and Lloyd, p. 128"]}, {"page": "In the South (Alassio)", "response": ["| Boyd Neel"]}, {"page": "Joyce Hatto", "response": ["Joyce Hatto was born in St John's Wood, London. Her father was an antiques dealer and piano enthusiast.The Guardian obituary, 10 July 2006. Retrieved 24 December 2012 As a promising young professional, she played at a large number of concerts in London, and throughout Britain and Europe, beginning in the 1950s. There were concertos in which she was accompanied by the Boyd Neel, Haydn and London Symphony Orchestras, and many others; solo recitals at the Wigmore Hall, the Queen Elizabeth Hall and elsewhere; and concerts by \"pupils of Joyce Hatto\"Groups.google.com, \"The real Hatto\" (makropulos) in the late 1960s and early 1970s. She supplemented her earnings with work as a répétiteur for the London Philharmonic Choir under such conductors as Thomas Beecham and Victor de Sabata, and as a piano teacher, both privately and at schools including Crofton Grange, a girls' boarding school in Hertfordshire.Report on Front Row, BBC Radio 4, 6 April 2007 She was also active in the recording studios for several companies such as Saga Records in England, as well as others in Hamburg and Paris."]}, {"page": "Isidore Godfrey", "response": ["Isidore Godfrey OBE (27 September 1900 – 12 September 1977), born Israel Gotfryd, was musical director of the D'Oyly Carte Opera Company for 39 years, from 1929 to 1968. He conducted most of the company's performances during that period, except for a few London seasons when Malcolm Sargent was guest conductor and brief periods in the summers of 1947 and 1948 when Boyd Neel filled in as guest conductor.", "Godfrey conducted most of the company's performances during his four decades as musical director, except for a few London seasons, when Malcolm Sargent was guest conductor, and brief periods in the summers of 1947 and 1948, when Boyd Neel was guest conductor. Godfrey's assistant musical directors included Alan E. Ward (1930–49), William Cox-Ife (1951–61) and James Walker (1961–68).Rollins and Witts, Appendix pp. II-VI During Godfrey's long reign as musical director, he conducted artists who had worked under the direction of W. S. Gilbert, such as Henry Lytton, Leo Sheffield and Sydney Granville, and those who were performing at the last night of the D'Oyly Carte Opera Company in 1982, such as John Reed and Kenneth Sandford.Rollins and Witts, pp. 152–53Wilson and Lloyd, p. 213 In his early years in charge, Godfrey, with Rupert D'Oyly Carte's backing, gradually cut down the number of encores routinely given at the company's performances.Joseph, p. 222 The stars and the audiences both resisted, but Godfrey eventually made progress, particularly after the outbreak of World War II, when it was important to keep running times down to a reasonable length.Joseph, p. 258"]}, {"page": "The Boyd Neel Orchestra", "response": ["#REDIRECT Boyd Neel"]}, {"page": "Louis Boyd Neel", "response": ["#REDIRECT Boyd Neel "]}, {"page": "Boyd Neel Orchestra", "response": ["#redirect Boyd Neel"]}, {"page": "Edward Lewis (Decca)", "response": ["At this point, Decca was primarily a popular music label. Lewis secured new artists for the label, including Gertrude Lawrence and Jack Hylton, and Decca took over the UK manufacture and distribution of the American Brunswick Records, which brought leading popular American artists, such as Bing Crosby and Al Jolson, to the Decca group. On the classical side, Decca issued some Handel Concerti Grossi, conducted by Ernest Ansermet, as early as December 1929, but most of its classical releases came from the Polydor catalogue, to which Lewis had acquired the British rights for Decca. By the mid-1930s, Decca was enlarging its domestic classical catalogue with artists such as Sir Henry Wood, Clifford Curzon, Sir Hamilton Harty and Boyd Neel. Despite Lewis's financial skill, and rigorous economies throughout the company, Decca's survival remained at risk until 1934, when the company began to make inroads into the profitable American market. When World War II broke out in 1939, Lewis sold his interest in Decca's American subsidiary."]}, {"page": "Frederick Grinke", "response": ["===Boyd Neel Orchestra===", "In 1937 he became concertmaster of the Boyd Neel Orchestra. His first performance with them was Salzburg Festival in 1937, giving the premiere of Variations on a Theme of Frank Bridge By Benjamin Britten. He began teaching as Professor at the Royal Academy in 1939. Included among his pupils, were many who went on to become leading British artists (including Sydney Humphreys (of the Aeolian Quartet), Clarence Myerscough and Rosemary Rapaport).", "He remained concertmaster for the Boyd Neel Orchestra until 1947, performing in Europe, USA, Australia and New Zealand (In 1947), and at the London Proms, Salzburg and the Edinburgh Festival. He resigned from it to pursue his solo career.", "Ralph Vaughan Williams dedicated his Sonata in A minor, written in 1952, to Grinke, who recorded the composer's Concerto Accademico in D minor, and The Lark Ascending, with the Boyd Neel Orchestra. Grinke and David Martin (also a Canadian violinist) performed J.S. Bach's Concerto for two violins at Vaughan Williams's funeral. He made a broadcast of the Arnold Bax concerto from Australia.", "Among other recordings from the 1940s were nos 3 and 9 from the 1697 set of 10 Sonatas by Henry Purcell, with Jean Pougnet and Boris Ord, and that composer's sonata in G minor with Arnold Goldsbrough. He is heard with Kendall Taylor in the Dvořák G major Sonatina op 100, and with Watson Forbes (violist of the Stratton Quartet and Aeolian Quartet) in Mozart duos. He also premiered and recorded works by Arthur Benjamin, Benjamin Dale, Lennox Berkeley, Kenneth Leighton, Edmund Rubbra, York Bowen, Howard Ferguson, Arthur Bliss, Béla Bartók, Beethoven, Handel, Rachmaninoff and Smetana, often accompanied by Ivor Newton. He recorded a complete Brandenburg Concertos with the Boyd Neel."]}, {"page": "Harold Byrns", "response": ["He was born Hans Bernstein in Hanover, Germany in 1903.  His father had formed a chamber music society in Hanover, and he followed in his father's footsteps.Central Opera Service Bulletin  He studied with Walter Gieseking, Erich Kleiber and Leo Blech at the Stern Conservatory in Berlin, and became assistant to Kleiber and Blech. He worked as a conductor in Lübeck, Oldenburg, and Berlin (Staatsoper, Deutsche Oper) before emigrating to Italy in 1933 and then to the United States in 1936. He changed his name from Hans Bernstein to Harold Byrns because he felt he could not make it in America with a Jewish name. He formed his own chamber orchestra, the Harold Byrns Chamber Orchestra, which was regarded as the American counterpart of the Boyd Neel String Orchestra.bearac reissues While living in Los Angeles he wrote and orchestrated music for various films.IMDB listing"]}, {"page": "Boyd (given name)", "response": ["*Boyd Neel"]}, {"page": "Gerald Drucker", "response": ["He started his career as a violinist with the Boyd Neel String Orchestra at the age of 16, and was soon also playing with the Jacques Orchestra which was founded by Reginald Jacques five years previously. At the Guildhall School of Music he studied violin, viola, French horn (with Dennis Brain) and tuba in addition to the double bass. ", "Poor eyesight prevented a wartime call-up in 1939–1940, so he earned pocket money playing in dance bands (often with the American bandleader Xavier Cugat at the Waldorf-Astoria hotel in New York. His first professional engagement in London during the war had been playing the organ at St Mary Magdalene church, Holloway Road, subsequently working as a violinist or violist with both the leading chamber orchestras of the time, the Boyd Neel Orchestra and the Jacques String Orchestra.and his first encounter with the double bass was when he was invited to fill in for double bassist Gordon Pearce at an ENSA concert for Canadian Troops on the south coast prior to D-day in 1944. "]}, {"page": "Dido and Aeneas discography", "response": ["|Clarence RaybouldBoyd Neel String orchestraCharles Kennedy Scott's A Capella singers"]}, {"page": "Nancy Evans (mezzo-soprano)", "response": ["Evans was born in Liverpool and educated at Calder High School for Girls there. After studying singing first with John Tobin and later with Maggie Teyte and Eva de Reusz, she made her recital debut in Liverpool at the age of 18. In or before 1936 she took the part of Dido in the premiere recording of Purcell's Dido and Aeneas with Roy Henderson as Aeneas, under Boyd Neel.(Purcell Society recording): R.D. Darrell, Gramophone Shop Encyclopedia of Recorded Music, (New York 1936). Initially a recital and concert singer, she made her stage debut in 1938 in Arthur Sullivan's The Rose of Persia at the Prince's Theatre in London, which was followed by a series of small roles at Royal Opera House. During World War II, she sang throughout Europe and the Middle East in ENSA concerts for the British armed forces."]}, {"page": "Concerti grossi, Op. 6 (Handel)", "response": ["*Boyd Neel (conductor), The Boyd Neel String Orchestra, London Records (1952)"]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["|||Boyd Neel||No book||A gramophone for slow-playing records"]}, {"page": "Milton Barnes (composer)", "response": ["Born in Toronto, Barnes entered The Royal Conservatory of Music (RCM) in 1952 where he was a pupil of Samuel Dolin (piano), Victor Feldbrill (conducting), Ernst Krenek (composition), Boyd Neel (conducting), Walter Susskind (conducting), and John Weinzweig (composition). He graduated from the RCM in 1955 after which he entered the Vienna Academy of Music where he earned a master's degree in 1961. He also spent summers during the 1950s studying at the Chigiana School in Siena, Italy and the Tanglewood Music Center in Lenox, Massachusetts."]}, {"page": "Variations on a Theme of Frank Bridge", "response": ["Variations on a Theme of Frank Bridge, Op. 10, is a work for string orchestra by Benjamin Britten.  It was written in 1937 at the request of Boyd Neel, who conducted his orchestra at the premiere of the work at that year's Salzburg Festival.  It was the work that brought Britten to international attention.Music Web International", "In May 1937,Linn Records the organisers of the Salzburg Festival invited Boyd Neel and his orchestra to perform three works at that year's Festival, in August, only three months away.  One of those works had to be a previously unperformed work by a British composer.  Neel knew Britten from having conducted his film score for Love From a Stranger in 1936, so he asked him to write a new work for a string orchestra.  Britten accepted the commission and immediately started work on a new set of variations on a theme by Bridge.  Britten took as his theme the second of Bridge's Three Idylls for string quartet, Op. 6, No. 2.Naxos Direct  The first sketch was completed in 10 days, and the work was fully scored by 12 July."]}, {"page": "Charles Kennedy Scott", "response": ["*Purcell: Dido and Aeneas (first complete): Nancy Evans (Dido), Mary Hamlin (Belinda), Roy Henderson (Aeneas), Mary Jarred (Sorceress), Olive Dyer (Spirit), Dr Sydney Northcote (Sailor), Gladys Currie (Second woman), Gwen Catley and Gladys Currie (Witches), Charles Kennedy Scott's A Cappella Singers, Boyd Neel String Orchestra, Boris Ord (continuo), Clarence Raybould (conductor), Hubert J. Foss (Musical director). (Decca Records, X 101–107, 7 12\" 78rpm records, by subscription only for the Purcell Society).R. D. Darrell, The Gramophone Shop Encyclopedia of Recorded Music (Gramophone Shop, New York 1936).For a full-length review of this recording see The Gramophone, December 1935, p. 19 ff."]}, {"page": "CBC Concert Hour", "response": ["This Montreal-produced series featured classical music, concentrating particularly on chamber music. Artists featured included Maureen Forrester, Ernest MacMillan, John Newmark, Elisabeth Schwarzkopf, Andrés Segovia and Joseph Szigeti. Boyd Neel and Wilfred Pelletier were among the conductors seen on CBC Concert Hour. Irving Gutman was the series stage director."]}]}}