{"wiki_id": "http://www.wikidata.org/entity/Q8964981", "itemLabel": "Grant Brebner", "itemDescription": "Footballer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Grant_Brebner", "wikipedia_page": {"main": "Grant Ian Brebner (born 6 December 1977) is a Scottish football coach and former player who was the head coach at Australian side Melbourne Victory. Born in Edinburgh, Brebner joined Manchester United as a 16-year-old in 1994. While at Manchester United, he broke into the Scotland under-21 team, making 17 appearances between 1997 and 1999; however, he was unable to find a place in the Manchester United first team and was loaned out to Cambridge United and Hibernian, before being sold to Reading for £300,000 in 1998. He then returned to Hibernian on a permanent basis, and made more than 100 appearances in a five-year stint there that included a loan spell with Stockport County. In August 2004, he was transferred to Dundee United, before moving to Australia to play for Melbourne Victory. After six years with Melbourne Victory, he joined Victorian Premier League side Moreland Zebras. He returned to Melbourne Victory as an assistant coach in 2020, before assuming the position of manager later that year, where he served until being dismissed from the position in April 2021.", "link_mentions": [{"page": "Madejski Stadium", "response": ["Reading began the 1998–99 season at the Madejski Stadium. It was opened on 22 August 1998 when Luton Town were beaten 3–0 with Grant Brebner having the honour of scoring the first ever goal at the stadium. Plans for the stadium had first been unveiled some three years previously, when chairman John Madejski had decided that Elm Park was unsuitable for redevelopment as an all-seater stadium and that relocation to a new site was necessary. Following the death of academy manager Eamonn Dolan in 2016, Reading announced that the North Stand would now be renamed The Eamonn Dolan Stand. "]}, {"page": "Melbourne Victory FC", "response": ["The league's inaugural season of 2005–06 proved to be a disappointment in conclusion but also a glimpse into the glory that would follow in 2006–07 and 2008–09 seasons, with the club being first on the ladder mid-season but ultimately finishing second last. Future team of the decade players Danny Allsopp, Leigh Broxham, Archie Thompson, Grant Brebner, Adrian Leijer, Rodrigo Vargas, Michael Theoklitos under captain Kevin Muscat and manager Ernie Merrick would achieve glory in winning its first league premiership and championship in the 2006–07 season, qualifying for its inaugural AFC Champions League. Archie Thompson in A-League history is synonymous with the glory of famously scoring the first five goals in the 6–0 grand final win over Adelaide United in front of a current record crowd for a grand final of 55'436 at Docklands Stadium. The heavy defeat for Adelaide as well as an altercation between Muscat and manager John Kosmina earlier in the season is culturally seen as the beginning of the rivalry, earning the nicknames 'the cross-border rivalry' and 'the original rivalry'.", "In January 2020, after just 6 months in the role Kurz was dismissed by the club. Kurz left having managed the Victory for just thirteen competitive matches, for four wins, three draws and six losses. The six defeats were the most losses the Victory had suffered after thirteen games of a season. At the time of his dismissal, the Victory were sixth on the league ladder with fifteen points, their equal lowest points tally after thirteen games alongside the 2007–08 and 2011–12 seasons. Assistant coach Carlos Pérez Salvachúa was appointed as caretaker manager of the Victory until the conclusion of the season. However, on 30 May 2020, with 5 regular season A-League matches remaining in Melbourne Victory's season, Salvachúa departed the club to return to Europe to be closer to his family. Assistant coach and former player Grant Brebner was appointed as the Victory's caretaker manager for the remainder of the season; he was later appointed promoted to permanent manager on 24 August 2020.", "* Grant Brebner"]}, {"page": "Michael Ferrante", "response": ["He had a spell in Italy with Comprensorio Stabia and Serie C side Benevento Calcio before returning to Australia to join Fawkner Blues in 2004. He joined Melbourne's inaugural A-League squad for season 2005–06 and featured in all of Melbourne Victory league games. Following the signings of Fred and Grant Brebner he was frozen out of the squad for the second season and struggled to make appearances. He made 21 appearances for Melbourne in 2005–06, scoring one goal, and five appearances in 2006–07."]}, {"page": "Tom Pondeljak", "response": ["A month later, on 28 February 2009, Pondeljak scored what proved to be the winning goal in Melbourne Victory's 1–0 triumph over arch-rivals Adelaide United in the A-League Grand Final. He was later substituted for teammate Grant Brebner and was awarded the Joe Marston Medal for man of the match."]}, {"page": "2006–07 A-League", "response": ["|  Grant Brebner"]}, {"page": "2006–07 Adelaide United FC season", "response": ["One of the matches of the season as the Melbourne Victory attempted to maintain a 100% record against an Adelaide side nearing the top of their game. The match got off to a fiery start as Ross Aloisi and Grant Brebner received yellow cards in the opening minute. The Victory had the better of the chances during the match, yet it was the Reds who came away with the 3 points as a counter-attacking move saw Greg Owens run free and slot the ball past 'keeper Theoklitos. The main talking point however, was an altercation between Victory captain Kevin Muscat and Adelaide coach John Kosmina. The ball had gone out of play for a Melbourne throw-in and with his side 0–1 down, Muscat wanted to retrieve the ball quickly. The ball had gone under Kosmina's chair and as the Reds manager was picking it up, Muscat sent the Kossie sprawling to the turf. Kosmina then got up and grabbed Muscat by the throat. Kosmina was sent to the stands while Muscat received a booking. Kosmina was given a 6-week suspension, with two suspended. The Victory still sit atop the A-League ladder while United are third."]}, {"page": "Danderhall", "response": ["Notable people from Danderhall include: footballer Grant Brebner, now playing in Australia, former Hearts and Motherwell footballer Kevin Twaddle., Commonwealth Gold Medalist and triple World Champion David Peacock (bowls), former International darts player Rab Stewart and darts and autocross champion Blair Hamilton."]}, {"page": "2004–05 Dundee United F.C. season", "response": ["United began pre-season with James Grady as the only pre-season signing, the striker arriving on a Bosman transfer from relegated Partick Thistle. First-team regulars Paul Gallacher and Charlie Miller left by the same method during the summer, with Scotland keeper Gallacher heading for Norwich City and Miller joining Norwegian side SK Brann. Veteran Owen Coyle also cut short his second Tannadice stay to return to Airdrie Utd. During August, Paul Ritchie and goalkeeper Lars Hirschfeld arrived on six-month deals following releases from Walsall and Tottenham respectively. Surprisingly, Grant Brebner was also allowed to sign for free from fellow SPL side Hibernian."]}, {"page": "2006–07 Dundee United F.C. season", "response": ["United signed Craig Conway, Noel Hunt and Steven Robb in pre-season, with Derek McInnes, Jim McIntyre and Grant Brebner departing on free transfers after being released by the club. United started pre-season with a 4–1 win at Raith Rovers before a week in Denmark with matches against Herfølge BK and FC Nordsjælland. Back in Scotland, United played Forfar at Station Park before the Evening Telegraph Challenge Cup resulted in a disappointing 1–0 defeat to rivals Dundee at Dens. The round of pre-season friendlies meant none were played at Tannadice."]}, {"page": "2006–07 Melbourne Victory FC season", "response": ["Melbourne began the 2006–07 Hyundai A-League season hoping to vastly improve on their 7th place in the inaugural season. Coach Ernie Merrick had made a number of off-season signings to bolster the squad with skill and experience including 3 Brazilians Alessandro, Claudinho, Fred along with Scottish Premier League player Grant Brebner. After a hugely successful Round 2 fixture against Sydney FC at the Telstra Dome (now the Etihad Stadium) in front of a crowd of 39,730, Melbourne Victory announced that they would move all but one match from Olympic Park to Telstra Dome. Melbourne became the first team to complete the A-League double in the history of the competition; clinching the premiership against the New Zealand Knights 4–0 at Olympic Park with 4 rounds of the A-League season remaining, then beating Adelaide United 6–0 in the Grand Final at a sold out Telstra Dome to take the championship. Melbourne also qualified for the 2008 AFC Champions League as A-League Champions.", "| Grant Brebner || Dundee United || Scottish Premier League || July 2006", "Victory also won the QNI North Queensland Trophy by beating leading Chinese Super League team Changchun Yatai 6–1 in the final.  Michael Ferrante scored twice early on and then-trialist Grant Brebner added a spectacular thirty-yard free-kick to make it 3–0 at half-time, while Danny Allsopp scored three times in the second half to seal the win. The competition featured fellow A-League side Central Coast Mariners (Victory won 4-2 on penalties), the Young Socceroos (Victory lost 5-6 on penalties), and Changchun Yatai (Victory won 3–1 in the first meeting)."]}, {"page": "Ange Postecoglou", "response": ["On 26 April 2012, it was announced that he had signed a three-year contract with A-League club Melbourne Victory as head coach. Postecoglou started rebuilding the team by releasing Matthew Kemp, Grant Brebner, Rodrigo Vargas, Tom Pondeljak, Ante Čović, Carlos Hernández, Harry Kewell and Fabio Alves, with Jean Carlos Solórzano and Ubay Luzardo returned to their respective clubs after their loan deals had expired. Postecoglou rounded up his squad by signing Jonathan Bru, Guilherme Finkler, Adama Traoré, Marcos Flores, Mark Milligan, Theo Markelis, Sam Gallagher and Spase Dilevski."]}, {"page": "Leigh Broxham", "response": ["With the departure of Kevin Muscat, managers Marco Kurz, Carlos Salvachua and Grant Brebner mainly utilized Broxham back in the centre of midfield with the prospect of maintaining possession and distributing the ball laterally."]}, {"page": "2007–08 A-League", "response": ["|  Grant Brebner"]}, {"page": "2007 A-League Grand Final", "response": ["|MF ||17|| Grant Brebner|| ||"]}, {"page": "1997–98 Manchester United F.C. season", "response": ["Leaving in the winter were Czech midfielder Karel Poborský, English forward Neil Mustoe, and English defender John O'Kane. Andy Duncan joined Cambridge United on 1 April, while on 12 June, Grant Brebner joined Reading. Robert Trees departed to Bristol Rovers on 14 June, while on 30 June, Stuart Brightwell, David Brown, Brian McClair, Ross Millard, Gavin Naylor, and Kevin Pilkington left.", "|  Grant Brebner", "|  Grant Brebner", "|  Grant Brebner"]}, {"page": "Evenings with Mark Fine", "response": ["Over the history of Evenings with Mark Fine the host had been joined by co-hosts including AFL stars Martin Pike, Jason Johnson, Gavin Crosisca, Robert Shaw, David Armitage, Michael Jamieson and Dom Gleeson; NRL stars Cameron Smith, Brett Finch and Steve Turner. Former Socceroos Archie Thompson, Clint Bolton, and David Clarkson as well as Melbourne Victory’s Grant Brebner. He was also joined regularly by cricketers John Hastings, Bryce McGain, Rob Quiney, Adam Dale and Nick Jewell.  "]}, {"page": "2008–09 A-League", "response": ["|  Grant Brebner1"]}, {"page": "Steve Kean", "response": ["On 23 October 2020 Kean was announced as the assistant coach for Melbourne Victory, serving under head coach Grant Brebner. Brebner and Kean had previously worked together during their time with Reading, with Kean serving as Academy Director and then First Team Coach, while Brebner was a player. In April 2021, Kean was appointed as interim coach until the end of the 2020–21 A-League season, following the sacking of Grant Brebner."]}, {"page": "2008–09 Melbourne Victory FC season", "response": ["| 2 ||  ||style=\"text-align:left;\"| Grant Brebner ||style=\"text-align:left;\"| || || 1 || || || || 1 || || || || || || || || || || || || || || || || ||"]}, {"page": "2005 Scottish Cup Final", "response": ["|MF ||8|| Grant Brebner |||| "]}]}}