{"wiki_id": "http://www.wikidata.org/entity/Q8962766", "itemLabel": "Frederick Claude Stern", "itemDescription": "British botanist (1884–1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Claude_Stern", "wikipedia_page": {"main": "Sir Frederick Claude Stern (18 April 1884, Knightsbridge, London – 10 July 1967) was a botanist and horticulturalist, known for developing the gardens at Highdown, for creating several cultivars of garden plants and for his publications on peonies, snowdrops and gardening. He also tried to promote the interests of the Jewish community.", "link_mentions": [{"page": "Goring-by-Sea", "response": ["* Frederick Claude Stern, botanist and horticulturalist"]}, {"page": "Victoria Medal of Honour", "response": ["** Sir Frederick Claude Stern (1884–1967) – Highdown chalk garden"]}, {"page": "Stern (surname)", "response": ["* Frederick Claude Stern (1884–1967), English botanist and horticulturalist "]}, {"page": "Albert Gerald Stern", "response": ["In 1922 Stern married Helen Orr-Lewis, daughter of Sir Frederick Orr-Lewis, 1st Baronet, upon his permission after meeting her in the south of France on diplomatic business, since she was underage at the time. They had two sons and two daughters. His brother, Sir Frederick Claude Stern, was an accomplished horticulturist and botanist."]}, {"page": "Veitch Memorial Medal", "response": ["* 1960 : Frederick Claude Stern (1874-1967)"]}, {"page": "Paeonia sterniana", "response": ["The species was named in honor of Frederick Claude Stern, who supported plant hunting in China and wrote a comprehensive book on peonies. cited on "]}, {"page": "Paeonia daurica", "response": ["Paeonia daurica was first described by Henry Cranke Andrews in the seventh volume of his Botanist's Repository published in 1807. A yellow flowered Paeonia species from Abkhazia was collected by C.M. Worontzoff, and described in 1846 by John Lindley, who named it P. wittmanniana Lindl.. In 1848 Christian von Steven described another taxon with yellow petals under the same specific name P. wittmanniana Steven. It had been collected at Atskhu, Meskheti Province, in Georgia. Pierre Edmond Boissier made descriptions of three taxa in this complex in 1869: P. corallina and P. corallina var. triternata, and P. wittmanniana Steven. Franz Josef Ruprecht in 1869, distinguished P. triternata f. coriifolia. In 1892 Ernst Huth distinguished between P. corallina var. typica with entire leaflets and red petals, and P. wittmanniana with lobed leaflets and yellow petals. Russian botanist Nikolai Michailowitsch Albow was the first to think that a difference only in petal colour does not merit distinguishing species, and he reduced P. wittmanniana to P. corallina var. wittmanniana, under which he described a new form, f. macrophylla. Aleksandr Aleksandrovich Lomakin recognized four species in this group in 1897: P. corallina, P. mlokosewitschii, P. macrophylla, P. wittmanniana, and introduced P. wittmanniana var. tomentosa. In 1899, Vladimir Ippolitovich Lipsky mostly supported the ideas of Lomakin, but distinguished between P. triternata and P. corallina. In 1901, Nikolai Busch recognized P. corallina subsp. triternata, its variety coriifolia (Rupr.), P. wittmanniana f. macrophylla and subsp. tomentosa, and P. mlokosewitschii. Alexander Grossheim distinguished in 1930 seven taxa that differed in the colour of the petals, the shape and number of leaflets, and the hairiness of the leaflets and fruits, so recognizing P. corallina var. caucasica and var. coriifolia, P. mlokosewitschii, P. wittmanniana and its var. macrophylla, P. tomentosa and the new P. abchasica. Nikolai Schipczinsky in the Flora of the USSR (1937) distinguished between P. mlokosewitschii – as part of the series Obovatae having orbicular, ovate or rarely pointed leaflets – and P. triternata, P. caucasica, P. wittmanniana, P. macrophylla, P. tomentosa and P. abchasica – all having rather wide, pointed leaflets – assigning them to the series Corallinae. Frederick Claude Stern in his book A study of the genus Paeonia recognized in his subsection Foliolatae the species P. daurica, P. mlokosewitschii and P. wittmanniana, the latter with four varieties. In 1950 Grossgeim revised his view from 1930 and recognized P. kavachensis (= P. caucasica), P. mlokosewitschii (including P. tomentosa) and P. wittmanniana (including P. abchasica). P. wittmanniana Steven was renamed to P. steveniana by the Georgian botanist Kemularia-Nathadze in 1961, who recognized all previous taxa except P. abchasica in addition to describing a new species named P. ruprechtiana. In 2010 D.Y. Hong revised the genus Paeonia, recognising seven subspecies in P. daurica, among which the new subsp. velebitensis."]}, {"page": "Golders Green Jewish Cemetery", "response": ["* Sir Frederick Claude Stern (1884–1967), botanist and horticulturalist, known for developing Highdown Gardens near Worthing, West Sussex"]}, {"page": "1956 New Year Honours", "response": ["* Colonel Frederick Claude Stern, . For services to Horticulture."]}, {"page": "List of botanists by author abbreviation (S)", "response": ["* Stern – Frederick Claude Stern (1884–1967)"]}, {"page": "Stern family", "response": ["***** Frederick Claude Stern (1884–1967)"]}, {"page": "Paeonia algeriensis", "response": ["In 1887, Ernest Cosson described a peony from Mount Babor in Algeria as P. corallina var. atlantica. The following year, Jules Aimé Battandier considered the Algerian peony belongs to P. russoi var coriacea. Louis Charles Trabut in 1889 named another specimen from Mount Babor P. algeriensis, the description of which was later that year published by Alfred Chabert. Frederick Claude Stern assigned Cosson's variety to P. coriacea in 1943. It was elevated to P. corallina subsp. atlantica in part XI of René Maire's Flore de l'Afrique du Nord, published posthumously in 1964. Werner Greuter and Hervé Maurice Burdet however thought Cosson's specimen should be assigned as a subspecies to P. mascula. In 2010, De-Yuan Hong argues that the peonies from the Kabylie Range are distinct from other peonies, and restores P. algeriensis."]}, {"page": "FC Stern", "response": ["#REDIRECT Frederick Claude Stern"]}, {"page": "F. C. Stern", "response": ["#REDIRECT Frederick Claude Stern"]}, {"page": "1918 New Year Honours (MC)", "response": ["*Capt. Frederick Claude Stern, Yeomanry"]}]}}