{"wiki_id": "http://www.wikidata.org/entity/Q89922", "itemLabel": "Robert Neumann", "itemDescription": "Austrian writer (1897-1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Neumann_(writer)", "wikipedia_page": {"main": "Robert Neumann (22 May 1897, in Vienna – 3 January 1975, in Munich) was a German and English-speaking writer. He published numerous novels, autobiographical texts, plays and radio plays as well a few scripts. Through his parody collections, Mit fremden Federn (With Strange Feathers) (1927) and Unter falscher Flagge (Under False Flag) (1932), he is considered as the founder of \"parody as a critical genre in the literature of the 1920s.\"", "link_mentions": [{"page": "German literature", "response": ["* in exile: Ernst Bloch, Bertolt Brecht, Hermann Broch, Alfred Döblin, Lion Feuchtwanger, Bruno Frank, A. M. Frey, Anna Gmeyner, Oskar Maria Graf, Hermann Hesse, Heinrich Eduard Jacob, Hermann Kesten, Annette Kolb, Siegfried Kracauer, Emil Ludwig, Heinrich Mann, Klaus Mann, Thomas Mann, Balder Olden, Rudolf Olden, Robert Neumann, Erich Maria Remarque, Ludwig Renn, Alice Rühle-Gerstel, Otto Rühle, Alice Schwarz-Gardos, Anna Seghers, B. Traven, Bodo Uhse, Franz Werfel, Arnold Zweig, Stefan Zweig."]}, {"page": "May 22", "response": ["*1897 – Robert Neumann, German and English-speaking author (d. 1975)"]}, {"page": "Irmgard Keun", "response": ["In 1931 Keun's first novel Gilgi, eine von uns was published and became a success. In 1932 a second novel Das kunstseidene Mädchen (The Artificial Silk Girl) came out. Although there were allegations that she had plagiarised a novel by Robert Neumann (a claim endorsed by her erstwhile promoter Kurt Tucholsky - and disproven only much later), this novel also became a success.Letter by Tucholsky to Keun, 16 July 1932, in which he states that while, on first reading the novel he had recognised similarities to Anita Loos' Gentlemen Prefer Blondes, it was only that after other people pointed him to Neumann's novel Karriere, that he realised the plagiarism.Hiltrud Häntzschel discusses this in detail and concludes that the claim was unjustified, p. 41-43"]}, {"page": "Caroline Matilda of Great Britain", "response": ["*Robert Neumann – The Favourite of the Queen (Der Favorit der Königin) (1935)"]}, {"page": "List of authors banned in Nazi Germany", "response": ["* Robert Neumann"]}, {"page": "Robert Neumann", "response": ["Robert Neumann may refer to:", "*Robert Neumann (footballer) (born 1972), retired Czech football player", "*Robert Neumann (writer) (1897–1975), German and English-speaking writer.", "*Robert Neumann (Australian politician), mayor of Gold Coast, Australia", "*Robert Neumann (badminton), retired German badminton player, played in 1991 IBF World Championships – Men's doubles"]}, {"page": "Franz Peter Wirth", "response": ["*1974: Synchron oder Man kann auch anders – (screenplay by Robert Neumann)"]}, {"page": "Paul Zsolnay Verlag", "response": ["The company was created in 1923 by Paul Zsolnay.Hall, Murray G.: “Publishers and Institutions in Austria, 1918–45”, pp. 79–80. A History of Austrian Literature 1918–2000 (Studies in German Literature, Linguistics, and Culture). Katrin Kohl (ed.), Ritchie Robertson (ed.), Camden House Inc., 2006. Online. It was the most successful publishing company during the interwar period, publishing authors such as John Galsworthy, H. G. Wells, Pearl S. Buck, A. J. Cronin, Franz Werfel, Felix Salten, Robert Neumann, Roda Roda, Hilde Spiel, Ernst Lothar, Hans Kaltneker, Friedrich Torberg, Leo Perutz, Heinrich Mann, Kasimir Edschmid, Carl Sternheim, Emil Ludwig, Walter von Molo, and Frank Thiess."]}, {"page": "Exilliteratur", "response": ["The best known exile writers include Theodor Adorno, Günther Anders, Hannah Arendt, Bertolt Brecht, Hermann Broch, Ernst Bloch, Elias Canetti, Veza Canetti, Alfred Döblin, Lion Feuchtwanger, Bruno Frank, Oskar Maria Graf, Hermann Hesse, Max Horkheimer, Heinrich Eduard Jacob, Hermann Kesten, Annette Kolb, Siegfried Kracauer, Else Lasker-Schüler, Emil Ludwig, Heinrich Mann, Klaus Mann, Erika Mann, Thomas Mann, Ludwig Marcuse, Robert Musil, Robert Neumann, Erich Maria Remarque, Ludwig Renn, Joseph Roth, Alice Rühle-Gerstel and Otto Rühle, Nelly Sachs, Felix Salten, Anna Sebastian, Anna Seghers, Peter Weiss, Franz Werfel, Bodo Uhse, Max Brod, and Arnold Zweig."]}]}}