{"wiki_id": "http://www.wikidata.org/entity/Q899264", "itemLabel": "Martin Fleischmann", "itemDescription": "British chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Fleischmann", "wikipedia_page": {"main": "Martin Fleischmann FRS (29 March 1927 – 3 August 2012) was a British chemist who worked in electrochemistry. Premature announcement of his cold fusion research with Stanley Pons, regarding excess heat in heavy water, caused a media sensation and elicited skepticism and criticism from many in the scientific community.", "link_mentions": [{"page": "August 3", "response": ["*  2012   – Martin Fleischmann, Czech-English chemist and academic (b. 1927)"]}, {"page": "Cold fusion", "response": ["In 1989, two electrochemists, Martin Fleischmann and Stanley Pons, reported that their apparatus had produced anomalous heat (\"excess heat\") of a magnitude they asserted would defy explanation except in terms of nuclear processes. They further reported measuring small amounts of nuclear reaction byproducts, including neutrons and tritium. (\"It is inconceivable that this [amount of heat] could be due to anything but nuclear processes... We realise that the results reported here raise more questions than they provide answers...\") The small tabletop experiment involved electrolysis of heavy water on the surface of a palladium (Pd) electrode. The reported results received wide media attention and raised hopes of a cheap and abundant source of energy.", "Nuclear fusion is normally understood to occur at temperatures in the tens of millions of degrees. This is called \"thermonuclear fusion\". Since the 1920s, there has been speculation that nuclear fusion might be possible at much lower temperatures by catalytically fusing hydrogen absorbed in a metal catalyst. In 1989, a claim by Stanley Pons and Martin Fleischmann (then one of the world's leading electrochemists) that such cold fusion had been observed caused a brief media sensation before the majority of scientists criticized their claim as incorrect after many found they could not replicate the excess heat. Since the initial announcement, cold fusion research has continued by a small community of researchers who believe that such reactions happen and hope to gain wider recognition for their experimental evidence.", "The most famous cold fusion claims were made by Stanley Pons and Martin Fleischmann in 1989. After a brief period of interest by the wider scientific community, their reports were called into question by nuclear physicists. Pons and Fleischmann never retracted their claims, but moved their research program from the USA to France after the controversy erupted.", "Martin Fleischmann of the University of Southampton and Stanley Pons of the University of Utah hypothesized that the high compression ratio and mobility of deuterium that could be achieved within palladium metal using electrolysis might result in nuclear fusion. To investigate, they conducted electrolysis experiments using a palladium cathode and heavy water within a calorimeter, an insulated vessel designed to measure process heat. Current was applied continuously for many weeks, with the heavy water being renewed at intervals. Some deuterium was thought to be accumulating within the cathode, but most was allowed to bubble out of the cell, joining oxygen produced at the anode. For most of the time, the power input to the cell was equal to the calculated power leaving the cell within measurement accuracy, and the cell temperature was stable at around 30 °C. But then, at some point (in some of the experiments), the temperature rose suddenly to about 50 °C without changes in the input power. These high temperature phases would last for two days or more and would repeat several times in any given experiment once they had occurred. The calculated power leaving the cell was significantly higher than the input power during these high temperature phases. Eventually the high temperature phases would no longer occur within a particular cell."]}, {"page": "E. E. Smith", "response": ["The beginning of the story Skylark of Space describes in relative detail the protagonist's research into separation of platinum group residues, subsequent experiments involving electrolysis, and the discovery of a process evocative of cold fusion (over 50 years before Stanley Pons and Martin Fleischmann). He describes a nuclear process yielding large amounts of energy and producing only negligible radioactive waste—which then goes on to form the basis of the adventures in the Skylark books. Smith's general description of the process of discovery is highly evocative of Röntgen's descriptions of his discovery of the X-ray."]}, {"page": "Pathological science", "response": ["In 1989, Martin Fleischmann and Stanley Pons announced the discovery of a simple and cheap procedure to obtain room-temperature nuclear fusion. Although there were many instances where successful results were reported they lacked consistency and hence cold fusion came to be considered to be an example of pathological science. Two panels convened by the US Department of Energy, one in 1989 and a second in 2004, did not recommend a dedicated federal program for cold fusion research. A small number of researchers continue working on the field."]}, {"page": "1989", "response": ["* March 23 – Stanley Pons and Martin Fleischmann announce that they have achieved cold fusion at the University of Utah."]}, {"page": "Raman spectroscopy", "response": ["*Surface-enhanced Raman spectroscopy (SERS) – Normally done in a silver or gold colloid or a substrate containing silver or gold. Surface plasmons of silver and gold are excited by the laser, resulting in an increase in the electric fields surrounding the metal. Given that Raman intensities are proportional to the electric field, there is large increase in the measured signal (by up to 1011). This effect was originally observed by Martin Fleischmann but the prevailing explanation was proposed by Van Duyne in 1977. A  comprehensive theory of the effect was given by Lombardi and Birke."]}, {"page": "Timeline of nuclear fusion", "response": ["**On March 23, two Utah electrochemists, Stanley Pons and Martin Fleischmann, announced that they had achieved cold fusion: fusion reactions which could occur at room temperatures. However, they made their announcements before any peer review of their work was performed, and no subsequent experiments by other researchers revealed any evidence of fusion."]}, {"page": "Stanley Pons", "response": ["Bobby Stanley Pons (born August 23, 1943) is an American electrochemist known for his work with Martin Fleischmann on cold fusion in the 1980s and 1990s.\"Nuclear fusion\", Encyclopædia Britannica, 2011, accessed May 6, 2011.", "He decided to finish his PhD in England at the University of Southampton, where in 1975 he met Martin Fleischmann. Pons was a student in Alan Bewick's group; he earned his PhD in 1978."]}, {"page": "Brian Josephson", "response": ["Dana Ullman, The Homeopathic Revolution, North Atlantic Books, 2007, p. 130ff. Cold fusion is the hypothesis that nuclear reactions can occur at room temperature. When Martin Fleischmann, the British chemist who pioneered research into it, died in 2012, Josephson wrote a supportive obituary in the Guardian and complained to Nature that its obituary had failed to give Fleischmann due credit.Brian Josephson, \"Martin Fleischmann obituary\", The Guardian, 31 August 2012."]}, {"page": "Fringe science", "response": ["* A nuclear fusion reaction called cold fusion which occurs near room temperature and pressure was reported by chemists Martin Fleischmann and Stanley Pons in March 1989. Numerous research efforts at the time were unable to replicate their results. Subsequently, a number of scientists have worked on cold fusion or have participated in international conferences on it. In 2004, the United States Department of Energy commissioned a panel on cold fusion to take another look at it. They wanted to determine whether their policies concerning it should be altered because of new evidence."]}, {"page": "Eugene Mallove", "response": ["Mallove authored Fire from Ice, a book detailing the 1989 report of tabletop cold fusion from Stanley Pons and Martin Fleischmann at the University of Utah. Among other things, the book claims the team did produce \"greater-than-unity\" output energy in an experiment successfully replicated on several occasions, but that the results were suppressed through an organized campaign of ridicule from mainstream physicists, including those studying controlled thermonuclear fusion, trying to protect their research and funding.", "Eugene Mallove was a notable proponent and supporter of research into cold fusion. He authored the book Fire from Ice, which details the 1989 report of table-top cold fusion from Stanley Pons and Martin Fleischmann at the University of Utah.Fleischmann, M., S. Pons, and M. Hawkins, Electrochemically induced nuclear fusion of deuterium. J. Electroanal. Chem., 1989. 261: p. 301 and errata in Vol. 263. The book claims the team did produce \"greater-than-unity\" output energy in an experiment that was successfully replicated on several occasions.Mallove, E. J. (1999). Fire from Ice: Searching for the Truth Behind the Cold Fusion Furor, Infinite Energy Press, United States of America,  Mallove claims that the results were suppressed through an organized campaign of ridicule from mainstream physicists."]}, {"page": "1989 in science", "response": ["* March 23 – Stanley Pons and Martin Fleischmann announce cold fusion at the University of Utah."]}, {"page": "Voodoo Science", "response": ["** Cold fusion (Stanley Pons and Martin Fleischmann)"]}, {"page": "Science by press conference", "response": ["* In 1989, chemists Stanley Pons and Martin Fleischmann held a press conference to claim they had successfully achieved cold fusion.Wilford, John Noble (April 24, 1989). Fusion Furor: Science's Human Face. New York Times (Highlighting the complexity of defining the term, Pons and Fleischman technically had an accepted paper in press at a peer-reviewed journal at the time of their press conference, though that was not widely acknowledged at the time and the quality of the paper and its review were subsequently criticized.Lewenstein, Bruce V. (1992). Cold Fusion and Hot History. Osiris, 2nd series, 7, 135–163.)"]}, {"page": "Martin Fleischman", "response": ["#REDIRECT Martin Fleischmann"]}, {"page": "Fleischmann", "response": ["* Martin Fleischmann (29 March 1927 – 3 August 2012), British chemist associated with cold fusion research."]}, {"page": "Steven E. Jones", "response": ["In the mid-1980s, Jones and other BYU scientists worked on what he referred to as Cold Nuclear Fusion in a Scientific American article (the process is currently known as muon-catalyzed fusion to avoid confusion with the cold fusion concept proposed by the University of Utah's Stanley Pons and Martin Fleischmann). Muon-catalyzed fusion was a field of some interest during the 1980s as a potential energy source; however, its low energy output appears to be unavoidable (because of alpha-muon sticking losses). Jones led a research team that, in 1986, achieved 150 fusions per muon (average), releasing over 2,600 MeV of fusion energy per muon, a record which still stands."]}, {"page": "Surface-enhanced Raman spectroscopy", "response": ["SERS from pyridine adsorbed on electrochemically roughened silver was first observed by Martin Fleischmann, Patrick J. Hendra and A. James McQuillan at the Department of Chemistry at the University of Southampton, UK in 1973. This initial publication has been cited over 6000 times. The 40th Anniversary of the first observation of the SERS effect has been marked by the Royal Society of Chemistry by the award of a National Chemical Landmark plaque to the University of Southampton. In 1977, two groups independently noted that the concentration of scattering species could not account for the enhanced signal and each proposed a mechanism for the observed enhancement. Their theories are still accepted as explaining the SERS effect. Jeanmaire and Richard Van Duyne"]}, {"page": "Tisbury, Wiltshire", "response": ["Sir Horace Rumbold (1869-1941), diplomat, lived at Tisbury in later life. Martin Fleischmann FRS (1927–2012), a chemist noted for his work in electrochemistry and (controversially) cold fusion, moved to Tisbury following his retirement as Professor of Electrochemistry at Southampton University."]}, {"page": "Worthing College", "response": ["* Martin Fleischmann, Professor of Chemistry at Imperial College London from 1983-7, and President of the International Society of Electrochemistry from 1970-2"]}, {"page": "Category talk:Advocates of pseudoscience", "response": ["For example, putting Martin Fleischmann on this page includes an implicit assumption that Cold Fusion is"]}]}}