{"wiki_id": "http://www.wikidata.org/entity/Q90025266", "itemLabel": "Michael Heseltine", "itemDescription": "Assistant secretary for Health and Registrar of the General Medical Council", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Heseltine_(civil_servant)", "wikipedia_page": {"main": "Michael Heseltine  (; 1886–1952) was a senior civil servant in the United Kingdom and later Registrar of the General Medical Council between 1933 and 1951.", "link_mentions": [{"page": "Michael Heseltine", "response": ["Michael Heseltine was born in Swansea in Wales, the son of Territorial Army Colonel Rupert Dibdin Heseltine (1902–1957), TD,Debrett's Peerage and Baronetage 2008, p. 698 of the Royal Engineers during the Second World War, a factory owner and South Wales local director of Dawnays Ltd, bridge and structural engineers,Michael Heseltine: A Biography, Michael Crick, 1997, pp. 10, 14, 21The Foundry Trade Journal, Foundry Trades' Equipment & Supplies Association, Institute of British Foundrymen, Welsh Engineers' and Founders' Association, 1957, p. 462 and Eileen Ray (née Pridmore). The Heseltine family were in the tea trade: Michael Heseltine's great-grandfather, William Heseltine, was a clerk who worked his way up to being manager of Tetley, later being involved in establishing a chain of grocers; he killed himself after suffering the loss of his fortune through debt and bad investments.Michael Heseltine: A Biography, Michael Crick, 1997, p. 80 Michael Heseltine's grandfather, William's son John Heseltine, became a tea salesman and relocated from Huntingdonshire to Swansea,Michael Heseltine: A Biography, Michael Crick, 1997, pp. 2, 8 the docks being a major arrival point for tea shipments. Earlier generations were farm labourers in Pembrey. His mother originated in West Wales, daughter of James Pridmore, a dock labourer who unloaded coal from ships, later hiring others to do so and founding West Glamorgan Collieries Ltd, a short-lived company that briefly worked two small mines on the outskirts of Swansea (1919–1921); his father, also James, worked at the Swansea docks. Due to this heritage Heseltine was later made an honorary member of the Swansea Dockers Club. Heseltine is a descendant of the composer and songwriter Charles Dibdin.Michael Heseltine: A Biography, Michael Crick, 1997, p. 6", "Heseltine was brought up in relative luxury at No. 1, Eaton Crescent (now No. 5).  He told Tatler interviewer Charlotte Edwardes in 2016: \"At prep school, I started a birdwatching club called the Tit Club.  Every member was named after a member of the tit family: the Marsh Tit, the Blue Tit. I was the Great Tit\".  He once feared the story might reach the press: \"I just know if that had got out when I was in active politics, I would never have recovered\". Heseltine enjoyed angling in Brynmill Park and won a junior competition.BBC Wales Coming Home – 29 September 2008. He was educated at Broughton Hall in Eccleshall, Staffordshire when it was briefly amalgamated with Brockhurst Preparatory school, Bromsgrove School, Worcestershire, and Shrewsbury School, Shropshire.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 13–25.", "His biographers Michael Crick and Julian Critchley (who was a contemporary of Heseltine's at Brockhurst Prep School) recount how, despite not having an innate gift for public speaking, he became a strong orator through much effort, which included practising his speeches in front of a mirror, listening to tape recordings of speeches by television administrator Charles Hill, and taking voice-coaching lessons from a vicar's wife. (In the 1970s and 1980s, Heseltine's conference speech was often the highlight of the Conservative Party Conference, despite his views being well to the left of the then leader Margaret Thatcher.) He was eventually elected to the Library Committee of the Oxford Union for Hilary (Spring) Term 1953.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 32. The Oxford Union minutes record after a debate on 12 February 1953 that \"Mr Heseltine should guard against artificial mannerisms of voice and calculated flourishes of self-conscious histrionics; this is only worth saying because he has the makings of a first class speaker\".Pearce 2016, p. 539.", "He was then elected to the Standing Committee of the Oxford Union for Trinity (summer) Term 1953.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 25–39. On 30 April 1953 he opposed the setting up of the Western European Union (a European defence treaty), not least because it might antagonise the USSR following the supposed \"recent change of Soviet attitudes\" (i.e. after Stalin's death). On 4 June 1953, he called for the development of the British Commonwealth as a third major power in the world (after the USA and USSR).Pearce 2016, pp. 541–2. At the end of that summer term he stood unsuccessfully for the Presidency but was instead elected to the top place on the committee. In his third year (1953–54) he served in top place on the committee, then as Secretary, and finally as Treasurer.Crick, p. 357. As Treasurer he attempted to solve the Union's financial problems not by cost-cutting but by an ultimately successful \"Brighter Union\" policy of bringing in more students for food and drink, and by converting the Union cellars into a venue for events. The Union's Senior Member (the university don that every society was required to have) resigned in protest at what he saw as Heseltine's profligacy, and was replaced by the young Maurice Shock.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 33.", "The Union cellars were opened on 30 October 1954, and Heseltine persuaded the visiting Sir Bernard and Lady Docker to contribute to the considerable cost.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 35. Debates over which he presided included censorship of the Arts (no vote taken), welcoming the decline of British Imperialism (defeated 281–381) and calling for a \"change in the principles and practice of British Trade Unions\" (carried 358-200).Pearce 2016, pp. 550–2. Guest speakers that term included Rajani Palme Dutt, Lady Violet Bonham Carter, his old headmaster John Wolfenden and Jacob Bronowski, whilst Aneurin Bevan addressed a packed meeting of the University Labour Club, chaired by Anthony Howard, in the Union Chamber.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 36.", "Heseltine began articles at Peat Marwick & Mitchell in January 1955.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 39. Whilst training as an accountant, he also built up a property business in the London property boom of the late 1950s. He and his Oxford roommate Ian Josephs had each inherited around £1,000 (around £23,000 at 2016 prices).Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 40–1. They formed a property company called \"Michian\" (after their first names) and with the aid of a mortgage bought a 13-year lease on the so-called Thurston Court Hotel at 39 Clanricarde Gardens (near Notting Hill) for £3,750. They evicted the existing tenants so that Josephs' father could renovate the property and let out the rooms for a total rent of around £30 per week. A year later, they were able to sell the property at a profit, doubling their capital to £4,000.", "With the aid of a £23,000 mortgage, Heseltine and Josephs now bought a group of five adjacent houses for £27,000 in Inverness Terrace, Bayswater. They arranged for some medical students to decorate and remodel the property into a 45-bedroom boarding house, which they called the \"New Court Hotel\". Heseltine would sometimes cook breakfast himself, although he rejects tales that he would get up early to mix margarine in with the butter. Many of the tenants were American servicemen who, he later recorded, were for the most part respectful but sometimes rowdy at weekends.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 41–3.", "Edward Heath, then a government whip whom he had met at the Oxford Union, was his referee when he applied for the Conservative Party Parliamentary Candidates' List in October 1956.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 46. Heseltine bought his first Jaguar, second hand and cheap because of the rise in the price of petrol owing to the Suez Crisis, for £1,750 in December 1956, upgrading to newer and more expensive models in future years.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 48.", "New Court Hotel was sold in 1957.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 43. At this point Heseltine went into business with another Oxford friend, Clive Labovitch, who brought out Opportunities for Graduates that year. Heseltine arranged for this to be distributed for free, expanded from 40 pages to a 169-page hardback book, to final year students at all British universities, paid for by advertising.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 59–61. Heseltine ended his partnership with Josephs and with the aid of a £4,500 investment by Heseltine's mother (following the death of his father in 1957) he and Labovitch were able to buy a group of houses at 29–31 Tregunter Road (south of Earl's Court), adding two more in neighbouring Cathcart Road.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 57–8.", "Heseltine had transferred his articles to a partner at a smaller firm of accountants located off Haymarket, feeling that this would allow him more chance of hands-on involvement in the affairs of the firms whose books he examined, rather than being a cog in a bigger machine. It took him three attempts and special coaching to pass his intermediate exams, and he had little immediate prospect of passing his accountancy finals. He also estimated that he was earning more from his property business than the partner to whom he was articled. With the expiry of his articles in January 1958 he could no longer avoid conscription into National Service.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 39–47.", "Heseltine later wrote that he admired the military, for his father had been a Lieutenant-Colonel in the Royal Engineers in the Second World War and active in the Territorial Army thereafter, but that he had felt that his business career was too important to be disrupted. He and his father had taken the precaution of arranging interviews to increase his chances of attaining an officer's commission in case he had to serve. He had been lucky not to be called up for the Korean War in the early 1950s or the Suez Crisis in 1956; and in the final years of National Service, already due for abolition by 1960, an effort was made to call up men who had so far managed to postpone service. Despite having almost reached maximum call-up age, recently reduced from thirty to twenty-six, Heseltine was conscripted into the Welsh Guards in January 1959.Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, , p. 79.", "Heseltine spent nine weeks in the ranks as a GuardsmanArmy regulations at the time normally required men earmarked for National Service commissions to first serve a period in the ranks. In practice the Guards, like many other regiments, used this to subject its \"Potential Officers\" to nine weeks of intensive training under Colour Sergeant Peter Horsfall, designed in part to weed out those who were unlikely to make the grade.[Life in the Jungle: pp. 50–3] before being sent for three months of officer training at Mons Officer Cadet School, Aldershot, alongside men from other regiments. He was a capable cadet, reaching the rank of Junior Under-Officer and graduating with an A-Grade, but he was not awarded the Sword of Honour or promoted to the rank of Senior Under-Officer, as it was felt his age had given him an unfair advantage over younger cadets.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 50–3. Throughout his training he had been troubled by an old ankle sprain, but he declined the offer of a medical discharge.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 52. He was commissioned as a Second Lieutenant on 11 June 1959.", "Heseltine was granted leave to contest the general election in October that year; according to Ian Josephs this had been his plan from the start. Afterward he applied on business grounds for exemption from return to the Army, in part because of difficulties caused by an employee's embezzlement, and partly including the need to sort out his father's affairs, and was exempted from his remaining sixteen months of service.Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, , pp. 79, 92–3. During the 1980s his habit of wearing a Guards regimental tie, sometimes incorrectly knotted with a red stripe on the neck, was the subject of much acerbic comment from military figures and from older MPs with distinguished war records. Crick estimated that he must have worn the tie on more days than he actually served in the Guards.Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, , pp. 92–3.", "By now the property boom was in full swing. Heseltine and Labovitch established first one, then a group of companies under the name \"Bastion Properties\".Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 60–1. Heseltine later recorded that he and Labovitch bought at least three properties in W1 and W2 which they were able to sell at a profit before they had completed the original purchases. They also built eight small houses in Queensborough Mews, Bayswater. They bought a 58-year lease on a block of seven properties at Stafford Terrace, off Kensington High Street, which they converted into flatsMichael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 61–2. and built houses for Stepney Borough Council.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 70–3. Bastion also planned to build an estate of up to 126 housesit is unclear whether they actually built as many as this. at Tenterden, Kent, which failed to sell. In order to attract other buyers to the empty estate Heseltine had to accept an offer of £4,000 for the first house, which had been valued at £7,250. The estate was beset with repair problems until after Heseltine's election to Parliament.Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, , pp. 105–7.", "Heseltine and Labovitch also founded the magazine publishing company Cornmarket, and brought out Directory of Opportunities for School Leavers and Directory of Opportunities for Qualified Men, which earned a steady income from advertising. Canadian, French and German versions were also launched, although these were less profitable. In late 1959, using £10,000 of a £30,000 profit on selling a freehold site off Regents Park, they acquired the famous (but unprofitable) magazine Man About Town whose title was shortened to About Town then simply Town.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 64–6. In 1962, they paid £10,000 for Topic, a weekly newspaper that had been launched the previous year by a group of entrepreneurs including the Prime Minister's son Maurice Macmillan, and which was now owned by Norman Mascall (a pyramid scheme fraudster of the era). By then the economic climate was too difficult, and like many publishers they found that there is limited appetite for weekly papers in the UK. Topic ceased publication at the end of 1962, but its journalists later became The Sunday Times Insight Team.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 67–9.", "Bastion Properties was in trouble because of building costs and an unsatisfactory building manager. After rapid expansion, Heseltine's businesses were badly hit by the Selwyn Lloyd financial squeeze of 1961Heseltine misdates this to July 1962. In fact the squeeze was a year earlier, in July 1961, and Lloyd was dismissed as chancellor in July 1962.[Life in the Jungle, pp. 70–3] and, still not yet thirty years old, he eventually owed £250,000 (around £4.5 million at 2016 prices). He states he was lent a badly needed £85,000 in December 1962 by a bank manager who retired the same day. He avoided bankruptcy by such tactics as paying bills only when threatened with legal action, although he eventually settled all his debts. It was during this stressful period of his life that he took up gardening as a serious hobby.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 73–4. Later, during the 1990s, Heseltine committed a minor gaffe when he joked in a speech about how he had strung creditors along.Crick 1997, p. 426.", "Between 1960 and 1964, Heseltine also worked as a part-time interviewer for ITV, very likely, in Crick's view, to maintain his public profile as an aspiring politician.Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, , pp. 109–12.", "Lindsay Masters, who had joined the Heseltine-Labovitch publishing business as an advertising manager in spring 1958, and Simon Tindall, who had joined in his early twenties as an advertising salesman while Heseltine had been doing his National Service, played an increasingly large role in managing the company.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 62–3, 87–8. Masters kept a tight grip on the selling of advertising space, banning boozy lunches and setting targets for calling of clients, followed by chase-up calls, whilst keeping a public league table of salesmens' success rates; these were relatively innovative techniques at the time.Crick 1997, pp. 139–41.", "By 1964 Cornmarket owed a great deal of money to their printers, Hazell Watson & Viney, which was then merging with the British Printing Corporation (BPC). Heseltine was summoned by BPC to be told to sort out his firm's debts, but instead persuaded them to accept, instead of payment, an equity stake of at least 40%Heseltine writes that it was 40%, Crick 49%. Heseltine also omits any mention of the debts and implies that this was a purely voluntary transaction first mooted by their previous printer Keliher, Hudson & Kearns in 1963, and continued by Hazell Watson & Viney after they took over that printer. in a new, merged business. The portmanteau name \"Haymarket\" was suggested by Sir Geoffrey Crowther, chairman of BPC.Crick 1997, pp. 141–2.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 76.", "Labovitch left Haymarket at the end of 1965. Heseltine stated he spent three days trying to persuade him to stay. Labovitch wanted to establish himself as a successful educational and careers publisher, and may well have been pushed by his then wife, the socialist journalist Penny Perrick, who disliked Heseltine both personally (as best man at their wedding he had, she said, welcomed various business figures in his speech as if he were at a board meeting) and politically and whom he had refused to include on the Haymarket board. Labovitch was a generator of ideas but he lacked Heseltine's business skills. Although he took his profitable Directories with him, he had to sell them back to Haymarket when his business failed in 1973, causing him to attempt suicide. Heseltine offered him a position as consultant to Haymarket.Crick implies that he rejoined the company; Heseltine writes that he declined the offer. The two former partners remained on friendly terms until Labovitch's death in 1994.Crick 1997, pp. 145–7.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 80–2.", "In April 1967, Heseltine persuaded BPC to inject a further £150,000 into Haymarket, increasing its ownership stake to 60%, whilst Heseltine and other directors retained smaller shareholdings. Haymarket doubled their magazine portfolio by taking over the management of twenty of BPC's magazines (many of which had been acquired by BPC in lieu of bad debts by other publishers), including Autosport. However, they were now effectively a subsidiary of BPC; Heseltine, Masters and Tindall could potentially be outvoted or even sacked by the four BPC directors on the board. BPC installed a new financial controller who installed cost and cashflow management for the first time, and insisted on finally closing Town magazine at the end of 1967.Crick 1997, pp. 147–9. Town had never made a profit, but Heseltine writes that its quality was instrumental in establishing Haymarket's reputation as a publishing house. Around that time, Management Today became Haymarket's first big success.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 78. A BPC manager recorded that Heseltine kept the initiative at board meetings by \"poker-faced nit-picking\" about the quality and timing of BPC's printing, rather than by employing what came to be considered his usual \"I will transform the world\" rhetoric.Crick 1997, p. 194.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 82–9.", "With Heseltine a government minister from June 1970, Haymarket was being run by Masters and Tindall, who had secured another coup by publishing Computing for the British Computing Society. BPC was in financial trouble in 1971, and Heseltine, Masters and Tindall assembled a consortium of County Bank, Charterhouse Development, ICFC and Wren Investments to help buy out BPC's 60% stake for £1m, a very low price given that Haymarket had made over £250,000 the previous year. The consortium took a 40% stake in Haymarket, and loaned the company £820,000, while Heseltine took out a large personal loan at this time to buy both another 20% of Haymarket's shares (the rest of the BPC shareholding, bringing Heseltine's own shareholding to just under 50%). At the meeting to close the deal, one of the bankers recorded, \"Michael thought he was President of the Oxford Union again, and entered into a grand oration and bored everyone stiff\".Crick 1997, pp. 194–5. In 1971 Heseltine placed his shares in a trust controlled by his ministerial boss Peter Walker and by his solicitor Charles Corman. Haymarket's pretax profits were £453,000 in 1971 and £704,000 in 1972.Crick 1997, p. 196. Haymarket was due to be floated as a public company in the autumn of 1973, although this was cancelled because of the rise in the oil price, which reduced the profitability of the publishing industry. They thus avoided the stock market crash which followed. The company remains privately owned to this day.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 90–1.", "Heseltine acted as a consultant to Haymarket during his period out of government office between 1974 and 1979.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 91–2. His role was to bring in new publishing ideas. He believed he increased performance, although Robert Heller later recorded that he did very little, for he was too busy as a member of the Shadow Cabinet. He worked from an office at Haymarket, near Regent Street, rather than in the House of Commons.Crick 1997, pp. 193–4. Under the management of Masters and Tindall, Haymarket continued to grow. By 1976 it was making annual profits of round £1.75m. In 1976–1977 Heseltine, Masters, Tindall and the Finance Director David Fraser bought out the consortium's 40% share, using money borrowed from them, giving Heseltine and his family over 50% control of Haymarket.Crick 1997, pp. 196–7.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 92. Heseltine had taken out large personal loans both to increase his stake in the company and to buy his country mansion Thenford House. Masters had also done the same to buy himself a property.Crick 1997, pp, 196-7, 324. Several titles, including Accountancy Age and Computing were sold to the rival company VNU in 1980. The transaction raised £17m, half of which went to Heseltine, but in Crick's view was a bad move for Haymarket.Crick 1997, p. 324. During Heseltine's second period out of office (1986–1990), Masters threatened to resign if Heseltine returned to Haymarket, but once again he became a consultant on £100,000 per annum.Crick 1997, p. 297.", "By 1997, when his career as a Cabinet minister ended, Haymarket was making an annual profit of over £10m and employing around 1,000 people. Heseltine resumed management of the company after Masters' retirement in 1999.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 92–4. Haymarket has seen reduced profitability in the UK since 1999, but has expanded further into foreign markets (for example India). It has also laboured under heavy borrowings of over £100 million to buy back Masters' and Tindall's large minority shareholdings, which have been reduced to some extent by the sale of properties. Heseltine has now retired from day-to-day management, handing over to his son Rupert.", "Heseltine contested the safe Labour seat of Gower at the October 1959 general election.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 47–58. He had been the only applicant for the Conservative (technically, Conservative and National Liberal)The National Liberals had been a breakaway group under Sir John Simon, who sat in coalition with the Conservatives between 1931 and 1945. By the 1950s they had merged with the Conservatives for practical purposes, but the name was still used locally in some seats. candidacy. He would at times attend Labour meetings and attempt to heckle the speakers, including Aneurin Bevan and the Labour candidate Ifor Davies, whom he kept trying to challenge to a debate. He obtained plenty of publicity in the local paper and obtained a swing to the Conservatives slightly better than the national average.Crick 1997, pp. 88–9.", "In 1961, Heseltine was one of 29 applicants—of whom half were interviewed—for the Conservative candidacy in the marginal constituency of Coventry North. He clinched the selection after bringing his fiancée Anne Williams to the meeting. He got on well with the incumbent Labour member Maurice Edelman (whose daughter was a friend of Anne Heseltine, as she became in 1962) and they met for dinner sometimes during the campaign.Crick 1997, pp. 113–6. Many of his Oxford contemporaries had already entered Parliament, but, to his disappointment, in the 1964 general election he was defeated by 3,530 votes.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 96. The swing to Labour was slightly less than the national average.", "In March 1965, Heseltine applied to be candidate for the safe Conservative seat of Tavistock in Devon, where the incumbent MP had announced his retirement two months earlier.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 97–99. Of the 51 applicants, 14 were considered, six of whom had local connections. Heseltine reached the final short list of three, the others being a dairy farmer in a senior position at the Milk Marketing Board (thought to be the favourite), and a local authority lawyer, who later recalled that on the train down from London Heseltine kept jumping out at every stop to check that his magazines were on display at the station newsagents. Heseltine had already spent several days driving round talking to locals and had ordered a year's worth of back copies of Tavistock's two weekly papers. Such effort is nowadays common in Parliamentary selections but was unusual at the time. He was selected by a clear majority of the Tavistock Conservative Association's Finance and General Purposes Committee (which contained between 100 and 120 people).Crick 1997, pp. 119–26.", "In 1972, Edward Heath attempted to persuade Heseltine, a strong supporter of his, to challenge Powellite MP Ronald Bell for the Conservative nomination for the new seat of Beaconsfield.Geoffrey Gilson, The Hunt for Margaret Thatcher's Assassin (2014), p. 156. Heseltine wrote that he was \"tempted\" to enter the lists at Beaconsfield, but did not actually do so.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 105–6. Crick writes that he reached the final shortlist of four against Bell, before being \"apparently persuaded\" to withdraw. Bell's campaign within the local Conservative ranks was masterminded by Hugh Simmonds, chairman of the Young Conservatives, and he narrowly won.", "Heseltine was MP for Henley from February 1974 until his retirement from the House of Commons in 2001.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 99–106.", "It is unclear how Heseltine voted in the first ballot of the 1975 Conservative leadership election, in which the challenger Margaret Thatcher defeated Heath. Norman Tebbit stated that he and John Nott persuaded him to vote for Thatcher so as to open up the way for his preferred candidate Willie Whitelaw to stand on the second ballot. Another (anonymous) close friend later told Michael Crick that Heseltine voted for Thatcher. The Thatcher team had him down as an abstainer, while he refused at the time to reveal how he voted. In his memoirs Heseltine wrote that he abstained in the first ballot, but that he would have voted for Whitelaw in the first ballot had he stood against Heath.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 61. Whitelaw admired his drive and energy but looked down on him as \"new Money\" and is said to have commented that Heseltine was \"the sort of man who combs his hair in public\".Crick 1997, pp. 182–3.", "In autumn 1976 Heseltine was reshuffled, against his will, to the job of Shadow Environment Secretary. He was particularly cross at having to give up the job of Shadow Industry Secretary to John Biffen. He accepted on condition that he would not have to take the Environment job when the Conservatives returned to office. As Benn had given way to Eric Varley there was no longer such a need for aggressive campaigning on Industry, and Thatcher, who had herself been Shadow Environment Secretary in 1974, wanted campaigning on council house sales (Heseltine offered up to 50% discounts for tenants who bought their homes) and reform of the rates, and thought his predecessor Tim Raison ineffective.Crick 1997, pp. 191–3.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 155–85.", "Some criticism was made of his time in Liverpool that he spent a lot of money but generated little in the way of new employment (\"I would not blame him for that: Liverpool had defeated better men than Michael Heseltine\" commented Lady Thatcher acidly in her memoirs in 1993). Local Labour politicians tended to feel that he had accomplished little, although they acknowledged his good intentions. However a more positive assessment was offered by Michael Parkinson, Professor of Urban Affairs at John Moores University: although he had been sceptical in the 1980s, by 1997 he had come to favour the policies championed by Heseltine: assignment of ministers to regions, development of housing associations and cooperatives, and the channelling of government money through business-led agencies rather than through local government.Crick 1997, pp. 241–2.", "Heseltine was disappointed not to receive the support of old allies on the second ballot; these included Secretary of State for Defence Tom King (whom he asked in vain to second his nomination, but who was angry at a leadership contest when British troops were soon to go to war in Kuwait and supported Douglas Hurd), Cecil Parkinson and Norman Lamont (who managed John Major's campaign).Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 370. Over the weekend on 24–25 November, many Conservative MPs were faced with the anger of their local party members who overwhelmingly supported Thatcher but did not at that time have a vote in leadership elections, and opinion polls showed that chancellor John Major would also boost Conservative support if leader (previously Heseltine's unique selling-point). Heseltine had never done much to court support among younger MPs the way Major had, and was seen as aloof even by his own supporters. In the second ballot, a week after the first, Heseltine's vote actually fell to 131 (just over 35%) as some MPs had voted for him in the first ballot as a protest against or to try to oust Thatcher but preferred to vote for other candidates now that they had a wider choice. John Major, with 185 votes, was only two votes short of an overall majority. Heseltine immediately and publicly conceded defeat, announcing that he would vote for Major if the third ballot went ahead (it did not, as Hurd, who had finished a distant third, also conceded).Crick 1997, pp. 353–8.", "Heseltine believed that he would have defeated Thatcher if she had contested the second ballot. It has been suggested that he should have withdrawn after weakening her on the first ballot, and that he would have been restored to the Cabinet whether or not she continued as Prime Minister; he writes that this was never seriously suggested at the time.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 369–74.", "John Major was consistently opposed by Eurosceptics in his party (known as the Maastricht Rebels – a small minority of MPs before 1997, but enjoying much wider support among party activists). Heseltine always stated categorically that he would never stand for party leader against Major.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 475.Crick 1997, p. 412.", "Heseltine, who showed his ballot paper to the returning officers to prove that he had voted for Major,Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 483. commented that \"John Major deserves a great deal better than that from his colleagues\". Major was re-elected leader.", "The day after the government was defeated at the 1997 general election, Heseltine suffered an attack of angina and had a tube inserted into an artery; he declined to stand for the Conservative Party leadership again.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 529. However, he was less unpopular with eurosceptics than Clarke, and on the third ballot of the subsequent leadership election Clarke, facing imminent defeat by William Hague, offered to stand aside in Heseltine's favour, but he declined on medical advice.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 532–4.Clarke 2016, p. 399. He became active in promoting the benefits for Britain of joining the Single European Currency, appearing on the same stage as Tony Blair, Gordon Brown and Robin Cook as part of an all-party campaign to promote Euro membership. He was also made a Companion of Honour in the 1997 resignation Honours List. In November 1999 Heseltine was invited by Hague to be the Conservative candidate for the new position of Mayor of London (in place of Jeffrey Archer who had had to stand down because of scandal), but he declined.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , p. 531.", "At the turn of the century they decided to create various ornamental features in the garden and increase the range of trees and shrubs in the arboretum. Covering over  the arboretum is stocked with over 3,000 different species. Their arboretum was featured in a one-off documentary on BBC Two in December 2005.Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , pp. 73–4. In October 2016 he and his wife Anne were featured on BBC's Gardeners' World, discussing their garden at Thenford House, parts of which were modelled after the gardens at Château de Villandry. The garden is open to the public by appointment only.", "* Honours of Michael Heseltine", "* Michael Heseltine, Raising The Sights – A Tory Perspective, in the Primrose League Gazette, vol.91, no.2, Aug/Sept 1987 edition, London.", "* Michael Crick, Michael Heseltine: A Biography, Hamish Hamilton, 1997, .", "* Michael Heseltine, Life in the Jungle, Hodder & Stoughton, 2000, , Heseltine's autobiography, written with the acknowledged assistance of his lifelong friend Anthony Howard.", "* Anne Heseltine, Michael Heseltine, Thenford: The Creation of an English Garden, Head of Zeus, 2016, ", "*Guardian: Aristotle article on Michael Heseltine", "*Guardian interview with Michael Heseltine by Simon Hattenstone"]}, {"page": "Heseltine", "response": ["* Michael Heseltine (born 1933), British politician", "* Michael Heseltine (civil servant) (1886–1952), English civil servant "]}, {"page": "History of medical regulation in the United Kingdom", "response": ["The 1950 Medical Act, championed by GMC Registrar Michael Heseltine, introduced disciplinary boards and a right of appeal to the General Medical Council. It formally renamed the council to the name that had informally been used for some time: the General Medical Council.Hansard, HL, 18 April 1950 It also introduced a compulsory year of training for doctors after their university qualification, a training position which has developed into the current Foundation House Officer role."]}, {"page": "John Postle Heseltine", "response": ["Heseltine was born on 6 January 1843 in Dilham, Norfolk. He was a son of Mary and Edward Heseltine. His brother was Rev. Ernest Heseltine, M.A. of Sandringham, who assisted the officiation of his eldest daughter Dorothy's marriage to Viscount Cantelupe in 1890. Through his brother Ernest, he was uncle to civil servant Michael Heseltine, the Registrar of the General Medical Council between 1933 and 1951."]}]}}