{"wiki_id": "http://www.wikidata.org/entity/Q9005307", "itemLabel": "Hugo Ticciati", "itemDescription": "British violinist", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugo_Ticciati", "wikipedia_page": {"main": "Hugo Ticciati (born April 12, 1980) is a British-born violinist, living in Sweden. He has been successful in several worldwide events such as the Gotland Chamber Music Festival (Sweden), the St. Denis-Festival (Paris), and the Festival Internacional Cervantino. He has also begun his own Festival called the O/MODƏRNT, in Sweden.", "link_mentions": [{"page": "Gramophone Classical Music Awards", "response": ["*Concept Album of the Year: From the Ground Up: The Chaconne. Hugo Ticciati, O/Modernt Chamber Orchestra(Signum Classics)"]}, {"page": "Thomas Sleeper", "response": ["*Violin Concerto No. 2, written for UK violinist Hugo Ticciati and Greek conductor Zoe Zeniodi. Premiered  in the Casa dei Mezzo Music Festival on Crete, June 2013."]}, {"page": "List of contemporary classical violinists", "response": ["* Hugo Ticciati (born 1980)"]}, {"page": "Robin Ticciati", "response": ["Ticciati's paternal grandfather, Niso Ticciati, was a composer, arranger, cellist,He coached the Middlesex Schools Orchestra cello section, in which the contributor's brother played. and keyboardist.The contributor enjoyed a performance by him on some of his keyboard instruments at the Cambridge University Music Club in the early '60s. His father is a barrister, and his mother is a therapist.  His older brother Hugo Ticciati is a violinist, and his sister is a theology professor."]}, {"page": "Girolamo Ticciati", "response": ["The Ticciati family has continued to be associated with the arts; the pianist and composer Francesco Ticciati (1893–1949), composer and arranger Niso Ticciati (1924–1972) and in the present day: the designer Giovanna Ticciati, the violinist Hugo Ticciati and his brother the conductor Robin Ticciati."]}, {"page": "Francesco Ticciati", "response": ["His son Niso Ticciati (1924–1972) was a composer and arranger, his grandchildren include the designer Giovanna Ticciati and his great-grandchildren include the violinist Hugo Ticciati and conductor Robin Ticciati. Robin Ticciati made his debut at The Proms as a conductor in 2010 at the age of 27.Service. Tom. “Robin Ticciati: Transcontinental maestro at 27”, Guardian”, 19 August 2010. Retrieved on 16 March 2017."]}, {"page": "Ticciati", "response": ["*Hugo Ticciati (born 1980), British-born violinist living in Sweden"]}, {"page": "Bram van Sambeek", "response": ["* Vivaldi Rocks is a project where Van Sambeek and his ensemble ORBI works together with Hugo Ticciati and his O/Modernt Chamber Orchestra. They mix Vivaldi’s concerti with rock songs to introduce people to old composers."]}, {"page": "Global Leaders Program", "response": ["*Hugo Ticciati | Confidencen Sweden artistic director"]}]}}