{"wiki_id": "http://www.wikidata.org/entity/Q9005538", "itemLabel": "Hutin Britton", "itemDescription": "actress (1876-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hutin_Britton", "wikipedia_page": {"main": "Nelly Hutin Britton (24 April 1876 — 3 September 1965), usually credited as Hutin Britton was an English actress. She was best known for her performances in Shakespeare roles early in the 20th century. She also appeared in leading roles in two silent British films.", "link_mentions": [{"page": "Dornford Yates", "response": ["Among the many useful friends Mercer made in the OUDS were Gervais Rentoul, who asked him to be his best man,Rentoul, G. This is My Case: An Autobiography (1944) Hutchinson and Lily Brayton's husband, actor Oscar Asche, later producer of the play Kismet, and writer of Chu Chin Chow. After university, Mercer took a caravanning holiday in Hampshire, with Asche, Lily, Agnes, and another theatrical couple, Matheson Lang and his wife, Hutin Britton; both Asche and Lang recall that holiday in their memoirs.Oscar Asche: His Life by Himself (1929)Hurst & BlackettMatheson Lang Mr Wu Looks Back (1940)Stanley Paul & Co"]}, {"page": "Bucklebury", "response": ["*Hutin Britton (1876–1965), actress"]}, {"page": "Matheson Lang", "response": ["In 1903 he married actress Nelly Hutin Britton in London.  In 1906 he played Tristram in Joseph Comyns Carr's play Tristram and Iseult at the Adelphi Theatre,  with Lily Brayton as Iseult and Oscar Asche as King Mark; Lang's wife played Arganthael. Asche afterwards usually referred to Lang as \"Tristram\".", "* Mr Matheson Lang and Miss Hutin Britton - Rudolph De Cordova, Westminster Abbey Press, 1909."]}, {"page": "List of British films before 1920", "response": ["|The Merchant of Venice||Walter West||Hutin Britton, Matheson Lang||Drama||"]}, {"page": "The Wandering Jew (1923 film)", "response": ["The Wandering Jew is a 1923 British silent fantasy film directed by Maurice Elvey and starring Matheson Lang, Hutin Britton and Malvina Longfellow. It was based on a play by E. Temple Thurston. It was remade in 1933 as The Wandering Jew.", "* Hutin Britton - Judith "]}, {"page": "The Merchant of Venice (1916 film)", "response": ["The Merchant of Venice is a 1916 British silent drama film directed by Walter West and starring Matheson Lang, Hutin Britton, Ernest Caselli. It is an adaptation of William Shakespeare's play The Merchant of Venice.", "*Hutin Britton as Portia "]}, {"page": "Nellie Hutin Britton", "response": ["#REDIRECT Hutin Britton"]}, {"page": "Nelly Hutin Britton", "response": ["#REDIRECT Hutin Britton"]}, {"page": "Hutin", "response": ["*Hutin Britton (1876–1965), English actress"]}, {"page": "Andrew Paterson (photographer)", "response": ["In December 1929 a portrait study of Compton Mackenzie at the Scottish National Salon was specially commended by the critics. A gelatine silver print of the portrait (signed and dated by Mackenzie in 1931), was bought by the National Portrait Gallery in London from Bonhams in March 2011 for £600. In January 1931 his portraits of William Mackay Mackenzie, Reverend Professor John Macleod and James Maxton, MP, were on display in the pictorial section at the Foundation Exhibition of the Scottish National Gallery and Museum of Photography in Edinburgh, where Paterson was congratulated on the excellence of his work.\"Photographic Exhibition,\" The Inverness Courier, Tuesday 27 January 1931. He built up a remarkably fine collection of photographic studies of people distinguished in all walks of life, and when the first Scottish PEN Conference was held in Edinburgh in 1927, it featured his gallery of famous literary personages, including George Bernard Shaw, Hilaire Belloc and many others with worldwide reputations.\"Andrew Paterson Website Launched,\" The North Magazine, Summer 2013, pp. 24-25. Others that sat for him include Clementine Hozier (the future Mrs Winston Churchill), Lord Lovat, Neil M. Gunn, Sir John Barbirolli, Robert Bellew Adams, John Murray (theologian), Osgood Mackenzie, Clement Attlee, Margery Lawrence, William Forgan Smith (premier of Queensland), Cunninghame Graham, Mark Hambourg, Sir David Young Cameron, Matheson Lang, Hutin Britton, Hugh Dalton, Eric Linklater, Joe Corrie, Hannen Swaffer, and Gordon Bottomley."]}, {"page": "List of British films of 1923", "response": ["|The Wandering Jew||Maurice Elvey||Matheson Lang, Hutin Britton||Fantasy||"]}]}}