{"wiki_id": "http://www.wikidata.org/entity/Q901716", "itemLabel": "Daniel Nicol Dunlop", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Nicol_Dunlop", "wikipedia_page": {"main": "Daniel Nicol Dunlop (28 December 1868, Kilmarnock, Scotland – 30 May 1935, London) was a Scottish entrepreneur, founder of the World Power Conference and other associations, and a theosophist-turned-anthroposophist. He was the father of artist Ronald Ossory Dunlop.", "link_mentions": [{"page": "Walter Johannes Stein", "response": ["Stein moved to London in 1933, at the invitation of the theosophist-turned-anthroposophist Daniel Nicol Dunlop. Dunlop was director of the British Electrical and Allied Manufacturers' Association (BEAMA), and chairman of the executive council of the World Power Conference. Dunlop had called Stein to London to take up a post in research for the World Power Conference; he had apparently founded the World Power Conference as a precursor to a World Economic Conference, and he had called Stein to London to assist him especially with this latter, more ambitious, project. Dunlop died in 1935 before this plan could be brought to fruition, but Stein did bring about Dunlop's wish for an independent cultural journal in the form of The Present Age. Stein, having taken up various studies in economics, geography, and geology for his collaborative work with Dunlop, was able to bring together the results of this work in a special issue of the journal under the title The Earth as a Basis of World Economy. The publication of the journal ceased with the start of the Second World War."]}, {"page": "D. N. Dunlop", "response": ["#REDIRECT Daniel Nicol Dunlop"]}, {"page": "Dunlop (surname)", "response": ["* Daniel Nicol Dunlop (1868–1935), British anthroposophist and electrical industry executive"]}, {"page": "Ronald Ossory Dunlop", "response": ["Dunlop's mother, Eleanor (née Fitzpatrick) was herself a watercolour artist. His father Daniel Nicol Dunlop (1868–1935), was a great friend of W. B. Yeats, James Stephens and George Russell (Æ). Yeats, Russell, and Daniel Nicol Dunlop had together published The Irish Theosophist from the home of Eleanor's father, the Shakespearean scholar R. H. Fitzpatrick."]}, {"page": "World Energy Council", "response": ["The idea for the foundation of the Council came from Daniel Nicol Dunlop in the 1920s. He wanted to gather experts from all around the world to discuss current and future energy issues. He organised in 1923 first national committees, which organised the first World Power Conference (WPC) in 1924. 1,700 experts from 40 countries met in London to discuss energy issues. The meeting was a success and the participants decided on July 11, 1924 to establish a permanent organisation named World Power Conference. Dunlop was elected as its first Secretary General. In 1968 the name was changed to World Energy Conference, and in 1989 it became the World Energy Council.Wright, Rebecca; Shin, Hiroki; Trentmann, Frank (2013). From World Power Conference to World Energy Council: 90 Years of Energy Cooperation, 1923 - 2013 (PDF). World Energy Council. p. 8. . Retrieved 24 July 2018.", "*1924–1928: Daniel Nicol Dunlop"]}]}}