{"wiki_id": "http://www.wikidata.org/entity/Q901527", "itemLabel": "Emily Head", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Emily_Head", "wikipedia_page": {"main": "Emily Head (born 15 December 1988) is an English actress. Her breakout role was as Carli D'Amato in E4's sitcom The Inbetweeners and she later played Rebecca White in the ITV soap opera Emmerdale and Colette Andrews in BBC drama, The Syndicate.", "link_mentions": [{"page": "December 15", "response": ["*1988 – Emily Head, English actress"]}, {"page": "1988 in American television", "response": ["|Emily Head"]}, {"page": "Kingswood School", "response": ["*Emily Head (actress) "]}, {"page": "December 1988", "response": ["** Emily Head, English actress; in Fulham, London, England"]}, {"page": "Robert Sugden", "response": ["Following his shooting, Robert became one of the show's major protagonists as his relationship with Aaron dominated the events of the series. This long-running story arc involved Robert supporting Aaron upon discovering that he was sexually abused by his father, Gordon (Gary Mavers), as a child; becoming engaged to Aaron and later surprising him with an unofficial wedding between them in 2017; bonding with Aaron's half-sister Liv Flaherty (Isobel Steele), and temporally becoming her guardian after Aaron is arrested and sentenced to 12 months in prison – which involved Robert struggling to cope with Aaron's drug use amid serving his prison sentence; their marriage having a breakdown after Robert ends up sleeping with Chrissie's sister Rebecca (Emily Head); and the pair remarrying in 2018 after Robert and Aaron manage to reunite and reconcile over their differences.", "Robert asks Chrissie's sister, Rebecca White (Emily Head) to come to the village to help him with his vendetta against Chrissie. She sends a DNA test off to prove Lawrence is not Chrissie's biological father. When the topic of marriage comes up Aaron is embarrassed when Robert jokingly dismisses the idea. After rejecting Rebecca's advances Robert confides in Victoria that he is going to propose to Aaron. Robert asks Paddy for his blessing to marry Aaron, but Paddy tells him that he's not good enough for Aaron. Rebecca meets Robert at the scrap yard to apologise for making advances towards him. Lachlan overhears their conversation and threatens to make false sexual abuse allegations against Robert. Aaron suddenly appears and shoves Lachlan's head into a barrel of water before warning him to stay away from Robert. Robert arranges to meet Aaron at a barn so he can propose. Aaron reveals he has Lachlan tied up in the boot of his car and Robert reprimands Aaron for his actions. Lachlan escapes and they are forced to give chase and stop him from falling off a cliff. Lachlan tells Aaron that Robert is sleeping with Rebecca. With Lachlan back in the boot, Robert admits to Aaron that he is bisexual and did have an affair with Rebecca before getting serious with Chrissie. Robert tells Aaron that when he was 15 he had a feelings for a male farmhand. Jack caught them together and beat Robert. They never spoke of it again and Robert admits to feeling like a disappointment to his father. Aaron tells Robert that he loves him and Robert decides to propose but realises he has left the ring in the car. While driving back to the village Aaron tells Robert that he doesn't think he will be enough for him after romancing Chrissie and Rebecca, then him. Robert angrily reveals that he was going to ask Aaron to marry him. Aaron takes his eyes off the road Robert yells for him to watch out and they crash into lake after Emma Barton pushing her husband James Barton  off which he lands on Ashley's car and causing a huge car crash involving Ashley, Pierce Harris, Rhona and Paddy."]}, {"page": "Diane Sugden", "response": ["Diane learns that Chrissie fitted Andy up for the attempted murder of her father Lawrence, knowing it was her son Lachlan White (Thomas Atkinson) who shot Lawrence. Furthermore, she is shocked to discover that Robert, Bernice, Victoria and Aaron all knew what the Whites had done, and that Robert had joined forces with Lawrence's other daughter, Rebecca White (Emily Head) to seek revenge on Chrissie. Diane throws a brick through the Home Farm window, resulting in Chrissie phoning the police and Diane being cautioned. However, before the police are called, Chrissie serves Diane, Doug and Bernice an eviction notice for Brook Cottage but after the police caution, Lawrence revokes the eviction notice. However, Diane decides to confront Lachlan, and when he insults Andy, Diane slaps him. The following day, Diane confronts Chrissie at Home Farm, and when she continues to refuse to listen to her, Diane threatens Chrissie with Lawrence's shotgun, which Lachlan films on his mobile phone to show the police. However, Chrissie informs Diane that she believes that Lachlan is dangerous and wanted to kill the family on purpose, upsetting Lachlan and ending her feud with Diane."]}, {"page": "BRIT School", "response": ["* Emily Head (actor)"]}, {"page": "Chas Dingle", "response": ["Chas returns from Prague to the shocking news that Aaron has been taking drugs in prison as well as the fact that Robert had sex with Rebecca White (Emily Head). Livid, Chas slaps him before ordering him to stay away from Aaron and Liv. Chas later slaps Rebecca for sleeping with Robert. The next day, Robert tells Chas that Aarons appeal was successful and he'll be released in a few weeks. At the prison, Chas is concerned about her son's fragile state of mind and decides to interject just as Robert is about to confess to Aaron about Rebecca. Back at the pub, she insists she only covered for him for Aaron's sake and warns him to make sure Rebecca doesn't say anything. While still awaiting Aaron's return from prison, Chas receives a phone call from Liv's aunt, who reveals that Liv's mother Sandra is in a coma after suffering an accident abroad. While reluctant, Chas opts to escort Liv to Ireland to see Sandra. Later in the year, Liv returns home while Chas remains in Ireland to look after a recovering Sandra."]}, {"page": "1988 in the United Kingdom", "response": ["* 15 December – Emily Head, English actress"]}, {"page": "Aaron Livesy", "response": ["Aaron finally vents his anger at his father and promises to take care of Liv. Aaron meets Chrissie's sister Rebecca White (Emily Head) and learns that Robert had had an affair with her while dating Chrissie in the past. Aaron overhears Chrissie's teenage son, Lachlan White (Thomas Atkinson), threatening to make false allegations of sexual abuse against Robert and warns him to stay away. Robert calms Aaron down and they later meet at a barn, where Aaron shows Robert that he has Lachlan tied up in the boot of his car. Lachlan escapes and they are forced to give chase and stop him falling over the edge of a cliff. Lachlan almost forces Aaron over until Robert pulls him off. Lachlan tells Aaron that Robert is having an affair with Rebecca. With Lachlan back in the boot, Aaron and Robert talk and Robert admits he is bisexual. While driving back to the village, Robert produces a ring and tells Aaron he was going to propose. Aaron takes his eyes off the road, but Robert yells at Aaron to watch out and he loses control of the car trying to avoid a pile-up on the road and they crash into a water-filled quarry. Aaron later accepts Robert's proposal and goes on to recover from his injuries. Robert continues to spend time with Rebecca, to help find evidence against the Whites and help Andy, who is on the run after being framed by Chrissie for attempting to murder Lawrence White (John Bowe), when in actuality Andy was framed by Chrissie in order to protect the true culprit, her son Lachlan.  Aaron tries to remain calm about it, but becomes envious over the amount of time the two of them are spending together and is distrustful of Rebecca."]}, {"page": "The Syndicate", "response": ["* Emily Head as Colette Andrews"]}, {"page": "Coram Boy (play)", "response": ["*Melissa / Angel - Emily Head / Mabel Moll"]}, {"page": "List of former Emmerdale characters", "response": ["| Rebecca White || Emily Head || 2016–2018"]}, {"page": "The Invisibles (TV series)", "response": ["Maurice's wife Barbara (Agutter), initially resistant to their plans, can't deny the positive effect it has on Maurice's demeanour.  Their daughter, Grace (Emily Head), is completely unaware how Dad made his money or what he does when he goes out for the evening.", "*Emily Head as Grace Riley"]}, {"page": "The Inbetweeners", "response": ["* Carli D'Amato (Emily Head) is Simon's main love interest. She demonstrates a good deal of influence over her peers, including school bullies. Although Carli expresses interest in Simon romantically on a few occasions, she seems aware that he is far more interested in her than she is in him."]}, {"page": "D'Amato", "response": ["*Carli D'Amato, a character from the British sitcom The Inbetweeners portrayed by Emily Head"]}, {"page": "List of Emmerdale characters (2004)", "response": ["Since, the character appears as part of storylines about Laurel Thomas' alcoholism, Alicia Metcalfe's (Natalie Anderson) sexual assault at the hands of Lachlan White (Thomas Atkinson), the hit-and-run death of Tess Harris (Nicola Stephenson), Harriet Finch's (Katherine Dow Blyton) stabbing, multiple teenage characters joyriding, Ross Barton's (Michael Parr) acid attack and Debbie's involvement in the attack, and the disappearance of Rebecca White (Emily Head)."]}, {"page": "List of The Inbetweeners characters", "response": ["| Carli D'Amato || colspan=\"4\" style=\"background:lightblue;\"| Emily Head || colspan=\"2\" style=\"background:white;\"|", "* Played by Emily Head"]}, {"page": "Head (surname)", "response": ["* Emily Head (born 1988), English actress"]}, {"page": "The Inbetweeners Movie", "response": ["* Emily Head as Carli D'Amato"]}, {"page": "List of British films of 2011", "response": ["|| Director: Ben Palmer   Cast: Simon Bird, Joe Thomas, James Buckley, Blake Harrison, Emily Head, Greg Davies, Anthony Head"]}, {"page": "Robot Chicken (season 6)", "response": ["Many celebrities have guest starred in Robot Chicken season 6; they include Whoopi Goldberg, Elizabeth Banks, Sam Elliott, Jason Sudeikis, Krysten Ritter, Fred Tatasciore, Jon Stewart, Stanley Tucci, Daniel Radcliffe, Patrick Stewart, Dan Milano, Victor Yerrid, Bill Farmer, Zeb Wells, Alex Borstein, Alan Tudyk, Christina Laskay, Tom Hiddleston, Ellie Kemper, Mark Hamill, Tamara Garfield, Liz Loza, Breckin Meyer, John Moschitta Jr., Britne Oldford, Rachel Bloom, Sarah Ramos, Dreama Walker, Rachael MacFarlane, Allison Janney, Kat Dennings, Liev Schreiber, Alex Winter, Shawn Patterson, Olivia Wilde, William Zabka, Ralph Macchio, Rhea Perlman, Ashley Eckstein, Lacey Chabert, Gillian Jacobs, Brent Spiner, Zachary Levi, J.B. Smoove, Lake Bell, Jon Bernthal, Nicholas Hoult, Robert Kirkman, Megan Hilty, Maurice LaMarche, Lucas Grabeel, Ke$ha, Sarah Chalke, Billy Zane, Sarah Michelle Gellar, Jim Hanks, Keith Ferguson, Patrick Pinney, Cat Taber, Linda Cardellini, Rachael Leigh Cook, George Lowe, David Hasselhoff, David Morse, Skeet Ulrich, Stan Lee, Melissa Joan Hart, Emily Head, Max Charles, Frank Welker, Freddie Prinze Jr., Seth MacFarlane, Lauren Ambrose, Delroy Lindo, Ben Schwartz, Kathryn Hahn, Clare Grant, Abraham Benrubi, Eden Espinosa, Madison Dylan, Michaela Watkins, Henry Winkler, Laura Ortiz, Ashley Chaney, Keith David, Quinton Flynn, Joss Whedon, Malin Åkerman, Eric McCormack, 50 Cent, Judy Greer and Matthew Lillard."]}, {"page": "Ross Barton", "response": ["Ross and Pete fight after the reveal, where Pete seemingly kills Ross and leaves his body in the woods. Parr confirmed that he had left the soap and a petition to reintroduce the character gained over 5,000 supporters. It was later revealed that the character is alive, with Parr stating that he liked the response to Ross' \"death\". The character later became involved in several of the show's major events, most significantly where Ross is revealed to have shot his enemy Robert Sugden (Ryan Hawley) in the Who Shot Robert Sugden? storyline; with Ross having formed a deal with Robert's adopted half-brother Andy (Kelvin Fletcher) that he would help kill his brother in exchange for Andy killing Pete, though Andy later changed his mind. In 2018, Ross became the subject of an acid attack in one of the show's most issued storylines and the character's most defying event. Parr researched extensively for the storyline. Parr's decision to leave the show was announced on 23 May 2018 and Ross departed on 2 November 2018, leaving the village to start anew with Robert's former sister-in-law Rebecca White (Emily Head) and their son Sebastian. For his portrayal of Ross Barton and through the character's story arc, Parr has received several award nominations - while critics have praised the character."]}, {"page": "List of Emmerdale characters (2014)", "response": ["Lawrence had an affair with Edna's husband Harold, during a time when homosexuality was illegal. Edna found out about the affair and reported him to the police. She believed Lawrence died in prison. In fact, Lawrence married a woman, Ellen, and had two daughters, Chrissie (Louise Marwood) and Rebecca (Emily Head). Lawrence moves into Home Farm and looks around the village. He meets Edna and is shocked. They talk and he reveals that after his prison sentence, he changed his ways and settled down. His daughter Chrissie and her fiancé Robert Sugden (Ryan Hawley), along with his grandson Lachlan (Thomas Atkinson), move into Home Farm. Lawrence shows resent towards Robert and tries to convince Chrissie to call off their engagement. Robert then stages a robbery, resulting in Lawrence suffering an angina attack. Lawrence and Robert then start to bond, after he believes that Robert saved him and Chrissie.", "Chrissie White (also Sugden) is played by Louise Marwood. She made her first on-screen appearance on 23 October 2014. The character and casting was announced on 4 October 2014. Her storylines have included: her turbulent relationship and later marriage to Robert; being caught up in a raid at Home Farm organised by Robert; defending her teenage son Lachlan White (Thomas Atkinson) when it is revealed that he sexually assaulted Alicia Metcalfe (Natalie Anderson); discovering that Robert has been having an affair with Aaron Livesy (Danny Miller); causing a helicopter crash which killed multiple residents; discovering that Lawrence White (John Bowe) is not her biological father; embarking on a relationship with Robert's adoptive brother Andy Sugden (Kelvin Fletcher); pulling a sick stunt by destroying and fitting Andy up for Lawrence's attempted murder when Lachlan shoots him after discovering that Andy had cheated on her; and her intense feud with her younger sister Rebecca White (Emily Head). Chrissie made her final on-screen appearance on 11 January 2018, after being killed off in a car accident involving the entire White family.", "Lachlan supports Belle as she confides in him about her relationship with a married man, Dr. Jermaine Bailey (Micah Balfour). Fearing that Belle is being used by Dr. Bailey, Lachlan takes drastic action and trashes his house but Belle leaves her bag behind and is thus suspected of trashing the house herself. Belle confronts Lachlan about what he did and he lets slip that he is in love with her. In October 2016, Lachlan gets kidnapped by Aaron after Lachlan threatens to lie and tell everybody that Robert sexually abused him. Aaron and Robert took Lachlan to the quarry when he escape and Aaron and Robert chase him. Lachlan nearly pushes Aaron over but Robert grabs him. Lachlan tells Aaron that Robert used to sleep with his aunt Rebecca White (Emily Head), when he was engaged to Chrissie. Aaron and Robert put Lachlan back in the car boot. Later, Robert and Aaron have a chat when they see Ashley's wrecked car. Aaron avoids hitting the car but crashes into a lake. Robert rescues Aaron and went back for Lachlan who managed to make his own escape. Robert comes out of the lake and gets angry with Lachlan. Robert threatens Lachlan if Aaron dies, he will come after him however, Aaron survives. A week after, Lachlan lies to his family where he was, making them unaware that Lachlan was involved in the crash that killed James Barton (Bill Ward)."]}, {"page": "Chrissie White (Emmerdale)", "response": ["Chrissie White (also Sugden) is a fictional character from the British ITV soap opera Emmerdale, played by Louise Marwood. She made her first screen appearance on 23 October 2014. The character and casting was announced on 4 October 2014. The character was the fiancé of established character Robert Sugden (Ryan Hawley), who announced the character to return to the series after five years. Her storylines have included: her turbulent relationship and later marriage to Robert; being caught up in a raid at Home Farm organised by Robert; defending her teenage son Lachlan (Thomas Atkinson) when it is revealed that he sexually assaulted Alicia Metcalfe (Natalie Anderson); discovering that Robert has been having an affair with Aaron Livesy (Danny Miller); accidentally causing a helicopter crash which killed multiple residents; discovering that Lawrence (John Bowe) is not her biological father; embarking on a relationship with Robert's adoptive brother Andy (Kelvin Fletcher), which ended with Chrissie fitting up and destroying Andy for Lawrence's attempted murder when Lachlan shoots him after discovering that Andy had cheated on her; and her intense feud with her younger sister Rebecca (Emily Head). Chrissie was killed-off, alongside Lawrence, in a previously unannounced departure on 11 January 2018, after being involved in a car accident involving the entire White family caused by Lachlan.", "Chrissie moves into Home Farm with her father Lawrence (John Bowe) and teenage son Lachlan (Thomas Atkinson). Upon her arrival, she realises her fiancé Robert Sugden (Ryan Hawley) previously had a life in Emmerdale and has unfinished business with his family. She becomes relieved when her father Lawrence and Robert manage to get along, after Lawrence had an angina attack when Home Farm was robbed, which Chrissie and Robert were also caught up in. Chrissie begins making wedding plans and becomes unhappy when her half-sister Rebecca (Emily Head) is unable to book a flight in time for the wedding."]}, {"page": "Carli (given name)", "response": ["*Carli D'Amato, a character from British sitcom The Inbetweeners portrayed by Emily Head"]}]}}