{"wiki_id": "http://www.wikidata.org/entity/Q9011330", "itemLabel": "Jayne Casey", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jayne_Casey", "wikipedia_page": {"main": "Jayne Casey (born 1956, in Wallasey, Cheshire) is an English artistic director who was known for being involved in the Liverpool punk and new wave scene in the 1970s and 1980s, with Big in Japan, Pink Military and Pink Industry. A Keychange Inspiration Award was presented to Casey at Liverpool Sound City.", "link_mentions": [{"page": "The Clash", "response": ["While the Sex Pistols’ debut gig at Manchester’s Lesser Free Trade Hall has been acknowledged as the starting point of that city’s punk scene, The Clash’s first gig at Eric’s, supported by The Specials, served as a similar watershed for Liverpool. The gig was witnessed by Jayne Casey, Julian Cope, Pete Wylie, Pete Burns, Bill Drummond, Holly Johnson, Will Sergeant, Budgie, and Ian McCulloch, who went on to form Big in Japan, The Teardrop Explodes and Echo & The Bunnymen amongst other bands."]}, {"page": "K Foundation Burn a Million Quid", "response": ["During the first half of 1994, the K Foundation attempted to interest galleries in staging Money: A Major Body of Cash, but even old friend Jayne Casey, director of the Liverpool Festival Trust, was unable to persuade a major gallery to participate. The Tate, in Liverpool, wanted to be part of the 21st Century Festival I'm involved with,' says Casey. 'I suggested they put on the K Foundation exhibition; at first they were encouraging, but they seemed nervous about the personalities involved.' A curt fax from [...] the gallery curator informed Casey that the K Foundation's exhibition of money had been done before and more interestingly\", leaving Drummond and Cauty obliged to pursue other options. The duo considered taking the exhibition across the former Soviet Union by train and on to the United States, but no insurer would touch the project. An exhibition at Kilmainham Jail in Dublin was then considered, but no sooner had a provisional August date been set for it than the duo changed their minds yet again. \"Jimmy said: 'Why don't we just burn it?' remembers Drummond. 'He said it in a light-hearted way, I suppose, hoping I'd say: 'No, we can't do that, let's do this...' But it seemed the most powerful thing to do.\" Cauty: \"We were just sitting in a cafe talking about what we were going to spend the money on and then we decided it would be better if we burned it. That was about six weeks before we did it. It was too long, it was a bit of a nightmare.\""]}, {"page": "Bill Drummond", "response": ["After absconding from the Illuminatus! production in London, Drummond returned to Liverpool and co-founded the band Big in Japan. Other members included Holly Johnson (Frankie Goes to Hollywood), Budgie (Siouxsie and the Banshees), Jayne Casey (Pink Military/Pink Industry) and Ian Broudie (The Lightning Seeds). After the band's demise, Drummond and another member, his best friend David Balfe, founded Zoo Records. Zoo's first release was Big in Japan's posthumous EP, From Y To Z and Never Again. They went on to act as producers of the debut albums by Echo & the Bunnymen and The Teardrop Explodes, both of which Drummond would later manage somewhat idiosyncratically. With Zoo Music Ltd, Drummond and Balfe were also music publishers for Zodiac Mindwarp and The Love Reaction and The Proclaimers. The production team of Drummond and Balfe was christened The Chameleons, who recorded the single \"Touch\" together with singer Lori Lartey as Lori and the Chameleons passim. and were involved with the production on Echo & the Bunnymen's debut album, released on the Korova label."]}, {"page": "K Foundation", "response": ["During the first half of 1994, the K Foundation attempted to interest galleries in staging Money: A Major Body Of Cash. However, even old friend Jayne Casey, director of the Liverpool Festival Trust, was unable to persuade a major gallery to participate. \"'The Tate, in Liverpool, wanted to be part of the 21st Century Festival I'm involved with,' says Casey. 'I suggested they put on the K Foundation exhibition; at first they were encouraging, but they seemed nervous about the personalities involved.' A curt fax from... the gallery curator, informed Casey that the K Foundation's exhibition of money had been done before and more interestingly\", leaving Drummond and Cauty obliged to pursue other options. The duo considered taking the exhibition across the former Soviet Union by train and on to the United States, but no insurer would touch the project. Then an exhibition at Dublin's Kilmainham Jail was considered. No sooner had a provisional date of August been set for the exhibition, however, when the duo changed their minds yet again. \"Jimmy said: 'Why don't we just burn it?' remembers Drummond. 'He said it in a light-hearted way, I suppose, hoping I'd say: 'No, we can't do that, let's do this...' But it seemed the most powerful thing to do.\" Cauty: \"We were just sitting in a cafe talking about what we were going to spend the money on and then we decided it would be better if we burned it. That was about six weeks before we did it. It was too long, it was a bit of a nightmare.\""]}, {"page": "Big in Japan (band)", "response": ["Coming from the same Merseyside scene which would produce Echo & the Bunnymen, The Teardrop Explodes, OMD, and Dalek I Love You, Big In Japan started off playing gigs around Liverpool, such as Ruffwood School in Kirkby along with Wah! Heat, but most notably at Eric's Club. Their stage show was unique: lead singer Jayne Casey would perform with a lampshade over her shaved head, guitarist Bill Drummond played in a kilt and bassist Holly Johnson performed in a flamboyant manner which he would later take further in Frankie Goes to Hollywood.", "As an initial idea of Deaf School's Clive Langer, his friend Bill Drummond (guitar, vocals), Kevin Ward (bass, vocals) and Phil Allen (drums), formed the band in May 1977, playing only three gigs, the first of them at Bretton Hall College, in Yorkshire. In August, the line-up grew, joining Jayne Casey (vocals), Ian Broudie (guitar) and Clive Langer (guitar), who quit in September, but not before the band recorded their first song released, \"Big In Japan\", which appeared in the 7\" single compilation Brutality Religion and a dance beat, released the same year. In October, Ambrose Reynolds joined to replace Ward who then left that December, but Reynolds himself quit shortly afterwards and was replaced by Holly Johnson.Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 12 In January 1978, Budgie (previously in The Spitfire Boys and later member of The Slits and Siouxsie and the Banshees) replaced Allen on drums, and in early June, Johnson was sacked and replaced with ex-Deaf School Steve Lindsey, who was replaced in July by Dave Balfe (previously in Dalek I Love You), the last member to join.Frame, Pete. Rock Family Tree. 1980", "Jayne Casey later states:", "* Jayne Casey – vocals (1977–1978, 1979)"]}, {"page": "Wallasey", "response": ["* Jayne Casey (b 1956), singer (member of Big In Japan)"]}, {"page": "List of bands and artists from Merseyside", "response": ["*Big in Japan: 1970s punk band that launched the careers of Budgie, Ian Broudie, Bill Drummond, David Balfe, Jayne Casey and Holly Johnson"]}, {"page": "Zoo Records", "response": ["* Track A1 – previously unreleased. Recorded T.W. Studios October 1977. Licensed from Warner Bros. Music Ltd. Big in Japan: Jayne Casey, Kevin Ward, Bill Drummond, Ian Broudie, Holly Johnson and Phil Allan."]}, {"page": "Fuck the Millennium", "response": ["Also in 1997, British artist Jeremy Deller launched his Acid Brass concept, collaborating with the Williams Fairey Brass Band to interpret and perform classic acid house tracks as brass arrangements. Deller was described by one source as a prankster, a notion frequently applied to Drummond and Cauty themselves. In February 1997, Drummond was contacted by his former Big in Japan bandmate Jayne Casey, who was helping to organise an arts festival in Liverpool and had noticed that Acid Brass' repertoire included the KLF's \"What Time Is Love?\". Drummond attended the festival performance and heard \"What Time Is Love?\" performed as the encore, during which he excitedly telephoned Cauty. Cauty and Drummond together attended a 19 April Acid Brass performance at the Queen Elizabeth Hall, London. Collaborative work ensued between Drummond, Cauty, and Deller, in which the Acid Brass rendition of their track was incorporated into a millennium-themed composition designed to mark the tenth anniversary of Drummond and Cauty's first work."]}, {"page": "Jayne", "response": ["*Jayne Casey (born 1956), English artistic director"]}, {"page": "20 Mothers", "response": ["The album cover photograph was taken by Jill Furmanovsky and features 20 actual mothers, all of whom are family and friends of Cope. Some of those pictured are Cope's wife, mother and mother-in-law; wives and girlfriends of Cope collaborators James Eller, Rooster Cosby, Tony \"Doggen\" Foster and Richard Frost; former Zoo Records cohort Pam Young; and Jayne Casey.\"Julian Cope – Who are the 20 mothers?\" Select magazine. November 1995. Retrieved 13 June 2018. On the back, Cope is pictured with his daughters Albany and Avalon."]}, {"page": "Jayne (singer)", "response": ["#REDIRECT Jayne Casey"]}, {"page": "Ambrose Reynolds", "response": ["Reynolds began making music as a chorister at Liverpool Cathedral at the age of 7. A few years later, he teamed up with David Knopov in a street busking band called The O'Boogie Brothers. The O'Boogie Brothers expanded its membership to include Ian Broudie on guitar and Nathan McGough (later to manage the Happy Mondays). With a new 6 piece line-up, they became a proper band after supporting legendary Liverpool band Deaf School on Christmas Eve 1976 at Eric's Club, Mathew St, Liverpool. The O'Boogie Brothers eventually split in 1977. After a short stint playing with various Liverpool bands including the infamous Big in Japan with Jayne Casey and Ian Broudie, Reynolds teamed up with David Knopov to put a new band together.", "Reynolds teamed up again with Jayne Casey, to form an experimental electronic pop group Pink Industry. Reynolds and Casey also formed their own record company, Zulu Records, releasing many records between 1981 and 1985. Pink Industry released Fort-Five EP (1981), Low Technology (1982), Who Told You You Were Naked? (1982), What I Wouldn't Give EP (1983), New Beginnings (1984), Cruel Garden EP (1984), and Don't Let Go (1985, produced by Ian Broudie)."]}, {"page": "Brutality, Religion and a Dance Beat", "response": ["The side-A song, \"Big in Japan\", is an eponymous song of the band Big in Japan. It is a power pop/punk oriented song, in which the singer, Jayne Casey, sings only the song's title, plus a chorus. The band comprised future and past successful musicians Jayne Casey, guitarists Bill Drummond (later with The KLF), Ian Broudie (later of Care and The Lightning Seeds) and Clive Langer (of Deaf School), bassist Kev Ward and drummer Phil Allen.", "* Jayne Casey – lead vocals"]}, {"page": "Soulstream (Holly Johnson album)", "response": ["*Alan Munroe, Clare Johnson, Jack Jones, Jayne Casey, Joel Jones, Wolfgang Kuhle – \"I love you\" vocals on \"All U Need is Love\""]}, {"page": "Pink Military", "response": ["thumb|Jayne Casey, at Eric's - Liverpool 1978", "Pink Military (originally Pink Military Stand Alone) were a post-punk band from Liverpool. Led by former Big in Japan singer Jayne Casey, other band members included former Deaf School drummer Tim Whitaker, guitarist Martin Dempsey who also played in Yachts and It's Immaterial and drummers Chris Joyce (who also played in The Durutti Column and Simply Red) and Budgie (who went on to The Slits and Siouxsie and the Banshees).", "After Big In Japan split up in summer 1978, singer Jayne Casey formed Pink Military along with John Highway (guitar), Wayne Wadden (bass guitar), Paul Hornby (drums), and Nicky Cool (born Nicky Hillon, keyboards).Larkin, Colin (2002) The Virgin Encyclopedia of 70s Music, MUZE UK Ltd, , p. 337Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 454 The band mixed punk-influenced rock with elements of disco and reggae.Kellman, Andy \"Pink Military Biography\", Allmusic, retrieved 2011-05-12 Their first release was the \"Buddha Waking / Disney Sleeping\" single in February 1979. This was the only release from the original line-up, as in the months that followed Wadden, Hornby and Highway all left, with Peter Lloyd, Steve Torch, Tim Whitaker (ex-Deaf School), and Martin Dempsey (formerly of Yachts) making up the next settled line-up. The band were then picked up by the 'Eric's' label (associated with the club of the same name), with the Blood and Lipstick EP released in September that year. Further line-up changes followed, with Whitaker and Torch replaced by Mothmen drummer Chris Joyce, Charlie Gruff (Charlie Griffiths), and Neil Innes. John Peel gave the band his support and they recorded two sessions for his BBC Radio 1 show, the first in November 1979, featuring Budgie on drums, the second in May 1980.\"Pink Military\", Keeping It Peel, BBC, retrieved 2011-05-12 The band's only album, Do Animals Believe in God? was released in June 1980, with the band having signed a deal with Virgin Records who acted as distributors.Hanson, Amy \"Do Animals Believe in God? Review\", Allmusic, retrieved 2011-05-12Buckley, Peter (2003) The Rough Guide to Rock, Rough Guides, , p. 793 A further single was released the next month, and proved to be the final release before the band split up in 1981. Casey went on to form Pink Industry, while Dempsey joined It's Immaterial and later the Mel-o-Tones. Joyce joined The Durutti Column and later played in Simply Red."]}, {"page": "Pink Industry", "response": ["Pink Industry were a post-punk band from Liverpool formed by Jayne Casey after her previous band Pink Military split up in 1981.", "When Pink Military split up in 1981, singer Jayne Casey formed the more electronically oriented band Pink Industry along with Ambrose Reynolds (who had played with Casey in Big in Japan in the 1970s, and was an early member of Frankie Goes to Hollywood), the duo initially using several other musicians, later becoming a trio with the addition of Tadzio Jodlowski.Larkin, Colin (2002) The Virgin Encyclopedia of 70s Music, MUZE UK Ltd, , p. 337Strong, Martin C. (2003) The Great Indie Discography, Canongate, , p. 454Kellman, Andy \"Pink Industry Biography\", Allmusic, retrieved 2011-05-13 The band's sound was described by Trouser Press as \"like Siouxsie Sioux fronting Japan\".Grant, Steven & Robbins, Ira \"Pink Military/Pink Industry\", Trouser Press, retrieved 2011-05-13 The band's first release was the Forty-Five EP featuring lead track \"Is This The End?\", released in February 1982. The band's debut album, Low Technology, was released the following year, reaching number 12 on the UK Independent Chart. A second album, Who Told You You Were Naked, followed later the same year, and peaked at number nine on the Indie chart. Between 1982 and 1984, the band recorded four sessions for John Peel's BBC Radio 1 show.\"Pink Industry\", Keeping It Peel, BBC, retrieved 2011-05-13 After a two-year gap since their previous release, the band returned in 1985 with the New Beginnings album. A final single was released in late 1987, the band splitting up around the same time. Casey subsequently concentrated on a television career. In January, 28th, 2012, Pink Industry (Jayne, Ambrose and support band) reunited for an exclusive concert in São Paulo, Brazil, in Cine Joia venue."]}, {"page": "Ken Testi", "response": ["Before it closed in March 1980, many new local acts had been encouraged to take to the stage for the first time including Jayne Casey, Bill Drummond, Ian Broudie and Holly Johnson (Big in Japan), Paul Rutherford and Budgie (The Spitfire Boys) and Pete Wylie."]}, {"page": "Do Animals Believe in God?", "response": ["*Jayne Casey - vocals"]}]}}