{"wiki_id": "http://www.wikidata.org/entity/Q902986", "itemLabel": "Edward Weston", "itemDescription": "United States chemist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Weston_(chemist)", "wikipedia_page": {"main": "Edward Weston (May 9, 1850 – August 20, 1936) was an English-born American chemist and engineer noted for his achievements in electroplating and his development of the electrochemical cell, named the Weston cell, for the voltage standard. Weston was a competitor of Thomas Edison in the early days of electricity generation and distribution.", "link_mentions": [{"page": "Ammeter", "response": ["The D'Arsonval galvanometer is a moving coil ammeter. It uses magnetic deflection, where current passing through a coil placed in the magnetic field of a permanent magnet causes the coil to move. The modern form of this instrument was developed by Edward Weston, and uses two spiral springs to provide the restoring force. The uniform air gap between the iron core and the permanent magnet poles make the deflection of the meter linearly proportional to current. These meters have linear scales.  Basic meter movements can have full-scale deflection for currents from about 25 microamperes to 10 milliamperes."]}, {"page": "May 9", "response": ["*1850 – Edward Weston, English-American chemist (d. 1936)"]}, {"page": "Galvanometer", "response": ["===Edward Weston===", "Edward Weston extensively improved the design of the galvanometer. He substituted the fine wire suspension with a pivot and provided restoring torque and electrical connections through spiral springs rather than through the traditional wristwatch balance wheel hairspring. He developed a method of stabilizing the magnetic field of the permanent magnet, so the instrument would have consistent accuracy over time. He replaced the light beam and mirror with a knife-edge pointer that could be read directly. A mirror under the pointer, in the same plane as the scale, eliminated parallax observation error. To maintain the field strength, Weston's design used a very narrow circumferential slot through which the coil moved, with a minimal air-gap. This improved linearity of pointer deflection with respect to coil current. Finally, the coil was wound on a light-weight form made of conductive metal, which acted as a damper. By 1888, Edward Weston had patented and brought out a commercial form of this instrument, which became a standard electrical equipment component. It was known as a \"portable\" instrument because it was affected very little by mounting position or by transporting it from place to place. This design is almost universally used in moving-coil meters today."]}, {"page": "Weston", "response": ["* Weston Electrical Instrument Corporation, a company founded by Edward Weston "]}, {"page": "Film speed", "response": ["Before the advent of the ASA system, the system of Weston film speed ratings was introduced by Edward Faraday Weston (1878–1971) and his father Dr. Edward Weston (1850–1936), a British-born electrical engineer, industrialist and founder of the US-based Weston Electrical Instrument Corporation, with the Weston model 617, one of the earliest photo-electric exposure meters, in August 1932. The meter and film rating system were invented by William Nelson Goodwin, Jr., who worked for them and later received a Howard N. Potts Medal for his contributions to engineering."]}, {"page": "Oswestry", "response": ["* Edward Weston (1850 in Oswestry – 1936) chemist, Weston, The Company and The Man. Retrieved 17 March 2018. developed electroplating and the Weston cell in the USA"]}, {"page": "New Jersey Institute of Technology", "response": ["New Jersey Institute of Technology (NJIT) is a public research university in Newark, New Jersey with a degree-granting satellite campus in Jersey City. Founded in 1881 with the support of local industrialists and inventors especially Edward Weston,  NJIT opened as Newark Technical School in 1885 with 88 students. The school grew into a classic engineering college – Newark College of Engineering – and then, with the addition of a School of Architecture in 1973, into a polytechnic university that now hosts five colleges and one school. As of fall 2020, the university enrolls about 11,600 students, 2,000 of whom live on campus.", "Included among NJIT's information resources are the university's historical archive including items developed and manufactured by Edward Weston, a scientist, prolific inventor, and a founding member of the board of trustees of the university. Dr. Weston's collection of artifacts and rare books is housed in the Van Houten Library and is available to scholars interested in the history of science and technology.", "* Edward Weston, (deceased) prominent member of the founding board of trustees; co-founder of the Weston Electric Light Company; holder of 334 US patients. Awards include: the Elliott Cresson Medal (1910), the Franklin Medal (1924), and the IEEE Lamme Medal."]}, {"page": "West Midlands (region)", "response": ["Edward Weston of Oswestry, who emigrated to the US, built the first accurate voltmeter in the late 1880s, and the Weston cell in 1893."]}, {"page": "Scientific phenomena named after people", "response": ["* Weston cell – Edward Weston"]}, {"page": "Constantan", "response": ["In 1887, Edward Weston discovered that metals can have a negative temperature coefficient of resistance, inventing what he called his \"Alloy No. 2.\" "]}, {"page": "American Institute of Electrical Engineers", "response": ["The 1884 founders of the Institute of Electrical Engineers (AIEE) included some of the most prominent inventors and innovators in the then new field of electrical engineering, among them Thomas Alva Edison, Nikola Tesla, Elihu Thomson, Edwin J. Houston, and Edward Weston.  The purpose of the AIEE was stated  \"to promote the Arts and Sciences connected with the production and utilization of electricity and the welfare of those employed in these Industries: by means of social intercourse, the reading and discussion of professional papers and the circulation by means of publication among members and associates of information thus obtained.\" The first president of AIEE was Norvin Green, president of the Western Union Telegraph Company.  Other notable AIEE presidents were Alexander Graham Bell (1891–1892), Charles Proteus Steinmetz (1901–1902), Bion J. Arnold (1903-1904),  Schuyler S. Wheeler (1905–1906), Dugald C. Jackson (1910–1911), Ralph D. Mershon (1912–1913), Michael I. Pupin (1925–1926), and Titus G. LeClair (1950–1951)."]}, {"page": "University Heights, Newark", "response": ["Rutgers and NJIT were expanded considerably beginning in the 1960s.  Prior to this expansion, University Heights was a relatively affluent residential neighborhood of Newark. The area has one of Newark's few concentrations of brownstones. The gym at Essex County College was home of the American Basketball Association team, the Newark Express, which moved to Drew University and became the Jersey Express after averaging some 150 fans per game in Newark, though it attracted even fewer at Drew.Santiago, Katherine. \"Jersey Express to play at East Orange high school gym for upcoming season\", The Star-Ledger, August 26, 2009. Accessed April 16, 2012 .\"The Express moved in 2007 to Morris County after two years in Newark as the Newark Express. Team officials hoped for a surge in attendance above the average 150 fans a game they drew at Essex County College.\"  The area is home to the Paul Robeson Galleries at Rutgers UniversityPaul Robeson Galleries, Rutgers University. Accessed April 16, 2012. and the Weston Museum in the Van Houten Library at NJIT, which includes artifacts from inventor Edward Weston, an early challenger of Thomas Edison.The Weston Museum , New Jersey Institute of Technology. Accessed April 16, 2012."]}, {"page": "Timeline of solar cells", "response": ["* 1888 - Edward Weston receives patent US389124, \"Solar cell,\" and US389125, \"Solar cell.\""]}, {"page": "History of Newark, New Jersey", "response": ["The middle 19th century saw continued growth and diversification of Newark's industrial base. The first commercially successful plastic — Celluloid — was produced in a factory on Mechanic Street by John Wesley Hyatt. Hyatt's Celluloid found its way into Newark-made carriages, billiard balls, and dentures. Dr. Edward Weston perfected a process for zinc electroplating, as well as a superior arc lamp in Newark. Newark's Military Park had the first public electric lamps anywhere in the United States. Before moving to Menlo Park, Thomas Edison himself made Newark home in the early 1870s. He invented the stock ticker in the Brick City., p.181."]}, {"page": "Manganin", "response": ["Manganin is a trademarked name for an alloy of typically 84.2% copper, 12.1% manganese, and 3.7% nickel. It was first developed by Edward Weston in 1892, improving upon his Constantan (1887).", "In 1887 Edward Weston discovered that metals can have a negative temperature coefficient of resistance, inventing what he called his \"Alloy No. 2.\" "]}, {"page": "Beatrice Hicks", "response": ["Beatrice Hicks was born in 1919 in Orange, New Jersey, to William Lux Hicks, a chemical engineer, and Florence Benedict. Hicks decided at an early age that she wished to be an engineer. While her parents neither supported nor opposed Hicks' desired career path, some of her teachers and classmates tried to discourage her from becoming an engineer, viewing it as a socially unacceptable role for a woman. She graduated from Orange High School in 1935 and received a bachelor's degree in chemical engineering from Newark College of Engineering (now New Jersey Institute of Technology) in 1939, one of only two women in her class. During college, Hicks worked in the treasury office of an Abercrombie & Fitch store as a telephone operator, and in the university's library. After receiving her undergraduate degree, Hicks stayed at Newark College of Engineering for three years as a research assistant, where she studied the history of Edward Weston's inventions and took additional classes at night."]}, {"page": "Weston cell", "response": ["thumb|right|alt=Woodcut line drawing of H-shaped cell in an enclosure with electrical terminals at the top.|Drawing from Edward Weston's US Patent 494827 depicting the standard cell.", "The Weston standard cell is a wet-chemical cell that produces a highly stable voltage suitable as a laboratory standard for calibration of voltmeters. Invented by Edward Weston in 1893, it was adopted as the International Standard for EMF from 1911 until superseded by the Josephson voltage standard in 1990."]}, {"page": "List of English inventions and discoveries", "response": ["*1893: The Weston cell developed by England-born chemist Edward Weston (1850–1936).History of Weston Aerospace, Weston – the Man (1850–1936)"]}, {"page": "Edward Weston (disambiguation)", "response": ["Edward Weston (1886–1958) was an American photographer and co-founder of Group f/64.", "Edward Weston may also refer to:", "* Edward Weston (priest) (1566–1635), English Roman Catholic controversialist", "* Edward Weston (politician) (1703–1770), English didactic writer and politician", "* Edward Weston (chemist) (1850–1936), English chemist who migrated to Newark, New Jersey and developed electroplating", "* Edward Weston (pastoralist), former officer of the East India Company who arrived in Australia in 1825", "* Edward Weston (archer) (1846–1918), American archer"]}, {"page": "List of people from Montclair, New Jersey", "response": ["* Edward Weston (1850–1936), electrical engineer and inventor whose Weston Electrical Instrument Company won the contract to illuminate the Brooklyn BridgeStaff. \"Dr. Edward Weston Is 85.\", The New York Times, May 10, 1935. Accessed April 16, 2012. \"Montclair, N. J., May 9. – Dr. Edward Weston, scientist and inventor, whose contributions to the advancement of electrical engineering during the last half century have gained for him world-wide renown, celebrated his eighty-fifth birthday today with a dinner ar his home 37 North Mountain Avenue, here.\""]}, {"page": "List of British innovations and discoveries", "response": ["*Weston cell – Edward Weston (chemist)"]}, {"page": "James Street Commons Historic District", "response": ["*Edward Weston - chemist and engineer, competitor with Thomas Edison"]}, {"page": "Weston Museum (New Jersey)", "response": ["The Weston Museum is located within the Van Houten Library at the New Jersey Institute of Technology in the University Heights section of Newark, New Jersey. The small museum contains items developed and manufactured by Edward Weston, as well as instruments and devices from his laboratory. A contemporary of Thomas Edison, Weston was a scientist, an inventor, and a founding member of the board of trustees of the university and the Weston Electric Company. Dr. Weston's rare book collection is also maintained available to scholars and others interested in the history of science and technology."]}, {"page": "Marcellus Hartley", "response": ["Hartley also became involved with the early development and application of electrical generation and supply.  He invested heavily in the United States Electrical Lighting Company (USELC), working with inventors such as Hiram Maxim, and using the designs of Edward Weston and Moses G. Farmer.  USELC eventually became part of the Westinghouse Company with Hartley on the board of directors."]}]}}