{"wiki_id": "http://www.wikidata.org/entity/Q902632", "itemLabel": "David Howland", "itemDescription": "footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Howland", "wikipedia_page": {"main": "David Howland (born 17 September 1986) is a Northern Irish former professional footballer who played as a midfielder. He scored 17 goals in 171 league a cup appearances in an eleven-year career in professional and semi-professional football in England and Northern Ireland.\nA Northern Ireland under-21 international, he started his career at Birmingham City. In January 2008, he was loaned out to Port Vale, and joined the club on a permanent basis at the end of the season. He was released by Port Vale in the summer of 2010, at which point he signed with Glentoran. He helped the club to win the Irish Cup in 2013, before he retired due to injury in August 2016.", "link_mentions": [{"page": "Ballynahinch, County Down", "response": ["*David Howland, professional footballer, was born in Ballynahinch in 1986"]}, {"page": "Birmingham City F.C. Reserves and Academy", "response": ["David Howland (Northern Ireland U-21),"]}, {"page": "2007–08 Birmingham City F.C. season", "response": ["Birmingham also decided to release youth players Asa Hall, David Howland, Adam Legzdins and Stefan Milojević, McLeish chose not to pursue the purchase of loanee Rafael Schmitz, and Daniël de Ridder's contract was cancelled by mutual consent at the end of June; he joined Wigan the following day. The club were unable to agree a new contract with top scorer Mikael Forssell, and chose not to take up their two-year option, so he left for Hannover 96 on a free transfer under the Bosman ruling. Fabrice Muamba, the club's Young Player of the Year in 2006–07, signed for Bolton Wanderers for an initial £5m fee, with an extra £750,000 potentially payable in add-ons.", "| 30 June 2008 || David Howland || Released || (Port Vale)", "| David Howland || Port Vale || End of season", "!scope=\"row\"|David Howland"]}, {"page": "Jordon Mutch", "response": ["While still a schoolboy, aged 15 years 298 days, Mutch was selected in the 16-man squad for Birmingham's League Cup third-round match against Blackburn Rovers at Ewood Park in September 2007. The Premier League confirmed that match rules permitted selection of a player of that age, but changed their minds only hours before the match after becoming aware of the Football Association's Child Protection regulations which specified a minimum age of 16 for players in open-age football. Reserve player David Howland, who was not registered with a Premier League squad number, had to travel to Blackburn at the last minute with special dispensation to take Mutch's place on the bench wearing an unnumbered shirt."]}, {"page": "Dave Howland", "response": ["#REDIRECT David Howland"]}, {"page": "2005–06 Birmingham City F.C. season", "response": ["!scope=\"row\"| David Howland"]}, {"page": "2007–08 Port Vale F.C. season", "response": ["In January, goalkeeper Mark Goodlad was forced to retire due to injury, and young Joe Anyon faced criticism from the fans for his performances. Adam Eckersley then returned to the club after his release from Manchester United, as Sinnott's first non-loan signing. Sinnott then signed Dave Mulligan from Scunthorpe United on a short-term contract. Midfielder David Howland also arrived on loan from Birmingham City, and would join the club permanently at the end of the season. Fellow Birmingham player Krystian Pearce also signed on loan, though would impress enough to win a longer stay with Birmingham. Sinnott then raided another Birmingham club, this time Aston Villa, to bring Australian teenager Chris Herd on a one-month loan, as well as Swedish youngster Tobias Mikaelsson. He also allowed Rocastle to join Gillingham on a two-week loan. Sinnott also completed the signings of Chasetown pair Chris Slater and Kyle Perry, who left their jobs to become full-time professional footballers. In February, O'Loughlin was loaned out to Hinckley United. After the club lost a 2–0 lead at Victoria Park to lose 3–2 against Hartlepool United, club legend Jon McCarthy questioned the team's mental strength. In April, Craig Rocastle's contract was terminated by mutual consent, and he moved to play for Greek club Thrasyvoulos. Teenage goalkeeper Chris Martin made his debut on 19 April, as Vale were on the end of a 6–0 defeat by Swindon Town at The County Ground. Despite just two defeats in the final ten games of the season, Vale had long been relegated.", "|align=\"left\"|MF||34||align=\"left\"| David Howland", "|–||MF||||34||David Howland||1||0||0||0||1", "| 23 January 2008 || MF ||  || David Howland || Birmingham City || 23 April 2008 || "]}, {"page": "2008–09 Port Vale F.C. season", "response": ["|align=\"left\"|MF||8||align=\"left\"| David Howland", "|–||MF||||8||David Howland||2||1||0||0||3", "|8||||MF||David Howland||6||0||0||0||0||0||0||0||6||0", "| May 2008 || MF ||  || David Howland || Birmingham City || Free transfer || "]}, {"page": "2009–10 Port Vale F.C. season", "response": ["At the end of the season Joe Anyon was offered a new contract at Vale Park on reduced pay, but instead signed with Lincoln City. Chris Martin signed a new two-year contract, which came with an increase in wages. Released players moved on to other clubs: Luke Prosser (Southend United); Simon Richman and Danny Glover (Worcester City); David Howland (Glentoran);  and James Lawrie (AFC Telford United). Ross Davidson also joined Stafford Rangers, after having spent much of the season loan at the club, as well as a brief time at Nantwich Town. Geoff Horsfield retired as a player to concentrate on his role as assistant manager.", "|align=\"left\"|MF||8||align=\"left\"| David Howland", "|8||||MF||David Howland||1||0||0||0||0||0||0||0||1||0", "| April 2010 || MF ||  || David Howland ||  Glentoran || Released || "]}, {"page": "Howland (surname)", "response": ["*David Howland (born 1986), Northern Irish footballer"]}, {"page": "Howland, David", "response": ["#redirectDavid Howland"]}]}}