{"wiki_id": "http://www.wikidata.org/entity/Q907456", "itemLabel": "Fred Gallagher", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Gallagher_(co-driver)", "wikipedia_page": {"main": "Fred Gallagher (born 16 April 1952 in Belfast) is a World Rally Championship winning co-driver and motorsport personality.\n\n", "link_mentions": [{"page": "Toyota Celica", "response": ["|  Fred Gallagher", "|  Fred Gallagher", "|  Fred Gallagher", "|  Fred Gallagher"]}, {"page": "Henri Toivonen", "response": ["At 24 years and 86 days, he remained the youngest driver to win a WRC event until his countryman Jari-Matti Latvala won the 2008 Swedish Rally at the age of 22. Latvala stated that \"It's a super feeling, it's almost unbelievable. Henri (Toivonen) was one of my idols and secretly I've always wanted to beat his record as the youngest winner.\" Over 20 years after the 1980 RAC, Paul White (nicknamed \"Chalkie\" by Toivonen) commented that he still receives questions about the rally and Henri Toivonen. He noted that the Talbot team, run by Des O'Dell and 15 full-time personnel, was much smaller than other works teams and \"had to draft in 'mercenary' mechanics to help.\" Toivonen's results led to another year in the Talbot squad. In the 1981 season, he was signed up for a larger WRC programme and had a new co-driver, Fred Gallagher, who would later partner Juha Kankkunen and Björn Waldegård in a Toyota Celica Twincam Turbo. Toivonen's rear-wheel drive Group 2 Sunbeam Lotus was now less competitive against the Group 4 cars and the all-wheel-drive Audi Quattro, but despite four retirements, the second places at Rally Portugal and Sanremo, as well as a fifth place at the Monte Carlo Rally, resulted in a seventh place overall in the drivers' world championship. Together with more consistent teammate Guy Fréquelin, he brought Talbot a surprise manufacturers' title. He also competed in the last round of the British Open Rally Championship, the Audi Sport International Rally, and won the event."]}, {"page": "Juha Kankkunen", "response": ["Due to good results for Toyota Finland in local events, Kankkunen was signed by the Toyota Team Europe, Toyota's factory WRC team headed by Ove Andersson. In his first season in the Toyota Celica Twincam Turbo, as teammate to the 1979 world champion Björn Waldegård, his three outings in the championship resulted in a sixth place at the 1000 Lakes, a seventh place at the RAC Rally in Great Britain and a retirement at the Rallye Côte d'Ivoire. The following year, Kankkunen competed in four WRC events with Fred Gallagher as his new regular co-driver, retiring in three and finishing fifth in his home event. In 1985, he started his season with a surprise victory at the Safari Rally, becoming the first driver to win the event on the first attempt. He went on to compete in four more rallies and take his second win at WRC's second endurance event, the Rallye Côte d'Ivoire, where he finished with the same amount of penalty minutes (4 hours and 46 minutes) as his teammate Waldegård but took the win by a tiebreaker.", "| Fred Gallagher", "| Fred Gallagher"]}, {"page": "Safari Rally", "response": ["||  Fred Gallagher", "||  Fred Gallagher", "||  Fred Gallagher"]}, {"page": "Ari Vatanen", "response": ["In 1997 he won the FIA World Cup for Cross-Country Rallies with a Citroën ZX Rallye-raid alongside navigator Fred Gallagher (co-driver)."]}, {"page": "Rally Sweden", "response": ["|  Thomas Rådström Fred Gallagher ||  Ford Motor Company Ford Focus WRC"]}, {"page": "Rallye des Pharaons", "response": ["| align=\"left\" | Timo Salonen /  Fred Gallagher"]}, {"page": "Cyprus Rally", "response": ["|  John Buffum Fred Gallagher || Audi Quattro", "|  Björn Waldegård Fred Gallagher || Toyota Celica GT-Four ST165"]}, {"page": "Björn Waldegård", "response": ["| Fred Gallagher", "| Fred Gallagher", "| Fred Gallagher"]}, {"page": "List of World Rally Championship people", "response": ["* Fred Gallagher – former co-driver, clerk of the course of Rally GB", "* Fred Gallagher – co-driver to Henri Toivonen, Juha Kankkunen and Björn Waldegård"]}, {"page": "Boucles de Spa", "response": ["* 1977 Pond - Fred Gallagher - Triumph TR7"]}, {"page": "Rally de Portugal", "response": ["|  Henri Toivonen Fred Gallagher ||  Talbot Talbot Sunbeam Lotus"]}, {"page": "1998 World Rally Championship", "response": ["|align=left|  Fred Gallagher"]}, {"page": "Rallye Côte d'Ivoire", "response": ["|  Juha Kankkunen Fred Gallagher ", "|  Björn Waldegård Fred Gallagher "]}, {"page": "1985 World Rally Championship", "response": ["| Fred Gallagher", "| Fred Gallagher"]}, {"page": "1982 World Rally Championship", "response": ["| Fred Gallagher", "| Fred Gallagher"]}, {"page": "Toyota Celica GT-Four", "response": ["|  Fred Gallagher"]}, {"page": "Co-driver", "response": ["* Fred Gallagher"]}, {"page": "1988 World Rally Championship", "response": ["| Fred Gallagher"]}, {"page": "Fred Gallagher (rallying)", "response": ["#REDIRECT Fred Gallagher (co-driver)"]}, {"page": "List of fatal World Rally Championship accidents", "response": ["At the 1975 Safari Rally, a service car with four mechanics crashed into a truck near Mombasa. Carlino Dacista, Brian Fernandez and Willie Uis died instantly. The driver David Joshi sustained serious injuries. At the 1978 Monte Carlo Rally, two mechanics, Bernard Balmer and Georges Reinier, died when their van collided with a truck near Gap, Hautes-Alpes. On the second day of the 1987 Rallye Côte d'Ivoire, Toyota Team Europe's Cessna 340 crashed and exploded, killing all four inside; manager and former co-driver Henry Liddon, his assistant Nigel Harris, the pilot and the navigator. Team manager Ove Andersson withdrew Toyota from the event. Prior to the accident, Björn Waldegård and Fred Gallagher had been running second in their Toyota Supra Turbo. At the 1996 Safari Rally, competed in bad weather and rain, three British mechanics drowned while attempting to cross a river with their Land Rover."]}, {"page": "Rally Isle of Man", "response": ["|  Fred Gallagher", "|  Fred Gallagher", "|  Fred Gallagher"]}, {"page": "1996 Granada–Dakar Rally", "response": ["|align=center| 2||207|| Philippe Wambergue|| Fred Gallagher||Citroën||Citroën Sport||align=\"right\"|+1:11:54"]}, {"page": "2001 Paris–Dakar Rally", "response": ["| Kenjiro Shinozuka Fred Gallagher", "| Kenjiro Shinozuka Fred Gallagher", "| Kenjiro Shinozuka Fred Gallagher", "| Kenjiro Shinozuka Fred Gallagher"]}, {"page": "Fred Gallagher", "response": ["Fred Gallagher may refer to:", "*Fred Gallagher (cartoonist) (born 1968), American illustrator and web cartoonist", "*Fred Gallagher (co-driver) (born 1952), World Rally Championship winning co-driver from Northern Ireland", "*Fred Gallagher (footballer) (born 1931), Australian rules footballer"]}, {"page": "FIA World Cup for Cross-Country Rallies", "response": ["|align=center|1997 ||  Ari Vatanen ||  Fred Gallagher || Citroën ZX Rallye-raid"]}, {"page": "Abu Dhabi Desert Challenge", "response": ["|  Fred Gallagher"]}, {"page": "List of World Rally Championship co-drivers", "response": ["|align=left|  Fred Gallagher"]}, {"page": "1998 Safari Rally", "response": ["| Fred Gallagher"]}]}}