{"wiki_id": "http://www.wikidata.org/entity/Q909884", "itemLabel": "E. T. Whittaker", "itemDescription": "British mathematician who contributed widely to applied mathematics, mathematical physics, the theory of special functions, and the history of physics.", "wikipedia_url": "https://en.wikipedia.org/wiki/E._T._Whittaker", "wikipedia_page": {"main": "Sir Edmund Taylor Whittaker  (24 October 1873 – 24 March 1956) was a British mathematician, physicist, and historian of science. Whittaker was a leading mathematical scholar of the early twentieth century who contributed widely to applied mathematics and was renowned for his research in mathematical physics and numerical analysis, including the theory of special functions, along with his contributions to astronomy, celestial mechanics, the history of physics, and digital signal processing.\nAmong the most influential publications in Whittaker’s bibliography, he authored several popular reference works in mathematics, physics, and the history of science, including A Course of Modern Analysis (better known as Whittaker and Watson), Analytical Dynamics of Particles and Rigid Bodies, and A History of the Theories of Aether and Electricity. Whittaker is also remembered for his role in the relativity priority dispute, as he credited Henri Poincaré and Hendrik Lorentz with developing special relativity in the second volume of his History, a dispute which has lasted several decades, though scientific consensus has remained with Einstein. Whittaker served as the Royal Astronomer of Ireland early in his career, a position he held from 1906 through 1912, before moving on to the chair of mathematics at the University of Edinburgh for the next three decades and, towards the end of his career, received the Copley Medal and was knighted. The School of Mathematics of the University of Edinburgh holds The Whittaker Colloquium, a yearly lecture, in his honour and the Edinburgh Mathematical Society promotes an outstanding young Scottish mathematician once every four years with the Sir Edmund Whittaker Memorial Prize, also given in his honour.", "link_mentions": [{"page": "Augustin-Jean Fresnel", "response": ["* E. T. Whittaker, 1910, A History of the Theories of Aether and Electricity: From the age of Descartes to the close of the nineteenth century, London: Longmans, Green, & Co., chapters ."]}, {"page": "Arthur Eddington", "response": ["Based on his performance at Owens College, he was awarded a scholarship to Trinity College, Cambridge, in 1902. His tutor at Cambridge was Robert Alfred Herman and in 1904 Eddington became the first ever second-year student to be placed as Senior Wrangler.  After receiving his M.A. in 1905, he began research on thermionic emission in the Cavendish Laboratory. This did not go well, and meanwhile he spent time teaching mathematics to first year engineering students. This hiatus was brief. Through a recommendation by E. T. Whittaker, his senior colleague at Trinity College, he secured a position at the Royal Observatory in Greenwich where he was to embark on his career in astronomy, a career whose seeds had been sown even as a young child when he would often \"try to count the stars\".", "* Obituary 3 by Harold Spencer Jones and E. T. Whittaker, Monthly Notices of the Royal Astronomical Society 105 (1943–46) 68"]}, {"page": "Electromagnetism", "response": ["Phil. Trans. 1735 39, 74-75, published 1 January 1735 The account stated:A tradesman at Wakefield in Yorkshire, having put up a great number of knives and forks in a large box ...  and having placed the box in the corner of a large room, there happened a sudden storm of thunder, lightning, &c.  ... The owner emptying the box on a counter where some nails lay, the persons who took up the knives, that lay on the nails, observed that the knives took up the nails. On this the whole number was tried, and found to do the same, and that, to such a degree as to take up large nails, packing needles, and other iron things of considerable weight ... E. T. Whittaker suggested in 1910 that this particular event was responsible for lightning to be \"credited with the power of magnetizing steel; and it was doubtless this which led Franklin in 1751 to attempt to magnetize a sewing-needle by means of the discharge of Leyden jars.\"Whittaker, E.T. (1910). A History of the Theories of Aether and Electricity from the Age of Descartes to the Close of the Nineteenth Century. Longmans, Green and Company."]}, {"page": "Fresnel equations", "response": ["* E. T. Whittaker, 1910, A History of the Theories of Aether and Electricity: From the Age of Descartes to the Close of the Nineteenth Century, London: Longmans, Green, & Co."]}, {"page": "March 24", "response": ["*1956 – E. T. Whittaker, British mathematician and physicist (b. 1873)"]}, {"page": "October 24", "response": ["*1873 – E. T. Whittaker, British mathematician and physicist (d. 1956)"]}, {"page": "Paul Dirac", "response": ["Dirac's attention was drawn to a mysterious mathematical relationship, at first sight unintelligible, that Heisenberg had established. Several weeks later, back in Cambridge, Dirac suddenly recognised that this mathematical form had the same structure as the Poisson brackets that occur in the classical dynamics of particle motion. At the time, his memory of Poisson brackets was rather vague, but he found E. T. Whittaker's Analytical Dynamics of Particles and Rigid Bodies illuminating. From his new understanding, he developed a quantum theory based on non-commuting dynamical variables. This led him to the most profound and significant general formulation of quantum mechanics to date. Dirac's formulation allowed him to obtain the quantisation rules in a novel and more illuminating manner. For this work, published in 1926, Dirac received a PhD from Cambridge. This formed the basis for Fermi-Dirac statistics that applies to systems consisting of many identical spin 1/2 particles (i.e. that obey the Pauli exclusion principle), e.g. electrons in solids and liquids, and importantly to the field of conduction in semi-conductors."]}, {"page": "Total internal reflection", "response": ["* E. T. Whittaker, 1910, [https://archive.org/details/historyoftheorie00whitrich A History of the Theories of Aether and Electricity: From the Age of Descartes to the Close of the Nineteenth Century, London: Longmans, Green, & Co."]}, {"page": "Victorian era", "response": ["In his Dynamics of Rigid Bodies (1877), Edward John Routh noted the importance of what he called \"absent coordinates,\" also known as cyclic coordinates or ignorable coordinates (following the terminology of E. T. Whittaker). Such coordinates are associated with conserved momenta and as such are useful in problem solving. Routh also devised a new method for solving problems in mechanics. Although Routh's procedure does not add any new insights, it allows for more systematic and convenient analysis, especially in problems with many degrees of freedom and at least some cyclic coordinates."]}, {"page": "Nyquist–Shannon sampling theorem", "response": ["The name Nyquist–Shannon sampling theorem honours Harry Nyquist and Claude Shannon, but the theorem was also previously discovered by E. T. Whittaker (published in 1915) and Shannon cited Whittaker's paper in his work. The theorem is thus also known by the names Whittaker–Shannon sampling theorem, Whittaker–Shannon, and Whittaker–Nyquist–Shannon, and may also be referred to as the cardinal theorem of interpolation.", "E. T. Whittaker in 1915,  (\"Theorie der Kardinalfunktionen\"). J. M. Whittaker in 1935,. and Gabor in 1946 (\"Theory of communication\"). In 1999, the Eduard Rhein Foundation awarded Kotelnikov their Basic Research Award \"for the first theoretically exact formulation of the sampling theorem\"."]}, {"page": "Siméon Denis Poisson", "response": ["In September 1925, Paul Dirac received proofs of a seminal paper by Werner Heisenberg on the new branch of physics known as quantum mechanics. Soon he realized that the key idea in Heisenberg's paper was the anti-commutativity of dynamical variables and remembered that the analogous mathematical construction in classical mechanics was Poisson brackets. He found the treatment he needed in E. T. Whittaker's Analytical Dynamics of Particles and Rigid Bodies."]}, {"page": "Henri Poincaré", "response": ["While this is the view of most historians, a minority go much further, such as E. T. Whittaker, who held that Poincaré and Lorentz were the true discoverers of relativity.Whittaker 1953, Secondary sources on relativity"]}, {"page": "Elliptic function", "response": ["* E. T. Whittaker and G. N. Watson. A course of modern analysis, Cambridge University Press, 1952"]}, {"page": "Lagrange inversion theorem", "response": ["The theorem was proved by Lagrange https://archive.org/details/uvresdelagrange18natigoog/page/n13 (Note:  Although Lagrange submitted this article in 1768, it was not published until 1770.) and generalized by Hans Heinrich Bürmann,Bürmann, Hans Heinrich, \"Essai de calcul fonctionnaire aux constantes ad-libitum,\" submitted in 1796 to the Institut National de France. For a summary of this article, see: Bürmann, Hans Heinrich, \"Formules du développement, de retour et d'integration,\" submitted to the Institut National de France. Bürmann's manuscript survives in the archives of the École Nationale des Ponts et Chaussées [National School of Bridges and Roads] in Paris. (See ms. 1715.)A report on Bürmann's theorem by Joseph-Louis Lagrange and Adrien-Marie Legendre appears in:  \"Rapport sur deux mémoires d'analyse du professeur Burmann,\" Mémoires de l'Institut National des Sciences et Arts: Sciences Mathématiques et Physiques, vol. 2, pages 13–17 (1799). both in the late 18th century. There is a straightforward derivation using complex analysis and contour integration;E. T. Whittaker and G. N. Watson. A Course of Modern Analysis. Cambridge University Press; 4th edition (January 2, 1927), pp. 129–130 the complex formal power series version is a consequence of knowing the formula for polynomials, so the theory of analytic functions may be applied. Actually, the machinery from analytic function theory enters only in a formal way in this proof, in that what is really needed is some property of the formal residue, and a more direct formal proof is available."]}, {"page": "Whittaker–Shannon interpolation formula", "response": ["The Whittaker–Shannon interpolation formula or sinc interpolation is a method to construct a continuous-time bandlimited function from a sequence of real numbers.  The formula dates back to the works of E. Borel in 1898, and E. T. Whittaker in 1915, and was cited from works of J. M. Whittaker in 1935, and in the formulation of the Nyquist–Shannon sampling theorem by Claude Shannon in 1949.  It is also commonly called Shannon's interpolation formula and Whittaker's interpolation formula.  E. T. Whittaker, who published it in 1915, called it the Cardinal series.", "Category:E. T. Whittaker"]}]}}