{"wiki_id": "http://www.wikidata.org/entity/Q9103510", "itemLabel": "Ian Sampson", "itemDescription": "English footballer and manager (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Sampson", "wikipedia_page": {"main": "Ian Sampson (born 14 November 1968 in Wakefield) is an English former footballer. He played as a defender for Goole Town, Sunderland, Northampton Town and Tottenham Hotspur. Following his retirement Sampson rejoined Northampton initially working in the youth setup before going to manage the club from 2009 until 2011.", "link_mentions": [{"page": "Northampton Town F.C.", "response": ["The following season started promisingly, with players such as Marco Gabbiadini and Jamie Forrester pushing the Cobblers towards a play-off place before the club eventually finished in 18th place due to a large number of injuries in the second half of the season. Kevin Wilson was sacked in November 2001, to make way for his assistant Kevan Broadhurst, who steered the Cobblers from relegation to a remarkable survival with a game to spare after losing only one home game from mid-January. The next season was the worst since the early 1990s, both financially and on the pitch. Early on they were forced into a 'Save our Season' campaign to keep afloat until the end of the year. It was required after the collapse of ITV Digital and much publicised takeover attempts by John FashanuConn, David (28 December 2001) Northampton brought back to reality The Independent. Retrieved 2010-01-21. and Giovanni Di StefanoConn, David (22 May 2002) Arkan's lawyer has ambitions to take over Northampton The Independent.  Retrieved 2010-01-21. had failed and left the club with huge debts. They were taken over by a consortium run by Andrew Ellis, who sacked Broadhurst in January 2003, when Northampton were struggling at the foot of the division. He was briefly replaced by former England player Terry Fenwick who was sacked after a winless spell of seven games. This was, at the time, the eighth-shortest managerial reign in English football history. Martin Wilkinson, the new manager lasted little longer, being dismissed in October 2003 in favour of former Scotland and Tottenham Hotspur defender Colin Calderwood.Calderwood joins Cobblers BBC Sport. 2003-10-09. Retrieved 2010-01-21. Calderwood led Northampton to the play-offs in his first season, where they were knocked out in the semi-finals by Mansfield Town after a penalty shoot-out. In the 2004–05 season, Northampton finished seventh, again in the play-offs, where they were defeated by Southend United. Following this, the manager made substantial changes to the squad, bringing in experienced players such as Ian Taylor and Eoin Jess, and they enjoyed a successful 2005–06 league season. On 29 April, the Cobblers clinched promotion to Football League One, with a 1–0 win at home to Chester City. On 30 May 2006, Northampton announced that Calderwood was leaving to join Nottingham Forest as their new manager,Calderwood named new Forest boss BBC Sport. 2006-05-30. Retrieved 2010-01-21. and he was replaced by John Gorman on 5 June. On 20 December, Gorman resigned due to \"personal issues\" with the side 18th in the table, with Ian Sampson and Jim Barron briefly taking care of first team affairs.Gorman exits as Northampton boss BBC Sport. 2006-12-20. Retrieved 2010-01-21. He was replaced by former Southampton boss Stuart Gray on 2 January 2007.Northampton name Gray as Manager BBC Sport. 2007-01-02. Retrieved 2010-01-21. The Cobblers were relegated from league one on the final day of the 2008–09 season, after suffering a 3–0 defeat away at Leeds United and other results went against them.", "Northampton caused an upset in the third round of the 2010–11 Football League Cup, knocking out Liverpool at Anfield. The game was drawn 2–2 after extra time, and the Cobblers beat the team 69 places above them 4–2 on penalties, the winning penalty being scored by Abdul Osman at the 'Kop End'. Ian Sampson was sacked as manager on 2 March 2011 after a poor run of form saw the Cobblers fail to win in eight games and sit in a disappointing 16th position in League 2. Sampson's last game in charge was a 2–3 defeat against Burton Albion, the manner of this defeat ultimately costing him his job. Sampson's sacking brought to an end a 17-year association with Northampton, and his commitment to the club has guaranteed his status as a legend in fans' hearts.", "Tommy Fowler holds the record for Northampton Town appearances, having played 552 first-team matches between 1946 and 1961. Centre half and former captain Ian Sampson comes second, with 449 games. The record for a goalkeeper is held by Peter Gleasure, with 412 appearances.Most appearances in a career  ntfc.co.uk. Retrieved 2010-01-19.", "* Head of Academy: Ian Sampson", "* 2009–2011:  Ian Sampson"]}, {"page": "Corby Town F.C.", "response": ["*Ian Sampson (2012)"]}, {"page": "Giles Coke", "response": ["Coke remained on the sideline at the start of the season after having a further operation. In early October, Coke was showing signs of recovery and of being fully fit to make a return to training. To gain match fitness, Coke played his first for Northampton Town in reserve for 56 minutes, as they beat Southend United, which met the delight of the club's reserve coach Ian Sampson, who believed \"his confidence will be sky high at the moment.\" Despite potential debut after playing in the reserves, his league debut was delayed once again when he sustained a groin injury and would be out for three weeks following an operation. After being on the sideline, Coke made his debut for the club, coming on for Andy Kirk in the 58th minutes and was booked, as Northampton Town lost 3–2 to Leeds United on 5 January 2008. Since his debut, Coke quickly made an impact and insists he was not a \"next Bradley Johnson.\" Coke scored his first goal for the club, in a 2–0 win over Leyton Orient on 25 January 2008. Coke scored four more goals later in the 2007–08 season against Gillingham, Hartlepool United, Cheltenham Town and Oldham Athletic."]}, {"page": "Malcolm Crosby", "response": ["In July 2004 Steve McClaren appointed Crosby as reserve team manager at Middlesbrough. When McClaren was appointed as England manager in the summer of 2006, new Middlesbrough manager Gareth Southgate appointed Crosby as assistant manager. He was released by Middlesbrough in June 2009, following their relegation to the Championship. In September 2009, Crosby took on a coaching role at Northampton Town. Following the sacking of Ian Sampson on 2 March 2011 he took on the temporary running of the club until a full-time replacement was found."]}]}}