{"wiki_id": "http://www.wikidata.org/entity/Q911788", "itemLabel": "Brian B. Shefton", "itemDescription": "British art historian and archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Shefton", "wikipedia_page": {"main": "Brian Benjamin Shefton, FBA (11 August 1919 – 25 January 2012), born Bruno Benjamin Scheftelowitz, was a German-born British classical archaeologist.He was the founder of the Shefton Museum, which bore his name.", "link_mentions": [{"page": "Black-figure pottery", "response": ["Laconian pottery was known since the 19th century from a significant number of vases from Etruscan graves. At first they were erroneously attributed, being considered for a long time to be a product of Cyrene, where some of the earliest pieces were also found. Thanks to British excavations carried out in Sparta's Sanctuary of Artemis Orthia, their true origin was quickly identified. In 1934, Arthur Lane put together all the known material and was the first archaeologist to identify different artists. In 1956 the new discoveries were studied by Brian B. Shefton. He reduced the number of distinct painters by half. In 1958 and 1959 other new material from Taranto was published. A significant number of other vases were also found on Samos. Conrad Michael Stibbe studied anew all 360 vases known to him and published his findings in 1972. He identified five major and three minor painters.Thomas Mannack: Griechische Vasenmalerei. Theiss, Stuttgart 2002, S. 125–128."]}, {"page": "Shefton Museum", "response": ["The museum was located in the Department of Classics in the Armstrong Building of the main University campus.  It was founded in 1956 by Professor Brian B. Shefton with a grant of £20 from the University's Rector, Charles Bosanquet. Since then the collection has grown to over 800 objects.  Professor B.B. Shefton was the curator until 1984 when his role was taken over by Professor Tony Spawforth. Shefton died on 25 January 2012, aged 92."]}, {"page": "Laconian vase painting", "response": ["Laconian pottery was discovered in considerable amounts in the 19th century, mostly in Etruscan graves. Initially, it was falsely interpreted as produce of Cyrene, where similar material had been found. Thanks to British excavations undertaken since 1906 in the sanctuary of Artemis Orthia at Sparta, the real origin was later recognised. In 1934, Eugene Numa Lane collated the known finds, and became the first archaeologist to distinguish several individual Laconian painters. In 1954, Brian B. Shefton examined new finds. He reduced the number of painters assumed until then by half.Shefton, B. (1954). Three Laconian Vase-Painters. The Annual of the British School at Athens, 49, 299-310. Retrieved from https://www.jstor.org/stable/30096999 The remainder were the Arkesilas Painter, the Hunt Painter and the Rider Painter. In 1958 and 1959, important new finds from Taras were published. Additionally, a significant number of Laconian vases were discovered on Samos. Conrad Michael Stibbe re-examined all available material and published his results in 1972. He distinguished five major and three minor vase painters, adding to the three painters mentioned above the Boreades Painter, the Naukratis Painter, the Allard-Pierson Painter, the Typhon painter and the Chimeira Painter. Other scholars have recognised further artists, such as the Painter of the Taranto Fishes or the Grammichele Painter."]}, {"page": "Kenyon Medal", "response": ["*1999 – Brian B. Shefton"]}]}}