{"wiki_id": "http://www.wikidata.org/entity/Q911766", "itemLabel": "Brian Aherne", "itemDescription": "English actor (1902-1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Aherne", "wikipedia_page": {"main": "William Brian de Lacy Aherne (2 May 1902 – 10 February 1986) was an English actor of stage, screen, radio and television, who enjoyed a long and varied career in Britain and the US.\nHis first Broadway appearance in The Barretts of Wimpole Street in 1931 teamed him with Katharine Cornell, with whom he appeared in many productions. In films, he played opposite Madeleine Carroll, Bette Davis, Marlene Dietrich, Rita Hayworth and Carole Lombard, and was Oscar-nominated for his role as Emperor Maximilian in Juarez (1939). On TV, he appeared in the The Twilight Zone episode, \"The Trouble With Templeton\", Wagon Train and Rawhide.", "link_mentions": [{"page": "George Cukor", "response": ["| Katharine Hepburn, Cary Grant, Brian Aherne"]}, {"page": "May 2", "response": ["*1902 – Brian Aherne, English actor (d. 1986)"]}, {"page": "Romeo and Juliet", "response": ["In 1933, the play was revived by actress Katharine Cornell and her director husband Guthrie McClintic and was taken on a seven-month nationwide tour throughout the United States. It starred Orson Welles, Brian Aherne and Basil Rathbone. The production was a modest success, and so upon the return to New York, Cornell and McClintic revised it, and for the first time the play was presented with almost all the scenes intact, including the Prologue. The new production opened on Broadway in December 1934. Critics wrote that Cornell was \"the greatest Juliet of her time\", \"endlessly haunting\", and \"the most lovely and enchanting Juliet our present-day theatre has seen\"."]}, {"page": "The Saint (Simon Templar)", "response": ["Several radio drama series were produced in North America, Ireland, and Britain. The earliest was for Radio Éireann's Radio Athlone in 1940 and starred Terence De Marney. Both NBC and CBS produced Saint series during 1945, starring Edgar Barrier and Brian Aherne. Many early shows were adaptations of published stories, although Charteris wrote several storylines for the series which were novelised as short stories and novellas."]}, {"page": "1902", "response": ["* May 2 – Brian Aherne, English-born actor (d. 1986)"]}, {"page": "1986", "response": ["* February 10 – Brian Aherne, British actor (b. 1902)"]}, {"page": "Victor McLaglen", "response": ["He supported Nelson Eddy in Let Freedom Ring (1939) at MGM, and was in Ex-Champ (1939). He supported Brian Aherne in Captain Fury (1939), and starred in Full Confession (1939) for John Farrow at RKO, the latter film being somewhat a remake of The Informer."]}, {"page": "Claude Rains", "response": ["| Paul Muni, Bette Davis, Brian Aherne, John Garfield"]}, {"page": "The Lady Eve", "response": ["At some point, the studio wanted Brian Aherne for the male lead, and Joel McCrea, Madeleine Carroll and Paulette Goddard were under consideration as of July 1940, but in August 1940, Fred MacMurray and Madeleine Carroll were announced as the film's co-stars. In September, Darryl Zanuck lent Henry Fonda to co-star with Goddard, who was then replaced by Barbara Stanwyck."]}, {"page": "Suspicion (1941 film)", "response": ["* Lux Radio Theatre presented the initial adaptation on May 4, 1942, a one-hour version with Joan Fontaine and Nigel Bruce, and with Brian Aherne (Fontaine's husband) in Grant's part.", "* Screen Guild Theater adapted the film in a half-hour version on January 4, 1943, with Joan Fontaine and Nigel Bruce reprising their roles, while Basil Rathbone assumed Cary Grant's part (as a last-minute substitute for an ill Brian Aherne)."]}, {"page": "Michael Collins (Irish leader)", "response": ["The 1936 film Beloved Enemy is a fictionalised account of Collins' life. Unlike the real Michael Collins, the fictionalised \"Dennis Riordan\" (played by Brian Aherne) is shot, but recovers. Hang Up Your Brightest Colours, a British documentary by Kenneth Griffith, was made for ITV in 1973, but refused transmission. It was eventually screened by the BBC in Wales in 1993 and across the United Kingdom the following year."]}, {"page": "The Swan (1956 film)", "response": ["The film stars Grace Kelly, Alec Guinness, and Louis Jourdan, with Agnes Moorehead, Jessie Royce Landis, Brian Aherne, Leo G. Carroll, Estelle Winwood, and Van Dyke Parks in supporting roles. The film was released the day Kelly became princess consort of Monaco.", "* Brian Aherne as Father Carl Hyacinth"]}, {"page": "Rex Stout", "response": ["| Program includes an interview with Rex Stout after his return from Europe, where he asked Germans what they thought about democracyCast: John Daly (host), Richard C. Hottelet, Rex Stout, Brian Aherne, Clare Boothe Luce"]}, {"page": "Mervyn LeRoy", "response": ["Leroy also produced director James Whale's The Great Garrick (1937), a historical comedy with Brian Aherne who plays the renowned English actor.LeRoy and Kleiner, 1974 p. 133", "| Brian Aherne, Olivia de Havilland"]}, {"page": "George Stevens", "response": ["|1940||Vigil in the Night||RKO||Carole Lombard/ Brian Aherne/ Anne Shirley||"]}, {"page": "The Trouble with Templeton", "response": ["\"The Trouble with Templeton\" is episode 45 of the American television anthology series The Twilight Zone starring Brian Aherne, Pippa Scott and Sydney Pollack. The episode originally aired on December 9, 1960 on CBS.", "*Brian Aherne as Booth Templeton"]}, {"page": "Roddy McDowall", "response": ["He followed it with Escapade (1953) with Carroll Baker and Brian Aherne; Ira Levin's No Time for Sergeants  (1955–57), which was a huge hit; Diary of a Scoundrel (1956); and Good as Gold (1957)."]}, {"page": "David Garrick", "response": ["* A 1937 film called The Great Garrick, directed by James Whale, is a fictional story of how Garrick's acting skills and ego inspire the actors of the Comédie-Française to try and teach him a lesson.  Brian Aherne stars as Garrick."]}, {"page": "1986 in film", "response": ["| style=\"text-align:center;\"| 10 || Brian Aherne || style=\"text-align:center;\"| 83 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "Ruth Chatterton", "response": ["She taught British film and stage actor Brian Aherne to fly, an experience he described at length in his 1969 autobiography A Proper Job."]}, {"page": "1953 in film", "response": ["*Titanic, starring Barbara Stanwyck, Clifton Webb, Thelma Ritter, Brian Aherne, Robert Wagner"]}, {"page": "1939 in film", "response": ["*Juarez, starring Paul Muni, Bette Davis, Claude Rains, John Garfield, Brian Aherne"]}, {"page": "1938 in film", "response": ["*Merrily We Live, starring Brian Aherne, Constance Bennett, Billie Burke, Patsy Kelly"]}, {"page": "1937 in film", "response": ["*The Great Garrick, starring Brian Aherne and Olivia de Havilland"]}, {"page": "1930 in film", "response": ["*The W Plan, directed by Victor Saville, starring Brian Aherne and Madeleine Carroll – (GB)"]}, {"page": "1902 in film", "response": ["*May 2 – Brian Aherne, English actor (d. 1986)"]}, {"page": "Joan Fontaine", "response": ["She was married and divorced four times. Her first marriage was to actor Brian Aherne, in 1939 in Del Monte, California; they divorced in April 1945."]}, {"page": "My Sister Eileen", "response": ["Fields and Chodorov adapted their play for a 1942 film released by Columbia Pictures (their biggest hit of 1942/3). Alexander Hall directed a cast that includes Rosalind Russell as Ruth (in an Academy Award–nominated performanceMy Sister Eileen (1942) at Oscar.org) and Janet Blair as Eileen, with Brian Aherne, George Tobias, Allyn Joslyn, Elizabeth Patterson, Grant Mitchell, Jeff Donnell, and Richard Quine in supporting roles."]}, {"page": "The Constant Nymph (novel)", "response": ["The novel was first adapted as a silent film in 1928 by Adrian Brunel and Alma Reville and directed by Brunel and Basil Dean. This version starred Ivor Novello, Mabel Poulton and Benita Hume.Life. \"Movie of the Week: The Constant Nymph. August 2, 1943. p. 38 It was adapted again in 1933 by Dorothy Farnum and directed by Dean. It featured Victoria Hopper, Brian Aherne and Leonora Corbett. A third film adaptation in 1943 featured Charles Boyer, Joan Fontaine, and Alexis Smith. It was adapted by Kathryn Scola and directed by Edmund Goulding."]}, {"page": "Maximilian I of Mexico", "response": ["Maximilian is portrayed in the 1934 Mexican film Juárez y Maximiliano by Enrique Herrera and the 1939 American film Juarez by Brian Aherne. In the 1939 film The Mad Empress he was played by Conrad Nagel. He also appeared in one scene in the 1954 American film Vera Cruz, played by George Macready. In theater, he appeared in the play Juarez and Maximilian by Franz Werfel, which was presented at Berlin in 1924, directed by Max Reinhardt.  In the Mexican telenovela El Vuelo del Águila, Maximilian was portrayed by Mexican actor Mario Iván Martínez."]}, {"page": "A. J. Cronin", "response": ["*1940 – Vigil in the Night, directed by George Stevens, featuring Carole Lombard, Brian Aherne, Anne Shirley, and Robert Coote"]}, {"page": "Lloyd Bridges", "response": ["Bridges made his Broadway debut in 1937 in a short-lived production of Shakespeare's Othello, starring Walter Huston and Brian Aherne; Bridges was in the Ensemble."]}, {"page": "Madeleine Carroll", "response": ["Carroll was the lead in her second film, What Money Can Buy (1928) with Humberston Wright. She followed it with The First Born (1928) with Miles Mander, which really established her in films. Carroll went to France to make Not So Stupid (1928). Back in Britain she starred in The Crooked Billet (1929) and The American Prisoner (1929), both shot in silent and sound versions. In 1930, she starred in Atlantic, then co-starred with Brian Aherne in The W Plan (1930). In France she was in Instinct (1930). On stage, Carroll appeared in The Roof (1929) for Basil Dean, The Constant Nymph, Mr Pickwick (opposite Charles Laughton) and an adaptation of Beau Geste."]}, {"page": "Romeo and Juliet (1936 film)", "response": ["Producer Irving Thalberg pushed MGM for five years to make a film of Romeo and Juliet, in spite of studio head Louis B. Mayer's resistance. Mayer believed that the mass audience considered the Bard over their heads, and also he was concerned with the studio's budget constraints during the early years of the Great Depression. It was only when Jack L. Warner announced his intention to film Max Reinhardt's A Midsummer Night's Dream at Warner Bros. that Mayer, not to be outdone, gave Thalberg the go-ahead.Brode, Douglas Shakespeare in the Movies: From the Silent Era to Today (2001, Berkeley Boulevard, New York, ) p.43 The success of a 1934 Broadway revival also encouraged the idea of a film version. It starred Katharine Cornell as Juliet, Basil Rathbone as Romeo, Brian Aherne as Mercutio, and Edith Evans as The Nurse.Romeo and Juliet revival, at the Martin Beck Theatre Dec. 20 1934-Feb. 1935; IBDb.com Rathbone is the only actor from the 1934 revival to appear in the film, albeit in the role of Tybalt rather than Romeo. On the stage Tybalt was played by nineteen year old Orson Welles."]}, {"page": "John Collier (fiction writer)", "response": ["The film Sylvia Scarlett starred Katharine Hepburn, Cary Grant, Brian Aherne, and Edmund Gwenn; it was the comic story of a widower, his daughter Sylvia who disguises herself as a boy, and a con man; Collier's collaborators on the script were Gladys Unger and Mortimer Offner. Wilk writes that the film was considered bizarre at the time, but decades later, it enjoys a cult following."]}, {"page": "George Sanders", "response": ["Sanders' autobiography Memoirs of a Professional Cad was published in 1960 and gathered critical praise for its wit. Sanders suggested the title A Dreadful Man for his biography, later written by his friend Brian Aherne and published in 1979.VanDerBeets 1990, p. xiii. Sanders's fourth and last marriage on 4 December 1970 was to Magda Gabor, the elder sister of his second wife. This marriage lasted only 32 days, after which he began drinking heavily.VanDerBeets 1990, pp. 116, 119.\"George Sanders Dies in Spain of Drug Overdose, Leaves Note\", Los Angeles Times, 25 Apr 1972: 2."]}, {"page": "Jeanette MacDonald", "response": ["Following Broadway Serenade, and not coincidentally right after Nelson Eddy's surprise elopement with Ann Franklin, MacDonald left Hollywood on a concert tour and refused to renew her MGM contract. Months later she summoned her manager Bob Ritchie from London to help her renegotiate. After initially insisting that she wanted to film Smilin' Through with James Stewart and Robert Taylor, MacDonald finally relented and agreed to film New Moon (1940) with Eddy, which proved to be one of MacDonald's more popular films. Composer Sigmund Romberg's 1927 Broadway hit provided the plot and the songs: \"Lover, Come Back to Me,\" \"One Kiss,\" and \"Wanting You,\" plus Eddy's version of \"Stout Hearted Men.\" This was followed by Bitter Sweet (1940), a Technicolor film version of Noël Coward's 1929 stage operetta, which Coward loathed, writing in his diary about how \"vulgar\" he found it. Smilin' Through (1941) was MacDonald's next Technicolor project, the third adaptation filmed in Hollywood, with Brian Aherne and Gene Raymond. Its theme of reunion with deceased loved ones was enormously popular after the devastation of World War I, and MGM reasoned that it should resonate with audiences during World War II, but it failed to make a profit. MacDonald played a dual role—Moonyean, a Victorian girl accidentally murdered by a jealous lover, and Kathleen, her niece, who falls in love with the son of the murderer."]}, {"page": "Armstrong Circle Theatre", "response": ["| June 6, 1950 || \"The Magnificent Gesture\" || Brian Aherne"]}, {"page": "Second Mexican Empire", "response": ["The 1939 film Juarez featured Paul Muni as Benito Juárez, Bette Davis as Empress Carlota, and Brian Aherne as Emperor Maximilian.  It was based, in part, on Bertita Harding's novel The Phantom Crown (1937)."]}, {"page": "Edward Smith (sea captain)", "response": ["*Brian Aherne (1953) (Titanic)"]}, {"page": "Glenn Ford", "response": ["Ford was in the bigger budgeted The Lady in Question (1940), which co-starred Rita Hayworth. This was a well-received courtroom drama in which Glenn plays a young man who falls in love with Rita Hayworth when his father, Brian Aherne, tries to rehabilitate her in their bicycle shop. Directed by Hungarian emigre Charles Vidor, the two rising young stars instantly bonded."]}, {"page": "Kings Norton", "response": ["* Brian Aherne, Oscar-nominated actor born in Kings Norton."]}, {"page": "I Confess (film)", "response": ["At the police station, two young girls tell Inspector Larrue they saw a priest leaving Villette's house. This prompts Larrue to call Father Logan in for more questioning, but Logan refuses to provide any information about the murder. Now suspecting Logan, Larrue orders a detective to follow Logan and contacts Crown Prosecutor Robertson (Brian Aherne), who is attending a party hosted by Ruth Grandfort (Anne Baxter), the woman Logan talked to outside of Villette's house, and her husband Pierre (Roger Dann), a member of the Quebec legislature. Ruth overhears Robertson discussing Logan, and Larrue's detective discovers her identity by following her home the next day after she meets with Logan to warn him that he is a suspect."]}, {"page": "Edward Sheldon", "response": ["* The Song of Songs (1914), dramatization of the novel by Hermann Sudermann, made into films in 1918 (The Song of Songs), 1924 (Lily of the Dust), and in 1933 (The Song of Songs, starring Marlene Dietrich, Brian Aherne, and Lionel Atwill)"]}, {"page": "Titanic (1953 film)", "response": ["As the ship prepares for departure, her captain, Edward J. Smith (Brian Aherne), receives a hint from the shipping company representative that a record-setting speedy passage would be welcomed.", "*Brian Aherne as Capt. Edward J. Smith"]}, {"page": "Katharine Cornell", "response": ["When McClintic was in London, he was able to secure Brian Aherne to play the part of Robert Browning. Afterwards, McClintic immediately went to a London jewelry store and bought a necklace, two bracelets and a garnet ring, all at least 100 years old. For every single performance that Cornell gave as Elizabeth Barrett, she wore this jewelry in the last act, when she leaves the family home for the last time. Katharine Hepburn was selected for the part of Henrietta, but since she was going to play in a summer stock company a few months later, she could not be signed to a contract. Casting the dog was troublesome because it had to lie still in its basket on stage for a great length of time, and then exit when called. McClintic selected an eight-month-old cocker spaniel, which played the role for the full run and many others afterward, to tremendous applause.", "The play's success engendered a revival of Robert Browning's poetry, and cocker spaniels became the popular dog that year. Irving Thalberg wanted Cornell to play her part in an MGM adaptation, offering that if she was not completely satisfied with the result, the film would be destroyed.Brian Aherne, A Proper Job, Houghton Mifflin Co., Boston 1969 She refused. The movie that was released had most of the original cast, and Thalberg's wife, actress Norma Shearer, played the part of Elizabeth.", "Although they had toured with this play, Cornell and McClintic decided to open Romeo and Juliet in New York with a completely new production. McClintic started over, with just a handful of the actors from the tour. Orson Welles was kept, but played Tybalt instead of Mercutio, making his Broadway debut. Basil Rathbone played Romeo, while Brian Aherne took the part of Mercutio, and Edith Evans played the Nurse. McClintic's idea was to keep the play \"light, gay, hot sun, spacious\" with no hint of the doom that concluded the play. Also, he coached Cornell to read for meaning, sense and emotion, in place of the poetics of iambic pentameter.", "For the next season, Cornell and her husband decided to do St. Joan by George Bernard Shaw. McClintic cast Maurice Evans as the Dauphin, Brian Aherne as Warwick, Tyrone Power as Bertrand de Poulengey, and Arthur Byron as the Inquisitor.  The play opened on March 9, 1936, and Burns Mantle wrote that the triumph belonged to two maids, \"the Maid of Domrémy, France, and the Maid of Buffalo, N.Y.\"  John Anderson of the New York Journal wrote, \"Before there is any haggling, let it be said that it is Shaw's greatest play and that Miss Cornell is superb in it. She is beautiful to look at and her performance is enkindled by the spiritual exaltation of a transcendent heroine.\"", "The tour opened in Santa Maria, a small town 15 miles north of Naples, in 1944. G.I.s lined up three hours ahead of time and profusely thanked the cast afterwards. Brian Aherne wrote that after one show in Italy, the manager overheard a tough burly paratrooper say to his buddy, \"Well, what I tell ya?  Told ya it would be better than going to a cat house.\"  Convinced of its success, the Army brass sanctioned two more weeks. The company eventually played for six months, from August 1944 to January 1945, throughout Italy, including stops in Rome, Florence and Siena. From there, the company was transferred under the aegis of General Dwight D. Eisenhower and played in France, including Dijon, Marseilles and Versailles. In Paris, Gertrude Stein and Alice B. Toklas wanted to see the play, but found that performances were strictly limited to enlisted personnel. They were nonetheless given disguises and were able to see the play. Additionally, the cast made a point of visiting hospitals every day throughout the entire tour.Ahern, \"A Proper Job\"", "Finding good roles became increasingly a concern. Kate O'Brien dramatized her historical novel For One Sweet Grape into That Lady, set in the Spain of Philip II. A swashbuckling romance, the play was not well received. In 1951, Cornell played the lead in Somerset Maugham's comedy, The Constant Wife for a summer festival in Colorado. The play, starring her longtime favorite Brian Aherne, was produced again in New York and grossed more money for the production company than any other play.", "McClintic died on October 29, 1961 of a lung haemorrhage, shortly after the couple had celebrated their 40th wedding anniversary. As he had always directed Cornell in every production since their marriage, she decided to retire from the stage altogether. She sold her residences and bought a house on East 51st Street in Manhattan, next door to Brian Aherne and down the street from Margalo Gillmore. Since all three were cast members of Barretts, East 51st Street became known as Wimpole Street. Cornell also bought an old building on Martha's Vineyard known as The Barn and made additions to it, and restored the 300-year-old Association Hall on the island."]}, {"page": "Rebecca (novel)", "response": ["The Screen Guild Theater presented half-hour adaptions with Joan Fontaine, her husband at the time Brian Aherne, and Agnes Moorehead (31 May 1943), and with Loretta Young, John Lund and Agnes Moorehead (18 November 1948). Joan Fontaine and Joseph Cotten performed a half-hour adaptation 1 October 1946 on The Cresta Blanca Hollywood Players."]}, {"page": "Lee Patrick (actress)", "response": ["|Loretta Young, Brian Aherne"]}]}}