{"wiki_id": "http://www.wikidata.org/entity/Q912992", "itemLabel": "Brian Rawlinson", "itemDescription": "British actor (1931-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Rawlinson", "wikipedia_page": {"main": "Brian Rawlinson (12 November 1931 – 23 November 2000) was an English actor and writer for films and TV from the 1950s.\nRawlinson was born in Stockport, Cheshire. He appeared in several films (including several in the Carry On series) but was more frequently on television, a regular role being Robert Onedin in the BBC TV serial The Onedin Line. He also played character roles in many other TV programmes such as Coronation Street, The Baron, Z-Cars, Market in Honey Lane, The Bill, Heartbeat, Danger Man, Goodnight Sweetheart and Last of the Summer Wine, in which he played Cyril Gridley, which was his final appearance. He was also in the series The Buccaneers, playing Gaff Guernsey.\nAs a writer, Rawlinson wrote several plays, but was most involved in the mid-1970s BBC serial Churchill's People, an adaptation based on Winston Churchill's book A History of the English-Speaking Peoples. He was later interviewed about his association with the series on TV Hell, a theme night that BBC Two ran in 1992 on bad television programmes.\nHe died in Lyme Regis, Dorset on 23 November 2000 aged 69.", "link_mentions": [{"page": "November 23", "response": ["*2000 – Brian Rawlinson, English actor and playwright (b. 1931)"]}, {"page": "British sitcom", "response": ["Brian Rawlinson,"]}, {"page": "Carry On Cleo", "response": ["*Brian Rawlinson as Hessian driver"]}, {"page": "The Onedin Line", "response": ["Robert Onedin (Brian Rawlinson/James Garbutt (one series)), James's older brother, took after their father and counted coppers in the family ship chandlers, though he later expanded it into a profitable department store after visiting the United States to see new methods of selling. He and his wife Sarah had one son, Samuel, who at first cared more for the sea and ships than shopkeeping. Robert was elected as a Member of Parliament and he and Sarah moved to a smart new residence, but his life abruptly came to an end when he choked on a bone at a family dinner.", "Other regular cast members included Jessica Benton (Elizabeth Frazer), Brian Rawlinson and James Garbutt (Robert Onedin), Mary Webster, (Sarah Onedin), Michael Billington / Tom Adams (Daniel Fogarty)."]}, {"page": "Whack-O!", "response": ["* Mr Proctor played by Brian Rawlinson"]}, {"page": "Market in Honey Lane", "response": ["*Brian Rawlinson as Danny Jessel"]}, {"page": "Play of the Month", "response": ["|Ian McKellen,Charles Gray,Barrie Ingham,John Bennett,Martin Jarvis,Edward Fox,Brian Rawlinson,Michael Robbins,David Spenser,Kim Fortune,Hugh Walters,Simon Lack,Robert Luckham,Victor Pemberton,David Griffin,Richard Hampton"]}, {"page": "The Iron Maiden", "response": ["* Brian Rawlinson as Albert, Village Constable"]}, {"page": "The Buccaneers (TV series)", "response": ["* Brian Rawlinson as Gaff Guernsey"]}, {"page": "Far from the Madding Crowd (1967 film)", "response": ["* Brian Rawlinson as Matthew Moon"]}, {"page": "Carry On Cruising", "response": ["*Brian Rawlinson as Steward"]}, {"page": "List of pirate films and television series", "response": ["|Robert Shaw, Paul Hansard, Brian Rawlinson"]}, {"page": "List of Carry On films cast members", "response": ["* Brian Rawlinson (3) appeared in Cruising, Cleo and Cowboy."]}, {"page": "Bill Ward (British artist)", "response": ["There is some evidence Ward had his first erotic drawings published discretely in the British physique magazine Male ClassicsVolume 2, Summer 1957 and also in Physique Pictorial.Volume 12 Number 2, November 1962 Unusually these were initialled and credited to him by name. It is possible that he also used the pseudonym Tristano.Multiple copies of the catalogues for this artist were found in hist studio and the style appears similar. He did not produce sexually explicit works until he had retired from reliance on mainstream comic work. Homosexual sex and images portraying and encouraging it were illegal in the period before 1967. During the 1970s he was working for the Mansell Collection,The Mansell Collection is now part of Getty Images - see http://creative.gettyimages.com/source/services/rights.aspx  a commercial picture archive which was housed at 42 Linden Gardens; he was living there with actor Brian Rawlinson in an outbuilding that served as his own studio. The picture library and the house was owned by Louie Boutroy (1903–1993) and run with her unofficial adopted son and protégée George Anderson and his life partner Harold, who also lived at the house.", "Ward lost the majority of his original drawings for American strips for Drummer during a change of ownership. He tried, with the help of John Embry to have them returned but failed. Some of his work remained with his \"dowager partner\" Brian Rawlinson in a space he used for drawing but eventually the studio (at Linden Gardens), filled with piles of magazines and detritus, needed clearing. With no idea what to do with the explicit drawings he had been left, Rawlinson's houseclearers were due put them in the same skip as the rest of the contents. Fortunately Bill's model for his character Drum, Robert Bremner (1947-2003), a fellow member with Bill of the London  MSC leather club heard about it with only a day to spare. With Rawlinson's blessing and the help of artist Guy Burch, they sifted the material to extract an archive of work and related ephemera. Bremner also died of AIDS but the works were kept together by Burch but the explicit nature of many drawings made display or publication difficult.See 'The Bill Ward Archive, Photography & Culture, Vol 7, issue 3, 2014 Burch supplied information for ‘Comics Unmasked, Art and Anarchy in the UK' at the British Library,Curated by Paul Gravett and John Harris Dunning, ‘Comics Unmasked, Art and Anarchy in the UK', British Library (May–August 2014), Ward is discussed on pages 127/8 of the accompanying publication; see  http://www.bl.uk/art-and-anarchy-in-british-comics which featured him as one of two British gay erotic comic illustrators. Ward's work was included in 'Model Men', an exhibition commemorating the 50th anniversary of the 1967 Sexual Offences Act in 2017.Menier Gallery, London, 24 July - 12 August 2017 The Japanese Manga artist Gengoroh Tagame cites Ward as an influence.See \"Inside the Taboo-Filled Mind of Japan's Best BDSM Manga Artist\" by Kaz Senju, March 7, 2016 interview for Vice at https://www.vice.com/en_au/read/inside-the-taboo-filled-mind-of-japans-best-bdsm-manga-artist"]}, {"page": "Christine Appleby", "response": ["May's death was a shock for Christine. As if having her mother die wasn't enough, she now had to manage the house and money on her own. The neighbours - especially Esther Hayes (Daphne Oxenford) - went out of their way to help her, but help also came from an unexpected source; plumber Joe Makinson (Brian Rawlinson) did her plumbing for free and asked her out. Christine was worried that he was taking advantage, but agreed to date, and a relationship soon emerged that led to a proposal after only a short time. Christine dumped Joe as they weren't quite on the same level."]}, {"page": "List of former Coronation Street characters", "response": ["|Joe Makinson || Brian Rawlinson || 1961, 1963, 1970"]}, {"page": "The Big Job (film)", "response": ["*Brian Rawlinson as Henry Blobbitt "]}, {"page": "Last of the Summer Wine (series 17)", "response": ["*Guest Appearance Brian Rawlinson"]}, {"page": "No Kidding (film)", "response": ["* Brian Rawlinson as Will"]}, {"page": "Ladies Who Do", "response": ["*Brian Rawlinson as Shop Steward"]}, {"page": "The Unstoppable Man", "response": ["* Brian Rawlinson as Moonlight Jackson"]}, {"page": "Stockport School", "response": ["* Brian Rawlinson, actor and writer"]}, {"page": "Stage 2", "response": ["| Ian McKellen, Charles Gray, Barrie Ingham, John Bennett, Martin Jarvis, Edward Fox, Brian Rawlinson, Michael Robbins"]}, {"page": "Rawlinson, Brian", "response": ["#redirectBrian Rawlinson"]}]}}