{"wiki_id": "http://www.wikidata.org/entity/Q912608", "itemLabel": "Brian Mackenzie, Baron Mackenzie of Framwellgate", "itemDescription": "British peer (born 1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Mackenzie,_Baron_Mackenzie_of_Framwellgate", "wikipedia_page": {"main": "Brian Mackenzie, Baron Mackenzie of Framwellgate, OBE (born 21 March 1943) is a former British Labour and now non-aligned member of the House of Lords. He is the former President of the Police Superintendents' Association.", "link_mentions": [{"page": "Lynsey de Paul", "response": ["De Paul returned to the public spotlight in a different role in 1992 when she released a self-defence video for women called Taking Control. As well as starring in the video, both as the presenter and demonstrator of self-defence techniques, she co-wrote and was the producer for the theme song and incidental music with Ian Lynn.  Brian Mackenzie, Baron Mackenzie of Framwellgate, former president of the Police Association, endorsed it by saying: \"It is a very positive contribution to crime prevention and the protection of women and I will be recommending it\". She also presented a documentary about women's self-defence, called Eve Fights Back, which won a Royal Television Society award. A book based on the programme and video written by de Paul and Clare McCormick with the title Taking Control: Basic Mental & Physical Self Defence for Women, was published by Boxtree in 1993.Taking Control, Boxtree Publishing,  In 2006, an updated DVD of her self-defence training programme, Taking Control: Simple Mental & Physical Self Defence for Women, was released  and featured on television (The Wright Stuff) and in the media. The programme showed the importance of self-defence for women, and she approached schools and universities to include the DVD in the curriculum. It was also released in Germany, with the title Selbstverteidigung für Frauen: Das komplette Trainingsprogramm dubbed in German."]}, {"page": "Brian Mackenzie", "response": ["#REDIRECT Brian Mackenzie, Baron Mackenzie of Framwellgate"]}, {"page": "Baron Mackenzie of Framwellgate", "response": ["#REDIRECT Brian Mackenzie, Baron Mackenzie of Framwellgate"]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Brian Mackenzie, Baron Mackenzie of Framwellgate"]}, {"page": "Lord Mackenzie", "response": ["*Brian Mackenzie, Baron Mackenzie of Framwellgate, member of the House of Lords"]}, {"page": "Lord Mackenzie of Framwellgate", "response": ["#REDIRECT Brian Mackenzie, Baron Mackenzie of Framwellgate"]}, {"page": "Brian McKenzie", "response": ["* Brian Mackenzie, Baron Mackenzie of Framwellgate (born 1943), British Labour member of the House of Lords"]}, {"page": "Eve Fights Back", "response": ["Lord Mackenzie (Brian Mackenzie, Baron Mackenzie of Framwellgate), former president of the Police Superintendents' Association endorsed the self-defence advice presented by de Paul, saying: \"It is a very positive contribution to crime prevention and the protection of women and I will be recommending it.\""]}]}}