{"wiki_id": "http://www.wikidata.org/entity/Q9139567", "itemLabel": "Adam Freeman-Pask", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Freeman-Pask", "wikipedia_page": {"main": "Adam Freeman-Pask (born 19 June 1985) is a British International rower, World Bronze medalist, European Silver medalist and London 2012 Olympian.", "link_mentions": [{"page": "Wingfield Sculls", "response": ["|2011||\tAdam Freeman-Pask\t||Imperial College\t||\t19.41 (record)\t||\tPutney to Mortlake"]}, {"page": "The Windsor Boys' School", "response": ["* Adam Freeman-Pask British International rower, World Bronze medalist, European Silver medalist and London 2012 Olympian."]}, {"page": "2013 World Rowing Championships", "response": ["| Adam Freeman-PaskWill FletcherJono CleggChris Bartley || 5:59.98"]}, {"page": "Chris Bartley (rower)", "response": ["He competed at the 2013 World Rowing Championships in Chungju, where he won a bronze medal as part of the lightweight coxless four with Adam Freeman-Pask, Will Fletcher and Jono Clegg."]}, {"page": "2012 European Rowing Championships", "response": ["|Sam ScrimgeourAdam Freeman-PaskWilliam FletcherJonathan Clegg  || 6:01.74"]}, {"page": "Jono Clegg", "response": ["Jonathan Clegg (born 14 July 1989) known as Jono Clegg is a British rower who competed at the 2016 Summer Olympics. Clegg competed at the 2013 World Rowing Championships in Chungju, where he won a bronze medal as part of the lightweight coxless four with Adam Freeman-Pask, Will Fletcher and Chris Bartley. The following year he competed at the 2014 World Rowing Championships in Bosbaan, Amsterdam, where he won a bronze medal as part of the lightweight coxless pair with Sam Scrimgeour."]}, {"page": "Will Fletcher", "response": ["He competed at the 2013 World Rowing Championships in Chungju, where he won a bronze medal as part of the lightweight coxless four with Adam Freeman-Pask, Jono Clegg and Chris Bartley."]}, {"page": "Freeman-Pask, Adam", "response": ["#redirectAdam Freeman-Pask"]}]}}