{"wiki_id": "http://www.wikidata.org/entity/Q9140805", "itemLabel": "Adelle Tracey", "itemDescription": "British athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Adelle_Tracey", "wikipedia_page": {"main": "Adelle Tracey (born 27 May 1993) is a British middle-distance runner competing primarily in the 800 metres. She achieved her 800 metres best of 1:59.86 in the  2018 European Championships semifinals, and went on to finish fourth in the final.", "link_mentions": [{"page": "Olympic flame", "response": ["At the 2012 Games in London, the torch was carried by Sir Steve Redgrave to a group of seven young British athletes (Callum Airlie, Jordan Duckitt, Desiree Henry, Katie Kirk, Cameron MacRitchie, Aidan Reynolds and Adelle Tracey)  — each nominated by a British Olympic champion — who then each lit a single tiny flame on the ground, igniting 204 copper petals before they converged to form the cauldron for the Games.", "*At the 2012 Summer Olympics in London, the flame was passed to a group of seven young British athletes (Callum Airlie, Jordan Duckitt, Desiree Henry, Katie Kirk, Cameron MacRitchie, Aidan Reynolds, and Adelle Tracey) who then each lit a single tiny flame on the ground, igniting 204 petals. The cauldron that traditionally flames continuously from the opening until the closing ceremony was temporarily extinguished (the flame itself was transferred to a lantern) prior to the athletics events while the cauldron was moved to the southern side of the stadium. It was relit by Austin Playfoot, a torchbearer from the 1948 Olympics. In contrast to the cauldrons in Vancouver, the cauldron was not visible to the public outside the stadium. Instead, monitors had been placed throughout the Olympic Park showing the public live footage of the flame."]}, {"page": "Vanderlei de Lima", "response": ["*  The complete biography by Renata Adrião D´Angelo| before = Callum Airlie, Jordan Duckitt, Desiree Henry, Katie Kirk, Cameron MacRitchie, Aidan Reynolds, and Adelle Tracey"]}, {"page": "2012 Summer Olympics", "response": ["The relay focused on National Heritage Sites, locations with sporting significance, key sporting events, schools registered with the Get Set School Network, green spaces and biodiversity, Live Sites (city locations with large screens), and festivals and other events. Dumfries and Galloway was the only Region in the whole of the United Kingdom that had the Olympic Torch pass through it twice. A group of young athletes, nominated by retired Olympic athletes, ran the torch around the stadium. These torchbearers were Callum Airlie, Jordan Duckitt, Desiree Henry, Katie Kirk, Cameron MacRitchie, Aidan Reynolds, and Adelle Tracey. Together the torchbearers each lit a petal which spread the fire to the 204 petals of the cauldron, representing the countries that participated in the Games. The cauldron was designed by Thomas Heatherwick."]}, {"page": "500 metres", "response": ["|Adelle Tracey"]}, {"page": "List of torchbearers who have lit the Olympic cauldron", "response": ["! scope=\"row\"| Adelle Tracey"]}, {"page": "2012 Summer Olympics opening ceremony", "response": ["*Adelle Tracey (Kelly Holmes)"]}, {"page": "Chronological summary of the 2012 Summer Olympics", "response": ["*The Olympic Cauldron was lit by seven young sportspeople, each of whom had been nominated by a past British Olympian. The seven were; Cameron MacRitchie, rower, nominated by Steve Redgrave; Adelle Tracey, athlete, nominated by Kelly Holmes; Katie Kirk, athlete, nominated by Mary Peters; Desirèe Henry, athlete, nominated by Daley Thompson; Jordan Duckitt, nominated by Duncan Goodhew; Aidan Reynolds, javelin thrower, nominated by Lynn Davies; Callum Airlie, sailor, nominated by Shirley Robertson."]}, {"page": "2012 Summer Olympics and Paralympics cauldron", "response": ["The identity of the athlete who was to light the cauldron also remained secret.  It transpired that, to reflect 'Inspire a Generation' theme of the 2012 Games, seven young athletes were chosen for that honour. Sir Steve Redgrave carried the flame into the stadium and passed it on to one of a team of six young athletes and one young volunteer, each nominated by a famous British Olympian. The torchbearers were (nominator in brackets): Callum Airlie (Shirley Robertson), Jordan Duckitt (Duncan Goodhew), Desiree Henry (Daley Thompson), Katie Kirk (Mary Peters), Cameron MacRitchie (Steve Redgrave), Aidan Reynolds (Lynn Davies) and Adelle Tracey (Kelly Holmes)."]}, {"page": "2021 in sports", "response": ["** Women's 800 m winner:  Adelle Tracey"]}, {"page": "2015 European Athletics U23 Championships – Women's 800 metres", "response": ["| 4 || align=left | Adelle Tracey || align=left |  || 2:01.66 || ", "| 2 || align=left | Adelle Tracey || align=left |  || 2:04.85 || Q"]}, {"page": "Craig Winrow", "response": ["Nowadays he works as a coach. He has trained, among others, Andrew Osagie and Adelle Tracey."]}, {"page": "2016 IAAF World Indoor Championships – Women's 800 metres", "response": ["| 15 || 3 || align=left|Adelle Tracey || align=left| || 2:07.05 ||"]}, {"page": "2016 British Indoor Athletics Championships", "response": ["|Adelle Tracey"]}, {"page": "2016 European Athletics Championships – Women's 800 metres", "response": ["| 24 || 4 || 4 || align=left|Adelle Tracey || align=left| || 2:05.41 ||"]}, {"page": "Great Britain at the 2016 European Athletics Championships", "response": ["|align=left|Adelle Tracey"]}, {"page": "Great Britain and Northern Ireland at the 2017 World Championships in Athletics", "response": ["|style=text-align:left|Adelle Tracey"]}, {"page": "2017 World Championships in Athletics – Women's 800 metres", "response": ["| 4 || 6 || 3 || style=\"text-align:left;\"|Adelle Tracey || style=\"text-align:left;\"| || 2:00.28 || , ", "| 11 || 1 || 9 || style=\"text-align:left;\"|Adelle Tracey || style=\"text-align:left;\"| || 2:00.26 || "]}, {"page": "Great Britain at the 2017 Summer Universiade", "response": ["|align=left|Adelle Tracey"]}, {"page": "Athletics at the 2017 Summer Universiade – Women's 800 metres", "response": ["| 10 || 4 || align=left|Adelle Tracey || align=left| || 2:05.78 || Q", "| 7 || 1 || align=left|Adelle Tracey || align=left| || 2:03.30 || Q", "| 5 || align=left|Adelle Tracey || align=left| || 2:03.72 ||"]}, {"page": "England at the 2018 Commonwealth Games", "response": ["|align=left|Adelle Tracey"]}, {"page": "2017 British Indoor Athletics Championships", "response": ["|Adelle Tracey || 2:04.04"]}, {"page": "2018 Athletics World Cup", "response": ["|  || 7 || align=left|Adelle Tracey || align=left| || 2:01.05 ||  || 7"]}, {"page": "Great Britain and Northern Ireland at the 2018 Athletics World Cup", "response": ["|align=left|Adelle Tracey"]}, {"page": "2018 British Athletics Championships", "response": ["| Adelle Tracey || 2:02.00"]}, {"page": "Great Britain and Northern Ireland at the 2018 European Athletics Championships", "response": ["|align=left|Adelle Tracey"]}, {"page": "2018 European Athletics Championships – Women's 800 metres", "response": ["| 9 || 2 || 2 || align=left|Adelle Tracey || align=left| || 2:01.91 ||   ", "| 2 || 2 || 7 || align=left|Adelle Tracey || align=left| || 1:59.86 || , ", "|  || 4 || align=left|Adelle Tracey || align=left| || 2:00.86 || "]}, {"page": "2019 European Athletics Indoor Championships – Women's 800 metres", "response": ["| 2 || 1 || align=left|Adelle Tracey || align=left| || 2:02.51 || Q", "| 7 || 1 || align=left|Adelle Tracey || align=left| || 2:03.26 ||"]}, {"page": "2017 British Athletics Championships", "response": ["| Adelle Tracey || 2:01.80 "]}, {"page": "2018 British Indoor Athletics Championships", "response": ["|Adelle Tracey || 2:04.61"]}, {"page": "2019 British Indoor Athletics Championships", "response": ["|Adelle Tracey || 2:05.72"]}, {"page": "2020 in the sport of athletics", "response": ["| 10 || 1:59.87 || Adelle Tracey ||align=left|"]}]}}