{"wiki_id": "http://www.wikidata.org/entity/Q9141277", "itemLabel": "Adrian Darby", "itemDescription": "British conservationist", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Darby", "wikipedia_page": {"main": "Adrian Marten George Darby,  (born 25 September 1937) is a British conservationist and academic.", "link_mentions": [{"page": "Adrian", "response": ["*Adrian Darby (born 1937), British conservationist and academic"]}, {"page": "Kemerton Court", "response": ["Kemerton Court is set in parkland and is surrounded by a farming estate of around .  It is owned by conservationist Adrian Darby, president of Plantlife and former chairman of the RSPB. He is married to Lady Meriel Darby, daughter of the former Prime Minister, Alec Douglas-Home, 14th Earl of Home, who was a frequent visitor to the Court."]}, {"page": "Kemerton Conservation Trust", "response": ["Adrian Darby OBE (chairman), Matthew Darby, Peter Doble, Richard Knight, Lord Howick of Glendale, Prof. David Macdonald, Carl Nicholson, Dr Margaret Palmer MBE, Roger Workman."]}, {"page": "Matthew Darby", "response": ["Matthew George Darby, (born 27 August 1967) is a British conservationist and former publisher.  He is the son of Adrian Darby and Lady Meriel Darby, daughter of former British Prime Minister, Sir Alec Douglas-Home (also known as 14th Earl of Home, and Lord Home of the Hirsel).  Home's correspondence with Darby was published as Letters to a Grandson in 1983.    "]}, {"page": "Darby (name)", "response": ["*Adrian Darby (born 1937), British environmentalist"]}, {"page": "Adrian Marten George Darby", "response": ["#REDIRECT Adrian Darby "]}, {"page": "Martin Stopford", "response": ["Stopford was born in Bolton, Lancashire in 1947, son of a clergyman. He was educated at Prestfelde School, Shrewsbury and Denstone College, Staffordshire. In 1966 he won an Abbott Scholarship to Keble College, Oxford in 1969 where he studied Politics, Philosophy and Economics (PPE) under Adrian Darby, James Griffin, Paul Hayes, and Basil Mitchell. Stopford went on to receive a Doctor of Philosophy Degree in Economics from Birkbeck College, part of the University of London, which he completed in 1979."]}]}}