{"wiki_id": "http://www.wikidata.org/entity/Q918672", "itemLabel": "John Kerr", "itemDescription": "Scottish physicist and pioneer in the field of electro-optics", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kerr_(physicist)", "wikipedia_page": {"main": "John Kerr FRS (; 17 December 1824 – 15 August 1907) was a Scottish physicist and a pioneer in the field of electro-optics. He is best known for the discovery of what is now called the Kerr effect.", "link_mentions": [{"page": "List of physicists", "response": ["*John Kerr – Scotland (1824–1907)"]}, {"page": "Timeline of electromagnetism and classical optics", "response": ["* 1875 – John Kerr discovers the electrically induced birefringence of some liquids"]}, {"page": "Birefringence", "response": ["* John Kerr"]}, {"page": "List of scientific constants named after people", "response": ["* Kerr constant – John Kerr"]}, {"page": "John Kerr", "response": ["John Kerr may refer to:", "* John Kerr (Ohio politician) (1778–1823), mayor of Columbus, Ohio", "* John Kerr (Virginia politician) (1782–1842), Virginia politician", "* John Kerr Jr. (congress) (1811–1879), North Carolina politician and jurist", "* John Kerr, 7th Marquess of Lothian (1794–1841), Scottish politician and peer", "* John Kerr (British politician) (1852–1925), UK MP for Preston, 1903–1906", "* John Kerr, Baron Kerr of Kinlochard (born 1942), British diplomat", "* John Kerr (governor-general) (1914–1991), Australian Governor-General", "* John Kerr (Nelson politician) (1830–1898), New Zealand politician", "* John Kerr (Auckland politician), New Zealand politician", "* John Kerr (physicist) (1824–1907), Scots physicist", "* John Kerr (pathologist) (born 1934), Australian pathologist", "* John Kerr (author) (1950–2016), American editor, psychologist", "* John Kerr (Royal Navy officer) (1937–2019), British admiral", "* John Kerr (Scottish cricketer) (1885–1972), Scottish cricketer from Greenock", "* John Kerr (baseball) (1898–1993), American baseball player", "* John Kerr (Australian footballer) (1934–2005), Australian rules footballer", "* John Kerr Sr. (1943–2011), Scottish-born Canadian soccer player", "* John Kerr (sailor) (born 1951), Canadian sailor", "* John Kerr (footballer, born 1959) (1959–2006), English footballer for Tranmere Rovers, Bristol City", "* John Kerr Jr. (soccer) (born 1965), American", "* John Kerr (figure skater) (born 1980), Scottish ice dancer", "* John Kerr (Scottish footballer), Scottish footballer", "* John Kerr (singer) (c.1925-2006), Irish ballad singer", "* John Kerr (actor) (1931–2013), American actor and lawyer", "* John Kerr (broadcaster) (born 1942), Australian radio broadcaster", "* John Kerr (minister) (1852–1920), Scottish minister, sportsman and sporting author"]}, {"page": "Scientific phenomena named after people", "response": ["* Kerr effect – John Kerr"]}, {"page": "Faraday effect", "response": ["By 1845, it was known through the work of Fresnel, Malus, and others that different materials are able to modify the direction of polarization of light when appropriately oriented, making polarized light a very powerful tool to investigate the properties of transparent materials. Faraday firmly believed that light was an electromagnetic phenomenon, and as such should be affected by electromagnetic forces. He spent considerable effort looking for evidence of electric forces affecting the polarization of light through what are now known as electro-optic effects, starting with decomposing electrolytes. However, his experimental methods were not sensitive enough, and the effect was only measured thirty years later by John Kerr."]}, {"page": "Kerr effect", "response": ["The Kerr effect, also called the quadratic electro-optic (QEO) effect, is a change in the refractive index of a material in response to an applied electric field. The Kerr effect is distinct from the Pockels effect in that the induced index change is directly proportional to the square of the electric field instead of varying linearly with it. All materials show a Kerr effect, but certain liquids display it more strongly than others. The Kerr effect was discovered in 1875 by John Kerr, a Scottish physicist."]}, {"page": "List of eponyms (A–K)", "response": ["* John Kerr, Scottish physicist – Kerr effect"]}, {"page": "Ardrossan", "response": ["*John Kerr, physicist who discovered the now-eponymous Kerr effect."]}, {"page": "List of Scottish scientists", "response": ["| John Kerr"]}, {"page": "List of University of Glasgow people", "response": ["* John Kerr, physicist"]}, {"page": "Free Church Training College", "response": ["*John Kerr"]}, {"page": "Magneto-optic Kerr effect", "response": ["The magneto-optic Kerr effect was discovered in 1877 by John Kerr.", "*John Kerr"]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| John Kerr||5 June 1890||17 December 1824 – 18 August 1907"]}, {"page": "Index of physics articles (J)", "response": ["*John Kerr (physicist)"]}, {"page": "1824 in Scotland", "response": ["* 17 December – John Kerr, physicist (died 1907)"]}, {"page": "List of fellows of the Royal Society elected in 1890", "response": ["# John Kerr (1824–1907)"]}, {"page": "A History of the Theories of Aether and Electricity", "response": ["The first chapter covers the 17th-century development of the theory of aether. Beginning with Descartes' conjectures, the chapter focuses on contributions from Christiaan Huygens and Isaac Newton while it highlights the work of Petrus Peregrinus, William Gilbert, Pierre de Fermat, Robert Hooke, Galileo, and Ole Rømer. Chapter 2 covers the initial mathematical development of the magnetic field before the introduction of the vector potential and scalar potential, covering action at a distance. The third chapter covers galvanism, beginning with Luigi Galvani and extending through Georg Ohm's theory of the circuit. Chapter 4 covers the early developments of the luminiferous aether theories stretch from James Bradley to Augustin-Jean Fresnel. The fifth chapter covers the developments that mostly take place over the first half of the nineteenth century, with some contributions by Joseph Valentin Boussinesq and Lord Kelvin. Here the idea of the luminiferous aether is modelled as an elastic solid. Chapter 6 focuses almost exclusively on the experiments of Michael Faraday. Chapter seven discusses the mathematicians who worked after Faraday but before James Clerk Maxwell and who adopted views of action at a distance over Faraday's lines of force. The chapter includes a discussion of the contributions made by Franz Neumann, Wilhelm Eduard Weber, Bernhard Riemann, James Prescott Joule, Hermann von Helmholtz, Lord Kelvin, Gustav Kirchhoff, and Jean Peltier. Chapter 8 focuses on Maxwell's contributions to electromagnetism and Chapter 9 details further developments to the models of aether made after Maxwell's publications. Contributions by Lord Kelvin, Carl Anton Bjerknes, James MacCullagh, Bernhard Riemann, George Francis FitzGerald, and William Mitchinson Hicks. The tenth chapter covers physicists following in Maxwell's tracks in the mid-nineteenth century, with contributions from Helmholtz, Fitzgerald, Weber, Hendrik Lorentz, H. A. Rowland, J. J. Thomson, Oliver Heaviside, John Henry Poynting, Heinrich Hertz, and John Kerr. Chapter 11 covers the conduction in solids and gases extending from Faraday's work, covered in chapter six, to that of J. J. Thomson while the final chapter gives an account of the theories of aether in the late 1800s, ending with Owen Willans Richardson's work at the turn of the century."]}, {"page": "List of nominees for the Nobel Prize in Physics", "response": ["|John Kerr "]}]}}