{"wiki_id": "http://www.wikidata.org/entity/Q918587", "itemLabel": "William Froude", "itemDescription": "British engineer and naval architect", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Froude", "wikipedia_page": {"main": "William Froude (; 28 November 1810 in Devon – 4 May 1879 in Simonstown, South Africa) was an English engineer, hydrodynamicist and naval architect. He was the first to formulate reliable laws for the resistance that water offers to ships (such as the hull speed equation) and for predicting their stability.\n\n", "link_mentions": [{"page": "Cavitation", "response": ["The term cavitation first appeared in 1895 in a paper by John Isaac Thornycroft (1843–1928) and Sydney Walker Barnaby (1855–1925) — son of Sir Nathaniel Barnaby (1829 – 1915), who had been Chief Constructor of the Royal Navy — to whom it had been suggested by the British engineer Robert Edmund Froude (1846–1924), third son of the English hydrodynamicist William Froude (1810–1879). From p. 67:  \" 'Cavitation,' as Mr. Froude has suggested to the Authors that the phenomenon should be called, … \"  Early experimental studies of cavitation were conducted in 1894-5 by Thornycroft and Barnaby and by the Anglo-Irish engineer Charles Algernon Parsons (1854-1931), who constructed a stroboscopic apparatus to study the phenomenon. The stroboscope is described on p. 234:  \"The screw [i.e., propeller] was illuminated by light from an arc lamp reflected from a revolving mirror attached to the screw shaft, which fell on it at one point only of the revolution, and by this means the shape, form, and growth of the cavities could be clearly seen and traced as if stationary.\"See: "]}, {"page": "List of agnostics", "response": ["* William Froude (1810–1879): English engineer, hydrodynamicist and naval architect; first to formulate reliable laws for the resistance that water offers to ships (such as the hull speed equation) and for predicting their stability"]}, {"page": "November 28", "response": ["*1810 – William Froude, English engineer and architect (d. 1879)"]}, {"page": "James Anthony Froude", "response": ["He was the son of Robert Hurrell Froude, archdeacon of Totnes, and his wife Margaret Spedding (d. 1821). James Anthony was born at Dartington, Devon on 23 April 1818.  He was the youngest of eight children, including engineer and naval architect William Froude and Anglo-Catholic polemicist Richard Hurrell Froude, who was fifteen years his elder. By James' third year his mother and five of his siblings had died of consumption, leaving James to what biographer Herbert Paul describes as a \"loveless, cheerless boyhood\" with his cold, disciplinarian father and brother Richard. He studied at Westminster School from age 11 until 15, where he was \"persistently bullied and tormented\".  Despite his unhappiness and his failure in formal education, Froude cherished the classics and read widely in history and theology."]}, {"page": "Osborne Reynolds", "response": ["Reynolds' contributions to fluid mechanics were not lost on ship designers (\"naval architects\"). The ability to make a small scale model of a ship, and extract useful predictive data with respect to a full size ship, depends directly on the experimentalist applying Reynolds' turbulence principles to friction drag computations, along with a proper application of William Froude's theories of gravity wave energy and propagation. Reynolds himself had a number of papers concerning ship design published in Transactions of the Institution of Naval Architects."]}, {"page": "West Midlands (region)", "response": ["Roger Dyson Group manufactures auto-recovery vehicles off the A442 in north Droitwich, near Vax and Koito Europe (car headlamps). South of Bromsgrove, on the B4091 at Stoke Prior, L.G. Harris & Co make paintbrushes. Lea & Perrins is in Worcester. Joy Mining Machinery are on the A44 in the west of Worcester. Worcester, Bosch Group make 1,200 boilers a day. Mazak UK have the parent company's European manufacturing facility (for CNC machine tools) on the B4639 in the north of Worcester, next to the Worcester and Birmingham Canal; nearby on the Blackpole Ind Est, Froude Hofmann have their world headquarters, who make dynamometers, originated from William Froude (formerly Heenan & Froude)."]}, {"page": "Froude number", "response": ["In continuum mechanics, the Froude number () is a dimensionless number defined as the ratio of the flow inertia to the external field (the latter in many applications simply due to gravity). Named after William Froude (Merriam Webster Online (for brother James Anthony Froude) ), the Froude number is based on the speed–length ratio which he defined as:", "thumb|right|The hulls of swan (above) and raven (below). A sequence of 3, 6, and 12 (shown in the picture) foot scale models were constructed by Froude and used in towing trials to establish resistance and scaling laws. Quantifying resistance of floating objects is generally credited to William Froude, who used a series of scale models to measure the resistance each model offered when towed at a given speed.  The naval constructor Frederic Reech had put forward the concept much earlier in 1852 for testing ships and propellers but Froude was unaware of it. Speed–length ratio was originally defined by Froude in his Law of Comparison in 1868 in dimensional terms as:"]}, {"page": "1879 in science", "response": ["* May 4 – William Froude (born 1810), English hydrodynamicist."]}, {"page": "1810 in science", "response": ["* November 28 – William Froude (died 1879), English hydrodynamicist."]}, {"page": "1861 in science", "response": ["* William Froude publishes the first results of his research into ship hull design.\"On the rolling of ships.\" Transactions of the Institution of Naval Architects 2 (1861): pp. 180–227; 3 (1862): pp. 45–62."]}, {"page": "Blade element theory", "response": ["Blade element theory (BET) is a mathematical process originally designed by  William Froude (1878), David W. Taylor (1893) and Stefan Drzewiecki to determine the behavior of propellers. It involves breaking a blade down into several small parts then determining the forces on each of these small blade elements. These forces are then integrated along the entire blade and over one rotor revolution in order to obtain the forces and moments produced by the entire propeller or rotor. One of the key difficulties lies in modelling the induced velocity on the rotor disk. Because of this the blade element theory is often combined with momentum theory to provide additional relationships necessary to describe the induced velocity on the rotor disk, producing blade element momentum theory. At the most basic level of approximation a uniform induced velocity on the disk is assumed:", "400x400px|Fig 2. Aerodynamic forces on a blade element.|thumbWhile the momentum theory is useful for determining ideal efficiency, it gives a very incomplete account of the action of screw propellers, neglecting among other things the torque. In order to investigate propeller action in greater detail, the blades are considered as made up of a number of small elements, and the air forces on each element are calculated. Thus, while the momentum theory deals with the flow of the air, the blade-element theory deals primarily with the forces on the propeller blades. The idea of analyzing the forces on elementary strips of propeller blades was first published by William Froude in 1878. It was also worked out independently by Drzewiecki and given in a book on mechanical flight published in Russia seven years later, in 1885.This fact, which is not generally known in English-speaking countries, was called to the author’s attention by Prof. F. W. Pawlowski of the University of Michigan. Drzewiecki’s first French paper on his theory was published in 1892. He wrote in all seven papers on aircraft propulsion which were presented to l’Academie des Sciences, l’Association Technique Maritime, and Le Congrès International d’Architecture et de Construction Navale, held on July 15, 1900. He finally wrote a book summing up all of his work called \"Théorie Générale de l’Hé1ice Propulsive,\" published in 1920 by Gauthier-Villars in Paris. Again, in 1907, Lanchester published a somewhat more advanced form of the blade-element theory without knowledge of previous work on the subject. The simple blade-element theory is usually referred to, however, as the Drzewiecki theory, for it was Drzewiecki who put it into practical form and brought it into general use. Also, he was the first to sum up the forces on the blade elements to obtain the thrust and torque for a whole propeller and the first to introduce the idea of using airfoil data to find the forces on the blade elements."]}, {"page": "Scientific phenomena named after people", "response": ["* Froude number – William Froude"]}, {"page": "List of irregularly spelled English names", "response": ["|William Froude"]}, {"page": "Ship model basin", "response": ["thumb|right|US Experimental Model Basin, circa 1900The eminent English engineer, William Froude published a series of influential papers on ship designs for maximising stability in the 1860s. The Institution of Naval Architects eventually commissioned him to identify the most efficient hull shape. He validated his theoretical models with extensive empirical testing, using scale models for the different hull dimensions. He established a formula (now known as the Froude number) by which the results of small-scale tests could be used to predict the behaviour of full-sized hulls. He built a sequence of 3, 6 and (shown in the picture) 12 foot scale models and used them in towing trials to establish resistance and scaling laws. His experiments were later vindicated in full-scale trials conducted by the Admiralty and as a result the first ship model basin was built, at public expense, at his home in Torquay.  Here he was able to combine mathematical expertise with practical experimentation to such good effect that his methods are still followed today."]}, {"page": "Dynamometer", "response": ["The water brake absorber is sometimes mistakenly called a \"hydraulic dynamometer\". Invented by British engineer William Froude in 1877 in response to a request by the Admiralty to produce a machine capable of absorbing and measuring the power of large naval engines, water brake absorbers are relatively common today. They are noted for their high power capability, small size, light weight, and relatively low manufacturing costs as compared to other, quicker reacting, \"power absorber\" types.", "Froude Ltd, of Worcester, UK, manufactures engine and vehicle dynamometers. They credit William Froude with the invention of the hydraulic dynamometer in 1877, and say that the first commercial dynamometers were produced in 1881 by their predecessor company, Heenan & Froude."]}, {"page": "Cullompton", "response": ["The nave and chancel are carried on five pairs of piers and the interior has a boarded wagon roof coloured in blue, crimson and gold which stretches the whole length of the church. At the time of the construction of the Bristol and Exeter Railway, William Froude – the engineer given responsibility for this section of the line by Isambard Kingdom Brunel – inserted iron stringers to prevent the walls from spreading as a result of vibrations from the trains. A screen runs across the whole width of the church.", "* The engineer William Froude lived in Cullompton and was churchwarden in 1842–44. "]}, {"page": "Hurrell Froude", "response": ["He was born in Dartington, Devon, the eldest son of Robert Froude (Archdeacon of Totnes) and the elder brother of historian James Anthony Froude and engineer and naval architect William Froude. He was educated at Ottery St Mary school, and went to Eton College at the age of thirteen. His mother, the first great influence in his life, died when he was eighteen; he matriculated at Oriel College, Oxford, a few weeks later."]}, {"page": "1879 in South Africa", "response": ["* 4 May – William Froude, engineer, hydrodynamicist and naval architect, dies in Simon's Town"]}, {"page": "History of fluid mechanics", "response": ["German engineers have also devoted special attention to the measurement of the flow in rivers; the Beiträge zur Hydrographie des Königreiches Böhmen (Prague, 1872–1875) of Andreas Rudolf Harlacher contained valuable measurements of this kind, together with a comparison of the experimental results with the formulae of flow that had been proposed up to the date of its publication, and important data were yielded by the gaugings of the Mississippi made for the United States government by Andrew Atkinson Humphreys and Henry Larcom Abbot, by Robert Gordon's gaugings of the Irrawaddy River, and by Allen J. C. Cunningham's experiments on the Ganges canal. The friction of water, investigated for slow speeds by Coulomb, was measured for higher speeds by William Froude (1810–1879), whose work is of great value in the theory of ship resistance (Brit. Assoc. Report., 1869), and stream line motion was studied by Professor Osborne Reynolds and by Professor Henry S. Hele-Shaw."]}, {"page": "Aleksey Krylov", "response": ["Fame came to him in the 1890s, when his pioneering Theory of oscillating motions of the ship, significantly extending William Froude's rolling theory, became internationally known. This was the first comprehensive theoretical study in the field. In 1898 Krylov received a Gold Medal from the Royal Institution of Naval Architects, the first time the prize was awarded to a foreigner. He also created a theory of damping of ship rolling and pitching, and was the first to propose gyroscopic damping which now is the most common way of damping the roll."]}, {"page": "Track transition curve", "response": ["On early railroads, because of the low speeds and wide-radius curves employed, the surveyors were able to ignore any form of easement, but during the 19th century, as speeds increased, the need for a track curve with gradually increasing curvature became apparent. Rankine's 1862 \"Civil Engineering\" cites several such curves, including an 1828 or 1829 proposal based on the \"curve of sines\" by William Gravatt, and the curve of adjustment by William Froude around 1842 approximating the elastic curve. The actual equation given in Rankine is that of a cubic curve, which is a polynomial curve of degree 3, at the time also known as a cubic parabola."]}, {"page": "Scottish Maritime Museum", "response": ["The Denny Ship Model Experiment Tank, in Dumbarton, focuses on the world of the naval architect. Shipbuilder William Denny Jr of William Denny and Brothers was inspired by the work of eminent naval architect William Froude and completed the tank for his shipyard in 1883. It was the world's first commercial example of a ship testing tank. Re-opened as a museum in 1982, it retains many of its original features, including the original 100-meter-long tank. The museum also tells the story of the test tank's original owners, William Denny and Brothers of Dumbarton, one of the most innovative shipbuilding companies in the world until their closure in 1963."]}, {"page": "Bristol and Exeter Railway", "response": ["William Gravatt was resident engineer for the construction between Bristol and White Ball (near Wellington, Somerset; usually spelt Whiteball in railway publications). William Froude supervised the section from there to Exeter.", "William Froude, resident engineer for the western section of the main line, developed an empirical method of setting out track transition curves and introduced an alternative design to the helicoidal skew arch bridge at Rewe and Cowley Bridge Junction, near Exeter.Brick and masonry arches constructed on heavy skews had been built with the course joints parallel to the abutments. Froude's system was to lay the arch rings on a helix so that the line of thrust was normal to the courses; this avoided primary shear forces in the joints but required more skilled workmanship."]}, {"page": "William Denny and Brothers", "response": ["Inspired by the work of eminent naval architect William Froude, Denny's completed the world's first commercial example of a ship testing tank in 1883. The facility was used to test models of various ships and explored various propulsion methods, including propellers, paddles and vane wheels. Experiments were carried out on models of the Denny-Brown stabiliser and the Denny hovercraft to gauge their feasibility. Tank staff also carried out research and experiments for other companies: Belfast-based Harland and Wolff decided to fit a bulbous bow on the liner  after successful model tests in the Denny Tank. After the Denny yard closed, the test tank facility was taken over by Vickers Shipbuilding and Engineering Limited and used for the testing of submarines until the early 1980s."]}, {"page": "Ship resistance and propulsion", "response": ["* William Froude"]}, {"page": "HMS Inflexible (1876)", "response": ["Barnaby wanted a ship both broader than existing designs to mimimise rolling and as short as possible to reduce its size as a target. Making a ship broader compared to its length was known to reduce its speed, so the innovative technique of water tank tests on models, pioneered by William Froude, was used to finalise a design. This was ten feet wider than Duillo and twenty-one feet shorter, the smallest ever ratio of length to breadth in a metal first class warship.Padfield p.84", "With a slenderness ratio of 4.6:1 Inflexible was a stable gun platform. Work by the hydrodynamicist William Froude had demonstrated that such a short length for the ship's width would not require excessive installed power at the design speed of . However, the same proportions were adopted in the similar but smaller  and , but resulted in a serious lack of directional stability in those ships."]}, {"page": "Froude", "response": ["* William Froude (1810–1879), British engineer and hydrodynamicist"]}, {"page": "Haslar", "response": ["Alongside the Gunboat Yard, within the same compound, stands the Admiralty Experiment Works (later part of the Defence Research Agency and now owned by QinetiQ). It contains a 540 ft concrete water tank, built in 1884 to test different hull designs using wax models, and still in use today. The tank was built for the Admiralty by Robert Edmund Froude in order to carry on the pioneering work of his father, William Froude, who had died in 1879. Over time, as the Gunboat Yard was reduced in size, the Experiment Works expanded to fill the available space."]}, {"page": "Anatole von Hügel", "response": ["In 1880 he married Eliza Margaret Froude, daughter of William Froude and in 1883 he became the first curator of the University of Cambridge Museum of Archaeology and Anthropology. He remained curator until 1921, raising funds for the new building. In 1889 he was admitted to Trinity College, Cambridge and received an MA. Hügel was founder and first president (1895 to 1922) of the Cambridge University Catholic Association, and would go on to co-found St Edmund's College, Cambridge with Henry Fitzalan-Howard, 15th Duke of Norfolk. There is a memorial plaque to Baron Anatole von Hügel on the wall in the St John Fisher chapel of the Catholic Church in Cambridge (Our Lady & English Martyrs, Lensfield Road, Cambridge). He was buried in Cambridge Cemetery on 20 August 1928, as was his wife, a member of the Cambridge Ladies Dining Society with 11 other members."]}, {"page": "Froude–Krylov force", "response": ["In fluid dynamics, the Froude–Krylov force—sometimes also called the Froude–Kriloff force—is a hydrodynamical force named after William Froude and Alexei Krylov. The Froude–Krylov force is the force introduced by the unsteady pressure field generated by undisturbed waves. The Froude–Krylov force does, together with the diffraction force, make up the total non-viscous forces acting on a floating body in regular waves. The diffraction force is due to the floating body disturbing the waves."]}, {"page": "1879 in the United Kingdom", "response": ["* 4 May – William Froude, hydrodynamicist (born 1810)"]}, {"page": "Similitude of ship models", "response": ["Worldwide, manned model schools have chosen to apply the similitude law of William Froude (1810-1879) for its manned models. This means that gravity is considered to be preponderant over the other forces acting on the hull (viscosity, capillarity, cavitation, compressibility, etc.)."]}, {"page": "CS Faraday (1874)", "response": ["Faraday was specially designed for  ocean cable-laying by William Siemens in collaboration with his friend William Froude, the pioneer of hull design.   Built with bows at each end she had twin screws positioned so that using one screw she could turn in her own length. The two funnels were located to either side to maximise clear deck space. To minimise rolling there were, at Froude's suggestion, enormous twin bilge keels. William's wife Anne launched the ship with the traditional smashing of a bottle of wine."]}, {"page": "Arthur Howe Holdsworth", "response": ["Following Holdsworth's stinging defeat for his Parliamentary seat in 1832 by Sir John Henry Seale, 1st Baronet, whose family had challenged the Holdsworth family's hold on the Corporation, all the Holdsworth family members left Dartmouth. The acrimony between the Holdsworths and their Seale family adversaries even forced the move of the 1839 marriage between Holdsworth's daughter Catherine Henrietta Elizabeth Holdsworth and civil engineer William Froude from Dartmouth, where the Holdsworths had long worshipped, to the Brixham parish church instead."]}]}}