{"wiki_id": "http://www.wikidata.org/entity/Q919061", "itemLabel": "Larissa Wilson", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Larissa_Wilson", "wikipedia_page": {"main": "Larissa Hope Wilson (born 5 May 1989) is an English former actress best known for her role as Jal Fazer in the first two series of the UK television series Skins.\n\n", "link_mentions": [{"page": "1989 in film", "response": ["* May 5 – Larissa Wilson, English actress"]}, {"page": "Skins (British TV series)", "response": ["Chris Miles (Joe Dempsie) is the party animal of the group. He has a difficult home life; he lost his brother to a hereditary subarachnoid haemorrhage at a young age, and is living alone due to his ambivalent father and absent mother. He has a crush on his psychology teacher Angie (Siwan Morris). Jal Fazer (Larissa Wilson) is a sensible girl with a talent for playing the clarinet. Her runaway mother has left Jal with her famous musician father and aspiring rapper brothers. She is best friends with Michelle. Maxxie Oliver (Mitch Hewer) is openly gay and has a passion for dance. He is portrayed as attractive, seductive and talented, and is well accepted by most of his friends and family, though his fights with his father about his future are depicted."]}, {"page": "Tony Stonem", "response": ["Tony's sexual encounters are supposedly vast. In \"Michelle\", Jal Fazer (Larissa Wilson) is able to recall a long list of his conquests. Michelle later puts to Abigail Stock (Georgina Moffat) that he \"fucks everyone... including boys.\" In \"Maxxie & Anwar\", Tony attempts an oral tryst with his gay friend Maxxie (Mitch Hewer). Tony does not specify a sexual orientation but he says to Maxxie that he simply wants \"to try something new\". In a psychology lesson, he equates sex with power and his lust for both is portrayed in his presentation. An aspect of his subconscious (portrayed as a college headmaster) refers to him as \"polysexual\", in series two's \"Tony\" episode. Bryan Elsley characterizes Tony's attempt to seduce Maxxie as an exploration of the character's sexual fluidity; in season one of the American adaptation, Maxxie's character is replaced by the character Tea (Sofia Black-D'Elia), and her sexual fluidity is substituted for Tony's. In the British series, Tony fits the older television and film archetype of the \"narcissistic, controlling, and stereotypically sociopathic 'bad bisexual'\"."]}, {"page": "List of Skins characters", "response": ["| Larissa Wilson", "| Jalander \"Jal\" Fazer || Larissa Wilson || 1–2 || 1.03, 1.09, 2.08, 2.10"]}, {"page": "Cassie Ainsworth", "response": ["In \"Chris\", Cassie gives Sid more hints about her affection towards him and asks him on a date. However, in \"Sid\", he is grounded so Cassie tells him she will come over to his house. However, she is stood up due to Tony Stonem (Nicholas Hoult) convincing Sid to accompany him and Michelle at his choir performance, and when Sid admits he was with Michelle, Cassie lashes out at him. Later on she attempts suicide by intaking a large amount of pills mixed with vodka. When Sid tries to visit her in hospital, Jal Fazer (Larissa Wilson) forces him to leave. In \"Michelle\", Sid visits rehab in order to make amends with Cassie and she accepts his apology, but Sid is dismayed when she reveals has a boyfriend, Simon (James Buckley).", "As a result of Sid's relationship with Michelle, Cassie becomes extremely promiscuous (with men and women) and mentally unstable: in \"Chris\", her actions result in her roommate Chris Miles (Joe Dempsie) losing his job as a junior property salesman and cause a significant amount of tension between him and his girlfriend Jal Fazer (Larissa Wilson) after Angie, Chris' ex-girlfriend and psychology teacher returns to Bristol; and in \"Effy\", she attributes her addiction to \"mindless sex\" to her failed relationship with Sid. After Sid becomes aware of her actions, he confronts her about her promiscuity, apologises for dating Michelle, and tells her he loves her. They reconcile."]}, {"page": "Jal Fazer", "response": ["Jalander \"Jal\" Fazer is a fictional character in the television series Skins portrayed by Larissa Wilson."]}, {"page": "April Pearson", "response": ["Pearson briefly appeared as Karen Shevlin an episode of the British medical drama series Casualty. She later made her feature film debut as sadistic schoolgirl Natasha Cummings, in Jon Wright's comedy horror slasher film Tormented (2009). She reunited with her Skins co-star Larissa Wilson, and starred opposite Alex Pettyfer, Tuppence Middleton and Georgia King."]}, {"page": "List of people with surname Wilson", "response": ["*Larissa Wilson (born 1989), English actress"]}, {"page": "List of British actors", "response": ["* Larissa Wilson (born 1989)"]}, {"page": "The Cafe (2004 talk show)", "response": ["Chats were conducted with two or three guests, there were comic inserts and a musical performance rounded off the show (although sometimes a musical performance may have started the show a well). Past guests included Jason Byrne and Donna and Joseph McCaul, PJ Gallagher and Tom McGurk, Glen Wallace and Jennifer Metcalfe, Caroline Morahan, Amanda Byram, Michelle Heaton, Nicola McLean, Daithí Ó Sé, The Kinetiks, The Coronas, Rosanna Davision, Jacob Byrne, Oliver Callan (aka Gay Byrne) and Pat Kenny, wrestlers Scotty 2 Hotty and Joe Legend, The Saw Doctors, panellist John Bishop and Skins actors Mike Bailey, Daniel Kaluuya and Larissa Wilson.", "| 4 April 2008 || Mike Bailey/Larissa Wilson/Daniel Kaluuya (Skins), Aoibhinn Ní Shúilleabháin (Celebrity Bainisteoir) || Nizlopi || \"Start Beginning\" || Details"]}, {"page": "List of American films of 2009", "response": ["| Tormented || Warner Bros. Pictures || Jon Wright (director); Alex Pettyfer, April Pearson, Calvin Dean, Georgia King, Tom Hopper, Larissa Wilson"]}, {"page": "Tormented (2009 British film)", "response": ["Five days earlier, Justine is reading the eulogy at the funeral of unpopular, asthmatic student Darren Mullet (Calvin Dean). Mullet's equally unpopular friend, Jason Banks (Olly Alexander), is (literally) thrown out of the church by the sadistic P.E. teacher after calling her a hypocrite because she did not really know him. Later, Justine agrees to go to a party with Alex (Dimitri Leonidas), organised by his popular friends, Bradley (Alex Pettyfer), Tasha (April Pearson), Khalillah (Larissa Wilson), Sophie (Georgia King) and Marcus (Tom Hopper).", "* Larissa Wilson as Khalilah", "On 5 January 2009, it was announced that Jon Wright would direct a 2009 British comedy horror and slasher film titled Tormented which would be released in cinemas on 22 May 2009 in the UK. Cavan Ash, Tracy Brimm, Arvind Ethan David and Kate Myers produced the film with the budget of £703,000 and Stephen Prentice wrote the film. It was announced that Alex Pettyfer, April Pearson, Dimitri Leonidas, Georgia King, Larissa Wilson, Calvin Dean, Tom Hopper, Tuppence Middleton, Mary Nighy, Olly Alexander, Sophie Wu, Hugh Mitchell, James Floyd, Peter Amory, Ruby Bentall and Geoff Bell would star in the movie. Warner Bros., Paramount Vantage, MPI Home Video and IFC Films acquired distribution rights to the film. Paul Hartnoll would compose the music for the movie. BBC Films, Pathé and Forward Films co-produced the film. The film was shot at: Bishop Vesey's Grammar School, Sutton Coldfield, West Midlands, England; Streetly School, Birmingham, West Midlands, England and Sutton Coldfield, West Midlands, England, on 20 January 2009."]}, {"page": "List of awards and nominations received by Holby City", "response": ["| scope=\"row\" | Young Shooting Star (16–23) || Larissa Wilson as Rebecca Webster || "]}, {"page": "Tony (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Cassie (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Jal (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Chris (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Sid (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Maxxie and Anwar", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Michelle (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Effy (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "Everyone (Skins series 1)", "response": ["* Larissa Wilson as Jal Fazer"]}, {"page": "The Sparticle Mystery", "response": ["The main characters within The Sparticle Mystery are all children, of different ages and ethnic groups, many of whom were new to acting. Included in the main cast were: 16-year-old Megan Jones as Tia; 8-year-old Oliver Bell as Liam; Wesley Nelson (who has cerebral palsy) as Jeffrey; Karim Zeroual as Sadiq. Due to the age of the actors there were large changes in the cast between series. Given the premise of the show, the adult cast was minimal, but notable are Annette Badland as 'Doomsday' Dora, and Larissa Wilson as Anita.", "| Larissa Wilson || Anita || 1 || 1x03, 1x08 || The Message || The Unsuitables "]}, {"page": "Skins (series 1)", "response": ["| Larissa Wilson || Jal Fazer || All"]}, {"page": "Skins (series 2)", "response": ["| Larissa Wilson || Jal Fazer || 9"]}]}}