{"wiki_id": "http://www.wikidata.org/entity/Q920425", "itemLabel": "Oliver Norwood", "itemDescription": "Northern Irish footballer (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oliver_Norwood", "wikipedia_page": {"main": "Oliver James Norwood (born 12 April 1991) is an English-born Northern Irish professional footballer who plays as a midfielder for Championship club Sheffield United.\nNorwood began his career with Manchester United, and had loan spells at Carlisle United, Scunthorpe United and Coventry City before moving permanently to Huddersfield Town and then Reading. He then achieved three consecutive promotions to the Premier League with three clubs: Brighton, Fulham and Sheffield United between 2017–2019. Although he was born in England, and represented that country at under-17 level, he has represented Northern Ireland at every level from under-19 to the senior team.", "link_mentions": [{"page": "April 12", "response": ["*  1991   – Oliver Norwood, English born Northern Irish international footballer"]}, {"page": "Reading F.C.", "response": ["The summer before the 2014–15 season saw further arrivals of Jamie Mackie on loan, Oliver Norwood and the return of Simon Cox. The club was under a high threat of administration, causing departures of Sean Morrison and Adam Le Fondre and a Thai consortium taking over the club. A good start to Nigel Adkins' second season in charge was followed by a poor run of results that ended with his sacking after the 6–1 away defeat to Birmingham City with Steve Clarke taking over the next day in the hope of a promotion push. However, a lack of goals and some poor form in the league meant the club faced some fears of relegation to League One, but luckily safety was secured with few games to spare. Nonetheless, during that time, the club embarked on a successful FA Cup journey, reaching the semi-final where they were unlucky to lose 2–1 to Arsenal at Wembley. The following season saw the club bring in many players in the hopes of gaining promotion, however the club would finish in 17th."]}, {"page": "Huddersfield Town A.F.C.", "response": ["* Oliver Norwood"]}, {"page": "Burnley", "response": ["Burnley's sporting figures include England and Lancashire cricketer James Anderson,www.cricinfo.com. Retrieved 24 October 2007. former England international footballers Jimmy Crabtree and Billy Bannister, Premier League striker Jay Rodriguez, Northern Ireland and Sheffield United midfielder Oliver Norwood, former England and Everton Women's goalkeeper Rachel Brown,www.bbc.co.uk. Retrieved 24 October 2007. Pakistan and Tranmere Rovers midfielder Adnan Ahmed, ex-Manchester United player Chris Casper, Commonwealth Games Gold Medal-winning gymnast Craig Heap,\"Town says thanks to its golden boy\", Burnley Citizen, 28 August 2002. Retrieved 24 August 2007. Antipodean Supercars Championship driver for DJR Team Penske, Fabian Coulthard, also second cousin of Formula One driver David Coulthard, was born in Burnley along with Neil Hodgson, 2003 World Superbike champion. Also long-time Burnley FC chairman Bob Lord, football pioneer Jimmy Hogan (who grew up in the town), handball player Holly Lam-Moores, middleweight boxer Jock McAvoy and hammer thrower Sophie Hitchon."]}, {"page": "Josh Walker (footballer, born 1989)", "response": ["On 13 January 2012 Walker joined Scunthorpe United on a one-month emergency loan deal. Walker's move to Scunthorpe United permanently was changed to Loan because Fifa's rules which mean players can only play for two clubs in a season apply for standard but not emergency loans. Walker scored on his debut for Scunthorpe United in a 1–1 draw against Colchester United. His debut impressed manager Alan Knill and he told the club official website: \"Josh is a good player and fits in well in there. We lost [Manchester United loanee] Oliver Norwood, but we have Josh, who is a bit more streetwise and very good on the ball.\" On 18 February, Walker scored his second goal and set up a goal for Jon Parkin in a 3–1 win over Leyton Orient. On 20 February, Walker extended his loan spell at Scunthorpe for another month after making five appearances and scoring twice. On 6 March, Walker provided a double assist in the late second half for David Mirfin and Garry Thompson respectively in a 2–1 win over Oldham Athletic. On 31 March, Walker scored his third goal and set up a goal for Jordan Robertson in a 4–1 win over Chesterfield."]}, {"page": "Northern Ireland national football B team", "response": ["*Oliver Norwood (Manchester United)"]}, {"page": "List of sportspeople who competed for more than one nation", "response": ["|Oliver Norwood"]}, {"page": "Manchester United F.C. Reserves and Academy", "response": ["* Oliver Norwood"]}, {"page": "Northern Ireland national under-21 football team", "response": ["|style=\"text-align:left;\"|Oliver Norwood", "|Oliver Norwood"]}, {"page": "Blessed Trinity Roman Catholic College", "response": ["* Oliver Norwood, footballer"]}, {"page": "List of Coventry City F.C. international footballers", "response": ["|Oliver Norwood"]}, {"page": "2011 Nations Cup", "response": ["|MF ||17||Oliver Norwood || || ", "|MF ||14||Oliver Norwood || || ", "|MF ||6 ||Oliver Norwood"]}, {"page": "Goal-line technology", "response": ["The system came under scrutiny in June 2020 after a Premier League match between Aston Villa and Sheffield United as the technology failed to award a goal for Sheffield United despite the fact that Aston Villa goalkeeper Ørjan Nyland had carried the ball over the goal line after mishandling a free kick from Sheffield United's Oliver Norwood by colliding with teammate Keinan Davis. As no goal was signalled, the match officials decided not to let VAR intervene. Hawk-Eye apologised, explaining the failure as due to an anomalous amount of occlusion of its cameras' view of the incident."]}, {"page": "Ghost goal", "response": ["On 17 June 2020, the first day the 2019–20 Premier League resumed after its postponement from the COVID-19 pandemic, a free kick by Sheffield United's Oliver Norwood was carried over the goal line by Aston Villa goalkeeper Ørjan Nyland, after a collision with his teammate Keinan Davis. Although goal-line technology"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Oliver Norwood||||2012–2014||75 (5)||8||4 (2)||1||4||0||0||0||0||0||83 (7)||9"]}]}}