{"wiki_id": "http://www.wikidata.org/entity/Q921060", "itemLabel": "Gary Gardner", "itemDescription": "English association football player (born 1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gary_Gardner", "wikipedia_page": {"main": "Gary Gardner (born 29 June 1992) is an English professional footballer who plays as a central midfielder for EFL Championship club Birmingham City.\nA product of the Aston Villa Academy, Gardner made his senior debut while on loan at Coventry City. He first played competitively for Aston Villa in late 2011, and went on to spend time on loan at Sheffield Wednesday, Brighton & Hove Albion, Nottingham Forest, Barnsley and Birmingham City, before joining Birmingham on a permanent contract in 2019.\nHe has made a number of appearances at under-age levels for England, including five for England U21. He is the younger brother of Birmingham City technical director Craig Gardner.", "link_mentions": [{"page": "Olton", "response": ["*Gary Gardner, Footballer"]}, {"page": "Craig Gardner", "response": ["Gardner was born in Solihull and raised in the Yardley district of Birmingham, where he attended Cockshut Hill School. After transferring to Birmingham City in 2010, he said he was a lifelong Birmingham City supporter. His younger brother Gary Gardner also played for England at youth level and turned professional with Aston Villa. In June 2012, Gardner donated £500 to the family of a disabled toddler after a chance meeting in a department store; this was only revealed after the Stoke-on-Trent family told a local newspaper."]}, {"page": "Second City derby", "response": ["Unlike, for example, the Old Firm derby, there is no shortage of players who have appeared for both clubs. Villa legend Harry Hampton transferred to Blues after the First World War and helped the club to the Second Division title. The last established first-team player to make this move was Des Bremner in 1984, though there had been loan signings and movement of youth players during this period. The most recent permanent transfer from Aston Villa to Birmingham City was that of Gary Gardner in Summer 2019, his brother Craig was the previous player to move from Villa to Birmingham in 2010. The last player to move directly in the other direction was Spanish Winger Jota in the same transfer window.", "|Gary Gardner"]}, {"page": "Colchester Community Stadium", "response": ["The Community Stadium has hosted four international football matches; three featuring the England under-21s and one England under-19 game. The first international game at the stadium saw England under-19s defeat their German counterparts 1–0 in front of a crowd of 9,692 on 18 November 2008 courtesy of a Henri Lansbury goal. The next international fixture saw England under-21s qualify for the 2011 UEFA European Under-21 Football Championship as they beat Lithuania 3–0 with two goals from Danny Welbeck and one from Marc Albrighton. A crowd of 7,240 watched the game on 7 September 2010. The England under-21s returned to Colchester for a 2013 UEFA European Under-21 Championship qualifier on 11 November 2011. The Young Lions cruised to a 5–0 victory against Iceland on the night, with goals from Marvin Sordell, Martin Kelly, Craig Dawson and two scored by Gary Gardner. The attendance for the game was 10,051. England won their fourth match after almost five years away from the Community Stadium on 6 September 2016. Full England international Marcus Rashford made his England under-21 debut in the game, scoring a hat-trick as England scored six times against Norway. The other scorers were Nathaniel Chalobah, Ruben Loftus-Cheek and Lewis Baker. England's opposition scored for the first time at the Community Stadium when Ghayas Zahid scored Norway's consolation with the score at 4–1."]}, {"page": "Aston Villa F.C. Under-23s and Academy", "response": ["|Gary Gardner"]}, {"page": "2008–09 Aston Villa F.C. season", "response": ["|– || MF ||  England || sortname|Gary Gardner || 2 || 1 || 11 || 2 || 13 || 3"]}, {"page": "Mikel San José", "response": ["On 21 September 2020, San José signed a two-year deal with English Championship club Birmingham City, whose head coach was fellow Basque Aitor Karanka. He made his first-team debut, on 20 October away to Norwich City, in unfortunate circumstances: midfielder Adam Clayton was sent off after 86 goalless minutes, but before there was a stoppage in play to allow San José to come on, Norwich scored the winning goal. He made what the Birmingham Mail dubbed an authoritative full debut playing in central midfield, looking \"assured on the ball, intelligent off it\", and away to Preston North End a week later he \"looked even more accomplished\" in the centre of a back three before moving into midfield from where he crossed the ball for Gary Gardner's winning goal. As matchesand poor resultsbecame more frequent, San José's level of performance dropped, he appeared to tire, mistakes appeared, and he lost his place in the matchday squad. Under new head coach Lee Bowyer, he seemed back to his best in a second-half cameo away to Derby County as Birmingham avoided relegation, but on 28 May, his contract was terminated by mutual consent at his own request."]}, {"page": "2009–10 FA Youth Cup", "response": ["|Charlton AthleticA2–1||align=left|Jeffrey Bruma Marko Mitrović ||Third round||RochdaleH4–0||align=left|Gary Gardner Ryan Simmonds ", "|Nottingham ForestA4–0||align=left|Danny Mills Pappoe Marko Mitrović Conor Clifford ||Fourth round||West Bromwich AlbionA2–0||align=left|Gary Gardner Arsenio Halfhuid "]}, {"page": "Andreas Weimann", "response": ["On 10 March 2012, having come on as a substitute for Charles N'Zogbia, Weimann scored his first goal for Villa in the 92nd minute, giving the team a 1–0 victory over Fulham. The goal stemmed from Gary Gardner's shot when it was fumbled by the Fulham keeper and Weimann reacted fastest as he bundled in the winner and became an instant fans favourite. On 9 April he scored a goal against Stoke City in a 1–1 draw and was close to getting a second in the game."]}, {"page": "Maikel Kieftenbeld", "response": ["Ahead of the 2020–21 season under new manager Aitor Karanka, Kieftenbeld was told that he was free to leave, although if he did not, he would be treated like any other squad member and would play if needed. He was behind Ivan Šunjić, Gary Gardner, new arrivals Mikel San José and Adam Clayton, and the youthful Caolan Boyd-Munce in the pecking order. He started in the EFL Cup defeat to fourth-tier Cambridge United, but his next appearance was not for another two months, when injuries and a change of shape against AFC Bournemouth gave both him and Boyd-Munce a place in the starting eleven."]}, {"page": "2010–11 Premier Reserve League", "response": ["|align=\"left\"| Gary Gardner"]}, {"page": "2013 UEFA European Under-21 Championship qualification Group 8", "response": ["* Gary Gardner"]}, {"page": "2011–12 Coventry City F.C. season", "response": ["| Gary Gardner", "| Gary Gardner || Aston Villa || 24 November 2011 || 21 December 2011"]}, {"page": "2009 HKFC International Soccer Sevens", "response": ["* Aston Villa: Elliott Parish, William Grocott, Matthew Roome, Ciaran Clark, Marc Albrighton, Barry Bannan, Dominik Hofbauer, Andreas Weimann, Gary Gardner, Richard Blythe (Manager: Gordon Cowans)"]}, {"page": "2011–12 Aston Villa F.C. season", "response": ["| Gary Gardner", "|38 || ||MF ||Gary Gardner || 1 || 0 || 0 || 0 || 0 || 0 || 1 || 0"]}, {"page": "2011–12 Premier Reserve League", "response": ["|align=\"left\"| Gary Gardner"]}, {"page": "2011–12 NextGen Series", "response": ["|align=\"left\"| Gary Gardner"]}]}}