{"wiki_id": "http://www.wikidata.org/entity/Q923999", "itemLabel": "Dick Taylor", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dick_Taylor", "wikipedia_page": {"main": "Richard Clifford Taylor (born 28 January 1943) is an English musician, best known as the guitarist and founding member of the Pretty Things.\nTaylor was an early bassist for the Rolling Stones, but left the band to resume his studies at Sidcup Art College. While there he formed the Pretty Things in September 1963. He now lives on the Isle of Wight, England.", "link_mentions": [{"page": "Hawkwind", "response": ["Pretty Things guitarist Dick Taylor was brought in to produce the 1970 debut album Hawkwind. Although it was not a commercial success, it did bring them to the attention of the UK underground scene, which found them playing free concerts, benefit gigs, and festivals. Playing free outside the Bath Festival, they encountered another Ladbroke Grove based band, the Pink Fairies, who shared similar interests in music and recreational activities; a friendship developed which led to the two bands becoming running partners and performing as \"Pinkwind\". Their use of drugs, however, led to the departure of Harrison, who did not partake, to be replaced briefly by Thomas Crimble (about July 1970–March 1971). Crimble played on a few BBC sessions before leaving to help organise the Glastonbury Free Festival 1971; he sat in during the band's performance there. Lloyd-Langton also quit, after a bad LSD trip at the Isle of Wight Festival led to a nervous breakdown.Mojo, September 1999 – The Egos Have Landed – www.starfarer.net "]}, {"page": "January 28", "response": ["*1943 – Dick Taylor, English guitarist and songwriter "]}, {"page": "The Rolling Stones", "response": ["Keith Richards and Mick Jagger became childhood friends and classmates in 1950 in Dartford, Kent.White, Charles. (2003), pp. 119–120, The Life and Times of Little Richard: The Authorised Biography, Omnibus Press. The Jagger family moved to Wilmington, Kent,  away, in 1954. In the mid-1950s, Jagger formed a garage band with his friend Dick Taylor; the group mainly played material by Muddy Waters, Chuck Berry, Little Richard, Howlin' Wolf and Bo Diddley. Jagger met Richards again on 17 October 1961 on platform two of Dartford railway station. The Chuck Berry and Muddy Waters records Jagger was carrying revealed a shared interest. A musical partnership began shortly afterwards. Richards and Taylor often met Jagger at his house. The meetings moved to Taylor's house in late 1961 where Alan Etherington and Bob Beckwith joined the trio; the quintet called themselves the Blues Boys.", "The group band played their first show billed as \"the Rollin' Stones\" on 12 July 1962, at the Marquee Club in London.Faulk, B. J. (2011). New Left in Victorian Drag: \"The Rolling Stones Rock and Roll Circus\". Texas Studies In Literature & Language, 53(2), 138–158. At the time, the band consisted of Jones, Jagger, Richards, Stewart, and Taylor. Bill Wyman auditioned for the role of bass guitarist at a pub in Chelsea on 7 December 1962 and was hired as a successor to Dick Taylor. The band were impressed by his instrument and amplifiers (including the Vox AC30). The classic line-up of the Rolling Stones, with Charlie Watts on drums played for the first time in public on Saturday, 12 January 1963 at the Ealing Club. However, it was not until a gig there on 2 February 1963 that Watts became the Stones' permanent drummer.", "* Dick Taylorbass guitar (1962)", "* Colin Goldingbass guitar (1962–1963): \"As the autumn of 1962 wore on, the Rollin' Stones picked up occasional jobs,... Dick Taylor left the band in September to attend the Royal College of Art. For a couple of months, the bass chores were handled by various people, most often Colin Golding, who probably played around eight gigs...\""]}, {"page": "Mick Jagger", "response": ["In their earliest days, the Rolling Stones played for no money in the interval of Alexis Korner's gigs at a basement club opposite London's Ealing Broadway tube station (subsequently called \"Ferry's\" club). The group had very little equipment and borrowed Korner's gear to play. The group's first appearance, under the name the Rollin' Stones (after one of their favourite Muddy Waters tunes), was at the Marquee Club, a London jazz club, on 12 July 1962. They would later change their name to \"the Rolling Stones\" as it seemed more formal. Writer Victor Bockris says the band members included Jagger, Keith Richards, Brian Jones, Ian Stewart on piano, Dick Taylor on bass and Tony Chapman on drums. However, Richards says in his memoir Life that \"The drummer that night was Mick Avory–not Tony Chapman, as history has mysteriously handed it down...\" In June 1963, the band began a five month residency at Eel Pie Island Hotel, which the BBC later credited with shaping the band's career. By that autumn, Jagger had left the London School of Economics to pursue his promising musical career with the Rolling Stones. The group played songs by American rhythm and blues artists like Chuck Berry and Bo Diddley, but strongly encouraged by manager Andrew Loog Oldham, Jagger and Richards soon began to write songs. Their songwriting partnership took some time to develop; one of their early compositions was \"As Tears Go By\", a song written for Marianne Faithfull, a young singer Loog Oldham was promoting.  For the Rolling Stones, the duo would write \"The Last Time\", the group's third number one single in the UK (their first two UK number one hits being remakes of songs that had been recorded by other artists \"It's All Over Now\" by Bobby Womack and \"Little Red Rooster\" by Willie Dixon) based on \"This May Be the Last Time\", a traditional Negro spiritual song recorded by the Staple Singers in 1955. Jagger and Richards also wrote their first international hit, \"(I Can't Get No) Satisfaction\". It established the Rolling Stones' image as defiant troublemakers in contrast to the Beatles as \"lovable moptop[s]\".left|thumb|alt=Portrait of Jagger holding a cigarette in his right hand looking directly at the camera |Jagger in 1965 Jagger told Stephen Schiff in a 1992 Vanity Fair profile: I wasn't trying to be rebellious in those days; I was just being me. I wasn't trying to push the edge of anything. I'm being me and ordinary, the guy from suburbia who sings in this band, but someone older might have thought it was just the most awful racket, the most terrible thing, and where are we going if this is music?... But all those songs we sang were pretty tame, really. People didn't think they were, but I thought they were tame."]}, {"page": "Brian Jones", "response": ["As Richards tells it, Jones came up with the name the \"Rollin' Stones\" (later with the 'g') while on the phone with a venue owner. \"The voice on the other end of the line obviously said, 'What are you called?' Panic! The Best of Muddy Waters album was lying on the floor—and track five, side one was 'Rollin' Stone Blues'\". The Rollin' Stones played their first gig on 12 July 1962 at the Marquee Club in London, with a line-up of Jagger, Richards, Jones, Stewart, bass player Dick Taylor (later of the Pretty Things) and drummer Tony Chapman.Some sources including Keith Richards erroneously list Mick Avory as the drummer at that gig, but Avory himself denies it.", "Jones was a gifted multi-instrumentalist, proficient on a wide variety of musical instruments. Prior to his dismissal from the group in 1969, Jones typically played all of the instruments in the Stones' music which deviated from standard rock set up of drums, guitars, piano, and bass. His ability to play a wide variety of instruments is particularly evident on the albums Aftermath (1966), Between the Buttons (1967) and Their Satanic Majesties Request (1967). As a guitarist, in the early days he favoured a white teardrop-shaped electric guitar produced by the Vox company, especially in live performances; he also played a wide variety of electric and acoustic guitars from companies such as Rickenbacker, Gibson, and Fender. As a slide guitarist, he favoured the open E and open G tunings.Paul Trynka interview with Dick Taylor, early bass player for the Rolling Stones: "]}, {"page": "Keith Richards", "response": ["Richards attended Wentworth Primary School with Mick Jagger and was his neighbour until 1954 when the Richards and Jagger families both moved. From 1955 to 1959, Richards attended Dartford Technical High School for Boys. Recruited by Dartford Tech's choirmaster, R. W. \"Jake\" Clare, he sang in a trio of boy sopranos at, among other occasions, Westminster Abbey for Queen Elizabeth II. In 1959, Richards was expelled from Dartford Tech for truancy and transferred to Sidcup Art College, where he met Dick Taylor. At Sidcup, he was diverted from his studies proper and devoted more time to playing guitar with other students in the boys' room. At this point, Richards had learned most of Chuck Berry's solos.thumb|upright|Richards in 1965", "Richards met Jagger again by chance on a train platform when Jagger was heading for classes at the London School of Economics. The mail-order rhythm & blues albums from Chess Records by Chuck Berry and Muddy Waters that Jagger was carrying revealed a mutual interest\"I'm looking at this guy and I..., I know you, what you've got under your arm is worth robbing\"  and led to a renewal of their friendship. Along with mutual friend Dick Taylor, Jagger was singing in an amateur band, Little Boy Blue and the Blue Boys, which Richards soon joined. The Blue Boys folded when Brian Jones, after sharing thoughts on their joint interest in the blues music, invited Mick and Keith to the Bricklayers Arms pub, where they then met Ian Stewart.It's Only Rock 'n' Roll, The Ultimate Guide to the Rolling Stones, James Karnbach and Carol Bernson, Facts on File Inc., New York, NY., 1997Ian Stewart Interview by Lisa Robinson, Creem Magazine, June 1976"]}, {"page": "Pretty Things", "response": ["The Pretty Things were preceded by Little Boy Blue and the Blue Boys, which consisted of Dick Taylor, fellow Sidcup Art College student Keith Richards, and Mick Jagger, among others. When Brian Jones was recruiting for his own band, all three joined Brian and Ian Stewart and were dubbed \"Rollin' Stones\" by Jones in June 1962. Because there were too many guitar players in the band, Taylor switched to bass. He quit the Stones five months later, when he was accepted at the Central School of Art and Design in London. Phil May, another Sidcup student, convinced him to form a new band. Taylor was once again playing guitar, with May singing and playing harmonica. They recruited John Stax on bass, Brian Pendleton on rhythm guitar, and Pete Kitley on drums. Kitley was soon replaced by Viv Andrews, also known as Viv Broughton.\"The Pretty Things / Philippe de Barge acetate 1968\", Willy-rock.blogspot.co.uk, 27 September 2009.", "1969 saw the band feeling disillusioned by the failure of S.F. Sorrow and that June, Taylor left the group. The Pretty Things borrowed guitarist Victor Unitt from the Edgar Broughton Band to replace Taylor. During the summer of 1969, they recorded an album for a young French millionaire Philippe DeBarge, which was intended only to be circulated among his social circle. The acetate has since been bootlegged. In 2010, it was picked up by Mike Stax, owner of 1960s music magazine Ugly Things. He unearthed one of the two acetates and had it mixed and mastered and then as a piece de resistance, had the classic Pretty Things line-up, which Dick Taylor had just left at the time of the recording of the tracks with DeBarge, record a song entitled \"Monsieur Rock\" (Ballad of Philippe) a bonus track for this release on Ugly Things UTCD-2207.", "thumb|Phil May and Dick Taylor in 2013", "thumb|Dick Taylor, Phil May, Jack Greenwood, George Woosey, Frank Holland @ the Downtown Blues Club (Hamburg) in April 2017", "* Dick Taylor – lead guitar, occasional vocals (1963–1969, 1978–2020)"]}, {"page": "Ian Stewart (musician)", "response": ["Stewart was born at Kirklatch Farm, Pittenweem, in the East Neuk of Fife, Scotland, and raised in Sutton, Greater London. Stewart (often called Stu) started playing piano when he was six. He took up the banjo and played with amateur groups on both instruments. Stewart, who loved rhythm & blues, boogie-woogie, blues and big-band jazz, was first to respond to Brian Jones's advertisement in Jazz News of 2 May 1962 seeking musicians to form a rhythm & blues group.Wyman 2002. pp. 34–35 Mick Jagger and Keith Richards joined in June, and the group, with Dick Taylor on bass and Mick Avory (later of the Kinks) on drums, played their first gig under the name the Rollin' Stones at the Marquee Club on 12 July 1962.Wyman 2002. pp. 36–37. Richards described meeting Stewart thus: \"He used to play boogie-woogie piano in jazz clubs, apart from his regular job. He blew my head off too, when he started to play. I never heard a white piano player play like that before.\" By December 1962 and January 1963, Bill Wyman and Charlie Watts had joined, replacing a series of bassists and drummers."]}, {"page": "Bill Wyman", "response": ["When drummer Tony Chapman told him that a rhythm and blues band called the Rolling Stones needed a bass player, he auditioned at a pub in Chelsea on 7 December 1962 and was hired as a successor to Dick Taylor. The band were impressed by his instrument and amplifiers (one of which Wyman modified himself, and a Vox AC30).Archived at Ghostarchive and the Wayback Machine:  Wyman was the oldest member of the group."]}, {"page": "Mick Taylor", "response": ["On 1 December 2010, Taylor reunited with Ronnie Wood at a benefit gig arranged by blues guitarist Stephen Dale Petit to save the 100 Club in London. Other special guests at the show were Dick Taylor (first bassist in the Rolling Stones) and blues/jazz trombonist Chris Barber. Taylor toured the UK with Petit, appearing as his special guest, featured on a Paul Jones BBC Radio 2 session with him and guested on Petit's 2010 Classic Rock magazine Album of the Year, The Crave."]}, {"page": "Hawkwind (album)", "response": ["The Pretty Things guitarist Dick Taylor, who was looking for a new venture after leaving the band, was pulled into Hawkwind playing some gigs and producing this album. After several unsuccessful attempts to capture the band's sound in the studio, it was decided simply to record it live in the studio.", "*\"I remember being a bit apprehensive because Dick Taylor was the main man there and he was an older guitarist — I felt intimidated and didn't really enjoy doing it. It was a good album though and I still enjoy hearing it, even now.\" – Huw Lloyd-Langton", "*Dick Taylor - some lead guitar on main album", "*Recorded at Trident Studios, London, March and April 1970. Produced with Dick Taylor.", "Category:Albums produced by Dick Taylor"]}, {"page": "Twink (musician)", "response": ["Twink replaced Skip Alan in the band the Pretty Things, joining Phil May, Dick Taylor, Wally Allen, and Jon Povey. He participated the making of their classic album S.F. Sorrow. He was also a member of this group when it appeared in the Norman Wisdom film What's Good for the Goose. Twink became famous for his outrageous behaviour such as climbing the speaker stacks and diving into the audience when the band performed at a free open-air concert in London's Hyde Park."]}, {"page": "Dartford", "response": ["* Dick Taylor (born 1943), guitarist, The Pretty Things"]}]}}