{"wiki_id": "http://www.wikidata.org/entity/Q923647", "itemLabel": "Al Bowlly", "itemDescription": "Mozambican-born South African-British vocalist and jazz guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Al_Bowlly", "wikipedia_page": {"main": "Albert Allick Bowlly (7 January 1898 – 17 April 1941) was a Mozambican-born South African–British vocalist and jazz guitarist, who was popular during the 1930s in Britain. He recorded more than 1,000 songs.\nHis most popular songs include \"Midnight, the Stars and You\", \"Goodnight, Sweetheart\", \"Close Your Eyes\", \"The Very Thought of You\", \"Guilty\", “Heartaches\" and \"Love Is the Sweetest Thing\". He also recorded the only English version of  \"Dark Eyes\" by Adalgiso Ferraris, as \"Black Eyes\", with the words of Albert Mellor.", "link_mentions": [{"page": "List of South Africans", "response": ["*Al Bowlly, popular singer (1898–1941)"]}, {"page": "January 7", "response": ["*1898 – Al Bowlly, Mozambican-English singer-songwriter (disputed; d. 1941)"]}, {"page": "1940s", "response": ["* Al Bowlly"]}, {"page": "Cavalcade (play)", "response": ["Coward himself recorded \"Lover of My Dreams\" (the Mirabelle Waltz Song), with, on the reverse, \"Twentieth Century Blues\", played by the New Mayfair Novelty Orchestra, with vocal by an unnamed singer identified by Mander and Mitchenson as Al Bowlly. (HMV B4001)"]}, {"page": "Portuguese Mozambique", "response": ["* Al Bowlly (singer)"]}, {"page": "Maputo", "response": ["* Al Bowlly, singer"]}, {"page": "Hanwell", "response": ["* Al Bowlly, singer; buried with other WW2 bombing victims in a mass grave in the City of Westminster Cemetery, Uxbridge Road, Hanwell"]}, {"page": "Dennis Potter", "response": ["Potter contributed Moonlight on the Highway to ITV's Saturday Night Theatre series which was broadcast on 12 April 1969. The play centred on a young man (Ian Holm) who attempts to blot out memories of the sexual abuse he had suffered as child in his obsession with the music of Al Bowlly. As well as being an intensely personal play for Potter, it was his first foray in the use of popular music to heighten the dramatic tension in his work. Four days later Potter's Son of Man, in which the dramatist gives an alternative view of Christ's last days, went out as a Wednesday Play on BBC1 with Northern Irish actor Colin Blakely as Jesus. It led to Potter being accused of blasphemy, and the first of his many clashes with morality campaigner Mary Whitehouse.", "Potter's pioneering method of using music in his work emerged when developing Pennies from Heaven (1978), one of his biggest successes. He asked actors to mime along to period songs. \"Potter tried out the concept himself by lip-syncing to old songs while looking into a mirror. Potter himself once revealed that, working on harnessing songs in his plays, he was most productive 'at night, with old Al Bowlly records playing in the background'\".The Independent, 7 January 2005, previewing Arena – Dennis Potter:It's in the Songs! It's in the Songs! BBC Four Potter had previously experimented with Bowlly's voice in Moonlight on the Highway (1969)."]}, {"page": "1941 in music", "response": ["*April 17 – Al Bowlly, popular singer"]}, {"page": "1932 in music", "response": ["*\"Love Is The Sweetest Thing\" by Ray Noble. vocal; Al Bowlly", "*\"The Younger Generation\" by Ray Noble and Al Bowlly"]}, {"page": "1931 in music", "response": ["**Al Bowlly", "*\"Sweet And Lovely\" by Al Bowlly with Savoy Orpheans; Howard Jacobs and Carroll Gibbons", "*\"Time On My Hands\" by Al Bowlly with The New Mayfair Dance Orchestra"]}, {"page": "1899 in music", "response": ["**Al Bowlly, singer (died 1941)"]}, {"page": "List of Grammy Hall of Fame Award recipients (Q–Z)", "response": ["| Ray Noble & his Orchestra (featuring vocals sung by Al Bowlly)"]}, {"page": "Hiawatha", "response": ["*\"Hiawatha's Lullaby\" is a 1933 song by vocalist Al Bowlly and bandleader Ray Noble, recorded in London. Its lyrics reference a body of water. However, there are multiple lakes named for Hiawatha, so the specific geographical reference is unknown."]}, {"page": "What More Can I Ask?", "response": ["| Al Bowlly with Ray Noble and his orchestraHMV B 6302 (matrix: 0B 4365-1)Recorded London on December 14, 1932", "| Al Bowlly with Lew Stone and the Monseigneur BandDecca(England) F 3373 (matrix: GB 5398-1)Recorded London on December 23, 1932", "Category:Al Bowlly songs"]}, {"page": "Withnail and I", "response": ["# \"Hang Out the Stars in Indiana\"Al Bowlly and New Mayfair Dance Orchestra1:35"]}, {"page": "The Song of Hiawatha", "response": ["Duke Ellington incorporated treatments of HiawathaYouTube and MinnehahaYouTube in his jazz suite The Beautiful Indians (1946–7). Other popular songs have included \"Hiawatha’s Melody of Love\", by George W. Meyer, with words by Alfred Bryan and Artie Mehlinger (1908), and Al Bowlly's \"Hiawatha’s Lullaby\" (1933)."]}, {"page": "The Moon and Sixpence", "response": ["Ray Noble's 1932 dance band hit \"We've Got the Moon and Sixpence\", sung by Al Bowlly, takes its name from the book."]}, {"page": "Over the Rainbow", "response": ["An introductory verse (\"When all the world is a hopeless jumble...\") that was omitted from the film is sometimes used in theatrical productions of The Wizard of Oz and is included in the piano sheet music from the film. It was used in versions by Tony Bennett, Al Bowlly, Doris Day, Ella Fitzgerald, Frank Sinatra, Sarah Vaughan, Mandy Patinkin, Trisha Yearwood, Melissa Manchester, Hilary Kole, Jewell, and Norma Waterson. Judy Garland sang the introductory verse at least once, on a 1948 radio broadcast of The Louella Parsons Show. Lyrics for a second verse (\"Once by a word only lightly spoken...\") appeared in the British edition of the sheet music.", "Category:Al Bowlly songs"]}, {"page": "Ray Noble", "response": ["Noble wrote both lyrics and music for many popular songs during the British dance band era, known as the \"Golden Age of British music\", notably for his longtime friend and associate Al Bowlly, including \"Love Is the Sweetest Thing\", \"Cherokee\", \"The Touch of Your Lips\", \"I Hadn't Anyone Till You\", and his signature tune, \"The Very Thought of You\". Noble played a radio comedian opposite American ventriloquist Edgar Bergen's stage act of Mortimer Snerd and Charlie McCarthy, and American comedy duo Burns and Allen, later transferring these roles from radio to TV and popular films.", "The most popular vocalist with Noble's studio band was Al Bowlly, who joined in 1930. During this time Noble co-wrote \"Turkish Delight\", \"By the Fireside\" and \"Goodnight, Sweetheart\". The latter song was a number one hit for Guy Lombardo in the United States charts. It was also used (with vocals by Al Bowlly) on the original Star Trek television series episode \"The City on the Edge of Forever\".", "Noble took Al Bowlly and his drummer Bill Harty to the US and asked Glenn Miller to recruit American musicians to complete the band. Miller played the trombone in the Ray Noble orchestra which performed Glenn Miller's composition \"Dese Dem Dose\" as part of the medley \"Dese Dem Dose/An Hour Ago This Minute/Solitude\" during a performance at the Rainbow Room in 1935. The American Ray Noble band had a successful run at the Rainbow Room in New York City with Bowlly as principal vocalist.", "Noble and his orchestra appeared in the 1937 film A Damsel in Distress with Fred Astaire, Joan Fontaine, George Burns and Gracie Allen. Noble played a somewhat \"dense\" character who was in love with Gracie Allen. Al Bowlly returned to England in 1938 but Noble continued to lead bands in America, moving into an acting career portraying a stereotypical upper-class English idiot.", "*Wright, John. – Al Bowlly's time with the Ray Noble Orchestra."]}, {"page": "J. Pat O'Malley", "response": ["At the end of 1935 Hylton and O'Malley came to the United States to record with a band composed of American musicians, thus emulating Ray Noble and Al Bowlly. The venture was short-lived. O'Malley remained in the US, known professionally as J. Pat O'Malley (to avoid confusion with another film actor named Pat O'Malley); he had a long and varied acting career, including the 1943 film Lassie Come Home as \"Hynes\"."]}, {"page": "Goodnight Sweetheart (TV series)", "response": ["As in Marks and Gran's sitcom Get Back, most episodes of Goodnight Sweetheart — and the programme itself – were named after popular song titles, others being derived from film titles. The show is named after the song \"Goodnight, Sweetheart\", a popular song of the 1930s and 1940s, popularised by Al Bowlly in 1931; it was later sung by Nick Curtis as the series signature tune. During one episode Gary and Phoebe refer to Bowlly's death during the Second World War."]}, {"page": "The Singing Detective", "response": ["* \"Bei Mir Bist Du Schoen\" – Al Bowlly with The Ray Noble Orchestra", "* \"The Very Thought of You\" – Al Bowlly & The Ray Noble Orchestra"]}, {"page": "Brother, Can You Spare a Dime?", "response": ["In the UK, it was recorded by Harry Roy and his Orchestra (From the Cafe Anglais, London) in 1933 and issued by Parlophone, with vocals by Bill Currie, featuring non-vocal speech by Currie and Roy. A version by Lew Stone and his Band (again at the Cafe Anglais) was recorded the same year for a \"Lew Stone Favourites\" medley, with vocals by Al Bowlly, and released by Decca. In 1948, a revival of the song by British vocalist Steve Conway was released on Columbia."]}, {"page": "Pennies from Heaven (TV series)", "response": ["* Al Bowlly, song composer used extensively throughout the series."]}, {"page": "Heart Gloucestershire", "response": ["One notable director was the writer Dennis Potter, who played an active role in the station's early years and lived in Ross on Wye. Potter's Pennies from Heaven producer, Kenith Trodd, presented a Sunday programme of 78 records featuring singers such as Al Bowlly, which Todd and Potter had used in Pennies from Heaven. Another Director was England rugby player, Mike Burton, who also started Gulliver's Travels, a sports travel agency."]}, {"page": "Richard A. Whiting", "response": ["*Al Bowlly"]}, {"page": "Selmer guitar", "response": ["Today, the Selmer guitar is almost completely associated with Django Reinhardt and the \"gypsy jazz\" school of his followers. From the 1930s through to the 1950s, however, Selmers were used by all types of performer in France and (in the early days) in the UK. The first Selmers sold in the UK were used in standard dance bands, and were associated with performers such as Len Fillis and Al Bowlly."]}, {"page": "The Shining (film)", "response": ["# \"Midnight, the Stars and You\" by Al Bowlly, performed by Ray Noble and His Orchestra", "# \"It's All Forgotten Now\" by Al Bowlly, performed by Ray Noble and His Orchestra (not on the soundtrack album)"]}, {"page": "Crooner", "response": ["This dominant popular vocal style coincided with the advent of radio broadcasting and electrical recording. Before the advent of the microphone, popular singers like Al Jolson had to project to the rear seats of a theater, as did opera singers, which made for a very loud vocal style. The microphone made possible the more personal style. Al Bowlly, Gene Austin, Art Gillham and, by some historical accounts, Vaughn De LeathFather of Radio: The Autobiography of Lee de Forest, 1950, page 351.Irving Settel, A Pictorial History of Radio, p. 58, Grosset & Dunlap (1967). are often credited as inventors of the crooning style, but Rudy Vallée achieved more widespread popularity, beginning in 1928; he could be heard by anyone with a phonograph or a radio."]}, {"page": "If I Had You (1928 song)", "response": ["\"If I Had You\" is a 1928 song by \"Irving King\" (Jimmy Campbell and Reg Connelly) with Ted Shapiro. Early hit versions in 1929 were by Rudy Vallée and Al Bowlly.", "Category:Al Bowlly songs"]}, {"page": "John Batchelor", "response": ["Robert Zimmerman of behindtheblack frequently comes on to talk about NASA and the space program, preceded by the music from the Star Trek end credits. The show's last segment (c.12:55 AM EST) invariably features Al Bowlly's \"Midnight, the Stars and You\", ending in a brief (<30sec) valediction/good-night, sometimes with a few moments with a guest (time for one question). The singer is sometimes mistaken for Al Jolson, as Batchelor introduces the singer simply with \"here's Al,\" and the song dates from the time of Bowlly's late career. From 2001 to 2006, Batchelor ended his show with Kate Smith singing \"God Bless America.\""]}, {"page": "List of victims of Nazism", "response": ["| Al Bowlly || 1898–1941 || South African/British || vocalist || killed by a Luftwaffe parachute mine in London"]}, {"page": "The Real Tuesday Weld", "response": ["The band is named after American film actress Tuesday Weld. Coates once had a dream involving Weld and 1930s vocalist Al Bowlly and cites it as inspiration for the band's particular style. A German alt-country band by the name of Tuesday Weld that released an album called Starscene 98 on Glitterhouse Records is not related."]}, {"page": "Dot Cotton", "response": ["In 2000, Dot was featured in a storyline about euthanasia, when her oldest friend Ethel, who had terminal cancer, asked her to help her die. The storyline allowed the production team to present all sides of the debate about euthanasia, from the perspective of the sufferer and from the person who is asked to assist in the mercy killing, religious and moral opposition. According to author Dorothy Hobson, \"Dot suffered torment as she struggled with her conscience and she tried to resist the request [...] to assist [Ethel] in the ultimate sin\". In the storyline, Ethel enjoyed the last days of her life and chose her final evening. Assisted by Dot, she took an overdose of her medication and died.EastEnders airdate 7 September 2000 Written by Simon Ashton and directed by Francesca Joseph the episode ended with a scene in which Ethel tells a weeping Dot \"you're the best friend I ever had\". Alternative credit music replaced the typical drum beats and theme tune at the end of the episode. The 1931 song used instead of the usual theme was \"Guilty\" by Al Bowlly. Ben Summerskill from The Observer has suggested that Dot's part in the euthanasia storyline was \"one of the most moving dramatic sequences shown in recent years on British TV\". The episode was voted the most emotional soap death in a Radio Times poll of 4,000 readers in 2006."]}, {"page": "List of African musicians", "response": ["* Al Bowlly"]}, {"page": "Suggs", "response": ["In 2008, Suggs contributed vocals to a cover of Al Bowlly's \"Hang Out the Stars in Indiana\" for the soundtrack for The Edge of Love composed by Angelo Badalamenti. Suggs also made a cameo in the film, singing the track.", "Suggs has acted in films such as The Tall Guy and Don't Go Breaking My Heart (1998). He starred in the Channel 4 drama The Final Frame (1990), in which he played a pop star named East. He also played a pop star (called Jason Wood) in the Press Gang episode \"Friends Like These\" in 1990. Suggs also appeared in the 2008 romantic drama The Edge of Love starring Keira Knightley and Sienna Miller, playing the part of \"the crooner\" (also credited as Al Bowlly) and singing Bowlly's hit \"Hang Out the Stars in Indiana\"."]}, {"page": "The Waldorf Hilton, London", "response": ["1934 – The resident house band was led by Howard Godfrey and his Waldorfians. Godfrey recorded 15 \"Live at the Waldorf\" 78 rpm discs with singer Al Bowlly. Hits included \"Love is the Sweetest Thing\" and \"Goodnight, Sweetheart\"."]}, {"page": "Nat Gonella", "response": ["In 1933 Gonella published Modern Style Trumpet Playing – A Comprehensive Course. He made uncredited appearances with Lew Stone and Al Bowlly in the films Bitter Sweet and The King's Cup."]}, {"page": "First of the Summer Wine", "response": ["The show features much 1920s and 1930s music, which adds to the nostalgic feel of the show. The theme tune is \"Sweet and Lovely\", sung by Al Bowlly, accompanied by Roy Fox and his Band.  The recording was made in London on 18 September 1931."]}, {"page": "Heartaches (song)", "response": ["From 2016 to 2019, English electronic musician Leyland James Kirby, also known as the Caretaker, sampled the Al Bowlly, Seger Ellis, and Guy Lombardo covers of \"Heartaches\" for his final project, Everywhere at the End of Time; all three are used multiple times in the project, with each subsequent appearance becoming more distorted and disfigured than the last, representing the gradual distortion and destruction of memory and other mental faculties brought about by dementia. The complete edition of the project has achieved greater popularity in October 2020 on TikTok as an online challenge, receiving notability from renowned publications such as The New York Times."]}, {"page": "When You Wish Upon a Star", "response": ["Like \"Someday My Prince Will Come\" from 1937's Snow White and the Seven Dwarfs, the piece has become a jazz standard. It has been performed by artists including Linda Ronstadt, Louis Armstrong, June Christy, Dave Brubeck Quartet, Glenn Miller, Al Bowlly, Vera Lynn, Shakatak, Harry James, Joe Pass, the Keith Jarrett Trio, the Manhattan Transfer, Sun Ra, Jason Becker, Leon Redbone, Wynton Marsalis, Gregory Porter, Bill Evans, Bill Frisell, Rod Stewart and Shirley Bassey. Connie Francis also recorded this song. The song heavily referenced in \"Chapel Perilous\" by Mild High Club."]}, {"page": "Guilty (Richard Whiting, Harry Akst and Gus Kahn song)", "response": ["An early version was featured on the soundtrack of Jean-Pierre Jeunet's 2001 film, Amélie: this was a Decca recording made on December 2, 1931 by Al Bowlly, a popular British singer of the 1930s, accompanied by Roy Fox and his Orchestra.Discography  Bowlly also recorded the song on several other occasions.", "Category:Al Bowlly songs"]}, {"page": "With My Eyes Wide Open, I'm Dreaming", "response": ["*Al Bowlly with Lew Stone and his Band (recorded August 1, 1934, released by UK Decca Records as catalog number F-5152Al Bowlly discography)"]}, {"page": "Red Sails in the Sunset (song)", "response": ["\"Red Sails in the Sunset\" is a popular song. Published in 1935, its music was written by Hugh Williams (pseudonym for Wilhelm Grosz) with lyrics by prolific songwriter Jimmy Kennedy.J. J. Kennedy The Man Who Wrote The Teddy Bears' Picnic: How Irish-born lyricist ...- 2011   146788569X  \"However, before he wrote anything with Carr, Jimmy Kennedy had more successful songs with Will Grosz, including possibly his most famous ballad, Red Sails in the Sunset. Red Sails in the Sunset sold more copies than any other UK song in 1935, with notable recordings by Lew Stone, Ambrose, Joe Loss and virtually all the other orchestras. Top vocalists included Vera Lynn, Gracie Fields, Al Bowlly and Greta Keller. In America it was voted the No. 2 song of the year by NBC's new and influential radio network show, Your Hit Parade, . The song was inspired by the \"red sails\" of Kitty of Coleraine, a yacht Kennedy often saw off the northern coast of Ireland and by his adopted town Portstewart, a seaside resort in County Londonderry.", "Popular versions in 1935 were by Bing Crosby, Guy Lombardo, Mantovani and Jack Jackson. Another early version was recorded by Al Bowlly with Ray Noble and his Orchestra on September 18, 1935. Louis Armstrong also had a hit with the song in 1936.", "*Al Bowlly acc. by orchestra directed by Ray Noble 1935", "Category:Al Bowlly songs"]}]}}