{"wiki_id": "http://www.wikidata.org/entity/Q924556", "itemLabel": "John McConnell Black", "itemDescription": "British botanist (1855-1951)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McConnell_Black", "wikipedia_page": {"main": "John McConnell Black (28 April 1855 – 2 December 1951) was a Scottish botanist who emigrated to Australia in 1877 and eventually documented and illustrated thousands of flora in South Australia in the early 20th century.  His publications assisted many botanists and scientists in the decades that followed.  He was the younger brother of theatre and hotel manager Helen Carte.\nBlack was born at Wigtown, Scotland and educated at Wigtown Grammar School, the Edinburgh Academy, the College School, Taunton and a commercial trade school in Dresden, Germany.  He was a linguist, able to understand Arabic, French, German, Italian, Russian and Spanish.  He migrated to Australia in 1877 and developed an interest in Australian Aboriginal languages. In 1879 Black married Alice Denford and they had a daughter and three sons. He began working as a journalist in 1883.  After a tour of South America and Europe following his mother's death in 1903, Black focused on systematic botany.  In 1909 he published The Naturalised Flora of South Australia.  His The Flora of South Australia was published in four parts during 1922 to 1929, and described 2,430 species, both indigenous and naturalized. It was indispensable to botanists and to those concerned with the vegetation of the arid regions of contiguous States.  He began a revised edition of his book in 1939 and worked steadily for twelve years, publishing part 1 in 1943 and part 2 in 1948.  Part 3 was nearing completion at his death.J.M.Black received the following distinctions for his botanical work:- 1927, Honorary Lecturer in Systematic Botany at the University of Adelaide; 1930, Associate honoris causa of the Linnean Society, London; 1930, Sir Joseph Verco Medal of the Royal Society of South Australia; 1932 Ferdinand von Mueller Medal (Australian and New Zealand Association for the Advancement of Science); 1933–34, President of the Royal Society of South Australia; in 1942, the M.B.E.; 1945, Australian Natural History Medallion (Field Naturalists' Club of Victoria); and in 1946 the Clarke Medal by the Royal Society of New South Wales. He died at his home in North Adelaide", "link_mentions": [{"page": "Wigtown", "response": ["* John McConnell Black, botanist and linguist."]}, {"page": "Solanum centrale", "response": ["Category:Taxa named by John McConnell Black"]}, {"page": "John Black", "response": ["*John McConnell Black (1855–1951), Australian botanist"]}, {"page": "1932 in Australia", "response": ["* 17 August – Botanist John McConnell Black is awarded the Mueller Medal by the Australian and New Zealand Association for the Advancement of Science."]}, {"page": "Clarke Medal", "response": ["* 1946: John McConnell Black (Botany)"]}, {"page": "Helen Carte", "response": ["Susan Helen Couper Black was born in Wigtown, Scotland, the second of four children of George Couper Black (1819–1863), procurator fiscal and banker, and his second wife, Ellen, née Barham (1822–1902).\"George Couper Black\", Ancestry UK, accessed 21 June 2021  One of her brothers, John McConnell Black, became a well-known botanist. Her grandfather, Robert Couper, M.D., was a Scottish physician and poet,Seeley, p. 17 and a great uncle was Sir George Couper.Desprez, Frank. \"The Late Mrs. D'Oyly Carte\", The Era, 10 May 1913, p. 19"]}, {"page": "Australian and New Zealand Association for the Advancement of Science", "response": ["* 1932 John McConnell Black"]}, {"page": "Australian Natural History Medallion", "response": ["* 1944 – John McConnell Black"]}, {"page": "Acacia ayersiana var. latifolia", "response": ["It was published as A. aneura var. latifolia by John McConnell Black in 1923. Barbara Randell transferred it from A. aneura to A. ayersiana in 1992."]}, {"page": "Eucalyptus baxteri", "response": ["Brown stringbark was first formally described in 1867 by George Bentham who gave it the name Eucalyptus santalifolia var.? baxteri and published the description in Flora Australiensis. In 1926, John McConnell Black published the name Eucalyptus baxteri in Volume 3 of the Flora of South Australia. The specific epithet (baxteri) honours William Baxter."]}, {"page": "Phebalium bullatum", "response": ["Phebalium bullatum was first formally described in 1916 by John McConnell Black and the description was published in Transactions and proceedings of the Royal Society of South Australia.", "Category:Taxa named by John McConnell Black"]}, {"page": "Stylidium inaequipetalum", "response": ["It was first described by John McConnell Black in a 1938 issue of the Transactions of the Royal Society of South Australia.", "Category:Taxa named by John McConnell Black"]}, {"page": "Dysphania melanocarpa", "response": ["It was first published in 1922 by John McConnell Black, as a variety of C. carinatum, and promoted to species rank by him in 1934. Two forms have been published, although these are only recognised in South Australia and Western Australia; they are C. melanocarpum f. melanocarpum and C. melanocarpum f. leucocarpum. In 2008, Sergei L. Mosyakin & Steven E. Clemants grouped this taxon in genus Dysphania."]}, {"page": "Portulaca intraterranea", "response": ["Category:Taxa named by John McConnell Black"]}, {"page": "Jubilee 150 Walkway", "response": ["File:J150W-Black.jpg                 |John McConnell Black"]}, {"page": "Euphorbia tannensis var. finlaysonii", "response": ["This taxon was first published by John McConnell Black in 1935, at species rank as Euphorbia finlaysonii. In 1977 David Hassall demoted it to a variety of E. tannensis. At the same time he did the same thing for E. eremophila, and since he felt these two to be more closely related to each other than either is to the type material of E. tannensis, he erected E. tannensis subsp. eremophila to hold both varieties."]}, {"page": "Drosera praefolia", "response": ["It was first formally described by Johann Gottlieb Otto Tepper in 1892 from specimens he collected on the Fleurieu Peninsula. Earlier in 1882, Tepper sent a description and specimens to Ferdinand von Mueller, who labeled the plants as D. whittakeri var. aphylla, but never published the name. Its placement at the rank of species was controversial and several authors, including Raymond Hamet in 1907, John McConnell Black in 1924, and Allen Lowrie in 1989, have reorganized it below the species rank. Others have reduced it to synonymy with Drosera whittakeri. In 1991, Robert J. Bates made the case for recognition at the species rank, authoring the illegitimate name D. aphylla in the process, a name not based on the first validly published description. Recently, several authors have recognized the taxon at the subspecies or species rank, but others have still only recognized it as a part of the very variable single species D. whittakeri sensu lato. In a review of D. whittakeri and related species, Lowrie and John Godfrey Conran reestablished it at the species rank, arguing that the morphology is dissimilar enough from D. whittakeri that it requires its own species epithet. Lowrie and Conran note that D. praefolia is distinct from D. whittakeri (whose opposing characteristics presented in parentheses) by its white tubers (orange), leaves emerging after flowering (before flowering), and the ovate to obovate leaf shape (broadly spathulate), among other differences."]}, {"page": "Correa calycina", "response": ["Correa calycina was first formally described in 1925 by John McConnell Black in Transactions and Proceedings of the Royal Society of South Australia from specimens collected in the Hindmarsh Valley by John Burton Cleland. ", "Category:Taxa named by John McConnell Black"]}, {"page": "J.M.Black", "response": ["#REDIRECT John McConnell Black"]}, {"page": "Acacia euthycarpa", "response": ["The taxon was first formally described by botanist John McConnell Black in Transactions of the Royal Society of South Australia  in 1923 as Acacia calamifolia var. euthycarpa. It was subsequently promoted to species status by Black in 1945. It occurs from Mount Finke in South Australia and eastward to north-western Victoria.", "Category:Taxa named by John McConnell Black"]}, {"page": "State Herbarium of South Australia", "response": ["The State Herbarium's collections include collections of Ralph Tate, John McConnell Black (via the South Australian Museum), the moss herbarium of Professor David Guthrie Catcheside (1907–1994), and the collections of the Field Naturalists Society of South Australia.State Herbarium history Department of Environment & Natural Resources. Accessed 27 December 2011."]}, {"page": "Amaranthus grandiflorus", "response": ["Amaranthus grandiflorus was originally described in 1923 by John McConnell Black as a variety of Amaranthus mitchellii.", "Category:Taxa named by John McConnell Black"]}, {"page": "Beyeria subtecta", "response": ["Category:Taxa named by John McConnell Black"]}, {"page": "Pandorea doratoxylon", "response": ["Pandorea doratoxylon is a species of woody vine in the family Bignoniaceae and is endemic to Australia. The species was first formally described in 1927 by John McConnell Black who gave it the name Tecoma doratoxylon in Transactions and Proceedings of the Royal Society of South Australia. In 1937, Black changed the name to Pandorea doratoxylon.", "Category:Taxa named by John McConnell Black"]}, {"page": "List of people educated at Edinburgh Academy", "response": ["* John McConnell Black"]}, {"page": "Acacia monticola", "response": ["The species was first formally described as Acacia monticola by the botanist John McConnell Black in 1937 as part of the work Transactions and Proceedings of the Royal Society of South Australia. It was reclassified by as Racosperma monticola by Leslie Pedley in 1987 then transferred back to the genus Acacia in 2001. The only other synonym is Acacia impressa.", "Category:Taxa named by John McConnell Black"]}, {"page": "List of botanists by author abbreviation (I–J)", "response": ["* J.M.Black – John McConnell Black (1855–1951)"]}, {"page": "Eragrostis infecunda", "response": ["Category:Taxa named by John McConnell Black"]}, {"page": "Melaleuca fulgens subsp. corrugata", "response": ["The first valid, formal description of Melaleuca fulgens subsp. corrugata was in 1957 by John McConnell Black  in Flora of South Australia as Melaleuca corrugata. In 1990, in a review of the species by Kirsten Cowley, Frances Quinn, Bryan Barlow and Lyndley Craven in Australian Systematic Botany, Melaleuca corrugata was recognised as Melaleuca fulgens subsp. corrugata. The specific epithet (corrugata) refers to the wrinkled sides of the fruiting capsules."]}, {"page": "Eremophila macgillivrayi", "response": ["The species was first formally described by botanist John McConnell Black in 1926 and the description was published in Transactions and Proceedings of the Royal Society of South Australia. The specific epithet (macgillivrayi) honours Doctor William David Kerr Macgillivray of Broken Hill who collected the type specimen.", "Category:Taxa named by John McConnell Black"]}, {"page": "Eremophila neglecta", "response": ["The species was first formally described in 1914 by John McConnell Black and the description was published in Transansactions and Proceedings of the Royal Society of South Australia. The specific epithet (neglecta) is a Latin word meaning \"disregarded\" or \"overlooked\".", "Category:Taxa named by John McConnell Black"]}, {"page": "Eremophila parvifolia", "response": ["The species was first formally described by John McConnell Black in 1928 and the description was published in Transactions and Proceedings of the Royal Society of South Australia. The specific epithet (parvifolia) is derived from the Latin words parvus meaning \"small\" and folium meaning \"leaf\", referring to the small leaves of this species.", "Category:Taxa named by John McConnell Black"]}, {"page": "Eremophila pentaptera", "response": ["Category:Taxa named by John McConnell Black"]}]}}