{"wiki_id": "http://www.wikidata.org/entity/Q924344", "itemLabel": "Stephen Jordan", "itemDescription": "British footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Jordan_(footballer)", "wikipedia_page": {"main": "Stephen Robert Jordan (born 6 March 1982) is an English former footballer and team physiotherapist at League Two side Salford City.\nAs a player he was a defender and notably played in the Premier League for Manchester City where he was part of the first team squad from 1999 until 2007. He went on to play for Burnley, Sheffield United, Huddersfield Town and Fleetwood Town amongst others. He retired in 2018 whilst playing with non-League side Chorley.", "link_mentions": [{"page": "1982", "response": ["* March 6 – Stephen Jordan, English footballer"]}, {"page": "Steve Jordan", "response": ["* Stephen Jordan (Canadian football) (born 1966), Canadian Football League defensive back", "* Stephen Jordan (footballer) (born 1982), English footballer", "* Stephen Jordan (politician) (1886–1975), Irish Fianna Fáil politician", "* Stephen Jordan (writer) (born 1986), English writer, playwright and director"]}, {"page": "Ben Thatcher", "response": ["His move to Manchester City cost around £100,000. His Manchester City debut came on the opening day of the 2004–05 season against Fulham. He was initially the first choice left-back at Manchester City, but a combination of injuries and the emergence of Stephen Jordan limited him to 21 appearances in his first season for the club. In January 2005 Thatcher nearly joined Fulham for a fee of £500,000 after a series of burglaries unsettled his family, but the move fell through. His second Manchester City season followed a similar pattern to the first, with most of his 19 starts coming in the first half of the season."]}, {"page": "Jon Harley", "response": ["At the start of the 2007–08 season, Harley found himself playing in the unaccustomed position of left-sided midfielder or on the bench, replaced by new signing Stephen Jordan. An injury to Jordan allowed him to regain his place and this coincided with a run of much-improved results for Burnley. On 9 March 2008, however, Harley failed to agree a new deal with Burnley, signalling his intent to leave the club during the following summer."]}, {"page": "Steven Schumacher", "response": ["At the start of the 2014–15 season, Schumacher managed to regain his first team place, playing in the midfield position. He then provided assist for Gareth Evans, in a 2–0 win over Scunthorpe United on 19 August 2014. Schumacher then provided assist from a corner to lead to Stephen Jordan in early minutes in a 3–2 loss against Preston North End on 25 October 2014. After being suspended for one game due to picking up five yellow cards this season, he returned to the starting line–up and provided assist for Jeff Hughes to score a winning goal and only goal in the game against Yeovil Town. On 11 April 2015, Schumacher captained for Fleetwood Town for the first time, as Fleetwood Town lost 1–0 loss against Walsall. He went on to finish the 2014–15 season, making thirty-three appearances in all competitions. Following this, Schumacher was among fifteen players to be released by Fleetwood Town."]}, {"page": "Jordan (name)", "response": ["*Stephen Jordan (born 1982), English footballer"]}, {"page": "Jay Rodriguez", "response": ["He made his first team debut for Burnley in the Championship on 29 December 2007, when he came on as a late substitute for Stephen Jordan in the 1–0 defeat to Bristol City at Turf Moor. Rodriguez finished the 2007–08 season on loan at Scottish First Division club Stirling Albion after signing in January 2008. He continued to train with the Clarets whilst reporting for Stirling on match days. He made his debut for Albion a day later in the 3–0 defeat against Celtic in the fourth round tie of the Scottish Cup at Celtic Park. He came on as a second-half substitute for David McKenna. He made his first start a week after against Livingston, but after the match he then faced a six-week absence through fatigue and lack of fitness. His first match back on 1 March saw him come off the bench to score a consolation in the last minute and his first professional goal away at Morton which ended in a 2–1 defeat. He stayed with Stirling until the end of the campaign and also scored goals against Livingston and St Johnstone, but these goals weren't enough to keep Albion up and they were relegated after finishing bottom of the table."]}, {"page": "Manchester City F.C. EDS and Academy", "response": ["|Stephen Jordan"]}, {"page": "2007–08 Manchester City F.C. season", "response": ["|  Stephen Jordan"]}, {"page": "Rory Delap", "response": ["Delap's throw-ins quickly caused problems at the beginning of the 2009–10 season. In Stoke's opening game against newly promoted Burnley, Delap's throw-in forced an own goal from Stephen Jordan in a 2–0 win. On 31 October 2009, Delap's throw-in created another goal for Stoke. Although Christophe Berra of Wolverhampton Wanderers attempted to clear the ball, it fell to Matthew Etherington, who volleyed it into the top corner. Delap then gave away two penalties within three games, against both Portsmouth and Arsenal. Portsmouth's Aruna Dindane was struck in the head by Delap's boot, while Andrei Arshavin was tripped up by Delap's leg. Both penalties were saved by Thomas Sørensen."]}, {"page": "2008–09 Burnley F.C. season", "response": ["!scope=\"row\"|Stephen Jordan"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Stephen Jordan||||2011||6||0||0||0||0||0||0||0||0||0||6||0"]}, {"page": "2009–10 Manchester United F.C. season", "response": ["Three days later, the Red Devils suffered their first defeat of the season, going down by a single goal at Burnley. United went behind after 19 minutes, as Robbie Blake hit a volley into the top corner of the net after Stephen Jordan's cross was only half-cleared by Patrice Evra. Blake himself conceded a penalty on the stroke of half-time, but Michael Carrick had his kick saved by Brian Jensen, low to the goalkeeper's right. As the Reds – wearing their all-black change strip – searched for an equaliser, the final ball kept evading them and several moves came to nothing, leaving United to endure a defeat by the newly promoted club."]}, {"page": "2009–10 Premier League", "response": ["*First own goal of the season: Stephen Jordan (Burnley) for Stoke City, 32 minutes and 28 seconds (15 August 2009)"]}, {"page": "2009–10 in English football", "response": ["15 August: The new Premier League season kicks off, with the highlight of the opening day coming at Goodison Park where Arsenal trounce Everton 6–1 in the biggest opening day victory at this level for 15 years. Burnley's return to the top flight after 33 years away begins on a low note when an own goal by Stephen Jordan contributes to a 2–0 defeat against Stoke City."]}, {"page": "2006–07 Manchester City F.C. season", "response": ["This season not all of the team's friendly games were played during the preparatory run-in to the official start of the new league campaign, with a couple of friendly games taking place during the course of the active season.  The first of these games was perhaps just a \"belated pre-season friendly\" that was played with the season still only nine days old, while the other one against Blackpool in February was more of a mutually arranged scrimmage behind closed doors, with one of its intended purposes being to provide a \"friendly competitive\" tryout for the 28-year-old Belgian international striker, Émile Mpenza, who at the time the Manchester club was considering signing.  This impromptu scrimmage served as a key part of Mpenza's brief trial with City and saw him perform well enough, with his scoring of the second goal in the 3–0 win, that he was subsequently signed by City two days later (his unattached free agent status permitting him to be signed outside of the January transfer window).  The extemporaneous Valentine's Day friendly also gave some City players in need of match fitness, such as Didi Hamann and Stephen Jordan, a chance to get a full 90 minutes of play under their belts."]}, {"page": "2009–10 Everton F.C. season", "response": ["The club earned their fourth consecutive Premier League draw of the season at the Stadium of Light on 26 December. Both teams played well, and Sunderland clung to a one-goal lead for much of the match after Darren Bent converted a header from Kenwyne Jones in the 17th minute. Everton pressed hard in the remainder of the match, particularly during the second half, and were rewarded in the 85th minute when Fellaini finished a Tony Hibbert cross. In their final match of 2009, on 28 December, the Blues were able to end they calendar year on a positive note as they earned their first win in over seven weeks – and first victory at home in over three months – defeating Burnley at Goodison Park, 2–0. Both goals game last in the second half, James Vaughan tallying in the 83rd minute – his first goal in two years – and Steven Pienaar during extra time. Both scores came after Stephen Jordan was sent off in the 62nd minute when he earned his second yellow card of the day. Burnley manager Owen Coyle criticised the referee after the match, believing the Everton's go-ahead goal had been scored with Yakubu in an offside position."]}, {"page": "2009–10 Burnley F.C. season", "response": ["!scope=\"row\"|Stephen Jordan"]}, {"page": "2009–10 Stoke City F.C. season", "response": ["For the season opener against Burnley Stoke gave new signing Dean Whitehead his debut. Newly promoted Burnley started brightly and went close through Robbie Blake. However City soon took control of the match and went in front after 19 minutes through Ryan Shawcross, before a trademark Rory Delap long throw-in was glanced into his own net by defender Stephen Jordan to put Stoke into a 2–0 lead. The away side improved in the second half but failed to trouble Sorensen and Stoke could have added a third with Dave Kitson hitting the post and Richard Cresswell narrowly shooting wide."]}, {"page": "2004–05 Manchester City F.C. season", "response": ["|41||DF||align=\"left\"| Stephen Jordan"]}, {"page": "2001–02 Manchester City F.C. season", "response": ["|align=\"left\"|27||align=\"left\"|DF||align=\"left\"| Stephen Jordan"]}, {"page": "2010–11 Burnley F.C. season", "response": ["|||DF|| Stephen Jordan || Sheffield United  || Released || 11 May 2010"]}, {"page": "2010–11 Huddersfield Town A.F.C. season", "response": ["On 2 June, Icelandic international Joey Guðjónsson signed on a 2-year contract from recently relegated Premier League side Burnley. Two days later, Scottish international left-back Gary Naysmith signed for the Terriers after rejecting a new contract at Sheffield United. On the same day, goalkeeper Simon Eastwood left the club to join newly promoted Football League Two side Oxford United. On 17 June, goalkeeper Ian Bennett was signed on a free transfer from Sheffield United. On 22 June, striker Tom Denton left the club by mutual consent. The following day, defender Andy Butler also had his contract paid up and left the club. On 29 June, left-back Joe Skarz signed for Football League Two side Bury for an undisclosed fee. The following day, winger Lee Croft joined the Terriers on a 6-month loan deal from Derby County. He returned to Derby on 3 January 2011. On 1 July, defender Jamie McCombe, whose brother John, played for Town in the not too distant past, joined the Terriers for an undisclosed fee from Bristol City. The following day, after failing to reach a new deal, Krystian Pearce left the club after playing just 45 minutes for the Terriers. He eventually joined Notts County. On 6 July, midfielder James Berrett left the club to join fellow League One side Carlisle United on a free transfer. Later that day, midfielder Michael Collins joined Football League Championship side Scunthorpe United for an undisclosed fee. On 14 July, young Irish winger Graham Carey signed on a 6-month loan from Scottish Premier League runners-up Celtic. He returned to Celtic on 13 January 2011, after Town failed to agree terms on an extension to his deal. On 21 July, striker Joe Garner signed on a 6-month loan from Nottingham Forest. He returned to Forest on 4 January 2011. On 28 July, two of Town's youngsters, Jack Hunt and Leigh Franks, were sent out on 6-month loans to Chesterfield and Oxford United respectively. On 5 August, midfielder Damien Johnson was signed on a season-long loan from League One rivals Plymouth Argyle. The following day, striker Robbie Simpson joined Brentford on a season-long loan. On 25 August, striker Alan Lee joined the club for an undisclosed fee from Crystal Palace. On 31 August, Jim Goodwin left the club my mutual consent. He would join Scottish Premier League side Hamilton Academical on 6 September. On 8 September, Theo Robinson joined Championship side Millwall on an emergency 3-month loan deal, but he returned in November, after picking up an injury. He then rejoined the club on a permanent deal on 13 January, for an undisclosed fee. On 15 October, Town brought in experienced keeper Nick Colgan on a one-month loan from Conference National side Grimsby Town. He returned a month later, after making no appearances for Town. On 21 January 2011, he signed for Town on a permanent deal, after being released by Grimsby. On 1 January 2011, as the transfer window reopened, Town signed the experience Ireland international Kevin Kilbane on loan from Hull City for the rest of the season. On 10 January, Town signed Newcastle United's Hungarian international defender Tamás Kádár on loan. On 27 January, Town stalwart Nathan Clarke joined Town's League One rivals Colchester United on loan. On 31 January, as the transfer window was about to shut, Danny Cadamarteri returned to the Terriers on a short-term contract following his release by Scottish Premier League side Dundee United. On 26 February, Town signed left-back Stephen Jordan on an emergency one-month loan from Sheffield United, following injuries to Gary Naysmith and Liam Ridehalgh. On 15 March, a week after the sickening injury that curtailed Anthony Pilkington's involvement in the season, Town increased their attacking options by bringing in winger Danny Ward on loan from Premier League side Bolton Wanderers for the rest of the season. They then bolstered their defensive options by signing centre-back Sean Morrison on loan from Reading on 23 March. Just as the transfer window shut, young midfielder Aidan Chippendale was sent on loan to Conference National side York City", "| Stephen Jordan", "| Stephen Jordan", "|22||Stephen Jordan||||DF||6||0||0||0||0||0||0||0||0||0||6||0"]}, {"page": "2007–08 Burnley F.C. season", "response": ["!scope=\"row\"|Stephen Jordan"]}, {"page": "2012–13 Greenock Morton F.C. season", "response": ["|Callum Morris   Ryan Wallace    Stephen Jordan   Josh Falkingham "]}, {"page": "2012–13 Dunfermline Athletic F.C. season", "response": ["|||DF||Stephen Jordan", "| Stephen Jordan", "|  Stephen Jordan"]}, {"page": "Alex Whittle", "response": ["He joined Dunfermline Athletic on a pre-contract in April 2012 ahead of signing a three-year contract. He made his debut on 28 July in a Scottish Challenge Cup match against Forfar Athletic and his Scottish Football League debut on 11 August in a 4–0 victory against Cowdenbeath. Whittle was signed as a winger and made sporadic appearances, often as a substitute, but got his break in the first team at left-back following the redundancy of Stephen Jordan amid Dunfermline's administration. He scored his first goal for Dunfermline against Ayr United on 28 September 2013. After being released by Dunfermline at the end of 2014–15, Whittle appeared as a trialist for Hartlepool United in a friendly match against Spennymoor Town. Hartlepool manager Ronnie Moore commented that he was \"pleased\" with Whittle's performance, adding that he had asked Whittle to stay with the club for an extra week in order to assess him."]}, {"page": "2013–14 Fleetwood Town F.C. season", "response": ["|25||Stephen Jordan||LB/RB||||Warrington||||1||0||–||–||Dunfermline Athletic||12 July 2013||Free||Undisclosed"]}, {"page": "2014 Football League Two play-off Final", "response": ["|DF ||25||Stephen Jordan"]}]}}