{"wiki_id": "http://www.wikidata.org/entity/Q924479", "itemLabel": "Robert Henry Charles", "itemDescription": "Biblical scholar, theologian", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Charles_(scholar)", "wikipedia_page": {"main": "Robert Henry (R. H.) Charles,  (Cookstown, 6 August 1855–Westminster, 1931) was an Irish Anglican theologian, biblical scholar, professor, and translator from Northern Ireland. He is known particularly for his English translations of numerous apocryphal and pseudepigraphal Ancient Hebrew writings, including the Book of Jubilees (1895), the Apocalypse of Baruch (1896), the Ascension of Isaiah (1900), the Book of Enoch (1906), and the Testaments of the Twelve Patriarchs (1908), which have been widely used. He wrote the articles in the eleventh edition of Encyclopædia Britannica (1911) attributed to the initials \"R. H. C.\"\nHe was born in Cookstown, County Tyrone, on 6 August 1855 and educated at the Belfast Academy, Queen's College, Belfast, and Trinity College, Dublin, with periods in Imperial Germany and Switzerland. He gained a D.D. and became Professor of Biblical Greek at the Trinity College. In 1906, he was elected Fellow of the British Academy and four years later he was appointed Fellow of the Merton College, Oxford.\nHe also became Archdeacon of Westminster in 1919, serving until his death in 1931. He is buried in Westminster Abbey\nSource \"Queens University Belfast Collections & Archives \" R H Charles married,  Mary Lilias 1886...having no children.", "link_mentions": [{"page": "Book of Enoch", "response": ["The most extensive surviving witnesses to the Book of Enoch exist in the Ge'ez language. Robert Henry Charles's critical edition of 1906 subdivides the Ethiopic manuscripts into two families:", "The generation of Enoch scholarship from 1890 to World War I was dominated by Robert Henry Charles. His 1893 translation and commentary of the Ethiopic text already represented an important advancement, as it was based on ten additional manuscripts. In 1906 R.H. Charles published a new critical edition of the Ethiopic text, using 23 Ethiopic manuscripts and all available sources at his time. The English translation of the reconstructed text appeared in 1912, and the same year in his collection of The Apocrypha and Pseudepigrapha of the Old Testament.", "* Robert Henry Charles. The Book of Enoch (Oxford: Clarendon, 1893), translated from professor Dillmann's Ethiopic text - The Ethiopic Version of the Book of Enoch (Oxford: Clarendon, 1906)", "* Robert Henry Charles. The Book of Enoch or 1 Enoch (Oxford: Clarendon, 1912)"]}, {"page": "Testaments of the Twelve Patriarchs", "response": ["As argued by Robert Henry Charles, who studied and translated the Testaments in the beginning of the 20th century,"]}, {"page": "Ascension of Isaiah", "response": ["* The Ethiopic version of the Ascension of Isaiah (with Greek and Latin fragments), edited by Robert Henry Charles in 1900"]}]}}