{"wiki_id": "http://www.wikidata.org/entity/Q925535", "itemLabel": "Steven Smith", "itemDescription": "Scottish footballer (born 1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Smith_(footballer,_born_1985)", "wikipedia_page": {"main": "Steven Smith (born 30 August 1985) is a Scottish footballer.\nA left-back, Smith made an early breakthrough with Scottish side Rangers, and was capped by Scotland B in 2006, aged 21. A series of injuries hampered his career with club and country, before he moved to England with Norwich City, aged 24, on a Bosman transfer. During his time there he had a loan spell at Aberdeen and then joined Preston North End. He then moved to Portland Timbers and in 2013 returned to Rangers where he spent two years, before moving to Kilmarnock.", "link_mentions": [{"page": "August 30", "response": ["*  1985   – Steven Smith, Scottish footballer"]}, {"page": "Blantyre, South Lanarkshire", "response": ["* Steven Smith, footballer (Rangers, Portland Timbers, Aberdeen, Kilmarnock)"]}, {"page": "Steven Smith", "response": ["Stephen, Steve, Stevie, Stevin, or Steven Smith may refer to:", "*Steven Smith (VJ), video jockey (VJ) on fuse, hosts Steven's Untitled Rock Show", "*Elliott Smith (Steven Smith, 1969–2003), musician ", "*Steven Smith (American football coach) (born 1976), head football coach at Lincoln University in Missouri", "*Steven Smith (footballer, born 1985), Scottish footballer", "*Steven Smith (basketball) (born 1983), American basketball player", "*Steven Smith (Australian rules footballer) (born 1956), former Australian rules footballer and current President of the Melbourne Cricket Club", "*Steven Smith (equestrian) (born 1962), British equestrian", "*Steven Smith (astronaut) (born 1958), American technology executive and NASA astronaut", "*Steven Smith (teamaker) (1949–2015), American tea entrepreneur"]}, {"page": "Bellshill", "response": ["*Steven Smith, footballer"]}, {"page": "List of foreign MLS players", "response": ["*Steven Smith – Portland – 2012"]}, {"page": "Graham Alexander", "response": ["Alexander scored his first goal for Preston in four years with a trademark penalty in a 2–1 home win against Tranmere on 24 September 2011. This was after his first penalty back in a Preston shirt was saved by Exeter's Artur Krysiak, and before his third was saved by Lee Butcher of Leyton Orient. His next penalty came in a penalty shootout against Rochdale in the Football League Trophy, which was slotted into the top corner after he was brought on as a substitute for Conor McLaughlin especially to take a penalty in the shootout. However, he missed his next penalty, again in the Football League Trophy, and again in a penalty shootout, this time against Chesterfield. He was the third Preston player to take a penalty in this shootout, and he blazed it over the bar, much to the disbelief of the fans. Preston's next penalty-taker, Paul Coutts, had his penalty saved, and then when the next penalty was scored by Chesterfield's Alexandre Mendy, Preston got knocked out of the tournament. Alexander started the next league game against Stevenage but was replaced through injury by Steven Smith after just 3 minutes, after which Alexander did not feature for the Lilywhites for a long time, and there was speculation that he had played his last game for Preston, and in his career."]}, {"page": "2006–07 Rangers F.C. season", "response": ["|Steven Smith", "|Steven Smith"]}, {"page": "2005–06 Scottish Premier League", "response": ["| Steven Smith (Rangers)"]}, {"page": "List of Scottish Premier League monthly award winners", "response": ["| Steven Smith (Rangers)"]}, {"page": "Rangers F.C. B Team and Academy", "response": ["|Youth Development Phase Coach || Steven Smith", "| 15 ||  Steven Smith ||   ||  ||align=\"center\"|110 ||align=\"center\"|5 ||align=\"center\"| ||align=\"center\"|"]}, {"page": "Martyn Waghorn", "response": ["He scored his first senior hat-trick in a 4–0 win over Greenock Morton on 27 September 2015, taking his league goal tally to 11 and his overall tally to 14, making him the leading goal scorer in the league. He received the Scottish Championship Player of the Month Award for September due to his performances on the pitch. He then scored two goals in a 4–0 victory against Alloa Athletic on 7 November 2015, taking his overall tally to 17 goals. He scored another treble in a 5–1 victory over Cowdenbeath in the fourth round of the Scottish Cup. On 16 February 2016, Waghorn sustained a knee ligament injury in Rangers's 2–1 win over Kilmarnock after being tackled by former Rangers defender Steven Smith and was ruled out for 6–8 weeks. He did not return until the final league match of the season against St Mirren on 1 May 2016. Waghorn also played in the 2016 Scottish Cup Final but could not prevent Rangers losing the match 3–2."]}, {"page": "2008–09 Rangers F.C. season", "response": ["|Steven Smith"]}, {"page": "2009–10 Rangers F.C. season", "response": ["|Steven Smith"]}, {"page": "Blue Heaven (2003 TV series)", "response": ["* Steven Smith"]}, {"page": "Daniel Ayala", "response": ["On 13 August 2011, Ayala signed for Norwich City for a reported fee of £800,000. The deal officially went through on 16 August 2011. Ayala was handed the number 26 shirt, vacated by Steven Smith and was named in the squad for the Premier League fixture against Stoke City at Carrow Road on 21 August 2011. This was due to Zak Whitbread being rated as doubtful for the fixture after picking up a knee knock against Wigan. He made his debut for Norwich as a second-half substitute for Anthony Pilkington following Leon Barnett's sending off against Stoke."]}, {"page": "2012 Major League Soccer season", "response": ["|Steven Smith"]}, {"page": "2010 Scottish League Cup Final", "response": ["|DF ||26|| Steven Smith || || "]}, {"page": "2010–11 Norwich City F.C. season", "response": ["|align=\"left\"|26||align=\"left\"|DF||align=\"left\"| Steven Smith", "|Steven Smith"]}, {"page": "2010–11 Aberdeen F.C. season", "response": ["|align=left| Steven Smith", "|Steven Smith"]}, {"page": "Saša Papac", "response": ["He signed for Rangers on 31 August 2006 for a fee of £450,000. He became Rangers' third signing from Austria Vienna in the 2006 summer transfer window, after Libor Sionko and Filip Šebo. Papac made his debut for Rangers on 17 September 2006, coming on as a half time substitute for Steven Smith in a Scottish Premier League game against Hibernian. The side went on to lose the match 2–1."]}, {"page": "All-time Portland Timbers (MLS) roster", "response": ["*  Steven Smith"]}, {"page": "2011–12 Aberdeen F.C. season", "response": ["| Steven Smith"]}, {"page": "2011–12 Preston North End F.C. season", "response": ["|14||||DF||Steven Smith||5||1||0||0||1||0||0||0||6||1"]}, {"page": "2012 Portland Timbers season", "response": ["| style=\"text-align: left;\" |Steven Smith", "| April 25, 2012 ||  Steven Smith || DF ||  Preston North End || Free || "]}, {"page": "List of Major League Soccer transfers 2012", "response": ["| April 25, 2012 ||  Steven Smith || Unattached || Portland Timbers || Free"]}, {"page": "2013 Portland Timbers season", "response": ["| December 6, 2012 ||  Steven Smith || DF ||  Rangers F.C. || Contract expired, team option not exercised || "]}, {"page": "2013–14 Rangers F.C. season", "response": ["|Steven Smith", "|Steven Smith"]}, {"page": "Stevie Smith (footballer)", "response": ["#REDIRECT Steven Smith (footballer, born 1985)"]}]}}