{"wiki_id": "http://www.wikidata.org/entity/Q926225", "itemLabel": "Mark Hunter", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Hunter_(rower)", "wikipedia_page": {"main": "Mark John Hunter MBE (born 1 July 1978) is a retired British rower.", "link_mentions": [{"page": "1978", "response": ["** Mark Hunter, British rower"]}, {"page": "North Greenwich, Isle of Dogs", "response": ["Blackwall and District Rowing Club was formed in 1845 and is one of the oldest rowing clubs in the United Kingdom. A Tideway rowing club, historically it known as the Poplar, Blackwall and District Rowing Club. It competes in leading national races, runs Poplar regatta (wind permitting), and is the end of the Great River Race. Its members hold old records in the Doggett's Coat and Badge race for single sculls on the Thames.Blackwall and District Rowing Club Retrieved 2013-08-22  Its most notable member is Olympic gold and silver medallist, and double-World Champion Mark Hunter."]}, {"page": "Leander Club", "response": ["* Mark Hunter"]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Nick EnglishMike HennessyMark HunterTim Male"]}, {"page": "Forest Gate", "response": ["Mark Hunter, MBE, was born and raised in Forest Gate and won the gold medal in the lightweight double scull at the 2008 Beijing Olympics and gold medals in the lightweight double scull at 2010 and 2011 World Championships. Mark was a Team GB member for the London 2012 Olympics."]}, {"page": "Rowing at the 2004 Summer Olympics – Men's lightweight coxless four", "response": ["| 4 ||  || Mike Hennessy, Tim Male, Nick English, Mark Hunter || 6:05.57 || R", "#: Mike Hennessy, Tim Male, Nick English, Mark Hunter, 5:58.80"]}, {"page": "Scullers Head of the River Race", "response": ["|2004|| Mark Hunter||Leander 50px ||\t 21:22.13"]}, {"page": "Kieran West", "response": ["West's international rowing career began in 1998, when he competed for Great Britain with Mark Hunter in the Double Scull at the under-23 World Rowing Championships in Ioannina, Greece. The following year he was selected to row in the Men's Eight at the World Rowing Championships."]}, {"page": "Mark Hunter", "response": ["Mark Hunter may refer to:", "* Sir Mark Hunter (civil servant) (1865–1932), schoolmaster in India", "* Mark Hunter (politician) (born 1957), British politician and LibDem MP for Cheadle", "* Mark Hunter (ice hockey) (born 1962), retired NHL ice hockey player", "* Mark Hunter (footballer) (born 1965), former Australian rules footballer with Footscray", "* Mark Hunter (musician) (born 1977), singer for the now defunct American heavy metal band Chimaira", "* Mark Hunter (rower) (born 1978), Olympic gold medalist rower and Leander Club member", "* Mark Hunter (keyboard player), keyboard player associated with Manchester band James", "* Mark Hunter (podcaster), Scottish podcaster behind The Mellow Monday Show and the Tartan Podcast"]}, {"page": "Havering Sixth Form College", "response": ["* Mark Hunter, Olympic Gold Medalist"]}, {"page": "Zac Purchase", "response": ["His main discipline was sculling with the majority of his international medals being won in the Lightweight Men's Double Scull with Mark Hunter.", "*2011 Bled – Gold, Lightweight Double Scull (bow) with Mark Hunter"]}, {"page": "Rowing at the 2008 Summer Olympics – Qualification", "response": ["| 3 ||  || 2007 Worlds || 3 || Zac Purchase, Mark Hunter"]}, {"page": "2007 World Rowing Championships", "response": ["|   Zac Purchase (b)Mark Hunter (s) || 6:26.92"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["The medals won included gold in the coxless four, for the third successive games, and Zac Purchase and Mark Hunter winning Great Britain's first ever lightweight rowing Olympic medal in the men's lightweight double sculls.", "|align=left|Mark Hunter Zac Purchase"]}, {"page": "Rowing at the 2008 Summer Olympics – Men's lightweight double sculls", "response": ["|Zac Purchase, Mark Hunter", "|Zac Purchase, Mark Hunter", "|Zac Purchase, Mark Hunter"]}, {"page": "Chronological summary of the 2008 Summer Olympics", "response": ["|Zac Purchase and Mark Hunter"]}, {"page": "List of 2008 Summer Olympics medal winners", "response": ["|Zac PurchaseMark Hunter"]}, {"page": "2010 World Rowing Championships", "response": ["| Zac PurchaseMark Hunter|| 7:13.47"]}, {"page": "2011 World Rowing Championships", "response": ["| Zac PurchaseMark Hunter|| 6:18.67"]}, {"page": "2009 New Year Honours", "response": ["* Mark Hunter, Rower. For services to Sport."]}, {"page": "Great Britain at the 2012 Summer Olympics", "response": ["Day 8 (4 August) of the Games, which had been billed in the build up to the Games in the host country as \"Super Saturday\" due to the expected programme creating numerous strong medal possibilities for the hosts, saw Great Britain record their most successful day at the Olympics since the 1908 games. The day saw the team win 6 gold medals, starting in the rowing for Alex Gregory, Tom James, Pete Reed and Andrew Triggs Hodge in the men's coxless four and Katherine Copeland and Sophie Hosking in the women's lightweight double sculls, followed in the cycling by Dani King, Joanna Rowsell Shand and Laura Trott in the women's team pursuit. This was followed by three athletics gold medals in the space of 46 minutes, with Jessica Ennis winning gold in the women's heptathlon, Greg Rutherford in the men's long jump and Mo Farah in the men's 10,000 metres. Completing the medal total on the day in the rowing was a silver for Mark Hunter and Zac Purchase in the men's lightweight double sculls. Lord Coe, organiser of London 2012, described the unfolding of the day's events as \"a narrative of infectious success\" and the greatest day of sport he had ever witnessed.", "| style=\"text-align:left;\" | Mark HunterZac Purchase"]}, {"page": "Bower Park Academy", "response": ["* Mark Hunter, Olympic gold medallist"]}]}}