{"wiki_id": "http://www.wikidata.org/entity/Q9287820", "itemLabel": "Henry Cadogan, Viscount Chelsea", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Cadogan,_Viscount_Chelsea", "wikipedia_page": {"main": "Henry Arthur Cadogan, Viscount Chelsea,  (born Henry Arthur Cadogan; 13 June 1868 – 2 July 1908) was a British Army officer, civil servant and politician.\nThis Viscount Chelsea (the title is a courtesy title) was a Conservative Member of the House of Commons (MP) elected twice to the seat of Bury St Edmunds.  He was previously a captain in the 3rd Battalion of the Royal Fusiliers and a civil servant to the Prime Minister. His father was a major developer of part of Kensington and Chelsea and represented the Crown in Ireland.  Henry became his expectant heir from the age of 10 but had no sons who survived childhood and he predeceased his father at the age of 40.\nHis wife, Cecilia Mildred Harriet Sturt, had a less notable career than Henry. She suffered the loss of her husband and two years later, that of their only son but that year married again and being widowed again, married the Duke of Manchester.", "link_mentions": [{"page": "Earl Cadogan", "response": ["His eldest son, the fifth Earl, was also a noted Conservative politician. He held office under Disraeli and later Lord Salisbury as Under-Secretary of State for War, Under-Secretary of State for the Colonies, Lord Privy Seal and Lord Lieutenant of Ireland (with a seat in the cabinet). His second son Henry Cadogan, Viscount Chelsea, heir apparent to the earldom from 1878 to 1908, represented Bury St Edmunds in Parliament as a Conservative, but died in 1908, seven years before his father. His only son Edward, Viscount Chelsea, died in 1910 at the age of seven. Lord Cadogan was therefore succeeded by his third but eldest surviving son, the sixth Earl. As of 2017, the titles are held by the latter's grandson, the eighth Earl, who succeeded his father in 1997."]}, {"page": "John Spencer-Churchill, 10th Duke of Marlborough", "response": ["On 17 February 1920, he was married to the Hon. Alexandra Mary Cadogan (1900–1961) at a ceremony at St Margaret's Church in London attended by King George V and Queen Mary. As a wedding gift, his maternal grandfather gave him a house in London. She was a daughter of Henry Cadogan, Viscount Chelsea, the son and heir of George Henry Cadogan, 5th Earl Cadogan. Together, they had two sons and three daughters:"]}, {"page": "Edward Stanley, Lord Stanley (died 1938)", "response": ["Lord Stanley married the Honourable Sibyl Louise Beatrix Cadogan, daughter of Henry Cadogan, Viscount Chelsea, in 1917; they had three sons. He died in Marylebone, London, in October 1938, aged 44, predeceasing his father by ten years. His eldest son Edward succeeded his grandfather in the earldom in 1948. Another son, Richard, later became MP for Fylde North. Lady Stanley died in June 1969, aged 76."]}, {"page": "Alexander Cadogan", "response": ["Cadogan was brought up in a distinguished and wealthy aristocratic family as the seventh son and youngest child of George Cadogan, 5th Earl Cadogan, and his first wife Lady Beatrix Jane Craven, daughter of William Craven, 2nd Earl of Craven. He was the brother of Henry Cadogan, Viscount Chelsea, Gerald Cadogan, 6th Earl Cadogan, William Cadogan, and Sir Edward Cadogan. He was educated at Eton and Balliol College, Oxford,thepeerage.com Rt. Hon. Sir Alexander George Montagu Cadogan where he read History."]}, {"page": "Culford", "response": ["*Henry Cadogan, Viscount Chelsea (1868-1908), Conservative MP for Bury St Edmunds, captain in the 3rd Battalion of the Royal Fusiliers"]}, {"page": "Hedworth Meux", "response": ["In 1910 Lambton married Mildred Cecilia Harriet, daughter of Henry Sturt, 1st Baron Alington and widow of Henry Cadogan, Viscount Chelsea; they had no children, though he acquired five step-children, who inherited the bulk of his estate.Mosley, Charles, editor. Burke's Peerage, Baronetage & Knightage, 107th edition, 3 volumes. Wilmington, Delaware, U.S.A.: Burke's Peerage (Genealogical Books) Ltd, 2003."]}, {"page": "Henry Arthur Cadogan, Viscount Chelsea", "response": ["#REDIRECT Henry Cadogan, Viscount Chelsea"]}, {"page": "Henry Sturt, 1st Baron Alington", "response": ["* Mildred Cecilia Harriet Sturt (1869–1942), who herself made two notable marriages - first to Henry Cadogan, Viscount Chelsea, and, after his death, to Hedworth Lambton. On 4 December 1930, she also married Charles William Augustus Montagu."]}, {"page": "Ann Parker Bowles", "response": ["Ann de Trafford was born in 1918 in London, the eldest daughter of millionaire racehorse owner Sir Humphrey de Trafford, 4th Baronet, and the Hon. Cynthia Hilda Evelyn Cadogan, a daughter of Henry Cadogan, Viscount Chelsea.General Register Office births registered in the 3rd Quarter of 1918: Marylebone Volume 1a page 558 The de Trafford Baronets descended from a pre-Conquest-founded line of lords of the manor who were wealthy in the Middle Ages and whose titles were reinstated in the mid-19th century due to recusancy — a term coined to describe the minority of English who remained Roman Catholic during and after the Reformation in a time of significant religious persecution.  Ann (later Dame Ann) continued to adhere to the religion of her family, Roman Catholicism."]}, {"page": "Henry Cadogan (disambiguation)", "response": ["*Henry Cadogan, Viscount Chelsea (1868–1908), British politician"]}, {"page": "Arthur Mills, 3rd Baron Hillingdon", "response": ["Lord Hillingdon married the Honourable Edith Mary Winifred Cadogan, daughter of Henry Cadogan, Viscount Chelsea, in 1916. They had two sons and three daughters. Lady Hillingdon was chairman of the Central Women's Advisory Committee of the Conservative Party and was made a Dame Commander of the Order of the British Empire in 1939.thepeerage.com Hon. Edith Mary Winifred Cadogan She was godmother to her niece Sarah, eldest daughter of John Spencer-Churchill, 10th Duke of Marlborough.  "]}, {"page": "Lady Rosemary Spencer-Churchill", "response": ["Lady Rosemary Mildred Spencer-Churchill was born on 24 July 1929 in London to John Spencer-Churchill, Marquess of Blandford, and Alexandra Mary Cadogan. Her maternal grandfather was Henry Cadogan, Viscount Chelsea. Her paternal grandmother was Consuelo Vanderbilt. Her father inherited the Dukedom of Marlborough, becoming the tenth duke when Spencer-Churchill was five years old. She grew up at Blenheim Palace in West Oxfordshire. After her father's death in 1972 her brother, John, became the eleventh Duke of Marlborough."]}, {"page": "Cecilia Cadogan, Viscountess Chelsea", "response": ["#REDIRECT Henry Cadogan, Viscount Chelsea"]}, {"page": "Mildred Cadogan, Viscountess Chelsea", "response": ["#REDIRECT Henry Cadogan, Viscount Chelsea"]}]}}