{"wiki_id": "http://www.wikidata.org/entity/Q929679", "itemLabel": "Ray Jones", "itemDescription": "British footballer (1988-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Jones_(footballer,_born_1988)", "wikipedia_page": {"main": "Raymond Barry Bankote Jones (28 August 1988 – 25 August 2007) was an English professional footballer who played as a striker. Jones spent his professional career at Queens Park Rangers, making his debut in the Football League Championship in April 2006. His good form at the start of the following season led to his only international match, for England under-19 against the Netherlands, as well as bids for other clubs to sign him. He totalled six goals in 37 professional matches.\nJones died three days before his 19th birthday, when he drove head-on into a bus in London. His club retired his shirt number of 31. An inquest into the accident ruled that had Jones survived, he would have faced charges of causing death by dangerous driving for the deaths of his two passengers.", "link_mentions": [{"page": "August 25", "response": ["*  2007   – Ray Jones, English footballer (b. 1988)"]}, {"page": "Queens Park Rangers F.C.", "response": ["During this same period, QPR became embroiled in financial and boardroom controversy. Although the club had floated on the Alternative Investment Market in 1991, in 2001 it entered administration (receivership). A period of financial hardship followed and the club left administration after receiving a £10m high-interest emergency loan which continued to burden the club. Scandals involving the directors, shareholders and others emerged in 2005–06 season and included allegations of blackmail and threats of violence against the club's chairman Gianni Paladini. In an unrelated incident, QPR were further rocked by the murder of youth team player Kiyan Prince on 18 May 2006 and, in August 2007, the death of teenager and promising first-team player Ray Jones in a car crash.", "The club retired the number 31 shirt as a tribute to former striker Ray Jones who died in 2007."]}, {"page": "Nedum Onuoha", "response": ["The 2017–18 season saw Onuoha retain his captaincy as well as his place in the starting eleven for the side, playing in the centre–back position for most of the season. His 200th appearance for the club came on 9 September 2017, playing the whole game, in a 2–1 win over Ipswich Town. However, in a follow–up match against Millwall, Onuoha suffered a hamstring injury and was substituted at half time, as the game finished 2–2. Shortly after, it was announced that Onuoha was out for three months. While on the sidelines, the club opened talks with him over a new contract. It wasn't until on 9 December 2017 that Onuoha made his return from injury, playing the whole game in a 3–1 loss against Leeds United. Since his return to the first team, he regained his first team place as well as the captaincy. During a 4–0 loss against Hull City on 7 April 2018, Onuoha was sent–off in the last minute of the game for a professional foul on Markus Henriksen; and served a three match suspension. Despite being absent that saw him miss seventeen matches during the 2017–18 season, Onuoha helped the side finish sixteen place in the league. Having made thirty–six appearances in the 2017–18 season, it was announced on 27 April 2018, it was announced that Onuoha would be leaving the club at the end of the 2017/18 season, bringing an end to a six-and-a-half-year stay. By the time of his departure, he was awarded the Ray Jones Players' Player of the Year, voted for by his team-mates."]}, {"page": "2007–08 in English football", "response": ["25 August 2007: Ray Jones, 18-year-old Queens Park Rangers striker, dies in a car crash in east London which claims the lives of two other people.", "*25 August 2007 – Ray Jones, 18, Queens Park Rangers striker, killed in a car accident.QPR's Ray Jones dies in car crash BBC Sport. Retrieved 25 August 2007"]}, {"page": "1988 in association football", "response": ["* 28 August: Ray Jones, English footballer (d. 2007)"]}, {"page": "Raymond Barry Bankote \"Ray\" Jones", "response": ["#REDIRECT Ray Jones (footballer, born 1988)"]}, {"page": "Raymond Barry Bankote Jones", "response": ["#REDIRECT Ray Jones (footballer, born 1988)"]}, {"page": "Raymond Jones", "response": ["Raymond or Ray Jones may refer to:", "*Ray Jones (American football) (born 1947), American football player", "*Ray Jones (cyclist) (1918–1990), English road cyclist", "*Ray Jones (footballer, born 1921) (1921–2008), Australian rules footballer for South Melbourne", "*Ray Jones (footballer, born 1924), Australian rules footballer for Geelong", "*Ray Jones (footballer, born 1944) (1944–2007), English footballer who played for Chester City", "*Ray Jones (footballer, born 1988) (1988–2007), English footballer who played for QPR", "*Ray Jones (Western Australia politician) (1909–1967), MLC for Midlands Province", "*Ray Jones (Queensland politician) (1926–2000), MLC for Cairns", "*Ray Jones (Kentucky politician) (born 1969), member of the Kentucky Senate"]}, {"page": "2007–08 Queens Park Rangers F.C. season", "response": ["The season began turbulently, with a draw against recently promoted Bristol City, a loss in the League Cup 2–1 at home to League One Leyton Orient followed by a further 2–0 defeat at home by Cardiff City. The match against Burnley on 25 August was postponed after promising teenage player Ray Jones was killed in a car crash in the early hours of the morning. A week later QPR crashed to a 3–0 defeat at home to Southampton, followed by a draw with Leicester and a further home defeat by Plymouth (0–2) before picking up only their second point of the month (and the third of the season) at home to Watford on 22 September.", "Following the game Martin Rowlands was named both the club's Ray Jones Players' Player of the Year and the Supporters' Player of the Year. Chelsea loan player and England U21 international defender Michael Mancienne was awarded the Supporters' Young Player of the Year award. Akos Buzsaky won the Kiyan Prince Goal of the Season award for his goal against Blackpool at Loftus Road on 11 March.  Zesh Rehman was also awarded for his Community Commitment."]}, {"page": "Joe Gallen", "response": ["During his time as youth coach at QPR he brought through many talented young players into the professional ranks. As QPR at the time had no academy, many of these players were subsequently signed by other clubs. He did, however, put a lot of work into the development of Ray Jones who made it into the first team at QPR before being killed in a 2007 car accident."]}, {"page": "2006–07 Queens Park Rangers F.C. season", "response": ["|align=center|=||align=left| Ray Jones||align=center|FW||align=center|5||align=center|1||align=center|0||align=center|6"]}, {"page": "Ray Jones (footballer born 1988)", "response": ["#REDIRECT Ray Jones (footballer, born 1988)"]}]}}