{"wiki_id": "http://www.wikidata.org/entity/Q930783", "itemLabel": "Kwame Steede", "itemDescription": "British footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kwame_Steede", "wikipedia_page": {"main": "Kwame Steede (born 4 July 1980) is a Bermudian football coach and former player. He was appointed head coach of the Devonshire Cougars in 2015.", "link_mentions": [{"page": "July 4", "response": ["*1980 – Kwame Steede, Bermudan footballer"]}, {"page": "Bermudian Premier Division", "response": ["| Kwame Steede || Devonshire Cougars || 15", "| Raymond Beach   Kwame Steede || Dandy Town  Devonshire Cougars || 13"]}, {"page": "Bermuda Hogges F.C.", "response": ["The initial first team squad included a number of full Bermudian international players, notably Stephen Astwood, Domico Coddington, Darius Cox, Devaun DeGraff, Timothy Figureido, Damon Ming, John Barry Nusum, Michael Parsons, Jelani Scott and Kwame Steede, all of whom had represented their country in various World Cup and CONCACAF Gold Cup qualifying games. Shaun Goater and Kyle Lightbourne were also Bermudian internationals until their retirement from international football, making the Hogges' by far the most experienced USL2 team in terms of international competition."]}, {"page": "2010 FIFA World Cup qualification (CONCACAF)", "response": ["* Kwame Steede "]}, {"page": "2010 FIFA World Cup qualification – CONCACAF First Round", "response": ["* Kwame Steede"]}, {"page": "Devonshire Cougars", "response": ["In the 2009–10 season, Devonshire Cougars won their first FA Cup after defeating the Somerset Eagles 2–2.  Cougars found themselves trailing at the interval after conceding two goals in as many minutes just before halftime.  Player/coach Kwame Steede pulled one goal back for the Cougars in normal time and Darius Cox's hopeful punt from the halfway line completed a dramatic injury time comeback.  The match was decided in a penalty shootout, where the Cougars bested the Eagles 5–4.  The Eagles fell behind in the shootout when their second penalty, taken by Damon Swan, was saved by goalkeeper Ricardo Brangman. Damico Coddington converted the fifth and final spot kick to secure Cougars maiden FA Cup final triumph.", "* Kwame Steede (2015–2016)Bascome backing Steede to succeed – Royal Gazette"]}, {"page": "All-time Bermuda Hogges roster", "response": ["*  Kwame Steede"]}, {"page": "2014 FIFA World Cup qualification (CONCACAF)", "response": ["* Kwame Steede"]}, {"page": "2014 FIFA World Cup qualification – CONCACAF Second Round", "response": ["* Kwame Steede"]}, {"page": "Steede", "response": ["*Kwame Steede (born 1980), Bermudian footballer"]}]}}