{"wiki_id": "http://www.wikidata.org/entity/Q930817", "itemLabel": "John Leech", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Leech_(mathematician)", "wikipedia_page": {"main": "John Leech (21 July 1926 in Weybridge, Surrey – 28 September 1992 in Scotland) was a British mathematician working in number theory, geometry and combinatorial group theory. He is best known for his discovery of the Leech lattice in 1965. He also discovered Ta(3) in 1957. Leech was married to Jenifer Haselgrove, a British radio scientist.\n\n", "link_mentions": [{"page": "List of geometers", "response": ["* John Leech (1926–1992)"]}, {"page": "Conway group", "response": [" relates how, in about 1964, John Leech investigated close packings of spheres in Euclidean spaces of large dimension. One of Leech's discoveries was a lattice packing in 24-space, based on what came to be called the Leech lattice Λ. He wondered whether his lattice's symmetry group contained an interesting simple group, but felt he needed the help of someone better acquainted with group theory. He had to do much asking around because the mathematicians were pre-occupied with agendas of their own. John Conway agreed to look at the problem. John G. Thompson said he would be interested if he were given the order of the group. Conway expected to spend months or years on the problem, but found results in just a few sessions."]}, {"page": "Taxicab number", "response": ["The taxicab numbers subsequent to 1729 were found with the help of computers. John Leech obtained Ta(3) in 1957. E. Rosenstiel, J. A. Dardis and C. R. Rosenstiel found Ta(4) in 1989.Numbers Count column, Personal Computer World, page 234, November 1989 J. A. Dardis found Ta(5) in 1994 and it was confirmed by David W. Wilson in 1999.Numbers Count column of Personal Computer World, page 610, Feb 1995\"The Fifth Taxicab Number is 48988659276962496\" by David W. Wilson Ta(6) was announced by Uwe Hollerbach on the NMBRTHRY mailing list on March 9, 2008,NMBRTHRY Archives – March 2008 (#10) \"The sixth taxicab number is 24153319581254312065344\" by Uwe Hollerbach following a 2003 paper by Calude et al. that gave a 99% probability that the number was actually Ta(6).C. S. Calude, E. Calude and M. J. Dinneen: What is the value of Taxicab(6)?, Journal of Universal Computer Science, Vol. 9 (2003), pp. 1196–1203 Upper bounds for Ta(7) to Ta(12) were found by Christian Boyer in 2006.\"'New Upper Bounds for Taxicab and Cabtaxi Numbers\" Christian Boyer, France, 2006–2008"]}, {"page": "Ernst Witt", "response": ["In the 1970s, Witt claimed that in 1940 he had discovered what would eventually be named the \"Leech lattice\" many years before John Leech discovered it in 1965, but Witt did not publish his discovery and the details of exactly what he did are unclear; see his collected works ."]}, {"page": "Square-free word", "response": ["Another example found by John Leech is defined recursively over the alphabet \\{0,1,2\\}.  Let  be any squarefree word starting with the letter . Define the words  \\{w_i \\mid i \\in \\mathbb{N} \\} recursively as follows: the word w_{i+1} is obtained from  by replacing each  in  with , each  with , and each  with .  It is possible to prove that the sequence converges to the infinite squarefree word "]}, {"page": "Richard A. Parker", "response": ["*Conway, J. H.; Sloane, N. J. A. (1999).  Sphere packings, lattices and groups. (3rd ed.)  With additional contributions by E. Bannai, R. E. Borcherds, John Leech,  Simon P. Norton, A. M. Odlyzko, R. A. Parker, L. Queen and B. B. Venkov. Grundlehren der Mathematischen Wissenschaften, 290.  New York: Springer-Verlag.  ."]}, {"page": "John Leech", "response": ["John Leech may refer to:", "* John Leech (jurist) (fl. 1330s), English medieval professor of canon law", "* John Leech (caricaturist) (1817–1864), English caricaturist and illustrator", "* John Leech (mathematician) (1926–1992), British mathematician, discoverer of the Leech Lattice", "* John Leech (DJ) (fl. 1980s–present), English radio presenter", "* John Leech (politician) (born 1971), British Liberal Democrat Councillor in Manchester and former Member of Parliament"]}, {"page": "Jenifer Haselgrove", "response": ["Haselgrove was married to British mathematician C. Brian Haselgrove and published several highly cited, technical articles with him (e.g.,C. B. Haselgrove and Jenifer Haselgrove,  Twisted Ray Paths in the Ionosphere, Proc. Phys. Soc. 75 No 3 (1 March 1960) 357-363.). They are also credited for first  solving the 6×10 Pentomino. Brian Haselgrove died in 1964, and Jenifer remarried to another British mathematician, John Leech, and took his surname. She worked at the University of Glasgow until 1982. She resided in England until her death on 13 March 2015."]}, {"page": "List of people by Erdős number", "response": ["* John Leech"]}, {"page": "II25,1", "response": ["*Conway, J. H.; Sloane, N. J. A. (1999).  Sphere packings, lattices and groups. (3rd ed.)  With additional contributions by E. Bannai, R. E. Borcherds, John Leech,  Simon P. Norton, A. M. Odlyzko, Richard A. Parker, L. Queen and B. B. Venkov. Grundlehren der Mathematischen Wissenschaften, 290.  New York: Springer-Verlag.  ."]}, {"page": "Leech (surname)", "response": ["* William John Leech (1881–1968), Irish painter"]}]}}