{"wiki_id": "http://www.wikidata.org/entity/Q93120", "itemLabel": "Hugh Darwen", "itemDescription": "English academic and writer about computers", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Darwen", "wikipedia_page": {"main": "Hugh Darwen is a computer scientist who was an employee of IBM United Kingdom from 1967 to 2004, and has been involved in the development of the relational model.", "link_mentions": [{"page": "Relational database", "response": ["A second school of thought argues that if a database does not implement all of Codd's rules (or the current understanding on the relational model, as expressed by Christopher J. Date, Hugh Darwen and others), it is not relational. This view, shared by many theorists and other strict adherents to Codd's principles, would disqualify most DBMSs as not relational. For clarification, they often refer to some RDBMSs as truly-relational database management systems (TRDBMS), naming others pseudo-relational database management systems (PRDBMS). "]}, {"page": "Relational model", "response": ["The relational model was invented by Edgar F. Codd as a general model of data, and subsequently promoted by Chris Date and Hugh Darwen among others. In The Third Manifesto (first published in 1995) Date and Darwen attempt to show how the relational model can allegedly accommodate certain \"desired\" object-oriented features."]}, {"page": "SQL", "response": ["* C. J. Date with Hugh Darwen: A Guide to the SQL standard : a users guide to the standard database language SQL, 4th ed., Addison Wesley, USA 1997, "]}, {"page": "Fabian Pascal", "response": ["*Hugh Darwen"]}, {"page": "Christopher J. Date", "response": ["He left IBM in 1983 and has written extensively of the relational model, in association with Hugh Darwen.", "* Databases, Types, and the Relational Model, The Third Manifesto (with Hugh Darwen), 2007, "]}, {"page": "The Third Manifesto", "response": ["The Third Manifesto (1995) is Christopher J. Date's and Hugh Darwen's proposal for future database management systems, a response to two earlier Manifestos with the same purpose. The theme of the manifestos is how to avoid the \"object-relational impedance mismatch\" between object-oriented programming languages and relational database management systems.  The Third Manifesto proposes to maintain the relational model for databases and to support objects as user-defined types."]}, {"page": "Edgar F. Codd", "response": ["* Hugh Darwen"]}, {"page": "Relational algebra", "response": ["In 1998 Chris Date and Hugh Darwen proposed a language called Tutorial D intended for use in teaching relational database theory, and its query language also draws on ISBL's ideas. Rel is an implementation of Tutorial D."]}, {"page": "First normal form", "response": ["Hugh Darwen and Chris Date have suggested that Codd's concept of an \"atomic value\" is ambiguous, and that this ambiguity has led to widespread confusion about how 1NF should be understood.Darwen, Hugh. \"Relation-Valued Attributes; or, Will the Real First Normal Form Please Stand Up?\", in C. J. Date and Hugh Darwen, Relational Database Writings 1989-1991 (Addison-Wesley, 1992). In particular, the notion of a \"value that cannot be decomposed\" is problematic, as it would seem to imply that few, if any, data types are atomic:"]}, {"page": "Dataphor", "response": ["Dataphor does not employ SQL as its primary database language since SQL purportedly violates important principles of the relational model.  Dataphor's D4 language is based on the principles of Christopher J Date's and Hugh Darwen's Tutorial D, but with a Pascal-like imperative syntax.", "Hugh Darwen has referred to D4, as a notable project in his talk entitled The Askew Wall.The Askew Wall Chris Date refers to Dataphor as a product that attempts to implement the Third Manifesto.Chris Date on relational databases Fabian Pascal calls Dataphor \"Truly Relational\",Fabian Pascal states \"Dataphor, a truly relational DBMS\" and \"superior to SQL\"Fabian Pascal on DBMS theory", "D4 was named after the similar-sounding Dataphor, the system that uses the language. It was some time after these names were decided that its creators discovered Tutorial D, and the coincidence it had with that name. Since discovering Tutorial D and The Third Manifesto, the creators have used The Third Manifesto as a guide in making Dataphor and D4. Since then, Hugh Darwen has referred to D4, as a notable project in his talk entitled The Askew Wall."]}, {"page": "Temporal database", "response": ["An attempt was made to incorporate parts of TSQL2 into the new SQL standard SQL:1999, called SQL3. Parts of TSQL2 were included in a new substandard of SQL3, ISO/IEC 9075-7, called SQL/Temporal. The TSQL2 approach was heavily criticized by Chris Date and Hugh Darwen.Hugh Darwen, C.J. Date, “An overview and Analysis of Proposals Based on the TSQL2 Approach”, In Date on Database: Writings 2000-2006, C.J. Date, Apress, 2006, pp. 481-514 The ISO project responsible for temporal support was canceled near the end of 2001.", "* C.J. Date, Hugh Darwen, Nikos Lorentzos (2002). Temporal Data & the Relational Model, First Edition (The Morgan Kaufmann Series in Data Management Systems); Morgan Kaufmann; 1st edition; 422 pages. ."]}, {"page": "Relvar", "response": ["In relational databases, relvar is a term introduced by C. J. Date and Hugh Darwen as an abbreviation for relation variable in their 1995 paper The Third Manifesto, to avoid the confusion sometimes arising from the use of the term relation, by the inventor of the relational model, E. F. Codd, for a variable to which a relation is assigned as well as for the relation itself.  The term is used in Date's well-known database textbook An Introduction to Database Systems and in various other books authored or coauthored by him.", "* C.J. Date and Hugh Darwen. Databases, Types, and The Relational Model: The Third Manifesto (Addison-Wesley, 2007, ), p.85"]}, {"page": "Null (SQL)", "response": ["Chris Date and Hugh Darwen, authors of The Third Manifesto, have suggested that the SQL Null implementation is inherently flawed and should be eliminated altogether,"]}, {"page": "SQL-92", "response": ["Significant new features include:C. J. Date with Hugh Darwen: A Guide to the SQL standard : a users guide to the standard database language SQL, 4th ed., Addison Wesley, USA 1997, "]}, {"page": "D (data language specification)", "response": ["D is a set of prescriptions for what Christopher J. Date and Hugh Darwen believe a relational database management system ought to be like.  It is proposed in their paper The Third Manifesto, first published in 1994 and elaborated on in several books since then.", "* C. J. Date and Hugh Darwen (2007, Addison-Wesley) Databases, Types, and the Relational Model: The Third Manifesto, a third edition superseding first and second editions that are the two books listed below.  "]}, {"page": "Rel (DBMS)", "response": ["Rel is an open-source true relational database management system that implements a significant portion of Chris Date and Hugh Darwen's Tutorial D query language."]}, {"page": "David McGoveran", "response": ["McGoveran's research on E.F. Codd's relational model has focused on the issues of data modeling (database design), missing information, and view updating. The last two are considered by some database researchers to be the most difficult and controversial problems in relational database research.[ Date, C. J. (December 20, 2012). \"View Updating and Relational Theory\". Foreword by Hugh Darwen. p. xv. Sebastopol, CA: O'Reilly Media.  & .]", "McGoveran tackled the problem of view updating with Christopher J. Date starting in 1993 after having developed methods for reversible schema migration for clients on Wall Street.Pascal, F. (April 11, 2015). An Interview with David McGoveran. \"Database Debunkings\".  His solution, based on relation predicates, formed the basis for the algorithms found in The Third Manifesto (Christopher J. Date, Hugh Darwen) for updating virtual relations (e.g., views). Date has credited McGoveran with originally suggesting the basic idea for the view updating approach,Date, C. J. (December 20, 2012). \"View Updating and Relational Theory\". Preface. p. xiv. Sebastopol, CA: O'Reilly Media.  & . and which Hugh Darwen[Date, C. J. (December 20, 2012). \"View Updating and Relational Theory\". Foreword by Hugh Darwen. p. xv. Sebastopol, CA: O'Reilly Media.  & . says represented a major shift in thinking on the issue. This work has resulted in two patents (U.S. Patent 7,620,664 and U.S. Patent 7,263,512)."]}, {"page": "Nikos Lorentzos", "response": ["Nikos Lorentzos is a Greek professor of Informatics. He is a specialist on the Relational Model of Database Management, having made contributions in the field of temporal databases, where he has co-authored a book with Hugh Darwen and Christopher J Date."]}, {"page": "Andrew Warden", "response": ["#REDIRECT Hugh Darwen"]}, {"page": "List of contract bridge people", "response": ["* Hugh Darwen"]}, {"page": "Category talk:Contract bridge writers", "response": ["Which biographies belong in this category? I doubt that it should be everyone who has written a bridge book, or covered bridge for a newspaper, or edited a bridge periodical. The category previously included a couple of all-time great players who wrote next to nothing (Bob Hamman and Jeff Meckstroth). Also people famous in other walks of life who evidently wrote one book (Iain Macleod and Hugh Darwen). So I added some others who wrote little, during my recent Coverage described just below."]}, {"page": "List of University of Warwick people", "response": ["* Hugh Darwen - creator of Tutorial D database language"]}]}}