{"wiki_id": "http://www.wikidata.org/entity/Q9310299", "itemLabel": "Richard Kilty", "itemDescription": "British sprinter", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Kilty", "wikipedia_page": {"main": "Richard Kilty (born 2 September 1989 in Stockton-on-Tees) is a British sprinter who competes in the 60 metres, 100 metres and 200 metres. A noted fast starter, and considered a specialist in both 60 metres and relays, he is a former World and double European Champion indoors at 60 metres, and a silver medalist in both the World Athletics Championships and the Olympic Games as a relay runner.\nA core member of the Great Britain relay squad, Kilty has won medals at every major championship, including global silver medals running legs in the finals of both the World Championships in 2019, and the Olympic Games in 2021. Kilty is one of the few British athletes to have won medals in every major indoor and outdoor championships, including gold in both the Commonwealth Games and the European Athletics Championships as a relay runner, gold in the European and World Indoors as a 60 metre specialist, and medals, again as a relay runner, in the World Athletics World Relays, the World Athletics Championships and the Olympic Games. Making him one of the most decorated & successful British sprinters in history.\nHis personal bests for the three individual events are 6.49 seconds, 10.01 seconds and 20.34 seconds, respectively. Coached for several years by 1992 Olympic 100 m champion Linford Christie, Kilty switched to Rana Reider in late 2013, when the American coach was recruited by UK Athletics. He is the 2014 World, and 2015 and 2017 European Indoor 60m champion. He also gained numerous British national sprint titles, including UK junior 100m champion and two-time English Schools national 100 metres champion, during his years at Northfield School and Sports College. On the British club-level he represents Gateshead Harriers.\nNicknamed  \"The Teesside Tornado\" he was ranked first in Great Britain over 200 m in the U23 age group in 2011, with a time of 20.53 seconds. He won a silver at the 2011 European Athletics U23 Championships with the British 4×100 metres relay team. For the majority of 2011 he was without a coach and not funded, but he achieved personal bests in the 100  and 200 m. Kilty was left off Great Britain's athletics team for the 2012 Summer Olympics in London, despite having met the qualifying standard. He set his 100m personal best of 10.10 (with no wind) in August 2013 at the European Athletics permit meeting in Hexham, UK.", "link_mentions": [{"page": "Stockton-on-Tees", "response": ["* Richard Kilty, sprinter"]}, {"page": "Middlesbrough", "response": ["Tees Valley Mohawks and Teesside Lions basketball teams play in the NBL Division 3. Athletics has two local clubs serving Middlesbrough and the surrounding area, Middlesbrough-and-Cleveland Harriers and Middlesbrough AC (Mandale). Training facilities at the Middlesbrough Sports Village opened in 2015, replacing Clairville Stadium. Notable athletes to train at both facilities are World and European Indoor Sprint Champion Richard Kilty, British Indoor Long Jump record holder Chris Tomlinson and several British Internationals. The sports village includes a running track with grandstand, an indoor gym and café, football pitches, as well as a cycle circuit and velodrome. Next to the sports village is a skateboard park and Middlesbrough Tennis World."]}, {"page": "Šiauliai", "response": ["* Dovilė Dzindzaletaitė, athlete triple jumper, Lithuanian national record holder and former European Under-23 Champion, World Junior silver medalist, wife of British former World Indoor 60 metres champion Richard Kilty."]}, {"page": "Richard", "response": ["* Richard Kilty (born 1989), English sprinter"]}, {"page": "4 × 100 metres relay", "response": ["|Adam Gemili, Zharnel Hughes, Richard Kilty, Nethaneel Mitchell-Blake", "|Adam GemiliZharnel HughesRichard KiltyNethaneel Mitchell-Blake", "|Chijindu UjahZharnel HughesRichard KiltyNethaneel Mitchell-Blake", "|Adam GemiliZharnel HughesRichard KiltyNethaneel Mitchell-Blake"]}, {"page": "List of European records in athletics", "response": ["|Adam GemiliZharnel HughesRichard KiltyNethaneel Mitchell-Blake"]}]}}