{"wiki_id": "http://www.wikidata.org/entity/Q931097", "itemLabel": "Kenneth Hunt", "itemDescription": "English footballer (1884-1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Hunt_(footballer)", "wikipedia_page": {"main": "Reverend Kenneth Reginald Gunnery Hunt (24 February 1884 – 28 April 1949) was an English amateur football player, Oxford Blue, FA Cup Final goal scorer, England cap holder, and Olympic gold medallist, having competed in the 1908 Summer Olympics and in the 1920 Summer Olympics.", "link_mentions": [{"page": "Football at the 1908 Summer Olympics", "response": ["|RH || || Kenneth Hunt ", "|valign=\"top\"| Horace BaileyArthur BerryFrederick ChapmanWalter CorbettHarold HardmanRobert HawkesKenneth HuntHerbert SmithHarold StapleyClyde PurnellVivian Woodward  George BarlowThose players were also in squad, but did not play any matches. Albert Bell Ronald BrebnerW. CrabtreeWalter DaffernThomas PorterAlbert Scothern"]}, {"page": "Pegasus A.F.C.", "response": ["The club was founded in 1948 as a joint venture of Oxford University A.F.C. and Cambridge University A.F.C., instigated by Harold Warris Thompson, professor at St. John's College, Oxford and later an administrator with The Football Association. The founding president was Kenneth Hunt, formerly of the star amateur club Corinthian F.C. The symbol Pegasus was chosen as containing elements from the logos of the football clubs of both Oxford University (a centaur) and Cambridge University (a falcon). At first, members had to be current Oxford or Cambridge University players or to have left the previous year, but this rule was later relaxed. In the postwar years, Oxbridge students included many men in their twenties demobilised from service in World War II.", "*Reverend Kenneth Hunt, founding president"]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["| Men's football ||bgcolor=gold| 1st ||align=left| Horace Bailey, Arthur Berry, Frederick Chapman (captain),  Walter Corbett, Harold Hardman, Robert Hawkes, Kenneth Hunt,  Herbert Smith, Harold Stapley, Clyde Purnell, Vivian Woodward || Won vs.  Sweden  12-1 || Won vs.  Netherlands  4-0 || Won vs.  Denmark  2-0 ||bgcolor=lightgray| Not relegated"]}, {"page": "List of Olympic medalists in football", "response": ["|valign=top| Horace BaileyArthur BerryFrederick ChapmanWalter CorbettHarold HardmanRobert HawkesKenneth HuntHerbert SmithHarold StapleyClyde PurnellVivian Woodward  George BarlowThose players were also in squad, but did not play any matches.Albert BellRonald BrebnerW. CrabtreeWalter DaffernThomas PorterAlbert Scothern"]}, {"page": "Trent College", "response": ["*Reverend Kenneth Hunt, England footballer and Olympic gold medallist"]}, {"page": "1908 FA Cup Final", "response": ["Nevertheless, Wolves upset the odds by winning the match 3–1, with goals by Kenneth Hunt, George Hedley and Billy Harrison. James Howey scored the Magpies' reply. The Lord Mayor of London, Sir John Bell, then handed the trophy to Wolves' Billy Wooldridge.", "Newcastle began the more composed side and launched several early attacks. They had the majority of the possession, but Wolves managed to stand resolute. On the 40-minute mark, a hurried clearance from a scramble in the Newcastle penalty area fell to Kenneth Hunt, who hit the ball back ferociously from distance, which Lawrence in the Magpies' goal could only help into the net. This was the first goal Hunt had ever scored for the club. Wolves grew in confidence with this strike and George Hedley quickly doubled their advantage with swift shot into the far corner after eluding two tackles.", "| || ||Kenneth Hunt"]}, {"page": "Arthur Berry (footballer)", "response": ["He was part of the teams which won the gold medals in the football tournaments in 1908 and 1912. The team was identical to the England national amateur football team, and opinion is divided as to whether it should be referred to as a Great Britain team. In the 1908 tournament he played alongside Kenneth Hunt, who had been his teammate in the 1907 Varsity football match."]}, {"page": "1910–11 British Home Championship", "response": ["|align=left|Kenneth Hunt"]}, {"page": "Ken Hunt", "response": ["*Kenneth Hunt (footballer) (1884–1949), English Olympic footballer", "*Kenneth Hunt (cricketer) (1902–1971), English cricketer"]}, {"page": "List of English people", "response": ["* Kenneth Hunt (1884–1949), footballer"]}, {"page": "1907–08 FA Cup", "response": ["Nevertheless, Wolves upset the odds by winning the match 3–1, with goals by Kenneth Hunt, George Hedley and Billy Harrison. James Howey scored the Magpies' reply. The Lord Mayor of London, Sir John Bell, then handed the trophy to Wolves' captain, Billy Wooldridge."]}, {"page": "Wally Radford", "response": ["In the summer of 1907, Radford returned to Molineux, to rejoin his former club, now starting their second season in the Second Division. Radford made 26 League appearances in the 1907–08 season, scoring nine goals. In the FA Cup, Radford's goals at BuryFA Cup 1907–08 season on IFFHS and Stoke helped Wolves reach the semi-final against his former club, Southampton. In the semi-final, played at Stamford Bridge, Radford and another former Southampton player, George Hedley, scored the goals to put Wolves into the final. In the final, played at Crystal Palace on 25 April 1908, Wolves met Newcastle United. Despite playing a team from the First Division, Wolves upset the odds by winning the match 3–1, with goals by Kenneth Hunt, Hedley and Billy Harrison.FA Cup Giant Killers - 1908"]}, {"page": "List of 1908 Summer Olympics medal winners", "response": ["|valign=top| Horace BaileyArthur BerryFrederick ChapmanWalter CorbettHarold HardmanRobert HawkesKenneth HuntHerbert SmithHarold StapleyClyde PurnellVivian Woodward  George BarlowThose players were also in squad, but did not play any matches.Albert BellRonald BrebnerW. CrabtreeWalter DaffernThomas PorterAlbert Scothern"]}, {"page": "1913 FA Charity Shield", "response": ["There were a number of changes from the teams originally selected. Bromley's Ernest Peacock replaced Oxford City's Kenneth Hunt at centre half for the Amateurs, and the right flank of the Professionals lineup had to be reorganised. Fanny Walden came in on the wing in place of the injured Jock Simpson of Blackburn, and Tom Brittleton's \"indisposition\" gave a chance at right half to Sunderland's Frank Cuggy, who, according to the Daily Express, \"has not so far reproduced in representative games the form he shows in inter-club football.\" An injury to Jesse Pennington, West Bromwich Albion's left back, meant a late call-up for Birmingham's Frank Womack."]}]}}