{"wiki_id": "http://www.wikidata.org/entity/Q93555", "itemLabel": "Ben Davies", "itemDescription": "Welsh footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Davies_(footballer,_born_1993)", "wikipedia_page": {"main": "Benjamin Thomas Davies (born 24 April 1993) is a Welsh professional footballer who plays as a left back for Premier League club Tottenham Hotspur and the Wales national team.\nDavies is an academy graduate of Swansea City, a Welsh club based in Swansea who play in the English football league system, also joining Danish club Viborg FF's academy while his family lived in Denmark. He made his professional debut for Swansea City in the second Premier League game of the 2012–13 season against West Ham United, scoring his first professional goal in a 3–1 Premier League win against Stoke City in January 2013. In the 2013–14 season, Davies was once again a regular for Swansea City.\nIn July 2014, Davies was signed by Tottenham Hotspur for an undisclosed fee, making his debut for Tottenham in a Europa League game against Cypriot side AEL Limassol. He has spent much of his Tottenham career battling with Danny Rose for the starting left-back spot.\nDavies made three appearances for the Welsh national under-19 football team in his youth. His appearances all came as part of qualification for the 2012 UEFA European Under-19 Championship. Davies made his senior Welsh national team debut against Scotland as part of the 2014 FIFA World Cup qualification in 2012. He has since made over 60 senior appearances for Wales, and represented the side at UEFA Euro 2020.", "link_mentions": [{"page": "April 24", "response": ["*1993 – Ben Davies, Welsh international footballer"]}, {"page": "1993", "response": ["* April 24 – Ben Davies, Welsh footballer"]}, {"page": "Neath", "response": ["*Ben Davies (1993– ), Tottenham Hotspur, and Wales footballer;"]}, {"page": "1993 in Wales", "response": ["* 24 April – Ben Davies, footballer"]}, {"page": "Dwight Tiendalli", "response": ["Tiendalli made his Swansea City debut in the third round of the League Cup, providing an assist for Danny Graham in a 3–2 win over Crawley Town. Having been on the bench in the league for two months since joining, as a result of Ben Davies and Àngel Rangel being first choice in the left and right back position respectively (Tiendalli played in both positions), he finally made his league debut on 1 December 2012 against  Arsenal, coming on as a substitute for Jonathan de Guzmán in the 74th minute of a 2–0 win. After the match, Tiendalli stated his intent to stay at Swansea despite his lack of first-team opportunities. From December, he became the club's first choice right-back after Rangel was injured, as well as being rotated in different positions. Tiendalli appeared in the final of the League Cup when he came on for Davies in the 84th minute of a 5–0 win over Bradford City, Swansea becoming the first non-English Premier League team to win the League Cup and the first since 1927 to win a major English cup (Swansea's rivals Cardiff City won the FA Cup in 1927). Manager Michael Laudrup praised Tiendalli for his performance in response to uncertainty over his future. Laudrup, however, said he expected Tiendalli to move on at the end of the season. Tiendalli scored his first goal for the club in a 3–2 away win over Wigan Athletic on 7 May 2013 at the DW Stadium. In his first season at Swansea City, he made twenty-one appearances and scored once in all competitions. At the end of the 2012–13 season, Tiendalli's agent Sebastien Casenaz told talkSPORT that he would not be at Swansea the following season after contract talks had broken down."]}, {"page": "Michel Vorm", "response": ["On 23 July 2014, Vorm announced via Dutch radio that he would sign for Tottenham Hotspur to compete with Hugo Lloris. He signed on a four-year deal costing Spurs £3.5 million after three years at Swansea, joining on the same day as Swansea's Ben Davies made the same move and Gylfi Sigurðsson was exchanged as part of the deal. The transfer was disputed by Utrecht, who complained to FIFA that they were contractually due 30% of the fee received by Swansea. FIFA rejected Utrecht's claim, and the case was heard in the Court of Arbitration for Sport in January 2016."]}, {"page": "Graziano Pellè", "response": ["On 11 April 2015, Pellè scored his first Premier League goal of the year in a 2–0 win over Hull City at St. Mary's Stadium, ending a run of 15 league matches without scoring. Two weeks later, in a 2–2 draw against Tottenham Hotspur, Pellè scored both goals for his team; a strike after overpowering Ben Davies, and a header from a cross by Shane Long."]}, {"page": "UEFA Euro 2016", "response": ["|  Ben Davies"]}, {"page": "Benjamin Davies", "response": ["Benjamin Davies or Ben Davies may refer to:", "* Ben Davies (tenor) (1858–1943), Welsh operatic tenor", "* Ben Davies (1880s footballer), English footballer, Port Vale inside right 1882–1887", "* Ben Davies (footballer, born 1888) (1888–1970), English footballer", "* Ben Davies (1930s footballer), English footballer, Port Vale goalkeeper 1929–1933", "* Ben Davies (footballer, born 1981), English and Grimsby Town footballer", "* Ben Davies (Australian footballer) (born 1986), Australian rules footballer", "* Ben Davies (footballer, born 1993), Wales international footballer", "* Ben Davies (footballer, born 1995), English footballer", "* Ben Davies (rugby union) (1873–1930), Wales international rugby player", "* Ben Davies (rugby league, born 1989) (born 1989), Welsh rugby league footballer", "*Ben Davies (rugby league, born 2000) (born 2000), English rugby league footballer", "* Ben Davies (darts player) (born 1980), English darts player", "* Ben Davies (ice hockey) (born 1991), Welsh ice hockey player", "* Ben Davies, pool player, 2005 EUKPF World Champion, 2018 IPA World Champion", "* Ben Davies (Independent minister and author) (1840–1930), Welsh Independent minister and author", "* Ben Davies (poet) (1864–1937), Welsh poet and Independent minister", "* Ben Davies (Hollyoaks), a character in Hollyoaks"]}, {"page": "Marek Hamšík", "response": ["Hamšík also played a key role in helping his nation qualify for Euro 2016 for the first time in the nation's history, finishing as Slovakia's top scorer as Slovakia placed second in its qualifying group behind defending champions Spain. Slovakia suffered a closely contested 2–1 defeat to Wales in its opening match of the competition on 11 June. Hamšík came close to opening the scoring in the third minute of play after dribbling past several Welsh defenders, but his strike was denied by Ben Davies' goal-line clearance. In Slovakia's second group B match of the tournament, against Russia on 15 June 2016, Hamšík set up a goal and later scored another himself in a 2–1 win, his nation's first in the competition. Following a 0–0 draw against England on 20 June, Slovakia advanced to the second round as the best third-placed team of the tournament. However, Slovakia was eliminated in the round of 16 on 26 June after a 3–0 defeat to reigning world champions Germany."]}, {"page": "Àngel Rangel", "response": ["On 5 April 2013, Rangel announced plans to hold charity auctions with his wife and teammates Chico Flores, Ben Davies, Jonathan de Guzmán, Pablo Hernández, Michu and Itay Shechter, to raise money for the Severn Hospice in Telford, Maggie's Cancer Centre in Swansea and The Christian Lewis Trust Kids Cancer Charity; among the top prizes on offer at one of the auctions were Rangel's personal box for the game against Manchester City, and a visit to a Formula One garage during qualifying of the German Grand Prix. He was inspired to do this by Nikki, who has had three family members diagnosed with cancer."]}, {"page": "Neil Taylor (footballer)", "response": ["In late February, Taylor returned to full training after six months out with injury. Shortly before his return, Swansea City won the League Cup Final following a 5–0 win over League Two side Bradford City. In late April, he played 80 minutes for Swansea City U21s as part of his rehabilitation. Taylor made his first senior appearance since his injury as a substitute for Ben Davies in a 2–0 loss against Chelsea on 28 April 2013. After the match, he expressed relief at his return to the first team."]}, {"page": "List of Adidas sponsorships", "response": ["*  Ben Davies"]}, {"page": "FK Viborg", "response": ["* Ben Davies"]}, {"page": "Gylfi Sigurðsson", "response": ["Gylfi began his professional career with Reading in the Championship and in 2010, was sold to 1899 Hoffenheim, which was Reading's biggest sale at the time. He was voted Player of the Season for two consecutive seasons: for Reading in 2009–10 and for Hoffenheim in 2010–11. After a season back in English football with Swansea City, he joined Tottenham Hotspur for a reported £8 million transfer fee. In 2014, he moved back to Swansea as part of an exchange for Ben Davies. In 2017 he transferred to Everton, where he remains.", "In July 2014, Tottenham announced a deal had been reached with Swansea City for Gylfi to re-join his former club, with Swansea left-back Ben Davies joining Spurs. On the move, Gylfi said, \"I really enjoyed my time here last time. I know the club, I know the manager, I know the players and I obviously know the fans and the city as well, so that wasn't that difficult for me.\" In the opening match of the 2014–15 season, he set up the opener and scored the winning goal as Swansea defeated Manchester United 2–1 at Old Trafford, making this the first time the Red Devils have lost their opening home game since 1972. Gylfi continued his good start to his Swansea return with another three assists in his next two matches. In a home match against Arsenal on 9 November 2014, Gylfi curled a free-kick over the wall and into the corner of the net from 25 yards to equalise in an eventual 2–1 win. Gylfi scored in a 4–1 away defeat against Liverpool at Anfield on 29 December."]}, {"page": "Danny Rose (footballer, born 1990)", "response": ["Towards the end of the season after six away matches without a win Rose scored the only goal of the match with a header in the 33rd minute against Stoke City to earn Tottenham three points. On 31 July 2014, Rose signed a five-year contract with Tottenham. In the 2014 summer transfer window Tottenham signed Ben Davies which would be competition in the left-back role as well as providing cover if Rose got injured."]}, {"page": "List of Wales national football team World Cup and European Championship squads", "response": ["|4 ||DF||Ben Davies||||20||0|| Tottenham Hotspur||"]}]}}