{"wiki_id": "http://www.wikidata.org/entity/Q93535", "itemLabel": "Princess Michael of Kent", "itemDescription": "wife of Prince Michael of Kent", "wikipedia_url": "https://en.wikipedia.org/wiki/Princess_Michael_of_Kent", "wikipedia_page": {"main": "Princess Michael of Kent (born Baroness Marie-Christine Anna Agnes Hedwig Ida von Reibnitz, 15 January 1945) is a member of the British royal family of German, Austrian, and Hungarian descent. She is married to Prince Michael of Kent, a grandson of George V. Princess Michael was an interior designer before becoming an author; she has written several books on European royalty. She carries out  lecture tours and supports her husband in his public duties.", "link_mentions": [{"page": "Eric Clapton", "response": ["Presented the Silver Clef Award from Princess Michael of Kent for outstanding contribution to British music.Michael Schumacher, Crossroads: The Life and Music of Eric Clapton. Consulted on 12 August 2007."]}, {"page": "January 15", "response": ["*  1945   – Princess Michael of Kent"]}, {"page": "Maria Feodorovna (Dagmar of Denmark)", "response": ["In 2005, Queen Margrethe II of Denmark and President Vladimir Putin of Russia and their respective governments agreed that the Empress's remains should be returned to St. Petersburg in accordance with her wish to be interred next to her husband. A number of ceremonies took place from 23 to 28 September 2006. The funeral service, attended by high dignitaries, including the Crown Prince and Crown Princess of Denmark and Prince and Princess Michael of Kent, did not pass without some turbulence. The crowd around the coffin was so great that a young Danish diplomat fell into the grave before the coffin was interred. On 26 September 2006, a statue of Maria Feodorovna was unveiled near her favourite Cottage Palace in Peterhof. Following a service at Saint Isaac's Cathedral, she was interred next to her husband Alexander III in the Peter and Paul Cathedral on 28 September 2006, 140 years after her first arrival in Russia and almost 78 years after her death."]}, {"page": "1945", "response": ["** Princess Michael of Kent, German-born member of the British Royal Family"]}, {"page": "British royal family", "response": ["*Other members of the royal family with royal rank who do not carry out official duties are Prince Andrew, Duke of York; Prince Harry, Duke of Sussex; Meghan, Duchess of Sussex; Princess Beatrice; Princess Eugenie; Katharine, Duchess of Kent; and Prince and Princess Michael of Kent.", "Prince and Princess Michael of Kent.jpg|Prince and Princess Michael of Kent", "Per tradition, wives of male members of the royal family share their husbands' title and style. Princesses by marriage do not have the title prefixed to their own name but to their husband's; for example, the wife of Prince Michael of Kent is Princess Michael of Kent. Sons of monarchs are customarily given dukedoms upon marriage, and these peerage titles pass to their eldest sons."]}, {"page": "Diane de Poitiers", "response": ["* The Serpent and the Moon, by Princess Michael of Kent (remote descendant of Diane de Poitiers)"]}, {"page": "Simon Callow", "response": ["In July 2006, the London Oratory School Schola announced Callow as one of their new patrons. In November 2007, he threatened to resign the post over controversy surrounding the Terrence Higgins Trust (an AIDS charity of which Callow is also a patron). Other patrons of the Catholic choir are Princess Michael of Kent and the leading Scottish composer James MacMillan. He reprised his role as Wolfgang in Shoebox Zoo and voice-acted the wild and action-seeking Hunter, as well."]}, {"page": "Desert Island Discs", "response": ["Guests also choose one luxury, which must be inanimate and of no use in escaping the island or allowing communication from outside. Roy Plomley enforced these rules strictly. He did, however, grant a special dispensation to Princess Michael of Kent, who chose her pet cat. The rules are, however, less strictly enforced today; for instance, Lawley allowed John Cleese to take Michael Palin with him, on the condition that he was dead and stuffed. Examples of luxuries have included champagne and a piano, the latter of which is one of the most requested luxuries."]}, {"page": "List of coats of arms", "response": ["**Coat of arms of the Princess Michael of Kent"]}, {"page": "Spitting Image", "response": ["Other members who were parodied include: the sex-obsessed Prince Andrew, the envious and heavily freckled Sarah, Duchess of York, the grumpy Princess Anne, the poorly informed Prince Edward, the Panzer-driving Princess Michael of Kent, and the always tipsy Princess Margaret."]}, {"page": "Royal coat of arms of the United Kingdom", "response": ["| style=\"text-align:center;\"|Princess Michael of Kent"]}, {"page": "Prince Michael of Kent", "response": ["Prince Michael has represented the Queen at state funerals in India, Cyprus and Swaziland and, with his wife, Princess Michael of Kent, represented the Queen at the independence celebrations in Belize, and at the coronation of King Mswati III of Swaziland.", "Prince and Princess Michael of Kent have two children, both of whom were brought up as members of the Church of England, and have therefore been in the line of succession to the throne since birth:", "In 2002, both Prince and Princess Michael of Kent were the subject of criticism over the rent paid on their accommodation at Kensington Palace following scrutiny by the House of Commons Public Accounts committee on the cost of royal palaces and whether they were value for money. The committee had called on the Queen to evict its residents and put the apartments on a more commercial footing. When it was claimed that the couple paid a rent of only £69 per week for the use of their apartments at Kensington Palace, Buckingham Palace announced that \"The Queen is paying the rent for Prince and Princess Michael of Kent's apartment at a commercial rate of £120,000 annually, from her own private funds. This rent payment by The Queen is in recognition of the Royal engagements and work for various charities which Prince and Princess Michael of Kent have undertaken at their own expense, and without any public funding.\" Related to Evening Standard, 10 March 2005; The Times, 9 May 2005.", "*Prince and Princess Michael of Kent at the Royal Family website"]}, {"page": "Karlovy Vary", "response": ["*Princess Michael of Kent (born 1945), member of the British royal family"]}, {"page": "Keswick, Cumbria", "response": ["Annual events in the town's calendar include the Keswick Film Festival (February–March). It features screenings of old and new films, interviews with directors, and the festival's Osprey Awards for short films by local filmmakers.\"Young filmmakers impress at Keswick Film Festival\"  , The Cumberland News, 21 February 2013; and \"Keswick Film Festival\" , Keswick Film Club, retrieved 25 June 2014 The ten-day Words by the Water literary festival is held in March every year, based at the Theatre by the Lake. The festival began in 1995, and events have been presented by Melvyn Bragg, Louis de Bernières, Germaine Greer, Steve Jones, Penelope Lively, Princess Michael of Kent, Michael Rosen and Joanna Trollope.\"Keswick book festival wins national award\"  , The Cumberland News, 4 February 2005; \"Words by the water in Keswick presents heavy-hitting literary line-up\"  ,The Cumberland News, 28 February 2013; \"Words by the Water festival's Bragging rights\"  , The Cumberland News, 7 March 2014; and Events Calendar , Words by the Water, retrieved 25 June 2014"]}, {"page": "Forms of address in the United Kingdom", "response": ["|Sovereign's son's son's wife(unless a peeress)||HRH Princess John of London, e.g. HRH Princess Michael of Kent"]}]}}