{"wiki_id": "http://www.wikidata.org/entity/Q936414", "itemLabel": "Kenneth Erskine", "itemDescription": "British serial killer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Erskine", "wikipedia_page": {"main": "Kenneth Erskine (born 1 July 1963) is a British serial killer who became known as The Stockwell Strangler. He committed the murders of 7–11 senior citizens in London between April and July 1986.", "link_mentions": [{"page": "Stockwell", "response": ["In 1986, Kenneth Erskine, a serial killer dubbed the 'Stockwell Strangler', killed seven elderly victims, three of whom were from Stockwell."]}, {"page": "Elder abuse", "response": ["* Kenneth Erskine"]}, {"page": "Broadmoor Hospital", "response": ["*Kenneth Erskine, serial killer"]}, {"page": "List of serial killers by country", "response": ["*Kenneth Erskine: known as \"The Stockwell Strangler\"; sentenced to life imprisonment in 1988 for murdering seven pensioners."]}, {"page": "Gerontophilia", "response": ["* Kenneth Erskine"]}, {"page": "List of serial killers by number of victims", "response": ["| Kenneth Erskine"]}, {"page": "Stockwell Strangler", "response": ["#REDIRECT Kenneth Erskine"]}, {"page": "Murder of Keith Blakelock", "response": ["Detective Chief Superintendent Graham Melvin of the Serious Crime Squad was placed in charge of the investigation a few hours after the killing, at 2:00 am on 7 October. With 150 officers assigned full-time, the inquiry became the largest in the history of the Metropolitan Police. Born in Halifax in 1941, Melvin had joined the Metropolitan Police in 1960, then the Criminal Investigation Department. He had studied at Bramshill Police College, served with the Flying Squad, and was known for having solved several notorious cases, including that of Kenneth Erskine, the Stockwell Strangler. He became a detective chief superintendent in March 1985, when he joined the elite International and Organised Crime Squad (SO1).Victor, Peter (31 July 1994). \"Silcott officer will return in triumph\", The Independent on Sunday."]}, {"page": "1963 in the United Kingdom", "response": ["** Kenneth Erskine, serial killer"]}, {"page": "Infamous Murders", "response": ["Some killers choose their victims by type: John Wayne Gacy, Gary Heidnik, Kenneth Erskine."]}, {"page": "History of the Metropolitan Police", "response": ["Metropolitan Police officers worked with the British Transport Police and neighbouring forces to arrest and convict John Duffy and David Mulcahy, for 18 rapes of women and young girls at or near railway stations in London and South East England and murdering three of their victims between 1982 and 1986. In 1986 Met officers also secured the conviction of Kenneth Erskine for a series of attacks in Stockwell on elderly men and women, breaking into their homes and strangling them to death. In March 1987 private investigator Daniel Morgan was murdered in Sydenham (south east London), in March 1987. He was said to have been close to exposing police corruption, or involved with Maltese drug dealers. Morgan's death has been the subject of several failed police inquiries, and in 2011 it was at the centre of allegations concerning the suspect conduct of journalists with the British tabloid News of the World. This unsolved murder has been described as a reminder of the culture of corruption and unaccountability within the Metropolitan Police Service. An independent enquiry in 2021 concluded that the Metropolitan Police were \"institutionally corrupt\" in its handling of the investigation into the murder of Daniel Morgan and that the force had placed protecting its reputation above the investigation."]}, {"page": "Erskine (surname)", "response": ["*Kenneth Erskine (born 1963), British serial killer known as the \"Stockwell Strangler\" who murdered seven elderly people in and around London during a three-month period in 1986"]}, {"page": "Kenneth erskine", "response": ["#REDIRECT Kenneth Erskine "]}, {"page": "Eight Bells, Fulham", "response": ["In 1986, Kenneth Erskine, the Hammersmith-born serial killer known as the Stockwell Strangler, raped and strangled his final victim, Florence Tisdall, an 83-year-old widow around the corner in Ranelagh Gardens Mansions, but any cries for help would have been drowned out by a disco at the Eight Bells to celebrate the wedding of Prince Andrew and Sarah Ferguson."]}, {"page": "List of nicknames of serial killers", "response": ["* \"Stockwell Strangler\" – Kenneth Erskine"]}]}}