{"wiki_id": "http://www.wikidata.org/entity/Q93666", "itemLabel": "James Tavernier", "itemDescription": "English football player (born 1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Tavernier", "wikipedia_page": {"main": "James Henry Tavernier (born 31 October 1991) is an English professional footballer who plays as a right-back for Scottish Premiership club Rangers, where he is club captain.After starting at the Leeds United Academy, he began his professional career at Newcastle United, spending most of his tenure on loans at six lower level clubs, including winning the League One playoffs with Rotherham United. In 2014, he signed for Wigan Athletic, where by his own admission, he struggled. He spent the second half of his only Wigan season on loan at Bristol City, playing more consistently as they won League One.\nTavernier signed for then-Scottish Championship side Rangers in 2015, winning a double in his first season. He scored the goal that won Rangers the Championship, and was man of the match as they won the Scottish Challenge Cup scoring a long-range volley in the cup final. At the beginning of the 2018–19 season, Tavernier was named as the club captain.\n\n", "link_mentions": [{"page": "Rangers F.C.", "response": ["| James Tavernier || 2018–"]}, {"page": "Milton Keynes Dons F.C.", "response": ["Notable players loaned from other clubs were strikers Patrick Bamford, who scored 18 goals in 37 games, Benik Afobe, who became the league's top scorer in just six months, and Ángelo Balanta, whose loan spell lasted three years. Former Ireland international Clinton Morrison and former Premiership players Paul Rachubka and James Tavernier also had short loan spells with the club."]}, {"page": "Frank Simek", "response": ["Simek signed for Carlisle United on a 2-year contract and joined the squad on 1 July 2010. Since then he has been an ever-present in the United team, apart from the start of the 2011–12 season in which he suffered an injury that left him out of action for 5 months. Replacements such as James Tavernier and Christian Ribeiro filled the Right-Back position in Simek's absence but upon his recovery he instantly earned his place in the Carlisle team yet again.  In July 2012, Simek signed a new one-year deal with Carlisle United, keeping him at the club until the summer of 2013."]}, {"page": "Lee Wallace", "response": ["Wallace returned to the Rangers squad for pre-season activities in June 2018. New manager Steven Gerrard said that he hoped the dispute would be resolved, and that Wallace would fully recover from his long-term injury. At the outset of the campaign, he was replaced as club captain by James Tavernier. In early September, he was not included in the Rangers squad for the 2018–19 UEFA Europa League group stage; two days later, it was announced that he and Kenny Miller had won an appeal at a SPFL tribunal against the disciplinary action taken against them five months earlier, with the expectation they would make a financial claim against the club for the fines imposed. He would go on to make three substitute appearances in the 2018–19 season, getting a great reception from the Rangers supporters."]}, {"page": "List of Rangers F.C. seasons", "response": ["|James Tavernier"]}, {"page": "List of Rangers F.C. players", "response": ["Since the club's formation in 1872, over thirty players have permanently held the position of club captain for Rangers. The first was Tom Vallance, from 1876 to 1882. The longest-serving captain is John Greig, who held the role from 1965 until his retirement in 1978. The current club captain is James Tavernier, who took over from Lee Wallace in 2018."]}]}}