{"wiki_id": "http://www.wikidata.org/entity/Q937729", "itemLabel": "John Burningham", "itemDescription": "British children's illustrator and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Burningham", "wikipedia_page": {"main": "John Burningham (27 April 1936 – 4 January 2019) was an English author and illustrator of children's books, especially picture books for young children. He lived in north London with his wife Helen Oxenbury, another illustrator. His last published work was a husband-and-wife collaboration, There's Going to Be a New Baby (Walker Books, September 2011), written by John and illustrated by Helen for \"ages 2+\".Burningham won the 1963 and 1970 Kate Greenaway Medals for British children's book illustration. The first was for his debut as illustrator (and author), Borka: The Adventures of a Goose with No Feathers, named one of the top ten winning works for the 50th anniversary of the Medal (1955–2005). His second Greenaway Medal winner, Mr Gumpy's Outing (1970), is his work most widely held in WorldCat participating libraries, and it also won the annual Boston Globe–Horn Book Award (US) in the picture books category.For his lasting contribution as a children's illustrator, Burningham was one of five or six finalists in 2012 and in 2014 for the biennial, international Hans Christian Andersen Award, the highest recognition available to creators of children's books. He was the UK's national nominee in 1980 and 1986.", "link_mentions": [{"page": "Chitty-Chitty-Bang-Bang", "response": ["Chitty-Chitty-Bang-Bang: The Magical Car is a children's novel written by Ian Fleming for his son Caspar, with illustrations by John Burningham. It was initially published in three volumes, the first of which was released on 22 October 1964 by Jonathan Cape in London.", "In May 1961, Fleming sent his publisher the manuscripts for the first two volumes of Chitty-Chitty-Bang-Bang. To illustrate the book, Fleming suggested the Daily Mail cartoonist Trog—the pseudonym of Wally Fawkes—as he admired the artist's work. While undertaking the preliminary drawings for the book, Trog tried to make the fudge recipe included in the book and found it was not particularly good: the editors at Jonathan Cape spent a day making up batches from different recipes to find a better one to use. Although Fawkes completed preliminary drawings for the project, the Daily Mail refused to allow him to complete the work as many of Fleming's works were serialised in its rival, the Daily Express. Other early illustrative sketches were produced by artist Haro Hodson and motor engineer Amherst Villiers. After Trog was forced to withdraw from the project, Cape commissioned John Burningham, who had recently won the 1963 Kate Greenaway Medal for his book Borka: The Adventures of a Goose with No Feathers."]}, {"page": "List of years in literature", "response": ["*2019 in literature – Michel Houellebecq's Serotonin; Bernardine Evaristo's Girl, Woman, Other; Death of John Burningham, Judith Kerr"]}, {"page": "1970 in literature", "response": ["*John Burningham – Mr Gumpy's Outing"]}, {"page": "Summerhill School", "response": ["* John Burningham, children's author and illustrator"]}, {"page": "Paul Biegel", "response": ["Among the 35 books Paul Biegel translated into Dutch are The Borrowers series by Mary Norton, three books by Michael Foreman, two by John Burningham, three by Tony Ross, and four by Kaye Umansky."]}, {"page": "Nestlé Smarties Book Prize", "response": ["::* 0–5 years: Husherbye by John Burningham (Jonathan Cape)"]}, {"page": "Kate Greenaway Medal", "response": [" | 1970 || John Burningham || Mr Gumpy's Outing || —", " | 1963 *|| John Burningham || Borka: The Adventures of a Goose With No Feathers || — ", "Only one illustrator, Chris Riddell, has won three Greenaway Medals. Fourteen other illustrators have won two of the 64 Greenaway Medals awarded through 2021. The first winner of two Medals was John Burningham, 1963 and 1970. The most recent is Sydney Smith in 2018 and 2021.", "* John Burningham, Borka: The Adventures of a Goose With No Feathers (Jonathan Cape, 1963)", "1963 John Burningham, Borka: The Adventures of a Goose With No Feathers (Jonathan Cape) @", "1970 John Burningham, Mr Gumpy's Outing (Jonathan Cape) @"]}, {"page": "Charles Keeping", "response": ["From the later 1960s Keeping, alongside illustrators like Brian Wildsmith and John Burningham, took advantage of advances in printing technology to move from black and white work to adventurous colour techniques.Michele Anstey and Geoff Bull, \"The picture book: modern and postmodern\", in Peter Hunt (ed.), International Companion Encyclopedia of Children's Literature, Routledge, 2004, p. 332. In 1966 he created his first full-colour picture books, Black Dolly and Sean and the Carthorse, both about mistreated working horses. He followed these with Charley, Charlotte and the Golden Canary, a modern fairy tale about two children who grow up in the same street, are separated when one family moves to a new tower block, and are reunited thanks to a pet canary, which depicts the gradual disappearance of the London of Keeping's childhood, a theme he would persistently revisit. The full-colour illustrations are messy and spontaneous, using intense colour, sponge texturing and wax resist, and won Keeping his first Greenaway Medal. Kirkus Reviews concluded a very short review, \"Intense colors in striking combinations overwhelm the minimal story.\""]}, {"page": "Boston Globe–Horn Book Award", "response": ["| John Burningham", "| John Burningham"]}, {"page": "Deutscher Jugendliteraturpreis", "response": ["* Picture book: Was ist dir lieber ... (Would you rather?) by John Burningham, "]}, {"page": "List of children's books made into feature films", "response": ["| Granpa (1984), John Burningham"]}, {"page": "Granpa", "response": ["Granpa is a British family-oriented animated film that adapts a picture book by John Burningham. Produced by TVS for Channel 4 Television in 1989, it was released on VHS by Universal Studios in 1994.Granpa, VHS, Universal Studios, released 12 September 1994. Retail product display. Amazon.com.", "The animated film is an adaptation of the children's picture book Granpa, written and illustrated by John Burningham and published by Jonathan Cape in 1984. Burningham won the Kurt Maschler Award, or \"the Emil\", from Maschler publishers and BookTrust, which annually recognised the author(s) of one \"work of imagination for children, in which text and illustration are integrated so that each enhances and balances the other.\"\"Kurt Maschler Awards\". Book Awards. bizland.com. Retrieved 2013-10-06."]}, {"page": "Kurt Maschler Award", "response": ["| 1984\t|| John Burningham || Burningham || Granpa || J. Cape "]}, {"page": "Borka: The Adventures of a Goose with No Feathers", "response": ["Borka: The Adventures of a Goose With No Feathers is a children's picture book written and illustrated by John Burningham and published by Jonathan Cape in 1963. It features a goose born without feathers, whose mother knits a jersey that helps in some ways. ", "* \"John Burningham  – a life in pictures\", a 13-picture gallery, The Guardian 21 March 2011 — includes two pages from Borka"]}, {"page": "Mr Gumpy's Outing", "response": ["Mr Gumpy's Outing is a children's picture book written and illustrated by John Burningham and published by Jonathan Cape in 1970. According to library catalogue summaries, \"All the animals went for a boat ride with Mr Gumpy. Then the boat got too heavy ...\"; \"Mr Gumpy accepts more and more riders on his boat until the inevitable occurs.\" Burningham won the annual Kate Greenaway Medal from the Library Association, recognising the year's best children's book illustration by a British subject, and the Boston Globe–Horn Book Award, a similar award by a magazine for a picture books published in the U.S.", "* \"John Burningham  – a life in pictures\", a 13-picture gallery, The Guardian 21 March 2011 —includes two pages from Mr Gumpy"]}, {"page": "Dianne Jackson", "response": ["She also directed Granpa by John Burningham in 1989 and was due to direct Raymond Briggs' Father Christmas in 1991, having completed storyboarding for the film, although due to her illness this was directed by Dave Unwin. She also planned the first series of animated adaptations of the tales of Beatrix Potter as The World of Peter Rabbit and Friends. However, she died of cancer on New Year's Eve 1992 at the age of 51. The series episode \"The Tailor of Gloucester\", which was made the year after she died, is \"dedicated to [her] memory\"."]}, {"page": "Helen Oxenbury", "response": ["Helen Oxenbury was raised in Ipswich, Suffolk. Her father was an architect. From an early age she developed a passion for drawing. After leaving school, she attended the Ipswich School of Art as a teenager, and during holidays she worked at a small theatre in Felixstowe and at the Ipswich Repertory Theatre Workshop, mixing paints.Interview with Helen Oxenbury at BooksforKeeps . She went on to study in London at the Central School of Art and Design (1957-1959), where she met her future husband, John Burningham.", "After marrying the children's book author and illustrator John Burningham in 1964, she turned to illustrating children’s books herself. In 1980, she created a series of books about a mischievous young boy called Tom, and his stuffed monkey, Pippo. She commented that Tom was very much like her own son in his younger years. Like Tom, her son would often blame his misdeeds on an accomplice (the family dog).Oxenbury's 'Tom and Pippo' book range. LibraryPoint.org. She continues to illustrate books. In 1994, Tom and Pippo was adapted into a French animated series which ran for 104 two-minute episodes. Some of her most recent work includes the illustrations for The Growing Story in the September 2008 edition of Bayard Presse's StoryBox magazine.", "*  There's Going to Be a Baby (2010), by John Burningham"]}, {"page": "1989 in British television", "response": ["**Animated television special Granpa based on a book by veteran English children's author and illustrator John Burningham and produced by John Coates and directed by Dianne Jackson best for working on the British animated Christmas special The Snowman is shown on Channel 4 at 6:30pm."]}, {"page": "Ehrhardt (typeface)", "response": ["Notable books set in Ehrhardt include the Oxford World's Classics series, the New English Bible, the Pelican Shakespeare, the Penguin 60s and Hugh Williamson's textbook Methods of Book Design. It has also been used by Faber and Faber and The Iconic magazine. An extremely rare infant variant of the typeface also exists, which can be seen in the American edition of the book Hey! Get off Our Train by John Burningham."]}, {"page": "List of alumni of the Central School of Art and Design", "response": ["* John Burningham"]}, {"page": "Gerald Kelley", "response": ["Kelley was born in Texas and later moved to Florida. He earned a degree in studio art. As an illustrator, he is mostly self-taught, receiving his education from another artist. He regards Albert Uderzo, Peter de Seve, Rien Poortvliet, Jon J. Muth, John Pike, Victor Ambrus, Lisbeth Zwerger, Brian Wildsmith and John Burningham as his artistic influences, as well as television cartoons and animated movies."]}, {"page": "Burningham", "response": ["*John Burningham (1936–2019), English writer and illustrator"]}, {"page": "2019 in the United Kingdom", "response": ["**John Burningham, 82, English author and illustrator, pneumonia."]}, {"page": "Deaths in January 2019", "response": ["*John Burningham, 82, English author and illustrator, pneumonia.John Burningham, children's author and illustrator, dies aged 82"]}, {"page": "2019 in literature", "response": ["*January 4 – John Burningham, English writer of children's literature (Mr Gumpy's Outing, Borka: The Adventures of a Goose with No Feathers), 82 (born 1936)"]}]}}