{"wiki_id": "http://www.wikidata.org/entity/Q938919", "itemLabel": "Richard Thomas Lowe", "itemDescription": "British botanist, ichthyologist, malacologist and cleric (1802-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Thomas_Lowe", "wikipedia_page": {"main": "Richard Thomas Lowe (1802–1874) was an English scientist, a botanist, ichthyologist, malacologist, and a clergyman. In 1825 he graduated from Christ's College, Cambridge, and in the same year he took holy orders. In 1832 he became a clergyman in the Madeira Islands, where he was also a part-time naturalist, extensively studying the local flora and fauna. He wrote a book on the Madeiran flora. He died in 1874 when the ship he was on was wrecked off the Scilly Isles.\n\n", "link_mentions": [{"page": "List of biologists", "response": ["*Percy Lowe (1870–1948), English ornithologistAbbreviation in zoology: Lowe (also used for Richard Thomas Lowe) who worked on fossil ostriches in China"]}, {"page": "John Stevens Henslow", "response": ["Besides Darwin, other famous students of Henslow included Miles Joseph Berkeley, Cardale Babington, Leonard Jenyns,Dictionary of National Biography, 1901 supplement, \"Jenyns, Leonard\" Richard Thomas Lowe and William Hallowes Miller."]}, {"page": "List of malacologists", "response": ["*Richard Thomas Lowe (1802–1874) United Kingdom"]}, {"page": "List of authors of names published under the ICZN", "response": ["* Lowe – Richard Thomas Lowe (1802–1874)"]}, {"page": "Thomas Vernon Wollaston", "response": ["In 1857 Wollaston returned to the North Atlantic islands, investigating the natural history of the Canary Islands – with Richard Thomas Lowe and John Edward Gray in 1858, returning with Lowe alone in 1859. After a long and rather mysterious absence he returned to the islands in 1866, this time to Cape Verde Islands with Lowe and Gray. Wollaston was a frequent correspondent with the geologist Charles Lyell and their letters are in the Centre for Research Collections, Edinburgh University Library. Wollaston was also a friendly correspondent with Charles Darwin until 1860. His last trip was to St. Helena with his wife, and Gray."]}, {"page": "Bigeye thresher", "response": ["British biologist Richard Thomas Lowe was the first to scientifically describe the bigeye thresher, in papers published in Proceedings of the Royal Society of London (1840) and Transactions of the Zoological Society of London (1849, sometimes given as 1839). He based his description on a specimen caught off Madeira in the eastern Atlantic Ocean. However, Lowe's description was subsequently overlooked by researchers and this species was known by different names until the 1940s, when new specimens from Cuba and Florida prompted its original scientific name to be resurrected. The specific epithet superciliosus is from the Latin super meaning \"above\", and ciliosus meaning \"eyebrow\", referring to the distinct lateral grooves above the eyes.Jensen, C. Bigeye Thresher. Florida Museum of Natural History. Retrieved December 21, 2008.", "Category:Taxa named by Richard Thomas Lowe"]}, {"page": "Dryopteris affinis", "response": ["Category:Taxa named by Richard Thomas Lowe"]}, {"page": "Smooth lanternshark", "response": ["The first scientific description of the smooth lanternshark, as Acanthidium pusillum, was published by British biologist Richard Thomas Lowe, in an 1839 issue of the scientific journal Transactions of the Zoological Society of London. This species was later moved to the genus Etmopterus. The specific epithet pusillus means \"weak\" in Latin. The smooth lanternshark forms a species group with the blurred lanternshark (E. bigelowi); these two species are distinguished from other lantern sharks by their irregularly arranged, truncated (ending in a flat crown as though the tip were cut off) dermal denticles."]}]}}