{"wiki_id": "http://www.wikidata.org/entity/Q938904", "itemLabel": "Grant Gee", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Grant_Gee", "wikipedia_page": {"main": "Grant Robert Gee (born 24 October 1964) is a British film maker, photographer and cinematographer. He is most noted for his 1998 documentary Meeting People Is Easy about the British alternative rock group Radiohead.", "link_mentions": [{"page": "Joy Division", "response": ["Joy Division have been dramatised in two biopics. 24 Hour Party People (2002) is a fictionalised account of Factory Records in which members of the band appear as supporting characters. Tony Wilson said of the film, \"It's all true, it's all not true. It's not a fucking documentary,\" and that he favoured the \"myth\" over the truth. The 2007 film Control, directed by Anton Corbijn, is a biography of Ian Curtis (portrayed by Sam Riley) that uses Deborah Curtis's biography of her late husband, Touching from a Distance (1995), as its basis. Control had its international premiere on the opening night of Director's Fortnight at the 2007 Cannes Film Festival, where it was critically well received. That year Grant Gee directed the band documentary Joy Division."]}, {"page": "October 24", "response": ["*  1964   – Grant Gee, English film maker, photographer, cinematographer"]}, {"page": "Radiohead", "response": ["OK Computer was followed by the year-long Against Demons world tour, including Radiohead's first headline Glastonbury Festival performance in 1997. Despite technical problems that almost caused Yorke to abandon the stage, the performance was acclaimed and cemented Radiohead as a major live act. Grant Gee, the director of the \"No Surprises\" video, filmed the band on tour for the 1999 documentary Meeting People Is Easy. The film portrays the band's disaffection with the music industry and press, showing their burnout over the course of the tour. Since its release, OK Computer is often acclaimed as a landmark record of the 1990sErlewine, Stephen Thomas. \"OK Computer \" Allmusic. Retrieved 31 January 2012 and the Generation X era, and one of the greatest albums in recording history."]}, {"page": "OK Computer", "response": ["Radiohead planned to produce a video for every song on the album, but the project was abandoned due to financial and time constraints. According to \"No Surprises\" video director Grant Gee, the plan was scrapped when the videos for \"Paranoid Android\" and \"Karma Police\" went over budget. Also scrapped were plans for trip hop group Massive Attack to remix the album.", "\"Karma Police\" was released in August 1997 and \"No Surprises\" in January 1998. Both singles charted in the UK top ten, and \"Karma Police\" peaked at number 14 on the Billboard Modern Rock Tracks chart. \"Lucky\" was released as a single in France, but did not chart. \"Let Down\", considered for release as the lead single, was issued as a promotional single in September 1997 and charted on the Modern Rock Tracks chart at number 29. Meeting People Is Easy, Grant Gee's rockumentary following the band on their OK Computer world tour, premiered in November 1998."]}, {"page": "Meeting People Is Easy", "response": ["Meeting People Is Easy is a 1998 British documentary film by Grant Gee. It follows the British rock band Radiohead on the world tour for their 1997 album OK Computer. It was nominated for a Grammy Award for Best Music Film at the 42nd Annual Grammy Awards in 2000. It received positive reviews and sold more than half a million copies on VHS and DVD.", "According to director Grant Gee, Radiohead sat in hotel suites for days giving interviews. To film each interview, Gee \"[ran] around, leaving a microphone in one room, going and filming something in another\". He placed surveillance cameras in the band's dressing room, which Gee said foreshadowed the rise of reality television: \"We were doing it in a slightly more arty way, but it's the same as Big Brother, what we were doing with that band, seeing them locked in their bubble. Radiohead Big Brother is what I think of that film in a way.\""]}, {"page": "Iain Sinclair", "response": ["In June 2019, Sinclair travelled to Lima to begin retracing the journey of his great-grandfather, Arthur Sinclair, to \"the source of the Amazon\". Travelling with his daughter, Farne, filmmaker Grant Gee, and poet and translator Adolfo Barberá del Rosal, the journey is expected to result in a range of artistic responses including podcasts, film and various books. The journey was partly funded by the British Film Institute's documentary fund and part by crowdfunding. The expedition provided materials for a forthcoming essay-feature film entitled The Gold Machine which was expected to be released late in 2020. A book by Sinclair with the same title was also published in 2021. A small selection of prose-poetry inspired by the trip was published by Earthbound Press.", "|Featuring Farne Sinclair, Directed by Grant Gee"]}, {"page": "Familiar to Millions", "response": ["* 45-minute documentary directed by Dick Carruthers was shot in and around Wembley by Grant Gee including backstage interviews and fans footage."]}, {"page": "7 Television Commercials", "response": ["*\"No Surprises\"Director: Grant GeeProducer: Phil BarnesCinematography: Dan LandinProduction company: Kudos (Music Video)"]}, {"page": "The Hitchhiker's Guide to the Galaxy (film)", "response": ["* Don't Crash (68-minute UK exclusive \"making of\" documentary, directed by Grant Gee)"]}, {"page": "W. G. Sebald", "response": ["In 2011, Grant Gee made the documentary Patience (After Sebald) about the author's trek through the East Anglian landscape.\"Patience (After Sebald): watch the trailer – video\", The Guardian (31 January 2012)"]}, {"page": "Shiver (Coldplay song)", "response": ["The music video for \"Shiver\" was directed by English film director and cinematographer Grant Gee. It features Coldplay performing in a small studio. The yellow globe featured on the Parachutes cover can be seen on top of an amplifier in the video. The music video received \"strong exposure\" on MTV."]}, {"page": "Hammer & Tongs", "response": ["*Mansun – \"Six\" (1999) – dir. Grant Gee", "*Coldplay – \"Shiver\" (2000) – dir. Grant Gee"]}, {"page": "Radiohead discography", "response": ["| rowspan=\"2\"| Grant Gee", "| Grant Gee"]}, {"page": "List of University of Illinois Urbana-Champaign people", "response": ["* Grant Gee – film director (Meeting People Is Easy)"]}, {"page": "Obsessions", "response": ["\"Obsessions\" is a fan favourite of the later Suede and is notable as the only song from A New Morning that Suede performed at their 2010 reunion gigs.\"Suede Concert at 100 Club, City of London, England\". setlist.fm\"Suede Concert at The Ritz, Manchester, England\". setlist.fm It was also the only addition from A New Morning to appear on the 2010 compilation The Best of Suede. The video for the title song was directed by Grant Gee.  The lead guitarist's brother, Stephen Oakes, worked as a runner on this video too. Suede invited fans to appear in the video shoot, which took place at the Marquee, now known as the O2 Academy Islington."]}, {"page": "If You've Never Been", "response": ["On 4 July 2001, If You've Never Been was announced for release in two months' time. Later in the month, the band held two private shows where they debuted new songs from the album. \"Wonder\" was released as a single on 20 August 2001. Two versions were released on CD: the first with \"Anywhere You Go\" and \"Everyday\", while the second featured \"Today\", \"Caught in a Rush\", and the music video for \"Wonder\" (directed by Grant Gee). Around this time, the band performed at the Witnness, Gig on the Green and V Festivals. If You've Never Been was released on 3 September 2001, by Hut, Mobetta, and Virgin Records. It was promoted with club nights across the United Kingdom,  leading up to the album's release, a signing session in London, as well as a documentary of one of the two private shows from July 2001."]}, {"page": "No Surprises", "response": ["thumb|right|450px|Yorke in the music video (top) and filming the music video (bottom)The music video was directed by Grant Gee and was shot on November 28, 1997. Initially, Radiohead and their record label, Parlophone, planned to film music videos for each track on OK Computer. Gee pitched concepts for \"No Surprises\" and \"Fitter Happier\". His initial \"No Surprises\" concept, which Gee later described as \"some kind of sparkly music-box themed performance-based nonsense\", was rejected. His \"Fitter Happier\" concept was abandoned when Parlophone decided to shoot videos only for the singles."]}, {"page": "Onedotzero", "response": ["In 1999 the festival span off the TV series onedottv - it was produced and programmed by Hanson and Walter. In 2001, a 12-part follow-up maxi-series \"onedottv_global \" was made for the UK television channel Channel 4, directed and produced by the co-directors, with camera by Grant Gee. It involved filming subjects in Tokyo, New York, San Francisco, Los Angeles, Sweden and Paris."]}, {"page": "Instrument (film)", "response": ["Time Out and Variety's reviews for Instrument were generally positive, although they found it to be a bit lengthy, especially for those who do not find themselves to be fans of the band.Harvey, Dennis. \"Instrument: Ten Years With The Band Fugazi\", December 6, 1999, Variety.\"Instrument: Ten Years With The Band Fugazi\", Time Out London; last accessed February 15, 2009. However, The AV Club pointed out, \"if Instrument is purely self-indulgent, Fugazi is one band that has truly earned that luxury.\"Klein, Joshua. \"Fugazi: Instrument\", Onion A.V. Club; last accessed February 15, 2009. According to DVD Talk, the film \"is like a lot of the band's music; straight-ahead, consistently creative and down-to-earth.\" In an article by The Washington Post discussing both Instrument and Grant Gee's similar contemporaneous documentary Meeting People Is Easy (on Radiohead), the former was found to be \"much more fragmented than the Radiohead film. Then again, it's not meant to be a career overview. [...] And while Radiohead seems to take itself a tad too seriously, Fugazi takes itself just seriously enough, even addressing its hardcore-bred penchant for uncompromising ethical stands on everything from merchandising to community commitment (half the concerts in the film seem to be benefits or demonstrations). While they're thoughtful, they're not particularly self-absorbed and seem to actually enjoy what there is to be enjoyed on the road. And the release in Fugazi's music seems as emotionally cathartic for them as it is for their fans.\" "]}, {"page": "Demon Days Live (film)", "response": ["Demon Days: Live at the Manchester Opera House is a live DVD by Gorillaz, released 27 March 2006 in the UK (see 2006 in British music). It compiles the live performances from 1 to 5 November 2005 at the Manchester Opera House that recreated the Demon Days studio album and was directed by David Barnard and Grant Gee."]}, {"page": "Copenhagen International Documentary Film Festival", "response": ["|  Grant Gee"]}, {"page": "Coldplay discography", "response": ["| Grant Gee"]}, {"page": "The Caretaker (musician)", "response": ["He also completed the OST for Grant Gee's film Patience (After Sebald) (2012) in this period. Kirby's score for the film uses a 1927 record of Franz Schubert's piano-and-voice-only composition Winterreise (1828) as its main audio source. It also differs from other works of the project where hissing sounds are used instead of crackles, the loops are shorter in lengths, and the non-musical aspects of each track (the hiss sounds) serve as the foreground of the mix."]}, {"page": "It's a Wonderful Life (album)", "response": ["All of the album's songs were made into music videos by various filmmakers, such as the Quay Brothers, Garine Torossian, Grant Gee, and Guy Maddin.  These became the subject of the October 26, 2001, episode of the Sundance Channel series Sonic Cinema.\"Sparklehorse Goes Sonic.\" Retrieved from Rollingstone.com on March 17, 2008.", "*\"Devil's New\" – Grant Gee"]}, {"page": "Blur discography", "response": ["| Grant Gee"]}, {"page": "List of people from Brighton and Hove", "response": ["*Grant Gee, filmmaker and music video director"]}, {"page": "Scott Walker: 30 Century Man", "response": ["Scott Walker: 30 Century Man is a 2006 documentary film about Scott Walker. The film gets its title from the Scott 3 song \"30 Century Man\". It is directed and co-produced by Stephen Kijak, with Grant Gee serving as director of photography. It charts Walker's career in music, with a focus on his songwriting, and features exclusive footage of recording sessions for his most recent album, The Drift including a memorable sequence in which Walker oversees the recording of the punching of a joint of pork, for the percussion on the song Clara.  Rock legend David Bowie, who often professed to having been inspired by Walker, acted as executive producer of the film. Actor Gale Harold is one of the associate producers."]}, {"page": "1964 in the United Kingdom", "response": ["* 24 October – Grant Gee, film maker, photographer and cinematographer"]}, {"page": "Daniel Landin", "response": ["| Grant Gee"]}, {"page": "Legacy: The Best of Mansun", "response": ["*Grant Gee - filmed on-stage footage, 1998 (\"Love Remains (Super 8 montage)\")"]}, {"page": "The Rings of Saturn", "response": ["The 2012 film, Patience (After Sebald), directed by Grant Gee is based on the book."]}, {"page": "BBC One 'Circle' idents", "response": ["| Pedal Power || 27 July 2009 – 5 May 2014 || Numerous people use pedal power to light up the circle around the BBC One logo, displayed on a red board in the field. Directed by Grant Gee, this ident was launched to coincide with the first programme of Bang Goes the Theory. When the show was ended on 5 May, this ident became out of date and was withdrawn."]}, {"page": "The Cinema Guild", "response": ["* Patience (After Sebald) (Grant Gee, 2011)"]}, {"page": "Faster (2003 film)", "response": ["Faster is a 2003 documentary film about the motorcycle road racing world championship, MotoGP. Filmed between 2001 and 2002 by director Mark Neale, it features cinematography by music video director Grant Gee and is narrated by Ewan McGregor. It was succeeded by a 2-disc \"Ultimate Collector's Edition\" re-release in 2004 which included \"Faster '03-'04 The Sequel\". In 2006, The Doctor, The Tornado and The Kentucky Kid (or DTK) was released, followed by \"Fastest\" in 2011 and \"Hitting the Apex\" in 2015."]}, {"page": "2007 Toronto International Film Festival", "response": ["* Joy Division directed by Grant Gee"]}, {"page": "Joy Division (2007 film)", "response": ["Joy Division is a 2007 British documentary film on the British post-punk band Joy Division, directed by Grant Gee."]}, {"page": "Gee (surname)", "response": ["* Grant Gee (born 1964), British documentary and music video director"]}, {"page": "List of British films of 1998", "response": ["|Meeting People Is Easy||Grant Gee|| Radiohead || Documentary ||"]}, {"page": "Radiohead: The Best Of", "response": ["#\"No Surprises\" (directed by Grant Gee)"]}, {"page": "Nick Cave and the Bad Seeds discography", "response": ["| Grant Gee"]}, {"page": "The Kills discography", "response": ["| Grant Gee"]}, {"page": "Suede discography", "response": ["| Grant Gee"]}]}}