{"wiki_id": "http://www.wikidata.org/entity/Q939037", "itemLabel": "Leonard Hussey", "itemDescription": "British scientist and explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Hussey", "wikipedia_page": {"main": "Leonard Duncan Albert Hussey, OBE (6 May 1891 – 25 February 1964) was an English meteorologist, archaeologist, explorer, medical doctor and member of Ernest Shackleton's Imperial Trans-Antarctic and Shackleton–Rowett Expeditions. During the latter, he was with Shackleton at his death, and transported the body part-way back to England.\nHussey was also a member of the armed forces during World War I, serving in France and with Shackleton in Russia. After returning to private practice, Hussey rejoined the war effort in 1940 and became a decorated medical officer with the Royal Air Force during the Second World War. Returning once again to civilian practice in 1946, he was a member of the Royal College of Physicians, a lecturer, author, and Boy Scouts leader prior to retirement. Many of the items he collected during his career were donated to a number of museums.\n\n", "link_mentions": [{"page": "Ernest Shackleton", "response": ["Macklin, who conducted the postmortem, concluded that the cause of death was atheroma of the coronary arteries exacerbated by \"overstrain during a period of debility\". Leonard Hussey, a veteran of the Imperial Trans-Antarctic expedition, offered to accompany the body back to Britain; while he was in Montevideo en route to England, a message was received from Emily Shackleton asking that her husband be buried in South Georgia. Hussey returned to South Georgia with the body on the steamer , and on 5 March 1922, Shackleton was buried in the Grytviken cemetery, South Georgia, after a short service in the Lutheran church, with Edward Binnie officiating.Sir Ernest Shackleton: Funeral Ceremony In South Georgia: Many Wreaths On Coffin, in the Barrier Miner (archived in the NLA Trove); published 5 May 1922; retrieved 25 June 2014Shackleton's Last Voyage: the Story of the Quest, by Frank Wild, published 1923 by Cassell (via archive.org) Macklin wrote in his diary: \"I think this is as 'the Boss' would have had it himself, standing lonely in an island far from civilisation, surrounded by stormy tempestuous seas, & in the vicinity of one of his greatest exploits.\""]}, {"page": "Tulse Hill", "response": ["*Strand School - Grammar School building, opened in 1913 in Elm Park; it is now called Elm Court School. Former pupils include actor and director Tim Roth, Mick Jones of The Clash, broadcaster David Jacobs, CBE, artist Euan Uglow, rock musician Fruitbat (Les Carter, co-founder of Carter USM), James Lovelock, CH, CBE, FRS, scientist and environmentalist who is best known for the Gaia hypothesis, Leroy Rosenior, professional footballer, coach and broadcaster, Jeremy Spencer, founder-member of Fleetwood Mac, politician Sir Reg Goodwin (former Leader of the Greater London Council) and Leonard Hussey, explorer."]}, {"page": "Imperial Trans-Antarctic Expedition", "response": ["The scientific staff of six accompanying Endurance comprised the two surgeons, Alexander Macklin and James McIlroy; a geologist, James Wordie; a biologist, Robert Clark; a physicist, Reginald W. James; and Leonard Hussey, a meteorologist who would eventually edit Shackleton's expedition account South. The visual record of the expedition was the responsibility of its photographer Frank Hurley and its artist George Marston.Fisher 1957, pp. 311–314. The final composition of the Ross Sea party was hurried. Some who left Britain for Australia to join Aurora resigned before it departed for the Ross Sea, and a full complement of crew was in doubt until the last minute.Tyler-Lewis 2006, pp. 48–53. Within the party only Mackintosh and Joyce had any previous Antarctic experience; Mackintosh had lost an eye as the result of an accident during the Nimrod expedition and had gone home early."]}, {"page": "Endurance (1912 ship)", "response": ["* Leonard Hussey, Meteorologist"]}, {"page": "Frank Worsley", "response": ["After the Canadian government withdrew promised financial support for the expedition, the delay in finding replacement funding ate into the Arctic sailing season. Shackleton, not wanting to delay departure any longer than he had to, decided to go south instead and attempt a circumnavigation of the Antarctic continent. The expedition, known as the Shackleton–Rowett Expedition (John Rowett, an old friend of Shackleton's, was the main sponsor), would also attempt to discover sub-Antarctic islands and spend the southern winter in the Pacific islands. The expedition included several Endurance veterans in addition to Worsley; Frank Wild was again second in command, and Leonard Hussey was the meteorologist. Worsley was the master of the Quest, but would also be the expedition's hydrographer."]}, {"page": "Shackleton–Rowett Expedition", "response": ["Frank Wild, on his fourth trip with Shackleton, filled the second-in-command post as he had on the Endurance  expedition. Frank Worsley, Endurances former captain, became captain of Quest. Other old comrades included surgeons Alexander Macklin and James McIlroy, meteorologist Leonard Hussey, engineer Alexander Kerr, seaman Tom McLeod and cook Charles Green. Shackleton had assumed that Tom Crean would sign up, and had assigned him duties \"in charge of boats\", but Crean had retired from the navy to start a family back home in County Kerry, and declined Shackleton's invitation.Smith, p. 308.", "The death certificate, signed by Macklin, gave the cause as \"Atheroma of the Coronary arteries and Heart failure\" – in modern terms, coronary thrombosis. Later that morning, Wild, now in command, gave the news to the shocked crew, and told them that the expedition would carry on.Wild, p. 66. The body was taken ashore for embalming before its return to England. On 19 January, Leonard Hussey accompanied the body on board a steamer bound for Montevideo, but on arrival there he found a message from Emily Shackleton, requesting that the body be returned to South Georgia for burial."]}, {"page": "Stephen Tate", "response": ["|Leonard Hussey"]}, {"page": "Harry McNish", "response": ["During the initial stage of the voyage to Antarctica from Buenos Aires, he was kept busy with a number of routine tasks. He worked on the pram dinghy Nancy Endurance; made a small chest of drawers for Shackleton; specimen shelves for the biologist, Robert Clark; and instrument cases for Leonard Hussey, the meteorologist; and put up wind screens to protect the helmsman. He constructed a false deck, extending from the poop-deck to the chart-room to cover the extra coal that the ship had taken on board. He also acted as the ship's barber. As the ship pushed into the pack ice in the Weddell Sea it became increasingly difficult to navigate. McNish constructed a six-foot wooden semaphore on the bridge to enable the navigating officer to give the helmsman directions, and built a small stage over the stern to allow the propeller to be watched in order to keep it clear of the heavy ice."]}, {"page": "Robert Clark (zoologist)", "response": ["Once they reached the edge of the pack ice the crew set out for Elephant Island in three of the small boats of the Endurance. Clark travelled in the 22½-foot James Caird with Shackleton, Frank Hurley, Leonard Hussey, Reginald James, James Wordie, Harry McNish, Charles Green, John Vincent and Timothy McCarthy. On arriving at the island, Shackleton set out almost immediately with five of the crew to fetch rescue from South Georgia. The rest of the men, Clark among them, stayed camped on the island with Frank Wild in command. Elephant Island was inhospitable. It was cold but humid which meant that neither the clothing nor the sleeping bags were ever completely dry. Though there were penguins and seals to eat, the supplies were not inexhaustible and fuel was scarce. The routine on the island was monotonous. Clark managed to produce a primitive alcoholic beverage from methylated spirit, sugar, water and ginger which became known as \"Gut Rot 1916\" and was drunk with a toast to \"Wives and Sweethearts\" on Saturdays. On 30 August 1916, the men on Elephant Island were rescued by Shackleton aboard the Chilean ship Yelcho, four months after he had left the island."]}, {"page": "Strand School", "response": ["*Leonard Hussey, explorer.HMS ENDURANCE Visit and Learn website "]}, {"page": "List of alumni of King's College London", "response": ["*Leonard Hussey – explorer"]}, {"page": "Personnel of the Imperial Trans-Antarctic Expedition", "response": ["| Leonard Hussey"]}]}}