{"wiki_id": "http://www.wikidata.org/entity/Q941966", "itemLabel": "R. C. Sherriff", "itemDescription": "playwright", "wikipedia_url": "https://en.wikipedia.org/wiki/R._C._Sherriff", "wikipedia_page": {"main": "Robert Cedric Sherriff, FSA, FRSL (6 June 1896 – 13 November 1975) was an English writer best known for his play Journey's End, which was based on his experiences as an army officer in the First World War. He wrote several plays, many novels, and multiple screenplays, and was nominated for an Academy Award and two BAFTA awards.", "link_mentions": [{"page": "James Whale", "response": ["In 1928 Whale was offered the opportunity to direct two private performances of R. C. Sherriff's then-unknown play Journey's End for the Incorporated Stage Society, a theatre society that mounted private Sunday performances of plays. Set over a four-day period in March 1918 in the trenches at Saint-Quentin, France, Journey's End gives a glimpse into the experiences of the officers of a British infantry company in World War I. The key conflict is between Capt. Stanhope, the company commander, and Lt. Raleigh, the brother of Stanhope's fiancée.Green, et al., p. 272. Whale offered the part of Stanhope to the then barely known Laurence Olivier. Olivier initially declined the role,Cottrell, p. 53. but after meeting the playwright agreed to take it on. Maurice Evans was cast as Raleigh. The play was well received and transferred to the Savoy Theatre in London's West End, opening on 21 January 1929. A young Colin Clive was now in the lead role,Williamson, p. 29. Olivier having accepted an offer to take the lead in a production of Beau Geste.Coleman, p. 31. The play was a tremendous success, with critics uniform and effusive in their praise and with audiences sometimes sitting in stunned silence following its conclusion only to burst into thunderous ovations.Curtis, p. 70. As Whale biographer James Curtis wrote, the play \"managed to coalesce, at the right time and in the right manner, the impressions of a whole generation of men who were in the war and who had found it impossible, through words or deeds, to adequately express to their friends and families what the trenches had been like\".Curtis, p. 71. After three weeks at the Savoy, Journey's End transferred to the Prince of Wales Theatre, where it ran for the next two years.Coleman, p. 32."]}, {"page": "Kingston upon Thames", "response": ["John Galsworthy the author was born on Kingston Hill and Jacqueline Wilson grew up, and went to school in Kingston and still lives there today. Both are commemorated at Kingston University – Galsworthy in the newest building and Wilson in the main hall. Also commemorated at the University is photographer Eadweard Muybridge who was born at Kingston and changed the spelling of his first name in reference to the name of the Saxon king on the Coronation Stone. He was a pioneer in the photography of the moving image. R. C. Sherriff the playwright is also associated with Kingston, writing his first play to support Kingston Rowing Club. An earlier writer born in Kingston was John Cleland."]}, {"page": "1975", "response": ["* November 13 – R. C. Sherriff, English writer (b. 1896)"]}, {"page": "List of science-fiction authors", "response": ["*R. C. Sherriff (1896–1975)"]}, {"page": "Academy Award for Best Adapted Screenplay", "response": ["| Holt Marvell, R. C. Sherriff & Claudine West"]}, {"page": "Notting Hill", "response": ["Notting Hill provides the setting for novels by G.K. Chesterton (The Napoleon of Notting Hill), Colin MacInnes (Absolute Beginners), Michael Moorcock (the Jerry Cornelius quartet), R. C. Sherriff (The Hopkins Manuscript), and Alan Hollinghurst (The Line of Beauty). Dan Waddel's The Blood Detective is a murder novel set in the past and present - featuring Notting Dale. The area's newer, wealthy residents are satirised in Rachel Johnson's novel Notting Hell (2006) set in grand houses surrounding a fictional communal garden. Sam Selvon's 1956 novel The Lonely Londoners set in Notting Hill portrays the lives of Caribbean immigrants making their way in post-World War II London."]}, {"page": "The Dam Busters (film)", "response": ["After the Air Ministry agreed to make available four Lancaster bombers at a cheap price which helped make the production viable, Associated British decided to proceed with the film and agreed with Brickhill on the film rights in December 1952 for what is believed to have been £5,000.Dando-Collins. p. 241. After considering C.S. Forester, Terence Rattigan, as well as Emlyn Williams and Leslie Arliss, R. C. Sherriff was selected as the screenwriter with planned August delivery of the screenplay.Dando-Collins. p. 243. Sherriff agreed with Brickhill's opinion that the film needed to concentrate on Operation Chastise and exclude the later operations covered in the book."]}, {"page": "1937 in television", "response": ["*November 11 (Armistice Day) – BBC Television devotes the evening to a broadcast of Journey's End by R. C. Sherriff (1928, set on the Western Front (World War I) in 1918), the first full-length television adaptation of a stage play. Reginald Tate plays the lead, Stanhope, a rôle he has performed extensively in the theatre."]}, {"page": "1896 in literature", "response": ["*June 6 – R. C. Sherriff, English dramatist (died 1975)"]}, {"page": "1928 in literature", "response": ["*December 9 – R. C. Sherriff's drama Journey's End, set on the Western Front (World War I), is premièred by the Incorporated Stage Society at the Apollo Theatre in London, with Laurence Olivier in a principal rôle.", "*R. C. Sherriff – Journey's End"]}, {"page": "1937 in literature", "response": ["**BBC Television broadcasts Journey's End by R. C. Sherriff, 1928, set on the Western Front (World War I) in 1918, as the first full-length television adaptation of a stage play. Reginald Tate plays the lead, having long performed it in the theater."]}, {"page": "1975 in literature", "response": ["*November 13 – R. C. Sherriff, English dramatist and novelist (born 1896)"]}, {"page": "World War I in literature", "response": ["* Journey's End (1928), by R. C. Sherriff"]}, {"page": "Tony Award for Best Revival of a Play", "response": ["| R. C. Sherriff"]}, {"page": "List of British playwrights", "response": ["*R. C. Sherriff"]}, {"page": "List of works titled after Shakespeare", "response": ["*Journey's End by R. C. Sherriff (V.ii) (also occurs in Twelfth Night (II.iii))"]}, {"page": "Duke of York's Theatre", "response": ["* Journey's End (19 July 2011 – 3 September 2011) by R. C. Sherriff"]}, {"page": "Maurice Evans (actor)", "response": ["In 1927, he was one of a group of out-of-work actors including Laurence Olivier, chosen to perform in a \"tryout\" of R. C. Sherriff's Journey's End directed by James Whale at the Apollo Theatre in London, and later in 1929 at the Savoy Theatre which had been leased by the Chicago theatre manager Maurice Browne. It was a huge success, running for two years and making Maurice's name. He played the young officer Raleigh, who dies at the end of the play. In 1934, he went to the Old Vic Theatre where his interpretation of Shakespeare's \"Richard II\" was highly praised. It was as a result of this that he was invited to join Katharine Cornell in the United States. His first appearance on Broadway was in Romeo and Juliet opposite Katharine Cornell in 1936, but he made his biggest impact in Shakespeare's Richard II, a production whose unexpected success was the surprise of the 1937 theatre season and allowed Evans to play Hamlet (1938) (the first time that the play was performed uncut on the New York stage), Falstaff in Henry IV, Part 1 (1939), Macbeth (1941) and Malvolio in Twelfth Night (1942) opposite the Viola of Helen Hayes, under the direction of Margaret Webster. He also starred opposite Cornell in the 1935 production of George Bernard Shaw's St. Joan."]}, {"page": "Cultural depictions of Napoleon", "response": ["*St Helena (1936) by R. C. Sherriff"]}, {"page": "Reginald Tate", "response": ["In 1926, he moved to London, with his first major role being in a production of Romeo and Juliet at the Strand Theatre. He had particular success with the lead role of Stanhope in R. C. Sherriff's play Journey's End, playing the part in a 1929 tour of Australia and New Zealand and again for a 1934 revival production at the Criterion Theatre in London."]}, {"page": "Colin Clive", "response": ["|1929 January 21 ||Journey's End||R. C. Sherriff ||London||Savoy Theatre|| Cpt. Stanhope"]}, {"page": "Goodbye, Mr. Chips (1939 film)", "response": ["\"We wish to acknowledge here our gratitude to the late Irving Thalberg, whose inspiration illuminates the picture of Goodbye, Mr. Chips\"— James Hilton, Victor Saville, Sam Wood, Sidney A. Franklin, R. C. Sherriff, Claudine West, Eric Maschwitz", "| R. C. Sherriff, Claudine West, Eric Maschwitz  Winner was Sidney Howard – Gone with the Wind"]}, {"page": "Odd Man Out", "response": ["American novelist, essayist and some-time screenwriter Gore Vidal called the film a \"near-perfect film\" and its screenwriter R. C. Sherriff \"one of the few true film auteurs.\"Vidal, Gore. \"Screening History - The William Massey Sr. Lectures in the History of American Civilisation 1991\".(Harvard University Press)."]}, {"page": "Aces High (film)", "response": ["Aces High is a 1976 war film starring Malcolm McDowell, Peter Firth, Christopher Plummer and Simon Ward. The film, which is an Anglo-French production, is based on the 1928 play Journey's End by R. C. Sherriff with additional material from the memoir Sagittarius Rising by Cecil Lewis. It was directed by Jack Gold. The screenplay was written by Howard Barker."]}, {"page": "Apollo Theatre", "response": ["George Grossmith, Jr. and Edward Laurillard managed the theatre from 1920 to 1923, presenting a series of plays and revivals, including Such a Nice Young Man by H.F. Maltby (1920) and Trilby (1922), the latter based on the 1894 George du Maurier novel of the same name. They had produced The Only Girl here in 1916 and Tilly of Bloomsbury in 1919. The Fake was produced in 1924, starring Godfrey Tearle. 1927 saw Abie's Irish Rose and Whispering Wires, with Henry Daniel. The next year, Laurence Olivier starred in R. C. Sherriff's Journey's End. Seán O'Casey's The Silver Tassie and Ivor Novello's A Symphony in Two Flats both played in 1929. Diana Wynyard starred as Charlotte Brontë in Clemence Dane's Wild Decembers in 1932. Marion Lorne was the star of a number of plays by her husband Walter Hackett from 1934 to 1937. Ian Hay's Housemaster had the most successful run in this period with 662 performances from 1936. Raymond Massey starred in Robert Sherwood's Pulitzer Prize-winning Idiot's Delight in 1938. Patrick Hamilton's play Gaslight held the stage in 1939, and Terence Rattigan's Flare Path played in 1942."]}, {"page": "Journey's End", "response": ["Journey's End is a 1928 dramatic play by English playwright R. C. Sherriff, set in the trenches near Saint-Quentin, Aisne, towards the end of the First World War. The story plays out in the officers' dugout of a British Army infantry company from 18 March 1918 to 21 March 1918, providing a glimpse of the officers' lives in the last few days before Operation Michael.", "Category:Plays by R. C. Sherriff"]}, {"page": "Betty Box", "response": ["*Requiem for a Wren (1959) – story about World War two from a woman's point of view based on script by R. C. Sherriff"]}, {"page": "R.C. Sherriff", "response": ["#redirect R. C. Sherriff"]}, {"page": "Vernon Bartlett", "response": ["*Journey's End: a novel (with R. C. Sherriff), 1930 "]}, {"page": "Saeed Jaffrey", "response": ["In 1941 at Mussoorie, Jaffrey attended Wynberg Allen School, a Church of England public school where he picked up British-accented English. He played the role of the Cockney cook, Mason, in the annual school play, R. C. Sherriff's Journey's End. After completing his Senior Cambridge there, Jaffrey attended St. George's College, Mussoorie, an all-boys' Roman Catholic school run by Brothers of Saint Patrick. He played the role of Kate Hardcastle in the annual school play, Oliver Goldsmith's She Stoops To Conquer. At Mussoorie, Saeed and his brother Waheed would often sneak out at night to watch British and American films at the local theatres."]}, {"page": "The Invisible Man (1933 film)", "response": ["The director first set up for the project was James Whale, whom Laemmle Jr. had great faith in. He had directed R. C. Sherriff's play Journey's End in London and New York and the 1930 film Journey's End. Following the release of Frankenstein, which would break box office records across the United States, Universal had the film's star Boris Karloff signed to a five-year contract. On December 29, 1931, the Los Angeles Record stated that Karloff's next film would be The Invisible Man. By January 28, 1932, Whale had left the project, wary of being tagged as a \"horror\" director. This left Karloff as the only cast member of a film with neither a script nor a director."]}, {"page": "Neuralgia", "response": ["* In R. C. Sherriff's play Journey's End, the character Hibbert lies about having neuralgia to his commanding officer, and demands to be sent home."]}, {"page": "Kingston Grammar School", "response": ["* R. C. Sherriff — playwright, who donated five rowing eights (named after his plays: \"Journey's End\", \"White Carnation\", \"Home at Seven\", \"Long Sunset\" and \"Badger's Green\") to the school boat club in the 1960s and 1970s"]}, {"page": "November 1975", "response": ["**R. C. Sherriff, 79, English playwright"]}, {"page": "Dracula's Daughter", "response": ["The earliest screenplay for the Universal film was written by R. C. Sherriff and submitted in July 1935. It began with three scenes set in the 14th century and centered on the Dracula legend. It then switched to the present day, focusing on two engaged couples who visit Transylvania. The men explore the ruins of Dracula's castle. One is later found, insane, and the other goes missing. Professor Von Helsing is summoned, and he tracks the missing man to London, where he is in thrall to Dracula's daughter, the Countess Szelinski (sic). When she attempts to flee with her thrall to the Orient by ship, Von Helsing and three others book passage on the same ship. During a violent storm, Von Helsing destroys Dracula's daughter, and with her hold over the men broken, the scenario closes with a double wedding. This version was submitted on August 28, 1935, to the British Board of Film Censors, which rejected it, saying in part \"...Dracula's Daughter would require half a dozen ... languages to adequately express its beastliness.\" On September 10, Sherriff met with BBFC representatives and submitted a revised scenario two days later. This scenario was passed, but because its details were not recorded by the BBFC, how much it differed from the original or how much if any of that scenario was retained in the final script is unknown.Robertson pp. 65–66"]}, {"page": "No Highway in the Sky", "response": ["The first writer who worked on the script was R. C. Sherriff. The story was then assigned to producer Buddy Lighton who hired Oscar Millard to do the screenplay. Millard said he spent six months writing the script without ever looking at a Sheriff draft. In London, the producer Buddy Lighton hired Alec Coppel to rewrite some scenes that were based at the Farnborough Aircraft Establishment."]}, {"page": "Christopher Newton", "response": ["Christopher Newton's final season as artistic director of the Shaw was in 2002, and he invited Jackie Maxwell to join him for the season as artistic director designate to ensure a careful transition of leadership.  Since his departure, he has worked as a freelance director and actor for companies such as the Canadian Opera Company, the Vancouver Playhouse, Theatre Calgary, and the Stratford Festival. He has also returned to the Shaw Festival in 2004 to direct Oscar Wilde's The Importance of Being Earnest and in 2005 to direct R. C. Sherriff's Journey's End."]}]}}