{"wiki_id": "http://www.wikidata.org/entity/Q941459", "itemLabel": "James Walker", "itemDescription": "racing driver from Great Britain", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Walker_(racing_driver)", "wikipedia_page": {"main": "James Walker (born 25 August 1983, in Jersey) is a professional racing driver from Great Britain.", "link_mentions": [{"page": "James Walker", "response": ["*Sir James Walker, 2nd Baronet (1829–1899), British MP for Beverley", "*James Walker (colonial administrator) (1809–1885), Scottish colonial administrator", "*James Walker (Labour politician) (1883–1945), British MP for Newport and Motherwell", "*James Walker (Alberta politician) (1874–?), Canadian politician from Alberta", "*James Walker (Canadian judge) (1756–1800), English-born lawyer, judge and politician in Lower Canada", "*James Walker (Australian politician) (1841–1923), Scottish-born Australian banker and politician", "*James Walker (New South Wales politician) (1785–1856), member of the New South Wales Legislative Council", "*James Walker (Queensland politician) (1869–1939), lawyer; member of the Queensland Legislative Assembly for Ipswich", "* James Walker (American football player) (1890–1973), American football player on the 1910 College Football All-America Team", "* James Walker (American football coach) (born 1944), American college football coach for the Kentucky Thorobreds", "* James Walker (hurdler) (born 1957), American hurdler", "* James Walker (alpine skier) (1926–1996), Australian Olympic skier", "* James Walker (Australian footballer) (born 1979), Australian rules footballer", "* James Walker (canoeist) (born 1971), Australian sprint canoeist", "* James Walker (cricketer, born 1981), English cricketer", "* James Walker (cyclist) (1897–?), South African Olympic cyclist", "* James Walker (footballer, born 1987), English footballer", "* James Walker (racing driver) (born 1983), Jersey-born British racing driver", "* James Walker (rower) (born 1949), Canadian Olympic rower", "* James Walker (runner) (born 1954), Guamanian marathon runner", "* James Walker (sportsman) (1859–1923), Scottish rugby footballer and cricketer", "*James Walker (writer/filmmaker) (born 1979), British writer and filmmaker", "*James Walker (writer) (1973–2015), Australian television writer", "*James Walker (conductor) (1913–1988), Australian record producer and conductor", "*James Walker (engraver) (1748–1808), British mezzotint engraver", "*James Walker (physician) (1720–1789), British physician", "*James Walker (chemist) (1863–1935), Scottish chemist", "*James Walker (engineer) (1781–1862), Scottish civil-engineer", "*James Walker (actor) (1940–2017), British actor", "*James Walker (bishop) (1770–1841), Anglican Bishop of Edinburgh", "*James Walker (Harvard) (1794–1874), American minister and educator, president of Harvard College", "*James Walker (Royal Navy officer) (1764–1831), British naval officer", "*James Walker (Surveyor General) (1826–1896), Anglo-Indian surveyor general of India", "*Mount James Walker, in Alberta Canada", "*James Walker Log House, in Texas, United States", "*James Walker Nursing School Quarters in North Carolina, United States"]}, {"page": "2005 British Formula 3 International Series", "response": ["|  James Walker", "|  James Walker", "|  James Walker", "|align=left|  James Walker"]}, {"page": "2004 British Formula 3 International Series", "response": ["|  James Walker", "|align=left|  James Walker"]}, {"page": "2006 British Formula 3 International Series", "response": ["|  James Walker", "|align=left|  James Walker"]}, {"page": "Fortec Motorsport", "response": ["|  James Walker", "|  James Walker", "|  James Walker"]}, {"page": "2006 Formula 3 Euro Series", "response": ["|  James Walker", "* James Walker: British Formula 3 Championship (Fortec Motorsport) → Hitech Racing", "|align=\"left\"|  James Walker"]}, {"page": "2007 Formula Renault 3.5 Series", "response": ["|  James Walker", "|  James Walker", "|align=left style=\"background:#8FCFDF;\"| James Walker"]}, {"page": "Hitech Grand Prix", "response": ["In the second season, 2004, Thompson was retained and joined by drivers Marko Asmer, James Walker, and Lucas Di Grassi. Di Grassi had two wins and was classified in eighth place overall. Another of that year's highlights was a podium finish on Di Grassi's début at the Macau Grand Prix. Asmer managed to finish the championship closing the top 10.", "For 2006, Hitech brought back James Walker, alongside James Jakes and Salvador Durán, with Jakes finishing 8th, Walker 9th and Durán 10th in a poor season that only heralded one podium finish (achieved by Walker).", "|  James Walker", "|  James Walker"]}, {"page": "2007 Formula 3 Euro Series", "response": ["* James Walker: Hitech Racing → Formula Renault 3.5 Series (Fortec Motorsport)"]}, {"page": "2008 Formula Renault 3.5 Series", "response": ["|  James Walker", "|align=\"left\"|  James Walker"]}, {"page": "British Formula Ford Championship", "response": ["|  James Walker"]}, {"page": "Sport in Jersey", "response": ["There is also one locally born racing driver: James Walker. Walker took part in British F3 from 2004 to 2006 and raced for Fortec Motorsport in the Renault World Series in 2007–2008, He then switched to P1 Motorsport for 2009. He has also raced in Superleague Formula and the Daytona 24 hours."]}, {"page": "2008 Superleague Formula season", "response": ["|  James Walker", "|  James Walker", "|align=left|  James Walker", "|align=left|  James Walker"]}, {"page": "List of Superleague Formula drivers and teams", "response": ["|align=\"left\"| James Walker"]}, {"page": "2009 Formula Renault 3.5 Series", "response": ["|  James Walker", "* James Walker: Fortec Motorsport → P1 Motorsport", "|  James Walker", "|  James Walker", "|  James Walker", "|align=left|  James Walker"]}, {"page": "2008 Nürburgring Superleague Formula round", "response": ["The 2008 Nürburgring Superleague Formula round was the second round of the inaugural Superleague Formula championship, with the races taking place on September 21, 2008. Eighteen football teams were represented on the grid, one more than at the opening round at Donington Park, with the introduction of the car representing Atlético Madrid driven by Andy Soucek. Other driver changes saw debuts for James Walker (replacing Ryan Dalziel in the Rangers F.C. car) and Antônio Pizzonia (replacing Soucek in the SC Corinthians car - with the Spaniard moving to the new Atlético Madrid car as mentioned above). The meeting saw wins for A.C. Milan and PSV Eindhoven, while Beijing Guoan extended their championship lead to 24 points.", "The race began with a rolling start, just like at Donington but this race saw the introduction of pitstops to the Superleague fray. From the start, the A.C. Milan car of Robert Doornbos got a fantastic jump and would leave Alessandro Pier Guidi's Galatasaray S.K. car behind to battle with the cars of Antônio Pizzonia (SC Corinthians) and Craig Dolby (R.S.C. Anderlecht). Dolby held second for a few yards before Pizzonia took second into turn one. Pizzonia would close up rapidly to the back of Doornbos' car, nearly colliding at some points of the circuit and he led the chasers by a couple of seconds. Following them was the Borussia Dortmund car of Nelson Philippe and the FC Basel 1893 car of home driver Max Wissel. Philippe's stay in fifth was short-lived however, as an engine failure on lap three forced him to retire from the race and would not return to the track for the rest of the meeting. Doornbos began to pull away from his challengers by the time of the pitstops. For the pitstops, only two mechanics per wheel are allowed. Pier Guidi was the first to pit, removing his fairly well worn set of boots off the car, with Dolby, Doornbos and the others bar Pizzonia and Yelmer Buurman's PSV Eindhoven car pitting around half-distance. When Buurman did make his stop, he stalled as he was exiting losing valuable time. He would end up 10th, with the only consolation being a fastest lap of the race. Pizzonia had an equally fraught pitstop, losing half a minute with a stall and would go on to finish 7th. When all the dramas had calmed down, Doornbos held on to win by 6.631 seconds from Dolby with Pier Guidi capitalising on the errors by others to take the final podium spot. Debutant James Walker finished fourth for gers F.C. having started on row six, followed by championship leader Davide Rigon (Beijing Guoan), fellow Donington winner Borja García (Sevilla FC), Pizzonia, Tristan Gommendy's F.C. Porto machine, Wissel, Buurman and Andreas Zuber completed the finishers for Al Ain.", "|  James Walker", "|  James Walker", "|  James Walker", "|  James Walker"]}, {"page": "2008 Zolder Superleague Formula round", "response": ["The 2008 Zolder Superleague Formula round was the third round of the inaugural Superleague Formula championship, with the races taking place on October 5, 2008. Eighteen football teams were represented on the grid, the same number of teams as there was at the Nürburgring. There were three driver changes for this round of the championship: Ryan Dalziel returned to the Rangers F.C. car (replacing James Walker), after missing the previous round due to a clash with his Rolex Sports Car Series commitments at Miller Motorsports Park. Two drivers made their debuts, with Dutchman Paul Meijer replacing Nelson Philippe in the car representing Borussia Dortmund and Belgian Bertrand Baguette replaced Andreas Zuber in the Al Ain car. The meeting saw a first win for Liverpool F.C. and a second win for championship leaders Beijing Guoan. However, the championship lead for the Chinese side was cut to 14 points."]}, {"page": "2009 Superleague Formula season", "response": ["* James Walker: Borussia Dortmund → World Series by Renault  (P1 Motorsport)"]}, {"page": "2008 Jerez Superleague Formula round", "response": ["The 2008 Jerez Superleague Formula round was the sixth and final round of the inaugural Superleague Formula championship, with the races taking place on November 23, 2008. Eighteen football teams were represented on the grid, the same number of teams as there was at the previous four rounds. There were two driver changes before this round of the championship: James Walker replaced Enrico Toccacelo in the Borussia Dortmund car and Bertrand Baguette returned to the Al Ain cockpit replacing Dominick Muermans. Paul Meijer had been expected to return, however his injury from the previous round at Vallelunga kept him out. The meeting saw a second win for A.C. Milan and a first win for Borussia Dortmund. With a ninth in the first race coupled with other low placings for Liverpool F.C. and PSV Eindhoven, Beijing Guoan clinched the first Superleague Formula title. With a third in the final race, Beijing won the title with 413 points, some 66 points clear of PSV, and two points further back were Milan.", "At the start, Vallés led away from Perera, with Andy Soucek (Atlético Madrid) passing Tristan Gommendy (F.C. Porto) for third on the opening lap. On lap five, Wissel spun out of tenth place, and this allowed Craig Dolby's R.S.C. Anderlecht car into the top ten and towards the front, Soucek passed Perera for second place. Lap seven saw the first retirement, with Alessandro Pier Guidi pulling the Galatasaray S.K. car off with engine troubles. Lap eight saw the first pitstop - Antônio Pizzonia (SC Corinthians) pitting from sixth position. Vallés then brought in the Liverpool machine on lap nine, allowing Soucek through into the lead. Tuka Rocha retired on lap ten, having suddenly slowed the lap before in the CR Flamengo car, nearly taking out Davide Rigon's championship-leading Beijing Guoan car due to gearbox issues. Soucek continued to lead until his pitstop on lap 14 - except he didn't make it all the way to the garage. A spin on the way in, caused too much damage and Soucek retired. Vallés thus returned to lead by over 10 seconds from Robert Doornbos (A.C. Milan), Pizzonia, Gommendy and Duncan Tappy (Tottenham Hotspur). Fifteen of the sixteen laps remaining passed and Vallés looked untroubled. However, the engine in the Liverpool car died on the final lap, and Vallés fell from first to seventh, and with it went the championship hopes. Doornbos inherited victory ahead of Gommendy, Tappy, Dolby, Perera, García, Vallés, Yelmer Buurman (PSV Eindhoven), Rigon (which sealed the championship for Beijing Guoan), Baguette, Wissel, Pizzonia (who had been demoted due to pitting outside the window), Stamatis Katsimis (Olympiacos CFP), James Walker (Borussia Dortmund) and Ryan Dalziel (Rangers F.C.), who was seven laps down.", "|  James Walker ", "|  James Walker", "|  James Walker", "|  James Walker"]}, {"page": "P1 Motorsport", "response": ["In 2009, P1 ran James Walker and Daniil Move in their two cars. Walker currently lies second in the championship with four races to go. However, P1's aspirations took a blow when their factory caught fire, destroying nearly all the team's assets. They are in the process of tooling up a new workshop in Hethel Engineering Centre, near Norwich.", "|  James Walker"]}, {"page": "Rangers F.C. (Superleague Formula team)", "response": ["Rangers Football Club had a team in the Superleague Formula race car series. The Rangers F.C. team had been operated by Alan Docking Racing. In 2008 Ryan Dalziel drove for Rangers F.C. in the team's maiden season. James Walker also drove for the team in one round of the 2008 season and posted their best result, a fourth-place finish.", "In 2008 Ryan Dalziel drove for Rangers F.C. in the team's maiden season finished overall in the mid table in 13th. It was only 1 of 3 teams that completed the whole season (a world record at the time) but did not get on to the podium. James Walker also drove for the team in one round of the 2008 season and posted their best result, a fourth-place finish.", "|  James Walker"]}, {"page": "2010 Superleague Formula season", "response": ["|  James Walker", "* James Walker: Formula Renault 3.5 Series (P1 Motorsport) → Liverpool F.C.", "* Ben Hanley replaced the injured Chris van der Drift for Olympiacos at Adria. Olympique Lyonnais ran their third driver of the season, Celso Míguez, now managed by the Drivex team. Sporting CP and GD Bordeaux cited \"technical problems\" for not competing, leaving a record-low 16 clubs to race. Maxime Jousse almost had to stand-in for brother Julien at A.S. Roma following a biking accident. Frédéric Vervisch replaced James Walker at Liverpool F.C. and Hywel Lloyd replaced Narain Karthikeyan at PSV Eindhoven.", "|align=left|  James Walker"]}, {"page": "Liverpool F.C. (Superleague Formula team)", "response": ["|  James Walker"]}, {"page": "Borussia Dortmund (Superleague Formula team)", "response": ["In the 2008 Superleague Formula season Borussia Dortmund finished 14th overall. They had 1 win in the final event of the year at the 2008 Jerez round during James Walker's only round for the team. James Walker had also been the driver of Rangers F.C.", "|  James Walker"]}, {"page": "List of Superleague Formula football clubs", "response": ["| Nelson Philippe, Paul Meijer, Enrico Toccacelo, James Walker", "| Ryan Dalziel, James WalkerJohn Martin", "| Adrián VallésAdrián VallésJames Walker, Frédéric Vervisch"]}, {"page": "2010 Rolex Sports Car Series", "response": ["|  James Walker"]}, {"page": "2010 Formula Renault 3.5 Series", "response": ["* James Walker: P1 Motorsport → Superleague Formula (Liverpool F.C.)"]}, {"page": "2010 24 Hours of Daytona", "response": ["|rowspan=2|  Jim Lowe Eric Lux Jim Pace Tim Sugden James Walker"]}, {"page": "2010 Silverstone Superleague Formula round", "response": ["|  James Walker", "|  James Walker", "|  James Walker", "|  James Walker"]}, {"page": "2004 Masters of Formula 3", "response": ["|  James Walker", "|  James Walker"]}, {"page": "2005 Masters of Formula 3", "response": ["|  James Walker", "|  James Walker"]}, {"page": "2006 Masters of Formula 3", "response": ["|  James Walker", "| James Walker"]}]}}