{"wiki_id": "http://www.wikidata.org/entity/Q942843", "itemLabel": "Desmond Cory", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Desmond_Cory", "wikipedia_page": {"main": "Desmond Cory was a pseudonym used by British mystery/thriller writer Shaun Lloyd McCarthy (Lancing, Sussex, 16 February 1928 – Marbella, Spain 31 January 2001)\nDesmond Cory wrote over 45 novels, including the creation of serial characters such as Johnny Fedora, a debonair British secret agent. Cory also wrote screenplays for Graham Greene novels (such as England Made Me) and had a number of his own novels appear on the big-screen and in TV thriller series.\nDesmond Cory was arguably one of Britain's most prolific thriller writers. His writing spans over 40 years, during which time he used up to three different pen names, such was the demand for his work.  Academics cover his works in such books as British Mystery and Thriller Writers Since 1940, and Detecting Men: A Reader's Guide and Checklist for Mystery Series Written By Men.", "link_mentions": [{"page": "Spy fiction", "response": ["With Secret Ministry (1951), Desmond Cory introduced Johnny Fedora, the secret agent with a licence to kill, the government-sanctioned assassin. Ian Fleming, a former member of naval intelligence, followed swiftly with the glamorous James Bond, secret agent 007 of the British Secret Service, a mixture of counter-intelligence officer, assassin and playboy. Perhaps the most famous fictional spy, Bond was introduced in Casino Royale (1953). After Fleming's death the franchise continued under other British and American authors, including Kingsley Amis, Christopher Wood, John Gardner, Raymond Benson, Sebastian Faulks, Jeffery Deaver, William Boyd and Anthony Horowitz. The Bond novels, which were extremely popular in the 1950s, inspired an even more popular series of films starting in 1962. The success of the Bond novels and films has greatly influenced popular images of the work of spies even through the character of Bond is more of an assassin than a spy.", "*Desmond Cory"]}, {"page": "List of works titled after Shakespeare", "response": ["*Begin, Murderer by Desmond Cory (III.ii) "]}, {"page": "Johnny Fedora", "response": ["Johnny Fedora is a fictional British secret agent who was the protagonist of 16 novels published between 1951 and 1984. Written by Shaun Lloyd McCarthy, under the pseudonym of Desmond Cory, Fedora was dubbed by literary critics as the 'thinking man's James Bond'. Preceding Bond, Fedora was also a hired assassin (\"hired to kill\"), but for many the Fedora plots were more complex and intellectual. The son of a Spanish father and Irish mother, Fedora was driven as much by a need to avenge the death of his parents as by patriotism or loyalty to British Intelligence. The debonair Fedora was always a tough and competent agent, and his first adventures were written in a more light-hearted manner than the latter ones.  The final books in the series featured his nemesis, Feramontov, a deadly and highly skilled Russian agent, whose ruthlessness went as far as trying to detonate a nuclear bomb.", "* A look back at the espionage assignments of Johnny Fedora Desmond Cory's famous secret agent - published July 2008]"]}, {"page": "MacCarthy Mor dynasty", "response": ["* Shaun Lloyd McCarthy (1928–2000), aka Desmond Cory, British novelist and screenwriter"]}, {"page": "Shaun Lloyd McCarthy", "response": ["#REDIRECTDesmond Cory"]}, {"page": "List of fictional secret agents", "response": ["*Johnny Fedora in Desmond Cory's books"]}, {"page": "Deadfall (1968 film)", "response": ["Deadfall is a 1968 British neo noir crime film written and directed by Bryan Forbes and starring Michael Caine, Eric Portman, Giovanna Ralli and Forbes's wife Nanette Newman, with music by John Barry in his final collaboration with Forbes. Barry also plays a musical conductor in the film. It is based on Desmond Cory's 1965 thriller and shot in and around Majorca, Spain. The film's theme song, \"My Love Has Two Faces\", was performed by Shirley Bassey."]}, {"page": "Theo Callas", "response": ["#REDIRECT Desmond Cory"]}]}}