{"wiki_id": "http://www.wikidata.org/entity/Q943930", "itemLabel": "Tommy Armour", "itemDescription": "Scottish-American professional golfer (1894–1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Armour", "wikipedia_page": {"main": "Thomas Dickson Armour (24 September 1896 – 11 September 1968) was a Scottish-American professional golfer. He was nicknamed The Silver Scot. He was the winner of three of golf's major championships: 1927 U.S. Open, 1930 PGA, and 1931 Open Championship. \nArmour popularized the term yips, the colloquial term for a sudden and unexplained loss of skills in experienced athletes.\n\n", "link_mentions": [{"page": "September 12", "response": ["*1968 – Tommy Armour, Scottish-American golfer and journalist (b. 1894)"]}, {"page": "September 24", "response": ["*1894 – Tommy Armour, Scottish-American golfer and sportscaster (d. 1968)"]}, {"page": "1894", "response": ["** Tommy Armour, Scottish golfer (d. 1968)"]}, {"page": "Ryder Cup", "response": ["The British team was: Ted Ray (Captain), Aubrey Boomer, Archie Compston, George Duncan, George Gadd, Arthur Havers, Herbert Jolly, Abe Mitchell, Fred Robson and Ernest Whitcombe. The American team was: Walter Hagen (Captain), Tommy Armour, Jim Barnes, Emmet French, Joe Kirkwood, Fred McLeod, Bill Mehlhorn, Joe Stein, Cyril Walker and Al Watrous. While all ten of the British players subsequently played in the Ryder Cup only three of the Americans did (Hagen, Mehlhorn and Watrous). Armour, Barnes, Kirkwood, McLeod and Walker were excluded by the policy of requiring players to be born in the USA while French and Stein were never selected."]}, {"page": "Larchmont, New York", "response": ["* Tommy Armour, golfer who won the U.S. Open, PGA Championship, and the British Open"]}, {"page": "The Open Championship", "response": ["|align=center|66th || align=center|1931 ||  Tommy Armour || align=center|296 || || 1 stroke ||  José Jurado || align=center|500|| align=\"center\" |100 || Carnoustie"]}, {"page": "1930 in sports", "response": ["* PGA Championship – Tommy Armour"]}, {"page": "U.S. Open (golf)", "response": ["|align=center|1927 ||  Tommy Armour || align=center|301 ||  || Playoff ||  Harry Cooper || align=center|500 || Oakmont Country Club || Plum, Pennsylvania"]}, {"page": "PGA Championship", "response": ["|align=center|1935 ||  Johnny Revolta || align=center|5 & 4 ||  Tommy Armour || Twin Hills Golf & Country Club || Oklahoma City, Oklahoma || align=center|1,000", "|align=center|1930 ||  Tommy Armour || align=center|1 up ||  Gene Sarazen || Fresh Meadow Country Club || Queens, New York || rowspan=8|"]}, {"page": "Jim Barnes", "response": ["James Martin Barnes (April 8, 1886 – May 24, 1966) was a leading figure in the early years of professional golf in the United States.  He is one of three native Britons (with Tommy Armour and Rory McIlroy) to win three different modern major professional championships."]}, {"page": "Harry Cooper (golfer)", "response": ["Cooper lost an 18-hole playoff to Tommy Armour for the 1927 U.S. Open title, at Oakmont Country Club. Armour had to make a birdie on the difficult 72nd hole, and did so with a long iron approach and a ten-foot putt, to tie Cooper, who had already finished."]}, {"page": "Bobby Cruickshank", "response": ["He was also becoming an outstanding golfer and met and became firm friends with another rising local golfer Tommy Armour.  Armour and Cruikshank played together regularly over the Braid Hills course.  Armour would later become a three time major winner. Bobby also became a member of Turnhouse Golf Club on the west of the city.Turnhouse Golf Club, History by Willie Miller", "Cruickshank turned professional in 1921 and moved to the United States, as suggested by his mentor and friend, Tommy Armour. He rose to prominence in the U.S. after reaching the last four of the USPGA in both 1922 and 1923.  He lost both times to eventual champion Gene Sarazen. Cruickshank was also twice runner-up in the US Open. In 1923 he finished second to Bobby Jones down by two shots after an 18 hole play off at Inwood Country Club, New York. In 1932 he was beaten by Gene Sarazen at Fresh Meadow Country Club, New York.", "* 1934 (3) National Capital Open, British Colonial Open, Pinehurst Fall Pro-Pro (with Tommy Armour)", "* 1927 Miami International Four-Ball (with Tommy Armour)", "* 1938 Mid South Pro/Pro (with Tommy Armour; tie with Henry Picard and Jack Grout)"]}, {"page": "Leo Diegel", "response": ["*1920 (1) Pinehurst Fall Pro-Am Bestball (with Tommy Armour)"]}, {"page": "Ed Dudley", "response": ["*1932 (1) Miami International Four-Ball (with Tommy Armour)"]}, {"page": "1927 in sports", "response": ["* US Open – Tommy Armour"]}, {"page": "Ferncliff Cemetery", "response": ["* Tommy Armour (1895–1968), Hall of Fame professional golfer"]}, {"page": "Vijay Singh", "response": ["| Tommy Armour III,  Jesper Parnevik"]}, {"page": "1931 in sports", "response": ["* British Open – Tommy Armour"]}, {"page": "John Daly (golfer)", "response": ["| Tommy Armour III,  Kenny Perry"]}]}}