{"wiki_id": "http://www.wikidata.org/entity/Q944531", "itemLabel": "William Cavendish", "itemDescription": "British politician (1783-1812)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cavendish_(MP_for_Derby)", "wikipedia_page": {"main": "William Cavendish MP (10 January 1783 – 14 January 1812) was an English nobleman and Whig politician. He was the son of Lord George Cavendish, later Earl of Burlington.He was educated at Eton College, and Trinity College, Cambridge, between 1800 and 1803.  He went on a continental Grand Tour in 1803–04, during which he visited Berlin to see the Prussian Army reviews. Although this was during the period of the Napoleonic Wars, his own military service was at home; he was commissioned Captain in the Derbyshire Militia in 1803, was promoted Major in 1804, and was its Colonel from 1811 until his early death.He was elected MP for Knaresborough in May 1804, then for Aylesbury in July that year. In the next general election in 1806, he was elected for Derby, which he represented until his death.He married Louisa O'Callaghan (d. 1863), daughter of Cornelius O'Callaghan, 1st Baron Lismore, on 18 July 1807. They had four children, the fourth born after his father's death:\n\nWilliam Cavendish, 7th Duke of Devonshire (1808–1891)\nLady Fanny Cavendish (11 Apr 1809 – 30 Dec 1885), married Frederick John Howard and had issue\nLord George Henry Cavendish (19 August 1810 – 23 September 1880)\nLord Richard Cavendish (3 July 1812 – 19 November 1873)(Upon William's accession as Duke of Devonshire in 1858, his siblings were granted precedence of the children of a duke by Royal Warrant.)\nWilliam predeceased his father, aged 29. On the evening of 14 January 1812, he was killed when he was accidentally flung from his curricle driving in Holker Park. He had been visiting his father's seat and was returning from a shooting excursion with his brother Charles and his college tutor named the Rev. Mr. Smith. The reins broke and William attempted to recover them when he was thrown and instantly killed. Charles was not injured but Smith suffered a broken rib. His father was subsequently created Earl of Burlington in 1831, a title which passed to William's son William, who also succeeded as Duke of Devonshire.", "link_mentions": [{"page": "Duke of Devonshire", "response": ["The Cavendish family descends from Sir John Cavendish, who took his name from the village of Cavendish, Suffolk, where he held an estate in the 14th century. He served as Chief Justice of the King's Bench from 1372 to 1381, and was killed in the Peasants' Revolt in 1381. Two of his great-grandsons were George Cavendish, Thomas Cardinal Wolsey's biographer, and George's younger brother Sir William Cavendish. Sir William gained great wealth from his position in the Exchequer and also (allegedly) from unfairly taking advantage of the dissolution of the Monasteries. He married (1547) as his third wife the famous Bess of Hardwick, with whom he had eight children. One of their sons, Sir Charles Cavendish (1553–1617), was the father of William Cavendish, 1st Duke of Newcastle-upon-Tyne (1592–1676; see Duke of Newcastle-upon-Tyne for more information on this branch of the family), while another son, Henry Cavendish, was the ancestor of the Barons Waterpark. Yet another son, William Cavendish (1552–1626), was a politician and a supporter of the colonization of Virginia. In 1605 he was raised to the peerage as Baron Cavendish, of Hardwicke in the County of Derby, and in 1618 he was further honoured when he was made Earl of Devonshire. Both titles are in the Peerage of England.", "He was succeeded by his eldest son, William Cavendish, 2nd Earl of Devonshire, who served as Lord-Lieutenant of Derbyshire and was a patron of the philosopher Thomas Hobbes (1588–1679). On his early death in 1628 the titles passed to his son, William Cavendish, 3rd Earl of Devonshire, who also served as Lord-Lieutenant of Derbyshire. He was succeeded by his son, the fourth Earl. He was a strong supporter of the Glorious Revolution of 1688 and later served under William III and Mary II as Lord Steward of the Household. In 1694 he was created Marquess of Hartington and Duke of Devonshire in the Peerage of England. He was succeeded by his eldest son, the second Duke, who held political office as Lord President of the Council and Lord Privy Seal and was also Lord-Lieutenant of Devonshire. His eldest son, the third Duke, served as Lord Privy Seal, as Lord Steward of the Household and (from 1737 to 1745) as Lord-Lieutenant of Ireland.", "On his death the titles passed to his eldest son, the fourth Duke, who was a prominent politician. He was summoned to the House of Lords through a writ of acceleration in his father's junior title of Baron Cavendish, of Hardwicke in 1751 and served as First Lord of the Treasury and titular Prime Minister of Great Britain from 1756 to 1757. Devonshire married Charlotte Boyle, 6th Baroness Clifford, daughter of the famous architect Richard Boyle, 3rd Earl of Burlington (on whose death in 1753 the earldom of Burlington became extinct). Their third and youngest son Lord George Cavendish was recreated Earl of Burlington in 1831. Devonshire was succeeded by his eldest son, William Cavendish, who became the fifth Duke of Devonshire. He had already succeeded his mother as seventh Baron Clifford in 1754. He served as Lord-Lieutenant of Derbyshire from 1782 to 1811 but is best rememberedThe Duchess for his first marriage (1774) to Lady Georgiana Spencer (1757–1806), the celebrated beauty and society hostess.", "Their only son, the sixth Duke, served as Lord Chamberlain of the Household from 1827 to 1828 and from 1830 to 1834. Known as the \"Bachelor Duke\", he never married and on his death in 1858 the barony of Clifford fell into abeyance between his sisters. He was succeeded in the other titles by his first cousin once removed, the second Earl of Burlington, who became the seventh Duke (see the Earl of Burlington for earlier history of this branch of the family). He was the son of William Cavendish, eldest son of the aforementioned first Earl of Burlington, youngest son of the fourth Duke. He was Lord-Lieutenant of Lancashire and Derbyshire and Chancellor of the University of London and of the University of Cambridge. He was succeeded by his second, but eldest surviving son, the eighth Duke. The eighth Duke was a noted statesman and the most famous member of the Cavendish family. Known under his courtesy title of Marquess of Hartington until 1891, he held political office for a period spanning 40 years, notably as Secretary of State for India and as Secretary of State for War, and three times declined to become Prime Minister. He married Louise, Dowager Duchess of Manchester, who became known as the \"Double Duchess\".", "His elder son, the tenth Duke, also a Conservative politician, served as Under-Secretary of State for Dominion Affairs, as Under-Secretary of State for India and Burma and as Under-Secretary of State for the Colonies. He married Lady Mary Gascoyne-Cecil, who was Mistress of the Robes to Queen Elizabeth II from 1953 to 1966. Their elder son and heir apparent William Cavendish, Marquess of Hartington, married Kathleen Kennedy, daughter of Joseph Kennedy and sister of the future President of the United States, John Fitzgerald Kennedy. Lord Hartington was killed in the Second World War in 1944 shortly after the marriage. The couple had no children.", "Lord Richard Cavendish, second son of the fourth Duke, represented Lancaster and Derbyshire in the House of Commons. Lady Dorothy Cavendish, daughter of the fourth Duke, married Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland (who assumed the additional surname of Cavendish). Augustus Clifford, illegitimate son by the fifth Duke and his mistress and later second wife Elizabeth Hervey, was a naval commander and was created a baronet in 1838 (see Clifford baronets). William Cavendish, eldest son of the first Earl of Burlington and father of the seventh Duke, represented Aylesbury and Derby in Parliament. George Henry Compton Cavendish, second son of the first Earl of Burlington, was Member of Parliament for Aylesbury. The Hon. Henry Frederick Compton Cavendish, third son of the first Earl of Burlington, was a general in the Army. The Hon. Charles Compton Cavendish, fourth son of the first Earl of Burlington, was created Baron Chesham in 1858.", "*William Cavendish, 1st Earl of Devonshire (1552–1626) was an English courtier", "*William Cavendish, 2nd Earl of Devonshire (1591–1628), eldest son of the 1st Earl", "*William Cavendish, 3rd Earl of Devonshire (1617–1684), elder son of the 2nd Earl", "*William Cavendish, 4th Earl of Devonshire (1640–1707) was created Duke of Devonshire in 1694", "*William Cavendish, 1st Duke of Devonshire (1640–1707), only son of the 3rd Earl ", "*William Cavendish, 2nd Duke of Devonshire (1673–1729), eldest son of the 1st Duke", "*William Cavendish, 3rd Duke of Devonshire (1698–1755), eldest son of the 2nd Duke", "*William Cavendish, 4th Duke of Devonshire (1720–1764), eldest son of the 3rd Duke", "*William Cavendish, 5th Duke of Devonshire (1748–1811), eldest son of the 4th Duke", "*William Cavendish, 7th Duke of Devonshire (1808–1891), eldest son of William Cavendish (1783–1812), eldest son of The 1st Earl of Burlington (by the second creation; 1754–1834), third son of the 4th Duke", "*Victor Christian William Cavendish, 9th Duke of Devonshire (1868–1938), eldest son of Lt.-Col. Lord Edward Cavendish (1838–1891), fourth son of the 7th Duke", "* 25px William Cavendish, 4th Duke of Devonshire (1720–1764)", "** 25px William Cavendish, 5th Duke of Devonshire (1748–1811)", "***25px William Cavendish, 6th Duke of Devonshire (1790–1858)", "***William Cavendish (1783–1812)", "****25px William Cavendish, 7th Duke of Devonshire, 7th Marquess of Hartington, 2nd Earl of Burlington (1808–1891)", "**********(1). William Cavendish, Earl of Burlington (b. 1969)", "**********(5).Henry Aurelian William Cavendish (b.2014)", "****25px William Cavendish, 2nd Baron Chesham (1815–1882)"]}, {"page": "List of political families in the United Kingdom", "response": ["** William Cavendish (1505–1557), MP. Descendant of John.", "*** William Cavendish, 1st Earl of Devonshire (1552–1626), peer and MP. Son of William. ", "**** William Cavendish, 2nd Earl of Devonshire (1590–1628), peer and MP. Son of William.", "***** William Cavendish, 3rd Earl of Devonshire (1617–1684), peer. Son of William.", "****** William Cavendish, 1st Duke of Devonshire (1640–1707), Whig MP for Derbyshire 1661–1681, peer. Son of William.", "******* William Cavendish, 2nd Duke of Devonshire (1672–1729), MP for Derbyshire 1695–1701, Castle Rising 1702 and Yorkshire 1702–1707, peer. Son of 1st Duke.", "******** William Cavendish, 3rd Duke of Devonshire (1698–1755), Whig MP for Lostwithiel 1721–1724, Grampound 1724–1727 and Huntingdonshire 1727–1729, peer. Son of 2nd Duke.", "********* William Cavendish, 4th Duke of Devonshire (1720–1764), Whig MP for Derbyshire 1741–51, peer, First Lord of the Treasury. Son of 3rd Duke.", "********** William Cavendish, 5th Duke of Devonshire (1744–1811), peer. Son of 4th Duke.", "*********** Georgiana, Duchess of Devonshire (1757–1806), spouse of William Cavendish, 5th Duke of Devonshire, society host and key support of the Whig party", "*********** William Cavendish (1783–1812), MP 1804–1812. Son of George.", "************* William Cavendish, 7th Duke of Devonshire (1808–1891), MP for Cambridge 1829–1831, Malton 1831–1832 and Derbyshire North 1832–1834, later 7th Duke of Devonshire. Son of George.", "****************** William Cavendish, Earl of Burlington (born 1969), High Sheriff of Derbyshire (2019–2020). Grandson of 11th Duke (his father the 12th Duke has not been elected representative peer).", "********** William Cavendish-Bentinck, 3rd Duke of Portland, Whig MP for Weobley 1761–62, later 3rd Duke of Portland and First Lord of the Treasury; son-in-law of 4th Duke"]}, {"page": "George Cavendish, 1st Earl of Burlington", "response": ["Cavendish was the third son of William Cavendish, 4th Duke of Devonshire and the former Lady Charlotte Boyle, daughter of Richard Boyle, 3rd Earl of Burlington of the first creation, whose title had become extinct upon his death in 1753.", "* William Cavendish (10 January 1783 – 17 January 1812)The Register of Births and Baptisms in the Parish of St James within the Liberty of Westminster. 1761-1786. 8 February 1783."]}, {"page": "Lord John Townshend", "response": ["Townshend married in 1787 Georgiana Anne Fawkener, daughter of William Poyntz, and the divorced wife of William Fawkener. Their elder son Charles Fox Townshend was the founder of the Eton Society but died young. Their younger son John became an admiral in the Royal Navy and succeeded his first cousin in the marquessate in 1855. Their daughter Elizabeth Frances Townshend (2 August 1789 –10 April 1862 Nice) married 20 October 1813 Captain Augustus Clifford R.N., later Sir Augustus Clifford, 1st Bt (1788-1877), illegitimate son of the 5th Duke of Devonshire and his mistress, Lady Elizabeth Foster, née Hervey, later the Duke's second wife (1811).Clifford was born before his half-brother William Cavendish, 6th Duke of Devonshire and outlived him by a decade. Mrs Clifford became Lady Clifford in 1838 when her husband was raised to a baronetcy.  Townshend died in February 1833, aged 76. Lady Georgiana Anne died in 1851."]}, {"page": "William Cavendish (1783-1812)", "response": ["#REDIRECT William Cavendish (MP for Derby)"]}, {"page": "William Cavendish (1783–1812)", "response": ["#REDIRECT William Cavendish (MP for Derby)"]}, {"page": "William Cavendish (English politician, born 1783)", "response": ["#REDIRECT William Cavendish (MP for Derby)"]}]}}