{"wiki_id": "http://www.wikidata.org/entity/Q944563", "itemLabel": "Richard Coles", "itemDescription": "British musician, journalist and priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Coles", "wikipedia_page": {"main": "Richard Keith Robert Coles  (born 26 March 1962) is an English musician, journalist, radio presenter and Church of England parish priest. Now vicar of Finedon in Northamptonshire, he was formerly the multi-instrumentalist who partnered Jimmy Somerville in the 1980s band the Communards. They achieved three top ten hits, including the No. 1 record and best-selling single of 1986, a dance version of \"Don't Leave Me This Way\".\nColes frequently appears on radio and television as well as in newspapers and, in March 2011, became the regular host of BBC Radio 4's Saturday Live programme. He is a regular contributor to QI, Would I Lie to You? and Have I Got News for You. He is an author, Chancellor of the University of Northampton, Honorary Chaplain to the Worshipful Company of Leathersellers, and a patron of social housing project Greatwell Homes in Wellingborough.", "link_mentions": [{"page": "Bronski Beat", "response": ["\"Run From Love\" was subsequently released in a remix form on the Bronski Beat album Hundreds & Thousands, a collection of mostly remixes (LP) and B-sides (as bonus tracks on the CD version) as well as the hit \"I Feel Love\". Somerville went on to form The Communards with Richard Coles while the remaining members of Bronski Beat searched for a new vocalist.", "The original member set of Bronski Beat was Jimmy Somerville, Steve Bronski and Larry Steinbachek. Following Somerville leaving to form pop group The Communards with Richard Coles, he was replaced by John Foster and later by Jonathan Hellyer. The band set-up has seen a number of changes.", "* Richard Coles - saxophone, clarinet (1983–1984, 1985)"]}, {"page": "March 26", "response": ["*1962 – Richard Coles, English pianist, saxophonist, and priest "]}, {"page": "Northamptonshire", "response": ["Rock and pop bands originating in the area have included Bauhaus, Temples, The Departure, New Cassettes, Raging Speedhorn and Defenestration. Richard Coles, an English musician, partnered in the 1980s with Jimmy Somerville to create The Communards band. They made three Top Ten Hits and made the Number 1 record in 1986 with their song 'Don't Leave me this way'. In 2012, The University of Northampton awarded him an honorary doctorate. He is now the vicar of Finedon in Northamptonshire."]}, {"page": "Jimmy Somerville", "response": ["Somerville left Bronski Beat in 1985 and formed The Communards with classically trained pianist Richard Coles, now a Church of England vicar and broadcaster. They had several hits, including a cover version of Harold Melvin & the Blue Notes' \"Don't Leave Me This Way\", which spent four weeks at No. 1 in the UK charts and became the biggest-selling single of 1986 in the UK. He also sang backing vocals on Fine Young Cannibals' version of \"Suspicious Minds\", which was a UK Top 10 hit."]}, {"page": "University Challenge", "response": ["|University of Leeds (Jonathan Clements, Henry Gee, Richard Coles, Timothy Allen)"]}, {"page": "The Communards", "response": ["The Communards were a British synth-pop duo formed in London in 1985. The duo consisted of Jimmy Somerville and Richard Coles. They are most famous for their cover versions of \"Don't Leave Me This Way\" and \"Never Can Say Goodbye\".", "The Communards formed in 1985 after singer Jimmy Somerville left his earlier band Bronski Beat to team up with classically trained musician Richard Coles. Somerville often used a falsetto singing style. Coles, though mainly a pianist, played a number of instruments and had been seen previously performing the clarinet solos on the Bronski Beat hit \"It Ain't Necessarily So\". They were joined by bass player Dave Renwick who had also played with Bronski Beat."]}, {"page": "Michael Fenton Stevens", "response": ["In 2020, with help from his son John Fenton Stevens, a series of podcasts have been released called My Time Capsule with guests such as Stephen Fry, Rebecca Front, Rick Wakeman, Mark Gatiss, Rufus Hound, David Mitchell, Anthony Head, Chris Addison, Rev Richard Coles, Griff Rhys Jones, Richard Herring and David Baddiel."]}, {"page": "Mo Mowlam", "response": ["Mowlam was an atheist and was cremated in Sittingbourne on 1 September 2005 at a non-religious service conducted by Richard Coles, formerly of the 1980s band The Communards. Half of her ashes were scattered at Hillsborough Castle (the Secretary of State for Northern Ireland's official residence) and the other half in her former parliamentary constituency of Redcar."]}, {"page": "QI", "response": ["* Richard Coles"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Richard Coles", "|The Rev. Richard Coles", "|The Rev. Richard Coles", "|The Rev. Richard Coles", "|The Rev. Richard Coles", "|The Rev. Richard Coles", "|The Rev. Richard Coles"]}, {"page": "Alternative (album)", "response": ["*Richard Coles – additional keyboards on disc 2: track 8"]}, {"page": "Radio Academy Awards", "response": ["|Richard Coles"]}, {"page": "Strictly Come Dancing", "response": ["| Rev. Richard Coles", "|Rev. Richard Coles", "In 2015, in an interview with the Daily Mirror, CJ de Mooi said that he was turned down for the show because he had wanted to dance with a same-sex partner.  The BBC denied that de Mooi had ever been under consideration for the show, and also declared that \"Strictly is a family show and we have chosen the traditional format of mixed-sex couples\". The press has reported on the issue on numerous occasions when gay celebrities have appeared on the show, including Will Young, Susan Calman, Robert Rinder, Richard Coles and Ranj Singh. Strictly Come Dancing judges Shirley Ballas and Craig Revel Horwood have both expressed their support for introducing same-sex couples."]}, {"page": "Jonathan Clements", "response": ["In 2019, he appeared on Christmas University Challenge as a member of the Leeds team, alongside Henry Gee and Timothy Allen, captained by Richard Coles."]}, {"page": "The Wright Stuff", "response": ["* Richard Coles (2018)"]}, {"page": "Nemone", "response": ["Nemone has broadcast on BBC Radio 4, appearing on A Good Read and co-hosting Saturday Live with the Reverend Richard Coles. "]}, {"page": "Finedon", "response": ["The Parish Church of St Mary the Virgin, is a mid-14th-century church with an aisled nave of four bays. The current parish priest is the Reverend Richard Coles, a broadcaster and former member of pop group The Communards.", "*Richard Coles, Vicar of Finedon parish since 2011Daily Telegraph report and former pop musician with The Communards"]}, {"page": "University of Northampton", "response": ["On 10 February 2008, the university appointed Baroness Falkner of Margravine as its first Chancellor. In July 2017, she was succeeded by the BBC radio presenter Richard Coles."]}, {"page": "Hello Angel", "response": ["*Richard Coles - keyboards"]}, {"page": "MasterChef (British TV series)", "response": ["* 2016: Alexis Conran, Donna Air, Neil Back, Amelle Berrabah, Marcus Butler, Tommy Cannon, Amy Childs, Richard Coles, David Harper, Audley Harrison, Cherry Healey, Liz Johnson, Tina Malone, Louise Minchin, Laila Morse, Jimmy Osmond, Sid Owen, Gleb Savchenko, Sinitta and Simon Webbe.", "*23 December 2021: Gemma Collins, Joe Swash, Les Dennis, Mica Paris and Rev. Richard Coles"]}, {"page": "Coles (surname)", "response": ["* Daniel Richard Coles (b. 1981), English footballer", "* Richard Coles (b. 1962), British musician"]}, {"page": "The Age of Consent (album)", "response": ["*Horns - Uptown Horns (Crispin Cioe (alto saxophone & solo, \"Love And Money\"), Arno Hecht (tenor saxophone), Richard Coles (clarinet solo), \"It Ain't Necessarily So\"), \"Hollywood\" Paul Litteral (trumpet) and Bob Funk (trombone))"]}, {"page": "Great British Menu", "response": ["| South West || Lee Smith || Joe Baker || Emily Scott || Daniel Clifford || The Rev. Richard Coles"]}, {"page": "List of people associated with the University of London", "response": ["* Richard Coles – priest, musician and journalist (KCL)"]}, {"page": "List of Anglicans", "response": ["*Richard Coles, vicar and former member of pop band The Communards"]}, {"page": "College of the Resurrection", "response": ["* Richard Coles – musician, radio presenter and parish priest"]}, {"page": "Saturday Live (radio series)", "response": ["Currently presented by Richard Coles, formerly together with Aasmah Mir and also previously with JP Devlin, Saturday Live is broadcast live between 9.00 and 10.30 on Saturday mornings (UK time) and is available world-wide on demand in the form of an extensive on-line archive that includes streaming, download, and podcast formats. In 2015, John Patrick (JP) Devlin stated on-air, as the only remaining member of the presentation team from first programme, nine years earlier, that he had \"...seen out two Radio 4 Controllers, four Director Generals and, get this, eighteen Saturday Live presenters...\". According to presenter, Richard Coles, at the end of 2014 there were more than 1.8 million weekly listeners  and according to Poppy North of C. Hurst & Co. on April 30, 2019 there were 2.4 million listeners. ", "In December 2020, it was announced that Richard Coles' new co-host would be the broadcaster Nikki Bedi."]}, {"page": "Richard Cole (disambiguation)", "response": ["* Richard Coles (born 1962), journalist, musician, and Church of England vicar"]}, {"page": "Heresy (radio series)", "response": ["| David Baddiel, Richard Coles, David Mitchell", "| Simon Evans, Richard Coles, Andrew Collins", "| Mark Steel, Matthew Norman, Richard Coles", "| Marcus Brigstocke, Natalie Haynes, Richard Coles", "| David Mitchell, Richard Coles, Diane Abbott MP", "| Julia Hartley-Brewer, Richard Coles, Giles Coren"]}, {"page": "List of gay, lesbian or bisexual people: C", "response": ["| Richard Coles"]}, {"page": "List of alumni of King's College London", "response": ["*Richard Coles – priest, musician and journalist"]}]}}