{"wiki_id": "http://www.wikidata.org/entity/Q944531", "itemLabel": "William Cavendish", "itemDescription": "British politician (1783-1812)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Cavendish_(MP_for_Derby)", "wikipedia_page": {"main": "William Cavendish MP (10 January 1783 – 14 January 1812) was an English nobleman and Whig politician. He was the son of Lord George Cavendish, later Earl of Burlington.He was educated at Eton College, and Trinity College, Cambridge, between 1800 and 1803.  He went on a continental Grand Tour in 1803–04, during which he visited Berlin to see the Prussian Army reviews. Although this was during the period of the Napoleonic Wars, his own military service was at home; he was commissioned Captain in the Derbyshire Militia in 1803, was promoted Major in 1804, and was its Colonel from 1811 until his early death.He was elected MP for Knaresborough in May 1804, then for Aylesbury in July that year. In the next general election in 1806, he was elected for Derby, which he represented until his death.He married Louisa O'Callaghan (d. 1863), daughter of Cornelius O'Callaghan, 1st Baron Lismore, on 18 July 1807. They had four children, the fourth born after his father's death:\n\nWilliam Cavendish, 7th Duke of Devonshire (1808–1891)\nLady Fanny Cavendish (11 Apr 1809 – 30 Dec 1885), married Frederick John Howard and had issue\nLord George Henry Cavendish (19 August 1810 – 23 September 1880)\nLord Richard Cavendish (3 July 1812 – 19 November 1873)(Upon William's accession as Duke of Devonshire in 1858, his siblings were granted precedence of the children of a duke by Royal Warrant.)\nWilliam predeceased his father, aged 29. On the evening of 14 January 1812, he was killed when he was accidentally flung from his curricle driving in Holker Park. He had been visiting his father's seat and was returning from a shooting excursion with his brother Charles and his college tutor named the Rev. Mr. Smith. The reins broke and William attempted to recover them when he was thrown and instantly killed. Charles was not injured but Smith suffered a broken rib. His father was subsequently created Earl of Burlington in 1831, a title which passed to William's son William, who also succeeded as Duke of Devonshire.\n\n", "link_mentions": {}}}