{"wiki_id": "http://www.wikidata.org/entity/Q945180", "itemLabel": "Thomas Sheraton", "itemDescription": "British furniture designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Sheraton", "wikipedia_page": {"main": "Thomas Sheraton (1751 – 22 October 1806) was a furniture designer, one of the \"big three\" English furniture makers of the 18th century, along with Thomas Chippendale and George Hepplewhite. Sheraton gave his name to a style of furniture characterized by a feminine refinement of late Georgian styles and became the most powerful source of inspiration behind the furniture of the late 18th century.\n\n", "link_mentions": [{"page": "1751", "response": ["** Thomas Sheraton, English furniture designer (d. 1806)"]}, {"page": "List of furniture designers", "response": ["* Thomas Sheraton (1751-1806)"]}, {"page": "Stockton-on-Tees", "response": ["* Thomas Sheraton, furniture designer"]}, {"page": "Sheraton", "response": ["*Sheraton style, an 18th-century neoclassical furniture style, so called after Thomas Sheraton", "*Thomas Sheraton (1751 – 22 October 1806), English furniture designer"]}, {"page": "George Hepplewhite", "response": ["George Hepplewhite (1727? – 21 June 1786) was a cabinetmaker.  He is regarded as having been one of the \"big three\" English furniture makers of the 18th century, along with Thomas Sheraton and Thomas Chippendale. There are no pieces of furniture made by Hepplewhite or his firm known to exist but he gave his name to a distinctive style of light, elegant furniture that was fashionable between about 1775 and 1800 and reproductions of his designs continued through the following centuries. One characteristic that is seen in many of his designs is a shield-shaped chair back, where an expansive shield appeared in place of a narrower splat design."]}, {"page": "Thomas Hope (banker, born 1769)", "response": ["In 1807 Thomas Hope published sketches of his furniture, in a folio volume, titled Household Furniture and Interior Decoration, which had considerable influence and brought about a change in the upholstery and interior decoration of houses. Hope's furniture designs were in the pseudo-classical manner generally called \"English Empire\". It was sometimes extravagant, and often heavy, but was much more restrained than the wilder and later flights of Thomas Sheraton in this style."]}, {"page": "Carlton House desk", "response": ["The desk resembles a normal writing table, but small drawers above the surface form a \"U\" shape around the user, instead of merely facing the user as in a typical bureau à gradin. Unlike other types of bureau à gradin, the Carlton House desk usually offers no pigeonholes. There are usually small slopes over each of the desktop drawers at the left and right ends of the \"U\" shape.  Drawings of this type of desk were presented by Hepplewhite in his noted design book, the Cabinet-Maker and Upholsterer's Guide, and by Thomas Sheraton in his own book of designs, The Cabinet Maker and Upholsterer's Drawing Book, thus ensuring its popularity."]}, {"page": "Duncan Phyfe", "response": ["He became known as one of America's leading cabinetmakers by selling furniture at relatively low prices. Phyfe’s work encompassed a broad range of the period’s Neoclassical styles, starting from his earliest furnitures— which bear the influence of his 18th-century British predecessors Thomas Sheraton and Thomas Hope— continuing with  Regency, Federal, Empire and ending with his late simplified designs in the Grecian plain style."]}, {"page": "Cabinet-Maker and Upholsterer's Guide", "response": ["In a technical sense the book is only attributed to George Hepplewhite as author since it was published after his death and the original title page bears the name \"A. Hepplewhite and co.\", for Alice Hepplewhite, his widow. Very little is known of George Hepplewhite's life, unlike that of the other two great British cabinet makers of the period Thomas Sheraton and Thomas Chippendale. We do have information that suggests Hepplewhite was born in 1727 in Ryton Parish, County Durham, England."]}, {"page": "Buffet", "response": ["During the 18th century, more subtle demonstrations of wealth were preferred. The buffet was revived in England and France at the end of the century, when new ideals of privacy made a modicum of self-service at breakfast-time appealing, even among those who could have had a footman servant behind each chair. In The Cabinet Dictionary of 1803, Thomas Sheraton presented a neoclassical design and observed that \"a buffet may, with some propriety, be restored to modern use, and prove ornamental to a modern breakfast-room, answering as the china cabinet/repository of a tea equipage.\""]}, {"page": "History of the chair", "response": ["Although English furniture derives so extensively from foreign and especially French and Italian models, the earlier forms of English chairs owed but little to exotic influences. This was especially the case down to the end of the Tudor period, after which France began to set her mark upon the British chair. The squat variety, with heavy and sombre back, carved like a piece of panelling, gave place to a taller, more slender, and more elegant form, in which the framework only was carved, and attempts were made at ornament in new directions. The stretcher especially offered opportunities which were not lost upon the cabinet-makers of the Restoration. From a mere uncompromising cross-bar intended to strengthen the construction it blossomed, almost suddenly, into an elaborate scroll-work or an exceedingly graceful semicircular ornament connecting all four legs, with a vase-shaped knob in the centre. The arms and legs of chairs of this period were scrolled, the splats of the back often showing a rich arrangement of spirals and scrolls. This most decorative of all types appears to have been popularized in England by the cavaliers who had been in exile with Charles II, and had become familiar with it in the north-western parts of the European continent. During the reign of William III and Mary II these charming forms degenerated into something much stiffer and more rectangular, with a solid, more or less fiddle-shaped splat and a cabriole leg with pad feet. The more ornamental examples had cane seats and ill-proportioned cane backs. From these forms was gradually developed the Chippendale chair, with its elaborately interlaced back, its graceful arms and square or cabriole legs, the latter terminating in the claw and ball or the pad foot. George Hepplewhite, Thomas Sheraton and Robert Adam all aimed at lightening the chair, which, even in the master hands of Thomas Chippendale, remained comparatively heavy. The endeavour succeeded, and the modern chair is everywhere comparatively slight."]}, {"page": "Adam style", "response": ["*Thomas Sheraton"]}, {"page": "Art of the United Kingdom", "response": ["The three leading furniture makers, Thomas Chippendale (1718–1779), Thomas Sheraton (1751–1806) and George Hepplewhite (1727?–1786) had varied styles and have achieved the lasting fame they have mainly as the authors of pattern books used by other makers in Britain and abroad.  In fact it is far from clear if the last two named ever ran actual workshops, though Chippendale certainly was successful in this and in what we now call interior design; unlike France Britain had abandoned its guild system, and Chippendale was able to employ specialists in all the crafts needed to complete a redecoration.Snodin, 154–157  During the period Rococo and Chinoiserie gave way to Neo-Classicism, with the Scottish architect and interior designer Robert Adam (1728–1792) leading the new style."]}, {"page": "Molding (decorative)", "response": ["* Cable molding or ropework: Convex molding carved in imitation of a twisted rope or cord, and used for decorative moldings of the Romanesque style in England, France and Spain and adapted for 18th-century silver and furniture design (Thomas Sheraton)Lewis, Philippa & Gillian Darley (1986) Dictionary of Ornament, NY: Pantheon"]}, {"page": "Curule seat", "response": ["The form found its way into stylish but non-royal decoration in the archaeological second phase of neoclassicism in the early 19th century. An unusually early example of this revived form is provided by the large sets of richly carved and gilded pliants (folding stools) forming part of long sets with matching tabourets delivered in 1786 to the royal châteaux of Compiègne and Fontainebleau.Pierre Verlet, French Royal Furniture  p. 75f; F.J.B. Watson, The Wrightsman Collection (Metropolitan Museum of Art)  1966:vol. I, cat. no. 51ab, pp76-78. With their Imperial Roman connotations, the backless curule seats found their way into furnishings for Napoleon, who moved some of the former royal pliants into his state bedchamber at Fontainebleau. Further examples were ordered, in the newest Empire taste: Jacob-Desmalter's seats with members in the form of carved and gilded sheathed sabres were delivered to Saint-Cloud about 1805.One at the Victoria and Albert Museum is illustrated in Serge Grandjean, Empire Furniture, (London: Faber and Faber) 1966:fig. 7. Grandjean also illustrates a gilded curule seat from the former Grand Galerie, Malmaison, ca 1804 (fig. 5b); a painted one from Fontainebleau (fig. 31), and a walnut curule seat in Empire style, from Romagna (fig. 6). Cross-framed drawing-room chairs are illustrated in Thomas Sheraton's last production, The Cabinet-Maker, Upholsterer and General Artist's Encyclopaedia (1806), and in Thomas Hope's Household Furniture (1807)."]}, {"page": "Thomas Shearer", "response": ["There can be little doubt that Shearer exercised considerable influence over George Hepplewhite, with whom there is reason to suppose that he was closely associated, while Thomas Sheraton has recorded his admiration for work which has often been attributed to others. Shearer, in his turn, owes something to the Adam brothers, and something, no doubt, to the stock designs of his predecessors."]}, {"page": "X-chair", "response": ["The woodwork was nearly always completely covered with silk or velvet, and the seat was made up of loose cushions resting on the webbing between the side rails of the frames. The form was revived in the Neo-classical period (began c. 1760). It features in Thomas Sheraton's 1803 Cabinet Directory. It continued through the 19th century as a folding portable chair for use during campaigns or other outdoor pursuits."]}, {"page": "Washstand", "response": ["As the 18th century drew to its close the custom of using the same apartment as reception room by day and sleeping room by night produced a demand for what was called harlequin furniture pieces which were contrived a double or triple debt to pay. Thus a variety of complicated combination washstands and dressing tables were made, and fitted with mirrors and sometimes with writing conveniences and drawers for clothes. Thomas Sheraton developed astonishing ingenuity in devising a type of furniture which, if we may judge by the large number of examples still existing, must have become highly popular."]}, {"page": "Sheraton style", "response": ["Sheraton is a late 18th-century Neoclassical English furniture style, in vogue  1785–1820, that was coined by 19th-century collectors and dealers to credit furniture designer Thomas Sheraton, whose books, The Cabinet Dictionary (1803) of engraved designs and the Cabinet Maker's & Upholsterer's Drawing Book (1791) of furniture patterns exemplify this style. "]}, {"page": "1806 in art", "response": ["*22 October – Thomas Sheraton, English furniture designer (born 1751)"]}, {"page": "Decorative box", "response": ["In the Middle Ages people usually brought their own cutlery with them when eating away from home, and the more expensive types came with their own custom-made leather cases, stamped and embossed in various designs.  Later, as cutlery became provided by the host, decorative cases, especially for the knives, were often left on display in the dining-room. Some of the most elegant and often ornate were in the styles of Robert Adam, George Hepplewhite and Thomas Sheraton. Occasionally flat-topped containers, they were most frequently either rod-shaped, or tall and narrow with a sloping top necessitated by a series of raised veins for exhibiting the handles of knives and the bowls of spoons. Mahogany and satinwoods were most common, occasionally inlaid with marquetry, or edged with boxwood which was resistant to chipping. These receptacles, often made in pairs, still exist in large numbers; they are often converted into stationery cabinets. Another version is an open tray or rack, usually with a handle, also for the storage of table cutlery."]}, {"page": "1806 in the United Kingdom", "response": ["* 22 October – Thomas Sheraton, furniture designer (born 1751)"]}, {"page": "1791 in Great Britain", "response": ["* Thomas Sheraton's The Cabinet Maker and Upholsterer's Drawing-Book begins publication."]}, {"page": "1751 in art", "response": ["** Thomas Sheraton, English furniture designer (died 1806)"]}, {"page": "Lyre arm", "response": ["The term lyre chair is a closely associated design element also originating in motif from the Greek Classical period and appearing often in chair backs starting circa 1700 AD. In the lyre chair, the splat features a pair of single lyre scrolls with bilateral symmetry. This particular splat chair back was a favourite motif employed by the well known English furniture designer Thomas Sheraton.Colonial Furniture in America, Luke Vincent Lockwood, Scribner Publishers (1901) Sometimes a chair of this design is called a lyre back chair.", "Beyond the use of the lyre design in chairs, this motif is common in other decorative applications for furniture and other contents' accessories. In prehistoric Celtic design, the lyre is present in a number of works including a well preserved scabbard found in Antrim, Northern Ireland and now preserved in the Ulster Museum;Prehistoric Art in Europe, Nancy K. Sandars, 1968, Penguin Books this artifact has a bilaterally symmetric double lyre design. For example, in the Empire Period the lyre was commonly applied to mirrors, especially in the American Federal Period. In London in the late 18th century, Thomas Sheraton illustrated the lyre design for use in table supports.Colonial Furniture in America, Luke Vincent Lockwood, p 240, Scribner Publishers (1901) Another example of lyre supports in a table design is illustrated in History Of Furniture: Ancient to 19th Century, showing a small ebony table.History Of Furniture: Ancient to 19th Century, Michael Huntley, Sterling Publishing, 2003 Lockwood also documents that Sheraton enjoyed using a painted form of the lyre on furniture elements as decoration. Lockwood further illustrates a lyre supported games table from circa 1820 believed to have been produced by Duncan Phyfe.Colonial Furniture in America, Luke Vincent Lockwood, p. 244, Scribner Publishers (1901)"]}, {"page": "Luke Vincent Lockwood", "response": ["*Thomas Sheraton"]}, {"page": "1751 in Great Britain", "response": ["** Thomas Sheraton, furniture designer (died 1806)"]}, {"page": "Fitted carpet", "response": ["Thomas Sheraton wrote in 1806 that \"since the introduction of carpets, fitted all over the floor of a room, the nicety of flooring anciently practiced in the best houses, is now laid aside\". Fitted carpets, assembled from strips, had become popular by the second half of the 18th century, remaining so until the 1870s when loose carpets and varnished hardwood became the fashion."]}, {"page": "Close stool", "response": ["The close stool was sometimes called a necessary stool or a night stool. The eighteenth-century euphemism was convenience; the term was further euphemised in the nineteenth century with the term night commode, which John Gloag suggestedJohn Gloag, A Short Dictionary of Furniture, rev. ed. 1969, s.v. \"close stool, close stool chair\". may have derived its significance from a \"balance night stool\" described in Thomas Sheraton's Cabinet Dictionary (London, 1803). Sheraton's design was \"made to have the appearance of a small commode standing upon legs; when it is used the seat part presses down to a proper height by the hand, and afterwards it rises by means of lead weights, hung to the seat, by lines passing over pulleys at each end, all which are enclosed in a case.\" This appears to be the link between \"commode\" as an elegant article of French furniture, and \"commode\" as a prosaic invalid toilet. \"Close stool,\" in turn, is itself a euphemism for toilet chair. One meaning of commode survived into the twentieth century to refer to the flush toilet; \"toilet\" itself originally euphemistic."]}, {"page": "Klismos", "response": ["Such severely academic revivals might be compromised by more familiar features of the chair-maker's usual practice: an early 19th-century klismos chair by J.E. Höglander, StockholmNordiska Museet, Stockholm; illustrated in Wanscher 1966:376-77. has a padded backrest, supported on five slender colonettes,Colonnettes forming the rails of chairbacks had been a characteristic feature of Thomas Sheraton's The Cabinet-Maker and Upholsterer's Drawing-Book Part III 1793; plates 32-34, 36, all dated 1792, and the Appendix 1794; plates 25, 28, dated 1793, and 49, dated 1794. (Dover reprint, 1992). and the faces of the legs are lightly paneled."]}, {"page": "Ralph Carpenter", "response": ["Carpenter developed an interest in antiques that began as a way to acquire inexpensive furniture to fill his Scarsdale, New York apartment. He would visit dealers in Manhattan, purchasing items crafted by George Hepplewhite and Thomas Sheraton."]}, {"page": "Mallett Antiques", "response": ["Thomas Sheraton,"]}, {"page": "Gunby Hall", "response": ["The Hall contains significant collections of art, furniture, porcelain and silver including original pieces by Sir Joshua Reynolds, Edward Lear, William Morris, Lord Tennyson, William Holman Hunt, James Boswell, Samuel Johnson, Thomas Sheraton and Lucio Rannuci."]}]}}