{"wiki_id": "http://www.wikidata.org/entity/Q946732", "itemLabel": "Tony Aitken", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Aitken", "wikipedia_page": {"main": "Tony Aitken (born 20 June 1946) is an English actor, known for playing a variety of parts in popular television programmes.\nHe attended Belmont Abbey School, Hereford, 1959–64. He was active in the amateur dramatic society, appearing in many revues, plays and Gilbert and Sullivan productions. He acted with Neville Buswell another student at the school. Trained as a Drama and Art Teacher at St. Mary's University College, London 1964–67.\nOver a forty five year career in theatre and TV, he has appeared regularly in series such as The Sweeney(Thin Ice)’', Porridge, The Mistress, Agatha Christie's Poirot, Holby City, Casualty, End of Part One and No. 73, in films such as Robin Hood Junior, Jabberwocky, Quincy's Quest and The Remains of the Day in which he played the Postmaster.\nHis best-known role is perhaps as the \"Merry Balladeer\" in the closing titles of Blackadder II, in which he also played the madman (\"pity poor Tom\") in \"Money\".\nIn addition to his acting career, he now runs a broadcast audio studio, producing and voicing radio and TV commercials.\nIn 2011 he played the part of solicitor \"Ben Dean\" in several episodes of Coronation Street.\nHe played \"Professor Aubrey\" in the Feature Film \"The Arbiter\" 2013.", "link_mentions": [{"page": "1993 in film", "response": ["| The Remains of the Day || Columbia Pictures || James Ivory (director); Ruth Prawer Jhabvala (screenplay); Anthony Hopkins, Emma Thompson, James Fox, Christopher Reeve, Peter Vaughan, Hugh Grant, John Haycraft, Michael Lonsdale, Jeffry Wickham, Paula Jacobs, Ben Chaplin, Abigail Harrison, Rupert Vansittart, Patrick Godfrey, Peter Halliday, Peter Cellier, Peter Eyre, Terence Bayler, Tony Aitken, Tim Pigott-Smith, Lena Headey, Paul Copley, Pip Torrens, Brigitte Kahn, Wolf Kahler || Period, Drama || Live action"]}, {"page": "The Sweeney", "response": ["*Tony Aitken(thin ice)"]}, {"page": "Blackadder II", "response": ["The closing titles use a different arrangement of the theme, sung by countertenor Jeremy Jackman,Biography , Jeremy Jackman. Retrieved 29 January 2011 with lyrics (usually insulting Blackadder) that reflect the events of the preceding episode. The song is played over a shot of Blackadder strolling through a formal garden and being annoyed by the lute-wielding minstrel (Tony Aitken). This sequence was incorporated as a separate subplot, with Blackadder constantly attempting to apprehend the musician each time with limited success. At the end of the final episode, Blackadder catches the minstrel and repeatedly dunks him in a fountain.Credits at IMDb.com. Retrieved 17 March 2007"]}, {"page": "List of Blackadder characters", "response": ["*Tom the Balladeer (Tony Aitken) – a minstrel who sings songs about the continued failures of Lord Edmund Blackadder (Elizabethan). Other than a brief scene in \"Money\", the minstrel appeared only in the closing credits of each episode of Blackadder II, in the first episodes he annoys Blackadder, and gets hunted in the later episodes. In one episode, the minstrel appeared before Blackadder (coincidentally, the same one in which he had a brief appearance). In the last episode, Blackadder caught the minstrel and possibly drowned him. (Blackadder II)"]}, {"page": "Listen with Mother", "response": ["Listen with Mothers final week's programmes (widely reported in the press) featured Wriggly Worm stories, presented by Nerys Hughes and Tony Aitken and directed by David Bell. These stories were broadcast on the Listen with Mother programmes throughout the 1970s and early 1980s."]}, {"page": "End of Part One", "response": ["The cast included Sue Holderness, Denise Coffey, Fred Harris, Dudley Stevens, David Simeon, and Tony Aitken. Coffey had appeared in The Burkiss Way's first 6 episodes, but Harris was the only permanent cast member to appear in End of Part One. One of the directors was future feature film director Geoffrey Sax."]}, {"page": "Money (Blackadder)", "response": ["* Tony Aitken as the Mad Beggar"]}, {"page": "The Mistress (TV series)", "response": ["*Tony Aitken – Simon "]}, {"page": "No. 73", "response": ["New regular visitors (i.e. cast members) included Fred the Postman (Tony Aitken) – who had a thing for Ethel for a while, Tony Deal (Nick Wilton) – the local confidence trickster always trying to sell Ethel everything and anything, and Eazi Target (Tony Hippolyte) – Ethel's friend from her days at the paper. With Colin Daly holding his Supersleuth competition over several episodes dressed like Sherlock Holmes, there was certainly no shortage of silly-looking characters around. Meanwhile, Dawn had her rollerboots spraypainted by Paul King (as per King's music video \"Love and Pride\").", "Having missed out of the first production, four other prominent members of the revolving No 73 cast got a 1920s murder mystery of their own, inspired by, if not exactly written by Agatha Christie. Kim (Kim Goody), Martin (Richard Addison), Hazel (Jeannie Crowther) and Fred (Tony Aitken) divided all speaking parts between them, though they started off with considerably fewer characters than the Roman production, and the cast-list predictably grew slimmer by the episode."]}, {"page": "Sharpe's Justice", "response": ["* Tony Aitken – Horse Guards Clerk"]}, {"page": "List of EastEnders characters (1992)", "response": ["| Tony Aitken "]}, {"page": "Scoop (TV series)", "response": ["Guest Stars: Stephen Bent as Sergeant Bluster and Tony Aitken as Colonel Winters.", "Guest Stars: Mina Anwar as Selina Sharp and Tony Aitken as Jack.", "Guest Stars: Mina Anwar as Selina Sharp and Tony Aitken as the judge."]}, {"page": "Quincy's Quest", "response": ["* Tony Aitken ...  Teddy / Father Christmas "]}, {"page": "List of Coronation Street characters (2011)", "response": ["| Tony Aitken"]}, {"page": "No Peace for the Wicked", "response": ["| Tony Aitken"]}, {"page": "Married Love (Upstairs, Downstairs)", "response": ["* Tony Aitken (Mulligan)"]}, {"page": "List of Jackanory episodes", "response": ["|2767|| The Eggbox Brontosaurus: Part 1 - Two Down, 249,998 to Go || Michael Denton || Tony Aitken || 01-Feb-82", "|2768|| The Eggbox Brontosaurus: Part 2 - Questing for Beginners || Michael Denton || Tony Aitken || 02-Feb-82", "|2769|| The Eggbox Brontosaurus: Part 3 - In Search of the Lost Page || Michael Denton || Tony Aitken || 03-Feb-82", "|2770|| The Eggbox Brontosaurus: Part 4 - The Egg-citing End || Michael Denton || Tony Aitken || 04-Feb-82", "|2822|| Writing Competition Winners: Travel || Stories written by Children || Tony Aitken/Wendy Padbury || 08-Nov-82", "|2823|| Writing Competition Winners: Food || Stories written by Children || Tony Aitken/Pam Ayres || 09-Nov-82", "|2824|| Writing Competition Winners: Animals || Stories written by Children || Tony Aitken/Jonny Morris || 10-Nov-82", "|2825|| Writing Competition Winners: Magic and Mystery || Stories written by Children || Tony Aitken/Maureen Lipman || 11-Nov-82", "|2826|| Writing Competition Winners: Sport || Stories written by Children || Tony Aitken/Angela Bruce || 12-Nov-82", "|2968|| The Brontosaurus Birthday Cake || Robert McCrum || Tony Aitken || 16-Jan-84", "|2970|| The Magician and the Petnapping/The Magician and the Dragon || David McKee || Tony Aitken || 18-Jan-84"]}]}}