{"wiki_id": "http://www.wikidata.org/entity/Q946210", "itemLabel": "Leo Genn", "itemDescription": "British actor (1905-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_Genn", "wikipedia_page": {"main": "Leopold John \"Leo\" Genn (9 August 1905 – 26 January 1978) was an English actor and barrister. He played Petronius in the 1951 film Quo Vadis, which earned him an Academy Award for Best Supporting Actor nomination.", "link_mentions": [{"page": "August 9", "response": ["*1905 – Leo Genn, British actor and barrister (d. 1978)"]}, {"page": "1905", "response": ["* August 9 – Leo Genn, English actor (d. 1978)"]}, {"page": "1978", "response": ["* January 26 – Leo Genn, English actor and barrister (b. 1905)"]}, {"page": "Mrs. Miniver (character)", "response": ["In 1960, CBS Television presented Mrs. Miniver starring Maureen O'Hara as Mrs Miniver, Leo Genn as Clem Miniver, Juliet Mills and Keir Dullea."]}, {"page": "The Forsyte Saga", "response": ["There have been various BBC radio dramatisations. The first was probably a radio production of The Man of Property  in 11 weekly parts commencing 9 December 1945 on the BBC Home Service. The music used as the opening and closing theme came from Edward Elgar's Enigma Variations, specifically the Nimrod variation. This adaptation starred Leo Genn as Jo, Grizelda Hervey as Irene and Ronald Simpson as Soames.  It was adapted by Muriel Levy and produced by Val Gielgud and Felix Felton. Young Jolyons in later adaptations included Andrew Cruickshank, Leo Genn and Guy Rolfe. Another production of the dramatised cycle, which had Rachel Gurney as Irene, Noel Johnson as Young Jolyon and Alan Wheatley as Soames, came soon after the 1967 TV series. The version broadcast in 1990 comprised a 75-minute opening episode followed by 22 hour-long episodes, entitled The Forsyte Chronicles. It was the most expensive radio drama serial ever broadcast, due to its length and its big-name cast, which included Dirk Bogarde, Diana Quick, Michael Williams and Alan Howard. This radio series was rerun on BBC 7 radio in 2004, and has been released commercially."]}, {"page": "The Ten Commandments (1956 film)", "response": ["Many actors were considered for the role of the evil overseer Dathan, including Raymond Burr, Lee J. Cobb, Leo Genn, Victor Jory, Fredric March, Raymond Massey, Stephen McNally, Gary Merrill, Arnold Moss, Robert Newton, Hugh O'Brian, Jack Palance, Eric Pohlmann, Basil Rathbone, Dale Robertson, Robert Ryan, George Sanders, Everett Sloane, and Peter Ustinov. DeMille was enthusiastic about Jack Palance as Dathan, but Palance's agent angered DeMille when he stole a part of the script and demanded that the part be rewritten. Raymond Massey was signed for the role but later turned it down. DeMille then chose Edward G. Robinson, who was blacklisted in Hollywood. In his autobiography, Robinson remembered, \"Mr. DeMille ... felt I had been done an injustice, and told his people to offer me the part. Cecil B. DeMille returned me to films. Cecil B. DeMille restored my self-respect.\""]}, {"page": "The Snake Pit", "response": ["The Snake Pit is a 1948 American psychological drama film directed by Anatole Litvak and starring Olivia de Havilland, Mark Stevens, Leo Genn, Celeste Holm, Beulah Bondi, and Lee Patrick.Variety film review; November 3, 1948, page 11.Harrison's Reports film review; November 6, 1948, page 179. Based on Mary Jane Ward's 1946 semi-autobiographical novel of the same name, the film recounts the tale of a woman who finds herself in an insane asylum and cannot remember how she got there.", "|Leo Genn || Dr. Mark H. Van Kensdelaerik/\"Dr. Kik\"Dr. Kik is never referred to by his family name."]}, {"page": "Mourning Becomes Electra", "response": ["In 1947 the play was adapted for film by Dudley Nichols, starring Rosalind Russell, Michael Redgrave, Raymond Massey, Katina Paxinou, Leo Genn and Kirk Douglas. It was nominated for Academy Awards for Best Actor in a Leading Role (Michael Redgrave) and Best Actress in a Leading Role (Rosalind Russell)."]}, {"page": "Quo Vadis (1951 film)", "response": ["The film stars Robert Taylor, Deborah Kerr, Leo Genn, and Peter Ustinov, and features Patricia Laffan, Finlay Currie, Abraham Sofaer, Marina Berti, Buddy Baer, and Felix Aylmer. Anthony Mann worked on the film for four weeks as an uncredited second-unit director. Sergio Leone was an uncredited assistant director of Italian extras. Future Italian stars Sophia Loren and Bud Spencer appeared as uncredited extras. The film was nominated for eight Academy Awards (though it won none), and it was such a huge box office success that it was credited with single-handedly rescuing MGM from the brink of bankruptcy.", "Quo Vadis was nominated for eight Academy Awards: twice for Best Actor in a Supporting Role (Leo Genn as Petronius and Peter Ustinov as Nero), and for Best Art Direction-Set Decoration, Color (William A. Horning, Cedric Gibbons, Edward Carfagno, Hugh Hunt), Best Cinematography, Color, Best Costume Design, Color, Best Film Editing, Best Music, Scoring of a Dramatic or Comedy Picture, and Best Picture. However, the movie did not win in any categories."]}, {"page": "1978 in film", "response": ["| style=\"text-align:center;\"| 26 || Leo Genn || style=\"text-align:center;\"| 72 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1966 in film", "response": ["* Circus of Fear, starring Christopher Lee, Leo Genn, Klaus Kinski– (U.K.)"]}, {"page": "1956 in film", "response": ["*Moby Dick, directed by John Huston, starring Gregory Peck, Richard Basehart, Leo Genn"]}, {"page": "1951 in film", "response": ["*Quo Vadis, directed by Mervyn LeRoy, starring Robert Taylor, Deborah Kerr, Peter Ustinov and Leo Genn"]}, {"page": "1950 in film", "response": ["*The Wooden Horse, starring Leo Genn and Anthony Steel – (GB)"]}, {"page": "Coventry Cathedral", "response": ["The BBC broadcast a documentary in 1962 entitled Act of Faith, narrated by Leo Genn, detailing the history of Coventry Cathedral, its destruction and rebuilding."]}, {"page": "St Catharine's College, Cambridge", "response": ["|Leo Genn"]}, {"page": "Miklós Rózsa", "response": ["The music earned him his first Academy Award nomination. While Korda remained in Hollywood, Rózsa was effectively the music director of his organization. In his capacity he supervised the scoring of To Be or Not to Be (1942) and contributed at least one sequence of his own music. His own U.S. scores for Korda included Lydia (1940), That Hamilton Woman (1941), and The Jungle Book (1942). From the last of these emerged The Jungle Book Suite for narrator and orchestra, which became popular as narrated by the film's star, Sabu, and was soon recorded in New York by RCA. The 78-rpm album became the first substantial recording of Hollywood film music. It was later recorded with Rózsa conducting the Frankenland State Orchestra of Nuremberg and Leo Genn as narrator."]}, {"page": "The Children's Hour (play)", "response": ["| Dr. Joseph Cardin || Robert Keith || Leo Genn || Joel McCrea || Robert Pastene || James Garner"]}, {"page": "The Virginian (TV series)", "response": ["The first episode of season two (\"Ride a Dark Trail\") featured Royal Dano. After that, such stars as Broderick Crawford (2.4, \"A Killer in Town\"), Robert Redford (2.5, \"The Evil That Men Do\"), Albert Salmi (2.7, \"Brother Thaddeus\"), Warren Oates (2.10, \"Stopover in a Western Town\"), Yvonne De Carlo (2.12, \"A Time Remembered\"), Leonard Nimoy and DeForest Kelley (2.14, \"A Man Of Violence\"), Leo Genn (2.18, \"The Thirty Days of Gavin Heath\"), Bruce Dern (2.20, \"First to Thine Own Self\"), John Agar, Sheree North, Dennis Holmes, and Ross Elliott (2.24, \"Another's Footsteps\"), and Peter Breck and Bruce Dern (2.25, \"Rope of Lies\") were listed."]}, {"page": "The Wednesday Play", "response": ["| Leo GennBarbara MurrayRachel ThomasBilly RussellSheila Dunn"]}, {"page": "55 Days at Peking", "response": ["The film was directed primarily by Nicholas Ray, although Guy Green and Andrew Marton took over in the latter stages of filming after Ray had fallen ill. Both men were uncredited. It stars Charlton Heston, Ava Gardner, and David Niven, with supporting roles by Flora Robson, John Ireland, Leo Genn, Robert Helpmann. Harry Andrews, and Kurt Kasznar. It also contains the first known screen appearance of future martial arts film star Yuen Siu Tien. Japanese film director Juzo Itami, credited in the film as \"Ichizo Itami, appears as Col. Goro Shiba.", "* Leo Genn as Gen. Jung-Lu"]}, {"page": "The Wooden Horse", "response": ["The Wooden Horse is a 1950 British Second World War war film directed by Jack Lee and starring Leo Genn,  David Tomlinson and Anthony Steel. It is based on the book of the same name by Eric Williams, who also wrote the screenplay.Williams, Eric, The Wooden Horse (Collins, 1949)", "* Leo Genn as Peter Howard", "Ian Dalrymple and Jack Lee read the book and bought the film rights. They out-bid John Mills who also wanted to make it. \"I expect John would have been very good in it also,\" said Jack Lee \"probably better than Leo Genn, who was very stolid as an actor.\"", "Leo Genn played the Eric Williams character while Anthony Steele played a character based on Michael Codner. Codner was later killed in 1952 in an ambush during the Malayan Emergency."]}, {"page": "Contraband (1940 film)", "response": ["Contraband (1940) is a wartime spy film by the British director-writer team of Michael Powell and Emeric Pressburger, which reunited stars Conrad Veidt and Valerie Hobson after their earlier appearance in The Spy in Black the previous year. On this occasion, Veidt plays a hero, something he did not do very often, and there is also an early (uncredited) performance by Leo Genn.", "*Leo Genn and Peter Bull as two of Van Dyne's associates"]}, {"page": "The Longest Day (film)", "response": ["The Longest Day features a large international ensemble cast including John Wayne, Kenneth More, Richard Todd, Robert Mitchum, Richard Burton, Steve Forrest, Sean Connery, Henry Fonda, Red Buttons, Peter Lawford, Eddie Albert, Jeffrey Hunter, Stuart Whitman, Tom Tryon, Rod Steiger, Leo Genn, Gert Fröbe, Irina Demick, Bourvil, Curd Jürgens, George Segal, Robert Wagner, Paul Anka, and Arletty. Many of these actors played roles that were essentially cameo appearances. In addition, several cast members had seen action as servicemen during the war, including Albert, Fonda, Genn, More, Steiger, and Todd; Todd was among the first British officers to land in Normandy in Operation Overlord, and he participated in the assault on Pegasus Bridge.", "|Leo Genn"]}, {"page": "Caesar and Cleopatra (film)", "response": ["* Leo Genn as Bel Affris"]}, {"page": "Constable of France", "response": ["Various versions of Shakespeare's play Henry V depict Constable Charles d'Albret, Comte de Dreux, who was appointed by Charles VI of France and was killed in the Battle of Agincourt (1415). He is played by Leo Genn in the 1944 film, by Richard Easton in the 1989 film, and by Maxime Lefrancois in the 2012 film. In the 1944 film he dies in personal combat with King Henry. In the 1989 film he is depicted as falling from his horse into the mud (historical tradition holds he was drowned in the mud due to the weight of his armour, disabled by having his horse fall on him). In the 2012 film he is shot by a longbowman after stabbing the Duke of York in the back in woodland away from the main battle."]}, {"page": "Susan Oliver", "response": ["Oliver did numerous television shows in 1957, and appeared on stage. She began the year with an ingénue part, as the daughter of an 18th-century Manhattan family, in her first Broadway play, Small War on Murray Hill, a Robert E. Sherwood comedy.The play's opening night at the Ethel Barrymore Theatre was on January 3, 1957, and 12 performances later, closing night was January 12. Leo Genn performed as General Howe. That same year, Oliver replaced Mary Ure as the female lead in the Broadway production of John Osborne's play Look Back in Anger."]}, {"page": "Play of the Month", "response": ["|Leo Genn,Rachel Kempson,Glenda Jackson,Andrew Ray,Geraldine Sherman,Christopher Gable,Tessa Shaw,Daphne Heard,Mary Healey,John Tordoff,Caroline Hunt"]}, {"page": "The Girls of Pleasure Island", "response": ["* Leo Genn - Roger Halyard"]}, {"page": "Green for Danger (film)", "response": ["Later,  Sister Bates (Judy Campbell) claims to have evidence that Higgins was murdered, but before she can show anyone, she is stabbed to death herself by someone in a surgical gown. Scotland Yard Inspector Cockrill (Alistair Sim) is assigned to investigate. Maintaining a cheerful attitude about the serious business at hand, he declares happily that there are just five obvious suspects: Barnes; the surgeon, Mr Eden (Leo Genn); and three nurses, Freddi Linley (Sally Gray), Esther Sanson (Rosamund John), and Woods (Megs Jenkins). His investigation is hampered by the conflict between Barnes and Eden because of their competition for the affections of Linley. Some pills are revealed to be missing.", "*Leo Genn as Mr. Eden"]}, {"page": "Moby Dick (1956 film)", "response": ["Moby Dick is a 1956 color film adaptation of Herman Melville's 1851 novel Moby-Dick. It was directed by John Huston with a screenplay by Huston and Ray Bradbury. The film starred Gregory Peck, Richard Basehart, and Leo Genn."]}, {"page": "Harry Alan Towers", "response": ["| Shirley Eaton, Hugh O'Brian, Stanley Holloway, Dennis Price, Wilfrid Hyde-White, Daliah Lavi, Leo Genn, Fabian Forte, Marianne Hoppe, Mario Adorf", "| Christopher Lee, Leo Genn, Heinz Drache, Klaus Kinski, Margaret Lee, Suzy Kendall, Cecil Parker, Eddi Arent", "| Christopher Lee, Maria Schell, Leo Genn, Margaret Lee"]}, {"page": "Ten Little Indians (1965 film)", "response": ["| Leo Genn || Sir John Mandrake B.C. || General || Five soldiers (subordinates) || John Gordon Macarthur"]}, {"page": "Ashenden: Or the British Agent", "response": ["*1966, Ashenden – Secret Agent 1914-1918: The Hairless Mexican in five episodes, adapted by Howard Agg, produced by George Angell and read by Leo Genn.BBC Genome: Ashenden – Secret Agent 1914-1918: The Hairless Mexican (1966)", "*1967, Ashenden – Secret Agent 1914-1918: Giulia Lazzari in five episodes, adapted by Howard Agg, produced by George Angell and read by Leo Genn.BBC Genome: Ashenden – Secret Agent 1914-1918: Giulia Lazzari (1967)"]}, {"page": "The Way Ahead", "response": ["* Leo Genn as Captain Edwards"]}, {"page": "Khartoum (film)", "response": ["Khartoum is a 1966 British epic war film written by Robert Ardrey and directed by Basil Dearden. It stars Charlton Heston as British Gen. Charles \"Chinese\" Gordon and Laurence Olivier as Muhammad Ahmed (a Sudanese leader whose devotees proclaimed him the Mahdi), with a supporting cast that includes Richard Johnson and Ralph Richardson. The film is based on historical accounts of Gordon's defence of the Sudanese city of Khartoum from the forces of the Mahdist army, during the 1884–1885 Siege of Khartoum.Duiker and Spielvogel, 2015, p. 621 The opening and closing scenes are narrated by Leo Genn."]}, {"page": "Another Man's Poison", "response": ["March 1951 Bette Davis and Gary Merrill were stars; Merrill replaced Leo Genn who had been cast.  Merrill wrote in his memoirs that neither he nor Davis had particularly liked the script, but were attracted by the chance to work together in England, and by a large fee; Davis was also pleased by the fact the cast would include Emlyn Williams, who wrote the original play on which Davis' 1945 film The Corn Is Green was based.Merrill, p. 97."]}, {"page": "Anthony Steel (actor)", "response": ["Steel's roles up until then had been essentially bit parts. His first big break was being cast as one of three British POWs who escape from a camp in The Wooden Horse (1950). This film, based on a true story, was the third most popular film at the British box office in 1950 and established Steel as a leading man. Director Jack Lee said that the actor \"was fine to work with, just a physical type, a young chap who could do certain things, though he didn't have much acting to do in this.\" He was paid £15 a week. \"[Co star] Leo Genn was getting thousands,\" Steel recalled. \"It made me pretty mad.\""]}, {"page": "The Delhi Way", "response": ["The Delhi Way is a 1964 documentary about Delhi produced, written, photographed and directed by James Ivory.   It is narrated by Leo Genn."]}, {"page": "Howards End", "response": ["A British television adaptation of the novel in the BBC's Play of the Month series was broadcast in 1970, and starred Leo Genn, Sarah-Jane Gwillim, and Glenda Jackson."]}, {"page": "The Sacred Flame (play)", "response": ["In 1966 a major production was presented in the West End starring Gladys Cooper, this time in the role of Mrs Tabret, alongside Wendy Hiller and Leo Genn. There were no major productions between 1967 and 2012, when English Touring Theatre presented a new production for a UK tour."]}, {"page": "The Seventh Veil", "response": ["In 1951, Ann Todd, Leo Genn (playing the Mason role), and Herbert Lom appeared in a stage adaptation of the same title in London."]}, {"page": "Die Screaming, Marianne", "response": ["* Leo Genn as The Judge"]}]}}