{"wiki_id": "http://www.wikidata.org/entity/Q946578", "itemLabel": "Francis Seymour Haden", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Seymour_Haden", "wikipedia_page": {"main": "Sir Francis Seymour Haden  PPRE (16 September 1818 – 1 June 1910), was an English surgeon, best known as an original etcher who championed original printmaking. He was at the heart of the Etching Revival in Britain, and one of the founders of the Society of Painter-Etchers, now the Royal Society of Painter-Printmakers, as its first president.  He was also a collector and scholar of Rembrandt's prints.\n\n", "link_mentions": [{"page": "Printmaking", "response": ["Francis Seymour Haden,"]}, {"page": "Charles Meryon", "response": ["*Francis Seymour Haden, Notes on Etching "]}, {"page": "London Necropolis Company", "response": ["In the wake of public concerns following the cholera epidemic and the findings of the Royal Commission, the Act to Amend the Laws Concerning the Burial of the Dead in the Metropolis (Burials Act) was passed in 1851. Under the Burials Act, new burials were prohibited in what were then the built-up areas of London. Seven large cemeteries had recently opened a short distance from London or were in the process of opening, and temporarily became London's main burial grounds. A proposal by Francis Seymour Haden to ship the bodies of London's dead to the Thames Estuary for use in land reclamation met with little approval, and the government sought alternative means to prevent the constantly increasing number of deaths in London from overwhelming the new cemeteries in the same manner in which it had overwhelmed the traditional burial grounds."]}, {"page": "John Callcott Horsley", "response": ["Horsley remarried to Rosamund Haden who came from a family of distinguished surgeons—her father Charles Haden had a practice in Sloan Street and her brother Francis Seymour Haden was a surgeon and etcher who founded the Royal Society of Painters, Etchers and Engravers in 1880. Rosamund gave birth to Walter (1855), Hugh (1856), Victor (1857), Emma (1858), Fanny (1859), Gerald (1862) and Rosamund (1864). Gerald grew up to be an architect, Walter an artist also studying at the RA Schools, and Victor a surgeon. Sir Victor Horsley (born 1857), became famous as a surgeon and neuropathologist, and a prominent supporter of the cause of experimental research. Hugh and Emma died of scarlet fever."]}, {"page": "List of University of Paris people", "response": ["* Francis Seymour Haden (1818–1910), English surgeon, best known as an etcher"]}, {"page": "Frank Short", "response": ["Short was elected a member of the Royal Society of Painter-Etchers and Engravers in 1885, and took a prominent part in conducting its affairs, becoming assessor (vice-president) in 1902. In 1910 he succeeded Sir Francis Seymour Haden as its second president for 28 years, steering the society through the First World War and the end of the etching revival of the 1920s and its crash from 1929."]}, {"page": "1893 in South Africa", "response": ["**  July–September : Francis Seymour Haden"]}, {"page": "Albert Fitch Bellows", "response": ["Bellows also mastered etching—along with Samuel Colman he was possibly the only other Hudson River School artist to do so—and became a member of the New York Etching Club, the Philadelphia Society of Etchers and the Royal Society of Painter-Etchers and Engravers in London, England, an esteemed professional organization whose members included James Abbott McNeill Whistler and Francis Seymour Haden."]}, {"page": "Etching revival", "response": ["The steel-facing of plates was a technical development patented in 1857 which \"immediately revolutionized the print business\".Griffiths, 154-155  It allowed a very thin coating of iron to be added to a copper plate by electroplating.  This made the lines on the plates much more durable, and in particular the fragile \"burr\" thrown up by the drypoint process lasted much better than with copper alone, and so a greater (if still small) number of rich, burred, impressions could be produced.  Francis Seymour Haden and his brother-in-law, the American James McNeill Whistler were among the first to exploit this, and drypoint became a more popular technique than it had been since the 15th century, still often combined with conventional etching.  However, steel-facing could lead to a loss of quality.Mayor, 125; Griffiths, 71, 76, 154-155  It is not to be confused with steel engraving on wholly iron plates, popular in the same period but almost always for mezzotints and commercial printing.Griffiths, 154 ", "For Hamerton and others, the father of the British Etching Revival was Francis Seymour Haden, the surgeon etcher, who, with his brother-in-law, the American, James McNeill Whistler, produced a body of work starting around 1860 that still stands as one of the highpoints of etching history.  Haden was a collector and authority on the etchings of Rembrandt and it comes as no surprise that as Whistler, the younger man, began to show signs of veering far from the 17th-century model, Haden and he parted company.  Figures from other countries included Edvard Munch in Norway,Carey, 218, 248; Griffiths, 21, 106, 117 Anders Zorn in Sweden, and Käthe Kollwitz in Germany.Carey, 218, 230 "]}, {"page": "List of Old Gowers", "response": ["*Sir Francis Seymour Haden (OG ?-?), English etcher, writer and surgeon"]}, {"page": "Seymour Haden", "response": ["#redirectFrancis Seymour Haden"]}, {"page": "Sir Seymour Haden", "response": ["#redirectFrancis Seymour Haden"]}, {"page": "List of people educated at Christ's Hospital", "response": ["*Francis Seymour Haden – Etcher and surgeon"]}, {"page": "Royal Society of Painter-Printmakers", "response": ["The Society was established on 31 July 1880 at 38 Hertford Street, Mayfair, London, as the Society of Painter-Etchers for the promotion of original etching as a creative art form, inspired by the French group of the same name which existed in Paris.  The first six Fellows, all elected at this formation were Francis Seymour Haden (English, 1818–1910); Heywood Hardy (English, 1852–1926); Hubert von Herkomer RA (German/English, 1849–1914); Alphonse Legros (French, 1837–1911); Robert Walker Macbeth RA, (Scottish, 1848–1910), and James Tissot (French, 1836–1902). Samuel Palmer (English, 1805–1881) – the only painter-etcher to be granted a posthumous Honorary Fellowship of the RE – was terminally ill at the time of the Society’s formation, otherwise would have been approached. James McNeill Whistler (American, 1834–1903) who was in Venice at the time of the RE’s founding, had a row with his brother-in-law, Haden, and was not invited to join. Letters in support were written to the fledging Society by Frederick Leighton, then President of the Royal Academy, John Ruskin, Charles Dickens, John Everett Millais, and Auguste Rodin, amongst others. This Society achieved its Royal Charter granted by Queen Victoria in 1888 who bestowed on the President a gold chain of office, becoming the Royal Society of Painter-Etchers and in 1898 this was enlarged to include Engravers. Fellow, George W. Eve, designed a new Associates and Fellows diploma in 1893 and 1904.Viner, George H. (1916) A descriptive catalogue of the bookplates designed and etched by George W. Eve, R.E. Kansas City: The American Bookplate Society, p. 7.", "The Royal Society of Painter-Printmakers (formerly Royal Society of Painter-Etchers and Engravers) has had thirteen presidents (PRE) in total since 1880.  They were: Sir Francis Seymour Haden (founder and PRE from 1880–1910), Professor Sir Francis Job Short (PRE from 1910–1938), Professor Malcolm Osborne MBE (PRE from 1938–1962), Professor Robert Austin (PRE from 1962–1970), Paul Drury (PRE from 1970–1975), Harry Eccleston OBE (PRE from 1975–1989), and Joseph Winkelman (PRE from 1989–1991), when the Society was renamed. Winkelman continued as President until 1995. Presidents elected by Members after this were Dr David Carpanini (PRE from 1995–2003), Anita Klein (PRE from 2003–2006), Hilary Paynter (PRE from 2006–2011), Dr Bren Unwin (PRE from 2011–2013), Mychael Barratt (PRE from 2013–2018)."]}, {"page": "List of Old Derbeians", "response": ["*Sir Francis Seymour Haden (1818–1910), surgeon and artistThe Derby School Register, 1570-1901, ed. Benjamin Tacchella (London, 1902)Haden, Sir Francis Seymour [pseud. H. Dean] (1818–1910), etcher and surgeon by A. M. Hind & E. Chambers in Dictionary of National Biography (Oxford University Press, 2004)"]}, {"page": "Charles Haden", "response": ["* Charles Thomas Haden, father of Sir Francis Seymour Haden"]}, {"page": "Symphony in White, No. 1: The White Girl", "response": ["It was also in London that Whistler met Joanna Heffernan, the model who would become his lover. Their relationship has been referred to as a \"marriage without benefit of clergy.\"Weintraub (1974), p. 71. By 1861, Whistler had already used her as a model for another painting. Wapping, named after Wapping in London where Whistler lived, was begun in 1860, though not finished until 1864. It shows a woman and two men on a balcony overlooking the river. According to Whistler himself, the womanportrayed by Heffernanwas a prostitute.Spencer (1998), p. 306. Heffernan supposedly had a strong influence over Whistler; his brother-in-law Francis Seymour Haden refused a dinner invitation in the winter of 1863–64 due to her dominant presence in the household.Spencer (1998), p. 309."]}, {"page": "Symphony in White, No. 2: The Little White Girl", "response": ["It was also in London that Whistler met Joanna Hiffernan, the model who would become his lover. Their relationship has been referred to as a \"marriage without benefit of clergy.\"Weintraub (1974), p. 71. By 1861, Whistler had already used her as a model for other paintings. In Wapping, painted between 1860 and 1864, Hiffernan (according to Whistler) portrayed a prostitute.Spencer (1998), p. 306. The direct precursor of The Little White Girl was a painting created in the winter of 1861–62, initially called The White Girl and later renamed Symphony in White, No. 1.Craven (2003), pp. 342–3. Hiffernan supposedly had a strong influence over Whistler; his brother-in-law Francis Seymour Haden refused a dinner invitation in the winter of 1863–64 due to her dominant presence in the household.Spencer (1998), p. 309."]}, {"page": "Symphony in White, No. 3", "response": ["It was also in London that Whistler met Joanna Heffernan, the model who would become his lover. By 1865, Whistler had already used her as a model for other paintings, among these Symphony in White, No. 1 and Symphony in White, No. 2. Heffernan supposedly had a strong influence over Whistler; his brother-in-law Francis Seymour Haden refused a dinner invitation in the winter of 1863–64 due to her dominant presence in the household.Spencer (1998), p. 309. In January 1864, Whistler's mother Annalater depicted in the painting Arrangement in Grey and Blackarrived to stay with her son in London. As a result, Heffernan had to move out of the apartment, and only visited as a model.Anderson & Koval (1994), pp. 41–3. Still, Heffernan's presence displeased Whistler's mother, and his relationship with both women became strained.Weintraub (1974), pp. 89–90."]}, {"page": "Edwin Edwards (artist)", "response": ["Edwards was inspired to become an etcher by the French artist Henri Fantin-Latour, whom he first met  in Paris in 1861. Fantin-Latour made a return visit to Edwards at his Sunbury-on-Thames home and legend has it Edwards decided to become an artist that instant.The Connoisseur, Volume 12 (1905) Edwards went on to become a successful landscape painter and etcher, based in Sunbury and London. His subjects were mainly views in the south of England, especially Devon and Cornwall.Wood, C. The Dictionary of Victorian Painters (Antique Collectors Club, 1978) He was well connected within European artistic circles, befriending and being encouraged in particular by Alphonse Legros and James McNeil Whistler, the latter also sharing a passion for vocal music. In 1861 Edwards made an etching trip along the Thames with Whistler, Fantin-Latour and Francis Seymour Haden during which he executed a portrait of Whistler sketching, seated, at Moulsey lock.From realism to symbolism: Whistler and his world (Columbia University, 1971) Charles Keene was also a friend of Edwards as well as Jacques-Emile Blanche, Édouard Manet, Swinburne and Jacquemart.Clement, W. Portraits of a lifetime (J.M. Dent & Sons ltd., 1937)"]}, {"page": "The Etching Club", "response": ["*Francis Seymour Haden"]}, {"page": "Haden (name)", "response": ["*Sir Francis Seymour Haden, (1818-1910), English surgeon and etcher"]}, {"page": "Gabrielle D. Clements", "response": ["Clements painted sea, city and landscapes of places in the United States, like Cape Ann, Massachusetts and Baltimore, Maryland and other locations along the American East Coast. She also captured foreign destinations, like Palestine, Algiers, and France. During her career, her work was exhibited at a number of venues, some of which are the Museum of Fine Arts, Boston, National Academy of Design, Philadelphia Society of Artists, National Museum of American History, and New York Etching Club. Clements' etchings were exhibited at international exhibitions alongside the works of Francis Seymour Haden and James Abbott McNeill Whistler. Clement exhibited her work at the Woman's Building and the Pennsylvania State Building at the 1893 World's Columbian Exposition in Chicago, Illinois. She also exhibited at the  Louisiana Purchase Exposition of 1904, and the Sesquicentennial Exposition in 1926."]}, {"page": "Charles William Sherborn", "response": ["In 1872 he decided to work independently as an etcher and engraver, mainly reproducing contemporary portraits and subject paintings, and designing bookplates, the latter of which would later form the bulk of his work. He also made original etchings of London, and was a regular exhibitor at the Royal Academy. He was a close friend of Sir Francis Seymour Haden, co-founder of the Royal Society of Painter-Etchers and Engravers, and was elected a fellow of that society in 1884. Before his death, he presented a complete set of his works to the British Museum."]}, {"page": "1890 Birthday Honours", "response": ["*Francis Seymour Haden, Colonial Secretary of Natal. "]}, {"page": "1894 Birthday Honours", "response": ["*Francis Seymour Haden, President of the Royal Society of Painter Etchers."]}, {"page": "Charles Stokes (collector)", "response": ["His circle of acquaintance was large and distinguished, and ranged over the arts and the sciences. He knew in person or exchanged letters with: Louis Agassiz (1807–1873), Swiss-American biologist and geologist; Charles Babbage (1791–1871), British computer pioneer; George Back (1796–1878), Royal Navy officer, explorer of the Canadian Arctic, naturalist and artist; Francis Baily (1774–1844), English astronomer; Henry Wolsey Bayfield (1795–1885), Royal Navy officer and surveyor; John Bigsby (1792–1881), English physician and geologist; John Bostock (1773–1846), English physician, scientist and geologist; James Scott Bowerbank (1797–1877), British naturalist and palaeontologist; Arthur de Capell Brooke (1791–1858), British baronet and travel writer; William Broderip (1789–1859), English lawyer and naturalist; Alexandre Brongniart (1770–1847), French chemist, mineralogist, and zoologist; Robert Brown (1773–1858), Scottish botanist and palaeobotanist; William Buckland (1784–1856), English theologian, geologist and palaeontologist; Augustus Wall Callcott (1779–1844), English landscape painter; Francis Leggatt Chantrey (1781–1841), English sculptor; William Clift (1775–1849), British illustrator and conservator; Spencer Compton (1790–1851), British nobleman and patron of science and the arts; George Cumberland (1754–1848), English art collector, writer and poet; Charles Darwin (1809–1882), English naturalist, geologist and biologist; Francis Egerton (1800–1857), British politician, writer, traveller and patron of the arts; Philip Grey Egerton (1806–1881), English palaeontologist and Conservative politician; Hugh Falconer (1808–1865), Scottish geologist, botanist, palaeontologist and paleoanthropologist; Edward Forbes (1815–1854), Manx naturalist; John Franklin (1786–1847), Royal Navy officer and explorer of the Arctic; Francis Seymour Haden (1818–1910), English surgeon and etcher; James Hall (1761–1832), Scottish geologist and geophysicist; William Hamilton (1805–1867), English geologist; Thomas Hawkins (1810–1899), English fossil collector and dealer; Isaac Hays (1796–1879), American ophthalmologist, medical ethicist, and naturalist; William Hilton (1786–1839), English portrait and history painter; Charles Joseph Hullmandel (1789–1850), English lithographer; George Jones (1786–1869), British painter; Edwin Landseer (1802–1873), English painter and sculptor; Isaac Lea (1792–1886), American conchologist, geologist, and publisher; William Elford Leach (1791–1836), English zoologist and marine biologist; the Loddiges family, German-English horticulturalists; William Lonsdale (1794–1871), English geologist and palaeontologist; Charles Lyell (1797–1875), Scottish geologist; George Francis Lyon (1795–1832), Royal Navy officer and explorer; Gideon Mantell (1790–1852), English obstetrician, geologist and palaeontologist; Henri Milne-Edwards (1800–1885), French zoologist; Roderick Murchison (1792–1871), British geologist; Richard Owen (1804–1892), English biologist, comparative anatomist and palaeontologist; Edward Parry (1790–1855), Royal Navy officer was an English rear-admiral and Arctic explorer; Joseph Barclay Pentland (1797–1873), Irish geographer, natural scientist, and traveller; John Phillips (1800–1874), English geologist; David Ricardo (1772–1823), British political economist; Peter Mark Roget (1779–1869), British physician, natural theologian and lexicographer; James Ross (1800–1862), Royal Navy officer and Antarctic explorer; John Ruskin (1819–1900), English art critic and polymath; Adam Sedgwick (1785–1873), British priest and geologist; George Brettingham Sowerby (1788–1854), British naturalist, illustrator and conchologist; Edward Stanley (1779–1849), bishop of Norwich, president of the Linnean Society; Samuel Stutchbury (1798–1859), English naturalist and geologist; John Taylor (1779–1863), British mining engineer; John Vaughan Thompson (1779–1847), British military surgeon, marine biologist, zoologist and botanist; Wilhelm Gottlieb Tilesius von Tilenau (1769–1857), German naturalist and explorer, physician, draftsman and engraver; J. M. W. Turner (1775–1851), English Romantic painter, printmaker and watercolourist; William Whewell (1794–1866), English polymath, scientist, Anglican priest, philosopher, theologian and historian of science; Joseph Whidbey (1757–1833), Royal Navy explorer and engineer; Anna Matilda Whistler (1804–1881), best known as the subject of the painting Arrangement in Grey and Black No.1 (\"Whistler's Mother\") by James McNeill Whistler; Henry Witham (1779–1844), English researcher into the internal structure of fossil plants; and William Wollaston (1766–1828), English chemist and physicist."]}, {"page": "John Charles Robinson", "response": ["In 1856, he had created a collector's club which became the unofficial \"Fine Arts Club\" after the museum's opening. In 1866, it merged with the newly formed Burlington Fine Arts Club and Robinson served as its first President. Working with Sir Francis Seymour Haden, he helped to create the Royal Society of Painter-Etchers, now known as the Royal Society of Painter-Printmakers. "]}, {"page": "Frederick Goulding", "response": ["In 1859 he acted as \"devil\" to James MacNeill Whistler in the printing of some of his etchings, and in the same year assisted his father in printing a series of etchings by Queen Victoria and the Prince Consort. At the 1862 International Exhibition he gave a daily demonstration of copper-plate printing for Messrs. Day & Son, from May till November, and began there the friendship with Sir Francis Seymour Haden which lasted till the end of his life.", "thumb|260px|The Amstel by Francis Seymour Haden, printed by Goulding (1879)"]}]}}