{"wiki_id": "http://www.wikidata.org/entity/Q947133", "itemLabel": "Henry Cranke Andrews", "itemDescription": "English botanical illustrator (1770-1830)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Cranke_Andrews", "wikipedia_page": {"main": "Henry Cranke Andrews (fl. 1794 – 1830), was an English botanist, botanical artist and engraver. As he always published as Henry C. Andrews, and due to difficulty finding records, the C. was often referred to as Charles, until a record of his marriage registration was found in 2017.He lived in Knightsbridge, and was married to Anne Kennedy, the daughter of John Kennedy of Hammersmith, a nurseryman who assisted Andrews in the descriptions of the plants he illustrated.\nHe was an accomplished and unusual botanical artist, in that he was not only the artist but also the engraver, colourist, and publisher of his books in an era when most artists were only employed to draw plates. The Botanist's Repository was his first publication; issued serially in London in ten volumes between 1797 and 1812, the Repository at a half-crown an issue, provided affordable images of plants to the growing population of amateur gardeners in Britain. This was the first serious rival to the Kew publication, Curtis's Botanical Magazine. Perhaps not surprisingly, W. Botting Hemsley, a botanist who was employed by Kew, was critical of the quality of Andrews' 664 coloured plates in the Botanist's Repository:\n\n\"The drawing is usually fairly good, though not equal to some of this artist's later work... There is no pretense of giving any analysis of the flowers, but they themselves are often inexact and generally inadequate to be of any use botantically. The descriptive part is also unequal, and synonymy altogether excluded. Nevertheless, the Repository was in one sense superior to the Botanical Magazine of that date, because the majority of the plants figured were of recent introduction.\"\nAndrews' major work is considered to be his Coloured Engravings of Heaths, published in four volumes between 1794 and 1830. It focused on the many species of the genus Erica that were introduced to Great Britain from South Africa in the early and middle 19th century, leading to what has been called an \"Erica mania\" in British horticulture.Henry Andrews reportedly named the Australian flowering plant Correa after the Portuguese botanist and polymath, José Francisco Correia da Serra, who was living in exile in England from 1795 to 1797, and who pursued research with their mutual colleague Joseph Banks.According to a contemporary announcement, Andrews also taught drawing from nature and etching to private students.", "link_mentions": {}}}