{"wiki_id": "http://www.wikidata.org/entity/Q948544", "itemLabel": "Ivor Roberts", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivor_Roberts_(diplomat)", "wikipedia_page": {"main": "Sir Ivor Anthony Roberts  (born 24 September 1946) is a retired British diplomat and the former President of Trinity College, Oxford. He was previously British Ambassador to Yugoslavia, Ireland, and Italy. He was knighted in 2000. In addition to his British citizenship, he is now an Irish citizen.", "link_mentions": [{"page": "Trinity College, Oxford", "response": ["Dame Hilary Boulding, formerly principal of the Royal Welsh College of Music and Drama, succeeded Sir Ivor Roberts as president in August 2017."]}, {"page": "Princess Michael of Kent", "response": ["Princess Michael of Kent is a Roman Catholic, and attended several events during Pope Benedict XVI's state visit to the United Kingdom in September 2010. She attended Mass in Westminster Cathedral on Saturday, 18 September, where she was seated in the first row among other dignitaries, including Lord and Lady Nicholas Windsor, the Duke of Norfolk and former Prime Minister Tony Blair; the Pope gave them an audience after Mass. On the last day of the Pope's visit, 19 September, she attended the open-air Mass of beatification for Cardinal John Henry Newman at Cofton Park, Birmingham. Princess Michael was personally involved in the beatification process and attended several other celebrations relating to his beatification before and after the Cofton Park Mass, including a commemorative concert of the Dream of Gerontius at Birmingham City Hall on 18 September. She also attended a civic dinner with invited dignitaries and bishops in Birmingham, before attending the Mass and meeting the Pope. Previously, in November 2008, the Princess attended the translation of remains of Cardinal Newman at Birmingham Oratory along with other guests of honour, including Francis Campbell, HM Ambassador to the Holy See; the Lord Mayor of Birmingham and Lady Mayoress; Sir Ivor Roberts, President of Trinity College, Oxford and formerly British Ambassador to Italy; and Sir Derek Morris, Provost of Oriel College, Oxford. After the Translation Mass, Princess Michael was shown round Cardinal Newman's Room and Chapel and visited Newman's library."]}, {"page": "Ernest Mason Satow", "response": ["Satow is better known in Japan than in Britain or the other countries in which he served, where he was known as . He was a key figure in East Asia and Anglo-Japanese relations, particularly in Bakumatsu (1853–1867) and Meiji-period (1868–1912) Japan, and in China after the Boxer Rebellion, 1900–06. He also served in Siam, Uruguay and Morocco, and represented Britain at the Second Hague Peace Conference in 1907. In his retirement he wrote A Guide to Diplomatic Practice, now known as 'Satow's Guide to Diplomatic Practice' – this manual is widely used today, and has been updated several times by distinguished diplomats, notably Lord Gore-Booth. The sixth edition edited by Sir Ivor Roberts was published by Oxford University Press in 2009, and is over 700 pages long.", "* A Guide to Diplomatic Practice by Sir E. Satow, (Longmans, Green & Co. London & New York, 1917). A standard reference work used in many embassies across the world, and described by Sir Harold Nicolson in his book Diplomacy as \"The standard work on diplomatic practice\", and \"admirable\".Nicolson, Harold. (1963). Diplomacy, 3rd ed., p. 148. Sixth edition, edited by Sir Ivor Roberts (2009, )."]}, {"page": "Geoffrey Hill", "response": ["In March 2010 Hill was confirmed as a candidate in the election of the Professor of Poetry in the University of Oxford, with a broad base of academic support.He was nominated by Andrew Graham (Master of Balliol), Brendan Callaghan (Master of Campion Hall), Christopher Lewis (Dean of Christ Church), Richard Carwardine (President of Corpus Christi), Ralph Waller (Principal of Harris Manchester), Averil Cameron (Warden of Keble), Tim Gardam (Principal of St Anne's), Roger Ainsworth (Master of St Catherine's), Sir Ivor Roberts, KCMG (President of Trinity), and Hermione Lee, CBE, (President of Wolfson) as well as by Bernard Silverman (formerly Master of St Peter's). He was also nominated by Rowan Williams and Geoffrey Rowell, Wade Allison, Alastair Buchan, and Valentine Cunningham.Nominees. Last updated 18 May 2010. Accessed 3 June 2010.  He was ultimately successful, and delivered his 15 lectures in the academic years 2010 to 2015.\"Professor Sir Geoffrey Hill lectures\", Faculty of English, University of Oxford. The lectures progressed chronologically, beginning with Shakespeare's sonnets and concluding with a critique of Philip Larkin's poem \"Church Going\"."]}, {"page": "Ivor Roberts", "response": ["Ivor Roberts may refer to:", "*Ivor Roberts (actor) (1925–1999), British actor and television presenter", "*Ivor Roberts (diplomat) (born 1946), former British ambassador to Italy, now President of Trinity College, Oxford"]}, {"page": "Ivor", "response": ["* Ivor Roberts (actor) (1925–1999), British actor and television presenter", "* Ivor Roberts (diplomat) (born 1946), British diplomat"]}, {"page": "List of ambassadors of the United Kingdom to Ireland", "response": ["*1999–2003: Sir Ivor Roberts"]}, {"page": "Ivor Roberts (ambassador)", "response": ["#REDIRECT Ivor Roberts (diplomat)"]}, {"page": "Chartered Institute of Linguists", "response": ["* Ivor Roberts"]}, {"page": "Partition of Kosovo", "response": ["In 2007, political analyst Andrey Piontkovsky said that \"Serbia needs to stand up for the partition of Kosovo with the argument that there are no international forces that can keep Kosovo Serbs safe in an independent Kosovo.\" Law professor Timothy William Waters said that \"The division is possible and it is possible that this is the right thing to do.\" Erhard Busek said that \"the partition of Kosovo is perhaps the least bad solution\". Ivor Roberts, the former British Ambassador to Yugoslavia, supports the partition of Kosovo, stating that \"the Partition of Kosovo will please neither side, but the equality of pain is more likely to lead to stability than present Western plans which will undoubtedly destabilise Serbia, and through Serbia the whole region.\""]}, {"page": "List of Beefsteak Club (London) members", "response": ["*Sir Ivor Roberts, KCMG (1946)"]}, {"page": "List of Trinity College, Oxford people", "response": ["*Sir Ivor Roberts (2006 to 2017)"]}, {"page": "List of alumni of Keble College, Oxford", "response": ["* Sir Ivor Roberts, diplomat, President of Trinity College, Oxford"]}, {"page": "Hilary Boulding", "response": ["In September 2016, it was announced that Boulding had been elected as the next President of Trinity College, Oxford, in succession to Sir Ivor Roberts. This made her the first woman in its 462-year history to head the college. She took up the appointment on 1 August 2017."]}, {"page": "Dublin Review of Books", "response": ["*Ivor Roberts, former British diplomat"]}, {"page": "Jardine Scholarship", "response": ["The application process involves both interviews and tests. There are typically two rounds of interviews and two essays, the latter on the applicant's career aspirations and on a separately assigned topic. The final interview is with the Scholarship Committee, typically a panel of eight or more experts. Former chairmen of the Scholarship Committee include Duncan Robinson, Sir Ivor Roberts and Geoffrey Grimmett."]}, {"page": "Death of Harry Dunn", "response": ["On 18 June 2020, a preliminary hearing of the judicial review brought by the Dunn family took place at the High Court of Justice. In a submission to the court Tony Baldry, former Foreign and Commonwealth Office minister and signatory to the diplomatic immunity agreement covering the base at which Sacoolas' husband worked, stated that the agreement was \"limited\" and did not cover dependants.  In a further submission Sir Ivor Roberts, a former longstanding diplomat, called the claim that Sacoolas was covered by diplomatic immunity \"a palpable absurdity\". An adjournment debate on RAF Croughton, in the House of Commons, was led by local Member of Parliament Andrea Leadsom, who focused on Dunn's death and called for the government to intervene and block plans to modify the airbase. As of August, the Attorney General for England and Wales is considering trying Sacoolas in absentia on a charge of causing death by dangerous driving. The prospect of a virtual trial, an option being considered by the attorney general, received support from the Prime Minister, Boris Johnson."]}, {"page": "Sir Ivor Roberts", "response": ["#REDIRECTIvor Roberts (diplomat)"]}]}}