{"wiki_id": "http://www.wikidata.org/entity/Q948734", "itemLabel": "John Roberts", "itemDescription": "Welsh billiards player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Roberts_Jr._(billiards_player)", "wikipedia_page": {"main": "John Roberts Jr. (15 August 1847 – 23 December 1919) was a dominant English professional player of English billiards. He was also a notable manufacturer of billiards cues and tables, and promoter of the sport.", "link_mentions": [{"page": "John (given name)", "response": ["*John Roberts (born 1955), American lawyer and jurist who serves as Chief Justice of the United States", "*John Roberts (Royal Navy officer) (born 1924), British admiral", "*John Roberts (Australian rules footballer) (born 1956), Australian rules footballer who played for South Melbourne/Sydney Swans and in South Australia", "*John Roberts (footballer, born 1881) (1881–1956), Australian rules footballer who played for South Melbourne", "*John Roberts Jr. (billiards player) (1847–1919), professional player of English billiards", "*John Roberts (Shropshire cricketer) (born 1948), Shropshire cricketer", "*John Roberts (Lancashire cricketer) (1933–2019), former English cricketer", "*John Roberts (Somerset cricketer) (born 1949), Somerset cricketer", "*John Roberts (footballer, born 1857) (1857–1???), Welsh (from Llangollen) international footballer", "*John Roberts (footballer, born 1858) (1858–1???), Welsh international footballer", "*John Roberts (footballer, born 1885) (1885–19??), English footballer who played for Wolverhampton Wanderers and Bristol Rovers", "*John Roberts (footballer, born 1887) (1887–19??), English-born footballer active in Italy for Milan and Modena", "*John Roberts (footballer, born 1891) (1891–19??), Scottish footballer", "*John Roberts (footballer, born 1944), Australian soccer player", "*John Roberts (footballer, born 1946) (1946–2016), Welsh international footballer who played for Wrexham and Arsenal", "*John Roberts (hurler) (1895–1987), Irish hurler", "*John Roberts (rower) (born 1953), British Olympic rower", "*John Roberts (rugby player) (1906–1965), Welsh rugby player", "*John Roberts (American football) (1920–2012), American football, wrestling and track coach"]}, {"page": "Tom Reece", "response": ["Reece married Laura Lydia Williams on the morning of 6 June 1908, before continuing a match against John Roberts Jr that afternoon. During World War II he toured the United Kingdom playing exhibition matches to raise funds for the British Red Cross."]}, {"page": "World Billiards Championship (English billiards)", "response": ["John Roberts Sr., who had spent years touring and establishing his reputation as a billiards player, challenged Kentfield. There was much controversy over the table and the pockets to be used, and Kentfield declined to play, so Roberts styled himself as champion, a title he held unchallenged until 1870, when he lost to William Cook.", "Cook beat Roberts's son John Roberts Jr. in a  in 1869, and challenged Roberts Sr. for the title. As this was the first actual match for the World Championship, the players themselves drew up a special set of rules for the game. Roberts managed to have the pocket width reduced to 3 inches (from the original 3 inches), and the \"D\" and  were adjusted so that Cook's spot stroke strength, derived from his proficiency at consecutively  the  from its spot, was weakened. Cook was nonetheless considered the favourite, and the 20-year-old had greatly improved since his win over Roberts Jr. the previous year. At 1:38 a.m. on the morning of 12 February 1870, Cook defeated Roberts to win the title, and won a newly created trophy, £100, and a Maltese cross. The match at St. James's Hall in London was attended by Edward VII, the Prince of Wales. This match ended the dominance of Roberts Sr., as a wave of new players took over the game.", "|bgcolor=\"FFFFFF\"| John Roberts Sr.", "|bgcolor=\"FFFFFF\"| John Roberts Sr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr.", "|bgcolor=\"FFFFFF\"| John Roberts, Jr."]}, {"page": "William Cook (billiards player)", "response": ["Cook beat John Roberts Jr., son of the dominant player of the time, John Roberts Sr., in a  in 1869, and then challenged Roberts Sr. for the title. As this was the first actual match for the World Championship, the players themselves drew up a special set of rules for the game. Cook was an expert at the , whereas Roberts was superior in the all-around game. Roberts managed to get the pocket width reduced to 3–inches (from the original 3–in), and  and  were adjusted so that Cook's spot stroke strength, derived from his proficiency at consecutively  the  from its  was weakened. Cook was nonetheless considered the favourite, and the 20-year-old had improved much from his win over Roberts Jr. the previous year. At 1:38 a.m. on the morning of 12 February 1870, Cook defeated Roberts 1,200-1,083 to win the title, and won a newly created trophy, £100 and a Maltese cross. The Prince of Wales attended the match at St. James's Hall. This match ended the dominance of Roberts Sr., as the wave of new players took over the game.", "Roberts Sr. then retired, but Cook was to meet his match in the son, John Roberts Jr., who beat him 1,200-552 in a challenge match for the Championship in April 1870. Cook struggled to match Roberts in the matches, but after improving he was able to hold the championship until 1875. He was then beaten again by Roberts, who would go on to dominate billiards for the next thirty years."]}, {"page": "John Roberts Jr. (billiards)", "response": ["#REDIRECT John Roberts Jr. (billiards player)"]}, {"page": "James Joynton Smith", "response": ["Unusually for a man whose fortune was largely built on hotels, he was a teetotaller. He was a keen billiards player and played against John Roberts during a visit by Roberts in 1910 at Smith's Arcadia Hotel in Sydney.Ricketts, Andrew. Walter Lindrum: Billiards Phenomenon. ."]}, {"page": "John Roberts, Jr. (billiards)", "response": ["#REDIRECT John Roberts Jr. (billiards player)"]}, {"page": "John Roberts (disambiguation)", "response": ["John Roberts (born 1955) is the seventeenth Chief Justice of the United States.", "John Roberts may also refer to:", "*General John Roberts (fl. 1604), MP for Chippenham", "*John Roberts (Denbigh MP) (after 1672–1731), Member of Parliament for Denbigh, 1710–1713 & 1715–1722", "*John Roberts (Flint MP) (1835–1894), Welsh member of parliament", "*John Roberts, 1st Baron Clwyd (1863–1955), Welsh Liberal politician, son of the above", "*John Roberts (Canadian politician) (1933–2007), Canadian politician", "*John Roberts (mayor) (1845–1934), mayor of Dunedin, New Zealand, 1889–90", "*John Roberts (historian) (1928–2003), Oxford historian and author", "*Donald John Roberts (born 1945), or John Roberts, professor of economics at the Business School of Stanford University", "*John Roberts (Australian businessman) (1934–2006), founder of Australian construction firm Multiplex", "*John Roberts (British businessman), founder of AO World", "*Bartholomew Roberts (1682–1722), born John Roberts, Welsh pirate", "*John Roberts (Royal Navy officer) (born 1924), British admiral", "*John Roberts (actor) (born 1971), American actor and comedian", "*John Roberts (journalist) (born 1956), Fox News national correspondent, former CNN and CBS News television journalist and former Canadian music television host", "*John Roberts (sportscaster) (born 1965), American television host specializing in motorsports", "*John Roberts (electronic musician), American electronic musician", "*John Roberts (musician) (born c. 1940), English performer of English and North Atlantic folk music and dance", "*John Roberts (born 1952), former drummer for the Shadows of Knight", "*John Roberts, music educator for International Association for Jazz Education", "*John Roberts (Australian rules footballer) (born 1956), Australian rules footballer who played for South Melbourne/Sydney Swans and in South Australia", "*John Roberts (footballer, born 1881) (1881–1956), Australian rules footballer who played for South Melbourne", "*John Roberts Jr. (billiards player) (1847–1919), professional player of English billiards", "*John Roberts (Shropshire cricketer) (born 1948), Shropshire cricketer", "*John Roberts (Lancashire cricketer) (1933–2019), former English cricketer", "*John Roberts (Somerset cricketer) (born 1949), Somerset cricketer", "*John Roberts (footballer, born 1857) (1857–?), Welsh (from Llangollen) international footballer", "*John Roberts (footballer, born 1858) (1858–?), Welsh international footballer", "*John Roberts (footballer, born 1885) (1885–19??), English footballer who played for Wolverhampton Wanderers and Bristol Rovers", "*John Roberts (footballer, born 1887) (1887–19??), English-born footballer active in Italy for Milan and Modena", "*John Roberts (footballer, born 1891) (1891–19??), Scottish footballer", "*John Roberts (footballer, born 1944), Australian international soccer player who played in The Football League in the 1960s and 70s", "*John Roberts (footballer, born 1946) (1946–2016), Welsh international footballer who played for Wrexham and Arsenal", "*John Roberts (hurler) (1895–1987), Irish hurler", "*John Roberts (rower) (born 1953), British Olympic rower", "*John Roberts (rugby union) (1906–1965), Welsh rugby player", "*John Roberts (American football) (1920–2012), American football, wrestling and track coach", "*Saint John Roberts (martyr) (c. 1576–1610), Welsh Benedictine monk", "*John Roberts (Vicar of Tremeirchion) (1775–1829), Welsh Anglican priest and writer", "*Saint John Roberts (missionary) (1853–1949), Welsh Anglican priest, writer and missionary in Wyoming, USA", "*John Roberts (Presbyterian) (1880–1959), Welsh Presbyterian Church of Wales minister and historian", "*John Roberts, bardic name Ieuan Gwyllt (1822–1877), Welsh musician and Calvinistic Methodist minister", "*John Roberts (architect) (1712–1796), Irish architect", "*John Roberts (urban planner) (1929–1992), British transportation planner", "*John Roberts (writer) (born 1947), English journalist and author", "*John Roberts, British film director of War of the Buttons", "*John Roberts (engineer) (fl. 1969–2006), British structural engineer", "*John Roberts, co-founder of Edapt and Oak National Academy"]}, {"page": "Fred Lawrence", "response": ["Lawrence's progress as a billiards player came to the attention of the veteran player John Roberts Jr. (billiards player). It was announced in The Birmingham Daily Mail, that Roberts was greatly impressed with his performances, and would play Fred Lawrence at Stockton-on-Tees on 3 March 1905.\"Sporting Items\". The Birmingham Daiy Mail, Friday 27 January 1905, p.4 - via British Newspaper Archive. Retrieved 03 April 2021. In a game of the first to 1,500 Roberts gave Lawrence a 700 start. By the end of the afternoon session, Fred was winning 1,101 - 546. Roberts managed to catch up in the evening session, but he lost the game by 48 points after Lawrence made an unfinished break of 65.\"Boy Champion Beats Roberts\". Manchester Courier and Lancashire General Advertiser, Saturday 04 March 1905, p.8 - via British Newspaper Archive. Retrieved 03 April 2021."]}, {"page": "Burroughes Hall", "response": ["Before World War I, Burroughes & Watts organised an annual professional billiards 'London tournament'. This was a handicapped American tournament played at Soho Square Hall. In four tournaments, from 1907/08 to 1910/11, a snooker competition was arranged in parallel to the billiards. This generally consisted of a frame of snooker played at the end of each session of billiards. Soho Square Hall was also the venue of one of the earliest professional snooker matches, hosting a match of 101 frames between John Roberts and Tom Reece from 25 May to 6 June 1908. The match was for £100, £50 for the player winning most frames and £50 for the player winning most aggregate points. Roberts won both prizes, winning 54½ frames to 46½ and 5,529 points to 5,209. Roberts made a break of 73, equalling a recently set record by James Harris."]}, {"page": "John Roberts, Jr. (billiards player)", "response": ["#REDIRECT John Roberts Jr. (billiards player)"]}, {"page": "Billy Weston", "response": ["William Weston (1847–1935) was an Australasian billiards champion and was an early teacher of former world champion, Walter Lindrum.Ricketts, Andrew. Walter Lindrum: Billiards Phenomenon.  He toured Australia and New Zealand as playing partner to John Roberts Jr. when Roberts visited Australia.The West Australian (Perth. WA: 1879 – 1954) Wednesday 14 August 1935, Page 9"]}, {"page": "Samuel Lazar", "response": ["Lazar was a keen follower of horse racing, and was an excellent billiards player, not being disgraced in a match against John Roberts, jun. on that champion's first Australasian tour."]}, {"page": "Eva Collins", "response": ["In 1906, Collins played two series of billiards exhibition matches against \"Madame Strebor,\" a pseudonym used by an unknown woman player who had toured with John Roberts Jr. The series held at Burroughes Hall finished 7–5 in favour of Madame Strebor. Shortly afterward, Collins won 15 of 24 matches against Strebor in Manchester."]}, {"page": "Billiards and Snooker Control Council", "response": ["Collins-Orme proposed that an association be created. This was agreed, and \"The Billiard Association of Great Britain and Ireland, India and the Colonies\" (known as the Billiard Association) was formed. Ten players were tasked with authoring a new set of rules for English billiards. They were John Roberts Jr. (Chairman), Joseph Bennett, Fred Bennett, George Collins, William Cook, John Roberts Sr., Billy Mitchell, John North, W. J. Peall, Joe Sala and Tom Taylor. The group met weekly in a dining area at the Royal Aquarium, and finished writing the rules on 21 September 1886. The rules were published soon after that. Sydenham Dixon, a staff member at The Sportsman was the driving force behind the formation of the Billiards Association, and the newspaper retained a strong influence over the association's affairs. The influence of the paper over the Association later led to prominent player John Roberts Jr. (who became the Billiards Champion in 1886 when Cook failed to respond to Roberts' challenge for the title) refusing to recognise the Association's authority.", "The Association came to be recognised as the governing body for billiards, and organised amateur and professional championships. They also produced templates for standard  sizes, which tables had to conform to if  made on them were to be recognised in official records. The March 1885 match between John Roberts Jr. and Cook, which Roberts won 3,000-2,980 was the first to be held under the rules of the Association. An amateur championship under the \"all in\" rules, with no restrictions on the number of consecutive scoring shots that could be played, was organised by the Association in 1892, when Sam Christey beat Sidney Fry 1,500–928. The competition was restricted to players from Great Britain before 1917, which was the first year that champions from other Commonwealth countries were allowed to enter. From 1926, only English and Welsh players were allowed to participate, and the event was renamed the English Amateur Championship. The first snooker competition organised by the Billiard Association was the English Amateur Championship of 1916, which was played to benefit the British Sportsmen's Motor Ambulance Fund."]}, {"page": "Charles Dawson (billiards player)", "response": ["Dawson won the billiards title against John North in 1899, but the match attracted little attention as leading player John Roberts Jr. was not involved."]}, {"page": "John Roberts Sr.", "response": ["John Roberts Sr. (12 June 1823 – 27 March 1893) was a Welsh champion player of English billiards.", "In 1847, his son John Roberts Jr. was born.", "In 1885, a meeting took place at The Sportsman's offices to consider revising the rules of billiards, chaired by a Mr A. H. Collins-Orme and attended by the majority of the prominent professional billiards players. The Billiard Association was formed, and ten players, including John Roberts Jr., and Roberts Sr., were tasked with authoring a new set of rules for English billiards.", "* John Roberts Sr. biography at the Billiard and Snooker Heritage Collection."]}, {"page": "Joseph Bennett (billiards player)", "response": ["In November 1870, Bennett played John Roberts Jr. for the Billiards Championship and £200, and won the title with the scoreline 1,000-905. The match was watched by over 300 spectators. Roberts beat Bennett 1,000-637 the following year, in January 1871, to regain the title.", "*28 November 1870, 1,000–905 against John Roberts, Jr. "]}, {"page": "1870 in cue sports", "response": ["| || The Professional Championship of English billiards || UK (London) || William Cook defeated John Roberts Sr., 1,200–1,083", "| || The Professional Championship of English billiards  || UK (London) || John Roberts Jr. defeated William Cook, 1,000–522", "| || The Professional Championship of English billiards  || UK (London) || John Roberts Jr. defeated Alfred Bowles, 1,000–752", "| || The Professional Championship of English billiards  || UK (London) || Joseph Bennett defeated John Roberts Jr., 1,000–905"]}]}}