{"wiki_id": "http://www.wikidata.org/entity/Q949363", "itemLabel": "Paul Torday", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Torday", "wikipedia_page": {"main": "Paul Torday (; 1 August 1946 – 18 December 2013) was a British writer and the author of the comic novel Salmon Fishing in the Yemen. The book was the winner of the 2007 Bollinger Everyman Wodehouse Prize for comic writing  and was serialised on BBC Radio 4. It won the Waverton Good Read Award in 2008. It was made into a popular movie in 2011, starring Ewan McGregor and Emily Blunt.", "link_mentions": [{"page": "Epistolary novel", "response": ["*Salmon Fishing in the Yemen (2007) by Paul Torday, is a series of letters, e-mails, interview transcripts, newspaper articles and other non-narrative media."]}, {"page": "1946 in literature", "response": ["*August 1 – Paul Torday, English novelist (died 2013)"]}, {"page": "Guardian Children's Fiction Prize", "response": ["Torday was inspired to write books by the success of his father, Paul Torday (1946–2013), whose first book was published in 2006 when he was 59 years old."]}, {"page": "Lasse Hallström", "response": ["His 2011 film Salmon Fishing in the Yemen, based on the 2007 novel of the same name by Paul Torday and starring Ewan McGregor and Emily Blunt, was nominated for three Golden Globe Awards in the Comedy or Musical category, including Best Motion Picture, Best Actor for McGregor, and Best Actress for Blunt. The film was nominated for the European Film Awards People's Choice Award."]}, {"page": "Royal Grammar School, Newcastle upon Tyne", "response": ["* Paul Torday (1946–2013), author"]}, {"page": "Society of Authors", "response": ["*The Paul Torday Memorial Prize, for debut novelists over 60"]}, {"page": "Late bloomer", "response": ["Richard Adams's first novel, the bestseller Watership Down, was published when he was in his fifties. The Marquis de Sade published his first novel, Justine, after turning 51. Raymond Chandler published his first short story at 45, and his first novel, The Big Sleep, at 51. Paul Torday published his debut novel Salmon Fishing in the Yemen at the age of 59, after a career in the engineering industry. Jean Rhys is best known for her novel Wide Sargasso Sea, which was published in October 1966, when she was 76."]}, {"page": "Chipchase Castle", "response": ["The castle is privately owned. It is associated with Paul Torday, the author of the novel Salmon Fishing in the Yemen, which was made into a popular film. He lived there with his second wife Penelope (née Taylor), who inherited the estate, and reportedly did much to help manage it."]}, {"page": "Simon Beaufoy", "response": ["Beaufoy has recently completed adaptations of The Raw Shark Texts by Steven Hall, Salmon Fishing in the Yemen by Paul Torday,Telegraph.co.uk and a new adaptation of The Full Monty as a stage play.The Full Monty on stage: the boys are back in town The Guardian, 10 February 2013. Retrieved 12 February 2013."]}, {"page": "Waverton Good Read Award", "response": ["|Salmon Fishing in the Yemen, by Paul Torday"]}, {"page": "Bollinger Everyman Wodehouse Prize", "response": ["The Bollinger Everyman Wodehouse Prize is the United Kingdom's first literary award for comic literature. Established in 2000 and named in honour of P. G. Wodehouse, past winners include Paul Torday in 2007 with Salmon Fishing in the Yemen and Marina Lewycka with A Short History of Tractors in Ukrainian 2005 and Jasper Fforde for The Well of Lost Plots in 2004. Gary Shteyngart was the first American winner in 2011.", "*2007 Paul Torday - Salmon Fishing in the Yemen (Weidenfeld & Nicolson)"]}, {"page": "Tom Mison", "response": ["In 2011, Mison played Callum in the film adaptation of David Nicholls' novel One Day. One Day starred Anne Hathaway and Jim Sturgess; Lone Scherfig directed. His most notable film role to date came in 2012 in the romantic comedy Salmon Fishing in the Yemen. Lasse Halstrom directed this film adaptation of Paul Torday's novel, and Ewan McGregor and Emily Blunt starred. Mison played Capt. Robert Mayers, the military boyfriend of Emily Blunt's character Harriet. The movie was generally well-received critically and did well at the box office. In the US, it reached the box office top ten, peaking at No. 7. The review aggregator website Rotten Tomatoes reports a 67% positive rating among critics, based on 139 reviews."]}, {"page": "List of books from the Richard & Judy Book Club", "response": ["* Paul Torday – Salmon Fishing in the Yemen"]}, {"page": "Aquaculture of salmonids", "response": ["* Chapter 14 of Paul Torday's 2007 novel Salmon Fishing in the Yemen includes a description of a visit to the \"McSalmon Aqua Farms\" where salmon are raised caged in a sea loch in Scotland."]}, {"page": "Salmon Fishing in the Yemen", "response": ["Salmon Fishing in the Yemen is a 2011 British romantic comedy-drama film directed by Lasse Hallström and starring Ewan McGregor, Emily Blunt, Kristin Scott Thomas and Amr Waked. Based on the 2007 novel of the same name by Paul Torday, and a screenplay by Simon Beaufoy, the film is about a fisheries expert who is recruited by a consultant to help realise a sheikh's vision of bringing the sport of fly fishing to the Yemen desert, initiating an upstream journey of faith to make the impossible possible. The film was shot on location in London, England, Scotland and Morocco from August to October 2010. The film premiered at the 2011 Toronto International Film Festival. The film received generally positive reviews upon its release, and earned over $34 million in revenue worldwide.", "The screenplay for Salmon Fishing in the Yemen was written by Simon Beaufoy, based on the novel by Paul Torday. The epistolary novel won the 2007 Bollinger Everyman Wodehouse Prize, and the 2008 Waverton Good Read Award. Through a series of letters and documents, Torday creates a political satire that focused more on the \"art of political spin\" than on the force of the human spirit. Beaufoy enjoyed the challenge of transforming a fairly complex novel written in an unusual format—a series of emails, text messages, interviews, and testimony extracts—into a film. Beaufoy acknowledged, \"I just love adapting material that allows room for creativity and allows room for me to be very present in the process, I suppose. Sometimes when you’re adapting something classic and famous you have to adopt a different attitude, to something like Salmon Fishing where it had such an unusual narrative and such an unusual structure, that you got quite a  to do interesting things with it.\" Beaufoy integrated the emails, text messages, and chat texts into the film's narrative."]}, {"page": "Fishing in Yemen", "response": ["Paul Torday wrote a comic novel, Salmon Fishing in the Yemen, about a westerner's commission to introduce salmon to the wadis of the Yemen highlands. The book was adapted into a film of the same name in 2011."]}, {"page": "List of British films of 2011", "response": ["|| Lionsgate   Based on Salmon Fishing in the Yemen by Paul Torday"]}, {"page": "2013 in the United Kingdom", "response": ["**Paul Torday, 67, author."]}, {"page": "List of fiction works made into feature films (S–Z)", "response": ["| Salmon Fishing in the Yemen (2006), Paul Torday"]}, {"page": "Torday", "response": ["*Paul Torday (1946–2013), British writer"]}, {"page": "Deaths in December 2013", "response": ["* Paul Torday, 67, British author.Paul Torday, author of Salmon Fishing in the Yemen, dies aged 67"]}, {"page": "Salmon Fishing in the Yemen (novel)", "response": ["Salmon Fishing in the Yemen is a debut comedy novel written by Paul Torday and published in 2007.", "* Financial Times interview with Paul Torday"]}, {"page": "Piers Torday", "response": ["Piers Torday (born 1974) is a British children's writer. The son of the novelist Paul Torday, he was born in Northumberland and was a theatre and television producer for many years.Piers Torday: finishing his father’s last novel, The Guardian, 7 May 2016.Piers Torday website, accessed 6"]}, {"page": "Paul Torday Memorial Prize", "response": ["#REDIRECT Paul Torday"]}, {"page": "Torday, Paul", "response": ["#redirectPaul Torday"]}]}}