{"wiki_id": "http://www.wikidata.org/entity/Q95076", "itemLabel": "Joan Fontaine", "itemDescription": "British American actress (1917-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_Fontaine", "wikipedia_page": {"main": "Joan de Beauvoir de Havilland (October 22, 1917 – December 15, 2013), known professionally as Joan Fontaine, was a British-American actress who is best known for her starring roles in Hollywood films during the \"Golden Age\". Fontaine appeared in more than 45 films in a career that spanned five decades. She was the younger sister of actress Olivia de Havilland. Their rivalry was well-documented in the media at the height of Fontaine's career.\nShe began her film career in 1935, signing a contract with RKO Pictures. Fontaine received her first major role in The Man Who Found Himself (1937) and in 1939 with Gunga Din. Her career prospects improved greatly after her starring role in Alfred Hitchcock's Rebecca (1940), for which she received her first of three nominations for the Academy Award for Best Actress. The following year, she won that award for her role in Hitchcock's Suspicion (1941). A third nomination came with The Constant Nymph (1943). She appeared mostly in drama films through the 1940s, including Letter from an Unknown Woman (1948), which is now considered a classic. In the next decade, after her role in Ivanhoe (1952), her film career began to decline and she moved into stage, radio and television roles. She appeared in fewer films in the 1960s, which included Voyage to the Bottom of the Sea (1960), The Devil's Own (1966) and her final film role in The Witches (1966).\nShe released an autobiography, No Bed of Roses, in 1978, and continued to act until 1994. Having won an Academy Award for her role in Suspicion, Fontaine is the only actor to have won an Academy Award for acting in a Hitchcock film. She and her sister remain the only siblings to have won lead-acting Academy Awards.", "link_mentions": [{"page": "Alfred Hitchcock", "response": ["Hitchcock approached American cinema cautiously; his first American film was set in England in which the \"Americanness\" of the characters was incidental: Rebecca (1940) was set in a Hollywood version of England's Cornwall and based on a novel by English novelist Daphne du Maurier. Selznick insisted on a faithful adaptation of the book, and disagreed with Hitchcock with the use of humour. The film, starring Laurence Olivier and Joan Fontaine, concerns an unnamed naïve young woman who marries a widowed aristocrat. She lives in his large English country house, and struggles with the lingering reputation of his elegant and worldly first wife Rebecca, who died under mysterious circumstances. The film won Best Picture at the 13th Academy Awards; the statuette was given to producer Selznick. Hitchcock received his first nomination for Best Director, his first of five such nominations.", "Suspicion (1941) marked Hitchcock's first film as a producer and director. It is set in England; Hitchcock used the north coast of Santa Cruz for the English coastline sequence. The film is the first of four in which Cary Grant was cast by Hitchcock, and it is one of the rare occasions that Grant plays a sinister character. Grant plays Johnnie Aysgarth, an English conman whose actions raise suspicion and anxiety in his shy young English wife, Lina McLaidlaw (Joan Fontaine). In one scene, Hitchcock placed a light inside a glass of milk, perhaps poisoned, that Grant is bringing to his wife; the light ensures that the audience's attention is on the glass. Grant's character is actually a killer, as per written in the book, Before the Fact by Francis Iles, but the studio felt that Grant's image would be tarnished by that. Hitchcock therefore settled for an ambiguous finale, although he would have preferred to end with the wife's murder. Fontaine won Best Actress for her performance."]}, {"page": "Burt Lancaster", "response": ["Hecht kept to his promise to Lancaster to turn producer. The two of them formed a company, Norma Productions, and did a deal with Universal to make a thriller about a disturbed G.I. in London, Kiss the Blood Off My Hands in 1948, with Joan Fontaine and directed by Norman Foster. It made a profit of only $50,000, but was critically acclaimed."]}, {"page": "December 15", "response": ["*  2013   – Joan Fontaine, British-American actress (b. 1917)"]}, {"page": "Dubbing (filmmaking)", "response": ["|Sophia LorenIngrid BergmanMaureen O'HaraBarbara StanwyckSusan HaywardJennifer JonesBette DavisJoan Fontaine"]}, {"page": "Humphrey Bogart", "response": ["Bogart lapsed into a coma and died the following day, 20 days after his 57th birthday; at the time of his death he weighed only . A simple funeral was held at All Saints Episcopal Church, with music by Bogart's favorite composers: Johann Sebastian Bach and Claude Debussy. In attendance were some of Hollywood's biggest stars, including Hepburn, Tracy, Judy Garland, David Niven, Ronald Reagan, James Mason, Bette Davis, Danny Kaye, Joan Fontaine, Marlene Dietrich, James Cagney, Errol Flynn, Edward G. Robinson, Gregory Peck, Gary Cooper, Billy Wilder, and studio head Jack L. Warner. Bacall asked Tracy to give the eulogy; he was too upset, however, and John Huston spoke instead:"]}, {"page": "Howard Hughes", "response": ["Hughes dated many famous women, including Joan Crawford, Billie Dove, Faith Domergue, Bette Davis, Yvonne De Carlo, Ava Gardner, Olivia de Havilland, Katharine Hepburn, Hedy Lamarr, Ginger Rogers, Janet Leigh, Pat Sheehan, Mamie Van Doren and Gene Tierney. He also proposed to Joan Fontaine several times, according to her autobiography No Bed of Roses. Jean Harlow accompanied him to the premiere of Hell's Angels, but Noah Dietrich wrote many years later that the relationship was strictly professional, as Hughes disliked Harlow personally. In his 1971 book, Howard: The Amazing Mr. Hughes, Dietrich said that Hughes genuinely liked and respected Jane Russell, but never sought romantic involvement with her. According to Russell's autobiography, however, Hughes once tried to bed her after a party. Russell (who was married at the time) refused him, and Hughes promised it would never happen again. The two maintained a professional and private friendship for many years. Hughes remained good friends with Tierney who, after his failed attempts to seduce her, was quoted as saying \"I don't think Howard could love anything that did not have a motor in it\". Later, when Tierney's daughter Daria was born deaf and blind and with a severe learning disability because of Tierney's exposure to rubella during her pregnancy, Hughes saw to it that Daria received the best medical care and paid all expenses.Tierney and Herskowitz 1978, p. 97."]}, {"page": "Ivanhoe", "response": ["* Ivanhoe, 1952, directed by Richard Thorpe, starring Robert Taylor, Elizabeth Taylor, Joan Fontaine and George Sanders; nominated for three Oscars."]}, {"page": "Joseph Cotten", "response": ["Cotten co-starred with Joan Fontaine in September Affair (1950) for Hal Wallis. Selznick loaned him to 20th Century Fox for the dark Civil War Western Two Flags West (1950), then to RKO for Walk Softly, Stranger (1950, shot in 1948) which reunited him with Alida Valli from The Third Man. It was a huge flop.Jewell, Richard and Vernon Harbin, The RKO Story. New Rochelle, New York: Arlington House, 1982, p. 253."]}, {"page": "James Stewart", "response": ["Stewart appeared in four new film releases in 1948. Call Northside 777 was a critically-acclaimed film noir,;  while the musical comedy On Our Merry Way, in which Stewart and Henry Fonda played jazz musicians in an ensemble cast, was a critical and commercial failure. The comedy You Gotta Stay Happy, which paired Stewart with Joan Fontaine, was the most successful of his post-war films up to that point. Rope, in which Stewart played the idolized teacher of two young men who commit murder to show their supposed superiority, began his collaboration with Alfred Hitchcock. Shot in long \"real-time\" takes, Stewart felt pressure to be flawless in his performance; the added stress led to him sleeping very little and drinking more heavily. Rope received mixed reviews, and Andrew Sarris and Scott Eyman have later called him miscast in the role of a Nietzsche-loving philosophy professor. The film's screenwriter Arthur Laurents also stated that \"the casting of [Stewart] was absolutely destructive. He's not sexual as an actor.\""]}, {"page": "October 22", "response": ["*1917 – Joan Fontaine, British-American actress (d. 2013)"]}, {"page": "Vivien Leigh", "response": ["Selznick observed that she had shown no enthusiasm for the part until Olivier had been confirmed as the lead actor, so he cast Joan Fontaine. He refused to allow her to join Olivier in Pride and Prejudice (1940), and Greer Garson played the role Leigh had wanted for herself.Vickers 1988, p. 118. Waterloo Bridge (1940) was to have starred Olivier and Leigh; however, Selznick replaced Olivier with Robert Taylor, then at the peak of his success as one of Metro-Goldwyn-Mayer's most popular male stars.Bean 2013, pp. 73–74. Her top billing reflected her status in Hollywood, and the film was popular with audiences and critics.\"Vivien Leigh – Biography.\"  Yahoo! Movies. Retrieved 13 October 2012."]}, {"page": "Wenceslaus I, Duke of Bohemia", "response": ["The 1994 television film, Good King Wenceslas, is a highly fictional account of his early life. The film stars Jonathan Brandis in the title role, supported by Leo McKern, Stefanie Powers, and Joan Fontaine as Ludmila."]}, {"page": "1950s", "response": ["* Joan Fontaine"]}, {"page": "1940s", "response": ["* Joan Fontaine"]}, {"page": "1917", "response": ["* October 22 – Joan Fontaine, British-born actress (d. 2013)"]}, {"page": "1930s", "response": ["* Joan Fontaine"]}, {"page": "Cary Grant", "response": ["During the 1940s and 50s, Grant developed a close working relationship with director Alfred Hitchcock, who cast him in four films: Suspicion (1941) opposite Joan Fontaine, Notorious (1946) opposite Ingrid Bergman, To Catch a Thief (1955) with Grace Kelly, and North by Northwest (1959) alongside James Mason and Eva Marie Saint, with Notorious and North by Northwest becoming particularly critically acclaimed. The suspense-dramas Suspicion and Notorious both involved Grant showing a darker, more ambiguous nature in his characters. Toward the end of his career, Grant was praised by critics as a romantic leading man, and he received five nominations for the Golden Globe Award for Best Actor, including for Indiscreet (1958) again with Bergman, That Touch of Mink (1962) with Doris Day, and Charade (1963) with Audrey Hepburn. He is remembered by critics for his unusually broad appeal as a handsome, suave actor who did not take himself too seriously, able to play with his own dignity in comedies without sacrificing it entirely.", "The following year Grant was considered for the Academy Award for Best Actor for Penny Serenade—his first nomination from the Academy. Wansell claims that Grant found the film to be an emotional experience, because he and wife-to-be Barbara Hutton had started to discuss having their own children. Later that year he appeared in the romantic psychological thriller Suspicion, the first of Grant's four collaborations with director Alfred Hitchcock. Grant did not warm to co-star Joan Fontaine, finding her to be temperamental and unprofessional. Film critic Bosley Crowther of The New York Times considered that Grant was \"provokingly irresponsible, boyishly gay and also oddly mysterious, as the role properly demands\". Hitchcock later stated that he thought the ending of the film in which Grant is sent to jail instead of committing suicide \"a complete mistake because of making that story with Cary Grant. Unless you have a cynical ending it makes the story too simple\". Geoff Andrew of Time Out believes Suspicion served as \"a supreme example of Grant's ability to be simultaneously charming and sinister\"."]}, {"page": "Monterey, California", "response": ["* Joan Fontaine, Oscar-winning actress, Rebecca, Suspicion"]}, {"page": "Laurence Olivier", "response": ["After returning to London briefly in mid-1939, the couple returned to America, Leigh to film the final takes for Gone with the Wind, and Olivier to prepare for filming of Alfred Hitchcock's Rebecca—although the couple had hoped to appear in it together. Instead, Joan Fontaine was selected for the role of Mrs de Winter, as the producer David O. Selznick thought that not only was she more suitable for the role, but that it was best to keep Olivier and Leigh apart until their divorces came through. Olivier followed Rebecca with Pride and Prejudice, in the role of Mr. Darcy. To his disappointment Elizabeth Bennet was played by Greer Garson rather than Leigh. He received good reviews for both films and showed a more confident screen presence than he had in his early work. In January 1940 Olivier and Esmond were granted their divorce. In February, following another request from Leigh, her husband also applied for their marriage to be terminated."]}, {"page": "Spencer Tracy", "response": ["Neither Tracy nor his wife ever pursued a divorce, despite their estrangement. He told Joan Fontaine, \"I can get a divorce whenever I want to, but my wife and Kate like things just as they are.\"Curtis (2011) p. 612. Louise, meanwhile, reportedly commented, \"I will be Mrs. Spencer Tracy until the day I die.\" Hepburn did not interfere and never fought for marriage.Hepburn (1991) p. 405."]}, {"page": "2013", "response": ["** Joan Fontaine, Japanese-born British American actress (b. 1917)"]}, {"page": "Joan Collins", "response": ["Collins's big break came with a major, highly publicised role as a juvenile delinquent in I Believe in You (1952).  Her success in the part led to her initial stardom and the press nickname \"Britain's Bad Girl\". Her subsequent films whilst under contract to Rank included Decameron Nights (1953) with Joan Fontaine; England's first X certificate drama, Cosh Boy (1953), directed by Lewis Gilbert; Turn the Key Softly (1953), a drama about three women released from prison on the same day; and the boxing saga The Square Ring (1953)."]}, {"page": "Ray Milland", "response": ["Milland gave a strong performance in Close to My Heart (1951) at Warner Bros., in which he and Gene Tierney starred as a couple trying to adopt a child. His next film, Bugles in the Afternoon (1952), was a Western also at Warners. Something to Live For (1952) was another study of alcoholism at Paramount, with Joan Fontaine."]}, {"page": "Charles Addams", "response": ["Addams was \"sociable and debonair\". A biographer described him as being \"a well-dressed, courtly man with silvery back-combed hair and a gentle manner, he bore no resemblance to a fiend\". Figuratively a \"ladykiller\", Addams accompanied women such as Greta Garbo, Joan Fontaine and Jacqueline Kennedy on social occasions."]}]}}