{"wiki_id": "http://www.wikidata.org/entity/Q950967", "itemLabel": "Gordon McQueen", "itemDescription": "Scottish association football player and manager (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_McQueen", "wikipedia_page": {"main": "Gordon McQueen (born 26 June 1952) is a Scottish former professional footballer who played as a centre-back for St Mirren, Leeds United and Manchester United. McQueen also represented Scotland.", "link_mentions": [{"page": "June 26", "response": ["*1952 – Gordon McQueen, Scottish footballer and manager"]}, {"page": "Manchester United F.C.", "response": ["Dave Sexton replaced Docherty as manager in the summer of 1977. Despite major signings, including Joe Jordan, Gordon McQueen, Gary Bailey, and Ray Wilkins, the team failed to win any trophies; they finished second in 1979–80 and lost to Arsenal in the 1979 FA Cup Final. Sexton was dismissed in 1981, even though the team won the last seven games under his direction.Barnes et al. (2001), p. 20. He was replaced by Ron Atkinson, who immediately broke the British record transfer fee to sign Bryan Robson from his former club West Bromwich Albion. Under Atkinson, Manchester United won the FA Cup in 1983 and 1985 and beat rivals Liverpool to win the 1983 Charity Shield. In 1985–86, after 13 wins and two draws in its first 15 matches, the club was favourite to win the league but finished in fourth place. The following season, with the club in danger of relegation by November, Atkinson was dismissed.Barnes et al. (2001), pp. 20–1."]}, {"page": "Jack Charlton", "response": ["Charlton was limited to 25 appearances in the 1972–73 campaign and suffered an injury in the FA Cup semi-final against Wolves which ended his season. After failing to regain his fitness for the final, he announced his retirement. Madeley played in his place but Gordon McQueen had been signed as his long-term replacement. He played his testimonial against Celtic, and was given £28,000 of the £40,000 matchday takings."]}, {"page": "Don Revie", "response": ["Looking for a successor to Jack Charlton, early in the 1972–73 season he signed Gordon McQueen from St Mirren for £30,000. He also spent £100,000 on defender Trevor Cherry and £35,000 on centre-half Roy Ellam, both from Huddersfield Town, and started playing young Scottish forward Joe Jordan more regularly. Leeds again came close to a Treble, but their league title campaign tailed off and they finished third, some seven points behind champions Liverpool. They did reach the 1973 FA Cup Final to face Second Division Sunderland, but despite manager turned pundit Brian Clough's remark that \"there is no way Sunderland can beat Leeds\", United lost 1–0. Leeds also reached the final of the European Cup Winners' Cup against Italian club A.C. Milan at the Kaftanzoglio Stadium, where they were beaten 1–0 following some controversial refereeing from Christos Michas which eventually saw Norman Hunter sent-off after he reacted badly to being consistently fouled by pushing Gianni Rivera to the ground. In 2009, Yorkshire and the Humber MEP Richard Corbett unsuccessfully petitioned the European Parliament to reverse the result of the match over allegations that Michas accepted a bribe from the Italian side."]}]}}