{"wiki_id": "http://www.wikidata.org/entity/Q951385", "itemLabel": "Eddie Chapman", "itemDescription": "English spy", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Chapman", "wikipedia_page": {"main": "Edward Arnold Chapman (16 November 1914 – 11 December 1997) was an English criminal and wartime spy. During the Second World War he offered his services to Nazi Germany as a spy and subsequently became a British double agent. His British Secret Service handlers codenamed him Agent Zigzag in acknowledgement of his erratic personal history.\nHe had a number of criminal aliases known by the British police, amongst them Edward Edwards, Arnold Thompson and Edward Simpson. His German codename was Fritz or, later, after endearing himself to his German contacts, its diminutive form of Fritzchen.", "link_mentions": [{"page": "December 11", "response": ["*1997 – Eddie Chapman, English spy (b. 1914)"]}, {"page": "November 16", "response": ["*1914 – Eddie Chapman, English spy (d. 1997)"]}, {"page": "Sabotage", "response": ["During World War II, British subject Eddie Chapman, trained by the Germans in sabotage, became a double agent for the British.  The German Abwehr entrusted Chapman to destroy the British de Havilland Company's main plant which manufactured the outstanding Mosquito light bomber, but required photographic proof from their agent to verify the mission's completion. A special unit of the Royal Engineers known as the Magic Gang covered the de Havilland plant with canvas panels and scattered papier-mâché furniture and chunks of masonry around three broken and burnt giant generators. Photos of the plant taken from the air reflected devastation for the factory and a successful sabotage mission, and Chapman, as a British sabotage double-agent, fooled the Germans for the duration of the war."]}, {"page": "Double-Cross System", "response": ["* Zigzag – Eddie Chapman"]}, {"page": "Fritz", "response": ["*Fritz or Fritzchen, German code name for Second World War Allied double agent Eddie Chapman"]}, {"page": "Littleport", "response": ["On 16 December 1944, British double agent Eddie Chapman was flown on a mission to Britain by the Germans in a fast and manoeuvrable small fighter plane, that took off from a forward Luftwaffe fighter station on the Dutch coast. The purpose of the mission was to monitor the accuracy of V-1 flying bombs and V-2 rockets falling on London and then to report back their effect on the morale of the population in order to improve the performance and devastation of the attacks. After following the bombs to London, Chapman's fighter rerouted to East Anglia to enable him to bail out over flat ground."]}, {"page": "Laurence Harvey", "response": ["Even more successful was Harvey's next Hollywood film, MGM's BUtterfield 8 (1960), which won Elizabeth Taylor her first Oscar. He was named for The Eddie Chapman Story but it was not made until years later, as Triple Cross with Christopher Plummer.Laurence Harvey Star in Famous Spy Story Hopper, Hedda. Chicago Daily Tribune 22 July 1960: b4."]}, {"page": "British Free Corps", "response": ["* Eric Pleasants and Eddie Chapman. I Killed to Live : the Story of Eric Pleasants, as Told to Eddie Chapman. London: Cassell & Company, 1957."]}, {"page": "Eidsvoll", "response": ["* Dagmar Lahlum (1923–1999), resistance worker in WWII , fiancée of Eddie Chapman"]}, {"page": "Coldstream Guards", "response": ["* Eddie Chapman criminal and World War II British double agent served with the Coldstream Guards."]}, {"page": "World War II/Zig Zag", "response": ["#REDIRECT Eddie Chapman"]}, {"page": "Double agent", "response": ["!Eddie Chapman \"ZigZag\""]}, {"page": "Christopher Plummer", "response": ["He was in Inside Daisy Clover (1965), then played World War Two agent Eddie Chapman in Triple Cross (1966), and had a supporting role as Field Marshal Erwin Rommel in The Night of the Generals (1967). Plummer was cast to replace Rex Harrison for the film adaptation of Doctor Dolittle. This decision was later reversed, but Plummer was nonetheless paid $87,500 for signing the contract. At the same time, Plummer was performing in the stage play The Royal Hunt of the Sun and his whole Dolittle participation was so brief that Plummer never missed a performance."]}, {"page": "Elyesa Bazna", "response": ["The Abwehr was right to worry about the presence of British double agents within their secret service. They were at that time already running \"Garbo\" (Juan Pujol), \"Zig-Zag\" (Eddie Chapman) and \"Tricycle\" (Dušan Popov), supposedly German agents to whom they were paying large sums of money but who were in reality working for the British and supplying the Germans with false information."]}, {"page": "Timewatch", "response": ["| \"Double Agent: The Eddie Chapman Story\""]}, {"page": "Burnopfield", "response": ["* Eddie Chapman (1914–1997), criminal and double agent for Nazi Germany and the UK."]}, {"page": "Codename Zig-Zag", "response": ["#REDIRECT Eddie Chapman"]}, {"page": "Shenley", "response": ["Manor Lodge School, an independent primary school for children aged 4–11, is located in the village. The school is based in a grade II listed building formerly known as Shenley Lodge which appeared as the \"Cat Lady\"'s house in Stanley Kubrick's A Clockwork Orange. It was also home to Second World War double agent Eddie Chapman."]}, {"page": "Coal torpedo", "response": ["Both the American OSS and the British SOE used forms of exploding coal in World War II.H. Keith Melton. The Ultimate Spy Book. New York:DK Publishing, 1996, pg. 97.;   The German commandos who came ashore on Long Island in 1942 as part of Operation Pastorius carried plastic explosives disguised as coal for use against coal-fired electric generating plants.Joel Samaha, Sam Root, and Paul Sexton, eds. Transcript of Proceedings before the Military Commission to Try Persons Charged with Offenses against the Law of War and the Articles of War, Washington D.C., July 8 to July 31, 1942. Minneapolis: University of Minnesota, 2004, page 210. Such a German coal torpedo was given to the British double agent Eddie Chapman (also known as \"Agent Zig-Zag\") to sabotage the merchant ship City of Lancaster, but he passed it on to his MI5 handler instead. Similar devices were also made by the Japanese during World War II."]}, {"page": "Edward Chapman", "response": ["*Eddie Chapman (1914–1997), British double agent code name Zig-Zag during World War II", "*Eddie Chapman (footballer) (1923–2002), West Ham United player and club secretary"]}, {"page": "German occupation of the Channel Islands", "response": ["No islanders joined active German military units though a small number of UK men who had been stranded on the islands at the start of the occupation joined up from prison. Eddie Chapman, an Englishman, was in prison for burglary in Jersey when the invasion occurred, and offered to work for the Germans as a spy under the code name Fritz, and later became a British double agent under the code name ZigZag."]}, {"page": "Eric Pleasants", "response": ["Pleasants' autobiography was ghost-written by Eddie Chapman, a British safe-breaker and double agent whom Pleasants befriended in German custody, under the title I Killed to Live – The Story of Eric Pleasants as told to Eddie Chapman, Cassell & Co, 1957. Another version appears to have been edited by Ian Sayer and Douglas Botting and published posthumously as Hitler's Bastard: Through Hell and Back in Nazi Germany and Stalin's Russia, Random House, 2012."]}]}}