{"wiki_id": "http://www.wikidata.org/entity/Q951726", "itemLabel": "David Essex", "itemDescription": "actor, Singer, Song Writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Essex", "wikipedia_page": {"main": "David Essex  (born David Albert Cook; 23 July 1947) is an English singer, songwriter, and actor. Since the 1970s, he has attained 19 Top 40 singles in the UK (including two number ones) and 16 Top 40 albums. Internationally, Essex had the most success with his 1973 single \"Rock On\". He has also had an extensive career as an actor.", "link_mentions": [{"page": "Isle of Wight", "response": ["* The British film That'll Be the Day (1973), starring David Essex and Ringo Starr, included scenes shot in Ryde (notably Cross Street), Sandown (school), Shanklin (beach) and Wootton Bridge (fairground);"]}, {"page": "July 23", "response": ["*  1947   – David Essex, English singer-songwriter, and actor"]}, {"page": "The Who", "response": ["By 1974, work had begun in earnest on a Tommy film. Stigwood suggested Ken Russell as director, whose previous work Townshend had admired. The film featured a star-studded cast, including the band members. David Essex auditioned for the title role, but the band persuaded Daltrey to take it. The cast included Ann-Margret, Oliver Reed, Eric Clapton, Tina Turner, Elton John and Jack Nicholson. Townshend and Entwistle worked on the soundtrack for most of the year, handling the bulk of the instrumentation. Moon had moved to Los Angeles, so they used session drummers, including Kenney Jones (who would later join the Who). Elton John used his own band for \"Pinball Wizard\". Filming was from April until August. 1500 extras appeared in the \"Pinball Wizard\" sequence."]}, {"page": "Mutiny on the Bounty (novel)", "response": ["*A musical based on the same story appeared in the West End during the 1980s. It was written by and starred David Essex."]}, {"page": "Antonio Banderas", "response": ["He appeared in several major Hollywood releases in 1995, including a starring role in the Robert Rodriguez-directed film Desperado and the antagonist on the action film Assassins, co-starred with Sylvester Stallone. In 1996, he starred alongside Madonna in Evita, an adaptation of the musical by Andrew Lloyd Webber and Tim Rice in which he played the narrator, Che, a role played by David Essex in the original 1978 West End production. He also had success with his role as the legendary masked swordsman Zorro in the 1998 film The Mask of Zorro. In 1999, he starred in The 13th Warrior, a movie about a Muslim caught up in a war between the Northman and human eating beasts."]}, {"page": "Mutiny on the Bounty", "response": ["A musical Mutiny! played at the Piccadilly Theatre in London's West End for 16 months from 1985. It was co-written by David Essex based on the novel Mutiny on the Bounty and starred Essex as Fletcher Christian.  Morecambe and Wise produced a spoof \"play what Ernie wrote\" called Monty on the Bonty, starring  Arthur Lowe as Captain Bligh."]}, {"page": "Cat Stevens", "response": ["Stevens formally converted to the Muslim faith on 23 December 1977, taking the name Yusuf Islam in 1978. Yusuf is the Arabic rendition of the name Joseph; he stated that he \"always loved the name Joseph\" and was particularly drawn to the story of Joseph in the Qur'an. Although he discontinued his pop career, he was persuaded to perform one last time before what became his 25-year musical hiatus. Appearing with his hair freshly shorn and an untrimmed beard, he headlined a charity concert on 22 November 1979 in Wembley Stadium to benefit UNICEF's International Year of the Child. The concert closed with his performance along with David Essex, Alun Davies, and Islam's brother, David Gordon, who wrote the finale song  \"Child for a Day\"."]}, {"page": "Surbiton", "response": ["* David Essex – musician, singer-songwriter and actor, lived on Ditton Road for 16 years until 2002."]}, {"page": "West Ham", "response": ["*David Essex, musician"]}, {"page": "Plaistow, Newham", "response": ["Singers David Essex, Ronnie Lane, Sandra Kerr, Jade Ewen, Mumzy Stranger and Alison Hinds were born in Plaistow, as were comedian and folk singer Richard Digance and grime artists Ghetts and Crazy Titch. Singer and entertainer Joe Brown was born in Lincolnshire but lived in Plaistow from the age of two. Rapper 21 Savage was born in Plaistow and moved as a youth to Atlanta in the United States. Record producer Norman Newell was born in Plaistow."]}, {"page": "Jeff Wayne's Musical Version of The War of the Worlds", "response": ["* David Essex – spoken words and vocals (The Artilleryman)", "Jeff Wayne's Musical Version of The War of the Worlds was created by composer Jeff Wayne based on the 1898 novel by H. G. Wells. It features Academy Award nominated actor Richard Burton, Justin Hayward (of The Moody Blues), Chris Thompson (of Manfred Mann's Earth Band), Phil Lynott (of Thin Lizzy), Julie Covington (of Evita and Rock Follies), and David Essex (Evita, The China Plates). Wayne conducts what would come to be known as the Black Smoke Band and the ULLAdubULLA string orchestra.", "*How We Made War of the Worlds: Jeff Wayne and David Essex: how we made The War of the Worlds"]}, {"page": "Catherine Zeta-Jones", "response": ["Zeta-Jones briefly dabbled with a singing career in the early 1990s. In 1992, she provided her voice to the character of actress Jean Simmons in Jeff Wayne's musical retelling of Spartacus, entitled Jeff Wayne's Musical Version of Spartacus. Three years later, she released her first single, \"In the Arms of Love\", on Wayne's Wow! Records. She later sang \"True Love Ways\", a duet with David Essex in 1994.", "The success of The Darling Buds of May (1991–93) made Zeta-Jones a popular celebrity in Britain, and her personal life has since been chronicled by the media. Her relationships in the early 1990s with television personality John Leslie, singer David Essex, and pop star Mick Hucknall were widely reported by the British press. In the mid-1990s, she was briefly engaged to Scottish actor Angus Macfadyen. In a 1995 interview with the Daily Mirror, she described her lifestyle thus: \"I drink, I swear, I like sex\"."]}, {"page": "List of one-hit wonders in the United States", "response": ["*David Essex – “Rock On” (1974)"]}, {"page": "Tommy (The Who album)", "response": ["The album and concerts featured an all-star cast, including Graham Bell (as The Lover), Maggie Bell (as The Mother), Sandy Denny (as The Nurse), Steve Winwood (as The Father), Rod Stewart (as The Local Lad), Richie Havens (as The Hawker), Merry Clayton (as The Acid Queen) and Ringo Starr (as Uncle Ernie). Townshend played some guitar, but otherwise the music was predominantly orchestral. Richard Harris played the role of the specialist on the record, but he was replaced by Peter Sellers for the stage production. The stage show had a second run on 13 and 14 December 1973 with a different cast including David Essex, Elkie Brooks, Marsha Hunt, Vivian Stanshall, Roy Wood, and Jon Pertwee."]}, {"page": "Chris Barrie", "response": ["Barrie was born in Hanover, Lower Saxony, West Germany, to a father who was serving in the British Army, and attended Methodist College Belfast boarding school in Northern Ireland. After dropping out of his Combined Studies course at Brighton Polytechnic, he became a grave filler. He then began his television career as a sports personality impersonator on The David Essex Showcase in 1982."]}, {"page": "1973 in music", "response": ["* Rock On – David Essex"]}, {"page": "1974 in music", "response": ["*David Essex – David Essex"]}, {"page": "1975 in music", "response": ["\"Hold Me Close\" – David Essex (3)"]}, {"page": "1947 in music", "response": ["*July 23 – David Essex, singer and actor"]}, {"page": "1974 in film", "response": ["*Stardust, directed by Michael Apted, starring David Essex, Adam Faith and Larry Hagman – (U.K.)"]}, {"page": "1973 in film", "response": ["*That'll Be the Day, starring David Essex, Rosemary Leach, Ringo Starr – (U.K.)"]}, {"page": "Tim Rice", "response": ["*\"A Winter's Tale\", written with Mike Batt and recorded by David Essex (1982)."]}, {"page": "Adam Faith", "response": ["Faith’s acting career declined after a 1973 motor car accident in which he almost lost a leg. He restarted with a role in Stardust (1974) as the manipulative manager of rock star David Essex, for which he was nominated for a BAFTA award. Despite this success, he remained reluctant to act for some years, and turned back to music-related ventures."]}, {"page": "Grammy Award for Best New Artist", "response": ["* David Essex"]}, {"page": "Evita (musical)", "response": ["| align=\"center\" | David Essex", "Evita opened at the Prince Edward Theatre on 21 June 1978 and closed on 18 February 1986, after 3,176 performances.Evita at Prince Edward Theatre thisistheatre.com, retrieved 17 March 2010. Elaine Paige played Eva with David Essex as Che, Joss Ackland as Perón, and Siobhán McCarthy as Mistress.Citron, p. 232. Paige was selected from among many hopefuls, after Julie Covington declined the role. The production was directed by Harold Prince, choreographed by Larry Fuller, and produced by Robert Stigwood. Paige was succeeded by Marti Webb, Stephanie Lawrence, Siobhán McCarthy (who had played The Mistress when the show opened), Jacquey Chappell and ultimately, Kathryn Evans with Maria Morgan.Inverne, J. \"Jack Tinker: A Life in Review\", p. 21, Oberon, 1997.", "Gary Bond replaced David Essex as Che, then Mark Ryan, who had first starred as Magaldi, later assumed the role, followed by Martin Smith and Jimmy Kean. Ackland's replacements included John Turner, Oz Clarke and Daniel Benzali.", "This production won The Society of West End Theatre (S.W.E.T) award as Musical of the Year, and Elaine Paige won the award for Performance of the Year in a Musical. Harold Prince (Director of the Year) and David Essex (Performance of the Year in a Musical) received S.W.E.T. nominations.Award-Winners-1978 \"S.W.E.T Award Winners 1978\" Olivierawards.com, accessed 21 December 2011", "| David Essex", "* David Essex"]}, {"page": "Dave Edmunds", "response": ["Edmunds' only acting role followed, as a band member in the David Essex movie Stardust.Edmunds also appeared in the Paul McCartney film, Give My Regards to Broad Street, but just as part of McCartney's backing band. After learning the trade of producer, culminating in a couple of singles in the style of Phil Spector, \"Baby I Love You\" and \"Born to Be with You\", he became linked with the pub rock movement of the early 1970s, producing (among others) Brinsley Schwarz, Ducks Deluxe, Flamin' Groovies, and blues rock band Foghat, using a stripped down, grittier sound."]}, {"page": "Kenney Jones", "response": ["Jones has been featured on recordings as a guest drummer on many recording sessions, including appearances on albums by Rod Stewart, The Rolling Stones, Ronnie Wood, Roger Daltrey, Andy Fairweather-Low, Joan Armatrading, Keith Moon, Marsha Hunt, Mike Batt, Pete Townshend, Chuck Berry, Jerry Lee Lewis, David Essex, John Lodge and Wings. He was also on a Top of the Pops performance with Status Quo, performing their 1986 hit single, \"Red Sky\"."]}, {"page": "Top of the Pops", "response": ["The end of 1988 was marked by a special 70-minute edition of the show broadcast on 31 December 1988, to celebrate the 25th anniversary of the first show. The pre-recorded programme featured the return of the original four presenters (Savile, Freeman, Murray and Jacobs) as well as numerous presenters from the show's history, anchored by Paul Gambaccini and Mike Read. Numerous clips from the history of the show were included in between acts performing in the studio, which included Cliff Richard, Engelbert Humperdinck, Lulu, the Four Tops, David Essex, Mud, Status Quo, Shakin' Stevens, the Tremeloes and from the very first edition, the Swinging Blue Jeans. Sandie Shaw, the Pet Shop Boys and Wet Wet Wet were billed in the Radio Times to appear, but none featured in the show other than Shaw in compilation clips."]}, {"page": "Michael Praed", "response": ["* George Herbert in The War of the Worlds musical with Madalena Alberto, Heidi Range, David Essex, Jimmy Nail and Daniel Bedingfield at the Dominion Theatre (2016)."]}, {"page": "Nigel Planer", "response": ["His first break in the theatre was understudying David Essex as Che Guevara in the original West End run of Evita."]}, {"page": "Daniel Ash", "response": ["In June 2009, Ash released a cover of the David Essex song \"Rock On\", featuring singer Zak Ambrose on vocals. Recorded at the Swing House rehearsal and recording complex in Hollywood, the track is on the Swing House Sessions Vol 1 EP.  Later in 2009, Ash released a four-song EP exclusively through iTunes, entitled \"It's A Burn Out\"."]}, {"page": "Jude Law", "response": ["* \"Rock On\", the David Essex song, performed in Love, Honour and Obey, (2000)"]}, {"page": "Aspects of Love", "response": ["A new UK tour began on 31 August 2007, the first production in 15 years. It starred David Essex as George Dillingham, along with Matt Rawle, Shona Lindsay, and Poppy Tierney. The production was directed by Nikolai Foster, with musical direction by Andrew J.Smith. It opened at the Theatre Royal, Newcastle upon Tyne, and toured for 36 weeks through 8 December 2007. Rawle was later replaced by Tim Rogers.Lathan, Peter.\"Review\"'Aspects of Love' britishtheatreguide.info, 2007, retrieved 16 January 2010"]}, {"page": "Godspell", "response": ["Godspell opened at the Roundhouse Theatre in Chalk Farm, London on November 17, 1971. This London production featured Jacquie-Ann Carr, Julie Covington, David Essex, Neil Fitzwiliam, Jeremy Irons, Verity-Anne Meldrum, Deryk Parkin, Tom Saffery, Gay Soper, and Marti Webb. After a successful run at the Roundhouse Theatre, the production transferred to the Wyndham's Theatre, also in London, on January 26, 1972.with Barry Stokes \"'Godspell'\", Thebeautifulchanges.co.uk. with Barry Stokes."]}, {"page": "Saint Etienne (band)", "response": ["The 2005 album Tales from Turnpike House features David Essex as a guest vocalist. Several tracks on the album were co-written and co-produced by Brian Higgins' songwriting production team, Xenomania."]}, {"page": "Andy Summers", "response": ["In London, Summers recorded and toured with acts including Kevin Coyne, Jon Lord, Joan Armatrading, David Essex, Neil Sedaka and Kevin Ayers. In October 1975 he participated in an orchestral rendition of Mike Oldfield's \"Tubular Bells\"."]}, {"page": "Ventnor", "response": ["* The 1973 film That'll Be the Day, starring David Essex, Rosemary Leach and Ringo Starr, was partly filmed on the island including in Ventnor."]}, {"page": "List of musicals: A to L", "response": ["| David Essex", "| jukebox featuring the songs of David Essex."]}, {"page": "Rotten Apples", "response": ["Rotten Apples was released on November 20, 2001. According to Dan Tallis, writing for BBC, this album was \"[a] rare pleasure these days, a collection of tracks that span a band's career that can actually justify the Greatest Hits title.\" Regarding the Judas O disc, Tallis wrote, \"[t]he Judas O B-sides and rarities collection will satisfy Pumpkin obsessives with its outtakes from the Adore and Machina sessions, but it simply cannot compete with its sister CD. 'Here's to the Atom Bomb', 'Waiting' and 'Rock On', (yes, a cover of the David Essex classic - which also features lyrics from Van Halen songs) stand out from the others, which at worst slip into incoherent rock ramblings.\"", "All tracks written by Billy Corgan, except for \"Believe\" written by James Iha and \"Rock On\" written by David Essex.", "| 12||\"Rock On\"||*||David Essex cover, live recording of a song that was often played during the Sacred and Profane tour||6:06"]}, {"page": "David Puttnam", "response": ["Puttnam and Lieberson produced the documentaries Peacemaking 1919 (1971), Glastonbury Fayre (1972), and Bringing It All Back Home (1972). Their second film, The Pied Piper (1972), directed by Jacques Demy was not a success, but That'll Be the Day (1973) with David Essex proved a hit."]}, {"page": "Clifton Cathedral", "response": ["*The cathedral interior was used as the set for the video of David Essex's UK Singles Chart Number 3 hit Oh! What A Circus (from the 1978 musical Evita by Andrew Lloyd Webber & Tim Rice). [Video available on YouTube]. The votive candelabra features heavily."]}, {"page": "Music of the United Kingdom (1970s)", "response": ["The early 1970s were probably the decade when British pop music was most dependent on the group format, with pop acts, like rock bands, playing guitars and drums, with occasional additions of keyboard or orchestration. Some of these groups were in some sense \"manufactured\", but many were competent musicians, playing on their own recordings and writing their own material. In addition to the glam and glitter rock bands who enjoyed considerable success in the early 1970s. Aiming much more for the teen market, partly in response to US pop groups were The Rubettes and The Bay City Rollers.B. Longhurst, Popular Music and Society (Wiley-Blackwell, 1995), p. 245. Largely vocal-based groups included the New Seekers, Brotherhood of Man, the last of these designed as a British answer to ABBA.E. Vincentelli, ABBA Gold (Continuum, 2004), p. 50. Individuals who enjoyed successful pop careers in this period included Gilbert O'Sullivan, David Essex, Leo Sayer, Rod Stewart and Elton John. In addition there were the rock and roll revivalists Mud, Showaddywaddy and Alvin Stardust.S. Brown, Marketing: the Retro Revolution (SAGE, 2001), p. 131. This pattern changed radically in the late 1970s as a result of the impact of punk rock."]}, {"page": "Marti Webb", "response": ["During the 1970s, Webb carved out a career as a respected, though not yet famous, West End actress and singer. In 1971, she was one of the original company of the London production of Godspell, the musical based on the Gospel of Matthew, opposite David Essex, Julie Covington and Jeremy Irons. The original London cast recording of the production includes her performance of \"Bless the Lord\".", "|David Essex", "|A Marti Webb special, with guests David Essex, Christopher Gable and Angela Richards"]}, {"page": "Fletcher Christian", "response": ["* David Essex in Mutiny! (1985)"]}, {"page": "Tony Adams (actor)", "response": ["Adams was born in Anglesey, Wales, and he trained as an actor at the Italia Conti Stage School. As a child, he appeared on the London stage, Other stage appearances included a starring role opposite Cheryl Kennedy in a West End revival of The Boy Friend, and he also appeared on the original cast album released with this production. He also appeared with the Royal Shakespeare Company, and in pantomime with David Essex.  He made his name as Dr Neville Bywaters in the 1970s soap, General Hospital. He also appeared in the Doctor Who serial The Green Death (1973) as Elgin. However, Adams became ill with peritonitis during filming and some of his lines were given to another character."]}, {"page": "Michael Damian", "response": ["Damian has released five albums with eight top 40 hits, including his number-one cover of the David Essex song \"Rock On\" (from the Dream a Little Dream soundtrack), which was certified gold in 1989. He also won a BMI Song-writing Award for his hit single \"Was It Nothing at All.” He made his feature film directorial debut with an indie comedy, Hot Tamale, which he co-wrote with his wife Janeen, who is the daughter of actor James Best. Following in the family film genre, he directed the films Moondance Alexander, Flicka 2, Marley & Me: The Puppy Years, Flicka: Country Pride, and A Princess for Christmas. In 2012, he directed and co-wrote, again with his wife, the 90-minute romantic comedy The Sweeter Side of Life, co-starring his father-in-law veteran actor James Best in his last film role. The film premiered on the Hallmark Channel on January 19, 2013."]}, {"page": "Jimmy Nail", "response": ["He had been due to reprise his role in the UK premiere at Northern Stage on 12 March 2018. The show's producer Karl Sydow stated: \"After protracted negotiations carried out in good faith, we regret to announce the production's offer of employment to Jimmy Nail has been withdrawn. Joe McGann will replace him when the show opens in Newcastle in March. Nail said \"I was very much looking forward to appearing in Sting's The Last Ship, particularly here in my home city, sadly that's not to be.\" Nail played Parson Nathaniel in War of the Worlds alongside David Essex at the Dominion Theatre, London in 2016."]}, {"page": "Bummed", "response": ["Ryder said \"Bring a Friend\" is the closest track to a love song on the album, with many of its lines taken from a pornographic magazine he had read while in Amsterdam.Middles 1997, p. 76 \"Do It Better\" was initially called \"E\"; it is centred around a guitar part and Ryder ad-libbing around the phrase \"on one\", which referred to being high on ecstasy. The album's closing track \"Lazy Itis\" has Can-esque drumming patterns and borrows a lyric from \"Ticket to Ride\" (1965) by the Beatles, resulting in a writing credit between Happy Mondays and Lennon–McCartney. Its title phrase was a word the Ryders' grandmother used to say.Spence 2015, p. 138 For the single version of the track, Ryder decided to include lyrics from \"Gonna Make You a Star\" (1974) by David Essex."]}, {"page": "Showaddywaddy", "response": [" In June 2014, Showaddywaddy completed the \"Once In A Lifetime\" arena tour, with Bay City Rollers, David Essex, and The Osmonds. The same month saw the reissue of Showaddywaddy's 2008 The Sun Album (I Betcha Gonna Like It), which contained two new tracks."]}, {"page": "Jona Lewie", "response": ["During the 1990s, Lewie appeared with solo public performances on a 60-day UK tour as guest of the Blues Band, playing venues such as theatres and civic centres, while occasionally playing one-off gigs such as that at the Hackney Empire, London and taking part in occasional radio and television broadcasts. In December 2005, he appeared in Channel 4's Bring Back...The Christmas Number One, along with David Essex and Slade. They only fronted, but did not play on, the studio recording session of \"I'm Going Home\". It failed to secure a recording contract. It was written by ex-Mud star Rob Davis, who also appeared on the show. In 2009, Lewie performed two songs at the London Ukulele Festival. The next year, Lewie joined Captain Sensible and the Glitter Band on their British tour."]}]}}