{"wiki_id": "http://www.wikidata.org/entity/Q952773", "itemLabel": "George Hamilton", "itemDescription": "Scottish footballer (1917-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hamilton_(footballer)", "wikipedia_page": {"main": "George Hamilton (7 December 1917 – May 2001) was a Scottish international footballer, who spent most of his 21-year career with Aberdeen. He also played for Queen of the South, Heart of Midlothian and Hamilton Academical.\n\n", "link_mentions": [{"page": "Aberdeen F.C.", "response": ["Halliday's place in the Aberdeen Hall of Fame was secured after the war when he became the first manager to bring national trophies to Pittodrie. Aberdeen won the Southern League Cup in the 1945–46 season, defeating Rangers 3–2 at Hampden. They then reached the 1947 Scottish Cup final, defeating Hibernian 2–1 with George Hamilton, signed from Halliday's former club Queen of the South, scoring to gain the club's first major trophy. From this early success, Halliday's side reached two more Scottish Cup finals, in 1953 and 1954, though they lost both. Halliday's team were not to be denied, however, and the following season, 1954–55, Aberdeen won their first Scottish League title. Though league winners, the club did not participate in the first European Cup competition—Scotland's place was awarded to Hibernian, who took part by special invitation.", "|align=\"left\"|George Hamilton"]}, {"page": "George Hamilton", "response": ["George Hamilton may refer to:", "* George Hamilton (actor) (born 1939), American actor", "* George Hamilton (musician) (1901–1957), father of the actor George Hamilton", "* George Hamilton IV (1937–2014), American country music performer", "* George Hamilton (Resident Evil), fictional character in the video games Resident Outbreak File #1 and File #2", "* Sir George Hamilton, 1st Baronet, of Donalong (c. 1607–1679), Irish baronet", "* George Hamilton, 3rd Earl of Abercorn (c. 1636 – bef. 1683), Scottish nobleman", "* George Hamilton, 4th Baron Hamilton of Strabane (1636/7 – 1668), Irish peer", "* George Hamilton, 1st Earl of Orkney (1666–1737)", "* George Hamilton (MP for Wells) (c. 1697–1775), Member of Parliament for Wells and for St Johnstown, Donegal", "* George Hamilton (1732–1793), MP for Belfast", "* George Hamilton (1732–1796), MP for Augher", "* George Hamilton-Gordon, 4th Earl of Aberdeen (1784–1860), Prime Minister of the United Kingdom in 1852–1855", "* George Hamilton (city founder) (1788–1836), Canadian politician and founder of Hamilton, Ontario", "* Lord George Hamilton (1845–1927), British politician", "* Sir George Hamilton, 1st Baronet (1877–1947) of Ilford, British politician", "* George Hamilton (canon) (1718–1787), Canon of Windsor", "* George Hamilton (priest) (1823–1905), Archdeacon of Lindisfarne and of Northumberland", "* George Hamilton (moderator) (1635–1712), moderator of the General Assembly of the Church of Scotland in 1699", "* Sir George Hamilton, Comte Hamilton (est. 1635 – 1676), Irish soldier in French service", "* George Hamilton (soldier) (aft. 1658 – aft. 1728), Scottish soldier, Member of Parliament for Anstruther Burghs, and Jacobite", "* George Hamilton (lumber baron) (1781–1839), lumber baron in the Ottawa Valley", "* George Hamilton (Australian police officer) (1812–1883), senior South Australian police commissioner", "* George FitzGeorge Hamilton (1898–1918), British Army officer", "* George Hamilton (footballer) (1917–2001), Scottish footballer", "* George Hamilton (broadcaster) (born 1951), association football commentator with RTÉ", "* George Hamilton (police officer) (born 1967), Chief Constable of the Police Service of Northern Ireland from 2014"]}, {"page": "1950–51 in Scottish football", "response": ["|George Hamilton (3), Jimmy Mason, Willie Waddell "]}, {"page": "1953–54 in Scottish football", "response": ["|George Hamilton"]}, {"page": "Bobby Johnstone", "response": ["Of his seventeen international caps, probably the most memorable was scoring on his debut, a 3–2 win against England at Wembley in which Lawrie Reilly also scored. From Scotland's 22-man 1954 World Cup squad, Scotland decided to take only 13 of the 22 to the finals. Johnstone was in the 13 but withdrew through injury. Staying at home on reserve were the likes of Bobby Combe and Jimmy Binning. George Hamilton was also on reserve but travelled after Johnstone's withdrawal."]}, {"page": "Jackie Henderson", "response": ["Henderson made his representative debut in a B international against England B in March 1953. His first appearance for the senior team came on 6 May, in a friendly at home to Sweden; Scotland lost 2–1. Henderson's only goal for Scotland came on 3 October, in a 3–1 win over Northern Ireland in a 1953–54 British Home Championship that doubled as a qualifying group for the 1954 World Cup. Scotland finished runners-up and qualified. Henderson was included in their 22-man squad, but only 13 of the 22 travelled to the finals. Henderson stayed at home on reserve with the likes of Bobby Combe and Jimmy Binning. Inside forward George Hamilton was also on reserve but travelled after Bobby Johnstone withdrew through injury. His seventh and final senior cap was also against Northern Ireland, in a 2–2 draw on 5 November 1958."]}, {"page": "Saint Mungo Cup", "response": ["|CF ||||George Hamilton"]}, {"page": "George Hamilton (Scottish footballer)", "response": ["#REDIRECT George Hamilton (footballer)"]}, {"page": "Sam Malcolmson", "response": ["Hailing from Dalbeattie, Malcolmson served in the Royal Navy  and in 1969, whilst stationed at R.N.A.S. Culdrose in Cornwall, he played 14 games (5 goals) for Falmouth Town. He went on to play for Airdrieonians,AIRDRIE UNITED:1946/47 – 2007/08, Newcastle Fans. Queen of the SouthQueen of the South players to have been selected for World Cup Finals squad in the profile of George Hamilton and Albion Rovers in Scotland before emigrating in 1974.\"World Cup Doonhamers\" on www.qosfc.com", "Malcolmson scored on his full All Whites international debut in a 2–0 win over Burma on 13 September 1976 and went on to represent the All Whites at the 1982 FIFA World Cup finals in Spain, his sole appearance at the tournament being his last game for New Zealand in a 5–2 defeat against his native Scotland.NZ 1982 World Cup  In doing so became the second of three players with Queen of the South among his ex-clubs to travel to the World Cup finals after George Hamilton and before Bernie Slaven. Malcolmson is the only one of the three to actually play at the finals."]}, {"page": "List of Aberdeen F.C. seasons", "response": ["|align=\"left\"|George Hamilton||17", "|align=\"left\"|George Hamilton||17", "|align=\"left\"|George Hamilton||10", "|align=\"left\"|George Hamilton /Jack Hather||14"]}, {"page": "Fred Martin (footballer)", "response": ["Martin was chosen to represent the Scottish Football League in 1952 and two years later earned his first full Scotland cap in a 1–0 win against Norway, making his debut alongside Dons teammates Paddy Buckley and George Hamilton. He was selected in the Scotland squad for the 1954 World Cup and played in both Scotland's matches, a 1–0 defeat by Austria and a 7–0 defeat by Uruguay. Martin was considered partially responsible for scale of the Uruguayan defeat and dropped, with his inconsistency being highlighted in the media. In the opinion of Scottish football journalist and historian Bob Crampsey \"when the mood was upon him, he could be very good, but at other times, played exactly as you would expect an inside-right to play if shoved between the posts.\""]}, {"page": "1953–54 Scottish Cup", "response": ["|IR |||| George Hamilton"]}, {"page": "1946–47 Scottish Cup", "response": ["|IR |||| George Hamilton"]}, {"page": "Bobby Combe", "response": ["Combe was also a Scotland internationalist, earning three caps in 1948. He made his debut in a 2–0 defeat by England and also appeared against Switzerland and Belgium that year, scoring against the latter. He was selected in Scotland's 22 man squad for the 1954 FIFA World Cup but the Scottish Football Association only budgeted to take 13 players (including only one goalkeeper) to the finals in Switzerland. Combe was one of the nine who did not travel, along with the likes of Ernie Copland and Jimmy Binning. Inside forward George Hamilton was also on reserve, but travelled after Bobby Johnstone withdrew through injury."]}, {"page": "Paddy Buckley", "response": ["Buckley was capped three times by Scotland, making his debut in a 1–0 win over Norway in 1954. Initially selected in the squad for the 1954 FIFA World Cup, injury saw him replaced by club colleague George Hamilton. He scored his only Scotland goal against Wales in a 1–0 win upon his return to fitness in October later that year."]}, {"page": "Billy Houliston", "response": ["In March 1950 Houliston played in a titanic Scottish Cup quarterfinal tussle against Aberdeen. Playing at Palmerston Park and with ex Queens George Hamilton impressing the Dons were three goals up after 15 minutes playing some fine football. A Doug McAvoy goal reduced the deficit back to two goals at half time. Queens unleashed a second half onslaught. Amid some frantic play Queens pulled a goal back with nine minutes remaining from Doug McBain. Houliston playing out of position on the right wing then crossed for McAvoy's second goal to level the scores at 3–3. Frank Watson in the Aberdeen goal pulled off an outstanding last minute save to force a replay back in Aberdeen. In the 28th at Pittodrie minute Aberdeen again went a goal up before Houliston (playing at his preferred centre forward after a tactical reshuffle during the game) lashed home the equaliser from a McAvoy pass. A minute later Queens were ahead for the first time in the tie - McAvoy again the provider for Charlie Johnston this time to trouble the score keeper. With no more goals Queens went through to the semi final for the first time in their history."]}, {"page": "Archie Kelly", "response": ["In December 1947, with Hearts struggling in the League, their manager Davie McLean moved to sign Aberdeen's Scottish international forward George Hamilton, with Archie Kelly and £8,000 going to Aberdeen in recompense. Despite playing only half a season for the Dons, Kelly finished the 1947–48 season as their top League scorer.Archie Kelly, AFC Heritage Trust The following season found Aberdeen battling against relegation and was also frustrating for Kelly on a personal level, as he struggled with a bad knee injury. Aberdeen's main problem was their porous defence; in contrast, with Kelly, Stan Williams, Harry Yorston and the returning George Hamilton, they had a surplus of attacking options and when Motherwell offered £7,000 for Kelly in November 1949, Aberdeen allowed him to leave."]}, {"page": "Scotland national football team results (1940–1959)", "response": ["|George Hamilton (3), Jimmy Mason, Willie Waddell", "|George Hamilton"]}, {"page": "History of Aberdeen F.C.", "response": ["Travers left to become manager of Clyde in 1939, and was replaced by Dave Halliday. Halliday went to his ex club Queen of the South to sign inside forward George Hamilton. This would be as shrewd a signing as Halliday would ever make.1937–1955 Dave Halliday | Aberdeen | Football | Managers | Managers Detail  However Halliday had barely begun his work when the Second World War halted competitive football in the United Kingdom.", "Halliday inspired Aberdeen (now playing in red shirts) to their first senior silverware in 1946, winning the Scottish League Cup (although this was a reduced wartime version of the competition known officially as the Southern League Cup), and taking his team back to Hampden the following season in the same competition, although they were defeated on this occasion.  Aberdeen also reached the Scottish Cup final in that same season, 1946–47, and this time the Cup was won, Hibernian being the defeated finalists.Dave Halliday and George Hamilton profiles on \"Queens Legends\" on the official Queen of the South FC website "]}, {"page": "Ian McMillan (footballer)", "response": ["He was capped six times by the Scotland national team between 1952 and 1961, scoring twice – both against the United States in April 1952. McMillan was in Scotland's 22-man 1954 World Cup squad, but the SFA decided to take only 13 of the group to the finals, with McMillan staying at home on reserve with the likes of Bobby Combe and Jimmy Binning (inside forward George Hamilton was also on reserve, but travelled after Bobby Johnstone withdrew through injury)."]}, {"page": "1945–46 in Scottish football", "response": ["Scotland faced England in one such match on 13 April 1946 at Hampden Park. In front of 139, 468 spectators Scotland won 1–0 with a Jimmy Delaney goal in what was dubbed a 'Victory International'. The Scotland line-up featured: Bobby Brown, Davie Shaw, Jock Shaw, Billy Campbell, Frank Brennan, Jackie Husband, Willie Waddell, Neil Dougall, Jimmy Delaney, George Hamilton, Billy Liddell.", "A second game against England was also played at Maine Road, Manchester on 24 April 1946. This game was neither an official nor a victory international but rather was played as a fundraiser for the victims of the Burnden Park Disaster. A crowd of 70,000 witnessed a 2–2 draw with Willie Thornton scoring twice for Scotland. Their line-up featured: Willie Miller, Davie Shaw, Jock Shaw, Billy Campbell, Frank Brennan, Jackie Husband, Willie Waddell, Neil Dougall, Willie Thornton, George Hamilton, Billy Liddell."]}, {"page": "Johnny Anderson (footballer)", "response": ["He won his only cap for Scotland in their final preparation match for the 1954 FIFA World Cup, against Finland. Although he was named in the finals squad as understudy to Fred Martin, Anderson did not travel to Switzerland as Scotland chose only to take 13 players. Anderson stayed at home on reserve, along with the likes of Bobby Combe and Jimmy Binning. Inside forward George Hamilton was also on reserve but travelled after Bobby Johnstone withdrew through injury."]}, {"page": "David Mathers (footballer)", "response": ["Mathers played once for Scotland, against Finland in what was their final preparation match before the 1954 FIFA World Cup finals. Although named in Scotland's 22-man squad for Switzerland, Scotland decided to take only 13 of the 22 to the finals. Mathers stayed at home on reserve, along with the likes of Bobby Combe and Jimmy Binning. Inside forward George Hamilton was also on reserve, but travelled after Bobby Johnstone withdrew through injury. Mathers also represented the Scottish League once, in 1956."]}, {"page": "Alex Wilson (footballer, born 1933)", "response": ["He won his only cap for Scotland in their last preparation match for the 1954 FIFA World Cup Finals against Finland, this coming after just 25 league matches. Although named in Scotland's 22 man squad for Switzerland, Scotland decided to take only 13 of the 22 to the finals. Wilson stayed at home on reserve with the likes of Bobby Combe and Jimmy Binning. Inside forward George Hamilton was also on reserve but traveled after Bobby Johnstone withdrew through injury."]}, {"page": "Jimmy Binning", "response": ["Binning was recognised internationally when he was given a Scottish League XI cap in 1954, against the English League at Stamford Bridge. Although selected for the 22 man squad for the 1954 FIFA World Cup, the Scottish Football Association only budgeted to take 13 players (including only one goalkeeper) to the finals in Switzerland. Binning was one of the players who stayed at home on reserve with the likes of Bobby Combe and Ernie Copland. Ex-Queens inside forward George Hamilton did travel after Bobby Johnstone with drew through injury."]}]}}