{"wiki_id": "http://www.wikidata.org/entity/Q952491", "itemLabel": "Ian McLagan", "itemDescription": "British musician (1945-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_McLagan", "wikipedia_page": {"main": "Ian Patrick McLagan (; 12 May 1945 – 3 December 2014) was an English keyboard instrumentalist, best known as a member of the English rock bands Small Faces and Faces. He also collaborated with the Rolling Stones and led his own band from the late 1970s. He was inducted into the Rock and Roll Hall of Fame in 2012.", "link_mentions": [{"page": "December 3", "response": ["*  2014   – Ian McLagan, English-American singer-songwriter and keyboard player (b. 1945)"]}, {"page": "Hammond organ", "response": ["Booker T. Jones is cited as being the bridge from rhythm and blues to rock. British organist James Taylor said the Hammond \"became popular [in the UK] when people such as Booker T. & the M.G.'s and artists on the Stax Records label came over to London and played gigs\". Matthew Fisher first encountered the Hammond in 1966, having heard the Small Faces' Ian McLagan playing one. When Fisher asked if he could play it, McLagan told him, \"They're yelling out for Hammond players; why don't you go out and buy one for yourself?\" Fisher played the organ lines on Procol Harum's \"A Whiter Shade of Pale\", which topped the UK charts in the summer of 1967. Steve Winwood started his musical career with the Spencer Davis Group playing guitar and piano, but he switched to Hammond when he hired one to record \"Gimme Some Lovin'\"."]}, {"page": "Keith Moon", "response": ["In 1973 Kim, convinced that neither she nor anyone else could moderate Keith's behaviour, left her husband and took Amanda; she sued for divorce in 1975 and later married Faces keyboard player Ian McLagan. Marsh believes that Moon never truly recovered from the loss of his family. Butler agrees; despite his relationship with Annette Walter-Lax, he believes that Kim was the only woman Moon loved. McLagan commented that Moon \"couldn't handle it.\" Moon would harass them with phone calls, and on one occasion before Kim sued for divorce, he invited McLagan for a drink at a Richmond pub and sent several \"heavies\" to break into McLagan's home on Fife Road and look for Kim, forcing her to hide in a walk-in closet. She died in a car accident in Austin, Texas, on 2 August 2006."]}, {"page": "May 12", "response": ["*  1945   – Ian McLagan, English keyboard player and songwriter (d. 2014)"]}, {"page": "The Rolling Stones", "response": ["* Ian McLagankeyboards (1978–1981; died 2014)"]}, {"page": "2014", "response": ["** Ian McLagan, British musician (b. 1945)"]}, {"page": "List of Rock and Roll Hall of Fame inductees", "response": ["|Kenney Jones, Ronnie Lane, Ian McLagan, Steve Marriott, Rod Stewart, and Ronnie Wood."]}, {"page": "Rod Stewart", "response": ["Mercury Records A&R man Lou Reizner had seen Stewart perform with Beck, and on 8 October 1968 signed him to a solo contract; but contractual complexities delayed Stewart's recording for him until July 1969.Nelson and Bangs, Rod Stewart, pp. 96–97, 100. Meanwhile, in May 1969, guitarist and singer Steve Marriott left English band The Small Faces. Ron Wood replaced him as guitarist in June and on 18 October 1969, Stewart followed his friend and became the band's new singer. The two joined existing members Ronnie Lane, Ian McLagan, and Kenney Jones, who soon decided to call the new line-up Faces.", "The Faces released their final album Ooh La La, which reached number one in the UK and number 21 in the US in 1973. During the recording of the album, the rift between Stewart and the rest of the Faces grew further, as (according to Ian McLagan), Stewart didn't participate until two weeks into the sessions, \"and then complained that some songs were in the wrong key for him. So we recorded them again and waited a week for him to come back. We cut the track for 'Ooh La La' three times before he eventually passed on it, leaving it for Woody to sing. [...] The week the album came out he did all he could to scuttle it and told anyone who would listen how useless it was.\"McLagan, Ian, All The Rage (2011), p. 206. The band toured Australasia, Japan, Europe and the UK in 1974 to support the album and the single \"Pool Hall Richard\"."]}, {"page": "Billy Bragg", "response": ["Around that time, Nora Guthrie (daughter of American folk artist Woody Guthrie) asked Bragg to set some of her father's unrecorded lyrics to music. The result was a collaboration with the band Wilco and Natalie Merchant (with whom Bragg had worked previously). They released the album Mermaid Avenue in 1998, and Mermaid Avenue Vol. II in 2000. The first album was nominated for a Grammy in the Best Contemporary Folk Album category. A third batch, Mermaid Avenue Vol III, and The Complete Sessions followed in 2012 to mark Woody Guthrie's centennial. A rift with Wilco over mixing and sequencing the first album led to Bragg recruiting his own band, The Blokes, to promote the album live. The Blokes included keyboardist Ian McLagan, who had been a member of Bragg's boyhood heroes The Faces. The documentary film Man in the Sand depicts the roles of Nora Guthrie, Bragg, and Wilco in the creation of the Mermaid Avenue albums."]}, {"page": "Keith Richards", "response": ["In the 1970s Richards worked outside the Rolling Stones with Ronnie Wood on several occasions, contributing guitar, piano, and vocals to Wood's first two solo albums and joining him on stage for two July 1974 concerts to promote I've Got My Own Album to Do. In December 1974 Richards also made a guest appearance at a Faces concert. During 1976 and 1977, Richards both co-produced and played on John Phillips's solo recording Pay Pack & Follow (released in 2001). In 1979 he toured the US with the New Barbarians, the band that Wood put together to promote his album Gimme Some Neck; he and Wood also contributed guitar and backing vocals to \"Truly\" on Ian McLagan's 1979 album Troublemaker (re-released in 2005 as Here Comes Trouble)."]}, {"page": "1945 in music", "response": ["*May 12 – Ian McLagan, keyboard player, The Faces (d. 2014)"]}, {"page": "Faces (band)", "response": ["Faces are an English rock band formed in 1969 by members of Small Faces after lead singer/guitarist Steve Marriott left that group to form Humble Pie. The remaining Small Faces—Ian McLagan (keyboards), Ronnie Lane (bass guitar, vocals), and Kenney Jones (drums and percussion)—were joined by Ronnie Wood (guitar) and Rod Stewart (lead vocals), both from the Jeff Beck Group, and the new line-up was renamed Faces.", "A greatest hits collection, Snakes and Ladders / The Best of Faces, appeared in 1976, and additional retrospective albums would appear over the subsequent decades.  Stewart would continue his successful solo career, while Ronnie Wood would formally join the Rolling Stones as a permanent member in 1975.  Kenney Jones joined The Who as a replacement for the deceased Keith Moon in 1978.  Ian McLagan would go on to work as a session and touring musician with a number of acts (including his own bands) throughout the 1970s until his death in 2014, while Ronnie Lane's activities in the music business (which included 1977's critically-lauded Rough Mix collaboration with Pete Townshend) were severely curtailed by 1980 due to the onset of multiple sclerosis which forced his eventual retirement by the early 1990s. ", "The members have had varied post-band careers. Wood joined the Rolling Stones and later became a full member with the departure of Mick Taylor, Lane formed Slim Chance and had a modest solo career that ended prematurely when he was diagnosed with multiple sclerosis and he also worked on an album with Who guitarist Pete Townshend, Rough Mix. Jones joined the Who after the death of Keith Moon; McLagan stated in a 2004 interview that Townshend also asked him to join the Who, but he had already promised Keith Richards that he would tour as a Rolling Stones sideman. McLagan moved to the United States, where he formed Ian McLagan & the Bump Band. Tetsu Yamauchi returned to his native Japan, where he recorded and toured as a jazz musician and Stewart's solo career was extremely successful. There was also a Small Faces reunion in the late 1970s (without Ronnie Lane) that resulted in two albums; and in 1981 Ronnie Lane and Steve Marriott collaborated on the album The Legendary Majik Mijits.", "Faces reformed for the encore of Rod Stewart's Wembley Stadium concert in 1986. Ronnie Lane, by then suffering from multiple sclerosis, was on stage to sing in his wheelchair, but was unable to play bass; Bill Wyman of the Rolling Stones filled in for him. The same line-up reunited once more (minus Lane) in 1993 when Rod Stewart was awarded the Lifetime Achievement award at the Brit Awards. Ronnie Lane made his final concert appearance in 1992 at a Ronnie Wood show with Ian McLagan on keyboards; Lane died in 1997.", "During 2004 and early 2005 the surviving Faces had several near-reunions, none of which featured more than three members at the same time: In May 2004 Kenney Jones and Ronnie Wood joined Ian McLagan on stage at his concert at The Mean Fiddler in London. In August 2004 Wood and McLagan joined Stewart at the Hollywood Bowl; Wood also appeared at several other of Stewart's 2004 gigs, including New York's Madison Square Garden, the Royal Albert Hall and a street performance in London for an audience of 80,000. In March 2005 McLagan joined Ronnie Wood's band at a London show, which also featured Kenney Jones on drums for the final encore; and in December 2005 Wood joined Ian McLagan & the Bump Band for three numbers at a concert in Houston, Texas.", "On 11 June 2008, Rod Stewart announced that the surviving Faces were discussing a possible reunion, envisioning making a recording and/or performing at least one or two concerts. On 18 November Rod Stewart, Ron Wood, Ian McLagan and Kenney Jones reunited along with Rod Stewart's touring bassist Conrad Korsch for a rehearsal \"just to check if they can remember the songs\"; the band's official reunion website was launched earlier the same month. However, on 23 January 2009, a spokesman for Rod Stewart denied there were any plans for a 2009 Faces reunion tour.", "On 24 September 2009, it was announced that the Faces, minus Rod Stewart, would reunite for a one-off charity show for the Performing Rights Society's Music Members' Benevolent Fund, at the Royal Albert Hall in London. \"This will be so special for us, staging a reunion for such a wonderful and prestigious event,\" said Ronnie Wood when the announcement of the concert was made. \"Sadly Ronnie Lane can't be with us, but I'm sure he will be there in spirit, God bless him.\" Lane's ex-wife, Katy, is one of many to receive assistance from the charity. The event was held on 25 October. Ronnie Wood, Kenney Jones and Ian McLagan all took part, with various vocalists, including Mick Hucknall, replacing Stewart, and Bill Wyman filling in for the late Ronnie Lane on bass guitar.", "The Small Faces/Faces were inducted into the Rock and Roll Hall of Fame in 2012. On 23 March, the Faces announced that they would reunite with Rod Stewart to play at the induction ceremony for the first time in 19 years. However, on the eve of the ceremony, Stewart bowed out owing to a bout of influenza and Hucknall was asked to sing in his place.  In June 2013, speaking in an interview on YouTube, Kenney Jones confirmed the band's intention to reunite with Stewart for a tour in 2014. However, Ian McLagan died on 3 December 2014, putting this reunion in doubt.", "*Ian McLagan – keyboards (1969–1975, 1986, 1993, 2009–2012; died 2014)"]}, {"page": "Small Faces", "response": ["Small Faces were an English rock band from London, founded in 1965. The group originally consisted of Steve Marriott, Ronnie Lane, Kenney Jones and Jimmy Winston, with Ian McLagan replacing Winston as the band's keyboardist in 1966. The band was one of the most acclaimed and influential mod groups of the 1960s, recording hit songs such as \"Itchycoo Park\", \"Lazy Sunday\", \"All or Nothing\", and \"Tin Soldier\", as well as their concept album Ogdens' Nut Gone Flake. They evolved into one of the UK's most successful psychedelic bands until 1969.", "Winston was replaced by Ian McLagan, whose keyboard talents and diminutive stature fit with the groove of the band perfectly. McLagan played his first performance with the band on 2 November 1965.", "The new Small Faces line-up hit the charts with their third single, \"Sha-La-La-La-Lee\", released on 28 January 1966. It was written for the group by Mort Shuman (who wrote many of Elvis Presley's biggest singles, including \"Viva Las Vegas\") and popular English entertainer and singer Kenny Lynch. The song was a big hit in Britain, peaking at number three in the UK singles chart. Their first album, Small Faces, released on 11 May 1966, was also a considerable success. They rapidly rose in popularity with each chart success, becoming regulars on British pop TV shows such as Ready Steady Go! and Top of the Pops, and toured incessantly in the UK and Europe. Their popularity peaked in August 1966, when \"All or Nothing\", their fifth single, hit the top of the UK charts. According to Marriott's mother Kay, he is said to have written the song about his breakup with his ex-fiancée Susan Oliver. On the success of \"All or Nothing\" they were set to tour America with the Lovin' Spoonful and the Mamas & the Papas; however, these plans had to be shelved by Don Arden after details of Ian McLagan's recent drug conviction were leaked.", "A posthumous album, The Autumn Stone, was released later in 1969, and included the major Immediate recordings, a rare live concert performance, and a number of previously unreleased tracks recorded for their intended fourth LP, 1862, including the classic Swinging Sixties instrumental \"Wide Eyed Girl on the Wall\" and \"Donkey Rides, A Penny, A Glass\", co-written by Ian McLagan. The final single, \"Afterglow (Of Your Love)\", was released in 1969 after the band had ceased to exist and the single only reached No. 36 in the UK Singles Charts.", "Ian McLagan went on to perform with artists such as Bonnie Raitt, Bob Dylan (the 1984 European Tour), The Rolling Stones, David Lindley and his band El Rayo-X among others, and more recently Billy Bragg. In 1998 he published his autobiography, All the Rage. He lived in a small town of Manor outside Austin, Texas, and was bandleader to his own \"Bump Band\". He died from a stroke on 3 December 2014.Ian McLagan 1945–2014, The Austin Chronicle, 3 December 2014", "*Ian McLagan – keyboards, vocals, guitar, bass (1965–1969, 1975–1978; died 2014)"]}, {"page": "Ronnie Lane", "response": ["The Small Faces consisted of Lane on bass guitar, Marriott as guitarist and lead vocalist, Jones as drummer, and Winston on keyboards. (The name \"Small\" was chosen as they were all under 5'5\" in height.) They made their debut in 1965, with Ian McLagan replacing Winston in November 1965. They had a successful chart career; Lane and Marriott wrote hit singles consistently, including \"Itchycoo Park\" and \"All or Nothing\". At least a dozen successful songs credit Lane, and he co-wrote all but one of the tracks on their 1968 concept album Ogdens' Nut Gone Flake. The album stayed at number one on the UK Albums Chart for six weeks. When Marriott left the group in 1969, they disbanded; they reformed in the late 1970s, but without Lane.", "Lane emigrated to Texas, USA, in 1984 (first to Houston, then Austin), where the climate was more beneficial to his health and he continued playing, writing, and recording. He formed an American version of Slim Chance, which was, as always, a loose-knit conglomeration of available musicians. For much of the time, membership included Alejandro Escovedo. For close to a decade Lane enjoyed \"rock royalty\" status in the Austin area. He toured Japan but his health continued to decline. His last performance was in 1992 at a Ronnie Wood gig alongside Ian McLagan.", "In 1994 Ronnie and his wife Susan moved to the small town of Trinidad, Colorado. Jimmy Page, Rod Stewart and Ronnie Wood funded his medical care as no royalties from the Small Faces work were forthcoming - until Kenney Jones and Ian McLagan were eventually able to secure payments, by which time Steve Marriott had died in a house fire and Lane had also died."]}, {"page": "Atlantic Crossing", "response": ["With Atlantic Crossing, Stewart ended his association with Ronnie Wood, Ian McLagan and the stable of musicians who had been his core collaborators on his classic run of albums for Mercury Records, fusing soul and folk. Instead, he used a group of session musicians, including The Memphis Horns and three-quarters of Booker T. and the MG's. The album was produced by Tom Dowd, the famous engineer and producer on records by so many of Stewart's heroes during Dowd's time on staff at Atlantic Records. The only song performed from this album on The Faces' final US tour in autumn 1975 was \"Three Time Loser\", and the rest of the group heavily disliked Stewart's change in musical direction on this album. Following the success of the album, and his move to the U.S., Stewart announced his exit from the Faces by the end of the year."]}, {"page": "Ronnie Wood", "response": ["The group split in 1969 and Wood departed along with lead vocalist Rod Stewart to join former Small Faces members Ronnie Lane, Ian McLagan, and Kenney Jones in a new group named Faces. The group found great success in the UK and mainland Europe, though achieved only cult status in the US. Wood sang and co-wrote the popular title track from their final LP, Ooh La La, released in 1973.", "In 1969, after Steve Marriott left the Small Faces, Wood began working with the remaining members of that group, returning to his instrument of choice, the guitar. This line-up, plus Rod Stewart and former Bird Kim Gardner, teamed up with Wood's brother Art Wood in a formation called Quiet Melon, making a handful of recordings in May 1969. After the Jeff Beck Group's fifth US tour in July, Wood and Stewart joined the former Small Faces full-time, and the band's name was changed to Faces. During the summer of 1969, Stewart and Wood also set the template for what would become Faces on An Old Raincoat Won't Ever Let You Down, Stewart's first solo album (known as The Rod Stewart Album in the US). The backing band on the album also included Ian McLagan, Keith Emerson, Micky Waller and guitarists Martin Pugh (of Steamhammer and later Armageddon and 7th Order), and Martin Quittenton (also from Steamhammer).", "In 1972, Wood and Faces bassist Ronnie Lane composed the soundtrack to the film Mahoney's Last Stand; the soundtrack, which was released as an LP in 1976, also features Faces bandmates Ian McLagan and Kenney Jones, along with contributions from Pete Townshend and Ric Grech. Wood also performed with Townshend, Grech, Steve Winwood, Jim Capaldi and Eric Clapton at Clapton's Rainbow Concert in 1973.", "On 25 October 2009, Wood, Ian McLagan and Kenney Jones joined forces for a Faces performance at London's Royal Albert Hall on behalf of the Performing Rights Society's Music Members' Benevolent Fund. Bill Wyman played bass and lead vocals were shared by several performers, notably Mick Hucknall. Rod Stewart, who had earlier denied rumours of plans for a Faces reunion in 2009, was not present."]}, {"page": "Boz Burrell", "response": ["Raymond Burrell was born on 1 August 1946 in Holbeach, Lincolnshire. As a teen in the 1950s, he began playing rhythm guitar for the Tea Time 4, a group formed with his school pal Bernie Rudd. They both acquired a passion for jazz and enjoyed acts such as Mose Allison, John Coltrane, and Charles Mingus. The group had several personnel changes and moved to London in 1965 at the suggestion of manager, Jack Barrie. With the addition of Ian McLagan on keyboard and a name change to Boz People, the group secured a contract with EMI's Columbia label."]}, {"page": "England, Half-English", "response": ["#\"Jane Allen\" (Ian McLagan, Martyn Barker, Lu Edmonds, Ben Mandelson, Billy Bragg & the Blokes)", "#\"Distant Shore\" (Ian McLagan, Martyn Barker, Lu Edmonds, Ben Mandelson, Billy Bragg & the Blokes)", "#\"England, Half English\" (Ian McLagan, Martyn Barker, Lu Edmonds, Ben Mandelson, Billy Bragg & the Blokes)", "#\"Baby Faroukh\" (Billy Bragg, Ian McLagan, Martyn Barker, Lu Edmonds, Ben Mandelson)", "#\"Dreadbelly\" (Ian McLagan, Martyn Barker, Lu Edmonds, Ben Mandelson, Billy Bragg & the Blokes)", "*Ian McLagan – Hammond organ, piano"]}, {"page": "Steve Marriott", "response": [" Instead, Marriott, Lane and Jones decided to form their own band, with Marriott bringing along his acquaintance, Jimmy Winston (Winston was later replaced by Ian McLagan). Marriott's friend Annabel, an ex-student from the Italia Conti, came up with the band's distinctive name after commenting that they all had \"small faces\"; the name stuck in part because they were all (apart from Winston) small (none being over 5 ft 6 in tall), and the term \"face\" in English mod culture was the name given to a well-known and respected mod.", "Frampton has said that after Marriott's departure from the Small Faces, the remaining members, Lane, McLagan and Jones, turned up at his home and offered him Marriott's role in the band: \"The following day after the Alexandra Palace gig (where Steve walked off), I was back home and I got a call from Ronnie Lane who said, \"Me, Kenney and Mac would like to come round and see you.\" I thought, 'Hello, what's all this about?' Anyway, they all came round to my horrible little flat in Earls Court and asked me to join the Small Faces. All I could say was it's a bit late now. Why couldn't you have asked me while we were in Paris? We'd all be in the same band together and Steve wouldn't have left.\" Ian McLagan vehemently denied this story.", " held on 30 April 1991, at the Harlow crematorium. Amongst the mourners, noted attendees included ex-Small Faces drummer Kenney Jones, as well as Peter Frampton, Joe Brown, PP Arnold, Terence Stamp, Jerry Shirley and Greg Ridley. Among those who sent wreaths were David Gilmour (of Pink Floyd) and Rod Stewart and his then-wife Rachel Hunter. Nothing was heard from ex-Small Faces members Ian McLagan or Ronnie Lane.", " Other guest appearances included two original members of the Small Faces, Kenney Jones and Ian McLagan, Paul Weller, Noel Gallagher and Bobby Tench from Marriott's 1980's Humble Pie line-up and John's Children. Other musicians such as Alan White, Gem Archer, Midge Ure, Zak Starkey, Rabbit Bundrick, Steve Ellis and Tony Rivers appeared in band line-ups during the two and half-hour concert, released on DVD as the Stevie Marriott Astoria Memorial concert."]}, {"page": "Ian Stewart (musician)", "response": ["Stewart contributed piano, organ, electric piano and/or percussion to all Rolling Stones albums released between 1964 and 1986, except for Their Satanic Majesties Request, Beggars Banquet, and Some Girls. Stewart was not the only keyboard player who worked extensively with the band: Jack Nitzsche, Nicky Hopkins, Billy Preston, and Ian McLagan all supplemented his work. Stewart played piano on numbers of his choosing throughout tours in 1969, 1972, 1975–76, 1978 and 1981–82. Stewart favoured blues and country rockers, and remained dedicated to boogie-woogie and early rhythm & blues. He refused to play in minor keys, saying: \"When I'm on stage with the Stones and a minor chord comes along, I lift my hands in protest.\"Wyman 2002. p. 482. In 1976, Stewart stated, \"You can squawk about money, but the money the Stones have made hasn't done them much good. It's really gotten them into some trouble. They can't even live in their own country now,\" referring to band members' tax exile status to minimize tax obligations on their high incomes and royalty payments."]}, {"page": "List of people from Texas", "response": ["* Ian McLagan (1945–2014), rock keyboardist"]}, {"page": "Izzy Stradlin", "response": ["In December 1999, Stradlin's next solo album, Ride On, was released on the Universal Victor label in Japan. It featured the same line-up as his previous release. To promote the album, Stradlin - with McKagan, Richards, and Bentley— played four shows in Japan the following April. With the addition of keyboardist Ian McLagan, the group recorded two more albums: River, which was released in May 2001 on Sanctuary, and a second Japan-only release, On Down the Road, which followed in August 2002 on JVC Victor."]}, {"page": "Borstal", "response": ["* The British rock band Faces recorded a song (written by Rod Stewart, Ronnie Wood, and Ian McLagan) called \"Borstal Boys\" on their final studio album Ooh La La."]}, {"page": "Lucky Town", "response": ["* Ian McLagan – Hammond organ on \"My Beautiful Reward\""]}, {"page": "United States (disambiguation)", "response": ["* United States, a 2014 album by Ian McLagan"]}, {"page": "Mick Taylor", "response": ["In 1983, Taylor joined Mark Knopfler and played on Dylan's Infidels album. He also appeared on Dylan's live album Real Live, as well as the follow-up studio album Empire Burlesque. In 1984, Dylan asked Mick Taylor to assemble an experienced rock and roll band for a European tour he signed with Bill Graham. Ian McLagan was hired to play piano and Hammond organ, Greg Sutton to play bass and Colin Allen, a long-time friend of Taylor, on drums. The tour lasted for four weeks at venues such as Munich's Olympic Stadium Arena and Milan's San Siro Stadium, sharing the bill with Carlos Santana and Joan Baez, who appeared on the same bill for a couple of shows."]}, {"page": "Ooh La La (Faces album)", "response": ["By the end of 1972, following the critical and commercial successes of Rod Stewart's solo albums, the singer had become increasingly distanced from some of his Faces bandmates, who were frustrated by the fact that by this point they had come to be perceived by the public (and even by some concert promoters) as little more than Stewart's backing band for live work. Stewart himself was reportedly distracted enough by his newfound stardom that he missed the first two weeks of recording sessions for the latest Faces album entirely.Five Guys Walk into a Bar... liner notes, p. 30 The production of the album would continue to be hampered by the singer's apparent lack of commitment to the project, with Stewart not appearing in any capacity on three of the LP's ten released tracks. As a result of this situation, Ooh La La was, according to Ian McLagan, \"Ronnie [Lane]'s album\", with founder member Lane's contributions setting the tone of the LP's quieter, more reflective second side.", "Despite Stewart's misgivings the LP reached number one in the UK Albums Chart during April, being the only collection of original Faces material to achieve that distinction. Rather than celebrate their success, however, the rest of the group were understandably dismayed by the harshness of Stewart's comments, especially considering his perceived lack of commitment to fully participate in the album's recording. In his 2000 autobiography All The Rage, Ian McLagan wrote: \"The week the album came out he did all he could to scuttle it and told anyone who would listen how useless it was\". Ronnie Lane, having assumed the creative workload due to Stewart's apparent disinterest, was especially stung by the vocalist's criticism. No longer content with the prospect of being increasingly sidelined in the band that he had co-founded with Kenney Jones back in 1965, Lane left the Faces early in June, a decision that he would reportedly later regret (if not creatively, then at least financially). His role as bassist (but, tellingly, not as songwriter or secondary vocalist) was filled shortly thereafter by former Free bassist Tetsu Yamauchi.", "#\"Cindy Incidentally\" (Ian McLagan, Stewart, Wood) – 2:37", "#\"Glad and Sorry\" (Lane) – 3:04 (lead singers: Ronnie Lane, Ronnie Wood, Ian McLagan)", "*Ian McLagan – piano, organ, harmonium, backing vocals & co-lead vocal (track 8)"]}, {"page": "Ogdens' Nut Gone Flake", "response": ["After the group returned from their ill-fated tour of Oceania with The Who in January 1968, recording sessions for the album began in earnest through February and March at Olympic, with Glyn Johns at the recording desk. Recording began on two tracks intended for a future single, but ultimately not released in this format: another Marriott/Lane original, \"Rollin' Over\" (initially titled \"Bun in the Oven\") was the projected A-side, with a cover version of \"Every Little Bit Hurts\", as the B-side. Written by Ed Cobb and made famous by Brenda Holloway, the latter track - a slow, soulful ballad - features Marriott on piano instead of his usual guitar, and Ian McLagan on Hammond organ. This track was not released at the time and did not officially appear until the early 1990s, although a longer live version would appear on The Autumn Stone in 1969. \"Rollin' Over\" - another heavy rock workout - would be worked on further however, with Marriott tracking two attempts at a new lead vocal - one take appearing on the mono single release and the other on the stereo album release. Marriott also duets with himself on the verses, singing both harmonies. The mono version of \"Rollin' Over\" would later be released as the b-side of the \"Lazy Sunday\" single in the UK, while the stereo version found itself incorporated into the musical suite on side two of the LP.", "The 2006 Castle Music/Sanctuary Records 3-disc \"tobacco tin\" Special Edition includes fully remastered mono and stereo mixes complete with segue, plus an episode of the BBC Radio documentary series Classic Albums in which the band discuss the making of the album. A second 3-disc Deluxe Edition was released in 2012 on Charly Records, this time, overseen by surviving band members Ian McLagan and Kenney Jones, and featured newly remastered mono and stereo mixes complete with segue, with the third disc full of outtakes and alternative takes, versions and mixes, including some specially mixed from newly discovered original session tapes. In countries other than the UK, however, the 2012 3-disc version was a limited edition and was replaced a year later by a two CD version with conventional packaging, and the stereo mix is omitted completely from the package.", "*Ian McLagan − backing vocals, organ, piano, harpsichord, Mellotron, electric guitar and bass guitar on \"Long Agos and Worlds Apart\", lead vocals on \"Long Agos and Worlds Apart\""]}, {"page": "Ringo Starr discography", "response": ["| Ian McLagan"]}]}}