{"wiki_id": "http://www.wikidata.org/entity/Q956623", "itemLabel": "George Lyon", "itemDescription": "British politician (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Lyon_(Scottish_politician)", "wikipedia_page": {"main": "George Lyon (born 16 July 1956) is a Scottish Liberal Democrat politician, and a former Member of the European Parliament (MEP) for Scotland.Lyon is a former farmer from the Isle of Bute, and previous National Farmers Union of Scotland president. From 1999 to 2007 he was the Member of the Scottish Parliament (MSP) for Argyll and Bute, and served as both Chief Whip and Deputy Finance Minister. A member of the Alliance of Liberal Democrats in Europe (ALDE) group whilst in the European Parliament, Lyon was lead spokesperson for ALDE on the Agriculture Committee. Lyon was also vice-chair of the EP's Budget Committee.", "link_mentions": [{"page": "Highlands and Islands (Scottish Parliament electoral region)", "response": ["| rowspan=\"3\"| George Lyon(LD)"]}, {"page": "Elspeth Attwooll", "response": ["She was first elected to the European Parliament in 1999, the first Liberal Democrat ever to be elected to the European Parliament from Scotland, and retained her seat in 2004. While an MEP, she served on the Fisheries and Regional Development Committees, being elected a vice-chair of the former. She stood down as MEP at the 2009 European Parliamentary elections, and was succeeded by fellow Liberal Democrat George Lyon, a farmer and former MSP for Argyll and Bute."]}, {"page": "Jim Mather", "response": ["Mather contested Argyll and Bute again at the 2007 Scottish Parliament Election and was successful, winning the seat from George Lyon of the Scottish Liberal Democrats."]}, {"page": "Scotland (European Parliament constituency)", "response": ["| George LyonLiberal Democrat"]}, {"page": "George Lyon", "response": ["George Lyon may refer to:", "*George Lyon (Scottish politician) (born 1956), Scottish Liberal Democrat politician", "*George Lyon (Canadian politician) (1790–1851), captain in the British Army and a Canadian businessman and politician", "*George Lyon (golfer) (1858–1938), Canadian golfer", "*George Lyon, 5th Lord Glamis (died 1505)", "*George Lyon (highwayman) (1761–1815), Upholland highwayman", "*George Lyons (disambiguation)"]}, {"page": "Argyll and Bute (Scottish Parliament constituency)", "response": ["| George Lyon"]}, {"page": "1999 Liberal Democrats leadership election", "response": ["*MSPs: Ian Jenkins, George Lyon, John Farquhar Munro, Keith Raffan, Tavish Scott, Nicol Stephen, Jamie Stone, Jim Wallace."]}, {"page": "2007 Scottish Parliament election", "response": ["*George Lyon, Argyll and Bute"]}, {"page": "Second McConnell government", "response": ["|George Lyon MSP ||2005–2007||Liberal Democrats"]}, {"page": "List of members of the European Parliament (2009–2014)", "response": ["#George Lyon"]}, {"page": "Minister for Parliamentary Business", "response": ["|George Lyon"]}, {"page": "2014 European Parliament election in the United Kingdom", "response": ["*George Lyon – Scotland"]}, {"page": "Better Together (campaign)", "response": ["*Rural Better Together. Launched by Alistair Darling at the Royal Highland Show on 21 June 2013, chaired by Liberal Democrat MEP George Lyon who said farmers had given the group a \"great response\"."]}]}}