{"wiki_id": "http://www.wikidata.org/entity/Q957940", "itemLabel": "Steve Jansen", "itemDescription": "English musician, composer and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Jansen", "wikipedia_page": {"main": "Steve Jansen (born Stephen Ian Batt, born 1 December 1959) is an English musician, composer and record producer.", "link_mentions": [{"page": "Catford", "response": ["*Japan (band), 1980s new wave band. Vocalist David Sylvian, bassist Mick Karn, drummer Steve Jansen and keyboardist Richard Barbieri all grew up in Catford and attended Catford Boys School."]}, {"page": "Nobukazu Takemura", "response": ["*With Richard Barbieri & Steve Jansen"]}, {"page": "Japan (band)", "response": ["Japan were an English new wave band formed in 1974 in Catford, South London by David Sylvian (vocals, guitar, keyboards), Steve Jansen (drums) and Mick Karn (bass guitar), joined by Richard Barbieri (keyboards) and Rob Dean (lead guitar) the following year. Initially a glam rock-inspired band, Japan developed their sound and androgynous look to incorporate electronic music and foreign influences.", "The band began as a group of friends in the early 1970s. Brothers David Sylvian (guitar and vocals) and Steve Jansen (drums), and bassist Mick Karn studied at the same school, Catford Boys', Brownhill Road, South London. As youngsters they played Sylvian's two-chord numbers mainly as a means of escape; initially with Karn on lead vocals and Sylvian on guitar and backing vocals, Sylvian became lead vocalist in 1974. In June 1974 they made their first public performance at Karn's brother's wedding reception.History of Japan Nightporter.co.uk", "During the early 1980s, Japanese multi-instrumentalist and experimental keyboardist Ryuichi Sakamoto, of Yellow Magic Orchestra (YMO), briefly collaborated with the band, and worked directly alongside Sylvian on tracks such as \"Taking Islands in Africa\". He would continue to work with Sylvian both before and after the band split, and the pair would achieve the hit singles \"Bamboo Houses\" (1982) and \"Forbidden Colours\" (1983). Similarly, Steve Jansen was influenced by YMO's drummer Yukihiro Takahashi, subsequently joining him on several of Takahashi's solo projects and tours of Japan, along with additional full collaborative works between the two. ", "Medium Productions was a record label created in 1993 primarily to publish the music of Steve Jansen, Richard Barbieri, and Mick Karn. Medium was a means to release their own music with other collaborating artists, without 'big record label' compromise. Fifteen CDs of largely instrumental music were produced over a ten-year period. Medium Productions folded in 2004 as the founders became more involved in other projects (such as Porcupine Tree, Nine Horses). The entire MP catalog has been re-released on the Voiceprint Music label beginning in 2001.", "* Steve Jansen – drums, percussion, keyboards (1974–1982, 1989–1990)"]}, {"page": "Yellow Magic Orchestra", "response": ["The band has been described as \"the original cyberpunks\" and their early work has been described as \"proto-techno\" music. By the 1990s, YMO were also frequently cited as pioneers of ambient house music. YMO also popularized a style of live performance that eschewed human movement in favour of electronics such as rhythm boxes and samplers. They also influenced the New Romantic movement, including British bands Duran Duran and Japan, whose member Steve Jansen was influenced by drummer Takahashi, while lead member David Sylvian was influenced by Sakamoto, who would later collaborate with Sylvian."]}, {"page": "Man with a Movie Camera", "response": ["* 2001 – Steve Jansen and Claudio Chianura recorded a live soundtrack for a showing of the film at the Palazzina Liberty, in Milan on 11 December 1999. This was subsequently released on CD as the album Kinoapparatom in 2001."]}, {"page": "List of drummers", "response": ["* Steve Jansen (Japan)"]}, {"page": "David Sylvian", "response": ["Sylvian's debut solo album, Brilliant Trees, released in the late of June 1984, was a critical and  commercial success. The album included contributions from Sakamoto, Kenny Wheeler, Jon Hassell, Holger Czukay, Ronny Drayton, Danny Thompson, and also contributions by Sylvians former bandmembers, brother Steve Jansen and Richard Barbieri. The lead single became the UK Top 20 single \"Red Guitar\", with a promo video directed by Anton Corbijn.", "The next release was the two-record set Gone to Earth, which featured one record of atmospheric vocal tracks and a second record consisting of ambient instrumentals. The album contained significant contributions from noted guitarists Bill Nelson (formerly of Be-Bop Deluxe) and Robert Fripp (of King Crimson), and a rhythm section comprising Steve Jansen on drums and Ian Maidman of Penguin Cafe Orchestra on bass. Released on 13 September 1986, the album made a worthy 24 on the UK Album chart. ", "In the period of 23 September 2003 to 27 April 2004 Sylvian toured in Europe and in Japan, on the \"Fire in the Forest Tour\" featuring Steve Jansen with visuals and video images by Masakatsu Takagi.", "David Sylvian took to the road once again 17 September to 30 October 2007 for 'The World Is Everything' tour. A tour of Europe, Hong Kong and Japan, featuring Steve Jansen, Keith Lowe, and Takuma Watanabe. A fusion of styles, including jazz and electronica, the tour enabled Sylvian to perform music from the Nine Horses project, as well as various selections from his back catalogue. Steve Jansen also released his solo album Slope 2007, with two tracks co-written by Sylvian: \"Ballad of a Dead Man\" (a duet with singer Joan Wasser), and \"Playground Martyrs\".", "In 2010, Sylvian released a compilation disc of his collaborative works with musicians over the last 10 years – Sleepwalkers includes songs with Ryuichi Sakamoto, Tweaker, Nine Horses, Steve Jansen, Christian Fennesz and Arve Henriksen. Also included are a few new songs such as \"Sleepwalkers\" which is co-written with drummer Martin Brandlmayr of Radian and Polwechsel."]}, {"page": "Midge Ure", "response": ["Ure's fifth solo album, Move Me, was first released September 2000, on Arista label in Germany, later to be released 2001 in the UK on Curb Records. 28 March 2001 Ure was the subject of the This Is Your Life TV show hosted by Michael Aspel on BBC. The same year Ure also released \"Little Orphans\" exclusively from his website. A compilation of previously unreleased recordings. It contained \"Feel So Good\" with Gordon Giltrap, \"Heart\" with Chip Taylor,  \"Personal Heaven\" with Glenn Gregory and two songs recorded with Mick Karn, Steve Jansen and Richard Barbieri."]}, {"page": "Bill Nelson (musician)", "response": ["* Drop 5 (The Liquid Side of Dance) guitar (possibly just a guitar sample) also features David Torn, Richard Barbieri, Brian Eno, Jah Wobble, Steve Jansen, Hector Zazou, possibly David Sylvian (1998) [Various Artists] Italian release Materiali Sonori"]}, {"page": "List of new-age music artists", "response": ["* Steve Jansen – composer, drummer, keyboardist"]}, {"page": "Dalis Car", "response": ["In August 2010, Peter Murphy announced on Twitter that he and Karn were planning to head into the studio in September to begin work on the second Dali's Car album. The project was cut short, however, as Karn had recently been diagnosed with cancer. He died on 4 January 2011, thus ending the reunion.Meikle, James (2011) \"Former Japan bass player Mick Karn loses battle with cancer\", \"The Guardian\", 5 January 2011, retrieved 5 January 2011 The tracks they did record—including a re-working of Artemis from The Waking Hour with newly added vocals, guitar, and drums, and renamed Artemis Rise—were released on 5 April 2012 as an EP entitled InGladAloneness. The tracks were mixed by Steve Jansen, mastered by Pieter Snapper in Istanbul and the artwork for the EP was created by Murphy with Thomas Bak with a painting by Jarosław Kukowski. The Japanese version of the EP contains a memorial photo booklet with photos by Steve Jansen along with comments from fellow artists who have collaborated with Karn."]}, {"page": "Mick Karn", "response": ["Karn contributed to recordings by other artists, playing bass guitar on Bill Nelson's Chimera mini-LP, bass guitar and saxophone on Gary Numan's 1981 album Dance, and also played with Kate Bush and Joan Armatrading. In the 1990s he started the Medium Productions label along with Steve Jansen and Richard Barbieri, two of his fellow former Japan-members. and Debi Zornes (label management and artist co-ordination). In 2006, the MK Music imprint was established, by Karn, Debi Zornes and Mike Trenery — and beginning with 2006's Three Part Species, all releases, including the autobiography, have the MK Music logo on them.", "On 30 August 2010, Peter Murphy disclosed via video message (subsequently removed/hidden) on his personal Facebook profile that he would be reuniting with Karn for a week in London, perhaps in November, to begin writing and recording for a second Dalis Car album. Murphy also added that this would be the first time the two had seen each other since 1983.\"Video message from Pete Murphy on his FB page\". The project was cut short, however, as Karn had recently been diagnosed with cancer. After his death, five of the tracks they did record were released on 5 April 2012 as an EP entitled InGladAloneness. The tracks were mixed by Steve Jansen, mastered by Pieter Snaper in Istanbul and the artwork for the EP was created by Thomas Bak with a painting by Jarosław Kukowski.", "Karn was a self-taught sculptor working in mainly clay although he explored other mediums. He held several exhibitions. He also painted in oils and experimented with using ceramic on the canvas to create a 3D effect. He was photographed in the early 1980s by Steve Jansen. Several of his paintings were used as sleeve covers for his music including, \"Buoy\" and \"The Concrete Twin\". His sculpture \"Mask of Confidence\", combining his hands with the arms, upper torso and face of photographer Yuka Fujii, was used as the inner sleeve cover for Kajagoogoo's Islands album. Karn, influenced by Chinese edible folk sculpture dating back thousands of years, also experimented in designing and creating edible life size portraiture, some of which were showcased at his restaurant \"The Penguin Cafe\". Karn said, \"There was a definite change in style when I stopped using self-hardening clay in the mid '80s and began sculpting with more conventional clay. Finding it much more malleable, the pieces could be worked on a larger scale and needn't be focused, as was the case previously, on small detail.\" He continued to sculpt throughout his life and eventually learned to fire his own pieces."]}, {"page": "John Foxx", "response": ["In 2005 Foxx appeared on stage at the Brighton Pavilion with Harold Budd and Bill Nelson as part of a concert to celebrate the work of the retiring pianist, which led to the announcement in October that year that Foxx would be involved in collaborations with Jah Wobble, Robin Guthrie, Steve Jansen and Nelson."]}, {"page": "Steven Wilson", "response": ["By this time, Wilson had also released the official Porcupine Tree debut album, On the Sunday of Life...  (which compiled the best material from the underground tapes). No-Man's debut full-length release – a compilation of EP tracks called Lovesighs – An Entertainment – followed in 1992, as did Porcupine Tree's infamous LSD-themed maxi-single \"Voyage 34\" which made the NME indie chart for six weeks. No-Man also toured England with a six-piece band including three ex-members of the art-pop band Japan – Mick Karn, Steve Jansen and (most significantly) keyboardist Richard Barbieri. 1993 saw Wilson consolidating his initial success with albums from both Porcupine Tree (Up the Downstair) and No-Man (Loveblows And Lovecries – A Confession)."]}, {"page": "Propaganda (band)", "response": ["In May 1985, with Frankie Goes to Hollywood becoming tax exiles in Ireland, the band effectively headlined \"The Value of Entertainment\", a series of showcase gigs of ZTT signings, held at the Ambassadors Theatre in London. The shows also featured Art of Noise, Anne Pigalle, Andrew Poppy and Instinct. Propaganda were joined on stage by former Simple Minds bassist Derek Forbes and ex-Japan drummer Steve Jansen."]}, {"page": "Yukihiro Takahashi", "response": ["After the Yellow Magic Orchestra disbanded in the mid 1980s, Takahashi went solo and released a large number of solo albums, primarily intended for the Japanese market. Takahashi has collaborated extensively with other musicians, including Bill Nelson, Iva Davies of Icehouse, Keiichi Suzuki of the Moonriders (often as a duo dubbed \"The Beatniks\", although Suzuki essentially functioned as a member of Takahashi's backing band during the Moonriders' brief hiatus) and in particular Steve Jansen. Takahashi has released a single Stay Close and an EP Pulse as a duo with Jansen.", "* Pulse:Pulse (with Steve Jansen) (1997)", "* \"Stay Close\" 12 inch EP with Steve Jansen (Pony Canyon Japan, Rime Records UK 1986)", "* \"Fait Accompli\" (promotional single, Japan 1989) – with Steve Jansen"]}, {"page": "Gone to Earth (David Sylvian album)", "response": ["*Steve Jansen – drums (A1, A3, B1, B2, B3)"]}, {"page": "Icehouse (band)", "response": ["Davies was commissioned to compose and record the score for the Sydney Dance Company production of Graeme Murphy's work Boxes. Davies only used Kretschmer, with percussion being supplied by Masaki Tanazawa.  Boxes was first performed live at the Sydney Opera House on 7 November 1985. After the Boxes project, Icehouse was Davies, Kretschmer, Pratt and Qunta with former Members member Simon Lloyd (sax, trumpet, keyboards) and Steve Jansen (drums, percussion)."]}, {"page": "The Dolphin Brothers", "response": ["The Dolphin Brothers was a new wave/alternative band featuring Steve Jansen, and Richard Barbieri, both previously of the band Japan. The band released one album Catch the Fall in 1987, featuring Steve Jansen on drums, percussion, keyboards and lead vocals, and Richard Barbieri on keyboards and synthesizers."]}, {"page": "Richard Barbieri", "response": ["Although initially perceived as a ‘hyped’ band, Japan went on to record five studio albums culminating in the groundbreaking ‘Tin Drum’ which stayed in the UK charts for a year. The painstaking approach to synthesiser programming by Richard Barbieri and David Sylvian and the original rhythmic patterns of Steve Jansen and Mick Karn produced a sound that remains original to this day. They were the one of the most successful chart bands in Europe and Asia in 1982 despite the increasingly experimental nature of their music. ", "In 1984 he started a long musical association with another Japan colleague, Steve Jansen. This has produced six collaborative albums to date, under the name The Dolphin Brothers (Catch the Fall, 1987) and later as Jansen / Barbieri (including Worlds in a Small Room, 1985, Stories Across Borders, 1993, Other Worlds in a Small Room, 1996, and Stone to Flesh, 1997)."]}, {"page": "JBK (music)", "response": ["JBK or Jansen Barbieri Karn, is the name by which former Japan and Rain Tree Crow band members Steve Jansen, Richard Barbieri and Mick Karn have recorded several albums of music, all released by their own Medium Productions label, between 1993 and 2001."]}, {"page": "Rob Dean", "response": ["After leaving Japan he worked on some initial ideas for a solo album with keyboardist and composer Roger Mason (keyboard player for Gary Numan amongst others). He also played on Gary Numan's Dance album in 1981 . He played on Sinéad O'Connor's first album The Lion and the Cobra in 1987 (on which he co-wrote one of the songs). Dean continued to work on projects with Steve Jansen, Richard Barbieri and Mick Karn such as a 1995 compilation album and a number of other works on their Medium Productions label."]}, {"page": "Stephen Batt", "response": ["#REDIRECT Steve Jansen"]}, {"page": "Secrets of the Beehive", "response": ["Secrets of the Beehive was his most intimate to date and used more acoustic instruments than ever before. By many regarded as his finest solo work. Produced by Steve Nye and David Sylvian, the album features Ryuichi Sakamoto, David Torn, Mark Isham, Phil Palmer, Danny Thompson and Steve Jansen.", "*Steve Jansen – drums (4, 8, 10)"]}, {"page": "Brilliant Trees", "response": ["Produced by Sylvian with Steve Nye, Brilliant Trees was Sylvian's first full-length release after the break-up of his band Japan in December 1982 (though former Japan members Steve Jansen and Richard Barbieri both appear on the album). AllMusic called the album \"an eclectic affair fusing funk, jazz, and ambient.\" Additional musicians on the album included Holger Czukay, Danny Thompson, Jon Hassell, Mark Isham, Ronny Drayton, Kenny Wheeler, Phil Palmer and Ryuichi Sakamoto. Sylvian and Sakamoto had previously collaborated on the singles \"Bamboo Houses\" and \"Forbidden Colours\", and continued to collaborate at various points in their careers.", "* Steve Jansen – drums, synthesizer, percussion"]}, {"page": "Tama Drums", "response": ["* Steve Jansen (Japan)"]}, {"page": "Tin Drum (album)", "response": ["*Steve Jansen – acoustic drums, electronic drums, keyboard percussion"]}, {"page": "Adolescent Sex", "response": ["* Steve Jansen – drums, backing vocals, percussion"]}, {"page": "Gentlemen Take Polaroids", "response": ["* Steve Jansen – drums, synthesizer (Roland System 700, Sequential Circuits Prophet 5), percussion"]}, {"page": "Quiet Life", "response": ["* Steve Jansen – drums, backing vocals, percussion, production"]}, {"page": "Obscure Alternatives", "response": ["*Steve Jansen – drums, backing vocals, percussion, mixing"]}, {"page": "Oil on Canvas", "response": ["Seven years after the release of Oil on Canvas the four members of Japan, David Sylvian, Steve Jansen, Mick Karn and Richard Barbieri, reunited for another studio album, under the group moniker Rain Tree Crow.", "thumb|right|250px| Steve Jansen, Mick Karn, David Sylvian, Rich Barbieri, and guest Masami Tsuchiya", "* Steve Jansen: drums, marimba"]}, {"page": "No-Man", "response": ["No-Man’s debut mini-album (a compilation of EP tracks called Lovesighs - An Entertainment) was released in April 1992, and in October of the same year the band toured England with a six-piece line-up including three ex-members of the band Japan – Mick Karn, Steve Jansen and (most significantly) keyboardist Richard Barbieri, who had been recruited by Massey. The band's first full-length album (the more pop-oriented Loveblows & Lovecries - A Confession) followed in May 1993. By this time, the live band included bass player Silas Maitland and the (unrelated) drummer Chris Maitland. (The latter would join both Wilson and Richard Barbieri in the live lineup of Porcupine Tree).", "*ex-Japan and Rain Tree Crow members Steve Jansen, Mick Karn and also Porcupine Tree member Richard Barbieri."]}, {"page": "David Torn", "response": ["* Steve Jansen & Richard Barbieri, Stone to Flesh (Medium, 1995)"]}, {"page": "Mandalay (band)", "response": ["The first Mandalay release on V2 was a re-recorded single version of \"This Life\", released in 1997. This was followed in 1998 by a re-recorded \"Flowers Bloom\", which trailed the release of the debut album Empathy (featuring appearances by Sigsworth, former Japan and Rain Tree Crow member Steve Jansen, double bassist Danny Thompson and  trumpet player Jon Hassell). The album came to the attention of Madonna, who became a big fan and declared Mandalay to be one of her favorite bands. She chose \"This Life\" to be featured on the soundtrack for her film, The Next Best Thing, and the track would also appear on the soundtrack to the British film This Year's Love. Many other Mandalay songs have been featured on TV series' including La Femme Nikita, Six Feet Under, CSI: Crime Scene Investigation and CSI: Miami."]}, {"page": "I Second That Emotion", "response": ["* Steve Jansen – drums"]}, {"page": "Anja Garbarek", "response": ["*Slope – Steve Jansen (2008) (voice on 1 song: \"Cancelled Pieces\")", "*4 Remixes from Slope – Steve Jansen (2008) (voice on 1 song: \"Pieces Cancelled (Cancelled Pieces Remix)\")"]}, {"page": "Rain Tree Crow", "response": ["Rain Tree Crow is the sole album released by English band Rain Tree Crow, a reunion project by the members of the new wave band Japan. Recorded in 1989 and 1990 and released in April 1991, it was the first time that members David Sylvian, Mick Karn, Steve Jansen and Richard Barbieri had collaborated as a four-piece since 1982. The album peaked at number 24 on the UK Albums Chart.", "* Steve Jansen – drums (1, 2, 5, 8, 10), percussion (2–5, 8–10, 12, 13), ceramic drums (4), additional organ (5), tambourine (6), Moroccan clay drums (7), fan drums (7), marimba (9, 11), piano (11), wine glasses (13)"]}, {"page": "Diva (Annie Lennox album)", "response": ["* Steve Jansen – drum programming"]}, {"page": "Joan As Police Woman", "response": ["In 2006, Wasser contributed backing vocals and violin to the track \"Redwings\" on Guillemots' debut album Through the Windowpane. She provided vocals and plays the violin on the song \"Ballad of a Deadman\" alongside David Sylvian on Steve Jansen's album Slope which was released in 2007. Wasser was credited for playing piano, violin, and guitar as well as contributing vocals on Lloyd Cole's 2010 release, Broken Record."]}, {"page": "Alchemy: An Index of Possibilities", "response": ["*Steve Jansen – drums, percussion, additional keyboards", "*Steve Jansen – percussion"]}, {"page": "Learning to Fly (Pink Floyd song)", "response": ["The song was primarily written by David Gilmour, who developed the music from a 1986 demo by Jon Carin. The notable rhythm pattern at the beginning of the song was already present in the demo, and Carin stated that it was influenced by Steve Jansen or Yukihiro Takahashi."]}, {"page": "Everything and Nothing", "response": ["*\"Ride\": Ryuichi Sakamoto (piano, string arrangement) Steve Jansen (drums), Danny Thompson (double bass), David Torn (electric guitar), Mark Isham (trumpet), Phil Palmer (acoustic guitar).", "*\"The Golden Way\": Damiano Puliti (cello), Nicola Alesini (soprano sax, keyboards, drum programming), Steve Jansen (drum programming), Pier Luigi Andreoni (keyboards).", "*\"Pop Song\": John Taylor (piano), Steve Jansen.", "*\"Cover Me with Flowers\": Steve Jansen (percussion), Steve Tibbetts (guitars)."]}, {"page": "Blemish (album)", "response": ["In autumn 2003, Sylvian embarked on the A Fire in the Forest tour in promotion of Blemish, playing in the United Kingdom, Italy, Germany and the Netherlands with a band line-up of Steve Jansen and Masatksu Takagi, using only keyboards, laptop computers and a single guitar. While recreating the album's songs with great care and \"little intensity,\" some critics were distressed by some of the performances, including Nick Hasted of The Independent, who felt the band's September performance at London's Royal Festival Hall was marked by \"a sense of almost catatonically muted distress.\""]}, {"page": "Nine Horses", "response": ["Nine Horses is a musical collaboration between singer/instrumentalist David Sylvian, his brother and frequent collaborator drummer Steve Jansen, and electronic composer/remixer Burnt Friedman.", "The album Snow Borne Sorrow, and thus Nine Horses, was the result of the combining of two projects in 2005: collaborations between David Sylvian and Steve Jansen, and between Sylvian and the German composer/programmer Burnt Friedman (initially featuring Jaki Liebezeit)."]}]}}