{"wiki_id": "http://www.wikidata.org/entity/Q957575", "itemLabel": "Philip Kerr, 11th Marquess of Lothian", "itemDescription": "British politician, diplomat and newspaper editor (1882-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Kerr,_11th_Marquess_of_Lothian", "wikipedia_page": {"main": "Philip Henry Kerr, 11th Marquess of Lothian,  (18 April 1882 – 12 December 1940), known as Philip Kerr until 1930, was a British politician, diplomat and newspaper editor. He was private secretary to Prime Minister David Lloyd George between 1916 and 1921. After succeeding a cousin in the marquessate in 1930, he held minor office from 1931 to 1932 in the National Government, headed by Ramsay MacDonald.\nIn the late 1930s, he was a leading advocate of appeasement of Germany, emphasizing the harshness of the Treaty of Versailles and the dangers of Stalin's communism. From 1939 until his death, he was Ambassador to the United States. He proved highly successful in winning America's support for the British war effort, especially the Lend-Lease Act, which passed Congress after his death.", "link_mentions": [{"page": "Blickling Hall", "response": ["During World War II the house was requisitioned and served as the Officers' Mess of nearby RAF Oulton. After the death of Philip Kerr, 11th Marquess of Lothian (the last private owner of Blickling) in December 1940, the Blickling estate passed into the care of the National Trust as part of his bequest,Lord Lothian exhibition  Retrieved 25 June 2015 under the terms of the Country Houses Scheme. RAF servicemen and women were billeted within the grounds in Nissen huts, whilst officers were housed in the house itself. The adjacent lake was used by RAF service personnel to practice dinghy drills during the Second World War. The National Trust has created the RAF Oulton Museum on site in tribute to the RAF pilots and ground crew who served in the Second World War, and this may be visited for no additional entrance fee."]}, {"page": "List of Knights and Ladies of the Thistle", "response": ["|Philip Kerr, 11th Marquess of Lothian||75px||1882–1940||1940|| "]}, {"page": "Edmund Lyons, 1st Baron Lyons", "response": ["# Augusta Mary Minna Catherine Lyons (1821–1886), who married, in, 1839, Henry Granville Fitzalan-Howard, 14th Duke of Norfolk. Her grandson was Philip Kerr, 11th Marquess of Lothian."]}, {"page": "Peter Kerr, 12th Marquess of Lothian", "response": ["His father, Andrew Kerr, and grandfather, Lord Walter Kerr, the son of the 7th Marquess of Lothian, were officers in the Royal Navy.  He was educated at Ampleforth College and Christ Church, Oxford, and joined the Scots Guards.  He succeeded his cousin, Philip Kerr, 11th Marquess of Lothian, in 1940, and married a distant cousin, Antonella Newland (d. 2007), daughter of Major General Sir Foster Newland, on 30 April 1943.According to his wife's Times obituary, their mothers were cousins, and they had first met as children. Lord and Lady Lothian had six children: two sons and four daughters. His wife pursued her own career as a journalist, and founded the Women of the Year Lunch. The family were mainly based at their estates in the Borders, at Newbattle Abbey and Monteviot.  The 11th Marquess had left Blickling Hall in Norfolk to the National Trust.  Another family house at Melbourne Hall in Derbyshire was opened to the paying public in 1952.Melbourne Hall was inherited via his great-great-grandmother Emily Cowper, sister of the 2nd Viscount Melbourne and mistress of Palmerston whom she later married. See obituary (2004) by James Stourton for details."]}, {"page": "List of former Catholics", "response": ["* Philip Kerr, 11th Marquess of Lothian, British Ambassador"]}, {"page": "Philip Henry Kerry, 11th Marquess of Lothian", "response": ["#REDIRECTPhilip Kerr, 11th Marquess of Lothian"]}, {"page": "Philip Henry Kerr, 11th Marquess of Lothian", "response": ["#REDIRECTPhilip Kerr, 11th Marquess of Lothian"]}, {"page": "Philip Percy Kerr, 11th Marquess of Lothian", "response": ["#REDIRECTPhilip Kerr, 11th Marquess of Lothian"]}, {"page": "Philip Kerry, 11th Marquess of Lothian", "response": ["#REDIRECT Philip Kerr, 11th Marquess of Lothian"]}, {"page": "Richard Lyons, 1st Viscount Lyons", "response": ["Richard Bickerton Pemell was born in Lymington, Hampshire, on 26 April 1817. His father was Edmund Lyons, 1st Baron Lyons and his mother was Augusta Louisa, née Rogers. His siblings were: Anne Theresa Bickerton Lyons (1815–1894), Baroness von Würtzburg; Captain Edmund Moubray Lyons (1819–1855); and Augusta Mary Minna Catherine Lyons (1821–1886), Duchess of Norfolk and grandmother of Philip Kerr, 11th Marquess of Lothian. Lyons's cousins included Sir Algernon Lyons, Admiral of the Fleet and Richard Lyons Pearson, Assistant Commissioner of the Metropolitan Police."]}]}}