{"wiki_id": "http://www.wikidata.org/entity/Q962778", "itemLabel": "Edward Daniel Clarke", "itemDescription": "English naturalist, mineralogist and traveller (1769-1822)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Daniel_Clarke", "wikipedia_page": {"main": "Edward Daniel Clarke (5 June 1769 – 9 March 1822) was an English clergyman, naturalist, mineralogist, and traveller.", "link_mentions": [{"page": "Hydrogen", "response": ["Hydrogen was liquefied for the first time by James Dewar in 1898 by using regenerative cooling and his invention, the vacuum flask. He produced solid hydrogen the next year. Deuterium was discovered in December 1931 by Harold Urey, and tritium was prepared in 1934 by Ernest Rutherford, Mark Oliphant, and Paul Harteck. Heavy water, which consists of deuterium in the place of regular hydrogen, was discovered by Urey's group in 1932. François Isaac de Rivaz built the first de Rivaz engine, an internal combustion engine powered by a mixture of hydrogen and oxygen in 1806. Edward Daniel Clarke invented the hydrogen gas blowpipe in 1819. The Döbereiner's lamp and limelight were invented in 1823."]}, {"page": "Rosetta Stone", "response": ["After the surrender, a dispute arose over the fate of the French archaeological and scientific discoveries in Egypt, including the artefacts, biological specimens, notes, plans, and drawings collected by the members of the commission. Menou refused to hand them over, claiming that they belonged to the institute. British General John Hely-Hutchinson refused to end the siege until Menou gave in. Scholars Edward Daniel Clarke and William Richard Hamilton, newly arrived from England, agreed to examine the collections in Alexandria and said they had found many artefacts that the French had not revealed. In a letter home, Clarke said that \"we found much more in their possession than was represented or imagined\".Burleigh (2007) p. 212", "It is not clear exactly how the stone was transferred into British hands, as contemporary accounts differ. Colonel Tomkyns Hilgrove Turner, who was to escort it to England, claimed later that he had personally seized it from Menou and carried it away on a gun-carriage. In a much more detailed account, Edward Daniel Clarke stated that a French \"officer and member of the Institute\" had taken him, his student John Cripps, and Hamilton secretly into the back streets behind Menou's residence and revealed the stone hidden under protective carpets among Menou's baggage. According to Clarke, their informant feared that the stone might be stolen if French soldiers saw it. Hutchinson was informed at once and the stone was taken away—possibly by Turner and his gun-carriage.Parkinson et al. (1999) pp. 21–22"]}, {"page": "Thomas Robert Malthus", "response": ["In 1799, Malthus made a European tour with William Otter, a close college friend, travelling part of the way with Edward Daniel Clarke and John Marten Cripps, visiting Germany, Scandinavia and Russia. Malthus used the trip to gather population data. Otter later wrote a Memoir of Malthus for the second (1836) edition of his Principles of Political Economy. During the Peace of Amiens of 1802 he travelled to France and Switzerland, in a party that included his relation and future wife Harriet."]}, {"page": "Elgin Marbles", "response": ["English travel writer Edward Daniel Clarke, an eyewitness, wrote that the Dizdar, the Ottoman fortress commander on the scene, attempted to stop the removal of the metopes but was bribed to allow it to continue. ", "Edward Daniel Clarke witnessed the removal of the metopes and called the action a \"spoliation\", writing that \"thus the form of the temple has sustained a greater injury than it had already experienced from the Venetian artillery,\" and that \"neither was there a workman employed in the undertaking ... who did not express his concern that such havoc should be deemed necessary, after moulds and casts had been already made of all the sculpture which it was designed to remove.\" When Sir Francis Ronalds visited Athens and Giovanni Battista Lusieri in 1820, he wrote that \"If Lord Elgin had possessed real taste in lieu of a covetous spirit he would have done just the reverse of what he has, he would have removed the rubbish and left the antiquities.\""]}, {"page": "List of mineralogists", "response": ["*Edward Daniel Clarke (1769–1822)"]}, {"page": "John Stevens Henslow", "response": ["thumb|left|Henslow's 'Geological map of Anglesea' 1822Henslow graduated in 1818. He already had a passion for natural history from his childhood, which largely influenced his career, and he accompanied Sedgwick in 1819 on a tour in the Isle of Wight where he learned his first lessons in geology. He also studied chemistry under Professor James Cumming and mineralogy under Edward Daniel Clarke. In the autumn of 1819 he made valuable observations on the geology of the Isle of Man (Trans. Geol. Soc., 1821) and in 1820 and 1821 he investigated the geology of parts of Anglesey, the results being printed in the first volume of the Transactions of the Cambridge Philosophical Society (1822).Henslow (1822) The Philosophical Society was founded in November 1819 by a group at Cambridge with Professors Farish, Lee, and Sedgwick and Henslow (at that time not yet a professor). The idea and initial impetus for the society originated from Sedgwick and Henslow."]}, {"page": "Professor of Mineralogy (Cambridge)", "response": ["* Edward Daniel Clarke (1808)"]}, {"page": "George Julius Poulett Scrope", "response": ["Once at St. John's, Thomson was introduced to Professors Edward Daniel Clarke and Adam Sedgwick who \"gave him his lifelong interest in geology.\"Opie, p. 102. At the time these men were in the early stages of their careers, Clarke having been made the first professor of mineralogy within the field of geology at St. John's; Sedgwick being known for his attention to detail and his naming of certain sections of the geologic time scale including the Cambrian.Rudwick, Martin. Nov. 1974. \"Poulett Scrope on the Volcanoes of Auvergne: Lyellian Time and Political Economy.\" Article in The British Journal for the History of Science: Cambridge University Press and the British Society for the History of Science, 44, no. 3: 205-242, p. 207. Thomson received his Bachelor of Arts degree in 1821 in geology, after having performed several years of fieldwork in continental Europe."]}, {"page": "Timeline of Edinburgh history", "response": ["1818: The Union Canal is begun; new Calton Hill observatory is founded by the Edinburgh Astronomical Institution; the Scottish regalia are found in Edinburgh Castle; Cambridge geologist and antiquarian Edward Daniel Clarke likens Edinburgh topographically to Athens, a view echoed in 1820 by landscape painter Hugh William Williams who coins the terms \"Modern Athens\" and \"Athens of the North\"; gas lighting makes its first appearance"]}, {"page": "Blowpipe (tool)", "response": ["The blowpipes of all of the foregoing blasted air into a flame. The blow pipe was used by the Egyptians at around 200 BCE and to today. Antoine Lavoisier is credited as the first to blow oxygen - of which he was co-discoverer - through a blowpipe to support the combustion of charcoal, in 1782. Others, such as Edward Daniel Clarke, employed hydrogen, and later mixed hydrogen and oxygen in the oxy-hydrogen blowpipe. The vastly increased temperatures, and the volatility of hydrogen-oxygen mixes drove on the development of the so-called gas blowpipe as a tool, and at the same time brought many new materials into reach of the blowpipe as a tool for assay.  Robert Hare was a noted exponent of the improved tool. Goldsworthy Gurney, whilst at the Surrey Institute, published in 1823 an account of a new blowpipe so constructed as to enable the operator to produce a flame of great size, power and brilliancy by burning large quantities of the mixed gases with the utmost safety. Gurney went on to employ the principles in his Bude light."]}, {"page": "Oxyhydrogen", "response": [" The foundations of the oxy-hydrogen blowpipe were laid down by Carl Wilhelm Scheele and Joseph Priestley around the last quarter of the eighteenth century. The oxy-hydrogen blowpipe itself was developed by the Frenchman Bochard-de-Saron, the English mineralogist Edward Daniel Clarke and the American chemist Robert Hare in the late eighteenth and early nineteenth centuries. It produced a flame hot enough to melt such refractory materials as platinum, porcelain, fire brick, and corundum, and was a valuable tool in several fields of science. It is used in the Verneuil process to produce synthetic corundum."]}, {"page": "Edward Clarke", "response": ["* Edward Daniel Clarke (1769–1822), English naturalist, mineralogist and traveller"]}, {"page": "Robert Hare (chemist)", "response": ["Hare was born in Philadelphia, Pennsylvania on January 17, 1781. He developed and experimented with the oxy-hydrogen blowpipe, with Edward Daniel Clarke of Oxford, shortly after 1800. He married Harriett Clark and had six children. In 1802, Hare was elected a member of the American Philosophical Society. He was a professor at the University of Pennsylvania between 1810 and 1812 and between 1818 and 1847. By the 1820s, Hare had developed the \"galvanic deflagrator\", a type of voltaic battery having large plates used for producing rapid and powerful combustion.Kneeland, Timothy W. (2008). Robert Hare: Politics, Science, and Spiritualism in the Early Republic. The Pennsylvania Magazine of History and Biography. Vol. 132, No. 3. pp. 245-260. He was elected an Associate Fellow of the American Academy of Arts and Sciences in 1824."]}, {"page": "William Frend (reformer)", "response": ["Among Frend's pupils were Edward Daniel Clarke, Ada Lovelace, John Singleton Copley, and Robert Malthus; he was himself the last of \"the learned anti-Newtonians and a noted oppugner of all that distinguishes Algebra from Arithmetic.\" In Cambridge the leading intellectual dissenters formed a circle including George Dyer, Benjamin Flower, Robert Hall and Robert Tyrwhitt, as well as Frend and Robert Robinson."]}, {"page": "1790s in Wales", "response": ["**Edward Daniel Clarke - A Tour Through the South of England, Wales, and Part of Ireland, Made During the Summer of 1791"]}, {"page": "1793 in Wales", "response": ["*Edward Daniel Clarke - A Tour Through the South of England, Wales, and Part of Ireland, Made During the Summer of 1791"]}, {"page": "Timeline of hydrogen technologies", "response": ["* 1819 – Edward Daniel Clarke invented the hydrogen gas blowpipe."]}, {"page": "Minuscule 98", "response": ["The manuscript was brought by Edward Daniel Clarke (1769-1822) from the East to England. It was by one librarian collated in Matthew 6; 9; 10; Mark 5; 6; Luke 4; 5; 6 for Scholz. Wettstein's 98 is Lectionary 294. C. R. Gregory saw it in 1883."]}, {"page": "Thomas Noel Hill, 2nd Baron Berwick", "response": ["The first son of Noel Hill, who was created Baron Berwick in 1784, and his wife Anna Vernon, he was educated at Jesus College, Cambridge, where he was in the same year as Edward Daniel Clarke, and graduated as M.A. in 1791. In 1792–94, he paid Clarke's expenses as a traveling companion to Germany, Switzerland and Italy; he employed Angelica Kauffman in painting. In 1801 Thomas Noel Hill became a Fellow, Society of Antiquaries (F.S.A.). On 8 February 1812 he married Sophia Dubochet, daughter of John James Dubochet, at St Marylebone Church, London. (Sophia and her famous sister Harriette Wilson were highly fashionable courtesans.) In 1827 and 1829 they were forced to hold bankruptcy auctions to pay off debts. At this point Thomas’s younger brother William came to the rescue and purchased much of the furniture and then leased their home, Attingham Park. Thomas and Sophia escaped to Italy, where Thomas died childless at age 62 in Naples; upon his death his brother William Noel-Hill inherited the title.http://thepeerage.com/p2800.htm M,#27994 Thomas Noel Hill, 2nd Baron Berwick of Attingham"]}, {"page": "List of University Librarians at the University of Cambridge", "response": ["* Edward Daniel Clarke (1817–1822)"]}, {"page": "Edward Scriven", "response": ["* A portrait of Edward Daniel Clarke, after John Opie, 1828."]}, {"page": "Annals of Philosophy", "response": ["Annals of Philosophy was a learned journal founded in 1813 by the Scottish chemist Thomas Thomson. It shortly became a leader in its field of commercial scientific periodicals. Contributors included John George Children, Edward Daniel Clarke,  Philip Crampton, Alexander Crichton,  James Cumming, John Herapath,  William George Horner, Thomas Dick Lauder,  John Miers, Matthew Paul Moyle, Robert Porrett,  James Thomson, and Charles Wheatstone."]}, {"page": "Alexander Nicoll", "response": ["Nicoll's main work was his catalogues of the oriental manuscripts in the Bodleian Library. He first arranged those acquired by Edward Daniel Clarke, and published in 1815 a second part of the catalogue, which dealt with the oriental manuscripts; the first part, dealing with the classical manuscripts, had been issued by Thomas Gaisford in 1812. In 1818 Nicoll published Notitia Codicis Samaritano-Arabici Pentateuchi in Bibl. Bodleiana, Oxford. Finally, he added in 1821 a second part to the Bibliothecæ Bodleianæ Codicum Manuscriptorum Orientalium Catalogus, of which the first part, by Joannes Uri, had appeared in 1788. The third part, by Edward Bouverie Pusey, was printed in 1835."]}, {"page": "E.D.Clarke", "response": ["#REDIRECT Edward Daniel Clarke"]}, {"page": "James Stanier Clarke", "response": ["The eldest son of Edward Clarke and Anne Grenfield, and brother of Edward Daniel Clarke, he was born on 17 December 1766 at Mahon, Minorca where his father was at the time chaplain to the governor. He was educated at Uckfield SchoolMark Antony Lower, The Worthies of Sussex (1865), p. 63: \"In fact, Uckfield school enjoyed considerable celebrity. During the mastership of the Robert Gerison, James Stanier Clarke, and his brother Edward Daniel Clarke, the well-known traveller, received their rudimentary education there...\" and then at Tonbridge School under Vicesimus Knox. Matriculating at St John's College, Cambridge in 1784, he did not complete a first degree."]}, {"page": "Edward Clarke (author)", "response": ["In 1763 Clarke married Anne, daughter of Thomas Grenfield of Guildford, Surrey. He left three sons: the Rev. James Stanier Clarke, Edward Daniel Clarke, and George, of the Royal Navy, who drowned in the River Thames in 1806. His only daughter, Anne, was married to Captain William Standway Parkinson, RN (1769–1838), who was with Nelson at the battle of Trafalgar."]}, {"page": "List of botanists by author abbreviation (E–F)", "response": ["* E.D.Clarke – Edward Daniel Clarke (1769–1822)"]}, {"page": "Philip Hunt (priest)", "response": ["In March 1801 Hunt set off on an Aegean voyage with Carlyle, looking further afield. A second visit to the Troad saw Hunt remove an inscription; Carlyle and Hunt also fell in with Edward Daniel Clarke there, but a scholarly disagreement over the site of Troy turned into something of a vendetta on Clarke's part. They also visited Mount Athos. In May, Elgin obtained a firman to the Athens authorities, on Hunt's advice; Giovanni Battista Lusieri who was employed by Elgin reached Athens in April, Carlyle and Hunt in May;Philip Hunt and A. H. Smith, Lord Elgin and His Collection, The Journal of Hellenic Studies Vol. 36, (1916) , pp. 163–372, at pp. 185–6. Published by: The Society for the Promotion of Hellenic Studies. Stable URL: https://www.jstor.org/stable/625773 Hunt was put in charge of Lusieri, and Elgin's workmen."]}, {"page": "Robert Walpole (classical scholar)", "response": ["He completed the sixth and final volume of Edward Daniel Clarke's Travels after the author's death."]}, {"page": "Tweddell remains affair", "response": ["The subsequent fate of Tweddell's remains is still obscure, but was aired in controversy some years later. Journals and pictures had disappeared, and Tweddell's brother Robert subsequently accused Elgin of appropriating them.  Elgin's account of their handling was supported by his chaplain Philip Hunt; his reply to the charges was not published till 1816. Robert Tweddell was supported by Edward Daniel Clarke, by Thornton, and by John Spencer Smith, Elgin's predecessor.", "Thomas Thornton, who had had care of some of Tweddell's remains, mentioned their fate in his The Present State of Turkey (2nd edition, 1809), and was picked up on by an anonymous reviewer (in fact John Spencer Smith, who held a grudge against Elgin), in the Naval Chronicle. Tweddell's brother Robert then pursued the matter. Ranged against Elgin were also Edward Daniel Clarke, whose brother James Stanier Clarke edited the Naval Chronicle, and the Levant Company. Elgin had support in two anonymous (as was customary) articles in the Quarterly Review, a Tory journal that took against Tweddell's liberalism; the first was substantially the work of Charles James Blomfield, the second of John Wilson Croker."]}]}}