{"wiki_id": "http://www.wikidata.org/entity/Q963703", "itemLabel": "Mary Seacole", "itemDescription": "British-Jamaican businesswoman and nurse", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Seacole", "wikipedia_page": {"main": "Mary Jane Seacole (born Grant; 23 November 1805 – 14 May 1881) was a British-Jamaican nurse, healer and businesswoman who set up the \"British Hotel\" behind the lines during the Crimean War. She described this as \"a mess-table and comfortable quarters for sick and convalescent officers\", and provided succour for wounded service men on the battlefield, and nursed many of them back to health. She had met the most famous nurse in history Florence Nightingale for 5 minutes during the Crimean War. Coming from a tradition of Jamaican and West African \"doctresses\", Seacole displayed \"compassion, skills and bravery while nursing soldiers during the Crimean War\", through the use of herbal remedies. She was posthumously awarded the Jamaican Order of Merit in 1991. In 2004, she was voted the greatest black Briton.Mary Seacole relied on her skill and experience as a healer and a female doctor from Jamaica. Schools of nursing in England were only set up after the Crimean war, the first being the Florence Nightingale Training School, in 1860 at St Thomas' Hospital in London. Seacole was arguably the first nurse practitioner.Hoping to assist with nursing the wounded on the outbreak of the Crimean War, Seacole applied to the War Office to be included among the nursing contingent but was refused, so she travelled independently and set up her hotel and tended to the battlefield wounded. She became popular among service personnel, who raised money for her when she faced destitution after the war.\nIn 1858 a four-day Fundraising Gala took place on the banks of the river Thames, to honour Mary Seacole. Crowds of about 80,000 attended, including veterans, their families and Royalty.\nAfter her death she was largely forgotten for almost a century, but was subsequently recognised for her success as a woman. Her autobiography, Wonderful Adventures of Mrs. Seacole in Many Lands (1857), is one of the earliest autobiographies of a mixed-race woman, although some aspects of its accuracy have been questioned by present-day supporters of Florence Nightingale. The erection of a statue of her at St Thomas' Hospital, London, on 30 June 2016, describing her as a \"pioneer\", has generated controversy and opposition from Nightingale enthusiasts, such as Lynn McDonald, and others researching the period..[17-20]", "link_mentions": [{"page": "May 14", "response": ["*1881 – Mary Seacole, Jamaican-English nurse and author (b. 1805)"]}, {"page": "Crimean War", "response": ["As the memory of the \"Charge of the Light Brigade\" demonstrates, the war became an iconic symbol of logistical, medical and tactical failures and mismanagement. Public opinion in Britain was outraged at the logistical and command failures of the war; the newspapers demanded drastic reforms, and parliamentary investigations demonstrated the multiple failures of the Army. The reform campaign was not well organised, and the traditional aristocratic leadership of the Army pulled itself together, and blocked all serious reforms. No one was punished. The outbreak of the Sepoy Mutiny in 1857 shifted attention to the heroic defence of British interest by the army, and further talk of reform went nowhere.Peter Burroughs, \"An Unreformed Army? 1815–1868,\" in David Chandler, ed., The Oxford History of the British Army (1996), pp. 183–84 The demand for professionalisation was achieved by Florence Nightingale, who gained worldwide attention for pioneering and publicising modern nursing while treating the wounded. Another nurse, Jamaican doctress Mary Seacole, also made an impact providing care for wounded and dying soldiers. The Times war correspondent William Howard Russell spoke highly of Seacole's skill as a healer, writing \"A more tender or skilful hand about a wound or a broken limb could not be found among our best surgeons.\"\"Mary Seacole, by Jane Robinson\", Independent', 21 January 2005 https://www.independent.co.uk/arts-entertainment/books/reviews/mary-seacole-by-jane-robinson-748262.html Retrieved 28 October 2020."]}, {"page": "Florence Nightingale", "response": ["According to some secondary sources, Nightingale had a frosty relationship with her fellow nurse Mary Seacole, who ran a hotel/hospital for officers. Seacole's own memoir, Wonderful Adventures of Mrs. Seacole in Many Lands¸ records only one, friendly, meeting with her, when she asked her for a bed for the night, and got it; Seacole was in Scutari en route to the Crimea to join her business partner and start their business. However, Seacole pointed out that when she tried to join Nightingale's group, one of Nightingale's colleagues rebuffed her, and Seacole inferred that racism was at the root of that rebuttal.Mary Seacole, Wonderful Adventures of Mrs. Seacole in Many Lands, Chapter VIII (London: James Blackwood, 1857), pp. 73–81 Nightingale told her brother-in-law, in a private letter, that she was worried about contact between her work and Seacole's business, claiming that while “she was very kind to the men and, what is more, to the Officers – and did some good (she) made many drunk”.letter 4 August 1870, Wellcome Ms 9004/59). Nightingale reportedly wrote, \"I had the greatest difficulty in repelling Mrs. Seacole's advances, and in preventing association between her and my nurses (absolutely out of the question!)...Anyone who employs Mrs. Seacole will introduce much kindness – also much drunkenness and improper conduct\".Tan-Feng Chang, CREOLIZING THE WHITE WOMAN’S BURDEN: MARY SEACOLE PLAYING “MOTHER” AT THE COLONIAL CROSSROADS BETWEEN PANAMA AND CRIMEA, (Johns Hopkins University Press, 2017), p. 526.", "Portrayals of Nightingale on television, in documentary as in fiction, vary – the BBC's 2008 Florence Nightingale, featuring Laura Fraser, emphasised her independence and feeling of religious calling, but in Channel 4's 2006 Mary Seacole: The Real Angel of the Crimea, she is portrayed as narrow-minded and opposed to Seacole's efforts."]}, {"page": "Amy Johnson", "response": ["St Mary's Church in Beverley, East Yorkshire announced their intention of installing a stone carving of Amy Johnson as part of a programme of celebrating women in the restoration of the stonework of the medieval church in 2021. The other eight figures will include fellow engineer and WES member Hilda Lyon, Mary Wollstonecraft, Mary Seacole, Marie Curie, Rosalind Franklin, Helen Sharman and Ada Lovelace."]}, {"page": "100 Greatest Britons", "response": ["There were no black Britons voted on the list, prompting consternation from members of the Black British community that their contribution and history in the United Kingdom were not being sufficiently recognised. A separate three-month survey was conducted among the public, resulting in the publication of 100 Great Black Britons, a list of the 100 greatest Black Britons as judged by the British public. In 2004, two years after the 100 Greatest Britons list was voted on, social campaigner Patrick Vernon created a similar poll exclusively voted upon by members of the Black British community, with Mary Seacole being named the greatest Black Briton for her actions during the Crimean War with Russia."]}, {"page": "1881 in science", "response": ["* May 14 – Mary Seacole (born 1805), Jamaican-born nurse."]}, {"page": "Blue plaque", "response": ["When the LCC was abolished in 1965, the scheme was taken over by the Greater London Council (GLC). The principles of the scheme changed little, but now applied to the entire, much larger, administrative county of Greater London. The GLC was also keen to broaden the range of people commemorated. The GLC erected 252 plaques, the subjects including Sylvia Pankhurst, Samuel Coleridge-Taylor, and Mary Seacole."]}, {"page": "List of Jamaicans", "response": ["*Mary Seacole, Jamaican-born woman of Scottish and Creole descent who set up a \"British hotel\" behind the lines during the Crimean War"]}, {"page": "Aldershot", "response": ["In 1854, at the time of the Crimean War, Aldershot Garrison was established as the first permanent training camp for the British Army. This led to a rapid expansion of Aldershot's population going from 875 in 1851, to in excess of 16,000 by 1861 (including about 9,000 from the military). Mrs Louisa Daniell arrived in the town at this time and set up her Soldier's Home and Institute to cater for the spiritual needs of the soldiers and their families. During this period Holy Trinity church, the Presbyterian church, the Wesleyan church and Rotunda chapel were built in the town centre to cater for the spiritual needs of the increasing numbers of troops in the nearby Camp and the growing civilian town. In August 1856 on her return from the Crimean War and \"wishing to be with her sons in the Army\" Mary Seacole with her business partner Thomas Day is said to arrived in Aldershot where they attempted to open a canteen. In her autobiography Seacole wrote. 'we set to bravely at Aldershott to retrieve our fallen fortunes, and stem off the ruin originated in the Crimea, but all in vain...'.Seacole, Mary, Wonderful Adventures of Mrs. Seacole in Many Lands, James Blackwood (1857), pg. 169 The venture is believed to have failed through lack of funds and the two being declared bankrupt.Mary Jane Seacole - Oxford Dictionary of National Biography, 2006Petition for adjudication of Bankruptcy against Mary Seacole and Thomas Day the younger - The London Gazette, 28 October 1856 Issue:21935 Page:3526Alan Palmer, Seacole née Grant, Mary Jane (1805–1881) - Oxford Dictionary of National Biography (ODNB) Published online: 23 September 2004 This version: 25 May 2006"]}, {"page": "Birmingham City University", "response": ["*Mary Seacole Library (located at the City South Campus);"]}, {"page": "1855 in science", "response": ["* March – Mary Seacole opens the British Hotel at Balaklava, a nursing and convalescent establishment for Crimean War officers."]}, {"page": "1805 in science", "response": ["* Mary Seacole (née Grant), nurse (died 1881)"]}, {"page": "William Howard Russell", "response": ["Initially sent by the editor John Delane to Malta to cover British support for the Ottoman Empire against Russia in 1854, Russell despised the term \"war correspondent\" but his coverage of the conflict brought him international renown, and Florence Nightingale later credited her entry into wartime nursing to his reports. The Crimean medical care, shelter and protection of all ranks by Mary Seacole. was also publicised by Russell and by other contemporary journalists, rescuing her from bankruptcy.", "Russell wrote about his meetings with Mary Seacole and wrote highly of Seacole's skill as a healer: \"A more tender or skilful hand about a wound or a broken limb could not be found among our best surgeons.\"\"Mary Seacole, by Jane Robinson\", Independent', 21 January 2005 https://www.independent.co.uk/arts-entertainment/books/reviews/mary-seacole-by-jane-robinson-748262.html Retrieved 28 October 2020."]}, {"page": "Free people of color", "response": ["* Mary Seacole (1805-1881), Jamaican nurse who served in the Crimean War"]}, {"page": "Olaudah Equiano", "response": ["* In 2007, the year of the celebration in Britain of the bicentenary of the abolition of the slave trade, Equiano's life and achievements were included in the National Curriculum, together with William Wilberforce. In December 2012 The Daily Mail claimed that both would be dropped from the curriculum, a claim which itself became subject to controversy. In January 2013 Operation Black Vote launched a petition to request Education Secretary Michael Gove to keep both Equiano and Mary Seacole in the National Curriculum. American Rev. Jesse Jackson and others wrote a letter to The Times protesting against the mooted removal of both figures from the National Curriculum."]}, {"page": "Courtney Pine", "response": ["In 1986 Pine's debut album Journey to the Urge Within entered the UK Top 40.Courtney Pine interview by Pete Lewis, Blues & Soul, May 2008. One of his early bands was Grand Union Orchestra and he featured on their 1986 album The Song of Many Tongues, written by Tony Haynes. He is the principal founder of the seminal black British big band the Jazz Warriors, which he established in 1985 through the community organisation \"The Abibi Jazz Arts\" (TAJA).Jazz Warriors (1987). Out of Many, One People, Antilles Records AN8712  The Jazz Warriors developed out of the Abibi All-Stars community band that did a series of performances at London's Royal Festival Hall foyer during the summer of the International Youth Year 1985.  The Jazz Warriors recorded two albums under Pine's leadership: Out of Many, One People, which was released on the Antilles division of the Island Records label in 1987, and Afropeans, which was released on Pine's own label, Destin-e Records, for their 20th anniversary in 2007.  The Jazz Warriors Afropeans project was commissioned by the Arts Council of England to commemorate the bicentennary of the Abolition of the Slave Trade Act.  Thirty years after Pine planted his idea to start the Jazz Warriors, he put together the \"Venus Warriors\" all-female jazz band for a charity performance to raise awareness of the Mary Seacole Memorial Statue Appeal, which was established to erect a statue of the British-Jamaican Crimean War business woman and nurse outside of London's St Thomas's Hospital."]}, {"page": "St Mary's Catholic Cemetery, Kensal Green", "response": ["*Mary Seacole (1805–1881) nurse, humanitarian"]}, {"page": "Headley Court", "response": ["In April 2020, during the Covid-19 pandemic, the site was offered to the National Health Service and on 4 May 2020 it was re-opened as the NHS Seacole Centre (in tribute to Mary Seacole and the BAME contribution to the NHS), aimed at treatment of non-critical Covid-19 patients and rehabilitation of Covid-19 patients."]}, {"page": "Obeah", "response": ["In 1787 a letter to an English newspaper referred to \"Obiu-women\" interpreting the wishes of the dead at the funeral of a murdered slave in Jamaica: a footnote explained the term as meaning \"Wise-women\".BECARA, i. e. White Man. \"To the Editor of the Universal Register.\" Times [London, England] 23 Nov. 1787: 1. The Times Digital Archive. Web. 7 June 2012. The practice of obeah with regards to healing led to the Jamaican 18th and 19th century traditions of \"doctresses\", such as Grace Donne, who nursed her lover, Simon Taylor (sugar planter), Sarah Adams, Cubah Cornwallis and Mary Seacole and her mother. These doctresses practised the use of hygiene and the applications of herbs decades before they were adopted by European doctors and nurses.Christer Petley, White Fury: A Jamaican Slaveholder and the Age of Revolution (Oxford: Oxford University Press, 2018), pp. 88-9."]}, {"page": "Pillar box", "response": ["In September 2020 four pillar boxes were painted black, with gold tops to mark Black History Month in October. They are located in  London, Glasgow, Cardiff and Belfast. The London postbox, in Acre Lane, Brixton, features the painting \"Queuing at the RA\" by Yinka Shonibare. The Glasgow postbox, in Byres Road, features footballer and Army officer Walter Tull. The Cardiff postbox, in King Edward VII Avenue, depicts Mary Seacole and the Bedford Street pillar, in Belfast depicts Sir Lenny Henry, a stand-up comedian, actor, singer, writer and television presenter and co-founder of the Comic Relief charity."]}, {"page": "Wilfred Wood (bishop)", "response": ["Wood retired as Bishop of Croydon on 30 September 2002 and was succeeded in 2003 by Nick Baines. In 2002, he returned with his wife to their native Barbados. In 2004, Wood was voted by the public as second only to Mary Seacole on a list of the \"100 Great Black Britons\". He has been blind since 2004."]}, {"page": "Carte de visite", "response": ["File:Seacole photo.jpg|One of only two known photographs of Mary Seacole, taken by Maull & Company in London, c.1873."]}, {"page": "Afro-Caribbean people", "response": ["*Mary Seacole – Jamaican nurse and hospital director"]}, {"page": "Siege of Sevastopol (1854–1855)", "response": ["The nurses who treated the allied wounded during these battles were much celebrated, most famously Florence Nightingale and Mary Seacole."]}, {"page": "List of people on the postage stamps of Jamaica", "response": ["*Mary Seacole (2005)"]}, {"page": "Guy Walters", "response": ["Walters has raised questions regarding the veracity of Denis Avey's claims to have smuggled himself into Auschwitz and about fraudulent Holocaust memoirs generally, and has questioned the level of acclaim given to Mary Seacole."]}, {"page": "Lead(II) acetate", "response": ["In the 1850s, Mary Seacole applied lead(II) acetate, among other remedies, against an epidemic of cholera in Panama.Mary Seacole: Wonderful Adventures of Mrs. Seacole in Many Lands, Chapter IV, (1990 Oxford University Press reprint) ; (2005 Penguin 20th Century Classics reprint, ed. Sarah Salih) Jane Robinson: Mary Seacole: The Charismatic Black Nurse who became a heroine of the Crimea, p.53. Constable 2004 (p/b. )"]}, {"page": "List of nurses", "response": ["*Mary Seacole (1805-1881), Jamaican British nurse in the Crimean War known as \"the Black Florence Nightingale\"."]}, {"page": "Order of Merit (Jamaica)", "response": ["*Mary Seacole (1990, posthumously)Mary Seacole , National Library of Jamaica, retrieved February 5, 2012."]}, {"page": "Rugby High School for Girls", "response": ["The school introduced a house system during the academic year 2000–2001. The current houses are named after Onjali Raúf, founder of Making Herstory and an author, Dame Kelly Holmes, an athlete, Mary Seacole, a British-Jamaican Nurse and Evelyn Glennie, a deaf percussionist – the initials of which stand for RHSG (Rugby High School for Girls). These names were changed in September 2021 with the previous house names coming from Sue Ryder, Barbara Hepworth, Helen Sharman and Evelyn Glennie.  Initially there were omly three houses with the initials RHS after the shortened for of Rugby High School but from September 2013 a fourth house was introduced named after Evelyn Glennie, an inspirational woman who was voted for by students.  The initial of 'G' stands for the 'Girls' in 'Rugby High School for Girls'. The houses are assigned to whole form groups, and they can gain house points by taking part in various school events, such as the annual Sports Day, interform sports, or Pink Day (in support of Cancer Research UK). Each form is given the initial of their house, to come before the initial of their form tutor, e.g. 8R, is a Year 8 form, in Raúf House. The system is not very different from the interform system previously in place, with students in the same form all being placed within the same house. However, the house system has created a link between different year groups and has encouraged wider participation in school events other than the interform."]}, {"page": "Adelaide Hall", "response": ["In 2018, Hall was named by the Evening Standard on a list of 14 \"Inspirational black British women throughout history\", alongside Mary Seacole, Claudia Jones, Margaret Busby, Olive Morris, Joan Armatrading, Tessa Sanderson, Doreen Lawrence, Maggie Aderin-Pocock, Sharon White, Malorie Blackman, Diane Abbott, Zadie Smith and Connie Mark.Georgia Chambers, \"Inspirational black British women throughout history\", Evening Standard, 11 October 2018."]}, {"page": "The John Roan School", "response": ["The John Roan had four house teams, named after people of historic significance: Seacole, Da Vinci, Darwin and Stopes, named after Mary Seacole, Leonardo da Vinci, Charles Darwin and Marie Stopes. Two tutor groups per year were in the same house team. There were also house leaders and competitions amongst the four houses. The house system was scrapped in September 2017, and the colour ties now correspond to year group."]}, {"page": "Standpoint feminism", "response": ["It was not until the latter part of the 1990s that there was more of a focus on black women. A number of both films and published works by and about black women began to emerge. This marked an important transition from years past when the only works to be published or put on screen were those of more dominant groups. The only works of black women that are recognized previous to this time are those from the early part of the nineteenth century. The works of Mary Prince (1831) and Mary Seacole (1837) are the more commonly known writings today. Aside from those few, the next notable published work was not until Sylvia Wynter (1962) and Maryse Condé (1988), leaving a gap of over 120 years of little to no work of black women. This gap shows how powerless black women were in a market position. Although we see more and more work of black women in our society today, there still remains a lack of control and limited input over their works; it must be confined to certain areas in order for them to have any opportunity and publication."]}]}}