{"wiki_id": "http://www.wikidata.org/entity/Q963153", "itemLabel": "William Charles Wentworth", "itemDescription": "Australian poet, explorer, journalist and politician (1790-1872)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wentworth", "wikipedia_page": {"main": "William Charles Wentworth (13 August 1790 – 20 March 1872) was an Australian explorer, journalist, politician and author, and one of the leading figures of early colonial New South Wales. He was the first native-born Australian to achieve a reputation overseas, and a leading advocate for self-government for the Australian colonies.\n\n", "link_mentions": [{"page": "Great Dividing Range", "response": ["Knowing that local Aboriginal people had already established routes crossing the range and by making use of Aboriginal walking trails, a usable ridge-top route was finally discovered by Europeans directly westward from Sydney across the Blue Mountains to Bathurst by an expedition jointly led by Gregory Blaxland, William Lawson and William Charles Wentworth. Towns in the Blue Mountains were later named after each of these men. This was the start of the development of the agricultural districts of inland New South Wales. A road was built to Blaxland by convicts within six months. Easier routes to inland New South Wales were discovered towards Goulburn to the southwest, and westwards from Newcastle."]}, {"page": "Blue Mountains (New South Wales)", "response": ["The 1813 crossing of the Blue Mountains by Gregory Blaxland, William Lawson and William Charles Wentworth is officially credited as the first successful European crossing. Blaxland set out with Lawson and Wentworth on 11 May 1813 and succeeded in crossing the mountains by 31 May. They ventured as far as to what is now Mount Blaxland, just west of Coxs River."]}, {"page": "Wimborne Minster", "response": ["*William Charles Wentworth, Australian explorer and statesman, died in Wimborne in 1872."]}, {"page": "Gregory Blaxland", "response": ["Early in 1813 Blaxland, who needed more grazing land, obtained the approval of Governor Lachlan Macquarie for an attempt to cross the Great Dividing Range, known as the Blue Mountains, following the mountain ridges, instead of following the rivers and valleys. He secured the participation of William Lawson and William Charles Wentworth in the expedition, which was successful (though the expedition stopped short of actually crossing over the mountains) and enabled the settlers to access and use the land west of the mountains for farming. The crossing took 21 days, and only 6 days to return."]}, {"page": "William Lawson (explorer)", "response": ["Lawson commenced his exploration of the Blue Mountains alongside Blaxland and William Charles Wentworth on 11 May 1813. He kept a journal of the expedition titled, 'W Lawsons Narrative. Across Blue Mountains [sic]'. In his first entry he writes: "]}, {"page": "Wentworth, New South Wales", "response": ["Named after the famous explorer and politician William Charles Wentworth, the town is  to the west (via the Calder Highway) of the Victorian regional city of Mildura. The famous mining city of Broken Hill is  to the north along the Silver City Highway."]}, {"page": "Sydney Hospital", "response": ["The first Surgeon to reside at the hospital's Surgeons quarters was D'Arcy Wentworth, whose other connections with the building are interesting. First, he had been one of the three contractors who had built the Hospital under the \"rum contract\" with Macquarie, and secondly, his son, William Charles Wentworth, explorer and journalist, became one of the most important figures in the development of Parliamentary democracy in New South Wales, and is regarded as the \"father of the constitution\". He is well commemorated by artworks within Parliament House."]}, {"page": "William Wentworth (disambiguation)", "response": ["William Wentworth (William Charles Wentworth I) (1790–1872), was an Australian explorer, barrister, newspaper publisher, politician and landowner.", "*Bill Wentworth (1907–2003), (William Charles Wentworth IV), Australian politician, first federal Minister for Aboriginal Affairs"]}, {"page": "D'Arcy Wentworth", "response": ["Under Darling, no longer an officer of the Crown, D’Arcy Wentworth was free to promote the cause of the Emancipists and trial by jury, and he became their figure head and leader. The press came under pressure for its criticism of the Governor and government policies. D’Arcy initially led the protagonists supporting freedom of the press, a fully elected representative government for the Colony, and no taxation without representation. Amongst the leading agitators were the Australian newspaper and its proprietors: two barristers, Robert Wardell and William Charles Wentworth, D’Arcy Wentworth’s son. Following Darling’s persecution of two soldiers, Sudds and Thompson in November 1826,Government and General Order, 22 November 1826. that resulted in the death of Sudds,The Australian pressed for the recall of Governor Darling. William Wentworth became the voice for representative government for the Colony, and for Governor Darling’s recall."]}]}}