{"wiki_id": "http://www.wikidata.org/entity/Q963161", "itemLabel": "Philip Stanhope, 1st Earl of Chesterfield", "itemDescription": "English nobleman and royalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Stanhope,_1st_Earl_of_Chesterfield", "wikipedia_page": {"main": "Philip Stanhope, 1st Earl of Chesterfield (1584 – 12 September 1656) was an English nobleman, aristocrat and royalist, who was created the first Earl of Chesterfield by King Charles I in 1628.", "link_mentions": [{"page": "Earl of Chesterfield", "response": ["*Philip Stanhope, 1st Earl of Chesterfield (1584–1656)"]}, {"page": "Earl of Harrington", "response": ["These titles were also in the Peerage of Great Britain. Stanhope was the son of John Stanhope of Elvaston and the great-grandson of Sir John Stanhope of Elvaston, younger half-brother of Philip Stanhope, 1st Earl of Chesterfield (who was the grandfather of James Stanhope, 1st Earl Stanhope)."]}, {"page": "Earl Stanhope", "response": ["The earldom was created in 1718 for Major General James Stanhope,Edward Hasted, 'Parishes: Chevening', in The History and Topographical Survey of the County of Kent: Volume 3 (Canterbury, 1797), pp. 105-126. British History Online http://www.british-history.ac.uk/survey-kent/vol3/pp105-126 a principal minister of King George I, with remainder to the heirs male of his body. Stanhope was the son of the Hon. Alexander Stanhope, fifth and youngest son of Philip Stanhope, 1st Earl of Chesterfield. He had the previous year been raised to the peerage  Viscount Stanhope, of Mahón in the Island of Minorca, and Baron Stanhope, of Elvaston, in the County of Derby, in 1717, with special remainder, failing heirs male of his body, to his second cousin John Stanhope of Elvaston (who was the father of William Stanhope, 1st Earl of Harrington) and the heirs male of his body. These titles were also in the Peerage of Great Britain."]}, {"page": "Sir John Gell, 1st Baronet", "response": ["The methods adopted by the Gell brothers included seizing property in lieu of unpaid Duchy rents or Ship money, causing widespread local resentment. One of those affected was Sir John Stanhope; when he died in 1638, his wife Mary and cousin Philip Stanhope, 1st Earl of Chesterfield, took their case to the Privy Council. They lost, but the feud continued into the First English Civil War when Chesterfield supported the Royalists. With war approaching, Charles sought to raise money by selling honours and in January 1642 Gell purchased a baronetcy for £300.Derbyshire D258/56/18c"]}, {"page": "Philip Stanhope, 5th Earl of Chesterfield", "response": ["Stanhope was the son of Arthur Charles Stanhope, of Mansfield Woodhouse, and Margaret, daughter and co-heiress of Charles Headlam, of Kerby Hall, Yorkshire,thepeerage.com Philip Stanhope, 5th Earl of Chesterfield and cousin, godson and, later, adopted son of Philip Stanhope, 4th Earl of Chesterfield (whose titles he inherited at his death in 1773). He was a great-great-great-grandson of Philip Stanhope, 1st Earl of Chesterfield. His adoptive father directed his early education and his tutors included the poet Cuthbert Shaw and Edward Gibbon's friend the Swiss Jacques Georges Deyverdun, as well as Adam Ferguson, Professor of Moral Philosophy at the University of Edinburgh, and the forger Dr William Dodd. He was later educated at the University of Leipzig, Saxony. During his service in Germany he became a member of the Masonic Lodge Minerva zu den drei Palmen Leipzig in 1773.Masonic Lodge Minerva zu den drei Palmen Leipzig"]}, {"page": "Philip Stanhope (Royalist officer)", "response": ["Philip Stanhope was Colonel of the Shelford Manor Royalist forces in the English Civil War. He was the 10th son of Philip Stanhope, 1st Earl of Chesterfield (1584-1656) and his wife Catherine, daughter of Francis Hastings, Baron Hastings.Collin's Peerage of England by Sir Egerton Brydges, K.J.: in nine volumes: VOL. III 1812: Earl of Chesterfield: pp. 422–423. In the list of sons he comes in after the ninth, even though in the text a few lines further on, he is described as fifth son. In the list itself, William is described as Fifth."]}, {"page": "Michael Stanhope (Royalist)", "response": ["Michael Stanhope (died 1648) was born at Shelford Manor, the son of Philip Stanhope, 1st Earl of Chesterfield and his wife Catherine, daughter of Lord Hastings. Colonel Stanhope was in charge of the Royalist forces at the 1648 battle at Willoughby Field, Nottinghamshire, where he was killed. After the battle he was buried among his men in Willoughby church. A monument was erected to him and his men."]}, {"page": "Ferdinando Stanhope", "response": ["Ferdinando Stanhope (1619 to December 1643), younger son of Philip Stanhope, 1st Earl of Chesterfield, was Member of Parliament for Tamworth from 1640 to 1643. He served in the Royalist army during the First English Civil War and was killed in a skirmish near West Bridgford.", "Stanhope was born at Shelford Manor, Nottinghamshire; his date of birth is uncertain but must have been around 1618 in order to meet the minimum age of 21 when elected to Parliament in 1640. He was the ninth but fourth surviving son of Philip Stanhope, 1st Earl of Chesterfield and his wife Catherine, daughter of Francis Hastings, Lord Hastings."]}, {"page": "Philip Stanhope", "response": ["* Philip Stanhope, 1st Earl of Chesterfield (1584–1656), English peer"]}, {"page": "Charles Stanley, 8th Earl of Derby", "response": ["Henry Stanhope, Lord Stanhope (d.1634), 2nd surviving son of Philip Stanhope, 1st Earl of Chesterfield and the elder daughter of Thomas Wotton, 2nd Baron Wotton by his wife Mary Throckmorton, a daughter of Sir Arthur Throckmorton of Paulerspury, Northamptonshire. By his wife he had two sons:"]}, {"page": "Charles Fane, 1st Viscount Fane", "response": ["An indenture of settlement dated 19 November 1707 between Charles Fane of Basildon and others, had her marriage portion at 3,000 L (pounds). Robert Walpole, the husband of Mary's first cousin twice-removed (through the Stanhope family) Catherine Shorter (c.1682–1737) aka cousin Walpole, was a witness. (Philip Stanhope, 1st Earl of Chesterfield's daughter Elizabeth's granddaughter Elizabeth Philipps married Sir John Shorter).Fane de Salis MSS"]}, {"page": "Shelford Priory", "response": ["*Philip Stanhope, 1st Earl of Chesterfield (1584 – 1656).", "Philip Stanhope, 1st Earl of Chesterfield was summoned to Parliament in 1640 and took the side of King Charles I in the threatening conflict. When the English Civil War broke out he and his sons took up arms. From around January 1643, Shelford Manor was garrisoned under the command of his son Philip Stanhope. The manor was fortified during the war, and \"traces of civil war fieldworks\" still survive. The manor was described as \"a fortified house surrounded by a very strong 'bulwark' and a great ditch on the outside of it partly filled with water\", with mentions of a drawbridge and defensive \"'half moons' within the bulwark\".", "The house was rebuilt after the civil war (c.1678) by another son of Philip Stanhope, 1st Earl of Chesterfield, Arthur Stanhope (1627–1677). This building still exists, although it has now been vacated by the Stanhopes. "]}, {"page": "Sir John Stanhope", "response": ["Sir John Stanhope (1559 – 1611) was an English knight and landowner, and father of Philip Stanhope, 1st Earl of Chesterfield.", "Stanhope married firstly, Cordelia Alington, with whom he had his eldest son and heir, Philip Stanhope, 1st Earl of Chesterfield (d.1656).."]}, {"page": "Henry Stanhope, Lord Stanhope", "response": ["He was the second and next surviving son of Philip Stanhope, 1st Earl of Chesterfield and his first wife Catherine Hastings, daughter of Francis Hastings, Lord Hastings, oldest son of George Hastings, 4th Earl of Huntingdon. Amongst his younger brothers were Ferdinando Stanhope and Arthur Stanhope, while his nephew was James Stanhope, 1st Earl Stanhope. He entered the English House of Commons in 1625, sitting for Nottinghamshire in the following two parliaments until 1626. In the third parliament of 1628, he represented East Retford until the next year. At the coronation of King Charles I of England in 1625, he was made a Knight of the Order of the Bath."]}, {"page": "Countess of Chesterfield", "response": ["*Catherine Stanhope, Countess of Chesterfield (d. 1636), first wife of Philip Stanhope, 1st Earl of Chesterfield.", "*Anne Stanhope, Countess of Chesterfield (d. 1667), second wife of Philip Stanhope, 1st Earl of Chesterfield."]}, {"page": "Arthur Stanhope", "response": ["Stanhope was born at Shelford, Mansfield Woodhouse, Nottinghamshire, the son of Philip Stanhope, 1st Earl of Chesterfield and his wife Catherine Hastings, daughter of Francis Hastings, Lord Hastings and was baptised on 10 April 1627. He entered Gray's Inn in 1642. Three older brothers were killed on the Royalist side in the English Civil War but he tended to support the parliamentary party. He lived at Shelford Manor which was badly damaged in 1660 when the disintegrating Commonwealth army attacked Nottingham. History of Parliament Online - Stanhope, Arthur"]}, {"page": "1656 in England", "response": ["* 12 September – Philip Stanhope, 1st Earl of Chesterfield, (born 1584)"]}, {"page": "John Port (died 1557)", "response": ["*Margaret Port, who married Sir Thomas Stanhope, grandfather of Philip Stanhope, 1st Earl of Chesterfield.Collin's Peerage of England by Sir Egerton Brydges, K.J.: in nine volumes: Vol. III 1812: Earl of Chesterfield pp. 415-421"]}, {"page": "Alexander Stanhope", "response": ["He was the youngest son of Philip Stanhope, 1st Earl of Chesterfield by his second wife Anne, daughter of John 'Lusty' Pakington. He was educated at Exeter College, Oxford, graduating in 1654."]}, {"page": "John Pakington (died 1625)", "response": ["Of their three children, Anne, their elder daughter, married at Kensington, on 9 February 1619, Sir Humphrey Ferrers, son of Sir John Ferrers of Tamworth Castle, Warwickshire; and, after his decease, Philip Stanhope, 1st Earl of Chesterfield. Their second daughter, Mary, married Sir Richard Brooke of Nacton in Suffolk."]}, {"page": "Francis Hastings, Lord Hastings", "response": ["* Catherine, who married Philip Stanhope, 1st Earl of Chesterfield, died 28 August 1636"]}, {"page": "William Neville Hart", "response": ["He married secondly Elizabeth Aspinwall. Her father was Stanhope Aspinwall, who on his mother's side, was a great great-grandson of Philip Stanhope, 1st Earl of Chesterfield.Letters of Philip Dormer Stanhope, Earl of Chesterfield, edited by Lord Mahon:Volume II; London; Richard Bentley 1847; Note at the bottom of page 261 Aspinwall was a diplomat who had served in Constantinople and Algiers and at the time of his death in 1771 was Secretary to Earl Harcourt, Ambassador to France. Aspinwall's wife was named Magdalena, but little else appears to be known of her.Will of Stanhope Aspinwall dated 14 April 1747, proved in the Prerogative Court of Canterbury 21 May 1771"]}, {"page": "Stanhope Aspinwall", "response": ["Stanhope Aspinwall (born 5 July 1713 in Liverpool, England and died on 17 January 1771) was a British diplomat. He was born to Richard Aspinwall and his wife Elizabeth Stanhope, the great granddaughter of Philip Stanhope, 1st Earl of Chesterfield, the granddaughter of Arthur Stanhope and daughter of Charles Stanhope.Letters of Philip Dormer Stanhope, Earl of Chesterfield, edited by Lord Mahon:Volume II; London; Richard Bentley 1847; Note on p.261"]}, {"page": "Francis Annesley, 1st Viscount Valentia", "response": ["He married secondly Jane (died 1683/4), widow of Sir Peter Courten, 1st Baronet, of Aldington and daughter of Sir John Stanhope and his second wife Catherine Trentham, and half-sister of Philip Stanhope, 1st Earl of Chesterfield, and they had nine children of whom at least one son and one daughter reached adulthood. "]}, {"page": "Katherine Stanhope, Countess of Chesterfield", "response": ["*Firstly in 1628 to Henry Stanhope, Lord Stanhope (d.1634), 2nd surviving son of Philip Stanhope, 1st Earl of Chesterfield, by whom she had progeny two daughters and a son:"]}, {"page": "Philip Stanhope, first earl of Chesterfield", "response": ["#redirectPhilip Stanhope, 1st Earl of Chesterfield"]}, {"page": "Sir Richard Hoghton, 3rd Baronet", "response": ["Hoghton married Lady Sarah, daughter of Philip Stanhope, 1st Earl of Chesterfield, and had several sons and daughters: of the sons, those survived to maturity were:"]}, {"page": "Charles Hutchinson (Nottingham MP)", "response": ["He was M.P. for Nottingham during the second and third Parliaments of King William III of England. He was the 5th son of Sir Thomas Hutchinson (M.P.) by his second wife Lady Catherine Stanhope of Selford and his first son by Lady Catherine. His mother was the daughter of Sir John Stanhope, and the half sister of Philip Stanhope, 1st Earl of Chesterfield."]}, {"page": "Dorothy Smith (Lady Pakington)", "response": ["Anne, Dorothy's elder daughter by her second husband, married at Kensington, on 9 February 1619, Sir Humphrey Ferrers, son of Sir John Ferrers of Tamworth Castle, Warwickshire; and, after his decease, Philip Stanhope, 1st Earl of Chesterfield. Her second daughter by her second marriage, Mary, married Sir Richard Brooke of Nacton in Suffolk.  The only son of the second marriage, John (1600–1624), was created a baronet in June 1620, and sat in Parliament for Aylesbury in 1623–1624. He married Frances, daughter of Sir John Ferrers of Tamworth, with whom he had two children, including his heir Sir John Pakington, 2nd Baronet (1620–1680)"]}, {"page": "List of peers 1620–1629", "response": ["|Earl of Chesterfield (1628)||Philip Stanhope, 1st Earl of Chesterfield||1628||1656||New creation"]}, {"page": "List of peers 1630–1639", "response": ["|Earl of Chesterfield (1628)||Philip Stanhope, 1st Earl of Chesterfield||1628||1656||"]}]}}