{"wiki_id": "http://www.wikidata.org/entity/Q964439", "itemLabel": "Robert Barton", "itemDescription": "Irish lawyer, soldier, statesman and farmer (1881-1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Barton", "wikipedia_page": {"main": "Robert Childers Barton (14 March 1881 – 10 August 1975) was an Irish nationalist, politician and farmer who participated in the negotiations leading up to the signature of the Anglo-Irish Treaty. His father was Charles William Barton and his mother was Agnes Alexandra Frances Childers. His wife was Rachel Warren of Boston, daughter of Fiske Warren. His double first cousin and close friend was Erskine Childers.\n\n", "link_mentions": [{"page": "Republic of Ireland", "response": ["After the War of Independence and truce called in July 1921, representatives of the British government and the five Irish treaty delegates, led by Arthur Griffith, Robert Barton and Michael Collins, negotiated the Anglo-Irish Treaty in London from 11 October to 6 December 1921. The Irish delegates set up headquarters at Hans Place in Knightsbridge, and it was here in private discussions that the decision was taken on 5 December to recommend the treaty to Dáil Éireann. On 7 January 1922, the Second Dáil ratified the Treaty by 64 votes to 57."]}, {"page": "Éamon de Valera", "response": ["The Republic's delegates to the Treaty Negotiations were accredited by President de Valera and his cabinet as plenipotentiaries (that is, negotiators with the legal authority to sign a treaty without reference back to the cabinet), but were given secret cabinet instructions by de Valera that required them to return to Dublin before signing the Treaty.P. S. O'Hegarty, A History of Ireland Under the Union: 1801 to 1922 (New York: Kraus Reprint Co., 1969), 751. The Treaty proved controversial in Ireland insofar as it replaced the Republic by a dominion of the British Commonwealth with the King represented by a Governor-General of the Irish Free State. The Irish delegates Arthur Griffith, Robert Barton, and Michael Collins supported by Erskine Childers as Secretary-General set up their delegation headquarters at 22 Hans Place in Knightsbridge. It was there, at 11.15 am on 5 December 1921, that the decision was made to recommend the Treaty to Dáil Éireann; the Treaty was finally signed by the delegates after further negotiations which closed at 02:20 on 6 December 1921."]}, {"page": "Michael Collins (Irish leader)", "response": ["The Irish delegates sent  to London were designated as \"plenipotentiaries\", meaning that they had full authority to sign an agreement on behalf of the Dáil government. The Treaty would then be subject to approval by the Dáil. The majority of the delegates, including Arthur Griffith (leader), Robert Barton and Eamonn Duggan (with Erskine Childers as Secretary General to the delegation) set up headquarters at 22 Hans Place in Knightsbridge on 11 October 1921. Collins shared quarters at 15 Cadogan Gardens with the delegation's publicity department, secretary Diarmuid O'Hegarty, Joseph McGrath as well as substantial intelligence and bodyguard personnel including Liam Tobin, Tom Cullen, Ned Broy, Emmet Dalton and Joseph Dolan of The Squad.Mackay, p. 217"]}, {"page": "Anglo-Irish Treaty", "response": ["| Robert Barton  TD for Kildare–Wicklow  (MP for West Wicklow)", "Robert Barton was the last surviving signatory. He died on 10 August 1975 at the age of 94.", "On 15 December, Robert Barton was questioned by Kevin O'Higgins about his notes on Lloyd George's statement about signing the agreement or facing a renewal of war: \"Did Mr Lloyd George single Mr Barton out as the left wing of the delegation and did he say, 'The man who is against peace may bear now and forever the responsibility for terrible and immediate war? Barton replied: \"What he did say was that the signature and the recommendation of every member of the delegation was necessary, or war would follow immediately and that the responsibility for that war must rest directly upon those who refused to sign the Treaty\". This was seized upon by opponents of the treaty as a convenient proof that the Irish delegates had been subjected to duress at the last minute, and \"terrible and immediate war\" became a catch-phrase in the debates that followed.Barton's statement, 15 Dec 1921  The next day, de Valera took up this point: \"therefore what happened was that over there a threat of immediate force upon our people was made. I believe that that document was signed under duress and, though I have a moral feeling that any agreement entered into ought to be faithfully carried out, I have no hesitation in saying that I would not regard it as binding on the Irish nation.\"Secret debates, 16 Dec 1921; De Valera", "The split over the treaty led to the Irish Civil War (1922–23). In 1922, its two main Irish signatories, Arthur Griffith and Michael Collins, both died. Birkenhead reportedly said on signing the treaty: \"Mr Collins, in signing this Treaty I'm signing my political death warrant\", to which Collins is said to have replied, \"Lord Birkenhead, I'm signing my actual death warrant.\" Collins was killed by anti-treaty republicans in an ambush at Béal na Bláth in August 1922, ten days after Griffith's death from heart failure which was ascribed to exhaustion. Both men were replaced in their posts by W. T. Cosgrave. Two of the other members of the delegation, Robert Barton and Erskine Childers, sided against the treaty in the civil war. Childers, head of anti-treaty propaganda in the conflict, was executed by the free state for possession of a pistol in November 1922."]}, {"page": "Second Dáil", "response": ["On 14 September 1921, the Dáil ratified the appointment of Arthur Griffith, Michael Collins, Robert Barton, Eamonn Duggan and George Gavan Duffy as envoys plenipotentiary for the peace conference in England. Of the five only Collins, Griffith and Barton were members of the cabinet. These envoys eventually signed the Anglo-Irish Treaty on 6 December. Between the Truce and the signing of the Treaty the Second Dáil only sat on 10 days, and did not discuss in detail the options available to it. The debate on the Treaty started on 14 December, and continued for thirteen days of debate until 7 January 1922. On that date, the Dáil approved the treaty by 64 in favour to 57 against. The Treaty Debates were the first publicly reported debate on what Sinn Féin felt that it had achieved and could achieve. In the vote, the deputies who represented more than one constituency were each only permitted to vote once, but this would not have changed the outcome. As the leader of the anti-Treaty minority de Valera resigned as President, and on 9 January his opponent Arthur Griffith was elected as president on a vote of 60–58. The anti-Treaty deputies continued to attend the Dáil, with de Valera becoming the first Leader of the Opposition in the Dáil."]}, {"page": "Arthur Griffith", "response": ["thumb|Arthur Griffith and three of the four other members of the Irish delegation (George Gavan Duffy, Erskine Childers and Robert Barton) for the Anglo-Irish Treaty negotiations in 1921"]}, {"page": "1918 Irish general election", "response": ["|Robert Barton"]}, {"page": "Government of the 2nd Dáil", "response": ["|Robert Barton"]}, {"page": "Government of the 1st Dáil", "response": ["|Robert Barton"]}, {"page": "Erskine Childers (author)", "response": ["Robert Erskine Childers DSC (25 June 1870 – 24 November 1922), usually known as Erskine ChildersBoyle (1977: 256) \"An aura of legend still enveloped the name of Erskine Childers in Dublin because of his valorous role in running those guns to Howth.\"His last letter, written from the condemned cell to his wife, was signed \"Erskine\". (Boyle 1977: 25).His publications are all in that name. () (), was an English-born Irish writer, whose works included the influential novel The Riddle of the Sands. He became a supporter of Irish Republicanism and smuggled guns into Ireland in his sailing yacht Asgard. He was executed by the authorities of the nascent Irish Free State during the Irish Civil War. He was the son of British Orientalist scholar Robert Caesar Childers; the cousin of Hugh Childers and Robert Barton; and the father of the fourth President of Ireland, Erskine Hamilton Childers.", "Molly Childers, brought up in a family that traced its roots to the Mayflower, also influenced her husband's outlook on the right of Britain to rule other countries. The ground was well prepared, then, when in the summer of 1908 he and his cousin Robert Barton took a holiday motor tour inspecting agricultural co-operatives in the south and west of Ireland, areas ravaged with poverty. \"I have come back,\" he wrote to Basil Williams, \"finally and immutably a convert to Home Rule... though we both grew up steeped in the most irreconcilable sort of Unionism.\"Quoted in Boyle (1979:144)", "The violent suppression of the Easter Rising in 1916 dismayed Childers and he described a proposed British Bill to extend military conscription to Ireland as \"insane and criminal\". In March 1919, after a severe attack of influenza, his doctors ordered rest in the country. Glendalough was the obvious choice and he joined his cousin Robert Barton there.Piper (2003:196) Barton introduced Childers to the Irish military leader Michael Collins, who in turn introduced him to Éamon de Valera, the President of Sinn Féin. Childers came to believe that his moderate \"dominion\" proposal would not serve."]}, {"page": "Minister for Agriculture, Food and the Marine", "response": ["|Robert Barton"]}, {"page": "1975 in Ireland", "response": ["* 10 August – Robert Barton, Sinn Féin party Member of Parliament, Cabinet minister, and signatory of Anglo-Irish Treaty 1921 (born 1881)."]}, {"page": "The Irish Press", "response": ["The newspaper was controlled by Éamon de Valera and his family, and as a consequence, it supported Fianna Fáil consistently throughout its life, expressing the \"national outlook\" in keeping with the thoughts and sentiments of his party supporters. The paper was aimed particularly at teachers and schools, with strong coverage of GAA games and the Irish language. Cearbhall Ó Dálaigh was the first Irish language editor. The first editor was Frank Gallagher, who fought alongside Éamon de Valera during the Irish War of Independence.O'Brien, Mark. De Valera, Fianna Fáil and the Irish Press:The Truth in the News? Irish Academic Press, 2001 (p. 56). Its directors included Robert Barton."]}]}}