{"wiki_id": "http://www.wikidata.org/entity/Q965801", "itemLabel": "Paul Raymond", "itemDescription": "English keyboardist/guitarist (1945-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Raymond_(musician)", "wikipedia_page": {"main": "Paul Martin Raymond (16 November 1945 – 13 April 2019) was an English keyboardist/guitarist, best known for playing in UFO and Michael Schenker Group.", "link_mentions": [{"page": "Dave Walker", "response": ["In 1971, guitarist Kim Simmonds, leader of blues-rock band Savoy Brown, lost the rest of his band - guitarist Dave Peverett, bassist Tony Stevens, and drummer Roger Earl - after they decided to depart Savoy Brown in order to form Foghat with former Black Cat Bones guitarist Rod Price. To replace the departing members, Simmonds hired Walker on vocals, along with three recently departed members' of Stan Webb's Chicken Shack - keyboardist/guitarist Paul Raymond (later of UFO and Michael Schenker Group), bassist Andy Silvester, and drummer Dave Bidwell.", "In 1974 Walker formed the band Hungry Fighter with his former Savoy Brown colleagues bassist Andy Silvester and keyboardist/guitarist Paul Raymond, his predecessor in Fleetwood Mac Danny Kirwan, and former Warhorse drummer Mac Poole. Hungry Fighter only managed to play one live gig, at the University of Surrey in Guildford, England (which was  not recorded), before the consequences of a road accident sustained by their crew following the gig (which included the destruction of the band's equipment and serious injuries sustained by one member of the road crew), combined with Kirwan's deteriorating mental health, caused the band to fold."]}, {"page": "UFO (band)", "response": ["In July 1976, the band recruited keyboardist and rhythm guitarist Paul Raymond from Savoy Brown to make 1977's Lights Out. This album, the pinnacle of UFO's studio career, includes among others the songs \"Too Hot to Handle\", \"Lights Out\", and the seven-minute opus \"Love to Love\". With Lights Out, the band received substantial critical acclaim, and the album saw the band playing at arenas and theaters across the United States and Europe, opening for bands like Rush and AC/DC. With their new-found success, the band went back into the studio to record their next album Obsession (1978). While Obsession was not as successful as Lights Out, the band still maintained their arena status while touring for the album, playing with AC/DC and Rush again, and other bands like Blue Öyster Cult, Styx, Foghat, Jethro Tull, REO Speedwagon and Molly Hatchet; as part of the Obsession tour, UFO recorded the live album, Strangers in the Night, which was released in January 1979. Strangers was a critical and commercial success, reaching Number 7 in the UK Albums Chart in February 1979, and a tour to support the live album followed, playing with bands like AC/DC, Kiss, Cheap Trick, Journey, Thin Lizzy, Nazareth and Judas Priest, and appearing at the California World Music Festival with Aerosmith, Van Halen, Toto and April Wine.", "After Schenker's exit, UFO rehired Paul Chapman on guitar, who brought over unused track ideas from Lone Star's drummer Dixie Lee. Shortly afterward they released their next LP, No Place to Run, in January 1980. Produced by former Beatles producer George Martin, No Place To Run failed to match up to the success of its predecessors, though it fractionally missed the UK Top 10. Paul Raymond left the band at the end of the No Place To Run tour, and was replaced by John Sloman from Uriah Heep on keyboards for a couple of months and then by former Wild Horses guitarist and keyboardist Neil Carter, who helped fill the void in the songwriting left by Schenker's departure. Carter debuted with UFO on stage at the three-day Reading Festival on 23 August 1980, when the band played as the Saturday night headline act. At the beginning of the following year, UFO released the self-produced The Wild, the Willing and the Innocent, which had a lighter pop rock sound, which was popular at the time. The album achieved mild success in the UK, reaching the UK Top 20, and the single \"Lonely Heart\" was released.", "This proved to be a short hiatus; just short of two years later, in late 1984, Mogg assembled a new UFO line-up, featuring Paul Gray on bass again, ex-Diamond Head drummer Robbie France (replaced in 1985 by former Magnum drummer Jim Simpson), and Atomik Tommy M (Tommy McClendon), a former roadie who also wrote lyrics for Loudness, on guitar, with Paul Raymond rejoining shortly afterward, and released Misdemeanor. Raymond left again in 1986 and was replaced by David Jacobson, who along with Gray would leave in 1987, and Pete Way rejoined on bass. Before Gray's departure, the band recorded the EP Ain't Misbehavin which was released in 1988. Despite the renewed activity of the band, neither release was financially successful and they officially disbanded again in 1989 after a string of guitarists replacing McClendon: Myke Gray of Jagged Edge in late 1987, former Starfighters guitarist Rik Sandford and Tony Glidewell  in 1988, and finally in 1989 future Cold Sweat guitarist Erik Gamans.", "In 2013, Paul Raymond revealed that a new UFO album was in the works, but there was \"no detailed talk of that yet.\" The album, titled A Conspiracy of Stars, was released on 23 February 2015.", "Longtime keyboardist and guitarist Paul Raymond died from a heart attack on 13 April 2019 at the age of 73. Two weeks later, it was announced that Raymond's initial replacement Neil Carter would be rejoining UFO for the remainder of the band's final tour. Former guitarist Paul Chapman died on his 66th birthday on 9 June 2020. Chapman was followed two months later by original bassist Pete Way, who died from accident injuries at the age of 69."]}, {"page": "Obsession (UFO album)", "response": ["*Paul Raymond – keyboards, guitar"]}, {"page": "Lights Out (UFO album)", "response": ["The album was UFO's first to feature lush string arrangements alongside more complex song structures than their previous albums. Producer Ron Nevison brought in Alan McMillan to handle the string and horn arrangements. The most notable song to feature the orchestral colouring was \"Love to Love\". It is also the first UFO album to feature Paul Raymond on keyboards and guitar.", "In 1994, a CD comprising this album and No Heavy Petting was released by BGO Records. 2008 EMI's remastered edition includes four live bonus tracks recorded at The Roundhouse, London. The album cover erroneously states that these tracks were recorded in 1976, but the correct year is 1977. EMI did correct the writing credits, with Paul Raymond finally being credited for his contributions.", "*Paul Raymond – keyboards, guitars, backing vocals"]}, {"page": "No Place to Run (album)", "response": ["#\"Take It or Leave It\" (Paul Raymond) - 3:01", "*Paul Raymond – keyboards, guitar, backing vocals"]}, {"page": "Covenant (UFO album)", "response": ["* Paul Raymond - guitar, keyboards (on Live USA)"]}, {"page": "Angel (American band)", "response": ["The former members of Angel went on to other things following the release of their live album. Lead vocalist Frank DiMino joined UFO guitarist Paul Raymond in the Paul Raymond Project in which he sang lead vocals. Bassist Felix Robinson played on the debut album of the band White Lion, Fight to Survive (1985/1986). Angel’s keyboardist Gregg Giuffria had modest success as the leader of the band Giuffria during the 1980s as well as with the band House of Lords, who - sans Giuffria - reunited in 2002 and released a new album, The Power and the Myth on Frontiers Records. In 2006, Giuffria appeared as a guest keyboardist on House of Lords' LP World Upside Down, and they released Come to My Kingdom in 2008 without Giuffria."]}, {"page": "Mungo Jerry", "response": ["* Paul Raymond – keyboards, guitars (died 2019)"]}, {"page": "Waysted", "response": ["Waysted were a British heavy metal band, formed by former UFO bassist Pete Way and the Scottish rocker Fin Muir (Ian Muir) in 1982. Recruiting Frank Noon (formerly with Def Leppard), Ronnie Kayfield and Paul Raymond, Waysted signed to Chrysalis Records and released Vices in 1983.", "* Paul Raymond – keyboards, guitar (1982–1984)"]}, {"page": "Savoy Brown", "response": ["Simmonds continued the band with Dave Walker on vocals, Paul Raymond on keyboards and guitars, Andy Silvester on bass, and Dave Bidwell on drums – almost the complete Chicken Shack line up.", "While the band is still active, touring the world and recording regularly, only Simmonds has stayed since the beginning. Original member and harmonica player John O'Leary is still active on the British blues circuit with his band Sugarkane. After leaving Savoy Brown for the first time in the 1970s singer Dave Walker joined Fleetwood Mac for one album, and in early 1978 became the temporary lead singer for Black Sabbath. Bassists have included: Andy Pyle, who played with Mick Abrahams from Jethro Tull in Blodwyn Pig, then later with The Kinks; John Humphrey, who would go on to work with many major artists, including Carole King; Gary Moore; and Andy Silvester, who played with Wha-Koo after Chicken Shack.  Savoy Brown also provided an outlet for keyboardist and guitarist Paul Raymond, who later went on to join UFO. Drummer Keith Boyce reformed Heavy Metal Kids and is currently active with that group. Singer Ralph Morman disappeared from the scene in the mid-1980s until emerging in 2011 with plans for a solo project. Guitarist Barry Paul became a successful studio owner in Los Angeles. Singer Jimmy Kunes, who fronted the band during the mid-1980s, is currently the singer for the reformed supergroup Cactus."]}, {"page": "List of keyboardists", "response": ["*Paul Raymond (UFO, Savoy Brown, Plastic Penny)"]}, {"page": "Michael Schenker Group", "response": ["* Paul Raymond – also rhythm guitar (1980–1981, 2011)", "| colspan=\"1\" |Paul Raymond"]}, {"page": "Strangers in the Night (UFO album)", "response": ["#\"Ain't No Baby\" (Mogg, Paul Raymond) - 4:07", "*Paul Raymond – keyboards, guitar, backing vocals"]}]}}