{"wiki_id": "http://www.wikidata.org/entity/Q968645", "itemLabel": "Raphael Ravenscroft", "itemDescription": "British musician, composer and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Raphael_Ravenscroft", "wikipedia_page": {"main": "Raphael Ravenscroft (4 June 1954 – 19 October 2014) was a British musician, composer and author.  He is best known for playing the saxophone on Gerry Rafferty's song \"Baker Street\".", "link_mentions": [{"page": "October 19", "response": ["*  2014   – Raphael Ravenscroft, English saxophonist and composer (b. 1954)"]}, {"page": "America (band)", "response": ["Having had success with Ballard, Beckley and Bunnell asked the former Argent performer to produce their next album, Your Move, in its entirety. In the end, Ballard wrote most of the songs and performed most of the instruments in addition to his production duties. For the most part, Beckley and Bunnell were singers on an album that Ballard had crafted for them, although they did contribute some of their own material. On one track, Bunnell decided to rewrite Ballard's lyrics, and the successful song \"The Border\" was the result. Set to the backing of the Royal Philharmonic Orchestra and the saxophone work of Raphael Ravenscroft, the single scored number 33 on the charts in August 1983. \"The Border\" was much more successful on the adult contemporary charts, where it scored number four (even bettering \"You Can Do Magic\"). It also made number 24 on the Dutch top 40. A second single, Ballard's \"Cast the Spirit\", failed to chart. The album itself, released in June 1983, was reasonably successful at number 81, but something of a disappointment, when compared to its predecessor."]}, {"page": "The Final Cut (album)", "response": ["American composer Michael Kamen, who had contributed to The Wall, co-produced, oversaw the orchestral arrangements,  and mediated between Waters and Gilmour. He also stood in for keyboardist Richard Wright, who had left the band under pressure from Waters during the recording of The Wall. James Guthrie was studio engineer and co-producer, while Mason's drumming was supplemented by Ray Cooper on percussion; when Mason was unable to perform the complex time changes on \"Two Suns in the Sunset\", he was replaced by Andy Newmark. Mason also suggested the repeated reprises of \"Maggie, what have we done\" be rendered instrumental rather than sung. Raphael Ravenscroft was hired to play the saxophone. Recording took place in the latter half of 1982 across eight studios, including Gilmour's home studio at Hookend Manor, and Waters' Billiard Room Studios at East Sheen. The other venues were Mayfair Studios, Olympic Studios, Abbey Road Studios, Eel Pie Studios, Audio International and RAK Studios.", "*Raphael Ravenscroft – tenor saxophone "]}, {"page": "Bob Holness", "response": ["Holness was the subject of an urban myth, claimed to have been initiated in the 1980s by broadcaster Stuart Maconie who, writing for the New Musical Express in a section called 'Believe It or Not', said that Holness had played the saxophone riff on Gerry Rafferty's 1978 song, \"Baker Street\". (The actual performer was Raphael Ravenscroft.) Tommy Boyd, among others, has disputed Maconie's claim to authorship of the rumour."]}, {"page": "The Pros and Cons of Hitch Hiking", "response": ["*Raphael Ravenscroft, Kevin Flanagan, Vic Sullivan – horns"]}, {"page": "About Face (album)", "response": ["*Raphael Ravenscroft – saxophone, flute, keyboards"]}, {"page": "Gerry Rafferty", "response": ["\"Baker Street\" featured a distinctive saxophone riff played by Raphael Ravenscroft, although the origins of the solo have been disputed. As the singer recalled in a 1988 interview with Colin Irwin: \"When I wrote the song I saw that bit as an instrumental part but I didn't know what. We tried electric guitar but it sounded weak, and we tried other things and I think it was Hugh Murphy's suggestion that we tried saxophone.\"", "In his interview with Colin Irwin, Rafferty disputed this and said that Ravenscroft had been his second choice to play the saxophone solo, after Pete Zorn, who was unavailable: \"The only confusion at the time that I didn’t enjoy too much was the fact that a lot of people believed that the line was written by Raphael Ravenscroft, the sax player, but it was my line. I sang it to him.\" When a remastered version of City to City was released in 2011, it included the original, electric guitar version of the song, confirming Rafferty's authorship of the riff. In the liner notes to the album, Rafferty's long-time friend and collaborator Rab Noakes commented: \"Let's hope [the Baker Street demo] will, at last, silence all who keep on asserting that the saxophone player came up with the melody line. He didn't. He just blew what he was told by the person who did write it, Gerry Rafferty.\" Michael Gray, Rafferty's former manager, agreed: \"The audible proof is there from the demos that Rafferty himself created the riff and placed it within the song's structure exactly where it ended up.\" Ravenscroft went on to play on Rafferty's next two albums."]}, {"page": "Flickering Flame: The Solo Years Volume 1", "response": ["*Raphael Ravenscroft, Kevin Flanagan, Vic Sullivan – horns"]}, {"page": "In Our Lifetime (Marvin Gaye album)", "response": ["*Raphael Ravenscroft – alto saxophone"]}, {"page": "Earth Moving", "response": ["* Raphael Ravenscroft – saxophone"]}, {"page": "Baker Street (song)", "response": ["The album City to City (1978), including \"Baker Street\", was co-produced by Rafferty and Hugh Murphy. In addition to a searing guitar solo, played by Hugh Burns, the song featured a prominent eight-bar saxophone riff played as a break between verses, by Raphael Ravenscroft.", "* Raphael Ravenscroft – alto and soprano saxophones"]}, {"page": "Pictures at Eleven", "response": ["*Raphael Ravenscroft – saxophone on track 3"]}, {"page": "The B. Coming", "response": ["* \"Whole Lotta Something Goin On” by Raphael Ravenscroft"]}, {"page": "Lyricon", "response": ["* Raphael Ravenscroft"]}, {"page": "Romance Dance", "response": ["* Raphael Ravenscroft – saxophone (6)"]}, {"page": "Eto! Baš hoću!", "response": ["*Raphael Ravenscroft – tenor, baritone and alto saxophone"]}, {"page": "Tennis (album)", "response": ["* Raphael Ravenscroft – saxophones, horn arrangements "]}, {"page": "List of unreleased songs recorded by ABBA", "response": ["\"Just Like That\" was recorded in May 1982. It has yet to be officially released in its entirety, though a complete bootleg version is featured on the album ABBA - We Owed You One on the Mistrial Music label.Palm, Carl Magnus: ABBA - The Complete Recordings Sessions, pages 117, 118. Verulam Publishing Ltd (October 13, 1994). . .Palm, Carl Magnus: ABBA - Människorna Och Musiken, page 187. Tiden Stockholm (1996). . Benny and Björn have stated that the song sounded 'wrong': the verse and chorus did not fit together, and that is why it was scrapped. The two men admit this happens regularly in their way of writing music: a mediocre song can become a bridge or a riff for another song, and a good melody line can lie around for many years until it surfaces in a composition. Benny and Björn nevertheless allowed for a 'snippet' of \"Just Like That\" to be released in a 'medley' track on the box set Thank You for the Music in 1994. Although this snippet only revealed the chorus of the track, it is notable for featuring a saxophone solo by Raphael Ravenscroft, perhaps best known for his famous saxophone riff on Gerry Rafferty's 1978 hit \"Baker Street\". This was one of the very few times that ABBA used a musician outside the usual ABBA circle."]}, {"page": "Two Suns in the Sunset", "response": ["*Raphael Ravenscroft – saxophone"]}, {"page": "City to City", "response": ["*Raphael Ravenscroft – saxophone on tracks 2 and 9"]}, {"page": "Is There Anything About?", "response": ["* Raphael Ravenscroft – saxophone (track 2)"]}, {"page": "The Gunner's Dream", "response": ["* Raphael Ravenscroft – tenor sax "]}, {"page": "Ravenscroft", "response": ["* Raphael Ravenscroft (1954–2014), saxophonist"]}, {"page": "Your Move", "response": ["The album was released in June 1983. \"The Border\", featuring Bunnell's reworked lyrics, strings by the Royal Philharmonic Orchestra and an energetic saxophone solo by Raphael Ravenscroft, hit number 33 on the Billboard singles chart - what would turn out to be America's last Top 40 pop hit to date.  The single fared far better on adult contemporary radio, peaking at number 4.  This even bettered \"You Can Do Magic,\" which had peaked at number 5 on the adult contemporary charts the year before.  However, lacking a major hit single, Your Move was unable to replicate the success of View From The Ground, peaking at number 81 on the Billboard album charts.  With that, America's collaboration with Ballard came to an end.", "* Raphael Ravenscroft – saxophones "]}, {"page": "Night Owl (album)", "response": ["*Raphael Ravenscroft – saxophone (A5, B1, B4, B5), lyricon (A2)"]}, {"page": "Night Owl (Gerry Rafferty song)", "response": ["\"Night Owl\" is a song by Gerry Rafferty. It is the second track on his 1979 album of the same name. It features a Lyricon solo played by \"Baker Street\" saxophonist Raphael Ravenscroft. The song made the top five in the UK Singles Chart, and along with \"Baker Street\" is one of two solo efforts by Gerry Rafferty to accomplish this feat."]}, {"page": "Snakes and Ladders (Gerry Rafferty album)", "response": ["*Raphael Ravenscroft – saxophone (tracks 3, 6)"]}, {"page": "Goodbye to the Island", "response": ["*Raphael Ravenscroft - saxophone"]}, {"page": "June 4", "response": ["*1954 – Raphael Ravenscroft, English saxophonist and composer (d. 2014)"]}, {"page": "Richard Wright (musician)", "response": ["During 1983-1984, Wright formed a new musical duo called Zee with Dave Harris (from the band Fashion). The pair had been introduced by a mutual friend, saxophonist Raphael Ravenscroft. They signed a record deal with EMI Records and released only one album, Identity, which was a commercial and critical flop. Wright later referred to Zee as \"an experiment best forgotten\"."]}, {"page": "Eddie Hardin", "response": ["*  Wind in the Willows Live (featuring Maggie Bell, Graham Bonnet, Raphael Ravenscroft, Jon Lord and Zak Starkey), in-akustik INAK/BOSE INAK 9010 (1992)"]}, {"page": "A Band Called O", "response": ["* Jeff Bannister played with Charlie Dore, on Raphael Ravenscroft’s Her Father Didn't Like Me Anyway (1979), and Joan Jett's Bad Reputation (1980)."]}, {"page": "Roger Noel Cook", "response": ["While at Polystyle, Cook, on lead vocals, formed the band Stud Leather with Alan Kirkham on guitar. The rest of the band were Haydn Gridley on bass, Johnny Aldrich on drums and Dickie Graves on backing vocals. The band was signed to DART (Dart Records) but disbanded after one single, \"Cut Loose,\" which also featured Raphael Ravenscroft on saxophone (who later played the famous sax solo on Gerry Rafferty's \"Baker Street\"). Cook then released a single with Alan Kirkham, \"Slick Go-Getter\", on DART, released October 1973."]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Raphael Ravenscroft, saxophonist."]}, {"page": "Free Fall (Alvin Lee Band album)", "response": ["*Raphael Ravenscroft - saxophone on \"Heartache\" and \"Ridin' Truckin'\""]}]}}