{"wiki_id": "http://www.wikidata.org/entity/Q968565", "itemLabel": "William Tenn", "itemDescription": "British-American science fiction author (1920-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Tenn", "wikipedia_page": {"main": "William Tenn was the pseudonym of Philip Klass (May 9, 1920 – February 7, 2010), a British-born American science fiction author, notable for many stories with satirical elements.\n\n", "link_mentions": [{"page": "Alternate history", "response": ["In William Tenn's short story Brooklyn Project (1948), a tyrannical US Government brushes aside the warnings of scientists about the dangers of time travel and goes on with a planned experiment - with the result that minor changes to the prehistoric past cause Humanity to never have existed, its place taken by tentacled underwater intelligent creatures - who also have a tyrannical government which also insists on experimenting with time-travel."]}, {"page": "Grok", "response": ["Heinlein describes Martian words as \"guttural\" and \"jarring\". Martian speech is described as sounding \"like a bullfrog fighting a cat\". Accordingly, grok is generally pronounced as a guttural gr terminated by a sharp k with very little or no vowel sound (a narrow IPA transcription might be ). William Tenn suggests Heinlein in creating the word might have been influenced by Tenn's very similar concept of griggo, earlier introduced in Tenn's story \"Venus and the Seven Sexes\" (published in 1949). In his later afterword to the story, Tenn says Heinlein considered such influence \"very possible\"."]}, {"page": "May 9", "response": ["*1920 – William Tenn, English-American author and academic (d. 2010)"]}, {"page": "Poul Anderson", "response": ["* Poul Anderson, an essay by William Tenn"]}, {"page": "List of Worldcons", "response": ["| Terry Pratchett (pro)William Tenn (pro)Jack Speer (fan)Peter Weston (fan)"]}, {"page": "Sturgeon's law", "response": ["According to Philip Klass (William Tenn), Sturgeon made this remark circa 1951, at a talk at New York University attended by Tenn. The statement was subsequently included in a talk Sturgeon gave at a 1953 Labor Day weekend session of the World Science Fiction Convention in Philadelphia."]}, {"page": "List of science-fiction authors", "response": ["*William Tenn (1920–2010) (pseudonym of Philip Klass)"]}, {"page": "List of science fiction short stories", "response": ["| William Tenn", "| William Tenn"]}, {"page": "Alien invasion", "response": ["Prospects of invasion tended to vary with the state of current affairs, and current perceptions of threat. Alien invasion was a common metaphor in United States science fiction during the Cold War, illustrating the fears of foreign (e.g. Soviet Union) occupation and nuclear devastation of the American people. Examples of these stories include the short story “The Liberation of Earth“ (1950) by William Tenn and the film The Invasion of the Body Snatchers (1956)."]}, {"page": "Out of the Unknown", "response": ["On her return to London, Shubik learned that she had been appointed producer and story editor for the new anthology series. She obtained the services of George Spenton-Foster as her associate producer. Spenton-Foster was a science fiction fan and his wide experience of BBC television production proved invaluable to Shubik. By this stage, she had found the twelve scripts she needed for the series: ten episodes would be adaptations of stories by John Wyndham (\"Time to Rest\" and its sequel \"No Place Like Earth\", dramatised together as \"No Place Like Earth\"); Alan Nourse (\"The Counterfeit Man\"); Isaac Asimov (\"The Dead Past\" and Sucker Bait); William Tenn (\"Time in Advance\"); Ray Bradbury (\"The Fox and the Forest\"); Kate Wilhelm (\"Andover and the Android\"); John Brunner (\"Some Lapse of Time\"); J. G. Ballard (\"Thirteen to Centaurus\") and Frederik Pohl (\"The Midas Plague\"). Two original stories—\"Stranger in the Family\" by David Campton and \"Come Buttercup, Come Daisy, Come...?\" by Mike Watts—were also commissioned. Among those commissioned to adapt the stories were a few notable names in television writing: Terry Nation, creator of the Daleks for Doctor Who and later of Survivors and Blake's 7, adapted Bradbury's \"The Fox and the Forest\" while Troy Kennedy Martin, co-creator of Z-Cars, adapted Pohl's \"The Midas Plague\"."]}, {"page": "Sex and sexuality in speculative fiction", "response": ["William Tenn wrote in 1949 Venus and the Seven Sexes – featuring the Plookhs, natives of the planet Venus, who require the participation of seven different sexes in order to reproduce and who get corrupted by human film director Hogan Shlestertrap. The rather satirical story might be the first case of an author speculating of creatures having more than two sexes, an idea later taken up by various others."]}, {"page": "Galaxy Science Fiction", "response": ["Gold published a wide range of material, and Galaxy became known for irony and satire; the work of authors able to adopt the wry style he favored, such as Knight and Robert Sheckley, appeared regularly in the magazine and were obvious commentaries on contemporary society. In 1953, with McCarthyism at its height, Gold refused to publish \"The Liberation of Earth\", a story by William Tenn satirizing both the Russian and American sides in the Korean War. Tenn quotes Gold, an ex-radical, as saying the idea made him \"sweat green\", though the year before he had published Isaac Asimov's \"The Martian Way\", a thinly veiled anti-McCarthy story.Ortiz, Emshwiller, p. 35William Tenn, \"From a Cave\", in Pohl, Greenberg and Olander, Galaxy, p. 33."]}, {"page": "List of American novelists", "response": ["* William Tenn (1920–2010), Of Men and Monsters"]}, {"page": "SF Masterworks", "response": ["|William Tenn"]}, {"page": "Dimension X (radio program)", "response": ["Preceded by Mutual's 2000 Plus (1950–52), Dimension X was not the first adult science fiction series on radio, but the acquisition of previously published stories immediately gave it a strong standing with the science fiction community, as did the choice of established writers within the genre: Isaac Asimov, Robert Bloch, Ray Bradbury, Fredric Brown, Robert A. Heinlein, Murray Leinster, H. Beam Piper, Frank M. Robinson, Clifford D. Simak, William Tenn, Jack Vance, Kurt Vonnegut, Jack Williamson and Donald A. Wollheim. Ernest Kinoy and George Lefferts adapted most of the stories and also provided original scripts."]}, {"page": "X Minus One", "response": ["* William Tenn – \"Venus is for Men\""]}, {"page": "Time in Advance", "response": ["Time in Advance (no ISBN) is a collection of four short stories by American science fiction writer William Tenn (a pseudonym  of Philip Klass). The stories all originally appeared in a number of different publications between 1952 and 1957.", "Fruma Klass was Philip Klass's (William Tenn's) wife, Winthrop being the name of the title character of the final story in the collection.", "* Bibliography of William Tenn", "Category:Works by William Tenn"]}, {"page": "List of Pennsylvania State University people", "response": ["* William Tenn (pen name of Philip Klass), science fiction writer"]}, {"page": "Venus in fiction", "response": ["* \"Venus and the Seven Sexes\" (1947) by William Tenn."]}, {"page": "Venus and the Seven Sexes", "response": ["\"Venus and the Seven Sexes\" is a science fiction story  by American writer William Tenn.  It was first published in the anthology The Girl with the Hungry Eyes, and Other Stories (Avon Publishing) in 1949, and then in 1953 in the anthology Science-Fiction Carnival by Fredric Brown and Mack Reynolds (Shasta Publishers).ISFDB publication history", "The story was reprinted in 1968 in The Seven Sexes, an anthology of William Tenn's short stories published by Ballantine Books. It also appeared in the 2001 anthology of William Tenn's works titled Immodest Proposals, published by NESFA Press.", "Don D'Ammassa has described it as \"quite funny\",William Tenn, by Don D'Ammassa, at DonDammassa.com; published no later than September 14, 2015; retrieved November 24, 2017 while Nick Gevers considered it to be a \"scathing [analysis] of militarism and cargo-cult culture possessing great bite even now\".Immodest Proposals, reviewed by Nick Gevers, at the SF Site; published 2001; retrieved November 24, 2017 Io9 called it \"off-kilter\" and \"humorous.Remembering Golden Age Science Fiction Author William Tenn, by Alisdair Wilkins, at io9; published February 8, 2010; retrieved November 24, 2017 Inc. editor George Gendron has compared the Plookh reproductive cycle to the difficulties of running a startup.The Seven Sexes of Venus, by George Gendron, at Inc.; published April 1, 1999; retrieved November 24, 2017", "Category:Works by William Tenn"]}, {"page": "Paul Erickson (screenwriter)", "response": ["Erickson contributed generally single episodes to a wide variety of British television shows, most typically of the crime drama genre, although he did occasionally generate science fiction scripts.  In the 1950s, he would have generally been considered a B movie or telemovie writer, offering theatrical audiences such work as Track the Man Down, Secret Venture, and Three Steps to the Gallows. By the 1960s, however, his work was almost exclusively for episodic and anthologic television.   He sold three scripts for the third season of The Saint, adapted William Tenn's short story, \"Time in Advance\", for Out of the Unknown, wrote The Ark for Doctor Who, and contributed to The Inside Man and Paul Temple."]}, {"page": "Steven E. de Souza", "response": ["De Souza was born in Philadelphia, Pennsylvania, the son of Evelyn (Green) and H. Walton Henriques de Souza, a Jamaican, who owned a real estate company. He attended Pennsylvania State University, where he was a student of science fiction author Philip Klass (better known by his pseudonym William Tenn). He began his career as a story editor for primetime television series such as The Six Million Dollar Man and The Hardy Boys Mysteries, before graduating to the role of producer and writer. He produced the first season of Knight Rider, and was the creator of the short-lived sci-fi series The Powers of Matthew Star."]}, {"page": "Golden Age of Science Fiction", "response": ["* William Tenn (1920–2010)"]}, {"page": "Sci Fiction", "response": ["| Bernie the Faust || William Tenn || July 11, 2001 || ", "| Party of Two Parts || William Tenn || January 8, 2003 || ", "| The Tenants || William Tenn || July 20, 2005 || "]}, {"page": "Bantam Books", "response": ["* William Tenn"]}, {"page": "62nd World Science Fiction Convention", "response": ["*William Tenn (pro)"]}, {"page": "Author Emeritus", "response": ["* 1999 William Tenn"]}, {"page": "Norwescon", "response": ["# Norwescon IV - March 27–29, 1981; GoH: Samuel R. Delany; FGoH Jack Palmer, Pauline Palmer, and Tilda Palmer; TM Philip Klass (William Tenn); Attendance 1410"]}, {"page": "Child's Play", "response": ["* \"Child's Play\", a 1947 science fiction short story by William Tenn"]}, {"page": "Tomorrow, the Stars", "response": ["*\"Betelgeuse Bridge\" by William Tenn, 1950 Available online"]}, {"page": "Cavalier (magazine)", "response": ["Authors in the 1950s included Jimmy Breslin, Henry Kuttner, Clyde Beatty (\"Tigers on the Loose\"), and Stanley P. Friedman. During the 1960s, the magazine featured such writers as Isaac Asimov, Ray Bradbury, Robert Coover, Leonard Feather, Bruce Jay Friedman, Richard Gehman, Nat Hentoff, John Clellon Holmes, William Bradford Huie, Garson Kanin, Paul Krassner, John D. MacDonald, Alberto Moravia, Thomas Pynchon, Robert Shelton, Isaac Bashevis Singer, Theodore Sturgeon, William Tenn, and Colin Wilson. Some stories were reprints, such as Roald Dahl's \"Man from the South\" in the June 1960 issue."]}, {"page": "NESFA Press", "response": ["* Dancing Naked: The Unexpurgated William Tenn, by William Tenn", "* Here Comes Civilization: The Complete Science Fiction of William Tenn, Volume 2, by William Tenn", "* Immodest Proposals: The Complete Science Fiction of William Tenn, Volume 1, by William Tenn", "* William Tenn"]}, {"page": "Of Men and Monsters", "response": ["Of Men and Monsters  is a science fiction novel by American writer William Tenn, published in June 1968 as a paperback by Ballantine Books. The book is an expansion of his story \"The Men in the Walls\", originally published in Galaxy Science Fiction in October 1963. Of Men and Monsters is Tenn’s only full-length novel, as the majority of his other stories are novellas.", "Category:Works by William Tenn"]}, {"page": "That Hell-Bound Train", "response": ["The story was shaped by William Tenn, who at the time had an editorial position at Fantasy and Science Fiction salvaging stories that had been selected by Anthony Boucher (prior to Boucher's retirement) as \"not quite good enough to be published, but still too good to have been rejected\". In 2001, Tenn explained that the original version of \"That Hell-Bound Train\" had been \"an absolutely fine piece of work that just didn't have a usable ending\"; consequently, he devised a new ending \"and persuaded [Bloch] to write it\".\"Immodest Proposals: The Complete Science Fiction of William Tenn (volume 1)\", published 2001 by NESFA Press; p 199"]}, {"page": "Klass", "response": ["* Philip Klass (born 1920), American science fiction writer under the name William Tenn"]}, {"page": "Washington Science Fiction Association", "response": ["|2003 11 21-23||Hilton Silver Spring||MD||William Tenn||Sam Lubell||unknown||234"]}, {"page": "Disclave", "response": ["|1976 5 28-31||Sheraton Park||DC||William Tenn"]}, {"page": "TV: 2000", "response": ["| Sponsors || \"The Jester\" || William Tenn"]}]}}