{"wiki_id": "http://www.wikidata.org/entity/Q968461", "itemLabel": "David Holmes", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Holmes_(actor)", "wikipedia_page": {"main": "David Holmes (born 1981) is a British podcast host and former actor and stunt performer.", "link_mentions": [{"page": "Holmes (surname)", "response": ["* David Holmes (actor) (born 1981), British actor and stunt performer", "* David Holmes (diplomat), American diplomat assigned to Ukraine embassy ", "* David Holmes (politician) (1769–1832), American politician", "* David Holmes (musician) (born 1969), Irish DJ, musician and composer"]}, {"page": "David Holmes", "response": ["David Holmes may refer to:", "* David Holmes (academic administrator), former Registrar of the University of Oxford", "* David Holmes (musician) (born 1969), Northern Irish electronic musician and composer", "* David Holmes, drummer and vocalist for Servant", "* David Holmes (actor) (born 1981), British stuntman and actor in the Harry Potter films", "* David Holmes (politician) (1769–1832), last governor of the Mississippi Territory and the first governor of the State of Mississippi", "* David Holmes (trade unionist) (1843–1906), British trade unionist", "* David Holmes (journalist) (1926–2014), BBC political editor", "* David Holmes (diplomat), United States Department of State official", "* David Holmes (businessman), former Chairman of Rangers F.C."]}, {"page": "Harry Potter (film series)", "response": ["The series has seen many returning crew members from various departments, including Tim Burke, visual effects supervisor; Peter Doyle, digital film colourist; Nick Dudman, make-up and creature effects designer; David Holmes, stunt double; Amanda Knight, make-up artist; Stephenie McMillan, set designer; Greg Powell, stunt coordinator; Jany Temime, costume designer; and Fiona Weir, casting director."]}, {"page": "Production of Harry Potter and the Deathly Hallows", "response": ["During production at Leavesden, Radcliffe's stunt double David Holmes suffered a serious spinal injury during the filming of an aerial sequence, which left him paralysed. Holmes fell to the ground following an explosion which was part of the stunt."]}, {"page": "List of film and television accidents", "response": ["* Harry Potter and the Deathly Hallows (2010/2011). During production at Leavesden, Daniel Radcliffe's stunt double David Holmes suffered a serious spinal injury during the filming of an aerial sequence, which left him a paraplegic. Holmes fell to the ground following an explosion that was part of the stunt."]}, {"page": "British Stunt Register", "response": ["Members past and present appeared in the British 2018 documentary In Praise of Action (dir. Aiste Jauraite and Skaiste Jauraite) and in 2021 Hollywood Bulldogs: The Rise and Falls of the Great British Stuntman (dir. John Spira, nar. Ray Winstone), including Vic Armstrong, Abbi Collins, Sarah Franzl, David Holmes, Rocky Taylor, Paul Weston."]}]}}