{"wiki_id": "http://www.wikidata.org/entity/Q970640", "itemLabel": "Norman Deeley", "itemDescription": "English footballer (1933-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Deeley", "wikipedia_page": {"main": "Norman Victor Deeley (30 November 1933 – 7 September 2007) was an English professional footballer, who spent the majority of his league career with Wolverhampton Wanderers. He scored two goals in the 1960 FA Cup Final, in a performance that won him the Man of the Match award. He also won the league title three times with Wolves and was capped twice by England.", "link_mentions": [{"page": "November 30", "response": ["*1933 – Norman Deeley, English footballer and manager (d. 2007)"]}, {"page": "Wednesbury", "response": ["*Norman Deeley, footballer, Wolverhampton Wanderers 1951–62"]}, {"page": "Dave Whelan", "response": ["Whelan played 78 times as a left back, scoring three times, for Blackburn Rovers and was a member of its 1960 FA Cup Final team, which lost 3–0 to Wolverhampton Wanderers. Whelan himself did not complete the game, a feisty challenge from Whelan on Norman Deeley culminated in the Blackburn man being withdrawn before half time due to a broken leg. Whelan's injury is one of many serious injuries suffered by players in the 1950–60 era and was known as the Wembley hoodoo.Wembley Hoodoo The Guardian Following his leg break, Whelan was sold to Crewe Alexandra, where he made his debut on 23 February 1963 in a 4–0 first round League Cup defeat at Port Vale, and notched up 115 appearances through to April 1966. He then retired to concentrate on developing a retail grocery business."]}, {"page": "2007–08 in English football", "response": ["*7 September 2007 – Norman Deeley, 73, former Wolverhampton Wanderers winger who scored twice in the 1960 FA Cup Final, and won two caps for England. Also played for Leyton Orient.Wolves FA Cup hero dies, 73 Express and Star. Retrieved 28 November 2013"]}, {"page": "1960 FA Cup Final", "response": ["Wolves won the game and the cup after a 3–0 victory, with a Norman Deeley double after Blackburn defender Mick McGrath had scored an own goal. This was Wolves' fourth and most recent FA Cup success.", "Failing to take that opportunity soon proved costly for Blackburn when they suffered a disastrous few minutes. A low cross driven in by Stobart was deflected past Blackburn's goalkeeper by his own unfortunate defender, Mick McGrath to break the deadlock on 41 minutes. Then, two minutes later Blackburn's woes heightened as full-back Dave Whelan fractured his leg in a challenge with Norman Deeley. Though initially overlooked by the referee who allowed play to continue, both men needed substantial treatment. Whelan was eventually stretchered off, and, without the use of substitutes, left his team to complete the game with only 10 men.", "| ||7 || Norman Deeley"]}, {"page": "1957–58 in English football", "response": ["28 September 1957: Wolverhampton Wanderers beat Manchester United at home 3–1 with two goals from Dennis Wilshaw and one from Norman Deeley."]}, {"page": "1959–60 in English football", "response": ["7 May 1960: Wolverhampton Wanderers defeat Blackburn Rovers 3–0 in the FA Cup final at Wembley Stadium, with two goals from Norman Deeley and an own goal from Mick McGrath."]}, {"page": "Deaths in September 2007", "response": ["*Norman Deeley, 73, British footballer (Wolverhampton Wanderers)."]}, {"page": "Des Horne", "response": ["The 1959–60 season was his best with the club, making 36 appearances in total - including playing in the European Cup  - and scoring 11 times. The campaign ended with Horne playing in the 1960 FA Cup Final where Wolves defeated Blackburn Rovers 3-0 at Wembley. The winger had an assist in this victory as he crossed for Norman Deeley to head in the second goal."]}, {"page": "1954 FA Charity Shield", "response": ["|||10|| Norman Deeley"]}, {"page": "1959 FA Charity Shield", "response": ["| ||11|| Norman Deeley"]}, {"page": "1960 FA Charity Shield", "response": ["| ||11|| Norman Deeley"]}, {"page": "Andy Deeley", "response": ["Andrew Deeley is a former association football player who represented New Zealand at international level. He is the son of former Wolverhampton Wanderers winger and England international, Norman Deeley."]}, {"page": "1957–58 Wolverhampton Wanderers F.C. season", "response": ["Norman Deeley\t41\t4\t45", "|Norman Deeley", "|Norman Deeley"]}, {"page": "1958–59 Wolverhampton Wanderers F.C. season", "response": ["|Norman Deeley"]}, {"page": "1954–55 Wolverhampton Wanderers F.C. season", "response": ["Norman Deeley\t7\t0\t1\t8"]}, {"page": "Gerry Mannion", "response": ["He was limited to just 21 appearances in total for the Molineux club, largely due to the presence of Norman Deeley on the wing. With playing opportunities limited, he moved to Norwich City in September 1961, for £13,000."]}, {"page": "Deeley", "response": ["*Norman Deeley (1933–2007),  English professional soccer player"]}]}}