{"wiki_id": "http://www.wikidata.org/entity/Q97232", "itemLabel": "Ruth Glass", "itemDescription": "British sociologist (1912-1990)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Glass", "wikipedia_page": {"main": "Ruth Glass (born Ruth Adele Lazarus, 1912–1990) was a German-born British sociologist.\n\n", "link_mentions": [{"page": "Gentrification", "response": ["Historians say that gentrification took place in ancient Rome and in Roman Britain, where large villas were replacing small shops by the 3rd century, AD. The word gentrification derives from gentry—which comes from the Old French word genterise, \"of gentle birth\" (14th century) and \"people of gentle birth\" (16th century). In England, landed gentry denoted the social class, consisting of gentlemen (and gentlewomen, as they were at that time known). British sociologist Ruth Glass was first to use \"gentrification\" in its current sense. She used it in 1964 to describe the influx of middle-class people displacing lower-class worker residents in urban neighborhoods; her example was London, and its working-class districts such as Islington: as cited in "]}, {"page": "1964 in the United Kingdom", "response": ["* The research study London: aspects of change, introducing Ruth Glass's concept of gentrification."]}, {"page": "David Glass (sociologist)", "response": ["He died in 1978 from a coronary thrombosis and was survived by his wife Ruth Glass, the urban sociologist."]}, {"page": "Max Lock", "response": ["Max Lock (1909–1988) was a British postwar urban planner who emphasised the importance of incorporating social research in the planning process. His most notable contributions were associated with planning in Middlesbrough, where he worked with Griselda Rowntree and Ruth Glass on the 1944 Middlesbrough Survey, and Hull. Lock's Hull work achieved acclaim with a 1943 London exhibition at the Housing Centre opened by the Minister of Town and Country Planning and in The Architects' Journal.Obituary, Independent, 3 May 1988.Glass, R. (1948), The Social Background to a Plan, Routledge and Kegan Paul Ltd, Londonhttp://home.wmin.ac.uk/MLprojects/HISTORY.HTM"]}, {"page": "Elizabeth Chesterton", "response": ["In 1947, Chesterton joined Cambridgeshire County Council as a development control officer, then from 1951, she spent two years at University College, London as an assistant to Ruth Glass, who was researching the post-war planning system."]}, {"page": "John Westergaard (sociologist)", "response": ["John Harald Westergaard was born on 13 October 1927 in Putney, London, to Otto and Inger Westergaard; his parents were Danish and his father was a civil engineer. In 1938, with his parents about to divorce, Westergaard moved to Denmark with his mother and was sent to boarding school in Copenhagen; his experiences under Nazi occupation and his mother's attachment to the Danish resistance movement during the Second World War encouraged an opposition to authority and a belief in socialism. He was briefly a censor in the British Army of the Rhine and then completed a sociology degree at the London School of Economics (LSE), graduating in 1951. He was a researcher to Ruth Glass at University College London, before moving to the University of Nottingham for the 1955–56 year. He then returned to the LSE as a lecturer, and secured promotion to a readership in sociology in 1970. In 1975, he was appointed as Keith Kelsall's successor to the Chair in Sociological Studies at the University of Sheffield. He retired in 1986 amid funding cuts and declining student numbers which had led to the sociology honours degree course falling into abeyance at Sheffield. His early retirement – and that of Eric Sainsbury (Chair in Social Administration) – was carried out to ensure that junior staff did not lose their jobs. In the meantime, he had also been Deputy Dean and Dean of the Faculty of Social Sciences at Sheffield between 1982 and 1986. In retirement, he remained associated with the university as an emeritus professor; he also held visiting posts and served as president of the British Sociological Association from 1991 to 1993. He was also an Academician of the Academy of Social Sciences.Alan Walker, \"John Westergaard obituary\", The Guardian, 23 May 2014. Retrieved 16 September 2018.\"Professor John Westergaard\", University of Sheffield, 9 May 2014. Retrieved 16 September 2018.\"John Westergaard RIP\", Academy of Social Sciences, 29 May 2014. Retrieved 16 September 2018.Sociological Studies: A History To Be Proud Of (University of Sheffield, 2013), p. 2."]}]}}