{"wiki_id": "http://www.wikidata.org/entity/Q973702", "itemLabel": "Bob Matthewson", "itemDescription": "English footballer (1930-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bob_Matthewson", "wikipedia_page": {"main": "Robert Matthewson (13 April 1930 – 10 November 2000) was an English footballer and FIFA referee. Born in Newcastle upon Tyne, Matthewson had a spell playing for the Byker Youth Club's football team before he was signed by Bolton Wanderers. After six appearances for Bolton in six seasons, including three appearances in the Football League, Matthewson was allowed to leave the club on a free transfer by manager Bill Ridding. He then joined Lincoln City but never played a league game for them. He then entered National Service. Upon his return an engineering colleague persuaded him to take up refereeing back in Bolton in 1958–1959, progressing through local leagues to the Lancashire Combination and Northern Premier League.Matthewson became a Football League linesman in 1966 and two years later joined the list of referees. He made a quick impression and was senior linesman for the 1970 FA Cup Final between Chelsea and Leeds. A year later he took charge of a League Cup semi-final between Stoke City and West Ham United and in late 1972 was promoted to the FIFA List of referees. He was in charge of the remarkable 1974 FA Charity Shield match. This was Brian Clough's first major match as manager of Leeds but became better-known for a double sending-off. Matthewson sent Leeds United's Billy Bremner and Liverpool's Kevin Keegan off for fighting, the first time players had been dismissed in a major British club match at Wembley. The following year he was referee for the FA Cup semi-final at Hillsborough between Birmingham City and Fulham. His career in England culminated with Manchester United's 2–1 win over Liverpool in the 1977 FA Cup Final, the result ending Liverpool's hopes of the domestic League and Cup double. In May 1977 he signed on to become an official in the North American Soccer League.On the international stage he only officiated two full international matches: the first was a UEFA Euro 1976 qualifying Group 8 match between Malta and Greece on 23 February 1975 and the second was a friendly between Wales and West Germany on 6 October 1976. He also refereed the 1974–75 UEFA Cup semi-final first leg between Köln and Borussia Mönchengladbach on 8 April 1975.With his wife, Pauline, Matthewson had a daughter Karen, a step-daughter Suzanne and three grandchildren. As well as playing and refereeing football, Matthewson also worked as an engineer for de Havilland in Horwich. Matthewson was portrayed in the 2009 film The Damned United by Peter Quinn, the secretary of Blackburn non-league football club Sporting Athletic.", "link_mentions": [{"page": "2000–01 in English football", "response": ["* 10 November 2000: Bob Matthewson, 70, played three league games for Bolton Wanderers in the early postwar years before moving into refereeing. He refereed many top matches, including the 1974 FA Charity Shield (in which he sent off Kevin Keegan and Billy Bremner for fighting) and the 1977 FA Cup Final."]}, {"page": "FA Cup Final referees", "response": ["|1977||Bob Matthewson"]}, {"page": "Steve Baines", "response": ["Baines remained in Chesterfield and worked in insurance. In a rare move for an ex-player he soon took up refereeing. He made good progress, reaching the Panel Leagues and becoming a Football League assistant in 1994. After just one year he was promoted to the Referees List. Only one other referee had ever been promoted that quickly – former Scottish League referee Joe Timmons, in 1987. Only two other referees – Bob Matthewson and John Lloyd – had previous professional playing experience but the pair only made five League appearances between them."]}, {"page": "Eric Jennings", "response": ["The following season (1969–70) was his last before retirement, and he was awarded the FA Cup Final between Chelsea and Leeds at Wembley on 11 April 1970 as the climax to his long and successful career. This game ended in a draw,Match details, FA Cup Final 1970: soccerbase.com website. and Jennings also refereed the  replay at Old Trafford. It was to be another seven years until the Final was given to a referee in his retirement season, when Bob Matthewson handled the Manchester United versus Liverpool game."]}, {"page": "John Lloyd (referee)", "response": ["John Lloyd (born 15 February 1948) is a Welsh former football player and referee. As a referee he worked in The Football League and Premier League and was a member of the Welsh FIFA List. He is one of only three referees (alongside Steve Baines and Bob Matthewson) who have made League appearances as a player."]}, {"page": "The Damned United", "response": ["*Peter Quinn as Bob Matthewson"]}, {"page": "1974 FA Charity Shield", "response": ["The match is mostly remembered for Billy Bremner and Kevin Keegan being jointly dismissed from the field by referee Bob Matthewson in the 60th minute after they had a fight. Keegan, who claimed provocation, was furious about being sent off, and threw his shirt away. Bremner copied him, and the two players were afterward charged with bringing football into disrepute. The FA Disciplinary Committee imposed tough punishments but were themselves heavily criticised by people in football who doubted their competence.", "Phil Boersma opened the scoring for Liverpool in the 20th minute when he was first to reach the loose ball that had been blocked by David Harvey from a shot by Keegan. Later in the first half, a shot by Emlyn Hughes from outside the penalty area hit the Leeds crossbar. The match was notorious for the fistfight between Bremner and Keegan, who were jointly dismissed by referee Bob Matthewson after sixty minutes' play. Keegan, who was angry with the decision because he claimed provocation, took off his shirt as he left the field and threw it away. Bremner, several yards behind him, then did the same. Trevor Cherry headed home the Leeds equaliser in the 70th minute and the match finished 1–1."]}, {"page": "Matthewson", "response": ["*Bob Matthewson (died 2000), English footballer and referee"]}, {"page": "Robert Matthewson", "response": ["#redirect Bob Matthewson"]}, {"page": "Deaths in November 2000", "response": ["*Bob Matthewson, 70, English footballer and referee."]}]}}