{"wiki_id": "http://www.wikidata.org/entity/Q974523", "itemLabel": "Steve Peat", "itemDescription": "professional downhill mountain biker", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Peat", "wikipedia_page": {"main": "Steve Peat (born 17 June 1974 in Chapeltown, South Yorkshire), nicknamed \"Sheffield Steel\" or more commonly just \"Peaty\", is a professional downhill mountain biker who was born and lives in Chapeltown, Sheffield, England. Prior to his career as a professional mountain biker Peat was employed as a plumber by James Lamb. He is married to Adele Croxon and has two sons, Jake and George Peat.\nPeat began his career with little success riding for the Saracen team alongside Rob Warner, before moving in the mid 1990s to Team MBUK. He rode for GT Bicycles in the late 1990s and for the Orange team between 2002 and 2005, winning the Fort William downhill world cup round in 2005.  He then joined the Santa Cruz Syndicate team for the 2006 season, which saw him finish 1st overall. He continues to race for Santa Cruz Syndicate.\nAs last man down the hill, Peat won the La Bresse downhill world cup round 2 on 10 May 2009 with a time of 02:07.14 knocking Sam Hill out of the hot seat for his 16th world cup round win, tying at the top of the all-time leader-board with Nicolas Vouilloz.  Just one week later on 17 May 2009, at the third round of the UCI World Cup in Vallnord, Peat won again (besting compatriot Gee Atherton by just 0.02 seconds) making him the most successful male downhill mountain bike racer ever by number of wins at the time. This record has since been beaten Peat's South African teammate, Greg Minnaar.\nOther successes include placing second in the Mountain Bike World Championships in 2000, 2001, 2002 and 2008. On 6 September 2009, Peat won the World Championships in Canberra for the first time in his career, with a winning time of 2:30.33, just 0.05 seconds ahead of his Santa Cruz team mate Greg Minnaar.  He was crowned World Cup champion in 2002, 2004 and 2006.  He has also won the Lisboa Downhill, held in Lisbon, Portugal, eight times.\nAside from his professional riding career, Peat has other involvements with the sport, including contributing to the design and manufacture of specialist riding clothing made by Royal Racing of which he is part owner. Peat also has involvements with young cyclist academies, and is a proponent of youth involvement in the sport.\nFollowing his recent world champ status he has released his own game 'Steve Peat - Downhill Mountain Biking' for the iPhone, iPad and iPod Touch.\nIn recognition of his accomplishments, Peat was added to Sheffield's 'walk of fame' outside Sheffield Town Hall in 2016. In 2020, Sheffield-based publisher Vertebrate announced they would be releasing Peat's biography in October 2021.", "link_mentions": [{"page": "Mountain Bike Hall of Fame", "response": ["*Steve Peat"]}, {"page": "Sheffield Hallam University", "response": ["* Steve Peat, World Championship winning downhill mountain biker"]}, {"page": "Kona Bicycle Company", "response": ["Kona has a long-standing tradition in the support of bicycle racing, beginning with their first product designer Joe Murray who was also a two-time US National mountain bike champion. Many elite riders have been part of the Kona Team including 2012 Giro D'Italia winner Ryder Hesjedal (CAN),Two time World Champion cross country mountain biker 2001,2002 Roland Green (Can), World Downhill Champions Steve Peat (UK) and Greg Minnaar (RSA), 2004/2005 World Downhill Champion Fabien Barel (FR), World Cup Downhill Champion Tracy Moseley (UK), and US National Mountain Bike and Cyclo-Cross champions Ryan Trebon and Anne Knapp. Over 200 National and World Champions have been won by Kona riders."]}, {"page": "Downhill mountain biking", "response": ["Portugal is the host country of a unique variety of downhill races, the Urban Downhill, known as Downtown. Lisbon DownTown is a very popular annual event which brings world class Downhill athletes to Portugal, Steve Peat is the King of the race winning 8 of the 11 editions.", "Mountainous regions of Northern Thailand offer great venues for downhill mountain biking. Chiang Mai is the most famous location for downhill mountain biking in Thailand. The Chiang Mai Downhill Challenge, which were held in November 2012 and 2013 had attracted World Cup riders, such as Steve Peat, Josh Bryceland, Sam Dale, Brook Macdonald, Wyn Masters and Edward Masters, as well as a Belgian freerider, Nico Vink. Doi Suthep mountain is where most downhill actions take place in Chiang Mai. Tour operator, such as X-Biking Chiang Mai offers guided tour or shuttle service to the trailheads and pick up the riders once they complete the trails. The Thailand National Championships, which are held in many different venues across Thailand by the Thai Cycling Association also attract many riders across Southeast Asia. The cheap living costs, great foods, warm climate and great ridings make Thailand a \"must visit\" place for riders on a budget.", "Within the UK most of the main downhill tracks are in the Scottish Uplands, Highlands, Wales and Northern England, as these are more mountainous areas. Fort William in Scotland is Britain's only World Cup standard track and was the venue for the 2007 World Championships. The UK has a strong race scene with a national series and numerous regional series with strong representation of all age groups present. The country has produced many of the world's top downhill mountain bikers including Steve Peat, Gee Atherton, Danny Hart, Josh Bryceland, Brendan Fairclough, Rachel Atherton, Manon Carpenter and Tahnee Seagrave.", "*Steve Peat"]}, {"page": "List of British cyclists", "response": ["* Steve Peat"]}, {"page": "Mountain Biking UK", "response": ["In May 2008 MBUK released their 20th anniversary issue, issue #225. It came with eight free gifts and a fold-out front cover of Steve Peat.", "The magazine along with co-sponsors such as Nike, Santa Cruz and Fox Racing operated a successful professional mountain bike team from the mid-1990s until the mid-2000s, including riders of the calibre of Steve Peat, Scott Beaumont, Rob Warner and Will Longden and competing in the UCI Mountain Bike World Cup."]}, {"page": "List of people from Sheffield", "response": ["*Steve Peat, professional cyclist; three-time UCI downhill world cup overall series champion"]}, {"page": "Steve pete", "response": ["#REDIRECT Steve Peat"]}, {"page": "2005 UCI Mountain Bike World Cup", "response": ["| 30 April 2005 ||  Vigo ||  Steve Peat ||  Sabrina Jonnier", "| 11 September 2005 ||  Fort William ||  Steve Peat ||  Tracy Mosely"]}, {"page": "UCI Mountain Bike World Cup", "response": ["|  Steve Peat", "|  Steve Peat", "|  Steve Peat", "|  Steve Peat", "|  Steve Peat", "|  Steve Peat", "|  Steve Peat", "| 4 || align=left| Steve Peat || 3 || 2 || 2 || 7", "|3||align=\"left\"| Steve Peat||17||11||11"]}, {"page": "Steve Pete", "response": ["#REDIRECT Steve Peat"]}, {"page": "Aces High (song)", "response": ["\"Aces High\" is one of Iron Maiden's most popular songs, and has been covered numerous times. It is featured in the video game Madden NFL 10, the MTV show Nitro Circus, and Steve Peat's segment in the mountain bike film New World Disorder III. Colin McKay used the song on his part of the skate video Plan B Questionable.  It can also be found in the soundtrack of the game Carmageddon II: Carpocalypse Now."]}, {"page": "2006 UCI Mountain Bike World Cup", "response": ["|4 June 2006 ||  Willingen ||  Steve Peat ||  Tracy Moseley", "| bgcolor=\"#ffffff\" | Image:Gold medal icon.svg    Steve Peat"]}, {"page": "The Collective (mountain biking)", "response": ["High-profile riders including Darren Berrecloth, Geoff Gulevich, Wade Simmons, Tyler Morland, Nathan Rennie, Ryan Leech, Steve Romaniuk, Adam Billinghurst, Sam Hill, Kenny Smith, Steve Peat, Stevie Smith, Andrew Shandro, Ryder Kasprick, Jordie Lunn, Cam McCaul, Matt Hunter, Cameron DeClerk, Thomas Vanderham, Gee Atherton, Ben Boyko, Brendan Fairclough, Kurt Sorge, Brandon Semenuk."]}, {"page": "Sheffield Legends", "response": ["|Steve Peat", "|28 October 2015\"Sheffield mountain biker Steve Peat joins 'walk of fame'\", \"BBC\", 28 October 2015"]}, {"page": "Red Bull Joyride", "response": ["|Steve Peat", "|Steve Peat", "|Steve Peat"]}, {"page": "British National Mountain Biking Championships", "response": ["| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat", "| Steve Peat"]}, {"page": "Greg Minnaar", "response": ["In 2004, Greg was offered a spot on Team G Cross Honda, which used one-off internally geared frames made by Honda, with a Showa suspension. He accepted and stayed for four years, winning his second World Cup points series overall victory in 2005. The 2007 season ended on a bittersweet note with a dislocated and fractured shoulder early in his winning World Championship final run, although Greg got back on the bike to salvage a painful 4th-place finish. In addition, Greg was forced to switch teams yet again when Honda pulled out of the sport, and he chose the Santa Cruz Syndicate team, alongside riders Steve Peat, Nathan Rennie, and Josh Bryceland for the 2008 season.", "In the 2009 World Cup series, Minnaar took first place at Pietermaritzburg South Africa, Fort William Scotland and Bromont Canada. He also came 6th at La Bresse in France, 3rd at Vallnord in Andorra, Maribor in Slovenia and in Schladming Austria. Greg also came 22nd in Mont-Sainte-Anne leaving him with a 2nd place overall. In the World Championships at Canberra Australia he lost the 1st place to his teammate Steve Peat by 0.05seconds", "In the 2015 World Cup series, Minnaar took first place at Lenzerheide, Switzerland, earning him his 18th career win and setting the record for most world cup wins in the history of downhill racing. Until this victory, Minnaar had shared the record for most overall world cup race wins with Santa Cruz Syndicate teammate Steve Peat, after a victory earlier in the 2015 seasonSee What Went Down at the Lenzerheide World Cup. http://www.redbull.com. Retrieved 7 July 2015.", "*Steve Peat, Minnaar's teammate on the Syndicate Team."]}, {"page": "List of professional mountain bikers", "response": ["* Steve Peat (Santa Cruz Syndicate)"]}, {"page": "Rob Warner (mountain biker)", "response": ["Before turning professional in 1993 Warner worked for 6 months at the Rover plant in Oxford on a production line building the Rover 800 series car. After riding for Saracen with teammate Steve Peat and then MBUK, he signed for the Giant Bicycles Downhill Team, and remained with them until the end of 2016."]}, {"page": "List of sportspeople with nicknames", "response": ["* \"Sheffield Steel\" = Steve Peat,  downhill racing rider"]}, {"page": "2001 UCI Mountain Bike World Cup", "response": ["|  Steve Peat", "|  Steve Peat"]}, {"page": "Urban Freestyler", "response": ["The Urban Freestyler Extreme cast features 14 current or former world champions, including Steve Peat, Mouse, Geoff Swain, Tom Kirkman, Steve Colley and John Farnworth."]}, {"page": "Sam Hill (cyclist)", "response": ["After placing fifth at round one in Vigo, Spain, all eyes were glued on Sam Hill in round two. The extremely steep and technical track seemed almost tailor-made for the young Australian. All seemed to be going well for Hill when he qualified in first place early on race day, besting the second place qualifier by over 14 seconds! Hill was looking confident for Finals. However, with approximately 30 riders left to set off, on arguably the most dangerous course the world cup series has seen in many years, the skies opened up. It had rained every day at this time the whole weekend, but not this hard. Riders who qualified in the top ten, were seen finishing in the late forties, early fifties. When last man to down the track, Hill, set off, no one could believe their eyes. The World Champion at the time was ripping down the track faster than top riders were riding it in the bone dry, perfect conditions. Hill's split time was faster than second place (Steve Peat, who raced in the dry), but a fall later in his run meant the Aussie ended up in a very respectable third position, just 1.63sec off first place rider Matti Lehikoinen, who also completed his final run in the dry. Hill's run will go down in history as one of the greatest runs in the wet, if not one of the greatest ever. Dan Atherton later quoted \"He showed us all that it ain't over, 'till its truly over\". Further, eventual winner Matti Lehikoinen stated after the race \"I played the tactics (referring to a 20-second pause in his practice run, ensuring a lower qualifying position to avoid any unfavourable weather changes), but Sam is the winner of the day. No questions\". Steve Peat said \"Sam is the King – give him the crown.\" Despite his remarkable and certainly unmatched talent for riding in unfavorable conditions, Sam admits that he rarely rides in the rain. In an interview with Steve Jones of Dirt Magazine featured in the film 'Earthed 5: The Law of Fives', when asked if it rained that hard in Australia and if he was used to riding in such conditions Sam replied \"I don't even see a raindrop when I'm in Australia\". Jones then asked \"So you never ride in the rain?\" Hill's reply was simply, \"My bike gets muddy\".", "Sam Hill came into this race the reigning world champion. With four riders left on the hill Sam Hill started his final run. At the split he was five seconds up and no one could believe how fast he was going, even the commentator, Rob Warner, a former world level racer. Rob Warner yelled \"Look how fast he's going!\", \"It looks like the film has been speeded up!\". Sam was estimated 10 seconds up when he hit the final left hand turn at the bottom of the track. He pulled one of his classic drift turns around the corner but as he straightened up on exit his bike suddenly washed out from under him. He got straight back on his bike but it had cost him his lead and he finished 0.5 of a second behind eventual second place Steve Peat.2008 World Championships, 3rd Place, Sam Hill"]}, {"page": "Ecclesfield School", "response": ["* Steve Peat, mountain biker"]}, {"page": "Josh Bryceland", "response": ["He entered his first race at 10 .  Andy Kyffin signed him to his Northwest Mountain Bike Centre team.  He won regional and national junior titles. One of his father's friends, Steve Peat signed him to his Royal Racing team.  Bryceland was Junior World Cup Series Champion in 2007 and finished 9th in the Elite Men's race of the Maribor World Cup round. After 2016 he left the Santa Cruz Syndicate team to pursue Enduro racing. Josh has since left the team and is now riding as a Freerider and brand ambassador for Cannondale Cycles."]}, {"page": "Santa Cruz Syndicate", "response": ["The Santa Cruz Syndicate  (), is a professional mountain bike racing team sponsored by Santa Cruz Bikes, competing in the World Cup and World Championships, as well as national level events, in the downhill category. The Syndicate was founded in 2006, and its early roster included Steve Peat, Nathan Rennie, Jamie Goldman, and John Waddell. From 2008 through 2016, the team roster consisted of Steve Peat, Greg Minnaar, and Josh Bryceland. After the 2016 season, Peat retired and Bryceland left the downhill circuit, leaving Minnaar as the senior member of the team. Young riders Luca Shaw and Loris Vergier joined starting with the 2017 season.", "In the Syndicate's inaugural year, Steve Peat delivered, winning the UCI Mountain Bike World Cup.", "2009 was Steve Peat's year, as he won the UCI World Championships, after finishing 2nd four times before. Greg Minaar finished in second place, which made the Syndicate the best-ranked UCI Downhill team, seconded by Madcatz Factory Team.", ":1st  DH, UCI Mountain Bike World Cup, Round 3, Willingen, Germany - Steve Peat", ":1st  DH, UCI Mountain Bike World Cup, Series Overall - Steve Peat", ": 1st  DH, British National Mountain Biking Championships - Steve Peat", ": 2nd DH, UCI Mountain Bike World Cup, Round 1, Maribor, Slovenia - Steve Peat", ": 3rd DH, UCI Mountain Bike World Cup, Round 3, FortWilliam, Scotland -  Steve Peat", ": 3rd DH, UCI Mountain Bike World Cup, Round 5, Bromont, Canada -  Steve Peat", ": 3rd DH, UCI Mountain Bike World Cup, Round 2, Pietermaritzburg, South Africa - Steve Peat", ": 1st  DH, UCI Mountain Bike World Cup, Round 2, La Bresse, France -  Steve Peat", ": 1st  DH, UCI Mountain Bike World Cup, Round 3, Vallnord, Andorra -  Steve Peat"]}, {"page": "September 2009 in sports", "response": ["**Downhill men:  Steve Peat  2:30.33  Greg Minnaar  + 0.05  Michael Hannah  + 0.69"]}, {"page": "Jared Rando", "response": ["Jared Rando (born 1981) is an Australian downhill mountain biker, signed to Giant Bicycles. Rando has competed at every UCI Mountain Bike & Trials World Championships from 1999 to 2009, participating in both downhill and fourcross events. At the 2009 championships, he finished 16th, 6 seconds behind winner Steve Peat.http://oldsite.uci.ch/UciDoc/MTB/2009/CM/DH_RES_ME.pdf Previous highlights include 1st at the 2006 Australian mountain bike championships, and 1st in the 2001 Oceania mountain bike championships."]}, {"page": "UCI Mountain Bike & Trials World Championships – Men's downhill", "response": ["| 8 || align=left| Steve Peat || 1 || 4 || - || 5"]}, {"page": "2011 UCI Mountain Bike World Cup", "response": ["| bgcolor=\"#ffffff\" | File:Silver medal icon.svg  Steve Peat"]}, {"page": "1999 UCI Mountain Bike World Cup", "response": ["| 2 ||align=left| Steve Peat ||align=left|  || 17.06.1974 || 25 || TEAM GT  || 1276 || 250 || 200 || 170 || 200 || 95 || 250 || 52 || 59"]}, {"page": "2010 UCI Mountain Bike & Trials World Championships – Men's downhill", "response": ["| 7 || 1 ||align=left| Steve Peat ||align=left|  || 17.06.1974 || 36 || 64.488 || (1) || 3:14.15 || (10) || 4:06.18 || (7) || 4:45.54 || 7.61"]}]}}