{"wiki_id": "http://www.wikidata.org/entity/Q975556", "itemLabel": "Laya Lewis", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Laya_Lewis", "wikipedia_page": {"main": "Laya Lewis (born 14 May 1992) is an English actress, best known for her role as Liv Malone in the fifth and sixth series of the hit British TV drama Skins.", "link_mentions": [{"page": "Skins (British TV series)", "response": ["Mini McGuinness (Freya Mavor), Liv Malone (Laya Lewis), and Grace Blood (Jessica Sula) have been best friends since childhood. By the time Franky arrives, image-conscious Mini has already established herself as Roundview's new \"queen bee\". She obscures her own insecurities (such as her body image, and her virginity), and is cruel to Franky and others. Of her two friends, Liv is the more devoted to Mini, and is more worldly and sexually voracious."]}, {"page": "List of Skins characters", "response": ["| Laya Lewis", "| Olivia \"Liv\" Malone || Laya Lewis || 5–6 || 5.04, 5.08, 6.01, 6.08, 6.10"]}, {"page": "Cotham School", "response": ["* Laya Lewis, actress"]}, {"page": "1992 in British television", "response": ["* 14 May – Laya Lewis, actress"]}, {"page": "Fairfield High School, Bristol", "response": ["*Laya Lewis, actress"]}, {"page": "Franky (Skins series 5)", "response": ["The episode opens with Franky Fitzgerald, a timid androgynous teenager who has recently moved to Bristol from Oxford, along with her adoptive fathers, Geoff and Jeff, preparing for school. On her way to school she becomes involved in an accident with a motorized scooter. This is witnessed by Mini (Freya Mavor), an attractive but arrogant and fashion-oriented girl with two best friends, Liv (Laya Lewis) and Grace (Jessica Sula). During sports, Franky accidentally trips Mini, causing her to fall into a patch of mud. Enraged, Mini drags Franky down with her, and their fight is eventually broken up. Later at lunch, Franky is approached by two other outcasts in the school, farmer's son Alo (Will Merrick), and metalhead Rich (Alexander Arnold) who have seen her, and hope to make friends. They are, however, chased off by Mini and her two friends, who hope to make a new start. They invite her to hang out. Franky coldly refuses, and locks herself in the bathroom missing her English class. However, they find Franky in town later, and she decides she has changed her mind."]}, {"page": "Franky Fitzgerald", "response": ["In \"Franky\" introduces Franky (Dakota Blue Richards) as a timid, isolated androgynous youth. She arrives in Bristol after moving from Oxford, and is told by her fathers to try to blend in. It soon emerges that this is not an easy task, as Franky arrives at Roundview College on a motorised scooter after being chased by a gang of youths. Things do not get much better, when she is made to wear some dirty, second-hand clothes to a sports lesson. Mini McGuinness (Freya Mavor), the queen bee of the school, immediately takes issue with Franky's androgynous dress sense, due to her obsession with fashion. The two then get into a fight on the sports field. At lunch, she is approached by Alo Creevey (Will Merrick) and Rich Hardbeck (Alex Arnold), two fellow outcasts, who hope to make friends. The two are chased off by Mini and her friends, Liv Malone (Laya Lewis) and Grace Blood (Jessica Sula), and is invited to hang out later. Though she refuses at first, she eventually agrees. The three take some Miaow-Miaow and have fun at the local shopping centre. They return home to meet Franky's two dads, Geoff and Jeff (Gareth Farr and John Sessions). There, they discover via some pictures on \"Friendlook\" that Franky was victimised mercilessly in Oxford. The very next day, after Frank with Mini and calls her a \"bulimic Barbie,\" Mini has her boyfriend, Nick Levan (Sean Teale), post the pictures she found on the walls of the school, causing Franky to run off, crying. She goes to a rubbish dump to smoke a joint and take out her frustration by shooting an old fridge. There, she is approached by Matty (Sebastian De Souza), Nick's older brother, who tells her she is beautiful. She then discovers Grace, who had taken an interest in her from the beginning, in her room. Empowered by these two encounters, she confronts Mini at a party, and appeals to Grace and Liv that they truly like her. When they do not verbally respond, she leaves in frustration. Grace in turn persuades Alo and Rich to go after Franky, and the three abduct her and take her to a swimming pool. There, they unite as a gang of their own."]}, {"page": "Liv Malone", "response": ["Olivia \"Liv\" Malone is a fictional character from the third generation of the British teen drama Skins, portrayed by Laya Lewis."]}, {"page": "Liv (Skins series 5)", "response": ["Liv is the fourth episode of fifth series of the British teen drama Skins, which first aired on 17 February 2011 on E4. It focuses on the character Olivia \"Liv\" Malone (Laya Lewis), and features Liv as she attempts to deal with her feelings for her friend, Mini's (Freya Mavor) boyfriend, Nick Levan (Sean Teale), and Mini's increasingly hostile treatment of her, only to find herself hanging out with Nick's brother, Matty (Sebastian De Souza)."]}, {"page": "Skins (series 5)", "response": ["|Laya Lewis || Liv Malone || All"]}, {"page": "Skins (series 6)", "response": ["|Laya Lewis || Liv Malone || All"]}, {"page": "My Kind of Love (song)", "response": ["A music video to accompany the release of \"My Kind of Love\" was first released onto YouTube on 20 April 2012 at a total length of three minutes and forty-seven seconds. The video was directed by British music video director Dawn Shadforth. Former Skins star Laya Lewis features in the clip alongside Sandé. In the video, Sandé enters a hospital to visit a childhood friend who appears to be suffering severely with cancer and is close to death. When she finds her friend, who appears to be extremely depressed, she gives her a pink wig to wear as the cancer has taken her hair. After helping her to get dressed Sandé takes her from the hospital, unbeknownst to the doctors, to take her to the seafront amusements in Hastings to make the last of her days the best she's ever had. Sandé also takes her to a park, intercut with scenes of them there when they were young. The video ends with Sandé and her friend sitting on a hill above the seaside town and her sitting a hospital corridor, seemingly having taken her friend back. An alternative interpretation is that Sandé and the woman being hospitalized are in a same-gender relationship, as hinted by the photograph taken of both of them as adults, as opposed to children. Sandé goes to a hospital to comfort her partner with a pink wig, a car ride, and then a merry-go-round ride."]}]}}