{"wiki_id": "http://www.wikidata.org/entity/Q975055", "itemLabel": "Martin Grech", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Grech", "wikipedia_page": {"main": "Martin Grech (born 14 November 1982) is an English singer, songwriter and musician from Aylesbury, Buckinghamshire.", "link_mentions": [{"page": "Buckinghamshire", "response": ["* Martin Grech, musician, is from Aylesbury"]}, {"page": "Aylesbury", "response": ["* Martin Grech, singer-songwriter"]}, {"page": "List of Maltese people", "response": ["* Martin Grech (born 1983) singer-songwriter"]}, {"page": "Howard Jones (British musician)", "response": ["The track \"If You Love\" was featured on the soundtrack to the TV series Party of Five. Jones continued to produce and write for a number of artists during the mid to late 1990s, including Martin Grech, DBA, and Sandie Shaw."]}, {"page": "Rupert Hine", "response": ["*Martin Grech – Unholy (album) (2005)"]}, {"page": "V Festival", "response": ["* NME Stage: Feeder, Underworld, Turin Brakes, The Coral, Killing Joke, Tim Burgess, Athlete, Evan Dando, Damien Rice, The Distillers, The Bees Shack, The Basement, Spearhead, Martin Grech, Haven, Futureheads, The Stands, Rachel Mari Kimber, The Zutons"]}, {"page": "Yourcodenameis:milo", "response": ["On 6 November 2006, the band released its first side project album, entitled Print Is Dead Vol 1. The album has Youcodenameis:Milo collaborating with other bands, including Tom Vek, Get Cape. Wear Cape. Fly, The Futureheads, Field Music, Reuben, The Automatic, Martin Grech, Hot Club De Paris, Maxïmo Park, Lethal Bizzle and Bloc Party. Print Is Dead was recorded between sessions for Yourcodenameis:milo's second album and during their trip to play shows in New Delhi, India. The album was written, recorded and mixed at the band's own studio under the arches of Byker Bridge and affectionately named Like A Cat, Like A Fox, after the original title for their first album."]}, {"page": "Stephen Kasner", "response": ["He did album artwork for Khlyst, Sunn O))), Integrity, Lotus Eaters, Skullflower, Justin Broadrick, Subarachnoid Space and Martin Grech,  among many others. "]}, {"page": "Grech", "response": ["* Martin Grech (born 1982), English musician"]}, {"page": "Unholy (Martin Grech album)", "response": ["Unholy is a 2005 album by British musician Martin Grech.", "Category:Martin Grech albums"]}, {"page": "Open Heart Zoo", "response": ["Open Heart Zoo is a 2002 album by British alternative rock musician Martin Grech. The title track came to the attention of the public when it was used by Lexus in a commercial. The single was released on 30 September 2002.", "Category:Martin Grech albums"]}, {"page": "Jack Hayter", "response": ["Save for a number of remixes and compilation appearances, Jack's output was sparse following the release of the album, though he would play pedal steel and other instruments on a large number of records from musicians as diverse as Tram, Mark Mulcahy and The Wildhearts. He would also be seen opening for artists like KT Tunstall, Martin Grech, Darren Hayman & The Secondary Modern, Wreckless Eric, Amy Rigby and fellow Absolutely Kosher alumni The Mountain Goats."]}, {"page": "List of dark ambient artists", "response": ["*Martin Grech"]}, {"page": "A State of Trance 2005", "response": ["# Adam White featuring Martin Grech – \"Ballerina\""]}, {"page": "Print Is Dead Vol 1", "response": ["#\"We Hope You Are What You Think You Are\" (featuring Martin Grech) – 5:09"]}, {"page": "March of the Lonely", "response": ["March Of The Lonely is the third studio album by British musician Martin Grech, released on 4 June 2007.", "Category:Martin Grech albums"]}, {"page": "Jinder (musician)", "response": ["In 2004, Jinder amicably parted company with Cull and entered the studio to begin recording his debut solo album Willow Park. During this time, Jinder also toured in support of Martin Grech, recording and releasing Road:Live EP, a five-track EP culled from various tapings of shows made during the tour. After nine months of recording, Willow Park, Jinder's first solo album, was released on Folkwit Records in June 2005, drawing critical comparisons with The Blue Nile, Townes Van Zandt and Ryan Adams. The album posted excellent reviews and sales figures considerably higher than expected for a release on a small independent label. 2005 also saw Jinder touring throughout the UK, making 23 festival appearances in the course of over 200 live dates played in support of the album."]}, {"page": "Sweet Billy Pilgrim", "response": ["Besides their work as Sweet Billy Pilgrim, Bishop, Hamer, and Elsenburg have worked together as session musicians, having toured as members of Martin Grech's band during the Open Heart Zoo era, and playing on the Toyah Willcox album Velvet Lined Shell. Carpenter writes for, sings, and performs with folk band Piefinger."]}, {"page": "Phoria", "response": ["Phoria draw on a range of musical genres to create their sound.  In the days of Yourself Still, chordal guitar figures and often dense instrumentation drew comparisons to such bands as Radiohead, Sigur Rós, and Mew.  The music blog therecommender.net, when reviewing preview material from the bands then forthcoming Bloodworks EP, wrote 'This...isn't just reminiscent of Radiohead, this is reminiscent of Radiohead at their best.' Martin Grech, Cinematic Orchestra, and Elbow are also major influences. The band have more recently been compared favourably to Aphex Twin, Autechre, and James Blake."]}, {"page": "Peter Miles (record producer)", "response": ["Miles's musical background began touring with and in bands for several years in his teens notably playing with Martin Grech. During this time he discovered a talent for production and song arrangement, he began recording some of his favourite punk bands wherever possible (studios ranging from bedrooms to rehearsal rooms and the occasional pro studio too)."]}, {"page": "T in the Park 2003", "response": ["*Martin Grech"]}, {"page": "Polaris (Tesseract album)", "response": ["* Martin Grech - additional vocals (track 2)"]}, {"page": "Barry Wickens", "response": ["Outside of Cockney Rebel and Immaculate Fools, Wickens has been involved in recording sessions for a number of artists, including John Martyn, Lick the Tins, Howard Jones, The River Detectives, Thrashing Doves, Martin Grech, along with TV and radio recordings of the Americana musicians The Milroys, and Folk Alliance Award nominee Diana Jones. He has also performed with Nick Pynn at a number of live events.", "*Martin Grech - March of the Lonely (2007)"]}, {"page": "Gunship (band)", "response": ["* Martin Grech"]}, {"page": "Grech, Martin", "response": ["#redirectMartin Grech"]}]}}