{"wiki_id": "http://www.wikidata.org/entity/Q976096", "itemLabel": "Tony Daley", "itemDescription": "English footballer (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Daley", "wikipedia_page": {"main": "Anthony Mark Daley (born 18 October 1967) is an English former footballer, who made the vast majority of his appearances for Aston Villa, playing mainly as a winger, well known for his pace.", "link_mentions": [{"page": "GamesMaster", "response": ["*Episode 23 – Tony Daley – 4 March 1993 "]}, {"page": "Graham Taylor", "response": ["England needed to beat hosts Sweden to advance to the semi-finals. Lineker crossed for Platt to open the scoring on four minutes with a miskicked volley. However, England wasted several chanced to extend their lead. Platt made a pass to Tony Daley who wasted a chance to pass to Lineker in the open. England held a slender 1–0 lead at half-time.Granville, Brian England's Managers: The Toughest Job in Football 2007,  p. 177. After half-time, the Swedes changed their personnel and formation, and dominated the second half, scoring twice to win 2–1. England were eliminated.", "Taylor spent heavily on players while at Wolves, paying large sums for the likes of Steve Froggatt, Tony Daley, Mark Atkins, John de Wolf, Dean Richards and Don Goodman."]}, {"page": "David Platt (footballer)", "response": ["At Euro 1992 tournament, England were drawn in UEFA Euro 1992 Group 1 with Sweden, France and Denmark. In the opening game Platt missed several chances to win the game for England. After only 12 minutes, Peter Schmeichel saved a shot at point-blank range, with which Platt was unable to connect properly.Granville, Brian England's Managers: The Toughest Job in Football 2007,  p. 176. The game ended 0–0. In the match against France, Platt nearly scored with a diving header that went inches wide of the post. The game ended 0–0. England needed to beat hosts Sweden to advance to the semi-finals. Lineker crossed for Platt to open the scoring on four minutes with a miskicked volley. However, England wasted several chances to extend their lead. Platt passed to Tony Daley, who wasted a chance to pass to Lineker in the open. England held a slender 1–0 lead at half-time.Granville, Brian England's Managers: The Toughest Job in Football 2007,  p. 177. After half-time, the Swedes changed their personnel and formation and dominated the second half, scoring twice to win 2–1. England were eliminated."]}, {"page": "Daley", "response": ["* Tony Daley (born 1967), English footballer"]}, {"page": "Respect (TV series)", "response": ["Subjects in the series were Lennox Lewis (Boxing), Judy Simpson (Athletics), Martin Offiah (Rugby league), Diana Bowles (Disabled Tennis), Tony Daley (Football), Gladstone Small (Cricket) and John Regis (Athletics). The narration was provided by sports presenter Garth Crooks."]}, {"page": "1994 Football League Cup Final", "response": ["Aston Villa had finished runners-up to Manchester United in the league the previous season, but were in poor form going into the League Cup final, having lost their last three games. The bookmakers and national press were predicting that the Villa would be beaten comfortably at Wembley. Manchester United had suffered a slight blip of their own with a couple of draws in their previous league matches and high-profile red cards to Eric Cantona and Peter Schmeichel – but victory in the League Cup was predicted to be the first part of a domestic treble. Alex Ferguson decided to field a full-strength team with the exception of the suspended Schmeichel, who was deputised by former Villa keeper Les Sealey. Villa boss Ron Atkinson decided to field a five-man midfield with Tony Daley and Dalian Atkinson on the flanks and young attacking midfielder Graham Fenton playing in a withdrawn role behind striker Dean Saunders.", "|LM ||11|| Tony Daley"]}, {"page": "UEFA Euro 1992 Group 1", "response": ["|MF ||18||Tony Daley ||  || ", "|RM ||18||Tony Daley || "]}, {"page": "Anthony Daly", "response": ["*Tony Daley (born 1967), English footballer"]}, {"page": "2009–10 Wolverhampton Wanderers F.C. season", "response": ["|Tony Daley"]}, {"page": "2008–09 Wolverhampton Wanderers F.C. season", "response": ["|Tony Daley"]}, {"page": "2010–11 Wolverhampton Wanderers F.C. season", "response": ["|Tony Daley"]}, {"page": "1999–2000 Watford F.C. season", "response": ["|Tony Daley"]}]}}