{"wiki_id": "http://www.wikidata.org/entity/Q977072", "itemLabel": "William Francis Ainsworth", "itemDescription": "English surgeon, traveller, geographer and geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Francis_Ainsworth", "wikipedia_page": {"main": "William Francis Ainsworth  (9 November 1807 – 27 November 1896) was an English surgeon, traveller, geographer and geologist, known also as a writer and editor.", "link_mentions": [{"page": "Nimrud", "response": ["The site of Nimrud was visited by William Francis Ainsworth in 1837. Ainsworth, like Rich, identified the site with Larissa (Λάρισσα) of Xenophon's Anabasis, concluding that Nimrud was the Biblical Resen on the basis of Bochart's identification of Larissa with Resen on etymological grounds.William Francis Ainsworth, who preferred the identification of Resen with Nimrud (on the basis of Bochart's identification of Resen with Xenophon's Larissa), summarised the debate in 1855 as follows: \"The learned Bochart first advanced the supposition that this Assyrian city was the same as the primeval city, called Resen in the Bible and that the Greeks having asked its name were answered, Al Resen, the article being prefixed, and from whence they made Larissa, in an easy transposition. I adopted this presumed identity as extremely probable, and Colonel Chesney (ii. 223) has done the same, not as an established fact, but as a presumed identity. ... In 1846, Colonel Rawlinson, speaking of Nimrud, noticed it as probably the Rehoboth of Scripture, but he added in a note, 'I have no reason for identifying it with Rehoboth, beyond its evident antiquity, and the attribution of Resen and Calah to other sites.' (Journal of Roy. Asiat. Soc. vol. x. p. 26.) At this time Colonel Rawlinson identified Calah with Holwan or Sir Pul-i-Zohab, and Resen, or Dasen, with Yasin Teppeh in the plain of Sharizur in Kurdistan. In 1849 (Journ. of Roy. Asiat. Soc. vol. xi. p. 10), Colonel Rawlinson said, 'The Arabic geographers always give the title of Athur to the great ruined capital near the mouth of the Upper Zab. The ruins are now usually known by the name of Nimrud. It would seem highly probable that they represent the Calah of Genesis, for the Samaritan Pentateuch names this city Lachisa, which is evidently the same title as the Λάρισσα of Xenophon, the Persian r being very usually replaced both in Median and Babylonian by a guttural.' In 1850 (Journ. of Roy. Asiat. Soc. vol. xii.). Colonel Rawlinson added the discovery of a cuneiform inscription bearing the title Levekh, which he reads Halukh. 'Nimrud', says the distinguished palaeographist, 'the great treasure-house which has furnished us with all the most remarkable specimens of Assyrian sculpture, although very probably forming one of that group of cities, which in the time of the prophet Jonas, were known by the common name of Nineveh, has no claim, itself, I think, to that particular appellation. The title by which it is designated on the bricks and slabs that form its buildings, I read doubtfully as Levekh, and I suspect this to be the original form of the name which appears as Calah in Genesis, and Halah in Kings and Chronicles, and which indeed, as the capital of Calachene, must needs have occupied some site in the Immediate vicinity.' Lastly, in 1853 (Journ. of Roy. Asiat. Soc. vol. xv. p. vi. et seq.), Colonel Rawlinson describes the remarkable cylinder before alluded to as found at Kilah Shirgat, which establishes that site to have been the most ancient capital of the Assyrian empire, and to have been called Assur as well as Nimrud and Nineveh Proper. This Assur, we have seen, he identifies with the Tel Assur of the Targums, which is used for the Mosaic Resen; and instead, therefore, of Resen being between Nineveh and Calah, It should be Calah, which was between Nineveh and Resen. But, notwithstanding such very high authority, the conclusion thus arrived at does not appear to be perfectly satisfactory.\""]}, {"page": "Zakho", "response": ["According to an oral tradition transmitted by a Jewish informant from Zakho, Me'allim Levi, Zakho was established in 1568 by Slivani tribesmen, whose territory was stretched south of the location of the town. The family of Shamdin Agha came originally from the Slivani tribe, settled in Zakho, and became the most prominent family in Zakho. From the late 19th century onwards, the family of Shamdin Agha ruled “all the Muslims, Jews and Christians of Zakho and its surroundings.”Mordcechai Zaken, Jewish Subjects and their Tribal Vhieftains in Kurdistan, 2007: 33-35. Zakho was known to the ancient Greeks. In 1844, the traveller William Francis Ainsworth commented: \"The appearance of Zakho in the present day coincides in a remarkable manner with what it was described to be in the time of Xenophon.\""]}, {"page": "William Ainsworth", "response": ["*William Francis Ainsworth (1807–1896), English surgeon, traveller, geographer and geologist"]}, {"page": "Francis Rawdon Chesney", "response": ["The expedition arrived in Malta on 12 March 1835 on the Georges Canning and left on 21 March 1835 in order to transport all the materials and construct both iron steamers in the Bay of Antioch.Guest, 1992, p. 49    It took a little over a year to render the steamers into floating shape so \"as to put the expedition in motion\".Chesney, 1868, p. 352. The 16 March 1836, Chesney's forty-seventh birthday, was picked as the date of the first trial voyage for the Euphrates.Guest, 1992, p. 76 After the habitual morning service, the king's commission was recited, listing the purpose of the expedition and praising \"his dear and powerful ally\", the Sultan. Indeed, good relations with the Arabs were essential for a successful descent of the Euphrates. They were also crucial to the preservation of a fixed service along the river that might make Russia hesitate before invading Iraq.Guest, 1992, p. 62 As the Euphrates commenced her voyage, William Francis Ainsworth, the appointed surgeon and geologist of the expedition, mused that \"the scream of the startled pelican or the gurgle of some large siluroid wallowing in the waters, was no longer necessary to break the silent ripple\". At their first point of anchorage in Beles, they undertook trials of the two vessels under controlled conditions with and against the current. The Tigris trials were disappointing but the Euphrates ones were very satisfactory.Guest, 1992, p. 81    The expedition's progress was overall leisurely and stops were made in several cities along the way for wood, fuel as well as historical research. On Saturday 21 May the expedition left the town of Saliggye and Chesney remembered later that the weather that morning was \"very fine and promising\". But a few minutes later, black clouds in the sky presaged an approaching storm. Indeed, the vessels were caught by a terrible hurricane. In his personal narrative of the events, Ainsworth recorded that \"a warm dry wind, laden with the fragrance of the aromatic plants of the wilderness, followed in a few instants by a tremendous blast of wind, with some rain in large drops\". After twelve minutes, the storm abated and the Tigris was nowhere to be seen. The following three days were spent in vain searching for more survivors and trying to locate the sunken vessel.Guest, 1992, p. 82. By that time, Chesney had to disclose to his crew that he had been given orders to break up the expedition by the end of July.Chesney, 1868, p. 248. However, he trusted that the wreck of the Tigris had changed their circumstances, and believed that the government would not stand to lose their prestigious reputation by cancelling a major British project after one steamer had been inadvertently lost.Chesney, 1868, p. 260. Therefore, the party collectively chose to continue the descent of the river aboard Euphrates and reduce expenses by sending the survivors of the wreck back home.Guest, 1992, p. 91 Euphrates then anchored at the small city of Ana, where they repaired and refuelled the steamer as well as wrote reports regarding the previous unfortunate events.Chesney, 1868, p. 261. Numerous episodes of \"comic melodrama\"Guest, 1992, p. 97 then unfurled during their ensuing descent of the river. For instance, on 31 May 1836, the day Euphrates left Ana, Chesney left Ainsworth on the bank of the river during a momentary loss of memory. Ainsworth finally made his way to the vessel after having walked more than fifty miles for over two days.Ainsworth, 1888, p. 430. Another episode unfolded when Euphrates arrived at New Lemlum on 13 June 1836 and the steamer was compelled to secure itself close to town. Soon after, the ship was encircled by half-naked native of the Khezail tribe. Ainsworth recorded that \"the unusual sinewy length and thinness of their limbs, a peculiarity of development which, as seen on a smaller scale in the shrimp girls of Boulogne, we could not but attribute to their living in a marsh\".Ainsworth, 1888, vol. 2, p. 42", "*William Francis Ainsworth; participated in and wrote about the Euphrates expedition"]}, {"page": "Batnaya", "response": ["The village was populated by Assyrians, all of whom were adherents of the Church of the East until a number of people adopted Chaldean Catholicism at some point in the early 18th century before 1729. The village and its church was plundered by the forces of Shahanshah Nader Shah in 1743 amidst the Ottoman–Persian War of 1743–1746 and the church was restored in the following year. By 1767, the village's entire population of 200 families had joined the Chaldean Catholic Church. When visited by the English missionary George Percy Badger in 1852, 60 families resided at Batnaya and William Francis Ainsworth counted 50 houses in the village in 1857. The church of Mart Maryam (, \"all pure\") was constructed in 1866. The population grew to 900 people by 1867 and then to 1000 people in 1891."]}, {"page": "Ainsworth (surname)", "response": ["* William Francis Ainsworth (1807–1896), English traveller and geographer, cousin to William Harrison"]}, {"page": "The New Monthly Magazine", "response": ["In 1845 Colburn sold the magazine for £2500 to William Harrison Ainsworth, who had earlier edited Bentley's Miscellany and who now edited his own Ainsworth's Magazine. Ainsworth edited the New Monthly with his cousin William Francis Ainsworth as sub-editor. From 1871–79 William Francis Ainsworth was editor.", "*1871 William Francis Ainsworth"]}, {"page": "Ezra's Tomb", "response": ["The tombs of ancient prophets were believed by medieval people to produce a heavenly light; it was reputed that on certain nights an \"illumination\" would go up from the tomb of Ezra. In his Concise Pamphlet Concerning Noble Pilgrimage Sites, Yasin al-Biqai (d. 1095) wrote that the “light descends” onto the tomb. Jewish merchants partaking in mercantile activities in India from the 11th-13th century often paid reverence to him by visiting his tomb on their way back to places like Egypt. The noted Jewish traveler Benjamin of Tudela (d. 1173) visited the tomb and recorded the types of observances that both Jews and Muslims of his time afforded it. A fellow Jewish traveler named Yehuda Alharizi (d. 1225) was told a story during his visit () about how a shepherd had learned of its place in a dream 160 years prior. Alharizi, after stating that he initially considered the accounts of lights rising from the tomb \"fictitious\", claimed that on his visit he saw a light in the sky \"clear like the sun [...] illuminating the darkness, skipping to the right and left [...] visibly arising, moving from the west to the east on the face of heaven, as far as the grave of Ezra\".Alharizi, transl. in Benisch, A. Travels of Rabbi Petachia of Ratisbon, London: Trubner & C., 1856 pp. 92-93 He also commented the light that shown on the tomb was the “glory of God.” Rabbi Petachiah of Ratisbon gave a similar account to Alharizi of the tomb's discovery.Petachia of Ratisbon, Rabbi. Travels of Rabbi Petachia of Ratisbon, who in the latter end of the 12. century, visited Poland, Russia, Little Tartary, the Crimea, Armenia ...: translated ... by A. Benisch, with explanat. notes by the translat. and William Francis Ainsworth. London: Trubner & C., 1856, pp. 91 n. 56"]}, {"page": "List of fellows of the Society of Antiquaries of London", "response": ["*William Francis Ainsworth (1807–1896), elected 1853"]}, {"page": "William Burckhardt Barker", "response": ["He accumulated materials for his major work Lares and Penates (1853), which was edited by William Francis Ainsworth.'Lares and Penates: or, Cilicia and its Governors; being a short Historical Account of that Province from the earliest times to the present day; together with a description of some Household Gods of the ancient Cilicians, broken up by them on their Conversion to Christianity, first discovered and brought to this country by the author,’ London, 1853. Before this Barker had produced a polyglot volume entitled 'Exhibition of the Works of Industry of all Nations. The Speech of His Royal Highness Prince Albert translated into the principal European and Oriental Languages,’ London, 1851. Other works were:"]}, {"page": "W. F. Ainsworth", "response": ["#REDIRECT William Francis Ainsworth"]}, {"page": "W.F. Ainsworth", "response": ["#redirect William Francis Ainsworth"]}, {"page": "Timeline of Zakho", "response": ["* 1844 – English traveler William Francis Ainsworth visits Zakho"]}, {"page": "William F. Ainsworth", "response": ["#REDIRECT William Francis Ainsworth"]}]}}