{"wiki_id": "http://www.wikidata.org/entity/Q977276", "itemLabel": "Henry Wallis", "itemDescription": "English Pre-Raphaelite painter, writer and collector (1830-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Wallis", "wikipedia_page": {"main": "Henry Wallis  (21 February 1830 – 20 December 1916) was a British Pre-Raphaelite painter, writer and collector.\nWallis was born in London on 21 February 1830, but his father's name and occupation are unknown. When in 1845 his mother, Mary Anne Thomas, married Andrew Wallis, a prosperous London architect, Henry took his stepfather's surname. His artistic training was thorough and influential. He was admitted as a probationer to the RA and enrolled in the Painting School in March 1848. He also studied in Paris at Charles Gleyre's atelier and at the Academie des Beaux Arts, sometime between 1849 and 1853.\n\nWallis is best remembered for his first great success, The Death of Chatterton, which he exhibited at the Royal Academy in 1856. The painting depicted the impoverished late 18th-century poet Thomas Chatterton, who poisoned himself in despair at the age of seventeen, and was considered a Romantic hero for many young and struggling artists in Wallis's day. His method and style in Chatterton reveal the importance of his connection to the Pre-Raphaelite movement, seen in the vibrant colours and careful build-up of symbolic detail. He used a bold colour scheme with a contrasting palette and he exploited the fall of the natural light through the window of the garret to implement his much loved style at the time, chiaroscuro. The size of Chatterton's garret was only fractionally larger than the scope of the painting, with room for Wallis and his easel and little else during the preliminary sketches, which were done on-site. The painting is 25x37\" and is in the Tate Britain, with other versions in the Birmingham Museum and Art Gallery and the Yale Center for British Art.\n\nThere may have been more examples of Chatterton as it was popular and when Wallis had to pay the rent he would paint another version. He once said that dead poets are more saleable than dead labourers (referring to The Stonebreaker, his next major work). The Stonebreaker (1857, exhibited in 1858) consolidated his reputation as a true Pre-Raphaelite. In total, he showed 35 exhibits at the RA, but later in life developed a greater interest in watercolour painting. He was elected a full member of the RWS (Royal Watercolour Society) in 1878 and exhibited over 80 watercolours at the society.\nThe model for his acclaimed The Death of Chatterton was the young George Meredith, whose first wife Mary Ellen would later run off with Wallis.\nWallis's method of painting, especially in the early years of his career, and in particular on \"Death of Chatterton\", was to do the initial sketch, saturate it in water, use a grey tint to block in the shade, put on the colour and allow it to dry. When firm, he would use a hair pencil to add in the details, for which he is so renowned. For the light, he would touch the area in question with water and then rub it with a piece of bread. His studio during these years was in Chelsea, a very bohemian and out of the way part of London at the time.\nHe died, almost blind, at 1 Walpole Road, Croydon, on 20 December 1916.\n\n", "link_mentions": [{"page": "Pre-Raphaelite Brotherhood", "response": ["* Henry Wallis (painter)", "*Ramm, John (2003). \"The Forgotten Pre-Raphaelite: Henry Wallis\", Antique Dealer & Collectors Guide, 56 (March/April), p. 8–9"]}, {"page": "1856 in literature", "response": ["*May – John Ruskin praises Henry Wallis's painting of The Death of Chatterton when it is exhibited in London; the young poet and novelist George Meredith modelled for the painting."]}, {"page": "Thomas Chatterton", "response": ["At 17, he sought outlets for his political writings in London, having impressed the Lord Mayor, William Beckford, and the radical leader John Wilkes, but his earnings were not enough to keep him, and he poisoned himself in despair. His unusual life and death attracted much interest among the romantic poets, and Alfred de Vigny wrote a play about him that is still performed today. The oil painting The Death of Chatterton by Pre-Raphaelite artist Henry Wallis has enjoyed lasting fame.", "The most famous image of Chatterton in the 19th century was The Death of Chatterton (1856) by Henry Wallis, now in Tate Britain, London. Two smaller versions, sketches or replicas, are held by the Birmingham Museum and Art Gallery and the Yale Center for British Art. The figure of the poet was modeled by the young George Meredith."]}, {"page": "George Meredith", "response": ["In 1856 was exhibited The Death of Chatterton, a notable painting by the English Pre-Raphaelite painter Henry Wallis (1830–1916), for which Meredith served as the model.Krzysztof Cieszkowski, \"The Legend Makers: Chatterton, Wallis and Meredith\", History Today, Vol. 32, Issue 11, November 1982. Mary and Wallis grew close; she was pregnant by him in 1857 and in April 1858 gave birth to a son, Harold, who was later known as Felix Wallis. The relationship with Wallis did not last; having spent some of 1858 with him in Capri, she returned to England with Harold, and from then on moved frequently. She died three years later, of kidney failure, a few months after moving to Grotto Cottage, Oatlands Park, Weybridge. Meredith was by this time living in Chelsea, where he kept rooms in Hobury Street and often had Arthur in his care.Stevenson, The Ordeal of George Meredith, p. 59. He did not attend Mary's funeral; neither did Henry Wallis or her father.Cieszkowski, \"The Legend Makers: Chatterton, Wallis and Meredith\"."]}, {"page": "Birmingham Museum and Art Gallery", "response": ["File:Wallis The Stonebreaker.jpg|The Stonebreaker by Henry Wallis"]}, {"page": "Modern Love (poetry collection)", "response": ["Modern Love (1862) by George Meredith is a collection of 50 16-line sonnets about the failure of his first marriage.  He reflects his own disillusionment after his wife Mary Ellen, the daughter of Thomas Love Peacock, left him for the painter Henry Wallis."]}, {"page": "1856 in art", "response": ["* Henry Wallis – The Death of Chatterton"]}, {"page": "1857 in art", "response": ["* Henry Wallis – The Stonebreaker"]}, {"page": "Shakespeare's funerary monument", "response": ["In the 1850s, the scientist Richard Owen argued that a death mask discovered in Germany by Ludwig Becker in 1849, known as the Kesselstadt Death Mask, was probably used by Gerard Johnson to model the face of the effigy. The mask had been claimed to be of Shakespeare because of a similarity to an alleged Shakespeare portrait Becker had bought two years earlier.Lee, Sidney. Shakespeare's Life and Work (1904), 160 This was depicted by the painter Henry Wallis in his imaginary scene portraying Ben Jonson showing the death mask to the sculptor.Jane Martineau, Shakespeare in Art, Merrell, 2003, p. 214 However, measurements of the mask and the monument figure did not correspond, most notably the bony structure of the forehead, and the idea was discredited.Spielmann, 12–13. Though the Kesselstadt mask does not seem to fit, Park Honan asserts that the facial features of the monument do appear to have been modelled on a mask: \"His eyes stare, the face is heavy and the nose is small and sharp. Because of the shrinkage of the muscles and possibly of the nostrils, the upper lip is elongated\".Honan, Park. Shakespeare: A Life. Oxford University Press. 1998. p. 409 "]}]}}