{"wiki_id": "http://www.wikidata.org/entity/Q97782", "itemLabel": "Joseph Jonas", "itemDescription": "politician (1845-1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Jonas", "wikipedia_page": {"main": "Joseph Jonas (1845 – 22 August 1921) was the German-born Lord Mayor of Sheffield, England in 1904–05.", "link_mentions": [{"page": "History of the Jews in Cincinnati", "response": ["The first known Jew to settle in Cincinnati was Joseph Jonas, an English emigrant who arrived in the city via Philadelphia in 1817. Jonas, a young man, decided to leave his home in Exeter, England, with the avowed intention of settling in Cincinnati. Friends in Philadelphia originally endeavored to dissuade him from going to a place so isolated from all association with his coreligionists. However, Jonas reassured them that he would succeed. For the first two years, he was the only Jew in the Midwestern town.", "There were not enough settlers to form a congregation until the year 1824, when the number of Jewish inhabitants of the town had reached about twenty. On January 4 of that year a preliminary meeting was held to consider the advisability of organizing a congregation. Two weeks later, on January 18, the Congregation Bene Israel was formally organized; those in attendance were Solomon Buckingham, David I. Johnson, Joseph Jonas, Samuel Jonas, Jonas Levy, Morris Moses, Phineas Moses, Simeon Moses, Solomon Moses, and Morris Symonds. On January 8, 1830, the Ohio General Assembly granted the congregation a charter whereby it was incorporated under the laws of the state.", "The Jews of Cincinnati participated actively in civic life and filled many local positions of trust, as well as state, judicial, and governmental offices. Henry Mack, Charles Fleischmann, James Brown (Ohio politician), and Alfred M. Cohen were elected members of the State Senate, and Joseph Jonas, Jacob Wolf, Daniel Wolf, and Harry M. Hoffheimer served in the State House of Representatives. Jacob Shroder was judge of the court of common pleas for a number of years, and Frederick S. Spiegel held the same position as of 1902. Julius Fleischmann was the mayor of the city.  Nathaniel Newburgh was appointed appraiser of merchandise by President Cleveland during his first administration, and Bernhard Bettmann was collector of internal revenue since 1897. Lewis S. Rosenstiel, a grandson of Frederick A. Johnson—the first Jew born in the city, was the founder and chairman of Schenley Industries and was the nation's largest distiller for half of the twentieth-century."]}, {"page": "History of the Jews in Ohio", "response": ["The history of Jews in Ohio dates back to 1817, when Joseph Jonas, a pioneer, came from England and made his home in Cincinnati. He drew after him a number of English Jews, who held Orthodox-style divine service for the first time in Ohio in 1819, and, as the community grew, organized themselves in 1824 into the first Jewish congregation of the Ohio Valley, the B'ne Israel. This English immigration was followed in the next two decades by the coming of German immigrants who, in contrast, were mostly Reform Jews. A Bavarian, Simson Thorman, settled in 1837 in Cleveland, then a considerable town, which thus became the second place in the state where Jews settled. By Cyrus Adler & H. G. Friedmann Thorman was soon followed by countrymen of his, who in 1839 organized themselves into a congregation (the first in Cleveland, and the second in Ohio) called the Israelitish Society. The same decade saw an influx of German Jews into Cincinnati, and these in 1841 founded the Bene Yeshurun congregation. To these two communities the Jewish history of Ohio was confined for the first half of the 19th century. In 1850 Ohio had six congregations: four in Cincinnati and two in Cleveland.", "In political life also the Jews have been active. Joseph Jonas, Jacob Wolf, William Bloch, Daniel Wolf, Caspar Lowenstein, Harry M. Hoffheimer, Fred A. Johnson, Frederick S. Spiegel, Charles Fleischmann, Henry Mack, Alfred M. Cohen, and Max Silverberg have served in the state legislature. Julius Freiburg was a member of the convention to change the constitution."]}, {"page": "List of mayors of Sheffield", "response": ["|Joseph Jonas"]}, {"page": "List of revocations of appointments to orders and awarded decorations and medals of the United Kingdom", "response": ["*1918: Joseph Jonas, after being convicted of a misdemeanourHe was charged with a felony - a very serious crime, but only found guilty of the minor offence of aiding someone else's misdemeanour. as a result of the anti-German sentiments in Britain at the time because of the First World War. In addition, his British citizenship was revoked but he was not deported."]}, {"page": "Jonas (name)", "response": ["* Joseph Jonas (disambiguation), a number of people including", "** Joseph Jonas, politician"]}, {"page": "Joseph Jonas (disambiguation)", "response": ["Joseph Jonas (1845–1921) was the German-born Lord Mayor of Sheffield.", "Joseph Jonas may also refer to:", "*Joseph Jonas (Cincinnati) (1792–1869), Cincinnati watchmaker & silversmith"]}, {"page": "List of British people with German ancestry", "response": ["* Joseph Jonas, former Mayor of Sheffield and Imperial German Consul to the city"]}, {"page": "Edgar Speyer", "response": ["*Joseph Jonas"]}, {"page": "Jonas, Joseph", "response": ["#redirectJoseph Jonas"]}, {"page": "List of Knights Bachelor appointed in 1905", "response": ["|Joseph Jonas"]}]}}