{"wiki_id": "http://www.wikidata.org/entity/Q977389", "itemLabel": "John Heywood", "itemDescription": "English writer known for plays, poems and a collection of proverbs (1497-1580)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Heywood", "wikipedia_page": {"main": "John Heywood (c. 1497 – c. 1580) was an English writer known for his plays, poems, and collection of proverbs. Although he is best known as a playwright, he was also active as a musician and composer, though no musical works survive. A devout Catholic, he nevertheless served as a royal servant to both the Catholic and Protestant regimes of Henry VIII, Edward VI, Mary I and Elizabeth I.\n\n", "link_mentions": [{"page": "John Donne", "response": ["His father died in 1576, when Donne was four years old, leaving his mother, Elizabeth, with the responsibility of raising the children alone. Heywood was also from a recusant Roman Catholic family, the daughter of John Heywood, the playwright, and sister of the Reverend Jasper Heywood, a Jesuit priest and translator. She was also a great-niece of Thomas More. A few months after her husband died, Donne's mother married Dr. John Syminges, a wealthy widower with three children of his own."]}, {"page": "1580", "response": ["** John Heywood, English dramatist (b. 1497)"]}, {"page": "1497", "response": ["** John Heywood, English playwright (d. 1580)"]}, {"page": "Ben Jonson", "response": ["The romantic revolution in criticism brought about an overall decline in the critical estimation of Jonson. Hazlitt refers dismissively to Jonson's \"laborious caution.\" Coleridge, while more respectful, describes Jonson as psychologically superficial: “He was a very accurately observing man; but he cared only to observe what was open to, and likely to impress, the senses.” Coleridge placed Jonson second only to Shakespeare; other romantic critics were less approving. The early 19th century was the great age for recovering Renaissance drama. Jonson, whose reputation had survived, appears to have been less interesting to some readers than writers such as Thomas Middleton or John Heywood, who were in some senses \"discoveries\" of the 19th century. Moreover, the emphasis which the romantic writers placed on imagination, and their concomitant tendency to distrust studied art, lowered Jonson's status, if it also sharpened their awareness of the difference traditionally noted between Jonson and Shakespeare. This trend was by no means universal, however; William Gifford, Jonson's first editor of the 19th century, did a great deal to defend Jonson's reputation during this period of general decline. In the next era, Swinburne, who was more interested in Jonson than most Victorians, wrote, \"The flowers of his growing have every quality but one which belongs to the rarest and finest among flowers: they have colour, form, variety, fertility, vigour: the one thing they want is fragrance” – by “fragrance,” Swinburne means spontaneity."]}, {"page": "Penny", "response": ["* \"A penny for your thoughts\" is an idiomatic way of asking someone what they are thinking about. It is first attested in John Heywood's 1547 Dialogue Conteinying the Nomber in Effect of All the Proverbes in the Englishe Tongue,. at a time when the penny was still a sterling silver coin."]}, {"page": "Mechelen", "response": ["*John Heywood, English poet (1497–c 1575)"]}, {"page": "1533 in literature", "response": ["*John Heywood"]}, {"page": "1530 in literature", "response": ["*John Heywood – The Play called the foure PP; a newe and a very mery interlude of a palmer, a pardoner, a potycary, a pedler  "]}, {"page": "1526 in literature", "response": ["*A Hundred Merry Tales (A C. Mary Talys, printed by John Rastell and perhaps compiled by John Heywood)"]}, {"page": "1520 in literature", "response": ["*John Heywood – Johan Johan The Husband"]}, {"page": "March Hare", "response": ["\"Mad as a March hare\" is a common British English phrase, both now and in Carroll's time, and appears in John Heywood's collection of proverbs published in 1546. It is reported in The Annotated Alice by Martin Gardner that this proverb is based on popular belief about hares' behaviour at the beginning of the long breeding season, which lasts from February to September in Britain. Early in the season, unreceptive females often use their forelegs to repel overenthusiastic males. It used to be incorrectly believed that these bouts were between males fighting for breeding supremacy."]}, {"page": "You can't have your cake and eat it", "response": ["An early recording of the phrase is in a letter on 14 March 1538 from Thomas, Duke of Norfolk, to Thomas Cromwell, as \"a man can not have his cake and eat his cake\". The phrase occurs with the clauses reversed in John Heywood's A dialogue Conteinyng the Nomber in Effect of All the Prouerbes in the Englishe Tongue from 1546, as \"wolde you bothe eate your cake, and have your cake?\". In John Davies's Scourge of Folly of 1611, the same order is used, as \"A man cannot eat his cake and haue it stil.\""]}, {"page": "Thomas Heywood", "response": ["Few details of Heywood's life have been documented with certainty. Most references indicate that the county of his birth was most likely Lincolnshire, while the year has been variously given as 1570, 1573, 1574 and 1575. It has been speculated that his father was a country parson and that he was related to the half-century-earlier dramatist John Heywood, whose death year is, again, uncertain, but indicated as having occurred not earlier than 1575 and not later than 1589."]}, {"page": "Seven Sleepers", "response": ["In John Heywood's Play called the Four PP (1530s), the Pardoner, a Renaissance update of the protagonist in Chaucer's \"The Pardoner's Tale\", offers his companions the opportunity to kiss \"a slipper / Of one of the Seven Sleepers\", but the relic is presented as absurdly as the Pardoner's other offerings, which include \"the great-toe of the Trinity\" and \"a buttock-bone of Pentecost.\""]}, {"page": "Galápagos (novel)", "response": ["The novel contains a large number of quotations from other authors. They are related to the story itself and are functionally inserted through Mandarax, a fictional voice translator that is also able to provide quotations from literature and history. The following authors are quoted (in order of their appearance in the book): Anne Frank, Alfred Tennyson, Rudyard Kipling, John Masefield, William Cullen Bryant, Ambrose Bierce, Lord Byron, Noble Claggett, John Greenleaf Whittier, Benjamin Franklin, John Heywood, Cesare Bonesana Beccaria, Bertolt Brecht, Saint John, Charles Dickens, Isaac Watts, William Shakespeare, Plato, Robert Browning, Jean de La Fontaine, François Rabelais, Patrick R. Chalmers, Michel de Montaigne, Joseph Conrad, George William Curtis, Samuel Butler, T. S. Eliot, A. E. Housman, Oscar Hammerstein II, Edgar Allan Poe, Charles E. Carryl, Samuel Johnson, Thomas Carlyle, Edward Lear, Henry David Thoreau, Sophocles, Robert Frost, and Charles Darwin."]}, {"page": "Pepys Library", "response": ["* The earliest copy of John Heywood's The Play of the Weather, published in 1533 shortly after being performed for Henry VIII."]}, {"page": "Jasper Heywood", "response": ["He was son of John Heywood, and became a fellow of Merton College, Oxford, but was compelled to resign in 1558. In the same year he was elected a fellow of All Souls College, but, refusing to conform to the changes in religion at the beginning of the reign of Elizabeth I, he gave up his fellowship and went to Rome, where he was received into the Society of Jesus."]}, {"page": "Pig in a poke", "response": ["Thers many a foule pyg in a feyre clokeJohn Heywood, Two hundred Epigrammes, vpon two hundred prouerbes, with a thyrde hundred newely added, 1555, full text"]}, {"page": "Tottel's Miscellany", "response": ["Wyatt's inclusion in Tottel's Miscellany would mark the first time this poet's work was printed. (Two of Surrey's poems had appeared in print). Other contributors include Nicholas Grimald, Thomas Norton, Thomas Vaux, John Heywood, Edward Somerset and other uncertain or unknown authors. Among these unknown authors, it is believed that Geoffrey Chaucer wrote at least one of the poems, titled in the anthology as, \"To leade a vertuous and honest life.\" Although some of the wording has been altered slightly, this poem appears to be \"a somewhat mutilated copy of Chaucer's ballad on \"Truth.\"\" ", "The first edition of Tottel's Miscellany (1557) featured forty poems by Surrey, ninety-six poems by Wyatt, forty poems by Grimald, and ninety-five poems written by unknown authors. Tottel made note that of those anonymous poems, the authors were sure to include Thomas Churchyard, Thomas Vaux, Edward Somerset, John Heywood and Sir Francis Bryan. It has been decided definitely that of those ninety-five poems, two were written by Vaux, one by John Heywood, and one by Somerset. The only first edition left is in the Bodleian Library in England. A reprint, which was limited to sixty copies, was edited by John Payne Collier in 1867."]}, {"page": "Syllabub", "response": ["Syllabub (or solybubbe, sullabub, sullibib, sullybub, sullibub; there is no certain etymology and considerable variation in spelling) has been known in England at least since John Heywood's Thersytes of about 1537: \"You and I... Muste walke to him and eate a solybubbe.\"Heywood, John (1537) Thersytes The word occurs repeatedly, including in Samuel Pepys's diary for 12 July 1663; \"Then to Comissioner Petts and had a good Sullybub\"Pepys, Samuel Diary of Samuel Pepys, 12 July 1663 and in Thomas Hughes's Tom Brown at Oxford of 1861; \"We retire to tea or syllabub beneath the shade of some great oak.\"Hughes, Thomas (1861) Tom Brown at Oxford"]}, {"page": "Will Sommers", "response": ["Under Mary I, Will's role was mainly ceremonial, and as a sidekick to Mary's personal fool, Jane Foole. Will was reputed to be the only man who made Mary laugh, apart from John Heywood. Will's last public event was the coronation of Elizabeth I."]}, {"page": "Heywood, John", "response": ["#REDIRECTJohn Heywood"]}, {"page": "List of years in poetry", "response": ["* 1550 in poetry Charles Bansley, The Pride of Women; Robert Crowley, One and Thyrtye Epigrammes; John Heywood, An Hundred Epigrammes; William Langland (attributed), Piers Plowman, the B textCox, Michael, editor, The Concise Oxford Chronology of English Literature, Oxford University Press, 2004, "]}, {"page": "Piers Plowman tradition", "response": ["*Of Gentylnes and Nobylyte: A dyaloge betwene the marchaunt the knyght and the plowman dysputyng who is a verey gentylman and who is a noble man and how men shuld come to auctoryte, compiled in a maner of an enterlude, or the Dialogue of the Gentleman and Plowman... (1525). This is a dramatic work that is often mistitled as the Dialogue of the Gentleman and Plowman. Its printer, John Rastell, or John Heywood may have been the author. In the dialogue, the plowman takes over and wins the debate, arguing for individual merit based on inner virtue. In the process, the plowman critically examines the bases of the wealth of the landed aristocracy."]}, {"page": "Fire (TV series)", "response": [":Det. Sen. Sgt. Ron Chandler ~ John Heywood"]}, {"page": "List of playwrights by nationality and year of birth", "response": ["*(c. 1497–c. 1585) John Heywood"]}, {"page": "Medieval theatre", "response": ["The earliest secular drama is The Play of the Greenwood by Adam de la Halle in 1276. It contains satirical scenes and folk material such as faeries and other supernatural occurrences. Farces also rose dramatically in popularity after the 13th century. The majority of these plays come from France and Germany and are similar in tone and form, emphasizing sex and bodily excretions.Brockett and Hildy (2003, 96) The best known playwright of farces is Hans Sachs (1494–1576) who wrote 198 dramatic works. In England, The Second Shepherds' Play of the Wakefield Cycle is the best known early farce. However, farce did not appear independently in England until the 16th century with the work of John Heywood (1497–1580)."]}, {"page": "A rolling stone gathers no moss", "response": ["The conventional English translation first appeared in John Heywood's collection of Proverbs in 1546, crediting Erasmus. Brewer's Dictionary of Phrase and Fable also credits Erasmus, and relates it to other Latin proverbs, Planta quae saepius transfertus non coalescit or Saepius plantata arbor fructum profert exiguum, which mean that a frequently replanted plant or tree yields less fruit than say an olive or oak tree that is left in place for hundreds of years. Brewer's Dictionary of Phrase and Fable , sub. title \"Rolling Stone\".  "]}, {"page": "Baconian theory of Shakespeare authorship", "response": ["In the 19th century, a waste book entitled the Promus of Formularies and EleganciesBritish Library MS Harley 7017.  A transcription can be found in Durning-Lawrence, Edward, Bacon is Shakespeare (Gay & Hancock, London 1910). was discovered.  It contained 1,655 hand written proverbs, metaphors, aphorisms, salutations and other miscellany.  Although some entries appear original, many are drawn from the Latin and Greek writers Seneca, Horace, Virgil, Ovid; John Heywood's Proverbes (1562); Michel de Montaigne's Essays (1575), and various other French, Italian and Spanish sources.  A section at the end aside, the writing was, by Sir Edward Maunde-Thompson's reckoning, in Bacon's hand; indeed, his signature appears on folio 115 verso. Only two folios of the notebook were dated, the third sheet 5 December 1594 and the 32nd 27 January 1595 (1596). Bacon supporters found similarities between a great number of specific phrases and aphorisms from the plays and those written by Bacon in the Promus. In 1883 Mrs. Henry Pott edited Bacon's Promus and found 4,400 parallels of thought or expression between Shakespeare and Bacon."]}, {"page": "List of people from Mechelen", "response": ["*John Heywood, English poet (1497-c. 1575)"]}, {"page": "Heywood (surname)", "response": ["* John Heywood, 16th century English writer"]}, {"page": "Poculi Ludique Societas", "response": ["The Four PP by John Heywood;", "Johan Johan by John Heywood, and Once More", "Johan Johan by John Heywood;", "Three Farces from Three Lands (The Farce of the Fisherman by Cornelis Everaert, The Stolen Shrovetide Cock by Hans Sachs and Johan Johan The Husband by John Heywood)"]}, {"page": "All Around My Hat (song)", "response": ["The song \"All Around my Hat\" (Roud 567Vaughan Williams Memorial Library - Roud 567 and 22518,Vaughan Williams Memorial Library - Roud 22518 Laws P31) is of nineteenth-century English origin.S.G. Spaeth. A History of Popular Music in America, pp. 83–84 (1948, ), quotes a song said to be from around 1840, that goes, \"All round my hat, I vears [sic] a green villow [sic].\" In an early version, dating from the 1820s, a Cockney costermonger vowed to be true to his fiancée, who had been sentenced to seven years' transportation to Australia for theft and to mourn his loss of her by wearing green willow sprigs in his hatband for \"a twelve-month and a day\", the willow being a traditional symbol of mourning.See Othello, 4:3, in which Desdemona sings a willow song and asks Emilia about omens of weeping. Another Elizabethan willow song mentions the wearing of the green willow; this is in a poem by John Heywood, dated circa 1545 (Br. Mus. addit. No. 15,233): \"All a green willow, willow, willow, All a green willow is my garland.\" See Norman Ault, Elizabethan Lyrics, pp. 14–15, 519 (1949). Robert George Whitney Bolwell, The Life and Works of John Heywood, identifies this Heywood work as the song \"The Ballad of the Green Willow\". He points out that this is a predecessor of Shakespeare's Willow Song, which merely changes the word \"is\" in the refrain to \"must be\". The song was made famous by Steeleye Span in 1975,Their video version is available on [www.youtube.com/watch?v=3zzwbYyvWiU|Youtube]. (This is not the traditional version; it is a rock version.) whose rendition may have been based on a more traditional version sung by John Langstaff.https://www.youtube.com/watch?v=5eIO-eRajNwA variation from Devon was collected from the singing of Harry Westaway in Belstone, Devon.Harry senior, Harry junior and Bill Westaway of Belstone, Devon; Westaway One Name Study"]}, {"page": "The Mulliner Book", "response": ["The Mulliner Book (British Library Add MS 30513) is a historically important musical commonplace book compiled, probably between about 1545 and 1570, by Thomas Mulliner, about whom practically nothing is known, except that he figures in 1563 as modulator organorum (organist) of Corpus Christi College, Oxford. He is believed to have previously resided in London, where John Heywood inscribed the title page of the manuscript Sum liber thomas mullineri / iohanne heywoode teste. ('I am Thomas Mulliner's book, with John Heywood as witness.') A later annotation on the same page states that: T. Mulliner was Master of St Pauls school, but this has so far proved unsupportable. The provenance of the MS is unknown before it appears in the library of John Stafford Smith in 1776. After passing through the hands of Edward Francis Rimbault the MS was given to the British Museum in 1877 by William Hayman Cummings."]}, {"page": "Category talk:English Renaissance plays", "response": ["I'd like to see a reference to a critic or similar justifying why 1576 can be said to be the start of the English theatre Renaissance. I would've included Ars Adulandi; Or, The Art of Flattery by Ulpian Fulwell, or his Like Will to Like (both written in the 1560s), or evenWitty and Wittless(1525) by John Heywood. "]}, {"page": "Rome was not build in one day", "response": ["#REDIRECT John Heywood"]}, {"page": "Rone was not Built in One Day", "response": ["#REDIRECT John Heywood"]}, {"page": "Rome was not built in one day", "response": ["#REDIRECT John Heywood#Famous epigrams"]}, {"page": "1490s in England", "response": ["** John Heywood, playwright (died 1580)"]}, {"page": "1580s in England", "response": ["** John Heywood, dramatist (born 1497)"]}, {"page": "Rome was not built in a day", "response": ["#REDIRECT John Heywood#Famous epigrams"]}, {"page": "Rome wasn't built in a day", "response": ["The expression, (as \"Rome was not built in one day\") is given in English in John Heywood's A Dialogue Conteinyng the Nomber in Effect of all the Prouerbes in the Englishe Tongue (c. 1538), while Queen Elizabeth I referred to the idea in Latin in an address at Cambridge in 1563.«Hæc tamen vulgaris sententia me aliquantulum recreavit, quæ etsi non auferre, tamen minuere possit dolorem meum, quæ quidem sententia hæc est, Romam uno die non fuisse conditam.» \"But this common saying has given me a certain amount of comfort – a saying which cannot take away, but can at least lessen, the grief that I feel; and the saying is, that Rome was not built in one day.\" —https://books.google.com/books?id=VOZRAAAAcAAJ&hl=en&pg=PA176 The present perfect and oratio recta version of the Latin saying—the version one would use for a stand-alone quotation—would be Roma uno die non est condita."]}]}}