{"wiki_id": "http://www.wikidata.org/entity/Q978881", "itemLabel": "Derek Allhusen", "itemDescription": "equestrian", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Allhusen", "wikipedia_page": {"main": "Major Derek Swithin Allhusen, CVO (9 January 1914 – 24 April 2000) was an English equestrian who was a 54-year-old grandfather when he rode Lochinvar to team gold and individual silver medals at the 1968 Summer Olympics in Mexico.\nDerek Swithin Allhusen was born in London and educated at Eton and Trinity College, Cambridge. In 1937 he married The Hon Claudia Betterton. He served throughout the Second World War with 9th Queen's Royal Lancers, being awarded the American Silver Star in 1944.On returning from Germany he brought back two horses with him and settled in Claxton, Norfolk. He rode one of the horses, Laura when representing Britain in the pentathlon at the 1948 Winter Olympic Games. He eventually took up eventing in 1955, riding Laura's daughter Laurien on two European Championship teams, winning a team gold medal in 1957, then team silver and individual bronze in 1959. In 1961 he bought Irish-bred Lochinvar and rode her in two winning European Championship teams (in 1967 and 1969) as well as the gold and silver at the 1968 Summer Olympics. He was offered appointment as an MBE for his achievements but declined it; feeling his team-mates Richard Meade, Jane Bullen and Reuben Jones also deserved recognition.\nOn his retirement from the sport he continued as a breeder and Laurien's son Laurieston was ridden to team and individual Olympic gold medals in 1972 Games in Munich, with Richard Meade in the saddle. Allhusen was president of the British Horse Society from 1986 to 1988.\nAllhusen was appointed to be one of Her Majesty's Body Guard of the Honourable Corps of Gentlemen at Arms in 1963, he was appointed Standard Bearer from 1981 to 1984. He was appointed to be a Commander of the Royal Victorian Order in 1983.In November 1955, 1956 and 1957 he was nominated as a High Sheriff of Norfolk (and appointed in March 1958) in the Queen's Bench Division of the High Court of Justice", "link_mentions": [{"page": "Equestrian at the 1968 Summer Olympics", "response": ["The show-jumping phase also took its toll, after Wofford fell off Kilkenny and dropped into 6th. Deev was in contention for individual gold, but jumped the wrong fence and was eliminated. This allowed Guyon to move up to the gold medal spot, followed by British rider Derek Allhusen on Lochinvar and American Michael Page on Foster.", "|Derek Allhusen  and Lochinvar  Richard Meade  and Cornishman V  Reuben Jones  and The Poacher"]}, {"page": "European Eventing Championships", "response": ["| 1959 ||  Harewood ||  Hans Schwarzenbach on Burn Trout ||  Frank Weldon on Samuel Johnson ||  Derek Allhusen on Laurien", "| 1967 ||  Punchestown ||  Eddie Boylan on Durlas Eile ||  Martin Whiteley on The Poacher ||  Derek Allhusen on Lochinvar", "| 1957 ||  Copenhagen || Sheila Willcox on High & MightyTed Marsh on Wild VentureDerek Allhusen on LaurienKit Tatham-Warter on Pampas Cat || August Lütke-Westhüs on Franko IISiegfried Dehning on FechtlanzeReiner Klimke on LausbubDieter Fösken || Jonas Lindgren on EldoradoEvert Petterson on Tom RaidPetrus Kastenman on IllusterK.G. Holm on Air", "| 1959 ||  Harewood || August Lütke-Westhüs on Franko IIOttokar Pohlmann on PolarfuchsSiegfried Dehning on Fechtlanze Reiner Klimke on Fortunat || Frank Weldon on  Samuel Johnson Derek Allhusen on LaurienJeremy Beale on Fulmer FollySheila Waddington on Airs & Graces || Jéhan Le Roy on GardenPierre Durand Sr. on GuillanoGuy Lefrant on NiciasHugues Landon on Espionne", "| 1965 ||  Moscow || Valentin GorelkinSaybattal Mursalimov on DzhigitAleksandr Yevdokimov on PadarokLev Baklyshkin on Evlon || Penelope Moreton on LoughlinVirginia Freeman-Jackson on Sam WellerEddie Boylan on Durlas EileAnthony Cameron on Lough Druid || Derek Allhusen on LochinvarRichard Meade on BarberryChristine Sheppard on FenjiraoReuben Jones on Master Bernard", "| 1967 ||  Punchestown || Martin Whitely on The PoacherDerek Allhusen on LochinvarReuben Jones on FoxdorRichard Meade on Barberry || Eddie Boylan on Durlas EileJohn Fowler on Dooney RockVirginia Stanhope on Sam WellerBill Mullins on March Hawk || Jean-Jacques Guyon on PitouDaniel Lechevallier on OperaHenri Michel on OuraganMichel Cochenet on Artaban II", "| 1969 ||   || Richard Walker on PashaDerek Allhusen on LochinvarPolly Hely-Hutchinson on Count JasperReuben Jones on The Poacher || Yuri Solos on FatAleksandr Yevdokimov on FahradKamo Zakarian on FugusY. Kepp on Hobot || Bernd Messmann on WindspielKurt Mergler on AdajioHorst Karsten on VaibelOtto Ammermann om Alpaca"]}, {"page": "Great Britain at the 1968 Summer Olympics", "response": ["*Derek Allhusen, Jane Bullen, Ben Jones, and Richard Meade — Equestrian, Three-Day Event Team Competition", "*Derek Allhusen — Equestrian, Three-Day Event Individual Competition"]}, {"page": "List of Olympic medalists in equestrian", "response": ["|Derek Allhusen  and Lochinvar  Richard Meade  and Cornishman V  Reuben Jones  and The Poacher"]}, {"page": "Claxton, Norfolk", "response": ["To the east of the village are the remains of Claxton Castle, which dates from the mid-14th century, licences to crenellate having been granted in 1340 and 1376.Claxton Castle Situated on private land in the grounds of Claxton Manor House it comprises a massive brick-and-flint wall  long with six bastions. Claxton Manor House itself was built in the reign of Elizabeth I but has a Victorian façade. The Manor was bought in 1946 by Major Derek Allhusen, who achieved fame as a horseman winning team gold and individual silver at the 1968 Summer Olympics. Derek Allhusen died in 2000.Claxton, A Thousand Years of Village Life (2005)."]}, {"page": "West Downs School", "response": ["*Derek Allhusen;"]}, {"page": "Index of World War II articles (D)", "response": ["# Derek Allhusen"]}]}}