{"wiki_id": "http://www.wikidata.org/entity/Q978677", "itemLabel": "Jack Peñate", "itemDescription": "British recording artist; singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Pe%C3%B1ate", "wikipedia_page": {"main": "Jack Peñate (; born 2 September 1984) is an English singer, songwriter, and musician.", "link_mentions": [{"page": "September 2", "response": ["*1984 – Jack Peñate, English singer-songwriter and guitarist"]}, {"page": "Oxegen", "response": ["* Jack Peñate"]}, {"page": "RJD2", "response": ["* Jack Peñate – \"Learning Lines\" from Matinée (2007)"]}, {"page": "XL Recordings", "response": ["* Jack Peñate"]}, {"page": "Alleyn's School", "response": ["* Jack Peñate (born 1984), singer-songwriter (Spurgeon's House)"]}, {"page": "List of people associated with University College London", "response": ["* Jack Peñate, singer-songwriter"]}, {"page": "Wireless Festival", "response": ["* Saturday, 4 July: Basement Jaxx, The Streets, Dizzee Rascal, Paul Oakenfold, Metric, Jack Peñate, Saint Etienne, Afrika Bambaataa & the Soulsonic Force, Frankmusik, Sneaky Sound System, N.A.S.A., Tommy Sparks, Delphic, Filthy Dukes, Digitalism, Skint & Demoralised, Master Shortie, Japanese Popstars, Phenomenal Handclap Band"]}, {"page": "List of indie rock musicians", "response": ["* Jack Peñate"]}, {"page": "Truck Festival", "response": ["The festival was rescheduled for the reserve dates of 22–23 September (the anniversary weekend of the first festival in 1998), with tickets remaining valid. Most of the original published lineup were able to return, although notable exceptions included The Brian Jonestown Massacre, Hopewell, Jack Peñate, Lethal Bizzle, Chase & Status and DJ Fresh. Oxford band Foals' set had to be rearranged after fear for safety in the Trailer Park tent. Their set on Saturday night saw them perform to a packed barn full of ecstatic truckers. The headliners were Idlewild on Sunday, and Garth Hudson (formerly of The Band) on Saturday, backed by a group including his wife Maud on lead vocals, and members of Goldrush and Grand Drive. Other artists on the bill included Glenn Tilbrook, Goldrush, Brakes, The Electric Soft Parade, John Power, Pull Tiger Tail, Metronomy and Grand Drive. The festival also featured the last performance of The Schla La Las."]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Jack Peñate", "*Jack Peñate", "*Jack Peñate"]}, {"page": "Paul Epworth", "response": ["Early 2009 saw Epworth co-writing and recording Jack Peñate's critically lauded second album Everything Is New including the singles \"Tonight's Today\" and \"Be the One\". He also co-wrote and produced tracks for Florence and the Machine's debut album Lungs, including the hit single \"Rabbit Heart (Raise It Up)\" along with the album tracks \"Howl\", \"Cosmic Love\", \"Hurricane Drunk\" and \"Blinding\". He also worked further with Friendly Fires on a single version of the track \"Skeleton Boy\" and produced the forthcoming single by The Big Pink, \"Stop the World\". In February 2009 he won best newcomer at the inaugural Music Producers' Guild Awards. In Spring 2009, Epworth co-produced another single with The Big Pink entitled \"Dominos\", and a new Friendly Fires single \"Kiss of Life\".", "| rowspan=\"9\"| Jack Peñate"]}, {"page": "Bestival", "response": ["2007 – Beastie Boys, The Chemical Brothers, Primal Scream, Madness, Gregory Isaacs, The Levellers, The Orb, The Gossip, Kate Nash, Jack Peñate, Patrick Wolf, Billy Bragg, Easy Star All Stars, The Maccabees, Dub Pistols, Calvin Harris, Friendly Fires and The Shakes."]}, {"page": "Tony Hoffer", "response": ["* 2007: Matinee by Jack Peñate"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Jack Peñate", "* Jack Peñate"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| Kasabian || Jack Peñate || Nerm and D-Code"]}, {"page": "List of Live Lounge cover versions", "response": ["|Jack Peñate ||\"1234\" by Feist\"Kiss\" by Prince\"Bulletproof\" by La Roux||11 December 200718 June 2009"]}, {"page": "Darondo", "response": ["In 2007, Darondo's song \"Didn't I\" was covered by Jack Peñate on his Spit At Stars EP and in 2008, featured on an episode of Breaking Bad. \"Didn't I\" was also featured in the 2010 film Saint John of Las Vegas In 2009, the song \"Legs\" was featured in an episode of the American version of Life on Mars. In 2010, \"Didn't I\" was featured in the films Night Catches Us and Jack Goes Boating. It also appeared in the New Element video, Future Nature. In 2013, \"Didn't I\" was featured on a Late Night Tales compilation mixed by Bonobo. In the same year, \"Didn't I\" was featured in the third installment of the Spanish Apartment trilogy, Chinese Puzzle starring Romain Duris. It was used as an ending theme in an episode of Lovesick. \"Didn't I\" was covered by the English electronic music duo HONNE on their 2015 EP \"Coastal Love\". \"Didn't I\" was also featured on Episode 1, Season 1 of The Blacklist and Season 1 of HBO's The Deuce. The song was featured in the Hulu show, High Fidelity. In September 2020 \"Didn't I\" was covered by a female artist, the American soul/blues singer Regina Bonelli. In 2018 producer Harry Fraud sampled “Didn't I” for his single “The Count”. Which also features Wiz Khalifa and Curren$y. Most recently, in September 2021, \"Didn't I\" closed Episode 4 (Season 1) of the Scottish television drama Guilt, produced by the BBC and airing on Masterpiece Mystery, as well as Episode 10, Season 2 of FXX comedy series Dave (TV series).Masterpiece Mystery Dave"]}, {"page": "Dub Be Good to Me", "response": ["Jack Peñate covered \"Dub Be Good to Me\" as a B-side to his re-released single \"Second, Minute or Hour\" in September 2007."]}, {"page": "List of NME covers", "response": ["*25/07/07 Kate Nash & Jack Peñate"]}, {"page": "2007 in British music charts", "response": ["| 20 October || Matinée || Jack Peñate"]}, {"page": "James Ellis (musician)", "response": ["He started his production career by assisting on records including Florence and the Machine's Lungs, Plan B's The Defamation Of Strickland Banks, Jack Peñate's Everything Is New, Chapel Club's Palace and others."]}, {"page": "Rosalita (band)", "response": ["Rosalita were a five-piece English post-punk revival band from East Anglia. The band formed in May 2005, and have toured continuously since early 2006. Rosalita play jerky indie pop \"with the aim of making people dance\". Their songs include pop culture references to things as diverse as Art Attack and Pop-Tarts. The band cite Talking Heads, The Stranglers, The Jam and Devo as influences. They have played as supporting act to Towers of London, Jack Peñate, Air Traffic and The Sounds among others."]}, {"page": "List of UK Independent Singles Chart number ones of 2007", "response": ["Eight acts managed to top the UK Indie Chart more than once. They were: Good Shoes, Arctic Monkeys, Elliot Minor, The Pigeon Detectives, Reverend and The Makers, The White Stripes, Jack Peñate and Dizzee Rascal.", "|style=\"text-align:center;\" rowspan=\"2\"|Jack Peñate", "|align=center|Jack Peñate"]}, {"page": "Oxegen 2007", "response": ["* Jack Peñate"]}, {"page": "Spit at Stars", "response": ["#REDIRECT Jack Peñate#Discography"]}, {"page": "Jersey Live", "response": ["* Jack Peñate"]}, {"page": "Torn on the Platform", "response": ["\"Torn On The Platform\" is the third single from Jack Peñate. It was released on 18 June 2007. It reached #7 in the UK singles chart, staying in the top 10 for one week. The music video for \"Torn on the Platform\" shows a paper puppet show with Peñate's head on the puppet. The guitarwork on the track has been cited for its similarities to the guitar on The Housemartins track \"Happy Hour\"."]}, {"page": "The Edge Festival", "response": ["| Jack Peñate"]}, {"page": "Jack Penate", "response": ["#REDIRECT Jack Peñate"]}, {"page": "Spit At Stars", "response": ["#REDIRECT Jack Peñate "]}, {"page": "Second, Minute or Hour", "response": ["\"Second Minute or Hour\" is the first single by singer-songwriter Jack Peñate, taken from his debut album Matinée. The single was re-released on 24 September 2007. It reached number 17 on the UK Singles Chart."]}, {"page": "Matinée (album)", "response": ["Matinée is the debut album from British singer-songwriter Jack Peñate.JackPenate.com It was released on 8 October 2007 on XL Recordings. The album reached number one on the UK Indie Albums chart, and number seven on the UK Albums Chart. It also reached number 74 on the Irish Albums Chart. The song \"My Yvonne\" features backing vocals by a young and then-unknown Adele.", "Category:Jack Peñate albums"]}, {"page": "Dev Hynes", "response": ["The touring band for the Falling Off the Lavender Bridge album at various points consisted of friends of Hynes' from other bands, including Florence Welch of Florence and the Machine and Emmy the Great. Mike Siddell, formerly of Hope of the States, played violin with the band. Anna Prior, formerly of Leeds bands Dead Disco and The Ivories, played drums for most of the tour. Other guest members to have contributed in live shows include Alex Turner of the Arctic Monkeys, Faris Badwan of The Horrors, Frederick Blood-Royale of Ox.Eagle.Lion.Man, Jack Peñate and Eugene McGuinness as well as We Are Scientists' Keith Murray on Late Night with Conan O'Brien on 6 June 2008."]}, {"page": "Adele", "response": ["Nick Huggett, at XL, recommended Adele to manager Jonathan Dickins at September Management, and in June 2006, Dickins became her official representative. September was managing Jamie T at the time and this proved a major draw for Adele, a big fan of the British singer-songwriter. Huggett then signed Adele to XL in September 2006. Adele provided vocals for Jack Peñate's song, \"My Yvonne,\" for his debut album, and it was during this session she first met producer Jim Abbiss, who would go on to produce both the majority of her debut album, 19, and tracks on 21. In June 2007, Adele made her television debut, performing \"Daydreamer\" on the BBC's Later... with Jools Holland. Adele's breakthrough song, \"Hometown Glory\", written when she was 16, was released in October 2007."]}, {"page": "Janie Jones (song)", "response": ["The video revolves around (the real) Janie Jones being chauffeured around London with Mick Jones. Many of the contributors to the song feature in the video. Drew McConnell accompanies Janie Jones from the Windmill theatre right at the beginning as she's getting into her car, Alan Donohoe from the Rakes is driving the car, two members of Cazals are walking down the street near the start and their singer, Phil Bush, mimes 'lucky lady', the two guys standing in front of the telephone box are Josh Hubbard from The Paddingtons and one member of Guillemots; Carl Barât, Anthony Rossomando, Gary Powell and a guitar can be seen in a car pulling up to a petrol station, while Jack Peñate is also seen at the petrol station and Lisa Moorish is seen singing along towards the end. The lead singer from the Mystery Jets is seen walking with one of the Holloways on the side of the street.", "* Jack Peñate"]}, {"page": "Radio 1's Live Lounge – Volume 2", "response": ["# Jack Peñate - \"Second, Minute or Hour\""]}, {"page": "Jim Abbiss", "response": ["Mixing tracks for Kasabian in 2003 led to co-producing 2 albums with them (the self-titled Kasabian and Empire) and gave him the first of 3 nominations for \"producer of the year\" at the Music Week/MPG awards. He then worked on Editors (The Back Room), The Noisettes (Wild Young Hearts) and The Temper Trap (Conditions). While producing the track \"My Yvonne\" for Jack Peñate, he met singer Adele, whom Jack had asked to do some backing vocals. He was immediately blown away by her voice and asked if she had her own demos. She had just signed to XL, and shortly afterwards Abbiss began work on her debut 19, producing eight tracks. Producing two tracks for her phenomenally successful follow-up 21 led to a Grammy nomination."]}, {"page": "Glastonbury Festival 2008", "response": ["* Jack Peñate"]}, {"page": "Jack Fabian Peñate", "response": ["#REDIRECT Jack Peñate"]}, {"page": "List of one-shot music videos", "response": ["| Jack Peñate  || Second, Minute or Hour || 2007 ||"]}, {"page": "Electric Gardens", "response": ["*Jack Peñate"]}]}}