{"wiki_id": "http://www.wikidata.org/entity/Q978878", "itemLabel": "Francis Frith", "itemDescription": "English photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Frith", "wikipedia_page": {"main": "Francis Frith (also spelled Frances Frith, 7 October 1822 – 25 February 1898) was an English photographer of the Middle East and many towns in the United Kingdom.\nFrith was born in Chesterfield, Derbyshire, attending Quaker schools at Ackworth and Quaker Camp Hill in Birmingham (c. 1828–1838), before he started in the cutlery business.  He suffered a nervous breakdown in 1843, recuperating over the next two years. In 1850 he started a photographic studio in Liverpool, known as Frith & Hayward.  A successful grocer, and later, printer, Frith fostered an interest in photography, becoming a founding member of the Liverpool Photographic Society in 1853. Frith sold his companies in 1855 in order to dedicate himself entirely to photography. He journeyed to the Middle East on three occasions, the first of which was a trip to Egypt in 1856 with very large cameras (16\" x 20\"). He used the collodion process, a major technical achievement in hot and dusty conditions. Photographs taken by Frith are held in the Conway Library of Art and Architecture at the Courtauld in London.\n\n", "link_mentions": [{"page": "Postcard", "response": ["*Francis Frith"]}, {"page": "List of photographers", "response": ["* Francis Frith (1822–1898)"]}, {"page": "Chesterfield, Derbyshire", "response": ["*Francis Frith (1822–1898), photographer and liberal Quaker"]}, {"page": "John Sergeant (journalist)", "response": ["Sergeant presented Britain's First Photo Album about the pioneering photography of Francis Frith. It aired 12–23 March 2012 on BBC Two. Frith travelled through Britain in Victorian times capturing life in photographic form; many of his pictures were subsequently sold as picture postcards."]}, {"page": "Reigate", "response": ["* Francis Frith (1822-1898) - photographer, founded his publishing company in Reigate in 1860"]}, {"page": "National Library of Wales", "response": ["The Library holds a collection of more than 800,000 photographs, including the earliest-known photograph in Wales. The daguerreotype of Margam Castle, made by Reverend Calvert Richard Jones, dates from 1841. Many other examples of photography from the 1840s and 1850s, such as the early Swansea photography of the Dillwyn Llewelyn family, are kept in the National Collection of Welsh Photographs. This collection also contains mounted portraits by high-street photographers, topographic views and portraits by John Thomas and scenic postcard photography by Francis Frith that are connected to Wales."]}, {"page": "Horrabridge", "response": ["It sits on the River Walkham, a fishing river famous for its salmon. The village's name may have been taken from the 15th century pack-horse bridge which remains the only vehicular route from one side of the village to the other, and featured in the children's television programme Bagpuss.Photo by Francis Frith:  The bridge is a Grade I listed building."]}, {"page": "Philip Ziegler", "response": ["*Britain Then and Now: The Francis Frith Collection (1999)"]}, {"page": "History of the Quakers", "response": ["Quakers were not apt to participate publicly in the arts. For many Quakers these things violated their commitment to simplicity and were thought too \"worldly\". Some Quakers, however, are noted today for their creative work. John Greenleaf Whittier was an editor and a poet in the United States. Among his works were some poems involving Quaker history and hymns expressing his Quaker theology. He also worked in the abolition movement. Edward Hicks painted religious and historical paintings in the naive style and Francis Frith was a British photographer, whose catalogue ran to many thousands of topographical views."]}, {"page": "Photochrom", "response": ["Amongst the first commercial photographers to employ the technique were French photographer Félix Bonfils, British photographer Francis Frith and American photographer William Henry Jackson, all active in the 1880s. Farbige Reise, Paris bibliothèques, 2009, p. 41  The photochrom process was most popular in the 1890s, when true color photography was first developed but was still commercially impractical."]}, {"page": "1822 in art", "response": ["*October 7 – Francis Frith, English topographical photographer (died 1898)"]}, {"page": "1898 in art", "response": ["*25 February – Francis Frith, English topographical photographer (born 1822)"]}, {"page": "Ackworth School", "response": ["*Francis Frith (1822–1898), photographer"]}, {"page": "Quietism (Christian philosophy)", "response": ["George Fox came to the conclusion that the only real spirituality was achieved by paying attention to the Holy Spirit (the godhead) through silence, and founded the Quaker movement on this basis – one which shared much resemblance with \"Quietist\" thought. Quietist thinking was also influential among the British Quakers of the later 19th century, when the tract A Reasonable Faith, by Three Friends (William Pollard, Francis Frith and W. E. Turner (1884 and 1886)) caused sharp controversy with evangelicals in the society."]}, {"page": "Frith (surname)", "response": ["* Francis Frith, British photographer"]}, {"page": "Alex Boyd (photographer)", "response": ["In 2011 as part of the Glasgow Film Festival a short film 'Sonnets' about Boyd's work was shown at the GFT. In 2012 Boyd appeared in a BBC series about Victorian photographer Francis Frith alongside presenter John Sergeant, explaining and demonstrating the wet-plate collodion process at Stirling Castle., British Photo History – Alex Boyd on location "]}, {"page": "Negretti and Zambra", "response": ["When the Crystal Palace was re-erected in Sydenham in 1854, Negretti and Zambra became the official photographers of the Crystal Palace Company, which allowed them to photograph the interior and grounds of the new building. The firm made use of this access to produce a number of stereographs. In 1856 Negretti and Zambra sponsored a photographic expedition to Egypt, Nubia and Ethiopia conducted by Francis Frith. More than 500 stereographs of Frith's voyage were produced by the firm between 1857 and 1860."]}, {"page": "Molesey Lock", "response": ["* Photographs of Molesey Lock from the Francis Frith Collection"]}, {"page": "Early photographers of York", "response": ["* Francis Frith"]}, {"page": "Architectural photographers", "response": ["Early architectural photographers include Roger Fenton, Francis Frith (Middle East and Britain), Samuel Bourne (India) and Albert Levy (United States and Europe). They paved the way for the modern speciality of architectural photography. Later architectural photography had practitioners such as Ezra Stoller and Julius Shulman. Stoller worked mainly on the east coast of America, having graduated with a degree in architecture in the 1930s. Shulman, who was based on the West Coast, became an architectural photographer after some images that he had taken of one of Richard Neutra's houses in California made their way onto the architect's desk."]}, {"page": "James Valentine (photographer)", "response": ["His son, William Dobson Valentine (1844-1907), took a course in chemistry at the University of London and trained to be a landscape specialist in the studios of Francis Frith at Reigate, Surrey, the largest English publisher of commercial landscape postcards. He entered the family business in about 1860. He was joined in the enterprise by his brother George D. Valentine (1852-1890).", "Valentine views in the nineteenth century aimed at the national middle and upper class tourist market, with the production of both drawing room albums containing selections of photographs arranged geographically and individual landscape prints. They competed with Francis Frith and George Washington Wilson, who were producing pictures of similar quality. Landscapes were available in a choice of sizes - cabinet, imperial and card. Stereoscopic and magic lantern slides views were also produced. Valentines called themselves 'photographic publishers' and reproduced a great variety of photographic goods as well as the postcards for which they are best known. Subjects concentrated on tourist sights in Scotland, then to England in 1882 and on to fashionable resorts abroad, including Norway, Jamaica, Tangiers, Morocco, Madeira and New Zealand before 1900."]}]}}