{"wiki_id": "http://www.wikidata.org/entity/Q979879", "itemLabel": "Jordan King", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_King", "wikipedia_page": {"main": "Jordan King (born 26 February 1994 in Warwick) is a British racing driver from Harbury, Warwickshire who currently competes in the FIA World Endurance Championship.\nIn 2019, King competed in the FIA Formula 2 Championship, FIA World Endurance Championship in LMP1 and LMP2, and the NTT IndyCar Series. He made debuts in both the Indianapolis 500 and the 24 Hours of Le Mans. He also tested in Formula One, Formula E and the British Touring Car Championship.", "link_mentions": [{"page": "Justin King (businessman)", "response": ["Their son Jordan King is a racing driver, who competed in Formula Three and in Formula 2 until moving to the IndyCar Series for 2018."]}, {"page": "Mark Blundell", "response": ["From 2004, Blundell ran a management company, 2MB Sports Management, with fellow ex-F1 driver and friend Martin Brundle, until Brundle decided to devote more time to his television career. The company represent drivers including McLaren test driver Gary Paffett, British Formula 3 champion and IndyCar driver Mike Conway, Ferrari junior Callum Ilott, BMW backed racer Tom Blomqvist, IndyCar driver Jordan King, British F4 champion Kiern Jewiss and British GT driver Patrick Kibble."]}, {"page": "Rahal Letterman Lanigan Racing", "response": ["In 2018, RLL would re-sign Takuma Sato, who had previously won the 2017 Indianapolis 500 for Andretti Autosport. Sato would score his first win for the team at the 2018 Grand Prix of Portland, and would win twice more in the 2019 Indycar season, at Barber Motorsports Park and World Wide Technology Raceway at Gateway respectively. Sato won his second Indianapolis 500 in 2020, his first with RLL Racing. Rahal finished in 3rd position. The team also ran a third car for the first time in a race 2019 Indianapolis 500, with Jordan King finishing in 24th place.", "|  Jordan King", "| align=\"left\"|  Jordan King (R)"]}, {"page": "David Heinemeier Hansson", "response": ["|align=\"left\"|  Ricky Taylor Jordan King"]}, {"page": "Carlin Motorsport", "response": ["The team has been competing in the British Formula 3 Championship since 1997. The team achieved their first victory with Narain Karthikeyan in 1999 and since 2001, has won 9 championships to become the most successful team in British F3 history. The champions are Takuma Sato (2001), Alan van der Merwe (2003), Álvaro Parente (2005), Jaime Alguersuari (2008), Daniel Ricciardo (2009), Jean-Éric Vergne (2010), Felipe Nasr (2011) Jack Harvey (2012), Jordan King (2013) and Enaam Ahmed (2017).", "In the 2013 FIA European Formula 3 Championship, Harry Tincknell was fifth and Jordan King was sixth. In 2014, Antonio Giovinazzi finished sixth, King seventh and Jake Dennis ninth. In 2015, Giovinazzi was runner-up and George Russell finished sixth. 2016 was a rough year for Carlin as none of its drivers finished in top 10 in the series. "]}]}}