{"wiki_id": "http://www.wikidata.org/entity/Q979175", "itemLabel": "Frank Launder", "itemDescription": "British film director, producer and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Launder", "wikipedia_page": {"main": "Frank Launder (28 January 1906 – 23 February 1997) was a British writer, film director and producer, who made more than 40 films, many of them in collaboration with Sidney Gilliat.", "link_mentions": [{"page": "Deborah Kerr", "response": ["Alexander Korda cast her opposite Robert Donat in Perfect Strangers (1945). The film was a big hit in Britain. So too was the spy comedy drama I See a Dark Stranger (1946), in which she gave a breezy, amusing performance that dominated the action and overshadowed her co-star Trevor Howard. This film was a production of the team of Frank Launder and Sidney Gilliat.", "| 1946 || I See a Dark Stranger || Bridie Quilty || Frank Launder ||"]}, {"page": "Alastair Sim", "response": ["Sim's performance in Scrooge (1951) is considered by many to be the best portrayal of the title character on screen,\"Scrooge\" (1951), Screenonline, retrieved 30 December 2015 and it is among his best known film roles, particularly in the U.S. In the farcical The Belles of St. Trinian's (1954) he played the dual roles of Millicent and Clarence Fritton, the headmistress of St Trinian's and her shady brother. Having originally accepted the part of Clarence, Sim agreed to play in drag as Miss Fritton when Margaret Rutherford proved unavailable, and the director and co-producer, Frank Launder could find no suitable actress as an alternative.Simpson, pp. 121–22 His \"Burke and Hare\" film The Anatomist debuted on British TV (on \"International Theatre\") on Feb. 6, 1956, and was later released theatrically in the U.S. in 1961, leading some reference sources to list it as a 1961 movie.\"The Anatomist\". British Film Institute. Retrieved 3 July 2014."]}, {"page": "Carol Reed", "response": ["The scripts of several of Reed's films in this period were written by Frank Launder and Sidney Gilliat, with the screenwriters and director working for producer Edward Black, who released through the British subsidiary of 20th Century Fox. The best known of these films are probably Night Train to Munich (1940), with Rex Harrison; Kipps (1941), again with Michael Redgrave; and The Young Mr. Pitt (1942), with Robert Donat in the title role, set during the French Revolutionary and Napoleonic Wars."]}, {"page": "1997 in film", "response": ["| style=\"text-align:center;\"| 23 || Frank Launder || style=\"text-align:center;\"| 91 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Screenwriter, Director || "]}, {"page": "1953 in film", "response": ["*Folly to Be Wise, directed by Frank Launder, starring Alastair Sim – (GB)"]}, {"page": "1947 in film", "response": ["*Captain Boycott, directed by Frank Launder, starring Stewart Granger – (GB)"]}, {"page": "1943 in film", "response": ["*Millions Like Us, directed by Sidney Gilliat and Frank Launder – (GB)"]}, {"page": "Jean Simmons", "response": ["Simmons had the lead in Frank Launder's The Blue Lagoon (1949), based on the novel by Henry De Vere Stacpoole and co-produced with Launder's partner Sidney Gilliat, a project originally announced for Lockwood a decade earlier. It was a considerable financial success."]}, {"page": "Terry-Thomas", "response": ["The first of the five films was Brothers in Law, in which Terry-Thomas played the spiv Alfred Green, a performance which was based on Sid Field's characterisation in Piccadilly Hayride. Roy Boulting later recounted that one short scene with Terry-Thomas, Richard Attenborough and Ian Carmichael took 107 takes because of Terry-Thomas's unfamiliarity with filming techniques; he initially struggled to hit his marks, or give his line and move on, while still acting. Filming the scene took two days and Boulting described it as a \"unique experience for him, and had a wonderful after-effect\". Following Brothers in Law he was cast as Romney Carlton-Ricketts in Blue Murder at St Trinian's by producers Frank Launder and Sidney Gilliat, before again appearing for the Boulting brothers in the cameo role of a local policeman in Happy Is the Bride. Terry-Thomas starred in two further films in 1957. The first was as Bertrand Welch in Lucky Jim, an adaptation of the novel of the same name by Kingsley Amis. Although Amis thought Terry-Thomas has been \"totally miscast as Bertrand, the posturing painter and leading shit\" of the book, the critic for The Manchester Guardian considered Terry-Thomas as being \"the nearest to a complete success\" in the film, in a portrayal that \"suggests possibilities for more serious roles\". His final part of 1957 was Lord Henry Mayley in The Naked Truth; this brought him together with Peter Sellers for the first time, and the two of them appeared frequently together over the next few years in scenes in which, Graham McCann considered that each actor's performance \"highlight[ed] what was special about the other\". During one scene Terry-Thomas was dumped in a near-freezing lake, and his health was affected for some time afterwards."]}, {"page": "St Trinian's School", "response": ["In the films the school became embroiled in various shady enterprises, thanks mainly to Flash, and, as a result, was always threatened with closure by the Ministry. (In the last of the original four, this became the \"Ministry of Schools\", possibly because of fears of a libel action from a real Minister of Education.) The first four films form a chronological quartet, and were produced by Frank Launder and Sidney Gilliat. They had earlier produced The Happiest Days of Your Life (1950), a stylistically similar school comedy, starring Alastair Sim, Joyce Grenfell, George Cole, Richard Wattis, Guy Middleton, and Bernadette O'Farrell, all of whom later appeared in the St Trinian's series, often playing similar characters."]}, {"page": "The Rank Organisation", "response": ["A loose collective of film makers was established under the banner of Independent Producers Ltd., employing some of the UK's greatest directors, such as Michael Powell and Emeric Pressburger (Black Narcissus, The Red Shoes, I Know Where I'm Going!), David Lean (Brief Encounter, Great Expectations), Frank Launder and Sidney Gilliat (I See a Dark Stranger, The Blue Lagoon, The Happiest Days of Your Life), Ken Annakin (Holiday Camp) and Muriel Box (The Seventh Veil)."]}, {"page": "Ronald Searle", "response": ["Searle produced an extraordinary volume of work during the 1950s, including drawings for Life, Holiday and Punch. His cartoons appeared in The New Yorker, the Sunday Express and the News Chronicle. He compiled more St Trinian's books, which were based on his sister's school and other girls' schools in Cambridge. He collaborated with Geoffrey Willans on the Molesworth books (Down With Skool!, 1953, and How to be Topp, 1954), and with Alex Atkinson on travel books. In addition to advertisements and posters, Searle drew the title backgrounds of the Sidney Gilliat and Frank Launder film The Happiest Days of Your Life."]}, {"page": "Stewart Granger", "response": ["Granger went over to Rank, for whom he made a series of historical dramas: Captain Boycott (1947), set in Ireland, directed by Frank Launder; Blanche Fury (1948), with Valerie Hobson; and Saraband for Dead Lovers (1948), an Ealing Studios production. Granger was cast as the outsider, the handsome gambler Philip Christoph von Königsmarck who is perceived as 'not quite the ticket' by the established order, the Hanoverian court where the action is mostly set. Granger stated that this was one of his few movies of which he was proud. However it was a disappointment at the box office, as was Blanche Fury."]}, {"page": "The Quatermass Xperiment", "response": ["The Quatermass Experiment was originally a six-part TV serial broadcast by BBC Television in 1953. Written by Nigel Kneale, it was an enormous success with critics and audiences alike, later described by film historian Robert Simpson as \"event television, emptying the streets and pubs\". Among its viewers was Hammer Films producer Anthony Hinds, who was immediately keen to buy the rights for a film version. Incorporated in 1934, Hammer had developed a niche for itself making second features, many of which were adaptations of successful BBC Radio productions. Hammer contacted the BBC on 24 August 1953, two days after the transmission of the final episode, to inquire about the film rights. Nigel Kneale also saw the potential for a film adaptation and, at his urging, the BBC touted the scripts around a number of producers, including the Boulting Brothers and Frank Launder and Sidney Gilliat. Kneale met with Sidney Gilliat to discuss the scripts but Gilliat was reluctant to buy the rights as he felt any film adaptation would inevitably receive an ‘X’ Certificate from the British Board of Film Censors (BBFC), restricting admission to persons over the age of sixteen. Hammer was not so reticent, deciding from the outset that they would deliberately pursue an ‘X’ Certificate. Hammer's offer met some resistance within the BBC, with one executive expressing reservations that The Quatermass Experiment was not suitable material for the company, but the rights were nevertheless sold for an advance of £500."]}, {"page": "Captain Boycott (film)", "response": ["Captain Boycott is a 1947 British historical drama film directed by Frank Launder and starring Stewart Granger, Kathleen Ryan, Mervyn Johns, Alastair Sim and Cecil Parker. Robert Donat makes a cameo appearance as the Irish nationalist leader Charles Stewart Parnell. The film explains how the word boycott appeared in the English language. Ironically, the title character plays a secondary role in the film, as an anti-hero, and the hero of the film is Hugh Davin.", "Category:Films directed by Frank Launder"]}, {"page": "Sidney Gilliat", "response": ["He was the son of George Gilliat, editor of the Evening Standard from 1928 to 1933. Sidney was born in the district of Edgeley in Stockport, Cheshire. In the 1930s he worked as a scriptwriter, most notably with Frank Launder on The Lady Vanishes (1938) for Alfred Hitchcock, and Night Train to Munich (1940), directed by Carol Reed. He and Launder made their directorial debut co-directing the home front drama Millions Like Us (1943). From 1945 he also worked as a producer, starting with The Rake's Progress, which he also wrote and directed. He and Launder made over 40 films together, founding their own production company Individual Pictures. While Launder concentrated on directing their comedies, most famously the four St Trinian's School films, Gilliat showed a preference for comedy-thrillers and dramas, including Green for Danger (1946), London Belongs to Me (1948) and State Secret (1950).", "Gillat's first major credit as a screenwriter was Rome Express (1932) directed by Forde.  He and Frank Launder worked on the script for Facing the Music (1933) but they did not actually work together.", "===Frank Launder===", "Instead Gilliat directed The Story of Gilbert and Sullivan (1953), then Launder did The Belles of St. Trinian's (1954). The film starred George Cole who later said working for the team meant \"good scripts but terrible money. If Alastair was in the film it was even worse because he got most of it. But they were wonderful people to work with.\"Obituary: Frank Launder", "His obituary in The Times described his and Frank Launder's collaboration as 'one of the most sparkling writing, directing and producing partnerships in postwar British cinema.'"]}, {"page": "The Pure Hell of St Trinian's", "response": ["The Pure Hell of St Trinian's is a 1960 British comedy film set in the fictional St Trinian's School.  Directed by Frank Launder and written by him and Sidney Gilliat, it was the third in a series of four films.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "The Belles of St. Trinian's", "response": ["The Belles of St Trinian's is a British comedy film set in the fictional St Trinian's school, released in 1954. It and its sequels were inspired by British cartoonist Ronald Searle. Directed by Frank Launder and written by Launder and Sidney Gilliat, it was the first of a series of four films.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "Blue Murder at St Trinian's", "response": ["Blue Murder at St Trinian's is a 1957 British comedy film set in the fictional St Trinian's School. Directed by Frank Launder and written by him and Sidney Gilliat, it was the second of the series of four films. The film stars Terry-Thomas, George Cole, Joyce Grenfell, Lionel Jeffries and Richard Wattis.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "The Great St Trinian's Train Robbery", "response": ["The Great St. Trinian's Train Robbery is a British comedy film, directed by Frank Launder and Sidney Gilliat, written by Sidney and Leslie Gilliat, and released on 4 April 1966. It is the last of the original series of films based on the St Trinian's School set of images and comics, and the only one to be produced in colour. The film stars a selection of actors from previous films in the series, including George Cole, Richard Wattis, Eric Barker, Michael Ripper, and Raymond Huntley, alongside Frankie Howerd, Reg Varney, Dora Bryan, and the voice of Stratford Johns.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "BFI Top 100 British films", "response": ["| 94 || The Belles of St Trinian's  || 1954 || Frank Launder"]}, {"page": "Frank launder", "response": ["#REDIRECT Frank Launder"]}, {"page": "Bill Travers", "response": ["Travers breakthrough came when he was cast in the title role of Geordie (1955), directed by Frank Launder. This was popular in Britain and the US and saw him contracted by Metro-Goldwyn-Mayer, which thought he was going to be a big star and brought him to Hollywood. "]}, {"page": "The Blue Lagoon (1949 film)", "response": ["The Blue Lagoon is a 1949 British coming-of-age romance and adventure film directed and co-produced by Frank Launder (with Sidney Gilliat) and starring Jean Simmons and Donald Houston. The screenplay was adapted by John Baines, Michael Hogan, and Frank Launder from the 1908 novel The Blue Lagoon by Henry De Vere Stacpoole. The original music score was composed by Clifton Parker and the cinematography was by Geoffrey Unsworth.", "He did not make the film, though, and sold the rights to Gainsborough Pictures at the recommendation of Frank Launder, who always admired the novel. Gainsborough announced the film in 1938 as part of a slate of 10 films. The stars were to be Michael Redgrave and Margaret Lockwood, who had just appeared in Gainsborough's The Lady Vanishes; Will Fyffe was to co-star. In 1939, it was announced Gainsborough would make the film as a co-production with 20th Century Fox and that Lockwood would co-star with Richard Greene, under contract to Fox. Plans to make the film were postponed due to the war.", "The project was reactivated after the war and announced in 1947 with Frank Launder attached to direct. Extensive location searches were undertaken before deciding to make the movie in Fiji.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "The Blue Lagoon (novel)", "response": ["*The Blue Lagoon (1949), directed by Frank Launder, starring Jean Simmons and Donald Houston"]}, {"page": "Green for Danger (film)", "response": ["In December 1945 the film was announced as a project for Individual Pictures, the company of Gilliat and Frank Launder.NOTES FROM LONDON'S FILM STUDIOS: Thriller What, No Love Affair?", "The film has also been highly praised by critics. The Monthly Film Bulletin said: \"Though the story has plenty of improbabilities when considered in cold blood, this thriller holds one well when on the screen. Alastair Sim is most amusing as the self-important detective who enjoys tormenting his suspects, but who comes a partial cropper despite his assurance.\"Volume 14, No.157, January 1947, page 3 at Monthly Film Bulletin Leslie Halliwell noted that it was a \"classic comedy-thriller, with serious detection balanced by excellent jokes and performances, also by moments of fright\".Halliwell's Film and Video Guide 1999 (1999), ed. J.Walker, p. 338  François Truffaut later argued the film \"didn't quite come off\". The New York Times stated: \"Sidney Gilliat and Frank Launder have laid deftly humorous hands on the subject of murder. And, while they manage to keep the spectator chuckling most of the time, they never for a moment lose sight of a mystery film's prime purpose—that is, to intrigue and startle the onlooker.What more could one ask? In the case of Green For Danger one could reasonably request just a bit more justification for the solution, which, truth to tell, is bewildering.\"{{cite web |url=https://www.nytimes.com/1947/08/08/archives/green-for-danger-new-british-mystery-with-alastair-sim-as-detective.html |title=' Green for Danger,' New British Mystery, With Alastair Sim as Detective, Bill at Winter Garden -- Musical at the Globe |date=August 8, 1947", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "Leslie Halliwell", "response": ["In 1982, at the invitation of Jeremy Isaacs, he became buyer and scheduler of US films for Channel 4. In keeping with the channel's intention to appeal to specialist audiences, Halliwell focused primarily on the 1930s and '40s. Over the next few years the channel showed hundreds of vintage movies in seasons, with many titles introduced by film-makers such as Samuel Goldwyn Jnr, Frank Launder and Sidney Gilliat. Cinema fans and critics alike greatly appreciated Halliwell's efforts, with Jeremy Isaacs saying he had made an 'unsurpassed contribution' to the channel's success.Book Storm Over 4: A Personal Account by Jeremy Isaacs. Halliwell had regular columns in the TV Times and See 4 magazines in 1984/85, in which he publicised upcoming films and responded to reader questions and requests. The British Film Institute gave Halliwell an award in 1985 'for the selection and acquisition of films with a view to creative scheduling.' Author and film historian Jeffrey Richards wrote:"]}, {"page": "Basil Radford", "response": ["Radford first appeared with Naunton Wayne as their characters Charters and Caldicott in Alfred Hitchcock's 1938 thriller The Lady Vanishes. They were popular enough to reprise their roles in Night Train to Munich, which was again scripted by Frank Launder and Sidney Gilliat."]}, {"page": "Belinda Lee", "response": ["Lee was cast as a lead in only her fourth film, Hammer Pictures' Murder by Proxy (1954), with Dane Clark, shot in late 1953, and released in the US by Lippert Pictures.  She had an eye-catching role in The Belles of St. Trinian's (1954), a hugely popular comedy from Frank Launder, at British Lion, where she seduced a jockey (Michael Ripper), in order to get information.", "* The Belles of St. Trinian's (1954) – comedy directed by Frank Launder"]}, {"page": "Night Train to Munich", "response": ["Night Train to Munich is a 1940 British-American thriller film directed by Carol Reed and starring Margaret Lockwood and Rex Harrison. Written by Sidney Gilliat and Frank Launder, based on the 1939 short story Report on a Fugitive by Gordon Wellesley, the film is about an inventor and his daughter who are kidnapped by the Gestapo after the Nazis march into Prague in the prelude to the Second World War. A British secret service agent follows them, disguised as a senior German army officer pretending to woo the daughter over to the Nazi cause."]}, {"page": "Charles Lloyd-Pack", "response": ["| 1957 || Blue Murder at St Trinian's || Henry Roberts Prison Governor|| Frank Launder ||"]}, {"page": "The Happiest Days of Your Life (film)", "response": ["The Happiest Days of Your Life is a 1950 British comedy film directed by Frank Launder, based on the 1947 play of the same name by John Dighton. The two men also wrote the screenplay. It is one of a stable of classic British film comedies produced by Frank Launder and Sidney Gilliat for British Lion Film Corporation. The film was made on location in Liss and at Riverside Studios, London. In several respects, including some common casting, it was a precursor of St. Trinian's films of the 1950s and 1960s.", "Category:Films with screenplays by Frank Launder and Sidney Gilliat", "Category:Films directed by Frank Launder"]}, {"page": "John McCallum (actor)", "response": ["Because there were limited theatrical choices in Australia, McCallum returned to Britain. He tested for a small part in The Root of All Evil (1947) and was given the second male lead. He was also in The Loves of Joanna Godden (1947) and It Always Rains on Sunday (1947). Both starred Googie Withers, whom McCallum married in 1948. McCallum then made The Calendar (1948); Miranda (1948), a popular comedy with Glynis Johns and Withers; A Boy, a Girl and a Bike (1948), directed by fellow Australian Ralph Smart; The Woman in Question (1950) with Jean Kent and Dirk Bogarde; Valley of Eagles (1951); Lady Godiva Rides Again (1951) from director Frank Launder; The Magic Box (1951), one of many cameos; The Long Memory (1952) with John Mills. He did two for Herbert Wilcox, Trent's Last Case (1952) with Margaret Lockwood and Derby Day (1952) with Anna Neagle and Withers. McCallum was in the biopic Melba (1953), then made Trouble in the Glen (1954) for Wilcox. He and Withers teamed for Devil on Horseback (1954) and Port of Escape (1956). He returned to Australia to play a role in Smiley (1956)."]}, {"page": "Castaway", "response": ["|Frank Launder"]}, {"page": "Waterloo Road (film)", "response": ["Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "List of films condemned by the Legion of Decency", "response": ["* The Blue Lagoon, a British import from director Frank Launder, starring Jean Simmons, condemned as \"too shocking and almost pornographic\". Universal-International cut 15 minutes for its U.S. release to satisfy the Legion of Decency."]}, {"page": "Lady Godiva Rides Again", "response": ["The film was inspired by the Miss Kent 1950 beauty competition held at Leas Cliff Hall in Kent. Frank Launder, joint producer of the film with Leslie Gilliatt, was one of the judges in the competition.  Audrey Hepburn tested for the title role but was judged too thin.", "Category:Films directed by Frank Launder"]}, {"page": "List of World War II films", "response": ["|Frank Launder, Sidney Gilliat", "|Frank Launder"]}, {"page": "Paul Verhoeven (German director)", "response": ["* 1965: Vor Nachbarn wird gewarnt — (based on the play Meet a Body by Frank Launder and Sidney Gilliat)"]}, {"page": "Geordie (film)", "response": ["Geordie (released in the United States as Wee Geordie) is a 1955 British film directed and co-produced by Frank Launder, with Bill Travers in the title role as a Scotsman who becomes an athlete and competes at the 1956 Summer Olympics in Melbourne.", "Category:Films directed by Frank Launder", "Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}, {"page": "John Dighton", "response": ["Two of his more popular stage plays, The Happiest Days of Your Life and Who Goes There! (known as The Passionate Sentry in the USA), were successfully adapted for the screen by Dighton himself, the former in collaboration with Frank Launder. He also wrote the 1955 comedy play Man Alive! that transferred to the West End the following year with Robertson Hare in the lead."]}, {"page": "The Rake's Progress (film)", "response": ["Category:Films with screenplays by Frank Launder and Sidney Gilliat"]}]}}