{"wiki_id": "http://www.wikidata.org/entity/Q979325", "itemLabel": "Edgar Evans", "itemDescription": "Welsh explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edgar_Evans", "wikipedia_page": {"main": "Petty Officer Edgar Evans (7 March 1876 – 17 February 1912) was a Welsh naval seaman and member of the \"Polar Party\" in Robert Falcon Scott's ill-fated Terra Nova Expedition to the South Pole in 1911–1912.  This group of five men, personally selected for the final expedition push, attained the Pole on 17 January 1912. The party perished as they attempted to return to the base camp.", "link_mentions": [{"page": "February 17", "response": ["*1912 – Edgar Evans, Welsh sailor and explorer (b. 1876)"]}, {"page": "Robert Falcon Scott", "response": ["The deflated party began the 862 mile (1387 km) return journey on 19 January. \"I'm afraid the return journey is going to be dreadfully tiring and monotonous\", wrote Scott on that day.Scott's diary, 19 January 1912 The party made good progress despite poor weather, and had completed the Polar Plateau stage of their journey, approximately 300 miles (483 km), by 7 February. In the following days, as the party made the 100 mile (161 km) descent of the Beardmore Glacier, the physical condition of Edgar Evans, which Scott had noted with concern as early as 23 January, declined sharply. A fall on 4 February had left Evans \"dull and incapable,\" and on 17 February, after another fall, he died near the glacier foot. With 400 miles (644 km) still to travel across the Ross Ice Shelf, Scott's party's prospects steadily worsened as, with deteriorating weather, a puzzling lack of fuel in the depots, hunger and exhaustion, they struggled northward.", "The response to Scott's final plea on behalf of the dependents of the dead was enormous by the standards of the day. The Mansion House Scott Memorial Fund closed at . This was not equally distributed; Scott's widow, son, mother and sisters received a total of . Wilson's widow received  and Bowers's mother received . Edgar Evans's widow, children, and mother received  between them."]}, {"page": "1912", "response": ["** Edgar Evans, Welsh naval officer, member of the Scott expedition to the South Pole (b. 1876)"]}, {"page": "1876", "response": ["* March 7 – Edgar Evans, Welsh naval seaman and polar explorer (d. 1912)"]}]}}