{"wiki_id": "http://www.wikidata.org/entity/Q981455", "itemLabel": "Thomas Henry Ismay", "itemDescription": "British businessman (1837-1899)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Henry_Ismay", "wikipedia_page": {"main": "Thomas Henry Ismay (7 January 1837 – 23 November 1899) was the founder of the Oceanic Steam Navigation Company, more commonly known as the White Star Line. His son Joseph Bruce Ismay was managing director of the White Star Line and in 1912 sailed on the maiden voyage of the ocean liner RMS Titanic.", "link_mentions": [{"page": "January 7", "response": ["*1837 – Thomas Henry Ismay, English businessman, founded the White Star Line Shipping Company (d. 1899)"]}, {"page": "November 23", "response": ["*1899 – Thomas Henry Ismay, English businessman, founded White Star Line (b. 1837)"]}, {"page": "1899", "response": ["* November 23 – Thomas Henry Ismay, British owner of the White Star Line (b. 1837)"]}, {"page": "1837", "response": ["* January 7 – Thomas Henry Ismay, English shipowner (White Star Line) (d. 1899)"]}, {"page": "RMS Olympic", "response": ["On 29 July 1908, Harland and Wolff presented the drawings to Bruce Ismay and other White Star Line executives. Ismay approved the design and signed three \"letters of agreement\" two days later authorising the start of construction. At this point the first ship – which was later to become Olympic – had no name, but was referred to simply as \"Number 400\", as it was Harland and Wolff's four hundredth hull. Titanic was based on a revised version of the same design and was given the number 401. Bruce Ismay's father Thomas Henry Ismay had previously planned to build a ship named Olympic as a sister ship to . The senior Ismay died in 1899 and the order for the ship was cancelled.Oceanic II  – thegreatoceanliners.com"]}, {"page": "Freedom of the City", "response": ["Recipients of this honour have included athlete Mary Peters,\"Dame Mary Peters granted Freedom of Belfast\". BBC News. 2 November 2012. actor Kenneth Branagh, diplomat John Jordan, industrialist Andrew Carnegie, shipowner Thomas Henry Ismay and Prime Minister Winston Churchill."]}, {"page": "Maryport", "response": ["*Thomas Henry Ismay, founder of the White Star Line shipping company"]}, {"page": "Ismay", "response": ["*Thomas Henry Ismay, father of Bruce, and founder of White Star Line"]}, {"page": "Oceanic (unfinished ship)", "response": ["On 14 April 1927, construction of a fleetmate Britannic began in Harland & Wolff. Britannic was a smaller version of the proposed liner, but of similar design. However, it was not until June 18, 1928 that a contract was signed to built the proposed liner, construction began ten days later. The liner was to be named Oceanic, in reference to the very first liner put into service by the company after its purchase by Thomas Henry Ismay in 1871. Estimates gave it a length of over 300 meters (1,010 feet), 60,000 gross register tons, and a cost of £3.5 million, making it the largest liner ever built and the first to exceed the symbolic 1,000-foot mark. Construction of the ship's keel began with great fanfare ten days after the contract was signed.. If the only existing plans of the ship remained sketchy and only allowed for understanding the general arrangement, they did give an idea of the capacity of the liner, designed to carry 722 passengers in first class, 464 in second, and 1,096 in third, and also 240 interchangeable seats between first and second class, and 286 between second and third, for a total of 2,808 passengers.White Star's Proposed MV Oceanic III"]}, {"page": "Iwerne Minster", "response": ["Iwerne Minster House was built in 1796 by the Bowyer Bower family (who had owned the village and estate of Iwerne Minster since at least 1645), on the site of their original manor. Their family crest, the Talbot, is still represented in the name of the village pub. Iwerne Minster remained in the Bowyer Bower family until 1876, when they sold the estate to George Glyn, 2nd Baron Wolverton. Wolverton had a new house built, designed by Alfred Waterhouse and completed in 1878. A  ornamental park, including a lake, was also created. James Hainsworth Ismay, second son of Thomas Henry Ismay, bought the estate in 1908; he had a village hall, pump and shelter built, designed clothes for the village children and gave the village shops hand-painted signs, all resulting in the village having a 'model' appearance. The estate was sold in 1929 and the mansion became Clayesmore School. "]}, {"page": "Thomas Ismay", "response": ["#redirect Thomas Henry Ismay"]}, {"page": "SS Atlantic (1870)", "response": ["Today, most of the ship lies heavily fragmented under  of water. Artifacts recovered from several salvage operations are on display at the Maritime Museum of the Atlantic in Halifax, Nova Scotia and also at the SS Atlantic Heritage Park and Interpretation Centre, in Terence Bay, Nova Scotia. A monument to the wreck, donated by ship owner Thomas Henry Ismay's family, is located at the mass grave near the interpretation centre in the Terence Bay Anglican Cemetery, while a smaller monument marks a second mass grave at the Catholic cemetery."]}, {"page": "RMS Baltic (1903)", "response": ["In the late 1890s and shortly before his death, Thomas Henry Ismay, chairman of the White Star Line, initiated a policy shift away from the race for speed to focus on slower but larger ships, compensating for the loss of speed through great savings, increased comfort, and better passenger capacity. This initiative gave rise, in 1901, to the ordering of a first unit of the series of liners dubbed the \"Big Four\": the Celtic, followed two years later by the Cedric. When the latter was launched, a third ship was just under construction at the Harland and Wolff shipyards in Belfast: the Baltic (the quartet to be completed in 1907 by the Adriatic). She was the second ship to bear this name (in reference to the Baltic Sea) in the company's fleet; the first having been one of its very first liners, in the 1870s."]}, {"page": "J. Bruce Ismay", "response": ["Ismay was born in Crosby, Lancashire. He was the son of Thomas Henry Ismay (7 January 1837 – 23 November 1899) and Margaret Bruce (13 April 1837 – 9 April 1907), daughter of ship-owner Luke Bruce. Thomas Ismay was the senior partner in Ismay, Imrie and Company and the founder of the White Star Line. The younger Ismay was educated at Elstree School and Harrow, then tutored in France for a year. He was apprenticed at his father's office for 4 years, after which he toured the world. He then went to New York City as the company representative, eventually rising to the rank of agent. Bruce was one of the founding team of Liverpool Ramblers football club in 1882."]}, {"page": "1837 in the United Kingdom", "response": ["* 7 January – Thomas Henry Ismay, shipowner (died 1899)"]}, {"page": "RMS Celtic (1901)", "response": ["RMS Celtic was an ocean liner owned by the White Star Line. The first ship larger than  by gross register tonnage (it was also  longer), Celtic was the first of a quartet of ships over 20,000 tons, the dubbed The Big Four.*  She was the last ship ordered by Thomas Henry Ismay before his death in 1899. The second liner of her name (the first was completed in 1872) she was put into service in 1901. Her large size (she could carry nearly 3,000 passengers) and her low but economical speed (, while her contemporary liners then sailed on average at ) inaugurated a new company policy aiming to favor size, luxury and comfort, to the detriment of speed.", "Celtic was the last liner ordered during Thomas Henry Ismay's lifetime. On the death of Ismay, all the efforts of the Harland & Wolff yards in Belfast were turned towards Celtic. The liner met all new objectives: with it, the company definitively abandoned the race for speed and never again seeks to win the prestigious Blue Riband, favoring stability, comfort and savings. If this change was really inaugurated by Celtic, it was already tested on a smaller scale a few years ago on Cymric. The success of the formula was enough for White Star to draw its new guideline for the next three decades, up until its demise."]}, {"page": "RMS Adriatic (1906)", "response": ["At the end of the 19th century, White Star Line, under the leadership of Thomas Henry Ismay, changed its policy to embark on the construction of ships which no longer sought to dominate in the area of speed, but to transport passengers en masse and regularly on spacious and comfortable liners. This resulted in the commissioning of the Big Four, four large, moderate-speed liners ordered at the start of the new century. The first, the Celtic, entered service in 1901, followed by the Cedric in 1903 and the Baltic in 1904. The fourth ship in the series, the Adriatic, was ordered from Harland and Wolff shipyards in Belfast in December 1903, but she wasn't completed until May 1907, a strangely long delay. This delay could be explained by the fact that the shipyards were building the Amerika at the same time, with a similar profile. Harland and Wolff built Adriatic on slipway number three of its North Yard in Belfast, Ireland."]}, {"page": "SS Republic (1871)", "response": ["When Thomas Henry Ismay established White Star Line in 1867, he came to an agreement with Gustav Christian Schwabe in return for financial assistance. Ismay promised to build the company's future ships in Harland and Wolff's shipyards in Belfast, which had been founded by Schwabe's nephew Gustav Wilhelm Wolff. Four ships were originally commissioned to form the Oceanic class, but this was later expanded to six. Republic was the fourth ship of the class and was launched on 4 July 1871; its name notes the date it was launched was Independence Day in the United States."]}, {"page": "Clayesmore School", "response": ["In 1904 the 4th Baron Wolverton put the whole  estate up for sale. This was bought in 1908 by James Ismay whose father, Thomas Henry Ismay, had founded the White Star Line shipping company. On Ismay's death in January 1930 the estate was put up for sale in a number of separate lots. Clayesmore bought the main manor house and the  in which it stands and the school moved in during 1933."]}, {"page": "1899 in the United Kingdom", "response": ["* 23 November – Thomas Henry Ismay, shipowner (White Star Line) (born 1837)"]}, {"page": "TH Ismay", "response": ["#REDIRECT Thomas Henry Ismay "]}, {"page": "St Bartholomew's Church, Thurstaston", "response": ["The earliest mention of a church on the site is around 1125 although other evidence suggests that a church was present in Anglo-Saxon times. In 1724 the Norman church was described as being a \"mean building extremely small, low and dark\". The church was taken down in 1820, and a new church was completed in 1824. This church was in turn dismantled, although its tower still stands. The new church was designed by J. Loughborough Pearson, and was consecrated in 1886. A lychgate was erected in memory of Thomas Henry Ismay of Dawpool in 1900.", "Near the church is the tower of the previous church which is dated 1824. It is built in three stages with an embattled parapet and is a Grade II listed building. In the churchyard is a stone sundial dated 1844 which is also listed at Grade II. Also in the churchyard is a 17th-century stone font with an octagonal bowl and a rounded stem, and the ancient stone coffin lid of a child. In addition the churchyard contains the war graves of a World War I Middlesex Regiment officer, and an airman, Royal Engineers soldier and Lancashire Fusiliers officer of World War II. The tomb of Thomas Henry Ismay (1837–99), founder of the White Star Line, stands close to the old tower. It was designed by Richard Norman Shaw."]}, {"page": "Edward Harland", "response": ["Edward Harland's new company quickly attracted an order of three boats from John Bibby & Sons. These boats were named Venetian, Sicilian and Syrian; the current company's order book still has the three boats listed as No. 1, No. 2 and No. 3. Impressed with the boats, Bibby ordered six more boats from Harland in 1860. The boats that Edward Harland designed were long, had a narrow beam and were flat-bottomed; the boats became known as \"Bibby's coffins\". On 26 January 1860, Harland married Rosa Matilda Wann, of Vermont, Belfast, who was the daughter of Thomas Wann, a stockbroker and insurance agent. In 1861, Harland chose the 27-year-old Gustav Wilhelm Wolff, his former personal assistant, to become a partner in the firm, forming Harland and Wolff. Harland's company had a prosperous relationship with Thomas Henry Ismay's White Star Line, a prominent shipping company, ensuring regular orders and financial success. Harland's designing skills created ships with flatter bottoms and squarer bilges to increase capacity. According to Edward Harland's obituary in The Times, he designed his company's ocean liners \"on the model of a fish swimming through the water.\" Harland's company received orders during the American Civil War from the Confederate States of America, who bought fast steamers to evade the Union blockade. In 1874 Edward Harland recruited William James Pirrie, a former apprentice at the company as a partner; Pirrie later became chairman of the company, and was given the task of finding buyers and negotiating deals. Harland was once asked the nature of the three men's business relationship and replied:  Harland applied for several patents including, in 1860 for \"improvements in constructing and covering the decks of ships and other floating bodies\", in 1871 for \"improvements in apparatus for propelling vessels\", in 1878 for \"improvements in screw-propellers.\" In 1880 Harland and his two partners decided to expand further and built their own engine works. Harland began having less involvement in the running of the shipyard, and in 1889 he retired from daily involvement in the business."]}, {"page": "Gustav Christian Schwabe", "response": ["In May 1842, Schwabe married Helen Dugdale, who was from the Wirral. Her father was John Dugdale, a businessman in Liverpool and Manchester. Schwabe then entered a partnership with his father-in-law, Benjamin Rutter, and Adam Sykes, forming the merchant company Sykes, Schwabe & Co. On 31 December 1853, the partnership was dissolved.  In the 1840s, Schwabe became a junior partner in John Bibby & Sons, a shipping company based in Liverpool. Around the same period, Schwabe met Edward Harland during Harland's apprenticeship in Newcastle upon Tyne at Robert Stephenson and Company. Schwabe arranged for Harland to be employed at the marine engineers J. & G. Thomson, who were building ships for John Bibby & Sons. Gustav Wilhelm Wolff, Schwabe's nephew, who would later go into partnership with Harland, left Hamburg in 1849 to live with Schwabe in Liverpool. In 1858, Schwabe financially assisted Edward Harland's purchase of Robert Hickson's shipyard at Queen's Island, Belfast. Schwabe, with Thomas Henry Ismay, purchased the bankrupt White Star Line in 1867. In 1869, during a game of billiards, Gustav Schwabe made a deal with Thomas Henry Ismay to finance the White Star Line, provided that the White Star Line would buy its ships from Harland and Wolff. Schwabe also convinced Ismay to compete with Cunard in North Atlantic passenger shipping. Schwabe also financially supported Albert Ballin, the managing director of the Hamburg America Line."]}, {"page": "Newsham Park Hospital", "response": ["Some of the generous donors where - Sir Alfred Lewis Jones, Robert G Allan, James H Allan, Thomas Henry Ismay, Mr Justice Bigham, Arthur Earle, Sir William Bower Forwood, Ralph Brocklebank, Richard M Brocklebank, Thomas Brocklebank, Edward H Cookson, Mr George Holt, Sir Francis Henderson, Alfred David Jardine, William Johnston, James Lister, Alfred T Parker, Evelyn Parker, John Rankin, William H Shirley, Robert Singlehurst, Samuel Smith, Stephenson an old pupil, Sir Peter Walker, Mr and Mrs George Henry Warren, Mrs Mary Jane Titterington Legacy, Mr James Wood and Sir Robert Houston to name but a few."]}, {"page": "Henry Chandos Pole Gell", "response": ["Gell had five daughters with his first wife who died in 1868. He married the following year Teresa Charlotte Manningham-Buller, daughter of Sir Edward Manningham-Buller, 1st Baronet, of Dilhorne Hall, Staffordshire. They had a son, Harry Anthony Chandos-Pole-Gell (1872-1934), who became a Brigadier-General and relinquished the surname Gell in the 1930s. Harry Chandos-Pole-Gell was married to Ada Ismay, the daughter of Thomas Henry Ismay."]}, {"page": "Netherhall School, Maryport", "response": ["Each year group is split into a number of tutor groups. These tutor groups are traditionally named after the notable people of Maryport. These are Adair, Christian (Fletcher Christian), Fleming (Sir George Fleming, 2nd Baronet), Ismay (Thomas Henry Ismay), Lister and Senhouse (Humphrey Senhouse)."]}, {"page": "SS Doric (1883)", "response": ["The ship was constructed by Harland and Wolff in Belfast and was launched in 1883. Doric was the sister ship to the . These were enlarged versions of two ships commissioned in 1881, the Arabic and the Coptic. The ship was constructed of steel, a first for the ship building company, whose previous designs had been constructed only in iron. The vessel was the first White Star Line ship to bear the name Doric, with a later vessel built in 1923 also sharing the name. The Doric was launched on 10 March, 1883; with her sister ship twin, launched two months earlier. She is one of the first ships whose machines were built by the shipyards themselves. These were, until then, built by outside workshops. On the following 4 July, the ship left Belfast for London, making a stopover at Holyhead to embark Thomas Henry Ismay, president of the White Star Line, and several dignitaries accompanying him to visit the ship."]}, {"page": "SS Belgic (1873)", "response": ["When it acquired this ship, White Star Line had been trying somehow to establish, since the end of 1872, a service to South America, briefly inaugurated with the Republic, the Asiatic and the Tropic. It was within this framework that the Belgic left, on 29 March 1873, for her maiden voyage between Liverpool and Valparaiso. By this time, however, Thomas Henry Ismay and his associates had already abandoned the idea of having their larger ships frequented this route and were gradually withdrawing from it. The Belgic was the last steamship to remain there, until December 1873, after which the company only operated sailboats there. The Belgic was then moved to the route between Liverpool and New York, on which she made a single crossing in May 1874 before being moved with the Gaelic to the London to New York route. It was during her first crossing on this route that she rescued the Spanish steamer Tornas, which had broken down, and towed her to America."]}, {"page": "Occidental and Oriental Steamship Company", "response": ["Bradbury immediately travelled to London in search of charter contracts. He had a meeting in October 1874 with the chairman of the White Star Line, Thomas Henry Ismay, which lead to a two-year charter agreement for three vessels: two cargo-liners, the  and the ; also the , the first luxury liner of the company, which had become redundant on the North Atlantic route. This last ship providing the Occidental and Oriental Steamship Company with a prestige vessel for its service. With great pomp, the Oceanic left Liverpool for Hong Kong, to commence operations on its new route with a stop in Yokohama en route to San Francisco. It set a Pacific crossing record of 16 days and 10 hours, 8 days less than the ships of the Pacific Mail. In 1876 it reduced that to 14 days and 15 hours. This success laid the foundations of a long collaboration between the two companies, White Star supplying British officers while O&O provided the Chinese crews."]}, {"page": "Geoffrey Drage", "response": ["In 1896 he married Ethel Sealby Ismay, the daughter of Thomas Henry Ismay who founded the White Star Line. They had two sons, one of whom, Charles Hardinge Drage (1897–1983), served in the Royal Navy, attaining the rank of Commander, and in later years wrote a number of biographies."]}]}}