{"wiki_id": "http://www.wikidata.org/entity/Q981695", "itemLabel": "Albert Scanlon", "itemDescription": "English footballer (1935-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Albert_Scanlon", "wikipedia_page": {"main": "Albert Joseph Scanlon (10 October 1935 – 22 December 2009) was an English footballer. He began his career with Manchester United and was one of the \"Busby Babes\" who survived the Munich air disaster of 1958. Although he sustained severe injuries, he recovered and continued to play league football for Newcastle United, Lincoln City and Mansfield Town. He then went on to play non-league football until his retirement.", "link_mentions": [{"page": "December 22", "response": ["*  2009   – Albert Scanlon, English footballer (b. 1935)"]}, {"page": "Munich air disaster", "response": ["*Albert Scanlon (died 2009)", "On 10 January 2006, the BBC showed a drama/documentary retelling the story in the series Surviving Disaster. The programme was met with criticism from former United winger Albert Scanlon, who claimed that it was full of inaccuracies, despite the production having consulted him about the content of the documentary. Errors in the programme included the depiction of Jimmy Murphy giving a pre-match team talk in Belgrade, despite him being in Cardiff at the time, and the plane being shown as only half full when nearly every seat was occupied."]}, {"page": "Matt Busby", "response": ["By 1952, however, the side captained by Johnny Carey, was beginning to show its age, and a new set of players had to be found. Busby, who had achieved a great deal of success in spite of his lack of previous managerial experience, was expected to spend large sums of money on high-profile players. Instead, he gradually replaced the older players with players as young as 16 and 17. These included right-back Bill Foulkes, centre-halves Mark Jones and Jackie Blanchflower, wingers Albert Scanlon and David Pegg and forward Billy Whelan. Among them was Duncan Edwards, judged by many to be England's finest player of his era, and capped by England at 17 – setting a record for the youngest-ever full international that remained unbroken for more than 40 years. He made relatively few signings from other clubs between 1951 and 1957, rare examples being winger Johnny Berry, forward Tommy Taylor and goalkeeper Harry Gregg."]}, {"page": "David Pegg", "response": ["He was the club's first-choice outside left until the final few months before the disaster (when he was displaced by Albert Scanlon) and had collected two League Championship winner's medals in the two seasons leading up to the Munich air disaster. He also helped them reach the European Cup semi-finals twice. His performance against Real Madrid in the 1956-57 semi-finals reportedly inspired the Spanish giants to sign a new left-back specifically to combat Pegg's talents in the future, although his death less than a year later meant that he never played against them again."]}, {"page": "Hulme", "response": ["Albert Scanlon, who played as a winger for Manchester United between 1950 and 1960 and was a survivor of the Munich air disaster in 1958, was born in Hulme in 1935. Jonathan Nall, the first secretary of Hulme Athenaeum's association football club, was born and raised in Hulme and went on to become a significant promoter of the game in Manchester and a president of the Manchester Football Association. Description."]}, {"page": "Bill Foulkes", "response": ["On the return journey to Manchester on 6 February 1958, the British European Airways aircraft that the team was on stopped at Munich to refuel. Because of boost surging, takeoff was aborted twice. The pilot returned to the terminal, and after a while, it was announced that one more attempt to take off would be made. At that time, Foulkes had been running a card school with Kenny Morgans, David Pegg, Albert Scanlon, Roger Byrne and Liam Whelan in the middle of the plane. When he heard the announcement, he started to worry for his safety. In a 1998 interview with Carling-Net, he said of the announcement, \"When they said that you didn't have to be a genius to know that this was going to be a bit dicey.\"", "Foulkes died at the age of 81 in Manchester on 25 November 2013.Busby Babe Bill Foulkes dies, aged 81 BBC Sport, 25 November 2013; Retrieved 25 November 2013 He had reportedly been suffering from Alzheimer's disease during the final few years of his life.Bill Foulkes: Sir Bobby Charlton pays tribute The Scotsman, 12 December 2013 His last appearance in public was almost four years earlier at the funeral of Albert Scanlon, another United player who survived the Munich crash. He is not believed to have attended the funeral of Kenny Morgans, another survivor of the crash, in November 2012."]}, {"page": "Shay Brennan", "response": ["His first game for the club came in an FA Cup match against Sheffield Wednesday on 19 February 1958; this was United's first game after the Munich air disaster and Brennan scored twice on an emotionally charged night. He was playing as an outside-left in this game, the position left vacant following the death of David Pegg and the injuries to Albert Scanlon in the crash."]}, {"page": "Scanlon", "response": ["* Albert Scanlon (1935–2009), English soccer player"]}, {"page": "Charlie Mitten", "response": ["His nephew Albert Scanlon (1935–2009), signed for Manchester United soon after Mitten's departure in the early 1950s and remained with the club until 1960. He was a survivor of the Munich air disaster.", "| Href=\"Albert Scanlon\" |23"]}, {"page": "Busby Babes", "response": ["Other notable \"Busby Babes\" include full-back Bill Foulkes, wingers Kenny Morgans and Albert Scanlon, forward Dennis Viollet, wing-half Wilf McGuinness (who later became manager of Manchester United) and forwards John Doherty, Colin Webster and Eddie Lewis. McGuinness and Webster were not on the plane when it crashed at Munich, whereas Doherty had just been sold to Leicester City.", "Harry Gregg had left the club in the 1966–67 season, signing for Stoke City, who had signed Dennis Viollet from United five seasons earlier. Kenny Morgans had moved to Swansea City in 1961, having rarely played for United after the end of the 1957–58 season. Albert Scanlon was sold to Newcastle United in November 1960. Ray Wood had been sold to Huddersfield Town within a year of the Munich crash, having been unable to win back his place in the team from Harry Gregg, leaving Old Trafford around the same time as Colin Webster, who was sold to Swansea Town. Wilf McGuinness suffered a broken leg in a reserve match during the 1959–60 season and never returned to the first team, although he stayed with the club as a member of the coaching staff and spent 18 months as United's manager after the retirement of Sir Matt Busby in May 1969. Injury also ended the career of John Doherty, who played his last game for Leicester City less than a year after United sold him to the East Midlands club."]}, {"page": "History of Manchester United F.C. (1945–1969)", "response": ["A period of rebuilding followed with several significant signings, including Albert Quixall, Maurice Setters, Denis Law, Pat Crerand, and Noel Cantwell between 1958 and 1962. Although they were sound long-term investments, the arrival of fresh blood failed to give the club an immediate leg-up in the league. Munich survivors Harry Gregg, Bill Foulkes and Bobby Charlton were all with the club for many years afterwards, while Ray Wood, Albert Scanlon and Kenny Morgans had all been transferred by 1961 and Dennis Viollet was sold to Stoke City in 1962."]}, {"page": "Nantwich Town F.C.", "response": ["After World War II, the Dabbers joined the newly founded Mid Cheshire League in 1948 and in 1952, the club entered the inaugural FA Youth Cup competition. Drawn against Manchester United in the second round, the young Dabbers crashed 23–0 on a November evening at the Cliff training ground to a United youth line up including Duncan Edwards, David Pegg, Albert Scanlon and Ron Cope (who joined Nantwich in the twilight of his career)."]}, {"page": "Timeline of English football", "response": ["*Manchester United win the league championship with a reshaped side containing mostly young players including Duncan Edwards (19), David Pegg (20), Albert Scanlon (20) and Mark Jones (22).  They become England's first representatives in the European Cup, in the competition's second season, as the previous league champions Chelsea were blocked from entering the inaugural tournament by the Football Association."]}, {"page": "1999–2000 in English football", "response": ["*9 June 2000: Shay Brennan, 63, made his Manchester United debut as a left-winger in February 1958 in the first game after the Munich air disaster, the position left vacant by the death of David Pegg and injury to Albert Scanlon. He was soon converted to a left-back and remained at United until 1970, collecting two league title medals, an FA Cup winner's medal and a European Cup winner's medal as well as playing 355 league games. Despite being born in Manchester, he qualified for play for the Republic of Ireland due to his ancestry and was capped 19 times. He later managed Waterford in the Irish leagues and lived in Ireland until his sudden death from a heart attack."]}, {"page": "Roger Day", "response": ["*Roger Day interviewing Albert Scanlon - streaming audio"]}, {"page": "2009 in association football", "response": ["*22 December – Albert Scanlon (74), English forward, survivor of the Munich air disaster"]}, {"page": "William Ash (actor)", "response": ["In 1995 he appeared in Heartbeat. In 2006, he portrayed the Manchester United footballer Albert Scanlon in an edition of the BBC series Surviving Disasters about the Munich air disaster of 1958, of which Scanlon was a survivor.", "| Albert Scanlon"]}, {"page": "Cliff Portwood", "response": ["Portwood started his career with Manchester Athletic, playing youth football with the likes of Bobby Charlton, Eddie Colman and Albert Scanlon, before joining Preston North End in February 1955 after being spotted by Frank Hill. During his time at Deepdale he was Tom Finney's understudy. However, he did not make his league debut at Preston, as new manager Cliff Britton did not see Portwood as being up to First Division standard once he returned from his national service with the Royal Air Force."]}, {"page": "2009–10 in English football", "response": ["22 December: Albert Scanlon, former Manchester United winger who survived the Munich air disaster in 1958, dies at age 74 after a two-month illness. There are now just four players who survived the crash still alive.", "*22 December 2009 – Albert Scanlon, 74, former Manchester United winger and Busby Babe who survived the Munich Air Disaster. Played 115 league matches for the Red Devils, and was a member of the 1955–56 and 1956–57 championship-winning sides. Later played for Newcastle United, Lincoln City and Mansfield Town.Busby Babe Albert Scanlon dies , Manchester Evening News. Retrieved 22 December 2009."]}, {"page": "1955–56 Manchester United F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Albert Scanlon"]}, {"page": "1956–57 Manchester United F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Albert Scanlon"]}]}}