{"wiki_id": "http://www.wikidata.org/entity/Q981768", "itemLabel": "Julian Barbour", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Barbour", "wikipedia_page": {"main": "Julian Barbour (; born 1937) is a British physicist with research interests in quantum gravity and the history of science.\nSince receiving his PhD degree on the foundations of Albert Einstein's general theory of relativity at the University of Cologne in 1968, Barbour has supported himself and his family without an academic position, working part-time as a translator (although he has an Oxford University email address and his research has been funded, for example by a FQXi grant). He resides near Banbury, England.", "link_mentions": [{"page": "Time", "response": ["These arguments often center on what it means for something to be unreal. Modern physicists generally believe that time is as real as space – though others, such as Julian Barbour in his book The End of Time, argue that quantum equations of the universe take their true form when expressed in the timeless realm containing every possible now or momentary configuration of the universe, called \"platonia\" by Barbour."]}, {"page": "Eternalism (philosophy of time)", "response": ["Some philosophers appeal to a specific theory that is \"timeless\" in a more radical sense than the rest of physics, the theory of quantum gravity. This theory is used, for instance, in Julian Barbour's theory of timelessness.[Barbour, Julian, The End of Time, 1999 Oxford University Press ] On the other hand, George Ellis argues that time is absent in cosmological theories because of the details they leave out."]}, {"page": "History of loop quantum gravity", "response": ["* Julian Barbour, The End of Time: The Next Revolution in Our Understanding of the Universe (1999)."]}, {"page": "List of quantum gravity researchers", "response": ["*Julian Barbour: philosopher and author of The End of Time, Absolute or Relative Motion?: The Discovery of Dynamics."]}, {"page": "The Unreality of Time", "response": ["* Julian Barbour, a scholar who has also argued about the unreality of time"]}, {"page": "Robert Sungenis", "response": ["In 2014, Sungenis, along with Rick Delano, was an executive producer of The Principle, a documentary which advocates for his ideas about geocentrism. The movie features interviews with Lawrence Krauss, Michio Kaku, Max Tegmark, Julian Barbour, and George F. R. Ellis, and was narrated by Kate Mulgrew, and was briefly in the news in 2014 when Mulgrew and the physicists said that the filmmakers did not honestly explain the purpose of their film to them. The release date of the film was October 24, 2014 when it was screened at the Marcus Addison Cinema in Addison, Illinois, according to the distributor Rocky Mountain Pictures. As of April 30, 2015 the film had grossed $89,543."]}, {"page": "Barbour", "response": ["*Julian Barbour (b.1937), a British physicist with research interests in quantum gravity and the history of science"]}, {"page": "Time capsule (disambiguation)", "response": ["* Time capsules, fixed patterns that create the appearance of motion or change according to Julian Barbour's timeless physics"]}, {"page": "Independent scientist", "response": ["Modern-day independent scientists who fund their own research on an independent basis include, for example, Stephen Wolfram who funds his research through the sale of Mathematica software, Julian Barbour, Aubrey de Grey, Barrington Moore, Susan Blackmore, James Lovelock, and John Wilkinson who funds his research on \"molecular synergism in nature\" by running a regulatory scientific consultancy in natural products.", "* Julian Barbour"]}, {"page": "Platonia (philosophy)", "response": ["In Julian Barbour's book The End of Time: The Next Revolution in Our Understanding of the Universe, Platonia is the name given to his hypothetic entity of a timeless realm containing every possible \"Now\" or momentary configuration of the universe.", "* Julian Barbour"]}, {"page": "The Principle", "response": ["Michio Kaku said that the film was probably using \"clever editing\" of his statements and bordered on \"intellectual dishonesty\", and Lawrence Krauss said he had no recollection of being interviewed for the film and would have refused to be in it if he had known more about it. British physicist Julian Barbour said that he never gave permission to be in the film."]}, {"page": "The End of Time (book)", "response": ["The End of Time: The Next Revolution in Our Understanding of the Universe, also sold with the alternate subtitle The Next Revolution in Physics,See the section \"Editions\". is a 1999 popular science book in which the author Julian Barbour argues that time exists merely as an illusion.", "Julian Barbour's research has been published in academic journals and monographs, whereas The End of Time was aimed a more general and philosophically minded public. A number of professional philosophers have responded to the book. "]}, {"page": "Foundational Questions Institute", "response": ["* Julian Barbour"]}, {"page": "Anathem", "response": ["Large portions of the book involve detailed discussions of mathematics, physics, and philosophy. Most of these discussions use fictional Arbran terminology, but treat ideas from actual science and philosophy. Stephenson acknowledges the work of author Julian Barbour as the source for much of this material.Neal Stephenson, Clocks, Orreries, etc., acknowledgements for Anathem"]}]}}