{"wiki_id": "http://www.wikidata.org/entity/Q981894", "itemLabel": "Edward William Lane", "itemDescription": "British orientalist, translator and lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_William_Lane", "wikipedia_page": {"main": "Edward William Lane (17 September 1801 – 10 August 1876) was a British orientalist, translator and lexicographer. He is known for his Manners and Customs of the Modern Egyptians and the Arabic-English Lexicon, as well as his translations of One Thousand and One Nights and Selections from the Kur-án.During his lifetime, Lane also wrote a detailed account of Egypt and the country's ancient sites, but the book, titled Description of Egypt, was published posthumously. It was first published by the American University in Cairo Press in 2000 and has been republished several times since then.", "link_mentions": [{"page": "One Thousand and One Nights", "response": ["* 1838–1840: Edward William Lane publishes an English translation. Notable for its exclusion of content Lane found immoral and for its anthropological notes on Arab customs by Lane."]}, {"page": "Eggplant", "response": ["The eggplant has a special place in folklore. In 13th-century Italian traditional folklore, the eggplant can cause insanity.Oxford English Dictionary, 3rd edition, 2000, s.v. 'mad-apple'  In 19th-century Egypt, insanity was said to be \"more common and more violent\" when the eggplant is in season in the summer.Edward William Lane, An Account of the Manners and Customs of the Modern Egyptians, v. 1, p. 378, footnote 1."]}, {"page": "Admiral", "response": ["The quote from John Minsheu’s Dictionarie in Spanish and English (1599), given in Johnson’s Dictionary, has been confirmed as being accurate. Additionally, the definition of Amīr (أمير), as given in Edward William Lane's Arabic-English Lexicon, concurs, in part, with Minsheu's definition, stating that the term means “One having, holding, or possessing, command; a commander; a governor; a lord; a prince, or king.”"]}, {"page": "Gentile", "response": ["The word ummi occurs six times in the Quran. Pickthall only uses the word gentile once in the above passage and translates other occurrences as illiterate. However many other western scholars of the Quran came to similar conclusion that the word ummi is equal to the hebrew word Goyim. Edward Henry Palmer used the word gentile in his translation of the Quran several times including in the following verse: Palmer like Pickthall did not translate all instances of the word ummi as Gentiles, but his comment on chapter 3 verse 19 shows his opinion :Edward William Lane similarly believed that the word ummi is identical to the Hebrew Goyim as demonstrated in the following quote :John Medows Rodwell in his translation of the Quran comments similarly in a note on chapter 52 verse 157 that the word ummi is equivalent to the Greek ethnos and the Hebrew goyim, and was applied by Jews to those who did not know scripture. Elwood Morris Wherry wrote that almost certainly  Some Muslim scholars also agreed with this idea, french translation of the Quran by Muhammad Hamidullah has the phrase 'gentile prophet' in translation of Sura 7 verse 157-8. Moucarry, C. G. (2001). Faith to Faith: Christianity & Islam in Dialogue. United Kingdom: Inter-Varsity.P. 226 Muhammad Shahrur also believed that ummi prophet means gentile prophet in his book Al-Kitab wa-L-Quran (The Book and the Quran). Moucarry, C. G. (2001). Faith to Faith: Christianity & Islam in Dialogue. United Kingdom: Inter-Varsity.P. 229 Abul A'la Maududi similarly translated the following instance as gentile.  Maududi clarifies in notes on this verse that the reason this verse has been sent is because Jews looked down on Arabs as gentiles and did not believe that a prophet can rise from their kind.Mawdudi, S. A. A. (2016). Towards Understanding the Qur'an: English Only Edition. United Kingdom: Kube Publishing Limited. P. 852"]}, {"page": "List of years in literature", "response": ["*1840 in literature – A Hero of Our Time – Mikhail Lermontov; Two Years Before the Mast – Richard Henry Dana, Jr.; Tales of the Grotesque and Arabesque – Edgar Allan Poe; Kobzar – Taras Hryhorovych Shevchenko; The Arabian Nights – Edward William Lane publishes an English version"]}, {"page": "Houri", "response": ["Several translators—like Arberry, Palmer, Rodwell and Sale—have translated the noun ka'ib in  Quran 78:33 as \"with swelling breasts\". Ibn Kathir, in his tafsir, writes that the word has been interpreted to refer to \"fully developed\" or \"round breasts ... they meant by this that the breasts of these girls will be fully rounded and not sagging, because they will be virgins.\"  Similarly, the authoritative Arabic-English Lexicon of Edward William Lane defines the word ka'ib as \"A girl whose breasts are beginning to swell, or become prominent, or protuberant or having swelling, prominent, or protuberant, breasts.\"كعب in Lane's lexicon."]}, {"page": "Jizya", "response": ["According to Lane's Lexicon, jizya is the tax that is taken from the free non-Muslim subjects of an Islamic government, whereby they ratify the pact that ensures them protection.Edward William Lane, An Arabic-English Lexicon. Book 1, p. 422. (Citing al-Nihaya fi Gharib al-Hadith by Majd al-Din ibn Athir (d. 1210), and others.)"]}, {"page": "Bahamut", "response": ["Bahamut, according to Edward William Lane's abstract of a particular Islamic work on cosmography, is a giant fish acting as one of the layers that supports the earth. It is so immense \"[all] the seas of the world, placed in one of the fish's nostrils, would be like a mustard seed laid in the desert.\" Above the fish stands a bull called Kuyootà, on the bull, a \"ruby\" rock, on the rock an angel to shoulder the earth. And below the Bahamut (Leviathan) is the colossus serpentine Falak.Theresa Bane Encyclopedia of Beasts and Monsters in Myth, Legend and Folklore McFarland, 2016   p. 51"]}, {"page": "Abu Simbel", "response": ["With the passage of time, the temples fell into disuse and eventually became covered by sand. By the 6th century BC, the sand already covered the statues of the main temple up to their knees. The temple was forgotten until 1813, when Swiss orientalist Johann Ludwig Burckhardt found the top frieze of the main temple. Burckhardt talked about his discovery with Italian explorer Giovanni Belzoni, who travelled to the site, but was unable to dig out an entry to the temple. Belzoni returned in 1817, this time succeeding in his attempt to enter the complex. A detailed early description of the temples, together with contemporaneous line drawings, can be found in Edward William Lane's Description of Egypt (1825–1828).Lane E, \"Descriptions of Egypt,\" American University in Cairo Press. pp.493-502."]}, {"page": "Child marriage", "response": ["A Scottish physician living in 18th century Syria reported that locals tried to contract marriages for their children at a young age, but the marriage was not consummated until the girl \"had come of age\". Evidence from 19th century Palestine suggests that husbands sometimes initiated sexual relations before their wife reached puberty, but that it was a rare occurrence, condemned socially and censured by sharia courts. Writing in 1830s, Edward William Lane observed that few Egyptian girls remained single by the age of 16, but socio-economic transformation, educational reforms and influence of Western norms brought significant changes, and by 1920 fewer than 10% of Egyptian women married before the age of 20. In 1923, Egypt's parliament set the minimum age of marriage at 16 for women and 18 for men."]}, {"page": "List of lexicographers", "response": ["*Edward William Lane (1801–1876) translation of medieval Arabic dictionaries to English"]}, {"page": "Harvard Classics", "response": ["* Stories from the Thousand and One Nights, translated by Edward William Lane, revised by Stanley Lane-Poole"]}, {"page": "Reginald Stuart Poole", "response": ["Reginald Stuart Poole (27 January 18328 February 1895), known as Stuart Poole, was an English archaeologist, numismatist and Orientalist. Poole was from a famous Orientalist family as his mother Sophia Lane Poole, his uncle Edward William Lane and his nephew Stanley Lane-Poole famous for their work in this field. His other uncle was Richard James Lane, a distinguished Victorian lithographer and engraver.", "Born in London, Poole was the son of the Rev. Edward Poole, a well-known bibliophile. His parents became estranged during his early childhood, and his mother, Sophia Lane Poole, took her sons to Egypt to live with her brother, the Orientalist Edward William Lane. During their seven-year residence in Cairo from 1842 to 1849, Lane Poole wrote The Englishwoman in Egypt, while her son was imbibing an early taste for Egyptian antiquities."]}, {"page": "Joseph von Hammer-Purgstall", "response": ["For fifty years Hammer-Purgstall wrote prolifically on the most diverse subjects and published numerous texts and translations of Arabic, Persian and Turkish authors. He was the first to publish a complete translation of the divan of Hafez into a western language. By traversing so large a field, he laid himself open to the criticism of specialists, and he was severely handled by Heinrich Friedrich von Diez (1751–1817), who, in his Unfug und Betrug in der morgenländischen Litteratur, nebst vielen hundert Proben von der groben Unwissenheit des H. v. Hammer zu Wien in Sprachen und Wissenschaften (1815), devoted to him nearly 600 pages of abuse. He also came into friendly conflict on the subject of the origin of The Thousand and One Nights with his younger English contemporary Edward William Lane."]}, {"page": "Capella", "response": ["In medieval accounts, it bore the uncommon name Alhajoth (also spelled Alhaior, Althaiot, Alhaiset, Alhatod, Alhojet, Alanac, Alanat, Alioc), which (especially the last) may be a corruption of its Arabic name, , al-cayyūq. cAyyūq has no clear significance in Arabic,Edward William Lane's Arabic-English Lexicon:  but may be an Arabized form of the Greek αίξ aiks \"goat\"; cf. the modern Greek Αίγα Aiga, the feminine of goat. To the Bedouin of the Negev and Sinai, Capella al-'Ayyūq ath-Thurayyā \"Capella of the Pleiades\", from its role as pointing out the position of that asterism. Another name in Arabic was Al-Rākib \"the driver\", a translation of the Greek."]}, {"page": "Frank Brangwyn", "response": ["In 1895, the Parisian art dealer Siegfried Bing commissioned Brangwyn to decorate the exterior of his Galerie L'Art Nouveau, and encouraged Brangwyn into new avenues: murals, tapestry, carpet designs, posters and designs for stained glass to be produced by Louis Comfort Tiffany. In 1896 he illustrated a six-volume reprint of Edward William Lane's translation of One Thousand and One Nights.The Thousand & One Nights,: or, Arabian Nights' Entertainments. 6 Vol. Translated by Edward William Lane; with an introduction by Joseph Jacobs, and illustrations by Frank Brangwyn. London: Gibbings. Philadelphia: Lippincott, 1896. In 1917 he collaborated with the Japanese artist Urushibara Mokuchu on a series of woodblock prints. For his austere but decorative designs he was recognized by continental and American critics as a prominent artist, while British critics were puzzled as to how to evaluate him. Through his collecting Japanese works, he became friends with Kojiro Matsutaka the Japanese industrial magnate, who became his patron."]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "Joseph Bonomi the Younger", "response": ["However, Bonomi's relationship with Hay was stormy. Bonomi was frustrated at what he regarded as a low salary; Hay resented Bonomi's wish to enhance his own reputation by producing drawings and casts for himself. In July 1826, Bonomi resigned (and was replaced as Hay's assistant by Edward William Lane)."]}, {"page": "Lane (surname)", "response": ["*Edward William Lane (1801–1876), British scholar"]}, {"page": "James Burton (Egyptologist)", "response": ["Between 1815 and 1822, Burton worked for the architect Sir John Soane, and travelled in Italy with Soane's secretary, Charles Humphreys, where he met Egyptologists Sir John Gardner Wilkinson, Edward William Lane, and Sir William Gell. His circle of Egyptologists also included Robert Hay and Joseph Bonomi the Younger. Burton lived in Egypt from 1820 to 1834, where he enjoyed marsala, rum, brandy, opium, and the company of slave girls."]}, {"page": "Almah (Egyptian dancer)", "response": ["The Awalim were first introduced as singers, not dancers-cum-prostitutes, according to Edward William Lane's book, Manner and Costumes of modern Egyptians. Lane additionally wrote that the Almah didn't display herself at all, but sang from behind a screen or from another room at weddings and other respectable festivities. Consequently, the Awalem were not subject to exile in Upper Egypt."]}, {"page": "Description de l'Égypte (disambiguation)", "response": ["* Description of Egypt - Description of Egypt; Notes and views in Egypt and Nubia made during the years 1825–1828, Edward William Lane Pub; The American University in Cairo Press, 2000 (This manuscript lay dormant in the British Library for 170 years)"]}, {"page": "Orientalism (book)", "response": ["In the article, \"Edward Said's Shadowy Legacy\" (2008), Robert Irwin says that Said ineffectively distinguished among writers of different centuries and genres of Orientalist literature. That the disparate examples, such as the German poet Johann Wolfgang von Goethe (1749–1832) who never travelled to the Orient; the French novelist Gustave Flaubert (1821–1880) who briefly toured Egypt; the French Orientalist Ernest Renan (1823–1892), whose anti-Semitism voided his work; and the British Arabist Edward William Lane (1801–1876), who compiled the Arabic–English Lexicon (1863–93)—did not constitute a comprehensive scope of investigation or critical comparison.Robert Irwin, \"Edward Said's shadowy legacy\", Times Literary Supplement, 7 May 2008. Accessed 5 January 2010. In that vein, in Defending the West: A Critique of Edward Said's Orientalism (2007), Ibn Warraq earlier had said that in Orientalism (1978) Said had constructed a binary-opposite representation, a fictional European stereotype that would counter-weigh the Oriental stereotype. Being European is the only common trait among such a temporally and stylistically disparate group of literary Orientalists."]}, {"page": "Sufi studies", "response": ["In An Account of the Manners and Customs of the Modern Egyptians written in Egypt during the years 1833-1835 (1836) Edward William Lane noted, and illustrated with his own woodcuts, his close observations of the Rifa'i derwishes while living in Cairo \"in disguise\". The success of his work also introduced the success of the \"disguise\". Sir Richard Burton's Personal Narrative of a Pilgrimage to El-Medinah and Meccah (3 vol.1855-1856) was undertaken while travelling as a Qadiri, and Armin Vambéry reached Baveddin near Bokhara to visit the shrine of Baha-ud-Din Naqshband Bukhari in 1863 in the guise of a murid. Voyage dans l'Asie Centrale, de Téhéran a Khiva, Bokhara et Samarkand, par Arminius Vambéry, savant Hongrois déguisé en derviche was the subject of four instalments of the popular and copiously illustrated \"Le Tour Du Monde, Nouveau Journal Des Voyages (Édouard Charton)\" Paris, Londres, Leipzig 1865, deuxième semestre -Hachette et Cie ed."]}, {"page": "Hereford Cathedral School", "response": ["*Edward William Lane, orientalist"]}, {"page": "Stanley Lane-Poole", "response": ["Stanley Edward Lane-Poole (18 December 1854 – 29 December 1931) was a British orientalist and archaeologist. Poole was from a famous orientalist family as his paternal grandmother Sophia Lane Poole, uncle Reginald Stuart Poole and great-uncle Edward William Lane were famous for their work in this field. His other great-uncle was Richard James Lane, a distinguished Victorian lithographer and engraver.", "*The Life of Edward William Lane (1877)"]}, {"page": "E. W. Lane", "response": ["#REDIRECT Edward William Lane"]}, {"page": "Thieves' guild", "response": ["Some stories of One Thousand and One Nights celebrated artful thieves and criminal brotherhoods with a hierarchy and code of honor. The Sandalwood Merchant and the Sharpers features an old man known as the \"Sheikh of Thieves\" who delivered judgement on less experienced sharpers. This was based on actual thieves' guilds in Cairo in the Ottoman period, that were known to return stolen goods for a price, and which were managed by a sheikh. These survived up until the 19th century, and were mentioned by Edward William Lane in the 1830s."]}]}}