{"wiki_id": "http://www.wikidata.org/entity/Q983504", "itemLabel": "George Charles Beresford", "itemDescription": "British photographer and author (1864-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Charles_Beresford", "wikipedia_page": {"main": "George Charles Beresford (10 July 1864 – 21 February 1938) was a British studio photographer, originally from Drumlease, Dromahair, County Leitrim.", "link_mentions": [{"page": "United Services College", "response": ["*George Charles Beresford (1864–1938), photographer, inspiration for \"M'Turk\" in Stalky & Co."]}, {"page": "Marquess of Waterford", "response": ["Several other members of the Beresford family have also gained distinction. John Beresford, fifth son of the first Earl, was an influential statesman. Marcus Beresford, eldest son of John Beresford, represented Dungarvan in the Irish Parliament. His second son was the Conservative politician William Beresford, who was the father of Mostyn Beresford (1835–1911), a Lieutenant-General in the Army, and of Edward Marcus Beresford (1836–1896), a Major-General in the Army. The Right Reverend George Beresford, second son of John Beresford, was Bishop of Kilmore. His son the Most Reverend Marcus Beresford was Archbishop of Armagh. He was the father of George Beresford, a politician, and of Major Henry Marcus Beresford, who was the father of the photographer George Charles Beresford. John Claudius Beresford, third son of John Beresford, was a politician. William Beresford, seventh son of the first Earl, was Archbishop of Tuam and was created Baron Decies in 1812. Lord John Beresford, second surviving son of the first Marquess, was Archbishop of Armagh. Lord George Beresford, younger son of the first Marquess, was a politician. William Beresford, illegitimate son of the first Marquess, was a Field Marshal in the British Army and was created Viscount Beresford in 1823. John Beresford, illegitimate son of the first Marquess, was a soldier and politician and was created a baronet in 1814 (see Beresford-Peirse baronets). Lord Charles Beresford, second son of the fourth Marquess, was a naval commander and politician and was created Baron Beresford in 1916. Lord William Beresford, third son of the fourth Marquess, was a soldier and recipient of the Victoria Cross. Lord Marcus Beresford, fourth son of the fourth Marquess, was a courtier."]}, {"page": "Stalky & Co.", "response": ["Stalky & Co. is a novel by Rudyard Kipling about adolescent boys at a British boarding school. It is a collection of school stories whose juvenile protagonists display a know-it-all, cynical outlook on patriotism and authority. It was first published in 1899 (following serialisation in the Windsor Magazine). It is set at a school dubbed \"the College\" or \"the Coll.\", which is based on the actual United Services College that Kipling attended as a boy.\"Stalky & Co.: The general background\", Roger Lancelyn Green The character Beetle, one of the main trio, is partly based on Kipling himself, while the charismatic character Stalky is based on Lionel Dunsterville, M'Turk is based on George Charles Beresford, Mr King is based on William Carr Crofts,\"Boy-Society in Rudyard Kipling's Stalky & Co.\", Lynne M. Rosenthal, The Lion and the Unicorn (journal) Volume 2, Number 2, 1978 pp. 16–26 and the headmaster, Mr. Bates, is based on Cormell Price, headmaster of the United Services College."]}, {"page": "Platinum print", "response": ["* George Charles Beresford"]}, {"page": "Royal Indian Engineering College", "response": ["*George Charles Beresford, photographer"]}, {"page": "Lionel Dunsterville", "response": ["Lionel Charles Dunsterville was born in Lausanne, Switzerland on 9 November 1865, the son of Lieutenant General Lionel D'Arcy Dunsterville (1830–1912) of the Indian Army and his wife, Susan Ellen (1835–1875). He went to school with Rudyard Kipling and George Charles Beresford at The United Services College, a public school later absorbed into Haileybury and Imperial Service College, which prepared British young men for careers in Her Majesty's Army. He served as the inspiration for the character \"Stalky\" in Kipling's collection of school stories Stalky & Co. He was also uncle to H.D. Harvey-Kelly, the first Royal Flying Corps pilot to land in France in during the First World War."]}, {"page": "George Beresford", "response": ["*George Charles Beresford (1864–1938), British studio photographer, great-grandson of the bishop"]}, {"page": "George C. Beresford", "response": ["#Redirect George Charles Beresford"]}, {"page": "George C Beresford", "response": ["#Redirect George Charles Beresford"]}, {"page": "Beresford (name)", "response": ["**George Charles Beresford (1864–1938), Victorian studio photographer"]}]}}