{"wiki_id": "http://www.wikidata.org/entity/Q983380", "itemLabel": "John Lennard-Jones", "itemDescription": "British scientist (1894-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lennard-Jones", "wikipedia_page": {"main": "Sir John Edward Lennard-Jones  (27 October 1894 – 1 November 1954) was a British mathematician and professor of theoretical physics at the University of Bristol, and then of theoretical science at the University of Cambridge. He was an important pioneer in the development of modern computational chemistry and theoretical chemistry.", "link_mentions": [{"page": "Chemical bond", "response": ["In 1927, the first mathematically complete quantum description of a simple chemical bond, i.e. that produced by one electron in the hydrogen molecular ion, H2+, was derived by the Danish physicist Øyvind Burrau. This work showed that the quantum approach to chemical bonds could be fundamentally and quantitatively correct, but the mathematical methods used could not be extended to molecules containing more than one electron. A more practical, albeit less quantitative, approach was put forward in the same year by Walter Heitler and Fritz London. The Heitler–London method forms the basis of what is now called valence bond theory. In 1929, the linear combination of atomic orbitals molecular orbital method (LCAO) approximation was introduced by Sir John Lennard-Jones, who also suggested methods to derive electronic structures of molecules of F2 (fluorine) and O2 (oxygen) molecules, from basic quantum principles. This molecular orbital theory represented a covalent bond as an orbital formed by combining the quantum mechanical Schrödinger atomic orbitals which had been hypothesized for electrons in single atoms. The equations for bonding electrons in multi-electron atoms could not be solved to mathematical perfection (i.e., analytically), but approximations for them still gave many good qualitative predictions and results. Most quantitative calculations in modern quantum chemistry use either valence bond or molecular orbital theory as a starting point, although a third approach, density functional theory, has become increasingly popular in recent years."]}, {"page": "John Pople", "response": ["Pople's early paper on the statistical mechanics of water, according to Michael J. Frisch, \"remained the standard for many years. This was his thesis topic for his PhD at Cambridge supervised by John Lennard-Jones."]}, {"page": "Molecular orbital", "response": ["Molecular orbitals were first introduced by Friedrich HundF. Hund, \"Zur Deutung der Molekelspektren\", Zeitschrift für Physik, Part I, vol. 40, pages 742-764 (1927); Part II, vol. 42, pages 93–120 (1927); Part III, vol. 43, pages 805-826 (1927); Part IV, vol. 51, pages 759-795 (1928); Part V, vol. 63, pages 719-751 (1930). and Robert S. Mulliken in 1927 and 1928.Friedrich Hund and Chemistry, Werner Kutzelnigg, on the occasion of Hund's 100th birthday, Angewandte Chemie International Edition, 35, 573–586, (1996)Robert S. Mulliken's Nobel Lecture, Science, 157, no. 3785, 13-24. Available on-line at: Nobelprize.org The linear combination of atomic orbitals or \"LCAO\" approximation for molecular orbitals was introduced in 1929 by Sir John Lennard-Jones. His ground-breaking paper showed how to derive the electronic structure of the fluorine and oxygen molecules from quantum principles. This qualitative approach to molecular orbital theory is part of the start of modern quantum chemistry."]}, {"page": "Noble gas", "response": ["The noble gases are nearly ideal gases under standard conditions, but their deviations from the ideal gas law provided important clues for the study of intermolecular interactions. The Lennard-Jones potential, often used to model intermolecular interactions, was deduced in 1924 by John Lennard-Jones from experimental data on argon before the development of quantum mechanics provided the tools for understanding intermolecular forces from first principles. The theoretical analysis of these interactions became tractable because the noble gases are monatomic and the atoms spherical, which means that the interaction between the atoms is independent of direction, or isotropic."]}, {"page": "List of physicists", "response": ["*John Lennard-Jones – U.K. (1894–1954)"]}, {"page": "Robert S. Mulliken", "response": ["Up to this point, the primary way to calculate the electronic structure of molecules was based on a calculation by Walter Heitler and Fritz London on the hydrogen molecule (H2) in 1927. With the conception of hybridized atomic orbitals by John C. Slater and Linus Pauling, which rationalized observed molecular geometries, the method was based on the premise that the bonds in any molecule could be described in a manner similar to the bond in H2, namely, as overlapping atomic orbitals centered on the atoms involved.  Since it corresponded to chemists' ideas of localized bonds between pairs of atoms, this method (called the Valence-Bond (VB) or Heitler-London-Slater-Pauling (HLSP) method), was very popular. In attempting to calculate the properties of excited states (molecules that have been excited by an energy source), the VB method does not always work well. With its description of the electron wave functions in molecules as delocalized molecular orbitals that possess the same symmetry as the molecule, Hund and Mulliken's molecular-orbital method, including contributions by John Lennard-Jones, proved to be more flexible and applicable to a vast variety of types of molecules and molecular fragments, and has eclipsed the valence-bond method. As a result of this development, he received the Nobel Prize in Chemistry in 1966."]}, {"page": "Timeline of atomic and subatomic physics", "response": ["* 1924 John Lennard-Jones proposes a semiempirical interatomic force law", "* 1931 John Lennard-Jones proposes the Lennard-Jones interatomic potential"]}, {"page": "University of Bristol", "response": ["Past academics of the university include, Patricia Broadfoot, vice-chancellor of the University of Gloucestershire, Nigel Thrift, vice-chancellor of the University of Warwick, and Wendy Larner, provost of Victoria University of Wellington. Anthony Epstein, co-discoverer of the Epstein-Barr virus, was Professor of Pathology at the university from 1968 to 1982, Sir John Lennard-Jones, discoverer of the Lennard-Jones potential in physics and Alfred Marshall, one of the University College's principals and influential economist in the latter part of the 19th century. Mathematicians and philosophers Rohit Parikh and Brian Rotman lectured in the mathematics department, and philosophers of science Paul Feyerabend and Alexander Bird taught in the department of philosophy. Another notable current academic in the department of philosophy includes Havi Carel. Notable mathematicians who have worked in the department of mathematics include Hannes Leitgeb, Philip Welch, Ben Green, Andrew Booker, Julia Wolf, Jens Marklof, John McNamara, Howell Peregrine, Christopher Budd John Hogan, Jeremy Rickard, Richard Jozsa, Corinna Ulcigrai, David Evans and the statistician Harvey Goldstein."]}, {"page": "Lennard-Jones potential", "response": ["The Lennard-Jones potential models soft repulsive and attractive interactions. Hence, the Lennard-Jones potential describes electronically neutral atoms or molecules. It is named after John Lennard-Jones. The commonly used expression for the Lennard-Jones potential is "]}, {"page": "Keele University", "response": ["* Sir John Lennard-Jones (1953–54)"]}, {"page": "Gerhard Herzberg", "response": ["* 1928–30 Post-doctoral work at the University of Göttingen and Bristol University under James Franck, Max Born, John Lennard-Jones"]}, {"page": "Royal Flying Corps", "response": ["* John Lennard-Jones, scientist"]}, {"page": "Linear combination of atomic orbitals", "response": ["It was introduced in 1929 by Sir John Lennard-Jones with the description of bonding in the diatomic molecules of the first main row of the periodic table, but had been used earlier by Linus Pauling for H2+.Friedrich Hund and Chemistry, Werner Kutzelnigg, on the occasion of Hund's 100th birthday, Angewandte Chemie, 35, 572–586, (1996), "]}, {"page": "Leigh, Greater Manchester", "response": ["Sir John Lennard-Jones, Sir Peter Maxwell Davies, Sir Alan R. Battersby, Roger Hunt and Pete Shelley were pupils of Leigh Grammar School. Conservative politician, and MP for Morecambe and Lunesdale, David Morris was born in Leigh. Rhythm and blues singer and musician Georgie Fame was born in Leigh in 1943. Thomas Burke, operatic tenor, was born in 1890 and attended St Joseph's School. The author of \"Goodbye, Mr Chips\", James Hilton was also born in Leigh. The sculptor Mary Pownall, daughter of James Pownall the silk manufacturer, was born and raised in the town. The journalist Paul Mason was also born and educated in Leigh. The poet and Chancellor of the University of Manchester Lemn Sissay lived in children's homes in and around Leigh and attended Leigh Church of England Secondary school, now closed."]}, {"page": "List of theoretical physicists", "response": ["* John Lennard-Jones (1894–1954)"]}, {"page": "Scientific phenomena named after people", "response": ["* Lennard-Jones potential – John Lennard-Jones"]}, {"page": "Department of Computer Science and Technology, University of Cambridge", "response": ["The Department was founded as the Mathematical Laboratory under the leadership of John Lennard-Jones on 14 May 1937, though it did not get properly established until after World War II. The new laboratory was housed in the North Wing of the former Anatomy School, on the New Museums Site. Upon its foundation, it was intended \"to provide a computing service for general use, and to be a centre for the development of computational techniques in the University\". The Cambridge Diploma in Computer Science was the world's first postgraduate taught course in computing, starting in 1953."]}, {"page": "University of Cambridge Computing Service", "response": ["The Computing Service shares a common ancestry with the University of Cambridge Computer Laboratory. Founded on 14 May 1937 to provide a computing service for general use, and to be a centre for the development of computational techniques in the University as the Mathematical Laboratory (under the leadership of John Lennard-Jones), it was not until 2001 that the provision of computing services across the University and Colleges was fully separated from computing research and teaching."]}, {"page": "Quantum number", "response": ["Many different models have been proposed throughout the history of quantum mechanics, but the most prominent system of nomenclature spawned from the Hund-Mulliken molecular orbital theory of Friedrich Hund, Robert S. Mulliken, and contributions from Schrödinger, Slater and John Lennard-Jones. This system of nomenclature incorporated Bohr energy levels, Hund-Mulliken orbital theory, and observations on electron spin based on spectroscopy and Hund's rules.Chemistry, Matter, and the Universe, R.E. Dickerson, I. Geis, W.A. Benjamin Inc. (USA), 1976, "]}, {"page": "Molecular orbital theory", "response": ["Molecular orbital theory was developed in the years after valence bond theory had been established (1927), primarily through the efforts of Friedrich Hund, Robert Mulliken, John C. Slater, and John Lennard-Jones. MO theory was originally called the Hund-Mulliken theory. According to physicist and physical chemist Erich Hückel, the first quantitative use of molecular orbital theory was the 1929 paper of Lennard-Jones. This paper predicted a triplet ground state for the dioxygen molecule which explained its paramagnetismCoulson, C.A. Valence (2nd ed., Oxford University Press 1961), p.103 (see ) before valence bond theory, which came up with its own explanation in 1931. The word orbital was introduced by Mulliken in 1932. By 1933, the molecular orbital theory had been accepted as a valid and useful theory."]}, {"page": "Faraday Society", "response": ["* Sir John Lennard-Jones: 1948–1950"]}, {"page": "Ralph H. Fowler", "response": ["Fifteen Fellows of the Royal Society and three Nobel Laureates (Chandrasekhar, Dirac, and Mott) were supervised by Fowler between 1922 and 1939. In addition to Milne, he worked with Sir Arthur Eddington, Subrahmanyan Chandrasekhar, Paul Dirac and Sir William McCrea. It was Fowler who introduced Dirac to quantum theory in 1923. Fowler also put Dirac and Werner Heisenberg in touch with each other through Niels Bohr. At Cambridge he supervised the doctoral studies of 64 students, including John Lennard-Jones, Paul Dirac and Garrett Birkhoff."]}, {"page": "List of eponyms (L–Z)", "response": ["* John Lennard-Jones, British mathematician – Lennard-Jones potential"]}, {"page": "List of University of Cambridge people", "response": ["*John Lennard-Jones (Trinity)"]}, {"page": "Frank Spedding", "response": ["In 1934, Spedding was awarded a Guggenheim Fellowship, allowing him to study in Europe. To save money, Spedding and his wife travelled to Europe by heading westward across the Pacific. His intention was to study in Germany under James Franck and Francis Simon, but they fled Germany after Adolf Hitler came to power in March 1933. Instead he went to the Cavendish Laboratory at the University of Cambridge in England, where he was welcomed by Ralph H. Fowler. Spedding worked with John Lennard-Jones, and attended lectures given by Max Born. He paid a visit to Niels Bohr in Copenhagen, and gave a lecture in Leningrad."]}, {"page": "George G. Hall", "response": ["Hall was born in Belfast, Northern Ireland. He independently from Clemens C. J. Roothaan discovered the Roothaan-Hall equations. He was awarded a Ph.D. degree for this work in 1950 supervised by Sir John Lennard-Jones at Cambridge University. He then lectured at Cambridge University as Assistant in Research in Theoretical chemistry. He was elected to a Fellowship at St John's College, Cambridge in 1953. From 1955 to 1962 he lectured in Mathematics at the Imperial College, London.  In 1957–58 he spent a year with Per-Olov Löwdin in Uppsala, Sweden. He became Professor of Mathematics at the University of Nottingham in 1962. In 1982 he took early retirement from Nottingham University and was appointed an emeritus professor. He  moved in 1983 to Kyoto University, Japan, returning to Nottingham in 1988. He has collaborated with (inter alia) A.T. Amos, K. Collard, and D. Rees. He was Emeritus Professor and Senior Research Fellow in the Shell Centre for Mathematical Education at the University of Nottingham. He has a Sc. D. degree from Cambridge University and an Honorary D. Eng. degree from Kyoto University."]}, {"page": "S. Francis Boys", "response": ["Boys was born in Pudsey, Yorkshire, England. He was educated at the Grammar School in Pudsey and then at Imperial College London. He graduated in Chemistry in 1932. He did his PhD at Trinity College, Cambridge, supervised first by Professor Martin Lowry, and then, after Lowry's death in 1936, by Sir John Lennard-Jones."]}, {"page": "John lennard-jones", "response": ["#REDIRECT John Lennard-Jones "]}, {"page": "Lennard-jones", "response": ["#REDIRECT John Lennard-Jones"]}, {"page": "Eötvös rule", "response": ["As John Lennard-Jones and Corner showed in 1940 by means of the statistical mechanics the constant k′ is nearly equal to the Boltzmann constant.", "As a student, Eötvös started to research surface tension and developed a new method for its determination. The Eötvös rule was first found phenomenologically and published in 1886. Cited in:  In 1893 William Ramsay and Shields showed an improved version considering that the line normally passes the temperature axis 6 K before the critical point. John Lennard-Jones and Corner published (1940) a derivation of the equation by means of statistical mechanics. In 1945 E. A. Guggenheim gave a further improved variant of the equation."]}, {"page": "Lennard-Jones", "response": ["#REDIRECT John Lennard-Jones"]}, {"page": "History of numerical solution of differential equations using computers", "response": ["According to Mary Croarken in her paper \"Computing in Britain During World War II,\" by 1945, the Cambridge Mathematical Laboratory created by John Lennard-Jones utilized the latest computing devices to perform the equations. These devices included a model \"differential analyser,\" and the Mallock machine, described as \"an electrical simultaneous equation solver.\" According to Croarken, the Ministry was also interested in the new arrival of a differential analyzer accommodating eight integrators. This exotic computing device built by Metropolitan-Vickers in 1939 consisted of wheel and disk mechanisms that could provide descriptions and solutions  for differential equations. Output resulted in a plotted graph."]}]}}