{"wiki_id": "http://www.wikidata.org/entity/Q983351", "itemLabel": "Isaac D'Israeli", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Isaac_D%27Israeli", "wikipedia_page": {"main": "Isaac D'Israeli (11 May 1766 – 19 January 1848) was a British writer, scholar and the father of British Prime Minister Benjamin Disraeli. He is best known for his essays and his associations with other men of letters.", "link_mentions": [{"page": "Benjamin Disraeli", "response": ["Disraeli was born on 21 December 1804 at 6 King's Road, Bedford Row, Bloomsbury, London, the second child and eldest son of Isaac D'Israeli, a literary critic and historian, and Maria (Miriam), née Basevi. The family was mostly from Italy, of Sephardic Jewish, mercantile background with some Italian-Jewish, and Ashkenazi origins.Wolf, Lucien. 1905. The Disraeli Family, \"Transactions of the Jewish Historical Society of England\", vol. 5, pp. 202–218. Of these surnames, Shiprut de Gabay, Cardoso, Aboab, and, most likely, Israeli are Sephardic, Basevi is of Ashkenazic origin, while Rieti was originally taken by a family whose ancestors lived in Italy for centuries; see Beider, Alexander.  Pseudo-Sephardic Surnames from Italy. \"Avotaynu: The International Review of Jewish Genealogy,\" vol. XXXIII, Number 3, Fall 2017, pp. 3–8 (see pp. 5–6). Disraeli later romanticised his origins, claiming his father's family was of grand Iberian and Venetian descent; in fact Isaac's family was of no great distinction,Blake (1967), p. 6 but on Disraeli's mother's side, in which he took no interest, there were some distinguished forebears, including the Rothschilds and Isaac Cardoso.Wolf, Lucien. \"The Disraeli Family\", The Times, 21 December 1904, p. 12 Historians differ on Disraeli's motives for rewriting his family history: Bernard Glassman argues that it was intended to give him status comparable to that of England's ruling elite;Glassman, p. 32 Sarah Bradford believes \"his dislike of the commonplace would not allow him to accept the facts of his birth as being as middle-class and undramatic as they really were\".Bradford, p. 1", "Isaac D'Israeli had never taken religion very seriously, but had remained a conforming member of the Bevis Marks Synagogue. His father, the elder Benjamin, was a prominent and devout member; it was probably from respect for him that Isaac did not leave when he fell out with the synagogue authorities in 1813. After Benjamin senior died in 1816 Isaac felt free to leave the congregation following a second dispute.Blake (1967), p. 11 Isaac's friend Sharon Turner, a solicitor, convinced him that although he could comfortably remain unattached to any formal religion it would be disadvantageous to the children if they did so. Turner stood as godfather when Benjamin was baptised, aged twelve, on 31 July 1817.", "Conversion to Christianity enabled Disraeli to contemplate a career in politics. Britain in the early-nineteenth century was not a greatly anti-Semitic society, and there had been Members of Parliament (MPs) from Jewish families since Samson Gideon in 1770. But until Jews Relief Act 1858, MPs were required to take the oath of allegiance \"on the true faith of a Christian\", necessitating at least nominal conversion.Blake (1967), p. 10 It is not known whether Disraeli formed any ambition for a parliamentary career at the time of his baptism, but there is no doubt that he bitterly regretted his parents' decision not to send him to Winchester College.Bradford, p. 8 As one of the great public schools of England, Winchester consistently provided recruits to the political elite.Richmond and Smith, p. 23 His two younger brothers were sent there, and it is not clear why Isaac D'Israeli chose to send his eldest son to a much less prestigious school.Glassman, p. 38 The boy evidently held his mother responsible for the decision; Bradford speculates that \"Benjamin's delicate health and his obviously Jewish appearance may have had something to do with it.\" The school chosen for him was run by Eliezer Cogan at Higham Hill in Walthamstow. He began there in the autumn term of 1817; he later recalled his education:", "As he had in government posts, Disraeli rewarded old friends with clerical positions, making Sydney Turner, son of a good friend of Isaac D'Israeli, Dean of Ripon.Blake (1967), pp. 686–687 He favoured Low church clergymen in promotion, disliking other movements in Anglicanism for political reasons. In this, he came into disagreement with the Queen, who out of loyalty to her late husband, Albert, Prince Consort, preferred Broad church teachings. One controversial appointment had occurred shortly before the 1868 election. When the position of Archbishop of Canterbury fell vacant, Disraeli reluctantly agreed to the Queen's preferred candidate, Archibald Tait, the Bishop of London. To fill Tait's vacant see, Disraeli was urged by many people to appoint Samuel Wilberforce, the former Bishop of Winchester and leading figure in London society. Disraeli disliked Wilberforce and instead appointed John Jackson, the Bishop of Lincoln. Blake suggested that, on balance, these appointments cost Disraeli more votes than they gained him.Blake (1967), pp. 509–511"]}, {"page": "Edward Bulwer-Lytton", "response": ["Bulwer-Lytton admired Disraeli's father Isaac D'Israeli, himself a noted author. They began corresponding in the late 1820s and met for the first time in March 1830, when Isaac D'Israeli dined at Bulwer-Lytton's house. Also present that evening were Charles Pelham Villiers and Alexander Cockburn. The young Villiers had a long parliamentary career, while Cockburn became Lord Chief Justice of England in 1859."]}, {"page": "Simon Ockley", "response": ["Ockley was born at Exeter. He was educated at Queens' College, Cambridge, and graduated B.A. in 1697, MA. in 1701, and B.D. in 1710. He became fellow of Jesus College and vicar of Swavesey, and in 1711 was chosen Adams Professor of Arabic in the university. He had a large family, and his latter days were embittered by pecuniary embarrassments, which form the subject of a chapter in Isaac D'Israeli's Calamities of Authors. The preface to the second volume of his History of the Saracens is dated from Cambridge Castle, where he lay a prisoner for debt."]}, {"page": "1848", "response": ["* January 19 – Isaac D'Israeli, English author (b. 1766)"]}, {"page": "1766", "response": ["* May 11 – Isaac D'Israeli, English literary scholar (died 1848)"]}, {"page": "Philippe de Commines", "response": ["Commines was a great favorite with Duke Charles for seven years (going back to when he had still been Count of Charolais). The 19th-century scholar Isaac D'Israeli, recounts that one day, when they came home from hunting and were joking around as was their wont within the \"family\", Commines \"ordered\" the prince to remove Commines's boots as if he were a servant; laughing, the prince did so but then tossed the boot at Commines, and it bloodied his nose. Everyone in the Burgundian court started calling Commines \"booted head\". D'Israeli, in his 1824 Curiosities of Literature, suggests that Commines's hatred for the duke of Burgundy poisoned everything he wrote about him, but comments:"]}, {"page": "Hellenism (modern religion)", "response": ["Another example of an 18th-century literary figure who may have considered himself a Hellenist was Thomas Taylor (1758–1835), who produced the first English translations of many neoplatonic philosophical and religious texts. Taylor was widely known as the \"English Platonist\", and rumors existed that he had produced anonymous pamphlets advocating a return to a sort of pagan religion (these rumors have been debunked by modern scholarsAddey, Tim. Why Thomas Taylor is not the author of A New System of Religion. Prometheus Trust.). Though the extent of his actual devotion to Ancient Greek spirituality remains unknown, brief descriptions written by others about him tend to portray him as a sincerely devout polytheist. One such sketch, written by Isaac D'Israeli, describes Taylor delaying answering his door until he has finished his mid-day hymn to Apollo, and reports that his study contained a hanging globe of clear glass, representing Zeus, that scattered sunbeams he would use to read and write, shifting his position in the room to follow them throughout the day."]}, {"page": "Benjamin D'Israeli (merchant)", "response": ["D'Israeli married twice.  Firstly, on 2 April 1756, he married Rebecca Mendez Furtado, a woman of Portuguese origin. They had a daughter called Rachel. Within a few months of Rebecca's death on 1 February 1765 he married secondly Sarah Siprut de Gabay Villareal, on 28 May 1765.  Their only child Isaac D'Israeli was born the next year, on 11 May 1766."]}, {"page": "Piers Plowman", "response": ["Thomas Fuller (1662) bases his remarks about Langland on Selden and Bale, emphasizing Langland's putative proto-Protestant status. Fuller also notes that The Praier and Complaynte of the Ploweman unto Christe was \"first set forth by Tindal, since, exemplified by Mr. Fox.\" Since the language of this text is similar to that of Piers Plowman, Fuller attributes it to Langland as well. Thomas Dudley, father of Anne Dudley Bradstreet (1612–72), brought a copy of Crowley's Piers Plowman to America. Alexander Pope (1688–1744) owned a copy of Rogers' reprint of Crowley's edition of Piers Plowman with the Crede appended, and Isaac D'Israeli (1766–1848) wrote in his Amenities of Literature that Pope had \"very carefully analyzed the whole\" of the latter text. D'Israeli also mentions Lord Byron's (1788–1824) praise for Piers Plowman."]}, {"page": "1848 in literature", "response": ["*January 19 – Isaac D'Israeli, English scholar and man of letters (born 1766)"]}, {"page": "1791 in literature", "response": ["*Isaac D'Israeli – Curiosities of Literature (Volume 1)"]}, {"page": "1766 in literature", "response": ["*May 11 – Isaac D'Israeli, English literary scholar (died 1848)"]}, {"page": "Droit du seigneur", "response": ["In his best-selling book, The Curiosities of Literature (1823), British writer Isaac D'Israeli stated the practice had been widespread across Europe."]}, {"page": "Early life of Isaac Newton", "response": ["It is supposed that it was at Woolsthorpe in the summer of 1666 that Newton's thoughts were directed to the subject of gravity. They are said to have been inspired by Newton's seeing an apple fall from a tree on his mother's farm, a version for which there is reasonable historical evidence. In one version of the story, the apple is supposed to have fallen on Newton's head; this version appears to have been invented by Isaac D'Israeli. Voltaire is the authority for the former version of the story. He had his information from Newton's favourite niece Catherine Barton, who married John Conduitt, a fellow of the Royal Society, and one of Newton's intimate friends. How much truth there is in what is a plausible and a favourite story can never be known, but it is certain that tradition marked a tree as that from which the apple fell, until 1866, when, owing to decay, the tree was cut down and its wood carefully preserved."]}, {"page": "Hughenden Manor", "response": ["After passing through his extended family following a series of deaths and resultant will bequests, by 1816 the manor and lands were owned by John Norris, a distinguished antiquary and scholar. Isaac D'Israeli, the father of Benjamin Disraeli, British Prime Minister (1868 and 1874–1880, and Earl of Beaconsfield 1876), had for some time rented the nearby Bradenham Manor and, following Norris's death in 1845, bought the manor and lands from his executors in 1847. The purchase was supported with the help of a loan of £25,000 (equivalent to almost £1,500,000 today) from Lord Henry Bentinck and Lord Titchfield. This was because at the time, as Disraeli was leader of the Conservative Party, \"it was essential to represent a county,\" and county members had to be landowners. Taking ownership of the manor on the death of his father in 1848, Disraeli and his wife Mary Anne, alternated between Hughenden and several homes in London.", "In 1947, the Abbey family and the Disraelian Society made Hughenden over to the National Trust. In 1955, it was designated a Grade I listed building. The gardens are also listed Grade II on the Register of Historic Parks and Gardens. It is decorated as it might have been at the time it was occupied by Disraeli. It contains a collection of memorabilia including family portraits, Disraeli's own furnishings, a library including a collection of Disraeli's novels and one written and signed by Queen Victoria along with many of the books he inherited from his father, Isaac D'Israeli."]}, {"page": "Bradenham, Buckinghamshire", "response": ["Bradenham is the location of a grand red brick manor house, which in the 13th century was a property belonging to the Earl of Warwick. The house was fit for royalty, as in 1566 Queen Elizabeth I was entertained here by Lord Windsor.  The current manor house was substantially built by Sir Edmund Pye, 1st Baronet around 1670 with tall sash windows, steep roofs and slim brick chimneys. In the 19th century it was the home of Isaac D'Israeli who died there in 1848 and is buried in the church. His son Benjamin Disraeli, who became the prime minister, lived there for part of his early life. In the later Victorian era, the house was turned into a boarding school for local young gentlemen. Bradenham Manor is currently leased by the National Trust to Grant Thornton UK LLP as the firm's National Training Centre.  It is well known for its gardens."]}, {"page": "Grace Aguilar", "response": ["The book was nevertheless well-received, and Aguilar began publishing poems in small English journals. Isaac D'Israeli now chose to help her, possibly introducing her to Edward Moxon, his own publisher. Moxon in turn introduced her to R. Groombridge & Sons, the large publisher that would eventually bring out most of her work in Britain.Galchinsky, 23."]}, {"page": "Bloomsbury Square", "response": ["By the early 19th century, Bloomsbury was no longer fashionable with the upper classes. Consequently, the Duke of Bedford of the day moved out of Bedford House, which was demolished and replaced with further terraced houses. In the 19th century the square was occupied mainly by middle class professionals. The writer Isaac D'Israeli lived at No. 6 from 1817 to 1829 and for part of that time his son, the future Prime Minister Benjamin Disraeli lived with him. In the 20th century most of the buildings came to be used as offices.", "* No. 6 Isaac D'Israeli"]}, {"page": "William Shenstone", "response": ["Shenstone took no degree, but, while still at Oxford, he published Poems on various occasions, written for the entertainment of the author (1737). This edition was intended for private circulation only but, containing the first draft of The Schoolmistress, it attracted some wider attention. Shenstone tried hard to suppress it but in 1742 he published anonymously a revised draft of The Schoolmistress, a Poem in imitation of Spenser. The inspiration of the poem was Sarah Lloyd, teacher of the village school where Shenstone received his first education. Isaac D'Israeli contended that Robert Dodsley had been misled in publishing it as one of a sequence of Moral Poems, its intention having been satirical, as evidenced by the ludicrous index appended to its original publication."]}, {"page": "Sharon Turner", "response": ["Turner became a solicitor but left the profession after he became interested in the study of Icelandic and Anglo-Saxon literature. He settled himself in Red Lion Square near the British Museum, staying there for sixteen years. When his friend Isaac D'Israeli left the synagogue after a dispute with the rabbi, Turner persuaded him to have his children, including the future Prime Minister Benjamin Disraeli, baptised in the Church of England, to give them a better chance in life."]}, {"page": "John Murray (publishing house)", "response": ["The business was founded in London in 1768 by John Murray (1737–1793), an Edinburgh-born Royal Marines officer, who built up a list of authors including Isaac D'Israeli and published the English Review."]}, {"page": "Enfield Town railway station", "response": ["A house which had stood on the site since the late 17th century is said to have been the birthplace of Isaac D'Israeli, father of Benjamin Disraeli. It later became a school, at which John Keats was educated. It then became the original station-house before being demolished in 1872. The fine 17th-century brickwork facade, once attributed to Christopher Wren, was dismantled, and reconstructed at South Kensington Museum."]}, {"page": "Martin Folkes", "response": ["For Sir John Hill's attack on Folkes (Review of the Works of the Royal Soc., 1751), see Isaac D'Israeli, Calamities and Quarrels of Authors (1860), pp. 364–366."]}, {"page": "Isaac d'Israeli", "response": ["#REDIRECT Isaac D'Israeli "]}, {"page": "Spanish and Portuguese Jews", "response": ["*  Isaac D'Israeli – writer"]}, {"page": "Bevis Marks Synagogue", "response": ["Amongst the Chief Rabbis of the Anglo-Sephardic Community (Hahamim) who have served at Bevis Marks have been Daniel Nieto (1654–1728), Abraham Haliva (Halua) (1791-1853) and Moses Gaster (1856–1939).Barnett, pp. 14–16. Amongst other notable members of the synagogue's congregation have been the boxer Daniel Mendoza, and Isaac D'Israeli (father of Benjamin Disraeli), who resigned from the congregation after an argument over synagogue fees.Barnett, pp.17–19", "* Isaac D'Israeli (1766–1848), writer, scholar and man of letters, best known for his essays, his associations with other men of letters, and as the father of Prime Minister Benjamin Disraeli"]}, {"page": "Movement for Reform Judaism", "response": ["In the 1820s and 1830s, a small intellectual current arose in English Jewry, influenced by the Anglican environment which laid great emphasis on the Bible alone and scorned the Jews for valuing the Talmud. Represented by such figures as Isaac D'Israeli, they were sometimes named \"neo-Karaites\", though their actual knowledge of Karaism was scant. This group rejected rabbinic authority and espoused a bibliocentric view."]}, {"page": "Dirck Coornhert", "response": ["Isaac D'Israeli called him \"one of the fathers of Dutch literature, and even of their arts.\""]}, {"page": "Snap-dragon (game)", "response": ["Snap-dragons were also described in Isaac D'Israeli's The Curiosities of Literature (1791–1823). However, at this time it was not a parlour game but a drinking game, with the snap-dragons being \"small combustible bodies fired at one end and floated in a glass of liquor, which an experienced toper swallowed unharmed, while yet blazing.\" Sandys cites a related variant of Snap-dragon where a lit candle end is placed in a cup of ale or cider; the aim is to quaff the liquor without singeing one's face."]}, {"page": "The Fortunes of Nigel", "response": ["Scott's main sources for The Fortunes of Nigel were Jacobean dramas and other imaginative literature of the period, but he was also well acquainted with other contemporaneous publications and more recent studies. For his depiction of James, and details of events during his reign, he was able to draw extensively on his own edition, published in 1811, of Secret History of the Court of James the First, containing a set of contemporaneous or early memoirs and histories. The James of the novel is deliberately treated in a more balanced manner than had been the case in the laudatory An Inquiry into the Literary and Political Character of James I by Isaac D'Israeli (1816). The richness of Scott's treatment of the age is also a result in part of another, more extensive editorial project, his collection known as Somers' Tracts, which had appeared in 13 volumes between 1809 and 1815. Many of the details about Jacobean London in the novel are drawn from A Survey of the Cities of London and Westminster by John Stow, of which Scott owned the revised edition by John Strype published in 1720.Ibid., 520–26."]}]}}