{"wiki_id": "http://www.wikidata.org/entity/Q983746", "itemLabel": "Wally Hammond", "itemDescription": "English cricket player (1903-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Wally_Hammond", "wikipedia_page": {"main": "Walter Reginald Hammond (19 June 1903 – 1 July 1965) was an English first-class cricketer who played for Gloucestershire in a career that lasted from 1920 to 1951. Beginning as a professional, he later became an amateur and was appointed captain of England. Primarily a middle-order batsman, Wisden Cricketers' Almanack described him in his obituary as one of the four best batsmen in the history of cricket. He was considered to be the best English batsman of the 1930s by commentators and those with whom he played; they also said that he was one of the best slip fielders ever. Hammond was an effective fast-medium pace bowler and contemporaries believed that if he had been less reluctant to bowl, he could have achieved even more with the ball than he did.\nIn a Test career spanning 85 matches, he scored 7,249 runs and took 83 wickets. Hammond captained England in 20 of those Tests, winning four, losing three, and drawing 13. His career aggregate of runs was the highest in Test cricket until surpassed by Colin Cowdrey in 1970; his total of 22 Test centuries remained an English record until Alastair Cook surpassed it in December 2012. In 1933, he set a record for the highest individual Test innings of 336 not out, surpassed by Len Hutton in 1938. In all first-class cricket, he scored 50,551 runs and 167 centuries, respectively the seventh and third highest totals by a first-class cricketer.\nAlthough Hammond began his career in 1920, he was required to wait until 1923 before he could play full-time, after his qualification to play for Gloucestershire was challenged. His potential was spotted immediately and after three full seasons, he was chosen to visit the West Indies in 1925–26 as a member of a Marylebone Cricket Club touring party, but contracted a serious illness on the tour. He began to score heavily after his recovery in 1927 and was selected for England. In the 1928–29 series against Australia he scored 905 runs, then a record aggregate for a Test series. He dominated county cricket in the 1930s and, despite a mid-decade slump in Test form, was made captain of England in 1938. He continued as captain after the Second World War, but his health had deteriorated and he retired from first-class cricket after an unsuccessful tour of Australia in 1946–47. He appeared in two more first-class matches in the early 1950s.\nHammond was married twice, divorcing his first wife in acrimonious circumstances, and had a reputation for infidelity. His relationships with other players were difficult; teammates and opponents alike found him hard to get along with. He was unsuccessful in business dealings and failed to establish a successful career once he retired from cricket. He moved to South Africa in the 1950s in an attempt to start a business, but this came to nothing. As a result, he and his family struggled financially. Shortly after beginning a career as a sports administrator, he was involved in a serious car crash in 1960 which left him frail. He died of a heart attack in 1965.", "link_mentions": [{"page": "The Ashes", "response": ["Despite the debut of Donald Bradman, the inexperienced Australians, led by Jack Ryder, were heavily defeated, losing 4–1.Harte, pp. 312–316. England had a very strong batting side, with Wally Hammond contributing 905 runs at an average of 113.12, and Hobbs, Sutcliffe and Patsy Hendren all scoring heavily; the bowling was more than adequate, without being outstanding."]}, {"page": "June 19", "response": ["*  1903   – Wally Hammond, English cricketer and coach (d. 1965)"]}, {"page": "July 1", "response": ["*1965 – Wally Hammond, English cricketer (b. 1903)"]}, {"page": "Bodyline", "response": ["Bodyline continued to be bowled occasionally in the 1933 English season—most notably by Nottinghamshire, who had Carr, Voce and Larwood in their team.Perry, p. 141. Jardine himself had to face bodyline bowling in a Test match. The West Indian cricket team toured England in 1933, and, in the second Test at Old Trafford, Jackie Grant, their captain, decided to try bodyline. He had a couple of fast bowlers, Manny Martindale and Learie Constantine. Facing bodyline tactics for the first time, England first suffered, falling to 134 for 4, with Wally Hammond being hit on the chin, though he recovered to continue his innings. Then Jardine himself faced Martindale and Constantine. Jardine never flinched. With Les Ames finding himself in difficulties, Jardine said, \"You get yourself down this end, Les. I'll take care of this bloody nonsense.\"Douglas, p.166. He played right back to the bouncers, standing on tiptoe, and played them with a dead bat, sometimes playing the ball one handed for more control. While the Old Trafford pitch was not as suited to bodyline as the hard Australian wickets, Martindale did take 5 for 73, but Constantine only took 1 for 55. Jardine himself made 127, his only Test century. In the West Indian second innings, Clark bowled bodyline back to the West Indians, taking 2 for 64. The match in the end was drawn but played a large part in turning English opinion against bodyline. The Times used the word bodyline, without using inverted commas or using the qualification so-called, for the first time.Douglas, p.168. Wisden also said that \"most of those watching it for the first time must have come to the conclusion that, while strictly within the law, it was not nice.\"See Cricinfo for the scorecard of the second Test between England and West Indies in 1933.", "The English players and management were consistent in referring to their tactic as fast leg theory considering it to be a variant of the established and unobjectionable leg theory tactic. The inflammatory term \"bodyline\" was coined and perpetuated by the Australian press (see below). English writers used the term fast leg theory. The terminology reflected differences in understanding, as neither the English public nor the Board of the Marylebone Cricket Club (MCC)—the governing body of English cricket—could understand why the Australians were complaining about what they perceived as a commonly used tactic. Some concluded that the Australian cricket authorities and public were sore losers.Frith, pp. 142, 222, 231–238.Pollard, p. 258. Of the four fast bowlers in the tour party, Gubby Allen was a voice of dissent in the English camp, refusing to bowl short on the leg side, and writing several letters home to England critical of Jardine, although he did not express this in public in Australia. A number of other players, while maintaining a united front in public, also deplored bodyline in private. The amateurs Bob Wyatt (the vice-captain), Freddie Brown and the Nawab of Pataudi opposed it, as did Wally Hammond and Les Ames among the professionals.E. W. Swanton. Sort of a Cricket Person, William Collins & Sons, 1972, p. 19."]}, {"page": "Melbourne Cricket Ground", "response": ["| Wally Hammond"]}, {"page": "1930s", "response": ["* Wally Hammond (English cricketer)"]}, {"page": "1920s", "response": ["* The English team led by Wally Hammond defeats Australia in The Ashes series (Test Cricket)"]}, {"page": "1903", "response": ["** Wally Hammond, English cricketer (d. 1965)"]}, {"page": "1965", "response": ["* July 1 – Wally Hammond, English cricketer (b. 1903)"]}, {"page": "1933", "response": ["* April 2 – As a member of the English cricket team touring New Zealand, 1933, batsman Wally Hammond scores a record 336 runs in a test match at Eden Park, Auckland."]}, {"page": "Don Bradman", "response": ["Controversy emerged on the first day of the First Test at Brisbane. After compiling an uneasy 28 runs, Bradman hit a ball to the gully fieldsman, Jack Ikin. \"An appeal for a catch was denied in the umpire's contentious ruling that it was a bump ball\". At the end of the over, England captain Wally Hammond spoke with Bradman and criticised him for not \"walking\"; \"from then on the series was a cricketing war just when most people desired peace\", Whitington wrote.Whitington (1974), p. 190. Bradman regained his finest pre-war form in making 187, followed by 234 during the Second Test at Sydney (Sid Barnes also scored 234 during the innings, many in a still standing record 405 run 5th Wicket partnership with Bradman. Barnes later recalled that he purposely got out on 234 because \"it wouldn't be right for someone to make more runs than Bradman\"). Australia won both matches by an innings. Jack Fingleton speculated that had the decision at Brisbane gone against him, Bradman would have retired, such were his fitness problems.Fingleton (1949), p. 22. In the remainder of the series, Bradman made three half-centuries in six innings, but was unable to make another century; nevertheless, his team won handsomely, 3–0. He was the leading batsman on either side, with an average of 97.14. Nearly 850,000 spectators watched the Tests, which helped lift public spirits after the war.Bradman (1950), p. 139.", "For comparison, the next highest totals of Test double hundreds are Kumar Sangakkara's 11 in 223 innings (4.9%), Brian Lara's 9 in 232 innings (3.9%), and Wally Hammond's 7 in 140 innings (5%); the next highest rate of scoring Test double centuries was achieved by Vinod Kambli, whose 21 innings included 2 double centuries (9.5%)."]}, {"page": "Colin Cowdrey", "response": ["Michael Colin Cowdrey, Baron Cowdrey of Tonbridge,  (24 December 19324 December 2000) was an English first-class cricketer who played for Oxford University (1952–1954), Kent County Cricket Club (1950–1976) and England (1954–1975). Universally known as Colin Cowdrey, he \"delighted crowds throughout the world with his style and elegance\",Graveney, p. 54 and was the first cricketer to play 100 Test matches, celebrating the occasion with 104 against Australia in 1968. In all he played 114 Tests, making 7,624 runs at an average of 44.06, overtaking Wally Hammond as the most prolific Test batsman, and taking 120 catches as a fielder, breaking another Hammond record. Cowdrey made 22 Test centuries (an England record until 2013) and was the first batsman to make centuries against the six other Test playing countries of his era; Australia, South Africa, the West Indies, New Zealand, India and Pakistan, making hundreds against them all both home and away. He toured Australia six times in 1954–55, 1958–59, 1962–63, 1965–66, 1970–71 and 1974–75, equalling Johnny Briggs's record, and in his last Test fans hung out a banner 'M.C.G. FANS THANK COLIN – 6 TOURS'.", "Though Cowdrey still had his supporters at Lords Smith was kept as captain for the 1965–66 Ashes series with Cowdrey as vice-captain, but they knew each other as schoolboys and Oxford undergraduates and got on well. Cowdrey was ill for most of December and missed the First Test. He made 104 in the Second Test at Melbourne, where England made 558, their biggest total down under since 636 in the Second Test in 1928–29. He did little on the tour except to make 63 and 108 against the weak Tasmanian attack and the series was drawn 1–1 with the batsmen on both sides scoring heavily. Cowdrey himself made 267 runs (53.40), his best batting average in an Ashes series. Carrying on to New Zealand Cowdrey made a duck in the First Test, but recovered with 89 not out in the Second and 58 in the Third which made him the fifth player after Wally Hammond, Don Bradman, Len Hutton and Neil Harvey to make 6,000 Test runs, but the rain affected series was drawn 0–0. ", "The Third Test at Edgbaston was Cowdrey's 100th, the first time that anyone had completed a century of Tests. He celebrated by making 104, using Boycott as a runner after straining his leg. He became the second batsman after Wally Hammond to make 7,000 Test runs, but England took 172.5 overs to make 409 and though Australia only made 222 the match was drawn. Both Cowdrey and the Australian captain Bill Lawry were unfit for the Fourth Test, which was drawn when England finished on 230/4 needing 326. Australia's 1–0 lead ensured that they held onto the Ashes, but Cowdrey went to the Fifth Test determined to at least even the series. As the ball was swinging at the Oval that season he wanted the bowlers Tom Cartwright and Barry Knight, but they were both unfit and the opener Roger Prideaux caught a virus of the eve of the Test. D'Oliveira was an all-rounder who could swing the ball so Cowdrey asked for him to cover both needs and he made a politically important 158 in England's 494.Cowdrey, pp. 197–99 Australia made 325 and dismissed England for 181, but collapsed to 85/5 at lunch on the last day needing 352 to win when a deluge flooded the Oval. The players started packing their bags, but Cowdrey called on the crowd to help the groundstaff dry the ground. \"Like a modern-day King Canute he rolled up his trousers, waded into the water...and supervised the mopping up operations of hundreds of volunteers\",John Snow, Cricket Rebel: An Autobiography, Littlehampton Book Services Ltd (1976), p. 61 Derek Underwood took 7/50 and England won by 226 runs with six minutes to spare. Kent came second to Yorkshire again in the County Championship, winning more matches, but falling behind on bonus points. ", "With the South African tour cancelled a new one was arranged to Ceylon and Pakistan, which was in political turmoil that resulted in the fall of President Ayub Khan and imposition of martial law by his successor General Yahya Khan. After a few easy-going matches in Ceylon the tour match against the West Pakistan Governor's XI saw play abandoned after 25 overs, there were no other tour matches and all the Tests were affected by political demonstrations against the military regime. In the First Test at Lahore Cowdrey won the toss and made exactly 100, his 22nd Test century to match Wally Hammond's England record. England made 309, dismissed Pakistan for 209 and Cowdrey declared the second innings at 225/9 to give them 326 to win, but Pakistan made 203/5 for a draw. Saeed Ahmed won the toss in the Second Test at Dacca in East Pakistan, soon to be Bangladesh, where there was rioting and gunfire around the team hotel.Snow, pp. 66–68 Pakistan made 246, which was matched by England's 274, thanks to D'Oliveira's 114 not out. Pakistan took 101 overs to make 196/5 and a token declaration left England to make 33/0. Cowdrey won the toss again in the Third Test at Karachi, but there were riots on the first two days by fans who wanted Hanif Mohammad as captain instead of Saeed. England piled up 502/7, with Colin Milburn making 139 and Tom Graveney 105, but the match was abandoned after demonstrators wrecked the stadium on the morning of the third day, leaving Alan Knott stranded on 96 not out. Cowdrey was not there to see it as he left on the second day after his father-in-law died,Cowdrey, p. 78 leaving Graveney in charge. The team followed on the third day, with manager Les Ames abandoning the Test and the rest of the tour to save the team.Snow, p. 73", "The South African tour was cancelled and as the cricketers needed practice against a top team before going to Australia, and to fill MCC coffers, a Rest of the World XI under Gary Sobers was organised from overseas cricketers playing for English counties. Cowdrey was still easing himself back into cricket when the First 'Test' was played and he was not selected, but played in the other four and made 1 and 64 in the Second, 0 and 71 in the Third, 1 and 0 in the Fourth and 73 and 31 in the Fifth, a total of 241 runs (30.13). England lost the series 4–1, but three of their defeats were close and they were playing the best team in the world. These were counted as Tests at the time, but the ICC subsequently disallowed them. This meant that Cowdrey passed Wally Hammond's record of 7,249 Test runs when he made 71 at Trent Bridge to become the most prolific Test batsmen, and would do it again in Australia. ", "In the First Test he overtook Wally Hammond's record of 7,249 runs to become the most prolific Test batsmen, a record he held for a year when it was overtaken by Gary Sobers. Cowdrey made only 1 run in the inaugural One Day International at Melbourne and was dropped for the Fourth Test, had his cap stolen while fielding in the Fifth Test and was dropped again for the Sixth and Seventh Tests. Illingworth won an argumentative series 2–0 and regained the Ashes, but Cowdrey only made 82 runs (20.50) in the series. They carried on to New Zealand, Cowdrey missed the First Test and needed a runner to make 54 and 45 in the Second Test at Auckland, coming in at 63/4 in the second innings when New Zealand had a real chance of winning their first victory against England, but he added 76 with Alan Knott (96), and the danger was averted. ", "Cowdrey made 22 Test centuriesList of international centuries scored by Colin Cowdrey, CricInfo. Retrieved 6 February 2020. to match Wally Hammond's England record, subsequently equaled by Geoff Boycott and Ian Bell, and exceeded by Alastair Cook, Kevin Pietersen and Joe Root. Of the 22 Tests in which Cowdrey made a hundred, England won 10, drew 11 and lost 1, when he made 105 against South Africa at Trent Bridge in 1965. Cowdrey was the first man to score a Test century against six different nations: Australia, South Africa, the West Indies, New Zealand, India and Pakistan, all the Test nations of his day.John Arlott, \"John Arlott's 100 Greatest Batsmen\", Queen Anne Press (1986), p. 58"]}, {"page": "1938 in sports", "response": ["* Most runs – Wally Hammond 3,011 @ 75.27 (HS 271)"]}, {"page": "Jack Hobbs", "response": ["Hobbs began 1930 in good form,McKinstry, p. 325. and, with Rhodes, was added to the selection panel again for the Ashes series that season. In the first Test, Hobbs scored 78 and 74; he top-scored in both innings,McKinstry, pp. 326–27. but failed in the next two Tests. Before the third and fourth Tests, feeling tired and concerned by his form, he offered to stand down but the other selectors declined his suggestion.McKinstry, pp. 330–31. When he batted in the fourth Test, he shared an opening partnership of 108 with Sutcliffe, their 11th century stand against Australia. After two hours batting, he was out for 31.McKinstry, p. 331. With the series level at 1–1, the final Test was to be played to a finish, but before it began, Hobbs announced that it would be his last. Shortly after making the decision, he returned to form, scoring a century and passing, in his next game, W. G. Grace's record career-aggregate of 54,896 first-class runs.McKinstry, p. 332. Before the deciding Test, the selectors sacked Percy Chapman as captain. The press speculated that Hobbs would replace him, but Bob Wyatt was chosen; Hobbs may have turned down an offer of the captaincy at the meeting of selectors. In the match, Hobbs scored 47 in the first innings. When he came out to bat in the second, in the face of a large Australian first-innings lead, Hobbs was given an ovation by the crowd and the Australian fielders gave him three cheers. Hobbs was moved by his reception but scored only nine runs before he was dismissed, and Australia won the match and series.McKinstry, pp. 337–38. In his final series, he scored 301 runs at 33.44. In 61 Tests, he had scored 5,410 runs at an average of 56.94. He retired as the leading run-scorer in Test matches, a record he held until it was passed by Wally Hammond in 1937. Maintaining his form for the rest of the season, Hobbs scored 2,103 first-class runs in 1930 at 51.29.McKinstry, p. 343."]}, {"page": "List of Test cricket records", "response": ["|  Wally Hammond || 27 November 1970 || 33 years, 151 days", "|  Wally Hammond |||| Eden Park, Auckland || 1932–33||Test No. 226", "|  Wally Hammond || v , 1928–29", "|  Wally Hammond || 85"]}, {"page": "Bill O'Reilly (cricketer)", "response": ["O'Reilly became a regular member of the Australian Test side in the 1932–33 season and he played in all five Tests against England in the infamous Bodyline series. The Australian selectors perceived that O'Reilly would be their key bowler, and as he had never played against the English, omitted him from the early tour matches so that the tourists would not be able to decode his variations. As a result, he missed the Australian XI match against the Englishmen in Melbourne. In two Shield matches ahead of the Tests, he took 14 wickets, including a total of 9/66 in an innings win over Queensland. Although the national selectors had hidden him from the Englishmen, New South Wales declined to do so, and he played for his state a week ahead of the Tests. The hosts were bombarded with short-pitched bowling and heavily beaten by an innings; O'Reilly took 4/86 as the visitors amassed 530, dismissing leading English batsman Wally Hammond in the first of many battles between the pair.McHarg, p. 67.", "O'Reilly's wickets were at increased cost—his average increased to 22 runs per wicket—and he took five wickets in an innings only once, in the First Test at the 'Gabba in Brisbane, which England won convincingly. The circumstances of the series determined O'Reilly's role: after England won the first two Tests, O'Reilly appeared to have been given the job not just of bowling the opposition out, but also of containing them, and he was criticised in Wisden for defensive bowling. Wisden even went as far as to describe it as \"leg theory\".Wisden (1938), p. 780. If the intention was to stifle England batsman Wally Hammond in particular, then it appears to have worked, but O'Reilly's figures for the series suggest he was consistent but not always penetrative. Morris Sievers, from fewer matches, outperformed his average; Leslie Fleetwood-Smith, a slow left-arm spinner, got more eye-catching individual figures, including 10 wickets in the victory at Adelaide. Whatever the methods, they were successful: having lost the first two Tests, Australia proceeded to win the final three to retain The Ashes they had regained in England in 1934, and O'Reilly's five for 51 and three for 58 were the best figures in the decisive Fifth Test in Melbourne.Wisden (1938), pp. 810–811."]}, {"page": "1933 in sports", "response": ["* Most runs – Wally Hammond 3323 @ 67.81 (HS 264)"]}, {"page": "Cirencester Grammar School", "response": ["* Wally Hammond, cricketer whose centenary was celebrated at a reunion in Cirencester in 2003."]}, {"page": "1927 in sports", "response": ["* Most runs – Wally Hammond 2969 @ 69.04 (HS 197)", "* Wisden Cricketers of the Year – Roger Blunt, Charlie Hallows, Wally Hammond, Douglas Jardine, Vallance Jupp"]}, {"page": "Geoffrey Boycott", "response": ["Over Boycott's 18-year career he scored 8,114 runs in 108 Test matches for England. He was the first England cricketer to pass 8,000 Test runs and, as of 2015, is seventh on England's all-time run scoring list (behind Alastair Cook, Graham Gooch, Joe Root, Alec Stewart, David Gower and Kevin Pietersen). His average of 47.72 runs over 193 innings is the highest completed career average by an England player since 1970. His Test career included 22 centuries, third in England's records, held jointly with Wally Hammond, Colin Cowdrey, and Ian Bell and surpassed only by Pietersen (23) and Cook (33). England did not lose a Test match in which he scored a century and only 20 of his 108 Tests ended in defeat. John Arlott wrote in 1979 that \"any expectation of an English win, except in freak bowling conditions, is based on a major innings from Boycott.\""]}]}}