{"wiki_id": "http://www.wikidata.org/entity/Q984402", "itemLabel": "James Thomson", "itemDescription": "Scottish writer (1834-1882)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Thomson_(poet,_born_1834)", "wikipedia_page": {"main": "James Thomson (23 November 1834 – 3 June 1882), who wrote under the pseudonym Bysshe Vanolis, was a Scottish Victorian era poet famous primarily for the long poem The City of Dreadful Night (1874), an expression of bleak pessimism in a dehumanized, uncaring urban environment. Thomson's pseudonym derives from the names of the poets Percy Bysshe Shelley and Novalis. He is often distinguished from the earlier Scottish poet James Thomson by the letters B.V. after his name.Thomson's poems rarely appear in modern anthologies, although the autobiographical \"Insomnia\" and \"Mater Tenebrarum\" are well-regarded and contain some striking passages. He admired and translated the works of the pessimistic Italian poet Giacomo Leopardi (1798–1837), but his pessimism is considered to have been stronger than that of Leopardi. He is regarded as one of the bleakest Victorian poets, being described as \"The Laureate of Pessimism\" since 1882, the year of his death.", "link_mentions": [{"page": "List of English-language poets", "response": ["*James Thomson (1700–1748, S)", "*James Thomson (awa Bysshe Vanolis, 1834–1882, S)"]}, {"page": "Pessimism", "response": ["Philosophical pessimism has often been tied to the arts and literature. Schopenhauer's philosophy was very popular with composers (Wagner, Brahms and Mahler)., The Stanford Encyclopedia of Philosophy (Winter 2011 Edition), Edward N. Zalta (ed.) While there are earlier examples of literary pessimism, such as in the work of Miguel de Cervantes, several philosophical pessimists also wrote novels or poetry (Camus and Leopardi respectively). A distinctive literary form which has been associated with pessimism is aphoristic writing, and this can be seen in Leopardi, Nietzsche and Cioran. Nineteenth and twentieth-century writers who could be said to express pessimistic views in their works or to be influenced by pessimistic philosophers include Charles Baudelaire, Samuel Beckett, Gottfried Benn, Jorge Luis Borges, Charles Bukowski, Dino Buzzati, Lord Byron, Louis-Ferdinand Céline, Joseph Conrad, Fyodor Dostoevsky, Mihai Eminescu, Sigmund Freud, Thomas Hardy, Sadegh Hedayat, H. P. Lovecraft, Thomas Mann, Camilo Pessanha, Edgar Saltus and James Thomson. Late-twentieth and twenty-first century authors who could be said to express or explore philosophical pessimism include David Benatar, Thomas Bernhard, Friedrich Dürrenmatt, John Gray, Michel Houellebecq, Alexander Kluge, Thomas Ligotti, Cormac McCarthy, Eugene Thacker, and Peter Wessel Zapffe."]}, {"page": "Highgate Cemetery", "response": ["* James Thomson, Victorian poet, best known for The City of Dreadful Night"]}, {"page": "1834 in literature", "response": ["*November 23 – James Thomson (\"Bysshe Vanolis\"), Scottish poet (died 1882)"]}, {"page": "James Thomson (poet, born 1700)", "response": ["James Thomson (c. 11 September 1700 – 27 August 1748) was a British poet and playwright, known for his poems The Seasons and The Castle of Indolence, and for the lyrics of \"Rule, Britannia!\".", "James Thomson was born in Ednam in Roxburghshire around 11 September 1700 and baptised on 15 September.11 September is the date of birth given in Murdoch, Patrick, 'An Account of the Life and Writings of Mr. James Thomson', in The Works of James Thomson (1762), vol. i, p.i. He was the fourth of nine children of Thomas Thomson and Beatrix Thomson (née Trotter).Sambrook, James, James Thomson 1700–1748; A Life (Oxford: Clarendon Press, 1991) Beatrix Thomson was born in Fogo, Berwickshire and was a distant relation of the house of Hume. Thomas Thomson was the Presbyterian minister of Ednam until eight weeks after Thomson's birth, when he was admitted as minister of Southdean, where Thomson spent most of his early years.", "Thomson may have attended the parish school of Southdean before going to the grammar school in Jedburgh in 1712. He failed to distinguish himself there. Shiels, his earliest biographer, writes: 'far from appearing to possess a sprightly genius, [Thomson] was considered by his schoolmaster, and those which directed his education, as being really without a common share of parts'.Robert Sheilds, 'Mr James Thomson' in Theophilus Cibber, Lives of the Poets of Great-Britain and Ireland (1753), vol. v, p.190. He was, however, encouraged to write poetry by Robert Riccaltoun (1691–1769), a farmer, poet and Presbyterian minister; and Sir William Bennet (d. 1729), a whig laird who was a patron of Allan Ramsay.Sambrook, 2004 While some early poems by Thomson survive, he burned most of them on New Year's Day each year.Murdoch, p.iii..", "Thomson entered the College of Edinburgh in autumn 1715, destined for the Presbyterian ministry. At Edinburgh he studied metaphysics, Logic, Ethics, Greek, Latin and Natural Philosophy.  He completed his arts course in 1719 but chose not to graduate, instead entering Divinity Hall to become a minister.Drennon, Herbert, 'James Thomson's Contact with Newtonianism and his interest in Natural Philosophy', PMLA, vol. 49, no. 1 (1934) p.72. In 1716 Thomas Thomson died, with local legend saying that he was killed whilst performing an exorcism. At Edinburgh Thomson became a member of the Grotesque Club, a literary group, and he met his lifelong friend David Mallet. After the successful publication of some of his poems in the \"Edinburgh Miscellany\" Thomson followed Mallet to London in February 1725 in an effort to publish his verse.", "thumb|The poet James Thomson as depicted on the Scott Monument", "*The four seasons, and other poems. By James Thomson. London: printed for J. Millan, near Scotland-Yard, White-Hall; and A. Millar, in the Strand, M.DCC.XXXV., 1735. [2];77,[3];64;72;79,[1]p., plates; 8⁰. (ESTC T83; Foxon T242; OTA K019862.000)", "*Patrick Murdoch (ed.), The Works of James Thomson, with his last corrections and improvements, prefixed by an account of his life and writings (Royal Quarto edition, A. Millar, London 1762); Dublin printing by John Exshaw, 1767; Murdoch's revised 4-volume edition of (A. Millar and T. Cadell, London 1768), with Lord Lyttelton's annotations, and 1772-3 edition (R. Clarke, Edinburgh 1772), (W. Bowyer, etc., London 1773) and subsequent versions.", "*Bayne, William, Life of James Thomson, Edinburgh: Oliphant, Anderson and Ferrier, 1898, (\"Famous Scots Series\").", "* James Thomson at the Eighteenth-Century Poetry Archive (ECPA)", "* Selected Poetry of James Thomson (1700–1748), Representative Poetry On-line", "* Local History Notes: James Thomson (1700–1748), London Borough of Richmond upon Thames"]}, {"page": "Harvard Classics", "response": ["*James Thomson", "*James Thomson (B.V.)"]}, {"page": "James Thomson", "response": ["* James Thomson (architect) (1852–1927), Scottish architect, city architect of Dundee", "* James Thomson (poet, born 1700) (1700–1748), Scottish poet and playwright", "* James Thomson (weaver poet) (1763–1832), Scottish poet", "* James Thomson (poet, born 1834) (1834–1882), Scottish poet", "* James Thomson (engraver) (1788–1850), English engraver, known for his portraits", "* James Thomson (journalist) (1852–1934), Australian journalist and newspaper owner", "* James Thomson (minister) (1768–1855), Scottish editor of the Encyclopædia Britannica", "* James Thomson (Australian politician) (1856–?), New South Wales politician", "* James Thomson (London politician) (born 1966), Common Councilman, Walbrook ward", "* James Thomson (Manitoba politician) (1854–?), politician in Manitoba, Canada", "* James Thomson (Pittsburgh mayor) (1790–1876), US political figure", "* James Thomson (Victorian politician) (1797–1859), pastoralist and politician in colonial Victoria", "* James Thomson (calico printer) (1779–1850), English industrial chemist", "* James Thomson (cell biologist) (born 1958), stem cell researcher", "* James Thomson (engineer) (1822–1892), engineer and professor, older brother of William Thomson, 1st Baron Kelvin", "* James Thomson (entomologist) (1828–1897), American entomologist", "* James Thomson (mathematician) (1786–1849), Irish professor of mathematics, father of William Thomson, 1st Baron Kelvin", "* James Thomson (footballer), Scottish footballer who played for Manchester United before World War I", "* James Thomson (Queen's Park footballer), Scottish footballer", "* James Thomson (Australian rules footballer) (born 1988)", "* James Thomson (cricketer) (1852–1890), New Zealand cricketer", "* James Thomson (rower) (1910–1962), American Olympic rower", "* James Thomson (executive), CEO of RAND Corporation"]}, {"page": "Bysshe Vanolis", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "James Thomson (B. V.)", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "James Thomson (BV)", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "James Thomson ('B.V.')", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "Joseph Parry", "response": ["Parry was also involved in music-related publishing.  Beginning in 1861, he was a regular contributor of Tonic sol-fa material to the Welsh music journal, Y cerddor Cymreig. Parry's work with making Tonic sol-fa accessible allowed everyone with an interest in choral work to participate. He edited Cambrian Minstrelsie (A National Collection of Welsh Songs) in 1893. He also compiled Dr Parry's Book of Songs, which was a collection of his own works, and wrote Elfenau Cerddoriaeth (\"Elements of Music\"), a Welsh handbook on theory, in 1888. In 1895, Parry entered into an agreement with an American music publishing firm, the John Church Company. The company published some of Parry's songs along with English translations of poems by Heinrich Heine.  The translations were done by poets of note, including James Thomson. Since it is doubtful that Parry was familiar with Heine's work, there is the possibility that Parry was commissioned by the company to write the songs during an extensive US trip he had made the year before."]}, {"page": "James Thomson ('B. V.')", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "1834 in the United Kingdom", "response": ["* 23 November – James Thomson (\"B.V.\"), Scottish-born poet (died 1882)"]}, {"page": "1874 in poetry", "response": ["* James Thomson, The City of Dreadful Night, published in the National Reformer, and later in 1880"]}, {"page": "1882 in poetry", "response": ["* June 3 – James Thomson, 48, British poet whose fame rests primarily upon the reputation of his long poem of 1874, The City of Dreadful Night"]}, {"page": "1834 in poetry", "response": ["* 23 November – James Thomson (died 1882), Scottish poet publishing under the pen name \"Bysshe Vanolis\""]}, {"page": "1882 in the United Kingdom", "response": ["* 3 June – James Thomson (\"B.V.\"), Scottish-born poet (born 1834)"]}, {"page": "James Thomson (weaver poet)", "response": ["James Thomson (10 September 1763 – 1832) was a Scottish weaver poet of Currie, near Edinburgh, whose poetry in the Scottish vernacular was published in Leith in the early 19th century. He is remembered by the Poet's Glen in Currie, a wooded dell with a scenic riverside path which is a right of way, and by a number of street names (Thomson Road, Thomson Drive, Thomson Crescent) in the east of Currie.", "When James Thomson was born on 10 September 1763 in Edinburgh, his parents were too poor to bring him up and when he was four months old they sent him to be brought up by his mother's parents in the small village of Kenleith in the parish of Currie, where his grandfather was a weaver. The name Kenleith comes from Killeith, the chapel of the Water of Leith, which was the original name for the village of Currie. The farm where Thomson lived lies higher up the Kinleith Burn to the south of Currie Kirk, and is now known as Mid Kinleith.", "With the minister's encouragement, a book of Poems, in the Scottish dialect by James Thomson, Weaver in Kinleith, was published in 1801, printed by J. Fillans & Sons, Edinburgh, and published by W. Reid, Leith, for the Author. This opened with An Account of the Author, giving his life story, and a Dedication to the Merchants of Leith. The contents include a sharp epigram:", "The Kinleith Burn below Thomson's house has been named the \"Poet's Burn\", after James Thomson, the \"Weaver Poet\", and it runs down the steeply sloping \"Poet's Glen\" down to near Currie Kirk where it flows into the Water of Leith after passing under a bridge of the Water of Leith Walkway."]}, {"page": "1834 in Scotland", "response": ["* 23 November – James Thomson (\"B.V.\"), poet (died 1882 in London)"]}, {"page": "James Thomson (B.V.)", "response": ["#REDIRECT James Thomson (poet, born 1834)"]}, {"page": "Austin Holyoake", "response": ["Austin Holyoake died, aged 47, from consumption on 10 April 1874 at Johnson's Court, and was buried on the eastern side of Highgate Cemetery with the secular service he had composed. His close friend, the poet James Thomson was buried in the same grave eight years later.", "During a debate in the House of Lords in 1876, the Marquess of Salisbury used the example of Holyoake's service as a warning about changing the rules concerning nonconformist burials I hold in my hand a burial service by Austin Holyoake, one of the first sentences of which is directed towards a repudiation of the doctrine of immortality. I may quote a single verse from a hymn - \"parsons may preach and the fanatics rave / Of existence beyond the dark grave. / Their heaven, they say, is far up above, / But mine is on earth, and I call it Love.\"thumb|Large or Small Families, a pamphlet by Austin HolyoakeIn 1882, Holyoake's close friend, the poet James Thomson, was buried in the same grave with an adaptation of the burial service written by, and given for, Holyoake."]}, {"page": "Bertram Dobell", "response": ["Dobell formed close friendships with a number of contemporary writers, most notably the poet James Thomson, whose poems he helped publish in book form.", "As an author, Dobell was best known for his editions of the works of Thomas Traherne (whose unpublished manuscripts he had discovered), Shelley, Goldsmith, Strode and James Thomson.", "Dobell's other books included A Century of Sonnets (1910), and the biographies Sidelights on Charles Lamb (1903) and The Laureate of Pessimism: a Sketch of the Life of James Thomson (1910)."]}]}}