{"wiki_id": "http://www.wikidata.org/entity/Q984209", "itemLabel": "William Symington", "itemDescription": "British engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Symington", "wikipedia_page": {"main": "William Symington (1764–1831) was a Scottish engineer and inventor, and the builder of the first practical steamboat, the Charlotte Dundas.", "link_mentions": [{"page": "List of Scots", "response": ["* William Symington (1764–1831), engineer, built the first practical steam boat"]}, {"page": "Robert Fulton", "response": ["As early as 1793, Fulton proposed plans for steam-powered vessels to both the United States and British governments. The first steamships had appeared considerably earlier. The earliest steam-powered ship, in which the engine moved oars, was built by Claude de Jouffroy in France. Called Palmipède, it was tested on the Doubs in 1776. In 1783, de Jouffroy built , the first paddle steamer, which sailed successfully on the Saône. The first successful trial run of a steamboat in America had been made by inventor John Fitch, on the Delaware River on August 22, 1787. William Symington had successfully tried steamboats in 1788, and it seems probable that Fulton was aware of these developments."]}, {"page": "1800s (decade)", "response": ["Steam transportation started to become viable during this decade. In 1803, William Symington's Charlotte Dundas, generally considered to be the world's first practical steamboat, made her first voyage. Later, in 1807, Robert Fulton's North River Steamboat, the world's first commercially successful steamboat, made her maiden voyage."]}, {"page": "1803", "response": ["* January 5 – William Symington demonstrates his Charlotte Dundas, the \"first practical steamboat\", in Scotland."]}, {"page": "Timeline of transportation technology", "response": ["*1803 – William Symington's Charlotte Dundas, generally considered to be the world's first practical steamboat, makes her first voyage."]}, {"page": "Scottish Enlightenment", "response": ["* William Symington (1764–1831) engineer, inventor, builder of the first practical steamboat"]}, {"page": "Dumfries", "response": ["After working with Patrick Miller of Dalswinton, inventor William Symington intended to carry out a trial in order to show than an engine would work on a boat without the boat catching fire. The trial finally took place on Dalswinton Loch near Dumfries on 14 October 1788. The experiment demonstrated that a steam engine would work on a boat. Symington went on to become the builder of the first practical steamboat."]}, {"page": "Forth and Clyde Canal", "response": ["Between 1789 and 1803 the canal was used for trials of William Symington's steamboats, culminating in the Charlotte Dundas, the \"first practical steamboat\" built at the shipyard in Grangemouth by Alexander Hart."]}, {"page": "Steamboat", "response": ["Similar boats were made in 1785 by John Fitch in Philadelphia and William Symington in Dumfries, Scotland. Fitch successfully trialled his boat in 1787, and in 1788, he began operating a regular commercial service along the Delaware River between Philadelphia and Burlington, New Jersey, carrying as many as 30 passengers. This boat could typically make  and travelled more than  during its short length of service. The Fitch steamboat was not a commercial success, as this travel route was adequately covered by relatively good wagon roads. The following year, a second boat made  excursions, and in 1790, a third boat ran a series of trials on the Delaware River before patent disputes dissuaded Fitch from continuing.", "Meanwhile, Patrick Miller of Dalswinton, near Dumfries, Scotland, had developed double-hulled boats propelled by manually cranked paddle wheels placed between the hulls, even attempting to interest various European governments in a giant warship version,  long. Miller sent King Gustav III of Sweden an actual small-scale version,  long, called Experiment. Miller then engaged engineer William Symington to build his patent steam engine that drove a stern-mounted paddle wheel in a boat in 1785. The boat was successfully tried out on Dalswinton Loch in 1788 and was followed by a larger steamboat the next year. Miller then abandoned the project."]}, {"page": "Alexander Nasmyth", "response": ["Nasmyth had a great interest in engineering, and proposed several ideas that were later widely used, although he never patented any of them. In October 1788, when Patrick Miller sailed the world's first successful steamship, designed by William Symington, on Dalswinton Loch, Nasmyth was one of the crew."]}, {"page": "Paddle steamer", "response": ["The next successful attempt at a paddle-driven steam ship was by Scottish engineer William Symington, who suggested steam power to Patrick Miller of Dalswinton. Experimental boats built in 1788 and 1789 worked successfully on Lochmaben Loch. In 1802, Symington built a barge-hauler, , for the Forth and Clyde Canal Company. It successfully hauled two 70-ton barges almost  in 6 hours against a strong headwind on test in 1802. Enthusiasm was high, but some directors of the company were concerned about the banks of the canal being damaged by the wash from a powered vessel, and no more were ordered."]}, {"page": "Thomas Dundas, 1st Baron Dundas", "response": ["Dundas followed his father in having an interest in Grangemouth and in the Forth and Clyde Canal, under construction from 1768 to 1790, and he would have been aware of the 1789 trials on the canal of Patrick Miller of Dalswinton's double-hulled paddle boat powered with a steam engine fitted by William Symington. In 1800 Dundas, as Governor of the Forth and Clyde Canal Company, engaged Symington to design a steam tug on the lines of a failed attempt by Captain John Schank for the Bridgewater Canal. At a meeting of the canal company's directors on 5 June 1800 Dundas \"produced a model of a boat by Captain Schank to be worked by a steam engine by Mr Symington\", and it was agreed this should be immediately put in hand.", "*William Symington", "*William Symington, inventor of steam navigation"]}, {"page": "1787 in science", "response": ["* June – William Symington patents improvements to the Watt steam engine."]}, {"page": "1803 in science", "response": ["* January 4 – William Symington demonstrates his Charlotte Dundas, the \"first practical steamboat\", in Scotland."]}, {"page": "1788 in science", "response": ["* October 14 – William Symington demonstrates a paddle steamer on Dalswinton Loch in Scotland."]}, {"page": "1764 in science", "response": ["* October – William Symington, Scottish mechanical engineer and steamboat pioneer (died 1831)"]}, {"page": "Charlotte Dundas", "response": ["Development of experimental steam engined paddle boats by William Symington had halted when the sponsor, Patrick Miller of Dalswinton, abandoned the project. Symington had continued building steam pumping engines and mill engines. In 1793 he had developed a drive using a pivoted crosshead beam above the vertical cylinder to transmit power to a crank. ", "*William Symington", "*William Symington, inventor of steam navigation"]}, {"page": "Patrick Miller of Dalswinton", "response": ["Miller was particularly interested in multiple-hulled pleasure boats propelled by cranked paddle wheels placed between the hulls. On seeing a steam-carriage model made by the engineer William Symington (or on the suggestion of Symington's friend James Taylor), he got Symington to build his patented steam engine with its drive into a twin-hulled pleasure boat. This was successfully tried out on Dalswinton Loch near Miller's house on 14 October 1788. The next year a larger engine was fitted to a  long twin-hull paddle boat and tried on the Forth and Clyde Canal. After initial problems of paddle wheels breaking up on 2 December, the vessel travelled some distance along the canal on 26 December and 27 December 1789. Miller abandoned the project due to the rising expenses of the venture."]}, {"page": "Steam car", "response": ["The first steam-powered vehicle was supposedly built in 1679 by Ferdinand Verbiest, a Flemish Jesuit in China. The vehicle was a toy for the Chinese Emperor. While not intended to carry passengers and therefore not exactly a car but a carriage, Verbiest's device is likely to be the first ever engine powered vehicle. Also it seems that the Belgian vehicle served as an inspiration for the Italian Grimaldi (early 1700) and the French Nolet (1748) steam carriage successor. A French inventor, Nicolas-Joseph Cugnot, built the first working self-propelled land based mechanical vehicle in two versions, one in 1769 and one in 1771 for use by the French Army. William Murdoch built and operated a steam carriage in model form in 1784. In 1791 he built a larger steam carriage which he had to abandon to do other work. Also William Symington built a steam carriage in 1786. There is an unsubstantiated story that a pair of Yorkshiremen, engineer Robert Fourness and his cousin, physician James Ashworth had a steam car running in 1788, after being granted a British patent No.1674 of December 1788. An illustration of it even appeared in Hergé's book Tintin raconte l'histoire de l'automobile (Casterman, 1953). The London Steam Carriage was built by Richard Trevithick in 1803 and ran successfully in London, but the venture failed to attract interest and soon folded up. An amphibious steam car was built by Oliver Evans in 1805. The first substantiated steam car for personal use was that of Josef Božek in 1815. He was followed by Julius Griffith in 1821, Timothy Burstall and John Hill in 1824 and Thomas Blanchard in 1825.Chronology www.forgeofinnovation.org Over thirty years passed before there was a flurry of steam cars from 1850s onwards with Dudgeon, Roper and Spencer from the United States, LeonardCanada directory for 1857-1858: Containing names of professional and business men, and of the principal inhabitants, p. 284. John Lovell and Taylor from Canada, Rickett, Austin, Catley and Ayres from England, Bordino and Manzetti from Italy, others followed with Bollée and Lejeune from France, Thury from Switzerland and Kemna from Germany."]}, {"page": "Leadhills", "response": ["The Leadhills Miners' Library (also known as the Allan Ramsay Library or the Leadhills Reading Society), founded in 1741 by 21 miners, the local schoolteacher and the local minister, specifically to purchase a collection of books for its members’ mutual improvementOn his 1841 visit to Leadhills, the statistician and school inspector Joseph Fletcher was so impressed with the Leadhills’ Reading Society that he included its \"Articles and Laws\" in his report to the Children's Employment Commission (they appear at Fletcher, 1842, pp. 874-878).\"The inhabitants [of Leadhills], though chiefly employed in the severe labour of mining, are an enlightened set of people, having a pretty extensive subscription library, and exhibiting a zeal in the acquisition of useful knowledge perfectly astonishing\" (Chambers & Chambers (1844), p.701. — its membership was not restricted to the miners; several non-miners, such as William Symington, John Brown (author of Rab and his Friends) and James Braid, were also full members — houses an extensive antiquarian book collection, local relics, mining records and minerals. The library is the oldest subscription library in the British Isles;Foster & Sheppard (1995), p.41. and is of significant historical and geological importance.", "Allan Ramsay, the poet, and William Symington (1763–1831), one of the earliest adaptors of the steam engine to the purposes of navigation, were born at Leadhills."]}, {"page": "Bacchus Marsh", "response": ["* William Symington C.E. (ca.1802 – 17 March 1867) inventor and son of steamboat pioneer William Symington."]}, {"page": "Wanlockhead", "response": ["thumb|upright|William Symington, Engineer.", "William Symington was from Leadhills, but lived and worked in Wanlockhead. His fame lies in the fact that he designed the engine used to power the world's first steamboat. This boat was successfully tested on Dalswinton Loch near Ellisland on 14 October 1788. Dalswinton was the home of Robert Burns's landlord, Patrick Miller."]}, {"page": "Carron Company", "response": ["By 1814, the Carron Company was the largest iron works in Europe, employing over 2,000 workers, and it attracted many innovators.  William Symington"]}, {"page": "1803 in the United Kingdom", "response": ["* 4 January – William Symington demonstrates his Charlotte Dundas, the \"first practical steamboat\"."]}, {"page": "1764 in Great Britain", "response": ["* October – William Symington, Scottish mechanical engineer and steamboat pioneer (died 1831)"]}, {"page": "1788 in Great Britain", "response": ["* 14 October – William Symington demonstrates a paddle steamer on Dalswinton Loch near Dumfries."]}, {"page": "History of steam road vehicles", "response": ["In 1786 William Symington built a steam carriage."]}, {"page": "History of the steam engine", "response": ["This did not apply in the US, and in 1788 a steamboat built by John Fitch operated in regular commercial service along the Delaware River between Philadelphia, Pennsylvania, and Burlington, New Jersey, carrying as many as 30 passengers. This boat could typically make 7 to 8 miles per hour, and traveled more than  during its short length of service. The Fitch steamboat was not a commercial success, as this route was adequately covered by relatively good wagon roads. In 1802 William Symington built a practical steamboat, and in 1807 Robert Fulton used a Watt steam engine to power the first commercially successful steamboat."]}, {"page": "William Symmington", "response": ["#REDIRECT William Symington"]}, {"page": "Marine steam engine", "response": ["The first commercially successful steam engine was developed by Thomas Newcomen in 1712. The steam engine improvements brought forth by James Watt in the later half of the 18th century greatly improved steam engine efficiency and allowed more compact engine arrangements. Successful adaptation of the steam engine to marine applications in England would have to wait until almost a century after Newcomen, when Scottish engineer William Symington built the world's \"first practical steamboat\", the Charlotte Dundas, in 1802.Fry, p. 27. Rivaling inventors James Rumsey and John Fitch were the first to build steamboats in the United States. Rumsey exhibited his steamboat design in 1787 on the Potomac River; however, Fitch won the rivalry in 1790 after his successful test resulted in a passenger service on the Delaware River.Sutcliffe, Andrea. Steam: The Untold Story of America's First Great Invention. New York: Palgrave Macmillan, 2004. In 1807, the American Robert Fulton built the world's first commercially successful steamboat, simply known as the North River Steamboat, and powered by a Watt engine."]}, {"page": "List of steam car makers", "response": ["| Symington || Scotland || 1786 || William Symington built a steam-powered carriage in 1786."]}, {"page": "19th century", "response": ["* 1803: William Symington demonstrates his Charlotte Dundas, the \"first practical steamboat\"."]}, {"page": "Thames steamers", "response": ["The early lead in practical steamboats established by William Symington in 1803 with the Charlotte Dundas in Scotland was not maintained, and the first steamboat passenger service was established in the United States in 1807 by Robert Fulton with his North River Steamboat on the Hudson River, using an engine manufactured in Birmingham. The first service on the Thames that can be established properly is the Margery in 1815, though the Richmond may have started taking passengers in 1813.", " Other pumps soon followed. With the improvements of the steam engine by James Watt by 1776, William Symington's Charlotte Dundas in 1803 and the building of the  PS Comet steamship by Henry Bell in 1812 to service the Clyde, steamships were soon sailing the Thames."]}]}}