{"wiki_id": "http://www.wikidata.org/entity/Q984323", "itemLabel": "Rick Fenn", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rick_Fenn", "wikipedia_page": {"main": "Richard Fenn (born 23 May 1953) is an English rock guitarist. He has been a member of the band 10cc since 1976 and has also collaborated with Mike Oldfield, Rick Wakeman, Hollies singer Peter Howarth and Pink Floyd drummer Nick Mason.", "link_mentions": [{"page": "Rick Wakeman", "response": ["In 1984, Wakeman signed a recording deal with President Records and produced Silent Nights, his first solo album for over two years, in two-and-a-half months at Herne Place Studios in Sunningdale with Fernandez, Cronk, and Rick Fenn on guitar. The album was released in 1985 and its single, \"Glory Boys\", became a minor hit in the UK.Wakeman 1995, p. 158. In March 1985, Wakeman finished work on his part of the soundtrack to the comedy film Playing for Keeps, and returned to England to begin rehearsals for his tour to promote Silent Nights, which visited the UK, North America, and Australia.Wakeman 1995, p. 177. A live album recorded during the tour in London was released as Live at Hammersmith. The tour cost him money, leaving him \"seriously in debt\" and forced to remortgage his Camberley home. In September 1985, during the tour's Australian leg, Wakeman fell ill from his alcoholism and has been teetotal since.Wakeman 1995, p. 178. Also in 1985, President released a single of Wakeman's theme tunes for the television shows Lytton's Diary and Database, and Wakeman returned to work for Bowie, playing the piano on \"Absolute Beginners\"."]}, {"page": "Edward Gorey", "response": ["In 1976, jazz composer Michael Mantler recorded an album called The Hapless Child (Watt/ECM) with Robert Wyatt, Terje Rypdal, Carla Bley, and Jack DeJohnette. It contains musical adaptations of The Sinking Spell, The Object Lesson, The Insect God, The Doubtful Guest, The Remembered Visit, and The Hapless Child. The last three songs also have been published on his 1987 Live album with Jack Bruce, Rick Fenn, and Nick Mason."]}, {"page": "1985 in music", "response": ["| Profiles || Nick Mason and Rick Fenn ||-"]}, {"page": "Harvest Records", "response": ["* Nick Mason and Rick Fenn – Profiles (Europe only)"]}, {"page": "Maggie Reilly", "response": ["She has also worked with many other artists, including Mike Batt (on his Hunting of the Snark album), Jack Bruce, Dave Greenfield & Jean-Jacques Burnel, Nick Mason & Rick Fenn, Michael Cretu, Lesiëm, Ralph McTell, Simon Nicol of Fairport Convention, Stefan Zauner of Münchener Freiheit, Runrig, The Sisters of Mercy, and Smokie. \"Moonlight Shadow 2k14\" (Michael Fall remix) was released on 23 May 2014 on the German label ZYX Music.", "* Nick Mason & Rick Fenn – Profiles (1985)"]}, {"page": "Nick Mason", "response": ["Unlike the other members of Pink Floyd, Mason has rarely played an instrument other than his drum kit or large array of percussion instruments, although he has utilised tapes and contributed sound effects to many Pink Floyd albums. He has only played non-percussive instruments on \"The Grand Vizier's Garden Party\", his personal composition from Ummagumma, where he used a mellotron to play brief melodies and create ambient noises, on \"Jugband Blues\", where he played kazoo, and on live versions of \"Outside the Wall\", where he played acoustic guitar along with the rest of the band. However, on the Profiles album Mason released with Rick Fenn (from 10cc) in 1985, he is also credited with keyboards. He can be seen playing a vibraphone in the promo video for \"Lie for a Lie\", but it is unknown if he actually played on the recording. Mason has also said that he took some failed piano and violin lessons as a child before taking up drums.", "===With Rick Fenn==="]}, {"page": "10cc", "response": ["In 1977, 10cc embarked on an international tour with guitarist Rick Fenn, keyboardist Tony O'Malley (Kokomo) and an additional drummer Stuart Tosh (ex-Pilot) and recorded a live album, \"Live and Let Live\" (1977), which mixed the hits with material by Stewart and Gouldman from 10cc's career (alongside two songs written with Godley and Creme).", "While Stewart recovered, Gouldman recorded the title track to the film Sunburn with the help of some of the 10cc band members, which became a minor UK hit in 1979. Gouldman also recorded the soundtrack to the animated film Animalympics, which was originally intended as 10cc project. Rick Fenn went onto large success touring with Mike Oldfield and recording with Nick Mason after being introduced by Eric Stewart while Duncan Mackay took part in recording of Kate Bush album Never for Ever.", "The album was followed by a tour in 1993, with former members Rick Fenn and Stuart Tosh returning alongside new players Steve Piggot (keyboards, synthesisers) and Gary Wallis (drum, percussion). This tour was captured on the live album and DVD Alive.", "* Rick Fenn – lead and rhythm guitar, backing and lead vocals, bass, keys (1977–1983, 1993–1995, 1999–present)"]}, {"page": "Crises (Mike Oldfield album)", "response": ["* Rick Fenn – guitar on \"Crises\""]}, {"page": "Sniff 'n' the Tears", "response": ["*Rick Fenn (guitars) 1980-81", "  bar:Rick       text:Rick Fenn"]}, {"page": "Magdalen College School, Oxford", "response": ["*Rick Fenn – rock guitarist, member of 10cc"]}, {"page": "Five Miles Out", "response": ["Five Miles Out is the seventh studio album by English recording artist Mike Oldfield, released in March 1982 on Virgin Records. After touring in support of his previous album, QE2 (1980), ended in mid-1981, Oldfield started on a follow-up with members of his touring band performing the music. The album features the 24-minute track \"Taurus II\" on side one and four shorter songs on side two. The songs \"Family Man\" and \"Orabidoo\" are credited to Oldfield and members of his touring band which included vocalist Maggie Reilly, drummer Morris Pert, and guitarist Rick Fenn.", "In August 1981, Oldfield completed his European Adventure Tour 1981 which was staged in support of his previous studio album, QE2 (1980). The tour saw Oldfield perform with a group consisting of drummers/percussionists Mike Frye and Morris Pert, guitarist/bassist Rick Fenn, keyboardist Tim Cross, and vocalist Maggie Reilly. In the month following the tour, Oldfield started work on a follow-up at Tilehouse Studios, his home recording studio in Denham, Buckinghamshire. Recording took place between September 1981 and January 1982 with an Ampex ATR-124 24-track machine. The music was performed by Oldfield and his six-piece band with Graham Broad on additional drums.", "# \"Family Man\" (Oldfield, Tim Cross, Rick Fenn, Mike Frye, Maggie Reilly, Morris Pert) – 3:45", "* Rick Fenn – guitar"]}, {"page": "Animalympics", "response": ["* Rick Fenn – electric guitar, backing vocals"]}, {"page": "Islands (Mike Oldfield album)", "response": ["* Rick Fenn - acoustic and electric guitars"]}, {"page": "Elements – The Best of Mike Oldfield", "response": ["# \"Family Man\" (feat. Maggie Reilly) (Tim Cross, Rick Fenn, Mike Frye, Mike Oldfield, Morris Pert, Maggie Reilly) – 3:45"]}, {"page": "Eyes of a Woman", "response": ["The album was recorded in the Polar Music Studios in Stockholm. Sessions began in early October 1984 and lasted until the end of November. The album was produced by Eric Stewart of 10cc and features former 10cc members Rick Fenn and Vic Emerson as session musicians, as well as Stewart's longtime friend Justin Hayward of The Moody Blues.", "*Rick Fenn - guitars"]}, {"page": "Graham Gouldman", "response": ["When Kevin Godley and Lol Creme departed in 1976 to explore new musical territories, Gouldman remained with Stewart, continuing the band essentially as a two-piece, although with regular collaborators including Rick Fenn, Paul Burgess and Stuart Tosh. 1980's Look Hear? album marked the end of the band's run of chart success, and 1983's Windows in the Jungle became the last 10cc album for almost a decade.", "Gouldman began touring as \"10cc featuring Graham Gouldman and Friends\", with his band comprising Rick Fenn, Paul Burgess, Mike Stevens and Mick Wilson. They first performed in 1999, at Ronnie Scott's Jazz Club in Birmingham. After the release of his solo album, he got the lads back together to celebrate 30 years of 10cc in 2002, billed as \"Graham Gouldman celebrates 30 years of 10cc\"."]}, {"page": "Stars (British band)", "response": ["All 'Stars' performances contained Barrett-era Pink Floyd songs and tracks from Barrett's 1970 solo albums The Madcap Laughs and Barrett. The posters for the MC5 / Skin Alley gig also billed an appearance from a new line-up of the Last Minute Put Together Boogie Band - Bruce Paine, Rick Fenn, Bill Gray & Gary Luvaglia. Paine went on to join Steamhammer for a tour of Europe in late 1972 before returning to the United States."]}, {"page": "Gary Wallis", "response": ["After disbanding in the eighties, the original four members of the British rock group 10cc re-formed in 1992 to record new and previously recorded tracks.  They subsequently undertook a tour of Japan in 1993, with Gary Wallis as their drummer. Their tour recording Alive in Japan featured Eric Stewart (vocals, guitar, keyboard), Graham Gouldman (vocals, bass, guitar), Rick Fenn (vocals, guitar, bass), Stuart Tosh (vocals, percussion), Stephen Piggott (keyboards) and Gary Wallis (drums). In 1995, 10cc released their album Mirror Mirror with Gary Wallis playing drums and percussion."]}, {"page": "Profiles (Nick Mason and Rick Fenn album)", "response": ["Profiles is Pink Floyd drummer Nick Mason's second studio album and 10cc guitarist Rick Fenn's debut studio album. It was released in 1985. The album (along with Nick Mason's Fictitious Sports and the soundtrack to the film White of the Eye) was remastered and reissued on August 31st, 2018 as part of the box set Unattended Luggage. ", "All tracks written by Rick Fenn and Nick Mason, except as noted.", "*Rick Fenn — guitars, keyboards, composing"]}, {"page": "Fenn", "response": ["*Rick Fenn (born 1953), English rock guitarist"]}, {"page": "Mont Campbell", "response": ["*Textures/Landscapes/Travel (library music, Carlin Production Music 206, 1995 with Rick Fenn)", "*National Flavours 5: Balkan/Gaelic/Middle East/Africa (library music, Carlin Production Music 220, 1995 with Rick Fenn)"]}, {"page": "Bloody Tourists", "response": ["*Rick Fenn – backing vocals, electric guitar, lead guitar, acoustic guitar, fretless bass, saxophone, synthesizer, organ, percussion"]}, {"page": "Look Hear?", "response": ["* Rick Fenn – vocals, guitars, lead vocals (4), co-lead vocals (3)"]}, {"page": "Ten Out of 10", "response": ["After two albums of 10cc as a sixpiece lineup Ten Out of 10 was a return to the core duo of Graham Gouldman and Eric Stewart with all other contributors taking a role of session musicians, despite the fact that the album featured two of the musicians used on the band's previous album, 1980s Look Hear?: drummer Paul Burgess on all but three tracks and guitarist and singer Rick Fenn credited on two tracks but played on all other tracks uncredited. Other session musicians included pianist Vic Emerson of Sad Café, who also joined 10cc on tour. The album credits resulted in identification of Gouldman and Stewart only as \"Graham\" and \"Eric\" like on previous albums with other musicians credited by full name after the contributions of the former. The only band member photos on the album were those of Gouldman and Stewart.", "* Rick Fenn – guitars, fretless bass, backing vocals (\"Don't Ask\" and \"Action Man in Motown Suit\" only), backing vocals on all other tracks-uncredited, guitars on various tracks uncredited"]}, {"page": "Windows in the Jungle", "response": ["The album also continued the formula established by the previous 10cc album Ten Out of 10 for which the band consisted of Eric Stewart and Graham Gouldman with other musicians taking part as session players, however again featuring long-time 10cc collaborators Rick Fenn and Stuart Tosh along with recent addition of Vic Emerson to the live lineup. However, the album marked the absence of Paul Burges for the first time since 1977 Deceptive Bends.", "The album turned out to be the last for 10cc for nine years, as well as their final album for Mercury Records and final to be recorded in their own Strawberry Studios. It was also the final studio album to feature musicians from the lineup formed during the making of Bloody Tourists (1978) (except for the brief appearance of Rick Fenn on Mirror Mirror).", "* Rick Fenn – vocals, lead guitar, acoustic guitar"]}, {"page": "Mirror Mirror (10cc album)", "response": ["Mirror Mirror included appearances by 10cc's longtime collaborators Rick Fenn on one track and Andrew Gold on two tracks, touring members Steve Pigott and Gary Wallis on one track, and notable guest performances by Paul McCartney on two tracks: \"Yvonne's the One\" co-written by McCartney and Stewart in February 1985 during the sessions for Paul's Press to Play album, but remade and completed on this album, and \"Code of Silence\" which also started as a collaboration between McCartney and Stewart. The album also included the new reworked mix of the original recording of \"I'm Not in Love\" from 1975.", "* Rick Fenn — lead guitar on \"Peace in Our Time\""]}]}}