{"wiki_id": "http://www.wikidata.org/entity/Q984365", "itemLabel": "Nathan Walker", "itemDescription": "Australian ice hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Walker", "wikipedia_page": {"main": "Nathan Walker (born 7 February 1994) is a Welsh-born Australian professional ice hockey forward who is currently playing for the  St. Louis Blues of the National Hockey League (NHL). Walker, who was born in Wales, grew up in Australia and first played ice hockey there. He moved to the Czech Republic in 2007 in order to further his career, and joined the junior program of HC Vítkovice, a member of the Czech Extraliga. He first played for the senior team in 2011, becoming the first Australian ice hockey player to play for a professional senior team in Europe. Along with HC Vítkovice, Walker was loaned to several lower-level Czech teams.\nIn 2013 Walker signed with the Youngstown Phantoms of the junior United States Hockey League, moving to North America for the first time. He attended the training camp of the Washington Capitals in 2013 and signed with their AHL affiliate Hershey. Walker represents Australia internationally, and first played for them at the 2011 IIHF World Championship Division II tournament, where he helped his team win their group and earn a promotion to Division I for the following year. Passed over in the previous two NHL Entry Drafts, Walker was selected by the Washington Capitals in the third round of the 2014 NHL Entry Draft, the first Australian selected in an NHL draft. After a few years in the AHL, Walker joined the Capitals in 2017, the first Australian to play in the NHL. He was placed on waivers and claimed by the Edmonton Oilers in the same season, but was re-acquired by the Capitals after only two games with the Oilers, and won the Stanley Cup with the Capitals in 2018.", "link_mentions": [{"page": "Culture of Australia", "response": ["Increased interest and participation in American sports has led to opportunities for Australians to play at the top level in sports such as baseball, ice hockey and American football. Grant Balfour is a relief pitcher for the Tampa Bay Rays, and played in the 2008 World Series. Australian basketballers have done well at the Olympics, coming fourth four times. The skill set of Australian rules footballers fits the mould of US National Football League (NFL) punters, and they stand out from their American peers with their ability to tackle returners. Two former AFL footballers competed in the 2009 NFC Championship game as punters, Saverio Rocca for the Philadelphia Eagles and Ben Graham for the Arizona Cardinals. Graham's appearance in Super Bowl XLIII made him the first Australian to play in the NFL's championship game. The first College Bowl game to feature two Australians was the 2012 BCS National Championship Game with punter Brad Wing from LSU and defensive end Jesse Williams for Alabama. In 2018, Nathan Walker, the first Australian drafted by an NHL team, also became the first to play on a Stanley Cup winning team, the 2018 Washington Capitals."]}, {"page": "Walker (surname)", "response": ["*Nathan Walker (born 1994), Australian ice hockey player"]}, {"page": "List of Star Wars comic books", "response": ["* First Impressions by Nathan Walker (published in Tales#15)", "* Nathan Walker"]}, {"page": "South Carolina Stingrays", "response": ["*Nathan Walker (2014–15), Washington Capitals"]}, {"page": "1994 in Wales", "response": ["*7 February – Nathan Walker, Welsh-Australian ice hockey player"]}, {"page": "List of NHL players (W)", "response": ["* Nathan Walker"]}, {"page": "Sydney Ice Dogs", "response": ["In 2010, Australia's first ever National Hockey League player, Nathan Walker, made his debut for the Sydney Ice Dogs. Walker's debut came in a 6–2 loss at Liverpool Catholic Club Ice Rink against Ice Dog's rivals Newcastle North Stars. Walker got an assist in the match for a total of one point. Nathan Walker played a total of seven matches for the Ice Dogs during the 2010 and 2011 seasons. He broke up his calendar year between playing U18 hockey in the Czech Republic and senior hockey for the Ice Dogs in the AIHL. His time with the Ice Dogs culminated with his selection for the Australian national team (the Mightyroos) for the World Championships Division 2 in 2011, which was hosted in Melbourne at the Icehouse. The Mightyroos, along with Walker, went on to top their group and win gold and promotion to Division 1 for the following year. Walker was selected by Australia's head coach, former Ice Dog Vlad Rubes, as the team's MVP for the tournament."]}, {"page": "List of people from Sydney", "response": ["|scope=\"row\"  | Nathan Walker"]}, {"page": "Youngstown Phantoms", "response": ["Seventeen players with Youngstown Phantoms ties have been drafted into the NHL. Defenseman Scott Mayfield (2009–11) was drafted in the 2nd round, 34th overall pick, by the New York Islanders in the 2011 NHL Entry Draft. Goalie Matthew Mahalak (2009–10) was drafted in the 6th round, 163rd overall pick, by the Carolina Hurricanes also in the 2011 NHL Entry Draft. Forward Nathan Walker (2012–13) was drafted in the 3rd round, 89th overall pick, by the Washington Capitals in the 2014 NHL Entry Draft. Forward Maxim Letunov (2013–15) was drafted in the 2nd round, 52nd overall pick, by the St. Louis Blues also in the 2014 NHL Entry Draft. Also, a total of seven alumni have signed NHL contracts, including Nathan Walker, Scott Mayfield, Brandon Saad, Jiri Sekac, Andrej Sustr, and Lucas Craggs. In addition, Mayfield, Saad, Sustr and Sekac have seen action with their respective NHL clubs, and Saad won the Stanley Cup with the Chicago Blackhawks in 2013.", "*2014: Nathan Walker – 89th overall by Washington Capitals"]}, {"page": "List of current AHL captains", "response": ["Nathan Walker"]}, {"page": "List of sportspeople with dual nationality", "response": ["|Nathan Walker"]}, {"page": "Ice Hockey Australia", "response": ["=== Nathan Walker Trophy ===", "Formerly referred to as The AJIHL Champions Trophy due to not having a name, the award was renamed the Nathan Walker Trophy for the 2018-19 Australian Junior Ice Hockey League season, in honor of Australia's first player to make it to the National Hockey League - Nathan Walker. The Nathan Walker Trophy is awarded to the winners of the playoffs for the national junior men's ice hockey competition, the Australian Junior Ice Hockey League. The cup was donated by the Old-timers Ice Hockey Australia Network in 2012 for the inaugural season for the AJIHL."]}, {"page": "2011 IIHF World Championship Division II", "response": ["|style=\"text-align:left;\"|  Nathan Walker || 4 || 4 || 2 || 6 || +7 || 4"]}, {"page": "2014 NHL Entry Draft", "response": ["The 2014 NHL Entry Draft was the 52nd NHL Entry Draft. The draft was held on June 27–28, 2014 at the Wells Fargo Center in Philadelphia, Pennsylvania. The top three selections were Aaron Ekblad, Sam Reinhart and Leon Draisaitl, going to the Florida Panthers, Buffalo Sabres and Edmonton Oilers, respectively. This draft featured the first selection of a player from Oceania with Australian Nathan Walker, being selected by the Washington Capitals in the third-round.", "| Nathan Walker (LW)", "| || style=\"text-align:left;\" |  || 1 || 0.5% || Nathan Walker, 89th"]}, {"page": "List of countries with their first National Hockey League player", "response": ["The globalization of the National Hockey League has been occurring since its inception.  The early years saw a largely Canadian league, with some Americans playing. As the league progressed it experienced an influx of European players, at first from Western European countries such as Sweden. After the fall of Communism, players from Eastern European countries, such as the former Czechoslovakia and Soviet Union, joined the league.  The NHL eventually saw fewer European players, but more players from Canada and the United States.  Today the NHL has players from five continents.  The following is a list of countries and the first person born there that played in the National Hockey League.  These players are not necessarily the first citizen of each respective country to play in the NHL, as nationality is determined under a nation's nationality law and may differ. Additionally, some countries have had citizens play in the NHL, but have never had a native-born player reach the league. One current example of this is Australia; while the country saw its first citizen reach the league in 2017, said player (Nathan Walker) had been born in the United Kingdom.", "|  || Nathan WalkerNHL goes mad for 'Thunder from Down Under' Nathan Walker after Aussie scores first goal for St Louis Blues || 2017-18"]}, {"page": "List of National Hockey League players born in the United Kingdom", "response": ["The National Hockey League (NHL) is a major professional ice hockey league which operates in Canada and the United States. Since its inception in 1917–18, 53 players born within the current borders of the United Kingdom have taken part. None of them, however, were trained within the country. Of these players, 23 are from England, 21 from Scotland, 5 from Northern Ireland and 4 from Wales. Steve Thomas and Owen Nolan played over 1,000 regular season games, while Thomas and Steve Smith are the only ones to have appeared in over 100 playoff games. All three players finished their careers in the 21st century. The only player born in the UK currently playing in the NHL is Nathan Walker of the St. Louis Blues."]}, {"page": "2017–18 NHL season", "response": ["| Nathan Walker|| Washington Capitals || First Australian to play in the NHL"]}, {"page": "Nathan Walker (disambiguation)", "response": ["Nathan Walker is an ice hockey player.", "*Nathan Walker, musician in Elliot (band)", "*Nate Walka, Nathan Walker, American recording artist", "*Nate Walker, Nathan Walker, American businessman and politician", "*Nathan Walker, builder of Toaping Castle"]}, {"page": "Ice hockey by country", "response": ["|||IIHF member. 20 rinks. 4,465 registered players. The Australian Ice Hockey League (AIHL) has been the country's national league since 2000. Prior to that, the Goodall Cup was the national championship from 1909-1999. It is now awarded to the AIHL champion. From 1955-1976, an Australian Club Championship was also held. Australia has men's, women's and junior national teams. Nathan Walker was the first Australian player drafted by the Washington Capitals in the 3rd round (89th overall) in the 2014 NHL Entry Draft."]}, {"page": "2013–14 Hershey Bears season", "response": ["Several players departed from the Hershey roster during the off season. After 365 games with Hershey and playing as captain since 2001, Boyd Kane left to join French with the Medveščak Zagreb. Dane Byers was named the new captain, with Garrett Mitchell and Jeff Taffe as alternate captains. Barry Almeida, Alex Berry, Mike Carman, Jon Kalinski, Jon DiSalvatore, Danick Paquette, Matt Pope, Ryan Potulny, Dany Sabourin and Mattias Sjögren also left the team, as did Patrick McNeill, who was limited to 47 games in the 2012-13 season due to veteran roster limits. Joey Crabb, who had come to Hershey mid-season from the Washington Capitals after clearing waivers, signed with the Florida Panthers. Byers, Joel Rechlicz, Ryan Stoa, T.J. Syner and Patrick Wellar were all re-signed for the 2013–14 season, and Nicolas Deschamps and Peter LeBlanc received qualifying offers from the Washington Capitals. It was announced June 14 that Taffe re-signed with the Bears. The Swedish Hockey League had announced one month earlier that Taffe had signed a contract with them, but Taffe said that announcement had been premature, and he wanted to keep his family in North America. Hershey signed several new players for the 2013–14 season, including defensemen Nate Schmidt, David Kolomatis and Tyson Strachan; goaltender David Leggio; and forwards Josh Brittain, Michal Čajkovský, Dustin Gazley, Tyler Ruegsegger, Brandon Segal, Matt Watkins, Derek Whitmore, and Jamie Johnson, a former linemate of Taffe's with the Rochester Americans. The Bears also signed forward Nathan Walker, making him the first Australian to play for the American Hockey League. Several Hershey players were released the ECHL's Reading Royals after training camp, including Syner, Brandon Anderson, Mike Banwell, Brett Flemming, Dustin Gazley, Riley Gill, Ryan Kavanagh, David Marshall and Domenic Monardo.", "The Bears secured their first win of the season the next day, with Grubauer stopping all 30 shots in a 4–0 shutout. Dmitry Orlov scored a goal and three assists, his first game with more than two points since November 19, 2011. Hershey lost their second straight home game on October 26 with a 4–3 defeat against the Hartford Wolf Pack, surrendering two leads and failing to score on two five-on-three power play goals, including one that lasted 2:56. Hershey recorded their first home victory on the next day with a 4–2 win over Norfolk, with David Leggio making 17 saves in his first victory for the Bears. They outshot the Admirals 38-19, marking the first time Hershey outshot an opponent all season. Nathan Walker scored his first professional goal, making him the first Australian-born player to score in the AHL. The Bears lost their two leading scorers on October 30, as Orlov and Michael Latta were recalled to the Washington Capitals.", "| Nathan Walker || 1st AHL Game || October 5, 2013||", "| Nathan Walker || 1st AHL Goal || October 27, 2013||"]}, {"page": "2014–15 Washington Capitals season", "response": ["| July 25, 2014 || Nathan Walker || 3-year, entry level contract ||", "| Nathan Walker"]}]}}