{"wiki_id": "http://www.wikidata.org/entity/Q984495", "itemLabel": "Martin Compston", "itemDescription": "Scottish actor and football player (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Compston", "wikipedia_page": {"main": "Martin Compston (born 8 May 1984) is a Scottish actor and former professional footballer. He has played Anti-Corruption Unit Detective Inspector Steve Arnott in the BBC drama Line of Duty, Liam in Ken Loach's Sweet Sixteen, Paul Ferris in The Wee Man, Ewan Brodie in Monarch of the Glen and Dan Docherty in The Nest.", "link_mentions": [{"page": "1984", "response": ["* May 8 – Martin Compston, Scottish actor and former professional footballer"]}, {"page": "2002 in film", "response": ["* Sweet Sixteen, directed by Ken Loach, starring Martin Compston – (UK)"]}, {"page": "2003 in film", "response": ["| Sweet Sixteen || Icon Productions || Ken Loach (director); Martin Compston, Annmarie Fulton, William Ruane || Drama || || Live Action"]}, {"page": "Greenock", "response": ["Other Greenockians include the composers Hamish MacCunn and William Wallace, violinist Henri Temianka, musician John McGeoch, mathematician William Spence, poets Denis Devlin, W. S. Graham and Jean Adam, merchant Matthew Algie, actors Richard Wilson, David Ashton, Martin Compston and Stella Gonet, artists William Scott and Alison Watt, playwrights Bill Bryden, Neil Paterson and Peter McDougall, comedian Charles 'Chic' Murray, opera singer Hugh Enes Blackmore, broadcaster Jimmy Mack, American football player Lawrence Tynes, children's theatre performer Ruairidh Forde, PGA Pro golfer Colin Robinson, Antarctic explorer Henry Robertson 'Birdie' Bowers and portrait painter Leonard Boden."]}, {"page": "Greenock Juniors F.C.", "response": ["The actor Martin Compston played briefly for the club following his release from Greenock Morton."]}, {"page": "Monarch of the Glen (TV series)", "response": ["|Martin Compston || Ewan Brodie || Series 6–7 || Series 5  "]}, {"page": "Monarch of the Glen cast", "response": ["The Monarch of the Glen cast is a list of actors who portrayed characters in the BBC Scotland comedy drama, Monarch of the Glen. The show began in 2000 with Alastair Mackenzie as the lead character portraying Archie MacDonald, a young restaurateur who returns to his Highland home of Glenbogle to discover that he is the new Laird. Along with Mackenzie, television veterans, Richard Briers and Susan Hampshire received star billing as Archie's eccentric parents, Hector and Molly. Lorraine Pilkington portrayed Archie's love interest, Katrina, who was the only other actor to receive star billing in season one. In season two, Dawn Steele, Alexander Morton and Hamish Clark were bumped up to star status having been supporting regulars in the first season. Briers and Pilkington left the show in season three, prompting Julian Fellowes to receive star billing having appeared as recurring guest in seasons one to four. In season five, Fellowes and Mackenzie left the show, with Lloyd Owen filling the void as Archie's estranged half-brother, Paul. Season six saw a big change in the cast with Steele and Clark leaving and season five regulars, Rae Hendrie and Martin Compston being promoted to star status. Simone Lahbib and Tom Baker also joined the series six cast as Paul's love interest and Hector's younger brother, respectively. Lahbib left the show the following season due to pregnancy and Kirsty Mitchell was brought in as Paul's new love interest. Kellyanne Farquhar was the final actor to gain star billing, joining the cast as Paul's wayward god-daughter. The show ended in 2005 with special guest appearances by Briers, Clark and Fellowes. Morton was the only cast member to appear in every episode, with Hampshire and Clark the only other two actors to appear in every season.", "| colspan=\"1\" style=\"background:lightgray;\"| Martin Compston (e)", "| colspan=\"2\" | Martin Compston"]}, {"page": "Dalmarnock", "response": ["From 19 May to 2 June 2014, BBC One Scotland aired a documentary entitled \"Commonwealth City\", narrated by actor Martin Compston, which showed how the people and community in Dalmarnock had been affected since the games were announced in November 2007. The documentary featured local resident Margaret Jaconelli (evicted to make way for the Games), David Stewart (youth and community campaigner) Darren Faulds (local entrepreneur) and local councillors George Redmond & Yvonne Kucuk."]}, {"page": "Sweet Sixteen (2002 film)", "response": ["* Martin Compston as Liam", "Screenings in Inverclyde, Martin Compston's birthplace, where the film was shot, were shown under a 15 certificate."]}, {"page": "Peter Manuel", "response": ["* In 2016, the broadcaster ITV commissioned a three-part drama called In Plain Sight based on the case. Manuel was portrayed by Martin Compston. "]}, {"page": "English Schools' Football Association", "response": ["Martin Compston, screen actor; Sweet Sixteen, Monarch of the Glen, "]}, {"page": "Huey Morgan", "response": ["Morgan starred in Clubbing to Death with Craig Charles, Nick Moran, Dave Courtney, and Deepak Verma. He also played record shop proprietor Dee Dee in Soulboy, a dramatisation of the 1970s Northern Soul scene starring Martin Compston, Felicity Jones and Alfie Allen.  He starred in the 2000 film Once in the Life with Laurence Fishburne, playing the character Carlos as well as character called \"The Yank\" in the 2003 film, Headrush."]}, {"page": "London Film Critics Circle Awards 2002", "response": ["Martin Compston - Sweet Sixteen  "]}, {"page": "Wild Country (2005 film)", "response": ["Wild Country is a low budget 2006 British horror film directed by Craig Strachan and starring Martin Compston and Peter Capaldi. It was shot on location in and around Glasgow, Scotland in October–November 2004.", "The cast was made up of mostly unknown actors with the exception of Martin Compston and a cameo appearance by Peter Capaldi. The budget of the film was an estimated £1 million.", "* Martin Compston as Lee"]}, {"page": "Soccer Aid", "response": ["* Martin Compston", "|RB ||14 || Martin Compston || ||  ", "* Martin Compston", "|CM ||67|| Martin Compston || || ", "*  Martin Compston", "|CM ||67|| Martin Compston || || ", "*  Martin Compston", "|RB ||67|| Martin Compston || ||  ", "|align=\"left\"| Martin Compston"]}, {"page": "A Guide to Recognizing Your Saints", "response": ["* Martin Compston as Mike O'Shea"]}, {"page": "List of Still Game characters", "response": ["* Martin Compston appears as an electronics seller in \"Local Hero\" who he sells two pay-as-you-go phones to Jack and Victor. He insults them, asking a colleague for any two phones, as they are \"two daft old bastards\"."]}, {"page": "Gary Lewis (actor)", "response": ["In 2005, Lewis starred in Christian Carion's international production of the film Joyeux Noël. Set in WWI, the film explores the \"Christmas Truce\" of 1914 between the armies of three countries. In a departure from previous films, Lewis was next featured in director Danny Cannon's football film Goal! The Dream Begins, which focuses on a Mexican football player trying out for the Newcastle United Football Club. Clive Gordon's 2006 film Cargo, a psychological thriller, featured Lewis opposite Daniel Bruhl and Peter Mullan. As the skipper of a bankrupt Scottish fishing trawler in True North, Lewis and actor Martin Compston tackle the subject of migrant smuggling and the effects it has on those making the journey. At the end of 2005, Lewis starred as Hrothgar in 20th Century Fox's live action adaptation of Christopher Paolini's hit fantasy trilogy Eragon."]}, {"page": "Red Road (film)", "response": ["Red Road is a 2006 psychological thriller film directed by Andrea Arnold and starring Kate Dickie, Tony Curran, Martin Compston, and Natalie Press. It tells the story of a CCTV security operator who observes through her monitors a man from her past. It is named after, and partly set at, the Red Road Flats in Balornock, Glasgow, Scotland, which were the tallest residential buildings in Europe at the time they were built.Red Road Flats, Glasgow Digital Library It was shot largely in a Dogme 95 style, using handheld cameras and natural light. The Observer polled several filmmakers and film critics who voted it as one of the best British films in the last 25 years.", "* Martin Compston as Stevie"]}, {"page": "List of films at the 2007 Sundance Film Festival", "response": ["|colspan=\"6\"| Starring Katie Dickie, Tony Curran, Martin Compston, Natalie Press"]}, {"page": "Vicky McClure", "response": ["McClure is close friends with Line of Duty stars Martin Compston, Adrian Dunbar, and writer Jed Mercurio. She has also remained close with her This is England co-stars, with many attending Thomas Turgoose's wedding in 2019.  She is also friends with Perry Fitzpatrick, having worked with him on many projects over the last 20 years."]}, {"page": "Paul Ferris (Scottish writer)", "response": ["A film based on his life, The Wee Man, starring Martin Compston as Ferris and John Hannah as Tam McGraw, was released in 2013. Another book, entitled 'Unfinished Business', which was written with Steve Wraith and Stu Wheatman was released in October 2018."]}, {"page": "List of thriller films of the 2000s", "response": ["|Red Road||Andrea Arnold||Kate Dickie, Tony Curran, Martin Compston||DenmarkUnited Kingdom||", "|The Disappearance of Alice Creed||J Blakeson||Gemma Arterton, Martin Compston, Eddie Marsan||United Kingdom||"]}, {"page": "List of Scottish actors", "response": ["*Martin Compston (born 1984)"]}, {"page": "Kimberley Nixon", "response": ["In June 2013, Nixon starred in \"Greenshaw's Folly\" in the sixth series of ITV's Agatha Christie's Marple, with Matt Willis, Fiona Shaw, Julia Sawalha, Vic Reeves and Martin Compston."]}, {"page": "List of British films of 2005", "response": ["|Tickets||Abbas Kiarostami, Ken Loach, Ermanno Olmi ||Martin Compston, Carlo Delle Piane, Aishe Gjuriqi ||Comedy/drama ||Co-production with Iran and Italy"]}, {"page": "List of British films of 2006", "response": ["| Red Road ||Andrea Arnold ||Kate Dickie, Tony Curran, Martin Compston, Natalie Press || Thriller||Won the Jury Prize at the 2006 Cannes Film Festival", "|Wild Country||Craig Strachan ||Martin Compston, Peter Capaldi, Samantha Shields||Horror ||"]}, {"page": "The Damned United", "response": ["*Martin Compston as John O'Hare"]}, {"page": "Martin (name)", "response": ["*Martin Compston (born 1984), Scottish actor and professional footballer"]}, {"page": "British Independent Film Awards 2006", "response": ["* Martin Compston - Red Road"]}, {"page": "Niceland (Population. 1.000.002)", "response": ["* Martin Compston as Jed"]}, {"page": "Soulboy (film)", "response": ["Soulboy (previously given the working title Souled OutBBC story: Soulboy (previously titled 'Souled Out') set in the Northern Soul scene in the seventies.) is a 2010 British film directed by Shimmy Marcus about 17-year-old Joe McCain (Martin Compston) coming of age in 1974 amidst the northern soul scene. The film was shot in Stoke on Trent following initial discussions with former Wigan Casino DJ Kev Roberts.", "*Martin Compston as Joe McCain"]}, {"page": "Menhaj Huda", "response": ["His horror film Comedown which stars Martin Compston, Adam Deacon, Geoff Bell, Red Madrell and Duane Henry, was filmed in 2010 in London. His \"spiritual follow-up\" to Kidulthood, Everywhere and Nowhere, based around the London DJ scene, was released in 2011."]}, {"page": "Sigma Films", "response": ["Meanwhile, Sigma strengthened links with co-producer Zentropa, developing the Advance Party Project created from an idea by Gillian Berrie, Sisse Graum Jorgensen, and Lars von Trier. Advance Party was specifically designed to break feature film debutant directors into the industry and produced Andrea Arnold's Red Road (2006) and Morag MacKinnon's Donkeys (2010). Both films star a mixture of the same characters and cast including Kate Dickie, Martin Compston, Natalie Press, Tony Curran and James Cosmo. Red Road played in the Palme d'Or competition at Cannes Film Festival in 2006, winning the Jury Prize, whilst Donkeys won Best Film at the 2011 BAFTA Scotland Awards.", "|Best Supporting Actor/Actress (Martin Compston)"]}, {"page": "True North (2006 film)", "response": ["True North  is a 2006 British drama film directed by Steve Hudson and starring Martin Compston, Peter Mullan, Gary Lewis and Steven Robertson as sailors aboard a Scottish fishing boat smuggling illegal immigrants from China into the United Kingdom.", "* Martin Compston as Seán"]}, {"page": "Daisy Goodwin", "response": ["Goodwin was born and raised in London. She is the daughter of the film producer Richard B. Goodwin and the interior decorator Jocasta Innes. Her parents separated when she was five and then divorced. She is of Irish and Argentinian ancestry.  Interviewed by Rachel Ward of The Daily Telegraph in 2019, she said: \"I grew up surrounded by creative people\", and she would return home \"to find Lauren Bacall and Ingrid Bergman sat on the sofa having tea\". Her great-great-great-grandfather was Irish clergyman Robert Traill, whose character she included in an episode of the second season of her TV drama Victoria which addressed the Irish famine in the 1840s. Traill was played by Martin Compston."]}, {"page": "Shaun Dillon", "response": ["He is a close friend of actor and former Greenock Juniors player Martin Compston; through their relationship, Compston has donated money to the club and began sponsoring Dillon personally in 2020."]}, {"page": "Freakdog", "response": ["* Martin Compston as Sean"]}, {"page": "2014 Scottish independence referendum", "response": ["The launch of online celebrity videos from both viewpoints was reported by the media in mid-July 2014. The \"Let's Stay Together\" campaign group produced a YouTube video called \"'Scotland, you're my best friend'\", featuring John Barrowman, Ross Kemp and Eddie Izzard. A pro-independence video was produced by Yes Scotland and appeared on the campaign's YouTube channel. Titled \"✘ on September 18th #voteYes\", the video features 32 people, including David Hayman, Martin Compston and Stuart Braithwaite."]}, {"page": "The Disappearance of Alice Creed", "response": ["The Disappearance of Alice Creed  is a 2009 British neo-noir film written and directed by J Blakeson. It is about the kidnapping of a young woman (Gemma Arterton) by two ex-convicts (Martin Compston and Eddie Marsan).The Disappearance of Alice Creed The British Films Catalogue The film was shot on the Isle of Man.", "* Martin Compston as Danny"]}, {"page": "European Film Award for Best Actor", "response": ["| Martin Compston||colspan=\"2\"|Sweet Sixteen || Liam"]}, {"page": "List of American films of 2010", "response": ["| The Disappearance of Alice Creed || Anchor Bay Films || J Blakeson (director); Gemma Arterton, Martin Compston, Eddie Marsan"]}]}}