{"wiki_id": "http://www.wikidata.org/entity/Q984553", "itemLabel": "Alan Wakeman", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Wakeman", "wikipedia_page": {"main": "Alan Wakeman (born 13 October 1947) is an English saxophonist who was a member of Soft Machine during 1976, appearing on the album Softs. He is a cousin of the keyboard player Rick Wakeman.", "link_mentions": [{"page": "Rick Wakeman", "response": ["Wakeman described himself at school as \"a horror ... I worked hard in the first year, then eased up\". In 1961, during his time at Drayton Manor school, Wakeman played in his first band, the trad jazz outfit Brother Wakeman and the Clergymen, with a uniform of the school shirt put on the wrong way round. In 1963, at fourteen, Wakeman joined the Atlantic Blues, a local blues group that secured a year's residency at a mental health rehabilitation club in Neasden.Wooding 1979, p. 27. Two years later, Wakeman passed his O Levels in English, maths, art and music, and went on to study music, art, and British constitution at A-level. In 1966, he joined the Concordes, later known as the Concorde Quartet, playing dance and pop songs at local events with his cousin Alan Wakeman on saxophone and clarinet.Wooding 1979, p. 28. Wakeman used the money earned from their gigs to buy a Pianet, his first electronic instrument."]}, {"page": "The Little Prince", "response": ["* Alan Wakeman, (, 1st ed. 1995)"]}, {"page": "Soft Machine", "response": ["After the release of Six in 1973, Hopper left in 1974. He was replaced by Roy Babbington, another former Nucleus member, who had already contributed double bass on Fourth (1971) and Fifth (1972) and took up (6-string) bass guitar successfully, while Karl Jenkins took over as bandleader and composer. After they released Seven (1973) without additional musicians, the band switched record labels from Columbia to Harvest. On their 1975 album, Bundles, a significant musical change occurred with Allan Holdsworth adding guitar as a prominent melody instrument to the band's sound, sometimes reminiscent of John McLaughlin's Mahavishnu Orchestra, setting the album apart from previous Soft Machine albums which had rarely featured guitars. Holdsworth was replaced by John Etheridge for the next album Softs (1976). Ratledge, the last remaining original member of the band, had left during the early stages of recording. Other musicians in the band during the later period were bassists Percy Jones (of Brand X) and Steve Cook, saxophonists Alan Wakeman and Ray Warleigh, and violinist Ric Sanders. Their 1977 performances and record (titled Alive and Well, ironically) were among the last for Soft Machine as a working band, their last performance (until the 1984 reformation) being the only Soft Machine concert of 1978."]}, {"page": "Karl Jenkins", "response": ["* Deep Dark Blue Centre / Portraits / The Alternate Mosaics (2008) 2 CD - With Alan Wakeman, John Marshall, Harold Beckett, Kenny Wheeler. ", "* Relook : Graham Collier 1937-2011: A Memorial 75th Birthday Celebration (2012) With John Marshall, Nick Evans, Gary Burton, Frank Ricotti, Roy Babbington, Kenny Wheeler, Alan Wakeman etc. ", "* Ode (1972) - Karl Oboe and soprano and baritone sax Marc Charig on bugle, Alan Wakeman on tenor and soprano saxes, future Soft Machine and cousin of Rick Wakeman.", "* Softs (1976) - Alan Wakeman on saxes. Karl only plays keyboards."]}, {"page": "Mike Westbrook", "response": ["The Mike Westbrook Big Band, also now known as The Uncommon Orchestra, released an album called A Bigger Show in 2016. Recorded in concert at the Barnfield Theatre (Exeter) by Jon Hiseman and Miles Ashton, it is a reworking of the Waxeywork Show originally performed by The Village Band. The 21-member line-up include long-term Westbrook collaborators such as Dave Holdsworth and Alan Wakeman, as well as younger, rising musicians."]}, {"page": "Paul Rutherford (trombonist)", "response": ["* Alan Wakeman, The Octet Broadcasts 1969 and 1979 (Gearbox, 2020)"]}, {"page": "Gary Husband", "response": ["During his teenage years he played with saxophonist Alan Wakeman, trombonist Malcolm Griffiths and late avant-garde jazz composer Pat Evans."]}, {"page": "Gilgamesh (band)", "response": ["The original basis of Gilgamesh was Gowen and drummer Mike Travis, the two working together on a band project with guitarist Rick Morcombe. The original Gilgamesh line-up consisted of Gowen, Travis, Morcombe, Jeff Clyne and Alan Wakeman on saxophone."]}, {"page": "Softs (album)", "response": ["John Etheridge replaced Allan Holdsworth on guitar shortly after the release of the previous album, Bundles, and Alan Wakeman, cousin of keyboardist Rick Wakeman, took over saxophone duties from Karl Jenkins. Karl would play keyboards exclusively from this point onward. This change was necessitated by the departure of the group's last founding member, Mike Ratledge, who left in March 1976 before the sessions were completed, and can be heard on two tracks, but is not credited as a member of the group. Wakeman and bassist Roy Babbington left the group not long after the album was released, Wakeman having been a member for less than six months.Calyx band profile", "#\"One Over the Eight\" (Karl Jenkins, John Marshall, John Etheridge, Alan Wakeman, Roy Babbington) – 5:26", "*Alan Wakeman – soprano and tenor saxophones"]}, {"page": "Alive & Well: Recorded in Paris", "response": ["#\"Organic Matter (Alan Wakeman, John Etheridge, John Marshall, Karl Jenkins, Roy Babbington) / One Over the Eight\" (Steve Cook) – 5:55"]}, {"page": "1947 in jazz", "response": ["* 13 – Alan Wakeman, English saxophonist, Soft Machine."]}, {"page": "Wakeman (surname)", "response": ["*Alan Wakeman (born 1947), musician", "*Alan Wakeman (author) (1936-2015), British author and gay rights activist"]}, {"page": "List of years in jazz", "response": ["* 1947 in jazz, deaths of Austin Wylie, Fate Marable, Freddie Webster, Jimmie Lunceford, and Sonny Berman; births of Abdul Wadud, Ahmed Abdullah, Alan Broadbent, Alan Wakeman, Anders Bjørnstad, Andy LaVerne, Art Lande, Baikida Carroll, Barry Guy, Bent Persson, Bern Nix, Bill Stevenson, Billy Bang, Bob Magnusson, Brian Abrahams, Bruce Hampton, Buckwheat Zydeco, Butch Morris, Carlo Domeniconi, Carlos Averhoff, Charles \"Bobo\" Shaw, Chris Biscoe, Chris Cutler, Christian Escoudé, Chuck Findley, Darius Brubeck, Dean Parks, Dee Daniels, Derf Reklaw, Egberto Gismonti, Eric Ineke, Eugen Gondi, Fedor Frešo, Fred Hopkins, Frank Mantooth, Frank Tusa, Franz Koglmann, Fred Nøddelund, Gary King, Gary M. Anderson, Gerardo Velez, Glenn Spearman, Glenn Zottola, Greg Abate, Gregg Allman, Greg Lake, Gregory Herbert, Grethe Kausland, Guy Klucevsek, Harold Danko, Harvey Mason, Ian Cruickshank, James \"Plunky\" Branch, Jan Garbarek, Jasper van 't Hof, Jean Carne, Jerry Bergonzi, John Blake Jr., John Horler, John James, Jon Marks, Julie Driscoll, Junko Akimoto, Keith Tippett, Leo Cuypers, Linda Sharrock, Marek Blizinski, Marilyn Crispell, Marty Cook, Melton Mustafa, Miroslav Vitouš, Mwata Bowden, Nick Evans, Norman Connors, Norman Harris, Paco de Lucía, Paul Jackson, Paul Lytton, Paul McCandless, Percy Jones, Radu Goldis, Ray Phiri, Ray Russell, Reggie Houston, Richie Beirach, Ryo Kawasaki, Steve Khan, Stomu Yamashta, Terje Rypdal, Terje Venaas, Tom Malone, Tomasz Szukalski, Uli Beckerhoff, Vladimir Chekasin, and Wesla Whitfield."]}]}}