{"wiki_id": "http://www.wikidata.org/entity/Q994984", "itemLabel": "Bryan Davies, Baron Davies of Oldham", "itemDescription": "British politician (born 1939)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Davies,_Baron_Davies_of_Oldham", "wikipedia_page": {"main": "Bryan Davies, Baron Davies of Oldham, PC (born 9 November 1939) is a Labour member of the House of Lords. He served as Government Deputy Chief Whip in the House of Lords from 2003 to 2010, and as usual for a holder of that position, also held the position of Captain of the Yeomen of the Guard.", "link_mentions": [{"page": "November 9", "response": ["*  1939   – Bryan Davies, Baron Davies of Oldham, English academic and politician"]}, {"page": "List of current members of the British Privy Council", "response": ["| Bryan Davies, Baron Davies of Oldham"]}, {"page": "UCL Institute of Education", "response": ["*Bryan Davies, Baron Davies of Oldham, PC (born 1939), Labour member of the House of Lords"]}, {"page": "Bryan Davies", "response": ["* Bryan Davies, Baron Davies of Oldham (born 1939), Labour member of the House of Lords"]}, {"page": "Lord Davies of Oldham", "response": ["#REDIRECT Bryan Davies, Baron Davies of Oldham"]}, {"page": "Baron Davies of Oldham", "response": ["#REDIRECT Bryan Davies, Baron Davies of Oldham"]}, {"page": "Trinity High School and Sixth Form Centre", "response": ["* Bryan Davies, Baron Davies of Oldham, Labour MP for Enfield North from 1974-9 and Oldham Central and Royton from 1992-97"]}, {"page": "Bryan Davies, Baron Davies", "response": ["#REDIRECT Bryan Davies, Baron Davies of Oldham"]}, {"page": "Lord Davies", "response": ["* Bryan Davies, Baron Davies of Oldham (born 1939), Labour member of the House of Lords"]}, {"page": "Broadcasting and the foundation of the Premier League", "response": ["The deal attracted mass attention from the media. The Independent noted that this was a \"remarkable coup\" for BSkyB, given the company's fluctuating fortunes. The Guardian correspondent David Lacey suggested that fans were the biggest losers: \"A lot of people who want to watch matches regularly in future are going to have to buy a bond or a dish.\" Bryan Davies, Baron Davies of Oldham described the arrangement as \"absolutely appalling\" and Football Supporters' Association chairman Craig Brewin criticised the \"obscene\" amounts of money clubs earned as part of the deal."]}]}}