{"wiki_id": "http://www.wikidata.org/entity/Q995812", "itemLabel": "Chris Davies", "itemDescription": "British Liberal Democrat politician; former Member of Parliament; Member of the European Parliament from 1999 until 2014", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Davies_(Liberal_Democrat_politician)", "wikipedia_page": {"main": "Christopher Graham Davies (born 7 July 1954) is a Liberal Democrat politician in the United Kingdom. He is a former Member of Parliament. He served as a Member of the European Parliament for North West England from 1999 to 2014 and from 2019 to 2020.", "link_mentions": [{"page": "Transnational Radical Party", "response": ["*Chris Davies, former British Member of the European Parliament;"]}, {"page": "Cyril Smith", "response": ["Smith died of cancer in a Rochdale nursing home on 3 September 2010. He had made detailed plans for his own funeral, which was held in the Great Hall of Rochdale Town Hall and included David Alton, the MEP Chris Davies, and former MP Paul Rowen as speakers. Of all the many tributes, the then-current leader of Rochdale Council summed him up: \"He simply was politics for Rochdale.\" The service was led by the minister of his local Unitarian church, of which he had been a lifelong member.Remembrance service for Sir Cyril Manchester Evening News 8 October 2010", "* Tribute in Rochdale Online by Chris Davies MEP"]}, {"page": "List of members of the European Parliament for the United Kingdom (1999–2004)", "response": ["| Chris Davies   "]}, {"page": "Caroline Jackson", "response": ["In the European Parliament, she was a leading member of the Environment Committee and between 1999 and 2004 was Chairman of the Committee on the Environment, Consumer Protection and Public Health. During her chairmanship she tried to focus attention as much on Member States' performance in transposing and applying new EU laws as on the adoption of more such laws. This was during a period of very intense legislation in the area of water and air pollution, waste disposal and controls on chemicals. Jackson controlled the committee firmly but with humour – qualities very necessary when German opponents of new laws on alternative medicines attempted to control proceedings in 1995. It was noted that on 11 September 2001 Jackson's committee was the only one that did not adjourn when the news of the attacks on New York came through: Jackson argued that abrupt abandonment of the Committee's work would have been another small victory for the terrorists. Jackson has been described by Liberal Democrat MEP Chris Davies thus: \"She's been here forever: a bit 'jolly hockey sticks' but firm, fair and funny.\""]}, {"page": "Members of the European Parliament for the United Kingdom 1999–2004 by region", "response": ["# Chris Davies"]}, {"page": "Phil Woolas", "response": ["He first won his seat for Labour in the 1997 general election, having contested the predecessor Littleborough and Saddleworth seat at a by-election in 1995, which was marked by Labour's particularly vicious and personal campaign, attacking the Liberal Democrat candidate, Chris Davies, as \"high on tax and soft on drugs\". Peter Mandelson admitted in his autobiography that they had gone \"on the attack\", writing \"After the campaign was over, not only our opponents but some in Labour would denounce our 'negative' tactics in highlighting Lib Dem front-runner Chris Davies' support for higher taxes and a Royal Commission to liberalise drugs laws. For tactical reasons, I felt we had had little choice\".The Third Man: Life at the Heart of New Labour, Peter Mandelson, HarperPress (15 July 2010)"]}, {"page": "List of members of the European Parliament (1999–2004)", "response": ["*Chris Davies"]}, {"page": "Milnrow", "response": ["Cotton spinning was the principal industry in Milnrow in the 1910s—Newhey alone had ten cotton mills employing over 2,000 people at 1911, while Butterworth Hall Colliery was the largest colliery in the Rochdale region, employing around 300 men in 1912. These workers were able to travel Milnrow's completed tramway from 1912, which passed by Dale Street, Milnrow's central thoroughfare lined with banks, butchers, confectioners, chemists and drapers. Ten years after it was first proposed, in 1913, a new Anglican parish church of St Ann was consecrated at Belfield at its boundary with Firgrove so as to serve the swell in population across the Rochdale-Milnrow boundary and ease pressure at Milnrow's Anglican parish church. An outbreak of smallpox occurred in 1914; an investigation by the Royal Society of Medicine to link the infection with imported cotton bales from Brazil, Mexico, Peru or the United States was inconclusive. The \"most disastrous fire on record\" in the Milnrow area resulted in the \"spectacular\" destruction of Newhey's Ellenroad Mill in 1916, at a cost of £150,000 (£ in ), but with no loss of life. Tank Week, a national touring campaign to help fund the British heavy tanks of World War I, came to Milnrow resulting in a collective donation of £180,578 (£ in ) from the people of the district. Upon conclusion of the war, the National Savings Movement praised the people of Milnrow for their donation, and in May 1919 presented the district with a 23-ton female Mark IV tank for permanent public display in Milnrow. Butterworth Hall Colliery closed in 1928, and poor maintenance forebode the closure of Milnrow's tramway in 1932. In 1934, Milnrow Council agreed that its publicly displayed World War I tank had become \"an eyesore\" and \"a potential source of danger to children\", and consequently sold and removed it for scrap. In the same year, Milnrow Council was gifted land in Firgrove to be used as a public sports pitch. Social housing estates of semi-detached properties with gardens were constructed in both Milnrow and Newhey during the 1930s, while roads in Newhey were laid by German prisoners of war during World War II. Over 500 municipal homes were built between 1930 and 1950, which Chris Davies MP described in Parliament as \"good, solid, middle-of-the-road housing [...] typical examples of some of the best council housing built in Britain\". Cliffe House at Newhey, formerly occupied by the prominent Heap manufacturing family, was demolished and in 1952 its grounds were opened as the recreational and publicly owned Milnrow Memorial Park. Following the Great Depression, the region's textile sector experienced a decline until its eventual demise in the mid-20th century. Milnrow's last standing cotton mill was Butterworth Hall Mill, demolished in the late 1990s. Milnrow experienced population growth and suburbanisation in the second half of the 20th century, spurred by the construction of the M62 motorway through the area, making Greater Manchester and West Yorkshire commutable. The Pennine Drive housing estate was constructed in the mid-1980s. A restoration project to reopen the dilapidated Rochdale Canal resulted in Firgrove Bridge, at Milnrow's boundary with Rochdale, being rebuilt in October 2001; a Bellway-constructed housing estate was built next to the canal between 2005 and 2007. Milnrow tram stop opened as part of Greater Manchester's light-rail Metrolink network on 28 February 2013. Although its route through Milnrow was carefully planned to mitigate against bad weather conditions, the local section of the M62 was made impassable by the \"Beast from the East\" cold weather wave in March 2018. Stranded motorists were invited in to homes and offered food and shelter by \"kindhearted\" volunteers in Milnrow and Newhey while the British Army cleared the motorway."]}, {"page": "List of members of the European Parliament (2004–2009)", "response": ["|Chris Davies||United Kingdom||North West England||Lib Dem||ALDE"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Chris Davies"]}, {"page": "Cheadle Hulme School", "response": ["* Chris Davies (born 1954), former Liberal Democrat Member of the European ParliamentLiberal Democrats: People "]}, {"page": "Oldham East and Saddleworth (UK Parliament constituency)", "response": ["Chris Davies was MP for the former Littleborough and Saddleworth seat since the 1995 by-election."]}, {"page": "North West England (European Parliament constituency)", "response": ["| colspan = 7 | Chris DaviesLiberal Democrat", "|Chris Davies  "]}, {"page": "European Parliament Committee on Fisheries", "response": ["Chris Davies was the chairman (2019 – 2020) - until the United Kingdom left the European Union."]}, {"page": "List of United Kingdom MPs: D", "response": ["*Chris Davies (1995–1997)"]}, {"page": "Cambridge University Liberal Association", "response": ["*Chris Davies, CULC member, MP for Littleborough and Saddleworth 1995–1997, MEP for North West England, 1999-2014 and 2019-; former Leader of the Lib Dem group in the European Parliament"]}, {"page": "2006 Liberal Democrats leadership election", "response": ["Following Kennedy's admission, a letter from twenty-five Liberal Democrat MPs was delivered to him on 6 January. It stated that the signatories would not serve as frontbench speakers under his leadership, and gave a deadline of Monday 9 January for him to make a decision before those on the front bench resigned. Despite a combative interview in The Independent in which Kennedy described a decision to resign as a \"dereliction of duty\", a large number of senior Liberal Democrats stated on 6 January that his position was untenable. Chris Davies, then leader of Liberal Democrat Members of the European Parliament, described him as \"a dead man walking\". A survey for the BBC's Newsnight programme found that more than half of Liberal Democrat MPs thought he should resign or that his position was untenable, and only seventeen out of sixty-two MPs positively wanted him to stay, while eleven spokespersons from his twenty-three-strong frontbench wanted him to leave. Among those who thought he should go were Norman Lamb and Andrew George, who had both served as his Parliamentary Private Secretary, and Matthew Taylor, the chairman of his 1999 leadership campaign.", "*MEPs: Chris Davies, Andrew Duff, Fiona Hall, Sajjad Karim, Baroness Ludford (see above), Baroness Nicholson of Winterbourne (see above), Diana Wallis, Graham Watson"]}, {"page": "Timeline of events in the 2006 Liberal Democrats leadership election", "response": ["*The leader of the British Liberal Democrats in the European Parliament, Chris Davies MEP, said Kennedy was a \"dead man walking\".", "*Sir Menzies Campbell, the interim leader, quickly announced his intention to stand in the upcoming contest and received immediate support from Nick Clegg, Malcolm Bruce and Chris Davies. Matthew Taylor had also said to BBC News 24 he would support Campbell if he stands."]}, {"page": "List of Liberal Democrat MPs", "response": ["* Chris Davies, Littleborough and Saddleworth, 1995–1997"]}, {"page": "1995 Littleborough and Saddleworth by-election", "response": ["The contest was a win for the Liberal Democrat candidate Chris Davies. The result was notable as the defending Conservative Party dropped from first to third place, coming behind both the Labour Party and the Liberal Democrats. Davies' conduct during the by-election was controversial owing to him openly campaigning while the sitting MP Geoffrey Dickens was dying from liver cancer."]}, {"page": "Geoffrey Dickens", "response": ["Dickens married Norma Boothby in 1956 and the couple had two children. He died after a battle with liver cancer in 1995, aged 63. Controversially, his Liberal Democrat successor Chris Davies, openly campaigned for election during Dickens's cancer battle."]}, {"page": "Jewish lobby", "response": ["Chris Davies, MEP for the northwest of England was forced to resign in 2006 as leader of the Liberal Democrats group in the European Parliament after writing to a constituent \"I shall denounce the influence of the Jewish lobby that seems to have far too great a say over the political decision-making process in many countries.\"Hirsh, David. \"Revenge of the Jewish lobby?\", The Guardian, May 5, 2006. In comments to TotallyJewish.Com he \"confessed he didn't know the difference between referring to the 'pro Israel lobby' and the 'Jewish lobby',\" and added \"I'm quite prepared to accept that I don't understand the semantics of some of these things.\"Sholem, Alex. \"MEP Disciplined Over Slur\" , TotallyJewish.Com, May 4, 2006. Commenting on Davies' use of the term, David Hirsh of The Guardian wrote that Davies \"had to resign because his laudable instinct to side with the underdog was not tempered by care, thought or self-education.\"  He compared Davies' rhetoric with the \"care to avoid openly antisemitic rhetoric taken by sophisticates like Mearsheimer and Walt and Robert Fisk.\""]}, {"page": "Christopher Graham Davies", "response": ["#REDIRECT Chris Davies (Liberal Democrat politician) "]}, {"page": "Littleborough and Saddleworth (UK Parliament constituency)", "response": ["This Conservative-Liberal Democrat marginal was held by the Conservative Party at the three general elections of its existence. The victorious MP on each of these occasions was Geoffrey Dickens, who was elected in 1979 for Huddersfield West (which was a predecessor seat to this constituency, however no part of it was added to this seat when it was created in 1983). However, at a by-election called after Dickens' death in 1995, it was won by Chris Davies of the Liberal Democrats.", "|| 1995 by-election || Chris Davies || Liberal Democrat"]}, {"page": "Democratic legitimacy of the European Union", "response": ["In 2003, Liberal Democrat (ALDE) MEP Chris Davies said he had far more influence as a member of the European Parliament than he did as an opposition MP in the House of Commons. \"Here I started to have an impact on day one\", \"And there has not been a month since when words I tabled did not end up in legislation.\""]}, {"page": "List of University of Kent people", "response": ["*Chris Davies - (MA) - former Liberal Democrat Member of the European Parliament for North West England; former leader of the Liberal Democrats in the European Parliament; former Member of Parliament for Littleborough and Saddleworth"]}, {"page": "2007 Liberal Democrats leadership election", "response": ["*MEPs: Chris Davies, Sarah Ludford (see above), Bill Newton Dunn, Emma Nicholson (see above), Diana Wallis, Graham Watson"]}, {"page": "Israel lobby in the United Kingdom", "response": ["In 2006 Chris Davies, a Liberal Democrat Member of the European Parliament for the northwest of England wrote to a pro-Israel constituent that she \"enjoyed wallowing in her own filth\". In a later message to her he complained about Israel's \"racist policies of apartheid\" and stated \"I shall tell them that I intend to speak out against this oppression at every opportunity, and I shall denounce the influence of the Jewish lobby that seems to have far too great a say over the political decision-making process in many countries\". As a consequence of the outcry raised by the attack on the constituent, Davies resigned soon after as leader of the Liberal Democrats group in the European Parliament."]}, {"page": "Christopher Davies", "response": ["Christopher or Chris Davies may refer to:", "* Chris Davies (Liberal Democrat politician) (born 1954), UK politician", "* Chris Davies (Conservative politician) (born 1967), Conservative MP for Brecon and Radnorshire, 2015–19", "* Chris Davies (New Zealand cricketer) (born 1980), New Zealand cricketer", "* Chris Davies (footballer) (born 1985), English football coach", "* Chris Davies (rugby league) (born 1991), Welsh rugby league footballer"]}, {"page": "Liberal Democrats (UK)", "response": ["* Chris Davies, 2004–2006"]}, {"page": "Sexual Freedom Awards", "response": ["*Politician - Chris Davies"]}, {"page": "List of members of the European Parliament (2009–2014)", "response": ["#Chris Davies"]}, {"page": "2014 European Parliament election in the United Kingdom", "response": ["*Chris Davies – North West"]}]}}