{"wiki_id": "http://www.wikidata.org/entity/Q995016", "itemLabel": "Bryan Guinness, 2nd Baron Moyne", "itemDescription": "British writer and lawyer (1905-1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Guinness,_2nd_Baron_Moyne", "wikipedia_page": {"main": "Bryan Walter Guinness, 2nd Baron Moyne,  (27 October 1905 – 6 July 1992) was an heir to part of the Guinness family brewing fortune, and a lawyer, poet and novelist. He was briefly married to Diana Mitford.", "link_mentions": [{"page": "Bryan Walter Guinness", "response": ["#redirect Bryan Guinness, 2nd Baron Moyne"]}, {"page": "List of political families in the United Kingdom", "response": ["*****Jonathan Guinness, 3rd Baron Moyne, grandson of Walter through Bryan Guinness, 2nd Baron Moyne, candidate in the 1973 Lincoln by-election and 1976 Coventry North West by-election", "*****Diarmid Edward Guinness, grandson of Walter through Bryan Guinness, 2nd Baron Moyne, not a politician"]}, {"page": "Harold Acton", "response": ["At Oxford Acton dominated the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Jonathan Guinness, 3rd Baron Moyne", "response": ["Jonathan Bryan Guinness, 3rd Baron Moyne (born 16 March 1930), is a British peer and businessman. A member of the Guinness family, he is the elder of the two sons of Bryan Guinness, 2nd Baron Moyne, and his first wife Diana Mitford (later Lady Mosley), and until his retirement was a merchant banker for Messrs Leopold Joseph."]}, {"page": "List of Old Etonians born in the 20th century", "response": ["*Bryan Guinness, 2nd Baron Moyne (1905–1992), poet and novelist"]}, {"page": "Brian Howard (poet)", "response": ["At Oxford, Howard was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, and John Drury-Lowe."]}, {"page": "Roy Harrod", "response": ["At Oxford Harrod was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "Guinness family", "response": ["*******Bryan Guinness, 2nd Baron Moyne (1905–1992)"]}, {"page": "Desmond Guinness", "response": ["Desmond Walter GuinnessHon. Desmond Walter Guinness (thepeerage.com) (8 September 1931 – 20 August 2020) was an Irish author writing on Georgian art and architecture, a conservationist and the co-founder of the Irish Georgian Society.  He was the second son of the author and brewer Bryan Guinness, 2nd Baron Moyne, and his then wife Diana Mitford (later Lady Mosley)."]}, {"page": "List of chancellors of the University of Dublin", "response": ["* 34: Bryan Guinness, 2nd Baron Moyne (1965–1977)"]}, {"page": "Michael Parsons, 6th Earl of Rosse", "response": ["Lord Rosse was educated at Eton College and Christ Church, Oxford (B.A., 1929; M.A. 1931). At Oxford Parsons was member of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe.  The members of the Railway Club dined in black-tie aboard the Penzance-Aberdeen Express between Oxford and Leicester.\"Then there was the Oxford Railway Club, formed to popularize the pleasures of drinking on trains at night. A party of a dozen young men in full evening dress would board the Penzance-Aberdeen express at Oxford and travel on it as far as Leicester; they would return at once on the Aberdeen-Penzance express. On the outward journey they would dine, and on the way back make speeches.\" Graña, C., & Graña, M. (1990). On Bohemia: The code of the self-exiled. New Brunswick: Transaction Publishers"]}, {"page": "Heatherdown School", "response": ["*Bryan Guinness, 2nd Baron Moyne"]}, {"page": "Pamela Mitford", "response": ["John Betjeman, who for a time was in love with her, referred to her in his unpublished poem, The Mitford Girls, as the \"most rural of them all\" since she preferred to live quietly in the country. They met when she was managing Biddesden, in Hampshire, the house of her brother-in-law, Bryan Guinness, 2nd Baron Moyne."]}, {"page": "Hugh Lygon", "response": ["He was educated at Eton and Pembroke College, Oxford. While at Oxford, Lygon was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}, {"page": "John Sutro", "response": ["At Oxford Sutro conceived the Railway Club, which was dominated by Harold Acton. The other members included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Edward Henry Charles James Fox-Strangways, 7th Earl of Ilchester, Brian Howard, Michael Parsons, 6th Earl of Rosse, Hugh Lygon, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe and Evelyn Waugh."]}, {"page": "Hon.Erskine Guinness", "response": ["#REDIRECT Bryan Guinness, 2nd Baron Moyne"]}, {"page": "Harry Fox-Strangways, 7th Earl of Ilchester", "response": ["He was educated at Eton College and Christ Church, Oxford, where he was part of the Railway Club, which included: Henry Yorke, Roy Harrod, Henry Thynne, 6th Marquess of Bath, David Plunket Greene, Fox-Strangways, Brian Howard, Michael Parsons, 6th Earl of Rosse, John Sutro, Hugh Lygon, Harold Acton, Bryan Guinness, 2nd Baron Moyne, Patrick Balfour, 3rd Baron Kinross, Mark Ogilvie-Grant, John Drury-Lowe."]}]}}