{"wiki_id": "http://www.wikidata.org/entity/Q996967", "itemLabel": "Diane Coyle", "itemDescription": "economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Diane_Coyle", "wikipedia_page": {"main": "Diane Coyle  (born February 1961) is an economist and a former advisor to the UK Treasury. She was vice-chairman of the BBC Trust, the governing body of the British Broadcasting Corporation, and was a member of the UK Competition Commission from 2001 until 2019. Since March 2018, she has been the Bennett Professor of Public Policy at the University of Cambridge, co-directing the Bennett Institute.\n\n", "link_mentions": [{"page": "Gross domestic product", "response": ["Instances of GDP measures have been considered numbers that are artificial constructs. In 2020 scientists, as part of a World Scientists' Warning to Humanity-associated series, warned that worldwide growth in affluence in terms of GDP-metrics has increased resource use and pollutant emissions with affluent citizens of the world – in terms of e.g. resource-intensive consumption – being responsible for most negative environmental impacts and central to a transition to safer, sustainable conditions. They summarised evidence, presented solution approaches and stated that far-reaching lifestyle changes need to complement technological advancements and that existing societies, economies and cultures incite consumption expansion and that the structural imperative for growth in competitive market economies inhibits societal change. 50px  Text and image were copied from this source, which is available under a  Creative Commons Attribution 4.0 International License. Sarah Arnold, Senior Economist at the New Economics Foundation (NEF) stated that \"GDP includes activities that are detrimental to our economy and society in the long term, such as deforestation, strip mining, overfishing and so on\". The number of trees that are net lost annually is estimated to be approximately 10 billion. The global average annual deforested land in the 2015–2020 demi-decade was 10 million hectares and the average annual net forest area loss in the 2000–2010 decade 4.7 million hectares, according to the Global Forest Resources Assessment 2020. According to one study, depending on the level of wealth inequality, higher GDP-growth can be associated with more deforestation. In 2019 \"agriculture and agribusiness\" accounted for 24 % of the GDP of Brazil, where a large share of annual net tropical forest loss occurred and is associated with sizable portions of this economic activity domain. The number of obese adults was approximately 600 million (12%) in 2015. In 2013 scientists reported that large improvements in health only lead to modest long-term increases in GDP per capita. After developing an abstract metric similar to GDP, the Center for Partnership Studies highlighted that GDP \"and other metrics that reflect and perpetuate them\" may not be useful for facilitating the production of products and provision of services that are useful – or comparatively more useful – to society, and instead may \"actually encourage, rather than discourage, destructive activities\". Steve Cohen of the Earth Institute elucidated that while GDP does not distinguish between different activities (or lifestyles), \"all consumption behaviors are not created equal and do not have the same impact on environmental sustainability\". Johan Rockström, director of the Potsdam Institute for Climate Impact Research, noted that \"it's difficult to see if the current G.D.P.-based model of economic growth can go hand-in-hand with rapid cutting of emissions\", which nations have agreed to attempt under the Paris Agreement in order to mitigate real-world impacts of climate change. Some have pointed out that GDP did not adapt to sociotechnical changes to give a more accurate picture of the modern economy and does not encapsulate the value of new activities such as delivering price-free information and entertainment on social media. In 2017 Diane Coyle explained that GDP excludes much unpaid work, writing that \"many people contribute free digital work such as writing open-source software that can substitute for marketed equivalents, and it clearly has great economic value despite a price of zero\", which constitutes a common criticism \"of the reliance on GDP as the measure of economic success\" especially after the emergence of the digital economy. Similarly GDP does not value or distinguish for environmental protection. A 2020 study found that \"poor regions' GDP grows faster by attracting more polluting production after connection to China's expressway system. GDP may not be a tool capable of recognizing how much natural capital agents of the economy are building or protecting."]}, {"page": "Chris Patten", "response": ["Patten submitted his letter of resignation as BBC Trust Chairman to the Secretary of State on 6 May 2014; citing health reasons following his heart bypass surgery on 28 April. BBC Trust Vice Chairman Diane Coyle took over as Acting Chairman until the appointment of a new chairman."]}, {"page": "Coyle", "response": ["*Diane Coyle (born 1961), English economist"]}, {"page": "British-American Project", "response": ["* Diane Coyle, The Independent"]}, {"page": "Noreena Hertz", "response": ["Diane Coyle, for The Independent, called IOU \"another pamphlet disguised as a book\" and opined that \"It pretends to weigh up the details and evidence, but its tone implies that anyone who disagrees is stupid or bad... HIV/Aids, the loss of Amazon rainforests and terrorism [are not] caused by these debts, which is the facile claim Hertz makes.\" Hannah Betts, for The Times, labelled the book \"more than liberal breast-beating - it endeavours to be a psychology of debt... Without ever falling into the pat illiberalisms that the West brought 9/11 and its aftermath on itself, Hertz discusses the ways in which terrorism, disease and ecological meltdown may be the consequences of Third World stagnation.\" Desmond Tutu credited the book with a \"remarkable clarity\" and said it \"puts forward clear recommendations that can and must be taken.\" Writing for the New Statesman he declared: \"IOU should not go unnoticed. When the truth is told about international debt, then we can begin to overcome the scandalous debt slavery of the world's poor.\""]}, {"page": "Benjamin Yeoh", "response": ["Yeoh has directed several plays and has been involved with writing groups and mentorships such as Royal Court Writers, Soho Young Writers, BBC Radio, Moti Roti, Talawa and Yellow Ink. He sat on the board and then as Chair of Talawa Theatre Company for eight years until 2012.  He (as of 2017 and since 2014) is Chair of the London-based theatre company, Coney. Yeoh's podcasthttps://open.spotify.com/show/0G6ujyE9r3SAGd9F6jp2TP has interviewed playwright Mark Ravenhill, actor Sally Phillips, economist Diane Coyle, philosopher Jonathan Wolff."]}, {"page": "Vernon Bogdanor", "response": ["In addition to David Cameron, Bogdanor's former students include Kate Allen, Camilla Cavendish, Diane Coyle, Guy Spier, Toby Young."]}, {"page": "Rory Cellan-Jones", "response": ["Cellan-Jones is married to economist and author Diane Coyle. The couple have two sons and live in West Ealing, London."]}, {"page": "BBC Trust", "response": ["* Diane Coyle – finished two terms as a BBC Trustee and Vice-Chairman of the BBC Trust.", "Following a recruitment process led by the government, Chris Patten was appointed to the role and began a four-year term on 1 May 2011. Patten resigned in May 2014 following heart surgery. He was replaced by the Vice Chairman, Diane Coyle, in an acting capacity until a new Chairman was selected. On 31 August 2014 it was announced that Rona Fairhead would become the new Chairman of the trust."]}, {"page": "National Institute of Economic and Social Research", "response": ["There have been chairs of council since the Institute was created. The first was Lord Stamp, from 1937 to 1942. He was succeeded by Sir Henry Clay, who held the position from 1942 until 1949. Subsequent chairs included Humphrey Mynors, Sir Austin Robinson, Sir John Woods, Sir Robert Hall, Sir Hugh Week, Sir Donald MacDougall, and Sir Kenneth Berrill. Diane Coyle became the first woman to hold the position in the history of the Institute, taking over the position from Sir Tim Besley. Since November 2018, Professor Nicholas Crafts CBE has held the position."]}, {"page": "Joel Mokyr", "response": ["Cambridge economic historian Victoria Bateman wrote, \"In pointing to growth-boosting factors that go beyond either the state or the market, Mokyr's book is very welcome. It could also feed into discussions about the scientific community post-Brexit. By reviving the focus on culture it will, however, prove controversial, particularly among economists.\" However, a fine definitional distinction is to be considered between the ″culture as ideas, socially learned\" and ″culture as inheritance transmitted genetically\". This Economist article makes the distinction clear. The book has also been reviewed favorably by Diane Coyle, Peer Vries, Mark Koyama, Enrico Spolaore, and The Economist. Geoffrey Hodgson criticized the book for placing \"too much explanatory weight\" on \"too few extraordinary people.\""]}, {"page": "Peter J. N. Sinclair", "response": ["Sinclair's most notable former student was David Cameron, who described Sinclair as \"one of the cleverest people I ever met\". Others include King Letsie III, Camilla Cavendish, Peter Conradi, Diane Coyle, Tim Harford, Lieutenant General Michelle D. Johnson, Dave Ramsden, Guy Spier, Abhisit Vejjajiva and a prominent Nepali economist and Asia Times opinion writer Bhim Bhurtel."]}, {"page": "Tanner Lectures on Human Values", "response": ["* 2011-2012 (Brasenose College): Diane Coyle—\"The Public Responsibility of the Economist”"]}, {"page": "2009 New Year Honours", "response": ["* Dr. Diane Coyle. For services to Economics."]}, {"page": "Manchester Independent Economic Review", "response": ["The Review panel is an independent panel of economists and business leaders, led by Sir Tom McKillop, Chairman of the Review panel, Jim O’Neill - Head of Global Economic Research for Goldman Sachs, Professor Edward Glaeser - Fred and Eleanor Glimp Professor of Economics at the University of Harvard, Diane Coyle - Managing Director of Enlightenment Economics and Jonathan Kestenbaum - Chief Executive of NESTA, The National Endowment for Science, Technology and the Arts.  The Reviewers were supported by a Policy Advisory Group and Secretariat, responsible for commissioning the research, providing economic baseline evidence and supporting the researchers and Reviewers.http://www.manchester-review.co.uk/involved/"]}, {"page": "List of University of Oxford people with PPE degrees", "response": ["* Diane Coyle, journalist, economist and vice-chairman of the BBC Trust"]}, {"page": "Browne Review", "response": ["*Diane Coyle – Former Treasury economist"]}, {"page": "Society of Professional Economists", "response": ["Recent annual conferences have featured Ben Broadbent, Sir Charles Bean, Robert Chote, Gavyn Davies, Dame DeAnne Julius, Professor Diane Coyle, Evan Davies, Stephanie Flanders, Professor Philip Lane and Sir Dave Ramsden.", "*Diane Coyle"]}, {"page": "Cecilia Heyes", "response": ["Economist Diane Coyle described Cognitive Gadgets as a new and \"persuasive approach to thinking about decision-makingnot for example as a matter of setting up choices in ways that nudge flawed humans to do the right thing\"."]}, {"page": "Average Is Over", "response": ["Cowen appeared on a Financial Times podcast. Diane Coyle also participated, discussing her own book, and the authors talked about each other's publications as well. The host was Cardiff Garcia."]}, {"page": "100 Women (BBC)", "response": ["| Diane Coyle || Economist, writer and blogger"]}, {"page": "Bourgeois Dignity", "response": ["Diane Coyle wrote a mixed but generally favorable review of the book for the New Statesman."]}, {"page": "Natural Capital Committee", "response": ["*Diane Coyle, Professor of Economics, University of Manchester."]}, {"page": "Chairman of the BBC", "response": ["| style=\"background:#e6e6aa;\" align=center|Diane Coyle"]}]}}